[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami menjadikan kalian (wahai sekalain manusia), sebagai pengganti-pengganti (mereka) di muka bumi setelah generasi yang dibinasakan, agar kami melihat apa yang akan kalian perbuat, kebaikan atau kebutukan, lalu kami memberikan balasan kepada kalian dengan itu sesuai dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Kemudian Kami jadikan kalian -wahai manusia- sebagai pengganti umat-umat kafir yang telah Kami binasakan. Kami hendak melihat bagaimana kalian berbuat. Apakah kalian akan berbuat baik sehingga kalian akan mendapatkan ganjarannya, ataukah kalian akan berbuat jahat sehingga kalian akan dihukum karenanya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Hai manusia, kemudian Kami jadikan kalian khalifah di muka bumi setelah umat-umat yang telah binasa itu, agar Kami menguji kalian dan melihat apa yang kalian perbuat, kebaikan atau keburukan? Kemudian Kami akan membalas perbuatan kalian tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. ثُمَّ جَعَلْنٰكُمْ خَلٰٓئِفَ (Kemudian Kami jadikan kamu pengganti-pengganti) Yakni Kami jadikan kalian penguasa di bumi setelah berlalunya kaum-kaum tersebut yang telah kalian dengar kisah-kisahnya dan kalian lihat peninggalan-peninggalannya. لِنَنظُرَ كَيْفَ تَعْمَلُونَ (supaya Kami memperhatikan bagaimana kamu berbuat) Baik itu perbuatan baik maupun buruk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ketika Umar Al-Faruq membaca ayat ini beliau berkata : Sungguh maha benar Allah, tidaklah Ia menjadikan kita di muka bumi ini sebagai khalifah kecuali ia akan melihat kepada amal perbuatan kita, oleh karena itu berbuatlah kalian untuk Allah sebaik-baik amalan siang dan malam, baik secara zhohir ataupun ketika dalam tertutup."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Wahai manusia, lalu Kami jadikan kalian sebagai pengganti-pengganti orang-orang yang dibinasakan karena kerusakan mereka, supaya Kami bisa melihat bagaimana amal kalian saat itu berupa amal baik atau buruk, lalu Kami akan membalas kalian atas amal perbuatan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami menjadikan kalian sebagai pengganti-pengganti} khalifah {di bumi setelah mereka} setelah generasi yang dibinasakan {agar Kami melihat bagaimana kalian berbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Kemudian Kami menjadikanmu.” Yaitu, orang-orang yang ayat ini ditujukan kepadanya. “Sebagai pengganti-pengganti (mereka) di muka bumi sesudah mereka, supaya Kami memperhatikan bagaimana kamu berbuat.” Jika kamu mengambil pelajaran dan nasihat dari orang-orang sebelummu, mengikuti ayat-ayat Allah, membenarkan rasul-rasulNya, niscaya kamu selamat di dunia dan akhirat. Jika kamu berbuat seperti apa yang diperbuat oleh orang-orang zhalim sebelummu, niscaya Dia menurunkan kepadamu azab yang telah Dia turunkan kepada mereka, dan siapa yang memberi peringatan maka dia telah memiliki (alasan) udzur (di hadapan Allah)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 14: Wahai penduduk Mekah atau orang-orang yang ditujukan pembicaraan kepadanya. Apakah kamu akan mengambil pelajaran terhadap umat-umat yang binasa terdahulu sehingga kamu membenarkan para rasul-Nya atau kamu mengikuti umat-umat itu dengan tetap mendustakan, sehingga kamu akan binasa seperti mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 14",
    "description": "Kemudian kami jadikan kamu, seluruh manusia, sebagai penggantipengganti mereka untuk menjadi pemimpin di bumi setelah mereka binasa, untuk kami lihat bagaimana kamu berbuat, kebaikan atau keburukan. Allah akan memberi pahala orang yang berbuat baik dan menghukum orang yang yang berbuat jahat. Setelah dijelaskan bahwa Allah telah membinasakan orang-orang yang berbuat zalim dan menggantinya dengan kaum yang lain, lalu dijelaskan tentang sikap orang-orang musyrik terhadap ayat-ayat alqur'an. Dan apabila dibacakan walaupun dengan berulang-ulang kepada mereka ayat-ayat kami, Al-Qur'an dengan jelas kebenarannya bahwa ayatayat tersebut datang dari Allah, maka orang-orang yang tidak mengharapkan pertemuan dengan kami, yakni tidak percaya dengan kehidupan akhirat, tidak mengharap pahala dan tidak percaya adanya siksa, mereka berkata, datangkanlah kitab selain Al-Qur'an ini atau gantilah isinya, ubahlah yang haram menjadi halal atau sebaliknya, dan hapuslah ayat-ayat yang mempersalahkan kepercayaan kami. Menjawab permintaan tersebut Allah memerintahkan, katakanlah Muhammad, tidaklah pantas bagiku untuk menggantinya atas kemauanku sendiri, karena aku hanya seorang utusan. Aku hanya mengikuti apa yang diwahyukan Allah kepadaku. Sesungguhnya aku benar-benar takut akan azab hari yang besar, yakni hari kiamat jika aku mendurhakai tuhanku yang aku yakin dia maha mengetahui seluruh ucapan dan perbuatanku."
  }
]