[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dibacakan kepada kaum musyrikin ayat-ayat Allah yang kami turunkan kepadamu (wahai rasul), dengan jelas, berkata orang-orang yang tidak takut terhadap perhitungan amal, dan tidak mengharapkan balasan serta tidak beriman kepada kebangkitan dan dikumpulkannya makhluk setelah itu, ”datangkanlah al-qur’an yang lain dari ini, atau gantilah al-qur’an dengan merubah perkara halal menjadi haram, yang haram menjadi halal, dan janji baik menjadi ancaman, dan ancaman menjadi janji baik, dan kamu hilangkan ayat-ayat yang memuat celaan terhadap sesembahan kami dan pembodohan akal-akal kami,” katakanlah kepada mereka (wahai rasul), ”sesungguhnya hal itu bukanlah tergantung kepadaku.Sesungguhnya pada setiap apa yang aku perintahkan kepada kalian dan apa yang aku larang kalian darinya, aku hanya mengikuti apa yang diwahyuakan kepadaku oleh tuhanku. Sesungguhnya aku takut kepada Allah (bila aku melanggar perintahNya), (bahwa dia akan menimpakan kepadaku) siksaan hari yang besar, yaitu hari kiamat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Apabila dibacakan kepada mereka ayat-ayat Al-Qur`ān yang dengan jelas menunjukkan ke-esaan Allah maka orang-orang yang ingkar kepada hari kebangkitan yang tidak mengharapkan ganjaran dan tidak takut akan hukuman berkata, \"Datangkanlah -wahai Muhammad- Al-Qur`ān lain selain Al-Qur`ān yang ini, yang berisi caci maki terhadap tradisi menyembah berhala. Atau ubahlah Al-Qur`ān ini dengan mengganti beberapa bagiannya atau keseluruhannya dengan hal-hal yang sesuai dengan selera kami.\" Katakanlah -wahai Rasul- kepada mereka, \"Aku tidak berhak mengubahnya, apalagi mendatangkan Al-Qur`ān yang lain. Hanya Allah sajalah yang berhak mengganti bagian mana yang dikehendaki-Nya. Aku tidak bisa berbuat apapun selain mengikuti apa yang diwahyukan Allah kepadaku. Sesungguhnya aku takut -jika aku durhaka kepada Allah dan menuruti permintaan kalian- akan azab di hari yang agung, yaitu hari Kiamat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Allah menjelaskan keingkaran orang-orang kafir yang ingin mempermainkan al-Qur’an: Dan jika kamu bacakan kepada orang-orang kafir al-Qu’ran yang jelas hikmah dan hukum-hukumnya, mereka merasa terganggu, dan para pemimpin mereka yang tidak beriman kepada hari kebangkitan dan tidak mengharap pahala berpaling dan berkata kepada Rasulullah: ‘Datangkanlah kepada kami selain dari al-Qur’an yang kami dengar ini, atau gantilah hukum-hukum dan ayat-ayat di dalamnya yang menghina berhala-berhala!’ Maka Allah mengingkari mereka dengan memerintahkan Rasulullah untuk berkata: ‘Aku tidak berhak mengubahnya sesuai dengan keinginanku, karena aku hanya mengikuti apa yang diperintahkan Tuhanku kepadaku. Aku takut pada azab di hari yang sangat mengerikan jika aku menyelisihi perintah-Nya, yaitu pada hari kiamat’."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَاتُنَا بَيِّنٰتٍ ۙ (Dan apabila dibacakan kepada mereka ayat-ayat Kami yang nyata) Yakni ayat-ayat dalam al-Qur’an yang menunjukkan pengakuan terhadap tauhid dan penolakan terhadap kesyirikan. قَالَ الَّذِينَ لَا يَرْجُونَ لِقَآءَنَا(orang-orang yang tidak mengharapkan pertemuan dengan Kami) Dan mereka adalah orang-orang yang tidak percaya terhadap hari kebangkitan. ائْتِ بِقُرْءَانٍ غَيْرِ هٰذَآ(Datangkanlah Al Quran yang lain dari ini) Yakni selain al-Qur’an yang mengandung penghinaan terhadap penyembahan berhala-berhala. أَوْ بَدِّلْهُ ۚ( atau gantilah dia) Dengan menasakh (menghapus) sebagian ayat atau seluruhnya kemudian diganti dengan ayat lain yang sesuai. قُلْ مَا يَكُونُ لِىٓ (Katakanlah: “Tidaklah patut bagiku) Tidak layak dan tidak halal bagiku. أَنْ أُبَدِّلَهُۥ مِن تِلْقَآئِ نَفْسِىٓ ۖ (untuk menggantinya dari pihak diriku sendiri) Akan tetapi urusan ini ditangan Allah, jika Dia menghendaki untuk menggantinya maka aku tidak memiliki utusan tersebut. إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَىَّ ۖ( Aku tidak mengikut kecuali apa yang diwahyukan kepadaku) Diwahyukan dari sisi Allah, tanpa perubahan atau penggantian. إِنِّىٓ أَخَافُ إِنْ عَصَيْتُ رَبِّى (Sesungguhnya aku takut jika mendurhakai Tuhanku) Dengan melakukan apa yang kalian minta kepadaku seandainya aku benar-benar melakukannya. عَذَابَ يَوْمٍ عَظِيمٍ (kepada siksa hari yang besar) Yakni hari kiamat. Ini merupakan peringatan bagi setiap orang yang mengganti ayat-ayat Allah atau merubah maknanya baik itu karena keinginan atau ketakutan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Dan ketika dibacakan untuk orang-orang kafir ayat-ayat Al-Qur’an yang meneguhkan ketauhidan dan membatalkan kesyirikan, niscaya orang yang tidak berharap bertemu Kami, yaitu orang-orang yang mengingkari akhirat: “Datangkanlah kitab lain selain Al-Qur’an yang keseluruhannya menyalahkan tuhan-tuhan kami dan mencela berhala, atau gantilah (isinya) supaya sesuai dengan tujuan kami dan tidak menyalahkan tuhan kami” Katakanlah kepada mereka Wahai Rasul: “Tidak dibenarkan dan tidak dibolehkan bagiku untuk menggantinya atas kemauan dan keinginanku sendiri karena ini adalah kalam dan wahyu Allah yang telah diturunkan. Allahlah yang (berhak) menggantinya. Aku tidak lain hanyalah menyampaikan yang telah diwahyukan. Sesungguhnya aku takut terhadap azab hari kiamat jika mengganti perintah atau wahyu Tuhanku” Ini adalah penolakan pertama atas permintaan untuk menyesuaikan dan mengganti Al-Qur’an, untuk mulai lebih dekat dengan yang disebutkan dan untuk menyingkat penolakan. Mujahid berkata: “Ayat ini turun terkait orang-orang musyrik Mekah.” Dan Al-Kalaby berkata: “Ayat ini turun terkait orang-orang yang mengolok-olok. Mereka berkata: “Wahai Muhammad, datangkanlah Al-Qur’an selain ini, yang didalamnya terkandung sesuatu yang kami ajukan kepadamu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dibacakan kepada mereka ayat-ayat Kami secara jelas} jelas {orang-orang yang tidak mengharapkan pertemuan dengan Kami berkata,“Datangkanlah} datangkanlah kepada kami {kitab selain Al-Qur’an ini atau gantilah” Katakanlah,“Tidaklah pantas} tidak sepantasnya {bagiku menggantinya atas kemauanku sendiri} atas keinginan diriku {Aku tidak mengikuti, kecuali apa yang diwahyukan kepadaku. Sesungguhnya aku takut akan azab hari yang dahsyat jika mendurhakai Tuhanku.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Allah menyebutkan penentangan orang-orang yang mendustakan RasulNya, Muhammad bahwa jika ayat-ayat Allah yang ada di dalam al-Quran yang menjelaskan kebenaran dibacakan kepada mereka, maka mereka berpaling darinya, mereka menunjukkan penentangan, dengan keberanian dan kezhaliman mereka berkata, “Datangkanlah al-Quran yang lain dari ini atau gantilah ia.” Semoga Allah menimpakan keburukan kepada mereka, betapa beraninya mereka kepada Allah, betapa besarnya kezhaliman dan penolakan mereka terhadap ayat-ayatNYa. Maka Allah memerintahkan Rasulullah yang agung agar menjawab mereka, “Katakalanlah (wahai Muhammad), ‘Tidakkah patut bagiku”, yakni tidak pantas dan tidak layak “menggantinya dari pihak diriku sendiri.” Aku hanya seorang Rasul murni, aku tidak memiliki sesuatu hak pun dari perkara ini, “aku tidak mengikuti kecuali apa yang diwahyukan kepadaku.” Aku tidak memiliki (hak) selain itu karena aku hanyalah seorang hamba yang tunduk. “Sesungguhnya aku takut jika mendurhakai Rabbku kepada siksa hari yang besar (KIamat).” Ini adalah ucapan dan adab makhluk terbaik kepada wahyu dan perintah Rabbnya. Lalu bagaimana dengan orang-orang bodoh yang sesat yang mengumpulkan antara kebodohan, kesesatan, kezhaliman, penentangan, pengingkaran dan pelemahan terhadap Rabbul ‘alamin. Apakah mereka tidak takut azab hari yang besar? Jika mereka mengklaim bahwa maksud mereka adalah agar tersibak kebenaran dengan ayat-ayat yang mereka tuntut maka mereka telah berdusta dalam membuat orang beriman, DIa- lah yang mengaturnya bagaimana Dia berkehendak yang mengikuti kepada hikmah Rabbaniyah dan rahmatNya kepada hamba-hambaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 15: Allah Subhaanahu wa Ta'aala menyebutkan sikap menyusahkan diri orang-orang kafir, di mana ketika dibacakan ayat-ayat Al Qur’an yang menerangkan kebenaran, mereka berpaling darinya dan meminta sesuatu yang menyusahkan diri. Yaitu Al Qur’an. Atau tidak takut terhadap kebangkitan. Inilah yang menyebabkan mereka berani berkata seperti itu. Maksudnya datangkanlah kitab yang baru untuk kami baca yang di dalamnya tidak ada pencelaan kepada sesembahan kami, hal-hal mengenai kebangkitan dari kubur, hidup sesudah mati dan sebagainya. Hal ini menunjukkan beraninya mereka terhadap Allah, zalim serta menolak sekali ayat-ayat-Nya. Mereka menggabung antara kebodohan, kesesatan, kezaliman dan keras kepala serta menyusahkan diri, jika maksud mereka adalah agar diterangkan kebenaran kepada mereka dengan ayat-ayat (bukti-bukti) yang mereka minta maka sesungguhnya mereka telah berdusta, karena Allah telah menerangkan ayat-ayat yang semisalnya seharusnya diimani manusia. Maksudnya gantilah ayat-ayat yang menerangkan siksa dengan ayat-ayat yang menerangkan rahmat, dan yang mencela tuhan-tuhan kami dengan yang memujinya dsb. oleh dirimu sendiri. Dengan merubahnya menurut kemauanku sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 15",
    "description": "Setelah dijelaskan bahwa Allah telah membinasakan orang-orang yang berbuat zalim dan menggantinya dengan kaum yang lain, lalu dijelaskan tentang sikap orang-orang musyrik terhadap ayat-ayat alqur'an. Dan apabila dibacakan walaupun dengan berulang-ulang kepada mereka ayat-ayat kami, Al-Qur'an dengan jelas kebenarannya bahwa ayatayat tersebut datang dari Allah, maka orang-orang yang tidak mengharapkan pertemuan dengan kami, yakni tidak percaya dengan kehidupan akhirat, tidak mengharap pahala dan tidak percaya adanya siksa, mereka berkata, datangkanlah kitab selain Al-Qur'an ini atau gantilah isinya, ubahlah yang haram menjadi halal atau sebaliknya, dan hapuslah ayat-ayat yang mempersalahkan kepercayaan kami. Menjawab permintaan tersebut Allah memerintahkan, katakanlah Muhammad, tidaklah pantas bagiku untuk menggantinya atas kemauanku sendiri, karena aku hanya seorang utusan. Aku hanya mengikuti apa yang diwahyukan Allah kepadaku. Sesungguhnya aku benar-benar takut akan azab hari yang besar, yakni hari kiamat jika aku mendurhakai tuhanku yang aku yakin dia maha mengetahui seluruh ucapan dan perbuatanku. Setelah menolak permintaan kaum musyrik untuk mendatangkan kitab selain Al-Qur'an atau mengubah sebagian isinya, lalu Allah berfirman, katakanlah wahai nabi Muhammad, jika Allah menghendaki aku tidak membacakan dan menyampaikan Al-Qur'an kepada kamu, niscaya aku tidak membacakannya kepadamu dan jika Allah tidak pula berkehendak memberitahukan wahyu yang diturunkan kepadaku, maka dia tidak memberitahukannya kepadamu. Aku telah tinggal bersamamu beberapa lama sebelumnya, yakni selama 40 tahun sebelum turunnya alqur'an dan selama masa itu aku tidak pernah berbohong serta tidak pernah berbicara dan menyampaikan hal seperti ini. Apakah kamu tidak mengerti ayat-ayat itu dan tidak memikirkan kandungannya'"
  }
]