[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai rasul), ”jikalau Allah menghendaki, aku tidak akan membaca al-qur’an ini kepada kalian dan Allah tidak (pula) memberitahukannya kepada kalian, maka ketahuilah bahwa sesungguhnya ia adalah kebenaran dari Allah. Sesungguhnya kalian tahu bahwa aku telah hidup bersama kalian dalam masa yang panjang sebelum tuhanku menurunkan wahyu kepadaku, dan sebelum aku membacakannya kepada kalian. Maka apakah kalian tidak mempergunakan akal kalian untuk menghayati dan memikirkannya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Katakanlah -wahai Rasul-, \"Sekiranya Allah menghendaki agar aku tidak membacakan Al-Qur`ān kepada kalian, pasti aku tidak akan membacakannya kepada kalian dan tidak menyampaikannya kepada kalian. Dan sekiranya Allah menghendaki pasti Dia tidak akan memberitahukan perihal Al-Qur`ān kepada kalian melalui lisanku. Karena aku telah tinggal di tengah-tengah kalian dalam kurun waktu yang lama -yaitu 40 tahun- sementara aku tidak bisa membaca dan menulis, dan akupun tidak pernah menuntut dan mencari masalah ini. Tidakkah kalian bisa mengerti dengan akal sehat kalian bahwa apa yang kubawa ke hadapan kalian ini berasal dari Allah, dan tidak ada campur tangan sedikitpun dariku?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Dan katakanlah kepada mereka: “Andai Allah menghendaki, aku tidak akan membacakan al-Qur’an ini kepada kalian dan aku tidak menyampaikannya pada kalian dengan lisanku ini. Dahulu aku telah tinggal bersama kalian dalam waktu lama, yaitu selama 40 tahun sebelum turunnya al-Qur’an. Tidakkah kalian memahami kebenaran untuk diikuti?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. قُل لَّوْ شَآءَ اللهُ مَا تَلَوْتُهُۥ عَلَيْكُمْ (Katakanlah: “Jikalau Allah menghendaki, niscaya aku tidak membacakannya kepadamu) Jika Allah menghendaki maka aku tidak akan membacakannya kepada kalian dan tidak menyampaikannya. وَلَآ أَدْرَىٰكُم بِهِۦ (dan Allah tidak (pula) memberitahukannya kepadamu) Yakni seandainya Allah berkehendak maka aku tidak akan mengajari kalian al-Qur’an dengan lisanku ini. فَقَدْ لَبِثْتُ فِيكُمْ عُمُرًا مِّن قَبْلِهِۦٓ ۚ (Sesungguhnya aku telah tinggal bersamamu beberapa lama sebelumnya) Yakni sejak waktu yang lama, yaitu selama 40 tahun, sebelum al-Qur’an ini diturunkan, kalian telah mengenalku sebagai orang yang jujur dan amanah, dan aku bukan orang yang dapat membaca atau menulis, aku juga tidak dapat membaca kitab-kitab yang diturunkan kepada para rasul sebelumku dan tidak memperlajarinya dari pemiliknya, kemudian aku datang kepada kalian dengan membawa al-Qur’an yang kalian tidak dapat mendatangkan yang semisalnya walau hanya satu surat, dan kalian tidak dapat membantahnya padahal kalian terkenal dengan kefasihan dalam bahasa arab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Dan penolakan kedua terkait permintaan untuk mendatangkan selain Al-Qur’an yaitu katakanlah kepada mereka wahai Rasul: “Jika Allah menghendaki agar aku tidak membacakan dan tidak menyampaikannya kepada kalian, niscaya aku akan melakukannya. Dan jika Dia berkehendak, aku tidak akan memberitahu kalian tentang Al-Qur’an. Sungguh aku telah tinggal bersama kalian dalam waktu yang lama sebelum turunnya Al-Qur’an, yaitu 40 tahun, kalian tidak pernah mendustakanku. Aku pun tidak mampu untuk mengeluarkan kalam seperti ini (Al-Qur’an) karena aku tidak punya kemampuan untuk membaca kitab-kitab yang diturunkan kepada para rasul. Kemudian Allah memberikan wahyu kepadaku kitab yang kalian rintangi dengan membantahnya dan isi surahnya, sedangkan kalian itu ahli fashahah dan balaghah, yang mana hal itu menunjukkan bahwa Al-Qur’an adalah kalam Allah. Apakah kalian tidak menyadarinya dengan akal kalian bahwa Al-Qur’an ini dari sisi Allah, bukan dariku?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Jika Allah menghendaki, maka aku tidak membacakannya kepada kalian dan Allah tidak memberitahukannya kepada kalian} Allah tidak memberitahu tentang Al-Qur’an kepada kalian melalui lisanku {Sungguh aku telah tinggal} aku telah tinggal {bersama kalian beberapa waktu} waktu yang lama {sebelumnya turunnya Al-Qur’an} sebelum turunnya Al-Qur’an {Apakah kalian tidak berpikir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Katakanlah (wahai MUahammad), ‘Jikalau Allah menghendaki, niscaya aku tidak membacakannya kepadamu dan Allah tidak (pula) memberitahukannya kepadamu.” Sesungguhnya aku telah tinggal bersamamu beberapa lama.” Dengan waktu yang cukup panjang “sebelumnya (al-Quran turun).” Yakni sebelum membacakannya dan sebelum kamu mengetahuinya sementara aku sendiri tidak terlintas di benakku dan tidak terpikir di pikiranku. “Maka apakah kamu tidak memikirkannya?” bahwa aku tidak mengada-adakannya seumur hidupku dan tidak pula bersumber dariku apa yang menunjukkan hal itu, lalu bagaimana mungkin aku mengada-adakannya sesudah itu, sementara aku telah hidup lama di lingkunganmu, kamu mengenal keadaanku yang sebenarnya bahwa aku adalah ummi tak membaca, tak menulis, tak belajar dari siapa pun, lalu aku hadir kepadamu dengan kitab yang agung yang melemahkan orang-orang yang fasih dan melelahkan para ulama. Apakah dengan itu masih mungkin bahwa ia adalah bersumber dariku sendiri? Atau justru ia adalah dalil yang pasti bahwa ia adalah diturunkan dari Dzat Yang Mahabijaksana lagi Mahaterpuji? Jika kamu memakai pikiran dan akalmu, kamu merenungkan keadaanku dan keadaan kitab ini niscaya kamu pasti memastikan tanpa keraguan bahwa ia adalah benar, bahwa ia adalah kebenaran yang tidak ada (sesuatu) setelahnya melainkan kesesatan, akan tetapi kamu hanya menginginkan pendustaan dan penentangan, tanpa ragu kamu adalah orang-orang yang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 16: Maksudnya empat puluh tahun sebelum Al Quran diturunkan dan tidak menyampaikan apa-apa, lalu apakah setelah diturunkan Al Qur’an saya berani mengada-ada, padahal saya tinggal di dekatmu dalam waktu yang lama, di mana kalian mengetahui hakikat keadaanku; aku tidak mengenal baca-tulis, tidak pernah belajar dan menimba ilmu dari seorang pun, lalu aku datanng kepadamu membawa kitab agung yang mengalahkan para ahli bahasa, mengalahkan semua ahli ilmu, sehingga apakah mungkin Al Qur’an dari sisiku, bukankah yang demikian menunjukkan bahwa Al Qur’an turun dari Tuhan yang Mahabijaksana lagi Maha Terpuji? Bahwa Al Qur’an bukan dari sisiku. Kalau sekiranya kamu mau menggunakan akal pikiranmu, dan merenungi keadaanku dan keadaan kitab ini, tentu kamu akan membenarkanku, dan jika kamu menolaknya, bahkan mendustakan dan tetap keras kepala, maka tidak diragukan lagi, kamu adalah orang-orang zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 16",
    "description": "Setelah menolak permintaan kaum musyrik untuk mendatangkan kitab selain Al-Qur'an atau mengubah sebagian isinya, lalu Allah berfirman, katakanlah wahai nabi Muhammad, jika Allah menghendaki aku tidak membacakan dan menyampaikan Al-Qur'an kepada kamu, niscaya aku tidak membacakannya kepadamu dan jika Allah tidak pula berkehendak memberitahukan wahyu yang diturunkan kepadaku, maka dia tidak memberitahukannya kepadamu. Aku telah tinggal bersamamu beberapa lama sebelumnya, yakni selama 40 tahun sebelum turunnya alqur'an dan selama masa itu aku tidak pernah berbohong serta tidak pernah berbicara dan menyampaikan hal seperti ini. Apakah kamu tidak mengerti ayat-ayat itu dan tidak memikirkan kandungannya' karena mereka tetap keras menolak kebenaran Al-Qur'an sebagai wahyu dari Allah dan menuduh nabi Muhammad berbohong, maka ditegaskan dalam bentuk pertanyaan, siapakah yang lebih zalim daripada orang yang dengan sengaja mengada-adakan kebohongan terhadap Allah atau mendustakan ayat-ayat-Nya' sungguh tidak ada orang yang lebih zalim daripada mereka dan mereka tidak akan mendapatkan keberuntungan untuk selama-lamanya. Sesungguhnya orang-orang yang berbuat dosa itu tidak akan pernah beruntung."
  }
]