[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik itu menyembah selain Allah, sesuatu yang tidak dapat mendatangkan mudarat kepada mereka sedikitpun dan tidak dapat memberikan manfaat bagi mereka di dunia dan akhirat. Dan mereka berkata, ”kami menyembah mereka agar mereka memberikan syafaat bagi kami di sisi Allah.” katakanlah kepada mereka (wahai rasul), ”apakah kalian mau memberitahukan kepada Allah sesuatu yang tidak diketahuiNya tentang perkara para pemberi syafaat di langit dan di bumi? Karena sesungguhnya kalaulah pada keduanya ada yang akan memberikan syafaat bagi kalian di sisiNya, maka pastilah Dia lebih tahu tentang mereka daripada kalian.” Allah maha suci dari apa yang diperbuat kaum musyrikin berupa tindakan kesyirikan mereka dalam beribadah kepadaNya dengan menyembah apa yang tidak dapat menimpakan mudarat maupun mendatangkan manfaat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Orang-orang musyrik itu menyembah tuhan-tuhan palsu selain Allah yang tidak dapat mendatangkan manfaat maupun mudarat. Sedangkan Tuhan yang berhak disembah dapat mendatangkan manfaat dan mudarat kapan saja menurut kehendak-Nya. Dan mereka berkata tentang tuhan-tuhan yang mereka sembah, \"Mereka itu adalah perantara yang membantu kepentingan kami di sisi Allah, sehingga kami tidak disiksa karena dosa-dosa kami.\" Katakanlah -wahai Rasul- kepada mereka, \"Apakah kalian hendak memberitahu Allah Yang Maha Mengetahui itu bahwa Dia memiliki sekutu, dan Dia tidak tahu bahwa Dia memiliki sekutu di langit dan di bumi?!\" Maha Suci Allah dari semua kebatilan dan kebohongan yang dikatakan oleh orang-orang musyrik itu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Orang-orang musyrik itu menyebah berhala-berhala yang tidak dapat mendatangkan mudharat bagi mereka jika mereka tidak menyembahnya, tidak mampu menolak mudharat yang akan mendatangi mereka, dan tidak dapat mendatangkan manfaat bagi mereka. Mereka berkata untuk membenarkan perbuatan mereka itu: “Berhala-berhala itu kami sembah agar dapat memberi kami syafaat di sisi Allah.” Hai Rasulullah, katakanlah kepada mereka untuk mengolok dan mengingkari mereka: “Apakah kalian memberitahu Allah sesuatu yang tidak Dia ketahui mengenai berhala-berhala itu di langit dan di bumi? Dia Maha Mengetahui segala hal ghaib dan Maha Suci dari segala keyakinan dan kedustaan orang-orang musyrik.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَيَعْبُدُونَ مِن دُونِ اللهِ (Dan mereka menyembah selain daripada Allah) Yakni selain beribadah kepada Allah juga beribadah kepada selain-Nya, dan bukan berarti tidak menyembah Allah sama sekali. مَا لَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ(apa yang tidak dapat mendatangkan kemudharatan kepada mereka dan tidak (pula) kemanfaatan) Dan seharusnya sesuatu yang disembah dapat memberi manfaat atau mudharat dengan kehendaknya, jika tidak maka apa faidah yang didapat dari penyembahannya. وَيَقُولُونَ هٰٓؤُلَآءِ شُفَعٰٓؤُنَا عِندَ اللهِ ۚ( dan mereka berkata: “Mereka itu adalah pemberi syafa’at kepada kami di sisi Allah”) Mereka mengaku bahwa sesembahan mereka dapat memberi syafaat bagi mereka di sisi Allah, sehingga Dia tidak mengazab mereka akibat dosa-dosa mereka. Mereka juga mengaku bahwa sesembahan mereka merupakan perantara mereka kepada Allah untuk memperbaiki urusan duniawi mereka. قُلْ أَتُنَبِّـُٔونَ اللهَ بِمَا لَا يَعْلَمُ فِى السَّمٰوٰتِ وَلَا فِى الْأَرْضِ (Katakanlah: “Apakah kamu mengabarkan kepada Allah apa yang tidak diketahui-Nya baik di langit dan tidak (pula) dibumi?”) Yakni Allah tidak mengakui bagi diri-Nya bahwa Dia memiliki sekutu atau memberi syafaat dari kalangan makhluk-makhluk-Nya tanpa izin dari-Nya baik di langit maupun di bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Orang-orang musyrik menyembah kepada selain Allah, yaitu berhala dan patung, sesuatu yang tidak membahayakan mereka jika tidak disembah dan tidak memberi manfaat jika disembah, karena benda-benda tersebut merupakan benda-benda mati yang tidak memberi mahdharat maupun manfaat. Kebenaran dan akal menentukan bahwa yang layak disembah adalah Dzat yang mampu memberi manfaat dan mahdharat. Tidak berfaidah menyembah sesuatu jika lemah. Mereka beranggapan bahwa berhala dan patung itu akan menyelamatkan mereka di sisi Allah saat di akhirat. Katakanlah kepada mereka wahai Rasul: “Apakah kalian akan memberitahu Allah tentang sesuatu yang tidak Dia ketahui di langit dan bumi? Dimana DIa tidak mengetahui sekutu dan penyelamat yang ada bersamaNya. Maha suci Allah dari sekutu dalam kerajaanNya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menyembah selain Allah sesuatu yang tidak dapat mendatangkan mudarat kepada mereka dan tidak memberi manfaat. Mereka berkata,“Mereka itu adalah penolong-penolong kami} perantara kami {di hadapan Allah. Katakanlah,“Apakah kalian akan memberitahukan kepada Allah sesuatu yang tidak Dia ketahui} apakah kalian akan memberitahu Allah bahwa Dia memiliki sekutu. Dan Dia tidak tahu bahwa Dia mempunyai sekutu {di langit dan di bumi” Maha suci dan Maha tinggi Dia dari apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Allah berfirman, “Dan mereka menyembah”, yaitu orang-orang musyrik yang mendustakan Rasulullah “selain dari Allah apa yang tidak dapat mendatangkan kemudaratan kepada mereka dan tidak (pula) kemanfaatan.” Yakni ia tidak memiliki sedikit pun manfaat untuk mereka dan tidak menolak apa pun dari mereka. “Dan mereka berkata”, dengan ucapan kosong tanpa bukti, “Mereka itu adalah pemberi syafaat kepada kami di sisi Allah.” Mereka menyembahnya agar bisa mendekatkannya kepada Allah dan memberi syafaat kepada mereka di sisiNya. Ini adalah ucapan yang mereka ada-adakan dari diri mereka sendiri, ucapan yang mereka buat-buat. Oleh karena itu, Allah berfirman membatalkan ucapan tersebut, “Katakanlah, ‘Apakah kamu mengabarkan kepada Allah apa yang tidak diketahuiNya, baik di langit dan tidak (pula) di bumi?‘“ maksudnya, Allah Maha Mengetahui dengan ilmu yang meliputi apa yang ada di langit dan di bumi, Dia telah mengabarkan kepadamu bahwa Dia tidak memiliki sekutu dan bahwa tidak ada Rabb bersamaNya. Kamu wahai orang-orang musyrik menyampaikan berita yang samar padahal kamu mengetahuinya? Siapa yang lebih tahu, Allah ataukah kamu? Adakah ucapan yang lebih batil daripada ucapan yang mengandung kesimpulan bahwa orang-orang bodoh lagi sesat itu lebih tahu daripada Allah Rabbul ‘alamin? Cukuplah bagi orang yang berakal dengan hanya membayangkan pendapat ini, karena ia dipastikan batil dan rusak. “Mahasuci Allah dan Mahatinggi dari apa yang mereka persekutukan (itu).” Maksudnya, Mahasuci Allah, Dia tidak memiliki partner atau sekutu, akan tetapi Dia adalah Maha Esa, tempat bergantung para makhluk, tiada Rabb di langit dan di bumi melainkan Dia, semua yang disembah di langit dan di bumi selainNya adalah batil secara akal, syara’ dan fitrah, \"(Kuasa Allah) yang demikian itu, adalah karena sesungguhnya Allah, Dialah (Tuhan) Yang Haq dan sesungguhnya apa saja yang mereka seru selain dari Allah, itulah yang batil, dan sesungguhnya Allah, Dialah Yang Maha Tinggi lagi Maha Besar.\" (Al-Hajj:62)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 18: Jika mereka tidak menyembahnya. Jika mereka menyembahnya, seperti patung dan berhala. Kalimat ini adalah ejekan terhadap orang-orang yang menyembah berhala, yang menyangka bahwa berhala-berhala itu dapat memberi syafaat Allah. Kalimat pertanyaan ini disebut istifham ingkar, yakni pertanyaan untuk mengingkari, karena jika Allah memiliki sekutu, tentu Dia mengetahui dan tidak samar bagi-Nya, dan lagi Dia telah memberitahukan, bahwa Diri-Nya tidak memiliki sekutu dan tidak ada tuhan selain-Nya. Apakah mereka lebih tahu ataukah Allah? Dari memiliki sekutu atau tandingan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 18",
    "description": "Setelah dijelaskan kerugian yang akan diperoleh oleh orang yang berbuat zalim karena ingkar terhadap ayat-ayat Al-Qur'an, lalu dijelaskan bentuk lain dari kezaliman mereka yaitu syirik. Dan mereka menyembah selain Allah, sesuatu yang dijadikan sembahan yang tidak dapat mendatangkan bencana kepada mereka, apabila mereka tidak menyembahnya, dan tidak pula memberi manfaat dan tidak bisa menolak madarat ketika mereka menyembahnya, dan mereka dengan yakin berkata, mereka berhala dan sembahan kami lainnya itu adalah pemberi syafaat kami di hadapan Allah. Padahal sembahan tersebut tidak mampu mendatangkan manfaat atau menolak madarat atas diri mereka sendiri. Penyembahan terhadap selain Allah sebagaimana yang dilakukan oleh orang-orang musyrik adalah sebuah penyimpangan yang tidak dikenal pada awal kehidupan manusia, karena manusia diciptakan dalam keadaan fitrah. Ayat ini menegaskan bahwa dan manusia itu dahulunya hanyalah satu umat, mereka semuanya tunduk dan patuh kepada Allah, kemudian mereka terkena godaan setan sehingga berselisih, yakni ada yang tetap taat dan ada yang durhaka bahkan mereka terpecah menjadi kelompok-kelompok yang berbeda keyakinan. Kalau tidak karena suatu ketetapan yang telah ada dari tuhanmu, bahwa perselisihan manusia di dunia itu akan diputuskan di akhirat, pastilah telah diberi keputusan di antara mereka ketika di dunia ini, tentang apa yang mereka perselisihkan itu."
  }
]