[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dahulu manusia berada di atas ajaran agama yang satu, yaitu islam. Kemudian mereka berselisih setelah itu. sebagain dari mereka menjadi kafir dan sebagain yang lain tetap teguh di atas kebenaran. kalaulah bukan karena ketetapan dari Allah yang telah berlalu untuk memberikan penundaan (siksaan) bagi orang yang bermaksiat dan tidak segera menghukum mereka karena dosa-dosa mereka, pastilah mereka akan diputuskan, dengan membinasakan orang-orang yang berada di atas kebatilan dari mereka dan menyelamatkan para pengikut kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan tidaklah umat manusia ini dahulu melainkan satu umat yang beriman dan bertauhid. Kemudian mereka berselisih paham. Sebagian dari mereka tetap beriman. Dan sebagian lainnya berubah menjadi kafir. Sekiranya tidak ada ketentuan yang telah Allah tetapkan sebelumnya -bahwa Dia tidak akan memutus perselisihan mereka di dunia melainkan di Hari Kiamat- pasti Dia telah memutus perselisihan mereka di dunia, sehingga dapat diketahui dengan jelas siapa yang berada di jalan yang benar dan siapa yang tersesat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Allah menegaskan bahwa seluruh manusia dahulu berada dalam agama Islam, kemudian muncul kekafiran di antara mereka dan sebagian lain tetap di atas kebenaran. Kalaulah bukan karena ketetapan Allah untuk menangguhkan azab bagi orang-orang kafir hingga hari kiamat, niscaya Allah akan menyelesaikan perkara di antara mereka dalam hal azab bagi orang-orang kafir yang disegerakan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَمَا كَانَ النَّاسُ إِلَّآ أُمَّةً وٰحِدَةً (Manusia dahulunya hanyalah satu umat) Yakni semua mentauhidkan Allah dan beriman kepada-Nya. فَاخْتَلَفُوا۟ ۚ (kemudian mereka berselisih) Kemudian sebagian mereka menjadi kafir dan sebagian lainnya beriman sehingga mereka saling berselisih. وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ (Kalau tidaklah karena suatu ketetapan yang telah ada dari Tuhanmu dahulu) Yakni bahwa Allah tidak memberi keputusan dalam perselisihan mereka kecuali di hari kiamat. لَقُضِىَ بَيْنَهُمْ(pastilah telah diberi keputusan di antara mereka) Di dunia. فِيمَا فِيهِ يَخْتَلِفُونَ(tentang apa yang mereka perselisihkan itu) Akan tetapi Allah tidak melakukan hal tersebut karena telah ada ketetapan yang tidak berubah. Pendapat lain mengatakan bahwa Allah tidak menghukum seseorang kecuali dengan alasan atau hujjah, yaitu dengan mengutus para Rasul, sebagaimana firman Allah: وما كنا معذبين حتى نبعث رسولا “dan Kami tidak akan mengazab sebelum Kami mengutus seorang rasul”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Secara fitrah manusia itu hanyalah satu umat yang bertauhid dan beriman kepada Allah serta berada pada satu agama yang benar, kemudian mereka saling bertentangan sehingga sebagian ada yang beriman dan kafir. Jika tidak telah berlalu janji Allah untuk menangguhkan azab sampai hari kiamat, niscaya akan ditentukan hukum di antara mereka di dunia tentang sesuatu yang mereka pertentangkan, lalu orang-orang yang bathil akan dibinasakan dan orang-orang mukmin akan diselamatkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Manusia itu dahulunya tidak lain melainkan umat yang satu} dalam agama yang satu yaitu agama Islam {lalu mereka berselisih} lalu mereka terpisah menjadi mukmin dan kafir {Jika tidak karena suatu ketetapan dari Tuhanmu} janji Tuhanmu dengan menangguhkan ketatapan di antara paraa hamba sampai hari kiamat {Sungguh telah diputuskan di antara mereka tentang apa yang mereka perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Manusia dahulunya hanyalah satu umat”, mereka bersepakat pada agama yang benar, akan tetapi (setelah itu) mereka berelisih, maka Allah mengutus para nabi, sebagai pemberi peringatan, dan Allah menurunkan bersama mereka Kitab yang benar, untuk memberi keputusan di antara manusia tentang perkara yang mereka perselisihkan. “Kalau bukanlah karena suatu ketetapan yang telah ada dari Rabbmu dahulu”, dengan memberikan tempo kepada orang-orang yang durhaka dan tidak menyegerakan azab kepada mereka, “pastilah telah diberi keputusan di antara mereka”, dengan menyelamatkan orang-orang Mukmin dan membinasakan orang-orang kafir yang mendustakan, dan itu menjadi pembeda antara mereka “tentang apa yang mereka perselisihkan itu.” Akan tetapi Dia ingin menguji sebagian dari mereka dengan sebagian yang lain agar jelas mana yang benar dan mana yang dusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 19: Di atas agama yang satu, yaitu Islam dari sejak Nabi Adam sampai Nabi Nuh ‘alaihimas salam. Ada pula yang mengatakan, dari sejak zaman Ibrahim sampai zaman ‘Amr bin Luhay. Setelah manusia berkembang biak dan kepentingan mereka berlainan, timbullah berbagai kepercayaan yang menimbulkan perpecahan. oleh karena itu Allah mengutus Rasul yang membawa wahyu untuk memberi petunjuk kepada mereka. Baca juga ayat 213 surat Al-Baqarah. Yakni sebagian mereka tetap di atas agama tauhid, sedangkan sebagian lagi tidak. Ketetapan Allah itu ialah bahwa, perselisihan manusia di dunia itu akan diputuskan dan diberi pembalasan di akhirat. Yaitu dengan diselamatkan-Nya orang-orang mukmin dan diazab-Nya orang-orang kafir. Akan tetapi, Dia ingin menguji mereka agar nampak jelas siapa yang jujur imannya dan siapa yang berdusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 19",
    "description": "Penyembahan terhadap selain Allah sebagaimana yang dilakukan oleh orang-orang musyrik adalah sebuah penyimpangan yang tidak dikenal pada awal kehidupan manusia, karena manusia diciptakan dalam keadaan fitrah. Ayat ini menegaskan bahwa dan manusia itu dahulunya hanyalah satu umat, mereka semuanya tunduk dan patuh kepada Allah, kemudian mereka terkena godaan setan sehingga berselisih, yakni ada yang tetap taat dan ada yang durhaka bahkan mereka terpecah menjadi kelompok-kelompok yang berbeda keyakinan. Kalau tidak karena suatu ketetapan yang telah ada dari tuhanmu, bahwa perselisihan manusia di dunia itu akan diputuskan di akhirat, pastilah telah diberi keputusan di antara mereka ketika di dunia ini, tentang apa yang mereka perselisihkan itu. Setelah dijelaskan perselisihan yang terjadi diantara umat manusia, lalu kembali dijelaskan tentang tuntutan orang musyrik agar Allah memberikan mujizat yang kasat mata kepada nabi Muhammad. Dan mereka berkata, mengapa tidak diturunkan kepadanya (Muhammad) suatu bukti, yakni mukjizat dari tuhannya, yakni mukjizat yang dapat diindra' padahal mujizat seperti yang mereka minta sesungguhnya telah diturunkan kepada para nabi sebelum nabi Muhammad, tetapi umat para nabi tersebut tetap ingkar. Katakanlah, wahai nabi Muhammad sungguh, segala yang gaib itu hanya milik Allah; sebab itu tunggu sajalah olehmu, apakah Allah akan mengabulkan permintaanmu atau tidak. Allah maha mengetahui apa yang terbaik untuk hambanya. Ketahuilah, sesungguhnya aku juga menunggu bersama kamu, apa keputusan Allah untuk kita semua."
  }
]