[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah merupakan suatu perkara yang mengherankan bagi manusia, bila kami menurunkan wahyu berupa al-qur’an kepada seorang lelaki dari mereka, yang memperingatkan mereka dari siksaan Allah, dan memberikan kabar gembira kepada orang-orang yang beriman kepada Allah dan para rasulNya, bahwa bagi mereka pahala yang baik atas apa yang telah mereka perbuat sebelumnya berupa amal shalih? maka ketika rasul Allah datang kepada mereka dengan membawa wahyu Allah dan membacakannya kepada mereka, orang-orang yang ingkar berkata, ”sesungguhnya Muhammad itu tukang sihir, dan apa yang dia bawa merupakan sihir yang nyata kebatilannya, ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Patutkah manusia merasa heran bahwa Kami menurunkan wahyu kepada salah seorang dari bangsa mereka seraya memerintahkannya memberi peringatan kepada mereka tentang siksa Allah?! Dan sampaikanlah kabar gembira -wahai Rasul- kepada orang-orang yang beriman kepada Allah, bahwa mereka akan mendapatkan tempat yang tinggi di sisi Tuhan mereka, sebagai balasan atas amal saleh yang telah mereka kerjakan. Orang-orang kafir berkata, \"Sesungguhnya orang yang membawa ayat-ayat ini adalah seorang penyihir yang sangat nyata sihirnya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah mengingkari orang-orang kafir Makkah yang mengingkari risalah Rasulullah: “Apakah hal yang mengherankan bagi orang-orang musyrik Makkah, jika Kami memberi Rasulullah al-Qur’an, padahal dia dari kaum mereka? Al-Qur’an ini sebagai peringatan bagi jin dan manusia dari neraka, dan sebagai pemberi kabar gembira bagi orang-orang beriman bahwa mereka akan mendapatkan kedudukan yang tinggi dan surga yang berharga dari Tuhan mereka.” Ketika orang-orang yang mendustakan Allah dan Rasul-Nya mendengar ayat-ayat al-Qur’an, mereka berkata: “Muhammad hanyalah tukang sihir yang mahir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. أَكَانَ لِلنَّاسِ عَجَبًا (Patutkah menjadi keheranan bagi manusia bahwa Kami mewahyukan kepada seorang laki-laki di antara mereka: “Berilah peringatan kepada) Ini merupakan pengingkaran terhadap keheranan mereka terhadap turunnya wahyu, serta olokan bagi orang-orang yang berpaling dari al-Qur’an. Maksud dari ayat ini adalah apakah wahyu yang Kami turunkan kepadamu merupakan sesuatu yang mengherankan bagi manusia? إِلَىٰ رَجُلٍ مِّنْهُمْ (kepada seorang laki-laki di antara mereka) Padahal wahyu yang diturunkan kepada seseorang dari kaum kalian tidak mengandung sesuatu yang menimbulkan keheranan, karena tidak ada yang menyampaikan sesuatu dari Allah kepada manusia kecuali harus seorang manusia juga, karena jika yang menyampaikan kepada mereka adalah malaikat atau jin maka tidak akan sampai pada tujuan turunnya wahyu tersebut sebab manusia tidak dapat berinteraksi dengan malaikat atau jin. Dan Rasulullah sebelum dipilih Allah sebagai Rasul telah memiliki sifat-sifat yang sempurna menurut kaum Quraisy sehingga dijuluki sebagai al-Amiin, maka tidak ada yang merngherankan jika beliau diutus sebagai Rasul. أَنْ أَنذِرِ النَّاسَ(Berilah peringatan kepada manusia) Yakni sampaikan kepada mereka peringatan yang ada dalam surat ini. قَدَمَ صِدْقٍ (mempunyai kedudukan yang tinggi) Yakni derajat kebenaran dan kedudukan yang tinggi. Pendapat lain mengatakan, memiliki kemuliaan yang tinggi dan yang pertama-tama dalam kebenaran. Pendapat lain mengatakan, yakni segala kebaikan yang dilakukan; yakni mereka mempunyai amal-amal kebaikan yang mereka persembahkan untuk hari kebangkitan. قَالَ الْكٰفِرُونَ إِنَّ هٰذَا (Orang-orang kafir berkata: sesungguhnya ini) Yakni orang ini benar-benar tukang sihir yang nyata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Apakah pemberian wahyu Kami berupa Al-Qur’an itu patut menjadi sebab keheranan orang-orang musyrik Arab? Dalam hal itu tidak ada yang mengherankan, yaitu pemberian wahyu kepada laki-laki dari golongan mereka, yaitu golongan manusia. Seakan-akan mereka menginginkan seorang rasul dari selain golongan mereka, sekalipun dari malaikat atau jin ketika tujuan penyampaian risalah itu telah sampai, (hal itu) karena mereka melupakannya. Kami berfirman kepada lelaki yang sudah diketahui kejujurannya ini supaya memperingatkan manusia yang bermaksiat dengan neraka dan memberi kabar gembira orang-orang yang mengimani Al-Qur’an ini bahwa mereka akan mendapat tempat yang tinggi di sisi Tuhan. Dan tatkala orang-orang kafir mendengar sebagian ayat-ayat Al-Qur’an, maka mereka berkata: “Sesungguhnya lelaki ini (yaitu Muhammad SAW) adalah penyihir yang jelas lagi nyata.” Ibnu Abbas berkata: “Ketika Allah mengutus nabi Muhammad SAW sebagai seorang rasul, bangsa Arab mengingkari hal itu, atau sebagian orang mengingkari itu dan berkata: “Allah Maha Agung dari perkara mengangkat rasul dari golongan manusia seperti Muhammad” Lalu Allah yang Maha Luhur dan Maha Agung menurunkan ayat {A kaana linnasi ‘ajaban ..}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pantaskah menjadi keheranan bagi manusia bahwa Kami mewahyukan kepada seorang laki-laki di antara mereka} dari jenis mereka {untuk memberi peringatan kepada manusia dan memberi kabar gembira kepada orang-orang yang beriman bahwa bagi mereka itu kedudukan yang tinggi} tempat yang tinggi melalui amal yang dahulu mereka kerjakan {di sisi Tuhan mereka” Orang-orang kafir berkata,“Sesungguhnya dia ini benar-benar seorang penyihir yang nyata.” (2)} yang tampak sihirnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Meskipun demikian, kebanyakan mereka berpaling, maka mereka tidak mengetahui, mereka heran, “bahwa Kami mewahyukan kepada seorang laki-laki di antara mereka, ‘Berilah peringatan kepada manusia,” terhadap azab Allah, takut-takutilah mereka dengan siksaNya dan ingatkanlah mereka dengan ayat-ayat Allah, “dan gembirakanlah orang-orang beriman”, dengan iman yang benar, “bahwa mereka mempunyai kedudukan yang tinggi di sisi Rabb mereka.” Maksudnya mereka mempunyai balasan yang melimpah dan pahala yang tersimpan di sisi Allah karena amal-amal shalih yang benar yang mereka kerjakan dahulu. Orang-orang kafir merasa heran terhadap orang agung ini dengan keheranan yang membuat mereka mengingkarinya. “Orang-orang kafir berkata,” yaitu tentangnya “Sesungguhnya orang ini (Muhammad) benar-benar adalah tukang sihir yang nyata.” Yakni dengan sihir yang jelas, tidak samar bagi siapa pun menurut mereka. Ini adalah kebodohan dan pengingkaran mereka. Mereka merasa heran terhadap suatu perkara yang tidak layak dianggap suatu keheranan dan keanehan. Padahal seharusnya yang dianggap suatu yang mengherankan itu justru kebodohan mereka terhadap kemaslahatan mereka, bagaimana (mungkin bisa terjadi) mereka tidak beriman kepada Rasulullah yang mulia yang diutus oleh Allah dari kalangan mereka sendiri. Mereka benar-benar mengenalnya, akan tetapi menentang dakwahnya dan berusaha membatalkan agamanya. Allah akan tetap menyempurnakan cahayaNya meskipun orang-orang kafir membencinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 2: Yaitu Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni orang-orang kafir dengan azab dan memperingatkan mereka dengan ayat-ayat-Nya. Yang jujur imannya. Yaitu pahala yang banyak karena amal yang telah mereka kerjakan. Karena heran kepada orang itu (Nabi Muhammad shallallahu 'alaihi wa sallam). Hal ini karena kebodohan mereka dan sikap kerasnya, mereka merasa heran terhadap sesuatu yang tidak mengherankan disebabka kebodohan dan ketidaktahuan mereka terhadap hal yang bermaslahat bagi mereka. Bagaimana mereka tidak beriman kepada Rasul yang mulia itu, yang diutus Allah dari kalangan mereka sendiri, di mana mereka mengetahui kepribadiannya yang mulia, namun mereka menolak dakwahnya dan berusaha membatalkan agamanya, tetapi Allah akan menyempurnakan cahaya-Nya meskipun orang-orang kafir benci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 2",
    "description": "Oleh karena itu, pantaskah manusia menjadi heran bahwa kami memberi wahyu, yakni memberi informasi dan tuntunan agama secara pasti, cepat, dan berbentuk rahasia, kepada seorang laki-laki di antara mereka, yakni nabi Muhammad yang dikenal sangat jujur sehingga mendapat gelar al-amin. Melalui wahyu tersebut kami perintahkan kepadanya: berilah peringatan kepada manusia bahwa hari pembalasan itu pasti datang dan orang yang jahat akan disiksa karena kejahatannya, dan gembirakanlah orang-orang beriman yang mengerjakan amal saleh, bahwa mereka mempunyai kedudukan yang tinggi, yakni kemuliaan di sisi tuhan kelak di akhirat. Setelah mendengar dan menyaksikan ayat-ayat Al-Qur'an yang disampaikan oleh nabi Muhammad ternyata sangat mempesona, maka orang-orang kafir berkata, orang ini, yakni nabi Muhammad, benar-benar pesihir yang nyata, dan yang dibawanya adalah sihir, sehingga membuat orang-orang terpesona dan mengikuti seruannya. Demikianlah sifat angkuh orang-orang yang tidak mau mengakui bahwa Al-Qur'an adalah wahyu dari Allah. Kalau orang kafir merasa heran atas diturunkannya Al-Qur'an kepada nabi Muhammad, maka apakah mereka tidak merasa heran dengan penciptaan langit dan bumi serta segala isinya' tuhan mahakuasa menurunkan Al-Qur'an kepada nabi Muhammad, sebagaimana dia mahakuasa menciptakan langit dan bumi. Sesungguhnya tuhan kamu dialah Allah yang menciptakan langit dan bumi yang terbentang luas, dalam enam masa untuk memberikan pelajaran kepada manusia bahwa segala sesuatu perlu proses, melalui perencanaan yang matang dan dikerjakan secara maksimal. Jika Allah menghendaki, maka dia mahakuasa menciptakan keduanya dalam sekejap. Setelah sempurna masa penciptaan langit dan bumi, kemudian dia bersemayam di atas 'arsy, singgasana untuk mengatur segala urusan makhluk-Nya. Tidak ada yang dapat memberi syafaat, yakni pertolongan pada hari kiamat untuk mendapat keringanan atau terbebas dari azab Allah kecuali setelah ada izin-Nya. Itulah Allah, zat yang mahaagung, tuhanmu yang memelihara dan membimbingmu, maka sembahlah dia, karena hanya dia yang berhak disembah, jangan mempersekutukan dia dengan apa pun. Apakah kamu tidak mengambil pelajaran dari kesempurnaan penciptaan langit dan bumi beserta isinya' semuanya tunduk, patuh, dan bertasbih kepada Allah, tuhan pengatur segala urusan."
  }
]