[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir yang menentang itu berkata, ”mengapa tidak diturunkan kepada Muhammad ilmu, dalil, dan tanda kebenaran konkret dari tuhannya yang dapat kami ketahui dengannya bahwa sesungguhnya dia berada di atas kebenaran dalam semua yang dikatakannya?” Maka katakanlah kepada mereka (wahai rasul), ”tidak ada seorang pun yang mengetahui perkara ghaib, kecuali Allah. Apabila dia menghendaki, Dia akan melakukannya dan jika Dia berkehendak Dia tidak akan melekukannya, maka tunggulah oleh kalian (wahai manusia) ketetapan Allah antara kami dan kalian dengan disegerakannya siksaan bagi orang yang berada di atas kebatilan dari kita dan menolong pemegang kebenaran, sesungguhnya aku juga menunggu hal itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Orang-orang musyrik berkata, \"Mengapa tidak diturunkan kepada Muhammad suatu ayat dari Tuhannya yang menunjukkan kebenarannya?\" Katakanlah kepada mereka -wahai Rasul-, \"Turunnya ayat-ayat itu adalah perkara gaib yang hanya diketahui oleh Allah. Maka tunggulah ayat-ayat nyata yang kalian usulkan itu. Sesungguhnya aku pun menunggunya bersama kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Orang-orang musyrik Makkah berkata dengan bodohnya: “Mengapa tidak diturunkan mukjizat kepada Muhammad dari tuhannya?” Seperti yang mereka minta agar dikeluarkan baginya mata air dari bumi dan lain sebagianya. Maka Allah mengingkari mereka, katakanlah kepada mereka hai Muhammad, “Perkara ghaib tidak diketahui selain Allah, maka tunggulah saja ketetapan Allah antara kita, karena aku juga menunggu apa yang akan menimpa kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَيَقُولُونَ لَوْلَآ أُنزِلَ عَلَيْهِ ءَايَةٌ مِّن رَّبِّهِۦ (Dan mereka berkata: “Mengapa tidak diturunkan kepadanya (Muhammad) suatu keterangan (mukjizat) dari Tuhannya?”) Mereka adalah penduduk Makkah, mereka seakan-akan tidak menganggap ayat-ayat yang jelas dan mukjizat-mukjizat yang kuat sehingga mereka meminta kepada Rasulullah bukti lain seperti menghidupkan orang mati, mengubah gunung menjadi emas, dan lain sebagainya. فَقُلْ إِنَّمَا الْغَيْبُ لِلّٰهِ (Maka katakanlah: “Sesungguhnya yang ghaib itu kepunyaan Allah) Yakni turunnya mukjizat adalah hal yang ghaib. Dan Allah adalah pemilik ilmu-Nya, aku, kalian, dan makhluk-makhluk lain tidak memiliki ilmu-Nya. فَانتَظِرُوٓا۟( sebab itu tunggu (sajalah) olehmu) Yakni tunggulah turunnya apa yang kalian minta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Penduduk Mekkah yaitu orang-orang Musyrik yang seakan-akan tidak puas dengan ayat-ayat yang diturunkan atas rasulullah berkata: “Kenapa tidak diturunkan kepada Muhammad suatu mukjizat yang bisa dirasakan selain Al-Qur’an, seperti menghidupkan orang mati, membuat gunung menjadi emas, unta Shalih, tongkat Musa beserta tangannya (yang bersinar), dan meja makan Isa?” Katakanlah kepada mereka wahai Rasul: “Sesungguhnya proses turunnya Al-Qur’an merupakan sesuatu yang ghaib dan tidak ada yang mengetahui keghaiban kecuali Allah. Dan tunggulah turunnya sesuatu yang kalian sarankan atau azab, dan tampaknya kebenaran atas kebathilan, jika kalian tidak beriman. Sesungguhnya aku bersama kalian menentukan ketentuan pemisah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Mengapa tidak diturunkan kepadanya} kepada nabi Muhammad SAW {suatu bukti dari Tuhannya” Katakanlah,“Sesungguhnya yang gaib itu hanya milik Allah} sesungguhnya turunnya ayat itu ghaib dan hanya Allah yang mengetahuinya {Maka tunggulah. Sesungguhnya aku termasuk orang-orang yang menunggu bersama kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Dan mereka berkata”, yakni orang-orang yang mendustakan lagi menentang, “mengapa tidak diturunkan kepadanya (MUhammaad) suatu keterangan (mukjizat) dari Rabbnya?” mereka memaksudkan ayat-ayat yang mereka usulkan seperti ucapan mereka, \"Mengapa tidak diturunkan kepadanya seorang malaikat agar malaikat itu memberikan peringatan bersama-sama dengan dia?\" (Al-Furqan: 7), dan perkataan mereka, \"Dan mereka berkata: \"Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dan bumi untuk kami,\" (Al-Isra:90). “Maka katakanlah”, kepada mereka jika mereka menuntut ayat-ayat kepadamu, “sesungguhnya yang ghaib itu kepunyaan Allah.” Maksudnya, DIa-lah yang ilmuNya meliputi segala keadaan manusia, DIa mengatur mereka sesuai dengan tuntutan ilmuNya dan hikmahNya yang indah, tak seorang pun memiliki hak mengatur hukum, dalil, tujuan akhir dan penjelasan alasan hukum. “Sebab itu tunggu (sajalah) olehmu, sesungguhnya aku bersamamu termasuk orang-orang yang menunggu.” Maksudnya, masing-masing menunggu apa yang akan diperoleh oleh kawannya, lihatlah siapa pemilik akibat (baik)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 20: Penduduk Mekah dahulu. Sebagaimana nabi-nabi yang tedahulu ada yang diberi mukjizat unta, tongkat, tangan yang bercahaya, dsb. Yang dimaksud dengan yang ghaib di sini ialah mukjizat. Tugas saya hanyalah menyampaikan. Yakni masing-masing menunggu apa yang menimpa kepada yang lain, dan lihatlah untuk siapakah kesudahan yang baik itu?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 20",
    "description": "Setelah dijelaskan perselisihan yang terjadi diantara umat manusia, lalu kembali dijelaskan tentang tuntutan orang musyrik agar Allah memberikan mujizat yang kasat mata kepada nabi Muhammad. Dan mereka berkata, mengapa tidak diturunkan kepadanya (Muhammad) suatu bukti, yakni mukjizat dari tuhannya, yakni mukjizat yang dapat diindra' padahal mujizat seperti yang mereka minta sesungguhnya telah diturunkan kepada para nabi sebelum nabi Muhammad, tetapi umat para nabi tersebut tetap ingkar. Katakanlah, wahai nabi Muhammad sungguh, segala yang gaib itu hanya milik Allah; sebab itu tunggu sajalah olehmu, apakah Allah akan mengabulkan permintaanmu atau tidak. Allah maha mengetahui apa yang terbaik untuk hambanya. Ketahuilah, sesungguhnya aku juga menunggu bersama kamu, apa keputusan Allah untuk kita semua. Setelah pada ayat sebelumnya dijelaskan sifat buruk orang musyrik lalu dalam ayat ini dijelaskan sifat dasar manusia pada umumnya. Dan apabila kami memberikan suatu rahmat, keselamatan kepada manusia yang durhaka, setelah mereka ditimpa bencana, baik pada diri, harta, keluarga, dan alam lingkungan mereka, maka mereka tidak bersyukur, bahkan mereka segera melakukan segala tipu daya menentang ayat-ayat kami. Katakanlah, Allah lebih cepat pembalasannya atas tipu daya itu. Sesungguhnya malaikat-malaikat kami mencatat tipu dayamu. Tidak ada sedikitpun perbuatan manusia yang terlewat dari pengawasan Allah dan kelak di akhirat dia akan memberikan balasan dengan seadil-adilnya."
  }
]