[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kami membuat orang-orang musyrik merasakan kemudahan dan kebahagiaan, serta kenyamaanan hidup setelah kesulitan, kesengsaraan dan musibah berat yang menimpa mereka, tiba-tiba mereka mendustakan dan mengolok-olok ayat-ayat Allah. Katakanlaah olehmu (wahai rasul) kepada orang-orang musyrik yang suka mengolok-olok itu, “Allah lebih cepat membalas tipu daya, istdroj (penangguhan) dan hukuman terhadap kalian.” Sesungguhnya malaikat-malaikat yang kami utus kepada kalian, mereka menulis apa saja tipu daya yang kalian perbuat di dunia dan kemudian Kami memperhitungkan kalian terhadap itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Apabila Kami memberikan suatu anugerah kepada orang-orang musyrik berupa hujan dan kesuburan setelah mereka ditimpa kekeringan dan kesulitan, tiba-tiba mereka mengolok-olok dan mendustakan ayat-ayat Kami. Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, \"Allah lebih cepat tipu daya-Nya dan lebih cepat hukuman-Nya kepada kalian.\" Sesungguhnya para Malaikat pencatat amal senantiasa mencatat setiap tipu daya yang mereka rencanakan tanpa kecuali. Jadi bagaimana mungkin Pencipta mereka tidak mengetahui kondisi mereka?! Allah akan membalas tipu daya mereka dengan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Mereka telah tertimpa kekeringan dan kesulitan, kemudian Allah memberi mereka rahmat berupa kemudahan dan kesejahteraan setelah kekeringan dan kesulitan itu agar mereka mau bersyukur. Akan tetapi mereka tetap kafir dan menghina ayat-ayat kebesaran Allah yang dapat mereka dengar dan lihat. Maka Allah memerintahkan Rasulullah untuk memberi ancaman kepada mereka bahwa Allah sangat cepat tipu daya-Nya dalam membalas dosa-dosa yang mereka perbuat; para malaikat akan menulis dosa-dosa yang mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. إِذَا لَهُم مَّكْرٌ فِىٓ ءَايَاتِنَا ۚ (tiba-tiba mereka mempunyai tipu daya dalam (menentang) tanda-tanda kekuasaan Kami) Allah melapangkan rezeki mereka dan melimpahkan kenikmatan kepada mereka dengan hujan dan buah-buahan yang sehat; setelah kesusahan berupa kekeringan dan kesempitan hidup menimpa mereka; namun mereka tidak mensyukuri nikmat-Nya dan tidak menghargainya dengan sebenar-benarnya penghargaan, namun mereka malah menganggap kenikmatan itu berasal dari berhala-berhala mereka yang tidak dapat memberi manfaat atau mudharat, dan mengolok-olok ayat-ayat Allah dan berusaha membantahnya dengan berbagai tipu daya. قُلِ اللهُ أَسْرَعُ مَكْرًا ۚ( Katakanlah: “Allah lebih cepat pembalasannya (atas tipu daya itu)”) Lebih cepat balasannya. إِنَّ رُسُلَنَا يَكْتُبُونَ مَا تَمْكُرُونَ (Sesungguhnya malaikat-malaikat Kami menuliskan tipu dayamu) Yakni para malaikat mencatat tipu daya orang-orang kafir. Mereka tidak dapat sembunyi dari para malaikat pencatat amal, lalu bagaimana mereka dapat sembunyi dari Allah yang Maha Mengetahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dan tatkala Kami melimpahkan kepada manusia yaitu orang-orang kafir dengan rahmat, yaitu hujan, kesuburan dan kemudahan setelah kekeringan kelaparan, seketika mereka memiliki rencana tipu daya yaitu perlawanan terhadap ayat Kami yang diturunkan untuk memberi hidayah, dan mereka tidak bersyukur atas nikmat. Katakanlah kepada mereka wahai rasulallah: “Allah itu lebih cepat hukumannya. Dia akan membalas kalian sebelum kalian melakukan tipu daya terhadap kitabNya. Sesungguhnya malaikat penjaga juga pencatat yang diutus untuk mendampingi kalian itu mencatat dalam catatan amal kalian tentang tipu daya yang kalian rencanakan. Dan kalian akan dibalas atas hal itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila Kami memberi manusia} orang-orang musyrik {suatu rahmat setelah bencana menimpa mereka} menimpa mereka {seketika mereka memiliki tipu daya terhadap ayat-ayat Kami}ejekan dan kebohongan terhadap ayat Kami {Katakanlah,“Allah lebih cepat pembalasan tipu dayaNya”}lebih cepat pembiaran dan hukumannya bagi kalian {Sesungguhnya utusan-utusan Kami} malaikat penjaga Kami {mencatat tipu daya kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Allah berfirman, “Dan apabila Kami merasakan kepada manusia suatu rahmat, sesudah (datangnya) bahaya menimpa mereka”, seperti kesembuhan setelah sakit, kekayaan setelah kemiskinan, rasa aman setelah rasa takut, mereka melupakan kesulitan yang menimpa, mereka tidak mensyukuri Allah atas rahmat dan kemakmuran, mereka justru terus berjalan di atas penyelewengan dan makar. Oleh karena itu, Dia berfirman, “Tiba-tiba mereka mempunyai tipu daya dalam (menentang) tanda-tanda kekuasaan kami.” Mereka berusaha membatalkan kebenaran dengan kebatilan. “Katakanlah, ‘Allah lebih cepat pembalasannya (atas tipu daya itu)’.” Karena makar yang buruk hanya akan menimpa pemiliknya, senjata makan tuan, mereka tidak terbebas dari resiko buruk, para malaikat mencatat apa yang mereka kerjakan, lalu Allah menghitungnya atas mereka, kemudian Allah membalas mereka dengan balasan yang setimpal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 21: Seperti hujan dan kesuburan setelah sebelumnya kemarau panjang, atau sehat setelah sebelumnya sakit, atau kaya setelah sebelumnya miskin, dan aman setelah sebelumnya ditimpa ketakutan. Dengan melakukan pengolok-olokkan dan mendustakan serta berusaha membatalkan kebenaran. Mereka lupa padahal sebelumnya mereka ditimpa bencana, mereka tidak bersyukur ketika mendapatkan rahmat, bahkan malah tetap di atas kesesatannya. Dan makar yang buruk tidaklah menimpa kecuali kepada pelakunya; tipu daya mereka akan berbalik kepada mereka, bahkan para malaikat mencatatnya untuk kemudian diberikan balasan terhadapnya oleh Allah Subhaanahu wa Ta'aala. Dr. Muhammad bin ‘Abdurrahman Al Khumais berkata, “Hakikat makar adalah siasat kokoh untuk menimpakan hukuman kepada pelaku dosa dari arah yang tidak dia sadari. Ia (makar) lebih khusus daripada kata pembalasan, karena ia adalah hukuman dengan cara yang khusus. Oleh karena itu, makar dari Allah Subhaanahu wa Ta'aala adalah siasat untuk menolak tipu daya pembuat makar agar kembali menimpanya serta menimpakan hukuman kepadanya dari arah yang tidak dia sadari, serta membalasnya sesuai amal dan niatnya. Hal yang termasuk wajib diketahui, bahwa nama maakir (pembuat makar) tidak dimutlakkan kepada Allah karena mengambil kesimpulan dari ayat ini. Mahasuci Allah (dari memiliki nama maakir), bahkan yang benar dikatakan, “Sesungguhnya Allah Ta’ala adalah sebaik-baik pembuat makar, dan Allah menimpakan makar kepada orang-orang kafir dan munafik, sehingga seorang yang mengucapkannya berhenti pada batas yang disebutkan dalam nash secara muqayyad (terikat) agar tidak memberikan kesan keliru karena dengan menisbatkan sesuatu kepada Allah Ta’ala yang Dia tidak menyebutkannya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 21",
    "description": "Setelah pada ayat sebelumnya dijelaskan sifat buruk orang musyrik lalu dalam ayat ini dijelaskan sifat dasar manusia pada umumnya. Dan apabila kami memberikan suatu rahmat, keselamatan kepada manusia yang durhaka, setelah mereka ditimpa bencana, baik pada diri, harta, keluarga, dan alam lingkungan mereka, maka mereka tidak bersyukur, bahkan mereka segera melakukan segala tipu daya menentang ayat-ayat kami. Katakanlah, Allah lebih cepat pembalasannya atas tipu daya itu. Sesungguhnya malaikat-malaikat kami mencatat tipu dayamu. Tidak ada sedikitpun perbuatan manusia yang terlewat dari pengawasan Allah dan kelak di akhirat dia akan memberikan balasan dengan seadil-adilnyasebagai bukti bahwa hukuman Allah sangat cepat sebagaimana dijelaskan pada ayat sebelumnya, maka berikut ini ditegaskan bahwa, dialah tuhan yang menjadikan kamu dapat berjalan dengan kaki dan beragam kendaraan di daratan, dan berlayar di lautan yang terbentang luas, sehingga ketika kamu sudah berada di dalam kapal, dan meluncurlah kapal itu membawa mereka, yakni seluruh penumpang yang ada di dalamnya dengan kekuatan tiupan angin yang baik, dan mereka bergembira karenanya; tiba-tiba datanglah badai yang mangacaukan arah kapal mereka, sehingga menyimpang dari tujuan yang direncanakan dan gelombang menimpanya dari segenap penjuru, sehingga para penumpangnya panik akibat goncangan yang dasyat, dan mereka mengira, bahkan merasa telah terkepung bahaya, maka mereka berdoa dengan tulus ikhlas kepada Allah semata. Seraya berkata, sekiranya engkau menyelamatkan kami dari bahaya ini, pasti kami termasuk orang-orang yang benar-benar bersyukur."
  }
]