[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah yang memperjalankan kalian (wahai sekalian manusia), di atas daratan dengan menunggangi binatang-binatang tunggangan dan lain sebagianya, dan di laut dengan menumpangi di dalam kapal-kapal. Sehingga jika kalian sudah berada di atas kapal itu, lalu berlayar dengan tiupan angin yang baik, dan para penumpang bergembira ria dengan tiupan angin yang baik itu, datanglah angin kencang melanda kapal-kapal itu dan gelombang ombak (yaitu air yang menggelombang meningi ) menerjang para penumpang dari setiap tempat, dan mereka yakin bahwa kebinasaan telah menyergap mereka, mereka mengihklaskan doa kepada Allah semata, dan mereka meninggalkan apa-apa yang sebelumnya mereka sembah. Mereka berkata, “Bila Engkau menyelamatkan kami dari kesulitan ini di mana kami sedang berda di dalamnya, pastilah kami nanti akan menjadi orang-orang yang bersyukur kepadaMu atas nikmat-nikmatMu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Allah-lah yang membuat kalian -wahai manusia- bisa melaju di darat dengan berjalan kaki atau menggunakan kendaraan. Dan Dia lah yang membuat kalian bisa melaju di laut dengan mengendarai kapal. Sampai ketika kalian sudah berada di dalam kapal di tengah laut dan kapal itu membawa kalian berlayar dengan hembusan angin yang baik, maka para penumpang bersuka cita. Kemudian di saat mereka tengah bersuka cita tiba-tiba datang angin yang berhembus kencang, ombak lautan datang dari segala arah, dan mereka menduga kuat bahwa mereka semua akan celaka, maka mereka memanjatkan doa kepada Allah semata dan tidak menyekutukan-Nya dengan apapun seraya berkata, \"Sungguh, jika Engkau berkenan menyelamatkan kami dari cobaan maut ini, niscaya kami akan termasuk orang-orang yang bersyukur kepada-Mu atas nikmat yang telah Engkau anugerahkan kepada kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah-lah yang memberi kalian kemampuan untuk melakukan perjalanan di darat dengan hewan tunggangan dan kendaraan, dan perjalanan di laut dengan kapal dan perahu. Hingga jika kalian berada di atas kapal yang dijalankan oleh angin yang tenang dan sesuai arah tujuan, kalian bersenang hati; namun ketika kapal itu dihempas oleh angin besar, dan diliputi ombak-ombak tinggi dan badai, sehingga kalian yakin kalian akan binasa, maka kalian panik dan hanya berdoa dan meminta pertolongan dari Allah Semata, serta bersumpah ‘jika kami dapat selamat dari musibah ini, niscaya kami akan benar-benar bersyukur dengan perkataan dan perbuatan kami’."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. هُوَ الَّذِى يُسَيِّرُكُمْ فِى الْبَرِّ وَالْبَحْرِ ۖ (Dialah Tuhan yang menjadikan kamu dapat berjalan di daratan, (berlayar) di lautan) Mereka berjalan dengan kedua kaki yang diciptakan Allah untuk mereka agar memanfaatkannya, dan mereka mengendarai hewan-hewan tunggangan yang Allah cipatakan untuk mereka tunggangi, dan Allah mengilhamkan mereka untuk membuat perahu-perahu yang mereka naiki diatas ombak-ombak lautan. حَتَّىٰٓ إِذَا كُنتُمْ فِى الْفُلْكِ(Sehingga apabila kamu berada di dalam bahtera) Yakni diatas perahu-perahu. وَجَرَيْنَ(dan meluncurlah bahtera itu) Yakni perahu-perahu itu. بِهِم(membawa orang-orang yang ada di dalamnya) Yakni bersama orang-orang yang menaikinya. بِرِيحٍ طَيِّبَةٍ(dengan tiupan angin yang tenang) Yang menjalankan perahu-perahu mereka. Dan bukan dengan angin ribut. جَآءَتْهَا رِيحٌ عَاصِفٌ (datanglah angin badai) Yakni yang berhembus dengan kencang. وَجَآءَهُمُ الْمَوْجُ مِن كُلِّ مَكَانٍ (dan (apabila) gelombang dari segenap penjuru menimpanya) Yakni dari segala penjuru. وَظَنُّوٓا۟ أَنَّهُمْ أُحِيطَ بِهِمْ ۙ( dan mereka yakin bahwa mereka telah terkepung (bahaya)) Yakni mereka telah merasa bahwa akan binasa. دَعَوُا۟ اللهَ(maka mereka berdoa kepada Allah) Yakni dalam keadaan tersebut mereka menghadap kepada Allah dengan doa mereka karena mereka mengetahui bahwa Allah berkuasa untuk menyelamatkan mereka. مُخْلِصِينَ(dengan penuh keikhlasan) Yakni doa mereka tidak dikotori oleh hal-hal lain, tidak seperti kebiasaan mereka dalam berdoa diluar keadaan yang demikian ini, yang selalu menyekutukan berhala-berhala mereka dalam berdoa. Dan ayat ini menunjukkan bahwa sudah menjadi tabiat makhluk untuk kembali kepada Allah ketika dalam bahaya; dan doa orang yang berada dalam kesempitan mustajab meski ia adalah orang kafir. لَئِنْ أَنجَيْتَنَا مِنْ هٰذِهِۦ (“Sesungguhnya jika Engkau menyelamatkan kami dari hal ini) Yakni dari bahaya ini. Mereka bersumpah dengan sumpah mereka itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Allah adalah Dzat yang memudahkan dan meneguhkan kalian untuk berpintah di darat dan di laut dengan melakukan perjalanan, sehingga ketika kalian berada di bahtera, bahtera yang membawa orang di dalamnya itu berlayar dengan angin yang tenang, tidak kencang sesuai arah perjalanan. Mereka senang dengan angin itu. Lalu (ketika) datang kepada mereka angin yang sangat kencang atau angin ribut, ombak dari setiap tempat, dan asumsi tentang kehancuran meliputi mereka, niscaya mereka akan menghadap kepada Allah dengan berdoa dan memohon dengan ikhlas hanya kepadaNya (Ini adalah dalil bahwa tawajjuh yang suci itu hanya kepada Allah dan doa dalam keadaan darurat meskipun kafir, itu dikabulkan) Dalam doanya, mereka berkata: “Jika Engkau menyelamatkan Kami dari penderitaan, marabahaya, dan bencana ini, sungguh kami akan beryukur atas nikmatmu dengan beriman, bertauhid dan taat\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang memperjalankan} menjadikan kalian bisa berjalan {di daratan dan di lautan sehingga ketika kalian di dalam kapal} bahtera {lalu kapal itu berlayar membawa mereka dengan tiupan angin yang baik} tiupan yang lembut {dan mereka bergembira dengan itu} dengan angin itu {Kemudian datanglah kepada mereka} kemudian bahtera mereka ditimpa {ombak dari segala penjuru dan mereka mengira} mereka cenderung pada perkiraan mereka {telah terkepung} dikepung kehancuran {Mereka berdoa kepada Allah dengan penuh keikhlasan kepadaNya} dalam doanya {“Sekiranya Engkau menyelamatkan kami dari ini, pasti kami termasuk orang-orang yang bersyukur.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. ketika Allah menetapkan kaidah umum tentang keadaan manusia pada saat mendapatkan kemudahan setelah kesulitan, kebahagiaan setelah kesedihan, maka Dia menyebutkan keadaan yang mendukung hal tersebut yaitu keadaan mereka di laut yang bergejolak dan ketakutan mereka terhadap akibatnya. Dia berfirman, “Dia-lah Rabb yang menjadikan kamu dapat berjalan di daratan, dan (berlayar) di lautan.” Dengan sebab-sebab yang Dia menunjukannya kepadamu dan memudahkannya untukmu. “Sehingga apabila kamu berada di dalam bahtera”, yaitu kapal laut, “dan meluncurlah bahtera itu membawa orang-orang yang ada di dalamnya dengan tiupan angin yang baik”, yang sesuai dengan keinginan mereka tanpa gejolak dan kesulitan, “dan mereka bergembira karenanya”, dan mereka tenang kepadanya, manakala mereka dalam kondisi tersebut, tiba-tiba datang kepada mereka “angin badai”, yang sangat kencang. “Dan (apabila) gelombang dari segenap penjuru menimpanya, dan mereka yakin bahwa mereka telah terkepung (bahaya).” Maksudnya, mereka mengetahui bahwa itu adalah kematian, maka ketika itu terputus sudah ketergantungan mereka dengan makhluk. Mereka menyadari bahwa yang bisa menyelamatkan mereka dari kesulitan ini hanyalah Allah semata, maka mereka memohon kepadaNya “dengan mengikhlaskan ketaatan kepadaNYa semata-mata.” Mereka berjanji kepada diri mereka sendiri dengan pasti. “(Mereka berkata), ‘Sesungguhnya jika Engkau menyelamatkan kami dari bahaya ini, pastilah kami akan termasuk orang-orang yang bersyukur’. Maka tatkala Allah menyelamatkan mereka, tiba-tiba mereka membuat kezhaliman di muka bumi tanpa (alasan) yang benar.” Maksudnya, mereka melupakan kesulitan dan doa tersebut serta apa yang mereka wajibkan atas diri mereka sendiri, lalu mereka menyekutukan Allah dengan sesuatu yang dia sendiri mengakui bahwa dia tidak mampu menepis kesulitan dan mengangkat musibah. Mengapa mereka tidak mengikhlaskan ibadah kepada Allah dalam keadaan senang bagaimana mengikhlaskannya dalam keadaan sulit? Akan tetapi akibat dari kezhaliamnnya akan kembali menimpa dirinya sendiri. Oleh karena itu, Dia berfirman, “Hai manusia, sesungguhnya (bencana) kezhalimanmu akan menimpa dirimu sendiri, (hasil kezhalimanmu) itu hanyalah kenikmatan hidup duniawi.” Maksudnya, paling-paling yang kamu harapkan dan kamu dapatkan dari kezhalimanmu dan penyimpanganmu dari keikhlasan kepada Allah hanyalah bagian kecil dari dunia dan kedudukannya kepada Allah hanyalah bagian kecil dari dunia dan kedudukannya yang rendah yang akan lenyap dengan cepat dan berlalu dengan segera lalu kamu pun meninggalkannya walaupun kamu tidak menginginkannya. “Kemudian kepada Kami-lah kembalimu”, pada Hari Kiamat “lalu Kami kabarkan kepadamu apa yang telah kamu kerjakan.” Ini adalah peringatan keras kepada mereka agar tidak terus menerus berjalan di atas perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 22: Setelah Allah Subhaanahu wa Ta'aala menyebutkan kebiasaan manusia ketika mendapatkan rahmat setelah sebelumnya mendapat bencana, Allah menyebutkan keadaan yang sama seperti itu untuk menguatkan, yaitu keadaan mereka ketika di tengah lautan saat badai dan gelombang datang menerpa mereka. Dengan memudahkan sebab-sebabnya dan menunjukkan kepadanya. Mereka yakin akan binasa, ketika itu ketergantungan mereka kepada makhluk terputus, mereka tahu bahwa makhluk tidak dapat berbuat apa-apa terlebih sesembahan mereka seperti patung dan berhala, dan mereka menyadari bahwa tidak ada yang mampu menyelamatkan mereka dari bahaya besar itu kecuali Allah saja, maka ketika itu mereka berdoa kepada Allah dengan meikhlaskan ibadah kepada-Nya dan berjanji akan bersyukur kepada-Nya. Yakni orang-orang yang mengesakan Engkau, ya Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 22",
    "description": "Sebagai bukti bahwa hukuman Allah sangat cepat sebagaimana dijelaskan pada ayat sebelumnya, maka berikut ini ditegaskan bahwa, dialah tuhan yang menjadikan kamu dapat berjalan dengan kaki dan beragam kendaraan di daratan, dan berlayar di lautan yang terbentang luas, sehingga ketika kamu sudah berada di dalam kapal, dan meluncurlah kapal itu membawa mereka, yakni seluruh penumpang yang ada di dalamnya dengan kekuatan tiupan angin yang baik, dan mereka bergembira karenanya; tiba-tiba datanglah badai yang mangacaukan arah kapal mereka, sehingga menyimpang dari tujuan yang direncanakan dan gelombang menimpanya dari segenap penjuru, sehingga para penumpangnya panik akibat goncangan yang dasyat, dan mereka mengira, bahkan merasa telah terkepung bahaya, maka mereka berdoa dengan tulus ikhlas kepada Allah semata. Seraya berkata, sekiranya engkau menyelamatkan kami dari bahaya ini, pasti kami termasuk orang-orang yang benar-benar bersyukur. Manusia pada umumnya memang suka berbasa basi, bahkan pada situasi kritis sering mengobral janji akan berbuat baik dan berakhlak terpuji, tetapi ketika Allah menyelamatkan mereka, malah mereka mengulangi berbuat kezaliman, yakni mempersekutukan Allah dan melaksanakan kedurhakaan lainnya di bumi tanpa alasan yang benar. Kezaliman mereka sungguh melampaui batas, karena itu Allah mengingatkan, wahai manusia! sesungguhnya kezalimanmu bahayanya akan menimpa dirimu sendiri; kenikmatan yang kamu rasakan itu hanya kenikmatan hidup duniawi yang bersifat sementara, selanjutnya kepada kamilah kembalimu setelah kematian menjemputmu, kelak di akhirat akan kami kabarkan kepadamu hukuman atas segala apa yang telah kamu kerjakan selama hidup di dunia."
  }
]