[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika Allah telah menyelamatkan mereka dari kondisi-kondisi sulit dan keadaan yang mencengkam itu, tiba-tiba mereka berbuat kerusakan dan berbagai maksiat di muka bumi. Wahai sekalian manusia, sesungguhnya dampak buruk kezhaliman kalian hanyalah kembali kepada diri kalian. Bagi kalian kenikmatan di kehidupan dunia yang fana, kemudian kepada kami tempat pulang kalian dan kembali kalian, lalu kami mengabarkan kapada kalian semua perbuatan kalian dan kami akan menghisab kalian dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Kemudian setelah Allah mengabulkan doa mereka dan menyelamatkan mereka dari bencana itu, tiba-tiba mereka membuat kerusakan di muka bumi dengan melakukan perbuatan kufur, maksiat dan dosa. Sadarlah wahai manusia! Sesungguhnya resiko dari perbuatan buruk kalian itu akan kalian tanggung sendiri. Karena Allah sama sekali tidak dirugikan oleh perbuatan buruk kalian. Kalian bisa menikmatinya di dunia yang fana ini. Kemudian di Hari Kiamat kelak kalian akan kembali kepada Kami. Lalu Kami akan memberitahukan kepada kalian perihal kemaksiatan-kemaksiatan yang telah kalian perbuat. Dan Kami akan memberikan balasan yang setimpal kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Namun ketika Allah mengabulkan doa mereka dan menyelamatkan mereka dari kegentingan itu, mereka berbuat kerusakan di bumi dengan mengingkari sumpah dan tenggelam dalam kebatilan. Kemudian Allah menyeru seluruh manusia untuk memperingatkan mereka dari bahaya kemaksiatan itu, karena mudharatnya akan kembali kepada mereka sendiri; semua itu akan ditulis dalam catatan amal perbuatan mereka, ketika mereka sedang bersenang-senang dengan syahwat dunia yang fana. Kemudian kalian akan kembali kepada Kami pada hari kebangkitan, dan Kami akan memberitahukan dosa-dosa yang kalian perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. فَلَمَّآ أَنجَىٰهُمْ (Maka tatkala Allah menyelamatkan mereka) Yakni setelah Allah menyelamatkan mereka dari bahaya ini dan mengabulkan doa mereka. إِذَا هُمْ يَبْغُونَ فِى الْأَرْضِ (tiba-tiba mereka membuat kezaliman di muka bumi) Dengan berbuat kerusakan di muka bumi dan melupakan doa, sumpah, dan janji mereka kepada Allah. بِغَيْرِ الْحَقِّ ۗ (tanpa (alasan) yang benar) Yakni tanpa ada syubhat yang membenarkan perbuatan mereka. Namun mereka melakukannya karena kedurhakaan dan kekerasan hari mereka. يٰٓأَيُّهَا النَّاسُ إِنَّمَا بَغْيُكُمْ عَلَىٰٓ أَنفُسِكُم ۖ( Hai manusia, sesungguhnya (bencana) kezalimanmu akan menimpa dirimu sendiri) Yakni kezaliman kepada orang lain merupakan kezaliman kepada diri sendiri jika dilihat dari kesudahan perbuatan ini, yaitu balasan yang akan ia dapatkan atas kezalimannya. Bersenang-senang dengan kezaliman itu hanyalah kenikmatan hidup duniawi yang hanya dinikmati pada waktu itu saja. ثُمَّ إِلَيْنَا مَرْجِعُكُمْ(kemudian kepada Kami-lah kembalimu) Yakni setelah kalian berada dalam kehidupan dunia dan kenikmatannya, kalian akan dikembalikan kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Tatkala Allah menyelamatkan mereka dari musibah, tiba-tiba mereka bergegas kembali pada kekufuran, kerusakan dan kemaksiatan, serta melupakan apa yang mereka janjikan kepada Allah dengan tidak benar, yaitu dengan bathil dan penuh penolakan. Wahai orang-orang yang tidak menepati janji, sesungguhnya konsekuensi kezaliman dan kerusakan itu akan menimpa diri kalian. Kalian bersenang-senang dengan kezaliman di saat hidup di dunia saja, lalu kalian akan kembali setelah mati dan menikmati dunia kepada Allah pada hari kiamat, kemudian Kami akan memberitahu dan membalas kalian atas amal kalian di dunia. Makhul berkata: “tiga hal yang digunakan berlindung seseorang namun akan menimpanya sendir, yaitu tipu daya, kezaliman, dan kerusakan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Allah menyelamatkan mereka, seketika itu mereka berbuat kezaliman} berbuat kerusakan {di bumi tanpa alasan yang benar. Wahai manusia, sesungguhnya kezaliman kalian akan menimpa diri kalian sendiri} balasan atas kerusakan kalian akan kembali kepada kalian {kenikmatan hidup dunia} kalian menikmatinya di kehidupan dunia {Kemudian kepada Kamilah kalian akan dikembalikan, lalu Kami kabarkan kepada kalian} Kami memberitahu kalian {apa yang telah kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. ketika Allah menetapkan kaidah umum tentang keadaan manusia pada saat mendapatkan kemudahan setelah kesulitan, kebahagiaan setelah kesedihan, maka Dia menyebutkan keadaan yang mendukung hal tersebut yaitu keadaan mereka di laut yang bergejolak dan ketakutan mereka terhadap akibatnya. Dia berfirman, “Dia-lah Rabb yang menjadikan kamu dapat berjalan di daratan, dan (berlayar) di lautan.” Dengan sebab-sebab yang Dia menunjukannya kepadamu dan memudahkannya untukmu. “Sehingga apabila kamu berada di dalam bahtera”, yaitu kapal laut, “dan meluncurlah bahtera itu membawa orang-orang yang ada di dalamnya dengan tiupan angin yang baik”, yang sesuai dengan keinginan mereka tanpa gejolak dan kesulitan, “dan mereka bergembira karenanya”, dan mereka tenang kepadanya, manakala mereka dalam kondisi tersebut, tiba-tiba datang kepada mereka “angin badai”, yang sangat kencang. “Dan (apabila) gelombang dari segenap penjuru menimpanya, dan mereka yakin bahwa mereka telah terkepung (bahaya).” Maksudnya, mereka mengetahui bahwa itu adalah kematian, maka ketika itu terputus sudah ketergantungan mereka dengan makhluk. Mereka menyadari bahwa yang bisa menyelamatkan mereka dari kesulitan ini hanyalah Allah semata, maka mereka memohon kepadaNya “dengan mengikhlaskan ketaatan kepadaNYa semata-mata.” Mereka berjanji kepada diri mereka sendiri dengan pasti. “(Mereka berkata), ‘Sesungguhnya jika Engkau menyelamatkan kami dari bahaya ini, pastilah kami akan termasuk orang-orang yang bersyukur’. Maka tatkala Allah menyelamatkan mereka, tiba-tiba mereka membuat kezhaliman di muka bumi tanpa (alasan) yang benar.” Maksudnya, mereka melupakan kesulitan dan doa tersebut serta apa yang mereka wajibkan atas diri mereka sendiri, lalu mereka menyekutukan Allah dengan sesuatu yang dia sendiri mengakui bahwa dia tidak mampu menepis kesulitan dan mengangkat musibah. Mengapa mereka tidak mengikhlaskan ibadah kepada Allah dalam keadaan senang bagaimana mengikhlaskannya dalam keadaan sulit? Akan tetapi akibat dari kezhaliamnnya akan kembali menimpa dirinya sendiri. Oleh karena itu, Dia berfirman, “Hai manusia, sesungguhnya (bencana) kezhalimanmu akan menimpa dirimu sendiri, (hasil kezhalimanmu) itu hanyalah kenikmatan hidup duniawi.” Maksudnya, paling-paling yang kamu harapkan dan kamu dapatkan dari kezhalimanmu dan penyimpanganmu dari keikhlasan kepada Allah hanyalah bagian kecil dari dunia dan kedudukannya kepada Allah hanyalah bagian kecil dari dunia dan kedudukannya yang rendah yang akan lenyap dengan cepat dan berlalu dengan segera lalu kamu pun meninggalkannya walaupun kamu tidak menginginkannya. “Kemudian kepada Kami-lah kembalimu”, pada Hari Kiamat “lalu Kami kabarkan kepadamu apa yang telah kamu kerjakan.” Ini adalah peringatan keras kepada mereka agar tidak terus menerus berjalan di atas perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 23: Yaitu dengan berbuat syirk. Mereka lupa terhadap peristiwa itu dan doa yang mereka panjatkan kepada Allah saat itu serta janji yang mereka ungkapkan. Mereka lupa kepada semua itu dan berbuat syirk lagi kepada Allah. Yakni dosanya ditangung olehmu sendiri. Yakni hanya sebentar saja, yang sifatnya akan digambarkan oleh Allah Subhaanahu wa Ta'aala setelah ayat ini. Setelah kamu mati. Lalu Allah memberikan balasan terhadapnya. Dalam ayat ini terdapat peringatan yang dalam terhadap mereka jika tetap di atas perbuatan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 23",
    "description": "Manusia pada umumnya memang suka berbasa basi, bahkan pada situasi kritis sering mengobral janji akan berbuat baik dan berakhlak terpuji, tetapi ketika Allah menyelamatkan mereka, malah mereka mengulangi berbuat kezaliman, yakni mempersekutukan Allah dan melaksanakan kedurhakaan lainnya di bumi tanpa alasan yang benar. Kezaliman mereka sungguh melampaui batas, karena itu Allah mengingatkan, wahai manusia! sesungguhnya kezalimanmu bahayanya akan menimpa dirimu sendiri; kenikmatan yang kamu rasakan itu hanya kenikmatan hidup duniawi yang bersifat sementara, selanjutnya kepada kamilah kembalimu setelah kematian menjemputmu, kelak di akhirat akan kami kabarkan kepadamu hukuman atas segala apa yang telah kamu kerjakan selama hidup di dunia. Setelah dijelaskan bahwa kenikmatan yang diperoleh bagi orangorang musyrik hanyalah kenikmatan duniawi, lalu diingatkan bahwa sesungguhnya perumpamaan kehidupan duniawi yang kamu dambakan sampai melupakan kehidupan akhirat itu akan cepat sirna, hanya seperti air hujan yang kami turunkan dari langit, kemudian meresap ke dalam bumi, lalu tumbuhlah tanaman-tanaman bumi dengan subur karena air itu, di antaranya ada yang dimakan manusia dan hewan ternak. Hingga apabila bumi itu telah sempurna keindahannya karena tanamannya telah tumbuh warna-warni dengan sangat rindang, dan berhias indah dengan gunung-gunung dan lembah-lembahnya telah menghijau dengan beragam tanam-tanamannya, dan pemiliknya mengira bahwa mereka pasti menguasainya, yakni memetik hasilnya, tiba-tiba datanglah kepadanya azab kami berupa bencana atau hama pada waktu malam atau siang, lalu kami jadikan tanamannya seperti tanaman yang sudah disabit, yakni telah dipanen, bahkan kedahsyatan azab tersebut mengesankan seakan-akan belum pernah tumbuh tanaman kemarin. Demikianlah kami menjelaskan tanda-tanda kekuasaan kami kepada orang yang berpikir yang mau mengambil pelajaran dari azab yang telah ditimpakan kepada orangorang yang durhaka."
  }
]