[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesunggunnya perumpamaan kehidupan dunia dan apa yang kalian banggakan berupa perhiasan dan harta benda , adalah seperti air hujan yang kami turunkan dari langit ke muka bumi. Maka dengan itu tumbuhlah berbagai macam tanaman, sebagian bercampur dengan yang lain dari buah-buahan yang di makan oleh manusia dan tumbuh tumbuhan yang di makan oleh binatang-binatang sehingga apabila tampak keindahan permukaan bumi dan pesonanya dan para pemilknya menyangka mereka kuasa untuk memetik hasil panennya dan mengambil manfaat darinya, datanglah keputusan dan ketetapan kami kepadanya dengan kebinasaanya dan semua tanaman dan pesona yang ada di atasnya, baik di siang hari maupun malam hari. Kemudian kami menjadikan tanaman-tanaman dan pohon-pohon itu telah dipanen dan telah di potong tidak ada apapun yang tersisa padanya, seolah-olah puoh-pohon dan tanaman-tanaman itu sebelumnya tidak pernah tegak di muka bumi. Maka begitu pula, kesirnaan akan menimpa apa yang kalian bangga-banggakan dari dunia dan perhiasanya yang kalian miliki . Maka Allah melenyapkan dan Menyirnakannya. Dan sebagaimana Kami telah menjelaskan kepada kalian (wahai manusia), perumpamaan dunia ini dan Kami mengenalkan hakikatnya, kami juga menjelaskan hujjah-hujjah Kami dan petunjuk kami kepada kaum yang memikirkan ayat-ayat Allah dan merenungi apa yang bermanfaat bagi mereka di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Sesungguhnya kecepatan berakhirnya kehidupan dunia yang kalian nikmati ini bagaikan air hujan yang mengenai tumbuh-tumbuhan di muka bumi yang biji-biji dan buah-buahnya biasa di makan oleh manusia atau rerumputan dan sejenisnya yang biasa di makan oleh binatang ternak. Sampai ketika bumi tampil dengan warnanya yang elok dan bersolek dengan aneka tanaman yang tumbuh di atasnya, dan penduduknya menyangka bahwa mereka akan memanen dan memetik hasilnya, tiba-tiba datang keputusan Kami untuk memusnahkannya. Maka Kami jadikan tanam-tanaman itu laksana tanam-tanaman yang sudah dipanen. Seolah-olah baru-baru ini tidak pernah tumbuh pepohonan dan tanam-tanaman di tempat itu. Selain menjelaskan kondisi kehidupan dunia dan kecepatan berakhirnya, Kami juga menjelaskan dalil-dalil dan bukti-bukti untuk orang-orang yang mampu berpikir dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Sesungguhnya perumpamaan kehidupan dunia dan kenikmatan dan keburukannya seperti hujan yang Kami turunkan dari langit, lalu menumbuhkan berbagai tanaman yang saling bertautan, seperti buah-buahan dan biji-bijian yang dimakan manusia, dan biji-bijian yang dimakan hewan-hewan ternak; hingga bumi seperti dihampari karpet hijau dari bunga-bunga yang indah, buah-buahan yang lezat, dan mata air yang jernih. Manusiapun takjub ketika melihatnya, sehingga mereka mengira dapat memanen dan memanfaatkannya; namun mereka dikagetkan oleh ketetapan Kami untuk membinasakan tanaman-tanaman itu pada malam atau siang hari, sehingga Kami menjadikannya kering kerontang seperti tanaman kering yang telah dipanen, seakan-akan tanah itu tidak pernah ditumbuhi tanaman sebelumnya. Demikianlah Kami buat perumpamaan kehidupan dunia dan kenikmatannya, demikian Kami jelaskan berbagai ayat yang menunjukkan keesaan Allah bagi orang-orang yang menghayati dan mendapat petunjuk dengan cahayanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. إِنَّمَا مَثَلُ الْحَيَوٰةِ الدُّنْيَا كَمَآءٍ (Sesungguhnya perumpamaan kehidupan duniawi itu, adalah seperti air (hujan)) Setelah Allah menyebutkan kenikmatan dunia, Allah kemudian melanjutkan firman-Nya yang mengandung penjelasan hakikat dunia yang lenyap dengan cepat. Yakni perumpamaan dalam cepatnya dunia ini lenyap seperti tanaman-tanaman di bumi yang cepat sekali layu dan mati dan sirna keindahannya. فَاخْتَلَطَ بِهِۦ نَبَاتُ الْأَرْضِ (lalu tumbuhlah dengan suburnya karena air itu tanam-tanaman bumi) Yakni sebagian jenis tanaman ini bercampur dengan jenis lainnya sampai tumbuh dengan sempurna. مِمَّا يَأْكُلُ النَّاسُ وَالْأَنْعٰمُ(di antaranya ada yang dimakan manusia dan binatang ternak) Berupa biji-bijian, buah-buahan, dan semak-semak. حَتَّىٰٓ إِذَآ أَخَذَتِ الْأَرْضُ زُخْرُفَهَا(Hingga apabila bumi itu telah sempurna keindahannya,) Yakni warnanya berubah menjadi indah yang sebagiannya mirip dengan warna emas, perak, berlian, dan permata. وَازَّيَّنَتْ(dan memakai (pula) perhiasannya) Dan mulai berhias. Allah menyerupakannya dengan seorang wanita yang memakai pakaian yang indah, yang memiliki corak-corak warna yang banyak, dan memakai perhiasan, untuk menarik perhatian. وَظَنَّ أَهْلُهَآ أَنَّهُمْ قٰدِرُونَ عَلَيْهَآ(dan pemilik-permliknya mengira bahwa mereka pasti menguasainya) Dengan memanennya dan mengambil manfaat darinya. أتاها أمرنا (, tiba-tiba datanglah kepadanya azab Kami) Dengan menghancurkan tanaman tersebut dan menimpakannya berbagai penyakit. فَجَعَلْنٰهَا حَصِيدًا(lalu Kami jadikan (tanam-tanamannya) laksana tanam-tanaman yang sudah disabit) Yakni Kami menjadikannya seakan-akan kebun yang telah dipanen yang telah dipotong batangnya. كأن لم تغن (seakan-akan belum pernah tumbuh) Seakan-akan belum ditanami sama sekali. بِالْأَمْسِ ۚ (kemarin) Yang tumbuh hijau segar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ حَتَّىٰ إِذَا أَخَذَتِ الْأَرْضُ زُخْرُفَهَا وَازَّيَّنَتْ } \"Hingga apabila bumi itu telah sempurna keindahannya, dan memakai (pula) perhiasannya\" Seorang 'alim berkata : Setiap kali aku melihat kepada dunianya manusia selalu saja ada penemuan-penemuan dan ciptaan-ciptaan tehnologi yang membuat manusia merasa senang dan bahagia; itu yang diciptakan oleh manusia untuk manusia juga, lalu bagaimana jika ciptaan itu dipersiapkan oleh sang Maha pencipta untuk penghuni surga-Nya nanti ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Sesungguhnya kecepatan berakhirnya dunia dan nikmat-nikmatnya itu seperti tumbuh-tumbuhan yang ada di permukaan bumi, yang mana disiram air hujan dari langit, lalu tumbuh-tumbuhan itu saling bercampur akibat air (hujan) tersebut menghasilkan biji-bijian dan buah-buahan yang dimakan menusia dan rerumputan yang dimakan hewan ternak. Dan ketika bumi telah sempurna kebaikan wujudnya dan keindahannya, dan dihiasi dengan bunga-bunga indah yang beragam, serta penghuninya beranggapan bahwa mereka berkuasa atas hasil panen dan buahnya serta bisa menikmatinya, lalu tiba-tiba datang perintah Kami untuk menghancurkannya di waktu malam atau siang, kemudian Kami menjadikan tanamannya yang dipanen dan dipotong dengan sabit itu seakan-akan tidak pernah ada sebelumnya. Sebagaimana penjelasan dan keterangan itulah Kami menjelaskan dan memberagamkan ayat-ayat yang menunjukkan kepada tauhid kekuasaan dan lainnya bagi kaum yang mau berpikir tentangnya lalu mengambil manfaat darinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya perumpamaan kehidupan dunia} sifat kehidupan dunia dalam hal kefanaan dan kehancurannya {itu seperti air} seperti air {yang Kami turunkan dari langit, lalu tumbuhlah dengan itu} dengan hujan itu {tanaman-tanaman bumi yang dimakan oleh manusia dan hewan ternak. Sehingga apabila bumi itu telah sempurna keindahannya} kebaikan dan keindahannya {dan dihiasi} diperindah dengan berbagai tanaman, bentuk, dan warna {dan para penduduknya mengira bahwa mereka pasti menguasainya} untuk memetiknya {lalu datanglah kepadanya azab Kami} putusan Kami untuk membinasakan mereka {pada waktu malam atau siang. Lalu Kami menjadikannya sudah dipanen} dipanen dan disabit {seakan-akan belum pernah tumbuh kemarin} tidak pernah tumbuh subur dalam waktu dekat {Demikian itu Kami merincikan} menjelaskan {ayat-ayat itu bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Ini adalah perumpamaan yang merupakan salah satu perupamaan yang terbaik, pas dengan keadaan dunia, karena kenikmatan, syahwat, kedudukannya dan lain-lain menjadi indah -jika ia menjadi indah dalam wakktu singkat-, jika ia telah lengkap dan sempurna maka ia terkikis dan terlepas dari pemiliknya atau pemiliknya terlepas darinya, maka kedua tangannya hampa, hatinya penuh dengan kecemasan, kesedihan dan penyesalan karenanya, hal itu “seperti air (hujan) yang Kami turunkan dari langit, lalu karena air itu tumbuhlah tanaman-tanaman bumi dengan subur.” Maksudnya, tumbuh padanya dari segala jenis dan pasangan yang indah. “Di antaranya ada yang dimakan manusia”, seperti biji-bijian dan buah-buahan, “dan” apa yang dimakan oleh “binatang ternak.” Seperti rerumputan dan daun-daunan yang beraneka ragam. “Hingga apabila bumi itu telah sempurna keindahannya, dan memakai (pula) perhiasannya.” Maksudnya, indah pemandangannya, ia berhias dengan daun-daunnya maka ia menjadi kebahagiaan bagi orang-orang yang memandang, ketenangan bagi orang yang membuang penat dan tanda kebesaran Allah bagi orang-orang yang merenungkan. Kamu pun melihat pemandangan yang unik, hijau, kuning putih, dan lain-lain. “Dan pemilik-pemiliknya mengira bahwa mereka pasti menguasainya.” Maksudnya, mereka ingin itu berlangsung terus menerus karena memang itulah yang mereka cari dan inginkan, akan tetapi manakala mereka dalam kondisi tersebut, datanglah keputusan Allah, “di waktu malam atau siang, lalu Kami jadikan (tanam-tanamannya) laksana tanam-tanaman yang sudah disabit, seakan-akan belum pernah tumbuh kemarin.” Maksudnya, seolah-olah tak pernah ada. Ini adalah keadaan dunia, sama persis. “Demikianlah Kami menjelaskan tanda-tanda kekuasaan (Kami).” Maksudnya, Kami menerangkannya dengan mendekatkan makna-maknanya kepada akal dengan membuat perumpamaan “kepada orang-orang yang berpikir”, memakai akal mereka untuk yang bermanfaat bagi mereka. Adapun orang yang lalai dan berpaling, maka tanda-tanda kebesaran Allah tidak berguna baginya, keterangan tidak mengikis keraguannya. Manakala Allah menyebutkan keadaan dunia dan hasil dari kenikmatannya, maka Dia menanamkan kecintaan manusia kepada alam akhirat yang kekal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 24: Yakni sifat dunia. Seperti beras dan gandum. Seperti rerumputan. Maksudnya bumi yang indah dengan gunung-gunung dan lembah-lembahnya telah menghijau dengan tanam-tanamannya, indah dipandang mata dan menyegarkan jiwa. Mereka semakin berharap bahwa kenikmatan itu akan tetap terus dan langgeng bagi mereka karena keinginan mereka yang hanya terbatas kepadanya dan harapan mereka yang sampai di sana. Qadha’ (keputusan) atau azab Kami. Seakan-akan sebelumnya tidak ada, maka tangannya pun kosong dan hatinya pun penuh rasa sedih. Seperti inilah keadaan dunia. Yakni dengan menerangkannya, memperjelasnya dan memudahkan untuk dipahami dan dicerna. Orang yang mau menggunakan akal pikiran mereka untuk hal yang bermanfaat bagi mereka. Adapun orang yang lalai lagi berpaling, maka ayat-ayat itu tidak bermanfaat bagi mereka, dan penjelasannya tidak menyingkirkan keraguan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 24",
    "description": "Setelah dijelaskan bahwa kenikmatan yang diperoleh bagi orangorang musyrik hanyalah kenikmatan duniawi, lalu diingatkan bahwa sesungguhnya perumpamaan kehidupan duniawi yang kamu dambakan sampai melupakan kehidupan akhirat itu akan cepat sirna, hanya seperti air hujan yang kami turunkan dari langit, kemudian meresap ke dalam bumi, lalu tumbuhlah tanaman-tanaman bumi dengan subur karena air itu, di antaranya ada yang dimakan manusia dan hewan ternak. Hingga apabila bumi itu telah sempurna keindahannya karena tanamannya telah tumbuh warna-warni dengan sangat rindang, dan berhias indah dengan gunung-gunung dan lembah-lembahnya telah menghijau dengan beragam tanam-tanamannya, dan pemiliknya mengira bahwa mereka pasti menguasainya, yakni memetik hasilnya, tiba-tiba datanglah kepadanya azab kami berupa bencana atau hama pada waktu malam atau siang, lalu kami jadikan tanamannya seperti tanaman yang sudah disabit, yakni telah dipanen, bahkan kedahsyatan azab tersebut mengesankan seakan-akan belum pernah tumbuh tanaman kemarin. Demikianlah kami menjelaskan tanda-tanda kekuasaan kami kepada orang yang berpikir yang mau mengambil pelajaran dari azab yang telah ditimpakan kepada orangorang yang durhaka. Agar manusia tidak tertipu dengan kehidupan dunia yang fana, lalu Allah memberikan tuntunan menuju jalan yang benar dan penuh kedamaian. Dan Allah menyeru manusia ke da'rus-sala'm, yakni surga, dan memberikan petunjuk kepada orang yang dia kehendaki ke jalan yang lurus, yakni islam. Petunjuk Allah diberikan kepada siapa saja yang mau menerimanya."
  }
]