[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menyeru kalian menuju surga-surgaNya yang Dia sediakan bagi para waliNya, dan memberi petunjuk kepada orang-orang yang dikehendakiNya dari makhluk-makhlukNya, lalu memberinya taufik untuk menepati jalan yang lurus, yaitu islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Allah mengajak seluruh umat manusia ke dalam Surga-Nya yang menjadi Istana Kedamaian. Di dalam Surga itu manusia terbebas dari segala bentuk musibah dan kesedihan, dan aman dari kematian. Dan Allah membimbing hamba-hamba-Nya yang Dia kehendaki ke dalam agama Islam yang akan mengantarkan mereka ke dalam Istana Kedamaian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Dengan penjelasan dan al-Qur’an ini, Allah menyeru kalian kepada surga yang menjadi tempat yang penuh keamanan, ketenangan, dan keselamatan dari segala keburukan. Dan Allah memberi taufik kepada siapa yang Dia kehendaki untuk menuju agama Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَاللهُ يَدْعُوٓا۟ إِلَىٰ دَارِ السَّلٰمِ (Allah menyeru (manusia) ke Darussalam (surga)) Setelah Allah menjelaskan kepada hamba-hamba-Nya tentang nilai kehidupan dunia dan sifatnya yang cepat sirna dan berubah, Allah kemudian menyeru hamba-hamba-Nya untuk lebih mengharapkan kehidupan akhirat dan surga, negeri kesejahteraan dan keselamatan dari segala kekurangan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Yahya bin Mu’adz al-Rozy berkata : Aku takjub kepada seorang laki-laki yang dengan amalannya ia mengharap pandangan dan perhatian dari umat manusia padahal mereka juga makhluq yang sama dengannya, dan dari seorang lelaki yang memiliki harta lantas Tuhan yang Maha perkasa mengambil pijaman darinya, dan seorang lelaki yang cinta kepada persahabatan makhluq dan Allah memanggilnya untuk mengalihkan cinta itu hanya kepada-Nya, kemudian Yahya membacakan firman Allah : { وَاللَّهُ يَدْعُو إِلَىٰ دَارِ السَّلَامِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Dan setelah menjelaskan betapa cepatnya menghilangkan dunia, Allah memunculkan hasrat terhadap akhirat, dimana disebutkan bahwa Allah menyeru (manusia) untuk beriman agar sampai ke surga, yaitu rumah yang damai dari petaka. Dia juga akan membantu orang yang ingin menapaki jalan yang lurus, yaitu berikrar tentang keberadaan dan keesaan Allah, menaati hukum-hukumNya, dan menunaikan perintah-perintahNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah mengajak kepada rumah keselamatan} surga {dan memberi petunjuk} memberi tuntunan {kepada siapa saja yang Dia kehendaki menuju jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Allah mengajak, mendorong dan menganjurkan hamba-hambaNya secara umum kepada Darussalam, dan Dia mengkhususkan hidayah kepada siapa yang Dia kehendaki untuk dipilih dan diangkatNya. Ini adalah karunia dan kebaikanNya, dan Allah mengkhususkan rahmatNya kepada hambaNya yang Dia kehendaki. Itu adalah keadilan dan hikmahNYa, tidak ada seorang pun yang memiliki hujjah setelah adanya penjelasan dan diutusnya Rasul. Allah menamakan Surga dengan Darussalam karena ia selamat dari segala cacat dan kekurangan, dan hal itu karena kesempurnaan nikmatnya, kelengkapannya, kekelannya dan keindahannya dari segala segi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 25: Setelah Allah menerangkan keadaan dunia dan hasil dari kenikmatannya, maka Allah Subhaanahu wa Ta'aala mendorong manusia kepada kehidupan akhirat. Allah mengajak manusia tanpa terkecuali ke surga dengan mengajak mereka beriman. Namun hidayah-Nya hanya diberikan kepada orang yang Dia kehendaki, inilah ihsan dan karunia-Nya; Dia khususkan rahmat-Nya kepada yang Dia kehendaki, sedangkan seruan-Nya diarahkan kepada semua manusia tanpa terkecuali, inilah keadilan dan kebijaksanaan-Nya. Arti kata darussalam adalah tempat yang penuh kedamaian dan keselamatan. Surga disebut Darussalam karena bersihnya dari segala musibah dan kekurangan. Hal itu tidak lain karena sempurna kenikmatannya, kesempurnaannya dan kekekalannya serta keindahannya di atas segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 25",
    "description": "Agar manusia tidak tertipu dengan kehidupan dunia yang fana, lalu Allah memberikan tuntunan menuju jalan yang benar dan penuh kedamaian. Dan Allah menyeru manusia ke da'rus-sala'm, yakni surga, dan memberikan petunjuk kepada orang yang dia kehendaki ke jalan yang lurus, yakni islam. Petunjuk Allah diberikan kepada siapa saja yang mau menerimanya. Bagi orang-orang yang berbuat baik, ada pahala yang terbaik, yaitu surga, dan tambahannya, yakni kenikmatan melihat Allah (lihat: surah al-qiya'mah/75: 22-23). Dan wajah mereka tidak ditutupi debu hitam akibat kesedihan dan tidak pula dalam kehinaan, tetapi muka mereka berseri-seri ekspresi kegembiraan. Mereka itulah penghuni surga, mereka kekal di dalamnya selama-lamanya."
  }
]