[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi orang-orang mukmin yang berbuat ihsan dalam beribadah kepada Allah, lau menaatinya dalam perkara yang diperintahkaNya dan yang di larangNya, ada surga dan tambahnya, yaitu melihat wajah Allah di dalam surga, ampunan dan keridaan(Nya). Dan tidak akan menutupi wajah-wajah mereka Debu dan kehinaan, sebagai mana yang akan di alami oleh penghuni neraka. Orang-orang yang bersipat demikian ini, mereka itu adalah para penghuni surga, mereka tinggal di dalamnya selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Orang-orang yang berbuat baik dengan cara melaksanakan apa yang diwajibkan Allah kepada mereka dan meninggalkan apa yang Allah haramkan kepada mereka akan mendapatkan ganjaran terbaik, yaitu Surga. Dan mereka akan mendapatkan tambahan ganjaran, yaitu memandang wajah Allah. Wajah mereka tidak diselimuti debu dan tidak diliputi kehinaan maupun kenistaan. Orang-orang yang baik tersebut adalah penghuni tetap Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Ini merupakan kabar gembira yang besar dan kenikmatan yang agung bagi orang-orang yang melakukan yang terbaik dalam menyembah Allah, dengan perkataan dan perbuatan mereka yang benar serta akhlak mereka yang mulia. Mereka akan mendapatkan surga, dan lebih dari itu mereka juga akan dapat melihat wajah Allah, sedang wajah mereka berseri-seri, tidak tertutupi oleh kesusahan dan kegalauan. Mereka adalah orang-orang yang memiliki derajat yang tinggi, dan akan kekal di dalam surga, tanpa merasakan kematian selama-lamanya. Dari Shuhaib, dari Nabi, beliau bersabda: “Jika para penghuni surga telah memasuki surga, Allah akan bertanya kepada mereka, ‘Apakah kalian ingin Aku menambah kenikmatan kalian?’ Mereka menjawab, ‘bukankah Engkau telah membuat wajah kami bersinar, memasukkan kami ke dalam surga, dan menyelamatkan kami dari neraka?’ Maka tersingkaplah hijab; dan tidak ada kenikmatan yang lebih mereka sukai selain dapat melihat kepada Tuhan mereka.” (Shahih Muslim 1/163, no. 181, kitab iman, bab dalil orang-orang beriman dapat melihat Tuhan mereka di akhirat)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. لِّلَّذِينَ أَحْسَنُوا۟ الْحُسْنَىٰ (Bagi orang-orang yang berbuat baik, ada pahala yang terbaik) Yakni bagi orang-orang yang mendirikan amalan-amalan yang diwajibkan kepada mereka dengan sebaik-baiknya, dan berpaling dari kemaksiatan yang dilarang untuk mereka lakukan. Dan pahala yang baik yaitu surga. وَزِيَادَةٌ ۖ (dan tambahannya) Yakni berupa keistimewaan untuk dapat melihat wajah Allah yang mulia. Dalam hadist yang dikeluarkan oleh Imam Ahmad dan Imam Muslim, dari Shuhaib bahwa Rasulullah suatu hari membaca ayat ini kemudian bersabda: “apabila penghuni surga telah memasuki surga dan penghuni neraka memasuki neraka, berserulah seorang penyeru: “wahai penghuni surga, sesungguhnya Allah memiliki janji kepada kalian, dan kini Dia akan menepatinya”. Maka mereka bertanya: “janji apakah itu? Bukankah Dia telah memberatkan timbangan kebaikan kami, menjadikan wajah kami bersinar, dan memasukkan kami ke dalam surga, serta menjauhkan kami dari neraka?”. Kemudian Rasulullah melanjutkan sabdanya: “Maka tersingkaplah bagi mereka penghalang sehingga mereka dapat melihat Allah, dan demi Allah, tidak ada pemberian dari Allah yang lebih mereka sukai dan lebih menjadikan mereka ridha daripada kesempatan melihat kepada-Nya. وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٌ(Dan muka mereka tidak ditutupi debu hitam) Yakni wajah mereka tidak ditutupi oleh rupa yang muram atau asap api neraka akibat kehinaan dan penyesalan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26 Bagi orang-orang yang berbuat baik dengan iman, ibadah, dan amal ada pahala yang terbaik yaitu surga dan tambahan kenikmatan ruh yaitu melihat wajah Allah. Dan muka mereka tidak ditutupi debu hitam ataupun kehinaan. Mereka itulah penghuni surga, mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi orang-orang yang berbuat baik itu sesuatu yang terbaik} surga {dan tambahannya} bagi mereka itu tambahan atas hal tersebut yaitu melihat Allah yang Maha Mulia {Tidak ditutupi} tidak ditutup {debu hitam} debu {dan tidak pula kehinaan} tidak pula kehinaan {Mereka itulah para penghuni surga. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. ketika Dia mengajak kepada Darussalam maka seakan-akan jiwa itu berhasrat kepada amal perbuatan yang mengantarkan kepada surga, maka Dia menyampaikannya dengan FirmanNya, “Orang-orang yang berbuat baik mendapatkan pahala yang terbaik (surga) dan tambahannya.” Maksudnya, oraang-orang yang berbuat baik dalam beribadah kepada Allah hendaklah beribadah kepadaNya dengan pijakan muraqabah (merasa diawasi), dan ketulusan dalam beribadah, serta melaksankan apa yang dia mampu darinya. Mereka juga berbuat baik kepada hamba-hamba Allah dengan apa yang mereka mampu, berupa perbuatan baik yang bersifat perkataan, dan perbuatan: memberikan kebaikan materi, kebaikan jasmani, amar ma’ruf, nahi mungkar, mengajar orang-orang bodoh, memberi nasihat kepada orang-orang yang berpaling dan kebaikan-kebaikan yang lain. Orang-orang yang berbuat baik itulah yang mendapatkan kebaikan yaitu Surga yang sempurna kebaikannya dan sebuah tambahan yaitu melihat Wajah Allah yang mulia, mendengar FirmanNya, meraih ridhaNya, berbahagia dengan kedekatan kepadaNya. Dengan ini terwujudlah harapan tertinggi yang diharapkan oleh orang-orang yang berharap dan sesuatu yang dimohon oleh orang-orang yang memohon. Kemudian Dia menyebutkan lenyapnya ketakutan mereka, Dia berfirman, “Dan muka mereka tidak ditutupi debu hitam dan tidak (pula) kehinaan.” Maksudnya, mereka tidak ditimpa sesuatu yang tidak diinginkan dari segi apa pun, karena jika sesuatu tidak diinginkan menimpa manusia, maka hal itu akan terbacaa di wajahnya, ia akan kusut dan suram. Adapun mereka (yang beramal shalih), maka Allah berfirman tentang mereka, amu dapat mengetahui dari wajah mereka kesenangan mereka yang penuh kenikmatan.(Al-Muthafifin:24). \"Mereka itu adalah penduduk surge\" yang tinggal kekal di dalamnya, tidak berpindah, tidak lenyap dan tidak akan berubah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 26: Setelah Allah mengajak manusia ke Darussalam, seakan-akan setiap jiwa menjadi rindu untuk mengerjakan amalan yang dapat memasukkan ke surga, maka Allah memberitahukan ayat di atas. Dengan berbuat ihsan dalam beribadah kepada Allah, yaitu dengan beribadah sambil merasakan seakan-akan melihat-Nya atau minimal merasakan pengawasan dari-Nya. Demikian juga berbuat ihsan kepada hamba-hamba Allah dengan melakukan perbuatan baik yang mampu dilakukan baik berupa perkataan maupun perbuatan kepada hamba-hamba Allah, termasuk di dalamnya beramar ma’ruf dan bernahi munkar, mengajarkan orang yang tidak tahu, menasehati orang yang berpaling, dsb. Yang dimaksud dengan tambahannya ialah kenikmatan melihat wajah Allah Subhaanahu wa Ta'aala, mendengarkan firman-Nya, memperoleh keridhaan-Nya, senang karena bisa dekat dengan-Nya. Maksudnya muka mereka berseri-seri dan tidak ada sedikit pun tanda kesusahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 26",
    "description": "Bagi orang-orang yang berbuat baik, ada pahala yang terbaik, yaitu surga, dan tambahannya, yakni kenikmatan melihat Allah (lihat: surah al-qiya'mah/75: 22-23). Dan wajah mereka tidak ditutupi debu hitam akibat kesedihan dan tidak pula dalam kehinaan, tetapi muka mereka berseri-seri ekspresi kegembiraan. Mereka itulah penghuni surga, mereka kekal di dalamnya selama-lamanya. Adapun orang-orang yang berbuat kejahatan akan mendapat balasan kejahatan yang setimpal dengan yang telah mereka kerjakan dan mereka diselubungi kehinaan akibat dari kejahatan tersebut. Tidak ada bagi mereka seorang pelindung pun yang menyelamatkan mereka dari azab Allah, seakan-akan wajah mereka ditutupi dengan kepingan-kepingan malam yang gelap gulita, yakni suram dan muram ekspresi dari penyesalan dan kesedihan yang mendalam. Mereka itulah penghuni neraka, mereka kekal di dalamnya."
  }
]