[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang berbuat keburukan di dunia, di mana mereka kafir dan berbuat maksiat kepada Allah, bagi mereka balasan yang setimpal atas tindakan-tindakan buruk mereka yang telah mereka kerjakan dulu, berupa siksaan Allah di akhirat. Dan mereka akan di tutupi kehinaan dengan kenistaan. Dan tidak ada bagi mereka dari siksa Allah seorang penghalang yang bisa menghalangi mereka jika Dia menyiksa mereka, seolah-olah wajah mereka di tutupi oleh potongan hitam dari malam gelap gulita. Mereka itulah para penghuni nereka, mereka tinggal abadi di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sedangkan orang-orang yang berbuat buruk, baik berupa kekafiran maupun kemaksiatan akan mendapatkan balasan buruk yang setimpal dengan perbuatan mereka, yaitu siksa Allah di Akhirat. Dan wajah mereka diselimuti kenistaan dan kehinaan. Tidak ada seorangpun yang dapat melindungi mereka dari azab Allah manakala azab itu datang menimpa mereka. Seolah-olah wajah mereka memakai topeng hitam dari gelapnya malam akibat banyaknya asap hitam Neraka yang menerpanya. Orang-orang tersebut adalah penghuni Neraka yang akan menetap di sana untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Dan orang-orang yang melakukan dosa-dosa besar berupa kesyirikan dan kekafiran, mereka akan mendapat balasan perbuatan buruk mereka itu dengan siksaan yang sangat berat; mereka akan diliputi kehinaan dan siksaan, tidak ada yang dapat melindungi mereka dari kemurkaan Allah, seakan-akan wajah mereka diliputi warna hitam akhir malam yang gelap gulita. Mereka adalah orang-orang yang jauh dari rahmat Allah, dan mereka menjadi bahan bakar api neraka selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. جَزَآءُ سَيِّئَةٍۭ بِمِثْلِهَا (Dan orang-orang yang mengerjakan kejahatan (mendapat) balasan yang setimpal) Yakni Allah membalas satu keburukan dengan satu keburukan pula tanpa ditambah, namun dibalas sesuai besar kecilnya keburukan itu. وَتَرْهَقُهُمْ ذِلَّةٌ ۖ( dan mereka ditutupi kehinaan) Mereka tertutupi kehinaan dan kerendahan. مَّا لَهُم مِّنَ اللهِ مِنْ عَاصِمٍ ۖ( Tidak ada bagi mereka seorang pelindungpun dari (azab) Allah) Yakni tidak ada yang mampu melindungi mereka dari kemurkaan dan azab Allah, siapapun itu. أُغْشِيَتْ وُجُوهُهُمْ قِطَعًا مِّنَ الَّيْلِ مُظْلِمًا ۚ (seakan-akan muka mereka ditutupi dengan kepingan-kepingan malam yang gelap gelita) Akibat kerasnya asap gelap api neraka yang menutupi muka mereka. أُو۟لٰٓئِكَ أَصْحٰبُ النَّارِ ۖ( Mereka itulah penghuni neraka) Mereka tidak akan bisa lepas darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27 Dan orang-orang yang mengerjakan kejahatan dan kekufuran kepada Allah mereka akan mendapat balasan yang setimpal, satu keburukan juga akan dibalas dengan satu keburukan tidak ada tambahan hukuman dan mereka akan ditutupi kehinaan. Mereka tidak mempunyai seorang pelindung pun dari azab Allah, seakan-akan muka mereka ditutupi dengan kepingan-kepingan malam yang gelap gelita. Mereka itulah penghuni neraka; mereka kekal dan tidak akan keluar dari dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berbuat} melakukan {kejahatan itu (akan menerima) balasan kejahatan yang setimpal dan mereka diliputi kehinaan} mereka diliputi kehinaan dan rasa malu {Tidak ada bagi mereka seorang pelindung} pelindung yang mencegah azab itu menimpa mereka {dari Allah. Seakan akan wajah-wajah mereka ditutupi} ditutupi {potongan} kegelapan {malam yang gelap gulita. Mereka itulah para penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. ketika Allah menyebutkan penduduk Surga, maka Dia menyebutkan penghuni Neraka, lalu Dia menyebutkan bahwa barang dagangan mereka yang mereka dapatkan di dunia adalah amal-amal buruk yang mengundang murka Allah berupa berbagai macam kekufuran, pendustaan dan kemaksiatan, maka balasan mereka adalah keburukan sepertinya yakni balasan yang menyedihkan mereka menurut keburukan yang mereka lakukan sesuai dengan perbedaan keadaan mereka, “Dan mereka ditutupi”, maksudnya dinaungi “kehinaan” di hati mereka dan ketakutan terhadap azab Allah, tidak ada yang melindungi mereka darinya dan tidak ada yang membentengi. Kehinaan batin itu merembet kepada lahir mereka, maka wajah mereka menghitam, “seakan-akan muka mereka ditutupi dengan kepingan-kepingan malam yang gelap gulita. Mereka itulah penghuni Neraka, mereka kekal di dalamnya.” Berapa (jauh) beda antara kedua golongan? Betapa jauhnya antara keduanya. \"Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri. Kepada Tuhannyalah mereka melihat. Dan wajah-wajah (orang kafir) pada hari itu muram, mereka yakin bahwa akan ditimpakan kepadanya malapetaka yang amat dahsyat.(Al-Qiyamah:22-25) \"Banyak muka pada hari itu berseri-seri, tertawa dan bergembira ria, dan banyak (pula) muka pada hari itu tertutup debu, dan ditutup lagi oleh kegelapan. Mereka itulah orang-orang kafir lagi durhaka\" (‘Abasa:38-42)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 27: Seperti melakukan kekafiran, kesyirkkan dan mendustakan para rasul. Kehinaan itu menimpa hati mereka, dan terus menyebar ke lahiriah mereka sehingga wajah mereka hitam. Betapa jauh perbedaan antara penghuni surga dengan penghuni neraka. Ya Allah, masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke surga dan jauhkanlah kami dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 27",
    "description": "Adapun orang-orang yang berbuat kejahatan akan mendapat balasan kejahatan yang setimpal dengan yang telah mereka kerjakan dan mereka diselubungi kehinaan akibat dari kejahatan tersebut. Tidak ada bagi mereka seorang pelindung pun yang menyelamatkan mereka dari azab Allah, seakan-akan wajah mereka ditutupi dengan kepingan-kepingan malam yang gelap gulita, yakni suram dan muram ekspresi dari penyesalan dan kesedihan yang mendalam. Mereka itulah penghuni neraka, mereka kekal di dalamnya. Ayat ini menjelaskan ancaman bagi orang yang menyekutukan Allah. Dan ingatlah pada hari ketika itu kami mengumpulkan mereka semuanya untuk dihisab, kemudian kami berkata kepada orang yang mempersekutukan Allah, tetaplah di tempatmu dalam keadaan rendah dan hina, kamu dan para sekutumu. Lalu kami pisahkan mereka, yakni penyembah dan sembahannya, sehingga mereka saling menyalahkan dan menyangkal satu sama lain, dan berkatalah sekutu-sekutu, yakni sembahan yang mereka persekutukan dengan Allah, kamu sekali-kali tidak pernah menyembah kami. Sesungguhnya orang-orang yang menyembah selain Allah pada hakekatnya adalah menyembah hawa nafsu mereka sendiri, karena hawa nafsu merekalah yang menyuruh menyembah selain Allah."
  }
]