[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Rasul), pada hari Kami menghimpun semua makhluk untuk proses perhitungan amal dan pembalasanya. Kemudian kami berfirman kepada orang-orang yang menyekutukan Allah, “Tetaplah berada di tempat kalian dan sekutu-sekutu kalian yang kalian sembah selain Allah, hingga kalian melihat tindakan apa yang akan di lakukan terhadap kalian.” Lalu kami pisahkan antara kaum musyrikin dan sesembahan-sesembahan mereka, dan berlepas dirilah sesembahan-sesembahan yang mereka sembah selain Allah yang dahulu mereka sembah dari orang-orang yang menyembahnya. Sesembahan-sesembahan itu berkata kepada kaum musyrikin, ”Kalian itu tidaklah menyembah kami sewaktu di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dan ingatlah -wahai Rasul- Hari Kiamat di waktu Kami menghimpun seluruh makhluk, kemudian Kami berfirman kepada orang-orang yang menyekutukan Allah, selama di dunia, \"Tetaplah di tempat kalian -wahai orang-orang musyrik- bersama tuhan-tuhan selain Allah yang kalian sembah di dunia. Kemudian Kami pisahkan antara tuhan-tuhan yang disembah dan orang-orang yang menyembahnya. Dan tuhan-tuhan yang disembah berlepas diri dari orang-orang yang menyembahnya seraya berkata, \"Kalian tidak pernah menyembah kami di dunia.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Hari Kami mengumpulkan seluruh makhluk untuk menjalankan hisab, dan Kami berkata kepada orang-orang musyrik: “Tetaplah di tempat kalian bersama apa yang kalian sembah selain Allah, dan berdirilah dengan penuh kehinaan.” Kemudian Kami pisahkan mereka dari sesembahan-sesembahan mereka, dan sesembahan-sesembahan itu berlepas diri dari mereka dengan mengatakan: “Kami sama sekali tidak mengetahui bahwa kalian menyembah kami! Dan kami juga tidak pernah memerintahkan kalian untuk menyembah kami. Maka cukuplah Allah sebagai saksi antara kami dengan kalian, bahwa kami tidak memerintahkan kalian menyembah kami, dan kami tidak mengetahui penyembahan kalian terhadap kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَيَوْمَ نَحْشُرُهُمْ جَمِيعًا ((Ingatlah) suatu hari (ketika itu). Kami mengumpulkan mereka semuanya) Orang yang menyembah dan sesembahannya akan dikumpulkan untuk ditanyai. ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُوا۟( kemudian Kami berkata kepada orang-orang yang mempersekutukan) Sebagai olokan bagi mereka di depan para saksi dan kehadiran sesembahan mereka. مَكَانَكُمْ(Tetaplah di tempatmu itu) Yakni berdirilah ditempat kalian. أَنتُمْ وَشُرَكَآؤُكُمْ ۚ( kamu dan sekutu-sekutumu) Kalian beserta sekutu yang kalian jadikan sesembahan bersama Allah. فَزَيَّلْنَا بَيْنَهُمْ ۖ( Lalu Kami pisahkan mereka) Yakni kami pisahkan antara sesembahan dan orang-orang yang menyembahnya. وَقَالَ شُرَكَآؤُهُم مَّا كُنتُمْ إِيَّانَا تَعْبُدُونَ(dan berkatalah sekutu-sekutu mereka: “Kamu sekali-kali tidak pernah menyembah kami) Yakni kami tidak pernah menyuruh kalian untuk menyembah kami, akan tetapi hawa nafsu, kesesatan, dan setan-setan kalian yang memerintahkan kalian untuk menyembah kami lalu kalian mentaatinya. Jadi ini merupakan pengingkaran bahwa penyembahan mereka kepada sesembahan ini bukan karena perintah sesembahan ini agar menyembah mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28 Ingatlah suatu hari dimana Kami mengumpulkan mereka semuanya yaitu mereka yang berbuat baik maupun yang berbuat buruk. Kemudian Kami berkata kepada orang-orang musyrik sebagai hinaan kepada mereka: “Tetaplah kamu bersama sesembahanmu di tempatmu itu”. Lalu Kami pisahkan mereka dengan sekutu mereka, penyembah dengan sesembahan, berkatalah sekutu-sekutu mereka: “Kamu sekali-kali tidak pernah menyembah kami, kalian hanya menyembah nafsu dan setan-setan kalian dalam kesyirikan. Ini adalah pengingkaran atas penyembahan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan pada hari Kami mengumpulkan mereka semuanya, kemudian Kami berfirman kepada orang-orang yang musyrik,“Tetaplah di tempat kalian} tetaplah di tempat kalian {kalian dan para sekutu kalian” Lalu Kami pisahkan} Kami memisahkan {di antara mereka} di antara orang-orang musyrik dan sekutu-sekutu mereka {lalu sekutu-sekutu mereka berkata,“Kalian sekali-kali tidak pernah menyembah kami.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Allah berfirman, “Ingatlah suatu hari (ketika itu) Kami mengumpulkan mereka semuanya.” Maksudnya, kami mengumpulkan seluruh makhluk untuk pertemuan pada hari yang telah ditentukan, Kami hadirkan orang-orang musyrik dan tuhan yang mereka sembah selain Allah, “kemudian Kami berkata kepada orang-orang yang mempersekutukan (Rabb), ‘Tetaplah kamu dan sekutu-sekutumu di tempatmu itu’ .” Maksudnya, tetaplah di tempatmu agar bisa diambil keputusan antara dirinya dengan dirimu. “Lalu Kami pisahkan mereka”, yakni Kami pisahkan mereka secara fisik dan hati, maka terjadilah di antara mereka permusuhan yang kuat setelah sebelumnya di dunia mereka memberikan cinta dan kasih yang tulus. Kecintaan dan pertemanan itu berubah menjadi permusuhan dan kebencian. Sekutu-sekutu mereka berlepas diri dari mereka dan berkata, “Kamu sekali-kali tidak pernah menyembah kami”, karena kami menyucikan Allah dari sekutu atau rekanan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 28: Termasuk pula sesembahan yang mereka sembah selain Allah Subhaanahu wa Ta'aala. Yakni patung dan berhala atau yang mereka sembah selain Allah. Dengan orang-orang mukmin. Atau bisa juga maksudnya, Allah pisahkan mereka dengan sesembahan mereka, baik pisah badan maupun hati dan muncul permusuhan yang keras antara mereka dengan sesembahannya setelah sebelumnya ketika di dunia mereka memberikan kecintaan dan ketulusan kepada sesembahannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 28",
    "description": "Ayat ini menjelaskan ancaman bagi orang yang menyekutukan Allah. Dan ingatlah pada hari ketika itu kami mengumpulkan mereka semuanya untuk dihisab, kemudian kami berkata kepada orang yang mempersekutukan Allah, tetaplah di tempatmu dalam keadaan rendah dan hina, kamu dan para sekutumu. Lalu kami pisahkan mereka, yakni penyembah dan sembahannya, sehingga mereka saling menyalahkan dan menyangkal satu sama lain, dan berkatalah sekutu-sekutu, yakni sembahan yang mereka persekutukan dengan Allah, kamu sekali-kali tidak pernah menyembah kami. Sesungguhnya orang-orang yang menyembah selain Allah pada hakekatnya adalah menyembah hawa nafsu mereka sendiri, karena hawa nafsu merekalah yang menyuruh menyembah selain Allah. Lebih lanjut sembahan mereka mengatakan, karena hakikatnya kamu menyembah hawa nafsu kamu, maka cukuplah Allah menjadi saksi antara kami dengan kamu, sebab kami tidak tahu-menahu tentang penyembahan kamu kepada kami, karena kami hanyalah makhluk ciptaan Allah, yang tidak bisa mendatangkan manfaat atau menolak madarat."
  }
]