[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka cukuplah Allah menjadi saksi di antara kami dan kalian. Sesungguhnya kami tidaklah tahu apa yang kalian katakan dan apa yang kalian perbuat. Dan sesungguhnya kami itu lalai terhadap penyembahan kalian kepada kami, kami tidak merasa itu terjadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Di sini tuhan-tuhan selain Allah yang mereka sembah berlepas diri dari mereka seraya berkata, \"Allah-lah yang menjadi saksi -dan cukuplah Allah sebagai saksi- bahwa kami tidak rela dengan tindakan kalian menyembah kami. Kami pun tidak pernah menyuruh kalian menyembah kami. Dan kami tidak merasa bahwa kalian menyembah kami.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَكَفَىٰ بِاللهِ شَهِيدًۢا بَيْنَنَا وَبَيْنَكُمْ (Dan cukuplah Allah menjadi saksi antara kami dengan kamu) Yakni Allah menjadi saksi bahwa kami tidak pernah memerintahkan kalian untuk menyembah kami atau kami pernah rela untuk disembah. إِن كُنَّا عَنْ عِبَادَتِكُمْ لَغٰفِلِينَ(bahwa kami tidak tahu-menahu tentang penyembahan kamu (kepada kami).) Kami tidak pernah merasa bahwa kalian menyembah kami, dan kami juga tidak pernah meminta kalian untuk melakukan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29 Maka cukuplah Allah menjadi saksi antara kami dengan kamu, bahwa kami tidak tahu-menahu juga tidak memerintahkan kalian untuk menyembah kami. Kamipun tidak ridho atas perbuatan kalian, kami tidak merasakan apapun dan kami juga tidak meminta kalian menyembah kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka cukuplah Allah menjadi saksi antara kami dengan kalian, sesungguhnya tidaklah kami} tidaklah kami {mengetahui tentang penyembahan kalian itu} kecuali tidak tahu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Dan cukuplah Allah menjadi saksi antara kami dengan kamu, bahwa kami tidak tahu menahu tentang penyembahanmu (kepada kami).” Kami tidak memerintahkanmu dengannya dan kami pun tidak mengajakmu kepadanya. Kamu hanyalah menyembah makhluk yang mengajakmu kepada itu, yaitu setan sebagaimana Firman Allah, \"Bukankah Aku telah memerintahkan kepadamu hai Bani Adam supaya kamu tidak menyembah syaitan? Sesungguhnya syaitan itu adalah musuh yang nyata bagi kamu\",(Yasin:60), dan Firman Allah \"Dan (ingatlah) hari (yang di waktu itu) Allah mengumpulkan mereka semuanya kemudian Allah berfirman kepada malaikat: \"Apakah mereka ini dahulu menyembah kamu?\". Malaikat-malaikat itu menjawab: \"Maha Suci Engkau. Engkaulah pelindung kami, bukan mereka; bahkan mereka telah menyembah jin; kebanyakan mereka beriman kepada jin itu\".(Saba:40-41). Para malaikat yang mulia, para Nabi, para wali dan lain-lain pada Hari Kiamat berlepas diri dari siapa yang menyembahnya. Mereka tidak mengakui bahwa mereka telah mengajak manusia agar menyembahnya, dan mereka itu adalah orang yang benar lagi baik dalam hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 29: Yakni kami tidak menyuruh kamu menyembah kami dan tidak pula mengajakmu kepadanya, bahkan kamu hanya menyembah makhluk yang mengajakmu, yaitu setan. Oleh karena itulah, para malaikat, para nabi dan para wali nanti akan berlepas diri dari para penyembahnya pada hari kiamat. Ketika itulah orang-orang musyrik menyesal dengan penyesalan yang bukan main menyesalnya, mereka mengetahui sejauh mana amal yang mereka kerjakan, serta perkara buruk yang mereka lakukan. Ketika itu, jelaslah kedustaan mereka, dan bahwa mereka mengada-ada terhadap Allah, ibadah mereka sia-sia, sesembahan mereka lenyap, dan hubungan pun terputus, na’uudzu billahi min dzaalik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 29",
    "description": "Lebih lanjut sembahan mereka mengatakan, karena hakikatnya kamu menyembah hawa nafsu kamu, maka cukuplah Allah menjadi saksi antara kami dengan kamu, sebab kami tidak tahu-menahu tentang penyembahan kamu kepada kami, karena kami hanyalah makhluk ciptaan Allah, yang tidak bisa mendatangkan manfaat atau menolak madaratselanjutnya Allah menjelaskan dalam ayat ini bahwa di tempat itu, yakni di padang mahsyar, setiap jiwa merasakan pembalasan dari apa yang telah dikerjakannya ketika di dunia dan setelah kematian menjemputnya, mereka dikembalikan kepada Allah, pelindung mereka yang sebenarnya, tidak ada pelindung selain dia, dan lenyaplah dari mereka apa yang mereka ada-adakan sebagai sembahan dan pelindung palsu."
  }
]