[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya tuhan kalian adalah Dzat yang menciptakan langit dan bumi dalam masa enam hari. Kemudian Dia bersemayam (diatas dan tinggi) di atas arsy dengan bersemayam yang layak dengan keagungan dan kebesaranNya, mengatur urusan-urusan seluruh makhlukNya, tidak ada seorang pun yang sanggup melawanNya dalam keputusanNya. Dan tidak ada pemberi syafaat yang memberikan syafaat di sisiNya pada hari kiamat, kecuali setelah Dia memberi izin bagimnya untuk memberikan syafaaat, maka beribadhalah kalian kepada Allah, tuhan kalian yang memiliki sifat-sifat tersebut, dan murnikanlah ibadah kepadaNya. apakah kalian tidak mengambil ibrah dan mengambil pelajaran dari ayat-ayat dan hujjah- hujjah ini?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya Tuhan kalian -wahai orang-orang yang merasa heran- adalah Allah yang telah menciptakan langit yang demikian besarnya dan menciptakan bumi yang begitu luasnya dalam enam masa, kemudian Dia bersemayam di atas Arasy. Jadi, bagaimana mungkin kalian merasa heran ketika Dia mengangkat seorang laki-laki dari bangsa kalian menjadi utusan-Nya? Padahal Dia lah satu-satunya yang berhak membuat keputusan dan ketentuan di dalam kerajaan-Nya yang luas ini. Dan tidak ada seorangpun dapat memberikan syafaat di sisi-Nya dalam masalah apapun tanpa izin dan restu dari-Nya. Pemilik sifat-sifat yang demikian itu ialah Allah, Tuhan kalian. Maka beribadahlah hanya kepada-Nya. Mengapa bukti-bukti dan argumen-argumen itu tidak mampu mengingatkan kalian akan keesaan-Nya? Karena siapapun yang mempunyai ingatan sekecil apapun tentang hal itu pasti dia akan menyadari hal itu dan beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah menjelaskan sifat rububiyah, uluhiyah, dan keagungan-Nya: Sesungguhnya Allah, Sang Pencipta kalian dan Tahan yang berhak disembah, telah menciptakan tujuh langit dan tujuh bumi dalam enam hari. Kemudian Dia bersemayam sesuai dengan keagungan-Nya di ‘Arsy yang merupakan makhluk yang paling besar. Dia mengatur segala urusan makhluk-Nya. Tidak ada yang mampu memberi syafaat melainkan setelah mendapat izin dari-Nya. Itulah Allah, Pencipta kalian Yang Agung; maka sembahlah Dia Semata, dan ikhlaslah dalam menyembah-Nya. Tidakkah kalian mengambil ibrah dari ayat-ayat ini bahwa Allah-lah satu-satunya Tuhan yang berhak disembah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. إِنَّ رَبَّكُمُ اللهُ الَّذِى خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ فِى سِتَّةِ أَيَّامٍ (Sesungguhnya Tuhan kamu ialah Allah Yang menciptakan langit dan bumi dalam enam masa) Yakni Dia memiliki kekuasaan yang besar, maka bagaimana pengutusan seorang Rasul merupakan dari golongan manusia menjadi sesuatu yang mengherankan? يُدَبِّرُ الْأَمْرَ (mengatur segala urusan) Yakni Yang menetapkan dan mengatur sendiri segala yang ada di langit, bumi, ‘Arsy, dan makhluk-makhluk lainnya. مَا مِن شَفِيعٍ إِلَّا مِنۢ بَعْدِ إِذْنِهِۦ ۚ (Tiada seorangpun yang akan memberi syafa’at kecuali sesudah ada izin-Nya) Tidak seorangpun yang dapat memberi syafaat kepada-Nya kecuali dengan izin-Nya, karena Dia Maha Mengetahui hikmah dan kebenaran. Ayat ini menjelaskan bahwa ditangan Allah wewenang mengatur segala urusan. فَاعْبُدُوهُ (maka sembahlah Dia) Karena hebatnya penciptaan-Nya dan besarnya kekuasaan-Nya. أَفَلَا تَذَكَّرُونَ (Maka apakah kamu tidak mengambil pelajaran) Karena siapa yang memiliki sedikit saja kemauan untuk mengambil pelajaran maka ia akan mengetahui hal ini dengan jelas."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ أَفَلَا تَذَكَّرُونَ } Selama ahli ilmu senantiasa mengingat untuk terus bertafakkur, dan selalu berfikir untuk terus mengingat, dan berbicara kepada hati-hati; sampai ia berucap dengan bijaksana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Wahai Nabi, beritahu mereka bahwa Tuhan kalian adalah Allah yang menciptakan langit dan bumi dalam 6 hari, lalu beristiwa’ di atas ‘Arsy, yaitu istiwa’ yang sesuai dengan keagungan dan kebesaranNya. ‘Arsy adalah makhluk agung yang sesuai denganNya dan kita tidak mengetahui hakikat Arys. Dia (Allah) mengatur sendiri urusan semua makhluk. Tidak ada satupun pada hari kiamat yang bisa memberi syafaat kepada orang lain kecuali dengan dua syarat yaitu dengan seizinNya kepada yang memberi syafaat. Dan izin itu hanya untuk orang yang diridhaiNya sesuai ketentuan dan kebijaksanaanNya. Ini adalah dalil tentang kebebasan Allah dalam mengatur segala urusan. Itulah Allah satu-satunya Tuhan kalian, Tidak ada satupun yang menyertainya dalam urusan ketuhanan dan pengaturan. Maka menyembahlah hanya kepadaNya. Apakah kalian tidak berpikir bahwa sang pencipta lagi mengatur inilah yang satu-satunya disembah?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhan kalian adalah Allah yang menciptakan langit dan bumi dalam enam hari kemudian Dia bersemayam} meninggi dan naik {di atas ʻArsy. Dia mengatur segala urusan. Tidak ada yang bisa memberi syafaat, kecuali setelah mendapat izinNya. Itulah Allah, Tuhan kalian. Maka sembahlah Dia. Apakah kalian tidak mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Allah berfirman menjelaskan rububiyah, uluhiyah dan kebesaranNYa ”Sesungguhnya Rabbmu ialah Allah Yang menciptakan langit dan bumi dalam enam hari,” padahal Dia mampu menciptakannya dalam sekejap, akan tetapi (hal itu Dia lakukan) karena Dia mempunyai hikmah ilahiyah di dalamnya, dan karena Dia lembut dalam perbuatanNya. Dan di antara hikmahNya padanya adalah bahwa Dia menciptakannya dengan kebenaran dan untuk kebenaran, dan agar Dia dikenal dengan nama-nama dan sifatNya, serta diesakan dengan ibadah, “kemudian” setelah penciptaan langit dan bumi. “Dia bersemayam di atas Arasy”, dengan bersemayam yang sesuai dengan kebesaranNya “untuk mengatur segala urusan”, di langit dan di bumi, berupa menghidupkan dan mematikan, menurunkan rizki, memutar hari di antara manusia, mengangkat kesulitan dari orang-orang yang tertimpa kesulitan, menjawab permohonan orang-orang yang memohon kepadaNya. Segala macam penataan turun dariNya dan naik kepadaNya. Seluruh makhluk tunduk kepada keperkasaanNya, patuh kepada kebesaran dan kekuasaanNya. “Tiada seorang pun yang akan memberi syafaat kecuali sesudah ada izinNya.” Tiada seorang pun dari mereka berani memberi syafaat meski dia adalah makhluk terbaik sehingga Allah mengizinkannya, dan Dia tidak mengizinkan kecuali kepada orang yang diridhaiNya, dan Dia tidak ridha kecuali pada ahli tauhid dan keikhlasan kepadaNya. “(Dzat) yang demikian itulah”, yang keadaanNya seperti ini adalah “Allah, Rabbmu.” Dia –lah Allah yang memiliki sifat ilahiyah yang meliputi seluruh sifat-sifat kesempurnaan dan sifat rububiyah yang meliputi seluruh sifat-sifat perbuatan. “Maka sembahlah Dia.” Esakanlah dalam segala bentuk ibadah yang kamu mampu. “Maka apakah kamu tidak mengambil pelajaran?” dari dalil-dalil yang menunjukkan bahwa hanya Dia yang berhak disembah, dipuji, pemilik kebesaran dan kemuliaan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 3: Dalam ayat ini, Allah Subhaanahu wa Ta'aala menerangkan rububiyyah (kepengurusan)-Nya terhadap alam semesta, keberhakan-Nya untuk diibadahi dan keagungan-Nya. Meskipun Dia mampu menciptakannya sekejap mata. Tidak dilakukan-Nya demikian adalah karena hikmah(kebijaksanaan)-Nya dan karena Dia Maha Lembut dalam perbuatannya. Di antara hikmah-Nya pula adalah untuk mengajarkan tatsabbut (sikap tidak tergesa-gesa) kepada makhluk, dan bahwa Dia menciptakannya dengan benar dan untuk kebenaran agar Dia dikenal dengan nama-nama dan sifat-Nya serta diesakan dalam ibadah. Tentang hari di sini ada yang berpendapat seperti hari-hari di dunia dan ada pula yang berpendapat bahwa satu harinya 1000 tahun, wallahu a’lam. Yang sesuai dengan kebesaran-Nya. Baik di langit maupun di bumi dengan menghidupkan dan mematikan, menurunkan rezeki, mempergilirkan hari-hari bagi manusia, menghilangkan derita orang yang terkena musibah, mengabulkan doa orang yang berdoa. Berbagai bentuk pengaturan turun dari-Nya dan naik kepada-Nya, semua makhluk tunduk kepada keperkasaan-Nya, tunduk pula kepada keagungan dan kekuasaan-Nya. Ayat ini sebagai bantahan terhadap keyakinan kaum musyrik bahwa berhala atau patung dapat memberi syafa’at kepada mereka. Ayat ini menerangkan, bahwa tidak ada yang maju untuk memberi syafaat meskipun ia makhluk yang paling utama sampai Allah mengizinkan, dan Dia tidak mengizinkannya kecuali bagi orang yang diridhai-Nya, dan Dia tidak ridha kecuali kepada Ahli tauhid dan ikhlas. Yakni terhadap dalil-dalil yang menunjukkan bahwa Dia yang satu-satunya berhak disembah; yang memiliki keagungan dan kemuliaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 3",
    "description": "Kalau orang kafir merasa heran atas diturunkannya Al-Qur'an kepada nabi Muhammad, maka apakah mereka tidak merasa heran dengan penciptaan langit dan bumi serta segala isinya' tuhan mahakuasa menurunkan Al-Qur'an kepada nabi Muhammad, sebagaimana dia mahakuasa menciptakan langit dan bumi. Sesungguhnya tuhan kamu dialah Allah yang menciptakan langit dan bumi yang terbentang luas, dalam enam masa untuk memberikan pelajaran kepada manusia bahwa segala sesuatu perlu proses, melalui perencanaan yang matang dan dikerjakan secara maksimal. Jika Allah menghendaki, maka dia mahakuasa menciptakan keduanya dalam sekejap. Setelah sempurna masa penciptaan langit dan bumi, kemudian dia bersemayam di atas 'arsy, singgasana untuk mengatur segala urusan makhluk-Nya. Tidak ada yang dapat memberi syafaat, yakni pertolongan pada hari kiamat untuk mendapat keringanan atau terbebas dari azab Allah kecuali setelah ada izin-Nya. Itulah Allah, zat yang mahaagung, tuhanmu yang memelihara dan membimbingmu, maka sembahlah dia, karena hanya dia yang berhak disembah, jangan mempersekutukan dia dengan apa pun. Apakah kamu tidak mengambil pelajaran dari kesempurnaan penciptaan langit dan bumi beserta isinya' semuanya tunduk, patuh, dan bertasbih kepada Allah, tuhan pengatur segala urusan. Setelah dijelaskan bahwa Allah pencipta langit dan bumi, dan hanya dia yang berhak disembah, lalu pada ayat ini dijelaskan tentang kepastian datangnya hari kiamat. Pada hari tersebut, hanya kepada-Nya, yakni kepada Allah kamu semua akan kembali. Itu merupakan janji Allah yang benar dan pasti tidak sedikit pun diragukan lagi. Sesungguhnya dialah yang maha kuasa memulai penciptaan makhluk, kemudian mengulanginya, yakni menghidupkannya kembali pada hari kebangkitan, agar dia dapat memberi balasan kepada orang-orang yang beriman dan mengerjakan kebajikan dengan balasan yang adil sesuai yang mereka kerjakan. Jika Allah menghendaki, maka berkat anugerah dan kemurahan-Nya, mereka akan memperoleh pahala melebihi yang mereka kerjakan. Sedangkan untuk orang-orang kafir disediakan balasan berupa minuman air yang mendidih yang dapat merusak seluruh alat pencernaan mereka dan akan memperoleh siksaan yang pedih karena kekafiran mereka. Inilah wujud keadilan Allah atas perbuatan hamba-Nya di dunia"
  }
]