[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di tempat perhitungan amal itu, masing-masing memeriksa jiwa keadaan-keadaan dan amal perbuatanya yang telah berlalu dan dahulu ia usahakan dan ia akan dibalas sesuai dengan itu. Bila baik maka balasannya baik, jika buruk, maka balasanya buruk. Dan semua akan dikembalikan kepada Allah, Yang Maha Menghakimi lagi Mahaadil. Penghuni surga akan di masukan ke surga dan penghuni nereka akan di masukan kedalam nereka. Dan lenyaplah dari kaum musyrikin apa-apa yang dahulu mereka sembah selain Allah, suatu tindakan yang mereka dustakan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Di tempat yang agung itu setiap orang diberitahu apa saja yang pernah dia perbuat selama hidupnya di dunia. Dan orang-orang musyrik dikembalikan kepada Tuhan mereka yang sebenarnya. Yaitu Tuhan yang mengurus perhitungan amal mereka. Dan lenyaplah keyakinan palsu mereka tentang pertolongan dari berhala-berhala mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Pada keadaan yang susah dan menakutkan itu, setiap orang mendapatkan kebaikan dan keburukan yang telah mereka lakukan, kemudian mereka mendapat balasannya. Mereka dikembalikan kepada Allah yang akan membalas mereka dengan adil; dan berhala-berhala yang disembah orang-orang musyrik itu lenyap dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. هُنَالِكَ تَبْلُوا۟ كُلُّ نَفْسٍ مَّآ أَسْلَفَتْ ۚ (Di tempat itu (padang Mahsyar), tiap-tiap diri merasakan pembalasan dari apa yang telah dikerjakannya dahulu) Yakni disana setiap orang merasakan dan mendapatkan balasan atas apa yang mereka kerjakan. وَرُدُّوٓا۟ إِلَى اللهِ مَوْلَىٰهُمُ الْحَقِّ ۖ( dan mereka dikembalikan kepada Allah Pelindung mereka yang sebenarnya) Yakni orang-orang musyrik dikembalikan kepada Tuhan mereka yang sesungguhnya, tanpa sesembahan bathil yang mereka ada-adakan. وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ (dan lenyaplah dari mereka apa yang mereka ada-adakan) Berupa sesembahan, mereka tidak dapat memberi manfaat atau syafaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30 Di tempat padang Mahsyar itu, setiap jiwa akan merasakan pembalasan atas segala apa yang telah dikerjakan dahulu, baik kebaikan maupun keburukan. Mereka dikembalikan kepada Allah Pelindung mereka yang sebenarnya serta Pemberi balasan kepada mereka Yang sebenarnya, bukan kepada sesembahan mereka. Lenyaplah para sesembahan yang mereka elu-elukan, tidak mampu memberikan pertolongan ataupun manfaat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di sanalah, setiap jiwa merasakan ujian} diuji {dari apa yang telah dikerjakan} apa yang telah berlalu baik kebaikan atau keburukan {dan mereka dikembalikan kepada Allah, pelindung mereka yang sebenarnya, dan lenyaplah} hilang {dari mereka apa yang mereka ada-adakan} yang mereka buat buat berupa kebohongan dan pertolongan dari tuhan-tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Pada saat itu, orang-orang musyrik menyesal dengan penyesalan yang tidak mungkin digambarkan. Mereka mengetahui kadar amal yang mereka lakukan dan sifat buruk yang mereka berikan. Pada hari itu jelaslah bagi mereka bahwa mereka adalah para pendusta dan bahwa mereka adalah orang-orang yang mengada-ada atas nama Allah. Ibadah mereka sesat, sesembahan mereka terkikis, segala sebab dan sarana telah terputus. Oleh karena itu, Allah berfirman, “Di tempat itu”, maksudnya pada hari itu “tiap-tiap diri merasakan pembalasan dari apa yang telah dikerjakannya dahulu.” Mereka mencari-cari amal perbuatan dan hasil usahanya lalu menantikan balasan. Ia dibalas dengan balasan yang sesuai, jika baik maka baik, jika buruk maka buruk. “Dan lenyaplah dari mereka apa yang mereka ada-adakan.” Yaitu ucapan mereka tentang kebenaran syirik yang mereka pegang, dan bahwa tuhan yang mereka sembah selain Allah memberi mereka manfaat dan menangkis azab dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 30",
    "description": "Selanjutnya Allah menjelaskan dalam ayat ini bahwa di tempat itu, yakni di padang mahsyar, setiap jiwa merasakan pembalasan dari apa yang telah dikerjakannya ketika di dunia dan setelah kematian menjemputnya, mereka dikembalikan kepada Allah, pelindung mereka yang sebenarnya, tidak ada pelindung selain dia, dan lenyaplah dari mereka apa yang mereka ada-adakan sebagai sembahan dan pelindung palsu. Setelah dijelaskan bahwa tuhan sembahan orang kafir kelak di akhirat akan lenyap dan tidak mampu memberi perlindungan kepada penyembahnya, lalu diperintahkan kepada nabi, katakanlah wahai nabi Muhammad kepada orang-orang kafir, siapakah yang memberi rezeki kepadamu dari langit seperti hujan dan cahaya matahari, dan rezeki dari bumi seperti tumbuhan yang beraneka ragam, atau siapakah yang kuasa menciptakan pendengaran dan penglihatan, dan siapakah yang mengeluarkan yang hidup dari yang mati, seperti ayam dari telur, dan mengeluarkan yang mati dari yang hidup, seperti telur dari ayam, dan siapakah yang mengatur segala urusan di alam raya ini sehingga berjalan dengan sangat teratur ' maka mereka akan menjawab, Allah. Jika demikian jawaban mereka, maka katakanlah, wahai nabi Muhammad mengapa kamu tidak bertakwa kepada-Nya'"
  }
]