[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah olehmu (wahai Rasul), kepada kaum musyrikin, “Siapakah yang memberi rizki kepada kalian dari langit melalui hujan yang di turunkanNya dan dari tanah melalui tanaman yang ditumbuhkanNya padanya berupa berbagai macam tanaman dan pepohonan yang kalian makan dan binatang ternak kalian? Dan siapakah yang memiliki apa yang kalian dan orang-orang selain kalian nikmati, berupa indra pendengaran dan penglihatan? Dan siapakah yang mengurus kehidupan dan kematian di alAm semesta ini seluruhnya, maka Dia mengeluarkan yang hidup dan yang mati sebagiannya dari sebagian yang lain tentang apa yang kalian ketahui dari mahkluk–mahkluk dan tentang apa yang tidak kalian kenal? Dan siapakah yang mengurus urusan di langit dan di bumi dan apa-apa yang terjadi di dalamnya, dan urusan kalian serta urusan seluruh mahkluk? Mereka akan menjawab pertanyaanmu bahwa sesungguhnya yang berkuasa melakukan itu semua adalah Allah. Maka katakanlah kepada mereka, “ apakah kalian tidak takut terhadap siksaan Allah, bila kalian menyembah objek sesembahan yang lain bersama Allah?."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, \"Siapakah yang memberi kalian rezeki dari langit dengan cara menurunkan air hujan kepada kalian? Siapakah yang memberi kalian rezeki dari dalam bumi dengan cara menumbuhkan tumbuh-tumbuhan di permukaannya dan menyediakan aneka tambang di dalam perutnya? Siapakah yang mengeluarkan makhluk hidup dari makhluk mati, seperti manusia dari sperma dan burung dari telur? Siapakah yang mengeluarkan makhluk mati dari makhluk hidup, seperti sperma dari hewan dan telur dari burung? Dan siapakah yang mengatur urusan langit dan bumi beserta makhluk-makhluk yang ada di dalamnya?\" Mereka pasti akan menjawab, \"Yang melakukan itu semua ialah Allah.\" Maka katakanlah kepada mereka, \"Tidakkah kalian menyadari hal itu dan merasa takut kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Allah memerintahkan rasul-Nya untuk mengingatkan orang-orang musyrik tentang keimanan rububiyah yang mereka yakini, agar dapat menjadi hujjah atas keimanan uluhiyah yang mereka ingkari: “Siapa yang memberi kalian rezeki dari langit dan bumi? Yang menciptakan pendengaran dan penglihatan bagi kalian? Yang mengeluarkan makhluk hidup dari makhluk mati, seperti tanaman dari biji kering? Yang mengeluarkan makhluk mati dari makhluk hidup, seperti air mani dari manusia? Dan yang mengatur segala urusan makhluk?” Niscaya mereka akan menjawab dan mengakui bahwa yang melakukan hal-hal tersebut adalah Allah. Dan katakanlah kepada mereka: “Apakah kalian tidak takut dari azab-Nya jika kalian menyembah selain-Nya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. قُلْ مَن يَرْزُقُكُم مِّنَ السَّمَآءِ (Katakanlah: “Siapakah yang memberi rezeki kepadamu dari langit) Yakni berupa hujan. وَالْأَرْضِ(dan bumi) Berupa tanaman dan barang-barang tambang. Oleh sebab itu mereka harus mengakui bahwa Allah adalah pencipta langit dan bumi. أَمَّن يَمْلِكُ السَّمْعَ وَالْأَبْصٰرَ(atau siapakah yang kuasa (menciptakan) pendengaran dan penglihatan) Yakni siapakah yang mampu menciptakan dan menyempurnakannya dengan sifat yang menakjubkan ini sehingga mereka dapat mengambil manfaat dari keduanya. وَمَن يُخْرِجُ الْحَىَّ مِنَ الْمَيِّتِ(dan siapakah yang mengeluarkan yang hidup dari yang mati) Yakni mengeluarkan manusia dari air mani, dan burung dari telur, serta tanaman dari biji-bijian. وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَىِّ (dan mengeluarkan yang mati dari yang hidup) Yakni mengeluarkan air mani dari manusia. وَمَن يُدَبِّرُ الْأَمْرَ ۚ (dan siapakah yang mengatur segala urusan?) Yakni yang mengatur dan menetapkan. فَسَيَقُولُونَ اللهُ ۚ( Maka mereka akan menjawab: “Allah”) Mereka akan menjawab bahwa yang melakukan hal-hal ini adalah Allah apabila mereka berlaku objektif dan melakukan pemikiran dengan cara yang benar. فَقُلْ أَفَلَا تَتَّقُونَ (Maka katakanlah “Mangapa kamu tidak bertakwa kepada-Nya)?”) Yakni kalian mengetahui hal itu, maka tidakkah kalian bertakwa kepada Allah yang telah melakukan hal-hal tersebut, sehingga kalian mengesakan-Nya dalam ibadah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31 Wahai Nabi, katakanlah kepada orang musyrik: “Siapakah yang memberi rezeki kepadamu dari langit dan bumi, atau siapakah yang kuasa (menciptakan) pendengaran dan penglihatan, dan siapakah yang mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup dan siapakah yang mengatur segala urusan?” Maka mereka akan menjawab: “Allah”. Maka katakanlah “Mengapa kamu tidak bertakwa kepada-Nya?” Mengapa tidak menggunakan pendengaran dan penglihatan untuk mentadaburi segala kekuasaan-Nya sehingga kalian dapat beriman?” Lalu mereka akan berkata kepadamu: “Allahlah yang menjalankan perkara ini” Maka katakanlah kepada mereka wahai rasul: “Apakah kalian tidak bertakwa dan takut kepada Allah Dzat yang menjalankan semua perkara ini, berimanlah hanya kepadaNya” Hal itu diperhatikann dengan pendengaran dan berbagai pandangan, karena pendengaran merupakan alat untuk mendapatkan pengetahuan dari segala arah, berbeda dengan penglihatan yang tidak dapat mendapat informasi kecuali melalui cara melihat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Siapakah yang menganugerahkan rezeki kepada kalian dari langit dan bumi, siapakah yang memiliki pendengaran dan penglihatan, siapakah yang menghidupkan dari yang mati dan mengeluarkan yang mati dari yang hidup, serta siapakah yang mengatur segala urusan” Maka mereka akan menjawab,“Allah” Maka katakanlah,“Apakah kalian tidak takut”} Apakah kalian tidak takut denganNya untuk menyembah sekutu selainNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Maksudnya, katakan kepada mereka yang menyekutukan Allah dengan sesuatu yang mana Dia (sendiri) tidak menurunkan hujjah yang bisa dijadikan alasan atas mereka pada tauhid rububiyah yang mereka akui atas tauhid uluhiyah yang mereka ingkari. “Katakanlah, ‘Siapakah yang memberi rizki kepadamu dari langit dan bumi’, “ dengan menurunkan rizki dari langit dan mengeluarkan macam-macamnya dari bumi dan memudahkan sebab-sebabnya padanya? “Atau siapakah yang kuasa (menciptakan) pendengaran dan penglihatan.” Maksudnya, siapa yang menciptakan keduanya dan Dia sekaligus pemiliknya? Keduanya disebut secara khusus untuk mengingatkan yang lebih utama dengan yang utama dan karena kemuliaan dan manfaatnya yang sempurna. “Dan siapakah yang mengeluarkan yang hidup dari yang mati.” Seperti menumbuhkan bermacam-macam pohon dan tumbuh-tumbuhan dari biji-bijian, mengeluarkan orang Mukmin dari kafir, burung dari telur dan lain-lain? “Dan mengeluarkan yang mati dari yang hidup.” Kebalikan dari yang sebelumnya? “Dan siapakah yang mengatur segala urusan?” di langit dan di bumi? Ini mencakup seluruh bentuk pengaturan Ilahiyah. Jika kamu menanyakan itu kepada mereka, “maka mereka akan menjawab, ‘Allah’. “ karena mereka mengakui semua itu bahwa Allah tidak memiliki sekutu dalam segala hal tersebut. “Maka Katakanlah”, kepada mereka sebagai pelaziman argumentasimu, “mengapa kamu tidak bertakwa (kepadaNya)?” apakah demi Allah kamu mengikhlaskan ibadah hanya kepadaNya tanpa sekutu bagiNya dan membuang sekutu-sekutu dan Rabb-rabb lain yang kamu sembah selain Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 31: Kepada orang-orang musyrik yang mengingkari uluhiyyah Allah (keberhakan Allah untuk diibadati; tidak selain-Nya) dan mengakui rububiyyah-Nya (bahwa Allah Penguasa alam semesta dan Pengaturnya). Misalnya mengeluarkan anak ayam dari telur, dan telur dari ayam, atau mengeluarkan tumbuhan dari biji, dan biji dari tumbuhan, atau mengeluarkan orang mukmin dari kekafiran dan sebaliknya. Dengan beriman, atau hanya beribadah kepada-Nya saja dan meninggalkan sesembahan selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 31",
    "description": "Setelah dijelaskan bahwa tuhan sembahan orang kafir kelak di akhirat akan lenyap dan tidak mampu memberi perlindungan kepada penyembahnya, lalu diperintahkan kepada nabi, katakanlah wahai nabi Muhammad kepada orang-orang kafir, siapakah yang memberi rezeki kepadamu dari langit seperti hujan dan cahaya matahari, dan rezeki dari bumi seperti tumbuhan yang beraneka ragam, atau siapakah yang kuasa menciptakan pendengaran dan penglihatan, dan siapakah yang mengeluarkan yang hidup dari yang mati, seperti ayam dari telur, dan mengeluarkan yang mati dari yang hidup, seperti telur dari ayam, dan siapakah yang mengatur segala urusan di alam raya ini sehingga berjalan dengan sangat teratur ' maka mereka akan menjawab, Allah. Jika demikian jawaban mereka, maka katakanlah, wahai nabi Muhammad mengapa kamu tidak bertakwa kepada-Nya' zat yang maha pemberi rezeki, pencipta pendengaran dan penglihatan, yang kuasa menghidupkan dan mematikan, dan maha pengatur alam raya, maka itulah Allah, dialah tuhan kamu yang sebenarnya; maka tidak ada setelah kebenaran itu melainkan kesesatan, yakni siapa pun yang tidak berkenan mengikuti kebenaran, maka yang ada tinggal kesesatan. Maka mengapa kamu berpaling dari kebenaran'."
  }
]