[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka (Dzat) yang demikian itu adalah Allah, Tuhan kalian. Dia Mahabenar tiada keraguan di dalamnya, yang berhak disembah kepadaNya semata tanpa sekutu bagiNya. Maka apa lagi selain kebenaran kalau bukan kesesatan? Bagaimana kalian dipalingkan dari beribadah kepadaNya kepada penyembahan selainNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Begitulah wahai manusia! Zat Yang melakukan itu semua ialah Allah Yang Maha Benar, Pencipta kalian semua dan Pengatur semua urusan kalian. Apakah yang ada di luar kebenaran selain kesesatan dan kesia-siaan?! Dimana akal pikiran kalian terhadap kebenaran yang terang ini?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Itulah Allah yang Maha Kuasa, Tuhan yang berhak disembah, Yang Maha Esa; maka selain penyembahan kepada Allah adalah kesesatan. Bagaimana kalian dapat dipalingkan dari kebenaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. فَذٰلِكُمُ اللهُ رَبُّكُمُ الْحَقُّ ۖ (Maka (Zat yang demikian) itulah Allah Tuhan kamu yang sebenarnya) Yakni ini merupakan Tuhan yang sebenarnya, dan bukan sekutu-sekutu yang kalian ada-adakan yang tidak mampu melakukan apapun. فَمَاذَا بَعْدَ الْحَقِّ إِلَّا الضَّلٰلُ ۖ( maka tidak ada sesudah kebenaran itu, melainkan kesesatan) Yakni sifat ketuhanan Allah merupakan kebenaran yang mereka akui maka sesembahan yang lainnya adalah batil. فَأَنَّىٰ تُصْرَفُونَ (Maka bagaimanakah kamu dipalingkan (dari kebenaran)?) Yakni bagaimana bisa kalian berbelok dari kebenaran yang jelas, dan terjerumus ke dalam kesesatan sehingga kalian menjadikan selain-Nya sebagai tuhan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-Qur'an adalah merupakan jalan petunjuk yang lurus yang menjadi penyampai seseorang kepada Allah, maka apakah yang telah kamu raih dari petunjuk itu ? dan apa yang telah kamu capai dari cahaya-Nya yang terhampar dihadapanmu untuk kamu menapaki jalan-Nya dan mengetahui arah kebenaran itu ? ketahuilah wahai kamu yang meminta kesembuhan jiwa, dan wahai kamu memohon kekuatan rohani, anda yang mengharapkan kebaikan manusia ! sesungguhnya inilah jalan yang tepat yang tidak ada lagi jalan selainnya { فَمَاذَا بَعْدَ الْحَقِّ إِلَّا الضَّلَالُ ۖ فَأَنَّىٰ تُصْرَفُونَ } \"maka tidak ada sesudah kebenaran itu, melainkan kesesatan. Maka bagaimanakah kamu dipalingkan (dari kebenaran)?\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32 Maka itulah Allah Tuhan kamu yang sebenarnya Yang telah Membuat semuanya, bukan para sesembahan kalian. Itu semua tidak lain hanyalah sebuah kesesatan, kesyirikan, dan kekufuran. Maka bagaimanakah kamu bisa berpaling dari kebenaran yang jelas dan nyata yaitu dari iman menuju kesesatan dengan adanya bukti?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka itulah Allah Tuhan kalian yang sebenarnya. Tidak ada setelah kebenaran itu} maka manakah selain kebenaran itu {kecuali kesesatan. Maka bagaimana kalian dipalingkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. “Maka (Dzat yang demikian itu)”, yang menyifati diriNya dengan sifat yang disebutkan, “itulah Allah Rabbmu.” Yakni yang dipertuhankan lagi disembah, yang dipuji, yang melindungi semua makhluk dengan nikmatNya. Dia adalah “yang sebenarnya, maka tidak ada sesudah kebenaran itu, melainkan kesesatan.” Karena Allah yang memegang hak Penciptaan dan Pengaturan terhadap segala sesuatu. Tidak ada satu nikmatpun pada manusia melainkan dariNya. Tidak ada yang mendatangkan kebaikan kecuali Dia. Tidak ada yang menolak keburukan kecuali Dia, Pemilik Asmaul HUsna dan sifat-sifat yang sempurna yang agung lagi mulia dan terpuji. “Maka bagaimanakah kamu dipalingkan (dari kebenaran)” Dari penghambaan kepada Dzat yang difatNya demikian kepada penghambaan kepada yang tidak memiliki –dari keberadaannya- kecuali ketiadaan. Tidak memiliki (untuk dirinya sendiri) manfaat, mudarat, kematian, kehidupan dan kebangkitan, tidak memiliki kekuasaan sedikit pun, tidak memiliki sekutu dari segi manapun dan tidak ada syafaat di sisiNya kecuali dengan izin dariNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 32: Yang melakukan semua itu. Kalimat ini merupakan istifham taqrir (pertanyaan untuk menetapkan), yakni tidak ada lagi setelah kebenaran selain kesesatan. Oleh karena itu, barang siapa yang tidak menyembah Allah, maka ia terjatuh dalam kesesatan. Padahal buktinya jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 32",
    "description": "Zat yang maha pemberi rezeki, pencipta pendengaran dan penglihatan, yang kuasa menghidupkan dan mematikan, dan maha pengatur alam raya, maka itulah Allah, dialah tuhan kamu yang sebenarnya; maka tidak ada setelah kebenaran itu melainkan kesesatan, yakni siapa pun yang tidak berkenan mengikuti kebenaran, maka yang ada tinggal kesesatan. Maka mengapa kamu berpaling dari kebenaran'meskipun orang-orang kafir mengakui bahwa Allah pencipta dan pengatur alam raya, namun mereka tetap saja ingkar, sehingga Allah menghukum mereka. Demikianlah telah tetap hukuman tuhanmu terhadap orang-orang yang fasik, yakni keluar dari ketaatan dan tuntunan agama, karena sesungguhnya mereka terus menerus tidak beriman."
  }
]