[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana orang-orang musyrik telah kafir dan terus-menerus dalam kesyirikan mereka, telah pasti pula ketetapan Tuhanmu dan hukum serta ketentuaNya pada orang-orang yang keluar dari jalan ketaatan kepada tuhan mereka menuju maksiat kepadaNya dan mereka kafir kepadaNya, kerena sesungguhnya mereka itu tidak mengimani keesaan Allah, kenabian NabiNya, Muhammad dan tidak melaksanakan petunjuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Sebagaimana sifat rububiyah yang sejati dipastikan untuk Allah begitu juga kalimah Tuhanmu -wahai Rasul- yang terkait dengan takdir-Nya pun dipastikan untuk orang-orang yang menyimpang dari kebenaran secara terang-terangan, bahwasanya mereka tidak beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Sebagaimana hak Allah untuk disembah tanpa disekututkan dengan yang lain, ditetapkan kalimat Tuhanmu tentang azab bagi orang-orang yang enggan mentaati Allah, kerena mereka tidak mengimani keesaan Allah dan risalah Rasulullah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. كَذٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ (Demikianlah telah tetap hukuman Tuhanmu) Yakni hukum dan ketetapan-Nya. عَلَى الَّذِينَ فَسَقُوٓا۟( terhadap orang-orang yang fasik) Yakni orang-orang yang keluar dari kebenaran menuju kebatilan, dan terus menerus dalam kekafiran karena kedurhakaan dan keangkuhan mereka. أَنَّهُمْ لَا يُؤْمِنُونَ(karena sesungguhnya mereka tidak beriman) Ini merupakan kalimat yang layak mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33 Sebagaimana mereka berpaling dari iman menuju kesesatan, maka telah ditetapkan hukuman Tuhanmu terhadap orang-orang yang fasik yang telah keluar dari jalan kebenaran dan keimanan menuju kebatilan dan kekufuran, bahwa sesungguhnya mereka tidak akan beriman selamanya, sebab mereka telah membangkang dan tidak mau mentadaburi berbagai bukti kebenaran pada setiap ciptaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah telah pasti} telah berlaku {ketentuan Tuhanmu} hukum Tuhanmu yang sebelumnya {terhadap orang-orang yang berbuat fasik} tidak taat {sesungguhnya mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Celakalah orang yang menyekutukan sesuatu denganNya. Binasalah orang yang kafir kepadaNya, mereka kehilangan akal setelah kehilangan agama, bahkan kehilangan dunia dan akhiratNya. Oleh karena itu, Allah berfirman, “Demikianlah telah tetap kalimat (hukuman) Rabbmu terhadap orang-orang yang fasik, karena sesungguhnya mereka tidak beriman”, setelah Allah menunjukkan kepada mereka ayat-ayat yang jelas dan bukti-bukti yang gamblang yang cukup menjadi pelajaran bagi ulil albab, nasihat bagi orang-orang yang bertakwa dan petunjukk bagi alam semesta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 33: Sebagaimana mereka dipalingkan dari keimanan. Yaitu firman-Nya, “La amla’anna jahannam minal jinnati wan naasi ajma’iin.” (artinya: Aku pasti akan memenuhi neraka Jahanam dengan jin dan manusia (yang durhaka) semuanya) terj. surat Huud: 119, atau firmannya, “Annahum laa yu’minuun,” (lihat ayat di atas). Yakni orang-orang yang kafir. Setelah sebelumnya Allah menunjukkan kepada mereka ayat-ayat yang nyata dan keterangan yang jelas, yang di sana terdapat pelajaran bagi orang-orang yang berakal, nasehat bagi orang-orang yang bertakwa dan petunjuk bagi seluruh alam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 33",
    "description": "Meskipun orang-orang kafir mengakui bahwa Allah pencipta dan pengatur alam raya, namun mereka tetap saja ingkar, sehingga Allah menghukum mereka. Demikianlah telah tetap hukuman tuhanmu terhadap orang-orang yang fasik, yakni keluar dari ketaatan dan tuntunan agama, karena sesungguhnya mereka terus menerus tidak beriman. Selanjutnya Allah memerintahkan kepada nabi Muhammad, katakanlah, kepada orang-orang kafir adakah di antara sembahan yang kamu jadikan sekutu Allah itu yang dapat memulai penciptaan makhluk, kemudian mengulanginya, yakni menghidupkannya kembali' jawabannya pasti tidak ada. Karena itu katakanlah, wahai nabi Muhammad Allah yang memulai penciptaan makhluk, kemudian mengulanginya, yakni menghidupkannya kembali pada waktu yang sudah ditetapkannya sesuai kehendak-Nya. Maka bagaimana kamu dipalingkan oleh kebohongan dan hawa nafsu, sehingga menyembah selain Allah'"
  }
]