[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai rasul) ”Apakah ada dari tuahan-tuhan dan sesembahan-sesembahan kalian yang dapat memulai penciptaan makhluk apapun tanpa ada contoh sebelumnya, lalu membinasakannya setelah mengadakannya, kemudian mengembalikan bentuk ciptaan itu lagi seperti asalnya sebelum dibinasakannya? Sesungguhnya tuhan-tuhan itu tidak kuasa untuk melakukan itu.” katakanlah (wahai rasul), ”Allah lah satu-satunya yang menciptakan ciptaan, kemudian membinasakannya dan kemudian mengembalikan ciptaan itu sebagaimana semula. Mengapa kalian melenceng dari jalan kebenaran menuju jalan kebatilan, yaitu peribadahan kepada selain Alalh?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, \"Apakah di antara tuhan-tuhan yang kalian sembah selain Allah itu ada yang dapat menciptakan makhluk tanpa ada contoh sebelumnya, kemudian dapat membangkitkannya kembali sesudah kematiannya?\" Katakanlah kepada mereka, \"Allah dapat menciptakan makhluk tanpa ada contoh sebelumnya. Kemudian Allah akan membangkitkannya kembali sesudah kematiannya. Jadi bagaimana mungkin kalian -wahai orang-orang musyrik- bisa dipalingkan dari kebenaran menuju kebatilan?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Hai Rasulullah, katakanlah kepada orang-orang musryik untuk mengingkari dan mengolok mereka: “Apakah berhala-berhala yang kalian sembah itu memiliki kemampuan untuk menciptakan sesuatu, kemudian mematikannya dan membangkitkannya kembali seperti sedia kala? Hanya Allah-lah yang mampu menciptakan makhluk kemudian mematikannya dan membangkitkannya kembali. Mengapa kalian berpaling dari menyembah Allah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَبْدَؤُا۟ الْخَلْقَ ثُمَّ يُعِيدُهُۥ ۚ (Katakanlah: “Apakah di antara sekutu-sekutumu ada yang dapat memulai penciptaan makhluk, kemudian mengulanginya (menghidupkannya) kembali?”) Dengan membangkitkannya kembali setelah kematian. قُلِ اللهُ يَبْدَؤُا۟ الْخَلْقَ ثُمَّ يُعِيدُهُۥ (katakanlah: “Allah-lah yang memulai penciptaan makhluk, kemudian mengulanginya (menghidupkannya) kembali) Yakni kalian tidak menjawab dengan jawaban ini, dan tidak akan mengatakan bahwa sekutu-sekutu kalian dapat melakukannya. فَأَنَّىٰ تُؤْفَكُونَ(maka bagaimanakah kamu dipalingkan) Dipalingkan dari kebenaran menuju kepada kebatilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34 Katakanlah kepada orang musyrik wahai Rasul: “Apakah di antara sekutu-sekutumu ada yang mampu menciptakan alam atau makhluk, kemudian juga mampu menghidupkannya kembali pada hari kebangkitan?” katakanlah: “Allah-lah yang memulai penciptaan makhluk, kemudian mengulanginya atau menghidupkannya kembali; maka bagaimana bisa kamu dipalingkan untuk tidak menyembah selain Allah padahal berbagai bukti terpampang dengan jelas dan nyata?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah di antara sekutu-sekutu kalian ada yang dapat memulai penciptaan} menciptakan makhluk yang tidak ada asalnya atau keserupaannya sebelumnya {kemudian mengembalikannya} menghidupkannya lagi setelah kematiannya {Katakanlah,“Allah memulai penciptaan, kemudian mengembalikannya. Lalu bagaimana kalian dapat dipalingkan”} bagaimana bisa kalian dipalingkan dari kebenaran menuju kebathilan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Allah berfirman menjelaskan kelemahan tuhan-tuhan orang musyrik, dan bahwa ia tidak memiliki sifat-sifat yang membuatnya layak dipertuhankan bersama Allah, “Katakanlah, ‘Apakah di antara sekutu-sekutumu ada yang dapat memulai penciptaan makhluk’, “ yakni menciptakannya kemudian mengulanginya (menghidupkannya ) kembali?” ini adalah pertanyaan dengan makna penetapan dan penafian, maksudnya tak satu pun dari mereka yang menciptakan dan mengembalikan makhluk, ia lebih lemah dan lebih tidak mampu daripada itu. “Katakanlah, ‘Allah lah yang memulai penciptaan makhluk, kemudian mengulanginya (menghidupkannya) kembali,” tanpa sekutu dan tanpa pembantu dalam hal itu. “Maka bagaimanakah kamu dipalingkan (kepada menyembah yang selain Allah)?” yakni kamu dipalingkan dan dibelokkan dari pengahambaan kepada Dzat yang memulai penciptaan dan mengembalikanNya kepada yang tidak menciptakan apa pun bahkan ia yang diciptakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 34: Allah Subhaanahu wa Ta'aala menerangkan tentang kelemahan sesembahan orang-orang musyrik dan bahwa sesembahan itu tidak memiliki sifat yang layak dijadikan sebagai tuhan. Pertanyaan ini dimaksudkan untuk menafikan dan mentaqrir (mengokohkan), yakni tidak ada satu pun sesembahan selain Allah yang memulai penciptaan makhluk dan mengulanginya lagi, bahkan sesembahan itu sangat lemah sekali, sedangkan Allah mampu memulai penciptaan dan mengulanginya lagi. Yakni bagaimana kamu dapat dipalingkan dari menyembah Tuhan yang mampu menciptakan pertama kali dan mengulanginya lagi kepada sesembahan yang tidak mampu menciptakan apa-apa, sedangkan mereka sendiri dicipta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 34",
    "description": "Selanjutnya Allah memerintahkan kepada nabi Muhammad, katakanlah, kepada orang-orang kafir adakah di antara sembahan yang kamu jadikan sekutu Allah itu yang dapat memulai penciptaan makhluk, kemudian mengulanginya, yakni menghidupkannya kembali' jawabannya pasti tidak ada. Karena itu katakanlah, wahai nabi Muhammad Allah yang memulai penciptaan makhluk, kemudian mengulanginya, yakni menghidupkannya kembali pada waktu yang sudah ditetapkannya sesuai kehendak-Nya. Maka bagaimana kamu dipalingkan oleh kebohongan dan hawa nafsu, sehingga menyembah selain Allah' walaupun pada ayat sebelumnya sudah dipaparkan bukti kekuasaan Allah, namun orang kafir masih tetap menolak menyembah Allah yang maha pemberi petunjuk. Sehingga pada ayat ini kembali nabi Muhammad diperintah, katakanlah kepada orang-orang kafir, apakah di antara sembahan yang kamu jadikan sekutu Allah itu ada yang mampu membimbing menuju kepada kebenaran' pasti tidak ada, karena sembahan kamu adalah benda mati yang tidak mampu membimbing dirinya sendiri apalagi membimbing kamu. Karena itu katakanlah wahai nabi Muhammad, Allah-lah yang membimbing kepada kebenaran. Maka manakah yang lebih berhak diikuti, tuhan yang membimbing kepada kebenaran itu, ataukah orang yang tidak mampu membimbing bahkan perlu dibimbing' maka mengapa kamu berbuat demikian' bagaimanakah kamu mengambil keputusan' sungguh ini adalah keputusan yang batil dan zalim."
  }
]