[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”Apakah dari sekutu-sekutu kalian itu ada yang menunjukan kepada jalan yang lurus?” Sesungguhnya mereka itu tidak kuasa untuk melakukannya. Katakanlah kepada mereka, ”Allah lah satu-satunya yang dapat memberi petunjuk bagi orang yang sesat dari jalan hidayah menuju jalan kebenaran. Maka siapakah yang lebih pantas untuk diikuti: Dzat yang dapat memberikan petunjuk menuju kebenaran ataukah orang yang tidak memperoleh hidayah bagi diri sendiri karena tidak memiliki ilmu atau karena kesesatannya, yaitu sekutu-sekutu kalian yang tidak dapat memberikan hidayah dan tidak memperoleh hidayah kecuali bila diberi petunjuk? mengapa kalian menyamakan antara Allah dan makhluk ciptaannya? ini jelas penilaian yang batil.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Katakanlah -wahai Rasul- kepada mereka, \"Apakah di antara tuhan-tuhan yang kalian sembah selain Allah itu ada yang dapat membimbing manusia kepada kebenaran?\" Katakanlah kepada mereka, \"Hanya Allah sajalah yang dapat membimbing manusia kepada kebenaran. Apakah Tuhan yang dapat membimbing manusia kepada kebenaran itu lebih pantas diikuti, ataukah tuhan-tuhan sesembahan kalian yang tidak dapat membawa dirinya sendiri ke jalan yang benar, kecuali apabila dibimbing oleh pihak lain?! Bagaimana mungkin kalian memutuskan sesuatu secara batil ketika kalian menganggap bahwa mereka itu adalah sekutu-sekutu Allah?! Maha Tinggi Allah dari ucapan kalian itu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Dan katakanlah kepada mereka: “Apakah berhala-berhala yang kalian sembah selain Allah itu dapat memberi hidayah kepada orang-orang sesat menuju agama yang benar, yaitu agama Islam? Hanya Allah yang mampu melakukan itu. Apakah Dzat yang mampu memberi hidayah kepada kebenaran lebih berhak untuk diikuti atau berhala-berhala yang tidak mampu memberi hidayah kepada seorangpun, bahkan tidak mampu untuk memberi hidayah kepada dirinya sendiri? Berhala-berhala itu tidak dapat memberi hidayah dan tidak mendapat hidayah kecuali jika ada yang memberinya hidayah. Lalu mengapa kalian berpaling dan menyamakan Allah dengan berhala-berhala tersebut, serta menjalankan hukum dengan hukum yang batil?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَهْدِىٓ إِلَى الْحَقِّ ۚ (Katakanlah: “Apakah di antara sekutu-sekuturmu ada yang menunjuki kepada kebenaran?”) Yang memberi petunjuk kepada agama Islam dan menyeru manusia kepada kebenaran. Dan apabila mereka mengatakan tidak ada, maka katakanlah kepada mereka: قُلِ اللهُ يَهْدِى لِلْحَقِّ (Katakanlah “Allah-lah yang menunjuki kepada kebenaran”) Dengan menegakkan ayat-ayat-Nya pada makhluk-makhluk-Nya, mengutus para Rasul, menurunkan kitab-kitab, dan menciptakan akal, pemahaman, pendengaran, dan penglihatan yang dapat mengantarkan hamba-hamba-Nya kepada kebenaran. أَفَمَن يَهْدِىٓ إِلَى الْحَقِّ أَحَقُّ أَن يُتَّبَعَ أَمَّن لَّا يَهِدِّىٓ( Maka apakah orang-orang yang menunjuki kepada kebenaran itu lebih berhak diikuti ataukah orang yang tidak dapat memberi petunjuk) Yakni apakah Allah yang memberi petunjuk bagi manusia menuju kebenaran lebih berhak untuk diikuti perkataan-Nya atau yang lebih berhak adalah sesuatu yang tidak dapat mendapat petunjuk kecuali dengan petunjuk orang lain? فَمَا لَكُمْ كَيْفَ تَحْكُمُونَ (Bagaimanakah kamu mengambil keputusan?) Dalam menghadapai hujjah yang Kami kemukakan kepada kalian, dan bagaimana kalian mengambil keputusan dalam menjadikan mereka sebagai sekutu-sekutu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35 Katakanlah juga: “Apakah di antara sekutu-sekuturmu ada yang mampu menuntun menuju jalan kebenaran dan keselamatan?” Jika mereka tidak bisa menjawab maka katakanlah “Allah-lah Yang menuntun kepada jalan kebenaran dengan ayat-ayat yang telah Dia turunkan, mengutus rasul, menunurukan kitab, dan menciptakan semua makhluk”. Maka apakah orang-orang yang menunjukkankepada kebenaran itu lebih berhak diikuti ataukah orang yang tidak dapat memberi petunjuk kecuali jika diberi petunjuk? Mengapa kamu berbuat demikian? Bagaimanakah kamu mengambil keputusan dengan menjadikan para berhala sebagai sesembahan? Asal dari Yahiddi adalah yahtadi, dimana huruf ta’ diidghamkan pada huruf dal, lalu huruf ha’ difathah menggunakan harokatnya huruf ta’ sebelumnya atau dikasroh karena ada pertemuan dua sukun untuk menyesuaikan huruf setelahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Apakah di antara sekutu-sekutu kalian ada yang menunjukkan} menuntun {kepada kebenaran” Katakanlah,“Allah menunjukkan kepada kebenaran”} menuntun kepada kebenaran {Maka apakah yang menunjukkan kepada kebenaran lebih berhak diikuti ataukah yang tidak memberi petunjuk} tidak membimbing dengan dirinya {kecuali perlu diberi petunjuk. Maka mengapa kalian demikian? Bagaimanakah kaliab memberi keputusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “Katakanlah, ‘Apakah di antara sekutu-sekutumu ada yang menunjuki kepada kebenaran?’“ dengan menjelaskannya, menunjukannya, mengilhamkannya dan memberikan taufik kepadanya. “Katakanlah, ‘Allah-lah’, “ hanya Dia semata, “yang menunjuki”, kepada kebenaran dengan dalil-dalil, bukti-bukti, ilham, taufik dan pertolongan untuk meniti jalan yang lurus. “Ataukah orang yang tidak dapat memberi petunjuk kecuali (bila) diberi petunjuk?” karena kebodohan dan kesesatannya, ia adalah sekutu-sekutu mereka yang tidak mendapat petunjuk dan tidak memberi petunjuk kecuali jika ia diberi petunjuk. “Mengapa kamu (berbuat demikian)? Bagaimanakah kamu mengambil keputusan?” maksudnya apa yang membuatmu mengambil keputusan batil ini dengan menetapkan kebenaran beribadah kepada seseorang bersama Allah setelah munculnya hujjah dan bukti bahwa tidak ada yang berhak atas ibadah kecuali hanya Allah semata? Jika telah terbukti bahwa tuhan-tuhan yang mereka sembah tidak memiliki sifat-sifat ma’nawi dan fi’li yang membuatnya berhak untuk disembah bersama Allah, justru ia memiliki kekurangan-kekurangan yang membuktikan kebatilan ketuhanannya, maka dengan dasar apa ia dijadikan sebagai tuhan bersama Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 35: Dengan memberikan penjelasan dan arahan atau memberi taufiq kepada kebenaran. Dengan dalil dan keterangan yang nyata, dengan ilham dan taufiq, serta dengan membantu menempuh jalan yang lurus. Yakni apa yang menyebabkan kamu memberikan keputusan yang batil dengan mengesahkan penyembahan kepada selain Allah setelah tegaknya hujjah dan keterangan yang nyata bahwa tidak ada yang berhak diibadati selain Allah saja. Jika telah jelas bahwa sesembahan yang mereka sembah selain Allah tidak memiliki sifat yang layak dijadikan sebagai tuhan, bahkan sesembahan itu memiliki segala kekurangan yang menghendaki untuk dibatalkan ketuhanannya. Lantas karena alasan apa mereka menjadikannya sebagai tuhan? Tidak lain alasannya adalah karena setan menghias perbuatan buruk, kesesatan, dan perkara yang tidak masuk akal itu menjadi indah dihadapan manusia sehingga mereka menganggapnya sebagai perbuatan baik, petunjuk dan sebagai kebenaran. Tidak ada yang mereka ikut dalam hal ini selain dugaan semata, padahal dugaan itu tidak dapat mencapai kebenaran sedikit pun, mereka namakan sesembahan-sesembahan itu sebagai tuhan atas dasar dugaan semata dan mereka sembah pun atas dasar dugaan semata. Allah Subhaanahu wa Ta'aala berfirman,“Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengadakannya; Allah tidak menurunkan suatu keterangan pun untuk (menyembah)nya. Mereka tidak lain hanyalah mengikuti sangkaan-sangkaan, dan apa yang diingini oleh hawa nafsu mereka.” (Terj. An Najm: 23)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 35",
    "description": "Walaupun pada ayat sebelumnya sudah dipaparkan bukti kekuasaan Allah, namun orang kafir masih tetap menolak menyembah Allah yang maha pemberi petunjuk. Sehingga pada ayat ini kembali nabi Muhammad diperintah, katakanlah kepada orang-orang kafir, apakah di antara sembahan yang kamu jadikan sekutu Allah itu ada yang mampu membimbing menuju kepada kebenaran' pasti tidak ada, karena sembahan kamu adalah benda mati yang tidak mampu membimbing dirinya sendiri apalagi membimbing kamu. Karena itu katakanlah wahai nabi Muhammad, Allah-lah yang membimbing kepada kebenaran. Maka manakah yang lebih berhak diikuti, tuhan yang membimbing kepada kebenaran itu, ataukah orang yang tidak mampu membimbing bahkan perlu dibimbing' maka mengapa kamu berbuat demikian' bagaimanakah kamu mengambil keputusan' sungguh ini adalah keputusan yang batil dan zalim. Sejumlah pertanyaan yang diungkapkan pada ayat sebelumnya, sebagian ada yang dijawab oleh orang-orang kafir dan sebagiannya ada yang tidak mereka jawab. Dan kebanyakan mereka orang-orang kafir itu hanya mengikuti dugaan bahwa sembahan mereka dapat memberi manfaat, menolak mudarat dan dapat mendekatkan mereka kepada Allah. Sesungguhnya dugaan itu tidak sedikit pun berguna untuk melawan kebenaran yang datang dari Allah. Sungguh, Allah maha mengetahui apa yang mereka kerjakan dan akan memberi balasan kelak di hari kemudian."
  }
]