[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah orang yang diikuti oleh kebanyakan kaum musyrikin dalam menjadikan berhala-berhala itu sebagai sesembahan-sesembahan dan keyakinan mereka bahwa tuhan-tuhan sesembahan-sesembahan itu akan mendekatkan(mereka) kepada Allah kecuali hanya persangkaan dan praduga saja. Dan praduga itu tidak mendatangkan keyakinan sama sekali. Sesungguhnya Allah mahamengetahui dengan apa yang diperbuat kaum musyrikin berupa kekafiran dan mendustakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Kebanyakan orang-orang musyrik itu mengikuti apa yang tidak mereka miliki ilmunya. Mereka hanya mengikuti prasangka dan kebimbangan belaka. Padahal kebimbangan itu tidak bisa menggantikan kedudukan ilmu, sebaliknya sangat membutuhkan ilmu. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat. Tidak ada satupun perbuatan mereka yang luput dari pengetahuan-Nya. Dan Dia akan memberikan balasan yang setimpal kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Kepercayaan mereka terhadap berhala-berhala itu tidak lain hanyalah khayalan-khayalan dan kurafat-kurafat batil; dan kepercayaan yang berlandaskan kesesatan seperti itu hanyalah prasangka dusta yang tidak dapat menjadi dasar kebenaran sedikitpun. Allah Maha Mengetahui dosa-dosa besar yang mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَمَا يَتَّبِعُ أَكْثَرُهُمْ إِلَّا ظَنًّا ۚ (Dan kebanyakan mereka tidak mengikuti kecuali persangkaan saja) Dan tidak berdasarkan pengetahuan. Namun itu hanya persangkaan orang-orang sebelum mereka yang menganggap sembahan-sembahan ini dapat mendekatkan mereka kepada Allah dan dapat memberi mereka syafaat, dan prasangka ini tidak memiliki landasan sedikitpun, namun hanya sekedar khayalan belaka. إِنَّ الظَّنَّ لَا يُغْنِى مِنَ الْحَقِّ شَيْـًٔا ۚ (Sesungguhnya persangkaan itu tidak sedikitpun berguna untuk mencapai kebenaran) Karena urusan agama dibangun diatas ilmu, dan dengan ilmu dapat terbedakan antara kebenaran dari kebatilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36 Kebanyakan mereka orang musyrik hanya mengikuti persangkaan kosong dan anggapan rusak mereka saja secara terus menerus. Yaitu meniru nenek moyang mereka. Sesungguhnya persangkaan rusak itu tidak berguna sedikitpun untuk mencapai kebenaran. Sesungguhnya Allah Maha Mengetahui apa yang mereka kerjakan serta Maha Memberi balasan atas perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kebanyakan mereka hanya mengikuti dugaan. Sesungguhnya dugaan itu tidak sedikit pun berguna untuk mencapai kebenaran. Sesungguhnya Allah Maha Mengetahui apa yang mereka lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Jawabannya adalah bahwa itu termasuk bisikan setan kepada manusia, ia menghiasi kedustaan terburuk dan kesesatan tersesat sampai manusia meyakini hal itu, mengakrabinya dan menduganya benar, padahal ia bukan apa-apa. Oleh karena itu Allah berfirman, \"Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka, dan mereka hanyalah menduga-duga.\" (QS. Yunus :66) Maksudnya, sebenarnya mereka tidak mengikuti sekutu-sekutu bagi Allah, karena pada dasarnya Allah tidak memiliki sekutu sama sekali baik secara aql maupun naql, mereka hanyalah mengikuti dugaan. “Sesungguhnya persangkaan itu tidak sedikit pun berguna untuk mencapai kebenaran.” Mereka menamakannya Rabb dan menyembahnya bersama Allah. \"Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengadakannya; Allah tidak menurunkan suatu keteranganpun untuk (menyembah)nya.\" (An-Najm:23). “Sesungguhnya Allah Maha Mengetahui apa yang mereka kerjakan.” Dia akan membalas mereka dengan hukuman yang berat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 36: Dalam menyembah berhala, di mana mereka bertaqlid (ikut-ikutan) kepada nenek moyang mereka. Sesuatu yang diperoleh dengan dugaan sama sekali tidak bisa mengantikan sesuatu yang diperoleh dengan keyakinan. Sehingga Dia akan memberikan balasan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 36",
    "description": "Sejumlah pertanyaan yang diungkapkan pada ayat sebelumnya, sebagian ada yang dijawab oleh orang-orang kafir dan sebagiannya ada yang tidak mereka jawab. Dan kebanyakan mereka orang-orang kafir itu hanya mengikuti dugaan bahwa sembahan mereka dapat memberi manfaat, menolak mudarat dan dapat mendekatkan mereka kepada Allah. Sesungguhnya dugaan itu tidak sedikit pun berguna untuk melawan kebenaran yang datang dari Allah. Sungguh, Allah maha mengetahui apa yang mereka kerjakan dan akan memberi balasan kelak di hari kemudian. Pada ayat sebelumnya dijelaskan tentang kebenaran yang datang dari Allah dan dia-lah yang mampu membimbing kepada ke-benaran tersebut, lalu dalam ayat ini dijelaskan tentang kebenaran Al-Qur'an sebagai firman Allah. Dan tidak mungkin Al-Qur'an ini dibuat-buat oleh selain Allah; tetapi Al-Qur'an membenarkan kitab-kitab yang sebelumnya, seperti kitab taurat yang diturunkan kepada nabi musa as dan lainlain, dan menjelaskan hukum-hukum yang telah ditetapkannya, yakni sebagian ayat-ayat Al-Qur'an itu menjelaskan secara terperinci hukumhukum yang telah disebutkan dalam Al-Qur'an itu sendiri, tidak ada keraguan di dalamnya, dan merupakan petunjuk yang diturunkan dari tuhan seluruh alam."
  }
]