[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah ada kemudahan bagi siapapun untuk mendatangkan al-qur’an dari selain Allah. Sesungguhnya tidak ada seorang pun yang mampu untuk itu dari makhluk. Akan tetapi Alalh menurunkannya untuk membenarkan kitab-kitab yang diturunkanNya sebelumnya kepada para nabiNya, karena sesungguhnya agama Allah itu satu. Dan di dalam al-qur’an ini terdapat penjelasan dan rincian tentang ajaran yang Allah syariatkan bagi umat Muhammad .tidak ada keraguan bahwa sesungguhnya al-qur’an itu diwahyukan dari tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Al-Qur`ān ini tidak mungkin bisa dibuat dan disandarkan kepada selain Allah. Karena manusia pasti tidak mampu membuat karya yang sebanding dengan Al-Qur`ān. Akan tetapi Al-Qur`ān ini diturunkan untuk membenarkan kitab-kitab yang diturunkan sebelumnya dan menjelaskan ketentuan-ketentuan hukum yang masih global (umum) di dalamnya. Jadi tidak ada sedikitpun keraguan bahwa Al-Qur`ān ini diturunkan dari Tuhan yang telah menciptakan segenap makhluk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Tidak dapat diterima oleh orang yang memiliki akal yang sehat anggapan bahwa al-Qur'an merupakan suatu kedustaan terhadap Allah, padahal tidak ada seorangpun yang mampu mendatangkan al-Qur'an ini dari selain Allah. Allah menurunkan al-Qur'an sesuai dengan kitab-kitab terdahulu yang diturunkan kepada para nabi, di dalamnya terkandung penjelasan yang jelas mengenai hukum-hukum syariat Islam; dan tidak diragukan lagi bahwa al-Qur'an merupakan wahyu dari Sang Pencipta seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَمَا كَانَ هٰذَا الْقُرْءَانُ أَن يُفْتَرَىٰ مِن دُونِ اللهِ (Tidaklah mungkin Al Quran ini dibuat oleh selain Allah) Dan tidak ada yang dapat mendatangkan dengan semisalnya kecuali Allah. وَلٰكِن(akan tetapi) Al-Qur’an ini. تَصْدِيقَ الَّذِى بَيْنَ يَدَيْهِ (membenarkan kitab-kitab yang sebelumnya) Yakni kitab-kitab yang diturunkan kepada para Nabi sebelumnya, mereka telah diberitahu tentang turunnya al-Qur’an, sehingga al-Qur’an ini sebagai pembenar kabar dari kitab-kitab tersebut. وَتَفْصِيلَ الْكِتٰبِ(dan menjelaskan hukum-hukum yang telah ditetapkannya) Yakni hukum-hukum yang dijelaskan dalam al-Qu’ran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37 Tidaklah mungkin bahwa Al Quran ini suatu kebohongan dan bukan dari Allah; akan tetapi Al Quran itu berfungsi untuk membenarkan kitab-kitab yang sebelumnya seperti seruan dan shuhuf Nabi Ibrahim, juga kitab samawi seperti Taurat, Zabur, dan Injil. Juga untuk menjelaskan hukum-hukum yang telah ditetapkannya, tidak ada keraguan di dalamnya, (diturunkan) dari Tuhan semesta alam. Yang dimaksud dengan Al-Kitab adalah sejenisnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah Al-Qur’an ini} tidak sepantasnya Al-Qur’an ini {dibuat-buat} diada-adakan {oleh selain Allah, tetapi untuk membenarkan apa yang sebelumnya} kitab-kitab yang diturunkan sebelumnya {dan menrincikan} menjelaskan {ketetapan. Tidak ada keraguan di dalamnya, (diturunkan) dari Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Allah berfirman, “Tidaklah mungkin al-Quran ini dibuat oleh selain Allah,” maksudnya mustahil, tidak bisa dibayangkan al-Quran ini dibuat oleh selain Allah, karena ia adalah kitab yang agung, tiada kebatilan yang hadir dari depan dan belakangnya. Ia diturunkan dari Allah Yang Mahabijaksana lagi Mahaterpuji, ia adalah kitab di mana seandainya jin dan manusia berkumpul untuk membuat yang sepertinya niscaya mereka tidak mampu membuat yang sepertinya meskipun sebagian dari mereka menolong sebagian yang lain, ia adalah kitab yang dengannya Rabbul ‘alamin berfirman, bagaimana mungkin ada makhluk yang bisa berbicara sepertinya atau yang mendekatinya sementara ucapan itu menginduk kepada kebesaran dan sifat pembicara? Jika ada seseorang yang menandingi Allah dalam kebesaranNya dan sifat-sifat kesempurnaanNya, maka dia mungkin menghadirkan seperi al-Quran ini. Seandainya kita berandai-andai bahwa ada orang yang menghukum dan mengazabnya. Akan tetapi Allah menurunkan kitab ini sebagai rahmat bagi alam semesta dan sebagai hujjah atas seluruh manusia. Dia menurunkannya “untuk membenarkan kitab-kitab yang sebelumnya”, dari kitab-kitab Samawi yakni dengan menyetujui dan membenarkan kesaksian dan berita gembira tentang turunnya maka ia pun terjadi seperti yang diberitakan, “dan menjelaskan hukum-hukum yang telah ditetapakannya;” halal, haram, hukum-hukum diniyah, qadariyah dan berita-berita yang benar. “Tidak ada keraguan di dalamnya, (diturunkan) dari Rabb semesta alam”, tanpa sedikit pun kebimbangan di dalamnya dari sudut pandang apa pun, ia adalah kebenaran yang yakin, diturunkan dari Rabbul ‘alamin yang mengatur seluruh makhluk dengan nikmatNya. Dan di antara pengaturanNya yang besar adalah diturunkanNya kitab yang berisi kemaslahatan diniyah dan duniawiyah mereka yang mengandung kesempurnaan akhlak dan kebaikan amal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 37: Karena Al Qur’an adalah kitab yang mulia, kitab yang seandainya manusia dan jin semuanya berkumpul untuk membuat yang semisalnya tentu mereka tidak akan sanggup. Al Qur’an adalah firman Rabul ‘alamin. Bagaimana mungkin mereka akan sanggup berkata semisal Al Qur’an atau mendekatinya, sedangkan perkataan itu mengikuti keadaan yang berkata. Jika yang berkata adalah Allah Tuhan seluruh alam, maka tidak ada yang mampu menandinginya. Kalau pun ada orang yang berani berkata mengatasnamakan firman Allah, maka tentu Allah akan menyegerakan hukuman kepadanya dan segera menyiksanya. Allah menurunkan Al Qur’an sebagai rahmat bagi seluruh alam dan untuk menegakkan hujjah terhadap semua manusia. Allah menurunkannya membenarkan kitab-kitab Allah terdahulu, yakni sesuai dengan kitab-kitab terdahulu dan membenarkan apa yang disaksikannya. Maksudnya Al Quran menjelaskan secara terperinci hukum-hukum yang telah disebutkan dalam Al Quran itu"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 37",
    "description": "Pada ayat sebelumnya dijelaskan tentang kebenaran yang datang dari Allah dan dia-lah yang mampu membimbing kepada ke-benaran tersebut, lalu dalam ayat ini dijelaskan tentang kebenaran Al-Qur'an sebagai firman Allah. Dan tidak mungkin Al-Qur'an ini dibuat-buat oleh selain Allah; tetapi Al-Qur'an membenarkan kitab-kitab yang sebelumnya, seperti kitab taurat yang diturunkan kepada nabi musa as dan lainlain, dan menjelaskan hukum-hukum yang telah ditetapkannya, yakni sebagian ayat-ayat Al-Qur'an itu menjelaskan secara terperinci hukumhukum yang telah disebutkan dalam Al-Qur'an itu sendiri, tidak ada keraguan di dalamnya, dan merupakan petunjuk yang diturunkan dari tuhan seluruh alam. Muhammad, buatlah sebuah surah yang semisal dengan surah Al-Qur'an, dan ajaklah siapa saja di antara kamu orang yang mampu membuatnya selain Allah, jika kamu orang-orang yang benar dalam tuduhan itu."
  }
]