[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah patut mereka mengatakan ”sesungguhnya al-qur’an ini telah dibuat-buat oleh Muhammad dari dirinya sendiri?, padahal sesungguhnya mereka tahu bahwa Muhammad adalah manusia seperti mereka? katakanlah kepada mereka (wahai rasul), ”maka cobalah kalian datangkan satu surat dari jenis yang serupa dengan al-qur’an ini dari segi nadzomnya dan kekuatan hidayahnya. Dan carilah bantuan untuk itu dengan siapa saja yang dapat kalian kumpulkan selain Allah, dari bangsa manusia dan jin, jika kalian itu orang-orang yang benar dalam pengakuan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Ataukah orang-orang musyrik itu akan berkata, \"Sesungguhnya Muhammad -ṣallallāhu 'alaihi wa sallam- lah yang membuat Al-Qur`ān ini atas inisiatifnya sendiri dan menisbahkannya kepada Allah.\" Katakanlah -wahai Rasul- sebagai jawaban kepada mereka, \"Jika memang aku yang telah membuat Al-Qur`ān ini atas inisiatifku sendiri, sedangkan aku adalah manusia biasa seperti kalian, cobalah kalian membuat satu surah saja yang sebanding dengannya. Dan ajaklah siapa saja yang bisa kalian ajak untuk membantu kalian, jika kalian sungguh-sungguh dengan tuduhan kalian bahwa Al-Qur`ān ini adalah buatan manusia dan sesuatu yang dusta. Kalian pasti tidak akan bisa membuatnya. Dan ketidakmampuan kalian itu -sedangkan kalian adalah ahli bahasa dan sastra yang hebat- menunjukkan bahwa Al-Qur`ān itu benar-benar diturunkan dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Apakah mereka tetap berada dalam kesesatan seraya berkata: “Apakah Muhammad membuat-buat al-Qur'an ini sendiri?” Hai Rasulallah, katakanlah kepada mereka: “Jika yang kalian katakan itu benar, maka datangkanlah kepadaku satu surat yang seperti al-Qur'an ini; dan mintalah bantuan dari jin dan manusia sesuka kalian, jika perkataan kalian benar bahwa aku yang membuat al-Qur'an.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. قُلْ فَأْتُوا۟ بِسُورَةٍ مِّثْلِهِۦ (Katakanlah: “maka cobalah datangkan sebuah surat seumpamanya) Dalam kefasihan dan keindahannya; dan kalian memiliki pengetahuan yang sama denganku dalam bahasa Arab dan kefasihan ucapan. وَادْعُوا۟( dan panggillah) Orang-orang yang membantu dan menolong kalian. مَنِ اسْتَطَعْتُم(siapa-siapa yang dapat kamu panggil) Dari suku-suku Arab yang lain dan berhala-berhala yang kalian jadikan sekutu untuk membantu kalian. إِن كُنتُمْ صٰدِقِينَ (jika kamu orang yang benar) Dalam pengakuan kalian bahwa al-Qur’an ini merupakan kebohongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38 Patutkah mereka mengatakan “Muhammad hanyalah membuat-buat”. Katakanlah wahai Nabi: “Kalau benar yang kamu katakan itu bahwa aku hanya membuat-buat, maka coba buatlah sebuah surat saja yang sepadan. Panggillah siapapun yang dapat kamu mintai pertolongan selain Allah, jika kamu memang orang yang benar bahwa Alquran adalah kebohongan dariku”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka berkata} atau mereka berkata {Dia telah membuat-buat itu} Muhammad telah membuat-buat Al-Qur’an dari dirinya sendiri {Katakanlah,“Buatlah satu surah yang serupa dengannya dan ajaklah siapa saja yang dapat kalian (ajak) selain Allah, jika kalian orang-orang yang benar.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. “Atau (patutkah) mereka mengatakan”, yakni orang-orang yang mendustakannya dengan kesombongan dan penentangan, “Muhammad membuat-buatnya”, dengan berdusta atas nama Allah. “Katakanlah”, dengan menyuruh sesuatu kepada mereka, jika mereka mampu maka apaa yang mereka klaim itu memungkinkan, jika tidak maka ucapan mereka adalah kebatilan. “(Kalau benar yang kamu katakan itu), maka cobalah datangkan sebuah surat seumpamanya dan panggillah siapa-siapa yang dapat kamu panggil (untuk membuatnya) selain Allah, jika kamu orang-orang yang benar”, yang membantumu menghadirkan satu surat yang sama dengannya. Ini mustahil, kalau mungkin tentulah mereka telah menyatakan mampu melakukan itu dan tentulah mereka mengahirkan sepertinya, akan tetapi ketika ketidakmampuan mereka terbukti, maka terbuktilah bahwa yang mereka katakan itu adalah batil tanpa berdasar sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 38: Kepada mereka yang mendustakan itu jika memang Nabi Muhammad shallallahu 'alaihi wa sallam yang membuatnya. Karena kalian adalah orang-orang Arab yang fasih bicara. Dalam dakwaanmu bahwa Al Qur’an buatan Muhammad. Tentu kamu tidak akan sanggup."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 38",
    "description": "Muhammad, buatlah sebuah surah yang semisal dengan surah Al-Qur'an, dan ajaklah siapa saja di antara kamu orang yang mampu membuatnya selain Allah, jika kamu orang-orang yang benar dalam tuduhan itu. Orang-orang musyrik menolak kebenaran Al-Qur'an bukan karena mereka tidak tahu kebenaran itu, tetapi antara lain karena keangkuhan mereka. Bahkan yang sebenarnya terjadi adalah mereka mendustakan apa yang mereka belum mengetahuinya dengan sempurna dan belum mereka peroleh penjelasannya. Sebagaimana orang-orang kafir makkah mendustakan Al-Qur'an, demikianlah halnya umat-umat yang ada sebelum mereka telah mendustakan rasul-rasul dan bukti-bukti kebenaran yang mereka bawa. Maka perhatikanlah bagaimana akibat orang-orang yang zalim. Allah menghukum mereka dengan siksaan di dunia sesuai dengan kezaliman mereka dan kelak di akhirat akan disiksa di dalam neraka."
  }
]