[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "bahkan mereka justru dengan cepat mendustakan al-qur’an begitu mendengarnya pertama kali sebelum mereka mau merenungi ayat-ayatnya, dan mengingkari sesuatu yang mereka tidak menguasainya dengan baik tentang kebangkitan, pembalasan, surga dan neraka dan lain sebagianya, dan belum juga sampai kepada mereka kebenaran yang dijanjikan di dalam al-qur’an. Dan sebagiamana kaum musyrikin telah mendustakan ancaman Allah, umat-umat yang telah berlalu sebelum mereka juga telah mendustakannya. Maka perhatikanlah (wahai rasul), bagaimana kesudahan orang-orang yang berbuat kezhaliman. Sungguh Allah telah membinasakan sebagian mereka dengan membenamkan mereka ke dalam tanah, sebagian lagi dengan di tenggelamkan di dasar laut, dan sebagain yang lain mengalami siksaan selain itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Mereka tidak menjawab. Bahkan mereka mendustakan Al-Qur`ān ini sebelum mereka memahami isinya. Dan karena azab yang diperingatkan kepada mereka pun belum tiba. Tetapi waktu kedatangannya sudah dekat. Sikap mendustakan ayat-ayat Allah juga ditunjukkan oleh umat-umat terdahulu. Dan oleh karena itu, mereka ditimpa siksa karenanya. Maka renungkanlah -wahai Rasul- bagaimana akhir dari perjalanan umat-umat yang mendustakan ayat-ayat Allah . Mereka benar-benar dibinasakan oleh Allah ."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Akan tetapi orang-orang musyrik itu mendustakan al-Qur'an, dan terburu-buru menuduhnya sebelum mereka memahami petunjuk, pelajaran, dan hukum-hukum yang ada di dalamnya; dan belum datang kepada mereka ancaman yang ada padanya. Allah menyerupakan pendustaan mereka seperti pendustaan umat-umat sebelumnya. Hai Rasulallah, lihatlah bagaimana Allah menimpakan kepada mereka berbagai siksaan akibat pelanggaran mereka terhadap hak Allah dan hak hamba-hamba-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. بَلْ كَذَّبُوا۟ بِمَا لَمْ يُحِيطُوا۟ بِعِلْمِهِۦ وَلَمَّا يَأْتِهِمْ تَأْوِيلُهُۥ (Bahkan yang sebenarnya, mereka mendustakan apa yang mereka belum mengetahuinya dengan sempurna padahal belum datang kepada mereka penjelasannya) Mereka bergegas mendustakan al-Qur’an sebelum mereka mentadabburi dan memahami makna dan kandungannya. Dan barangsiapa yang mendustakan sesuatu sebelum mengetahui hakikatnya maka tidaklah kedustaannya itu kecuali sebuah kebodohan terhadap hal tersebut. Sehingga kedustaan mereka terhadap al-Qur’an merupakan pengumuman tentang kebodohan dirinya dengan suara yang lantang, dan kelalaian dirinya dari memikirkan hujjah-hujjah. كَذٰلِكَ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ ۖ( Demikianlah orang-orang yang sebelum mereka telah mendustakan) Dari umat-umat terdahulu ketika rasul-rasul mereka datang membawa hujjah-hujjah dan bukti-bukti Allah. Mereka adalah orang-orang yang mendustakan itu semua sebelum mengetahui hakikatnya, dan sebelum datang kepada mereka penjelasannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dikatakan kepada sebagian ulama (yang pandai mengeluarkan amtsal dari al'qur'an) : apakah kamu menemukan di dalam Al-qur'an orang-orang yang kebodohannya menjadi satu kebiasaan baginya ? mereka mengatakan ya! dalam dua tempat : Pertama : { بَلْ كَذَّبُوا بِمَا لَمْ يُحِيطُوا بِعِلْمِهِ } \"Bahkan yang sebenarnya, mereka mendustakan apa yang mereka belum mengetahuinya dengan sempurna\" Kedua : { وَإِذْ لَمْ يَهْتَدُوا بِهِ فَسَيَقُولُونَ هَٰذَا إِفْكٌ قَدِيمٌ } \"Dan karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata: “Ini adalah dusta yang lama\" [ Al-Ahqaf : 11 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39 Bahkan sebenarnya mereka telah mendustakan apa yang belum mereka ketahui dengan sempurna, padahal mereka belum mendengar penjelasan, belum menelaah isinya, serta janji-janji dalam Alquran belum terjadi. Demikianlah orang-orang sebelum mereka telah mendustakan Alquran dan para rasul. Maka perhatikanlah bagaimana orang-orang yang zalim itu dibinasakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan mereka mendustakan apa yang belum mereka ketahui dengan sempurna} mereka cepat-cepat mendustakan Al-Qur’an sebelum merenunginya dan mendalami makna-makna dan tafsirnya {dan belum datang kepada mereka penjelasannya} belum datang kepada mereka setelah itu hakikat dari apa yang dijanjikan dalam Al-Qur’an {Demikian itu umat-umat sebelum mereka telah berbuat dusta. Maka perhatikanlah bagaimana kesudahan orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Yang membuat mereka mendustakan al-Quran yang mengandung kebenaran yang tiada kebenaran di atasnya adalah bahwa mereka belum mengetahui dengan sempurna. Seandainya mereka mengetahuinya dengan sempurna dan memahaminya dengan baik niscaya mereka akan membenarkannya. Begitu pula sampai sekarang penjelasannya belum datang kepada mereka di mana Allah menjanjikan akan menurunkan azabNya dan menimpakan siksaNya kepada mereka, pendustaan yang keluar dari mereka ini sama dengan pendustaan orang-orang yang sebelum mereka. Oleh karena itu, Dia berfirman, “Demikianlah orang-orang yang sebelum mereka telah mendustakan (rasul). Maka perhatikanlah bagaimana akibat orang-orang yang zhalim itu.” Yaitu kebinasaan yang tak menyisakan seorang pun dari mereka, hendaklah mereka mewaspadai jika mereka terus menerus mendustakannya yang akibatnya adalah turunnya azab kepada mereka seperti telah turun kepada orang-orang yang mendustakan sebelum mereka. Ini mengandung dalil atas anjuran berhati-hati dalam setiap perkara, bahwa setiap orang jangan menerima atau menolak sesuatu sebelum mengetahuinya dengan baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 39: Mereka belum memahaminya dan belum mentadabburinya. Dalam ayat ini terdapat dalil untuk bersikap tatsabbut (tidak tergesa-gesa) dalam segala urusan, dan bahwa tidak sepatutnya bagi seseorang menerima atau menolak sesuatu yang ia belum mengilmuinya. Yakni belum datang kepada mereka akibat dari yang diancamkan itu. Di mana akhir kehidupan mereka adalah dibinasakan. Oleh karena itu, berhati-hatilah mereka jika tetap terus mendustakan, akan ditimpa azab seperti yang mereka rasakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 39",
    "description": "Orang-orang musyrik menolak kebenaran Al-Qur'an bukan karena mereka tidak tahu kebenaran itu, tetapi antara lain karena keangkuhan mereka. Bahkan yang sebenarnya terjadi adalah mereka mendustakan apa yang mereka belum mengetahuinya dengan sempurna dan belum mereka peroleh penjelasannya. Sebagaimana orang-orang kafir makkah mendustakan Al-Qur'an, demikianlah halnya umat-umat yang ada sebelum mereka telah mendustakan rasul-rasul dan bukti-bukti kebenaran yang mereka bawa. Maka perhatikanlah bagaimana akibat orang-orang yang zalim. Allah menghukum mereka dengan siksaan di dunia sesuai dengan kezaliman mereka dan kelak di akhirat akan disiksa di dalam neraka. Pada ayat sebelumnya dijelaskan bahwa secara umum orangorang musyrik menolak kebenaran Al-Qur'an bahkan menuduh nabi Muhammad telah membuat-buat Al-Qur'an, lalu pada ayat ini dijelaskan bahwa ternyata di antara mereka orang-orang musyrik itu ada orang-orang yang beriman kepadanya, yakni mengakui kebenaran Al-Qur'an hanya dalam hatinya, tetapi lahiriyahnya tetap menolak, dan di antaranya ada pula orang-orang yang tidak beriman kepadanya, tidak mengakui kebenaran Al-Qur'an baik secara lahir baupun batin. Sedangkan tuhanmu lebih mengetahui tentang orang-orang yang berbuat kerusakan, yakni mengikuti kebatilan dan menolak kebenaran yang bersumber dari tuhan pemelihara alam. Allah akan memberi balasan atas apa yang mereka kerjakan."
  }
]