[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kepada tuhan kalian lah kalian semua kembali pada hari kiamat. Ini adalah janji Allah yang benar. Dialah yang memulai penciptaan makhluk, kemudian akan menghidupkannya kembali sesudah kematian. Dia akan menciptakannya dalam keadan hidup sebagaimana rupa fisiknya semula, agar Dia memberikan balasan bagi orang-orang yang beriman kepada Allah dan rosulNya, serta melakukan amal-amal shalih dengan balasan terbaik dan keadilan. Dan orang-orang yang mengingkari keesaan Allah, dan risalah para rasulNya, bagi mereka minuman dari air yang sangat panas, yang dapat membakar wajah-wajh dan memotong usus perut, dan bagi mereka siksaan yang pedih, disebabkan kekafiran dan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Hanya kepada Dia lah kalian akan dikembalikan pada hari Kiamat untuk diberikan balasan yang setimpal dengan amal perbuatan kalian. Allah menjanjikan hal itu kepada manusia dengan sebenar-benarnya dan Dia tidak akan mengingkarinya. Sesungguhnya Dia mampu melakukan hal itu. Dia menciptakan mahkluk tanpa ada contoh sebelumnya. Kemudian Dia akan mengembalikan wujudnya setelah kematiannya. Dia memberikan balasan yang setimpal kepada orang-orang yang beriman kepada Allah dan beramal saleh. Dia memberikan balasan itu secara adil; tidak mengurangi kebajikan mereka dan tidak menambah keburukan mereka. Dan bagi orang-orang yang kafir kepada Allah dan Rasul-Nya akan disediakan minuman sangat panas yang dapat mencabik-cabik isi perut mereka. Mereka mendapatkan azab yang sangat pedih karena kekufuran mereka kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Hai Manusia, Hanya kepada Allah kalian semua akan kembali pada hari kiamat, ini merupakan janji Allah yang tidak akan berubah. Allah menciptakan makhluk, kemudian membangkitkan mereka setalah kematian untuk membalas orang-orang beriman yang beramal shalih dengan balasan yang adil. Sedangkan orang-orang yang mendustakan Allah dan Rasul-Nya akan mendapat minuman yang sangat panas dan azab yang pedih akibat pendustaan mereka tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِلَيْهِ مَرْجِعُكُمْ جَمِيعًا ۖ (Hanya kepada-Nya-lah kamu semuanya akan kembali) Ini merupakan peringatan secara umum pada awal surat, dan setelahnya berupa kabar gembira. وَعْدَ اللهِ حَقًّا ۚ(sebagai janji yang benar daripada Allah) Yakni kembalinya kalian kepada Allah merupakan janji benar Allah. yakni kembalinya kalian kepada Allah setelah kematian merupakan janji benar Allah yang tidak akan diingkari. إِنَّهُۥ يَبْدَؤُا۟ الْخَلْقَ (sesungguhnya Allah menciptakan makhluk pada permulaannya) Dari tanah. ثم يعيده (kemudian mengembalikannya) Kepada kehidupan setelah kematiannya untuk menerima balasan di hari kiamat. بِالْقِسْطِ ۚ (dengan adil) Tanpa ada kezaliman didalamnya. مِّنْ حَمِيمٍ (dari air yang panas) Yakni air yang mendidih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Wahai manusia, tempat kembali kalian semua pada hari kiamat hanya kepada Allah. Proses pengembalian kalian dengan dibangkitkan lalu dihisab itulah janji dari Allah SWT dan kebenaran yang tidak mungkin diingkari. Sesungguhnya Allah SWT memulai penciptaan (makhluk) dari tanah lalu menghidupkannya kembali seusai mati untuk dibalas pada hari kiamat. Lalu Dia (Allah) memberi pahala orang-orang mukmin yang mengerjakan amal shalih dengan adil tanpa ada kesewenang-wenangan di dalamnya. Adapun bagi orang-orang kafir dalam neraka Jahanam itu minuman yang amat panas dan azab yang sangat pedih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hanya kepadaNyalah kalian semua akan kembali. Itu merupakan janji Allah yang benar} yang benar tidak ada kesalahan di dalamnya {Sesungguhnya Dialah yang memulai penciptaan, kemudian mengembalikannya, agar Dia memberi balasan kepada orang-orang yang beriman dan beramal shalih dengan adil} dengan adil {dan orang-orang kafir, bagi mereka itu minuman dari air yang mendidih} air yang sangat panas {dan azab yang sangat pedih} sangat menyakitkan {karena mereka kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Manakala Dia menyebutkan hukumNya yang bersifat Qadari yaitu penataan yang umum dan hukumNya yang bersifat diniyah yaitu syariatNya di mana kandungan dan maksudnya adalah ibadah kepadaNya semata, tidak ada sekutu bagiNya, maka Dia menyebutkan hukum jaza’I yaitu pembalasanNya terhadap amal sesudah mati. Dia berfirman, “Hanya kepadaNya-lah kamu semuanya akan kembali.” Maksudnya Dia akan mengumpulkan sesudah matimu pada hari pertemuan yang ditentukan. “Sesungguhnya Allah menciptakan makhluk dari permulaannya kemudian mengulanginya (menghidupkannya) kembali (sesudah berbangkit).” Dzat yang mampu menciptakan makhluk dari permulaan pastilah mampu mengembalikannya. Orang yang melihat penciptaan dari permulaan kemudian mengingkari pembangkitan makhluk kembali adalah orang yang tak berakal, dia mengkingkari satu dari dua hal yang sama persis dengan menetapkan sesuatu yang lebih layak daripadanya. Ini adalah dalil aqli yang jelas atas hari kebangkitan. Kemudian Allah menyebutkan dalil naqli, maka Dia berfirman, “Sebagai janji yang benar dari Allah.” Maksudnya janjiNya adalah benar, ia pasti disempurnakan, “agar Dia memberi pembalasan kepada orang-orang yang beriman”, dengan hati mereka kepada sesuatu yang diperintahkan oleh Allah untuk diimani, “dan yang mengerjakan amal shalih”, meliputi yang wajib dan yang dianjurkan dengan anggota badan mereka “dengan adil.” Yakni dengan iman dana mal merreka sebagai balasan yang telah Dia jelaskan dan sampaikan kepada hamba-hambaNya bahwa ia adalah kenikmatan yang rahasaianya tidak diketahui oleh jiwa. “SEdangkan orang-orang kafir”, kepada ayat-ayat Allah dan mendustakan rasul-rasul Allah, “mereka mendapatkan minuman air yang panas”, yang membakar wajah dan menghancurkan isi perut, “dan azab yang pedih”, berupa berbagai macam bentuk azab “disebabkan kekafiran mereka”, maksudnya disebabkan kekafiran dan kezhaliman mereka, Allah tidak menzhalimi mereka, akan tetapi merekalah yang menzhalimi diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 4: Setelah Allah Subhaanahu wa Ta'aala menyebutkan hukum qadari-Nya, yaitu pengaturan-Nya secara umum terhadap alam semesta, dan menyebutkan hukum agama-Nya, yaitu syari’at-Nya yang tujuannya adalah agar menyembah kepada-Nya saja, maka di ayat ini Allah Subhaanahu wa Ta'aala menyebutkan hukum jaza’inya, yaitu pembalasan terhadap amal setelah manusia mati. Dan menghidupkan kembali lebih mudah daripada memulai pertama kali. Kafir kepada ayat-ayat Allah dan mendustakan para rasul Allah. Yang dapat memanaskan muka dan memutuskan ususnya. Allah tidak menzalimi mereka, akan tetapi merekalah yang menzalimi diri mereka sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 4",
    "description": "Setelah dijelaskan bahwa Allah pencipta langit dan bumi, dan hanya dia yang berhak disembah, lalu pada ayat ini dijelaskan tentang kepastian datangnya hari kiamat. Pada hari tersebut, hanya kepada-Nya, yakni kepada Allah kamu semua akan kembali. Itu merupakan janji Allah yang benar dan pasti tidak sedikit pun diragukan lagi. Sesungguhnya dialah yang maha kuasa memulai penciptaan makhluk, kemudian mengulanginya, yakni menghidupkannya kembali pada hari kebangkitan, agar dia dapat memberi balasan kepada orang-orang yang beriman dan mengerjakan kebajikan dengan balasan yang adil sesuai yang mereka kerjakan. Jika Allah menghendaki, maka berkat anugerah dan kemurahan-Nya, mereka akan memperoleh pahala melebihi yang mereka kerjakan. Sedangkan untuk orang-orang kafir disediakan balasan berupa minuman air yang mendidih yang dapat merusak seluruh alat pencernaan mereka dan akan memperoleh siksaan yang pedih karena kekafiran mereka. Inilah wujud keadilan Allah atas perbuatan hamba-Nya di dunia selain menciptakan langit dan bumi sebagai bukti kebesaran dan kekuasaan-Nya, dialah yang menjadikan matahari bersinar sangat terang yang menghasilkan kehangatan untuk alam raya dengan energi dari dirinya sendiri dan bulan bercahaya karena pantulan energi dari matahari, dan dialah yang menetapkan tempat-tempat orbitnya, yakni tempat peredaran perjalanan bumi mengitari matahari dan bulan mengitari bumi agar kamu mengetahui bilangan tahun, dan perhitungan waktu. Allah tidak menciptakan hal yang demikian sempurna itu melainkan dengan benar, yakni dengan hikmah yang besar. Melalui penciptaan tersebut, dia menjelaskan di antara tanda-tanda kebesaran-Nya kepada orang-orang yang mengetahui, yakni yang mau mengambil pelajaran dari tanda-tanda kekuasaan Allah di alam raya ini."
  }
]