[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara kaummu (wahai rasul), ada orang yang mengimani al-qur’an, dan sebagain dari mereka ada yang tidak mengimaninya hingga mati dalam keyakinan itu dan dibangkitkan dengannya. Dan tuhanmu mengetahui orang-orang yang melakuakn kerusakan yang tidak beriman kepadaNYa dengan dorongan kezhaliman, penentangan dan kerusakan lalu Allah memberikan balasan kepada mereka atas kerusakan yang mereka perbuat dengan siksaan yang sangat keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Di antara orang-orang musyrik itu ada orang yang kelak akan percaya kepada Al-Qur`ān sebelum kematiannya. Dan ada yang tidak percaya kepadanya karena keangkuhan dan kesombongannya sampai ajal menjemputnya. Tuhanmu -wahai Rasul- Maha Mengetahui orang-orang yang bersikeras mempertahankan kekafirannya. Dan Tuhanmu akan membalas kekafiran mereka tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40-41. Allah menjelaskan kepada rasul-Nya berbagai macam manusia yang telah diutus para rasul kepada mereka, sebagaimana yang akan disebutkan dalam empat ayat ini. Dan sebagian mereka beriman kepada al-Qur'an dan menjadi pengikutmu, namun sebagian lainnya tidak beriman hingga mereka mati. Dan Tuhanmu Maha Mengetahui orang-orang yang menyebarkan kerusakan di muka bumi. Jika orang-orang yang berbuat kerusakan itu mendustakanmu, maka katakanlah kepada mereka: “Bagiku agamaku dan bagiku balasan amal perbuatanku, dan bagi kalian agama kalian dan balasan amal perbuatan kalian; kalian tidak akan disiksa karena amal perbuatanku, sebagaimana Aku tidak akan disiksa karena amal perbuatan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَمِنْهُم مَّن يُؤْمِنُ بِهِۦ (Di antara mereka ada orang-orang yang beriman kepada Al Quran) Dalam diri mereka dan mengtahui bahwa al-Qur’an itu benar, namun mereka mendustakannya karena keangkuhan dan kedurhakaan mereka. وَمِنْهُم مَّن لَّا يُؤْمِنُ بِهِۦ ۚ( dan di antaranya ada (pula) orang-orang yang tidak beriman kepadanya) Yang tidak membenarkannya dalam diri mereka, namun mereka mendustakannya karena kebodohan mereka. وَرَبُّكَ أَعْلَمُ بِالْمُفْسِدِينَ (Tuhanmu lebih mengetahui tentang orang-orang yang berbuat kerusakan) Sehingga Allah membalas mereka sesuai dengan amalan mereka. Dan mereka adalah orang-orang yang bebal dan durhaka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40 Di antara mereka para penduduk Makkah yang mendustkan Alquran ada juga orang-orang yang beriman kepada Al Quran.,Di antaranya ada pula orang-orang yang tidak beriman kepadanya. Tuhanmu lebih mengetahui tentang orang-orang yang berbuat kerusakan dan kekufuran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka ada orang yang beriman padanya, dan di antara mereka ada yang tidak beriman padanya} di antara orang-orang musyrik akan ada yang beriman dengan Al-Qur’an di waktu mendatang dan ketika telah lamu perbuatan dusta mereka. Di antara mereka ada orang yang telah diketahui oleh Allah bahwa dia tidak akan pernah beriman {Tuhanmu lebih mengetahui tentang orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Di antara mereka ada orang-orang yang beriman kepada al-Quran, maksudnya beriman dengan al-Quran dan sesuatu yang dibawanya. “Dan di antaranya ada (pula) orang-orang yang tidak beriman kepadanya. Rabbmu lebih mengetahui tentang orang-orang yang berbuat kerusakan.” Yaitu orang-orang yang tidak beriman kepadanya dengan dasar kezhaliman, penentangan dan kerusakan, maka Dia akan membalas kerusakan mereka dengan azab yang paling berat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 40: Yakni penduduk Mekah. Selama-lamanya. Mereka itu adalah orang-orang yang tidak beriman kepada Al Qur’an dengan sikap keras dan zalim. Kalimat ini merupakan ancaman kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 40",
    "description": "Pada ayat sebelumnya dijelaskan bahwa secara umum orangorang musyrik menolak kebenaran Al-Qur'an bahkan menuduh nabi Muhammad telah membuat-buat Al-Qur'an, lalu pada ayat ini dijelaskan bahwa ternyata di antara mereka orang-orang musyrik itu ada orang-orang yang beriman kepadanya, yakni mengakui kebenaran Al-Qur'an hanya dalam hatinya, tetapi lahiriyahnya tetap menolak, dan di antaranya ada pula orang-orang yang tidak beriman kepadanya, tidak mengakui kebenaran Al-Qur'an baik secara lahir baupun batin. Sedangkan tuhanmu lebih mengetahui tentang orang-orang yang berbuat kerusakan, yakni mengikuti kebatilan dan menolak kebenaran yang bersumber dari tuhan pemelihara alam. Allah akan memberi balasan atas apa yang mereka kerjakan. Bersabarlah dan berteguhhatilah dalam menyampaikan kebenaran, dan jika mereka orang-orang musyrik itu tetap mendustakanmu wahai nabi Muhammad, maka katakanlah, bagiku pekerjaanku dan aku akan bertanggung jawab atas pekerjaanku dan bagimu pekerjaanmu dan kamu akan bertanggung jawab atas pekerjaan kamu di hadapan Allah. Kamu tidak bertanggung jawab terhadap apa yang aku kerjakan dan aku pun tidak bertanggung jawab terhadap apa yang kamu kerjakan. Setiap orang akan mempertanggungjawabkan pekerjaannya masing-masing."
  }
]