[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila kaum musyrikin mendustakan dirimu (wahai rasul), maka katakanlah kepada mereka, ”bagiku agamaku dan amal perbuatanku, dan bagi kalian agama dan perbuatan kalian. kalian tidaklah disiksa karena perbuatanku, dan akaupun tidak disiksa atas perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Jika kaummu -wahai Rasul- mendustakanmu katakanlah kepada mereka, \"Aku akan mendapatkan ganjaran atas amal perbuatanku sendiri. Dan aku akan menanggung akibat dari amal perbuatanku sendiri. Sedangkan kalian akan mendapatkan ganjaran atas amal perbuatan kalian sendiri, dan akan menerima hukuman atas amal perbuatan kalian sendiri. Kalian akan bebas dari hukuman atas amal perbuatanku, dan akupun akan bebas dari hukuman atas amal perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. لِّى عَمَلِى وَلَكُمْ عَمَلُكُمْ ۖ (Bagiku pekerjaanku dan bagimu pekerjaanmu) Yakni bagiku balasan amalanku dan bagi kalian balasan amalan kalian, dan aku telah menyampaikan hal itu kepada kalian, maka tidak ada tanggungan lainnya bagiku. أَنتُم بَرِيٓـُٔونَ مِمَّآ أَعْمَلُ وَأَنَا۠ بَرِىٓءٌ مِّمَّا تَعْمَلُونَ(Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan) Yakni kalian tidak akan disiksa karena amal perbuatanku, dan aku tidak akan disiksa karena amal perbuatan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ أَنْتُمْ بَرِيئُونَ مِمَّا أَعْمَلُ وَأَنَا بَرِيءٌ مِمَّا تَعْمَلُونَ } \"Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan\" , { وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ } \"dan kamu tidak akan diminta (pertanggungan jawab) tentang penghuni-penghuni neraka\" [ Al-Baqarah : 119 ] ... Jika saja orang-orang yang terburu-buru dan orang-orang yang senantiasa mengabaikan ayat Allah memahami isyarat dari ayat ini dan ayat-ayat semisalnya; niscaya diri mereka tidak akan tergelincir kepada duka cita dan kerugian bersama para penentang, dan niscaya mereka akan megetahui bahwa kebodohan diri mereka tidak akan berpengaruh kepada tugas nabi mereka { إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ } \"Kewajibanmu tidak lain hanyalah menyampaikan (risalah)\" [ Asy-Syura : 48 ], { فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ } \"maka janganlah dirimu binasa karena kesedihan terhadap mereka\" [ Fatir : 8 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41 Jika mereka mendustakan kamu, maka katakanlah: “Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan, sehingga tidak ada seseorang yang dihukum atas dosa orang lain”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka mendustakanmu. katakanlah,“Bagiku perbuatanku dan bagi kalian perbuatan kalian. Kalian berlepas diri dari apa yang aku perbuat dan aku pun berlepas diri dari apa yang kalian perbuat.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Jika mereka mendustakan kamu”, maka teruslah berdakwah, urusan mereka bukan tanggunganmu, urusanmu pun bukan tanggung jawab mereka, masing-masing mempunyai pekerjaan sendiri-sendiri. “Maka katakanlah, ‘Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap sesuatu yang aku kerjakan, dan aku pun berlepas diri terhadap sesuatu yang kamu kerjakan’. “ seperti Firman Allah \"Barangsiapa yang mengerjakan amal yang saleh maka (pahalanya) untuk dirinya sendiri dan barangsiapa mengerjakan perbuatan jahat, maka (dosanya) untuk dirinya sendiri\" (Fushilat:46)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 41: Yakni maka tetaplah berdakwah, engkau tidak memikul tangung jawab sedikit pun terhadap perbuatan mereka dan mereka pun tidak memikul tanggung jawab sedikit pun terhadap perbuatanmu. Masing-masing akan memperoleh balasannya. Barang siapa yang mengerjakan amal saleh, maka kebaikannya untuk dirinya sendiri, dan barang siapa yang mengerjakan keburukan, maka keburukannya pun akan ditimpanya sendiri. Ada yang mengatakan, bahwa ayat ini mansukh dengan ayat yang memerintahkan untuk memerangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 41",
    "description": "Bersabarlah dan berteguhhatilah dalam menyampaikan kebenaran, dan jika mereka orang-orang musyrik itu tetap mendustakanmu wahai nabi Muhammad, maka katakanlah, bagiku pekerjaanku dan aku akan bertanggung jawab atas pekerjaanku dan bagimu pekerjaanmu dan kamu akan bertanggung jawab atas pekerjaan kamu di hadapan Allah. Kamu tidak bertanggung jawab terhadap apa yang aku kerjakan dan aku pun tidak bertanggung jawab terhadap apa yang kamu kerjakan. Setiap orang akan mempertanggungjawabkan pekerjaannya masing-masing. Setelah dijelaskan bahwa orang-orang yang mendustakan nabi Muhammad akan mempertanggungjawabkan perbuatannya, lalu dijelaskan pada ayat ini, dan di antara mereka ada yang mendengarkan engkau wahai nabi Muhammad, padahal hati mereka tidak menerimanya. Maka apakah engkau dapat menjadikan orang yang tuli pendengaran hatinya itu mendengar sedangkan mereka tidak mengerti' tentu tidak bisa."
  }
]