[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dianatara orang-orang kafir, ada orang-orang yang mendengarkan ucapanmu yang haq dan bacaan al-qur’anmu, akan tetapi mereka tidak memperoleh hidayah. Maka apakah kamu sanggup membuat orang tuli menjadi mendengar? maka demikian pula kamu tidak akan sanggup memberikan hidayah kepada mereka, kecuali bila Allah menghendaki mereka memperoleh hidayah. Sesungguhnya mereka itu orang-orang yang tuli terhadap kebenaran, yakni, tidak memahaminya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Di antara orang-orang musyrik itu ada orang yang mendengarkan suaramu -wahai Rasul- ketika engkau membaca Al-Qur`ān, tetapi pendengaran mereka tidak diikuti dengan penerimaan dan perhatian. Apakah engkau sanggup membuat orang tuli bisa mendengar?! Begitu pula engkau tidak akan sanggup memberikan petunjuk kepada orang-orang yang tuli terhadap kebenaran sehingga mereka tidak bisa memahaminya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Dan sebagian orang-orang kafir itu mendengarkanmu ketika membaca al-Qur'an, akan tetapi mereka tidak memahaminya sama sekali. Kamu tidak akan mampu membuat orang-orang yang tuli dari kebenaran itu dapat mendengar, sebab mereka enggan mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَمِنْهُم مَّن يَسْتَمِعُونَ إِلَيْكَ ۚ (Dan di antara mereka ada orang yang mendengarkanmu) Yakni mendengarkan Rasulullah ketika membaca al-Qur’an dan mengajarkan syariat. أَفَأَنتَ تُسْمِعُ الصُّمَّ(Apakah kamu dapat menjadikan orang-orang tuli itu mendengar) Yakni orang-orang yang mempunyai penghalang untuk mendengar berupa kebencian sehingga menghalangi mereka dari menerima seruanmu. وَلَوْ كَانُوا۟ لَا يَعْقِلُونَ(walaupun mereka tidak mengerti) Dan barangsiapa yang tuli dan tidak berakal maka ia tidak akan memahami apapun dan tidak mendengar apa yang dikatakan kepadanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "42-43 1 ). Pendustaan dan berpaling dari ayat Allah menghalangi mereka dari dua jalan mulia dari jalan-jalan ilmu : yaitu jalan yang di dalamnya ada berita-berita yang senantiasa mengabarkan segala kebaikan, dan jalan yang mereka gunakan untuk melihat sang pendakwah yang mulia (yakni Muhammad SAW), oleh karena itu jika akal, pendengaran, dan penglihatan telah rusak; kemanakah mereka akan berjalan menuju kebaikan ? 2 ). Allah berfirman : { وَمِنْهُمْ مَنْ يَنْظُرُ إِلَيْكَ } \"Dan di antara mereka ada orang yang melihat kepadamu\" ayat ini menjadi dalil bahwasanya melihat kepada keadaan-keadaan yang ada pada RAsulullah seperti : petunjuknya, akhlaqnya, perbuatannya, dan apa yang beliau serukan adalah merupakan diantara dalil-dalil agung yang menunjukkan akan kebenaran dan keagungan apa yang beliau bawakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42 Di antara mereka orang musrik dan kafir ada orang yang mendengarkanmu membaca Alquran dan mengajarkan syariat. Namun mereka seperti orang tuli yang tidak mendengar apa-apa. Apakah kamu dapat menjadikan orang-orang tuli itu mendengar walaupun mereka tidak mengerti? Tidak bisa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka ada orang yang mendengarkanmu. Apakah kamu dapat menjadikan orang yang tuli itu bisa mendengar walaupun mereka tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah mengabarkan sebagian dari para pendusta Rasulullah dan sesuatu yang dia bawa. “Dan di antara mereka ada orang yang mendengarkanmu.” Maksudnya, mendengarkan kepada Nabi pada saat membaca wahyu, bukan untuk mengambil petunjuk, akan tetapi untuk mencari celah (kesalahan), mendustakan dan mencari-cari ketergelinciran. Mendengar seperti ini tidak berguna sedikit pun dan pelakunya tidak akan mendapatkan kebaikan, maka tidak aneh jika pintu taufik tertutup bagi mereka, dan mereka tidak mendapatkan faidah mendengar. Oleh karena itu, Allah berfirman, “Apakah kamu dapat menjadikan orang-orang tuli itu mendengar walaupun mereka tidak mengerti.” Pertanyaan ini berarti penafian yang menetapkan, yakni kamu tidak dapat membuat orang yang tuli itu mendengarmu meski kamu bisa mengeraskan suaramu, lebih-lebih jika dia kehilangan akalnya. Jika tidak mungkin bisa membuat orang tuli yang tidak memahami Kalamullah untuk mendengar, maka orang-orang yang mendustakan itupun demikian. Kamu tidak akan mampu membuat mereka mendengar dengan pendengaran yang bermanfaat. Adapun sekedar kamu memperdengarkan tegaknya hujjah, maka mereka telah mendengar sesuatu yang dengannya hujjah Allah yang mendalam bisa tegak. Ini adalah jalan ilmu yang agung yang telah tertutup dari mereka yaitu jalan mendengar yang berkaitan dengan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 42: Pada saat engkau membacakan wahyu tanpa ada niat mengambil petunjuk darinya, bahkan dengan maksud menyaksikan, mendustakan dan mencari-cari cela. Mendengarkan seperti ini tidaklah bermanfaat bagi pendengarnya, maka tetap tertutup baginya pintu taufiq serta terhalang dari faedah mendengarkan. Termasuk hal yang mustahil memperdengarkan orang yang tuli yang tidak mengerti pembicaraan, demikianlah keadaan orang-orang yang mendustakan. Mereka hanya mendengarkan sesuatu yang menegakkan hujjah bagi mereka, padahal mendengarkan merupakan salah satu sarana untuk memperoleh ilmu. Pada ayat selanjutnya, Allah Subhaanahu wa Ta'aala juga menyebutkan sarana lainnya untuk memperoleh ilmu, yaitu penglihatan, namun penglihatan mereka juga tidak berfungsi seperti halnya orang yang buta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 42",
    "description": "Setelah dijelaskan bahwa orang-orang yang mendustakan nabi Muhammad akan mempertanggungjawabkan perbuatannya, lalu dijelaskan pada ayat ini, dan di antara mereka ada yang mendengarkan engkau wahai nabi Muhammad, padahal hati mereka tidak menerimanya. Maka apakah engkau dapat menjadikan orang yang tuli pendengaran hatinya itu mendengar sedangkan mereka tidak mengerti' tentu tidak bisa. Dan di antara mereka ada yang melihat kepada engkau wahai nabi Muhammad, yakni menyaksikan tanda-tanda kenabianmu, tetapi mereka tidak mengakuinya. Maka apakah engkau dapat memberi petunjuk kepada orang-orang yang buta mata hatinya itu, sedangkan mereka tidak memperhatikan' tentu tidak bisa."
  }
]