[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara orang-orang kafir, ada orang yang melihat kepadamu dan bukti-bukti kenabianmu yang benar, akan tetapi dia tidak melihat apa yang diberikan Allah kepadamu berupa cahaya keimananmu. Apakah kamu (wahai rasul), sanggup untuk menciptakan penglihatan bagi orang-orang buta yang membuatnya dapat mengetahui jalan? demikian pula, kamu tidak sanggup untuk memberikan hidayah bagi mereka, bila mereka itu kehilangan bashirah (mata hati yang lurus). semua itu hanya milik Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Di antara orang-orang musyrik itu ada yang melihatmu -wahai Rasul- dengan mata lahirnya bukan dengan mata batinnya. Apakah engkau mampu membuat orang buta bisa melihat?! Engkau pasti tidak mampu melakukannya. Begitu juga engkau tidak akan mampu memberikan petunjuk kepada orang yang tidak punya mata hati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Dan sebagian orang-orang kafir itu melihatmu dan menyaksikan bukti-bukti kenabianmu yang sangat jelas, akan tetapi mereka buta karena tidak dapat mengambil manfaat dari apa yang mereka saksikan. Dan kamu tidak akan mampu memberi petunjuk kepada orang-orang yang buta dari kebenaran karena mereka telah kehilangan penglihatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَمِنْهُم مَّن يَنظُرُ إِلَيْكَ ۚ أَفَأَنتَ تَهْدِى الْعُمْىَ وَلَوْ كَانُوا۟ لَا يُبْصِرُونَ (Dan di antara mereka ada orang yang melihat kepadamu, apakah dapat kamu memberi petunjuk kepada orang-orang yang buta, walaupun mereka tidak dapat memperhatikan) Dan barangsiapa yang buta mata kepala dan mata hatinya maka ia tidak akan dapat memahami. Begitu pula orang yang tuli dan tidak berakal maka akan tertutup baginya jalan untuk mendapatkan petunjuk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "42-43 1 ). Pendustaan dan berpaling dari ayat Allah menghalangi mereka dari dua jalan mulia dari jalan-jalan ilmu : yaitu jalan yang di dalamnya ada berita-berita yang senantiasa mengabarkan segala kebaikan, dan jalan yang mereka gunakan untuk melihat sang pendakwah yang mulia (yakni Muhammad SAW), oleh karena itu jika akal, pendengaran, dan penglihatan telah rusak; kemanakah mereka akan berjalan menuju kebaikan ? 2 ). Allah berfirman : { وَمِنْهُمْ مَنْ يَنْظُرُ إِلَيْكَ } \"Dan di antara mereka ada orang yang melihat kepadamu\" ayat ini menjadi dalil bahwasanya melihat kepada keadaan-keadaan yang ada pada RAsulullah seperti : petunjuknya, akhlaqnya, perbuatannya, dan apa yang beliau serukan adalah merupakan diantara dalil-dalil agung yang menunjukkan akan kebenaran dan keagungan apa yang beliau bawakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43 Di antara mereka ada orang yang melihat kepada bukti kenabianmu, namun tidak mengimanimu. Lalu apakah dapat kamu memberi petunjuk kepada orang-orang yang buta, walaupun mereka tidak dapat memperhatikan? Ayat ini sebagai alasan untuk melawan mereka dan karena tidak adanya persiapan untuk memahami dan menerima hidayah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka ada orang yang melihatmu} melihat tanda-tanda kenabianmu dengan penglihatannya bukan dengan pengetahuannya {Apakah kamu dapat memberi petunjuk kepada orang yang buta, walaupun mereka tidak melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Kemudian Allah menyebutkan tertutupnya jalan yang kedua yaitu jalan penglihatan, Dia berfirman, “Dan di antara mereka ada orang yang melihat kepadamu”, tetapi penglihatannya kepadamu tidak berguna baginya dan tidak mengungkap apa pun dari keadaanmu. Sebagaimana kamu tidak memberi petunjuk kepada orang buta yang tidak bisa melihat maka kamu pun tidak bisa memberi petunjuk kepada mereka. Jika akal, pendengaran dan penglihatan mereka rusak yang mana semua itu adalah jalan yang mengantarkan kepada ilmu dan pengetahuan tentang hakikat, maka di manakah jalan yang mengantarkan mereka kepada kebenaran? FirmanNya, “Dan di antara mereka ada orang yang melihat kepadamu, apakah dapat kamu memberi petunjuk kepada orang-orang yang buta, walaupun mereka tidak dapat memperhatikan”, menunjukkan bahwa melihat keadaan, petunjuk, akhlak, perbuatan dan dakwah Nabi adalah salah satu bukti terbesar atas kebenarannya dan kebenaran sesuatu yang dibawanya, ia cukup bagi orang yang melek dari melihat dalil yang lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 43: Artinya menyaksikan tanda-tanda kenabianmu, akan tetapi mereka tidak mengakuinya. Ayat ini menunjukkan bahwa melihat keadaan Nabi shallallahu 'alaihi wa sallam, petunjuk, akhlak, amal dan dakwahnya termasuk bukti besar yang menunjukkan kebenaran Beliau dan apa yang Beliau bawa, dan bahwa memperhatikan keadaan Beliau juga sudah cukup sebagai bukti di samping bukti-bukti yang lainnya. Yakni sesungguhnya engkau tidak dapat menunjuki mereka sebagaimana engkau tidak dapat menunjuki orang yang buta. Ketika akal, pendengaran dan penglihatan mereka tidak difungsikan, padahal semua itu merupakan sarana untuk menghasilkan ilmu dan mengetahui hakikat, maka sarana apa lagi yang dapat menyampaikan mereka kepada kebenaran?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 43",
    "description": "Dan di antara mereka ada yang melihat kepada engkau wahai nabi Muhammad, yakni menyaksikan tanda-tanda kenabianmu, tetapi mereka tidak mengakuinya. Maka apakah engkau dapat memberi petunjuk kepada orang-orang yang buta mata hatinya itu, sedangkan mereka tidak memperhatikan' tentu tidak bisa. Sesungguhnya Allah tidak menzalimi manusia sedikit pun, karena dia sudah memberikan petunjuk menuju jalan kebenaran dan melarang ke jalan kesesatan serta memberi kebebasan kepada manusia untuk menentukan pilihan, tetapi manusia itulah yang menzalimi dirinya sendiri dengan berbuat kejahatan dan mengabaikan kebenaran."
  }
]