[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila kami memperlihatkan kepadamu (wahai rasul), saat kamu masih hidup sebagain kejadian yang kami ancamkan kepada mereka berupa siksaan di dunia, atau kami mewafatkanmu sebelum kami perlihatkan kepadamu kejadian itu berlangsung di tengah mereka, maka kepada kami semata urusan mereka akan dikembalikan dalam dua keadaan tersebut. Kemudian Allah adalah saksi atas perbuatan-perbuatan mereka yang dahulu mereka perbuatan didunia. Tidak ada bagi Allah sesuatupun darinya yang tersembunyi. Kemudian dia memberikan balasan kepada mereka yang sesuai dengan apa yang pantas mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan jika Kami perlihatkan kepadamu -wahai Rasul- sebagian dari azab yang kami janjikan kepada mereka sebelum engkau wafat, atau kami mewafatkanmu sebelum hal itu terjadi, maka bagaimanapun juga mereka akan kembali kepada Kami di Hari Kiamat nanti. Kemudian Allah mengetahui apa yang telah mereka perbuat, tidak ada satupun yang luput dari pengetahuan-Nya, dan Dia akan memberi mereka balasan yang setimpal dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Hai Rasulullah, jika Kami memperlihatkanmu sebagian orang-orang yang Kami janjikan akan menolongmu atas mereka dan memberi mereka azab, agar kamu menjadi ridha, maka Kami akan melakukannya; atau Kami mewafatkanmu sebelum kamu melihat hal tersebut, maka sesungguhnya tempat kembali mereka di akhirat adalah kepada Allah, kemudian Allah akan menjadi saksi kejahatan-kejahatan yang telah mereka perbuat, dan Dia akan menyiksa mereka karena kejahatan-kejahatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَإِمَّا نُرِيَنَّكَ بَعْضَ الَّذِى نَعِدُهُمْ (Dan jika Kami perlihatkan kepadamu sebahagian dari (siksa) yang Kami ancamkan kepada mereka) Dengan memenangkan agamamu ketika kamu masih hidup, baik dengan terbunuhnya mereka atau dengan penawanan mereka. أَوْ نَتَوَفَّيَنَّكَ (atau (jika) Kami wafatkan kamu) Atau kamu meninggal sebelum itu. فَإِلَيْنَا مَرْجِعُهُمْ (maka kepada Kami jualah mereka kembali) Dalam keadaan itu Kami akan mengazab mereka di akhirat dan Kami akan memperlihatkan azab mereka kepadamu. Jika kami tidak membalas mereka secepatnya maka Kami akan membalas mereka suatu saat. ثُمَّ اللهُ شَهِيدٌ عَلَىٰ مَا يَفْعَلُونَ(dan Allah menjadi saksi atas apa yang mereka kerjakan) Yakni kemudian Allah akan menjadi saksi atas mereka di hari kiamat tentang apa yang mereka lakukan setelah kematianmu. Ayat ini sejalan dengan perkataan Nabi Isa dalam firman Allah: وكنت عليهم ما دمت فيهم فلما توفني كنت أنت الرقيب عليهم “dan aku menjadi saksi terhadap mereka, selama aku berada di tengah-tengah mereka. Maka setelah Engkau mewafatkan aku, Engkaulah yang mengawasi mereka”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46 Jika Kami perlihatkan kepadamu sebagian dari siksa yang Kami ancamkan kepada mereka, tentulah kamu akan melihatnya atau jika Kami wafatkan kamu sebelum itu, maka juga kepada Kamilah mereka kembali pada hari kiamat, dan Allah menjadi saksi atas apa yang mereka kerjakan berupa kekafiran dan dusta, dan juga akan diberi balasan. Maksudnya adalah memberitahu mereka bahwa sepeninggal nabi tidak akan memberi pengaruh ataupun keamanan sebagaimana yang mereka sangka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Kami benar-benar memperlihatkan kepadamu sebagian dari yang Kami janjikan kepada mereka, atau jika Kami mewafatkanmu. hanya kepada Kamilah mereka kembali, kemudian Allah menjadi saksi atas apa yang mereka lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Yakni jangan bersedih wahai Rasulullah terhadap orang-orang yang mendustakan itu, jangan terburu-buru karena mereka pasti akan ditimpa azab yang Kami janjikan, bisa di dunia yang kamu melihatnya dan membuat jiwamu tetap tenang, bisa di akhirat sesudah wafat, karena tempat kembali mereka adalah kepada Allah, dan Dia memberitahukan apa yang mereka lakukan. Allah mencatatnya walaupun mereka telah melupakannya, Allah Maha Mengetahui segala sesuatu. Ini mengandung ancaman yang berat kepada mereka dan sekaligus hiburan kepada Rasul yang didustakan dan ditentang kaumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 46: Yakni janganlah kamu bersedih wahai Rasul terhadap mereka yang mendustakan itu serta jangan pula meminta disegerakan azab bagi mereka karena sesungguhnya mereka mesti ditimpa azab yang diancamkan kepada mereka. Azab tersebut bisa di dunia, di mana kamu melihatnya langsung dan bisa di akhirat setelah kamu wafat, karena sesungguhnya kembali mereka adalah kepada Allah juga dan Dia akan memberitahukan kepada mereka apa yang mereka kerjakan. Allah akan menjumlahkan amal mereka dan tidak akan melupakannya, dan Allah Maha Menyaksikan segala sesuatu. Di waktu hidupmu. Berupa sikap mendustakan dan mengingkari (kafir), lalu Allah mengazab mereka dengan azab yang sangat keras. Dalam ayat ini terdapat ancaman yang keras kepada mereka dan hiburan bagi Rasulullah shallallahu 'alaihi wa sallam yang didustakan kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 46",
    "description": "Dan jika kami perlihatkan kepadamu wahai nabi Muhammad, sebagian dari siksaan yang kami janjikan sebagai ancaman hukuman kepada mereka, tentulah engkau akan melihatnya atau jika kami wafatkan engkau sebelum datangnya siksa itu, sehingga engkau tidak menyaksikan ketika siksaan itu datang, maka kepada kami jualah mereka kembali dengan mempertanggungjawabkan seluruh amal perbuatan mereka, dan Allah menjadi saksi atas apa yang mereka kerjakan dan akan memberikan balasan dengan seadil-adilnya. Hukuman tuhan bagi orang yang berbuat maksiat dapat diberikan di dunia atau di akhirat. Sebagai wujud keadilan tuhan, dia mengutus rasul-rasul sebagai pemberi peringatan. Dan setiap umat mempunyai rasul yang menyampaikan ajaran kebenaran disertai bukti-bukti atas kebenaran ajaran tersebut. Maka apabila rasul mereka telah datang, diberlakukanlah hukum bagi mereka dengan adil dan sedikit pun tidak dizalimi. Orang yang beriman dan berbuat kebaikan akan diberi pahala, sedangkan yang ingkar dan berbuat mungkar, maka akan disiksa."
  }
]