[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tiap-tiap umat yang telah berlalu sebelum kalian (wahai manusia), memiliki seorang rasul yang aku utus kepada mereka, sebagiamana aku mengutus Muhammad kepada kalian, yang menyeru kepada agama Allah dan ketaatan kepadaNYa. Kemudian apabila telah datang rasul mereka di akhirat, maka saat itu diputuskanlah antara mereka dengan adil, sedang mereka tidak terzhalimi terkait balasan perbuatan-perbuatan mereka sedikitpun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Setiap umat yang ada di masa lalu mempunyai Rasul yang diutus oleh Allah kepada mereka. Apabila Rasul itu telah menyampaikan kepada mereka apa yang harus disampaikannya kepada mereka dan ternyata mereka mendustakannya, maka kedua belah pihak diberi keputusan secara adil. Kemudian Allah menyelamatkan utusan-Nya dengan karunia-Nya dan membinasakan umatnya dengan keadilan-Nya. Dan mereka tidak dizalimi sedikitpun terkait dengan balasan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Dan bagi setiap umat rasul yang diutus untuk memberi mereka hidayah. Dan jika rasul mereka telah datang untuk menjadi saksi perbuatan mereka, maka mereka akan mendapat ketetapan hukum dengan adil. Setiap umat akan menghadap Allah dengan kehadiran rasul mereka dan kitab catatan amal perbuatan mereka. Mereka tidak akan dizalimi sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَلِكُلِّ أُمَّةٍ (Tiap-tiap umat) Dari umat-umat terdahulu. رَّسُولٌ ۖ( mempunyai rasul) Yang diutus Allah kepada mereka, dan menjelaskan kepada mereka hukum-hukum yang disyariatkan Allah bagi mereka. فَإِذَا جَآءَ رَسُولُهُمْ(maka apabila telah datang rasul mereka) Dan para Rasul itu telah menyampaikan risalah Allah, namun mereka mendustakan semuanya. قُضِىَ بَيْنَهُم(diberikanlah keputusan antara mereka) Yakni antara umat tersebut dengan Rasulnya. بِالْقِسْطِ(dengan adil) Maka Rasul itu akan selamat dan orang-orang yang mendustakan akan binasa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Penggunaan lafazh \"الأمة\" dalam al-qur'an terdapat beberapa penggunaan dan makna yang berbeda : 1 - Jamaah dari kumpulan manusia, dan itu penggunaan yang paling umum, seperti firman Allah : { وَلِكُلِّ أُمَّةٍ رَسُولٌ } \"Tiap-tiap umat mempunyai rasul\" 2 - Digunakan untuk makna \"sesaat\" dari satu waktu, { وَادَّكَرَ بَعْدَ أُمَّةٍ } \"dan teringat (kepada Yusuf) sesudah beberapa waktu lamanya\" [ Yusuf : 45 ]. 3 - Digunakan untuk seseorang yang menjadi contoh pengikutnya, sebagaimana firman Allah : { إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً } \"Sesungguhnya Ibrahim adalah seorang imam yang dapat dijadikan teladan\" [ An-Nahl : 120 ]. 4 - DIgunakan dengan makna syari'at atau jalan, seperti firman Allah : { إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ } \"sesungguhnya kami mendapati nenek moyang kami berjalan di atas sebuah jalan, ajaran dan agama\" [ Az-Zukhruf : 22 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47 Tiap-tiap umat terdahulu mempunyai rasul yang menjelaskan hukum aqidah dan syariat dan memberi kesaksian atas mereka. Maka apabila rasul mereka telah datang, diputuskanlah kesaksian atas mereka dengan adil dan mereka sedikitpun tidak dianiaya atas amal mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap umat mempunyai seorang rasul. Apabila telah datang rasul mereka, maka diputuskanlah di antara mereka} di antara masing-masing umat dan rasulnya {dengan adil} dengan adil {sedangkan mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Allah berfirman, “Tiap-tiap umat”, dari umat-umat yang telah berlalu “mempunyai rasul”, yang mengajak kepada tauhid dan agamaNya. Jika “Rasul mereka” telah datang dengan ayat-ayat Allah, maka ada yang membenarkan dan ada pula yang mendustakan, maka Allah memutuskan di antara mereka dengan adil dengan menyelamatkan orang-orang Mukmin dan membinasakan orang-orang yang mendustakan. “Dan mereka (sedikit pun) tidak dianiaya”, dengan disiksa sebelum diutusnya Rasul dan penegakkan hujjah atau mereka diazab tanpa ada dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 47: Yang mengajak mereka kepada tauhid dan kepada agama-Nya. Dengan membawa bukti kemudian mereka mendustakannya. Yaitu dengan diazabnya orang-orang yang mendustakan dan diselamatkannya Rasul dan orang-orang yang mengikutiya. Mereka tidak akan diazab tanpa sebab dosa yang mereka kerjakan, dan mereka tidak akan diazab sebelum diutusnya rasul serta ditegakkan hujjah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 47",
    "description": "Sebagai wujud keadilan tuhan, dia mengutus rasul-rasul sebagai pemberi peringatan. Dan setiap umat mempunyai rasul yang menyampaikan ajaran kebenaran disertai bukti-bukti atas kebenaran ajaran tersebut. Maka apabila rasul mereka telah datang, diberlakukanlah hukum bagi mereka dengan adil dan sedikit pun tidak dizalimi. Orang yang beriman dan berbuat kebaikan akan diberi pahala, sedangkan yang ingkar dan berbuat mungkar, maka akan disiksa. Dan mendengar adanya ancaman tersebut, mereka orang-orang kafir mengatakan, bilakah datangnya ancaman itu, siang atau malam, atau segerakanlah, jika kamu orang-orang yang benar'"
  }
]