[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan berkata Orang-orang musyrik dari kaummu (wahi rasul) ”kapan hari kiamat akan tiba, bila kamu dan orang-orang yang mengikutimu termasuk orang-orang yang benar dalam janji yang kalian sampaikan kepada kami?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Orang-orang kafir itu berkata dengan nada angkuh dan menantang, \"Kapan datangnya azab yang kalian ancamkan kepada kami, jika kalian sungguh-sungguh atas klaim kalian itu?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Orang-orang musyrik yang mengingkari adanya hari kiamat berkata kepada Rasulullah sebagai hinaan baginya: “Kapan terjadinya azab dan hisab yang kamu dan para pengikutmu ancamkan kepada kami itu, jika kalian benar dalam ancaman tersebut?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48 Mereka orang musyrik mengatakan kepada Nabi dan orang mukmin: “Kapan ancaman azab itu akan datang, jika memang kamu orang-orang yang benar?” Mereka berkata seperti itu bermaksud untuk mengolok dan merendahkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} orang-orang musyrik berkata {“Kapankah janji itu} azab itu {jika kalian adalah orang-orang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. Hendaknya orang-orang yang mendustakanmu mewaspadai sikap menyerupai umat-umat yang dibinasakan sehingga mereka bisa ditimpa azab yang telah menimpa mereka (yang terdahulu), janganlah menantang azab Allah dan mengatakan, “Bilakah (datangnya) ancaman itu, jika memang kamu orang-orang yang benar?” karena ini adalah kezhaliman dari mereka di mana mereka menuntutnya dari Nabi, padahal dia tidak sedikit pun memiliki hak dalam urusan ini, tugasnya hanyalah menyampaikan dan menjelaskan kepada manusia. Adapun hisab mereka dan penurunan azab atas mereka maka ia dari Allah, Dia menurunkannya kepada mereka jika tiba waktu dan saat yang ditentukan dan diletakkan olehNya yang sesuai dengan hikmah Ilahiyah. Jika waktu tersebut telah hadir maka mereka tidak bisa menunda dan memajukannya sesaat pun. Orang-orang yang mendustakan hendaklah mewaspadai sikap menuntut turunnya azab karena mereka menuntut disegerakannya azab Allah yang mana jika ia turun maka azabnya tidak tertolak dari orang-orang yang berdosa. Oleh karena itu, Dia berfirman,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 48: Hendaknya mereka berhati-hati agar jangan sampai menyerupai generasi sebelum mereka yang telah dibinasakan sehingga mereka ditimpa azab seperti yang diterima generasi sebelum mereka, dan janganlah mereka meminta disegerakan azab dengan mengatakan seperti yang disebutkan dalam ayat di atas. Kata-kata ini termasuk kezaliman mereka, di mana mereka meminta didatangkan ancaman itu kepada Nabi shallallahu 'alaihi wa sallam yang tidak berkuasa apa-apa, yang tugasnya hanya menyampaikan dan menerangkan kebenaran. Sedangkan hisab mereka dan diturunkannya azab adalah dari Allah, Dia akan menurunkannya ketika telah tiba waktunya sesuai kebijaksanaan-Nya sebagaimana diterangkan dalam ayat selanjutnya. Oleh karena itu, hendaknya mereka yang meminta disegerakan azab itu berhati-hati, karena ketika azab datang, azab itu tidak dapat ditolak dan ditunda."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 48",
    "description": "Dan mendengar adanya ancaman tersebut, mereka orang-orang kafir mengatakan, bilakah datangnya ancaman itu, siang atau malam, atau segerakanlah, jika kamu orang-orang yang benar' setelah mendengar permintaan orang-orang kafir sebagaimana terungkap pada ayat di atas, lalu Allah memerintahkan: katakanlah wahai nabi Muhammad, aku hanyalah seorang utusan yang tidak kuasa menolak mudarat maupun mendatangkan manfaat kepada diriku sendiri maupun kepada kalian, kecuali apa yang Allah kehendaki. Allah telah menetapkan bagi setiap umat mempunyai ajal, yakni batas waktu hidup dan lainnya. Apabila ajalnya tiba, mereka tidak dapat meminta penundaan atau percepatan sesaat pun."
  }
]