[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai rasul), ”aku tidak sanggup menyingkirkan mudarat dari diriku dan mendatangkan kebaikan bagi diriku, kecuali apa-apa yang dikendaki Allah untuk menolak dariku mudarat atau mendatangkan bagiku suatu kebaikan. Tiap-tiap kaum memiliki waktu berakhirnya masa mereka dan ajal mereka. Apabila telah datang waktu berakhirnya ajal dan kebinasaan umur mereka, maka mereka tidak dapat mengundurkannya sesaatpun sehingga mereka mendapatkan penangguhan dan tidak (pula) ajal mereka maju dari waktu yang telah ditentukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Katakanlah -wahai Rasul- kepada mereka, \"Aku tak kuasa mendatangkan manfaat dan mudarat untuk diriku sendiri. Jadi bagaimana mungkin aku bisa mendatangkan manfaat dan mudarat untuk orang lain? Kecuali apa yang dikehendaki oleh Allah. Dan bagaimana mungkin aku bisa mengetahui perkara gaib-Nya? Tiap-tiap umat yang telah dijanjikan kebinasaannya oleh Allah mempunyai waktu yang telah ditentukan bagi kebinasaan mereka. Namun tidak ada yang mengetahuinya selain Allah. Kemudian apabila waktu kebinasaannya telah tiba mereka tidak dapat memajukannya ataupun memundurkannya walaupun sekejap mata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Hai Rasulullah, katakanlah kepada orang-orang musyrik yang menghina itu: “Aku tidak dapat menjauhkan mudharat dari diriku, dan aku tidak dapat mendatangkan manfaat kepadaku, kecuali jika Allah menghendakinya. Setiap umat memiliki batas waktu yang diketahui Allah, jika waktu itu telah datang maka mereka tidak dapat mengangguhkannya atau menyegerakannya sedikitpun.” Dan katakanlah kepada mereka: “Katakanlah kepadaku jika Allah mendatangkan azab pada waktu siang atau malam, maka apa yang kalian ingin segerakan itu hai orang-orang yang melakukan banyak dosa besar?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. قُل لَّآ أَمْلِكُ لِنَفْسِى ضَرًّا وَلَا نَفْعًا (Katakanlah: “Aku tidak berkuasa mendatangkan kemudharatan dan tidak (pula) kemanfaatan kepada diriku) Maka bagaimana aku dapat mendatangkan kemudharatan kepada orang lain? إِلَّا مَا شَآءَ اللهُ ۗ( melainkan apa yang dikehendaki Allah) Akan tetapi jika Allah menghendaki hal itu maka itu akan terjadi. Ayat ini mengandung nasehat yang sangat agung dan peringatan yang sangat dalam bagi orang yang memiliki kebiasaan berdoa kepada Rasulullah atau beristighasah kepadanya ketika turun musibah, bagitu juga bagi orang yang memohon kepada Rasulullah apa yang tidak dapat dilakukan kecuali oleh Allah, pedahal mengangakat musibah merupakan sesuatu yang masuk dalam lingkup kekuasaan Tuhan semerta alam, namun mereka tidak memohon kepada Tuhan seluruh makhluk yang Maha kuasa atas segala sesuatu, Maha Menciptakan, Memberi Rezeki, dan Yang Maha Memberi dan Menolak. Maka sungguh mengherankan orang-orang yang melazimi kuburan orang-orang mati yang telah terkubur dalam perut bumi, namun mereka memohon kepada mereka untuk mencukupi segala permintaan mereka. Mengapa mereka tidak sadar bahwa mereka telah terjerumus kedalam kesyirikan, dan tidak merasa bahwa mereka telah menyelisihi makna kalimat Laa ilaaha illaa Allah. Kadang mereka menyeru penghuni kuburan-kuburan ini saja, dan kadang pula mereka menyerunya bersama Allah. Setan telah menjadikan hal ini sebagai sebab yang mengantarkan kepada kekafiran banyak orang dari umat yang diberkahi ini, dan mereka menganggap bahwa mereka telah melakukan sebuah kebaikan. Inaa lillahi wa innaa ilaihi raaji’uun. لِكُلِّ أُمَّةٍ أَجَلٌ ۚ( Tiap-tiap umat mempunyai ajal) Allah menimpakan kepada mereka apa yang Dia kehendaki saat ajalnya telah tiba. إِذَا جَآءَ أَجَلُهُمْ فَلَا يَسْتَـْٔخِرُونَ(Apabila telah datang ajal mereka, maka mereka tidak dapat mengundurkannya) Dari ajal yang telah ditentukan itu. وَلَا يَسْتَقْدِمُونَ(dan tidak (pula) mendahulukan(nya)) Walau sejenak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49 Katakanlah kepada mereka wahai Nabi: “Aku tidak kuasa mendatangkan kemudharatan dan tidak pula kemanfaatan kepada diriku, melainkan apa yang dikehendaki Allah pasti terjadi”. Dengan kehendak-Nya aku bisa melakukan sesuatu, bagaimana aku bisa mendatangkan azab kepada kalian? Tiap-tiap umat mempunyai waktu kebinasaan sendiri. Apabila telah datang ajal mereka, maka mereka tidak dapat mengundurkannya sesaatpun dan tidak pula mempercepatnya sesaat pun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku tidak bisa (menolak) mudarat dan tidak pula (mendatangkan) manfaat kepada diriku} Aku tidak mampu menolak mudharat dan tidak pula mendatangkan manfaat {kecuali apa yang dikehendaki Allah” Setiap umat mempunyai ajal} waktu yang ditentukan untuk kehancuran mereka {Apabila ajalnya tiba, maka mereka tidak dapat meminta penundaan sesaat pun dan tidak dapat meminta percepatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. Hendaknya orang-orang yang mendustakanmu mewaspadai sikap menyerupai umat-umat yang dibinasakan sehingga mereka bisa ditimpa azab yang telah menimpa mereka (yang terdahulu), janganlah menantang azab Allah dan mengatakan, “Bilakah (datangnya) ancaman itu, jika memang kamu orang-orang yang benar?” karena ini adalah kezhaliman dari mereka di mana mereka menuntutnya dari Nabi, padahal dia tidak sedikit pun memiliki hak dalam urusan ini, tugasnya hanyalah menyampaikan dan menjelaskan kepada manusia. Adapun hisab mereka dan penurunan azab atas mereka maka ia dari Allah, Dia menurunkannya kepada mereka jika tiba waktu dan saat yang ditentukan dan diletakkan olehNya yang sesuai dengan hikmah Ilahiyah. Jika waktu tersebut telah hadir maka mereka tidak bisa menunda dan memajukannya sesaat pun. Orang-orang yang mendustakan hendaklah mewaspadai sikap menuntut turunnya azab karena mereka menuntut disegerakannya azab Allah yang mana jika ia turun maka azabnya tidak tertolak dari orang-orang yang berdosa. Oleh karena itu, Dia berfirman,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 49: Kecuali apa yang Allah taqdirkan bagiku. Oleh karena itu, bagaimana mungkin aku dapat mendatangkan azab kepadamu. Yakni masa kehancurannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 49",
    "description": "Setelah mendengar permintaan orang-orang kafir sebagaimana terungkap pada ayat di atas, lalu Allah memerintahkan: katakanlah wahai nabi Muhammad, aku hanyalah seorang utusan yang tidak kuasa menolak mudarat maupun mendatangkan manfaat kepada diriku sendiri maupun kepada kalian, kecuali apa yang Allah kehendaki. Allah telah menetapkan bagi setiap umat mempunyai ajal, yakni batas waktu hidup dan lainnya. Apabila ajalnya tiba, mereka tidak dapat meminta penundaan atau percepatan sesaat pun katakanlah wahai nabi Muhammad kepada orang-orang musyrik, terangkanlah kepadaku, jika datang kepada kamu siksaan-Nya pada waktu malam ketika kamu tidur nyenyak, atau siang hari ketika kamu sibuk dengan urusan duniamu, manakah yang diminta untuk disegerakan orangorang yang berdosa itu' Allah mampu menyegerakan azab yang mereka minta, tetapi dia menunda, karena memberi kesempatan kepada para pendurhaka untuk bertobat dari perbuatan maksiat."
  }
]