[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah, Dialah yang menjadikan matahari bersinar dan menjadikan bulan bercahaya, dan menentukan bagi bulan tempat-tempat perputarannya. Dengan matahari akan diketahui (pergantian) hari-hari, dan dengan bulan akan diketahui (pergantian) bulan-bulan dan tahun-tahun. Dan tidak lah Allah menciptakan matahari dan bulan, kecuali karena adanya hikmah yang agung, dan sebagai bukti petunjuk akan kesempurnaan kuasa Allah dan pengetahuanNya.Dia menerangkan hujjah-hujah dan bukti-bukti petunjuk kepada orang-orang yang mengetahui hikmah dari penciptaan makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dia lah yang telah membuat matahari memancarkan dan menyebarkan sinar, membuat bulan menjadi cahaya yang dapat digunakan untuk penerangan, dan menetapkan peredarannya berdasarkan tempat orbitnya yang berjumlah 28 orbit. Yang dimaksud dengan tempat orbit itu ialah jarak yang ditempuhnya dalam sehari-semalam. Hal itu supaya kalian -wahai manusia- dapat mengetahui hitungan hari berdasarkan putaran matahari dan mengetahui hitungan bulan dan tahun berdasarkan putaran bulan. Tidaklah Allah menciptakan langit dan bumi beserta isinya melainkan dengan kebenaran untuk menunjukkan kekuasaan dan kebesaran-Nya kepada manusia. Allah menjelaskan dalil-dalil dan bukti-bukti yang secara nyata menunjukkan keesaan-Nya kepada orang-orang yang mengetahui cara menggunakan dalil-dalil tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Setelah Allah menjelaskan sifat uluhiyah dan rububiyah-Nya, kemudian Allah menyebutkan dalil-dalil secara akal dan ayat-ayat kauniyah yang menunjukkan dua sifat tersebut. Hanya Allah yang menjadikan matahari bersinar pada siang hari, dan menjadikan bulan bercahaya di malam hari, dan Allah menjadikannya beredar dalam jarak yang dapat bulan tempuh dalam sehari semalam; hal ini agar kalian dapat mengetahui perhitungan waktu. Dengan matahari dapat diketahui perhitungan hari, dan dengan peredaran bulan dapat diketahui perhitungan bulan dan tahun. Allah tidak menciptakan hal ini melainkan sebagai hikmah yang besar dan bukti atas keagungan kuasa-Nya. Allah menjelaskan ayat-ayat kauniyah ini bagi orang-orang yang mengetahui besarnya kekuasaan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. جَعَلَ الشَّمْسَ ضِيَآءً وَالْقَمَرَ نُورًا (Dialah yang menjadikan matahari bersinar dan bulan bercahaya) Makna (الضياء) yakni cahaya yang keluar dari sesuatu itu sendiri, semisal cahaya lampu. Dan makna (النور) yakni cahaya yang berasal dari pantulan benda lain, semisal cahaya pantulan dari cermin. Dan cahaya bulan merupakan cahaya hasil pantulan dari cahaya matahari. وَقَدَّرَهُۥ مَنَازِلَ (dan ditetapkan-Nya manzilah-manzilah (tempat-tempat) bagi perjalanan bulan itu) Yakni Allah menentukan perjalanannya dalam manazilnya. Manazil bulan merupakan jarak yang ditempuh oleh bulan dalam sehari semalam, manazil ini berjumlah 28 sebagaimana yang diketahui oleh ahli falak. Bulan menempuh perjalanan satu manazil dalam semalam, diawal manazil bulan akan terlihat kecil kemudian membesar sedikit demi sedikit sampai menjadi purnama, apabila telah mencapai manazil yang terakhir ia akan nampak tipis dan berbentuk bulan sabit kemudian tidak nampak dalam satu atau dua malam. لِتَعْلَمُوا۟ عَدَدَ السِّنِينَ وَالْحِسَابَ ۚ( supaya kamu mengetahui bilangan tahun dan perhitungan (waktu)) Kalaulah tidak ada pengaturan ini maka manusia tidak akan mengetahui perhitungan ini dan tidak mengetahui banyak maslahat bagi mereka yang berhubungan dengan perhitungan ini. Dalam ayat ini terkandung anjuran untuk mempelajari ilmu falak dan perhitungan penanggalan serta perbedaan antara perhitungan tahun masehi dan hijriyah. مَا خَلَقَ اللهُ ذٰلِكَ إِلَّا بِالْحَقِّ ۚ( Allah tidak menciptakan yang demikian itu melainkan dengan hak) Yakni Allah tidak menciptakan langit dan bumi serta mengatur keduanya dengan sebaik-baik pengaturan kecuali agar kebesaran, kekuasaan, dan kebijaksanaan-Nya diketahui sehingga Dia disembah dengan hak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Allah menjadikan matahari bersinar dan bulan bercahaya. Adh-dhiya’ adalah sesuatu yang berasal dari inti sesuatu, dan An-Nur adalah sesuatu yang terjadi bukan dari inti sesuatu. Cahaya bulan itu diperoleh dari sinar matahari. Kira-kira perputaran bulan ada pada 28 tempat. Dan melalui bulan bisa diketahui perhitungan bulan dan tahun. Allah tidak menciptakan langit, bumi dan seisinya kecuali sebagai ciptaan yang dipenuhi dengan kebenaran dan hikmah bukan kesia-siaan. Dia menjelaskan ayat-ayat yang menunjukkan pada keesaan dan kuasaNya bagi kaum yang mau merenung dan bertadabbur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menjadikan matahari bersinar dan bulan bercahaya. dan yang menetapkan tempat-tempatnya} menetapkan perputarannya menjadi 18 tempat {agar kalian mengetahui bilangan tahun dan perhitungan} perhitungan bulan dan hari {Allah tidak menciptakan demikian itu, kecuali dengan benar. Dia merincikan} menjelaskan {tanda-tanda kepada kaum yang mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. ketika Allah menetapkan rububiyah dan uluhiyahNya,maka Dia menjelaskan dalil-dalil aqli dan ufuki yang menunjukkan hal itu, dan menunjukkan kesempurnaanNya dalam nama-nama dan sifat-sifatNya, berupa matahari, rembulan, langit dan bumi serta segala sesuatu yang Dia ciptakan padanya dalam bentuk berbagai macam makhluk, lalu Dia menyatakan bahwa itu adalah tanda-tanda kebesaranNya “bagi kaum yang mengetahui”, dan “bagi kaum yang bertakwa.” Sesungguhnya ilmu membimbing kepada pengetahuan tentang indikasi padanya dan bagaimana mengambil kesimpulan dari indikasi tersebut dengan jalan yang paling mudah. Takwa memunculkan keinginan di dalam hati kepada kebaikan dan rasa takut kepada keburukan yang muncul dari dalil-dalil dan bukti-bukti, serta dari ilmu dan keyakinan. Hasil dari itu adalah bahwa hanya dengan pencipta makhluk-makhluk dengan kriteria seperti ini saja telah menunjukkan kesempurnaan kodrat Allah, ilmuNya, kehidupanNya, dan kemandirianNya, sedangkan sesuatu yang dikandungnya berupa kebaikan, ketepatan, kecanggihan dan kerapian adalah menunjukkan kesempurnaan hikmah Alllah, kebaikan penciptaanNya dan keluasan ilmuNya, sedangkan sesuatu yang dikandung di dalamnya berupa berbagai macam manfaat dan kemaslahatan- seperti menjadikan matahari bersinar, bulan bercahaya yang dengannya terwujud kegunaan mendasar seperti yang telah terwujud, itu menunjukkan rahmat Allah, perhatianNya kepada hamba-hambaNya, keluasan kebaikanNya. Sedangkan sesuatu yang dikandung di meremehkan apadalamnya berupa kekhususan-kekhususan yang menunjukkan bahwa hanya Dia yang disembah yang dicintaiyang dipuji, pemilik keagungan, kemuliaan dan sifat-sifat agung yang mana tidak sepatutnya ada cinta dan takut kecuali kepadaNya. Doa murni tidak diberikan secara tulus kecuali kepadaNya bukan kepada makhluk yang dipelihara yang memerlukan Allah dalam seluruh urusannya. Ayat-ayat ini mengandung dorongan dan ajakan untuk merenungkan makhluk-makhluk Allah, melihatnya untuk mengambil pelajaran, karena dengan itu bashirah bisa meluas, iman dan akal bertambah dan daya pikir menguat. Tidak melakukan itu berarti meremehkan apa yang diperintahkan oleh Allah, menutup pintu bertambahnya iman, menyebabkan kebekuan akal dan pikiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 5: Setelah Allah Subhaanahu wa Ta'aala menguatkan rububiyyah-Nya dan uluhiyyah-Nya (keberhakan untuk diibadahi), Allah menyebutkan dalil akal yang menunjukkan demikian dan menunjukkan kesempurnaan-Nya baik dalam nama maupun sifat-Nya. Dalil-dalil tersebut misalnya matahari, bulan, langit, bumi dan semua yang diciptakan Allah, dan Allah memberitahukan bahwa ayat-ayat tersebut untuk kaum yang mengetahui atau yang bertakwa. Allah menjadikan semua yang disebutkan itu bukanlah main-main, melainkan dengan penuh hikmah Ayat-ayat Allah diperuntukkan kepada orang-orang yang mengetahui dan orang-orang yang bertakwa karena mereka yang dapat mengambil manfaatnya. Ilmu (pengetahuan) membawa untuk mengetahui dilalah (yang ditunjukkan) di dalamnya serta mengetahui cara menggali hukum dari dalil dengan cara yang lebih dekat, sedangkan takwa menimbulkan cinta kepada kebaikan di hati, takut terhadap keburukan, di mana keduanya muncul dari dalil dalil dan bukti, dan dari ilmu serta keyakinan. Kesimpulannya, bahwa Allah menciptakan semua makhluk dengan bentuk seperti itu menunjukkan kekuasaan Allah, ilmu-Nya yang luas, Maha Hidup-Nya dan mengurus makhluk-Nya. Kerapihan dan keindahannya menunjukkan sempurnanya hikmah (kebijaksanaan) Allah, bagusnya ciptaan-Nya dan luasnya ilmu-Nya. Berbagai manfaat dan maslahat seperti dijadikan-Nya matahari bersinar, bulan bercahaya agar dengan keduanya diraih manfaat penting, yang demikian menunjukkan luasnya rahmat Allah, perhatian-Nya terhadap hamba-hamba-Nya, dan luasnya kebaikan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 5",
    "description": "Selain menciptakan langit dan bumi sebagai bukti kebesaran dan kekuasaan-Nya, dialah yang menjadikan matahari bersinar sangat terang yang menghasilkan kehangatan untuk alam raya dengan energi dari dirinya sendiri dan bulan bercahaya karena pantulan energi dari matahari, dan dialah yang menetapkan tempat-tempat orbitnya, yakni tempat peredaran perjalanan bumi mengitari matahari dan bulan mengitari bumi agar kamu mengetahui bilangan tahun, dan perhitungan waktu. Allah tidak menciptakan hal yang demikian sempurna itu melainkan dengan benar, yakni dengan hikmah yang besar. Melalui penciptaan tersebut, dia menjelaskan di antara tanda-tanda kebesaran-Nya kepada orang-orang yang mengetahui, yakni yang mau mengambil pelajaran dari tanda-tanda kekuasaan Allah di alam raya ini. Sesungguhnya pada pergantian malam dan siang dan pada benda apa saja yang diciptakan Allah di langit dan di bumi, yakni benda cair maupun padat, semilirnya angin maupun dahsyatnya petir dan halilintar, pasti terdapat tanda-tanda kebesaran-Nya bagi orang-orang yang bertakwa, yakni orang yang berha-ti-hati agar tidak terjerumus ke dalam kesesatan supaya terhindar dari siksa Allah akibat kesesatan tersebut."
  }
]