[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada orang-orang musyrik, ”beritahulkanlah kepadaku, bila siksaan Allah datang kepada kalian pada malam atau siang hari, maka apa yang kalian minta disegerakan wahai orang-orang pelaku maksiat, dari turunnya siksaan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Katakanlah -wahai Rasul- kepada orang-orang yang meminta disegerakan azabnya itu, \"Katakanlah padaku, jikalau azab Allah itu datang kepada kalian kapan saja di waktu malam atau siang, apa yang kalian maksudkan dengan penyegeraan azab?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. مَّاذَا يَسْتَعْجِلُ مِنْهُ الْمُجْرِمُونَ (apakah orang-orang yang berdosa itu meminta disegerakan juga?) Padahal azab adalah sesuatu yang dibenci, ditakuti hati, dan dijauhi oleh tabiat manusia; lalu apa sebab ketergesaan mereka terhadap azab. Dan orang yang berdosa seharusnya takut terhadap azab karena perbuatan dosanya, maka bagaimana mereka meminta untuk disegerakan azabnya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50 Katakanlah kepada mereka: “Jelaskanlah kepadaku, jika sikaaan-Nya yang kalian minta untuk disegerakan itu datang kepada kamu sekalian di waktu malam atau di siang hari, apakah orang-orang yang berdosa itu meminta disegerakan juga?” Itu pasti akan menimpa mereka dan sangat menyakitkan sehingga tidak pas jika dipercepat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Perlihatkanlah kepadaku} Beritahulah kepadaku {jika datang kepada kalian siksaanNya pada waktu malam} malam {atau siang hari, manakah yang diminta untuk disegerakan} manakah azab yang diminta untuk disegerakan {oleh para pendurhaka itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Allah berfirman, “Katakanlah, ‘Terangkanlah kepadaku, jika datang kepada kamu sekalian siksaanNya di waktu malam,” pada waktu kamu tidur di malam hari. “Atau di siang hari”, pada waktu kamu lalai. “Apakah orang-orang yang berdosa itu minta disegerakan juga?” maksudnya berita apa yang ingin mereka segerakan kehadirannya, dan azab apa yang mereka inginkan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 50: Di saat kamu sedang tidur. Di saat kamu lalai. Kabar gembira ataukah azab yang mereka minta untuk disegerakan. Bisa juga diartikan, “Apakah orang-orang yang berdosa itu meminta disegerakan juga?\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 50",
    "description": "Katakanlah wahai nabi Muhammad kepada orang-orang musyrik, terangkanlah kepadaku, jika datang kepada kamu siksaan-Nya pada waktu malam ketika kamu tidur nyenyak, atau siang hari ketika kamu sibuk dengan urusan duniamu, manakah yang diminta untuk disegerakan orangorang yang berdosa itu' Allah mampu menyegerakan azab yang mereka minta, tetapi dia menunda, karena memberi kesempatan kepada para pendurhaka untuk bertobat dari perbuatan maksiat. Kemudian apakah setelah azab itu terjadi, kamu baru mempercayainya bahwa Allah mahakuasa' padahal saat itu kepercayaanmu sudah tidak berguna, karena kamu sudah binasa. Apakah baru sekarang kamu percaya kalau azab itu pasti datang, padahal sebelumnya kamu selalu meminta agar azab itu disegerakan' ayat ini menjadi teguran bagi orang yang sombong bahkan menantang agar segera didatangkan azab yang diancamkan kepada orang-orang yang durhaka."
  }
]