[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah setelah siksaan Allah menimpa kalian (wahai kaum musyrikin), kalian baru akan beriman pada saat yang keimanan tidak lagi bermanfaat? dan dikatakan pada kalian waktu itu, ”apakah baru sekarang kalian beriman kepadanya, sedang kalian sebelumnya meminta disegerakan kedatangannya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Apakah sesudah datangnya azab yang dijanjikan kepada kalian itu kalian akan beriman? Padahal ketika itu orang yang belum beriman sebelum itu tidak akan mendapatkan manfaat apapun dari imannya. Apakah kalian mau beriman sekarang, sedangkan sebelum ini kalian telah meminta agar azab kalian disegerakan karena kalian tidak percaya akan adanya azab.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Apakah kalian ingin segera datang azab, namun ketika itu menimpa kalian, kalian baru akan mempercayainya? Apakah ketika itu kalian baru beriman, saat tidak bermanfaat lagi untuk beriman. Sebelum azab itu terjadi, kalian ingin agar disegerakan karena kalian tidak mempercayainya dan ingin menghina Rasulullah dan orang-orang beriman?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦٓ ۚ (Kemudian apakah setelah terjadinya (azab itu), kemudian itu kamu baru mempercayainya?) Apakah setelah turunnya azab Allah dan kemurkaan-Nya kalian baru akan beriman, disaat tidak bermanfaat lagi keimanan itu dan tidak dapat menolak darimu keburukan. dan akan dikatakan kepada mereka: Apakah sekarang kalian baru beriman kepadanya? وَقَدْ كُنتُم بِهِۦ تَسْتَعْجِلُونَ(padahal sebelumnya kamu selalu meminta supaya disegerakan?) Meminta disegerakan azab karena pendustaan kalian terhadapnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51 Kemudian apakah setelah azab itu terjadi, kemudian kamu baru mempercayainya? Apakah sekarang kamu baru mempercayai ketika iman sudah tidak berguna lagi, padahal sebelumnya kamu selalu meminta supaya disegerakan dengan memperolok dan merendahkan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah apabila azab itu terjadi} apakah setelah azab itu turun kepada kalian {kalian baru beriman. Apakah sekarang} apakah sekarang kalian beriman {padahal sebelumnya kalian memintanya} meminta azab {disegerakan}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Kemudian apakah setelah terjadinya (azab itu), kamu baru mempercayainya?” Iman tidak lagi berguna pada waktu azab Allah turun. Dikatakan kepada mereka sebagai bentuk penyalahan dan pencacian dalam kondisi tersebut yang mana mereka mengaku beriman. “Apakah sekarang”, kamu beriman dalam kondisi sulit dan susah. “Padahal sebelumnya kamu selalu meminta supaya disegerakan?” karena Sunnah Allah yang berlaku bagi hamba-hambaNya adalah bahwa Dia memperingatkan mereka ketika mereka minta diturunkan peringatan sebelum azab itu turun dan jika azab telah turun, maka iman seseorang tidak lagi berguna sebagaimana Firman Allah tentang Firaun pada saat dia tenggelam. \"berkatalah dia: \"Saya percaya bahwa tidak ada Tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan saya termasuk orang-orang yang berserah diri (kepada Allah)\".(Yunus:90), maka dikatakan kepadanya, \"Apakah sekarang (baru kamu percaya), padahal sesungguhnya kamu telah durhaka sejak dahulu, dan kamu termasuk orang-orang yang berbuat kerusakan.\" (Yunus:91), dan Allah berfirman, \"Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami. Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan di waktu itu binasalah orang-orang kafir.\" (Al-Mu’min:85). Di sini Allah berfirman, “Kemudian apakah setelah terjadinya (azab itu), kamu baru mempercayainya? Apakah sekarang”, kamu mengaku beriman “padahal sebelumnya kamu selalu meminta supaya disegerakan?” Ini adalah akibat perbuatanmu, inilah yang kamu tuntut agar ia disegerakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 51: Padahal keimanan ketika itu tidaklah berguna, lihat pula surat Al Mu’min: 85. Maksudnya di waktu terjadinya azab itu kamu baru beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 51",
    "description": "Kemudian apakah setelah azab itu terjadi, kamu baru mempercayainya bahwa Allah mahakuasa' padahal saat itu kepercayaanmu sudah tidak berguna, karena kamu sudah binasa. Apakah baru sekarang kamu percaya kalau azab itu pasti datang, padahal sebelumnya kamu selalu meminta agar azab itu disegerakan' ayat ini menjadi teguran bagi orang yang sombong bahkan menantang agar segera didatangkan azab yang diancamkan kepada orang-orang yang durhaka. Sebagai akibat dari kesombongan dan kedurhakaan mereka, kemudian di akhirat dikatakan kepada orang-orang yang zalim itu, rasakanlah olehmu siksaan yang kekal di neraka. Kamu tidak diberi balasan, melainkan sesuai dengan apa yang telah kamu lakukan selama kamu hidup di dunia."
  }
]