[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian dikatakan pada orang-orang yang berbuat kezaliman terhadap diri mereka dengan kekafiran mereka terhadap Allah, ”rasakanlah oleh kalian siksaan Allah yang abadi bagi kalian selamanya. Kalian tidak dikenai siksaan kecuali apa-apa yang telah kalian perbuat di dalam kehidupan kalian dari berbagai maksiat-maksiat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Kemudian setelah mereka dimasukkan ke dalam azab dan mereka meminta dikeluarkan dari sana, maka dikatakan kepada mereka, \"Rasakanlah azab yang kekal di Akhirat! Bukankah kalian diberi balasan yang sesuai dengan kekafiran dan kemaksiatan yang telah kalian lakukan?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52-53. Kemudian akan dikatakan kepada orang-orang yang mendustakan itu sebagai penghinaan bagi mereka: “Rasakanlah azab ini selama-lamanya. Bukankah kalian disiksa melainkan karena dosa-dosa yang kalian perbuat?” Mereka memintamu untuk memberitahu mereka -sebagai ejekan dan olokan-: “Apakah azab dan hari kebangkitan yang kamu ancamkan kepada kami itu benar?” Katakanlah kepada mereka: “Demi Tuhanku, itu benar-benar akan terjadi, dan kalian tidak akan mampu melarikan diri dari azab dan perhitungan Allah.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52 Kemudian dikatakan kepada orang-orang yang zalim musyrik itu: “Rasakanlah siksaan yang kekal ini, kamu tidak diberi balasan melainkan sesuai dengan apa yang telah kamu kerjakan di dunia berupa kekufuran dan kemaksiatan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian dikatakan kepada orang-orang yang zalim itu,“Rasakanlah azab yang kekal} azab yang kekal dan tidak akan terputus {Kalian tidak diberi balasan, melainkan sesuai dengan apa yang selama ini telah kalian usahakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “Kemudian dikatakan kepada orang-orang yang zhalim (musyrik) itu”, manakala amal mereka dibalas pada Hari Kiamat, “Rasakanlah olehmu siksaan yang kekal”, yakni azab di mana kamu kekal di dalamnya tidak terhenti sesaat pun darimu. “Tidaklah kamu diberi balasan melainkan dengan apa yang telah kamu kerjakan”, dari kekufuran, pendustaan, dan kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 52: Ketika amalan mereka diberikan balasan pada hari kiamat. Berupa kekafiran, mendustakan dan melakukan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 52",
    "description": "Sebagai akibat dari kesombongan dan kedurhakaan mereka, kemudian di akhirat dikatakan kepada orang-orang yang zalim itu, rasakanlah olehmu siksaan yang kekal di neraka. Kamu tidak diberi balasan, melainkan sesuai dengan apa yang telah kamu lakukan selama kamu hidup di dunia. Setelah diuraikan dengan perinci tentang siksaan yang akan diterima oleh orang-orang kafir, lalu mereka menanyakan kepadamu wahai nabi Muhammad, benarkah azab yang dijanjikan itu' katakanlah, wahai nabi Muhammad ya, demi tuhanku, sesungguhnya azab itu pasti benar akan terjadi dan menimpa orang-orang yang durhaka dan kamu sekali-kali tidak dapat mengalahkankan tuhan untuk menghindar dari siksa-Nya."
  }
]