[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik dari kaummu itu meminta berita kepadamu (wahai rasul), tentang siksaan pada hari kiamat, apakah benar(siksaan tersebut) itu? katakanlah kepada mereka (wahai rasul), ”benar, demi tuhanku, sesungguhnya itu sungguh-sungguh benar, tiada keraguan padanya. Dan kalian tidak dapat melemahkan Allah untuk membangkitkan kalian dan memberikan balasan bagi kalian, sedang kalian berada dalam genggaman dan kekuasaanNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan orang-orang musyrik itu meminta penjelasan kepadamu -wahai Rasul-, \"Apakah azab yang dijanjikan kepada kami ini benar adanya?\" Katakanlah kepada mereka, \"Ya. Sungguh, demi Allah, itu benar adanya. Dan kalian tidak akan lolos darinya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَيَسْتَنۢبِـُٔونَكَ أَحَقٌّ هُوَ ۖ (Dan mereka menanyakan kepadamu: “Benarkah itu?) Yakni benarkah azab yang diancamkan kepada kami itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53 Mereka menanyakan kepadamu tentang kebenaran azab: “Benarkah azab yang dijanjikan itu? Katakanlah: “Ya, demi Tuhanku, sesungguhnya azab itu adalah benar dan kamu sekali-kali tidak bisa selamat darinya jika Dia berkehendak mengazab kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menanyakan kepadamu} mereka meminta kabar kepadamu wahai Muhammad {Apakah itu benar} azab yang kamu janjikan untuk kami {Katakanlah,“Ya} iya {demi Tuhanku, sesungguhnya itu pasti benar dan kalian tidak dapat menghindar.”} menghindari azab dengan melarikan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Allah berfirman kepada NabiNya, “Dan mereka menanyakan kepadamu, ‘Benarkah (azab yang dijanjikan) itu?” maksudnya, orang-orang yang mendustakan menanyakan kepadamu dengan dasar penentangan dan penolakan bukan dengan dasar mencari kejelasan dan petunjuk. “Benarkah (azab yang dijanjikan) itu?” maksudnya, apakah benar kebangkitan manusia dari kubur dan dikumpulkannya mereka untuk hari pembalasan kepada hamba-hamba sesuai dengan amal mereka, jika baik maka baik jika buruk maka buruk? “Katakanlah”, kepada mereka dengan bersumpah atas kebenarannya dengan berdalil kepada dalil yang jelas dan bukti yang kuat. “Ya demi Rabbku, sesungguhnya azab itu adalah benar”, tanpa ada keraguan dan kebimbangan di dalamnya. “Dan kamu sekali-kali tidak bisa luput (darinya).” Maksudnya, kamu tidak mampu menghalangi Allah untuk membangkitkanmu, sebagaimana Dia menciptakanmu pertama kali sementara kamu belum menjadi apa pun maka Dia pun akan mengembalikanmu sekali lagi untuk membalas perbuatanmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 53: Bukan dengan maksud mencari petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 53",
    "description": "Setelah diuraikan dengan perinci tentang siksaan yang akan diterima oleh orang-orang kafir, lalu mereka menanyakan kepadamu wahai nabi Muhammad, benarkah azab yang dijanjikan itu' katakanlah, wahai nabi Muhammad ya, demi tuhanku, sesungguhnya azab itu pasti benar akan terjadi dan menimpa orang-orang yang durhaka dan kamu sekali-kali tidak dapat mengalahkankan tuhan untuk menghindar dari siksa-Nya. Pada ayat sebelumnya dijelaskan bahwa orang-orang yang durhaka pasti akan diazab, lau pada ayat ini digambarkan penyesalan mereka ketika di akhirat. Dan kalau seandainya setiap orang yang zalim itu, yakni orang yang mempersekutukan Allah itu mempunyai segala harta benda berharga yang ada di bumi, tentu dia menebus dirinya dengan itu agar terlepas dari siksa, tetapi hal itu tidak mungkin, dan mereka menyembunyikan penyesalannya yang sangat besar dan tersembunyi dalam hati, ketika mereka telah menyaksikan, merasakan azab yang sangat pedih itu. Kemudian diberi keputusan di antara mereka dengan adil sesuai dengan apa yang mereka kerjakan, dan mereka tidak dizalimi sedikit pun."
  }
]