[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya tiap-tiap jiwa yang musyrik dan kafir kepada Allah memiliki semua yang ada di muka bumi,dan Dia memberikan kepadanya kesempatan untuk menjadikan semua itu sebagai tebusan baginya dari siksaan tersebut, tentulah ia akan menembus dengannya. Dan orang-orang yang berbuat kezhaliman menyembunyikan penyesalan mereka ketika mereka melihat langsung siksaaan Allah menimpa mereka semua, dan Allah telah memutuskan perkara diatara mereka dengan adil, sedang mereka tidaklah teraniaya sedikitpun. Sesungguhnya Allah tidak menyiksa seorangpun kecuali disebabkan dosanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Seandainya setiap orang musyrik mempunyai semua harta berharga yang ada di bumi ini, niscaya ia akan menggunakannya untuk menebus dirinya dari azab Allah jika ia diberi kesempatan untuk menebusnya. Dan orang-orang musyrik itu menyembunyikan penyesalan mereka atas kekafiran mereka tatkala mereka menyaksikan azab di Hari Kiamat. Allah memutuskan perkara mereka dengan adil. Mereka tidak pernah dizalimi, melainkan diberi balasan yang setimpal dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Seandainya setiap orang kafir memiliki seluruh harta yang ada di dunia, niscaya akan mereka jadikan sebagai tebusan bagi diri mereka dari azab Allah. Orang-orang kafir itu menyembunyikan penyesalan yang mereka rasakan ketika menyaksikan azab. Dan Allah memberi keputusan antara hamba-hamba-Nya dengan adil, mereka sama sekali tidak terzalimi sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَلَوْ أَنَّ لِكُلِّ نَفْسٍ ظَلَمَتْ مَا فِى الْأَرْضِ لَافْتَدَتْ بِهِۦ (Dan kalau setiap diri yang zalim (muayrik) itu mempunyai segala apa yang ada di bumi ini, tentu dia menebus dirinya dengan itu) Yakni seandainya setiap orang kafir di hari kiamat memiliki segala yang ada di bumi berupa harta-harta yang berharga dan simpanannya maka mareka pasti ingin menjadikannya sebagai tebusan diri mereka dari azab. وَأَسَرُّوا۟ النَّدَامَةَ لَمَّا رَأَوُا۟ الْعَذَابَ (dan mereka membunyikan penyesalannya ketika mereka telah menyaksikan azab itu) Yakni mereka menyembunyikan penyesalan mereka setelah mereka menyaksikan azab pada keadaan itu yang menghilangkan akal mereka. Oleh sebab itu mereka menyembunyikan penyesalan mereka agar tidak diejek oleh orang-orang beriman. Hal ini mereka lakukan ketika mereka melihat azab, adapun ketika mereka telah memasuki azab tersebut maka mereka mengucapkan: يا حسرتنا على ما فرطنا فيها (Alangkah besarnya penyesalan kami terhadap kelalaian kami tentang Kiamat itu). mereka menampakkan penyesalan yang mereka sembunyikan. وَقُضِىَ بَيْنَهُم بِالْقِسْطِ ۚ( Dan telah diberi keputusan di antara mereka dengan adil) Yakni antara orang-orang beriman dan orang-orang kafir, atau antara para pemimpin orang-orang kafir dan para pengikutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54 Kalaupun pada hari kiamat nanti setiap diri yang zalim dengan kemusyrikan dan kesesatan itu mempunyai segala apa yang ada di bumi ini, tentu dia akan menebus dirinya dengan itu agar selamat dari azab. Mereka akan membunyikan penyesalannya ketika mereka telah menyaksikan azab itu. Di antara mereka orang kafir dan mukmin telah diberi keputusan dengan adil, dan mereka tidak dizalimi sama sekali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya setiap orang yang berbuat zalim itu} berbuat syirik {apa yang ada di bumi, tentu dia menebus diri dengannya. Mereka menyembunyikan penyesalan} merekaa menyembunyikan penyesalan {ketika mereka telah menyaksikan azab itu. Diputuskanlah di antara mereka dengan adil, dan mereka itu tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Dan” pada Hari Kiamat kalau “setiap diri yang zhalim (musyrik) itu memiliki”, dengan kekufuran dan kemaksiatan “segala sesuatu yang ada di bumi ini”, dalam bentuk emas, perak dan lainnya untuk digunakan menebus azab Allah, “tentu dia menebus dirinya dengan itu.” Namun itu semua tidaklah berguna baginya karena manfaat dan mudarat, pahala dan hukuman berdasarkan pada perbuatan baik atau buruk. “Dan mereka menyembunyikan” yakni mereka orang-orang yang zhalim, “penyesalannya ketika mereka telah menyaksikan azab itu.” Mereka menyesal atas apa yang mereka lakukan, dan pada waktu itu tidak ada lagi tempat aman. “Dan telah diberi keputusan di antara mereka dengan adil.” Keadilan yang sempurna yang tidak ada kezhaliman padanya dari segi apa pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 54: Berupa harta. Namun yang demikian tidaklah bermanfaat bagi mereka, yang bermanfaat hanyalah iman dan amal saleh sewaktu di dunia. Pada hari kiamat. Para pemimpin menyembunyikan penyesalan di hadapan para pengikut karena takut celaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 54",
    "description": "Pada ayat sebelumnya dijelaskan bahwa orang-orang yang durhaka pasti akan diazab, lau pada ayat ini digambarkan penyesalan mereka ketika di akhirat. Dan kalau seandainya setiap orang yang zalim itu, yakni orang yang mempersekutukan Allah itu mempunyai segala harta benda berharga yang ada di bumi, tentu dia menebus dirinya dengan itu agar terlepas dari siksa, tetapi hal itu tidak mungkin, dan mereka menyembunyikan penyesalannya yang sangat besar dan tersembunyi dalam hati, ketika mereka telah menyaksikan, merasakan azab yang sangat pedih itu. Kemudian diberi keputusan di antara mereka dengan adil sesuai dengan apa yang mereka kerjakan, dan mereka tidak dizalimi sedikit pun. Allah tidak akan menzalimi hamba-Nya, karena dia tidak memerlukan apapun dari siapapun. Ayat ini menegaskan, ketahuilah sesungguhnya milik Allah-lah apa yang ada di langit dan di bumi, dia yang menciptakan dan dia atur sesuai kehendak-Nya. Ketahuilah, bukankah janji Allah itu benar' hari pembalasan pasti akan datang. Orang yang taat pasti akan diberi pahala dan yang durhaka akan disiksa. Tetapi kebanyakan mereka tidak mengetahui dan tidak mempercayainya."
  }
]