[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatalah, sesungguhnya yang ada di langit dan di bumi merupakan milik Allah , tidak ada sesuatupun darinya yang menjadi milik seseorang pun selainNya. Ingatlah, sesungguhnya perjumpaan dengan Allah dan siksaanNya bagi kaum musyrikin pasti terjadi, akan tetapi kebanyakan mereka tidak mengetahui hakikat hal demikian itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Sesungguhnya hanya Allah lah pemilik apa saja yang ada di langit dan apa saja yang ada di bumi. Ingatlah, sesungguhnya ancaman Allah tentang hukuman bagi orang-orang kafir pasti akan terjadi, tidak ada keraguan sedikitpun tentang hal itu. Akan tetapi kebanyakan dari mereka tidak mengetahui hal itu, sehingga mereka merasa bimbang dan ragu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Allah mengingatkan bahwa kerajaan tujuh langit dan tujuh bumi adalah kepunyaan-Nya, dan janji-Nya tentang hari kebangkitan, perhitungan, dan azab adalah janji yang benar dan tidak diragukan kedatangannya; akan tetapi kebanyakan mereka tidak mengetahui kebenarannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55 Ingatlah sebagai keimanan bahwa Allah Maha Kuasa untuk memberi ganjaran dan juga azab, sesungguhnya apa yang ada di langit dan di bumi baik kerajaan, makhluk maupun hamba adalah kepunyaan Allah. Tidak ada seorangpun yang memiliki sesuatu untuk menyelamatkan mereka dari azab. Ingatlah, sesungguhnya janji Allah itu benar, tetapi kebanyakan mereka tidak mengetahui hakikat kebaikan dan kerusakan mereka serta apa yang menunggu mereka di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah, sesungguhnya milik Allahlah apa yang ada di langit dan di bumi. Ketahuilah, sesungguhnya janji Allah itu benar, tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Ingatlah, sesungguhnya kepunyaan Allah apa yang ada di langit dan dibumi.” Dia menetapkan hukum pada mereka dengan hukum diniyah dan qadariyah, dan Dia akan menetapkan hukum pada mereka dengan hukum jaza’i. oleh karena itu, Dia berfirman, “Ingatlah, sesungguhnya janji Allah itu benar, tetapi kebanyakan mereka tidak mengetahui(nya).” Oleh karena itu, mereka tidak bersiap-siap untuk bertemu Allah bahkan mungkin mereka tidak beriman kepadanya, padahal dalil-dalil yang pasti dan bukti-bukti aqli dan naqli telah mendukungnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 55: Dia memutuskan semua yang ada di langit dan di bumi dengan keputusan syar’i dan qadari (ketetapan-Nya di alam semesta), dan Dia akan memutuskan mereka dengan keptusan jaza’i (pembalasan). Yaitu membangkitkan dan memberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 55",
    "description": "Allah tidak akan menzalimi hamba-Nya, karena dia tidak memerlukan apapun dari siapapun. Ayat ini menegaskan, ketahuilah sesungguhnya milik Allah-lah apa yang ada di langit dan di bumi, dia yang menciptakan dan dia atur sesuai kehendak-Nya. Ketahuilah, bukankah janji Allah itu benar' hari pembalasan pasti akan datang. Orang yang taat pasti akan diberi pahala dan yang durhaka akan disiksa. Tetapi kebanyakan mereka tidak mengetahui dan tidak mempercayainya. Sebagai salah satu bukti kekuasaan Allah, dialah yang menghidupkan dan mematikan dan hanya kepada-Nyalah kamu dikembalikan setelah kematian menghampirimu."
  }
]