[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah, Dialah tuhan yang menghidupkan dan mematikan. Tidak sulit bagiNya untuk Menghidupkan orang-orang sesudah kematian mereka, sebagaimana tidak sulit untuk mematika mereka, bila Dia menghendaki itu. Dan mereka akan kembali kepadaNya setelah kematian mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dia lah yang dapat membangkitkan orang-orang mati dan mematikan orang-orang hidup. Dan hanya kepada-Nya lah kalian akan dikembalikan di Hari Kiamat. Lalu Dia akan memberikan balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Hanya Allah yang dapat menghidupkan orang mati dan mematikan orang hidup. Hai manusia, kepada-Nya kalian akan kembali setelah kematian untuk mendapat perhitungan atas amal-amal kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56 Dialah, Dzat Yang Maha menghidupkan dan mematikan dan hanya kepada-Nya-lah kamu dikembalikan. Kalian akan diberi balasan atas segala amal baik atau buruk yang telah kalian kerjakan kebaikan atau keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menghidupkan dan mematikan serta hanya kepadaNyalah kalian akan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. “Dia-lah yang menghidupkan dan mematikan.” Maksudnya Dia-lah Allah yang memiliki otoritas menghidupkan, mematikan dan aturan-aturan lainnya. Dalam hal itu DIa tidak bersekutu. “Dan hanya kepadaNya-lah kamu dikembalikan,” pada Hari Kiamat, maka Dia membalasmu sesuai dengan amalmu baik dan buruknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 56: Demikian pula yang mengatur segala urusan, dan tidak ada sekutu dalam semua itu. Pada hari kiamat lalu Dia memberikan balasan terhadap amalmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 56",
    "description": "Sebagai salah satu bukti kekuasaan Allah, dialah yang menghidupkan dan mematikan dan hanya kepada-Nyalah kamu dikembalikan setelah kematian menghampirimu. Setelah diingatkan pada ayat sebelumnya bahwa semua yang hidup pasti akan mati dan akan kembali kepada Allah, lalu manusia diingatkan: wahai manusia! sungguh, telah datang kepadamu pelajaran berupa kitab suci Al-Qur'an dari tuhanmu, obat penyembuh bagi penyakit yang ada dalam dada, yakni dalam hati manusia, seperti iri hati, dengki, dan lain-lain, dan petunjuk menuju kebenaran serta rahmat yang besar bagi orang yang benar-benar beriman."
  }
]