[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian manusia, sesungguhnya telah datang kepada kalian nasihat dari tuhan kalian yang memperingatkan kalian dari siksaan Allah dan menakuti kalian dengan ancamanNYa, yaitu al-qur’an dan apa yang dikandungnya berupa ayat-ayat dan nasihat-nasihat untuk memperbaiki akhlak-akhlak kalian dan amal perbuatan kalian. Dan di dalamnya juga terdapat obat bagi hati dari kebodohan, kesyirikan dan seluruh penyakit, ,serta merupakan petunjuk lurus bagi orang yang mengikutinya dari seluruh makhluk, sehingga menyelamatkannya dari kebinasaan. Allah menjadikannya sebagai kenikmatan dan rahmat bagi kaum mukminin dan mengistimewakan mereka dengan itu secara khusus; karena merekalah yang dapat mengambil manfaat dengan iman, sedangkan orang-orang kafir,maka ia adalah kegelapan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Wahai manusia, telah datang kepada kalian Kitab Suci Al-Qur`ān yang berisi peringatan, anjuran dan larangan. Al-Qur`ān adalah obat penawar untuk penyakit bimbang dan ragu yang bersarang di dalam hati. Al-Qur`ān adalah petunjuk ke jalan yang benar. Dan Al-Qur`ān mengandung rahmat bagi orang-orang yang beriman, karena merekalah yang memanfaatkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Allah menyampaikan kepada manusia keagungan al-Qur’an. Al-Qur’an telah diturunkan kepada mereka yang mengandung pelajaran bagi mereka dari Sang Pencipta, agar menjadi pengingat, pelembut dan obat hati, penyelamat dari kepercayaan dan hawa nafsu yang rusak, cahaya yang melenyapkan kegelapan jahiliyah, petunjuk menuju kebenaran, dan rahmat yang besar bagi orang-orang yang beriman kepada Allah dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. مَّوْعِظَةٌ مِّن رَّبِّكُمْ(pelajaran dari Tuhanmu) Al-Qur’an mengandung peringatan tentang kesudahan seseorang dengan sesuatu yang menyenangkan atau dengan sesuatu yang menakutkan. وَشِفَآءٌ لِّمَا فِى الصُّدُورِ(dan penyembuh bagi penyakit-penyakit (yang berada) dalam dada) Berupa keraguan-keraguan yang menimpa orang-orang yang bingung. Dan al-Qur’an yang mengandung bantahan terhadap akidah-akidah yang sesat. وَهُدًى (dan petunjuk) Yakni pemberi petunjuk bagi orang yang mengikuti dan memahami al-Qur’an kepada jalan yang mengantarkan menuju surga. وَرَحْمَةٌ (serta rahmat) Yakni hal-hal dalam al-Qur’an yang menjadi sebab turunnya rahmat Allah kepada hamba-hamba-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Penyakit hati dapat menggiring seseorang kepada kegelisahaan yang berkepanjangan, dan tiada kesembuhan untuk penyakit ini kecuali dengan ilmu; oleh karena itu Allah menyebut kitabnya sebagai penawar untuk penyakit-penyakit hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57 Hai manusia, sesungguhnya pelajaran dari Tuhanmu telah datang kepadamu dengan begitu jelas. Yaitu pelajaran yang telah dikandung dalam Alquran menuju jalan kebenaran dan menjauhi keburukan dengan metode kabar gembira tentang nikmat surga dan ancaman atas azab neraka. Juga sebagai penyembuh bagi penyakit-penyakit yang berada dalam dada berupa keyakinan yang keliru dan rusak. Juga petunjuk serta rahmat Allah bagi orang-orang yang beriman menuju jalan kebenaran yang menuntun ke surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, sungguh telah datang kepada kalian pelajaran} pengingat {dari Tuhan kalian, penyembuh bagi sesuatu yang terdapat dalam dada, dan petunjuk serta rahmat bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Allah menganjurkan manusia agar memperhatikan kitab yang mulia ini dengan menyebutkan sifat-sifatnya yang baik yang dibutuhkan bagi manusia, seraya Dia berfirman, “Hai manusia, sesungguhnya telah datang kepadamu pelajaran dari Rabbmu”, yang menasehatimu dan memperingatkanmu dari amalan yang mendatangkan murka Allah yang menyebabkan siksaNya, ia memperingatkanmu dengan menjelaskan akibat buruknya, “dan penyembuh bagi penyakit-penyakit (yang berada) dalam dada”, ia adalah al-Quran ini, penyembuh bagi sesuatu yang ada di dalam dada berupa penyakit hawa nafsu yang menghalangi ketundukan kepada syariat dan penyakit-penyakit syubhat yang menodai ilmi al-Yaqin, karena apa yang dikandungnya berupa targhib (anjuran) dan tarhib (ancaman), janji pahala dan ancaman siksa, membuat seorang hamba merasa cinta dan takut. Jika pada diri hamba terdapat kecintaan kepada kebaikan dan rasa takut kepada keburukan dan keduanya tumbuh berdasarkan makna-makna al-Quran yang merasuk padanya, maka hal itu akan mendorongnya mendahulukan keinginan Allah di atas keinginan dirinya, dan apa yang menyebabkan ridha Allah lebih dipentingkan daripada syahwat dirinya sendiri. Begitu pula bukti-bukti dan dalil yang dikandungnya yang dipaparkan oleh Allah yang sangat baik dan dijelaskan olehNYa dengan sangat jelas yang mengikis syubhat yang menodai kebenaran dan mengantarkan hati kepada derajat yakin tertinggi, jika hati sehat, tidak sakit, dan ia dihiasi dengan pakaian keselamatan, maka seluruh anggota tubuh mengikutinya, karena anggota tubuh akan baik disebabkan oleh baiknya hati dan akan buruk disebabkan buruknya hati. “Dan petunjuk serta rahmat bagi orang-orang yang beriman.” Petunjuk adalah ilmu tentang kebenaran dan pengamalannya. Rahmat adalah kebaikan dan pahala dunia dan akhirat yang didapatkan oleh orang yang mendapatkan petunjuk, sedangkan hidayah adalah sarana paling mulia dan rahmat adalah sasaran dan target paling sempurna, akan tetapi hidayah dan rahmat itu tidak berlaku kecuali pada orang-orang yang beriman, jika hidayah telah didapatkan dan rahmat yang timbul darinya juga telah diraih, maka terwujudlah kebahagiaan, keberuntungan, keberhasilan, dan ketentraman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 57: Di ayat ini, Allah Subhaanahu wa Ta'aala mendorong manusia mendatangi kitab yang mulia ini dengan menyebutkan sifat-sifatnya yang baik yang dibutuhkan sekali oleh hamba. Yang memperingatkan kamu tentang amal-amal yang dapat mendatangkan kemurkaan Allah dan hukuman-Nya, dan mengingatkan kamu agar menjauhi semua itu dengan menerangkan pengaruh dan bahayanya. Seperti penyakit syahwat yang dapat menghalangi seseorang dari tunduk kepada syara’, dan penyakit syubhat yang menodai ilmu yang yakin. Di dalam Al Qur’an terdapat pelajaran, targhib (dorongan) dan tarhib (peringatan), janji dan ancaman, di mana hal itu dapat menjadikan seorang hamba memiliki rasa harap dan cemas. Ia akan berharap untuk memperoleh kebaikan yang dijanjikan dengan mengerjakan amalan yang dapat mencapai ke arahnya serta ia akan merasa takut jika mengerjakan keburukan karena ancaman yang diancamkan itu. Di dalam Al Qur’an juga terdapat bukti dan dalil yang disebutkan Allah dengan cara yang paling baik dan diterangkan-Nya dengan penjelasan yang paling baik, di mana semua itu dapat menyingkirkan syubhat dan menjadikan hati seseorang mencapai ke derajat yakin yang sebelumnya ragu. Ketika hati sembuh dari penyakit-penyakit itu, maka anggota badan yang lain pun menjadi baik. Dengan Al Qur’an dapat diketahui kebenaran. Yakni kebaikan yang diberoleh dan pahala segera atau ditunda nanti bagi orang yang mengambil petunjuk darinya. Dengan petunjuk dan rahmat tercapailah kebahagiaan dan keberuntungan. Oleh karena itulah, Allah Subhaanahu wa Ta'aala memerintahkan seseorang bergembira dengan hal tersebut sebagaimana disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 57",
    "description": "Setelah diingatkan pada ayat sebelumnya bahwa semua yang hidup pasti akan mati dan akan kembali kepada Allah, lalu manusia diingatkan: wahai manusia! sungguh, telah datang kepadamu pelajaran berupa kitab suci Al-Qur'an dari tuhanmu, obat penyembuh bagi penyakit yang ada dalam dada, yakni dalam hati manusia, seperti iri hati, dengki, dan lain-lain, dan petunjuk menuju kebenaran serta rahmat yang besar bagi orang yang benar-benar beriman. Katakanlah wahai nabi Muhammad kepada manusia dengan karunia Allah berupa agama islam dan rahmat-Nya, yakni Al-Qur'an, hendaklah dengan itu mereka bergembira. Karunia dan rahmat Allah itu lebih baik daripada apa yang mereka kumpulkan berupa harta dan kemewahan duniawi."
  }
]