[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul),kepada seluruh manusia, ”dengan karunia Allah dan rahmatNya, yaitu hidayah yang datang dari Allah kepada mereka dan agama yang benar yaitu islam, dengan itulah hendaknya mereka bergembira. Sesungguhnya islam yang kepadanya Allah menyeru kalian dan al-qur’an yang diturunkanNya pada Muhammad itu lebih baik dari apa yang mereka kumpulkan berupa kekayaan dunia yang semu dan segala isinya dari kemegahannya yang fana lagi akan sirna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Katakanlah -wahai Rasul- kepada manusia, \"Al-Qur`ān yang aku bawa kepada kalian adalah anugerah dan rahmat dari Allah untuk kalian. Maka bergembiralah kalian dengan anugerah dan rahmat yang Allah berikan kepada kalian, bukan dengan yang lain.\" Karena apa yang dibawa Muhammad -ṣallallāhu 'alaihi wa sallam- dari Tuhannya untuk mereka itu lebih baik dari harta benda dunia yang mereka kumpulkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Hai Rasulullah, katakanlah kepada jin dan manusia: bergembiralah orang-orang beriman dengan agama Islam dan turunnya al-Qur’an. Ini lebih utama untuk menjadikan mereka bergembira, karena ia lebih baik dari kenikmatan dunia yang mereka kumpulkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. قُلْ بِفَضْلِ اللهِ وَبِرَحْمَتِهِۦ فَبِذٰلِكَ فَلْيَفْرَحُوا۟ (Katakanlah: “Dengan kurnia Allah dan rahmat-Nya, hendaklah dengan itu mereka bergembira) Yakni maka hendaklah mereka bergembira atas apa yang telah Allah berikan dalam al-Qur’an dan atas dijadikannya mereka sebagai pembawa al-Qur’an serta atas karunia dan rahmat Allah yang diberikan kepada mereka. هُوَ خَيْرٌ مِّمَّا يَجْمَعُونَ(itu adalah lebih baik dari apa yang mereka kumpulkan) Berupa kenikmatan dunia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tentang pengobatan dengan al-qur'an : suatu ketika al-Fudhoil bin 'iyadh berdiri dihadapan Sufyan bin 'Uyainah (ketika itu ia sedang sakit) kemudian al-Fudhoil berkata kepada nya : { قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ } Sufyan kemudian membalas ucapan itu : \"wahai ayah 'Ali, demi Allah kami tidak pernah merasa senang sampai kami mengambil al-Qur'an sebagai obat, dan kami meletakkannya untuk penyakit hati\". 2 ). Merupakan karunia dan Rahmat Allah adalah : al-Qur'an dan keimanan dalam diri seorang hamba; maka barangsiapa yang bergembira dengannya sungguh ia telah bergembira dengan sesuatu yang paling agung, sebaliknya barangsiapa yang bergembira kepada selainnya sungguh ia telah berbuat zholim terhadap dirinya. 3 ). Sebagian salaf mengatakan : ((tidaklah seseorang bergembira kepada selain Allah melainkan ia telah lalai dari-Nya; karena orang yang lalai bergembira dengan hawa nafsunya, sedangkan orang berakal bergembira dengan tuannya)). 4 ). Zaman ini rumah-rumah setiap wilayah merayakan kegembiraan mereka dengan mengadakan acara pesta atas keberhasilan anak-anak mereka, setelah menempuh usaha dan kerja keras, dan besarnya ucapan selamat tergantung tingginya nilai yang diraih oleh seorang anak, dan diantara hak yang selalu dinanti seseorang dari keberhasilannya adalah mendapatkan penghormatan dan kemuliaan dari kerabatnya, sebesar yang ia usahakan sebesar itu pula penghargaan untuknya!. Sejenak kita memperhatikan peristiwa ini, kemudian mengingat kegembiraan di akhirat, ketika orang-orang sabar diserahkan kepada mereka balasan yang pantas buat mereka, dan kita bandingkan dengan apa yang diterima oleh seorang manusia di dunia, sesungguhnya kegembiraan yang paling utama adalah : { قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ } \"Katakanlah: \"Dengan kurnia Allah dan rahmat-Nya, hendaklah dengan itu mereka bergembira. Kurnia Allah dan rahmat-Nya itu adalah lebih baik dari apa yang mereka kumpulkan\". 5 ). Pelajaran penting ketika bulan Ramadhan mencapai pertengahan dari waktuya perhatikan bagaimana keadaan diri dan hati kita terhadapnya : Jika anda termasuk orang yang tetap berjuang dalam kebaikan di setiap waktu yang berjalan; maka bersyukurlah karena Allah telah memberimu kesempatan dan peluang di dalamnya : { قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا }. Namun jika kamu termasuk orang lalai dan membuang-buang waktu sampai terlewatkan semua kesempatan yang telah diberikan; maka takutah kepada dirimu jika sifat ini akan terus menghantui : { وَكَانَ أَمْرُهُ فُرُطًا } \"dan adalah keadaannya itu melewati batas\" [ Al-Kahfi : 28 ]. 6 ). Hari-hari 'Ied adalah hari bergembira dan bersenang-senang dengan karunia yang luar bisa ini; kita berbahagia dengan turunnya rahmat yang begitu banyak, sesungguhnya ia adalah kegembiraan yang patut disyukuri : { وَلَعَلَّكُمْ تَشْكُرُونَ } , bukan kegembiraan meninggalkan ibadah dengan berbuat maksiat dan sombong; karena perkara ini tidak menggambarkan sikap seseorang dalam pengagungannya kepada Allah atas karunia dan kemudahan yang diberikan oleh-Nya dalam rangka menjalankan rukun yang mulia ini. 7 ). Ketika hari raya telah tiba kita terpesona oleh pemandangan-pemandangan yang indah, wajah-wajah yang berseri-seri, dan pancaran senyum yang bercahaya; oleh karena itu ketika hari raya datang hidup kita penuh dengan kegembiraan dan kebahagiaan, kita menyikapi setiap orang dengan hati yang ridho dan menjauhi segala keburukan penyakit hati; semua itu sebagai sambutan baik kepada firman Allah : { قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58 Katakanlah wahai Nabi: “Dengan karunia Allah dan rahmat-Nya, yaitu Islam dan Alquran, sehingga menjadi ahli Alquran dan pengikut Nabi supaya dengan itu mereka bergembira. Kurnia Allah dan rahmat-Nya itu adalah lebih baik dari apa yang mereka kumpulkan di dunia”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Dengan karunia Allah} Allah memberi karunia kalian dengan Islam {dan rahmatNya itu} Dia merahmati kalian dengan menurunkan Al-Qur’an {hendaklah mereka bergembira dengan itu. Itu lebih baik daripada apa yang mereka kumpulkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Oleh karena itu, Allah memerintahkan agar berbahagia dengan itu seraya berfirman, “Katakanlah, ‘Dengan Karunia Allah’.” Yaitu –Quran yang merupakan nikmat, karunia, pemberian, dan keutamaan terbesar yang Allah limpahkan kepada hamba-hambaNya. RahmatNya adalah agama, iman, ibadah kepada Allah, mencintaiNya, dan mengetahuiNya. “Hendaklah dengan itu mereka bergembira. Karunia Allah dan rahmatNya itu adalah lebih baik daripada sesuatu yang mereka kumpulkan,” dalam bentuk kenikmatan dunia dan kelezatannya. Nikmat agama yang berkaitan dengan kebahagiaan dunia dan akhirat tidak bisa dibandingkan dengan apa yang dikumpulkan di dunia yang dalam waktu dekat akan lenyap dan menghilang. Allah memerintahkan berbahagia dengan karunia dan rahmatNya karena hal itu memang menyebabkan kebahagiaan, semangat, serta bersyukur kepada Allah dan menambah kekuatan serta keinginan kuat bagi jiwa untuk meraih ilmu dan iman dan meningkatkan keduanya, ini adalah kebahagiaan yang dipuji, Lain halnya berbahagia dengan syahwat, kenikmatan dunia atau berbahagia dengan kebatilan. Ini adalah tercela sebagaimana Firman Allah tentang ucapan kaum Qarun kepadanya. \" \"Janganlah kamu terlalu bangga; sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri\".\"(Al-Qashash:76). Dan sebagaimana Firman Allah tentang orang-orang yang berbahagia dengan kebatilan yang mereka ikuti yang bertentangan dengan apa yang dibawa oleh para rasul, \" Maka tatkala datang kepada mereka rasul-rasul (yang diutus kepada) mereka dengan membawa ketarangan-keterangan, mereka merasa senang dengan pengetahuan yang ada pada mereka dan mereka dikepung oleh azab Allah yang selalu mereka perolok-olokkan itu.\"(Al-Mu’min:83)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 58: Yakni Islam. Yaitu Al Qur’an. Ada pula yang mengartikan karunia dalam ayat tersebut dengan Al Qur’an, sedangkan rahmat maksudnya adalah agama dan keimanan, serta beribadah kepada Allah, mencintai-Nya dan mengenali-Nya. Berupa perhiasan dunia dan kesenangannya. Berdasarkan ayat ini, maka nikmat Islam dan Al Qur’an merupakan nikmat paling besar. Allah Subhaanahu wa Ta'aala memerintahkan bergembira dengan karunia dan rahmat-Nya karena yang demikian dapat melegakan jiwa, menyemangatkannya dan membantu untuk bersyukur, serta membuat senang dengan ilmu dan keimanan yang mendorong seseorang untuk terus menambahnya. Hal ini adalah gembira yang terpuji, berbeda dengan bergembira dengan syahwat dunia dan kesenangannya atau bergembira dengan kebatilan, maka yang demikian merupakan gembira yang tercela."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 58",
    "description": "Katakanlah wahai nabi Muhammad kepada manusia dengan karunia Allah berupa agama islam dan rahmat-Nya, yakni Al-Qur'an, hendaklah dengan itu mereka bergembira. Karunia dan rahmat Allah itu lebih baik daripada apa yang mereka kumpulkan berupa harta dan kemewahan duniawi. Ayat ini menjelaskan kecaman terhadap orang musyrik yang ingkar kepada karunia Allah. Katakanlah wahai nabi Muhammad kepada orang-orang musyrik, terangkanlah kepadaku tentang rezeki, berupa hewan, tumbuhan, tambang, dan aneka hasil bumi yang diturunkan, yakni diberikan, Allah kepadamu, lalu kamu jadikan sebagiannya haram atas kamu dan ada yang kamu haramkan khusus untuk para perempuan (lihat: surah al-an'a'm/6: 139), dan sebagiannya kamu hukumi halal tanpa penjelasan dari Allah sebagaimana tertera di dalam Al-Qur'an. Katakanlah, wahai nabi Muhammad apakah Allah telah memberikan izin kepadamu tentang ini ataukah kamu mengada-ada atas nama Allah' Allah sudah menegaskan apa-apa yang halal dan yang haram dan manusia tinggal menjalankan ketentuan tersebut."
  }
]