[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada orang-orang yang mengingkari wahyu, ”beritahukanlah kepadaku tentang karunia rizki yang Allah turunkan bagi kalian berupa hewan, tetumbuhan, dan kebaikan-kebaikan lainnya, lalu kalian menghalalkan sebagiannya bagi diri kalian dan mengharamkan sebagain yang lain,” katakanlah kepada mereka, ”apakah Allah mengizinkan kalian untuk melakukan itu, ataukah kalian mengatakan ucapan kebatilan atas nama Allah dan berdusta(kepadaNya)?” dan sesungguhnya mereka benar-benar melontarkan ucapan kebatilan atas nama Allah dan berdusta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Katakanlah -wahai Rasul- kepada orang-orang musyrik, \"Ceritakanlah kepadaku tentang rezeki yang Allah berikan kepada kalian kemudian kalian memperlakukannya menurut hawa nafsu kalian. Maka kalian mengharamkan sebagiannya dan menghalalkan sebagian lainnya.\" Katakanlah kepada mereka, \"Apakah Allah mengizinkan kalian untuk menghalalkan apa yang kalian halalkan dan mengharamkan apa yang kalian haramkan, ataukah kalian membuat kebohongan atas nama Allah?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Allah memerintahkan rasul-Nya untuk mengolok orang-orang musyrik atas pelanggaran mereka terhadap hukum-hukum: “Katakanlah kepadaku, rezeki dan hewan ternak yang Allah ciptakan, kemudian kalian jadikan sebagiannya haram padahal ia halal, dan sebagiannya kalian jadikan halal padahal ia haram; hal ini demi mengikuti hawa nafsu kalian. Apakah kalian telah diizinkan untuk menghalalkan dan mengharamkan sesuatu? Ataukah itu hanya kedustaan kalian terhadap Allah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. فَجَعَلْتُم مِّنْهُ حَرَامًا وَحَلٰلًا (lalu kamu jadikan sebagiannya haram dan (sebagiannya) halal) Yakni kemudian kalian menjadikan sebagiannya haram dan sebagian lainnya halal, yaitu sebagaimana yang mereka lakuakan terhadap hewan-hewan ternak yang telah disebutkan (lihat surat al-An’am: 119 dan seterusnya) قُلْ ءَآللهُ أَذِنَ لَكُمْ ۖ أَمْ عَلَى اللهِ تَفْتَرُونَ (Katakanlah: “Apakah Allah telah memberikan izin kepadamu (tentang ini) atau kamu mengada-adakan saja terhadap Allah?”) Jika itu hanya karena hawa nafsu maka hal itu adalah sesuatu yang tertolak sesuai pemahaman orang-orang yang berakal, dan jika itu karena kepercayaan mereka bahwa itu merupakan hukum Allah bagi atas kalian dan atas apa yang direzekikan kepada kalian maka hal itu tidak dapat kalian ketehui kecuali dari seorang rasul, sedangkan kalian tidak memiliki bukti bahwa salah seorang rasul mengharamkan apa yang kalian haramkan, oleh sebab itu dalam hal ini kalian hanyalah orang-orang yang berdusta terhadap Allah. Dan dalam ayat yang mulia ini terdapat tamparan bagi pendengaran orang-orang yang memberanikan diri untuk berfatwa dalam urusan syariat padahal belum pantas untuk itu dengan menghalalkan, mengharamkan, membolehkan, dan melarang. Dan dalam ayat ini terdapat pula peringatan bagi mereka agar memahami hujjah-hujjah Allah dalam kitab dan sunnah serta agar tidak mencukupkan diri dengan pengetahuan tentang pendapat seseorang yang mereka ikuti dalam beragama, apabila mereka menjalankan sesuatu dalam kitab dan sunnah maka itu juga mereka jalankan, dan sesuatu yang belum sampai kepada mereka atau telah sampai namun mereka tidak memahaminya dengan baik, atau salah dalam pemahamannya maka mereka menjadikan hukum hal tersebut telah terhapus dan diangkat dari hamba-hamba-Nya, padahal orang yang mereka ikuti merupakan orang yang berniat ibadah dalam menjalankannya, dan dia telah berijtihad dan menjalankan kewajibannya sehingga mendapatkan dua pahala jika benar dalam ijtihadnya atau satu pahala jika salah, maka tidak ada seorang ulama yang mampu memahami permasalahan tersebut mengikutinya tanpa melihat dalil yang dipakainya dan memahami hujjahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59 Katakanlah wahai Nabi kepada orang musyrik: “Jelaskanlah kepadaku tentang rezeki yang diturunkan Allah kepadamu, lalu kamu jadikan sebagiannya haram dan sisanya halal” (Sebagaimana disebutkan dalam surat Al an’am ayat 138, 139 dan 144)”. Katakanlah: “Apakah Allah telah memberikan izin kepadamu tentang ini atau kamu mengada-adakan saja terhadap Allah?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah kalian melihat rezeki yang diturunkan Allah kepada kalian, lalu kalian menjadikan sebagiannya haram dan sebagiannya halal.” Katakanlah,“Apakah Allah telah memberikan izin kepada kalian ataukah kalian mengada-ada atas nama Allah”} membuat-buat kebohongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Allah berfirman mengingkari orang-orang musyrikin yang melakukan bid’ah dengan mengharamkan apa yang dihalalkan Allah dan menghalalkan apa yang diharamkan Allah, “Katakanlah, ‘Terangkanlah kepadaku tentang rizki yang diturunkan Allah kepadamu’.” Yakni bermacam-macam hewan yang dihalalkan yang Allah jadikan sebagai rizki dan karunia bagi mereka, katakanlah kepada mereka dengan mencela pendapat yang rusak tersebut, “Apakah Allah telah memberikan izin kepadamu (tentang ini) atau kamu mengada-adakan saja terhadap Allah? Sebagaimana diketahui bahwa Allah tidak mengizinkan mereka, maka diketahuilah bahwa mereka telah melakukan kebohongan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 59: Yang mereka jadikan haram misalnya bahiirah dan saa’ibah (lihat Al Maa’idah: 103), sedangkan yang mereka halalkan misalnya bangkai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 59",
    "description": "Ayat ini menjelaskan kecaman terhadap orang musyrik yang ingkar kepada karunia Allah. Katakanlah wahai nabi Muhammad kepada orang-orang musyrik, terangkanlah kepadaku tentang rezeki, berupa hewan, tumbuhan, tambang, dan aneka hasil bumi yang diturunkan, yakni diberikan, Allah kepadamu, lalu kamu jadikan sebagiannya haram atas kamu dan ada yang kamu haramkan khusus untuk para perempuan (lihat: surah al-an'a'm/6: 139), dan sebagiannya kamu hukumi halal tanpa penjelasan dari Allah sebagaimana tertera di dalam Al-Qur'an. Katakanlah, wahai nabi Muhammad apakah Allah telah memberikan izin kepadamu tentang ini ataukah kamu mengada-ada atas nama Allah' Allah sudah menegaskan apa-apa yang halal dan yang haram dan manusia tinggal menjalankan ketentuan tersebut. Ayat ini masih berisi kecaman terhadap orang-orang musyrik. Dan apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah, yakni orang-orang kafir, tentang perlakuan Allah kepada mereka pada hari kiamat' apakah mereka menduga Allah akan mengampuni dosa dan tidak menyiksa mereka' sesungguhnya Allah benar-benar mempunyai karunia yang dilimpahkan kepada manusia, antara lain memberi kesempatan bertobat kepada pelaku maksiat, tetapi kebanyakan mereka tidak bersyukur, mengingkari kerasulan nabi Muhammad, banyak berbuat maksiat, dan enggan bertobat sampai akhir hayat."
  }
]