[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pada pergantian malam dan siang dan segala yang Allah ciptakan di langit dan dibumi, berupa ciptaan-ciptaan yang luar biasa serta apa yang ada pada ciptaan itu berupa pesona dan kerapian benar-benar merupakan bukti-bukti petunjuk dan hujjah-hujjah yang jelas bagi orang yang takut akan hukuman Allah, kemurkaan dan siksaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya pada pergantian malam dan siang, kondisi gelap dan terang yang menyertainya, pendek dan panjangnya, dan segenap makhluk yang ada di langit dan bumi benar-benar terdapat tanda-tanda yang menunjukkan kekuasaan Allah bagi orang-orang yang takut kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Sungguh dalam perbedaan panjang pendek waktu siang dan malam, dan ketepatan pergantiannya, serta dalam apa yang Allah ciptakan dalam tujuh langit dan tujuh bumi, adalah tanda-tanda yang menunjukkan kebesaran kuasa Allah dan keesaan-Nya bagi orang-orang yang bertakwa kepada Allah dengan mentaati segala perintah dan menjauhi segala larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِنَّ فِى اخْتِلٰفِ الَّيْلِ وَالنَّهَارِ (Sesungguhnya pada pertukaran malam dan siang) Tafsir dari kalimat ini telah disebutkan pada surat al-Baqarah: 164. لَاٰيٰتٍ لِّقَوْمٍ يَتَّقُونَ (benar-benar terdapat tanda-tanda (kekuasaan-Nya) bagi orang-orang yang bertakwa) Yang jeli dalam melihat dan mentafakkuri ciptaan-ciptaan Allah agar tidak jatuh dalam pemahaman yang tidak sesuai dengan yang dikehendaki oleh Allah, dan melihat kesudahan mereka di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya dalam pergantian malam dan siang yang panjang dan pendek, perputaran keduanya yang terjadi secara rinci, serta ciptaan Allah di langit dan bumi itu ada tanda-tanda yang menunjukan pada eksistensi, kekuasaan dan keesaan Allah bagi kaum yang takut melanggar sunah-sunah Allah yang bersifat kauniyyah maupun syar’iyyah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada pergantian} pergantian {malam dan siang dan pada apa yang diciptakan Allah di langit dan di bumi terdapat tanda-tanda bagi kaum yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. ketika Allah menetapkan rububiyah dan uluhiyahNya,maka Dia menjelaskan dalil-dalil aqli dan ufuki yang menunjukkan hal itu, dan menunjukkan kesempurnaanNya dalam nama-nama dan sifat-sifatNya, berupa matahari, rembulan, langit dan bumi serta segala sesuatu yang Dia ciptakan padanya dalam bentuk berbagai macam makhluk, lalu Dia menyatakan bahwa itu adalah tanda-tanda kebesaranNya “bagi kaum yang mengetahui”, dan “bagi kaum yang bertakwa.” Sesungguhnya ilmu membimbing kepada pengetahuan tentang indikasi padanya dan bagaimana mengambil kesimpulan dari indikasi tersebut dengan jalan yang paling mudah. Takwa memunculkan keinginan di dalam hati kepada kebaikan dan rasa takut kepada keburukan yang muncul dari dalil-dalil dan bukti-bukti, serta dari ilmu dan keyakinan. Hasil dari itu adalah bahwa hanya dengan pencipta makhluk-makhluk dengan kriteria seperti ini saja telah menunjukkan kesempurnaan kodrat Allah, ilmuNya, kehidupanNya, dan kemandirianNya, sedangkan sesuatu yang dikandungnya berupa kebaikan, ketepatan, kecanggihan dan kerapian adalah menunjukkan kesempurnaan hikmah Alllah, kebaikan penciptaanNya dan keluasan ilmuNya, sedangkan sesuatu yang dikandung di dalamnya berupa berbagai macam manfaat dan kemaslahatan- seperti menjadikan matahari bersinar, bulan bercahaya yang dengannya terwujud kegunaan mendasar seperti yang telah terwujud, itu menunjukkan rahmat Allah, perhatianNya kepada hamba-hambaNya, keluasan kebaikanNya. Sedangkan sesuatu yang dikandung di meremehkan apadalamnya berupa kekhususan-kekhususan yang menunjukkan bahwa hanya Dia yang disembah yang dicintaiyang dipuji, pemilik keagungan, kemuliaan dan sifat-sifat agung yang mana tidak sepatutnya ada cinta dan takut kecuali kepadaNya. Doa murni tidak diberikan secara tulus kecuali kepadaNya bukan kepada makhluk yang dipelihara yang memerlukan Allah dalam seluruh urusannya. Ayat-ayat ini mengandung dorongan dan ajakan untuk merenungkan makhluk-makhluk Allah, melihatnya untuk mengambil pelajaran, karena dengan itu bashirah bisa meluas, iman dan akal bertambah dan daya pikir menguat. Tidak melakukan itu berarti meremehkan apa yang diperintahkan oleh Allah, menutup pintu bertambahnya iman, menyebabkan kebekuan akal dan pikiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 6: Dengan datang kemudian pergi, bertambah dan berkurang. Seperti malaikat, matahari, bulan, bintang-bintang, dsb. Seperti manusia dan hewan, gunung, laut, sungai, pepohonan, dsb. Disebutkan secara khusus mereka, karena merekalah yang dapat mengambil manfaat daripadanya. Dalam ayat ini terdapat anjuran dan dorongan untuk memikirkan makhluk-makhluk Allah dan melihat dengan mata dengan maksud mengambil pelajaran. Dengan inilah bashirah (mata hati) terbuka, iman dan akal bertambah, dan bakatnya menguat, sebaliknya jika hal tersebut (berpikir) diremehkan, maka ia sama saja meremehkan perintah Allah, menutup bertambahnya iman dan membuat kaku pikiran serta bakat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 6",
    "description": "Sesungguhnya pada pergantian malam dan siang dan pada benda apa saja yang diciptakan Allah di langit dan di bumi, yakni benda cair maupun padat, semilirnya angin maupun dahsyatnya petir dan halilintar, pasti terdapat tanda-tanda kebesaran-Nya bagi orang-orang yang bertakwa, yakni orang yang berha-ti-hati agar tidak terjerumus ke dalam kesesatan supaya terhindar dari siksa Allah akibat kesesatan tersebut. Meskipun bukti kebesaran dan kekuasaan Allah telah terbentang luas di alam raya sebagaimana dijelaskan dalam ayat-ayat sebelumnya, namun masih ada sebagian manusia yang tidak percaya dan mengingkari adanya Allah. Mereka merasa puas dengan kehidupan dunia. Allah menegaskan bahwa sesungguhnya orang-orang yang tidak mengharapkan pertemuan dengan kami di hari akhirat nanti dengan adanya pahala bagi yang beramal saleh dan siksa bagi yang durhaka, dan mereka merasa puas dengan kehidupan dunia serta merasa tenteram dengan kehidupan itu, sehingga tidak pernah berbuat untuk kehidupan akhirat, padahal kehidupan akhirat lebih baik dan lebih kekal, dan orang-orang yang melalaikan ayat-ayat kami, yakni tidak menghiraukan petunjuk yang ada di dalam Al-Qur'an dan tidak sedikit pun mengambil pelajaran dari tanda-tanda kekuasaan dan kebesaran Allah di alam semesta."
  }
]