[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apakah prasangka orang-orang yang mengada-adakan kedustaan atas nama Allah pada hari perhitungan amal,dimana mereka menambahkan kepadanya pengharaman apa yang tidak Allah haramkan dari macam-macam rizki dan bahan makanan sehari-hari, tentang apa yang akan diperbuat Allah terhadap mereka pada hari kiamat akibat kedustaan dan kebohongan mereka terhadap Allah? apakah mereka mengira bahwa Dia sesungguhnya akan meberikan toleransi dan mengampuni mereka? sesungguhnya Allah memiliki karunia atas makhlukNya; dengan tidak menyegerakan hukuman bagi orang yang mengadakan kedustaan atas namaNya di dunia dan menangguhkan waktu baginya. Akan tetapi,kebanyakan orang tidak bersyukur kepada Allah atas kemurahanNya pada mereka dengan memberikan semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Apa gerangan yang dibayangkan oleh orang-orang yang membuat kebohongan atas nama Allah tentang apa yang akan menimpa mereka di hari Kiamat? Apakah mereka menyangka bahwa Allah akan mengampuni mereka? Mana mungkin?! Sesungguhnya Allah benar-benar bermurah hati kepada manusia dengan memberi mereka tenggang waktu dan tidak menyegerakan hukuman mereka. Akan tetapi kebanyakan dari mereka mengingkari nikmat yang Allah berikan kepada mereka dan tidak mau mensyukurinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Apa yang disangka orang-orang yang membuat kedustaan terhadap Allah itu pada hari kiamat Allah akan berbuat apa terhadap mereka? Apakah mereka menyangka tidak akan disiksa? Allah memberi karunia kepada makhluk-Nya dengan tidak segera mengazab mereka, mengutus para rasul kepada mereka, dan memberi mereka rezeki dan kenikmatan; akan tetapi mayoritas mereka tidak mensyukuri karunia tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَمَا ظَنُّ الَّذِينَ يَفْتَرُونَ عَلَى اللهِ الْكَذِبَ يَوْمَ الْقِيٰمَةِ (Apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah pada hari kiamat?) Yakni menurut sangkaan mereka, apa yang Allah akan lakukan kepada mereka di hari kiamat?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60 Apa sebenarnya yang diduga oleh orang-orang yang mengada-adakan kebohongan terhadap Allah pada hari kiamat? Sesungguhnya Allah benar-benar mempunyai karunia yang dilimpahkan atas manusia, tetapi kebanyakan mereka tidak mensyukurinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah pada hari Kiamat. Sesungguhnya Allah benar-benar mempunyai karunia kepada manusia, tetapi kebanyakan mereka tidak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “Apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah pada Hari Kiamat?” azab dan siksa apa yang akan Allah timpakan kepada mereka. Allah berfirman, Dan pada hari kiamat kamu akan melihat orang-orang yang berbuat dusta terhadap Allah, mukanya menjadi hitam. Bukankah dalam neraka Jahannam itu ada tempat bagi orang-orang yang menyombongkan diri?\" (Az-Zumar:60). “Sesungguhnya Allah benar-benar mempunyai karunia (yang dilimpahkan) atas manusia.” Dia adalah Pemilik kebaikan yang besar dan karunia yang luas, akan tetapi kebanyakan manusia tidak bersyukur, bisa jadi mereka sama sekali tidak mensyukurinya, bisa pula ia digunakan untuk bermaksiat kepadaNya, bisa dengan mengharamkannya dan menolak sesuatu yang Allah limpahkan kepada hamba-hambaNya, hanya sedikit dari mereka yang bersukur yang mengakui nikmat dan memuji Allah dan menggunakannya dalam ketaatan kepadaNya. Ayat ini dijadikan dalil bahwa pada dasarnya seluruh makanan itu adalah halal kecuali yang ada pengharamannya dari syara’. Karena itu Allah mengingkari orang-orang yang mengharamkan rizkiNya yang diturunkan untuk hamba-hambaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 60: Apakah mereka menduga, bahwa Allah tidak akan menghukum mereka? Dengan memberi tangguh mereka, memberi nikmat dan memberikan rezeki. Di antara mereka ada yang menggunakan rezeki yang diberikan Allah untuk berbuat maksiat, ada pula yang tidak mengakuinya, ada pula yang mengharamkannya. Sedikit sekali mereka yang bersyukur dengan mengakui nikmat itu, memuji Alah terhadapnya dan menggunakannya untuk ketaatan. Berdasarkan ayat ini, bahwa hukum asal semua makanan adalah halal sampai ada dalil dari syara’ yang mengharamkannya, karena Alah mengingkari orang yang mengharamkan rezeki yang dilimpahkan-Nya kepada hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 60",
    "description": "Ayat ini masih berisi kecaman terhadap orang-orang musyrik. Dan apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah, yakni orang-orang kafir, tentang perlakuan Allah kepada mereka pada hari kiamat' apakah mereka menduga Allah akan mengampuni dosa dan tidak menyiksa mereka' sesungguhnya Allah benar-benar mempunyai karunia yang dilimpahkan kepada manusia, antara lain memberi kesempatan bertobat kepada pelaku maksiat, tetapi kebanyakan mereka tidak bersyukur, mengingkari kerasulan nabi Muhammad, banyak berbuat maksiat, dan enggan bertobat sampai akhir hayat. Setelah dijelaskan pada ayat sebelumnya bahwa kebanyakan manusia tidak pandai bersyukur, lalu dalam ayat ini ditegaskan bahwa seluruh perbuatan manusia selalu berada dalam pengawasan Allah. Dan tidaklah engkau Muhammad berada dalam suatu urusan apapun, baik duniawi maupun ukhrawi, dan kamu tidak membaca suatu ayat Al-Qur'an, baik yang panjang maupun yang pendek serta tidak pula kamu melakukan suatu pekerjaan apapun, baik ketaatan maupun kemaksiatan, melainkan kami menjadi saksi atasmu ketika kamu melakukannya. Tidak terlewatkan sedikit pun dari pengetahuan dan catatan tuhanmu melalui para malaikat-Nya, biarpun nilai perbuatan itu hanya sebesar zarrah, baik di bumi ataupun di langit. Tidak ada sesuatu yang lebih kecil dan yang lebih besar daripada itu, melainkan semua tercatat dalam kitab yang nyata (lauh mahfudh)."
  }
]