[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah kamu (wahai rasul), berada dalam suatu urusan dari urusan-urusanmu,dan tidaklah kamu membaca ayat-ayat dari kitabullah, dan tidaklah sesorang dari umat ini mengerjakan suatu perbuatan, yang baik maupun yang buruk, kecuali kami akan menjadi saksi baginya yang mengawasinya, ketika kalian memulainya dan mengerjakannya, kami akan memelihara itu bagi kalian dan memberikan balasan bagi kalian dengannya. Dan tidak ada sesuatu yang terlewat dari ilmu tuhanmu (wahai rasul) meski sebesar semut kecil yang ada di muka bumi maupun yang ada di langit, dan tidak pula sesuatu yang paling kecil maupun yang paling besar,kecuali sudah tertulis di dalam kitab di sisi Allah,jelas lagi terang. Yang telah diliputi oleh IlmuNya dan telah berjalan oleh penaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Setiap perkara yang engkau urus -wahai Rasul- dan setiap ayat Al-Qur`ān yang engkau baca, dan setiap amal perbuatan yang kalian kerjakan -wahai orang-orang mukmin- pasti Kami melihat, mengetahui dan mendengarkan kalian ketika kalian sedang menghadapi dan melakukannya. Tidak ada sesuatupun yang luput dari pengetahuan Tuhanmu biarpun seberat żarrah (atom) di langit atau di bumi. Tidak juga yang lebih kecil dari itu atau lebih besar melainkan semuanya tercatat di dalam kitab yang jelas, yang memuat semua hal, baik kecil maupun besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Tidaklah segala yang terjadi pada urusanmu dan sedikit atau banyak ayat-ayat al-Qur’an yang kamu baca, hai Muhammad; dan kebaikan atau keburukan yang kalian kerjakan hai manusia; melainkan Kami menyaksikan amalan dan perkara yang kalian hadapi dengan perkataan dan perbuatan. Tidak ada yang tersembunyi dari Allah sekecil apapun, baik itu di langit maupun di bumi. Dan tidak ada yang lebih kecil atau lebih besar melainkan telah tertulis jelas di sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَمَا تَكُونُ فِى شَأْنٍ (Kamu tidak berada dalam suatu keadaan) Yakni suatu keadaan yang menimpamu. وَمَا تَتْلُوا۟ مِنْهُ مِن قُرْءَانٍ (dan tidak membaca suatu ayat dari Al Quran) Yakni dan al-Qur’an yang kamu baca dalam keadaan itu demi keadaan yang dibicarakan dalam al-Qur’an sehingga diketahui hukum hal tersebut. وَلَا تَعْمَلُونَ مِنْ عَمَلٍ (dan kamu tidak mengerjakan suatu pekerjaan) Kalimat ini ditujukan bagi Rasulullah dan umatnya. إِلَّا كُنَّا عَلَيْكُمْ شُهُودًا (melainkan Kami menjadi saksi atasmu) Yakni Kami melihat dan mendengarmu. إِذْ تُفِيضُونَ فِيهِ ۚ( di waktu kamu melakukannya) Ketika kalian beranjak untuk mengatakan atau mengerjakannya. وَمَا يَعْزُبُ عَن رَّبِّكَ مِن مِّثْقَالِ ذَرَّةٍ(Tidak luput dari pengetahuan Tuhanmu biarpun sebesar zarrah) Yakni dan tidaklah tersembunyi dari Allah meski itu sebesar zarrah, yakni sebesar semut merah. وَلَآ أَصْغَرَ مِن ذٰلِكَ وَلَآ أَكْبَرَ (Tidak ada yang lebih kecil dan tidak (pula) yang lebih besar dari itu) Yakni dan tidak ada sesuatu yang lebih kecil atau lebih besar dari semut merah kecuali hal itu di sisi Allah. فِى كِتٰبٍ مُّبِينٍ((semua tercatat) dalam kitab yang nyata (Lauh Mahfuzh)) Lalu bagaimana hal itu akan tersembunyi dari-Nya. Dan tujuan dari ayat ini adalah sebagai bantahan bahwa Allah tidak mengetahui sesuatu secara detail."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Beberapa waktu dikabarkan bahwa salah satu pesawat luar angkasa perancis seketika hilang dalam perjalanan luar angkasa mereka, kabar ini seketika tersebar di media sosial, segala upaya dilakukan dalam rangka pencarian pesawat ini, kemanakah satelit-satrlit yang mereka buat dengan rancangannya yang begitu canggih ? dan kemanakah radar-radar pemancar yang mereka bangun dengan segala kemegahan yang terpasang di dalamnya? sesungguhnya mereka hanyalah manusia biasa sekalipun pencapaian yang telah mereka raih begitu tinggi dan sangat meyakinkan namun Allah tidak akan pernah luput bahwa mereka adalah makhluk yang hina dan kelemahan begitu besar dalam diri mereka, dan Allah telah memperlihatkan betapa ayat-ayat Nya lebih besar dan lebih agung dari apa yang telah mereka upayakan : { وَمَا يَعْزُبُ عَنْ رَبِّكَ مِنْ مِثْقَالِ ذَرَّةٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَلَا أَصْغَرَ مِنْ ذَٰلِكَ وَلَا أَكْبَرَ إِلَّا فِي كِتَابٍ مُبِينٍ } \"Tidak luput dari pengetahuan Tuhanmu biarpun sebesar zarrah (atom) di bumi ataupun di langit. Tidak ada yang lebih kecil dan tidak (pula) yang lebih besar dari itu, melainkan (semua tercatat) dalam kitab yang nyata (Lauh Mahfuzh)\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61 Kamu tidak berada dalam keadaan ibadah atau dakwah dan juga tidak membaca ayat Al Quran wahai Muhammad. Kalian wahai manusia tidak mengerjakan suatu pekerjaan baik atau buruk, melainkan Kami menjadi saksi atasmu di waktu kamu melakukannya. Tidak luput dari pengetahuan Tuhanmu biarpun sebesar biji zarrah/atom di bumi ataupun di langit. Tidak ada yang lebih kecil dan tidak pula yang lebih besar dari itu, melainkan semua tercatat dalam kitab yang nyata (Lauh Mahfuzh) yaitu kitab yang memberi penjelasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak berada dalam suatu urusan} salah satu perkara {tidak membaca suatu ayat} untuk perkara yang terjadi {dari Al-Qur’an dan tidak pula mengerjakan suatu pekerjaan, kecuali Kami menjadi saksi} pengawas {atas kalian ketika kalian melakukannya} ketika kalian kembali melakukannya {Tidak ada yang luput} luput {dari Tuhan kalian sedikit pun walaupun seberat zarah} seberat semut kecil {baik di bumi maupun di langit. Tidak ada sesuatu yang lebih kecil dan yang lebih besar daripada itu, kecuali dalam kitab yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Allah mengabarkan tentang luasnya pengetahuan dan penglihatanNya terhadap segala keadaan manusia dalam gerakan dan diam mereka. Termasuk dalam pembahasan ini adalah dakwah pada muraqabahnya Allah secara terus-menerus, “Kamu tidak berada dalam suatu keadaan.” Yakni, keadaan diniyah dan duniawiyah “dan tidak membaca suatu ayat dari al-Quran.” Yakni apa yang kamu baca dari al-Quran yang Allah wahyukan kepadamu, “dan kamu tidak mengerjakan suatu pekerjaan”, besar atau kecil “melainkan Kami menjadi saksi atasmu di waktu kamu melakukannya.” Yakni di waktu kamu memulai mengerjakannya dan dalam keadaan terus melakukannya, hendaknya kamu merasa Allah mengawasimu dalam perbuatanmu, maka lakukanlah dengan ikhlas dan bersungguh-sungguh. Jauhilah sesuatu yang dibenci Allah karena Dia melihat dan mengawasi lahir dan batinmu. “Dan tidak luput dari pengetahuan Rabbmu.” Yakni tidak ada yang samar dari ilmu, pendengaran, penglihatan dan pengawasan Allah, “biarpun sebesar dzarrah (atom) di bumi ataupun di langit. Tidak ada yang lebih kecil dan tidak (pula) yang nyata (Lauh Mahfuzh).” IlmuNya telah mencakupnya dan penaNya telah mencatatnya. Kedua tingkatan ini adalah termasuk tingkatan qadha dan qadar yang sering Allah sandingkan yaitu ilmu yang meliputi segala sesuatu dan kitabah (tulisan) yang meliputi segala peristiwa, seperti FirmanNya \" Apakah kamu tidak mengetahui bahwa sesungguhnya Allah mengetahui apa saja yang ada di langit dan di bumi?; bahwasanya yang demikian itu terdapat dalam sebuah kitab (Lauh Mahfuzh). Sesungguhnya yang demikian itu amat mudah bagi Allah.\" (Al-Hajj:70)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 61: Dalam ayat ini, Alah Subhaanahu wa Ta'aala memberitahukan tentang perhatian dan pengawasan-Nya terhadap semua keadaan hamba baik geraknya mereka maupun diamnya. Dalam ayat ini terkandung ajakan untuk selalu merasakan pengawasan-Nya. Baik terkait dengan agama maupun dunia. Besar atau kecil. Oleh karena itu, hendaklah kamu selalu merasaka pengawasan Allah dalam semua amalmu, kerjakanlah dengan ikhlas dan sungguh-sungguh serta jauhilah perkara yang dibenci Allah, karena Dia mengetahui keadaanmu zahir (lahir) maupun batin. Oleh karena itu, segala sesuatu telah diketahui oleh Allah dan telah dicatat-Nya dalam Lauh Mahfuzh, di samping telah dikehendaki dan diciptakan-Nya. Namun demikian, apa yang dikehendaki-Nya terjadi tidak mesti perkara tersebut dicintai Allah, yang dicintai Allah adalah apabila sejalan dengan syari’at-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 61",
    "description": "Setelah dijelaskan pada ayat sebelumnya bahwa kebanyakan manusia tidak pandai bersyukur, lalu dalam ayat ini ditegaskan bahwa seluruh perbuatan manusia selalu berada dalam pengawasan Allah. Dan tidaklah engkau Muhammad berada dalam suatu urusan apapun, baik duniawi maupun ukhrawi, dan kamu tidak membaca suatu ayat Al-Qur'an, baik yang panjang maupun yang pendek serta tidak pula kamu melakukan suatu pekerjaan apapun, baik ketaatan maupun kemaksiatan, melainkan kami menjadi saksi atasmu ketika kamu melakukannya. Tidak terlewatkan sedikit pun dari pengetahuan dan catatan tuhanmu melalui para malaikat-Nya, biarpun nilai perbuatan itu hanya sebesar zarrah, baik di bumi ataupun di langit. Tidak ada sesuatu yang lebih kecil dan yang lebih besar daripada itu, melainkan semua tercatat dalam kitab yang nyata (lauh mahfudh). Pada ayat sebelumnya dijelaskan bahwa apapun yang dikerjakan oleh manusia baik ketaatan maupun kemaksiatan, maka tidak sedikit pun terlewatkan dari pengetahuan tuhan, lalu pada ayat ini dijelaskan tentang kesudahan orang-orang yang selalu dalam ketaatan. Ingatlah, sesungguhnya wali-wali Allah itu, yakni kekasih Allah tidak ada rasa takut, yakni kekhawatiran pada mereka terhadap apa yang akan mereka hadapi di akhirat dan mer."
  }
]