[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah, sesungguhnya wali-wali Allah tidak ada ketakutan pada mereka di akhirat dari siksaan Allah dan mereka pun tidak bersedih atas apa yang telah luput dari mereka dari kesenangan-kesenangan dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Ingatlah, sesungguhnya wali-wali Allah itu tidak ada kekhawatiran pada mereka ketika menghadapi hiruk-pikuk Hari Kiamat, dan mereka pun tidak bersedih hati atas kekayaan duniawi yang luput dari mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Allah menjelaskan bahwa orang-orang yang menolong Allah tidak ada kekhuatiran terhadap azab-Nya di akhirat, dan mereka tidak bersedih atas kenikmatan dunia yang terlewatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. أَلَآ إِنَّ أَوْلِيَآءَ اللهِ (Ingatlah, sesungguhnya wali-wali Allah itu) Wali-wali Allah adalah orang-orang mukmin pilihan, mereka mendekatkan diri kepada Allah dengan ketaatan kepada-Nya dan menjauhi kemaksiatan. لَا خَوْفٌ عَلَيْهِمْ (tidak ada kekhawatiran terhadap mereka) Yakni mereka tidak khawatir terhadap hari kebangkitan dan hari dikumpulkan di hari kiamat, sebab mereka telah dijamin oleh Allah bahwa mereka tidak akan tertimpa huru-hara di hari itu. وَلَا هُمْ يَحْزَنُونَ(dan tidak (pula) mereka bersedih hati) Yakni mereka tidak bersedih atas kehidupan dunia yang mereka tinggalkan seperti kesedihan orang-orang yang mencintai dunia. Wali-wali Allah tersebut adalah orang-orang beriman yang senantiasa bertakwa kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Barangsiapa yang mengumpulkan 9 perkara dalam dirinya niscaya Allah akan menjamin keamanan untuknya pada hari kiamat, dan tiada rasa takut dan kesedihan padanya, yaitu : Siapa yang berserah diri kepada Allah, dan beriman kepada-Nya, dan senantiasa berbuat kebajikan karena-Nya, dan senantiasa mengikuti petunjuk-Nya, dan beramal sholeh untuk menggapai ridho-Nya, dan senantiasa membuat perbaikan, dan mendirikan shalat kepada Allah, dan menafkahkan hartanya di jalan Allah baik dalam keadaan sembunyi maupun secara terang-terangan siang dan malam tanpa menyebut-nyebutnya dan mencaci orang lain karena infaknya, sungguh mereka inilah yang termasuk wali Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62 Ingatlah bahwa sesungguhnya wali-wali Allah, orang-orang yang dekat dengan-Nya, mereka itu adalah orang-orang mukmin tulus yang senantiasa taat dan menjauhi kemaksiatan. Mereka selalu diliputi pertolongan, karamah dan taufik, sehingga tidak ada kekhawatiran bagi mereka dan tidak pula bersedih hati atas dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah sesungguhnya para wali Allah itu tidak ada rasa takut yang menimpa mereka dan mereka pun tidak bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Allah mengabarkan tentang wali-waliNya dan orang-orang yang dicintaiNya dengan menyebutkan perbuatan, sifat dan pahala mereka, “Ingatlah, sesungguhnya wali-wali Allah itu, tidak ada kekhawatiran terhadap mereka”, dalam hal ketakutan dan kekhawatiran yang ada di depan mereka yang mereka hadapi, “dan tidak (pula) mereka bersedih hati”, atas apa yang telah berlalu karena masa lalu mereka hanyalah amal kebaikan. Jika mereka tidak takut dan tidak bersedih, maka yang ada untuk mereka adalah rasa aman, kebahagiaan yang melimpah yang hanya diketahui oleh Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 62: Dalam hal yang akan mereka hadapi di masa mendatang. Di akhirat, karena amal mereka yang dahulu adalah baik. Oleh karena mereka tidak takut dan tidak bersedih hati, maka mereka mendapakan keamanan dan kebahagiaan serta kebaikan yang banyak yang hanya diketahui oleh Allah Ta’ala.."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 62",
    "description": "Pada ayat sebelumnya dijelaskan bahwa apapun yang dikerjakan oleh manusia baik ketaatan maupun kemaksiatan, maka tidak sedikit pun terlewatkan dari pengetahuan tuhan, lalu pada ayat ini dijelaskan tentang kesudahan orang-orang yang selalu dalam ketaatan. Ingatlah, sesungguhnya wali-wali Allah itu, yakni kekasih Allah tidak ada rasa takut, yakni kekhawatiran pada mereka terhadap apa yang akan mereka hadapi di akhirat dan merwali-wali Allah yang disebut pada ayat sebelumnya, yaitu orangorang yang beriman tanpa ada sedikit pun keraguan dan senantiasa bertakwa, yakni selalu mengerjakan amal saleh sehingga mereka terhindar dari azab Allah."
  }
]