[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sifat-sifat wali-wali Allah itu bahwa mereka adalah orang-orang yang beriman kepada Allah dan mengikuti rasulNya, dan risalah yang dibawanya dari sisi Allah, dan mereka selalu bertakwa kepada Allah dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Para wali itu ialah orang-orang yang beriman kepada Allah, mengikuti Rasul-Nya dan bertakwa kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Mereka adalah orang-orang yang beriman kepada Allah, mengakui keesaan-Nya, beriman kepada rasul-Nya, dan senantiasa bertakwa kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. الَّذِينَ ءَامَنُوا۟ وَكَانُوا۟ يَتَّقُونَ ((Yaitu) orang-orang yang beriman dan mereka selalu bertakwa) Mereka tidak khawatir seperti kekhawatiran orang lain karena mereka telah menunaikan apa yang diwajibkan Allah kepada mereka, dan meninggalkan kemaksiatan yang dilarang untuk mereka kerjakan. Mereka yakin terhadap diri mereka dan berbaik sangka terhadap Tuhan mereka. Mereka juga tidak bersedih hati atas terlewatkannya suatu harapan mereka sebab mereka mengetahui bahwa hal itu atas ketetapan dan takdir Allah, sehingga dada mereka lapang, diri mereka penuh semangat, dan hati mereka bahagia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63 Mereka adalah orang-orang yang beriman kepada Allah dan hari akhir dengan sungguh-sungguh dan mereka selalu bertakwa dengan menjalankan perintah dan menjauhi larangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman dan selalu bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Kemudian Allah menyebutkan sifat mereka, seraya Dia berfirman, “(Yaitu) orang-orang yang beriman”, kepada Allah, malaikatNya, kitabNya, RasulNya, Hari Akhir, takdir baik dan buruknya, mereka membuktikan amal mereka dengan memakai ketakwaan dengan menaati perintah-perintah dan menjauhi larangan-larangan. Semua orang Mukmin yang bertakwa, maka dia adalah wali Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 63: Yakni beriman kepada Allah, malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, hari akhir dan qadar yang baik dan yang buruk, serta mereka benarkan iman mereka dengan amal, yaitu dengan bertakwa (menjalankan perintah Allah dan menjauhi larangan-Nya). Berdasarkan ayat ini, maka setiap mukmin adalah wali Allah, dan tingkat kewaliannya tergantung sejauh mana ketakwaan mereka kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 63",
    "description": "Wali-wali Allah yang disebut pada ayat sebelumnya, yaitu orangorang yang beriman tanpa ada sedikit pun keraguan dan senantiasa bertakwa, yakni selalu mengerjakan amal saleh sehingga mereka terhindar dari azab Allah. Bagi mereka berita gembira di dalam kehidupan di dunia berupa ketenangan hidup karena mereka menempuh jalan yang benar dan di akhirat mereka terhindar dari siksa neraka dan masuk surga serta kekal di dalamnya (lihat: surah al-anfa'l/8: 10). Tidak ada perubahan bagi janjijanji, yakni ketetapan-ketetapan Allah. Demikian itulah, yakni terbebas dari siksa neraka dan kekal di surga adalah kemenangan yang agung."
  }
]