[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi para wali-wali Allah itu ada kabar gembira dari Allah di kehidupan dunia dengan hal-hal yang menyenangkan mereka diantaranya adalah mimpi yang baik yang dilihat oleh orang mukmin atau diperlihatkan kepadanya, dan di akhirat berupa surga. Allah tidak mengingkari janjiNya dan tidak pula mengubah-ubahnya.Itulah keberuntungan yang agung, karena mencakup keselamatan dari segala yang ditakuti dan keberuntungan meraih semua keinginan yang disukai."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Mereka akan mendapatkan kabar gembira yang menyenangkan hati mereka di dunia berupa mimpi baik atau pujian dari sesama manusia. Dan mereka juga akan mendapatkan kabar gembira dari para Malaikat ketika nyawa mereka akan dicabut, juga sesudah kematian mereka dan ketika berkumpul di padang Mahsyar. Tidak ada perubahan atas apa yang Allah janjikan kepada mereka. Balasan itu merupakan keberhasilan yang sangat besar, karena mereka berhasil mendapatkan apa yang diinginkan dan selamat dari apa yang ditakutkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Balasan bagi mereka adalah kehidupan yang baik di dunia yang membuat mereka bahagia, mimpi yang indah, dan surga yang mulia di akhirat. Ini merupakan janji yang pasti, tidak ada yang dapat mengubah janji dan wahyu Allah. Kedudukan yang mulia dan surga yang penuh kenikmatan itu merupakan kemenangan besar. Abu Hurairah berkata, aku mendengar Rasulullah bersabda: “Kenabian tidak ada lagi selain berita-berita gembira.” Para sahabat bertanya: “Apa yang dimaksud dengan berita-berita gembira?” Beliau menjawab: “Mimpi yang baik.” (Shahih Bukhari 12/375 no. 6990, kitab Ta’bir mimpi, bab berita-berita gembira. Shahih Muslim dari hadits Ibnu Abbas, kitab shalat, bab larangan membaca al-Qur’an pada saat ruku’ dan sujud, 1/348 no.479)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. لَهُمُ الْبُشْرَىٰ فِى الْحَيَوٰةِ الدُّنْيَا وَفِى الْاٰخِرَةِ ۚ (Bagi mereka berita gembira di dalam kehidupan di dunia dan (dalam kehidupan} di akhirat) Mereka mendapat kabar gembira dalam kehidupan mereka lewat wahyu Allah yang disampaikan kepada para Nabi-Nya bahwa hak orang-orang beriman di sisi Allah adalah memasukkan mereka ke dalam surga dan memberi mereka keridhaan-Nya. Mimpi yang baik juga merupakan kabar gembira bagi mereka di kehidupan dunia ini, sebagaimana disebutkan dalam hadist marfu’: “wahyu Allah telah terputus, tinggal tersisa kabar-kabar gembira berupa mimpi yang baik yang dilihat oleh seorang mukmin atau diperlihatkan kepadanya”. Dan termasuk kabar gembira bagi mereka di dunia juga, karunia Allah berupa doa mereka yang dikabulkan Allah dan malaikat yang mereka saksikan ketika mereka mengalami sakaratul maut yang berkata: “janganlah takut dan bersedih, dan bergembiralah dengan surga yang dijanjikan kepadamu”. Adapun kabar gembira bagi mereka di akhirat berupa pertemuan mereka dengan malaikat yang memberi mereka kabar gembira dengan kemenangan meraih surga dan keselamatan dari azab. لَا تَبْدِيلَ لِكَلِمٰتِ اللهِ ۚ( Tidak ada perubahan bagi kalimat-kalimat (janji-janji) Allah) Yakni tidak ada perubahan firman-firman-Nya secara umum, termasuk didalamnya apa yang dijanjikan Allah kepada hamba-hamba-Nya yang shaleh diurutan pertama. Dan janji ini pasti dilaksanakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64 Mereka akan mendapatkan berita gembira di dalam kehidupan di dunia dengan kesenangan dan pertolongan selagi mereka masih dalam jalan kebenaran dan dalam kehidupan akhirat berupa surga dan pahala yang disampaikan oleh malaikat. Tidak ada perubahan bagi janji-janji Allah. Yang demikian itu adalah kemenangan yang besar berupa surga dan keridhaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi mereka itu berita gembira} berita gembira {di dalam kehidupan dunia dan di akhirat. Tidak ada perubahan bagi kalimat-kalimat Allah} tidak ada perubahan pada janji Allah {Demikian itu kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Mereka mendapatkan berita gembira dalam kehidupan di dunia dan (dalam kehidupan) di akhirat.” Adapun berita gembira di dunia maka ia adalah pujian yang baik, kecintaan di hati orang-orang Mukmin, mimpi yang baik dan apa yang dirasakan oleh seorang hamba dalam bentuk kasih sayang Allah kepadanya, kemudahanNya kepada amal dan akhlak yang terbaik dan penghindaranNya dari akhlak yang buruk. Sedangkan di akhirat maka yang pertama adalah berita gembira pada saat arwah mereka diambil sebagaimana Firman Allah, \"Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat akan turun kepada mereka dengan mengatakan: \"Janganlah kamu takut dan janganlah merasa sedih; dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu\".\" (Fushilat:30). Dan di dalam kubur ada berita gembira untuknya berupa ridha Allah dan nikmat yang dirasakan, dan di akhirat ada berita gembira yang sempurna dengan masuk syurga dan selamat dari azab neraka. “Tidak ada perubahan bagi kalimat –kalimat (janji-janji) Allah.” Akan tetapi apa yang Allah janjikan maka itulah kebenaran yang tidak mungkin dirubah dan diganti karena Dia Mahabenar dalam FirmanNya yang tidak seorang pun mampu menyelisihiNya dalam takdir dan keputusanNya. “Yang demikian itu adalah kemenangan yang besar.” Karena ia mengandung keselamatan dari yang dikhawatirkan, kemenangan meraih apa yang diinginkan, keberuntungan dibatasi padanya karena tidak ada keberuntungan untuk selain ahli iman dan takwa. Alhasil bahwa berita gembira meliputi seluruh kebaikan dan pahala yang dikaitkan oleh Allah di dunia dan akhirat dengan iman dan takwa. Oleh karenanya, Dia menyebutkannya secara mutlak dan tidak membatasinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 64: Seperti dengan mimpi yang baik yang dialami seseorang, pujian yang baik, dicintai oleh orang-orang mukmin, dimudahkan-Nya mengerjakan perbuatan baik dan dijauhkan dari mengerjakan yang buruk. Wal hasil, kabar gembira di sini mencakup segala kebaikan dan pahala yang Allah berikan di dunia dan akhirat karena iman dan ketakwaannya. Dengan diberi kabar gembira surga ketika nyawa mereka dicabut sebagaimana diterangkan dalam surat Fushshilat: 30, demikian juga ketika di kubur, dan ketika di akhirat dengan kabar gembira yang paling sempurna, yaitu masuk ke dalam surga dan selamat dari neraka. Apa yang Allah janjikan adalah benar, tidak mungkin dirubah dan diganti, karena Dia Maha Benar ucapan-Nya dan tidak ada seorang pun yang dapat menyelisihi qadar dan qadha’-Nya. Karena kemenangan tersebut mengandung selamat dari hal yang dikhawatirkan dan memperoleh apa yang diinginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 64",
    "description": "Bagi mereka berita gembira di dalam kehidupan di dunia berupa ketenangan hidup karena mereka menempuh jalan yang benar dan di akhirat mereka terhindar dari siksa neraka dan masuk surga serta kekal di dalamnya (lihat: surah al-anfa'l/8: 10). Tidak ada perubahan bagi janjijanji, yakni ketetapan-ketetapan Allah. Demikian itulah, yakni terbebas dari siksa neraka dan kekal di surga adalah kemenangan yang agung setelah dijelaskan bahwa wali-wali Allah akan memperoleh kebahagiaan di dunia dan di akhirat, lalu Allah berfirman: dan janganlah engkau wahai nabi Muhammad merasa sedih oleh perkataan mereka yang kafir kepada Allah, seperti engkau dikatakan pembohong, penyair dan lain-lain. Sungguh, kekuasaan itu seluruhnya milik Allah. Dia maha mendengar apapun yang mereka katakan, maha mengetahui apa pun yang mereka kerjakan."
  }
]