[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah bahwa sesungguhnya milik Allah semua yang ada di langit dan segala yang ada di bumi, dari bangsa malaikat, manusia, jin dan bangsa makhluk lainnya. Dan apakah yang diikuti oleh orang-orang yang menyeru selain Allah dari sekutu-sekutu? mereka tidaklah mengikuti, kecuali keragu-raguan. Dan mereka itu tiada lain, melainkan orang-orang yang berdusta dalam perkara yang mereka nisbatkan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Ingatlah, sesungguhnya Allah adalah satu-satu-Nya pemilik semua yang ada di langit dan semua yang ada di bumi. Lalu apa yang diikuti oleh orang-orang musyrik yang menyembah selain Allah sebagai sekutu-sekutu?! Sejatinya mereka hanyalah mengikuti keragu-raguan. Dan mereka itu berbohong dalam menyandarkan sekutu-sekutu kepada Allah -Ta'ālā-. Maha Tinggi Allah dengan setinggi-tingginya dari ucapan mereka itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Allah menyampaikan bahwa segala kerajaan langit yang tujuh dan apa yang ada di dalamnya, dan bumi dan semua makhluk yang ada di sana, merupakan kepunyaan-Nya. apa yang diikuti orang-orang yang menyembah selain Allah sebagai sekutu-sekutu-Nya, dan apa yang diikuti orang-orang yang menyeru kepada selain Allah sebagai sekutu-sekutu-Nya? (lihat: Tafsir Syeikhul Islam Ibnu Taimiyah 3/490) Tidak lain mereka hanya mengikut prasangka batil yang mengira itu adalah sekutu-sekutu Allah. Mereka adalah orang-orang yang berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. أَلَآ إِنَّ لِلّٰهِ مَن فِى السَّمٰوٰتِ وَمَن فِى الْأَرْضِ ۗ (Ingatlah, sesungguhnya kepunyaan Allah semua yang ada di langit dan semua yang ada di bumi) Dan termasuk kepunyaannya adalah mereka orang-orang musyrik. Apabila Allah dapat berbuat pada kepunyaannya apa yang Dia kehendaki maka bagaimana bisa mereka menyakiti Rasulullah selama Allah tidak mengizinkannya? وَمَا يَتَّبِعُ الَّذِينَ يَدْعُونَ مِن دُونِ اللهِ شُرَكَآءَ ۚ( Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti) Yakni meskipun mereka menyebut berhala-berhala mereka dengan sekutu-sekutu Allah, namun sebenarnya mereka bukanlah sekutu-sekutu-Nya, karena itu hanyalah sebutan saja, dan Allah-lah pemilik berhala-berhala mereka. إِن يَتَّبِعُونَ إِلَّا الظَّنَّ(Mereka tidak mengikuti kecuali prasangka belaka) Yakni mereka tidak mngikutinya dengan keyakinan. Dan prasangka tidak tidaklah cukup untuk menentukan kebenaran sama sekali. وَإِنْ هُمْ إِلَّا يَخْرُصُونَ(dan mereka hanyalah menduga-duga) Yakni mereka menduga-duga dengan dugaan batil dan dusta bahwa berhala-berhala mereka adalah sekutu-sekutu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66 Ingatlah, sesungguhnya kepunyaan Allah semua yang ada di langit dan semua yang ada di bumi berupa malaikat, jin, dan manusia sebagai raja, pencipta dan sesembahan. Bagaimana orang-orang musyrik itu menyembah hamba dan mengabaikan tuan? Dan yang disembah orang-orang musyrik berupa berhala itu sekutu Allah. Mereka itu bukan sekutu Allah. Allah adalah Raja mereka. Mereka tidak mengikutinya dengan yakin namun hanya prasangka yang buruk bahwa mereka adalah sekutu Allah. Mereka itu hanya berdusta dalam hal yang dihubungkan dengan Allah. Mereka hanya mengikuti prasangka mereka belaka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah sesungguhnya milik Allahlah siapa yang ada di langit dan siapa yang ada di bumi. Orang-orang yang menyeru kepada sekutu-sekutu selain Allah tidaklah ikut. Mereka hanya mengikuti persangkaan belaka dan mereka hanyalah menduga-duga} berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Allah mengabarkan bahwa Dia-lah pemillik segala yang ada di langit dan dibumi sebagai makhluk dan hambaNya. Dia bertindak pada mereka dengan hukum-hukum yang dikehendakiNya. Semuanya adalah dibawah kepemilikan Allah, mereka tunduk dan diatur (oleh Allah), tidak berhak disembah sedikitpun dan bukanlah sekutu-sekutu bagi Allah sedikit pun. Oleh karena itu, Allah berfirman, “Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Tidaklah mereka mengikuti melainkan prasangka belaka”, yang tidak berguna sedikit pun untuk kebenaran. “Dan mereka hanyalah menduga-duga.” Hal itu mengandung prasangka, dusta dan kepalsuan. Jika mereka benar bahwa yang mereka sembah itu adalah sekutu bagi Allah, maka hendaknya mereka menunjukkan sifat-sifatnya yang dengannya ia memang layak disembah, sedikit saja, dan mereka tidak akan mampu. Adakah di antara mereka yang mammpu menciptakan sesuatu atau memberi rizki atau menguasai makhluk sedikit saja atau mengatur malam dan siang yang dijadikan oleh Allah sebagai tiang kehidupan manusia?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 66: Semua milik Allah, hamba-Nya dan ciptaan-Nya, Dia berhak bertindak terhadap mereka apa yang Dia kehendaki dengan hukum-hukum-Nya. Semuanya milik Allah, ditundukkan-Nya dan diatur-Nya, mereka tidak berhak sedikit pun disembah dan mereka bukan sekutu Allah dari sisi apa pun. Seperti patung dan berhala. Mereka menyangka bahwa sekutu-sekutu itu adalah tuhan yang dapat memberi syafaat bagi mereka. Padahal persangkaan itu tidaklah membuahkan kebenaran. Jika persangkaan mereka benar, yakni patung-patung dan berhala adalah sekutu Allah, maka tunjukkanlah sifat-sifatnya yang menjadikannya berhak untuk disembah, dan apakah patung dan berhala itu mampu menciptakan, memberi rezeki, menguasai atau mengatur malam dan siang?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 66",
    "description": "Pada ayat sebelumnya dijelaskan bahwa kekuasaan seluruhnya milik Allah swt, lalu dalam ayat ini Allah menegaskan bukti kekuasaannya. Ingatlah, sesungguhnya milik Allah siapa, makhluk berakal yang ada di langit dan siapa yang ada di bumi, yakni manusia, seluruhnya berada dalam kekuasaan-Nya. Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti suatu keyakinan yang benar. Mereka hanya mengikuti persangkaan yang sesat belaka, karena mengira sembahan mereka akan memberikan manfaat dan pertolongan, padahal itu sama sekali tidak benar, dan mereka hanyalah menduga-duga, yakni mengerjakan sesuatu tanpa dasar yang benar. Usai menjelaskan kepemilikan Allah atas apa saja yang di langit dan bumi, dia lalu menjelaskan pengaturan sistem yang berjalan di langit dan bumi. Dialah yang menjadikan malam gelap bagimu agar kamu beristirahat padanya untuk melepaskan lelah, dan menjadikan siang terang benderang agar kamu leluasa untuk mencari karunia Allah. Sungguh, pada pergantian malam dan siang yang demikian itu terdapat tandatanda kekuasaan Allah bagi orang-orang yang mendengar dengan saksama dan mengambil pelajaran dari apa yang dideng."
  }
]