[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dialah (Allah) yang menjadikan bagi kalian (wahai sekalain manusia) malam hari supaya kalian dapat menenangkan diri padanya dan beristirahat dari kepenatan mobilitas dalam mencari penghidupan, dan Dia menjadikan bagi kalian siang hari agar kalian dapat melihat dengan jelas padanya dan berusaha dalam mencari rizki kalian. Sesungguhnya dalam pergantian malam dan siang dan keadaan manusia pada dua waktu itu benar-benar terdapat petunjuk dan hujah-hujah yang menunjukan bahwa sesungguhnya Allah, Dialah satu-satuNya yang berhak diibadahi bagi kaum yang menyimak hujjah-hujah ini(dengan baik) dan memikirkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Dia lah satu-satunya Zat yang menjadikan malam sebagai kesempatan untuk beristirahat dari kegiatan dan kelelahan, dan menjadikan siang hari terang benderang agar kalian bisa bekerja untuk mencari nafkah. Sesungguhnya pada yang demikian itu terdapat tanda-tanda yang jelas bagi orang-orang yang mau mendengar untuk mengambil pelajaran dan menerima."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Hai manusia, Allah mencipatakan malam bagi kalian, sebagai waktu istirahat bagi tubuh kalian dan penutup bagi kalian; dan menciptakan siang terang benderang sehingga kalian dapat melihat dengan baik, agar kalian dapat mencari rezeki. Perkara yang besar dan perubahan yang penuh hikmah ini tidak lain adalah tanda-tanda keesaan Allah bagi orang-orang yang mendengar dan mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. هُوَ الَّذِى جَعَلَ لَكُمُ الَّيْلَ لِتَسْكُنُوا۟ فِيهِ (Dialah yang menjadikan malam bagi kamu supaya kamu beristirahat padanya) Hamba-hamba Allah beristirahat di malam hari dari aktifitas dan rasa capek dan menenangkan diri mereka dari pekerjaan mereka. وَالنَّهَارَ مُبْصِرًا ۚ( dan (menjadikan) siang terang benderang) Yakni bersinar, sehingga dapat terlihat pemandangan dan benda-benda sehingga mereka dapat berkerja untuk memenuhi kebutuhan hidup mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67 Dialah yang menjadikan malam bagi kamu supaya kamu dapat beristirahat dan menjadikan siang terang benderang supaya kamu dapat mencari karunia dan rizki Allah. Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi orang-orang yang mendengar, merenung, memahami dan menerima"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang menjadikan untuk kalian malam agar kalian beristirahat di dalamnya dan siang terang benderang} bersinar sehingga bisa melihat di dalamnya {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang mendengar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. “Dia-lah yang menjadikan malam bagi kamu supaya kamu beristirahat padanya”, maksudnya, pada tidur dan istirahat karena kegelapan yang menyelimuti wajah bumi, kalau siang itu berlangsung terus maka mereka tidak dapat istirahat dan tidak tenang. “Dan” Allah menjadikan “siang terang benderang ( supaya kamu mencari karunia Allah).” Dengannya makhluk bisa melihat, maka mereka melakukan aktivitas hidup mereka dan mewujudkan kepentingan agama dan dunia mereka. “Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang mendengar”, dari Allah dengan pendengaran yang dilandasi oleh pemahaman, penerimaan dan keinginan mendapatkan petunjuk, bukan pendengaran untuk menentang dan melawan, karena pada yang demikian itu terdapat tanda-tanda bagi kaum yang mendengar, mereka berdalil dengannya berdasarkan bahwa hanya Allah-lah yang berhak untuk disembah, Dia-lah tuhan yang benar dan bahwa ketuhanan selainNya adalah batil dan bahwa Dia adalah Dzat yang Maha Pengasih, Penyayang, Mengetahui lagi Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 67: Jika tidak ada malam, tentu mereka tidak dapat beristirahat. Yakni tanda-tanda yang menunjukkan keesaan Allah, bahwa hanya Dia yang berhak diibadahi, dan menunjukkan bahwa beribadah kepada selain-Nya adalah batil. Demikian juga menunjukkan bahwa Dia Maha Pengasih lagi Maha Penyayang, Maha Mengetahui lagi Mahabijaksana. Yakni mendengar yang disertai mentadabburi (merenungi) dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 67",
    "description": "Usai menjelaskan kepemilikan Allah atas apa saja yang di langit dan bumi, dia lalu menjelaskan pengaturan sistem yang berjalan di langit dan bumi. Dialah yang menjadikan malam gelap bagimu agar kamu beristirahat padanya untuk melepaskan lelah, dan menjadikan siang terang benderang agar kamu leluasa untuk mencari karunia Allah. Sungguh, pada pergantian malam dan siang yang demikian itu terdapat tandatanda kekuasaan Allah bagi orang-orang yang mendengar dengan saksama dan mengambil pelajaran dari apa yang dideng pada ayat yang lalu dijelaskan tentang orang-orang musyrik yang menyekutukan Allah dengan menyembah selain Allah, lalu pada ayat ini dijelaskan tentang bentuk lain dari kemusyrikan, yaitu mengatakan bahwa Allah mempunyai anak. Ayat ini membantah siapa pun yang mengatakan bahwa Allah mempunyai anak, sebagaimana mereka orang yahudi dan nasrani berkata, Allah mempunyai anak. Orang yahudi mengatakan, uzair putra Allah, dan orang nasrani mengatakan, isa putra Allah (lihat: surah at-taubah/9: 30). Mahasuci dia dari prasangka mereka, dialah yang mahakaya, tidak memerlukan apa pun dan siapa pun dalam segala urusan; milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Kamu, yang mengatakan tuhan punya anak, sama sekali tidak mempunyai alasan kuat bahkan tidak punya bukti sedikit pun tentang kebohongan ini. Pantaskah kamu mengatakan kepalsuan tentang alla."
  }
]