[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik berkata, ”Allah mengambil anak” seperti perkataan mereka, ”malaikat adalah anak-anak perempuan Allah” atau “isa al-masih adalah putra Allah” maha suci Allah dari semua ungkapan tersebut dan Mahabersih darinya. Dia Mahakaya, tidak membutuhkan segala sesuatu selainNya.MilikNya segala sesuatu yang ada di langit dan dibumi.Maka bagaimana Dia mempunyai seorang anak dari yang Dia ciptakan sendiri, padahal segala sesuatu adalah milikNya? dan kalian tidak mempunyai bukti yang menguatkan apa yang kalian ada-adakan itu berupa kedustaan. Apakah kalian melontarkan kepada Allah sesuatu yang kalian sendiri tidak mengetahui hakikat dan kebenarnnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Sebagian orang musyrik berkata, \"Allah telah menjadikan para Malaikat sebagai anak-anak perempuan-Nya.\" Maha Suci Allah dari ucapan mereka itu. Karena Allah Maha Kaya atas semua makhluk-Nya. Dia lah pemilik semua yang ada di langit dan semua yang ada di bumi. Kalian -wahai orang-orang musyrik- tidak punya bukti sedikitpun atas ucapan kalian itu. Apakah kalian sengaja membuat kebohongan besar -yaitu menyatakan bahwa Allah mempunyai anak- atas nama Allah yang tidak pernah kalian ketahui hakikatnya, tanpa punya bukti yang kuat?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Allah menyampaikan kesesatan berbahaya yang menjadi tempat terjerumusnya orang-orang musyrik, yaitu kepercayaan bahwa Allah memiliki anak; Allah menjelaskan kesesatan ini dan menjelaskan cara membantahnya: Orang-orang musyrik Makkah berkata: “Para malaikat adalah anak-anak perempuan Allah”, dan orang-orang musyrik Yahudi berkata: “’Uzair adalah anak Allah”, sedangkan orang-orang musyrik Nasrani berkata: “Isa adalah anak Allah”. Maha Suci dan Maha Tinggi Allah dari segala yang mereka katakan. Allah tidak membutuhkan mereka dan tidak membutuhkan siapapun, Dia memiliki kerajaan langit yang tujuh dan bumi yang tujuh. Kalian tidak memiliki hujjah atas kedustaan kalian, apakah kalian akan berdusta terhadap Allah dalam hal yang tidak kalian ketahui kebenarannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. قَالُوا۟ اتَّخَذَ اللهُ وَلَدًا ۗ سُبْحٰنَهُۥ ۖ هُوَ الْغَنِىُّ ۖ (Mereka berkata: “Allah mempuyai anak”. Maha Suci Allah; Dialah Yang Maha Kaya) Allah berlepas diri dari kebatilan yang jelas yang mereka sematkan dari diri-Nya, dan Allah menjelaskan bahwa Dia Maha Kaya dari kebatilan itu, dan seorang anak sebenarnya hanya diharapkan ketika dibutuhkan, sedangkan Allah Yang Maha Kaya tidak butuh terhadap sesuatu sehingga menjadikannya butuh terhadap seorang anak. Dan juga yang membutuhkan seorang anak hanyalah sesuatu yang akan binasa agar anaknya dapat menggantikannya, sedangkan Allah Maha Hidup yang tidak akan ditimpa kematian, oleh sebab itu Allah tidak membutuhkannya. لَهُۥ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۚ( kepunyaan-Nya apa yang ada di langit dan apa yang di bumi) Maka tidak mungkin sesuatu yang ada di langit atau bui menjadi anaknya. إِنْ عِندَكُم مِّن سُلْطٰنٍۭ بِهٰذَآ ۚ( Kamu tidak mempunyai hujjah tentang ini) Yakni kalian tidak mempunyai hujjah dan bukti atas perkataan kalian ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68 Mereka orang-orang Yahudi berkata bahwa: “Malaikat adalah anak perempuan Allah”.sedangkan orang Nasrani mengatakan bahwa Allah mempunyai anak. Maha Suci Allah; Dialah Yang Maha Kaya; Dia Maha tidak butuh atas segala sesuatu, adapun anak adalah tanda butuh terhadap sesuatu, sedangkan Allah Maha Tidak Butuh Sesuatu secara mutlak. Kepunyaan-Nyalah segala apa yang ada di langit dan apa yang di bumi. Kamu tidak mempunyai hujjah tentang ini. Pantaskah kamu mengatakan tentang Allah padahal kamu tidak mengetahui sama sekali?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Allah mengangkat anak} para malaikat sebagai anak perempuan {Maha suci Dia}Maha suci Dia dari perkataan mereka {Dialah Yang Maha kaya. MilikNyalah apa yang ada di langit dan di bumi. Tidaklah} tidak {bagi kalian alasan} alasan dan bukti {tentang ini. Pantaskah kalian mengatakan tentang Allah apa yang tidak kalian ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. Allah berfirman mengabarkan kedustaan orang-orang musyrik kepada Allah Rabbul ‘alamin. “Mereka (Orang-orang Yahudi dan Nasrani) berkata, ‘Allah mempunyai anak’.” Maka Allah menyucikan diriNya dengan “Mahasuci Allah.” Yakni dari apa yang dikatakan oleh orang-orang zhalim dengan menisbatkan kekurangan kepadaNya dan Mahatinggi Allah dari hal itu. Kemudian Allah menyodorkan beberapa bukti. Pertama: FirmanNya, “Dia-lah Yang Mahakaya”, yakni kekayaan terbatas padaNya, macam-macam kekayaan hanya ada padaNya, Dia-lah Yang Mahakaya dari segala segi maka untuk apa Dia memiliki anak? Apakah karena Dia membutuhkan kepada anak? Ini jelas bertentangan dengan kekayaanNya dan tidak ada seorang pun yang memiliki anak kecuali karena adanya kekurangan pada kekayaannya. Bukti kedua: FirmanNya, “KepunyaanNya apa yang ada di langit dan apa yang ada di bumi.” Ini adalah kalimat yang umum lagi menyeluruh tidak ada sesuatu pun yang ada di langit dan di bumi yang keluar darinya, semuanya adalah makhluk lagi hamba yang dikuasai dan seperti yang sudah dimaklumi bahwa sifat umum ini bertentangan dengan kepemilikan anak dari mereka karena anak dari jenis orang tuanya, dia bukan makhluk bukan pula yang dimiliki, kepemilikan Allah terhadap apa yang ada di langit dan di bumi bertentangan dengan keperanakan. Bukti ketiga: “Tidaklah kamu mempunyai hujjah tentang ini.” Yakni apakah kamu mempunyai bukti dan dalil bahwa Allah mempunyai anak? Seandainya mereka memiliki dalil niscaya mereka pasti menyodorkannya, maka ketika Allah menentang mereka dan mereka pun tidak mampu menegakkan dalil maka diketahuilah kebatilan apa yang mereka ucapkan dan bahwa hal itu adalah ucapan tanpa ilmu, oleh karena itu Dia berfirman, “Pantaskah kamu mengatakan terhadap Allah apa yang tidak kamu ketahui?” ini adalah termasuk perkara yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 68: Allah Subhaanahu wa Ta'aala memberitakan tentang kebohongan orang-orang musyrik terhadap Allah Rabbul ‘alamin. Dari memiliki anak. Pernyataan ini merupakan bantahan pertama. Yakni tidak membutuhkan seorang pun, hanya orang yang butuh saja yang mencari anak. Pernyataan ini merupakan bantahan kedua. Pernyataan ini merupakan bantahan ketiga, yakni milik-Nya, hamba-Nya dan ciptaan-Nya semua yang ada di langit dan di bumi. Termasuk hal yang sudah maklum, bahwa anak itu sama seperti bapak, bukan makhluk. Oleh karena selain-Nya adalah makhluk, maka mereka bukanlah anak, bahkan milik-Nya, hamba-Nya dan ciptaan-Nya. Sebagai bantaha keempat, yakni apakah mereka memiliki keterangan dan alasan kuat yang dapat mereka tunjukkan bahwa Allah memiliki anak. Oleh karena mereka tidak memiliki keterangan dan alasan kuat, maka dapat diketahui bahwa pernyataan mereka adalah batil, dan bahwa hal itu merupakan berkata-kata tentang Allah tanpa ilmu. Sebagai bantahan kelima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 68",
    "description": "Pada ayat yang lalu dijelaskan tentang orang-orang musyrik yang menyekutukan Allah dengan menyembah selain Allah, lalu pada ayat ini dijelaskan tentang bentuk lain dari kemusyrikan, yaitu mengatakan bahwa Allah mempunyai anak. Ayat ini membantah siapa pun yang mengatakan bahwa Allah mempunyai anak, sebagaimana mereka orang yahudi dan nasrani berkata, Allah mempunyai anak. Orang yahudi mengatakan, uzair putra Allah, dan orang nasrani mengatakan, isa putra Allah (lihat: surah at-taubah/9: 30). Mahasuci dia dari prasangka mereka, dialah yang mahakaya, tidak memerlukan apa pun dan siapa pun dalam segala urusan; milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Kamu, yang mengatakan tuhan punya anak, sama sekali tidak mempunyai alasan kuat bahkan tidak punya bukti sedikit pun tentang kebohongan ini. Pantaskah kamu mengatakan kepalsuan tentang allakatakanlah, wahai nabi Muhammad sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah dengan me-ngatakan bahwa Allah mempunyai anak atau sekutu, mereka tidak akan beruntung, yakni tidak akan mendapatkan apapun yang mereka harapkan."
  }
]