[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, ”sesungguhnya orang-orang yang mengada-adakan kedustaan atas nama Allah, dengan menyatakan Allah mempunyai anak dan mengaitkan sekutu kepadaNya, mereka tidak akan dapat menggapai keinginan mereka di dunia dan di akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Katakanlah -wahai Rasul kepada mereka, \"Sesungguhnya orang-orang yang membuat kebohongan atas nama Allah dengan mengatakan bahwa Allah mempunyai anak, mereka tidak akan mendapatkan apa yang mereka inginkan dan tidak akan selamat dari apa yang mereka takutkan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Hai Rasulullah, katakanlah kepada orang-orang yang sengaja melakukan kedustaan terhadap Allah, mereka tidak akan mendapat kehidupan yang baik di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. قُلْ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللهِ الْكَذِبَ لَا يُفْلِحُونَ (Katakanlah: “Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak beruntung”) Yakni tidak dapat meraih surga Allah dan keselamatan dari neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69 Katakanlah wahai Nabi: “Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah berupa sekutu dan anak mereka tidak akan beruntung dengan mendapat surga dan tidak akan selamat dari neraka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya orang-orang yang mengada-adakan} membuat-buat {kebohongan terhadap Allah tidak akan beruntung.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-70. “Katakanlah, ‘Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak beruntung’.” Maksudnya, mereka tidak meraih keinginan mereka dan maksud mereka tidak terwujud. Mereka hanya menikmati kekufuran dan kedustaan mereka sedikit di dunia kemudian mereka berpindah dan kembali kepada Allah maka Dia menimpakan kepada mereka, “siksa yang berat, disebabkan kekafiran mereka.” Dan Allah tidak menzhalimi mereka, tetapi merekalah yang menzhalimi diri sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 69: Seperti menisbatkan sekutu dan anak kepada-Nya. Yakni tidak akan berbahagia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 69",
    "description": "Katakanlah, wahai nabi Muhammad sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah dengan me-ngatakan bahwa Allah mempunyai anak atau sekutu, mereka tidak akan beruntung, yakni tidak akan mendapatkan apapun yang mereka harapkan. Kesenangan yang mereka rasakan hanyalah sesaat ketika di dunia, selanjutnya kepada kamilah mereka kembali setelah kematian menghampiri mereka, kemudian di akhirat nanti akan kami rasakan kepada mereka azab yang berat, karena kekafiran mereka ketika hidup di dunia."
  }
]