[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang tidak menginginkan berjumpa dengan kami di akhirat untuk menghadapi perhitungan amal dan perkara yang menyertainya berupa pembalasan atas amal perbuatan karena pengingkaran mereka terhadap adanya kebangkitan dan merasa puas dengan kehidupan dunia sebagai pengganti dari kehidupan akhirat dan lebih cenderung kepadanya, dan orang-orang yang lalai terhadap ayat-ayat kami yang kauniyah dan syar’iyah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sesungguhnya orang-orang kafir yang tidak membayangkan akan berjumpa dengan Allah sehingga mereka tidak merasa takut maupun mengharapkan perjumpaan itu, mereka merasa puas dengan kehidupan dunia yang sementara daripada kehidupan Akhirat yang kekal, merasa tenang dan gembira dengan kehidupan dunia, dan berpaling serta lalai dari ayat-ayat Allah dan dalil-dalil-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Sungguh orang-orang yang tidak menyangka dan tidak menginginkan pertemuan dengan Allah pada hari kiamat, puas dan senang dengan kehidupan dunia, dan tidak mentadabburi dan memahami ayat-ayat Allah yang agung yang menunjukkan kekuasaan dan keesaan-Nya, maka mereka adalah orang-orang yang jauh dari rahmat Allah; tempat kembali mereka di akhirat adalah neraka Jahannam, akibat kejahatan dan dosa-dosa yang telah mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. لَا يَرْجُونَ لِقَآءَنَا (yang tidak mengharapkan pertemuan dengan Kami) Yakni yang tidak menyangka pertemuan dengan Kami. Sehingga mereka tidak takut dan tidak mengharapkannya. وَرَضُوا۟ بِالْحَيَوٰةِ الدُّنْيَا(dan merasa puas dengan kehidupan dunia) Sebagai ganti dari kehidupan akhirat. وَاطْمَأَنُّوا۟ بِهَا(serta merasa tenteram dengan kehidupan itu) Yakni merasa tenang dan senang dengan kehidupan dunia. وَالَّذِينَ هُمْ عَنْ ءَايٰتِنَا غٰفِلُونَ(dan orang-orang yang melalaikan ayat-ayat Kami) Yang tidak memikirkannya dan mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Sesungguhnya orang-orang yang tidak berharap bertemu Kami karena takut dan tamak akibat mengingkari hari kebangkitan, lebih menyukai tinggal di dunia daripada akhirat, dan menempatkan dirinya pada dunia dan kelezatannya, dan orang-orang yang mengabaikan ayat-ayat Kami yang menunjukkan pada keesaan dan kuasa Kami serta tidak mau memikirkannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang tidak mengharapkan} tidak mengharapkan {pertemuan dengan Kami, puas dengan kehidupan dunia} puas dengan kehidupan dunia sebagai ganti akhiraat sehingga mereka bekerja untuk dunia {dan merasa tenteram dengannya} tenang dengannya {serta orang-orang yang lalai terhadap ayat-ayat Kami} orang-orang yang berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah berfirman, “Sesungguhnya orang-orang yang tidak mengharapkan (tidak percaya akan) pertemuan dengan Kami.” Maksudnya tidak ingin bertemu Allah yang merupakan keinginan terbesar yang diinginkan oleh orang-orang yang ingin, harapan tertinggi yang diharapkan oleh orang-orang yang berharap, mereka justru berpaling darinya bahkan mendustakannya, “dan merasa puas dengan kehidupan dunia”, sebagai ganti kehidupan akhirat, “serta merasa tentram dengan kehidupan itu”, maksudnya mereka bersandar kepadanya, menjadikannya sebagai target dan sasaran akhir mereka, maka mereka berusaha untuknya, tenggelam di dalam kenikmatan dan syahwatnya, dengan cara apa pun dia mendapatkannya, dari arah mana pun ia muncul, maka dengan segera ia disambarnya. Mereka memfokuskan keinginan, niat, pikiran dan pekerjaan mereka kepadanya, seakan-akan mereka diciptakan agar kekal di dalamnya, seakan-akan ia bukanlah alam singgahan yang mana orang-orang musafir berbekal darinya menuju kampung yang kekal yang mana orang-orang terdahulu dan yang datang kemudian berangkat kepada kenikmatan dan kelezatannya. Orang-orang yang diberi taufik menyingsingkan lengan baju (untuk mendapatkannya). “Dan orang-orang yang melalaikan ayat-ayat kami,” mereka tidak mengambil manfaat dari ayat-ayat al-Quran, tidak pula dari ayat-ayat yang ada di dalam diri dan cakrawala, padahal berpaling dari dalil berarti berpaling dan lalai dari apa yang menjadi maksud dari dalil itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 7: Maksudnya tidak percaya akan adanya kebangkitan atau tidak berharap dan tidak suka bertemu dengan Allah.. Mereka menjadikan dunia sebagai cita-cita tertinggi mereka, oleh karenanya mereka berusaha mengejarnya, senang dengan kenikmatannya dengan apa pun caranya yang penting mereka dapat memperolehnya. Mereka telah alihkan keinginan, niat, pikiran dan perbuatan mereka untuknya seakan-akan mereka diciptakan untuk kekal di dunia, dan seakan-akan dunia bukanlah tempat melintas yang seorang musafir hanya menjadikan sebagai tempat menambah perbekalan menuju tempat yang kekal, di mana orang-orang tedahulu maupun yang datang setelahnya berusaha mengejar kenikmatannya. Yakni tidak memperhatikan. Mereka tidak mengambil manfaat dari ayat-ayat Al Qur’an, ayat-ayat Allah yang ada di alam semesta dan yang ada dalam diri mereka sendiri. Berpaling dari ayat-ayat itu sehingga membuatnya lalai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 7",
    "description": "Meskipun bukti kebesaran dan kekuasaan Allah telah terbentang luas di alam raya sebagaimana dijelaskan dalam ayat-ayat sebelumnya, namun masih ada sebagian manusia yang tidak percaya dan mengingkari adanya Allah. Mereka merasa puas dengan kehidupan dunia. Allah menegaskan bahwa sesungguhnya orang-orang yang tidak mengharapkan pertemuan dengan kami di hari akhirat nanti dengan adanya pahala bagi yang beramal saleh dan siksa bagi yang durhaka, dan mereka merasa puas dengan kehidupan dunia serta merasa tenteram dengan kehidupan itu, sehingga tidak pernah berbuat untuk kehidupan akhirat, padahal kehidupan akhirat lebih baik dan lebih kekal, dan orang-orang yang melalaikan ayat-ayat kami, yakni tidak menghiraukan petunjuk yang ada di dalam Al-Qur'an dan tidak sedikit pun mengambil pelajaran dari tanda-tanda kekuasaan dan kebesaran Allah di alam semesta. Maka mereka itu tempatnya di neraka, karena apa yang telah mereka lakukan selama hidup di dunia, berupa kedurhakaan kepada Allah."
  }
]