[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya mereka akan bersenang-senang di dunia dengan kekafiran dan kedustaan mereka dalam kesenangan yang singkat, kemudian apabila ajal mereka telah berakhir, maka kepada kami lah tempat kembali mereka, kemudian kami menimpakan kepada mereka siksaan jahanam disebabkan kekafiran mereka kepada Allah dan pendustaan mereka terhadap rasul-rasul Allah dan penentangan mereka terhadap ayat-ayatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Maka janganlah kalian terpesona dengan kesenangan dan kenikmatan duniawi yang mereka nikmati. Karena itu adalah kesenangan kecil dan sesaat. Kemudian mereka akan dikembalikan kepada Kami di Hari Kiamat. Lalu Kami akan menimpakan azab yang sangat kuat kepada mereka, karena mereka telah ingkar kepada Allah dan mendustakan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Mereka hanya menikmati dunia dalam waktu singkat, kemudian mereka kembali kepada Kami pada hari kiamat untuk mendapat siksaan, lalu mereka akan terbakar api neraka Jahannam, dan mereka akan menjadi bahan bakarnya. Hal ini agar mereka merasakan azab yang penih akibat dosa-dosa yang telah mereka perbuat berupa menyekutukan Allah dan membuat kedustaan terhadap-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. مَتٰعٌ فِى الدُّنْيَا ((Bagi mereka) kesenangan (sementara) di dunia) Yakni orang yang memelakukan kedustaan ini meski mendapatkan sedikit kesenangan sementara namun itu hanyalah kesenangan dunia semata yang akan dilanjutkan oleh kematian dan kembali kepada Allah, agar pendusta tersebut diazab dengan azab yang kekal disebabkan kekafiran dan kedustaannya terhadap Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70 Mereka hanya mendapatkan kesenangan sementara di dunia, kemudian kepada Kami-lah mereka kembali, kemudian Kami berikan siksa yang berat kepada mereka, disebabkan kekafiran mereka dan pendustaan mereka terhadap Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Bagi mereka) Kesenangan di dunia, selanjutnya kepada Kamilah tempat mereka kembali} mereka kembali pada hari kiamat {kemudian Kami membuat mereka merasakan azab yang keras karena mereka selalu ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-70. “Katakanlah, ‘Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak beruntung’.” Maksudnya, mereka tidak meraih keinginan mereka dan maksud mereka tidak terwujud. Mereka hanya menikmati kekufuran dan kedustaan mereka sedikit di dunia kemudian mereka berpindah dan kembali kepada Allah maka Dia menimpakan kepada mereka, “siksa yang berat, disebabkan kekafiran mereka.” Dan Allah tidak menzhalimi mereka, tetapi merekalah yang menzhalimi diri sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 70: Selama mereka hidup. Setelah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 70",
    "description": "Kesenangan yang mereka rasakan hanyalah sesaat ketika di dunia, selanjutnya kepada kamilah mereka kembali setelah kematian menghampiri mereka, kemudian di akhirat nanti akan kami rasakan kepada mereka azab yang berat, karena kekafiran mereka ketika hidup di dunia. Setelah ayat-ayat sebelumnya menjelaskan bahwa orang-orang yang membuat-buat kebohongan tentang Allah mereka akan mendapatkan azab yang berat, lalu dalam ayat ini dijelaskan tentang kisah nabi nuh dengan kaumnya dalam rangka menghibur nabi Muhammad. Dan bacakanlah wahai nabi Muhammad kepada mereka berita penting tentang nuh ketika dia berkata kepada kaumnya, wahai kaumku! jika terasa berat bagimu aku tinggal bersamamu dan peringatanku kepadamu dengan ayatayat Allah, sebagai bukti tentang keesaan dan kekuasaan-Nya, maka kepada Allah aku bertawakal setelah berusaha secara maksimal. Karena itu bulatkanlah keputusanmu, yakni tindakan apa yang akan kamu ambil untukku dan kumpulkanlah sekutu-sekutumu untuk membinasakanku, dan janganlah keputusanmu itu dirahasiakan, karena Allah mengetahui apa pun yang kamu rahasiakan. Kemudian bertindaklah terhadap diriku sesuai kehendak kamu, dan janganlah kamu tunda lagi keputusan untuk membinasakanku. Aku yakin Allah bersamaku dan akan menolongku."
  }
]