[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ceritakanlah (wahai rasul) kepada orang-orang kafir Makkah kisah nuh bersama kaumnya, ketika dia berkata kepada mereka, ”bila memberatkan kalian keberadaanku tinggal ditengah kalian dan peringatanku kepada kalian dengan hujjah-hujjah Allah dan bukti-bukti kebenaranNa, maka hanya kepada Allah lah tempat bergantungku dan kepaadNya aku menaruh kepercayaanku. Karena itu, persiapkanlah putusan kalian, dan serulah sekutu-sekutu kalian, kemudian janganlah kalian menjadikan putusan kalian bersifat tertutup, akan tetapi jadikanlah nyata lagi tebuka. Lalu berikanlah keputusan kepadaku dengan hukuman dan keburukan yang berada dalam jangkauan kemampuan kalian. Dan janganlah kalian memberiku penangguhan sesaatpun di siang hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan ceritakanlah -wahai Rasul- kepada orang-orang musyrik yang mendustakan itu kisah Nuh -'alaihissalām- ketika dia berkata kepada kaumnya, \"Wahai kaumku! Jika keberadaanku di tengah-tengah kalian menjadi masalah besar bagi kalian, peringatanku dan nasihatku dengan ayat-ayat Allah terasa berat bagi kalian, dan kalian memutuskan untuk membunuhku, maka hanya kepada Allah saja lah aku bersandar dalam menghadapi tipu daya kalian. Maka mantapkanlah urusan kalian, pastikanlah niat kalian untuk membunuhku, dan panggillah tuhan-tuhan sesembahan kalian agar membantu kalian dan jangan kalian rahasiakan tipu daya kalian! Kemudian setelah kalian menyusun rencana untuk membunuhku laksanakanlah apa yang kalian rencanakan itu dan jangan menunda-nunda sedikitpun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Hai Rasulullah, ceritakanlah kepada orang-orang musyrik kisah yang besar, ketika Nabi Nuh berkata kepada kaumnya yang mendustakannya: “Hai kaumku, jika kedudukanku dan peringatanku selama ini memberatkan kalian, sehingga kalian ingin membunuh atau mengusirku, maka hanya kepada Allah aku bertawakkal; maka siapkanlah tipu daya kalian dan lakukanlah itu secara terang-terangan tanpa menunda lagi, karena aku tidak peduli dengan apa yang kalian lakukan, sebab aku berada dalam lindungan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. نَبَأَ نُوحٍ (berita penting tentang Nuh) Tentang apa yang terjadi antara dia dengan kaumnya yang kafir terhadap apa yang dibawanya sebagaimana apa yang dilakukan oleh orang-orang kafir Quraisy. يٰقَوْمِ إِن كَانَ كَبُرَ عَلَيْكُم مَّقَامِى (Hai kaumku, jika terasa berat bagimu tinggal (bersamaku)) Yakni jika berat bagi kalian aku yang tinggal bersama kalian ini dan perbuatanku yang selalu menyampaikan nasehat di perkumpulan-perkumpulan kalian. وَتَذْكِيرِى بِـَٔايٰتِ اللهِ (dan peringatanku (kepadamu) dengan ayat-ayat Allah) Yakni ayat-ayat kauniyah dan wahyu-wahyu Allah. فَعَلَى اللهِ تَوَكَّلْتُ(maka kepada Allah-lah aku bertawakal) Yakni aku tidak menghapi semua itu kecuali dengan bertawakkal kepada Allah. فَأَجْمِعُوٓا۟ أَمْرَكُمْ (karena itu bulatkanlah keputusanmu) Kuatkanlah tekat dalam rencana kalian ini. وَشُرَكَآءَكُمْ (dan (kumpulkanlah) sekutu-sekutumu) Yakni panggillah mereka untuk membuat keputusan dalam rencana kalian ini atau agar mereka dapat menolong kalian. ثُمَّ لَا يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً(Kemudian janganlah keputusanmu itu dirahasiakan) Agar rencana kalian ini menjadi jelas. ثُمَّ اقْضُوٓا۟ إِلَىَّ (lalu lakukanlah terhadap diriku) Rencana yang kalian siapkan bagiku. وَلَا تُنظِرُونِ (dan janganlah kamu memberi tangguh kepadaku) Jangan kalian tunda-tunda, tapi segerakanlah rencana itu dan lakukanlah apa yang ingin kalian lakukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Hendaklah keimanan yang menjadi prinsip dirimu adalah keimanan yang kuat dan tidak dapat digoyahkan dengan cobaan dan cabaran : { ثُمَّ اقْضُوا إِلَيَّ وَلَا تُنْظِرُونِ } \"lalu lakukanlah terhadap diriku, dan janganlah kamu memberi tangguh kepadaku\" , { إِنِّي آمَنْتُ بِرَبِّكُمْ فَاسْمَعُونِ } \"Sesungguhnya aku telah beriman kepada Tuhanmu; maka dengarkanlah (pengakuan keimanan)ku\" [ Yaa Siin : 25 ] dan berlemah lembutlah dengan hati yang terbuka dalam meyakinkan orang lain tentang agamamu, dan dakwah kepada umat manusia : { قَالَ يَا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ 20 اتَّبِعُوا مَنْ لَا يَسْأَلُكُمْ أَجْرًا وَهُمْ مُهْتَدُونَ 21 } \"seorang laki-laki dengan bergegas-gegas ia berkata: “Hai kaumku, ikutilah utusan-utusan itu 20 Ikutilah orang yang tiada minta balasan kepadamu; dan mereka adalah orang-orang yang mendapat petunjuk 21\" [ Yaa Siin : 20-21 ] , { ادْعُ إِلَىٰ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ ۖ وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ } \"Serulah (manusia) kepada jalan Tuhan-mu dengan hikmah dan pelajaran yang baik dan bantahlah mereka dengan cara yang ba\" [ An-Nahl : 125 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71 BacakanIah kepada mereka orang musyrik Makkah berita penting tentang Nuh di waktu dia berkata kepada kaumnya: “Hai kaumku, jika terasa berat bagimu tinggal bersamaku selama 950 tahun dan peringatanku kepadamu dengan ayat-ayat Allah, maka kepada Allah-lah aku bertawakal, karena itu bulatkanlah keputusanmu dan kumpulkanlah sekutu-sekutumu selain Allah untuk membinasakanku. Kemudian janganlah keputusanmu itu dirahasiakan, lalu lakukanlah terhadap diriku, dan janganlah kamu memberi tangguh kepadaku, sesungguhnya aku tidak mempedulikan kalian, karena Allahlah yang memelihara dan menjagaku.” Inilah ucapan Nuh karena kepercayaannya terhadap pertolongan Tuhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bacakanlah} ceritakanlah {kepada mereka berita} kabar {tentang Nuh ketika dia berkata kepada kaumnya,“Wahai kaumku, jika terasa berat} terasa berat {bagi kalian tempatku tinggal} tempat tinggalku di antara kalian {dan peringatanku dengan ayat-ayat Allah, maka kepada Allahlah aku bertawakal} bergantung {Maka bulatkanlah} bulatkanlah dan tentukanlah {keputusan kalian dan sekutu-sekutu kalian} serulah tuhan-tuhan kalian {Kemudian jangan sampai keputusan kalian itu dirahasiakan} rahasia dan samar {Kemudian bertindaklah terhadapku} tunaikanlah keputusan yang kalian inginkan itu kepadaku {dan janganlah kalian menunda-nunda kepadaku} janganlah kalian menunda-nunda untukku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Allah berfirman kepada NabiNya, “Bacakanlah kepada kaummu, “berita penting tentang Nuh”, tentang dakwahnya kepada kaumnya ketika dia mengajak kepada Allah dalam jangka waktu yang panjang, dia tinggal pada mereka selama 950 tahun, akan tetapi dakwahnya tidak menambahkan (keimanan) untuk mereka melainkan melaumpaui batas, mereka jenuh dan bosan darinya padahal Nuh bukanlah orang yang malas dan asal-asalan dalam berdakwah kepada mereka, dia berkata kepada mereka, “Hai kaumku, jika terasa berat bagimu tinggal (bersamaku) dan peringatanku (kepadamu) dengan ayat-ayat Allah.” Maksudnya, jika keberadaanku dan peringatanku dengan ayat-ayat Allah yang merupakan dalil yang jelas lagi terang itu tidak berguna bagimu, memberatkan dan menyusahkanmu lalu kamu ingin menimpakan keburukan kepadaku atau kamu ingin menolak kebenaran, “maka kepada Allah-lah aku bertawakal.” Maksudnya, aku bersandar kepada Allah dalam melawan keburukan yang hendak ditimpakan kepadaku dan kepada dakwahku. Ini adalah tentara dan senjataku sementara kamu silakan saja menghadirkan sejumlah (kekuatan) dan senjata yang kamu kehendaki. “Karena itu bulatkanlah keputusanmu,” semuanya, dan tidak seorang pun yang tertinggal serta jangan simpan sedikit pun dayamu. “Dan” hadirkanlah, “sekutu-sekutumu (untuk membinasakanku),” yang mana kamu menyembah dan bersikap loyal kepada mereka, yaitu selain Allah Rabb semesta alam. “Kemudian janganlah keputusanmu itu dirahasiakan.” Yakni samar dan rancu, akan tetapi hendaknya ia jelas lagi terang. “Lalu lakukanlah terhadap diriku”, dengan menimpakan hukuman dan keburukan yang kamu mampu. “Dan janganlah kamu memberi tangguh kepadaku.” Maksudnya, jangan menundaku walaupun sesaat. Ini adalah bukti yang pasti dan ayat yang agung atas kebenaran risalah dan ajaran yang dibawanya di mana dia sendirian, tanpa keluarga yang melindunginya dan tidak ada tentara yang membelanya walaupun begitu Nuh berani secara terbuka menyatakan bodohnya pendapat mereka, rusaknya ajaran mereka, dan aibnya tuhan-tuhan mereka. Mereka menyimpan kebencian dan permusuhan kepada Nuh lebih besar daripada gunung yang tegak menjulang, dan mereka adalah kaum yang kuat lagi mampu, tetapi NUh berkata kepada mereka, “Berkumpullah kamu dengan sekutu-sekutumu serta siapa pun yang kamu mampu (meminta bantuannya), perlihatkanlah tipu daya apa saja yang kamu bisa, lalu timpakan itu kepadaku kalau kamu mampu melakukan hal itu, tapi kamu tidak akan bisa melakukan itu kepadaku.” Maka terbuktilah bahwa Nuh benar, dan mereka adalah pendusta dalam apa yang mereka klaim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 71: Penduduk Mekah. Ketika ia berdakwah kepada kaumnya, di mana Beliau berdakwah dalam waktu yang sangat lama. Beliau tinggal di tengah-tengah kaumnya selama 950 tahun, namun dakwah Beliau tidak menambah mereka mendekat, tetapi malah menambah mereka menjauh dan melampaui batas. Beliau tidak bosan dan berhenti berdakwah, bahkan kaumnya yang lama-kelamaan bosan, hingga kemudian Nabi Nuh ‘alaihis salam berkata kepada kaumnya sebagaimana yang disebutkan dalam ayat di atas. Lalu kalian hendak menimpakan malapetaka kepadaku. Ini merupakan bukti yang kuat yang menunjukkan kebenaran risalahnya dan apa yang Nabi Nuh ‘alaihis salam bawa, di mana Beliau hanya sendiri, tidak ada keluarga yang melindungi dan pasukan yang membelanya. Beliau berdakwah dengan menerangkan kesalahan pandangan kaumnya, agama yang mereka pegang, serta menerangkan cacat patung dan berhala yang mereka sembah. Oleh karenanya kaumnya semakin marah dan memusuhi Beliau, sedangkan mereka memiliki kemampuan dan kekuasaan. Kemudian Nabi Nuh ‘alaihis salam berkata sambil bertawakkal kepada Allah, “Karena itu bulatkanlah keputusanmu dan kumpulkanlah sekutu-sekutumu (untuk membinasakanku).” Yakni berkumpullah kamu bersama para sekutumu dan tunjukkanlah tipu daya yang hendak kamu timpakan kepadaku lalu lakukanlah tipu daya itu jika kamu mampu. Mereka pun tidak mampu melakukannya. Dengan demikian, jelaslah bahwa Beliau benar dan bahwa mereka berdusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 71",
    "description": "Setelah ayat-ayat sebelumnya menjelaskan bahwa orang-orang yang membuat-buat kebohongan tentang Allah mereka akan mendapatkan azab yang berat, lalu dalam ayat ini dijelaskan tentang kisah nabi nuh dengan kaumnya dalam rangka menghibur nabi Muhammad. Dan bacakanlah wahai nabi Muhammad kepada mereka berita penting tentang nuh ketika dia berkata kepada kaumnya, wahai kaumku! jika terasa berat bagimu aku tinggal bersamamu dan peringatanku kepadamu dengan ayatayat Allah, sebagai bukti tentang keesaan dan kekuasaan-Nya, maka kepada Allah aku bertawakal setelah berusaha secara maksimal. Karena itu bulatkanlah keputusanmu, yakni tindakan apa yang akan kamu ambil untukku dan kumpulkanlah sekutu-sekutumu untuk membinasakanku, dan janganlah keputusanmu itu dirahasiakan, karena Allah mengetahui apa pun yang kamu rahasiakan. Kemudian bertindaklah terhadap diriku sesuai kehendak kamu, dan janganlah kamu tunda lagi keputusan untuk membinasakanku. Aku yakin Allah bersamaku dan akan menolongku. Maka jika kamu berpaling dari peringatanku, aku tidak meminta imbalan sedikit pun darimu sebagai upah dakwahku. Imbalanku tidak lain hanyalah dari Allah, karena aku sampaikan dakwah dan peringatan ini semata-mata karena Allah dan aku diperintah agar aku termasuk golongan orang-orang muslim, yakni golongan yang berserah diri kepada-Nya."
  }
]