[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian bila kalian berpaling dari dakwahku, maka sesungguhnya aku tidaklah meminta upah dari kalian; sebab sesungguhnya balasanku ada di sisi tuhanku dan imbalanku pada Allah semata, tiada sekutu bagiNya.Dan aku diperintah agar termasuk orang-orang yang tunduk patuh kepada hukumNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Jika kalian menolak seruanku, kalian pasti tahu bahwa aku tidak pernah meminta imbalan atas usahaku menyampaikan risalah Tuhanku. Hanya Allah-lah yang memberiku imbalan. Baik kalian beriman maupun tidak. Dan Allah-menyuruhku menjadi orang yang tunduk kepada-Nya dengan cara menjalankan ketaatan dan mengerjakan amal saleh.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Jika kalian berpaling dari dakwah dan risalahku, maka sesungguhnya aku tidak meminta upah kepada kalian dari dakwah yang aku lakukan, karena pahala besar akan Allah berikan kepadaku; aku diperintahkan untuk tunduk kepada-Nya dengan ketaatan sepenuhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. فَإِن تَوَلَّيْتُمْ فَمَا سَأَلْتُكُم مِّنْ أَجْرٍ ۖ (Jika kamu berpaling (dari peringatanku), aku tidak meminta upah sedikitpun dari padamu) Yakni jika kalian tidak menjalankan nasehatku ini maka sebenarnya aku tidak meminta kepada kalian balasan upah yang harus kalian bayarkan kepadaku sehingga kalian harus memperhatikan risalah yang aku bawa. إِنْ أَجْرِىَ إِلَّا عَلَى اللهِ ۖ( Upahku tidak lain hanyalah dari Allah belaka) Allah akan memberiku pahala, baik itu kalian beriman maupun berpaling."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72 Jika kamu berpaling dari peringatan dan seuranku, aku tidak akan meminta upah sedikitpun darimu. Upahku tidak lain hanya dari Allah semata, dan aku diperintahkan supaya aku menjadi golongan orang-orang yang berserah diri, tidak membangkang dan tidak mengharap selain hanya kepada-Nya”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian berpaling} tidak mau menerima nasehatku {aku tidak meminta imbalan sedikit pun dari kalian. Sesungguhnya imbalanku tidak lain hanyalah dari Allah dan aku diperintah agar aku masuk ke dalam golongan orang-orang muslim.” (72)} orang-orang yang tunduk kepada perintah Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Oleh karena itu , dia berkata, “JIka kamu berpaling (dari peringatanku)”, dari apa yang aku serukan kepadamu, maka kamu tidak memiliki alasan dalam keberpalinganmu itu karena terbukti bahwa kamu tidak berpaling dari kebatilan kepada kebenaran, akan tetapi kamu berpaling dari kebenaran di mana dalil-dail telah membuktikan kebenarannya kepada kebatilan dimana dalil-dalil telah membuktikan kebatilannya, meskipun begitu “aku tidak meminta upah sedikit pun darimu”, atas dakwahku dan jawabanmu, akibatnya kamu akan berkata, “Orang ini datang untung mengambil harta kami.” Akibatnya kamu menolakku karenanya. “Upahku tidak lain hanyalah dari Allah belaka”, maksudnya, aku tidak menginginkan pahala dan balasan kecuali dari Allah. Dan juga aku tidak memerintahkanmu lalu aku menyelisihinya, akan tetapi “aku disuruh supaya aku termasuk golongan orang-orang yang berserah diri (kepadaNya).” Aku adalah orang pertama yang masuk dan melakukan apa yang aku perintahkan kepada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 72: Sehingga kamu menolaknya dengan alasan, bahwa aku berdakwah dengan maksud diberi imbalan darimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 72",
    "description": "Maka jika kamu berpaling dari peringatanku, aku tidak meminta imbalan sedikit pun darimu sebagai upah dakwahku. Imbalanku tidak lain hanyalah dari Allah, karena aku sampaikan dakwah dan peringatan ini semata-mata karena Allah dan aku diperintah agar aku termasuk golongan orang-orang muslim, yakni golongan yang berserah diri kepada-Nya. Berbagai tantangan yang disampaikan nabi nuh sebagaimana tergambar pada ayat di atas, sama sekali tidak berpengaruh terhadap kaumnya. Kemudian mereka tetap mendustakannya, yakni mendustakan nabi nuh, lalu kami selamatkan dia, nabi nuh dan orang yang bersamanya di dalam kapal, dan kami jadikan mereka yang selamat itu sebagai khalifah, yakni generasi pengganti orang yang kafir, dan kami tenggelamkan orang yang mendustakan ayat-ayat kami. Maka perhatikanlah, ambillah sebagai pelajaran bagaimana kesudahan orang-orang yang diberi peringatan itu, agar peristiwa yang demikian tidak terjadi pada kalian."
  }
]