[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tetapi kaum nuh mendustakan nuh terkait berita-berita yang dia sampaikan kepada mereka Dari Allah. Lalu kami menyelamatkan dia dan orang-orang yang bersamanya di dalam kapal, dan kami menjadikan mereka pengganti orang-orang yang mendustakan di muka bumi, dan kami tenggelamkan orang-orang yang mengingkari hujjah-hujah kami. Maka renungilah (wahai rasul), bagaimanakah kesudahan orang-orang yang telah diperingatkan oleh rasul mereka dengan siksaan Allah dan hukumNYa?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Kemudian kaumnya mendustakannya dan tidak percaya kepadanya. Maka Kami selamatkan dia (Nuh -'alaihissalām-) beserta orang-orang yang beriman bersamanya di dalam bahtera. Dan Kami jadikan mereka sebagai generasi penerus bagi umat-umat sebelum mereka. Sedangkan orang-orang yang mendustakan ayat-ayat dan hujah-hujah yang dibawanya Kami binasakan dengan terjangan air bah. Maka renungkanlah -wahai Rasul- bagaimana akhir perjalanan orang-orang yang diberi peringatan oleh Nuh -'alaihissalām- tetapi mereka enggan beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Allah menjelaskan perhatian-Nya bagi Nabi Nuh dan para pengikutnya dari kalangan orang-orang beriman setelah dakwah selama 950 tahun namun kaumnya tetap mendustakannya: “Dengan keagungan dan kekuasaan Kami, Kami selamatkan Nuh dan orang-orang beriman yang bersamanya dalam perahu, dan Kami jadikan mereka khalifah-khalifah yang memakmurkan bumi. Dan Kami tenggelamkan orang-orang yang mendustakan hujjah dan bukti Kami dengan banjir bandang. Dan lihatlah bagaimana akhir dari orang-orang yang diperingatkan Nuh dari azab?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. فَكَذَّبُوهُ (Lalu mereka mendustakan Nuh) Yakni mereka terus mendustakannya dan tetap memusuhi. فَنَجَّيْنٰهُ وَمَن مَّعَهُۥ(maka Kami selamatkan dia dan orang-orang yang bersamanya) Yakni bersama orang-orang beriman yang mengikuti agamanya dan tetap istiqamah meski mendapat tantangan dan permusuhan dari kaumnya. فِى الْفُلْكِ(di dalam bahtera) Yakni perahu yang Allah perintahkan nabi Nuh untuk membuatnya. وَجَعَلْنٰهُمْ خَلٰٓئِفَ(dan Kami jadikan mereka itu pemegang kekuasaan) Yakni penguasa di bumi yang mengganti orang-orang yang telah ditenggelamkan. وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَا ۖ( dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami) Yaitu orang-orang kafir yang durhaka kepada Nabi Nuh. Allah menenggelamkan mereka dengan banjir bandang. فَانظُرْ كَيْفَ كَانَ عٰقِبَةُ الْمُنذَرِينَ(Maka perhatikanlah bagaimana kesesudahan orang-orang yang diberi peringatan itu) Ini merupakan penyenang hati bagi Rasulullah dan ancaman bagi orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73 Lalu mereka mendustakan Nuh padahal setelah mereka mendapatkan bukti, maka mereka berhak mendapatkan azab. Lalu Kami selamatkan dia dan orang-orang yang bersamanya di dalam bahtera yang diperintahkan oleh Allah dari azab tenggelam. Jumlah mereka itu 80. Kami jadikan mereka pemegang kekuasaan untuk memakmurkan bumi dan penduduknya setelah orang-orang kafir dihancurkan dengan banjir bandang. dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami dengan banjir bandang. Maka perhatikanlah wahai Nabi, bagaimana kesesudahan, akibat dan kebinasaan orang-orang yang diberi peringatan itu kemudian mendustakan, Seperti itulah yang Kami lakukan terhadap orang yang berdusta. Ini bermaksud melapangkan jiwa rasul dan mengancam orang musyrik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mendustakannya. Lalu Kami menyelamatkan dia dan orang-orang yang bersamanya di dalam bahtera dan Kami menjadikan mereka sebagai generasi penerus} penerus bagi orang yang dihancurkan dengan banjir {dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami. Perhatikanlah bagaimana hukuman orang-orang yang diberi peringatan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. “Lalu mereka mendustakan NUh”, setelah dia menyeru mereka siang dan malam, diam-diam dan terang-terangan, dan seruannya hanya menyebabkan mereka semakin menjauh. Maka Kami menyelamatkannya dan orang-orang yang bersamanya di dalam bahtera”, yang Kami perintahkan kepadanya agar dia membuatnya dengan mata (pengawasan) Kami, dan Kami katakan kepadanya, “JIka dapur pengapian telah mendidih maka angkutlah masing-masing jenis binatang satu pasang dan keluargamu (kecuali orang yang terkenal ketetapan (takdir) terdahulu) serta orang-orang yang beriman,” maka Nuh melaksanakannya lalu Allah menurunkan hujan deras, memancarkan mata air lalu air itu bertemu sesuai dengan perintah yang ditakdirkan, maka Kami membawanya di atas bahtera yang berjalan dengan mata (pengawasan) Kami. “Dan Kami jadikan mereka itu memegang kekuasaan”, di bumi setelah orang-orang yang mendustakan dibinasakan kemudian Allah memberkahi anak cucunya dan menjadikan anak cucunya yang tersisa serta menebarkan mereka di muki bumi. “Dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami,” setelah penjelasan itu dan penegakkan bukti. “Maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.” Yakni kebinasaan yang menghinakan dan laknat yang terus menerus atas mereka pada setiap abad yang datang sesudah mereka. Kamu tidak mendengar pada mereka kecuali cercaan dan kamu tidak melihat kecuali celaan dan cibiran. Hendaknya orang-orang yang mendustakan itu mewaspadai azab siksa dan kebinasaan yang menimpa mereka, sebagaimana azab telah menimpa orang-orang yang mendustakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 73: Setelah Beliau berdakwah di malam dan siang, secara sembunyi dan terang-terangan. Yang diperintahkan Allah kepadanya untuk dibuat, lalu diperintahkan kepadanya agar ia memasukkan juga ke dalam kapalnya di samping pengikutnya semua binatang secara berpasang-pasangan. Maka Allah Subhaanahu wa Ta'aala memerintahkan langit untuk menurunkan hujan lebat, dan bumi untuk memancarkan air, hingga timbullah banjir yang besar. Mereka dibinasakan, mendapat laknat, dan tidak disebut-sebut selain celaan. Oleh karena itu, hendaknya orang-orang yang mendustakan rasul takut jika mereka mengalami seperti yang dialami orang-orang terdahulu yang binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 73",
    "description": "Berbagai tantangan yang disampaikan nabi nuh sebagaimana tergambar pada ayat di atas, sama sekali tidak berpengaruh terhadap kaumnya. Kemudian mereka tetap mendustakannya, yakni mendustakan nabi nuh, lalu kami selamatkan dia, nabi nuh dan orang yang bersamanya di dalam kapal, dan kami jadikan mereka yang selamat itu sebagai khalifah, yakni generasi pengganti orang yang kafir, dan kami tenggelamkan orang yang mendustakan ayat-ayat kami. Maka perhatikanlah, ambillah sebagai pelajaran bagaimana kesudahan orang-orang yang diberi peringatan itu, agar peristiwa yang demikian tidak terjadi pada kalian. Kemudian setelahnya yakni nabi nuh, kami utus beberapa rasul kepada kaum mereka masing-masing, seperti nabi hud, saleh, ibrahim, lut, dan syuaib, maka rasul-rasul itu datang kepada mereka dengan membawa keterangan yang jelas, agar mereka beriman kepada Allah, tetapi mereka tidak mau beriman karena mereka dahulu, yakni sebelum datangnya keterangan yang nyata, telah biasa mendustakannya. Demikianlah kami mengunci hati orang-orang yang melampaui batas, karena mereka telah memilih tidak mau menerima kebenaran."
  }
]