[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami utus setelah nuh rasul-rasul kepada kaum-kaum mereka (seperti hud, shaleh, Ibrahim, luth, syu’aib, dan lain-lain). Tiap-tiap rasul datang kepada kaumnya dengan membawa mukjizat-mukjizat yang membuktikan kebenaran kerasulannya dan kebenaran apa-apa yang dia dakwahkan kepada mereka. Namun mereka benar-benar tidak mau membenarkan dan mengamalkan risalah yang didustakan oleh kuam nuh dan begitu juga orang-orang sebelum mereka dari umat-uamt yang telah berlalu. Dan sebagaimana kami telah mengunci hati kaum-kaum tersebut sehingga tetap tidak akan beriman, demikian pula akan Dia akam mengunci hati orang-orang yang serupa dengan mereka dari orang-orang yang datang setelah mereka yang melakukan perbuatan melampaui batas aturan-aturan Allah, menyelisihi ajakan yang diserukan rasul-rasul mereka kepada mereka, berupa perintah untuk taat kepada Allah, sebagai hukuman bagi mereka atas perbuatan-perbuatan maksiat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Setelah sekian lama sesudah masa Nuh -'alaihissalām- itu Kami mengutus para Rasul kepada kaumnya masing-masing. Para Rasul itu datang kepada mereka dengan membawa mukjizat-mukjizat dan bukti-bukti yang nyata. Tetapi kaum-kaum itu sama sekali tidak tertarik untuk beriman, karena semenjak dahulu mereka bersikeras untuk mendustakan para Rasul. Maka Allah mengunci mati hati mereka. Dan sebagaimana Kami telah mengunci mati hati para penentang rasul-rasul di masa lalu, Kami juga mengunci mati hati orang-orang kafir yang melampaui batas-batas Allah dengan kekafirannya kapanpun dan dimanapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Kemudian setelah Nuh, Kami utus para rasul kepada kaum mereka, seperti Hud, Shalih, Ibrahim, Luth, dan Syuaib. Mereka datang kepada kaum mereka dengan membawa mukjizat dan bukti yang jelas; namun mereka tidak mempercayai mukjizat dan bukti-bukti tersebut, mereka mendustakan para rasul dan tidak takut terhadap azab yang telah menimpa umat-umat terdahulu. Sebagaimana hati orang-orang terdahulu ditutup, Kami menutup hati orang-orang yang melanggar hukum-hukum Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. ثُمَّ بَعَثْنَا مِنۢ بَعْدِهِۦ (Kemudian sesudahnya, Kami utus) Yakni setelah Nabi Nuh. رُسُلًا(beberapa rasul) Seperti Nabi Hud, Shalih, Ibrahim, Luth, dan Syuaib. فَجَآءُوهُم بِالْبَيِّنٰتِ (maka rasul-rasul itu datang kepada mereka dengan membawa keterangan-keterangan yang nyata,) Yakni dengan mukjizat-mukjizat dan syariat-syariat. فَمَا كَانُوا۟ لِيُؤْمِنُوا۟( tetapi mereka tidak hendak beriman) Yakni mereka tidak beriman, namun tetap dalam kekafiran mereka. بِمَا كَذَّبُوا۟ بِهِۦ مِن قَبْلُ ۚ( karena mereka dahulu telah (biasa) mendustakannya) Mereka tidak diberi taufik untuk beriman kepada apa yang dibawa oleh para rasul Allah karena kebebalan mereka dalam mendustakan para rasul. Atau maknanya adalah kaum-kaum dari para rasul setelah nabi Nuh itu tidak beriman kepada apa yang didustakan oleh kaum Nabi Nuh sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74 Kemudian sesudah Nuh, Kami utus beberapa rasul kepada kaum mereka masing-masing seperti Hud, Saleh, Ibrahim, Luth, dan Syu’aib dengan membawa bukti-bukti tentang kebenaran kenabian mereka berdua, tetapi mereka tidak mau beriman karena mereka dahulu telah biasa mendustakannya dan tetap dalam kekafiran. Demikianlah Kami mengunci mati hati orang-orang yang melampaui batas dalam kekufurasn dan pendustaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami mengutus setelahnya} setelah Nuh {beberapa rasul kepada kaum mereka, lalu rasul-rasul itu datang kepada mereka dengan bukti-bukti yang nyata} dalil-dalil dan bukti-bukti {tetapi mereka tidak mau beriman karena mereka telah mendustakannya sebelumnya} karena pertama-tama mereka bergegas untuk mendustakan para rasul {Demikianlah Kami mengunci} mengunci {hati orang-orang yang melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Maksudnya, kemudian Kami mengutus sesudah Nuh “beberapa rasul kepada kaum mereka (masing-masing)”, yang mendustakan (ajaran Nuh), kemudian rasul-rasul itu menyeru kepada hidayah dan memperingatkan sebab-sebab kebinasaan. “Maka rasul-rosul dating kepada mereka dengan membawa buktinyata\" Maksudnya semua Nabi menopang dakwahnya dengan ayat-ayat yang yang menunjukkan kebenaran sesuatu yang didakwahkannya, “tetapi mereka tidak hendak beriman karena mereka dahulu telah (biasa) mendustakannya.” Maksudnya, bahwa Allah menghukum mereka di mana mereka didatangi oleh seorang rasul tetapi mereka segera menyambutnya dengan pendustaan, Allah mengunci hati mereka dan menghalangi keimanan setelah sebelumnya mereka masih mungkin mendapatkannya, sebagaimana Firman Allah \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.\" (Al-An’Am:110). Oleh karena itu, Allah berfirman di sini “Demikianlah Kami mengunci mati hati orang-orang yang melampaui batas.” Maksudnya, Kami menutupnya dengan rapat sehingga tidak ada kebaikan yang sampaii kepadanya. Allah tidak menzhalimi diri mereka dengan menolak mendustakan kebenaran yang datang kepada mereka pertama kali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 74: Yang mengajak mereka kepada petunjuk dan menjauhi segala sebab yang dapat membinasakan. Maksudnya adalah bahwa mereka sebelum diutus rasul biasa mendustakan yang benar. Bisa juga maksudnya, bahwa ketika rasul datang kepada mereka, kemudian mereka segera mendustakannya, maka Allah menghukum mereka dengan mengunci hati mereka dan dihalangi-Nya mereka dari beriman setelah mereka mampu melakukannya. Sehingga tidak bisa dimasuki oleh kebaikan dan keimanan. Allah tidaklah menzalimi mereka, akan tetapi merekalah yang menzalimi diri mereka dengan menolak kebenaran ketika datang dan mendustakannya pertama kali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 74",
    "description": "Kemudian setelahnya yakni nabi nuh, kami utus beberapa rasul kepada kaum mereka masing-masing, seperti nabi hud, saleh, ibrahim, lut, dan syuaib, maka rasul-rasul itu datang kepada mereka dengan membawa keterangan yang jelas, agar mereka beriman kepada Allah, tetapi mereka tidak mau beriman karena mereka dahulu, yakni sebelum datangnya keterangan yang nyata, telah biasa mendustakannya. Demikianlah kami mengunci hati orang-orang yang melampaui batas, karena mereka telah memilih tidak mau menerima kebenaran. Setelah pada ayat sebelumnya dijelaskan kisah nabi nuh dan para rasul terdahulu, lalu dalam ayat ini dijelaskan kisah nabi musa. Kemudian setelah mereka, yakni para rasul terdahulu, kami utus musa dan harun kepada fir'aun dan para pemuka kaumnya, dengan membawa tandatanda kebesaran dan kekuasaan kami. Ternyata mereka menyombongkan diri, yakni mendustakan dan enggan menerima kebenaran, dan mereka adalah orang-orang yang berdosa."
  }
]