[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika telah datang kepada fir’aun dan kaumnya kebenaran yang dibawa Musa , mereka berkomentar, ”sesungguhnya mukjizat-mukjizat nyata yang dibawa oleh musa hanyalah merupakan sihir yang nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Kemudian tatkala kebenaran yang dibawa oleh Musa dan Harun -'alaihimassalām- sampai kepada Fir'aun dan pembesar-pembesar kaumnya, mereka berkata terhadap mukjizat-mukjizat yang menunjukkan kebenaran apa yang dibawa Musa, “Sesungguhnya ia adalah benar-benar sihir dan bukan sesuatu yang nyata.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Ketika Musa datang kepada mereka dengan kebenaran dari Allah, berupa mukjizat tongkat dan tangan yang bersinar; para pemimpin kekafiran berkata: “Ini jelas adalah sihir.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76 Tatkala kebenaran yang dibawa Musa dari sisi Kami telah datang kepada Fir’aun, mereka berkata: “Sesungguhnya ini adalah sihir yang nyata”, dengan penuh kesombongan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika telah datang kepada mereka kebenaran dari sisi Kami, mereka berkata,“Sesungguhnya ini benar-benar sihir yang nyata.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. “Dan tatkala telah datang kepada mereka kebenaran dari sisi Kami,” yang merupakan kebenaran terbesar dan teragung. Ia dari sisi Allah yang mana seluruh leher tunduk kepada keagunganNYa. Dia adalah Rabb semesta alam yang mendidik makhlukNya dengan nikmat-nikmatNya. Tatkala kebenaran dari Allah datang kepada mereka melalui Musa, maka mereka menolaknya dan tidak menerimanya. “Mereka berkata, ‘Sesungguhnya ini adalah sihir yang nyata’.” Mereka merasa tidak cukup –semoga Allah menimpakan keburukan kepada mereka- dengan berpaling dan menolak lebih dari itu, mereka menjadikannya sebagai kebatilan yang paling batil yaitu sihir yang hakikat sebenarnya adalah bualan, bahkan mereka menjadikannya sebagai sihir yang jelas lagi nyata padahal sebenarnya ia adalah kebenaran yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 76: Maksudnya tanda-tanda kekuasaan Allah. Melalui tangan Nabi Musa ‘alaihis salam, di mana tongkatnya bisa berubah menjadi ular yang besar dan tangannya bercahaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 76",
    "description": "Maka ketika telah datang kepada mereka kebenaran mukjizat dari sisi kami sebagai bukti kebenaran risalah nabi musa dan nabi harun, mereka berkata dengan angkuh dan sombong, ini benar-benar sihir yang nyata. Mendengar tuduhan firaun dan pengikutnya, maka nabi musa berkata, pantaskah kamu mengatakan terhadap kebenaran ketika ia datang kepadamu, 'sihirkah ini' sungguh sangat tidak pantas. Padahal kamu sudah tahu bahwa para pesihir itu tidaklah mendapat kemenangan, kapan pun dan di manapun."
  }
]