[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun dan para pembesarnya berkata kepada Musa , apakah kamu datang untuk membelokan kami dari apa yang kami dapati nenek moyang kami melakukannya berupa menyembah selain Allah, lalu kamu dan harun menggapai keagungan dan kekuasaan di bumi mesir? Dan kami tidaklah mengakui bahwa kalian berdua adalah rasul Allah yang diutus kepada kami agar kami hanya beribadah kepadaNYa semata, tiada sekutu bagiNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Kaum Fir'aun berkata kepada Musa -'alaihissalām-, \"Apakah engkau datang kepada kami dengan membawa sihir ini untuk memalingkan kami dari agama warisan leluhur kami, kemudian engkau dan saudaramu menjadi raja? Kami tidak percaya kepada kalian berdua, wahai Musa dan Harun, bahwa kalian berdua adalah utusan Allah kepada kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Fir’aun dan para pengikutnya berkata kepada Musa: “Apakah kamu mendatangi kami agar dapat memalingkan kami dari tuhan-tuhan kami yang telah disembah oleh nenek moyang kami? Sehingga kamu dan Harun dapat memiliki kekuasaan di negeri Mesir? Kami sama sekali tidak mempercayai apa yang kalian datangkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. قَالُوٓا۟ أَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَيْهِ ءَابَآءَنَا (Mereka berkata: “Apakah kamu datang kepada kami untuk memalingkan kami dari apa yang kami dapati nenek moyang kami mengerjakannya) Yakni apakah kamu ingin memalingkan kami dari penyembahan kepada berhala-berhala yang kami dapatkan dari nenek moyang kami. الْكِبْرِيَآءُ (dan supaya kamu berdua mempunyai kekuasaan) Mereka menjadikan sebab tidak menerima dakwah nabi Musa karena dua hal; pertama, mereka berpegang pada apa yang mereka dapatkan dari nenek moyang mereka, dan yang kedua, ketamakan mereka terhadap kekuasaan, karena jika ia menerima dakwah nabi Musa maka urusan umatnya akan diserahkan kepada nabi Musa sehingga mereka tidak memiliki kekuasaan penuh, sebab mengatur urusan manusia dengan agama menghilangkan kekuasaan para raja dalam urusan kenegaraan dan adat istiadat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78 Fir’aun dan kaumnya berkata: “Apakah kamu datang kepada kami untuk memalingkan kami dari ajaran yang telah dilakukan nenek moyang kami, dan supaya kamu berdua mempunyai kekuasaan di muka bumi? Kami tidak akan mempercayai kamu berdua”.Mereka menolak risalah karena 2 hal yaitu berpegang teguh pada kepercayaan nenek moyang dan menginginkan kekuasaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah kamu datang kepada kami untuk memalingkan kami} memalingkan kami {dari apa yang kami dapati pada nenek moyang kami dan agar kalian berdua mempunyai kekuasaan} kekuasaan {di bumi} negeri Mesir {Kami tidak akan beriman kepada kalian berdua.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. “Mereka berkata”, kepada Musa, sebagai bentuk penolakan ucapannnya dengan apa yang mana dia tidak mampu untuk menolaknya. “Apakah kamu datang kepada kami untuk memalingkan kami dari apa yang kami dapati nenek moyang kami mengerjakannya.” Maksudnya, apakah kamu datang kepada kami untuk menghalangi kami dari syirik dan ibadah kepada selain Allah yang kami dapati turun temurun dari nenek moyang kami dan memerintahkan kami agar menyembah Allah semata tanpa sekutu bagiNya. Mereka menjadikan ucapan nenek moyang mereka yang sesat sebagai hujjah yang dengannya mereka menolak kebenaran yang dibawa oleh Musa. Dan FirmanNya, “Dan supaya kamu berdua mempunyai kekuasaan di muka bumi?’ maksudnya, kamu datang kepada kami agar kamu menjadi pemimpin dan mengusir kami dari kebodohan mereka dan provokasi kepada orang awam agar memusuhi Musa dan tidak beriman kepadanya. Ini tidak dijadikan sebagai hujjah oleh orang yang mengetahui hakikat dan mampu membedakan perkara-perkara, karena hujjah tidak ditolak kecuali dengan hujjah dan bukti. Adapun orang yang hadir membawa kebenaran lalu kebenarannya ditolak dengan ucapan yang seperti ini maka itu menunjukkan kelemahan orang yang menghadirkannya untuk mendatangkan argument yang bisa menolak pendapat lawan dialognya, karena seandainya dia mempunyai hujjah, niscaya dia menurunkannya dan tidak mengucapkan, “Tujuanmu adalah begini-begini, atau targetmu adalah ini dan ini.” Sama saja dia jujur atau dusta dalam ucapannya dan pemberitaannya tentang maksud lawannya, padahal setiap orang yang mengetahui keadaan Musa dan ajaran yang didakwahkannya, niscaya dia akan mengetahui bahwa dia sama sekali tidak mememiliki tujuan berkuasa di muka bumi, tujuan Musa sama dengan tujuan para rasul yang lain: memberi petunjuk dan membimbing manusia kepada apa yang bermanfaat bagi mereka. Akan tetapi perkara sebenarnya adalah apa yang mereka ungkapkan sendiri dengan ucapannya, “Kami tidak akan mempercayai kamu berdua.” Sebagai bentuk pengingkaran dan kesombongan bukan karena kebatilan apa yang dibawa oleh Musa dan Harun, tidak pula Karena kerancuan padanya dan tidak pula karena makna-makna lainnya kecuali karena kezhaliman, permusuhan dan kekuasaan yang mereka tuduhkan kepada Musa dan Harun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 78: Dan beralih hanya menyembah Allah saja. Perkataan ini merupakan pengelabuan dari mereka agar orang-orang awam mendukung mereka memusuhi Nabi Musa ‘alaihis salam dan tidak beriman kepadanya. Membantah kebenaran dengan perkataan yang seperti ini menunjukkan tidak mampunya mereka membantah hujjah lawannya, karena kalau ia memang memiliki hujjah, tentu tidak beralih mengatakan, “Maksudmu adalah begini dan begitu!” padahal orang yang mengetahui keadaan Nabi Musa ‘alaihis salam serta dakwahnya akan mengetahui, bahwa ia tidak bermaksud memperoleh kekuasaan di muka bumi, bahkan maksud Beliau sama dengan saudaranya yang lain dari kalangan para rasul, yaitu menunjukkan manusia dan mengarahkan mereka kepada hal yang bermanfaat bagi mereka. Karena sombong dan keras kepala, bukan karena batilnya apa yang dibawa Musa dan Harun atau karena samarnya apa yang dibawa keduanya. Bahkan ucapannya tidak lain karena zhalim dan aniaya serta ingin tetap berkuasa di bumi yang mereka tuduhkan kepada Musa dan Harun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 78",
    "description": "Setelah firaun dan kaumnya mendengar jawaban nabi musa, lalu mereka berkata, apakah engkau, wahai musa, datang kepada kami untuk memalingkan kami dari apa yang kami dapati nenek moyang kami mengerjakannya, yakni menyembah berhala, dan agar kamu berdua mempunyai kekuasaan di bumi, yakni di negeri mesir' kami tidak akan mempercayai kamu berdua. Setelah pada ayat sebelumnya dijelaskan penolakan firaun dan kaumnya terhadap dakwah nabi musa, lalu pada ayat ini dijelaskan tentang langkah yang diambil oleh firaun untuk menantang nabi musa dan fir'aun berkata kepada pemuka kaumnya, datangkanlah kepadaku semua penyihir yang ulung untuk melawan musa!"
  }
]