[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "mereka itu, tempat tinggal mereka adalah neraka jahanam di akhirat, sebagai bentuk balasan atas apa yang mereka perbuatan di dunia, berupa dosa-dosa dan kesalahan-kesalahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Orang-orang yang memiliki sifat-sifat seperti itu tempat kembalinya adalah Neraka, disebabkan kekafiran mereka dan sikap mereka yang mendustakan adanya Hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أُو۟لٰٓئِكَ مَأْوَىٰهُمُ (mereka itu tempatnya) Yakni tempat tinggal mereka. النَّارُ بِمَا كَانُوا۟ يَكْسِبُونَ(ialah neraka, disebabkan apa yang selalu mereka kerjakan) Yakni karena kekafiran dan keingkaran mereka terhadap hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Mereka itu tempat tinggalnya adalah neraka akibat perbuatan mereka berupa kekufuran, kemaksiatan dan pendustaan terhadap akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{mereka itu tempatnya adalah neraka karena apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Mereka itu”, dengan sifat-sifat tersebut “tempatnya ialah neraka.” Yakni tempat tinggalnya untuk selama-lamanya yang tidak mereka tinggalkan “disebabkan apa yang selalu mereka kerjakan”, berupa kekufuran, kesyirikan dan berbagai macam kemaksiatan. Manakala Dia menyebutkan hukuman mereka, maka Dia menyebutkan pahala orang-orang yang taat, Dia berfirman,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 8: Berupa syirk dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 8",
    "description": "Maka mereka itu tempatnya di neraka, karena apa yang telah mereka lakukan selama hidup di dunia, berupa kedurhakaan kepada Allah. Kebalikan dari orang-orang yang durhaka kepada Allah dan hanya mencintai kehidupan dunia adalah orang-orang yang beriman dan beramal saleh untuk bekal kehidupan di akhirat. Sesungguhnya orang-orang yang beriman dan sebagai wujud keimanan tersebut mereka mengerjakan amal kebajikan sebagaimana petunjuk yang disebutkan di dalam alqur'an, niscaya mereka diberi petunjuk oleh tuhan karena keimanan mereka. Mereka di dalam surga yang penuh kenikmatan yang tiada tara, tiada pernah terkurangi dan mengalir di bawahnya sungai-sungai."
  }
]