[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika tukang sihir-sihir itu datang kepada fir’aun, Musa berkata kepada mereka, ”lemparkanlah oleh kalian ke tanah apa yang ada pada kalian dari tali-tali dan tongkat-tongkat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Setelah mereka mendatangkan para penyihir ke hadapan Fir'aun, maka Musa -'alaihissalām- dengan penuh percaya diri akan menangan berkata kepada mereka, \"Lemparkanlah -wahai para penyihir- apa yang hendak kalian lemparkan!\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. فَلَمَّا جَآءَ السَّحَرَةُ قَالَ لَهُم مُّوسَىٰٓ أَلْقُوا۟ مَآ أَنتُم مُّلْقُونَ (Maka tatkala ahli-ahli sihir itu datang, Musa berkata kepada mereka: “Lemparkanlah apa yang hendak kamu lemparkan) Yakni lemparlah ke atas tanah tali-tali dan tongkat kalian. Nabi Musa mengatakan ini agar mereka mulai melempar tongkat mereka, dan Nabi Musa mengetahui bahwa yang mereka lakukan hanyalah khayalan, dan sesungguhnya tongkat dan tali mereka tidak berubah menjadi ular yang sebenarnya. Dan mengalahkan tali dan tongkat mereka akan menghancurkan sihir mereka, sehingga terlihat kelemahan mereka oleh orang-orang yang menyaksikan, setelah orang-orang melihat bahwa Nabi Musa masih membawa tongkatnya sedangkan mereka tidak melihat tali dan tongkat para penyihir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80 Maka tatkala ahli-ahli sihir itu datang, di area pertandingan Musa berkata kepada mereka: “Lemparkanlah apa yang hendak kalian lemparkan, yaitu alat-alat sihir”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika para penyihir itu datang, Musa berkata kepada mereka,“Lemparkanlah apa yang hendak kalian lemparkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “Maka tatkala ahli-ahli sihir itu datang,” untuk bertarung melawan Musa, “Musa berkata kepada mereka, ‘Lemparkanlah apa yang hendak kamu lemparkan’.” Yakni apa pun yang kamu inginkan tanpa harus aku tentukan, hal itu karena Musa yakin dapat mengalahkan mereka, tak peduli mereka dan apa yang mereka hadirkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 80: Untuk mengalahkan Musa. Setelah para penyihir berkata kepadanya, “Kamukah yang melempar lebih dulu ataukah kami yang melempar?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 80",
    "description": "Maka ketika para penyihir itu sudah datang, mereka berkata kepada nabi musa, engkau atau kami yang melemparkan terlebih dahulu' nabi musa berkata kepada mereka, lemparkanlah terlebih dahulu apa yang hendak kamu lemparkan! (lihat: surah thaha/20: 65-66) setelah mereka melemparkan tali temali dan tongkat yang tampak seperti ular lalu musa berkata, apa yang kamu lakukan itu, itulah sihir, sesungguhnya Allah akan menampakkan kepalsuan sihir itu, yakni melenyapkannya. Sungguh, Allah tidak akan membiarkan terus berlangsungnya pekerjaan orang yang berbuat kerusakan."
  }
]