[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesudah mereka melemparkan tali-tali dan tongkat-tongkat mereka, Musa berkata kepada mereka, ”sesungguhnya apa yang telah kalian datangkan dan telah kalian lemparkan itu merupakan sihir, dan sesunguhnya Allah akan melenyapkan apa yang kalian datangkan itu dan menggagalkannya. Sesungguhnya Allah tidak memperbaiki perbuatan orang yang berusaha melakukan di muka bumi Allah berupa sesuatu yang dibenciNya dan berbuat kerusakan di dalamnya dengan maksiat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Setelah mereka melempar sihir yang ada pada mereka, Musa -'alaihissalām- berkata kepada mereka, \"Yang kalian tunjukkan itu adalah sihir. Sesungguhnya Allah akan membatalkannya dan menghilangkan pengaruhnya. Sesungguhnya dengan sihir itu kalian berbuat kerusakan di muka bumi. Dan Allah tidak akan memperbaiki perbuatan orang yang gemar membuat kerusakan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Setelah mereka melempar tongkat dan tali mereka, Musa berkata: “Apa yang kalian buat itu jelas adalah sihir, dan buktinya adalah Allah akan melenyapkannya. Allah tidak akan memperbaiki perbuatan orang yang ingin berbuat kerusakan di bumi dengan sihir yang Allah haramkan itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. فَلَمَّآ أَلْقَوْا۟ قَالَ مُوسَىٰ مَا جِئْتُم بِهِ السِّحْرُ ۖ (Maka setelah mereka lemparkan, Musa berkata: “Apa yang kamu lakukan itu, itulah yang sihir) Yakni yang kalian tunjukkan itu adalah sihir, yaitu sesuatu yang batil yang menyihir penglihatan manusia, padahal itu bukanlah kenyataan; berbeda dengan apa yang aku pertunjukkan yang merupakan kenyataan sebab ini merupakan salah satu mukjizat Allah. إِنَّ اللهَ سَيُبْطِلُهُۥٓ ۖ( sesungguhnya Allah akan menampakkan ketidak benarannya) Allah akan melenyapkan apa yang kalian perbuat ini sehingga tampak dihadapan orang-orang kepalsuannya lewat kemenangan mukjizat yang aku perlihatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81 Maka setelah mereka lemparkan, Musa berkata: “Apa yang telah kalian lakukan itu, itulah yang sihir, bukan mukjizat yang dianggap Fir’aun sebagai sihir, sesungguhnya Allah akan menampakkan bahwa yang demikian itu tidaklah benar” Sesungguhnya Allah tidak akan membiarkan orang-yang membuat kerusakan terus menerus melakukan pekerjaannya. Ini adalah dalil bahwa sihir itu merusak, menipu dan membohongi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka melemparkan, Musa berkata,“Apa yang kalian bawa itu adalah sihir. Sesungguhnya Allah akan membatalkannya} akan menampakkan kesia-siaanya kepada manusia {Sesungguhnya Allah tidak membiarkan perbuatan orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “Maka setelah mereka lemparkan”, tambang-tambang dan tongkat-tongkat mereka, maka seolah-olah ia adalah ular yang merayap. “Musa berkata, ‘Apa yang kamu lakukan itu, itulah yang sihir’.” Ini adalah sihir yang besar, walaupun ia besar, akan tetapi “sesungguhnya Allah akan menampakkan ketidakbenarannya. Sesungguhnya Allah tidak akan membiarkan terus berlangsungnya pekerjaan orang-orang yang membuat kerusakan.” Karena mereka menginginkan (dengan hal tersebut) untuk mendukung kebatilan di atas kebenaran, adakah kerusakan yang lebih besar daripada ini? Begitulah setiap perusak melakukan sesuatu lalu dia membuat tipu daya dan makar, perbuatannya pasti batal dan terkikis, meskipun dalam waktu tertentu apa yang dilakukannya cukup laris, akan tetapi ujung-ujungnya adalah habis dan lenyap. Adapun orang-orang yang memperbaiki diri yang mana tujuan dari perbuatan mereka adalah Wajah Allah dan ia adalah perbuatan-perbuatan dan sarana-sarana yang berguna yang diperintahkan, maka Allah memperbaiki perbuatan mereka, menjunjungnya dan menumbuhkannya selalu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 81: Tali dan tongkat mereka, maka tali dan tongkat mereka seakan-akan berubah menjadi ular yang merayap cepat. Karena maksud mereka adalah membela yang batil untuk melawan kebenaran. Demikianlah setiap orang yang mengerjakan kerusakan, meskipun ia telah melakukan tipu daya, membuat makar, dsb. namun perbuatannya akan batal dan hilang meskipun dalam waktu tertentu laris diterima orang, namun lama-kelamaan akan batal dan hilang. Adapun orang-orang yang mengadakan perbaikan, di mana niat mereka dalam amalnya adalah mencari ridha Allah, maka Allah akan memperbaiki amal mereka dan menaikkannya serta mengembangkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 81",
    "description": "Setelah mereka melemparkan tali temali dan tongkat yang tampak seperti ular lalu musa berkata, apa yang kamu lakukan itu, itulah sihir, sesungguhnya Allah akan menampakkan kepalsuan sihir itu, yakni melenyapkannya. Sungguh, Allah tidak akan membiarkan terus berlangsungnya pekerjaan orang yang berbuat kerusakandan Allah akan mengukuhkan yang benar dan melenyapkan yang batil dengan ketetapan-Nya, akan mendatangkan kebenaran untuk menghancurkan kebatilan, walaupun orang-orang yang berbuat dosa tidak menyukainya."
  }
]