[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Alalh mengokohkan kebenaran yang kamu bawa kepada mereka dari sisiNya, lalu meninggikannya dibatas kebatilan mereka dengan kalimat-kalimatNYa dan perintahNYa, walaupun membencinya orang-orang yang berbuat keburukan, para pelaku makasiat-maksiat dari pasukan fir’’aun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Allah mengokohkan dan mengukuhkan kebenaran dengan kalimat-kalimat-Nya yang bersifat keputusan dan kalimat-kalimat-Nya yang bersifat ketentuan syariat, berupa hujah-hujah dan bukti-bukti, walaupun orang-orang kafir yang durjana dari pengikut Fir'aun tidak menyukainya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Allah memenangkan kebenaran atas kebatilan, dan mengokohkannya dengan hujjah-hujjah-Nya yang jelas dan kitab-kitab-Nya yang diturunkan kepada para Nabi; meski orang-orang yang berbuat dosa dengan melakukan sihir itu tidak merelakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَيُحِقُّ اللهُ الْحَقَّ (Dan Allah akan mengokohkan yang benar) Yakni meneguhkan dan mengokohkannya. Pendapat lain mengatakan, maknanya adalah Allah akan menjelaskan dan menerangkan kebenaran. بِكَلِمٰتِهِۦ(dengan ketetapan-Nya) Yang diturunkan dalam kitab-kitab-Nya kepada para Nabi karena kitab-kitab tersebut mengandung berbagai hujjah dan bukti. Atau maknanya adalah perintah Allah al-kauniyah seperti perintah-Nya kepada tongkat Nabi Musa untuk menjadi ular yang memakan semua tali dan tongkat para tukang sihir. وَلَوْ كَرِهَ الْمُجْرِمُونَ(walaupun orang-orang yang berbuat dosa tidak menyukai(nya)) Baik itu Fir’aun dan pengikutnya atau selain mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82 Allah akan mengokohkan yang benar atas kebathilan dan meneguhkannya serta akan meneguhkan perintah, ketetapan dan kalimatNya dalam kitab-kitabNya yang diturunkan atas nabi-nabiNya yang mengandung bukti-bukti, walaupun orang-orang yang berbuat dosa tidak menyukainya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah akan mengukuhkan} memperteguh {kebenaran dengan ketetapan-ketetapanNya, walaupun para pendurhaka tidak menyukainya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Musa melempar tongkatnya, ia pun melahap semua apa yang mereka bikin lalu batallah sihir mereka, lenyaplah kebatilan mereka. “Dan Allah akan mengokohkan yang benar dengan ketetapanNya walaupun orang-orang yang berbuat dosa tidak meyakini(nya).” Maka ahli sihir itu tunduk kepada Musa ketika jelas bagi mereka kebenaran, Firaun mengancam mereka akan menyalib dan memotong tangan dan kaki mereka, tapi mereka tidak gentar dan tetap teguh beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 82: Maka Nabi Musa ‘alaihis salam melempar tongkatnya, lalu tongkat itu menjadi ular yang besar, kemudian menelan semua tali dan tongkat mereka yang nampak seakan-akan ular. Ketika itu batallah sihir mereka dan lenyaplah kebatilan mereka, dan ketika itu pula para pesihir pun tersungkur sujud saat mereka menyaksikan kebenaran Nabi Musa ‘alaihis salam. Kemudian Fir’aun mengancam mereka dengan akan menyalib, memotong tangan dan kaki secara bersilang, namun para pesihir itu tidak peduli dan tetap kokoh di atas keimanannya. Sedangkan Fir’aun, para pemukanya dan para pengikutnya, tetap tidak beriman, bahkan tetap di atas kesesatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 82",
    "description": "Dan Allah akan mengukuhkan yang benar dan melenyapkan yang batil dengan ketetapan-Nya, akan mendatangkan kebenaran untuk menghancurkan kebatilan, walaupun orang-orang yang berbuat dosa tidak menyukainya. Meskipun telah terbukti bahwa yang dibawa nabi musa adalah mukjizat dan yang didatangkan oleh firaun adalah sihir, tetapi hati firaun dan mayoritas kaumnya telah tertutup dari hidayah iman, maka tidak ada yang beriman kepada musa, selain sebagian keturunan dari kaumnya, yakni kaum nabi musa yang dalam keadaan takut bahwa fir'aun dan para pemuka kaumnya akan menyiksa mereka. Dan sungguh, fir'aun itu benar-benar telah berbuat sewenang-wenang di bumi, yakni di mesir dengan menindas bani israil, dan benar-benar termasuk orang yang melampaui batas dalam melakukan kezaliman serta sangat sombong."
  }
]