[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tidak aad yang beriman kepada Musa meski dia membawakan kepada mereka hujjah-hujjah dan dalil-dalil nyata, kecuali sekumpulan keturunan dari kaumnya dari bangsa bani israil, sedang mereka itu takut kepada fir’aun dan para pembesarnya akan menimpakan ujian pada mereka dengan siksaan, sehingga dapat menghalangi mereka dari agama mereka. Dan sesungguhnya fir’aun benar-benar sosok penindas lagi angkuh di muka bumi. Dan sesungguhnya dia termasuk orang-orang yang telah melampaui batas dalam kekafiran dan kerusakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Orang-orang itu bersikukuh untuk berpaling dari ayat-ayat Allah. Tidak ada yang percaya kepada Musa dengan mukjizat-mukjizat nyata dan hujah-hujah yang dibawanya kecuali sejumlah pemuda dari kaumnya, Bani Israil. Namun mereka takut kalau-kalau Fir'aun dan para pembesar kaumnya memalingkan mereka dari iman dengan cara menyiksa mereka jika rahasia (keimanan) mereka terbongkar. Sesungguhnya Fir'aun adalah raja sombong yang berkuasa atas negeri Mesir dan penduduknya. Dan ia termasuk orang yang melampaui batas dalam kekafiran serta pembunuhan dan penyiksaan terhadap kaum Bani Israil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Tidak ada yang mempercayai Musa kecuali sedikit orang dari keturunan Bani Israil, namun mereka takut terhadap kezaliman Fir’aun dan para pengikutnya dengan menyiksa mereka agar meninggalkan agama mereka. Sungguh Fir’aun adalah orang yang angkuh dan berbuat kerusakan di bumi, serta sangat kafir, dan memerangi orang-orang yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَمَآ ءَامَنَ لِمُوسَىٰٓ إِلَّا ذُرِّيَّةٌ مِّن قَوْمِهِۦ (Maka tidak ada yang beriman kepada Musa, melainkan pemuda-pemuda dari kaumnya) Yakni para keturunan bani Israil. Pendapat lain mengatakan, yang dimaksud adalah dari para pengikut Fir’aun, diantaranya adalah istri Fir’aun, Masithah (penyisir rambut putri Fir’aun), dan istri penjaga perbendaharaan Fir’aun. عَلَىٰ خَوْفٍ مِّن فِرْعَوْنَ وَمَلَإِي۟هِمْ(alam keadaan takut bahwa Fir’aun dan pemuka-pemuka kaumnya) Dan para pembesar kaumnya. أَن يَفْتِنَهُمْ ۚ( akan menyiksa mereka) Yakni menyiksa mereka agar meninggalkan agama mereka. وَإِنَّ فِرْعَوْنَ لَعَالٍ فِى الْأَرْضِ (Sesungguhnya Fir’aun itu berbuat sewenang-wenang di muka bumi) Yakni congkak, sombong, dan sewenang-wenang terhadap penduduk Mesir. وَإِنَّهُۥ لَمِنَ الْمُسْرِفِينَ (Dan sesungguhnya dia termasuk orang-orang yang melampaui batas) Melampaui batas dalam kekafiran dan dalam perilakunya membunuh, menyalib, dan melakukan berbagai macam azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83 Maka tidak ada yang beriman kepada Musa, melainkan pemuda-pemuda dari kaum Musa dalam keadaan takut bahwa Fir’aun dan pemuka-pemuka kaumnya akan menyiksa mereka agar keluar dari agamanya. Sesungguhnya Fir’aun telah berbuat sewenang-wenang di tanah Mesir dan terhadap penduduknya. Dan sesungguhnya dia termasuk orang-orang yang banyak berbuat keburukan, kerusakan dan melampaui batas dalam kekufuran dan kesesatan serta mengaku sebagai Tuhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada yang beriman kepada Musa kecuali keturunan dari kaumnya} kaum Bani Israil {karena ketakutan kepada Fir‘aun dan para pemuka kaumnya} pemuka kaumnya {yang akan menyiksa mereka} memalingkan mereka dari agama mereka {Sesungguhnya Fir‘aun benar-benar sewenang-wenang} sangat sombong {di bumi. Sesungguhnya dia benar-benar termasuk orang-orang yang melampaui batas} orang-orang yang melampaui batas dalam hal kekufuran dan kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Adapun Firaun dengan kaum dan pembesarnya serta pengikut mereka maka tidak seorang pun dari mereka yang beriman bahkan mereka terus terlelap di dalam kesesatan mereka. Oleh karena itu Allah berfirman, “Maka tidak ada yang beriman kepada Musa, melainkan pemuda-pemuda dari kaumnya (Musa).” Yakni anak-anak muda Bani Israil yang sabar dalam menghadapi rasa takut karena iman yang bercokol di dalam hatinya “dalam keadaan takut bahwa Firaun dan pemuka-pemuka kaumnya akan menyiksa mereka”, karena agama mereka. “Sesungguhnya Firaun itu berbuat semena-mena di muka bumi”, maksudnya dia mempunyai kekuasaan dan kekuatan maka pantas mereka takut terhadap ancamannya, lebih-lebih karena dia “termasuk orang-orang yang melampaui batas.” Maksudnya, dia termasuk orang-orang yang melampaui batas dalam urusan melanggar dan menganiaya. Hikmah –wallaju a’lam- dari berimannya anak-anak muda dari Bani Israil kepada Musa adalah karena anak-anak muda lebih bisa menerima dan mentaati kebenaran, lain halnya dengan orang-orang tua yang hidup di atas kekufuran, mereka lebih jauh dari kebenaran disebabkan karena keyakinan yang rusak yang ada di dalam hati mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 83: Ada yang mengatakan, bahwa mereka ini adalah para pemuda Bani Israil. Yang demikian adalah karena biasanya yang lebih segera menerima kebenaran adalah para pemuda, berbeda dengan orang-orang yang sudah tua, di mana mereka sudah terbina di atas kekufuran, dalam hati mereka telah mengakar keyakinan-keyakinan yang rusak sehingga sulit dilepaskan. Dengan mengaku sebagai tuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 83",
    "description": "Meskipun telah terbukti bahwa yang dibawa nabi musa adalah mukjizat dan yang didatangkan oleh firaun adalah sihir, tetapi hati firaun dan mayoritas kaumnya telah tertutup dari hidayah iman, maka tidak ada yang beriman kepada musa, selain sebagian keturunan dari kaumnya, yakni kaum nabi musa yang dalam keadaan takut bahwa fir'aun dan para pemuka kaumnya akan menyiksa mereka. Dan sungguh, fir'aun itu benar-benar telah berbuat sewenang-wenang di bumi, yakni di mesir dengan menindas bani israil, dan benar-benar termasuk orang yang melampaui batas dalam melakukan kezaliman serta sangat sombong. Karena pengikutnya nabi musa hidup dalam suasana ketakutan, maka untuk menentramkan mereka, nabi musa berkata, wahai kaumku! apabila kamu beriman kepada Allah, maka bertawakAllah kepada-Nya, yakni berserah diri setelah berusaha secara maksimal, jika kamu benarbenar orang muslim, yakni berserah diri, maka Allah akan memberikan kedamaian dan ketenangan."
  }
]