[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Musa berakata, ”wahai kaumku, bila kalian beriman kepada Allah , dan melaksanakan syariatNya, maka percayalah kepadaNYa, berserah dirilah kalian terhadap perintahNya, dan hanya kepada Allah, hendaknya kalian bertawakal, jika kalian benar-benar tunduk kepadaNYa dengan ketaatan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Musa -'alaihissalām- berkata kepada kaumnya, \"Wahai kaumku! Jika kalian benar-benar beriman kepada Allah maka bersandarlah hanya kepada Allah jika kalian adalah orang-orang yang berserah diri. Karena berserah diri kepada Allah dapat menghindarkan kalian dari keburukan dan mendatangkan kebaikan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Musa berkata kepada para pengikutnya untuk meneguhkan mereka: “Hai kaumku, jika kalian beriman kepada Allah dan mengakui keesaan-Nya dan risalahku, maka bersandarlah kepada Allah semata jika kalian adalah orang-orang yang mentaati perintah dan larangan-Nya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84 Musa berkata: “Hai kaumku, jika kalian beriman kepada Allah, maka bertawakallah kalian hanya kepada-Nya, jika kalian benar-benar orang yang berserah diri, ikhlas dan tunduk kepadaNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Musa berkata,“Wahai kaumku, jika kalian beriman kepada Allah, maka bertawakallah hanya kepadaNya apabila kalian benar-benar orang-orang muslim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. “Musa berkata”, dalam keadaan mewasiatkan kaumnya supaya bersabar, mengingatkan mereka dengan apa mereka meminta pertolongan dalam hal itu, dia berkata, “Hai kaumku, jika kamu beriman kepada Allah,” maka lakukanlah konsekuensi iman, “dan bertakwalah kepadaNya saja jika kamu benar-benar orang yang berserah diri.” Maksudnya, berpeganglah kepadaNya, kembalilah kepadaNya dan mohonlah pertolongan kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 84: Menasehati kaumnya untuk bersabar dan mengingatkan mereka sesuatu yang dapat membantu mereka untuk bersabar. Yakni kerjakanlah tugas keimananmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 84",
    "description": "Karena pengikutnya nabi musa hidup dalam suasana ketakutan, maka untuk menentramkan mereka, nabi musa berkata, wahai kaumku! apabila kamu beriman kepada Allah, maka bertawakAllah kepada-Nya, yakni berserah diri setelah berusaha secara maksimal, jika kamu benarbenar orang muslim, yakni berserah diri, maka Allah akan memberikan kedamaian dan ketenangan. Setelah mendengar nasehat nabi musa lalu mereka berkata, kepada Allah-lah kami bertawakal, menyerahkan segala urusan kami. Mereka berdoa: ya tuhan kami, janganlah engkau jadikan kami sasaran fitnah, yakni siksaan dan gangguan bagi kaum yang zalim,"
  }
]