[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Musa berkata kepadanya, ”Hanya kepada Allah semata, yang tiada sekutu bagiNYa, kami bergantung, dan kepadaNyalah kami serahkan urusan-urusan kami, wahai tuhan kami, janganlah Engkau memenangkan mereka atas kami, sehingga akan menjadi sumber fitnah bagi kami dalam agama kami. Atau diuji orang-orang kafir itu dengan kemenangan mereka, maka mereka akan berkata “seandaunya mereka ada diatas kebenaran tentulah mereka tidak akan kalah”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Mereka menjawab ucapan Musa -'alaihissalām- itu dengan mengatakan, \"Hanya kepada Allah-lah kami berserah diri. Ya Tuhan kami! Janganlah Engkau beri kami penguasa yang zalim. Karena mereka akan memaksa kami keluar dari agama kami dengan cara menyiksa, membunuh dan menghasut kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85-86. Maka mereka berkata: “Hanya kepada Alah kami bertawakkal. Ya Allah, janganlah Engkau jadikan kami dibawah kekuasaan tentara Fir’aun yang kejam, sehingga dapat memaksa kami untuk keluar dari agama kami; dan selamatkanlah kami dengan rahmat-Mu yang luas, dari orang-orang yang mendustakan-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظّٰلِمِينَ (Ya Tuhan kami; janganlah Engkau jadikan kami sasaran fitnah bagi kaum yang zalim) Janganlah Engkau jadikan mereka berkuasa atas kami karena mereka akan mengazab kami untuk mengeluarkan kami dari agama kami. Atau maknanya adalah janganlah Engkau jadikan kami sebagai bahan untuk menguji orang lain, sehingga mereka dapat mengatakan “seandainya mereka diatas kebenaran maka kami tidak akan berkuasa atas mereka dan mengazab mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "85-86 Dari susunan dua ayat ini (85-86) dapat disimpulkan bahwa urusan tawakkal menjadi utama sebelum permohonan doa sebagai peringatan bahwasanya setiap hamba yang memohon kepada tuhannya hendaklah ia bertawakkal terlebih dahulu; sebagai bagian dari sebab terijabahnya do'a."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85 Lalu mereka berkata: “Kepada Allahlah kami bertawakkal! Ya Tuhan kami; janganlah Engkau jadikan kami sasaran fitnah dan janganlah engkau menangkan kaum yang zalim atas kami, sesungguhnya mereka menyiksa kami supaya kami murtad dari agama kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kepada Allahlah kami bertawakal} kami bergantung {Ya Tuhan kami, janganlah menjadikan kami fitnah} tempat cobaan {bagi kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. “Lalu mereka berkata”, sebagai bentuk ketaatan dalam hal ini, “Kepada Allah-lah kami bertawakkal! Ya Rabb kami, janganlah Engkau jadikan kami sasaran fitnah bagi kaum yang zhalim.” Maksudnya, janganlah Engkau menjadikan mereka berkuasa atas kami yang akibatnya mereka akan menyiksa dan mengalahkan kami. Maka Bani Israil pun terfitnah oleh hal itu, dan mereka berkata, “Kalau mereka berpegang teguh pada kebenaran, niscaya mereka tidak dikalahkan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 85: Yakni janganlah Engkau berikan kekuasaan kepada mereka terhadap kami sehingga mereka akan menyiksa kami atau mereka mengalahkan kami sehingga kami terfitnah karenanya dan berkata, “Kalau memang Musa dan Harun berada di atas kebenaran, tentu mereka tidak akan kalah.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 85",
    "description": "Setelah mendengar nasehat nabi musa lalu mereka berkata, kepada Allah-lah kami bertawakal, menyerahkan segala urusan kami. Mereka berdoa: ya tuhan kami, janganlah engkau jadikan kami sasaran fitnah, yakni siksaan dan gangguan bagi kaum yang zalim, setelah mendengar nasehat nabi musa lalu mereka berkata, kepada Allah-lah kami bertawakal, menyerahkan segala urusan kami. Mereka berdoa: ya tuhan kami, janganlah engkau jadikan kami sasaran fitnah, yakni siksaan dan gangguan bagi kaum yang zalim,"
  }
]