[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan selamatkanlah kami dengan rahmatMU dari orang-orang kafir, fir’aun, dan pembesar-pembesarnya. Sebab, sesungguhnya mereka itu memaksa orang-orang mengerjakan pekerjaan-pekerjaan berat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Dan lepaskanlah kami -wahai Tuhan kami- dengan rahmat-Mu dari tangan bala tentara Fir'aun yang kafir. Mereka telah memperbudak dan menindas kami dengan cara menyiksa dan membunuh kami.\""
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "85-86 Dari susunan dua ayat ini (85-86) dapat disimpulkan bahwa urusan tawakkal menjadi utama sebelum permohonan doa sebagai peringatan bahwasanya setiap hamba yang memohon kepada tuhannya hendaklah ia bertawakkal terlebih dahulu; sebagai bagian dari sebab terijabahnya do'a."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86 Ya Tuhan kami, selamatkanlah kami dengan rahmat-Mu dari tipu daya orang-orang yang kafir, yaitu Fir’aun dan kaumnya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Selamatkanlah kami} bebaskanlah kami {dengan rahmatMu dari kaum yang kafir.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. “Dan selamatkanlah kami dengan rahmatMu dari (tipu daya) orang-orang yang kafir.” Agar kami selamat dari kejahatan mereka dan agar kami berdiri tegak di atas agama kami dengan baik sehingga kami mampu menegakkan dan menampakkan syariat tanpa penentang dan pelawan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 86: Agar kami selamat dari kejahatan mereka dan agar kami dapat menjalankan agama kami dan menegakkan syi’ar-syi’arnya tanpa ada yang menghalangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 86",
    "description": "Setelah mendengar nasehat nabi musa lalu mereka berkata, kepada Allah-lah kami bertawakal, menyerahkan segala urusan kami. Mereka berdoa: ya tuhan kami, janganlah engkau jadikan kami sasaran fitnah, yakni siksaan dan gangguan bagi kaum yang zalim, karena pengikutnya nabi musa berdoa dengan tulus, maka Allah mengabulkan doa tersebut. Lalu Allah berfirman: dan kami wahyukan kepada musa dan saudaranya, yakni nabi harun ambillah, yakni bangunlah beberapa rumah di mesir untuk tempat tinggal kaummu berdua dan jadikanlah rumah-rumahmu itu, wahai orang-orang yang beriman, sebagai tempat ibadah kepada Allah dan laksanakanlah salat secara sempurna serta gembirakanlah orang-orang mukmin, bahwa mereka akan diselamatkan dari gangguan firaun dan di akhirat ada balasan surga."
  }
]