[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami wahyukan kepada Musa dan saudaranya, Harun , ”carilah bagi kaummu rumah-rumah di mesir sebagai tempat-tempat tinggal dan tempat persembunyian di mana kalian mempertahankan diri di dalamnya. Dan jadikanlah rumah-rumah kalian itu sebagi tempat kalian mengerjakan shalat disana dalam konddisi mencekam, dan kerjakanlah shalat fardhu pada waktu-waktunya. Dan berilah kabar gembira bagi orang-orang Mukminin yang taat kepada Allah dengan kemenangan yang pasti dan pahala besar dari Allah .”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Dan Kami wahyukan kepada Musa dan saudaranya Harun -'alaihimassalām-, \"Pilihlah beberapa rumah dan jadikanlah rumah-rumah itu sebagai tempat untuk beribadah kepada Allah semata. Buatlah rumah-rumah kalian menghadap ke arah kiblat (Baitul Maqdis) dan laksanakanlah salat secara sempurna. Dan sampaikanlah -wahai Musa- kepada orang-orang mukmin kabar-kabar yang menyenangkan bagi mereka. Yaitu pertolongan dan dukungan Allah bagi mereka, kehancuran musuh mereka dan penetapan mereka sebagai pemimpin di muka bumi.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Dengan keagungan dan kekuasaan Kami, Kami wahyukan kepada Musa dan saudaranya, Harun: “Buatlah rumah-rumah sebagai tempat ibadah bagi kaum Bani Israil, jadikanlah rumah-rumah itu sebagai masjid tempat mendirikan shalat, dan kerjakanlah shalat wajib; dan berilah kabar gembira bagi orang-orang yang beriman kepada Allah dan para rasul-Nya bahwa mereka akan mendapat kehidupan yang baik di dunia, dan surga yang mulia di akhirat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. أَن تَبَوَّءَا لِقَوْمِكُمَا بِمِصْرَ بُيُوتًا (Ambillah olehmu berdua beberapa buah rumah di Mesir untuk tempat tinggal bagi kaummu) Yakni jadikanlah negeri Mesir sebagai rumah ibadah kepada Allah (masjid-masjid) bagi kaum kalian berdua. Terdapat pendapat menyatakan yang dimaksud dengan negeri Mesir dalam ayat ini adalah kota Iskandaria. Namun pendapat lain mengatakan yang dimaksud adalah negeri Mesir kuno yang sekarang terletak di samping Kairo. وَاجْعَلُوا۟ بُيُوتَكُمْ قِبْلَةً(dan jadikanlah olehmu rumah-rumahmu itu tempat shalat) Yakni rumah-rumah yang menghadap kiblat. Pendapat lain mengatakan yang dimaksud adalah agar rumah-rumah yang mereka tinggali dijadikan saling berhadapan. Makna kiblat disini menurut pendapat pertama yakni Baitul Maqdis, dan pendapat lain mengatakan arah Ka’bah. وَأَقِيمُوا۟ الصَّلَوٰةَ ۗ( dan dirikanlah olehmu sembahyang) Yang diperintahkan Allah untuk kalian laksanakan. وَبَشِّرِ الْمُؤْمِنِينَ(serta gembirakanlah orang-orang yang beriman) Yakni wahai Musa berilah kabar gembira kepada orang-orang beriman tentang janji Allah bagi mereka berupa kemenangan dan kekuasaan di muka bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87 Dan Kami wahyukan kepada Musa dan saudaranya: “Ambillah oleh kalian berdua untuk kaum kalian, yaitu Bani Israil beberapa rumah di Mesir untuk tempat Ibadah dan jadikanlah wahai orang-orang mukmin rumah-rumahmu itu tempat shalat yang mana kalian sembahyang di dalamnya dalam keadaan sembunyi supaya kalian aman dari ketakutan, serta dirikanlah dan sempurnakanlah shalat di dalamnya sehingga orang-orang kafir yang menjadi musuh itu tidak menyakiti kalian serta berikanlah kabar gembira bagi orang-orang yang beriman dengan pertolongan di dunia dan surga di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah mewahyukan kepada Musa dan saudaranya,“Ambillah} ambillah {beberapa rumah di Mesir untuk tempat tinggal kaum kalian, jadikanlah rumah-rumah kalian itu kiblat} masjid {dan tegakkanlah shalat. Berilah kabar gembira kepada orang-orang mukmin.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. “Dan Kami wahyukan kepada Musa dan saudaranya”, ketika keadaan pada kaumnya semakin sulit akibat ulah Firaun dan kaumnya, dan mereka berusaha memfitnah mereka dari agama mereka, “kalian berdua ambillah beberapa buah rumah di Mesir untuk tempat tinggal bagi kaummu.” Maksudnya, perintahkan mereka agar mendirikan rumah yang bisa mereka pakai untuk bersembunyi di dalamnya. “Dan jadikanlah rumah-rumahmu itu tempat shalat.” Maksudnya, jadikan rumahmu tempat untuk shalat di mana kamu tidak mampu melakukannya di tempat-tempat ibadah umum. “Dan dirikanlah shalat,” karena ia adalah penolong dalam segala urusan. “Serta gembirakanlah orang-orang yang beriman,” dengan kemenangan, dukungan dan unggulnya agama mereka, karena akan selalu ada kemudahan di balik kesulitan-kesulitan, sesungguhnya bersama kesulitan itu ada kemudahan, ketika keadaannya semakin sulit dan susah maka Allah akan menghilangkan dan memudahkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 87: Yakni ketika situasi semakin memanas, di mana Fir’aun dan pengikutnya hendak menghalangi mereka dari menjalankan shalat. Maksudnya, suruhlah kaummu mengambil rumah-rumah agar dapat bersembunyi. Di sana mereka shalat dalam keadaan aman sebagai pengganti melakukan shalat di gereja dan biara umum. Karena shalat dapat membantu mengatasi berbagai masalah. Dengan kemenangan dan surga, karena setelah kesulitan ada kemudahan, dan ketika keadaan semakin memanas, maka pertolongan Allah semakin dekat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 87",
    "description": "Karena pengikutnya nabi musa berdoa dengan tulus, maka Allah mengabulkan doa tersebut. Lalu Allah berfirman: dan kami wahyukan kepada musa dan saudaranya, yakni nabi harun ambillah, yakni bangunlah beberapa rumah di mesir untuk tempat tinggal kaummu berdua dan jadikanlah rumah-rumahmu itu, wahai orang-orang yang beriman, sebagai tempat ibadah kepada Allah dan laksanakanlah salat secara sempurna serta gembirakanlah orang-orang mukmin, bahwa mereka akan diselamatkan dari gangguan firaun dan di akhirat ada balasan surga. Setelah membuat beberapa rumah untuk tinggal dan ibadah para pengikutnya, nabi musa berkata, yakni berdoa, ya tuhan kami, engkau telah memberikan kepada fir'aun dan para pemuka kaumnya perhiasan yang banyak dan harta kekayaan yang berlimpah dalam kehidupan dunia, tetapi mereka tidak pernah bersyukur kepada-Mu. Ya tuhan kami, dengan anugerah yang banyak itu, mereka justru menyesatkan manusia dari jalan-Mu. Ya tuhan, binasakanlah harta mereka, dan kuncilah hati mereka, karena mereka telah mengunci hati mereka dari kebenaran, sehingga mereka tidak beriman sampai mereka melihat dan merasaka."
  }
]