[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata , ”waahi tuhan kami, Engkau telah memberikan kepada fir’aun dan pembesar-pembesar dari kaumnya perhiasan dari kesenangan dunia, namun mereka tidak bersyukur kepadaMu. justru mereka mempergunakannya untuk menyesatkan dari jalanMU. Wahai tuhan kami, hempaskanlah harta kekayaan mereka, agar mereka tidak dapat memanfaatkannya, dan kuncilah hati mereka sehingga tidak dapat terbuka lapang menerima keimanan, maka mereka tidak akan pernah beriman sampai melihat langsung siksaan yang dahsyat lagi pedih.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Musa -'alaihissalām- berkata, \"Ya Tuhan kami! Sesungguhnya Engkau telah memberikan kemewahan dan perhiasan dunia kepada Fir'aun dan para pemuka kaumnya. Dan Engkau juga memberi mereka kekayaan yang berlimpah di dunia ini, tetapi mereka tidak mau bersyukur kepada-Mu atas apa yang telah Engkau berikan kepada mereka. Bahkan mereka menggunakannya untuk menyesatkan orang dari jalan-Mu. Ya Tuhan kami! Hapuskanlah harta mereka dan musnahkanlah kekayaan mereka. Dan buatlah hati mereka menjadi keras, sehingga mereka tidak akan beriman kecuali ketika mereka menyaksikan azab yang pedih, ketika iman mereka tidak berguna (karena sudah terlambat)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Musa berdoa kepada Allah dengan penuh ketundukan agar membinasakan Fir’aun dan para pengikutnya: “Ya Tuhan kami, dengan rahmat-Mu yang luas, Engkau memberi Fir’aun dan para pemimpin kaumnya perhiasan yang besar dari logam-logam mulia dan harta-harta berharga, sehingga mereka menghalangi manusia dari keimanan kepada-Mu dan menghalangi mereka dari kebenaran. Ya Tuhan kami, hancurkanlah harta benda mereka sehingga mereka tidak dapat memanfaatkannya, dan tutuplah hati mereka agar tidak dapat menerima keimanan, sehingga mereka tidak beriman sampai mereka menyiksakan azab yang pedih.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. و زِينَةً وَأَمْوٰلًا فِى الْحَيَوٰةِ الدُّنْيَا (perhiasan dan harta kekayaan dalam kehidupan dunia) Makna (الزينة) yakni segala sesuatu yang dipakai untuk berhias, seperti pakaian, kendaraan, perhiasan, dipan, senjata, dan lain sebagainya. رَبَّنَا لِيُضِلُّوا۟ عَن سَبِيلِكَ ۖ( ya Tuhan Kami — akibatnya mereka menyesatkan (manusia) dari jalan Engkau) Yakni pada akhirnya mereka memakai kenikmatan-kenikmatan-Mu untuk memalingkan orang lain dari agama yang benar. رَبَّنَا اطْمِسْ عَلَىٰٓ أَمْوٰلِهِمْ(Ya Tuhan kami, binasakanlah harta benda mereka) Ini merupakan doa atas mereka agar Allah melenyapkan dan menghancurkan harta mereka. وَاشْدُدْ عَلَىٰ قُلُوبِهِمْ(dan kunci matilah hati mereka) Yakni jadikanlah hati mereka keras dan tertutup sehingga tidak dapat menerima kebenaran dan tidak pula terbuka bagi keimanan. فَلَا يُؤْمِنُوا۟ حَتَّىٰ يَرَوُا۟ الْعَذَابَ الْأَلِيمَ(maka mereka tidak beriman hingga mereka melihat siksaan yang pedih) Yakni mereka tidak akan beriman sampai menyaksikan diri mereka disiksa oleh Allah, namun ketika itu tidak bermanfaat lagi keimanan mereka. Kemudian Allah mengabulkan doa Nabi Musa sehingga Fir’aun tidak beriman kecuali saat mulai tenggelam, sebagaimana akan disebutkan dalam ayat 90."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88 Musa berkata: “Ya Tuhan kami, sesungguhnya Engkau telah memberikan kekayaan berupa perhiasan dan kekayaan dunia kepada Fir’aun dan pemuka-pemuka kaumnya, ya Tuhan Kami akibat dari itu mereka menyesatkan yang lainnya dari jalan-Mu dan membelokkan manusia dari kebenaran. Ya Tuhan kami, hancurkanlah harta benda mereka dan benarkanlah harta tersebut, dan jadikanlah hati mereka keras dan terkunci sehingga tidak bisa menerima kebenaran sehingga mereka bertambah sewenang-wenang, lalu azab mereka bertambah, sehingga mereka tidak beriman sampai mereka melihat siksa pedih, lalu tidak berguna keimanan mereka saat itu” Musa mengucapkan doa ini saat putus asa dari keimanan mereka yang pilih-pilih sebagaimana yang diminta oleh Nuh AS."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata,“Ya Tuhan kami, sesungguhnya Engkau telah memberikan} memberikan {kepada Fir‘aun dan para pemuka kaumnya perhiasan dan harta kekayaan di kehidupan dunia. Ya Tuhan kami, mereka menyesatkan dari jalanMu. Ya Tuhan kami, binasakanlah harta benda mereka} hancurkanlah hapuskanlah harta mereka {dan kunci matilah hati mereka} kuncilah hati mereka dan keraskanlah itu {sehingga mereka tidak beriman sampai melihat azab yang sangat pedih.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Tatkala Musa melihat Firaun dan kaumnya semakin keras dan menentang, maka dia mendoakan kejelekan atas mereka dan Harun mengamini doanya, dia berkata, “Ya Rabb kami, sesungguhnya Engkau telah memberi kepada Firaun dan pemuka-pemuka kaumnya perhiasan”, yang mereka pakai dari berbagai jenis perhiasan, pakaian, istana-istana yang indah, kendaraan yang mewah dan pelayan-pelayan. “dan harta”, yang banyak, “dalam kehidupan dunia. Ya Rabb kami akibatnya mereka menyesatkan (manusia) dari jalanMu.” Mereka tidak memakai harta mereka kecuali untuk menyesatkan orang-orang dari jalanMu, maka mereka sesat dan menyesatkan. “Ya Rabb kami, binasakanlah harta benda mereka”, maksudnya lenyapkanlah harta mereka dengan cara diludeskan atau ia dijadikan batu yang tidak berguna. “Dan kunci matilah hati mereka.” Yakni jadikanlah ia keras. “Sehingga mereka tidak beriman sampai mereka melihat siksaan yang pedih.” Musa mengatakan ini karena marah kepada mereka di mana mereka berani melanggar hal-hal yang diharamkan Allah, merusak hamba-hamba Allah dan menghalang-halangi dari jalanNya, karena Musa tahu betul bahwa Allah akan menghukum mereka atas perbuatan mereka dengan menutup pintu iman atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 88: Ketika Nabi Musa ‘alahis salam melihat kuatnya keadaan Fir’aun, namun semakin jauhnya dia dari keimanan, maka Nabi Musa ‘alaihis salam mendoakan keburukan terhadap Fir’aun dan Harun mengaminkannya. Berupa perhiasan, pakaian yang bagus, rumah yang indah, kendaraan yang mewah pada waktu itu dan dibantu oleh para pelayan. Yakni harta yang Engkau berikan kepada mereka tidak membuat mereka bersyukur, bahkan mereka menggunakannya untuk menyesatkan manusia dari jalan-Mu; sehingga mereka sesat lagi menyesatkan. Baik dengan membinasakannya atau dengan menjadikannya batu sehingga tidak bermanfaat. Nabi Musa ‘alaihis salam berkata seperti ini karena marah kepada mereka, di mana mereka berani mengerjakan larangan Allah, mengadakan kerusakan, dan menghalangi manusia dari jalan Allah. Demikian juga karena sempurnanya Beliau dalam mengenal Allah, di mana Allah akan menghukum perbuatan tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 88",
    "description": "Setelah membuat beberapa rumah untuk tinggal dan ibadah para pengikutnya, nabi musa berkata, yakni berdoa, ya tuhan kami, engkau telah memberikan kepada fir'aun dan para pemuka kaumnya perhiasan yang banyak dan harta kekayaan yang berlimpah dalam kehidupan dunia, tetapi mereka tidak pernah bersyukur kepada-Mu. Ya tuhan kami, dengan anugerah yang banyak itu, mereka justru menyesatkan manusia dari jalan-Mu. Ya tuhan, binasakanlah harta mereka, dan kuncilah hati mereka, karena mereka telah mengunci hati mereka dari kebenaran, sehingga mereka tidak beriman sampai mereka melihat dan merasakamenjawab doa nabi musa sebagaimana tersebut pada ayat di atas, dia yakni Allah berfirman, sungguh, telah diperkenankan permohonan kamu berdua, sebab itu tetaplah kamu berdua pada jalan yang lurus yang ditunjukkan Allah kepada kamu berdua dan jangan sekali-kali kamu mengikuti jalan orang yang tidak mengetahui jalan yang lurus, sehingga mereka tersesat."
  }
]