[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada mereka berdua, ”Sesungguhnya aku telah mengabulkan permohonan kalian berdua terkait nasib Fir’aun dan para perbesarnya serta harta kekayaan mereka.“ Waktu itu Musalah yang berdoa, sedang Harun mengamini doanya. Dari sini, permohonan doa di nisbatkan kepada mereka berdua. ”Maka tetap teguhlah kalian di atas agama kalian, dan bertahanlah kalian dalam mendakwahi Fir’aun dan kaumnya untuk mentauhidkan Allah dan taat kepadaNya, dan janganlah kalian berdua menempuh jalan orang-orang yang tidak mengetahui hakikat janji dan ancamanKu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Allah berfirman, \"Aku telah mengabulkan doa kalian berdua -wahai Musa dan Harun- untuk keburukan Fir'aun dan para pemuka kaumnya. Maka kuatkanlah hati kalian berdua untuk mempertahankan agama kalian. Dan janganlah kalian berdua berpaling darinya, dan mengikuti jejak orang-orang bodoh yang tidak mengetahui jalan yang benar.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Allah memberi kabar gembira kepada Musa dan Harun, bahwa doa mereka telah dikabulkan; maka tetaplah teguh di atas agama yang benar, dan janganlah kalian mengikuti jalan orang-orang yang tidak mengetahui kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. قَالَ قَدْ أُجِيبَت دَّعْوَتُكُمَا فَاسْتَقِيمَا (AlIah berfirman: “Sesungguhnya telah diperkenankan permohonan kamu berdua, sebab itu tetaplah kamu berdua pada jalan yang lurus) Makna (الاستقامة) yakni memegang teguh agama mereka berdua, dan tidak menyalahi hukum-hukum agama dan seruan kepada Allah. وَلَا تَتَّبِعَآنِّ سَبِيلَ الَّذِينَ لَا يَعْلَمُونَ(dan janganlah sekali-kali kamu mengikuti jalan orang-orang yang tidak mengetahui) Yakni dan janganlah kalian berpaling dari syariat-Nya dengan mengikuti orang yang tidak memiliki pemahaman tentang agama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89 AlIah berfirman kepada Musa dan Harun: “Sesungguhnya permohonan kalian berdua telah Aku kabulkan, oleh sebab itu tetaplah kalian berdua untuk berdakwah dan menunaikannya serta berpegang teguh pada agama dan hukum-hukumnya sampai waktu datangnya azab (bagi orang kafir) dan janganlah sekali-kali kalian berdua mengikuti jalan orang-orang yang bodoh untuk meminta dipercepat azabnya dan tidak percaya terhadap janji Allah SWT”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Sungguh telah dikabulkan permohonan kalian berdua. Maka tetaplah di jalan lurus} maka tetaplah di agamaKu {dan janganlah sekali-kali kalian berdua mengikuti} janganlah kalian menelusuri {jalan orang-orang yang tidak mengetahui.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. “Allah berfirman, ‘Sesungguhnya telah diperkenankan permohonan kamu berdua.” Ini adalah dalil bahwa Musa berdoa sedangkan Harun mengamini doanya, dan bahwa orang yang mengamini doa adalah rekan orang yang berdoa dalam doa itu, “sebab itu tetaplah kamu berdua pada jalan yang lurus”, di atas agama kamu berdua dan teruslah berdakwah. “Dan janganlah sekali-kali kamu mengikuti jalan orang-orang yang tidak mengetahui.” Maksudnya, jangan mengikuti orang-orang bodoh yang sesat yang menyimpang dari jalan yang lurus yang mengikuti jalan Neraka Jahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 89: Disebutkan “kamu berdua” sedangkan yang berdoa adalah Nabi Musa ‘alaihis salam adalah karena Nabi Harun mengaminkan. Hal ini menunjukkan, bahwa orang yang mengaminkan ikut serta dalam doa orang yang berdoa. Di atas agama dan dakwah sampai azab datang kepada mereka. Yakni jalan orang-orang yang jahil lagi sesat, yang menyimpang dari jalan yang lurus lagi menempuh jalan yang mengarah ke neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 89",
    "description": "Menjawab doa nabi musa sebagaimana tersebut pada ayat di atas, dia yakni Allah berfirman, sungguh, telah diperkenankan permohonan kamu berdua, sebab itu tetaplah kamu berdua pada jalan yang lurus yang ditunjukkan Allah kepada kamu berdua dan jangan sekali-kali kamu mengikuti jalan orang yang tidak mengetahui jalan yang lurus, sehingga mereka tersesat. Ayat ini menjelaskan azab yang akan menimpa firaun dan pengikutnya. Dan kami selamatkan bani israil melintasi laut, yakni laut merah, kemudian fir'aun dan bala tentaranya mengikuti mereka, untuk menzalimi dan menindas mereka. Sehingga ketika fir'aun hampir mati tenggelam, karena air hampir menenggelamkannya, dia berkata, aku percaya bahwa tidak ada tuhan melainkan tuhan yang dipercayai oleh bani israil, dan aku termasuk orang-orang muslim, berserah diri, tunduk dan patuh."
  }
]