[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan rasulNya dan mengerjakan amal-amal shalih, Tuhan mereka akan menunjukan mereka ke jalan menuju surge, dan akan mengarahkan mereka menuju amalan-amalan yang menyebabkan mereka masuk kedalam surga disebabkan keimanan mereka, kemudian memberi pahala kepada mereka dengan masuk ke dalam surge dan dihalalkan seluruh keridoanNya atas mereka, yang mengalir di bawah kamar-kamar dan tempat tinggal mereka sungai-sungai di dalam surga yang sarat dengan kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Sesungguhnya orang-orang yang beriman kepada Allah dan mengerjakan amal saleh, Allah karuniai mereka petunjuk untuk beramal saleh yang akan mengantarkan mereka kepada rida-Nya, disebabkan keimanan mereka. Kemudian kelak di hari Kiamat Allah akan memasukkan mereka ke dalam surga-surga yang dipenuhi kenikmatan abadi, yang di bawahnya mengalir sungai-sungai."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-10. Orang-orang beriman yang mengerjakan amal shalih akan Allah beri mereka petunjuk ke jalan surga, berkat kepercayaan mereka kepada Allah; dalam surga itu terdapat sungai-sungai yang mengalir di bawah istana-istana. Mereka akan tinggal di dalam surga yang penuh kenikmatan itu; di dalamnya mereka berdoa dengan tasbih dan mengagungkan Allah, dan salam mereka dari Allah, para malaikat, dan sesama mereka adalah ‘salam’, yakni keselamatan dari segala keburukan. Dan mereka menutup doa dengan ‘alhamdulillah robbil ‘alamin’, yakni segala puja dan puji yang sempurna hanya bagi Allah, Tuhan seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يَهْدِيهِم رَبُّهُم بِإِيمٰنِهِمْ ۖ (mereka diberi petunjuk oleh Tuhan mereka karena keimanannya) Allah memberi mereka petunjuk sebagai balasan atas keimanan dan amal shaleh mereka, sehingga dengan itu mereka dapat meraih surga. تَجْرِى مِن تَحْتِهِمُ الْأَنْهٰرُ(di bawah mereka mengalir sungai-sungai) Yakni di bawah kebun-kebun mereka, atau di hadapan mereka. Sebab mereka berada diatas dipan-dipan yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Sesungguhnya orang-orang yang beriman kepada Allah dan mengerjakan amal shalih akan dibimbing Tuhan menuju surga karena keimanan mereka, yaitu tempat yang mengalir sungai-sungai di bawah kebun-kebun dan bilik-bilik mereka, yaitu di surga-surga yang penuh kenikmatan mutlak dan keabadian. Ini adalah perumpamaan nikmat dan kebahagiaan di tempat itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman dan beramal shalih, niscaya mereka diberi petunjuk} dituntun {oleh Tuhan mereka karena keimanan mereka. mengalir di bawah mereka sungai-sungai di surga yang penuh kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Allah berfirman, “Sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal shalih.” Maksudnya, mereka menggabungkan antara iman dan pelaksanaan terhadap amal shalih yang merupakan konsekuensi dan tuntutannya yang mencakup amal hati dan anggota badan dengan keikhlasan dan mengikuti tuntunan Rasul, “mereka diberi petunjuk oleh Rabb mereka karena keimanannya.” Maksudnya karena keimanannya, maka Allah membalas mereka dengan pahala yang besar yaitu hidayah. Dia mengajarkan kepada mereka sesuatu yang berguna bagi mereka, memberi mereka nikmat dengan amal yang timbul dari hidayah, memberi petunjuk kepada mereka untuk mengkaji ayat-ayatNYa, memberi mereka petunjuk di alam ini kepada jalan yang lurus dan pada saat berada di jalan yang lurus serta (petunjuk) di alam pembalasan kepada jalan yang mengantarkan kepada Surga kenikmatan. Oleh karena itu, Dia berfiman, “di bawah mereka mengalir sungai-sungai”, yang terus menerus mengalir “di dalam Surga yang penuh kenikmatan.” Allah menisbatkannya kepada kenikmatan karena ia mengandung kenikmatan yang sempurna; kenikmatan hati dengan kebahagiaan, kesenangan, kelezatan, melihat Allah, menyimak FirmanNya, berbangga dengan ridhaNya dan kedekatan kepadaNya, bertemu saudara-saudara dan orang-orang terkasih, berkumpul dengan mereka, mendengar suara yang menyenangkan, alunan yang merdu dan pemandangan yang menenangkan. Juga nikmat jasmani dengan berbagai macam minuman, makanan, pernikahan dan lain-lain yang tidak diketahui oleh jiwa dan tidak terlintas di benak siapa pun atau ada yang mampu untuk menyifatinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 9: Mereka menggabung antara iman dengan mengerjakan yang harus dikerjakan dan konsekwensinya berupa amal saleh, amal yang mencakup amalan hati dan amalan anggota badan dengan ikhlas dan sesuai sunnah Nabi shallallahu 'alaihi wa sallam. Maksudnya bahwa Allah memberikan hidayah kepada mereka karena sebab keimanannya, Dia mengajarkan kepada mereka apa-apa yang bermanfaat bagi mereka, mengaruniakan mereka amal yang muncul dari hidayah, menunjukkan mereka untuk memperhatikan ayat-ayat-Nya, menunjukkan kepada mereka ke jalan yang lurus dan di dalam jalan yang lurus, dan di akhirat, mereka dituntun ke jalan yang mengarah kepada surga. Kata “surga” diidhafatkan (disandarkan) oleh Allah dengan kenikmatan, karena di dalamnya mengandung kenikmatan yang sempurna, kenikmatan hati dengan bergembira, senang dan bahagia, melihat Allah dan mendengar firman-Nya, bergembira dengan keridhaan-Nya dan dekat dengan-Nya, bisa bertemu dengan para kekasih dan kawan-kawan, mendengarkan nyanyian yang membuat riang dan melihat pemandangan yang menyenangkan. Sedangkan nikmat pada badan adalah dengan makan makanan yang bermacam-macam, minuman yang beraneka ragam dan menikmati pernikahan, dsb. Di mana kesenangannya belum pernah terlintas di hati manusia, dan tidak ada seorang pun yang dapat menyifatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 9",
    "description": "Kebalikan dari orang-orang yang durhaka kepada Allah dan hanya mencintai kehidupan dunia adalah orang-orang yang beriman dan beramal saleh untuk bekal kehidupan di akhirat. Sesungguhnya orang-orang yang beriman dan sebagai wujud keimanan tersebut mereka mengerjakan amal kebajikan sebagaimana petunjuk yang disebutkan di dalam alqur'an, niscaya mereka diberi petunjuk oleh tuhan karena keimanan mereka. Mereka di dalam surga yang penuh kenikmatan yang tiada tara, tiada pernah terkurangi dan mengalir di bawahnya sungai-sungai. Sebagai gambaran dari keindahan dan kenyamanan kehidupan di dalam surga adalah setiap kata dan kalimat yang terucap tiada lain hanya pujian atas kebesaran Allah. Doa yang mereka ucapkan di dalamnya ialah, subha'nakalla'humma mahasuci engkau, ya tuhan kami, dan salam penghormatan kepada mereka dari Allah, malaikat dan sesama penghuni surga ialah, sala'm, semoga keselamatan yang sempurna selalu menyertai kamu. Dan penutup doa mereka ialah, al-hamdu lilla'hi rabbil 'a'lamin segala puji bagi Allah tuhan pemelihara seluruh alam."
  }
]