[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami belah lautan bagi Bani israil sehingga mereka dapat menyebrangi laut itu. Kemudian Fir’aun dan bala tentaranya mengejar mereka demi melancarkan kezhaliman dan karena permusuhan. Lalu mereka mengarungi laut di belakang mereka. Dan ketika ancaman tenggelam telah meliputi Fir’aun, dia berkata, “ Aku beriman, sesungguhnya tiada tuhan yang haq kecuali Dzat yang telah diimani oelh Bani israil. Dan aku termasuk orang-orang yang mengesakan lagi berserah diri dengan patuh dan ketaatan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Dan Kami mudahkan kepada Bani Israil untuk menyeberangi lautan setelah Kami membelahnya agar mereka dapat melewatinya dengan selamat. Kemudian mereka dikejar oleh Fir'aun dan bala tentaranya dengan bengis dan kejam. Sampai ketika Fir'aun terkepung air laut, nyaris tenggelam dan kehilangan harapan untuk selamat, tiba-tiba ia berkata, \"Aku percaya bahwasanya tidak ada Tuhan yang berhak disembah selain Tuhan yang dipercaya oleh Bani Israil. Dan aku termasuk orang-orang yang tunduk patuh kepada Allah .\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Allah menjadikan Musa dan para pengikutnya dapat menyeberangi laut dengan selamat, namun Fir’aun dan bala tentaranya berusaha mengejar mereka karena kezaliman dan permusuhan mereka. Hingga ketika Fir’aun tenggelam dan yakin akan binasa, ia berkata: “Aku bersaksi bahwa tidak ada Tuhan selain Allah yang diimani oleh Bani Israil, dan aku termasuk orang yang tunduk kepada perintah dan larangan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. وَجٰوَزْنَا بِبَنِىٓ إِسْرٰٓءِيلَ الْبَحْرَ (Dan Kami memungkinkan Bani Israil melintasi laut) Allah menjadikan lautan itu kering agar mereka dapat melintasinya dan sampai di daratan. Tafsir dari ayat ini telah disebutkan dalam surat al-Baqarah: 50. بَغْيًا وَعَدْوًا ۖ (karena hendak menganiaya dan menindas) Makna (النغي) yakni kezaliman. Dan makna (العدو) yakni penindasan. حَتَّىٰٓ إِذَآ أَدْرَكَهُ الْغَرَقُ(hingga bila Fir’aun itu telah hampir tenggelam) Yakni ketika ia mulai tenggelam, lautan menimpa dan menghanyutkan mereka sehingga mereka tenggelam semua sebagaimana yang dikisahkan oleh Allah. قَالَ ءَامَنتُ(berkatalah dia: “Saya telah beriman) Dan keimanan ini tidak dapat memberinya manfaat karena ia mengatakannya setelah ia mulai tenggelam. Dan Fir’aun yang terlaknat ini tidak mengatakan “saya telah beriman kepada Allah” karena dalam dirinya masih tersisa anggapan bahwa dia adalah tuhan. وَأَنَا۠ مِنَ الْمُسْلِمِينَ (dan saya termasuk orang-orang yang berserah diri) Yakni termasuk orang-orang yang berserah diri pada keputusan Allah, yang mengesakan-Nya dan mengingkari tuhan selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90 Kami biarkan Bani Israil melintasi laut dengan kekuasaan Kami sampai mereka sampai daratan, lalu mereka diikuti oleh Fir’aun dan bala tentaranya, hingga Fir’aun tiba di tengah laut dan hampir tenggelam, lantas dia berkata: “Saya percaya bahwa tidak ada Tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan saya termasuk orang-orang yang berserah diri kepada Allah dengan beribadah, bertauhid dan taat”. Namun keimanan saat putus asa ini tidak berguna baginya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menyeberangkan} memotongkan {Bani Israil di laut itu. Lalu Fir‘aun dan bala tentaranya mengikuti mereka} membuntuti mereka {untuk menganiaya dan menindas} untuk berbuat zalim dan permusuhan {sehingga ketika Fir‘aun hampir tenggelam, dia berkata,“Aku percaya bahwa tidak ada tuhan selain Tuhan yang telah dipercayai oleh Bani Israil dan aku termasuk orang-orang muslim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. Allah memerintahkan Musa agar membawa Bani Israil pergi di waktu malam. Allah mengabarkan bahwa mereka akan mengikutinya. Firaun membuat pengumuman di seluruh penjuru negeri bahwa mereka itu –Musa dan kaumnya- hanyalah segelintir orang pinggiran. Mereka marah kepada kami dan kita mewaspadai mereka. Firaun mengumpulkan bala tentaranya dari atasan sampai bawahan. Dia dengan bala tentaranya mengejar Bani Israil dengan kesombongan dan permusuhan, mereka hendak menagkap Musa dan membuat kerusakan di muka bumi. Jika kekejian telah memuncak dan dosa telah menguat maka tunggulah azab dari Allah. “Dan Kami memungkinkan Bani Israil melintasi laut.” Hal itu karena Allah mewahyukan kepada Musa tatkala dia sampai di laut agar memukul laut dengan tongkatnya. Musa memukulnya, maka terbelahlah dua jalan, Bani Israil melaluinya, Firaun terus menguntit dengan bala tentaranya di belakangnya. Ketika Musa dan kaumnya telah sampai di daratan ujung sedangkan Firaun dengan bala tentaranya masih di tengah laut, maka Allah memerintahkan kepada laut untuk menelan Firaun dan bala tentaranya. Mereka tenggelam dengan dilihat oleh Bani Israil. Manakala Firaun tenggelam dan dia yakin akan mati, “berkatalah dia, ‘Saya percaya bahwa tidak ada tuhan melainkan (Rabb) yang dipercayai oleh Bani Israil’.” Yaitu Allah Rabb Yang Mahabenar, yang tiada Rabb melainkan Dia, “dan saya termasuk orang-orang yang berserah diri (kepada Allah).” Yakni tunduk kepada agama Allah dan ajaran yang dibawa Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 90: Allah Subhaanahu wa Ta'aala memerintahkan Nabi Musa ‘alaihis salam untuk membawa pergi Bani Israil di malam hari dan memberitahukan, bahwa mereka akan diikuti. Kemudian Fir’aun mengirimkan orang ke kota-kota untuk mengumpulkan bala tentaranya. Fir’aun berkata, “Sesungguhnya mereka (Bani Israil) hanya sekelompok kecil. Sesungguhnya mereka telah berbuat hal-hal yang menimbulkan amarah kita, dan sesungguhnya kita semua tanpa kecuali harus selalu waspada.” (lihat Asy Syu’araa: 53-56) maka bala tentaranya berkumpul, yang tinggal jauh dari kerajaan maupun yang dekat, dan mereka bersama-sama mengejar Bani Israil untuk menzalimi dan menindasnya. Lalu Fir’aun dan bala tentaranya dapat menyusul Bani Israil di waktu matahari terbit. Ketika kedua golongan itu saling melihat, berkatalah pengikut-pengikut Musa, “Kita benar-benar akan tersusul.” Musa menjawab, “Sekali-kali tidak akan tersusul, sesungguhnya Tuhanku bersamaku dan Dia akan memberi petunjuk kepadaku.” Kemudian Allah Subhaanahu wa Ta'aala mewahyukan kepada Nabi Musa untuk memukulkan tongkatnya ke laut, maka terbelahlah lautan itu menjadi dua belas jalan, kemudian Bani Israil melintasinya, lalu Fira’aun dan bala tentaranya ikut melintasinya. Ketika Nabi Musa dan kaumnya berhasil melewati lautan, sedangkan Fir’aun dan bala tentaranya di dalamnya, Allah Subhaanahu wa Ta'aala memerintahkan laut menyatu sehingga tenggelamlah mereka semua, sedangkan Bani Israil menyaksikannya. Ditambahkan kata-kata “dan aku termasuk orang-orang muslim” agar pengakuannya diterima, namun tetap tidak diterima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 90",
    "description": "Ayat ini menjelaskan azab yang akan menimpa firaun dan pengikutnya. Dan kami selamatkan bani israil melintasi laut, yakni laut merah, kemudian fir'aun dan bala tentaranya mengikuti mereka, untuk menzalimi dan menindas mereka. Sehingga ketika fir'aun hampir mati tenggelam, karena air hampir menenggelamkannya, dia berkata, aku percaya bahwa tidak ada tuhan melainkan tuhan yang dipercayai oleh bani israil, dan aku termasuk orang-orang muslim, berserah diri, tunduk dan patuh. Mendengar pernyataan firaun bahwa dia beriman dan menyerahkan diri ketika ajal akan menghampirinya, lalu dijawab dalam ayat ini dengan pernyataan keras, mengapa baru sekarang kamu beriman, padahal sesungguhnya engkau telah durhaka sejak dahulu, ketika nabi musa mengajakmu beriman kepada Allah, dan engkau termasuk orang yang berbuat kerusakan di muka bumi dengan kezaliman dan kekufuran, bahkan mengaku sebagai tuhan."
  }
]