[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah baru sekarang wahai Fir’aun, ketika kematian telah benar-benar mendatangimu, kamu mau mengakui penghambaan kepada Allah, sedang kamu telah mendurhakaiNya sebelum turun siksaNYa padamu, dan kamu termasuk orang-orang yang melakukan kerusakan lagi menghambat orang dari jalan Allah?! karenaNya, tidaklah bermanfaat bagimu taubat di saat syakaratul maut dan melihat kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. \"Apakah kamu hendak beriman sekarang, setelah kamu kehilangan harapan untuk hidup?!\" Kamu -wahai Fir'aun- telah durhaka kepada Allah sebelum turunnya azab dengan ingkar kepada-Nya dan menghalang-halangi orang dari jalan-Nya. Dan kamu termasuk orang-orang yang membuat kerusakan disebabkan kesesatanmu sendiri dan usahamu untuk menyesatkan orang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Akan tetapi Allah tidak menerima keimanan itu, bahkan Allah mengingkarinya: “Apakah kamu beriman sekarang, ketika kamu sudah putus asa untuk dapat hidup; sedangkan kamu telah menentang Allah sebelum tenggelam dan kamu sebelumnya adalah orang yang sesat dan berbuat kerusakan di muka bumi?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. ءَآلْـٰٔنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنتَ مِنَ الْمُفْسِدِينَ (Apakah sekarang (baru kamu percaya), padahal sesungguhnya kamu telah durhaka sejak dahulu, dan kamu termasuk orang-orang yang berbuat kerusakan) Yakni kemudian dikatakan kepadanya: “apakah sekarang kamu baru beriman? Dan beriman saat melihat sakaratul maut tidak ada menfaatnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tatkala Fir'aun mengumumkan keimanannya pada detik-detik ia tenggelam di lautan yang dalam, Allah mengatakan kepadanya : { آلْآنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنْتَ مِنَ الْمُفْسِدِينَ } \"Apakah sekarang (baru kamu percaya), padahal sesungguhnya kamu telah durhaka sejak dahulu, dan kamu termasuk orang-orang yang berbuat kerusakan\". Dari sekian banyak pelanggaran-pelanggaran yang diperbuat oleh Fir'aun, dalam ayat ini disebutkan hanya satu, yaitu : pengrusakan oleh dirinya, tanpa disebutkan pelanggaran lainnya; dan tidaklah itu terjadi (wallahu a'lam) melainkan celaan terhadap buruknya berbuat kerusakan di muka bumi, dan besarnya dampak dari pengrusakan terhadap keyakinan dan agama ummat manusia, begitu juga dengan kehidupan dunia dan akhlaq, serta hak-hak mereka; maka celakalah bagi orang-orang yang kerap berbuat kerusakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91 Lalu Allah menjawab mereka: “Apakah sekarang kamu baru percaya dan beriman, padahal sesungguhnya kamu telah durhaka sejak dulu, dan kamu termasuk orang-orang yang berbuat kerusakan dan sesat dari jalan keimanan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah sekarang} apakah sekarang kamu beriman ketika berbuat buruk dalam kehidupan dan kamu yakin dengan kematian {sungguh kamu telah durhaka sebelumnya dan kamu termasuk orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. Allah berfirman menjelaskan bahwa iman dalam kondisi seperti ini tidaklah berguna baginya. “Apakah sekarang (baru kamu percaya)”, beriman dan mengakui Rasul Allah, “padahal sesungguhnya kamu telah durhaka sejak dahulu.” Maksudnya, kamu terang-terangan bermaksiat, mengingkari dan mendustakan, “dan kamu termasuk orang-orang yang berbuat kerusakan?” iman tidak berguna bagimu sebagaimana Sunnatullah yang berlaku bahwa jika orang kafir telah sampai pada keadaan darurat ini, maka imannya tidak berguna baginya karena imannya adalah iman kepada sesuatu yang terlihat sebagaimana iman orang pada saat KIamat tiba. Iman yang berguna itu adalah iman kepada yang ghaib."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 91: Ketika kondisi seperti ini, iman tidaklah bermanfaat, karena keimanan ketika ini seperti beriman kepada yang nyata, padahal beriman hanyalah bermanfaat sewaktu masih ghaib. Dengan kesesatanmu dan menyesatkan orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 91",
    "description": "Mendengar pernyataan firaun bahwa dia beriman dan menyerahkan diri ketika ajal akan menghampirinya, lalu dijawab dalam ayat ini dengan pernyataan keras, mengapa baru sekarang kamu beriman, padahal sesungguhnya engkau telah durhaka sejak dahulu, ketika nabi musa mengajakmu beriman kepada Allah, dan engkau termasuk orang yang berbuat kerusakan di muka bumi dengan kezaliman dan kekufuran, bahkan mengaku sebagai tuhan. Untuk menunjukkan bahwa firaun yang mengaku sebagai tuhan itu telah benar-benar mati, maka pada hari ini kami selamatkan jasadmu, yakni kami wafatkan jiwamu tetapi tubuh kasarmu masih tetap utuh, agar engkau, yakni kisah hidupmu dan azab yang menimpa akibat kezalimanmu dapat menjadi pelajaran bagi orang-orang yang datang setelahmu, sesungguhnya kebanyakan manusia tidak mengindahkan tanda-tanda kekuasaan kami."
  }
]