[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hari ini, kami hendak menjadikan kamu berada di tempat yang tinggi di permukaan tanah dengan tubuhmu, agar dapat melihatmu orang yang mendustakan dengan kebinasaanmu, supaya kamu menjadi pelajaran bagi manusia sepeninggalmu yang akan memetik pelajaran darimu. Namun kebanyakan dari manusia melalaikan hujjah-hujjah Kami dan dalil nyata Kami, mereka tidak mau memikirkannya dan mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Maka pada hari ini, Kami mengeluarkan jasadmu -wahai Fir'aun- dari dalam laut dan meletakkanmu di permukaan tanah, agar orang-orang yang datang sesudahmu menjadikanmu sebagai pelajaran. Sesungguhnya banyak manusia yang lalai terhadap hujah-hujah dan dalil-dalil yang menunjukkan kekuasaan Kami. Mereka tidak mau memikirkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Hari ini Kami mengeluarkan jasadmu dari laut, agar menjadi ibrah bagi manusia dan orang-orang zalim setelahmu. Dan mayoritas manusia berpaling dari ayat-ayat kekuasaan Kami yang dapat dilihat dan didengar, tanpa menghayati dan mengambil ibrah darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. فَالْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ (Maka pada hari ini Kami selamatkan badanmu) Yakni jasadmu yang telah tak bernyawa. Fir’aun akhirnya terdampar di tepi laut dalam keadaan mati sehingga orang-orang dapat menyaksikannya. لِتَكُونَ لِمَنْ خَلْفَكَ ءَايَةً (supaya kamu dapat menjadi pelajaran bagi orang-orang yang datang sesudahmu) Yakni pelajaran yang dapat diambil ibrahnya oleh orang-orang generasi selanjutnya apabila mereka mendengarnya, sehingga mereka dapat berhati-hati dari sifat sombong dan semena-mena serta durhaka kepada Allah, dan agar mereka mengetahui kebohongan Fir’aun yang mengaku sebagai tuhan yang maha tinggi, maka inilah jasadnya yang terdampar tanpa nyawa di tepi laut. عَنْ ءَايٰتِنَا لَغٰفِلُونَ (lengah dari tanda-tanda kekuasaan Kami) Yakni mereka lalai dari tanda-tanda yang menjadikan manusia berfikir dan mengambil pelajaran serta membangunkan mereka dari kelalaian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92 Maka pada hari ini Kami selamatkan jasadmu supaya kamu dapat dilihat Bani Israil dan kaum lainnya. Kami juga menghempaskan Fir’aun ke dalam neraka sampai mati sehingga mereka bisa menyaksikannya seta dijadikan pelajaran bagi kaum sesudahmu, sehingga mereka tidak sombong dan mengaku sebagai tuhan serta murtad kepada Allah serta mengakui kehambaanmu. dan sesungguhnya banyak diantara manusia yang lengah, tidak mau merenung, berpikir dan mengambil pelajaran dari menelaah tanda-tanda kekuasaan Kami yang mengandung pelajaran dan nasehat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ini Kami menyelamatkan jasadmu} mengeluarkan dari laut jasadmu yang tidak ada ruhnya, lalu Kamu melemparkanmu di tempat yang tinggi di bumi {agar kamu bagi penerusmu menjadi pelajaran} contoh dan pelajaran {Sesungguhnya kebanyakan manusia terhadap ayat-ayat Kami benar-benar lengah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. “Maka pada hari ini Kami selamatkan badanmu supaya kamu dapat menjadi pelajaran bagi orang-orang yang datang sesudahmu.” Ahli tafsir menyatakan bahwa Bani Israil ketika di dalam hatinya terdapat ketakutan yang sangat terhadap Firaun, maka mereka sepertinya tidak percaya kalau Firaun telah tenggelam, mereka meragukan itu. Maka Allah memerintahkan laut agar melemparkan Firaun ke atas agar ia menjadi tanda dan pelajaran bagi mereka. “Dan sesungguhnya kebanyakan dari manusia lengah dari tanda-tanda kekuasaan Kami.” Oleh karena itu, tanda-tanda tersebut lewat berulang-ulang tetapi mereka tidak mengambil manfaat darinya karena mereka tidak memperhatikannya. Adapun orang dengan akal dan hati yang hadir maka dia dapat melihat ayat-ayat Allah sebagai dalil terbesar atas kebenaran sesuatu yang diberitakan oleh para rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 92: Yang diselamatkan Allah adalah tubuh kasarnya (yang tidak ada ruhnya). Diriwayatkan dari Ibnu Abbas, bahwa sebagian Bani Israil masih meragukan kematian Fir’aun, maka Allah mengeluarkan jasadnya agar mereka dapat melihatnya. Menurut sejarah, mayat Fir'aun kemudian terdampar di pantai dan ditemukan oleh orang-orang Mesir lalu dibalsem, sehingga tetap utuh sampai sekarang dan dapat dilihat di musium Mesir. Agar mereka tidak mengikuti jejak langkahmu. Ayat-ayat Allah begitu banyak dan disaksikan manusia, namun mereka tidak mau mengambil pelajaran terhadapnya. Adapun mereka yang memiliki akal dan hati yang terjaga, maka dia melihat ayat-ayat itu sebagai bukti nyata kebenaran yang dibawa oleh para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 92",
    "description": "Untuk menunjukkan bahwa firaun yang mengaku sebagai tuhan itu telah benar-benar mati, maka pada hari ini kami selamatkan jasadmu, yakni kami wafatkan jiwamu tetapi tubuh kasarmu masih tetap utuh, agar engkau, yakni kisah hidupmu dan azab yang menimpa akibat kezalimanmu dapat menjadi pelajaran bagi orang-orang yang datang setelahmu, sesungguhnya kebanyakan manusia tidak mengindahkan tanda-tanda kekuasaan kami. Setelah dijelaskan tentang kezaliman firaun dan pengikutnya serta azab yang dialami diakhir hidupnya, lalu dijelaskan tentang anugerah Allah kepada bani israil. Dan sungguh, kami telah menempatkan bani israil di tempat kediaman yang bagus, yakni tempat yang terpenuhi segala kebutuhan hidup, tanah yang subur, lingkungan yang nyaman, dan udara yang segar, dan kami beri mereka rezeki yang baik dari hasil bumi. Maka setelah mendapatkan rezeki mereka tidak berselisih dalam urusan dunia maupun agama, kecuali setelah datang kepada mereka pengetahuan yang tersebut dalam taurat. Sesungguhnya tuhan kamu, wahai nabi Muhammad, akan memberi keputusan antara mereka pada hari kiamat tentang apa yang mereka perselisihkan itu."
  }
]