[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah menempatkan Bani israil di tempat tinggal yang baik lagi pilihan di negeri Syam dan Mesir, dan kami memberikan rizki yang halal lagl baik kepada mereka dari kekayaan-kekayaan dari bumi yang penuh berkah. Kemudian mereka tiidaklah berselisih pendapat perkara agama mereka, kecuali setelah datangnya ilmu yang mewajibkan mereka untuk bersatu padu. Dan termasuk kandungan Taurat tetang kenabian Muhamad . Sesungguhya Tuhanmu (wahai Rasul), akan menetapkan putusan antara mereka pada Hari kiamat dan memutuskan perkara yang mereka berselish di dalamnya tentang hakikat darimu. Lalu Memasukan orang-orang yang mendustakan ke dalam neraka dan orang-orang Mukmin ke dalam surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Sungguh Kami telah menempatkan Bani Israil di tempat yang bagus dan lokasi yang menyenangkan di negeri Syam yang diberkahi. Dan Kami beri mereka rezeki yang halal lagi baik. Kemudian mereka tidak pernah berselisih paham tentang urusan agama mereka sampai Al-Qur`ān datang kepada mereka untuk membenarkan apa yang mereka baca di dalam Taurat tentang sifat Muhammad -ṣallallāhu 'alaihi wa sallam-. Ketika mereka mengingkari hal itu maka tanah air mereka dirampas dari mereka. Sesungguhnya Tuhanmu -wahai Rasul- kelak di hari Kiamat akan memutuskan perkara yang mereka perselisihkan. Kemudian Dia akan memberikan balasan yang setimpal kepada masing-masing pihak, baik yang benar maupun yang salah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Sungguh, telah Kami muliakan Bani Israil dan Kami tempatkan mereka di tanah yang diberkahi serta Kami beri mereka rezeki yang halal dan lezat. Namun mereka tidaklah saling berselisih melainkan setelah datangnya Taurat kepada mereka. Hai Rasulullah, Tuhanmu akan memutuskan perselisihan di antara mereka tentang risalah Muhammad pada hari kiamat, dengan membalas orang yang beriman dengan pahala dan membalas orang yang ingkar dengan azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَلَقَدْ بَوَّأْنَا بَنِىٓ إِسْرٰٓءِيلَ مُبَوَّأَ صِدْقٍ (Dan sesungguhnya Kami telah menempatkan Bani Israil di ternpat kediaman yang bagus) Yakni yang menempatkan mereka pada tempat yang terpuji, yaitu di negeri Baitul Maqdis dan sekitarnya. فَمَا اخْتَلَفُوا۟ (Maka mereka tidak berselisih) Dalam urusan agama mereka dan tercerai-berai setelah mereka berada diatas satu jalan yang tak ada perselisihan di dalamnya. حَتَّىٰ جَآءَهُمُ الْعِلْمُ ۚ( kecuali setelah datang kepada mereka pengetahuan) Setelah mereka membaca Taurat yang didalamnya disebutkan sifat-sifat nabi Muhammad, kemudian mereka saling berselisih dalam sifat-sifat itu, sebagian mereka mengimaninya dan sebagian lain mengingkarinya. إِنَّ رَبَّكَ يَقْضِى بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ (Sesungguhnya Tuhan kamu akan memutuskan antara mereka di hari kiamat tentang apa yang mereka perselisihkan itu) Dengan membalas orang yang membenarkannya dengan kebaiikan dan membalas orang yang mendustakannya dengan balasan yang layak baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93 Sesungguhnya setelah pembinasaan Fir’aun dan pasukan-pasukannya, Kami telah menempatkan Bani Israil di ternpat yang bagus dan diridhai di tanah Mesir dan Syam. Kami cukupkan mereka rezeki dari yang baik-baik. Maka mereka tidak berselisih, sebagian mereka ada yang beriman dan kafir, kecuali setelah datang kepada mereka pengetahuan (yang tersebut dalam Taurat). Sesungguhnya Tuhan kamu akan memutuskan antara mereka di hari kiamat tentang apa yang mereka perselisihkan itu dengan adil, sehingga orang yang melakukan kebenaran dibedakan dengan keberhasilan dan yang bathil dengan kehancuran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menempatkan} menempatkan {Bani Israil di tempat kediaman yang benar} tempat yang layak dan nyaman di Syam {dan Kami memberi mereka rezeki yang baik. Maka mereka tidak berselisih sehingga telah datang kepada mereka pengetahuan. Sesungguhnya Tuhanmu akan memberi keputusan} membagi {antara mereka pada hari kiamat tentang apa yang selalu mereka perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. “Dan sesungguhnya Kami telah menempatkan Bani Israil di tempat kediaman yang bagus.” Maksudnya, Allah menempatkan mereka di kediaman keluarga Firaun dan menjadikan Bani Israil sebagai pewaris negeri dan tempat tinggal mereka. “Dan Kami beri mereka rizki dari yang baik-baik,” berupa makanan, minuman dan lain-lain, “maka mereka tidak berselisih”, tentang kebenaran, “kecuali setelah datang kepada mereka pengetahuan (yang tersebut dalam Taurat).” Yang membuat mereka bersatu dan bersepakat, akan tetapi sebagian berbuat aniaya kepada sebagian yang lain, banyak dari mereka mempunyai ambisi dan tendensi yang menyelisihi kebenaran, maka terjadilah banyak perselisihan di kalangan mereka. “Sesungguhnya Rabbmu akan memutuskan antara mereka di Hari KIamat tentang sesuatu yang mereka perselisihkan itu”, dengan keputusanNya yang adil yang dilandasi ilmuNya yang sempurna dan kodratNya yang menyeluruh. Inilah penyakit yang menimpa pengikut agama yang benar yaitu ketika setan telah berputus asa untuk mereka taati secara keseluruhan maka dia berusaha memprovokasi dan memicu sikap kebencian dan permusuhan di antara mereka, maka terjadilah perselisihan yang merupakan akibat dari itu. Selanjutnya sebagian menyatakan sebagian yang lain sesat, sebagian memusuhi sebagian yang lain, dan hal itu membuat setan yang terlaknat berbahagia, karena jika tidak (berselisih maka dia akan berduka), lalu apabila Rabb mereka adalah satu, Rasul mereka adalah satu, agama mereka adalah satu dan kepentingan umum mereka adalah satu, maka atas dasar apa mereka berbeda-beda dengan perbedaan yang memecah kesatuan mereka, memporak-porandakan barisan mereka, membongkar ikatan dan tatanan mereka. Akibatnya adalah terbengkalainya kemaslahatan mereka baik diniyah maupun duniawiyah dan matinya sebagian dari agama mereka? Kami memohon kepadaMu ya Allah kasih sayang kepada hamba-hambaMu yang beriman, agar Engkau menyatukan barisan mereka, memperbaiki celah mereka dan mengembalikan yang jauh kepada yang dekat dari mereka wahai pemilik kemuliaan dan kebesaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 93: Maksudnya negeri Mesir dan negeri Syam. Allah menempatkan Bani Israil di tempat kediaman Fir’aun dahulu dan mewariskannya untuk mereka. Dalam hal kebenaran. Yang menjadikan mereka bersatu, akan tetapi sebagian mereka dengki kepada sebagian yang lain, dan sebagian besar mereka mempunyai hawa nafsu dan tujuan masing-masing yang menyelisihi kebenaran sehingga timbullah perselisihan yang besar. Inilah penyakit yang menimpa para pemeluk agama yang sahih (Islam), yakni setan ketika tidak berhasil membuat manusia mengikutinya dengan meningalkan agama secara keseluruhan, maka ia menaburkan benih perselisihan, mengadakan permusuhan dan kebencian antara sesama mereka sehingga terjadilah perselisihan, dan terjadilah penyesatan satu pihak kepada pihak lain dan permusuhan sehingga setan semakin senang. Padahal Tuhan mereka satu, agama mereka satu, rasul mereka satu dan maslahatnya pun satu, maka karena alasan apa mereka berselisih sehingga kesatuan mereka terpecah dan ikatan mereka terputus, sehingga maslahat agama maupun dunia luput dan menjadi mati sebagiannya karena perselisihan itu. Ya Allah, kami meminta kepada-Mu kelembutan kepada hamba-hamba-Mu yang mukmin yang menyatukan persatuan mereka, merekatkan pecahannya, mengembalikan yang jauh kepada kedekatan, yaa dzal jalaali wal ikraam. Allahuma ihdinaa limakhtulifa fiihi minal haqqi bi’idznik innaka tahdiy man tasyaa’u ilaa shiraathim mustaqiim. Allah akan memutuskan mereka dengan hukum-Nya yang adil yang muncul dari pengetahuan-Nya yang sempurna serta kekuasaan-Nya yang merata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 93",
    "description": "Setelah dijelaskan tentang kezaliman firaun dan pengikutnya serta azab yang dialami diakhir hidupnya, lalu dijelaskan tentang anugerah Allah kepada bani israil. Dan sungguh, kami telah menempatkan bani israil di tempat kediaman yang bagus, yakni tempat yang terpenuhi segala kebutuhan hidup, tanah yang subur, lingkungan yang nyaman, dan udara yang segar, dan kami beri mereka rezeki yang baik dari hasil bumi. Maka setelah mendapatkan rezeki mereka tidak berselisih dalam urusan dunia maupun agama, kecuali setelah datang kepada mereka pengetahuan yang tersebut dalam taurat. Sesungguhnya tuhan kamu, wahai nabi Muhammad, akan memberi keputusan antara mereka pada hari kiamat tentang apa yang mereka perselisihkan itu. Setelah dijelaskan bahwa perselisihan yang terjadi pada bani israil adalah setelah datangnya pengetahuan sebagaimana tersebut dalam kitab taurat, lalu ditegaskan kepada nabi Muhammad agar tidak meragukan wahyu yang diturunkan kepadanya. Maka jika engkau wahai nabi Muhammad, berada dalam keragu-raguan tentang apa yang kami turunkan kepadamu, seperti kisah nabi nuh, musa, dan lainnya, maka tanyakanlah kepada orang yang membaca kitab sebelummu, yakni ulama yahudi dan nasrani yang mempelajari taurat dan injil. Sungguh, telah datang kebenaran kepadamu dari tuhanmu, wahai nabi Muhammad, maka janganlah sekali-kali engkau termasuk orang yang ragu."
  }
]