[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka apabila kamu (wahai Rasul), dalam keragu-raguan dalam hakikat apa yang Kami beritahukan kepadamu, maka tanyalah orang-orang yang membaca Al-kitab sebelummu dari para penganut kitab Taurat dan Injil pertanyaan tentang ketetapan dan kesaksian, karena sesungguhnya perkara itu termuat dari dalam kitab-kitab suci mereka. Sesungguhnya telah datang kepadamu kebenaran yang meyakinkan dari Tuhanmu bahwa kamu benar-benar adalah utusan Allah, dan orang-orang Yahudi dan Nasrani sungguh-sungguh mengetahui kebenaran itu dan mereka mendapati sifat-sifatmu ada di dalam kitab-kitab suci mereka, akan tetapi mereka mengingkarinya padahal mereka mengetahuinya. Maka janganlah kamu sekali-kali termasuk orang-orang yang ragu-ragu terhadap kebenaran itu dan hakikatnya. Maksud dari ayat ini adalah menegakan hujjah kepada orang-orang musyrik dengan persaksian orang-orang hali kitab dari kalangan yahudi dan nasrani sebagai pembantah atas alasan-alasan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Jika engkau -wahai Rasul- dihantui kebimbangan dan kebingungan tentang hakikat dari Al-Qur`ān yang Kami turunkan kepadamu, bertanyalah kepada orang-orang Yahudi yang rajin membaca Taurat dan orang-orang Nasrani yang rajin membaca Injil. Niscaya mereka akan memberitahumu bahwa apa yang diturunkan kepadamu itu adalah benar adanya. Karena mereka mendapati penjelasannya di dalam kedua Kitab Suci mereka. Sungguh telah datang kepadamu Kitab Suci yang benar dan tidak ada keraguan terhadapnya dari sisi Tuhanmu. Maka janganlah engkau termasuk orang-orang yang ragu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Hai Rasulullah, Jika kamu masih ragu dalam perselisihan mereka tentang kenabianmu sebelum kamu diutus bagi seluruh manusia, sebab mereka mendapati ciri-cirimu dalam kitab Taurat mereka; maka tanyakanlah kepada orang-orang yang membaca Taurat sebelummu, seperti kepada Abdullah bin Salam dan lainnya. Sungguh telah datang kepadamu kebenaran dari Tuhanmu bahwa kamu adalah Rasulullah, dan orang-orang Yahudi dan Nasrani mengetahui ciri-cirimu dalam kitab mereka; maka janganlah kamu sekali-kali ragu tentang hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. فَإِن كُنتَ فِى شَكٍّ مِّمَّآ أَنزَلْنَآ إِلَيْكَ (Maka jika kamu (Muhammad) berada dalam keragu-raguan tentang apa yang Kami turunkan kepadamu) Wahai Muhammad. فَسْـَٔلِ الَّذِينَ يَقْرَءُونَ الْكِتٰبَ مِن قَبْلِكَ ۚ( maka tanyakanlah kepada orang-orang yang membaca kitab sebelum kamu) Yakni orang-orang ahli kitab yang telah masuk Islam dan beriman kepada seruan Rasulullah seperti Abdullah bin Salam; mereka akan memberitahukanmu bahwa kitab Allah benar, dan engkau adalah Rasulullah, serta kitab Taurat bersaksi atas hal itu. Imam Qatadah berkata: pernah disebutkan kepada kami bahwa Rasulullah bersabda: “namun aku tidaklah ragu (atas kitab yang diturunkan kepadaku) atau bertanya (kepada mereka)”. فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ (sebab itu janganlah sekali-kali kamu temasuk orang-orang yang ragu-ragu) Mereka adalah orang-orang yang ragu dan kebingungan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ketika seseorang diserang oleh penyakit-penyakit syubhat ayat ini memberikan solusi dengan memerintahkan kita agar mencari penawar, yaitu dengan kembali kepada orang-orang berilmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94 Maka jika kamu wahai Nabi (yang dimaksud adalah kaumnya) berada dalam keragu-raguan tentang kisah yang Kami turunkan kepadamu ()berupa asumsi, maka tanyakanlah kepada orang-orang yang membaca kitab sebelum kamu seperti Taurat dan Injil yang mengimani Al-Qur’an seperti Abdullah bin Salam. Sesungguhnya mereka akan memberitahumu bahwa Al-Qur’an itu benar-benar kitab Allah dan kamu itu rasulNya. Sesungguhnya telah datang kebenaran yang pasti dengan jelas tanpa ada keraguan di dalamnya kepadamu dari Tuhanmu yang diturunlan melalui wahyu dan ayat-ayat yang pasti, sebab itu janganlah sekali-kali kamu temasuk orang-orang yang ragu-ragu tentang kebenaran kitab yang diturunkan kepadamu. Qatadah berkata: “Disebutkan bahwa Rasulallah SAW bersabda: “Aku tidak ragu dan tidak mempertanyakannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu berada dalam keraguan tentang apa yang Kami turunkan kepadamu, maka tanyakanlah kepada orang-orang yang membaca kitab sebelum kamu. Sungguh telah datang kebenaran kepadamu dari Tuhanmu. Maka jangan sekali-kali kamu termasuk orang-orang yang ragu} orang-orang yang ragu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Allah berfirman kepada NabiNya, Muhammad, “Maka jika kamu (Muhammad) berada dalam keragu-raguan tentang sesuatu yang Kami turunkan kepadamu,” apakah ia benar atau tidak benar, “maka tanyakanlah kepada orang-orang yang membaca kitab sebelummu.” Maksudnya, tanyakan kepada ahli kitab yang obyektif dan ulama yang ilmunya mendalam, karena mereka pasti mengakui kebenaran beritamu dan bahwa ia sesuai dengan apa yang ada pada mereka. Jika dikatakan bahwa banyak dari ahli kitab Yahudi dan Nasrani bahkan mungkin kebanyakan dari mereka mendustakan Rasulullah, menentangnya dan menolak dakwahnya sedangkan Allah memerintahkan RasulNya agar menjadikan mereka saksi dan menjadikan kesaksian mereka sebagai hujjah atas apa yang dibawa nya dan bukti atas kebenarannya, bagaimana itu bisa terjadi? Jawabannya dari beberapa segi: Di antaranya: jika kesaksian disandarkan kepada kelompok orang atau pengikut aliran atau penduduk suatu daerah dan lain-lain, maka ia hanya mencakup orang-orang adil yang jujur dari mereka. Adapun selain mereka meskipun lebih banyak jumlahnya, maka mereka tidak dijadikan pedoman, karena kesaksian berpijak kepada keadilan dan kejujuran, dan hal itu telah terbukti dengan berimannya banyak rahib Rabbbiyin dari mereka, seperti Abdullah bin Salam dan kawan-kawannya dan masih banyak lagi yang beriman pada masa nabi dan para khalifah serta tabiin yang sesudah mereka. Di antaranya: Bahwa kesaksian ahli kitab kepada Rasul didasarkan kepada kitab mereka yaitu Taurat yang mana mereka menisbatkan diri mereka kepadanya. Jika di dalam Taurat terdapat sesuatu yang sesuai dengan al-Quran, membenarkan dan mengakui keshalihannya, namun semua ahli kitab dari awal sampai akhir bersepakat mengingkari hal itu, maka hal itu tidak menodai sesuatu yang dibawa oleh Rasul. Di antaranya: Allah memerintahkan RasulNya agar menjadikan ahli kitab sebagai saksi atas kebenaran sesuatu yang dibawanya, Nabi menampakkan dan menunjukkan hal itu di depan khalayak umum, dan sebagaimana yang sudah diketahui bahwa kebanyakan dari mereka adalah orang-orang yang berusaha dengan serius membatalkan dakwah Rasulullah Muhammad. Jika mereka memiliki sesuatu yang bisa menangkal sesuatu yang dinyatakan Allah, niscaya mereka akan memunculkan, menampakkan dan menjelaskannya. Ketika hal yang demikian itu tidak terjadi, maka tidak adanya penolakan dari musuh dan pengakuan para pengikut adalah bukti kuat atas keabsahan al-Quran dan kebenarannya. Di antaranya: Mayoritas ahli kitab tidak menolak dakwah Nabi, justru kebanyakan dari mereka mengikuti dan tunduk kepadanya dengan suka rela. Rasul diutus, sementara kebanyakan penduduk bumi yang beragama adalah ahli kitab, sehingga dakwah Nabi tidak perlu waktu hingga kebanyakan penduduk Syam, Mesir, Irak dan kota-kota di sekitarnya yang merupakan pusat agama ahli kitab tunduk kepada Islam kecuali para pemegang kekuasaan yang lebih mementingkan kekuasaan di atas kebenaran dan orang-orang awam yang bodoh yang mengikuti mereka serta orang-orang yang Bergama dengan agama mereka hanya sekedar nama saja bukan hakikat yang sebenarnya seperti orang-orang Eropa yang pada hakikatnya adalah Dahriyin yang tidak terikat dengan agama para rasul, mereka mengaku Nasrani hanya untuk mendukung kekuasaan mereka dan menutupi kebatilan mereka sebagaimana hal itu diketahui oleh orang-orang yang mengetahui keadaan mereka yang jelas lagi nyata. FirmanNya, “Sesunggguhnya telah datang kebenaran kepadamu,” yang tidak ada keraguan padanya sedikit pun “dari Rabbmu, sebab itu janganlah sekali-kali kamu termasuk orang-orang yang ragu-ragu.” Seperti Firman Allah, \"Ini adalah sebuah kitab yang diturunkan kepadamu, maka janganlah ada kesempitan di dalam dadamu karenanya, supaya kamu memberi peringatan dengan kitab itu (kepada orang kafir), dan menjadi pelajaran bagi orang-orang yang beriman.\" (Al-A‘raf:2)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 94: Apakah ia benar atau salah? Yakni Ahli Kitab yang adil dan ulama yang dalam ilmunya. Sesungguhnya mereka akan mengakui kebenaran apa yang engkau beritakan dan sama dengan apa yang ada pada mereka. Jika ada yang mengatakan, “Mayoritas Ahli Kitab dari kalangan Yahudi dan Nasrani itu mendustakan Rasulullah shallallahu 'alaihi wa sallam bahkan menentangnya serta menolak dakwahnya, namun mengapa Allah Ta’ala menyuruh rasul-Nya mengambil saksi dari mereka dan menjadikan persaksian mereka hujjah bagi apa yang Beliau bawa serta sebagai bukti terhadap kebenarannya? Ada beberapa jawaban terhadapnya, di antaranya: - Persaksian apabila disandarkan kepada golongan tertentu atau pemeluk madzhab tertentu atau ke sebuah negeri, maka persaksian itu hanya tertuju kepada orang-orang yang adil dan jujur saja di antara mereka. Adapun selain mereka, maka tidak dipandang mskipun jumlahnya banyak. Hal itu karena persaksian dibangun atas dasar keadilan dan kejujuran, dan hal itu terbukti dengan banyaknya yang beriman dari kalangan ulama mereka, seperti Abdullah bin Salam, kawan-kawannya, Ka’ab Al Ahbar, dan beberapa orang lainya yang masuk Islam di zaman Nabi shallallahu 'alaihi wa sallam atau di zaman khalifah setelah Beliau . - Persaksian Ahli Kitab terhadap Rasulullah shallallahu 'alaihi wa sallam berdasar kepada kitab mereka, yaitu Taurat, di mana mereka menyandarkan kepadanya. Oleh karena itu, jika sudah ada dalam Taurat yang sesuai dengan Al Qur’an dan membenarkannya serta bersaksi terhadap kebenarannya. Jika ternyata mereka malah sepakat mengingkarinya, maka yang demikian tidaklah mencacatkan kerasulan Beliau. - Allah Subhaanahu wa Ta'aala memerintahkan rasul-Nya mengambil saksi dari Ahli Kitab terhadap kebenaran yang Beliau bawa, dan menampakkannnya di hadapan semua saksi. - Tidak semua Ahli Kitab menolak dakwah Rasulullah shallallahu 'alaihi wa sallam, bahkan banyak dari mereka yang menerima, tunduk mengikuti Beliau secara suka rela. Hal itu, karena ketika Rasulullah shallallahu 'alaihi wa sallam diutus, mayoritas penduduk bumi yang beragama adalah Ahli Kitab. Tidak terlalu lama waktunya ternyata banyak yang masuk Islam seperti mayoritas penduduk Syam, Mesir, Irak dan Negara tetangganya yang menjadi pusat Ahli KItab, sehingga tidak tinggal selain para penguasa yang lebih mengutamakan kekuasaannya daripada kebenaran, dan orang-orang yang mengikuti mereka dari kalangan orang awam yang jahil (bodoh), serta orang yang beragama dengan agama mereka yang hanya tinggal namanya saja, tidak ada maknanya seperti orang-orang Eropa yang sesungguhnya mereka adalah orang-orang atheis, berlepas dari agama yang dibawa para rasul, di mana mereka hanya menisbatkan dirinya kepada agama Nasrani untuk melariskan kerajaan mereka, menyamarkan kebatilan mereka, sebagaimana hal itu diketahui oleh orang-orang yang meneliti keadaan mereka yang sesungguhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 94",
    "description": "Setelah dijelaskan bahwa perselisihan yang terjadi pada bani israil adalah setelah datangnya pengetahuan sebagaimana tersebut dalam kitab taurat, lalu ditegaskan kepada nabi Muhammad agar tidak meragukan wahyu yang diturunkan kepadanya. Maka jika engkau wahai nabi Muhammad, berada dalam keragu-raguan tentang apa yang kami turunkan kepadamu, seperti kisah nabi nuh, musa, dan lainnya, maka tanyakanlah kepada orang yang membaca kitab sebelummu, yakni ulama yahudi dan nasrani yang mempelajari taurat dan injil. Sungguh, telah datang kebenaran kepadamu dari tuhanmu, wahai nabi Muhammad, maka janganlah sekali-kali engkau termasuk orang yang ragu. Setelah dilarang meragukan kebenaran wahyu yang diturunkan kepada nabi Muhammad, lalu ditegaskan, janganlah sekali-kali engkau termasuk orang yang mendustakan, yakni mengingkari ayat-ayat Allah, nanti engkau termasuk orang yang rugi, yakni celaka bahkan dalam kecelakaan yang besar, karena jauh dari rahmat Allah."
  }
]