[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu sekali-kali (wahai Rasul), termasuk di antara orang-orang yang mendustakan hujjah-hujjah Allah dan bukti-bukti kebenaraNya akibatnya kamu akan termasuk orang-orang yang merugi, yang Allah akan memurkai mereka dan mereka akan memperoleh siksaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Dan jangan sekali-kali engkau termasuk di antara orang-orang yang mendustakan hujah-hujah dan bukti-bukti dari Allah. Karena dengan begitu engkau akan termasuk ke dalam golongan orang-orang yang merugi. Yaitu orang-orang yang merugikan dirinya sendiri dengan cara menjerumuskannya ke dalam jurang kehancuran disebabkan oleh kekafiran mereka. Semua peringatan itu dimaksudkan untuk menjelaskan betapa bahayanya kebimbangan dan pendustaan tersebut. Jika tidak, sesungguhnya Nabi terpelihara dari kesalahan semacam itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Allah melarang rasul-Nya untuk menjadi seperti orang-orang yang mendustakan mukjizat-mukjizat dan dalil-dalil yang jelas, agar tidak termasuk orang-orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95 Maka kamu sekali-kali janganlah termasuk orang-orang yang mendustakan ayat-ayat kauniyah dan manziliyyah (Al-Qur’an) Allah yang menyebabkan kamu tergolong orang yang merugi di dunia dan akhirat. Ini adalah untuk memotivasi dan meneguhkan serta untuk memberi perhatian bagi umat sebagai asas bagi pemimpin dan teladannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jangan sekali-kali kamu termasuk orang-orang yang mendustakan ayat-ayat Allah sehingga kamu tergolong orang-orang yang merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. “Dan sekali-kali janganlah kamu termasuk orang-orang yang mendustakan ayat-ayat Allah sehingga menyebabkanmu termasuk orang-orang yang rugi.” Kesimpulannya adalah bahwa Allah melarang dua perkara: meragukan al-Quran dan mempertanyakan kebenarannya, lebih buruk dari itu adalah mendustakannya. Padahal al-Quran itu adalah ayat-ayat Allah yang jelas yang tidak menerima pendustaan dari segi manapun. Allah menjadikan kerugian sebagai akibat atas hal ini yaitu ketidakberuntungan dengan pendustaan ini, dan kerugian itu dengan lenyapnya pahala di dunia dan akhirat dan diraihnya azab di dunia dan akhirat. Larangan terhadap sesuatu adalah perintah kepada sebaliknya, maka ini berarti perintah untuk membenarkan al-Quran secara sempurna, kemantapan hati kepadanya dan memperhatikannya dengan mengkaji dan mengamalkannya. Dengan itu seorang hamba termasuk orang-orang yang beruntung yang mendapatkan keinginan mulia, sasaran yang berhrga, dan keutamaan yang sempurna, serta kerugian menjauh darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 95: Ayat 94-95 menjelaskan bahwa Allah Subhaanahu wa Ta'aala melarang dua hal; meragukan Al Qur’an dan mendustakannya, di mana orang yang melakukannya akan menjadi rugi; kehilangan pahala di dunia dan di akhirat dan sebaliknya, malah mendapatkan siksa di dunia dan akhirat. Larangan terhadap sesuatu adalah perintah kepada kebalikannya, sehingga kita diperintahkan membenarkannya secara sempurna, merasa tenang kepadanya serta mendatanginya baik dengan mengilmuinya maupun dengan mengamalkan, sehingga seorang hamba memperoleh keuntungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 95",
    "description": "Setelah dilarang meragukan kebenaran wahyu yang diturunkan kepada nabi Muhammad, lalu ditegaskan, janganlah sekali-kali engkau termasuk orang yang mendustakan, yakni mengingkari ayat-ayat Allah, nanti engkau termasuk orang yang rugi, yakni celaka bahkan dalam kecelakaan yang besar, karena jauh dari rahmat Allah. Sungguh, orang-orang yang telah dipastikan mendapat ketetapan tuhanmu, yakni mereka memilih tidak akan menerima kebenaran, maka pasti mereka tidaklah akan beriman, meskipun mereka mendapat, yakni menyaksikan dan telah datang kepada mereka segala bukti tanda-tanda kebesaran Allah, hingga mereka menyaksikan, yakni merasakan azab yang pedih. Ketika azab itu datang, iman seseorang sudah tidak berguna lagi."
  }
]