[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang pada dirinya mereka telah berlaku pasti ketetapan Tuhanmu (wahai Rasul), untuk menjauhkan mereka dari rahmatNya dan menimpa siksanNya bagi mereka, mereka tidak akan mengimani hujjah-hujjah Allah dan tidak mengakui keesaaNya, serta tidak mengerjakan syariatNya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Sesungguhnya orang-orang yang telah diputuskan oleh Allah bahwa mereka akan mati di atas kekafiran karena kekerasan hati mereka untuk mempertahankannya, mereka tidak akan beriman selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96-97. Sungguh orang-orang yang tetap dalam kekafiran berhak mendapatkan laknat Allah; mereka dijauhkan dari rahmat Allah sehingga tidak beriman kepada Allah dan Rasul-Nya meski telah datang kepada mereka segala pelajaran dan ibrah, hingga mereka menyaksikan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. إِنَّ الَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُونَ (Sesungguhnya orang-orang yang telah pasti terhadap mereka kalimat Tuhanmu, tidaklah akan beriman) Yakni telah ditetapkan kepada mereka bahwa mereka akan terus-menerus dalam kekafiran sampai mati dalam keadaan kafir, mereka tidak akan beriman dalam keadaan apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96 Sesungguhnya orang-orang yang telah pasti terhadap mereka kalimat Tuhanmu terkait kebenaran azab, atau ketentuan hukuman atas mereka tidaklah akan beriman kepada Allah sebagai Tuhan yang Esa akibat keteguhan mereka atas kekufuran,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang telah pasti} pasti dan tetap {ketentuan Tuhanmu kepada mereka itu} ketentuan Tuhanmu bahwa sesungguhnya mereka tetap dan mati dalam kekufuran {tidak akan beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96-97. Allah berfirman, “Sesungguhnya orang-orang yang kalimat (ketetapan azab) Rabbmu telah pasti terhadap mereka.” Yakni mereka termasuk orang-orang yang menyimpang, sesat dan penghuni Neraka. Mereka pasti menuju kepada apa yang ditetapkan dan ditakdirkan oleh Allah. Mereka tidak akan beriman walaupun setiap ayat datang kepadanya. Ayat-ayat Allah hanya menambah kesesatan di atas kesesatan mereka. Allah tidak menzhalimi mereka, akan tetapi merekalah yang menzhalimi diri mereka sendiri dengan menolak kebenaran manakala ia hadir kepada mereka pertama kali, maka Allah menghukum mereka dengan menutup rapat hati, pendengaran dan penglihatan mereka. Mereka tidak beriman sehingga mereka melihat siksa yang pedih yang dijanjikan kepada mereka. Pada saat itu, mereka mengetahui haqqul yaqin bahwa apa yang mereka pegang itulah kesesatan sebenarnya dan apa yang dibawa oleh para rasul itulah kebenaran, akan tetapi pada waktu itu iman mereka tidak lagi berguna untuk mereka. Pada hari itu dalih orang-orang zhalim tidak bermanfaat bagi mereka, dan mereka tidak diberi maaf. Adapun ayat-ayat Allah maka ia berguna bagi orang yang berhati atau dia menyimak sedangkan dia menyaksikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 96: Maksud ayat ini adalah, bahwa orang-orang yang telah ditetapkan Allah dalam Lauh Mahfuzh bahwa mereka akan mati dalam kekafiran; selamanya tidak akan beriman. Allah tidaklah menzalimi mereka, akan tetapi merekalah yang menzalimi dirinya sendiri dengan menolak kebenaran ketika datang, maka Allah menghukum mereka dengan mengecap hati mereka, pendengaran mereka dan penglihatan mereka ehingga mereka pun tidak beriman sampai mereka menyaksikan azab yang pedih. Ketika itulah mereka mengetahui kebenaran ecara yakin dan bahwa apa yang dibawa rasul adalah benar, namun mereka berada dalam waktu yang iman mereka tidak bermanfaat apa-apa. Allah Subhaanahu wa Ta'aala berfirman: “Maka pada hari itu tidak bermanfaat (lagi) bagi orang-orang yang zalim permintaan uzur mereka, dan tidak pula mereka diberi kesempatan bertaubat lagi.” (Terj. Ar Ruum: 57) adapaun ayat-ayat Allah, hanyalah bermanfaat bagi mereka yang memiliki hati atau menyiapkan pendengarannya lagi hadir menyaksikan (tidak berpaling).."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 96",
    "description": "Sungguh, orang-orang yang telah dipastikan mendapat ketetapan tuhanmu, yakni mereka memilih tidak akan menerima kebenaran, maka pasti mereka tidaklah akan beriman, meskipun mereka mendapat, yakni menyaksikan dan telah datang kepada mereka segala bukti tanda-tanda kebesaran Allah, hingga mereka menyaksikan, yakni merasakan azab yang pedih. Ketika azab itu datang, iman seseorang sudah tidak berguna lagi"
  }
]