[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "walaupun datang kepada mereka setiap nasihat dan pelajaran sampai mereka menyaksikan sendiri siksaan yang pedih. Maka pada Saat itulah mereka hendak beriman padahal keimanan mereka tidak lagi berguna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Meskipun seluruh ayat-ayat syar’iyah (wahyu) maupun ayat-ayat kauniyah (alam semesta) datang kepada mereka, sampai mereka menyaksikan azab yang sangat pedih, barulah mereka menyatakan beriman, ketika iman itu tidak lagi berguna bagi mereka (karena sudah terlambat)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. وَلَوْ جَآءَتْهُمْ كُلُّ ءَايَةٍ (meskipun datang kepada mereka segala macam keterangan) Baik itu dari ayat-ayat kauniyah maupun ayat-ayat qur’aniyah. Mereka tidak akan mendapatkan manfaat dari hal-hal ini. حَتَّىٰ يَرَوُا۟ الْعَذَابَ الْأَلِيمَ (hingga mereka menyaksikan azab yang pedih) Mereka akan beriman saat mereka telah menyaksikan azab seperti yang dilakukan oleh Fir’aun, namun keimanan mereka tidak bermanfaat dan tidak dapat menyelamatkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97 Mereka tidak beriman meskipun datang kepada mereka segala macam mukjizat dan dalil yang jelas tentang keesaan Allah berupa bukti penciptaan dan penurunan (Al-Qur’an), hingga mereka menyaksikan azab yang pedih, sebagaimana yang dilakukan Fir’an dan ketika itu keimanan tidak berguna baginya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Meskipun telah datang kepada mereka setiap ayat sehingga mereka menyaksikan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96-97. Allah berfirman, “Sesungguhnya orang-orang yang kalimat (ketetapan azab) Rabbmu telah pasti terhadap mereka.” Yakni mereka termasuk orang-orang yang menyimpang, sesat dan penghuni Neraka. Mereka pasti menuju kepada apa yang ditetapkan dan ditakdirkan oleh Allah. Mereka tidak akan beriman walaupun setiap ayat datang kepadanya. Ayat-ayat Allah hanya menambah kesesatan di atas kesesatan mereka. Allah tidak menzhalimi mereka, akan tetapi merekalah yang menzhalimi diri mereka sendiri dengan menolak kebenaran manakala ia hadir kepada mereka pertama kali, maka Allah menghukum mereka dengan menutup rapat hati, pendengaran dan penglihatan mereka. Mereka tidak beriman sehingga mereka melihat siksa yang pedih yang dijanjikan kepada mereka. Pada saat itu, mereka mengetahui haqqul yaqin bahwa apa yang mereka pegang itulah kesesatan sebenarnya dan apa yang dibawa oleh para rasul itulah kebenaran, akan tetapi pada waktu itu iman mereka tidak lagi berguna untuk mereka. Pada hari itu dalih orang-orang zhalim tidak bermanfaat bagi mereka, dan mereka tidak diberi maaf. Adapun ayat-ayat Allah maka ia berguna bagi orang yang berhati atau dia menyimak sedangkan dia menyaksikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 97: Barulah mereka beriman. Namun beriman ketika itu tidaklah bermanfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 97",
    "description": "Sungguh, orang-orang yang telah dipastikan mendapat ketetapan tuhanmu, yakni mereka memilih tidak akan menerima kebenaran, maka pasti mereka tidaklah akan beriman, meskipun mereka mendapat, yakni menyaksikan dan telah datang kepada mereka segala bukti tanda-tanda kebesaran Allah, hingga mereka menyaksikan, yakni merasakan azab yang pedih. Ketika azab itu datang, iman seseorang sudah tidak berguna lagi. Pada ayat sebelumnya dijelaskan bahwa orang-orang yang memilih tidak menerima kebenaran, maka mereka tidak akan beriman sebelum mereka merasakan azab yang pedih. Lalu dalam ayat ini dijelaskan bahwa Allah seolah menyayangkan hal tersebut dengan menyatakan, maka mengapa tidak ada penduduk suatu negeri pun yang beriman, sebelum datangnya azab kepada mereka, lalu imannya itu bermanfaat kepadanya selain kaum nabi yunus ' ketika mereka yakni kaum nabi yunus beriman dan bertobat dari dosa-dosa mereka, maka kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan kami beri kesenangan kepada mereka sampai waktu tertentu, yakni datangnya ajal mereka."
  }
]