[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak akan bermanfaat keimanan satu negeripun yang beriman setelah menyaksikan siksaan (yang datang) selain kaum yunus bin matta asa , karena sesungguhnya mereka tatkala mereka meyakini siksaan akan menimpa mereka, mereka bertaubat kepada Allah dengan taubat nasuha. Maka tatkala tampak jelas keseriusan dari mereka dalam taubat mereka, maka kami angkat dari mereka siksaan yang menghinakan setelah sudah mendekat kepada mereka, dan membiarkan mereka di dunia bersenang-senang hingga waktu ajal mereka berakhir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Tidak ada penduduk negeri yang menjadi sasaran dakwah Rasul Kami mau beriman dengan iman yang diakui sebelum menyaksikan azab, yaitu iman yang berguna bagi mereka karena terjadi sebelum mereka menyaksikan azab, kecuali kaum Yunus ketika mereka menyatakan beriman dengan iman yang sungguh-sungguh. Maka Kami bebaskan mereka dari siksaan kehinaan dan kenistaan di dunia. Dan Kami beri mereka kenikmatan hidup mereka sampai akhir hayat mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Syeikh Ibnu Taimiyah berkata, firman Allah (فلولا كانت قرية آمنت); makna \"لولا\" adalah ‘tidakkah’menurut para ulama bahasa Arab. Dan menurut Ibnu Abbas, maknanya adalah ‘tidak ada’; sehingga maksud ayat ini adalah tidak ada negeri yang beriman penduduknya yang bermanfaat bagi mereka keimanan itu kecuali kaum Nabi Yunus. Sedangkan dalam firman Allah: (كشفنا عنهم عذاب الخزي في الحياة الدنيا), dijelaskan bahwa yang tersingkap adalah azab di dunia, meski tidak dijelaskan secara langsung, karena itu adalah ayat yang umum; dan al-Qur’an membedakan antara dua jenisnya, adapun kaum Nabi Yunus beriman dengan iman yang bermanfaat bagi mereka dan beriman sebelum datangnya ajal, sedangkan selain mereka beriman dengan keimanan yang dusta seperti para pengikut Fir’aun atau beriman setelah datangnya ajal, seperti orang-orang yang disebutkan dalam ayat: (فلم يك ينفعهم إيمانهم...) Ghafir: 85. (Tafsir Syeikhul Islam 3/499). Kaum Nabi Yunus tinggal di kota Mushil, Irak. Ketika mereka beriman kepada Yunus dan mengakui ketauhidan yang diserukannya setelah azab menimpa mereka; maka Kami angkat azab kehinaan dari kehidupan dunia mereka, sehingga Kami tidak segera mengazab mereka, namun memuliakan mereka sehingga mereka dapat menikmati kehidupan dunia sampai ajal mereka datang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. فَلَوْلَا كَانَتْ قَرْيَةٌ ءَامَنَتْ فَنَفَعَهَآ إِيمٰنُهَآ (Dan mengapa tidak ada (penduduk) suatu kota yang beriman, lalu imannya itu bermanfaat kepadanya) Tidak adakah penduduk dari salah satu kota yang telah kami binasakan beriman dengan iman yang sebenarnya, yaitu dengan keimanan yang ikhlas kepada Allah sebelum mereka menyaksikan azab-Nya, dan tidak menunda-nundanya sebagaimana yang dilakukan oleh Fir’aun. إِلَّا قَوْمَ يُونُسَ(selain kaum Yunus) Yakni, akan tetapi kaum Nabi Yunus. لَمَّآ ءَامَنُوا۟ (Tatkala mereka (kaum Yunus itu), beriman) Dengan keimanan yang sebenarnya sebelum mereka menyaksikan azab. كَشَفْنَا عَنْهُمْ عَذَابَ الْخِزْىِ (Kami hilangkan dari mereka azab yang menghinakan) Yakni azab yang pernah diancamkan oleh nabi Yunus kepada mereka, bahwa mereka akan ditimpakan kepada mereka, namun mereka belum melihat azab itu dan baru sekedar melihat tanda-tandanya saja. وَمَتَّعْنٰهُمْ إِلَىٰ حِينٍ (dan Kami beri kesenangan kepada mereka sampai kepada waktu yang tertentu) Yakni setelah azab itu dihindarkan dari mereka. Imam Qatadah berpendapat tentang ayat ini: azab yang dihindarkan ini belum pernah terjadi pada umat-umat sebelum umat Nabi Yunus, tidak ada suatu negeripun yang kafir kemudian beriman setelah melihat azab mendapat manfaat dari keimanannya. Namun Allah mengecualikan umat Nabi Yunus yang tinggal di kota Nainawa di negeri Mushil, setelah mereka kehilangan Nabi mereka, Allah mengilhamkan pertaubatan kedalam hati mereka, kemudian mereka mengenakan pakaian using (untuk mengungkapkan pertaubatan mereka) dan mengeluarkan hewan-hewan ternak, dan mememisahkan antara hewan ternak dari anaknya, lalu mereka berdoa kepada Allah dengan mengangkat suara mereka selama empat puluh hari. Setelah Allah mendapati kejujuran hati mereka dalam bertaubat dan menyesal atas perbuatan yang telah mereka lakukan, Allah menghindarkan dari mereka azab setelah azab itu hampir-hampir turun kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98 Dan jika saja penduduk kota yang kami hancurkan ini beriman sebelum melihat datangnya azab dan tidak menangguhkan iman mereka sebagaimana Fir’aun sehingga imannya itu bermanfaat atas dirinya sehingga Allah menerimanya dan mengangkat azabnya, namun kaum Yunus yang bertauhid itu bermanfaat keimanannya tatkala mereka mau beriman dan ikhlas ketika melihat tanda-tanda azab dan tidak menangguhkannya sampai waktu terjadinya azab itu. Lalu Kami hilangkan dari mereka azab yang menghinakan yang dijanjikan Yunus kepada mereka. Dan Kami beri mereka kebaikan dan manfaat dunia sampai waktu yang telah ditetapkan. Ini adalah pemberian perhatian dan peringatan bagi penduduk Mekah dan sekitarnya agar memilih untuk beriman dan meninggalkan kekufuran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa tidak} mengapa tidak {ada suatu negeri yang beriman sehingga imannya itu bermanfaat kepadanya, selain kaum Yunus. Ketika mereka beriman, Kami mengangkat dari mereka azab yang menghinakan} yang merendahkan dan menghinakan {dalam kehidupan dunia dan Kami memberikan kesenangan kepada mereka sampai waktu yang ditentukan} sampai waktu yang telah ditentukan bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Allah berfirman, “Dan mengapa tidak ada (penduduk) suatu kota”, dari kota-kota yang mendustakan “yang beriman”, ketika melihat azab. “Lalu imannya itu bermanfaat kepadanya.” Maksudnya, tak seorang pun mengambil manfaat dari imannya ketika melihat azab, sebagaimana Alllah berfirman tentang Firaun dalam ayat yang belum jauh berlalu, ketika dia berkata, \"\"Saya percaya bahwa tidak ada Tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan saya termasuk orang-orang yang berserah diri (kepada Allah)\".(Yunus:90), maka dikatakan kepadanya, \"Apakah sekarang (baru kamu percaya), padahal sesungguhnya kamu telah durhaka sejak dahulu, dan kamu termasuk orang-orang yang berbuat kerusakan.\"(Yunus:91), sebagaimana Firman Allah, \"Maka tatkala mereka melihat azab Kami, mereka berkata: \"Kami beriman hanya kepada Allah saja, dan kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah\".Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami. Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan di waktu itu binasalah orang-orang kafir.\"(Al-Mu’min:84-85). Firman Allah \"(Demikianlah keadaan orang-orang kafir itu), hingga apabila datang kematian kepada seseorang dari mereka, dia berkata: \"Ya Tuhanku kembalikanlah aku (ke dunia), agar aku berbuat amal yang saleh terhadap yang telah aku tinggalkan. Sekali-kali tidak. Sesungguhnya itu adalah perkataan yang diucapkannya saja. Dan di hadapan mereka ada dinding sampal hari mereka dibangkitkan.\"(Al-Mu’minun:99-100). Hikmahnya dalam hal ini jelas karena iman yang terpaksa bukanlah iman yang sebenarnya karena seandainya siksa yang memaksanya beriman dibatalkan niscaya dia kembali kepada kekufuran, FirmanNya, “Melainkan kaum Yunus? Tatkala mereka (Kaum Yunus itu), beriman, Kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan Kami beri kesenangan kepada mereka sampai kepada waktu yang tertentu.” Kaum Yunus dikecualikan dari keumuman di atas, dan tentu pasti ada hikmah di balik itu (bagi Allah yang mengetahui yang ghaib dan yang Nampak) yang tidak kita ketahui dan tidak terjangkau oleh pemahaman kita, Allah berfirman \"Sesungguhnya Yunus benar-benar salah seorang rasul, (ingatlah) ketika ia lari, ke kapal yang penuh muatan. kemudian ia ikut berundi lalu dia termasuk orang-orang yang kalah dalam undian. Maka ia ditelan oleh ikan besar dalam keadaan tercela. Maka kalau sekiranya dia tidak termasuk orang-orang yang banyak mengingat Allah, niscaya ia akan tetap tinggal di perut ikan itu sampai hari berbangkit. Kemudian Kami lemparkan dia ke daerah yang tandus, sedang ia dalam keadaan sakit. Dan Kami tumbuhkan untuk dia sebatang pohon dari jenis labu. Dan Kami utus dia kepada seratus ribu orang atau lebih. Lalu mereka beriman, karena itu Kami anugerahkan kenikmatan hidup kepada mereka hingga waktu yang tertentu.\" (Ash-Shafaat:139-148). Mungkin hikmahnya adalah bahwa selain mereka dari kalangan orang-orang yang celaka, kalau mereka dikembalikan (seperti keadaan mereka semula), niscaya mereka akan kembali kepada sesuatu yang mereka dilarang darinya. Lain halnya dengan kaum Yunus, Allah mengetahui bahwa iman mereka akan berlanjut bahkan memang berlanjut, dan mereka berpegang teguh padanya. Wallahu a’lam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 98: Sebelum turunnya azab. Saat melihat tanda-tanda akan turun azab. Yakni sampai tiba ajal mereka. Hikmah mengapa selain kaum Yunus dibinasakan adalah karena ketika dihilangkan azab dari mereka, niscaya mereka kembali berbuat kekafiran, adapun kaum Yunus, maka Allah Subhaanahu wa Ta'aala mengetahui bahwa keimanan mereka akan tetap langgeng, dan ternyata demikian, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 98",
    "description": "Pada ayat sebelumnya dijelaskan bahwa orang-orang yang memilih tidak menerima kebenaran, maka mereka tidak akan beriman sebelum mereka merasakan azab yang pedih. Lalu dalam ayat ini dijelaskan bahwa Allah seolah menyayangkan hal tersebut dengan menyatakan, maka mengapa tidak ada penduduk suatu negeri pun yang beriman, sebelum datangnya azab kepada mereka, lalu imannya itu bermanfaat kepadanya selain kaum nabi yunus ' ketika mereka yakni kaum nabi yunus beriman dan bertobat dari dosa-dosa mereka, maka kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan kami beri kesenangan kepada mereka sampai waktu tertentu, yakni datangnya ajal merekasetelah dijelaskan tentang manfaat iman lalu dijelaskan bahwa beriman atau tidak beriman adalah pilihan bagi setiap orang, karena jika tuhanmu menghendaki, tentulah beriman semua orang di bumi seluruhnya. Tetapi apakah kamu wahai nabi Muhammad hendak memaksa manusia agar mereka menjadi orang-orang yang beriman sedangkan mereka menutup hati untuk menerima kebenaran'"
  }
]