[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya tuhanmu (wahai rasul), Menghendaki keimanan bagi penduduk bumi secara keseluruhan, pastilah mereka akan beriman semuanya kepada risalah yang kamu bawa kepada mereka. Akan tetapi, Dia memiliki hikmah dalam hal tersebut. Dia memberikan hidayah kepada yang Dia kehendaki, dan menyesatkan orang yang dikehendakiNya, sejalan dengan sifat kebijaksanaanNya. Dan bukanlah termasuk kuasamu untuk memaksa manusia untuk beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Sekiranya Tuhanmu -wahai Rasul- menghendaki agar semua orang yang ada di bumi ini beriman, niscaya mereka semua pasti beriman. Akan tetapi Allah tidak menghendaki hal itu karena hikmah tertentu. Dia menyesatkan orang yang dikehendaki-Nya berdasarkan keadilannya. Dan Dia memberikan petunjuk kepada orang yang dikehendaki-Nya berdasarkan karunia-Nya. Maka engkau tidak kuasa memaksa orang untuk beriman. Karena bimbingan menuju iman adalah hak khusus Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Hai Rasulullah, seandainya Tuhanmu menghendaki, niscaya seluruh manusia dan jin yang ada di bumi akan beriman kepada Allah. Maka apakah kamu akan memaksa orang lain untuk beriman agar ia mengimani risalahmu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. وَلَوْ شَآءَ رَبُّكَ لَاٰمَنَ مَن فِى الْأَرْضِ كُلُّهُمْ جَمِيعًا ۚ (Dan jikalau Tuhanmu menghendaki, tentulah beriman semua orang yang di muka bumi seluruhnya) Yakni mereka pasti akan bersatu dalam keimanan tanpa ada perselisihan atau pertengkaran, namun Allah tidak menghendaki itu karena hal ini menyelisihi kemaslahatan yang dikehendaki Allah berupa hikmah yang dalam. أَفَأَنتَ تُكْرِهُ النَّاسَ حَتَّىٰ يَكُونُوا۟ مُؤْمِنِينَ(Maka apakah kamu (hendak) memaksa manusia supaya mereka menjadi orang-orang yang beriman semuanya) Karena hal itu diluar kemampuan dan kekuasaanmu wahai Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99 Wahai Rasul, jikalau Tuhanmu menghendaki untuk menetapkan keimanan manusia semua terhadap risalahmu dalam satu waktu, tentulah semua orang di muka bumi akan beriman seluruhnya. Namun Allah SWT tidak melakukannya supaya mereka memilih. Dan keimanan dan perbuatan itu sesuai kehendah Allah SW. Maka apakah kamu (hendak) memaksa manusia lainnya supaya mereka menjadi orang-orang yang beriman kepada risalahmu yang mana Allah tidak menghendakinya? Itu bukanlah wilayah kuasamu dan kamu tidak lain hanya menyampaikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Tuhanmu berhendak, sungguh telah beriman semua orang di bumi seluruhnya. Apakah kamu akan memaksa manusia sampai mereka menjadi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Allah berfirman kepada NabiNya, Muhammad, “Dan jikalau Rabbmu menghendaki, tentulah beriman semua orang yang di muka bumi seluruhnya”, dengan cara mengilhamkan iman kepada mereka dan mengarahkan hati mereka kepada takwa, kodratNya layak untuk itu, akan tetapi hikmahNya menuntut ada yang beriman dan ada yang kafir. “Maka apakah kamu (hendak) memaksa manusia supaya mereka menjadi orang-orang yang beriman semuanya?” maksudnya kamu tidak mampu melakukan itu, hal itu di luar kemampuanmu, karena selain Allah taka da yang mampu melakukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 99: Akan tetapi hikmah Allah Subhaanahu wa Ta'aala menghendaki, bahwa di antara mereka ada yang mukmin dan ada yang kafir. Yang tidak dikehendaki Allah beriman. Kamu tidak akan sanggup menjadikan mereka beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 99",
    "description": "Setelah dijelaskan tentang manfaat iman lalu dijelaskan bahwa beriman atau tidak beriman adalah pilihan bagi setiap orang, karena jika tuhanmu menghendaki, tentulah beriman semua orang di bumi seluruhnya. Tetapi apakah kamu wahai nabi Muhammad hendak memaksa manusia agar mereka menjadi orang-orang yang beriman sedangkan mereka menutup hati untuk menerima kebenaran' keimanan tidak bisa dipaksakan, tetapi harus atas dasar kerelaan, dan tidak seorang pun akan beriman kecuali dengan izin Allah, dan Allah menimpakan azab, yakni berupa kekufuran yang berakibat pada kekotoran jiwa dan kegoncangan hati kepada orang yang tidak mengerti, yakni tidak mempergunakan akalnya untuk memikirkan petunjuk-Nya, sehingga tidak bisa melihat dan menerima kebenaran."
  }
]