[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah bersumpah dengan kuda perang yang berlari kencang menuju musuh, hingga terdengar suara nafasnya karena kencangannya dia berlari. Tidak boleh bagi makhluk bersumpah kecuali dengan nama Allah, karena bersumpah dengan selain Allah adalah syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan kuda yang berlari hingga terdengar suara dari nafasnya karena larinya yang kencang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-5. Allah bersumpah dengan tiga sumpah: dengan kuda yang lari sambil bersuara karena berlari begitu cepat; dengan kuda yang mengeluarkan percikan api dari kakinya yang menghentak bebatuan; dan dengan kuda yang menyerang musuh pada pagi hari sehingga menerbangkan debu-debu di daerah musuh karena berlari sangat kencang, sehingga kuda itu membawa penuggangnya ke tengah kumpulan para musuh, sehingga dia benar-benar di dalam medan perang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالْعٰدِيٰتِ (Demi kuda perang yang berlari kencang) Yang dimaksud adalah kuda yang berlari bersama penunggangnya yang berperang di jalan Allah menuju pasukan musuh yang kafir dan menentang Allah dan Rasulullah. ضَبْحًا(dengan terengah-engah) Makna (الضبح) yakni suara nafas kuda saat berlari."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah bersumpah atas kerasnya pengingkaran manusia dengan sebutan kuda perang yang berlari kencang dengan terengah-engah, hal itu juga sebagai peringatan bagi orang mengingkari kebenaran bahwasanya kuda tidak akan melupakan kebaikan majikannya terhadapnya, bahkan ketempat kematian sekalipun ia akan tetap setiap membawa majikannya; sebagai penghormatan atas kebaikan sang majikan, maka jangan sampai binatang lebih baik dan lebih hormat daripada anda wahai ummat manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Aku bersumpah demi kuda para mujahid yang berlari (kuda-kuda yang berlari) yang mengeluarkan suara, yaitu nafas kuda ketika berlari. “Al-‘Adiyaht” berasal dari kata “Al-‘Adwu” yang artinya adalah berlari, sedangkan “Adh-dhabhu” adalah suara nafas. Al-Bazzar, Imam Hakim dan lainnya dari Ibnu Abbas berkata: “Rasulallah SAW pernah melepas seekor kuda, lalu setelah satu bulah lewat, beliau tidak mendapatkan kabar tentangnya, kemudian turunlah ayat {wal ‘aadiyat}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi kuda-kuda perang yang berlari kencang terengah-engah} Aku bersumpah demi kuda yang berlari untuk jihad di jalan Allah sehingga terdengar suara nafasnya, karena sangat cepat musuhnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah bersumpah dengan kuda, karena pada kuda terdapat tanda-tanda kekuasaan Allah yang amat jelas dan nikmatNya yang nyata padanya yang diketahui oleh manusia. Allah bersumpah dengan kuda pada kondisi dimana tidak ada hewan lain yang menyertainya seraya berfirman, “Demi kuda perang yang berlari kencang dengan terengah-engah,” yakni kuda yang berlari kencang dan kuat serta terengah-engah; suara nafasnya yang keluar dari dadanya karena kencangnya lari."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالْعَادِيَاتِ } Demi kuda-kuda perang yang berlari kencang, Allah - عز وجل - bersumpah demi kebesarannya, yakni kedudukan yang dimiliki oleh kuda-kuda perang itu, dan ayat-ayat keagungan Allah yang terdapat padanya. { ضَبْحًا } Yaitu suara terengah-engah yang keluar dari dada kuda ketika melakukan perlawanan, atau sedang melaju kencang mengejar lawan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالْعَادِيَاتِ ضَبْحًا \" Demi kuda perang yang berlari kencang dengan terengah-engah,\" Ini adalah sumpah, dan kata al-'aadiyaat (yang berlari kencang) adalah sifat untuk sesuatu yang disembunyikan (dihapus), apakah itu? Apakah yang dimaksudkan adalah kuda, sehingga maknanya adalah demi kuda-kuda yang berlari kencang, ataukah yang dimaksudkan pada ayat ini adalah unta, sehingga maknanya: Demi unta-unta yang berlari? Dalam masalah ini ada dua pendapat dari kalangan ahli tafsir: Di antara mereka ada yang mengatakan: Bahwa yang dimaksudkan pada ayat ini adalah unta, sehingga makna ayatnya adalah demi unta-unta yang berlari. Unta yang dimaksudkan di sini adalah unta yang berlari dari arafah menuju muzdalifah, kemudian ke Mina. Ini terjadi ketika ibadah haji, mereka menjadikan dalil pendapat mereka ini dengan status surat ini berupa surat makkiyah, dan (pada saat surat ini turun) tidak ada jihad dengan menunggangi kuda sehingga kuda dijadikan atas nama sumpah (dalam surat ini). Sedangkan pendapat kedua, mayoritas ahli tafsir –dan inilah pendapat yang benar-: Yang dimaksudkan pada ayat ini adalah kuda, sehingga makna ayat ini: Demi kuda-kuda yang berlari. Kuda-kuda yang berlari kencang (saat perang) sudah dikenal di kalangan orang-orang arab dahulu walau sebelum jihad disyari'atkan. Di sana terdapat kuda-kuda yang berlari menerjang musuh-musuhnya baik di atas kebenaran atau pun tidak, sebelum datangnya islam, sedangkan setelah kedatangan Islam, maka kuda-kuda lari menerjang musuh-musuhnya dengan kebenaran. Allah ta'ala berfirman: وَالْعَادِيَاتِ \"Demi kuda-kuda perang yang berlari\" al-'Aadii adalah isim fa'il dari kata اَلْعَدْوُ [al-'adwu] maknanya berjalan dan berlalu dengan cepat. ضَبْحًا \"terengah\" adh-Dhabh adalah suara yang terdengar dari mulut kuda saat ia berlari kencang, terdapat suara yang keluar dari dada kuda-kuda itu. Ini menunjukkan betapa kuat dan kencangnya lari kuda-kuda itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 1: Allah bersumpah dalam surat ini dengan sebagian dari makhluknya, Allah bersumpah dengan kuda (perang), yang digunakan untuk di jalan Allah dan berlari dengan kencang, terdengar langkah kakinya yang menghembuskan nafas dengan kencang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah dengan kuda karena di dalamnya terdapat tanda-tanda kekuasaan Allah yang jelas dan nikmat-nikmat-Nya yang tampak jelas. Dia bersumpah dengan kuda-kuda itu ketika kuda-kuda itu melakukan sesuatu yang tidak dilakukan oleh hewan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 1",
    "description": "1-6. Demi kuda perang yang berlari kencang dan bernafas terengah-engah ke arah musuh dengan penuh keberanian dan semangat guna membawa tuannya berperang di jalan Allah. Dan demi kuda yang memercikkan bunga api karena hentakan kuku kakinya beradu dengan batu batu. Hal ini menunjukkan keberaniannya menghadapi rintangan sebesar apa pun. Dan demi kuda yang menyerang dengan tiba-tiba pada waktu pagi hal ini menunjukkan kesiagaannya untuk berjihad tanpa mengenal waktu, sehingga dengan serangan kuda-kuda itu menerbangkan debu yang tebal, tanda betapa dahsyat serangan mereka ke arah musuh, lalu menyerbu bersama dengan kepulan debu itu ke tengah-tengah kumpulan musuh dengan gagah berani. Demi kuda-kuda perang yang demikian sifatnya, sungguh manusia itu enggan bersyukur dan sangat ingkar kepada nikmat tuhannya. Manusia, kecuali yang dirahmati Allah, malas bersyukur ketika mendapatkan nikmat dan tidak mau memenuhi kewajiban yang dibebankan kepadanya"
  }
]