[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya tuhan mereka pada hari itu maha teliti terhadap mereka dan amal-amal mereka, tidak ada sesuatupun yang samar bagi NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Sesungguhnya Rabb mereka pada hari itu Maha Mengetahui keadaan mereka, tidak ada sesuatu pun dari urusan hamba-hamba-Nya yang tersembunyi dari-Nya dan Dia akan membalas mereka karenanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌۢ (sesungguhnya Tuhan mereka pada hari itu Maha Mengetahui keadaan mereka) Yakni hendaklah manusia mengetahui bahwa Tuhan yang membangkitkan mereka Mha Mengetahui, tidak ada yang tersembunyi bagi-Nya ketika itu, kemudian Dia akan membalas mereka di hari itu. Maka jika mereka telah mengetahui hal itu maka tidak patut baginya menyibukkan diri dengan kecintaan harta sehingga lalai dari rasa syukur kepada Tuhan mereka dan dari ibadah dan beramal untuk hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-11. Apakah dia tidak mengerti jika dihamburkan dan dikeluarkan sesuatu dari bumi yaitu jasad-jasad orang mati. Ketika mereka dibangkitkan kemudian diperlihatkan dan dikumpulkan sesuatu yang tersembunyi dibalik dadanya berupa kebaikan dan keburukan atau niat baik dan niat buruk. Sesungguhnya Tuhan mereka Maha Mengetahui tentang mereka.Tidak ada yang dapat mereka sembunyikan, dan Dia membalas semua amal perbuatan mereka pada hari itu (kiamat)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhan mereka pada hari itu benar-benar Maha Mengetahui (keadaan) mereka}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Sesungguhnya Rabb mereka pada hari itu Maha mengetahui keadaan mereka,” yakni mengetahui amalan-amalan mereka, lahir maupun batin, samar atau nyata, dan Allah akan membalas mereka atasnya. Allah menyebutkan berita mereka secara khusus padahal Allah Maha Mengetahui mengenai mereka di setiap saat, karena yang dimaksudkan pembalasan atas perbuatan-perbuatan itu bersumber dari ilmu dan pengetahuan Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّ رَبَّهُمْ } Sesungguhnya tuhan mereka, yaitu Allah ,{ بِهِمْ يَوْمَئِذٍ } pada hari kiamat { لَخَبِيرٌ } maha mengetahui apa yang disembunyikan oleh mereka didunia maupun diakhirat, dan pada hari kiamat itu yang dimana segala rahasia akan nampak dihadapan Allah - عز وجل - , sesungguhnya Dia ﷻ maha mengetahui rahasia-rahasia itu sebelum ditampakkan diahadapan-Nya. { إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ لَخَبِيرٌ } Tidak satupun dapat disembunyikan dari pengetahuan Allah ﷻ , dan manusia tidak akan bisa mengingkarinya, Malaikat akan bersaksi atas perbuatan mereka, bumi, anggota tubuh, dan orang-orang disekitar juga akan menjadi saksi atas perbuatan yang telah mereka lakukan di dunia, Allah ﷻ berfirman : { الْيَوْمَ نَخْتِمُ عَلَىٰ أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ } ( Pada hari ini Kami tutup mulut mereka; dan berkatalah kepada Kami tangan mereka dan memberi kesaksianlah kaki mereka terhadap apa yang dahulu mereka usahakan ) [ Yaa Siin : 65 ] , bahkan kulit-kulit mereka juga akan bersaksi diri mereka sendiri, Allah berfirman : { وَقَالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنَا ۖ قَالُوا أَنْطَقَنَا اللَّهُ الَّذِي أَنْطَقَ كُلَّ شَيْءٍ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ وَإِلَيْهِ تُرْجَعُونَ } ( Dan mereka berkata kepada kulit mereka: “Mengapa kamu menjadi saksi terhadap kami?” Kulit mereka menjawab: “Allah yang menjadikan segala sesuatu pandai berkata telah menjadikan kami pandai (pula) berkata, dan Dialah yang menciptakan kamu pada kali pertama dan hanya kepada-Nya lah kamu dikembalikan” ) [ Fussilat : 21 ] , lalu kemana mereka akan pergi untuk menyembunyikan diri mereka pada hari itu ? , mereka tidak mendapat tempat untuk melarikan diri, Allah - عز وجل - berfirman : { وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ وَلَٰكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ } ( Kamu sekali-sekali tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan dan kulitmu kepadamu bahkan kamu mengira bahwa Allah tidak mengetahui kebanyakan dari apa yang kamu kerjakan. ) [ Fussilat : 22 ] , maka perhatikanlah bagaimana seseorang menyendiri dalam sebuah ruangan tertutup yang gelap, ataukah sedang diruang terbuka, dan tidak seorang pun yang melihat dan mendengarkannya melakukan suatu perbuatan, maka kulit dan seluruh anggota tubuhnya akan menjadi saksi atas perbuatan yang ia lakukan pada waktu dan tempat itu. Semua ayat-ayat diatas adalah merupakan rahmat dari Allah - عز وجل - untuk hamba-hamba Nya sebagai pengingat kepada kebaikan, juga sebagai pemberi peringatan akan datangnya hari kiamat, ayat-ayat Allah yang agung dan mulia menjelaskan kepada kita agar kita tidak lalai dari mengingat kepada-Nya, dan agar mempersiapkan diri untuk menghadapi hari yang agung itu dengan memperbanyak amalan shalih, Allah - عز وجل - tidak meninggalkan hamba-Nya tanpa ada sesuatu yang mengingatkannya kepada kebenaran yang akan menyelamatkan mereka dari fitnah hari kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ لَخَبِيرٌ \" sesungguhnya Tuhan mereka pada hari itu Maha Mengetahui keadaan mereka.\" Maknanya: Sesungguhnya Allah 'Azza Wa Jalla, بِهِمْ Maknanya: terhadap hamba-hamba-Nya benar benar Maha mengetahui. Ungkapan ayat ini dengan menggunakan dhamir jamak بِهِمْ dan tidak dengan tunggal بِهِ , padahal kata al-Insan (manusia) bebentuk mufrad (tunggal) secara makna. Ini berarti: Bahwa kata insan dhamir disini dikembalikan kepada kata insan secara maknya, karena makna إِنَّ الْإِنْسَانَ adalah setiap insan, dan dikaitkan pengetahuan Allah dengan hari itu (hari kiamat) إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ \" sesungguhnya Tuhan mereka pada hari itu terhadap mereka\" karena hari tersebut adalah hari pembalasan dan perhitungan, dan Allah Ta'ala Maha Mengetahui tentang hari itu dan apa-apa yang terjadi sebelumnya. Allah Jalla wa 'Alaa mengetahui apa yang terjadi, dan Allah mengetahui apa apa yang akan terjadi jika terjadi, bagaimana terjadi. Inilah tafsir ringkas tentang surat yang besar ini, siapa saja yang ingin penjelasan terperinci maka hendaknya ia membaca kitab-kitab tafsir yang merinci tafsir surat ini. Kami di sini hanya memberikan penjelasan yang ringkas. Kita meminta kepada Allah Ta'ala hidayah dan taufik, dan menjadikan kita sebagai orang yang membaca kitabullah dengan bacaan yang benar, sesungguhnya Dia Maha kuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 11: Allah menjelaskan bahwa tidak akan tersembunyi bagi-Nya sesuatupun dari apa yang telah berlalu (di dunia), dan Allah akan menampakkan segala amalan-amalan mereka beserta balasannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia melihat amal mereka yang tampak maupun yang tersembunyi, yang samar maupun yang jelas dan akan memberikan balasan terhadapnya. Dikhususkan dengan ‘pada hari itu’ meskipun sesungguhnya Allah Subhaanahu wa Ta'aala mengetahui mereka di setiap waktu, karena yang dimaksud dengannya adalah pembalasan terhadap amal yang tegak atas pengetahuan Allah Subhaanahu wa Ta'aala dan penglihatan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 11",
    "description": "Sungguh, tuhan mereka pada hari itu mahateliti terhadap keadaan mereka. Allah mencatat dengan rinci dan detail apa yang dilakukan manusia. Dengan bukti itu Allah akan menghisab dan memberi balasan yang sesuai kepada mereka. 1-2. Hari kiamat yang mengerikan; apakah hari kiamat itu' Allah mengulang penyebutan kata 'al-q'ri'ah' untuk menggugah perhatian manusia tentang kengeriannya dan peristiwa-peristiwa dahsyat yang terjadi pada hari itu."
  }
]