[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu (dengan) kuda yang memercikan api dari benturan telapak kakinya yang keras dengan batu karena kerasnya dia berlari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan bersumpah dengan kuda yang memercikkan bunga api dari kuku-kukunya ketika bertumbuk dengan bebatuan dikarenakan kuatnya tumbukan kukunya dengan batu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. فَالْمُورِيٰتِ قَدْحًا (dan kuda yang mencetuskan api dengan pukulan (kuku kakinya)) Yakni kuda yang menampakkan api yang keluar dari kakinya saat terhentak ke tanah yang keras atau bebatuan, seperti percikan korek api."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Kemudian demi kuda yang memukul-mukul bebatuan bumi sehingga mengeluarkan api dari kuku-kukunya seperti menyalakan api menggunakan batu bara. “Al-Muriyat” adalah bentuk jamak dari kata “muriyyah” yang berasal dari kata “Al-iiraa’” yang artinya adalah mengeluarkan api dari batu menggunakan batu bara contohnya. Dan “Al-Qadhu” adalah pukulan kepada batu untuk menyalakan api. “Dhabhan” dan “Qadhan” menduduki posisi haal yang bermakna sedang terengah-engah dan memukul-mukul. Dan kuda penyerang yang menyerang musuh di waktu pagi. “Shabhan” artinya waktu shubuh, kata tersebut menjadi zharaf (menunjukkan keterangan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang memercikkan bunga api} Aku bersumpah demi kuda yang menyalakan api dengan percikannya ketika berjalan di atas bebatuan karena sangat berat musuhnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Dan kuda yang mencetuskan api” dengan kuku kakinya ketika menginjak batu “dengan pukulan (kuku kakinya),” sehingga memercikkan api karena kokoh dan kuatnya kaki ketika lari."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَالْمُورِيَاتِ قَدْحًا } Dan dengan kuda yang pukulan kuku kakinya memercikkan api ketika berbenturan dengan batu saat berlari kencang melakukan perlawanan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَالْمُورِيَاتِ قَدْحًا \" dan kuda yang memercikkan api dengan pukulan (kuku kakinya),\" kata al-Muuriyaat berasal dari أَوْرَى [Aw-raa] atau وَرِيَ [wariya] maknanya percikkan, maksud dari keta tersebut adalah percikkan api ketika batu-batu dibenturkan satu sama lainnya. Seperti dikenal di kita batu pemercik api. Jika anda membenturkan batu-batu tersebut akan keluar percikan api. Kuda-kuda ini karena kuat dan kencangnya lari mereka, dan hentakannya ke bumi, ketika menghentakkan bumi berbenturan dengan bebatuan, menimbulkan percikkan api. Ini dikarenakan saking kuat dan kerasnya lari kuda-kuda tersebut, dan kerasnya hentakkan kaki mereka ke tanah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 2: Allah bersumpah dengan kuda yang memantikkan api dari kuku-kukunya yang bergesekkan dengan bebatuan ketika berlari dengan kencang. Maka berterbanganlah percikan (apinya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika berbenturan dengan batu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 2",
    "description": "1-6. Demi kuda perang yang berlari kencang dan bernafas terengah-engah ke arah musuh dengan penuh keberanian dan semangat guna membawa tuannya berperang di jalan Allah. Dan demi kuda yang memercikkan bunga api karena hentakan kuku kakinya beradu dengan batu batu. Hal ini menunjukkan keberaniannya menghadapi rintangan sebesar apa pun. Dan demi kuda yang menyerang dengan tiba-tiba pada waktu pagi hal ini menunjukkan kesiagaannya untuk berjihad tanpa mengenal waktu, sehingga dengan serangan kuda-kuda itu menerbangkan debu yang tebal, tanda betapa dahsyat serangan mereka ke arah musuh, lalu menyerbu bersama dengan kepulan debu itu ke tengah-tengah kumpulan musuh dengan gagah berani. Demi kuda-kuda perang yang demikian sifatnya, sungguh manusia itu enggan bersyukur dan sangat ingkar kepada nikmat tuhannya. Manusia, kecuali yang dirahmati Allah, malas bersyukur ketika mendapatkan nikmat dan tidak mau memenuhi kewajiban yang dibebankan kepadanya"
  }
]