[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu (dengan) kuda yang menyerang dengan pengendaranya terhadap musuh-musuh pada waktu shubuh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan bersumpah dengan kuda yang menyerang musuh-musuh di pagi hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. فَالْمُغِيرٰتِ صُبْحًا (dan kuda yang menyerang dengan tiba-tiba di waktu pagi) Yakni kuda yang menyerbu musuh pada waktu pagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Kemudian demi kuda yang memukul-mukul bebatuan bumi sehingga mengeluarkan api dari kuku-kukunya seperti menyalakan api menggunakan batu bara. “Al-Muriyat” adalah bentuk jamak dari kata “muriyyah” yang berasal dari kata “Al-iiraa’” yang artinya adalah mengeluarkan api dari batu menggunakan batu bara contohnya. Dan “Al-Qadhu” adalah pukulan kepada batu untuk menyalakan api. “Dhabhan” dan “Qadhan” menduduki posisi haal yang bermakna sedang terengah-engah dan memukul-mukul. Dan kuda penyerang yang menyerang musuh di waktu pagi. “Shabhan” artinya waktu shubuh, kata tersebut menjadi zharaf (menunjukkan keterangan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang menyerang (tiba-tiba) pada waktu pagi} Aku bersumpah demi kuda yang menyerang musuhnya dengan tiba-tiba di waktu subuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan kuda yang menyerang” musuh “di waktu pagi.” Ini adalah hal umum, karena serangan tiba-tiba biasanya dilakukan pada waktu pagi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan dengan kuda perang bersama penunggangnya yang menyerang dipagi hari."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَالْمُغِيرَاتِ صُبْحًا \" dan kuda yang menyerang dengan tiba-tiba di waktu pagi,\" Maknanya: Kuda-kuda yang menyerang musuhnya secara mendadak di waktu pagi. Ini adalah waktu terbaik dalam menyerang musuh, yaitu waktu pagi, karena musuh saat tersebut dalam kelalaian dan tertidur. Walau terbangun karena serangan, musuh masih dalam keadaan malas dan belum sadar sempurna. Maka Allah 'Azza Wa Jalla memilih keadaan ini untuk sumpah dengan kuda-kuda tersebut pada waktu terbaik untuk menyerang yaitu waktu pagi. Nabi shallallaahu 'alaihi wa sallam tidak menyerang suatu kaum pada malam hari, tapi beliau menunggu dulu hingga tiba waktu pagi, jika beliau mendengar suara azan beliau menahan serangan dan jika tidak beliau melancarkan serangannya (1) (1) Dikeluarkan Bukhari (610) dari hadits Anas Bin Malik radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 3: Allah bersumpah dengan kuda yang berubah haluan menuju ke para musuh dan menyerang mereka secara tiba-tiba di waktu subuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 3",
    "description": "1-6. Demi kuda perang yang berlari kencang dan bernafas terengah-engah ke arah musuh dengan penuh keberanian dan semangat guna membawa tuannya berperang di jalan Allah. Dan demi kuda yang memercikkan bunga api karena hentakan kuku kakinya beradu dengan batu batu. Hal ini menunjukkan keberaniannya menghadapi rintangan sebesar apa pun. Dan demi kuda yang menyerang dengan tiba-tiba pada waktu pagi hal ini menunjukkan kesiagaannya untuk berjihad tanpa mengenal waktu, sehingga dengan serangan kuda-kuda itu menerbangkan debu yang tebal, tanda betapa dahsyat serangan mereka ke arah musuh, lalu menyerbu bersama dengan kepulan debu itu ke tengah-tengah kumpulan musuh dengan gagah berani. Demi kuda-kuda perang yang demikian sifatnya, sungguh manusia itu enggan bersyukur dan sangat ingkar kepada nikmat tuhannya. Manusia, kecuali yang dirahmati Allah, malas bersyukur ketika mendapatkan nikmat dan tidak mau memenuhi kewajiban yang dibebankan kepadanya"
  }
]