[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu mereka menerbangkan debu saat penyerangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Lalu ia menerbangkan debu-debu karena (begitu kencang) larinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. فَأَثَرْنَ بِهِۦ نَقْعًا (maka ia menerbangkan debu) Makna (النقع) yakni debu yang dihempaskan kuda ke wajah musuh saat peperangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Kuda-kuda itu menghambur-hamburkan debu ke wajah musuh di tengah-tengah larinya. Mereka berada di tengah-tengah musuh atau di waktu pagi di tengah-tengah musuh."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sehingga menerbangkan} menghamburkan di tempat musuhnya {debu} debu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-5. “Maka ia menerbangkan” dengan lari dan serbuannya, “debu” , yakni tanah. “Dan menyerbu,” dengan menungganginya , “ke tengah-tengah kumpulan musuh,” dengan penunggangnya: kuda-kuda lari menyerbu musuh yang mereka serbu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَأَثَرْنَ بِهِ } Kuda-kuda itu dengan perlawanannya mengeluarkan { نَقْعًا } debu yang disebabkan oleh hantaman kakinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَأَثَرْنَ بِهِ \" maka kuda-kuda itu menerbangkan,\" Maknanya: Menerbangkan (debu) karena menghadapi musuh dan serangan tersebut. نَقْعًا Maknanya adalah debu yang berterbangan karena kencangnya lari (kuda-kuda itu). Sungguh apabila kuda berlari dan larinya itu kencang di atas tanah, maka akan menerbangkan debu karena hentakan dan larinya. (1) Dikeluarkan Bukhari (2850) dan Muslim (1873) dari hadits Urwah Bin Al-Ja'd radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 4: Allah menjelaskan dari sifat kuda ini dimana ia keras kepada musuh, sampai-sampai menerbangkan debu-debu yang berhamburan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 4",
    "description": "1-6. Demi kuda perang yang berlari kencang dan bernafas terengah-engah ke arah musuh dengan penuh keberanian dan semangat guna membawa tuannya berperang di jalan Allah. Dan demi kuda yang memercikkan bunga api karena hentakan kuku kakinya beradu dengan batu batu. Hal ini menunjukkan keberaniannya menghadapi rintangan sebesar apa pun. Dan demi kuda yang menyerang dengan tiba-tiba pada waktu pagi hal ini menunjukkan kesiagaannya untuk berjihad tanpa mengenal waktu, sehingga dengan serangan kuda-kuda itu menerbangkan debu yang tebal, tanda betapa dahsyat serangan mereka ke arah musuh, lalu menyerbu bersama dengan kepulan debu itu ke tengah-tengah kumpulan musuh dengan gagah berani. Demi kuda-kuda perang yang demikian sifatnya, sungguh manusia itu enggan bersyukur dan sangat ingkar kepada nikmat tuhannya. Manusia, kecuali yang dirahmati Allah, malas bersyukur ketika mendapatkan nikmat dan tidak mau memenuhi kewajiban yang dibebankan kepadanya"
  }
]