[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu mereka membawa pengendaranya ketengah tengah musuh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan ia menyerbu ke tengah-tengah musuh bersama penunggangnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَوَسَطْنَ بِهِۦ جَمْعًا (dan menyerbu ke tengah-tengah kumpulan musuh) Yakni berlari ke tengah-tengah musuh setelah musuh-musuh itu dikalahkan. Semua kuda berkumpul di tempat itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Kuda-kuda itu menghambur-hamburkan debu ke wajah musuh di tengah-tengah larinya. Mereka berada di tengah-tengah musuh atau di waktu pagi di tengah-tengah musuh."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{lalu menyerbu ke tengah-tengah kumpulan musuh} lalu dengan menungganginya menyerbu kumpulan musuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-5. “Maka ia menerbangkan” dengan lari dan serbuannya, “debu” , yakni tanah. “Dan menyerbu,” dengan menungganginya , “ke tengah-tengah kumpulan musuh,” dengan penunggangnya: kuda-kuda lari menyerbu musuh yang mereka serbu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَوَسَطْنَ بِهِ } Lalu kuda-kuda perang itu membawa pengendaranya { جَمْعًا } ketengah-tengah musuh, yakkni ke pertengahan pertempuran. Semua yang telah disebutkan adalah merupakan keistimewaan dari kuda-kuda perang, yang merupakan salah satu binatang pertempuran yang paling kuat, oleh karena itu Allah - عز وجل - berfirman : { وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ وَمِنْ رِبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ } ( Dan siapkanlah untuk menghadapi mereka kekuatan apa saja yang kamu sanggupi dan dari kuda-kuda yang ditambat untuk berperang (yang dengan persiapan itu) kamu menggentarkan musuh Allah dan musuhmu ) [ Al-Anfal : 60 ] . Pada ayat-ayat yang telah disebutkan adalah sumpah-sumpah Allah dengan menyebut kuda beserta sifat-sifatnya, hal itu menandakan bahwa pada hewan yang satu ini memiliki keistimewaan tersendiri dan dari umat manusia mengambil pelajaran yang penting. Dan dari kuda pula manusia mendapat kenikmatan yang begitu besar, Rasulullah ﷺ bersabda : (( \" الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْمَغْنَمُ \" )) “Kebaikan terikat pada ubun-ubun kuda hingga hari kiamat, yaitu : adanya pahala (kelak di akhirat) dan ghaniimah (harta rampasan perang)” [Diriwayatkan oleh Al-Bukhaariy no. 2850 & 2852 & 3119 & 3643, Muslim no. 1873, At-Tirmidziy no. 1694, dan yang lainnya]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَوَسَطْنَ بِهِ \" dan menyerbu ke tengah-tengah kumpulan musuh,\" Menembus ke tengah-tengan dengan percikkan debu-debu itu جَمْعًا maknanya: Perkumpulan musuh-musuh. Artinya: kuda-kuda itu tidak memiliki target dan tidak akan berhenti pada suatu target melainkan menerjang ke tengah-tengah musuh. Dan target ini adalah di antara manfaat-manfaat kuda tempur, padahal semua kuda itu bagus, sebagaiman Nabi shallallaahu 'alaihi wa sallam bersabda: اَلْخَيْلُ مَعْقُوْدٌ فِي نَواَصِيْهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ \"Kuda-kuda yang terikat pada ubun-ubunnya kebaikan sampai hari kiamat\"(1) (1) Dikeluarkan Bukhari (2850) dan Muslim (1873) dari hadits Urwah Bin Al-Ja'd radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 5: Allah menjelaskan dari sifat kuda ini yang (pemberani), berkumpul di tengah-tengah musuh di jantung peperangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 5",
    "description": "1-6. Demi kuda perang yang berlari kencang dan bernafas terengah-engah ke arah musuh dengan penuh keberanian dan semangat guna membawa tuannya berperang di jalan Allah. Dan demi kuda yang memercikkan bunga api karena hentakan kuku kakinya beradu dengan batu batu. Hal ini menunjukkan keberaniannya menghadapi rintangan sebesar apa pun. Dan demi kuda yang menyerang dengan tiba-tiba pada waktu pagi hal ini menunjukkan kesiagaannya untuk berjihad tanpa mengenal waktu, sehingga dengan serangan kuda-kuda itu menerbangkan debu yang tebal, tanda betapa dahsyat serangan mereka ke arah musuh, lalu menyerbu bersama dengan kepulan debu itu ke tengah-tengah kumpulan musuh dengan gagah berani. Demi kuda-kuda perang yang demikian sifatnya, sungguh manusia itu enggan bersyukur dan sangat ingkar kepada nikmat tuhannya. Manusia, kecuali yang dirahmati Allah, malas bersyukur ketika mendapatkan nikmat dan tidak mau memenuhi kewajiban yang dibebankan kepadanya"
  }
]