[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Sesungguhnya manusia sangat ingkar terhadap nikmat-nikmat tuhannya, Dan dia mengakui dirinya memang pengingkar. Dan sesungguhnya manusia sangat mencintai harta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya manusia itu sangat ingkar untuk melakukan kebaikan yang diharapkan Rabbnya darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-8. Allah bersumpah dengan hal-hal itu, bahwa manusia sungguh sangat ingkar terhadap nikmat-nikmat Tuhannya yang tidak terhitung, dan dia mengakui keingkaran itu pada hari perhitungan, serta dia sangat mencintai dan tamak terhadap harta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِنَّ الْإِنسٰنَ لِرَبِّهِۦ لَكَنُودٌ (sesungguhnya manusia itu sangat ingkar, tidak berterima kasih kepada Tuhannya) Makna (الكنود) yakni sangat mengingkari kenikmatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dari ayat ini dapat diambil pelajaran bagi seseorang yang merasa belum mendapatkan loyalitas dari orang lain, maka jika seandainya diri manusia yang tidak berterimakasih bahkan ingkar kepada tuhannya, dan Dialah yang selama ini memberikan kepadanya kelapangan harta dan berbagai kenikmatan lainnya, maka bagaimana tidak ia merasakan ketidak nyamanan dalam menjalani kehidupanya bersama orang-orang disekitanya sedangkan ia masih saja berpegang teguh diatas pengingkarannya ?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya manusia sungguh kufur dan tidak berterima kasih atas nikmat Allah yang diberikan kepadanya. Maksudnya yaitu sebaiknya manusia yang membicarakan kenikmatan itu (sebagai wujud syukur)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya manusia itu terhadap Tuhannya sangat ingkar} sangat ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Dan yang disumpahkan adalah firman Allah “Sesungguhnya manusia itu sangat ingkar, tidak berterima kasih kepada Rabbnya,” yakni amat mencegah kebaikan yang wajib ditunaikan untuk Allah atasnya. Tabiat dan fitrah manusia tidak merelakan dirinya menunaikan kewajiban-kewajibannya secara sempurna dan penuh. Bahkan tabiat manusia adalah pemalas dan mencegah kewajiban-kewajiban harta dan badan yang harus ditunaikan, kecuali orang yang diberi petunjuk oleh Allah dan keluar dari sifat tersebut menuju sifat rela dengan menunaikan kewajiban-kewajiban."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّ الْإِنْسَانَ } Sesungguhnya manusia, yakni orang kafir { لِرَبِّهِ لَكَنُودٌ } telah ingkar terhadap nikmat tuhannya, mendustakan segala hak-hak tuhannya yang telah diperintahkan kepadanya, menolak untuk berbuat baik, menolak untuk bersyukur atas kenikmatan yang telah dikaruniakan kepadanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah Ta'ala bersumpah dengan kuda-kuda perang yang berlari kencang yang sampai kepada target tujuannya, yaitu menyerang mush, dan menerjang ke tengah-tengah musuh tanpa rasa takut, lelah dan bosan. Sedangkan yang disumpah adalah manusia, Allah berfirman: إِنَّ الْإِنْسَانَ لِرَبِّهِ لَكَنُودٌ \" sesungguhnya manusia itu sangat ingkar tidak berterima kasih kepada Tuhannya,\" Yang dimaksud manusia di sini adalah jenis manusia, jika ia tidak diberikan petunjuk maka ia لَكَنُودٌ maknanya: Mengingkari nikmat dari Allah 'Azza Wa Jalla, sebagaimana Allah Tabaraka wa Ta'ala berfirman: وَحَمَلَهَا الْإِنْسَانُ إِنَّهُ كَانَ ظَلُومًا جَهُولًا \" dan dipikullah amanat itu oleh manusia. Sesungguhnya manusia itu amat lalim dan amat bodoh, \" dikatakan; Bahwa maksud manusia di sini adalah yang kafir. Dengan demikian maka maksudnya adalah lafaz umum namun bertujuan khusus (menggunakan kata manusia yang umum mencakup semua manusia tetapi maksudnya adalah orang tertentu yaitu yang kafir). Dan yang lebih jelas bahwa maksudnya di sini adalah umum (tidak dibatasi) dan bahwa jenis manusia (apa pun) kalau bukan karena petunjuk dari Allah maka dia akan mengkufuri nikmat Tuhanya 'Azza Wa Jalla. Allah 'Azza Wa Jalla memberinya rejeki, tapi dengan rejeki itu ia bertambah congkak dan lari (mengingkari nikmat Allah). Sungguh sebagian manusia ada yang melampaui batas jika dia melihat dirinya merasa tidak butuh kepada Allah, betapa banyak kekayaan yang merusak anak-anak Adam. Ia kufur terhadap nikmat Allah 'Azza Wa Jalla, ia mengingkari nikmat Allah, ia tidak mensyukurinya dan tidak menggunakannya dalam ketaatan kepada Allah, karena ia sangat kufur kepada nikmat dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 6: 6-8. Kemudian datang jawaban bagi sumpah (pada ayat-ayat sebelumnya) yang dikabarkan bahwa manusia itu sangat ingkar dan kufur atas nikmat Allah, ia menyembunyikan nikmat dan hanya menampakkan kesedihan. Dan manusia pada dasarnya mengakui (akan nikmat Allah) dengan pengingkaran dan menampakkan kekurangan. Terkadang ia menghabiskan hartanya karena sebab syahwat dan foya-foya, dan bukannya diberikan kepada si faqir (hartanya). Inilah manusia yang begitu cintanya dengan harta dan sangat bersemangat dalam mengumpulkannya, ia tidak peduli darimana ia mengumpulkan hartanya, dari yang halal atau haram, inilah kondisi umumnya, tidak termasuk mereka yang dipilih oleh Allah seperti para Nabi, Syuhada, dan orang-orang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Inilah isi sumpahnya, yaitu bahwa manusia benar-benar berat melakukan kebaikan yang menjadi kewajibannya kepada Tuhannya. Tabi’atnya berat memenuhi hak-hak secara sempurna yang menjadi kewajibannya, bahkan malas dan enggan mengeluarkan kewajibannya baik yang terkait dengan harta maupun perbuatan, kecuali orang yang Allah berikan hidayah, sehingga ia keluar dari sifat itu kepada sifat senang memenuhi hak-hak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 6",
    "description": "1-6. Demi kuda perang yang berlari kencang dan bernafas terengah-engah ke arah musuh dengan penuh keberanian dan semangat guna membawa tuannya berperang di jalan Allah. Dan demi kuda yang memercikkan bunga api karena hentakan kuku kakinya beradu dengan batu batu. Hal ini menunjukkan keberaniannya menghadapi rintangan sebesar apa pun. Dan demi kuda yang menyerang dengan tiba-tiba pada waktu pagi hal ini menunjukkan kesiagaannya untuk berjihad tanpa mengenal waktu, sehingga dengan serangan kuda-kuda itu menerbangkan debu yang tebal, tanda betapa dahsyat serangan mereka ke arah musuh, lalu menyerbu bersama dengan kepulan debu itu ke tengah-tengah kumpulan musuh dengan gagah berani. Demi kuda-kuda perang yang demikian sifatnya, sungguh manusia itu enggan bersyukur dan sangat ingkar kepada nikmat tuhannya. Manusia, kecuali yang dirahmati Allah, malas bersyukur ketika mendapatkan nikmat dan tidak mau memenuhi kewajiban yang dibebankan kepadanya. 7. Dan sesungguhnya dia mengakui dan menyaksikan keingkarannya itu. Hal itu bisa dilihat dari mudahnya manusia bermaksiat kepada Allah."
  }
]