[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Sesungguhnya manusia sangat ingkar terhadap nikmat-nikmat tuhannya, Dan dia mengakui dirinya memang pengingkar. Dan sesungguhnya manusia sangat mencintai harta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan sesungguhnya ia menjadi saksi atas keingkarannya terhadap kebaikan, ia tidak bisa mengingkari kenyataan ini karena sudah sangat jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَإِنَّهُۥ عَلَىٰ ذٰلِكَ لَشَهِيدٌ (dan sesungguhnya manusia itu menyaksikan (sendiri) keingkarannya) Yakni mengakui sendiri bahwa dirinya sangat ingkar, karena terlihat dari dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Dan sesungguhnya dia mengakui rasa tidak terima kasihnya itu. Dia menganggap bahwa nikmat itu dia ciptakan sendiri, karena yang tampak hanyalah jerih payahnya atas hal itu. Sesungguhnya perbuatannya itu diakui olehnya dengan tidak berterima kasih (kepada Allah) dan hal itu adalah pengakuan melalui perilaku. Sesunggunhnya dia sangat menyukai harta yang banyak sehingga dia kikir atau dia merasa mampu dan pandai untuk mencari dan mendapatkannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya dia atas hal itu benar-benar menjadi saksi} menjadi saksi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Dan sesungguhnya manusia itu menyaksikan (sendiri) keingkarannya,” yakni sesungguhnya manusia menyaksikan keengganannya menunaikan kewajiban dan keingkaran yang ia ketahui pada dirinya, ia tidak membantah dan tidak mengingkarinya: karena itu adalah sesuatu yang jelas. Kemungkinan kata ganti dalam ayat ini merujuk pada Allah, artinya sesungguhnya manusia benar-benar ingkar terhadap Rabbnya dan Allah menyaksikan hal itu. Dalam ayat ini terdapat ancaman dan peringatan keras bagi orang yang ingkar terhadap Rabbnya, karena Allah Maha Menyaksikannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِنَّهُ } Dan sesungguhnya manusia yang kafir itu { عَلَىٰ ذَٰلِكَ لَشَهِيدٌ } telah bersaksi dan mengakui keingakarannya terhadap nikmat Allah - عز وجل - . Dalam riwayat lain dikatakan : bahwa yang dimaksud dari kata \" وَإِنَّهُ \" adalah kembali kepada Allah , yakni : Allah ﷻ menjadi saksi atas perbuatan manusia ini, akan tetapi penafsiran yang paling kuat dari penafsiran \" وَإِنَّهُ \" adalah bahwasanya manusia yang kafir itu bersaksi atas pengingkaran dirinya terhadap nikmat Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِنَّهُ عَلَى ذَلِكَ لَشَهِيدٌ \" dan sesungguhnya dia menyaksikan keingkarannya,\" وَإِنَّهُ kata ganti (dhamir) di sini dikatakan: kembali kepada Allah, sehingga maknanya: Allah Ta'ala yang menyaksikan atas hamba bahwa hamba t berbuat kufur kepada nikmat dari Allah. Dikatakan juga bahwa dhamir tersebut kembali kepada manusia itu sendiri. Sehingga maknyanya: Manusia menyaksikan atas dirinya mengingkari nikmat Allah 'Azza Wa Jalla. Yang tepat adalah bahwa ayat ini mencakup kedua makna tersebut, Allah menyaksikan apa yang ada di hati anak Adam, dan menyaksikan perbuatannya. Manusia pun menyaksikan atas dirinya, akan tetapi terkadang manusia mengakui persaksian ini di dunia dan terkadang ia tidak mengakuinya, namun pada hari kiamat kelak ia akan mengakui persaksian atas dirinya itu, sebagaimana Allah Ta'ala berfirman: يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ \" pada hari (ketika), lidah, tangan dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan. \"(QS. An-Nur: 24)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 7: 6-8. Kemudian datang jawaban bagi sumpah (pada ayat-ayat sebelumnya) yang dikabarkan bahwa manusia itu sangat ingkar dan kufur atas nikmat Allah, ia menyembunyikan nikmat dan hanya menampakkan kesedihan. Dan manusia pada dasarnya mengakui (akan nikmat Allah) dengan pengingkaran dan menampakkan kekurangan. Terkadang ia menghabiskan hartanya karena sebab syahwat dan foya-foya, dan bukannya diberikan kepada si faqir (hartanya). Inilah manusia yang begitu cintanya dengan harta dan sangat bersemangat dalam mengumpulkannya, ia tidak peduli darimana ia mengumpulkan hartanya, dari yang halal atau haram, inilah kondisi umumnya, tidak termasuk mereka yang dipilih oleh Allah seperti para Nabi, Syuhada, dan orang-orang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni manusia mengakui sikapnya itu. Bisa juga kata “hu” di ayat tesebut kembalinya kepada Allah Subhaanahu wa Ta'aala, sehingga artinya, “Sungguh, manusia itu sangat ingkar, (tidak berterima kasih) kepada Tuhannya, padahal Allah Subhaanahu wa Ta'aala menyaksikannya.” Sehingga di dalamnya terdapat ancaman bagi orang yang ingkar kepada nikmat Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 7",
    "description": "Dan sesungguhnya dia mengakui dan menyaksikan keingkarannya itu. Hal itu bisa dilihat dari mudahnya manusia bermaksiat kepada Allah. 8. Dan sesungguhnya cintanya kepada harta benar-benar berlebihan. Kecintaan berlebihnya pada harta membuatnya materialistis, mengumpulkan harta dengan jalan apa pun, tidak peduli halan atau haram. Cintanya itu juga membuatnya bakhil dan cenderung menggunakannya untuk sesuatu yang tidak benar."
  }
]