[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Sesungguhnya manusia sangat ingkar terhadap nikmat-nikmat tuhannya, Dan dia mengakui dirinya memang pengingkar. Dan sesungguhnya manusia sangat mencintai harta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan sesungguhnya ia sangat berlebihan dalam mencintai hartanya hingga kikir dengannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَإِنَّهُۥ لِحُبِّ الْخَيْرِ لَشَدِيدٌ (dan sesungguhnya dia sangat bakhil karena cintanya kepada harta) Yakni kecintaannya kepada harta sangat besar, dan sangat tamak dalam mengumpulkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Dan sesungguhnya dia mengakui rasa tidak terima kasihnya itu. Dia menganggap bahwa nikmat itu dia ciptakan sendiri, karena yang tampak hanyalah jerih payahnya atas hal itu. Sesungguhnya perbuatannya itu diakui olehnya dengan tidak berterima kasih (kepada Allah) dan hal itu adalah pengakuan melalui perilaku. Sesunggunhnya dia sangat menyukai harta yang banyak sehingga dia kikir atau dia merasa mampu dan pandai untuk mencari dan mendapatkannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya cintanya pada harta} harta benar-benar berlebihan} sangat bakhil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Dan sesungguhnya dia,” yaitu manusia, “sangat bakhil karena cintanya kepada harta,” yakni amat mencintai harta, dan kecintaannya itulah yang menyebabkannya tidak menunaikan kewajiban-kewajiban. Ia lebih mengedepankan hawa nafsu daripada keridhaan Rabbnya. Semua itu karena ia membatasi pandangannya pada dunia sementara akhirat ia lalaikan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ } Dan sesungguhnya manusia benar-benar mencintai harta, kata \" الْخَيْرِ \" dalam ayat ini maksudnya adalah harta atau kekayaan, harta disebut juga dengan : الْخَيْرِ ( kebaikan ) , sebagaimana dalam firman Allah menyebutkan : { كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ إِنْ تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالْأَقْرَبِينَ بِالْمَعْرُوفِ } ( Diwajibkan atas kamu, apabila seorang di antara kamu kedatangan (tanda-tanda) maut, jika ia meninggalkan harta yang banyak, berwasiat untuk ibu-bapak dan karib kerabatnya secara ma’ruf, ) [ Al-Baqarah : 180 ] dalam ayat ini juga kata \" خَيْراً \" dimaksudkan dengan harta yang banyak. Orang-orang kafir benar-benar mencintai harta yang banyak sehingga dengan kecintaannya itu terbawa kepada sifat kikir yang sangat dalam, dan mengingkari apa-apa yang telah diwajibkan atas mereka, sedangkan mukmin senantiasa membimbing dirinya untuk terus bersedekah, dan menunaikan zakat, dan segala kebaikan, maka hart yang ia miliki menjadi kebaikan bagi dirinya dan bagi agamanya, sedangkan orang kafir hartanya akan menjadi azab bagi dirinya, keletihan dan kerja keras yang ia persembahkan didunia akan menjadi azab dan siksa di akhirat, Allah - عز وجل - berfirman : { وَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ أَنْ يُعَذِّبَهُمْ بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنْفُسُهُمْ وَهُمْ كَافِرُونَ } ( Dan janganlah harta benda dan anak-anak mereka menarik hatimu. Sesungguhnya Allah menghendaki akan mengazab mereka di dunia dengan harta dan anak-anak itu dan agar melayang nyawa mereka, dalam keadaan kafir. ) [ At Taubah : 85 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ \" dan sesungguhnya dia( manusia) sangat bakhil karena cintanya kepada harta.\" Al-Khair (kebaikan) di sini bermakna harta, sebagaimana Allah Ta'ala berfirman: كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ إِنْ تَرَكَ خَيْرًا الْوَصِيَّةُ \" Diwajibkan atas kamu, apabila seorang di antara kamu kedatangan (tanda-tanda) maut, jika ia meninggalkan harta yang banyak, berwasiat \"(QS. Al-Baqarah: 180) Maknanya: Jika meninggalkan harta yang banyak. Maka maksud kebaikan di sini adalah harta, kecintaan manusia terhadap harta adalah sesuatu yang jelas. Allah Ta'ala berfirman: وَتُحِبُّونَ الْمَالَ حُبًّا جَمًّا \" dan kamu mencintai harta benda dengan kecintaan yang berlebihan.\"(QS. Al-Fajr: 20) hampir-hampir tidak ada yang terselamatkan dari kecintaan yang sangat kepada harta. Sedangkan kecintaan di sini adalah mutlak kecintaan, kecintaan ini menetap pada setiap orang, tidak ada seorang manusia pun kecuali ia mencintai harta. Tetapi kecintaan yang berlebih tidak ada pada setiap orang. Sebagian orang menyukai harta yang mencukupinya, yang dengannya ia menjadi tidak tergantung kepada hamba-hamba Allah lainnya, sebagian orang juga mencintai harta lebih besar, dan sebagian yang lainnya lebih cinta harta yang lebih banyak, dan yang terpenting bahwa setiap insan, dia mencintai kebaikan yaitu harta, tapi tingkatan kecintaan mereka berbeda-beda, setiap orang berbeda dengan yang lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 8: 6-8. Kemudian datang jawaban bagi sumpah (pada ayat-ayat sebelumnya) yang dikabarkan bahwa manusia itu sangat ingkar dan kufur atas nikmat Allah, ia menyembunyikan nikmat dan hanya menampakkan kesedihan. Dan manusia pada dasarnya mengakui (akan nikmat Allah) dengan pengingkaran dan menampakkan kekurangan. Terkadang ia menghabiskan hartanya karena sebab syahwat dan foya-foya, dan bukannya diberikan kepada si faqir (hartanya). Inilah manusia yang begitu cintanya dengan harta dan sangat bersemangat dalam mengumpulkannya, ia tidak peduli darimana ia mengumpulkan hartanya, dari yang halal atau haram, inilah kondisi umumnya, tidak termasuk mereka yang dipilih oleh Allah seperti para Nabi, Syuhada, dan orang-orang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga ia menjadi bakhil dan membuatnya tidak memenuhi kewajibannya, mengutamakan hawa nafsunya daripada memenuhi hak Tuhannya. Ini semua tidak lain karena terbatas pandangannya hanya melihat dunia saja dan lalai terhadap akhirat. Oleh karena itulah, di ayat selanjutnya Allah Subhaanahu wa Ta'aala mendorongnya agar takut kepada hari akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 8",
    "description": "Dan sesungguhnya cintanya kepada harta benar-benar berlebihan. Kecintaan berlebihnya pada harta membuatnya materialistis, mengumpulkan harta dengan jalan apa pun, tidak peduli halan atau haram. Cintanya itu juga membuatnya bakhil dan cenderung menggunakannya untuk sesuatu yang tidak benar. 9. Maka tidakkah dia mengetahui apabila apa yang di dalam kubur dikeluarkan dan dibangkitkan pada hari kiamat untuk mempertanggung-jawabkan amalnya, ."
  }
]