[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah manusia tidak tahu apa yang menantinya manakala Allah mengeluarkan orang-orang mati dari kubur mereka untuk perhitungan amal dan pembalasan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Tidakkah orang yang tertipu dengan kehidupan duniawi ini tahu, apabila Allah telah membangkitkan mayat-mayat yang ada di alam kubur dan mengeluarkannya dari perut bumi untuk mendapatkan perhitungan dan pembalasan, bahwa urusannya tidak sebagaimana yang pernah mereka sangka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-11. Apakah dia tidak mengatahui kesudahan perkaranya, ketika seluruh mayat dikeluarkan dari kubur dan dihidupkan untuk menjalani hisab, dan diungkap semua rahasia dari dada seluruh makhluk? Apakah dia tidak mengetahui bahwa Allah Maha Mengetahui segala yang dahulu mereka perbuat dan akan membalas semua perbuatan itu dengan pasti?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِى الْقُبُورِ (Maka apakah dia tidak mengetahui apabila dibangkitkan apa yang ada di dalam kubur) Yakni ketika orang-orang mati dikeluarkan dari kubur."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "9-10 Kesesuaian antara dua ayat ini adalah bahwasanya dibangkitkannya apa yang ada didalam kubur dari jasad-jasad manusia dari perut bumi, dan ditampakkannya apa-apa yang ada didalam dada manusia, adalah keduanya bermakna menyembunyikan, dan menutupi atau menyimpan, dikeluarkannya apa yang ada didalam kubur yakni apa yang simpan oleh bumi, dan ditampakkannya apa yang ada didalam dada yakni apa yang disimpan oleh dada manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-11. Apakah dia tidak mengerti jika dihamburkan dan dikeluarkan sesuatu dari bumi yaitu jasad-jasad orang mati. Ketika mereka dibangkitkan kemudian diperlihatkan dan dikumpulkan sesuatu yang tersembunyi dibalik dadanya berupa kebaikan dan keburukan atau niat baik dan niat buruk. Sesungguhnya Tuhan mereka Maha Mengetahui tentang mereka.Tidak ada yang dapat mereka sembunyikan, dan Dia membalas semua amal perbuatan mereka pada hari itu (kiamat)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka apakah dia tidak mengetahui apabila dikeluarkan} dibangkitkan {apa yang ada di dalam kubur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. karena itu Allah berfirman memberi anjuran bagi manusia agar takut akan hari yang diancamkan tersebut, “Maka apabila dia tidak mengetahui,” yakni apakah manusia yang terpedaya itu tidak mengetahui, “apabila dibangkitkan apa yang ada di dalam kubur,” yakni Allah akan mengeluarkan manusia dari kubur untuk dikumpulkan dan dibangkitkan, “dan dilahirkan apa yang ada di dalam dada,” artinya, apa yang ada di dalam dada akan menjadi nampak nyata berupa simpanan-simpanan kebaikan dan keburukan, sehingga rahasia menjadi nampak terang dan yang batin menjadi nyata, serta nampak di hadapan para manusia sebagai akibat perbuatan-perbuatan mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah - عز وجل - menegur manusia yang kikir ini dengan adanya azab akibat perbuatannya itu : { أَفَلَا يَعْلَمُ } TIdakkah manusia ini mengetahui { إِذَا بُعْثِرَ مَا فِي الْقُبُورِ } jika isi kuburan itu dikeluarkan, yakni mayat manusia, mayat-mayat yang sebelumnya diam tidak berucap kata apapun, kemudian pada hari kiamat dikeluarkan, ummat manusia dari zaman pertama kehidupan sampai akhir kehidupan dunia ini. { أَفَلَا يَعْلَمُ } Manusia lupa, dan tidak mengingat, dan dia bahkan tidak berusaha untuk mengingat, bahwa pada hari kiamat semua yang ada didalam kubur akan dibangkitkan, dan dia termasuk didalamnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta'ala memberikan peringatan kepada suatu kondisi yang pasti terjadi pada dirinya, Allah berfirman: أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُورِ \" Maka apakah dia tidak mengetahui apabila dibangkitkan apa yang ada di dalam kubur,\" Sehingga ia beramal untuk menghadapinya, dan hasratnya tidak hanya kepada harta saja. أَفَلَا يَعْلَمُ \" Maka apakah dia tidak mengetahui \" Maknanya: (tidakkah ia) meyakini إِذَا بُعْثِرَ مَا فِي الْقُبُورِ \" apabila dibangkitkan apa yang ada di dalam kubur,\"Maknanya: Ditebarkan dan dikeluarkan. Manusia akan keluar dari kubur-kubur mereka untuk Tuhan alam semesta, sseakan-akan akan mereka seperti belalang yang berhamburan, mereka semua keluar dengan sekali teriakan: إِنْ كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَدَيْنَا مُحْضَرُونَ \" Tidak adalah teriakan itu selain sekali teriakan saja, maka tiba-tiba mereka semua dikumpulkan kepada Kami.\"(QS. Yasin: 53)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Adiyat ayat 9: 9-10. Allah menegur mereka manusia yang tidak berterima kasih (kepada Allah) dengan berkata : Tidakkah orang bodoh lagi keras kepala dan ingkar akan nikmat Allah ini mengetahui, bahwa akibat dan adzabnya menunggunya di hari kiamat; Dimana kubur terombang-ambing dan tercerai berai apa yang ada di dalamnya yaitu mayit ? Dan Allah menampakkan apa yang ada dalam dada-dada mereka dan tersingkap apa yang dari kebaikan dan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang yang tertipu ini. Yaitu orang-orang yang telah mati untuk dibangkitkan dan dikumpulkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Adiyat Ayat 9",
    "description": "Maka tidakkah dia mengetahui apabila apa yang di dalam kubur dikeluarkan dan dibangkitkan pada hari kiamat untuk mempertanggung-jawabkan amalnya, 10. Dan tidakkah mereka mengetahui nasibnya bila apa yang tersimpan di dalam dada dilahirkan, baik itu keimanan maupun kekafiran' kelakuan seseorang adalah cerminan isi hatinya. Buruknya perilaku seseorang merupakan pertanda buruknya hati orang tersebut, demikian sebaliknya."
  }
]