[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan malam manakala kegelapannya menutup bumi dan apa yang ada di atasnya, Allah bersumpah Juga dengan siang yang mengikis gelapnya malam dengan cahayanya, Allah bersumpah Juga dengan penciptaan pasangan laki laki dan perempuan, Sesungguhnya amal kalian berbeda-beda, ada yang beramal untuk dunia dan ada yang beramal untuk akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan malam apabila menutupi segala yang ada di antara langit dan bumi dengan kegelapannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Sungguh, demi malam bila kegelapannya telah menyeluruh sehingga menyembunyikan apa yang tampak, dan demi siang bila cahayanya telah menguning. Dua makhluk ini merupakan bagian dari tanda-tanda kekuasaan Allah yang ada di alam semesta, keduanya menunjukkan adanya Sang Maha Pencipta dan Pengatur. Kemudian Allah bersumpuah dengan salah satu bentuk kekuasaan-Nya, yaitu menciptakan segala makhluk hidup yang ada di bumi berpasang-pasangan dan dengan perkembangbiakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Aku bersumpah demi malam ketika menutupi segala sesuatu dengan kegelapannya, dan demi siang ketika menampakkan dan menyingkap kegelapan malam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi malam apabila menutupi} Aku bersumpah demi malam yang menutupi apa yang ada di antara langit dan bumi dengan kegelapannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Ini adalah sumpah Allah dengan waktu yang di dalamnya perbuatan-perbuatan manusia berlangsung meski dengan kondisi-kondisi yang berbeda. “Demi malam apabila menutupi (cahaya siang),” yakni, menutupi semua makhluk dengan kegelapannya sehingga masing-masing merasa tenang di tempat berteduhnya atau tempat tinggalnya, dan manusia pun merasa nyaman dari keletihan dan kelelahan. “Dan demi siang apabila terang benderang” untuk para makhluk. Mereka memanfaatkan terangnya siang dan bertebaran untuk kepentingan-kepentingan mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Surah ini termasuk surah yang Allah ﷻ mengawalinya dengan sumpah, yang penyebutannya diulang beberapa kali sebagai penekanan bahwa apa yang dijelaskan tentang sesuatu yang Allah ﷻ bersumpah dengannya adalah benar, Allah ﷻ berfirman : { وَاللَّيْلِ إِذَا يَغْشَىٰ } Lagi-lagi Allah ﷻ bersumpah dengan malam, demi malam yang menutupi cahaya siang dengan gelapnya, Allah ﷻ berfirman dalam surah lain : { وَآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُمْ مُظْلِمُونَ } ( Dan suatu tanda (kekuasaan Allah yang besar) bagi mereka adalah malam; Kami tanggalkan siang dari malam itu, maka dengan serta merta mereka berada dalam kegelapan ) [ Yaa Siin : 37 ] , inilah tanda kekuasaan Allah ﷻ , ketika Dia ﷻ menutup sebagian dari bumi dengan malam-Nya, maka akan terang di sebalah lainnya, begitulah perputaran siang dan malam sampai masa yang Allah ﷻ tetapkan akan berhenti dengan izin-Nya. Malam menutupi alam dengan kegelapannya, gunung-gunung, kebun-kebun, dan semua makhluk di muka bumi akan sirna dari penglihatan manusia ketika malam itu tiba, semua ini tanda-tanda kekuasaan Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَاللَّيْلِ إِذَا يَغْشَى \" Demi malam apabila menutupi (cahaya siang),\" Allah Subhaanahu wa Ta'ala bersumpah dengan malam apabila menutupi, yakni menutupi bumi dengan kegelapannya, karena al-Ghisya artinya al-Ghithaa (penutup)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 1: 1-4. Allah memulai dalam surat ini berkenaan dengan keimanan, dimana Allah bersumpah dengan malam jika makhluk telah bersembunyi karena gelapnya. Allah juga bersumpah dengan siang jika nampak dan tersingkap dan menerangi alam semesta. Allah bersumpah dengan diri-Nya yang menciptakan laki-laki dan perempuan. Kemudian datang jawaban atas sumpah Allah, dan Allah mengabarkan tentang amalan kalian wahai manusia yang beramal dengan macam-macam amal yang mulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah dengan waktu yang di sana terjadi perbuatan manusia dengan perbedaan keadaan mereka. Yakni menutupi makhluk dengan kegelapannya sehingga masing-masing makhluk dapat kembali ke tempatnya dan beristirahat dari kelelahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 1",
    "description": "Demi malam apabila menutupi cahaya siang. Malam yang gelap gulita dan hening menjadi waktu bagi manusia untuk beristirahat dari kepenatan kerja di siang hari. 2. Demi waktu siang apabila terang benderang oleh cahaya matahari sehingga manusia dapat beraktivitas dengan leluasa."
  }
]