[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Maka kami akan memudahkan baginya sebab-sebab kesengsaraan. Harta yang ditahannya tidak berguna baginya manakala dia masuk ke dalam api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Maka Kami mudahkan baginya untuk melakukan kejahatan serta Kami sulitkan baginya untuk berbuat baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فَسَنُيَسِّرُهُۥ لِلْعُسْرَىٰ (maka kelak Kami akan menyiapkan baginya (jalan) yang sukar) Yakni Kami akan menyiapkan baginya kesulitan sehingga ia akan kesusahan untuk melakukan kebaikan dan amal shalih, dan tidak mampu melakukannya, sehingga itu akan menjerumuskannya ke neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kami akan menuntun dan mengarahkannya menuju jalan yang sukar lagi buruk dan kami akan memudahkannya (atas hal itu) sehingga dia tidak akan berbuat apapun kecuali keburukan yang mengantarkannya menuju neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami akan memudahkannya menuju jalan kesengsaraan} Kami akan memudahkan dia berbuat keburukan dan mempersulit dia berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. “Dan adapun orang-orang yang bakhil,” dengan apa yang diperintahkan dan tidak mau mengeluarkan infak wajib dan sunnah dan tidak merelakan dirinya menunaikan kewajiban untuk Allah, “dan merasa dirinya cukup,” tidak memerlukan Allah dengan tidak menyembahNya dan tidak menganggap dirinya butuh pada Rabbnya sementara tidak ada keselamatan, keberuntungan, dan kemenangan bagi jiwa selain menjadikan Allah sebagai Dzat yang dicintai dan disembah yang dimaksudkan dan menjadi tujuan, “serta mendustakan pahala yang terbaik,” yakni mendustakan apa yang diwajibkan Allah atas para hamba untuk dipercayai berupa akidah-akidah yang baik, “maka kelak Kami akan menyiapkan baginya (jalan) yang sukar,” yakni untuk keadaan sulit dan sifat-sifat tercela dengan dijadikan sebagai orang yang mudah melakukan keburukan, di mana saja berada, ia selalu terkait dengan perbuatan-perbuatan maksiat. Kita memohon kepada Allah semoga diberi keselamatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka akan kami mudahkan baginya jalan menuju kesengsaraan dan kebinasaan, karena sesunguhnya segala sesuatu telah dimudahkan terhadap apa yang diciptakan untuknya, dan ini merupakan bagian dari keimanan kepada Qada' dan Qadar, ayat ini juga menjelaskan bahwasanya seorang hamba tidak mencukupkan dirinya tidak hanya berserah diri diatas Qada' dan Qadar, tetapi dia juga harus melakukan dan mengambil sebab-sebab yang dapat membawanya kepada hidayah Allah, maka seseorang tidak boleh mengatakan : aku ikut dengan Qada' dan Qadar saja, karena pernyataan itu adalah mazhab kelompok sesat \"Al Jabriya\" dari golongan \"Al Jahmiyah dan yang sependapat dengan mereka. Sedangkan madzhab Ahlussunah waljamaah : mereka mengimani ketetapan Qada' dan Qadar Allah, akan tetapi mereka juga menjalankan sebab-sebab yang mengantarkan kepada kebaikan yang telah ditatapkan dalam Qada' dan Qadar itu, dan tidak hanya sekedar mencukupkan dirinya dengan taqdir itu. Dalam sebuah hadits Nabi ﷺ bersabda : (( عَنْ عَلِىٍّ - رضى الله عنه - قَالَ كَانَ النَّبِىُّ - صلى الله عليه وسلم - فِى جَنَازَةٍ فَأَخَذَ شَيْئًا فَجَعَلَ يَنْكُتُ بِهِ الأَرْضَ فَقَالَ « مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ النَّارِ وَمَقْعَدُهُ مِنَ الْجَنَّةِ » . قَالُوا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ قَالَ « اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ ، أَمَّا مَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ فَيُيَسَّرُ لِعَمَلِ أَهْلِ السَّعَادَةِ ، وَأَمَّا مَنْ كَانَ مِنْ أَهْلِ الشَّقَاءِ فَيُيَسَّرُ لِعَمَلِ أَهْلِ الشَّقَاوَةِ » . ثُمَّ قَرَأَ ( فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى ) الآيَةَ . )) rtinya: “Ali radhiyallahu ‘anhu berkata: “Pernah Nabi Muhammad shallallahu ‘alaihi wasalllam pada sebuah jenazah, lalu beliau berdiam sejenak, kemudian beliau menusuk-nusuk tanah, lalu bersabda:“Tidak ada seorangpun dari kalian melainkan telah dituliskan tempatnya dari neraka dan tempatnya dari surga”. Para shahabat bertanya: “Wahai Rasulullah, kenapa kita tidak bersandar atas takdir kita dan meninggalkan amal?”, beliau menajwab: “Beramallah kalian, karena setiap sesuatu dimudahkan atas apa yang telah diciptakan untuknya, siapa yang termasuk orang yang ditakdirkan bahagia, maka akan dimudahkan untuk mengamalkan amalan penghuni surga, adapun siapa yang ditakdirkan termasuk dari dari orang yang ditkadirkan sengsara, maka ia akan dimudahkan untuk mengamalkan amalan penghuni neraka”. Kemudian beliau membaca ayat: {فَأَمَّا مَنْ أَعْطَى وَاتَّقَى (5) وَصَدَّقَ بِالْحُسْنَى (6) فَسَنُيَسِّرُهُ لِلْيُسْرَى (7)} [الليل: 5 - 7] Artinya: “Adapun orang yang memberikan (hartanya di jalan Allah) dan bertakwa”. “Dan membenarkan adanya pahala yang terbaik (surga)”. “Maka Kami kelak akan menyiapkan baginya jalan yang mudah”. QS. Al Lail: 5-7. Pada ayat diatas bantahan terhadap Al Jabriyah yang hanya bersandar kepada Qada dan Qadar, danjuga bantahan terhadap Al-Murji'ah yang meniadakan perintah amal, dan mereka mengatakan : cukuplah iman dalam hati dan tidak ada paksaan bagi siaapun untuk melakukan amal. Dan Ahlusunnah dalam hal ini mengabungkan antara iman kepada Qada' dan Qadar dengan kewajiban beramal dengan amalan yang bermanfaat, dan meningalkan segala hal yang membahayan iman dan diri hamba, dan inilah jalan yang benar."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَسَنُيَسِّرُهُ لِلْيُسْرَى \" maka kelak Kami akan menyiapkan baginya (jalan) yang sukar.\" Akan disiapkan baginya jalan yang sukar dalam segala perkara-perkaranya, tetapi terkadang setan mendatangi manusia mengatakan lita dapati orang-orang kafir dimudahkan perkara-perkaranya, maka dijawab: Ya, terkadang urusan-urusan mereka dimudahkan, tetapi hati mereka terpapar api, kesempitan dan himpitan, sebagaiman Allah Ta'ala berfirman: وَمَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقًا حَرَجًا كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ \" Dan barang siapa yang dikehendaki Allah kesesatannya, niscaya Allah menjadikan dadanya sesak lagi sempit, seolah-olah ia sedang mendaki ke langit.\" (Al-An'am: 125) Kemudian apa-apa yang mereka nikmati itu hanyalah kenikmatan jasad saja. Bukan kenikmatan jiwa, kenikmatan itu pun akan menjadi bencana bagi mereka, sebagaimana dalam firman Allah Ta'ala tentang mereka: سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ (182) وَأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ \" Kami akan menarik mereka dengan berangsur-angsur (ke arah kebinasaan), dengan cara yang tidak mereka ketahui.Dan Aku memberi tangguh kepada mereka. Sesungguhnya rencana-Ku amat teguh.\"(Al-A'raf: 182-183) Nabi shallallaahu 'alaihi wa sallam bersabda: إِنَّ اللهَ لَيُمْلِي لِلظَّالِمِ حَتَّى إِذَا أَخَذَهُ لَمْ يَفْلَتْه \"Sesungguhnya Allah benar-benar membiarkan bagi orang yang zalim (dengan kezalimannya) hingga nanti ketika dia diazab tidak akan dibiarkan\" (1) Lalu beliau membaca firman Allah Ta'ala: وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ \" Dan begitulah azab Tuhanmu, apabila Dia mengazab penduduk negeri-negeri yang berbuat zalim. Sesungguhnya azab-Nya itu adalah sangat pedih lagi keras.\"(Hud: 102) Mereka adalah orang yang disegerakan kebaikan-kebaikan di kehidupan dunianya, walau demikian dunia ini adalah surga bagi mereka jika dibandingkan dengan akhirat. Para ulama menyebutkan dari Ibnu Hajar bahwa ia menyebutkan sebuah kisah dalam fathulbarih syarah shahih bukhori, beliau adalah gurunya para hakim di mesir, bahwa suatu hari beliau berada di atas delmannya yang ditarik oleh bighal, ia dikelilingi orang orang, ia melewati seorang yahudi penjual lemak dan minyak, dan sudah dimaklumi bahwa penjual minyak bajunya kotor dan kondisinya kurang baik, yahudi ini pun memberhentikan delman tersebut lalu berkata kepada Ibnu Hajar: sesungguhnya nabi kalian mengatakan: اَلدُّنْيَا سِجْنُ الْمُؤْمِنِ وَجَنَّةُ الْكَافِرِ \"Dunia adalah penjara orang mukmin dan surge orang kafir\"(2), Bagaiamana dengan kondisi saya ini, dan anda seperti itu? Maka Ibnu Hajar menjawabnya secara spontan: Saya berada di penjara jika dibandingkan dengan kenikmatan yang Allah persiapkan bagi orang-orang yang berimana berupa ganjaran dan kenikmatan, karena dunia ini jika dibandingkan dengan akhirat tidak ada apa-apanya, sebagaimana Nabi shallallaahu 'alaihi wa sallam bersabda: لَمَوْضِعُ سَوْطٍ فِي الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا \"Sungguh tempat cemeti di surga lebih baik dari dunia dan seisinya\"(3), sedangkan anda wahai orang yahudi, anda berada di surga jika dibandingkan dengan siksa jika anda mati dalam keadaan kafir. Maka orang yahudi tersebut puas dengan penjelasan Ibnu hajar, dan dialog ini menjadikan sebab keislaman dia dan mengatakan: AKu bersaksi bahwa tiada sesembahan yang benar selain Allah dan bahwa Muhammad adalah utusan Allah. (1) Dikeluarkan Bukhari (4686) dan Muslim (2583) dari hadits Abu Musa Al-Asy'ariy radhiyallaahu 'anhu. (2) Dikeluarkan Muslim (2956) dari hadits Abu Hurairah radhiyallaahu 'anhu (3) Dikeluarkan Bukhari (6415) dari hadits Sahl Bin Sa'd radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 10: Allah menjelaskan mereka yang disifati dengan amalan yang buruk (yang telah lalu disebutkan), maka Allah akan (semakin) memudahkannya untuk terus menerus beramal buruk dan tetap berada di atasnya. Dan maksudnya adalah, Allah akan meninggalkan hamba yang seperti ini, dan apa yang ia pilih (dari amalannya) maka itu untuk dirinya sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu neraka. Menurut Syaikh As Sa’diy, maksudnya adalah keadaan yang sulit dan perkara yang tercela, yaitu mudah jatuh ke dalam keburukan dimana saja ia berada dan ditetapkan untuk melakukan berbagai kemaksiatan, nas’alulllahal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 10",
    "description": "8-10. Dan adapun orang yang kikir terhadap hartanya dengan tidak memenuhi hak Allah dalam harta itu dan merasa dirinya cukup dengan apa yang dia punya sehingga tidak lagi memerlukan pahala dari Allah tidak mau beramal untuk kehidupan akhiratnya, serta mendustakan pahala yang terbaik, yaitu surga di akhirat; atau ingkar kepada Allah, hari akhir, dan apa yang Allah janjikan kepada mereka yang beramal saleh sehingga dia senantiasa melakukan maksiat, maka akan kami mudahkan baginya jalan menuju kesukaran dan kesengsaraan. Kami tutup hatinya dari keinginan untuk berbuat kebajikan dan kami tahan langkahnya untuk taat kepada kami. 11. Dan hartanya tidak bermanfaat baginya apabila dia telah binasa dalam kemurkaan Allah. Allah tidak membutuhkan harta sebanyak apa pun. Hanya iman dan ketaatan, bukan harta, yang menyelamatkan seseorang dari azab Allah."
  }
]