[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Maka kami akan memudahkan baginya sebab-sebab kesengsaraan. Harta yang ditahannya tidak berguna baginya manakala dia masuk ke dalam api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Harta yang dia sayangi itu tidak bermanfaat sedikitpun baginya saat ia telah binasa dan masuk ke dalam Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَمَا يُغْنِى عَنْهُ مَالُهُۥٓ (Dan hartanya tidak bermanfaat baginya) Yakni harta yang ia simpan tidak dapat bermanfaat baginya. إِذَا تَرَدَّىٰٓ (apabila ia telah binasa) Yakni jika ia telah jatuh ke neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Tidak berguna harta benda dan kekayaannya ketika dia hancur dan terjerumus ke dalam neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hartanya tidak bermanfaat baginya apabila dia telah binasa} binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Dan hartanya tidak bermanfaat baginya,” yakni harta yang membuatnya melampaui batas, merasa cukup dengan harta itu dan menjadikannya bakhil, bila ia mati, karena hanya amal shalih yang akan selalu menemani seseorang. Sedangkan hartanya yang tidak ditunaikan kewajibannya akan menjadi bencana baginya, karena tidak melakukan apa pun untuk akhirat dengan harta tersebut."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ berkata kepada mereka yang dimaksud dalam dua ayat sebelumnya : { بَخِلَ وَاسْتَغْنَىٰ , وَكَذَّبَ بِالْحُسْنَىٰ } Allah berfirman : { وَمَا يُغْنِي عَنْهُ مَالُهُ إِذَا تَرَدَّىٰ } Jika ia mati, maka harta yang telah ia kumpulkan di dunia tidak lagi bermanfaat bagi kehidupannya di akhirat, sedangkan ia tidak mempersembahkan apapun untuk akhiratnya, dan tidak pula ia beriman kepada janji Allah ﷻ , sebanyak apapun simpanannya di lembaga-lembaga penyimpanan uang tanpa iman dalam dirinya harta itu tidak akan bermanfaat di akhirat kelak, dia akan dibangkitkan dari kematian tanpa membawa apa-apa, harta yang ia tingglkan dengan jumlah yang begitu banyak akan menjadi rebutan diantara sanak family yag ia tinggalkan. { وَمَا يُغْنِي عَنْهُ مَالُهُ إِذَا تَرَدَّىٰ } Jika manusia telah binasa, dan tidak menginfakkan sekecil apapun dari hartanya di jalan Allah, maka tidak ada baginya sedikitpun dari nikmat surga yang Allah persiapkan untuk hamba-Nya yang beriman, Rasulullah ﷺ bersabda : (( إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلاَّ مِنْ ثَلاَثَةٍ إِلاَّ مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ )) “Jika manusia itu mati, maka akan putus amalannya kecuali dari tiga perkara: [1] sedekah jariyah, [2] ilmu yang diambil manfaatnya, [3] anak sholih yang mendo’akan orang tuanya.” [ Hadits riwayat Muslim no : 1631 ] , rasulullah mengawali sabdanya dengan sedekah jariyah yang di keluarkan seorang hamba semasa hidupnya, maka pahala sedekah itu akan terus mengalir walaupun ia telah mati, seperti ia membangun masjid, atau bersedekah dalam bentuk wakaf, dan juga membangun sekolah, yang semua itu bermanfaat bagi orang-orang setelahnya hingga masa yang tidak ditentukan, pahala dari sedekahnya akan terus mengalir untuknya selama pemanfaatan dari sedekah itu juga berjalan. Allah ﷻ berfirman menceritakan tentang mereka yang menyombongakn diri dihadapan Allah ﷻ dengan hartanya : { وَقَالُوا نَحْنُ أَكْثَرُ أَمْوَالًا وَأَوْلَادًا وَمَا نَحْنُ بِمُعَذَّبِينَ , قُلْ إِنَّ رَبِّي يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ , وَمَا أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ بِالَّتِي تُقَرِّبُكُمْ عِنْدَنَا زُلْفَىٰ إِلَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَأُولَٰئِكَ لَهُمْ جَزَاءُ الضِّعْفِ بِمَا عَمِلُوا وَهُمْ فِي الْغُرُفَاتِ آمِنُونَ } ( Dan mereka berkata: “Kami lebih banyak mempunyai harta dan anak-anak (daripada kamu) dan kami sekali-kali tidak akan diazab , Katakanlah: “Sesungguhnya Tuhanku melapangkan rezeki bagi siapa yang dikehendaki-Nya dan menyempitkan (bagi siapa yang dikehendaki-Nya). akan tetapi kebanyakan manusia tidak mengetahui” , Dan sekali-kali bukanlah harta dan bukan (pula) anak-anak kamu yang mendekatkan kamu kepada Kami sedikitpun; tetapi orang-orang yang beriman dan mengerjakan amal-amal (saleh, mereka itulah yang memperoleh balasan yang berlipat ganda disebabkan apa yang telah mereka kerjakan; dan mereka aman sentosa di tempat-tempat yang tinggi (dalam surga) ) [ Saba : 35 - 37 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah 'Azza Wa Jalla berfirman: وَمَا يُغْنِي عَنْهُ مَالُهُ إِذَا تَرَدَّى \" Dan hartanya tidak bermanfaat baginya apabila ia telah binasa.\" Yakni: Apa gunanya hartanya jika ia kikir dengan hartanya, dan apabila ia binasa? Apa gunanya harta? Harta tidak ada gunanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 11: Allah menjelaskan bahwa orang-orang yang celaka ini jika masuk kedalam neraka jahannam dan binasa di dalamnya, maka tidak akan pernah bermanfaat harta-harta mereka yang bakhil dan tidak juga bermanfaat untuk digunakan, dan mereka tidak akan pernah selamat dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni masuk neraka, karena yang berguna hanyalah iman dan amal saleh. Adapun hartanya yang tidak dikeluarkan haknya, maka akan menjadi musibah baginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 11",
    "description": "Dan hartanya tidak bermanfaat baginya apabila dia telah binasa dalam kemurkaan Allah. Allah tidak membutuhkan harta sebanyak apa pun. Hanya iman dan ketaatan, bukan harta, yang menyelamatkan seseorang dari azab Allah. 12-13. Sesungguhnya kamilah yang memberi petunjuk kepada manusia sesuai dengan kebijaksanaan kami agar mereka berjalan pada jalan yang benar demi kebaikan mereka di dunia dan akhirat, dan sesungguhnya milik kamilah kerajaan akhirat dan dunia. Kami yang mengatur urusan keduanya, sedangkan manusia tinggal menjalankan apa yang wajib baginya dan meninggalkan apa yang dilarang darinya."
  }
]