[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-13. Sesungguhnya Kami, dengan karunia dan hikmah Kami menjelaskan jalan hidayah yang menyampaikan kepada Allah dan surge NYA, dari jalan kesesatan. Hanya milik Kami lah kehidupan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sesungguhnya menjadi kewajiban Kami untuk menjelaskan jalan kebenaran dari jalan yang sesat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah menjamin penjelasan jalan petunjuk dan segala hal yang berhubungan dengannya, dan ini merupakan bentuk karunia dan rahmat-Nya. Allah memberi manusia petunjuk kepada kebaikan sebelum Dia memberi balasan atas keburukan amal mereka, dan Allah memberi petunjuk mereka untuk dapat membedakan antara kebaikan dan keburukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِنَّ عَلَيْنَا لَلْهُدَىٰ (Sesungguhnya kewajiban Kamilah memberi petunjuk) Yakni kewajiban Kami adalah menjelaskan jalan hidayah dan jalan kesesatan. Al-Farra’ mengatakan: yakni barangsiapa yang menempuh jalan hidayah maka Allah akan memudahkannya. Barangsiapa yang menghendaki Allah maka Allah ada di jalan-Nya, dan barangsiapa yang menghendaki-Nya maka ia akan menempuh jalan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Dan tugas kami dengan keadilan dan kebijaksanaan kami, yaitu menunjukkan jalan petunjuk daripada menunjukkan jalan kesesatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kamilah yang memberi petunjuk} Menjelaskan jalan petunjuk dari jalan kesesatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “Sesungguhnya kewajiban Kamilah memberi petunjuk,” yakni jalan yang lurus yang akan mengantarkan menuju Allah dan mendekatkan pada keridhaanNya. Sedangkan kesesatan, jalannya tertutup, tidak bisa mencapai Allah dan hanya mengantarkan orang menuju siksaan yang dahsyat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian di ayat ini Allah ﷻ menjelaskan bahwasanya manusia itu sama sekali tidak dapa berbuat apa-apa dengan sendirinya, dia tidak dapat membimbing dirinya diatas kebenanaran hanya mengandalkan kemampuan dirinya, melainkan semua Allah ﷻ yang melakukannya. Allah ﷻ berfirman : { إِنَّ عَلَيْنَا لَلْهُدَىٰ } Sesungguhnya kewajiban kamilah yang memberi hidayah itu. Akan tetapi sebab datangnya hidayah itu mesti bagi setiap hamba untuk melakukannya, yaitu dengan beramal shalih, dan memperbanyak ibadah dan dzikir kepada-Nya . Hidayah taufiq adalah kewajiban Allah ﷻ yang Ia karuniakan kepada siap yang Dia kehendaki, sedangkan \"Hidayah dalalah dan Irsyad\" yaitu kewajiban untuk menyampaikan petunjuk yang Allah ﷻ telah sampaikan melalui Al-Qur'an dan Sunah Rasul-Nya adalah kewajiban setiap muslim, mereka saling mengingatkan kepada kebenaran dan melarang dari kesesatan, mereka saling mengajarkan kabaikan, walaupun terkadang kesadaran untuk menerima kebenaran itu sangat sedikit dimiliki oleh manusia, maka hal ini kembali kepada Allah ﷻ yang hanya kepada-Nya hidayah taufiq itu diserahkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ عَلَيْنَا لَلْهُدَى \" Sesungguhnya keharusan Kami-lah memberi petunjuk,\" Di dalamnya terdapat komitmen dari Allah 'Azza Wa Jalla untuk menjelaskan kepada makhluk-Nya yang menjadi petunjuk bagi mereka. Petunjuk di sini adalah petunjuk berupa penjelasan dan arahan (al-Bayan dan al-Irsyad) Allah mengharuskan diri-Nya menjelaskan petunjuk tersebut hingga manusia tidak memiliki hujjah untuk menuntut Allah, ini selaras dengan yang ada pada firman Allah Ta'ala: إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَى نُوحٍ وَالنَّبِيِّينَ مِنْ بَعْدِهِ \" Sesungguhnya Kami telah memberikan wahyu kepadamu sebagaimana Kami telah memberikan wahyu kepada Nuh dan nabi-nabi yang kemudiannya,\" hingga firman-Nya رُسُلًا مُبَشِّرِينَ وَمُنْذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللَّهِ حُجَّةٌ بَعْدَ الرُّسُلِ \" (Mereka kami utus) selaku rasul-rasul pembawa berita gembira dan pemberi peringatan agar supaya tidak ada alasan bagi manusia membantah Allah sesudah diutusnya rasul-rasul itu.\"(An-Nisa: 163-165). Sekedar otak manusia saja tidak mampu menjangkau untuk mengetahui petunjuk, oleh karenanya Allah berkomitmen menjelaskan petunjuk kepada manusia : إِنَّ عَلَيْنَا لَلْهُدَى Perlu diketahui bahwa petunjuk ada dua macam: 1. Petunjuk (hidayah) taufiq. Petunjuk ini tidak ada yang mempu memberikannya kecuali Allah. 2. Hidayah memberi petunjuk dan arahan, ini bisa dari Allah dan bisa juga dari manusia, dari para rasul 'alaihimussholaatu wassalaam, dan dari para Ulama, sebagaimana Allah berfirman kepada Nabi-Nya shallallaahu 'alaihi wa sallam: وَإِنَّكَ لَتَهْدِي إِلَى صِرَاطٍ مُسْتَقِيمٍ \" Dan sesungguhnya kamu benar-benar memberi petunjuk kepada jalan yang lurus. \"(Asy-Syura: 52) Sedangkan hidayag taufik maka ini kembali kepada Allah, tidak ada seorang pun yang bisa memberikan taufik kepada siapa pun untuk melakukan kebaikan, sebagaimana Allah Ta'ala berfirman: إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ \" Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya, \"(Al-Qashash: 56) Dan apabila kita memperhatikan ayat yang mulia ini إِنَّ عَلَيْنَا لَلْهُدَى \"\" Kita akan mendapati bahwa Allah 'Azza Wa Jalla telah menjelaskan segala sesuatu, telah menjelaskan keharusan mereka dalam perkara aqidah, ibadah, akhlaq, mu'amalah dan telah menjelaskan apa apa yang wajib mereka jauhi di setiap perkara ini, sehingga Abu Azarr radhiyallaahu 'anhu mengatakan: لَقَدْ تُوُفِّيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا طَائِرٌ يُقَلِّبُ جَنَاحَيْهِ فِي السَّماَءِ إِلّا ذَكَرَ لَنَا مِنْهُ عِلْمًا \"Rasulullah shallallaahu 'alaihi wa sallam telah wafat, tidak ada burung yang mengepakkan kedua sayapnya melainkan beliau telah menyebutkan kepada kami ilmu (pelajaran) dari hal tersebut \" (1) Seseorang dari kalangan musyrikin berkata kepada Salman Al-Farisiu: \"Nabi kalian telah mengajarkan hingga tentang bagaimana cebok?!\" Salman menjawab: Benar, beliau mengajari kami hingga buang hajat (2), yaitu etika ketika buang hajat, beliau menjaleskannya kepada umat, dan mengatkan hal ini adalah firman Allah Ta'ala: الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا \" Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridai Islam itu jadi agama bagimu. \"(Al-Maidah: 3) (1) dikeluarkan oleh imam Ahmad (20854) lihat juga Ash-Shahihah (1803) (2) Dikeluarkan oleh Muslim (262) dari hadits Salman Al-Farisiy radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 12: Allah kabarkan berkenaan dengan manusia yang mengikuti petunjuk namun juga mengikuti kesesatan, dan akhir kesudahannya adalah tergantung pilihannya sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menerangkan jalan petunjuk daripada jalan kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 12",
    "description": "12-13. Sesungguhnya kamilah yang memberi petunjuk kepada manusia sesuai dengan kebijaksanaan kami agar mereka berjalan pada jalan yang benar demi kebaikan mereka di dunia dan akhirat, dan sesungguhnya milik kamilah kerajaan akhirat dan dunia. Kami yang mengatur urusan keduanya, sedangkan manusia tinggal menjalankan apa yang wajib baginya dan meninggalkan apa yang dilarang darinya"
  }
]