[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-13. Sesungguhnya Kami, dengan karunia dan hikmah Kami menjelaskan jalan hidayah yang menyampaikan kepada Allah dan surge NYA, dari jalan kesesatan. Hanya milik Kami lah kehidupan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan sesungguhnya kepunyaan Kami-lah kehidupan Akhirat dan kepunyaan Kami-lah kehidupan dunia, Kami berbuat pada keduanya sekehendak Kami, tidak ada seorang pun yang berhak atas hal itu selain Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Kehidupan akhirat yang menjadi tempat mengumpulkan para makhluk-Nya merupakan milik-Nya semata; demikian pula dengan kehidupan dunia. Oleh sebab itu Dia memiliki hak untuk mengaturnya sesuai yang Dia kehendaki, maka janganlah seseorang sekali-kali merasa memiliki hak yang harus Allah tunaikan bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَإِنَّ لَنَا لَلْءَاخِرَةَ وَالْأُولَىٰ (dan sesungguhnya kepunyaan Kamilah akhirat dan dunia) Yakni milik Kami segala yang ada di akhirat dan yang ada di dunia, Kami mengaturnya sesuai kehendak Kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dan sesungguhnya bagi kami, segala sesuatu di dunia dan akhirat. Kami atur (semua itu) sesuai kehendak kami. Barangsiapa mencari keduanya kepada selain kami maka sungguh dia telah melakukan kesalahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya milik Kamilah akhirat dan dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “Dan sesungguhnya kepunyaan Kamilah akhirat dan dunia,” yakni dari segi hak kepemilikan dan hak mengatur. Tidak ada sesuatu pun yang bersekutu dengan Allah pada keduanya. Karena itu hendaklah orang-orang gemar meminta padaNya dan memutus harapan mereka dari sesama makhluk."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dunia dan akhirat beserta isinya adalah milik Allah ﷻ , Dia ﷻ sang pencipta dan pemilik semua ciptaan secara mutlak, sebagaimana Dia ﷻ yang memiliki petunjuk itu, Dia ﷻ pemilik kehidupan dunia dan kehidupan akhirat, kekuasaan dan kerajaan hanya Dia ﷻ yang memilikinya. Adapun harta kekayaan yang dimiliki oleh manusia adalah cobaan dan ujian untuknya, Allah ﷻ menguji hamba-Nya dengan kekayaan bagaimana ia memanfaatkan kekayaan itu dengan baik tanpa adanya pelanggaran syari'at, dan harta yang dimiliki manusia hanyalah titipan dari Allah ﷻ , dan semuanya akan kembali kepada-Nya , { إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا وَإِلَيْنَا يُرْجَعُونَ } ( Sesungguhnya Kami mewarisi bumi dan semua orang-orang yang ada di atasnya, dan hanya kepada Kamilah mereka dikembalikan. ) [ Maryam : 40 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِنَّ لَنَا لَلْآخِرَةَ وَالْأُولَى \" dan sesungguhnya kepunyaan Kami-lah akhirat dan dunia.\" Yakni: Milik kami akhirat dan ulaa (dunia), Ulaa secara waktu lebih awal dari akhirat, tetapi dalam ayat ini diakhirkan karena mengandung dua faedah: Faedah pertama: Secara makna.(Tersirat) Faedah kedua: Secara lafadz. (Tersurat) Sedangkan secara makna: Karena akhirat lebih penting dari dunia, karena di akhirat akan terlihat jelas kekuasaan Allah secara sempurna, di dunia terdapat penguasa-penguasa, dan raja-araja, mereka memiliki apa-apa yang Allah berikan kepada mereka berupa kekuasaan, sedangkan di akhirat tidak ada kekuasaan bagi seorang pun: لِمَنِ الْمُلْكُ الْيَوْمَ لِلَّهِ الْوَاحِدِ الْقَهَّارِ \" Kepunyaan siapakah kerajaan pada hari ini?\" kepunyaan Allah Yang Maha Esa lagi Maha Mengalahkan. \"(Ghafir: 17) oleh karenanya kata akhirat diletakkan lebih awal dari ulaa karena danaya unsur faedah maknawiyah ini. Sedangkan faedah secara lafaz: Ialah memperhatikan penggalan-penggalan surat ini, yakni: akhir-akhir ayat- ayat surat ini kemuanya dengan alif. Jika ditanya: Sesungguhnya Allaj 'Azza Wa Jalla berfirman: إِنَّ عَلَيْنَا لَلْهُدَى (12) وَإِنَّ لَنَا لَلْآخِرَةَ وَالْأُولَى \" Sesungguhnya kewajiban Kami-lah memberi petunjuk, dan sesungguhnya kepunyaan Kami-lah akhirat dan dunia.\" Apa bedanya? Jawabannya: Perbedaannya bahwa Allah telah bekomitmen akan menjelaskan dan menerangkan petunjuk kepada makhluk, sedangkan kekuasaan maka itu semua milik Allah baik akhirat dan dunia, oleh kerenanya Allah berfirman: وَإِنَّ لَنَا لَلْآخِرَةَ وَالْأُولَى \" dan sesungguhnya kepunyaan Kami-lah akhirat dan dunia \""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 13: Allah menjelaskan bahwa Allah sajalah yang memiliki setiap dari apa yang ada di dunia dan di akhirat dan bahwasanya Allah Yang Maha Kuasa atas urusan keduanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, barang siapa yang memintanya kepada selain Kami, maka dia telah salah, dan seharusnya ia meminta kepada-Nya serta memutuskan harapan kepada makhluk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 13",
    "description": "12-13. Sesungguhnya kamilah yang memberi petunjuk kepada manusia sesuai dengan kebijaksanaan kami agar mereka berjalan pada jalan yang benar demi kebaikan mereka di dunia dan akhirat, dan sesungguhnya milik kamilah kerajaan akhirat dan dunia. Kami yang mengatur urusan keduanya, sedangkan manusia tinggal menjalankan apa yang wajib baginya dan meninggalkan apa yang dilarang darinya. 14. Maka, aku memperingatkan kamu, wahai manusia, dengan neraka yang menyala-Nyala dan panas tiada tara; itulah neraka jahanam. Demikianlah cara Allah mendidik manusia, dengan memberi sanksi kepada pelanggar dan penghargaan kepada penaat."
  }
]