[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku memperingatkan kalian (wahai manusia), dan mempertakutkan kalian dengan api neraka yang menyala-nyala,yaitu neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Maka Aku mengingatkan kalian -wahai manusia- dengan api Neraka yang menyala-nyala jika kalian bermaksiat kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-16. Allah memperingatkan hamba-hamba-Nya dari neraka Jahannam yang berkobar-kobar, tidak yang memasukinya melainkan orang yang sengsara yang dilempar ke dalamnya akibat mendustakan Rasulullah dan berpaling dari petunjuk Allah. Orang sengsara ini tidak ditetapkan baginya kebahagiaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فَأَنذَرْتُكُمْ نَارًا تَلَظَّىٰ (Maka, kami memperingatkan kamu dengan neraka yang menyala-nyala) Yakni apinya menyala-nyala dan bergejolak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Imam Malik berkata : Suatu ketika Umar bin Abdul Aziz membaca dalam shalatnya surah al-Lail, tatkala ia sampai pada ayat : { فَأَنْذَرْتُكُمْ نَارًا تَلَظَّىٰ } dia menangis sehingga tidak mampu melanjutkan ayat selanjutnya, dua atau tiga kali, sampai kemudian beliau membaca surat lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Kemudian Aku telah memperingatkan dan menakut-nakuti kalian agar tidak menyimpang dari perintahku wahai manusia dengan neraka Jahanam yang menyala-nyala. Janganlah kamu masuk ke dalamnya dan terbakar oleh apinya selama-lamanya, kecuali orang kafir seperti Abu Jahal dan Umayyah bin Khallaf. Adapun jika orang fasik memasukinya maka dia tidak (mau) melanjutkan (lagi) untuk tinggal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku memperingatkan kalian} lalu aku memperingatkan kalian {dengan neraka yang menyala-nyala} yang panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-16. “Maka Kami memperingatkan kamu dengan api yang menyala-nyala,” yakni yang berkobar. “Tidak ada yang masuk ke dalamnya kecuali orang yang paling celaka, yang mendustakan” kebaikan, “dan berpaling” dari perintah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَأَنْذَرْتُكُمْ} Maka aku menakut-nakuti kalian wahai manusia dengan peringatan { نَارًا تَلَظَّىٰ } akan neraka yang menyala-nyala, api neraka yang belum pernah dipadamkan sejak Allah ﷻ menciptakannya, Allah ﷻ berfirman : { نَارُ اللَّهِ الْمُوقَدَةُ } ( (yaitu) api (yang disediakan) Allah yang dinyalakan ) [ Al-Humazah : 6 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah 'Azza Wa Jalla berfirman: فَأَنْذَرْتُكُمْ نَارًا maksudnya: Kami akan ancam kalian dengan neraka akhirat تَلَظَّى Yang menyala-nyala, yang memiliki sifat yang banyak disebutkan di dalam al-Quran dan Hadits."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 14: Ketahuilah wahai manusia bahwa Allah telah memperingatkanmu akan neraka yang menyala-nyala dengan panas yang sangat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 14",
    "description": "Maka, aku memperingatkan kamu, wahai manusia, dengan neraka yang menyala-Nyala dan panas tiada tara; itulah neraka jahanam. Demikianlah cara Allah mendidik manusia, dengan memberi sanksi kepada pelanggar dan penghargaan kepada penaat. 15. Itulah neraka yang hanya dimasuki dan dirasakan panasnya oleh orang yang paling celaka."
  }
]