[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Tidak memasukinya kecuali orang yang benar-benar sengsara, Yang mendustakan nabi Allah, Muhammad shalallohu alaihi wasallam ,berpaling dari iman kepada Allah dan rasul NYA, serta tidak mematuhi keduanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Tidaklah merasakan pedihnya Neraka ini kecuali orang yang sengsara, yaitu orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. لَا يَصْلَىٰهَآ إِلَّا الْأَشْقَى (Tidak ada yang masuk ke dalamnya kecuali orang yang paling celaka) Yakni orang kafir akan merasakan panas neraka itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Abu Umamah berkata : \"Tidak satupun dari ummat ini melainkan Allah akan memasukkannya ke dalam surga, kecuali orang-orang yang berpaling dari perintah Allah sebagaimana onta bodoh yang melarikan diri dari tuannya, maka barangsiapa yang tidak percaya kepadaku sesungguhnya Allah berfirman ; { لَا يَصْلَاهَا إِلَّا الْأَشْقَى } yaitu orang-orang mendustakan apa yang dibawa oleh Muhammad dan mereka juga berpaling darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Kemudian Aku telah memperingatkan dan menakut-nakuti kalian agar tidak menyimpang dari perintahku wahai manusia dengan neraka Jahanam yang menyala-nyala. Janganlah kamu masuk ke dalamnya dan terbakar oleh apinya selama-lamanya, kecuali orang kafir seperti Abu Jahal dan Umayyah bin Khallaf. Adapun jika orang fasik memasukinya maka dia tidak (mau) melanjutkan (lagi) untuk tinggal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak akan memasukinya} tidak akan memasukinya dan merasakan panasnya {kecuali orang yang paling celaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-16. “Maka Kami memperingatkan kamu dengan api yang menyala-nyala,” yakni yang berkobar. “Tidak ada yang masuk ke dalamnya kecuali orang yang paling celaka, yang mendustakan” kebaikan, “dan berpaling” dari perintah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tidak ada yang masuk kedalam neraka itu kecuali orang-orang yang celaka, mereka telah mencelakakan diri mereka sendiri dengan kemaksiatan, mereka akan merasakan betapa panasnya api neraka yang telah mereka dustakan keberadaannya, api neraka itu akan membakar habis tubuh orang-orang kafir, da orang-orang musyrik, mereka akan kekal didalamnya, dan para pelaku maksiat dari orang-orang beriman akan dimasukkan kedalam neraka itu untuk dibersihkan dirinya dari dosa, kemudian akan dikeluarkan dari neraka itu setelah dosa mereka telah terhapus semua, lalu mereka akan dimasukkan kedalam surga."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لَا يَصْلَاهَا إِلَّا الْأَشْقَى \" Tidak ada yang masuk ke dalamnya kecuali orang yang paling celaka\" لَا يَصْلَاهَا Maksudnya: tidak terbakar dengannya إِلَّا الْأَشْقَى Maksudnya: orang yang ditaqdirkan sengsara, kesengsaraan adalah kebalikan kebahagiaan. Sebagaiamana dalam firman Allah Ta'ala: فَأَمَّا الَّذِينَ شَقُوا فَفِي النَّارِ \" Adapun orang-orang yang celaka, maka (tempatnya) di dalam neraka, \" (Hud: 106) dan firman-Nya وَأَمَّا الَّذِينَ سُعِدُوا فَفِي الْجَنَّةِ \" Adapun orang-orang yang berbahagia, maka tempatnya di dalam surga \"(Hud: 108) Maka yang dimaksud yang sengsara adalah yang tidak ditakdirkan kebahagiaan baginya, inilah yang akan terbakar dengan neraka yang menyala-nyala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 15: Dan api neraka ini tidak akan masuk di dalamnya kecuali bagi orang-orang yang celaka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 15",
    "description": "Itulah neraka yang hanya dimasuki dan dirasakan panasnya oleh orang yang paling celaka. 16. Mereka itulah orang yang mendustakan kebenaran yang datang dari Allah dan berpaling dari iman kepada-Nya."
  }
]