[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Tidak memasukinya kecuali orang yang benar-benar sengsara, Yang mendustakan nabi Allah, Muhammad shalallohu alaihi wasallam ,berpaling dari iman kepada Allah dan rasul NYA, serta tidak mematuhi keduanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Yang mendustakan apa yang dibawa oleh Rasul -Ṣallallāhu 'alaihi wasallam- dan berpaling dari menaati perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. الَّذِى كَذَّبَ وَتَوَلَّىٰ (yang mendustakan (kebenaran) dan berpaling (dari iman)) Yakni ia mendustakan kebenaran yang didatangkan oleh para Rasul dan enggan untuk taat dan beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. (Yaitu) pembenci yang berdusta tentang Al-Qur’an dan menjauh dari keimanan kepada Tuhannya, utusanNya dan ketaatan kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang berdusta dan berpaling} berpaling dari keimanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-16. “Maka Kami memperingatkan kamu dengan api yang menyala-nyala,” yakni yang berkobar. “Tidak ada yang masuk ke dalamnya kecuali orang yang paling celaka, yang mendustakan” kebaikan, “dan berpaling” dari perintah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ الَّذِي كَذَّبَ وَتَوَلَّىٰ } Orang yang cealak itu adalah orang-orang telah berdusta dengan hati mereka dengan penuh keyakinan, mereka mendustakan keesaan Allah ﷻ, mendustakan adanya hari kebangkitan, dan mereka pun berpaling dari beribadah kepada Allah ﷻ , mereka enggan mendidikan shalat, menolak membayar zakat, menjauhi perintah berpuasa, haji, umrah, dan sebagianya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah menjelaskannya dengan firman-Nya الَّذِي كَذَّبَ وَتَوَلَّى \" yang mendustakan (kebenaran) dan berpaling (dari iman).\" Mendustakan ketika memperoleh berita (dari Allah) dan berpaling dari perintah dan larangan (Allah). Dia mendustakan berita tersebut dan tidak membenarkannya, katakanlah kepadanya: Anda akan dibangkitkan lagi. Ia menjawab: Saya tidak akan dibangkitkan lagi. Katakan kepadanya: Di sana ada surga dan nereka. Ia mengatakan: Tidak ada surga dan neraka. Katakanlah kepadanya: Akan terjadi ini dan itu. Ia mengatakan: Itu semua tidak mungkin tejadi. Ini semua adalah pendustaan. وَتَوَلَّى Yakni: Berpaling dari ketaatan kepada Allah, berpaling dari apa-apa yang dibawa oelh rasul-rasul-Nya, inilah orang yang sengsara."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 16: Yang mereka mendustakan para Rasul dan dengan apa yang datang berdasarkan dalil dan bukti, mereka juga menolak keimanan dan ketaatan kepada Allah, dan masuk juga (didalamnya) mukmin yang bermaksiat, yang kemaksiatannya lebih banyak (dari ketaatannya), jika memang rahmat Allah tidak meliputinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 16",
    "description": "Mereka itulah orang yang mendustakan kebenaran yang datang dari Allah dan berpaling dari iman kepada-Nya. 17. Dan sebaliknya, akan selamat dari neraka itu dijauhkan darinya orang yang paling bertakwa sebagai penghargaan iman dan amal salehnya."
  }
]