[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-21. Akan dijauhkan dari neraka orang yang sangat bertakwa, Yang memberikan hartanya karena dia mengharapkan kebaikan. Infaknya bukan dalam rangka membalas kebaikan orang yang telah memberikan kebaikan kepadanya, Akan tetapi dia hanya mencari wajah tuhannya yang maha tinggi dan ridha NYA, Dan Allah akan memberinya apa yang membuatnya ridha di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan manusia yang paling bertakwa akan dijauhkan dari Neraka itu, seperti Abu Bakar -raḍiyallāhu 'anhu-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-21. Sedangkan akan jauh dari neraka orang yang bertakwa yang mengetahui Tuhannya dengan sebenar-benarnya, sehingga dia menginfakkan hartanya di jalan Allah dan membayar zakat untuk membersihkan jiwanya dari kebakhilan. Infak yang diberikan oleh orang beriman bukanlah hadiah bagi orang yang menerima infak, namun itu merupakan amalan yang ikhlas karena Allah dan untuk mengharap keridhaan-Nya. Dan Allah menjanjikan pahala yang besar baginya yang akan menjadikannya ridha dan puas atas kebahagiaan yang dia dapatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَسَيُجَنَّبُهَا الْأَتْقَى (Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu) Yakni orang yang bertakwa benar-benar akan dijauhkan dari kekafiran. Al-Wahidy berkata: menurut pendapat seluruh ahli tafsir yang dimaksud dengan orang yang paling bertakwa dalam ayat ini adalah Abu Bakar. Namun hukumnya berlaku bagi semua orang. Allahu a’lam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "17-18. 1 ) .Dan diantara contoh yang membedakan antara cinta seseorang karena Allah dan cinta karena selain Allah adalah : Bahwasanya Abu bakar as-shiddiq sebagai sahabat Nabi sangat mencintai Rasulullah ikhlas dan ridho karena Allah, sedangkan Abu thalib paman Rasulullah yang juga mencintainya dan selalu menolong beliau adalah karena hati nurani dan adanya hubungan kekkeluargaan, dan bukan cintai karena Allah, maka dari itu Allah menerima amal perbuatan Abu bakar, Allah kemudian menurunkan firman-Nya : { وَسَيُجَنَّبُهَا الْأَتْقَى } dan Dia menolak semua amal perbuatan yang dilakukan oleh Abu thalib, karena sesungguhnya dia termasuk orang-orang yang musyrik dan melakukan sesuatu perbuatan bukan karena Allah. 2 ). Al-Qur'an telah menjelaskan keutamaan dan kemuliaan Abu bakr, ulama tafsir bersepakat bahwa : { وَسَيُجَنَّبُهَا الْأَتْقَى , الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّىٰ } diturunkan atas kebaikan Abu bakr, dan kata \" الأتقى \" dalam Qoidah bahasa arab adalah bentuk tafdhil yang berarti \"yang paling bertaqwa\" , maka jika ayat ini disandingkan dengan firman Allah : { إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ } \" Sungguh, yang paling mulia di antara kamu di sisi Allah ialah { أَتْقَاكُمْ } orang yang paling bertakwa. Sungguh, Allah Maha Mengetahui lagi Mahateliti\" [ Al-Hujurat : 13 ], maka jelaslah bahwasanya Abu bakr adalah orang paling mulia dari ummat ini setelah Nabi Muhammad. 3 ) Tadabburilah dua surah yang agung ini : ( al-Lail ) dan ( al-hujurat ); karena dalam dua surah ini Allah ta'ala menyebut Abu bakar sebagai ummat Nabi yang paling bertaqwa dan paling dermawan, dan balasan baginya adalah beliau akan ridho dengan segala kenikmatan dan kemuliaan dari Allah pada hari kiamat nanti, padahal masa keislaman Abu bakr hanya sekitar 25 tahun. Lalu apa yang telah kamu wujudkan dari sifat-sifat tersebut, yang dengannya pemilik sifat-sifat itu akan masuk kedalam surga dari pintu manapun yang mereka inginkan ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kami akan menjauhkan orang yang bertakwa yang mewaspadai kekafiran dan kemaksiatan dan takut kepada Allah SWT dari neraka. Ibnu Abu Hatim dari ‘Urwah mengatakan: “Sesungguhnya Abu Bakar As-Shiddiq telah membebaskan 7 orang (budak). Semuanya disiksa karena (menyembah Allah), dan saat itulah ayat ini dan setelahnya diturunkan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Akan dijauhkan darinya} akan menjauhkan darinya {orang yang paling bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-21. “Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu, yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,” dengan niat membersihkan diri dan menyucikannya dari berbagai dosa dan kotoran dengan niat karena Allah. Ayat ini menunjukkan, bahwa bila infak sunnah diiringi dengan meninggalkan nafkah wajib seperti membayar hutang dan tidak menunaikan nafkah wajib, hal itu tidaklah disyariatkan. Bahkan menurut kebanyakan ulama, pemberian orang yang bersangkutan tertolak, karena ia membersihkan diri dengan perbuatan yang dianjurkan sementara perbuatan itu membuatnya tidak menunaikan kewajiban. “Dan tidak ada seseorang pun yang memberikan suatu nikmat kepadanya yang harus dibalasnya,” yakni tidak seorang pun yang memiliki suatu nikmat yang menjadi tanggungan orang yang paling bertakwa tersebut melainkan dia pasti membalasnya. Dan bisa saja tersisa suatu karunia dan nikmat yang ditanggung orang lain, namun ia memurnikan diri menjadi hamba Allah, karena hanya Dia semata yang amat lembut kebaikanNya. Lain halnya orang yang masih punya tanggungan pada sesama namun tidak membalasnya, ia pasti membiarkan untuk sesama dan melakukan sesuatu yang bisa mengurangi keikhlasan. Ayat ini meski mencakup Abu Bakar ash-Shiddiq bahkan ada yang menyatakan ayat ini turun disebabkan Abu Bakar, karena tidak seorang pun yang memiliki hak tanggungan nikmat atas Abu Bakar melainkan pasti dibalas, hingga Rasulullah sekali pun, hanya saja nikmat yang diberikan Rasulullah tidak mungkin bisa dibalas, yaitu nikmat dakwah menuju Agama Islam dan mengajarkan petunjuk serta agama kebenaran, Allah dan RasulNya memiliki karunia pada setiap orang yang tidak mungkin bisa dibalas, namun demikian, ayat ini mencakup setiap orang yang memiliki sifat mulia ini, sehingga tidaklah tersisa suatu nikmat pun yang menjadi tanggungan seseorang melainkan pasti dibalas dan amalnya tetap ikhlas karena Allah semata. Karena itu Allah berfirman, “Tetapi (dia memberikan itu semata-mata) karena mencari keridhaan Rabbnya Yang Mahatinggi. Dan kelak dia benar-benar mendapat kepuasan.” Inilah orang yang paling bertakwa karena berbagai macam karamah dan pahala yang diberikan oleh Allah padanya. Dan segala puji hanya untuk Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan orang-orang yang bertaqwa kepada Allah tidak akan memasuki neraka itu, mereka tidak akan merasakan panasnya apai neraka jahannam yang menyala-nyala, Allah ﷻ berfirman : { لَا يَسْمَعُونَ حَسِيسَهَا ۖ وَهُمْ فِي مَا اشْتَهَتْ أَنْفُسُهُمْ خَالِدُونَ , لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ وَتَتَلَقَّاهُمُ الْمَلَائِكَةُ هَٰذَا يَوْمُكُمُ الَّذِي كُنْتُمْ تُوعَدُونَ } ( Mereka tidak mendengar sedikitpun suara api neraka, dan mereka kekal dalam menikmati apa yang diingini oleh mereka , Mereka tidak disusahkan oleh kedahsyatan yang besar (pada hari kiamat), dan mereka disambut oleh para malaikat. (Malaikat berkata): “Inilah harimu yang telah dijanjikan kepadamu”.) [ Al-Anbiya' : 102-103 ] , bahkan suara dari bara api neraka itu tidak akan terdengan oleh telinga orang-orang beriman. { وَسَيُجَنَّبُهَا الْأَتْقَى } Ayat ini menunjukkan bahwa penyebab kesegsaraan adalah hamba itu sendiri, maka barangsiapa yang betaqwa kepada Allah ﷻ dan mengerjakan amal shalih, Allah ﷻ akan menjauhkannya dari api neraka, sedangkan mereka yang mendustakan agama Allah akan dilemparkan kedalam api neraka yang panas itu, setiap jiwa akan mendapatkan balasan dan ganjaran dari amalannya masing-masing, karena amalan setiap hamba adalah penentu bagi dirinya apakah dia akn dimasukkan kedalam neraka itu atau akan dijauhkan darinya dan dimasukkan kedalam surga yang penuh dengan kenikmatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَسَيُجَنَّبُهَا الْأَتْقَى \" Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu,\" وَسَيُجَنَّبُهَا Maknanya: dikauhkan dari nereka yang menyala-nyala ini الْأَتْقَى Atqa adalah bentuk isim tafdhil dari taqwa, yakni orang yang bertaqwa kepada Allah dengan sebenar-benar ketakwaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 17: Allah menjelaskan bahwa seseorang tidak terhindar dari nereka ini kecuali mereka orang-orang yang bertakwa, yang mereka bertakwa kepada Allah dengan melakukan apa perintah-perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 17",
    "description": "Dan sebaliknya, akan selamat dari neraka itu dijauhkan darinya orang yang paling bertakwa sebagai penghargaan iman dan amal salehnya. 18. Dia itulah orang yang menginfakkan hartanya di jalan Allah untuk membersihkan dirinya dari kekikiran, ketamakan, dan sifat buruk lainnya."
  }
]