[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-21. Akan dijauhkan dari neraka orang yang sangat bertakwa, Yang memberikan hartanya karena dia mengharapkan kebaikan. Infaknya bukan dalam rangka membalas kebaikan orang yang telah memberikan kebaikan kepadanya, Akan tetapi dia hanya mencari wajah tuhannya yang maha tinggi dan ridha NYA, Dan Allah akan memberinya apa yang membuatnya ridha di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Yang telah menafkahkan hartanya di jalan-jalan kebaikan untuk membersihkan dirinya dari dosa-dosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. الَّذِى يُؤْتِى مَالَهُۥ (yang menafkahkan hartanya (di jalan Allah)) Yakni yang membelanjakan hartanya di jalan kebaikan. يَتَزَكَّىٰ (untuk membersihkannya) Yakni dia berharap dengan infaknya itu dapat menjadikannya suci di sisi Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "17-18. 1 ) .Dan diantara contoh yang membedakan antara cinta seseorang karena Allah dan cinta karena selain Allah adalah : Bahwasanya Abu bakar as-shiddiq sebagai sahabat Nabi sangat mencintai Rasulullah ikhlas dan ridho karena Allah, sedangkan Abu thalib paman Rasulullah yang juga mencintainya dan selalu menolong beliau adalah karena hati nurani dan adanya hubungan kekkeluargaan, dan bukan cintai karena Allah, maka dari itu Allah menerima amal perbuatan Abu bakar, Allah kemudian menurunkan firman-Nya : { وَسَيُجَنَّبُهَا الْأَتْقَى } dan Dia menolak semua amal perbuatan yang dilakukan oleh Abu thalib, karena sesungguhnya dia termasuk orang-orang yang musyrik dan melakukan sesuatu perbuatan bukan karena Allah. 2 ). Al-Qur'an telah menjelaskan keutamaan dan kemuliaan Abu bakr, ulama tafsir bersepakat bahwa : { وَسَيُجَنَّبُهَا الْأَتْقَى , الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّىٰ } diturunkan atas kebaikan Abu bakr, dan kata \" الأتقى \" dalam Qoidah bahasa arab adalah bentuk tafdhil yang berarti \"yang paling bertaqwa\" , maka jika ayat ini disandingkan dengan firman Allah : { إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ } \" Sungguh, yang paling mulia di antara kamu di sisi Allah ialah { أَتْقَاكُمْ } orang yang paling bertakwa. Sungguh, Allah Maha Mengetahui lagi Mahateliti\" [ Al-Hujurat : 13 ], maka jelaslah bahwasanya Abu bakr adalah orang paling mulia dari ummat ini setelah Nabi Muhammad. 3 ) Tadabburilah dua surah yang agung ini : ( al-Lail ) dan ( al-hujurat ); karena dalam dua surah ini Allah ta'ala menyebut Abu bakar sebagai ummat Nabi yang paling bertaqwa dan paling dermawan, dan balasan baginya adalah beliau akan ridho dengan segala kenikmatan dan kemuliaan dari Allah pada hari kiamat nanti, padahal masa keislaman Abu bakr hanya sekitar 25 tahun. Lalu apa yang telah kamu wujudkan dari sifat-sifat tersebut, yang dengannya pemilik sifat-sifat itu akan masuk kedalam surga dari pintu manapun yang mereka inginkan ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. (Yaitu) orang memberikan harta bendanya di jalan Allah. Dia akan disucikan dengan mengeluarkan harta bendanya hanya karena Allah SWT bukan karena riba dan sum’ah, dan dia membersihkan dirinya dari kekikiran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang menginfakkan} yang menginfakkan {hartanya untuk membersihkan (diri)} menginginkan untuk membersihkan dosa-dosanya, dan tidak ingin riya' dan mencari nama dengan harta itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-21. “Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu, yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,” dengan niat membersihkan diri dan menyucikannya dari berbagai dosa dan kotoran dengan niat karena Allah. Ayat ini menunjukkan, bahwa bila infak sunnah diiringi dengan meninggalkan nafkah wajib seperti membayar hutang dan tidak menunaikan nafkah wajib, hal itu tidaklah disyariatkan. Bahkan menurut kebanyakan ulama, pemberian orang yang bersangkutan tertolak, karena ia membersihkan diri dengan perbuatan yang dianjurkan sementara perbuatan itu membuatnya tidak menunaikan kewajiban. “Dan tidak ada seseorang pun yang memberikan suatu nikmat kepadanya yang harus dibalasnya,” yakni tidak seorang pun yang memiliki suatu nikmat yang menjadi tanggungan orang yang paling bertakwa tersebut melainkan dia pasti membalasnya. Dan bisa saja tersisa suatu karunia dan nikmat yang ditanggung orang lain, namun ia memurnikan diri menjadi hamba Allah, karena hanya Dia semata yang amat lembut kebaikanNya. Lain halnya orang yang masih punya tanggungan pada sesama namun tidak membalasnya, ia pasti membiarkan untuk sesama dan melakukan sesuatu yang bisa mengurangi keikhlasan. Ayat ini meski mencakup Abu Bakar ash-Shiddiq bahkan ada yang menyatakan ayat ini turun disebabkan Abu Bakar, karena tidak seorang pun yang memiliki hak tanggungan nikmat atas Abu Bakar melainkan pasti dibalas, hingga Rasulullah sekali pun, hanya saja nikmat yang diberikan Rasulullah tidak mungkin bisa dibalas, yaitu nikmat dakwah menuju Agama Islam dan mengajarkan petunjuk serta agama kebenaran, Allah dan RasulNya memiliki karunia pada setiap orang yang tidak mungkin bisa dibalas, namun demikian, ayat ini mencakup setiap orang yang memiliki sifat mulia ini, sehingga tidaklah tersisa suatu nikmat pun yang menjadi tanggungan seseorang melainkan pasti dibalas dan amalnya tetap ikhlas karena Allah semata. Karena itu Allah berfirman, “Tetapi (dia memberikan itu semata-mata) karena mencari keridhaan Rabbnya Yang Mahatinggi. Dan kelak dia benar-benar mendapat kepuasan.” Inilah orang yang paling bertakwa karena berbagai macam karamah dan pahala yang diberikan oleh Allah padanya. Dan segala puji hanya untuk Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Orang yang bertaqwa itu adalah yang menginfakkan harta terbaik yang ia miliki, dia menginfakkan hartanya dalam ketaatan kepada Allah, dan apa yang mereka infakkan itu adalah pada hakikatnya hanya untuk dirinya, bukan untuk selainnya, dia merasa bahwa dirinya membutuhkan pertologan dari Allah ﷻ , dia meliha dirinya sangatlah rendah di mata Allah ﷻ , sebanyak apapun harta yang ia miliki, dan sekuat apapaun dirinya ia sangat membutuhkan Allah ﷻ berada dalam perlindunganya, begitulah orang-orang yang beriman da bertaqwa kepada Allah ﷻ , { الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّىٰ } Untuk apa ia infakkan hartanya ? , apakah untuk dipuji orang, sehingga dia berbangga-bangga dengannya, dan membuang-buang seenaknya, dia mengeluarkannya untuk memenuhi kebutuhan syahwatya ?, tentu tidak ... { يُؤْتِي مَالَهُ يَتَزَكَّىٰ } dia menginfakkan hartanya untuk dibersihkan dan disucikan dari dosa dan maksiat, agar diri dan hartanya suci dari sifat kikir dan sombong."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّى \" yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,\" Maksudnya: Yang memberikan hartanya kepada yang berhak menerimanya dengan tujuan mensucikan (membersihkan) harta, Allah Ta'ala berfirman: خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِمْ بِهَا وَصَلِّ عَلَيْهِمْ إِنَّ صَلَاتَكَ سَكَنٌ \" Ambillah zakat dari sebagian harta mereka, dengan zakat itu kamu membersihkan dan mensucikan mereka, dan mendoalah untuk mereka. Sesungguhnya doa kamu itu (menjadi) ketenteraman jiwa bagi mereka.\" Maka firman-Nya: الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّى \" yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,\" memberikan faedah bahwa dia tidak berlebihan dan tidak kikir, tetapi dia hanya mengeluarkannya dalam rangka menbersihkan jiwa. Patokannya adalah yang disebutkan oleh Allah dalam surat al-Furqan: وَالَّذِينَ إِذَا أَنْفَقُوا لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا وَكَانَ بَيْنَ ذَلِكَ قَوَامًا \" Dan orang-orang yang apabila membelanjakan (harta), mereka tidak berlebih-lebihan, dan tidak (pula) kikir, dan adalah (pembelanjaan itu) di tengah-tengah antara yang demikian.\"(Al-Furqan: 103) Kita dapati sebagian orang diberikan keluasan harta oleh Allah, tetapi di pelit, hingga kepada istri, anak-anak dan kerabatnya, ia tidak memberikannya. Kita juga melihat sebagian orang dibatasi dan disempitkan rejekinya oleh Allah sebagian hartanya, walau pun demikian ia pergi berhutang kepada orang-orang agar bisa merenofasi rumahnya sehingga seperti rumahnya fulan dan fulan, atau untuk membeli mobil mewah, seperti mobil mewahnya fulan dan fulan. Kedua cara tersebut adalah cara yang salah, yang pertama: Minim (pelit) yang kedua: berlebihan. Yang wajib adalah hendaknya seorang insan berinfak sesuai kadar kondisinya. Jika ada yang mengatakan: Bolehkan berhutang untuk memberi sedekah? Jawabannya: tidak, karena sedekah adalah bersifat anjuran, dan membiasakan berhutang adalah bahaya besar, karena hutang bukan perkara sepele. Seorang insan bila meninggal dunia maka jiwanya akan terikat dengan hutangnya hingga ia melunasinya, dan kebanyakan ahli waris tidak peduli dengan hutang orang yang meninggal. Anda mendapatinya menunda-nunda bahkan tidak membayarnya, Nabi shallallaahu 'alaihi wa sallam apa bila, disodorkan untuk menyoaltkan jenazah, Beliau akan bertanya, apakah dia punya hutang? Apakah punya harta untuk melunasi? JIka para sahabat berkata: tidak, beliau akan mengatakan: صَلُّوْا عَلَى صَاحِبِكُمْ \"Sholatkanlah sahabat kalian ini\"(1) Rasulullah shallallaahu 'alaihi wa sallam meberitakan bahwa mati syahid di jalan Allah menghapus segala dosa kecuali hutang (2). Hutang ada perkara besar, seorang insan tidak boleh menyepelekannya. (1) Dikeluarkan oleh Bukhari (2297) dan Muslim (1619) dari hadits Abu Hurairah radhiyallaah 'anhu. (2) Dikeluarkan (1885) dari hadits Abu Qotadah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 18: Dan juga yang menginfaqkan hartanya dan membelanjakannya untuk kebaikan, yang dengan itu ia berharap dapat mensucikan hartanya dan dirinya dari dosa dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia mengeluarkannya bukan karena riya’ (agar dilihat manusia) maupun sum’ah (agar didengar mereka), bahkan maksudnya adalah untuk menyucikan dirinya dari dosa dan aib dengan maksud mencari keridhaan Allah ‘Azza wa Jalla. Ayat ini menurut Syaikh As Sa’diy menunjukkan, bahwa apabila dalam infak yang sunat sampai meninggalkan yang wajib, seperti membayar hutang, menafkahi orang yang ditanggungnya, dsb. maka infak itu tidak disyariatkan, bahkan tertolak menurut kebanyakan ulama, karena seseorang tidaklah menyucikan dirinya dengan mengerjakan yang sunat jika sampai meninggalkan yang wajib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 18",
    "description": "Dia itulah orang yang menginfakkan hartanya di jalan Allah untuk membersihkan dirinya dari kekikiran, ketamakan, dan sifat buruk lainnya. 19. Dan tidak ada seorang pun memberikan suatu nikmat atau jasa padanya yang harus dibalasnya. Dia tidak berinfak hanya karena hendak membalas budi baik orang lain kepadanya, melainkan berinfak dengan tulus dan ikhlas."
  }
]