[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-21. Akan dijauhkan dari neraka orang yang sangat bertakwa, Yang memberikan hartanya karena dia mengharapkan kebaikan. Infaknya bukan dalam rangka membalas kebaikan orang yang telah memberikan kebaikan kepadanya, Akan tetapi dia hanya mencari wajah tuhannya yang maha tinggi dan ridha NYA, Dan Allah akan memberinya apa yang membuatnya ridha di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Padahal tidaklah ia menafkahkan apa yang telah dinafkahkan dari hartanya itu untuk membalas kenikmatan yang pernah orang lain berikan kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَمَا لِأَحَدٍ عِندَهُۥ مِن نِّعْمَةٍ تُجْزَىٰٓ (padahal tidak ada seseorangpun memberikan suatu nikmat kepadanya yang harus dibalasnya) Yakni dia tidak berinfak dengan hartanya agar dibalas oleh orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Dan tidak ada satu orang pun yang diketahui imbalan dan penghargaan yang diterimanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada suatu nikmat pun yang diberikan seseorang kepadanya yang dibalas} dibayar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-21. “Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu, yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,” dengan niat membersihkan diri dan menyucikannya dari berbagai dosa dan kotoran dengan niat karena Allah. Ayat ini menunjukkan, bahwa bila infak sunnah diiringi dengan meninggalkan nafkah wajib seperti membayar hutang dan tidak menunaikan nafkah wajib, hal itu tidaklah disyariatkan. Bahkan menurut kebanyakan ulama, pemberian orang yang bersangkutan tertolak, karena ia membersihkan diri dengan perbuatan yang dianjurkan sementara perbuatan itu membuatnya tidak menunaikan kewajiban. “Dan tidak ada seseorang pun yang memberikan suatu nikmat kepadanya yang harus dibalasnya,” yakni tidak seorang pun yang memiliki suatu nikmat yang menjadi tanggungan orang yang paling bertakwa tersebut melainkan dia pasti membalasnya. Dan bisa saja tersisa suatu karunia dan nikmat yang ditanggung orang lain, namun ia memurnikan diri menjadi hamba Allah, karena hanya Dia semata yang amat lembut kebaikanNya. Lain halnya orang yang masih punya tanggungan pada sesama namun tidak membalasnya, ia pasti membiarkan untuk sesama dan melakukan sesuatu yang bisa mengurangi keikhlasan. Ayat ini meski mencakup Abu Bakar ash-Shiddiq bahkan ada yang menyatakan ayat ini turun disebabkan Abu Bakar, karena tidak seorang pun yang memiliki hak tanggungan nikmat atas Abu Bakar melainkan pasti dibalas, hingga Rasulullah sekali pun, hanya saja nikmat yang diberikan Rasulullah tidak mungkin bisa dibalas, yaitu nikmat dakwah menuju Agama Islam dan mengajarkan petunjuk serta agama kebenaran, Allah dan RasulNya memiliki karunia pada setiap orang yang tidak mungkin bisa dibalas, namun demikian, ayat ini mencakup setiap orang yang memiliki sifat mulia ini, sehingga tidaklah tersisa suatu nikmat pun yang menjadi tanggungan seseorang melainkan pasti dibalas dan amalnya tetap ikhlas karena Allah semata. Karena itu Allah berfirman, “Tetapi (dia memberikan itu semata-mata) karena mencari keridhaan Rabbnya Yang Mahatinggi. Dan kelak dia benar-benar mendapat kepuasan.” Inilah orang yang paling bertakwa karena berbagai macam karamah dan pahala yang diberikan oleh Allah padanya. Dan segala puji hanya untuk Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Padahal dia menginfakkan hartanya bukan karena berbalas budi kepada siapa yang telah berbuat baik kepadanya, melainkan hanya untuk meraih ridho dari Allah ﷻ , dia mengurangi beban ekonomi orang lain dengan harta yang ia miliki, bahkan boleh jadi dia tidak mengenal kepada siapa dia menginfakkan harta itu, akan tetapi dengan ikhlas ia melakukan hal itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: وَمَا لِأَحَدٍ عِنْدَهُ مِنْ نِعْمَةٍ تُجْزَى \" padahal tidak ada seorang pun memberikan suatu nikmat kepadanya yang harus dibalasnya,\" Maksudnya: Bahwa ia tidak memberikan sedekah karena memberi balasan kepada orang yang telah memberi sebelumnya, maka tidak ada seorang pun yang punya kelebihan sehingga ia memberi karena membalas budi, tetapi ia memberi karena mengharapkan wajah Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 19: Kemudian Allah menjelaskan bahwa orang-orang yang bertakwa yang menginfaqkan hartanya untuk kebaikan, yang tidaklah mereka orang-orang faqir dan miskin yang belum memiliki kenikmatan, sampai datanglah mereka (orang-orang mukmin) memberi kecukupan baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia telah membalas jasa orang yang telah berbuat baik kepadanya, sehingga infak yang dilakukannya adalah semata-mata ikhlas karena Allah Subhaanahu wa Ta'aala. Menurut sebagian mufassir, ayat ini turun berkenaan dengan Abu Bakar Ash Shiddiq ketika ia membeli Bilal yang sedang disiksa karena beriman, lalu ia (Abu Bakar) memerdekakannya, maka orang-orang kafir berkata, “Sesungguhnya ia (Abu Bakar) melakukan hal itu adalah karena Bilal pernah berjasa kepadanya.” Maka turunlah ayat ini. Namun demikian, ayat ini berlaku kepada siapa saja, yakni siapa saja yang mengerjakan amalan seperti yang dilakukan oleh Abu Bakar Ash Shiddiq radhiyallahu 'anhu, maka dia akan dijauhkan dari neraka dan akan diberi pahala sebagaimana Abu Bakar Ash Shiddiq radhiyallahu 'anhu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 19",
    "description": "Dan tidak ada seorang pun memberikan suatu nikmat atau jasa padanya yang harus dibalasnya. Dia tidak berinfak hanya karena hendak membalas budi baik orang lain kepadanya, melainkan berinfak dengan tulus dan ikhlas. 20. Dia tidak berinfak demi manusia, tetapi berinfak semata karena mencari keridaan tuhannya yang mahatinggi. Allah sangat senang kepada orang yang tulus dan ikhlas dalam berinfak maupun ibadah lainnya."
  }
]