[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-21. Akan dijauhkan dari neraka orang yang sangat bertakwa, Yang memberikan hartanya karena dia mengharapkan kebaikan. Infaknya bukan dalam rangka membalas kebaikan orang yang telah memberikan kebaikan kepadanya, Akan tetapi dia hanya mencari wajah tuhannya yang maha tinggi dan ridha NYA, Dan Allah akan memberinya apa yang membuatnya ridha di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dia tidak menghendaki dari harta yang dia nafkahkan itu kecuali wajah Allah yang Mahatinggi di atas makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Akan tetapi hal itu dilaksanakan hanya untuk mencari ridha Tuhannya saja, sehingga memperoleh imbalan dan keutamaanNya. Dan sungguh dia akan meridhai apa yang diberikan kepadanya berupa pahala di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali karena mencari keridhaan Tuhannya Yang Maha tinggi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-21. “Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu, yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,” dengan niat membersihkan diri dan menyucikannya dari berbagai dosa dan kotoran dengan niat karena Allah. Ayat ini menunjukkan, bahwa bila infak sunnah diiringi dengan meninggalkan nafkah wajib seperti membayar hutang dan tidak menunaikan nafkah wajib, hal itu tidaklah disyariatkan. Bahkan menurut kebanyakan ulama, pemberian orang yang bersangkutan tertolak, karena ia membersihkan diri dengan perbuatan yang dianjurkan sementara perbuatan itu membuatnya tidak menunaikan kewajiban. “Dan tidak ada seseorang pun yang memberikan suatu nikmat kepadanya yang harus dibalasnya,” yakni tidak seorang pun yang memiliki suatu nikmat yang menjadi tanggungan orang yang paling bertakwa tersebut melainkan dia pasti membalasnya. Dan bisa saja tersisa suatu karunia dan nikmat yang ditanggung orang lain, namun ia memurnikan diri menjadi hamba Allah, karena hanya Dia semata yang amat lembut kebaikanNya. Lain halnya orang yang masih punya tanggungan pada sesama namun tidak membalasnya, ia pasti membiarkan untuk sesama dan melakukan sesuatu yang bisa mengurangi keikhlasan. Ayat ini meski mencakup Abu Bakar ash-Shiddiq bahkan ada yang menyatakan ayat ini turun disebabkan Abu Bakar, karena tidak seorang pun yang memiliki hak tanggungan nikmat atas Abu Bakar melainkan pasti dibalas, hingga Rasulullah sekali pun, hanya saja nikmat yang diberikan Rasulullah tidak mungkin bisa dibalas, yaitu nikmat dakwah menuju Agama Islam dan mengajarkan petunjuk serta agama kebenaran, Allah dan RasulNya memiliki karunia pada setiap orang yang tidak mungkin bisa dibalas, namun demikian, ayat ini mencakup setiap orang yang memiliki sifat mulia ini, sehingga tidaklah tersisa suatu nikmat pun yang menjadi tanggungan seseorang melainkan pasti dibalas dan amalnya tetap ikhlas karena Allah semata. Karena itu Allah berfirman, “Tetapi (dia memberikan itu semata-mata) karena mencari keridhaan Rabbnya Yang Mahatinggi. Dan kelak dia benar-benar mendapat kepuasan.” Inilah orang yang paling bertakwa karena berbagai macam karamah dan pahala yang diberikan oleh Allah padanya. Dan segala puji hanya untuk Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tetapi hanya menginginkan ridho dari tuhannya yang maha tinggi, bukan selainnya, bukan karena sanjungan dari orang lain, dia menginfakan hartanya karena ingin mendapat perhatian dari Allah ﷻ pada hari kiamat. Sebab turunnya ayat ini ulama berpendepat bahwa : ayat ini turun di Abu bakr as-siddiq - رضي الله عنه - karena beliau lah orang yang paling derrmawan diantara ummat Nabi Muhammad ﷺ , dan kesetiaannya kepada Rasulullah ﷺ , Abu bakr menginfakkan hartanya untuk kebutuhan peperangan, dan untuk kaum muslimin yang membutuhkan, beliau juga kerap menginfakkan hartanya untuk membebaskan budak, dan tidak ada yang melampauinya dalan bersedekah, oleh karena beliau dijuluki sebagai \"as'shiddiq\" , beliau telah mengalahkan nafsunya dengan tidak terjerumus kedalam golongan orang-orang penggila harta, beliau menginfakkan hartanya di jalan Allah , untuk meraih cinta keridhoan Allah , dan tentunya orang-orang seperti Abu bakr akan dijauhkan dari siksaan api neraka, dan akan mendapat perlindungan di hari kiamat nanti , Rasulullah bersabda : (( اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ )) \"Takutlah kalian kepada neraka walau dengan sebutir kurma\" [ DIriwayatkan oleh Imam bukhori : 5564 ] , jika sesorang tidak mendapat lebih banyak dari sebutir kurma untuk disedekahkan, kemudia dia bersedekah dengan, maka dengan sebutir kurma itu Allah ﷻ akan menjaganya dari sikasaan api neraka, lalu bagaimana dengan mereka yang menginfakkan hartanya yang begitu banyak dengan mengaharap ridho dari Allah ﷻ , seperti Abu bakr as shiddiq, dan 'Utsman bin 'affan, dan 'Abdurrahman bin 'auf, mereka telah menginfakkan dan mensedekahkan harta mereka dijalan Allah ﷻ , mereka adalah orang-orang yang akan mendapat perlindungan dari api neraka, dan akan mendapat tempat khusus di dalam surga."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenaya Allah berfirman إِلَّا ابْتِغَاءَ وَجْهِ رَبِّهِ الْأَعْلَى \" tetapi (dia memberikan itu semata-mata) karena mencari keridaan Tuhannya Yang Maha Tinggi.\" Dia tidak berinfak kecuali dalam rangka mencari wajah Allah, untuk sampai ke negeri kedermawanan Allah (surga-Nya) tempat melihat Allah 'Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 20: Sesungguhnya manusia yang berinfaq karena mengharap wajah Allah, mencari ridha-Nya Yang Maha Tinggi dan Mulia. Dikatakan bahwa ayat ini turun menggambarkan kisah Abu Bakar dan yang semisal dengan kisahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 20",
    "description": "Dia tidak berinfak demi manusia, tetapi berinfak semata karena mencari keridaan tuhannya yang mahatinggi. Allah sangat senang kepada orang yang tulus dan ikhlas dalam berinfak maupun ibadah lainnya. 21. Dan niscaya kelak dia akan mendapat kesenangan yang sempurna dari Allah sebagai balasan atas ketulusannya. Allah memperlakukannya dengan baik, memasukkanya ke surga yang penuh nikmat, dan mempersilakannya bertemu dan melihat Allah."
  }
]