[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-21. Akan dijauhkan dari neraka orang yang sangat bertakwa, Yang memberikan hartanya karena dia mengharapkan kebaikan. Infaknya bukan dalam rangka membalas kebaikan orang yang telah memberikan kebaikan kepadanya, Akan tetapi dia hanya mencari wajah tuhannya yang maha tinggi dan ridha NYA, Dan Allah akan memberinya apa yang membuatnya ridha di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan dia pasti akan merasa puas dengan balasan mulia yang diberikan Allah kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَلَسَوْفَ يَرْضَىٰ (Dan kelak dia benar-benar mendapat kepuasan) Yakni dan Demi Allah, dia akan merasa puas dengan kemuliaan dan pahala yang besar yang Kami berikan kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Akan tetapi hal itu dilaksanakan hanya untuk mencari ridha Tuhannya saja, sehingga memperoleh imbalan dan keutamaanNya. Dan sungguh dia akan meridhai apa yang diberikan kepadanya berupa pahala di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kelak dia akan ridha"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-21. “Dan kelak akan dijauhkan orang yang paling takwa dari neraka itu, yang menafkahkan hartanya (di jalan Allah) untuk membersihkannya,” dengan niat membersihkan diri dan menyucikannya dari berbagai dosa dan kotoran dengan niat karena Allah. Ayat ini menunjukkan, bahwa bila infak sunnah diiringi dengan meninggalkan nafkah wajib seperti membayar hutang dan tidak menunaikan nafkah wajib, hal itu tidaklah disyariatkan. Bahkan menurut kebanyakan ulama, pemberian orang yang bersangkutan tertolak, karena ia membersihkan diri dengan perbuatan yang dianjurkan sementara perbuatan itu membuatnya tidak menunaikan kewajiban. “Dan tidak ada seseorang pun yang memberikan suatu nikmat kepadanya yang harus dibalasnya,” yakni tidak seorang pun yang memiliki suatu nikmat yang menjadi tanggungan orang yang paling bertakwa tersebut melainkan dia pasti membalasnya. Dan bisa saja tersisa suatu karunia dan nikmat yang ditanggung orang lain, namun ia memurnikan diri menjadi hamba Allah, karena hanya Dia semata yang amat lembut kebaikanNya. Lain halnya orang yang masih punya tanggungan pada sesama namun tidak membalasnya, ia pasti membiarkan untuk sesama dan melakukan sesuatu yang bisa mengurangi keikhlasan. Ayat ini meski mencakup Abu Bakar ash-Shiddiq bahkan ada yang menyatakan ayat ini turun disebabkan Abu Bakar, karena tidak seorang pun yang memiliki hak tanggungan nikmat atas Abu Bakar melainkan pasti dibalas, hingga Rasulullah sekali pun, hanya saja nikmat yang diberikan Rasulullah tidak mungkin bisa dibalas, yaitu nikmat dakwah menuju Agama Islam dan mengajarkan petunjuk serta agama kebenaran, Allah dan RasulNya memiliki karunia pada setiap orang yang tidak mungkin bisa dibalas, namun demikian, ayat ini mencakup setiap orang yang memiliki sifat mulia ini, sehingga tidaklah tersisa suatu nikmat pun yang menjadi tanggungan seseorang melainkan pasti dibalas dan amalnya tetap ikhlas karena Allah semata. Karena itu Allah berfirman, “Tetapi (dia memberikan itu semata-mata) karena mencari keridhaan Rabbnya Yang Mahatinggi. Dan kelak dia benar-benar mendapat kepuasan.” Inilah orang yang paling bertakwa karena berbagai macam karamah dan pahala yang diberikan oleh Allah padanya. Dan segala puji hanya untuk Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَلَسَوْفَ يَرْضَىٰ } Dan sungguh dia akan mendapatkan kepuasan dan ridho dengan kenikmatan yang Allah ﷻ berikan kepadanya di hari kiamat; { وَلَسَوْفَ يَرْضَىٰ } Dia akan bahagia di hari akhir ketika mendapatkan ganjaran dari amal sholehnya di dunia, oleh karena itu setiap insan tidak melupakan dan tidak lalai bahwa kehidupan akhirat itu benar-benar ada, selalu membayangkan akhirat akan datang pada waktunya dengan membawa peristiwa-peristiwa agung, maka dengan mengingat akhirat setiap hamba akan mempersiapkan dirinya dengan memperbanyak amalan shalih dan ibadah, dan menginfakkan hartanya yang telah Allah karuniakan kepadanya didunia. Allah ﷻ tidak membebani hamba-Nya apa yang tidak mampu dilakukan oleh mereka, dan tidak pula menolak amalan seorang hamba walau sekecil apapun, Allah ﷻ berfirman : { إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِنْ لَدُنْهُ أَجْرًا عَظِيمًا } ( Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah, dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar. ) [ An Nisa : 40 ] , walau sekecil biji jagung amalan seorang hamba Allah akan melipat gandakan pahalanya, Allah akan menerima sedekah itu, dan akan melipat gandakan nilainya, dalam hadits Rasulullah ﷺ bersabda : (( عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَصَدَّقُ أَحَدٌ بِتَمْرَةٍ مِنْ كَسْبٍ طَيِّبٍ إِلَّا أَخَذَهَا اللَّهُ بِيَمِينِهِ فَيُرَبِّيهَا كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ قَلُوصَهُ حَتَّى تَكُونَ مِثْلَ الْجَبَلِ أَوْ أَعْظَمَ )) Artinya : \"Dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang bersedekah dengan sebutir kurma dari usaha yang halal, maka Allah akan menerimanya dengan tangan kanan-Nya, lalu diperlihara-Nya seperti kamu memelihara anak kambing atau anak unta, sehingga sedekahmu itu bertambah besar sebesar gunung atau lebih besar dari itu.\" [ Hadits Shahih Muslim No. 1685 - Kitab Zakat ] , semua ini merupakan bentuk kebaikan Allah ﷻ kepada hamba-Nya, Dia ﷻ membalas amalan seorang hamba yang sedikit dengan ganjaran yang lebih besar nilainya jika mereka melakukannya dengan niat ikhlas karena Allah ﷻ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَلَسَوْفَ يَرْضَى \" Dan kelak dia benar-benar mendapat kepuasan.\" Yakni: Allah 'Azza Wa Jalla akan meridhainya dengan pemberian berupa pahala yang banyak. Allah telah menjelaskannya dalam firman-Nya: مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ \" Perumpamaan (nafkah yang dikeluarkan oleh) orang-orang yang menafkahkan hartanya di jalan Allah adalah serupa dengan sebutir benih yang menumbuhkan tujuh bulir, pada tiap-tiap bulir: seratus biji. Allah melipat gandakan (ganjaran) bagi siapa yang Dia kehendaki. Dan Allah Maha Luas (karunia-Nya) lagi Maha Mengetahui.\"(Al-Baqarah: 261) Kita memohon kepada Allah agar menjadikan kita termasuk orang-orang yang baik, suci dan dermawan, sesungguhnya Allah Mahakuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 21: Ketahuilah wahai manusia bahwa pensifatan dengan sifat terpuji ini, Allah akan meridhainya di akhirat, dengan memberikan ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan, “Dan kelak dia akan ridha,” yakni ridha dengan pahala di surga yang diberikan kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 21",
    "description": "Dan niscaya kelak dia akan mendapat kesenangan yang sempurna dari Allah sebagai balasan atas ketulusannya. Allah memperlakukannya dengan baik, memasukkanya ke surga yang penuh nikmat, dan mempersilakannya bertemu dan melihat Allah. 1. Demi waktu duha ketika matahari naik sepenggalah, atau demi waktu siang seluruhnya. Penyebutan waktu duha mengisyaratkan bahwa tenggang waktu ketika nabi tidak menerima wahyu beberapa lama bagaikan malam yang gelap, sedangkan turunnya surah ini setelah itu bagaikan fajar yang menyingsing."
  }
]