[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan malam manakala kegelapannya menutup bumi dan apa yang ada di atasnya, Allah bersumpah Juga dengan siang yang mengikis gelapnya malam dengan cahayanya, Allah bersumpah Juga dengan penciptaan pasangan laki laki dan perempuan, Sesungguhnya amal kalian berbeda-beda, ada yang beramal untuk dunia dan ada yang beramal untuk akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan bersumpah dengan makhluk-Nya yang dua macam; yaitu lelaki dan perempuan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَمَا خَلَقَ الذَّكَرَ وَالْأُنثَىٰٓ (dan penciptaan laki-laki dan perempuan) Ini merupakan sumpah Allah dengan jenis laki-laki dan perempuan baik itu dari golongan manusia atau lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3, 4 Dan demi Sang Maha Kuasa yang menciptakan jantan dan betina di antara semua manusia, hewan dan tumbuhan. Sesungguhnya perbuatan dan usaha kalian wahai manusia berbeda-beda dan saling terpisah, di antaranya ada amal shalih untuk mendapatkan surga dan amal buruk untuk mendapatkan neraka. Ini adalah jawaban dari qasam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan demi penciptaan laki-laki dan perempuan} Aku bersumpah demi penciptaan dua pasangan, laki-laki dan perempuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan penciptaan laki-laki dan perempuan”; bila ‘maa’ dalam ayat ini adalah kata sambung, maka sumpah dalam ayat ini adalah dengan DiriNya Yang Mahamulia yang disifati sebagai Pencipta lelaki dan perempuan. Dan bila ‘maa’ tersebut adalah kata keterangan, maka sumpah tersebut adalah dengan penciptaanNya bagi lelaki dan perempuan serta sempurnanya hikmah Allah dalam hal itu dengan menciptakan setiap spesies hewan yang ingin dipertahankan Allah berpasangan, jantan dan betina, agar spesiesnya tetap ada dan tidak punah. Allah mendorong masing-masing dari keduanya dengan rantai libido pada yang lain dan menjadikan masing"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَمَا خَلَقَ الذَّكَرَ وَالْأُنْثَىٰ } Dan dengan yang menciptakan laki-laki dan perempuan, dialah Allah ﷻ , dan sebagimana yang diketahui bahwasanya jenis laki-laki dan perempuan adalah umum untuk seluruh makhluk, Allah ﷻ berfirman : { وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ } ( Dan segala sesuatu Kami ciptakan berpasang-pasangan supaya kamu mengingat kebesaran Allah. ) [ Az-Zariyat : 49 ] , dua jenis kelamin yang berbeda ini ada pada manusia, binatang, tumbuhan, dan pepohonan, semuanya terdiri dari dua jenis itu. Dalam riwayat laian dikatakan : Bahwasanya maksud dari laki-laki dan perempuan dalam ayat ini adalah Adam dan istrinya Hawwa' , tetapi yang paling zohir adalah maksud dari ayat ini adalah umum untuk semua makhluk, dan tentunya Adam dan Hawwa' termasuk didalam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا خَلَقَ الذَّكَرَ وَالْأُنْثَى \" dan penciptaan laki-laki dan perempuan,\" Yakni: Penciptaan laki-laki dan perempuan bisa ditafsirkan dengan salah satu dari dua tafsir, yang menjadikan ما [Ma] di sini sebagai ma mashdariyah, dan yanل menciptakan laki-laki dan perempuan Dialah Allah 'Azza wa Jalla jika ditafsirkan dengan penafsiran kedua. Maka makna penafsiran pertama: Allah Subhaanahu wa Ta'ala bersumpah dengan penciptaan laki-laki dan perempuan. Sedangkan yang kedua: Allah Ta'ala bersumpah dengan diri-Nya, karena Dialah yang menciptakan laki-laki dan perempuan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 3: 1-4. Allah memulai dalam surat ini berkenaan dengan keimanan, dimana Allah bersumpah dengan malam jika makhluk telah bersembunyi karena gelapnya. Allah juga bersumpah dengan siang jika nampak dan tersingkap dan menerangi alam semesta. Allah bersumpah dengan diri-Nya yang menciptakan laki-laki dan perempuan. Kemudian datang jawaban atas sumpah Allah, dan Allah mengabarkan tentang amalan kalian wahai manusia yang beramal dengan macam-macam amal yang mulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Adam dan Hawa’, atau setiap laki-laki dan perempuan. Kata ‘maa’ di ayat ini bisa sebagai isim mushul yang berarti ‘yang’ sehingga artinya, “Demi yang menciptakan laki-laki dan perempuan,” yaitu Allah Subhaanahu wa Ta'aala. Bisa juga kata ‘maa’ di ayat ini sebagai masdariyyah, sehingga artinya, “Demi penciptaan laki-laki dan perempuan,’ yang menunjukkan sempurnanya hikmah (kebijaksanaan)-Nya, dimana Dia menciptakan makhluk hidup berpasang-pasangan untuk melestarikannya, maka Mahasuci Allah Pencipta yang sebaik-baiknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 3",
    "description": "Demi penciptaan laki-laki dan perempuan dari setetes mani. Manusia tidak mempunyai rekayasa apa pun dalam penciptaan kedua jenis ini. Semua diatur oleh Allah sesuai kebijaksana'an-Nya terhadap makhluk. 4. Demi ketiga hal itu, sungguh usahamu memang beraneka macam. Sebagian dari kamu memilih jalan ketaatan kepada Allah dan sebagian yang lain memilih durhaka."
  }
]