[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan malam manakala kegelapannya menutup bumi dan apa yang ada di atasnya, Allah bersumpah Juga dengan siang yang mengikis gelapnya malam dengan cahayanya, Allah bersumpah Juga dengan penciptaan pasangan laki laki dan perempuan, Sesungguhnya amal kalian berbeda-beda, ada yang beramal untuk dunia dan ada yang beramal untuk akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sesungguhnya amal perbuatan kalian -wahai manusia- berbeda-beda, ada yang baik yang merupakan penyebab masuk ke dalam Surga, dan ada yang buruk yang merupakan penyebab masuk ke dalam Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-7. Setelah sumpah yang ditegaskan tiga kali itu, kemudian disebutkan isi dari sumpah tersebut untuk menjelaskan bahwa amalan manusia bermacam-macam, antara yang beramal untuk kehidupan dunia dan merasa puas dengan perhiasannya; dan yang berusaha memperoleh akhirat dengan mengedepankan amal kebaikan; amal manusia bermacam-macam dan jalan untuk menempuhnya berbeda-beda. Kemudian Allah menjelaskan beberapa jalan ini dan dua golongan tersebut: Satu golongan yang dimudahkan, dan golongan lain yang dipersulit. Golongan pertama menginfakkan hartanya tanpa imbalan, dan hanya berharap itu sebagai bekal bertemu Tuhannya; dan dia takut dari azab-Nya, serta beriman kepada hal-hal yang menjadi konsekuensi syahadatnya. Golongan ini adalah golongan yang Kami beri taufik untuk melaksanakan kebaikan dan syariat yang dimudahkan, kesudahan mereka adalah kebahagiaan dengan cepat masuk surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِنَّ سَعْيَكُمْ لَشَتَّىٰ (sesungguhnya usaha kamu memang berbeda-beda) Yakni perbuatan kalian sungguh berbeda-beda. Sebagian beramal untuk surga, dan lainnya beramal untuk neraka; sebagian berusaha membebaskan dirinya, dan lainnya menjerumuskan dirinya ke dalam kebinasaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3, 4 Dan demi Sang Maha Kuasa yang menciptakan jantan dan betina di antara semua manusia, hewan dan tumbuhan. Sesungguhnya perbuatan dan usaha kalian wahai manusia berbeda-beda dan saling terpisah, di antaranya ada amal shalih untuk mendapatkan surga dan amal buruk untuk mendapatkan neraka. Ini adalah jawaban dari qasam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya usaha kalian} pekerjaan kalian {benar-benar beragam} beragam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah berfirman, “Sesungguhnya usaha kamu memang berbeda-beda.” Inilah yang disumpahkan Allah. Artinya, sesungguhnya usaha kalian wahai para mukallaf berbeda-beda. Perbedaan ini mengacu pada tingkat amal, ukuran, dan segi kegiatannya dan juga berdasarkan maksud dari perbuatan itu sendiri, apakah dimaksudkan untuk Wajah Allah Yang Mahaagung dan Abadi sehingga amal yang dikerjakan tetap kekal seiring keberadaan Allah dan membawa manfaat bagi pelakunya, ataukah amalan tersebut sirna dan fana sehingga usaha yang dilakukan pun runtuh dan sirna seiring runtuh dan sirnanya amalan tersebut. Itulah semua perbuatan yang tidak dimaksudkan untuk Wajah Allah dengan sifat seperti itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّ سَعْيَكُمْ } Sesungguhnya usaha dan amalan kalian di dunia ini wahai manusia { لَشَتَّىٰ } adalah berbeda-beda, dan bertolak belakang satu sama lainnya, diantara kalian ada kafir, dan ada yang beriman, ada yang taat kepada tuhannya, dana ada yang melampaui batas, diantara kalian ada yang kerap melakukan amal shalih, akan tetapi ada juga yang hanya menyukai kemaksiatan. Perbedaan amalan manusia seperti halnya dengan perbedaan antara siang dan malam, dan laki dan perempuan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ سَعْيَكُمْ لَشَتَّى \" sesungguhnya usaha kamu memang berbeda-beda.\" Maksudnya: sesungguhnya amalan kalian berbeda-beda dengan perbedaan yang besar. Allah bersumpah dengan perkara yang bertolak belakang terhadap perkara yang bertolak belakan: Malam kebalikan siang, laki-laki dengan permpuan, usaha pun bertolak belakang baik dan buruk, maka yang dijadikan sumpah dan yang disumpah serasi. Ini adalah tingginya sastra bahasa AL-Quran. Maknanya: Bahwa perbedaan malam dan siang, laki-laki dan perempuan, adalah perkara yang Nampak jelas tidak samar, begitu juga perbuatan-perbuatan para hamba, berbeda-beda juga bertingkat-tingkat. Ada yang baik ada yang rusak, ada yang tercampur antara yang baik dan yang rusak, semua itu berjalan dengan ketentuan taqdir Allah 'Azza Wa Jalla, Allah memberikan petunjuk kepada siapapun yang Dia kehendaki kepada jalan yang lurus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 4: 1-4. Allah memulai dalam surat ini berkenaan dengan keimanan, dimana Allah bersumpah dengan malam jika makhluk telah bersembunyi karena gelapnya. Allah juga bersumpah dengan siang jika nampak dan tersingkap dan menerangi alam semesta. Allah bersumpah dengan diri-Nya yang menciptakan laki-laki dan perempuan. Kemudian datang jawaban atas sumpah Allah, dan Allah mengabarkan tentang amalan kalian wahai manusia yang beramal dengan macam-macam amal yang mulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang mengerjakan amal yang memasukkan ke surga, yaitu ketaatan, dan ada pula yang mengerjakan amal yang memasukkan ke neraka, yaitu kemaksiatan. Ada yang mengerjakan amal ikhlas karena-Nya sehingga usahanya tidak sia-sia dan bermanfaat bagi pelakunya dan ada pula yang mengerjakan amal bukan karena-Nya atau untuk sesuatu yang fana sehingga usahanya sia-sia. Ini adalah jawab atau isi sumpahnya. Oleh karena itulah, Allah Subhaanahu wa Ta'aala merincikan orang yang beramal dan sifat amal mereka pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 4",
    "description": "Demi ketiga hal itu, sungguh usahamu memang beraneka macam. Sebagian dari kamu memilih jalan ketaatan kepada Allah dan sebagian yang lain memilih durhaka. 5-7. Maka barang siapa memberikan hartanya di jalan Allah, seperti ke-pada fakir miskin, anak yatim, dan kebajikan lainnya, dan bertakwa kepada Allah dengan melaksanakan perintah-Nya dan menghindari larangan-Nya, dan membenarkan adanya pahala yang terbaik, yaitu surga di akhirat, atau membenarkan kalimat tauhid dengan beriman kepada Allah dengan kukuh, maka akan kami mudahkan baginya jalan menuju kemudahan dan kebahagiaan; menuju surga. Kami juga akan memudahkan jalannya untuk senantiasa beramal saleh dan taat kepada kami."
  }
]