[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-7. Barangsiapa memberikan hartanya dan bertakwa kepada Allah dalam hal itu, Membenarkan “laa ilaha illallah” dan apa yang menjadi petunjuknya,serta balasan yang diakibatkanya, Maka kami akan membimbingnya dan memberinya taufik kepada sebab-sebab kebaikan dan keshalihan, dan kami akan memudahkan urusannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Adapun orang-orang yang memberikan apa yang seharusnya dia berikan, berupa zakat, nafkah dan tebusan, dan takut terhadap apa yang dilarang oleh Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَأَمَّا مَنْ أَعْطَىٰ وَاتَّقَىٰ (Adapun orang yang memberikan (hartanya di jalan Allah) dan bertakwa) Yakni membelanjakan hartanya untuk kebaikan dan menjauhi hal-hal yang diharamkan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "5-7. 1 ). فَأَمَّا مَنْ أَعْطَىٰ وَاتَّقَىٰ } Dua kata ini \"أعطى\" ( memberi ) dan \"التقى\" ( bertaqwa ) adalah dua inti agama secara umum, dengan maksud mengagungkan perintah Allah, dan mengasihi hamba-hamba Allah; maka untuk mengagungkan perintah Allah perlu adanya rasa takut dalam diri dan tuduk dihadapan-Nya, sedangkan untuk berbelas kasih kepada sesama hamba Allah adalah dengan berbuat baik kepada mereka. 2 ) . Syaikh assa'di rahimahullah berkata : ayat-ayat ini menggabungkan seluruh sebab-sebab yang dengannya kebahagian dapat diraih; yaitu ada sebab : mengerjakan perintah Allah : { أعطى } , dan menjauhi segala larangan { و اتقى } , serta membenarkan segala yang dikabarkan oleh Allah dan Rasul-Nya : { وَ صَدَّقَ بِالحُسْنَى } . Maka barangsiapa yang mengerjakan tiga perkara diatas Allah akan memudahkan segala urusannya : { فَسَنُيَسِّرُهُ لِلْيُسْرَى }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Barangsiapa yang mengorbankan harta benda untuk menunaikan kewajiban zakat, melaksanakan perintah-perintah (Allah) dan menjauhi larangan-laranganNya. (Ayat ini diturunkan untuk Abu Bakar yang membebaskan para budak (laki-laki) dan para (budak) perempuan saat mereka masuk Islam, lalu Ayahnya berkata kepadanya: “Aku melihatmu membebaskan budak-budak”, lalu dia menjawab: “Sesungguhnya aku menginginkan apa yang ada di sisi Allah” kemudian turunlah ayat-ayat ini)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun siapa saja yang memberikan} mengorbankan hartanya di jalan Allah {dan bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-7. Karena itulah Allah membedakan mereka yang beramal dan menyebutkan sifat pekerjaan-pekerjaan mereka seraya berfirman, “Adapun orang yang memberikan (hartanya di jalan Allah),” yakni menunaikan ibadah harta yang diperintahkan seperti zakat, nafkah, kaffarat, sedekah, infak untuk kebajikan, dan ibadah badan seperti shalat, puasa dan lainnya, maupun gabungan antara ibadah harta dan badan seperti haji, umrah, dan lainnya “dan bertakwa” dengan menjaga diri dari hal-hal yang diharamkan dan kemaksiatan dengan berbagai jenisnya, “dan membenarkan adanya pahala yang terbaik (syurga),” yakni membenarkan dengan kalimat tauhid dan semua keyakinan agama yang ditunjukannya, serta segala akibat baiknya berupa balasan akhirat, “maka Kami kelak akan menyiapkan baginya jalan yang mudah.” Maksudnya, Kami akan mempermudah urusannya, segala kebaikan Kami jadikan mudah baginya dan Kami mudahkan baginya meninggalkan segala keburukan, karena ia menempuh sebab-sebab kemudahan, sehingga Allah mempermudahkannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan diantara manusia ada yang berusaha memperbaiki dirinya dengan kebaikan-kebaikan, dia mengifakkan hartanya untuk kebaikan yang diridhoi oleh Allah, dan dia juga bertaqwa kepada Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah merinci usaha yang bermacam macam tesebut, Allah berfirman: فَأَمَّا مَنْ أَعْطَى وَاتَّقَى (5) وَصَدَّقَ بِالْحُسْنَى (6) فَسَنُيَسِّرُهُ لِلْيُسْرَى (7) \" Adapun orang yang memberikan (hartanya di jalan Allah) dan bertakwa, dan membenarkan adanya pahala yang terbaik (surga),. maka Kami kelak akan menyiapkan baginya jalan yang mudah.\" فَأَمَّا مَنْ أَعْطَى \" Adapun orang yang memberikan (hartanya di jalan Allah) \" Maknanya: Apa-apa yang diperintahkan untuk diberikan berupa harta, kedudukan, atau ilmu وَاتَّقَى \" dan bertakwa,\" bertaqwa terhadapap apa-apa yang diperintahkan dengan menghidari dari perkara-perkara yang diharamkan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 5: 5-7. Allah merinci dan menjelaskan bahwa manusia dari segi amalan terbagi menjadi dua kelompok. Kelompok pertama : Siapa yang beramal dan amalannya memberikan petunjuk kepadanya untuk menuju surga, kemudian Allah berkata : Adapun barangsiapa yang berinfaq dari hartanya sesuai dengan yang diperintahkan dan menjauhi apa yang dilarang, dan meyakini bahwa surga telah Allah siapkan bagi orang-orang yang beriman dari hambanya, kemudian (Allah menjelaskan) barangsiapa pula yang memiliki sifat dengan semua sifat mulia yang disebutkan ini, maka Allah akan kumpulkan pada dirinya amalan kebaikan dan Allah akan jadikan orang-orang yang menang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata ‘a’thaa’ pada ayat ini bisa maksudnya memberikan apa yang diperintahkan untuk diberikan atau mengerjakan apa yang diperintahkan untuk dikerjakan. Contoh memberikan apa yang diperintahkan untuk diberikan adalah mengerjakan ibadah maaliyyah (harta) seperti mengeluarkan zakat, kaffarat, nafkah, sedekah dan berinfak pada jalur-jalur kebaikan. Contoh mengerjakan apa yang diperintahkan untuk dikerjakan adalah mengerjakan ibadah badaniyyah (badan) seperti mengerjakan shalat, puasa, dsb. atau yang tersusun dari keduanya (ibadah harta dan badan) seperti haji dan umrah. Kata ‘Ittaqaa’ pada ayat ini bisa juga diartikan ‘menjaga diri’ yakni menjaga dirinya dari apa yang dilarang berupa perkara haram dan kemaksiatan dengan berbagai bentuknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 5",
    "description": "5-7. Maka barang siapa memberikan hartanya di jalan Allah, seperti ke-pada fakir miskin, anak yatim, dan kebajikan lainnya, dan bertakwa kepada Allah dengan melaksanakan perintah-Nya dan menghindari larangan-Nya, dan membenarkan adanya pahala yang terbaik, yaitu surga di akhirat, atau membenarkan kalimat tauhid dengan beriman kepada Allah dengan kukuh, maka akan kami mudahkan baginya jalan menuju kemudahan dan kebahagiaan; menuju surga. Kami juga akan memudahkan jalannya untuk senantiasa beramal saleh dan taat kepada kami. 5-7"
  }
]