[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-7. Barangsiapa memberikan hartanya dan bertakwa kepada Allah dalam hal itu, Membenarkan “laa ilaha illallah” dan apa yang menjadi petunjuknya,serta balasan yang diakibatkanya, Maka kami akan membimbingnya dan memberinya taufik kepada sebab-sebab kebaikan dan keshalihan, dan kami akan memudahkan urusannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan membenarkan adanya balasan yang telah dijanjikan oleh Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَصَدَّقَ بِالْحُسْنَىٰ (dan membenarkan adanya pahala yang terbaik (surga)) Yakni mempercayai janji Allah yang menjanjikan kepadanya untuk memberinya balasan atas apa yang telah ia infakkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "5-7. 1 ). فَأَمَّا مَنْ أَعْطَىٰ وَاتَّقَىٰ } Dua kata ini \"أعطى\" ( memberi ) dan \"التقى\" ( bertaqwa ) adalah dua inti agama secara umum, dengan maksud mengagungkan perintah Allah, dan mengasihi hamba-hamba Allah; maka untuk mengagungkan perintah Allah perlu adanya rasa takut dalam diri dan tuduk dihadapan-Nya, sedangkan untuk berbelas kasih kepada sesama hamba Allah adalah dengan berbuat baik kepada mereka. 2 ) . Syaikh assa'di rahimahullah berkata : ayat-ayat ini menggabungkan seluruh sebab-sebab yang dengannya kebahagian dapat diraih; yaitu ada sebab : mengerjakan perintah Allah : { أعطى } , dan menjauhi segala larangan { و اتقى } , serta membenarkan segala yang dikabarkan oleh Allah dan Rasul-Nya : { وَ صَدَّقَ بِالحُسْنَى } . Maka barangsiapa yang mengerjakan tiga perkara diatas Allah akan memudahkan segala urusannya : { فَسَنُيَسِّرُهُ لِلْيُسْرَى }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Dan menerima kalimat-kalimat yang baik, yaitu akidah keesaan Allah dan membenarkan utusan-utusanNya dan janjiNya dengan imbalan atas ketaatan (kepadaNya)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Serta membenarkan adanya (balasan) yang terbaik} janji dari Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-7. Karena itulah Allah membedakan mereka yang beramal dan menyebutkan sifat pekerjaan-pekerjaan mereka seraya berfirman, “Adapun orang yang memberikan (hartanya di jalan Allah),” yakni menunaikan ibadah harta yang diperintahkan seperti zakat, nafkah, kaffarat, sedekah, infak untuk kebajikan, dan ibadah badan seperti shalat, puasa dan lainnya, maupun gabungan antara ibadah harta dan badan seperti haji, umrah, dan lainnya “dan bertakwa” dengan menjaga diri dari hal-hal yang diharamkan dan kemaksiatan dengan berbagai jenisnya, “dan membenarkan adanya pahala yang terbaik (syurga),” yakni membenarkan dengan kalimat tauhid dan semua keyakinan agama yang ditunjukannya, serta segala akibat baiknya berupa balasan akhirat, “maka Kami kelak akan menyiapkan baginya jalan yang mudah.” Maksudnya, Kami akan mempermudah urusannya, segala kebaikan Kami jadikan mudah baginya dan Kami mudahkan baginya meninggalkan segala keburukan, karena ia menempuh sebab-sebab kemudahan, sehingga Allah mempermudahkannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah menginfakkan hartanya dan bertaqwa kepada Allah, { وَصَدَّقَ } dia juga meyakini dan mengimani { بِالْحُسْنَىٰ } bahwa ganjaran dan balasan atas kebaikan yang ia berikan telah Allah siapkan, dalam riwayat lain dikatakan : { بِالْحُسْنَىٰ } yakni kalimat tahil لا إله إلا الله , dan kedua penafsiran diatas masuk kedalam makna ayat . Diantara manusia ada yang kerap memberikan hartanya, dia senang dengan kebaikan yang ia sampaikan kepada orang lain, akan tetapi maksud pemberiannya itu adalah riya' dan berbangga-bangga, bukan untuk mengharap ridho dari Allah ﷻ , dan tidak pula dia meyakini adanya balasn disetiap kebaikan itu, dan tidak ada ketaqwaan yang ia persembahkan untuk Allah ﷻ , melainkan hanya menginginkan pujian dan sanjungan dari orang lain. Dan sesungguhnya hanyalah orang-orang yang menginfakkan hartanya di jalan Allah, dan bertaqwa kepada Allah ﷻ yang akan bermanfaat pemberiannya, bermanfaat bagi dirinya dan bagi orang lain, dan mereka inilah yang akan mendapat ganjaran yang jauh lebih besar dari tuhannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَصَدَّقَ بِالْحُسْنَى \" Maknanya: Membenarkan perkataan terbaik yaitu perkataan Allah 'Azza Wa Jalla dan sabda Rasul-Nys shallallaahu 'alaihi wa sallam, karena sebenar-benar dan sebaik-baik ucapan adalah perkataan Allah 'Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 6: 5-7. Allah merinci dan menjelaskan bahwa manusia dari segi amalan terbagi menjadi dua kelompok. Kelompok pertama : Siapa yang beramal dan amalannya memberikan petunjuk kepadanya untuk menuju surga, kemudian Allah berkata : Adapun barangsiapa yang berinfaq dari hartanya sesuai dengan yang diperintahkan dan menjauhi apa yang dilarang, dan meyakini bahwa surga telah Allah siapkan bagi orang-orang yang beriman dari hambanya, kemudian (Allah menjelaskan) barangsiapa pula yang memiliki sifat dengan semua sifat mulia yang disebutkan ini, maka Allah akan kumpulkan pada dirinya amalan kebaikan dan Allah akan jadikan orang-orang yang menang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Al Husna bisa berarti ‘Laailaahaillallah’ serta yang ditunjukkannya berupa perkara-perkara ‘aqidah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 6",
    "description": "5-7. Maka barang siapa memberikan hartanya di jalan Allah, seperti kepada fakir miskin, anak yatim, dan kebajikan lainnya, dan bertakwa kepada Allah dengan melaksanakan perintah-Nya dan menghindari larangan-Nya, dan membenarkan adanya pahala yang terbaik, yaitu surga di akhirat, atau membenarkan kalimat tauhid dengan beriman kepada Allah dengan kukuh, maka akan kami mudahkan baginya jalan menuju kemudahan dan kebahagiaan; menuju surga. Kami juga akan memudahkan jalannya untuk senantiasa beramal saleh dan taat kepada kami"
  }
]