[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Sedangkan barangsiapa yang bakhil dengan hartanya,tidak membutuhkan pahala dari tuhannya, Mendustakan “laa ilaha illallah” dan petunjukannya serta apa yang diakibatkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Adapun orang yang bakhil dengan hartanya, tidak menyalurkan apa yang menjadi kewajibannya, dan merasa cukup dengan hartanya sehingga tidak membutuhkan Allah serta tidak mau memohon karunia dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-11. Sedangkan golongan kedua bersikap pelit dan enggan berinfak, merasa puas dengan syahwat dunia dan lalai dari pertemuan dengan Allah dan balasan dari-Nya, mengira tidak membutuhkan rahmat dari Allah, dan mendustakan kalimat syahadat dan Rasulullah; Kami akan memberi mereka kemudahan dalam kehidupan mereka untuk menuju kesengsaraan yang menyebabkan mereka cepat masuk neraka. Apakah orang yang sengsara itu mendapat manfaat dari harta yang dia kumpulkan, dan enggan menginfakkannya ketika dia telah jatuh ke dalam jurang neraka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Adapun orang yang kikir dalam menginfakkan harta bendanya di jalan kebaikan, tidak membutuhkan pahala dari Allah dengan (lebih memilih) syahwat dunia dan meninggalkan Allah SWT. (Ibnu Abbas berkata: “Ayat ini diturunkan untuk Umayyah bin Khallaf”)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang yang kikir} orang yang kikir dengan hartanya sehingga tidak mau mengorbankannya di jalan kebaikan {dan merasa cukup} tidak membutuhkan pahala Allah sehingga tidak menginginkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. “Dan adapun orang-orang yang bakhil,” dengan apa yang diperintahkan dan tidak mau mengeluarkan infak wajib dan sunnah dan tidak merelakan dirinya menunaikan kewajiban untuk Allah, “dan merasa dirinya cukup,” tidak memerlukan Allah dengan tidak menyembahNya dan tidak menganggap dirinya butuh pada Rabbnya sementara tidak ada keselamatan, keberuntungan, dan kemenangan bagi jiwa selain menjadikan Allah sebagai Dzat yang dicintai dan disembah yang dimaksudkan dan menjadi tujuan, “serta mendustakan pahala yang terbaik,” yakni mendustakan apa yang diwajibkan Allah atas para hamba untuk dipercayai berupa akidah-akidah yang baik, “maka kelak Kami akan menyiapkan baginya (jalan) yang sukar,” yakni untuk keadaan sulit dan sifat-sifat tercela dengan dijadikan sebagai orang yang mudah melakukan keburukan, di mana saja berada, ia selalu terkait dengan perbuatan-perbuatan maksiat. Kita memohon kepada Allah semoga diberi keselamatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَأَمَّا مَنْ بَخِلَ } Dan barangsiapa kikir dengan hartanya yang Allah limpahkan kepadanya, dia menolak untuk mengeluarkan zakat, menolak untuk menunaikan kewajibannya dari harta yang ia miliki, { وَاسْتَغْنَىٰ } selain kikir dia juga merasa bahwa apa yang ia miliki saat ini sangatlah cukup, dan meyangka bahwa dia tidak butuh dengan pertolongan Allah ﷻ , dia merasa bahwa pahala dan balasan dari Tuhannya tidak berarti apa-apa dibandingkan dengan kekayaaan yang ia miliki."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya Allah berfirman: وَأَمَّا مَنْ بَخِلَ \" Dan adapun orang-orang yang bakhil \" Ia tidak memberikan apa-apa yang diperintahkan untuk diberikan وَاسْتَغْنَى \" dan merasa dirinya cukup,\" Merasa tidak butuh dengan Allah 'Azza Wa Jalla, dan tidak bertakwa kepada Rabb-nya, bahkan ia merasa tidak butuh kepada rahmat Allah,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lail ayat 8: 8-9. Kemudian Allah menjelaskan kelompok yang kedua : Yaitu siapa yang amalannya mengantarkannya menuju ke dalam neraka, kemudian Allah berkata : Adapun barangsiapa yang bakhil dengan menginfakkan hartanya, dan tidak memberikan kepada orang-orang yang kekurangan dan yang miskin, hak bagi mereka karena sebab kikir dan bakhil, kemudian (mereka adalah mansuaia) yang merasa kaya dan cukup dari meminta kepada Allah dan dari pahala yang Ia berikan, bahkan menjadi para pendusta yang mendustakan surga dan kenikmatannya, lalu mendustakan hari akhir dengan balasan dan perhitungan (amalan), dan mendustakan setiap apa yang Allah wajibkan atas hambanya dari keimanan dan amalan shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia pun menolak berinfak yang wajib maupun yang sunat, dan dirinya tidak senang mengerjakan kewajiban. Yang dimaksud dengan merasa dirinya cukup ialah tidak memerlukan pertolongan Allah dan pahala-Nya, sehingga ia meninggalkan beribadah kepada-Nya dan merasa dirinya tidak butuh kepada Tuhannya, padahal tidak ada keselamatan dan keberuntungan kecuali jika Allah Subhaanahu wa Ta'aala yang dicintainya, disembahnya serta dihadapkan diri kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lail Ayat 8",
    "description": "8-10. Dan adapun orang yang kikir terhadap hartanya dengan tidak memenuhi hak Allah dalam harta itu dan merasa dirinya cukup dengan apa yang dia punya sehingga tidak lagi memerlukan pahala dari Allah tidak mau beramal untuk kehidupan akhiratnya, serta mendustakan pahala yang terbaik, yaitu surga di akhirat; atau ingkar kepada Allah, hari akhir, dan apa yang Allah janjikan kepada mereka yang beramal saleh sehingga dia senantiasa melakukan maksiat, maka akan kami mudahkan baginya jalan menuju kesukaran dan kesengsaraan. Kami tutup hatinya dari keinginan untuk berbuat kebajikan dan kami tahan langkahnya untuk taat kepada kami"
  }
]