[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-15. Janganlah engkau (wahai Rasul) menaati setiap orang yang banyak bersumpah, pembohong lagi rendah, banyak mengghibah orang, berjalan di antara mereka dengan menyebarkan namimah (adu domba), yaitu menukil pembicaraan sebagian dari mereka ke sebagian lainnya untuk merusak hubungan mereka, kikir dan bakhil dalam urusan harta, tidak memberikannya untuk kebenaran, kuat menghalang-halangi kebaikan, melampaui batas dalam melanggar hak manusia dan memakan yang diharamkan, banyak berdosa, kuat kekafirannya, keji dan buruk, dinasabkan bukan kepada bapaknya; hanya karena dia punya harta kekayaan dan anak-anak, dia menyombongkan diri di depan kebenaran. Bila salah satu ayat al-Quran dibacakan kepadanya, dia mendustakannya. Dia berkata, “Ini adalah kebatilan dan khurafat orang-orang dulu.” Ayat-ayat ini walaupun walaupun turun pada sebagian orang-orang musyrik seperti al-Walid bin al-Mughirah, hanya saja ia mengandung peringatan bagi Muslim agar tidak menyamai orang yang memiliki sifat-sifat tercela ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Karena dia mempunyai harta dan anak, dia sombong menolak iman kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. أَن كَانَ ذَا مَالٍ وَبَنِينَ (karena dia mempunyai (banyak) harta dan anak) Yakni janganlah kamu mentaatinya karena ia memiliki harta dan keturunan yang banyak. Pendapat lain mengatakan bahwa yang dimaksud dengan kalimat ini adalah untuk mengolok orang ini, sebab kenikmatan berupa anak dan harta yang Allah berikan kepadanya membuat dirinya ingkar kepada Allah, Rasulullah, dan ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13-14. Orang yang kejam, keras, dan orang yang menyeru dalam suku Quraisy. Apa karena dia memiliki harta dan anak?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{karena dia} karena dia {mempunyai banyak harta dan anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Kesimpulannya, Allah melarang untuk menaati orang-orang tukang bersumpah, pendusta, berjiwa dan berperangai buruk, khususnya perangai yang mencakup rasa ujub terhadapdiri sendiri, bersikap sombong terhadap kebenaran dan sesama manusia, menghina orang lain dengan ghibah dan namimah, menuduh orang lain, dan banyak berbuat maksiat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 14: Allah menjelaskan sebab mereka (demikian adalah) karena memiliki harta, kekayaan dan anak yang dengannya ia merasa kaya kemudian mendustakan ayat-ayat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang yang mempunyai banyak anak dan harta lebih mudah mendapat pengikut. Tetapi jika dia mempunyai sifat-sifat seperti tersebut pada ayat 10-13, maka tidak patut diikuti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 14",
    "description": "14-16. Di antara faktor yang menyebabkan orang tersebut berperangai buruk adalah karena dia merasa diri sebagai pemilik harta yang banyak, kaya dan juga memiliki banyak anak. Namun dia mengingkari ajaran Allah, maka apabila ayat-ayat kami dibacakan kepadanya, dia berkata, 'lni adalah dongeng-dongeng orang dahulu. ' sungguh buruk sifat orang ini! kelak dia akan kami beri tanda pada belalai yaitu hidung-Nya, diberikan tanda tersebut sebagai bentuk penghinaan kepadanya"
  }
]