[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16. Kami akan membuat tanda pada hidungnya yang menempel padanya dan tidak terpisah darinya sebagai hukuman baginya, agar hal itu mempermalukannya di depan orang-orang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Kami akan menaruh tanda yang menjelakkan di atas hidungnya dan melekat padanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Orang yang memiliki sifat-sifat tersebut akan mendapat siksaan pada hari kiamat dengan siksaan yang menghinakan, karena dia akan ditampakkan kepada seluruh makhluk dalam keadaan yang hina yang dapat terlihat di hidung atau mukanya, agar terlihat keburukannya. Ayat-ayat ini bersifat umum, mencakup setiap orang yang memiliki sifat-sifat tersebut, baik itu orang-orang yang ada di masa lalu atau saat ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. سَنَسِمُهُۥ عَلَى الْخُرْطُومِ (Kelak akan Kami beri tanda dia di belalai(nya)) Yakni Kami akan memberi warna hitam pada hidungnya, yaitu ia akan dihitamkan wajahnya dengan api sebelum di masukkan ke dalam neraka; sehingga pada hidungnya terdapat tanda, sehingga itu menjadi aib yang tidak dapat hilang darinya, namun itu akan menjadi tanda khusus baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Kami anak menjadikan untuknya suatu tanda. Tanda di atas hidungnya sehingga dia menjadi berbeda dengan orang yang hidup di sekitarnya. Kemudian terpotonglah hidung Walid bin Mughirah oleh tebasan pedang saat perang Badar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami akan memberinya tanda} Kami akan memberi tanda yang tidak bisa terlepas darinya {pada belalainya} hidungnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Kemudian Allah mengancam orang yang sifat-sifatnya sesuai dengan yang disebutkan Allah di atas akan diberi tanda “di belalai (nya),” di dalam siksaan, di mana Allah akan menyiksanya secara nyata hingga menjadi tanda pada sesuatu yang paling berat baginya, yaitu wajahnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 16: Allah mengabarkan bahwasanya ia dengan segala sifatnya ini yang buruk akan menjadikan kekafirannya memiliki tanda di hidungnya yang terhinakan dengannya selama kehidupannya, dan telah ia dapatkan secara sempurna di perang Badr."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengancam orang yang seperti itu sifatnya, bahwa Allah Subhaanahu wa Ta'aala akan menandai hidungnya untuk diazab dengan azab yang tampak jelas. Yang dimaksud dengan ‘belalai’ di sini ialah hidung. Dipakai kata belalai di sini sebagai penghinaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 16",
    "description": "14-16. Di antara faktor yang menyebabkan orang tersebut berperangai buruk adalah karena dia merasa diri sebagai pemilik harta yang banyak, kaya dan juga memiliki banyak anak. Namun dia mengingkari ajaran Allah, maka apabila ayat-ayat kami dibacakan kepadanya, dia berkata, 'lni adalah dongeng-dongeng orang dahulu. ' sungguh buruk sifat orang ini! kelak dia akan kami beri tanda pada belalai yaitu hidung-Nya, diberikan tanda tersebut sebagai bentuk penghinaan kepadanya. 17-18. Apa yang dialami oleh para pengingkar ayat-ayat Allah yaitu kaum musyrik mekah itu memiliki kesamaan dengan kisah sekelompok pemilik kebun yang juga angkuh lagi kikir. Sungguh, kami telah menguji mereka, yaitu orang musyrik mekah, sebagaimana kami telah menguji pemilik-pemilik kebun, ketika dua dari tiga di antara mereka itu bersumpah pasti akan memetik hasilnya pada pagi hari, agar fakir miskin tidak melihatnya, tetapi mereka tidak menyisihkan dengan mengucapkan, 'lnsya Allah'."
  }
]