[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Sesungguhnya Kami menguji orang-orang Makkah dengan kekeringan dan kelaparan, sebagaimana Kami menguji para pemilik kebun saat mereka bersumpah di antara mereka bahwa mereka akan memanen hasil kebun mereka di pagi buta agar orang-orang miskin dan yang seperti mereka tidak datang meminta, dan mereka tidak berkata, “Insya Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sesungguhnya Kami memberikan cobaan kepada orang-orang musyrik dengan kekeringan dan kelaparan sebagaimana Kami telah memberi cobaan kepada para pemilik kebun ketika mereka bersumpah bahwa mereka pasti memetik hasil kebunnya pada pagi hari dengan segera sehingga orang miskin tidak memakan hasilnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "Pada ayat-ayat berikut ini (ayat 17-33) akan disebutkan kisah para pemilik kebun yang enggan menunaikan hak orang-orang miskin yang harus mereka tunaikan, maka Allah menghukum mereka dengan menghancurkan kebun yang mereka miliki; sehingga pada akhirnya mereka menyesal dan berusaha memperbaiki kesalahan mereka. Ini merupakan pelajaran bagi mereka dan bagi orang-orang yang mengetahui kisah ini. 17-18. Dalam ayat ini disampaikan bahwa musibah yang menimpa orang-orang musyrik Makkah seperti yang menimpa kaum sebelum mereka yang memiliki kebun; mereka bersepakat dan bersumpah untuk memanen buah dari kebuh mereka pada pagi hari tanpa menyisakan sedikitpun untuk orang-orang yang membutuhkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. إِنَّا بَلَوْنٰهُمْ (Sesungguhnya Kami telah mencobai mereka) Yakni orang-orang kafir Makkah. Allah menguji mereka dengan kelaparan dan kekeringan akibat doa Rasulullah atas mereka. كَمَا بَلَوْنَآ أَصْحٰبَ الْجَنَّةِ(sebagaimana Kami telah mencobai pemilik-pemilik kebun) Kisah mereka sangat dikenal oleh kaum Quraisy. Terdapat pendapat mengatakan bahwa kebun itu terletak di negeri Yaman sejauh dua farsakh dari Sana’a. kebun itu milik seorang lelaki yang mau menunaikan zakat dari kebun itu; setelah ia meninggal, anak-anaknya mewarisi kebun itu; namun mereka enggan menyedekahkan hasil dari kebun itu untuk orang-orang dan tidak mau menunaikan zakatnya. Mereka berkata: “Harta ini hanya sedikit, sedangkan keluarga yang kita tanggung banyak, sehingga kita tidak dapat melakukan apa yang dahulu dilakukan oleh ayak kita.” Mereka bertekat untuk tidak memberi orang-orang miskin sebagian hasil kebun itu. Maka akibat perbuatan mereka itu sebagaimana yang Allah kisahkan dalam surat ini. إِذْ أَقْسَمُوا۟ لَيَصْرِمُنَّهَا مُصْبِحِينَ (ketika mereka bersumpah bahwa mereka sungguh-sungguh akan memetik (hasil)nya di pagi hari) Yakni mereka bertekat untuk memanen buah dari kebun itu saat pagi hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Sesungguhnya kami menguji penduduk Mekah dengan kegersangan, kelaparan dan musibah lainnya yang merupakan bala’ dan wabah penyakit. Sebagaimana kami menguji orang-orang yang hidupnya di sekitar taman saat bersumpah akan memanen buah-buahan dari taman mereka saat pagi agar tidak dapat dinikmati oleh orang-orang miskin. Mereka tidak memberi orang-orang miskin apapun, sebagaimana yang dilakukan telah dilakukan oleh leluhur mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah menguji mereka} Sesungguhnya Kami menguji penduduk Mekkah dengan kekeringan dan kelaparan {sebagaimana Kami telah menguji} Kami menguji {pemilik-pemilik kebun} kebun {ketika mereka bersumpah bahwa mereka pasti akan memetiknya} pasti memetik buahnya {pada pagi hari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. Allah berfirman bahwa Dia menguji orang-orang yang mendustakan dengan kebaikan, Allah memberi mereka tangguhan dan memberikan berbagai hal yang dikehendakiNya berupa harta, anak, umur panjang dan lainnya yang sesuai dengan hawa nafsu mereka, bukan karena kemuliaan mereka dalam pandangan Allah, bahkan (sebaliknya) bisa jadi merupakan penundaan (agar mereka mengintrospeksi diri) tapi mereka tidak menyadarinya. Mereka terlena dengan semua itu , mirip dengan keadaan para penghuni surga yang sama-sama diberi berbagai kenikmatan ketika pepohonan surga berbuah, buahnya meranum dan sudah waktunya diketam, mereka memastikan semua nikmat tersebut berada di tangan dan dalam kekuasaan mereka, tidak ada sesuatu pun yang menghalangi mereka untuk semua itu. Karena itu, mereka (orang-orang kafir yang tertipu dengan kesenangan dan kenikmatan dunia) bersumpah tanpa adanya pengecualian bahwa mereka akan mendapatkannya, sedangkan mereka tidak mengetahui bahwa Allah mengintai mereka, siksaan akan mereka dapatkan dengan segera."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 17: Allah mengabarkan bahwa Ia menguji penduduk Mekkah dengan rasa lapar dan kekeringan karena sebab mereka kufur akan nikmat yang Allah berikan dan mendustakan utusan-Nya Muhammad ﷺ, sebagaimana Allah telah uji sebelumnya, yaitu pemilik kebun yang berkompot untuk merebut harta orang miskin; Pada saat itu, ketika mereka bersumpah akan memetik buah di kebun mereka di waktu pagi sekali, sebelum mereka mendatangi faqir dan miskin untuk memberikan kepada mereka apa yang menjadi kebiasaan mereka setiap tahunnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menguji orang-orang yang mendustakan itu dan memberi tangguh mereka serta memberi harta dan anak sesuai yang Allah kehendaki dan memanjangkan umur mereka serta memberikan apa yang mereka sukai lainnya adalah bukan karena kemuliaan mereka, bahkan sebagai istidraj (penangguhan azab) dari arah yang tidak mereka sadari. Tertipunya mereka itu seperti tertipunya orang-orang yang memiliki kebun bersama-sama, ketika buah-buahnya telah matang, dan sudah tiba saat untuk memetiknya, dan mereka telah berniat jahat dengan tidak memberikan sebagiannya untuk orang-orang miskin serta mengira bahwa tidak ada yang dapat menghalangi mereka untuk mengambil semuanya sehingga mereka bersumpah tanpa mengucapkan ‘insya Allah’ (jika Allah menghendaki) bahwa mereka akan memetiknya pada pagi hari agar tidak diketahui oleh orang-orang miskin. Mereka tidak mengetahui bahwa Allah Subhaanahu wa Ta'aala mengintai mereka dan bahwa kebun mereka akan ditimpa bencana. Agar orang-orang miskin tidak mengetahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 17",
    "description": "17-18. Apa yang dialami oleh para pengingkar ayat-ayat Allah yaitu kaum musyrik mekah itu memiliki kesamaan dengan kisah sekelompok pemilik kebun yang juga angkuh lagi kikir. Sungguh, kami telah menguji mereka, yaitu orang musyrik mekah, sebagaimana kami telah menguji pemilik-pemilik kebun, ketika dua dari tiga di antara mereka itu bersumpah pasti akan memetik hasilnya pada pagi hari, agar fakir miskin tidak melihatnya, tetapi mereka tidak menyisihkan dengan mengucapkan, 'lnsya Allah'"
  }
]