[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Sesungguhnya Kami menguji orang-orang Makkah dengan kekeringan dan kelaparan, sebagaimana Kami menguji para pemilik kebun saat mereka bersumpah di antara mereka bahwa mereka akan memanen hasil kebun mereka di pagi buta agar orang-orang miskin dan yang seperti mereka tidak datang meminta, dan mereka tidak berkata, “Insya Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan mereka tidak menyebutkan pengecualian dalam sumpah mereka dengan ucapan, “Insya Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَلَا يَسْتَثْنُونَ (dan mereka tidak menyisihkan (hak fakir miskin)) Yakni mereka tidak mengucapkan ‘Insyaallah.’ Pendapat lain mengatakan: yakni mereka tidak menyisihkan bagian harta yang dahulu ayah mereka berikan kepada orang-orang miskin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Mereka tidak berniat menyisihkan apapun yang menjadi hak orang-orang miskin. Mereka tidak berkata melalui sisi baik mereka: “Jika Allah menghendaki”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tetapi mereka tidak mengecualikan} mereka tidak mengatakan,\"Jika Allah menghendaki\""
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. Allah berfirman bahwa Dia menguji orang-orang yang mendustakan dengan kebaikan, Allah memberi mereka tangguhan dan memberikan berbagai hal yang dikehendakiNya berupa harta, anak, umur panjang dan lainnya yang sesuai dengan hawa nafsu mereka, bukan karena kemuliaan mereka dalam pandangan Allah, bahkan (sebaliknya) bisa jadi merupakan penundaan (agar mereka mengintrospeksi diri) tapi mereka tidak menyadarinya. Mereka terlena dengan semua itu , mirip dengan keadaan para penghuni surga yang sama-sama diberi berbagai kenikmatan ketika pepohonan surga berbuah, buahnya meranum dan sudah waktunya diketam, mereka memastikan semua nikmat tersebut berada di tangan dan dalam kekuasaan mereka, tidak ada sesuatu pun yang menghalangi mereka untuk semua itu. Karena itu, mereka (orang-orang kafir yang tertipu dengan kesenangan dan kenikmatan dunia) bersumpah tanpa adanya pengecualian bahwa mereka akan mendapatkannya, sedangkan mereka tidak mengetahui bahwa Allah mengintai mereka, siksaan akan mereka dapatkan dengan segera."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 18: Allah menjelaskan bahwa mereka terlalu yakin sehingga tidak mengucapkan Insya Allah. Dan kisah berkenaan dengan penghuni surga : Dulu bapak mereka adalah orang yang shalih yang memiliki kebun, Dan jika berbuah ia bagi buahnya menjadi tiga bagian. Bagian untuk keluarganya, bagian untuk ditanam kembali intuk bercocok-tanam dan bagian untuk faqir dan miskin. Maka ketika ia mati, anak-anaknya berkata : Tidak ada bagian untuk orang faqir dan miskin. Maka Allah menurunkan hukuman bagi mereka, karena sebab niat dan perbuatan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 18",
    "description": "17-18. Apa yang dialami oleh para pengingkar ayat-ayat Allah yaitu kaum musyrik mekah itu memiliki kesamaan dengan kisah sekelompok pemilik kebun yang juga angkuh lagi kikir. Sungguh, kami telah menguji mereka, yaitu orang musyrik mekah, sebagaimana kami telah menguji pemilik-pemilik kebun, ketika dua dari tiga di antara mereka itu bersumpah pasti akan memetik hasilnya pada pagi hari, agar fakir miskin tidak melihatnya, tetapi mereka tidak menyisihkan dengan mengucapkan, 'lnsya Allah'. 19-20. Lalu akibat perbuatannya tersebut, kebun itu ditimpa bencana yang besar dan buruk yang datang dari tuhanmu ketika mereka sedang tidur lelap. Maka jadilah kebun itu hitam karena terbakar hangus, seperti malam yang gelap gulita, atau pohon itu telah menjadi gundul setelah dipetik semua buahnya."
  }
]