[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Maka Allah menurunkan api yang membakar kebun itu di malam hari saat mereka tidur, sehingga kebun itu menghitam seperti malam yang kelam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Maka Allah mengirimkan api ke kebun itu, yang membakarnya, sementara pemiliknya sedang tidur, tidak mampu memadamkan api dari kebun itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-21. Maka Allah mengirimkan sesuatu kepada kebun mereka yang menghancurkan buah-buahan dan pepohonannya ketika mereka sedang tidur di malam hari, sehingga mereka tidak mengetahui sama sekali apa yang terjadi dengan kebun mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَطَافَ عَلَيْهَا طَآئِفٌ مِّن رَّبِّكَ وَهُمْ نَآئِمُونَ (lalu kebun itu diliputi malapetaka (yang datang) dari Tuhanmu ketika mereka sedang tidur) Yakni api dari Allah mengelilingi dan membakar kebun itu sampai menjadi abu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Kemudian bala’ yang merupakan azab dari Tuhanmu meliputi dan menimpa taman itu. Bala’ itu adalah api yang menghanguskannya dan mereka sedang tidur di malam hari."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu kebun itu ditimpa} lalu kebun itu ditimpa {bencana} api yang membakarnya {dari Tuhanmu ketika mereka sedang tidur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. “Lalu kebun itu diliputi malapetaka (yang datang) dari Rabbmu,” maksudnya, azab yang turun pada malam hari, “ketika mereka sedang tidur.” Azab itu membinasakan dan melenyapkannya, “maka jadilah kebun itu hitam seperti malam yang gelap gulita,” yaitu seperti malam yang gelap; pohon dan buahnya telah sirna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 19: Kemudian Allah menurunkan atas kebunnya, api yang membakar kebunnya dan mebinasakannya di malam hari, dan mereka pada saat itu sedang terlelap."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut sebagian mufassir, bahwa bencana itu adalah api yang membakarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 19",
    "description": "19-20. Lalu akibat perbuatannya tersebut, kebun itu ditimpa bencana yang besar dan buruk yang datang dari tuhanmu ketika mereka sedang tidur lelap. Maka jadilah kebun itu hitam karena terbakar hangus, seperti malam yang gelap gulita, atau pohon itu telah menjadi gundul setelah dipetik semua buahnya"
  }
]