[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Nun, pembicaraan tentang huruf-huruf terpenggal telah hadir di awal Surat al-baqarah. Allah bersumpah dengan pena yang dengannya para malaikat dan manusia menulis, dan dengan apa yang mereka tulis, berupa kebaikan, manfaat dan ilmu-ilmu, kamu (wahai rasul) bukan orang yang lemah akal dan bodoh pendapat karena nikmat Allah berupa kenabian dan kerasulan. Sesungguhnya kamu, atas beban berat yang kamu pikul selama menyampaikan risalah, akan mendapatkan pahala yang besar yang tidak dikurangi dan tidak terputus, dan sesungguhnya kiamu (wahai Rasul) benar-benar memilki akhlak yang agung, yaitu akhlak-akhlak yang dikandung al-Quran. Pelaksanaan terhadap al-Quran merupakan ciri khusus Rasulullah, beliau melaksanakan perintah-perintahnya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Kamu -wahai Rasul- bukanlah orang yang gila karena kenabian yang dikaruniakan Allah kepadamu, justru kamu bebas dari kegilaan yang dituduhkan oleh orang-orang musyrik kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Ayat ini -yang merupakan jawaban dari sumpah Allah- mengingkari penyakit jiwa yang dituduhkan orang-orang musyrik kepada Nabi Muhammad, dan menjelaskan bahwa kenabian merupakan kenikmatan besar dari Allah yang Dia istimewakan bagi Nabi Muhammad."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. مَآ أَنتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُونٍ (berkat nikmat Tuhanmu kamu (Muhammad) sekali-kali bukan orang gila) Yakni hai Muhammad, kamu dengan kenikmatan yang Allah berikan kepadamu berupa kenabian dan kepemimpinan, bukanlah orang yang gila."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Kamu tidaklah gila wahai Rasulallah akibat nikmat yang diberikan Tuhanmu berupa risalah dan nubuwwah sebagaimana yang dituduhkan orang-orang musyrik. Maksudnya adalah Allah menghilangkan kegilaan dari (diri)mu. Ibnu Al-Mundzir dari Ibnu Juraij yang berkata: “Orang-orang musyrik itu berkata bahwa Nabi SAW itu orang gila dan setan. Kemudian turunlah ayat {Maa Anta Bi Ni’mati Rabbika Bi Majnuun}”. Sesungguhnya bagimu pahala yang tidak terputus-putus"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{berkat karunia Tuhanmu kamu bukanlah orang gila"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah bersumpah dengan pena yang merupakan kata benda umum (isim jenis) yang mencakup seluruh macam pena yang dipakai untuk mencatat berbagai disiplin ilmu dan dipakai untuk menulis prosa dan puisi. Pena dan perkataan apa saja yang ditulis dengan pena merupakan salah satu tanda-tanda kebesaran Allah yang besar, yang berhak untuk dijadikan obyek sumpah Allah atas terbebasnya Nabi Muhammad dari sifat gila yang dituduhkan pada beliau oleh musuh-musuh beliau. Sumpah Allah ini menafikan sifat gila yang dituduhkan itu karena nikmat dan kebaikan RabbNya, karena Dia menganugerahkan akal yang sempurna, pandangan yang arif, dan perkataan yang fasih yang merupakan hal terbaik yang ditulis pena dan dicatat oleh manusia. Dan itulah kebahagiaan di dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 2: Kemudian datang jawaban bagi sumpah pada ayat sebelumnya, Allah berkata : Tidaklah engkau wahai Nabi, dengan sebab karunia dan nikmat-Nya atasmu, yang dengannya engkau membawa kerisalahan dan cahaya, yang engkau sendiri bukanlah termasuk orang yang lemah akalnya dan bodoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan bantahan terhadap ucapan orang-orang kafir bahwa Nabi Muhammad shallallahu 'alaihi wa sallam adalah orang gila."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 2",
    "description": "1-4. Akhir surah sebelumnya, berbicara tentang dua kelompok yang saling bertolak belakang. Satu dibinasakan dan satu diselamatkan. Di awal surah ini dijelaskan sifat siapa yang akan mendapat keselamatan dan siapa yang akan mendapat azab. N'n. Demi pena yang biasa digunakan untuk menulis oleh malaikat atau oleh siapa pun, dan juga demi apa yang mereka tuliskan. Dengan karunia tuhanmu yang berupa risalah dan nubuwah, engkau, wahai nabi Muhammad sekali-kali bukanlah orang gila sebagaimana yang dituduhkan oleh kaum musyrik. Dan sesungguhnya berkat perjuangan dan kesabaranmu engkau pasti mendapat pahala yang besar yang tidak putus-putusnya. Dan sesungguhnya engkau benar-benar berbudi pekerti yang luhur. Karena tuhanmu yang mendidikmu dengan akhlak Al-Qur'an"
  }
]