[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22. Karena itu sebagian memanggil sebagian yang lain saat pagi, “Pergilah segera ke kebun kalian, bila kalian memang hendak memanen buah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Sambil berkata, “Keluarlah segera menuju kebun kalian sebelum kedatangan orang-orang fakir jika kalian ingin memetik hasil kebun kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-23. Pada saat pagi tiba, para pemilik kebun itu saling berseru agar mereka bergegas menuju kebun. Maka mereka pergi ke kebun di pagi buta untuk memanen buah-buahannya sebagaimana yang mereka sepakati pada malam hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. أَنِ اغْدُوا۟ عَلَىٰ حَرْثِكُمْ (“Pergilah diwaktu pagi (ini) ke kebunmu) Yakni pergilah di waktu pagi buta menuju kebun sebelum orang-orang miskin datang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Maka sebaiknya mereka cepat-cepat keluar di pagi hari melihat buah-buahan dan tanaman mereka, jika menginginkan hasil buah yang hitam, memanen dan memetik buah-buah itu. Pergilah kalian di waktu yang kalian tentukan, yaitu waktu pagi. Al-Hirtsu adalah sesuatu yang dihasilkan bumi, berupa buah-buahan yang tumbuh dari pohon-pohon dan tanaman kebun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Pergilah pagi-pagi} keluarlah pagi-pagi {ke kebun kalian} ke kebun kalian {jika kalian hendak memetik hasil.”} hendak memetik buahnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. Begitulah, namun mereka tidak merasakan kenyataan pahit ini. Karena itu mereka saling memanggil satu sama lain di pagi harinya, mereka saling berkata satu sama lain, “Pergilah di waktu pagi (ini) ke kebunmu jika kamu hendak memetik buahnya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 22: 21-22. Maka ketika muncul matahari, maka sebagian dari mereka menyeru kepada sebagian yang lain : Mari kita pergi pagi-pagi sekali ke kebun untuk mengambil buah-buahan sebelum datang orang-orang miskin (faqir) jika memang kalian orang-orang yang bersemangat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 22",
    "description": "21-24. Mereka belum mengetahui bahwa kebun sudah hancur. Sesuai dengan rencana mereka, lalu dengan penuh rahasia pada pagi hari mereka saling memanggil, 'pergilah pagi-pagi ke kebunmu jika kamu hendak memetik hasil sesuai dengan yang telah kita rencanakan. \" maka mereka pun berangkat dengan diam-diam sambil berbisik-bisik dengan meng-ingatkan, 'pada hari ini jangan sampai ada seorang miskin pun masuk ke dalam kebunmu. ' khususnya pada saat sedang memetik hasilnya. Kalau sampai ada, itu akan merusak rencana"
  }
]