[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Maka mereka berangkat dengan segera, mereka merahasiakan pembicaraan di antara mereka, “Jangan membiarkan siapa pun dari orang-orang yang membutuhkan masuk ke kebun kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Lalu mereka berjalan menuju kebun mereka dengan cepat, sebagian dari mereka berkata kepada sebagian yang lain dengan suara yang rendah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Kemudian mereka pergi menuju kebun mereka. Mereka berjalan dalam kelompok dan saling berbisik-bisik sehingga tidak ada satupun yang dapat mendengar (apa yang mereka bicarakan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berangkat sambil berbisik-bisik} mereka saling berbisik satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-24. “Maka pergilah mereka,” menuju perkebunan, “mereka saling berbisik-bisikan,” di antara mereka seraya menahan hak Allah dengan mengatakan, “Pada hari ini janganlah ada seorang miskin pun yang masuk ke dalam kebunmu.” Maksudnya, pergilah sesegera mungkin sebelum orang-orang berkeliaran. Mereka saling menasehati untuk menahan hak orang miskin dan saking Terlalu banyak dan pelitnya mereka hingga mereka mengutarakan pembicaraan itu secara berbisik-bisik agar tidak didengar oleh seorang pun, supaya berita itu tidak bocor pada orang-orang miskin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 23: 23-24. Maka keluarlah mereka menuju kebunnya, dan mereka saling berucap dengan suara yang lirih, agar mereka saling mengetahui. Mereka saling mengatakan : Jangan kalian biarkan masuk ke dalam kebun ini (pada hari ini), tidak satupun bagi kalian membiarkan masuk ke dalamnya orang faqir dan miskin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar tidak terdengar oleh seorang pun yang nantinya akan memberitahukan kepada orang-orang fakir-miskin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 23",
    "description": "21-24. Mereka belum mengetahui bahwa kebun sudah hancur. Sesuai dengan rencana mereka, lalu dengan penuh rahasia pada pagi hari mereka saling memanggil, 'pergilah pagi-pagi ke kebunmu jika kamu hendak memetik hasil sesuai dengan yang telah kita rencanakan. \" maka mereka pun berangkat dengan diam-diam sambil berbisik-bisik dengan meng-ingatkan, 'pada hari ini jangan sampai ada seorang miskin pun masuk ke dalam kebunmu. ' khususnya pada saat sedang memetik hasilnya. Kalau sampai ada, itu akan merusak rencana"
  }
]