[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Maka mereka berangkat dengan segera, mereka merahasiakan pembicaraan di antara mereka, “Jangan membiarkan siapa pun dari orang-orang yang membutuhkan masuk ke kebun kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Sebagian berkata kepada sebagian yang lain, “Jangan sampai satu orang miskin pun masuk ke dalam kebun kalian pada hari ini.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Mereka pergi ke kebun sambil berbincang dengan suara berbisik bahwa mereka tidak akan mengizinkan satu orang miskinpun untuk memasuki kebun mereka, karena mereka adalah pemilik kebun sehingga mereka merasa berhak untuk berbuat apapun terhadapnya dan melarang orang lain untuk memasukinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَن لَّا يَدْخُلَنَّهَا الْيَوْمَ عَلَيْكُم مِّسْكِينٌ (Pada hari ini janganlah ada seorang miskinpun masuk ke dalam kebunmu”) Mereka saling membisikkan ucapan ini, yaitu janganlah ada satupun orang miskin yang masuk kepada kalian ke dalam kebun ini, agar ia tidak meminta kepada kalian apa yang dulu diberikan ayah kalian kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Pada hari itu, janganlah sekali-kali orang fakir miskin memasuki taman. (An) berfungsi untuk menjelaskan sesuatu yang masih samar-samar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Pada hari ini jangan sampai ada orang miskin yang memasukinya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-24. “Maka pergilah mereka,” menuju perkebunan, “mereka saling berbisik-bisikan,” di antara mereka seraya menahan hak Allah dengan mengatakan, “Pada hari ini janganlah ada seorang miskin pun yang masuk ke dalam kebunmu.” Maksudnya, pergilah sesegera mungkin sebelum orang-orang berkeliaran. Mereka saling menasehati untuk menahan hak orang miskin dan saking Terlalu banyak dan pelitnya mereka hingga mereka mengutarakan pembicaraan itu secara berbisik-bisik agar tidak didengar oleh seorang pun, supaya berita itu tidak bocor pada orang-orang miskin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 24: 23-24. Maka keluarlah mereka menuju kebunnya, dan mereka saling berucap dengan suara yang lirih, agar mereka saling mengetahui. Mereka saling mengatakan : Jangan kalian biarkan masuk ke dalam kebun ini (pada hari ini), tidak satupun bagi kalian membiarkan masuk ke dalamnya orang faqir dan miskin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena begitu bakhilnya mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 24",
    "description": "21-24. Mereka belum mengetahui bahwa kebun sudah hancur. Sesuai dengan rencana mereka, lalu dengan penuh rahasia pada pagi hari mereka saling memanggil, 'pergilah pagi-pagi ke kebunmu jika kamu hendak memetik hasil sesuai dengan yang telah kita rencanakan. \" maka mereka pun berangkat dengan diam-diam sambil berbisik-bisik dengan meng-ingatkan, 'pada hari ini jangan sampai ada seorang miskin pun masuk ke dalam kebunmu. ' khususnya pada saat sedang memetik hasilnya. Kalau sampai ada, itu akan merusak rencana. 25-27. Dan setelah semuanya siap termasuk segala peralatan yang dibutuhkan, maka berangkatlah mereka pada pagi hari dengan niat menghalangi orang-orang miskin mendapatkan pemberian hasil kebun mereka, padahal mereka mampu menolongnya. Maka betapa terkejutnya ketika mereka melihat kebun itu ternyata telah binasa, mereka pun berkata, 'sungguh, kita ini benar-benar orang-orang yang sesat dengan merencanakan sesuatu yang buruk, akhirnya rusaklah kebun kita, bahkan kita tidak memperoleh apa pun. '."
  }
]