[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25. Mereka berangkat ke kebun mereka di pagi hari dengan tujuan tidak baik yaitu tidak memberikan sebagian hasil kebun kepada orang-orang miskin, mereka merasa sangat mampu melakukan apa yang hendak mereka lakukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan mereka berangkat pada pagi hari untuk menghalangi hasil kebun mereka dan menahannya dengan tekad kuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَغَدَوْا۟ عَلَىٰ حَرْدٍ (Dan berangkatlah mereka di pagi hari dengan niat menghalangi (orang-orang miskin)) Yakni mereka pergi ke kebun tanpa ada orang lain yang menyertai mereka. قٰدِرِينَ(dengan penuh kuasa) Yakni kuasa atas kebun itu bagi diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Mereka berjalan di waktu pagi (waktu antara shalat subuh sampai terbitnya matahari) untuk melaksanakan rencana (sebelumnya). Mereka beranggapan bahwa mereka adalah orang yang menguasai buah-buahan yang hitam itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berangkat pagi hari} mereka berangkat pada permulaan siang {dengan niat menghalangi} untuk menghalangi orang-orang miskin {Mereka mengira mampu} mereka meyakini itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Dan berangkatlah mereka di pagi hari,” dalam kondisi keji, kasar, dan tidak berbelas kasih seperti ini, “dengan niat menghalangi (orang-orang miskin) padahal mereka mampu (menolongnya).” Yakni, mereka menahan hak Allah yang pasti mereka mampu lakukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 25: Allah mengabarkan bahwa mereka pagi-pagi sekali di atas niatnya yang jelek ber-azzam, karena sebab sok kuasa mereka ber-azzam dengan sesuatu yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada pula yang mengartikan ‘dengan niat menghalangi orang miskin dan mereka kira bahwa mereka berkuasa penuh terhadapnya.’"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 25",
    "description": "25-27. Dan setelah semuanya siap termasuk segala peralatan yang dibutuhkan, maka berangkatlah mereka pada pagi hari dengan niat menghalangi orang-orang miskin mendapatkan pemberian hasil kebun mereka, padahal mereka mampu menolongnya. Maka betapa terkejutnya ketika mereka melihat kebun itu ternyata telah binasa, mereka pun berkata, 'sungguh, kita ini benar-benar orang-orang yang sesat dengan merencanakan sesuatu yang buruk, akhirnya rusaklah kebun kita, bahkan kita tidak memperoleh apa pun. '25-27"
  }
]