[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-33. Ketika mereka melihat kebun mereka terbakar, mereka merasa tidak percaya, mereka berkata, “Kita salah jalan dalam menuju kepadanya.” Ketika mereka tahu bahwa kebun itu memang benar kebun mereka, mereka berkata, “Kita gagal mendapatkan hasilnya, disebabkan keinginan kita untuk bersikap bakhil dengan menghalang-halangi orang-orang miskin.” Orang yang terbaik dari mereka berkata, “Bukankah aku sudah berkata kepada kalian agar mengucapkan, insya Allah?” mereka berkata sesudah mereka menyadari kesalahan mereka, “Mahasuci Allah dari kezhaliman terkait apa yang menimpa kami, justru kamilah yang menzhalimi diri kami dengan tidak mengucapkan insya Allah dan menyimpan niat buruk. Mereka berkata, “Celakalah kita, kita memang melampaui batas dengan berusaha menghalang-halangi orang-orang fakir dan menyelisihi perintah Allah. Semoga Allah memberi kita sesuatu yang lebih baik daripada kebun kita, karena kami sudah mengakui kesalahan kita dan bertaubat. Sesungguhnya kita hanya berharap kepada Tuhan kita semata, kita mengharapkan maafNya, dan meminta kebaikan dariNya.” Hukuman seperti yang menimpa para pemilik kebun itu merupakan hukuman Kami di dunia bagi siapa yang menyelisihi perintah Allah, bakhil dengan apa yang Allah berikan kepadanya berupa nikmat-nikmat dan tidak menunaikan hak Allah padanya. Dan azab akhirat benar-benar lebih besar dan lebih keras daripada azab dunia; seandainya mereka mengetahui, niscaya mereka meninggalkan apa yang mendatangkan azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Maka tatkala mereka menyaksikannya dalam kondisi sudah terbakar, sebagian mereka berkata kepada yang lain, “Sungguh kita telah tersesat dari jalan menuju kebun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Namun para pemilik kebun itu kaget ketika melihat kebun itu telah hancur buah-buahannya, sehingga mereka mengira telah sampai di kebun orang lain dan salah jalan. Akan tetapi setelah mereka memperhatikan dengan seksama, mereka akhirnya yakin bahwa itu adalah kebun yang mereka miliki. Mereka mengetahui Allah telah memberi hukuman akibat niat buruk mereka, sehingga Allah menghalangi mereka dari buah-buahan dari kebun mereka ketika mereka hendak menghalangi orang-orang miskin dari hak mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَلَمَّا رَأَوْهَا قَالُوٓا۟ إِنَّا لَضَآلُّونَ (Tatkala mereka melihat kebun itu, mereka berkata: “Sesungguhnya kita benar-benar orang-orang yang sesat) Sebagian mereka berkata kepada sebagian lainnya: “kita telah tersesat dari jalan menuju kebun kita, sebab ini bukanlah kebun kita.” Dan ketika mereka memperhatikannya akhirnya mereka menyadari bahwa itu memang kebun mereka; Allah telah menghukum mereka dengan memusnahkan buah-buahan dan tanaman di kebun itu. sehingga mereka berkata: بَلْ نَحْنُ مَحْرُومُونَ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Tatkala mereka melihat taman itu hangus terbakar, mereka berkata: “Sesungguhnya kami adalah orang-orang yang menyimpang. Bukan ini yang kami inginkan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika melihat kebun itu, mereka berkata,“Sesungguhnya kita benar-benar orang sesat} benar-benar orang yang salah jalan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. “Tatkala mereka melihat kebun itu,” dalam kondisi seperti yang disebutkan Allah seperti malam yang gelap, “mereka berkata,” karena bingung dan resah, “Sesungguhnya kita benar-benar orang-orang yang sesat (jalan),” yakni bingung tidak mengetahui kebunnya, seperti kebun yang lain. Ketika mereka telah memastikan kebunnya telah hangus, mereka kembali berpikir seraya berkata, “Bahkan kita dihalangi (dari memperoleh hasilnya),” yakni hasil panen kebun ini. Pada waktu itu mereka baru menyadari bahwa itu adalah hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 26: Maka ketika mereka sampai pada kebun mereka, mereka melihat kebun mereka (dan seakan-akan tidak percaya), mereka berkata : Sungguh kita adalah orang-orang yang tersesat dari jalan yang benar, ini bukanlah kebun kita."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan penuh keheranan. Yakni ‘bukan ini kebunnya,’ selanjutnya mereka berkata seperti yang disebutkan dalam ayat setelahnya ketika mereka mengetahui bahwa yang binasa itu memang kebun mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 26",
    "description": "25-27. Dan setelah semuanya siap termasuk segala peralatan yang dibutuhkan, maka berangkatlah mereka pada pagi hari dengan niat menghalangi orang-orang miskin mendapatkan pemberian hasil kebun mereka, padahal mereka mampu menolongnya. Maka betapa terkejutnya ketika mereka melihat kebun itu ternyata telah binasa, mereka pun berkata, 'sungguh, kita ini benar-benar orang-orang yang sesat dengan merencanakan sesuatu yang buruk, akhirnya rusaklah kebun kita, bahkan kita tidak memperoleh apa pun. '25-27"
  }
]