[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-33. Ketika mereka melihat kebun mereka terbakar, mereka merasa tidak percaya, mereka berkata, “Kita salah jalan dalam menuju kepadanya.” Ketika mereka tahu bahwa kebun itu memang benar kebun mereka, mereka berkata, “Kita gagal mendapatkan hasilnya, disebabkan keinginan kita untuk bersikap bakhil dengan menghalang-halangi orang-orang miskin.” Orang yang terbaik dari mereka berkata, “Bukankah aku sudah berkata kepada kalian agar mengucapkan, insya Allah?” mereka berkata sesudah mereka menyadari kesalahan mereka, “Mahasuci Allah dari kezhaliman terkait apa yang menimpa kami, justru kamilah yang menzhalimi diri kami dengan tidak mengucapkan insya Allah dan menyimpan niat buruk. Mereka berkata, “Celakalah kita, kita memang melampaui batas dengan berusaha menghalang-halangi orang-orang fakir dan menyelisihi perintah Allah. Semoga Allah memberi kita sesuatu yang lebih baik daripada kebun kita, karena kami sudah mengakui kesalahan kita dan bertaubat. Sesungguhnya kita hanya berharap kepada Tuhan kita semata, kita mengharapkan maafNya, dan meminta kebaikan dariNya.” Hukuman seperti yang menimpa para pemilik kebun itu merupakan hukuman Kami di dunia bagi siapa yang menyelisihi perintah Allah, bakhil dengan apa yang Allah berikan kepadanya berupa nikmat-nikmat dan tidak menunaikan hak Allah padanya. Dan azab akhirat benar-benar lebih besar dan lebih keras daripada azab dunia; seandainya mereka mengetahui, niscaya mereka meninggalkan apa yang mendatangkan azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Bukan begitu, tetapi kita telah dihalangi untuk memetik hasil kebun itu karena kita berkeinginan untuk melarang orang-orang miskin untuk ikut menikmatinya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. بَلْ نَحْنُ مَحْرُومُونَ (bahkan kita dihalangi (dari memperoleh hasilnya)”) Yakni Allah menghalangi kita untuk mendapat hasil dari kebun ini akibat tekad kita untuk tidak memberi orang-orang miskin hasil darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kemudian mereka berkata: “Kita bukanlah orang yang menyimpang, akan tetapi kita adalah orang-orang yang dicegah untuk memanen buah, karena kita berencana menghalangi orang-orang miskin untuk mengambil hak mereka”. “Bal” digunakan untuk merujuk kepada kata sebelumnya dan menghubungkannya dengan kata setelahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bahkan kita adalah orang-orang yang mencegahnya.”} yang mencegah kebaikan kebun itu bagi dengan menghalangi orang-orang miskin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. “Tatkala mereka melihat kebun itu,” dalam kondisi seperti yang disebutkan Allah seperti malam yang gelap, “mereka berkata,” karena bingung dan resah, “Sesungguhnya kita benar-benar orang-orang yang sesat (jalan),” yakni bingung tidak mengetahui kebunnya, seperti kebun yang lain. Ketika mereka telah memastikan kebunnya telah hangus, mereka kembali berpikir seraya berkata, “Bahkan kita dihalangi (dari memperoleh hasilnya),” yakni hasil panen kebun ini. Pada waktu itu mereka baru menyadari bahwa itu adalah hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 27: Kemudian ketika mereka melihat dengan yakin, mereka mengetahui bahwa itu adalah kebun mereka, dan sesungguhnya Allah menimpakan hukuman kepada mereka. Mereka berkata : Ini adalah kebun kita, akan tetapi sudah tak tersisa bagi kita, dan tak tersisa buahnya lagi; Karena sebab kita mempunyai niat menahan kebaikan terhadap orang-orang miskin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka mengatakan hal ini setelah mereka yakin bahwa yang dilihat mereka adalah kebun mereka sendiri. Mereka pun menyadari bahwa hal itu adalah hukuman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 27",
    "description": "25-27. Dan setelah semuanya siap termasuk segala peralatan yang dibutuhkan, maka berangkatlah mereka pada pagi hari dengan niat menghalangi orang-orang miskin mendapatkan pemberian hasil kebun mereka, padahal mereka mampu menolongnya. Maka betapa terkejutnya ketika mereka melihat kebun itu ternyata telah binasa, mereka pun berkata, ?Sungguh, kita ini benar-benar orang-orang yang sesat dengan merencanakan sesuatu yang buruk, akhirnya rusaklah kebun kita, bahkan kita tidak memperoleh apa pun.?28-29. Setelah melihat kenyataan tersebut, berkatalah salah seorang yang paling bijak di antara mereka, ?Bukankah aku telah mengatakan kepadamu bahwa rencana kamu itu sungguh buruk, semestinya kamu merencanakan hal yang baik lagi terpuji, tapi mengapa kamu malah tidak bertasbih kepada Tuhanmu dengan mengucapkan 'lnsya Allah'? Rupanya ketika itu para pemilik kebun tersebut sadar, karena itu mereka mengucapkan,?Mahasuci Tuhan kami, sungguh, kami adalah orang-orang yang zalim dengan rencana buruk tersebut, semestinya kami bersyukur dengan berbagi kepada fakir miskin atas hasil kebun kami.?"
  }
]