[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-33. Ketika mereka melihat kebun mereka terbakar, mereka merasa tidak percaya, mereka berkata, “Kita salah jalan dalam menuju kepadanya.” Ketika mereka tahu bahwa kebun itu memang benar kebun mereka, mereka berkata, “Kita gagal mendapatkan hasilnya, disebabkan keinginan kita untuk bersikap bakhil dengan menghalang-halangi orang-orang miskin.” Orang yang terbaik dari mereka berkata, “Bukankah aku sudah berkata kepada kalian agar mengucapkan, insya Allah?” mereka berkata sesudah mereka menyadari kesalahan mereka, “Mahasuci Allah dari kezhaliman terkait apa yang menimpa kami, justru kamilah yang menzhalimi diri kami dengan tidak mengucapkan insya Allah dan menyimpan niat buruk. Mereka berkata, “Celakalah kita, kita memang melampaui batas dengan berusaha menghalang-halangi orang-orang fakir dan menyelisihi perintah Allah. Semoga Allah memberi kita sesuatu yang lebih baik daripada kebun kita, karena kami sudah mengakui kesalahan kita dan bertaubat. Sesungguhnya kita hanya berharap kepada Tuhan kita semata, kita mengharapkan maafNya, dan meminta kebaikan dariNya.” Hukuman seperti yang menimpa para pemilik kebun itu merupakan hukuman Kami di dunia bagi siapa yang menyelisihi perintah Allah, bakhil dengan apa yang Allah berikan kepadanya berupa nikmat-nikmat dan tidak menunaikan hak Allah padanya. Dan azab akhirat benar-benar lebih besar dan lebih keras daripada azab dunia; seandainya mereka mengetahui, niscaya mereka meninggalkan apa yang mendatangkan azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Mereka berkata, “Mahasuci Rabb kami, sesungguhnya kami telah berbuat aniaya kepada diri kami ketika kami bertekad untuk menghalangi orang-orang fakir dari hasil kebun kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. قَالُوا۟ سُبْحٰنَ رَبِّنَآ إِنَّا كُنَّا ظٰلِمِينَ(Mereka mengucapkan: “Maha Suci Tuhan kami, sesungguhnya kami adalah orang-orang yang zalim”) Yakni Maha Suci Allah dari kezaliman dengan menghancurkan kebun kami, sebab itu dikarenakan dosa yang kami lakukan dengan menolak memberi hak orang-orang miskin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Mereka berkata: “Maha suci Tuhan kami. Dia tidak mungkin menzalimi kami. Peristiwa itu akibat dari dosa kita. Sesungguhnya kita adalah orang-orang yang menzalimi diri sendiri dengan melarang orang fakir untuk mengambil haknya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Maha suci Tuhan kami. Sungguh kami adalah orang-orang yang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Maka “mereka mengucapkan, ‘Mahasuci Rabb kami, sesungguhnya kami adalah orang-orang yang zhalim’.” Maksudnya, mereka sadar, hanya saja kesadaran mereka itu baru muncul setelah azab menimpa perkebunan mereka yang tentu saja tidak bisa dihilangkan. Namun, mudah-mudahan tasbih dan pengakuan akan kezhaliman diri mereka berguna bagi mereka agar siksaan mereka diringankan dan menjadi taubat (bagi mereka)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 29: Mereka berkata : Kami mensucikan Rabb kami dan Pencipta kami, sungguh kami telah melampaui batas. Akan tetapi mereka belum terlambat (dari bertaubat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menghalangi hak orang-orang fakir. Mereka ingin menutupi kekurangan mereka, tetapi setelah azab telah menimpa kebun mereka, namun mereka tetap berharap tasbih mereka ini dan pengakuan kezaliman mereka dapat memberikan manfaat bagi mereka untuk meringankan dosa dan sebagai tobat mereka. Oleh karena itulah, mereka menyesal dengan penyesalan yang dalam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 29",
    "description": "28-29. Setelah melihat kenyataan tersebut, berkatalah salah seorang yang paling bijak di antara mereka, ?Bukankah aku telah mengatakan kepadamu bahwa rencana kamu itu sungguh buruk, semestinya kamu merencanakan hal yang baik lagi terpuji, tapi mengapa kamu malah tidak bertasbih kepada Tuhanmu dengan mengucapkan 'lnsya Allah'? Rupanya ketika itu para pemilik kebun tersebut sadar, karena itu mereka mengucapkan,?Mahasuci Tuhan kami, sungguh, kami adalah orang-orang yang zalim dengan rencana buruk tersebut, semestinya kami bersyukur dengan berbagi kepada fakir miskin atas hasil kebun kami.?30-31. Setelah pemilik kebun tersebut sadar, lalu mulailah mereka saling berhadapan dan saling menyalahkan. Ada yang mengatakan, ?Ini gara-gara kamu!? Yang lain lagi menjawab,?Kenapa aku yang disalahkan??. Setelah beberapa saat berlalu pada akhirnya semua mengaku bersalah, kemudian mereka berkata, ?Celaka kita! Sesungguhnya kita orang-orang yang melampaui batas yaitu dengan bersumpah tidak akan memberi hasil panen kepada fakir miskin."
  }
]