[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-33. Ketika mereka melihat kebun mereka terbakar, mereka merasa tidak percaya, mereka berkata, “Kita salah jalan dalam menuju kepadanya.” Ketika mereka tahu bahwa kebun itu memang benar kebun mereka, mereka berkata, “Kita gagal mendapatkan hasilnya, disebabkan keinginan kita untuk bersikap bakhil dengan menghalang-halangi orang-orang miskin.” Orang yang terbaik dari mereka berkata, “Bukankah aku sudah berkata kepada kalian agar mengucapkan, insya Allah?” mereka berkata sesudah mereka menyadari kesalahan mereka, “Mahasuci Allah dari kezhaliman terkait apa yang menimpa kami, justru kamilah yang menzhalimi diri kami dengan tidak mengucapkan insya Allah dan menyimpan niat buruk. Mereka berkata, “Celakalah kita, kita memang melampaui batas dengan berusaha menghalang-halangi orang-orang fakir dan menyelisihi perintah Allah. Semoga Allah memberi kita sesuatu yang lebih baik daripada kebun kita, karena kami sudah mengakui kesalahan kita dan bertaubat. Sesungguhnya kita hanya berharap kepada Tuhan kita semata, kita mengharapkan maafNya, dan meminta kebaikan dariNya.” Hukuman seperti yang menimpa para pemilik kebun itu merupakan hukuman Kami di dunia bagi siapa yang menyelisihi perintah Allah, bakhil dengan apa yang Allah berikan kepadanya berupa nikmat-nikmat dan tidak menunaikan hak Allah padanya. Dan azab akhirat benar-benar lebih besar dan lebih keras daripada azab dunia; seandainya mereka mengetahui, niscaya mereka meninggalkan apa yang mendatangkan azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Seperti siksa ini, yaitu terhalang dari rezeki, Kami menyiksa orang yang bermaksiat kepada Kami. Dan siksa Akhirat sungguh lebih besar kalau saja mereka mengetahui kedahsyatan dan keabadiannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Seperti hukuman yang menimpa para pemilik kebun itulah Allah akan menyiksa setiap orang yang zalim dan kafir serta enggan mentaati perintah Allah; dan siksaan itu merupakan siksaan yang tidak seberapa jika dibandingkan dengan siksaan di akhirat. Seandainya orang-orang yang musyrik dan berpaling dari perintah Allah itu mengetahui hal ini niscaya mereka tidak akan melakukan perbuatan yang dapat menjerumuskan mereka ke dalam siksaan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. كَذٰلِكَ الْعَذَابُ ۖ (Seperti itulah azab (dunia)) Yakni seperti azab yang Kami timpakan kepada mereka itu, Kami akan menimpakan orang-orang kafir dengan azab dunia. وَلَعَذَابُ الْءَاخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ (Dan sesungguhnya azab akhirat lebih besar jika mereka mengetahui) Namun mereka tidak mengetahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Perumpaman azab yang ditimpakan kepada pemilik kebun itu adalah azab dunia. Adapun azab di akhirat itu lebih besar daripada azab dunia. Andai saja mereka mengetahui mengetahui jenis-jenis azab akhirat, sungguh mereka akan menghindari sesuatu yang dapat mengakibatkan mereka disiksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seperti itulah azab} Seperti itulah hukuman Kami. Kami menghukum orang yang melanggar perintah Kami {Sungguh azab akhirat lebih besar sekiranya mereka mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Allah berfirman membesarkan apa yang terjadi, “seperti itulah azab (dunia).” Yakni siksa dunia bagi orang yang melakukan perbuatan-perbuatan yang mengundang azab, Allah akan mencabut nikmat yang menjadikannya angkuh dan lebih mengedepankan kehidupan dunia. Allah akan melenyapkan nikmat tersebut dari pemiliknya pada saat-saat amat diperlukan. “Dan sungguh azab akhirat lebih besar,” dari azab dunia, “jika mereka mengetahui.” Siapa pun yang mengetahui hal itu, maka harus menjauhi berbagai hal yang mengundang azab dan mencegah pahala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 33: Allah mengabarkan permisalan ini yaitu adzab di dunia yang diturunkan-Nya kepada pemilik kebun yang diadzab karena sebab mereka menyimpang dan bermaksiat dengan apa yang Allah perintahkan. Dan mereka tidak menjalankan hak Allah dalam kewajiban mereka untuk taat kepada-Nya. Adzab akhirat lebih besar dan lebih mengerikan dari adzab dunia, akan tetapi orang-orang kafir tidaklah memahami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagi orang yang menyelisihi perintah Allah atau mengerjakan sebab-sebab diazab dengan mencabut kenikmatan yang dijadikannya untuk bersikap melampaui batas serta menyingkirkan sesuatu yang paling dibutuhkannya. Jika mereka mengetahui, tentu mereka akan menghindari segala sebab yang mendatangkan azab dan siksaan. Disebutkan dalam catatan kaki terjemah Al Qur’an Depag sbb.: Allah Subhaanahu wa Ta'aala menerangkan bahwa Dia menguji penduduk Mekah dengan menganugrahi mereka nikmat-nikmat yang banyak untuk mengetahui apakah mereka bersyukur atau tidak sebagaimana Allah telah menguji pemilik-pemilik kebun, seperti yang diterangkan pada ayat 17-33. Akhirnya pemilik kebun itu insaf dan bertobat kepada Allah. Demikian pula penduduk Mekah yang kemudian menjadi insaf dan masuk Islam berbondong-bondong setelah penaklukan Mekah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 33",
    "description": "32-33. Setelah menyadari kekeliruannya, mereka pun berharap, mudah-Mudahan tuhan memberikan ganti kepada kita dengan kebun atau apa saja yang lebih baik daripada kebun yang telah rusak ini, sungguh, kita mengharapkan ampunan dan karunia dari tuhan kita. ' setelah selesai menguraikan kisah para pemilik kebun tersebut, Allah memperingatkan kepada siapa saja dengan menyatakan bahwa seperti itulah azab di dunia. Dan sungguh, azab akhirat lebih besar dibandingkan azab dunia itu, karena azab akhirat, di samping lebih dahsyat juga da-lam waktu yang tidak terbayangkan. Semestinya manusia menyadari hal itu sekiranya mereka mengetahui. 34-35. Bagi yang durhaka maka azab yang pedih akan menjadi balasannya, sedangkan bagi yang bertakwa balasannya seperti yang diuraikan pada ayat ini. Sungguh, bagi orang-orang yang bertakwa disediakan surga yang penuh kenikmatan di sisi tuhannya. Kaum kafir merasa bahwa mereka akan memperoleh yang lebih baik dari yang dijanjikan kepada kaum muslim tersebut, maka ayat ini menyanggah anggapan tersebut. Apakah patut kami memperlakukan orang-orang lslam itu seperti orang-orang yang berdosa yaitu orang-orang kafir' tentu saja tidak mungkin keduanya dipersamakan."
  }
]