[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Apakah patut Kami menjadikan orang-orang yang tunduk dengan ketaatan kepada Allah itu sama dengan orang-orang kafir? Ada apa dengan kalian? Mengapa kalian menetapkan hukum yang zhalim ini dengan menyamakan keduanya dalam pahala?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Maka apakah Kami akan menyamakan orang-orang Islam dengan orang-orang kafir dalam pemberian balasan sebagaimana yang dikira oleh orang-orang musyrik dari penduduk Makkah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Allah mengingkari orang-orang musyrik bahwa Dia tidak akan menyamakan perhitungan dan balasan antara orang yang beriman dan berserah diri kepada-Nya dengan orang yang tidak beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. أَفَنَجْعَلُ الْمُسْلِمِينَ كَالْمُجْرِمِينَ (Maka apakah patut Kami menjadikan orang-orang Islam itu sama dengan orang-orang yang berdosa) Pemuka-pemuka kafir Quraisy berkata: “jika memang yang dikatakan Muhammad itu benar, niscaya keadaan kita dan keadaan orang-orang beriman akan seperti keadaan kita semua di dunia, kita akan mendapatkan kenikmatan surga di akhirat sebagaimana mereka juga mendapatkannya.” Maka Allah mengabarkan bahwa bukanlah suatu keadilan jika antara orang yang taat dengan orang yang durhaka disamaratakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35. Sesungguhnya bagi orang-orang yang bertakwa di sisi Tuhan mereka di akhirat kelak adalah surga-surga yang dapat mereka nikmati selama-lamanya. Apakah (pantas) kami akan menyamakan tempat tinggal dan balasan orang-orang muslim dengan orang-orang kafir?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah patut Kami memperlakukan orang-orang muslim seperti orang-orang yang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-41. Allah mengabarkan apa yang dipersiapkan bagi orang-orang yang bertakwa yang menjaga diri dari kekufuran dan berbagai kemaksiatan, berupa berbagai macam kenikmatan dan kehidupan sentosa di dekat Allah, Dzat Yang Mahamulia. Kebijaksanaan Allah tidak menyamakan antara orang-orang yang bertakwa yang menunaikan hak-hak Rabb mereka, tunduk pada perintah-perintahNya dan yang meniti ridhaNya seperti orang-orang pendosa yang larut dalam kemaksiatan, mengkufuri ayat-ayatNya, membangkang rasul-rasulNya dan memerangi para kekasihNya. Jika ada yang mengira balasan kedua golongan tersebut sama, tentu hukum yang berlaku tidak adil. Hukumnya batil dan pandangannya tidak benar. Jika para pendosa mengira demikian, mereka sama sekali tidak memiliki sandaran. Bukan kitab yang mereka pelajari dan baca yang menyebutkan bahwa mereka adalah penghuni surga, mereka mendapatkan apa saja yang mereka inginkan dan pilih, mereka juga tidak memiliki janji dan sumpah sempurna di sisi Allah pada Hari Kiamat bahwa mereka akan mendapatkan apa pun yang mereka putuskan, mereka juga tidak memiliki sekutu dan teman yang membantu mereka mendapatkan apa yang mereka inginkan. Jika mereka memiliki sekutu dan teman, silahkan mereka datangkan jika mereka adalah orang-orang yang benar. Sebagaimana diketahui, semua hal itu tidak ada. Mereka tidak memiliki kitab dan janji di sisi Allah akan mendapatkan keselamatan, mereka juga tidak memiliki sekutu yang akan menolong mereka. Maka dapat diketahui bahwa klaim mereka batil belaka. Allah berfirman, “Tanyakanlah kepada mereka, ‘Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu’.” Maksudnya, siapa yang bertanggung jawab atas klaim yang jelas-jelas batil ini. Tidak akan ada seorang pun yang mau mengakui dan bertanggung jawab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 35: 35-36. Allah berkata dengan maksud pengingkaran : Apakah Aku menjadikan muslim yang jujur sama dengan kafir yang musyrik ? Atau adakah kamu (berbuat demikian sebagaimana orang-orang muslim), bagaimanakah kamu mengambil keputusan wahai orang-orang musyrik atas perbuatanmu yang menyimpang (bengkok) dan sewenang-wenang ? Dan itulah orang-orang musyrik Mekkah, mereka mengatakan : Jika disana terdapat akhirat dan hari kebangkitan, maka tidaklah serta merta menjadikan Muhammad dan pengikutnya lebih baik keadaannya dibandingkan kami. Dan atas keburukan mereka, kami akan bandingkan (di antara mereka dengan orang yang beriman). Inilah tipuan mereka yang tak jelas dan bujuk rayu mereka kepada kaum muslimin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, apakah sama balasan yang disediakan Allah untuk masing-masing mereka? Tentu tidak sama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 35",
    "description": "34-35. Bagi yang durhaka maka azab yang pedih akan menjadi balasannya, sedangkan bagi yang bertakwa balasannya seperti yang diuraikan pada ayat ini. Sungguh, bagi orang-orang yang bertakwa disediakan surga yang penuh kenikmatan di sisi tuhannya. Kaum kafir merasa bahwa mereka akan memperoleh yang lebih baik dari yang dijanjikan kepada kaum muslim tersebut, maka ayat ini menyanggah anggapan tersebut. Apakah patut kami memperlakukan orang-orang lslam itu seperti orang-orang yang berdosa yaitu orang-orang kafir' tentu saja tidak mungkin keduanya dipersamakan. 36-38: kecaman atas anggapan kaum musyrik itu masih dilanjutkan dalam ayat ini. Mengapa kamu berbuat demikian, mempersamakan antara kaum muslim dengan orang kafir' bagaimana kamu mengambil keputusan yang tidak adil itu' logika apa yang kamu gunakan' kalau kamu tidak memiliki dalil aqli yang dapat diterima akal sehat, atau apakah kamu mempunyai kitab yang diturunkan Allah yang kamu pelajari, sehingga menemukan ketentuan bahwa sesungguhnya kamu dapat memilih apa saja yang ada di dalamnya'."
  }
]