[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-38. Atau apakah kalian memiliki kitab yang turun dari langit di mana di sana kalian membaca bahwa orang yang taat sama dengan orang yang durhaka, lalu kalian mempelajari apa yang kalian katakan itu? Kalau begitu, kalian mendapati apa yang kalian inginkan di dalam kitab tersebut. Sama sekali tidak demikian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Ataukah kalian mempunyai satu kitab yang di dalamnya kalian membaca tentang persamaan antara orang yang taat dan orang yang bermaksiat?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-38. Allah bertanya kepada orang-orang kafir tentang sebab kekafiran mereka: Hai orang-orang kafir, apakah kalian memiliki kitab dari Allah yang diturunkan kepada kalian, di dalamnya terdapat pembolehan segala perbuatan yang kalian sukai tanpa mendapat hisab dan balasan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. أَمْ لَكُمْ كِتٰبٌ فِيهِ تَدْرُسُونَ (Atau adakah kamu mempunyai sebuah kitab (yang diturunkan Allah) yang kamu membacanya?) Yakni yang kalian baca kemudian kalian mendapati di dalamnya bahwa orang yang taat sama dengan orang yang bermaksiat?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36-37. Kalian sungguh gila. Bagaimana bisa kalian menetapkan hukum yang rusak ini? Hukum yang menyamakan antara orang-orang yang taat dengan orang yang berbuat maksiat? Kaifa adalah istifham yang dimaksudkan untuk menunjukkan makna keterkejutan. Ataukah kalian memiliki kitab dari Allah yang kalian baca lalu kalian menemukan penjelasan di dalamnya bahwa orang yang taat itu sama dengan orang yang bermaksiat? “Am” bermakna ataukah bagi kalian?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau, apakah kalian mempunyai kitab yang kalian pelajari} yang kalian baca bahwa orang yang taat itu seperti orang yang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-41. Allah mengabarkan apa yang dipersiapkan bagi orang-orang yang bertakwa yang menjaga diri dari kekufuran dan berbagai kemaksiatan, berupa berbagai macam kenikmatan dan kehidupan sentosa di dekat Allah, Dzat Yang Mahamulia. Kebijaksanaan Allah tidak menyamakan antara orang-orang yang bertakwa yang menunaikan hak-hak Rabb mereka, tunduk pada perintah-perintahNya dan yang meniti ridhaNya seperti orang-orang pendosa yang larut dalam kemaksiatan, mengkufuri ayat-ayatNya, membangkang rasul-rasulNya dan memerangi para kekasihNya. Jika ada yang mengira balasan kedua golongan tersebut sama, tentu hukum yang berlaku tidak adil. Hukumnya batil dan pandangannya tidak benar. Jika para pendosa mengira demikian, mereka sama sekali tidak memiliki sandaran. Bukan kitab yang mereka pelajari dan baca yang menyebutkan bahwa mereka adalah penghuni surga, mereka mendapatkan apa saja yang mereka inginkan dan pilih, mereka juga tidak memiliki janji dan sumpah sempurna di sisi Allah pada Hari Kiamat bahwa mereka akan mendapatkan apa pun yang mereka putuskan, mereka juga tidak memiliki sekutu dan teman yang membantu mereka mendapatkan apa yang mereka inginkan. Jika mereka memiliki sekutu dan teman, silahkan mereka datangkan jika mereka adalah orang-orang yang benar. Sebagaimana diketahui, semua hal itu tidak ada. Mereka tidak memiliki kitab dan janji di sisi Allah akan mendapatkan keselamatan, mereka juga tidak memiliki sekutu yang akan menolong mereka. Maka dapat diketahui bahwa klaim mereka batil belaka. Allah berfirman, “Tanyakanlah kepada mereka, ‘Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu’.” Maksudnya, siapa yang bertanggung jawab atas klaim yang jelas-jelas batil ini. Tidak akan ada seorang pun yang mau mengakui dan bertanggung jawab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 37: Kemudian Allah cela mereka atas kedustaan mereka dan tipu daya mereka, Allah berkata : Apakah kalian orang-orang yang berdosa memiliki kitab yang diturunkan kepada kalian, yang kitab tersebut dibacakan kepada kalian dan kalian mendapati bahwa orang-orang islam sama dengan orang-orang musyrik yang pendosa ?!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 37",
    "description": "36-38: kecaman atas anggapan kaum musyrik itu masih dilanjutkan dalam ayat ini. Mengapa kamu berbuat demikian, mempersamakan antara kaum muslim dengan orang kafir' bagaimana kamu mengambil keputusan yang tidak adil itu' logika apa yang kamu gunakan' kalau kamu tidak memiliki dalil aqli yang dapat diterima akal sehat, atau apakah kamu mempunyai kitab yang diturunkan Allah yang kamu pelajari, sehingga menemukan ketentuan bahwa sesungguhnya kamu dapat memilih apa saja yang ada di dalamnya'36-38: kecaman atas anggapan kaum musyrik itu masih dilanjutkan dalam ayat ini"
  }
]