[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-38. Atau apakah kalian memiliki kitab yang turun dari langit di mana di sana kalian membaca bahwa orang yang taat sama dengan orang yang durhaka, lalu kalian mempelajari apa yang kalian katakan itu? Kalau begitu, kalian mendapati apa yang kalian inginkan di dalam kitab tersebut. Sama sekali tidak demikian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan di dalam kitab itu kalian mendapatkan apa yang kalian pilih untuk kalian di Akhirat?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. إِنَّ لَكُمْ فِيهِ لَمَا تَخَيَّرُونَ (bahwa di dalamnya kamu benar-benar boleh memilih apa yang kamu sukai untukmu) Yakni apakah di dalam kitab itu disebutkan bahwa kalian kelak akan mendapatkan apa yang kalian inginkan di akhirat?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Bahwa dalam kitab tersebut kalian dapat memilih dan menentukan hukum (sesuai kehendak kalian) dan kebaikan dunia-akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya di dalamnya kalian dapat memilih yang kalian sukai} kalian memilih sesuka kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-41. Allah mengabarkan apa yang dipersiapkan bagi orang-orang yang bertakwa yang menjaga diri dari kekufuran dan berbagai kemaksiatan, berupa berbagai macam kenikmatan dan kehidupan sentosa di dekat Allah, Dzat Yang Mahamulia. Kebijaksanaan Allah tidak menyamakan antara orang-orang yang bertakwa yang menunaikan hak-hak Rabb mereka, tunduk pada perintah-perintahNya dan yang meniti ridhaNya seperti orang-orang pendosa yang larut dalam kemaksiatan, mengkufuri ayat-ayatNya, membangkang rasul-rasulNya dan memerangi para kekasihNya. Jika ada yang mengira balasan kedua golongan tersebut sama, tentu hukum yang berlaku tidak adil. Hukumnya batil dan pandangannya tidak benar. Jika para pendosa mengira demikian, mereka sama sekali tidak memiliki sandaran. Bukan kitab yang mereka pelajari dan baca yang menyebutkan bahwa mereka adalah penghuni surga, mereka mendapatkan apa saja yang mereka inginkan dan pilih, mereka juga tidak memiliki janji dan sumpah sempurna di sisi Allah pada Hari Kiamat bahwa mereka akan mendapatkan apa pun yang mereka putuskan, mereka juga tidak memiliki sekutu dan teman yang membantu mereka mendapatkan apa yang mereka inginkan. Jika mereka memiliki sekutu dan teman, silahkan mereka datangkan jika mereka adalah orang-orang yang benar. Sebagaimana diketahui, semua hal itu tidak ada. Mereka tidak memiliki kitab dan janji di sisi Allah akan mendapatkan keselamatan, mereka juga tidak memiliki sekutu yang akan menolong mereka. Maka dapat diketahui bahwa klaim mereka batil belaka. Allah berfirman, “Tanyakanlah kepada mereka, ‘Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu’.” Maksudnya, siapa yang bertanggung jawab atas klaim yang jelas-jelas batil ini. Tidak akan ada seorang pun yang mau mengakui dan bertanggung jawab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 38: Apakah kalian mendapati pada kitab tersebut, bahwa kalian boleh memilih apa yang kalian senangi ?!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 38",
    "description": "36-38: kecaman atas anggapan kaum musyrik itu masih dilanjutkan dalam ayat ini. Mengapa kamu berbuat demikian, mempersamakan antara kaum muslim dengan orang kafir' bagaimana kamu mengambil keputusan yang tidak adil itu' logika apa yang kamu gunakan' kalau kamu tidak memiliki dalil aqli yang dapat diterima akal sehat, atau apakah kamu mempunyai kitab yang diturunkan Allah yang kamu pelajari, sehingga menemukan ketentuan bahwa sesungguhnya kamu dapat memilih apa saja yang ada di dalamnya'39. Dalil aqli tidak ada demikian juga dalil naqli pun juga tidak ada, maka ayat ini membuka kemungkinan lain atas sikap kaum musyrik itu, sekaligus untuk dinafikan, atau apakah kamu memperoleh janji-janji yang diperkuat dengan sumpah dari kami, yang tetap berlaku sampai hari kiamat. Bahwa kamu dapat mengambil keputusan sekehendakmu dan memperoleh apa yang kamu inginkan'."
  }
]