[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39. Atau apakah kalian memiliki perjanjian atas Kami bahwa kalian akan mendapatkan apa yang kalian inginkan dan harapkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Ataukah kalian mempunyai perjanjian dengan Kami yang diperkuat dengan sumpah yang isinya adalah kalian mendapatkan apa yang kalian putuskan untuk diri kalian sendiri?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Apakah kalian telah mendapat sumpah tegas dan perjandian dari Allah yang berlaku hingga hari kiamat, yang menyatakan bahwa kalian dapat menetapkan segala kebaikan yang kalian inginkan; atau kalian hanya berdusta terhadap Allah dalam perkara ini?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. أَمْ لَكُمْ أَيْمٰنٌ عَلَيْنَا بٰلِغَةٌ إِلَىٰ يَوْمِ الْقِيٰمَةِ ۙ إِنَّ لَكُمْ لَمَا تَحْكُمُونَ (Atau apakah kamu memperoleh janji yang diperkuat dengan sumpah dari Kami, yang tetap berlaku sampai hari kiamat; sesungguhnya kamu benar-benar dapat mengambil keputusan (sekehendakmu)?) Yakni apakah kalian memiliki perjanjian dengan Allah yang ditekankan dengan sumpah, sehingga kalian dapat menjadikannya jaminan bahwa Allah akan memasukkan kalian ke dalam surga, yang mana janji itu tetap berlaku hingga hari kiamat sehingga kalian dapat membuat keputusan sekehendak kalian?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Ataukah kalian memiliki janji-janji kuat yang dapat diyakini, seperti masuk surga. Apakah kalian menentukan hukum ini sesuai kehendak kalian?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau, apakah kalian memperoleh sumpah} janji dan ikatan {dari Kami yang berlaku} yang dikuatkan {sampai hari kiamat, bahwa kalian dapat mengambil keputusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-41. Allah mengabarkan apa yang dipersiapkan bagi orang-orang yang bertakwa yang menjaga diri dari kekufuran dan berbagai kemaksiatan, berupa berbagai macam kenikmatan dan kehidupan sentosa di dekat Allah, Dzat Yang Mahamulia. Kebijaksanaan Allah tidak menyamakan antara orang-orang yang bertakwa yang menunaikan hak-hak Rabb mereka, tunduk pada perintah-perintahNya dan yang meniti ridhaNya seperti orang-orang pendosa yang larut dalam kemaksiatan, mengkufuri ayat-ayatNya, membangkang rasul-rasulNya dan memerangi para kekasihNya. Jika ada yang mengira balasan kedua golongan tersebut sama, tentu hukum yang berlaku tidak adil. Hukumnya batil dan pandangannya tidak benar. Jika para pendosa mengira demikian, mereka sama sekali tidak memiliki sandaran. Bukan kitab yang mereka pelajari dan baca yang menyebutkan bahwa mereka adalah penghuni surga, mereka mendapatkan apa saja yang mereka inginkan dan pilih, mereka juga tidak memiliki janji dan sumpah sempurna di sisi Allah pada Hari Kiamat bahwa mereka akan mendapatkan apa pun yang mereka putuskan, mereka juga tidak memiliki sekutu dan teman yang membantu mereka mendapatkan apa yang mereka inginkan. Jika mereka memiliki sekutu dan teman, silahkan mereka datangkan jika mereka adalah orang-orang yang benar. Sebagaimana diketahui, semua hal itu tidak ada. Mereka tidak memiliki kitab dan janji di sisi Allah akan mendapatkan keselamatan, mereka juga tidak memiliki sekutu yang akan menolong mereka. Maka dapat diketahui bahwa klaim mereka batil belaka. Allah berfirman, “Tanyakanlah kepada mereka, ‘Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu’.” Maksudnya, siapa yang bertanggung jawab atas klaim yang jelas-jelas batil ini. Tidak akan ada seorang pun yang mau mengakui dan bertanggung jawab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 39: Atau kalian (diharuskan) mengambil janji dan kalian harus tepati dan imani (yang kami tidak akan ubah sampai hari kiamat), dan bagi kalian apakah dapat memilih atas apa yang kalian inginkan ?!!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 39",
    "description": "Dalil aqli tidak ada demikian juga dalil naqli pun juga tidak ada, maka ayat ini membuka kemungkinan lain atas sikap kaum musyrik itu, sekaligus untuk dinafikan, atau apakah kamu memperoleh janji-janji yang diperkuat dengan sumpah dari kami, yang tetap berlaku sampai hari kiamat. Bahwa kamu dapat mengambil keputusan sekehendakmu dan memperoleh apa yang kamu inginkan'40-41. Apa yang dinyatakan di atas pun jelas tidak ada. Kalau begitu tanyakanlah, wahai nabi Muhammad, kepada mereka, 'siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu''atau apakah mungkin mereka mempunyai sekutu-sekutu' kalau begitu hendaklah mereka mendatangkan sekutu-sekutunya jika mereka orang-orang yang benar dalam ucapan mereka bahwa mereka akan memperoleh sama bahkan lebih dari perolehan kaum muslim."
  }
]