[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Nun, pembicaraan tentang huruf-huruf terpenggal telah hadir di awal Surat al-baqarah. Allah bersumpah dengan pena yang dengannya para malaikat dan manusia menulis, dan dengan apa yang mereka tulis, berupa kebaikan, manfaat dan ilmu-ilmu, kamu (wahai rasul) bukan orang yang lemah akal dan bodoh pendapat karena nikmat Allah berupa kenabian dan kerasulan. Sesungguhnya kamu, atas beban berat yang kamu pikul selama menyampaikan risalah, akan mendapatkan pahala yang besar yang tidak dikurangi dan tidak terputus, dan sesungguhnya kiamu (wahai Rasul) benar-benar memilki akhlak yang agung, yaitu akhlak-akhlak yang dikandung al-Quran. Pelaksanaan terhadap al-Quran merupakan ciri khusus Rasulullah, beliau melaksanakan perintah-perintahnya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan sesungguhnya kamu berada di atas akhlak yang agung yang dibawa oleh Al-Qur`ān, dan engkau berakhlak dengan nilai-nilai Al-Qur`ān secara sempurna."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Ayat ini menegaskan bahwa Nabi Muhammad memiliki sifat-sifat yang paling baik dan paling mulia. Pada diri beliau terkumpul akhlak-akhlak terpuji dan sifat-sifat yang terbaik yang ada pada manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ (Dan sesungguhnya kamu benar-benar berbudi pekerti yang agung) Yakni kamu memiliki akhlak yang Allah perintahkan dalam al-Qur’an. Disebutkan dalam hadits shahih dari Aisyah bahwa ia pernah ditanya tentang akhlak Rasulullah, maka ia menjawab: akhlaknya adalah akhlak al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sesungguhnya kamu wahai Rasulallah benar-benar berakhlak mulia karena engkau dididik oleh Tuhanmu dalam Al-Quran. ‘Aisyah RA ditanya mengenai akhlak beliau (sebagaimana ditetapkan dalam hadits shahih), lalu dia menjawab: “Sesungguhnya Akhlak beliau adalah Al-Quran. Tidakkah kamu membaca Al-Quran ayat {Qad aflahal mu’minuun} [Al-Mu’minun 23/1] sampai sepuluh ayat?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kamu benar-benar berbudi pekerti yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Karena itu Allah berfirman, “Dan sesungguhnya kamu benar-benar berbudi pekerti yang agung.” Maksudnya, agung dan tinggi dengan budi pekerti yang dikaruniakan Allah kepadamu. Secara garis besar tentang akhlaknya nabi yang agung dijelaskan oleh siti Aisyah ummul mukminin ketika ditanya tentang akhlak nabi, ia menjawab “akhlaknya adalah Al-quran”. Ini semakna dengan firman Allah : “Jadilah engkau pemaaf dan suruhlah orang mengerjakan yang ma'ruf, serta berpalinglah dari pada orang-orang yang bodoh” (QS. Al-A’rof 199) Maka disebabkan rahmat dari Allah-lah kamu berlaku lemah lembut terhadap mereka. Sekiranya kamu bersikap keras lagi berhati kasar, tentulah mereka menjauhkan diri dari sekelilingmu. Karena itu maafkanlah mereka, mohonkanlah ampun bagi mereka, dan bermusyawaratlah dengan mereka dalam urusan itu. Kemudian apabila kamu telah membulatkan tekad, maka bertawakkallah kepada Allah. Sesungguhnya Allah menyukai orang-orang yang bertawakkal kepada-Nya. (QS. Ali Imron :159) Sungguh telah datang kepadamu seorang Rasul dari kaummu sendiri, berat terasa olehnya penderitaanmu, sangat menginginkan (keimanan dan keselamatan) bagimu, amat belas kasihan lagi penyayang terhadap orang-orang mukmin. (QS. At-Taubah :128) Dan ayat-ayat lain yang menunjukkan sifat-sifat mulia Rasulullah dan berbagai ayat yang mendorong untuk berakhlak yang baik. Serta Ayat-ayat yang mendorong untuk memiliki akhlak yang baik maka nabi adalah sosok yang paling sempurna dan paling agung dalam hal tersebut, nabi memiliki sifat yang agung dan tinggi dalam semua akhlak baik. Beliau memiliki akhlak yang paling sempurna dan agung. Beliau selalu berada di puncak tertinggi pada masing-masing akhlak baik. Rasulullah adalah sosok lembut, mudah (bergaul) dan dekat dengan orang, mendatangi undangan orang, memenuhi keperluan orang yang meminta sebagai pelipur lara orang yang meminta, beliau selalu memberi dan tidak menolak dalam keadaan gagal (tidak membawa hasil). Apabila sahabat-sahabat beliau menginginkan sesuatu dari Rasulullah, beliau mengiyakan dan mengikuti mereka jika tidak ada halangan. Jika bertekad melakukan sesuatu, beliau tidak pernah memutuskan sendiri, namun berembug dengan para sahabat. Rasulullah adalah sosok yang menerima kebaikan orang, memaafkan kesalahan orang dan selalu memperlakukan teman secara baik dan sempurna. Beliau tidak pernah bermuka musam, tidak pernah berkata kasar, tidak bersikap dingin, tidak pernah terselip lidah, tidak pernah dendam dengan perlakuan dingin orang, namun justru dibalas dengan kebaikan dan beliau sangat penyabar, semoga shalawat dan salam terlimpahkan kepada beliau."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 4: Allah menjelaskan bahwa Nabi memiliki akhlak yang luhur. Ini adalah persaksian dan pujian dari Allah bagi Rasul ﷺ. Telah ditanya Ummul Mukminin Aisyah tentang akhlak Rasul, maka ia berkata : Akhlak Rasul ﷺ adalah Al Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kesimpulan akhlak Beliau adalah seperti yang dikatakan oleh Aisyah radhiyallahu 'anha, “Kaana khuluquhul Qur’aan,” (artinya: Akhlak Beliau adalah Al Qur’an). Beliau melakukan apa yang disebutkan dalam Al Qur’an seperti pada ayat-ayat berikut: “Jadilah engkau pemaaf dan suruhlah orang mengerjakan yang ma'ruf, serta berpalinglah dari orang-orang yang bodoh.” (Terj. Al A’raaf: 199) “Maka disebabkan rahmat dari Allah-lah kamu berlaku lemah lembut terhadap mereka. Sekiranya kamu bersikap keras lagi berhati kasar, tentulah mereka menjauhkan diri dari sekelilingmu. Karena itu maafkanlah mereka, mohonkanlah ampun bagi mereka, dan bermusyawaratlah dengan mereka dalam urusan itu. Kemudian apabila kamu telah membulatkan tekad, maka bertawakkallah kepada Allah. Sesungguhnya Allah menyukai orang-orang yang bertawakkal kepada-Nya.” (Terj. Ali Imran: 159) “Sungguh telah datang kepadamu seorang Rasul dari kaummu sendiri, berat terasa olehnya penderitaanmu, sangat menginginkan (keimanan dan keselamatan) bagimu, amat belas kasihan lagi penyayang terhadap orang-orang mukmin.” (Terj. At Taubah: 128) dan ayat-ayat lainnya yang menyebutkan sifat-sifat Beliau yang mulia serta ayat-ayat lainnya yang mendorong untuk berakhlak mulia. Oleh karena itu, Beliau memiliki akhlak yang paling sempurna dan paling agung, dimana tidak ada satu pun akhlak mulia kecuali Beliau shallallahu 'alaihi wa sallam menduduki peringkat tertinggi. Oleh karena itu, Beliau shallallahu 'alaihi wa sallam orangnya mudah, dekat dengan manusia, memenuhi undangan orang yang mengundangnya, memenuhi kebutuhan orang yang butuh, memberi orang yang meminta-minta dan tidak mengecewakannya. Apabila para sahabatnya menginginkan suatu perkara dari Beliau, maka Beliau menyetujui mereka serta mengikuti mereka jika tidak ada larangannya, dan jika ingin melakukan suatu langkah, maka Beliau mengajak para sahabatnya bermusyawarah terhadapnya. Beliau menerima orang yang berbuat ihsan dan memaafkan orang yang bersalah dan tidaklah ada orang yang duduk dengan Beliau kecuali Beliau bersikap dengan sikap yang sebaik-baiknya untuk Beliau. Oleh karena itu, Beliau tidak bermuka masam, tidak keras ucapannya, tidak menyembunyikan kegembiraannya, menjaga lisannya dari ucapan yang tidak berguna, tidak membalas orang yang bertindak kasar terhadap diri Beliau, Beliau tidak marah jika diri Beliau disakiti, tetapi marah jika syariat Allah Subhaanahu wa Ta'aala dilanggar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 4",
    "description": "1-4. Akhir surah sebelumnya, berbicara tentang dua kelompok yang saling bertolak belakang. Satu dibinasakan dan satu diselamatkan. Di awal surah ini dijelaskan sifat siapa yang akan mendapat keselamatan dan siapa yang akan mendapat azab. N'n. Demi pena yang biasa digunakan untuk menulis oleh malaikat atau oleh siapa pun, dan juga demi apa yang mereka tuliskan. Dengan karunia tuhanmu yang berupa risalah dan nubuwah, engkau, wahai nabi Muhammad sekali-kali bukanlah orang gila sebagaimana yang dituduhkan oleh kaum musyrik. Dan sesungguhnya berkat perjuangan dan kesabaranmu engkau pasti mendapat pahala yang besar yang tidak putus-putusnya. Dan sesungguhnya engkau benar-benar berbudi pekerti yang luhur. Karena tuhanmu yang mendidikmu dengan akhlak Al-Qur'an. 5-6. Maka kelak engkau wahai nabi Muhammad akan melihat dan me-ngetahui, dan mereka yaitu orang-orang kafir itu pun akan melihat dan mengetahui ketika telah jelas kebenaran pada hari kiamat, siapa di antara kamu yang gila engkau atau mereka'."
  }
]