[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40-41. Tanyakanlah (wahai Rasul) kepada orang-orang musyrik, siapakah di antara mereka yang berani menjamin dan bertanggung jawab bahwa dia memang demikian dengan hukum tersebut? Atau apakah mereka memiliki tuhan-tuhan lain yang menjamin apa yang mereka ucapkan dan membantu mereka mendapatkan apa yang mereka cari? Kalau begitu silakan mereka mendatangkannya bila mereka jujur dalam klaim mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Tanyakan -wahai Rasul- kepada orang-orang yang mengatakan hal itu, siapakah di antara mereka yang menjadi penjamin?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40-41. Hai Nabi yang mulia, tanyakanlah kepada mereka, apakah ada orang yang menjamin kebaikan dan balasan yang baik di sisi Allah bagi mereka; atau mereka mengetahui orang yang setuju dengan mereka dalam hal ini dan siap melindungi mereka dari azab Allah? Hendaklah mereka memanggil orang-orang itu untuk menolong mereka dan memberi mereka syafaat, jika orang-orang itu benar-benar ada."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. سَلْهُمْ أَيُّهُم بِذٰلِكَ زَعِيمٌ (Tanyakanlah kepada mereka: “Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu?”) Yakni hai Muhammad, tanyalah orang-orang kafir sebagai olokan bagi mereka: siapakah diantara mereka yang dapat menjamin hal itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Tanyakanlah kepada mereka wahai Rasulallah sebagai bentuk teguran dan celaan. Apakah mereka dapat memberikan jaminan dengan hukum tersebut, yaitu dengan memberikan pahala akhirat bagi orang-orang muslim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tanyakanlah kepada mereka siapakah di antara mereka yang bertanggung jawab terhadap hal itu} yang menanggung dan menjamin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-41. Allah mengabarkan apa yang dipersiapkan bagi orang-orang yang bertakwa yang menjaga diri dari kekufuran dan berbagai kemaksiatan, berupa berbagai macam kenikmatan dan kehidupan sentosa di dekat Allah, Dzat Yang Mahamulia. Kebijaksanaan Allah tidak menyamakan antara orang-orang yang bertakwa yang menunaikan hak-hak Rabb mereka, tunduk pada perintah-perintahNya dan yang meniti ridhaNya seperti orang-orang pendosa yang larut dalam kemaksiatan, mengkufuri ayat-ayatNya, membangkang rasul-rasulNya dan memerangi para kekasihNya. Jika ada yang mengira balasan kedua golongan tersebut sama, tentu hukum yang berlaku tidak adil. Hukumnya batil dan pandangannya tidak benar. Jika para pendosa mengira demikian, mereka sama sekali tidak memiliki sandaran. Bukan kitab yang mereka pelajari dan baca yang menyebutkan bahwa mereka adalah penghuni surga, mereka mendapatkan apa saja yang mereka inginkan dan pilih, mereka juga tidak memiliki janji dan sumpah sempurna di sisi Allah pada Hari Kiamat bahwa mereka akan mendapatkan apa pun yang mereka putuskan, mereka juga tidak memiliki sekutu dan teman yang membantu mereka mendapatkan apa yang mereka inginkan. Jika mereka memiliki sekutu dan teman, silahkan mereka datangkan jika mereka adalah orang-orang yang benar. Sebagaimana diketahui, semua hal itu tidak ada. Mereka tidak memiliki kitab dan janji di sisi Allah akan mendapatkan keselamatan, mereka juga tidak memiliki sekutu yang akan menolong mereka. Maka dapat diketahui bahwa klaim mereka batil belaka. Allah berfirman, “Tanyakanlah kepada mereka, ‘Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu’.” Maksudnya, siapa yang bertanggung jawab atas klaim yang jelas-jelas batil ini. Tidak akan ada seorang pun yang mau mengakui dan bertanggung jawab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 40: Maka tanayakan wahai Nabi Allah kepada mereka orang-orang musyrik : Siapakah yang bertanggung jawab dan tetap dengan tanggung jawabnya atas keputusannya ini saat dikumpulkannya pada hari kiamat ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu bahwa mereka di akhirat diberikan yang lebih baik daripada kaum mukmin. Jelas, bahwa mereka tidak memiliki orang yang siap bertanggung jawab terhadap keputusan ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 40",
    "description": "40-41. Apa yang dinyatakan di atas pun jelas tidak ada. Kalau begitu tanyakanlah, wahai nabi Muhammad, kepada mereka, 'siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu''atau apakah mungkin mereka mempunyai sekutu-sekutu' kalau begitu hendaklah mereka mendatangkan sekutu-sekutunya jika mereka orang-orang yang benar dalam ucapan mereka bahwa mereka akan memperoleh sama bahkan lebih dari perolehan kaum muslim"
  }
]