[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42. Pada Hari Kiamat, urusan menjadi sulit dan huru-haranya mengerikan, Allah datang untuk menetapkan keputusan di antara makhluk, lalu Allah membuka betisNya yang mulia yang tidak serupa dengan sesuatu apa pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Pada hari Kiamat ketika muncul huru-haranya, lalu Allah -Ta'ālā- menyingkap betis-Nya dan manusia diseru untuk bersujud, lalu orang-orang yang beriman pun sujud, dan tinggallah orang-orang kafir dan orang-orang munafik tidak mampu bersujud."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42-43. Ayat ini mengabarkan kejadian-kejadian mengerikan dan menakutkan yang ada pada hari kiamat. Orang-orang musyrik akan diperintah untuk bersujud, akan tetapi mereka tidak dapat melakukannya; kehinaan akan menyelimuti diri mereka. Hal ini karena di dunia ketika mereka diperintah untuk bersujud dan taat, dan mereka mampu melakukannya, akan tetapi mereka enggan melakukannya. Oleh sebab itu mereka terhalang dari kemampuan bersujud pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. يَوْمَ يُكْشَفُ عَن سَاقٍ (Pada hari betis disingkapkan) Allah menyingkap betis-Nya sebagai isyarat tentang kesungguhan dan kengerian keadaan pada hari itu. Imam Bukhari dan lainnya meriwayatkan dari Abu Sa’id, ia berkata: aku pernah mendengar Rasulullah bersabda: “Allah menyingkap betis-Nya, lalu setiap laki-laki dan perempuan yang beriman bersujud kepada-Nya, menyisakan orang-orang yang besujud ketika di dunia dengan niat untuk riya’ dan sum’ah, maka mereka berusaha sujud, namun punggung mereka menjadi kaku.” وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ (dan mereka dipanggil untuk bersujud; maka mereka tidak kuasa) Seluruh makhluk bersujud kepada Allah dengan serempak, menyisakan orang-orang kafir dan munafik yang ingin ikut bersujud namun mereka tidak bisa, sebab tulang punggung mereka mengeras sehingga tidak dapat ditundukkan untuk bersujud, hal ini karena mereka tidak beriman kepada Allah di dunia dan tidak pula mau bersujud."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Hari yang sangat mengerikan adalah hari kiamat. Betis yang tersingkap merupakan penggambaran betapa mengerikannya hari itu. Mereka diperintahkan untuk bersujud sebagai bentuk teguran karena mereka meninggalkan sujud (shalat) ketika berada di dunia. Namun mereka tidak bisa melakukannya karena waktunya telah habis dan mereka sudah tidak mampu lagi melakukannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika betis disingkapkan} pada hari kiamat Tuhan Kami menyingkapkan betisNya {dan mereka diseru untuk bersujud, dan mereka tidak mampu} manusia diseru untuk bersujud, lalu orang-orang mukmin bersujud, sedangkan orang-orang munafik dan orang-orang kafir enggan melakukan sujud sehingga mereka tidak bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42-43. Maksudnya, ketika Hari Kiamat terjadi dan nampaklah kerisauan, goncangan serta huru hara yang belum pernah terbayangkan, lalu Allah datang untuk memberikan keputusan dan balasan amal perbuatan hamba-hambaNya. Allah menampakkan betisNya Yang Mulia yang tidak serupa dengan apa pun, para manusia melihat keluhuran dan keagungan Allah yang tidak bisa diungkapkan dengan kata-kata. Ketika itulah “mereka dipanggil untuk bersujud” yakni, bersujud kepada Allah. Maka orang-orang Mukmin yang ketika di dunia bersujud pada Allah, bersujud dengan taat dan suka rela. Orang-orang keji dan orang-orang munafik juga ingin bersujud, namun tidak mampu merendahkan diri. Inilah balasan yang sesuai dengan amal perbuatan, karena ketika di dunia mereka diseru untuk bersujud kepada Allah, mengesakan dan menyembahNya padahal mereka tidak memiliki penghalang dan penyakit apa pun, namun mereka bersikap sombong dan enggan. Maka pada hari ini, jangan engkau menanyakan kondisi dan akibat buruk mereka. Allah memurkai mereka sehingga berlakulah siksaan atas mereka. Semua sebab-sebab telah terputus. Penyesalan tidak berguna lagi bagi mereka pada HariKiamat. Hal ini amat menakutkan hati untuk melakukan kemaksiatan dan mengharuskan bertaubat selama masih dimungkinkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 42: Dan kabarkanlah wahai Nabi Allah kepada mereka orang-orang musyrik akan kedatangan Allah pada hari kiamat untuk memisahkan antara hambanya dan balasan atas amalan mereka. Allah akan menyingkap betis-Nya yang mulia, dan yang tak diserupakan dengan apapun, kemudian Allah menyeru makhluk agar sujud kepada-Nya. Maka sujudlah orang-orang muslim dimana mereka sujud karena ketaatan dan atas dasar pilihan mereka sendiri di dunia. Adapun orang-orang kafir dan munafik, mereka mencoba sujud maka tidak dapat mereka untuk sujud, karena punggung-punggung mereka menjadi kaku, oleh sebab mereka di dunia menghalangi dirinya dari sujud kepada Allah. Rasulullah ﷺ berkata : Allah menyingkap betis-Nya, kemudian sujudlah semua orang-orang yang beriman, maka tersisalah siapa yang di dunia sujud atas dasar riya dan sum’ah, maka tertahanlah mereka untuk sujud, seraya punggung nya satu sama lain sama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada hari Kiamat Allah Subhaanahu wa Ta'aala datang untuk memberikan keputusan di antara hamba-hamba-Nya dan memberikan balasan, lalu Dia menyingkapkan betis-Nya yang mulia yang tidak mirip dengan sesuatu apa pun, ketika itu itu manusia menyaksikan keagungan Allah dan kebesaran-Nya yang tidak mungkin diungkapkan. Ketika itu, mereka dipanggil untuk sujud kepada Allah, maka sujudlah orang-orang mukmin yang biasa bersujud kepada Allah dengan suka rela, sedangkan orang-orang fasik dan orang-orang munafik pergi agar dapat sujud, namun mereka tidak sanggup untuk sujud dan punggung mereka tetap rata. Balasan seperti ini sesuai dengan amal mereka ketika di dunia, karena ketika mereka dipanggil di dunia untuk sujud kepada Allah, mengesakan-Nya dan beribadah kepada-Nya dalam keadaan sehat, namun mereka enggan dan sombong melakukannya, maka anda tidak perlu bertanya tentang keadaan mereka dan buruknya tempat kembali mereka, kaena Allah telah murka kepada mereka dan mereka telah tetap mendapatkan ketetapan azab dan terputuslah segala hubungan serta tidak bermanfaat pernyesalan mereka, dan tidak pula uzur mereka pada hari Kiamat. Dalam ayat ini terdapat sesuatu yang membuat hati takut mengerjakan maksiat dan berusaha mengejar yang telah luput selagi masih ada waktu. Disebutkan dalam Shahih Bukhari, bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: فَيَكْشِف عَنْ سَاقِهِ ، فَيَسْجُد لَهُ كُلّ مُؤْمِن وَيَبْقَى مَنْ كَانَ يَسْجُد رِيَاءً وَسُمْعَةً فَيَذْهَب كَيْمَا يَسْجُد فَيَصِير ظَهْرُهُ طَبَقًا وَاحِدًا “Maka Dia (Allah) menyingkapkan betis-Nya, lalu setiap mukmin bersujud kepada-Nya dan tinggallah orang yang sujud karena riya’ dan sum’ah; ia pun pergi untuk sujud, maka punggungnya menjadi rata lagi.” Mereka diminta sujud itu adalah untuk menguji keimanan mereka Padahal mereka tidak sanggup lagi karena persendian tulang-tulang mereka telah lemah dan azab sudah meliputi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 42",
    "description": "Setelah tidak ditemukan lagi alasan atas anggapan mereka, ini berarti sikap mereka itu semata-mata sebagai bentuk pembangkangan terhadap Allah dan rasul-Nya. Lngatlah pada hari ketika betis disingkapkan, yaitu menggambarkan keadaan orang yang sedang ketakutan yang hendak lari karena hebatnya huru-hara hari kiamat dan mereka diseru untuk bersujud. Maka mereka tidak mampu. 43. Dan pandangan mereka tertunduk ke bawah pertanda penyesalan dan rasa takut yang menyelimuti hati mereka, dan mereka juga diliputi kehinaan. Dan, sungguh, dahulu di dunia mereka telah diseru untuk bersujud pada waktu mereka sehat tetapi mereka tidak melakukan."
  }
]