[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43. Pandangan mereka tertunduk, mereka tidak bisa mengangkatnya, mereka diliputi kehinaan berat karena azab Allah. Dahulu di dunia mereka diajak untuk shalat dan beribadah kepada Allah saat mereka sehat dan mampu, tetapi mereka tidak mau untuk sujud, karena kesombongan dan keangkuhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Pandangan mereka dalam keadaan terhina, diliputi oleh kehinaan dan penyesalan. Dulu ketika di dunia mereka pernah diminta untuk bersujud kepada Allah saat mereka bebas dari apa yang menimpa mereka pada hari ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. تَرْهَقُهُمْ ذِلَّةٌ ۖ (lagi mereka diliputi kehinaan) Yakni mereka diliputi kehinaan dan penyesalan yang berat. وَقَدْ كَانُوا۟ يُدْعَوْنَ إِلَى السُّجُودِ(Dan sesungguhnya mereka dahulu diseru untuk bersujud) Yakni di dunia. وَهُمْ سٰلِمُونَ(dan mereka dalam keadaan sejahtera) Yakni dalam keadaan sehat dan mampu melakukannya. Ibrahim at-Taimy berpendapat: yakni mereka diseru dengan seruan azan dan iqamah, namun mereka enggan untuk hadir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Pandangan mereka menunduk karena takut. Mereka tidak mengangkat pandangan. Kehinaan dan penyesalan yang sangat besar meliputi mereka. Sungguh mereka telah diseru di dunia untuk melaksanakan sujud (shalat) dan mereka masih sehat dan mampu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pandangan mereka tertunduk} tunduk dan rendah {dan diliputi} diselimuti {kehinaan. Sungguh dahulu mereka telah diseru untuk bersujud ketika mereka sehat} sehat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42-43. Maksudnya, ketika Hari Kiamat terjadi dan nampaklah kerisauan, goncangan serta huru hara yang belum pernah terbayangkan, lalu Allah datang untuk memberikan keputusan dan balasan amal perbuatan hamba-hambaNya. Allah menampakkan betisNya Yang Mulia yang tidak serupa dengan apa pun, para manusia melihat keluhuran dan keagungan Allah yang tidak bisa diungkapkan dengan kata-kata. Ketika itulah “mereka dipanggil untuk bersujud” yakni, bersujud kepada Allah. Maka orang-orang Mukmin yang ketika di dunia bersujud pada Allah, bersujud dengan taat dan suka rela. Orang-orang keji dan orang-orang munafik juga ingin bersujud, namun tidak mampu merendahkan diri. Inilah balasan yang sesuai dengan amal perbuatan, karena ketika di dunia mereka diseru untuk bersujud kepada Allah, mengesakan dan menyembahNya padahal mereka tidak memiliki penghalang dan penyakit apa pun, namun mereka bersikap sombong dan enggan. Maka pada hari ini, jangan engkau menanyakan kondisi dan akibat buruk mereka. Allah memurkai mereka sehingga berlakulah siksaan atas mereka. Semua sebab-sebab telah terputus. Penyesalan tidak berguna lagi bagi mereka pada HariKiamat. Hal ini amat menakutkan hati untuk melakukan kemaksiatan dan mengharuskan bertaubat selama masih dimungkinkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 43: Allah mengabarkan tentang mereka orang-orang musyrik yang dengan pandangan-pandangan mereka di hari kiamat membuat mereka ketakutan dengan ketakutan yang sangat dan (akan) kengerian (hari kiamat). Wajah mereka menunduk kebawah dengan penuh kehinaan. Mereka dahulu diseur untuk sujud di dunia agar mereka diampuni dan dimaafkan; Akan tetapi mereka justru menyombongkan diri dan mengolok-olok; Maka mereka di hukum dengan ketidakmampuan mereka untuk bisa sujud di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dipanggil shalat dengan ucapan, “Hayya ‘alash shalaah” (artinya: Marilah kita shalat)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 43",
    "description": "Dan pandangan mereka tertunduk ke bawah pertanda penyesalan dan rasa takut yang menyelimuti hati mereka, dan mereka juga diliputi kehinaan. Dan, sungguh, dahulu di dunia mereka telah diseru untuk bersujud pada waktu mereka sehat tetapi mereka tidak melakukan. 44-45. Setelah menjelaskan sanksi yang akan diterima para pembangkang, kini Allah menasihati nabi Muhammad, maka serahkanlah kepada-ku wahai nabi urusannya dan orang-orang yang mendustakan ai-qur'an ini. Kelak akan kami hukum mereka berangsur-angsur menuju kebinasaan dari arah yang tidak mereka ketahui, dan aku sendiri yang memutuskan untuk memberi tenggang waktu kepada mereka, dan aku pula yang menetapkan jatuhnya siksa atas mereka. Sungguh, rencana-ku sangat teguh."
  }
]