[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "44-45. Biarkanlah Aku (wahai Rasul) dengan orang-orang yang mendustakan al-Quran ini, sesungguhnya Aku yang akan membalas dan menghukum mereka, Kami akan memberi mereka harta, anak-anak dan kenikmatan-kenikmatan sebagai tipu daya sehingga mereka tidak menyadari bahwa semua itu adalah sebab kebinasaan mereka. Aku menangguhkan mereka dan memanjangkan umur mereka agar mereka semakin bertambah dosa. Sesungguhnya balasanKu atas orang-orang kafir adalah kuat dan keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Maka biarkanlah Aku -wahai Rasul- bersama orang yang mendustakan Al-Qur`ān yang diturunkan kepadamu. Kami akan menggiring mereka menuju siksa sedikit demi sedikit tanpa mereka sadari bahwa itu adalah tipu daya terhadap mereka dan tahapan-tahapan menuju siksa bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44-45. Ini merupakan ancaman bagi orang-orang yang mendustakan al-Qur’an; Allah menjelaskan bahwa Dia Maha Kuasa untuk membinasakan mereka kapanpun yang Dia kehendaki, akan tetapi Allah menetapkan untuk membiarkan mereka dan mengakhirkan azab mereka hingga hari kiamat; namun mereka tidak merasakan hal itu dan mengira penundaan itu adalah penghormatan dan pemuliaan bagi mereka di atas orang-orang beriman. Dan karena mereka selalu membuat makar dan tipu daya, sehingga Allah memperlakukan mereka seperti yang biasa mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. فَذَرْنِى وَمَن يُكَذِّبُ بِهٰذَا الْحَدِيثِ (Maka serahkanlah (ya Muhammad) kepada-Ku (urusan) orang-orang yang mendustakan perkataan ini) Yakni biarkanlah Aku yang mengurusinya dan serahkanlah urusannya kepada-Ku, maka janganlah kamu sibukkan hatimu untuk memikirkannya sebab cukup Aku yang menangani urusannya. Yang dimaksud dengan (الحديث) adalah al-Qur’an. سَنَسْتَدْرِجُهُم مِّنْ حَيْثُ لَا يَعْلَمُونَ (Nanti Kami akan menarik mereka dengan berangsur-angsur (ke arah kebinasaan) dari arah yang tidak mereka ketahui) Yakni Kami akan menggiringnya kepada azab sedikit demu sedikit sampai mereka benar-benar masuk ke dalamnya sedangkan mereka tidak menyadari hal itu, sebab mereka mengira sedang dalam kenikmatan dan tidak memikirkan kesudahannya kelak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Serahkan dan tinggalkanlah kepadaku wahai Nabi urusan tentang hukuman bagi mereka yang mendustakan Al-Qur’an. Kami akan memberi mereka azab secara bertahap. Sedangkan mereka dalam keadaan lupa. Mereka tidak mengetahui bahwa hal itu adalah godaan, karena sesungguhnya mereka menganggap bahwa itu adalah nikmat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Biarkan Aku} biarkan aku {bersama orang-orang yang mendustakan perkataan ini} Al-Qur’an {Kami akan membiarkan mereka berangsur-angsur} Kami akan mendekatkan mereka dengan azab tingkatan demi tingkatan {dari arah yang tidak mereka ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-45. Maksudnya, serahkanlah kepadaKu urusan orang-orang yang mendustakan al-Quran yang agung, Aku-lah yang akan membalas mereka dan jangan kau minta siksaan mereka disegerakan, Kami akan menarik mereka secara berangsur-angsur (menuju kebinasaan), “dari arah yang tidak mereka ketahui.” Kami memberi keleluasaan mereka dengan harta dan anak. Kami memberi mereka keleluasaan dalam rizki dan pekerjaan, agar mereka terpedaya dan tetap berada di atas apa yang memudaratkan mereka. Ini adalah balasan tipu daya Allah atas mereka dan balasan tipu daya Allah pada musuh-musuhNya amat kokoh dan kuat. Dampak berbahaya dan siksaan mereka akan benar-benar sampai pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 44: 44-45. Kemudian Allah meminta Nabi-Nya ﷺ untuk meninggalkan mereka yang mendustakan dan agar jangan tersibukkan dengan mereka dan agar jangan bersedih. Allah mengabarkan bahwa Dial ah yang bertanggung jawab membalas mereka, atas apa yang mereka pantas menerimanya setelah mereka diberikan Allah harta, anak, sebagai istidraj bagi mereka di dunia dimana mereka tak paham bahwa semua itu adalah istidraj yang menyebabkan mereka binasa. Kemudian Allah mengabarkan bahwa mereka akan diberikan waktu sampai semakin bertambah dosa mereka, dan semakin membuat mereka melampaui batas. Kemudian Allah ambil mereka (matikan) dengan keras. Allah menjelaskan bahwa waktu penangguhan bagi mereka sebagai bentuk tipuan bagi mereka, dan sebagai kesempatan bagi siapa yang bertaubat dan menyesali (amalannya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni balasan terhadap mereka adalah urusan-Ku dan kamu tidak perlu meminta disegerakan. Yakni Kami akan menambahkan harta dan anak mereka, dan Kami tambahkan rezeki mereka agar mereka tertipu dan tetap terus di atas hal yang membahayakan mereka, karena ini termasuk tipu daya Allah kepada mereka, dan tipu daya Allah terhadap musuh-musuh-Nya begitu kuat dan kokoh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 44",
    "description": "44-45. Setelah menjelaskan sanksi yang akan diterima para pembangkang, kini Allah menasihati nabi Muhammad, maka serahkanlah kepada-ku wahai nabi urusannya dan orang-orang yang mendustakan ai-qur'an ini. Kelak akan kami hukum mereka berangsur-angsur menuju kebinasaan dari arah yang tidak mereka ketahui, dan aku sendiri yang memutuskan untuk memberi tenggang waktu kepada mereka, dan aku pula yang menetapkan jatuhnya siksa atas mereka. Sungguh, rencana-ku sangat teguh"
  }
]