[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "44-45. Biarkanlah Aku (wahai Rasul) dengan orang-orang yang mendustakan al-Quran ini, sesungguhnya Aku yang akan membalas dan menghukum mereka, Kami akan memberi mereka harta, anak-anak dan kenikmatan-kenikmatan sebagai tipu daya sehingga mereka tidak menyadari bahwa semua itu adalah sebab kebinasaan mereka. Aku menangguhkan mereka dan memanjangkan umur mereka agar mereka semakin bertambah dosa. Sesungguhnya balasanKu atas orang-orang kafir adalah kuat dan keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan Aku menangguhkan mereka beberapa saat agar mereka tenggelam dalam dosa mereka. Sesungguhnya rencanaku terhadap orang-orang kafir dan pendusta sangatlah kuat, mereka tidak bisa lepas dari-Ku dan tidak akan selamat dari siksa-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَأُمْلِى لَهُمْ ۚ (dan Aku memberi tangguh kepada mereka) Yakni menangguhkan mereka agar dosa mereka semakin banyak. إِنَّ كَيْدِى مَتِينٌ(Sesungguhnya rencana-Ku amat tangguh) Yakni rencana-Ku untuk menimpakan mereka ke dalam azab sangat kuat sehingga mereka tidak akan mampu lolos darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Aku menangguhkan, memanjangkan kesempatan hidup mereka dan tidak cepat-cepat menghukum mereka. Sesungguhnya tindakanKu dan azabKu itu sangat berat dan tidak dapat dihentikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku memberi tenggang waktu kepada mereka} Aku menangguhkan mereka agar bertambah dosanya {Sesungguhnya rencanaKu} rencanaKu terhadap orang kafir {sangat teguh} sangat kuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-45. Maksudnya, serahkanlah kepadaKu urusan orang-orang yang mendustakan al-Quran yang agung, Aku-lah yang akan membalas mereka dan jangan kau minta siksaan mereka disegerakan, Kami akan menarik mereka secara berangsur-angsur (menuju kebinasaan), “dari arah yang tidak mereka ketahui.” Kami memberi keleluasaan mereka dengan harta dan anak. Kami memberi mereka keleluasaan dalam rizki dan pekerjaan, agar mereka terpedaya dan tetap berada di atas apa yang memudaratkan mereka. Ini adalah balasan tipu daya Allah atas mereka dan balasan tipu daya Allah pada musuh-musuhNya amat kokoh dan kuat. Dampak berbahaya dan siksaan mereka akan benar-benar sampai pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 45: 44-45. Kemudian Allah meminta Nabi-Nya ﷺ untuk meninggalkan mereka yang mendustakan dan agar jangan tersibukkan dengan mereka dan agar jangan bersedih. Allah mengabarkan bahwa Dial ah yang bertanggung jawab membalas mereka, atas apa yang mereka pantas menerimanya setelah mereka diberikan Allah harta, anak, sebagai istidraj bagi mereka di dunia dimana mereka tak paham bahwa semua itu adalah istidraj yang menyebabkan mereka binasa. Kemudian Allah mengabarkan bahwa mereka akan diberikan waktu sampai semakin bertambah dosa mereka, dan semakin membuat mereka melampaui batas. Kemudian Allah ambil mereka (matikan) dengan keras. Allah menjelaskan bahwa waktu penangguhan bagi mereka sebagai bentuk tipuan bagi mereka, dan sebagai kesempatan bagi siapa yang bertaubat dan menyesali (amalannya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 45",
    "description": "44-45. Setelah menjelaskan sanksi yang akan diterima para pembangkang, kini Allah menasihati nabi Muhammad, maka serahkanlah kepada-ku wahai nabi urusannya dan orang-orang yang mendustakan ai-qur'an ini. Kelak akan kami hukum mereka berangsur-angsur menuju kebinasaan dari arah yang tidak mereka ketahui, dan aku sendiri yang memutuskan untuk memberi tenggang waktu kepada mereka, dan aku pula yang menetapkan jatuhnya siksa atas mereka. Sungguh, rencana-ku sangat teguh. 46-47. Apakah ada yang meragukan dengan ajaran Al-Qur'an ataukah engkau, wahai nabi Muhammad, meminta imbalan kepada mereka, sehingga mereka dibebani dengan hutang' ataukah mungkin mereka secara khusus mengetahui yang gaib, lalu mereka menuliskannya' hal ini pun jelas tidak ada."
  }
]