[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-47. Atau apakah kamu (wahai Rasul) meminta upah dunia dari orang-orang musyrik itu atas penyampaian tugas kerasulan sehingga mereka terbelit beban keuangan yang berat? Atau apakah mereka punya ilmu ghaib lalu mereka menulis apa yang mereka tetapkan untuk diri mereka sendiri bahwa kedudukan mereka di sisi Allah lebih utama dibandingkan orang-orang yang beriman kepadaNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Apakah kamu -wahai Rasul- meminta upah dari mereka atas apa yang kamu serukan kepada mereka, sehingga dengan sebab itu mereka merasakan beban yang berat, dan inilah penyebab mereka berpalingnya darimu? Kenyataannya tidak demikian, kamu tidak meminta upah dari mereka, lalu apa yang menghalangi mereka untuk mengikutimu?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46-47. Apa yang menyebabkan orang-orang itu menjadi kafir dan ingkar? Apakah kamu meminta upah dari mereka atas risalah yang kamu sampaikan, sehingga itu menghalangi mereka untuk beriman karena upah itu memberatkan mereka? Atau mereka telah melihat hal ghaib yang tertulis dalam lauhul mahfuzh, sehingga mereka menulis dan mengikutinya? Karena kedua kemungkinan ini tidak terjadi, maka seharusnya mereka beriman dan menjadi pengikutmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. أَمْ تَسْـَٔلُهُمْ أَجْرًا(Apakah kamu meminta upah kepada mereka) Yakni apakah kamu meminta upah dari mereka atas dakwah yang kamu lakukan kepada mereka agar mereka beriman kepada Allah. فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ(lalu mereka diberati dengan hutang?) Makna (المغرم) yakni orang yang menanggung pembayaran upah tersebut. Yakni berat bagi mereka untuk menanggungnya karena kekikiran mereka dalam membelanjakan harta. Lalu apakah kamu meminta dari mereka upah sehingga mereka enggan untuk menerima dakwahmu karena hal ini?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Namun, apakah kamu meminta mereka wahai Rasulallah atas tersampaikannya risalah itu dengan upah sebagai bentuk penerimaan atas dakwahmu kepada mereka menuju iman. Akibat beban upah itu mereka adalah orang yang keberatan menanggungnya. Mereka menunjukkan hal itu kepadamu dan tidak beriman kepada risalahmu?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau kamu meminta imbalan kepada mereka sehingga mereka berhutang} berhutang atas imbalan itu {lagi terbebani} menanggung beban yang berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Ataukah kamu meminta upah kepada mereka, lalu mereka diberati dengan hutang?” maksudnya, tidak ada sebab yang membuat mereka lari darimu dan tidak membenarkanmu yang mengharuskan mereka melakukan hal itu. Engkau hanyalah mengajarkan dan menyeru mereka menuju Allah murni karena kepentingan mereka sendiri, tanpa kau mintai upah yang membuat mereka terbebani hutang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 46: 46-47. Engkau tanyakan wahai Nabi Allah kepada mereka orang-orang musyrik tentang upah keduniaan atas dakwahmu kepada mereka, apakah mereka terbebani dengan harus memberikan upah (kepadamu) ? Oleh sebab ini mereka menolak dakwahmu karena mereka takut terbebani dengan apa yang mereka tanggung, atau mereka memiliki ilmu ghaib yang nampak pada mereka sehingga dapat menghindarkan mereka agar tidak diadzab atas kekafirannya dan kesyirikan mereka ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam menyampaikan risalah. Yang membuat mereka menjadi tidak beriman. Sedangkan keadaan Beliau tidak seperti itu, Beliau tidak meminta upah sama sekali dalam dakwahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 46",
    "description": "46-47. Apakah ada yang meragukan dengan ajaran Al-Qur'an ataukah engkau, wahai nabi Muhammad, meminta imbalan kepada mereka, sehingga mereka dibebani dengan hutang' ataukah mungkin mereka secara khusus mengetahui yang gaib, lalu mereka menuliskannya' hal ini pun jelas tidak ada"
  }
]