[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-47. Atau apakah kamu (wahai Rasul) meminta upah dunia dari orang-orang musyrik itu atas penyampaian tugas kerasulan sehingga mereka terbelit beban keuangan yang berat? Atau apakah mereka punya ilmu ghaib lalu mereka menulis apa yang mereka tetapkan untuk diri mereka sendiri bahwa kedudukan mereka di sisi Allah lebih utama dibandingkan orang-orang yang beriman kepadaNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Ataukah mereka memiliki ilmu gaib lalu mereka menulis hujah-hujah yang mereka inginkan untuk membantahmu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. أَمْ عِندَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ (Ataukah ada pada mereka ilmu tentang yang ghaib lalu mereka menulis (padanya apa yang mereka tetapkan)?) Yakni apakah mereka memiliki ilmu ghaib sehingga mereka dapat menulis alasan-alasan yang mereka kemukakan, sehingga mereka dapat menentangmu dengan dalil apa yang telah mereka tulis tersebut?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Atau mereka memiliki ilmu tentang sesuatu yang ghaib atau lauhil mahfudz yang di dalamnya ada sesuatu yang ghaib. Mereka adalah orang-orang yang menulis apa yang mereka ucapkan dan menentukan hukum sesuai keinginan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau apakah mereka mengetahui yang ghaib} Atau mereka memiliki pengetahuan tentang yang ghaib {lalu mereka menulisnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “Ataukah ada pada mereka ilmu tentang yang ghaib lalu mereka menulis (padanya apa yang mereka tetapkan).” Hal-hal ghaib yang ada pada mereka dan mereka menemukan tulisan dalam ilmu ghaib itu yang menyatakan bahwa mereka berada di atas kebenaran dan mereka memiliki pahala di sisi Allah. Ini adalah sesuatu yang mustahil adanya. Kondisi mereka tidak lain hanyalah orang yang membangkang dan zhalim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 47: 46-47. Engkau tanyakan wahai Nabi Allah kepada mereka orang-orang musyrik tentang upah keduniaan atas dakwahmu kepada mereka, apakah mereka terbebani dengan harus memberikan upah (kepadamu) ? Oleh sebab ini mereka menolak dakwahmu karena mereka takut terbebani dengan apa yang mereka tanggung, atau mereka memiliki ilmu ghaib yang nampak pada mereka sehingga dapat menghindarkan mereka agar tidak diadzab atas kekafirannya dan kesyirikan mereka ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menuliskan apa yang mereka tahu tentang hal yang gaib, dimana mereka menemukan di sana bahwa mereka berada di atas yang hak dan bahwa mereka akan mendapatkan pahala di sisi Allah. Ini adalah perkara yang tidak sesuai kenyataan, bahkan keadaan mereka adalah keadaan orang yang keras kepala dan zalim, sehingga tidak ada lagi yang tersisa untuk menyikapi mereka selain dengan bersabar terhadap gangguan mereka, siap menerima apa yang muncul dari mereka serta tetap mendakwahi mereka. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Maka bersabarlah engkau (Muhammad) terhadap ketetapan Tuhanmu,”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 47",
    "description": "46-47. Apakah ada yang meragukan dengan ajaran Al-Qur'an ataukah engkau, wahai nabi Muhammad, meminta imbalan kepada mereka, sehingga mereka dibebani dengan hutang' ataukah mungkin mereka secara khusus mengetahui yang gaib, lalu mereka menuliskannya' hal ini pun jelas tidak ada. 48. Tidak ada satu pun alasan logis yang menjadikan kaum musyrik menolak Al-Qur'an. Jika demikian, maka bersabarlah engkau, wahai nabi Muhammad, terhadap ketetapan tuhanmu di antaranya menyangkut kendala dalam berdakwah, dan janganlah engkau menjadi seperti yunus orang yang berada dalam perut ikan, ketika dia berdoa dengan hati sedih."
  }
]