[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48-50. Maka bersabarlah (wahai Rasul) terhadap apa yang ditetapkan dan diputuskan oleh Tuhanmu, termasuk penangguhan terhadap mereka dan penundaan terhadap pertolonganNya kepadamu atas mereka, jangan seperti orang yang ditelan ikan, yaitu Yunus yang marah dan tidak sabar menghadapi kaumnya, saat dia memanggil Tuhannya dalam keadaan dipenuhi kesedihan meminta disegerakannya azab bagi kaumnya. Kalau Allah tidak menyusulkan nikmatNya kepadanya dengan membimbingnya untuk bertaubat dan menerima taubat, niscaya dia dimuntahkan dari perut ikan di tanah kosong yang mematikan, sedangkan dia melakukan sesuatu yang dipersalahkan. Lalu Tuhannya memilihnya untuk mengemban risalahNya, lalu menjadikannya termasuk orang-orang shalih yang niat, perkataan dan perbuatan mereka baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Maka bersabarlah -wahai Rasul- terhadap apa yang telah ditetapkan oleh Rabbmu berupa tahapan-tahapan bagi mereka dengan memberi penangguhan, jangan seperti orang yang berada di dalam perut ikan, Yunus -'alaihissalām- dalam hal kemarahannya kepada kaumnya, yaitu tatkala ia menyeru Rabbnya sedangkan dia dalam keadaan sedih di dalam kegelapan laut dan kegelapan perut ikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-50. Ini merupakan seruan bagi Nabi Muhammad dan bagi orang yang berjalan di atas tuntunannya; hendaklah dia bersabar atas ketetapan Allah untuk menunda siksaan orang-orang kafir, meneruskan dakwah yang dia lakukan dengan sebaik-baiknya, dan tidak terburu-buru seperti yang terjadi pada Nabi Yunus ketika dia meninggalkan kaumnya dalam keadaan marah karena mereka tidak juga beriman. Perbuatan Nabi Yunus ini merupakan ijtihad dari dirinya, bukan wahyu dari Allah. Maka dia ditelan oleh ikan paus di lautan, sehingga dia mengetahui bahwa itu adalah ujian dari Allah, maka dia memohon pertolongan dari-Nya ketika dia dalam keadaan marah terhadap kaumnya. Allah mengabulkan doanya dan menyelamatkannya dari dalam perut ikan paus; kalaulah bukan karena rahmat Allah, niscaya dia akan terlempar di tempat yang tidak ditumbuhi tanaman, serta dalam keadaan mendapat teguran akibat perbuatannya itu; akan tetapi Allah mengaruniakan kepadanya penerimaan taubat, keridhaan, dan kenabian. Allah menerima taubatnya, menerima syafaatnya bagi kaumnya, dan mengembalikannya kepada kaumnya sehingga mereka mendapat kenikmatan darinya. Dia adalah Nabi yang mulia yang memiliki keshalihan yang sempurna. Pada kisah ini terdapat pelajaran bagi setiap muslim agar dia selalu berpegang teguh pada perintah Allah dan bersabar atas cobaan hingga Allah memerintahkan perkara lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَلَا تَكُن كَصَاحِبِ الْحُوتِ (dan janganlah kamu seperti orang yang berada dalam (perut) ikan) Yang dimaksud adalah Nabi Yunus. Yakni janganlah kamu seperti dia dalam kemarahan dan kejengkelan. إِذْ نَادَىٰ( ketika ia berdoa) Allah menghibur Nabi Muhammad dan memerintahkannya untuk bersabar serta untuk tidak tergesa-gesa seperti Nabi Yunus. Dan kisah dari Nabi Yunus telah disebutkan dalam surat al-Anbiya’, surat Yunus, dan surat as-Shaffat. Doa nabi Yunus yang dimaksud adalah: لا إله إلا أنت سبحانك إني كنت من الظالمين وَهُوَ مَكْظُومٌ (sedang ia dalam keadaan marah) Yakni dalam keadaan gundah dan jengkel. Atau yang dimaksud adalah bahwa ia terkurung dalam perut ikan paus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Bersabarlah wahai Nabi SAW atas kehendak Tuhanmu. Janganlah seperti Yunus As yang ditelan ikan paus karena letih dan terlalu tergesa-gesa saat menyeru (kaumnya) kepada Tuhannya. Dia dipenuhi dengan kemarahan dan kegundahan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bersabarlah terhadap ketetapan Tuhanmu dan janganlah seperti orang yang berada dalam ikan} Jangan sampai letih dan ingin dipercepat seperti Yunus AS {ketika berdoa dia hati sedih} dipenuhi kedukaan dan kesedihan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-50. Yang tersisa hanya (engkau Muhammad) bersikap sabar atas gangguan mereka dan menahan diri dari perkataan dan tindakan yang mereka lakukan, serta tetap terus menyeru mereka. Karena itu Allah berfirman, “Maka bersabarlah kamu (hai Muhammad) terhadap ketetapan Rabbmu,” terhadap keputusan, baik syariat maupun takdir yang telah ditentukan. Keputusan takdir harus disikapi secara sabar atas segala sesuatu yang menyakiti, bukan dihadapi dengan kemarahan dan kesedihan. Sedangkan ketetapan syariat diterima dan ditaati secara sempurna, karena itu adalah perintah Allah. Allah berfirman, “Dan janganlah kamu seperti orang (Yunus) yang berada dalam (perut) ikan,” yaitu Nabi Yunus bin Matta. Maksudnya, jangan menyamainya dalam kondisi yang membuatnya tertahan dalam perut ikan, yaitu karena menyikapi kaumnya dengan kesabaran yang semestinya serta sikapnya yang meninggalkan kaumnya yang membuat Rabbnya marah. Sampai ketika Yunus naik perahu, kemudian para penumpangnya mengadakan pengundian, karena terlalu beratnya beban siapa di antara mereka yang dibuang ke laut agar beban yang ada di perahu agak ringan. Undian jatuh pada Yunus kemudian beliau dilempar ke laut dan ditelan ikan dalam kondisi mencela diri. Allah berfirman, “Ketika ia berdoa sedang ia dalam keadaan marah (kepada kaumnya).” Maksudnya, ketika ia berada di dalam perut ikan dan tertahan di dalamnya, atau ia berdoa dalam kondisi berduka dan sedih seraya berkata, لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ Al-anbiya:87- Lalu Allah mengabulkan doanya. Ikan yang menelannya kemudian memuntahkannya di tanah tandus dan Yunus dalam keadaan sakit. Allah menumbuhkan tanaman untuknya sejenis labu. Karena itu dalam surat ini Allah berfirman, “Kalau sekiranya ia tidak segera mendapat nikmat dari Rabbnya, benar-benar ia dicampakkan ke tanah tandus,” maksudnya, tentu akan dilemparkan ke tanah kering kerontang, “dalam keadaan tercela.” Tapi Allah meliputinya dengan rahmat, Yunus pun dilemparkan dalam keadaan terpuji sehingga kondisinya lebih baik dari sebelumnya. Karena itu Allah berfirman, “Lalu Rabbnya memilihnya,” yakni Allah memilihnya dan menyucikannya dari segala kotoran, “dan menjadikannya termasuk orang-orang yang shalih,” yakni, orang-orang yang perbuatan, perkataan, niat, dan kondisinya baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 48: 48-50. Bersabarlah wahai Nabi Allah atas celaan mereka orang-orang musyrik dan teruslah dengan dakwahmu, jangan menjadi seperti penghuni perut ikan besar itu, (ia adalah Yunus), yang ia jemu akan kaumnya setelah bersungguh-sungguh dalam mendakwahkan kepada kaumnya, maka setelah ia menyangka (karena sebab desakan / paksaan mereka agar supaya kafir, dan Yunus kokoh di atas imannya), maka adzab akan datang kepada mereka. Yunus pergi menuju ke laut untuk menaiki perahu hingga selamat dari intaian musibah karena sebab kaumnya. Dan ia (Yunus) tidak menunggu izin dari Allah. Oleh karena itu Allah menghukumnya dengan memasukkannya ke dalam perut ikan besar. Kemudian Yunus berdoa dikala kondisi sempit kepada Allah, dan ia sedih dan berduka, ia berkata : لَّآ إِلَـٰهَ إِلَّآ أَنتَ سُبْحَـٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّـٰلِمِينَ, artinya : Tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang dzalim, {Al Anbiyaa : 87}. Maka kalaulah Allah tidak memberikan nikmat atas hamba-Nya (Yunus) dengan kasih sayang-Nya dan sebelum taubatnya, maka sungguh Yunus akan tercampakkan dari perut ikan besar ke tanah lapang yang kosong dan luas, yaitu tempat cacian (dari kaumnya). Akan tetapi Allah dengan rahmat-Nya, memerintahkan ikan yang besar menghempaskannya, (dan ini bukan sebuah celaan), kemudian Allah tumbuhkan pohon untuk menaungi (Yunus) dari terik matahari. Kemudian Allah amanahkan risalah kepadanya dan Allah jadikan ia termasuk orang yang shalih, kemudian Allah kembalikan ia kepada kaumnya, dan ia mendapatinya masih sama dengan apa yang kaumnya perbuat padanya. Kemudian kaumnya menerima dakwah (Yunus) dan kemudian mereka masuk islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik ketetapan qadari maupun syar’i. Ketetapan qadari adalah menyikapinya dengan sabar, tidak keluh kesah dan marah-marah, sedangkan ketetapan syar’i adalah dengan menerima dan tunduk dengan sempurna. Dalam hal bosan dan terburu-buru serta tidak sabar terhadap sikap kaumnya, ia pergi meninggalkan kaumnya dalam keadaan marah lalu naik ke perahu, kemudian perahu itu tampak berat hingga hampir tenggelam, maka para penumpang perahu melakukan undian untuk melempar penumpangnya agar perahu tidak tenggelam, ternyata undian jatuh menimpa Yunus, maka Yunus melempar dirinya ke laut dan ia pun ditelan oleh ikan besar. Ketika keadaan seperti itu ia berdoa dalam perut ikan dalam keadaan yang sedih, isi doanya adalah, “Tidak ada Tuhan yang berhak disembah selain Engkau. Mahasuci Engkau, sesungguhnya aku termasuk orang-orang zalim.” Maka Allah mengabulkan doanya, ikan yang menelannya pun memuntahkan Yunus ke tanah yang tandus dalam keadaan sakit, lalu Allah menumbuhkan pohon sejenis labu. Inilah maksud firman Allah Ta’ala, “Sekiranya dia tidak segera mendapat nikmat dari Tuhannya, pastilah dia dicampakkan ke tanah tandus dalam keadaan tercela.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 48",
    "description": "Tidak ada satu pun alasan logis yang menjadikan kaum musyrik menolak Al-Qur'an. Jika demikian, maka bersabarlah engkau, wahai nabi Muhammad, terhadap ketetapan tuhanmu di antaranya menyangkut kendala dalam berdakwah, dan janganlah engkau menjadi seperti yunus orang yang berada dalam perut ikan, ketika dia berdoa dengan hati sedih. 49-50. Sekiranya nabi yunus tidak segera mendapat nikmat dari tuhannya, yaitu di antaranya berupa petunjuk untuk bertobat pastilah dia dicampakkan ke tanah tandus dalam keadaan tercela. Tetapi tuhannya menerima tobatnya, lalu tuhannya memilihnya dan menjadikannya termasuk orang yang saleh yaitu kelompok para nabi."
  }
]