[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48-50. Maka bersabarlah (wahai Rasul) terhadap apa yang ditetapkan dan diputuskan oleh Tuhanmu, termasuk penangguhan terhadap mereka dan penundaan terhadap pertolonganNya kepadamu atas mereka, jangan seperti orang yang ditelan ikan, yaitu Yunus yang marah dan tidak sabar menghadapi kaumnya, saat dia memanggil Tuhannya dalam keadaan dipenuhi kesedihan meminta disegerakannya azab bagi kaumnya. Kalau Allah tidak menyusulkan nikmatNya kepadanya dengan membimbingnya untuk bertaubat dan menerima taubat, niscaya dia dimuntahkan dari perut ikan di tanah kosong yang mematikan, sedangkan dia melakukan sesuatu yang dipersalahkan. Lalu Tuhannya memilihnya untuk mengemban risalahNya, lalu menjadikannya termasuk orang-orang shalih yang niat, perkataan dan perbuatan mereka baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Maka Allah memilihnya dan menjadikannya termasuk hamba-hamba-Nya yang saleh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. فَاجْتَبٰهُ رَبُّهُۥ (Lalu Tuhannya memilihnya) Yakni Allah memilihnya untuk mengemban kenabian. فَجَعَلَهُۥ مِنَ الصّٰلِحِينَ (dan menjadikannya termasuk orang-orang yang saleh) Yakni orang yang benar-benar shalih. Pendapat lain mengatakan bahwa yang dimaksud dengan ayat ini adalah Allah mengembalikan kenabiannya yang telah ia emban sebelumnya, dan memberinya shafaat bagi dirinya dan kaumnya, serta menjadikannya seorang rasul yang diutus ke seratus ribu orang atau lebih yang kemudian mereka semua beriman, sebagaimana telah dijelaskan sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Kemudian Allah memilihnya dengan memberinya nubuwwah untuk kedua kalinya dan menjadikannya termasuk dalam jajaran para nabi yang sempurna keshalihannya saat dikembalikan kepada kaumnya yang telah beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Tuhannya memilihnya} Tuhannya memilihnya {dan menjadikannya termasuk orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-50. Yang tersisa hanya (engkau Muhammad) bersikap sabar atas gangguan mereka dan menahan diri dari perkataan dan tindakan yang mereka lakukan, serta tetap terus menyeru mereka. Karena itu Allah berfirman, “Maka bersabarlah kamu (hai Muhammad) terhadap ketetapan Rabbmu,” terhadap keputusan, baik syariat maupun takdir yang telah ditentukan. Keputusan takdir harus disikapi secara sabar atas segala sesuatu yang menyakiti, bukan dihadapi dengan kemarahan dan kesedihan. Sedangkan ketetapan syariat diterima dan ditaati secara sempurna, karena itu adalah perintah Allah. Allah berfirman, “Dan janganlah kamu seperti orang (Yunus) yang berada dalam (perut) ikan,” yaitu Nabi Yunus bin Matta. Maksudnya, jangan menyamainya dalam kondisi yang membuatnya tertahan dalam perut ikan, yaitu karena menyikapi kaumnya dengan kesabaran yang semestinya serta sikapnya yang meninggalkan kaumnya yang membuat Rabbnya marah. Sampai ketika Yunus naik perahu, kemudian para penumpangnya mengadakan pengundian, karena terlalu beratnya beban siapa di antara mereka yang dibuang ke laut agar beban yang ada di perahu agak ringan. Undian jatuh pada Yunus kemudian beliau dilempar ke laut dan ditelan ikan dalam kondisi mencela diri. Allah berfirman, “Ketika ia berdoa sedang ia dalam keadaan marah (kepada kaumnya).” Maksudnya, ketika ia berada di dalam perut ikan dan tertahan di dalamnya, atau ia berdoa dalam kondisi berduka dan sedih seraya berkata, لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ Al-anbiya:87- Lalu Allah mengabulkan doanya. Ikan yang menelannya kemudian memuntahkannya di tanah tandus dan Yunus dalam keadaan sakit. Allah menumbuhkan tanaman untuknya sejenis labu. Karena itu dalam surat ini Allah berfirman, “Kalau sekiranya ia tidak segera mendapat nikmat dari Rabbnya, benar-benar ia dicampakkan ke tanah tandus,” maksudnya, tentu akan dilemparkan ke tanah kering kerontang, “dalam keadaan tercela.” Tapi Allah meliputinya dengan rahmat, Yunus pun dilemparkan dalam keadaan terpuji sehingga kondisinya lebih baik dari sebelumnya. Karena itu Allah berfirman, “Lalu Rabbnya memilihnya,” yakni Allah memilihnya dan menyucikannya dari segala kotoran, “dan menjadikannya termasuk orang-orang yang shalih,” yakni, orang-orang yang perbuatan, perkataan, niat, dan kondisinya baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 50: 48-50. Bersabarlah wahai Nabi Allah atas celaan mereka orang-orang musyrik dan teruslah dengan dakwahmu, jangan menjadi seperti penghuni perut ikan besar itu, (ia adalah Yunus), yang ia jemu akan kaumnya setelah bersungguh-sungguh dalam mendakwahkan kepada kaumnya, maka setelah ia menyangka (karena sebab desakan / paksaan mereka agar supaya kafir, dan Yunus kokoh di atas imannya), maka adzab akan datang kepada mereka. Yunus pergi menuju ke laut untuk menaiki perahu hingga selamat dari intaian musibah karena sebab kaumnya. Dan ia (Yunus) tidak menunggu izin dari Allah. Oleh karena itu Allah menghukumnya dengan memasukkannya ke dalam perut ikan besar. Kemudian Yunus berdoa dikala kondisi sempit kepada Allah, dan ia sedih dan berduka, ia berkata : لَّآ إِلَـٰهَ إِلَّآ أَنتَ سُبْحَـٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّـٰلِمِينَ, artinya : Tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang dzalim, {Al Anbiyaa : 87}. Maka kalaulah Allah tidak memberikan nikmat atas hamba-Nya (Yunus) dengan kasih sayang-Nya dan sebelum taubatnya, maka sungguh Yunus akan tercampakkan dari perut ikan besar ke tanah lapang yang kosong dan luas, yaitu tempat cacian (dari kaumnya). Akan tetapi Allah dengan rahmat-Nya, memerintahkan ikan yang besar menghempaskannya, (dan ini bukan sebuah celaan), kemudian Allah tumbuhkan pohon untuk menaungi (Yunus) dari terik matahari. Kemudian Allah amanahkan risalah kepadanya dan Allah jadikan ia termasuk orang yang shalih, kemudian Allah kembalikan ia kepada kaumnya, dan ia mendapatinya masih sama dengan apa yang kaumnya perbuat padanya. Kemudian kaumnya menerima dakwah (Yunus) dan kemudian mereka masuk islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni memilihnya dan membersihkannya dari kekeruhan. Yaitu orang yang baik amal, ucapannya, niatnya dan keadaannya. Dengan adanya kisah ini, maka Nabi Muhammad shallallahu 'alaihi wa sallam melaksanakan perintah Allah dan bersabar terhadap ketetapan-Nya dengan kesabaran yang belum pernah dilakukan oleh seorang pun. Maka Allah Subhaanahu wa Ta'aala memberikan akibat yang terpuji untuk Beliau, sedangkan musuh-musuh Beliau tidak memperoleh apa-apa selain sesuatu yang menyedihkan mereka, sampai-sampai saking kecewanya mereka ingin menggelincirkan Beliau dengan pandangan mata mereka karena dengki mereka yang begitu mendalam. Inilah gangguan perbuatan yang bisa mereka lakukan dan Allah Subhaanahu wa Ta'aala yang menjaga Beliau dan menolongnya. Adapun gangguan yang berupa ucapan, maka mereka telah mengatakan kata-kata yang banyak terhadap Beliau sesuai yang diilhamkan oleh hati mereka, dimana mereka terkadang menyebut Beliau sebagai ‘orang gila’, sebagai ‘penyair,’ sebagai ‘dukun’, sebagai pesihir, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 50",
    "description": "49-50. Sekiranya nabi yunus tidak segera mendapat nikmat dari tuhannya, yaitu di antaranya berupa petunjuk untuk bertobat pastilah dia dicampakkan ke tanah tandus dalam keadaan tercela. Tetapi tuhannya menerima tobatnya, lalu tuhannya memilihnya dan menjadikannya termasuk orang yang saleh yaitu kelompok para nabi. 51-52. Setelah perintah bersabar kepada nabi Muhammad ayat ini melanjutkan penjelasannya mengapa nabi Muhammad harus tabah dan menguatkan kesabarannya. Dan sungguh, orang-orang kafir itu hampir-hampir menggelincirkanmu dengan pandangan mata mereka yang penuh kedengkian dan kebencian kepadamu, khususnya ketika mereka mendengar Al-Qur'an dan mereka berkata, ' dia nabi Muhammad itu benar-benar orang gila. Ltu dilakukan agar masyarakat menolak ajaran Al-Qur'an, padahal Al-Qur'an itu tidak lain adalah peringatan, nasihat dan pengajaran bagi seluruh alam."
  }
]