[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "51. Orang-orang kafir itu, ketika mereka mendengar al-Quran, hampir menimpakan tatapan mata jahat ( serangan ‘ain) atasmu (wahai Rasul) karena kebencian mereka kepadamu, seandainya tidak ada penjagaan dan perlindungan Allah kepadamu. Mereka berkata sesuai dengan hawa nafsu mereka, “Sesungguhnya dia itu benar-benar gila.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan sesungguhnya orang-orang yang kafir kepada Allah dan mendustakan Rasul-Nya hampir saja mengalahkan kamu dengan mata mereka karena tajamnya pandangan mereka kepadamu tatkala mereka mendengar Al-Qur`ān yang diturunkan kepadamu, dan mereka berkata karena mengikuti hawa nafsu dan berpaling dari kebenaran, “Sesungguhnya Rasul yang membawanya adalah orang gila.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Orang-orang kafir itu -karena sangat besar permusuhan dan kedengkian mereka kepadamu- sungguh hampir-hampir menyingkirkanmu dari tempatmu, ketika mereka mendengar ayat-ayat yang kamu bacakan kepada mereka; dan mereka semakin gencar menuduhmu gila. Bagaimana tuduhan ini dapat dibenarkan, sedangkan Allah telah menurunkan kepada Nabi-Nya itu firman yang membawa mukjizat dan petunjuk bagi seluruh makhluk? Ayat ini merupakan penggugur anggapan mereka, dan bantahan bagi mereka dengan ungkapan yang jangan jelas dan dalil yang sangat kuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَإِن يَكَادُ الَّذِينَ كَفَرُوا۟ لَيُزْلِقُونَكَ بِأَبْصٰرِهِمْ (Dan sesungguhnya orang-orang kafir itu benar-benar hampir menggelincirkan kamu dengan pandangan mereka) Yakni mereka memandangmu saat kamu membaca al-Qur’an dengan pandangan yang penuh permusuhan dan kemurkaan seakan-akan pandangan itu hampir menjatuhkanmu ke atas tanah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Orang-orang kafir itu mendekatkan pandangan mereka kepadamu saat membaca Al-Qur’an. Mereka memandangmu dengan pandangan yang penuh kebencian, kemurkaan dan kemarahan saat mendengar Al-Qur’an itu dibacakan. Dengan dengki dan penuh benci, mereka berkata: “Sesungguhnya Muhammad adalah orang gila karena atas pengakuannya bahwa Al-Qur’an itu diturunkan kepadanya dari langit.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang kafir itu hampir-hampir menggelincirkanmu dengan pandangan mereka} menjatuhkanmu dengan mata mereka {ketika mereka mendengar Adz-Dzikr} Al-Qur'an {dan berkata, “Sesungguhnya dia benar-benar orang gila.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51-52. Nabi kita Muhammad melaksanakan perintah Rabbnya dan bersabar atas ketetapanNYa dengan kesabaran yang tidak bisa ditandingi oleh seorang pun dari seluruh alam. Allah memberikan akibat baik bagi beliau dan juga untuk orang-orang yang bertakwa. Para musuh Nabi Muhammad tidak berbuat apa pun selain yang mencelakai mereka sendiri, hingga (sampai pada tahap) mereka amat menginginkan untuk menggelincirkanmu, “dengan pandangan mereka.” Maksudnya, mencederaimu dengan pandangan-pandangan mereka, berupa sikap hasad, dengki dan marah. Inilah puncak gangguan berupa tindakan yang mereka lakukan, tapi Allah menjaga dan menolongnya. Adapun gangguan berupa perkataan, mereka mengatakan apa saja tentang Muhammad sesuai kehendak hati mereka. Sesekali mereka menyebut Muhammad penyair dan sesekali mereka menyebut Muhammad penyihir. Allah berfirman, “Dan al-Quran itu tidak lain hanyalah peringatan bagi seluruh umat.” Maksudnya, al-Quran agung dan peringatan bijak ini tidak lain hanyalah merupakan peringatan untuk seluruh alam. Mereka menjadikannya sebagai peringatan demi kebaikan dunia dan agama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 51: 51-52. Ketahuilah wahai Nabi Allah, bahwa mereka orang-orang musyrik ketika mereka mendengar Al Qur’an berencana menyerangmu dengan mata-mata mereka yang hasad dan kegeraman atas diri-diri mereka. Akan tetapi Allah telah menjagamu dari mereka. Mereka berkata : Sesungguhnya Rasul ini sungguh gila (tidak punya akal). Dan mereka tidaklah mengetahui bahwa mereka telah sesat, dan bahwasanya Al Qur’an adalah nasihat dan peringatan bagi setiap manusia dan jin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut kebiasaan yang terjadi di tanah Arab, seseorang dapat membinasakan binatang atau manusia dengan menujukan pandangannya yang tajam. Hal ini hendak dilakukan pula kepada Nabi Muhammad shallallahu 'alaihi wa sallam, tetapi Allah memeliharanya, sehingga terhindar dari bahaya itu, sebagaimana dijanjikan Allah dalam surat Al Maidah ayat 67. Kekuatan pandangan mata itu pada masa sekarang dikenal dengan hypnotisme."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 51",
    "description": "51-52. Setelah perintah bersabar kepada nabi Muhammad ayat ini melanjutkan penjelasannya mengapa nabi Muhammad harus tabah dan menguatkan kesabarannya. Dan sungguh, orang-orang kafir itu hampir-hampir menggelincirkanmu dengan pandangan mata mereka yang penuh kedengkian dan kebencian kepadamu, khususnya ketika mereka mendengar Al-Qur'an dan mereka berkata, ' dia nabi Muhammad itu benar-benar orang gila. Ltu dilakukan agar masyarakat menolak ajaran Al-Qur'an, padahal Al-Qur'an itu tidak lain adalah peringatan, nasihat dan pengajaran bagi seluruh alam"
  }
]