[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-6. Tidak lama lagi kamu (wahai Rasul) dan orang-orang kafir itu akan tahu siapa yang terfitnah dan gila di antara kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Ketika kebenaran terkuak dan terbuka, siapa di antara kalian yang tertimpa kegilaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. maka kamu dan orang-orang kafir itu akan melihat kejelasan dari kebenaran itu pada hari kiamat. Siapa di antara kalian yang gila, apakah kamu atau mereka?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa di antara kalian yang gila} golongan mana di antara kalian yang gila"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Karena Allah menempatkan Rasulullah di posisi tertinggi dalam berbagai hal sedangkan para musuhnya menuduh sebagai orang gila dan sakit, maka Allah berfirman, “Maka kelak kamu akan melihat dan mereka (orang-orang kafir) pun akan melihat, siapa di antara kamu yang gila,” jelas sudah, Rasulullah adalah orang yang paling lurus dan paling sempurna terhadap dirinya dan orang lain, sedangkan musuh-musuhnya adalah orang-orang yang paling sesat dan buruk. Mereka adalah orang-orang yang memfitnah dan menyesatkan hamba-hamba Allah dari jalanNya. Cukuplah Allah yang mengetahui tentang hal itu, karena Dia-lah yang akan memberi perhitungan dan membalas segala perbuatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 6: 5-6. Allah memberikan kabar baik kepada Nabi-Nya akan sesuatu yang dekat ﷺ bahwa mereka orang-orang musyrik Mekkah akan melihat dengan mata-mata mereka sendiri siapa di antara kalian yang gila ? Berkata Muqatil : Ini Adalah janji dan ancaman dengan adzab yang mereka dapatkan di perang Badr."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kamu ataukah mereka? Sungguh jelas, bahwa Beliau adalah manusia yang paling mendapatkan petunjuk, paling menyempurnakan diri dan orang lain, sedangkan musuh-musuh Beliau adalah manusia paling tersesat dan paling buruk, mereka telah menggelincirkan hamba-hamba Allah dan menyesatkan mereka dari jalan-Nya. Cukuplah pengetahuan Allah terhadapnya; Dia lebih mengetahui siapa yang tersesat dari jalan-Nya dan siapa yang mendapatkan petunjuk, dan Dialah yang akan menghisab mereka dan memberi balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 6",
    "description": "5-6. Maka kelak engkau wahai nabi Muhammad akan melihat dan me-ngetahui, dan mereka yaitu orang-orang kafir itu pun akan melihat dan mengetahui ketika telah jelas kebenaran pada hari kiamat, siapa di antara kamu yang gila engkau atau mereka'7. Sungguh, tuhan yang memelihara dan membimbing-Mu, wahai nabi Muhammad, dialah yang paling mengetahui siapa yang sesat dari jalan-Nya serta siapa yang gila. Dan dialah yang paling mengetahui siapa orang yang mendapat petunjuk serta mengamalkan dengan mantap dan istikamah petunjuk tersebut."
  }
]