[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Sesungguhnya Tuhanmu lebih mengetahui oranng yang sengsara yang menyimpang dari agama Allah dan jalan hidayah, dan Dia lebih mengetahui orang yang bertakwa yang mendapatkan hidayah ke jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sesungguhnya Rabbmu -wahai Rasul- mengetahui siapa yang menyimpang dari jalan-Nya, dan Dia paling mengetahui siapa yang mendapat petunjuk ke jalan-Nya, maka Dia mengetahui bahwa mereka termasuk orang-orang yang tersesat dari jalan-Nya dan sesungguhnya kamu termasuk yang mendapat petunjuk ke jalan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ (Sesungguhnya Tuhanmu, Dialah Yang Paling Mengetahui siapa yang sesat dari jalan-Nya) Yakni Allah mengetahui siapa yang sebenarnya sesat, apakah kamu atau orang yang menuduhmu itu. Yakni merekalah orang yang sesat karena mereka menyelisihi apa yang mengandung manfaat bagi mereka di dunia dan di akhirat, dan karena mereka lebih memilih apa yang mengandung mudharat bagi mereka. وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ(dan Dialah Yang Paling Mengetahui orang-orang yang mendapat petunjuk) Yakni yang mendapat petunjuk ke jalan-Nya yang menuntun kepada kebahagiaan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Wahai Rasulallah! Sesungguhnya Tuhanmu lebih mengetahui tentang orang yang menyimpang dari agamaNya. Dia lebih tahu tentang orang-orang yang ditunjukkan ke jalanNya yang menuju kepada kebahagiaan. Mereka adalah para pemenang. Maknanya: Mereka (orang-orang musyrik) adalah orang-orang-orang yang tersesat, menyimpang dan membangkang (kepadaNya). Maka janganlah engkau taat kepada orang-orang yang mendustakan ayat-ayat Allah dan risalahmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhanmulah yang paling mengetahui siapa yang sesat dari jalanNya. Dialah yang paling mengetahui siapa orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Sesungguhnya Rabbmu, Dia-lah Yang Paling Mengetahui siapa yang sesat dari jalanNya; dan Dia-lah Yang Paling Mengetahui orang-orang yang mendapat petunjuk.” Dalam ayat ini terdapat ancaman untuk orang-orang zhalim, janji baik untuk mereka yang mendapatkan petunjuk, dan penjelasan tentang hikmah Allah yang memberi hidayah pada orang yang layak mendapatkannya, bukan pada lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 7: Kemudian Allah menjelaskan bahwa hanya Dia yang mengetahui siapa yang tersesat dari jalan kesesatan, dan termasuk membuat Allah murka. Dia juga mengetahui siapa yang menempuh jalan hidayah dan jalan orang-orang yang selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat ancaman bagi orang-orang yang sesat, janji kebaikan untuk orang-orang yang mendapatkan petunjuk, menjelaskan kebijaksanaan Allah, dimana Dia memberi petunjuk orang yang layak memperoleh hidayah tidak selainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 7",
    "description": "Sungguh, tuhan yang memelihara dan membimbing-Mu, wahai nabi Muhammad, dialah yang paling mengetahui siapa yang sesat dari jalan-Nya serta siapa yang gila. Dan dialah yang paling mengetahui siapa orang yang mendapat petunjuk serta mengamalkan dengan mantap dan istikamah petunjuk tersebut. 8-9. Karena sudah jelas siapa yang sesat dan siapa yang lurus, maka janganlah engkau patuhi orang-orang kafir yang menuduhmu gila, yaitu orang-orang yang mendustakan ayat-ayat Allah. Mereka sangat menginginkan dengan keinginan yang kuat agar engkau bersikap lunak terhadap tuhan-tuhan mereka, maka dengan sikap lunakmu itu mereka akan bersikap lunak pula kepadamu."
  }
]