[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Maka teguhlah kamu (wahai Rasul) di atas apa yang kamu pegang, berupa menyelisihi orang-orang yang mendustakan itu dan jangan taati mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Maka janganlah kamu -wahai Rasul- mengikuti orang-orang yang mendustakan apa yang kamu bawa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Ayat ini melarang Rasulullah menuruti orang-orang musyrik yang telah mendustakan dirinya dan risalahnya. Mereka meminta Rasulullah untuk menyembah tuhan-tuhan mereka beberapa waktu, dan kemudian mereka akan menyembah Allah pada waktu lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Wahai Rasulallah! Sesungguhnya Tuhanmu lebih mengetahui tentang orang yang menyimpang dari agamaNya. Dia lebih tahu tentang orang-orang yang ditunjukkan ke jalanNya yang menuju kepada kebahagiaan. Mereka adalah para pemenang. Maknanya: Mereka (orang-orang musyrik) adalah orang-orang-orang yang tersesat, menyimpang dan membangkang (kepadaNya). Maka janganlah engkau taat kepada orang-orang yang mendustakan ayat-ayat Allah dan risalahmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka janganlah mematuhi orang-orang yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Allah berfirman pada Nabi Muhammad, “Maka janganlah kamu ikuti orang-orang yang mendustakan (ayat-ayat Allah),” yakni, orang-orang yang mendustakanmu dan menentang kebenaran, karena mereka adalah orang-orang yang tidak patut untuk diikuti, karena mereka hanya memerintah sesuai kehendak hawa nafsu mereka. Yang mereka inginkan hanyalah kebatilan. Orang yang menaati mereka adalah orang mempersembahkan marabahaya pada dirinya sendiri. Hal ini bersifat umum pada setiap pendusta dan dalam setiap ketaatan yang bersumber dari kebohongan, meski tekstual ayat berlaku pada masalah khusus, yaitu ketika orang-orang musyrik meminta Nabi agar tidak mencela tuhan-tuhan dan agama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 8: Janganlah engkau taati wahai Nabi, mereka orang-orang kafir yang mendustakan ayat-ayat Allah dan Rasul-Nya. Dan tetaplah atas apa yang engkau di atas kebenaran yang nyata dan jelas. Rasul adalah maksum (terjaga dari dosa), Allah mengatakan demikian sebagai pembelajaran bagi umat dan bagi para dai di antara manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena mereka tidak layak diikuti, karena mereka tidaklah menyuruh kecuali yang sesuai hawa nafsu mereka, dan mereka tidak menginginkan selain kebatilan. Oleh karena itu, menaati mereka sama saja mempersiapkan dirinya kepada sesuatu yang membahayakannya, dan hal ini umum kepada setiap orang yang mendustakan dan pada setiap ketaatan yang timbul dari mendustakan, meskipun susunan ayatnya untuk sesuatu yang khusus, yaitu kaum musyrikin meminta kepada Nabi Muhammad shallallahu 'alaihi wa sallam untuk diam tidak mencela sesembahan dan agama mereka sehingga mereka pun akan diam terhadap Beliau. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Mereka menginginkan agar engkau bersikap lunak lalu mereka bersikap lunak (pula).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 8",
    "description": "8-9. Karena sudah jelas siapa yang sesat dan siapa yang lurus, maka janganlah engkau patuhi orang-orang kafir yang menuduhmu gila, yaitu orang-orang yang mendustakan ayat-ayat Allah. Mereka sangat menginginkan dengan keinginan yang kuat agar engkau bersikap lunak terhadap tuhan-tuhan mereka, maka dengan sikap lunakmu itu mereka akan bersikap lunak pula kepadamu"
  }
]