[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Mereka ingin dan berharap bila kamu bersikap lunak dan berbaik hati kepada mereka sehingga mereka juga bersikap lunak kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Mereka berkeinginan kamu bersikap lemah lembut kepada mereka dengan mengorbankan agama, sehingga mereka juga bersikap lemah lembut kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Mereka sangat berharap kamu akan menuruti permintaan mereka itu, dan berharap kamu bersikap lembut pada mereka dan menyepakati apa yang mereka minta. Dan dengan begitu, mereka bersiap untuk menurutimu sebagai imbalannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَدُّوا۟ لَوْ تُدْهِنُ فَيُدْهِنُونَ (Maka mereka menginginkan supaya kamu bersikap lunak lalu mereka bersikap lunak (pula kepadamu)) Yakni mereka berharap kamu dapat bersikap lunak sehingga mereka dapat bersikap lunak juga. Pendapat lain mengatakan: maknanya adalah mereka berharap kamu dapat condong kepada mereka dan berharap kamu meninggalkan kebenaran yang ada padamu itu, oleh sebab itu mereka menampakkan kelembutan padamu agar kamu menjadi condong kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Mereka berangan-angan supaya kamu berlemah-lembut dan mengagungkan tuhan-tuhan mereka. Kemudian mereka berlemah lembut kepadamu dengan menghentikan fitnah tentang risalahmu dan melakukan kesepakatan (denganmu). Law adalah huruf yang menjadikan fiil setelahnya berposisi sebagai mashdar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menginginkan} mereka menginginkan {agar kamu bersikap lunak} agar kamu bersikap lembut kepada mereka {Maka mereka bersikap lunak} maka mereka bersikap lembut kepadamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Karena itu Allah berfirman, “Maka mereka menginginkan,” yakni, orang-orang musyrik, “supaya kamu bersikap lunak,” maksudnya, setuju terhadap keyakinan mereka baik perkataan, tindakan, maupun bersikap diam dari apa yang seharusnya dikatakan, “lalu mereka bersikap lunak (pula kepadamu).” Tetapi tegaklah dengan perintah Allah dan tampakkan Agama Islam, karena kesempurnaan penampakan Islam adalah kebalikan dari lawannya dan mencela agama yang menentangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qalam ayat 9: Allah menjelaskan bahwa orang-orang kafir, mereka berharap seandainya engkau lemah lembut kepada mereka, dan tidak memperingatkan mereka di atas kebathilan mereka, dimana mereka akan memperlakukanmu dengan tidak menganggapmu musuh, tidak juga membencimu dengan mengatakan kepadamu orang gila dan selainnya. Berkata Syaikh Al Jazairi : Al Adhan adalah engkau memudahkan atas sesuatu yang berkaitan dengan urusan agamamu; Dan ini menyelisihi Al Mudaraat yang ia adalah engkau memudahkan sesuatu dari urusan agamamu dengan sebab (prioritas) kepada agamamu. Berkata DR Walid Al Furayyan : Al Mudaahanah adalah membiarkan (diam) atas kemungkaran yang diiringi dengan kemampuan untuk merubahnya; Menyembunyikan untuk sebuah ketenangan karena sebab diperintah atau urusan yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sepakat dengan yang mereka pegang, baik dengan ucapan, perbuatan maupun dengan mendiamkan, sehingga mereka akan bersikap lunak terhadap Beliau shallallahu 'alaihi wa sallam. Akan tetapi Beliau diperintahkan untuk menerangkan perintah Allah dan menerangkan agama-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qalam Ayat 9",
    "description": "8-9. Karena sudah jelas siapa yang sesat dan siapa yang lurus, maka janganlah engkau patuhi orang-orang kafir yang menuduhmu gila, yaitu orang-orang yang mendustakan ayat-ayat Allah. Mereka sangat menginginkan dengan keinginan yang kuat agar engkau bersikap lunak terhadap tuhan-tuhan mereka, maka dengan sikap lunakmu itu mereka akan bersikap lunak pula kepadamu. 10-13. Untuk mengukuhkan larangan tersebut, Allah menyifati me-reka dengan sifat-sifat buruk seperti yang dirinci dalam ayat ini. Dan janganlah engkau patuhi setiap orang yang suka bersumpah baik dalam kebenaran maupun kebatilan, dan berkepribadian buruk karena suka menghina, lagi suka mencela, yang kian ke mari menyebarkan fitnah untuk memecah belah anggota masyarakat, dan yang suka merintangi segala bentuk perbuatan yang baik dengan bersikap kikir, selain itu dia juga gemar bersikap melampaui batas dan banyak dosa baik terhadap tuhan maupun terhadap sesama manusia, yang bertabiat kasar, selain itu juga yang lebih buruk lagi adalah ia terkenal dengan kejahatannya. Di antara tokoh yang dimaksud pada ayat ini adalah al-walid bin al-Mugirah atau abu jahl bin hisyam."
  }
]