[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(kaf ha ya ain shad) keterangan tentang huruf-huruf yang terpisah-pisah (diawal surat seperti ini ) telah berlalu di muka pada permulaan surat al-baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Kāf Hā Yā 'Aīn Ṣād. Pembahasan tentang huruf-huruf seperti ini telah disebutkan di permulaan surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. كٓهيعٓصٓ (Kaaf Haa Yaa ‘Ain Shaad) Penjelasan huruf-huruf yang ada pada pembuka surat seperti ini telah disebutkan dengan jelas pada surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Ibnu Mas’ud mengatakan dalam kisah hijrah yang pertama ke Habasyah dari Makkah: Bahwa Ja’far bin Abi Thalib radliyallahu ‘anhu membaca surat ini di hadapan Najasi dan para sahabatnya. 1. Kaaf Haa Yaa ´Ain Shaad: huruf peringatan. Orang Arab bersatu untuk membuat tandingan Alquran yang tersusun dari huruf Arab semisal ini. Huruf-huruf penyusun pidato, makalah, syi’ir karena ini adalah bahasa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kāf Hā Yā ‘Ain Ṣād."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 1",
    "description": "Bila surah al-kahf ditutup dengan penegasan tentang luasnya ilmu Allah dan perintah untuk berbuat kebajikan dan bertauhid dalam ibadah kepada-Nya, maka surah maryam mengingatkan kembali manusia tentang ilmu Allah lainnya yang terkandung dalam berbagai ayat Al-Qur'an, seperti k'f h' y' 'ain s'd. Makna sesungguhnya dari ayat ini hanya diketahui oleh Allah. Tujuannya adalah menggugah perhatian manusia tentang Al-Qur'an yang penuh hikmah dan tuntunan. 2. Wahai nabi Muhammad, apa yang dibacakan kepadamu ini adalah penjelasan tentang rahmat tuhanmu yang maha pengasih kepada hamba-Nya, zakaria, insan pilihan yang saleh dan taat beribadah."
  }
]