[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Zakaria berkata untuk menambah keyakinannya, ”wahai tuhanku, buatkanlah untukku tanda atas terwujudnya kabar gembira yang telah disampaikan malaikat kepadaku,” Allah berfirman ”tandamu, bahwa engkau tidak bisa berbicara kepada manusia selama tiga hari tiga malam, padahal engaku sehat-sehat saja dan bebas dari penyakit."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Zakariya -'alaihissalām- berkata, \"Wahai Tuhanku, berikanlah aku suatu tanda yang membuatku tenang, yang menunjukkan akan terwujudnya kabar gembira yang disampaikan oleh para Malaikat kepadaku.\" Dia berfirman, \"Tanda akan terwujudnya kabar gembira yang disampaikan padamu adalah engkau tidak akan bisa berbicara dengan manusia lainnya selama tiga malam tanpa ada sebab sakit apapun, bahkan engkau saat itu sehat-sehat saja.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Zakariya berkata: “Ya Tuhanku, berilah aku tanda yang dapat menenangkanku atas kebenaran kabar gembira ini.” Allah menjawab: “Tanda bagimu adalah kamu tidak dapat berbicara dengan orang lain selama tiga hari kecuali hanya dengan bahasa isyarat, padahal kamu dalam keadaan sehat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. قَالَ رَبِّ اجْعَل لِّىٓ ءَايَةً ۚ (Zakaria berkata: “Ya Tuhanku, berilah aku suatu tanda”) Yakni tanda yang menunjukkan terkabulnya doa dan kebenaran kabar gembira kehamilan istrinya yang mengandung anaknya, Yahya. قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلٰثَ لَيَالٍ سَوِيًّا (Tuhan berfirman: “Tanda bagimu ialah bahwa kamu tidak dapat bercakap-cakap dengan manusia selama tiga malam, padahal kamu sehat”) Yakni kamu tidak dapat berbicara padahal kamu dalam keadaan sehat, tidak ada penyakit yang menghalangimu untuk berbicara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Zakaria berkata: \"Ya Tuhanku, berilah aku suatu tanda tentang akan terjadinya kabar gembira ini\". Allah berfirman: \"Tanda bagimu ialah bahwa kamu tidak dapat bercakap-cakap dengan manusia selama tiga malam, padahal kamu sehat, dan tidak ada penyakit yang menyebabkanmu tidak bisa bicara.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Wahai Tuhanku, berilah aku suatu tanda”} tanda atas kehamilan istriku {Dia berfirman,“Tandamu ialah} tandamu {bahwa kamu tidak dapat bercakap-cakap dengan manusia selama tiga malam, padahal sehat”} sehat dan selamat tidak sakit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Zakaria berkata, ‘Ya Rabbku, berilah aku satu tanda’,” yaitu bukti yang membuat hatiku menjadi tenang. Ini bukanlah bentuk keragu-raguan (Zakaria) terhadap kabar dari Allah. Akan tetapi, perkataan ini semakna dengan ucapan yang dikatakan oleh Nabi Ibrahim, kekasih Allah, \"Ya Tuhanku, perlihatkanlah padaku bagaimana Engkau menghidupkan orang mati\". Allah berfirman: \"Belum yakinkah kamu?\". Ibrahim menjawab: \"Aku telah meyakininya, akan tetapi agar hatiku tetap mantap (dengan imanku)\". (Al-Baqarah:260). Beliau memohon tambahan ilmu dan pencapaian ke derajat ‘ainul yaqin setelah diberikan ilmul yaqin. Lalu Allah mengabulkan permintaannya sebagai wujud kasih sayang Allah kepadanya. “Allah berfirman, ‘Tanda bagimu ialah bahwa kamu tidak dapat bercakap-cakap dengan manusia selama tiga malam, padahal kamu sehat’.” Dalam ayat lain, Allah berfirman, \"selama tiga hari, kecuali dengan isyarat\" (Ali Imran:41). Keduanya bermakna sama, karena terkadang Allah mengungkapkannya dengan kata layali (malam) dan terkadang dengan kata ayyam (siang hari), tapi arah maksudnya sama. Ini termasuk bukti (kebesaran Allah) yang menakjubkan. Karena, saat dirinya terhalang untuk berbicara selama tiga hari dan tidak mampu bicara tanpa disertai penyakit bisu dan cacat, bahkan dia dalam keadaan normal, tidak ada kekurangan apa pun, ini termasuk bukti-bukti kekuasaan Allah yang menerjang bentuk kewajaran. Meskipun dalam keadaan normal, Nabi Zakaria terhalangi untuk berbicara dengan pembicaraan yang berkaitan dengan manusia dan berkomunikasi dengan mereka, sedangkan yang berkaitan dengan ucappan tasbih, [tahlil] dan dzikir serta ucapan serupa lainnya, maka beliau tidak dilarang darinya. Oleh karena itu, dalam ayat yang lain Allah berfirman, \"Dan sebutlah (nama) Tuhanmu sebanyak-banyaknya serta bertasbihlah di waktu petang dan pagi hari\". (Ali Imran:41)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 10: Yakni yang menunjukkan kehamilan istriku. Perkataan ini adalah agar hati Beliau tenang (mantap), bukan karena ragu-ragu terhadap berita Allah. Hal ini seperti perkataan Nabi Ibrahim ‘alaihis salam, “Ya Tuhanku, perlihatkanlah kepadaku bagaimana Engkau menghidupkan orang-orang mati.\" Allah berfirman, \"Belum yakinkah kamu?\" Ibrahim menjawab, \"Aku telah meyakinkannya, akan tetapi agar hatiku tetap mantap (dengan imanku).” (lihat Al Baqarah: 261). Beliau meminta kepada Allah agar ditambah lagi ilmunya dan disampaikan kepada ‘ainul yaqin (penglihatan yang yakin) setelah ‘ilmul yaqin (pengetahuan yang yakin), maka Allah Subhaanahu wa Ta'aala mengabulkan permohonannya sebagai rahmat untuknya. Selain dzikrullah. Yakni tiga hari tiga malam. Hal ini termasuk ayat-ayat Allah yang menakjubkan, karena tidak mampunya Beliau berbicara dengan manusia selama tiga hari bukan karena bisu atau penyakit, termasuk dalil yang menunjukkan kekuasaan Allah yang menyelisihi kebiasaan. Meskipun Beliau terhalang dari berbicara dengan manusia, namun dzikrullah tidaklah tertahan. Oleh karena itu, di ayat lain Allah Subhaanahu wa Ta'aala berfirman, “Tandanya bagimu, kamu tidak dapat berkata-kata dengan manusia selama tiga hari, kecuali dengan isyarat. dan sebutlah (nama) Tuhanmu sebanyak-banyaknya serta bertasbihlah di waktu petang dan pagi hari\".(Terj. Ali Imran: 41), hati Beliau pun tenang dan merasa gembira dengan kabar tersebut, Beliau mengikuti perintah Allah untuk bersyukur, yaitu dengan beribadah dan menyebut nama-Nya, maka Beliau berdiam di mihrabnya dan keluar kepada kaumnya dengan berisyarat agar mereka bertasbih di pagi dan petang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 10",
    "description": "Berita itu menggembirakan sekaligus mengejutkan nabi zakaria. Untuk memastikannya, dia berkata, 'ya tuhanku, berilah aku suatu tanda yang menambah keyakinanku pada berita itu. Bukan aku tidak percaya akan kekuasaan-Mu, namun ini adalah hal yang luar biasa bagiku. ' menjawab permohonan nabi zakaria, Allah berfirman, 'tanda yang aku berikan kepada-Mu agar kaupercaya sepenuhnya ialah bahwa engkau tidak akan dapat bercakap-cakap dengan manusia di sekelilingmu selama tiga hari tiga malam, kecuali dengan memberi isyarat, padahal sesungguhnya engkau sehat dan tidak menderita penyakit apa pun. '11. Mendengar janji dan anugerah Allah, maka dia keluar dari mihrab tempatnya berdoa menuju kaumnya yang sudah lama menunggu, lalu dia memberi isyarat kepada mereka tanpa berbicara sepatah kata pun karena Allah telah menahan kemampuannya untuk berbicara. Dengan isyarat itu dia memberi pesan kepada kaumnya, 'bertasbihlah kamu kepada Allah dengan ketundukan hati dan ketulusan niat pada waktu pagi dan petang. '."
  }
]