[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu Zakaria keluar dari tempat ibadahnya menemui kaumnya, yaitu dari tempat disampaikannya kabar gembira kepadanya untuk meemperoleh anak. Dia memberikan isyarat kepada mereka, ”hendaklah kalian bertasbih menyucikan Allah pada pagi dan sore sebagai bentuk ungkapan syukur kepada Allah . ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Maka Zakariya keluar dari tempat ibadahnya menuju kaumnya lalu memberikan isyarat tanpa bisa mengucapkan satu kata pun, \"Bertasbihlah kalian kepada Allah di pagi dan sore.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Kemudian Zakariya keluar dari tempatnya beribadah menuju kaumnya dan memberi isyarat kepada mereka agar mereka senantiasa bertasbih kepada Allah pada pagi dan petang hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. فَخَرَجَ عَلَىٰ قَوْمِهِۦ مِنَ الْمِحْرَابِ (Maka ia keluar dari mihrab menuju kaumnya) Yakni dari tempatnya beribadah. فَأَوْحَىٰٓ إِلَيْهِمْ(lalu ia memberi isyarat kepada mereka) Yakni memberinya isyarat tanpa berbicara kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pintu-pintu yang lain terus terbuka, ketika Zakaria ditahan untuk tidak berbicara, maka ia pun keluar dengan bahasa isyarat. Dakwah tidak berhenti di satu cara.. sekalipun satu pintu tertutup, niscaya pintu lain akan terbuka!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Maka ia keluar dari mihrab menuju tempat shalat kaumnya, lalu ia memberi isyarat kepada mereka; hendaklah kamu bertasbih di waktu pagi dan petang, sebagai ungkapan syukur kepada Allah atas karunia-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia keluar dari mihrab} tempat shalat {menuju kaumnya lalu dia memberi isyarat kepada mereka} memberi isyarat kepada mereka {agar bertasbihlah kalian pada waktu pagi dan petang} permulaan siang dan akhir siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Maka, hati Zakaria menjadi tenang dan bersuka cita dengan kabar gembira ini. Dia pun taat kepada perintah Allah untuk bersyukur dengan cara beribadah kepadaNya dan selalu berdzikir. Zakaria berdiam diri di tempat ibadahnya dan keluar (menemui) kaumnya “lalu dia memberi isyarat kepada kaumnya,” yaitu dengan isyarat dank ode “hendaklah kalian bertasbih di waktu pagi dan petang,” karena kabar gembira dengan kedatangan Yahya bagi semua orang merupakan kemaslahatan agamis (bagi mereka)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 11: Yakni dari masjid. Ketika itu kaumnya menunggu agar Beliau membukakan mihrabnya untuk shalat di situ dengan perintahnya seperti biasanya. Ada yang menafsirkan dengan, “Shalatlah.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 11",
    "description": "Mendengar janji dan anugerah Allah, maka dia keluar dari mihrab tempatnya berdoa menuju kaumnya yang sudah lama menunggu, lalu dia memberi isyarat kepada mereka tanpa berbicara sepatah kata pun karena Allah telah menahan kemampuannya untuk berbicara. Dengan isyarat itu dia memberi pesan kepada kaumnya, 'bertasbihlah kamu kepada Allah dengan ketundukan hati dan ketulusan niat pada waktu pagi dan petang. '12. Usai menjelaskan tanda-tanda yang meyakinkan nabi zakaria tentang anugerah berupa anak yang diberi nama yahya, pada ayat ini Allah beralih menguraikan kejadian setelah anak ini dewasa. Allah berfirman, 'wahai yahya! ambillah dan pelajarilah kitab taurat itu. Pahami kandungannya dan laksanakan tuntunannya dengan sungguh-sungguh. ' kami telah mengajarinya isi taurat dan kami berikan hikmah kepadanya selagi dia masih kanak-kanak, sehingga saat dewasa ia telah paham betul kitab itu dan tidak pernah lalai dalam melaksanakannya."
  }
]