[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka ketika Yahya dilahirkan, dan dia telah mencapai usia yang mampu memahami ucapan yang ditujukan kepadanya, maka Allah memerintahkannya untuk mengambil kitab taurot dengan sungguh-sungguh melalui firmanNya: “Wahai yahya, ambilah kitab taurat dengan penuh keseriusan dan kasungguhan dengan menghafal teks-teksnya, memahami makna-maknanya, dan mengamalkannya. Dan Kami telah berikan kepadanya hikmah dan pemahaman yang baik saat dia masih kanak-kanak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Lalu lahirlah Yahya. Ketika ia telah mencapai usia yang bisa memahami suatu perintah, Kami katakan padanya, \"Wahai Yahya! Ambil dan pelajarilah Taurat ini dengan tekun dan sungguh-sungguh.\" Dan Kami berikan padanya pemahaman, ilmu, ketekunan dan kesungguhan sejak ia masih berusia kanak-kanak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-14. Dan kabar gembira itu menjadi kenyataan dengan kelahiran Yahya. Dan setelah dia mencapai usia berakal, Allah memerintahkannya: “Hai Yahya, ambillah Taurat dengan penuh kesungguhan”. Kami telah memberinya hikmah sejak dia masih kecil, dan Kami juga memberinya rahmat, kewibawaan, rezeki, dan keistiqamahan dari sisi Kami. Dia adalah orang yang taat kepada segala perintah Allah dan selalu menjauhi segala larangan-Nya. Dan dia adalah anak yang sangat berbakti kepada kedua orangtuanya dan tidak pernah angkuh dan berpaling dari Tuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يٰيَحْيَىٰ خُذِ الْكِتٰبَ بِقُوَّةٍ ۖ (Hai Yahya, ambillah Al Kitab itu dengan sungguh-sungguh) Yakni Maka lahirlah seorang anak bagi Zakariya, hingga anak tersebut sampai pada umur yang sudah dapat diajak bicara. Maka Kami firmankan kepadanya: “wahai Yahya…” Makna al-Kitab di sini adalah kitab Taurat. وَءَاتَيْنٰهُ الْحُكْمَ صَبِيًّا (Dan kami berikan kepadanya hikmah selagi ia masih kanak-kanak) Makna (الحكم) adalah hikmah, yaitu kemampuan untuk memahami kitab. Pendapat lain mengatakan yakni kenabian yang diberikan ketika dia belum melewati usia anak-anak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { خُذِ ٱلْكِتَٰبَ بِقُوَّةٍ ۖ } \"ambillah Al Kitab (Taurat) itu dengan sungguh-sungguh\" dan sungguh al-Quran telah mengguncangkan bumi ini ketika ia mengguncangkannya dengan makna yang terkandung di dalamnya, dan ketika penduduk bumi ini telah membuka dunia dengannya ketika al-Qur'an membuka akal pikiran mereka, dan mereka juga telah menguasai dunia ini har ketika prinsip al-Qur'an menguasai akhlak mereka, maka dengan ini semua sejarah kembali mencatat keajaiban al-Qur'an sebagaimana yang tela terjadi pada abad-abad pertama. 2 ). { وَءَاتَيْنَٰهُ ٱلْحُكْمَ صَبِيًّا } \"Dan kami berikan kepadanya hikmah selagi ia masih kanak-kanak\" Mu'ammar bin Rasyid berkata : aku diceritakan bahwasanya beberapa orang anak kecil mendatangi Yahya bin Zakaria dan berkata kepadanya : bawalah kami untuk bermain, lalu beliau menjawab : aku tidak dciptakan untuk bermain-main! Bermain pada dasarnya tidak diharamkan secara mutlak; akan tetap hendaknya seorang hamba lebih mengutamakan tujuan penciptaan dirinya ketimbang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Ketika Yahya lahir dan mencapai usia baligh, Kami seru dan katakan kepadanya: “Hai Yahya, genggamlah Al Kitab (Taurat) itu dengan sungguh-sungguh. Kami berikan kepadanya hikmah berupa pemahaman atas rahasia Taurat selagi ia masih kanak-kanak.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Yahya, ambillah kitab} Taurat {itu dengan kuat} sungguh-sungguh dan serius {Kami menganugerahkan hikmah kepadanya} pemahaman, ilmu, kesungguhan dan tekad {ketika masih kanak-kanak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Pembicaraan yang telah lewat menunjukkan kelahiran, masa remaja, dan pertumbuhan Yahya. Pada saat dia sudah mencapai usia yang memungkinkannya untuk memahami arah pembicaraab, maka Allah memerintahkannya untuk mengambil kitab dengan penuh kekuatan, maksudnya dengan ketelatenan dan kesungguhan. Yaitu dengan bersungguh-sungguh dalam menghafal lafazh-lafazhnya, memahami makna-maknanya dan menaati semua perintah dan larangan-larangannya. Inilah wujud kesempurnaan mengambil kitab dengan penuh kekuatan. Lantas, Yahya menaati perintah Rabbnya, memberi perhatian kepadanya, menghafal dan memahaminya. Lalu Allah meletakkan kecerdasan dan kepandaian pada Yahya yang tidak ditemukan pada orang lain. Oleh karena itu, Allah berfirman, “Dan Kami berikan kepadanya hikmah selagi dia masih kanak-kanak,” [maksudnya, mengetahui hukum-hukum Allah serta hikmah-hikmahNya saat masih kecil, dan kekanak-kanakan]."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 12: Ayat ini ditujukkan kepada Yahya setelah Beliau lahir dan semakin besar, yaitu pada saat Beliau sudah dapat memahami pembicaraan, maka Allah memerintahkan Yahya untuk mempelajari kitab Taurat dengan sungguh-sungguh, baik dengan menghapalnya, memahami maknanya, mengamalkan perintah dan menjauhi larangannya. Yakni pelajarilah Taurat itu, amalkan isinya, dan sampaikan kepada umatmu. Maksudnya kenabian atau pemahaman terhadap Taurat dan pendalaman agama. Menurut sebagian ahli tafsir, bahwa ketika itu usia Yahya 3 tahun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 12",
    "description": "Usai menjelaskan tanda-tanda yang meyakinkan nabi zakaria tentang anugerah berupa anak yang diberi nama yahya, pada ayat ini Allah beralih menguraikan kejadian setelah anak ini dewasa. Allah berfirman, 'wahai yahya! ambillah dan pelajarilah kitab taurat itu. Pahami kandungannya dan laksanakan tuntunannya dengan sungguh-sungguh. ' kami telah mengajarinya isi taurat dan kami berikan hikmah kepadanya selagi dia masih kanak-kanak, sehingga saat dewasa ia telah paham betul kitab itu dan tidak pernah lalai dalam melaksanakannya. 13. Selain pemahaman tentang kandungan taurat, kami jadikan pula dia pemuda yang santun dan memiliki rasa kasih sayang kepada sesama. Inilah anugerah dari kami dan kami jadikan dia orang yang bersih dari dosa. Dan dia pun seorang yang bertakwa dan taat pada aturan-aturan Allah."
  }
]