[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah berikan kepadanya rasa belas kasihan dan cinta kasih dari sisi kami serta kebersihan pribadi dari dosa-dosa. Dan dia adalah seorang yang takut dan taat kepada Allah , menjalankan kewajiban-kewajiban dariNya, menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan Kami berikan ia rahmat dari sisi Kami, dan Kami mensucikannya dari dosa, dan dia pun seorang yang bertakwa, melaksanakan perintah Allah dan menjauhi larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَحَنَانًا مِّن لَّدُنَّا (dan rasa belas kasihan yang mendalam dari sisi Kami) Yakni Kami rahmati dia dengan rahmat dari sisi Kami. Makna (الحنان) yakni kasih sayang dan rasa cinta. Pendapat lain mengatakan, yakni Kami beri dia rahmat ke dalam hatinya dari sisi Kami agar dia memiliki rasa belas kasih terhadap orang lain sehingga dapat membebaskan mereka dari kekafiran dan kemaksiatan. وَزَكَوٰةً ۖ( dan kesucian) Makna (الزكاة) yakni pembersihan dan keberkahan. Yakni Kami jadikan dia orang yang membawa keberkahan bagi manusia yang memberi mereka petunjuk kepada kebaikan. وَكَانَ تَقِيًّا(Dan ia adalah seorang yang bertakwa) Yakni taat kepada Allah dan menjauhi kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Kami anugerahkan kepadanya rasa belas kasihan yang mendalam dari sisi Kami dan kesucian dan dosa. Dia adalah seorang yang taat dan ikhlas dalam beribadah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan rasa kasih sayang dari Kami} rahmat dari sisi Kami {dan bersih} bersih dari dosa {serta seorang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Dan Kami juga memberikan kepadanya “rasa belas kasihan yang mendalam dari sisi Kami,” maksudnya rasa kasih dan sayang, sehingga urusan-urusannya menjadi gampang, kondisinya menjadi baik dan amalan-amalannya juga lurus, “dan kesucian,” maksudnya suci dari kekurangan-kekurangan dan dosa-dosa, maka hatinya bersih dan akalnya pun jernih. Ini meliputi hilangnya sifat-sifat tercela dan perilaku-perilaku yang nista dari dirinya, dan sebagai tambahan akhlak-akhlak yang baik dan karakter-karakter yang terpuji. Oleh karena itu, Allah berfirman, “Dan dia adalah seorang yang bertakwa,” maksudnya orang yang melakukan perintah serta meninggalkan larangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 13: Hal ini menunjukkan tidak adanya sifat-sifat tercela dalam dirinya dan akhlak yang buruk. Ada pula yang menafsirkan, dengan suka bersedekah kepada orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 13",
    "description": "Selain pemahaman tentang kandungan taurat, kami jadikan pula dia pemuda yang santun dan memiliki rasa kasih sayang kepada sesama. Inilah anugerah dari kami dan kami jadikan dia orang yang bersih dari dosa. Dan dia pun seorang yang bertakwa dan taat pada aturan-aturan Allah. 14. Dan dia juga sangat berbakti kepada kedua orang tuanya sehingga mereka sangat menyayanginya, dan dia juga bukan orang yang sombong dan membanggakan nasabnya, dan bukan pula orang yang durhaka."
  }
]