[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dia adalah seorang yang berbakti kepada kedua orangtuanya, taat dan patuh kepada mereka, dan dia bukanlah orang yang angkuh untuk taat kepada tuhannya, juga untuk taat kepada kedua orangtuanya. Dia tidak durhaka kepada tuhannya dan kepada kedua orangtuanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan ia sangat berbakti kepada kedua orangtuanya, berlemah lembut dan berbuat baik kepada keduanya, dan ia sama sekali bukanlah orang yang sombong dan durhaka dari ketaatan terhadap Tuhannya dan kedua orangtuanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَبَرًّۢا بِوٰلِدَيْهِ (dan seorang yang berbakti kepada kedua orang tuanya) Lemah lembut dan berbaik hati kepada keduanya. وَلَمْ يَكُن جَبَّارًا عَصِيًّا(dan bukanlah ia orang yang sombong lagi durhaka) Yakni tidak menjadi orang yang menyombongkan diri dan tidak mendurhakai kedua orang tua dan Tuhannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dia adalah seorang yang berbakti kepada kedua orang tuanya, lemah lembut, dan ihsan kepada keduanya. Dia bukanlah ia orang yang sombong lagi durhaka kepada Tuhannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang yang berbakti kepada kedua orang tuanya dan bukan orang yang sombong} meremehkan ketaatan terhadap Tuhan dan orang tuanya {lagi durhaka} durhaka kepada Tuhan dan orang tuanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Siapa saja yang beriman dan bertakwa kepada Allah, maka dia menjadi salah satu wali Allah, dan termasuk salah satu (calon) penghuni surge yang dipersiapkan untuk orang-orang yang bertakwa. Dia mendapatkan pahala dunia dan akhirat yang Allah tetapkan sebagai balasan atas ketakwaan. Yahya juga “banyak berbakti kepada kedua orang tuanya,” maksudnya tidak durhaka dan tidak berbuat jelek kepada kedua orang tuanya, bahkan dia berbuat baik kepada keduanya lewat perkataan dan perbuatan. “Dan bukanlah dia seorang yang sombong lagi durhaka,” maksudnya, dia bukanlah sosok yang bersifat dictator, tinggi hati untuk beribadah kepada Allah, tidak sombong kepada sesame hamba Allah dan kedua orang tuanya. Bahkan sebaliknya, dia seorang yang selalu bertawadhu’, rendah hati, taat dan bertaubat kepada Allah. Jadi, Nabi Yahya telah memadukan antara menunaikan hak-hak Allah dan menjalankan hak-hak makhluk Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 14: Beliau berbuat baik kepada keduanya baik dengan ucapan maupun dengan perbuatan. Baik sombong dari beribadah kepada Allah maupun sombong terhadap manusia, bahkan Beliau seorang yang tawadhu’."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 14",
    "description": "Dan dia juga sangat berbakti kepada kedua orang tuanya sehingga mereka sangat menyayanginya, dan dia juga bukan orang yang sombong dan membanggakan nasabnya, dan bukan pula orang yang durhaka. 15. Karena sifat terpujinya itu, yahya didoakan agar keselamatan dan kesejahteraan selalu diperuntukkan bagi dirinya serta terhindar dari keburukan dan kekurangan pada hari lahirnya, pada hari wafatnya, dan pada hari dia dibangkitkan hidup kembali di padang mahsyar setelah hari kebangkitan kelak."
  }
]