[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kesejahteraan dari Allah atas Yahya dan keamanan baginya pada hari dia dilahirkan dan pada hari dia meninggal, serta pada hari dia dibangkitkan dari kuburnya dalam keadaan hidup kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Kesejahteraan dan keamanan baginya pada hari kelahirannya, pada hari wafatnya dan keluarnya dari kehidupan ini, serta pada hari dibangkitkan untuk hidup kembali pada hari Kiamat kelak. Tiga momen hari ini merupakan hari-hari genting dan menakutkan yang dilewati oleh manusia, bila ia merasa aman dalam melewatinya, maka ia tidak akan merasa khawatir setelahnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Dan keselamatan dari Allah bagi Yahya dari segala keburukan sejak hari kelahiran dan hari kematiannya hingga hari dia dibangkitkan. Ibnu ‘Asyur berkata: “Tiga keadaan yang disebutkan ini adalah awal permulaannya setiap tahapan; tahap keluar ke dunia, tahap pergi dari dunia, dan tahap menuju akhirat. Dan ini adalah kalimat yang digunakan untuk mengungkapkan penjagaan Allah baginya pada setiap tahap tersebut.” (at-Tahrir wa at-Tanwir 16/19)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَسَلٰمٌ عَلَيْهِ (Kesejahteraan atas dirinya) Yakni keselamatan baginya dari Allah. Pendapat lain mengatakan yakni Allah menyampaikan salam kepadanya. يَوْمَ وُلِدَ(pada hari ia dilahirkan) Yakni selamat dari gangguan setan pada hari itu. وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا (dan pada hari ia meninggal dan pada hari ia dibangkitkan hidup kembali) Dikatakan bahwa hal yang paling menakutkan bagi manusia terjadi pada tiga keadaan: Pertama: hari ketika dia dilahirkan, sebab dia telah keluar dari rahim yang penuh rahmat. Kedua: hari ketika dia mati, sebab saat itu dia melihat kaum yang belum pernah dia temui, dan hukum-hukum yang belum pernah dia kenal. Ketiga: hari ketika dia dibangkitkan, sebab saat itu dia melihat kengerian hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Kesejahteraan dari Allah atas dirinya, pada hari dimana ia dilahirkan dan pada hari ia meninggal dan pada hari ia dibangkitkan hidup kembali pada hari kiamat. Sebab manusia sangat butuh kemanan pada tiga keadaan ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kesejahteraan baginya pada hari dia dilahirkan, hari dia wafat, dan hari dia dibangkitkan lagi menjadi hidup"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Oleh sebab itu, dia dianugerahi keselamatan dari Allah, dalam segala kondisi, sejak permulaan sampai penghujung hayatnya. Karenanya, Allah berfirman, “Kesejahteraan atas dirinyalah pada hari dia dilahirkan, dan pada hari ia meninggal dan pada hari dia dibangkitkan hidup kembali.” Hal tersebut menuntut selamatnya Yahya darii (godaan) setan, kejahatan dan hukuman (siksaan) dalam tiga kondisi ini (kelahiran, kematian dan waktu kebangkitan kembali) pada rentang waktu di antara ketiga peristiiwa tersebut. Dia selamat dari neraka dan siksa, dan dia termasuk penghuni surge. Maka, semoga curahan shalawat dan salam Allah senantiasa tercurahkan kepada Yahya, kedua orang tuanya dan semua rasul. Dan semoga Allah berkenan menjadikan kita sekalian termasuk pengikut-pengikut mereka. Sesungguhnya Allah itu Maha Dermawan lagi Mahamulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 15: Yakni dari Allah. Nabi Yahya mendapatkan keamanan pada saat-saat menegangkan tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 15",
    "description": "Karena sifat terpujinya itu, yahya didoakan agar keselamatan dan kesejahteraan selalu diperuntukkan bagi dirinya serta terhindar dari keburukan dan kekurangan pada hari lahirnya, pada hari wafatnya, dan pada hari dia dibangkitkan hidup kembali di padang mahsyar setelah hari kebangkitan kelak. 16. Beralih dari kisah nabi yahya, Allah lalu berbicara tentang kisah maryam. Wahai nabi Muhammad, 'ingatkan dan ceritakanlah kisah maryam binti imran yang terdapat di dalam kitab Al-Qur'an. Kisahkan kepada mereka ketika dia bersungguh-sungguh ingin mengasingkan diri dari keluarganya, bahkan dari semua manusia, untuk memperoleh ketenangan dalam beribadah, menuju ke suatu tempat yang terletak di sebelah timur baitulmakdis. '."
  }
]