[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul) di dalam al-qur’an kisah maryam tatkala dia menjauhkan diri dari keluarganya. dia mengambil tempat yang berada di sebelah timur dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan ceritakanlah -wahai Rasul- kisah Maryam -'alaihassalām- dalam Al-Qur`ān yang diturunkan kepadamu, yaitu ketika ia mengasingkan diri dari keluarganya dan menyendiri di suatu tempat sebelah timur dari tempat mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Hai Rasulullah, ingatlah dalam al-Qur’an kisah Maryam ketika dia menyendiri dari keluarganya dan orang-orang lainnya, dan dia pergi ke tempat yang ada di timur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَاذْكُرْ فِى الْكِتٰبِ مَرْيَمَ إِذِ انتَبَذَتْ (Dan ceritakanlah (kisah) Maryam di dalam Al Quran, yaitu ketika ia menjauhkan diri) Terdapat pendapat mengatakan, Maryam menyendiri untuk beribadah kepada Allah. مَكَانًا شَرْقِيًّا (ke suatu tempat di sebelah timur) Yakni tempat di sisi timur Baitul Maqdis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Dan ceritakanlah wahai Nabi tentang kisah Maryam binti Imran alaihas salam. Yaitu ketika ia menjauhkan diri/menyepi dari keluarganya ke suatu tempat di sebelah timur dari rumahnya (Baitul Muqaddas). Menyepi untuk ibadah, atas dasar kesalehan dan ketakwaannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ceritakanlah di dalam kitab} Al-Qur’an {tentang kisah Maryam, ketika dia mengasingkan diri dari keluarganya} mengasingkan diri dan menarik diri dari keluarganya {ke suatu tempat di sebelah timur} di sebelah timur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Setelah Allah menceritakan kisah Zakaria dan Yahya, yang merupakan salah satu tanda kebesaran Allah yang mengagumkan, maka Allah beralih darinya menuju fakta yang lebih mengagumkan, secara berurutan dari peristiwa yang tingkat keanehannya relative lebih rendah kepada yang lebih tinggi. Allah berfirman, “Dan ceritakanlah di dalam al-Quran,” yang mulia “(kisah) Maryam.” Ini termasuk keutamaannya yang paling agung, yaitu namanya disebut-sebut di dalam al-Quran yang agung, yang dibaca oleh seluruh kaum Muslimin, di belahan bumi bagian TImur dan Barat. Ia singgung dengan sebutan terbaik dan sanjungan yang paling istimewa, sebagai balasan dari tindakannya yang luhur serta usahanya yang sempurna. Maksudnya, sebutlah kisah Maryam dalam al-Quran dalam kondisinya yang baik saat “dia menjauhkan diri,” maksudnya menjauhkan diri dari keluarganya “ke suatu tempat di sebelah timur,” ke sebelah timur dari (daerah) kaumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 16: Setelah Allah Subhaanahu wa Ta'aala menyebutkan kisah Zakaria dan Yahya, di mana kisah itu termasuk tanda-tanda kekuasaan Allah yang menakjubkan, maka Allah Subhaanahu wa Ta'aala melanjutkan dengan kisah yang lebih menakjubkan lagi dengan bertahap dari yang ringan lalu naik ke atasnya lagi. Hal ini termasuk dalil tentang keutamaan Maryam, karena nama dan kisahnya disebutkan dalam Al Qur’an yang dibaca oleh kaum muslimin di berbagai penjuru dunia, di sana disebutkan pujian untuknya, balasan terhadap amalnya yang utama dan sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 16",
    "description": "Beralih dari kisah nabi yahya, Allah lalu berbicara tentang kisah maryam. Wahai nabi Muhammad, 'ingatkan dan ceritakanlah kisah maryam binti imran yang terdapat di dalam kitab Al-Qur'an. Kisahkan kepada mereka ketika dia bersungguh-sungguh ingin mengasingkan diri dari keluarganya, bahkan dari semua manusia, untuk memperoleh ketenangan dalam beribadah, menuju ke suatu tempat yang terletak di sebelah timur baitulmakdis. '17. Sampai di tempat yang diinginkan, lalu dia memasang tabir yang memisahkan dan melindunginya dari mereka. Lalu kami mengutus roh kami, yaitu jibril, kepadanya untuk menyampaikan pesan kami. Begitu jibril sampai, maka dia menjelma atau menampakkan diri di hadapannya dalam bentuk manusia yang sempurna, anggun, berwibawa, dan simpatik."
  }
]