[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka dia mengadakan tabir penutup yang menutupinya dari keluarga dan kaummnya. Lalu Kami mengutus malaikat jibril kepadanya, maka jibril menjelma di hadapannya dalam rupa manusia yang sempurna fisiknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Lalu ia memasang tabir yang melindunginya dari kaumnya, agar mereka tidak melihat ibadahnya kepadaTuhannya. Lalu Kami mengutus Jibril -'alaihissalām- kepadanya, maka ia menampakkan diri di hadapannya dalam rupa manusia yang sempurna. Maryam pun merasa khawatir bila ia akan melakukan kejahatan pada dirinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Dan dia membuat pembatas yang menutupinya dari mereka. Kemudian Kami mengutus malaikat Jibril yang menyerupa menjadi manusia yang sempurna."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. فَاتَّخَذَتْ مِن دُونِهِمْ حِجَابًا (maka ia mengadakan tabir (yang melindunginya) dari mereka) Yakni penutup yang menghalanginya dari mereka agar mereka tidak melihatnya saat beribadah. فَأَرْسَلْنَآ إِلَيْهَا رُوحَنَا(lalu Kami mengutus roh Kami kepadanya) Yakni malaikat Jibril. فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا(maka ia menjelma di hadapannya (dalam bentuk) manusia yang sempurna) Yakni malaikat Jibril menyerupa menjadi seorang manusia yang mempunyai segala ciri-ciri bani Adam, sehingga Maryam mengira ia akan melakukan keburukan padanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَٱتَّخَذَتْ مِن دُونِهِمْ حِجَابًا } \"Maka ia mengadakan tabir (yang melindunginya) dari mereka\" hijab yang menutupinya dari penglihatan orang-orang yang berbadah dalam baitul Maqdis, namun sebagian besar anak-anak kaum muslimin di zaman ini justru membuka hijab mereka dihadapat orang-orang fasiq!!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Maka ia membuat tabir/penutup yang melindunginya dari mereka, sehingga tidak ada yang mengganggunya. Lalu Kami mengutus Jibril kepadanya, maka ia menjelma di hadapannya dalam bentuk manusia yang sempurna"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia memasang tabir dari mereka} tabir yang menutupinya dari manusia {Lalu Kami mengutus ruh Kami} Jibril AS {kepadanya, kemudian dia menyerupakan diri kepadanya dalam bentuk manusia} lalu Jibril menampakkan wujud kepadanya dalam bentuk manusia {yang sempurna} yang sama dalam bentuk fisiknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Maka dia mengadakan tabir (yang melindunginya) dari mereka,” yaitu sebagai penutup dan pengaman. Keinginan untuk menjauhkan diri (dari kaumnya) dan pembuatan pembatas ini dengan tujuan untuk mengasingkan diri dan menyendiri dalam rangka beribadah kepada Allah dan melakukan ketaatan kepadanya dengan ikhlas dan ketundukan serta dengan (rasa) hina kepadaNya. Ini adalah bentuk ketaatannya kepada Allah, berdasarkan FirmanNya, \"Dan (ingatlah) ketika Malaikat (Jibril) berkata: \"Hai Maryam, sesungguhnya Allah telah memilih kamu, menyucikan kamu dan melebihkan kamu atas segala wanita di dunia (yang semasa dengan kamu). Hai Maryam, taatlah kepada Tuhanmu, sujud dan rukuklah bersama orang-orang yang rukuk\" (Ali Imran:42-43). Firman Allah, “Lalu Kami mengutus ruh Kami kepadanya,” yaitu Jibril “maka dia menjelma di hadapannya (dalam bentuk) manusia yang sempurna,” yaitu seperti lelaki yang sempurna, dalam rupa yang tampan dan fisik yang sempurna, tidak memiliki aib dan cela. Lantaran Maryam tidak mampu menyaksikan Jibril dalam bentuk rupa aslinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 17: Dia ber’uzlah (mengasingkan diri) dari manusia dan menyendiri untuk beribadah kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 17",
    "description": "Sampai di tempat yang diinginkan, lalu dia memasang tabir yang memisahkan dan melindunginya dari mereka. Lalu kami mengutus roh kami, yaitu jibril, kepadanya untuk menyampaikan pesan kami. Begitu jibril sampai, maka dia menjelma atau menampakkan diri di hadapannya dalam bentuk manusia yang sempurna, anggun, berwibawa, dan simpatik. 18. Maryam terkejut dan takut melihat jibril datang ke tempatnya menyendiri. Dia berkata, 'sungguh, aku berlindung kepada tuhan yang maha pengasih dan pemelihara terhadapmu, jika engkau orang yang bertakwa, menjauhlah dan jangan menggangguku. '."
  }
]