[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maryam berkata kepadanya, ”sesungguhnya aku berlindung kepada Allah dari kamu agar kamu jangan sampai berbuat buruk kepadaku, bila memang engkau termasuk orang yang takut kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Ketika ia melihatnya dalam rupa manusia yang sempurna tengah menuju kepada dirinya, ia berkata, \"Sungguh aku berlindung kepada Tuhan Yang Maha Pengasih dari keburukan yang akan engkau lakukan, jika engkau benar-benar orang bertakwa yang takut kepada Allah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-20. Maryam berkata kepadanya dengan rasa takut: “Aku berlindung kepada Allah agar kamu tidak menyakitiku jika kamu adalah orang yang takut dan taat kepada Allah.” Jibril menjawab untuk menenangkannya: “Aku adalah malaikat yang diutus Allah kepadamu, untuk memberimu seorang anak yang bersih dari dosa.” Maryam merasa heran dan berkata: “Dari mana dan bagaimana aku akan melahirkan seorang anak, sedangkan tidak ada orang yang pernah menyentuhku dan aku juga tidaklah orang yang berbuat keji?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. قَالَتْ إِنِّىٓ أَعُوذُ بِالرَّحْمٰنِ مِنكَ إِن كُنتَ تَقِيًّا (Maryam berkata: “Sesungguhnya aku berlindung dari padamu kepada Tuhan Yang Maha pemurah, jika kamu seorang yang bertakwa”) Yakni jika kamu termasuk orang yang bertakwa dan takut kepada Allah. Aku telah meminta perlingdungan kepada Allah darimu, maka keluarlah dari tabir ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Maryam terperanjak dan takut sebab melihat jelmaan Jibril, dia berkata: \"Sesungguhnya aku berlindung kepada Tuhan Yang Maha pemurah dari padamu, jika kamu seorang yang bertakwa kepada Allah, maka menjauhlah dariku karena aku sudah memohon perlindungan kepada Allah \"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia (Maryam) berkata,“Sesungguhnya aku berlindung} Aku berlindung dan meminta pertolongan {kepada Tuhan Yang Maha Pengasih darimu, jika kamu adalah seorang yang bertakwa”} kamu takut kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Saat Maryam melihat lelaki (jelmaan Jibril) dalam kondisi seperti ini, sementara dia sedang jauh dari keluarganya dan mengasingkan diri dari manusia, dan telah meletakkan hijab (penutup diri) dari orang yang paling terhormat baginya yaitu keluarganya, maka dia khawatir lelaki itu akan melancarkan perbuatan jahat dan tergiur padanya. Karena itu, dia bertawakal dan berlindung kepada Allah dari lelaki ini. Ia mengatakan, “Sesungguhnya aku berlindung kepada Dzat Yang Maha Pemurah darimu,” maksudnya aku berlindung dan mencari pemeliharaan (kepada Allah) dengan sifat rahmatNya dari keinginan jahatmu padaku “Jika kamu seorang yang bertakwa,” maksudnya jika engkau takut kepada Allah dan bertakwa kepadaNya, maka janganlah engkau menggangguku. Di sini, Maryam menyatukan antara permohonan perlindungan kepada Rabbnya dengan pemberian ancaman dan peringatan kepada si lelaki dan menyuruhnya bertakwa kepada Allah. Padahal Maryam berada dalam kondisi sepi (hanya berduaan), masih remaja dan jauh dari keramaian manusia. Sementara itu, pemuda ini dalam rupa tampan rupawan, penampilan yang sempurna lagi normal, tidak mengucapkan kata-kata kotor kepada Maryam dan juga tidak mengganggunya. Ini hanyalah kekhawatiran dari Maryam. Dan merupakan bagian tertinggi dari sifat iffah (pemeliharaan diri) dan menghindari kejahatan serta segala faktor pemicunya. Iffah seperti ini termasuk amal yang paling baik, terutama saat faktor-faktor pemicunya ada, serta tidak ada penghalang. Karenanya, Allah memuji Maryam. Allah berfirman, \"dan Maryam putri Imran yang memelihara kehormatannya, maka Kami tiupkan ke dalam rahimnya sebagian dari roh (ciptaan) Kami; dan dia membenarkan kalimat-kalimat Tuhannya dan Kitab-kitab-Nya; dan adalah dia termasuk orang-orang yang taat.\" (At-Tahrim:12), \"Dan (ingatlah kisah) Maryam yang telah memelihara kehormatannya, lalu Kami tiupkan ke dalam (tubuh) nya ruh dari Kami dan Kami jadikan dia dan anaknya tanda (kekuasaan Allah) yang besar bagi semesta alam.\" (Al-Anbiya:91). Allah membalas penjagaan Maryam terhadap kehormatan dirinya dengan seorang anak, yang merupakan salah satu bukti kekuasaan Allah, dan sebagai seorang rasul dari rasul-rasul Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 18: Yakni jika engkau takut kepada Allah, maka janganlah mendatangiku. Maryam menggabung antara berpegang teguh kepada Tuhannya dengan menakut-nakutinya serta menyuruhnya untuk bertakwa. Ketika itu kondisinya sepi, jauh dari manusia, sedangkan malaikat yang datang kepadanya menampakkan diri dalam bentuk manusia yang sempurna lagi indah. Pendorong untuk berbuat maksiat sangat banyak, akan tetapi Maryam menolaknya, ia berlindung kepada Allah dan menakut-nakuti orang yang mendekatinya. Hal ini menunjukkan ‘iffah (bersihnya) Maryam, jauhnya dari keburukan dan sebab-sebabnya. Sikap ‘iffah ini dengan adanya pendorong dan tidak adanya penghalang termasuk amalan yang sangat utama. Oleh karena itu, Allah memuji Maryam karena ‘iffahnya, Dia berfirman, “Dan (ingatlah) Maryam binti Imran yang memelihara kehormatannya, Maka Kami tiupkan ke dalam rahimnya sebagian dari ruh (ciptaan) Kami, dan Dia membenarkan kalimat Rabbnya dan Kitab-Kitab-Nya, dan Dia termasuk orang-orang yang taat.” (Terj. At Tahrim: 12). Oleh karena ‘iffahnya, maka Allah Subhaanahu wa Ta'aala menggantikannya dengan menganugerahkan seorang anak yang termasuk tanda di antara tanda-tanda kekuasaan Allah dan menjadi salah seorang rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 18",
    "description": "Maryam terkejut dan takut melihat jibril datang ke tempatnya menyendiri. Dia berkata, 'sungguh, aku berlindung kepada tuhan yang maha pengasih dan pemelihara terhadapmu, jika engkau orang yang bertakwa, menjauhlah dan jangan menggangguku. '19. Jibril menyadari ketakutan maryam. Dia lalu memperkenalkan diri dan berkata, 'sesungguhnya aku ini hanyalah utusan tuhanmu yang menjaga dan melindungimu. Aku mendapat tugas untuk menyampaikan berita tentang anugerah yang akan dikaruniakan Allah kepadamu, yaitu seorang anak laki-laki yang suci dari segala dosa dan noda. '."
  }
]