[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini merupakan penjelasan rahmat tuhanmu kepada hambaNya, Zakaria. Kami akan menceritakannya kepadamu. Sesungguhnya pada kisahnya terdapat pelajaran yang baik bagi orang-orang yang mau memetik pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Ini adalah penjelasan tentang rahmat Tuhanmu kepada hamba-Nya, Zakarya -'alaihissalām-, Kami akan mengisahkannya padamu untuk jadi pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hai Rasulullah, yang Kami bacakan kepadamu ini adalah kisah rahmat Allah bagi hamba-Nya, Zakariya, dia adalah seorang Nabi dari Bani Israil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. ذِكْرُ رَحْمَتِ رَبِّكَ ((Yang dibacakan ini adalah) penjelasan tentang rahmat Tuhan kamu) Yakni ini merupakan penyebutan tentang rahmat Tuhanmu. عَبْدَهُۥ زَكَرِيَّآ (kepada hamba-Nya, Zakaria) Nabi Zakaria termasuk nabi dari Bani Israil, istrinya adalah bibi dari Nabi Isa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Yang dibacakan ini adalah penjelasan tentang rahmat Tuhan kamu kepada hamba-Nya, Zakaria nabi Bani Israil, suami bibi nabi Isa ‘alaihimas salam, beliau adalah tukang kayu. Rahmat sebagai tambahan bahwa fa’il/ subjeknya adalah Allah dan hamba Allah sebagai maf’ul/objek. Adapaun Zakaria sebagai hamba"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Penjelasan tentang rahmat Tuhanmu kepada hambaNya, Zakaria"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Maksudnya, ini “adalah penjelasan rahmat Rabbmu kepada hambaNya, Zakaria.” Kami akan mengisahkannya kepadamu dan akan menguraikannya dengan uraian terperinci yang bisa memperkenalkan kondisi NabiNya, Zakaria, peninggalan-peninggalannya yang baik, dan jalan hidupnya yang indah. Sesungguhnya dalam kisahnya terdapat pelajaran bagi orang yang mau mengambil pelajaran dan terdapat suri tauladan bagi orang yang mau mengikuti (jejak para nabi). Dan karena di dalam penjelasan tentang rahmat (kasih sayang) Allah kepada para waliNya dan penjelasan tentang penyebab apa saja yang mengundang turunnya rahmat buat mereka itu, terkandung perkara-perkara yang bisa mendorong untuk mencintai Allah, Memperbanyak dzikir kepadaNya, lebih mengenal Allah, dan terkandung faktor yang bisa mengantarkan kepadaNYa. Hal ini disebabkan karena Allah telah memilih Nabi Zakaria (untuk mengemban) risalahNya dan mengistimewakan beliau dengan (pemberian) wahyu. Lalu Nabi Zakaria melaksanakan tugasnya sebagaimana para rasul lainnya melaksanakan tugas mereka, mengajak manusia (agar beribadah) kepada Rabbnya, mengajarkan kepada mereka ilmu yang diajarkan oleh Allah kepadanya, menasehati mereka saat hayat masih dikandung badan dan setelah meninggal dunia, sebagaimana saudara-saudaranya dari kalangan para rasul dan para pengikut mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 2: Maksudnya, Kami akan bacakan kepadamu kisahnya dan menjelaskannya agar dapat diketahui lebih jelas keadaan Nabi Zakaria, peninggalannya yang baik dan keutamaannya, di mana dalam kisah itu terdapat pelajaran dan teladan. Di samping itu, menjelaskan lebih rinci rahmat Allah kepada seorang hamba mendorong kita untuk mencintai Allah Subhaanahu wa Ta'aala, banyak mengingat-Nya, mengenal-Nya dan merupakan sebab yang dapat menghubungkan kita kepada-Nya. Allah Subhaanahu wa Ta'aala telah memilih Zakaria menjadi rasul-Nya dan memberikan wahyu kepadanya, maka Beliau melaksanakannya sebagaimana rasul-rasul-Nya yang lain. Beliau mengajak manusia kepada Allah, menasehati mereka di masa hidupnya hingga wafatnya. Saat Beliau merasakan kelemahan fisik pada dirinya dan khawatir akan wafat namun tidak ada yang menggantikan posisinya untuk mengajak manusia kepada Allah, maka Beliau mengeluhkan kelemahan dirinya kepada Allah Subhaanahu wa Ta'aala dan berdoa dengan suara yang lembut dan pelan agar lebih sempurna, lebih utama dan lebih ikhlas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 2",
    "description": "Wahai nabi Muhammad, apa yang dibacakan kepadamu ini adalah penjelasan tentang rahmat tuhanmu yang maha pengasih kepada hamba-Nya, zakaria, insan pilihan yang saleh dan taat beribadah. 3. Yaitu rahmat tuhanmu kepadanya ketika dia berdoa dengan khusyuk kepada tuhannya dan mengajukan permohonan yang disampaikannya dengan suara yang lembut dan penuh pengharapan."
  }
]