[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maryam berkata kepada malaikat, ”bagaiamana aku akan memiliki seorang anak lelaki, padahal tidak ada seorangpun yang menyentuhku melalui pernikahan yang sah dan aku bukan seorang wanita pezina?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dalam keadaan heran, Maryam berkata, \"Bagaimana mungkin aku memiliki anak laki-laki padahal tidak ada seorang suami atau laki-laki lain pun yang menyentuhku, dan aku bukan pula seorang pezina hingga harus memiliki anak?!\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. قَالَتْ أَنَّىٰ يَكُونُ لِى غُلٰمٌ وَلَمْ يَمْسَسْنِى بَشَرٌ (Maryam berkata: “Bagaimana akan ada bagiku seorang anak laki-laki, sedang tidak pernah seorang manusiapun menyentuhku) Belum pernah aku disentuh seorang suami atau yang lainnya. وَلَمْ أَكُ بَغِيًّا (dan aku bukan (pula) seorang pezina!”) Makna (البغي) yakni pezina yang menggoda para lelaki untuk mendapatkan upah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Maryam sambil heran dan tidak biasa berkata: \"Bagaimana aku akan memiliki seorang anak laki-laki, sedang tidak pernah ada seorang manusiapun menyentuhku dan aku bukan pula seorang pezina!\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Bagaimana aku mempunyai anak laki-laki, padahal tidak pernah ada seseorang pun yang menyentuhku} tidak ada suami ataupun yang lainnya mendekatiku {dan aku bukan seorang pelacur”} pezina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Maryam merasa keheranan berkaitan dengan kelahiran seorang anak tanpa memiliki bapak. Maryam mengatakan “Bagaimana bisa aku memiliki seorang anak laki-laki, sedang tidak pernah ada seorang manusia pun menyentuhku, dan aku bukan (pula) seorang pezina,” padahal seorang anak tidak akan terlahir tanpa proses itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 20: Maryam merasa heran karena akan melahirkan anak tanpa bapak. Dengan menikahiku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 20",
    "description": "Mendengar perkataan jibril tentang anak tersebut, dia berkata keheranan, 'bagaimana mungkin aku melahirkan dan mempunyai anak laki-laki, padahal selama ini tidak pernah ada satu orang pun pria yang menyentuhku, yaitu berhubungan suami istri secara halal denganku, dan aku juga bukan seorang pezina. '21. Menjawab keheranan maryam, dia, yaitu jibril, berkata, 'demikianlah. Benarlah semua yang kaukatakan. Namun, tuhanmu berfirman, 'hal itu, yakni kelahiran anak tanpa hubungan suami istri, adalah hal mudah bagi-ku. Ini adalah anugerah bagimu dan sekaligus agar kami dapat menjadikannya sebagai suatu tanda yang nyata tentang kebesaran dan kekuasaan-ku bagi manusia, dan sebagai rahmat dari kami untuk orang yang mau menjadikan peristiwa ini sebagai petunjuk. Apa saja yang terjadi, dan demikian juga hal ini, yaitu kelahiran anak tanpa melalui hubungan seksual, adalah suatu urusan yang sudah diputuskan. Karena itu, terimalah ketentuan ini dengan ikhlas. '."
  }
]