[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Malaikat berkata kepadanya, ”demikianlah keadaannya sebagaimana kamu sebutkan bahwa sesungguhnya tidak ada seorang lelaki pun yang pernah menyentuhmu dan engkau bukanlah wanita pezina. Akan tetapi tuhanmu berfirman ’perkara itu mudah bagiKu dan agar anak lelaki itu menjadi bukti bagi manusia yang menunjukan tentang kuasa allah dan rahmat dari kami baginya, kedua orangtua dan sekalian manusia. Dan wujud isa dalam keadaan seperti ini merupakan satu ketetapan yang sudah berlalu lagi ditakdirkan, serta tertulis di lauhil mahfuzh, sehingga pasti akan terwujud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Jibril berkata kepadanya, \"Benarlah ucapanmu bahwa tidak ada seorang suami atau laki-laki pun yang menyentuhmu, dan engkau bukan pula seorang pezina, akan tetapi Tuhanmu berfirman, \"Penciptaan anak tanpa ayah sungguh mudah bagi-Ku, dan agar anak yang dikaruniakan padamu tersebut menjadi tanda kebesaran dan kekuasaan Allah bagi manusia, dan juga sebagai rahmat Kami atasmu dan atas orang-orang beriman kepada kerasulannya. Penciptaan anakmu ini merupakan ketentuan Allah yang telah diputuskan, dan telah tertulis di Lauḥ Maḥfūẓ.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Jibril menjawab: “Demikianlah sebagaimana yang kamu katakan, dan kelahiran anak darimu adalah sesuatu yang mudah bagi Allah, agar kelahiran itu menjadi bukti bagi manusia tentang kebesaran kuasa Allah dan rahmat dari Kami bagimu dan bagi orang yang beriman kepadanya. Dan penciptaan anak ini merupakan perkara yang telah ditetapkan Allah, dan telah berlalu ketetapannya dalam ilmu-Nya bahwa itu akan terjadi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَلِنَجْعَلَهُۥٓ ءَايَةً لِّلنَّاسِ (dan agar dapat Kami menjadikannya suatu tanda bagi manusia) Yakni Dan agar Kami menjadikan anak ini. Atau agar penciptaan anak ini tanpa seorang ayah sebagai tanda bagi manusia yang menunjukkan kesempurnaan kuasa-Nya. وَرَحْمَةً مِّنَّا ۚ( dan sebagai rahmat dari Kami) Karena mereka akan mendapatkan hidayah dan banyak kebaikan darinya, sebab seluruh nabi adalah rahmat bagi umatnya. وَكَانَ أَمْرًا مَّقْضِيًّا(dan hal itu adalah suatu perkara yang sudah diputuskan”) Yakni ketetapan yang telah ditakdirkan Allah, dan telah kering tinta dari pena untuk menuliskan takdir itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Jibril berkata: \"Memang demikian, kamu tidak perlu heran bahwa kamu akan mempunyai anak tanpa seorang suami\". Tuhanmu berfirman: \"Hal itu adalah mudah bagi-Ku; sebab Tuhanmu adalah Maha Kuasa atas segala sesuatu. Kami benar-benar akan menjadikan bayi ini tanpa seorang ayah sebagai bukti bagi manusia atas kekuasaan Kami yang sempurna. Juga sebagai rahmat bagi mereka berupa petunjuk dan kebaikan yang banyak. Hal itu adalah suatu perkara yang sudah diputuskan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Jibril berkata kepadanya {“Demikianlah” Tuhanmu berfirman,“Hal itu sangat mudah bagiKu dan agar Kami menjadikannya sebagai tanda bagi manusia} tanda atas kekuasaan Kami kepada manusia {dan rahmat dari Kami} dan agar Kami menjadikannya rahmat bagi ibu dan orang yang mengimaninya {Hal itu adalah suatu urusan yang diputuskan”} ditakdirkan dan diputuskan di Lauhil Mahfidz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Jibril berkata, ‘Demikianlah.’ Rabbmu berfirman, ‘Hal itu adalah mudah bagiKu, dan agar Kami menjadikannya sebagai suatu tanda bagi manusia’.” Ini menunjukkan kesempurnaan kekuasaan Allah dan menandakan bahwa semua faktor penyebab itu tidak memberikan efek dengan sendirinya, akan tetapi yang memberikan pengaruh adalah takdir Allah. Maka, Allah memperlihatkan kepada para hambaNya pendobrakan kejadian-kejadian yang biasa pada sebagian hukum sebab-akibat yang biasa (terjadi), supaya mereka tidak hanya terpaku pada faktor penyebab saja, tanpa peduli dengan Dzat yang menakdirkan dan menyebabkannya. “Dan sebagai rahmat dari Kami,” [maksudnya] Kami hendak menjadikan anak Maryam itu sebagai rahmat dari Kami buat dirinya, ibunya, dan sekalian manusia. Adapun wujud rahmat Allah kepada diri anak Maryam, yaitu Allah mengistimewakannya dengan pemberian wahyu kepadanya, menganugerahkan kepadanya kenikmatan yang di anugerahkan kepada para ulul azmi. Sedangkan rahmat buat ibunya, lantaran teraihnya kebanggan, pujian yang baik dan manfaat-manfaat yang besar baginya. Dan wujud rahmatnya bagi umat manusia, maka sesungguhnya nikmat terbesar yang Allah anugerahkan kepada umat manusia adalah pengutusann seorang rasul di tengah-tengah mereka, seorang rasul yang akan membacakan ayat-ayat Allah, yang menyucikan mereka, mengajarkan kepada mereka al-Kitab dan hikmah. Lalu mereka pun beriman kepada rasul itu, menaatinya sehingga akan terwujud bagi mereka kebahagiaan dunia dan akhirat. “Dan hal itu,” eksistensi Isa dalam kondisi seperti ini, “adalah suatu perkara yang sudah diputuskan,” ketentuan yang sudah ditentukan di masa lalu. Maka ketentuan dan keputusan ini pasti terlaksana. Lalu Jibril meniupkan pada kerah baju di lehernya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 21: Yakni diciptakan-Nya seorang anak dari kamu tanpa seorang bapak. Yang menunjukkan sempurnanya kekuasaan Allah, dan bahwa semua sebab tidaklah berpengaruh dengan sendirinya, bahkan berpengaruh dengan taqdir Allah Subhaanahu wa Ta'aala. Baik kepadanya, kepada ibunya maupun kepada manusia. Rahmat Allah kepadanya adalah dengan menjadikannya salah seorang rasul di antara rasul-rasul Allah, di mana ia akan mengajak manusia menyembah Allah dan mengesakan-Nya. Lebih dari itu, Beliau (Nabi Isa ‘alaihis salam) termasuk salah seorang rasul ulul ‘azmi. Adapun rahmat-Nya kepada ibunya adalah karena ia mendapatkan kebanggaan, pujian yang baik dan manfaat yang besar. Sedangkan rahmat-Nya kepada manusia dan menjadi nikmat terbesar bagi mereka adalah dengan mengutusnya kepada manusia, membacakan kepada mereka ayat-ayat-Nya, membersihkan mereka, mengajarkan mereka kitab dan hikmah, di mana jika mereka mengikutinya, maka mereka akan mendapatkan kebahagiaan di dunia dan akhirat. Adanya ‘Isa ‘alaihis salam dengan cara seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 21",
    "description": "Menjawab keheranan maryam, dia, yaitu jibril, berkata, 'demikianlah. Benarlah semua yang kaukatakan. Namun, tuhanmu berfirman, 'hal itu, yakni kelahiran anak tanpa hubungan suami istri, adalah hal mudah bagi-ku. Ini adalah anugerah bagimu dan sekaligus agar kami dapat menjadikannya sebagai suatu tanda yang nyata tentang kebesaran dan kekuasaan-ku bagi manusia, dan sebagai rahmat dari kami untuk orang yang mau menjadikan peristiwa ini sebagai petunjuk. Apa saja yang terjadi, dan demikian juga hal ini, yaitu kelahiran anak tanpa melalui hubungan seksual, adalah suatu urusan yang sudah diputuskan. Karena itu, terimalah ketentuan ini dengan ikhlas. '22. Ayat berikut menguraikan kondisi psikologis maryam ketika hamil. Proses kehamilannya dimulai ketika jibril meniupkan roh ke tubuh maryam, maka sesudah itu dia mengandung. Mengetahui dirinya hamil, lalu dia mengasingkan diri dengan kandungannya itu ke tempat yang jauh dari tempatnya menetap selama ini."
  }
]