[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka maryam mengandung seorang anak lelaki sesudah jibril meniup leher bajunya. Tiupan itu menuju rahimnya, maka terjadilah kehamilan dengan sebab tersebut. Lalu dia mengasingkan diri di tempat yang jauh dari manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Maka diapun mengandung setelah Malaikat meniupkan penciptaan janin padanya, lalu ia mengasingkan diri dengan kandungannya tersebut ke tempat yang jauh dari manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-23. Kemudian Maryam mengandung seorang anak setelah Jibril meniup kantong yang ada pada bajunya. Lalu Maryam pergi menyendiri ke tempat yang jauh dari keluarganya dan orang-orang. Dan rasa sakit saat melahirkan memaksanya untuk bersandar di batang pohon kurma. Dia telah yakin akan mendapat ujian dengan anak ini, sehingga dia berandai-andai dia meninggal sebelum merasakan rasa sakit saat melahirkan dan menjadi orang yang tidak dikenal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. فَحَمَلَتْهُ (Maka Maryam mengandungnya) Maka Jibril meniupkan ke arah saku dari pakaiannya, sampai tiupan itu sampai ke perutnya, dan akhirnya dia hamil. فَانتَبَذَتْ بِهِۦ مَكَانًا قَصِيًّا (lalu ia menyisihkan diri dengan kandungannya itu ke tempat yang jauh) Menjauhkan diri ke tempat yang jauh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Kemudian Jibril meniup saku baju Maryam, sehingga tiupannya sampai kepada perutnya. Maka Maryam menjadi hamil, lalu ia mengasingkan diri dengan kandungannya itu ke tempat yang jauh hingga tidak ada yang melihatnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka dia mengandungnya, lalu mengasingkan diri bersamanya} mengasingkan diri dengan keadaan hamil {ke tempat yang jauh} jauh dari manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Saat Maryam mengandung Isa, dia khawatir akan menghadapi celaan, maka dia pun menjauh dari manusia ke tempat yang terpencil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 22: Lalu malaikat Jibril meniupkan roh ke leher bajunya, kemudian tiupan itu masuk ke farji Maryam sehingga ia mengandung dengan izin Allah Ta’ala. Yakni karena khawatir orang-orang menuduh yang tidak-tidak terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 22",
    "description": "Ayat berikut menguraikan kondisi psikologis maryam ketika hamil. Proses kehamilannya dimulai ketika jibril meniupkan roh ke tubuh maryam, maka sesudah itu dia mengandung. Mengetahui dirinya hamil, lalu dia mengasingkan diri dengan kandungannya itu ke tempat yang jauh dari tempatnya menetap selama ini. 23. Setelah beberapa lama tinggal di tempatnya yang baru, kemudian maryam mulai merasakan rasa sakit akibat kontraksi yang menjadi pertanda dia akan melahirkan. Keadaan ini memaksanya bersandar pada pangkal pohon kurma. Ketika itu, dia membayangkan cemoohan orangorang di sekelilingnya saat mereka tahu dia melahirkan anak tanpa suami. Dia berkata, 'wahai, betapa baiknya bila aku mati sebelum kehamilanku ini dan aku menjadi seorang yang tidak diperhatikan dan dilupakan selamanya. '."
  }
]