[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Rasa kontraksi untuk melahirkan memaksanya berhenti pada sebatang pohon kurma. Lalu dia berkata, ”aduhai, alangkah baiknya bila aku mati saja sebelum hari ini, dan aku menjadi sesuatu yang tidak dikenal juga tidak disebut-sebut, serta tidak diketahui siapa aku sebenarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Kemudian ia pun ditimpa rasa sakit melahirkan, sehingga memaksanya untuk bersandar pada pohon kurma. Maryam berkata, \"Duhai, alangkah baiknya bila aku mati sebelum hari ini, dan aku menjadi sesuatu yang dilupakan agar aku tidak disangka berbuat buruk.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. فَأَجَآءَهَا الْمَخَاضُ (Maka rasa sakit akan melahirkan anak memaksa ia) Yakni rasa sakit ketika melahirkan. إِلَىٰ جِذْعِ النَّخْلَةِ((bersandar) pada pangkal pohon kurma) Yakni memaksanya untuk menuju ke batang pohon kurma kering, berharap mendapat sesuatu yang dapat digunakan untuk bersandar sebagaimana orang hamil yang bersandar karena rasa sakit saat melahirkan. قَالَتْ يٰلَيْتَنِى مِتُّ قَبْلَ هٰذَا(dia berkata: “Aduhai, alangkah baiknya aku mati sebelum ini) Maryam berharap kematian karena takut akan dikira telah berbuat keburukan menurut agamanya. وَكُنتُ نَسْيًا مَّنسِيًّا(dan aku menjadi barang yang tidak berarti, lagi dilupakan”) Makna (النسي) yakni sesuatu yang remeh yang terlupakan dan tidak menimbulkan kesedihan jika hilang, seperti barang semisal benang atau tali."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ يَٰلَيْتَنِى مِتُّ قَبْلَ هَٰذَا } \"\"Aduhai, alangkah baiknya aku mati sebelum ini\" Kalimat ini diucapkan oleh perempuan shalihah saat sedang merasakan sakit, bahkan ia saja tidak mampu menahan ucapannya itu pada saat-saat susah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Maka rasa sakit akan melahirkan anak memaksa ia bersandar pada pangkal pohon kurma, dia berkata: \"Aduhai, alangkah baiknya aku mati sebelum ini, sebab malu dan takut atas cacian orang-orang. Sehingga aku menjadi orang yang tidak berarti, dan dilupakan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Rasa sakit melahirkan} rasa sakit melahirkan {memaksanya} memaksanya {pada pangkal pohon kurma. Dia berkata,“Alangkah sebaiknya aku mati sebelum ini dan menjadi seorang yang tidak diperhatikan dan dilupakan”} sesuatu yang diabaikan, tidak dikenal, dan tidak diingat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Ketika masa kelahiran sudah deat, rasa sakit menjelang persalinan memaksanya bersandar pada pangkal pohon kurma. Tatkala dia mulai didera rasa sakit (menjelang) melahirkan, perihnya jauh dari makanan dan minuman, pedihnya hatinya karena komentar miring orang banyak, dan mencemaskan kemampuannya untuk bersabar, maka dia berandai-andai, bahwa dia mati sebelum mengalami kejadian ini, hingga menjadi tak berarti lagi dilupakan (oleh manusia), dan tidak disebut-sebut (lagi). Pengandaian itu tertolak dari kondisi yang merisaukan (nya) tadi, padahal tidak ada nilai kebaikan dan kemaslahatan sama sekali baginya saat menginginkan kematian itu. Kebaikan hanya terwujud dengan menghargai apa yang telah terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 23: Maryam merasakan rasa sakit melahirkan, rasa lapar tidak ada makanan dan minuman, ditambah rasa sakit hatinya terhadap kata-kata dan tuduhan manusia terhadapnya serta khawatir tidak mampu bersabar, akhirnya Maryam mengucapkan kata-kata di atas. Ucapan pengandaian di atas didasari terhadap hal yang dikhawatirkannya itu, namun sesungguhnya pengandaian ini tidak ada kebaikan dan maslahatnya, bahkan kebaikan dan maslahat terdapat pada taqdir yang akan terjadi itu. Ketika itulah, malaikat menenteramkan hatinya, menenangkan kegelisahannya dan memanggilnya dari tempat yang rendah sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 23",
    "description": "Setelah beberapa lama tinggal di tempatnya yang baru, kemudian maryam mulai merasakan rasa sakit akibat kontraksi yang menjadi pertanda dia akan melahirkan. Keadaan ini memaksanya bersandar pada pangkal pohon kurma. Ketika itu, dia membayangkan cemoohan orangorang di sekelilingnya saat mereka tahu dia melahirkan anak tanpa suami. Dia berkata, 'wahai, betapa baiknya bila aku mati sebelum kehamilanku ini dan aku menjadi seorang yang tidak diperhatikan dan dilupakan selamanya. '24. Keluhan maryam terdengar oleh jibril. Selang beberapa lama kemudian maryam pun melahirkan. Maka dia, yaitu jibril, berseru kepadanya dari tempat yang rendah, 'wahai maryam, janganlah engkau bersedih hati karena kondisimu ini. Sesungguhnya tuhanmu telah menjadikan anak sungai di bawahmu agar kamu dapat membersihkan diri setelah melahirkan."
  }
]