[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka jibril atau isa memanggilnya, ”janganlah engkau bersedih hati, sesungguhnya tuhanmu telah menjadikan anak sungai dibawahmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka Isa menyerunya dari bawah kedua kakinya, \"Janganlah engkau bersedih! Sungguh Tuhanmu telah menjadikan anak sungai di bawahmu yang engkau bisa meminum darinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Kemudian Jibril memanggilnya dari tempat yang lebih rendah dari tempat Maryam untuk meringankan cobaannya dan memberinya kabar gembira dan pengajaran: “Hai Maryam, janganlah kamu bersedih, Allah telah menciptakan aliran air di bawahmu dan mengalir di depanmu, dan goyangkanlah batang pohon kurma itu agar berjatuhan kepadamu kurma segar dan matang. Hal ini agar kamu dapat makan dan minum, dan menenangkan matamu dengan tidur, serta menentramkan hatimu dari kesusahan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَنَادَىٰهَا مِن تَحْتِهَآ (Maka Jibril menyerunya dari tempat yang rendah) Yakni Jibril yang berada di bukit kecil menyeru Maryam setelah dia mendengar perkataannya. Pendapat lain mengatakan bahwa Jibril berada di bawah pohon kurma. Dan pendapat lain mengatakan orang yang menyeru adalah Isa. قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا (sesungguhnya Tuhanmu telah menjadikan anak sungai di bawahmu) Makna (السري) adalah sungai kecil. Pendapat lain mengatakan yang dimaksud adalah Isa karena makna lain dari (السري) adalah lelaki yang agung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Maka Jibril menyerunya dari tempat yang rendah: \"Janganlah kamu bersedih hati, sesungguhnya Tuhanmu telah menjadikan anak sungai di bawahmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berseru kepadanya dari tempat yang rendah} lalu Isa menyerunya dari bawah kedua kakinya {“Janganlah bersedih. Sungguh Tuhanmu telah menjadikan di bawahmu anak sungai} anak sungai yang bisa kamu gunakan untuk minum"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Ketika itu, malaikat datang menenangkan rasa kekhawatirannya dan meneguhkan hati serta memanggilnya dari bawah. Mungkin saja malaikat berada di tempat yang lebih rendah daripada tempat Maryam. Malaikat mengatakan, “Janganlah engkau bersedih\" maksudnya jangan pula menghiraukan (keadaanmu). “Sesungguhnya Rabbmu telah menjadikan anak sungai di bawahmu,” maksudnya sungai yang bisa engkau minum airnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 24: Di mana engkau dapat meminum airnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 24",
    "description": "Keluhan maryam terdengar oleh jibril. Selang beberapa lama kemudian maryam pun melahirkan. Maka dia, yaitu jibril, berseru kepadanya dari tempat yang rendah, 'wahai maryam, janganlah engkau bersedih hati karena kondisimu ini. Sesungguhnya tuhanmu telah menjadikan anak sungai di bawahmu agar kamu dapat membersihkan diri setelah melahirkan. 25. Pegang dan goyanglah sekuat tenagamu pangkal pohon kurma itu ke arahmu, niscaya pohon itu akan menggugurkan buahnya yang masak kepadamu agar kamu dapat memakannya."
  }
]