[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan gerak-gerakanlah batang pohon kurma itu, niscaya pohon itu akan menjatuhkan kepadamu buah kurma mengkal yang segar yang terpetik saat itu juga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan peganglah pangkal pohon kurma itu dan goyangkanlah niscaya pohon itu akan menggugurkan buah kurma yang mengkal dan ranum kepadamu saat itu juga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَهُزِّىٓ إِلَيْكِ بِجِذْعِ النَّخْلَةِ (Dan goyanglah pangkal pohon kurma itu ke arahmu) Yakni pegang dan goyangkanlah batang pohon itu. تُسٰقِطْ عَلَيْكِ رُطَبًا جَنِيًّا (niscaya pohon itu akan menggugurkan buah kurma yang masak kepadamu) Yakni kurma yang sudah layak untuk dipetik, yang lezat dan segar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَهُزِّىٓ إِلَيْكِ بِجِذْعِ ٱلنَّخْلَةِ تُسَٰقِطْ عَلَيْكِ رُطَبًا جَنِيًّا } Allah memerintahkan Marym (seorang perempuan yang lemah) untuk menggoyangkan pangkal pohon kurma sedangkan laki-laki pun berat melakukannya, namun hal itu mampu ia lakukan atas kehendak Allah untuk menurunkan rezekinya kepada Maryam; agar manusia memahami pentingnya mengambil sebab suatu kejadian, 2 ). Perhatikan dua point penting ini yang menjelaskan tentang kemuliaan Maryam : - Ia diperintahkan untuk menggoyangkan pangkal pohon dan bukan bagian atas pohon, dan dengan cara itu bahkan biasanya tidak memberikan hasil yang baik sekalipun dilakukan oleh pria kuat. - Bahwasanya buah ruthob jika berjatuhan dari pohonnya, kemungkinan besar ia akan hancur; namun tidak dalam kejadian Maryam yang menggoyangkan pohon itu seakan-akan buah yang jatuh masih segar yang dipetik dengan tangan. 3 ). Pada musim dingin orang-orang Nashrani merayakan hari kelahiran Isa al-Masih, padahal di dalam al-Quran dijelaskan bahwa hari kelahiran al-Masih pada musim berbuahnya kurma yang bertepatan dengan musim panas, sebagaimana yang maksudkan oleh firman Allah : { وَهُزِّىٓ إِلَيْكِ بِجِذْعِ ٱلنَّخْلَةِ تُسَٰقِطْ عَلَيْكِ رُطَبًا جَنِيًّا } maka kesalahan mereka ketika merayakannya pada musim dingin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Dan goyangkanlah pangkal pohon kurma itu ke arahmu, niscaya pohon itu akan menggugurkan buah kurma yang masak kepadamu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Goyanglah} gerakkannlah {pangkal pohon kurma itu ke arahmu, maka pohon itu akan menjatuhkan kepadamu buah kurma yang masak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Dan goyangkanlah pangkal pohon kurma itu ke arahmu, niscaya pohon itu akan menjatuhkan buah kurma yang masak kepadamu,” yaitu kurma yang segar, lezat, dan bermanfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 25",
    "description": "Pegang dan goyanglah sekuat tenagamu pangkal pohon kurma itu ke arahmu, niscaya pohon itu akan menggugurkan buahnya yang masak kepadamu agar kamu dapat memakannya. 26. Maka makan-lah buah kurma yang berjatuhan itu dan minum-lah air dari anak sungai tersebut. Nikmatilah dan bersenanghatilah engkau dengan kelahiran putramu. Jika engkau melihat seseorang dengan kondisimu sekarang, maka katakanlah kepadanya dengan isyarat, 'sesungguhnya aku telah bernazar berpuasa, yakni menahan diri untuk tidak berbicara, untuk tuhan yang maha pengasih, maka aku tidak akan berbicara dengan siapa pun pada hari ini. '."
  }
]