[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka makanlah olehmu dari kurma mengkal tersebut dan minumlah air itu, dan bersikaplah nyaman dengan anak yang akan lahir. Jika engkau melihat seseorang dari manusia bertanya kepadamu tentang keadaan dirimu, maka katakanlah kepadanya, ’sesungguhnya aku telah mewajibkan atas diriku diam karena Allah, maka aku tidak akan berkomunikasi dengan siapapun dari manusia pada hari ini.’ Dahulu, diam termasuk bentuk ibadah dalam syariat mereka, namun tidak berlaku pada syariat Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Maka makanlah rutab itu, minumlah dari air itu, dan bergembiralah dengan kelahiran sang anak, jangan bersedih! Jika engkau melihat seseorang lalu bertanya tentang anak itu, maka katakanlah, \"Sesungguhnya aku telah mewajibkan atas diriku untuk Tuhanku agar tidak berbicara, dan hari ini aku tidak akan berbicara dengan seorang manusia pun.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Agar kamu dapat makan kurma yang bermanfaat, minum air tawar, dan jiwamu menjadi tentram dengan kehadiran anak ini. Dan jika seseorang bertanya kepadamu tentang anak ini, maka jawablah: “Aku bernazar kepada Allah untuk tidak berbicara dengan seorangpun.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَكُلِى (maka makanlah) Makanlah kurma itu. وَاشْرَبِى(dan minum) Dari sungai kecil itu. وَقَرِّى عَيْنًا ۖ( dan bersenang hatilah kamu) Yakni bergembiralah dan jauhkanlah kesedihanmu. فَقُولِىٓ إِنِّى نَذَرْتُ لِلرَّحْمٰنِ صَوْمًا (maka katakanlah: “Sesungguhnya aku telah bernazar berpuasa untuk Tuhan Yang Maha Pemurah) Maksud puasa di sini adalah puasa dari berbicara. فَلَنْ أُكَلِّمَ الْيَوْمَ إِنسِيًّا(maka aku tidak akan berbicara dengan seorang manusiapun pada hari ini) Yakni Maryam tidak berbicara dangan orang lain setelah memberitahu mereka tentang nazarnya itu. Pendapat lain mengatakan Maryam tidak memberitahu mereka dengan kata-kata, namun hanya dengan isyarat yang dapat dimengerti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Maka makanlah kurma muda itu, minumlah air dari sungai itu, dan bersenang hatilah kamu dan jangan bersedih. Jika kamu melihat seorang manusia, maka berilah kabar gembira kepadanya: \"Sesungguhnya aku telah bernazar berpuasa untuk Tuhan Yang Maha Pemurah, maka aku tidak akan berbicara dengan seorang manusia pun pada hari ini\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lunak lagi siap dipanen pada waktunya {Makan, minum, dan bersukacitalah} bergembiralah dirimu {Jika kamu melihat} jika kamu melihat {seseorang, katakanlah,‘Sesungguhnya aku telah bernazar} aku mewajibkan atas diriku sendiri {kepada Tuhan Yang Maha Pengasih untuk puasa} diam tidak berbicara {Maka pada hari ini aku tidak akan berbicara kepada siapapun”} satu pun manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Maka makanlah,” dari kurma itu “dan minumlah,” dari (air) sungai itu “bersenang hatilah kamu,” dengan kehadiran Nabi Isa. Ini adalah pelipur lara baginya, dan sisi selamat (terhindar) dari rasa sakit saat melahirkan, dan memperoleh makan dan minum serta ketenangan. Sedangkan (penghibur) baginya dari masalah ejekan manusia, maka Allah memerintahkannya (jika melihat seseorang) agar mengatakan dengan bahasa isyarat, “Sesungguhnya aku telah bernadzar berpuasa untuk Dzat Yang Maha Pemurah,” maksudnya, janganlah engkau mengajak mereka berbicara agar engkau bisa selamat dari perkataan dan omongan mereka. Pada saat itu, sudah dimaklumi bahwa diam merupakan sejenis ibadah yang disyariatkan. Maryam tidak diperintahkan untuk berbincang-bincang dengan mereka dalam rangka menepis tuduhan dari dirinya, karena masyarakat tidak mempercayainya, dan tidak ada manfaatnya, serta supaya rehabilitasi namanya melalui penjelasan Nabi Isa saat masih dalam ayunan menjadi kesaksian yang paling kuat atas kesuciannya. Karena, sesungguhnya kemunculan seorang wanita dengan membawa anak tanpa memiliki suami dan mengaku bahwa si anak bukan berasal dari seseorang (lelaki), termasuk bualan kosong yang besar, yang meskipun telah dihadirkan beberapa saksi, niscaya si wanita itu tidak akan dipercayai. Lalu, Allah menjadikan bukti kejadian luar biasa ini dengan peristiwa yang serupa (luar biasa pula), yaitu ucapan Nabi Isa pada saat masih mungil sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 26: Yakni kurma yang matang tersebut. Dari anak sungai tersebut. Dengan anakmu itu. Ucapan ini untuk menenteramkannya yang menunjukkan akan selamatnya dari derita melahirkan, dan akan memperoleh makanan dan minuman. Adapun untuk menenteramkannya dari ucapan manusia, maka diperintahkan kepadanya apabila ia melihat seseorang yang mempertanyakannya agar berkata dengan isyarat, bahwa dirinya sedang menahan diri dari berbicara dengan manusia. Lalu mempertanyakan kamu. Yakni menahan diri dari berbicara tentangnya. Maksudnya, Maryam tidak berbicara dengan manusia agar ia dapat beristirahat terhadap ocehan mereka. Ketika itu, sudah masyhur, bahwa diam termasuk ibadah yang disyari’atkan. Maryam tidak diperintahkan menjawab manusia ketika itu untuk membela dirinya, karena manusia tidak akan membenarkannya, dan lagi tidak ada faedahnya. Di samping itu agar pembersihan dirinya melalui perkataan Nabi Isa ‘alaihis salam ketika masih dalam buaian, di mana Nabi Isa merupakan saksi terkuat yang menunjukkan kebersihan ibunya. Hal itu, karena seorang wanita yang datang membawa anak tanpa ada bapaknya termasuk dakwaan terkuat yang jika diadakan beberapa orang saksi yang menunjukkan kebersihan dirinya tentu tidak akan diterima. Oleh karena itu, dijadikan bukti kebersihannya dengan sesuatu yang luar biasa, yaitu berbicaranya Nabi Isa ‘alaihis salam ketika masih dalam buaian. Sungguh dalam hikmah Allah dan sungguh luas ilmu-Nya, dan kita menjadi saksi terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 26",
    "description": "Maka makan-lah buah kurma yang berjatuhan itu dan minum-lah air dari anak sungai tersebut. Nikmatilah dan bersenanghatilah engkau dengan kelahiran putramu. Jika engkau melihat seseorang dengan kondisimu sekarang, maka katakanlah kepadanya dengan isyarat, 'sesungguhnya aku telah bernazar berpuasa, yakni menahan diri untuk tidak berbicara, untuk tuhan yang maha pengasih, maka aku tidak akan berbicara dengan siapa pun pada hari ini. '27. Mendengar kata-kata jibril yang meneduhkan, hati maryam menjadi tenang dan kesedihannya hilang. Kemudian dia membawanya, yaitu bayi isa, kepada kaumnya dengan menggendongnya secara terang-terangan tanpa malu sedikit pun. Ketika kaumnya melihat hal itu, mereka berkata, 'wahai maryam, sungguh engkau telah membawa sesuatu yang sangat mungkar bagi diri dan keluargamu karena engkau telah melahirkan bayi tanpa suami. '."
  }
]