[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu maryam datang menemui kaumnya dengan membawa bayinya dari tempat yang jauh. Ketika orang-orang melihatnya dalam keadaan demikian, mereka berkata kepadanya, ”wahai maryam, sesungguhnya kamu telah melakukan sesuatu perkara besar yang amat buruk. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kemudian Maryam membawa bayinya kepada kaumnya dengan menggendongnya. Lalu dengan nada mengingkari, kaumnya berkata kepadanya, \"Wahai Maryam! Sungguh engkau telah membawa sesuatu yang besar lagi mungkar karena engkau datang menggendong anak laki-laki yang lahir tanpa ayah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-28. Kemudian Maryam mendatangi kaumnya dengan membawa anaknya, Isa. Ketika mereka melihatnya, mereka merasa heran dan mengingkarinya: “Sungguh kamu telah datang dengan membawa sesuatu kemungkaran yang besar. Hai Saudari orang shalih yang bernama Harun, ayahmu bukanlah orang yang suka berbuat dosa dan ibumu tidak pernah terjerumus ke dalam kekejian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. فَأَتَتْ بِهِۦ (Maka Maryam datang membawa anak itu) Yakni dengan membawa Isa. تَحْمِلُهُۥ ۖ (dengan menggendongnya) Menggendongnya dari tempat jauh yang dipakainya untuk menyendiri. قَالُوا۟( Kaumnya berkata) Saat mereka melihat anak itu mereka berkata dengan penuh keingkaran. يٰمَرْيَمُ لَقَدْ جِئْتِ (Hai Maryam, sesungguhnya kamu telah melakukan) Yakni telah berbuat. شَيْـًٔا فَرِيًّا(sesuatu yang amat mungkar) Sesuatu yang besar kemungkarannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "27-28 1 ). Perhatikan bahaya dari sikap terburu-buru dan menunduh orang yang tidak bersalah (padahal yang terlihat Maryam adalah perempuan baik) dengan tuduhan yang keji, hanya dengan membandingkan dengan perbandingan yang tidak didasari oleh bukti yang kuat. 2 ). { يَا أُخْتَ هَارُونَ مَا كَانَ أَبُوكِ امْرَأَ سَوْءٍ وَمَا كَانَتْ أُمُّكِ بَغِيًّا } \"Hai saudara perempuan Harun, ayahmu sekali-kali bukanlah seorang yang jahat dan ibumu sekali-kali bukanlah seorang pezina\" coba mentadabburi bagaimana pihak-pihak kerabat langsung digabungkan dalam ayat ini; ayat ini menjelaskan besarnya pengaruh mereka terhadap baik dan rusaknya seorang perempuan, contoh lainnya terdapat dala firman Allah : { وَكَانَ أَبُوهُمَا صَٰلِحًا } \"sedang ayahnya adalah seorang yang saleh\" [ Al-Kahfi : 82 ]"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Maka Maryam membawa Isa kepada kaumnya dengan menggendongnya dari tempat yang jauh. Ketika kaumnya melihatnya mereka berkata kepada Maryam dengan maksud mengingkari: \"Hai Maryam, sesungguhnya kamu telah melakukan sesuatu yang tidak biasa dan amat mungkar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia datang membawa bayinya kepada kaumnya dengan menggendongnya. Mereka berkata,“Wahai Maryam, sungguh kamu benar-benar telah membawa sesuatu yang sangat mungkar} perkara besar yang dibuat-buat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Maksudnya, setelah bersih dari masa nifasnya, Maryam mendatangi kaumnya sambil membawa Isa. (Keberaniannya untuk datang) lantaran dia mengetahui kesucian dan kebersihan dirinya (dari zina). Ia datang tanpa peduli, lagi tanpa beban. Kaumnya mengatakan, “Sesungguhnya kamu telah melakukan sesuatu yang amat mungkar,” yaitu dosa besar lagi bejat. Maksud mereka adalah perbuatan zina. Alangkah terpeliharanya dia dari perbuatan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 27: Setelah Maryam selesai dari nifasnya. Maksud mereka adalah perbuatan zina, karena ia membawa seorang anak tanpa bapak. Mereka tidak memperhatikan lagi terhadap kemasyhuran dirinya yang bersih dan suci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 27",
    "description": "Mendengar kata-kata jibril yang meneduhkan, hati maryam menjadi tenang dan kesedihannya hilang. Kemudian dia membawanya, yaitu bayi isa, kepada kaumnya dengan menggendongnya secara terang-terangan tanpa malu sedikit pun. Ketika kaumnya melihat hal itu, mereka berkata, 'wahai maryam, sungguh engkau telah membawa sesuatu yang sangat mungkar bagi diri dan keluargamu karena engkau telah melahirkan bayi tanpa suami. '28. Tidak puas mencemoohan maryam, mereka pun merendahkannya dengan menyebut keluarganya. Mereka berkata, 'wahai saudara perempuan harun! ayahmu dalam kehidupannya bukan seorang yang buruk perangai dan ibumu bukan pula seorang perempuan pezina. Bagaimana mungkin engkau melakukan hal yang memalukan ini''."
  }
]