[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai saudarinya orang shalih, harun, ayahmu bukanlah seorang lelaki yang buruk yang melakukan perbuatan keji, dan ibumu dahlu bukanlah seorang wanita berperilaku buruk yang melakukan perzinaan. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Wahai wanita yang menyerupai Harun (seorang yang saleh) dalam ibadahnya, sungguh ayahmu sama sekali bukan seorang pezina, dan ibumu bukan seorang pezina. Engkau benar-benar berasal dari keluarga yang suci lagi terkenal dengan kesalehannya, lalu bagaimana bisa engkau melahirkan seorang anak laki-laki tanpa ayah?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. يٰٓأُخْتَ هٰرُونَ (Hai saudara perempuan Harun) Harun adalah lelaki shalih yang hidup pada zaman itu. Terdapat pendapat mengatakan makna ayat ini adalah Wahai orang yang kami kira seperti Harun dalam ibadah, bagaimana kamu melakukan perbuatan yang seperti ini (zina)? مَا كَانَ أَبُوكِ امْرَأَ سَوْءٍ وَمَا كَانَتْ أُمُّكِ بَغِيًّا (ayahmu sekali-kali bukanlah seorang yang jahat dan ibumu sekali-kali bukanlah seorang pezina) Lalu dari mana kamu belajar berbuat keburukan seperti ini?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "27-28 1 ). Perhatikan bahaya dari sikap terburu-buru dan menunduh orang yang tidak bersalah (padahal yang terlihat Maryam adalah perempuan baik) dengan tuduhan yang keji, hanya dengan membandingkan dengan perbandingan yang tidak didasari oleh bukti yang kuat. 2 ). { يَا أُخْتَ هَارُونَ مَا كَانَ أَبُوكِ امْرَأَ سَوْءٍ وَمَا كَانَتْ أُمُّكِ بَغِيًّا } \"Hai saudara perempuan Harun, ayahmu sekali-kali bukanlah seorang yang jahat dan ibumu sekali-kali bukanlah seorang pezina\" coba mentadabburi bagaimana pihak-pihak kerabat langsung digabungkan dalam ayat ini; ayat ini menjelaskan besarnya pengaruh mereka terhadap baik dan rusaknya seorang perempuan, contoh lainnya terdapat dala firman Allah : { وَكَانَ أَبُوهُمَا صَٰلِحًا } \"sedang ayahnya adalah seorang yang saleh\" [ Al-Kahfi : 82 ]"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Hai saudara perempuan Harun dalam hal menjaga diri dan ketaatan dalam ibadah. Dia adalah orang saleh dari bani Israil. Dia adalah nabi dan juga saudara Musa ‘alaihimas salam yang terkenal dengan ketenangan dan kebaikan. Ayahmu sekali-kali bukanlah seorang yang jahat dan ibumu juga bukanlah seorang pezina. Lalu darimana engkau dapatkan anak ini?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai saudara perempuan Harun} wahai saudara Harun dalam ibadah {ayahmu bukan seorang yang berperangai buruk} seorang pezina {dan ibumu bukan seorang perempuan pezina”} pezina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Hai saudara perempuan Harun,” zahir ayat ini menunjukkan bahwa Harun adalah saudara aslinya, sehingga mereka menisbatkannya kepada Harun. [Kebiasaan mereka pada zaman dahulu adalah menggunakan nama-nama para nabi. Akan tetapi, Harun ini bukan Harun putra ‘Imran, saudara Nabi Musa, karena antara keduanya ada jarak masa berabad-abad lamanya]. “Ayahmu sekali-kali bukanlah seorang penjahat, dan ibumu sekali-kali bukanlah seorang pezina,” maksudnya tidaklah dua orang tuamu melainkan orang-orang shalih, selamat dari perbuatan jelek yang mereka isyaratkan (yaitu zina). Maksud ucapan mereka, “Kenapa sifatmu berbeda dengan sifat mereka berdua, dengan melakukan perbuatan yang tidak pernah mereka lakukan?” hal ini disebabkan biasanya, anak keturunan itu mengikuti sebagian sifat baik atau buruk orang tua. Maka mereka merasa heran berdasarkan pengetahuan yang ada dalam hati mereka, bagaimana mungkin perbuatan ini terjadi pada Maryam?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 28: Maryam dipanggil saudara perempuan Harun, karena ia seorang wanita yang saleh seperti kesalehan Nabi Harun ‘alaihis salam. Namun menurut Syaikh As Sa’diy, bahwa Maryam memang saudara perempuan Harun, namun Harun di sini bukan Harun bin Imran saudara Nabi Musa, karena antara keduanya berbeda jauh abadnya. Ketika itu, sudah biasa menamai anak-anak yang lahir di kalangan mereka dengan nama para nabi. Hal itu, karena sudah biasa, bahwa keturunan itu mengikuti orang tuanya dalam kesalehan. Oleh karena itu, mereka heran terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 28",
    "description": "Tidak puas mencemoohan maryam, mereka pun merendahkannya dengan menyebut keluarganya. Mereka berkata, 'wahai saudara perempuan harun! ayahmu dalam kehidupannya bukan seorang yang buruk perangai dan ibumu bukan pula seorang perempuan pezina. Bagaimana mungkin engkau melakukan hal yang memalukan ini''29. Maryam tidak gentar menghadapi cemoohan kaumnya, maka untuk menjawabnya dia menunjuk kepada anak yang sedang digendongnya. Melihat isyaratnya untuk bertanya kepada anak tersebut, mereka berkata, 'bagaimana mungkin kami akan berbicara dengan bayi yang masih dalam ayunan itu''."
  }
]