[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maryam memberikan isyarat kepada bayinya, isa, agar mereka bertanya langsung dan berbicara kepadanya. Mereka menjawab dengan nada pengingkaran kepada maryam, ”bagaimana mungkin kami akan berbicara dengan seorang yang berada di buaian ibunya berupa anak kecil yang masih disusui?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Maka ia pun menunjuk kepada anaknya Isa -'alaihissalām- yang masih bayi yang masih di ayunan. Kaumnya berkata kepadanya dengan penuh keheranan, \"Bagaimana bisa kami berbicara dengan seorang anak yang masih dalam ayunan?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Namun Maryam tidak menjawab perkataan mereka, tetapi dia menunjuk kepada Isa agar mereka bertanya kepadanya, sehingga ini juga mengundang keingkaran mereka: “Bagaimana kami akan berbicara dengan bayi yang masih dalam buaian?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَأَشَارَتْ إِلَيْهِ ۖ (maka Maryam menunjuk kepada anaknya) Yakni kepada Isa. Maryam cukup menunjuk Isa tanpa menyuruhnya untuk berbicara, sebab Maryam telah bernazar kepada Allah untuk berpuasa dari bicara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Maka Maryam menunjuk kepada anaknya agar anaknya yang menjawab. Mereka berkata: \"Bagaimana kami akan berbicara dengan anak kecil yang masih di dalam ayunan?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menunjuk kepada bayinya} Lalu Maryam mengisyaratkan kepada Isa AS untuk berbicara {Mereka berkata,“Bagaimana mungkin kami berbicara dengan anak kecil yang masih dalam ayunan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Maka Maryam menunjuk,” maka Maryam mengacungkan isyarat kepada mereka “kepada anaknya” kea rah Isa. Maksudnya, “Berbicaralah kalian dengan dia!” Maryam memberikan isyarat karena dia diperintahkan ketika hendak berbicara dengan kaumnya, agar mengatakan, “Sesungguhnya aku telah bernadzar berpuasa untuk Dzat Yang Maha Pemurah, maka aku tidak akan berbicara dengan seorang manusiapun pada hari ini,” (Maryam:26). Dikala Maryam memberikan isyarat kepada mereka agar melakukan komunikasi dengan Isa, mereka terheran-heran dan mengatakan, “Bagaimana kami akan berbicara dengan anak kecil yang masih dalam ayunan?” karena hal itu merupakan perkara yang tidak biasa (aneh), dan tidak pernah terjadi pada seorang pun pada usia itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 29",
    "description": "Maryam tidak gentar menghadapi cemoohan kaumnya, maka untuk menjawabnya dia menunjuk kepada anak yang sedang digendongnya. Melihat isyaratnya untuk bertanya kepada anak tersebut, mereka berkata, 'bagaimana mungkin kami akan berbicara dengan bayi yang masih dalam ayunan itu''30. Isa yang berada dalam gendongan ibunya mendengar pembicaraan kaumnya. Dia berkata, 'sesungguhnya aku adalah hamba Allah yang mahakasih. Dia akan memberiku sebuah kitab injil sesuai ketetapan-Nya, dan dia juga akan menjadikan aku seorang nabi untuk menyampaikan ajaran-ajaran-Nya kepada bani israil."
  }
]