[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu, ketika dia berdoa memohon kepada tuhannya dengan suara lirih, agar menjadi lebih sempurna keikhlasannya kepada Allah dan lebih mendatangkan harapan besar di kabulkannya doa tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Yaitu ketika ia berdoa kepada Tuhannya -Subḥānahu- dengan suara yang lembut agar lebih dikabulkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Ketika dia berdoa kepada Tuhannya dengan suara yang samar yang hampir tidak terdengar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. إِذْ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيًّا (tatkala ia berdoa kepada Tuhannya dengan suara yang lembut) Nabi Zakariya melembutkan suara doa yang ia panjatkan kepada Allah karena itu lebih menjauhkan diri dari perbuatan riya. Pendapat lain mengatakan beliau melakukan hal itu karena telah lemah dan tua sehingga tidak mampu mengeraskan suaranya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Melembutkan suara ketika berdoa dan meminta, adalah cara yang terbaik ketika bermunajat kepada Allah, dan merupakan keimanan bahwa Allah maha mendengar, dan cara inilah yang para utusan Allah bermunajat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Yaitu tatkala ia berdoa kepada Tuhannya di tengah malam dengan suara yang lembut. Sebab doa seperti itu adalah doa yang cepat diijabah, dan jauh dari perbuatan riya’."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia berdoa} berdoa {kepada Tuhannya dengan suara yang lirih} dengan doa yang dirahasiakan dari manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Ketika Nabi Zakaria menyadari kelemahan pada dirinya dan khawatir akan meninggal, sementara belum ada orang yang menempati tugasnya untuk mendakwahi umat manusia kepada Rabb mereka dan menasehati mereka, maka beliau mengadukan kelemahan batin dan fisiknya itu kepada Rabbnya . Beliau berdoa kepada Allah dengan suara lembut, supaya doanya lebih sempurna, lebih utama dan lebih paripurna keikhlasannya. Beliau mengatakan, “Wahai Rabbku, sesungguhnya tulangku telah lemah,” maksudnya, sudah lemah dan lunglai. Jika tulang yang merupakan penyangga badan sudah lemah, maka anggota badan yang lain pasti ikut melemah. “Kepalaku telah ditumbuhi uban,” karena (tumbuhnya) uban merupakan pertanda kelemahan dan masa tua, utusan dan duta kematian serta peringatan akan dekatnya kematian. Maka Zakarian menjadikan kelemahan dan ketidakberdayaannya sebagai wasilah (perantara) dalam berdoa kepada Allah. Ini merupakan salah satu bentuk wasilah yang dicintai oleh Allah, karena menunjukkan berlepas diri dari daya dan kekuatan (pribadi) dan ketergantungan hati hanya kepada daya dan kekuatan Allah. “Dan aku belum pernah kecewa dalam berdoa kepadaMu, wahai Rabbku.” Wahai Rabbku, Engkau tidak pernah menolak permintaanku dengan hampa dan menjadi terhalang-halangi dari pengabulan. Bahkan Engkau selalu menyambutku dan mengabulkan permohonanku. Dan kelembutanMu selalu silih berganti datang kepadaku, (begitu juga) kebaikanMu selalu sampai kepadaku. Ini merupakan satu bentuk tawasul kepada Allah dengan (penyebutan) nikmat yang Allah anugerahkan kepadanya dan pengabulan doa-doanya yang terdahulu. Jadi, Nabi Zakaria berdoa kepada Allah yang telah memberinya kebaikan pada masa yang lalu agar menyempurnakan curahan kebaikanNya pada masa akan datang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 3: Di tengah malam, karena pada waktu itu lebih cepat diijabah (dikabulkan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 3",
    "description": "Yaitu rahmat tuhanmu kepadanya ketika dia berdoa dengan khusyuk kepada tuhannya dan mengajukan permohonan yang disampaikannya dengan suara yang lembut dan penuh pengharapan. 4. Dengan santun dan suara yang lembut dia berkata, 'ya tuhanku yang maha pengasih dan maha pemelihara, sungguh kini tulang belulangku telah menjadi lemah sehingga aku sering merasa letih, dan rambut kepalaku telah memutih seperti perak karena dipenuhi uban, pertanda bahwa aku telah berusia senja. Namun, aku tidak pernah putus asa dan aku belum pernah kecewa dalam berdoa kepada-Mu, ya tuhanku. Engkau adalah zat yang tidak pernah mengecewakan siapa pun."
  }
]