[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Isa berkata, sedang dia berada dalam buaiannya tengah menyusu, ”sesungguhnya aku adalah hamba Allah. Dia menetapkan untuk memberiku kitab, yaitu injil, dan menjadikanku sebagai seorang nabi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Isa -'alaihissalām- berkata, \"Sesungguhnya aku adalah hamba Allah, Dia memberiku kitab Injil, dan menjadikan aku salah seorang dari nabi-nabi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-33. Namun dengan izin Allah, Isa berbicara: “Aku adalah hamba Allah yang dimuliakan dengan kenabian, Dia akan menurunkan kepadaku kitab Injil dan menjadikanku seorang nabi, dan membuatku membawa banyak manfaat bagi setiap hamba di manapun aku berada. Allah memerintahkanku untuk senantiasa mendirikan shalat dan menunaikan zakat sepanjang hidupku. Dan Allah menjadikanku orang yang sangat berbakti kepada ibuku, dan Allah tidak menjadikanku orang yang angkuh dan berpaling dari-Nya. keselamatan dari Allah bagiku dari segala keburukan di hari kelahiran dan hari kematianku, serta di hari aku dihidupkan kembali saat keluar dari kubur.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قَالَ (Berkata Isa) Isa berkata. إِنِّى عَبْدُ اللهِ(Sesungguhnya aku ini hamba Allah) Kalimat pertama yang diucapkan adalah pengakuannya sebagai hamba Allah. Ini merupakan penjelasan bagi orang-orang Nasrani tentang kesesatan mereka dalam kepercayaan mereka bahwa dia memiliki sifat ketuhanan. ءَاتَىٰنِىَ الْكِتٰبَ(Dia memberiku Al Kitab) Yakni kitab Injil. Yakni Allah telah mentakdirkanku sebelum diciptakannya semesta alam bahwa aku akan menjadi seorang Nabi yang diturunkan kepadanya kitab."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Hikmah dibalik ucapan 'Isa disaat pertama kali berbicara : { قَالَ إِنِّى عَبْدُ ٱللَّهِ ءَاتَىٰنِىَ ٱلْكِتَٰبَ وَجَعَلَنِى نَبِيًّا } \"Berkata Isa: \"Sesungguhnya aku ini hamba Allah, Dia memberiku Al Kitab (Injil) dan Dia menjadikan aku seorang nabi,\" Wahb berkata : bahwasanya 'Isa mengakui dirinya menyembah kepada Allah; agar ia tidak dijadikan sebagai tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Berkatalah nabi Isa: \"Sesungguhnya aku ini hamba Allah –inilah awal mula pengenalan untuk beribadah hanya kepada Allah- Dia telah memberiku Al Kitab Injil sebagai bisyaroh untukku dan menjadikan aku seorang nabi yang diutus untuk menyampaikan petunjuk kepada manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Isa AS {“Sesungguhnya aku adalah hamba Allah. Dia memberiku kitab} Injil {dan menjadikan aku seorang nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Pada saat itulah, Isa putra Maryam mengatakan (padahal dia bayi yang berada di ayunan), “Sesungguhnya aku ini hamba Allah, Dia memberiku al-KItab (Injil), dan Dia menjadikanku seorang nabi.” Isa menerangkan kepada mereka dengan menggunakan predikat ‘hamba’, dan bahwa dia tidak memiliki sifat yang membuatnya pantas menjadi tuhan, atau anak tuhan. Mahatinggi Allah dari perkataan orang-orang Nasrani yang menyelisihi perkataan Isa dalam pernyataannya “Sesungguhnya aku ini hamba Allah,” sementara itu, mereka mengaku-ngaku mengikuti Nabi Isa. “Dia memberiku al-Kitab (Injil).” Allah telah menetapkan akan memberikan al-Kitab kepadaku “dan Dia menjadikanku seorang nabi,” lalu dia memberitahukan kepada mereka bahwa dirinya itu hamba Allah, dan bahwa Allah telah mengajarinya sebuah kitab dan memasukannya ke dalam golongan para nabi. Ini adalah penjelasan Isa tentang kesempurnaan dirinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 30: Nabi Isa ‘alaihis salam menerangkan keadaan dirinya, bahwa ia adalah hamba Allah, tidak memiliki sifat-sifat ketuhanan sekaligus bukan anak tuhan seperti yang disangka oleh orang-orang Nasrani, Mahasuci Allah dari apa yang diucapkan orang-orang Nasrani yang mengaku mengikuti Nabi Isa ‘alaihis salam tetapi menyelisihinya dalam hal ini. Inilah posisi yang Allah berikan kepada Isa ‘alaihis salam sebagaimana nabi-nabi yang lain, yaitu sebagai hamba Allah dan Rasul-Nya. Hamba yang menunjukkan tidak boleh disikapi dengan sikap ifrath (berlebihan) sampai dituhankan, dan rasul atau nabi yang menunjukkan tidak boleh disikapi dengan sikap tafrith (meremehkan), sehingga harus ditaati perintahnya, dijauhi larangannya, dibenarkan perkataannya dan beribadah kepada Allah sesuai contohnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 30",
    "description": "Isa yang berada dalam gendongan ibunya mendengar pembicaraan kaumnya. Dia berkata, 'sesungguhnya aku adalah hamba Allah yang mahakasih. Dia akan memberiku sebuah kitab injil sesuai ketetapan-Nya, dan dia juga akan menjadikan aku seorang nabi untuk menyampaikan ajaran-ajaran-Nya kepada bani israil. 31. Dan ketahuilah bahwa dia juga menjadikan aku seorang yang diberkahi dengan berbagai rahmat di mana dan kapan saja aku berada, dan dia juga memerintahkan kepadaku untuk menunaikan salat dan membayar zakat dari rezeki yang kudapatkan, selama aku hidup."
  }
]