[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia menjadikanku seorang yang berbakti kepada ibuku dan Dia tidak menjadikanku manusia yang sombong lagi celaka serta melanggar perintah tuhanku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan Dia menjadikanku berbakti kepada ibuku, dan tidak menjadikanku sombong dan durhaka dalam ketaatan terhadap Tuhanku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَبَرًّۢا بِوٰلِدَتِى (dan berbakti kepada ibuku) Isa pada saat itu mengetahui bahwa ia tidak memiliki ayah. وَلَمْ يَجْعَلْنِى جَبَّارًا شَقِيًّا (dan Dia tidak menjadikan aku seorang yang sombong lagi celaka) Makna (الجبار) adalah orang yang menyombongkan diri. Makna (الشقي) adalah orang yang bermaksiat pada Tuhannya; atau menurut pendapat lain orang yang sengsara; atau orang yang durhaka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Menjadikanku berbakti kepada ibuku, dan Dia tidak menjadikan aku seorang yang sombong lagi celaka dan durhaka kepada Tuhanku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan berbakti kepada ibuku dan Dia tidak menjadikanku orang yang sombong lagi celaka} orang yang enggan menyembahNya dan tidak pula orang durhaka kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah juga memerintahkan kepadaku agar berbakti kepada ibuku. Maka aku melakukan sikap yang terbaik kepadanya. Aku mengerjakan buat ibuku apa yang sudah semestinya dilakukan, karena kemuliaan dan keutamannya, dan juga karena dia adalah seorang ibu yang memiliki hak (yang muncul atas) kelahiran dan hak-hak penyertanya. “Dan Dia tidak menjadikanku seorang yang sombong,” maksudnya sombong kepada Allah dan kepada para hamba Allah “lagi celaka,” di dunia atau akhirat. Allah tidak menjadikanku seperti itu. Namun, menjadikanku sebagai orang yang taat kepadaNya, tunduk, khusyu dan merendahkan diri kepada para hamba Allah, bahagia di dunia dan akhirat, aku dan orang yang mengikutiku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 32: Yakni bermaksiat kepada Allah, bahkan Dia menjadikan aku seorang yang taat, tunduk, khusyu’ dan merendahkan diri kepada Allah, bertawadhu’ kepada hamba-hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 32",
    "description": "Allah juga memerintahkan aku untuk santun, taat, dan berbakti kepada ibuku, dan dia juga tidak menjadikan aku seorang yang sombong lagi celaka, karena hal itu merupakan sifat dan sikap yang tercela. '33. Isa mengakhiri perkataanya dengan doa, 'keselamatan dan kesejahteraan semoga selalu dilimpahkan kepadaku. Semoga aku terhindar pula dari aib dan kekurangan, pada hari kelahiranku, pada hari wafatku, dan pada hari aku dibangkitkan hidup kembali di padang mahsyar. '."
  }
]