[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kesejahteraan dan keamanan dari Allah terlimpah padaku sejak hari aku dilahirkan, pada hari aku meninggal dan pada hari aku dibangkitkan dalam keadaan hidup kembali pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dan keamanan dari setan dan para pembantunya dilimpahkan kepadaku pada hari lahirku, hari wafatku, dan hari aku dibangkitkan hidup kembali pada hari Kiamat kelak, dan setan tidak sanggup menguasaiku dalam tiga kondisi yang menakutkan ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَالسَّلٰمُ عَلَىَّ يَوْمَ وُلِدتُّ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا (Dan kesejahteraan semoga dilimpahkan kepadaku, pada hari aku dilahirkan, pada hari aku meninggal dan pada hari aku dibangkitkan hidup kembali) Yakni keselamatan bagiku di hari aku dilahirkan, sehingga setan tidak dapat memberiku kemudharatan, dan tidak dapat menyesatkanku saat kematian atau saat aku dibangkitkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Dan kesejahteraan semoga dilimpahkan kepadaku, pada hari aku dilahirkan, pada hari aku meninggal dan pada hari aku dibangkitkan hidup kembali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kesejahteraan semoga dilimpahkan kepadaku pada hari kelahiranku, hari wafatku, dan hari aku dibangkitkan hidup lagi”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Sesudah tercapai kesempurnaan dan perilaku-perilaku terpuji baginya, dia mengatakan, “Dan kesejahteraan semoga dilimpahkan kepadaku, pada hari aku dilahirkan, pada hari aku meninggal, dan pada hari aku dibangkitkan hidup kembali,” maksudnya lantaran karunia Rabbku dan kemurahanNya, telah terwujud keselamatan bagiku dari kejahatan setan dan siksa pada hari kelahiranku, hari kematianku dan Hari Kebangkitanku. Ini menunjukkan bahwa Isa selamat dari kengerian-kengerian dan tempat orang-orang jahat (neraka), bahkan dia termasuk penghuni surge. Ini merupakan mukjizat yang luar biasa dan bukti yang terang bahwa dia itu adalah benar-benar utusan Allah dan hamba Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 33: Yakni karena karunia Tuhanku dan kemurahan-Nya aku memperoleh keselamatan dari berbagai keburukan, setan, dan dari azab. Dari Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 33",
    "description": "Isa mengakhiri perkataanya dengan doa, 'keselamatan dan kesejahteraan semoga selalu dilimpahkan kepadaku. Semoga aku terhindar pula dari aib dan kekurangan, pada hari kelahiranku, pada hari wafatku, dan pada hari aku dibangkitkan hidup kembali di padang mahsyar. '34. Demikianlah proses kelahiran isa dan tanggapannya atas keraguan bani israil. Pada ayat ini, Allah lalu menerangkan kedudukannya sebagai hamba Allah. Itulah sifat dan ucapan isa putra maryam yang mengungkap semuanya dengan perkataan yang benar. Namun demikian, kaum yahudi itu tetap tidak memercayainya karena menganggapnya sebagai hal yang tidak wajar dan merupakan bukti yang mereka ragukan kebenarannya, kendati semuanya merupakan fakta yang sangat nyata."
  }
]