[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang telah Kami kisahkan kepadamu (wahai rasul) tentang sifat dan beritanya itu adalah isa putra maryam, tidak ada keraguan sama sekali tentangnya. Bahkan itulah kebenaran yang telah diragukan oleh kaum yahudi dan nasrani."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Orang yang memiliki sifat seperti ini adalah Isa bin Maryam. Dan perkataan ini merupakan perkataan yang benar, bukan seperti perkataannya orang-orang sesat yang meragukan dan berselisih tentang kebenarannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Itulah kisah tentang Nabi Isa bin Maryam yang memiliki derajat yang tinggi dalam penyembahan kepada Allah semata dan yang ada pada perkataan-perkataan kenabiaannya yang bijaksana; inilah perkataan benar yang diragukan oleh orang-orang Yahudi dan Nasrani."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. ذٰلِكَ (Itulah) Yakni itulah orang yang berkata aku adalah hamba Allah yang memiliki ciri-ciri yang telah disebutkan, dia adalah Isa bin Maryam. عِيسَى ابْنُ مَرْيَمَ ۚ قَوْلَ الْحَقِّ(Isa putera Maryam, yang mengatakan perkataan yang benar) Yakni perkataan ini adalah perkataan yang benar dalam hakikat Isa bin Maryam, bukan seperti yang dikatakan oleh orang-orang yang sesat (Nasrani) dan dimurkai (Yahudi). الَّذِى فِيهِ يَمْتَرُونَ(yang mereka berbantah-bantahan tentang kebenarannya) Yakni yang meragukan dan berselisih tentangnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Itulah sifat-sifat dari Isa putera Maryam, bukan seperti apa yang dikatakan orang Nasrani. Dia mengatakan perkataan yang benar dan tidak ada keraguan pada hakikat perkataannya. Sedang mereka orang Yahudi dan Nasrani meragukan dan berbantah-bantahan tentang kebenarannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah Isa putra Maryam, perkataan benar yang mereka ragukan} yang mereka ragukan dan perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35. Maksudnya, orang yang disebut-sebut dengan sifat-sifat itu adalah Isa putra Maryam, tanpa ada keraguan maupun sangsi padanya. Bahkan “(Yang mengatakan) perkataan yang benar.” Dan kalamullah (perkataan Allah) yang tidak ada perkataan yang lebih benar daripadanya dan tidak ada yang lebih baik perkataannya daripada Allah. Berita yang meyakinkan itu mengenai Isa. Sementara berita-berita tentangnya yang berbeda dengan ini, maka itu dipastikan batil. Puncak (sumber permasalahnnya) merupakan keragu-raguan dari si pengucapnya, yang tidak tahu-menahu tentangnya. Oeh karena itu, Allah berfirman, “yang mereka berbantah-bantahan tentang kebenarannya,” maksudnya mereka ragu-ragu, sehingga berbantah-bantahan dengan keraguan mereka dan berdebat berdasarkan perkiraan mereka. Di antaranya, ada orang yang mengatakan tentang dirinya, “Isa itu adalah Allah, atau anak Allah atau ketiga dari yang tiga. Sungguh Mahatinggi Allah dari kebohongan mereka.” “Tidak layak bagi Allah mempunyai anak,” maksudnya tidak wajar dan tidak layak. Karena itu adalah suatu yang mustahil. Allah Mahakaya (tidak membutuhkan orang lain), Maha Terpuji, yang memiliki segala sesuatu, bagaimana mungkin Allah mengangkat seorang anak dari kalangan para hamba?! “Mahasuci Dia,” Mahasuci Allah dari segala kekkurangan dan anak. “Apabila Dia telah menetapkan sesuatu,” baik dari perkara yang kecil ataupun yang besar, “maka Dia hanya berkata kepadanya, ‘Jadilah,’ maka jadikanlah ia,” jika ketentuan dan kehendakNya pasti terlaksana di langit dan bumi, bagaimana mungkin Dia memiliki anak?! Kalau memang demikian adanya, jika Allah menginginkan sesuatu, maka cukup dengan mengatakan “Jadilah” maka jadilah ia, lalu mengapa dianggap sebuah perkara mustahil, Allah menciptakan Isa tanpa bapak?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 34: Yakni yang disifati dengan sifat-sifat tersebut adalah Isa putra Maryam. Berita yang Allah sebutkan inilah yang benar, sedangkan berita yang menyelisihinya adalah dusta. Oleh karena itu mereka meragukan kebenarannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 34",
    "description": "Demikianlah proses kelahiran isa dan tanggapannya atas keraguan bani israil. Pada ayat ini, Allah lalu menerangkan kedudukannya sebagai hamba Allah. Itulah sifat dan ucapan isa putra maryam yang mengungkap semuanya dengan perkataan yang benar. Namun demikian, kaum yahudi itu tetap tidak memercayainya karena menganggapnya sebagai hal yang tidak wajar dan merupakan bukti yang mereka ragukan kebenarannya, kendati semuanya merupakan fakta yang sangat nyata. 35. Sungguh mustahil dan tidak patut bagi Allah mempunyai anak. Mahasuci dia dari kemungkinan mempunyai anak, dari segala kekurangan, dan dari butuh pada sesuatu. Apabila dia hendak menetapkan sesuatu, maka dia hanya berkata kepadanya, 'jadilah!' maka jadilah sesuatu itu. Karenanya, dia tidak memerlukan apa pun, termasuk kebutuhan terhadap anak."
  }
]