[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan isa berkata kepada kaumnya, ”Dan sesungguhnya Allah yang aku seru kalian kepadanya, hanya Dia semata tuhanku dan tuhan kalian, maka sembahlah Dia semata oleh kalain semua, tiada sekutu baginya. Maka saya dan kalian sama dalam peribadahan dan ketundukan kepadaNya. Inilah jalan yang lurus yang tidak ada kebengkokan padanya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan sesungguhnya Allah -Subḥānahu- adalah Tuhanku dan Tuhan kalian semua, maka murnikanlah ibadah hanya kepada-Nya semata. Yang aku sebutkan pada kalian ini adalah jalan lurus yang mengantarkan pada keridaan Allah. “"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan termasuk dari perintah Isa kepada kaumnya ketika dia masih dalam buaian adalah agar mereka menyembah Allah semata; Allah adalah Tuhanku dan Tuhan kalian semua, maka sembahlah Dia semata, inilah jalan yang benar yang dapat mengantarkan ke surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَإِنَّ اللهَ رَبِّى وَرَبُّكُمْ فَاعْبُدُوهُ ۚ هٰذَا صِرٰطٌ مُّسْتَقِيمٌ (Sesungguhnya Allah adalah Tuhanku dan Tuhanmu, maka sembahIah Dia oleh kamu sekalian. Ini adalah jalan yang lurus) Yakni apa yang aku sebutkan kepada kalian ini, yaitu Allah adalah Tuhanku dan Tuhan kalian, adalah jalan yang lurus yang tidak berbelok sama sekali dan tidak akan tersesat orang yang menitihnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Sesungguhnya Allah adalah Tuhanku dan juga Tuhanmu, maka kamu sekalian sembahIah Dia. Ini adalah jalan yang lurus tidak ada kelokan, yang menuntun ke surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Sesungguhnya Allah itu Tuhanku dan Tuhan kalian. maka sembahlah Di. Ini adalah jalan yang lurus”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Oleh sebab itu, Isa memberitahukan bahwa dirinya seorang hamba yang diasuh sebagaimana manusia lainnya. Isa mengatakan, “SEsungguhnya Allah adalah Rabbku dan Rabb kalian,” yang menciptakan kita, membentuk rupa kita, pengaturanNya terealisasikan pada kita dan takdirNya mengkondisikan kita, “maka kalian sembahlah Dia.” Ikhlaskanlah ibadah hanya kepadaNya, dan bersungguh-sungguhlah dalam bertaubat. Dalam ungkapan ini terdapat pengakuan terhadap tauhid rububiyah dan tauhid uluhiyah serta mengambil dalil dengan jenis yang pertama (tauhid rububiyah) sebagai dalil bagi tauhid jenis kedua (tauhid uluhiyah). Oleh karena itu, dia mengatakan, “Ini adalah jalan yang lurus,” yaitu jalan lurus yang menghantarkan menuju Allah. Karena ia merupakan jalan para rasul dan pengikut mereka. Sedangkan jalan selain itu, maka ia termasuk jalan yang menyimpang dan sesat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 36: Yakni Dialah Yang Menciptakan kita, membentuk rupa kita, mengatur kita dan memberlakukan kepada kita taqdir-Nya. Ayat ini menunjukkan bahwa dakwah Nabi Isa ‘alaihis salam adalah tauhid sebagaimana para nabi yang lain, dan bahwa Nabi Isa ‘alaihis salam tidak mengajak untuk menyembah dirinya, bahkan mengajak menyembah Allah saja. Di ayat ini terdapat ikrar terhadap rububiyyah Allah dan uluhiyyah-Nya. Keberhakan-Nya untuk diibadahi karena Dia adalah Rabbul ‘aalamin (Tuhan semesta alam). Yang dapat menyampaikan ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 36",
    "description": "Nabi isa menegaskan bahwa Allah tidak memerlukan anak, 'dan sesungguhnya Allah yang maha esa itu tidak mempunyai anak. Dia adalah tuhanku yang memelihara dan merahmatiku, dan dia adalah juga tuhanmu dan tuhan semua makhluk. Maka, sembahlah dia. Ketahuilah bahwa ini adalah jalan yang lurus dan telah Allah wahyukan kepada para nabi-Nya. '37. Keterangan yang dikemukakan oleh nabi isa sangat jelas, namun bani israil tetap ingkar. Maka, berawal dari sikap ini berselisihlah golongan-golongan yang ada di antara mereka, yaitu antara yahudi dan nasrani, tentang isa dan maryam. Akibat keingkaran itu maka celakalah orang-orang kafir, termasuk mereka yang mempertuhankan isa, pada waktu menyaksikan hari yang agung, yaitu hari pembalasan."
  }
]