[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka golongan-golongan dari ahli kitab berselisih diantara mereka sendiri mengenai perkara isa . Diantara mereka ada yang bersikap berlebihan terhadapnya, yaitu kaum nasrani, dan diantara mereka ada yang mengatakan, ”Dia adalah Allah” dan diantara mereka ada yang berkata, ”Dia adalah putra Allah”. Dan ada yang berkata, ”Dia adalah salah satu dari tiga.” Maha tinggi Allah dari apa yang mereka uccapkan. Dan diantara ahli kitab ada yang bersikap tidak hormat terhadap isa, yaitu kaum yahudi. Mereka mengatakan, ”Dia tukang sihir” Mereka berkata, ”Dia putra yusuf si tukang kayu.” maka kebinasaanlah bagi orang-orang yang kafir ketika mereka menyaksikan hari yang besar kesulitannya, yaitu hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Maka orang-orang berselisih tentang perkara Isa -'alaihissalām-, lalu mereka pun berpecah-belah menjadi beberapa golongan di antara kaumnya. Sebagian mereka beriman kepadanya dan berkata, \"Dia adalah seorang Rasul,\" sebagian yang lain kafir kepadanya semisal Yahudi, dan beberapa kelompok lainnya berlebih-lebihan terhadapnya sehingga mengatakan, \"Dia adalah Allah,\" dan yang lain berkata, \"Dia anak Allah.\" Sungguh Allah Maha Suci dari apa yang mereka katakan, dan celakalah orang-orang yang berselisih tentang dirinya pada waktu menyaksikan hari Kiamat yang agung di dalamnya terdapat berbagai kejadian hari itu, hisab dan pemberian azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-38. Kemudian golongan-golongan ahli kitab saling berselisih tentang perkara Isa, antara melebih-lebihkannya hingga menjadikannya tuhan dan antara menuduhnya sebagai tukang sihir. Kehancuran dan kebinasaan bagi orang-orang yang mendustakan kengerian peristiwa perhitungan pada hari kiamat; betapa kuat pendengaran dan penglihatan mereka pada hari yang sangat sulit ketika mereka menghadap Allah, namun pendengaran dan penglihatan mereka tidak bermanfaat lagi bagi mereka! Akan tetapi orang-orang yang menzalimi diri mereka sendiri di dunia itu berpaling sangat jauh dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. فَاخْتَلَفَ الْأَحْزَابُ مِنۢ بَيْنِهِمْ ۖ (Maka berselisihlah golongan-golongan (yang ada) di antara mereka) Yakni berbagai golongan saling berselisih mengenai Isa. Orang-orang Yahudi berkata, dia adalah seorang tukang sihir, dan dia adalah anak Yusuf si tukang kayu. Dan golongan-golongan dalam agama Nasrani sendiri juga saling berselisih; menurut kelompok Nestorian, dia adalah anak Allah; dan menurut kelompok Melkaniyah, dia adalah satu dari tiga oknum; sedangkan menurut Ya’qubiyah, dia adalah Allah itu sendiri. فَوَيْلٌ لِّلَّذِينَ كَفَرُوا۟( Maka kecelakaanlah bagi orang-orang kafir) Yakni orang-orang yang saling berselisih tentang Isa. مِن مَّشْهَدِ يَوْمٍ عَظِيمٍ(pada waktu menyaksikan hari yang besar) Yakni mereka adalah orang-orang yang akan menyaksikan hari kiamat dan segala yang akan terjadi ketika itu seperti hisab dan siksaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Maka golongan-golongan yang ada di antara mereka Yahudi dan Nasrani saling berselisih tentang Isa. Yahudi berkata: Dia adalah penyihir, anak seorang pezina, anak Yusuf tukang kayu. Adapun Nasrani berkata: Dia adalah putera Allah, atau dialah Allah, atau tuhan diantara tiga tuhan Maka kecelakaanlah bagi orang-orang kafir kepada Allah yang menyangka bahwa Allah memiliki sekutu. Celakalah bagi mereka yang kafir ketika menyaksikan hari yang kesulitannya sangat besar, yaitu hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu golongan-golongan di antara mereka berselisih} lalu orang-orang Nasrani berselisih di antara mereka tentang perkara Isa {Celakalah} Celakalah {bagi orang-orang yang ingkar pada waktu menyaksikan} menyaksikan {hari yang agung} hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Usai menjelaskan keadaan Isa putra Maryam yang tidak perlu diragukan dan disangsikan, Allah memberitahukan bahwa kelompok-kelompok sesat dari kalangan Yahudi dan Nasrani serta selain mereka dengan perbedaan tingkatnya, berselisih tentang Isa putra Maryam. Di antara mereka ada yang berlebihan (mengagungkannya) dan ada pula yang terlalu melecehkannya. Di antara mereka ada pihak yang mengatakan bahwa Isa itu adalah Allah! Sebagian menganggapnya anak Allah! Pihak yang lain mengatakan bahwa dia itu ketiga dari tuhan (tuhan, trinitas). Sebagian yang lain (justru) tidak menilainya sebagai rasul, bahkan menuduhnya sebagai anak zina, semisal golongan Yahudi! Semua perkataan mereka adalah perkataan-perkataan batil, pendapat yang rusak, yang dilandasi oleh keraguan dan pembangkangan, bukti-bukti yang rusak, syubhat-syubhat yang murahan. Orang-orang ini berhak mendapatkan ancaman yang keras. Allah berfirman, “Maka kecelakaanlah bagi orang-orang yang kafir,” kepada Allah dan para RasulNya serta kitab-kitabNya. Termasuk dalam kelompok ini yaitu golongan Yahudi dan Nasrani, yang mengutarakan ucapan kufur tentang Isa putra Maryam “pada waktu menyaksikan hari yang besar,” maksudnya suasana Hari KIamat, yang disaksikan oleh orang-orang generasi pertama dan terakhir, penghuni langit sampai para penghuni bumi, al-Khaliq (Pencipta) dan makhluk, (hari) yang penuh dengan kegoncangan dan peristiwa menakutkan serta memuat pembalasan amal perbuatan. Pada hari itu, akan Nampak semua yang mereka rahasiakan ataupun yang mereka perlihatkan dan sembunyikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 37: Yaitu orang-orang Yahudi dan Nasrani atau antara sesama Yahudi atau sesama Nasrani. Di antara mereka ada yang mengatakan bahwa Isa putra Allah, ada yang mengatakan tuhan di samping Allah, ada yang mengatakan bahwa Isa salah satu di antara yang tiga, dan ada pula yang tidak mengakui kerasulan Isa, bahkan menuduhnya sebagai anak zina seperti halnya orang-orang Yahudi. Semua perkataan ini adalah batil, didasari atas keraguan dan penentangan. Bahkan Isa adalah hamba Allah dan Rasul-Nya sebagaimana nabi-nabi yang lain. Allah Subhaanahu wa Ta'aala tidak mengatakan, “Maka celakalah mereka” yang kembalinya kepada golongan-golongan itu, tetapi kecelakaan ditujukan kepada orang-orang yang kafir, karena di antara golongan yang berbeda itu ada golongan yang sesuai dengan kebenaran, di mana golongan itu mengatakan tentang Isa, bahwa Beliau adalah hamba Allah dan Rasul-Nya, mereka inilah orang-orang mukmin. Yaitu hari kiamat, hari yang disaksikan oleh penghuni langit dan bumi, disaksikan oleh Al Khaliq dan makhluk, penuh dengan peristiwa yang menegangkan, dan di sana terdapat pembalasan terhadap amal. Ketika itulah, semakin nyata apa yang mereka sembunyikan dan apa yang mereka tampakkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 37",
    "description": "Keterangan yang dikemukakan oleh nabi isa sangat jelas, namun bani israil tetap ingkar. Maka, berawal dari sikap ini berselisihlah golongan-golongan yang ada di antara mereka, yaitu antara yahudi dan nasrani, tentang isa dan maryam. Akibat keingkaran itu maka celakalah orang-orang kafir, termasuk mereka yang mempertuhankan isa, pada waktu menyaksikan hari yang agung, yaitu hari pembalasan. 38. Alangkah tajam pendengaran mereka dan alangkah terang penglihatan mereka pada hari mereka datang kepada kami, yaitu pada hari pembalasan. Tetapi, orang-orang yang zalim dan berbuat mungkar karena enggan menggunakan pendengaran untuk menyimak nasihat menuju jalan yang lurus dan penglihatan untuk memperhatikan tanda-tanda kekuasaan Allah, pada hari ini mereka akan berada dalam kesesatan yang nyata. Walaupun penglihatan dan pendengaran mereka tajam, semuanya tidak akan bermanfaat."
  }
]