[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alangkah tajam pendengaran dan pandangan mereka pada hari kiamat pada hari mereka datang kepada Allah ketika semua itu sudah tidak bermanfaat bagi mereka!! Akan tetapi, orang-orang yang berbuat zhalim ketika mereka di dunia, berada dalam jarak yang sangat jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Alangkah tajam pendengaran dan penglihatan mereka pada hari itu, mereka mendengarkannya secara seksama tatkala pendengaran itu tak lagi bermanfaat bagi mereka, mereka juga melihatnya secara seksama tatkala penglihatan itu tak lagi memberikan manfaat bagi mereka. Akan tetapi orang-orang zalim di dunia ini senantiasa berada dalam kesesatan yang nyata, menyimpang dari jalan yang lurus, mereka tak siap untuk menghadapi hari Akhirat hingga kematian datang kepada mereka secara tiba-tiba sedangkan mereka masih berada dalam kezaliman tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. أَسْمِعْ بِهِمْ وَأَبْصِرْ (Alangkah terangnya pendengaran mereka dan alangkah tajamnya penglihatan mereka) Yakni betapa kuatnya pendengaran dan penglihatan mereka. يَوْمَ يَأْتُونَنَا ۖ( pada hari mereka datang kepada Kami) Untuk perhitungan dan pembalasan. لٰكِنِ الظّٰلِمُونَ الْيَوْمَ(Tetapi orang-orang yang zalim pada hari ini) Yakni di dunia. فِى ضَلٰلٍ مُّبِينٍ (berada dalam kesesatan yang nyata) Tuli, bisu, dan buta dari kebenaran, dan mereka menyangka berada di atas jalan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Alangkah terangnya pendengaran mereka dan alangkah tajamnya penglihatan mereka pada hari ketika mereka datang kepada Kami untuk perhitungan amal di akhirat. Artinya bahwa pendengaran dan penglihatan mereka menjadi sempurna, sehingga mereka menjadi faham dan mengerti tentang hakikat tentang perkara yang benar. Bertentangan dengan apa yang telah mereka sangka dan lakukan ketika di dunia Tetapi orang-orang yang kafir dan zalim kepada diri mereka sendiri ketika di dunia berada dalam kesesatan yang nyata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Alangkah tajam pendengaran dan penglihatan mereka} Alangkah tajam pendengaran dan penglihatan mereka {pada hari mereka datang kepada Kami. Akan tetapi orang-orang zalim pada hari ini berada dalam kesesatan yang nyata} yang jelas dan tampak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. “Alangkah terangnya pendengaran mereka dan alangkah tajamnya penglihatan mereka pada hari (ketika) mereka datang kepada Kami,” maksudnya alangkah baik pendengaran dan penglihatan mereka kala itu. Sehingga mereka mengakui kekufuran dan kesyirikan serta ucapan-ucapan mereka. Mereka mengatakan, \"\"Ya Tuhan kami, kami telah melihat dan mendengar, maka kembalikanlah kami (ke dunia), kami akan mengerjakan amal saleh, sesungguhnya kami adalah orang-orang yang yakin\". (As-Sajdah:12). Pada Hari KIamat, mereka benar-benar meyakini apa yang sebenarnya telah mereka lakukan. “Tetapi orang-orang yang zhalim pada hari ini (di dunia) berada dalam kesesatan yang nyata.” Mereka tidak memiliki argument dalam kesesatan ini. Karena mereka itu antara orang yang menentang lagi sesat di atas bukti nyata, (atau mengetahui kebenaran tetapi menabraknya), dengan orang yang sesat dari jalan kebenaran, mampu mengenal kebenaran dengan baik, tapi dia lebih menyukai kesesatan dan amal kejelekan, tanpa mau berusaha untuk mengetahui perbedaan yang haq dari yang batil. Renungilah, bagaimana Allah berfirman, “Maka kecelakaanlah bagi orang-orang yang kafir,” setelah ayat “Maka berselisihlah golongan-golongan (yang ada) di antara mereka.” Allah tidak mengatakan “Kecelakaanlah bagi mereka,” (dengan menggunakan kata ganti) yang kembali kepada kata al-ahzab (kelompok-kelompok). Karena di antara kelompok-kelompok yang berselisih itu, ada kelompok yang berpandangan dengan benar, sesuai dengan yang benar. Kelompok yang benar ini menyatakan bahwa Isa itu adalah hamba Allah dan RasulNya. Mereka beriman kepadanya dan mengikutinya. Mereka ini adalah orang yang beriman, tidak termasuk dalam golongan yang terkena ancaman. Oleh karena itu, Allah hanya mengancam orang-orang kafir saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 38: Mereka tuli dari mendengarkan yang hak dan buta dari melihatnya. Mereka tidak memiliki alasan sedikit pun, karena keadaan mereka adalah sebagai orang yang menentang lagi sesat padahal mengetahui (yakni mengetahui yang benar tetapi berpaling darinya) atau sebagai orang yang sesat dari jalan yang benar, tetapi mampu mengetahui yang hak, tetapi lebih ridha dengan kesesatannya dan keburukan amalnya serta tidak mau berusaha mengetahui yang hak. Namun pada hari kiamat pendengaran mereka begitu tajam dan penglihatan mereka begitu terang. Mereka akan berkata, \"Ya Tuhan Kami, Kami telah melihat dan mendengar, maka kembalikanlah Kami (ke dunia), kami akan mengerjakan amal saleh, sesungguhnya kami adalah orang-orang yang yakin.\" (Terj. As Sajdah: 12)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 38",
    "description": "Alangkah tajam pendengaran mereka dan alangkah terang penglihatan mereka pada hari mereka datang kepada kami, yaitu pada hari pembalasan. Tetapi, orang-orang yang zalim dan berbuat mungkar karena enggan menggunakan pendengaran untuk menyimak nasihat menuju jalan yang lurus dan penglihatan untuk memperhatikan tanda-tanda kekuasaan Allah, pada hari ini mereka akan berada dalam kesesatan yang nyata. Walaupun penglihatan dan pendengaran mereka tajam, semuanya tidak akan bermanfaat. 39. Balasan bagi orang-orang yang ingkar pada hari kebangkitan sangat mengerikan. Karena itu Allah memerintahkan nabi-Nya untuk memperingatkan mereka, 'wahai nabi Muhammad, dan berilah mereka peringatan tentang hari penyesalan atas kelalaian mereka. Penyesalan tersebut tidak berarti ketika itu karena segala perkara telah diputus dan ditetapkan balasannya. Peringatan itu perlu disampaikan, sedang mereka di dunia dalam kelalaian tentang adanya hari pembalasan, dan karenanya mereka tetap tidak beriman pada ajakan bertauhid dan mematuhi perintah Allah."
  }
]