[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan peringatkanlah (wahai rasul) kepada sekalian manusia tentang hari penyesalan, ketika semua perkara telah diputuskan, dan kematian dihadirkan dalam bentuk kambing gemuk lalu di sembelih, dan diputuskanlah nasib makhluk-makhluk. Orang-orang beriman menuju surga dan orang-orang kafir menuju neraka. Dan mereka itu dahulu di dunia berada dalam kelalaian dari peringatan yang disampaikan kepada mereka. Mereka tidak mengimani dan tidak melakukan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan berilah peringatan kepada manusia -wahai Rasul- tentang hari penyesalan yang mana seorang yang berbuat keburukan menyesali keburukannya, dan seorang yang berbuat baik menyesali kurangnya ketaatan yang dilakukannya, yaitu hari ketika buku catatan amalan para hamba telah ditutup, hisab amalan mereka telah selesai, dan setiap mereka telah mendapatkan balasan amal perbuatannya, sedangkan keadaan mereka dalam kehidupan ini hanya tertipu dengan dunia, lalai dari Akhirat, dan tidak pula beriman dengan adanya hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Hai Rasulullah, pengingatkanlah para hamba-Ku dari hari kiamat dan penyesalan, ketika berlaku ketetapan Allah pada hamba-hamba-Nya: sebagian mereka memasuki surga dan sebagian lainnya memasuki neraka Jahannam. Sedangkan mereka di dunia ini dalam kelalaian terhadap hari tersebut karena mereka tidak mengimaninya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَأَنذِرْهُمْ يَوْمَ الْحَسْرَةِ (Dan berilah mereka peringatan tentang hari penyesalan) Orang yang berbuat buruk akan menyesal atas keburukannya, dan orang yang berbuat baik akan menyesal atas kelalaiannya dalam memperbanyak kebaikannya. إِذْ قُضِىَ الْأَمْرُ(ketika segala perkara telah diputuskan) Yakni setelah selesai dari perhitungan dan kitab catatan amal telah digulung kembali, serta para penghuni surga telah memasuki surga dan penghuni neraka telah memasuki neraka. وَهُمْ فِى غَفْلَةٍ(Dan mereka dalam kelalaian) Yakni kini di dunia mereka terlena di dalamnya dan lalai dari siksaan yang akan mereka dapatkan di hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Wahai Nabi, berilah mereka peringatan tentang hari penyesalan yaitu hari kiamat. Yaitu hari dimana orang-orang yang berbuat keburukan menyesali perbuatannya, dan orang yang berbuat baik menyesal atas sedikitnya amal mereka. Ketika perhitungan amal telah selesai dan mereka menjadi dua kelompok yang masuk surga dan masuk neraka. Sedangkan sekarang ini mereka dalam kelalaian di dunia atas hari itu dan mereka juga tidak beriman kepada hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Peringatkanlah mereka tentang hari penyesalan} penyesalan {ketika segala perkara telah diputuskan} ketika hisab telah usai, penduduk surge memasuki surga dan penduduk neraka memasuki neraka {dan mereka dalam kelalaian} dan mereka lalai di dunia dan berpaling tentang akhirat {dan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. Kata ‘al indzaar’ bermakna pemberitahuan tentang hal-hal yang menakutkan dengan nada mengancam dan menyampaikan tentang sifat-sifatnya. Dan obyek yang paling pantas menjadi bahan peringatan dan ancaman bagi para hamba adalah Hari Penyesalan (Kiamat), saat semua perkara diputuskan dan orang-orang terdahulu sampai generasi terakhir dikumpulkan pada satu tempat. Mereka akan ditanya mengenai amal perbuatan mereka. Maka barangsiapa beriman kepada Allah dan mengikuti para RasulNya, niscaya akan menikmati kebahagiaan, tanpa pernah mengalami penderitaan setelah itu. Sedangkan orang yang tidak beriman serta tidak mengikuti para RasulNya, niscaya akan merasakan hidup celaka tanpa akan pernah mengenyam kebahagiaan setelahnya. Dia merugi atas diri dan keluarganya. Pada saat itu, dia bersedih dan menyesal dengan penyesalan yang membuat kalbu terputus (dari pengharapan) dan menjadikan hati hancur tak karuan. Adakah kesedihan yang lebih besar daripada kesedihan lantaran luput dari mendapatkan ridha dan surge Allah, lalu menerima kepastian murka Allah serta dimasukkan ke neraka, dalam keadaan yang tidak memiliki kemungkinan kembali (ke dunia lagi) untuk memulai amalan baru dan tidak ada cara lain untuk merubah keadaan dirinya dengan kembali ke dunia? Inilah keadaan yang menyongsong mereka. Sementara di dunia, mereka lalai dari persoalan besar ini. Masalah ini tidak pernah terbetik dalam hati-hati mereka. Kalaupun terngiang-ngiang, maka dalam suasana yang lalai. Kelalaian menyelimuti mereka dengan merata dan keterlenaan telah menguasai diri mereka. Mereka tidak beriman kepada Allah dan tidak mengikuti para rasul. (Kenikmatan) dunia telah memerdayai mereka. Godaan-godaan syahwat yang akan sirna lagi fana telah menjadi faktor penghalang antara mereka dan keimanan. Dunia beserta isinya, dari permulaan sampai penghujungnya, akan pergi meninggalkan pemiliknya, dan para penghuninya pun berpisah dengannya. Kemudian Allah mengambil alih dunia dan semua isinya, mengembalikan mereka semua kepadaNya. Selanjutnya, Allah memberikan balasan bagi mereka sesuai dengan amal perbuatan, baik berupa kerugian maupun keuntungan mereka di dunia. Barangsiapa melakukan perbuatan baik, hendaklah dia memuji Allah. Sedangkan, orang yang menjumpai amalan selain itu (amalan buruk), janganlah dia mencela kecuali dirinya sendiri saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 39: Yaitu hari kiamat, karena ketika itu banyak orang yang menyesal disebabkan tidak berbuat ihsan di dunia. Penyesalan apa yang lebih besar daripada penyesalan ketika seseorang tidak mendapatkan keridhaan Allah dan surga-Nya, bahkan malah mendapatkan neraka, dan lagi di sana tidak ada lagi kesempatan untuk memperbaiki diri. Maka beramallah wahai saudaraku, sebelum tiba hari yang di sana bukan lagi saat untuk beramal, bahkan yang ada adalah pembalasan terhadap amal. Saat ini (di dunia)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 39",
    "description": "Balasan bagi orang-orang yang ingkar pada hari kebangkitan sangat mengerikan. Karena itu Allah memerintahkan nabi-Nya untuk memperingatkan mereka, 'wahai nabi Muhammad, dan berilah mereka peringatan tentang hari penyesalan atas kelalaian mereka. Penyesalan tersebut tidak berarti ketika itu karena segala perkara telah diputus dan ditetapkan balasannya. Peringatan itu perlu disampaikan, sedang mereka di dunia dalam kelalaian tentang adanya hari pembalasan, dan karenanya mereka tetap tidak beriman pada ajakan bertauhid dan mematuhi perintah Allah. 40. Allah adalah pencipta segala yang ada, maka semuanya adalah milik-Nya. Sesungguhnya kamilah yang mewarisi bumi dan semua yang ada di atasnya. Tidak satu pun makhluk yang berhak memilikinya. Semua ciptaan itu pun akan mati dan kemudian hanya kepada kami mereka dikembalikan untuk menghadapi hisab."
  }
]