[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia (zakaria) berkata ”wahai tuhanku, sesungguhnya aku telah berusia lanjut, dan tulangg-tulangku telah melemah, serta uban putih telah menyebar di seluruh rambut kepalaku, sedang aku sebelumnya belum pernah terhalangi dari doa yang terkabul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Ia berkata, \"Wahai Tuhanku! Sungguh tulangku telah rapuh, dan kepalaku telah dipenuhi uban, namun aku tidak akan pernah kecewa dan putus asa dalam berdoa kepada-Mu, sebab setiap kali aku berdoa pada-Mu, engkau selalu mengabulkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Dia berdoa: “Ya Tuhanku, umurku telah lanjut dan tulangku telah menjadi lemah sekali serta uban telah menyebar di kepalaku; namun aku belum pernah kecewa dan terhalang dari pengabulan-Mu atas doaku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. قَالَ رَبِّ إِنِّى وَهَنَ الْعَظْمُ مِنِّى (Ia berkata “Ya Tuhanku, sesungguhnya tulangku telah lemah) Yang dia maksud adalah tulangnya telah melemah sehingga kekuatannya juga melemah. وَاشْتَعَلَ الرَّأْسُ شَيْبًا(dan kepalaku telah ditumbuhi uban) Yakni ubannya telah banyak sekali; dan ini merupakan kalimat untuk mengungkapkan usia yang telah lanjut. وَلَمْ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيًّا(dan aku belum pernah kecewa dalam berdoa kepada Engkau, ya Tuhanku) Yakni aku tidak pernah merasa kecewa, sebab setiap kali aku berdoa pasti Engkau mengabulkannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Uyainah memberi komentar atas ucapan Zakariya dalam ayat : { وَلَمْ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيًّا } \"dan aku belum pernah kecewa dalam berdoa kepada Engkau, ya Tuhanku\" yakni : aku tetap bahagia meskipun Engkau beliau mengabulkan permintaanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Ia berkata \"Ya Tuhanku, sesungguhnya tulangku telah lemah dan kepalaku telah ditumbuhi uban, dan aku belum pernah kecewa dalam berdoa kepada Engkau, namun Engkau selalu mengijabah doaku. Maka dari itu aku mohon Engkau mengijabahi doaku ya Tuhanku.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Wahai Tuhanku, sesungguhnya tulangku telah lemah} lemah {kepalaku telah dipenuhi uban} dan uban menyebar di kepalaku {dan aku tidak pernah kecewa} kecewa karena tidak dikabulkan {ketika berdoa kepadaMu, wahai Tuhanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Ketika Nabi Zakaria menyadari kelemahan pada dirinya dan khawatir akan meninggal, sementara belum ada orang yang menempati tugasnya untuk mendakwahi umat manusia kepada Rabb mereka dan menasehati mereka, maka beliau mengadukan kelemahan batin dan fisiknya itu kepada Rabbnya . Beliau berdoa kepada Allah dengan suara lembut, supaya doanya lebih sempurna, lebih utama dan lebih paripurna keikhlasannya. Beliau mengatakan, “Wahai Rabbku, sesungguhnya tulangku telah lemah,” maksudnya, sudah lemah dan lunglai. Jika tulang yang merupakan penyangga badan sudah lemah, maka anggota badan yang lain pasti ikut melemah. “Kepalaku telah ditumbuhi uban,” karena (tumbuhnya) uban merupakan pertanda kelemahan dan masa tua, utusan dan duta kematian serta peringatan akan dekatnya kematian. Maka Zakarian menjadikan kelemahan dan ketidakberdayaannya sebagai wasilah (perantara) dalam berdoa kepada Allah. Ini merupakan salah satu bentuk wasilah yang dicintai oleh Allah, karena menunjukkan berlepas diri dari daya dan kekuatan (pribadi) dan ketergantungan hati hanya kepada daya dan kekuatan Allah. “Dan aku belum pernah kecewa dalam berdoa kepadaMu, wahai Rabbku.” Wahai Rabbku, Engkau tidak pernah menolak permintaanku dengan hampa dan menjadi terhalang-halangi dari pengabulan. Bahkan Engkau selalu menyambutku dan mengabulkan permohonanku. Dan kelembutanMu selalu silih berganti datang kepadaku, (begitu juga) kebaikanMu selalu sampai kepadaku. Ini merupakan satu bentuk tawasul kepada Allah dengan (penyebutan) nikmat yang Allah anugerahkan kepadanya dan pengabulan doa-doanya yang terdahulu. Jadi, Nabi Zakaria berdoa kepada Allah yang telah memberinya kebaikan pada masa yang lalu agar menyempurnakan curahan kebaikanNya pada masa akan datang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 4: Ketika tulang telah lemah, di mana ia merupakan penopang badan, maka anggota badan yang lain tentu ikut lemah. Uban merupakan tanda kelemahan dan ketuaan, utusan maut, pemandunya dan peringatan terhadapnya. Nabi Zakaria bertawassul kepada Allah dengan kelemahan dirinya, dan hal ini termasuk cara bertawassul yang dicintai Allah, karena hal ini menunjukkan sikap berlepas diri dari kemampuan dirinya serta bergantung kepada kekuatan Allah ‘Azza wa Jalla. Yakni Engkau tidak menghendaki aku kecewa dan terhalang dari dikabulkan doa, bahkan Engkau senantiasa menyambutku dan mengabulkan doaku. Kelembutan-Mu selalu mengalir kepadaku dan ihsan-Mu senantiasa sampai kepadaku. Di sini Beliau bertawassul kepada Allah dengan nikmat yang diberikan-Nya kepada dirinya dan pengabulan-Nya terhadap doanya yang terdahulu; Beliau meminta kepada Allah Tuhan yang telah berbuat baik dahulu agar Dia menyempurnakan ihsan-Nya pada kesempatan selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 4",
    "description": "Dengan santun dan suara yang lembut dia berkata, 'ya tuhanku yang maha pengasih dan maha pemelihara, sungguh kini tulang belulangku telah menjadi lemah sehingga aku sering merasa letih, dan rambut kepalaku telah memutih seperti perak karena dipenuhi uban, pertanda bahwa aku telah berusia senja. Namun, aku tidak pernah putus asa dan aku belum pernah kecewa dalam berdoa kepada-Mu, ya tuhanku. Engkau adalah zat yang tidak pernah mengecewakan siapa pun. 5. Dan sungguh, di masa tuaku ini aku selalu merasa khawatir terhadap kerabatku sepeninggalku kelak bila engkau memanggilku, padahal istriku seorang yang mandul sejak masa mudanya, maka anugerahilah aku dengan rahmat dan kasih sayang-Mu seorang anak dari sisi-Mu yang akan melanjutkan keturunanku dan menggantikanku menyebarkan hukum dan ajaran-Mu."
  }
]