[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami mewarisi bumi dan semua yang ada di atasnya dengan kehancuran mereka dan kelanggengan Kami setelah (kebinsaan) mereka dan berlakunya ketetapan Kami pada mereka. dan kepada Kami tempat mereka kembali dan perhitungan amal perbuatan mereka. Lalu Kami akan memberikan pembalasan kepada mereka atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya Kami lah yang tetap kekal setelah semua makhluk fana. Kami yang mewarisi bumi dan semua yang ada di atasnya karena mereka telah fana dan hanya Kami yang tetap hidup setelahnya. Di dunia ini Kami telah memberikan mereka kekuasaan, mengatur kehidupan mereka sekehendak Kami, dan hanya kepada Kami lah mereka akan kembali pada hari Kiamat kelak untuk menjalani proses hisab dan mendapatkan ganjaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Dengan keagungan Kami, Kami mewarisi bumi seluruhnya dan segala yang ada di atasnya dari pada manusia setelah kematian mereka semua; kepada Kami mereka kembali untuk menjalani perhitungan. Syeikh as-Syinqithi berkata: “makna dari firman Allah bahwa Dia mewarisi bumi dan seluruh penduduknya adalah Dia mematikan seluruh makhluk yang menghuni bumi, dan tidak ada yang tersisa melainkan Dia, karena Dia Maha Hidup yang tidak pernah mati. Kemudian mereka akan kembali kepada-Nya pada hari kiamat. Makna ini telah diisyaratkan pada ayat-ayat lain, seperti: كُلُّ مَنْ عَلَيْهَا فَان ٍوَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو ٱلْجَلَٰلِ وَٱلْإِكْرَامِ Semua yang ada di bumi itu akan binasa. Dan tetap kekal Dzat Tuhanmu yang mempunyai kebesaran dan kemuliaan. (ar-Rahman: 36-37). Dan dalam firman-Nya: وَإِنَّا لَنَحْنُ نُحْىِۦ وَنُمِيتُ وَنَحْنُ ٱلْوَٰرِثُونَ Dan sesungguhnya benar-benar Kami-lah yang menghidupkan dan mematikan dan Kami (pulalah) yang mewarisi. (al-HIjr: 23). dan ayat-ayat lain yang semisalnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا (Sesungguhnya Kami mewarisi bumi dan semua orang-orang yang ada di atasnya) Yakni tidak ada lagi orang yang tersisa untuk mewarisi rumah-rumah dan perhiasan milik orang-orang yang telah mati. وَإِلَيْنَا يُرْجَعُونَ(dan hanya kepada Kamilah mereka dikembalikan) Yakni mereka akan dikembalikan kepada Kami di hari kiamat, kemudian Kami akan membalas mereka sesuai dengan amalan masing-masing."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya Kamilah yang mewarisi bumi dan semua orang-orang yang ada di atasnya dengan membinasakan mereka. Hanya kepada Kamilah mereka dikembalikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kamilah yang mewarisi bumi beserta semua yang ada di atasnya dan hanya kepada Kamilah mereka dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. Kata ‘al indzaar’ bermakna pemberitahuan tentang hal-hal yang menakutkan dengan nada mengancam dan menyampaikan tentang sifat-sifatnya. Dan obyek yang paling pantas menjadi bahan peringatan dan ancaman bagi para hamba adalah Hari Penyesalan (Kiamat), saat semua perkara diputuskan dan orang-orang terdahulu sampai generasi terakhir dikumpulkan pada satu tempat. Mereka akan ditanya mengenai amal perbuatan mereka. Maka barangsiapa beriman kepada Allah dan mengikuti para RasulNya, niscaya akan menikmati kebahagiaan, tanpa pernah mengalami penderitaan setelah itu. Sedangkan orang yang tidak beriman serta tidak mengikuti para RasulNya, niscaya akan merasakan hidup celaka tanpa akan pernah mengenyam kebahagiaan setelahnya. Dia merugi atas diri dan keluarganya. Pada saat itu, dia bersedih dan menyesal dengan penyesalan yang membuat kalbu terputus (dari pengharapan) dan menjadikan hati hancur tak karuan. Adakah kesedihan yang lebih besar daripada kesedihan lantaran luput dari mendapatkan ridha dan surge Allah, lalu menerima kepastian murka Allah serta dimasukkan ke neraka, dalam keadaan yang tidak memiliki kemungkinan kembali (ke dunia lagi) untuk memulai amalan baru dan tidak ada cara lain untuk merubah keadaan dirinya dengan kembali ke dunia? Inilah keadaan yang menyongsong mereka. Sementara di dunia, mereka lalai dari persoalan besar ini. Masalah ini tidak pernah terbetik dalam hati-hati mereka. Kalaupun terngiang-ngiang, maka dalam suasana yang lalai. Kelalaian menyelimuti mereka dengan merata dan keterlenaan telah menguasai diri mereka. Mereka tidak beriman kepada Allah dan tidak mengikuti para rasul. (Kenikmatan) dunia telah memerdayai mereka. Godaan-godaan syahwat yang akan sirna lagi fana telah menjadi faktor penghalang antara mereka dan keimanan. Dunia beserta isinya, dari permulaan sampai penghujungnya, akan pergi meninggalkan pemiliknya, dan para penghuninya pun berpisah dengannya. Kemudian Allah mengambil alih dunia dan semua isinya, mengembalikan mereka semua kepadaNya. Selanjutnya, Allah memberikan balasan bagi mereka sesuai dengan amal perbuatan, baik berupa kerugian maupun keuntungan mereka di dunia. Barangsiapa melakukan perbuatan baik, hendaklah dia memuji Allah. Sedangkan, orang yang menjumpai amalan selain itu (amalan buruk), janganlah dia mencela kecuali dirinya sendiri saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 40: Manusia banyak yang terlena oleh dunia, padahal dunia beserta isinya akan ditinggalkan penghuninya dan akan diwarisi oleh Allah, lalu mereka dikembalikan kepada-Nya untuk diberikan balasan. Oleh karena itu, barang siapa yang mengerjakan kebaikan, maka pujilah Allah, dan barang siapa yang mengerjakan selain itu, maka janganlah ada yang ia cela selain dirinya. Mewarisi bumi maksudnya, setelah alam semesta ini hancur semuanya, maka Allah-lah yang kekal. Untuk diberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 40",
    "description": "Allah adalah pencipta segala yang ada, maka semuanya adalah milik-Nya. Sesungguhnya kamilah yang mewarisi bumi dan semua yang ada di atasnya. Tidak satu pun makhluk yang berhak memilikinya. Semua ciptaan itu pun akan mati dan kemudian hanya kepada kami mereka dikembalikan untuk menghadapi hisab. 41. Selesai dari penuturan kisah nabi isa, Allah beralih menceritakan kisah nabi ibrahim yang mengajak kaumnya bertauhid. Wahai nabi Muhammad, dan ceritakanlah kepada umatmu kisah ibrahim di dalam kitab Al-Qur'an yang kami wahyukan kepadamu bahwa sesungguhnya dia adalah seorang yang sangat membenarkan, di mana sikap, ucapan, dan perbuatannya selalu dalam kebenaran. Dia pun seorang nabi yang diutus untuk menuntun kaumnya ke jalan Allah."
  }
]