[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebutkanlah (wahai rasul) kepada kaummu di dalam al-qur’an ini tentang kisah ibrahim , sesungguhnya dia adalah insan yang sangat besar kejujurannya dan termasuk nabi Allah yang paling tinggi kedudukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Dan ceritakanlah -wahai Rasul- kisah Ibrahim -'alaihissalām- dalam Al-Qur`ān yang diturunkan kepadamu. Sesungguhnya dia seorang yang sangat jujur dan membenarkan ayat-ayat Allah, serta seorang Nabi yang diutus dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Hai Rasulullah, sebutkanlah dalam al-Qur’an kisah Nabi Ibrahim dengan kaumnya dan perbincangannya dengan mereka tentang tauhid ubudiyah. Ibrahim adalah orang yang sangat jujur dalam perkataan dan perbuatannya, dan dia adalah seorang nabi yang memiliki derajat yang tinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَاذْكُرْ فِى الْكِتٰبِ إِبْرٰهِيمَ ۚ (Ceritakanlah (Hai Muhammad) kisah Ibrahim di dalam Al Kitab (Al Quran) ini) Yakni bacakanlah kisahnya kepada orang-orang. إِنَّهُۥ كَانَ صِدِّيقًا نَّبِيًّا(Sesungguhnya ia adalah seorang yang sangat membenarkan lagi seorang Nabi) Makna (الصديق) yakni orang yang selalu berkata jujur, atau orang pembenarannya terhadap ayat-ayat Allah sangat kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Ceritakanlah kepada manusia wahai Nabi, tentang kisah Ibrahim yang Kami wahyukan kepadamu di dalam Al Quran ini. Sesungguhnya ia adalah seorang yang sangat jujur dan membenarkan suatu yang benar. Dia tidak pernah berbohong, dia juga seorang Nabi dan Rasul yang diutus Allah. Perintah untuk menceritakan kisah Nabi Ibrahim adalah berkaitan dengan sejarah bahwa beliau adalah nenek moyang bangsa Arab agar mereka mengenal kisah dan agama Nabi Ibrahim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ceritakanlah dalam kitab (Al-Qur’an) tentang Ibrahim. Sesungguhnya dia adalah seorang yang benar dan membenarkan} yang sangat jujur dan membenarkan ayat-ayat Allah {lagi seorang nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Ceritakanlah (hai Muhammad) kisah Ibrahim di dalam al-Kitab (al-Quran) ini. Sesungguhnya dia adalah seorang yang sangat membenarkan lagi seorang nabi.” (Dalam ayat ini) Allah memadukan dua sifat bagi Ibrahim yaitu shiddiqiyah (kejujuran yang banyak) dan nubuwwah (kenabian). Shiddiq maknanya orang yang banyak kejujurannya. Beliau jujur dalam ucapan-ucapan, tindak-tanduk serta semua dinamika kehidupannya, mempercayai segala yang diperintahkan oleh Allah untuk dipercayai. Sifat semacam ini menuntut keberadaan ilmu yang agung yang mengakar di hati, yang membekaskan pengaruh padanya, lagi mengharuskan keyakinan dan amal shalih. Dan Nabi Ibrahim adalah nabi terbaik setelah Nabi Muhammad. Beliau merupakan bapak moyang ketiga dari tiga komunitas yang mulia, lantaran Allah memberikan anugerah kenabian dan kitab kepada anak keturunannya. Beliaulah yang mendakwahi umat manusia agar kembali kepada Allah, bersabar atas siksaan pedih yang beliau alami, menyeru keluarga dekat serta kerabat yang jauh dan tekun dalam mengajak ayahnya (ke jalan yang benar) dengan mengerahkan segala kemampuannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 41: Kitab yang paling agung, paling utama dan paling tinggi adalah Al Qur’an. Jika disebutkan berita di sana, maka beritanya adalah berita yang paling benar, jika disebutkan perintah dan larangan di sana, maka perintah dan larangan itu adalah yang paling adil. Jika disebutkan balasan, janji dan ancaman, maka janji dan ancaman tersebut adalah yang paling benar, dan menunjukkan kebijaksanaan, keadilan dan karunia-Nya. Jika disebutkan nama dan kisah para nabi dan rasul, maka nabi dan rasul yang disebutkan adalah nabi yang lebih utama daripada yang lain, oleh karena itu sering diulang-ulang kisah para nabi dan rasul yang di sana Allah melebihkan mereka daripada yang lain, meninggikan derajat dan perkara mereka, karena tugas yang mereka jalankan, berupa ibadah kepada Allah, mencintai-Nya, kembali kepada-Nya, memenuhi hak-hak-Nya dan hak hamba-hamba-Nya serta mengajak manusia kepada Allah serta bersabar di atasnya. Di surah ini, Allah Subhaanahu wa Ta'aala menyebutkan secara garis besar kisah para nabi, di mana Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya untuk mengingat kisah mereka, karena dengan mengingat kisah tesebut dapat memperjelas pujian untuk Allah dan untuk mereka, menerangkan ihsan dan karunia-Nya kepada mereka, dan di sana pun terdapat dorongan untuk beriman dan mencintai mereka serta menjadikan mereka sebagai teladan. Ibrahim ‘alaihis salam adalah nabi yang paling utama setelah Nabi Muhammad shallallahu 'alaihi wa sallam, dialah orang yang Allah berikan kenabian dan kitab pada keturunannya, dialah orang yang mengajak manusia kepada Allah, bersabar terhadap gangguan dan siksaan dari orang lain dalam berdakwah, Beliau berdakwah kepada orang yang terdekat maupun yang jauh, dan berusaha semampunya mendakwahkan bapaknya. Di ayat tersebut dan setelahnya, Allah Subhaanahu wa Ta'aala menyebutkan dialog yang sopan dan bertahap dari Ibrahim kepada bapaknya. Maksudnya, Nabi Ibrahim ‘alaihis salam adalah seorang Nabi yang sangat cepat membenarkan semua hal yang ghaib yang datang dari Allah. Shiddiq juga berarti sangat banyak kejujurannya, di mana Beliau jujur dalam ucapannya, dalam perbuatannya, dan dalam keadaannya serta membenarkan semua yang diteperintahkan untuk dibenarkan, dan hal itu menunjukkan ilmu yang dalam yang sampai ke hati dan membekas di dalamnya sehingga membuahkan keyakinan serta amal saleh yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 41",
    "description": "Selesai dari penuturan kisah nabi isa, Allah beralih menceritakan kisah nabi ibrahim yang mengajak kaumnya bertauhid. Wahai nabi Muhammad, dan ceritakanlah kepada umatmu kisah ibrahim di dalam kitab Al-Qur'an yang kami wahyukan kepadamu bahwa sesungguhnya dia adalah seorang yang sangat membenarkan, di mana sikap, ucapan, dan perbuatannya selalu dalam kebenaran. Dia pun seorang nabi yang diutus untuk menuntun kaumnya ke jalan Allah. 42. Dakwah tauhid nabi ibrahim diawali dengan mempertanyakan akidah ayahnya. Ingatlah ketika dia dengan lembut dan santun berkata kepada ayahnya, 'wahai ayahku, mengapa engkau menyembah sesuatu yang tidak mendengar, seperti berhala dan patung itu, yang juga tidak dapat melihat apa pun di sekitarnya, dan tidak pula dapat menolongmu dari segala mudarat atau mendatangkan manfaat sedikit pun kepadamu''."
  }
]