[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu ketika dia berkata kepada ayahnya, Azar, ”wahai ayahku, untuk apa engkau menyembah berhala-berhala yang tidak dapat mendengar dan tidak dapat melihat, serta tidak dapat menyingkirkan sesuatu keburukan pun darimu selain Allah?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Ingatlah ketika ia berkata kepada ayahnya yang bernama Āzar, \"Wahai ayahku, mengapa engkau menyembah patung selain Allah, yang tidak bisa mendengar doamu tatkala berdoa kepadanya, tidak bisa menyaksikan ibadahmu tatkala beribadah kepadanya, dan tidak pula bisa menjauhkanmu dari mudarat atau memberimu suatu manfaat?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Dan sebutkanlah ketika Ibrahim berkata kepada ayahnya dengan lembut agar menariknya kepada keimanan: “Wahai ayahku, mengapa engkau menyembah berhala-berhala yang tidak dapat mendengar doamu, tidak melihat ibadahmu, dan tidak dapat mendatangkan manfaat dan menghalangi mudharat darimu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. إِذْ قَالَ لِأَبِيهِ (Ingatlah ketika ia berkata kepada bapaknya) Ayah Nabi Ibrahim bernama Azar, sebagaimana telah disebutkan pada surat al-An’am: 74. لِمَ تَعْبُدُ مَا لَا يَسْمَعُ (mengapa kamu menyembah sesuatu yang tidak mendengar) Yakni yang tidak mendengar do’amu yang kau panjatkan kepadanya. وَلَا يُبْصِرُ(tidak melihat) Tidak melihat penyembahan yang kamu lakukan untuknya. وَلَا يُغْنِى عَنكَ شَيْـًٔا (dan tidak dapat menolong kamu sedikitpun?) Karena tidak dapat memberimu manfaat dan tidak dapat menolak darimu mudharat. Sesuatu tersebut adalah berhala-berhala yang disembah oleh Azar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Ingatlah ketika ia berkata kepada bapaknya Azar; \"Wahai bapakku, mengapa engkau menyembah berhala yang tidak mendengar permintaanmu, tidak mampu melihat penyembahanmu juga tidak dapat menolongmu atau bahkan menyelamatkanmu sedikitpun?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia berkata kepada bapaknya,“Wahai ayahku, mengapa kamu menyembah sesuatu yang tidak mendengar, tidak melihat, dan tidak pula bermanfaat bagimu sedikit pun} tidak bermanfaat bagimu dan tidak menjagamu dari kemudharatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah menceritakan pembicaraannya dengan sang bapak. Allah berfirman, “Ingatlah ketika dia berkata kepada bappaknya,” dengan nada mendiskreditkan peribadatan kepada patung yang dilakukan oleh bapaknya “Wahai bapakku, mengapa kamu menyembah sesuatu yang tidak mendengar, tidak melihat, dan tidak dapat menolong kamu sedikit pun,” maksudnya kenapa bapak menyembah berhala-berhala yang memiliki kekurangan secara fisik dan perbuatannya; sehingga ia tidak bisa mendengar, tidak bisa melihat, dan juga tidak memiliki kemampuan untuk memberikan manfaat untuk dirinya sendiri dan tidak memiliki kekuasaan sedikit pun untuk menolak malapetaka. Keterangan ini merupakan bukti nyata yang kasat mata yang menunjukkan bahwa menyembah sesuatu yang memiliki kekurangan secara fisik dan perbuatannya, merupakan tindakan jelek menurut akal dan syari’at. Dan peringatan dan isyaratnya menunjukkan bahwa yang wajib dan pantas untuk disembah adalah Dzat yang memiliki kesempurnaan, yang para hamba tidak memperoleh kenikmatan kecuali berasal dariNya, dan tidak sanggup menghalangi (bahaya) dari mereka kecuali Dia. Dan Dialah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 42: Yaitu Azar, di mana ia seorang penyembah patung. Hal ini menunjukkan kekurangan pada zatnya (diri patung itu) dan perbuatannya, karena tidak mampu mendengar, melihat dan menolong. Demikian juga menunjukkan bahwa menyembah sesuatu yang memiliki kekurangan baik pada zat maupun perbuatannya adalah perbuatan yang diangggap buruk oleh akal dan syara’. Di dalamnya juga terdapat isyarat, bahwa yang wajib dan pantas disembah adalah Tuhan yang memiliki kesempurnaan, di mana semua nikmat yang diperoleh hamba berasal dari-Nya, dan tidak ada yang dapat menghindarkan bahaya selain Dia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 42",
    "description": "Dakwah tauhid nabi ibrahim diawali dengan mempertanyakan akidah ayahnya. Ingatlah ketika dia dengan lembut dan santun berkata kepada ayahnya, 'wahai ayahku, mengapa engkau menyembah sesuatu yang tidak mendengar, seperti berhala dan patung itu, yang juga tidak dapat melihat apa pun di sekitarnya, dan tidak pula dapat menolongmu dari segala mudarat atau mendatangkan manfaat sedikit pun kepadamu''43. Untuk lebih meyakinkan ayahnya bahwa berhala tidak layak disembah, ibrahim berkata dengan santun, 'wahai ayahku, sungguh telah sampai kepadaku sebagian ilmu yang tidak diberikan kepadamu, yaitu tentang tauhid atau keyakinan kepada tuhan yang layak disembah, maka ikutilah aku dengan penuh keikhlasan dan berimanlah kepada Allah yang esa, niscaya aku akan menunjukkan kepadamu jalan yang lurus, yaitu jalan yang akan membawamu menuju kebenaran dan kebahagiaan. '."
  }
]