[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai ayahku, sesungguhnya Allah telah memberiku ilmu yang tidak diberikanNYa kepadamu, maka terimalah ajakan dariku, dan ikutilah aku menuju ajaran yang aku seru engkau kepadanya, niscaya aku akan menunjukimu menuju jalan lurus yang engkau tidak akan mengalami kesesatan di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Wahai ayahku! Sungguh telah sampai kepadaku sebagian ilmu lewat perantaraan wahyu Allah yang tidak diberikan kepadamu, maka ikutilah aku niscaya aku akan menunjukkan kepadamu jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Ibrahim mengulangi seruannya dengan lembut: “Wahai ayahku, telah datang kepadaku jalan ilahi berupa ilmu yang agung yang belum pernah mendatangimu; maka ikutilah aku agar aku dapat menunjukkan kepadamu jalan yang lurus yang mengantarkan ke surga.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. يٰٓأَبَتِ إِنِّى قَدْ جَآءَنِى مِنَ الْعِلْمِ مَا لَمْ يَأْتِكَ (Wahai bapakku, sesungguhnya telah datang kepadaku sebahagian ilmu pengetahuan yang tidak datang kepadamu) Nabi Ibrahim memberitahu ayahnya bahwa telah mendapat sebagian ilmu berupa wahyu dari Allah dan ilmu tersebut belum sampai pada ayahnya. Dan ilmu yang telah ia dapatkan dapat mengantarkannya kepada kebenaran dan mampu digunakan untuk memberi petunjuk orang yang tersesat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Wahai bapakku, sesungguhnya telah datang kepadaku melalui wahyu beberapa ilmu pengetahuan yang tidak engkau terima. Yaitu ilmu dan pentuntun menuju jalan kebenaran, yang menyelamatkan dari kesesatan. Maka ikutilah aku, niscaya aku akan menunjukkan kepadamu jalan yang lurus. Jalan yang bisa menyelamatkan dari segala kesusahan dan membawa kebahagiaan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai ayahku, sesungguhnya telah datang kepadaku sebagian ilmu yang tidak datang kepadamu. Maka ikutilah aku, niscaya aku akan menunjukkan kepadamu} membimbingmu {ke jalan yang lurus} jalan yang lurus tidak ada hal yang bengkok di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Wahai bapakku, sesungguhnya telah datang kepadaku sebagian ilmu yang tidak datang kepadamu,” maksudnya wahai bapakku, janganlah engkau menghinaku dengan mengatakan, “Aku ini adalah putramu, dan engkau memiliki ilmu yang tidak aku miliki.” Justru Allah telah memberikan kepadaku ilmu yang tidak diberikan kepadamu. Yang dimaksud dengan ayat ini adalah perkataannya, “maka ikutilah aku, niscaya aku akan menunjukkan kepadamu jalan yang lurus,” yaitu beribadah kepada Allah semata, tidak ada sekutu bagiNya, dan menaatiNya dalam segala kondisi. Dalam kisah ini Nampak jelas kelembutan dan keluwesan dalam berkomunikasi dengan lawan bicara. Beliau tidak mengatakan, “Wahai bapakku, aku ini orang berilmu sedangkan engkau orang jahil,” atau (dengan berkata, “Engkau tidak mempunyai ilmu sedikit pun.” Akan tetapi, beliau menggunakan bentuk ungkapan [yang memberikan pengertian] bahwa aku dan engkau mempunyai ilmu, dan bahwa ilmu yang telah sampai kepadaku belum sampai dan belum datang kepadamu, maka engkau (Wahai bapakku) wajib mengikutiku dan tunduk kepada hujjah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 43: Kata-kata Nabi Ibrahim ‘alaihis salam sangat lembut, Beliau tidak mengatakan, “Wahai ayahku! Aku mengetahui sedangkan engkau tidak mengetahui”, bahkan mengatakan, “Sungguh, telah sampai kepadaku sebagian ilmu yang tidak diberikan kepadamu.” Yaitu beribadah kepada Allah saja dan menaati-Nya dalam semua keadaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 43",
    "description": "Untuk lebih meyakinkan ayahnya bahwa berhala tidak layak disembah, ibrahim berkata dengan santun, 'wahai ayahku, sungguh telah sampai kepadaku sebagian ilmu yang tidak diberikan kepadamu, yaitu tentang tauhid atau keyakinan kepada tuhan yang layak disembah, maka ikutilah aku dengan penuh keikhlasan dan berimanlah kepada Allah yang esa, niscaya aku akan menunjukkan kepadamu jalan yang lurus, yaitu jalan yang akan membawamu menuju kebenaran dan kebahagiaan. '44. Nabi ibrahim menerangkan betapa tidak bermanfaatnya ibadah ayahnya selama ini. Dia berkata, 'wahai ayahku, janganlah engkau menyembah setan, yaitu patung dan berhala itu atau lainnya, dan jangan engkau ikuti bisikan makhluk pengingkar itu. Setan selalu ingin manusia tersesat dan mengingkari Allah. Sesungguhnya setan itu sejak dulu durhaka kepada tuhan yang maha pengasih."
  }
]