[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai ayahku, janganlah engkau menaati setan, sehingga engkau mau menyembah berhala-berhala ini. Sesungguhnya setan itu durhaka terhadap tuhan yang maha pengasih dan dia angkuh untuk taaat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Wahai ayahku! Janganlah engkau menyembah setan dengan cara mentaatinya, sesungguhnya setan itu telah durhaka kepada Tuhan Yang Maha Pengasih, sebab ia enggan ketika diperintah untuk sujud kepada Adam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44-45. “Wahai ayahku, janganlah menuruti perintah setan dan meninggalkan rahmat Allah; sungguh setan adalah makhluk yang menentang Allah Yang Maha Pengasih, dan dia enggan untuk menyembah-Nya. Wahai ayahku, aku khawatir jika engkau menyembah berhala maka engkau akan mendapat azab dari Allah Yang Maha Pengasih, sehingga engkau menjadi pengikut setan dalam memasuki neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. يٰٓأَبَتِ لَا تَعْبُدِ الشَّيْطٰنَ ۖ (Wahai bapakku, janganlah kamu menyembah syaitan) Yakni janganlah kamu mentaati setan, sebab penyembahan terhadap berhala-berhala tidak lain adalah ketaatan kepada setan. إِنَّ الشَّيْطٰنَ كَانَ لِلرَّحْمٰنِ عَصِيًّا(Sesungguhnya syaitan itu durhaka kepada Tuhan Yang Maha Pemurah) Ketika dia enggan melakukan perintah Tuhannya untuk bersujud kepada Adam. Dan makhluk yang durhaka layak untuk diambil kenikmatan darinya dan ditimpakan kepadanya siksaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Wahai bapakku, janganlah kamu menyembah dan mematuhi ajakan syaitan untuk menyembah berhala. Sesungguhnya penyembahanmu kepada berhala pada hakikatnya dalah penyembahan kepada syaitan, sebab dialah yang memerintahkanmu. Sesungguhnya bila engkau menaati syaitan untuk menyembah berhala, maka engkau menjadi penyembahnya. Sesunguhnya syaitan itu banyak durhaka kepada Tuhan Yang Maha Pemurah dan banyak membangkang atas perintah-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai ayahku, janganlah menyembah setan} janganlah menaati setan untuk menyembah berhala {Sesungguhnya setan itu kepada Tuhan Yang Maha Pemurah sangat durhaka} sangat durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Wahai bapakku, janganlah kamu menyembah setan,” karena orang yang menyembah selain Allah, maka sungguh dia telah menyembah setan, sebagaimana Allah berfirman, \"Bukankah Aku telah memerintahkan kepadamu hai Bani Adam supaya kamu tidak menyembah setan? Sesungguhnya setan itu adalah musuh yang nyata bagi kamu\", (Yasin:60) “Sesungguhnya setan itu durhaka kepada Dzat Yang Maha Pemurah (Rahman),” maka barangsiapa yang mengikuti langkah-langkah setan, berarti telah menjadikan setan sebagai pelindungnya dan telah berbuat kemaksiatan kepada Allah, layaknya perbuatan setan. Pada penyandaran kata ‘al’isyaan’ (maksiat) kepada nama ‘arrahmaan’ , mengandung makna isyarat bahwa perbuatan maksiat itu berpotensi mengahlangi seorang hamba dari rahmat Allah dan menuttup pintu-pintu rahmat baginya. Sebagaimana halnya, amalan ketaatan menjadi faktor terkuat untuk mendapatkan rahmat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 44: Yaitu dengan menaatinya untuk menyembah patung. Menurut Syaikh As Sa’diy, dikatakan menyembah setan adalah karena orang yang menyembah selain Allah sama saja menyembah setan. Barang siapa yang mengikuti jejak langkahnya, maka sama saja telah menjadikan kawannya, dan ia akan bermaksiat kepada Allah seperti halnya setan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 44",
    "description": "Nabi ibrahim menerangkan betapa tidak bermanfaatnya ibadah ayahnya selama ini. Dia berkata, 'wahai ayahku, janganlah engkau menyembah setan, yaitu patung dan berhala itu atau lainnya, dan jangan engkau ikuti bisikan makhluk pengingkar itu. Setan selalu ingin manusia tersesat dan mengingkari Allah. Sesungguhnya setan itu sejak dulu durhaka kepada tuhan yang maha pengasih. 45. Memperingatkan orang tuanya, nabi ibrahim berkata, 'wahai ayahku, aku sungguh khawatir bila engkau terus menyembah berhala dan tidak bertobat serta beribadah kepada Allah, engkau akan ditimpa azab dari tuhan yang maha pengasih yang telah menganugerahkan rahmat dan kasih-Nya kepada kita, sehingga karena siksa-Nya yang pedih itu engkau menjadi teman bagi setan di neraka dan kekal di dalamnya. '."
  }
]