[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai ayahku, sesungguhnya aku takut engkau meninggal dalam kekafiranmu, maka siksaan dari tuhan yang maha pengasih akan menimpamu, sehingga setan akan menjadi kawanmu di neraka kelak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Wahai ayahku! Aku sungguh khawatir engkau akan ditimpa azab dari Tuhan Yang Maha Pengasih jika engkau wafat dalam keadaan kafir, sehingga engkau pun menjadi pendamping dan teman setan menghadapi azab lantaran ketaatanmu padanya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَتَكُونَ لِلشَّيْطٰنِ وَلِيًّا (maka kamu menjadi kawan bagi syaitan) Yakni sehingga kamu bersamanya dalam azab sebab kamu menjadikannya sebagai kawan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Wahai bapakku, sesungguhnya aku khawatir engkau akan diazab Tuhan Yang Maha Pemurah di hari kiamat sebab menyembah berhala ini. Sehingga menjadikan engkau kawan bagi syaitan dalam laknat dan azab neraka\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai ayahku, sesungguhnya aku takut azab dari Yang Maha Pemurah menimpamu} menimpamu {sehingga kamu menjadi teman setan”} teman di dalam neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Oleh karena itu, Nabi Ibrahim mengatakan, “Wahai bapakku, sesungguhnya aku khawatir, kamu akan ditimpa azab dari Dzat Yang Maha Pemurah,” yaitu dengan sebab tindakanmu berulang-ulang dalam kekufuran dan tindakanmu yang terus menerus tenggelam dalam melampaui batas “sehingga kamu menjadi kawan bagi setan,” di dunia dan akhirat. Akibatnya, engkau akan menempati kedudukannya yang tercela, menjalani kehidupan pada wilayah kekuasaannya yang buruk. Nabi Ibrahim menempuh cara bertahap dalam mendakwahi bapaknya dengan memulai dengan cara paling lunak lalu cara-cara terlunak (setelahnya). (Pertama) Ibrahim memberitahukan tentang ilmunya seraya berkata, “Keunggulan ilmu itu menuntut ayah untuk mengikutiku, jika engkau menaatiku, maka engkau telah mendapatkan petunjuk ke jalan yang lurus.” Setelah itu, Ibrahim melarang bapaknya menyembah setan serta memberitahukan akibat-akibat buruknya. Selanjutnya (yang kedua), beliau mengingatkan bapaknya tentang azab dan siksa Allah, jika sang bapak tetap seperti itu, dan bahwa dia akan menjadi teman setan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 45: Jika engkau tidak bertobat. Yang demikian disebabkan tetap terusnya ayahnya di atas kekafiran serta sikap melampaui batas. Di neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 45",
    "description": "Memperingatkan orang tuanya, nabi ibrahim berkata, 'wahai ayahku, aku sungguh khawatir bila engkau terus menyembah berhala dan tidak bertobat serta beribadah kepada Allah, engkau akan ditimpa azab dari tuhan yang maha pengasih yang telah menganugerahkan rahmat dan kasih-Nya kepada kita, sehingga karena siksa-Nya yang pedih itu engkau menjadi teman bagi setan di neraka dan kekal di dalamnya. ' 46. Peringatan ibrahim yang disampaikan dengan lembut, santun, dan berkali-kali tetap tidak mampu menyadarkan ayahnya. Karena keyakinan salah itu sudah mendarah daging pada diri ayahnya, dia berkata dengan kesal, 'bencikah engkau kepada tuhan-tuhanku, wahai ibrahim, sehingga engkau terus mengajakku meninggalkan sesembahan itu dan memintaku beribadah hanya kepada tuhan yang esa' jika engkau tidak berhenti dari permintaanmu dan tetap mencela tuhanku, pasti engkau akan kurajam, kulempari dirimu dengan batu sampai mati. Bila engkau tidak ingin hal ini terjadi, maka tinggalkanlah aku untuk waktu yang lama agar amarahku reda dan engkau tidak lagi mencela sesembahanku. '."
  }
]