[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ayah ibrahim berkata kepada anaknya, ”apakah engkau berpaling dari menyembah sesembahanku, wahai ibrahim? jika engkau tidak berhenti mencelanya, niscaya aku akan benar-benar membunuhmu dengan lemparan batu-batuan (kepadamu) pergilah dariku, jangan engkau temui aku, dan jangan biicara kepadaku untuk waktu yang lama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Āzar berkata kepada putranya Ibrahim -'alaihissalām-, \"Apakah engkau benci dan berpaling dari patung-patung yang aku sembah wahai Ibrahim? Jika engkau tidak berhenti dari mencela patung-patung sesembahanku pasti aku akan merajammu dengan bebatuan, maka tinggalkanlah aku untuk waktu yang lama, jangan sekali-kali berbicara dan tinggal bersamaku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Ayahnya, Azar menjawabnya dengan kasar dan penuh pengingkaran: “Hai Ibrahim, apakah kamu berpaling dari penyembahan tuhan-tuhanku?” Kemudian dia mengancamnya akan membunuh dan mengusirnya: “Jika kamu tidak menghentikan ucapan dan keyakinanmu, maka aku akan membunuhmu dengan melemparimu batu; pergilah dari hadapanku karena aku tidak ingin melihatmu lagi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. قَالَ أَرَاغِبٌ أَنتَ عَنْ ءَالِهَتِى يٰٓإِبْرٰهِيمُ ۖ (Berkata bapaknya: “Bencikah kamu kepada tuhan-tuhanku, hai Ibrahim?) Yakni apakah kamu berpaling dari berhala-berhala itu dan condong kepada selain mereka? لَئِن لَّمْ تَنتَهِ لَأَرْجُمَنَّكَ ۖ (Jika kamu tidak berhenti, maka niscaya kamu akan kurajam) Yakni aku lempari dengan batu. Pendapat lain mengatakan maknanya adalah aku akan mencelamu. وَاهْجُرْنِى مَلِيًّا (dan tinggalkanlah aku buat waktu yang lama) Yakni tinggalkanlah aku dalam waktu yang lama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Sambil mengancam bapak nabi Ibrahim, Azar mengatakan: \"Bencikah kamu kepada tuhan-tuhanku, hai Ibrahim? Sehingga kamu berpaling dari mereka kepada tuhan lain? Jika kamu tidak berhenti berkata dan menentang mereka, maka niscaya kamu akan kurajam dengan batu dan akan aku kutuk engkau. Takutlah engkau padaku. Tinggalkanlah aku, pergilah dalam waktu yang lama\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Ayahnya menjawabnya {“Apakah kamu membenci} membenci {tuhan-tuhanku} menyembah berhala-berhalaku {wahai Ibrahim. Jika tidak berhenti, kamu pasti akan kurajam} sungguh aku pasti akan melemparimu batu {Tinggalkanlah aku} tinggalkanlah aku {untuk waktu yang lama”} waktu yang lama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Namun, dakwah ini tidak mempan bagi bapaknya yang celaka itu. Bahkan dia meresponnya dengan jawaban orang yang jahil. Bapaknya mengatakan, “Apakah kamu benci kepada tuhan-tuhanku, hai Ibrahim?” dan membanggakan diri dengan tuhan-tuhannya yang terbuat dari batu dan berhala, lalu mencela Ibrahim karena benci kepada tuhan-tuhan ini. Sikap ini termasuk bentuk kebodohan yang parah dan kekufuran yang begitu buruk. Dia memuji diri sendiri dengan peribadatannya kepada setan dan (ditambah dengan) menyeru kepadanya. “JIka kamu tidak berhenti,” maksudnya berhenti dari mencela tuhan-tuhanku dan tidak berhenti mendakwahiku kepada peribadahan kepada Allah “maka niscaya kamu akan kurajam” yaitu dibunuh dengan batu “dan tinggalkanlah aku buat waktu yang lama,” maksudnya, janganlah engkau mengajakku berbicara dalam waktu yang lama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 46: Sehingga engkau mencelanya. Yakni dari mencela sesembahan-sesembahanku dan dari mengajakku beribadah kepada Allah. Yakni kulempari dengan batu atau aku caci-maki dengan kata-kata yang jelek."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 46",
    "description": "Peringatan ibrahim yang disampaikan dengan lembut, santun, dan berkali-kali tetap tidak mampu menyadarkan ayahnya. Karena keyakinan salah itu sudah mendarah daging pada diri ayahnya, dia berkata dengan kesal, 'bencikah engkau kepada tuhan-tuhanku, wahai ibrahim, sehingga engkau terus mengajakku meninggalkan sesembahan itu dan memintaku beribadah hanya kepada tuhan yang esa' jika engkau tidak berhenti dari permintaanmu dan tetap mencela tuhanku, pasti engkau akan kurajam, kulempari dirimu dengan batu sampai mati. Bila engkau tidak ingin hal ini terjadi, maka tinggalkanlah aku untuk waktu yang lama agar amarahku reda dan engkau tidak lagi mencela sesembahanku. '47. Mendapat ancaman itu ibrahim sadar ayahnya sudah tidak dapat diperingatkan. Dengan tetap santun, dia berkata, 'selamat berpisah, ayah tercinta. Semoga keselamatan selalu dilimpahkan kepadamu. Ketahuilah bahwa aku akan terus memohonkan ampunan bagimu kepada tuhanku yang maha pengampun. Sesungguhnya dia sangat baik kepadaku dan mengabulkan doaku."
  }
]