[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ibrahim berkata kepada ayahnya, ”semoga keselamatan dariku selalu menaungimu, engkau tidak akan tertimpa sesuatu perlakuan yang buruk dariku. Dan aku akan berdoa kepada Allah bagimu agar engkau memperoleh hidayah dan ampunan. Sesungguhnya, Tuhanku Maha penyayang lagi Maha pengasih terhadap keadaanku, Dia mengabulkan permohonnanku ketika aku berdoa kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Ibrahim berkata kepada ayahnya, \"Semoga keselamatan dilimpahkan kepadamu, engkau tidak akan ditimpa kesusahan dariku, dan aku akan memohonkan ampunan dan petunjuk bagimu dari Tuhanku karena sungguh Dia sangat baik kepadaku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Maka Ibrahim menjawabnya dengan lembut: “Semoga keselamatan menyertaimu sehingga engkau tidak mendapat gangguan dariku, aku akan meminta ampun dari Tuhanku bagimu karena Dia sangat lembut dalam menjagaku dengan baik. Aku akan meninggalkan kalian dan apa yang kalian sembah selain Allah, dan aku akan berdoa dan menyembah Tuhanku semata dengan harapan Dia tidak mengazabku.” Ketika ayahnya terus menerus dalam kekafiran, Ibrahim kemudian berlepas diri darinya; sebagaimana disebutkan dalam firman Allah: وَمَا كَانَ ٱسْتِغْفَارُ إِبْرَٰهِيمَ لِأَبِيهِ إِلَّا عَن مَّوْعِدَةٍ وَعَدَهَآ إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُۥٓ أَنَّهُۥ عَدُوٌّ لِّلَّهِ تَبَرَّأَ مِنْهُ Dan permintaan ampun dari Ibrahim (kepada Allah) untuk bapaknya tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya itu. Maka, tatkala jelas bagi Ibrahim bahwa bapaknya itu adalah musuh Allah, maka Ibrahim berlepas diri dari padanya. (at-Taubah: 114)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. قَالَ سَلٰمٌ عَلَيْكَ (Berkata Ibrahim: “Semoga keselamatan dilimpahkan kepadamu) Ini merupakan salam perpisahan, seperti dalam firman-Nya: وإذا خاطبهم الجاهلون قالوا سلاما “dan apabila orang-orang jahil menyapa mereka, mereka mengucapkan kata-kata (yang mengandung) keselamatan.” سَأَسْتَغْفِرُ لَكَ رَبِّىٓ ۖ( aku akan memintakan ampun bagimu kepada Tuhanku) Nabi Ibrahim menjanjikannya untuk meminta Allah ampunan baginya untuk mengundang kasih sayangnya dan harapan agar ia berubah menjadi lembut dan tidak keras hati. Janji ini Nabi Ibrahim sampaikan sebelum mengetahui bahwa ayahnya akan mati dalam keadaan kafir. إِنَّهُۥ كَانَ بِى حَفِيًّا(Sesungguhnya Dia sangat baik kepadaku) Yakni Allah sangat baik dan lembut kepadaku, serta mengabulkan doa-doaku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Nabi Ibrahim berkata: \"Semoga keselamatan dilimpahkan kepadamu, aku akan memintakan ampun bagimu kepada Tuhanku dan juga petunjuk. Sesungguhnya Dia sangat baik kepadaku, sehingga Dia mengabulkan doaku. Nabi Ibrahim telah menepati janjinya dengan berdoa: “Ya Allah, ampunilah bapakku.” (Asy-Syu’aro:86) Doa ini adalah janji yang ditepati sebelum mengetahui bahwa bapak Nabi Ibrahim mati dalam kekufuran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Ibrahim berkata kepada ayahnya {“Semoga keselamatan bagimu} doa selamat dariku agar kamu tidak ditimpa murka {Aku akan memohonkan ampunan bagimu kepada Tuhanku. Sesungguhnya Dia Maha baik kepadaku} sangat baik dan lembut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Maka Ibrahim menanggapinya denan tanggapan para hamba Allah ketika berbicara dengan orang-orang jahil, dan tidak mencelanya. Bahkan sebaliknya bersabar dan tidak membalas perkataaan bapaknya dengan sesuatu yang tidak disukainya. Ibrahim mengatakan, “Semoga keselamatan dilimpahkan kepadamu,” maksudnya engkau selamat dalam perbincanganku dengan ayah, yaitu terhindar dari celaanku, hinaanku, segala yang engkau benci “aku akan meminta ampun bagimu kepada Rabbku. Sesungguhnya Dia sangat baik kepadaku,” maksudnya saya akan senantiasa memohonkan hidayah dan ampunan kepada Allah buat ayah, agar Allah memberikan hidayah kepada ayah untuk memeluk Islam yang akan menjadi penyebab datangnya ampunan. “Sesungguhnya Dia sangat baik kepadaku,” maksudnya DIa (Allah) sangat saying kepadaku, sangat perhatian kepadaku. Beliau terus saja memohon ampun buat bapaknya, berharap Allah berkenan memberikan petunjuk. Setelah jelas bagi Ibrahim bahwa bapaknya adalah musuh Allah, dan bahwasanya ia tidak akan memberikan manfaat sama sekali buat ayahnya, maka Ibrahim berhenti memohonkan ampun baginya dan berlepas diri dari bapaknya. Allah telah memerintahkan kepada kita sekalian agar mengikuti millah (ajaran) Ibrahim. Di antara bentuk mengikuti ajaran Ibrahim, adalah mengikuti metode beliau dalam berdakwah ke jalan Allah, yaitu dengan ilmu, hikmah, lemah-lembut dan (dengan metode yang ) memudahkan, menempuh satu tahapan ke tahapan berikutnya, bersabar dalam menjalankan dakwah dan tidak bosan, bersabar terhadap segala gangguan dari orang lain yang menimpa seorang da’I, baik berupa perkataan ata perbuatan, membalasnya dengan pemberian maaf, atau bahkan dengan berlaku baik, dengan perkataan ataupun perbuatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 47: Nabi Ibrahim ‘alaihis salam menjawab dengan jawaban ‘ibadurrahman (hamba-hamba Ar Rahman) terhadap ucapan orang-orang yang bodoh, dan tidak membalas, bahkan bersabar serta tidak menyikapi ayahnya dengan sikap yang buruk. Bisa juga diartikan, “Keselamatan atasmu” yakni engkau akan serlamat dari perkataan dan sikap yang menyakitkan dariku. Maka Nabi Ibrahim melakukan janjinya itu dengan memintakan ampunan untuk ayahnya. Hal ini sebelum jelas baginya, bahwa ayahnya adalah musuh Allah. Setelah jelas bahwa ayahnya adalah musuh Allah, maka beliau tidak memintakan ampunan untuknya serta berlepas diri darinya. Allah Subhaanahu wa Ta'aala memerintahkan kita untuk mengikuti agama Nabi Ibrahim, di antaranya adalah mengikuti jejaknya dalam berdakwah kepada Allah, dengan ilmu, hikmah (kebijaksanaan), lembut, halus dan bertahap serta bersabar di atasnya dan tidak bosan, demikian pula bersabar terhadap gangguan orang lain baik yang berupa ucapan (seperti caci-maki) maupun perbuatan (seperti disakiti), menyikapinya dengan memaafkan, bahkan dengan sikap ihsan baik yang berupa ucapan maupun perbuatan. Sangat sayang dan perhatian kepadaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 47",
    "description": "Mendapat ancaman itu ibrahim sadar ayahnya sudah tidak dapat diperingatkan. Dengan tetap santun, dia berkata, 'selamat berpisah, ayah tercinta. Semoga keselamatan selalu dilimpahkan kepadamu. Ketahuilah bahwa aku akan terus memohonkan ampunan bagimu kepada tuhanku yang maha pengampun. Sesungguhnya dia sangat baik kepadaku dan mengabulkan doaku. 48. Wahai ayah, aku akan pergi dan aku akan menjauhkan diri darimu, dan dari kaum penyembah berhala serta dari apa saja yang engkau sembah selain Allah, dan aku akan terus berdoa kepada tuhanku agar petunjuk- nya terlimpah kepadamu. Mudah-Mudahan aku tidak akan kecewa dengan berdoa kepada tuhanku. Aku yakin dia maha pemurah dan mengabulkan doa hamba-Nya. '."
  }
]