[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan aku tinggalkan kalian dan sesembahan yang kalian sembah, dan aku hanya berdoa kepada Tuhanku dengan ikhlas. Semoga aku tidak kecewa dengan do’a ku kepada Tuhanku, lantaran Dia mamberiku apa yang aku minta kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan aku akan menjauhkan diri darimu dan dari sesembahan-sesembahan yang kalian sembah selain Allah, dan aku akan berdoa kepada Tuhanku semata, tidak menyekutukannya dengan apa pun. Semoga Dia tidak menghalangi permohonanku jika aku berdoa kepada-Nya, sehingga aku tidak kecewa dalam berdoa pada-Nya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَأَعْتَزِلُكُمْ وَمَا تَدْعُونَ مِن دُونِ اللهِ (Dan aku akan menjauhkan diri darimu dan dari apa yang kamu seru selain Allah) Yakni aku akan berhijrah dari kalian dan sesembahan kalian dengan membawa agamaku ketika kalian telah menolak nasehatku dan seruanku tidak bermanfaat bagi kalian. وَأَدْعُوا۟ رَبِّى(dan aku akan berdoa kepada Tuhanku) Kepada-Nya semata. عَسَىٰٓ أَلَّآ أَكُونَ بِدُعَآءِ رَبِّى شَقِيًّا(mudah-mudahan aku tidak akan kecewa dengan berdoa kepada Tuhanku”) Yakni semoga aku tidak kecewa. Pendapat lain mengatakan yakni semoga aku tidak bermaksiat. Terdapat pendapat mengatakan bahwa ini adalah doa agar Allah mengaruniakannya seorang anak dan keluarga agar menjadi penghibur hati dalam hijrahnya dan penenang jiwanya dari ketakutan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Aku akan menjauhkan diri darimu dan dari apa yang kamu sembah selain Allah, dan aku akan berdoa kepada Tuhanku, mudah-mudahan aku tidak akan kecewa dengan berdoa kepada Tuhanku, sebagaimana apa yang kalian terima ketika berdoa kepada sesembahan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Aku akan menjauh dari kalian} Aku menjauhi kalian {dan apa yang kalian sembah} kalian sembah {selain Allah. Aku berdoa kepada Tuhanku semoga aku tidak kecewa} kecewa karena tidak dijawab {dengan doaku kepada Tuhanku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Setelah merasa putus asa dari kaum dan bapaknya, Ibrahim mengatakan, “Dan aku akan menjauhkan diri darimu dan dari apa yang kamu seru selain Allah,” yaitu dari kalian dan arca-arca kalian “dan aku akan berdoa kepada Rabbku.” Ini mencakup doa ibadah dan doa mas’alah ( doa permohonan). “Mudah-mudahan aku tidak akan kecewa dengan berdoa kepada Rabbku,” maksudnya semoga Allah membahagiankanku dengan mengabulkan doaku dan menerima amalan-amalanku. Ini adalah kewajiban (yang mesti ditempuh oleh) orang yang merasa putus asa dari (respon) orang-orang yang menjadi obyek dakwahnya, (mereka justru mengikuti hawa nafsu, nasihat-nasihatnya sudah tidak bermanfaat buat mereka, mereka laruut dalam pelanggaran dalam keadaan buta), hendaknya ia (orang yang merasa putus asa) memperbaiki dirinya, berharap agar amalnya di terima oleh Allah, menjauhi perbuatan jelek dan para pelakunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 48: Ketika Nabi Ibrahim melihat bahwa kaumnya dan ayahnya tidak dapat lagi diharapkan keimanannya. Bisa juga diartikan, “dan aku hanya beribadah kepada Tuhanku (saja).” Sebagaimana kalian kecewa ketika berdoa kepada patung-patung. Inilah tugas da’i yang melihat bahwa orang yang didakwahkannya tidak bisa diharapkan lagi, yaitu ketika mereka mengikuti hawa nafsunya, nasehat tidak lagi berguna, dan mereka terombang-ambing dalam kesesatan, hendaknya ia menyibukkan diri memperbaiki dirinya, mengharap kepada Tuhannya agar amalnya diterima, menjauhi keburukan dan orang-orangnya (‘uzlah), lihat pula surah Al Maa’idah: 105."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 48",
    "description": "Wahai ayah, aku akan pergi dan aku akan menjauhkan diri darimu, dan dari kaum penyembah berhala serta dari apa saja yang engkau sembah selain Allah, dan aku akan terus berdoa kepada tuhanku agar petunjuk- nya terlimpah kepadamu. Mudah-Mudahan aku tidak akan kecewa dengan berdoa kepada tuhanku. Aku yakin dia maha pemurah dan mengabulkan doa hamba-Nya. '49. Setelah minta izin kepada orang tuanya, maka nabi ibrahim pun pergi. Ketika dia sudah menjauhkan diri dari mereka dan dari apa yang mereka sembah selain Allah, kami muliakan dia dan limpahkan rahmat kepadanya. Kami anugerahkan kepadanya ishak sebagai anak yang sekian lama dirindukan kehadirannya, dan kami anugerahkan pula kepadanya yakub sebagai cucu yang melanjutkan keturunan dan perjuangannya. Keduanya adalah orang-orang saleh dan masing-masing kami angkat menjadi nabi yang menyeru umatnya untuk menaati perintah Allah."
  }
]