[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika dia meninggalkan mereka dan sesembahan mereka yang mereka sembah selain Allah, Kami beri dia anak keturunan; ishaq dan ya’qub bin ishaq, dan Kami jadikan mereka berdua sebagai nabi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Maka ketika ia menjauhi mereka dan tuhan-tuhan yang mereka sembah selain Allah, Kami pun mengganti rasa kehilangan keluarganya dengan menganugerahkan kepadanya Isḥāq, dan kemudian Ya'qūb sebagai cucunya, yang masing-masing mereka Kami angkat menjadi Nabi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Setalah Ibrahim meninggalkan kaumnya yang kafir dan berhala-berhala mereka, Kami karuniakan kepadanya keturunan yang beriman, yaitu anak yang bernama Ishaq dan cucu yang bernama Ya’qub dan Kami jadikan keduanya sebagai nabi. Dan Kami muliakan mereka semua dari rahmat Kami berupa kebaikan-kebaikan dalam agama dan dunia, dan Kami jadikan bagi mereka pujian yang baik hingga hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُونَ مِن دُونِ اللهِ (Maka ketika Ibrahim sudah menjauhkan diri dari mereka dan dari apa yang mereka sembah selain Allah) Nabi Ibrahim berhijrah di jalan Allah menuju Baitul Maqdis sebagai tempatnya untuk menjalankan ritual agamanya. وَهَبْنَا لَهُۥٓ إِسْحٰقَ(Kami anugerahkan kepadanya Ishak) Anak Nabi Ibrahim. وَيَعْقُوبَ ۖ( dan Ya’qub) Cucu Nabi Ibrahim. Mereka adalah sebagai ganti atas keluarga yang ditinggalkan berhijrah. وَكُلًّا جَعَلْنَا نَبِيًّا(Dan masing-masingnya Kami angkat menjadi nabi) Yakni keduanya Kami jadikan sebagai Nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Maka ketika Ibrahim sudah menjauhkan diri dari mereka dan dari sesembahan yang mereka sembah selain Allah, Kami anugerahkan kepadanya Ishak, dan Ya´qub. Dan masing-masing mereka Kami angkat menjadi nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika dia sudah menjauh dari mereka} berpisah dengan mereka {dan dari apa yang mereka sembah selain Allah, Kami menganugerahkan kepadanya Ishaq dan Ya‘qub. Masing-masing Kami angkat menjadi nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Lantaran meninggalkan negeri, kampung halaman, keluarga dan orang-orang sebangsanya merupakan perkara berat bagi seseorang, karena alasan yang banyak yang sudah dimaklumi bersama, di antaranya (menjalani hidup) sebatang kara jauh dari komunitas yang menjadikannya merasa kkuat lagi merasa diperhitungkan jumlah populasinya; maka barangsiapa meninggalkan sesuatu karean Allah, niscaya Dia akan menggantikannya dengan sesuatu yang lebih baik, lantas Ibrahim meninggalkan kaumnya. Maka, Allah berfirman tentangnya, “Maka ketika Ibrahim sudah menjauhkan diri dari mereka dan dari apa yang mereka sembah selain Allah, Kami anugerahkan kepadanya Ishaq, dan Ya’qub. Dan masing-maisngnya,” yaitu Ishaq dan Ya’qub “Kami angkat menjadi nabi.” Anugerah itu berhasil diraih oleh beliau dan orang-orang shalih yang diutus (sebagai rasul) kepada umat manusia, yang diistimewakan oleh Allah dengan wahyunya, dipilih untuk mengemban risalahNya, dan telah diseleksi di antara semua manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 49: Oleh karena meninggalkan kampung halaman, keluarga dan kaumnya adalah sesuatu yang paling berat bagi seseorang, dan Nabi Ibrahim meninggalkan semua itu karena Allah, maka Allah menggantinya dengan yang lebih baik darinya, Allah menganugerahkan kepadanya seorang anak, yaitu Ishak, dan daripadanya lahir Ya’kub. Dengan pergi menuju negeri yang disucikan (muqaddas)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 49",
    "description": "Setelah minta izin kepada orang tuanya, maka nabi ibrahim pun pergi. Ketika dia sudah menjauhkan diri dari mereka dan dari apa yang mereka sembah selain Allah, kami muliakan dia dan limpahkan rahmat kepadanya. Kami anugerahkan kepadanya ishak sebagai anak yang sekian lama dirindukan kehadirannya, dan kami anugerahkan pula kepadanya yakub sebagai cucu yang melanjutkan keturunan dan perjuangannya. Keduanya adalah orang-orang saleh dan masing-masing kami angkat menjadi nabi yang menyeru umatnya untuk menaati perintah Allah. 50. Kami limpahkan mereka nikmat dan kami anugerahkan pula kepada mereka sebagian dari rahmat kami di dunia dan akhirat, seperti keturunan yang saleh, kenabian bagi anak cucunya, dan lainnya. Kami angkat derajat mereka dan kami jadikan mereka buah tutur bagi orang-orang sesudahnya sehingga mereka meninggalkan kesan dan nama yang baik dan mulia sepanjang masa."
  }
]