[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya aku khawatir terhadap kerabatku dan orang-orang dari keluarga besarku setelah kematianku kelak mereka tidak menjalankan ajaran agamaMu dengan sebaik-baiknya, dan tidak menyeru hamba-hambaMu kepadaMU sedang istriku adalah seorang wanita yang mandul, tidak bisa melahirkan, maka anugerahilah aku dari sisiMu seorang anak yang menjadi pewaris lagi penolong."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan sungguh aku khawatir terhadap kerabatku sepeninggalku, bila mereka tidak menegakkan agama ini lantaran kesibukan mereka dengan urusan dunia, padahal istriku seorang wanita mandul yang tidak bisa melahirkan anak, maka anugerahkanlah kepadaku dari sisi-Mu seorang anak yang akan membantuku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Dan aku khawatir para kerabatku akan mewarisiku setelah kematianku kemudian mereka menyia-nyiakan agama ini, sedangkan istriku adalah wanita yang mandul; maka berikanlah kepadaku dengan karunia-Mu seorang anak yang shalih.” Syeikh as-Syinqithi berkata: Firman Allah dalam ayat ini (فهب لي من لدنك وليا) yang dimaksud dengan (ولي) ‘pengganti’ di sini adalah anak, bukan para pengganti yang lain; dengan dalil firman Allah dalam kisah ini: هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُۥ ۖ قَالَ رَبِّ هَبْ لِى مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً Di sanalah Zakariya mendoa kepada Tuhannya seraya berkata: \"Ya Tuhanku, berilah aku dari sisi Engkau seorang anak yang baik. (Ali Imran: 38). Dan disebutkan juga dalam firman Allah bahwa yang dimaksud adalah seorang anak: وَزَكَرِيَّآ إِذْ نَادَىٰ رَبَّهُۥ رَبِّ لَا تَذَرْنِى فَرْدًا وَأَنتَ خَيْرُ ٱلْوَٰرِثِينَ Dan (ingatlah kisah) Zakaria, tatkala ia menyeru Tuhannya: \"Ya Tuhanku janganlah Engkau membiarkan aku hidup seorang diri dan Engkaulah Waris Yang Paling Baik. (al-Anbiya: 89). Dan dalam firman Allah ini, yang dimaksud dengan (لا تذرني فردا) yakni sendirian tanpa seorang anak. Adapun maksud dari firman Allah (وَإِنِّى خِفْتُ ٱلْمَوَٰلِىَ مِن وَرَآءِى) ‘Dan sesungguhnya aku khawatir terhadap mawaliku sepeninggalku’ yakni setelah aku mati aku takut mereka akan mengubah agama ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَإِنِّى خِفْتُ الْمَوٰلِىَ مِن وَرَآءِى (Dan sesungguhnya aku khawatir terhadap mawaliku sepeninggalku) Makna (الموالي) yakni para kerabat dan sanak yang lain yang berasal dari anak keturunan paman dan yang lainnya. Yakni sanak kerabat Nabi Zakariya adalah orang-orang yang lalai dalam urusan agama. Mereka lemah sekali dalam membawa risalah agamanya, atau sibuk dengan dunia sehingga melalaikan urusan agama bani Israil. Oleh sebab itu Nabi Zakariya takut agama ini akan lenyap dengan kematiannya, sehingga dia meminta seorang pengganti yang menempati posisinya setelah kematiannya yang peduli terhadap agama. وَكَانَتِ امْرَأَتِى عَاقِرًا(sedang isteriku adalah seorang yang mandul) Makna (العاقر) adalah perempuan yang tidak dapat melahirkan lagi karena telah lanjut usia. فَهَبْ لِى مِن لَّدُنكَ وَلِيًّا (maka anugerahilah aku dari sisi Engkau seorang pengganti) Nabi Zakariya tidak secara langsung meminta seorang anak, sebab ia mengetahui bahwa dia dan istrinya telah masuk dalam keadaan yang tidak memungkinkan untuk mendapatkan seorang anak. Pendapat lain mengatakan bahwa dalam doanya itu Nabi Zakariya mengharapkan seorang anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya aku khawatir terhadap keluargaku Bani Am sepeninggalku mereka yang akan menjadi pewarisku sehingga mereka menyia-nyiakan agama. Sebab mereka dulu acuh terhadap urusan agama, sedang isteriku adalah seorang yang mandul: tidak bisa melahirkan. Maka anugerahilah aku seorang putera dari sisi-Mu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya aku khawatir terhadap keluargaku} kerabatku dan golonganku {sepeninggalku} setelah kematianku {dan istriku adalah seorang yang mandul} mandul tidak melahirkan anak {Anugerahilah aku dari sisiMu} dari sisiMu {seorang anak} seorang anak yang menjadi pewaris dan pendukung(ku)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dan sesungguhnya aku khawatir terhadap mawaliku sepeninggalku,” maksudnya saya mengkhawatirkan orang yang mengendalikan urusan pada Bani Israil setelah kematianku, mereka tidak menjalankan agamaMu dengan sebaik-baiknya dan tidak mendakwahi hamba-hambaMu (agar beribadah) kepadaMu. Secara eksplisit, perkataan beliau ini menunjukkan bahwa beliau belum mendapatkan salah seorang dari mereka yang mempunyai kapabilitas untuk menjadi pemimpin agama. Dalam ungkapan ini terdapat bukti kasih sayang Nabi Zakaria dan ketulusan hatinya, dan bahwa permintaannya agar diberi anak, bukan seperti permintaan orang lain, yang tujuannya semata-mata kemaslahatan duniawi. Tujuan Nabi Zakaria adalah kemaslahatan agama dan kekhawatiran agama ini lenyap. Beliau memandang orang lain tidak pantas untuk itu. Dan keluarga Nabi Zakaria termasuk keluarga-keluarga yang terkenal dalam masalah agama, sumber risalah dan tempat mencari kebaikan. Maka beliau berdoa keppada Allah agar dikarunia seorang anak yang akan menegakkan agama sepeninggalnya. Beliau mengadukan bahwa istrinya mandul, maksudnya tidak bisa melahirkan sama sekali, sementara beliau sendiri sudah mencapai usia tua. Maknanya, sudah mencapai batas usia yang jarang memiliki gejolak syahwat (kepada wanita) dan (memperoleh) anak. “Maka anugerahilah aku seorang wali (putra) dari sisiMu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 5: Yang dimaksud oleh Zakaria dengan mawali adalah orang yang akan mengendalikan dan melanjutkan urusan yang terkait dengan agama sepeninggalnya dan yang memimpin Bani Israil serta yang mengajak mereka kepada Allah. Zakaria khawatir kalau orang-orang yang menggantikannya adalah orang-orang tidak dapat melaksanakan urusan itu dengan baik, karena tidak seorang pun di antara mereka yang dapat dipercaya, oleh sebab itu Beliau meminta dianugerahi seorang anak. Nampaknya, Beliau tidak melihat adanya orang yang layak memegang posisi imaamah fid din (pemimpin dalam agama). Hal ini menunjukkan perhatian Beliau kepada kaumnya, dan lagi permintaan Beliau agar dianugerahi anak tidak seperti permintaan orang lain, bahkan untuk maslahat agama dan agar agama ini tidak hilang. Beliau melihat bahwa selain Beliau tidak cocok terhadap imamah fid din, dan ketika itu hanya rumah Beliau yang paling terkenal tentang kebaikan agamanya, oleh karenanya Beliau meminta kepada Allah agar dianugerahkan seorang anak yang akan menegakkan agama-Nya setelah Beliau wafat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 5",
    "description": "Dan sungguh, di masa tuaku ini aku selalu merasa khawatir terhadap kerabatku sepeninggalku kelak bila engkau memanggilku, padahal istriku seorang yang mandul sejak masa mudanya, maka anugerahilah aku dengan rahmat dan kasih sayang-Mu seorang anak dari sisi-Mu yang akan melanjutkan keturunanku dan menggantikanku menyebarkan hukum dan ajaran-Mu. 6. Ya tuhanku, aku berharap anak itu kelak menjadi penerusku yang akan mewarisi aku dalam tugas-tugasku sebagai penyeru umat dan mewarisi dari keluarga yakub yang melanjutkan tradisi dan agama nabi ibrahim. Kabulkanlah doaku dan jadikanlah dia, ya tuhanku, seorang yang selalu diridai dan dirahmati. '."
  }
]