[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami anugerahkan kepada mereka semua karunia yang tak terhitung dari rahmat Kami. Dan Kami jadikan bagi mereka kesan yang baik dan sanjungan indah yang langgeng di tengah manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan Kami anugerahkan kepada mereka rahmat yang sangat banyak beserta kenabian tersebut, dan Kami jadikan mereka buah tutur yang baik yang terus-menerus diperbincangkan oleh manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَوَهَبْنَا لَهُم مِّن رَّحْمَتِنَا (Dan Kami anugerahkan kepada mereka sebagian dari rahmat Kami) Berupa kenabian, kitab, harta, dan anak keturunan. وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا(dan Kami jadikan mereka buah tutur yang baik lagi tinggi) Makna (لسان الصدق) adalah pujian baik yang diucapkan oleh para hamba Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Kami anugerahkan kepada mereka sebagian rahmat Kami berupa kebaikan dunia dan akhirat, berupa harta anak dan lembaran. Serta Kami jadikan mereka buah tutur yang baik lagi tinggi sampai hari kiamat. Penggunaan lisan adalah yang berkaitan dengan pujian yang diucapkan lisan, sebagaimana penggunaan tangan untuk memberi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menganugerahkan kepada mereka sebagian dari rahmat Kami} ilmu, derajat, harta dan anak {dan Kami menjadikan mereka lisan yang baik lagi mulia} terpuji, baik, tinggi, dan tetap pada manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “Dan Kami anugerahkan kepada mereka,” Ibrahim dan kedua anak cucunya, Ishaq dan Ya’qub “sebagian dari rahmat Kami.” Hal ini mencakup semua rahmat Allah kepada mereka berupa ilmu-ilmu yang bermanfaat, amal-amal shalih, anak keturunan yang banyak, dan tersebar kemana-mana yang banyak di antara mereka yang menjadi rasul, nabi, dan orang-orang shalih. “Dan Kami jadikan mereka tutur kata yang baik lagi tinggi.” Ini juga termasuk rahmat yang Allah berikan kepada mereka. Karena Allah menjanjikan bagi orang-orang yang melakukan kebaikan, akan disebarluaskan pujiannya yang murni sesuai denagn kadar kebaikannya. Sementara mereka ini (Nabi Ibrahim dan anak keturunannya) adalah para panutan orang-orang yang berbuat baik. Maka, Allah pun menghembuskan pujian yang baik lagi sejati, bukan sebuah kedustaan yang meninggi, tidak tersembunyi. Penyebutan nama-nama mereka memenuhi dua ufuk dunia. Pujian dan kecintaan kepada mereka memenuhi seluruh hati dan membasahi lisan-lisan. Maka, jadilah mereka panutan dan imam bagi orang-orang yang mendapatkan petunjuk. Nama-nama mereka selalu disebut-sebut berulang kali di setiap masa. Ini merupakan karunia Allah yang diberikan kepada orang yang dikehendaki. Dan sesunngguhnya Allah maha Memiliki karunia yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 50: Yakni Ibrahim dan anak-anaknya. Yaitu ilmu yang bermanfaat, amal yang saleh, dan keturunan yang banyak, di mana banyak yang menjadi nabi dan wali, serta diberikan kecukupan rezeki. Di setiap umat. Mereka adalah para pemimpin orang-orang yang berbuat ihsan, Allah tebarkan pujian yang baik lagi tinggi di tengah-tengah manusia, nama mereka disebut-sebut, mereka pun dijadikan teladan, dan dicintai oleh manusia. Oleh karenanya, banyak manusia yang menamai anak-anak mereka dengan nama para nabi dan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 50",
    "description": "Kami limpahkan mereka nikmat dan kami anugerahkan pula kepada mereka sebagian dari rahmat kami di dunia dan akhirat, seperti keturunan yang saleh, kenabian bagi anak cucunya, dan lainnya. Kami angkat derajat mereka dan kami jadikan mereka buah tutur bagi orang-orang sesudahnya sehingga mereka meninggalkan kesan dan nama yang baik dan mulia sepanjang masa. 51. Selesai bertutur tentang kisah nabi ibrahim, Allah beralih menjelaskan kisah nabi musa. Wahai nabi Muhammad, dan ceritakanlah kisah nabi musa sesuai wahyu di dalam kitab Al-Qur'an. Jelaskan bahwa dia benar-benar orang yang terpilih karena keteguhan sikap dan ketulusan hatinya. Dia juga terpilih sebagai seorang rasul yang diutus kepada bani israil dan nabi yang mulia dan tinggi kedudukannya."
  }
]