[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ceritakanlah (wahai rasul) di dalam al-qur’an ini kisah Musa . sesungguhnya dia orang pilihan dan terbaik, dan dia seorang rasul dan nabi dari salah seorang dari para rasul ulul azmi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan ceritakanlah -wahai Rasul- kisah Musa -'alaihissalām- dalam Al-Qur`ān yang diturunkan kepadamu. Sungguh dia benar-benar orang yang terpilih, juga seorang Nabi dan Rasul."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Hai Rasulullah, ceritakanlah dalam al-Qur’an kisah Musa; Allah telah memilihnya dan menjadikannya seorang rasul kepada hamba-hamba-Nya dan nabi yang menyampaikan syariat Allah kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. إِنَّهُۥ كَانَ مُخْلَصًا (Sesungguhnya ia adalah seorang yang dipilih) Yakni Kami jadikannya orang yang terpilih; atau Kami selamatkan dia dari kesyirikan dan kemaksiatan. وَكَانَ رَسُولًا نَّبِيًّا(dan seorang rasul dan nabi) Yang diutus Allah kepada para hamba-Nya dan Allah mewahyukan kepadanya syariat-syariat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Ceritakanlah wahai Nabi, kepada mereka, kisah Musa di dalam Al Quran ini. Sesungguhnya ia adalah seorang yang dipilih dan seorang rasul dari hamba-Nya dan nabi untuk menyampaikan syariat-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ceritakanlah dalam kitab (Al-Qur’an) tentang Musa. Sesungguhnya dia adalah orang yang terpilih} orang yang terpilih {seorang rasul dan nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Maksudnya, sebutlah kisah Nabi Musa bin Imran dalam al-Quran yang mulia ini dengan nada mengagungkan dan memuliakannya, serta memperkenalkan kedudukannya yang mulia dan serta akhlaknya yang sempurna. “SEsungguhnya dia adalah seorang yang dipilih.” Cara membaca dengan memfathahkan huruf lam (menjadi mukhlash) mempunyai pengertian bahwa Allah telah memilihnya di antara semua manusia di seluruh alam. Lafazh itu dibaca juga dengan mengkasrahkan huuruf lainnya (menjadi mukslish) yang bermakna orang yang ikhlas kepada Allah dalam semua perbuatan, perkataan dan niatnya. Jadi, predikatnya adalah sifat ikhlas di seluruh kondisinya. Dua makna ini saling berkolerasi erat. Sesungguhnya Allah menjadikannya memiliki sifat ikhlas karena keikhlasannya, dan keikhlasannya itulah yang memyebabkan pemilihan dirinya. Sifat paling luhur yang menjadi sifat seorang hamba yaitu keikhlasan hamba dan terpilih oleh Rabbnya. “Dan dia itu seorang rasul dan nabi,” maksudnya Allah menyatukan baginya dua hal yaitu risalah (kerasulan) dan nubuwwah (kenabian). Risalah (pengutusan sebagai rasul) menuntutnya menyampaikan perkataan Dzat yang mengutusnya dan menyampaikan semua syariat yang dibawa, baik yang kecil ataupun yang besar. Sedangkan sifat nubuwwah mengharuskan pengertian bahwa Allah memberikan wahyu kepadanya dan mengistimewakannya dengan menurunkan wahyu kepadanya. Jadi nubuwwah itu kaitannya antara dia dan Rabb, sedangkan risalah antara dia dan makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 51: Dengan menunjukkan kemuliaannya, mengenalkan kedudukannya dan akhlaknya yang mulia. Mukhlas di ayat tersebut boleh dibaca mukhlis, yang artinya orang yang ikhlas dalam beribadah. Sedangkan mukhlas, berarti orang yang dipilih Allah di antara sekian makhluk-Nya. Untuk menambah pengetahuan, perlu kiranya kami terangkan perbedaan antara nabi dan rasul. Rasul adalah seorang yang mendapatkan wahyu dan dikirim kepada orang-orang yang menyimpang atau orang-orang kafir, mengajak manusia kepada syari’at baru yang dibawanya, terkadang ia memiliki kitab dan terkadang tidak. Seorang rasul sudah tentu nabi, sedangkan seorang nabi belum tentu rasul. Nabi adalah seorang yang mendapatkan wahyu dan dikirim kepada orang-orang yang sudah beriman, di mana ia mengajak kepada syari’at sebelumnya, menghidupkannya dan menggunakan hukum dengan syari’at sebelumnya. terkadang ia menerima kitab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 51",
    "description": "Selesai bertutur tentang kisah nabi ibrahim, Allah beralih menjelaskan kisah nabi musa. Wahai nabi Muhammad, dan ceritakanlah kisah nabi musa sesuai wahyu di dalam kitab Al-Qur'an. Jelaskan bahwa dia benar-benar orang yang terpilih karena keteguhan sikap dan ketulusan hatinya. Dia juga terpilih sebagai seorang rasul yang diutus kepada bani israil dan nabi yang mulia dan tinggi kedudukannya. 52. Dan kami telah memilih nabi musa dan memanggilnya dari sebelah kanan gunung sinai ketika dia sedang bepergian menuju mesir, dan saat itu kami tetapkan dia sebagai nabi dan rasul untuk memberi peringatan kepada fir'aun dan kaumnya. Kami dekatkan dia kepada kami untuk menerima amanat kerasulan dan kami ajak dia bercakap-cakap secara langsung dari balik hijab berupa api yang menyala."
  }
]