[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah memanggil musa dari sisi kanan gunung thur (sinai), Kami telah mendekatkannya, kemudian kami memuliakannya dengan munajat Kami kepadanya. Di dalam ayat ini terdapat penetapan sifat kalam (berbicara) bagi Allah sesuai dengan keagungan dan kesempurnaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan Kami telah memanggilnya dari arah gunung tersebut yaitu dari arah sebelah kanan Musa -'alaihissalām-, dan Kami dekatkan dia untuk bercakap-cakap yang mana Allah kemudian memperdengarkan firman-Nya padanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52-53. Dan Kami memanggil Musa dari agar gunung Thur dari sisi kanan ketika Musa menuju Mesir, dan Kami dekatkan dia dengan memuliakannya dan berfirman kepadanya tanpa perantara, dan dengan kenikmatan Kami, Kami berikan kepadanya saudara yang bernama Harun, dan Kami jadikan dia sebagai seorang nabi yang dapat membantunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَنٰدَيْنٰهُ مِن جَانِبِ الطُّورِ الْأَيْمَنِ (Dan Kami telah memanggilnya dari sebelah kanan gunung Thur) Yakni dari sisi gunung yang disebut dengan Thursina yang terletak di sebelah lembah. وَقَرَّبْنٰهُ نَجِيًّا (dan Kami telah mendekatkannya kepada Kami di waktu dia munajat) Yakni Kami dekatkan kedudukannya sehingga Kami dapat bercakap dengannya dan dia dapat mendengar munajat Tuhannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Kami telah memanggilnya dari sebelah kanan Nabi Musa sebalah gunung Thur dimana dia menghadap ke Mesir. Kami telah mendekatkan dan memuliakannya kepada Kami di waktu dia berdoa kepada Kami dan berbicara langsung kepada Kami tanpa perantara, dan menunjukkan bahwa Allah mendengarkan perkataannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah memanggilnya dari sebelah kanan gunung Thur} gunung {dan Kami mendekatkan dia untuk bermunajat} bermunajat, Allah memperdengarkan dia dengan kalamNya tanpa melalui perantara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Bahkan Allah mengistimewakannya dengan (cara penyampaian) wahyu yang teragung dan terbaik. Yaitu mengajaknya berbicara (langsung) dan mendekatkannya saat dia bermunajat kepada Allah. Dengan anugerah ini, dia menerima sebuah keistimewaan di kalangan para nabi sebagai kalimurrahman (yang di ajak berbicara secara langsung oleh ar-Rahman). Oleh karena ittu, Allah berfirman, “Dan Kami telah memanggilnya dari sebelah kanan gunung Thur,” yaitu sebelah kanan nabi Musa saat dia berjalan. Atau maksud al-Aiman adalah yang paling berkah, berasal dari kata al-Yumnu dan al-Barakatu (yang memiliki keberkahan). Makna ini diisyaratkan oleh kandungan Firman Allah, \"Bahwa telah diberkati orang-orang yang berada di dekat api itu, dan orang-orang yang berada di sekitarnya. \" (An-Naml:8). “Dan Kami telah mendekatkannya kepada Kami di waktu dia bermunajat (kepada Kami).” Beda antara kata ‘annidaa’ (panggilan) dan ‘annjaa’ (memohon) yaitu, pengertian nida’ itu (panggilan) dengan suara keras, sedangkan naja’ (seruan) dengan suara yang lebih rendah. Dalam ayat ini terdapat sifat (berbicara) bagi Allah dan juga penetappan jenis-jenisnya berupa nida’ dan munajat, berdasarkan pandangan Ahlu Sunnah wal Jamaah. Berbeda dengan golongan Jahmiyah, MU’tazilah dan kelompok yang mengikuti pandangan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 52: Ketika beliau sedang mengadakan perjalanan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 52",
    "description": "Dan kami telah memilih nabi musa dan memanggilnya dari sebelah kanan gunung sinai ketika dia sedang bepergian menuju mesir, dan saat itu kami tetapkan dia sebagai nabi dan rasul untuk memberi peringatan kepada fir'aun dan kaumnya. Kami dekatkan dia kepada kami untuk menerima amanat kerasulan dan kami ajak dia bercakap-cakap secara langsung dari balik hijab berupa api yang menyala. 53. Dan kami telah menganugerahkan kepada nabi musa sebagian rahmat kami kepadanya sesuai permintaan yang dipanjatkan kepada kami, yaitu ketika dia memohon agar saudaranya, harun, diizinkan untuk membantunya dalam melaksanakan tugas kerasulan. Kami tetapkan saudaranya itu menjadi seorang nabi. '."
  }
]