[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah menganugerahkan sebagian rahmat kami kepada Musa, yaitu saudaranya, harun, menjadi seorang nabi yang mendukung dan membelanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan Kami telah menganugerahkan sebagian rahmat dan karunia Kami padanya dengan menjadikan saudaranya, Harun -'alaihissalām- sebagai Nabi; karena mengabulkan doanya ketika memohon hal tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَوَهَبْنَا لَهُۥ مِن رَّحْمَتِنَآ (Dan Kami telah menganugerahkan kepadanya sebagian rahmat Kami) Yakni bagian dari nikmat yang diberikan kepadanya adalah saudaranya. هٰرُونَ نَبِيًّا (Harun menjadi seorang nabi) Hal ini setelah Nabi Musa meminta Tuhannya dengan berkata: واجعل لي وزيرا من أهلي. هارون أخي “dan jadikanlah untukku seorang pembantu dari keluargaku. (yaitu) Harun, saudaraku.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Kami telah menganugerahkan sebagian rahmat Kami kepadanya, yaitu saudaranya Harun menjadi seorang nabi. Ketika dia berdoa: “Ya Allah jadikanlah untukku seorang pembantu dari keluargaku yaitu saudaraku Harun.” (Thaha:29-30)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami telah menganugerahkan kepadanya sebagian rahmat Kami, yaitu saudaranya, Harun, sebagai nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “Dan Kami telah menganugerahkan kepadanya sebagian rahmat Kami, yaitu saudaranya Harun menjadi seorang nabi.” Anugerah ini termasuk sifat keutamaan Nabi Musa, kebaikan dan ketulusannya yang paling besar kepada saudaranya. Dia memohon agar Allah menjadikan saudaranya sebagai teman dalam urusannya dan menjadikannya juga sebagai rasul. Maka Allah pun mengabulkan permohonannya itu. Allah memberikan rahmat bagi Musa kepada saudaranya yaitu Harun sebagai seorang nabi. Maka (dengan demikian) kenabian Harun mengikuti kenabian Musa Maka dia membantu tugas Musa dan menolongnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 53: Allah mengabulkan permintaan Nabi Musa ‘alaihis salam, ketika beliau meminta agar saudaranya, yaitu Harun diutus pula bersamanya, dan Harun lebih tua usianya daripada Musa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 53",
    "description": "Dan kami telah menganugerahkan kepada nabi musa sebagian rahmat kami kepadanya sesuai permintaan yang dipanjatkan kepada kami, yaitu ketika dia memohon agar saudaranya, harun, diizinkan untuk membantunya dalam melaksanakan tugas kerasulan. Kami tetapkan saudaranya itu menjadi seorang nabi. '54. Usai berkisah tentang nabi musa, Allah beralih menceritakan kisah nabi ismail. Wahai nabi Muhammad, dan ceritakanlah kepada umatmu kisah nabi ismail putra nabi ibrahim seperti yang diwahyukan kepadamu di dalam kitab Al-Qur'an. Terangkanlah bahwa dia betul-betul seorang yang benar perkataannya dan selalu menepati janjinya. Dia telah kami tetapkan pula sebagai seorang rasul bagi kaumnya, yaitu suku jurhum, salah satu kabilah arab yang berasal dari yaman, dan dia juga diangkat sebagai nabi yang dianugerahi kedudukan dan derajat tinggi."
  }
]