[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ceritakanlah (wahai rasul) di dalam al-qur’an ini kisah ismail , sesungguhnya dia seorang yang jujur dalam menepati janjinyya, tidaklah dia mengemukakan suatu janji, kecuali dia pasti menepatinya. Dan dia adalah seorang rasul lagi nabi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Dan ceritakanlah -wahai Rasul- kisah Ismail -'alaihissalām- dalam Al-Qur`ān yang diturunkan kepadamu. Sungguh dia benar-benar orang yang benar janjinya, tidaklah ia membuat satu janji kecuali menepatinya, dan sungguh ia seorang Nabi dan Rasul."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-55. Hai Nabi, ceritakanlah dalam al-Qur’an kisah Ismail, dia adalah orang yang selalu menepati janji, tidaklah dia berjanji melainkan pasti akan menepatinya. Allah telah memuliakannya dengan kerasulan dan kenabian. Dan sebagian sifatnya yang terpuji adalah dia selalu mengajak keluarganya untuk menegakkan shalat dan menunaikan zakat. Dia telah meraih keridhaan Allah dan mencapai derajat yang tinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. إِنَّهُۥ كَانَ صَادِقَ الْوَعْدِ (Sesungguhnya ia adalah seorang yang benar janjinya) Allah menyifati Ismail dengan orang yang menepati janji padahal seluruh nabi memiliki sifat tersebut karena dia terkenal dalam hal ini serta sifatnya dalam hal ini sangat besar; contoh dari sifat menepati janjinya ini bahwa dia pernah berjanji kepada Ayahnya akan bersabar jika dia disembelih Ayahnya, dan dia benar-benar menepati janjinya; hal ini disebutkan dalam surat as-Saffat: 102."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah berfirman tentang Nabi-Nya Isma'il : { وَكَانَ يَأْمُرُ أَهْلَهُۥ بِٱلصَّلَوٰةِ وَٱلزَّكَوٰةِ } \"Dan ia menyuruh ahlinya untuk bersembahyang dan menunaikan zakat\" dari ayat ini kita memahami bahwa majlis qurani adalah yang mampu membawa pundi-pundi keimanan dari majlisnya ke dalam keluarganya, dengan membuat majlis qur'an di dalam keluarganya. 2 ). \"Dan ia menyuruh ahlinya untuk bersembahyang dan menunaikan zakat\" maka janganlah seseorang membebankan perkara ini kepada orang lain, karena Allah telah memuji para nabi dengan tanggung jawab itu di pundak mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Ceritakanlah kepada mereka wahai Nabi tentang kisah Ismail yang tersebut di dalam Al Quran. Sesungguhnya ia adalah seorang yang terkenal menepati janjinya, dan dia adalah seorang rasul dan nabi dari Tuhannya kepada kabilah Jurhum. Dia diutus menyampaikan syariat Nabi Ibrahim, nabi yang telah menyampaikan syariat Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ceritakanlah dalam kitab (Al-Qur’an) tentang Ismail. Sesungguhnya dia adalah orang yang benar janjinya, seorang rasul, dan nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Maksudnya, ceritakanlah kisah nabi yang agung ini dalam al-Quran yang mulia, yang melahirkan bangsa Arab, bangsa terbaik dan termulia, yang mana penghulu Bani Adam muncul dari mereka (nabi Muhammad). “Sesungguhnya dia adalah seorang yang benar janjinya,” maksudnya dia tidak pernah berjanji melainkan pasti menepatinya. Ini meliputi janjinya yang dibuat bersama Allah atau janji kepada makhluk. Oleh karena itu, ketika berjanji kepada dirinya sendiri akan bersabar atas (rencana) penyembelihan dirinya oleh sang ayah, dia mengatakan \"insya Allah kamu akan mendapatiku termasuk orang-orang yang sabar\". (Ash-Shaffat:102). Dia memenuhi janjinya, dan memberikan kemudahan kepada bapaknya untuk melakukan penyembelihan. Sebuah musibah terberat yang menimpa seseorang. Kemudian Allah memberikan sifat nubuwwah (kenabian) dan risalah (kerasulan), yang merupakan nikmat terbesar yang Allah berikan kepada hambaNya dan menjadikannya sebagai insan yang berada di tingkatan tertinggi dari para makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 54: Di mana dari Beliau lahir bangsa Arab. Yakni selalu menepati janji, baik janji dengan Allah maupun janji dengan manusia. Oleh karena itu, ketika beliau berjanji siap untuk disembelih, beliau berkata kepada ayahnya, “Engkau akan mendapatiku insya Allah termasuk orang yang sabar.” Beliau memenuhi janjinya dan mempersilahkan bapaknya menyembelihnya, yang kemudian Allah tebus dengan kambing sebagai ganti Isma’il, di mana di dalam kisah beliau banyak pelajaran yang dapat diambil, salah satunya adalah bahwa Allah Subhaanahu wa Ta'aala tidaklah memberikan ujian dengan ujian yang sampai membinasakan dirinya, kalau pun seakan-akan seperti membinasakan dirinya, maka hal itu agar diketahui dengan jelas sejauh mana kesabarannya. Yang diutus kepada suku Jurhum. Ayat ini menunjukkan keutamaan Nabi Isma’il di atas saudaranya, yaitu Ishak, karena Ishaq hanya disifati dengan kenabian saja, sedangkan Isma’il disifati dengan kenabian dan kerasulan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 54",
    "description": "Usai berkisah tentang nabi musa, Allah beralih menceritakan kisah nabi ismail. Wahai nabi Muhammad, dan ceritakanlah kepada umatmu kisah nabi ismail putra nabi ibrahim seperti yang diwahyukan kepadamu di dalam kitab Al-Qur'an. Terangkanlah bahwa dia betul-betul seorang yang benar perkataannya dan selalu menepati janjinya. Dia telah kami tetapkan pula sebagai seorang rasul bagi kaumnya, yaitu suku jurhum, salah satu kabilah arab yang berasal dari yaman, dan dia juga diangkat sebagai nabi yang dianugerahi kedudukan dan derajat tinggi. 55. Dengan kerasulan itu nabi ismail mengajak kaumnya mematuhi Allah dan dia selalu menyuruh keluarganya untuk melaksanakan salat sebagai ibadah dan ungkapan syukur kepada-Nya dan menunaikan zakat kepada mereka yang berhak mendapatkannya. Dengan ketulusan dan keteguhannya memegang janji, dia menjadi salah seorang yang diridai di sisi tuhannya."
  }
]