[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dia menyuruh keluarganya untuk mendirikan shalat dan menunaikan zakat. Dan dia di sisi tuhannya adalah seorang yang diraidhai."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan dia memerintahkan keluarganya untuk mendirikan salat, dan menunaikan zakat. Dan dia adalah orang yang diridai di sisi Tuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَكَانَ يَأْمُرُ أَهْلَهُۥ بِالصَّلَوٰةِ وَالزَّكَوٰةِ (Dan ia menyuruh ahlinya untuk mendirikan shalat dan menunaikan zakat) Terdapat pendapat mengatakan bahwa yang dimaksud dengan ahlinya di sini adalah umatnya. Pendapat lain mengatakan yang dimaksud adalah kerabat, istri, dan anak-anaknya. Sedangkan yang dimaksud dengan shalat dan zakat di sini adalah ibadah yang disyariatkan kepadanya. وَكَانَ عِندَ رَبِّهِۦ مَرْضِيًّا (dan ia adalah seorang yang diridhai di sisi Tuhannya) Yakni diridhai, suci, dan shalih."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "54-55 1. Allah berfirman tentang Nabi-Nya Isma'il : { وَكَانَ يَأْمُرُ أَهْلَهُۥ بِٱلصَّلَوٰةِ وَٱلزَّكَوٰةِ } \"Dan ia menyuruh ahlinya untuk bersembahyang dan menunaikan zakat\" dari ayat ini kita memahami bahwa majlis qurani adalah yang mampu membawa pundi-pundi keimanan dari majlisnya ke dalam keluarganya, dengan membuat majlis qur'an di dalam keluarganya. 2. \"Dan ia menyuruh ahlinya untuk bersembahyang dan menunaikan zakat\" maka janganlah seseorang membebankan perkara ini kepada orang lain, karena Allah telah memuji para nabi dengan tanggung jawab itu di pundak mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Ia memerintahkan keluarganya untuk mendirikan shalat dan menunaikan zakat kepada yang berhak, dan ia adalah seorang yang diridhai di sisi Tuhannya. Sebab keistiqamahan perkataan dan perbuatannya. Adapun orang yang diridhoi Allah adalah orang yang beruntung dalam setiap ketaatan dengan derajat yang tinggi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia selalu menyuruh keluarganya untuk shalat dan zakat. Dia di sisi Tuhannya adalah orang yang diridhai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Dan dia menyuruh keluarganya untuk melaksanakan shalat dan menunaikan zakat,” maksudnya Ismail melaksanakan perintah Allah pada keluarganya. Dia menyuruh keluarganya melaksanakan shalat yang memuat unsur keikhlasan kepada Dzat yang diibadahi, dan menyuruh keluarganya mengeluarkan zakat yang mengandung perbuatan baik kepada sesama manusia. Jadi, dia telah menyempurnakan dirinya dan menyempurnakan orang lain. Terutama orang terdekatnya yaitu keluarga. Karena merekalah orang yang paling berhak untuk menerima dakwahnya dibandingkan dengan yang lain. “Dan dia adalah orang yang diridhai di sisi Rabbnya.” Ini disebabkan oleh ketaatannya dan kesungguhannya dalam perkara-perkara yang diridhai Allah. Maka, Allah meridhainya dan memasukannya ke dalam deretan hambaNya yang paling unggul dan waliNYa yang dekat dengan Allah. Allah meridhainya, dan dia pun ridha kepada Rabbnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 55: Sebagian ahli tafsir berpendapat bahwa yang dimaksud dengan “ahl” di ayat tersebut adalah umatnya, wallahu a’lam. Beliau menyuruh keluarga atau umatnya untuk senantiasa mendirikan shalat yang di sana terdapat ikhlas kepada Allah, dan memerintahkan berzakat, yang di sana terdapat sikap ihsan kepada makhluk. Beliau menyempurnakan diri dan orang lain, terutama sekali keluarganya yang lebih berhak disempurnakan sebelum yang lain. Yang demikian disebabkan karena ia melakukan perbuatan-perbuatan yang diridhai Allah dan berusaha mencari keridhaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 55",
    "description": "Dengan kerasulan itu nabi ismail mengajak kaumnya mematuhi Allah dan dia selalu menyuruh keluarganya untuk melaksanakan salat sebagai ibadah dan ungkapan syukur kepada-Nya dan menunaikan zakat kepada mereka yang berhak mendapatkannya. Dengan ketulusan dan keteguhannya memegang janji, dia menjadi salah seorang yang diridai di sisi tuhannya. 56. Kisah nabi ismail disusul dengan kisah nabi idris. Wahai nabi Muhammad, dan ceritakanlah kepada umatmu kisah idris seperti yang diwahyukan kepadamu di dalam kitab Al-Qur'an. Jelaskanlah bahwa sesungguhnya dia seorang yang sangat mencintai dan melaksanakan kebenaran dalam kehidupannya. Kami memberinya anugerah dan menetapkannya sebagai seorang nabi yang memiliki kedudukan tinggi, ."
  }
]