[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ceritakanlah (wahai rasul) di dalam al-qur’an ini kisah idris . Dia seorang yang amat besar kejujurannya dalam tutur kata dan tindakannya, lagi seorang nabi yang mendapatkan wahyu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan ceritakanlah -wahai Rasul- kisah Idris -'alaihissalām- dalam Al-Qur`ān yang diturunkan kepadamu. Sesungguhnya dia seorang yang sangat jujur dan membenarkan ayat-ayat Allah, serta seorang nabi di antara nabi-nabi yang diutus oleh Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Dan ceritakanlah dalam al-Qur’an tentang Idris, dia adalah orang yang sangat jujur dalam perkataan dan perbuatannya, dan dia adalah seorang nabi yang memiliki derajat yang tinggi. Allah telah meninggikan derajatnya dengan kemuliaan kenabian. Dia berada di langit keempat ketika Rasulullah melihatnya saat mi’raj ke langit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَاذْكُرْ فِى الْكِتٰبِ إِدْرِيسَ (Dan ceritakanlah (hai Muhammad kepada mereka, kisah) Idris (yang tersebut) di dalam Al Quran) Idris merupakan nenek Nabi Nuh, dia adalah orang yang pertama menulis dengan pena."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Ceritakanlah kepada mereka wahai Nabi, tentang kisah Idris yang tersebut di dalam Al Quran. Dia adalah putera nabi Syith dan cucu Nabi Nuh. Dia adalah orang pertama yang menulis dengan pena. Sesungguhnya ia adalah seorang yang sangat jujur dan membenarkan yang haq dan juga seorang nabi dari nabi-nabi yang mulia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ceritakanlah dalam kitab (Al-Qur’an) tentang Idris. Sesungguhnya dia adalah orang yang sangat benar dan membenarkan} orang yang sangat benar dan membenarkan ayat-ayat Allah {lagi seorang nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Maksudnya, ceritakanlah dalam kitab ini dengan menunjukkan kesan pemuliaan dan pengagungan, dan menyematkan sifat kesempurnaan Idris, “SEsungguhnya dia adalah seorang yang sangat membenarkan dan seorang nabi.” Allah memadukan dua sifat bagi Nabi Idris (yaitu) sifat shidqiyyah yang mencakup pembenaran yang sempurna, ilmu yang paripurna, keyakinan yang kokoh, serta amal shalih, dengan keterpilihannya untuk memperoleh wahyu dan mengemban risalahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 56: Sambil memuliakannya dan menyifatinya dengan sifat yang sempurna. Orang yang shiddiq berarti dalam dirinya terdapat sikap membenarkan secara sempurna, ilmu, keyakinan, dan amal yang saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 56",
    "description": "Kisah nabi ismail disusul dengan kisah nabi idris. Wahai nabi Muhammad, dan ceritakanlah kepada umatmu kisah idris seperti yang diwahyukan kepadamu di dalam kitab Al-Qur'an. Jelaskanlah bahwa sesungguhnya dia seorang yang sangat mencintai dan melaksanakan kebenaran dalam kehidupannya. Kami memberinya anugerah dan menetapkannya sebagai seorang nabi yang memiliki kedudukan tinggi, 57. Karena sifat-sifat dan akhlaknya yang terpuji, kami muliakan dia dan kami telah mengangkatnya ke martabat yang tinggi sehingga kelak kami tempatkan dia di surga."
  }
]