[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah mengangkat namanya di tengah seluruh makhluk dan kedudukannya di antara orang-orang yang dekat (dengan Allah). Maka dia adalah seorang yang namanya ditinggikan penyebutannya dan kedudukannya tinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan Kami telah mengagungkan sebutan namanya dengan memberikannya karunia berupa kenabian, sehingga ia memiliki martabat yang tinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَرَفَعْنٰهُ مَكَانًا عَلِيًّا (Kami telah mengangkatnya ke martabat yang tinggi) Terdapat pendapat mengatakan bahwa Allah mengangkatnya ke langit yang ke empat, sebagaimana hadits yang diriwayatkan Imam Muslim dalam kitab shahihnya, dari hadits Anas bin Malik, dari Rasulullah. Pendapat lain mengatakan yang dimaksud dengan pengangkatannya adalah kemuliaan kenabian yang diberikan kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Kami telah mengangkatnya ke martabat yang tinggi di dunia dan akhirat dengan pangkat kemudian dan kemuliaan dari sisi Allah. Allah telah mengangkatnya sampai langit ke-4. Sebagaimana disebutkan dalam hadis sahih dari Anas bin Malik dari Nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah mengangkatnya ke tempat yang tinggi} Kami mengangkat Idris ke tempat yang memiliki kemuliaan dan ketinggian sampai langit keempat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “Dan Kami telah mengangkatnya ke martabat yang tinggi.” Allah meninggikan popularitasnya di seluruh alam. Allah mengangkat derajatnya di antara para hamba yang didekatkan kepada Allah (al-Muqarrabun). Jadi, beliau insan yang tinggi popularitas dan kedudukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 57: Menurut Mujahid, Allah mengangkat Idris dalam keadaan belum meninggal sebagaimana Isa diangkat. Menurut Al Hasan dan lainnya, Allah mengangkat Idris ke surga. Disebutkan dalam hadits shahih, bahwa Rasulullah shallallahu 'alaihi wa sallam ketika isra’-mi’raj bertemu dengan Idris di langit keempat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 57",
    "description": "Karena sifat-sifat dan akhlaknya yang terpuji, kami muliakan dia dan kami telah mengangkatnya ke martabat yang tinggi sehingga kelak kami tempatkan dia di surga. 58. Kisah beberapa rasul pada ayat-ayat sebelumnya disusul dengan uraian tentang sifat-sifat mereka. Mereka yang dianugerahi kedudukan yang tinggi itulah orang-orang yang telah diberi nikmat duniawi dan ukhrawi oleh Allah, yaitu para nabi dari keturunan nabi adam, dan dari keturunan orang-orang yang kami bawa dan selamatkan dalam kapal bersama nabi nuh ketika terjadi banjir besar, dan dari keturunan nabi ibrahim dan israil, yaitu nabi yakub, dan selain mereka ada juga di antaranya yang mendapat anugerah, yaitu dari orang yang telah kami beri petunjuk sehingga selalu menaati ajaran kami dan telah kami pilih untuk berdakwah dan mengajak umat pada kebaikan. Mereka memiliki sifatsifat terpuji. Apabila dibacakan ayat-ayat Allah yang maha pengasih atau diperlihatkan tanda-tanda kekuasaan-Nya kepada mereka, maka mereka segera tunduk, ber-sujud, dan menangis dengan tulus dan khusyuk kepada-Nya."
  }
]