[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang telah Kami beritahukan kisah mereka kepadamu, wahai rasul, mereka itulah orang-orang yang telah dianugerahi Allah karunia dan taufik. Dia menjadikan mereka sebagai para nabi dari keturunan Adam dan dari keturunan orang-orang yang telah kami angkut bersama Nuh di dalam kapal, dan dari keturunan ibrahim, dari keturunan ya’qub, dan dari orang-orang yang telah Kami beri hidayah bagi mereka untuk beriman dan Kami pilih untuk mengemban risalah dan kenabian; mereka itu bila dibacakan kepada mereka ayat-ayat tuhan yang maha pengasih yang memuat ajakan mentauhidkanNya dan hujjah-hujjahnya, mereka menyungkur bersujud kepada Allah dengan penuh ketundukan dan kerendahan. dan mereka menangis karena takut kepada Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Mereka semua yang disebutkan dalam surah ini, mulai dari Zakariya hingga Idris -'alaihimassalām- merupakan orang-orang yang telah diberikan nikmat oleh Allah dengan derajat kenabian dari kalangan anak keturunan Adam -'alaihimassalām-, dari anak keturunan orang-orang yang Kami bawa dalam kapal bersama Nuh -'alaihissalām-, dan dari anak keturunan Ibrahim, dan Ya'qūb -'alaihimassalām-. Dan mereka merupakan orang-orang yang telah Kami berikan petunjuk kepada Islam. Kami telah memilih dan mengangkat mereka menjadi nabi. Jika mereka mendengarkan ayat-ayat Allah sedang dibaca, mereka pun tunduk dan bersujud kepada Allah sembari menangis karena takut kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Mereka adalah orang-orang yang mendapat derajat yang tinggi dan nasab yang mulia, yang Allah beri mereka kenikmatan kepada mereka berupa kemuliaan kenabian dari kalangan keturunan Adam, dan keturunan Nuh dan orang-orang beriman yang menaiki perahu bersamanya, serta dari keturunan Ibrahim seperti Ismail, Ishaq, dan Ya’qub; dan dari keturunan Ya’qub seperti Musa, Harun, Zakariya, Yahya, dan Isa; serta dari orang-orang yang telah Kami beri petunjuk keimanan dan Kami pilih mereka untuk mendapat kerasulan dan kenabian. Jika mereka mendengar kalamullah, mereka tersungkur sujud dan menangis karena takut dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. أُو۟لٰٓئِكَ الَّذِينَ أَنْعَمَ اللهُ عَلَيْهِم مِّنَ النَّبِيِّۦنَ (Mereka itu adalah orang-orang yang telah diberi nikmat oleh Allah, yaitu para nabi) Yakni para nabi yang telah disebutkan dari awal surat sampai ayat ini. وَمِمَّنْ حَمَلْنَا مَعَ نُوحٍ (dan dari orang-orang yang Kami angkat bersama Nuh) Yakni dari keturunan orang-orang yang Kami angkut bersama Nabi Nuh di perahu, dan mereka adalah para keturunan Nabi Nuh sebab kenabian diberikan kepada keturunannya. وَمِن ذُرِّيَّةِ إِبْرٰهِيمَ وَإِسْرٰٓءِيلَ(dan dari keturunan Ibrahim dan Israil) Yakni dan dari keturunan Ismail, yaitu Ya’qub serta Musa, Harun, Zakariya, Yahya, dan Isa. وَمِمَّنْ هَدَيْنَا ( dan dari orang-orang yang telah Kami beri petunjuk) Yakni orang-orang yang telah Kami beri hidayah kepada Islam. وَاجْتَبَيْنَآ ۚ (dan telah Kami pilih) Yakni hamba-hamba yang Kami pilih sehingga Kami jadikan mereka para Nabi. إِذَا تُتْلَىٰ عَلَيْهِمْ ءَايٰتُ الرَّحْمٰنِ خَرُّوا۟ سُجَّدًا وَبُكِيًّا(Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyungkur dengan bersujud dan menangis) Mereka apabila mendengar ayat-ayat Allah menangis dan bersujud."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ketika Umar membaca ayat ini beliau pun bersujud, kemudian berkata : ini sujudnya, lalu dimana tangisnya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Mereka para nabi itu yang dijelaskan dalam surat ini seperti Zakaria hingga Idris adalah para nabi yang telah diberi nikmat oleh Allah, yaitu para nabi dari keturunan Adam, dan dari orang-orang yang Kami angkat bersama Nuh, dan dari keturunan Ibrahim dan Israil, dan dari orang-orang yang telah Kami beri petunjuk dan telah Kami pilih. Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyungkur menangis tanpa suara dengan bersujud dan menangis karena takut kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah orang-orang yang telah diberi nikmat oleh Allah, yakni para nabi dari keturunan Adam, orang yang Kami bawa bersama Nuh, dari keturunan Ibrahim dan Israil} keturunan Ya‘qub AS {serta orang yang telah Kami beri petunjuk dan Kami pilih} Kami pilih {Apabila dibacakan kepada mereka ayat-ayat Allah Yang Maha Pengasih, mereka tunduk} menjatuhkan wajah mereka {bersujud dan menangis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. SEtelah menyebutkan kisah para nabi yang dimulliakan dan para rasul yang diistimewakan, Allah menyebutkan berbagai keutamaan dan derajat mereka. Allah berfirman, “Mereka itu adalah orang-orang yang telah diberi nikmat oleh Allah, yaitu para nabi,” maksudnya Allah memberikan karunia kepada mereka yang tidak akan dapat dipadani dan anugerah yang ta dapat dilampaui yaitu nikmat kenabian dan kerasulan. Mereka itulah orang-orang yang kita diperintahkan untuk berdoa kepada Allah supaya diberikan petunjuk ke jalan orang-orang yang telah Dia beri kenikmatan kepada mereka, dan bahwa orang-orang yang menaati Allah, maka dia \"bersama-sama dengan orang-orang yang dianugerahi nikmat oleh Allah, yaitu: Nabi-nabi, para shiddiiqiin, orang-orang yang mati syahid dan orang-orang saleh. Dan mereka itulah teman yang sebaik-baiknya.\" (An-NIsa:69). Dan bahwa sebagian mereka adalah “dari keturunan Adam, dan dari orang-orang yang Kami angkat bersama Nuh,” maksudnya, anak keturunannya “dan dari keturunan Ibrahim dan Israil.” Jadi, inilah keluarga-keluarga terbaik di dunia. Allah telah menyeleksi, memilih, dan memperlakukan mereka dengan istimewa. Kondisi mereka saat membaca ayat-ayat Allah yang diturunkan kepada mereka, yang berisi pemberitahuan tentang perara-perkara ghaib, dan sifat-sifat Dzat Yang Maha Mengetahui perkara-perkara ghaib, berita tentang Hari Akhir, janji dan ancaman “maka mereka menyungkur dengan bersujud dan menangis,” maksudnya , mereka tunduk kepada ayat-ayat Allah dan khusyu mengamatinya. Ayat-ayat ini berpengaruh dalam hati-hati mereka berupa keimanan, raghbah (cinta kepada Allah) dan ketakutan (rahbah) yang menyebabkan mereka menangis, bertaubat serta bersujud kepada Rabb mereka. Mereka bukanlah termasu orang-orang yang jika mendengar ayat-ayat Allah, menyungkur dalam keadaan buta dan tuli. Dalam penyandaran kata ‘al-aayaat’ (ayat-ayat) dengan nama Allah ‘Ar-Rahman’ (Yang Maha Penyayang) terdapat bukti bahwa ayat-ayatNya termasuk rahmat dan curahan kebaikanNya kepada para hambaNya. Karena dengannya, Allah memberikan hidayah kepada mereka menuju al-Haq, membukakan mata batin mereka dari kebutaan, menyelamatkan mereka dari kesesatan dan mengajari mereka (ayat hingga terbebas) dari kubangan kebodohan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 58: Yaitu nikmat kenabian dan kerasulan. Yaitu Idris, kakek Nabi Nuh. Namun ada yang berpendapat, bahwa Idris adalah salah seorang nabi Bani Israil berdasarkan hadits Isra’-Mi’raj, di mana ia mengatakan dalam salamnya kepada Nabi Muhammad shallallahu 'alaihi wa sallam, “Selamat datang nabi yang saleh dan saudara yang saleh.” Ia tidak mengatakan, “dan anak yang saleh” seperti yang diucapkan Adam dan Ibrahim ‘alaihimas salam kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Yaitu Ibrahim, cucu dari anak Nabi Nuh bernama Sam. Yaitu Isma’il, Ishak, dan Ya’kub. Yaitu Yusuf, Musa, Harun, Zakaria, Yahya, dan Isa. Dihubungkannya ayat-ayat dengan nama-Nya Ar Rahman menunjukkan, bahwa ayat-ayat-Nya termasuk rahmat-Nya kepada hamba-hamba-Nya dan ihsan-Nya kepada mereka, di mana dengan ayat-ayat tersebut Dia menunjuki mereka kepada kebenaran, memperlihatkan kepada mereka mata mereka yang sebelumnya buta, menyelamatkan dari kesesatan, dan mengajarkan ilmu kepada mereka yang sebelumnya mereka jahil (tidak tahu). Oleh karena itu, jadilah kamu seperti mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 58",
    "description": "Kisah beberapa rasul pada ayat-ayat sebelumnya disusul dengan uraian tentang sifat-sifat mereka. Mereka yang dianugerahi kedudukan yang tinggi itulah orang-orang yang telah diberi nikmat duniawi dan ukhrawi oleh Allah, yaitu para nabi dari keturunan nabi adam, dan dari keturunan orang-orang yang kami bawa dan selamatkan dalam kapal bersama nabi nuh ketika terjadi banjir besar, dan dari keturunan nabi ibrahim dan israil, yaitu nabi yakub, dan selain mereka ada juga di antaranya yang mendapat anugerah, yaitu dari orang yang telah kami beri petunjuk sehingga selalu menaati ajaran kami dan telah kami pilih untuk berdakwah dan mengajak umat pada kebaikan. Mereka memiliki sifatsifat terpuji. Apabila dibacakan ayat-ayat Allah yang maha pengasih atau diperlihatkan tanda-tanda kekuasaan-Nya kepada mereka, maka mereka segera tunduk, ber-sujud, dan menangis dengan tulus dan khusyuk kepada-Nya. 59. Usai menjelaskan sifat para nabi, rasul, dan orang yang mendapat karunia Allah, pada ayat ini Allah menerangkan balasan bagi orang yang sesat dan ganjaran bagi orang yang bertobat. Kemudian datanglah setelah mereka pengganti mereka, yaitu generasi baru yang berperangai buruk. Mereka termasuk golongan yang mengabaikan salat, baik dengan meninggalkannya atau melaksanakannya secara menyimpang dari ajaran para nabi dan rasul, dan mereka selalu mengikuti keinginan hawa nafsu-Nya sehingga terjerumus ke dalam dosa. Karena perbuatan dan perilaku mereka yang buruk, maka mereka kelak di akhirat akan termasuk kelompok orang yang tersesat dan mendapat balasan neraka."
  }
]