[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu datanglah sepeninggal orang-orang yang telah diberi kenikmatan kepada mereka itu para pengikut yang berperilaku buruk, meningglakan semua kewajiban shalat, atau mengakhirkan waktu pelaksanaannya, atau meninggalkan rukun-rukun dan wajib-wajibnya, dan mengikuti apa saja yang sesuai dan sejalan dengan hawa nafsu mereka. Maka mereka itu akan menemui keburukan, kesesatan dan kerugian di neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Kemudian datanglah setelah para nabi yang terpilih itu para pengikut yang buruk dan sesat. Mereka mengabaikan salat, tidak mengerjakannya sesuai cara yang diperintahkan, dan hanya mengerjakan maksiat yang sesuai kehendak hawa nafsu mereka semisal zina. Maka sungguh mereka akan mendapatkan balasan keburukan dan kerugian di neraka Jahanam kelak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59-62. Kemudian setelah orang-orang bertakwa itu, datanglah kaum yang meninggalkan shalat dan menempuh jalan syahwat; mereka akan mendapatkan keburukan di neraka Jahannam, kecuali orang yang bertaubat kepada Allah dan mengerjakan amal shalih, maka mereka adalah orang-orang yang akan Allah masukkan ke dalam surga, Allah tidak akan mengurangi pahala amal shalih mereka sedikitpun. Surga itu adalah tempat yang kekal yang Allah janjikan bagi orang-orang yang shalih meski mereka belum pernah melihatnya; janji ini pasti akan Allah tepati. Dalam surga itu mereka tidak akan mendengar perkataan batil, namun yang akan mereka dengar adalah ucapan salam dari para malaikat. Mereka di dalamnya akan selalu memperoleh berbagai kenikmatan yang mereka inginkan pada pagi dan petang hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. فَخَلَفَ مِنۢ بَعْدِهِمْ خَلْفٌ (Maka datanglah sesudah mereka, pengganti (yang jelek)) Yakni penerus yang buruk dari umat-umat mereka, mereka mengaku beriman dan menjadi pengikut para Nabi namun perbuatan mereka menyelisihi apa yang mereka katakan. أَضَاعُوا۟ الصَّلَوٰةَ (yang menyia-nyiakan shalat) Oleh sebab itu mereka menyia-nyiakan shalat. Terdapat pendapat mengatakan bahwa mereka tidak mengerjakannya sesuai dengan yang disyariatkan, yakni dengan meninggalkan sebagian syarat-syarat dan rukun-rukunnya. وَاتَّبَعُوا۟ الشَّهَوٰتِ ۖ (dan memperturutkan hawa nafsunya) Yakni mereka mengerjakan perbuatan-perbuatan haram yang diinginkan hawa nafsu mereka seperti zina dan perbuatan buruk lainnya. فَسَوْفَ يَلْقَوْنَ غَيًّا (maka mereka kelak akan menemui kesesatan) Makna (الغي) adalah keburukan. Pendapat lain mengatakan, yakni penyesalan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "وَٱتَّبَعُوا۟ ٱلشَّهَوَٰتِ : Mereka memang menginginkannya sehingga itulah tujuan hidup mereka, mereka tunduk dan taat kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Maka sesudah mereka, hadir pengganti yang buruk yang menyia-nyiakan shalat dan menuruti hawa nafsunya seperti zina dan minum khamr, maka mereka kelak akan menemui kesesatan atau balasan keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian datanglah} datanglah {setelah mereka} setelah para nabi yang disebutkan itu {pengganti} penerus yang buruk {yang mengabaikan shalat} meninggalka shalat fardhu {dan mengikuti hawa nafsu. Mereka kelak akan tersesat} keburukan dan keterpurukan di neraka Jahanam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. SEtelah menyebutkan kisah para nabi yang ikhlas ini, yang konsisten mengikuti hal-hal yang mendatangkan ridha Rabb mereka serta senantiasa bertaubat kepadaNya, Allah menyebutkan kisah orang-orang yang datang setelah zaman mereka,dan melakukan perubahan terhadap sesuatu yang diperintahkan kepada mereka, dan bahwa datanglah “sesudah mereka, pengganti (yang jelek),” mereka kembali kepada kemunduran dan keadaan semula, lalu “mereka menyia-nyiakan shalat,” yang mana mereka diperintahkan untuk menjaga dan menegakkannya. Mereka meremehkan shalat dan tidak menghiraukannya. Jika mereka sudah mengabaikan shalat yang merupakan tiang agama, tolok ukur keimanan dan keikhlasan kepada Allah, yang merupakan amal yang paling ditekankan dan paling afdhal, maka pasti mereka lebih menyia-nyiakan lagi menolak syariat agama mereka yang lain. Penyebab yang mendorong mereka melakukan ini adalah karena mengikuti bujukan-bujukan hawa nafsu dan keinginan-keinginannya. Sehingga perhatian mereka tercurahkan pada hawa nafsu dan lebih mengutamakannya daripada hak-hak Allah. Maka, lahirlah sikap penyia-nyiaan terhadap hak-hak Allah dan condong kepada godaan-godaan hawa nafsunya. Apa pun yang tampak bagi mereka, niscaya mereka segera berusaha untuk meraihnya, dan dengan kondisi apa saja yang tiba-tiba muncul, mereka pasti sepakat untuk menempuhnya. “Maka kelak mereka akan menemui kesesatan,” yaitu azab yang berlipat lagi sangat keras."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 59: Yakni dengan meninggalkannya seperti orang-orang Yahudi dan Nasrani. Jika shalat yang menjadi tiang agama, timbangan keimanan dan keikhlasan kepada Rabbul ‘alamin, yang merupakan amalan yang paling utama setelah tauhid, maka sudah tentu amalan yang lain lebih diabaikan. Demikianlah ketika shalat sudah ditinggalkan, ia tidak punya lagi pegangan, sehingga ketika ada arus deras yang menghampirinya, maka ia terbawa olehnya ke mana saja. Ada yang menafsirkan, bahwa ghay adalah lembah di neraka Jahannam yang berbau busuk. Ada pula yang menafsirkan, bahwa ghay adalah azab yang berlipat ganda lagi keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 59",
    "description": "Usai menjelaskan sifat para nabi, rasul, dan orang yang mendapat karunia Allah, pada ayat ini Allah menerangkan balasan bagi orang yang sesat dan ganjaran bagi orang yang bertobat. Kemudian datanglah setelah mereka pengganti mereka, yaitu generasi baru yang berperangai buruk. Mereka termasuk golongan yang mengabaikan salat, baik dengan meninggalkannya atau melaksanakannya secara menyimpang dari ajaran para nabi dan rasul, dan mereka selalu mengikuti keinginan hawa nafsu-Nya sehingga terjerumus ke dalam dosa. Karena perbuatan dan perilaku mereka yang buruk, maka mereka kelak di akhirat akan termasuk kelompok orang yang tersesat dan mendapat balasan neraka. 60. Orang yang sesat dan berbuat maksiat akan mendapat balasan sesuai perbuatannya, kecuali orang yang bertobat dengan sepenuh hati dan tidak mengulangi keburukannya, sedang mereka beriman dan membuktikan keimanannya dengan mengerjakan kebajikan, maka mereka itu akan masuk surga sebagai balasan atas kebaikannya, dan mereka tidak dizalimi dan dirugikan sedikit pun."
  }
]