[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang akan mewarisi kenabianku dan kenabian keluarga ya’qub, dan jadikanlah anak itu sebagai orang yang diridhai olehMu dari para hambaMu. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Yang akan mewarisi kenabian dariku, dan dari keluarga Ya'qūb -'alaihissalām-, dan jadikanlah ia -wahai Tuhanku- seorang yang diridai agama, akhlak dan ilmunya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Yang mewarisiku dalam perkara ilmu dan agama dan mewarisi keluarga Ya’qub dalam perkara kerajaan dan kenabian; dan jadikanlah dia orang yang mendapat keridhaan dari-Mu dan dari manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يَرِثُنِى وَيَرِثُ مِنْ ءَالِ يَعْقُوبَ ۖ (yang akan mewarisi aku dan mewarisi sebahagian keluarga Ya’qub) Yang dimaksud warisan di sini adalah warisan ilmu dan kenabian menurut pendapat yang lebih kuat, dan bukan warisan harta, dengan dalil sabda Rasulullah: “Kami golongan para Nabi tidak mewarisi.” Yakni mereka hanya mewarisi ilmu dan tugas menjaga urusan agama. وَاجْعَلْهُ رَبِّ رَضِيًّا (dan jadikanlah ia, ya Tuhanku, seorang yang diridhai) Yakni diridhai dalam akhlak dan perbuatannya agar menjadi orang yang layak untuk mengusung ilmu agama serta mengajarkan dan menyampaikannya kepada orang lain serta menegakkan syi’ar’syi’ar agama mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Yang kelak akan menjadi pewarisku dan pewaris keluarga Ya´qub dari segi ilmu dan kenabian. Ya’qub adalah nabi Bani Israil. Istri nabi Zakaria adalah saudari Maryam binti Imran, putera dari Sualiman bin Dawud bin Ishaq bin Ibrahim ‘alaihimus salam. Maksud dari pewaris di sini bukanlah mewarisi harta, sebab para nabi tidak menerima warisan harta. Jadikanlah ia ya Tuhanku, seorang yang diridhai, baik dalam akhlak dan perbuatannya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang akan mewarisi aku} mewarisi kenabianku {dan keluarga Ya‘qub serta jadikanlah dia, wahai Tuhanku, seorang yang dirhidai”} diridhai di sisiMu dan di sisi ciptaanMu dalam agama, akhlak dan pengetahuannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Perwalian yang dimaksud di sini adalah pengganti (dalam menangani urusan) agama dan pewaris kenabian, ilmu dan amal. Oleh karena itu, Zakaria bersabda, “Yang akan mewarisi aku dan mewarisi sebagian keluarga Ya’qub, dan jadikanlah dia, wahai Rabbku, seorang yang diridhai,” maksudnya seorang hamba shalih yang Engkau ridhai dan Engkau menjadikannya dicintai oleh ara hambaMu. Pendek kata, beliau memohon kepada Allah agar dianugerahi seorang anak laki-aki yang shalih, yang hidup setelah Nabi Zakaria meninggal dan menjadi penggantinya, menjadi seorang nabi yang diridhai di sisi Allah dan disenangi oleh para makhlukNYa. Ini adalah jenis anak yang paling sempurna. Dan termasuk cermin kasih sayang Allah kepada hambaNya (Zakaria), Allah memberinya seorang anak yang shalih, yang sarat dengan semua akhlak mulia dan perilaku yang terpuji. Lalu Allah menganugerahkan rahmat kepada Zakaria, lalu Allah mengabulkan doanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 6: Berupa ilmu, amal dan kenabian. Di sisi-Mu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 6",
    "description": "Ya tuhanku, aku berharap anak itu kelak menjadi penerusku yang akan mewarisi aku dalam tugas-tugasku sebagai penyeru umat dan mewarisi dari keluarga yakub yang melanjutkan tradisi dan agama nabi ibrahim. Kabulkanlah doaku dan jadikanlah dia, ya tuhanku, seorang yang selalu diridai dan dirahmati. '7. Allah mengabulkan doa nabi zakaria. Allah berfirman, 'wahai zakaria, kami memperkenankan doamu. Melalui perantaraan jibril, kami memberi kabar gembira kepadamu dengan menganugerahimu seorang anak laki-laki yang namanya yahya. Nama ini merupakan sebutan yang kami belum pernah memberikan nama seperti itu sebelumnya kepada siapa pun. '."
  }
]