[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "akan tetapi, siapa saja yang bertaubat dari mereka dari dosanya, beriman kepada tuhannya dan beramal shalih sebagai bentuk pembuktian atas taubatnya, maka mereka itu akan diterima taubatnya oleh Allah, dan mereka akan masuk kedalam surga bersama kaum mukminin lainnya serta mereka tidak mengalami pengurangan amal shalih mereka sedikitpun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Kecuali orang yang bertobat dari kelalaian dan kesalahannya, serta beriman kepada Allah dan beramal saleh, maka mereka yang memiliki kriteria seperti ini akan masuk Surga, dan pahala amalan kebaikan mereka sama sekali tidak akan dikurangi walaupun hanya sedikit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صٰلِحًا (kecuali orang yang bertaubat, beriman dan beramal saleh) Yakni bertaubat dari kelalaian mereka dalam mendirikan shalat dan dari memperturutkan hawa nafsu, sehingga mereka kembali pada ketaatan kepada Allah dan keimanan kepada-Nya serta beramal amalan kebaikan. وَلَا يُظْلَمُونَ شَيْـًٔا (dan tidak dianiaya (dirugikan) sedikitpun) Yakni Allah tidak mengurangi pahala mereka sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Kecuali orang yang bertaubat, beriman dan beramal saleh, maka mereka itu akan masuk surga dan mereka tidak dianiaya/dirugikan sedikitpun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kecuali orang yang bertaubat, beriman, dan beramal shalih, mereka akan masuk surga dan tidak dizalimi sedikit pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Kemudian Allah mengecualikan dengan FirmanNYa, “Kecuali orang-orang yang bertaubat,” dari kesyirikan, bid’ah-bid’ah dan kemaksiatan. Dia berhenti darinya, menyesal dan bertekad untuk tidak mengulanginya lagi “dan beriman,” kepada Allah, para malaikatNya, kitab-kitabNYa, para rasulNya, dan Hari Akhir “dan beramal shalih,” yaitu amalan-amalan yang disyariatkan oleh Allah lewat lisan para rasulNya jika diperuntukkan mencari Wajah Allah dengan amalan itu. “Maka mereka itu,” orang yang memadukan antara taubat, keimanan, serta amal shalih “akan masuk surga,” yang berisi kenikmatan yang abadi, kehidupan yang selamat (dari gangguan) dan berada di dekat Rabb Yang Mahamulia “dan tidak dianiaya (diragukan) sedikit pun,” dari amalan-amalan mereka. Bahkan mereka menjumpai amalan-amalan mereka sempurna, dengan ganjaran yang penuh dan berlipat-lipat jumlahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 60: Dari meninggalkan shalat atau dari syirk, bid’ah dan maksiat yang dilakukannya. Ia berhenti darinya dan menyesal terhadapnya serta berniat keras untuk tidak mengulanginya. Kepada Allah, malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, hari akhir dan qadar-Nya. Yaitu amal yang disyari’atkan Allah melalui lisan Rasul-Nya disertai ikhlas dalam mengerjakannya. Yang menggabung antara tobat, iman dan amal saleh. Yakni pahala mereka, bahkan pahalanya akan mereka dapatkan secara sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 60",
    "description": "Orang yang sesat dan berbuat maksiat akan mendapat balasan sesuai perbuatannya, kecuali orang yang bertobat dengan sepenuh hati dan tidak mengulangi keburukannya, sedang mereka beriman dan membuktikan keimanannya dengan mengerjakan kebajikan, maka mereka itu akan masuk surga sebagai balasan atas kebaikannya, dan mereka tidak dizalimi dan dirugikan sedikit pun. 61. Kami beri mereka anugerah, yaitu surga 'adn yang telah dijanjikan oleh tuhan yang maha pengasih kepada hamba-hamba-Nya yang taat dan melaksanakan ajaran-Nya. Mereka mengimani eksistensinya, sekalipun surga itu tidak tampak dan tidak mereka lihat di dunia. Sungguh, mereka meyakini bahwa janji Allah itu pasti ditepati. Mereka tahu Allah tidak pernah mengingkari janji."
  }
]