[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu surga-surga abadi dan tempat tinggal kekal, yaitu surga yang dijanjikan Allah yang maha pengasih kepada para hambaNya melalui berita ghaib, lalu mereka mengimaninya, sedang mereka belum pernah menyaksikannya. Sesungguhnya janji Allah kepada hamba-hambaNya berupa surga pasti akan terwujud, tidak ada keraguan sama sekali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Yaitu Surga-surga sebagai tempat tinggal dan menetap yang dijanjikan oleh Tuhan Yang Maha Pengasih pada hamba-hamba-Nya yang saleh agar mereka memasukinya walaupun Surga itu belum tampak bagi mereka. Walaupun mereka belum melihat Surga itu, mereka tetap percaya dengan keberadaannya, dan sungguh janji Allah berupa Surga itu pasti ditepati dan terwujud."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. الَّتِى وَعَدَ الرَّحْمٰنُ عِبَادَهُۥ بِالْغَيْبِ ۚ (yang telah dijanjikan oleh Tuhan Yang Maha Pemurah kepada hamba-hamba-Nya, sekalipun (surga itu) tidak nampak) Hamba-hamba yang beriman kepada surga meski mereka belum melihatnya. إِنَّهُۥ كَانَ وَعْدُهُۥ مَأْتِيًّا(Sesungguhnya janji Allah itu pasti akan ditepati) Yakni pemenuhan janji-janji-Nya akan datang, diantaranya adalah surga yang akan didatangkan kepada para penghuninya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Yaitu surga ´Adn yang telah dijanjikan oleh Tuhan Yang Maha Pemurah kepada hamba-hamba-Nya, sekalipun surga itu tidak nampak. Sesungguhnya janji Allah itu pasti akan ditepati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Surga ‘Adn yang telah dijanjikan oleh Dzat Yang Maha Pengasih kepada hamba-hambaNya sekalipun gaib. Sesungguhnya janjiNya itu pasti ditepati} pasti terjadi bukan mustahil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Kemudian Allah menyebutkan bahwa surga (taman) yang dijanjikan untuk dimasuki tidaklah seperti taman-taman yang lain. Akan tetapi, “Surga ‘And,” yaitu surga tempat hunian tetap, tidak akan pernah ditinggalkan, tidak akan pernah diganti dan tidak akan lenyap. Hal ini disebabkan oleh luasnya surga itu serta besarnya kuantitas kenikmatan padanya, berupa kebaikan-kebaikan, kegembiraan, kebahagiaan, dan kesenangan, serta keceriaan, “yang telah dijanjikan oleh ar-Rahman (Yang Maha Pemurah) kepada hamba-hambaNYa, dengan (cara) ghaib,” yaitu surga yang dijanjikan oleh ar-Rahman. Allah merangkaikan kata surga dengan namaNYa, ar-Rahman, karena di dalam Surga ‘And itu terdapat curahan rahmat dan kebaikan yang tidak pernah terlihat mata, tidak pernah terdengar telinga dan tidak terlintas dalam benak manusia . Allah juga menamakan surga ini sebagai rahmatNYa. Allah berfirman, \"Adapun orang-orang yang putih berseri mukanya, maka mereka berada dalam rahmat Allah (surga); mereka kekal di dalamnya\". (Ali Imran:107). Begitu pula, pada penggandengan kata surga dengan nama ar-Rahman, terdapat isyarat yang menunjukkan kontinuitas kebahagiaan di dalamnya, dan bahwa surga itu abadi dengan keabadian rahmat Allah yang merupakan pengaruh dan konsekuensi rahmatNya. Kata ‘al’ibaad’ dalam ayat ini maksudnya adalah hamba dari ketuhanannya (ilahiyah) Allah, yaittu para hamba yang senantaiasa beribadah kepada Allah dan konsisten melaksanakan syariatNya. Sehingga ‘al-ubuudiyyah’ (penghambaan diri kepada Allah) menjadi predikat mereka, sebagaimana Firman Allah, (Al-Furqan:63) dan ayat-ayat yang semisalnya. Berbeda dengan “para hamba Allah” dalam konteks kepemilikan semata, yang tidak pernah beribadah kepadaNya. Mereka ini meskipun sebagai hamba dari pengaturan (rububiyah) Allah karena Allah telah menciptakan mereka, memberi rizki dan megatur mereka, namun mereka ini tidak termasuk dalam golongan hamba al-uluhiyah al-ubudiyah al-ikhtiyariyah (hamba yang beribadah karena kemauan sendiri) yang pelakunya berhak mendapatkan ppujian. Mereka menghambakan diri karena terpaksa, mereka tidak berhak mendapat pujian sama sekali. Firman Allah, “dengan cara ghaib,” ada kemungkinan kata ini berhubungan dengan “yang dijanjikan oleh DZat Yang Maha Pemurah”. Berdasarkan ini, maka pengertiannya adalah bahwa janji Allah untuk meberikan surga kepada mereka itu merupakan janji ghaib yang belum pernah mereka saksikan dan lihat. Namun, mereka mengimaninya, meyakini ketidaktampakannya, dan mereka pun berusaha menggapainya dengan sekuat tenaga, padahal mereka belum pernah melihatnya. Lalu, bagaimanakah seandainya mereka pernah melihatnya? Sudah pasti, mereka akan lebih antusias lagi untuk mendapatkannya, lebih termotivasi lagi dan akan lebih giat lagi berusaha. Sehingga ini merupakan pujian bagi mereka dengan sebab keimanan mereka terhadap perkara yang ghaib, yang merupakan keimanan yang bermanfaat. Ada kemungkinan juga, “dengan (cara) ghaib,” berkaitan dengan kata ‘ibaadah’ (para hambaNYa), yakni orang-orang yang beribadah kepadaNya secara ghaib (secara tidak langsung [menghadapNya]), dan mereka tidak dapat melihatNYa. Inilah ibadah mereka, padahal tidak pernah melihatNya. Seandainya mereka pernah melihatNya, maka pasti mereka lebih rajin untuk beribadah kepadaNYa, lebih besar taubat mereka kepadaNya, lebih agung kecintaan dan kerinduan mereka kepadaNya. Ada kemungkinan pengertian ayat ini bahwasanya surga-surga yang dijanjikan oleh Allah kepada para hambaNya termasuk sesuatu yang tidak bisa dijangkau oleh imajinasi-imajinasi (manusia) dan tidak ada yang mengetahuinya kecuali Allah. Dalam cara (pengungkapan seperti) ini terdapat upaya membangkitkan kerinduan kepadaNya, dan sifat (gambaran) yang masih global yang berpotensi menyulut jiwa-jiwa dan menggairahkan (jiwa yang) diam agar mencarinya. Sehingga ini sama dengan Firman Allah, \"Seorang pun tidak mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyedapkan pandangan mata sebagai balasan terhadap apa yang telah mereka kerjakan.\" (As-Sajdah:17). Semua makna ini benar, akan tetapi kemmungkinan pengertian pertama lebih utama. Dalilnya adalah FIrman Allah “Sesungguhnya janji Allah itu pasti akan ditepati,” maksudnya pasti terjadi. Sesungguhnya Allah tidak pernah mengingkari janji, dan Allah itu sebenar-benarnya Dzat yang berkata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 61: Yakni surga yang menjadi tempat bermukim, di mana mereka tidak akan pindah daripadanya. Yang demikian karena tempatnya yang luas, dan banyak kebaikan dan kesenangannya. Dihubungkannya surga dengan nama-Nya Ar Rahman (Yang Maha Pengasih) karena di dalamnya terdapat rahmat dan ihsan-Nya yang tidak pernah dilihat oleh mata, didengar oleh telinga, dan terlintas di hati manusia, bahkan Allah menamai surga-Nya itu dengan rahmat-Nya. Dia berfirman, “Adapun orang-orang yang putih berseri mukanya, maka mereka berada dalam rahmat Allah (surga); mereka kekal di dalamnya.” (Terj. Ali Imran: 107) Di samping itu, dihubungkannya surga dengan rahmat-Nya menunjukkan tetap terusnya kesenangan itu dan akan kekal sebagaimana kekal rahmat-Nya, dan surga merupakan atsar (pengaruh) dari rahmat-Nya. Yakni hamba-hamba-Nya yang beribadah hanya kepada-Nya dan mengikuti syariat-Nya, sehingga sifat ubudiyyah (kehambaan) dimiliki mereka. Gaib di sini bisa terkait dengan surga, yakni keadaannya yang masih gaib. Bisa juga terkait dengan hamba-hamba-Nya, di mana mereka beribadah kepada Tuhan mereka ketika mereka tidak terlihat dan ketika mereka tidak melihat kepada-Nya. Bisa juga maknanya, bahwa surga yang dijanjikan Ar Rahman termasuk perkara yang tidak ditangkap oleh sifat-sifat, dan tidak ada yang mengetahuinya selain Allah. Semua makna ini adalah benar, namun yang lebih dekat adalah makna yang pertama, yakni “sekalipun surga itu tidak tampak.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 61",
    "description": "Kami beri mereka anugerah, yaitu surga 'adn yang telah dijanjikan oleh tuhan yang maha pengasih kepada hamba-hamba-Nya yang taat dan melaksanakan ajaran-Nya. Mereka mengimani eksistensinya, sekalipun surga itu tidak tampak dan tidak mereka lihat di dunia. Sungguh, mereka meyakini bahwa janji Allah itu pasti ditepati. Mereka tahu Allah tidak pernah mengingkari janji. 62. Surga yang kami janjikan itu penuh kesenangan. Di dalamnya mereka tidak pernah berbicara atau mendengar perkataan yang tidak berguna, kecuali ucapan salam yang menyejukkan dan mendamaikan. Banyak nikmat Allah di dalamnya, dan di dalamnya bagi mereka ada rezeki pagi dan petang, yang telah Allah tetapkan sebagai pahala atas kebaikan mereka."
  }
]