[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para penghuni surga tidak mendengar perkataan batil di dalamnya. Namun mereka itu mendengar ucapan salam sebagai penghormatan bagi mereka. Dan di dalamnya, mereka memperoleh rizki mereka berupa makanan dan minuman secara terus-menerus, tiap kali mereka menghendakinya pagi dan sore, tidak terbatas dan tidak terhingga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Di dalamnya mereka tidak mendengar perkataan sia-sia, apalagi kata-kata keji, bahkan hanya mendengar ucapan salam antara satu dengan lainnya, juga ucapan salam para Malaikat kepada mereka, dan di dalamnya mereka senantiasa didatangi makanan yang sesuai selera mereka setiap pagi dan sore hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. لَّا يَسْمَعُونَ فِيهَا لَغْوًا (Mereka tidak mendengar perkataan yang tak berguna di dalam surga) Makna (اللغو) adalah perkataan yang tidak membawa faidah. Pendapat lain mengatakan maknanya adalah segala ucapan yang tidak mengandung zikir kepada Allah. إِلَّا سَلٰمًا ۖ (kecuali ucapan salam) Akan tetapi mereka mendengar ucapan salam yang mereka sampaikan satu sama lain, atau salam dari malaikat kepada mereka. وَلَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا (Bagi mereka rezekinya di surga itu tiap-tiap pagi dan petang) Makanan yang mereka inginkan akan mendatangi mereka sesuai yang mereka kehendaki pada pagi dan sore hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Mereka tidak mendengar perkataan yang tak berguna di dalam surga, kecuali ucapan salam. Bagi mereka rezekinya di surga itu tiap-tiap pagi dan petang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di dalamnya} di dalam surga {mereka tidak mendengar perkataan yang tidak berguna} perkataan yang keji dan berlebihan {kecuali salam} akan tetapi di dalamnya mereka mendengar perkataan yang terhindar dari kecacatan dan kekurangan {Di dalamnya bagi mereka itu rezeki pada pagi dan petang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Mereka tidak mendengar perkataan yang tak berguna di dalam surga,” yaitu ucapan sia-sia yang tidak berguna sama sekaali, dan juga tidak mendengar ucapan yang mengakibatkan dosa. Mereka tidak pernah mendengar cercaan, umpatan, dan perkataan yang mengandung maksiat kepada Allah serta perkataan yang mengeruhkan hati “kecuali ucapan salam,” maksudnya [kecuali] perkataan-perkataan yang terhindar dari segala aib berupa dzikrullah, penghormatan, ungkapan suka cita, kabar gembira, lontaran ucapan yang baik antara sesame kawan, mendengar pembicaraan ar-Rahman, dan suara-suara merdu dari para bidadari, malaikat dan anak-anak kecil, nada-nada berdendang, serta suara-suara yang lembut. Karena memang tempat itu adalah Darussalam (tempat keselamatan). Maka, tidak ada sesuatu pun di sana kecuali keselamatan yang sempurna dari segala sudut aspek. “Mereka mendapatkan rizkinya di surga itu tiap-tiap pagi dan petang,” maksudnya limpahan rizki mereka berupa makanan, minuman, serta beraneka ragam kenikmatan, berkesinambungan terus-menerus di mana pun merekka minta, dan kapan pun mereka inginkan. Dan di antara bentuk kesempurnaan rizki, kenikmatan, serta kebaikan surga adalah keberadaannya (yang selalu siap sedia) pada waktu-waktu tertentu “pagi dan petang,” supaya kenikmatan-kenikmatan itu betul-betul dirasa besar keberadaannya dan fungsi kemanfaatannya pun lebih maksimal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 62: Demikian pula perkataan yang menimbulkan dosa, mereka tidak mendengar caci-maki dan celaan di sana, serta ucapan yang terdapat maksiat kepada Allah. Dari malaikat atau dari sesama mereka. Bisa juga maksud “salam” di ayat ini adalah selamatnya ucapan dari setiap cacat, seperti ucapan dzikrullah, salam penghormatan, ucapan yang menyenangkan, berita gembira, pembicaraan yang baik di antara sesama, mendengar firman Ar Rahman, mendengarkan suara-suara yang merdu, dan sebagainya, karena surga merupakan tempat kesejahteraan, oleh karenanya tidak ada di sana selain kesejahteraan yang sempurna dari berbagai sisi. Di surga tidak ada malam dan siang, yang ada hanyalah sinar dan cahaya selamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 62",
    "description": "Surga yang kami janjikan itu penuh kesenangan. Di dalamnya mereka tidak pernah berbicara atau mendengar perkataan yang tidak berguna, kecuali ucapan salam yang menyejukkan dan mendamaikan. Banyak nikmat Allah di dalamnya, dan di dalamnya bagi mereka ada rezeki pagi dan petang, yang telah Allah tetapkan sebagai pahala atas kebaikan mereka. 63. Itulah surga yang kami janjikan kepada mereka yang taat. Surga itu akan kami wariskan kepada hamba-hamba kami yang selalu bertakwa dengan sepenuh hati."
  }
]