[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Surga yang telah dikemukakan sifat-sifatnya tersebut, itulah surga yang Kami wariskan dan kami berikan kepada hamba Kami yang bertakwa kepada Kami dengan menjalankan perintah-perintah Kami dan menjauhi larangan-larangan Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Surga yang memiliki kriteria seperti inilah yang akan Kami wariskan kepada hamba-hamba Kami yang mengerjakan perintah dan menjauhi larangan-larangan Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Surga yang agung yang telah Kami sebutkan sebagian sifatnya ini akan Kami berikan kepada hamba-hamba Kami yang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. تِلْكَ الْجَنَّةُ الَّتِى نُورِثُ مِنْ عِبَادِنَا مَن كَانَ تَقِيًّا (Itulah surga yang akan Kami wariskan kepada hamba-hamba Kami yang selalu bertakwa) Yakni Kami menjadikan surga itu bagi orang yang bertakwa dan Kami haramkan atas orang selain mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Itulah surga yang akan Kami wariskan kepada hamba-hamba Kami yang selalu bertakwa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah surga yang akan Kami wariskan} Kami berikan dan Kami anugerahkan {kepada hamba-hamba Kami yang selalu bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “Itulah surga-surga,” yang telah Kami terangkan dengan (karakteristik yang sudah) disebutkan itu “yang akan Kami wariskan kepada hamba-hamba Kami yang selalu bertakwa,” maksudnya Kami mewariskannya bagi orang-orang yang bertakwa, menjadikan surga itu sebagai tempat tinggal mereka yang abadi, yang mereka tidak akan pergi darinya, dan tidak berminat untuk mencari ganti. Sebagaimana Allah berfirman, \"Dan bersegeralah kamu kepada ampunan dari Tuhanmu dan kepada surga yang luasnya seluas langit dan bumi yang disediakan untuk orang-orang yang bertakwa,\" (Ali Imran:133)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 63",
    "description": "Itulah surga yang kami janjikan kepada mereka yang taat. Surga itu akan kami wariskan kepada hamba-hamba kami yang selalu bertakwa dengan sepenuh hati. 64. Keterangan tentang keadaan surga yang dijanjikan kepada hamba Allah yang bertakwa disusul dengan penjelasan bahwa turunnya jibril merupakan kehendak dan perintah Allah. Ketika rasulullah mengharapkan jibril lebih sering datang, dia menjawab, 'wahai nabi Muhammad, tidaklah kami, para malaikat, turun kecuali atas perintah tuhanmu. Ketahuilah bahwa hanya milik-Nya segala yang ada di alam semesta, apa saja yang ada di hadapan kita, yang ada di belakang kita, dan segala yang ada di antara keduanya, dan ketahui pula bahwa tuhanmu tidak pernah lupa sedikit pun."
  }
]