[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia adalah tuhan (penguasa) langit dan bumi dan segala yang ada dianatra keduanya, dan pemilik semua itu, pencipta dan pengaturnya, maka beribadahlah kepadanya saja (wahai nabi), dan bersabarlah dalam ketaatan kepadaNya, engkau dan orang-orang yang mengikutimu. Tidak ada sesuatu pun yang serupa denganNya dalam Dzat , nama-nama , sifat-sifat dan perbuatan-perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Dia lah Pencipta langit dan bumi dan segala yang ada diantara keduanya, yang menguasai dan mengatur urusan semuanya, maka sembahlah Dia semata, sebab Dia berhak untuk disembah, dan berteguh hatilah dalam beribadah kepada-Nya, sebab Dia tidak memiliki tandingan dan persamaan yang bisa disembah bersama-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Allah adalah Tuhan tujuh langit dan bumi dan seluruh makhluk yang ada di antara keduanya. Sembahlah Dia semata, dan bersabarlah sesabar-sabarnya dalam menyembah-Nya. Apakah kamu mengetahui sesuatu yang seperti diri-Nya? Tidak ada sesuatupun yang serupa dengan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. رَّبُّ السَّمٰوٰتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا (Tuhan (yang menguasai) langit dan bumi dan apa-apa yang ada di antara keduanya) Yakni Allah adalah pencipta dan pemilik langit, bumi, dan apa yang ada di antara keduanya. فَاعْبُدْهُ وَاصْطَبِرْ لِعِبٰدَتِهِۦ ۚ( maka sembahlah Dia dan berteguh hatilah dalam beribadat kepada-Nya) Yakni teguhkanlah dirimu dalam hal itu. هَلْ تَعْلَمُ لَهُۥ سَمِيًّا (Apakah kamu mengetahui ada seorang yang sama dengan Dia) Yakni tidak ada yang setara dan menyerupai-Nya sehingga dapat menjadi sekutu-Nya dalam penyembahan. Pendapat lain mengatakan maknanya adalah Dia tidak mempunyai sekutu yang mempunyai nama yang sama yaitu ‘Allah’. Yakni tidak ada satu berhalapun yang bernama Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Taimiyah menyebutkan bahwasanya ayat ini menggabungkan antara tiga maca Tauhid, yaitu : at-Tauhid al-Rububiyyah, at-Tauhid al-Uluhiyyah, at-Tauhid al-Asma' wa as-Sifat, maka usahakanlah kalian mengambil darinya pelajaran, semoga Allah menambahkan untuk kalian pemahaman untuk kitab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Tuhan Yang menguasai langit dan bumi dan segala yang ada di antara keduanya, maka sembahlah Dia semata dan berteguh hatilah dan bersabarlah dalam beribadah kepada-Nya. Allah tidak mempunyai permisalan atau persamaan apapun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhan langit, bumi, dan segala yang ada di antara keduanya. Maka sembahlah Dia dan berpegang teguhlah dalam beribadah kepadaNya} dan berpegang teguhlah untuk beribadah kepadaNya dengan sabar dan rajin {Apakah kamu mengetahui sesuatu yang sama denganNya} rekan atau sesuatu yang serupa yang menyertainya untuk disembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Kemudian Allah menjelaskan alasan faktor keluasan ilmuNYa dan ketiadaan sifat lupa padaNya, yaitu karena Dia “Rabb (yang menguasai) langit dan bumi. RububiyahNYa (pengendalianNya) meliputi langit dan bumi. Keberadaan keduanya dalam tatanan terbaik lagi paling sempurna, tanpa ada unsur kelalaian, penyepelean, main-main dan kebatilan, merupakan bukti yang pasti mengenai ilmuNya yang mencakup (segala sesuatu). Maka, janganlah engkau sibukkan dirimu dengan hal itu. Akan tetapi, sibukkanlah dirimu dengan sesuatu yang bermanfaat dan mebdatangkan faidah bagimu. Yaitu beribadah kepada Allah semata, dan tidak ada sekutu bagiNya. “Dan berteguh hatilah dalam beribadah kepadaNya,” maksudnya, kuatkanlah jiwamu dalam, ibadah dan usahakanlah jiwamu bersungguh-sungguh. Laksanakanlah ibadah dengan sebaik-baiknya dan sesempurna munkin sesuai dengan kemampuanmu. Di tengah melansungkan ibadah kepada Allah, terdapat unsur penghibur hati bagi seorang hamba dari semua keterikatan serta kesenangan-kesenangan syahwat. Sebagaimana Firman Allah, \"Dan janganlah kamu tujukan kedua matamu kepada apa yang telah Kami berikan kepada golongan-golongan dari mereka, sebagai bunga kehidupan dunia untuk Kami cobai mereka dengannya. Dan karunia Tuhan kamu adalah lebih baik dan lebih kekal. Dan perintahkanlah kepada keluargamu mendirikan salat dan bersabarlah kamu dalam mengerjakannya. Kami tidak meminta rezeki kepadamu, Kami lah yang memberi rezeki kepadamu. Dan akibat (yang baik) itu adalah bagi orang yang bertakwa.\" (Thaha:131-132) “Apakah kamu mengetahui ada orang yang sama dengan Dia (yang patut diibadahi)?” maksudnya apakah engkau mengetahui suatu obyek yang sama dan menyerupai Allah dari kalangan makhluk? Ini adalah bentuk istifham (pertanyaan), yang bermakna penafian (tidak mungkin ada), yang dapat diketahui dengan akal. Artinya, kamu tidak akan menjumpai ada sesuatu yang sama atau serupa dengan Allah. Karena Dia adalah Rabb (Pengatur), sementara yang lain marbub (diatur). Dia khaliq (Pencipta), sementara yang lain makhluq (ciptaan). Dia Mahakaya dari segala arah, sedangkan selainNya secara fisik membutuhkan dari segala aspek, DIa Maha Sempurna yang memiliki kesempurnaan kecuali yang diberikan oleh Allah. Ini merupakan bukti konkret bahwa hanya Allah yang berhak diibadahi, dan bahwa ibadah kepadaNya merupakan kebenaran, sedangkan ibadah kepada selainNya merupakan sebuah kebatilan. Oleh karena itu, Allah memerintahkan untuk beribadah hanya kepadaNya semata, dan bersabar dalam menjalankannya disertai menjelaskan alasan [tindakan tersebut] dengan aspek kesempurnaanNya, keesaanNYa dalam keagungan dan nama-nama yang paling baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 65: Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan alasan mengapa ilmu-Nya meliputi segala sesuatu dan tidak lupa, yaitu karena Dia Tuhan langit dan bumi; Dia yang mengurus keduanya dengan susunan yang begitu rapih dan sempurna, tanpa ada yang dilalaikan-Nya dan dibiarkan-Nya. Hal ini menunjukkan ilmu-Nya yang mencakup segala sesuatu, sehingga janganlah kamu khawatir, bahkan sibukkanlah dengan hal yang bermanfaat bagimu, yaitu beribadah kepada-Nya. Yakni bersabarlah dalam beribadah dan bersungguh-sungguhlah dalam mengerjakannya serta sempurnakanlah sesuai kemampuanmu. Sesungguhnya menyibukkan diri beribadah dapat mencukupi seorang hamba dari segala ketergantungan dan segala kesenangan. Pertanyaan ini maknanya adalah nafyu (penafian), yakni tidak ada sesuatu pun yang sama dan serupa dengan Dia. Syaikh As Sa’diy rahimahullah berkata, “Yang demikian adalah karena Dia adalah Rabb (Pengatur alam semesta), sedangkan selainnya adalah marbub (yang diatur), Dia adalah Khaliq (Pencipta), sedangkan selain-Nya adalah makhluk (yang dicipta), Dia Mahakaya dari segala sisi, sedangkan selain-Nya fakir dari segala sisi, Dia Maha sempurna, sedangkan selain-Nya berkekurangan, tidak ada kesempurnaan padanya kecuali apa yang diberikan Allah Ta’ala kepadanya. Hal ini merupakan dalil yang qath’i bahwa Dialah yang berhak diibadahi satu-satunya, dan bahwa beribadah kepada-Nya itulah yang benar, sedangkan beribadah kepada selain-Nya adalah batil. Oleh karena itu, Dia memerintahkan untuk beribadah kepada-Nya dan bersabar di atasnya, serta menerangkan alasannya yaitu karena kesempurnaan-Nya, dan kesendirian-Nya dengan keagungan dan nama-nama-Nya yang indah.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 65",
    "description": "Dialah tuhan yang telah menciptakan segala yang ada, menguasai langit dan bumi, dan mengatur serta memelihara segala yang ada di antara keduanya. Maka, sembahlah dia karena hanya dia yang layak disembah, dan berteguhhatilah dalam beribadah kepada-Nya karena hanya dia yang layak menjadi tujuan ibadah. Apakah engkau mengetahui ada sesuatu di alam semesta ini yang setara atau yang sama dengan-Nya, baik sebagai pencipta maupun sebagai sembahan'66. Menerangkan sikap orang-orang yang tidak beriman pada hari kebangkitan, Allah berfirman, 'dan orang kafir itu, meski mengetahui adanya akhirat, tetap saja berkata, 'betulkah apabila aku telah mati, dikuburkan, dan tulang belulangku hancur, kelak aku sungguh-sungguh akan dibangkitkan dari kubur dan hidup kembali' hal ini mustahil terjadi. '."
  }
]