[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan manusia kafir akan berakta untuk mengingkari hari kebangkitan setelah kematian, ”bila aku nanti mati dan aku telah hancur, apakah kelak aku akan dikeluarkan dari kuburku dalam keadaan hidup-hidup?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Dan orang kafir yang ingkar dengan hari Kebangkitan berkata dengan nada mengolok-olok, \"Betulkah apabila aku telah mati, kelak aku akan dikeluarkan kembali dari kuburku dalam keadaan hidup untuk menjalani kehidupan kedua kalinya?! Sungguh ini perkara yang mustahil.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66-67. Orang yang mendustakan hari kebangkitan berkata: “Jika aku telah mati dan lenyap apakah aku akan dikeluarkan dari kubur dalam keadaan hidup?” Tidakkah dia orang yang mendustakan kebangkitan ini mengingat awal penciptaan dirinya dari ketidakadaan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. وَيَقُولُ الْإِنسٰنُ (Dan berkata manusia) Yakni dimaksud dengan manusia di sini adalah orang yang kafir. أُخْرَجُ (dibangkitkan) Yakni apakah aku akan dibangkitkan dari kubur dalam keadaan hidup? Ia menanyakan hal ini karena merasa hal itu tidak mungkin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Manusia yang kafir atas hari kebangkitan berkata dengan sombong: \"Betulkah apabila aku telah mati, bahwa aku sungguh-sungguh akan dibangkitkan menjadi hidup kembali?\" Ayat ini turun untuk Ubay bin Khalf ketika dia mengambil tulang yang telah tua. Dia berkata: Muhammad mengklaim bahwa kalian kelak akan dibangkitkan dari kematian. Dalam riwayat lain ayat ini turun untuk Walid bin Mughirah dan para sahabatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang (kafir) berkata,“Apakah apabila aku telah mati kelak aku sungguh-sungguh akan dibangkitkan lagi menjadi hidup”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Yang dimaksud dengan lafazh insan (manusia) dalam ayat ini adalah setiap manusia yang mengingkari Hari Kebangkitan, menganggap kejadiannya sebagai peristiwa yang mustahil. Orang ini bertanya dengan nada meniadakan, menentang serta mengingkari, “Betulkah apabila aku telah mati, aku sungguh akan dibangkitkan menjadi hidup kembali?” maksudnya, bagaimana mungkkin Allah bisa menghidupkanku lagi setelah aku mati, dan setelah aku (menjadi tulang belulang yang) hancur luluh? Kejadian ini tidak akan terjadi dan tidak bisa diimajinasikan! Tentunya, pernyataan ini berdasarkan akalnya yang rusak dan niatannya yang jelek serta kekufurannya kepada para rasul dan kitab-kitab Allah. Seandainya dia mau memperhatikan sejenak saja dan merenungkan sebentar saja, pasti dia akan menyadari bahwa klaimnya mengenai kemustahilan Hari Kebangkitan, (berada) dalam puncak kebodohan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 66",
    "description": "Menerangkan sikap orang-orang yang tidak beriman pada hari kebangkitan, Allah berfirman, 'dan orang kafir itu, meski mengetahui adanya akhirat, tetap saja berkata, 'betulkah apabila aku telah mati, dikuburkan, dan tulang belulangku hancur, kelak aku sungguh-sungguh akan dibangkitkan dari kubur dan hidup kembali' hal ini mustahil terjadi. '67. Demikianlah keingkaran orang-orang kafir. Tidakkah manusia yang ingkar itu memikirkan bahwa sesungguhnya kami telah menciptakannya dahulu sebelum dilahirkan, padahal sebelumnya dia belum berwujud sama sekali' bila dia menyadari hal itu, niscaya dia mengetahui bahwa dia telah diciptakan dan pencipta itu adalah Allah."
  }
]