[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami akan ambil dari masing-masing kelompok itu orang-orang yang paling besar pembangkangnya dan paling durhaka kepada Allah, lalu Kami memulai dengan menyiksa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Kemudian Kami pasti akan tarik dengan kasar dari setiap golongan sesat siapa di antara mereka yang sangat durhaka, sebab merekalah pemimpin golongan sesat itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69-70. Kemudian dari setiap golongan orang-orang yang sesat Kami akan menarik dengan keras orang-orang yang paling pembangkang dan angkuh, untuk memulai azab dari mereka. Dan sungguh Kami Maha Mengetahui orang-orang yang berhak masuk ke neraka Jahannam dan merasakan panasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ (Kemudian pasti akan Kami tarik dari tiap-tiap golongan) Makna (الشيعة) yakni golongan yang menganut suatu agama. أَيُّهُمْ أَشَدُّ عَلَى الرَّحْمٰنِ عِتِيًّا(siapa di antara mereka yang sangat durhaka kepada Tuhan Yang Maha Pemurah) Allah akan mengambil orang yang paling durhaka dan banyak bermaksiat dari setiap golongan yang sesat dan rusak; dan mereka adalah para pemimpin mereka dalam kejahatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Kemudian pasti akan Kami tarik dari tiap-tiap golongan siapa di antara mereka yang sangat durhaka kepada Tuhan Yang Maha Pemurah akan benar-benar Kami segerakan azab unuk mereka sebagai yang pertama, adapun pengikutnya setelahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami pasti akan menarik} sungguh Kami akan menari dengan keras dan kuat {dari setiap golongan} golongan {siapa pun di antara mereka yang paling durhaka} sombong dan durhaka {kepada Dzat Yang Maha Pengasih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Oleh karena itu, Allah menyebutkan keputusanNya pada mereka. Allah berfirman, “Kemudian pasti Kami akan mengambil dari tiap-tiap golongan, siapa di antara mereka yang sangat durhaka kepada Dzat Yang Maha Pemurah,” maksudnya kemudian Kami sungguh akan mengambil dari masing-masing kelompok dan golongan kaum yang zhalim yang bekerjasama dalam kezhaliman, kekufuran, serta kesombongan, yaitu orang yang paling sombong, zhalim, serta kufur. Lalu dia didahulukan penyiksaannya. Demikian selanjutnya, didahulukan penyiksaan bagi orang yang paling parah dosanya. Waktu itu, mereka saling melaknat, sebagian melaknat sebagian yang lain. Orang-orang yang datang belakangan mengatakan kepada para pendahulunya, \"Ya Tuhan kami, mereka telah menyesatkan kami, sebab itu datangkanlah kepada mereka siksaan yang berlipat ganda dari neraka\". Allah berfirman: \"Masing-masing mendapat (siksaan), yang berlipat ganda, akan tetapi kamu tidak mengetahui\".Dan berkata orang-orang yang masuk terdahulu di antara mereka kepada orang-orang yang masuk kemudian: \"Kamu tidak mempunyai kelebihan sedikit pun atas kami, maka rasakanlah siksaan karena perbuatan yang telah kamu lakukan\". (Al-A’raf:38-39)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 69: Yakni berani. Lalu mereka didahulukan untuk menerima azab, kemudian orang yang di bawahnya dalam hal kedurhakaan, dst. Dalam keadaan seperti itu, mereka saling laknat-melaknat. Ketika itu orang yang terbelakang dimasukkan ke neraka mereka berkata kepada orang yang dimasukkan ke neraka lebih dulu, \"Ya Tuhan Kami, mereka telah menyesatkan kami, sebab itu datangkanlah kepada mereka siksaan yang berlipat ganda dari neraka.” Allah berfirman: \"Masing-masing mendapat (siksaan) yang berlipat ganda, akan tetapi kamu tidak mengetahui\" (Lihat surah Al A’raaf: 38)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 69",
    "description": "Kemudian untuk lebih meyakinkan, pasti akan kami tarik dengan kasar dan paksa dari setiap golongan yang ingkar itu siapa di antara mereka yang sangat durhaka kepada tuhan yang maha pengasih, yang selalu mencurahkan rahmat dan kasih-Nya kepada mereka. 70. Selanjutnya, dengan semua yang terjadi dan demikian banyaknya manusia yang menyaksikan tempat hukuman itu, kami sungguh lebih mengetahui siapa saja orang yang paling tepat dan seharusnya dimasukkan ke dalam neraka sebagai balasan atas perbuatan buruk dan keingkarannya."
  }
]