[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai zakaria, sesungguhnya Kami memberi kabar gembira kepadamu dengan mengabulkan permohonanmu. Dan sungguh Kami anugerahkan kepadamu seorang anak lelaki bernama yahya, yang sebelumnya Kami belum pernah memberikan nama bagi seorang pun dengan nama tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Maka Allah pun mengabulkan doanya, dan memanggilnya, \"Wahai Zakariya! Kami memberimu kabar yang menggembirakan, Kami telah mengabulkan doamu dan akan menganugerahkan padamu seorang anak laki-laki bernama Yahya. Kami belum pernah memberikan nama itu kepada selainnya sebelum ini.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Maka Allah mengabulkan doanya. Dan para malaikat menyerunya: “Hai Zakariya, Kami memberimu kabar gembira berupa seorang anak yang bernama Yahya, Kami belum pernah menamai seseorang sebelumnya dengan nama ini.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. يٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلٰمٍ اسْمُهُۥ يَحْيَىٰ (Hai Zakaria, sesungguhnya Kami memberi kabar gembira kepadamu akan (beroleh) seorang anak yang namanya Yahya) Allah mengabulkan doanya, sehingga Allah mengarahkan seruan ini kepadanya melalui perantara malaikat. لَمْ نَجْعَل لَّهُۥ مِن قَبْلُ سَمِيًّا(yang sebelumnya Kami belum pernah menciptakan orang yang serupa dengan dia) Yakni Kami belum pernah memberi nama seseorang sebelumnya dengan nama Yahya. Imam Mujahid berpendapat maknanya adalah Allah tidak menjadikan orang lain yang menandinginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Maka Allah mengabulkan doa nabi Zakaria, sehingga Malaikat menyerunya dengan perkataan: “Hai Zakaria, sesungguhnya Kami memberi kabar gembira kepadamu, bahwa kamu akan memperoleh seorang anak yang bernama Yahya, yang sebelumnya Kami belum pernah memberi nama ini sebelum dia dan belum menciptakan orang yang serupa dengan dia dalam hal kesalehan dan kewara’an"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Zakaria, sesungguhnya Kami memberi kabar gembira kepadamu dengan seorang anak laki-laki yang bernama Yahya yang nama itu belum pernah Kami berikan sebelumnya”} yang menyamainya dalam hal nama, yaitu belum ada satupun yang dinamai Yahya sebelum ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Maksudnya, Allah memberinya kabar gembira tentang (kelahiran) Yahya melalui para malaikat. Allah menamakannya dengan sebutan Yahya. Sebuah nama yang selaras dengan pemiliknya. Dia hidup dengan nyata lagi tampak oleh lndera (hissi) sampai nikmat (Allah) sempurna pada dirinya dan juga hidup secara maknawi. Yaitu kehidupan hati dan ruhnya disertai wahyu, ilmu dan agama. “Yang sebelumnya Kami belum pernah menciptakan orang yang serupa dengannya,” maksudnya belum pernah ada seorang pun yang menggunakan nama ini sebelumnya. Ada kemungkinan (juga), makna ayat ini adalah Kami belum pernah menciptakan orang yang setara dan sama namanya dengannya di banding masa sebelumnya. Sehingga, jadilah ini sebagai kabar gembira (bagi Zakaria) karena kesempurnaan Yahya, yang menyandang sifat-sifat yang terpuji, dan bahwa Yahya itu mengungguli orang-orang sebelumnya. Akan tetapi, berdasarkan kemungkinan ini, maka keumumannya harus ditakhsis (dipersempit) dengan Nabi Ibrahim, Musa, NUh, dan lain sebagainya, yang mereka ini dipastikan lebih baik dibandingkan dengan Yahya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 7: Allah menamainya dengan Yahya, sesuai dengan orangnya, di mana ia hidup secara hissiy (konkrit) maupun maknawi (abstrak). Contoh maknawi adalah hidupnya hati dan ruh dengan wahyu dan ilmu, sehingga sempurnalah nikmat yang diberikan kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 7",
    "description": "Allah mengabulkan doa nabi zakaria. Allah berfirman, 'wahai zakaria, kami memperkenankan doamu. Melalui perantaraan jibril, kami memberi kabar gembira kepadamu dengan menganugerahimu seorang anak laki-laki yang namanya yahya. Nama ini merupakan sebutan yang kami belum pernah memberikan nama seperti itu sebelumnya kepada siapa pun. '8. Mendengar berita gembira itu nabi zakaria heran dan bertanya pada diri sendiri tentang kemungkinannya. Dia berkata, 'ya tuhanku yang maha pemurah, bagaimana mungkin aku akan bisa mempunyai anak seperti yang engkau beritakan, padahal istriku sejak masa mudanya dahulu adalah seorang yang mandul dan aku sendiri sesungguhnya sudah mencapai usia yang sangat tua yang pada lazimnya tidak mungkin memperoleh anak lagi''."
  }
]