[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada seorang pun dari kalian (wahai manusia) kecuali akan mendatangi neraka dengan melewati jembatan yang terbentang diatas jahanam. Masing-masing tergantung amal perbuatannya. hal itu merupakan suatu perkara yang sdah dipastikan. Allah telah menentukan dan menetapkan bahwa sesungguhnya itu akan terjadi dengan pasti."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan tidak seorang pun diantara kalian -wahai manusia- melainkan akan melewati jembatan yang diletakkan di atas neraka Jahanam, hal ini merupakan ketentuan Allah yang pasti terjadi, dan sungguh ketentuan Allah itu tidak akan ada yang bisa menolaknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71-72. Hai hamba-hamba, tidaklah dari kalian melainkan pasti akan melalui neraka; adapun orang-orang beriman akan melewati shirath yang ada di atas neraka dengan kecepatan yang berbeda-beda sesuai dengan amal perbuatan mereka. Sedangkan orang-orang kafir akan melaluinya untuk kekal di dalamnya. Kemudian Kami akan menyelamatkan orang-orang bertakwa dengan keselamatan yang besar, dan Kami akan membiarkan orang-orang kafir di dalam neraka dalam keadaan berlutut karena keadaan yang sangat mengerikan. Ummu Mubasysyir berkata bahwa dia mendengar Rasulullah berkata ketika berada di sisi Hafshah, “Tidak akan masuk neraka -jika Allah menghendaki- seorang pun dari mereka yang ikut serta berbai’at di bawah pohon.” Hafshah berkata,”Apakah memang benar seperti itu, wahai Rasulullah?” Rasulullah lalu menegur Hafshah. Lalu Hafshah membacakan ayat, وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا “Dan tidak ada seorang pun dari padamu, melainkan mendatangi neraka itu.” (Maryam: 71) Kemudian Rasulullah bersabda, ”Allah berfirman, ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا “Kemudian kami akan menyelamatkan orang-orang yang bertakwa dan membiarkan orang-orang yang zalim di dalam neraka dalam keadaan berlutut.” (Maryam: 72)” (Shahih Muslim 4/1942 no. 2406, kitab fadhilah-fadhilah para sahabat, bab fadhilah-fadhilah para sahabat yang berbai’at ridwan)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَإِن مِّنكُمْ إِلَّا وَارِدُهَا ۚ (Dan tidak ada seorangpun dari padamu, melainkan mendatangi neraka itu) Yakni tidak ada seorang manusiapun melainkan ia akan mendatangi neraka untuk menyeberangi sirath. كَانَ عَلَىٰ رَبِّكَ حَتْمًا مَّقْضِيًّا (Hal itu bagi Tuhanmu adalah suatu kemestian yang sudah ditetapkan) Yakni keputusan yang telah ditetapkan Allah yang harus terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Tidak ada seorangpun dari kamu, melainkan akan mendatangi neraka itu. Yang dibentangkan shirath yang di atasnya. Melewati shirath itu adalah kewajiban untukmu. Hal itu bagi Tuhanmu adalah suatu kemestian yang sudah ditetapkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada seorang pun di antara kalian} tidak ada seorang pun di antara kalian {kecuali melewatinya} berjalan di atas jalan yang disediakan di atas punggung neraka Jahanam {Hal itu bagi Tuhanmu adalah ketentuan yang sudah ditetapkan} perkara yang wajib dan sudah ditetapkan oleh Allah atas kalian, sehingga pasti terjadi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Arah pembicaraan ini ditujukan kepada semua makhluk, yang baik dan yang buruk, yang Mukmin dan yang kafir, bahwasanya tiada seorang pun dari mereka melainkan pasti akan memasuki neraka, sebagai suatu ketetapan yang sudah Allah tetapkan atas diriNya, dan telah Dia janjikan kepada semua hambaNya. Maka, janji ini pasti terlaksana, tidak ada yang memalingkan kejadiannya. Maka kata al-Wurud (mendatangi) masih diperselisihkan (oleh para ulama). Ada yang mengatakan, maknanya adalah kehadiran wujud neraka di hadapan seluruh makhluk sehingga menimbulkan rasa takut pada setiap orang. Kemudian Allah menyelamatkan orang-orang yang bertakwa. Sebagian berpendapat, maksud “mendatanginya” adalah memasukinya. Namun neraka menjadi dingin dan keselamatan bagi orang-orang Mukimin. Sebagian ulama lain mengartikan lafazh “mendatangi” dengan makna melewati di atas Shirath (jembatan) yang berada di atas prermukaan Neraka Jahanam. Maka masing-masing orang melewatinya sesuai dengan amalnya. Di antara mereka ada yang melewatinya secepat kedipan mata, seperti angina, bagai pacuan kuda terbaik, bak lari unta terbaik. Ada orang yang berlari, berjalan, ada (pula) yang merangkak. Sebagian dari mereka terkena sambaran lalu terlempar ke neraka. Masing-masing sesuai dengan kadar ketakwaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 71: Wahai manusia. Para ulama berbeda pendapat tentang maksud mendatanginya. Ada yang berpendapat, bahwa maksudnya adalah bahwa semua makhluk mendatanginya sehingga merasakan kecemasan yang dahsyat, lalu Allah menyelamatkan orang-orang yang bertakwa. Ada pula yang berpendapat, bahwa mendatanginya adalah dengan memasukinya, namun bagi orang-orang mukmin terasa dingin dan membawa keselamatan. Ada pula yang berpendapat, bahwa maksud mendatanginya adalah melewati shirath (jembatan yang dibentangkan di atas neraka Jahanam), lalu mereka melintasinya sesuai amal mereka, di antara mereka ada yang melewatinya seperti sekejap mata, ada pula yang melewatinya seperti angin, ada pula yang melewatinya seperti kuda yang cepat, ada yang melewatinya dengan berlari, ada pula yang melewatinya dengan berjalan, ada pula yang melewatinya dengan merangkak, dan ada pula yang tersambar jeruji besi lalu dijatuhkan ke neraka. Semuanya tergantung ketakwaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 71",
    "description": "Sesudah memperingatkan orang-orang kafir, Allah lantas mengarahkan peringatannya kepada semua manusia. Wahai manusia, ketahuilah bahwa tidak ada seorang pun di antara kamu yang tidak menyaksikan neraka itu dan mendatanginya. Hal itu, yakni membuatmu datang dan menyaksikan neraka, bagi tuhanmu adalah suatu ketentuan yang sudah ditetapkan dan tidak akan diubah. 72. Setelah peristiwa itu kemudian kami akan menyelamatkan orang-orang yang bertakwa dan membuktikan ketakwaannya dengan menaati syariat, dan kami akan membiarkan orang-orang yang zalim dan ingkar tetap di dalam neraka dalam keadaan berlutut karena pedihnya hukuman yang mereka rasakan."
  }
]