[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami menyelamatkan orang-orang yang bertakwa kepada tuhan mereka dengan taatan kepadaNya dan menjauhi maksiat kepadaNya. Dan Kami memberiarkan orang-orang yang telah menzhalimi diri mereka dengan perbuatan kekafiran kepada Allah berada di dalam neraka dengan keberadaan berlutut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Kemudian setelah melewati jembatan ini, Kami akan menyelamatkan orang-orang yang bertakwa kepada Tuhan mereka dengan mentaati perintah dan menjauhi larangan-Nya, dan membiarkan orang-orang yang zalim dalam keadaan berlutut di dalam Neraka, dan mereka sama sekali tidak akan bisa keluar darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. ثُمَّ نُنَجِّى الَّذِينَ اتَّقَوا۟ (Kemudian Kami akan menyelamatkan orang-orang yang bertakwa) Yakni jauhilah kekafiran dan kemaksiatan kepada Allah yang dapat menjerumuskan kalian ke neraka. Orang-orang yang bertakwa kepada Allah akan diselamatkan dari neraka; mereka akan dapat menyebrangi sirath berkat keimanan dan amalan mereka. وَّنَذَرُ الظّٰلِمِينَ فِيهَا جِثِيًّا (dan membiarkan orang-orang yang zalim di dalam neraka dalam keadaan berlutut) Yakni mereka tetap di sana dalam keadaan berlutut tanpa bisa keluar dari neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Kemudian Kami akan menyelamatkan orang-orang yang bertakwa dan membiarkan orang-orang yang zalim di dalam neraka dalam keadaan berlutut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami akan menyelamatkan orang-orang yang bertakwa dan membiarkan} membiarkan {orang-orang zalim di dalamnya dalam keadaan tersungkur} berlutut di atas lutut mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. OLeh sebab itu, Allah berfirman, “Kemudian Kami akan menyelamatkan orang-orang yang bertakwa,” kepada Allah dengan cara mengerjakan perintah serta menjauhi larangan “dan kami membiarkan orang-orang yang zhalim,” terhadap diri mereka sendiri dengan melakukan kekufuran dan maksiat “di neraka dalam keadaan berlutut.” Ini adalah akibat dari kekufuran dan perbuatan maksiat mereka, sehingga mengakibatkan mereka kekal abadi di dalam neraka. Azab sudah pasti mengenai, dan semua faktor (penyelamat) sudah tidak berlaku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 72: Dengan berbuat kufur dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 72",
    "description": "Setelah peristiwa itu kemudian kami akan menyelamatkan orang-orang yang bertakwa dan membuktikan ketakwaannya dengan menaati syariat, dan kami akan membiarkan orang-orang yang zalim dan ingkar tetap di dalam neraka dalam keadaan berlutut karena pedihnya hukuman yang mereka rasakan. 73. Penjelasan mengenai ancaman Allah kepada orang-orang kafir dikuti dengan uraian tentang tanggapan mereka atas ajakan untuk beriman. Dan apabila dibacakan kepada mereka ayat-ayat kami yang jelas maksud, kebenaran, dan petunjuk-Nya, orang-orang yang kafir berkata kepada orang-orang yang beriman dengan angkuh dan sombong karena merasa memiliki kelebihan atas mereka guna mengalihkan pembicaraan, \"manakah di antara kedua golongan di antara kita yang lebih baik tempat tinggalnya dan lebih indah tempat pertemuan-Nya' bukankah ini membuktikan bahwa tuhan lebih sayang kepada kami''."
  }
]