[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berapa banyak yang telah kami binasakan dari umat-umat manusia sebelum orang-orang kafir dari kaummu (wahai rasul) mereka itu lebih baik barang-barang rumahnya dan lebih enak dipandang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Dan sungguh betapa banyak umat yang Kami binasakan sebelum adanya orang-orang kafir yang menyombongkan diri dengan kekayaan materi yang mereka miliki itu, umat-umat itu lebih banyak hartanya dibandingkan mereka, dan lebih indah dipandang mata lantaran mahalnya harga pakaian mereka dan eloknya tubuh mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ (Berapa banyak umat yang telah Kami binasakan sebelum mereka) Makna (القرن) yakni umat atau kelompok. هُمْ أَحْسَنُ أَثٰثًا (sedang mereka adalah lebih bagus alat rumah tangganya) Makna (الأثاث) yakni segala bentuk harta seperti unta, sapi, kambing, dan perhiasan. Pendapat lain mengatakan maknanya adalah harta yang berupa peralatan rumah tangga saja seperti Kasur, pakaian, kelambu, karpet, sofa, dan dipan. وَرِءْيًا (dan lebih sedap di pandang mata) Yakni yang lebih indah pada pandangan orang lain dari sisi pakaian dan keindahan badan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Berapa banyak umat yang telah Kami binasakan sebelum mereka, sedang mereka adalah lebih bagus alat rumah tangganya dan lebih sedap di pandang mata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Betapa banyak umat} umat {yang telah Kami binasakan sebelum mereka, padahal mereka lebih bagus perkakas rumah tangganya} barang-barang dan hartanya {dan (lebih indah) dipandang} dipandang dan dilihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Ini sebuah petunjuk yang berada pada tingkatan paling rusak, termasuk dalam kategori membolak-balikkan fakta-fakta. Jika bukan demikian (sasarannya), maka sesungguhnya gelimang harta dan anak yang banyak serta penampilan elok, kerap kali justru menjadi penyebab kebinasaan pemiliknya, kesengsaraan, serta kejahatannya. Sebab itu, Allah berfirman, “Berapa banyak umat yang telah Kami binasakan sebelum mereka, sedang mereka adalah lebihi bagus alat rumah tangganya,” yaitu perabotan-perabotan berupa bejana-bejana, ranjang-ranjang, rumah-rumah tempat tinggal dan ornament-ornamen penghias, “dan lebih sedap dipandang mata,” maksudnya lebih bagus penampilan dan rupa fisiknya berupa kehidupan yang enak, kenikmatan-kenikmatan yang membahagiakan dan penampilan yang elok. Jika orang-orang yang sudah dibinasakan ini kondisinya lebih baik daripada orang-orang kafir (Quraisy) ini, sementara semua itu tidak bisa menolak kedatangan azab kepada mereka, lalu bagaimana mungkin orang-orang kafir Makkah selamat dari azab padahal mereka lebih miskin dan lebih hina daripada mereka? \"Apakah orang-orang kafirmu (hai kaum musyrikin) lebih baik dari mereka itu, atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam Kitab-kitab yang dahulu?.\" (Al-Qamar:43). Dari sini dapat diketahui, bahwa menjadikan “kemakmuran duniawi seseorang sebagai indicator kebaikannya di akhirat” merupakan argument yang sangat buruk. Dan itu termasuk metode orang-orang kafir"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 74: Maksudnya, umat-umat yang mengingkari Allah seperti kaum 'Aad dan Tsamud. Daripada orang-orang kafir yang mengaku lebih baik tempat tinggal dan tempat pertemuannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 74",
    "description": "Anggapan orang kafir bahwa mereka lebih baik dan disayang tuhan adalah keliru. Kemuliaan dan kemakmuran mereka tidak membuktikan rida Allah. Dan berapa banyak umat yang hidup sejahtera, tetapi karena ingkar maka mereka termasuk kaum yang telah kami binasakan seperti orang-orang sebelum mereka, padahal mereka lebih bagus dan indah perkakas rumah tangganya dan lebih sedap dipandang mata penampilan dan keadaannya. 75. Menanggapi cemoohan mereka, katakanlah wahai nabi Muhammad, 'barang siapa berada dalam kesesatan dan keingkaran yang membuatnya sombong dan enggan beriman, maka biarlah tuhan yang maha pengasih memperpanjang baginya umur dan kesempatan untuk menikmati kehidupan duniawi. Mereka dibiarkan sehingga terlena dalam keingkarannya. Kelak apabila mereka telah melihat apa yang diancamkan kepada mereka, baik azab yang mereka dapatkan dari musuh yang lebih perkasa maupun kedahsyatan kiamat yang menjadi awal pembalasan atas keingkaran mereka, maka saat itu mereka akan mengetahui siapa yang lebih jelek kedudukannya akibat siksa Allah dan lebih lemah bala tentaranya yang selama ini mereka andalkan untuk membela kepentingannya. '."
  }
]