[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada mereka ”siapa saja yang sesat menyimpang dari kebenaran, tidak mengikuti jalan hidayah, maka Allah akan menunda waktu (hukuman baginya) dan memperpanjang masa baginya dalam kesesatannya, hingga ketika dia melihat dengan penuh keyakinaan apa yang Allah ancamkan, baik siksaan yang disegerakan di dunia maupun terjadinya hari kiamat maka waktu itulah dia akan tahu siapakah yang lebih buruk tempat dan kedudukannya dan lebih lemah kekuatan dan pasukannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Katakanlah wahai Rasul, \"Barangsiapa yang terus-menerus berada dalam kesesatannya, maka biarlah Tuhan Yang Maha Pengasih yang membiarkannya dan tidak segera mengazabnya agar ia bertambah sesat, sehingga apabila mereka telah menyaksikan apa yang diancamkan kepada mereka berupa azab yang disegerakan di dunia ini atau azab yang diundur di Akhirat kelak, maka saat itu juga mereka akan tahu siapa yang lebih buruk kedudukannya, dan lebih lemah penolongnya; apakah golongan mereka atau golongan orang-orang yang beriman?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Hai Rasulullah, katakanlah kepada orang-orang musyrik yang angkuh itu: “Orang-orang yang dalam kesesatan dan berpaling dari jalan yang benar di antara kita, maka Allah telah menangguhkannya dan membiarkannya dalam kesesatan hingga datang ketetapan Allah, antara azab yang disegerakan di dunia atau dibiarkan hingga hari kiamat; dan ketika itu mereka akan mengetahui siapa yang lebih buruk tempatnya dan lebih lemah kekuatannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. قُلْ مَن كَانَ فِى الضَّلٰلَةِ فَلْيَمْدُدْ لَهُ الرَّحْمٰنُ مَدًّا ۚ (Katakanlah: “Barang siapa yang berada di dalam kesesatan, maka biarlah Tuhan yang Maha Pemurah memperpanjang tempo baginya) Yakni barangsiapa yang tenggelam dalam hawa nafsunya di dunia maka Allah akan membalasnya dengan membiarkannya dalam kesesatan terus menerus. إِمَّا الْعَذَابَ (baik siksa) Di dunia dengan pembunuhan atau berbagai musibah. وَإِمَّا السَّاعَة(maupun kiamat) Yakni hari kiamat. فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَّكَانًا وَأَضْعَفُ جُندًا (maka mereka akan mengetahui siapa yang lebih jelek kedudukannya dan lebih lemah penolong-penolongnya) Yakni mereka yang menyombongkan diri di hadapan orang-orang beriman karena memiliki kedudukan yang lebih tinggi dan pengikut yang lebih banyak kelak mereka akan mengetahui pada hari kiamat bahwa mereka lebih buruk tempatnya dan lebih lemah pengikutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Katakanlah kepada orang musyrik wahai Nabi: \"Barang siapa yang berada di dalam kesesatan, maka biarlah Tuhan yang Maha Pemurah memperpanjang tempo baginya; sehingga apabila mereka telah melihat apa yang diancamkan kepadanya, baik siksa maupun kiamat, maka mereka akan mengetahui siapa yang lebih jelek kedudukannya dan lebih lemah penolong-penolongnya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Siapa yang berada dalam kesesatan, maka biarlah Tuhan Yang Maha Pengasih memperpanjang waktu baginya} maka Dzat Yang Maha Pengasih akan menangguhkan mereka sangat lama, agar bertambah kezaliman dan kesesatannya {Sehingga apabila telah melihat} melihat {apa yang diancamkan kepada mereka, baik azab maupun kiamat} kiamat {mereka akan mengetahui siapa yang lebih buruk kedudukannya} tempatnya {dan lebih lemah tentaranya”} penyelamat dan penolongnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Setelah menyebutkkan dalil mereka yang batil, yang mengisyaratkan betapa dahsyat kekufuran dan kesesatan ereka dalam ayat ini, Allah memberitahukan bahwa orang yang berada dalam kesesatan dengan menyukai kesesatan itu bagi dirinya dan mengerahkan usaha untuk mewujudkannya, maka sesungguhnya Allah akan memperpanjang tempo baginya dan membuatnya kian cinta pada kesesatan. Ini sebagai azab bagi mereka karena lebih memilih kesesatan daripada petunjuk. Allah berfirman, \"Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka; dan Allah tiada memberi petunjuk kepada kaum yang fasik.\" (Ash-Shaff:5), \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Qur'an) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.\" (Al-An’am:110) \"sehingga Mereka melihat\" yakni yang berbicara, \" \"Manakah di antara kedua golongan (kafir dan mukmin) yang lebih baik tempat tinggalnya dan lebih indah tempat pertemuan (nya)?\" “Apa yang diancamkan kepada mereka, baik berupa azab,” dengan bentuk pembunuhan atau yang lainnya “ataupun Hari KIamat,” yang merupakan pintu gerbang pembalasan amal, “maka mereka akan mengetahui siapa yang lebih jelek kedudukannya dan lebih lemah penolong-penolongnya,” maksudnya pada saat itu, akan terlihat jelas bagi mereka batilnya pengakuan mereka. Itu hanya pengakuan-pengakuan yang akan sirna. Dan mereka menjadi yakin bahwa diri mereka adalah orang-orang yang telah berbuat kejahatan dan lebih lemah penolong-penolongnya. Tetapi, kesadaran ini sudah tidak memmberikan manfaat sama sekali buat mereka, karena mereka tidak mungkin lagi kembali ke dunia untuk melakukan perbuatan yang berbeda dengan perbuatan pertama mereka"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 75: Maksudnya, memanjangkan umur dan membiarkan mereka hidup dalam kesenangan. Bisa juga maksudnya menambah kesesatannya. Seperti terbunuh, tertawan, dsb. Mereka atau orang-orang mukmin? Bala tentara mereka adalah setan, sedangkan bala tentara orang-orang mukmin adalah malaikat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 75",
    "description": "Menanggapi cemoohan mereka, katakanlah wahai nabi Muhammad, 'barang siapa berada dalam kesesatan dan keingkaran yang membuatnya sombong dan enggan beriman, maka biarlah tuhan yang maha pengasih memperpanjang baginya umur dan kesempatan untuk menikmati kehidupan duniawi. Mereka dibiarkan sehingga terlena dalam keingkarannya. Kelak apabila mereka telah melihat apa yang diancamkan kepada mereka, baik azab yang mereka dapatkan dari musuh yang lebih perkasa maupun kedahsyatan kiamat yang menjadi awal pembalasan atas keingkaran mereka, maka saat itu mereka akan mengetahui siapa yang lebih jelek kedudukannya akibat siksa Allah dan lebih lemah bala tentaranya yang selama ini mereka andalkan untuk membela kepentingannya. '76. Dan berbanding terbalik dengan kondisi orang kafir, bagi orang yang beriman dan meyakini keagungan-Nya, Allah akan terus menambah petunjuk kepada mereka yang telah mendapat petunjuk sehingga mereka semakin taat dan tekun berbuat baik. Dan amal kebajikan yang kekal itu tentu lebih baik pahalanya di sisi tuhanmu dan lebih baik pula kesudahannya bagi mereka yang mengerjakannya."
  }
]