[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah akan menambahkan kepada hamba-hambaNya yang telah memperoleh petunjuk menuju agamaNya berupa hidayah diatas hidayah mereka melalui hal-hal baru yang senantiasa terjadi pada mereka berupa mengimani kewajiban-kewajiban kepada Allah dan mengamalkannya dan amal-amal shalih yang kekal itu lebih baik pahalanya disisi Allah di akhirat kelak dan lebih baik tempat kembali dan kesudahannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Adapun kebalikan dari hal itu, maka Dia menambah iman dan ketaatan orang-orang yang berada di atas petunjuk. Dan amal-amal saleh yang mengantarkan pada kebahagiaan yang kekal abadi -wahai Rasul-, maka merupakan pahala yang lebih bermanfaat dan ganjaran yang lebih baik dari sisi Tuhanmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Allah akan menambah cahaya orang-orang yang mendapat petunjuk agar mereka dapat teguh di atas jalan keimanan dan amal shalih. Dan zikir-zikir yang dapat menyinari hati lebih baik pahala dan kesudahannya di sisi Allah di akhirat daripada segala yang disombongkan dan dibanggakan penduduk bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. وَيَزِيدُ اللهُ الَّذِينَ اهْتَدَوْا۟ هُدًى ۗ (Dan Allah akan menambah petunjuk kepada mereka yang telah mendapat petunjuk) Hal ini karena kebaikan akan mengundang kebaikan lainnya; dan Allah menjadikan balasan orang-orang yang beriman dengan bertambahnya keyakinan mereka, sebagaimana menjadikan balasan orang-orang kafir dengan menenggelamkan mereka dalam kesesatan mereka. وَالْبٰقِيٰتُ الصّٰلِحٰتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا(Dan amal-amal saleh yang kekal itu lebih baik pahalanya di sisi Tuhanmu) Yakni segala ketaatan yang membawa kepada kebahagiaan yang kekal lebih bermanfaat daripada kenikmatan dunia yang dinikmati oleh orang-orang kafir. وَخَيْرٌ مَّرَدًّا (dan lebih baik kesudahannya) Makna (المرد) adalah kesudahan atau tempat kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Dan Allah akan menambah petunjuk kepada mereka yang telah mendapat petunjuk. Dan amal-amal saleh yang kekal itu lebih baik pahalanya di sisi Tuhanmu dan lebih baik kesudahannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah akan menambah petunjuk kepada orang-orang yang telah mendapat petunjuk. Amal kebajikan yang kekal itu} setiap amal shalih berupa perkataan dan tindakan itu {lebih baik di sisi Tuhanmu pahala dan kesudahannya} tempat kembali dan kesudahannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Setelah Allah memberitahukan bahwa Dia memberi tempo yang panjang bagi orang-orang zhalim dalam kesesatan mereka, Allah menyebutkan bahwa Dia memberikan tambahan hidayah bagi orang-orang yang telah meraih hidayah sebagai (cermin) karunia dan rahmatNya kepada mereka. Hidayah yang mencakup ilmu yang bermanfaat dan amal shalih. Setiap orang yang menempuh suatu jalan dalam mencari ilmu, keimanan, dan melakukan amal shalih, maka Allah akan memberikan tambahan kepadanya, mempermudah pencapaiannya, dan meringankan baginya serta memberikan karunia lain yang di luar usahanya. Di sini terdapat petunjuk bahwa iman itu bertambah dan bisa berkurang. Sebagaimana dikatakan oleh as-Salaf ash-Shalih. Hal ini dikuatkan oleh Firman Allah, \"orang yang beriman bertambah imannya\" (Al-Mudatsir:31). \"dan apabila dibacakan kepada mereka ayat-ayat-Nya bertambahlah iman mereka (karenanya) dan kepada Tuhan-lah mereka bertawakal, (Al-Anfal:2) Fakta juga mendukung hal itu. Sesungguhnya iman itu adalah perkataan hati dan lisan juga anggota badan. Sementara itu, kaum Mukminin bertigkat-tingkat dalam masalah ini dengan perbedaan yang tajam. FirmanNya, “Dan amal-amal shalih yang kekal itu,” yaitu amal shalih yang lestari, yang tidak terputus pada saat amalan yang lain putus, dan yang tidak pudar, itulah amalan shalih. Di antaranya, shalat, zakat, puasa, haji, umrah, membaca al-Quran, tasbih, tahmid, tahlil, takbir, berbuat baik kepada sesame makhluk, amal hati dan jasmani. Amal-amal ini “lebih baik pahalanya di sisi Rabbmu dan lebih baik akhhirnya,” maksudnya lebih baik pahala dan ganjarannya di sisi Allah, dan lebih banyak manfaat dan balasannya bagi si pelaku. Ungkapan di atas termasuk penggunaan isim tafdhil (bentuk superlative) yang bukan pada tempatnya. Karena, tidak ada amalan yang bermanfaat selain amal shalih, pahalanya tidak lestari bagi pemiliknya lagi tidak berguna. Aspek relevansi mengapa Allah menyebutkan amal-amal shalih yang kekal –wallahu a’lam- (dengan ayat sebelumnya) adalah bahwa setelah Allah menyebutkan kisah orang-orang zhalim yang menjadikan taraf kondisi dunia berupa kekayaan dan anak, dan kedudukan yang baik sebagai petunjuk kemuliaan pemiliknya (di akhirat), maka Allah ingin memberitahukan di sini (dalam ayat ini) bahwa persoalannya tidak sebagaimana yang mereka sangka. Akan tetapi, amalan yang menjadi pertanda kebahagiaan dan penebar keberuntungan adalah segala sesuatu yang disukai dan diridhai oleh Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 76: Setelah Allah Subhaanahu wa Ta'aala menyebutkan, bahwa orang-orang yang zalim ditambah kesesatannya oleh-Nya, maka Dia menyebutkan bahwa orang-orang yang mendapat petunjuk ditambah lagi hidayahnya karena karunia dan rahmat-Nya kepada mereka. Hidayah di sini mencakup ilmu yang bermanfaat dan amal yang saleh. Oleh karena itu, setiap orang yang menempuh suatu jalan di dalam lingkaran ilmu, iman dan amal saleh, maka Allah akan menambahnya, memudahkannya dan menambah hal lain untuknya yang tidak termasuk usahanya. Dalam ayat ini terdapat dalil bahwa iman dapat bertambah dan berkurang. Di samping itu, kenyataan pun menunjukkan demikian, karena iman adalah ucapan hati dan lisan, serta amalan hati, lisan dan anggota badan, dan kaum mukmin dalam hal ini ternyata berbeda-beda. Yaitu ketaatan atau amal saleh, seperti shalat, zakat, puasa, haji, umrah, membaca Al Qur’an, sedekah, dzikrullah, berbuat ihsan kepada makhluk, dsb. Ayat ini membantah orang-orang zalim yang menjadikan keadaan dunia berupa harta dan anak yang banyak sebagai ukuran baiknya keadaan pemiliknya, bahkan ukuran kebahagiaan dan keberuntungan itu terletak pada iman dan amal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 76",
    "description": "Dan berbanding terbalik dengan kondisi orang kafir, bagi orang yang beriman dan meyakini keagungan-Nya, Allah akan terus menambah petunjuk kepada mereka yang telah mendapat petunjuk sehingga mereka semakin taat dan tekun berbuat baik. Dan amal kebajikan yang kekal itu tentu lebih baik pahalanya di sisi tuhanmu dan lebih baik pula kesudahannya bagi mereka yang mengerjakannya. 77. Uraian tentang sikap orang yang mengingkari hari kebangkitan dilanjutkan dengan tanggapan atas keingkaran mereka. Wahai nabi Muhammad, lalu apakah engkau telah melihat sikap dan jawaban orang yang mengingkari ayat-ayat kami karena lebih memilih persoalan duniawi sehingga mengingkari hari kebangkitan, dan dia dengan angkuh mengatakan, 'pasti aku akan diberi harta yang banyak untuk memenuhi semua keperluan dan anak yang aku banggakan dan akan menolongku dari semua persoalan. '."
  }
]