[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah engkau telah mengetahui (wahai rasul) tahu dan merasa aneh terhadap orang kafir ini (al-ash bin wa’il) dan orang-orang yang serupa dengannya? sebab, dia telah kafir terhadap ayat-ayat Allah dan mendustakannya serta berkata, ”aku benar-benar diberi di akhirat kelak berupa harta kekayaan dan anak-anak. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Lalu apakah engkau -wahai Rasul- telah melihat orang yang kafir kepada bukti kebenaran Kami, dan ingkar terhadap ancaman Kami sembari mengatakan, \"Jika aku mati, dan dibangkitkan maka pasti aku akan diberikan harta dan anak-anak yang banyak.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77-80. Apakah kamu tidak heran dari kedustaan orang kafir dan sesat yang bernama al’Ash bin Wail as-Sahmy yang mengumpulkan keingkaran terhadap ayat-ayat Allah dan kedustaan terhadap-Nya dengan berkata bahwa dia pasti akan diberi harta dan keturunan di akhirat kelak. Maka Allah menegur dan mengoloknya: “Apakah dia telah melihat ilmu ghaib yang hanya diketahui oleh Allah Yang Maha Mengetahui hal ghaib, dan dia melihat harta dan keturunannya? Atau Allah telah menjanjikan itu baginya? Sungguh itu semua tidak benar; perkataannya itu akan disimpan dan dia akan diberi perhitungan atas kedustaan tersebut sehingga azabnya akan ditambah dengan tambahan yang banyak, dan Kami akan mewarisi harta dan keturunannya setelah dia binasa, sedangkan dia akan mendatangi Kami pada hari kiamat dalam keadaan sendirian.” Syeikh as-Syinqithi berkata: Pendapat yang paling kuat menurutku tentang makna kata \"عهدا\" dalam firman Allah (أم اتخذ عند الرحمن عهدا) yakni, apakah Allah telah berjanji kepadanya bahwa Dia akan melakukan hal itu untuknya. Hal ini dengan dalil dalam firman Allah yang serupa dengan ini: قُلْ أَتَّخَذْتُمْ عِندَ ٱللَّهِ عَهْدًا فَلَن يُخْلِفَ ٱللَّهُ عَهْدَهُۥٓ Katakanlah: \"Sudahkah kamu menerima janji dari Allah sehingga Allah tidak akan memungkiri janji-Nya. (al-Baqarah: 80)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. أَفَرَءَيْتَ الَّذِى كَفَرَ بِـَٔايٰتِنَا (Maka apakah kamu telah melihat orang yang kafir kepada ayat-ayat Kami) Yakni apakah kamu ingin Aku ceritakan kepadamu kisah orang kafir yang berkata “Pasti aku akan diberi harta dan anak.” لَأُوتَيَنَّ مَالًا وَوَلَدًا (Pasti aku akan diberi harta dan anak) Imam Bukhari, Imam Muslim, dan yang lainnya mengeluarkan hadits dari Khabbab bin al-Aratt, ia berkata: dahulu aku adalah seorang pandai besi, dan aku memiliki piutang pada ‘Ash bin Wa’il, maka aku mendatanginya untuk menagihnya. Namun dia menjawab: “aku tidak akan membayarnya sampai kamu kafir terhadap Muhammad.” Maka aku berkata: “Demi Allah, aku tidak akan kafir terhadap Muhammad sampai kamu mati dan dibangkitkan.” Lalu dia berkata: “sungguh jika aku mati kemudian dibangkitkan maka datanglah kepadaku karena aku pasti memiliki harta dan anak dan aku akan memberinya kepadamu.” Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Ceritakanlah kisah tentang orang kafir ini yaitu Ash bin Wail yang mengingkari hari kebangkitan, dia berkata dengan maksud mengolok: “Jika aku memang akan dibangkitkan seperti perkataan Muhammad, maka pasti aku akan diberi harta dan anak yang banyak sehingga tidak ada yang membuatku khawatir sedikitpun. Ayat ini diturunkan untuk Ash bin Wail yang didatangi Khabbab bin Arat yang menggugatnya tentang agama, lalu menolaknya dan berkata: \"Sesungguhnya aku ketika mati lalu dibangkitkan, datanglah kepadaku, dan bagiku harta benda dan anak, maka aku akan memberimu hal itu\" Kemudian Allah SWT menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu apakah kamu melihat} apakah kamu mengetahui {orang yang ingkar terhadap ayat-ayat Kami dan berkata,“Sungguh aku akan diberi} sungguh aku akan di beri di akhirat {harta dan anak”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Maksudnya, tidakkah engkau heran terhadap kondisi orang kafir ini, yang menggabungkan antara kekufurannya terhadap ayat Allah dan pengakuannya bahwa dia akan diberikan harta dan anak di akhirat kelak? Maksudnya, dia menjadi penghuni surga. Ini termasuk hal yang sangat aneh. Kalaulah dia seorang yang beriman kepada Allah kemudian melontarkan pengakuan ini, tentulah masih bisa diterima. Ayat ini, meskipun turun berkaitan dengan orang kafir tertentu, namun mencakup semua orang kafir yang menyangka bahwa dirinya di atas kebenaran dan termasuk penduduk surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 77: Imam Bukhari meriwayatkan dengan sanadnya dari Muhammad bin Katsir yang sampai kepada Khabbab, ia berkata, “Aku seorang tukang besi di Mekah, lalu aku membuatkan pedang untuk Al ‘Ashiy bin Wa’il As Sahmiy, kemudian aku datang untuk menagih hutangnya. Al ‘Ashiy berkata, “Aku tidak akan memberimu (bayarannya) sampai kamu kafir kepada Muhammad.” Aku menjawab, “Aku tidak akan kafir kepada Muhammad shallallahu 'alaihi wa sallam sampai Allah mewafatkan kamu, lalu menghidupkan kamu.” Ia berkata, “Apabila Allah mewafatkan aku kemudian membangkitkanku, maka aku akan memiliki harta dan anak (sehingga aku akan membayar hutangku).” Maka Allah Subhaanahu wa Ta'aala menurunkan ayat, “Lalu apakah engkau telah melihat orang yang mengingkari ayat-ayat Kami dan dia mengatakan, \"Pasti aku akan diberi harta dan anak.-- Adakah dia melihat yang gaib atau dia telah membuat perjanjian di sisi Tuhan Yang Maha Pengasih?” Imam Bukhari juga meriwayatkan dengan sanadnya dari Umar bin Hafsh yang sampai kepada Khabbab, di sana disebutkan bahwa Al ‘Ashiy bin Wa’il berkata, “Apakah aku akan mati lalu dibangkitkan?” Aku (Khabbab) berkata, “Ya.” Khabbab berkata, “Kalau begitu, di sana aku akan memiliki harta dan anak, lalu aku akan membayar hutangmu.” Maka Allah Ta’ala menurunnkan ayat, “Lalu apakah engkau telah melihat orang yang mengingkari ayat-ayat Kami dan dia mengatakan, \"Pasti aku akan diberi harta dan anak.” Yakni termasuk orang yang bahagia atau masuk surga. Sungguh aneh sekali keadaan orang kafir, sudah di dunianya mengingkari ayat-ayat Allah, namun menyangka bahwa dirinya akan diberikan kesenangan oleh-Nya. Kalau sangkaan ini muncul dari orang yang beriman dan taat kepada Allah, maka masalahnya ringan. Tetapi ternyata sangkaan ini muncul dari orang yang kafir. Ayat ini meskipun turun berkenaan dengan orang kafir tertentu, tetapi sesungguhnya mengena pula kepada setiap orang kafir yang menyangka bahwa dia berada di atas kebenaran, dan bahwa setelah mati dia akan mendapatkan kebahagiaan. Allah membantah sangkaan mereka dengan firman-Nya pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 77",
    "description": "Uraian tentang sikap orang yang mengingkari hari kebangkitan dilanjutkan dengan tanggapan atas keingkaran mereka. Wahai nabi Muhammad, lalu apakah engkau telah melihat sikap dan jawaban orang yang mengingkari ayat-ayat kami karena lebih memilih persoalan duniawi sehingga mengingkari hari kebangkitan, dan dia dengan angkuh mengatakan, 'pasti aku akan diberi harta yang banyak untuk memenuhi semua keperluan dan anak yang aku banggakan dan akan menolongku dari semua persoalan. '78. Keangkuhan mereka direspons dengan pertanyaan berikut. Adakah dia, yaitu orang kafir, melihat yang gaib sehingga dapat berkata demikian atau dia telah membuat perjanjian di sisi tuhan yang maha pengasih sehingga dia dapat memastikan kebenaran perkataannya'."
  }
]