[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah dia memang telah mengetahui perkara ghaib, sehingga dia bisa tahu bahwa dirinya akan memiliki harta kekayaan dan anak-anak, atau kah dia telah memiliki janji di sisi Allah untuk mendapatkan itu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Apakah ia benar-benar mengetahui perkara gaib sehingga menyatakan hal itu dengan bukti yang jelas?! Atau apakah ia telah membuat perjanjian di sisi Tuhannya agar ia pasti akan dimasukkan ke dalam Surga dan dikaruniakan harta dan anak-anak?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. أَطَّلَعَ الْغَيْبَ (Adakah ia melihat yang ghaib) Sehingga dia mengetahui dia akan masuk surga? أَمِ اتَّخَذَ عِندَ الرَّحْمٰنِ عَهْدًا(atau ia telah membuat perjanjian di sisi Tuhan Yang Maha Pemurah?) Atau dia telah berkata “Laa ilaaha illa Allah” sehingga Aku akan merahmatinya? Atau dia telah beramal shaleh sehingga dia mengharapkan balasannya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Adakah ia melihat yang ghaib atau ia telah membuat perjanjian di sisi Tuhan Yang Maha Pemurah?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah dia melihat} apakah dia mengetahui {yang gaib ataukah telah membuat perjanjian di sisi Tuhan Yang Maha Pengasih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Maka Allah berfirman untuk mencelanya dan menyatakan kedustaannya, “Adakah dia telah melihat yang ghaib,” maksudnya apakah ilmunya melingkupi hal-hal yang ghaib, sehingga dia dapat mengetahui peristiwa yang akan terjadi, dan bahwa termasuk dalam lingkup yang akan terjadi yaitu dia akan diberikan kekayaan dan anak pada Hari KIamat. “Atau dia telah membuat perjanjian di sisi Rabb Yang Maha Pemurah,” bahwasanya dia akan memperoleh sesuatu yang diucapkan itu. Pengertiannya, tidak ada sedikit pun yang nyata. Maka dapat diketahui bahwa dia telah mengada-adakan kebohongan, berbicara tentang sesuatu yang tidak dia ketahui. Klasifikasi dan pengulangan ini merupakan bentuk konsekuensi logis dan penegakkan hujjah yang benar-benar tegas. Sesungguhnya orang yang mengaku bahwa dia akan mendapatkan kebaikan di akhirat di sisi Allah, maka dia tidak lepas dari dua keadaan: Pertama, perkataannya itu bersumber dari pengetahuan tentang hal-hal ghaib di masa yang akan datang. Dan perkara ini sudah diketahui, bahwa ini hanya milik Allah semata, tidak ada seorang pun yang mengetahui perkara ghaib di masa yang akan datang, kecuali peristiwa yang diperlihatkan oleh Allah kepada para RasulNya. Kedua, sang pengucap adalah orang yang sudah membuat perjanjian dengan Allah, dengan beriman kepadaNya dan mengikuti para rasulNya, yang sudah dijanjikan oleh Allah bagi para pelakunya, dan Dia menetapkan bahwa mereka adalah para penduduk akhirat, yang selamat dan berunntung. Jika kedua hal ini tidak ada (pada orang kafir itu), maka dapat diketahui kepalsuan pengakuan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 78: Sehingga dia mengetahui, bahwa keadaannya nanti setelah mati akan bahagia atau mendapatkan harta dan anak. Bahwa Dia akan memberikan apa yang diucapakannya itu. Ternyata, ia tidak mengetahui yang gaib, dan tidak membuat perjanjian dengan Allah karena kafir kepada-Nya dan tidak beriman, bahkan ia akan mendapatkan sebaliknya dan ucapannya dicatat untuk diberi balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 78",
    "description": "Keangkuhan mereka direspons dengan pertanyaan berikut. Adakah dia, yaitu orang kafir, melihat yang gaib sehingga dapat berkata demikian atau dia telah membuat perjanjian di sisi tuhan yang maha pengasih sehingga dia dapat memastikan kebenaran perkataannya'79-80. Sama sekali tidak! dia tidak mengetahui hal gaib, apalagi membuat perjanjian dengan Allah. Jika dia tidak menghentikan kebohongannya, kami akan menulis dan meminta pertanggungjawaban atas apa yang dia katakan dan kami akan memperpanjang azab untuknya secara sempurna sampai batas tertentu, dan kami akan mewarisi serta membinasakan apa yang dia katakan dan banggakan itu, berupa harta dan keturunan, dan dia akan datang kepada kami seorang diri setelah kematiannya tanpa ditemani harta atau anaknya."
  }
]