[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Persoalannya tidak seperti yang disangka oleh orang kafir tersebut, dia tidak punya pengetahuan dan perjanjian disinya, Kami akan mencatat apa saja yang dikatakan oleh orang yang berbohong dan mengada-adakan terhadap kedustaan terhada Allah. Dan kami akan menambahinya di akhirat dengan berbagai macam siksaan, sebagaimana dia telah terus menerus bertambah melenceng dan sesat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Hal itu sama sekali tidak seperti yang mereka klaim! Kami akan menuliskan apa yang ia katakan dan amalkan, lalu Kami akan menambah azabnya disamping azab yang mesti ia dapatkan, lantaran klaimnya yang batil itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. كَلَّا ۚ سَنَكْتُبُ مَا يَقُولُ (sekali-kali tidak, Kami akan menulis apa yang ia katakan) Yakni kenyataanya tidak seperti yang dia katakan, namun Kami akan menulis apa yang telah dia katakan, kemudian Kami akan membalasnya di akhirat. وَنَمُدُّ لَهُۥ مِنَ الْعَذَابِ مَدًّا(dan benar-benar Kami akan memperpanjang azab untuknya) Yakni menambahkan azab di atas azab yang telah dia dapatkan sebagai balasan atas perkataannya itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Sekali-kali tidak seperti apa yang dia katakan, sesungguhnya dia telah keliru dalam menggambarkan dirinya sendiri, dia tidak akan diberikan semacam itu. Kami akan menulis apa yang ia katakan, dan benar-benar Kami akan memperpanjang azab untuknya atas kekufuran dan olokannya kepada hukum Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sama sekali tidak} Itu tidak seperti yang dia anggapkan {Kami akan menulis apa yang dia katakan dan Kami akan memperpanjang untuknya} menambahkan untuknya {azab secara sempurna} dengan tambahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Oleh karenanya, Allah berfirman, “Sekali-kali tidak,” maksudnya, faktanya tidak seperti yang mereka sangka. Orang yang mengucapkan hal itu tidak memiliki ilmu tentang perkara-perkara yang ghaib. Karena dia orang kafir yang tidak memiliki ilmu risalah-risalah (para rasul). Dan dia (pun) tidak membuat janji dengan Allah karena kekufurannya dan ketiadaan imannya. Bahkan dia pasti menerima keadaan yang sebaliknya dari apa yang diucapkannya itu. Dan ucapannya itu ditulis dan dijaga agar mendapatkan balasan dan dihukum atas dasar itu. Karenanya, Allah berfirman, “Kami akan menulis apa yang dia katakan, dan benar-benar Kami akan memperpanjang azab untuknya,” maksudnya Kami akan menambah berbagai jenis azab, sebagaimana kian bertambahnya kekeliruan dan kesesatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 79: Allah tidak akan memberikan kepadanya, atau keadaannya tidak seperti yang disangkanya. Allah akan menambah azab di atas azab terhadap kekafirannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 79",
    "description": "79-80. Sama sekali tidak! dia tidak mengetahui hal gaib, apalagi membuat perjanjian dengan Allah. Jika dia tidak menghentikan kebohongannya, kami akan menulis dan meminta pertanggungjawaban atas apa yang dia katakan dan kami akan memperpanjang azab untuknya secara sempurna sampai batas tertentu, dan kami akan mewarisi serta membinasakan apa yang dia katakan dan banggakan itu, berupa harta dan keturunan, dan dia akan datang kepada kami seorang diri setelah kematiannya tanpa ditemani harta atau anaknya"
  }
]