[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Zakaria berkata dengan penuh keheranan, ”wahai tuhanku, bagaimana bisa aku memiliki anak lelaki, sedang istriku adalah seorang wanita yang mandul yang tidak bisa melahirkan, dan aku sendiri telah mencapai batas akhir dalam usia dan tulangku pun sudah rapuh?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dengan penuh takjub akan kekuasaan Allah, Zakariya berkata, \"Bagaimana bisa aku memiliki seorang anak sedangkan istriku mandul tak bisa melahirkan, dan aku sendiri telah mencapai usia yang sangat tua dan tulang-tulangku telah rapuh?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Zakariya berkata dengan penuh kegembiraan dan keheranan: “Ya Tuhanku, bagaimana aku dapat memiliki seorang anak, sedangkan istriku tidak dapat melahirkan dan aku telah pencapai usia renta?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. قَالَ رَبِّ أَنَّىٰ يَكُونُ لِى غُلٰمٌ (Zakaria berkata: “Ya Tuhanku, bagaimana akan ada anak bagiku) Ini merupakan rasa takjub dari kuasa Allah dan keajaiban ciptaan-Nya, yang menciptakan seorang anak dari istri yang mandul dan suami yang telah lanjut usia. وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا (dan aku (sendiri) sesungguhnya sudah mencapai umur yang sangat tua) Yakni yang telah mencapai umur yang lanjut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Zakaria berkata: \"Ya Tuhanku, bagaimana caranya akan ada anak bagiku, padahal isteriku adalah seorang yang mandul dan aku sendiri sesungguhnya sudah mencapai umur yang sangat tua\". Pertanyaan ini atas dasar keadaan yang ada, bukan atas dasar menyepelekan kekuasaan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Wahai Tuhanku, bagaimana} bagaimana {aku akan mempunyai anak, sedangkan istriku adalah seorang yang mandul dan aku sudah mencapai usia yang sangat tua”} ujung usia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Ketika itu, saat Nabi Zakaria menerima kabar gembira kelahiran anak ini yang dimintanya, maka beliau justru merasa aneh dan keheranan. Beliau mengatakan, “Ya Rabbku, bagaimana (mungkin) akan ada anak bagiku,” sementara kondisinya bahwa faktor penghalang untuk mendapatkan anak, ada pada diri saya dan istri saya? Seakan-akan pada saat berdoa, beliau tidak menyadari keberadan faktor penghalang ini, lantaran keinginan kuat di hatinya serta dahsyatnya hasrat yang besar untuk mendapatkan anak. Dalam kondisi seperti ini, saat doanya dikabulkan, maka beliau merasa keheranan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 8",
    "description": "Mendengar berita gembira itu nabi zakaria heran dan bertanya pada diri sendiri tentang kemungkinannya. Dia berkata, 'ya tuhanku yang maha pemurah, bagaimana mungkin aku akan bisa mempunyai anak seperti yang engkau beritakan, padahal istriku sejak masa mudanya dahulu adalah seorang yang mandul dan aku sendiri sesungguhnya sudah mencapai usia yang sangat tua yang pada lazimnya tidak mungkin memperoleh anak lagi''9. Menjawab keheranan zakaria, Allah berfirman, 'demikianlah. Benar bahwa engkau telah lanjut usia dan istrimu mandul. ' memastikan kehendak-Nya, tuhanmu berfirman, 'wahai zakaria, sungguh hal itu, yaitu memberimu anak dalam kondisimu yang seperti itu, adalah hal mudah bagi-ku sebagaimana aku menciptakan manusia dalam keadaan normalnya. Sungguh, engkau tidak perlu heran karena engkau telah aku ciptakan sebelum itu, padahal pada waktu itu engkau sama sekali belum berwujud sebagai apa pun. '."
  }
]