[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami akan mewarisi harta dan anaknya, dan dia akan datang kepada Kami pada hari kiamat sendirian saja, tanpa membawa harta kekayaan dan anak-anak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Dan Kami akan mewarisi apa yang ia tinggalkan berupa harta dan anak setelah Kami mewafatkannya, lalu ia mendatangi Kami hari Kiamat kelak dalam keadaan seorang diri tanpa memiliki suatu harta atau pangkat kedudukan yang dahulu ia nikmati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَنَرِثُهُۥ مَا يَقُولُ (dan Kami akan mewarisi apa yang ia katakan itu) Yakni Kami akan mematikannya sehingga Kami dapat mewarisinya harta dan anak sebagaimana yang dia katakan. وَيَأْتِينَا فَرْدًا(dan ia akan datang kepada Kami dengan seorang diri) Yakni di hari kiamat dia tidak memiliki harta dan anak karena Kami akan mengambil itu darinya. Lalu untuk apa dia begitu berharap agar Kami memberinya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Kami akan mewarisi apa yang ia katakan itu berupa harta dan anak, dan ia akan datang kepada Kami seorang diri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami akan mewarisi apa yang dia katakan} dengan kematiannya Kami merenggut apa yang telah Kami berikan di dunia berupa harta dan anak {dan dia datang kepada Kami} dia datang kepada Kami pada hari kiamat {seorang diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “Dan Kami akan mewarisi sesuatu yang dia katakan itu,” maksudnya Kami mewarisi harta dan anak, sehingga dia keluar dari dunia seorang diri, tanpa harta, keluarga, tanpa pembela dan tanpa penolong “dan dia akan datang kepada Kami seorang diri,” maka dia menyaksikan keburukan azab, yang merupakan balasan bagi orang-orang semacamnya dari kalangan orang-orang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 80: Maksudnya, Allah akan mengambil kembali harta dan anak orang kafir tersebut sehingga ia menemui-Nya seorang diri saja, di mana sebelumnya ia menyangka akan mendapat harta dan anak. Lalu yang ia lihat di hadapannya adalah azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 80",
    "description": "79-80. Sama sekali tidak! dia tidak mengetahui hal gaib, apalagi membuat perjanjian dengan Allah. Jika dia tidak menghentikan kebohongannya, kami akan menulis dan meminta pertanggungjawaban atas apa yang dia katakan dan kami akan memperpanjang azab untuknya secara sempurna sampai batas tertentu, dan kami akan mewarisi serta membinasakan apa yang dia katakan dan banggakan itu, berupa harta dan keturunan, dan dia akan datang kepada kami seorang diri setelah kematiannya tanpa ditemani harta atau anaknya. 81. Orang kafir akan dibangkitkan dalam keadaan hina dan sendiri. Mereka kecewa pada sesembahannya. Dan mereka telah memilih tuhantuhan selain Allah sebagai sesembahan. Mereka berharap agar tuhantuhan itu menjadi pelindung dan penolong bagi mereka kelak di akhirat dari azab Allah."
  }
]