[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakah kamu (wahai rasul) melihat bahwa sesungguhnya Kami menguasakan setan-setan yang kafir kepada Allah dan rasulNya untuk menyesatkan mereka dan menjauhkan mereka dari ketaatan menuju maksiat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Tidakkah engkau -wahai Rasul- melihat bahwa Kami telah mengutus setan-setan itu dan memberikan mereka kekuasaan atas orang-orang kafir, agar mendorong mereka berbuat maksiat, dan menghalangi manusia dari jalan Allah dengan penuh kesungguhan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83-84. Hai Rasulullah, tidakkah kamu mengetahui Kami menjadikan setan-setan mengusai orang-orang kafir dengan menggoda mereka untuk melakukan kemaksiatan? Maka janganlah terburu-buru meminta kebinasaan mereka, karena tidak tersisa bagi mereka melainkan beberapa hari yang Kami hitung dengan teliti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. أَلَمْ تَرَ أَنَّآ أَرْسَلْنَا الشَّيٰطِينَ عَلَى الْكٰفِرِينَ (Tidakkah kamu lihat, bahwasanya Kami telah mengirim syaitan-syaitan itu kepada orang-orang kafir) Yakni Kami biarkan setan-setan itu mengusai orang-orang kafir. تَؤُزُّهُمْ أَزًّا(untuk menghasung mereka berbuat maksiat dengan sungguh-sungguh?) Yakni menggerakkan orang-orang kafir untuk berbuat kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Tidakkah kamu lihat, bahwasanya Kami telah mengirim syaitan-syaitan itu kepada orang-orang kafir untuk menghasud mereka berbuat maksiat dengan sungguh-sungguh?,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidakkah kamu memperhatikan bahwa Kami telah mengutus} Kami telah memberi kuasa {setan-setan kepada orang-orang kafir untuk benar-benar menggoda mereka} menghasut mereka untuk berbuat maksiat dengan sungguh-sungguh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Ini merupakan salah satu azab buat orang kafir. Yaitu, tatkala mereka tidak beriman kepada Allah dan tidak berpegang teguh dengan tali Allah, justru menyekutukan sesuatu dengan Allah dan berwala’ (setia) kepada musuh-musuhNya, dari kalangan setan; Allah memberikan kekuasaan kepada setan atas mereka dan memasung mereka. Maka mulailah setan-setan mendorong mereka dengan sungguh-sungguh untuk melakukan perbuatan maksiat. Maksudnya, benar-benar memprovokasi dan membuat gelisah mereka kepada perbuatan kufur. Setan menghembuskan bisikan-bisikan kepada mereka, mengkondisikan kebatilan dalam rupa yang indah dalam pandangan mereka dan memburukkan (potret) kebenaran pada mata mereka. Sehingga kecintaan kepada kebatilan menembus dan meresap dalam hatinya. Akibatnya, dia pun berusaha untuk meraihnya sebagaimana seorang pemilik hak berusaha meraih haknya, membelanya dengan segenap kemampuanyya dan memerangi orang-orang yang berada di atas al-Haq dalam rangka kebatilan. Ini semua adalah balasan baginya, karena dia berpaling dari walinya (Allah) dan loyal kepada musuhNya (setan), dampaknya Allah memberikan kekuasaan kepada setan terhadapnya. Kalau tidak demikian keadaannya, seandainya dia (mau) beriman kepada Allah dan bertawakal kepadaNya, niscaya setan tidak memiliki kekuasaan sedikit pun atas dirinya. Sebagaimana Allah berfirman, \"Sesungguhnya setan ini tidak ada kekuasaannya atas orang-orang yang beriman dan bertawakal kepada Tuhannya. Sesungguhnya kekuasaannya (setan) hanyalah atas orang-orang yang mengambilnya jadi pemimpin dan atas orang-orang yang mempersekutukannya dengan Allah.\" (An-Nahl:99-100)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 83: Ayat ini termasuk hukuman-Nya terhadap orang-orang kafir, yaitu karena mereka tidak berpegang dengan tali (agama) Allah, bahkan mereka menyekutukan-Nya dan mengambil setan sebagai walinya, maka Allah memberikan kekuasaan kepada setan untuk membawa mereka (orang-orang kafir) ke mana saja yang mereka inginkan. Setan-setan itu membisikkan dan mengajak mereka kepada maksiat, menghias kebatilan untuk mereka dan memperburuk yang benar, sehingga mereka mencintai yang batil dan kebatilan itu meresap di hati mereka. Oleh karenanya, mereka berani membela yang batil dan berperang karenanya. Itulah balasan karena tidak berpegang dengan agama Allah. Kalau sekiranya ia beriman kepada Allah dan bertawakkal kepada-Nya, maka setan tidak akan berkuasa terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 83",
    "description": "Wahai nabi Muhammad, tidakkah engkau melihat bahwa sesungguhnya kami telah mengutus setan-setan itu kepada orang-orang kafir yang selalu ingkar dan engggan bertobat untuk mendorong mereka berbuat maksiat dengan sungguh-sungguh sehingga mereka semakin terperosok dalam kesesatannya'84. Wahai nabi, apa yang terjadi merupakan ketetapan Allah, maka janganlah engkau gelisah dengan sikap mereka sehingga engkau tergesagesa meminta jatuhnya azab terhadap mereka, karena sesungguhnya kami membiarkan mereka dalam keadaan ini sampai waktu tertentu. Kami lakukan hal itu agar kami terus menghitung dosa-dosa dan penyimpangan mereka dengan hitungan teliti sampai datangnya hari siksaan diakhirat untuk mereka."
  }
]