[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka janganlah kamu (wahai rosul) tergesa-gesa meminta diturunkannya siksaan atas orang-orang kafir tersebut. Sebab sesungguhnya kami telah menghitung umur dan amal perbuatan mereka dengan perhitungan yang tidak ada unsur keteledoran dan penundaan di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Maka janganlah engkau -wahai Rasul- tergesa-gesa memohon kepada Allah agar menyegerakan datangnya kebinasaan pada mereka, karena Kami menghitung usia kehidupan mereka dengan hitungan yang detail, sehingga apabila waktu dibiarkannya mereka telah selesai Kami lalu mengazab mereka dengan azab yang pantas mereka dapatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. فَلَا تَعْجَلْ عَلَيْهِمْ ۖ (maka janganlah kamu tergesa-gesa terhadap mereka) Dengan meminta Allah agar segera membinasakan mereka akibat kebebalan mereka dalam kekafiran. إِنَّمَا نَعُدُّ لَهُمْ عَدًّا (karena sesungguhnya Kami hanya menghitung datangnya (hari siksaan) untuk mereka dengan perhitungan yang teliti) Yakni Kami menghitung siang, malam, bulan, dan tahun dari usia mereka sampai datangnya ajal mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Al-Imam Hasan Al-Bashri menasihatkan, “Bergegaslah! Bergegaslah! Sungguh, apabila napas sudah berhenti, niscaya akan terhenti pula amal-amal yang ingin kalian lakukan untuk mendekatkan diri kepada Zat yang Maha-agung, Semoga Allah Ta’ala berkenan merahmati seseorang yang mau memikirkan dirinya sendiri dan menangisi sebanyak dosa-dosanya, kemudian beliau membacakan ayat : { إِنَّمَا نَعُدُّ لَهُمْ عَدًّا } \"karena sesungguhnya Kami hanya menghitung datangnya (hari siksaan) untuk mereka dengan perhitungan yang teliti\" yakni : nafas mereka telah diperhitungkan waktunya untuk berhenti. 2 ). Sebagian orang mempermasalahkan nasib orang-orang atheis dan mereka yag tidak bertuhan bahwasanya Allah membiarkan mereka dan tidak menjatuhkan hukuman kepada mereka, maka dijawab bahwa Allah -تعالى- lebih mengetahui keadaan mereka kedepannya dan sesungguhnya hikmah dibalik itu telah Allah tentukan, diantaranya agar dosa-dosa mereka terus bertambah; sehingga azab yang mereka terima diakhirat lebih besar, Allah berfirman : { فَلَا تَعْجَلْ عَلَيْهِمْ ۖ إِنَّمَا نَعُدُّ لَهُمْ عَدًّا } \"Maka janganlah kamu tergesa-gesa memintakan siksa terhadap mereka, karena sesungguhnya Kami hanya menghitung datangnya (hari siksaan) untuk mereka dengan perhitungan yang teliti.\" Allah juga berfirman : { إِنَّمَا نُمْلِى لَهُمْ لِيَزْدَادُوٓا۟ إِثْمًا ۚ وَلَهُمْ عَذَابٌ مُّهِينٌ } \"Sesungguhnya Kami memberi tangguh kepada mereka hanyalah supaya bertambah-tambah dosa mereka; dan bagi mereka azab yang menghinakan\" [ Ali 'Imran : 178 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Maka janganlah kamu tergesa-gesa memintakan siksa terhadap mereka, karena sesungguhnya Kami hanya menghitung datangnya hari siksaan untuk mereka dengan perhitungan yang teliti. Dan Kami tetap membiarkan mereka hidup agar dosa mereka bertambah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka janganlah tergesa-gesa terhadap mereka} untuk menghukum mereka {Sesungguhnya Kami hanyalah menghitung dengan sungguh-sungguh untuk mereka} Kami menghitung bermalam-malam, berhari-hari, berbulan-bulan, dan bertahun-tahun, ketika telah datang ajal yang ditentukan untuk itu, maka Kami akan membinasakan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. “Maka janganlah kamu tergesa-gesa (memintakan siksa) terhadap mereka,” yaitu siksa terhadap orang-orang kafir yang meminta disegerakan azab. “Karena sesungguhnya Kami hanya menghitung datangnya (hari siksaan) untuk mereka dengan perhitungan yang teliti,” maksudnya, mereka mendapatkan hari-hari yang telah ditentukan, tidak bisa diajukan dan tidak bisa ditunda. Kami menunda azab bagi mereka dan bersikap lunak untuk beberapa saat saja agar mereka (dapat) memperhatikan ayat-ayat Allah. Sampai etia tidak berfungsi lagi kesempatan itu buat merea, niscaya Kami akan menyiksa mereka dengan siksaan Dzat Yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 84: Di mana apabila sudah datang, maka mereka tidak bisa meminta penundaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 84",
    "description": "Wahai nabi, apa yang terjadi merupakan ketetapan Allah, maka janganlah engkau gelisah dengan sikap mereka sehingga engkau tergesagesa meminta jatuhnya azab terhadap mereka, karena sesungguhnya kami membiarkan mereka dalam keadaan ini sampai waktu tertentu. Kami lakukan hal itu agar kami terus menghitung dosa-dosa dan penyimpangan mereka dengan hitungan teliti sampai datangnya hari siksaan diakhirat untuk mereka. 85. Balasan Allah pasti akan terjadi. Wahai manusia, ingatlah pada hari ketika kami bersama para malaikat mengumpulkan orang-orang yang bertakwa kepada Allah yang maha pengasih dan membawa mereka ke tempat yang dijanjikan sebagai balasan atas ketaatan mereka. Kemudian kami sambut mereka bagaikan kafilah yang terhormat."
  }
]