[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "85-86. Pada hari Kami akan mengumpulkan orang-orang yang bertakwa kepada tuhan mereka yang penyayang kepada mereka sebagai rombongan utusan yang dimuliakan. Dan Kami mengiring kaum yang kafir kepada Allah dengan cara yang keras menuju neraka dalam keadaan berjalan lagi penuh kehausan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Ingatlah -wahai Rasul- tentang hari Kiamat, yaitu hari ketika Kami mengumpulkan orang-orang yang bertakwa -dengan mengerjakan perintah dan menjauhi larangan-Nya- di hadapan Tuhan mereka dalam kafilah-kafilah yang dimuliakan lagi terhormat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Pada hari kiamat Kami akan mengumpulkan kepada Allah orang-orang yang takut azab-Nya sehingga mereka mentaati segala perintah-Nya dan menjauhi segala larangan-Nya sebagai perutusan yang terhormat dengan menunggangi tunggangan. Dari Abu Hurairah dari Nabi, beliau bersabda: “Manusia dibangkitkan atas tiga kelompok, ada yang dalam keadaan senang ada pula yang merasa ketakutan. Ada dua orang yang menunggangi satu unta, ada tiga orang yang menunggangi satu unta, ada empat orang yang menunggangi satu unta bahkan ada sepuluh orang yang menunggangi satu unta; lalu sisanya digiring oleh api yang selalu menyertai mereka, api itu akan menyertai mereka ketika mereka tidur siang, ketika tidur malam, ketika mereka memasuki waktu pagi, dan ketika mereka memasuki waktu petang.” (Shahih al-Bukhari 11/377 no. 6522, kitab raqaiq, bab hari kebangkitan. Shahih Muslim 4/2195 no. 2861, kitab surga, bab kefanaan dunia dan penjelasan hari kebangkitan.. dan dalam riwayatnya memakai kata (راغبين راهبين) tanpa dipisahkan huruf و)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمٰنِ وَفْدًا (hari (ketika) Kami mengumpulkan orang-orang yang takwa kepada Tuhan Yang Maha Pemurah sebagai perutusan yang terhormat) Yakni utusan menuju surga dan negeri kesejahteraan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Ingatlah hari ketika Kami mengumpulkan orang-orang yang takwa kepada Tuhan Yang Maha Pemurah sebagai utusan yang terhormat yang menyeru kepada tempat yang penuh dengan karamah Yang Maha Pengasih yaitu surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hari (ketika) Kami mengumpulkan} mengumpulkan {orang-orang yang bertakwa (menghadap) kepada Dzat Yang Maha Pengasih sebagai utusan} dengan berkendara sebagai bangsawan yang keluar dari cahaya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. Allah memberitahukan tentang perbedaan mencolok antara dua kelompok pelaku maksiat. Sesungguhnya orang-orang yang bertakwa kepadaNya dengan sebab menghindari perbuatan syirik, bid’ah-bid’ah dan aneka macam maksiat, akan dihimpun oleh Allah pada Hari Kiamat dalam keadaan dimuliakan, terhormat lagi diagungkan. Dan tempat kembali mereka adalah ar-Rahman (Dzat Yang Maha Pemgasih), tujuan mereka adalah al-Mannan (Dzat Yang Maha Pemberi), sebagai delegasi kepadaNya. Dan seorang utusan, tentunya menyimpan harapan dalam hatinya dan persangkaan baik (optimisme) terhadap yang dituju, sesuatu hal yang sudah diketahui bersama. Orang-orang yang bertakwa mendatangi ar-Rahman (sebagai tamu), dengan mengharap rahmatNya dan curahan kebaikanNya yang merata, serta keberuntungan memperoleh berbagai macam karuniaNya di tempat keridhaanNya (surga). Hal ini lantaran mereka telah mempersembahkan amalna-amalan dengan penuh takwa dan mengikuti keridhaanNya. Dan Allah pun telah menjanjikan ganjaran ppahala buat mereka ini melalui lisan para rasulNya. (Di Hari KIamat) mereka berjalan menuju Rabb mereka dengan ketenangan dan penuh keyakinan (akan memperoleh) karuniaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 85: Mereka dikumpulkan ke mauqif (padang mahsyar) dalam keadaan dimuliakan sambil mengharap rahmat, ihsan dan pemberian-Nya sebagaimana halnya kafilah utusan (delegasi) yang dimuliakan. Yang demikian disebabkan ketakwaan yang mereka kerjakan dan mencari keridhaan-Nya, dan bahwa Allah telah menjanjikan pahala itu melalui lisan rasul-Nya, maka mereka dengan tenang datang menghadap Tuhan mereka lagi yakin dengan karunia-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 85",
    "description": "Balasan Allah pasti akan terjadi. Wahai manusia, ingatlah pada hari ketika kami bersama para malaikat mengumpulkan orang-orang yang bertakwa kepada Allah yang maha pengasih dan membawa mereka ke tempat yang dijanjikan sebagai balasan atas ketaatan mereka. Kemudian kami sambut mereka bagaikan kafilah yang terhormat. 86. Sebaliknya, orang yang ingkar akan kami kumpulkan bersama sejawat mereka, dan kami akan menggiring orang yang durhaka dan enggan bertobat ke neraka jahanam untuk menerima hukuman atas keingkarannya tanpa diberi minum sehingga kondisi yang panas menyebabkan mereka dalam keadaan dahaga."
  }
]