[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "85-86. Pada hari Kami akan mengumpulkan orang-orang yang bertakwa kepada tuhan mereka yang penyayang kepada mereka sebagai rombongan utusan yang dimuliakan. Dan Kami mengiring kaum yang kafir kepada Allah dengan cara yang keras menuju neraka dalam keadaan berjalan lagi penuh kehausan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Dan Kami akan menggiring orang-orang kafir ke neraka Jahanam dalam keadaan merasakan dahaga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86-87. Dan Kami akan menggiring orang-orang yang melakukan dosa-dosa besar ke neraka Jahannam dalam keadaan berjalan di atas wajah mereka dengan kehausan, tidak ada yang dapat memberi mereka syafaat; namun bagi orang yang mengakui keesaan Allah, dan risalah rasulullah dan mengamalkannya maka Allah telah menjanjikan baginya syafaat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَنَسُوقُ الْمُجْرِمِينَ (dan Kami akan menghalau orang-orang yang durhaka) Yakni Kami menggiring mereka. إِلَىٰ جَهَنَّمَ وِرْدًا (ke neraka Jahannam dalam keadaan dahaga) Seperti unta yang mendatangi air."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Kami akan menyeret orang-orang yang durhaka ke neraka Jahannam dalam keadaan dahaga dan terhina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Kami menggiring para orang-orang yang durhaka} orang-orang kafir {ke neraka Jahanam dalam keadaan dahaga} dalam keadaan haus, sungguh leher mereka telah terputus karena haus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Sedangkan orang-orang yang berbuat jahat digiring “ke dalam Neraka Jahanam dalam keadaan dahaga,” maksudnya merasakan kehausan. Ini merupakan keadaan mengenaskan (yang dialami seseorang), dihalau dalam keadaan hina dan rendah menuju penjara terbesar dan siksa yang paling buruk yaitu Neraka Jahanam. Dalam keadaan haus dan keletihan, mereka meminta tolong, namun tidak ditolong. Mereka memohon namun tidak dikabulkan. Mereka meminta syafa’at namun tidak diberi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 86: Mereka digiring secara menghinakan ke penjara yang paling besar dan hukuman yang paling hebat, yaitu neraka Jahanam dalam keadaan haus dan letih. Ketika mereka meminta pertolongan tidak diberi, ketika berdoa tidak diijabah dan ketika meminta syafaat tidak mendapatkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 86",
    "description": "Sebaliknya, orang yang ingkar akan kami kumpulkan bersama sejawat mereka, dan kami akan menggiring orang yang durhaka dan enggan bertobat ke neraka jahanam untuk menerima hukuman atas keingkarannya tanpa diberi minum sehingga kondisi yang panas menyebabkan mereka dalam keadaan dahaga. 87. Di akhirat mereka tidak berhak mendapat syafaat atau pertolongan dari siapa pun untuk selamat dari azab Allah, kecuali orang yang dengan sungguh-sungguh telah mengadakan perjanjian di sisi Allah yang maha pengasih dengan cara bertobat dan menaati ajaran-Nya."
  }
]