[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu tidak memiiliki hak memberi syafaat bagi siapapun. Hanyasanya Yang memilikinya adalah orang yang telah memiliki perjanjian dengan tuhan yang maha pengasih untuk memperolehnya, dan mereka adalah orang-orang yang beriman kepada Allah dan para rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Orang-orang kafir itu sama sekali tidak berhak mendapatkan dan memberikan syafaat satu sama lain, kecuali bagi mereka yang telah membuat perjanjian di sisi Tuhannya di dunia ini dengan beriman kepada-Nya dan kepada Rasul-rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. لَّا يَمْلِكُونَ الشَّفٰعَةَ إِلَّا مَنِ اتَّخَذَ عِندَ الرَّحْمٰنِ عَهْدًا (Mereka tidak berhak mendapat syafa’at kecuali orang yang telah mengadakan perjanjian di sisi Tuhan Yang Maha Pemurah) Yakni orang-orang bertakwa tidak mampu memberi syafaat bagi orang lain kecuali bagi orang yang pernah mengatakan Laa ilaaha illaa Allah dengan penuh keyakinan dan tidak menyekutukan Allah serta telah beramal shalih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Mereka tidak berhak mendapat syafa´at kecuali orang yang telah mengadakan perjanjian di sisi Tuhan Yang Maha Pemurah dengan mengesakannya dan mengimani rasul dan yang beramal sesuai apa yang diridhoi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Oleh karena itu Allah berfirman, “Mereka tidak berhak mendapat syafa’at,” maksudnya syafa’at bukanlah milik mereka, dan mereka pun tidak memiliki syafa’at sama sekali. Syafa’at itu hanya milik Allah, Katakanlah: \"Hanya kepunyaan Allah syafaat itu semuanya.\" (Az-Zumar:44). Allah telah memberitahukan bahwa syafa’at dari para pemberi syafa’at itu tidak akan bermanfaat bagi mereka. Pasalnya, mereka tidak pernah membuat perjanjian (ikatan) dengan Allah dengan cara beriman kepadaNya dan kepada para rasulNya. Kalau mereka tidak demikian, maka siapa saja yang sudah membuat perjanjian dengan Allah dengan cara beriman kepadaNya, para rasulNya, serta mengikuti mereka, niscaya mereka termasuk orang-orang yang diridhai Allah dan akan meraih syafa’at. Sebagaimana Allah berfirman, \"dan mereka tiada memberi syafaat melainkan kepada orang yang diridai Allah,\" (Al-Anbiya:28). Allah menamakan “iman kepada kepadaNya” dan “ mengikuti para rasulNya” sebagai perjanjian. Karena itu merupakan janji Allah (yang termaktub) dalam kitab-kitabNya (dan dijelaskan) lewat lisan para rasulNya, berupa ganjaran pahala yang indah bagi orang yang mengikuti para rasul itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 87: Maksud mengadakan perjanjian dengan Allah adalah menjalankan segala perintah Allah dengan beriman dan bertakwa kepada-Nya atau dengan bersyahadat Laailaahaillallah. Iman dan takwa disebut Allah sebagai perjanjian, karena Allah telah berjanji dalam kitab-kitab-Nya dan melalui lisan para rasul-Nya balasan yang baik bagi mereka yang beriman dan bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 87",
    "description": "Di akhirat mereka tidak berhak mendapat syafaat atau pertolongan dari siapa pun untuk selamat dari azab Allah, kecuali orang yang dengan sungguh-sungguh telah mengadakan perjanjian di sisi Allah yang maha pengasih dengan cara bertobat dan menaati ajaran-Nya. 88. Selain menampik kepercayaan kaum musyrik bahwa berhala dapat memberi syafaat, Allah juga menegasikan keyakinan mereka bahwa Allah memiliki anak. Dan mereka, kaum yahudi, nasrani, dan sebagian masyarakat arab, berkata, 'tuhan yang maha pengasih mempunyai anak, ' yaitu 'uzair dalam kepercayaan yahudi, isa dalam anggapan umat nasrani, dan malaikat dalam keyakinan sebagian masyarakat arab."
  }
]