[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir berkata, ”ar-rahman telah mengambil anak. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Dan orang-orang Yahudi, Nasrani, dan sebagian kaum musyrikin berkata, \"Allah Yang Maha Pengasih memiliki seorang anak laki-laki.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88-92. Orang-orang kafir dari kalangan Ahli kitab dan musyrikin berkata dengan penuh penentangan: “Allah mengangkat seorang anak”. Sungguh kalian telah mengucapkan perkataan yang sangat mungkar, hampir saja tujuh langit terpecah dan goncang akibat perkataan itu, dan hampir-hampir tujuh bumi terbelah dan gunung-gunung runtuh berjatuhan karena begitu besarnya kemungkaran yang menganggap Allah memiliki anak. Sungguh tidak layak bagi Allah Yang Maha Pengasih memiliki seorang anak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. وَقَالُوا۟ اتَّخَذَ الرَّحْمٰنُ وَلَدًا (Dan mereka berkata: “Tuhan Yang Maha Pemurah mengambil (mempunyai) anak”) Yakni orang-orang Yahudi, Nasrani, dan sebagian orang arab yang mengatakan para malaikat adalah anak-anak perempuan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "88-90 1 ). Di dalam ayat disebutkan : { لَّقَدْ جِئْتُمْ } merupakan konteks kalimat kepada lawan bicara setelah ayat sebelumnya disebutkan : { وَقَالُوا } yang digunakan untuk orang ketiga; dari penjelasan di atas memunculkan satu faidah yang penting yaitu agar menambah jumlah mereka dalam kalimat atas kelancangan mereka dihadapan Allah dan sebagaimana mereka juga berpaling dan menyombongkan diri dihadapan-Nya, faidah lainnya adalah sebagai peringatan bahwa mereka seakan-akan mencela suatu kaum yang hadir dhadapannya secara langsung. 2 ). { لَّقَدْ جِئْتُمْ شَيْـًٔا إِدًّا , تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا } \"Sesungguhnya kamu telah mendatangkan sesuatu perkara yang sangat mungkar , Hampir-hampir langit pecah karena ucapan itu, dan bumi belah, dan gunung-gunung runtuh\" dua ayat ini menunjukkan bahwa ucapan bathil dapat menjadi sebab terjadinya musibah di bumi. 2 ). Jika gunung-gunung saja tunduk karena mengakui keesaan dan keimana kepada Allah, maka bagaimana dengan hati seorang mukmin yang takut kepada Allah dan selalu mengharap rahmat-Nya, sesungguhnya itu lebih utama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Mereka para musyrikin berkata: \"Malaikat adalah anak perempuan Allah, adapun orang Yahudi dan Nasrani mengatakan bahwa Tuhan Yang Maha Pemurah itu mempunyai anak\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Dzat Yang Maha Pengasih telah mengangkat anak”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Ini merupakan celaan dan penghinaan terhadap perkataan orang-orang yang selalu menentang lagi ingkar yang mempunyai persangkaan bahwa ar-Rahman memiliki anak; seperti perkataan orang-orang Nasrani, “Isa itu anak Allah” dan pernyataan orang-orang Yahudi, “Uzair itu anak Allah” dan pernyataan orang-orang musyrik, “Para malaikat itu adalah anak-anak perempuan Allah.” Mahatinggi Allah dari perkataan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 88: Yaitu orang-orang Yahudi yang mengatakan ‘Uzair putra Allah, Nasrani yang mengatakan Al Masih putra Allah, dan orang-orang musyrik yang mengatakan bahwa malaikat adalah putri-putri Allah, Mahasuci dan Mahatinggi Allah dari apa yang mereka ucapkan dengan ketinggian yang besar. Maka di ayat ini dan selanjutnya Allah membantah mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 88",
    "description": "Selain menampik kepercayaan kaum musyrik bahwa berhala dapat memberi syafaat, Allah juga menegasikan keyakinan mereka bahwa Allah memiliki anak. Dan mereka, kaum yahudi, nasrani, dan sebagian masyarakat arab, berkata, 'tuhan yang maha pengasih mempunyai anak, ' yaitu 'uzair dalam kepercayaan yahudi, isa dalam anggapan umat nasrani, dan malaikat dalam keyakinan sebagian masyarakat arab. 89. Wahai orang kafir yang berkeyakinan demikian, sadarlah bahwa sesungguhnya kamu telah membawa sesuatu yang sangat mungkar dan bertentangan dengan akal sehat dan hati nurani."
  }
]