[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kalian (wahai orang-orang yang mengatakan pernyataaan tersebut) telah datang dengan membawa perkara besar yang sangat mungkar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Wahai orang-orang yang mengatakan ucapan tersebu, sungguh kalian telah mendatangkan perkara yang sangat mungkar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. لَّقَدْ جِئْتُمْ شَيْـًٔا إِدًّا (Sesungguhnya kamu telah mendatangkan sesuatu perkara yang sangat mungkar) Makna (الإد) yakni sesuatu yang sangat buruk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "88-90 1 ). Di dalam ayat disebutkan : { لَّقَدْ جِئْتُمْ } merupakan konteks kalimat kepada lawan bicara setelah ayat sebelumnya disebutkan : { وَقَالُوا } yang digunakan untuk orang ketiga; dari penjelasan di atas memunculkan satu faidah yang penting yaitu agar menambah jumlah mereka dalam kalimat atas kelancangan mereka dihadapan Allah dan sebagaimana mereka juga berpaling dan menyombongkan diri dihadapan-Nya, faidah lainnya adalah sebagai peringatan bahwa mereka seakan-akan mencela suatu kaum yang hadir dhadapannya secara langsung. 2 ). { لَّقَدْ جِئْتُمْ شَيْـًٔا إِدًّا , تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا } \"Sesungguhnya kamu telah mendatangkan sesuatu perkara yang sangat mungkar , Hampir-hampir langit pecah karena ucapan itu, dan bumi belah, dan gunung-gunung runtuh\" dua ayat ini menunjukkan bahwa ucapan bathil dapat menjadi sebab terjadinya musibah di bumi. 2 ). Jika gunung-gunung saja tunduk karena mengakui keesaan dan keimana kepada Allah, maka bagaimana dengan hati seorang mukmin yang takut kepada Allah dan selalu mengharap rahmat-Nya, sesungguhnya itu lebih utama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Sesungguhnya kamu telah melakukan sesuatu perkara yang sangat mungkar dan mengatakan perkataan yang sangat buruk. Al iddi adalah perkara yang sangat munkar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kalian benar-benar telah membawa sesuatu yang sangat mungkar} kemungkaran yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-91. “SEsungguhnya kalian telah melakukan perkara yang sangat mungkar,” maksudnya sangat besar dan berat. Karena saking besarnya masalah ini “hampir saja langit-langit itu,” meskipun besar lagii kokoh “pecah karena ucapan itu,” maksudnya karena ucapan ini, “dan bumi terbelah” karenanya. Maksudnya hampir saja bumi itu terpecah belah lagi berkeping-keping. “Dan gunung-gunung runtuh,” maksudnya gunung-gunung itu bergoncang-goncang. “Karena mereka mendakwa Allah Yang Maha Pemurah mempunyai anakk,” maksudnya akibat dari tuduhan jelek mereka itu, hampir saja makhluk-makhluk Allah (yang besar-besar) ini mengalami peristiwa yang telah disebutkan di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 89",
    "description": "Wahai orang kafir yang berkeyakinan demikian, sadarlah bahwa sesungguhnya kamu telah membawa sesuatu yang sangat mungkar dan bertentangan dengan akal sehat dan hati nurani. 90. Akibat ucapan kamu yang mungkar itu hampir saja terjadi bencana hebat di alam ini; langit yang demikian kukuh pecah, dan bumi tempat kamu berpijak terbelah, dan gunung-gunung yang tegak berdiri runtuh dan hancur berkeping-keping."
  }
]