[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Malaikat menjawab Zakaria terhadap apa yang diherankannya, ”demikianlah keadaannya, sebagaimana yang engkau katakan, bahwa istrimu mandul dan engkau telah mencapai usia lanjut, akan tetapi tuhanmu telah berkata, bahwa penciptaan yahya dalam keadaan demikian ini merupakan perkara mudah lagi ringan bagi Ku. Kemudian Allah menyebutkan kepada zakaria perkara yang jauh lebih aneh daripada apa yang dipertanyakannya itu. Allah berfirman, ’Dan sesungguhnya aku telah menciptakanmu sebelum yahya, sedang kamu bukanlah sesuatu yang pernah disebut-sebut dan belum ada wujudnya sama sekali. ’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Malaikat berkata, \"Benarlah yang engkau katakan bahwa istrimu mandul tak bisa melahirkan, dan engkau sendiri telah mencapai usia yang sangat tua dan tulang-tulangmu telah melemah, akan tetapi Tuhanmu berfirman, Penciptaan Tuhanmu terhadap Yahya dari seorang ibu yang mandul, dan seorang ayah di penghujung umurnya sungguh amat mudah, dan Aku telah ciptakan engkau -wahai Zakariya- sebelum itu padahal saat itu engkau belum disebut-sebut sebab engkau belum berwujud sama sekali.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Malaikat yang menyampaikan kabar gembira dari Allah berkata: “Demikianlah penciptaan yang tidak lazim dengan menciptakan dari kedua orangtua yang telah renta, dan menciptakannya adalah hal yang mudah bagi-Ku; Aku telah menciptakanmu sebelum Yahya, padahal kamu sebelumnya adalah sesuatu yang tidak ada.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَقَدْ خَلَقْتُكَ مِن قَبْلُ وَلَمْ تَكُ شَيْـًٔا (dan sesunguhnya telah Aku ciptakan kamu sebelum itu, padahal kamu (di waktu itu) belum ada sama sekali) Yakni Allah telah menciptakannya pertama kali yang sebelumnya tidak ada, maka menciptakan seorang anak lewat perkawinan layaknya yang terjadi adalah sesuatu yang lebih mudah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Tuhan berfirman dengan wahyu: \"Jangan heran, perkara ini tetap bisa dalam keaadaan ini\". Tuhanmu berfirman: \"Hal itu adalah mudah bagi-Ku; layaknya Aku menciptakanmu pertama kali. Sesunguhnya telah Aku ciptakan kamu sebelum itu, padahal kamu di waktu itu belum ada sama sekali. Adapun memberikanmu putera adalah perkara yang lebih mudah daripada itu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Malaikat berkata menjawab Zakaria {”Demikianlah” Tuhanmu berfirman,”Hal itu bagiKu sangat mudah} mudah dan gampang {sungguh Aku telah menciptakanmu sebelum itu, padahal kamu belum ada sama sekali”} kamu belum menjadi sesuatu yang bisa disebut dan belum ada"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Maka Allah menjawab keheranannya dengan FirmanNya, “Demikianlah,” Rabbmu berfirman, “Hal itu adalah mudah bagiKU,” maksudnya masalah ini memang aneh menurut kebiasaan, dan aneh juga dalam sunnatullah pada penciptaan makhlukNya. Akan tetapi, kekuasaan Allah memungkinkan penciptaan Yahya, tanpa melalui sebab-sebab (yang lumrah) dan masalah ini ringan (bagiNya). Tidak lebih sulit bagi Allah daripada menciptakan Zakaria sebelumnya, padahal sebelumnya beliau tidak ada sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 9: Yakni mewujudkan sesuatu tanpa sebab adalah hal yang sangat mudah bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 9",
    "description": "Menjawab keheranan zakaria, Allah berfirman, 'demikianlah. Benar bahwa engkau telah lanjut usia dan istrimu mandul. ' memastikan kehendak-Nya, tuhanmu berfirman, 'wahai zakaria, sungguh hal itu, yaitu memberimu anak dalam kondisimu yang seperti itu, adalah hal mudah bagi-ku sebagaimana aku menciptakan manusia dalam keadaan normalnya. Sungguh, engkau tidak perlu heran karena engkau telah aku ciptakan sebelum itu, padahal pada waktu itu engkau sama sekali belum berwujud sebagai apa pun. '10. Berita itu menggembirakan sekaligus mengejutkan nabi zakaria. Untuk memastikannya, dia berkata, 'ya tuhanku, berilah aku suatu tanda yang menambah keyakinanku pada berita itu. Bukan aku tidak percaya akan kekuasaan-Mu, namun ini adalah hal yang luar biasa bagiku. ' menjawab permohonan nabi zakaria, Allah berfirman, 'tanda yang aku berikan kepada-Mu agar kaupercaya sepenuhnya ialah bahwa engkau tidak akan dapat bercakap-cakap dengan manusia di sekelilingmu selama tiga hari tiga malam, kecuali dengan memberi isyarat, padahal sesungguhnya engkau sehat dan tidak menderita penyakit apa pun. '."
  }
]