[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "90-91. Hampir-hampir langit pecah berkeping-keping akibat amat buruknya pernyataan tersebut, dan bumi telah terbelah serta gunung-gunung runtuh dengan menggelegar di dorong kemarahan karena Allah. Lantaran mereka menisbatkan anak kepadaNya. maha tinggi Allah dari hal tersebut setinggi-tingginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Hampir-hampir saja langit pecah dan terbelah, bumi retak, dan gunung-gunung runtuh berantakan lantaran perkataan kalian yang mungkar ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْهُ (hampir-hampir langit pecah karena ucapan itu) Makna (التفطر) yakni terpecah belah. وَتَنشَقُّ الْأَرْضُ(dan bumi belah) Yakni dan bumi hampir terbelah. وَتَخِرُّ الْجِبَالُ(dan gunung-gunung runtuh) Hancur. هَدًّا(berkeping-keping) Dengan sehancur-hancurnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "88-90 1 ). Di dalam ayat disebutkan : { لَّقَدْ جِئْتُمْ } merupakan konteks kalimat kepada lawan bicara setelah ayat sebelumnya disebutkan : { وَقَالُوا } yang digunakan untuk orang ketiga; dari penjelasan di atas memunculkan satu faidah yang penting yaitu agar menambah jumlah mereka dalam kalimat atas kelancangan mereka dihadapan Allah dan sebagaimana mereka juga berpaling dan menyombongkan diri dihadapan-Nya, faidah lainnya adalah sebagai peringatan bahwa mereka seakan-akan mencela suatu kaum yang hadir dhadapannya secara langsung. 2 ). { لَّقَدْ جِئْتُمْ شَيْـًٔا إِدًّا , تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا } \"Sesungguhnya kamu telah mendatangkan sesuatu perkara yang sangat mungkar , Hampir-hampir langit pecah karena ucapan itu, dan bumi belah, dan gunung-gunung runtuh\" dua ayat ini menunjukkan bahwa ucapan bathil dapat menjadi sebab terjadinya musibah di bumi. 2 ). Jika gunung-gunung saja tunduk karena mengakui keesaan dan keimana kepada Allah, maka bagaimana dengan hati seorang mukmin yang takut kepada Allah dan selalu mengharap rahmat-Nya, sesungguhnya itu lebih utama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Langit hampir pecah karena ucapan itu, dan bumi terbelah, dan gunung-gunung runtuh, sebab buruknya perkataan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Karena itu} karena ucapan yang dibuat-buat itu {hampir saja langit pecah} pecah {bumi terbelah} terbelah {dan gunung-gunung runtuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-91. “SEsungguhnya kalian telah melakukan perkara yang sangat mungkar,” maksudnya sangat besar dan berat. Karena saking besarnya masalah ini “hampir saja langit-langit itu,” meskipun besar lagii kokoh “pecah karena ucapan itu,” maksudnya karena ucapan ini, “dan bumi terbelah” karenanya. Maksudnya hampir saja bumi itu terpecah belah lagi berkeping-keping. “Dan gunung-gunung runtuh,” maksudnya gunung-gunung itu bergoncang-goncang. “Karena mereka mendakwa Allah Yang Maha Pemurah mempunyai anakk,” maksudnya akibat dari tuduhan jelek mereka itu, hampir saja makhluk-makhluk Allah (yang besar-besar) ini mengalami peristiwa yang telah disebutkan di atas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 90: Menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 90",
    "description": "Akibat ucapan kamu yang mungkar itu hampir saja terjadi bencana hebat di alam ini; langit yang demikian kukuh pecah, dan bumi tempat kamu berpijak terbelah, dan gunung-gunung yang tegak berdiri runtuh dan hancur berkeping-keping. 91. Bencana mengerikan itu bisa saja terjadi karena mereka menganggap bahwa Allah yang maha pengasih mempunyai anak. Anggapan ini jelas tidak benar dan tidak pula layak ditujukan kepada-Nya."
  }
]