[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "90-91. Hampir-hampir langit pecah berkeping-keping akibat amat buruknya pernyataan tersebut, dan bumi telah terbelah serta gunung-gunung runtuh dengan menggelegar di dorong kemarahan karena Allah. Lantaran mereka menisbatkan anak kepadaNya. maha tinggi Allah dari hal tersebut setinggi-tingginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Semua itu karena mereka menganggap Allah Yang Maha Pengasih memiliki anak. Sungguh Mahatinggi Allah setinggi-tingginya dari hal yang demikian itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. أَن دَعَوْا۟ لِلرَّحْمٰنِ وَلَدًا (karena mereka mendakwakan Allah Yang Maha Pemurah mempunyai anak) Yakni karena kemurkaan Allah atas mereka disebabkan besarnya apa yang mereka katakan bahwa Allah memiliki anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Karena mereka mengklaim bahwa Allah Yang Maha Pemurah mempunyai anak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan gunung runtuh seruntuh-runtuhnya {Karena mereka menganggap} karena mereka menghubungkan bahwa {Dzat Yang Maha Pengasih mempunyai anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-91. “SEsungguhnya kalian telah melakukan perkara yang sangat mungkar,” maksudnya sangat besar dan berat. Karena saking besarnya masalah ini “hampir saja langit-langit itu,” meskipun besar lagii kokoh “pecah karena ucapan itu,” maksudnya karena ucapan ini, “dan bumi terbelah” karenanya. Maksudnya hampir saja bumi itu terpecah belah lagi berkeping-keping. “Dan gunung-gunung runtuh,” maksudnya gunung-gunung itu bergoncang-goncang. “Karena mereka mendakwa Allah Yang Maha Pemurah mempunyai anakk,” maksudnya akibat dari tuduhan jelek mereka itu, hampir saja makhluk-makhluk Allah (yang besar-besar) ini mengalami peristiwa yang telah disebutkan di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 91",
    "description": "Bencana mengerikan itu bisa saja terjadi karena mereka menganggap bahwa Allah yang maha pengasih mempunyai anak. Anggapan ini jelas tidak benar dan tidak pula layak ditujukan kepada-Nya. 92. Dan sungguh, tidak mungkin bagi Allah yang maha pengasih mempunyai atau mengangkat anak. Allah yang mahakaya tidak membutuhkan apa pun. Jika dia mempunyai anak, pasti anak itu serupa dengan-Nya, dan hal ini akan menghilangkan esensi keesaan-Nya."
  }
]