[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak sepantasnya bagi Allah yang maha pengasih dan tidak layak dengan keagunganNya untuk mengambil anak. Sebab, mengambil anak menunjukan kekuarangan dan kebutuhan. Sedangkan Allah Dia maha kaya, maha terpuji, bebas dari seluruh jenis kekuarangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Dan tidak pantas bagi Yang Maha Pengasih memiliki seorang anak, sebab Dia tersucikan dari hal tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَمَا يَنۢبَغِى لِلرَّحْمٰنِ أَن يَتَّخِذَ وَلَدًا (Dan tidak layak bagi Tuhan Yang Maha Pemurah mengambil (mempunyai) anak) Yakni tidak layak bagi-Nya sebab ini merupakan sifat kekurangan bagi-Nya. Maha Tinggi dan Maha Suci Allah dari apa yang mereka katakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Tidak layak bagi Tuhan Yang Maha Pemurah disebut mempunyai anak. Allah Maha Kuasa atas segala sesuatu, sehingga tidak butuh penolong"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak sepantasnya bagi Dzat Yang Maha Pengasih} tidak benar dan tidak sepantasnya Dzat Yang Maha Pengasih {mengangkat anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. Padahal, sejatinya “tidak layak,” maksudnya tidak pantas dan tidak akan mungkin terjadi “bagi Dzat Yang Maha Pemurah mengambil (mempunyai) anak,” hal tersebut karena “memiliki anak” merupakan sifat kurang dan kebutuhan Allah kepadanya, padahal Allah itu Mahakaya (tidak butuh) lagi Maha Terpuji. Di samping itu, anak itu mirip dengan bapaknya, sementara Allah tidak ada sesuatu pun yang mirip, serupa atau sama denganNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 92: Yang demikian karena mempunyai anak menunjukkan kekurangan dan kebutuhannya, sedangkan Allah Mahakaya lagi Maha terpuji. Di samping itu, anak itu sama dengan bapaknya, sedangkan Allah Subhaanahu wa Ta'aala tidak ada sesuatu pun yang sama dan serupa dengan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 92",
    "description": "Dan sungguh, tidak mungkin bagi Allah yang maha pengasih mempunyai atau mengangkat anak. Allah yang mahakaya tidak membutuhkan apa pun. Jika dia mempunyai anak, pasti anak itu serupa dengan-Nya, dan hal ini akan menghilangkan esensi keesaan-Nya. 93. Untuk menguatkan tidak adanya anak bagi-Nya, Allah menyatakan bahwa tidak ada seorang pun di langit dan di bumi, yaitu di alam semesta ini, melainkan kelak di hari kiamat akan datang dan menghadap kepada Allah yang maha pengasih sebagai seorang hamba. Mereka datang dengan tunduk dan patuh."
  }
]