[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah sesuatupun yang ada di langit seperti malaikat, dan yang ada di bumi, seperti manusia dan jin, kecuali akan datang kepada tuhannya pada hari kiamat sebagai hamba yang hina lagi tunduk serta mengaku menghambakan diri kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Tidak ada seorang pun yang tinggal di langit, dan di bumi dari kalangan Malaikat, manusia, dan jin, melainkan akan datang kepada Tuhannya hari Kiamat kelak dalam keadaan tunduk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93-95. Tidak ada seorang makhlukpun yang ada di tujuh langit dan bumi melainkan akan datang kepada Tuhannya pada hari kiamat sebagai hamba yang tunduk kepada-Nya. Allah meliputi mereka dengan ilmu-Nya, dan mengetahui jumlah mereka sebelum menciptakan mereka, serta mengetahui amalan mereka. Setiap makhluk ini akan datang pada hari kiamat tanpa harta, keturunan, dan penolong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. إِن كُلُّ مَن فِى السَّمٰوٰتِ وَالْأَرْضِ إِلَّآ ءَاتِى الرَّحْمٰنِ عَبْدًا (Tidak ada seorangpun di langit dan di bumi, kecuali akan datang kepada Tuhan Yang Maha Pemurah selaku seorang hamba) Yakni seluruh makhluk pasti akan datang kepada Allah di hari kiamat dengan mengakui bahwa ia adalah hamba-Nya dan dengan penuh ketundukan. Lalu bagaimana bisa salah satu dari makhluk itu adalah anak Allah?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Tidak ada seorangpun di langit dan di bumi, kecuali akan datang kepada Tuhan Yang Maha Pemurah dengan tertunduk dan menjadi hamba-Nya. Makna dalam konteks ini meliputi makna literal dan implisit, yaitu makna khusyuk atas kerajaan dan ketetapan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. “Tidak ada seorang pun di langit dan bumi, melainkan pasti dia akan datang kepada Rabb Yang Maha Pemurah selaku seorang hamba,” maksudnya datang dalam keadaan hina dan patuh, tidak menolak dan tidak membangkang, malaikat, manusia, jin dan lainnya, semuanya adalah hamba-hamba (Allah) yang mengalami pengaturan. Mereka tidak memiliki kekkuasaan sedikit pun, dan tidak memiliki wewenang untuk mengatur sama sekali. Bagaimana mungkin Dia memiliki anak padahal beginilah keadaanNYa dan keagungan kerajaanNya?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 93: Yang tunduk dan hina pada hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 93",
    "description": "Untuk menguatkan tidak adanya anak bagi-Nya, Allah menyatakan bahwa tidak ada seorang pun di langit dan di bumi, yaitu di alam semesta ini, melainkan kelak di hari kiamat akan datang dan menghadap kepada Allah yang maha pengasih sebagai seorang hamba. Mereka datang dengan tunduk dan patuh. 94. Semua manusia akan kembali pada Allah dan dia benar-benar telah mengetahui mereka dengan rinci, bagaimana kepribadian, kejiwaan, perbuatan, dan perkataan mereka secara lahir maupun batin. Dia juga akan memeriksa dan menghitung mereka dengan hitungan yang teliti sehingga tidak ada satu pun yang terlewat."
  }
]