[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah telah menghitung makhluk-makhlukNya semua dan mengetahui jumlah mereka, maka tidak ada seorangpun dari mereka yang tesembunyi olehNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Sungguh Dia telah mengetahui semua tentang mereka, dan mengetahui jumlah mereka dengan hitungan detail, sehingga tiada sesuatu pun yang tersembunyi bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. لَّقَدْ أَحْصَىٰهُمْ (Sesungguhnya Allah telah menentukan jumlah mereka) Yakni Allah telah mengetahui jumlah mereka. وَعَدَّهُمْ عَدًّا(dan menghitung mereka dengan hitungan yang teliti) Yakni Allah telah menghitung mereka setelah meliputi mereka semua, sehingga tidak ada yang tersembunyi satupun dari mereka dan tidak akan ada yang terlewat dari kehadirannya di hadapan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Sesungguhnya Allah telah menentukan jumlah mereka dan menghitung mereka dengan hitungan yang teliti. Sehingga tidak ada yang bisa tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Dia benar-benar telah menentukan jumlah mereka} ilmuNya telah meliputi mereka {dan menghitung mereka dengan sungguh-sungguh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. “Sesungguhnya Allah telah menentukan jumlah mereka dan menghitung mereka dengan hitungan yang teliti,” maksudnya, sungguh ilmu Allah meliputi semua makhluk, baik penghuni langit ataupun bumi, dan Allah menghitung jumlah mereka dan menghitung jumlah amalan mereka, Dia tidak mengalami kesalahan dan tidak lupa serta tidak ada sesuatu pun yang tersembunyi baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 94: Ilmu-Nya meliputi semua makhluk yang di langit maupun yang di bumi, Dia menentukan jumlah mereka dan jumlah amal mereka, tidak salah dan tidak lupa, serta tidak ada satu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 94",
    "description": "Semua manusia akan kembali pada Allah dan dia benar-benar telah mengetahui mereka dengan rinci, bagaimana kepribadian, kejiwaan, perbuatan, dan perkataan mereka secara lahir maupun batin. Dia juga akan memeriksa dan menghitung mereka dengan hitungan yang teliti sehingga tidak ada satu pun yang terlewat. 95. Dan setiap orang dari mereka akan datang dan menghadap kepada Allah untuk menerima perhitungan dan putusan tentang perbuatannya di dunia secara sendiri-sendiri kelak pada hari kiamat. Tidak ada teman yang membantu dan tidak ada pula orang tua atau anak yang menolong."
  }
]