[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan mengikuti rasul-rasulNya serta beramal shalih sesuai petunjuk syariatNya, maka tuhan yang maha pengasih akan mengadakan rasa cinta dan sayang terhadap mereka pada hati-haati para hambaNYa.,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Sesungguhnya orang-orang yang beriman kepada Allah, dan mengerjakan amal saleh yang diridai oleh Allah, kelak Allah akan menanamkan rasa kasih sayang dalam hati mereka lantaran cinta-Nya kepada mereka, dan lantaran penganugerahan kasih sayang kepada hamba-hamba-Nya yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Orang-orang beriman yang mengakui keesaan Allah dan melakukan amalan yang mendatangkan keridhaan Allah akan Allah jadikan bagi mereka rasa cinta yang besar di hati para hamba."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. إِنَّ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ سَيَجْعَلُ لَهُمُ الرَّحْمٰنُ وُدًّا (Sesungguhnya orang-orang yang beriman dan beramal saleh, kelak Allah Yang Maha Pemurah akan menanamkan dalam (hati) mereka rasa kasih sayang) Dalam hadits shahih disebutkan: “Apabila Allah mencintai seorang hamba maka Dia akan menyeru Jibril dengan firman-Nya: “Aku mencintai si fulan, maka cintailah dia.” Kemudian Jibril akan menyeru di langit. Lalu akan turun rasa cinta kepadanya dalam hati penghuni bumi. Dan apabila Allah murka terhadap seorang hamba maka Dia akan menyeru Jibril dengan firman-Nya: “Aku memurkai si fulan, maka murkailah dia.” Maka Jibril menyeru kepada penduduk langit. Lalu akan turun rasa murka baginya (hamba tersebut) pada penghuni bumi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnu 'Abbas mengatakan : Yakni (mencintai manusia di dunia) Hati yang bersih senantiasa mencaintai sesama mukmin karena keimanannya, sekalipun ia belum belum berbuat kebaikan kepadanya, maka akan lebih besar lagi jika keimanan dibarengi dengan kebaikan. 2 )."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Sesungguhnya orang-orang yang beriman kepada Allah dan rasulNya, serta menaatiNya dan menjauhi larangan-laranganNya itu kelak akan ditanamkan rasa kasih sayang dalam hatinya oleh Dzat yang Maha Pemurah, dicintai manusia, dan diridhai olehNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya bagi orang-orang yang beriman dan beramal shalih, itu akan ditanamkan kepada mereka oleh Dzat Yang Maha Pengasih rasa cinta} rasa cinta, Allah mencintai mereka, dan membuat mereka mencintai hamba-hambaNya yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. INi merupakan bagian dari nikmat Allah bagi para hambaNya, yang telah memadukan antara keimanan dan amal shalih, bahwasanya Allah berjanji kepada mereka akan menjadikan rasa cinta buat mereka. Yakni rasa cinta dan kasih dalam hati para waliNya, penghuni langit dan penghuni bumi. Jika mereka sudah berhasil memiliki rasa cinta pada hati (orang-orang), maka berbagai urusan mereka menjadi mudah, dan mereka akan meraih berbagi macam kebaikan, doa-doa, petunjuk, dapat diterima (oleh pihak lain) dan memperoleh kepemimpinan. Allah menempatkan rasa cinta pada mereka karena mereka mengasihi Allah dan mencintaiNya. Maka Allah (membalasnya dengan) membuat mereka menjadi orang yang dicintai oleh para wali dan kekasihNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 96: Dalam surat Maryam ini nama Allah Ar Rahmaan banyak disebut, untuk memberi pengertian bahwa, Allah memberi ampunan tanpa perantara, dan bahwa rahmat-Nya begitu luas dan mengena kepada segala sesuatu. Hal ini termasuk nikmat Allah kepada hamba-hamba-Nya yang beriman dan beramal saleh, di mana Dia menjanjikan bahwa mereka akan mendapatkan kecintaan dari makhluk. Di dalam hadits disebutkan: إِذَا أَحَبَّ اللَّهُ الْعَبْدَ نَادَى جِبْرِيلَ : إِنَّ اللَّهَ يُحِبُّ فُلاَناً فَأَحْبِبْهُ فَيُحِبُّهُ جِبْرِيلُ ، فَيُنَادِى جِبْرِيلُ فِي أَهْلِ السَّمَاءِ : إِنَّ اللَّهَ يُحِبُّ فُلاَناً فَأَحِبُّوهُ . فَيُحِبُّهُ أَهْلُ السَّمَاءِ ، ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِى الأَرْضِ “Apabila Allah mencintai seorang hamba, Dia memanggil Jibril, “Sesungguhnya Allah mencintai fulan, maka cintailah dia!” Maka Jibril mencintainya, lalu Jibril memanggil penduduk langit, “Sesungguhnya Allah mencintai si fulan, maka cintailah dia!” lalu penduduk langit mencintainya, kemudian ia pun diterima di bumi.” (HR. Bukhari) مَنِ الْتَمَسَ رِضَى اللهِ بِسَخَطِ النَّاسِ رَضِيَ اللهُ عَنْهُ ، وَأَرْضَى النَّاسَ عَنْهُ ، وَمَنِ الْتَمَسَ رِضَا النَّاسِ بِسَخَطِ اللهِ سَخِطَ اللهُ عَلَيْهِ ، وَأَسْخَطَ عَلَيْهِ النَّاسَ “Barang siapa yang mencari keridhaan Allah dengan kemurkaan manusia, maka Allah meridhainya dan akan menjadikan manusia ridha kepadanya, dan barang siapa yang mencari keridhaan manusia dengan kemurkaan Allah, maka Allah akan murka kepadanya dan menjadikan manusia murka kepadanya.” (HR. Ibnu Hibban dalam shahihnya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 96",
    "description": "Usai menegasikan keyakinan orang musyrik bahwa Allah mempunyai anak dan perhitungan yang akan mereka peroleh, dia lalu beralih menerangkan balasan bagi orang mukmin dan beramal saleh. Sungguh, orang-orang yang beriman dengan teguh dan membuktikan keimanannya dengan mengerjakan kebajikan, kelak Allah yang maha pengasih akan menanamkan rasa kasih sayang dalam dirinya kepada sesama orang beriman. 97. Wahai nabi, maka sampaikanlah janji Allah kepada umatmu bahwa sesungguhnya telah kami mudahkan Al-Qur'an itu dengan bahasamu. Yang demikian ini agar dengan itu engkau dapat memberi kabar gembira tentang janji dan rahmat Allah kepada orang-orang yang bertakwa yang selalu melaksanakan perintah-Nya dan menjauhi larangan-Nya, dan agar engkau dapat memberi peringatan tentang murka dan hukuman-Nya kepada kaum yang membangkang dan mengingkari ajaran-Nya."
  }
]