[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami telah memudahkan al-qur’an ini dengan lisanmu berbahasa arab (wahai rasul) agar engkau dapat memberikan kabar gembira kepada orang-orang yang bertakwa dari para pengikutmu, dan memperingatkan dengannya orang-orang yang mendustakan lagi sangat besar penentangannya dengan dasar kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Maka sungguh Kami telah mudahkan Al-Qur`ān ini dengan menurunkannya pakai bahasamu -wahai Rasul-, agar engkau dapat memberi kabar gembira kepada orang-orang bertakwa yang menjalankan perintah dan menjauhi larangan-Ku, dan agar engkau dapat pula memberi peringatan kepada kaum yang sangat pembangkang dan durhaka untuk tunduk terhadap kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Kami telah memudahkan kalimat dan makna-makna dalam al-Qur’an dengan bahasa arab yang fasih agar kamu dapat memberi kabar gembira bagi orang yang takut kepada Allah dan mengharap keridhaan-Nya bahwa mereka akan mendapat surga, dan memberi peringatan kepada orang-orang kafir yang tersesat dan membela kebatilan dengan kuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. فَإِنَّمَا يَسَّرْنٰهُ بِلِسَانِكَ (Maka sesungguhnya telah Kami mudahkan Al Quran itu dengan bahasamu) Yakni Kami telah memudahkan al-Qur’an dengan menurunkannya menggunakan bahasamu, dan Kami telah menjelaskannya. لِتُبَشِّرَ بِهِ الْمُتَّقِينَ (agar kamu dapat memberi kabar gembira dengan Al Quran itu kepada orang-orang yang bertakwa) Yakni yang menghiasi dirinya dengan ketakwaan. وَتُنذِرَ بِهِۦ قَوْمًا لُّدًّا (dan agar kamu memberi peringatan dengannya kepada kaum yang membangkang) Yakni orang yang memiliki permusuhan yang sangat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Sesungguhnya Kami mudahkan dan turunkan Al-Qur’an ini menggunakan bahasamu yaitu bahasa Arab, wahai Rasulullah, agar kamu memberi kabar gembira orang-orang yang bertakwa dengan surga karena keimanan dan amal shalih mereka, dan memberi peringatan kaum yang selalu berselisih dengan kebathilan, yaitu orang-orang kafir Mekah dan kaum lain seperti mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah memudahkannya} Kami telah memudahkan Al-Qur’an {dengan bahasamu agar dengannya kamu memberi kabar gembira kepada orang-orang yang bertakwa dan memberi peringatan kepada kaum yang membangkang} yang keras menentang dengan berbuat kebathilan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. Allah memberitahukan tentang nikmatNya, dan bahwa Allah telah menjadikan al-quran ini mudah lewat lisan Rasulullah, Muhammad. Allah memudahkan lafazh-lafazh dan makna-maknanya supaya tujuannya tercapai dan berhasil dimanfaatkan “agar kamu dapat memberi kabar gembira dengan al-Quran itu kepada orang-orang yang bertakwa,” dengan memberikan motivasi pada sesuatu yang telah dijanjikan sebagai kabar gembira berupa ganjaran di dunia dan akhirat disertai dengan penjelasan sebab kausalitas untuk mencapai kabar gembira itu. “Dan agar kamu memberi peringatan dengannya kepada kaum yang membangkang,” yaitu orang-orang yang begitu keras dalam kebatilan dan kuat dalam kekufuran. Lalu engkau memperingatkan mereka, hingga hujjah telah tegak atas mereka dan jalan yang lurus telah menjadi jelas bagi mereka. Maka binasalah orang yang binasa dengan keterangan yang nyata dan hiduplah orang yang hidup dengan keterangan yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 97: Dia memudahkan lafaz dan maknanya agar maksud tercapai dan dapat diambil manfaat. Dengan menyampaikan balasan atau pahala yang akan diperoleh orang yang bertakwa cepat atau lambat, demikian pula menyampaikan sebab yang menjadikannya dapat memperoleh kabar gembira itu. Yang sangat keras dalam kebatilannya, lagi kuat dalam kekafirannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 97",
    "description": "Wahai nabi, maka sampaikanlah janji Allah kepada umatmu bahwa sesungguhnya telah kami mudahkan Al-Qur'an itu dengan bahasamu. Yang demikian ini agar dengan itu engkau dapat memberi kabar gembira tentang janji dan rahmat Allah kepada orang-orang yang bertakwa yang selalu melaksanakan perintah-Nya dan menjauhi larangan-Nya, dan agar engkau dapat memberi peringatan tentang murka dan hukuman-Nya kepada kaum yang membangkang dan mengingkari ajaran-Nya. 98. Wahai nabi, sebagai peringatan dan pelajaran bagi para pembangkang itu, kabarkan kepada mereka berapa banyak umat yang telah kami binasakan sebelum mereka akibat keingkaran dan kedurhakaan mereka. Kami hancurkan mereka, lalu adakah engkau melihat salah seorang dari mereka atau engkau mendengar bisikan mereka' tidak! maka, sebagaimana kami binasakan umat terdahulu itu, kami pasti akan membinasakan kaummu yang ingkar."
  }
]