[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berapa banyak (wahai rasul) Kami membinasakan umat-umat manusia sebelum kaummu engkau tidak melihat seorangpun dari mereka itu dan engkau tidak mendengar suara apapun dari mereka. Demikian pula orang-orang kafir dari kaummu, Kami akan membinasakan mereka sebagaimana Kami telah membinasakan orang-orang dahulu sebelum mereka. Maka dalam ayat ini terdapat peringatan dan ancaman kebinasaan orang-orang yang mendustakan lagi menentang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Dan betapa banyak umat yang Kami telah binasakan sebelum adanya kaummu, maka apakah hari ini engkau melihat dan merasakan keberadaan salah satu dari umat-umat itu?! Dan ataukah kamu masih mendengar bisikan-bisikan mereka?! Sungguh, apa yang telah menimpa mereka boleh jadi akan menimpa selain mereka bila Allah menghendakinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Kemudian Allah menutup surat ini dengan menyebutkan umat-umat terdahulu yang berhak mendapatkan kebinasaan, agar dapat menjadi peringatan dan pelajaran tentang kesudahan orang-orang kafir dan pendosa. Sungguh Kami telah membinasakan banyak umat-umat terdahulu sebelum orang-orang kafir ini; kamu belum pernah melihat mereka dan belum pernah mendengar suara mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. هَلْ تُحِسُّ مِنْهُم مِّنْ أَحَدٍ (Adakah kamu melihat seorangpun dari mereka) Yakni apakah kamu merasa atau melihat salah seorang dari mereka. أَوْ تَسْمَعُ لَهُمْ رِكْزًۢا(atau kamu dengar suara mereka yang samar-samar) Makna (الركز) adalah suara yang samar. Pendapat lain mengatakan maknanya adalah suara atau gerakan yang dapat dipahami."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sesungguhnya orang-orang pesimis tidak akan takjub dengan perbaikan pada ummat ini, karena mereka melihat hal itu dengan mata kesombongan dan mereka pada dasarnya senang dengan makar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Dan berapa banyak umat-umat terdahulu yang telah Kami binasakan karena mendustakan rasul-rasul mereka. Apakah kamu mendapati salah satu dari mereka (masih hidup) atau mendengar suara mereka yang samar-samar? Sebagaimana membinasakan kaum-kaum itu, Kami juga akan membinasakan mereka (kafir Mekah)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Betapa banyak umat} umat {yang telah Kami binasakan sebelum mereka. Apakah kamu merasakan} merasakan {salah seorang dari mereka atau mendengar bisikan mereka} suara yang lirih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Kemudian Allah mengancam mereka dengan pemusnahan (yang dilakukan Allah) terhadap para pendusta sebelum mereka, “Dan berapa banyak telah Kami binasakan umat-umat sebelum mereka,” yaitu kaum Nabi NUh, ‘Ad, Tsamud, Fir’aun serta para pendusta dan penentang lainnya. Ketika mereka senantiasa dalam kedurhakaan mereka, maka Allah membinasakan mereka, sampai tidak ada sisa. “Adakah kamu melihat seorang pun dari mereka atau kamu dengar suara mereka yang samar-samar?” maksudnya, tidak ada yang tersisa dari mereka suatu bentuk atau bekas apa pun. Akan tetapi, cerita-cerita tentang mereka masih menjadi bahan pelajaran bagi orang yang ingin memetik pelajaran. Begitu juga pembicaraan –pembicaraan mereka di malam hari menjadi bahan nasihat bagi orang-orang yang bisa menerima nasihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Maryam ayat 98: Selanjutnya Allah mengancam mereka dengan pembinasaan-Nya kepada orang-orang yang mendustakan para rasul. Seperti kaum Nuh, ‘Aad, Tsamud, Fir’aun dan lainnya, ketika mereka tetap di atas kekafirannya padahal peringatan sudah sampai kepada mereka, maka Allah membinasakan mereka tanpa ada seorang pun yang tertinggal. Mereka tidak meninggalkan jejak dan tidak bersisa, tinggallah berita mreka yang menjadi pelajaran bagi orang-orang yang datang kemudian. Selesai tafsir surah Maryam dengan pertolongan Allah dan taufiq-Nya, wal hamdulillahi Rabbil ‘aalamiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Maryam Ayat 98",
    "description": "Wahai nabi, sebagai peringatan dan pelajaran bagi para pembangkang itu, kabarkan kepada mereka berapa banyak umat yang telah kami binasakan sebelum mereka akibat keingkaran dan kedurhakaan mereka. Kami hancurkan mereka, lalu adakah engkau melihat salah seorang dari mereka atau engkau mendengar bisikan mereka' tidak! maka, sebagaimana kami binasakan umat terdahulu itu, kami pasti akan membinasakan kaummu yang ingkar. 1. Bila surah sebelumnya ditutup dengan berita kebinasaan umat terdahulu karena kedurhakaan mereka, surah ini diawali dengan penjelasan bahwa Al-Qur'an turun untuk kebaikan, bukan kesusahan, bagi umat. Taha."
  }
]