[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Keburukan dan kebinasaan bagi setiap orang yang mengghibahi orang dan mencela mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Celaka dan siksa yang pedih bagi orang yang banyak menggunjing manusia dan mencela mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah mengancam akan membinasakan orang yang menyakiti kaum muslimin dengan perkataan dan perbuatannya; yaitu dengan menghina dan melecehkan mereka. Dan dikatakan bahwa yang dimaksud dengan (همزة) adalah orang yang menggunjing (ghibah), dan (لمزة) adalah orang yang menghina menggunakan isyarat mata dan alis."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ (kecelakaanlah bagi setiap pengumpat lagi pencela) Yakni kehinaan atau adzab atau kecelakaan untuk al-humazah, yaitu mereka yang mencela seseorang di hadapannya. Dan untuk lumazah, yakni yang menggibah di belakangnya. Dikatakan buka bahwa al-humazah adalah yang menyakiti rekan-rekan duduknya dengan perkataan yang buruk. Dan al-lumazah adalah yang memicingkan matanya kepada rekan duduknya. Dan dia menunjuk-nunjuk dengan menggunakan tangannya, atau kepalanya, atau alisnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Kehancuran, kerendahan dan siksaan yang sangat berat bagi setiap pengumpat (para pengumpat) yaitu orang yang menyakiti dan menghina kehormatan dan kemuliaan orang, dan bagi pencela (para pencela) yaitu pembuka aib, yang mencemarkan aib orang banyak yang dirahasiakan dalam lisan, mata, tangan, kepala atau bagian tubuh lainnya untuk merendahkan mereka dan menaikkan derajatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecelakaanlah} kehinaan dan kehancuran {bagi setiap pengumpat} orang yang mengumpat pada orang lain {lagi pencela} dan mencerca mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. “Kecelakaanlah,” yaitu ancaman, bencana, dan kerasnya siksa, “bagi setiap pengumpat lagi pencela,” yakni orang yang mengumpat sesama dengan perbuatannya dan mencela sesama dengan perkataannya. ‘Alhammaazu’ adalah orang yang mencela dan memfitnah orang lain dengan isyarat dan tindakan, sedangkan ‘Allammaazu’ adalah orang yang mencela sesama dengan perkataan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَيْلٌ } Kecelakaanlah { لِكُلِّ هُمَزَةٍ لُمَزَةٍ } bagi setiap pengumpat dan pencela, dua sifat ini sangat buruk pada hakikatnya, berasal dari kata \"الهمز\" yaitu mengumpat, sifat yang ini didiketahui dengan perbuatan, dan \"اللمز\" mencela, yitu dengan perkataan, Allah - عز وجل - berfirman : { وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ فَإِنْ أُعْطُوا مِنْهَا رَضُوا وَإِنْ لَمْ يُعْطَوْا مِنْهَا إِذَا هُمْ يَسْخَطُونَ } ( Dan di antara mereka ada orang yang mencelamu tentang (distribusi) zakat; jika mereka diberi sebahagian dari padanya, mereka bersenang hati, dan jika mereka tidak diberi sebahagian dari padanya, dengan serta merta mereka menjadi marah. ) [ At-Taubah : 58 ] , mereka mencela Rasulullah ﷺ perihal zakat, mereka tidak mementingkat hal lain selain diri mereka sendiri, maka seharusnya setiap muslim menjauh dari dua sifat keji ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ \" Kecelakaanlah bagi setiap pengumpat lagi pencela,\" Pada surat ini, Allah Subhaanahu wa Ta'ala memulai dengan kata وَيْلٌ [Wail] ini adalah kata untuk mengancam. Maknanya: Bahwa kata tersebut menunjukkan adanya ancaman bagi orang-orang yang memiliki sifat-sifat ini: هُمَزَةٍ لُمَزَةٍ \" pengumpat lagi pencela,\" hingga akhir yang disebutkan. Dikatakan juga bahwa وَيْلٌ [Wail] adalah salah satu nama lembah di neraka jahannam. Tetapi penafsiran yang pertama yang lebih tipat لِكُلِّ هُمَزَةٍ لُمَزَةٍ \" setiap pengumpat lagi pencela,\" Kata كُل [Kull: setiap] adalah di antara bentuk kata yang menunjukkan umum, al-humazah dan al-Lumazah adalah dua sifat untuk satu orang yang disifati, apakah kedua kata tersebut bermakna satu? Ataukah berbeda makna? Sebagian ulama mengatakan: Keduanya adalah lafaz yang memiliki satu makna, yakni humazah adalah lumazah. Ulama lainnya mengatakan: Setiap kata memiliki makna tersendiri. Di sini kaedah yang ingin saya utarakan dalam tafsir dan di luar pembahasan tafsir, yaitu: Bahwa apabila dalam sebuah konteks, ada dua kata yang bisa jadi keduanya satu makna atau setiap kata memiliki makna yang berbeda, maka kita menerapkan bahwa masing masing memiliki makna, karena jika kita menjadikan keduanya hanya bermakna dengan satu makna, maka konsekuansinya adalah tidak ada gunanya ada pengulangan kata (yang bermakna sama), tetapi jika kita terapkan setiap kata memiliki makna maka ini menjadi landasan dan pembeda antara dua kata tersebut, dan yang benar dalam ayat ini لِكُلِّ هُمَزَةٍ لُمَزَةٍ \"setiap pengumpat lagi pencela,\" adalah kedua kata tersebut memiliki perbedaan makna: Al-Hamz: (celaan) dengan perbuatan. Al-Lamz (celaan) dengan lisan, sebagaimana Allah ta'ala berfirman: وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ فَإِنْ أُعْطُوا مِنْهَا رَضُوا وَإِنْ لَمْ يُعْطَوْا مِنْهَا إِذَا هُمْ يَسْخَطُونَ \" Dan di antara mereka ada orang yang mencelamu tentang (pembagian) zakat; jika mereka diberi sebahagian daripadanya, mereka bersenang hati, dan jika mereka tidak diberi sebahagian daripadanya, dengan serta merta mereka menjadi marah. \"(QS. At-Taubah: 58) Sedangkan al-Hamz dengan perbuatan, yakni: Mencela dengan gerakan, bisa dengan memalingkan wajah, atau menampakkan wajah murka, atau dengan menunjuk orang lain, sambil mengatakan: lihatlah dia dalam rangka menghinanya, atau yang semisal. Al-Hamz adalah celaan dengan gerakan (perbuatan) sedangkan al-lamz celaan dengan lidah. Sebagian orang -wal'iyaadzu billaah- gemar menghina orang, bisa dengan perbuatannya, sehingga disebut hammaz atau dengan ucapannya ini disebut lammaz, ini seperti firman Allah Ta'ala: وَلَا تُطِعْ كُلَّ حَلَّافٍ مَهِينٍ (10) هَمَّازٍ مَشَّاءٍ بِنَمِيمٍ \"Dan janganlah kamu ikuti setiap orang yang banyak bersumpah lagi hina, yang banyak mencela, yang kian ke mari menghambur fitnah,\"(QS. Al-Qolam: 10-11)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 1: Allah memulai surat ini dengan teguran akan adzab yang keras, kecelakaan, penghinaan, dan kebinasaan bagi pencemooh manusia dan tukang ghibah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata ‘wail’ merupakan kata siksaan, ancaman dan kerasnya azab, atau sebuah lembah di neraka Jahannam. Menurut penyusun tafsir Al Jalaalain, ayat ini turun berkenaan dengan orang-orang yang sering menggunjing Nabi shallallahu 'alaihi wa sallam dan kaum mukmin, seperti Umayyah bin Khalaf, Walid bin Mughirah dan lain-lain, wallahu a’lam. Humazah artinya yang mencela manusia dengan isyarat dan perbuatannya, sedangkan lumazah adalah yang mencela dengan ucapannya. Di antara sifat para pengumpat (penggunjing) lagi pencela adalah seperti yang disebutkan dalam ayat selanjutnya, yaitu tidak ada maksud selain mengumpulkan harta dan menghitung-hitungnya, tidak suka berinfak di jalur-jalur kebaikan, menyambung tali silaturrahim, dan sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 1",
    "description": "Celakalah bagi setiap pengumpat atau pencaci, baik dengan ucapan atau isyarat, dan demikian pula pencela dengan menampilkan keburukan orang lain untuk menghinakannya. Perbuatan ini berdampak buruk dalam pergaulan karena mencoreng wibawa dan kehormatan seseorang, serta menghilangkan kepercayaan kepada orang tersebut. 2. Celakalah orang yang sifatnya demikian, yang selalu menyibukkan diri dan berorientasi pada mengumpulkan harta benda dan menghitung-hitungnya. Dia merasa nyaman untuk menumpuk dan menghitung harta untuk menjamin kehidupannya di masa datang, dan enggan me-nunai'kan hak Allah dalam hartanya itu."
  }
]