[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia menyangka bahwa harta yang dikumpulkannya menjaminnya kekal di dunia dan lolos dari hisab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Ia mengira bahwa harta yang dikumpulkannya bisa menolongnya dari kematian sehingga ia bisa hidup kekal di kehidupan dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Orang itu mengira hartanya dapat membuatnya kekal di dunia dan memperpanjang usianya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. يَحۡسَبُ اَنَّ مَالَهٗۤ اَخۡلَدَهٗ‌ (dia mengira bahwa hartanya itu dapat mengkekalkannya) Yakni dia mengira hartanya akan membuatnya tetap hidup selamanya. Dia sangat takjub atas harta yang berhasil dia kumpulkan sehingga tidak lagi memikirkan kehidupan setelah kematian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pada ayat ini ada gambaran akan kecintaannya yang berlebihan kepada harta, dia menyangka bahwa tidak ada kehidupan tanpa harta; untuk dia berusaha untuk menjaganya dari segala kekurangan agar dapat bertahan hidup, dan barangsiapa yang bersikap seperti ini dia berhak atas ancaman dan celaka sebagaimana yang dijelas pada awal surah, karena dengan demikina pada hakikatnya dia telah berhamba kepada harta, dalam sebuah hadits Rasulullah bersabda : { تَعِسَ عَبْدُ الدِّيْنَارِ تَعِسَ عَبْدُ الدِّرْهَمِ } \"Celakalah hamba dinar, celakalah hamba dirham\" [ Diriwayatkan oleh Imam Bukhori ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dia menganggap bahwa hartanya menjadikannya dapat hidup abadi dan tidak mati. Maknanya adalah, dia melakukan pekerjaan seseorang yang tidak pernah berpikir tentang kematian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mengira} mengira {bahwa hartanya itu dapat membuatnya kekal} membuatnya tetap hidup dan tidak mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Ia mengira,” karena kebodohannya, ”bahwa hartanya itu dapat mengekalkannya” di dunia. Karena itu semua jerih payah dan usahanya hanya untuk mengembangkan harta dengan mengira hal itu bisa memperpanjang umurnya, namun ia tidak tahu bahwa sifat kikir bisa meruntuhkan usia dan merobohkan rumah, sedangkan kebaikan akan semakin menambah usia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dia menyangka bahwasanya harta yang ia kumpul akan menjadikan hidupnya kekal diurga dengan penuh kebahagiaan, katahuilah sesungguhnya harta sebanyak apapun itu tidak akan bermanfaat kecuali jika digunakan untuk ketaatan kepada Allah - عز وجل - , harta itu akan menjadi penolong bagi pemiliknya didunia dan diakhirat jika digunakan untuk ketaatan kepada Allah - عز وجل - . Ayat ini bukan menjadi teguran bagi orang-orang yang mengumpulkan harta dengan cara yang baik dan pengelolaan yang baik, akan tetapi ayat ini menjadi peringatan bagi mereka yang memiliki harta tanpa mengeluarkan kewajibannya dari harta tersebut, Allah - عز وجل - berfirman : { كَلَّا ۖ إِنَّهَا لَظَىٰ , نَزَّاعَةً لِلشَّوَىٰ , تَدْعُو مَنْ أَدْبَرَ وَتَوَلَّىٰ , وَجَمَعَ فَأَوْعَىٰ } ( Sekali-kali tidak dapat, sesungguhnya neraka itu adalah api yang bergolak , Yang mengelupas kulit kepala , Yang memanggil orang yang membelakang dan yang berpaling (dari agama) , Serta mengumpulkan (harta benda) lalu menyimpannya ) [ Al-Ma'arij : 15 - 18 ] , harta yang tidak diinfakkan itulah yang dicela oleh Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ \" dia mengira bahwa hartanya itu dapat mengekalkannya,\" Maksudnya: Orang ini mengira bahwa hartanya akan mengekalkan dan mengabadikan dirinya, baik itu tubuhnya atau penyebutannya, karena umur manusia, bukanlah yang tersisa di dunia, tetapi umur manusia yang hakiki adalah yang mengekalkannya setelah kematian, dan kenangannya terus ada dalam hati-hati manusia dan mulut-mulut mereka. Allah berfirman pada ayat ini: يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ \" dia mengira bahwa hartanya itu dapat mengekalkannya,\" Maknanya: Menyisakan kenangan atau memanjangkan usianya, tetapi tidaklah demikian. Sungguh orang-orang yang banyak hartanya, jika tidak dikenal kedermawanannya dan kemurahannya, mereka akan kekal dikenang dengan keburukannya, sehingga akan dikatakan: Fulan pelit bakhil, dia lebih dari fulan , dia disebut-sebut dan dicela di dalam berbagai momen."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 3: Apakah ia (manusia bodoh dan kurang akal ini) menyangka bahwa hartanya akan kekal di dunia ini sedangkan ia akan berpaling menuju hari pembalasan. Ini adalah peringatan bagi orang-orang beriman agar tidak lalai mempersiapkan (bekal) akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena kebodohannya. Yakni membuatnya kekal dan tidak mati. Oleh karena itulah, usaha kerasnya hanya untuk mengembangkan hartanya yang ia kira dapat memanjangkan umurnya. Ia tidak menyadari, bahwa kebakhilan dapat mengurangi umur dan merobohkan tempat tinggalnya, sedangkan kebaikan dapat menambah umur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 3",
    "description": "Dia senang dan sibuk mengumpulkan harta karena mengira bahwa hartanya itu dapat mengekalkan hidupnya di dunia. Dia terbuai oleh hartanya dan lupa bahwa harta sebanyak apa pun tidak akan dapat digunakan untuk menolak datangnya sesuatu yang tidak diinginkannya, yaitu kematian. 4. Sekali-kali tidak! harta itu tidak akan menolak datangnya kematian kepadanya. Setelah mati dan dihisab atas perbuatan buruknya itu, pasti dia akan dilemparkan dan dicampakkan dengan hina ke dalam neraka hutamah oleh para malaikat zabaniah yang bengis, kasar, dan galak."
  }
]