[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perkaranya tidak seperti yang disangka, justru dia akan dicampakkan kedalam api neraka yang menghancurkan setiap yang dilempar kepadannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Urusannya tidak sebagaimana yang dibayangkan oleh orang bodoh ini. Sungguh ia akan dilemparkan ke dalam Neraka yang menghanguskan dan menghancurkan segala sesuatu yang dilemparkan ke dalamnya karena kekuatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Sungguh orang itu pantas untuk dicela atas perbuatan dan keyakinannya. Dia tidak melaksanakan kewajiban yang Allah perintahkan, yaitu mengeluarkan hartanya untuk kebaikan. Sungguh dia akan dilemparkan ke dalam neraka Jahannam yang akan menghancurkan setiap orang yang dimasukkan kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. كَلَّا‌ (sekali-kali tidak!) Yakni kenyataannya bukan seperti yang dia kira. لَيُنۡۢبَذَنَّ فِى الۡحُطَمَةِ (Sesungguhnya dia benar-benar akan dilemparkan ke dalam Huthamah) Yakni dia dan hartanya akan dilemparkan ke dalam neraka yang akan menghancurkan segala yang di masukkan ke dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. {Kalla} untuk mencegahnya melakukan hal ini. Sungguh Allah akan mengasingkannya dan melemparkannya dengan hina dan rendah di dalam neraka jahanam yang akan menghancurkan siapa saja yang dilemparkan di dalamnya. {Layunbadzanna} adalah jawaban dari qasam (sumpah) yang dibuang sebagaimana yang telah kami kira-kirakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak} Hal itu tidak seperti yang dia kira {Sungguh dia benar-benar akan dilemparkan} sungguh dia akan dilempar {ke dalam Huthamah} neraka yang setiap sesuatu yang dilemparkan ke dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-7. “Sekali-kali tidak! Sesungguhnya dia benar-benar akan dilemparkan,” yakni, akan dilemparkan, “Ke dalam Huthamah. Dan tahukah kamu apa Huthamah itu?” ini adalah ungkapan sebagai pengagungan kondisinya . Kemudian Allah menjelaskannya FirmanNya, “(Yaitu) api (yang disediakan) Allah yang dinyalakan,” yang bahan bakarnya adalah manusia dan bebatuan, “yang” karena dahsyatnya, “naik sampai ke hati,” yakni merasuk dari tubuh hingga ke hati."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sungguh orang-orang yang seperti itu benar-benar akan dilemparkan kedalam neraka huthomah. Huthomah adalah salah satu diantara nama neraka yang Allah siapkan untuk orang kafir dan musyrikin, kemudian makna huthomah ditafsirkan dengan ayat setelahnya yang menjelaskan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya, Allah berfirman: كَلَّا لَيُنْبَذَنَّ فِي الْحُطَمَةِ \" sekali-kali tidak! Sesungguhnya dia benar-benar akan dilemparkan ke dalam Huthamah.\" كَلَّا [Kallaa] Di sini ulama menyebutnya dengan huruf rad' (kata teguran). Maknanya teguran yang mengatakan ini atau menghitung harta dari ucapan dan perbuatannya, dan bisa jadi juga bermakna benar-benar. Maknanya: Benar benar akan dilemparkan, kedua makna ini benar, orang ini tidak akan dikekalkan oleh hartanya, dan tidak akan lama dikenang, tapi ia akan dilupakan dan tidak akan dikenang, namun justru akan dikenang keburukannya karena dia tidak melaksanakan apa yang Allah wajibkan berupa memberikan sedekah. لَيُنْبَذَنَّ فِي الْحُطَمَةِ \" Sesungguhnya dia benar-benar akan dilemparkan ke dalam Huthamah.\" Huruf lam di sini diletakkan untuk menjawab sumpah yang disembunyikan yaitu: Demi Allah, Sesungguhnya dia benar-benar akan dilemparkan ke dalam Huthamah. Yakni akan benar-benar dilemparkan. Jika kita katakan bahwa huruf lam di sini adalah jawab sumpah, maka kalimat (dalam ayat) ini ditegaskan dengan, huruf lam, nun taukid dan sumpah yang tersembunyi. Contoh yang semisal dengan ini banyak di dalam al-Quran. Maknanya: menguatkan suatu (ungkapan) dengan sumpah, huruf lam (taukid) dan nun. Dan Allah bersumpang dengan sesuatu sebagai penguat dan pengagungan terhadapnya. Firman-Nya لَيُنْبَذَنَّ \"Sungguh akan dilemparkan\" Apakah yang akan dilemparkan, pemilik harta arau harta? Keduanya akan dilemparkan, sedangkan pemilik harta maka Allah berfirman dalam ayat lain: يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعًّا \" pada hari mereka didorong ke neraka Jahanam dengan sekuat-kuatnya. \"(QS. Ath-Thur: 13) Maknanya: Mereka didorong, dalam ayat ini disebutkan dengan kata يُنْبَذُ [yunbadzu]artinya adalahdilemparkan ke huthomah. Huthomah adalah yang menghancurkan sesuatu. Maknanya: Yang meremukkan dan memecahkannya. Apakah al-Huthamah itu?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 4: Urusannya adalah tidak sebagaimana sangkaan orang yang celaka ini, yang mengumpulkan banyak harta dan perhitungan. Dan Allah bersumpah akan melemparkannya ke dalam neraka, dimana akan binasa setiap manusia yang di lemparkan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebut ‘Huthamah’ karena ia memecahkan segala sesuatu yang dilempar ke dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 4",
    "description": "Sekali-kali tidak! harta itu tidak akan menolak datangnya kematian kepadanya. Setelah mati dan dihisab atas perbuatan buruknya itu, pasti dia akan dilemparkan dan dicampakkan dengan hina ke dalam neraka hutamah oleh para malaikat zabaniah yang bengis, kasar, dan galak. 5. Dan tahukah kamu apakah neraka hutamah itu' demikian pertanyaan Allah guna menarik perhatian serius manusia terhadap apa yang disampaikan-Nya."
  }
]