[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tahukah kamu (wahai rasul), apa itu hakikat api neraka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Tahukah kamu -wahai Rasul- apakah Neraka yang menghancurkan segala yang dilemparkan ke dalamnya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Dan apa yang kamu ketahui tentang hakikat neraka yang menghancurkan setiap orang yang dimasukkan ke dalamnya ini?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "5-6. Allah Ta'ala berfirman: وَمَا أَدْرَاكَ مَا الْحُطَمَةُ \" Dan tahukah kamu apa Huthamah itu?\" Bentuk ungkapan kalimat ini bertuajuan pengagungan dan pembesaran. نَارُ اللَّهِ الْمُوقَدَةُ \"(yaitu) api neraka Allah yang dinyalakan,\" Inilah jawabannyayaitu: al-Huthomah adalah nerakan Allah yang dinyalakan, Allah Subhaanahu Wa Ta'ala menyandarkannya kepada diri-Nya, karena Allah mengazab dengannya orang yang berhak untuk mendapat asab. Ini adalah hukuman keadilan bukan hukuman kezaliman. Karena membakar dengan api bisa berupa kezaliman, bisa juga berupa keadilan, seperti mengazab orang-orang kafir dengan api neraka, tidak diragukan lagi hukuman ini adalah bentuk keadilan, dengannya Rabb 'Azza Wa Jalla dipuji, di mana Dia membalas orang-orang kafir dengan yang sesuai. Dan cermatilah firman Allah : الْحُطَمَةُ [Al-Huthomah] dengan perbuatan pelaku ini هُمَزَةٍ لُمَزَةٍ [Humazah lumazah]. Huthomah dan humazah lumazah dalam bentuk wazan yang serupa, agar gancarannya sebanding dengan perbuatan, sampai pada lafaz نَارُ اللَّهِ الْمُوقَدَةُ \"Neraka Allah yang dinyalakan\" maknanya: Dikobarkan dinyalakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Apakah kamu mengetahui apa itu Huthamah atau Neraka Jahanam? Pertanyaan ini untuk menakut-nakuti. Makna lainnya yaitu apa itu huthamah? Seakan akan hal itu asing bagi akal pikiran (mereka)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan apakah kamu tahu apa itu Huthamah}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-7. “Sekali-kali tidak! Sesungguhnya dia benar-benar akan dilemparkan,” yakni, akan dilemparkan, “Ke dalam Huthamah. Dan tahukah kamu apa Huthamah itu?” ini adalah ungkapan sebagai pengagungan kondisinya . Kemudian Allah menjelaskannya FirmanNya, “(Yaitu) api (yang disediakan) Allah yang dinyalakan,” yang bahan bakarnya adalah manusia dan bebatuan, “yang” karena dahsyatnya, “naik sampai ke hati,” yakni merasuk dari tubuh hingga ke hati."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan tahukah kamu apa neraka huthomah itu ?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 5: Allah berkata kepada Nabi-Nya Muhammad ﷺ : Apakah engkau tahu wahai Nabi Allah, akan hakikat neraka ini ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalimat ini untuk memperbesar perkaranya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 5",
    "description": "Dan tahukah kamu apakah neraka hutamah itu' demikian pertanyaan Allah guna menarik perhatian serius manusia terhadap apa yang disampaikan-Nya. 6. Hutamah ialah api azab Allah yang dinyalakan, ."
  }
]