[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Ia adalah api Allah yang menyala dan berkobar dahsyat, Yang karena sangat panasnya menembus tubuh hingga kedalam hati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Itulah Neraka Allah yang menyala-nyala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Itu merupakan api Allah yang menyala-nyala selamanya. Api ini dinisbahkan kepada Allah, karena dengannya Allah memberi siksaan, dan tidak ada yang dapat memberi azab dengan azab api neraka selain-Nya. itu merupakan azab yang adil, dan azab mereka setara dengan amal perbuatan mereka; karena mereka adalah orang-orang yang suka menghina, sedangkan hinaan dapat menghancurkan seseorang. Maka mereka mendapat balasan yang sesuai dengan amalan, bahkan dari sisi namanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ). Akhlaq yang buruk adalah racun yang membunuh, dan kebinasaan yang berbekas, juga kehinaan yang tersingkap, akhlaq yang buruk adalah kejahatan nampak, akhlaq yang buruk adalah syaithon-syaiton yang dijauhkan dari rahmat Tuhan semesta alam, akhlaq yang buruk dapat membawa tuannya kepada buruknya perilaku syaithon, dia juga yang akan membawa sesoang kepada pintu-pintu neraka . 2 ). { الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ } Maka ketika hati mereka dijadikan tempat keyakinan-keyakinan bathil, dan sumber ucapan-ucapan keji dan dengki terhadap orang-orang beriman, sesungguhnya mereka sedang menanti balasan yang akan mengancurkan dan membakar tubuh mereka dengan api neraka. 3 ). { إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ } Pintu-pintu neraka yang tertutup rapat tidak ada harapan sedikit pun bagi mereka untuk lolos, kesempatan bagi penghuni neraka untuk memohon perlindungan kepada Allah telah tiada, perhatikanlah jika seseorang berada dalam sebuah ruangan atau mobil, kemudian tanpa ia sadari tiba-tiba api menyala, dan tidak ada baginya jalan keluar untul meloloskan diri, bagaimana dengan keadaannya setelah itu ? , sungguh itu adalah kesialan yang tak terobati, dan Allah telah mengabarkan kepada hamba-hamba Nya tentang jalan keluar dari segala kesialan dan malapeta dunia dan akhirat, Allah mengirimkan kepada kita wahyunya melalui Nabi Muhammad tidak sekedar untuk dibaca, tetapi agar kita waspada dari sifat-sifat yang buruk yang dijelaskan dalam surah ini !."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. (Yaitu) Neraka Allah yang menyala-nyala sangat besar dan tidak akan pernah padam selamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) api Allah yang dinyalakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-7. “Sekali-kali tidak! Sesungguhnya dia benar-benar akan dilemparkan,” yakni, akan dilemparkan, “Ke dalam Huthamah. Dan tahukah kamu apa Huthamah itu?” ini adalah ungkapan sebagai pengagungan kondisinya . Kemudian Allah menjelaskannya FirmanNya, “(Yaitu) api (yang disediakan) Allah yang dinyalakan,” yang bahan bakarnya adalah manusia dan bebatuan, “yang” karena dahsyatnya, “naik sampai ke hati,” yakni merasuk dari tubuh hingga ke hati."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Neraka huthomah adalah nereka yang apinya telah dinyalakan sejak pertama kali diciptakan, api huthomah dinyalakan oleh Malaikat penjaga neraka, dan bahan bakar yang dipakai adalah dari tubuh-tubuh otrang kafir dan batu-batu yang besar, neraka huthomah yang diciptakan oleh Allah - عز وجل - dengan sendirinya, maka siapakah yang mampu untuk mematikan apinya ? tidak satupun yang mampu untuk melakukan hal itu, dan itu adalah perkara yang mustahil, walau sekalipun manusia seluruhnya saling menolong untuk memadamkan apai neraka sungguh hal itu tidak akan mampu mereka lakukan selamanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "5-6. Allah Ta'ala berfirman: وَمَا أَدْرَاكَ مَا الْحُطَمَةُ \" Dan tahukah kamu apa Huthamah itu?\" Bentuk ungkapan kalimat ini bertuajuan pengagungan dan pembesaran. نَارُ اللَّهِ الْمُوقَدَةُ \"(yaitu) api neraka Allah yang dinyalakan,\" Inilah jawabannyayaitu: al-Huthomah adalah nerakan Allah yang dinyalakan, Allah Subhaanahu Wa Ta'ala menyandarkannya kepada diri-Nya, karena Allah mengazab dengannya orang yang berhak untuk mendapat asab. Ini adalah hukuman keadilan bukan hukuman kezaliman. Karena membakar dengan api bisa berupa kezaliman, bisa juga berupa keadilan, seperti mengazab orang-orang kafir dengan api neraka, tidak diragukan lagi hukuman ini adalah bentuk keadilan, dengannya Rabb 'Azza Wa Jalla dipuji, di mana Dia membalas orang-orang kafir dengan yang sesuai. Dan cermatilah firman Allah : الْحُطَمَةُ [Al-Huthomah] dengan perbuatan pelaku ini هُمَزَةٍ لُمَزَةٍ [Humazah lumazah]. Huthomah dan humazah lumazah dalam bentuk wazan yang serupa, agar gancarannya sebanding dengan perbuatan, sampai pada lafaz نَارُ اللَّهِ الْمُوقَدَةُ \"Neraka Allah yang dinyalakan\" maknanya: Dikobarkan dinyalakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 6: Allah mesifatkan Al Huthamah dan menjelaskan bahwa maksudnya adalah neraka milik Allah yang menyambar-nyambar apinya, yang tidak redup selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang bahan bakarnya adalah manusia dan batu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 6",
    "description": "Hutamah ialah api azab Allah yang dinyalakan, 7. Yang panasnya menembus dada manusia sampai ke hati lalu membakarnya. Hati adalah organ yang paling sensitif terhadap rasa sakit dalam kadar kecil sekalipun, lalu bagaimana bila api neraka itu sampai membakarnya hingga lebur'."
  }
]