[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Ia adalah api Allah yang menyala dan berkobar dahsyat, Yang karena sangat panasnya menembus tubuh hingga kedalam hati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Yang membakar tubuh manusia hingga tembus ke jantung mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Api ini panasnya terasa sampai hati karena begitu panas; padahal hati berada di dalam dada yang terpisah dari kulit oleh beberapa lapisan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. الَّتِىۡ تَطَّلِعُ عَلَى الۡاَفۡـــِٕدَةِ ؕ‏ (yang (membakar) sampai ke hati) Yakni panasnya sampai ke hati dan meliputinya karena itu adalah tampat niat sesat dan buruk serta kesombongan dan penghinaan orang-orang baik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ). Akhlaq yang buruk adalah racun yang membunuh, dan kebinasaan yang berbekas, juga kehinaan yang tersingkap, akhlaq yang buruk adalah kejahatan nampak, akhlaq yang buruk adalah syaithon-syaiton yang dijauhkan dari rahmat Tuhan semesta alam, akhlaq yang buruk dapat membawa tuannya kepada buruknya perilaku syaithon, dia juga yang akan membawa sesoang kepada pintu-pintu neraka . 2 ). { الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ } Maka ketika hati mereka dijadikan tempat keyakinan-keyakinan bathil, dan sumber ucapan-ucapan keji dan dengki terhadap orang-orang beriman, sesungguhnya mereka sedang menanti balasan yang akan mengancurkan dan membakar tubuh mereka dengan api neraka. 3 ). { إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ } Pintu-pintu neraka yang tertutup rapat tidak ada harapan sedikit pun bagi mereka untuk lolos, kesempatan bagi penghuni neraka untuk memohon perlindungan kepada Allah telah tiada, perhatikanlah jika seseorang berada dalam sebuah ruangan atau mobil, kemudian tanpa ia sadari tiba-tiba api menyala, dan tidak ada baginya jalan keluar untul meloloskan diri, bagaimana dengan keadaannya setelah itu ? , sungguh itu adalah kesialan yang tak terobati, dan Allah telah mengabarkan kepada hamba-hamba Nya tentang jalan keluar dari segala kesialan dan malapeta dunia dan akhirat, Allah mengirimkan kepada kita wahyunya melalui Nabi Muhammad tidak sekedar untuk dibaca, tetapi agar kita waspada dari sifat-sifat yang buruk yang dijelaskan dalam surah ini !."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Neraka yang akan meninggi (masuk) di tengah-tengah hati atau sampai pada bagian hati yang terdalam dan membelenggunya. Kemudian hati itu melemah karena telah menjadi tempat keyakinan yang menyimpang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang (membakar) sampai ke hati} yang menembus dari badan menuju hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-7. “Sekali-kali tidak! Sesungguhnya dia benar-benar akan dilemparkan,” yakni, akan dilemparkan, “Ke dalam Huthamah. Dan tahukah kamu apa Huthamah itu?” ini adalah ungkapan sebagai pengagungan kondisinya . Kemudian Allah menjelaskannya FirmanNya, “(Yaitu) api (yang disediakan) Allah yang dinyalakan,” yang bahan bakarnya adalah manusia dan bebatuan, “yang” karena dahsyatnya, “naik sampai ke hati,” yakni merasuk dari tubuh hingga ke hati."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Panas api neraka dirasakan sampai kedalam hati manusia, bukan hanya kulit yang merasakan panasnya, sebagaimana apai dunia membakar kulit, panas api neraka mereka rasakan dengan sangat panas, api itu membakar tubuh mereka, akan tetapi mereka sebanrnya tidak mati dan tidak juga hidup, azab terus membantai mereka yang kafir kepada Allah ﷻ , Allah ﷻ berfirman : { ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ } ( Kemudian dia tidak akan mati di dalamnya dan tidak (pula) hidup ) [ Al-A'la : 3 ] ,"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ \" yang (membakar) sampai ke hati.\" الأَفْئِدَة [al-Af'idah] adalah bentuk jamak dari فُؤَاد [fu'ad] artinya adalah al-qalb (hati). Maknanya: Bahwa api neraka itu sampai ke hati wal'iyaadzu billaah, karena saking panasnya, padahal hati-hati terpendam dalam dada, antara hati dan kulit luar, ada yang bagian-bagian tubuh yang menghalanginya, tetapi walau demikian, api-api neraka itu sampai ke hati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 7: Allah menjelaskan bahwa neraka ini sangatlah dalam dan tertutup rapat untuk mereka (manusia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga rasa sakitnya demikian pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 7",
    "description": "Yang panasnya menembus dada manusia sampai ke hati lalu membakarnya. Hati adalah organ yang paling sensitif terhadap rasa sakit dalam kadar kecil sekalipun, lalu bagaimana bila api neraka itu sampai membakarnya hingga lebur'8. Sungguh, api itu ditutup rapat atas diri mereka yang suka mengumpat, mencela, mengumpul'kan harta, dan menghitung-hitungnya. Tidak ada celah sedikit pun yang memungkinkan udara dari luar merembes masuk. Akibatnya, kadar panas api itu tidak pernah turun, bahkan terus naik."
  }
]