[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Api neraka itu ditutup terhadap mereka, Dengan belunggu dan rantai yang panjang, agar mereka tidak keluar darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Sesungguhnya Neraka Huṭamah itu tertutup bagi orang-orang yang mendapatkan siksa di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Orang-orang yang suka menghina dan mengumpulkan harta serta enggan bersedekah ini akan memasuki neraka, dan pintu-pintunya akan ditutup rapat, tidak ada sedikitpun angin yang dapat masuk, dan mereka tidak ada harapan untuk keluar. Mereka terbolak-balik di dalamnya sambil terikat di rantai dan tiang yang panjang. Pintu-pintu ditutup dan mereka terikat, serta tidak akan terbuka bagi mereka satupun pintu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. اِنَّهَا عَلَيۡهِمۡ مُّؤۡصَدَةٌ (Sesungguhnya api itu ditutup rapat atas mereka) Yakni neraka itu tertutup pintu-pintunya, sehingga mereka tidak dapat keluar darinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ). Akhlaq yang buruk adalah racun yang membunuh, dan kebinasaan yang berbekas, juga kehinaan yang tersingkap, akhlaq yang buruk adalah kejahatan nampak, akhlaq yang buruk adalah syaithon-syaiton yang dijauhkan dari rahmat Tuhan semesta alam, akhlaq yang buruk dapat membawa tuannya kepada buruknya perilaku syaithon, dia juga yang akan membawa sesoang kepada pintu-pintu neraka . 2 ). { الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ } Maka ketika hati mereka dijadikan tempat keyakinan-keyakinan bathil, dan sumber ucapan-ucapan keji dan dengki terhadap orang-orang beriman, sesungguhnya mereka sedang menanti balasan yang akan mengancurkan dan membakar tubuh mereka dengan api neraka. 3 ). { إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ } Pintu-pintu neraka yang tertutup rapat tidak ada harapan sedikit pun bagi mereka untuk lolos, kesempatan bagi penghuni neraka untuk memohon perlindungan kepada Allah telah tiada, perhatikanlah jika seseorang berada dalam sebuah ruangan atau mobil, kemudian tanpa ia sadari tiba-tiba api menyala, dan tidak ada baginya jalan keluar untul meloloskan diri, bagaimana dengan keadaannya setelah itu ? , sungguh itu adalah kesialan yang tak terobati, dan Allah telah mengabarkan kepada hamba-hamba Nya tentang jalan keluar dari segala kesialan dan malapeta dunia dan akhirat, Allah mengirimkan kepada kita wahyunya melalui Nabi Muhammad tidak sekedar untuk dibaca, tetapi agar kita waspada dari sifat-sifat yang buruk yang dijelaskan dalam surah ini !."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8-9. Sesungguhnya neraka itu mengunci dan mengikat para penduduknya di tiang-tiang yang sangat panjang. Hal ini adalah untuk mengabarkan tentang kengeriannya (agar kita) dibebaskan dan tidak dimasukkan ke dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya api itu ditutup rapat atas mereka} ditutup rapat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. Bersamaan dengan dahsyatnya panas tersebut, mereka tertahan di dalamnya, mereka berputus asa untuk bisa keluar darinya. Karena itu Allah berfirman, “Sesungguhnya api itu ditutup rapat atas mereka,” yakni terkunci. “(Sedang mereka itu) diikat pada tiang-tiang,” di balik pintu, “yang panjang,” agar mereka tidak bisa keluar darinya. “Setiap kali mereka hendak keluar daripadanya, mereka dikembalikan ke dalamnya (QS.as-sajdah. 20) Semoga Allah melindungi kita dari yang demikian itu dan kita memohon semoga Allah memberikan ampunan dan keselamatan bagi kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yakni bila mereka semua telah berada di dalamnya, maka pintunya ditutup rapat. { مُؤْصَدَةٌ } Tertutup rapat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ \" Sesungguhnya api itu ditutup rapat atas mereka,\" Maknanya: Al-Huthomah, dialah neraka Allah yang dinyalakan. Maknanya: (dinyalakan) untuk Hammaz dan lammaz (orang yang gemar mencela dengan perbuatan dan lisannya) yang rakus terhadap harta, yang kikir enggan berbuat baik. Kata ganti di sini menggunakan jamak padahal kata asalnya tunggal secara makna. Ini dikerenakan لِكُلِّ هُمَزَةٍ لُمَزَةٍ Umum mencakup semua orang yang gemar mencela dengan perbuatan dan yang gemar mencela dengan lisan. مُؤْصَدَةٌ \"Tertutup\" maknanya adalah tertutup, pintu-pintunya tertutup, tidak ada harapan terbuka bagi mereka wal-'iyaadzu billaah: كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا أُعِيدُوا فِيهَا \" Setiap kali mereka hendak ke luar daripadanya, mereka dikembalikan (lagi) ke dalamnya \"(QS. As-Sajdah: 20) Maksudnya: mereka diangkat ke pintu-pintunya, sehingga mereka sangat ingin keluar, kemudian setelah itu mereka diputar dan dikembalikan ke dalamnya, ini semua karena saking kerasnya pengazaban. Karena manusia ia berkeinginan kuat untuk selamat, dan ia akan terbebas, selesai ia akan senang. Tapi ketika dikembalikan, itu akan menjadi tekanan baru, begitulah mereka diazab beserta hati-hati dan tubuh-tubuhnya. Siksaan penduduk neraka disebutkan secara rinci di dalam al-Quran al-Karim dan Hadits Nabi shallallaahu 'alaihi wa sallam. Amatilah sekarang ini, jika manusia di dalam ruangan, atau di dalam mobil, yang terbakar api di dalamnya, dan tidak ada ruangan berlindung, pintu-pintu tertutup rapat, apa yang akan terjadi? Ia dalam kesedihan yang mendalam, yang tidak ada bandingannya, begitulah kondisi mereka di neraka –wal'iyaadzu billaah-. Nereka tertutup rapat bagi mereka yang ada di dalam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 8: Allah menjelaskan bahwa neraka ini memiliki pintu yang beritingkat-tingkat bagi orang kafir, yang pintunya sangat tebal, yang manusia tidak dapat keluar darinya seorangpun. Kemudian Allah menjelaskan bahwa di pintu-pintu neraka terdapat dinding-dinding yang nampak jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 8",
    "description": "Sungguh, api itu ditutup rapat atas diri mereka yang suka mengumpat, mencela, mengumpul'kan harta, dan menghitung-hitungnya. Tidak ada celah sedikit pun yang memungkinkan udara dari luar merembes masuk. Akibatnya, kadar panas api itu tidak pernah turun, bahkan terus naik. 9. Para pendosa itu diikat dengan erat pada tiang-tiang yang panjang hingga mereka tidak dapat bergerak sedikit pun di hutamah itu, apa lagi keluar darinya."
  }
]