[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Api neraka itu ditutup terhadap mereka, Dengan belunggu dan rantai yang panjang, agar mereka tidak keluar darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dengan tiang yang panjang sehingga mereka tidak bisa keluar darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. فِىۡ عَمَدٍ مُّمَدَّدَةٍ ((sedang mereka itu) diikat pada tiang-tiang yang panjang) Yakni mereka terikat pada tiang-tiang panjang. Muqatil berpendapat: setelah pintu-pintu neraka ditutup, mereka akan diikat pada tiang besi; dan pintu itu tidak dibukakan bagi mereka tidak pula ada udara yang masuk kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8-9. Sesungguhnya neraka itu mengunci dan mengikat para penduduknya di tiang-tiang yang sangat panjang. Hal ini adalah untuk mengabarkan tentang kengeriannya (agar kita) dibebaskan dan tidak dimasukkan ke dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(mereka) diikat pada tiang-tiang yang panjang} pada tiang yang memanjang agar mereka tidak bisa keluar dari sana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. Bersamaan dengan dahsyatnya panas tersebut, mereka tertahan di dalamnya, mereka berputus asa untuk bisa keluar darinya. Karena itu Allah berfirman, “Sesungguhnya api itu ditutup rapat atas mereka,” yakni terkunci. “(Sedang mereka itu) diikat pada tiang-tiang,” di balik pintu, “yang panjang,” agar mereka tidak bisa keluar darinya. “Setiap kali mereka hendak keluar daripadanya, mereka dikembalikan ke dalamnya (QS.as-sajdah. 20) Semoga Allah melindungi kita dari yang demikian itu dan kita memohon semoga Allah memberikan ampunan dan keselamatan bagi kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Didalam neraka yang panas itu mereka akan didikat pada tiang-tiang yang panjang dan panas sehingga mereka tidak akan mampu lari dari tempat itu. Semua yang dijelaskan dalam surah ini adalah teguran dan peringatan kerasa bagi siapa yang suka mengumpulkan harta dan menyimpannya tanpa sadar bahwa ada kewajiban yang harus ia lakukan, yaitu mengeluarkan sebagian dari harta itu sebagai sedekah atau infaq atau zakat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فِي عَمَدٍ مُمَدَّدَةٍ \"(sedang mereka itu) diikat pada tiang-tiang yang panjang.\" Maknanya: Bahwa nereka ini tertutup rapa, dan dilindungi dengan tiang-tiang yang terbentang, terbentang ke semua sisinya dan pinggirnya, sehingga tidak ada seorang pun mampu membukanya dan keluar darinya. Allah Subhaanahu wa Ta'ala menceritakan ini kepada kita dan menjelaskannya kepada kita dalam surat ini, bukan sekedar dibaca dengan lisan-lisan kita, atau memahami maknanya dengan pemahaman-pemahaman kita, tetapi tujuannya adalah agar kita berhati-hati (dan menghindari) dari perangai-perangai buruk: mencela manusia, dengan ucapan atau dengan perbuatan, dan rakus terhadap harta, sampai sampai seolah-olam manusia diciptakan untuk harta, hidup selamanya untuk harta atau merasa harta menjadikannya kekal. Dan kita mengetahui bahwa siapa saja yang kondisinya demikan, maka balasannya adalah api neraka sebagaimana yang Allah sebutkan sifatnya, al-Huthomah (penghancur), menusuk ke hati, tertutup rapat dalam tiang-tiang yang membentang. Kita memohon kepada Allah Ta'ala, agar memberikan kepada kita karunia berupa keikhlasan dalam berkata dan berbuat, dan agar istiqomah di atas agamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Humazah ayat 9: Allah menjelaskan bahwa dinding ini dihamparkan sesuai dengan tingginya pintu neraka, yang akan menghalangi manusia untuk keluar dari neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan ‘dalam tiang-tiang yang panjang’ yakni tiang-tiang di balik pintu yang panjang, agar mereka tidak bisa keluar darinya. Kita berlindung kepada Allah Subhaanahu wa Ta'aala dari neraka dan meminta kepada-Nya ampunan dan ‘afiyah (penjagaan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Humazah Ayat 9",
    "description": "Para pendosa itu diikat dengan erat pada tiang-tiang yang panjang hingga mereka tidak dapat bergerak sedikit pun di hutamah itu, apa lagi keluar darinya. 1. Wahai nabi Muhammad atau siapa saja, tidakkah engkau perhatikan bagaimana tuhanmu telah bertindak terhadap tentara bergajah dengan menghancurkan mereka, yaitu tentara abrahah dari ethiopia yang hendak menghancurkan kakbah'."
  }
]