[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan tin dan zaitun,keduanya termasuk buah buahan yang masyhur, Allah bersumpah Juga dengan gunung thursina(Sinai)yang disana Allah berbicara kepada Musa alaihi salam secara langsung, Allah bersumpah Juga dengan negeri yang aman dari segala ketakutan (yaitu Makkah) tempat turunnya wahyu. Sungguh kami telah menciptakan manusia dalam bentuk yang terbaik, kemudian Kami mengembalikannya ke neraka bila dia tidak patuh kepada Allah dan tidak mengikuti para rasul. Akan tetapi orang-orang yang beriman dan beramal shalih, mereka mendapatkan pahala besar yang tidak terputus dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan buah tin dan tempat tumbuhnya, serta bersumpah dengan buah zaitun dan tempat tumbuhnya di negeri Palestina, tempat Nabi Isa -'alaihissalām- di utus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-4. Demi buah Tin yang dimakan, dan buah zaitun yang diperas minyaknya; keduanya adalah makanan yang bermanfaat bagi tubuh. Kemudian Allah bersumpah dengan gunung yang diberkati, tempat Allah berfirman kepada Musa, yaitu tempat yang suci. Lalu Allah bersumpah dengan negeri yang aman, Makkah, karena memiliki kedudukan dan kehormatan yang tinggi. Kemudian disebutkan isi dari sumpah ini: Sungguh Allah telah menciptakan manusia dengan sebaik-baik penciptaan, Dia menciptakannya dengan fitrah yang bersih, dan sesuai untuk menjalankan tugasnya. Penciptaannya sangat luar biasa dan menakjubkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالتِّينِ (Demi (buah) Tin) Allah bersumpah dengan buah tin yang biasa dimakan manusia. وَالزَّيْتُونِ(dan (buah) Zaitun) Yakni buah yang diambil minyaknya. Dua buah ini merupakan isyarat pada negeri Palestina yang merupakan negeri buah tin dan zaitun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Semuanya mengatakan (Imam Malik dan para pengarang Kutubus sittah) dari Bara’ bin ‘Azib berkata: ”Nabi SAW dalam shalatnya, di salah satu rakaat membaca surah At-Tin, dan tidak ada yang pernah mendengar suara paling indah dari bacaan beliau (selain dari itu)” 1. Aku bersumpah demi pohon Tin dan Zaitun, karena keduanya diberkahi. Jenis buah yang pertama dimakan oleh manusia dan jenis buah yang kedua mereka makan dan mereka peras untuk diambil minyaknya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi buah tin dan buah zaitun} Aku bersumpah demi buah tin yang kalian makan dan bersumpah demi buah zaitun yang kalian peras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. “Demi (buah) tin,” yaitu buah tin yang lazim dikenal dan juga “(buah) Zaitun.” Allah bersumpah dengan kedua pohon ini karena banyaknya manfaat pohon dan buahnya dan karena keduanya begitu dominan di negeri Syam tempat kenabian Nabi Isa putra Maryam. “Dan demi bukit Sinai,” yaitu Thursina, tempat kenabian Musa. “Dan demi kota ini yang aman,” yaitu Makkah al-Mukarramah, tempat kenabian Muhammad. Allah bersumpah dengan tempat-tempat suci ini yang Dia pilih dan dari tempat-tempat itu Allah mengutus nabi-nabi paling mulia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالتِّينِ } Allah ﷻ bersumpah dengan buah tin , buah yang terkenal ini dapat diambil untuk keperluan obat-obatan dan bebagai manfaat lainnya, { وَالزَّيْتُونِ } dan Allah juga bersumpah dengan buah zaitun, buah ini juga menganduk banyak manfaat yang digunakan oleh masyarakat luas di penjuru dunia, minyaknya banyak digunakan untuk pengobatan dan bahan makanan, pohonnya adalah pohon yang terdapat berkah didalamnya, Allah berfirman : { يُوقَدُ مِنْ شَجَرَةٍ مُبَارَكَةٍ زَيْتُونَةٍ } ( yang dinyalakan dengan minyak dari pohon yang berkahnya, (yaitu) pohon zaitun ) [ An Nur : 35 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالتِّينِ وَالزَّيْتُونِ (1) وَطُورِ سِينِينَ (2) وَهَذَا الْبَلَدِ الْأَمِينِ \"Demi (buah) Tin dan (buah) Zaitun, dan demi bukit Sinai, dan demi kota (Mekah) ini yang aman,\" Allah Ta'ala bersumpah dengan empat hal ini, buah tin, buah zaitun, bukit sinai dan negeri yang aman yaitu mekah, karena ini adalah surat yang diturunkan di mekah, maka maksudnya adalah negeri yang dekat adalah mekah. Tin adalah nama buah yang terkenal, zaitun juga terkenal, Allah bersumpah dengannya karena keduanya banyak di palestina. Bukit sinai, Allah bersumpah dengannya karena di sisi bukit itulah Allah berbicara dengan Musa shallallaahu 'alaihi wa sallam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tin ayat 1: 1-3. Allah memulai ayat ini dengan sumpah dengan buah tin dan buah zaitun, dan keduanya adalah pohon yang diberkahi, bermanfaat, dan terkenal di negeri Syam yang penuh keberkahan. Kemudian Allah bersumpah dengan gunung Thur dan ia adalah gunung yang diberkahi dimana Allah mengajak bicara Musa digunung ini. Kemudian Allah bersumpah dengan Mekkah negeri yang aman, yang termulia yang tersisa di atas bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan Tin menurut sebagian mufassir ialah tempat tinggal Nabi Nuh, yaitu Damaskus yang banyak pohon Tin; dan Zaitun ialah Baitul Maqdis yang banyak tumbuh pohon Zaitun. Allah Subhaanahu wa Ta'aala bersumpah dengan kedua pohon itu karena banyaknya manfaat pada pohon dan buahnya, dan karena biasa tumbuh di negeri Syam; negeri tempat kenabian Isa putera Maryam’alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tin Ayat 1",
    "description": "1-3. Demi buah tin dan zaitun, demi gunung sinai, dan demi negeri mekah yang aman ini. Buah tin dan zaitun banyak tumbuh di syam dan baitul makdis, tempat para nabi diutus, antara lain nabi isa. Gunung sinai adalah tempat nabi musa bermunajat, sedangkan mekah adalah tem'pat kelahiran dan pengutusan nabi Muhammad. Ketiga nabi ini memiliki misi yang sama, yaitu mengajak manusia menuju tauhid"
  }
]