[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan tin dan zaitun,keduanya termasuk buah buahan yang masyhur, Allah bersumpah Juga dengan gunung thursina(Sinai)yang disana Allah berbicara kepada Musa alaihi salam secara langsung, Allah bersumpah Juga dengan negeri yang aman dari segala ketakutan (yaitu Makkah) tempat turunnya wahyu. Sungguh kami telah menciptakan manusia dalam bentuk yang terbaik, kemudian Kami mengembalikannya ke neraka bila dia tidak patuh kepada Allah dan tidak mengikuti para rasul. Akan tetapi orang-orang yang beriman dan beramal shalih, mereka mendapatkan pahala besar yang tidak terputus dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan bersumpah dengan tanah haram Makkah, di mana orang orang yang memasukinya merasa aman, tempat diutus-Nya Nabi Muhammad -Ṣallallāhu 'alahi wasallam-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَهٰذَا الْبَلَدِ الْأَمِينِ (dan demi kota (Mekah) ini yang aman) Yakni kota Makkah yang merupakan kota yang aman. Seakan-akan Allah bersumpah dengan tiga tempat ini karena merupakan tempat turunnya wahyu kepada Musa, Isa, dan Muhammad, dan di sana diturunkan tiga kitab samawi, dan dari sana cahaya hidayah bagi manusia barasal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dan demi Makkah Al-Mukarramah yang dimuliakan oleh Allah dengan Ka’bahnya dan menjadikannya mulia dan aman bagi manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan demi negeri yang aman ini} Aku bersumpah demi Mekkah dimana manusia merasa aman di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. “Demi (buah) tin,” yaitu buah tin yang lazim dikenal dan juga “(buah) Zaitun.” Allah bersumpah dengan kedua pohon ini karena banyaknya manfaat pohon dan buahnya dan karena keduanya begitu dominan di negeri Syam tempat kenabian Nabi Isa putra Maryam. “Dan demi bukit Sinai,” yaitu Thursina, tempat kenabian Musa. “Dan demi kota ini yang aman,” yaitu Makkah al-Mukarramah, tempat kenabian Muhammad. Allah bersumpah dengan tempat-tempat suci ini yang Dia pilih dan dari tempat-tempat itu Allah mengutus nabi-nabi paling mulia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan demi kota yang aman ini, yaitu kota Makkah, kota ini disebut sebagai kota aman karena barangsiapa yang masuk kedalamnya akan aman, dan Allah lah yang menjadikan kota ini menjadi aman, Allah berfirman : { أَوَلَمْ نُمَكِّنْ لَهُمْ حَرَمًا آمِنًا } ( Dan apakah Kami tidak meneguhkan kedudukan mereka dalam daerah haram (tanah suci) yang aman ) [ Al-Qashash : 57 ] , dan Allah juga berfirman : { فِيهِ آيَاتٌ بَيِّنَاتٌ مَقَامُ إِبْرَاهِيمَ ۖ وَمَنْ دَخَلَهُ كَانَ آمِنًا ۗ} ( Padanya terdapat tanda-tanda yang nyata, (di antaranya) maqam Ibrahim; barangsiapa memasukinya (Baitullah itu) menjadi amanlah dia ) [ Ali Imran : 97 ] , bahkan pada zaman jahiliyah, penduduk kota pda waktu itu sering melakukan peperangan antar suku, akan tetapi ketika mereka memasuki wilayah al-haram seketika peperangan dihentikan, sampai suatu ketika seorang laki-laki menemukan sesorang membunuh ayahnya di wilayah al-haram laki-laki itu tidak berani memberikan perlawan kepada sang pembunuh sampai ia keluar dari wilayah itu, semua itu terjadi atas izin Allah ﷻ dan itu merupakan bagian dari ayat-ayat Nya. Ulama telah menyebutkan bahwasanya hikmah dikhususkannya beberapa tempat diatas dengan sumpah adalah merupakan tempat diutusnya Nabi-nabi. { و التين و الزيتون } Makasud dari ayat ini adalah Kota Syam, yang didalamnya terdapat \"baitul maqdis\" , dan merupakan tempat diutusnya Nabi Isa bin Maryam 'Alaihissala. { و طور سينين } Yaitu gunung yang diatasnya Allah ﷻ berbicara kepada Musa 'Alaihissalam tanpa perantara Malaikat Jibril. { و هذ البلد الأمين } Yakni Kota Makkah yang di utus kepadanya Nabi Muhammad ﷺ . Allah ﷻ mengkhusukan kota-kota itu dengan menyebutnya di surah ini dan bersumpah dengannya karena kota-kota itu adalah tempat diutusya Nabi-nabi yang tiga itu dari Ulul 'azmi : 'Isa bin Maryam dan Musa dan Muhammad semoga shalawat dikirimkan kepada mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَهَذَا الْبَلَدِ الْأَمِينِ \" dan demi kota (Mekah) ini yang aman\" Allah bersumpah dengan Mekah, karena Mekah adalah daerah yang paling Allah cintai dan paling mulia di sisi Allah 'Azza Wa Jalla. Sebagian ulama mengatakan: Allah bersumpah dengan tiga perkara ini karena yang pertama buah tin dan buah zaitun, adalah tanah palestina yang di dalamnya banyak diutus para nabi, dan Nabi terakhir Bani Israil adalah nabi Isa Bin Maryam 'alaihissholaatu wassalaam, lalu bersumpah dengan bukut sinai, karena itu adalah bukit tempat Allah Ta'ala menyampaikan wahyunya, sedangkan sumpah dengan negeri mekah, itu dikarenakan Allah mengutus di dalamnya nabi Muhammad shallallaahu 'alaihi wa sallam. Para Ulama mengakatakan: Arti dari bukit sinai adalah bukit yang berkah, karena Allah menyifatinya dan menyifati daerah di sekitarnya dengan lembah suci."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tin ayat 3: 1-3. Allah memulai ayat ini dengan sumpah dengan buah tin dan buah zaitun, dan keduanya adalah pohon yang diberkahi, bermanfaat, dan terkenal di negeri Syam yang penuh keberkahan. Kemudian Allah bersumpah dengan gunung Thur dan ia adalah gunung yang diberkahi dimana Allah mengajak bicara Musa digunung ini. Kemudian Allah bersumpah dengan Mekkah negeri yang aman, yang termulia yang tersisa di atas bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang merupakan negeri tempat kenabian Muhamad shallallahu 'alaihi wa sallam. Allah Subhaanahu wa Ta'aala bersumpah dengan tempat-tempat yang mulia tersebut yang dari sana dibangkitkan nabi-nabi yang utama dan mulia. Isi sumpahnya adalah apa yang disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tin Ayat 3",
    "description": "1-3. Demi buah tin dan zaitun, demi gunung sinai, dan demi negeri mekah yang aman ini. Buah tin dan zaitun banyak tumbuh di syam dan baitul makdis, tempat para nabi diutus, antara lain nabi isa. Gunung sinai adalah tempat nabi musa bermunajat, sedangkan mekah adalah tem'pat kelahiran dan pengutusan nabi Muhammad. Ketiga nabi ini memiliki misi yang sama, yaitu mengajak manusia menuju tauhid. 4. Sungguh, kami telah menciptakan manusia dalam bentuk fisik yang sebaik-baiknya, jauh lebih sempurna daripada hewan. Kami juga bekali mereka dengan akal dan sifat-sifat yang unggul. Dengan kelebihan-kelebihan itulah kami amanati manusia sebagai khalifah di bumi."
  }
]