[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan tin dan zaitun,keduanya termasuk buah buahan yang masyhur, Allah bersumpah Juga dengan gunung thursina(Sinai)yang disana Allah berbicara kepada Musa alaihi salam secara langsung, Allah bersumpah Juga dengan negeri yang aman dari segala ketakutan (yaitu Makkah) tempat turunnya wahyu. Sungguh kami telah menciptakan manusia dalam bentuk yang terbaik, kemudian Kami mengembalikannya ke neraka bila dia tidak patuh kepada Allah dan tidak mengikuti para rasul. Akan tetapi orang-orang yang beriman dan beramal shalih, mereka mendapatkan pahala besar yang tidak terputus dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sungguh Kami telah menciptakan manusia dengan sebaik-baik ciptaan dan seindah-indahnya rupa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. لَقَدْ خَلَقْنَا الْإِنسٰنَ فِىٓ أَحْسَنِ تَقْوِيمٍ (sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya) Allah menciptakannya dengan tubuh yang tegak, sehingga dapat memakan makanannnya dengan tangan; dan Allah menciptakannya dengan kemampuan memahami, berbicara, mengatur, dan berbuat bijak, sehingga memungkinkannya menjadi khalifah di muka bumi sebagaimana yang Allah kehendaki."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Siapapun yang dapat mentadabburi firman Allah : { لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ } dia tidak akan berani untuk menghinakan manusia ciptaan Allah, dan tidak pula ia akan menghinakan setiap makhluk ciptaan Allah yang dipuji oleh-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Sungguh kami telah menciptakan manusia dalam sebaik-baik susunan karena wujud dan bentuknya (yang baik). Kemudian kami kembalikan beberapa manusia, yaitu orang kafir, dan kami menjadikannya masuk ke dalam neraka. Ibnu Jarir dari Ibnu Abbas berkata: “Ayat ini turun pada kelompok yang memiliki umur pendek”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sungguh Kami benar-benar telah menciptakan manusia dalam bentuk yang sebaik-baiknya} sebaik-baik ciptaan dan sebagus-bagus bentuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Yang disumpahkan adalah FirmanNya, “Sungguh Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya,” yakni dalam bentuk ciptaan yang sempurna, bagian-bagian tubuh yang saling sesuai, tegak berdiri dan tidak kekurangan apa pun yang diperlukan secara lahir dan batin."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Jawaban dari sumpah-sumpah diatas adalah pada ayat ini, Allah ﷻ berfirman : { لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ } { لَقَدْ خَلَقْنَا الْإِنْسَانَ } Dan sungguh kami telah menciptakan diri manusia itu { فِي أَحْسَنِ تَقْوِيمٍ } pada bentuk yang paling sempurnya dan paling indah, bentuk ciptaan Allah ﷻ yang paling indah adalah bentuk tubuh manusia, yaitu makhluk yang paling indah dimuka bumi, keseimbangan bentuk, dan parasnya yang sangat indah, karena dari penciptaan manusia Allah ﷻ memiliki tujuan besar dan sangat mulia yaitu agar mereka mengkhususkan seluruh ibadah hanya kepada-Nya ﷻ , Allah ﷻ mnciptakan manusia hanya untuk beribadah kepda-Nya, Allah mencitakan mereka dengan bentuk yang sangat indah, berjalan dengan dua kaki yang seimbang, Allah ﷻ berfirman : { يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ , الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ , فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ } ( Hai manusia, apakah yang telah memperdayakan kamu (berbuat durhaka) terhadap Tuhanmu Yang Maha Pemurah , Yang telah menciptakan kamu lalu menyempurnakan kejadianmu dan menjadikan (susunan tubuh)mu seimbang , Dalam bentuk apa saja yang Dia kehendaki, Dia menyusun tubuhmu ) [ Al-Infitar : 6 - 9 ] . Allah ﷻ menganuferahkan kepada manusia bentuk yang indah ini; karena Allah ﷻ memiliki tujuan penting dari penciptaan itu, yaitu agar manusia mendirikan ibadah dimuka bumi ini hanya untuk Allah ﷻ , Allah memberikan mereka akal yang dengannya mereka mampu membedakan antara yang baik dan yang buruk, dan yang bermanfaat dan yang mencelakai, Allah ﷻ menganugerahkan kepada manusia bebeberapa keistimewaan yang tidak diberikan kepada makhluk lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ \" sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya.\" Inilah yang disumpah. Allah Ta'ala bersumpah bahwa Dia telah menciptakan manusia dengan bentuk terbaik, kalimat ini yang di dalamnya terdapat sumpah ditegaskan dengan tiga penegas, yaitu: dengan sumpah, lam taukid(penegas), dan قَد Qad, Allah bersumoah bahwa Dia telah menciptakan manusia dengan sebaik baik bentuk dan rupa, secara fitrah dan tujuannya, karena tidak ada satu makhluk pun yang lebih bagus bentuknya dari anak-anak Adam. Bentuk makhluk-makhluk di muka bumi seluruhnya tidak sebaik anak-anak Adam, karena Allah Ta'ala berfirman: لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ \" sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya.\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tin ayat 4: Datang jawaban atas sumpah yang menjelaskan di dalamnya bahwa Allah lah yang menciptakan manusia dalam bentuk yang pertama kali, dan memiliki bentuk yang sempurna, dan dihiasi dengan akal, lisan, dan kelebihannya atas kebanyakan makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sempurna dan seimbang fisiknya serta sesuai letak anggota badannya. Namun sayang, nikmat yang besar ini tidak disyukuri oleh kebanyakan manusia. Kebanyakan mereka berpaling dari sikap syukur, sibuk dengan permainan dan yang melalaikan, dan lebih senang dengan perkara yang hina dan rendah, sehingga Allah Subhaanahu wa Ta'aala mengembalikan mereka ke tempat yang paling rendah, yaitu neraka yang merupakan tempat para pelaku maksiat yang durhaka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tin Ayat 4",
    "description": "Sungguh, kami telah menciptakan manusia dalam bentuk fisik yang sebaik-baiknya, jauh lebih sempurna daripada hewan. Kami juga bekali mereka dengan akal dan sifat-sifat yang unggul. Dengan kelebihan-kelebihan itulah kami amanati manusia sebagai khalifah di bumi. 5. Kemudian kami kembalikan dia ke tempat yang serendah-rendahnya, yaitu ke neraka, bila mereka durhaka kepada Allah dan tidak menaati utusan-Nya. Ketika itu, kesempurnaan fisik, akal, dan sifat mereka tidak akan menyelamatkannya dari azab Allah."
  }
]