[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan tin dan zaitun,keduanya termasuk buah buahan yang masyhur, Allah bersumpah Juga dengan gunung thursina(Sinai)yang disana Allah berbicara kepada Musa alaihi salam secara langsung, Allah bersumpah Juga dengan negeri yang aman dari segala ketakutan (yaitu Makkah) tempat turunnya wahyu. Sungguh kami telah menciptakan manusia dalam bentuk yang terbaik, kemudian Kami mengembalikannya ke neraka bila dia tidak patuh kepada Allah dan tidak mengikuti para rasul. Akan tetapi orang-orang yang beriman dan beramal shalih, mereka mendapatkan pahala besar yang tidak terputus dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Kemudian Kami kembalikan fisiknya menjadi tua dan pikun di dunia sehingga tak dapat memanfaatkan jasadnya sebagaimana ia tak dapat mengambil manfaat bila fitrahnya rusak dan masuk neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Akan tetapi manusia akan terjatuh ke dalam jurang neraka Jahannam jika dia tidak mengikuti jalan petunjuk. Dan Allah menyebutkan (سافلين) dengan kata jamak, karena yang dimaksud adalah seluruh manusia. Mereka -dengan kepercayaan yang sesat- telah merubah fitrah mereka dan meyakini batu dan waktu sebagai tuhan. Kemudian terdapat pengecualian bagi sebagian mereka, yaitu kecuali orang-orang yang beriman dan beramal shalih; mereka akan mendapatkan pahala yang tidak terputus sebagai balasan atas ketaatan mereka. Sesungguhnya manusia akan tetap di atas fitrahnya yang lurus sebagaimana ketika dia diciptakan, akan tetapi dia akan terjerumus ke dalam jurang neraka akibat kesesatannya. Adapun orang-orang beriman dan beramal shalih tidak termasuk dari mereka, sebab orang-orang beriman ini masih tetap di atas fitrahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. ثُمَّ رَدَدْنٰهُ أَسْفَلَ سٰفِلِينَ (Kemudian Kami kembalikan dia ke tempat yang serendah-rendahnya (neraka)) Yakni Kami kembalikan ke usia yang paling buruk, yaitu ke usia tua dan lemah setelah sebelumnya dalam masa muda dan kekuatan. Pendapat lain mengatakan: yakni manusia yang diciptakan Allah dalam keadaan dan rupa yang paling baik, dijauhkan dari segala kejelekan makhluk lain. Dan diciptakan Allah dalam keadaan yang paling buruk, karena ia dikembalikan ke derajat yang paling rendah, yaitu di inti kerak neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Sungguh kami telah menciptakan manusia dalam sebaik-baik susunan karena wujud dan bentuknya (yang baik). Kemudian kami kembalikan beberapa manusia, yaitu orang kafir, dan kami menjadikannya masuk ke dalam neraka. Ibnu Jarir dari Ibnu Abbas berkata: “Ayat ini turun pada kelompok yang memiliki umur pendek”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian kami mengembalikan dia ke tempat yang paling rendah} mengembalikan ke usia tua yaitu usia paling lemah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Tapi meski dikaruniai berbagai nikmat agung ini yang seharusnya disyukuri, kebanyakan manusia menyimpang, tidak mensyukuri Dzat yang memberi nikmat tersebut, justru sibuk dengan senda gurau dan bermain-main. Mereka merelakan dirinya dengan hal-hal rendahan dan akhlak tercela, hingga Allah menghempaskan mereka “ke tempat yang serendah-rendahnya (neraka),” yakni neraka paling bawah tempat para pendurhaka yang membangkang Rabb mereka, kecuali orang yang diberi anugerah keimanan dan amal shalih serta akhlak mulia lagi luhur oleh Allah, “maka bagi mereka,” dengan posisi-posisi tinggi itu ada “pahala yang tiada putus-putusnya,” yakni tidak berhenti bahkan kelezatan berlimpah, kebahagiaan terus menerus, dan nikmat yang amat banyak dalam keabadian yang tiada akhir, dan nikmat yang tidak berubah, buah dan naungannya kekal."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ ثُمَّ رَدَدْنَاهُ } Kemudian kami kembalikan mereka { أَسْفَلَ سَافِلِينَ } untuk makna kata ini ada dua penafsiran, yang pertama adalah : ditujukan kepada seluruh ummat manusia, kami ganti paras mereka dengan penuaan dan umur yang semakin tua, jika hal ini terjadi, maka ketampanan mereka akan hilang, akal yang semakin menurun kualitasnya, sebagaimana yang Allah ﷻ katakan : { وَمِنْكُمْ مَنْ يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْ لَا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئًا } ( dan di antara kamu ada yang dikembalikan kepada umur yang paling lemah (pikun), supaya dia tidak mengetahui lagi sesuatupun yang pernah diketahuinya. ) [ An-Nahl : 70 ] . Dan makna yang kedua adalah : untuk orang kafir, yakni kami akan mengembalikan orang-orang kafir yang berbuat maksiat itu ketempat yang paling rendah dineraka, yaitu sebagai balasan untuk mereka, dan makna inlah yang paling tetap untuk penafsiran ayat ini, dengan landasan firman Allah ﷻ pada ayat selanjutnya : { إلا الذين آمنوا } ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman-Nya: ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ \" Kemudian Kami kembalikan dia ke keadaan serendah-rendahnya,\" Pengembalian yang Allah 'Azza Wa Jalla sebutkan ini maksudnya: Bahwa Allah Ta'ala mengembalikan mansia ke dalam kondisi terendah secara bentuk ciptaan, sebagaimana Allah Ta'ala berfirman: وَمِنْكُمْ مَنْ يُرَدُّ إِلَى أَرْذَلِ الْعُمُرِ \" dan di antara kamu ada yang dikembalikan kepada umur yang paling lemah\" setiap kali usia bertambah maka tubuhnya akan bertambah lemah, secara tampak akan terlihat lemaah, dan dari kecerahan wajah pun demikian akan kembali ke kondiisi lemah. Jika kita katakan: Keadaan terbaik mencakup banyak hal, hingga kondisi fitrah yang Allah ciptakan manusia dengannya, dan ibadah yang dibangun di atas fitrah pun demikian, ini adalah isyarat bahwa sebagian manusia ada yang keadaannya kembali kepada keadaan terendah setelah ia berada di puncak tertinggi keimanan dan kailmuan, ayat ini mencakup kedua makna semuanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tin ayat 5: Allah menjelaskan sesungguhnya Ia setelah menyebutkan kesempurnaan manusia dan gagah, kemudian akibat setelah itu manusia akan menuju ke dalam neraka jika tidak menjalankan perintah-Nya dari keimanan kepada Allah, iman kepada hari akhir dan beribadah kepada Allah saja tanpa menyekutukan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada pula yang menafsirkan dengan masa tua, pikun dan lemah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tin Ayat 5",
    "description": "Kemudian kami kembalikan dia ke tempat yang serendah-rendahnya, yaitu ke neraka, bila mereka durhaka kepada Allah dan tidak menaati utusan-Nya. Ketika itu, kesempurnaan fisik, akal, dan sifat mereka tidak akan menyelamatkannya dari azab Allah. 6. Kami masukkan manusia ke neraka, kecuali orang-orang yang benar-benar beriman dan mengerjakan kebajikan, baik spiritual maupun sosial, secara ikhlas dan sesuai syariat islam; maka mereka akan mendapat pahala yang tidak ada putus-putusnya dan tidak pula berkurang. Kami selamatkan mereka dari neraka dan kami berikan itu semua kepada mereka sebagai ganjaran dari kami."
  }
]