[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan tin dan zaitun,keduanya termasuk buah buahan yang masyhur, Allah bersumpah Juga dengan gunung thursina(Sinai)yang disana Allah berbicara kepada Musa alaihi salam secara langsung, Allah bersumpah Juga dengan negeri yang aman dari segala ketakutan (yaitu Makkah) tempat turunnya wahyu. Sungguh kami telah menciptakan manusia dalam bentuk yang terbaik, kemudian Kami mengembalikannya ke neraka bila dia tidak patuh kepada Allah dan tidak mengikuti para rasul. Akan tetapi orang-orang yang beriman dan beramal shalih, mereka mendapatkan pahala besar yang tidak terputus dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Kecuali orang yang beriman kepada Allah dan melakukan amal saleh, maka meskipun jasadnya menua, bagi mereka balasan yang kekal, tidak terputus, yaitu Surga karena mereka menyucikan fitrahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِلَّا الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ (kecuali orang-orang yang beriman dan mengerjakan amal saleh) Maka mereka ini tidak dikembalikan ke derajat yang paling rendah, namun ke surga Allah yang sangat luas di illiyyin. فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ(maka bagi mereka pahala yang tiada putus-putusnya) Yakni mereka mendapatkan balasan atas ketaatan mereka dengan balasan yang kekal dan tak terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Akan tetapi orang-orang beriman kepada Allah dan rasul-rasulnya dan mengerjakan apa yang diperintahkan olehNya, maka bagi mereka pahala akhirat selama-lamanya dan terus melekat pada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali orang-orang yang beriman dan beramal shalih. Maka bagi mereka pahala yang tidak putus-putusnya} tidak terputus-putus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Tapi meski dikaruniai berbagai nikmat agung ini yang seharusnya disyukuri, kebanyakan manusia menyimpang, tidak mensyukuri Dzat yang memberi nikmat tersebut, justru sibuk dengan senda gurau dan bermain-main. Mereka merelakan dirinya dengan hal-hal rendahan dan akhlak tercela, hingga Allah menghempaskan mereka “ke tempat yang serendah-rendahnya (neraka),” yakni neraka paling bawah tempat para pendurhaka yang membangkang Rabb mereka, kecuali orang yang diberi anugerah keimanan dan amal shalih serta akhlak mulia lagi luhur oleh Allah, “maka bagi mereka,” dengan posisi-posisi tinggi itu ada “pahala yang tiada putus-putusnya,” yakni tidak berhenti bahkan kelezatan berlimpah, kebahagiaan terus menerus, dan nikmat yang amat banyak dalam keabadian yang tiada akhir, dan nikmat yang tidak berubah, buah dan naungannya kekal."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِلَّا الَّذِينَ آمَنُوا } Kecuali orang-orang yang beriman kepada Allah ﷻ tuhan mereka, dan pencipta mereka, { وَعَمِلُوا الصَّالِحَاتِ } dan mengerjakan amal shalih, dan amal shalih adalah bagian dari keimanan, maka iman sesorang tidak sempurna tanpa adanya amal shalih, akan tetapi penyebutan amal shalih sering dikhusukan penyebutannya setelah iman karena keutamaan dari amal shalih itu sendiri, sama halnya dengan firman Allah : { حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَىٰ وَقُومُوا لِلَّهِ قَانِتِينَ } ( Peliharalah semua shalat(mu), dan (peliharalah) shalat wusthaa. Berdirilah untuk Allah (dalam shalatmu) dengan khusyu’ ) [ Al-Baqarah : 238 ] disebutkan dalam ayat secara khusus \"shalat wustha\" yakni shalat asar, Allah mengkhususkan penyebutannya karena keutamaan yang ada pad shalat asar . { فَلَهُمْ أَجْرٌ } Maka bagi mereka balasan disisi Allah ﷻ , yang tidak satupun mengetahui seberapa besar dan bagaimana wujud balasan itu, dan balasan itu tergantung amalan yang mereka kerjakan didunia. { غَيْرُ مَمْنُونٍ } Yakni balasan yang tidak pernah terputus selamanya, melainkan balasan dan ganjaran yang terus menerus bertambah sepanjang masa, karena balasan bagi orang beriman di akhirat tidak pernah terputus, sebagaimana balasan bagi orang kafir yang juga tidak akan pernah terputus."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta'ala berfirman: إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ \" kecuali orang-orang yang beriman dan mengerjakan amal saleh; maka bagi mereka pahala yang tiada putus-putusnya.\" ini adalah pengecualian dari firman-Nya ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ \" Kemudian Kami kembalikan dia ke tempat yang serendah-rendahnya \" Maksudnya: Kecuali orang-orang yang beriman dan yang beramal amalan-amalan saleh mereka tidak akan dikembalikan ke keadaan terendah, karena mereka berpegang kepada keimanan dan amalan-amalan mereka, mereka terus demikian sampai mereka wafat. فَلَهُمْ أَجْرٌ \"Bagi mereka ajrun\" ajrun adalah pahala غَيْرُ مَمْنُونٍ tidak terputus, dan dicela juga, karena kalimat mamnun bisa dimaknai terputus bisa juga dimaknai dicela. Mereka memperoleh pahala yang tidak terputus juga dicela, maksudnya jika mereka memperoleh pahala tersebut, tidak akan dicela dengan dikatakan kepada mereka: Kami telah memberikan kalian ini, kami sudah berbuat baik ini dan itu (kepada kalian). Meskipun sebenarnya karunia semuanya milik Allah yang mereka peroleh berupa keimanan, amal saleh dan pahala, semuanya adalah karunia Allah tetapi Allah tidak menyakiti kalian dengan umpatan, sebagaimana ini terjadi di urusan-urusan dunia, jika ada seseorang yang berbuat baik kepada anda barangkali ia akan menyakiti anda dengan umpatannya di setiap kesempatan ia mengatakan: Saya sudah berjasa padamu, saya sudah memberimu ini dan ucapan semisalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tin ayat 6: Dikecualikan atas akibat yang buruk ini, dari mereka yang beriman kepada Allah, hari akhir, beramal dengan amalan-amalan shalih dan mereka yang mensyukuri atas nikmat Allah; Dan dengan sebab keimanan mereka dan beramal dengan amalan shalih, maka sungguh mereka akan mendapatkan balasan yang terus menerus tanpa terputus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka memperoleh kenikmatan yang penuh, kegembiraan yang berturut-turut, kesenangan yang banyak selama-lamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tin Ayat 6",
    "description": "Kami masukkan manusia ke neraka, kecuali orang-orang yang benar-benar beriman dan mengerjakan kebajikan, baik spiritual maupun sosial, secara ikhlas dan sesuai syariat islam; maka mereka akan mendapat pahala yang tidak ada putus-putusnya dan tidak pula berkurang. Kami selamatkan mereka dari neraka dan kami berikan itu semua kepada mereka sebagai ganjaran dari kami. 7. Allah menciptakanmu dengan bentuk yang sempurna dari setetes mani yang menjadi janin, kemudian melewati berbagai tahap dari bayi, remaja, dewasa, tua, hingga meninggal. Itu merupakan dalil yang paling jelas tentang kekuasaan Allah; bahwa dia kuasa untuk membang'kitkanmu dari kematian. Maka, apa yang menyebabkan mereka mendustakanmu tentang hari pembalasan yaitu hari kiamat setelah adanya keterangan-keterangan yang gamblang itu'."
  }
]