[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang membuatmu (wahai manusia) mendustakan kebangkitan dan pembalasan padahal bukti-bukti yang menunjukan kuasa Allah atasnya sangat jelas?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Maka apa yang menjadikanmu -wahai manusia- mendustakan Hari Pembalasan setelah kamu melihat langsung sebagian dari tanda-tanda kekuasaan-Nya yang banyak?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hai orang kafir, jika kamu telah mengetahui Allah menciptakan kalian dengan sempurna, namun akan memasukkanmu ke dalam jurang neraka; maka apa yang menjadikanmu mendustakan hari kebangkitan dan pembalasan, serta perjumpaan dengan Tuhan semesta alam, padahal bukti-bukti mengenai itu sangat jelas?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ(Maka apakah yang menyebabkan kamu mendustakan (hari) pembalasan sesudah (adanya keterangan-keterangan) itu?) Hai Manusia, jika kamu telah mengatahui bahwa Allah telah menciptakanmu dengan penciptaan yang terbaik, dan bisa jadi akan mengembalikanmu ke derajat yang paling rendah, lalu apa yang mendorongmu untuk mendustakan hari kebangkitan dan pembalasan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Maka apa yang membuatmu mendustakan hari kiamat wahai manusia setelah (datang) dalil yang sangat jelas ini tentang kekuasaan Allah atas risalahNya? Maksudnya adalah apa yang membuatmu mendustakan risalah itu tanpa sebab?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka apa yang membuatmu mendustakan hari pembalasan} kebangkitan dan hisab {setelah itu} wahai manusia, apa yang membuatmu mendustakannya setelah datang dalil ini kepadamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “Maka apakah yang menyebabkan kamu mendustakan (hari) pembalasan sesudah (adanya keterangan-keterangan) itu?” yakni apa yang membuatmu mendustakan adanya Hari Pembalasan amal perbuatan wahai manusia? Engkau telah melihat banyak tanda-tanda kebesaran Allah yang membuatmu yakin dan berbagai nikmatNya yang mengharuskanmu agar tidak mengkufurinya sedikit pun. “Bukankah Allah adalah Hakim yang paling adil?” lantas patutkah hikmahNya mengharuskanNya meninggalkan manusia sia-sia, tidak diperintah, dilarang, diberi pahala dan siksa? Ataukah Yang menciptakan manusia dalam berbagai tahap, memberi mereka berbagai nikmat, kebajikan, dan kebaikan yang tidak terkira, merawat mereka dengan baik pasti mengembalikan mereka ke negeri keabadian dan tujuan mereka yang mereka tuju dan ikuti?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَمَا يُكَذِّبُكَ } Maka apakah yang membuatmu berdusta wahai manusia { بَعْدُ } setelah kamu mengetahui ayat-ayat Allah ﷻ yang mengaskan tentang hari kiamat, dan ayat-ayat Allah ﷻ yang memaparkan tentang kenikmatan-Nya yang begitu besar kepada hamba-hamba Nya. { بِالدِّينِ } Yakni hari pembalasan hari kiamat, apakah yang menjadi penyebat sehingga kamu mendustakan hari pembalasan padahal kamu telah mengetahui ayat-ayat Allah yang menjelaskan tetang peristiwa itu ? , apakah kamu ragu akan kuasa Allah ﷻ yang menciptakan kamu dan alam ini dari sesuatu yang tidak berwujud menjadi ada, bukankah untuk mengembalikan penciptaan itu setelah kehancurannya pada hari kiamat akan lebih mudah bagi-Nya ? , Allah ﷻ berfirman : { وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ ۚ وَلَهُ الْمَثَلُ الْأَعْلَىٰ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ } ( Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya. Dan bagi-Nya-lah sifat yang Maha Tinggi di langit dan di bumi; dan Dialah Yang Maha Perkasa lagi Maha Bijaksana. ) [ Ar-Rum : 28 ] , segala sesuatu bagi-Nya sangatlah mudah untuk diwujudkan, maha suci Allah dengan segala kekuasasn-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Tabaraka wa Ta'ala berfirman: فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ \" Maka apakah yang menyebabkan kamu mendustakan (hari) pembalasan sesudah (adanya keterangan-keterangan) itu?\" Allah beralih pembicaran dari bentuk berbicara dengan orang ketiga kepada pembicaraan kepada orang kedua (langsung dengan lawan bicara), Allah berfirman فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ \"\" Maknanya: Apa lagi penyebab kamu mendustakan wahai manusia setelah penjelasan ini, بِالدِّينِ \"dengan ad-diin (agama)\" maknanya: Terhadap apa-apa yang Allah perintahkan dari agama. Oleh karenanya setiap kali manusia melihat kepada asal usulnya dan permulaan penciptaannya, dan Allah memilihnya dan membaguskan fitrahnya, maka keimanannya kepada Allah 'Azza Wa Jalla akan bertambah, begitu juga pembenarannya terhadap kitab-Nya dan terhadap berita-berita yang disampaikan rasul-Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tin ayat 7: Setelah petunjuk-petunjuk dan bukti-bukti yang jelas, maka apa yang menjadikanmu wahai manusia untuk mendustakan Allah, hari akhir, hari pembalasan dan hisab ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni setelah mereka tahu bahwa manusia diciptakan Allah dalam bentuk yang sebaik-baiknya, lalu dikembalikan-Nya kepada keadaan yang paling rendah dimana pada semua itu terdapat dalil yang menunjukkan bahwa Allah Subhaanahu wa Ta'aala berkuasa membangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tin Ayat 7",
    "description": "Allah menciptakanmu dengan bentuk yang sempurna dari setetes mani yang menjadi janin, kemudian melewati berbagai tahap dari bayi, remaja, dewasa, tua, hingga meninggal. Itu merupakan dalil yang paling jelas tentang kekuasaan Allah; bahwa dia kuasa untuk membang'kitkanmu dari kematian. Maka, apa yang menyebabkan mereka mendustakanmu tentang hari pembalasan yaitu hari kiamat setelah adanya keterangan-keterangan yang gamblang itu'8. Bukankah Allah adalah hakim yang paling adil' jangan kaukira Allah menciptakan manusia secara sia-sia dengan tidak memberinya perintah dan larangan. Allah telah menurunkan aturan syariat. Dia akan memberi putusan dengan adil; memberi pahala kepada orang yang taat dan menghukum orang yang bersalah."
  }
]