[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukankah Allah yang menetapkan hari tersebut sebagai hari penetapan keputusan diantara manusia dengan pemberian keputusan hukum yang paling bijaksana dalam segala apa yang dia ciptakan? tentu,apakah manusia dibiarkan begitu saja,tidak diperintah dan tidak dilarang,tidak diberi pahala dan tidak dihukum? hal itu tidak benar dan tidak mungkin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Bukankah Allah -dengan menjadikan hari Kiamat sebagai Hari Pembalasan- adalah Hakim yang paling bijaksana dan paling adil? Apakah masuk akal bahwa Allah meninggalkan hamba-hamba-Nya begitu saja tanpa mengadili di antara mereka, dengan membalas orang yang baik karena kebaikannya dan membalas orang jahat karena kejahatannya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Sungguh Allah adalah sebaik-baik yang menetapkan dan mengatur segala hal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَلَيْسَ اللَّـهُ بِأَحْكَمِ الْحٰكِمِينَ (Bukankah Allah Hakim yang seadil-adilnya?) Yakni paling bijaksana dan paling adil dalam memutuskan perkara. Karena Dia telah membaguskan penciptaan manusia, kemudia Dia akan menghempaskan orang kafir ke dalam kerak neraka, dan Dia akan mengangkat derajat orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Ayat ini merupakan sebuah ketetapan yang terkandung dalam surah ini, seperti pembuktian kenabian Muhammad, juga pembuktian Tauhid, dan pembuktian bahwa hari berbangkit itu nyata, dan ketetapan-Nya yang mencakup perlindungan-Nya kepada Rasul-Nya dari orang-orang yang mendustakannya adalah dengan hujjah yang nyata dihadapan mereka. 2 ) . Apakah termasuk hikmah bahwa Allah menciptakan manusia begitu saja tanpa ada perintah dan larangan ( syari'at ) yang ditetapkan kepada mereka, dan tidak pula mereka mendapat balasan atau azab dari apa yang mereka kerjakan ? ataukah sang pencipta yang telah menciptakan manusia dengan beberapa tingkatan, dan telah melimpahkan kepada mereka kenikmatan dan berbagai kebaikan yang tidak mampu dihitung oleh mereka harus mengembalikan mereka ketempat tinggal yang menjadi tujuan yang sebenarnya ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Bukankah Allah adalah seadil-adil Hakim dalam menentukan, mengadili dan menata (sesuatu)? Tirmidzi mengatakan dari Abu Hurairah yang memberi anjuran: “Jika salah satu kalian membaca {Wat Tiini waz Zaitun} dan sampai pada ayat terakhir {Alaisallaahu bi Ahkamil haakimin} maka selayaknya dia mengucapkan “Balaa, wa ana ‘ala dzalika minasy syahidiin” (benar, dan atas hal itu aku termasuk orang-orang yang bersaksi)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Allah adalah hakim yang paling adil}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “Maka apakah yang menyebabkan kamu mendustakan (hari) pembalasan sesudah (adanya keterangan-keterangan) itu?” yakni apa yang membuatmu mendustakan adanya Hari Pembalasan amal perbuatan wahai manusia? Engkau telah melihat banyak tanda-tanda kebesaran Allah yang membuatmu yakin dan berbagai nikmatNya yang mengharuskanmu agar tidak mengkufurinya sedikit pun. “Bukankah Allah adalah Hakim yang paling adil?” lantas patutkah hikmahNya mengharuskanNya meninggalkan manusia sia-sia, tidak diperintah, dilarang, diberi pahala dan siksa? Ataukah Yang menciptakan manusia dalam berbagai tahap, memberi mereka berbagai nikmat, kebajikan, dan kebaikan yang tidak terkira, merawat mereka dengan baik pasti mengembalikan mereka ke negeri keabadian dan tujuan mereka yang mereka tuju dan ikuti?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ } Bukankah Allah Hakim yang seadil-adilnya ? Ini adalah bantahan lain untuk mereka yang mendustakan hari pembalasan, dan yang sebelumnya adalah permulaan, yang menjelaskan bahwa mengulangi penciptaan seperti semula adalah sangat mudah bagi Allah. { أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ } Dan hikmah dari ketetapan Allah untuk mewujudkan hari kebangkitan dan hari perhitungan; agar mereka yang berbuat zholim terhadap diri mereka sendiri dengan menghabiskan waktunya dalam kekafiran dan kemusyrikan, kemudian selesai dan tidak dihisab, dan tidak pula diberikan balasan, sungguh hal itu tidak sesuai dengan hikmah kekuasaan Allah ﷻ , begitupun dengan orang mukmin yang menghabiskan masa hidupnya dengan keimanan dan ibadah serta ketaqwaan kepada Allah ﷻ , apakah setelah mereka mati maka urusannya telah selesai, dan tidak dibangkitkan kembali kemudian diberi ganjaran atas amalan mereka, hal ini sangat bertolak belakang dengan kebijaksaan Allah ﷻ yang menciptakan manusia untuk beribadah hanya kepada-Nya. Maka mereka yang mengingkari hari kebangkitan telah menantang kekuasaan Allah ﷻ . Dialah Allah ﷻ sebaik-baiknya hakim, sungguh sangat tidak pantas dengan keadilan yang Dia miliki meninggalkan hamba-Nya yang beramal shalih atau kemaksiatan didunia kemudian mereka akan musnah setelah mati dan tidak dihisab, semua ini tidak sesuai dengan hikmah dan kasih sayang Allah ﷻ , karena perkara ini adalah kemustahilan yang harus disingkirkan dari sifat-Nya ﷻ , Allah ﷻ berfirman : { أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ , فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ ۖ لَا إِلَٰهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْكَرِيمِ } ( Maka apakah kamu mengira, bahwa sesungguhnya Kami menciptakan kamu secara main-main (saja), dan bahwa kamu tidak akan dikembalikan kepada Kami? , Maka Maha Tinggi Allah, Raja Yang Sebenarnya; tidak ada Tuhan selain Dia, Tuhan (Yang mempunyai) ‘Arsy yang mulia ) [ Al-Mukminun : 115 - 116 ] . Kemudian jika seandainya kematian adalah akhir dari kehidupan manusia selamanya tanpa adanya pembalasan atas amalan mereka, maka kedudukan mukmin dan adalah sama, tetapi hal ini jauh dari hikmah penciptaan manusia dan perintah syariat ibadah, Allah ﷻ berfirman : { أَفَنَجْعَلُ الْمُسْلِمِينَ كَالْمُجْرِمِينَ , مَا لَكُمْ كَيْفَ تَحْكُمُونَ } ( Maka apakah patut Kami menjadikan orang-orang Islam itu sama dengan orang-orang yang berdosa (orang kafir)? , Atau adakah kamu (berbuat demikian): bagaimanakah kamu mengambil keputusan? ) [ AL-Qalam : 35-36 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ \"\"Ini adalah pertanyaan yang tujuannya taqrir (menetapkan), Allah mengikrarkan bahwa Dialah hakim yang paling bijaksana, kata ahkam di sini adalah isim tafdhil, yang diambil dari kata al-hikmah dan al-hukmu. Hukum yang terbesar dan teragung, yang tidak dipertentangkan dengan sesuatu pun adalah hukum Allah 'Azza Wa Jalla, dan kebijaksanaan tertinggi adalah kebijaksanaan Allah 'Azza Wa Jalla. Dialah subhaanahu wa Ta'ala yang Maha Bijaksana secara ketentuan taqdir dan secara aturan syari'at. Milik-Nyalah ketentuan hukum dan kepada-Nya semua urusan akan kembali. Kita memohon kepada Allah Ta'ala agar memberikan kapada kita ilmu tentang kitab-Nya dan tentang sunnah Rasul-Nya shallallaahu 'alaihi wa sallam, sesungguhnya Allah Mahakuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tin ayat 8: Allah tutup surat ini dengan pertanyaan yang menjelaskan bahwa Ia yang menentukan hukum dan yang menghukumi dan yang adil dan mengadili. Dan kami katakana : Benar, kami sungguh menjadi saksi, dan dengan adanya urusan yang demikian bukankah sudah menjadi kewajiban (manusia) ikhlas beribadah kepada-Nya saja dan mengikuti Rasul-Nya ﷺ ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bukankah hikmah (kebijaksanaan)-Nya menghendaki untuk tidak membiarkan makhluk ciptaan-Nya begitu saja tanpa diperintah dan tanpa dilarang serta tanpa diberikan balasan? Bukankah Allah Subhaanahu wa Ta'aala yang menciptakan manusia secara bertahap dan mengirimkan berbagai kenikmatan yang tidak dapat mereka jumlahkan serta mengurus mereka dengan pengurusan yang sebaik-baiknya pasti akan mengembalikan mereka ke tempat terakhir mereka menetap? Dan bukankah Allah Subhaanahu wa Ta'aala hakim yang paling adil dan tidak pernah berbuat zalim kepada seorang pun? Ya, benar kami menjadi saksi terhadap hal itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tin Ayat 8",
    "description": "Bukankah Allah adalah hakim yang paling adil' jangan kaukira Allah menciptakan manusia secara sia-sia dengan tidak memberinya perintah dan larangan. Allah telah menurunkan aturan syariat. Dia akan memberi putusan dengan adil; memberi pahala kepada orang yang taat dan menghukum orang yang bersalah. 1. Wahai nabi, bacalah apa yang Allah wahyukan kepadamu dengan terlebih dahulu menyebut nama tuhanmu yang menciptakan segala sesuatu dengan keesaan-Nya."
  }
]