[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Wahai Nabi, apabila kalian (kamu dan orang-orang yang beriman) hendak mentalak para istri kalian, maka talaklah mereka saat mereka bisa menghadapi iddah mereka (yaitu di masa suci di mana mereka belum digauli atau saat hamil dengan kehamilan yang jelas). Jagalah iddah agar kalian mengetahui waktu rujuk manakala kalian ingin merujuk mereka. Takutlah kepada Allah, Tuhan kalian, jangan mengeluarkan para istri yang ditalak dari rumah yang mereka tinggal padanya hingga masa iddah mereka selesai, yaitu tiga kali haid untuk selain anak-anak yang belum haid, wanita tua yang menopause dan wanita hamil, mereka juga tidak boleh keluar darinya, kecuali bila mereka melakukan perbuatan mungkar yang nyata seperti zina. Itu adalah hukum-hukum Allah yang Dia syariatkan bagi hamba-hambaNya. Barangsiapa melanggar hukum-hukum Allah, maka dia telah menzhalimi dirinya sendiri dan menjerumuskannya ke dalam kebinasaan. Kamu (wahai suami yang mentalak) tidak tahu, bisa jadi sesudah talak yang kamu jatuhkan itu, Allah menjadikan sesuatu yang tidak kamu duga, sehingga kamu merujuk istrimu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai Nabi! Jika engkau atau salah seorang dari umatmu ingin menalak istrinya maka hendaklah ia menalaknya pada awal iddahnya, dengan menalaknya pada saat sedang suci dan belum disetubuhi. Dan jagalah iddah untuk memastikan kapan kalian bisa rujuk dengan istri-istri kalian jika kalian berkehendak untuk rujuk. Bertakwalah kepada Rabb kalian dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya. Dan janganlah kalian mengusir wanita-wanita yang kalian talak dari rumah-rumah tempat tinggal mereka dan janganlah mereka minggat sampai tuntas iddah mereka, kecuali apabila mereka melakukan suatu perbuatan nista yang nyata seperti berzina. Hukum-hukum itu adalah batasan-batasan Allah yang ditentukan oleh Allah untuk hamba-hamba-Nya. Barangsiapa melanggar batasan-batasan Allah maka ia telah menganiaya dirinya sendiri karena berarti menjerumuskan dirinya pada sumber-sumber kehancuran disebabkan kemaksiatannya terhadap Rabbnya. Kamu -wahai orang yang menalak- tidak tahu bisa jadi Allah setelah itu menumbuhkan rasa cinta di hati sang suami sehingga merujuk istrinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah berfirman kepada Rasulullah dengan menyebutkan kemuliaan kenabian, untuk menjelaskan hak-hak wanita dalam perkara perceraian, agar dilaksanakan olehnhya dan orang-orang beriman: Jika kalian bertekat untuk mencerai istri kalian, maka ceraikanlah ketika mereka dalam keadaan tidak berhaid dan tidak digauli; hitunglah masa iddah mereka dan bertakwalah kepada Allah dengan mentaati hukum-hukum-Nya. Janganlah kalian mengeluarkan mereka dari rumah yang mereka tinggali hingga selesai masa iddah mereka selama tiga kali masa suci atau tiga kali masa haid sesuai dengan kemaslahatan kedua belah pihak. Dan istri-istri itu juga tidak boleh keluar dari rumah itu, kecuali jika mereka terjerumus dalam perbuatan zina, maka mereka harus dikeluarkan darinya untuk menjalani hukuman had. Demikianlah hukum-hukum Allah yang berkedudukan tinggi; barangsiapa yang menyelisihi hukum-hukum ini maka dia telah menzalimi diri sendiri karena telah memasukkannya ke dalam ancaman siksaan dari Allah. Hai orang yang mencerai istrinya, mudah-mudahan Allah menetapkan rujuk kepadanya setalak kamu mentalaknya. Diriwayatkan dari Abdullah bin Mas’ud: (يٰۤاَيُّهَا النَّبِىُّ اِذَا طَلَّقۡتُمُ النِّسَآءَ فَطَلِّقُوۡهُنَّ لِعِدَّتِهِنَّ) yakni ketika istri dalam keadaan suci tanpa dipergauli. (Diriwayatkan oleh at-Thabari, dan dishahihkan oleh al-Hafizh Ibnu Hajar dalam Fath al-Bari 9/346)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا النَّبِىُّ إِذَا طَلَّقْتُمُ النِّسَآءَ (Hai Nabi, apabila kamu menceraikan isteri-isterimu) Pertama-tama Allah menyeru Rasulullah sebagai penghormatan baginya, kemudian Allah menyampaikan firman-Nya kepada umatnya. Yakni jika kalian hendak menceraikan istri kalian. فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ(maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) iddahnya) Yakni ketika mereka dapat menghadapi iddah mereka atau sebelum iddah mereka. Dan yang dimaksud adalah menceraikan mereka saat mereka tidak dalam keadaan haidh dan tidak pada waktu jima’, lalu mereka dibiarkan menyelesaikan masa iddahnya. Jika para suami itu menceraikan mereka dengan cara seperti ini maka mereka telah menceraikan istri mereka saat isrti itu dapat menjalankan masa iddah. Imam Bukhari, Muslim, dan lainnya meriwayatkan dari Ibnu Umar bahwa ia menceraikan istrinya pada saat ia sedang haidh. Lalu Umar menceritakan kejadian ini kepada Rasulullah, maka Rasulullah marah dan berkata: “Hendaklah ia rujuk dengannya kemudian melanjutkan hubungan nikahnya sampai ia selesai dari haidhnya, lalu menunggu sampai ia haidh lagi dan selesai dari haidh itu, kemudian jika setelah itu ia masih ingin mencerainya maka hendaklah ia mencerainya ketika ia tidak dalam keadaan haidh dan sebelum ia menggaulinya. Dan itulah waktu iddah yang dimaksud Allah ketika suami hendak mencerai istrinya. وَأَحْصُوا۟ الْعِدَّةَ ۖ( dan hitunglah waktu iddah itu) Yakni tunggulah istri itu dan perhatikanlah waktu perceraiannya hingga iddahnya selesai, yaitu selama tiga kali haidh. Perintah ini ditujukan bagi para suami. وَاتَّقُوا۟ اللَّـهَ رَبَّكُمْ ۖ( serta bertakwalah kepada Allah Tuhanmu) Maka janganlah melanggar perintah-Nya, dan janganlah kalian memberikan mudharat kepada para istri. لَا تُخْرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ(Janganlah kamu keluarkan mereka dari rumah mereka) Yakni rumah yang ia tinggali ketika diceraikan, selama ia masih dalam masa iddah. Allah menyebut rumah itu dengan sebutan rumah para istri untuk menekankan hak mereka untuk tinggal di rumah tersebut selama masa iddah. Dan Allah melarang para istri untuk keluar dari rumah itu, dengan firman-Nya: وَلَا يَخْرُجْنَ(dan janganlah mereka keluar) Yakni janganlah mereka keluar dari rumah itu selama ia masih menjalani masa iddah, kecuali untuk hal darurat yang mengharuskannya untuk keluar. إِلَّآ أَن يَأْتِينَ بِفٰحِشَةٍ مُّبَيِّنَةٍ ۚ( kecuali mereka mengerjakan perbuatan keji yang terang) Yakni janganlah kalian mengeluarkan mereka dari rumah itu kecuali jika mereka melakukan zina. Pendapat lain mengatakan: yakni jika mereka mengucapkan kata-kata keji kepada orang yang tinggal bersama mereka di rumah tersebut. وَتِلْكَ حُدُودُ اللَّـهِ ۚ( Itulah hukum-hukum Allah) Yakni hukum-hukum yang Allah jelaskan pada hamba-hamba-Nya ini adalah batas-batas yang Allah tetapkan bagi mereka, tidak ada seorangpun yang boleh melanggar batas-batas itu. وَمَن يَتَعَدَّ حُدُودَ اللَّـهِ فَقَدْ ظَلَمَ نَفْسَهُۥ ۚ( dan barangsiapa yang melanggar hukum-hukum Allah, maka sesungguhnya dia telah berbuat zalim terhadap dirinya sendiri) Karena telah menjerumuskan dirinya kedalam kebinasaan. لَا تَدْرِى لَعَلَّ اللَّـهَ يُحْدِثُ بَعْدَ ذٰلِكَ أَمْرًا(Kamu tidak mengetahui barangkali Allah mengadakan sesudah itu sesuatu hal yang baru) Yakni barangkali jika ia tetap tinggal di rumah itu kelak Allah akan menyatukan kembali hati mereka, sehingga sang suami dapat merujuk istrinya kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. {Yaa Ayyuhan Nabiy} – yang dimaksud adalah umatnya karena beliau adalah pemimpin umatnya – Jika kalian ingin menalak istri kalian, maka talaklah mereka saat mereka menghadapi masa iddahnya, yaitu dalam keadaan suci dan tidak dalam keadaan jima’. Perhitungkanlah dan jagalah masa iddah itu, agar sempurna mencapai 3 kali suci, yaitu masa haid atau masa suci dari haid (Lamaran itu hanya berlaku bagi para suami) Taatlah kalian kepada Allah dalam melaksanakan perintahNya dan menjauhi laranganNya. Jangan kalian suruh mereka keluar dari rumah yang mereka tempati ketika perceraian itu terjadi sampai datang masa iddahnya. Mereka juga tidak boleh keluar dari rumah itu selama masih pada masa iddah kecuali saat keadaan darurat, di antaranya kalian tidak mampu menahan melakukan zina atau pemaksaan misalnya, Maka kalian harus mengeluarkan mereka untuk mendirikan batas antara kalian dengan mereka atau agar terbebas dari sesuatu yang vulgar yang ada pada mereka dan agar mereka terbebas dari berlama-lama dengan suami atau keluarga suami. Hukum-hukum yang disebutkan itu adalah hukum Allah dan syari’atNya untuk hamba-hambaNya. Barangsiapa melampaui batas hukum-hukum Allah, maka sungguh dia telah menzalimi dirinya sendiri dengan membahayakan diri agar dihukum dengan cara menolak hukum Allah tersebut, Wahai orang yang melakukan talak, kalian tidak menyadari bahwa barangkali Allah menciptakan sesuatu yang baru (untuk kalian) setelah talak itu, yaitu penyesalan dan keinginan untuk ruju’ dengan istri kalian setelah talak itu selama masih dalam masa iddah. Atau melakukan akad nikah baru setelah selesai masa iddah atau talak ba’in. Dorongan untuk melakukan ruju’ ini apabila hanya melakukan talak satu. Ibnu Abu Hatim, Ibnu Jarir dan Ibnu Mundzir dari Anas berkata: “Rasulallah SAW menceraikan Hafsah, lalu dia kembali ke keluarganya, kemudian Allah menurunkan ayat {Yaa ayyuhan nabiyyu idzaa thallaqtumun nisaa’a ..}” Kemudian dikatakanlah kepada beliau: “Ruju’lah dengannya! Sesungguhnya dia adalah perempuan yang banyak puasanya dan shalatnya, dia juga merupakan salah satu di antara istri-istrimu di surga”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, apabila kamu menceraikan} apabila kamu hendak menceraikan {istri-istrimu, maka hendaklah menceraikan mereka pada waktu mereka dapat (menghadapi) iddahnya} pada waktu iddah mereka, yaitu masa suci dimana tidak ada kegiatan jima’ {dan hitunglah} catatlah {waktu idah itu, serta bertakwalah kepada Allah Tuhanmu. Janganlah mengeluarkan mereka dari rumahnya dan janganlah mereka keluar kecuali jika mereka mengerjakan perbuatan keji yang jelas} maksiat yang ingkar lagi jelas, seperti zina {Itulah hukum-hukum Allah. Siapa saja melanggar} melanggar {hukum-hukum Allah, maka sungguh dia telah berbuat zalim terhadap dirinya sendiri. Kamu tidak mengetahui boleh jadi setelah itu Allah mengadakan suatu ketentuan yang baru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman mengajak bicara Nabi Muhammad dan kaum Mukminin, “hai Nabi, apabila kamu menceraikan istri-istrimu,” maksudnya jika engkau ingin menceraikan mereka, “maka,” carilah alasan syari ketika mencerai mereka, jangan langsung mencerai hanya disebabkan tidak mengindahkan perintah Allah, tapi “hendaklah kamu menceraikan mereka pada waktu mereka dapat (menghadapi) iddahnya,” maksudnya pada waktu iddah mereka, yaitu dengan cara menceraikan istri ketika ia sedang suci dan belum dicampuri selama masa suci itu. Talak inilah yang iddahnya dapat diketahui dengan jelas. Lain halnya ketika dicerai pada waktu haid. Haid tersebut tidak terhitung dalam masa talak sehingga masa iddahnya memanjang karenanya. Begitu juga jika dicerai ketika istri sedang suci namun sudah dicampuri, sebab dimungkinkan istrinya hamil. Di samping itu tidak jelas dari manakah ia mulai masa iddah. Dan Allah memerintahkan untuk menghitung masa iddah. Patokannya adalah haid jika wanita yang dicerai dalam keadaan haid. Karena menghitung iddah dalam masa itu merupakan penunaian hak Allah, hak suami yang menceraikan, hak lelaki lain yang akan menikahinya, hak wanita yang bercerai untuk mendapatkan nafkah dan hak-hak lainnya. Jika iddahnya telah diketahui secara pasti, maka keadaannya juga bisa diketahui, serta hak-hak yang akan didapatkan si wanita yang dicerai serta apa yang akan didapatkan dari mantan suaminya. Perintah untuk menghitung iddah ini ditujukan pada suami dan istri jika memang termasuk mukallaf (sudah terbebani kewajiban beribadah), jika belum baligh, maka yang bertugas menghitung iddah adalah walinya. Allah berfirman, “Serta bertakwalah kepada Allah, Rabbmu,” di segala urusan kalian dan takutlah padaNya dalam hak istri yang dicerai. Maka “janganlah kamu keluarkan mereka dari rumah mereka,” selama masa iddah, tapi biarkan ia berada di rumah tempat suaminya menceraikannya. “Dan janganlah mereka (diizinkan) keluar,” maksudnya, mereka tidak boleh keluar dari rumahnya. Berkaitan dengan larangan mengeluarkan wanita yang dicerai dari rumahnya, karena hak menempati merupakan kewajiban yang harus ditanggung suami hingga masa iddahnya selesai. Hak menempati rumah merupakan salah satu dari beberapa haknya. Sedangkan larangan bagi wanita yang dicerai untuk keluar rumah adalah karena hal itu menyia-nyiakan hak suami dan tidak adanya tanggung jawab pihak suami. Larangan untuk memgeluarkan istri yang dicerai dari rumah dan larangan bagi istri yang dicerai keluar rumah ini berlaku hingga masa iddah selesai. “Kecuali kalau mereka mengerjakan perbuatan keji yang terang.” Maksudnya, dengan sesuatu yang tercela dan jelas yang mengharuskannya untuk diusir karena keberadaannya di dalam rumah menimbulkan dampak berbahaya bagi keluarga seperti mengeluarkan kata-kata dan perbuatan keji. Dalam kondisi seperti ini, suami dibolehkan mengusir istri yang dicerai itu karena dia sendirilah yang menyebabkannya diusir. Adapun tujuan dari penempatan istri yang dicerai di dalam rumah suami yang menceraikannya selama masa iddah adalah sebagai pelipur lara dan sebagai tindakan lemah lembut baginya. Dia sendirilah yang menimbulkan dampak berbahaya bagi dirinya sendiri. Hukum ini berlaku bagi wanita yang cerai raj’I (yang boleh rujuk) selama masa iddah. Adapun wanita yang dicerai ba’in (yang tidak boleh rujuk), maka tidak ada hak tinggal yang wajib. Karena hak tinggal itu berkaitan dengan hak nafkah. Dan nafkah itu hanya wajib diberikan pada wanita yang dicerai raj’I buka ba’in. “Itulah hukum –hukum Allah,” yang ditentukan pada hamba-hambaNya, disyariatkan untuk mereka, diperintahkan agar dilaksanakan dan diindahkan. “Dan barangsiapa yang melanggar hukum-hukum Allah,” dengan tidak diindahkan tapi malah diterjang atau tidak ditunaikan secara baik, “maka sungguh dia telah berbuat zhalim terhadap dirinya sendiri.” Merugikan haknya dan menyia-nyiakan bagiannya dengan tidak menuruti hukum-hukum Allah yang merupakan kebaikan dunia akhirat. “Kamu tidak mengetahui, barangkali Allah mengadakan sesudah itu sesuatu hal yang baru.” Maksudnya, Allah mensyariatkan iddah dan membatasi talak dengan iddah tersebut karena beberapa hikmah besar, • di antaranya agar Allah memberikan rasa kasih sayang dan cinta dalam hati suami yang menceraikan istrinya sehingga ia menarik kembali talaknya kemudian melanjutkan lagi kehidupan bersama. Hal ini bisa terjadi selama masa iddah. Atau bisa jadi karena si suami mentalaknya karena suatu sebab kemudia sebab itu hilang selama masa iddah kemudian rujuk kembali, karena sebab talak sudah tidak ada. • Di antara hikmah iddah lainnya adalah diketahuinya kekosongan rahim istri yang dicerai dari bibit suaminya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 1: Allah menujukan firman-Nya kepada Nabi-Nya Muhammad ﷺ dengan memuliakannya dan agar diperintahkan kepada umatnya. Allah berkata : Jika engkau telah berniat wahai Nabi, engkau maupun siapapun dari umatmu untuk mentalak salah satu dari istri-istrinya, maka talaklah mereka dengan mengetahui masa iddah ke depannya, dengan syarat mentalaknya dalam kondisi suci, belum engkau jima’i mereka, atau dalam kondisi hamil yang tidak ragu lagi. Dan wajib bagimu untuk menjaga hari yang engkau pada saat itu mentalakknya, agar tahu akhir dari masa iddah mereka, dan itu ada dalam 3 tahapan waktu. Atau suci yang ketiga, bukan maksudnya kesucian yang jatuh padanya talak ketika wanita sedang haid. Dan takutlah kalian pada Allah dengan mengerjakan apa yang diperintahkan-Nya dan menjauhi larangan-Nya. Ketahuilah bahwa Allah tidak membolehkan kalian mengeluarkan mereka dari tempat tinggal mereka; Karena masih terikat dengan hukum sebagai istri selama masa iddah belum berakhir, sebagaimana juga dilarang secara mutlak para istri (yang telah ditalak) keluar dari rumah mereka yang mereka hidup di dalamnya bersama-sama dengan kalian sebelum jatuh talak; Kecuali jika mereka berbuat dengan amalan yang buruk semisal zina sebagaimana menurut para jumhur ulama, adapun Abu Hanifah berpendapat karena kekurang ajaran mulut mereka yang buruk. Ketahuilah oleh kalian bahwa yang telah disebutkan adalah hukum-hukum Allah dan syariat-Nya untuk kalian, maka tidak halal bagi kalian melanggarnya. Maka jika ada yang melanggarnya sungguh dirinya termasuk orang yang celaka dan terjatuh dalam kondisi yang buruk. Dan wajik bagi kalian secara mutlak untuk mengerjakan apa yang Allah perintahkan kepada kalian dari hukum-hukum yang telah disebutkan, dan wajib untuk mencari kebaikan antara diri kalian dan istri-istri kalian; Karena sungguh kalian tidaklah mmengetahui kalau-kalau Allah menjadikan setelah talak yang Dia tidak setujui sehingga kalian kembali lagi bersama istri kalian (ruju’); Karena sesungguhnya Allah membolak-balikkan hati, dan mungkin membalikkan karena sebab cinta maka dijadikanlah kalian untuk ruju’. Karena talak adalah pemutus tali dan diperbolehkan dalam pernikahan. Dan tidak diragukan lagi bahwa itu semua adalah sesuatu yang dibenci namun diperbolehkan di sisi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman kepada Nabi dan kaum mukmin. Janganlah segera mentalak ketika ada sebabnya tanpa memperhatikan perintah Allah sebagaimana diterangkan dalam lanjutan ayat ini. Maksudnya, istri-istri itu hendaklah ditalak diwaktu suci sebelum dicampuri. Jika ditalak dalam keadaan haidh, maka ia tidak menghitung dengan haidh yang dijatuhkan talak ketika itu dan masa ‘iddahnya semakin lama karenanya, demikian pula jika mentalaknya dalam keadaan suci yang telah dijima’i, maka tidak aman terhadap kehamilannya sehingga tidak jelas dengan iddah yang mana yang harus ia jalani. Yakni hitunglah dengan haidh jika wanita itu haidh atau dengan bulan jika ia tidak haidh dan tidak hamil, yang di antara manfaatnya adalah agar kamu dapat merujuknya sebelum habisnya. Menghitungnya terdapat pemenuhan terhadap hak Allah, hak suami yang menalak, hak orang yang akan menikahinya setelahnya dan hak wanita dalam hal nafkah dsb. Jika ‘iddahnya telah dihitung, maka keadaannya dapat diketahui, kewajiban yang wajib dipenuhinya serta haknya juga diketahui. Perintah menghitung masa ‘iddah ini tertuju kepada suami dan kepada istrinya jika istrinya mukallaf (sudah baligh dan berakal), jika belum maka tertuju kepada walinya. Yakni taatilah perintah-Nya dan jauhilah larangan-Nya dalam semua urusan serta takutlah kepada-Nya dalam hal hak istri yang ditalak. Selama masa ‘iddah, bahkan mereka (kaum wanita) harus tetap di rumah suaminya yang mentalaknya. Yakni mereka tidak boleh keluar dari rumah itu. Larangan mengeluarkannya adalah karena tempat tinggal wajib ditanggung suami untuk istrinya agar ia menyempurnakan ‘iddahnya di rumah itu yang menjadi salah satu haknya. Di samping itu, keluarnya istri dapat menyia-nyiakan hak suami dan tidak menjaganya. Larangan mengeluarkan istri dari rumah ini berlangsung terus sampai sempurna ‘iddahnya. Yang dimaksud dengan perbuatan keji di sini ialah mengerjakan perbuatan-perbuatan pidana seperti zina sehingga ia keluar untuk ditegakkan had terhadapnya, atau berkelakuan tidak sopan terhadap mertua, ipar, dan sebagainya yang layak untuk dikeluarkan seperti menyakiti dengan kata-kata dan perbuatan. Termasuk pula apabila seorang wanita bersikap nusyuz (durhaka) kepada suaminya. Dalam kondisi seperti ini, mereka boleh dikeluarkan karena ia yang menyebabkan dirinya berhak dikeluarkan. Memberikan tempat tinggal ini apabila talaknya talak raj’i (masih bisa rujuk), adapun dalam talak ba’in, maka istri tidak berhak mendapatkan tempat tinggal, karena tempat tinggal mengikuti nafkah, sedangkan nafkah wajib diberikan kepada wanita yang ditalak raj’i, bukan dilatak ba’in. Yang telah ditetapkan dan disyariatkan-Nya kepada hamba-hamba-Nya serta diperintahkan-Nya mereka untuk tetap memperhatikannya. Dengan menyia-nyiakannya keberuntungan yang diperolehnya jika mengikuti hukum-hukum Allah, yaitu kebaikan di dunia dan akhirat. Suatu hal yang baru maksudnya keinginan dari suami untuk rujuk kembali apabila talaknya baru dijatuhkan sekali atau dua kali. Ini adalah salah sau hikmah disyariatkannya ‘iddah. Hikmah lainnya adalah bahwa masa ‘iddah adalah masa menunggu untuk diketahui kosong rahimnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 1",
    "description": "Pada akhir surah at-tag'bun, Allah memberitahukan bahwa istri dan anak bisa jadi musuh; dan Allah memerintahkan agar bersikap baik dan pemaaf kepada mereka. Pada ayat ini diterangkan bahwa di antara suami istri bisa terjadi perceraian, namun Allah mengingatkan nabi tentang hukum dan etika perceraian dalam islam. Wahai nabi! apabila kamu menceraikan istri-istrimu, perbuatan halal, tetapi paling tidak disukai Allah, maka hendaklah kamu ceraikan mereka atau salah seorang di antara mereka pada waktu mereka dapat menghadapi idahnya dengan tidak memberatkan, yaitu ketika masa suci dari haid agar tidak lama menunggu untuk bisa menikah lagi dengan laki-laki lain. Dan hitunglah waktu idah itu dengan cermat kapan mulainya dan kapan berakhir; serta bertakwalah, kamu semua, kepada Allah tuhanmu dalam segala urusan. Janganlah kamu keluarkan mereka, istri yang dijatuhi talak itu selama masa idah, dari rumah yang ditempati-Nya dan janganlah mereka diizinkan keluar secara bebas kecuali jika mereka mengerjakan perbuatan keji yang jelas seperti berzina. Itulah hukum-hukum Allah yang harus dilaksanakan manusia. Dan barang siapa melanggar hukum-hukum Allah secara sengaja atau karena lalai, maka sungguh dia telah berbuat zalim terhadap dirinya sendiri, karena merugikan dirinya, sedangkan ia tetap harus mempertanggungjawabkannya di hadapan Allah. Kamu tidak mengetahui, wahai nabi, rencana Allah bagi kamu, barangkali setelah itu, yakni setelah kamu menjatuhkan talak kepada istrimu, Allah mengadakan sesuatu yang baru, yakni memberikan istri yang lebih baik. 2. Maka apabila mereka, para istri yang dijatuhi talak telah mendekati akhir masa idahnya, maka rujuklah, kembali kepada mereka dengan baik guna mempertahankan ikatan perkawinan; atau lepaskanlah mereka, yakni terus menceraikannya dengan baik dengan memperhatikan hak-hak anak. Dan persaksikanlah keputusan kamu untuk menceraikannya dengan dua orang saksi yang adil di antara kamu, yakni dua orang laki-laki atau satu orang laki-laki dan dua orang perempuan; dan hendaklah kamu menegakkan kesaksian itu karena Allah dengan jujur dan adil, serta dengan menaati hukum Allah. Demikianlah pengajaran itu, perintah untuk mematuhi hukum Allah dengan tulus diberikan kepada orang yang beriman kepada Allah dan hari akhirat di antara hamba-hamba-Nya. Barang siapa bertakwa kepada Allah dalam segala urusan; niscaya dia akan membukakan jalan keluar baginya dari segala kesulitan."
  }
]