[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Allah menyiapkan untuk kaum yang melampaui batas, serta menyelisihi perintahNya dan perintah RasulNya siksa yang sangat berat. Maka takutlah kalian, wahai orang-orang yang berakal lurus dan membenarkan Allah dan RasulNya serta melaksanakan syariatNya, kepada Allah dan waspadailah murkaNYa. Allah telah menurunkan kepada kalian (wahai orang-orang beriman) sebuah peringatan yang dengannya Allah mengingatkan kalian dan menunjukkan bagian kalian berupa iman kepada Allah dan menaatiNya. Peringatan ini adalah Rasulullah yang membacakan ayat-ayat Allah yang jelas dan membedakan antara yang haq dengan yang batil kepada kalian, agar Allah mengeluarkan orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan apa yang Allah perintahkan dan menaatiNYa, dari kegelapan-kegelapan kekafiran kepada cahaya iman. Barangsiapa beriman kepada Allah dan beramal shalih, niscaya Allah memasukannya ke dalam surga-surga yang mengalir di bawah istana-istananya dan kebun-kebunnya sungai-sungai, mereka tinggal selamanya di dalamnya. Sungguh Allah telah memberikan rizki yang baik kepada orang Mukmin yang shalih di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Allah telah menyiapkan siksa yang berat bagi mereka. Maka bertakwalah kepada Allah -wahai orang-orang yang berakal, yang beriman kepada Allah dan beriman kepada Rasul-Nya- dengan mengerjakan segala perintah-Nya dan menjauhi segala larangan-Nya, agar kalian tidak tertimpa apa yang menimpa mereka. Allah telah menurunkan peringatan yang mengingatkan kalian akan akibat buruk bermaksiat terhadap-Nya dan akibat baik mentaati-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-11. Allah menyiapkan azab yang menyakitkan bagi orang-orang yang berbuat semena-mena itu; maka bertakwalah dengan mentaati hukum-hukum-Nya hai orang-orang yang berakal sehat yang mengakui keesaan Allah dan risalah Rasulullah. Allah telah menurunkan kepada kalian al-Qur’an yang agung, dan mengutus seorang Rasul yang mulia yang membacakan kepada kalian ayat-ayat al-Qur’an yang sangat terperinci penjelasannya. Hal ini agar Rasulullah mengeluarkan orang-orang beriman yang mengerjakan amal shalih dari kesesatan setan menuju petunjuk Allah. Barangsiapa yang beriman kepada Allah dan melakukan ketaatan maka Allah akan memasukkannya ke dalam surga-surga yang di dalamnya terdapat sungai-sungai air tawar yang mengalir di bawah pepohonannya; dia akan tinggal di dalam surga selamanya; dan Allah telah melapangkan rezekinya di surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10-11. أَعَدَّ اللَّـهُ لَهُمْ عَذَابًا شَدِيدًا ۖ (Allah menyediakan bagi mereka azab yang keras) Yakni azab neraka. فَاتَّقُوا۟ اللَّـهَ يٰٓأُو۟لِى الْأَلْبٰبِ(maka bertakwalah kepada Allah hai orang-orang yang mempunyai akal) Yakni, hai orang-orang yang berakal sehat. Yang dimaksud adalah umat nabi Muhammad. الَّذِينَ ءَامَنُوا۟ ۚ((yaitu) orang-orang yang beriman) Yakni berserah dirilah kepada Allah dan ikuti Nabi Muhammad, serta tuluslah dalam beriman; dan janganlah seperti orang durhaka pada umat-umat sebelum kalian, sehingga kalian akan dihisab dengan hisab yang berat dan diazab dengan azab yang serupa dengan azab mereka. قَدْ أَنزَلَ اللَّـهُ إِلَيْكُمْ ذِكْرًا (Sesungguhnya Allah telah menurunkan peringatan kepadamu) Peringatan itu adalah al-Qur’an. Pendapat lain mengatakan: yakni Rasulullah itu sendiri, oleh sebab itu Allah berfirman: رَّسُولًا (seorang Rasul) Yakni Allah menurunkan al-Qur’an kepada kalian maknanya adalah mengutus kepada kalian seorang Rasul dengan membawa al-Qur’an. يَتْلُوا۟ عَلَيْكُمْ ءَايٰتِ اللَّـهِ مُبَيِّنٰتٍ (yang membacakan kepadamu ayat-ayat Allah yang menerangkan (bermacam-macam hukum)) Yakni menerangkan kepada manusia berbagai hukum yang mereka butuhkan. لِّيُخْرِجَ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ مِنَ الظُّلُمٰتِ إِلَى النُّورِ ۚ (supaya Dia mengeluarkan orang-orang yang beriman dan beramal saleh dari kegelapan kepada cahaya) Yakni agar dengan ayat-ayat itu Allah mengeluarkan orang-orang beriman dan beramal shalih dari gelapnya kesesatan menuju cahaya petunjuk dan dari gelapnya kekafiran menuju cahaya keimanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Allah menyiapkan bagi mereka azab yang sangat berat di akhirat, yaitu azab neraka. Maka bertakwalah kepada Allah dengan menunaikan perintah-perintahNya dan menjauhi larangan-laranganNya wahai pemilik akal yang paling baik, yaitu orang-orang yang beriman kepada Allah dan RasulNya Muhammad SAW. Sungguh Allah telah menurunkan bagi kalian Al-Quran yang agung."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah telah menyediakan azab yang sangat pedih bagi mereka. Maka bertakwalah kepada Allah, wahai orang-orang yang berakal sehat yang beriman. Sungguh Allah telah menurunkan kepada kalian peringatan} Al-Qur'an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. Allah mengabarkan bahwa Dia membinasakan umat-umat yang mendurhakai para rasul. Banyaknya jumlah mereka dan besarnya kekuatan mereka sama sekali tidak berguna bagi mereka ketika perhitungan amal yang amat dahsyat dan siksaan yang pedih datang, Allah menyiksa mereka karena perbuatan mereka yang buruk. Di samping siksaan dunia, Allah juga menyiapkan siksaan yang dahsyat bagi mereka kelak di Hari Akhir. “Maka bertakwalah kepada Allah hai orang-orang yang mempunyai akal,” maksudnya, wahai orang-orang yang berakal yang bisa memahami tanda-tanda kebesaran Allah, dan Dia-lah yang telah membinasakan umat-umat terdahulu karena mereka mendustakan para rasul. Orang-orang setelah mereka juga sama. Tidak ada perbedaan antara kedua golongan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 10: Allah mengabarkan telah menyiapkan untuk penduduk yang merugi ini dengan adzab yang keras di akhirat, dan ia kekal di dalam neraka jahannam. Kemudian Allah memerintakan orang-orang yang memiliki akal yang mereka beriman kepada Allah dan Rasul-Nya serta beramal dengan syariat-Nya agar takut kepada Allah dan ancaman-Nya. Dan telah diutus seorang Rasul kepada mereka sebagai pengingant dan penjelas kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Diulangi lagi ancaman azab kepada mereka sebagai taukid (penguatan), atau Allah Subhaanahu wa Ta'aala menghukum mereka di dunia dan di akhirat; di dunia sebagaimana yang disebutkan dalam ayat 8 sebelumnya, dan azab di akhirat sebagaimana yang disebutkan dalam ayat 10 di atas. Yaitu mereka yang memahami ayat-ayat Allah dan pelajaran yang disampaikan-Nya, dan bahwa pembinasaan terhadap orang-orang yang mendustakan tidak hanya berlaku terhadap orang-orang sebelum mereka, bahkan berlaku pula terhadap orang-orang yang setelah mereka. Yaitu Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 10",
    "description": "Sejalan dengan ayat sebelumnya, Allah menyediakan azab yang keras bagi mereka, yaitu bagi orang-orang yang menolak beriman kepada-Nya; maka bertakwalah kepada Allah wahai orang-orang yang mempunyai akal, yaitu orang-orang yang berpikir, lagi beriman dan bertakwa kepada Allah supaya kamu terhindar dari azab yang mengerikan di akhirat. Sungguh, Allah telah menurunkan peringatan, yakni Al-Qur'an kepada kamu. 11. Dan Allah telah seorang rasul yang membacakan ayat-ayat Allah kepada kamu sekalian yang menerangkan ajaran Allah agar dia mengeluarkan orang-orang yang beriman dan mengerjakan kebajikan, dari kegelapan kufur dan kebodohan kepada cahaya iman dan ilmu. Dan barang siapa beriman kepada Allah dengan keimanan yang sejatinya dan mengerjakan kebajikan, niscaya dia akan memasukkannya ke dalam surga-surga di akhirat yang mengalir di bawahnya sungai-sungai sehingga merasakan kenikmatan yang tiada tara; mereka kekal di dalamnya selama-lamanya dalam suasana penuh kenikmatan. Sungguh, Allah memberikan rezeki yang baik kepadanya dengan mendaptkan rida-Nya sehingga diizinkan masuk surga."
  }
]