[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Allah menyiapkan untuk kaum yang melampaui batas, serta menyelisihi perintahNya dan perintah RasulNya siksa yang sangat berat. Maka takutlah kalian, wahai orang-orang yang berakal lurus dan membenarkan Allah dan RasulNya serta melaksanakan syariatNya, kepada Allah dan waspadailah murkaNYa. Allah telah menurunkan kepada kalian (wahai orang-orang beriman) sebuah peringatan yang dengannya Allah mengingatkan kalian dan menunjukkan bagian kalian berupa iman kepada Allah dan menaatiNya. Peringatan ini adalah Rasulullah yang membacakan ayat-ayat Allah yang jelas dan membedakan antara yang haq dengan yang batil kepada kalian, agar Allah mengeluarkan orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan apa yang Allah perintahkan dan menaatiNYa, dari kegelapan-kegelapan kekafiran kepada cahaya iman. Barangsiapa beriman kepada Allah dan beramal shalih, niscaya Allah memasukannya ke dalam surga-surga yang mengalir di bawah istana-istananya dan kebun-kebunnya sungai-sungai, mereka tinggal selamanya di dalamnya. Sungguh Allah telah memberikan rizki yang baik kepada orang Mukmin yang shalih di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Peringatan ini berupa seorang Rasul dari-Nya yang membacakan kepada kalian ayat-ayat Allah yang terang, tidak ada kerancuan padanya, bertujuan mengeluarkan orang-orang yang beriman kepada Allah dan mempercayai Rasul-Nya serta mengerjakan amal saleh, dari gelapnya kesesatan menuju cahaya hidayah. Barangsiapa beriman kepada Allah dan mengerjakan amal saleh, niscaya Allah memasukkannya ke dalam Surga-surga yang mengalir sungai-sungai di bawah istana-istananya dan pepohonannya, mereka tinggal di dalamnya selama-lamanya. Allah memberinya rezeki yang baik dengan memasukkannya ke dalam Surga yang kenikmatannya tidak pernah pupus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Allah telah mengutus untuk kalian seorang rasul yaitu Muhammd SAW yang membacakan ayat-ayat Allah untuk kalian sebagai penjelas bagi kalian tentang apa yang kalian butuhkan berupa syariat-syariat hukum untuk mengeluarkan orang-orang mukmin yang mengerjakan amal shalih yang diperintahkan kepada mereka dari gelapnya kezaliman menuju cahaya petunjuk dan dari kekufuran menuju cahaya keimanan. Barangsiapa beriman kepada Allah dan mengerjakan amal shalih dengan mematuhi perintah-perintahNya dan meninggalkan kemaksiatan terhadapNya (Maksudnya adalah menggabungkan dua perkara tersebut), maka Allah akan memasukkannya ke dalam surga yang di dalamnya mengalir sungai-sungai di bawah rumah-rumahnya dan taman-tamannya. Mereka tinggal di dalamnya selama-lamanya dan Allah melapangkan rejekinya di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{seorang Rasul yang membacakan ayat-ayat Allah kepada kalian yang memberi keterangan agar dia mengeluarkan orang-orang yang beriman dan beramal shalih dari kegelapan menuju cahaya. Siapa saja yang beriman kepada Allah dan mengerjakan kebajikan, niscaya Dia akan memasukkannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Sungguh Allah telah menganugerahkan rezeki yang baik kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Kemudian Allah mengingatkan hamba-hambanYa yang beriman dengan kitabNya yang diturunkan kepada RasulNya Muhammad, agar mengeluarkan manusia dari gelapnya kebodohan, kekufuran, dan kemaksiatan menuju cahaya ilmu, iman, dan ketaatan. Di antara manusia ada yang beriman kepadanya dan ada juga yang tidak beriman.”Dan barangsiapa beriman kepada Allah dan mengerjakan amal yang shalih,” baik yang wajib maupun yang sunnah, “niscaya Allah akan memasukannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai,” yang di dalamnya terdapat kenikmatan abadi yang belum pernah dilihat oleh mata, belum pernah didengar oleh telinga dan belum pernah terlintas di benak manusia. “Mereka kekal di dalamnya selama-lamanya. Sungguh Allah memberikan rizki yang baik kepadanya.” Maksudnya, siapa pun yang tidak beriman kepada Allah, maka mereka itulah penghuni neraka, mereka kekal didalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 11: Allah menjelaskan bahwa pengingat ini adalah Rasul ﷺ yang membacakan kepada kalian ayat-ayat Allah yang jelas bagi kalian antara yang benar dan yang bathil; Dan agar supaya mengeluarkan mereka yang membenarkan Allah dan Rasul-Nya ﷺ dan beramal shalih dari kegelapan kekafiran menuju kepada cahaya keimanan. Ketahuilah barangsiapa yang membenarkan Allah dan Rasul-Nya ﷺ dan beramal dengan amalan shalih, maka sungguh Allah akan memasukkannya ke dalam surga yang mengalir di bawah istananya dan pepohonannya sungai-sungai, mereka akan tinggal di dalamnya selama-lamanya, tidak akan pernah keluar darinya selamanya. Kemudian Allah menjelaskan, bahwa telah diluaskan rezeki di surga bagi orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dari gelapnya kekafiran, kebodohan dan kemaksiatan kepada cahaya keimanan, pengetahuan dan ketaatan. Yang wajib maupun yang sunat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 11",
    "description": "Dan Allah telah seorang rasul yang membacakan ayat-ayat Allah kepada kamu sekalian yang menerangkan ajaran Allah agar dia mengeluarkan orang-orang yang beriman dan mengerjakan kebajikan, dari kegelapan kufur dan kebodohan kepada cahaya iman dan ilmu. Dan barang siapa beriman kepada Allah dengan keimanan yang sejatinya dan mengerjakan kebajikan, niscaya dia akan memasukkannya ke dalam surga-surga di akhirat yang mengalir di bawahnya sungai-sungai sehingga merasakan kenikmatan yang tiada tara; mereka kekal di dalamnya selama-lamanya dalam suasana penuh kenikmatan. Sungguh, Allah memberikan rezeki yang baik kepadanya dengan mendaptkan rida-Nya sehingga diizinkan masuk surga. 12. Allah yang menciptakan tujuh lapis langit dan demikian juga penciptaan dari bumi serupa itu, yakni tujuh lapis bumi. Perintah Allah berupa hukum alam berlaku padanya secara mutlak, agar kamu mengetahui bahwa Allah mahakuasa atas segala sesuatu yang menyadarkan manusia untuk beriman dan taat kepada Allah; dan menyadari bahwa ilmu Allah benar-benar meliputi segala sesuatu, baik yang kasat mata maupun yang tersembunyi."
  }
]