[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12. Hanya Allah semata Yang menciptakan langit yang tujuh, dan juga menciptakan bumi yang tujuh. Allah menurunkan sesuatu yang Allah wahyukan kepada para utusanNya dan sesuatu yang dengannya Allah mengatur urusan makhlukNya di antara langit dan bumi, agar kalian, wahai manusia, tahu bahwa Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu yang melemahkanNya, dan bahwa ilmu Allah mencakup segala sesuatu, tidak ada sesuatu yang keluar dari ilmu dan kuasa Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Allah-lah yang menciptakan tujuh langit dan Dia menciptakan tujuh bumi sebagaimana Dia menciptakan tujuh langit. Perintah-Nya, baik yang berupa hukum alam maupun hukum syar'i bertebaran di antara keduanya, dengan tujuan agar kalian tahu bahwa Allah itu Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkan-Nya, dan bahwasanya ilmu Allah -Subḥānahu- meliputi segala sesuatu, maka tidak ada sesuatu pun di langit dan di bumi yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah-lah yang menciptakan tujuh langit dan menciptakan tujuh bumi. Wahyu Allah senantiasa turun dengan perintah dan ketetapan-Nya kepada para rasul-Nya di antara langit dan bumi; agar kalian mengetahui -hai para hamba- bahwa Allah Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Nya. dan Allah mengetahui segala sesuatu, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. اللَّـهُ الَّذِى خَلَقَ سَبْعَ سَمٰوٰتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ (Allah-lah yang menciptakan tujuh langit dan seperti itu pula bumi) Yakni dan Allah menciptakan tujuh bumi seperti jumlah langit. Dalam hadits shahih marfu’ telah ditekankan hal ini, yaitu hadits dalam shahihain, Rasulullah bersabda: “Barangsiapa mengambil sejengkal tanah secara zalim, niscaya akan dikalingkan di lehernya tujuh bumi.” يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ(Perintah Allah berlaku padanya) Yakni keputusan Allah turun dari langit ketujuh menuju bumi ketujuh. Sehingga terjadilah hujan yang turun, tanaman yang tumbuh, malam dan siang yang silih berganti, serta musim panas dan musim dingin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Hanya Allah yang menciptakan 7 lapis langit dan menciptakan bumi seperti itu (langit) juga susunannya. (Maknanya 7 lapisan bumi). Di antara semua itu perintah dan takdir Allah berlaku. Dia juga menerapkan hukum-hukumnya di semua itu, supaya kalian mengetahui wahai para hambaku bahwa sesungguhnya Allah adalah Dzat yang Maha Berkuasa atas segala sesuatu dan ilmuNya meliputi segala sesuatu sehingga tidak ada yang tersembunyi dariNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allahlah yang menciptakan tujuh langit dan bumi seperti itu} dan menciptakan juga tujuh lapis bumi {PerintahNya berlaku di antara keduanya} di antara langit dan bumi {agar kalian mengetahui bahwa Allah Maha kuasa atas segala sesuatu dan ilmu Allah benar-benar meliputi segala sesuatu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Kemudian Allah mengabarkan bahwa Dia-lah yang menciptakan langit dan bumi dan apa saja yang ada padanya dan yang ada di antara masing-masing tingkatannya. Allah menurunkan perintah yang berupa syariat dan hukum-hukum duniawi yang diwahyukan kepada para rasulNya sebagai peringatan dan nasihat untuk manusia. Begitu juga dengan undang-undang alam dan takdir yang mengatur seluruh mahkluk. Semua itu bertujuan agar manusia mengetahui keluasan KuasaNya atas segala sesuatu. Semuanya berada dalam jangkauan ilmuNya. Jika manusia mengetahui nama-namaNya yang indah dan sifat-sifatNya yang suci, mereka akan menyembah, mencintai, dan menunaikan hakNya. Dan inilah tujuan yang dimaksudkan dari penciptaan dan diturunkannya perintah (syariat dan hukum); yaitu mengenal dan menyembah Allah. Hamba-hamba Allah yang shalih yang mendapatkan taufik menunaikannya, sedangkan orang-orang zhalim berpaling darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 12: Allah mengabarkan bahwa Dia sajalah yang menciptakan langit yang tujuh, dan menciptakan semisal dengan itu dalam jumlah yang sama dari bumi. Allah mengabarkan bahwa Dia yang menurunkan perintah di antara langit dan bumi, yaitu syariat-Nya, hukum agama-Nya yang Allah wahyukan kepada para Rasul-Nya sebagai peringatan bagi seorang hamba dan sebagai ancaman untuk mereka. Begitu juga perintah-perintah kauniyyah dan qadariyyah yang makhluk berjalan di atasnya; Allah juga turunkan hujan, dan menggantikan malam dengan siang, dan menggantikan siang dengan malam, dan yang selainnya. Agar makhluk tahu siapa yang kuasa atas makhluk-Nya, karena Allah Yang Maha Kuasa atas segala sesuatunya. Dan agar mereka tahu bahwa Allah Maha Luas kuasa-Nya atas segala sesuatu dari makhluk-Nya. Tidak akan luput dari-Nya walaupun sekecil biji atom di bumi dan di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia yang menciptakan tujuh langit dan semua yang ada di dalamnya serta tujuh bumi dan apa yang ada di dalamnya serta apa yang ada di antara langit dan bumi. Ada yang menafsirkan, bahwa maksudnya wahyu turun di antara keduanya (langit dan bumi), dibawa oleh malaikat Jibril dari langit ketujuh sampai ke bumi, atau maksudnya berlaku syariat dan hukum-hukum agama yang Allah wahyukan kepada para rasul-Nya untuk mengingatkan mereka dan menasihati mereka, demikian pula berlaku perintah-perintah yang kauni qadari (takdir-Nya terhadap alam semesta) yang dengannya Allah mengatur hamba-hamba-Nya. Semua itu dimaksudkan agar para hamba mengenal-Nya dan mengetahui meliputnya kekuasaan Allah dan pengetahuan-Nya terhadap segala sesuatu, dimana apabila mereka telah mengenali-Nya dengan sifat-sifat-Nya yang suci dan nama-nama-Nya yang indah, beribadah kepada-Nya, mencintai-Nya dan memenuhi hak-Nya, maka berarti ia telah melaksanakan maksud yang diinginkan dari adanya penciptaan dan perintah, yaitu mengenal Allah dan beribadah kepada-Nya. Orang-orang yang mendapatkan taufiq dari kalangan hamba-hamba Allah yang saleh dapat menjalankannya, sedangkan orang-orang yang zalim berpaling darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 12",
    "description": "Allah yang menciptakan tujuh lapis langit dan demikian juga penciptaan dari bumi serupa itu, yakni tujuh lapis bumi. Perintah Allah berupa hukum alam berlaku padanya secara mutlak, agar kamu mengetahui bahwa Allah mahakuasa atas segala sesuatu yang menyadarkan manusia untuk beriman dan taat kepada Allah; dan menyadari bahwa ilmu Allah benar-benar meliputi segala sesuatu, baik yang kasat mata maupun yang tersembunyi. 1. Setelah pada surah sebelumnya Allah menyapa nabi tentang hukum dan etika menceraikan istri, pada awal surah ini Allah menyapa, 'wahai nabi! mengapa engkau mengharamkan apa yang dihalalkan Allah bagimu dengan bersumpah tidak akan pernah minum madu setelah minum madu di rumah zainab binti jahsy, salah seorang istrimu, dan tidak akan pernah melakukan hubungan suami istri dengan mariyah al-qib'iyyah, setelah berhubungan di rumah hafsah' hanya karena engkau ingin menyenangkan hati istri-istrimu, terutama hafsah dan '''isyah'' dan Allah maha pengampun, maha penyayang kepada siapa saja yang bertobat, termasuk dua istri nabi, yaitu hafsah dan '''isyah."
  }
]