[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Bila para istri yang ditalak itu mendekati masa akhir iddahnya, maka silakan merujuk mereka dengan tetap memperlakukan mereka dengan baik dan memberi mereka nafkah, atau berpisahlah dengan mereka dengan tetap memberikan hak-hak mereka tanpa memudaratkan mereka. Persaksikanlah dua orang yang adil di antara kalian atas rujuk dan perpisahan. Tunaikanlah wahai para saksi, kesaksian karena Allah semata, bukan karena yang lainnya. Apa yang Allah perintahkan kepada kalian ini merupakan nasihat kepada siapa yang beriman kepada Allah dan Hari Akhirat. Barangsiapa takut kepada Allah lalu dia melaksanakan apa yang Allah perintahkan dan menjauhi apa yang Allah larang, niscaya Allah memberinya jalan keluar dari segala kesempitan. Dan memudahkan sebab-sebab rizki baginya dari arah yang tidak terbetik dalam pikirannya dan tidak pernah diduganya. Barangsiapa bertawakkal kepada Allah, maka Allah akan mencukupinya dari segala apa yang membuatnya bersedih dari seluruh urusannya. Sesungguhnya Allah menguasai urusanNYa, tidak ada yang luput dari Allah dan tidak ada yang melemahkannya. Allah telah menetapkan bagi segala sesuatu masa akhir sebagai ajalnya dan takdir yang tidak dilampauinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Jika mereka telah mendekati masa berakhirnya iddah mereka maka rujuklah mereka demi cinta dan hubungan yang baik, atau biarkan kalian tidak merujuk mereka hingga iddah mereka berakhir lalu mereka berkuasa atas diri mereka dengan kalian berikan kepada mereka hak-hak mereka. Jika kalian hendak merujuk mereka atau berpisah dengan mereka maka persaksikan dua saksi yang adil dari kalian sebagai upaya mencegah pertikaian. Dan bersaksilah -wahai para saksi- dengan kesaksian untuk mencari rida Allah. Hukum-hukum tersebut untuk mengingatkan orang yang beriman kepada Allah dan beriman kepada hari Kiamat, karena dia adalah orang yang bisa mendapatkan manfaat dari peringatan dan nasihat. Barangsiapa bertakwa kepada Allah dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya, niscaya Allah memberikan baginya jalan keluar dari segala kesempitan dan kesusahan yang terjadi padanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Jika masa iddah hampir selesai, maka wajib bagi kalian rujuk kembali dengan mereka dengan memperbaiki perlakuan terhadap mereka dan memberi nafkah bagi mereka, atau berpisahlah dengan mereka secara baik-baik dengan memenuhi hak-hak mereka. Dan mintalah persaksian dua orang yang adil atas rujuk atau cerai yang kalian lakukan, dan tunaikanlah persaksian -wahai para saksi- dengan benar tanpa membela salah satu pihak. Demikianlah hukum-hukum yang berkedudukan tinggi ini diperintahkan kepada orang yang beriman kepada Allah dan hari akhir. Dan barangsiapa yang bertakwa kepada Allah dengan mentaati hukum-hukum-Nya maka Allah akan memberinya jalan keluar dari segala kesulitan, dan memberinya kemudahan mendapat rezeki dari arah yang tidak penah dia perkirakan. Dan barangsiapa yang bertawakkal kepada Allah maka cukuplah Allah baginya. Sungguh Allah akan menjalankan ketetapan-Nya, Dia telah menetapkan segala sesuatu dengan kadarnya masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. فَإِذَا بَلَغْنَ أَجَلَهُنَّ (Apabila mereka telah mendekati akhir iddahnya) Yakni jika telah sampai pada akhir masa iddah. فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ(maka rujukilah mereka dengan baik) Yakni rujuklah dengannya dengan memperlakukan mereka secara baik dan karena kecintaan, dan bukan dengan maksud untuk memberi mudharat bagi mereka. أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ(atau lepaskanlah mereka dengan baik) Yakni biarkanlah mereka agar masa iddahnya selesai, sehingga mereka terbebas dari ikatan pernikahan, namun kalian harus tetap memenuhi hak mereka yang harus kalian tunaikan serta janganlah memberi mereka mudharat. Pada akhir masa iddah kalian tidak memiliki pilihan kecuali merujuk mereka dengan baik atau melepas mereka dengan baik pula, adapun merujuk mereka dengan maksud memberi mudharat atau melepas mereka untuk menyakiti dan menolak menunaikan hak mereka, maka itu diharamkan bagi kalian. وَأَشْهِدُوا۟ ذَوَىْ عَدْلٍ مِّنكُمْ(dan persaksikanlah dengan dua orang saksi yang adil di antara kamu) Yang menyaksikan rujuk atau perceraian yang kalian pilih, agar tidak terjadi perselisihan di lain waktu. وَأَقِيمُوا۟ الشَّهٰدَةَ لِلَّـهِ ۚ( dan hendaklah kamu tegakkan kesaksian itu karena Allah) Perintah ini ditujukan bagi para saksi, agar mereka menyampaikan kesaksian itu dengan sebenar-benarnya untuk mendekatkan diri kepada Allah. ذٰلِكُمْ يُوعَظُ بِهِۦ مَن كَانَ يُؤْمِنُ بِاللَّـهِ وَالْيَوْمِ الْءَاخِرِ ۚ (Demikianlah diberi pengajaran dengan itu orang yang beriman kepada Allah dan hari akhirat) Allah hanya menyebut orang yang beriman karena hanya ia yang mau mengambil manfaat dari hal itu. وَمَن يَتَّقِ اللَّـهَ(Barangsiapa bertakwa kepada Allah) Yakni barangsiapa yang bertakwa kepada Allah dengan menjalankan hukum-hukum-Nya yang telah Dia tetapkan. يَجْعَل لَّهُۥ مَخْرَجًا(niscaya Dia akan mengadakan baginya jalan keluar) Dari masalah yang menimpanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Jika mereka telah mendekati akhir masa iddah, maka ruju’ilah mereka dengan baik tanpa menyakiti atau melepaskan mereka sampai habis masa iddahnya. Penuhilah hak-hak mereka, Berhati-hatilah jangan sampai menyakiti mereka jika ingin melakukan ruju’, seperti melakukan ruju’ dengannya kemudian menalaknya lagi selama masa iddahnya. Bersaksilah kalian (meliputi kalian semua) sebagai saksi yang adil atas perkala talak dan ruju’ agar terhindar dari keragu-raguan dan menghentikan perselisihan. Lakukanlah hal itu wahai para saksi dengan ikhlas karena Allah tanpa berpihak (pada siapapun) atau tanpa menyimpang dari kebenaran. Itulah hal-hal yang diperintahkan bagi orang yang beriman kepada Allah dan hari akhir dalam perkara talak atau ruju’ dan kesaksian. Karena itu adalah nasehat yang bermanfaat. Barangsiapa bertakwa kepada Allah dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya, maka dimudahkan urusan-urusannya. Ibnu Mardawiyah dan Al-Khutaib dari Ibnu Abbas: “Sesungguhnya ayat ini diturunkan berkenaan dengan anak Auf bin Malik yang ditawan musuh, kemudian kedua orang tuanya memperbanyak bacaan hauqalah. Setelah itu, musuhnya mengabaikannya, lalu dia menaiki kambingnya dan kembali pulang ke ayahnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mereka telah mendekati akhir iddahnya} mereka mendekati masa selesai iddahnya {rujuklah dengan mereka} rujuklah mereka {dengan baik} dengan memberi perlakuan yang baik dan memberi nafkah kepada mereka {atau lepaskanlah mereka} atau tinggalkanlah mereka sampai selesai masa iddahnya {secara baik} dengan memenuhi hak-hak mereka tanpa memberikan kemudharatan kepada mereka {dan persaksikanlah dengan dua orang yang adil} dua orang yang memiliki keadilan {dari kalangan kalian dan tegakkanlah} tunaikanlah {kesaksian itu karena Allah. Yang demikian itu dinasihatkan kepada orang-orang yang beriman kepada Allah dan hari akhir. Siapa saja yang bertakwa kepada Allah, niscaya Dia akan membuatkan baginya jalan keluar} jalan keluar dari segala kesempitan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah berfirman, “Apabila mereka telah sampai masa (akhir iddahnya),” maksudnya jika mereka telah mendekati akhir iddahnya karena seandainya ketika iddah mereka telah usai, tentu suaminya tidak lagi memiliki pilihan antara merujuk atau melepas, “maka rujukilah mereka dengan baik,” dengan cara pergaulan yang baik dan indah, bukan dengan cara yang membahayakan atau menghendaki keburukan dan ingin menahannya, karena merujuk dengan cara seperti ini tidak dibolehkan, “atau lepaskanlah mereka dengan baik,” perpisahan yang tidak terlarang, tanpa adanya celaan, permusuhan, intimidasi, atas pihak wanita agar sebagian hartanya bisa diambil, “dan persaksikanlah,” atas talak dan rujuk tersebut, “dengan dua orang saksi yang adil di antara kamu,” yaitu dua lelaki muslim yang adil. Karena dalam persaksian yang disebutkan bisa menutup pintu sengketa kedua belah pihak, serta bisa menghindari adanya sesuatu yang disembunyikan yang seharusnya diberitahukan. “Dan hendaklah kamu tegakkan,” wahai para saksi, “kesaksian itu karena Allah.” Maksudnya, tunaikan kesaksian itu dengan benar, tanpa adanya tambahan dan pengurangan. Niatkanlah karena Allah ketika menunaikan kesaksian jangan bertendensi kekeluargaan terhadap keluarga atau faktor persahabatan terhadap teman. “Demikianlah,” hukum dan batasan yang Kami sebutkan pada kalian, “diberi pelajaran dengan itu orang yang beriman kepada Allah dan Hari Akhirat.” Karena iman kepada Allah dan Hari Akhir mengharuskan orangnya untuk mengindahkan arahan dan nasihat-nasihat Allah serta lebih mengedepankan akhirat dengan melakukan amalan-amalan shalih sebisa mungkin. Lain halnya dengan orang yang tidak memiliki keimanan di hatinya; ia tidak mempedulikan keburukan yang dilakukan dan tidak mengagungkan nasihat-nasihat Allah, karena taidak adanya keimanan (dalam hatinya) yang mendorong kepada hal itu. Karena talak kadang terjadi dalam situasi sulit, bencana, dan kekacauan, maka Allah memerintahkan agar bertakwa kepadaNya. Allah berjanji bagi siapa saja yang bertakwa padaNya dalam hal talak atau lainnya akan diberi solusi. Jika seseorang mentalak istrinya, maka harus dilakukan sesuai peraturan syariat, yaitu dengan cara menjatuhkan satu talak ketika ketika istri tidak dalam keadaan haid dan tidak dalam keadaan suci namun telah dicampuri. Hal itu tidaklah mempersempit masalahnya, namun Allah justru akan memberi kelapangan dan keleluasaan, seperti rujuk kembali ketika sang suami menyesal telah mentalak istrinya. Ayat di atas meski dalam tekstual talak dan cerai, namun kontekstual berlaku secara umum. Maksudnya, siapa pun yang bertakwa kepada Allah dan meniti ridhaNya dalam berbagai kondisi, maka Allah akan memberinya balasan pahala di dunia dan di akhirat. Di antara balasanNya secara garis besar adalah diberikannya pintu keluar dari berbagai kondisi sulit dan susah. Sebagaimana orang yang bertakwa pada Allah akan diberikan celah dan pintu keluar, sebaliknya, siapa pun yang tidak bertakwa kepada Allah akan jatuh dalam rantai dan belenggu yang tidak akan mampu terlepas dan keluar dari ikatannya. Mari terapkan hal ini dalam masalah talak. Seseorang yang tidak bertakwa kepada Allah akan menjatuhkan talak yang diharamkan seperti talak tiga sekaligus dan lainnya. Karena itu, ia pasti akan sangat menyesal dan tidak mungkin bisa didapat kembali dan tidak bisa keluar dari permasalahannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 2: Allah memerintahkan para istri, ketika dekat dengan masa iddah mereka yaitu akan berakhirnya masa iddah, untuk berlaku baik kepada para suami yaitu bersepakat (ruju’) atau berpisah secara baik-baik, sebagaimana Allah memerintahkan untuk saling percaya ketika menikah dengan persaksian dua orang saksi; Begitu juga untuk mendatangkan saksi ketika ruju’ dan talaknya dengan dua orang saksi yang adil di antara kalian. Dan wajib bagi kalian wahai orang-orang yang bersaksi, agar bersaksi dengan ikhlas karena Allah ketika dituntut bagi kalian untuk bersaksi. Ketahuilah bahwa apa yang Allah perintahkan, haruslah diterima dan diamalkan jika kalian adalah orang-orang yang jujur kepada Allah dan Rasul-Nya ﷺ, dan beriman dengan hari akhir. Kemudian Allah menyebutkan karena sebab kemuliaan-Nya dan kebaikan-Nya kepada orang-orang yang bertakwa, dan Allah menjelaskan barangsiapa yang takut kepada Allah, maka wajib beramal dengan apa yang diperintahkan-Nya dan menjauhi larangan-Nya, karena dengan sebab itu Allah akan menjadikan jalan keluar bagi urusan yang sempit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena apabila mereka telah keluar dari masa ‘iddah, maka suami tidak ada kesempatan memilih untuk menahan (merujuk) atau menceraikan. Tidak bermaksud membahayakan istri, menimpakan keburukan dan mengekangnya. Yakni dengan tidak melakukan perbuatan yang dilarang, tidak mencaci-maki, bertengkar dan memaksa istri agar memberikan harta yang telah menjadi miliknya. Yang muslim dan adil, karena mengangkat saksi dapat menutup pintu pertengkaran dan menutup sikap menyembunyikan dari keduanya sesuatu yang mesti dijelaskan. Untuk rujuk atau talaknya. Yakni tegakkanlah persaksian itu sesuai keadaan yang sebenarnya tanpa kurang tanpa lebih, dan niatkanlah untuk mencari keridhaan Allah, serta tidak memperhatikan kerabat karena kedekatannya atau kawan karena disenanginya. Yang demikian karena orang yang beriman kepada Allah dan hari akhir mengharuskannya segera sadar terhadap nasihat Allah, menyiapkan amal saleh yang bisa dilakukannya untuk akhirat, berbeda dengan orang yang iman telah berpindah dari hatinya, maka ia tidak peduli terhadap perbuatannya yang disiapkan untuk akhirat baik atau buruk, dia juga tidak memuliakan nasihat-nasihat Allah. Oleh karena talak terkadang membuat seseorang merasakan kesempitan, kesedihan dan penderitaan, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk bertakwa kepada-Nya, dan barang siapa yang bertakwa kepada Allah baik dalam masalah talak maupun lainnya, maka Allah Subhaanahu wa Ta'aala akan membukakan jalan keluar baginya. Oleh karena itu, apabila seseorang ingin mentalak, lalu ia menjatuhkannya sesuai syariat, yaitu menatuhkannya sekali tidak pada masa istri haidh atau masa suci yang telah dicampuri, maka urusannya tidak akan sempit, bahkan Allah Subhaanahu wa Ta'aala memberikan celah dan jalan keluar agar ia dapat merujuk istrinya jika ia menyesal melakukan talak. Karena Al ‘Ibrah bi ‘umuumil lafzh laa bikhushuusis sabab (Yang dijadikan patokan adalah umumnya lafaz; bukan khususnya sebab), maka orang yang bertakwa kepada Allah dan mengutamakan keridhaan Allah dalam semua keadaannya, Allah Subhaanahu wa Ta'aala akan membalasnya di dunia dan akhirat. Di antara sekian balasannya adalah Allah Subhaanahu wa Ta'aala berikan jalan keluar dari setiap kesulitan dan kesempitan. Sebagaimana orang yang bertakwa kepada Allah, akan dibukakan jalan keluar baginya, maka orang yang tidak bertakwa kepada Allah, akan terjatuh ke dalam kesempitan, beban dan belenggu yang sulit keluar dan lolos darinya. Digunakan talak sebagai contohnya, karena jika seorang tidak bertakwa kepada Allah dalam masalah talak, misalnya ia menjatuhkan talak dengan cara yang diharamkan seperti langsung tiga kali, maka ia tentu akan menyesal dengan penyesalan yang tidak mungkin dapat dikejar lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 2",
    "description": "Maka apabila mereka, para istri yang dijatuhi talak telah mendekati akhir masa idahnya, maka rujuklah, kembali kepada mereka dengan baik guna mempertahankan ikatan perkawinan; atau lepaskanlah mereka, yakni terus menceraikannya dengan baik dengan memperhatikan hak-hak anak. Dan persaksikanlah keputusan kamu untuk menceraikannya dengan dua orang saksi yang adil di antara kamu, yakni dua orang laki-laki atau satu orang laki-laki dan dua orang perempuan; dan hendaklah kamu menegakkan kesaksian itu karena Allah dengan jujur dan adil, serta dengan menaati hukum Allah. Demikianlah pengajaran itu, perintah untuk mematuhi hukum Allah dengan tulus diberikan kepada orang yang beriman kepada Allah dan hari akhirat di antara hamba-hamba-Nya. Barang siapa bertakwa kepada Allah dalam segala urusan; niscaya dia akan membukakan jalan keluar baginya dari segala kesulitan. 3. Dan dia pun akan memberinya rezeki dari arah yang tidak disangka-sangkanya dengan memberikan kebutuhan fisik maupun kebutuhan ruhani. Dan barang siapa bertawakal kepada Allah dalam segala urusan, niscaya Allah cukup sebagai tempat mengadu bagi diri-Nya. Sesungguhnya Allah melaksanakan urusan-Nya dengan penuh hikmah bagi manusia. Sungguh, Allah telah menjadikan segala sesuatu dengan kadarnya sehingga setiap orang tidak akan menghadapi masalah di luar batas kemampuannya."
  }
]