[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Bila para istri yang ditalak itu mendekati masa akhir iddahnya, maka silakan merujuk mereka dengan tetap memperlakukan mereka dengan baik dan memberi mereka nafkah, atau berpisahlah dengan mereka dengan tetap memberikan hak-hak mereka tanpa memudaratkan mereka. Persaksikanlah dua orang yang adil di antara kalian atas rujuk dan perpisahan. Tunaikanlah wahai para saksi, kesaksian karena Allah semata, bukan karena yang lainnya. Apa yang Allah perintahkan kepada kalian ini merupakan nasihat kepada siapa yang beriman kepada Allah dan Hari Akhirat. Barangsiapa takut kepada Allah lalu dia melaksanakan apa yang Allah perintahkan dan menjauhi apa yang Allah larang, niscaya Allah memberinya jalan keluar dari segala kesempitan. Dan memudahkan sebab-sebab rizki baginya dari arah yang tidak terbetik dalam pikirannya dan tidak pernah diduganya. Barangsiapa bertawakkal kepada Allah, maka Allah akan mencukupinya dari segala apa yang membuatnya bersedih dari seluruh urusannya. Sesungguhnya Allah menguasai urusanNYa, tidak ada yang luput dari Allah dan tidak ada yang melemahkannya. Allah telah menetapkan bagi segala sesuatu masa akhir sebagai ajalnya dan takdir yang tidak dilampauinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan memberinya rezeki dari arah yang tidak terdetik di dalam hatinya dan tidak ada dalam perhitungannya. Barangsiapa bersandar kepada Allah dalam segala urusannya, maka Allah akan mencukupi kebutuhannya. Sesungguhnya Allah melaksanakan urusan-Nya, tidak lemah untuk berbuat sesuatu dan tidak ada sesuatu yang luput dari-Nya. Allah sudah membuat batasan untuk segala sesuatu yang akan selesai pada batasnya. Kesusahan ada batasnya, kesenangan ada batasnya, masing-masing dari keduanya tidak kekal menimpa manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ (Dan memberinya rezeki dari arah yang tiada disangka-sangkanya) Yakni dari arah yang tidak pernah terpikir olehnya dan tidak pernah ia kira. Maka barangsiapa yang bercerai kemudian disaksikan perceraiannya saat masa iddah telah selesai atau disaksikan rujuknya, maka Allah akan memberinya jalan keluar. Dan kesempitan hanya bagi orang yang menyelisihi hukum-hukum Allah pada saat bercerai atau rujuk. وَمَن يَتَوَكَّلْ عَلَى اللَّـهِ فَهُوَ حَسْبُهُۥٓ (Dan barangsiapa yang bertawakkal kepada Allah niscaya Allah akan mencukupkan (keperluan)nya) Yakni barangsiapa yang mempercayakan Allah dalam apa yang ia serahkan kepada-Nya niscaya Allah akan memberinya apa yang ia harapkan. إِنَّ اللَّـهَ بٰلِغُ أَمْرِهِۦ ۚ( Sesungguhnya Allah melaksanakan urusan yang (dikehendaki)Nya) Tidak ada yang terlewat dari-Nya dan tidak ada keinginan yang sulit bagi-Nya. قَدْ جَعَلَ اللَّـهُ لِكُلِّ شَىْءٍ قَدْرًا(Sesungguhnya Allah telah mengadakan ketentuan bagi tiap-tiap sesuatu) Yakni Allah menjadikan bagi segala kesulitan batas waktu, begitu pula menjadikan bagi segala kesejahteraan batas waktu. Imam as-Suddy berpendapat: yang dimaksud adalah batas waktu haidh dan iddah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dan memberinya rejeki dengan berbagai persiapan melalui arah yang tidak diketahui. Barangsiapa menyerahkan urusannya kepada Allah, maka Dia akan mencukupinya. Sesungguhnya Allah adalah Dzat yang menerapkan hukum, kehendak, dan takdirNya terhadap makhlukNya. Sungguh Allah telah menciptakan bagi tiap-tiap sesuatu kesejahteraan yang sudah ditakdirkan, jumlah dan masanya tidak lebih dari takdir yang telah ditentukan itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan menganugerahkan kepadanya rezeki dari arah yang tidak dia duga} tidak terbesit dalam benaknya dan dalam dugaannya {Siapa saja yang bertawakal kepada Allah, niscaya Allah akan mencukupkannya} mencukupkannya {Sesungguhnya Allahlah yang menuntaskan urusanNya} menunaikan ketentuanNya sehingga tidak ada yang luput dariNya dan tidak ada permintaan yang bisa melemahkanNya {Sungguh Allah telah membuat ketentuan bagi setiap sesuatu} waktu selesainya perkara tersebut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Allah berfirman, “Dan memberinya rizki dari arah yang tiada disangka-sangkanya.” Maksudnya, Allah memberi rizki bagi orang yang bertakwa dari arah yang tidak disangka dan dirasa. “Dan barangsiapa yang bertawakal kepada Allah,” dalam urusan agama dan dunianya dengan bergantung sepenuhnya kepada Allah dengan maksud untuk mendapatkan apa-apa yang bermanfaat dan menghindari apa-apa yang mudarat, serta percaya sepenuhnya kepada Allah, bahwa ia akan diberi kemudahan, “niscaya Allah akan mencukupkan (keperluan)nya.” Maksudnya, Allah akan mencukupi keperluan yang disandarkannya kepada Allah. Dan ketika suatu urusan berada dalam tanggungan Yang Mahakaya, Mahakuat, Mahaperkasa lagi Penyayang, maka Dia paling dekat dengan hambaNya melebihi segala sesuatu. Hanya saja mungkin hikmah ilahi mengharuskan pemberian itu ditunda sampai waktu yang tepat bagi hamba yang bersangkutan. Karena itu Allah berfirman, “Sesungguhnya Allah pasti mewujudkan urusan (yang dikehendaki) Nya.” Maksudnya, keputusan dan ketetapanNYa pasti berlaku, hanya saja Allah menciptakan “ketentuan bagi tiap-tiap sesuatu.” Yaitu waktu dan ketentuan yang tidak akan terlampaui dan kurang darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 3: Allah juga menjelaskan bahwa barangsiapa yang takut kepada Allah, maka Allah akan membukakan padanya pintu rezeki yang tidak akan membuat gundah manusia akan rezekinya. Allah menjelaskan bahwa barangsiapa yang melakukannya maka cukup atas urusannya. Ketahuilah bahwa Allah jelas perintah-Nya yang tidak ada sesuatupun yang melemahkan-Nya, dan telah dijadikan pada segala sesuatu waktu yang telah ditentukan; Yaitu ditentukannya masa iddah dan sempurnanya waktu istri , yang ia tidak sedang haid, begitu juga Allah jadikan kehidupan yang telah ditentukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam urusan agama dan dunianya, yaitu dengan bersandar kepada Allah dalam mendatangkan manfaat dan menolak madharrat serta percaya kepada-Nya dalam mewujudkan semua itu. Jika urusannya dalam tanggungan Allah Subhaanahu wa Ta'aala Yang Mahakaya, Mahaperkasa lagi Maha Penyayang, maka keperluannya sangat mudah sekali terpenuhi, akan tetapi terkadang hikmah ilahi menghendaki perkara itu ditunda sampai waktu yang tepat. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya Allah melaksanakan urusan-Nya.” Yakni qadha’ dan qadar-Nya pasti terlaksana. Dia telah menentukan waktunya dan ukurannya, tidak lebih dan tidak kurang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 3",
    "description": "Dan dia pun akan memberinya rezeki dari arah yang tidak disangka-sangkanya dengan memberikan kebutuhan fisik maupun kebutuhan ruhani. Dan barang siapa bertawakal kepada Allah dalam segala urusan, niscaya Allah cukup sebagai tempat mengadu bagi diri-Nya. Sesungguhnya Allah melaksanakan urusan-Nya dengan penuh hikmah bagi manusia. Sungguh, Allah telah menjadikan segala sesuatu dengan kadarnya sehingga setiap orang tidak akan menghadapi masalah di luar batas kemampuannya. 4. Dan adapun perempuan-perempuan yang tidak haid lagi, yaitu perempuan yang sudah menopause di antara istri-istri kamu jika kamu menjatuhkan talak kepadanya, maka masa idahnya jika kamu ragu-ragu adalah tiga bulan. Dan demikian pula masa idah bagi perempuan-perempuan yang tidak pernah haid sepanjang hidupnya juga tiga bulan. Sedangkan perempuan-perempuan hamil yang dijatuhi talak, maka waktu idah mereka itu ialah sampai mereka melahirkan kandungannya. Seusai melahirkan, maka masa idahnya berakhir. Dan barang siapa bertakwa kepada Allah dengan ketakwaan yang sesungguhnya dalam segala urusan, niscaya dia akan menjadikan kemudahan baginya dalam urusannya karena ketakwaannya."
  }
]