[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Para istri yang ditalak dan sudah tidak haid lagi karena mereka sudah tua, bila kalian ragu, tidak tahu apa hukum mereka, maka iddah mereka adalah 3 bulan, demikian juga wanita yang masih belum haid, iddahnya 3 bulan. Sedangkan wanita hamil, iddahnya adalah melahirkan kandungannya. Barangsiapa takut kepada Allah dan menerapkan hukum-hukumNya, niscaya Allah menjadikan urusannya mudah, di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Wanita-wanita tertalak yang menopause karena usia yang sudah tua, jika kalian ragu-ragu bagaimana iddah mereka, maka iddah mereka adalah tiga bulan. Dan wanita-wanita yang belum sampai pada umur haid karena masih muda, maka iddah mereka adalah tiga bulan juga. Adapun wanita-wanita yang hamil, batas iddah mereka karena ditalak atau karena ditinggal mati suami adalah jika mereka telah melahirkan. Barangsiapa bertakwa kepada Allah dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya niscaya Allah memudahkan berbagai urusan dan kesulitannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Wanita-wanita yang diceraikan yang telah menopause kerena usianya telah lanjut; jika kalian meragukan perhitungan masa iddah mereka, iddah mereka adalah tiga bulan qamariyah (hijriyah); begitu pula dengan iddah wanita-wanita yang belum mengalami haid karena usianya masih muda. Sedangkan wanita-wanita hamil, masa iddahnya adalah hingga mereka melahirkan. Dan barangsiapa yang bertakwa kepada Allah dengan mentaati hukum-hukum-Nya maka Allah akan memudahkan urusannya di dunia, dan memberinya taufik di akhirat. Diriwayatkan dari Abu Salamah, ia berkata: Suatu hari seorang lelaki datang kepada Ibnu Abbas, sedangkan Abu Hurairah duduk di sampingnya. Lalu lelaki itu berkata, ‘Berilah aku fatwa tentang wanita yang melahirkan 40 hari setalah kematian suaminya’. Maka Ibnu Abbas menjawab, ‘Masa iddahnya adalah masa yang paling lama, antara masa kehamilan dan masa 4 bulan 10 hari.’ Maka aku berkata -yakni Abu Salamah-, ‘Dan perempuan-perempuan yang hamil, waktu iddah mereka itu ialah sampai mereka melahirkan kandungannya. [at-Talaq: 4]’. Kemudian Abu Hurairah berkata, ‘Aku sepakat dengan saudaraku ini -yakni dengan Abu Salamah-‘. Maka Ibnu Abbas menyuruh seseorang untuk bertanya Ummu Salamah, maka dia menjawab, ‘Suami Subai’ah al-Aslamiyah terbunuh ketika dia dalam keadaan hamil, kemudian dia melahirkan setelah berlalu 40 hari. Lalu ada orang yang melamarnya, maka Rasulullah menikahkannya. Dan orang yang melamarnya ketika itu adalah Abu as-Sanabil’. (Shahih al-Bukhari 8/521-522, kitab tafsir, surat at-Talaq, ayat [وَٱلَّٰٓـِٔى يَئِسْنَ مِنَ ٱلْمَحِيضِ], no. 4909)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَالّٰٓـِٔى يَئِسْنَ مِنَ الْمَحِيضِ مِن نِّسَآئِكُمْ (Dan perempuan-perempuan yang tidak haid lagi (monopause) di antara perempuan-perempuanmu) Mereka adalah perempuan-perempuan tua yang telah berhenti dari haidh (menaopuse) إِنِ ارْتَبْتُمْ(jika kamu ragu-ragu (tentang masa iddahnya)) Yakni jika kalian ragu dan tidak mengetahui bagaimana menghitung masa iddahnya. فَعِدَّتُهُنَّ ثَلٰثَةُ أَشْهُرٍ وَالّٰٓـِٔى لَمْ يَحِضْنَ ۚ( maka masa iddah mereka adalah tiga bulan; dan begitu (pula) perempuan-perempuan yang tidak haid) Yakni perempuan yang belum mencapai masa haidh karena umurnya yang masih kecil. Masa iddah mereka adalah tiga bulan. وَأُو۟لٰتُ الْأَحْمَالِ أَجَلُهُنَّ أَن يَضَعْنَ حَمْلَهُنَّ (Dan perempuan-perempuan yang hamil, waktu iddah mereka itu ialah sampai mereka melahirkan kandungannya) Yakni masa iddah mereka habis bersamaan dengan kelahiraan kandungannya. وَمَن يَتَّقِ اللَّـهَ يَجْعَل لَّهُۥ مِنْ أَمْرِهِۦ يُسْرًا(barang -siapa yang bertakwa kepada Allah, niscaya Allah menjadikan baginya kemudahan dalam urusannya) Imam ad-Dhahhak mengatakan: yakni barangsiapa yang bertakwa kepada Allah dengan mencerai istrinya sesuai sunnah, maka Allah akan memudahkannya untuk melakukan rujuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Perempuan-perempuan yang telah sampai pada usia menopause karena sudah tua atau semacamnya sehingga haidnya sudah berhenti. Jika kalian menanyakan tentang masa iddah mereka (maknanya kalian tidak tahu sehingga bertanya) dan perempan-perempuan kecil atau yang sedang sakit sehingga darah (haid) mereka berhenti maka masa iddahnya adalah 3 bulan selama dalam keadaan ditalak bukan karena ditinggal mati, sedangkan masa iddah wanita hamil adalah sampai dia melahirkan. Barangsiapa menaati Allah, maka Dia akan memudahkan urusannya di dunia dan akhirat serta menolongnya dalam setiap kebaikan. Ayat ini diturunkan bagi perempuan yang masih muda maupun yang sudah tua yang sudah tidak haid dan mereka yang sedang hamil."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Perempuan-perempuan yang tidak mungkin haid lagi} yang telah selesai masa mereka karena usia tua mereka {di antara istri-istri kalian jika kalian ragu-ragu} kalian ragu-ragu sehingga tidak mengetahui masa iddahnya {maka iddahnya adalah tiga bulan. Dan perempuan-perempuan yang tidak haid} belum mencapai usia haid {Adapun perempuan-perempuan yang hamil} wanita yang hamil {waktu iddah mereka} masa iddah mereka {adalah sampai mereka melahirkan kandungannya. Siapa saja yang bertakwa kepada Allah, niscaya Dia menjadikan kemudahan baginya dalam urusannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Setelah Allah menyebutkan bahwa talak yang diperintahkan menjadi iddah bagi wanita, Allah kemudian menyebutkan masa iddah seraya berfirman, “Dan perempuan –perempuan yang putus asa dari haid di antara perempuan-perempuanmu,” karena sudah tidak haid lagi disebabkan usia tua atau lainnya yang tidak bisa diharapkan kembali lagi haidnya, maka iddah wanita seperti ini adalah tiga bulan, satu bulannya dijadikan sebagai padanan satu kali masa masa haid. “Dan begitu (pula) perempuan-perempuan yang tidak haid,” yakni wanita-wanita kecil yang belum haid atau wanita-wanita baligh yang sama sekali tidak haid, mereka sama seperti wanita-wanita yang sudah monopause, masa iddah mereka selama tiga bulan. Adapun wanita-wanita yang haid, maka masa iddahnya adalah sebagaimana yang disebutkan Allah dalam FirmanNya, “Wanita-wanita yang ditalak handaklah menahan diri (menunggu) tiga kali quru'” -Al-Baqarah:228- Dan Firman Allah, “Dan perempuan-perempuan yang hamil, waktu iddah mereka itu ialah sampai mereka melahirkan kandungannya,” yakni sampai melahirkan bayi yang ada dalam kandungannya, baik yang berisi satu bayi atau lebih. Dalam hal ini, bulan dan lainnya tidak menjadi patokan. “Dan barangsiapa yang bertakwa kepada Allah, niscaya Allah menjadikan baginya kemudahan dalam urusannya.” Maksudnya, barangsiapa yang bertakwa kepada Allah, maka urusannya akan dipermudah dan segala yang sulit akan digampangkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 4: Allah menjelaskan iddah bagi perempuan yang mereka telah terputus dari darah haidnya; Ketika ia tua, dan ia dinamakan dengan wanita yang telah menopause; Maka jika kalian ragu akan iddahnya, ketahuilah, iddah mereka adalah tiga bulan, begitu juga oada wanita yang tidak haid; Karena sebab masih muda atau karena sebab yang lain yang iddah mereka ditentukan selama tiga bulan, adapun masa iddah bagi wanita yang hamil, ditunggu sampai melahirkan. Ketahuilah barangsiapa yang takut kepada Allah maka wajib melaksanakan hukum-hukum-Nya; Agar dimudahkan urusannya di dunia dan di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Misalnya karena usianya yang masih kecil, maka ‘iddahnya selama tiga bulan. Adapun wanita-wanita yang haidh, maka ‘iddahnya sebanyak tiga kali quru’. Tentang masa iddah, lihat pula surah Al Baqarah ayat 228 dan 234. Baik karena ditalak maupun karena ditinggal wafat suaminya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 4",
    "description": "Dan adapun perempuan-perempuan yang tidak haid lagi, yaitu perempuan yang sudah menopause di antara istri-istri kamu jika kamu menjatuhkan talak kepadanya, maka masa idahnya jika kamu ragu-ragu adalah tiga bulan. Dan demikian pula masa idah bagi perempuan-perempuan yang tidak pernah haid sepanjang hidupnya juga tiga bulan. Sedangkan perempuan-perempuan hamil yang dijatuhi talak, maka waktu idah mereka itu ialah sampai mereka melahirkan kandungannya. Seusai melahirkan, maka masa idahnya berakhir. Dan barang siapa bertakwa kepada Allah dengan ketakwaan yang sesungguhnya dalam segala urusan, niscaya dia akan menjadikan kemudahan baginya dalam urusannya karena ketakwaannya. 5. Itulah aturan Allah yang diturunkan-Nya kepada kamu agar dilaksanakan dengan baik dan benar; barang siapa bertakwa kepada Allah dengan mantap, niscaya Allah akan menghapus kesalahan-kesalahannya sebagai penghargaan atas kepatuhannya; dan Allah akan melipatgandakan pahala baginya atas usahanya yang sungguh-sungguh."
  }
]