[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Perkara talak dan iddah tersebut adalah perintah Allah yang Dia turunkan kepada kalian (wahai manusia) agar kalian melaksanakannya. Barangsiapa takut kepada Allah dengan menjauhi laranganNya dan menunaikan kewajibanNya, niscaya Allah mengahpus dosa-dosanya, melipatgandakan pahala baginya di akhirat, dan memasukannya ke dalam surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Hukum talak, rujuk dan iddah yang disebutkan itu adalah hukum Allah yang diturunkan-Nya kepada kalian -wahai orang-orang yang beriman- untuk kalian laksanakan. Barangsiapa bertakwa kepada Allah dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya, niscaya Allah menghapus kesalahan-kesalahan yang pernah dilakukannya dan memberikan kepadanya pahala yang besar di Akhirat, yaitu masuk ke dalam Surga dan mendapatkan kenikmatan yang tidak habis."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Hukum-hukum berkedudukan tinggi yang disebutkan ini merupakan perintah Allah yang diturunkan kepada kalian -hai para hamba- agar kalian melaksanakannya dengan sungguh-sungguh. Dan barangsiapa yang bertakwa kepada Allah dengan mentaati hukum-hukum-Nya maka Allah akan menghapus dosa-dosanya dan mengagungkan pahalanya dengan memasukkannya ke dalam surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَيُعْظِمْ لَهُۥٓ أَجْرًا (dan akan melipat gandakan pahala baginya) Yakni memberinya pahala di akhirat berupa surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Hukum-hukum yang disebutkan itu, di antaranya hukum iddah adalah hukum yang diturunkan oleh Allah dalam Al-Quran untuk kalian wahai manusia agar kalian mengamalkannya. Barangsiapa mengamalkan ketaatan pada Allah, maka dosa-dosanya dihapus, aib-aibnya ditutupi, pahalanya dilipatgandakan dan akan diberikan surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itu merupakan perintah Allah yang diturunkan kepada kalian. Siapa saja yang bertakwa kepada Allah, niscaya Allah akan menghapus kesalahan-kesalahannya dan akan memperbesar pahala baginya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Itulah,” maksudnya hukum yang dijelaskan oleh Allah kepada kalian itu merupakan “perintah Allah yang diturunkanNya kepada kamu,” agar kalian mencontohnya dan mengagungkannya. “Dan barangsiapa yang bertakwa kepada Allah, niscaya Dia akan menutupi kesalahan-kesalahannya dan akan melipatgandakan pahala baginya.” Maksudnya, terhindar dari marabahaya dan mendapatkan apa yang diinginkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 5: Ketahuilah bahwa hukum itu yang telah Allah jelaskan kepada kalian atas urusan talak dan masa iddah, diturunkan kepada kalian agar kalian mentaatinya atas apa yang terkandung dalam hukum-hukum tersebut, dan bagi siapa yang ingin menjadikan pelindung dari adzab-Nya, dengan mentaati perintah-Nya dan menjauhi larangan-Nya; Maka Allah menghapuskan dosa-dosanya, dan mengampuninya, dan menyembunyikan aiba-aibnya dan memberikan ganjaran yang besar, dan dia akan masuk ke dalam surga yang penuh kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar kamu berjalan di atasnya, mengikutinya dan memuliakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 5",
    "description": "Itulah aturan Allah yang diturunkan-Nya kepada kamu agar dilaksanakan dengan baik dan benar; barang siapa bertakwa kepada Allah dengan mantap, niscaya Allah akan menghapus kesalahan-kesalahannya sebagai penghargaan atas kepatuhannya; dan Allah akan melipatgandakan pahala baginya atas usahanya yang sungguh-sungguh. 6. Pada ayat ini diperintahkan kepada para suami untuk menyiapkan tempat tinggal bagi istri mereka. Allah berfirman, 'tempatkanlah mereka, para istri, di mana kamu bertempat tinggal, yakni di tempat tinggal kamu yang layak menurut kemampuan kamu; dan janganlah kamu menyusahkan mereka, para istri untuk menyempitkan hati dan perasaan mereka. Dan jika mereka, istri-istri yang sudah ditalak itu sedang hamil, maka, wahai para suami, berikanlah kepada mereka nafkahnya sampai mereka melahirkan, karena itu merupakan bukti tanggung jawab kamu terhadap perempuan yang akan melahirkan keturunan kamu; kemudian jika mereka menyusukan anak-anak kamu, maka berikanlah imbalannya kepada mereka yang pantas; dan musyawarahkanlah di antara kamu tentang segala sesuatu berkenaan dengan nafkah dan imbalan menyusui anakmu dengan baik; dan jika kamu berdua saling menemukan kesulitan untuk memberikan asi kepada anakmu karena sesuatu dan lain hal, maka perempuan lain yang sehat boleh menyusukan anak itu untuk kelangsungan hidup-Nya dengan imbalan yang layak dan sadarilah bahwa anakmu akan menjadi anak persusuan perempuan itu."
  }
]