[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Tempatkanlah para istri kalian yang telah kalian talak itu selama masa iddah mereka di rumah seperti rumah yang kalian tinggali sesuai dengan kesanggupan dan kemampuan kalian, jangan membuat kesulitan terhadap mereka agar kalian bisa menyusahkan mereka dalam urusan tempat tinggal. Bila para istri kalian itu mengandung, maka nafkahilah mereka dalam masa iddah hingga mereka melahirkan. Bila mereka menyusui anak-anak mereka dari kalian dengan upah, maka bayarlah upah mereka. Hendaknya kalian saling sepakat di atas sesuatu yang baik dengan kerelaan dan keridhaan, bila kalian tidak setuju ibu yang menyusuinya, maka bapak akan mencari ibu susuan selain ibu yang ditalak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Ketika Allah menjelaskan hukum talak dan rujuk, maka Dia jelaskan pula hukum nafkah & tempat tinggal. Dia berfirman, \"Tempatkan mereka (para istri) -wahai para suami- di mana kalian tinggal sesuai dengan kemampuan kalian, dan Allah tidak memberikan beban lain kepada kalian. Dan janganlah kalian menyusahkan mereka dalam urusan nafkah dan tempat tinggal serta lain-lainnya karena ingin menindas mereka. Apabila wanita-wanita yang ditalak itu sedang hamil maka berilah nafkah kepada mereka hingga mereka melahirkan. Jika mereka menyusui anak-anak kalian untuk kalian maka berikanlah kepada mereka upah penyusuannya, dan hendaklah kalian menetapkan upah tersebut dengan baik. Apabila suami pelit terhadap permintaan upah dari istrinya lalu istrinya enggan untuk menyusui dan tidak rela kecuali dengan mendapatkan bayaran yang diinginkannya maka hendaknya si suami mengupah wanita lain untuk menyusui anaknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai orang-orang beriman, berilah tempat tinggal istri-istri yang telah kalian cerai dan sedang menjalani masa iddah di tempat tinggal yang setara dengan tempat tinggal kalian sesuai dengan kemampuan yang kalian miliki. Dan janganlah kalian mendatangkan mudharat bagi mereka dari sisi tempat tinggal dan nafkah. Dan jika istri-istri yang telah kalian cerai itu dalam keadaan hamil, maka berilah mereka infak hingga mereka melahirkan. Dan apabila mereka juga menyusui anak kalian setelah kalian berpisah maka berilah mereka upah atas penyusuan yang mereka lakukan. Dan hendaklah perkara yang ada di antara kalian berjalan dengan baik, tanpa ada hal yang saling merugikan. Namun jika kalian tidak memberi nafkah kepada mereka atas penyusuan itu, atau mereka meminta upah lebih banyak dari hak mereka, maka boleh bagi kalian untuk memberi upah wanita lain agar menyusui anak kalian. Fatimah binti Qais meriwayatkan bahwa Rasulullah tidak memberi hak tempat tinggal dan nafkah baginya. Maka al-Aswat mengambil segenggam pasir dan melemparnya kepada asy-Sya’bi (orang yang menyampaikan riwayat ini dari Fatimah), kemudian al-Aswat berkata, “Celakalah kamu, karena menyampaikan riwayat yang seperti ini. Padahal Umar telah berkata, ‘Kita tidak akan meninggalkan kitabullah dan sunnah Nabi kita hanya kerena perkataan dari seorang wanita yang tidak ketahui apakah dia salah ingat atau benar-benar lupa bahwa tentang hak tempat tinggal dan nafkahnya. Dan Allah telah berfirman: Janganlah kamu keluarkan mereka dari rumah mereka dan janganlah mereka (diizinkan) ke luar kecuali mereka mengerjakan perbuatan keji yang terang. [at-Talaq: 1]. (Shahih Muslim 2/1118-1119, setelah hadits 148, kitab talak, bab wanita yang telah ditalak tiga tidak memiliki hak nafkah)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. أَسْكِنُوهُنَّ مِنْ حَيْثُ سَكَنتُم (Tempatkanlah mereka (para isteri) di mana kamu bertempat tinggal) Ini merupakan penjelasan tentang hak wanita yang dicerai berupa hak untuk tetap tinggal di rumahnya. Yakni tempatkanlah mereka di sebagian tempat tinggal kalian. مِّن وُجْدِكُمْ(menurut kemampuanmu) Yakni sesuai kesanggupan dan kemampuan kalian. Hukum ini berlaku pada talak raj’i (talak pertama atau kedua), adapun untuk talak ke tiga maka si istri tidak lagi mendapat hak nafkah atau tempat tinggal. وَلَا تُضَآرُّوهُنَّ لِتُضَيِّقُوا۟ عَلَيْهِنَّ (dan janganlah kamu menyusahkan mereka untuk menyempitkan (hati) mereka) Dalam urusan tempat tinggal atau nafkah. وَإِن كُنَّ أُو۟لٰتِ حَمْلٍ فَأَنفِقُوا۟ عَلَيْهِنَّ حَتَّىٰ يَضَعْنَ حَمْلَهُنَّ ۚ( Dan jika mereka (isteri-isteri yang sudah ditalaq) itu sedang hamil, maka berikanlah kepada mereka nafkahnya hingga mereka bersalin) Dan tidak ada perselisihan di antara para ulama tentang kewajiban untuk memberi nafkah dan tempat tinggal bagi istri hamil yang diceraikan. فَإِنْ أَرْضَعْنَ لَكُمْ(kemudian jika mereka menyusukan (anak-anak)mu untukmu) Yakni istri-sitri yang ditalak itu menyusui anak kalian setelah itu. فَـَٔاتُوهُنَّ أُجُورَهُنَّ ۖ( maka berikanlah kepada mereka upahnya) Yakni upah karena telah menyusui anak itu. وَأْتَمِرُوا۟ بَيْنَكُم بِمَعْرُوفٍ ۖ( dan musyawarahkanlah di antara kamu (segala sesuatu) dengan baik) Ini adalah kalimat yang ditujukan kepada para suami dan istri yang berpisah karena perceraian. Yakni saling bermusyawarahlah dengan cara yang baik, dan hendaklah kalian saling menerima kebaikan yang diperuntukkan bagi anak, hal ini sebagaimana dalam firman Allah pada surat al-Baqarah: 233: فَإِنْ أَرَادَا فِصَالًا عَن تَرَاضٍ مِّنْهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيْهِمَا \"Apabila keduanya ingin menyapih (sebelum dua tahun) dengan kerelaan keduanya dan permusyawaratan, maka tidak ada dosa atas keduanya.\" وَإِن تَعَاسَرْتُمْ(dan jika kamu menemui kesulitan) Yakni perselisihan dalam upah menyusui, sang suami enggan memberi upah yang diminta ibu dari anaknya dan tidak mau menyusui jika tidak diberi upah sesuai dengan yang ia minta. فَسَتُرْضِعُ لَهُۥٓ أُخْرَىٰ (maka perempuan lain boleh menyusukan (anak itu) untuknya) Yakni meminta perempuan lain untuk menyusui anaknya dengan imbalan upah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Tempatkanlah wanita-wanita yang ditalak pada masa iddah itu di beberapa tempat kalian sesuai usaha dan kapasitas kalian dan janganlah kalian menyakiti mereka dalam memberi nafkah dan tempat tinggal dengan mengeluarkan mereka dari tempat-tempat mereka dengan penuh kebencian. Jika wanita yang ditalak itu dalam keadaan hamil maka nafkahilah sampai masa iddahnya yaitu sampai dia melahirkan. Tidak ada perdebatan di antara ulama’ tentang pemberian nafkah dan tempat tinggal bagi wanita hamil yang ditalak. Jika mereka menyusui anak kalian setelah bercerai, maka berilah mereka imbalan atas susuan itu. Uruslah urusan kalian dan bermusyawarahlah di antara kalian secara baik tanpa pengingkaran dengan memperbaiki muamalah melalui pemberian upah oleh ayah atas susuan dan pertolongan ibu kepada anaknya. Jika kalian satu sama lain sulit menentukan jumlah upah yang diberikan untuk ibu, karena dia meminta upah di atas harga biasanya atau karena ayah enggan memberikan upah. Maka ayah berhak memberi upah orang lain yang mau menyusui anaknya selain ibunya yang telah ditalak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tempatkanlah mereka di tempat yang kalian tinggali menurut kemampuan kalian} kemampuan dan kesanggupan kalian {dan janganlah menyusahkan mereka untuk menyempitkan mereka. Jika mereka itu sedang hamil, maka berikanlah kepada mereka nafkah sampai mereka melahirkan, kemudian jika mereka menyusukan (anak-anak) kalian maka berikanlah imbalannya kepada mereka; dan musyawarahkanlah di antara kalian} maka diskusikanlah satu sama lain {dengan baik} dengan tata cara yang baik dan baik bagi jiwa {dan jika kalian menemui kesulitan} kalian kesulitan dan berbeda pendapat terkait imbalan menyusui {maka perempuan lain boleh menyusukan untuknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Telah dijelaskan sebelumnya bahwa Allah melarang mengusir wanita-wanita yang dicerai dari rumah. Dalam ayat ini terdapat perintah untuk menempatkan mereka di tempat-tempat tinggal (yang layak) dengan cara yang baik, yaitu tempat yang mirip dengan rumah yang pernah ditinggali sesuai dengan ukuran kondisi suami. “Dan janganlah kamu menyusahkan mereka untuk menyempitkan (hati) mereka,” maksudnya jangan menyakiti mereka, baik dengan perkataan maupun perbuatan ketika kalian menempatkan mereka di rumah yang membuat mereka jemu sehingga mereka keluar dari rumah sebelum masa iddah selesai, karena dengan demikian, kalian sama saja dengan mengusir mereka. Kesimpulannya, tidak boleh mengeluarkan (mengusir) mereka dan mereka juga dilarang keluar meninggalkan rumah. Allah juga memerintahkan para suami yang menceraikan istrinya agar menempatkan mereka di rumah dengan cara yang baik dan tidak menimbulkan dampak mudarat maupun memberatkan. Masalah ini sepenuhnya dikembalikan pada kebiasaan (suatu masyarakat). “Dan jika mereka (istri-istri yang sudah ditalak) itu sedang hamil, maka berikanlah kepada mereka itu nafkahnya hingga mereka bersalin.” Hal itu dikarenakan janin yang ada di dalam kandungannya, jika yang bersangkutan dicerai ba’in. Dan nafkah berlaku untuknya dan untuk janinnya jika yang bersangkutan dicerai raj’i. Batas memberikan nafkah adalah melahirkan. Jika wanita-wanita yang dicerai telah melahirkan, maka apakah harus menyusui atau tidak, “kemudian jika mereka menyusukan (anak-anak) mu untukmu, maka berikanlah kepada mereka upahnya,” dengan menyebutkan bilangan nafkah untuk mereka jika memang disebutkan, dan jika tidak disebutkan, maka disesuaikan dengan upah umum yang berlaku. “Dan musyawarahkanlah di antara kamu (segala sesuatu), dengan baik,” maksudnya, hendaklah masing-masing dari pasangan suami-istri dan lainnya menyuruh dengan cara yang baik, yaitu semua hal yang terdapat maslahat dan manfaatnya di dunia dan akhirat. Karena melalaikan hal ini (yaitu memerintah dengan cara yang baik) berdampak bahaya yang hanya diketahui oleh Allah. Di samping itu, dalam hal memerintah dengan cara yang baik juga terkandung prinsip saling membantu dalam kebaikan dan takwa. Sehubungan dengan hal ini, pasangan suami istri yang berpisah pada masa iddah khususnya bagi yang sudah mempunyai anak pada umumnya disertai pertengakaran tentang nafkah untuk pihak istri yang dicerai dan juga nafkah untuk anaknya di samping perceraian yang umumnya terjadi dengan disertai kebencian. Pertengkaran akan amat dipengaruhi oleh sikap benci masing-masing pihak. Oleh karena itu, masing-masing dari suami maupun istri diperintahkan untuk saling bergaul dengan cara yang baik serta menjauhi pertentangan dan perpecahan, Allah memberi nasihat demikian. “Dan jika kamu menemui kesulitan,” karena kedua suami-istri tidak sepakat untuk menyusukan anak, “maka perempuan lain boleh menyusukan (anak itu) untuknya,” yakni selain istrinya yang dicerai. “maka tidak ada dosa bagimu apabila kamu memberikan pembayaran menurut yang patut.” –Al-Baqarah:233- Hal ini berlaku jika si anak mau disusui oleh wanita lain. Dan jika si anak hanya mau disusui oleh ibunya, maka ia mau tidak mau harus menyusuinya. Ia wajib menyusuinya dan boleh dipaksa jika enggan dan berhak mendapatkan upah umumnya jika kedua belah pihak (suami istri) tidak sepakat menentukan upah penyusuannya. Ketetapan ini bersumber dari ayat ini secara kontekstual (makna). Seorang anak ketika masih berada di dalam perut ibunya selama masa hamil tidak bisa keluar dari perut. Pada masa ini Allah menentukan nafkahnya wajib ditanggung oleh ayah si anak. Ketika lahir dan bisa mendapatkan makanan dari ibunya (melalui air susunya) atau dari wanita lain, Allah memberikan dua alternatif; jika si anak hanya mau menyusu dari air susu ibunya, maka ketentuannya seperti yang berlaku ketika masih hamil dan ibunya wajib menyusui agar bayinya kuat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 6: Allah menganjurkan kepada para suami untuk perhatian dengan istri, Allah memerintahkan mereka para suami untuk memberikan tempat tinggal selama masa iddah di rumah-rumah mereka para suami yang para isti tinggal di dalamnya; Menurut kemampuan suami, dan wajib bagi kalian wahai suami untuk tidak menyempitkan mereka dalam tempat tinggal dan nafkah, sampai mengharuskan mereka untuk keluar dan meninggalkan hak-hak mereka, meskipun mereka dalam kondisi hamil, maka para suami mesti menafkahi mereka dengan nafkah yang patut sampai melahirkan anak mereka, dan jika mereka menyusui anak-anak mereka, maka kalian para suami harus memberikan upah kepada mereka, dan musyawarakanlah wahai para suami atas apa yang didasari dengan kebaikan yang tidak berbentuk kemungkaran. Maka jika ibunya menolak untuk menyusui anaknya, kecuali dengan upah yang besar, maka wajib bagi kalian wahai para suami untuk mencari perempuan lain yang mau menyusui anak kalian, begitu juga seandainya mereka menahan untuk tidak menyusui karena sebab ingin upah yang besar atau yang lainnya, kalian haru memusyawarahkannya, untuk dapat menyusui anak kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Telah disebutkan sebelumnya, bahwa Allah Subhaanahu wa Ta'aala melarang mengeluarkan wanita-wanita yang ditalak dari rumah, dan di ayat ini Allah Subhaanahu wa Ta'aala memerintahkan untuk memberi mereka tempat tinggal. Ukuran tempat tinggal adalah secara ma’ruf (wajar) yaitu rumah yang biasa ditempati oleh orang yang semisal si laki-laki dan si wanita (standar) sesuai kemampuan suami. Yakni jangan menyusahkan mereka ketika mereka (istri-istri) menempati tempat tinggal itu baik dengan kata-kata maupun perbuatan dengan maksud agar mereka bosan sehingga mereka keluar dari rumah sebelum sempurna ‘iddahnya yang berarti kamu sama saja mengeluarkan mereka dari rumahmu. Kesimpulan ayat ini adalah larangan mengeluarkan mereka dari rumah, dan larangan bagi mereka (wanita yang ditalak) keluar dari rumah suami mereka serta perintah untuk memberi mereka tempat tinggal dengan cara yang tidak menimbulkan bahaya dan kesulitan, dan hal ini dikembalikan kepada ‘uruf (kebiasaan yang berlaku). Hal itu karena kandungan yang ada di perutnya jika wanita itu ditalak ba’in, namun jika ditalak raj’i, maka infak itu karena wanita itu dan kandungannya, dan nafkah berakhir sampai wanita itu melahirkan kandungannya. Jika mereka telah melahirkan kandungannya, maka mereka bisa menyusukan anak mereka atau tidak. Jika mereka menyusukan (anak-anak)mu, maka berikanlah imbalannya kepada mereka. Yang sudah ditentukan untuk mereka, jika belum ditentukan maka dengan upah mitsil (standar). Yakni hendaknya masing-masing dari suami dan istri serta selain dari keduanya bermusyawarah dengan baik. Untuk membuat kesepakatan terhadap upah yang diberikan, atau bermusyawarah untuk hal yang bermanfaat dan bermaslahat di dunia dan akhirat bagi keduanya dan bagi anak mereka, karena melalaikannya dapat menimbulkan keburukan dan bahaya yang banyak yang tidak diketahui kecuali oleh Allah Subhaanahu wa Ta'aala. Di samping itu, dalam bermusyawarah terdapat tolong-menolong terhadap kebaikan dan takwa. Termasuk yang perlu diterangkan pula di sini adalah bahwa suami dan istri ketika berpisah di masa ‘iddah, khususnya apabila lahir anak dari keduanya, biasanya terjadi pertengkaran dalam hal menafkahi si wanita dan si anak, yakni ketika sudah berpisah yang biasanya terjadi karena kebencian, dimana dari kebencian timbul banyak masalah. Oleh karena itulah, mereka diperintahkan bermusyawarah, berbuat baik, bermu’amalah secara baik, tidak bermusuhan dsb. Misalnya tidak terjadi kesepakatan agar si ibu menyusukan anaknya, maka bisa dicarikan wanita lain untuk menyusukan anaknya sebagaimana firman Allah Ta’ala, “Maka tidak ada dosa bagimu apabila kamu memberikan pembayaran menurut yang patut.” (Terj. Al Baqarah: 233). Hal ini apabila si anak menerima tetek selain ibunya, namun jika tidak menerima selain tetek ibunya, maka ibunya ditetapkan untuk menyusukannya dan diwajibkan kepadanya. Jika si ibu menolak, maka dipaksa, dan ia akan memperoleh imbalan standar jika tidak terjadi kesepakatan terhadap jumlah imbalannya. Hal ini diambil dari kandungan ayat tersebut dari sisi makna yang tersirat di dalamnya. Hal itu, karena anak berada di perut ibunya selama masa kehamilan, dimana ia (si anak) tidak dapat keluar darinya, maka Allah Subhaanahu wa Ta'aala menetapkan agar walinya menafkahi. Ketika sudah lahir, dan berkemungkinan si anak mendapatkan makanan dari ibunya atau dari selainnya, maka Allah Subhaanahu wa Ta'aala membolehkan hal tersebut (menyusukan dari ibunya atau dari wanita lain). Tetapi, jika si anak tidak dapat memperoleh makanan kecuali dari ibunya, maka ia seperti kandungan yang di perut ibunya dan ibunya ditetapkan untuk menyusukannya sebagai jalan untuk memberinya makan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 6",
    "description": "Pada ayat ini diperintahkan kepada para suami untuk menyiapkan tempat tinggal bagi istri mereka. Allah berfirman, 'tempatkanlah mereka, para istri, di mana kamu bertempat tinggal, yakni di tempat tinggal kamu yang layak menurut kemampuan kamu; dan janganlah kamu menyusahkan mereka, para istri untuk menyempitkan hati dan perasaan mereka. Dan jika mereka, istri-istri yang sudah ditalak itu sedang hamil, maka, wahai para suami, berikanlah kepada mereka nafkahnya sampai mereka melahirkan, karena itu merupakan bukti tanggung jawab kamu terhadap perempuan yang akan melahirkan keturunan kamu; kemudian jika mereka menyusukan anak-anak kamu, maka berikanlah imbalannya kepada mereka yang pantas; dan musyawarahkanlah di antara kamu tentang segala sesuatu berkenaan dengan nafkah dan imbalan menyusui anakmu dengan baik; dan jika kamu berdua saling menemukan kesulitan untuk memberikan asi kepada anakmu karena sesuatu dan lain hal, maka perempuan lain yang sehat boleh menyusukan anak itu untuk kelangsungan hidup-Nya dengan imbalan yang layak dan sadarilah bahwa anakmu akan menjadi anak persusuan perempuan itu. 7. Hendaklah orang yang mempunyai keluasan, yaitu suami yang berkecukupan, memberi nafkah kepada istri yang ditalaknya selama masa idah dan memberikan imbalan kepadanya karena telah menyusui anaknya, dari kemampuannya yang telah diberikan Allah kepadanya. Dan adapun orang yang terbatas rezekinya, yakni suami yang tidak sanggup, hendaklah memberi nafkah kepada istri yang ditalaknya selama masa idah dari harta yang diberikan Allah kepadanya sesuai dengan kesanggupannya. Allah tidak membebani seseorang melainkan sesuai dengan apa yang diberikan Allah kepadanya, rezeki dan kemampuan; Allah akan memberikan kemudahan kepada seseorang setelah ia menunjukkan kegigihan dalam menghadapi kesulitan."
  }
]