[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Hendaknya suami menafkahi istri yang ditalaknya dan anaknya sesuai kemampuannya bila rizki suami lapang. Barangsiapa disempitkan rizkinya, yakni dia miskin, maka hendaknya dia menafkahi sesuai dengan kadar yang Allah berikan. Orang yang miskin tidak dibebani seperti orang yang mampu. Allah akan menjadikan kelapangan dan kecukupan sesudah kesempitan dan kekurangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Hendaknya orang-orang yang mempunyai keleluasaan dalam harta itu memberikan nafkah kepada istri yang sudah ditalaknya dan anaknya sesuai dengan kemampuannya. Barangsiapa yang disempitkan rezekinya maka hendaknya ia memberikan nafkah dari apa yang diberikan Allah kepadanya. Allah tidak membebani seseorang kecuali sesuai dengan apa yang diberikan oleh Allah kepadanya. Dia tidak membebaninya lebih daripada itu dan lebih daripada kemampuannya. Setelah kondisinya sempit dan susah, Allah akan menjadikan kelapangan dan kekayaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hendaklah suami yang berkecukupan memberi nafkah kepada istri-istri yang diceraikannya dan yang sedang menyusui anaknya dengan rezeki yang telah Allah berikan kepadanya. Sedangkan suami yang rezekinya sempit maka hendaklah dia memberi nafkah sesuai dengan kemampuannya; Allah tidak membebani seseorang melainkan sesuai dengan rezeki yang telah Dia berikan, dan Allah akan mengganti kesulitan itu dengan kemudahan dalam waktu dekat atau tidak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. لِيُنفِقْ ذُو سَعَةٍ مِّن سَعَتِهِۦ ۖ (Hendaklah orang yang mampu memberi nafkah menurut kemampuannya) Ayat ini mengandung perintah bagi orang kaya untuk memberi nafkah bagi wanita yang menyusui anaknya sesuai dengan kemampuannya. وَمَن قُدِرَ عَلَيْهِ رِزْقُهُۥ(Dan orang yang disempitkan rezekinya) Yakni sempit dan fakir dalam rezekinya. فَلْيُنفِقْ مِمَّآ ءَاتَىٰهُ اللَّـهُ ۚ( hendaklah memberi nafkah dari harta yang diberikan Allah kepadanya) Yakni memberi nafkah sesuai dengan harta yang diberikan Allah kepadanya, tidak ada kewajiban baginya selain sesuai kemampuannya itu. لَا يُكَلِّفُ اللَّـهُ نَفْسًا إِلَّا مَآ ءَاتَىٰهَا ۚ( Allah tidak memikulkan beban kepada seseorang melainkan sekedar apa yang Allah berikan kepadanya) Maka orang fakir tidak boleh dibebani untuk memberi nafkah yang tidak ia mampu sebagaimana nafkah orang kaya. سَيَجْعَلُ اللَّـهُ بَعْدَ عُسْرٍ يُسْرًا (Allah kelak akan memberikan kelapangan sesudah kesempitan) Yakni setelah kesempitan dan kemiskinan Allah akan memberi kelapangan dan kekayaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Sebaiknya orang yang mampu itu memberikan nafkah sesuai kemampuannya kepada wanita-wanita yang ditalak dan wanita yang menyusui anaknya. Dan barang siapa tidak memiliki rejeki atau fakir maka sebaiknya dia menafkahkan apa yang diberikan oleh Allah sesuai kapasitasnya. Allah tidak membebani seseorang kecuali sesuai rejeki yang diberikan kepadanya baik sedikit maupun banyak. Cepat atau lambat, Allah akan mengubah kesulitan menjadi kemudahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hendaklah orang yang lapang} kaya {memberi nafkah menurut kemampuannya, dan orang yang disempitkan} disempitkan {rezekinya, hendaklah memberi nafkah dari sebagian yang dianugerahkan Allah kepadanya. Allah tidak membebani kepada seseorang melainkan (sesuai) dengan apa yang dianugerahkan Allah kepadanya. Allah akan menganugerahkan kemudahan setelah kesulitan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Kemudian Allah menentukan nafkah berdasarkan kondisi suami seraya berfirman, “Hendaklah orang yang mampu memberi nafkah menurut kemampuannya.” Maksudnya, orang yang kaya harus memberi nafkah sesuai ukuran kesanggupannya, dan bukan memberi nafkah layaknya orang miskin. “Dan orang yang disempitkan rizkinya hendaklah memberi nafkah dari harta yang diberikan Allah kepadanya,” yakni rizkinya disusahkan. “Allah tidak memikulkan beban kepada seseorang melainkan (sekedar) apa yang Allah berikan kepadanya.” Ini sesuai dengan hikmah dan rahmat illahi, karena menempatkan sesuatu sesuai ukurannya dan memberi keringanan bagi orang yang tidak punya. Allah tidak membebankan apa pun melainkan sesuai dengan rizki yang diberikan. Allah tidak membebankan kepada jiwa kecuali sebatas kesanggupannya dalam hal nafkah dan lainnya. “Allah kelak akan memberikan kelapangan sesudah kesempitan.” Ini adalah kabar gembira bagi mereka yang kurang mampu. Allah akan menghilangkan kesukaran dan beban berat mereka, “karena dalam setiap kesusahan itu pasti terdapat kemudahan dan kesulitan itu pasti dibarengi kemudahan.” (Al-Insyiroh 5-6)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 7: Allah memerintahkan para suami yang memiliki harta agar menambah mereka dalam hal nafkah untuk istri mereka dan untuk anak-anak mereka, dan jangan bersikap bakhil. Adapaun yang kondisinya sempit atas rezekinya dan faqir, maka dia menafkahkan atas apa yang diberikan Allah kepadanya. Karena Allah tidak membebani seorangpun kecuali atas dasar kemampuan, Allah tidak membebani seorang fakir sebagaimana seorang yang kaya. Ketahuilah bahwa Allah akan menjadikan setelah kesulitan kemudahan, dan setelah kesempitan kelapangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menentukan nafkah sesuai keadaan suami. Oleh karena itu, jangan sampai ia memberikan nafkah seperti nafkah yang dikeluarkan oleh orang-orang yang fakir jika ia sebagai orang yang kaya. Hal ini sesuai sekali dengan hikmah dan rahmat Allah, dimana Dia menetapkan masing-masingnya sesuai dengan keadaannya, Dia meringankan orang yang kesulitan dan tidak membebani kecuali sesuai dengan kemampuannya baik dalam hal nafkah maupun lainnya. Ayat ini merupakan berita gembira terhadap orang-orang yang kesulitan, bahwa Allah Subhaanahu wa Ta'aala akan menghilangkan kesulitan mereka dan mengangkat penderitaan mereka, karena sesungguhnya setelah kesulitan ada kemudahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 7",
    "description": "Hendaklah orang yang mempunyai keluasan, yaitu suami yang berkecukupan, memberi nafkah kepada istri yang ditalaknya selama masa idah dan memberikan imbalan kepadanya karena telah menyusui anaknya, dari kemampuannya yang telah diberikan Allah kepadanya. Dan adapun orang yang terbatas rezekinya, yakni suami yang tidak sanggup, hendaklah memberi nafkah kepada istri yang ditalaknya selama masa idah dari harta yang diberikan Allah kepadanya sesuai dengan kesanggupannya. Allah tidak membebani seseorang melainkan sesuai dengan apa yang diberikan Allah kepadanya, rezeki dan kemampuan; Allah akan memberikan kemudahan kepada seseorang setelah ia menunjukkan kegigihan dalam menghadapi kesulitan. 8. Dan betapa banyak penduduk dari suatu negeri yang mendurhakai perintah tuhan mereka dan rasul-rasul-Nya, seperti penduduk al-hijr, madyan, sodom, dan gomorah; maka kami buat perhitungan terhadap penduduk negeri itu dengan perhitungan yang ketat, yaitu dengan mengazab mereka di dunia sebanding dengan pembangkangannya; dan kami pun mengazab mereka dengan azab yang mengerikan di akhirat."
  }
]