[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Banyak negeri yang penduduknya durhaka kepada perintah Allah dan perintah Rasulullah, serta mereka bersikukuh dalam pelanggaran dan kekafiran mereka, maka Kami menghisab mereka atas amal-amal mereka di dunia dengan hisab yang berat, Kami mengazab mereka dengan azab yang besar lagi buruk. 9Maka mereka menelan akibat buruk dari pelanggaran dan kekafiran mereka. Akibat yang didapat oleh orang-orang kafir itu adalah kebinasaan dan kerugian yang tidak ada kerugian sesudahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Betapa banyak negeri-negeri yang tatkala mereka mengingkari perintah Rabbnya -Subḥānahu- dan perintah para Rasul-Nya -'alaihimussalām, Kami perhitungkan mereka dengan perhitungan yang ketat karena perbuatan buruk mereka, dan Kami siksa mereka dengan siksaan yang pedih di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Banyak sekali negeri yang penduduknya berbuat semena-mena dan berpaling dari perintah Allah dan para rasul-Nya. maka Kami membalas mereka atas dosa-dosa mereka dengan balasan yang berat, dan Kami azab mereka dengan azab yang besar; sehingga mereka merasakan akibat buruk dari kezaliman dan kekafiran mereka. Balasan kekafiran mereka adalah kehancuran di dunia dan azab api neraka di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَكَأَيِّن مِّن قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِۦ (Dan berapalah banyaknya (penduduk) negeri yang mendurhakai perintah Tuhan mereka dan Rasul-rasul-Nya) Yakni banyak sekali penduduk berbagai negeri yang melanggar perintah Allah dan Rasul-Nya. فَحَاسَبْنٰهَا حِسَابًا شَدِيدًا(maka Kami hisab penduduk negeri itu dengan hisab yang keras) Allah menghisab mereka atas amal perbuatan yang telah mereka lakukan di dunia. وَعَذَّبْنٰهَا عَذَابًا نُّكْرًا (dan Kami azab mereka dengan azab yang mengerikan) Yakni Kami azab penduduk negeri itu dengan azab yang keras di akhirat, sedangkan di dunia Kami azab mereka dengan kelaparan, kekeringan, terbunuh, tenggelam ke dalam tanah, dan dikutuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kebanyakan para penduduk negeri itu bermaiksiat terhadap perintah Tuhan mereka dan utusan-utusanNya. Kemudian Allah menghisab penduduk negri itu dengan hisab yang amat berat di dunia dengan mencabut nyawa mereka (dengan kasar), dan di akhirat dengan mengazab mereka. Allah akan menyiksa mereka dengan siksaan yang tidak biasa dan sangat pedih yaitu siksa neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Betapa banyak} betapa banyak {negeri yang mendurhakai} durhaka dan melanggar {perintah Tuhan mereka dan rasul-rasulNya, maka Kami buat perhitungan terhadap penduduk negeri itu dengan perhitungan yang ketat, dan Kami mengazab mereka dengan azab yang mengerikan} mengerikan dan dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. Allah mengabarkan bahwa Dia membinasakan umat-umat yang mendurhakai para rasul. Banyaknya jumlah mereka dan besarnya kekuatan mereka sama sekali tidak berguna bagi mereka ketika perhitungan amal yang amat dahsyat dan siksaan yang pedih datang, Allah menyiksa mereka karena perbuatan mereka yang buruk. Di samping siksaan dunia, Allah juga menyiapkan siksaan yang dahsyat bagi mereka kelak di Hari Akhir. “Maka bertakwalah kepada Allah hai orang-orang yang mempunyai akal,” maksudnya, wahai orang-orang yang berakal yang bisa memahami tanda-tanda kebesaran Allah, dan Dia-lah yang telah membinasakan umat-umat terdahulu karena mereka mendustakan para rasul. Orang-orang setelah mereka juga sama. Tidak ada perbedaan antara kedua golongan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 8: Allah mengabarkan banyaknya penduduk suatu negeri yang melampaui batas dan tidak menjalankan perintah-perintah Allah dan Rasul-Nya ﷺ; Allah mengancam atas penduduk negeri tersebut ketika nanti di yaumul hisab karena sebab apa yang mereka amalkan, dan Allah akan mengadzab penduduknya dengan adzab yang besar di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang pembinasaan-Nya terhadap umat-umat yang melampaui batas dan mendustakan para rasul, bahwa jumlah mereka yang banyak dan kekuatan mereka itu tidak bermanfaat sedikit pun bagi mereka ketika mereka dihisab dengan hisab yang ketat dan ketika mereka mendapat siksa yang pedih. Yang dimaksud dengan hisab dan azab di sini adalah hisab dan azab di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 8",
    "description": "Dan betapa banyak penduduk dari suatu negeri yang mendurhakai perintah tuhan mereka dan rasul-rasul-Nya, seperti penduduk al-hijr, madyan, sodom, dan gomorah; maka kami buat perhitungan terhadap penduduk negeri itu dengan perhitungan yang ketat, yaitu dengan mengazab mereka di dunia sebanding dengan pembangkangannya; dan kami pun mengazab mereka dengan azab yang mengerikan di akhirat. 9. Sehingga mereka, orang-orang yang mencemoohkan misi para rusul itu, merasakan akibat buruk dari perbuatannya, baik azab di dunia lebih-lebih azab di akhirat, dan akibat perbuatan mereka itu akan disadari oleh mereka di akhirat merupakan kerugian yang besar bagi diri mereka sendiri."
  }
]