[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Banyak negeri yang penduduknya durhaka kepada perintah Allah dan perintah Rasulullah, serta mereka bersikukuh dalam pelanggaran dan kekafiran mereka, maka Kami menghisab mereka atas amal-amal mereka di dunia dengan hisab yang berat, Kami mengazab mereka dengan azab yang besar lagi buruk. 9Maka mereka menelan akibat buruk dari pelanggaran dan kekafiran mereka. Akibat yang didapat oleh orang-orang kafir itu adalah kebinasaan dan kerugian yang tidak ada kerugian sesudahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Lalu mereka merasakan akibat dari perbuatan buruk mereka, dan akhir dari perbuatan mereka adalah kerugian di dunia dan kerugian di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. فَذَاقَتْ وَبَالَ أَمْرِهَا (Maka mereka merasakan akibat yang buruk dari perbuatannya) Yakni mereka menanggung kerasnya azab sebagai balasan atas kekafiran mereka. وَكَانَ عٰقِبَةُ أَمْرِهَا خُسْرًا (dan adalah akibat perbuatan mereka kerugian yang besar) Yakni kebinasaan di dunia dan azab di akhirat, sehingga mereka kehilangan harta, keluarga, dan diri mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Maka mereka akan menjumpai balasan atas kekufuran dan kezaliman mereka. Hukuman atas perbuatan mereka adalah pembinasaan dan kerugian, yaitu pembinasaan di dunia dan azab di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka mereka telah merasakan akibat buruk dari perbuatannya} akibat buruk dari kekufurannya {dan akibat perbuatan mereka itu adalah kerugian} kerugian di dunia dan akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. Allah mengabarkan bahwa Dia membinasakan umat-umat yang mendurhakai para rasul. Banyaknya jumlah mereka dan besarnya kekuatan mereka sama sekali tidak berguna bagi mereka ketika perhitungan amal yang amat dahsyat dan siksaan yang pedih datang, Allah menyiksa mereka karena perbuatan mereka yang buruk. Di samping siksaan dunia, Allah juga menyiapkan siksaan yang dahsyat bagi mereka kelak di Hari Akhir. “Maka bertakwalah kepada Allah hai orang-orang yang mempunyai akal,” maksudnya, wahai orang-orang yang berakal yang bisa memahami tanda-tanda kebesaran Allah, dan Dia-lah yang telah membinasakan umat-umat terdahulu karena mereka mendustakan para rasul. Orang-orang setelah mereka juga sama. Tidak ada perbedaan antara kedua golongan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Talaq ayat 9: Karena sebab melampaui batasnya penduduk negeri ini dan kekafiran mereka serta kesombongan mereka. mereka ditimpakan balasan atas amalan mereka, dan apa yang mereka perbuatan kecuali hanya kerugian di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Talaq Ayat 9",
    "description": "Sehingga mereka, orang-orang yang mencemoohkan misi para rusul itu, merasakan akibat buruk dari perbuatannya, baik azab di dunia lebih-lebih azab di akhirat, dan akibat perbuatan mereka itu akan disadari oleh mereka di akhirat merupakan kerugian yang besar bagi diri mereka sendiri. 10. Sejalan dengan ayat sebelumnya, Allah menyediakan azab yang keras bagi mereka, yaitu bagi orang-orang yang menolak beriman kepada-Nya; maka bertakwalah kepada Allah wahai orang-orang yang mempunyai akal, yaitu orang-orang yang berpikir, lagi beriman dan bertakwa kepada Allah supaya kamu terhindar dari azab yang mengerikan di akhirat. Sungguh, Allah telah menurunkan peringatan, yakni Al-Qur'an kepada kamu."
  }
]