[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit dan awan remuk pada hari kiamat, Ia mematuhi perintah Tuhannya pada apa-apa yang Dia perintahkan kepadanya untuk terbelah,dan patut baginya untuk taat kepada perintah tuhannya. Apabila bumi dibentangkan dan di hamparkan,gunung-gunungnya dihantam pada hari itu. Bumi melemparkan orang orang mati yang ada di dalam perutnya dan mengosongkan diri dari mereka. Dia taat kepada tuhannya pada apa yang Dia perintahkan kepadanya,dan patut baginya untuk taat kepada kepada perintah tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Jika langit telah terbelah untuk turunnya Malaikat dari sana."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-5. Allah menjelaskan betapa besar kekuasaan-Nya, karena langit dan bumipun tunduk kepada-Nya; agar para hamba mengambil pelajaran dari makhluk-makhluk yang agung ini, sehingga mereka dapat mempersiapkan diri dalam menghadapi hari kiamat: Jika langit telah terbelah dan mentaati perintah Tuhannya, dan dia memang harus mentaati-Nya; dan jika bumi telah dihamparkan, dan mengeluarkan mayat-mayat yang ada di dalamnya, serta mentaati perintah Tuhannya, dan dia memang harus mentaati-Nya. jika hal-hal ini telah terjadi maka manusia akan melihat kebaikan dan keburukan yang telah dia lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِذَا السَّمَآءُ انشَقَّتْ (Apabila langit terbelah) Terbelahnya langit adalah salah satu tanda kedatangan hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Telah dijelaskan dalam hadis sebelumnya dalam penjelasan surat At Takwir dan Al Infithar. Diriwayatkan dari Muslim dan Nasai bahwa Abu Hurairah membaca ayat “Apabila langit telah terbelah.” Kemudian beliau bersujud, setelah beranjak dikabarkan kepada mereka bahwa Nabi SAW bersujud ketika membaca ayat itu. 1. Apabila langit telah terbelah dan terpecah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila langit terbelah} terbelah pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-2 Allah berfirman menjelaskan perubahan yang akan terjadi pada makhluk-makhluk besar pada Hari Kiamat, “apabila langit terbelah,” yaitu pecah dan saling terpisah satu sama lain, bintang-bintangnya berhamburan, matahari dan rembulan gelap, “dan patuh kepada RAbbnya,” yakni mendengar perintah Allah dan siap mendengar FirmanNya. Yaitu patuh untuk hal itu, karena sesungguhnya langit ditundukkan dan diatur di bawah kekuasaan Raja Agung yang perintahNya tidak bisa didurhakai dan putusanNya tidak bisa ditentang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِذَا } Apabila { السَّمَاءُ } Secara bahasa : \"السماء \" adalah segala sesuatu yang berada diatas dan meninggi, dan itu dapat diartikan dalam dua makna : Makna pertama : segala sesuatu yang berada diatas dan meninggi, dan itu mencakup semua yang berada diats bumi seperti awan dan sebagainya. Makna kedua : Yaitu langit yang didirikan dengan kokohnya, yakni langit yang tujuh, dan makna inilah yang dimaksud dalam ayat ini, Allah ﷻ berfirman : { وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ } ( Dan langit itu Kami bangun dengan kekuasaan (Kami) dan sesungguhnya Kami benar-benar berkuasa ) [ Az-Zariyat : 47 ] Dinamakan \"السماء \" karena posisinya yang diatas dan meninggi, dan langit itulah sebgai atap bagi bumi, Allah ﷻ berfirman : { الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً } ( Dialah yang menjadikan bumi sebagai hamparan bagimu dan langit sebagai atap ) Allah menjadikan langit bagi kalian sebagai atap. Allah ﷻ juga berfirman : { وَجَعَلْنَا السَّمَاءَ سَقْفًا مَحْفُوظًا } ( Dan Kami menjadikan langit itu sebagai atap yang terpelihara ) [ Al-Anbiya' : 32 ] Dan langit itu telah Allah tetapkan aturannya, Allah berfirman : { تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ , الَّذِي خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ۚ وَهُوَ الْعَزِيزُ الْغَفُورُ , الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا ۖ مَا تَرَىٰ فِي خَلْقِ الرَّحْمَٰنِ مِنْ تَفَاوُتٍ ۖ فَارْجِعِ الْبَصَرَ هَلْ تَرَىٰ مِنْ فُطُورٍ } ( Maha Suci Allah Yang di tangan-Nya-lah segala kerajaan, dan Dia Maha Kuasa atas segala sesuatu , Yang menjadikan mati dan hidup, supaya Dia menguji kamu, siapa di antara kamu yang lebih baik amalnya. Dan Dia Maha Perkasa lagi Maha Pengampun , Yang telah menciptakan tujuh langit berlapis-lapis. Kamu sekali-kali tidak melihat pada ciptaan Tuhan Yang Maha Pemurah sesuatu yang tidak seimbang. Maka lihatlah berulang-ulang, adakah kamu lihat sesuatu yang tidak seimbang? ) [ Al-Mulk : 1-3 ] kamu sekali-kali tidak akan mendapati pada bagian manapun dari langit yang rusak, tapi akan tiba masanya Allah menginginkan usia dunia ini berakhir dan semua orang akan berpindah ke alam lain yaitu alam akhirat, maka langit itu pun akan terbelah disebabkan dahsyatnya guncangan pada peristiwa kiamat ketika itu, langit yang tujuh itu akan terbelah, Allah ﷻ berfirman : { وَيَوْمَ تَشَقَّقُ السَّمَاءُ بِالْغَمَامِ وَنُزِّلَ الْمَلَائِكَةُ تَنْزِيلًا } ( Dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut putih dan diturunkanlah malaikat bergelombang-gelombang ) [ Al-Furqan : 25 ]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذَا السَّمَاءُ انْشَقَّتْ “Apabila langit terbelah” انْشَقَّت [insyaqqat: terbelah]: Terbuka dan terpecah seperti dalam firman-Nya Ta’ala: وَإِذَا السَّمَاءُ فُرِجَتْ “dan apabila langit telah dibelah,”(QS. Al-Mursalat: 9) juga serti firman-Nya: فَإِذَا انْشَقَّتِ السَّمَاءُ فَكَانَتْ وَرْدَةً كَالدِّهَانِ (37) فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (38) فَيَوْمَئِذٍ لَا يُسْأَلُ عَنْ ذَنْبِهِ إِنْسٌ وَلَا جَانٌّ \" Maka apabila langit terbelah dan menjadi merah mawar seperti (kilapan) minyak. Maka nikmat Rabb kamu yang manakah yang kamu dustakan? Pada waktu itu manusia dan jin tidak ditanya tentang dosanya. \" (QS. Ar-Rahman: 37-39) Maka dari itu, terbelahnya langit akan terjadi di hari kiamat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 1: 1-5. Surat ini dimulai dengan penjelasan sebagian dari keadaan hari kiamat, Allah berkata : Jika langit terbelah dan retak, langit tersebut mematuhi dan taat dengan apa yang diperintahkan oleh Rabbnya dalam terbelahnya dan ia mentaati (Allah) dengan sebenar-benar ketaatan dan kepatuhan. Dan apabila bumi diratakan, dan mengeluarkan apa yang ada dalam perutnya mayat dan selainnya. Dan mengingkari amalan-amalan (manusia) yang ada di atasnya (perut bumi), Dan bumi mentaati Rabbnya dengan sebenar-benar ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan peristiwa yang akan terjadi pada hari Kiamat berupa terjadinya perubahan pada makhluk-makhluk yang besar, langit terbelah, bintang-bintang berjatuhan, matahari digulung dan bulan diredupkan cahayanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 1",
    "description": "1-2. Apabila langit yang kukuh itu terbelah ketika Allah menghilangkan keseimbangan di antara benda-benda langit. Terjadilah tabrakan antarbenda langit. Langit pun terbelah lalu digulung dan akhirnya terempas tidak berbekas. Dan langit pada saat itu patuh kepada tuhan pencipta dan pengatur-Nya, dan sudah semestinya langit itu patuh, demikian pula alam raya, kepada tuhan (lihat: surah fussilat/41: 11)"
  }
]