[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-15. Dan barangsiapa diberi buku catatan amalnya dari balik punggungnya.yaitu orang yang kafir kepada Allah, Dia akan berseru celaka dan binasa, Masuk kedalam api neraka dan merasakan panasnya. Orang ini adalah semasa di dunia berbahagia ditengah keluarganya dan terpedaya,tidak memikirkan akibat yang diperbuatnya untuk perhitungan amal, Tentu Allah mengembalikanya sebagaimana Allah menciptakannya pertama kali dan membalas dengan amal amalnya. Sesungguhnya tuhannya maha melihat dan maha mengetahui keadaannya sejak dia menciptakannya hingga membangkitkannya kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Adapun orang yang diberi catatan amal perbuatannya dengan tangan kirinya dari arah belakang punggungnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-15. Sedangkan orang kafir yang menerima catatan amalannya dengan tangan kiri dari belakang punggungnya, maka dia akan menyerukan kebinasaan bagi dirinya sendiri, dan memasuki neraka Jahannam yang menyala-nyala. Ketika di dunia dia bersenang-senang di keluarganya dengan berbagai kemaksiatan, dan dia merasa yakin tidak akan dibangkitkan atau disiksa. Namun tidak demikian, dia akan dibangkitkan dan dihisab atas segala perbuatan yang disaksikan Allah itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَأَمَّا مَنْ أُوتِىَ كِتٰبَهُۥ وَرَآءَ ظَهْرِهِۦ (Adapun orang-orang yang diberikan kitabnya dari belakang) Yakni karena tangan kanannya terikat ke lehernya, sedangkan tangan kirinya berada di belakangnya. Mereka adalah orang-orang kafir dan pelaku maksiat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "10-11. Sebagaimana ketika di dunia dia telah memposisikan al-Qur'an dibelakang punggungnya, maka di akhirat Allah menjadikan kitab catatan amalnya berada di belakang pula sebagai penghinaan baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Adapun, barangsiapa catatan amalnya diberikan dari arah kiri disertai dengan raut ketidaksenangan dari arah belakangnya, maka merekalah golongan orang-orang yang kafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang yang catatannya diberikan dari belakang punggungnya} dari sebelah kiri punggungnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 10-15 “Adapun orang yang diberikan kitabnya dari belakang,” yakni dengan tangan kiri dari belakang punggung, “maka dia akan berteriak, ‘Celakalah aku’ .” karena kehinaan dan dipermalukan serta apa yang didapatkan dalam catatan amalnya yang telah dilakukan dan belum sempat bertaubat darinya, “dan dia akan masuk ke dalam api yang menyala-nyala (neraka),” yakni diliputi oleh api neraka dari segala penjuru dan berbolak-balik di atas azabnya. Hal itu dikarenakan, “dia dahulu (di dunia) bergembira di kalangan kaumnya (yang sama-sama kafir),” dalam benaknya tidak terlintas adanya Hari Kebangkitan dan berbuat buruk. Dan tidak pernah menduga akan pulang kembali ke Rabbnya dan akan berdiri di hadapanNya. “(Bukan demikian), yang benar, sesungguhnya Raabnya selalu melihatnya,” tentu tidak baik bila dibiarkan sia-sia, tidak diperintah, dilarang, diberi pahala, dan disiksa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Inilah golongan manusia yang kedua pada hari perhitungan amal : Yaitu manusia yang diserahkan catatan amalannya dengan tangan kirinya dari arah belakang untuk menghinakannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Mereka adalah orang-orang yang sengsara wal-‘iyaadzu billaah, diberikan kitab catatannya dari belakang punggungnya, tidak dengan tangan kanannya. Dalam ayat lain di surat al-Haqqah “”(QS. AL-Haqqah: 25) dikatakan: Di antara mereka ada yang tidak diserahkan kitabnya dengan tangan kanannya maka terbagi menjadi dua golongan: di antara mereka ada yang diberikan kitabnya dengan tangan kiri, dan di antara mereka ada yang diberikan kitabnya dari belakang punggungnya. Yang lebih dekat kebenaran -wallaahu a’lam- bahwa ia diberikan kitabnya dengan tangan kiri namun tangannya melingkar ke belakang sehingga diserahkan dari arah belakang punggungnya, ini terdapat isyarat bahwa ia melepaskan kitab itu ke belakang punggungnya. Sehingga ia mengambilnya dengan tangan kiri kemudian ia pindahkan tangannya ke belakang, sebagai isyarat bahwa ia telah memalingkan kitab dari Allah ke belakang punggungnya, ia tidak memperdulikannya, tidak juga memberinya kedudukan dan tidak memandang pelanggarannya itu suatu keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 10: 10-15. Adapun yang diberikan kitab catatan amalannya dari sebelah kiri melalui belakang punggungnya, maka mereka akan diseru dengan kebinasaan bagi diri-diri mereka dan akan masuk ke dalam neraka yang menyala-nyala, tersiksa dengan panas (api) dan adzab di dalamnya. Karena mereka di dunia bersenang-senang bersama kaumnya dan lalai. Kemudian Allah jelaskan bahwasanya orang kafir menyangka tidak akan dikembalikan kepada Tuhannya dan tidak akan dihisab. Karena mereka termasuk orang yang angkuh dan fasiq. Maka Allah tegaskan bahwa mereka akan dikembalikan (kepada Rabbnya) dan dihisab atasa amalan mereka. Dimana akan nampak semua di hadapan Allah, dan tidak akan tersembunyi bagi Allah sesuatu apapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia adalah orang kafir, tangan kanannya dibelenggu ke lehernya dan tangan kirinya dijadikan ke belakang punggungnya, lalu ia mengambil catatan amal dengan tangan kirinya dari belakang punggungnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 10",
    "description": "10-12. Dan adapun orang yang catatan amal-Nya diberikan dari sebelah belakang sebagai tanda ketidaksenangan kepada mereka, maka dia akan berteriak, 'celakalah aku!' (lihat: surah al-h'qqah/69: 25'29). Dia merasa lebih baik mati daripada harus merasakan menghadapi azab yang akan menimpanya. Itulah balasan bagi mereka yang telah mendustakan rasul, mengingkari Allah, dan berbuat maksiat. Dan tidak hanya itu, dia juga akan masuk ke dalam api neraka yang menyala-Nyala dan kadar panasnya jauh lebih tinggi daripada api dunia"
  }
]