[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-19. Allah bersumpah dengan warna merah ufuk saat matahari terbenam, Juga dengan malam dan apa-apa yang mereka kumpulkan berupa hewan-hewan, serangga-serangga, binatang-binatang kecil lainnya, Dan juga rembulan saat dia menjadi purnama, Bahwa kalian (wahai manusia) akan mengalami fase-fase yang bermacam-macam dan keadaan yang berbeda-beda,dari setetes air lalu menjadi segumpal darah lalu menjadi segumpal daging hingga ditiupnya ruh hingga kematian lalu kebangkitan dan pengumpulan. Dan makhluk tidak boleh bersumpah kepada selain allah,dan siapa yang melakukannya,maka dia telah berbuat syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Allah bersumpah dengan cahaya merah yang ada pada ufuk setelah matahari tenggelam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-19. Demi ‘syafaq’ -yaitu warna merah yang muncul di langit ketika matahari terbenam-, Demi malam dan makhluk-makhluk yang terkumpul padanya, Demi bulan yang semakin besar hingga menjadi bulan purnama; Sungguh kalian -hai para hamba- akan melewati tahap-tahap di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. فَلَآ أُقْسِمُ بِالشَّفَقِ (Maka sesungguhnya Aku bersumpah dengan cahaya merah di waktu senja) Allah bersumpah dengan cahaya merah yang timbul setelah tenggelamnya matahari sampai datangnya waktu shalat isya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16-18. Aku (Allah) bersumpah demi cahaya merah di waktu senja, yaitu cahaya yang tampak setelah terbenamnya matahari sampai menjelang waktu ‘isya. Dan Aku bersumpah demi malam dan segala apa yang terselubungi dalam kegelapannya. Dan Aku bersumpah demi bulan yang sinar cahayanya terang pada malam 13, 14, dan 15 setiap bulan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku bersumpah} Aku bersumpah, huruf (Laa) digunakan untuk menguatkan sumpah {demi cahaya merah pada waktu senja} cahaya merah yang ada di ufuk barat ketika matahari terbenam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 16-19 Di tempat ini Allah bersumpah dengan tanda-tanda malam. Allah bersumpah dengan cahaya merah di waktu senja yang merupakan sisa-sisa cahaya matahari dan sebagai pembuka malam. “Dan demi malam dan apa yang diselubunginya,” yakni segala hewan dan apa saja yang terdapat padanya. “Dan demi bulan apabila jadi purnama,” yakni penuh cahaya karena purnama. Itulah hal terindah dan banyak manfaatnya. Obyek sumpah adalah Firman Allah, “Sungguh kamu melalui,” wahai manusia “tingkat demi tingkat (dalam kehidupan),” yakni berbagai fase dan kondisi yang berbeda dari setetes air, segumpal darah, segumpal daging hingga ditiupnya ruh, selanjutnya menjadi bayi mungil lalu remaja. Setelah itu pencatatan amal, perintah, dan larangan berlaku, kemudian setelah itu meninggal dunia. Selanjutnya dibangkitkan dan diberi balasan atas amal perbuatannya. Berbagai fase berbeda ini berlaku pada manusia yang menunjukkan bahwa hanya Allah semata yang berhak disembah, hanya Dia yang diesakan, Dia mengatur hamba-hambaNya dengan kebijaksanaan dan rahmatNya, sedangkan manusia adalah makhluk miskin, lemah di bawah pengaturan Allah yang Mahaperkasa lagi Mahah Penyayang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Allah ﷻ bersumpah dengan nama apapun dari makhluk-Nya yang Dia kehendaki, dan tentunya Allah bersumpah dengan nama makhluk-Nya yang darinya setiap hamba dapat mengambil pelajaran penting atau makhlu tersebut memeliki keutamaan dari makhluk lainnya, dengan tujuan agar manusia mengalihkan perhatiannya kepada makluk yang disebutkan dalam sumpah itu. { الشفق } yaitu rona merah senja yang terlihat dilangit setelah terbenamnya matahari di ufuk barat, jika matahari terbenam di ufuk barat akan terlhat rona merah senja dari cahaya matahri itu sampai tiba waktu isya, dan apabila cahaya merah itu telah hilang maka saat itulah awal waktu shalat isya, itulah makna dari \" الشفق \" darinya manusia dapat mengambil pelajaran yang sangat penting."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Sumpah pada firman-Nya فَلَا أُقْسِمُ بِالشَّفَقِ “Maka sesungguhnya Aku bersumpah dengan cahaya merah di waktu senja,” Terkadanga ada yang mengira bahwa makna لَا أُقْسِمُ [Laa Uqsimu] adalah peniadaan. Itu tidak tepat, yang tepat adalah justru menetapan. Huruf laa di sini didatangkan untuk peringatan. Ada ayat-ayat lain yang serupa, contohnya: لَا أُقْسِمُ بِهَذَا الْبَلَد “Aku benar-benar bersumpah dengan kota ini (Mekah),”(QS. Al-Balad: 1) لَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ “Aku benar-benar bersumpah dengan hari kiamat”(QS. Al-Qiyamah: 1) فَلَا أُقْسِمُ بِرَبِّ الْمَشَارِقِ وَالْمَغَارِبِ إِنَّا لَقَادِرُونَ \" Maka Aku bersumpah dengan Tuhan Yang Mengatur tempat terbit dan terbenamnya matahari, bulan dan bintang; sesungguhnya Kami benar-benar Maha Kuasa.\"(QS. Al-Ma’arij: 40) فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ “Aku benar-benar bersumpah dengan apa-apa yang kalian lihat” (QS. Al-Haqqah: 38) Semua huruf laa dinyatakan oleh para ulama Bahwa huruf-huruf la itu berfungsi sebagai peringatan, dan sumpahnya diberlakukan (tidak ditiadakan). Ada pun yang bersumah Dialah Allah ‘Azza Wa Jalla, ada pun atas nama yang dijadikan sumpah adalah lembayung senja dan yang diathafkan setelahnya. Jika ada yang bertanya: Mengapa Allah bersumpah saat menyampaikan berita padahal Dia jujur walau tanpa sumpah? Begitu juga mengapa Nabi shallallaahu ‘alaihi wa sallam bersumpah saat menyampaikan berita padahal Nabi jujur walau tanpa sumpah? Kita Jawab: Sumpah sebagai penegas pembicaraan. Dan Al-Quranul-kariim turun dengan bahasa orang arab, dan di antara kebiasaan mereka adalah menegaskan pembicaraan dengan sumpah, dengan demikian gaya bahasa seperti ini adalah kebiasaan pada bahasa orang arab yang dengannya al-Quran turun. Firmannya الشَّفَق [Asy-syafaq] lembayung yaitu sinar merah yang muncul setelah terbenamnya matahari. Jika sinar merah itu menghilang maka waktu maghrib telah habis, dan masuk waktu sholat isya, ini adalah pendapat mayoritas ulama."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 16: 16-19. Allah bersumpah dengan sumpah yang tegas dengan cahaya merah di ufuk setelah matahari terbenam. Allah juga bersumpah dengan malam dan apa yang terkumpul padanya dari ciptaan-Nya. Dan bersumpah dengan bulan apabila sempurna cahaya dan sinarnya pada pertengahan bulan atau menjadi purnama. Kemudian datang pada ayat selanjutnya jawaban atas sumpah Allah, dan Allah berkata : Engkau itu berproses wahai manusia ! Dalam dunia kalian sejak dilahirkan sampai kalian mati, dari satu urusan menuju urusan yang lain, dari kondisi yang satu menuju kondisi yang lain, dari masa ke masa, menuju ke masa yang yang lain; Hingga kalian kembali kepada Rabb kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah di ayat ini dengan tanda-tanda malam, dari mulai syafaq, malam dan apa yang diselubunginya atau ditutupinya seperti hewan-hewan atau lainnya, serta bulan ketika cahayanya penuh. Yang disumpahi adalah apa yang disebutkan di ayat 19. Yaitu cahaya merah yang berada di ufuk langit setelah terbenam matahari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 16",
    "description": "Tuhan mahakuasa di alam semesta. Maka aku bersumpah demi cahaya merah pada waktu senja, saat matahari akan terbenam dan cahayanya yang tampak kemerahan masih pendar ke sebagian penjuru langit. 17. Dan aku pun bersumpah demi malam dan apa yang diselubunginya dengan kegelapan akibat hilangnya cahaya matahari."
  }
]