[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-19. Allah bersumpah dengan warna merah ufuk saat matahari terbenam, Juga dengan malam dan apa-apa yang mereka kumpulkan berupa hewan-hewan, serangga-serangga, binatang-binatang kecil lainnya, Dan juga rembulan saat dia menjadi purnama, Bahwa kalian (wahai manusia) akan mengalami fase-fase yang bermacam-macam dan keadaan yang berbeda-beda,dari setetes air lalu menjadi segumpal darah lalu menjadi segumpal daging hingga ditiupnya ruh hingga kematian lalu kebangkitan dan pengumpulan. Dan makhluk tidak boleh bersumpah kepada selain allah,dan siapa yang melakukannya,maka dia telah berbuat syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan bersumpah dengan bulan apabila telah sempurna dan menjadi purnama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَالَّيْلِ وَمَا وَسَقَ (dan dengan malam dan apa yang diselubunginya) Yakni dan apa yang dikumpulkannya. Sebab malam akan mengumpulkan apa yang sebelumnya tersebar di siang hari, karena jika malam datang maka makhluk-makhluk akan kembali ke tempat tinggalnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16-18. Aku (Allah) bersumpah demi cahaya merah di waktu senja, yaitu cahaya yang tampak setelah terbenamnya matahari sampai menjelang waktu ‘isya. Dan Aku bersumpah demi malam dan segala apa yang terselubungi dalam kegelapannya. Dan Aku bersumpah demi bulan yang sinar cahayanya terang pada malam 13, 14, dan 15 setiap bulan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan demi bulan apabila jadi purnama} terkumpul dan purnama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 16-19 Di tempat ini Allah bersumpah dengan tanda-tanda malam. Allah bersumpah dengan cahaya merah di waktu senja yang merupakan sisa-sisa cahaya matahari dan sebagai pembuka malam. “Dan demi malam dan apa yang diselubunginya,” yakni segala hewan dan apa saja yang terdapat padanya. “Dan demi bulan apabila jadi purnama,” yakni penuh cahaya karena purnama. Itulah hal terindah dan banyak manfaatnya. Obyek sumpah adalah Firman Allah, “Sungguh kamu melalui,” wahai manusia “tingkat demi tingkat (dalam kehidupan),” yakni berbagai fase dan kondisi yang berbeda dari setetes air, segumpal darah, segumpal daging hingga ditiupnya ruh, selanjutnya menjadi bayi mungil lalu remaja. Setelah itu pencatatan amal, perintah, dan larangan berlaku, kemudian setelah itu meninggal dunia. Selanjutnya dibangkitkan dan diberi balasan atas amal perbuatannya. Berbagai fase berbeda ini berlaku pada manusia yang menunjukkan bahwa hanya Allah semata yang berhak disembah, hanya Dia yang diesakan, Dia mengatur hamba-hambaNya dengan kebijaksanaan dan rahmatNya, sedangkan manusia adalah makhluk miskin, lemah di bawah pengaturan Allah yang Mahaperkasa lagi Mahah Penyayang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالْقَمَرِ } Inilah sumpah ketiga dalam surah ini, { وَالْقَمَرِ إِذَا اتَّسَقَ } Dan dengan bulan apabila cahayanya sempurna menjadi bulan purnama, apabila bulan menjadi purnama yang indah bersinar yang menerangi langit dan bumi, inilah tanda-tanda kekuasaan Allah ﷻ, bulan juga merupakan salah satu tanda-tanda kekuasaan Allah yang paling besar, Allah ﷻ berfirman : { وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ } { Dan di antara tanda-tanda kekuasaan-Nya ialah malam, siang, matahari dan bulan } [ Fussilat : 37 ] . { وَالْقَمَرِ إِذَا اتَّسَقَ } Yakni bulan yang sempurna lingkarannya pada mala ke 14 dan malam ke 15, bulan adalah salah satu makhluk Allah yang menakjubkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالْقَمَرِ إِذَا اتَّسَقَ “dan dengan bulan apabila jadi purnama,” Rembulah sudah diketahui, kemudian makna إذا اتَّسَقَ [Idzattasaq] Yakni: Apabila cahayanya berkumpul secara sempurna, itu terjadi di malam-malam purnama. Allah ‘AzzaWaJallabersumpah dengan malam hari dan yang mengumpulkan. Dan dengan bulan karena bulan adalah tanda malam hari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 18: 16-19. Allah bersumpah dengan sumpah yang tegas dengan cahaya merah di ufuk setelah matahari terbenam. Allah juga bersumpah dengan malam dan apa yang terkumpul padanya dari ciptaan-Nya. Dan bersumpah dengan bulan apabila sempurna cahaya dan sinarnya pada pertengahan bulan atau menjadi purnama. Kemudian datang pada ayat selanjutnya jawaban atas sumpah Allah, dan Allah berkata : Engkau itu berproses wahai manusia ! Dalam dunia kalian sejak dilahirkan sampai kalian mati, dari satu urusan menuju urusan yang lain, dari kondisi yang satu menuju kondisi yang lain, dari masa ke masa, menuju ke masa yang yang lain; Hingga kalian kembali kepada Rabb kalian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 18",
    "description": "Dan aku bersumpah pula demi bulan apabila jadi purnama, ketika bulan bercahaya penuh sehingga suasana malam menjadi menawan. Perubahan suasana alam menunjukkan adanya kekuatan luar biasa yang mampu mengendalikannya. Dialah Allah yang mahakuasa. 19. Sungguh, akan kamu jalani kehidupanmu tingkat demi tingkat. Kamu semula berupa nutfah, lalu menjadi alaqah, menjadi mudgah, lalu menerima ruh dari tuhanmu, terlahir ke dunia, tumbuh dari kanak-kanak hingga dewasa dan tua. Akan kamu rasakan dalam hidupmu berbagai keadaan, dari yang mudah hingga yang sulit. Setelah itu kamu mati, dibangkitkan, dan dipisahkan menjadi dua kelompok: penghuni surga dan penghuni neraka."
  }
]