[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-19. Allah bersumpah dengan warna merah ufuk saat matahari terbenam, Juga dengan malam dan apa-apa yang mereka kumpulkan berupa hewan-hewan, serangga-serangga, binatang-binatang kecil lainnya, Dan juga rembulan saat dia menjadi purnama, Bahwa kalian (wahai manusia) akan mengalami fase-fase yang bermacam-macam dan keadaan yang berbeda-beda,dari setetes air lalu menjadi segumpal darah lalu menjadi segumpal daging hingga ditiupnya ruh hingga kematian lalu kebangkitan dan pengumpulan. Dan makhluk tidak boleh bersumpah kepada selain allah,dan siapa yang melakukannya,maka dia telah berbuat syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Sungguh kalian -wahai manusia- melewati tahapan demi tahapan mulai dari setetes mani, lalu segumpal darah, kemudian segumpal daging, lalu menjalani kehidupan, kematian dan kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. لَتَرْكَبُنَّ طَبَقًا عَن طَبَقٍ (sesungguhnya kamu melalui tingkat demi tingkat (dalam kehidupan)) Yakni keadaan demi keadaan, dari kekayaan menuju kemiskinan, kehidupan menuju kematian, dan masuk neraka atau masuk surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Wahai orang kafir, kalian sungguh-sungguh akan menghadapi tahap demi tahap hiruk pikuk rentetan hari kiamat, kemudian mati, dibangkitkan, padang mahsyar sampai penghitungan amal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sungguh kamu benar-benar akan menjalani tingkat demi tingkat} keadaan demi keadaan dari air mani, segumpal darah, daging, lalu hidup, mati, dan hidup lagi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 16-19 Di tempat ini Allah bersumpah dengan tanda-tanda malam. Allah bersumpah dengan cahaya merah di waktu senja yang merupakan sisa-sisa cahaya matahari dan sebagai pembuka malam. “Dan demi malam dan apa yang diselubunginya,” yakni segala hewan dan apa saja yang terdapat padanya. “Dan demi bulan apabila jadi purnama,” yakni penuh cahaya karena purnama. Itulah hal terindah dan banyak manfaatnya. Obyek sumpah adalah Firman Allah, “Sungguh kamu melalui,” wahai manusia “tingkat demi tingkat (dalam kehidupan),” yakni berbagai fase dan kondisi yang berbeda dari setetes air, segumpal darah, segumpal daging hingga ditiupnya ruh, selanjutnya menjadi bayi mungil lalu remaja. Setelah itu pencatatan amal, perintah, dan larangan berlaku, kemudian setelah itu meninggal dunia. Selanjutnya dibangkitkan dan diberi balasan atas amal perbuatannya. Berbagai fase berbeda ini berlaku pada manusia yang menunjukkan bahwa hanya Allah semata yang berhak disembah, hanya Dia yang diesakan, Dia mengatur hamba-hambaNya dengan kebijaksanaan dan rahmatNya, sedangkan manusia adalah makhluk miskin, lemah di bawah pengaturan Allah yang Mahaperkasa lagi Mahah Penyayang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sesungguhnya kalian akan melewati tahapan demi tahapan, dan keadaan demi keadaan yang berbeda-beda, dalam riwayat lain : { لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ } bahwasanya manusia dalam hidupnya terus berubah melaui tahapan-tahapan yang berbeda, dari janin di perut ibunya, kemudian setelah dilahirkan jadilah dia bayi yang disusui, kemudian anak-anak, kemudian remaja, kemudian dewasa, kemudian memasuki masa tua dan lanjut usia, kemudian mati dan dikuburkan, dan saat tiba waktunya dia akan dibangkitkan kembali dari kematiannya, itulah kondisi dan tahap-tahap yang akan dilewati oleh setiap manusia. Begitupun ketika Rasulullah ﷺ melakukan perjalanan malam ( isra' mi'raj ) menuju sidratul muntaha di langit ke tujuh, beliau melewai tahapan-tahapan berupa tujuh langit hingga akhirnya beliau ﷺ sampai ke sidratul muntaha."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 19: 16-19. Allah bersumpah dengan sumpah yang tegas dengan cahaya merah di ufuk setelah matahari terbenam. Allah juga bersumpah dengan malam dan apa yang terkumpul padanya dari ciptaan-Nya. Dan bersumpah dengan bulan apabila sempurna cahaya dan sinarnya pada pertengahan bulan atau menjadi purnama. Kemudian datang pada ayat selanjutnya jawaban atas sumpah Allah, dan Allah berkata : Engkau itu berproses wahai manusia ! Dalam dunia kalian sejak dilahirkan sampai kalian mati, dari satu urusan menuju urusan yang lain, dari kondisi yang satu menuju kondisi yang lain, dari masa ke masa, menuju ke masa yang yang lain; Hingga kalian kembali kepada Rabb kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan tingkat demi tingkat ialah dari setetes air mani sampai dilahirkan, kemudian melalui masa kanak-kanak, remaja dan sampai dewasa. Dari hidup menjadi mati kemudian dibangkitkan kembali untuk diberikan balasan. Tingkat demi tingkat yang dilalui hamba menunjukkan bahwa Allah Subhaanahu wa Ta'aala saja yang berhak disembah, Yang Mahaesa dan yang mengatur hamba-hamba-Nya dengan hikmah dan rahmat-Nya, dan bahwa hamba sangat fakir serta lemah di bawah pengaturan Yang Mahaperkasa lagi Maha Penyayang. Namun sayang, kebanyakan manusia tidak beriman, dan ketika dibacakan Al Qur’an kepada mereka, mereka tidak tunduk kepada Al Qur’an itu serta tidak mau tunduk kepada perintah-perintahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 19",
    "description": "Sungguh, akan kamu jalani kehidupanmu tingkat demi tingkat. Kamu semula berupa nutfah, lalu menjadi alaqah, menjadi mudgah, lalu menerima ruh dari tuhanmu, terlahir ke dunia, tumbuh dari kanak-kanak hingga dewasa dan tua. Akan kamu rasakan dalam hidupmu berbagai keadaan, dari yang mudah hingga yang sulit. Setelah itu kamu mati, dibangkitkan, dan dipisahkan menjadi dua kelompok: penghuni surga dan penghuni neraka. 20. Setelah melihat tanda-tanda kekuasaan Allah yang begitu nyata, maka mengapa mereka yang kafir itu bersikeras tidak mau beriman kepada Allah, hari kebangkitan, nabi Muhammad, dan Al-Qur'an'."
  }
]