[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit dan awan remuk pada hari kiamat, Ia mematuhi perintah Tuhannya pada apa-apa yang Dia perintahkan kepadanya untuk terbelah,dan patut baginya untuk taat kepada perintah tuhannya. Apabila bumi dibentangkan dan di hamparkan,gunung-gunungnya dihantam pada hari itu. Bumi melemparkan orang orang mati yang ada di dalam perutnya dan mengosongkan diri dari mereka. Dia taat kepada tuhannya pada apa yang Dia perintahkan kepadanya,dan patut baginya untuk taat kepada kepada perintah tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan langit mendengarkan Rabbnya dengan tunduk patuh, dan sudah semestinya hal itu bagi langit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَأَذِنَتْ لِرَبِّهَا (dan patuh kepada Tuhannya) Yakni mentaati Tuhannya dalam perintah yang Dia berikan kepadanya. وَحُقَّتْ(dan sudah semestinya langit itu patuh) Yakni dan semestinya langit taat dan tunduk kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Langit itu patuh dan taat terhadap perintah Allah. Patuh terhadap perintah untuk terbelah dan terpecah, dan sudah sepatutnya langit itu mendengar dan melaksanakan perintah Tuhannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{serta patuh kepada Tuhannya} dan mendengar dan tunduk kepada perintah Tuhannya {dan semestinya patuh} dan semestinya dia mendengar dan tunduk kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-2 Allah berfirman menjelaskan perubahan yang akan terjadi pada makhluk-makhluk besar pada Hari Kiamat, “apabila langit terbelah,” yaitu pecah dan saling terpisah satu sama lain, bintang-bintangnya berhamburan, matahari dan rembulan gelap, “dan patuh kepada RAbbnya,” yakni mendengar perintah Allah dan siap mendengar FirmanNya. Yaitu patuh untuk hal itu, karena sesungguhnya langit ditundukkan dan diatur di bawah kekuasaan Raja Agung yang perintahNya tidak bisa didurhakai dan putusanNya tidak bisa ditentang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَأَذِنَتْ لِرَبِّهَا } Langit itu mendengar perintah Allah ﷻ , dan langit itu pun mematuhi perintah Tuhannya, { وَحُقَّتْ } dan sudah seharunya dia patuh dan taat kepada penciptannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ “dan patuh kepada Rabbnya, dan sudah semestinya langit itu patuh,” Maknanya: Langit mendengar dan mematuhi perintah Rabb-nya ‘Azza Wa Jalla untuk menjadi terbelah. Maka terbelahlah langit itu walau pun ia tersifati seperti dalam firman Allah Ta’ala: سَبْعًا شِدَادًا “tujuh buah (langit) yang kokoh”(QS. An-Naba: 12) Kuat, sebagaimana Allah Ta’ala berfirman: وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ “Dan langit itu Kami bangun dengan kekuatan”(QS. Adz-Dzariyat: 47) maknanya: Dengan kekuatan. Langit-langit yang kuat dan besar ini, akan terpecah di hari kiamat, ia akan terpecah dan terbelah seizin Allah Subhaanahu Wa Ta’ala. وَحُقَّتْ [wa Huqqat] Maknanya: Terwujudnya izin baginya: Untuk mendengar dan patuh. Karena yang memerintahnya adalah Allah, Rabbnya, dan penciptanya ‘Azza Wa Jalla, sehingga ia mendengar dan patuh, sebagaimana ia mendengar dan patuh saat pertama kali di ciptakan. Di awal penciptaannya, Allah Tabaaraka wa Ta’ala berfirman: ثُمَّ اسْتَوَى إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ “Kemudian Dia menuju langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi: \"Datanglah kamu keduanya menurut perintah-Ku dengan suka hati atau terpaksa\". Keduanya menjawab: \"Kami datang dengan suka hati” (QS. Al-Fushilat: 11) Cermatilah wahai manusia yang lemah, bagaimana makhluk-makhluk yang besar itu mendengarkan dan mematuhi Allah ‘Azza Wa Jalla, kepatuhan yang agung ini terjadi saat di awal dan di akhir penciptaan. Di awal penciptaan, Allah berfirman: ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ “Datanglah kamu keduanya menurut perintah-Ku dengan suka hati atau terpaksa\". Keduanya menjawab: \"Kami datang dengan suka hati” Di akhir penciptaan: إِذَا السَّمَاءُ انْشَقَّتْ (1) وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ “Apabila langit terbelah, dan patuh kepada Rabbnya, dan sudah semestinya langit itu patuh,”Terwujudnya izin baginya: Untuk mendengar dan patuh. Kemudian kembali diulang, Allah berfirman: وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ “dan patuh kepada Tuhannya, dan sudah semestinya langit itu patuh,” Kebagai penegas bahwa ia benar-benar mendengar dan patuh kepada Rabb-nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 2: 1-5. Surat ini dimulai dengan penjelasan sebagian dari keadaan hari kiamat, Allah berkata : Jika langit terbelah dan retak, langit tersebut mematuhi dan taat dengan apa yang diperintahkan oleh Rabbnya dalam terbelahnya dan ia mentaati (Allah) dengan sebenar-benar ketaatan dan kepatuhan. Dan apabila bumi diratakan, dan mengeluarkan apa yang ada dalam perutnya mayat dan selainnya. Dan mengingkari amalan-amalan (manusia) yang ada di atasnya (perut bumi), Dan bumi mentaati Rabbnya dengan sebenar-benar ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena ia diatur dan ditundukkan oleh Allah Tuhannya, ia tidak mendurhakai perintah-Nya dan tidak akan menyelisihi ketetapan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 2",
    "description": "1-2. Apabila langit yang kukuh itu terbelah ketika Allah menghilangkan keseimbangan di antara benda-benda langit. Terjadilah tabrakan antarbenda langit. Langit pun terbelah lalu digulung dan akhirnya terempas tidak berbekas. Dan langit pada saat itu patuh kepada tuhan pencipta dan pengatur-Nya, dan sudah semestinya langit itu patuh, demikian pula alam raya, kepada tuhan (lihat: surah fussilat/41: 11). 3-5. Dan apabila bumi diratakan setelah gunung-gunung tersapu dari tempatnya akibat dahsyatnya kekuatan yang menghempaskannya. Gunung yang besar dan kekar berubah menjadi pasir yang kemudian diterbangkan oleh tiupan angin yang dahsyat, menjadi abu yang beterbangan. Dan apabila bumi memuntahkan apa saja yang ada di dalamnya, seperti manusia yang terkubur, batuan, dan sebagainya, dan karenanya menjadi kosong bagaikan ibu hamil yang telah melahirkan janinnya. Dan apabila bumi patuh kepada tuhan yang telah menciptakan-Nya, dan sudah semestinya bumi itu dan alam semesta tunduk patuh dalam kekuasaan dan genggaman-Nya. Ketika kejadian-kejadian luar biasa ini tiba, manusia akan mengetahui balasan atas semua perbuatannya."
  }
]