[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Apa yang menghalangi mereka untuk beriman kepada Allah dan hari akhir sesudah ayat ayat dijelaskan kepada mereka? Dan apabila al-qur’an dibacakan kepada mereka,mereka tidak sujud kepada Allah dan tidak menerima apa yang datang dari sisi NYA? Ciri khas orang orang kafir adalah mendustakan dan menyelisihi kebenaran. Allah lebih mengetahui tentang apa yang mereka simpan dalam dada mereka berupa penentangan, padahal mereka mengetahui bahwa apa yang dibawa oleh al-qur’an adalah kebenaran. Sampaikanlah kabar gembira kepada mereka (wahai rasul),bahwa Allah telah menyiapkan azab yang menyakitkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Mengapa orang-orang kafir itu tidak mau beriman kepada Allah dan Hari Akhir?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-25. Allah mengingkari dan mengolok orang-orang yang mendustakan-Nya: Mengapa mereka tidak beriman kepada Allah dan hari kebangkitan? Dan jika mereka mendengar al-Qur’an dibacakan, mereka tidak tunduk sujud kepada Allah? Akan tetapi orang-orang yang mengingkari Allah memang tabiat mereka akan mendustakan apa yang datang dari Allah, dan Allah Maha Mengetahui kekafiran dan permusuhan terhadap Islam yang mereka sembunyikan dalam dada. Hai Rasulullah, sampaikanlah azab pedih yang akan mereka dapatkan. Namun mereka yang bertaubat dan beriman serta mengamalkan perintah-perintah Allah dan menjauhi larangan-larangan-Nya, maka mereka akan mendapat pahala yang sempurna dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. فَمَا لَهُمْ لَا يُؤْمِنُونَ (Mengapa mereka tidak mau beriman?) Yakni beriman kepada al-Qur’an; padahal banyak sekali hal yang alasan yang mengharuskan mereka untuk beriman kepada al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Lalu mengapa orang-orang kafir dan musyrik itu tidak beriman kepada Allah dan beriman kepada hari kiamat? Padahal telah didatangkan berbagai bukti atas kebenaran kabar itu. Dan ketika mereka dibacakan ayat Alquran, mereka tidak merendahkan diri mereka untuk melaksanakan perintah Allah agar beriman kepada Alquran dan mekjizatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka, mengapa mereka tidak mau beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Meski demikian, masih banyak manusia yang tidak beriman, “dan apabila al-Qur’an dibacakan kepada mereka, mereka tidak bersujud,” yakni tidak tunduk merendahkan diri untuk al-Qur’an dan tidak tunduk pada perintah dan larangannya. “Bahkan orang-orang kafir itu mendustakan(nya),” yakni mendustakan kebenaran setelah jelas, sehingga tidak aneh bila mereka tidak beriman dan tidak tunduk pada al-Qur’an. Orang yang mendustakan adalah pembangkang yang tidak memiliki tipu daya di dalamnya. “Padahal Allah mengetahui apa yang mereka sembunyikan (dalam hati mereka),” yakni, terhadap apa yang mereka lakukan dan yang mereka niatkan secara rahasia. Allah mengetahui rahasia dan perbuatan terang-terangan mereka dan akan membalas amal perbuatan mereka. Karena itu Allah berfirman, “Maka berilah kabar gembira kepada mereka dengan azab yang pedih.” Berita dinamakan juga kabar gembira, karena berita itu berpengaruh di diri manusia, baik berita menyenangkan atau menyedihkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Lalu kenapa mereka tetap saja tidak beriman kepada Allah dan Rasul-Nya dan mngerjakan amalan-amalan yang akan mereka raih balasannya dia hari akhir, apakah yang menghalangi mereka ? Yang menghalangi mereka adalah kemalasan, tidak adanya keiimanan dalam diri mereka, serta hilangnya keyakinan, dan hanya menyibukkan diri untuk mencari kesenangan dan dunia. Tiada alasan bagi mereka untuk tidak menyatakan keimanan dan mengerjakan semua yang diperintahkan oleh syari'ah islam, bukankah Allah telah menjelaskan perkara-perkara yang menakutkan itu dalam Al-Qur'an, lalu kenapa mereka belum beriman kepada Allah, apa yang menjadi penghalang bagi mereka ? sungguh tidak ada alasan yang mereka pegang melainkan kekafiran dan pembangkangan yang mereka pelihara."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَمَا لَهُمْ لَا يُؤْمِنُونَ (20 “Mengapa mereka tidak mau beriman?” Maknanya apa yang menghalangi mereka dari keimanan? وَمَاذَا عَلَيْهِمْ لَوْ آمَنُوا بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَنْفَقُوا مِمَّا رَزَقَهُمُ اللَّهُ “Apakah kemudaratannya bagi mereka, kalau mereka beriman kepada Allah dan hari kemudian dan menafkahkan sebahagian rezeki yang telah diberikan Allah kepada mereka?”(QS. An-Nisa: 39) Maknanya: Apa yang menghalangi mereka dari keimanan, dan apa yang membahayakan mereka jika mereka mau beriman?! Orang berimana dari keluarga fir’aun berkata: أَتَقْتُلُونَ رَجُلًا أَنْ يَقُولَ رَبِّيَ اللَّهُ وَقَدْ جَاءَكُمْ بِالْبَيِّنَاتِ مِنْ رَبِّكُمْ وَإِنْ يَكُ كَاذِبًا فَعَلَيْهِ كَذِبُهُ وَإِنْ يَكُ صَادِقًا يُصِبْكُمْ بَعْضُ الَّذِي يَعِدُكُمْ “\"Apakah kamu akan membunuh seorang laki-laki karena dia menyatakan: \"Rabbku ialah Allah, padahal dia telah datang kepadamu dengan membawa keterangan-keterangan dari Rabbmu. Dan jika ia seorang pendusta maka dialah yang menanggung (dosa) dustanya itu; dan jika ia seorang yang benar niscaya sebagian (bencana) yang diancamkannya kepadamu akan menimpamu”(QS. Ghafir: 28)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 20: 20-24 Kemudian Allah berkata : Maka apapun yang dilakukan mereka orang-orang kafir (tidak ada manfaatnya), sampai-sampai (mereka) menolak kemampuan Allah terhadap hari kebangkitan. Dan jika dibacakan Al Qur’an, mereka tidak mau tunduk dan membantah perintah-perintah dan larangan-larangan Allah. Bahkan tabiat mereka sebenarnya adalah mendustakan. Allah lah Yang Maha Tahu atas apa yang terkumpul di dada-dada mereka dari kekufuran, kedustaan, dan kedengkian terhadap kaum muslimin. Maka kabarkan kepada mereka wahai Nabi ! Dengan adzab yang pedih yang menyakitkan sebagai balasan penolakan dan hal yang dirahasiakan dari kedustaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang kafir. Padahal bukti-buktinya begitu jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 20",
    "description": "Setelah melihat tanda-tanda kekuasaan Allah yang begitu nyata, maka mengapa mereka yang kafir itu bersikeras tidak mau beriman kepada Allah, hari kebangkitan, nabi Muhammad, dan Al-Qur'an'21. Dan mengapa pula apabila Al-Qur'an yang penuh nilai kebenaran dan sastra yang tinggi itu dibacakan kepada mereka, mereka tidak mau bersujud kepada Allah dan tunduk pada ajaran Al-Qur'an, padahal kaum kafir itu selalu menyanjung dan mengagumi karya sastra yang bernilai tinggi'."
  }
]