[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Apa yang menghalangi mereka untuk beriman kepada Allah dan hari akhir sesudah ayat ayat dijelaskan kepada mereka? Dan apabila al-qur’an dibacakan kepada mereka,mereka tidak sujud kepada Allah dan tidak menerima apa yang datang dari sisi NYA? Ciri khas orang orang kafir adalah mendustakan dan menyelisihi kebenaran. Allah lebih mengetahui tentang apa yang mereka simpan dalam dada mereka berupa penentangan, padahal mereka mengetahui bahwa apa yang dibawa oleh al-qur’an adalah kebenaran. Sampaikanlah kabar gembira kepada mereka (wahai rasul),bahwa Allah telah menyiapkan azab yang menyakitkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Jika dibacakan Al-Qur`ān atas mereka, mereka tidak bersujud kepada Rabb mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْءَانُ لَا يَسْجُدُونَ (dan apabila Al Quran dibacakan kepada mereka, mereka tidak bersujud) Yakni apa yang menghalangi mereka sehingga tidak bersujud dan tunjuk ketika dibacakan al-Qur’an. Pendapat lain mengatakan: yakni mereka tidak melakukan sujud tilawah ketika dibacakan ayat yang disyariatkan untuk sujud ketika mendengarnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Lalu mengapa orang-orang kafir dan musyrik itu tidak beriman kepada Allah dan beriman kepada hari kiamat? Padahal telah didatangkan berbagai bukti atas kebenaran kabar itu. Dan ketika mereka dibacakan ayat Alquran, mereka tidak merendahkan diri mereka untuk melaksanakan perintah Allah agar beriman kepada Alquran dan mekjizatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila Al-Qur’an dibacakan kepada mereka, mereka tidak bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Meski demikian, masih banyak manusia yang tidak beriman, “dan apabila al-Qur’an dibacakan kepada mereka, mereka tidak bersujud,” yakni tidak tunduk merendahkan diri untuk al-Qur’an dan tidak tunduk pada perintah dan larangannya. “Bahkan orang-orang kafir itu mendustakan(nya),” yakni mendustakan kebenaran setelah jelas, sehingga tidak aneh bila mereka tidak beriman dan tidak tunduk pada al-Qur’an. Orang yang mendustakan adalah pembangkang yang tidak memiliki tipu daya di dalamnya. “Padahal Allah mengetahui apa yang mereka sembunyikan (dalam hati mereka),” yakni, terhadap apa yang mereka lakukan dan yang mereka niatkan secara rahasia. Allah mengetahui rahasia dan perbuatan terang-terangan mereka dan akan membalas amal perbuatan mereka. Karena itu Allah berfirman, “Maka berilah kabar gembira kepada mereka dengan azab yang pedih.” Berita dinamakan juga kabar gembira, karena berita itu berpengaruh di diri manusia, baik berita menyenangkan atau menyedihkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ } Al-Qur'an yang didalamnya terkandung banyak pelajaran dan masehat serta peringatan, didalamnya juga terkandung keajaiban-keajaiban yang tidak dapat dibayangkan oleh akal dan fikiran manusia sebelumnya, ini perkataan Tuhan semesta alam sebaik-baiknya perkataan, inilah Al-Qur'an yang mulia yang diturunkan oleh Tuhan yang mulia melalui perantara Malaikat yang paling mulia kepada Nabi dan manusia yang paling mulia. Akan tetapi jika ayat-ayat Al-Qur'an dibacakan kepada orang-orang kafir dan musysrikin mereka tidak tunduk kepada perintah dan larangan yang ada didalamny. { وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ } Mereka tidak patut kepada perintah-perintah dan larangan-larangan yang terdapat didalam Al-Qur'an, mereka heran dan terkejut dengan apa yang terkandung didalamnya, keajaiban yang ada didalam Al-Qur'an tidak akan habis walau siapapun yang mencari batasnya, dan sesungguhnya dia tidak pernah mendapati celah ataupun aib didalam Al-Qur'an, dan setiap orang dapat memahami Al-Qur'an ini sesuai pemahaman yang Allah anugerahkan kepadanya, diantara manusia ada yang mampu mentadabburi isi Al-Qur'an dengan pemahaman yang lebih juga ada yang memhaminya dengan pemahaman terbatas, walau demikian sangat sedikit diantara mereka yang tunduk kepada syari'at yang terkandung didalamnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ “Dan apabila Al Qur'an dibacakan kepada mereka, mereka tidak bersujud,” Maknanya Mereka enggan tunduk kepada Allah ‘Azza Wa Jalla, sujud pada ayat ini bermakna tunduk kepada Allah, meskipun engkau tidak sujud ke tanah tapi hati tetap tunduk, lembut dan merendah. Jika demikian maka anda termasuk orang-orang beriman: وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا “dan apabila dibacakan kepada mereka ayat-ayat-Nya bertambahlah iman mereka”(QS. Al-Anfaal: 2) Jika hatimu tidak begitu maka pada dirimu ada keserupaan dengan orang-orang musyrik yang jika dibacakan al-Quran, mereka tidak sujud. Di antara ciri ketundukkan kepada Allah ‘Azza Wa Jalla saat membaca Al-Quran: Jika membaca ayat sajdah, seorang insan ia bersujud dalam rangka tunduk dan merendahkan padanya. Sebagian ulama menjadikan ayat ini sebagai dalil wajibnya sujud tilawah, mereka mengatakan: Jika seorang insan dibacakan ayat sajdah dan ia tidak sujud maka ia berdosa. Yang benar: Sujud tilawah tidak wajib. Meskipun pendapat ini adalah pendapat imam Abu Hanifah dan yang dipilih Syaikhul Islam Ibnu Taimiyah rahimahumallaah, namun pendapat ini adalah lemah. Itu dikarenakan terdapat dalam shahih dari Amiirulmu’minin Umar Bin Khathab radhiyallaahu ‘anhu, bahwa suatu hari beliau berkhutbah di hadapan orang-orang, beliau membaca surat an-Nahl. Ketika bacaannya sampai di ayat sajdah beliau turun dari minbar lalu beliau sujud. Kemudian di jum’at berikutnya beliau menbacanya juga dan melewati ayat tersebut namun beliau tidak sujud, lalu beliau radhiyallaahu ‘anhu berkata: “ Sesungguhnya Allah tidak mewajibkan kita sujud kecuali jika kita menghendaki ” Kejadian itu dihadiri oleh sahabat lainnya radhiyallaahu ‘anhu, dan tidak ada seorang pun dari mereka yang mengingkarinya. Den contoh-contoh Umar radhiyallaahu ‘anhu pun adalah di antara sunnah yang kita diperintahkan untuk mengikutinya. Dengan demikian maka pendapat yang rajih (yang kuat) adalah bahwa sujud tilawah tidaklah wajib, namun hukumnya adalah sunnah muakkadah. Jika anda melewati ayat sajdah maka bersujudlah di waktu kapan pun, subuh, sore, malam atau siang, engkau bertakbir saat sujud dan ketika anda bangkit maka tidak perlu bertakbir dan tidak mengucapkan salam, ini ketika sujudnya di luar shalat. Namun jika dalam shalat maka anda harus bertakbir saat sujud dan juga bertakbir saat bangkit, karena sujud tilawah jika dalam shalat maka ia masuk hukumnya seperti sujud dalam shalat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 21: 20-24 Kemudian Allah berkata : Maka apapun yang dilakukan mereka orang-orang kafir (tidak ada manfaatnya), sampai-sampai (mereka) menolak kemampuan Allah terhadap hari kebangkitan. Dan jika dibacakan Al Qur’an, mereka tidak mau tunduk dan membantah perintah-perintah dan larangan-larangan Allah. Bahkan tabiat mereka sebenarnya adalah mendustakan. Allah lah Yang Maha Tahu atas apa yang terkumpul di dada-dada mereka dari kekufuran, kedustaan, dan kedengkian terhadap kaum muslimin. Maka kabarkan kepada mereka wahai Nabi ! Dengan adzab yang pedih yang menyakitkan sebagai balasan penolakan dan hal yang dirahasiakan dari kedustaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 21",
    "description": "Dan mengapa pula apabila Al-Qur'an yang penuh nilai kebenaran dan sastra yang tinggi itu dibacakan kepada mereka, mereka tidak mau bersujud kepada Allah dan tunduk pada ajaran Al-Qur'an, padahal kaum kafir itu selalu menyanjung dan mengagumi karya sastra yang bernilai tinggi'22. Mereka enggan beriman, bahkan orang-orang kafir itu mendustakan Al-Qur'an dan hari kebangkitan dengan berbagai alasan, seperti dengki kepada nabi Muhammad, khawatir kehilangan status sosial, atau hanya merasa diri mulia."
  }
]