[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Apa yang menghalangi mereka untuk beriman kepada Allah dan hari akhir sesudah ayat ayat dijelaskan kepada mereka? Dan apabila al-qur’an dibacakan kepada mereka,mereka tidak sujud kepada Allah dan tidak menerima apa yang datang dari sisi NYA? Ciri khas orang orang kafir adalah mendustakan dan menyelisihi kebenaran. Allah lebih mengetahui tentang apa yang mereka simpan dalam dada mereka berupa penentangan, padahal mereka mengetahui bahwa apa yang dibawa oleh al-qur’an adalah kebenaran. Sampaikanlah kabar gembira kepada mereka (wahai rasul),bahwa Allah telah menyiapkan azab yang menyakitkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Bahkan orang-orang kafir ini mendustakan apa yang dibawa oleh Rasul mereka untuk mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. بَلِ الَّذِينَ كَفَرُوا۟ يُكَذِّبُونَ (bahkan orang-orang kafir itu mendustakan) Yakni mendustakan kitab yang mengandung pengukuhan tauhid, hari kebangkitan, pahala, dan siksa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22-23. Namun orang-orang kafir itu tetap mendustakan Alquran, hari kebangkitan dan hari perhitungan. Allah Maha Tahu atas kesyirikan, kekufuran dan rasa memusuhi Ilsam yang mereka sembunyikan di dalam dada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan orang-orang yang ingkar itu mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Meski demikian, masih banyak manusia yang tidak beriman, “dan apabila al-Qur’an dibacakan kepada mereka, mereka tidak bersujud,” yakni tidak tunduk merendahkan diri untuk al-Qur’an dan tidak tunduk pada perintah dan larangannya. “Bahkan orang-orang kafir itu mendustakan(nya),” yakni mendustakan kebenaran setelah jelas, sehingga tidak aneh bila mereka tidak beriman dan tidak tunduk pada al-Qur’an. Orang yang mendustakan adalah pembangkang yang tidak memiliki tipu daya di dalamnya. “Padahal Allah mengetahui apa yang mereka sembunyikan (dalam hati mereka),” yakni, terhadap apa yang mereka lakukan dan yang mereka niatkan secara rahasia. Allah mengetahui rahasia dan perbuatan terang-terangan mereka dan akan membalas amal perbuatan mereka. Karena itu Allah berfirman, “Maka berilah kabar gembira kepada mereka dengan azab yang pedih.” Berita dinamakan juga kabar gembira, karena berita itu berpengaruh di diri manusia, baik berita menyenangkan atau menyedihkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Bahkan orang-orang yang berada dalam kekafiran mendustakan isi Al-Qur'an yang mulia ini, mereka mengatakan : ini hanyalah cerita atau dongeng orang-orang terdahulu, ini ucapan manusia, ini, dan ini, mendustakannya, dan para pengikut kelompok al-jahmiyah dan al-mu'tazilah, serta kelompok al-asya'roh mengatakan : bahwasanya Allah tidak berbicara dan Al-Qur'an ini adalah perkataan Muhammad atau perkataan Jibril, itulah pemahaman sesat mereka tentang Al-Qur'an, dan perkataan mereka itu Allah simpan dalam Al-Qur'an : { إِنْ هَٰذَا إِلَّا قَوْلُ الْبَشَرِ } ( Ini tidak lain hanyalah perkataan manusia” ) [ Al-Mudattsir : 25 ] . ( بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ ) Mereka mendustakan Al-Qur'an yang mulia ini, dan peringatan dan ancaman yang ada didalamnya, berita-berita yang agung serta peringatan akan peristiwa hari kiamat yang maha dahsyat mereka pun mendustakannya ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ (22) وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ (23) “bahkan orang-orang kafir itu mendustakan (nya). Padahal Allah mengetahui apa yang mereka sembunyikan (dalam hati mereka).” Setelah Allah subhaanahu wa Ta’ala menyebutkan bahwa apabila mereka dibacakan al-Quran mereka tidak tunduk, Allah menjelaskan bahwa penyebab mereka enggan sujud adalah pendustaan mereka terhadapa yang dibawa oleh para rasul ‘alaihimussholaatu wassalaam, karena siapa saja yang imannya jujur maka pasti ia akan melaksanakan perintah dan meninggalkan larangan, karena keimanan yang jujur akan membawa pemiliknya kepada hal itu. Dan anda tidak akan mendapati seorang yang melakukan perkara-perkara yang haram atau meninggalkan kewajiban-kewajiban melainkan karena disebabkan oleh lemahnya iman. Oleh karenanya, menurut ahlussunnah waljama’ah keimanan adalah pembenaran yang berkosekuensi menerima dan patuh, maka kapan pun anda melihat seseorang yang meninggalkan kewajiban-kewajiban,atau sebagiannya, melakukan perkara-perkara haram maka ketahuilah bahwa keimanannya lemah. Andai saja keimanannya kuat maka ia tidak akan menyia-nyakan kewajiban dan tidak akan melakukan larangan-larangan, oleh karena itu Allah Ta’ala di sini berfirman: بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ (22) “bahkan orang-orang kafir itu mendustakan (nya).” Maknanya: Bahwa mereka meninggalkan sujud disebabkan karena pendustaan mereka terhadap risalah yang dibawa oleh rasul-rasul."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 22: 20-24 Kemudian Allah berkata : Maka apapun yang dilakukan mereka orang-orang kafir (tidak ada manfaatnya), sampai-sampai (mereka) menolak kemampuan Allah terhadap hari kebangkitan. Dan jika dibacakan Al Qur’an, mereka tidak mau tunduk dan membantah perintah-perintah dan larangan-larangan Allah. Bahkan tabiat mereka sebenarnya adalah mendustakan. Allah lah Yang Maha Tahu atas apa yang terkumpul di dada-dada mereka dari kekufuran, kedustaan, dan kedengkian terhadap kaum muslimin. Maka kabarkan kepada mereka wahai Nabi ! Dengan adzab yang pedih yang menyakitkan sebagai balasan penolakan dan hal yang dirahasiakan dari kedustaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah jelas kebenarannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 22",
    "description": "Mereka enggan beriman, bahkan orang-orang kafir itu mendustakan Al-Qur'an dan hari kebangkitan dengan berbagai alasan, seperti dengki kepada nabi Muhammad, khawatir kehilangan status sosial, atau hanya merasa diri mulia. 23. Dan mereka tetap ingkar, padahal Allah lebih mengetahui dengan pasti apa yang mereka sembunyikan dalam hati mereka. Allah akan membuka semua isi hati mereka kelak di hari kiamat."
  }
]