[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Apa yang menghalangi mereka untuk beriman kepada Allah dan hari akhir sesudah ayat ayat dijelaskan kepada mereka? Dan apabila al-qur’an dibacakan kepada mereka,mereka tidak sujud kepada Allah dan tidak menerima apa yang datang dari sisi NYA? Ciri khas orang orang kafir adalah mendustakan dan menyelisihi kebenaran. Allah lebih mengetahui tentang apa yang mereka simpan dalam dada mereka berupa penentangan, padahal mereka mengetahui bahwa apa yang dibawa oleh al-qur’an adalah kebenaran. Sampaikanlah kabar gembira kepada mereka (wahai rasul),bahwa Allah telah menyiapkan azab yang menyakitkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka kabarkanlah -wahai Rasul- kepada mereka siksa pedih yang menunggu mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ (Maka beri kabar gembiralah mereka dengan azab yang pedih) Allah menjadikan azab itu sebagai kabar gembira, untuk mengolok mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Maka kabarkanlah kepada mereka sebagai ancaman terhadap datangnya azab yang pedih. Maksud dari peringatan itu adalah sebagai celaaan dan hinaan kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka berilah mereka kabar gembira dengan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Meski demikian, masih banyak manusia yang tidak beriman, “dan apabila al-Qur’an dibacakan kepada mereka, mereka tidak bersujud,” yakni tidak tunduk merendahkan diri untuk al-Qur’an dan tidak tunduk pada perintah dan larangannya. “Bahkan orang-orang kafir itu mendustakan(nya),” yakni mendustakan kebenaran setelah jelas, sehingga tidak aneh bila mereka tidak beriman dan tidak tunduk pada al-Qur’an. Orang yang mendustakan adalah pembangkang yang tidak memiliki tipu daya di dalamnya. “Padahal Allah mengetahui apa yang mereka sembunyikan (dalam hati mereka),” yakni, terhadap apa yang mereka lakukan dan yang mereka niatkan secara rahasia. Allah mengetahui rahasia dan perbuatan terang-terangan mereka dan akan membalas amal perbuatan mereka. Karena itu Allah berfirman, “Maka berilah kabar gembira kepada mereka dengan azab yang pedih.” Berita dinamakan juga kabar gembira, karena berita itu berpengaruh di diri manusia, baik berita menyenangkan atau menyedihkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Inilah hasil dari perbuatan keji dan sikap buruk mereka terhadap Al-Qur'an, { فَبَشِّرْهُمْ } Maka sampaikanlah kepada mereka ( orang-orang kafir ) kabar gembira, yaitu kabar tentang azab dan siksaan yang disiapkan untuk mereka, yaitu azab yang sangat pedih bukan azab atau siksaan biasa, azab yang pedihnya tidak diketahui oleh siapapun melainkan hanya Allah ﷻ yang mengetahuinya, lalu apa yang menjadi peneyebab mereka di kabarkan dengan berita ini ? penyebabnya telah disebutkan pada penjelasan-penjelasan sebelumnya, yaitu bagaimana sikap, keadaan, dan kasus-kasus mereka dengan Rasulullah, dan dengan Kitab suci Al-Qur'an, inilah hasil dari ulah mereka bahwasanya bagi mereka adalah siksaan yang amat pedih di neraka Jahannah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Ini adalah ancaman bagi mereka dengan dalil firman Allah Ta’ala: فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ “Maka beri kabar gembiralah mereka dengan azab yang pedih,” beritakanlah kepada mereka dengan siksa yang pedih yang pasti akan terjadi, yang diajak bicara pada ayat ini adalah umum untuk Rasul shallallaahu ‘alaihi wa sallam dan setiap orang yang sesuai untuk dimasukkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 24: 20-24 Kemudian Allah berkata : Maka apapun yang dilakukan mereka orang-orang kafir (tidak ada manfaatnya), sampai-sampai (mereka) menolak kemampuan Allah terhadap hari kebangkitan. Dan jika dibacakan Al Qur’an, mereka tidak mau tunduk dan membantah perintah-perintah dan larangan-larangan Allah. Bahkan tabiat mereka sebenarnya adalah mendustakan. Allah lah Yang Maha Tahu atas apa yang terkumpul di dada-dada mereka dari kekufuran, kedustaan, dan kedengkian terhadap kaum muslimin. Maka kabarkan kepada mereka wahai Nabi ! Dengan adzab yang pedih yang menyakitkan sebagai balasan penolakan dan hal yang dirahasiakan dari kedustaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 24",
    "description": "Atas pengingkaran mereka terhadap kebenaran yang datang dari Allah, maka sampaikanlah kepada mereka ancaman berupa azab yang pedih di akhirat. 25. Demikianlah, Allah akan mengazab orang-orang yang ingkar. Kecuali orang-orang yang beriman dan mengerjakan kebajikan, mereka akan mendapat pahala yang tidak putus-putusnya sebagai anugerah dari Allah dan penghargaan atas perbuatan baiknya."
  }
]