[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi orang orang yang beriman kepada Allah dan rasul NYA, serta menunaikan apa yang Allah wajibkan atas mereka, bagi mereka pahala di akhirat yang tidak terputus dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Kecuali orang-orang yang beriman kepada Allah dan mengerjakan amal saleh, bagi mereka pahala yang tidak terputus, yaitu Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ (Maka beri kabar gembiralah mereka dengan azab yang pedih) Allah menjadikan azab itu sebagai kabar gembira, untuk mengolok mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Akan tetapi, orang-orang yang beriman kepada Allah, rasul-Nya, dan kedatangan hari kiamat, serta menjalankan perintah-Nya dan menjauhi larangan-Nya, akan ditetapkan kepada mereka pahala yang tidak terpotong, tidak berkurang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali orang-orang yang beriman dan beramal shalih. Bagi merekalah pahala yang tidak putus-putus} tidak terputus-putus dan tidak pula berkurang."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ini adalah kondisi kebanyakan manusia; mendustakan al-Qur’an dan tidak beriman padanya. Di antara manusia ada yang diberi petunjuk oleh Allah dan mereka beriman padaNya serta menerima risalah yang dibawa para rasul. Maka “mereka beriman dan beramal shalih,” sehingga “bagi mereka pahala yang tidak putus-putusnya,” yakni, tidak terputus dan pahalanya kekal yang belum pernah dilihat oleh mata, belum pernah didengar telinga, dan belum pernah terlintas di benak manusia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِلَّا الَّذِينَ آمَنُوا } Akan tetapi orang-orang yang beriman kepada Allah ﷻ dengan hatinya dan mereka percaya hanya kepada-Nya, { وَعَمِلُوا الصَّالِحَاتِ } dan mereka juga beriman kepada Allah dengan jiwa raga mereka yaitu dengan mengerjakan amal shalih, { لَهُمْ أَجْرٌ } bagi mereka balasan dari Tuhan mereka yang yang tidak diketahui jumlahnya melainkan hanya Allah ﷻ yang mengetahuinya, { غَيْرُ مَمْنُونٍ } yaitu nikmat yang tidak pernah terputus selamanya. Didunia Allah ﷻ menganugerahkan kepada Hamba-Nya nikmat yang melimpah, akan tetapi kenikmatan itu bisa saja terputus, sedangkan penghuni surga nikmat yang Allah ﷻ berikan kepada mereka tidak akan pernah terputus selamanya, kebahagiaan mereka akan terus terpancar diwajah mereka, semua itu karena ketaatan mereka kepada Allah ﷻ selama mereka hidup didunia. Golongan manusia pertama telah kafir kepada Allah ﷻ dan balasan bagi mereka adalah azab yang amat sangat pedih, dan Allah ﷻ sama sekali tidak berbuat zholim kepada hamba-Nya, melainkan Dia ﷻ membalas perbuatan setiap hamba-Nya, dan Allah ﷻ telah menjelaskan kepada manusia selaku hamba mana jalan yang benar dan mana yang buruk, maka barangsiapa yang menginginkan kebaikan Allah akan menghendaki pula padanya kebaikan dan Allah akan selalu membimbingnya, dan barangsiapa yang menginginkan keburukan maka Allah ﷻ akan berlepas tangan darinya dan akan menjauh darinya, dan membiarkannya bersama keburukan yang dia kehendaki, dan para syaithon lah yang akan bersamanya dan menuntunnya dalam melakukan segala keburukan dan kemaksiatan. Dan Allah ﷻ telah berfirman dalam Al-Qur'an : { فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنْتُمْ تَعْمَلُونَ } ( Maka pada hari ( kiamat ) itu seseorang tidak akan dirugikan sedikitpun dan kamu tidak dibalasi, kecuali dengan apa yang telah kamu kerjakan. ) [ Yaa Siin : 54 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ \" Tetapi orang-orang yang beriman dan beramal saleh, bagi mereka pahala yang tidak putus-putusnya.\"[Illa: kecuali] di sini bermakan tetap, istitsnaa (pengecualian dalam ilmu nahwu) di sini munqhathi’, dan tidak bisa dijadikan sebagai istitsna muttasil, karena orang-orang yang beriman bukanlah orang-orang yang mendustakan. Tetapi mereka adalah orang-orang yang beriman membenarkan. Istitsna munqathi’ adalah jika mustsna (yang dikecualikan) tidak sejenis dengan mustastna minhu. Maka ini adalah istitsaa munqathi’. Illa (kecuali) dimaknai dengan laakin (tetapi) . Maknanya: Tetapi orang-orang yang beriman dan beramal saleh bagi mereka ganjaran yang tak terhitung, mereka adalah orang orang yang beriman dengan hati-hati mereka, dan dengan keimanan itu, mereka melakukan amalan saleh. Mereka itulah yang tidak akan memperoleh siksa tidak juga sedang menunggu siksa, bagi mereka pahala yang tidak terputus. Dikatakan juga: balasan yang tidak diiringi umpatan dan celaan. Jika ditanya: Amalan shaleh seperti apa yang mendatangkan pahala? Jawabannya: Yaitu amalan saleh yang mengumpulkan dua perkara: Pertama: Ikhlas karena Allah Ta’ala. Yaitu dengan menginginkan dari amalannya itu kecuali wajah Allah ‘Azza Wa Jalla, mengharap ridha-Nya, mengharap pahala-Nya dan mengharap selamat dari neraka. Tidak menginginkan sesuatu berupa dunia beserta keindahannya. Karenanya para ulama mengatakan: Segala perbuatan yang bersifat ibadah tidak dibenarkan mengambil gaji darinya, seperti adzan, menjadi imam, membaca quran dan semisalnya. Tetapi tidak mengapa mengambil sebagian harta dari baitulmaal yang manfaatnya diperuntukkan bagi semua kaum muslimin, seperti azan, menjadi imam, mengajar dan sebagainya. Kedua: Amalan itu harus mengikuti Rasulullah shallallaahu ‘alaihi wa sallam. Yaitu: Seorang insan mengikuti Rasulullah shallallaahu ‘alaihi wa sallam dalam amalannya berupa perbuatan yang beliau perbuat dan meninggalkan yang beliau tinggalkan. Sedangkan yang Nabi shallallaahu ‘alaihi wa sallam lakukan dengan tujuan ibadah yang adanya sebab, maka sunnahnya adalah mengerjakannya jika ada sebabnya juga, dan segala amalan yang sebabnya itu ada di zaman Rasulullaah shallallaahu ‘alaihi wa sallam namun beliau tidak melakukannya maka sunnahnya adalah perbuatan itu ditinggalkan. لَهُمْ أَجْرٌ maknanya: Ganjaran, غَيْرُ مَمْنُونٍ maknanya: Tidak terputus. Bahkan dia terus menerus selama-lamanya. Ayat-ayat yang menyatakan kekalnya surga banyak dan diketahui di dalam al-Quran dan hadits. Ganjaran akhirat tidak terputus selamanya, tidak seperti di dunia, ada waktu munculnya buah dan ada waktu tidak berbuah, atau juga ada waktu tanah menumbuhkan tumbuhan dan ada waktu tidak menumbuhkan. Maka ganjaran di surga akan selalu ada وَلَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا “mereka rezekinya di surga itu tiap-tiap pagi dan petang.”(QS. Maryam: 62) Kita meminta kepada Allah agar menjadikan kita sebagai orang yang beriman yang mengamalkan amalan-amalan saleh, yang menjauhi perbuatan-perbuatan buruk, sungguh Dia Maha Dermawan Lagi Maha Mulia. Wa Shallallaahu ‘ala Nabiyyinaa Muhammadin wa ‘alaa aalihi wa ash-haabihi ajma’iin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 25: Allah puji terhadap penderitaan mereka yang beriman kepada Allah dan Rasul-Nya. Dan Allah kabarkan bahwa mereka mendapat balasan yang tidak dikurangi, tidak juga terputus dengan masa, dan tidak juga terputus keberkahannya bagi mereka. Mereka akan menikmati kenikmatan yang sekekal-kekalnya (di surga)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara sekian manusia itu ada segolongan yang Allah berikan hidayah, mereka beriman kepada Allah dan menerima apa yang dibawa para rasul, mereka pun beriman dan mengerjakan amal saleh. Mereka inilah yang mendapatkan pahala yang tidak putus-putusnya; untuk mereka pahala yang kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 25",
    "description": "25. Demikianlah, Allah akan mengazab orang-orang yang ingkar. Kecuali orang-orang yang beriman dan mengerjakan kebajikan, mereka akan mendapat pahala yang tidak putus-putusnya sebagai anugerah dari Allah dan penghargaan atas perbuatan baiknya. 1-3. Allah bersumpah demi tiga hal yang luar biasa, baik kejadian maupun prosesnya. Demi langit luas yang mempunyai gugusan bintang atau orbit-orbit bintang ketika beredar di angkasa, yang menjadi penanda kekuasaan Allah yang tidak terbatas. Dan demi hari yang dijanjikan. Itulah hari kiamat, kebangkitan, dan perhitungan yang pasti datang dengan segala kejadian dan kerepotan yang luar biasa di dalamnya. Demi orang yang menyaksikan hari yang dijanjikan itu dan kejadian-kejadian mengerikan dan mencengangkan yang disaksikan oleh mereka pada hari itu."
  }
]