[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit dan awan remuk pada hari kiamat, Ia mematuhi perintah Tuhannya pada apa-apa yang Dia perintahkan kepadanya untuk terbelah,dan patut baginya untuk taat kepada perintah tuhannya. Apabila bumi dibentangkan dan di hamparkan,gunung-gunungnya dihantam pada hari itu. Bumi melemparkan orang orang mati yang ada di dalam perutnya dan mengosongkan diri dari mereka. Dia taat kepada tuhannya pada apa yang Dia perintahkan kepadanya,dan patut baginya untuk taat kepada kepada perintah tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan jika bumi telah diratakan oleh Allah sebagaimana Dia meratakan permukaannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَإِذَا الْأَرْضُ مُدَّتْ (dan apabila bumi diratakan) Yakni diratakan dan dicabut gunung-gunungnya sehingga menjadi tanah yang sangat rata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Apabila bumi telah dihamparkan dan diratakan, gunung-gunung dan semua apa yang ada di atasnya dihilangkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila bumi diratakan} dilapangkan, diratakan dan diluaskan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 3-5 “Apabila bumi diratakan,” yakni, digoncang hingga bergetar, gunung yang ada di atasnya diratakan dan segala bangunan diratakan. Allah meratakan bumi serata-ratanya hingga menjadi amat luas yang mencukupi untuk manusia yang menunggu di tempat pemberhentian meski jumlah mereka banyak. Bumi menjadi luas terbentang, tidak terlihat adanya dataran rendah dan juga bukit. “Dan memuntahkan apa yang ada di dalamnya,” memuntahkan mayat dan simpanan-simpanan bumi, “dan menjadi kosong” dari mereka. Sangkakala ditiup, mayat-mayat pun keluar dari kubur ke permukaan tanah. Bumi mengeluarkan semua kandungannya hingga seperti bongkahan (lempengan) besar yang disaksikan oleh seluruh manusia, mereka pun menyesali apa yang dulu pernah mereka perlombakan. “Dan patuh kepada Rabbnya, dan sudah semestinya bumi itu patuh, (pada waktu itu manusia akan mengetahui akibat perbuatannya).”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan apabila bumi dihamparkan dan diluaskan agar memuat seluruh makhluk dibumi dan mereka pun beridiri diatasnya untuk hari perhitungan amal dan pembalasan. Gunung-gunung diatasnya dihilangkan serta seluruh bangunan-bangunan tinggi, maka berubahlah permukaan bumi itu menjadi seperti yang Allah katakan dalam Al-Qur'an : { فَيَذَرُهَا قَاعًا صَفْصَفًا , لَا تَرَىٰ فِيهَا عِوَجًا وَلَا أَمْتًا } ( Maka Dia akan menjadikan (bekas) gunung-gunung itu datar sama sekali , Tidak ada sedikitpun kamu lihat padanya tempat yang rendah dan yang tinggi-tinggi ) [ Thaha : 106-107 ] bumi diratakan dan dipermukaannyalah seluruh makhluk akan dikumpulkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا الْأَرْضُ مُدَّتْ “dan apabila bumi diratakan” Bumi yang kita huni saat ini tidak terbentang, pertama-tama: dia berbentuk bulat berputar, meski pin sebelah utara dan selatannya sedikit nampak terbuka, terbentang sedikit, dia berputar. Kedua: Kemudian ia juga bergelombang, ada yang sangat tinggi, ada dataran rendah, ada lembah-lembah, ada tebing-tebing, ada pasir. Ia tidak rata namun nanti pada hari kiamat وَإِذَا الْأَرْضُ مُدَّتْ “dan apabila bumi diratakan” Maknanya; Akan terbentang dengan bentangan yang satu seperti dibentangkannya kulit. Seakan akan dibentangkan seperti kulit yang rata. Sampai sampai semua manusia yang di atasnya akan bisa mendengarkan yang memanggil, dapat melepaskan pandangan mata, tetapi saat ini pandangan tidak dapat terbentangkan. Seandainya manusia saat ini melepaskan pandangannya maka anda akan mendapatkan orang-orang yang jauh lebih rendah, tidak terlihat. Tetapi di hari kiamat kelak pandangan mereka akan dibentangkan sehingga orang-orang yang jauh sama seperti orang-orang yang berjarak dekat, sebagaimana telah diberitakan dalam sebuah hadits: يَجْمَعُ اللهُ تَعَالَى يَوْمَ الْقِيَامَةِ الْأَوَّلِيْنَ وَالْآخِرِيْنَ فِيْ صَعِيدٍ وَاحِدٍ، فَيَسْمَعُهُمُ الدَّاعِي، وَيَنْفُذُهُمْ الْبَصَرِ “ Allah Ta’ala akan mengumpulkan seluruh makhluk pada hari kiamat, yang terdahulu maupun yang terakhir di satu tanah, penyeru akan terdengar oleh mereka, dan pandangan mata akan terbentang ” (1) (1) dikeluarkan Bukhari (3340) dan Muslim (194) dari hadits Abu Hurairah radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 3: 1-5. Surat ini dimulai dengan penjelasan sebagian dari keadaan hari kiamat, Allah berkata : Jika langit terbelah dan retak, langit tersebut mematuhi dan taat dengan apa yang diperintahkan oleh Rabbnya dalam terbelahnya dan ia mentaati (Allah) dengan sebenar-benar ketaatan dan kepatuhan. Dan apabila bumi diratakan, dan mengeluarkan apa yang ada dalam perutnya mayat dan selainnya. Dan mengingkari amalan-amalan (manusia) yang ada di atasnya (perut bumi), Dan bumi mentaati Rabbnya dengan sebenar-benar ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga tidak ada lagi bangunan maupun pegunungan, dan bumi pun menjadi semakin luas sehingga dapat menampung orang-orang yang berada di mauqif (tempat pemberhentian atau padang mahsyar) meskipun banyak jumlah mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 3",
    "description": "3-5. Dan apabila bumi diratakan setelah gunung-gunung tersapu dari tempatnya akibat dahsyatnya kekuatan yang menghempaskannya. Gunung yang besar dan kekar berubah menjadi pasir yang kemudian diterbangkan oleh tiupan angin yang dahsyat, menjadi abu yang beterbangan. Dan apabila bumi memuntahkan apa saja yang ada di dalamnya, seperti manusia yang terkubur, batuan, dan sebagainya, dan karenanya menjadi kosong bagaikan ibu hamil yang telah melahirkan janinnya. Dan apabila bumi patuh kepada tuhan yang telah menciptakan-Nya, dan sudah semestinya bumi itu dan alam semesta tunduk patuh dalam kekuasaan dan genggaman-Nya. Ketika kejadian-kejadian luar biasa ini tiba, manusia akan mengetahui balasan atas semua perbuatannya"
  }
]