[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit dan awan remuk pada hari kiamat, Ia mematuhi perintah Tuhannya pada apa-apa yang Dia perintahkan kepadanya untuk terbelah,dan patut baginya untuk taat kepada perintah tuhannya. Apabila bumi dibentangkan dan di hamparkan,gunung-gunungnya dihantam pada hari itu. Bumi melemparkan orang orang mati yang ada di dalam perutnya dan mengosongkan diri dari mereka. Dia taat kepada tuhannya pada apa yang Dia perintahkan kepadanya,dan patut baginya untuk taat kepada kepada perintah tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan bumi melemparkan apa yang ada di dalamnya berupa benda berharga dan mayat-mayat, lalu membiarkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَأَلْقَتْ مَا فِيهَا (dan dilemparkan apa yang ada di dalamnya) Yakni mayat-mayat yang ada di didalamnya dikeluarkan. وَتَخَلَّتْ(dan menjadi kosong) Yakni bumi berlepas diri dari mayat-mayat itu dengan perintah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Bumi mengeluarkan isi di dalam perutnya dan mengeluarkan mayat-mayat dari bawah perutnya. Sehingga perut bumi-pun menjadi kosong tak berisi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{memuntahkan apa yang ada di dalamnya} memuntahkan apa yang ada di dalam perutnya berupa orang-orang mati dan harta yang tersimpan {dan menjadi kosong} dan menjadi kosong tidak ada apapun yang tersisa di dalam perutnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 3-5 “Apabila bumi diratakan,” yakni, digoncang hingga bergetar, gunung yang ada di atasnya diratakan dan segala bangunan diratakan. Allah meratakan bumi serata-ratanya hingga menjadi amat luas yang mencukupi untuk manusia yang menunggu di tempat pemberhentian meski jumlah mereka banyak. Bumi menjadi luas terbentang, tidak terlihat adanya dataran rendah dan juga bukit. “Dan memuntahkan apa yang ada di dalamnya,” memuntahkan mayat dan simpanan-simpanan bumi, “dan menjadi kosong” dari mereka. Sangkakala ditiup, mayat-mayat pun keluar dari kubur ke permukaan tanah. Bumi mengeluarkan semua kandungannya hingga seperti bongkahan (lempengan) besar yang disaksikan oleh seluruh manusia, mereka pun menyesali apa yang dulu pernah mereka perlombakan. “Dan patuh kepada Rabbnya, dan sudah semestinya bumi itu patuh, (pada waktu itu manusia akan mengetahui akibat perbuatannya).”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan bumi memuntahkan mayat-mayat yang ada didalam perutnya serta seluruh hasil bumi yang terkandung didalamnya, maka kosonglah isinya dengan perintah Allah ﷻ. Ketika kiamat telah tiba Allah ﷻ memanggil seluruh mayat-mayat yang terkubur dibwah tanah, dan mereka pun memenuhi panggilan itu dan beranjak pergi dari kubur mereka, Allah ﷻ berfirman : { يَوْمَ يَدْعُوكُمْ فَتَسْتَجِيبُونَ بِحَمْدِهِ وَتَظُنُّونَ إِنْ لَبِثْتُمْ إِلَّا قَلِيلًا } ( يَوْمَ يَدْعُوكُمْ فَتَسْتَجِيبُونَ بِحَمْدِهِ وَتَظُنُّونَ إِنْ لَبِثْتُمْ إِلَّا قَلِيلًا ) [ Al-Isra' : 52 ] , { وَمِنْ آيَاتِهِ أَنْ تَقُومَ السَّمَاءُ وَالْأَرْضُ بِأَمْرِهِ ۚ ثُمَّ إِذَا دَعَاكُمْ دَعْوَةً مِنَ الْأَرْضِ إِذَا أَنْتُمْ تَخْرُجُونَ } ( Dan di antara tanda-tanda kekuasaan-Nya ialah berdirinya langit dan bumi dengan iradat-Nya. Kemudian apabila Dia memanggil kamu sekali panggil dari bumi, seketika itu (juga) kamu keluar (dari kubur) ) [ Ar Rum : 25 ] , ketika Allah ﷻ memanggil seluruh mayat-mayat yang ada dalam kubur mereka, ketika Allah ﷻ memanggil mereka dalam sekali panggila saja mereka pun keluar seluruhnya, dan tidak satupun dari mereka yag bisa menghindar, baik itu orang-orang beriman maupun orang-orang kafir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ “dan memuntahkan apa yang ada di dalamnya dan menjadi kosong,” Maknanya: Jasad-jasad manusia akan dikeluarkan oleh bumi di hari kiamat.Bumi akan memuntahkan jasad-jasad itu sehingga mereka keluar dari kubur-kuburnya untuk Allah ‘Azza Wa Jalla, sebagaimana Allah telah memulai mereka pada awal penciptaannya. Yakni sebagaimana mereka keluar dari perut ibu mereka, mereka akan keluar dari perut bumi. Anda keluar dari perut ibumu tak beralas kaki, telanjang dan tidak dikhitan, namun sebagian orang ada yang tercipta dalam bentuk sudah dikhitan, tetapa kebanyakan manusia keluar dalam keadaan tidak dikhitan, begitu juga anda akan keluar dari perut bumi tanpa beralaskan kaki, telanjang tanpa busana, dan tidak dikhitan. Ketika Nabi ‘alaihisholaatu wassalaam bercerita tentang itu, Aisyah bertanya: Wahai Rasulullah, laki-laki dan perempuan seluruhnya, memandang satu sama lain? Beliau menjawab: يَا عَائِشَة، اَلْأَمْرُ أَشَدُّ مِنْ أَنْ يَنْظُرَ بَعْضُهُمْ إِلَى بَعْضٍ \"Wahai Aisyah, perkaranya lebih genting daripada mereka saling memandang”(1) Perkara saat itu sangat keras (genting) setiap manusia akan tersibukkan dengan dirinya sendiri : لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ “Setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya.”(QS. Abasa: 37) Seorang insan apabila ia membayangkan yang terjadi pada hari itu akan merasa ketakutan, dan jika ia berakal maka ia akan melakukan amalan untuk persiapan mengahadapi hari itu. (1) dikeluarkan Bukhari (6527) dan Muslim (2859) dari hadits Aisyah radhiyallaaha 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 4: 1-5. Surat ini dimulai dengan penjelasan sebagian dari keadaan hari kiamat, Allah berkata : Jika langit terbelah dan retak, langit tersebut mematuhi dan taat dengan apa yang diperintahkan oleh Rabbnya dalam terbelahnya dan ia mentaati (Allah) dengan sebenar-benar ketaatan dan kepatuhan. Dan apabila bumi diratakan, dan mengeluarkan apa yang ada dalam perutnya mayat dan selainnya. Dan mengingkari amalan-amalan (manusia) yang ada di atasnya (perut bumi), Dan bumi mentaati Rabbnya dengan sebenar-benar ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti orang-orang yang telah mati dan segala perbendaharaan. Hal itu, karena ketika sangkakala ditiup, lalu keluarlah orang-orang yang telah mati ke permukaan bumi dan bumi pun memuntahkan perbendaharaannya sehingga bumi menjadi seperti piringan gepeng yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 4",
    "description": "3-5. Dan apabila bumi diratakan setelah gunung-gunung tersapu dari tempatnya akibat dahsyatnya kekuatan yang menghempaskannya. Gunung yang besar dan kekar berubah menjadi pasir yang kemudian diterbangkan oleh tiupan angin yang dahsyat, menjadi abu yang beterbangan. Dan apabila bumi memuntahkan apa saja yang ada di dalamnya, seperti manusia yang terkubur, batuan, dan sebagainya, dan karenanya menjadi kosong bagaikan ibu hamil yang telah melahirkan janinnya. Dan apabila bumi patuh kepada tuhan yang telah menciptakan-Nya, dan sudah semestinya bumi itu dan alam semesta tunduk patuh dalam kekuasaan dan genggaman-Nya. Ketika kejadian-kejadian luar biasa ini tiba, manusia akan mengetahui balasan atas semua perbuatannya"
  }
]