[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit dan awan remuk pada hari kiamat, Ia mematuhi perintah Tuhannya pada apa-apa yang Dia perintahkan kepadanya untuk terbelah,dan patut baginya untuk taat kepada perintah tuhannya. Apabila bumi dibentangkan dan di hamparkan,gunung-gunungnya dihantam pada hari itu. Bumi melemparkan orang orang mati yang ada di dalam perutnya dan mengosongkan diri dari mereka. Dia taat kepada tuhannya pada apa yang Dia perintahkan kepadanya,dan patut baginya untuk taat kepada kepada perintah tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan bumi mendengarkan Rabbnya dengan tunduk patuh, dan sudah semestinya hal itu bagi bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Langit itu patuh dan taat terhadap perintah Allah, dan sudah sepatutnya langit itu mendengar dan melaksanakan perintah Tuhannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{serta patuh kepada Tuhannya dan semestinya patuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 3-5 “Apabila bumi diratakan,” yakni, digoncang hingga bergetar, gunung yang ada di atasnya diratakan dan segala bangunan diratakan. Allah meratakan bumi serata-ratanya hingga menjadi amat luas yang mencukupi untuk manusia yang menunggu di tempat pemberhentian meski jumlah mereka banyak. Bumi menjadi luas terbentang, tidak terlihat adanya dataran rendah dan juga bukit. “Dan memuntahkan apa yang ada di dalamnya,” memuntahkan mayat dan simpanan-simpanan bumi, “dan menjadi kosong” dari mereka. Sangkakala ditiup, mayat-mayat pun keluar dari kubur ke permukaan tanah. Bumi mengeluarkan semua kandungannya hingga seperti bongkahan (lempengan) besar yang disaksikan oleh seluruh manusia, mereka pun menyesali apa yang dulu pernah mereka perlombakan. “Dan patuh kepada Rabbnya, dan sudah semestinya bumi itu patuh, (pada waktu itu manusia akan mengetahui akibat perbuatannya).”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan dia mentaati perintah Tuhannya, dan sudah menjadi kewajiban baginya mentaati perintah itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ “dan patuh kepada Rabbnya, dan sudah semestinya langit itu patuh,” Maknanya mendengarkan dan mematuhi Rabbnya, lalu diwujudkan perintahnya itu, sehingga bumi yang sebelumnya ada yang dataran tinggi, ada dataran rendah akan menjadi rata bagai kulit yang dibentangkan dengan satu bentangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 5: 1-5. Surat ini dimulai dengan penjelasan sebagian dari keadaan hari kiamat, Allah berkata : Jika langit terbelah dan retak, langit tersebut mematuhi dan taat dengan apa yang diperintahkan oleh Rabbnya dalam terbelahnya dan ia mentaati (Allah) dengan sebenar-benar ketaatan dan kepatuhan. Dan apabila bumi diratakan, dan mengeluarkan apa yang ada dalam perutnya mayat dan selainnya. Dan mengingkari amalan-amalan (manusia) yang ada di atasnya (perut bumi), Dan bumi mentaati Rabbnya dengan sebenar-benar ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini semua terjadi pada hari Kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 5",
    "description": "3-5. Dan apabila bumi diratakan setelah gunung-gunung tersapu dari tempatnya akibat dahsyatnya kekuatan yang menghempaskannya. Gunung yang besar dan kekar berubah menjadi pasir yang kemudian diterbangkan oleh tiupan angin yang dahsyat, menjadi abu yang beterbangan. Dan apabila bumi memuntahkan apa saja yang ada di dalamnya, seperti manusia yang terkubur, batuan, dan sebagainya, dan karenanya menjadi kosong bagaikan ibu hamil yang telah melahirkan janinnya. Dan apabila bumi patuh kepada tuhan yang telah menciptakan-Nya, dan sudah semestinya bumi itu dan alam semesta tunduk patuh dalam kekuasaan dan genggaman-Nya. Ketika kejadian-kejadian luar biasa ini tiba, manusia akan mengetahui balasan atas semua perbuatannya. 6. Wahai manusia! sesungguhnya kamu ketika di dunia telah bekerja keras siang dan malam untuk terus berbuat baik maupun buruk guna menuju kepada tuhanmu, maka pada akhirnya pasti kamu akan menemui-Nya. Tiap hari yang seseorang lalui pada hakikatnya adalah langkah menuju kematian, menuju pertemuan dengan tuhannya, berbekal amal masing-masing, lalu tuhan akan memberinya balasan yang setimpal."
  }
]