[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai manusia,sesungguhnya kamu berusaha kepada Allah beramal kebaikan atau keburukan,kemudian kamu bertemu Allah pada hari kiamat,lalu Dia membalasmu sesuai dengan amal perbuatanmu dengan karunia atau keadilan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Wahai manusia! Sesungguhnya engkau melakukan perbuatan, yang baik maupun yang buruk, maka engkau akan mendapatinya pada hari Kiamat agar Allah membalasmu atas perbuatan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai manusia, sungguh kamu mengerjakan perbuatan yang dengannya kalian akan berjumpa dengan Allah, baik itu perbuatan baik atau buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يٰٓأَيُّهَا الْإِنسٰنُ (Hai manusia) Yakni semua manusia, mencakup orang yang kafir dan yang beriman. إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا (sesungguhnya kamu telah bekerja dengan sungguh-sungguh menuju Tuhanmu) Yakni kamu sedang menuju ke hadapan Tuhanmu. فَمُلٰقِيهِ(maka pasti kamu akan menemui-Nya) Yakni kamu akan menemui Tuhanmu dengan amal perbuatanmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Wahai manusia, kalian telah bersungguh-sungguh dan berusaha keras dalam beramal baik untuk bertemu dengan Tuhan kalia. Sehingga amal baik burukmulah yang akan membawamu kepada siapan engkau akan bertemu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia sesungguhnya kamu telah menuju Tuhanmu dengan bekerja keras} beramal dengan sungguh-sungguh kepada Tuhanmu {Maka kamu pasti menemuiNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6 “Hai manusia, sesungguhnya kamu telah bekerja sungguh-sungguh menuju Rabbmu, maka pasti kamu akan menemuiNya,” yakni, sesungguhnya engkau telah berjalan menuju Allah , mengerjakan perintahNya, menjauhi laranganNya dan mendekat padaNya dengan kebaikan atau keburukan, kemudian engkau akan bertemu dengan Allah pada Hari Kiamat. Balasan tidak terlepas dari karunia atau keadilan. Karunia bila engkau termasuk orang yang berbahagia dan hukuman bila engkau termasuk orang yang sengsara."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada ayat ini Allah berbicara kepada hamba-Nya yang Ia ciptakan hanya untuk menghamba kepada-Nya, setelah menciptakannya Dia bahkan menganugerahkan kepada mereka rezeki yang melimpah, Dia juga menjadikan makhluk-makhluk yang ada dilangit dan dibumi tunduk kepada hamba-Nya itu, Allah ﷻ berkata : { يَا أَيُّهَا الْإِنْسَانُ إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا فَمُلَاقِيهِ } { يَا أَيُّهَا الْإِنْسَانُ } yakni setiap insan baik itu mukmin maupun kafir, Allah menyapa hamba-Nya ketika Al-Qur'an diturunkan : Wahai manusia { إِنَّكَ كَادِحٌ } sesungguhnya dalam kehidupan ini kalian sedang berjalan { إِلَىٰ رَبِّكَ } menuju Tuhan kalian, kalian sedang berjalan untuk menghadap kepada Tuhan kalian , dan pada hakikatnya manusia tengah menghabiskan sisa umur mereka yang hari demi hari mereka jalani, dan akhirya mereka pasti akan tiba pada titik akhir kehidupan, dan dikala itulah mereka akan bertemu dengan Tuhan semesta alam itulah kematian, tidak satupun dari mereka yang bisa menghindar dari kematian itu, Allah ﷻ berfirman : { وَرُدُّوا إِلَى اللَّهِ مَوْلَاهُمُ الْحَقِّ ۖ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ } ( dan mereka dikembalikan kepada Allah Pelindung mereka yang sebenarnya dan lenyaplah dari mereka apa yang mereka ada-adakan. ) [ Yunus : 30 ] { إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا فَمُلَاقِيهِ } Kalian pasti akan menghadap Tuhan kalian saat kiamat itu tiba, ketika bumi diporak porandakan dan langit dibelah, kemudian bumi hamparkan seluas-luasnya kalian akan menghadap Allah ﷻ Tuhan semesta alam, setiap jiwa akan digiring menuju padang mahsyar untuk dihisab amalannya dan mereka akan mendapat balasan dan ganjaran dari amalan mereka, dan tidak satupun dari mereka terlewatkan, Allah berfirman : { أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا ۚ سَاءَ مَا يَحْكُمُونَ } ( Ataukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput (dari azab) Kami? Amatlah buruk apa yang mereka tetapkan itu. ) [ Al-Ankabut : 4 ] { إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا فَمُلَاقِيهِ } Inilah akhir dari masa hidupmu, { فَمُلَاقِيهِ } kalian pasti akan bertemu dengan Tuhan pencipta seluruh alam. Disebutkan dalam riwayat lain , bahwa maksud dari { فَمُلَاقِيهِ } adalah kalian akan bertemu dengan amalan kalian pada hari kiamat, baik itu amalan kebajikan ataupun amal perbuatan yang buruk, maka berbuatlah sesuka kalian, pada waktunya nanti kalian akan dipertemukan dengan amalan-amalan tersebut dan kalian akan dimintai pertanggungjawaban atas apa yang telah kalian perbuat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَا أَيُّهَا الْإِنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا “Hai manusia, sesungguhnya kamu telah bekerja dengan sungguh-sungguh menuju Rabbmu,” al-Kadih maknanya adalah orang yang berusaha dengan sungguh sungguh dan keras, dan firman-Nya: إِلَى رَبِّكَ “” Yakni engkau berusaha keras dengan usaha yang mengantarkanmu kepada Rabbmu, Yakni akhir dari jerih payahmu, bagaimana pun keadaanmu tetap kembali kepada Allah. Kerena kita pasti akan mati, dan jika kita mati kita akan kembali kepada Allah, maka bagaimana pun anda berbuat maka akhirnya pasti kepada Allah ‘Azza Wa Jalla : وَأَنَّ إِلَى رَبِّكَ الْمُنْتَهَى ” dan bahwasanya kepada Rabbmulah kesudahan (segala sesuatu),”(QS. An-Najm: 42) Oleh karenanya Allah berfirman: كَادِحٌ إِلَى رَبِّكَ كَدْحًا “bekerja dengan sungguh-sungguh menuju Rabbmu,” Pelaku maksiat pun berjerih payah yang nantinya akan berakhir pada Allah ‘Azza Wa Jalla إِنَّ إِلَيْنَا إِيَابَهُمْ (25) ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُمْ “Sesungguhnya kepada Kami-lah kembali mereka, kemudian sesungguhnya kewajiban Kami-lah menghisab mereka.”(QS. Al-Ghasyiyah: 25-26) Tetapi perbedaan antara orang yang ta’ata dengan pelaku maksiat adalah bahwa orang yang ta’at akan beramal dengan amalah yang diridhai Allah, dengan ia akan sampai kepada keridhaan Allah di hari kiamat kelak, sedangkan pelaku maksiat, ia meramal dengan amalan yang dimurkai Allah, namun keduanya akan berakhir kepada Allah ‘Azza Wa Jalla. Dengan begitu, firman Allah: يَا أَيُّهَا الْإِنْسَانُ “Hai manusia,” mencakup semua manusia, baik mukmin maupun kafir إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلَاقِيهِ “sesungguhnya kamu telah bekerja dengan sungguh-sungguh menuju Tuhanmu, maka pasti kamu akan menemui-Nya.” الفاء [Huruf faa] para pakar nahwu mengatakan: Ia menunjukkan beriirngannya kejadian itu setelah kejadian sebelumnya (yaitu kembali kepada Allah dengan kehidupan dunia). Yakni, engkau akan menemui Allah dalam waktu dekat إِنَّ مَا تُوعَدُونَ لَآتٍ “Sesungguhnya apa yang dijanjikan kepadamu pasti datang”(QS. Al-An’am: 134) Dan semua yang akan datang itu dekat وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ قَرِيبٌ “Dan tahukah kamu, boleh jadi hari kiamat itu (sudah) dekat?”(QS. Asy-Syura: 17) Jika anda mau lebih jelas bahwa pertemuan dengan Rabb ‘Azza Wa Jalla itu dekat, maka perhatikanlah usiamu yang telah berlalu saat ini, Seandainya berlalu denganmu seratus tahun, maka seakan akan hanya berlalu satu jam saja. Semua yang telah kita lalui dari usia kita seakan-akan itu berjalan hanya satu jam saja. Dengan begitu (berapapun panjang usia) maka tetap pendek. Kemudian apabila seorang insan meninggal dunia, maka alam barzakh yang terletak antara dunia dan akhirat itu dekat, seperti sesaat saja. Seorang insan bila ia tidur pulas, katakanlah ia tidur dua puluh empat jam, kemudian ia terbangun, maka itu akan terasa hanya tidur satu menit saja padahal ia telah tidur selama dua puluh empat jam. Jika ini terasa demikian cepatnya padahal ruh itu terpisah dalam keadaan hidup waktu begitu cepat berlalu, maka bagaimana menurut anda jika nyawa itu telah terpisah dari tubuh, ia tersibukkan dengan kenikmatan atau dengan azab, akan terlalui bertahun-tahun tidak akan terasa apa-apa. Karena panjangnya waktu dalam keadaan kita terbangun tidak seperti saat kita tidur. Seorang insan yang sadar dari terbit hingga terbenamnya matahari akan merasakan waktu lebih panjang, namun ketika ia tidur maka tidak akan terasa apa-apa. Orang yang Allah matikan selama satu tahun kemudian dihidupkan kembali, lalu ditanya: Berapa lama kamu meninggal? Ia menjawab: Aku meninggal selama sehari atau sebagian hari. Para ash-haabulkahfi mereka menetap di guanya selama 309 tahun lamanya, ketika mereka dibangunkan kembali, mereka saling bertanya: Berapa lama kalian tinggal? Mereka menjawab: Kita tinggal sehari atau setengah hari. Ini juga menunjukkan bahwa insan akan heran, bagaimana mungkin mereka melalui tahun-tahun yang lama itu? Kita katakan: Ya, tahun-tahun tidak terasa kecuali seperti semenit saja. Karena kondisi manusia setelah nyawanya berpisah dengan raganya baik secara keseluruhan atau sebagiannya saja, tidak sama seperti ketika nyawanya berada dalam tubuhnya. Jika nyama masih di dalam tubuh ia akan merasakan kesulitan, masalah-masalah, pikiran dan was-was adalah sesuatu yang menjadikan waktu terasa lama. Tetapi saat tidur waktu kan terasa lebih cepat, dan saat mati akan lebih dan lebih cepat lagi. Orang-orang yang sudah mati sejak beberapa tahun lamanya, mereka akan merasa tidak mati kecuali hari itu juga, seandainya mereka dihidupkan kembali, lalu ditanya: Kalian sudah meninggal berapa lama? Maka akan menjawab: Kami telah meninggal sehari atau sebagian hari. Ini adalah masalah yang terkadang terlintas persoalan di benak manusia, namun sebenarnya itu tidak dipersoalkan, bagaimana pun juga panjangnya waktu para penghuni kubur, maka itu pendek, oleh karenanya Allah berfirman: فَمُلَاقِيهِ [famulaaqiih] huruf Faa disini menunjukkan tartib dan ta’qib (yang berarti akan terjadi dekat). Maka alangkah cepatnya anda akan bertemu Allah ‘Azza Wa Jalla. Kemudian Allah ‘Azza Wa Jalla membagi orang-orang yang bertemu dengan-Nya menjadi dua golongan: di antara mereka ada yang menerima buku catatannya dengan tangan kanannya, di antara mereka juga ada yang menerima bukunya dari belakang punggungnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 6: Ini adalah seruan dari Allah untuk setiap makhluk yang terbebani dengan syariat, agar melihat hasil akhir amalan mereka sejak ia lahir sampai ia mati. Allah mengabarkan orang yang beramal dalam kehidupannya dan memiliki kemuliaan dalam amalannya. Kemudian ia pada akhirnya menemui Rabbnya diberikan balasan atas amalannya (oleh Rabbnya). Jika ia beramal kebaikan, Allah akan balas dengan kebaikan, dan jika ia beramal dengan kejelekan, Allah balas pula dengan kejelekan (yang semisal)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, manusia di dunia ini disadari atau tidak adalah dalam perjalanan kepada Tuhannya. Dan dia akan menemui Tuhannya untuk menerima pembalasan-Nya terhadap perbuatannya yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 6",
    "description": "Wahai manusia! sesungguhnya kamu ketika di dunia telah bekerja keras siang dan malam untuk terus berbuat baik maupun buruk guna menuju kepada tuhanmu, maka pada akhirnya pasti kamu akan menemui-Nya. Tiap hari yang seseorang lalui pada hakikatnya adalah langkah menuju kematian, menuju pertemuan dengan tuhannya, berbekal amal masing-masing, lalu tuhan akan memberinya balasan yang setimpal. 7-9. Di hadapan Allah manusia akan terbagi menjadi dua kelompok: kelompok yang berbahagia dan kelompok yang sengsara. Maka adapun orang yang catatan amal-Nya diberikan dari sebelah kanannya'mereka adalah orang yang beriman dan berbuat baik, maka dia akan diperiksa dengan pemeriksaan yang mudah. Amal mereka akan ditampilkan secara sekilas, dan kesalahan mereka tertutup oleh kebaikan. Dan dia akan kembali kepada keluarganya yang sama-sama beriman dengan riang gembira. Segala kecemasan yang mereka rasakan sebelum itu akan sirna. Mereka berbahagia bagaikan pahlawan yang memenangkan peperangan (lihat: surah al-h'qqah/69: 19'20)."
  }
]