[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Barangsiapa diberi catatan buku amalnya dengan tangan kanannya,sementara dia adalah orang yang beriman kepada Allah, Maka dia akan dihisab dengan mudah dan ringan, Dan dia akan kembali kepada keluarganya di surga dengan bahagia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Adapun orang yang diberi catatan amal perbuatannya dengan tangan kanannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Adapun orang beriman yang menerima catatan amalannya dengan tangan kanan, maka dia akan dihisab dengan proses yang mudah, kemudian setelah menjalani hisab, dia akan pergi menuju keluarganya di surga dengan penuh kebahagiaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَأَمَّا مَنْ أُوتِىَ كِتٰبَهُۥ بِيَمِينِهِۦ (Adapun orang yang diberikan kitabnya dari sebelah kanannya) Yaitu orang-orang beriman, mereka diberi dengan tangan kanan mereka kitab yang berisi amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Maka barang siapa buku catatan amalnya diberikan dari arah kanannya, dia adalah orang yang beriman. Yang akan dihisab dengan hisab yang mudah dan ringan tanpa ada perdebatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang yang catatannya diberikan} lembaran-lembaran amalnya diberikan {dari sebelah kanannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 7-9 Karena itu Allah menjelaskan rincian penjelasan, “Adapun orang yang diberikan kitabnya dari sebelah kanannya,” dan mereka ini adalah orang-orang yang berbahagia, “maka ia akan diperiksa dengan pemeriksaan yang mudah,” yakni sekedar diperlihatkan secara sepintas kepada Allah, lalu Allah menetapkan dosa-dosa hambaNya, hingga ketika sang hamba mengira akan binasa, Allah berfirman, “Aku menutupinya untukmu di dunia dan Aku menutupinya pada hari ini bagimu.” “Dan dia akan kembali kepada kaumnya (yang sama-sama beriman),” di dalam surga “dan bergembira,” karena ia selamat dari azab dan mendapatkan pahala."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Bagaimana keadaan manusia ketika bertemu Tuhan mereka ? { فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ } Barangsiapa yang diserahkan kepadanya kitab amalannya dengan tangan kanannya, dan mereka itu adalah orang-orang yang beriman kepada Allah didunia dan beramal shalih dan mengisi kitab amalannya dengan berbagai macam kebaikan, tidak sedikit pun dari catatan kebaikannya hilang, Allah memuliakan mereka dengan memberikan kitab amalan itu dengan tangan kanannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Setelah disebutkan bawa manusia berusaha kepada Rabbnya yaitu dengan bekerja dengan keras dan giat, dan pekerjaannya itu akan berakhir kepada Allah ‘Azza WA Jalla, sebagaimana Allah Ta’ala berfirman: وَلِلَّهِ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ “Dan kepunyaan Allah-lah apa yang gaib di langit dan di bumi dan kepada-Nya-lah dikembalikan urusan-urusan semuanya,” (QS. Hud: 123), setelah menyebut ini Allah berfirman: فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ \" Adapun orang yang diberikan kitabnya dari tangan kanannya,\"sebagai isyarat bahwa di antara orang-orang yang berbuat itu ada yang akan memperoleh kitab catatannya dengan tangan kanannya dan ada yang memperoleh kitab catatannya dari belakang punggungnya. فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ \" Adapun orang yang diberikan kitabnya dari tangan kanannya,\" Fi’il (sebutan kata kerja dalam bahasa arab)أُوْتِيَ (artinya diberikan) di sini adalah fi’il yang mabniy (tidak mu’rab) tidak disebutkan pelakunya, maka siapa yang memberikan kitab itu? Bisa jadi malaikat atau yang lainnya, kita tidak tahu. Yang penting ia akan diberikan kitab catatannya dengan tangan kanannya: yakni menerimanya dengan tangan kanan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 7: 7-9. Kemudian Allah menjelasakan bahwasanya barang siapa yang diberikan kitab (catatan amalannya) dari sebelah kanan, mereka adalah orang-orang beriman; Ia akan dihisab dengan semudah-mudahnya hisab (karena/jika disebabkan berbenturan antara amalan ketaatan dan kemaksiatan). Kemudian ia dipindahkan (setelah hisab yang mudah) menuju ke kaumnya di surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menerangkan lebih rinci balasan-Nya. Ia adalah orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 7",
    "description": "7-9. Di hadapan Allah manusia akan terbagi menjadi dua kelompok: kelompok yang berbahagia dan kelompok yang sengsara. Maka adapun orang yang catatan amal-Nya diberikan dari sebelah kanannya'mereka adalah orang yang beriman dan berbuat baik, maka dia akan diperiksa dengan pemeriksaan yang mudah. Amal mereka akan ditampilkan secara sekilas, dan kesalahan mereka tertutup oleh kebaikan. Dan dia akan kembali kepada keluarganya yang sama-sama beriman dengan riang gembira. Segala kecemasan yang mereka rasakan sebelum itu akan sirna. Mereka berbahagia bagaikan pahlawan yang memenangkan peperangan (lihat: surah al-h'qqah/69: 19'20)"
  }
]