[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Barangsiapa diberi catatan buku amalnya dengan tangan kanannya,sementara dia adalah orang yang beriman kepada Allah, Maka dia akan dihisab dengan mudah dan ringan, Dan dia akan kembali kepada keluarganya di surga dengan bahagia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Niscaya Allah akan memeriksanya dengan pemeriksaan yang mudah, amalnya dipaparkan kepada-Nya tanpa sanksi hukuman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا (maka dia akan diperiksa dengan pemeriksaan yang mudah) Yakni kesalahan-kesalahan mereka akan ditunjukkan kepada mereka, kemudian Allah akan mengampuninya tanpa menanyainya. Dalam shahih Imam Bukhari dan Muslim disebutkan dari Aisyah, ia berkata: Nabi bersabda: “Barangsiapa yang ditanyai pada saat hisab niscaya ia akan diazab.” Lalu aku bertanya: “Bukankah Allah berfirman: فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا”. Beliau menjawab: “Itu bukanlah hisab, namun itu adalah pemaparan. Namun barangsiapa yang dihisab di hari kiamat niscaya ia akan diazab.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Maka barang siapa buku catatan amalnya diberikan dari arah kanannya, dia adalah orang yang beriman. Yang akan dihisab dengan hisab yang mudah dan ringan tanpa ada perdebatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka dia akan dihisab dengan hisab yang mudah} mudah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 7-9 Karena itu Allah menjelaskan rincian penjelasan, “Adapun orang yang diberikan kitabnya dari sebelah kanannya,” dan mereka ini adalah orang-orang yang berbahagia, “maka ia akan diperiksa dengan pemeriksaan yang mudah,” yakni sekedar diperlihatkan secara sepintas kepada Allah, lalu Allah menetapkan dosa-dosa hambaNya, hingga ketika sang hamba mengira akan binasa, Allah berfirman, “Aku menutupinya untukmu di dunia dan Aku menutupinya pada hari ini bagimu.” “Dan dia akan kembali kepada kaumnya (yang sama-sama beriman),” di dalam surga “dan bergembira,” karena ia selamat dari azab dan mendapatkan pahala."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka mereka akan dhisab dengan mudah tanpa kesulitan apapun, catatan amalan mereka hanya akan di perlihatkan dihadapan mereka dan Allah ﷻ telah mengampuni segala dosa-dosa yang telah mereka perbuat, kemudian mereka akan beranjak ketempat kembali yang telah dijanjikan oleh Allah ﷻ , kebahagiaan yang mereka rasakan ketika menerima balasan atas amal shalih yang mereka perbuat didunia. { فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا } Mereka yang menerima catatan amalan dengan tangan kanan akan mendapatlan kemudahan dalam perhitungan, tidak ada kesulitan dalam urusan mereka, kebahagiaanlah yang dirasakan oleh mereka ketika masuk kedalam surga yang Allah janjikan, mereka bahagia karena terbebas dari situasi yang mengerikan pada hari itu. Keadaan manusia pada hari kiamat berbeda-beda tergantung bagaimana hisab mereka : Diantara mereka : Ada yang masuk kedalam surga tanpa hisab dan azab sama sekali, sebagaimana yang dikatakan oleh Rasulullah ﷺ dalam hadits shaohih : (( عن ابْنُ عَبَّاسٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُرِضَتْ عَلَيَّ الْأُمَمُ فَأَخَذَ النَّبِيُّ يَمُرُّ مَعَهُ الْأُمَّةُ وَالنَّبِيُّ يَمُرُّ مَعَهُ النَّفَرُ وَالنَّبِيُّ يَمُرُّ مَعَهُ الْعَشَرَةُ وَالنَّبِيُّ يَمُرُّ مَعَهُ الْخَمْسَةُ وَالنَّبِيُّ يَمُرُّ وَحْدَهُ فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ قُلْتُ يَا جِبْرِيلُ هَؤُلَاءِ أُمَّتِي قَالَ لَا وَلَكِنْ انْظُرْ إِلَى الْأُفُقِ فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ قَالَ هَؤُلَاءِ أُمَّتُكَ وَهَؤُلَاءِ سَبْعُونَ أَلْفًا قُدَّامَهُمْ لَا حِسَابَ عَلَيْهِمْ وَلَا عَذَابَ قُلْتُ وَلِمَ قَالَ كَانُوا لَا يَكْتَوُونَ وَلَا يَسْتَرْقُونَ وَلَا يَتَطَيَّرُونَ وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ فَقَامَ إِلَيْهِ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ثُمَّ قَامَ إِلَيْهِ رَجُلٌ آخَرُ قَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ سَبَقَكَ بِهَا عُكَّاشَةُ )) \"[Ibnu 'Abbas] telah menceritakan kepadaku dengan mengatakan, Nabi Shallallahu'alaihiwasallam bersabda: \"Beberapa umat diperlihatkan kepadaku, maka aku melihat ada seorang Nabi lewat bersama umatnya, kemudian lewatlah seorang Nabi bersama beberapa orang, kemudian lewatlah seorang Nabi bersama sepuluh orang, dan Nabi bersama lima orang, dan seorang Nabi yang berjalan sendirian. Tiba-tiba aku melihat ada rombongan besar, maka saya tanyakan kepada Jibril; 'Apakah mereka umatku? ' 'bukan, namun lihatlah ufuk, ' jawab Jibril. Aku melihat, tiba-tiba ada serombongan besar. Kata Jibril; 'Itulah umatmu, dan itu ada tujuh puluh ribu orang mula-mula yang masuk surga dengan tanpa hisab dan tanpa siksa.' Saya bertanya; 'Mengapa mereka bisa seperti itu? ' Jibril menjawab; 'Karena mereka tidak minta di obati (dengan cara) kay (ditempel besi panas), tidak minta diruqyah dan tidak meramal nasib dengan burung, dan kepada rabb-Nya mereka bertawakkal.\" 'Ukkasyah bin Mihshan berdiri seraya berujar; \"doakanlah aku, agar Allah menjadikan diriku diantara mereka!\" Nabi berdoa; \"Ya Allah, jadikanlah dia supaya diantara mereka!\" Lantas laki-laki lainnya berdiri dan berujar; \"Jadikanlah aku diantara mereka!\" Nabi menjawab; \"kamu sudah didahului 'Ukkasyah.\" [ H.R Bukhori : 6059 ] . Dan antara mereka juga : ada yang masuk surga { يُحَاسَبُ حِسَابًا يَسِيرًا } dengan hisab yang mudah, kemudian setelah itu barulah mereka masuk kedalam surga. Dan diantara mereka : ada yang masuk kesurga setelah melewati hisab tanpa azab, dan ada juga yang masuk kedalam surga setelah dihisab dan diazab, akan tetapi pada akhirnya dua golongan ini tempat kembali mereka adalah surga. Sedangkan orang-orang kafir tidak akan melewati masa pertimbangan amal shalih dan amal buruk, karena sebenarnya mereka tidak memiliki amal kebaikan yang menghantar mereka masuk medalam surga, dan Neraka jahannam lah tempat yang sesuai bagi mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا “maka dia akan diperiksa dengan pemeriksaan yang mudah,” Maknanya: Allah akan menghisab dengan menghitung amalannya, namun hisabnya ini ringan, tidak ada kesulitan sedikit pun di dalamnya. Sebagaimana keterangannya datang dalam hadits bahwa Allah ‘Azza Wa Jalla, akan berduaan dengan hamba-Nya yang beriman, Dia akan menetapkan pengakuan atas dosa-dosanya, Allah akan bertanya: Engkau telah berbuat dosa ini, Engkau telah berbuat dosa ini, Engkau telah berbuat dosa ini. ia pun mengakui dan tidak mengingkarinya, maka Allah Ta’ala akan berfirman: قَدْ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ “ Aku telah mengembunyikannya dari mu di dunia, dan Aku telah mengampuninya hari ini ”(1) tidak diragukan lagi ini adalah hisab yang ringan, di dalamnya nampak karunia, rasa senang, dan kabar gembira dari Allah bagi hamba-Nya. Yang menghisabnya adalah Allah ‘Azza Wa Jalla, sebagaimana Allah Ta’ala berfirman: إِنَّ إِلَيْنَا إِيَابَهُمْ (25) ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُمْ “Sesungguhnya kepada Kami-lah kembali mereka, kemudian sesungguhnya kewajiban Kami-lah menghisab mereka.” (QS. Al-Ghasyiyah: 25-26) (1) Dikeluarkan Bukhari (2441) dan Muslim (2768) dari hadits Ibnu Umar radhiyallaahu 'anhuma"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyiqaq ayat 8: 7-9. Kemudian Allah menjelasakan bahwasanya barang siapa yang diberikan kitab (catatan amalannya) dari sebelah kanan, mereka adalah orang-orang beriman; Ia akan dihisab dengan semudah-mudahnya hisab (karena/jika disebabkan berbenturan antara amalan ketaatan dan kemaksiatan). Kemudian ia dipindahkan (setelah hisab yang mudah) menuju ke kaumnya di surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan disodorkan amalnya kepadanya lalu dimaafkan. Rasulullah shallallahu 'alaihi wa sallam bersabda: « إِنَّ اللَّهَ يُدْنِى الْمُؤْمِنَ فَيَضَعُ عَلَيْهِ كَنَفَهُ ، وَيَسْتُرُهُ فَيَقُولُ : أَتَعْرِفُ ذَنْبَ كَذَا ؟ أَتَعْرِفُ ذَنْبَ كَذَا ؟ فَيَقُولُ : نَعَمْ أَىْ رَبِّ . حَتَّى إِذَا قَرَّرَهُ بِذُنُوبِهِ وَرَأَى فِى نَفْسِهِ أَنَّهُ هَلَكَ قَالَ : سَتَرْتُهَا عَلَيْكَ فِى الدُّنْيَا ، وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ . فَيُعْطَى كِتَابَ حَسَنَاتِهِ ، وَأَمَّا الْكَافِرُ وَالْمُنَافِقُونَ فَيَقُولُ الأَشْهَادُ هَؤُلاَءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ ، أَلاَ لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ \"Sesungguhnya Allah akan mendekatkan orang mukmin, lalu Dia meletakkan tirai-Nya dan menutupinya (dari keramaian), Dia berfirman, \"Kamu kenal dosa ini? Kamu kenal dosa ini?” Ia menjawab, \"Ya, wahai Tuhanku.\" Sehingga apabila ia telah mengakui dosa-dosanya dan merasakan bahwa dirinya akan binasa, Allah berfirman, \"Aku telah menutupi dosamu di dunia dan Aku akan mengampuninya pada hari ini.\" Maka ia diberikan catatan amal kebaikannya. Sedangkan orang-orang kafir dan munafik, maka para saksi berkata (di hadapan seluruh manusia), \"Merekalah orang-orang yang mendustakan Tuhan mereka. Ingatlah! Sesungguhnya laknat Allah ditimpakan kepada orang-orang yang zalim.\" (HR. Bukhari dan Muslim) Imam Bukhari dan Muslim juga meriwayatkan dari Aisyah radhiyallahu 'anha, dari Nabi shallallahu 'alaihi wa sallam bahwa Beliau bersabda: مَنْ حُوسِبَ عُذِّبَ قَالَتْ عَائِشَةُ فَقُلْتُ أَوَلَيْسَ يَقُولُ اللَّهُ تَعَالَى فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا قَالَتْ فَقَالَ إِنَّمَا ذَلِكِ الْعَرْضُ وَلَكِنْ مَنْ نُوقِشَ الْحِسَابَ يَهْلِكْ “Barang siapa yang dihisab, maka ia akan diazab.” Aisyah berkata, “Aku bertanya, “Bukankah Allah Ta’ala berfirman, “Maka dia akan diperiksa dengan pemeriksaan yang mudah?” Maka Beliau menjawab, “Itu (pemeriksaan yang mudah) adalah disodorkan amal (lalu dimaafkan), akan tetapi barang siapa yang diperiksa secara mendalam hisabnya, maka ia akan binasa.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyiqaq Ayat 8",
    "description": "7-9. Di hadapan Allah manusia akan terbagi menjadi dua kelompok: kelompok yang berbahagia dan kelompok yang sengsara. Maka adapun orang yang catatan amal-Nya diberikan dari sebelah kanannya'mereka adalah orang yang beriman dan berbuat baik, maka dia akan diperiksa dengan pemeriksaan yang mudah. Amal mereka akan ditampilkan secara sekilas, dan kesalahan mereka tertutup oleh kebaikan. Dan dia akan kembali kepada keluarganya yang sama-sama beriman dengan riang gembira. Segala kecemasan yang mereka rasakan sebelum itu akan sirna. Mereka berbahagia bagaikan pahlawan yang memenangkan peperangan (lihat: surah al-h'qqah/69: 19'20)"
  }
]