[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah kamu melihat keadaan orang yang mendustakan kebangkitan (setelah kematian) dan pembalasan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Tahukah kamu orang yang mendustakan adanya pembalasan pada hari Kiamat?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Allah mencela orang-orang yang lalai dalam menunaikan hak Allah dan hak hamba-hamba-Nya yang membutuhkan bantuan, maka Allah menyampaikan kepada Rasulullah dan umatnya: Apakah kamu mengetahui orang yang mengingkari hari perhitungan di akhirat? Orang yang mendustakan hari perhitungan pada hari kiamat itu enggan menunaikan hak orang yang terzalimi, dan bersikap keras terhadap anak yatim, serta tidak mendorong orang lain untuk memberi makan orang-orang yang membutuhkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. اَرَءَيۡتَ الَّذِىۡ يُكَذِّبُ بِالدِّيۡنِؕ‏ (Tahukah kamu (orang) yang mendustakan agama?) Yakni apakah kamu mengetahui orang yang mendustakan hari kebangkitan dan pembalasan?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 Iman kepada hari akhir bukan sekedar keyakinan, tetapi ia akan membawa pemiliknya kepada kebaikan memberi makan untuk anak yatim dan miskin, seperti orang yang Allah katakan tentangnya : { وَيُطْعِمُونَ الطَّعَامَ عَلَىٰ حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا } \"Dan mereka memberikan makanan yang disukainya kepada orang miskin, anak yatim dan orang yang ditawan\". [ al-Insan : 8 ] lalu apa yang mereka harapkan ? { إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنْكُمْ جَزَاءً وَلَا شُكُورًا , إِنَّا نَخَافُ مِنْ رَبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا } \"Sesungguhnya kami memberi makanan kepadamu hanyalah untuk mengharapkan keridhaan Allah, kami tidak menghendaki balasan dari kamu dan tidak pula (ucapan) terima kasih , Sesungguhnya kami takut akan (azab) Tuhan kami pada suatu hari yang (di hari itu) orang-orang bermuka masam penuh kesulitan\". [ al-Insan : 9-10 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Apakah kamu mengetahui dan melihat wahai Nabi, orang yang mendustakan hari perhitungan dan hari pembalasan di akhirat, dan mendustakan akidah dan syari’at agama ini? Bukankah dia layak menerima siksa Allah? Istifham ini digunakan untuk membuat orang yang diajak bicara terkejut dengan perbuatan pendusta ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu melihat orang yang mendustakan hari pembalasan} mendustakan hari pembalasan dan hari perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman seraya mencela orang yang meninggalkan kewajiban-kewajiban terhadapNya dan terhadap hamba-hambaNya, “Tahukah kamu (orang) yang mendustakan agama,” yakni mendustakan kebangkitan dan pembalasan dan tidak beriman dengan apa yang dibawa oleh para Rasul."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَرَأَيْتَ } Pertanyaan ini ditujukan kepada Nabi ﷺ , dan juga kepada kaum muslimin seluruhnya, apakah kamu mengetahui wahai Rasul { الَّذِي يُكَذِّبُ بِالدِّينِ } orang yang mendustakan agama ? yakni yang mendustakan hari kebangkitan ? hari kebangkitan itu nyata peristiwanya akan tetapi banyak diantara manusia lalai dari megingatnya bahkan diantar mereka juga ada yang tidak percaya dengan peristiwa ini, atau diantara manusia juga ada yang beriman kepadanya tetapi tidak mempersiapkan diri untuk menghadapi peristiwa yang agung ini, maka beberapa ciri-ciri orang yang mendustakan kebangkitan itu akan dibahas pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah Tabaaraka wa Ta'aala berfirman: أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ \" Tahukah kamu (orang) yang mendustakan agama?\" أَرَأَيْتَ \"Tahukah kamu\" Interaksi ini apakah kepada Rasul Shallallaahu 'alaihi wa sallam, dikarenakan beliaulah yang diturunkan kepadanya Al-Quran? Atakah umum mencakup setiap orang yang sesuai diajak interaksi? Interaksi ini umu lebih utama, sehingga kita katakan: أَرَأَيْتَ umum mencakup setiap orang yang sesuai diajak interaksi. أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ \" Tahukah kamu (orang) yang mendustakan agama?\" Maknanya: (mendustakan) pembalasan, mereka adalah orang-orang yang mengingkari kebangkitan dan mengatakan: أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَبْعُوثُونَ (16) أَوَآبَاؤُنَا الْأَوَّلُونَ \" Apakah apabila kami telah mati dan telah menjadi tanah serta menjadi tulang belulang, apakah benar-benar kami akan dibangkitkan (kembali)? Dan apakah bapak-bapak kami yang telah terdahulu (akan dibangkitkan pula)?\"(QS. Ash-Shaffat: 16-17) Di antara mereka ada yang mengatakan: مَنْ يُحْيِ الْعِظَامَ وَهِيَ رَمِيمٌ \" Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?\"(QS. Yasin: 78) Mereka mendustakan hari pembalasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’un ayat 1: Allah menujukan firman-Nya kepada Nabi-Nya ﷺ, Allah berkata : Kabarkan kepada-Ku wahai Nabi Allah, apakah engkau melihat keburukan dan keheranan tentang kondisi manusia yang mendustakan agama (mendustakan hari pembalasan dan hisab di akhirat), dan mengingkari apa yang datang dari Tuhannya, dari kebenaran dan hidayah bagi seluruh alam. Berkata Syaikh Ibnu Utsaimin ketika memberikan pelajaran di Masjid Al Haram pada tanggal 27/3/1417 H : Berkata Ulama : Jika Allah berfirman أَرَءَيْتَ maka maknanya adalah kabarkan kepada-Ku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Addiin di ayat ini bisa juga diartikan dengan pembalasan dan hisab. Maksudnya, tahukah kamu orang yang mendustakan (hari) pembalasan? Jika kamu belum tahu, maka itulah orang yang menghardik anak yatim, dst."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’un Ayat 1",
    "description": "Tahukah kamu, wahai rasul, orang yang mendustakan agama dan mengingkari hisab serta hari pembalasan di akhirat nanti'2. Jika engkau ingin tahu, maka para pendusta agama, hisab, dan hari pembalasan itulah orang yang menghardik anak yatim, menyakiti hatinya, dan berbuat zalim kepadanya dengan menahan haknya. Dia tidak lagi peduli terhadap anak yang sudah kehilangan tumpuan hidupnya itu."
  }
]