[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia adalah orang yang merhadik anak yatim, yaitu anak yang bapaknya wafat ketika ia masih kecil,dari haknya dengan keras karena hatinya memang keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Yaitu orang yang menolak anak yatim dengan keras untuk memenuhi kebutuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. فَذٰلِكَ الَّذِىۡ يَدُعُّ الۡيَتِيۡمَۙ‏ (Itulah orang yang menghardik anak yatim) Yakni jika kamu mengamati atau mencarinya, niscaya kamu akan mendapati bahwa dia adalah orang yang menolak untuk memberikan hak anak yatim dengan keras dan kejam. Dahulu orang-orang Arab pada masa jahiliyah tidak memberi warisan kepada wanita dan anak kecil."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 Iman kepada hari akhir bukan sekedar keyakinan, tetapi ia akan membawa pemiliknya kepada kebaikan memberi makan untuk anak yatim dan miskin, seperti orang yang Allah katakan tentangnya : { وَيُطْعِمُونَ الطَّعَامَ عَلَىٰ حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا } \"Dan mereka memberikan makanan yang disukainya kepada orang miskin, anak yatim dan orang yang ditawan\". [ al-Insan : 8 ] lalu apa yang mereka harapkan ? { إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنْكُمْ جَزَاءً وَلَا شُكُورًا , إِنَّا نَخَافُ مِنْ رَبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا } \"Sesungguhnya kami memberi makanan kepadamu hanyalah untuk mengharapkan keridhaan Allah, kami tidak menghendaki balasan dari kamu dan tidak pula (ucapan) terima kasih , Sesungguhnya kami takut akan (azab) Tuhan kami pada suatu hari yang (di hari itu) orang-orang bermuka masam penuh kesulitan\". [ al-Insan : 9-10 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Pendusta itu adalah orang yang menolak dan mencegah dengan keras anak yatim untuk menerima haknya, dengan kejam. Perlu diketahui bahwa bangsa Arab Jahiliyyah tidak memberi warisan kepada perempuan dan anak kecil, dan tidak mendorong dirinya, keluarganya dan orang lain untuk memberi makan orang yang membutuhkan (makan) karena kekikiran kan kerakusan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Itulah orang yang menghardik anak yatim} menolak anak yatim dari haknya dengan kasar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Itulah orang yang menghardik anak yatim,” yakni membentaknya dengan kasar dan keras, tidak mengasihinya karena kerasnya hatinya, dan karena ia tidak mengharapkan pahala, dan tidak takut akan siksa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pelanggaran pertama yang menjadi ciri-ciri orang mendustakan agama adalah mereka berbuat buruk kepada anak yatim, memreka memperlakukan anak yatim dengan keras tanpa kasih sayang, padahal mereka adalah anak-anak yang lemah, mereka kehilangan ayah-ayah mereka, maka sebagai muslim harus merasa bertanggung jawab atas taqdir yang mereka terima, karena memuliakan anak yatim sangatlah tinggi kedudukannya, Rasulullah ﷺ bersabda : << عَنْ سَهْلِ بَْنِ سَعْدٍ رضي الله عنه قَالَ : قَالَ رَسُولَ اَللَّهِ صلى الله عليه وسلم : أَنَا وَكَافِلُ الْيَتِيمِ فِى الْجَنَّةِ هكَذَ، وَأَشَارَ بِالسَّبَّابَةِ وَالْوُسطَى وَفَرَّجَ بَيْنَهُمَا شَيْئاً >> \"Dari Sahl bin Sa’ad Radhiallahu ‘anhu dia berkata: Rasulullah Shallallahu ‘alaihi wa sallam bersabda : “Aku dan orang yang menanggung anak yatim (kedudukannya) di surga seperti ini”, kemudian beliau Shallallahu ‘alaihi wa sallam mengisyaratkan jari telunjuk dan jari tengah beliau shallallahu ‘alaihi wa sallam, serta agak merenggangkan keduanya. [ HR al-Bukhari no. 4998 dan 5659 ] , menyantuni anak yatim adalah suatu kemuliaan yang tinggi derajatnya disisi Allah - عز وجل - ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "2-3. فَذَلِكَ الَّذِي يَدُعُّ الْيَتِيمَ (2) وَلَا يَحُضُّ عَلَى طَعَامِ الْمِسْكِينِ \" Itulah orang yang menghardik anak yatim, dan tidak menganjurkan memberi makan orang miskin.\" Allah mengumpulkan dua perkara: Pertama: Tidak berkasih sayang kepada anak-anak yatim yang mereka adalah tempat dituangkannya kasih-sayang, karena anak-anak yatim adalah anak-anak yang ditinggal meninggal oleh bapak-baoak mereka sebelum mereka baligh, mereka adalah tempat dituangkannya kasih dan sayang, kerena mereka kehilangan bapak-bapak mereka, hati mereka terpecah, membutuhkan penyemangat. Oleh karenya banyak dalil-dalil yang menjelaskan tentang keutamaan berbuat baik kepada anak-anak yatim. Tetapi orang ini wal'iyaadzu billah يَدُعُّ الْيَتِيمَ Maknanya: mendorongnya dengan kasar, karena kata اَلدَّعُّ [Ad-Da'u] artinya adalah mendorong dengan kasar, sebagaimana Allah Ta'ala berfirman: يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعًّا \" pada hari mereka didorong ke neraka Jahanam dengan sekuat-kuatnya. \"(QS. Ath-Thur: 13) Maknanya: Dorongan yang keras, maka anda dapati apabila ada anak yaitm yang mendatanginya, mencari sesuatu kepadanya, atau berbicara dengannya, ia merendahkannya dan mendorongnya dengan kasar, ia tidak menyayanginya. Yang ke dua: Mereka tidak mengajak untuk menyayangi orang lain وَلَا يَحُضُّ عَلَى طَعَامِ الْمِسْكِينِ \" dan tidak menganjurkan memberi makan orang miskin.\" Orang fakir miskin yang membutuhkan makanan, orang ini tidak mengajak untuk memberinya makan, karena hatinya bagai batu keras, hati-hati mereka seperti batu bahkan lebih keras. Ia tidak memiliki kasih sayang kepada anak-anak yatim dan orang-orang miskin, hatinya keras."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’un ayat 2: 2-3. Dan sebagian dari sifat manusia yang mengingkari hari kebangkitan dan pembalasan, dimana ia juga menahan (harta) anak yatim dengan kejam, dengan menjauhinya dan (perlakuannya yang) kasar, serta menahan hak waris bagi mereka (anak yatim); Dimana pada waktu itu bangsa Arab tidak mewariskan kepada perempuan dan anak kecil. Mereka berkata : Sesungguhnya yang berhak dengan warisan adakah dia yang membawa senjata dan melindungi suku (kaum). Dan dari sebagian sifat manusia-manusia pendusta bahwasanya mereka tidak menganjurkan pada selain dirinya untuk memberikan makan orang-orang miskin; Karena sebab kasih sayang telah dicabut dalam hatinya, oleh sebab itu tidak selain dirinya berbuat itu dan tidak menyeru akan perbuatan seperti itu (memberi makan orang miskin, dll.), karena masih wajar jika hanya memberlakukan bagi dirinya, (tapi mereka mengajak orang lain untuk melakukan hal serupa)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang mencegah haknya dengan keras, tidak punya rasa kasihan terhadapnya karena keras hatinya, dan karena ia tidak mengharap pahala dan tidak takut kepada siksa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’un Ayat 2",
    "description": "Jika engkau ingin tahu, maka para pendusta agama, hisab, dan hari pembalasan itulah orang yang menghardik anak yatim, menyakiti hatinya, dan berbuat zalim kepadanya dengan menahan haknya. Dia tidak lagi peduli terhadap anak yang sudah kehilangan tumpuan hidupnya itu. 3. Dan dia tidak mendorong orang lain untuk memberi makan orang miskin yang tidak mempunyai kecukupan untuk memenuhi keperluan hidupnya sehari-hari. Bila dia enggan mendorong orang lain untuk memberi makan dan memperhatikan kesejahteraan anak yatim, bagaimana mungkin dia, dengan kekikiran dan kecintaannya pada harta, mendorong dirinya sendiri untuk berbuat demikian'."
  }
]