[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia tidak mengajak orang lain untuk memberi makan orang yang membutuhkan yang tidak memiliki apa yang mencukupinya dan memenuhi kebutuhannya, bagaiman dia bisa memberi makannya sendiri.?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan tidak menganjurkan dirinya maupun menganjurkan orang lain untuk memberi makan kepada orang yang fakir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَ لَا يَحُضُّ عَلٰى طَعَامِ الۡمِسۡكِيۡنِؕ‏ (dan tidak menganjurkan memberi makan orang miskin) Yakni dia tidak mendorong dirinya, keluarganya, dan orang lain untuk melakukan itu, karena mereka sangat kikir terhadap hartanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Pendusta itu adalah orang yang menolak dan mencegah dengan keras anak yatim untuk menerima haknya, dengan kejam. Perlu diketahui bahwa bangsa Arab Jahiliyyah tidak memberi warisan kepada perempuan dan anak kecil, dan tidak mendorong dirinya, keluarganya dan orang lain untuk memberi makan orang yang membutuhkan (makan) karena kekikiran dan kerakusan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan tidak menganjurkan} tidak mendorong dirinya dan orang lain {untuk memberi makan orang miskin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan tidak menganjurkan” orang lain “memberi makan orang miskin,” dan lebih-lebih lagi, dia sendiri tidak memberi makan orang miskin."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Orang yang kedua adalah : Mereka yang tidak menganjurkan atau mengajak orang lain untuk memberi makan kepada orang miskin, karena orang-orang miskin memiliki hak-hak terhadap orang-orang kaya, sebagaimana Allah - عز وجل - menentukan jatah mereka pada harta zakat, bahkan kewajiban zakat sangat ditekankan dalam islam untuk kebutuhan orang-orang miskin. Orang yang tidak mengingatkan dirinya dan tidak pula mengajak orang lain untuk berbuat baik kepada orang miskin, atau bahkan dia menentang kewajiban ini, maka mereka termasu orang-orang yang mendustakan agama."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "2-3. فَذَلِكَ الَّذِي يَدُعُّ الْيَتِيمَ (2) وَلَا يَحُضُّ عَلَى طَعَامِ الْمِسْكِينِ \" Itulah orang yang menghardik anak yatim, dan tidak menganjurkan memberi makan orang miskin.\" Allah mengumpulkan dua perkara: Pertama: Tidak berkasih sayang kepada anak-anak yatim yang mereka adalah tempat dituangkannya kasih-sayang, karena anak-anak yatim adalah anak-anak yang ditinggal meninggal oleh bapak-baoak mereka sebelum mereka baligh, mereka adalah tempat dituangkannya kasih dan sayang, kerena mereka kehilangan bapak-bapak mereka, hati mereka terpecah, membutuhkan penyemangat. Oleh karenya banyak dalil-dalil yang menjelaskan tentang keutamaan berbuat baik kepada anak-anak yatim. Tetapi orang ini wal'iyaadzu billah يَدُعُّ الْيَتِيمَ Maknanya: mendorongnya dengan kasar, karena kata اَلدَّعُّ [Ad-Da'u] artinya adalah mendorong dengan kasar, sebagaimana Allah Ta'ala berfirman: يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعًّا \" pada hari mereka didorong ke neraka Jahanam dengan sekuat-kuatnya. \"(QS. Ath-Thur: 13) Maknanya: Dorongan yang keras, maka anda dapati apabila ada anak yaitm yang mendatanginya, mencari sesuatu kepadanya, atau berbicara dengannya, ia merendahkannya dan mendorongnya dengan kasar, ia tidak menyayanginya. Yang ke dua: Mereka tidak mengajak untuk menyayangi orang lain وَلَا يَحُضُّ عَلَى طَعَامِ الْمِسْكِينِ \" dan tidak menganjurkan memberi makan orang miskin.\" Orang fakir miskin yang membutuhkan makanan, orang ini tidak mengajak untuk memberinya makan, karena hatinya bagai batu keras, hati-hati mereka seperti batu bahkan lebih keras. Ia tidak memiliki kasih sayang kepada anak-anak yatim dan orang-orang miskin, hatinya keras."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’un ayat 3: 2-3. Dan sebagian dari sifat manusia yang mengingkari hari kebangkitan dan pembalasan, dimana ia juga menahan (harta) anak yatim dengan kejam, dengan menjauhinya dan (perlakuannya yang) kasar, serta menahan hak waris bagi mereka (anak yatim); Dimana pada waktu itu bangsa Arab tidak mewariskan kepada perempuan dan anak kecil. Mereka berkata : Sesungguhnya yang berhak dengan warisan adakah dia yang membawa senjata dan melindungi suku (kaum). Dan dari sebagian sifat manusia-manusia pendusta bahwasanya mereka tidak menganjurkan pada selain dirinya untuk memberikan makan orang-orang miskin; Karena sebab kasih sayang telah dicabut dalam hatinya, oleh sebab itu tidak selain dirinya berbuat itu dan tidak menyeru akan perbuatan seperti itu (memberi makan orang miskin, dll.), karena masih wajar jika hanya memberlakukan bagi dirinya, (tapi mereka mengajak orang lain untuk melakukan hal serupa)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dirinya maupun orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’un Ayat 3",
    "description": "Dan dia tidak mendorong orang lain untuk memberi makan orang miskin yang tidak mempunyai kecukupan untuk memenuhi keperluan hidupnya sehari-hari. Bila dia enggan mendorong orang lain untuk memberi makan dan memperhatikan kesejahteraan anak yatim, bagaimana mungkin dia, dengan kekikiran dan kecintaannya pada harta, mendorong dirinya sendiri untuk berbuat demikian'4-5. Maka binasa dan celakalah orang yang salat yang memiliki sifat-sifat tercela berikut. Yaitu orang-orang yang lalai terhadap salatnya, di antaranya dengan tidak memenuhi ketentuannya, mengerjakannya di luar waktunya, bermalas-malasan, dan lalai akan tujuan pelaksanaanya."
  }
]