[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Maka azab berat bagi orang orang yang shalat yang lalai dari shalat mereka, Yakni tidak menegakkannya sebagaimana mestinya dan tidak menunaikannya pada waktunya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Maka kehancuran dan siksa bagi orang-orang yang mendirikan salat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-7. Karena menjaga pelaksanaan shalat merupakan obat bagi masalah-masalah yang telah disebutkan, sebab shalat dapat menahan seseorang dari perbuatan keji dan mungkar; maka Allah menjanjikan kebinasaan dan siksaan bagi orang-orang yang shalat namun melaksanakannya tanpa memperhatikan waktu dan syarat-syaratnya, yang hanya untuk menampakkan amal kebaikan dan shalatnya kepada orang lain; dan ini merupakan salah satu sifat orang munafik. Dan Allah juga menjanjikan siksaan bagi orang-orang yang tidak menunaikan zakat bagi orang-orang yang berhak mendapatkannya, serta orang-orang yang enggan memberi pinjaman suatu barang yang tidak merugikan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-5 1 ). Allah menyebut mereka sebagai orang-orang yang shalat, tetapi justru mereka yang merusak sebutan itu dengan kelalaian mereka dalam mendirikan shalat, lalai dengan keepatan waktunya, atau dengan rukun dan syarat-syarat shalat yang tidak disempurnakan, atau shalat yang didirikan tanpa kekhusyu'an didalamya, ayat ini mencakup semua sifat tersebut, maka barangsiapa yang pada dirinya terdapat semua sifat-sifat itu, sungguh dia telah menjatuhkan diri kedalam kebinasaan dengan kemunafikan yang sempurna. 2 ). Ketahuilah wahai hamba semoga Allah membimbingmu kepada ketaatan, sesungguhnya tujuan utama dari perintah shalat adalah keridhoan hati seorang hamba kepada Allah dalam shalatnya, maka jika seseorang mendidikan shalat tanpa menghadirkan hatinya bagaikan tubuh tanpa ruh, hal ini di isyaratkan oleh firman Allah dalam surah ini : { فَوَيْلٌ لِلْمُصَلِّينَ , الَّذِينَ هُمْ عَنْ صَلَاتِهِمْ سَاهُونَ } ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kehancuran, kehinaan dan siksa pada hari kiamat bagi orang-orang shalat yang munafik. Ibnu Mandzur dari Ibnu Abbas tentang firmanNya {Fa Wailul lil musholliin} Dia berkata: “Ayat ini diturunkan untuk orang-orang munafik yang memamerkan shalat mereka kepada orang-orang mukmin saat ada mereka, meninggalkan shalat saat tidak ada mereka, dan melarang mereka untuk melakukan pinjaman yaitu sesuatu yang dipinjam”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah} azab dan kehancuranlah {orang-orang yang shalat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-5. “Maka kecelakaanlah bagi orang-orang yang shalat,” yaitu orang-orang yang konsisten menegakkan shalat, tapi mereka adalah “orang –orang yang lalai dari shalatnya,” yaitu menyia-nyiakannya, tidak shalat hingga waktunya berlalu dan tidak memenuhi rukun-rukunnya. Hal itu disebabkan mereka tidak mengindahkan titah Allah, karena mereka menyiakan-nyiakan shalat yang merupakan ketaatan paling utama. Melalaikan shalat membuat pelakunya berhak mendapatkan celaan dan hinaan. Lain halnya dengan lupa pada pada saat shalat, karena siapa saja bisa lupa, termasuk Nabi sendiri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian orang ketiga yang termasuk dalam golongan pendusta agama adalah : orang yang memandang remeh perkara shalat, yakni mereka lalai dengan kewajiba shalat, dalam ayat ini Allah menyebut mereka orang yang shalat akan tetapi dengan sikap yang tidak sepatutnya mereka lakukan, sdangkan orang yang tidak shalat adalah dari golongan orang-orang kafir, { فَوَيْلٌ لِلْمُصَلِّينَ } Kecelakaanlah bagi orang-orang yang shalat, Ancaman ini ditujukan kepada orang yang lalai dalam melaksanakan shalat, menganggap shalat adalah perkara biasa, lalu bagaimana dengan mereka yang benar-benar tidak melaksanakan shalat ?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "4-5. Kemudian Allah 'Azza Wa Jalla berfirman: فَوَيْلٌ لِلْمُصَلِّينَ \" Maka kecelakaanlah bagi orang-orang yang salat,\" Wail: Ini adalah kata untuk mengancam, kata ini sering terulang dalam al-Quran. Makna ayat ini adalah, ancaman berat atas mereka الَّذِينَ هُمْ عَنْ صَلَاتِهِمْ سَاهُونَ \"(yaitu) orang-orang yang lalai dari salatnya,\" Mereka melakukan shalat bersama orang-orang atau sendiri-sendiri akan tetapi mereka الَّذِينَ هُمْ عَنْ صَلَاتِهِمْ سَاهُونَ \"(yaitu) orang-orang yang lalai dari salatnya,\" Maknanya: Mereka terlalaikan darinya, tidak melaksanakannya sebagaimana mestinya, mereka menunda-nundanya dari waktu terbaiknya, tidak menyempurnakan ruku'nya, sujudnya, berdirinya, dan duduknya, mereka tidak membaca apa-apa yang wajib dibaca baik itu bacaan dzikir atau pun al-Quran. Apabila dia memasuki shalatnya ia lalai. Hatinya berjalan-jalan ke kanan dan ke kiri, ia lalai dari shalatnya, ini tercela, yang lalai dari shalatnya dan meremehkannya tidak diragukan bahwa ini tercela, sedangkan yang luput dalam shalat maka tidak dicela. Perbedaan antara melalaikan dan luput adalah bahwa yang luput adalah orang lupa sebagian shalat, lupa jumlah raka'at, lupa terhadap sebagian kewajiban-kewajiban shalat atau yang sebagainya. Oleh karena pernah terjadi keluputan pada Rasulullah shallallaahu 'alaihi wa sallam, padahal beliau adalah orang yang paling sergap dalam shalatnya, bahkan Beliau shallallaahu 'alaihi wa sallam bersabda وَجُعِلَتْ قُرَّةُ عَيْنِي فِي الصَّلَاةِ \" Dan telah dijadikan penyejuk pandangan mataku (ada) di dalam shalat\"(1) walau demikian beliau lupa dalam shalatnya, karena luput dalam sesuatu artinya adalah lupa sesuatu yang tidak dicela. Sedangkan yang lalai dari shalatnya maka dia adalah yang menyengaja meremehkan dalam shalatnya, dan termasuk kelalaian dalam sholat adalah orang-orang yang meninggalka sholat jama'ah, mereka ini tidak diragukan lagi adalah orang-orang yang lalai, mereka masuk dalam ancaman ini. (1) Dikeluarkan An-Nasaaiy (3939) dari hadits Anas Bin Malik radhiyallaahu 'anhu dan dinyatakan shahih oleh al-Albaniy dalam shahih al-Jaami' (3214)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’un ayat 4: 4-7. Kemudian Allah mengabarkan celakanya dan adzab bagi orang yang shalat, yang mengabaikan waktunya, dan yang tidak mengerjakannya untuk mencari wajah Allah, dan yang secara dzahir mereka beramal dengan amalan shalih karena ingin dipuji manusia, dan mereka yang menghalangi apa yang tidak menjadi kebiasaan untuk dilarang, seperti melarang menggunakan bejana-bejana dan selainnya dari apa yang tidak membahayakan ketika digunakan. Berkata Syaikh Ibnu Utsaimin pada pelajaran yang sama (di masjidil Haram) : Kita bersyukur Allah tidak mengatakan : Celaka bagi orang yang shalat, yaitu mereka yang في (di dalam( shalatnya lalai; Sebab tidak akan selamat seorangpun dari kelalaian dalam shalatnya, bahkan Nabi juga telah lalai dalam shalatnya lebih dari empat kali. Kemudian Allah berfirman : Pertama, فَوَيْلٌۭ لِّلْمُصَلِّينَ. Kedua ٱلَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ, karena para ulama berselisih akan hal itu, yang aku (Syaikh Ibnu Utsaimin) maksud adalah dalam memisah dan berhentinya (bacaan), dan jika yang mendengarkan, mendengar berhenti setelah ayat فَوَيْلٌۭ لِّلْمُصَلِّينَ, akan terkejut (keheranan) dan bertanya kenapa demikian ? Dan didatangkan jawaban pada ayat yang setelahnya. Adapun barangsiapa yang tidak shalat, maka tidak ada kecelakaan baginya; Akan tetapi kafir dan kekal dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’un Ayat 4",
    "description": "4-5. Maka binasa dan celakalah orang yang salat yang memiliki sifat-sifat tercela berikut. Yaitu orang-orang yang lalai terhadap salatnya, di antaranya dengan tidak memenuhi ketentuannya, mengerjakannya di luar waktunya, bermalas-malasan, dan lalai akan tujuan pelaksanaanya"
  }
]