[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang memperlihatkan amal-amal baik dalam rangka riya kepada manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Yaitu orang-orang yang ria dengan salat dan amal perbuatannya, tidak mengikhlaskan amalnya untuk Allah semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. الَّذِيۡنَ هُمۡ يُرَآءُوۡنَۙ‏ (orang-orang yang berbuat riya) Yakni mereka memamerkan shalat mereka kepada orang lain jika mereka shalat, atau memamerka segala amal kebaikan yang mereka kerjakan agar mendapat pujian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Mereka mengumpulkan segala sifat buruk dalam diri mereka : Mendustakan hari kebangkitan, mengurangi hak-hak kaum lemah, melalaikan shalat, sibuk dengan urusan dunia, semua sifat-sifat ini membuat mereka bergantung kepada sifat berbangga atas wadah-wadah yang mereka milik, dan mereka dengan segala sifat-sifat keji ini dalam beribadah hanya bermaksud mendapat perhatian dari orang lain, dan jika kamu mentelaah lebih jauh, maka kamu akan menemukan bahwa orang yang paling sedikit amalannya adalah mereka yang dalam dirinya terdapat sifat-sifat tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Mereka adalah orang-orang yang memamerkan shalat dan ibadah-ibadah lainnya agar mendapat pujian dan sanjungan atas amal ibadah mereka saja. Mereka mencegah orang lain untuk memberikan setiap jenis pertolongan dan bantuan, seperti air, garam, guci, kapak, pot dan benda-benda lainnya. Mereka juga melarang (menunaikan) zakat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang berbuat riya} orang-orang yang melakukan shalat dan ibadah lainnya untuk diperlihatkan kepada manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-7. Karena itulah Allah menyebutkan sifat mereka sebagai orang yang berbuat riya’, keras hati, dan tidak memiliki belas kasih seraya berfirman, “Orang-orang yang berbuat riya’,” yakni, melakukan pekerjaan untuk dilihat orang, “dan enggan (menolong dengan) barang berguna,” yaitu enggan memberikan sesuatu yang tidak memudaratkan untuk diberikan dengan cara dipinjamkan atau dihibahkan seperti bejana, gayung, kapak, dan lainnya yang biasanya diberikan atau direlakan. Mereka itu, karena amat kikir, enggan memberikan barang-barang yang berguna, lantas bagaimana halnya dengan benda yang lebih besar nilainya? Dalam surat ini terdapat anjuran serta dorongan untuk memberi makan anak yatim dan orang miskin, menjaga dan memelihara shalat, menunaikannya dengan ikhlas dan juga dengan amal-amal lainnya, dorongan untuk mengerjakan kebajikan, memberikan benda-benda misalnya meminjamkan bejana, gayung, kitab, dan lainnya, karena Allah mencela orang yang tidak melakukan hal itu. Wallahu a’lam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan diantara sifat orang yang mendustakan agama adalah : mereka mengerjakan shalat dengan harapan mendapat sanjungan dari orang lain, mendapat pujian dengan lamanya shalat yang ia lakukan, mereka shalat bukan mengharap keridhoan dari Allah - عز وجل - , jika ada yang melihat barulah ia berdiri dan melaksanakan shalat, dan jika orang-orang lalai dan tidak lagi melihatnya dia pun meniggalkan shalat, Allah - عز وجل - berfirman : { إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا } ( Sesungguhnya orang-orang munafik itu menipu Allah, dan Allah akan membalas tipuan mereka. Dan apabila mereka berdiri untuk shalat mereka berdiri dengan malas. Mereka bermaksud riya (dengan shalat) di hadapan manusia. Dan tidaklah mereka menyebut Allah kecuali sedikit sekali. ) [ An-Nisa : 142 ] , mereka shalat bukan untuk Allah - عز وجل - melainkan shalat untuk riya' dan sum'ah, orang seperti ini adalah orang yang tidak ada shalat baginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَوَيْلٌ لِلْمُصَلِّينَ (4) الَّذِينَ هُمْ عَنْ صَلَاتِهِمْ سَاهُونَ (5) الَّذِينَ هُمْ يُرَاءُونَ \" Maka kecelakaanlah bagi orang-orang yang salat, (yaitu) orang-orang yang lalai dari salatnya, orang-orang yang berbuat ria.\" Begitu juga ketika mereka melakukan ketaatan, mereka bertujuan mencari perhatian manusia, dan supaya mereka memiliki kedudukan di masyarakat, tujuan mereka tidaklah berteqarrub kepada Allah 'Azza Wa Jalla. Orang yang riya ini bersedekah agar dikatakan oleh orang-orang betapa dermawannya ia, orang yang shalat ini mebaguskan shalatnya agar dikatakan oleh orang-orang betapa bagusnya solat dia dan semisalnya, mereka berbuat riya. Landasan ibadah adalah untuk Allah, namun disamping itu mereka menginginkan pujian manusia atas ibadah itu, mereka mencari perhatian orang-orang dengan taqarrub mereka kepada Allah, mereka adalah orang-orang yang berbuat riya. Sedangkan yang shalat untuk manusia, bahwa ia shalat di hadapan raja misalnya, atau yang lainnya, ia menundukkan kepadanya dengan ruku' atau sujud, maka orang ini adalah musyrik kafir, telah diharamkan surga baginya dan tempat kembalinya adalah neraka. Tetapi orang ini shalat untuk Allah sambil berusaha mencari pujian manusia atas ibadahnya, sehingga terlihat dia beribadah kepada Allah 'Azza Wa Jalla, ini banyak terjadi pada orang-orang munafik, sebagaimana Allah Ta'ala berfirman: وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَى يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا \" Dan apabila mereka berdiri untuk salat mereka berdiri dengan malas. Mereka bermaksud riya (dengan salat) di hadapan manusia. Dan tidaklah mereka menyebut Allah kecuali sedikit sekali.\"(QS. An-Nisa: 142) Lihatlah pensifatan pada ayat ini, apabila mereka melakukan shalat, mereka malas melakukannya, dengan demikian maka mereka itu orang yang lalai dari shalatnya dan berbuat riya. Dan di sini Allah 'Azza Wa Jalla berfirman: الَّذِينَ هُمْ يُرَاءُونَ \" orang-orang yang berbuat ria.\" Apakah orang yang ingin didengar (dipuji bacaan Al-Quran) sama seperti mereka? Yakni jika ada seseorang yang membaca Quran, dan mengeraskan bacaannya, dan membaguskan lantunan suaranya agar dikatakan, betapa indahnya bacaannya! Apa dia ini seperti orang yang berbuat riya? Jawabannya: Ya, sebagaimana datang dalam hadits: مَنْ سَمَّعَ سَمَّعَ اللهُ بِهِ، وَمَنْ رَاءَى رَاءى اللهُ بِهِ \"Siapa saja yang berbuat sum'ah (ingin didengar lantunan bacaan Al-Qurannya agar dipuji) maka Allah akan campakkan dia dan barang siapa yang berbuat riya maka Allah akan campakkan (niat dihatinya) \"(1) Makna hadits ini: Barang siapa yang ingin dipuji dengan bacaan kerasnya maka Allah akan campakkan di hadapan manusia bahwa dia bukanlah orang yang ikhlas, tetapi dia ingin didengar indah lantunannya oleh manusia, sehingga orang-orang memujinya atas ibadahnya, dan yang berbuat riya pun demikian. Seseorang yang berbuat riya dan berbuat sum'ah di hadapan manusia, Allah akan mencampakkannya, dan hakikat dirinya akan terlihat cepat atau lambat. (1) Dikeluarkan Bukhari (6499) dan Muslim (2987) dari hadits Jundub Bin Abdillah radhiyallaah 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’un ayat 6: 4-7. Kemudian Allah mengabarkan celakanya dan adzab bagi orang yang shalat, yang mengabaikan waktunya, dan yang tidak mengerjakannya untuk mencari wajah Allah, dan yang secara dzahir mereka beramal dengan amalan shalih karena ingin dipuji manusia, dan mereka yang menghalangi apa yang tidak menjadi kebiasaan untuk dilarang, seperti melarang menggunakan bejana-bejana dan selainnya dari apa yang tidak membahayakan ketika digunakan. Berkata Syaikh Ibnu Utsaimin pada pelajaran yang sama (di masjidil Haram) : Kita bersyukur Allah tidak mengatakan : Celaka bagi orang yang shalat, yaitu mereka yang في (di dalam( shalatnya lalai; Sebab tidak akan selamat seorangpun dari kelalaian dalam shalatnya, bahkan Nabi juga telah lalai dalam shalatnya lebih dari empat kali. Kemudian Allah berfirman : Pertama, فَوَيْلٌۭ لِّلْمُصَلِّينَ. Kedua ٱلَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ, karena para ulama berselisih akan hal itu, yang aku (Syaikh Ibnu Utsaimin) maksud adalah dalam memisah dan berhentinya (bacaan), dan jika yang mendengarkan, mendengar berhenti setelah ayat فَوَيْلٌۭ لِّلْمُصَلِّينَ, akan terkejut (keheranan) dan bertanya kenapa demikian ? Dan didatangkan jawaban pada ayat yang setelahnya. Adapun barangsiapa yang tidak shalat, maka tidak ada kecelakaan baginya; Akan tetapi kafir dan kekal dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Riya ialah melakukan suatu amal tidak untuk mencari keridhaan Allah, akan tetapi untuk mencari pujian atau kemasyhuran di masyarakat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’un Ayat 6",
    "description": "Tidak hanya itu, mereka jugalah orang-orang yang berbuat ria, baik dalam salatnya maupun semua perbuatan baiknya. Dia beramal tanpa rasa ikhlas, melainkan demi mendapat pujian dan penilaian baik dari orang lain. 7. Dan di samping itu, mereka juga enggan memberikan bantuan kepada sesama, bahkan untuk sekadar meminjamkan barang keperluan sehari-hari yang sepele. Hal ini mengindikasikan buruknya akhlak mereka kepada orang lain. Dengan begitu, lengkaplah keburukan mereka. Selain tidak beridabah kepada tuhan dengan sempurna, mereka pun tidak berbuat baik kepada manusia."
  }
]