[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan menolak meminjamkan sesuatu yang tidak merugikan dirinya dengan meminjamkannya, seperti wadah dan lainnya. Mereka tidak baik dalam beribadah kepada tuhan mereka, dan tidak pula berbuat baik kepada makhluk Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan melarang untuk menolong orang lain dengan sesuatu yang tidak menimbulkan dampak buruk apabila ditolong dengannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. الَّذِيۡنَ هُمۡ يُرَآءُوۡنَۙ‏ (orang-orang yang berbuat riya) Yakni mereka memamerkan shalat mereka kepada orang lain jika mereka shalat, atau memamerka segala amal kebaikan yang mereka kerjakan agar mendapat pujian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَيَمْنَعُونَ الْمَاعُونَ } Mereka melarang orang lain untuk menggunakan apa yang mereka miliki dari hartanya, sedikit ataupun besarnya, dan jika orang-orang itu menginginkan wadah yang mereka miliki, tidaklah mereka kecuali orang-orang yang paling menolak dengan keras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Mereka adalah orang-orang yang memamerkan shalat dan ibadah-ibadah lainnya agar mendapat pujian dan sanjungan atas amal ibadah mereka saja. Mereka mencegah orang lain untuk memberikan setiap jenis pertolongan dan bantuan, seperti air, garam, guci, kapak, pot dan benda-benda lainnya. Mereka juga melarang (menunaikan) zakat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan enggan memberi bantuan} enggan memberi orang lain bantuan yang tidak memberi mereka mudharat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-7. Karena itulah Allah menyebutkan sifat mereka sebagai orang yang berbuat riya’, keras hati, dan tidak memiliki belas kasih seraya berfirman, “Orang-orang yang berbuat riya’,” yakni, melakukan pekerjaan untuk dilihat orang, “dan enggan (menolong dengan) barang berguna,” yaitu enggan memberikan sesuatu yang tidak memudaratkan untuk diberikan dengan cara dipinjamkan atau dihibahkan seperti bejana, gayung, kapak, dan lainnya yang biasanya diberikan atau direlakan. Mereka itu, karena amat kikir, enggan memberikan barang-barang yang berguna, lantas bagaimana halnya dengan benda yang lebih besar nilainya? Dalam surat ini terdapat anjuran serta dorongan untuk memberi makan anak yatim dan orang miskin, menjaga dan memelihara shalat, menunaikannya dengan ikhlas dan juga dengan amal-amal lainnya, dorongan untuk mengerjakan kebajikan, memberikan benda-benda misalnya meminjamkan bejana, gayung, kitab, dan lainnya, karena Allah mencela orang yang tidak melakukan hal itu. Wallahu a’lam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan mereka juga adalah orang yang enggan membantu orang lain dengan meminjamkan barang berguna yang ia miliki. { الْمَاعُونَ } Seluruh barang berguna yang dapat digunakan dan dipinjamkan untuk membantu kebutuhan manusia, seperti barang yang di serahkan untuk zakat, atau barang yang lebih umum. { وَيَمْنَعُونَ الْمَاعُونَ } Orang seperti ini adalah orang yang memiliki kebiasaan yang buruk."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَيَمْنَعُونَ الْمَاعُونَ \" dan enggan (menolong dengan) barang berguna.\" Maknanya: Mereka enggan memberi apa-apa yang wajib diberikan barupa wadah-wadah. Maksudnya: Ketika datang seorang insan kepada mereka untuk meminjam wadah dengan mengatakan: Saya membutuhkan ember, atau bejana untuk minum, atau membutuhkan lampu listrik atau yang semisalnya, ia enggan memberi, ini juga tercela. Enggan memberi bejana terbagi menjadi dua: Pertama: Seseorang berdosa dengannya Kedua: Seseorang tidak akan berdosa karenanya, tapi ia kehilangan kebaikan. Apa-apa yang wajib disumbangkan maka seorang insan akan berdosa jika enggan menyumbangnya, dan apa-apa yang tidak diwajibkan menyumbangnya maka seorang insan tidak berdosa karena keengganannya tetapi ia kehilangan kebaikan. Contohnya: Ada orang sedang membutuhkan air yang datang meminta air kepada seseorang, ia mengatakan: berikan aku air untuk minum, jika aku tidak minum maka aku akan mati, maka memberikan segelas air wajib baginya, ia akn berdosa jika tidak memberikannya, sampai-sampai sebagian ulama berkata: Seandainya ia mati maka dia harus menanggung pembayaran diyatnya, karena dialah yang menjadi sebab kematiannya, dan wajib baginya memberi yang ia minta. Oleh karenanya, maka wajib bagi setiap orang untuk melihat dirinya apakah dia termasuk orang memiliki sifat-sifat ini ataukah tidak? Jika ia termasuk orang yang memiliki sifat-sifat ini, ia mengesampingkan dan melalaikan salat, dan menahan kebaikan kepada orang lain maka bertaubatlah dan kembalilah kepada Allah, jika tidak maka ia terancam wal-'iyaadzu billah. Dan jika ia sudah berusaha bersih dari itu semua maka, ia mendapat kabar baik. Al-Quran al-Karim tujuannya bukanlah sekedar dibaca oleh seorang insan, ia sekedar beribadah dengan bacaannya saja, tujuan al-Qur'an adalah diambil akhlak darinya, oleh karenanya 'Aisyah radhiyallaahu 'anhaa mengatakan: \"Sesungguhnya akhlaknya Nabi shallallaah 'alaihi wa sallam adalah al-Quran\"(1) Akhlak beliau yang beliau berakhlak dengannya adalah dari al-Quran, semoga Allah memberikan taufiq kepada kita kepada apa yang terdapat kebaikan dan perbaikan di dalamnya di dunia dan akhirat, sesungguhnya Dia Maha kuasa atas segala sesuatu. (1) Dikeluarkan Muslim (746) dari hadits 'Aisyah radhiyallaahu'anha."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’un ayat 7: 4-7. Kemudian Allah mengabarkan celakanya dan adzab bagi orang yang shalat, yang mengabaikan waktunya, dan yang tidak mengerjakannya untuk mencari wajah Allah, dan yang secara dzahir mereka beramal dengan amalan shalih karena ingin dipuji manusia, dan mereka yang menghalangi apa yang tidak menjadi kebiasaan untuk dilarang, seperti melarang menggunakan bejana-bejana dan selainnya dari apa yang tidak membahayakan ketika digunakan. Berkata Syaikh Ibnu Utsaimin pada pelajaran yang sama (di masjidil Haram) : Kita bersyukur Allah tidak mengatakan : Celaka bagi orang yang shalat, yaitu mereka yang في (di dalam( shalatnya lalai; Sebab tidak akan selamat seorangpun dari kelalaian dalam shalatnya, bahkan Nabi juga telah lalai dalam shalatnya lebih dari empat kali. Kemudian Allah berfirman : Pertama, فَوَيْلٌۭ لِّلْمُصَلِّينَ. Kedua ٱلَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ, karena para ulama berselisih akan hal itu, yang aku (Syaikh Ibnu Utsaimin) maksud adalah dalam memisah dan berhentinya (bacaan), dan jika yang mendengarkan, mendengar berhenti setelah ayat فَوَيْلٌۭ لِّلْمُصَلِّينَ, akan terkejut (keheranan) dan bertanya kenapa demikian ? Dan didatangkan jawaban pada ayat yang setelahnya. Adapun barangsiapa yang tidak shalat, maka tidak ada kecelakaan baginya; Akan tetapi kafir dan kekal dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa barang-barang yang berguna yang jika dipinjamkan atau diberikannya tidaklah merugikannya karena murah dan ringannya seperti jarum, ember, gayung, paku, periuk, piring, pena, buku, dsb. Jika barang-barang yang ringan itu saja berat untuk diberikan, maka apalagi dengan barang-barang yang di atasnya. Sebagian mufassirin mengartikan ayat di atas dengan enggan membayar zakat. Dalam surah yang mulia ini terdapat anjuran untuk memuliakan anak yatim, orang-orang miskin, mendorong diri atau orang lain untuk memberi makan orang miskin, memperhatikan perkara shalat, menjaganya, dan berlaku ikhlas dalam semua amalan. Demikian pula terdapat anjuran mengerjakan perkara yang ma’ruf dan memberikan harta-harta yang ringan yang bermanfaat, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’un Ayat 7",
    "description": "Dan di samping itu, mereka juga enggan memberikan bantuan kepada sesama, bahkan untuk sekadar meminjamkan barang keperluan sehari-hari yang sepele. Hal ini mengindikasikan buruknya akhlak mereka kepada orang lain. Dengan begitu, lengkaplah keburukan mereka. Selain tidak beridabah kepada tuhan dengan sempurna, mereka pun tidak berbuat baik kepada manusia. 1. Wahai nabi Muhammad, sungguh kami telah memberimu nikmat yang banyak dan langgeng, meliputi kenikmatan duniawi maupun ukhrawi, seperti kenabian, Al-Qur'an, syafaat, telaga di surga, dan sebagainya."
  }
]