[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Semua yang ada di langit dan di bumi menyucikan Allah dari apa yang tidak pantas bagiNya. Hanya milik Allah semata kewenangan bertindak dalam segala urusan, bagiNya sanjungan yang baik, dan Dia Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Semua makhluk yang ada di langit dan di bumi menyucikan Allah dan membersihkan-Nya dari segala sifat kekurangan yang tidak pantas bagi-Nya. Hanya milik-Nya kerajaan, dan tidak ada raja selain-Nya, bagi-Nya pujian yang baik dan Dia Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang mampu melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Seluruh makhluk yang ada di tujuh langit dan bumi mengucapkan tasbih kepada Allah, menyucikan-Nya dari segala yang tidak layak bagi-Nya, dan mengagungkan-Nya. milik-Nya seluruh kerajaan, dan Dia berkuasa atas segalanya. Bagi-Nya pujian dan syukur yang sempurna setiap saat. Dia Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Seluruh makhluk di langit dan bumi mensucikan Allah SWT dari setiap kekurangan dan mengagungkanNya dengan cara yang tidak kita ketahui. BagiNya kerajaan dan kekuasaan yang mutlak, bagiNya pula rasa syukur yang besar atas nikmatNya yang sangat banyak. Dialah Dzat yang Maha Kuasa atas segala sesuatu dengan mengadakan atau menghilangkannya dan tidak ada satupun yang mampu melemahkanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang ada di langit dan yang ada di bumi senantiasa bertasbih kepada Allah. MilikNyalah segala kerajaan dan segala pujian, dan Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ayat-ayat mulia ini mencakup jumlah besar sifat-sifat agung Allah Yang Maha Pencipta. Allah menyebutkan kesempurnaan ketuhananNya, luasnya kekayaanNya, semua makhluk memerlukanNya, semua makhluk yang ada di langit dan di bumi bertasbih memuji Rabbnya, seluruh kerajaan hanya milik Allah, tidak ada satu makhluk pun yang terlepas dari kekuasaanNya, segala puji hanya milik Allah semata. Pujian atas sifat-sifat kesempurnaan yang Dia miliki. Pujian atas segala sesuatu yang Dia ciptakan. Pujian atas hukum-hukum yang disyariatkan dan nikmat-nikmat yang dikaruniakan. kekuasaanNya menyeluruh, yang tidak satu makhluk pun terlepas darinya. Tidak ada sesuatu pun yang menghalangi kehendakNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 1: Allah mengabarkan bahwa semua yang terkandung di langit dan di bumi, baik yang diam tidak bergerak maupun yang bergerak mensucikan Allah dengan pensucian yang terus menerus atas apa yang tidak layak bagi kemulian dan keagungan Allah. Kemudian Allah menjelaskan bahwa Dia memiliki kekuasaan yang sempurna pada segala sesuatu; Tidak akan keluar satupun makhluk dari kerajaan-Nya, dan Allah memiliki pujian dan kemuliaan dan rasa syukur makhluk pada-Nya dari awal hingga akhir. Kemudian Allah menjelaskan bahwa Dia Maha Kuasa atas segala sesuatu; Dia kuasa atas yang ada dan yang tiada, dan yang menjadikan penyakit dan penyembuhnya, tidak ada yang melemahkan Allah sesuatupun di bumi dan tidak juga di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat yang mulia ini dan setelahnya mengandung sejumlah sifat-sifat Allah yang agung. Disebutkan di sana keberhakan-Nya untuk disembah, luasnya kekayaan-Nya, butuhnya semua makhluk kepada-Nya, dan bertasbihnya semua yang ada di langit dan di bumi dengan memuji Tuhannya, dan bahwa kerajaan semuanya milik Allah, sehingga tidak ada satu pun makhluk yang keluar dari milik-Nya, segala puji adalah untuk-Nya. Dia terpuji karena sifat-sifat sempurna yang dimiliki-Nya, terpuji karena apa yang diwujudkan-Nya, terpuji karena hukum-hukum yang disyariatkan-Nya, dan nikmat-nikmat yang diberikan-Nya. Kekuasaan-Nya menyeluruh, dimana semua yang ada tidak lepas dari kekuasaan-Nya, sehingga tidak ada sesuatu pun yang dapat melemahkan keinginan-Nya. Dia yang menciptakan semua hamba, di antara mereka ada yang mukmin dan ada yang kafir. Keimanan dan kekafiran mereka adalah dengan qadha’ Allah dan qadar-Nya, Dialah yang menghendaki hal itu (namun apa yang dikehendaki tidak mesti dicintai-Nya) dengan memberikan kepada mereka kemampuan dan keinginan sehingga mereka dapat melakukan apa yang mereka inginkan, dan Allah Maha Melihat apa yang mereka kerjakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 1",
    "description": "Apa yang ada di langit, bintang, bulan, matahari, dan seluruh planet; dan demikian juga apa yang ada di bumi, daratan, lautan, gunung, lembah, hewan, dan tumbuh-tumbuhan; seluruhnya senantiasa bertasbih kepada Allah dengan cara masing-masing; milik-Nya semua kerajaan, kekuasaan, dan kewenangan yang tiada terbatas, dan bagi-Nya pula segala puji yang sempurna; dan dia mahakuasa atas segala sesuatu dengan kekuasaan yang tak terbatas, tetapi tidak sewenang-wenang. 2. Dialah yang menciptakan kamu dalam bentuk yang sebaik-baiknya, lalu di antara kamu ada yang kafir, karena mengikuti hawa nafsu; dan di antara kamu juga ada yang mukmin, karena Allah memberikan petunjuk dan manusia menggunakan akal dan nuraninya. Dan Allah maha melihat apa yang kamu kerjakan sehingga tidak satu pun perbuatan manusia yang tidak diketahui-Nya."
  }
]