[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Orang-orang yang mengingkari bahwa Allah adalah Tuhan yang haq dan mendustakan bukti-bukti rububiyah dan argument-argumen uluhiyahNya yang dengannya Allah mengutus para RasulNya, mereka adalah penghuni neraka yang kekal di dalamnya selama-lamanya, seburuk-buruk tempat kembali bagi mereka adalah Neraka Jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan orang-orang yang kafir terhadap Allah dan mendustakan ayat-ayat Kami yang telah Kami turunkan kepada Rasul Kami, mereka adalah penghuni Neraka, menetap di dalamnya selamanya, dan seburuk-buruk tempat kembali adalah tempat kembali mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Sedangkan orang-orang yang mendustakan Allah, ayat-ayat-Nya, dan mukjizat-mukjizat yang Allah berikan kepada para rasul-Nya; maka orang-orang yang jauh dari rahmat Allah itu adalah penghuni neraka selamanya. Betapa buruk neraka Jahannam yang menjadi tempat kembali mereka itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dan orang-orang yang menolak, mengingkari adanya Allah dan ketauhidanNya dan mendustakan ayat-ayat Kami, yaitu Al-Quran, mereka adalah penduduk neraka. Mereka menetap di sana selama-lamanya. Seburuk-buruk tempat kembali itu adalah tempat kembali mereka di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang ingkar dan mendustakan ayat-ayat Kami, mereka itulah penghuni neraka. Mereka kekal di dalamnya. Itulah seburuk-buruk tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami,” maksudnya, kufur terhadapnya tanpa dilandasi dasar syari maupun akal, bahkan dalil-dalil dan penjelasan-penjelasan itu datang kepada mereka, namun mereka mendustakan dan menentangnya, “mereka itulah penghuni-penghuni neraka, mereka kekal di dalamnya. Dan itulah seburuk-buruk tempat kembali.” Karena neraka itu mencakup segala keburukan, kengerian, kesengsaraan, dan siksa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 10: Adapun mereka yang menolak keesaan Allah dan kekuasaan-Nya, serta mereka mendustakan hujjah dan bukti yang diturunkan kepada Nabi-Nya Muhammad ﷺ; Maka mereka itu tempatnya adalah di jahannam, tinggal mereka di dalamnya selamanya, dan seburuk-buruk neraka yang mereka tempati dan tinggali, karena mereka telah mengumpulkan seluruh keburukan, dan keburukan adzab pula yang merka terima."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka mengingkarinya tanpa sandaran syar’i maupun ‘aqli (akal), bahkan datang kepada mereka dalil-dalil dan bukti, namun mereka tetap mendustakan dan menentangnya. Hal itu, karena di neraka menghimpun semua keburukan, kesengsaraan dan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 10",
    "description": "Berbeda dengan orang-orang beriman dan beramal saleh yang akan diampuni dan dimasukkan ke dalam surga, Allah menegaskan tentang nasib orang-orang kafir. Dan orang-orang yang kafir, yaitu orang-orang yang menolak beriman kepada Allah dan rasul-Nya; dan mendustakan ayat-ayat kami, ayat-ayat Al-Qur'an; mereka itulah penghuni neraka, karena kekufuran mereka selama hidup di dunia; mereka kekal di dalamnya, karena Allah tidak akan mengampuni orang-orang kafir. Dan itulah seburuk-buruk tempat kembali, karena neraka itu tempat hukuman, bukan tempat kenikmatan. 11. Allah tidak hanya menciptakan makhluk, tetapi juga mengatur seluruh makhluk. Tidak ada sesuatu musibah yang menimpa seseorang dalam kehidupan ini, kecuali dengan izin Allah, karena Allah mengetahui dan mengatur kehidupan ini; dan barang siapa beriman kepada Allah dengan istikamah, niscaya Allah akan memberi petunjuk kepada hatinya dengan memantapkan imannya. Dan Allah maha mengetahui segala sesuatu yang terjadi di jagat raya maupun yang terjadi di jagat kecil, sanubari manusia."
  }
]