[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Seseorang tidaklah ditimpa sesuatu yang tidak diinginkannya kecuali dengan izin Allah, ketetapan, dan takdirNYa. Barangsiapa beriman kepada Allah, niscaya Allah membimbing hatinya untuk menerima perintahNya dan rela kepada keputusanNYa, Allah membimbingnya kepada keadaan, perkataan dan perbuatan terbaik, sebab dasar hidayah adalah hati, sementara anggota badan adalah pengikut. Allah Maha Mengetahui segala sesuatu, tidak ada sedikit pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Tidak ada suatu musibah pun yang menimpa seseorang pada dirinya, hartanya atau anaknya melainkan dengan kada dan takdir Allah. Barangsiapa beriman kepada Allah, kada -Nya dan takdir-Nya niscaya Allah akan memberi petunjuk kepada hatinya dengan berserah diri kepada perintah-Nya, dan rida dengan takdir-Nya, dan Allah Mahatahu atas segala sesuatu, tidak ada sesuatu pun yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah menentramkan hati hamba-hamba-Nya yang tertimpa musibah: Segala cobaan yang menimpa seorang hamba, sesungguhnya merupakan ketetapan Allah; dan barangsiapa yang beriman kepada Allah dan mengakui keesaan-Nya, maka Allah akan memberi petunjuk bagi hatinya untuk memenuhi rukun-rukun keimanan dan berserah diri dan menerima ketatapan Allah. Allah Maha Melihat segala kebaikan atau keburukan yang kalian perbuat, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. مَآ أَصَابَ مِن مُّصِيبَةٍ إِلَّا بِإِذْنِ اللَّـهِ (Tidak ada suatu musibah pun yang menimpa seseorang kecuali dengan ijin Allah) Yakni dengan ketetapan dan takdir Allah. Terdapat pendapat mengatakan bahwa sebab turunnya ayat ini adalah orang-orang kafir berkata: “Jika kaum muslimin itu memang benar niscaya Allah tidak akan menimpakan mereka musibah di dunia.” وَمَن يُؤْمِنۢ بِاللَّـهِ يَهْدِ قَلْبَهُۥ (dan barangsiapa yang beriman kepada Allah niscaya Dia akan memberi petunjuk kepada hatinya) Yakni barangsiapa yang percaya bahwa tidak ada sesuatu yang menimpanya melainkan dengan takdir Allah maka Allah akan memberi petunjuk kepada hatinya saat musibah itu datang, sehingga ia akan mengetahui bahwa musibah itu dari Allah, dan apa yang menimpanya itu tidak akan dapat ia hindari, dan apa yang tidak menimpanya tidak akan mengenainya, sehingga ia dapat menyerahkan dirinya kepada ketentuan Allah dan mengembalikan semuanya kepada Allah; jika ia ditimpa musibah maka ia bersabar, dan jika mendapat kenikmatan maka ia bersyukur. وَاللَّـهُ بِكُلِّ شَىْءٍ عَلِيمٌ(Dan Allah Maha Mengetahui segala sesuatu) Yakni Maha Mengetahui, tidak ada yang tersembunyi darinya sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Tidak ada musibah apapun yang menimpa seseorang (yaitu setiap sesuatu ditunjukkan kepadanya baik kebaikan maupun keburukan dan menimpa dirinya atau hartanya) tanpa sepengetahuan Allah, kehendak, takdir dan kuasaNya. Barangsiapa benar-benar beriman kepada Allah, maka hatinya akan ditunjukkan pada kebaikan, kesabaran, dan keridhaan atas musibah itu. Dia juga akan mengetahui bahwa sesungguhnya musibah itu dari Allah. Dan Allah adalah Dzat yang Maha Mengetahui segala sesuatu. Tidak ada yang dapat tersembunyi dariNya, bahwan misteri-misteri dan keadaan hati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada suatu musibah pun yang menimpa, kecuali dengan izin Allah} dengan ketetapan dan takdir Allah {Siapa saja yang beriman kepada Allah, niscaya Dia akan memberi petunjuk kepada hatinya} menuntun hatinya untuk berserah diri kepada perintahNya dan ridha dengan keputusanNya {Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Allah berfirman, “Tidak ada sesuatu musibah pun yang menimpa seseorang kecuali dengan izin Allah.” Ini berlaku secara umum untuk berbagai musibah yang menimpa diri, harta, anak, orang-orang tercinta, dan lainnya. Semua yang menimpa manusia berdasarkan Qadha dan Qadar Allah. Allah telah mengetahui hal itu sebelumnya, penaNya telah menulis semua takdir dan ketentuan. Dengan pena itu, kehendak dan hikmahNya berlaku. Namun yang amat penting adalah apakah manusia menunaikan tugasnya dalam hal Qadha dan Qadar ataukah tidak? Jika ia menunaikannya, maka ia akan mendapatkan pahala yang besar dan indah, baik di dunia maupun di akhirat. Jika percaya bahwa semua yang menimpanya berasal dari sisi Allah, merelakannya, dan menyerahkan masalahnya, maka Allah akan menunjukkan hatinya sehingga ia akan merasa tenang dan tidak gentar ketika tertimpa berbagai musibah, tidak seperti yang terjadi pada orang yang hatinya tidak diberi petunjuk oleh Allah. Allah memberikan keteguhan pada orang yang hatinya diberi petunjuk ketika musibah datang serta bersikap sabar. Dengan demikian, ia mendapatkan pahala besar di samping pahala besar yang disimpan Allah pada hari Pembalasan kelak. Ini sejalan dengan Firman Allah, “Sesungguhnya hanya orang-orang yang bersabarlah Yang dicukupkan pahala mereka tanpa batas.” -Az-Zumar: 10 Dari sini dapat diketahui, bahwa orang yang tidak beriman kepada Allah pada saat tertimpa musibah karena tidak memahami takdir dan ketentuan Allah namun hanya terbatas pada sebab-sebabnya saja, maka ia telah dihinakan, dan Allah-pun menyerahkan urusannya itu pada dirinya sendiri. Apabila seseorang hamba telah diserahkan pada dirinya sendiri padahal jiwa manusia itu hanya bisa berkeluh kesah dan bersedih, maka hal itu merupakan siksaan yang disegerakan bagi seorang hamba sebelum siksaan akhirat nanti karena tidak menunaikan kewajiban bersabar. Inilah yang berkaitan dengan Firman Allah, “Dan barangsiapa yang beriman kepada Allah, niscaya Dia akan memberi petunjuk kepada hatinya,” yakni ketika tertimpa musibah. Adapun yang berkaitan dengan keumuman tekstual ayat, Allah memberitahukan bahwa setiap orang yang beriman (maksudnya, dengan keimanan sesuai yang diperintahkan yaitu beriman kepada Allah, malaikat, kitab, rasul, Hari Akhir, dan takdir, baik dan buruknya) dan membuktikan kebenaran imannya dengan menunaikan tuntutan-tuntutan serta kewajiban-kewajiban iman, faktor yang dilakukan oleh seorang hamba seperti ini merupakan faktor terbesar hidayah Allah dalam perkataan, perbuatan, dan di segala halnya, dan juga dalam ilmu dan amalnya. Ini adalah balasan terbaik yang diberikan Allah bagi orang-orang yang beriman. Sebagaimana yang disebutkan dalam Firman Allah ketika memberitahukan bahwa Dia meneguhkan orang-orang yang beriman dalam kehidupan dunia dan di akhirat. Asal mula keteguhan adalah keteguhan hati, kesabaran, dan keyakinannya ketika tertimpa berbagai musibah. Firman Allah yang dimaksud adalah, “Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh itu dalam kehidupan di dunia dan di akhirat;” -Ibrahim:27- Orang yang beriman adalah orang yang hatinya mendapatkan hidayah dan paling kuat ketika tertimpa berbagai musibah yang merisaukan. Hal itu dikarenakan keimanan yang tertanam pada diri mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 11: Ketahuilah bahwa semua musibah yang menimpa seorang hamba dari sebagian musibah-musibah pada badan, anak, harta, bencana, gempa bumi dan setiap yang terjadi segala keadaannya adalah atas izin Allah, Allah tahu, Allah memiliki melakukan sesuai keinginan-Nya; Maka barangsiapa yang beriman kepada Allah dan mengetahui atas apa yang menimpa tidaklah menimpa kecuali dengan kuasa Allah, yang dengannya Allah berikan petunjuk pada hatinya, atau Allah berikan ketenangan dan kesabaran pada hatinya serta ridha dengan takdir Allah. Kemudian Allah menjelaskan bahwa Allah Maha Mengetahui atas segala sesuatunya, atau Dia mengetahui orang yang beriman dan yang bermaksiat, yang tidak rela dan yang tenang, dan mengetahui musibah yang ditimpakan, apakah musibah tersebut akibat dari dosa yang manusia lakukan atau dengan sebab lain ? Di sini Allah mengokohkan mereka yang beriman dan keimanan tersebut menenmpati hati-hati mereka karena sebab takdir Allah dan kuasa-Nya, maka mereka akan mengucapkan : إِنَّا لِلَّهِ وَإِنَّآ إِلَيْهِ رَ‌ٰجِعُونَ {Al Baqarah : 156} dan mereka akan berkata : حَسْبُنَا ٱللَّهُ وَنِعْمَ ٱلْوَكِيلُ {Ali Imran : 173}. Adapun selain orang-orang yang beriman mereka akan kebingungan, menangis, atau menjerit-jerit, dan mungkin juga menampar-nampar dirinya sendiri dan merobek-robek pakaiannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan perintah Allah, yakni dari taqdir dan kehendak-Nya. Hal ini umum mencakup semua musibah baik yang menimpa diri, harta, anak, kekasih dsb. Semua ini dengan qadha’ Allah dan qadar-Nya yang telah diketahui oleh Allah, ditulis-Nya, dikehendaki-Nya dan sejalan dengan hikmah-Nya? Yang terpenting di antara semua itu adalah apakah seorang hamba dapat memikul tugasnya (bersabar) dalam kondisi ini atau tidak? Barang siapa yang mampu memikulnya dengan bersabar, maka dia akan memperoleh pahala yang besar di dunia dan akhirat. Jika dia beriman bahwa musibah itu dari sisi Allah, dia pun ridha dengannya serta menerima, maka Allah akan menunjuki hatinya sehingga dia pun tenang dan tidak akan gelisah ketika ada musibah sebagaimana yang terjadi pada orang yang tidak ditunjuki oleh Allah hatinya. Tidak hanya itu, Allah Subhaanahu wa Ta'aala juga mengaruniakan kepadanya tsabat (keteguhan) ketika musibah itu datang, dan ia mampu memikul tugasnya yaitu bersabar sehingga ia memperoleh pahala yang segera disamping pahala yang Allah simpan untuknya pada hari pembalasan sebagaimana firman Allah Ta’ala, “Sesungguhnya hanya orang-orang yang bersabarlah yang dicukupkan pahala mereka tanpa batas.” (Terj. Az Zumar: 10) Dari ayat ini juga dapat diketahui, bahwa barang siapa yang tidak beriman kepada Allah ketika ada musibah, yakni Dia tidak melihat kepada qadha’ Allah dan qadar-Nya, bahkan berhenti di hadapan sebab, maka dia akan ditelantarkan dan Allah Subhaanahu wa Ta'aala akan menyerahkannya kepada dirinya, dan jika sudah diserahkan kepada dirinya, maka tidak ada yang dia lakukan selain keluh kesah dan gelisah yang merupakan hukuman yang disegerakan kepada seorang hamba sebelum hukuman di akhirat karena ia melalaikan kewajiban sabar. Hal ini yang terkait dengan firman-Nya, “Tidak ada suatu musibah yang menimpa seseorang, kecuali dengan izin Allah,” dalam hal musibah, adapun yang terkait dengan ayat itu dari sisi keumuman lafaz adalah bahwa Allah Subhaanahu wa Ta'aala memberitahukan, barang siapa yang beriman yakni kepada semua yang diperintahkan untuk diimani seperti beriman kepada rukun iman yang enam dan ia benarkan imannya dengan konsekwensi dari iman berupa menegakkan lawazim (hal yang menyatu) dan kewajibannya, maka keimanannya itu merupakan sebab terbesar agar ia mendapatkan hidayah Allah dalam semua keadaaannya, ucapannya dan perbuatannya, demikian pula dalam ilmu dan amalnya. Ini merupakan balasan paling utama yang diberikan Allah kepada orang-orang yang beriman sebagaimana firman Allah Ta’ala, “Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh itu dalam kehidupan di dunia dan di akhirat; dan Allah menyesatkan orang-orang yang zalim dan berbuat apa yang Dia kehendaki.” (Terj. Ibrahim: 27) Pada asalnya tsabat (keteguhan) adalah tetapnya hati, sabar dan yakinnya dia ketika datang semua fitnah. Oleh karena itu, orang-orang yang beriman adalah orang-orang yang paling mendapat petunjuk hatinya, paling kokoh saat menghadapi peristiwa yang mengguncangkan hatinya karena keimanan yang ada padanya. Menurut Ibnu Katsir, maksudnya adalah barang siapa yang ditimpa musibah lalu ia mengetahui bahwa musibah itu dengan dengan qadha’ Allah dan qadar-Nya, sehingga ia pun bersabar dan mengharap pahala, maka Allah Subhaanahu wa Ta'aala mengganti terhadap apa yang luput baginya dari dunia dengan petunjuk dan keyakinan yang benar di dunia. Ibnu Abbas berkata, “Maksudnya Allah tunjuki hatinya kepada keyakinan, sehingga dia mengetahui bahwa apa yang (ditetapkan) menimpanya maka tidak akan meleset dan apa yang tidak akan menimpanya, maka tidak akan mengenainya.” Al A’masy berkata dari ‘Alqamah tentang ayat, “Dan barang siapa yang beriman kepada Allah, niscaya Dia akan tunjuki hatinya,“ maksudnya adalah seorang yang terkena musibah, ia pun mengetahui bahwa musibah itu berasal dari sisi Allah sehingga ia pun ridha dan menerima.“ Sa’id bin Jubair berkata, “Ia beristirja’ dengan mengucapkan innaa lillahi wa innaa ilaihi raaji’uun (artinya: sesungguhnya kami milik Allah dan akan kembali kepada-Nya).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 11",
    "description": "Allah tidak hanya menciptakan makhluk, tetapi juga mengatur seluruh makhluk. Tidak ada sesuatu musibah yang menimpa seseorang dalam kehidupan ini, kecuali dengan izin Allah, karena Allah mengetahui dan mengatur kehidupan ini; dan barang siapa beriman kepada Allah dengan istikamah, niscaya Allah akan memberi petunjuk kepada hatinya dengan memantapkan imannya. Dan Allah maha mengetahui segala sesuatu yang terjadi di jagat raya maupun yang terjadi di jagat kecil, sanubari manusia. 12. Allah mengajarkan kepada manusia cara yang benar dan tepat dalam hidup ini. Dan taatlah wahai manusia kepada Allah dengan beriman dan melaksanakan perintah-Nya serta menjauhi larangan-Nya; dan taatlah kepada rasul dengan mengikuti sunah-sunahnya. Jika kamu berpaling dari Allah dengan kufur atau mengabaikan perintah-Nya dan berpaling dari rasul dengan melupakan sunahnya, maka sesungguhnya kewajiban rasul kami hanyalah menyampaikan ajaran Allah kepada umat manusia dengan terang sehingga manusia mengenal ajaran Allah dengan benar."
  }
]