[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12. Taatilah Allah (wahai manusia) dan tunduklah kepada perintah dan laranganNYa. Taatilah Rasulullah dalam apa yang beliau sampaikan dari Tuhannya. Bila kalian berpaling dari ketaatan kepada Allah dan RasulNya, maka Rasul Kami tidak ditimpa kerugian apa pun dari berpalingnya kalian, karena tugasnya hanya menyampikan apa yang dengannya Allah mengutusnya kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Taatilah Allah dan taatilah Rasul-Nya. Jika kalian berpaling dari apa yang dibawa oleh Rasul-Nya maka dosa berpaling itu menjadi bebanmu, dan tugas Rasul Kami tidak lain hanyalah menyampaikan apa yang diperintahkan untuk disampaikan, dan dia telah menyampaikan apa yang diperintahkan untuk disampaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Taatilah Allah dalam hukum-hukum-Nya yang agung dan taatilah Rasulullah dalam sunnah-sunnahnya yang mulia; namun jika kalian berpaling dari ketaatan ini, maka rasul Kami tidak bertanggung jawab melainkan untuk menyampaikan risalah dengan sejelas-jelasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَأَطِيعُوا۟ اللَّـهَ وَأَطِيعُوا۟ الرَّسُولَ ۚ (Dan taatlah kepada Allah dan taatlah kepada Rasul-Nya) Yakni sibukkanlah diri kalian dengan ketaatan kepada Allah dan Rasulullah. فَإِن تَوَلَّيْتُمْ(ika kamu berpaling) Yakni jika kalian enggan untuk taat maka dosanya akan kalian tanggung sendiri, dan itu tidak akan menimpakan kepada Rasulullah sedikitpun. فَإِنَّمَا عَلَىٰ رَسُولِنَا الْبَلٰغُ الْمُبِينُ(ungguhnya kewajiban Rasul Kami hanyalah menyampaikan (amanat Allah) dengan terang) Tidak ada tanggungan atasnya selain hal itu, dan Rasulullah telah menyampaikan risalah itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Wahai kaum mukmin dan kaum lainnya, taatlah kepada Allah dan rasulNya. Jika kalian menjauh dari ketaatan, maka sesungguhnya di sisi utusan Kami itu penyampaian (petunjuk) dengan jelas. Tidak ada yang dia pikul selain hal itu, dan di sisi Kami ada hisab dan pembalasan di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Taatlah kepada Allah dan taatlah kepada Rasul. Jika kalian berpaling} berpaling tidak mau taat kepada Allah dan Rasulallah SAW {sesungguhnya kewajiban rasul Kami hanyalah menyampaikan dengan terang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah berfirman, “Dan taatlah kepada Allah dan taatlah kepada rasul,” maksudnya dalam menunaikan perintah Allah dan RasulNya adalah pusat kebahagiaan dan tanda-tanda keberuntungan. “jika kamu berpaling,” dari mentaati Allah dan mentaati Rasul, “maka sesungguhnya kewajiban Rasul kami hanyalah menyampaikan (amanat Allah) dengan terang.” Maksudnya, menyampaikan apa yang diutuskan untuk kalian secara jelas dan gamblang sehingga hujjah telah tegak untuk kalian. Rasul tidak berkuasa memberikan petunjuk pada kalian dan sama sekali tidak berkuasa menghisab amal kalian. Perhitungan amal kalian atas ketaatan kalian terhadap Allah dan RasulNya, apakah kalian menunaikan hal itu atau tidak, sepenuhnya dilakukan oleh Allah Yang Mengetahui yang ghaib dan yang nyata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 12: Ketahuilah bahwa semua musibah yang menimpa seorang hamba dari sebagian musibah-musibah pada badan, anak, harta, bencana, gempa bumi dan setiap yang terjadi segala keadaannya adalah atas izin Allah, Allah tahu, Allah memiliki melakukan sesuai keinginan-Nya; Maka barangsiapa yang beriman kepada Allah dan mengetahui atas apa yang menimpa tidaklah menimpa kecuali dengan kuasa Allah, yang dengannya Allah berikan petunjuk pada hatinya, atau Allah berikan ketenangan dan kesabaran pada hatinya serta ridha dengan takdir Allah. Kemudian Allah menjelaskan bahwa Allah Maha Mengetahui atas segala sesuatunya, atau Dia mengetahui orang yang beriman dan yang bermaksiat, yang tidak rela dan yang tenang, dan mengetahui musibah yang ditimpakan, apakah musibah tersebut akibat dari dosa yang manusia lakukan atau dengan sebab lain ? Di sini Allah mengokohkan mereka yang beriman dan keimanan tersebut menenmpati hati-hati mereka karena sebab takdir Allah dan kuasa-Nya, maka mereka akan mengucapkan : إِنَّا لِلَّهِ وَإِنَّآ إِلَيْهِ رَ‌ٰجِعُونَ {Al Baqarah : 156} dan mereka akan berkata : حَسْبُنَا ٱللَّهُ وَنِعْمَ ٱلْوَكِيلُ {Ali Imran : 173}. Adapun selain orang-orang yang beriman mereka akan kebingungan, menangis, atau menjerit-jerit, dan mungkin juga menampar-nampar dirinya sendiri dan merobek-robek pakaiannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan melaksanakan perintah keduanya dan menjauhi larangannya, karena taat kepada Allah dan Rasul-Nya merupakan pusat kebahagiaan dan tanda keberuntungan. Dari taat kepada Allah dan Rasul-Nya. Yakni menyampaikan apa yang diembannya dengan jelas sehingga hujjah tegak, dia tidak bisa menjadikan kamu mendapatkan hidayah taufiq selain hidayah irsyad (menerangkan yang hak dan yang batil sejelas-jelasnya) dan dia bukan yang menghisabmu, bahkan yang menghisabmu adalah Allah Subhaanahu wa Ta'aala yang mengetahui yang gaib dan yang nyata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 12",
    "description": "Allah mengajarkan kepada manusia cara yang benar dan tepat dalam hidup ini. Dan taatlah wahai manusia kepada Allah dengan beriman dan melaksanakan perintah-Nya serta menjauhi larangan-Nya; dan taatlah kepada rasul dengan mengikuti sunah-sunahnya. Jika kamu berpaling dari Allah dengan kufur atau mengabaikan perintah-Nya dan berpaling dari rasul dengan melupakan sunahnya, maka sesungguhnya kewajiban rasul kami hanyalah menyampaikan ajaran Allah kepada umat manusia dengan terang sehingga manusia mengenal ajaran Allah dengan benar. 13. Yaitu ajaran bahwa sesungguhnya dialah Allah, tidak ada tuhan selain dia yang menciptakan makhluk dan mengaturnya. Dan hendaklah orang-orang mukmin bertawakal kepada Allah dalam segala keadaan."
  }
]