[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13. Hanya Allah semata, tidak ada tuhan yang berhak disembah kecuali Allah. hanya kepada Allah semata hendaknya orang-orang yang beriman kepada keesaaNya menyerahkan segala urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah adalah Żat yang berhak disembah, tiada sesembahan lain yang berhak disembah selain-Nya, dan kepada Allah sajalah hendaknya orang-orang yang beriman bersandar di dalam setiap urusan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Hanya Allah Tuhan yang berhak disembah, dan hendaklah orang-orang beriman hanya bertawakkal kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dialah Allah, Tiada Tuhan selain Dia, tiada yang patut disembah selain Dia, maka bertauhidlah kepadaNya, dan hanya kepadaNyalah orang-orang yang beriman itu berserah diri dan menyerahkan semua urusan-urusannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah. Tidak ada tuhan selain Dia. Kepada Allahlah hendaknya orang-orang mukmin itu bertawakal} bergantung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “(Dia-lah) Allah,” Yang “tidak ada tuhan yang berhak disembah melainkan Dia.” Maksudnya, Dia-lah yang berhak disembah dan dituhankan. Semua sesembahan selainNya adalah batil. “Dan hendaklah orang-orang yang Mukmin bertawakal kepada Allah saja.” Maksudnya, hendaklah orang-orang yang beriman bergantung pada Allah dalam segala hal yang menimpa mereka dan apa pun yang ingin mereka lakukan, karena tidak ada satu pun hal yang berlaku kecuali atas izin Allah dan tidak ada cara untuk itu kecuali dengan bergantung pada Allah. Ketergantungan seseorang terhadap Allah tidak berlaku secara sempurna sehingga ia memperbaiki sangkaannya terhadap Rabbnya serta percaya sepenuh hati bahwa Allah-lah yang akan mencukupi urusan yang disandarkan padaNya. Ukuran lemah dan kuatnya tawakal seorang hamba ditentukan oleh kadar keimanannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 13: Ketahuilah bahwa tidak ada sesembahan selain Allah, Allah yang tunggal, yang berhak untuk diibadahi, dan wajib bagi kalian agar menjalankan perintah-perintah-Nya wahai orang-orang yang beriman kepada-Nya dan hanya menyembah-Nya saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, segala sesuatu yang diibadahi selain-Nya adalah batil. Yakni hendaknya mereka bersandar kepada-Nya dalam semua masalah yang menimpa mereka dan dalam hal yang ingin mereka kerjakan, karena tidak ada satu urusan pun yang mudah kecuali dengan pertolongan Allah dan seseorang tidaklah sempurna bersandar kepada Allah sampai dia berhusnuzhzhan (bersangka baik) kepada Allah, percaya bahwa Dia akan mencukupinya, dan tingkat tawakkal seseorang sesuai dengan keimanan seorang hamba, setiap kali imannya menguat, maka semakin kuat pula tawakkalnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 13",
    "description": "Yaitu ajaran bahwa sesungguhnya dialah Allah, tidak ada tuhan selain dia yang menciptakan makhluk dan mengaturnya. Dan hendaklah orang-orang mukmin bertawakal kepada Allah dalam segala keadaan. 14. Setelah diperintahkan untuk bertawakal kepada Allah, pada ayat ini orang-orang beriman diperingatkan tentang istri dan anak-anak mereka. Wahai orang-orang yang beriman! hendaknya kamu waspada. Sesungguhnya di antara istri-istrimu dan anak-anakmu ada yang menjadi musuh bagimu dunia-akhirat. Kadang-kadang istri dapat menjerumuskan suami dan anak-anak dapat mencelakakan bapaknya untuk melakukan perbuatan yang tidak dibenarkan oleh agama. Maka berhati-hatilah kamu terhadap mereka dengan mengawasi dan menanamkan pendidikan agama kepada mereka; dan jika kamu memaafkan mereka ketika mereka melakukan kesalahan; dan kamu menyantuni mereka dengan sikap yang lembut, serta memohonkan ampun kepada Allah untuk mereka, maka sungguh, Allah maha pengampun kepada hamba-hamba-Nya, maha penyayang kepada seluruh makhluk-Nya."
  }
]