[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14. Wahai orang-orang yang beriman kepada Allah dan RasulNya, sesungguhnya diantara para istri dan anak-anak kalian ada yang menjadi musuh bagi kalian yang menghalang-halangi kalian dari jalan Allah, dan menggembosi kalian dari ketaatan kepada Allah. Waspadailah mereka, jangan menuruti mereka. Bila kalian berpaling dari keburukan-keburukan mereka dan memaafkannya serta menutupinya, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang. Allah mengampuni dosa-dosa kalian karena Allah adalah Pemilik ampunan yang besar dan rahmat yang luas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan untuk mereka, sesungguhnya di antara istri-istri dan anak-anak kalian ada yang menjadi musuh bagi kalian, karena mereka melalaikan kalian dari zikir kepada Allah dan berjuang di jalan-Nya dan melemahkan tekad kalian. Maka berhati-hatilah dari pengaruh mereka terhadap kalian. Jika kalian memaafkan kesalahan-kesalahan mereka, berpaling dari kesalahan mereka dan menutupinya, maka sesungguhnya Allah mengampuni dosa-dosa kalian dan merahmati kalian. Dan balasan itu sesuai dengan jenis perbuatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Hai orang-orang beriman, sebagian istri dan pasangan kalian adalah musuh bagi kalian, karena mereka menyibukkan kalian dari ketaatan kepada Allah dan amal kebaikan akibat kecintaan kalian kepada mereka yang begitu besar; maka janganlah kalian menuruti mereka dalam hal itu. Dan jika kalian memaafkan kesalahan mereka dengan tidak menghukum dan mengolok mereka, dan tidak mengungkit kesalahan itu; maka Allah Maha Besar ampunan dan rahmat-Nya bagi hamba-hamba-Nya yang bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. عَدُوًّا لَّكُمْ(menjadi musuh bagimu) Yakni mereka dapat menyibukkan kalian dari amal kebaikan. Sebab turunnya ayat ini adalah sekelompok orang yang ada di Makkah masuk Islam dan ingin berhijrah, namun istri dan anak mereka tidak membiarkan mereka pergi. Mujahid mengatakan tentang ayat ini: Demi Allah, istri dan anak-anak mereka tidak memusuhi mereka di dunia, namun rasa cinta kepada mereka menjadikan mereka melakukan hal haram dan memberikannya kepada mereka. فَاحْذَرُوهُمْ ۚ( maka berhati-hatilah kamu terhadap mereka) Yakni berhati-hatilah kalian dari istri dan anak kalian agar kecintaan kalian kepada mereka tidak mempengaruhi ketaatan kalian kepada Allah. Dan janganlah kasih sayang kalian kepada mereka menjadikan kalian mencari rezeki dengan kemaksiatan kepada Allah. وَإِن تَعْفُوا۟ وَتَصْفَحُوا۟ وَتَغْفِرُوا۟( dan jika kamu memaafkan dan tidak memarahi serta mengampuni (mereka)) Yakni memaafkan dosa yang telah mereka lakukan, dan tidak menghina mereka karena dosa itu, serta menutupi dosa tersebut. فَإِنَّ اللَّـهَ غَفُورٌ رَّحِيمٌ(maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang) Yakni pengampun dan penyayang kepada kalian dan mereka. Dikatakan bahwa jika seseorang yang dihalangi istri dan anaknya untuk berhijrah kemudian melihat orang lain mendahuluinya dalam berhijrah dan mempelajari agama maka ia berkeinginan untuk menyiksa anak dan istrinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Wahai orang-orang mukmin, sesungguhnya sebagian di antara istri-istri kalian ada yang menjadi musuh bagi kalian. Mereka menyibukkan kalian dari ketaatan kepada Allah dan amal kebaikan dengan memanfaatkan cinta kalian kepadanya. Maka berhati-hatilah kalian dalam menyetujui hal tersebut dengan mereka. Jika kalian memaafkan kesalahan dengan tidak memberi hukuman dan memaafkan mereka dengan tidak mencela mereka dan menutupi kesalahan mereka, maka sesungguhnya Allah itu Maha Pengampun dan Maha Pengasih. Dia akan memperlakukanmu sesuai apa yang kamu lakukan kepada istrimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, sesungguhnya di antara istri-istri dan anak-anak kalian ada yang menjadi musuh bagi kalian} musuh bagi kalian, mereka menghalangi kalian dari jalan Allah, dan menghalangi kalian dari ketaatan kepadaNya {Maka berhati-hatilah terhadap mereka. Jika kalian memaafkan} membiarkan kesalahan mereka {menyantuni} mengabaikan kesalahan itu {dan mengampuni} menutupi kesalahan itu atas mereka {sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14- 15. Ini adalah peringatan dari Allah untuk orang-orang yang beriman agar tidak terpedaya oleh istri dan anak, karena sebagian dari mereka itu adalah musuh. Dan musuh itu (hakikatnya) adalah orang yang menghendaki kejelekan bagi kalian. Tugas kalian adalah bersikap waspada dari orang yang sifatnya seperti ini. Jiwa diciptakan dengan tabiat mencintai istri dan anak. Karena itu Allah memberikan nasihat untuk para hambaNya agar membatasi rasa cintanya yang tunduk pada kemauan istri dan anak itu, karena di dalamnya terdapat larangan syari. Allah juga mendorong para hambaNya agar menunaikan perintah-perintahNya dan agar lebih mengedepankan ridhaNya, karena Allah memiliki pahala yang besar yang mencakup berbagai cita-cita tinggi dan kecintaan-kecintaan yang mahal. Allah juga mendorong agar para hamba-hambaNya lebih mengutamakan akhirat daripada dunia yang fana dan akan lenyap ini. Mengingat larangan untuk menuruti kemauan istri dan anak yang bisa membawa dampak buruk dan peringatan dari hal itu mungkin disalahpahami sebagian orang yang memahami harus bersikap kasar terhadap istri dan anak dan menghukum mereka, Allah memerintahkan mereka agar waspada serta memaafkan mereka, karena dalam hal ini terdapat berbagai maslahat yang tidak terhitung jumlahnya. Allah berfirman, “Dan jika kamu memaafkan dan tidak memarahi serta mengampuni (mereka), maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Karena balasan itu berdasarkan amal. Siapa yang tidak marah, maka Allah tidak akan memurkainya. Siapa pun yang menunaikan amalan-amalan yang disukai Allah dan menunaikan amalan-amalan yang disukai oleh sesama serta berguna bagi mereka, maka akan mendapatkan cinta Allah dan cinta hamba-hambaNya. Dan Allah akan menata rapi masalah-masalah hidupnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 14: Ini adalah seruan dari Allah kepada hambanya yang beriman, Allah kabarkan mereka dari istri-istri dan anak-anak, sebagian dari mereka ada yang menjadi musuh bagi mereka, mereka menyibukkan dari ketaatan kepada Allah dan dari banyaknya urusan yang baik, maka berhati-hatilah untuk mentaati mereka dan menjawab keinginan mereka, dan sungguh mereka akan diampuni dari dosa-dosa mereka, dan Allah tidak akan mengadzab mereka dan Allah akan menyembunyikan dosa-dosa mereka, maka itu semua lebih baik bagi kalian. Maka jika kalian melakukan demikian maka ketahuilah bahwa Allah Maha Luas ampunan-Nya dan kasih sayang-Nya bagi seluruh hamba."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tirmidzi berkata: Telah menceritakan kepada kami Muhammad bin Yahya, telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Israil, telah menceritakan kepada kami Simak bin Harb dari Ikrimah dari Ibnu Abbas, bahwa ia ditanya oleh seseorang tentang ayat ini, “Wahai orang-orang yang beriman! sesungguhnya di antara istri-istrimu dan anak-anakmu ada yang menjadi musuh bagimu, maka berhati-hatilah kamu terhadap mereka.” Ia berkata, “Mereka ini adalah laki-laki yang masuk Islam dari penduduk Mekah. Mereka ingin mendatangi Nabi shallallahu 'alaihi wa sallam, tetapi istri dan anak-anak mereka menolak ditinggalkan oleh mereka karena hendak datang kepada Rasulullah shallallahu 'alaihi wa sallam. Ketika mereka telah datang kepada Rasulullah shallallahu 'alaihi wa sallam, mereka melihat orang-orang telah paham agama, maka mereka hendak menghukum (keluarga) mereka, maka Allah menurunkan ayat, “Wahai orang-orang yang beriman! Sesungguhnya di antara istri-istrimu dan anak-anakmu ada yang menjadi musuh bagimu, maka berhati-hatilah kamu terhadap mereka…dst.” (Tirmidzi mengatakan bahwa hadits tersebut hasan shahih. Syaikh Muqbil, “Hadits tersebut juga diriwayatkan oleh Ibnu Jarir juz 28 hal. 124, Hakim juz 2 hal. 490, ia berkata, “Shahih isnadnya, namun keduanya (Bukhari dan Muslim) tidak meriwayatkan.” Adz Dzahabi mendiamkan pernyataan Hakim, dan diriwayatkan pula oleh Ibnu Abi Hatim sebagaimana dalam Tafsir Ibnu Katsir juz 4 hal. 376. Hadits ini berpusat pada Simak dari Ikrimah, sedangkan riwayat Simak dari Ikrimah adalah mudhtharib (guncang), sehingga hadits tersebut dha’if.”) Ayat ini merupakan peringatan dari Allah kepada kaum mukmin agar tidak terlalaikan oleh istri dan anak, karena sebagiannya ada yang menjadi musuh bagi mereka, yakni yang menghalangi mereka dari kebaikan. Oleh karena itu, sikap yang harus mereka lakukan adalah berwaspada, tetap melakukan perintah Allah, mengutamakan keridhaan-Nya karena di sisi-Nya ada pahala yang besar dan mengutamakan akhirat daripada dunia yang fana. Maksudnya, terkadang istri atau anak dapat menjerumuskan suami atau ayahnya untuk melakukan perbuatan-perbuatan yang tidak dibenarkan agama atau menghalanginya dari mengerjakan kebaikan seperti berjihad dan berhijrah. Oleh karena larangan menaati istri dan anak jika di sana terdapat bahaya terhadap seorang hamba memberikan kesan agar bersikap keras kepada mereka, maka Allah Subhaanahu wa Ta'aala menghilangkan kesan ini dan memerintahkan mereka untuk memaafkan, tidak memarahi dan mengampuni mereka. Hal itu, karena sikap tersebut (memberi maaf) terdapat banyak maslahat. Hal itu, karena balasan disesuaikan dengan jenis amalan. Barang siapa yang memaafkan, maka Allah akan memaafkannya, barang siapa yang mengampuni maka Allah akan mengampuninya, dan barang siapa yang bermu’amalah dengan Allah dengan amal yang dicintai-Nya, maka Allah akan mencintainya, demikian pula barang siapa yang bermu’amalah dengan manusia dengan amal yang dicintai mereka niscaya manusia mencintainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 14",
    "description": "Setelah diperintahkan untuk bertawakal kepada Allah, pada ayat ini orang-orang beriman diperingatkan tentang istri dan anak-anak mereka. Wahai orang-orang yang beriman! hendaknya kamu waspada. Sesungguhnya di antara istri-istrimu dan anak-anakmu ada yang menjadi musuh bagimu dunia-akhirat. Kadang-kadang istri dapat menjerumuskan suami dan anak-anak dapat mencelakakan bapaknya untuk melakukan perbuatan yang tidak dibenarkan oleh agama. Maka berhati-hatilah kamu terhadap mereka dengan mengawasi dan menanamkan pendidikan agama kepada mereka; dan jika kamu memaafkan mereka ketika mereka melakukan kesalahan; dan kamu menyantuni mereka dengan sikap yang lembut, serta memohonkan ampun kepada Allah untuk mereka, maka sungguh, Allah maha pengampun kepada hamba-hamba-Nya, maha penyayang kepada seluruh makhluk-Nya. 15. Manusia harus menyadari dengan penuh keinsafan peringatan Allah pada ayat ini. Sesungguhnya harta kamu yang sangat kamu cintai dan anak-anak kamu yang menjadi kebanggaan kamu hanyalah cobaan bagimu, apakah kamu mengelolanya dengan baik dan benar, serta mendidik mereka dengan agama yang lurus; dan di sisi Allah pahala yang besar bagi orang-orang beriman yang mengelola harta dengan baik dan mendidik anak-anak dengan benar."
  }
]