[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15. Tidakla Harta dan anak-anak kalian kecuali hanyalah ujian bagi kalian, dan di sisi Allah dan pahala besar bagi siapa yang mengedepankan ketaatan kepada Allah atas ketaatan kepada selain Allah, dan menunaikan hak Allah dalam hartanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya harta dan anak-anak kalian hanyalah cobaan dan ujian bagi kalian. Terkadang mereka membawa kalian kepada mencari harta yang haram dan meninggalkan ketaatan kepada Allah, dan di sisi Allah terdapat pahala yang besar bagi orang yang mendahulukan ketaatan kepada-Nya daripada ketaatan kepada anak-anaknya dan kesibukan dengan harta. Dan pahala yang agung tersebut adalah Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Sesungguhnya harta dan anak-anak adalah ujian bagi kalian, karena mereka dapat melalaikan kalian dari ketaatan kepada Allah. Dan di sisi Allah terdapat pahala yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِنَّمَآ أَمْوٰلُكُمْ وَأَوْلٰدُكُمْ فِتْنَةٌ ۚ (Sesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu)) Yakni merupakan ujian dan cobaan yang akan mendorong kalian untuk mencari nafkah dengan cara yang haram dan enggan untuk menunaikan kewajiban dari Allah. وَاللَّـهُ عِندَهُۥٓ أَجْرٌ عَظِيمٌ (dan di sisi Allah-lah pahala yang besar) Yakni bagi orang yang mengutamakan ketaatan kepada Allah dan meninggalkan kemaksiatan daripada kecintaannya kepada harta dan anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya harta dan anak-anak kalian adalah musibah dan cobaan bagi kalian. Kecintaanmu terhadap semua itu menyibukkanmu dari ketaatan dan terkadang semua itu membawamu untuk mengusahakan sesuatu yang haram dan mencegahmu (untuk memberikan) hak-hak Allah seperti zakat. Dan di sisi Allah itu ada pahala yang agung bagi orang yang melebihkan kecintaannya kepada Allah dan ketaatan kepadaNya di atas kecintaannya kepada anak-anak dan harta benda."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya harta dan anak-anak kalian hanyalah cobaan} cobaan bagi kalian {Dan di sisi Allahlah pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14- 15. Ini adalah peringatan dari Allah untuk orang-orang yang beriman agar tidak terpedaya oleh istri dan anak, karena sebagian dari mereka itu adalah musuh. Dan musuh itu (hakikatnya) adalah orang yang menghendaki kejelekan bagi kalian. Tugas kalian adalah bersikap waspada dari orang yang sifatnya seperti ini. Jiwa diciptakan dengan tabiat mencintai istri dan anak. Karena itu Allah memberikan nasihat untuk para hambaNya agar membatasi rasa cintanya yang tunduk pada kemauan istri dan anak itu, karena di dalamnya terdapat larangan syari. Allah juga mendorong para hambaNya agar menunaikan perintah-perintahNya dan agar lebih mengedepankan ridhaNya, karena Allah memiliki pahala yang besar yang mencakup berbagai cita-cita tinggi dan kecintaan-kecintaan yang mahal. Allah juga mendorong agar para hamba-hambaNya lebih mengutamakan akhirat daripada dunia yang fana dan akan lenyap ini. Mengingat larangan untuk menuruti kemauan istri dan anak yang bisa membawa dampak buruk dan peringatan dari hal itu mungkin disalahpahami sebagian orang yang memahami harus bersikap kasar terhadap istri dan anak dan menghukum mereka, Allah memerintahkan mereka agar waspada serta memaafkan mereka, karena dalam hal ini terdapat berbagai maslahat yang tidak terhitung jumlahnya. Allah berfirman, “Dan jika kamu memaafkan dan tidak memarahi serta mengampuni (mereka), maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Karena balasan itu berdasarkan amal. Siapa yang tidak marah, maka Allah tidak akan memurkainya. Siapa pun yang menunaikan amalan-amalan yang disukai Allah dan menunaikan amalan-amalan yang disukai oleh sesama serta berguna bagi mereka, maka akan mendapatkan cinta Allah dan cinta hamba-hambaNya. Dan Allah akan menata rapi masalah-masalah hidupnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 15: Ketahuilah wahai orang-orang yang beriman bahwa harta-harta kalian dan anak-anak kalian ada cobaan dan ujian; Maka mungkin akan menjatuhkan kalian kepada dosa dari arah yang kalian tidak sangka, sebagaimana telah datang dalam hadits : Sesungguhnya anak dapat membuat pelit dan penakut, mabkhalah yaitu ia dapat menjadikan bakhil (pelit) dari sedekah dan selainnya, takut anaknya akan kelaparan, majbanah yaitu menjadikan manusia penakut dari jihad, takut meninggalkan anak. Dan sungguh di sisi Allah lah pahala yang besar, bagi siapa yang mendahulukan ketaatan kepada Rasul di atas ketaatan kepada selainnya, karena tidak ada ketaatan kepada makhluk dalam bermaksiat kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang melalaikan kamu dari akhirat. Oleh karena itu, janganlah kamu luputkan pahalamu karena disibukkan oleh harta dan anak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 15",
    "description": "Manusia harus menyadari dengan penuh keinsafan peringatan Allah pada ayat ini. Sesungguhnya harta kamu yang sangat kamu cintai dan anak-anak kamu yang menjadi kebanggaan kamu hanyalah cobaan bagimu, apakah kamu mengelolanya dengan baik dan benar, serta mendidik mereka dengan agama yang lurus; dan di sisi Allah pahala yang besar bagi orang-orang beriman yang mengelola harta dengan baik dan mendidik anak-anak dengan benar. 16. Dalam menjalani hidup dan kehidupan ini, Allah memberikan bimbingan. Maka bertakwalah kamu kepada Allah menurut kesanggupanmu, karena Allah tidak membebani manusia kecuali sesuai dengan kesanggupannya; dan dengarlah ayat-ayat Allah, serta taatlah kepada-Nya; dan infakkanlah harta kamu yang baik, yaitu yang diperoleh dengan cara yang halal kepada fakir miskin, karena infak itu hakikatnya untuk diri kamu bekal di akhirat. Dan barang siapa dijaga dirinya dari kekikiran dengan membiasakan diri sejak kecil menjadi dermawan; mereka itulah orang-orang yang beruntung karena baik dan benar dalam mengelola harta yang dititipkan Allah kepada mereka."
  }
]