[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16. Kerahkanlah (wahai orang-orang yang beriman) usaha dan upaya kalian dalam bertakwa kepada Allah, dengarkanlah Rasulullah dengan perenungan dan tafakur. Taatilah perintahnya dan jauhilah larangannya. Infakkanlah sebagian dari apa yang Allah rizkikan kepada kalian, niscaya itu lebih baik bagi kalian. Barangsiapa selamat dari kekikiran dan kebakhilan terhadap apa yang lebih dari kebutuhannya, maka mereka adalah orang-orang yang beruntung meraih semua kebaikan dan segala apa yang diharapkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Maka bertakwalah kepada Allah dengan menjalankan segala perintah-Nya semampu kalian untuk menuju ketaatan kepada Allah dan menjauhi segala larangan-Nya. Dengarkanlah, taatilah Allah dan Rasul-Nya, dan belanjakan harta kalian yang telah diberikan oleh Allah kepada kalian pada berbagai jalan kebaikan. Barangsiapa dijaga oleh Allah dari kekikiran dirinya maka mereka itulah orang-orang yang menang dengan mendapatkan apa yang mereka cari dan selamat dari apa yang mereka takuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Maha bertakwalah kepada Allah dengan mentaati perintah-Nya dan menjauhi larangan-Nya sekuat tenaga, tanpa memaksakan diri di luar kemampuan; dan dengarkanlah pelajaran dan perintah yan ditujukan kepada kalian. Taatilah Allah dan rasul-Nya, dan sedekahkanlah sebagian harta kalian untuk kebaikan, karena itu lebih baik bagi kalian. Dan barangsiapa yang selamat dari sifat kikir dan serakah maka orang-orang yang memiliki derajat yang tinggi ini adalah orang-orang yang meraih kemenangan dunia dan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. فَاتَّقُوا۟ اللَّـهَ مَا اسْتَطَعْتُمْ (Maka bertakwalah kamu kepada Allah menurut kesanggupanmu) Yakni apa yang kalian mampu dan sesuai kemampuan kalian. وَاسْمَعُوا۟ وَأَطِيعُوا۟( dan dengarlah serta taatlah) Yakni dengar dan taatilah perintah Allah dan Rasulullah. وَأَنفِقُوا۟ خَيْرًا لِّأَنفُسِكُمْ ۗ( dan nafkahkanlah nafkah yang baik untuk dirimu) Yakni infakkanlah di jalan kebaikan harta yang diberikan Allah kepada kalian, dan janganlah kalian kikir, dan lakukanlah kebaikan demi kemaslahatan kalian. وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لٰٓئِكَ هُمُ الْمُفْلِحُونَ(Dan barangsiapa yang dipelihara dari kekikiran dirinya, maka mereka itulah orang-orang yang beruntung) Yakni barangsiapa yang dijauhkan Allah dari penyakit kikir sehingga mereka mau berinfak di jalan Allah dan kebaikan, maka mereka adalah orang-orang yang berhasil meraih kebaikan dan tujuan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Bertakwalah kepada Allah dengan menunaikan perintahNya dan menjauhi laranganNya sesuai kesungguhan dan kapasitas kalian, dengarkan dan taatilah apa yang diperintahkan untuk kalian dan nafkahkanlah harta benda kalian di jalan kebaikan. Hal itu lebih baik bagi diri kalian. Barangsiapa menjaga diri dari kekikiran dan kerakusan, mereka semua itu adalah orang yang akan memperoleh kebaikan dunia dan akhirat. Ibnu Abu Hatim dari Sa’id bin Jabir berkata: “Ketika ayat {Ittaqullaha haqqa tuqaatih} [QS Ali Imran 3/102] diturunkan, kaum muslimin meningkatkan amal ibadahnya. Mereka melaksanakan ibadah sampai lutut mereka membengkak dan jidat mereka luka-luka, lalu Allah menurunkan ayat ini untuk meringankan beban kaum muslimin, yaitu ayat {Fattaquu mastatha’tum}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bertakwalah kamu kepada Allah sekuat kemampuan kalian} sesuai kemampuan dan kekuatan kalian {Dengarkanlah, taatlah, dan infakkanlah harta yang baik untuk diri kalian. Siapa saja yang dijaga} dijaga dan dijauhkan dari {dari kekikiran dirinya} kekikiran dirinya yang sangat menginginkan hal itu {mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Allah memerintahkan para hambaNya agar bertakwa padaNya, yaitu dengan menunaikan perintah-perintahNya dan menjauhi larangan-laranganNya. Allah membatasi hal itu dengan kadar kemampuan dan kesanggupan. Ayat ini menunjukkan bahwa kewajiban yang tidak mampu dilakukan oleh seorang hamba menjadi gugur. Jika seorang hamba mampu menunaikan kewajiban lainnya, maka ia cukup menunaikan kewajiban yang mampu dia lakukan, sedangkan kewajiban lainnya yang tidak mampu dilakukan menjadi gugur. Kaidah syariah ini mencakup cabang-cabang masalah yang tidak terhitung jumlahnya. Allah berfirman, “Dan dengarlah,” maksudnya dengarkan nasihat Allah dan syariat yang diberlakukan pada kalian berupa hukum-hukum. Lakukan dan taatlah padaNya, “serta taatlah” pada Allah dan RasulNya pada semua gerak-gerik kalian, “dan nafkahkanlah” berupa nafkah-nafkah syari yang wajib dan yang sunnah, niscaya amal baik kalian itu berguna bagi kalian di dunia dan akhirat, karena seluruh kebaikan itu terletak pada menunaikan semua perintah Allah, menerima nasihat-nasihatNya dan tunduk pada syariatNya, dan (sebaliknya) seluruh keburukan itu terletak pada pembangkangan perintah Allah. Namun ada bencana yang menahan orang untuk menunaikan nafkah yang diperintahkan, yaitu sifat kikir yang banyak terdapat dalam watak manusia. Sifat ini membuat orang mencintai harta dan amat tidak menyukai untuk dikeluarkan dari tangannya. Untuk itu, siapa pun yang dijaga Allah “dari kekikiran dirinya,” dengan mengizinkan dirinya untuk memberikan nafkah yang bermanfaat baginya, “maka mereka itulah orang-orang yang beruntung.” Karena mereka mendapatkan apa yang diinginkan dan selamat dari yang ditakutkan. Lebih dari itu, sepertinya ini mencakup seluruh yang diperintahkan dan yang dilarang. Jika jiwa seseorang bersifat kikir dan tidak tunduk pada perintah Allah, serta tidak mau mengeluarkan hartanya, maka ia tidak akan beruntung tapi akan mendapatkan kerugian di dunia dan di akhirat. Dan jika jiwanya lapang dan tenang terhadap syariat Allah karena ingin mencari keridhaanNya, maka tidak terdapat penghalang antara jiwanya dan perintah yang dibebankan Allah selain pengetahuannya akan perintah tersebut bahwa hal itu mendatangkan ridha Allah. Dengan demikian, ia akan mendapatkan keberuntungan, keberhasilan, dan benar-benar akan mendapatkan kemenangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 16: Allah memerintahkan hambanya yang beriman untuk bertakwa kepada Allah, dan itu semua dengan mengerjakan perintah-Nya dan menjauhi larangan-Nya, dengan niat ketaatan dan jihad, kemudian Allah memerintahkan mereka untuk mendengar dan taat kepada Allah pada segala urusan mereka, dan Allah memerintahkan untuk berinfak dari harta Allah yang Allah berikan nafkah yang syar’i, wajib dan yang dicintai kepada mereka; Karena sesungguhnya infak di jalan Allah lebih baik bagi mereka di dunia dan di akhirat. Ketahuilah bahwa barangsiapa yang Allah lindungi dari kebakhilan atas dirinya dan kebaikan dari sifat bakhil dan menjaga harta dengan berlebihan; Maka mereka itulah orang-orang yang beruntung, menang dengan kemenagan yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan untuk bertakwa kepada-Nya sesuai dengan kemampuan. Ayat ini menunjukkan bahwa setiap kewajiban yang seorang hamba tidak dapat melakukannya, maka kewajiban itu gugur darinya, dan bahwa jika seseorang mampu melakukan sebagian perintah dan tidak bisa melakukan sebagian lagi, maka yang bisa ia lakukan dilakukannya dan yang tidak bisa maka gugur darinya sebagaimana sabda Nabi shallallahu 'alaihi wa sallam, “Apabila aku memerintahkan suatu perintah, maka lakukanlah sesuai kesanggupanmu.” Yakni dengarlah nasihat Allah kepadamu serta hukum-hukum syang disyariatkan-Nya. Ketahuilah hal itu dan ikutlah. Kepada Allah dan Rasul-Nya dalam semua urusanmu. Baik infak yang wajib maupun yang sunat, tentu hal itu lebih baik bagimu di dunia dan akhirat, karena kebaikan terletak dalam mengikuti perintah Allah, menerima nasihatnya dan tunduk kepada syariat-Nya, sedangkan keburukan terletak pada selain itu. Namun di sana ada penyakit yang menghalangi kebanyakan manusia dari berinfak, yaitu sifat kikir yang manusia diciptakan di atasnya, maka dalam lanjutan ayat ini Allah Subhaanahu wa Ta'aala menerangkan, bahwa barang siapa yang dijaga dari kekirikan dirinya, mereka itulah orang-orang yang beruntung. Mereka akan mendapatkan apa yang mereka inginkan dan selamat dari hal yang tidak mereka inginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 16",
    "description": "Dalam menjalani hidup dan kehidupan ini, Allah memberikan bimbingan. Maka bertakwalah kamu kepada Allah menurut kesanggupanmu, karena Allah tidak membebani manusia kecuali sesuai dengan kesanggupannya; dan dengarlah ayat-ayat Allah, serta taatlah kepada-Nya; dan infakkanlah harta kamu yang baik, yaitu yang diperoleh dengan cara yang halal kepada fakir miskin, karena infak itu hakikatnya untuk diri kamu bekal di akhirat. Dan barang siapa dijaga dirinya dari kekikiran dengan membiasakan diri sejak kecil menjadi dermawan; mereka itulah orang-orang yang beruntung karena baik dan benar dalam mengelola harta yang dititipkan Allah kepada mereka. 17. Orang yang berinfak atau bersedekah itu beruntung karena pada hakikatnya dia meminjamkan hartanya kepada Allah. Allah berfirman, 'jika kamu meminjamkan harta kamu kepada Allah dengan pinjaman yang baik, yakni berinfak dengan harta halal dengan ikhlas, niscaya dia melipatgandakan balasan infak tersebut untuk kamu di dunia dan akhirat; dan mengampuni dosa dan kesalahan kamu. Dan Allah maha menerima syukur hamba-hamba-Nya yang beriman, maha penyantun kepada hamba-hamba-Nya yang menyantuni makhluk-makhluk Allah. '."
  }
]