[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17. Jika kalian menginfakkan harta kalian di jalan Allah dengan ikhlas dan jiwa yang rela, niscaya Allah melipatgandakan pahalanya bagi kalian dan mengampuni dosa-dosa kalian. Allah Maha berterima kasih kepada orang-orang yang berinfak dengan memberi mereka balasan yang baik, Maha Penyantun sehingga tidak menyegerakan hukuman atas siapa yang mendurhakaiNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Jika kalian memberi pinjaman kepada Allah dengan pinjaman yang baik dengan cara membelanjakan harta-harta kalian di jalan-Nya maka pahalanya dilipat gandakan untuk kalian. Allah menjadikan kebaikan mendapat balasan sepuluh kali lipat sampai tujuh ratus kali lipat, hingga berlipat banyak dan memaafkan dosa-dosa kalian. Allah Maha Pembalas jasa, memberi balasan atas perbuatan sedikit dengan pahala yang banyak, Dia Mahalembut, tidak menyegerakan siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Jika kalian bersedekah di jalan Allah dengan ikhlas, maka Allah akan melipatgandakan pahala kalian berkali-kali lipat, dan mengampuni dosa-dosa kalian. Allah Maha Bersyukur kepada orang-orang baik dan Maha Lembut kepada orang-orang yang berbuat dosa dengan tidak segera memberi hukuman; Dia Maha Mengetahui segala yang tersembunyi dan yang terlihat, Maha Perkasa dalam kerajaan-Nya, dan Maha Bijaksana dalam mengatur segala urusan makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. إِن تُقْرِضُوا۟ اللَّـهَ قَرْضًا حَسَنًا (Jika kamu meminjamkan kepada Allah pinjaman yang baik) Maka pergunakanlah harta kalian untuk kebaikan dengan niat yang tulus ikhlas. يُضٰعِفْهُ لَكُمْ (niscaya Allah melipat gandakan balasannya kepadamu) Dengan melipatgandakan satu kebaikan menjadi sepuluh sampai tujuh ratus kali lipat. وَيَغْفِرْ لَكُمْ ۚ (dan mengampuni kamu) Yakni disamping Allah melipatgandakan pahala, Dia juga akan mengampuni dosa-dosa kalian. وَاللَّـهُ شَكُورٌ حَلِيمٌ (Dan Allah Maha Pembalas Jasa lagi Maha Penyantun) Dengan memberi pahala bagi orang yang mentaati-Nya dengan pahala yang berlipat-lipat, dan tidak segera menyiksa orang yang bermaksiat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Jika kalian menafkahkan (harta kalian) pada kebaikan yang diridhai oleh Allah dengan infak yang baik dari diri kalian, maka pahala kalian akan banyak dilipat gandakan dan dosa-dosa kalian akan ditutupi (diampuni). Allah adalah Maha Bersyukur yang memberikan pahala yang agung atas ketaatan, memberikan sesuatu yang banyak bagi orang yang mengerjakan sedikit amal dan tidak mempercepat hukuman bagi orang yang melakukan maksiat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian meminjamkan kepada Allah pinjaman yang baik} Kalian berinfak di jalan Allah dengan infak yang ikhlas dan baik bagi jiwa {niscaya Dia akan melipat gandakan untuk kalian dan mengampuni kalian. Allah Maha Mensyukuri lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Selanjutnya Allah memberi dorongan untuk berinfak seraya berfirman, “Jika kamu meminjamkan kepada Allah pinjaman yang baik.” Pinjaman yang baik adalah semua nafkah yang berasal dari harta halal yang diberikan oleh seseorang karena mengharap bertemu dengan Allah dan mengalokasikannya pada tempatnya, “niscaya Allah melipatgandakan (pembalasannya) kepadamu,” pahala nafkah adalah sepuluh kali lipat hingga tujuh ratus kali dan bahkan sampai berlipat-lipat lagi. “dan” di samping dilipatgandakan, Dia “mengampuni kamu.” Maksudnya, Allah memberi ampunan dosa bagi kalian karena infak dan sedekah. Allah menghapus kesalahan dan dosa dengan sedekah dan kebaikan-kebaikan. Sesungguhnya kebaikan-kebaikan itu bisa menghapus kesalahan-kesalahan. “Dan Allah Maha Pembalas jasa lagi Maha Pengampun.” Tidak langsung memberi hukuman bagi orang yang durhaka kepadaNya, tapi diberi tangguhan, namun tidak dilalaikan. “Dan kalau sekiranya Allah menyiksa manusia disebabkan usahanya, niscaya Dia tidak akan meninggalkan di atas permukaan bumi suatu mahluk yang melatapun akan tetapi Allah menangguhkan (penyiksaan) mereka, sampai waktu yang tertentu”–fathir:45- Allah Maha Membalas kebaikan, menerima amalan kecil hamba-hambaNya namun diberi balasan yang besar. Allah memberi balasan baik bagi hambaNya yang rela menanggung beban berat dan berbagai taklif (beban syariat) yang berat karenaNya. Barangsiapa yang meninggalkan sesuatu karena Allah, niscaya akan diberi ganti yang lebih baik oleh Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 17: Allah menganjurkan bagi hambanya untuk memberikan nafkah, Allah mengabarkan bahwa siapa yang Allah lindungi dari kebakhilan dan kebaikan dari sifat bakhil, ia adalah yang termasuk menginfakkan hartanya di jalan Allah dengan ikhlas dan baiknya diri. Maka barangsiapa yang mengamalkan hal itu maka ia akan mendapatkan ganjaran yang berlipat, dan Allah ampunkan dosa-dosanya, dan Allah Yang Maha Berterima Kasih atas hamba-Nya yang ikhlas, Allah adalah Maha Pemurah yang tidak tergesa-gesa menyegerakan hukuman; Bahkan Allah ampuni dan mungkin Allah perbaiki dan memasukkan mereka dalam rahmat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mendorong mereka untuk berinfak. Yaitu dengan menyedekahkan harta dengan hati yang puas dan rela dari harta yang halal dengan maksud mencari keridhaan Allah. Dari sepuluh menjadi tujuh ratus, bahkan bisa lebih. Karena sebab infak dan sedekah, karena dosa dapat terhapus dengan sedelah dan amal saleh lainnya sebagaimana firman Allah Ta’ala, “Dan dirikanlah shalat itu pada kedua tepi siang (pagi dan petang) dan pada bagian permulaan dari malam. Sesungguhnya perbuatan-perbuatan yang baik itu menghapuskan (dosa) perbuatan-perbuatan yang buruk. Itulah peringatan bagi orang-orang yang ingat.” (Terj. Huud: 114) Allah Subhaanahu wa Ta'aala Maha Mensyukuri, Dia menerima amal yang sedikit dari hamba-hamba-Nya dan memberinya balasan yang banyak. Dia bersyukur kepada orang yang rela berkorban karena-Nya dan siap memikul beban-beban berat, oleh karenanya barang siapa yang meninggalkan sesuatu karena Allah, maka Allah akan menggantinya dengan yang lebih baik. Dia tidak segera menyiksa orang-orang yang durhaka kepada-Nya, bahkan memberinya tangguh dan kesempatan untuk bertobat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 17",
    "description": "Orang yang berinfak atau bersedekah itu beruntung karena pada hakikatnya dia meminjamkan hartanya kepada Allah. Allah berfirman, 'jika kamu meminjamkan harta kamu kepada Allah dengan pinjaman yang baik, yakni berinfak dengan harta halal dengan ikhlas, niscaya dia melipatgandakan balasan infak tersebut untuk kamu di dunia dan akhirat; dan mengampuni dosa dan kesalahan kamu. Dan Allah maha menerima syukur hamba-hamba-Nya yang beriman, maha penyantun kepada hamba-hamba-Nya yang menyantuni makhluk-makhluk Allah. '18. Yang mengetahui yang gaib yang tak terlihat mata manusia dan yang nyata yang terlihat mata manusia. Yang mahaperkasa karena kekuasaan-Nya tak terbatas, mahabijaksana, karena kelembutan dan kasih sayang-Nya kepada hamba-hamba-Nya."
  }
]