[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18. Allah Maha Mengetahui segala apa yang ghaib dan apa yang hadir. Mahaperkasa yang tidak terkalahkan, Mahabijaksana dalam perkataaan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Allah -Subḥānahu- Maha Mengetahui yang gaib dan Maha Mengetahui yang tampak, tidak ada sesuatu pun dari hal itu yang luput dari-Nya, Maha Perkasa yang tidak ada seorang pun yang mampu mengalahkan-Nya dan Maha Bijaksana dalam penciptaan-Nya, syariat-Nya dan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Allah SWT mengetahui semua hal yang ghaib dari makhlukNya, Dia Maha Melihat semua itu, Dia Maha melihat sesuatu yang ghaib dan yang nampak. Dia Maha Hebat dan Maha Menaklukkan, yang memiliki hikmah dalam ciptaanNya dan pengaturanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang mengetahui semua yang ghaib dan yang nyata. Dzat Yang Maha perkasa lagi Maha bijaksana}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Yang Mengetahui yang ghaib dan yang nyata.” Maksudnya, tidak ada satu pun rahasia manusia yang tidak nampak bagi Allah. Tidak ada yang mengetahuinya kecuali Allah dan juga segala makhluk yang mereka saksikan. “Yang Mahaperkasa,” yang tidak terkalahkan dan tidak tertahan, Yang Maha Memaksa segala sesuatu, “lagi Mahabijaksana,” pada makhluk dan perintahNya, Yang melatakkan segala sesuatu pada tempatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 18: Allah tutup surat ini dengan kabar bahwa Dia yang mengetahui ghaib dari hamba-Nya, dan yang hamba-Nya saksikan. Dia adalah Yang Maha Kuat dan yang menaklukkan, yang Maha Kuasa atas setiap sesuatu, Maha Bijaksana dalam penciptaan dan perintah, yang Dia meletakkan segala sesuatunya pada tempatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia tidak bisa dikalahkan, bahkan Dia mengalahkan dan menundukkan segala sesuatu. Dalam ciptaan dan perintah-Nya, Dia meletakkan segala sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 18",
    "description": "Yang mengetahui yang gaib yang tak terlihat mata manusia dan yang nyata yang terlihat mata manusia. Yang mahaperkasa karena kekuasaan-Nya tak terbatas, mahabijaksana, karena kelembutan dan kasih sayang-Nya kepada hamba-hamba-Nya. 1. Pada akhir surah at-tag'bun, Allah memberitahukan bahwa istri dan anak bisa jadi musuh; dan Allah memerintahkan agar bersikap baik dan pemaaf kepada mereka. Pada ayat ini diterangkan bahwa di antara suami istri bisa terjadi perceraian, namun Allah mengingatkan nabi tentang hukum dan etika perceraian dalam islam. Wahai nabi! apabila kamu menceraikan istri-istrimu, perbuatan halal, tetapi paling tidak disukai Allah, maka hendaklah kamu ceraikan mereka atau salah seorang di antara mereka pada waktu mereka dapat menghadapi idahnya dengan tidak memberatkan, yaitu ketika masa suci dari haid agar tidak lama menunggu untuk bisa menikah lagi dengan laki-laki lain. Dan hitunglah waktu idah itu dengan cermat kapan mulainya dan kapan berakhir; serta bertakwalah, kamu semua, kepada Allah tuhanmu dalam segala urusan. Janganlah kamu keluarkan mereka, istri yang dijatuhi talak itu selama masa idah, dari rumah yang ditempati-Nya dan janganlah mereka diizinkan keluar secara bebas kecuali jika mereka mengerjakan perbuatan keji yang jelas seperti berzina. Itulah hukum-hukum Allah yang harus dilaksanakan manusia. Dan barang siapa melanggar hukum-hukum Allah secara sengaja atau karena lalai, maka sungguh dia telah berbuat zalim terhadap dirinya sendiri, karena merugikan dirinya, sedangkan ia tetap harus mempertanggungjawabkannya di hadapan Allah. Kamu tidak mengetahui, wahai nabi, rencana Allah bagi kamu, barangkali setelah itu, yakni setelah kamu menjatuhkan talak kepada istrimu, Allah mengadakan sesuatu yang baru, yakni memberikan istri yang lebih baik."
  }
]