[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2. Allah yang menciptakan kalian dari ketiadaan, lalu sebagian dari kalian mengingkari ketuhanan-Nya, dan sebagian dari kalian membenarkanNya serta mengamalkan syariatNya. Allah Maha Melihat amal-amal kalian, tidak ada sesuatu pun darinya yang samar bagiNya, dan Dia akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia lah yang menciptakan kalian -wahai manusia-, lalu di antara kalian ada yang kafir terhadap-Nya, lalu tempat kembalinya adalah Neraka, dan di antara kalian ada yang beriman kepada-Nya, lalu tempat kembalinya adalah Surga. Dan Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sedikitpun dari perbuatan kalian yang luput dari-Nya, dan Dia akan membalas kalian atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Hai manusia, Allah-lah yang menciptakan kalian; akan tetapi sebagian dari kalian mengingkari hal itu, dan sebagian lain mengimaninya dan mengakui keesaan-Nya. Allah Maha Melihat segala kebaikan atau keburukan yang kalian perbuat, tidak ada yang tersembunyi dari-Nya. Allah menciptakan tujuh langit dan bumi dengan penuh hikmah dan tujuan yang jelas; dan menciptakan kalian dalam bentuk yang terbaik. Kepada-Nya tempat kembali pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. هُوَ الَّذِى خَلَقَكُمْ فَمِنكُمْ كَافِرٌ وَمِنكُم مُّؤْمِنٌ ۚ (Dialah yang menciptakan kamu maka di antara kamu ada yang kafir dan di antaramu ada yang mukmin) Yakni Allah menciptakan orang kafir, namun kekafirannya adalah perbuatan yang dilakukannya; dan menciptakan orang beriman dan keimanannya adalah perpuatan yang dia lakukan. Maka orang kafir menjadi kafir karena pilihannya, begitu pula orang beriman menjadi beriman karena pilihannya, dan keduanya atas izin Allah; dan kalian tidak dapat menghendaki (menempuh suatu jalan) kecuali jika dikehendaki Allah Tuhan semesta Alam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Dialah Allah dan hanya Dialah yang menciptakan kalian wahai manusia. Di antara kalian ada orang kafir yang mengingkariNya dan ada juga yang membenarkanNya. Allah adalah Dzat yang Maha Melihat lagi Maha Mengetahui semua amal perbuatan kalian. Tidak ada satupun yang tersembunyi dariNya dan Dia akan membalas kalian sesuai perbuatan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menciptakan kalian, lalu di antara kalian ada yang kafir dan ada yang mukmin. Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah menyebutkan bahwa Dia menciptakan manusia. Di antara mereka ada yang dijadikan sebagai orang Mukmin dan kafir. Keimanan dan kekafiran mereka seluruhnya berdasarkan Qadha dan Qadar Allah. Dia-lah yang menghendaki hal itu dari mereka dengan memberikan kemampuan dan kemauan yang memungkinkan mereka melakukan apa pun yang mereka kehendaki, berupa perintah dan larangan. “Dan Allah Maha Melihat apa yang kamu kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 2: Allah menjelaskan bahwa Dialah yang menjadikan kalian dan memberikan kepada kalian kemampuan untuk beramal, dan menjadikan padamu kemampuan untuk memilih; Dan di antara kalian ada yang memili kafir, dan tidak mensyukuri nikmat Allah yang diberikan, dan menolak untuk taat dan ibadah kepada-Nya. Dan juga di antara kalian ada yang memilih beriman; Bersyukur atas nikmat Allah yang diberikan, dan beramal dengan apa yang diperintahkan dan juga munjauhi larangan-Nya dan Allah yang memiliki karunia; Dimana kalian mampu untuk memilih keduanya; Setiap manusia berhak memilih apa yang dia inginkan. Kemudian Allah menjelaskan bahwa nampak amalan-amalan kalian yang iman dan kufur, dan Allah akan menjaga setiap hak dari hamba-Nya, dan akan dibalas sesuai dengan amalannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 2",
    "description": "Dialah yang menciptakan kamu dalam bentuk yang sebaik-baiknya, lalu di antara kamu ada yang kafir, karena mengikuti hawa nafsu; dan di antara kamu juga ada yang mukmin, karena Allah memberikan petunjuk dan manusia menggunakan akal dan nuraninya. Dan Allah maha melihat apa yang kamu kerjakan sehingga tidak satu pun perbuatan manusia yang tidak diketahui-Nya. 3. Dia menciptakan langit tujuh lapis dan menciptakan bumi tujuh lapis dengan tujuan yang benar sehingga tidak sia-sia, dia membentuk rupamu dengan tujuan yang baik untuk kemaslahatan kamu, lalu memperbagus rupamu supaya kamu bersyukur dan kepada-Nya tempat kembali dengan dikumpulkan di mahsyar."
  }
]