[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Allah menciptakan langit dan bumi dengan hikmah mendalam, dan Allah menciptakan kalian dam bentuk terbaik. Hanya kepada Allah tempat kembali kalian pada Hari KIamat, dan Dia akan membalas setiap orang sesuai dengan amalnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dia menciptakan langit dan bumi dengan (tujuan) benar, Dia tidak menciptakannya dengan sia-sia, dan Dia membentuk rupa kalian -wahai manusia- dan memperbagusnya sebagai pemberian dan karunia dari-Nya. Kalau Dia menghendaki, Dia menjadikan rupa kalian buruk. Dan hanya kepada-Nya tempat kembali pada hari Kiamat, lalu Dia membalas kalian atas perbuatan kalian. Jika baik maka dibalas dengan kebaikan, jika buruk maka dibalas dengan keburukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ۖ (Dia menciptakan langit dan bumi dengan haq. Dia membentuk rupamu dan dibaguskan-Nya rupamu itu) Yakni Allah telah menciptakan mereka dalam bentuk yang paling sempurna dan rupa yang paling indah –dan keindahan penciptaan manusia tidak diragukan lagi—dan ini adalah bukti yang jelas bagi orang-orang yang berakal atas kekuasaan, kebijaksanaan, dan kebesaran Sang Pencipta. Begitu pula penciptaan jiwa manusia dan kemampuan akalnya yang besar merupakan bukti yang lebih besar dari hal tersebut. Sebagaimana Allah berfirman: وفي الأرض آيات للموقنين وفي أنفسكم أفلا تبصرون Dan di bumi itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang yakin. dan (juga) pada dirimu sendiri. Maka apakah kamu tidak memperhatikan? (Az-Zariyat: 20-21)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dialah Dzat yang menciptakan langit dan bumi dengan tujuan yang tepat dan mengandung hikmah yang besar. Maknanya adalah ciptaan yang dihubungkan dengan kebenaran dan hikmah, bukan hiburan dan permainan. Dia juga menjadikan bentuk kalian wahai anak cucu Adam dengan sebaik-baik bentuk, yaitu dengan menyusun dan mengatur pembentukannya sehingga tidak ada satupun perumpamaan yang menyerupainya dalam bentuk, pandangan dan akal, dan hanya kepadaNyalah tempat kembali pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakan langit dan bumi dengan benar, Dia membentuk kalian lalu memperindah bentuk kalian, dan kepadaNyalah kembali} kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Setelah menyebutkan penciptaan manusia yang diperintah dan dilarang, selanjutnya Allah menyebutkan makhluk-makhluk lain seraya berfirman, “Dia menciptakan langit dan bumi,” maksudnya, menciptakan bentuk keduanya serta seluruh yang terdapat pada keduanya secara baik, “dengan (tujuan) yang benar,” maksudnya, dengan hikmah dan tujuan yang dimaksudkan oleh Allah. “Dia membentuk rupamu dan dibaguskannya rupamu itu,” dan ini semakna dengan Firman Allah, “sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya.” -At-Tin: 4- manusia adalah makhluk dengan bentuk yang paling baik dan pemandangan yang paling indah. “Dan hanya kepadaNya-lah kembali (mu).” Maksudnya, tempat kembali pada Hari Kiamat. Allah akan memberi balasan atas keimanan dan kekufuran kalian dan meminta pertanggung jawaban atas nikmat yang diberikan pada kalian, apakah kalian mensyukurinya atau tidak?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 3: Allah menjelaskan bahwa Dia yang menciptakan langit dan bumi dengan hikmah Allah yang jelas, yang mengandung kebaikan manusia di dunia dan di akhirat, dan sebagai petunjuk atas kekuasaan-Nya. Kemudian Allah mengulangi sebagai penegasan untuk kali yang lain bahwa Dia yang menciptakan kalian dengan bentuk yang terbaik, Allah jadikan sebaik-baik bentuk bagi kalian. Kemudian Allah mengabarkan bahwa tempat kembali kalian hanya kepada Allah saja, untuk diberikan balasan atas amalan-amalan kalian. Jika amalan kalian baik, maka baik pula balasannya. Jika amalan kalian buruk, maka buruk pula balasannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menyebutkan penciptaan-Nya kepada manusia yang mendapat beban perintah dan larangan, Dia menyebutkan penciptaan makhluk-makhluk yang lain. Dan semua yang ada di sana. Yakni dengan hikmah (tepat) dan tujuan yang diinginkan Allah Subhaanahu wa Ta'aala. Oleh karena itu, manusia adalah makhluk yang paling baik rupanya dan paling indah dipandang. Pada hari Kiamat, lalu Dia membalas keimanan dan kekafiranmu dan menanyakan kepadamu tentang berbagai nikmat yang diberikan-Nya kepada kamu, apakah kamu mensyukurinya atau tidak?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 3",
    "description": "Dia menciptakan langit tujuh lapis dan menciptakan bumi tujuh lapis dengan tujuan yang benar sehingga tidak sia-sia, dia membentuk rupamu dengan tujuan yang baik untuk kemaslahatan kamu, lalu memperbagus rupamu supaya kamu bersyukur dan kepada-Nya tempat kembali dengan dikumpulkan di mahsyar. 4. Manusia, menurut ayat ini, harus menyadari bahwa dia mengetahui apa yang di langit dengan pengetahuan yang menyeluruh; dan mengetahui segala yang ada di bumi, termasuk benda paling kecil yang tak terlihat mata dan mengetahui apa yang kamu rahasiakan di dalam hati dan mengetahui apa yang kamu nyatakan secara lisan. Dan Allah maha mengetahui segala isi hati yang tersembunyi."
  }
]