[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Apakah belum datang kepada kalian (wahai orang-orang musyrik) kabar orang-orang kafir dari kalangan umat-umat terdahulu sebelum kalian, di mana mereka ditimpa keburukan sebagai akibat kekafiran mereka dan kejahatan perbuatan mereka, dan di akhirat mereka mendapatkan azab yang menyakitkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Belum datangkah kepada kalian -wahai orang-orang musyrik- kabar tentang umat-umat yang mendustakan sebelum kalian, seperti kaum nabi Nuh, ‘Ād, Ṡamūd dan lainnya? Mereka merasakan siksaan akibat kekafiran yang mereka lakukan di dunia, dan di Akhirat mereka mendapatkan siksa yang menyakitkan. Tentu, kabar itu telah sampai kepada kalian, maka ambillah pelajaran dari apa yang terjadi pada mereka dan bertobatlah kepada Allah sebelum kalian tertimpa apa yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Allah mengingkari dan mengolok orang-orang musyrik: “Bukankah telah sampai kepada kalian kisah orang-orang kafir terdahulu yang mendapat siksaan akibat kekafiran mereka, dan kelak mereka akan mendapat azab yang pedih di neraka? Siksaan yang berat di dunia dan di akhirat itu akibat keingkaran mereka terhadap para Rasul yang datang kepada mereka dengan membawa berbagai mukjizat yang menakjubkan dan ayat yang jelas, akan tetapi mereka berkata, ‘Apakah manusia seperti kami dapat memberi petunjuk menuju kebenaran?’ Sehingga mereka mendustakan para rasul dan enggan mengikuti kebenaran. Namun Allah tidak membutuhkan ibadah mereka, Allah Maha Kaya, tidak membutuhkan makhluk-Nya, dan Maha Terpuji dalam setiap keadaan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. أَلَمْ يَأْتِكُمْ نَبَؤُا۟ الَّذِينَ كَفَرُوا۟ مِن قَبْلُ (Apakah belum datang kepadamu (hai orang-orang kafir) berita orang-orang kafir terdahulu) Mereka adalah umat-umat terdahulu yang kafir, seperti umat nabi Nuh, kaum ‘Aad, dan Tsamud. Allah memfirmankan: telah datang kepadamu berita tentang mereka dalam al-Qur’an bagaimana rasul-rasul mereka menyeru mereka kepada keesaan Allah dan penyembahan kepada-Nya serta meninggalkan segala sesembahan selain-Nya, dan bagaimana kebinasaan orang-orang yang mendustakan, serta bagaimana kesudahan para rasul dan orang-orang beriman yang berakhir pada keselamatan mereka. فَذَاقُوا۟ وَبَالَ أَمْرِهِمْ (Maka mereka telah merasakan akibat yang buruk dari perbuatan mereka) Makna (الوبال) yakni kesusahan, yaitu azab dunia yang menimpa mereka. وَلَهُمْ عَذَابٌ أَلِيمٌ (dan mereka memperoleh azab yang pedih) Yaitu azab neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Wahai orang kafir! Apakah kalian tidak mendapatkan kabar (Istifham sebagai bentuk keterkejutan atas perilaku mereka) tentang orang-orang kafir terdahulu, seperti kaum Nuh, kaum ‘Aad, dan kaum Tsamud. Mereka di dunia merasakan hukuman atas kekufuran mereka. Al-Wabal adalah beban berat yang dihasilkan oleh perbuatan mereka. Perbuatan mereka yaitu kekufuran mereka. Bagi mereka siksa yang pedih di akhirat, yaitu azab neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah belum sampai kepada kalian berita orang-orang yang ingkar dahulu. Mereka telah merasakan akibat buruk dari perbuatan mereka} akibat buruk dari kekufuran mereka {dan bagi mereka azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Setelah Allah menyebutkan sifat-sifatNya yang sempurna dan agung, yang dengan sifat-sifat tersebut Allah bisa diketahui dan disembah, segala usaha dicurahkan demi mencari ridhaNya dan menjauhi murkaNya, selanjutnya Allah menyebutkan apa yang Dia lakukan terhadap umat-umat terdahulu dan masa-masa yang telah berlalu. Di mana orang-orang yang datang kemudian senantiasa membicarakan mereka dan mengisahkan tentang orang-orang shalih. Ketika para rasul mendatangi mereka dengan kebenaran, mereka mendustakan para rasul itu dan menentang. Kemudian Allah menimpakan akibat buruk perbuatan mereka di dunia dan juga kehinaan. “Dan mereka memperoleh azab yang pedih” di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 5: Kemudian Allah mencela mereka orang-orang musyrik, Allah berkata kepada mereka : Bukankah telah sampai kepada kalian wahai orang-orang musyrik kabar atas mereka yang kufur kepada Allah dan Rasul-Nya dari umat-umat yang telah lalu, dimana mereka menjadikan kekufuran atas kondisi mereka dan dosa, maka bagaimana kondisi buruk mereka dibalas dengan adzab akibat kekufuran mereka dan buruknya perbuatan-perbuatan mereka di dunia, dan mereka di akhirat terdapat adzab keras yang menunggu mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan sifat-sifat-Nya yang sempurna dan agung, dimana dengan sifat-sifat itu Dia dikenal, diibadahi, dikerahkan pengorbanan untuk mencari keridhaan-Nya serta dihindari hal-hal yang mendatangkan kemurkaan-Nya, maka Dia memberitahukan apa yang dilakukan-Nya terhadap umat-umat terdahulu dimana berita-berita mereka selalu dibicarakan oleh orang-orang yang datang kemudian, dan bahwa ketika para rasul datang kepada mereka dengan membawa kebenaran, namun mereka mendustakannya dan menentangnya, maka Allah Subhaanahu wa Ta'aala menimpakan kepada mereka akibat dari perbuatan mereka di dunia dan menghinakan mereka di sana, dan bagi mereka di akhirat ada azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 5",
    "description": "Ayat ini mengingatkan orang-orang kafir tentang nasib para pendahulu mereka yang harus dijadikan cermin. Allah berfirman, 'apakah belum sampai kepadamu, wahai orang-orang kafir, berita orang-orang kafir dahulu seperti umat nabi nuh, nabi lut, dan nabi musa' maka mereka telah merasakan akibat buruk dari perbuatannya dengan mendapat azab di dunia; dan mereka pun akan memperoleh azab yang pedih di akhirat. 6. Ayat ini menjelaskan alasan orang-orang kafir menolak kehadiran para rasul. Allah menyatakan bahwa yang demikian itu, yakni penolakan mereka terhadap para rasul, karena sesungguhnya ketika rasul-rasul datang kepada mereka dengan membawa keterangan-keterangan tentang ajaran Allah; lalu mereka berkata di hadapan para rasul itu dengan nada melecehkan, 'apakah pantas manusia yang memberi petunjuk kepada kami, bukan malaikat'' lalu mereka menolak ajaran para rasul dan berpaling dari kebenaran; padahal Allah tidak memerlukan keimanan mereka. Dan Allah mahakaya dari ketergantungan kepada makhluk, maha terpuji dalam sifat dan perbuatan-Nya."
  }
]