[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Apa yang menimpa mereka di dunia dan apa yang akan mereka dapatkan di akhirat, disebabkan karena pada saat mereka didatangi oleh para Rasul Allah dengan membawa keterangan-keterangan yang jelas dan mukjizat-mukjizat yang nyata, mereka berkata mengingkari, “Apakah orang seperti kami yang membimbing kami?” mereka kafir kepada Allah dan mengingkari risalah para utusanNYa, mereka berpaling dari kebenaran dan tidak menerimanya. Allah tidak membutuhkan iman dan ibadah mereka, karena Allah Mahakaya secara mutlak, Maha Terpuji dalam perkataan, perbuatan dan sifat-sifatNya, Allah tidak mempedulikan mereka, dan kesesatan mereka sama sekali tidak merugikanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Siksa yang menimpa mereka itu sesungguhnya menimpa mereka karena telah datang kepada mereka Rasul-Rasul mereka dari sisi Allah dengan hujah-hujah yang jelas dan bukti-bukti yang nyata, lalu mereka berkata dengan sombong tentang para Rasul yang berasal dari jenis mereka, “Apakah manusia yang akan menunjukkan kami kepada kebenaran?” Mereka berpaling dari keimanan terhadap para Rasul, dan itu tidak mendatangkan mudarat sedikitpun kepada Allah, dan Allah tidak butuh kepada keimanan dan ketaatan mereka, karena ketaatan mereka tidak menambah apapun kepada-Nya. Allah Mahakaya, tidak butuh terhadap hamba-hamba-Nya, Maha Terpuji dalam firman-firman-Nya dan perbuatan-perbuatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. ذٰلِكَ (Yang demikian itu) Yakni azab di dunia dan akhirat itu. بِأَنَّهُۥ كَانَت تَّأْتِيهِمْ رُسُلُهُم بِالْبَيِّنٰتِ(karena sesungguhnya telah datang kepada mereka Rasul-Rasul mereka membawa keterangan-keterangan) Yakni karena dahulu para rasul telah diutus kepada mereka dengan berbagai mukjizat yang jelas. فَقَالُوٓا۟ أَبَشَرٌ يَهْدُونَنَا(lalu mereka berkata: “Apakah manusia yang akan memberi petunjuk kepada kami?”) Yakni setiap kaum itu berkata kepada rasul mereka bahwa mereka mengingkari dan merasa heran rasul yang berasal dari jenis manusia. فَكَفَرُوا۟ وَتَوَلَّوا۟ ۚ( lalu mereka ingkar dan berpaling) Yakni ingkar terhadap para rasul dan apa yang mereka datangkan. Dan mereka berpaling serta tidak mau menghayati apa yang didatangkan para rasul tersebut kepada mereka. وَّاسْتَغْنَى اللَّـهُ ۚ( dan Allah tidak memerlukan (mereka)) Yakni Allah tidak butuh keimanan dan ibadah mereka. وَاللَّـهُ غَنِىٌّ حَمِيدٌ (Dan Allah Maha Kaya lagi Maha Terpuji) Yakni tidak membutuhkan alam semesta ini dan tidak pula butuh peribadatan mereka. Dan Allah terpuji oleh seluruh makhluk dengan lisan maupun keadaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Yang disebutkan itu adalah siksa dunia karena ketika para rasul dengan mukjizat dan dalil-dalilnya yang nyata datang kepada mereka agar beriman, mereka berkata: “Bagaimana bisa manusia memberikan petunjuk kepada kami?” Mereka mengingkari keberadaan para rasul sebagai manusia. Maka dari itu mereka mengingkari para rasul dan menolak keimanan. Allah tidak butuh keimanan dan ketaatan mereka. Atas segala kehendakNya, Allah dipuji oleh semua makhluk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu karena sesungguhnya telah datang kepada mereka rasul-rasul dengan keterangan-keterangan lalu mereka berkata,“Apakah manusia yang memberi petunjuk kepada kami” Lalu mereka ingkar dan berpaling} berpaling tidak mau beriman kepada para rasul padahal {Allah tidak memerlukan} keimanan dan ketaatan mereka {Allah Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Karena itu Allah menyebutkan sebab siksaan tersebut seraya berfirman, “Yang demikian itu,” yakni, siksaan dan akibat buruk yang Kami timpakan pada mereka “adalah karena sesungguhnya telah datang kepada mereka Rasul-rasul mereka (membawa) keterangan-keterangan,” yakni tanda-tanda kebesaran Allah yang jelas, yang menunjukkan kebenaran dan kebatilan, namun mereka bersikap sombong terhadap para rasul mereka seraya berkata, “Apakah manusia yang akan memberi petunjuk kepada kami,” maksudnya, mereka tidak memiliki keutamaan atas kami, lantas karena apa Allah memberikan keistimewaan pada mereka dan tidak memberikannya pada kami? Ini sejalan dengan Firman Allah dalam surat lain, “Rasul-rasul mereka berkata kepada mereka: \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya.” -Ibrahim:11- Mereka menahan karunia dan pemberian Allah untuk para nabi supaya mereka tidak menjadi utusan Allah kepada manusia. Mereka bersikap sombong untuk menaati para rasul. Mereka pun diuji dengan penyembahan patung, batu, dan lainnya. “Lalu merenka ingkar” terhadap Allah “dan berpaling” dari ketaatanNya, “dan Allah tidak memerlukan (mereka).” Allah tidak menghiraukan mereka, dan kesesatan mereka sama sekali tidak membahayakan Allah. “Dan Allah Mahakaya lagi Maha Terpuji.” Maksudnya, Dia-lah Yang Mahakaya, bagiNya kekayaan yang sempurna dan mutlak dari segala hal, Terpuji dalam perkataan, perbuatan, dan sifat-sifatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 6: Allah menjelaskan sebab kedustaan dan kecelakaan bagi mereka yang menghalalkannya; Allah mengabarkan bahwa telah datang kepada mereka para Rasul Allah dengan ayat-ayat yang jelas sebagai bukti dan mukjizat-mukjizat yang meyakinkan, akan tetapi mereka sombong, dan mereka berkata dengan nada mengingkari : Apakah masuk akal, yang memberikan petunjuk adalah manusia yang sama seperti kama ? atau mereka mengingkari Rasul dari golongan manusia. Ini adalah tipuan setan kepada mereka, dan jika Rasul bukan dari manusia, maka bagaimana bisa di ambil sebagai uswah atau qudwah (suri tauladan) ? Bagaimana Rasul dapat paham dan kami pun juga dapat paham ? Maka mereka telah kafir dengan utusan-utusan yang diutus kepada mereka dan mereka menolak dari kebenaran dengan penolakan yang sempurna dan mereka tidak akan menerima para Rasul selamanya. Allah mencukupkan ketaatan mereka dan ketaatan mereka. Kemudian Allah mengabarkan bahwa Allah Maha Kaya dari semua makhluk, dan Dia Yang Maha Terpuji dari perkataan, perbuatan dan sifat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni azab di dunia dan akhirat. Yakni ayat-ayat yang jelas yang menunjukkan mana yang benar dan mana yang batil, tetapi mereka membencinya dan menyombongkan diri. Maksud mereka, jika rasul itu manusia, maka tidak ada kelebihannya di atas kami dan karena sebab apa Allah Subhaanahu wa Ta'aala melebihkan mereka di atas kami? Pertanyaan ini telah dijawab Allah Subhaanahu wa Ta'aala dalam ayat yang lain, “Rasul-rasul mereka berkata kepada mereka, \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya. Dan tidak patut bagi Kami mendatangkan suatu bukti kepada kamu melainkan dengan izin Allah. dan hanya kepada Allah sajalah hendaknya orang-orang mukmin bertawakkal.” (Terj. Ibrahim: 11) Mereka yang menolak seruan rasul karena alasan demikian sesungguhnya sama saja hendak mencegah karunia Allah dan nikmat-Nya kepada para nabi-Nya berupa nikmat menjadi para rasul(utusan)-Nya kepada manusia, mereka telah sombong untuk tunduk kepada mereka (para rasul) sehingga mereka ditimpa musibah dengan menyembah batu, pohon, dsb. Dari taat kepada Allah. Dia tidak butuh kepada semua makhluk-Nya. Dalam perkataan-Nya, perbuatan-Nya dan sifat-sifat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 6",
    "description": "Ayat ini menjelaskan alasan orang-orang kafir menolak kehadiran para rasul. Allah menyatakan bahwa yang demikian itu, yakni penolakan mereka terhadap para rasul, karena sesungguhnya ketika rasul-rasul datang kepada mereka dengan membawa keterangan-keterangan tentang ajaran Allah; lalu mereka berkata di hadapan para rasul itu dengan nada melecehkan, 'apakah pantas manusia yang memberi petunjuk kepada kami, bukan malaikat'' lalu mereka menolak ajaran para rasul dan berpaling dari kebenaran; padahal Allah tidak memerlukan keimanan mereka. Dan Allah mahakaya dari ketergantungan kepada makhluk, maha terpuji dalam sifat dan perbuatan-Nya. 7. Orang-orang yang kafir menolak ajakan para rasul karena mengira, bahkan meyakini bahwa mereka tidak akan dibangkitkan setelah mereka mati. Katakanlah, wahai nabi Muhammad, kepada mereka, 'tidak demikian, yang sebenarnya. Demi tuhanku, yang mahabenar, kamu pasti akan dibangkitkan dari alam kubur, kemudian diberitakan dengan lengkap dan menyeluruh semua yang telah kamu kerjakan di dunia, baik kejahatan maupun kebaikan. ' dan yang demikian itu mudah bagi Allah, karena Allah berkuasa atas segala sesuatu."
  }
]