[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Ingatlah hari pengumpulan di mana Allah mengumpulkan orang-orang terdahulu dan orang-orang kemudian, itu adalah hari di mana kerugian dan perbedaan di antara manusia jelas terlihat. Orang-orang beriman mengalahkan orang-orang kafir dan orang-orang fasik, di mana orang-orang yang beriman masuk ke surga dengan rahmat Allah, sedangkan orang-orang yang kafir masuk neraka dengan keadilan Allah. Barangsiapa beriman kepada Allah dan taat kepadaNya, Allah menghapus dosa-dosanya, memasukannya ke daalam surga-surga yang mengalir sungai-sungai di bawah istana-istana dan kebun-kebunnya, mereka kekal di dalamnya selama-lamanya, kekekalan dalam surga itu adalah keberuntungan besar yang tidak ada lagi keberuntungan sesudahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Ingatlah -wahai Rasul- hari di mana Allah mengumpulkan kalian pada hari Kiamat guna memberi balasan kepada kalian atas perbuatan kalian. Hari itu adalah benar-benar hari yang menampakkan kerugian dan kekurangan orang-orang kafir, di mana orang-orang yang beriman menggantikan kapling penghuni Neraka di Surga, dan penghuni Neraka menggantikan kapling penghuni Surga di Neraka. Barangsiapa beriman kepada Allah dan mengerjakan amal saleh maka Allah menghapuskan kesalahan-kesalahannya darinya dan memasukkannya ke dalam Surga-Surga yang di bawah istana-istana dan pepohonannya mengalir sungai-sungai, mereka menetap kekal di dalamnya, tidak keluar darinya selamanya dan tidak pernah terputus kenikmatannya dari mereka. Yang mereka dapatkan itu adalah kemenangan besar yang tiada bandingnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Hai para hamba, Allah akan mengumpulkan kalian pada hari kiamat, itulah hari terlihatnya kerugian orang kafir karena telah mendustakan para rasul, dan kerugian orang beriman karena banyak menyia-nyaikan kesempatan dalam mentaati Allah. Dan barangsiapa yang beriman kepada Allah dan mengakui keesaan-Nya, dan menjalankan hukum-hukum-Nya maka Allah akan menghapus dosa-dosanya dan memasukkannya ke dalam surga-surga yang indah, di dalamnya terdapat sungai-sungai yang mengalir di bawah istana dan pepohonannya, mereka akan kekal di dalamnya. Kedudukan yang mulia ini merupakan kemenangan besar yang sesungguhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ۖ ((Ingatlah) hari (dimana) Allah mengumpulkan kamu pada hari pengumpulan) Yakni pada hari kiamat, sebab manusia akan dikumpulkan pada hari itu di padang mahsyar untuk mendapat balasan, serta katika itu manusia akan dikumpulkan dengan amalannya, nabi akan dikumpulkan dengan umatnya, orang zalim akan dikumpulkan dengan orang yang dizaliminya, dan orang yang terdahulu akan dikumpulkan dengan orang yang terkemudian. ذٰلِكَ يَوْمُ التَّغَابُنِ ۗ( itulah hari dinampakkan kesalahan-kesalahan) Yakni hari manusia saling menagih haknya, orang yang benar akan menagih hak terhadap orang yang batil, dan tidak ada kerugian yang lebih besar melebihi ketika calom penghuni surga menagih calon penghuni neraka, seakan-akan penghuni neraka mengganti kebaikan dengan keburukan dan kenikmatan dengan azab, sedangkan penghuni surga kebalikan dari itu. Kalimat (غبنت فلانا) jika kamu menjual atau membeli dari seseorang namun kerugian harus ditanggung oleh orang tersebut, itulah makna asal kata (الغبن). Sehingga orang yang merugi adalah orang yang kehilangan keluarga dan tempat tinggalnya di surga. وَمَن يُؤْمِنۢ بِاللَّـهِ وَيَعْمَلْ صٰلِحًا يُكَفِّرْ عَنْهُ سَيِّـَٔاتِهِۦ(Dan barangsiapa yang beriman kepada Allah dan beramal saleh, niscaya Allah akan menutupi kesalahan-kesalahannya) Yakni barangsiapa yang beriman dan melakukan amal shaleh maka ia berhak untuk dihapus kesalahan-kesalahannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Ingatlah wahai nabi dan setiap orang yang berbicara! Ingatlah terhadap hari di mana Allah mengumpulkan kalian pada hari kiamat, seluruh makhluk di dalamnya dari malaikat, manusia dan jin untuk dihisab dan dibalas. Itu adalah hari yang dipenuhi kelupaan dan kebingungan akibat teror yang sanat besar. Itu adalah hari penyesalan dan kesalahan dimana ditampakkan di dalamnya kesalahan orang kafir karena meninggalkan keimanan, dan kesalahan orang mukmin adalah karena sedikit melakukan kebaikan. Barangsiapa yang beriman kepada Allah dan hari kiamat dan mengerjakan amal shalih yaitu apa yang diperintahkan oleh Allah, Maka Allah akan menghapus dosa-dosanya, dan memasukkannya ke dalam surga-surga yang di dalamnya mengalir sungai-sungai di bawah rumah-rumah dan taman-tamannya. Mereka tinggal di dalalamnya selama-lamanya. Keberhasilan mencapai surga itu adalah keberhasilan yang tidak dapat disamai oleh keberhasilan apapun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari (ketika) Allah mengumpulkan kalian pada hari berhimpun} pada hari kiamat dimana orang-orang terdahulu dan akan datang dikumpulkan {Itulah hari pengungkapan kesalahan} hari dimana kesalahan dan penyimpangan di antara makhluk ditampakkan {Siapa saja yang beriman kepada Allah dan beramal shalih, niscaya Dia akan menghapus} menghapus {kesalahan-kesalahannya dan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Maksudnya, ingatlah hari di mana pada hari itu Allah akan mengumpulkan semua manusia dari yang pertama hingga yang terakhir. Allah memberhentikan mereka di tempat pemberhentian yang mengerikan dan agung. Allah akan memberitahukan apa pun yang mereka lakukan. Pada hari itu nampaklah perbedaan dan pengumpulan antara manusia. Ada yang diangkat ke tingkat tinggi di kamar-kamar atas dan tempat tinggal yang tinggi yang mencakup berbagai macam kenikmatan dan keinginan. Ada juga yang ditempatkan di tempat yang paling rendah. Tempat kesedihan, duka, dan siksaan yang dahsyat. Hal itu disebabkan oleh perbuatan-perbuatan yang mereka persembahkan untuk diri mereka sendiri selama hidup mereka. Karena itu Allah berfirman, “Inilah hari ditampakannya kesalahan-kesalahan,” maksudnya, pada hari itu nampak kesalahan-kesalahan dan perbedaan-perbedaan antara manusia. Hari itu orang-orang Mukmin yang fasik merugi dan orang-orang yang berdosa diketahui bahwa mereka bukan apa-apa dan mereka adalah orang-orang yang merugi. Seolah-olah dikatakan, “Dengan apa keberuntungan, kesengsaraan, nikmat dan azab bisa didapatkan?” Allah menyebutkan penyebab semua hal itu seraya berfirman, “Dan barangsiapa yang beriman kepada Allah,” dengan keimanan yang sempurna yang mencakup seluruh hal yang diperintahkan Allah agar diimani, “dan mengerjakan amal shalih,” berupa amalan-amalan wajib dan sunnah dengan menunaikan hak-hak Allah dan hak sesama manusia, “niscaya Allah akan menutupi kesalahan-kesalahannya dan memasukannya ke dalam surga yang mengalir di bawahnya sungai-sungai,” di dalamnya terdapat apa pun yang diinginkan jiwa, dipandang nikmat oleh mata, dipilih oleh ruh, diinginkan hati dan puncak segala yang diinginkan. “Mereka kekal di dalamnya selama-lamanya. Itulah keberuntungan yang besar.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Taghabun ayat 9: Dan ingatlah wahai manusia pada hari yang Allah kumpulkan makhluk yang pertama dan yang terakhir untuk dihisab dan dibalas dalam satu tempat; Ketahuilah bahwa itu adalah hari Taghabun yang nampak debu orang yang bermaksiat serta kerugian atas mereka dengan sebab meninggalkan keimanan; Maka barangsiapa yang hari itu datang dengan membenarkan Allah dan Rasul-Nya ﷺ serta kitab-Nya, dan beramal dengan amalan shalih; Maka sungguh Allah hapuskan keburukan yang ia lakukan di dunia, dan Allah akan masukkan ke dalam surga yang mengalir di bawah istana dan pepohonannya sungai-sungai, kekal selama-lamanya, tidak akan keluar darinya selamanya, dan itulah kemenangan yang tidak ada kemenangan seabadi itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu hari Kiamat. Pada hari itu, Allah Subhaanahu wa Ta'aala mengumpulkan orang-orang yang terdahulu dan yang datang kemudian, menempatkan mereka pada tempat yang menegangkan dan Dia memberitahukan kepada mereka amal yang mereka kerjakan, ketika itulah tampak perbedaan antara makhluk, dimana sebagian kaum ditempatkan ke tempat-tempat yang tinggi (surga) yang penuh kesenangan dan sebagian kaum ditempatkan ke tempat yang rendah (neraka) yang menjadi tempat kesedihan, kegundahan, kesengsaraan dan azab yang keras sebagai hasil dari apa yang mereka kerjakan untuk diri mereka. Ada pula yang menafsirkan bahwa dikatakan hari Kiamat dengan ‘taghaabun’ karena pada hari itu orang-orang mukmin mengalahkan orang-orang kafir dengan mengambil tempat tinggal dan calon istri mereka di surga yang sudah disiapkan jika mereka beriman. Seakan-akan ada pertanyaan, “Karena apa mereka memperoleh keberuntungan dan kenikmatan atau kesengsaraan dan azab?” Maka pada lanjutan ayat ini Allah Subhaanahu wa Ta'aala sebutkan sebabnya. Yang wajib maupun yang sunat, baik berupa memenuhi hak Allah maupun hak hamba-hamba-Nya. Di dalamnya terdapat apa yang disenangi jiwa, enak dipandang mata, disukai hati dan menjadi akhir cita-cita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taghabun Ayat 9",
    "description": "Ayat ini mengingatkan manusia tentang kepastian adanya hari akhirat. Ingatlah wahai manusia, pada hari ketika Allah mengumpulkan kamu, seluruh manusia pada hari berhimpun, yaitu pada hari akhir; itulah hari pengungkapan kesalahan-kesalahan yang selama hidup di dunia disembunyikan. Dan barang siapa beriman kepada Allah dengan iman yang mantap dan mengerjakan kebajikan, niscaya Allah akan menghapus kesalahan-kesalahannya dan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung. 10. Berbeda dengan orang-orang beriman dan beramal saleh yang akan diampuni dan dimasukkan ke dalam surga, Allah menegaskan tentang nasib orang-orang kafir. Dan orang-orang yang kafir, yaitu orang-orang yang menolak beriman kepada Allah dan rasul-Nya; dan mendustakan ayat-ayat kami, ayat-ayat Al-Qur'an; mereka itulah penghuni neraka, karena kekufuran mereka selama hidup di dunia; mereka kekal di dalamnya, karena Allah tidak akan mengampuni orang-orang kafir. Dan itulah seburuk-buruk tempat kembali, karena neraka itu tempat hukuman, bukan tempat kenikmatan."
  }
]