[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(alif lam mim shad). pembicaraan tentang huruf-huruf terpisah, sudah berlalu di awal surat al-baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Mīm Ṣād. Pemabahasan tentang huruf-huruf semacam ini telah disebutkan di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-baqarah telah disebutkan penjelasan tentang huruf muqatha'ah; dan hikmah penyebutannya adalah sebagai penjelas mukjizat al-Qur'an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الٓمٓصٓ (Alif laam mim shaad) Penjelasan tentang huruf-huruf ini telah disebutkan pada awal tafsir surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Surah ini adalah surah Makkiyah kecuali 8 ayat, yaitu firman Allah SWT: {Was’alhum ‘anil qaryah} sampai sebelum ayat {Wa idz nataqnal jabala fauqahum kaannahu zhillah} [163-170] 1. {Alif Lam Mim Shad} Kami membacanya seperti ini : Alif Lam Mim Shad. Kalimat ini seperti permulaan surah Al-Baqarah dan Ali Imran yang digunakan untuk menantang bangsa Arab agar mendatangkan sesuatu yang serupa dengan Al-Qur’an, meskipun itu terdiri dari huruf-huruf dalam bahasa Arab mereka, sedangkan mereka sangat baligh dan fashih dalam bahasa itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Mīm Ṣād"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah berfirman kepada RasulNya, menjelaskan tentang keagungan al-qur’an kepadanya “ini adalah sebuah kitab yang diturunkan kepadamu” yakni kitab mulia yang memuat segala sesuatu yang dibutuhkan oleh semua hamba, dan seluruh tuntunan-tuntunan ilahiyah, serta tujuan-tujuan syar’I yang akurat lagi teerperinci. Maka janganlah ada rasa di dadamu karenanya, ”kesempitan” yakni kesulitan, keraguan dan kebimbangan. Bahkan agar kamu mengetahui bahwa ia diturunkan dari Dzat yang Maha bijaksana lagi Maha terpuji. Tidak ada kebatilan yang dating dari hadapanNya dan tidak pula dari belakangNya. Oleh karena itu hendaknya dadamu menjadi lapang karenanya, jiwamu menjadi tenang dengannya, dan kamu mau menjelaskan perintah-perintah dan larangan-larangannya (kepada para hamba). Jangan takut kepada orang yang mencela dan menentang, ”supaya kamu memberi peringatan dengan kitab itu”, kepada seluruh manusia, kamu menasihati dan mengingatkan mereka, sehingga hujjah menjadi tegak atas orang-orang yang menetang “dan menjadi pelajaran bagi orang-orang yang beriman”. sebagiamana firman Allah” dan tetaplah memberi peringatan karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman” Dengan ayat itu mereka mengingat jalan yang lurus, amal-amal mereka yang lahir maupun yang batin, dan apa yang menjadi penghalang bagi hamba untuk menitinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 1",
    "description": "Alif laam miim, shaad. Huruf-huruf abjad pada permulaan surah ini mengisyaratkan kemukjizatan Al-Qur'an. Beberapa surah dalam alqur'an, memang, dibuka dengan huruf abjad seperti , aalif laam miim, alif laam raa, alif, laam, miim, shaat, dan sebagainya. Makna huruf-huruf itu hanya Allah yang tahu. Ada yang berpendapat bahwa huruf-huruf itu adalah nama surah dan ada pula yang berpendapat bahwa gunanya untuk menarik perhatian, atau untuk menunjukkan mukjizat Al-Qur'an, karena Al-Qur'an disusun dari rangkaian huruf-huruf abjad yang digunakan dalam bahasa bangsa arab sendiri. Meskipun demikian, mereka tidak pernah mampu untuk membuat rangkaian huruf-huruf itu menjadi seperti Al-Qur'an. Pada akhir surah yang lalu dijelaskan tentang turunnya Al-Qur'an, untuk apa ia diturunkan, perintah untuk mengikutinya, dan ancaman bagi orang yang mengabaikan tuntunannya. Surah ini diawali dengan menyebut kembali Al-Qur'an yang dibicarakan pada surah al-an'a'm itu dan keharusan mengikuti tuntunannya. Inilah kitab yang diturunkan melalui malaikat jibril kepadamu, wahai rasulullah, sebagai penghormatan untukmu, maka janganlah engkau sesak dada karenanya akibat takut terhadap orang kafir yang akan mendustakanmu. Tugasmu adalah menyampaikan Al-Qur'an agar engkau memberi peringatan dengan kitab itu kepada kaummu dan sekalian manusia akan akibat dari dosa yang mereka lakukan, dan menjadi pelajaran bagi orang yang beriman, karena merekalah yang paling siap memanfaatkan isi kandungannya. Al-qur'an mempunyai fungsi yang demikian agung, maka Allah memerin tahkan manusia untuk mengikuti ajarannya. Ayat ini juga ditujukan kepada para juru dakwah dan mubalig."
  }
]