[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah memberikan kekuasaan bagi kalian di muka bumi (wahai sekalian manusia). dan kami menjadikan bumi sebagai tempat tinggal bagi kalian dan kami menjadikan bagi kalian apa saja untuk kalian pergunakan sebagai bekal hidup di dalamnya, berupa berbagai jenis makanan dan minuman. Meskipun demikian rasa syrukur kalian terhadap nikmat-nikmat Allah amat sedikit."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan sungguh Kami telah menempatkan kalian -wahai anak-anak Adam- di bumi dan menyediakan banyak sarana untuk menunjang kehidupan kalian di sana. Maka kewajiban kalian ialah bersyukur kepada Allah atas karunia tersebut. Tetapi syukur kalian hanya sedikit."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Sungguh Kami telah siapkan bumi bagi kalian, agar kalian dapat membangun bangunan, bercocok tanam, dan mengambil manfaat darinya; dan Kami telah menyiapkan di sana makanan dan minuman agar kalian dapat hidup. Namun dengan berbagai kenikmatan ini, sedikit sekali orang yang mau bersyukur kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَلَقَدْ مَكَّنّٰكُمْ فِى الْأَرْضِ (Sesungguhnya Kami telah menempatkan kamu sekalian di muka bumi) Yakni Kami jadikan bagi kalian tempat di muka bumi dan Kami siapkan bagi kalian tempat-tempat mencari penghidupan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Wahai anak Adam, sungguh Kami telah menciptakan bagi kalian tempat tinggal di bumi, dan Kami sediakan bagi kalian di dalamnya berbagai sebab-sebab kehidupan berupa tempat tinggal, makanan, minuman dan pakaian, dan kalian sangat kurang mensyukuri nikmat tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menempatkan kalian} Kami memberi kalian kekuasaan dan kemampuan untuk mengatur {di bumi dan Kami menjadikan bagi kalian di sana penghidupan} sebab-sebab kehidupan kalian {sedikit sekali kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Allah menjelaskan nikmatNya kepada hamba-hambaNYa berupa tempat tinggal dan kehidupan. ”dan sungguh kami telah menempatkan kamu sekalian dimuka bumi” yakni kami menyiapkannya untukmu dimana kamu bisa membangun bangunan-bangunan diatasnya, menanam tanaman dan mengambil manfaat-manfaat. ”dan kami adakan bagimu dimuka bumi itu (sumber) penghidupan” dari hasil pohon-pohonan, tanaman, tambang bumi, dan berbagai macam kerajinan dan perniagaan. Sesungguhnya Dialah yang menyiapkan dan menundukkan sebab-sebabnya. ”amat sedikitlah kamu bersyukur” kepada Allah yang telah melimpahkan nikmat-nikmat kepadamu dan menolak berbagai kesulitan darimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 10: Kamu dapat membangun bangunan di atasnya, menggarap tanahnya dan memanfaatkannya dengan berbagai macam pemanfaatan. Yakni sebab-sebab yang menjadikan kamu dapat hidup di dunia, seperti air, udara, tumbuhan, hewan, dan berbagai sumber daya alam. Padahal Dia telah mengaruniakan kepadamu berbagai nikmat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 10",
    "description": "Setelah itu, pada ayat ini Allah menjelaskan tentang anugerah-Nya kepada manusia. Dan sungguh, kami telah menempatkan kamu di bumi menjadi pemilik dan pengelolanya, dan di sana kami sediakan sumber penghidupan untukmu seperti tempat untuk kamu menetap, sumbersumber makanan dan minuman, dan sarana kehidupan lainnya. Akan tetapi, sedikit sekali kamu bersyukur atas semua kenikmatan itu dengan mengerahkan semua energi yang didapat dari semua nikmat itu untuk beribadah kepada Allah. Bahkan, kamu banyak mengingkarinya dengan menyembah selain Allah, serta berbuat kemaksiatan dan kerusakan di bumi. Dan sungguh, kami telah menciptakan kamu dari ketiadaan, yaitu nabi adam dari tanah liat yang menjadi asal kejadian manusia di dunia, dengan mengukur dan memperkirakan semua bagian dengan tepat. Kemudian kami membentuk tubuh-Mu dengan sebaik-baik bentuk sesuai dengan kehendak kami, seperti tinggi-pendek dan bentuk masingmasing anggota tubuh. Kemudian kami berfirman kepada para malaikat, bersujudlah kamu kepada adam sebagai bentuk penghormatan kepadanya karena kemampuannya menyebutkan nama-nama benda yang tidak mampu sebutkan, sehingga ia berhak menjadi khalifah di dunia. Maka mereka, para malaikat, pun sujud sebagai penghormatan, bukan sujud ibadah, kecuali iblis, satuan dari jin yang terbuat dari api. Ia, iblis, tidak termasuk mereka yang bersujud."
  }
]