[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Negeri-negeri yang telah di kemukakan sebelumnya, yaitu negeri kaum nuh, hud, shaleh, luth, dan syu’aib, kami ceritakan kepadamu (wahai rasul), tentang berita-beritanya dan keadaan para rasul Allah yang diutus kepada mereka yang dapat menjadi pelajaran bagi orang-orang yang mau memetik pelajaaran darinya dan sebagai cambuk yang menakutkan bagi orang-orang yang zhalim. Dan sungguh telah datang kepada para penduduk negeri rasul-rasul Kami dengan membawa hujjah-hujjah yang nyata atas kebenaran mereka. Maka mereka tidak beriman terhadap risalah yang dibawa para rasul; disebabkan siikap melampaui batas dan pendustaan mereka terhadap kebenaran. Dan sebagiamana Allah telah mengunci hati-hati orang-orang kafir yang disebutkan ini, Dia juga kana mengunci hati orang-orang yang mengingkari Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Negeri-negeri di masa lalu itu -yaitu negeri-negeri kaum Nuh, Hud, Ṣāleḥ, dan Syu’aib- Kami ceritakan kepadamu -wahai Rasul- sebagian dari kisah pembangkangan mereka dan kehancuran mereka agar menjadi pelajaran serta peringatan bagi siapa saja yang mau menjadikannya sebagai pelajaran dan peringatan. Para rasul mereka telah datang kepada mereka dengan membawa bukti-bukti yang nyata atas kebenaran dakwah mereka, tetapi saat para rasul datang, mereka tidak mau beriman dan Allah tahu bahwa mereka memang akan mendustakan para rasul. Dan sebagaimana Allah mengunci mati hati penduduk negeri-negeri yang mendustakan rasul-rasul mereka itu Allah juga mengunci mati hati orang-orang yang mendustakan Muhammad -ṣallallāhu 'alaihi wa sallam- sehingga mereka tidak mengetahui jalan iman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Hai Rasulullah, Kami ceritakan kepadamu kisah-kisah besar dari negeri-negeri itu; telah datang kepada para penduduknya para rasul yang membawa mukjizat-mukjizat yang menakjubkan dan bukti-bukti yang jelas; namun mereka tidak beriman karena tetap mendustakan mereka. Demikianlah Allah mengunci hati orang-orang kafir yang hidup setelah mereka, yang melakukan perbuatan yang sama dengan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. تِلْكَ الْقُرَىٰ (Negeri-negeri itu) Yakni yang telah Kami binasakan itu, yaitu negeri kaum Nabi Nuh, Huud, Shalih, Luth, dan Syu’aib yang telah disebutkan sebelumnya. نَقُصُّ عَلَيْكَ(Kami ceritakan kepadamu) Yakni Kami bacakan kepadamu. مِنْ أَنۢبَآئِهَا ۚ( sebagian dari berita-beritanya) Yakni dari kisah-kisahnya. فَمَا كَانُوا۟ لِيُؤْمِنُوا۟ (maka mereka (juga) tidak beriman) Ketika para rasul datang dengan membawa mukjizat. بِمَا كَذَّبُوا۟( kepada apa yang mereka telah mendustakannya) Yakni disebabkan pendustaan mereka. مِن قَبْلُ ۚ(sebelumnya) Yakni sebelum kedatangan mereka dengan mukjizat. Atau maknanya adalah ketika mereka melihat mukjizat, mereka tidak beriman kepada mukjizat itu, namun keadaan mereka ketika datangnya mukjizat itu sebagaimana keadaan mereka sebelum melihatnya. كَذٰلِكَ يَطْبَعُ اللهُ عَلَىٰ قُلُوبِ الْكٰفِرِينَ (Demikianlah Allah mengunci mata hati orang-orang kafir) Sehingga nasihat dan peringatan tidak memberi manfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Negeri-negeri yang dibinasakan penduduknya yang merupakan negerinya 5 kaum; kaum Nuh, kaum Hud, kaum Shalih, kaum Luth, dan kaum Syu’aib itu Kami ceritakan sedikit dari kabar tentang kehancuran mereka kepadamu. Dan sungguh telah datang kepada mereka para rasul dengan membawa mukjizat dan bukti jelas yang menunjukkan kepada kebenaran risalah mereka, namun mereka tidak beriman saat para rasul ini datang membawa mukjizat-mukjizat ini akibat pendustaan mereka terhadap mukjizat tersebut sebelum didatangkan kepada mereka, bahkan mereka terus berada dalam kekufuran. Seperti mengunci hati orang-orang kafir dari umat yang telah lenyap itulah, Allah mengunci hati orang-orang kafir dari kaummu atau selainnya, sehingga nasehat dan peringatan tidak berguna untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Negeri-negeri itu Kami ceritakan} Kami bacakan {kepadamu sebagian beritanya} kabarnya {Sungguh rasul-rasul mereka telah datang kepada mereka dengan bukti-bukti yang nyata} dalil-dalil yang jelas atas kebenaran mereka {Mereka tidak mau beriman pada apa yang telah mereka dustakan sebelumnya. Demikianlah Allah mengunci hati orang-orang yang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101 “negeri-negeri (yang telah kamu binasakan itu)” yang disebutkan diatas “kami ceritakan sebagian dari berita-beritanya kepadamu” yang dengannya orang-orang bisa mengambil pelajaran, orang-orang zalim tergugah dari kezhalimannya dan orang-orang bertakwa mengambil nasihat darinya. ”dan sunggguh telah datang kepada mereka rasul-rasul mereka dengan membawa bukti-bukti yang nyata” yakni orang-orang yang mendustakan itu telah didatangi oleh rasul-rasul mereka yang menyeru pada kebahagiaan, Allah mengukuhkan mereka dengan berbagai mukjiat yang jelas lagi terang dan menerangkan kebenaran dengan sempurna, akan tetapi ia tidak berguna dan bermanfaat sedikitpun bagi mereka. ”maka mereka juga tidak beriman kepada apa yang dahulunya mereka telah mendustakannya.” yakni, sebab pendustaan dan penolakan mereka terhadap kebenaran sejak awal, maka Dia tidak memberi mereka petunjuk kepada iman sebagai balasan atas penolakan mereka terhadap kebenaran. Sebagaimana firman Allah \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.\" (QS. AL-AN'AM : 110) ”demikianlah Allah mengunci mati hati orang-orang kafir” sebagai hukuman dariNya, dan Allah tidak menzhalimi mereka, akan tetapi merekalah yang menzhalimi diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 101: Agar menjadi pelajaran, membuat orang-orang zalim berhenti dari kezalimannya dan sebagai pelajaran bagi orang-orang yang bertakwa. Mengajak kepada sesuatu yang membahagiakan mereka Yakni karena pada awalnya mereka mendustakan sehingga mereka mendustakan lagi setelahnya. Allah Subhaanahu wa Ta'aala berfirman,“Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.” (terj. Al An’aam: 110) Sebagai hukuman bagi mereka, dan Allah tidaklah menzalimi mereka, akan tetapi merekalah yang menzalimi diri mereka sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 101",
    "description": "Itulah negeri-negeri yang telah kami binasakan itu, yaitu negeri kaum nabi nuh, nabi hud, nabi saleh, nabi lut, dan nabi syuaib, kami ceritakan sebagian kisahnya kepadamu wahai nabi Muhammad, guna menjadi pelajaran bagi seluruh umat manusia. Jangan menduga kami telah berlaku zalim dengan membinasakan mereka. Telah banyak nasihat dan peringatan yang kami sampaikan, dan rasul-rasul mereka benar-benar telah datang kepada mereka dengan membawa bukti-bukti nyata yang menunjukkan kebenaraan misi mereka. Tetapi mereka tidak beriman juga kepada apa yang telah mereka dustakan sebelumnya. Demikianlah sebagaimana Allah mengunci hati orang-orang kafir yang disebut terdahulu, Allah me-ngunci hati orang-orang kafir dan ingkar kepada nabi Muhammad. Demikianlah Allah membuat penghalang atas hati dan akal orang-orang kafir, akibat perbuatan mereka, sehingga jalan kebenaran menjadi tak tampak dan mereka jauh dari kebenaran. Dan kami tidak mendapati kebanyakan mereka memenuhi janji sedikit pun, berupa komitmen terhadap keimanan yang kami pesankan kepada mereka melalui para rasul dan nalar yang sehat (lihat: surah ala'ra'f/7: 172). Begitu juga dengan janji-janji yang lain. Sebaliknya yang kami dapati kebanyakan mereka adalah orang-orang yang benar-benar fasik, menyimpang dan keluar dari ketaatan kepada Allah."
  }
]