[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidaklah mendapati kebanyakan umat yang lalu menjalankan amanat dan memenuhi janji. Dan tidaklah kami jumpai kebanyakan mereka kecuali orang-orang fasik yang menyimpang dari ketaatan kepada Allah dan dari menjalankan perintahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Dan Kami tidak mendapati kebanyakan dari umat-umat yang didatangi oleh para rasul itu memiliki keteguhan hati dan kesetiaan terhadap pesan yang diberikan oleh Allah. Kami tidak mendapati mereka tunduk kepada perintah-perintah-Nya. Tetapi Kami mendapati kebanyakan dari mereka tidak taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Dan telah terjadi apa yang telah Kami ketahui sebelumnya, bahwa mayoritas mereka tidak memenuhi perjanjian untuk beriman, bertakwa, dan beramal shalih; dan mereka menyelisihi perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. وَمَا وَجَدْنَا لِأَكْثَرِهِم مِّنْ عَهْدٍ ۖ (Dan Kami tidak mendapati kebanyakan mereka memenuhi janji) Namun kebiasaan mereka adalah melanggar perjanjian-perjanjian dalam segala keadaan. Dan maksud dari perjanjian ini adalah perjanjian yang mereka ambil ketika masih di alam ruh. Ada pendapat mengatakan mereka merupakan orang-orang kafir secara umum yang tidak dapat memenuhi perjanjian, dan sebagian kecil dari mereka saja yang memenuhi dan menjaga perjanjian. وَإِن وَجَدْنَآ أَكْثَرَهُمْ لَفٰسِقِينَ(Sesungguhnya Kami mendapati kebanyakan mereka orang-orang yang fasik) Dan Kami mendapati kebanyakan mereka keluar jauh dari ketaatan kepada Kami. Ibnu Abbas berkata tentang potongan ayat ini: sesungguhnya Allah membinasakan penduduk negeri-negeri tersebut karena mereka tidak menjaga apa yang telah ditetapkan-Nya atas mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah menyebutkan dalam ayat ini sifat segolongan manusia di dunia : { وَمَا وَجَدْنَا لِأَكْثَرِهِمْ مِنْ عَهْدٍ } \"Dan Kami tidak mendapati kebanyakan mereka memenuhi janji\" , kepada Allah mereka berbuat demikian lalu bagaimana perlakuan mereka manusia ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Dan Kami tidak mendapati kebanyakan manusia itu menepati janji atau wasiat dengan beriman dan penuh moral. Dan Kami tidak mendapati mereka kecuali benar-benar tidak mau taat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mendapati kebanyakan mereka memenuhi janji} memenuhi janji {Sesungguhnya} sesungguhnya {Kami mendapati kebanyakan mereka adalah orang-orang yang fasik} melanggar ketaatan dan perintah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102 “dan kami tidak mendapati kebanyakan mereka memenuhi janji” yakni kami tidak mendapati kebanyakan umat yang diutus kepada mereka rasul rasul itu menepati janji, yakni keteguhan dan komitmen dalam memegang wasiat Allah bagi seluruh alam, mereka juga tidak tunduk kepada perintah-perintahNya yang Dia sampaikan melalui para rasul. ”sesungguhnya kami mendapati kebanyakan mereka orang-orang yang fasik” menyimpang dari ketaatan kepada Allah, mengikuti hawa nafsu tanpa petunjuk dari Allah, Allah menguji para hamba dengan mengutus para rasul dan menurunkan kitab-kitab serta memerintahkan mereka agar memenuhi perjanjianNya dan mengikuti petunjukNYa, tetapi yang bersedia tunduk kepada perintah perintahNya hanyalah sedikit dari mereka, orang-orang yang telah ditulis (ditetapkan) akan berbahagia oleh Allah. Adapun mayoritas manusia maka mereka berpaling dari petunjuk dan menyombongkan diri dari apa yang dibawa oleh rasul-rasul maka Allah pun menampakan kepada mereka dari hukuman-hukumanNya yang bermacam-macam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 102: Yakni tidak teguh memegang wasiat Allah yang diwasatkan-Nya kepada semua manusia serta tidak tunduk kepada perintah-Nya yang disampaikan melalui lisan para rasul-Nya. Fasik artinya keluar dari ketaatan kepada Allah. Alah Subhaanahu wa Ta'aala menguji manusia dengan mengutus rasul dan menurunkan kitab serta memerintahkan mereka melaksanakan wasiat-Nya dan petunjuk-Nya, namun tidak ada yang mengikutinya kecuali sebagian kecil di antara mereka, sedangkan sebagian besarnya berpaling dari petunjuk, bersikap sombong terhadap apa yang dibawa para rasul, sehingga Allah menimpakan hukuman-Nya yang bermacam-macam ."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 102",
    "description": "Dan kami tidak mendapati kebanyakan mereka memenuhi janji sedikit pun, berupa komitmen terhadap keimanan yang kami pesankan kepada mereka melalui para rasul dan nalar yang sehat (lihat: surah ala'ra'f/7: 172). Begitu juga dengan janji-janji yang lain. Sebaliknya yang kami dapati kebanyakan mereka adalah orang-orang yang benar-benar fasik, menyimpang dan keluar dari ketaatan kepada Allah. Setelah mereka, yaitu para rasul tersebut, kemudian kami utus musa dengan membawa bukti-bukti yang menunjukkan kebenarannya dalam menyampaikan wahyu kami, kepada fir'aun dan pemuka-pemuka kaumnya, lalu dengan sikap zhalim dan takabbur mereka mengingkari buktibukti itudan melecehkannya serta menghalangi orang lain untuk mempercayainya. Karena itulah mereka, akhirnya, berhak mendapat azab Allah. Maka perhatikanlah wahai nabi Muhammad dan siapa pun yang mau menggunakan akalnya, bagaimana kesudahan dan akhir perjalanan orang-orang yang berbuat kerusakan, antara lain firaun yang Allah tenggelamkan di laut merah, dengan mendustakan kebenaran dari Allah dan menghalangi-halangi orang dari jalan-Nya."
  }
]