[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami mengutus setelah para rasul yang telah disebutkan nama-namanya itu, musa bin Imran dengan membawa mukjizat-mukjizat kami yang jelas kepaad fir’aun dan kaumnya. Tetapi mereka menentang dan mengingkarinya dengan kezhaliman dan penuh penentangan. maka perhatikanlah (wahai rasul), dengan penuh perenungan, bagimana kami memperlakukan mereka dan kami tenggelamkan mereka secara keseluruhan di hadapan musa dan kaumnya. Itulah kesudahan orang-orang yang melakukan perusakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Kemudian sepeninggal rasul-rasul itu Kami mengutus Musa -‘Alaihissalām- dengan membawa mukjizat-mukjizat yang nyata-nyata menunjukkan kebenarannya kepada Fir’aun dan kaumnya. Tetapi mereka menolak dan mengingkari mukjizat-mukjizat tersebut. Maka renungkanlah -wahai Rasul- bagaimana akhir perjalanan nasib Fir’aun beserta kaumnya. Allah membinasakan mereka dengan cara menenggelamkan mereka di laut dan mengutuk mereka di dunia dan Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "Pembahasan kembali pada kisah lain yang menceritakan para nabi dengan kaum mereka; ayat-ayat ini akan membahas tentang kisah Nabi Musa dengan Fir’aun dan dengan Bani Israil. 103. setelah para rasul tersebut, kemudian Allah mengutus Musa dengan membawa ayat-ayat yang menunjukkan kebenaran yang dia sampaikan dari Tuhannya kepada Fir’aun, para pembesar kaumnya, dan para pemimpin negeri. Namun Fir’aun dan pengikutnya menyikapi dakwah Musa dengan mengingkarinya karena keangkuhan mereka, sehingga mereka menzalimi diri mereka sendiri karena membuat diri mereka terancam azab yang menghinakan, serta menzalimi orang lain karena menghalangi mereka dari keimanan kepada ayat-ayat ini. Kemudian lihatlah bagaimana kesudahan Fir’aun dan para pengikutnya yang telah berbuat kerusakan di muka bumi?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. بِـَٔايٰتِنَآ (dengan membawa ayat-ayat Kami) Yakni mukjizat-mukjizat yang telah disebutkan seperti ular yang berasal dari tongkat, tangan yang mengeluarkan cahaya dan lain sebagainya. إِلَىٰ فِرْعَوْنَ(kepada Fir’aun) Yaitu penguasa negeri Mesir; semua yang berkuasa atas negeri mesir dahulu disebut dengan sebutan Fir’aun. وَمَلَإِي۟هِۦ(dan pemuka-pemuka kaumnya) Yakni pembesar-pembesar kaumnya. Allah mengkhususkan penyebutan mereka karena selain mereka termasuk pengikut-pengikut mereka. فَظَلَمُوا۟ بِهَا ۖ( lalu mereka mengingkari ayat-ayat itu) Yakni mendustakannya. Dan mendustakan sesuatu yang paling layak untuk dibenarkan merupakan kezaliman yang besar. Pendapat lain mengatakan maknanya adalah mereka menzalimi orang lain karena mukjizat itu, sebab mereka menghalangi orang lain dari keimanan kepada mukjizat tersebut, atau menzalimi diri mereka sendiri karena mukjizat itu. فَانظُرْ كَيْفَ كَانَ عٰقِبَةُ الْمُفْسِدِينَ (Maka perhatikanlah bagaimana akibat orang-orang yang membuat kerusakan) Yakni kesudahan dari keadaan orang-orang yang mendustakan dan mengingkari mukjizat-mukjizat itu, yaitu apa yang terjadi di akhir kisah mereka berupa tenggelamnya Fir’aun dan bala tentaranya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Kemudian setelah mengutus para rasul terdahulu seperti Nuh, Hud, Shalih dan Syu’aib, Kami mengutus Musa dengan membawa mukjizat yang menunjukkan kepada kebenaran nubuwwahnya kepada Fir’aun yang zalim beserta para pemimpin kaumnya, lalu mereka mengingkari mukjizat itu, mendustakannya dan menzalimi diri sendiri. Berdusta adalah kezaliman yang besar. Maka bayangkanlah wahai Nabi tentang bagaimana takdir orang-orang kafir yang berdusta."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian, Kami mengutus Musa setelah mereka dengan membawa ayat-ayat Kami} dalil-dalil dan petuntuk-petunjuk Kami {kepada Fir‘aun dan pemuka-pemuka kaumnya} kaumnya {Lalu mereka mengingkarinya} mereka menyangkal ayat-ayat itu {Perhatikanlah bagaimana akibat orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103 yakni kemudian kami mengutus setelah para rasul itu, Musa yang pernah diajak berbicara langsung oleh Allah, pemimpin yang agung, seorang rasul yang mulia kepada kaum yang Bengal lagi sombong yaitu fir’aun dan para pemuka kaumnya serta bala tentaranya, maka Allah menunjukan kepada mereka ayat-ayatNya yang besar yang tidak ada tandingannya, ”lalu mereka mengingkari ayat-ayat itu” dengan tidak tunduk kepada kebenarannya, dimana siapa yang tidak tunduk kepadanya maka dia adalah orang zhalim, namun justru menyombongkan diri kepadanya. ”maka perhatikanlah bagaimana akibat orang-orang yang berbuat kerusakan” bagaimana Allah membinasakan mereka dan menambahkan celaan dan laknat atas mereka di dunia, dan pada hari kiamat mereka akan mendapatkan seburuk-buruk pemberian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 103: Fir'aun adalah gelar bagi raja-raja Mesir purbakala. Menurut sejarah, Fir'aun di masa Nabi Musa ‘alaihis salam adalah Menephthah (1232-1224 S.M.) anak dari Ramses. Allah membinasakan mereka, mengiringinya dengan celaan dan laknat di dunia dan pada hari kiamat, itulah seburuk-buruk pemberian yang diberikan. Ayat ini masih mujmal dan diperinci dengan ayat-ayat setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 103",
    "description": "Setelah mereka, yaitu para rasul tersebut, kemudian kami utus musa dengan membawa bukti-bukti yang menunjukkan kebenarannya dalam menyampaikan wahyu kami, kepada fir'aun dan pemuka-pemuka kaumnya, lalu dengan sikap zhalim dan takabbur mereka mengingkari buktibukti itudan melecehkannya serta menghalangi orang lain untuk mempercayainya. Karena itulah mereka, akhirnya, berhak mendapat azab Allah. Maka perhatikanlah wahai nabi Muhammad dan siapa pun yang mau menggunakan akalnya, bagaimana kesudahan dan akhir perjalanan orang-orang yang berbuat kerusakan, antara lain firaun yang Allah tenggelamkan di laut merah, dengan mendustakan kebenaran dari Allah dan menghalangi-halangi orang dari jalan-Nya. Dan nabi musa berkata, wahai fir'aun! sungguh, aku adalah seorang utusan yang datang untuk menyampaikan seruan dan syariat dari tuhan yang mencipta dan mengatur keadaan seluruh alam, termasuk mesir."
  }
]