[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada fir’aun untuk mengajaknya berkomunikasi menyampaikan (amanat Allah),”sesungguhnya aku adalah utusan dari Allah, pencipta semua makhluk dan pengatur keadaan-keadaan dan kesudahan nasib-nasib mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Tatkala Allah mengutus Musa dan mendatangi Fir’aun, ia berkata, “Wahai Fir’aun! Sesungguhnya aku adalah utusan dari Rabb yang menciptakan seluruh makhluk, yang memilikinya dan mengatur segala urusannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Namun Musa berkata kepada Fir’aun dengan penuh keyakinan dan keteguhan: “Sungguh aku diutus kepadamu oleh Pencipta seluruh alam semesta.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. وَقَالَ مُوسَىٰ يٰفِرْعَوْنُ إِنِّى رَسُولٌ مِّن رَّبِّ الْعٰلَمِينَ (Dan Musa berkata: “Hai Fir’aun, sesungguhnya aku ini adalah seorang utusan dari Tuhan semesta alam) Dan berangsiapa yang diutus oleh Tuhan semerta alam maka ia layak untuk diterima seruannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Ketika menyampaikan risalahnya, Musa berkata: “Wahai Fir’aun, sesungguhnya aku adalah seorang rasul Allah, Tuhannya manusia dan jin yang diutus kepadamu. Hanya dialah yang berhak untuk diimani”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata,“Wahai Fir‘aun, sesungguhnya aku adalah seorang utusan dari Tuhan alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104 ini adalah pernyatan global yang diperinci dengan firmanNya “dan musa berkata” manakala dia datang kepada fir’aun untuk mengajaknya kepada iman “hai fir’aun sesungguhnya aku ini adalah seorang utusan dari Rabb semesta alam” yakni aku adalah rasul dari pengutus yang agung yaitu Rabb semesta alam, alam tinggi dan alam rendah, pengurus seluruh makhlukNya dengan berbagai macam tatanan ilahiyyah, yang diantaranya adalah bahwa Dia tidak membiarkan mereka hidup secara sia-sia, tetapi Dia mengutus para rasul sebagai pemberi kabar gembira dan peringatan, dimana tidak seorang pun yang berani atasnya dan mengklaim bahwa Dia mengutusnya padahal tidak mengutusnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 104: Ketika ia datang kepada Fir’aun mengajaknya beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 104",
    "description": "Dan nabi musa berkata, wahai fir'aun! sungguh, aku adalah seorang utusan yang datang untuk menyampaikan seruan dan syariat dari tuhan yang mencipta dan mengatur keadaan seluruh alam, termasuk mesir. Sebagai seorang nabi dan rasul yang bertugas menyampaikan pesan Allah, aku wajib mengatakan yang sebenarnya tentang Allah. Sungguh, untuk memperkuat kebenaran yang kubawa ini, aku datang kepadamu dengan membawa bukti yang nyata, berupa aneka mukjizat yang bersumber dari tuhanmu. Karena itu, maka lepaskanlah bani israil. Biarkan mereka pergi bersamaku ke baitulmakdis, negeri nenek moyang kami. Bebaskanlah mereka dari perbudakanmu dan biarkanlah mereka keluar ke wilayah yang bukan wilayahmu, agar mereka dapat menyembah tuhan mereka dan tuhanmu."
  }
]