[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sudah sepantasnya aku tidak mengatakan atas nama Allah, kecuali kebenaran, dan sudah seharusnya aku komitmen dengan itu.Sungguh aku telah datang kepada kalian dengan membawa bukti petunjuk dan hujjah amat kuat dari tuhan kalian tentang kebenaran apa yang aku sebutkan kepada kalian, maka bebaskanlah (wahai fir’aun) bersamaku orang-orang bani israil dari tawanan dan penindasanmu, lepaskanlah mereka untuk beribadah kepaada Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Musa berkata, “Karena aku adalah utusan dari-Nya maka sudah semestinya bila aku hanya mengatakan yang benar atas nama-Nya. Aku datang kepadamu dengan membawa bukti yang nyata-nyata menunjukkan kebenaranku, dan menunjukkan bahwa aku adalah utusan dari Rabbku kepadamu. Maka lepaskanlah bersamaku orang-orang Bani Israil dari penahanan dan penindasan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Sebagai konsekuensi dari risalah yang aku bawa ini, wajib bagiku untuk tidak mengatakan sesuatu tentang Allah kecuali yang benar. Aku telah datang kepadamu dan para pengikutmu dengan membawa hujjah yang jelas dari Allah sebagai bukti kebenaranku; maka lepaskanlah Bani Israil dari tawananmu dan biarkan mereka beriman kepada Allah bersamaku, agar mereka dapat keluar dari tawananmu dengan merdeka dan pergi dari tempatmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. حَقِيقٌ عَلَىٰٓ أَن لَّآ أَقُولَ عَلَى اللهِ إِلَّا الْحَقَّ ۚ (wajib atasku tidak mengatakan sesuatu terhadap Allah, kecuali yang hak) Yakni aku sangat berhasrat untuk memberitahukan kalian apa yang dibebankan kepadaku yang aku diutus karenanya sebagaimana mestinya, dan aku harus melakukan itu. قَدْ جِئْتُكُم بِبَيِّنَةٍ مِّن رَّبِّكُمْ(Sesungguhnya aku datang kepadamu dengan membawa bukti yang nyata dari Tuhanmu) Yakni yang dapat membuktikan kebenaranku bahwa aku adalah seorang rasul yang diutus oleh Tuhan semesta alam. فَأَرْسِلْ مَعِىَ بَنِىٓ إِسْرٰٓءِيلَ(, maka lepaskanlah Bani Israil (pergi) bersama aku) Nabi Musa meminta Fir’aun untuk membebaskan bani Israil agar bisa pergi bersamanya menuju negeri Baitul Maqdis. Dan mereka dulunya ditahan oleh Fur’aun untuk dijadikan budak dan dlarang untuk kebali ke kampung halaman mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Wajib bagiku untuk tidak berkata tentang Allah kecuali kebenaran yang diperintahkan kepadaku, yaitu agar menyampaikannya kepada kalian secara apa adanya. Sungguh aku telah mendatangkan kepadamu hujjah yang jelas dari tuhanmu yang menerangkan tentang kebenaranku. Maka biarkanlah Bani Israil bersamaku dan lepaskanlah mereka dari belenggu dan perbudakan kalian supaya mereka bisa kembali bersamaku menuju tanah suci, karena sesungguhnya mereka tidak diperbolehkan untuk kembali ke tanah bapak-bapak mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wajib} pantas dan layak {atasku untuk tidak berkata terhadap Allah, kecuali kebenaran. Sungguh aku datang kepada kalian dengan membawa bukti nyata} dalil yang jelas {dari Tuhan kalian. Maka lepaskanlah} bebaskanlah {Bani Israil bersamaku.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105 jika urusannya memang begitu, sedangkan aku telah dipilih dan diangkat untuk memikul risalahNya maka tidak sepantasnya bagiku untuk berdusta atasNya dan tidak megatakan atasNya kecuali kebenaran, karea jika aku berkata selain itu, maka Dia pasti menyegerakan hukuman kepadaku, dan pasti Dia akan mengazabku dengan azab dari yang maha perkasa maha berkuasa. Ini merupakan kenyatan yang mengharuskan mereka untuk tunduk dan mengikutinya, lebih-lebih dia telah datang kepada mereka dengan bukti kuat dari Allah yang menunjukkan kebenaran apa yang dibawanya, maka wajib atas mereka menjalankan tujuan risalahnya yang merupakan dua tujuan besar, yaitu agar mereka beriman kepadaNya, mengikutiNya dan melepaskan bani israil, bangsa yang diberi keutamaan oleh Allah, putra-putra para nabi dan keturunan ya’qub, dimana Musa alaihi salam adalah salah satu dari mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 105: Oleh karena Beliau adalah utusan Tuhan seluruh alam, maka wajib atasnya tidak berkata dusta terhadap Allah dan tidak mengatakan selain kata-kata yang benar. Karena jika tidak begitu, Beliau akan ditimpa dengan hukuman yang segera. Hal ini tentu mengharuskan mereka tunduk dan mengikutinya, terlebih telah datang kepada mereka bukti dari Allah yang menunjukkan kebenaran apa yang Beliau bawa, oleh karenanya mereka harus melaksanakan tujuan daripada risalah-Nya, yaitu mengikuti dan mengimani serta melepaskan Bani Israil, bangsa yang diberikan kelebihan oleh Allah di atas bangsa yang lain pada zaman itu. Karena mereka memperbudak Bani Israil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 105",
    "description": "Sebagai seorang nabi dan rasul yang bertugas menyampaikan pesan Allah, aku wajib mengatakan yang sebenarnya tentang Allah. Sungguh, untuk memperkuat kebenaran yang kubawa ini, aku datang kepadamu dengan membawa bukti yang nyata, berupa aneka mukjizat yang bersumber dari tuhanmu. Karena itu, maka lepaskanlah bani israil. Biarkan mereka pergi bersamaku ke baitulmakdis, negeri nenek moyang kami. Bebaskanlah mereka dari perbudakanmu dan biarkanlah mereka keluar ke wilayah yang bukan wilayahmu, agar mereka dapat menyembah tuhan mereka dan tuhanmu. Mendengar ucapan nabi musa itu dan pernyataannya bahwa beliau membawa serta bukti kebenaran, maka dia, yakni fir'aun menjawab, jika benar engkau datang dengan membawa sesuatu bukti pendukung dari tuhanmu, sebagaimana pengakuanmu, maka tunjukkanlah bukti itu kepadaku, kalau kamu termasuk orang-orang yang benar dalam pengakuan dan tindakanmu lagi dapat dipercaya."
  }
]