[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada musa , ”jika benar engkau membawa satu mukjizat sebagaimana pengakuanmu, maka datangkanlah bukti tersebut dan hadirkan di hadapanku agar klaimmu dapat dibuktikan kebenarannya, dan kejujuranmu juga terbukti, jika memang engkau berkata benar dalam klaim yang engkau katakan bahwa sesungguhnya engkau adalah utusan tuhan alam semesta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Fir’aun berkata kepada Musa, “Kalau kamu datang dengan membawa bukti seperti pengakuanmu, maka tunjukkanlah bukti itu jika pengakuanmu itu benar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Maka Fir’aun menjawab perkataan Musa: “Jika kamu datang membawa mukjizat dari Allah sebagai bukti kebenaranmu seperti yang kamu katakan, maka tunjukkanlah kepadaku agar menjadi bukti perkataanmu bahwa kamu adalah orang yang selalu berkata jujur dan benar.” Ini merupakan tantangan dan hinaan dari Fir’aun, bukan sebagai keinginannya untuk mengetahui kebenaran yang sesungguhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. قَالَ (Fir’aun menjawab) Fir’aun berkata kepadanya. إِن كُنتَ جِئْتَ بِـَٔايَةٍ(Jika benar kamu membawa sesuatu bukti) Dari sisi Allah sebagaimana yang kamu katakan. فَأْتِ بِهَآ (maka datangkanlah bukti itu) Agar kami dapat melihat dan menyaksikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Fir’aun berkata kepadanya: “Jika benar kamu didukung dengan mukjizat dari sisi Allah yang menunjukkan tentang kebenaran risalahmu, maka tunjukkanlah supaya kami bisa melihatnya, jika kamu memang benar”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Jika benar kamu membawa suatu bukti, tunjukkanlah bukti itu, jika kamu termasuk orang-orang yang benar.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106 Fir’aun menjawab “jika benar kamu membawa suatu bukti, maka datangkanlah suatu bukti itu jika (betul) kamu termasuk orang-orang yang benar”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 106",
    "description": "Mendengar ucapan nabi musa itu dan pernyataannya bahwa beliau membawa serta bukti kebenaran, maka dia, yakni fir'aun menjawab, jika benar engkau datang dengan membawa sesuatu bukti pendukung dari tuhanmu, sebagaimana pengakuanmu, maka tunjukkanlah bukti itu kepadaku, kalau kamu termasuk orang-orang yang benar dalam pengakuan dan tindakanmu lagi dapat dipercaya. Mendengar tantangan itu, lalu serta merta dan tanpa selang waktu yang lama, nabi musa melemparkan tongkatnya yang ada di tangan kanan ke hadapan fir'aun dan kaumnya, tiba-tiba tongkat itu berkat kekuasaan Allah berubah menjadi ular besar yang sebenarnya, yakni benarbenar ular dan bergerak dengan sangat cepat yang terlihat dengan mata kepala secara jelas."
  }
]