[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka musa melemparkan tongkatnya, maka tongkat itu berubah menjelma seekor ular yang sangat besar dan tampak jelas untuk dilihat mata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Kemudian Musa melemparkan tongkatnya. Dan tongkat itu langsung berubah menjadi ular yang sangat besar dan bisa dilihat oleh semua orang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Maka Musa melempar tongkatnya, ternyata tongkat itu menjadi ular asli, yang bergerak dengan lincah dan cepat sebagaimana ular yang sebenarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. فَأَلْقَىٰ عَصَاهُ فَإِذَا هِىَ ثُعْبَانٌ (Maka Musa menjatuhkan tongkat-nya, lalu seketika itu juga tongkat itu menjadi ular) Ular besar dari jenis ular jantan. مُّبِينٌ(yang sebenarnya) Bahwa ia adalah ular yang sebenarnya merupakan hal yang jelas dan nyata, tak diragukan sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Lalu Musa melemparkan tongkat yang ada di tangannya, seketika berubah menjadi ular besar yang benar-benar hidup dan berjenis kelamin jantan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Musa melemparkan tongkatnya, tiba-tiba tongkat itu menjadi ular besar} ular yang benar {yang nyata } yang nyata tidak ada kesamaran pada ular itu dan tidak pula dari sihir melainkan nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107 “maka musa menjatuhkan tongkatnya” di tanah. “lalu seketika itu juga tongkat itu menjadi ular yang sebenarnya” yakni ular yang nyata merayap dan mereka menyaksikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 107",
    "description": "Mendengar tantangan itu, lalu serta merta dan tanpa selang waktu yang lama, nabi musa melemparkan tongkatnya yang ada di tangan kanan ke hadapan fir'aun dan kaumnya, tiba-tiba tongkat itu berkat kekuasaan Allah berubah menjadi ular besar yang sebenarnya, yakni benarbenar ular dan bergerak dengan sangat cepat yang terlihat dengan mata kepala secara jelas. Melihat itu, fir'aun meminta bukti yang lain, dan dia nabi musa mengeluarkan tangannya dari dalam lubang leher bajunya, tiba-tiba tangan itu, yang sebelumnya berwarna hitam sesuai warna kulitnya yang kehitam-hitaman, menjadi bercahaya putih gemerlapan, yang tampak jelas bagi orang-orang yang melihatnya ketika itu, bukan karena belang atau penyakit, tetapi putih karena sangat bercahaya."
  }
]