[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dia menarik tangannya dari lubang leher pakaiannya dari sisinya, atau dari bawah ketiaknya, maka tiba-tiba tangan itu menjadi putih seperti warna air susu, namun bukan merupakan penyakit kusta, sebagai mukjizat di hadapan fir’aun. Bila dia memasukkannya lagi, maka kembali ke warnanya semula, seperti warna seluruh tubuhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Lalu Musa mengeluarkan tangannya dari belahan bajunya di bagian dada atau di bawah ketiaknya, dan tangan itu terlihat putih, bukan karena penyakit kusta, dan tampak berkilauan saking putihnya bagi siapa saja yang melihatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Kemudian Musa mendatangkan mukjizat yang lain untuk menegaskan kebenarannya. Dia mengeluarkan tangannya dari jubahnya setelah dia memasukkannya, ternyata tangannya menjadi putih terang, tanpa ada aib."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. وَنَزَعَ يَدَهُۥ (Dan ia mengeluarkan tangannya) Yakni mengeluarkan dan menunjukkannya dari celah bajunya, atau dari bawah ketiaknya. فَإِذَا هِىَ بَيْضَآءُ لِلنّٰظِرِينَ(maka ketika itu juga tangan itu menjadi putih bercahaya (kelihatan) oleh orang-orang yang melihatnya) Yakni putih memancarkan cahaya yang dapat dilihat oleh setiap orang yang tidak buta, dan putih bukan karena penyakit kusta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Lalu dia (Musa) mengeluarkan tangannya dari saku bajunya, seketika mengeluarkan cahaya yang berkilauan tanpa cacat sedikitpun yang bisa dilihat mata yang memandangnya dengan jelas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{lalu Dia menarik tangannya} mengeluarkan tangan dari sakunya atau di bawah ketiaknya {tiba-tiba tangan itu berkilau putih bagi orang-orang yang melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108 “dan ia mengeluarkan tangannya” dari sakunya, ”maka ketika itu juga tangan itu menjadi putih bercahaya (kelihatan) oleh orang-orang yang melihatnya.” tanpa aib. ini adalah dua mukjizat besar yang menunjukkan kebenaran apa yang dibawa oleh musa dan bahwa dia adalah benar-benar utusan Rabbul Alamin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 108: Dari leher bajunya. Inilah kedua bukti yang menunjukkan kebenaran apa yang dibawa Nabi Musa ‘alaihis salam, dan bahwa Beliau adalah utusan Allah Rabbul ‘alamin, akan tetapi orang yang tidak beriman kalau pun telah telah didatangkan setiap bukti, mereka tidak akan beriman juga sampai melihat azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 108",
    "description": "Melihat itu, fir'aun meminta bukti yang lain, dan dia nabi musa mengeluarkan tangannya dari dalam lubang leher bajunya, tiba-tiba tangan itu, yang sebelumnya berwarna hitam sesuai warna kulitnya yang kehitam-hitaman, menjadi bercahaya putih gemerlapan, yang tampak jelas bagi orang-orang yang melihatnya ketika itu, bukan karena belang atau penyakit, tetapi putih karena sangat bercahaya. Ketika nabi musa telah memperlihatkan bukti-bukti dari Allah itu, tercenganglah para pemuka dan pembesar fir'aun. Pemuka-pemuka kaum fir'aun, dengan menjilat dan bersikap munafik, berkata kepada fir'aun, orang ini benar-benar pesihir yang pandai, ini sebenarnya hanya kemahiran sihir saja, bukan bukti dari Allah, karena itu jangan memercayainya."
  }
]