[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pemuka dari kaum dir’aun berkata, ”sesungguhnya musa itu tukang sihir, dapat meghipnotyis pandangan manusia dengan tipu dayanya kepada mereka sehingga terbayang pada penglihatan mereka seolah-olah tongkat berubag menjadi seekor ular, dan suatu obyek berubah, menjadi barang yang berbeda dari sebenarnya, dan dia adalah orang yang berpengetahuan luas dalam ilmu sihir dan seorang yang ahli dibidang itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Tatkala para pembesar dan pemuka melihat tongkat Musa berubah menjadi ular dan tangannya menjadi putih berkilau bukan karena penyakit kusta, mereka berkata, “Musa ini pasti seorang penyihir yang hebat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Di sini para pembisik Fir’aun beraksi, mereka adalah para memilik kedudukan, kekayaan, dan kepentingan dalam negaranya. Apa yang didatangkan Musa telah membuat mereka marah, sehingga mereka membuat kedustaan bahwa dia adalah seorang penyihir yang sangat mahir dalam melakukan sihir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. قَالَ الْمَلَأُ (Pemuka-pemuka kaum Fir’aun berkata) Yakni para pembesar-pembesarnya, ketika menyaksikan berubahnya tongkat menjadi ular, dan tangannya yang menjadi putih bercahaya tanpa ada cacat. إِنَّ هٰذَا (Sesungguhnya orang ini) Yakni Musa. لَسٰحِرٌ عَلِيمٌ (adalah ahli sihir yang pandai) Yakni memiliki ilmu sihir yang kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Para pemimpin kaum Fir’aun berkata tentang apa yang mereka saksikan itu: “Sesungguhnya Musa adalah penyihir agung lagi pandai menunjukkan berbagai jenis dan seni sihir”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para pemuka kaum Fir‘aun berkata,“Sesungguhnya orang ini benar-benar penyihir yang sangat pandai} memiliki banyak ilmu tentang sihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109 akan tetapi orang-orang yang tidak beriman, seandainya semua ayat datang kepada mereka, mereka tetap tidak beriman sampai mereka melihat azab yang pedih. Oleh karena itu, ”pemuka-pemuka kaum fir’aun berkata” ketika mereka terkagum-kagum dengan mukjizat tetapi mereka tidak mau beriman, maka mereka mencari-cari takwil yang rusak. ”sesungguhnya musa ini adalah sihir yang pandai” yang pintar menyihir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 109: Dalam Surah Asy Syu’ara diterangkan, bahwa yang mengatakannya adalah Fir’aun sendiri, nampaknya mereka (para pemuka Fir’aun) juga mengatakannya bersama Fir’aun ketika bermusyawarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 109",
    "description": "Ketika nabi musa telah memperlihatkan bukti-bukti dari Allah itu, tercenganglah para pemuka dan pembesar fir'aun. Pemuka-pemuka kaum fir'aun, dengan menjilat dan bersikap munafik, berkata kepada fir'aun, orang ini benar-benar pesihir yang pandai, ini sebenarnya hanya kemahiran sihir saja, bukan bukti dari Allah, karena itu jangan memercayainya. Untuk memojokkan nabi musa, mereka berkata, dengan sihirnya itu, ia sebenarnya hendak merampas kekuasaanmu dan mengusir kamu dari nege-rimu, yaitu mesir, sehingga hanya dia dan kaumnya saja yang akan tinggal di situ. Dengan sihir itu pula ia dapat meluluhkan hati warga negeri ini agar mengikutinya. Fir'aun berkata, cobalah pikirkan apa saran kamu untuk keluar dari kesulitan ini!"
  }
]