[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kami telah melimpahkan kenikmatan atas kalian dengan menciptakan asal-muasal kalian, (yaitu bapak kalian, Adam dari ketiadaan). kemudian kami membentuk rupa fisiknya dalam bentuknya yang lebih baik melebihi kebanyakan makhluk. lalu kami memerintahkan para malaikat kami untuk bersujud kepadanya (sebagai bentuk kemuliaan, penghormaatan, dan pengukuhan keutamaan Adam). maka mereka semua bersujud. Akan tetapi, iblis yang waktu itu bersama malaikat, tidak mau bersujud kepada Adam. lantaran dorongan dari kedengkiannya terhadap kemuliaan besar ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Sungguh -wahai manusia- Kami telah menciptakan bapak kalian, Adam, dan membentuknya dalam wujud terbaik. Kemudian Kami perintahkan malaikat agar bersujud untuk memuliakannya. Maka para malaikat pun melaksanakan perintah itu dan bersujud. Kecuali Iblis, ia enggan bersujud karena sombong dan angkuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah menyebutkan kisah Nabi Adam dan Iblis serta pelajaran-pelajaran yang dapat diambil darinya: “Sungguh Kami telah menciptakan kalian dari Adam -dengan keagungan yang harus diagungkan dengan menghormati apa yang telah Kami ciptakan- dengan tangan Kami dalam bentuk yang paling baik. Kemudian Kami perintahkan seluruh malaikat untuk bersujud kepadanya sebagai bentuk menghormatan baginya. Merekapun mentaati Allah dan bersujud semuanya; kecuali Iblis yang ketika itu bersama mereka, ia melanggar perintah Allah dan enggan untuk bersujud."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَلَقَدْ خَلَقْنٰكُمْ (Sesungguhnya Kami telah menciptakan kamu (Adam)) Yakni Kami menciptakan Adam dari tanah. ثُمَّ صَوَّرْنٰكُمْ (lalu Kami bentuk tubuhmu) Yakni kami membentuk tubuh Adam dan kemudian tubuh kalian. Pendapat lain mengatakan maknanya adalah sugguh Kami pertama-tama telah menciptakan ruh-ruh kemudian Kami bentuk jasad-jasad. ثُمَّ قُلْنَا لِلْمَلٰٓئِكَةِ اسْجُدُوا۟ لِءَادَمَ (kemudian Kami katakan kepada para malaikat: “Bersujudlah kamu kepada Adam”) Kami memerintahkan mereka untuk sujud kemudian mereka mentaati perintah itu dan bersujud setelah perintah tersebut. إِلَّآ إِبْلِيسَ لَمْ يَكُن مِّنَ السّٰجِدِينَ (kecuali iblis. Dia tidak termasuk mereka yang bersujud) Enggan untuk bersujud karena keangkuhannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dan sungguh Kami telah menciptakan asal atau ayah kalian, Adam dari tanah, lalu Kami menciptakan kalian sebagai manusia. Dan Kami perintahkan para malaikat untuk memberikan sujud penghormatan kepada Adam, lalu mereka melakukannya dan memberikan sujud penghormatan, bukan sujud ibadah, kecuali Iblis yang tidak mau bersujud karena sombong"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menciptakan kamu, kemudian Kami membentukmu. Lalu, Kami katakan kepada para malaikat, “Bersujudlah kepada Adam.” Lalu mereka pun sujud, kecuali Iblis. dia tidak termasuk kelompok yang bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Allah berfirman kepada bani adam “dan sungguh kami telah menciptakan kamu” dengan menciptakan asal-usul dan bahan yang darinya kamu keluar, yaitu bapakmu Adam “lalu kami bentuk tubuhmu” dengan bentuk dan wujud yang paling baik, dan Allah mengajarkan kepadanya apa yang melengkapi gambaran batinnya, yaitu nama-nama segala sesuatu, kemudian Dia memerintahkan para malaikat yang mulia agar bersujud kepada Adam sebagai penghormatan, penghargaan, dan kemuliaan terhadap keutamaannya, lalu para malaikat pun tunduk kepada perintah Allah “maka merekapun bersujud” seluruhnya “kecuali iblis” iblis menolak bersujud karena kesombongan diri dan ujub terhadap dirinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 11: Yakni bapak kamu; Adam. Sujud di sini adalah sujud penghormatan dan pemuliaan, sekaligus memperlihatkan kelebihannya. Nenek moyang jin yang berada di tengah-tengah malaikat. Ia enggan bersujud karena sombong dan ujub terhadap dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 11",
    "description": "Dan sungguh, kami telah menciptakan kamu dari ketiadaan, yaitu nabi adam dari tanah liat yang menjadi asal kejadian manusia di dunia, dengan mengukur dan memperkirakan semua bagian dengan tepat. Kemudian kami membentuk tubuh-Mu dengan sebaik-baik bentuk sesuai dengan kehendak kami, seperti tinggi-pendek dan bentuk masingmasing anggota tubuh. Kemudian kami berfirman kepada para malaikat, bersujudlah kamu kepada adam sebagai bentuk penghormatan kepadanya karena kemampuannya menyebutkan nama-nama benda yang tidak mampu sebutkan, sehingga ia berhak menjadi khalifah di dunia. Maka mereka, para malaikat, pun sujud sebagai penghormatan, bukan sujud ibadah, kecuali iblis, satuan dari jin yang terbuat dari api. Ia, iblis, tidak termasuk mereka yang bersujud. Allah mempertanyakan alasan penolakan iblis untuk sujud kepada adam. Dia berfirman, apakah yang menghalangimu untuk menghormati adam sehingga kamu tidak bersujud kepadanya ketika aku menyuruhmu' dengan penuh angkuh dan sombong, iblis menjawab, aku tidak pantas bersujud kepadanya karena aku lebih baik daripada dia sehingga aku tidak wajar bersujud kepadanya. Engkau ciptakan aku dari api, sedangkan dia engkau ciptakan dari tanah, dan api lebih baik daripada tanah."
  }
]