[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka orang-orang yang hadir pada acara debat dengan musa dari kalangan pemuka kaum fir’aun da pembesar mereka berkata, ”berilah dia dan saudaranya, harun, waktu penangguhan dan utuslah petugas-petugas ke kota-kota negeri mesir dan pedesaan-pedesaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Mereka berkata kepada Fir'aun, “Tangguhkanlah urusan Musa dan saudaranya, Harun. Dan kirimlah sejumlah orang ke kota-kota yang ada di Mesir untuk mengumpulkan para penyihir yang ada di sana.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111-112. Maka mereka menyampaikan pendapat mereka kepadanya: “Tundalah urusanmu dengan Musa dan saudaranya ini ke lain waktu, dan jangan terburu-buru dalam menyelesaikannya -karena Fir’aun sangat takut sehingga ingin segera membunuh Musa dan saudaranya-. Utuslah keseluruh negeri kekuasaanmu, orang yang mengumpulkan para tukang sihir yang hebat agar mereka dapat melawan tukang sihir yang mahir ini (yakni Musa), menyingkap ilmu sihirnya, dan mengalahkannya dengan sihir yang serupa atau bahkan yang lebih kuat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. قَالُوٓا۟ أَرْجِهْ وَأَخَاهُ (Pemuka-pemuka itu menjawab: “Beri tangguhlah dia dan saudaranya) Pembesar-pembesarnya berkata sebagai jawaban atas pertanyaan Fir’aun: berilah Musa dan saudaranya penangguhan dan akhirkan pertemuan dengan dia di waktu lain. وَأَرْسِلْ فِى الْمَدَآئِنِ حٰشِرِينَ(serta kirimlah ke kota-kota beberapa orang yang akan mengumpulkan (ahli-ahli sihir)) Yakni utuslah sekelompok orang ke kota-kota yang terdapat tukang sihir disana agar mengumpulkan dan mendatangkan mereka kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Para pemuka kaum itu berkata kepada Fir’aun: “Beri tangguh dan abaikan dia dan saudaranya, Harun sampai batas waktu tertentu, lalu mintalah para pemimpin daerah dan kota jajahan di Mesir untuk mengumpulkan dan mengirimkan para pengihir untukmu”. FirmanNya (Hasyiriin) yaitu orang-orang yang mengumpulkan para penyihir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab,“Beri tangguhlah dia} berikan dia penangguhan {dan saudaranya dan utuslah ke kota-kota} kota-kota dan daerah-daerah Mesir {beberapa orang yang mengumpulkan} orang-orang yang mengumpulkan para penyihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111-112 pada saat pendapat mereka menyatu dengan mengatakan kepada fir’aun “beri tangguhlah dia dan saudaranya” yakni tahan mereka dan beri mereka berdua waktu, dan utuslah orang orang ke penjuru kota untuk mengumumkan kepada penduduknya agar mereka menghadirkan semua penyihir yang ahli, yakni mereka mendatangkan para penyihir yang mumpuni untuk melawan apa yang dibawa oleh musa, maka mereka berkata ”(wahai musa) buatlah suatu waktu untuk pertemuan antara kami dan kamu, yang kami tidak akan menyalahinya dan tidak (pula) kamu di suatu tempat yang pertengahan (letaknya), musa berkata ”waktu untuk pertemuan (kami dengan) kamu itu adalah di hari raya dan hendaklah manusia dikumpulkan pada waktu matahari sepenggalahan naik, maka fir’aun menginggalkan (tempat itu) lalu mengatur tipu dayanya, kemudian dia datang. ”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 111",
    "description": "Sebagai tanggapan atas tantangan di atas, pemuka-pemuka itu pun menjawab, tahanlah atau berilah tempo untuk sementara waktu kepada dia, yakni nabi musa dan saudaranya, yaitu nabi harun yang menjadi tangan kanannya, dan jangan kamu bunuh mereka. Kerahkanlah dan utuslah ke kota-kota yang berada di bawah kekuasaanmu beberapa orang bala tentara untuk mengumpulkan para pesihir dari berbagai penjuru negeri. Agar mereka membawa secara paksa atau suka rela semua pesihir yang pandai kepadamu. Dengan berkumpulnya para ahli sihir itu di hadapanmu, mereka akan membeberkan hakikat yang sebenarnya dibawa musa. Dengan demikian, tak seorang pun yang dapat diperdaya."
  }
]