[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian para tukang sihir berdatangan kepada fir’aun. Mereka berkata, ”apakah kami akan memperoleh hadiah dan harta, bila kami berhasil mengalahkan musa?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Kemudian Fir’aun mengirim sejumlah orang untuk mengumpulkan para penyihir. Dan tatkala para penyihir datang mereka bertanya kepada Fir’aun, \"Apakah mereka akan mendapatkan imbalan jika mereka berhasil mengalahkan Musa dengan sihir mereka?.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. Maka terkumpullah para tukang sihir yang hebat. Mereka menghadap Fir’aun untuk meminta apa yang mereka inginkan; mereka berkata kepadanya: “Apakah kami akan mendapatkan upah yang besar jika kami dapat mengalahkan tukang sihir yang mahir ini?” Mereka terlebih dahulu memastikan besarnya upah yang akan mereka dapatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَجَآءَ السَّحَرَةُ فِرْعَوْنَ (Dan beberapa ahli sihir itu datang kepada Fir’aun) Yakni Fir’aun pun mengutus beberapa orang ke kota-kota untuk mengumpulkan para penyihir, lalu para penyihir itu mendatangi Fir’aun. قَالُوٓا۟ إِنَّ لَنَا لَأَجْرًا(mereka mengatakan: “(Apakah) sesungguhnya kami akan mendapat upah) Mereka meminta Fir’aun agar memberi mereka hadiah apabila dapat mengalahkan Nabi Musa dengan sihir mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113. Lalu datanglah para penyihir itu kepada Fir’aun dan berkata: “Apakah kami akan menerima imbalan atau bayaran atas pekerjaan kami, jika menang atas Musa dengan sihir kami?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para penyihir datang kepada Fir‘aun. Mereka berkata,“kami benar-benar akan mendapat imbalan} balasan dan harta {jika kami menang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113 Disini Allah berfirman ”dan beberapa ahli sihir itu datang kepada fir’aun” menuntut balasan (upah ) jika mereka menang, mereka berkata, ”(apakah) sesungguhnya kami akan mendapat upah, jika kamilah yang menang?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 113",
    "description": "Fir'aun pun mengikuti saran tersebut dan menangguhkan persoalan nabi musa dan nabi harun, sambil mengumpulkan para pesihir yang pandai di negeri itu. Dan tak berapa lama kemudian para pesihir yang dikumpulkan oleh bala tentara itu pun datang kepada fir'aun. Mereka tahu peristiwa yang terjadi dan menyadari akan pentingnya ke-beradaan mereka, sehingga mereka berani berkata kepada fir'aun, apakah kami benar-benar akan mendapat imbalan yang besar, sesuai tugas berat yang kami emban, jika kami menang dan berhasil mengalahkan sihir musa' begitulah keadaan para penyihir yang selalu merasa butuh dan mengejar materi, sehingga seringkali mati dalam keadaan miskin dan dalam bentuk yang mengerikan. Karena fir'aun ingin menang dan mengalahkan sihir nabi musa, dia (fir'aun) menjawab, ya, tentu bagi kalian imbalan yang besar, bahkan lebih dari itu sesungguhnya kamu pasti benar-benar akan termasuk orang-orang yang didekatkan kedudukannya padaku dan akan mendapatkan segala bentuk kesenangan."
  }
]