[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Firaun menjawab, ”betul. Bagi kalian akan mendapatakn imbalan dan posisi dekat denganku, bila kalian berhasil mengalahkannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Fir’aun menjawab, “Ya. Kalian akan mendapatkan imbalan dan upah. Dan kalian akan menjadi orang-orang yang dekat dengan raja dengan mengampu jabatan yang tinggi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114. Ketika itu, Fir’aun menjawab mereka dengan jawaban orang lemah yang ingin selamat dari musuhnya dengan cara apapun: “Benar, kalian akan mendapat upah yang besar; disamping itu kalian akan menjadi orang-orang yang memperoleh kedekatan denganku.” Fir’aun mengiming-imingi upah materi dan menjanjikan mereka kedudukan dalam kekuasaannya, untuk memberi semangat dan dorongan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. قَالَ نَعَمْ وَإِنَّكُمْ لَمِنَ الْمُقَرَّبِينَ (Fir’aun menjawab: “Ya, dan sesungguhnya kamu benar-benar akan termasuk orang-orang yang dekat (kepadaku)”) Maka Fir’aun menjawab mereka dengan jawaban ini. Yakni sungguh ada balasan hadiah bagi kalian, dan selain dari hadiah yang kalian minta ini, kalian akan menjadi orang-orang yang dekat dengan kami. Fir’aun menjanjikan mereka jabatan dan derajat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Lalu Fir’aun menjawab mereka: “Benar, kalian akan mendapatkan imbalan itu. Sesungguhnya kalian juga akan (memiliki posisi) dekat dengan kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Fir’aun menjawab,“Ya, sesungguhnya kalian sungguh termasuk orang-orang yang didekatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114 fir’aun menjawab “ya” kamu akan mendapat imbalan. ”dan sesungguhnya kamu benar-benar akan termasuk orang-orang yang dekat (kepadaku)” Fir’aun menjanjikan balasan, kedekatan, dan kedudukan tinggi di sisinya agar mereka serius dan mengeluarkan segala daya dan upaya mereka dalam mengalahkan musa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 114",
    "description": "Karena fir'aun ingin menang dan mengalahkan sihir nabi musa, dia (fir'aun) menjawab, ya, tentu bagi kalian imbalan yang besar, bahkan lebih dari itu sesungguhnya kamu pasti benar-benar akan termasuk orang-orang yang didekatkan kedudukannya padaku dan akan mendapatkan segala bentuk kesenangan. Para ahli sihir itu pun'setelah mendapatkan janji fir'aun dan membayangkan kedudukan yang akan diperoleh'dengan penuh percaya diri mendatangi nabi musa. Dengan nada menantang, mereka para pesihir berkata, wahai musa! engkaukah yang akan melemparkan lebih dahulu tongkat yang engkau miliki itu, atau kami yang melemparkan lebih dulu apa yang kami miliki'."
  }
]