[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka para tukang sihir fir’aun berkata kepada musa dengan nada angkuh lagi menyepelekan, ”wahi musa silahkan pilih, engkau melemparkan tongkatmu duluan atau kami yang akan melakukkanya dahulu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Para penyihir itu benar-benar yakin bahwa mereka akan menang. Maka dengan penuh kesombongan dan keangkuhan mereka berkata, “Wahai Musa! Terserah kamu, apakah kamu yang akan memulai dengan melemparkan sesuatu? Ataukah kami yang akan memulai?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "Setelah para tukang sihir mendapat kepastian upah yang akan mereka terima, orang-orang telah berkumpul dari segala penjuru negeri pada hari raya mereka, dan Fir’aun telah datang berserta para pengikutnya dan penasehatnya; mereka semua berkumpul untuk menyaksikan kejadian besar yang akan terjadi. Maka dimulailah perdebatan dan pertarungan antara Musa dan para penyihir: 115. Para penyihir itu mendatangi Musa dengan percaya diri atas kekuatan mereka; mereka berkata: “Hai Musa, pilihlah antara kamu yang akan melempar tongkatmu terlebih dahulu, atau kami yang akan memulainya dan kamu dapat melakukan apa yang kamu mau setelah kami; kami sangat yakin akan mengalahkanmu, maka tidak perlu bagimu membuang tenaga, dan menyerahlah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. قَالُوا۟ يٰمُوسَىٰٓ إِمَّآ أَن تُلْقِىَ وَإِمَّآ أَن نَّكُونَ نَحْنُ الْمُلْقِينَ (Ahli-ahli sihir berkata: “Hai Musa, kamukah yang akan melemparkan lebih dahulu, ataukah kami yang akan melemparkan?”) Mereka memberi Nabi Musa pilihan antara ia yang memulai untuk melempar sihir yang ingin ia lempar atau mereka yang akan memulainya, sebagai bentuk kepercayaan diri mereka bahwa mereka akan menang meski mereka terakhir dalam memulai sihir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "115-119 1 ). Hikmah dari permintaan Musa kepada para penyihir agar mereka memulai sihir adalah : agar manusia melihat sihir para penyihiri itu , kemudian Musa mendatangkan kebenaran yang melawan semua kebodohan mereka. 2 ). Perhatikan ayat berikut : { قَالَ أَلْقُوا ۖ فَلَمَّا أَلْقَوْا سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ } \"Musa menjawab: “Lemparkanlah (lebih dahulu)!” Maka tatkala mereka melemparkan, mereka menyulap mata orang dan menjadikan orang banyak itu takut, serta mereka mendatangkan sihir yang besar (menakjubkan).\" Musuh-musuh Allah memiliki cara yang berbeda-beda untuk membodohi manusia, dan tujuan mereka sebenarnya hanya satu; tetapi apa yang mereka perbuat akan terkalahkan dengan satu kekuatan, yaitu : senantiasa konsisten di atas wahyu Allah, sebagaiman yang diperbuat oleh Musa, dan setelah itu kemenangan pasti akan di atas : { [ فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ [ 118 ] فَغُلِبُوا هُنَالِكَ وَانْقَلَبُوا صَاغِرِينَ [ 119 } \"Karena itu nyatalah yang benar dan batallah yang selalu mereka kerjakan [ 118 ] Maka mereka kalah di tempat itu dan jadilah mereka orang-orang yang hina [ 119 ]\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Para penyihir itu memberi Musa pilihan apakah dia yang melempar pertama sesuai kehendaknya ataukah mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Musa, apakah kamu yang akan melemparkan atau kami yang melemparkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115 maka ketika mereka hadir bersama Musa di depan khalayak yang berjumlah besar, ”mereka berkata” dengan bersumpah tanpa memandang sama sekali apa yang dibawa oleh Musa “hai musa kamukah yang akan melemparkan lebih dahulu” apa yang ada padamu, ”ataukah kami yang akan melemparkan?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 115: Ketika mereka berhadapan dengan Nabi Musa ‘alaihis salam di hadapan manusia dalam jumlah besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 115",
    "description": "Para ahli sihir itu pun'setelah mendapatkan janji fir'aun dan membayangkan kedudukan yang akan diperoleh'dengan penuh percaya diri mendatangi nabi musa. Dengan nada menantang, mereka para pesihir berkata, wahai musa! engkaukah yang akan melemparkan lebih dahulu tongkat yang engkau miliki itu, atau kami yang melemparkan lebih dulu apa yang kami miliki'dengan penuh keyakinan dan tanpa rasa takut sedikit pun, dia (nabi musa) menjawab, lemparkanlah lebih dahulu apa yang hendak kamu lempar! maka setelah mereka melemparkan apa yang dibawa berupa tali-temali dan tongkat, mereka menyihir mata orang banyak yang hadir di tempat itu. Tali-temali dan tongkat itu terlihat bagaikan ularular yang bergerak dan bertumpuk satu sama lain, seolah-olah apa yang mereka lakukan itu benar-benar terjadi, dan pemandangan itu menjadikan orang ba-Nyak itu tercengang dan takut, karena mereka memperlihatkan sihir yang hebat dan menakjubkan disertai dengan teriakan, hati-hati jangan sampai digigit ular."
  }
]