[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka musa berkata kepada para tukang sihir itu, ”silahkan kalian lempar lebih dahulu!” ketika mereka melmparkan tali-tali dan tongkat-tongkat mereka menyihir pandangan manusia sehingga terbayang pada mata mereka kalau yang mereka lakukan benar-benar terjadi. padahaal itu tiada laian hanyalah sekedar jadi-jadian dan khalyalan belaka. Mereka menakut-nakuti manusia dengan rasa takut yang mendalam. Mereka mendatangkan sihir yang sangat kuat lagi banyak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Musa menjawab dengan keyakinan penuh akan pertolongan Rabbnya tanpa menghiraukan mereka, “Lemparkanlah tali-tali dan tongkat-tongkat kalian?” Setelah mereka melemparkannya, mereka berhasil menyihir mata manusia yang melihatnya dengan memalingkannya dari penglihatan yang benar dan membuat mereka ketakutan. Mereka berhasil menunjukkan sihir yang hebat di depan mata orang-orang yang melihatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Maka Musa menjawab mereka dengan penuh keyakinan terhadap Tuhannya, dan memilih agar mereka yang terlebih dahulu mengeluarkan sihir mereka, tanpa peduli dengan mereka dan pasukan mereka; sebab dia telah bersandar kepada Tuhannya. Ketika mereka telah melempar tali dan tongkat yang mereka miliki, mereka menyihir penglihatan orang-orang yang melihatnya sehingga seakan-akan mereka melakukan sihir yang sesungguhnya, sehingga hati mereka dipenuhi ketakutan. Mereka telah mendatangkan sihir yang besar pada pandangan orang yang melihatnya. Setiap penyihir itu melempar tongkat yang mereka punya, lalu tongkat-tongkat itu berubah menjadi ular. Namun ini adalah cara Allah untuk menampakkan mukjizat Musa yang bukan merupakan sihir, dan tidak akan tertandingi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. أَلْقُوا۟ (“Lemparkanlah (lebih dahulu)!”) Maka Nabi Musa menjawab mereka dengan ucapan ini. Nabi Musa memilih agar mereka yang pertama melempar sihirnya tanpa peduli kepada mereka dan tanpa takut dari sihir mereka. فَلَمَّآ أَلْقَوْا۟( Maka tatkala mereka melemparkan) Yakni melempar tali temali dan tongkat mereka. سَحَرُوٓا۟ أَعْيُنَ النَّاسِ(mereka menyulap mata orang) Yakni mereka mengubah tali dan tongkat mereka dan menyulap penampakan sesungguhnya dengan memberikan khayalan dan bayangan seperti yang dilakukan oleh para dukun dan tukang sulap. وَاسْتَرْهَبُوهُمْ(dan menjadikan orang banyak itu takut) Yakni mereka masukkanrasa takut yang sangat kedalam hati mereka. وَجَآءُو بِسِحْرٍ عَظِيمٍ (serta mereka mendatangkan sihir yang besar (mena’jubkan)) Dalam pandangan orang-orang yang melihatnya ketika sihir itu dikeluarkan, meskipun dalam kenyataannya hal itu tidak ada; sihir ini termasuk dalam sihir yang membentuk khayalan pada orang yang melihatnya dan tipuan tangan. Ada pendapat mengatakan terdapat sihir yang nyata dan memberi dampak. Wallahu A’lam. Lihat tafsir surat al-Baqarah: 102."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "115-119 1 ). Hikmah dari permintaan Musa kepada para penyihir agar mereka memulai sihir adalah : agar manusia melihat sihir para penyihiri itu , kemudian Musa mendatangkan kebenaran yang melawan semua kebodohan mereka. 2 ). Perhatikan ayat berikut : { قَالَ أَلْقُوا ۖ فَلَمَّا أَلْقَوْا سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ } \"Musa menjawab: “Lemparkanlah (lebih dahulu)!” Maka tatkala mereka melemparkan, mereka menyulap mata orang dan menjadikan orang banyak itu takut, serta mereka mendatangkan sihir yang besar (menakjubkan).\" Musuh-musuh Allah memiliki cara yang berbeda-beda untuk membodohi manusia, dan tujuan mereka sebenarnya hanya satu; tetapi apa yang mereka perbuat akan terkalahkan dengan satu kekuatan, yaitu : senantiasa konsisten di atas wahyu Allah, sebagaiman yang diperbuat oleh Musa, dan setelah itu kemenangan pasti akan di atas : { [ فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ [ 118 ] فَغُلِبُوا هُنَالِكَ وَانْقَلَبُوا صَاغِرِينَ [ 119 } \"Karena itu nyatalah yang benar dan batallah yang selalu mereka kerjakan [ 118 ] Maka mereka kalah di tempat itu dan jadilah mereka orang-orang yang hina [ 119 ]\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116. Musa berkata kepada mereka: “Silahkan kalian melempar pertama”. Ketika mereka melempar tali dan tongkat mereka, mereka menipu mata orang-orang, dan membuat mereka tidak menyadari bahwa tindakan para penyihir itu adalah tipu muslihat. Mereka memberikan ketakutan yang besar dalam hati orang-orang. Para penyihir itu mendatangkan sihir yang sempurna dan mengagumkan bagi orang yang memandang meskipun kenyataannya tidak ada kebenaran dalam sihir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa menjawab, “Lemparkanlah” Maka ketika melemparkan, mereka menyihir mata manusia} mereka mengacaukan mata manusia dari kesadarannya sehingga mereka berkhayal dengan matanya itu tentang sesuatu yang tidak nyata {dan menjadikan mereka takut} menjadikan mereka takut dan merasa sangat terintimidasi {Mereka memperlihatkan sihir yang hebat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116 musa menjawab ”lemparkanlah lebih dulu” agar orang-orang melihat apa yang mereka miliki dari apa yang Musa miliki. Maka tatkala mereka melemparkan ”tambang-tambang, dan tongkat-tongkat mereka sehingga tampak menjadi seperti ular yang melata, mereka menyulap, ”mata orang-orang yang menjadikan orang bayak itu takut, serta mereka mendatangkan sihir yang besar (menakjubkan)” sihir yang tak tertandingi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 116: Tali dan tongkat mereka. Karena mereka membayangkan tali dan tongkat mereka kepada manusia sebagai ular yang berjalan cepat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 116",
    "description": "Dengan penuh keyakinan dan tanpa rasa takut sedikit pun, dia (nabi musa) menjawab, lemparkanlah lebih dahulu apa yang hendak kamu lempar! maka setelah mereka melemparkan apa yang dibawa berupa tali-temali dan tongkat, mereka menyihir mata orang banyak yang hadir di tempat itu. Tali-temali dan tongkat itu terlihat bagaikan ularular yang bergerak dan bertumpuk satu sama lain, seolah-olah apa yang mereka lakukan itu benar-benar terjadi, dan pemandangan itu menjadikan orang ba-Nyak itu tercengang dan takut, karena mereka memperlihatkan sihir yang hebat dan menakjubkan disertai dengan teriakan, hati-hati jangan sampai digigit ular. Dan untuk menunjukkan kebesaran kami di hadapan orang banyak, kami wahyukan kepada nabi musa, lemparkanlah tongkatmu! nabi musa pun segera melemparkan tongkatnya, maka tiba-tiba tongkat itu berubah menjadi seekor ular yang bergerak dengan cepat menelan habis segala kepalsuan mereka, yakni sihir dan tipu daya yang mereka lakukan."
  }
]