[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah mewahyukan kepada hamba dan rasulNya, musa , pada peristiwa yang besar itu, dimana dengan itu Allah membedakan antara kebenaran dan kebatilan. Allah memerintahkan musa untuk melemparkan apa yang ada di tangan kanannya, yaitu tongkatnya. Musa melemparkan dan tiba-tiba tongkat itu menelan apa saja yang mereka lemaparkan dan mereka kesankan kepada manusia sebaga kebenaran, padahal sebenarnya merupakan kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Dan Allah mewahyukan kepada nabi sekaligus orang yang diajak-Nya berbicara, yaitu Musa -‘Alaihissalām-, “Lemparkanlah tongkatmu, wahai Musa!” Maka Musa pun melemparkan tongkatnya. Kemudian tongkat itu berubah menjadi ular dan langsung menelan tali-tali dan tongkat-tongkat yang digunakan oleh para penyihir untuk mengubah kenyataan dan mengelabui manusia bahwa tali-tali dan tongkat-tongkat itu adalah ular-ular yang bergerak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117. Dan pada situasi genting ini, mereka saling memandang. Namun saat menghadapi kebohongan besar yang mereka buat ini, Musa merasakan ketakutan dalam dirinya; akan tetapi kemudian turun wahyu dari Allah sebagai peneguhan dan bertolongan baginya: “Lemparlah tongkatmu dan janganlah takut, karena kamu yang akan menang.” Maka Musa melempar tongkatnya, lalu tongkat itu menelan dengan cepat tongkat-tongkat para penyihir tersebut. Musa meminta mereka memulai sihir mereka terlebih dahulu merupakan pilihan yang tepat; karena dengan mereka memulai terlebih dahulu mengharuskan mereka mengeluarkan segala kemampuan mereka dalam melakukan sihir, sehingga ketika Musa melempar tongkatnya dan tongkat itu menelan segala kedustaan yang mereka buat merupakan bentuk menampakkan kebenaran dan melenyapkan kebatilan yang tidak dapat dibantah. Seandainya dia melempar tongkatnya terlebih dahulu, maka itu semua tidak akan terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. فَإِذَا هِىَ (Maka tiba-tiba ia) Yakni tongkat itu. تَلْقَفُ مَا يَأْفِكُونَ (menelan apa yang mereka sulapkan) Menelan tali temali dan tongkat mereka. Disebut sebagai إفك/kebohongan karena ia tidak nyata, tapi merupakan kedustaan, tipuan, dan sulap."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "115-119 1 ). Hikmah dari permintaan Musa kepada para penyihir agar mereka memulai sihir adalah : agar manusia melihat sihir para penyihiri itu , kemudian Musa mendatangkan kebenaran yang melawan semua kebodohan mereka. 2 ). Perhatikan ayat berikut : { قَالَ أَلْقُوا ۖ فَلَمَّا أَلْقَوْا سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ } \"Musa menjawab: “Lemparkanlah (lebih dahulu)!” Maka tatkala mereka melemparkan, mereka menyulap mata orang dan menjadikan orang banyak itu takut, serta mereka mendatangkan sihir yang besar (menakjubkan).\" Musuh-musuh Allah memiliki cara yang berbeda-beda untuk membodohi manusia, dan tujuan mereka sebenarnya hanya satu; tetapi apa yang mereka perbuat akan terkalahkan dengan satu kekuatan, yaitu : senantiasa konsisten di atas wahyu Allah, sebagaiman yang diperbuat oleh Musa, dan setelah itu kemenangan pasti akan di atas : { [ فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ [ 118 ] فَغُلِبُوا هُنَالِكَ وَانْقَلَبُوا صَاغِرِينَ [ 119 } \"Karena itu nyatalah yang benar dan batallah yang selalu mereka kerjakan [ 118 ] Maka mereka kalah di tempat itu dan jadilah mereka orang-orang yang hina [ 119 ]\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Kemudian Kami memberi wahyu Musa dan memerintahkannya untuk melemparkan tongatnya, seketika dengan cepat tongkat itu menelan tali dan tongkat yang mereka tutupi dengan tipu muslihat. Dinamakan kebohongan (tipuan) karena sebenarnya tidak ada yang benar dalam sihir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami wahyukan kepada Musa,“Lemparkanlah tongkatmu!” Maka tiba-tiba tongkat itu menelan} menelan {kepalsuan mereka} apa yang mereka rekayasa dan buat-buat bahwa itu benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117 “dan kami wahyukan kepada musa “lemparkanlah tongkatmu”, maka musa melemparkannya “maka sekonyong-konyong tongkat itu menjadi” ular yang melata, maka ia menelan sulap mereka, yakni kebohongan dan kedustaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 117",
    "description": "Dan untuk menunjukkan kebesaran kami di hadapan orang banyak, kami wahyukan kepada nabi musa, lemparkanlah tongkatmu! nabi musa pun segera melemparkan tongkatnya, maka tiba-tiba tongkat itu berubah menjadi seekor ular yang bergerak dengan cepat menelan habis segala kepalsuan mereka, yakni sihir dan tipu daya yang mereka lakukan. Dengan mukjizat tongkat tersebut maka terbuktilah kebenaran yang berada di pihak nabi musa, dengan disaksikan orang banyak. Dan segala yang mereka kerjakan berupa sihir dan kepalsuan jadi sia-sia dan batal semua. Kebatilan, walau dibalut keindahan, hanya akan mengelabui sesaat, tetapi akan sirna bila berhadapan dengan kebenaran."
  }
]