[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka nyatalah yang benar dan menjadi jelas bagi orang yang menyaksikan dan menghadirinya tentang kebenaran musa dan bahwa dia sesungguhnya dia adalah utusan Allah yang mengajak kepada kebenaran. Dan lenyaplah kedustaan yang mereka perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Maka muncullah kebenaran yang nyata. Kebenaran dari ajaran yang dibawa oleh Musa -‘Alaihissalām- menjadi nyata. Dan kepalsuan dari apa yang dibuat oleh para penyihir itu pun menjadi jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Maka tampaklah kebenaran yang ada pada Musa, lenyaplah tipu daya dan sihir yang dilakukan para penyihir itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. فَوَقَعَ الْحَقُّ (Karena itu nyatalah yang benar) Yakni kebenaran menjadi terang ketika Nabi Musa mendatangkan mukjizatnya. وَبَطَلَ مَا كَانُوا۟ يَعْمَلُونَ(dan batallah yang selalu mereka kerjakan) Berupa sihir mereka. Yakni jelaslah kemungkaran kereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "115-119 1 ). Hikmah dari permintaan Musa kepada para penyihir agar mereka memulai sihir adalah : agar manusia melihat sihir para penyihiri itu , kemudian Musa mendatangkan kebenaran yang melawan semua kebodohan mereka. 2 ). Perhatikan ayat berikut : { قَالَ أَلْقُوا ۖ فَلَمَّا أَلْقَوْا سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ } \"Musa menjawab: “Lemparkanlah (lebih dahulu)!” Maka tatkala mereka melemparkan, mereka menyulap mata orang dan menjadikan orang banyak itu takut, serta mereka mendatangkan sihir yang besar (menakjubkan).\" Musuh-musuh Allah memiliki cara yang berbeda-beda untuk membodohi manusia, dan tujuan mereka sebenarnya hanya satu; tetapi apa yang mereka perbuat akan terkalahkan dengan satu kekuatan, yaitu : senantiasa konsisten di atas wahyu Allah, sebagaiman yang diperbuat oleh Musa, dan setelah itu kemenangan pasti akan di atas : { [ فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ [ 118 ] فَغُلِبُوا هُنَالِكَ وَانْقَلَبُوا صَاغِرِينَ [ 119 } \"Karena itu nyatalah yang benar dan batallah yang selalu mereka kerjakan [ 118 ] Maka mereka kalah di tempat itu dan jadilah mereka orang-orang yang hina [ 119 ]\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118. Lalu kebenaran tetap kokoh dan tampak, yaitu kebenaran Musa, dan sia-sialah sihir yang mereka buat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka terbuktilah} maka tampak dan jelas {kebenaran dan sia-sialah} lenyaplah {apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118 “karena itu nyatalah yang benar” yakni jelas dan nyata serta unggul dalam perkumpulan itu, ”dan batallah yang selalu mereka kerjakan”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 118",
    "description": "Dengan mukjizat tongkat tersebut maka terbuktilah kebenaran yang berada di pihak nabi musa, dengan disaksikan orang banyak. Dan segala yang mereka kerjakan berupa sihir dan kepalsuan jadi sia-sia dan batal semua. Kebatilan, walau dibalut keindahan, hanya akan mengelabui sesaat, tetapi akan sirna bila berhadapan dengan kebenaran. Dengan kejadian tersebut maka mereka, yakni para penyihir dikalahkan di tempat itu di hadapan orang banyak. Dan karena telah dipermalukan dengan kekalahan itu maka berbaliklah mereka menjadi orang-orang yang hina, setelah sebelumnya tampil dengan penuh kesombongan dan yakin akan meraih kemenangan dan kemuliaan. Mereka merasa sangat terhina dengan kekalahan ini."
  }
]