[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman sebagai pengingkaran kepada iblis yang menolak untuk bersujud, ”apakah yang menghalangimu untuk bersujud ketika aku perintahkan engkau?” iblis menjawab, ”Aku lebih baik daripada dia dalam asal penciptaan, sebab aku diciptakan dari api, sedang dia diciptakan dari tanah,” iblis memandang api lebih mulia daripada tanah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Allah -Ta'ālā- mencela sikap Iblis dengan firman-Nya, “Apa yang membuatmu enggan melaksanakan perintah-Ku bersujud kepada Adam?” Iblis menjawab firman Rabbnya dengan mengatakan, “Aku enggan bersujud kepadanya karena aku lebih baik darinya. Engkau menciptakan aku dari api dan menciptakannya (Adam) dari tanah. Dan api lebih mulia dari tanah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-13. Maka Allah mengingkari dan mengoloknya dengan berfirman: “Apa yang menghalangimu untuk bersujud kepada Adam ketika Aku memerintahkanmu melakukan itu?” Iblis menjawab dengan penuh kesombongan: “Aku lebih baik daripada Adam, karena Engkau menciptakanku dari api, sedangkan Engkau ciptakan Adam dari tanah.” Maka Allah memerintahkan agar dia diusir dari surga: “Keluarlah dari surga; kamu sama sekali tidak layak untuk tinggal di surga sedangkan kamu berpaling dari ketaatan-Ku.” Dan Allah menegaskan bahwa perintah-Nya agar dia keluar dari surga merupakan siksaan baginya, agar dia menjadi termasuk orang-orang yang hina akibat kesombongannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. قَالَ مَا مَنَعَكَ أَلَّا تَسْجُدَ (Allah berfirman: “Apakah yang menghalangimu untuk bersujud) Pertanyaan ini sebagai penegakkan hujjah atas dirinya, dan untuk mencela dan menjelekkan perbuatannya itu, karena Allah sebenarnya Maha Mengetahui mengapa ia tidak mau bersujud. قَالَ أَنَا۠ خَيْرٌ مِّنْهُ (Menjawab iblis “Saya lebih baik daripadanya) Yang menghalanginya untuk bersujud adalah pengakuan dan anggapannya bahwa ia lebih mulia dibandingkan Adam, serta keingkarannya bagaimana makhluk seperti dia disuruh untuk bersujud kepada makhluk seperti Adam. خَلَقْتَنِى مِن نَّارٍ وَخَلَقْتَهُۥ مِن طِينٍ (Engkau ciptakan saya dari api sedang dia Engkau ciptakan dari tanah”) Anggapan darinya bahwa unsur api lebih mulia dari unsur tanah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قَالَ مَا مَنَعَكَ أَلَّا تَسْجُدَ إِذْ أَمَرْتُكَ } \"Allah berfirman: \"Apakah yang menghalangimu untuk bersujud (kepada Adam) di waktu Aku menyuruhmu?\" , { قَالَ يَا إِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ السَّاجِدِينَ } \"Allah berfirman: “Hai iblis, apa sebabnya kamu tidak (ikut sujud) bersama-sama mereka yang sujud itu?” [ Al-Hijr : 32 , { قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ } \"Allah berfirman: “Hai iblis, apakah yang menghalangi kamu sujud kepada yang telah Ku-ciptakan dengan kedua tangan-Ku\" [ Shad : 75 ] , perbedaan konteks di setiap ayat menunjukkan bahwa yang dilaknat telah melakukan dalam maksianya tiga macam maksiat sekaligus, yaitu : melanggar perintah, meninggalkan jamaah, dan meyombongkan diri dan meremehkan penciptaan Adam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Allah berfirman kepada Iblis untuk menanyakan hujjah dan menghinanya, karena Allah mengetahui hal itu: “Apakah yang menghalangimu untuk bersujud kepada Adam saat Aku memerintahkanmu untuk bersujud?” Iblis berkata: “Aku lebih mulia dari Adam. Engkau menciptakanku dari api, sedangkan dia dari tanah. Unsur yang terkandung dalam api berupa keluhuran dan cahaya itu lebih mulia daripada tanah yang mengandung kegelapan dan tidak berubah (statis)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Apakah yang menghalangimu sehingga tidak bersujud ketika Aku memerintahmu?” Iblis menjawab, “Aku lebih baik daripada dia. Engkau menciptakanku dari api, sedangkan dia Engkau ciptakan dari tanah.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. maka Allah mencelanya karena itu, Dia berfirman, mengapa kamu menolak bersujud kepada dia yang telah aku ciptakan dengan kedua tanganku. Yakni aku memuliakannya dan memberinya keutamaan dengan keutamaan yang tdak diberikan kepada selainnya. Kamu mendurhakai perintahKu dan meremehkanKu “dia berkata” iblis menentang tuhannya. ”saya lebih baik daripadanya” kemudian dia berdalil atas klaim yang batil ini dengan ucapannya. “engkau menciptakan saya dari api sedang dia Engkau ciptkan dari tanah” konsekuensinya adalah bahwa apa yang dia ciptakan dari api adalah lebih baik dari apa yang diciptakan dari tanah, karena api diatas tanah. Ini adalah kias paling rusak, ia batil dari berbagai segi; Diantaranya bahwa ia merupakan bentuk penentangan terhadap perintah sujud dari Allah dan suatu kias yang bertentangan dengan dalil adalah kias batil, karena maksud dari kias adalah menjadikan hukum yang tidak ada dalil padanya mendekati perkara yang ada dalil padanya dan mengikutinya, adapun kias yang bertabrakan dengannya yang jika dia diambil maka ia berkonsekuensi dibuangnya dalil, maka ini merupakan kias yang paling buruk. Diantaranya juga bahwa ucapannya, “saya lebih baik dari padanya” sudah cukup sendirinya menunjukkan kekurangan iblis yag busuk, karena ia telah membuktikan kekurangannya dengan ujub dan takaburnya. Berbicara atas nama Allah tanpa ilmu, adakah kekurangan yang lebih besar dari ini? Diantaranya juga bahwa dia telah berdusta dan mengunggulkan api diatas tanah, karena tanah mengandung ketenangan, ketentraman dan keseimbangan. Darinya muncul keberkahan bumi dari pohon-pohonan dan berbagai macam tanaman dengan berbagai jenis macamnya. lain halnya dengan api, ia membakar mudah terombang-ambing dan ceroboh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 12: Kata-kata Iblis ini nampak seakan-akan benar, padahal sebenarnya salah, karena tanah lebih baik daripada api. Kebiasaan api adalah membakar, merusak, keadaannya tidak kokoh (goyang) dan cepat (terburu-buru). Sedangkan keadaan tanah adalah tenang, mudah diolah dan bermanfaat sehingga dapat menumbuhkan tanaman. Oleh karena itu, Adam ‘alaihis salam yang diciptakan dari tanah lebih mudah rujuk (kembali kepada Allah), bertobat, tunduk kepada perintah Allah, mengakui kesalahan dan meminta ampunan-Nya. Berbeda dengan Iblis yang malah semakin sombong dan angkuh. Dari sinilah diketahui bahwa jika seseorang terkena fitnah syahwat lebih mudah kembali daripada terkena fitnah syubhat. Selain itu, perkataan Iblis di atas merupakan qiyas yang paling rusak, karena qiyas tersebut digunakan untuk menentang perintah Alah Ta’ala, sedangkan qiyas apabila berbenturan dengan nash, maka qiyas tersebut batil. Hal itu, karena tujuan dari qiyas adalah agar hukum yang tidak ada nashnya mendekati kepada perkara yang ada nashnya, sehingga mengikutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 12",
    "description": "Allah mempertanyakan alasan penolakan iblis untuk sujud kepada adam. Dia berfirman, apakah yang menghalangimu untuk menghormati adam sehingga kamu tidak bersujud kepadanya ketika aku menyuruhmu' dengan penuh angkuh dan sombong, iblis menjawab, aku tidak pantas bersujud kepadanya karena aku lebih baik daripada dia sehingga aku tidak wajar bersujud kepadanya. Engkau ciptakan aku dari api, sedangkan dia engkau ciptakan dari tanah, dan api lebih baik daripada tanah. Ucapan iblis ini merupakan cerminan keangkuhan dan kesombongannya. Menanggapi kedurhakaan dan sikap iblis, Allah langsung menyuruhnya keluar dari surga. Allah berfirman, maka karena kesombongan dan pembangkanganmu, turunlah kamu darinya, yakni dari dalam surga, karena apa pun alasanmu kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah kamu dari surga ini, karena sesung-guhnya kamu termasuk makhluk yang hina."
  }
]