[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, ”Kami beriman kepada penguasa alam semesta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Para penyihir berkata, “Kami beriman kepada Rabb yang menciptakan segenap makhluk.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "121-122. Mereka tidak hanya bersujud, namun mereka juga menyampaikan bahwa sujud yang mereka lakukan adalah untuk Allah, Tuhan semesta alam; dan menjelaskan bahwa Dia adalah Tuhan Musa dan Harun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121-122. رَبِّ مُوسَىٰ وَهٰرُونَ قَالُوٓا۟ ءَامَنَّا بِرَبِّ الْعٰلَمِينَ (Mereka berkata: “Kami beriman kepada Tuhan semesta alam (yaitu) Tuhan Musa dan Harun) Mereka berterus terang bahwa mereka beriman kepada Tuhan semesta alam, Tuhan Musa dan Harun agar tidak ada dari pengikut Fir’aun yang beranggapan bahwa sujud itu diperuntukkan bagi Fir’aun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "121-122 Setelah mereka disujudkan oleh mukjizat Musa, mereka kemudian berkata : { آمَنَّا بِرَبِّ الْعَالَمِينَ } \"Kami beriman kepada Tuhan semesta alam\" dengan lafazh ini mereka menafikan segala tuduhan bahwa mereka sujud untuk Musa, sebagaiman kebiasan yang mereka perbuat kepada Musa, selanjutnya mereka bertutur : { رَبِّ مُوسَىٰ وَهَارُونَ } \"(yaitu) Tuhan Musa dan Harun\" ayat ini memperkuat bahwa sujud itu hanya kepada Allah yang esa, dan bukan kepada manusia hina yang menamakan dirinya sebagai tuhan : { فَقَالَ أَنَا رَبُّكُمُ الْأَعْلَىٰ } \"(Seraya) berkata: “Akulah tuhanmu yang paling tinggi\" [ An-Nazi'at : 24 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121-122. Mereka berkata: “Kami beriman hanya kepada Allah, tiada sekutu bagiNya, Tuhan manusia dan jin, juga Tuhannya Musa dan Harun” sampai tidak ada satupun yang berpikiran untuk sujud kepada Fir’aun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kami beriman kepada Tuhan alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120-122 orang yang paling jelas mengetahui kebenaran yang agung adalah orang-orang yang berpikiran obyektif dan ahli sihir yang mengetahui macam-macam sihir dan detail-detailnya yang tidak diketahui oleh selain mereka. Mereka mengetahui bahwa itu adalah mukjizat besar dari Allah, tak ada yang mampu menandinginya, maka ”ahli-ahli sihir itu serta merta meniarapkan diri dengan bersujud. Mereka berkata ’kami beriman kepada Rabb semesta alam (yaitu) Rabb musa dan harun’ yakni, kami membenarkan ayat-ayat yang jelas yang dibawa oleh musa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 121",
    "description": "Dalam keadaan sujud, mereka (para pesihir) berkata, kami hanya beriman kepada tuhan pencipta dan pemelihara seluruh alam. Agar fir'aun atau lainnya tidak salah paham siayaitu tuhan pencipta dan pemelihara yang diyakini dan diimani oleh nabi musa dan nabi harun."
  }
]