[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu tuhan Musa dan harun. Dialah yang seharusnya ditunjukan seluruh jenis ibadah kepadaNYa semata, bukan kepada selainNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Yaitu Rabbnya Musa dan Harun -‘Alaihimassalām-. Hanya Dia lah yang berhak disembah. Bukan sembahan-sembahan lain yang dianggap sebagai tuhan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "121-122 Setelah mereka disujudkan oleh mukjizat Musa, mereka kemudian berkata : { آمَنَّا بِرَبِّ الْعَالَمِينَ } \"Kami beriman kepada Tuhan semesta alam\" dengan lafazh ini mereka menafikan segala tuduhan bahwa mereka sujud untuk Musa, sebagaiman kebiasan yang mereka perbuat kepada Musa, selanjutnya mereka bertutur : { رَبِّ مُوسَىٰ وَهَارُونَ } \"(yaitu) Tuhan Musa dan Harun\" ayat ini memperkuat bahwa sujud itu hanya kepada Allah yang esa, dan bukan kepada manusia hina yang menamakan dirinya sebagai tuhan : { فَقَالَ أَنَا رَبُّكُمُ الْأَعْلَىٰ } \"(Seraya) berkata: “Akulah tuhanmu yang paling tinggi\" [ An-Nazi'at : 24 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121-122. Mereka berkata: “Kami beriman hanya kepada Allah, tiada sekutu bagiNya, Tuhan manusia dan jin, juga Tuhannya Musa dan Harun” sampai tidak ada satupun yang berpikiran untuk sujud kepada Fir’aun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhannya Musa dan Harun.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120-122 orang yang paling jelas mengetahui kebenaran yang agung adalah orang-orang yang berpikiran obyektif dan ahli sihir yang mengetahui macam-macam sihir dan detail-detailnya yang tidak diketahui oleh selain mereka. Mereka mengetahui bahwa itu adalah mukjizat besar dari Allah, tak ada yang mampu menandinginya, maka ”ahli-ahli sihir itu serta merta meniarapkan diri dengan bersujud. Mereka berkata ’kami beriman kepada Rabb semesta alam (yaitu) Rabb musa dan harun’ yakni, kami membenarkan ayat-ayat yang jelas yang dibawa oleh musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 122: Karena mereka mengetahui bahwa apa yang mereka saksikan bukanlah berasal dari sihir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 122",
    "description": "Yaitu tuhan pencipta dan pemelihara yang diyakini dan diimani oleh nabi musa dan nabi harun. Melihat itu, fir'aun pun terkejut dan naik pitam. Fir'aun berkata, mengapa kamu beriman kepadanya sebelum aku memberi izin kepadamu' tanpa menanyakan terlebih dahulu sebab mereka beriman, fir'aun melontarkan tuduhan, sesungguhnya ini benar-benar tipu muslihat yang telah kamu rencanakan bersama musa dan harun di kota ini, yakni mesir, untuk mengusir penduduknya. Ia pun mengancam mereka, kelak kamu akan mengetahui apa yang akan aku lakukan untuk kamu, sebagai akibat perbuatanmu dengan beriman kepada musa dan harun, serta sebagai siksaan dari persekongkolan dan tipu muslihat yang kalian lakukan. Begitulah, penguasa tiran akan mengancam bila tersudut dan terpojokkan."
  }
]