[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada para tukang sihir, ”Apakah kalian beriman kepada Allah sebelum aku izinkan kepada kalian untuk beriman kepada Nya? sesungguhnya keimanan kalian kepada Allah dan kepercayaan kalian terhadap Musa, serta penetapan kalian atas kenabiannya hanyalah satu bentuk rekayasa yang kalian rencanakan bersama Musa agar kalian dapat mengusir pendududk kota kalian ini darinya, kemudian kalian menjadi orang-orang yang memonopoli kebaikan-kebaikan yang ada di kota ini. Kalain (wahai para tukang sihir), akan tahu siksaan dan hukuman yang akan menimpa kalian (dariku)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Setelah para penyihir itu menyatakan beriman kepada Allah semata, Fir’aun langsung mengancam mereka dengan mengatakan, “Kalian menyatakan beriman kepada Allah sebelum aku mengizinkan kalian untuk beriman kepada-Nya? Sesungguhnya pernyataan kalian untuk beriman kepada-Nya dan percaya kepada ajaran yang dibawa oleh Musa pasti sebuah rekayasa serta tipu daya yang kalian rencanakan bersama Musa untuk mengusir penduduk kota ini. Kalian -wahai para penyihir- akan segera tahu apa hukuman yang akan kalian terima.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "123. Maka Fir’aun berkata dengan penuh keingkaran dan keheranan atas keimanan para penyihir itu: “Apakah kalian beriman kepada Tuhan Musa dan Harun sebelum aku memerintahkanmu untuk itu?” Dengan kesombongan dan kebodohannya, dia merasa bahwa mengimani kebenaran harus mendapat izin darinya terlebih dahulu. Kemudian dia menuduh mereka tidak ikhlas dalam beriman kepada Tuhan Musa dan Harun agar dia dapat memalingkan orang-orang dari para penyihir itu, dia berkata: “Kalian beriman kepada Tuhan Musa dan Harun bukan atas kerelaan dari kalian; namun itu hanyalah tipu daya yang kalian buat bersama Musa sebelum kalian saling menampakkan sihir, agar para penduduk Mesir keluar darinya dan kalian dapat terbebas dan dapat membebaskan Bani Israil.” Kemudian Fir’aun mengancam mereka dengan ancaman keras: “Kalian akan mengetahui akibat perbuatan kalian ini.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. قَبْلَ أَنْ ءَاذَنَ لَكُمْ ۖ (sebelum aku memberi izin kepadamu) Dan ini merupakan gambaran betapa buruk pandangannya, karena sesungguhnya keimanan kepada kebenaran tidak memerlukan izin siapun, sebab dengan keimanan itulah keselamatan seseorang dan meninggalkannya akan mengakibatkan kebinasaan. إِنَّ هٰذَا لَمَكْرٌ مَّكَرْتُمُوهُ فِى الْمَدِينَةِ (sesungguhnya (perbuatan ini) adalah suatu muslihat yang telah kamu rencanakan di dalam kota ini) Yakni tipu daya yang kalian buat dengan Musa berupa kesepakatan diantara kalian sebelumnya. لِتُخْرِجُوا۟ مِنْهَآ (untuk mengeluarkan dari padanya) Yakni dari negeri Mesir. أَهْلَهَا ۖ (penduduknya) Yakni dari kaum qibthy. Dan agar kalian dan bani Israil dapat menguasai dan menetap di negeri Mesir ini. في المدينة (di kota ini) Maknanya adalah tipu daya dan persekongkolan diantara kalian ini kalian buat di dalam kota sebelum kalian dan Musa keluar menuju padang pasir ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قَالَ فِرْعَوْنُ آمَنْتُمْ بِهِ قَبْلَ أَنْ آذَنَ لَكُمْ } \"Fir'aun berkata: \"Apakah kamu beriman kepadanya sebelum aku memberi izin kepadamu?\" kita berlindung kepada Allah dari paksaan para tughot; bahkan untuk menyatakan keimanan kepada Allah tidak dibolehkan tanpa izin dari fir'aun ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123. Fir’aun berkata kepada para penyihir itu: “Bagaimana bisa kalian beriman kepada Musa dan risalahnya sebelum aku memberi ijin kalian untuk beriman. Sesungguhnya tindakan ini adalah pemberontakan rahasia dan trik yang telah kalian susun di kota Mesir sebelum berduel supaya kalian bisa membebaskan penduduknya. Maka kalian akan mengetahui apa yang akan kalian terima akibat persekongkolan ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Fir‘aun berkata,“Mengapa kalian beriman kepadanya} kepada Musa {sebelum aku memberi izin kepada kalian .Sesungguhnya ini benar-benar tipu muslihat yang telah kalian rencanakan di kota ini} tipu daya yang kalian rencanakan bersama Musa di kota Mesir {untuk mengusir penduduknya. Kelak kamu akan mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123 “fir’aun berkata” kepada mereka dengan mengancam karena iman mereka, ”apakah kamu beriman kepadanya sebelum aku memberi izin kepadamu?”, orang busuk ini adalah penguasa otoriter yang sewenang-wenang dalam memperlakukan fisik dan pendapat rakyatnya. Telah terjadi semacam ketetapan baginya dan rakyatnya bahwa pendapatnya harus didengar dan perintahnya harus terlaksana, tak seorangpun boleh keluar dari ucapan dan hukumnya. Dengan kondisi seperti ini mental mereka merosot, akal dan tindakan mereka lemah, serta tidak mampu membela hak-hak mereka. Oleh karena itu, Allah berfirman ”maka fir’aun mempengaruhi kaumnya (dengan perkataan itu ) lalu mereka patuh kepadanya.” Di sini dia berkata “apakah kamu beriman kepadanya sebelum aku memberi izin kepadamu?” ini adalah sikap tidak beradab dari kalian dan pembangkangan terhadapku, kemudian dia berisyarat kepada kaumnya dengan berkata, ”sesungguhnya (perebuatan) ini adalah suatu muslihat yang telah kamu rencanakan di dalam kota ini, untuk mengeluarkan penduduknya dari padanya.” Yakni sesungguhnya musa adalah pemimpinmu yang mengajarkan sihir, kamu telah bersepakat dengannya dimana seakan-akan kalian tunduk padanya lalu dia menang dan kamu mengikutinya, kemudian orang-orang atau mayoritas dari mereka mengikutimu , lalu kamu mengusir penduduknya darinya. Ini adalah kedustaan yang dia sendiri dan orang-orang yang mengetahui situasi, mengetahui bahwa Musa tidak bersekongkol dengan siapa pun dari mereka. Bahwa mereka itu dikumpulkan menurut perintah Fir’aun melalui kaki tangannya. Bahwa apa yang dibawa oleh Musa adalah mukjizat ilahiyyah. Bahwa ahli sihir itu telah mengeluarkan segala kemampuan mereka untuk mengalahkan Musa namun mereka kalah lalu kebenaran menjadi jelas bagi mereka dan mereka pun mengikutinya. Kemudian Fir’aun mengancam mereka dengan mengatakan ”kelak kamu akan mengetahui (akibat perbuatan ini)” yakni hukuman yang aku siapkan untukmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 123: Inilah kedustaan Fir’aun, padahal para pesihir sebelumnya telah bersusah payah mengorbankan tenaga mereka untuk mengalahkan Nabi Musa ‘alaihis salam, namun mereka kalah dan kebenaran terbukti, lalu mereka pun mengikutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 123",
    "description": "Melihat itu, fir'aun pun terkejut dan naik pitam. Fir'aun berkata, mengapa kamu beriman kepadanya sebelum aku memberi izin kepadamu' tanpa menanyakan terlebih dahulu sebab mereka beriman, fir'aun melontarkan tuduhan, sesungguhnya ini benar-benar tipu muslihat yang telah kamu rencanakan bersama musa dan harun di kota ini, yakni mesir, untuk mengusir penduduknya. Ia pun mengancam mereka, kelak kamu akan mengetahui apa yang akan aku lakukan untuk kamu, sebagai akibat perbuatanmu dengan beriman kepada musa dan harun, serta sebagai siksaan dari persekongkolan dan tipu muslihat yang kalian lakukan. Begitulah, penguasa tiran akan mengancam bila tersudut dan terpojokkan. Melihat mereka tidak kembali dan tetap teguh dengan keimanan mereka, fir'aun lanjut mengancam, aku bersumpah demi kekuasaanku, pasti akan aku potong tangan dan kakimu dengan bersilang; tangan kanan dan kaki kiri atau sebaliknya, kemudian dengan keadaan yang menyeramkan ini, aku benar-benar akan menyalib kamu semua, tanpa terkecuali, dengan mengikat kaki dan tangan kamu di batang pohon kurma. Itu semua dilakukan agar menjadi peringatan bagi siapa yang hendak menipu dan melawan kekuasaan fir'aun."
  }
]