[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku benar-benar akan memotong tangan-tangan dan kaki-kaki kalian (wahai tukang-tukang sihir) secara bersilang; dengan memotong tangan kiri dan kaki kanan. Kemudian aku sungguh-sungguh akan menggantung kalian pada batang pohon kurma, untuk menghukum kalian dan penakut-nakut manusia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Sungguh, aku benar-benar akan memotong tangan kanan kalian dan kaki kiri kalian, atau tangan kiri kalian dan kaki kanan kalian. Kemudian aku akan menggantung kalian semua di pohon kurma sebagai hukuman bagi kalian dan agar menjadi pelajaran bagi siapa saja yang melihat kalian dalam keadaan seperti itu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124. Sungguh aku akan memotong anggota tubuh kalian secara menyilang, seperti memotong tangan kanan dan kaki kiri; kemudian aku akan menyalib kalian semua dengan kejam, sebagai siksaan bagi kalian dan orang-orang yang semacam kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلٰفٍ (sesungguhnya aku akan memotong tangan dan kakimu dengan bersilang secara bertimbal balik) Yakni kaki kanan dan tangan kiri milik setiap kalian, atau kaki kiri dan tangan kanan. ثُمَّ لَأُصَلِّبَنَّكُمْ(kemudian sungguh-sungguh aku akan menyalib kamu) Di atas batang pohon kurma."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124. Sungguh aku akan memotong tangan kanan dan kaki kiri serta sebaliknya dari masing-masing kalian, kemudian aku akan menyalib kalian di batang kurma sampai mati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh aku akan memotong tangan dan kaki kalian dengan bersilang} setiap sisi anggota badan bertentangan dengan yang lain {kemudian sungguh aku akan menyalib”} Sungguh aku akan menggantung kalian di atas batang pohon kurma {kalian semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124 “sesungguhnya aku akan memotong tangan dan kakimu dengan bersilang secara bertimbal balik” Orang busuk ini mengklaim bahwa mereka sebagai perusak di muka bumi, dimana dia akan memperlakukan mereka layaknya orang-orang yang merusak, dipotong tangan dan kaki secara bersilang seling yakni tangan kanan dan kaki kiri. ”kemudian sungguh sungguh aku akan menyalibmu” di batang pohon kurma agar kamu kapok -menurut anggapannya- “semua”. Yakni aku memperlakukan ini tidak hanya kepada beberapa orang saja, akan tetapi semuanya akan mendapatkan siksaan ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 124",
    "description": "Melihat mereka tidak kembali dan tetap teguh dengan keimanan mereka, fir'aun lanjut mengancam, aku bersumpah demi kekuasaanku, pasti akan aku potong tangan dan kakimu dengan bersilang; tangan kanan dan kaki kiri atau sebaliknya, kemudian dengan keadaan yang menyeramkan ini, aku benar-benar akan menyalib kamu semua, tanpa terkecuali, dengan mengikat kaki dan tangan kamu di batang pohon kurma. Itu semua dilakukan agar menjadi peringatan bagi siapa yang hendak menipu dan melawan kekuasaan fir'aun. Ancaman itu tidak membuat mereka gentar sedikit pun. Keimanan sudah sangat merasuk ke dalam kalbu mereka. Mereka para pesihir menjawab, sesungguhnya kami hanya akan kembali kepada tuhan pemelihara kami, menemui-Nya dengan kematian, dalam naungan rahmat dan kenikmatan ganjaran-Nya. Demikianlah, orang beriman tidak akan merasa gentar menghadapi ancaman dan penderitaan apa pun."
  }
]