[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Engkau tidaklah mencela dan mengingkari sesuatu dari kami (wahai fir’aun) selain keimanan kami dan kepercayaan kami terhadap hujjah-hujjah tuhan kami dan bukti-bukti kebenaran yang dibawa oleh Musa, yang engkau tidak kuasa untuk mendatangkan hal serupa dengannya begitupun orang lain selain Allah, Dzat yang memiliki keraajaan langit dan bumi. Wahai tuhan kami, limpahkan kepada kami kesabaran besar dan keteguhan di atasnya, dan wafatkanlah kami dalam keadaaan tunduk kepada perintahMu, dan mengikuti petunjuk RasulMu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Dan kamu -wahai Fir’aun- tidak mengingkari sikap kami dan menemukan kesalahan kami melainkan lantaran kami beriman kepada mukjizat (bukti-bukti) dari Rabb kami ketika mukjizat (bukti-bukti) itu datang kepada kami melalui Musa. Jika hal ini dianggap dosa yang patut dicela, maka itulah dosa kami.” Kemudian mereka mamanjatkan doa kepada Allah dengan khusyuk seraya berkata, “Wahai Rabb kami, berilah kami kesabaran yang berlimpah agar kami bertahan di atas kebenaran. Matikanlah kami sebagai orang-orang yang berserah diri kepada-Mu, tunduk kepada perintah-Mu dan mengikuti utusan-Mu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126. Kemudian mereka menjelaskan sebab mengapa dia akan menyiksa mereka: “Kamu tidak membenci dan menghina kami kecuali karena keimanan kami kepada Allah, padahal itu adalah kebaikan kami yang paling besar, karena itu adalah sebaik-baik perbuatan dan seagung-agung sifat. Oleh sebab itu, kami tidak akan meninggalkannya hanya demi mendapat keridhaanmu.” Lalu mereka pergi meninggalkan Fir’aun seraya berdoa kepada Allah dengan penuh ketundukan: “Berikanlah kami kesabaran yang luas agar kami dapat teguh di atas agama-Mu, dan matikanlah kami dalam keadaan berserah diri kepada-Mu, mentaati perintah dan larangan-Mu, dan meridhai ketetapan-Mu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "126. وَمَا تَنقِمُ مِنَّآ (Dan kamu tidak menyalahkan kami) Kamu tidak menyalahkan dan mengingkari kami. إِلَّآ أَنْ ءَامَنَّا بِـَٔايٰتِ رَبِّنَا لَمَّا جَآءَتْنَا ۚ( melainkan karena kami telah beriman kepada ayat-ayat Tuhan kami ketika ayat-ayat itu datang kepada kami”) Padahal ini merupakan kemuliaan yang besar dan kebaikan yang sempurna serta layak untuk mendapat pujian yang baik, bukan sebaliknya mendapat pengingkaran dan siksa. Setelah itu mereka meninggalkan percakapan dengan Fir’aun dan mulai bermunajat kepada Yang Maha Tinggi sambil menyerahkan perkara mereka kepada-Nya dengan perkataan رَبَّنَآ أَفْرِغْ عَلَيْنَا صَبْرًا. رَبَّنَآ أَفْرِغْ عَلَيْنَا صَبْرًا(“Ya Tuhan kami, limpahkanlah kesabaran kepada kami) Yakni curahkanlah kesabaran kepada kami agar memenuhi dan meliputi jiwa kami. Mereka memohon bentuk kesabaran yang paling dalam sebagai persiapan menghadapi siksaan yang akan menimpa mereka serta pengokoh jiwa mereka agar tetap teguh diatas kebenaran dan keimanan. وَتَوَفَّنَا مُسْلِمِينَ (dan wafatkanlah kami dalam keadaan berserah diri (kepada-Mu)”) Yang tidak tergelincir, terpeleset, dan terkena cobaan dalam keimanannya. Salah seorang ahli tafsir, Imam as-Suddy berkata: maka Fir’aun memotong tangan dan kaki mereka serta membunuh mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126. Kamu tidak akan menyalahkan dan mengingkari kami kecuali karena keimanan kami terhadap ayat-ayat Tuhan yang didatangkan melalui tangan Musa. Ini adalah suatu penghargaan yang agung. Tuhan kami telah memberikan kesabaran yang membanjiri (hati) kami saat disiksa, yaitu memberi kami kesabaran yang melimpah supaya kami tidak kembali kufur dan wafat tetap di jalan Islam seraya tunduk hanya kepadaMu tanpa menyimpang dan berpaling"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu tidak menghukum kami} kamu tidak mengingkari dan membenci kami {kecuali karena kami beriman kepada ayat-ayat Tuhan kami ketika ayat-ayat itu datang kepada kami. “Ya Tuhan kami limpahkanlah} limpahkanlah dan curahkanlah {kesabaran kepada kami dan matikanlah kami dalam keadaan muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126 \"dan kamu tidak menyalahkan kami“ yakni kamu tidak mencela kami atas pengingkaranmu kepada kami dan ancamanmu kepada kami, kami tidak mempunyai dosa, ”melainkan karena kami telah beriman kepada ayat-ayat Rabb kami ketika ayat-ayat itu datang kepada kami”. jika ini memang dosa yang dicela atasnya dan pelakunya berhak atas hukuman, maka ini adalah dosa kami. kemudian mereka memohon kepada Allah agar memberi mereka keteguhan dan kesabaran, mereka berkata “ya rabb kami limpahkanlah kesabaran kepada kami” yakni kesabaran yang besar. ini ditunjukan dengan bentuk nakirah karena ini adalah ujian besar yang berujung kepada kematian, maka ia memerlukan kesabaran besar agar hati tetap teguh dan orang mukmin tetap tenang dengan imannya serta agar kepanikan sirna darinya. ”dan wafatkanlah kami dalam keadaan berserah diri (kepadamu)“, yakni dalam keadaan tunduk kepada perintahmu dan mengikuti rasulMu dan yang zahir bahwa ancaman fir’aun benar-benar dilakukan kepada mereka dan bahwa Allah meneguhkan mereka di atas iman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 126: Maksudnya, “Limpahkanlah kesabaran kepada kami ketika mereka menimpakan ancaman itu, agar kami tidak berbalik kafir.” Zhahir ayat ini menunjukkan, bahwa Fir’aun melakukan apa yang diancamkan itu, dan Allah meneguhkan iman mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 126",
    "description": "Dan kami tahu betul bahwa engkau tidak menolak perbuatan kami dan melakukan balas dendam kepada kami, melainkan karena kami beriman kepada ayat-ayat tuhan pemelihara kami ketika ayat-ayat itu datang kepada kami. Oleh karena itu, apa pun yang akan kamu lakukan, kami tidak akan pernah meninggalkan keimanan kepada Allah. Kemudian, menyudahi debat dan pembicaraan dengan fir'aun, serta menyadari betapa berat dan kejamnya ancaman fir'aun, mereka berdoa, ya tuhan kami, limpahkanlah kesabaran yang tinggi kepada kami agar kami dapat menanggung semua cobaan ini dan matikanlah kami ketika tiba saat yang engkau tentukan, dalam keadaan muslim, tunduk patuh dan berserah diri kepada-Mu, tanpa tergoda oleh ancaman fir'aun. Setelah fir'aun dan kaumnya menyaksikan kemenangan nabi musa dan keimanan para pesihir kepadanya, para pemuka dari kaum fir'aun berkata, apakah engkau wahai fir'aun akan membiarkan musa dan kaumnya untuk berbuat kerusakan di negeri mesir ini dan meninggalkanmu dengan tidak menghormati dan tunduk kepadamu dan tuhan-tuhanmu tidak disembah' pertanyaan itu sangat menyentak fir'aun, lalu ia menjawab, akan kita bunuh dengan pembunuhan yang pasti lagi banyak anak-anak laki-laki mereka dan kita biarkan hidup anak-anak perempuan mereka untuk melayani kita, atau untuk disiksa dan dilecehkan, seperti yang dulu pernah kita lakukan. Dengan begitu, mereka tidak dapat menggalang kekuatan. Jangan khawatir, situasi akan terkendali dan sesungguhnya kita berkuasa penuh atas mereka sehingga dapat menguasai dan menekan mereka."
  }
]