[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka para pemimpin dan para pembesar-pembesar dari kaum fir’aun berkata kepada fir’aun, ”Apakah engkau akan membiarkan musa dan para pengikutnya dari bani israil untuk merusak manusia di negeri mesir dengan mengubah keyakinan mereka dengan beribadah kepada Allah semata dan tiada sekutu bagiNya, dan meninggalkan penyembahan kepadamu dan penyembahan kepada tuhan-tuhanmu?” fir’aun menjawab ”kami akan membunuhi anak laki-laki bani israil dan membiarkan wanita-wanita mereka tetap hidup untuk menjadi pelayan. Dan sesungguhnya kami ini berkuasa penuh atas mereka dengan kekuasaan raja dan penguasa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "127. Lalu para pemuka dan pembesar kaum Fir’aun berkata kepada Fir’aun untuk menganjurkannya melakukan sesuatu kepada Musa dan para pengikutnya yang beriman, “Apakah kamu -wahai Fir’aun- akan membiarkan Musa dan kaumnya menyebarkan kerusakan di muka bumi dan meninggalkan dirimu dan tuhan-tuhanmu serta mengajak orang untuk menyembah kepada Allah semata?” Fir’aun menjawab, “Kita akan membunuh anak-anak laki-laki dari Bani Israil dan mempertahankan anak-anak perempuan mereka untuk melayani kita. Dan kita akan menguasai mereka, menindas, dan menjajah mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "127. Maka para pemuka dan petinggi kaum Fir’aun berusaha memancing emosinya dengan berkata: “Apakah kamu akan membiarkan Musa dan kaumnya bebas dan merasa aman dalam negerimu, sehingga mereka dapat berbuat kerusakan dengan mengajak orang-orang untuk masuk ke dalam agama mereka? Apakah kamu membiarkan mereka menyembah Tuhan Musa dan Harun dan tidak lagi menyembahmu dan menyembah tuhan-tuhanmu, sehingga orang lain akan melihat kelemahanmu dan kelemahan tuhan-tuhanmu itu, dan itu akan mengakibatkan kehancuran kerajaanmu?” Ini merupakan dorongan yang sangat keras, sehingga Fir’aun menjawab dengan angkuh: “Janganlah kalian takut, karena kaum Musa tidak akan mampu melakukan itu, dan kita akan memperlakukan mereka sebagaimana sebelumnya, yaitu dengan membunuh anak-anak lelaki mereka dan membiarkan hidup anak-anak perempuan mereka agar dapat kita gunakan sebagai pelayan kita dan penghinaan bagi mereka. Kita lebih unggul daripada mereka sebagaimana sebelumnya, tidak ada yang berubah; mereka adalah orang-orang lemah, sedangkan kita orang-orang kuat; mereka orang-orang hina, sedangkan kita orang-orang mulia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "127. وَقَالَ الْمَلَأُ مِن قَوْمِ فِرْعَوْنَ.....ليفسدوا في الأرض (Berkatalah pembesar-pembesar dari kaum Fir’aun….(sampai firman-Nya) untuk membuat kerusakan di muka bumi) Dengan membuat perpecahan dan kerusakan persatuan dan menganti agama yang telah ada sejak lama bagi penduduk negeri ini. وَيَذَرَكَ (dan meninggalkan kamu) Yakni apakah kamu juga akan membiarkan Musa tidak menyembahmu? وَءَالِهَتَكَ ۚ( serta tuhan-tuhanmu) Ada pendapat menyatakan bahwa dahulu Fir’aun memiliki berhala-berhala yang disembah kaumnya untuk mendekatkan diri kepadanya. Pendapat lain mengatakan bahwa dia dahulu menyembah matahari. قَالَ سَنُقَتِّلُ أَبْنَآءَهُمْ(Fir’aun menjawab: “Akan kita bunuh anak-anak lelaki mereka) Dan membiarkan hidup anak-anak perempuan mereka. وَإِنَّا فَوْقَهُمْ قٰهِرُونَ (dan sesungguhnya kita berkuasa penuh di atas mereka) Yakni mengusai mereka dengan paksa. Dan Fir’aun tidak mengetahui apa yang disiapkan Allah bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "127. Para pemimpin kaum Fir’aun berkata kepadanya: “Apakah engkau akan membiarkan Musa dan kaumnya hidup, sehingga mereka bisa berbuat kerusakan di tanah Mesir dengan mengajak orang-orang untuk menentangmu, memasukkan mereka ke dalam agamanya, meninggalkanmu dan peribadatan kepada tuhan-tuhanmu, (yaitu berhala-berhala yang dibuat Fir’aun untuk kaumnya untuk disembah agar lebih dekat dengannya, dan Fir’aun adalah sesembahan paling tinggi di bumi, tuhan di alam yang rendah, sedangkan planet-planet adalah tuhan-tuhan alam yang tinggi)” Fir’aun berkata: “Kita akan membunuh anak laki-laki mereka dan membiarkan anak-anak perempuan mereka untuk melayani kita. Sesungguhnya kita berkuasa di atas mereka, dan lebih mendominasi kemenangan atas mereka. Dan mereka itu di bawah kekuasaan kita”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para pemuka kaum Fir‘aun berkata,“Apakah kamu akan membiarkan} membiarkan {Musa dan kaumnya sehingga mereka berbuat kerusakan di bumi dan dia meninggalkanmu dan tuhan-tuhanmu} meninggalkanmu dan meninggalkan menyembah tuhan-tuhanmu {Fir‘aun menjawab,“kita akan membunuh anak-anak laki-laki mereka dan membiarkan hidup anak-anak perempuan mereka} membiarkan hidup anak-anak perempuan mereka untuk melayani {Sesungguhnya kita berkuasa penuh atas mereka.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127 Fir’aun dengan kaki tangannya dan mayoritas dari mereka yang mengikuti para pembesar di kalangan mereka telah menyombongkan diri di depan ayat-ayat Allah dan mengingkarinya karena kezhaliman dan kesombongan. Mereka berkata kepada Fir’aun dalam rangka menghasutnya agar mengazab Musa dengan alasan bahwa apa yang dibawanya adalah batil dan merupakan kerusakan di muka bumi, ”apakah kamu membiarkan musa dan kaumnya untuk membuat kerusakan di negeri ini (mesir)” dengan dakwah menyeru agar mereka beriman kepada Allah, kepada kemuliaan akhlak dan kebaikan amal yang merupakan kebaikan di muka bumi?, Justru merekalah yang berada di atas kerusakan akan tetapi orang orang zhalim bersikap masa bodoh terhadap apa yang mereka katakan. ”dan meninggalkanmu serta tuhan-tuhanmu” yakni membiarkanmu dan tuhan-tuhanmu, dia melarangmu dan menghalang-halangi manusia dari mengikutimu. Maka fir’aun menjawab mereka dengan mengatakan bahwa dia akan membiarkan Musa dengan bani israil dalam kondisi di mana mereka tidak datang berkembang, dan fir’aun dengan kaki tangannya merasa aman dari bahaya mereka. Katanya “akan kita bunuh anak laki-laki mereka dan kita biarkan hidup perempuan-perempuan mereka” yakni kita membiarkan anak-anak perempuan itu hidup kita tidak membunuhnya jika kita melakukan itu, maka kita akan aman dari kekuatan mereka yang berjumlah banyak, sisanya kita perbudak dan kita atur sesuai dengan kehendak kita. ”dan sesungguhnya kita berkuasa penuh di atas mereka” mereka tidak memiliki kemampuan untuk melepaskan diri dari hukum kita. Ini adalah puncak kesombongan, kezhaliman, dan kebengisan fir’aun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 127: Dengan mengajak orang lain kepada Allah, mengajak kepada akhlak dan amal yang mulia, di mana hal itu sesungguhnya memperbaiki bumi bukan merusaknya. Akan tetapi, orang-orang yang zalim tidak peduli terhadap kata-katanya itu. Dalam Tafsir Al Jalaalain disebutkan, bahwa Fir’aun membuatkan pula untuk mereka patung-patung kecil yang mereka sembah, dan Fir’aun berkata, “Saya adalah tuhanmu dan tuhan patung-patung itu.” Oleh karenanya ia berkata, “Saya adalah tuhanmu yang tertinggi.” Alangkah buruk apa yang diucapkannya. Yakni yang lahir. Mereka pun melakukan hal itu, sehingga Bani Israil datang mengeluh kepada Nabi Musa ‘alaihis salam. Fir’aun menyangka bahwa hukuman itu dapat membuat mereka tidak bertambah jumlahnya, dan dirinya menjadi aman. Untuk diperbudak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 127",
    "description": "Setelah fir'aun dan kaumnya menyaksikan kemenangan nabi musa dan keimanan para pesihir kepadanya, para pemuka dari kaum fir'aun berkata, apakah engkau wahai fir'aun akan membiarkan musa dan kaumnya untuk berbuat kerusakan di negeri mesir ini dan meninggalkanmu dengan tidak menghormati dan tunduk kepadamu dan tuhan-tuhanmu tidak disembah' pertanyaan itu sangat menyentak fir'aun, lalu ia menjawab, akan kita bunuh dengan pembunuhan yang pasti lagi banyak anak-anak laki-laki mereka dan kita biarkan hidup anak-anak perempuan mereka untuk melayani kita, atau untuk disiksa dan dilecehkan, seperti yang dulu pernah kita lakukan. Dengan begitu, mereka tidak dapat menggalang kekuatan. Jangan khawatir, situasi akan terkendali dan sesungguhnya kita berkuasa penuh atas mereka sehingga dapat menguasai dan menekan mereka. Ancaman fir'aun itu sampai ke telinga nabi musa dan kaumnya. Nabi musa pun melihat rasa takut pada kaumnya dan segera memompa semangat dan rasa optimisme mereka. Nabi musa berkata kepada kaumnya, mohonlah dengan sungguh-sungguh pertolongan kepada Allah dan bersabarlah dalam menghadapi tantangan dakwah dan ancaman fir'aun. Sesungguhnya bumi ini seluruhnya, baik negeri mesir ini atau lainnya, milik Allah, bukan milik fir'aun; diwariskan-Nya kepada siapa saja yang dia kehendaki di antara hamba-hamba-Nya. Memang boleh jadi itu belum terjadi dalam waktu singkat, tapi itu pasti terlaksana, dan kesudahan yang baik adalah bagi orang-orang yang bertakwa kepada Allah dengan berpegang teguh pada ajaran-ajaran-Nya. Usaha yang disertai dengan doa dan kesabaran akan berbuah kemenangan."
  }
]