[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada kaumnya (dari bani israil), ”mohonlah pertolongan kepada Allah terhadap fir’aun dan para pengikutnya, serta bersabarlah atas hal-hal buruk yang menimpa kalian pada diri kalian dan anak-anak kalian dari fir’aun. Sesungguhnya bumi ini semuanya milik Allah, Dia akan mewariskannya kepada siapa saja yang dikehendakiNYa dari hambaNya. Dan kesudahan yang baik bagi orang-orang yang bertakwa kepada Allah, lalu menjalankan semua perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Musa berpesan kepada kaumnya dengan mengatakan, “Wahai kaumku! Mintalah pertolongan hanya kepada Allah dalam mengusir kesulitan yang kalian hadapi dan mendatangkan manfaat yang kalian harapkan. Dan bersabarlah atas cobaan yang kalian hadapi. Karena bumi ini adalah milik Allah semata, bukan milik Fir’aun atau yang lainnya hingga membuatnya merasa berhak memaksakan kehendaknya di sana. Allah-lah yang memutar bumi ini di antara manusia sesuai dengan kehendak-Nya. Tetapi kesudahan yang baik di bumi ini akan menjadi milik orang-orang mukmin yang menjalankan perintah-perintah Rabb mereka dan menjauhi larangan-larangan-Nya. Kesudahan yang baik akan menjadi milik mereka walaupun mereka ditimpa berbagai macam ujian dan cobaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "128. Musa menasehati orang-orang beriman agar bersabar dalam menghadapi ancaman itu, dan dia memberi kabar gembira berupa kemenangan: “Hai kaumku, mohonlah pertolongan kepada Allah dalam segala urusan, dan bersabarlah atas cobaan ini; negeri ini bukan milik Fir’aun dan pengikutnya, namun milik Allah, Tuhan semesta alam, Dia akan mengaruniakannya kepada hamba-hamba-Nya yang Dia kehendaki. Dan telah berlaku sunnatullah bahwa kesudahan yang baik adalah bagi orang-orang yang takut kepada-Nya, menjalankan perintah-Nya, menjauhi larangan-Nya, dan tidak takut kepada selain-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. وَاصْبِرُوٓا۟ ۖ (dan bersabarlah) Atas cobaan. إِنَّ الْأَرْضَ لِلّٰهِ يُورِثُهَا مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ (sesungguhnya bumi (ini) kepunyaan Allah; dipusakakan-Nya kepada siapa yang dihendaki-Nya dari hamba-hamba-Nya) Dan ini merupakan janji dari Nabi Musa untuk kaumnya berupa kemenangan atas Fir’aun dan penikutnya, kemudian ia memberi kabar gembira bagi mereka bahwa kesudahan yang baik adalah bagi orang-orang yang bertakwa. وَالْعٰقِبَةُ لِلْمُتَّقِينَ (Dan kesudahan yang baik adalah bagi orang-orang yang bertakwa) Yakni akhir yang terpuji di dunia dan di akhirat bagi hamba-hamba-Nya yang bertakwa, yaitu Nabi Musa dan pengikutnya. Dan makna (عاقبة كل شيء) yakni kesudahan sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128. Musa berkata kepada kaumnya setelah mendengar ancaman Fir’aun dan kekhawatiran Bani Israil: “Meminta tolonglah kepada Allah dari Fir’aun dan kaumnya dan bersabarlah atas cobaan dan musibah. Sesungguhnya bumi itu milik Allah. Dia memberinya kepada orang yang dikehendaki dari hamba-hambaNya” Dia telah menjanjikan Musa suatu pertolongan atas Fir’aun dan kaumnya, dan akhir yang terpuji di dunia dan akhirat bagi orang-orang yang bertakwa dari hamba-hambaNya, yaitu Musa dan orang yang bersamanya di zaman itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata kepada kaumnya,“Mohonlah pertolongan kepada Allah dan bersabarlah. Sesungguhnya bumi milik Allah. Dia akan mewariskannya} memberikannya {kepada siapa saja yang Dia kehendaki di antara hamba-hambaNya. Hasilnya adalah bagi orang-orang yang bertakwa.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128 “maka Musa berkata kepada kaumnya” mewasiatkan kepada mereka dalam keadaan tersebut dimana mereka tidak memiliki apapun untuk melawan dengan perlawan ilahiyyah dan bantuan rabbaniyah. ”mohonlah pertolongan kepada Allah” yakni bersandarlah kepadaNya dalam meraih apa yang bermanfaat bagimu dan menolak apa yang memudaratkanmu. Percayalah kepada Allah bahwa Dia akan menyempurnakan perkaramu, ”dan bersabarlah” yakni pegang teguhlah kesabaran atas apa yang menimpamu dengan berharap kelapangan di balik ujian ini. ”sesungguhnya bumi ini kepunyaan Allah” bukan milik fir’aun bukan pula milik kaumnya sehingga mereka bisa semena-mena diatasnya. ”dipusakakanNya kepada siapa yang dikehendakiNya dari hamba-hambaNya” yakni merotasinya diantara manusia menurut hikmah dan kehendakNya akan tetapi kesudahan yang baik tetap milik orang-orang yang bertakwa. Walaupun mereka itu diuji beberapa lama berdasarkan hikmah dari Allah, tetapi kemenangan milik mereka. ”dan kesudahan yang baik” adalah untuk mereka. Ini adalah tugas seorang hamba, dimana pada waktu memiliki kemampuan dia harus melakukan cara untuk menolak gangguan orang lain dari dirinya sebatas kemampuan itu dan pada saat lemah hendaknya dia bersabar, memohon pertolongan kepada Allah dan menunggu datangnya kelapangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 128: Yakni bersandarlah kepada-Nya dalam mendatangkan manfaat dan menolak bahaya, dan percayalah kepada-Nya, bahwa Dia akan menyempurnakan urusan-Nya. Terhadap gangguan mereka. Bukan milik Fir’aun dan pengikutnya sehingga mereka berani berbuat seenaknya. Meskipun mereka diuji beberapa waktu, namun kemenangan akan diberikan kepada mereka. Allah mempergilirkan di antara manusia sesuai kehendak dan hikmah (kebijaksanaan)-Nya. Berdasarkan ayat ini, maka seorang hamba ketika mampu, hendaknya melakukan sebab yang dapat menghindarkan gangguan orang lain semampunya. Namun ketika lemah, hendaknya ia bersabar dan meminta pertolongan kepada Allah dan menunggu datangnya jalan keluar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 128",
    "description": "Ancaman fir'aun itu sampai ke telinga nabi musa dan kaumnya. Nabi musa pun melihat rasa takut pada kaumnya dan segera memompa semangat dan rasa optimisme mereka. Nabi musa berkata kepada kaumnya, mohonlah dengan sungguh-sungguh pertolongan kepada Allah dan bersabarlah dalam menghadapi tantangan dakwah dan ancaman fir'aun. Sesungguhnya bumi ini seluruhnya, baik negeri mesir ini atau lainnya, milik Allah, bukan milik fir'aun; diwariskan-Nya kepada siapa saja yang dia kehendaki di antara hamba-hamba-Nya. Memang boleh jadi itu belum terjadi dalam waktu singkat, tapi itu pasti terlaksana, dan kesudahan yang baik adalah bagi orang-orang yang bertakwa kepada Allah dengan berpegang teguh pada ajaran-ajaran-Nya. Usaha yang disertai dengan doa dan kesabaran akan berbuah kemenanganmeski nabi musa telah membesarkan hati mereka dan menyampaikan janji pertolongan Allah, kaumnya masih saja menyampaikan keluhan. Dengan nada mengeluh dan sedih, mereka kaum nabi musa berkata, dulu kami telah ditindas oleh fir'aun dan rezimnya dengan membunuh, menindas dan melecehkan kami sebelum engkau datang sebagai utusan tuhan kepada kami, dan kini setelah engkau datang sebagai utusan-Nya kami pun dianiaya juga, lalu kapan kita akan menang, sebab keadaan semakin memburuk. Untuk memberi harapan dan menanamkan optimisme kepada kaumnya, nabi musa menjawab, mudah-Mudahan dengan karunia-Nya, berkat keteguhan dan kesabaran kamu, tuhanmu membinasakan musuhmu yang telah menghina dan menyiksa kamu dengan zalim dan tuhanmu akan menjadikan kamu khalifah penguasa di bumi; lalu sebagai bentuk ujian, dia akan melihat bagaimana perbuatanmu setelah penobatan kamu sebagai khalifah-Nya: adakah kamu mensyukuri nikmat-nikmat-Nya, atau malah mengingkari-Nya' adakah kamu akan memakmurkan bumi atau merusaknya' dengan ukuran itulah Allah."
  }
]