[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum musa (dari kalangan bani israil) berkata kepada nabi mereka, Musa , ”kami telah mengalami malapetaka dan tertindas dengan disembelihnya anak laki-laki kami dan dibiarkannya anak perempuan kami hidup di bawah kekuasaan fir’aun dan para pengikutnya, sebelum engkau datang kepada kami dan pasca kedatanganmu ke tengah kami.” Musa berkata kepada mereka, ”Mudah-mudahan tuhan kalian membinasakan musuh-musuh kalain, fir’aun dan para pengikutnya, dan menjadikan kalian berkuasa di bumi mereka setelah kebinasaan mereka. Maka Allah akan melihat apa yang akan kalian perbuat ;apakah kalian akan bersyukur atau malah ingkar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "129. Kaum Musa dari kalangan Bani Israil berkata kepada Musa -‘Alaihissalām-, “Wahai Musa! Kami mendapatkan cobaan melalui Fir’aun yang membunuh anak-anak laki-laki kami dan mempertahankan anak-anak perempuan kami sebelum dan sesudah kamu datang kepada kami.” Lalu Musa -‘Alaihissalām- menasihati mereka dan memberikan kabar gembira kepada mereka akan adanya jalan bagi mereka, “Mudah-mudahan Rabb kalian segera membinasakan musuh kalian, Fir’aun dan para pengikutnya. Dan sesudah itu mudah-mudahan Allah memberikan tempat yang layak bagi kalian di bumi ini. Kemudian Dia akan melihat perbuatan kalian, apakah kalian akan bersyukur ataukah kufur.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "129. Namun mereka menyikapi nasehat Musa dengan keluh kesah yang menunjukkan kelemahan iman mereka: “Hai Musa, Fir’aun telah menyiksa kami sebelum kamu mendatangi kami dengan membawa risalah, begitu pula setelahnya sebagaimana yang kamu lihat.” Musa menjawab: “Semoga Tuhan kalian membinasakan musuh kalian, Fir’aun yang selalu memusuhi kalian dan menyiksa kalian dengan siksaan yang berat; dan semoga Dia menjadikan kalian sebagai khalifah di bumi setelah kebinasaan Fir’aun dan para pengikutnya. Maka fikirkanlah apa yang akan kalian lakukan jika kalian telah mendapat kejayaan? Karena menjadikan kalian berkuasa di bumi setelah kebinasaan mereka bukan merupakan bentuk pilih kasih bagi kalian, namun itu adalah ujian dan cobaan; jika kalian melakukan kebaikan maka Allah akan menambah karunia bagi kalian, namun jika kalian melakukan keburukan maka kesudahan kalian akan seperti kesudahan para musuh kalian itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "129. قَالُوٓا۟ أُوذِينَا مِن قَبْلِ أَن تَأْتِيَنَا (Kaum Musa berkata: “Kami telah ditindas (oleh Fir’aun) sebelum kamu datang kepada kami) Yakni sebelum kamu datang kepada kami sebagai Rasul, yaitu dengan pembunuhan anak-anak kami oleh Fir’aun di masa kelahiranmu. وَمِنۢ بَعْدِ مَا جِئْتَنَا ۚ( dan sesudah kamu datang) Sebagai Rasul, yaitu dengan pembunuhan anak-anak kami saat ini. Pendapat lain mengatakan maknanya adalah kami disiksa sebelum kamu datang kepada kami dengan menjadikan kami pekerja dalam pekerjaan yang berat tanpa mendapat upah, dan dengan keadaan kami sekarang yang takut atas diri kami, anak-anak, dan keluarga kami. وَيَسْتَخْلِفَكُمْ فِى الْأَرْضِ (dan menjadikan kamu khalifah di bumi) Ini merupakan penjelasan dari isyarat yang diberikan sebelumnya bahwa bumi ini adalah kepunyaan Allah. Yakni Allah akan menjadikan kalian kekuasaan dan kerajaan di bumi. فَيَنظُرَ كَيْفَ تَعْمَلُونَ(maka Allah akan melihat bagaimana perbuatanmu) Apakah kalian akan menjadi seperti Fir’aun dan kaumnya, atau menjadi seperti apa yang diridhai Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "129. Bani Israil berkata kepada Musa: “Sungguh Kami telah diberi ujian yang sangat berat dengan dibunuhnya anak laki-laki kami dan dihinakannya kami oleh mereka sebelum kamu datang sebagai rasul kepada kami, begitu juga setelah kamu datang sebagai rasul dengan tetap membunuh anak laki-laki dan menyebar teror” Musa berkata kepada mereka: “Barangkali Tuhan kalian akan membinasakan musuh kalian, yaitu Fir’aun dan kaumnya, dan menjadikan kalian khalifah di bumi setelah mereka, lalu perintah dan kekuasaan itu menjadi milik kalian, lalu Dia (Allah) akan melihat bagaimana perbuatan kalian, dalam ketaatan atau kemaksiatan?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kami telah ditindas} diuji {sebelum kamu datang kepada kami dan setelah kamu datang.” Musa menjawab,“Mudah-mudahan Tuhan kalian membinasakan musuh kalian dan menjadikan kalian penguasa di bumi lalu Dia akan melihat bagaimana perbuatanmu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "129 “mereka berkata” kepada Musa mengeluhkan siksaan fir’aun yang menimpa mereka dalam kurun waktu yang lama, ”kami telah ditindas (oleh fir’aun) sebelum kamu datang kepada kami” mereka menimpakan siksaan yang buruk kepada kami, mereka membunuh anak laki-laki kami dan membiarkan anak-anak perempuan kami “dan sesudah kamu datang” juga demikian, musa menjawab mereka dengan memberi harapan kemenangan dan kebebasan dari kejahatan mereka. ”mudah-mudahan Allah membinasakan musuhmu dan menjadikanmu khalifah dibumi ( Nya)” yakni menjadikanmu pengendali dan pemegang urusan didalamnya. ”maka Allah akan melihat bagaimana perbuatanmu” apakah kamu akan bersyukur atau kufur? Ini adalah janji Allah yang dilaksanakan manakala telah tiba waktu yang telah diinginkan oleh Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 129: Kepada Musa karena bosannya mereka berada dalam kekejaman Fir’aun dalam waktu yang lama. Mereka mengeluh kepada Nabi Musa ‘alaihis salam bahwa nasib mereka sama saja; baik sebelum kedatangan Musa untuk menyeru mereka kepada agama Allah dan melepaskan mereka dari perbudakan Fir'aun, maupun setelahnya. Ini menunjukkan kekerdilan jiwa dan kelemahan daya juang mereka. Apakah kamu akan bersyukur atau malah kufur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 129",
    "description": "Meski nabi musa telah membesarkan hati mereka dan menyampaikan janji pertolongan Allah, kaumnya masih saja menyampaikan keluhan. Dengan nada mengeluh dan sedih, mereka kaum nabi musa berkata, dulu kami telah ditindas oleh fir'aun dan rezimnya dengan membunuh, menindas dan melecehkan kami sebelum engkau datang sebagai utusan tuhan kepada kami, dan kini setelah engkau datang sebagai utusan-Nya kami pun dianiaya juga, lalu kapan kita akan menang, sebab keadaan semakin memburuk. Untuk memberi harapan dan menanamkan optimisme kepada kaumnya, nabi musa menjawab, mudah-Mudahan dengan karunia-Nya, berkat keteguhan dan kesabaran kamu, tuhanmu membinasakan musuhmu yang telah menghina dan menyiksa kamu dengan zalim dan tuhanmu akan menjadikan kamu khalifah penguasa di bumi; lalu sebagai bentuk ujian, dia akan melihat bagaimana perbuatanmu setelah penobatan kamu sebagai khalifah-Nya: adakah kamu mensyukuri nikmat-nikmat-Nya, atau malah mengingkari-Nya' adakah kamu akan memakmurkan bumi atau merusaknya' dengan ukuran itulah Allahharapan nabi musa itu dikabulkan dengan didahului pernyataan Allah, dan sungguh, kami telah menghukum fir'aun dan kaumnya yaitu orang-orang mesir dengan mendatangkan musim kemarau panjang, akibat jarang atau tidak turun hujan, masa paceklik bertahun-tahun dan kekurangan buah-buahan, karena hasil tanaman yang rusak, agar mereka mengambil pelajaran dan tidak kembali menganiaya bani israil serta mengikuti ajakan nabi musa, sebab kesulitan dan bencana itu biasanya dapat mencegah orang berlaku sombong, membersihkan diri untuk menerima kebenaran, dan mendorong untuk mengharap perkenan tuhan semesta alam dan tunduk kepada-Nya."
  }
]