[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada iblis, ”turunlah kamu dari surga! Kamu tidak pantas untuk menyombongkan diri di dalamnya. Keluarlah dari surga! Sesungguhnya Kamu termasuk makhluk yang hina dan nista. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah berfirman kepada Iblis, “Turunlah kamu dari Surga! Karena kamu tidak berhak bersikap sombong di dalam Surga. Surga adalah tempat tinggal bagi orang-orang yang baik dan bersih. Maka kamu tidak boleh tinggal di Surga. Sesungguhnya kamu -wahai Iblis- termasuk golongan orang-orang yang rendah dan hina, meskipun kamu merasa bahwa dirimu lebih mulia dari Adam.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. قَالَ فَاهْبِطْ مِنْهَا (Allah berfirman: “Turunlah kamu dari surga itu) Yakni turun dari langit yang merupakan tempat bagi para makhluk-makhluk yang taat seperti malaikat yang tidak mendurhakai perintah Allah, menuju bumi sebagai tempat makhluk-makhluk yang taat dan yang bermaksiat. فَمَا يَكُونُ لَكَ أَن تَتَكَبَّرَ فِيهَا (karena kamu sepatutnya menyombongkan diri di dalamnya) Karena langit tidak layak bagi makhluk yang angkuh dan durhaka terhadap perintah Tuhannya seperti kamu. فَاخْرُجْ(maka keluarlah) Yakni dari surga. إِنَّكَ مِنَ الصّٰغِرِينَ (sesungguhnya kamu termasuk orang-orang yang hina) Yakni termasuk makhluk yang hina dan tercela di hadapan Allah dan para hamba-Nya yang shalih sebagai balasan atas kesombonganmu. Dan setiap orang yang berhias dengan sifat kesombongan maka ia akan diliputi dengan kehinaan dan kerendahan, dan barangsiapa yang berhias dengan sifat kerendahan hati maka ia akan diangkat derajatnya oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Allah berfirman kepada Iblis: “Maka turunlah dari surga tempat kamu diciptakan. Tidak selayaknya dan tidak sepatutnya kamu sombong di dalamnya dan mengingkari perintahKu, maka keluarlah dari sana. Sesungguhnya kamu termasuk orang-orang yang hina dan rendah sebagai balasan atas kesombonganmu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Turunlah kamu dari sana} dari surga {kamu tidak sepatutnya menyombongkan diri di dalamnya} di surga {Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.”} yang hina dan rendah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. oleh karena itu, manakala terjadi penentangan dari iblis, maka dia terdegrasi ke derajat yang paling rendah. Allah berfirman kepadanya, turunlah kamu “dari surganya” yakni dari surge. ”karena kamu tidak sepatutnya menyombongkan diri didalamnya” karena ia adalah rumah orang-orang yang baik lagi suci, maka ia tidak layak dihuni oleh makhluk yang paling buruk dan paling jahat. ”maka keluarlah, sesungguhnya kamu termasuk orang-orang yang hina” yakni termasuk orang-orang yang hina dina sebagai balasan atas kesombongan dan ujubnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 13: Derajatnya yang sebelumnya tinggi menjadi turun, bahkan sangat rendah sekali akibat kesombongan dan ujubnya. Karena surga merupakan tempat orang-orang yang baik, tidak layak untuk orang-orang yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 13",
    "description": "Ucapan iblis ini merupakan cerminan keangkuhan dan kesombongannya. Menanggapi kedurhakaan dan sikap iblis, Allah langsung menyuruhnya keluar dari surga. Allah berfirman, maka karena kesombongan dan pembangkanganmu, turunlah kamu darinya, yakni dari dalam surga, karena apa pun alasanmu kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah kamu dari surga ini, karena sesung-guhnya kamu termasuk makhluk yang hina. Ketika iblis memproklamasikan diri sebagai musuh Allah dan nabi adam serta keturunannya, ia meminta agar Allah menangguhkan usianya sampai hari kiamat. Iblis menjawab perintah Allah untuk keluar dari dalam surga, berilah aku penangguhan waktu, panjangkanlah usia-ku, dan janganlah engkau wafatkan aku sampai hari kiamat, yaitu hari ketika mereka, semua manusia, dibangkitkan agar aku dapat menyesatkan adam dan keturunannya."
  }
]