[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah menimpakan malapetaka kepada fir’aun dan para pengikutnya dengan masa paceklik dan kekeringan, serta berkurangnya buah-buahan dan hasil pertanian mereka, agar mereka mau mengambil pelajaran, menghentikan kesesatan-kesesatan mereka dan bersimpuh kembali kepada tuhan mereka dengan bertaubat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "130. Kami telah menghukum keluarga Fir’aun dengan kekeringan dan paceklik, dan Kami uji mereka dengan kekurangan buah-buahan dan hasil bumi agar mereka ingat dan mengambil pelajaran bahwa apa yang menimpa mereka itu adalah hukuman bagi mereka atas kekafiran mereka, lalu mereka mau bertobat kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "130. Sungguh kami telah memberi musibah bagi Fir’aun dan para pengikutnya berupa kekeringan, kehidupan yang sulit, penyebaran penyakit, dan sedikitnya buah-buahan. Hal ini agar mereka kembali kepada kesadaran mereka, dan mengingat kelemahan mereka di hadapan kekuatan Sang Pencipta, serta bertaubat dari kekafiran dan kemaksiatan yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "130. وَلَقَدْ أَخَذْنَآ ءَالَ فِرْعَوْنَ (Dan sesungguhnya Kami telah menghukum (Fir’aun dan) kaumnya) Yang dimaksud dengan (آل فرعون)/keluarga Fir’aun adalah kaumnya. بِالسِّنِينَ(dengan (mendatangkan) musim kemarau yang panjang) Yakni kemarau yang berkepanjangan. وَنَقْصٍ مِّنَ الثَّمَرٰتِ(dan kekurangan buah-buahan) Yang disebabkan kekeringan dan banyaknya hama. لَعَلَّهُمْ يَذَّكَّرُونَ(supaya mereka mengambil pelajaran) Agar mereka mengambil pelajaran dan berhenti dari kedurhakaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "130. Dan sungguh Kami telah menghukum pengikut Fir’aun dengan kekeringan, kegersangan, kelaparan yang terus menerus, kekurangan buah karena hasil panennya cacat dan dirusak hama, akibat tidak ada hujan. Barangkali mereka mengambil pelajaran dan kembali dari kekufuran mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menghukum Fir‘aun dan kaumnya dengan kemarau panjang} musim kering dan tandus {dan kekurangan buah-buahan agar mereka mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "130 Allah berfirman dalam rangka menjelaskan perlakuanNya terhadap keluarga fir’aun di waktu akhir-akhir ini, ia seperti biasa dan sesuai dengan sunnahNya pada umat-umat yang telah lalu, dimana Dia menimpakan, ”azab dan kesulitan agar mereka tunduk dengan merendahkan diri” “dan sesungguhnya kami telah menghukum (fir’aun dan) kaumnya dengan (mendatangkan) musim kemarau yang panjang” yakni kekeringan dan paceklik “dan kekurangan buah-buahan supaya mereka mengambil pelajaran” yakni supaya mereka menyadari bahwa apa yang menimpa dan apa yang terjadi pada mereka adalah pelajaran dari Allah agar mereka meniggalkan kekufuran, tetapi hal itu tidak berguna dan berpengaruh bagi mereka, justru mereka terus diatas kezhaliman dan kerusakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 130: Sehingga mereka beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 130",
    "description": "Harapan nabi musa itu dikabulkan dengan didahului pernyataan Allah, dan sungguh, kami telah menghukum fir'aun dan kaumnya yaitu orang-orang mesir dengan mendatangkan musim kemarau panjang, akibat jarang atau tidak turun hujan, masa paceklik bertahun-tahun dan kekurangan buah-buahan, karena hasil tanaman yang rusak, agar mereka mengambil pelajaran dan tidak kembali menganiaya bani israil serta mengikuti ajakan nabi musa, sebab kesulitan dan bencana itu biasanya dapat mencegah orang berlaku sombong, membersihkan diri untuk menerima kebenaran, dan mendorong untuk mengharap perkenan tuhan semesta alam dan tunduk kepada-Nya. Fir'aun dan kaumnya, yang tidak terbiasa memegang kebenaran, kembali ingkar dan berbuat maksiat. Mereka adalah orang-orang yang tidak konsisten. Kemudian apabila kebaikan berupa tanah yang subur dan rezeki yang luas datang kepada mereka, kaum fir'aun, mereka berkata, bagi kami hal ini adalah wajar karena usaha kami dan keistimewaan kami yang tidak dimiliki orang lain. Dan jika mereka ditimpa kesusahan, berupa kemarau panjang, terserang wabah dan krisis ekonomi, mereka lemparkan sebab kesialan itu kepada musa dan pengikutnya. Mereka lupa bahwa kezaliman dan kejahatan yang mereka lakukan itulah yang sebenarnya membuat mereka ditimpa malapetaka seperti itu. Ketahuilah, sesungguhnya nasib baik dan buruk yang menimpa mereka di tangan Allah berdasarkan ketetapan qada dan qadar-Nya, dan juga disebabkan dosa dan kekufuran mereka, namun kebanyakan mereka tidak mengetahui karena mereka larut dalam kebodohan dan kesesatan."
  }
]