[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian ketika tiba kepada fir’aun dan para pengikutnya masa subur dan limpahan rizki, mereka berkata, ”ini menjadi milik kami, karena kami memang berhak memperolehnya,” dan apabila mereka dilanda paceklik dan kekeringan , mereka beranggapan telah dilanda kesialan dan mereka berkata, ”ini disebabkan oleh Musa dan orang-orang yang bersamanya.” Ketahuilah, sesungguhnya paceklik dan kekeringan terjadi kepada mereka hanyalah lantaran qadha dan takdir Allah, serta karena dosa-dosa dan kekafiran mereka. Akan tetapi, kebanyakan para pengikut fir’aun tidak mengetahui hal itu. Itu terjadi karena mereka sudah berkubang dalam kebodohan dankesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "131. Apabila keluarga Fir’aun mendapatkan tanah yang subur, buah-buahan yang bagus, dan harga-harga yang murah mereka berkata, “Kami mendapatkan ini karena kami berhak mendapatkannya dan dikhususkan bagi kami.” Dan apabila mereka ditimpa musibah seperti kekeringan, gagal panen, penyakit, dan musibah lainnya, mereka akan menganggap bahwa Musa dan para pengikutnya dari Bani Israil sebagai biang kesialan. Padahal sesungguhnya apa yang menimpa mereka itu adalah ketentuan dari Allah -Subḥānahu-. Musa dan para pengikutnya tidak punya andil sedikit pun di dalamnya selain doa yang dipanjatkan oleh Musa untuk mengutuk mereka. Tetapi kebanyakan dari mereka tidak mengetahuinya sehingga mereka menganggap bahwa pelakunya bukan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "131. Akan tetapi mereka tidak mengambil pelajaran dari musibah tersebut, bahkan mereka semakin membangkang. Apabila mereka mendapat kemudahan dan kemakmuran, mereka berkata dengan sombong: “Kebaikan ini tidak datang melainkan untuk kami, karena kami adalah pantas mendapatkannya berkat usaha dan kesungguhan kami”. Mereka lupa bahwa itu adalah karunia dari Allah dan lalai dari mensyukuri nikmat tersebut. Namun jika mereka mendapat kesulitan, kekeringan, kematian, atau kehilangan harta, mereka menganggap bahwa itu adalah kesialan yang dibawa Musa dan pengikutnya. Mereka berkata: “Apa yang menimpa kami ini adalah karena kesialan dari mereka, andai mereka tidak bersama kami niscaya ini tidak akan terjadi.” Maka Allah membantah mereka, bahwa sebab keburukan yang mereka dapatkan adalah amal-amal keburukan yang mereka lakukan yang telah tertulis di sisi Allah. Itulah yang menyebabkan keburukan itu, sedangkan Musa dan pengikutnya tidak ada sangkut pautnya dengan hal itu. Akan tetapi mayoritas mereka tidak mengetahui kenyataan ini sehingga mereka mengatakan hal yang dikatakan oleh hawa nafsu dan kebodohan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "131. فَإِذَا جَآءَتْهُمُ الْحَسَنَةُ (Kemudian apabila datang kepada mereka kemakmuran) Berupa kesuburan, buah-buahan yang sehat, dan harga jual yang tinggi. قَالُوا۟ لَنَا هٰذِهِۦ ۖ (mereka berkata: “Itu adalah karena (usaha) kami”) Yakni kami diberikan kerena kami layak mendapatkannya, dan ini khusus buat kami. وَإِن تُصِبْهُمْ سَيِّئَةٌ (Dan jika mereka ditimpa kesusahan) Berupa kemarau, banyaknya penyakit, dan cobaan lainnya. يَطَّيَّرُوا۟ بِمُوسَىٰ وَمَن مَّعَهُۥٓ ۗ( mereka lemparkan sebab kesialan itu kepada Musa dan orang-orang yang besertanya) Yakni menyalahkan mereka. أَلَآ إِنَّمَا طٰٓئِرُهُمْ عِندَ اللهِ (Ketahuilah, sesungguhnya kesialan mereka itu adalah ketetapan dari Allah) Yakni sebab dari kebaikan dan keburukan yang mereka dapatkan seperti kesuburan atau kekeringan adalah dari sisi Allah dan bukan disebabkan oleh Nabi Musa dan pengikutnya. Dan jawaban ini diutarakan sesuai kepercayaan mereka dan tingkat pemahaman mereka. Oleh sebab itu Allah menggunakan istilah (الطائر)/burung untuk mengibaratkan kebaikan atau keburukan yang terjadi dengan kuasa Allah dan hikmah serta kehendak-Nya. Dan hal ini bukan dimaksudkan sebagai persetujuan atas kepercayaan mereka tentang التطير (menggantungkan kebaikan dan keburukan dengan perilaku seekor burung). وَلٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ (akan tetapi kebanyakan mereka tidak mengetahui) Yakni tidak mengetahui akan hal ini, tetapi mereka malah menisbatkan kebaikan dan keburukan kepada selain Allah disebabkan kebodohan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika anda memperhatikan dan mentadabburi perjumpaan yang menakjubkan dalam ayat ini; niscaya rasa takut anda kepada Allah akan bertambah! Perhatikan bagaimana pernyataan kebaikan dituliskan dengan kata \"datang\", dan pernyataan keburukan yang dituliskan dengan kata \"timpaan\" ya, karena apa yang terjadi di sisi mereka adalah sesuatu yang tidak disukai oleh mereka dan tidak pula pernah mereka harapkan kedatangannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "131. Dan ketika datang kepada mereka musim-musim baik dengan penuh kesuburan, buah-buahan yang melimpah, dan kesejahteraan. Mereka berkata: “Ini adalah hasil usaha yang layak kami dapatkan”, namun jika mereka dihadapkan pada musim-musim yang buruk berupa kegersangan, kekeringan, musibah dan penyakit, maka mereka merasa sial jika bersama Musa dan orang-orang yang beriman. Ingatlah sesungguhnya perasaan menyesal mereka itu datang dari sisi Allah akibat perbuatan mereka, bukan dari Musa dan orang yang bersamanya. Dan seluruh hal yang mereka terima berupa kebaikan dan keburukan itu dari sisi Allah. Hal ini berdasarkan cara mereka meyakininya, oleh karenanya diumpamakan menggunakan At-Thair yang menjelaskan tentang kebaikan dan keburukan bukan untuk menunjukkan suatu kesialan. Akan tetapi kebanyakan mereka tidak mengetahui perkara ini, bahkan menghubungkan kebaikan dan keburukan kepada selain Allah, itu adalah kesalahan dan kebodohan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apabila datang kepada mereka} datang kepada Fir’aun dan kaumnya {kebaikan} kesuburan, keluasan, dan kesehatan {mereka berkata,“Inilah milik kami”} kami adalah orang-orang yang pantas memilikinya {Jika ditimpa kesusahan} cobaan, kekeringan dan penyakit {mereka melemparkan kesialan} merasa sial {itu kepada Musa dan orang-orang yang bersamanya. Ketahuilah sesungguhnya nasib mereka di sisi Allah} sesungguhnya yang menimpa mereka adalah sesuai takdir Allah {tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "131 “kemudian apabila datang kepada mereka kemakmuran” yakni kesuburan dan kelimpahan rizki, ”mereka berkata ini adalah karena (usaha) kami” yakni kami berhak atasnya. Mereka tidak bersyukur kepada Allah atas karunia tersebut. ”dan jika mereka ditimpa kesusahan” yakni kekeringan dan paceklik ”mereka melemparkan sebab kesialan itu kepada Musa dan orang-orang yang besertanya” yakni mereka berkata “kesialan ini menimpa kami karena kedatangan Musa dan bani israil mengikutinya” Allah menjawab ”ketahuilah, sesungguhnya kesialan mereka itu adalah ketetapan dari Allah” yakni dengan qadha dan qadarNya tidak seperti yang mereka katakan, justru penyebabnya adalah kekufuran dan dosa-dosa mereka, akan tetapi \"kebanyakan mereka tidak mengetahui\", oleh karena itu mereka berkata begitu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 131: Mereka tidak bersyukur kepada Allah. Dosa-dosa dan kekafiran merekalah yang menjadi sebab mereka ditimpa musibah itu. Sehingga mereka mengatakan seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 131",
    "description": "Fir'aun dan kaumnya, yang tidak terbiasa memegang kebenaran, kembali ingkar dan berbuat maksiat. Mereka adalah orang-orang yang tidak konsisten. Kemudian apabila kebaikan berupa tanah yang subur dan rezeki yang luas datang kepada mereka, kaum fir'aun, mereka berkata, bagi kami hal ini adalah wajar karena usaha kami dan keistimewaan kami yang tidak dimiliki orang lain. Dan jika mereka ditimpa kesusahan, berupa kemarau panjang, terserang wabah dan krisis ekonomi, mereka lemparkan sebab kesialan itu kepada musa dan pengikutnya. Mereka lupa bahwa kezaliman dan kejahatan yang mereka lakukan itulah yang sebenarnya membuat mereka ditimpa malapetaka seperti itu. Ketahuilah, sesungguhnya nasib baik dan buruk yang menimpa mereka di tangan Allah berdasarkan ketetapan qada dan qadar-Nya, dan juga disebabkan dosa dan kekufuran mereka, namun kebanyakan mereka tidak mengetahui karena mereka larut dalam kebodohan dan kesesatan. Karena asumsi yang salah seperti inilah mereka tetap mempertahankan kemungkaran. Dan tidak saja menuduh nabi musa sebagai penyebab kesulitan yang mereka hadapi, mereka kaum fir'aun juga berkata kepada nabi musa, bukti apa pun yang engkau bawa kepada kami berupa mukjizat atau bukti kebenaranmu untuk menyihir atau mengelabui kami dengannya, agar kami meninggalkan seruan fir'aun. Kami tidak akan meninggalkan keyakinan kami dan kami tidak akan beriman kepadamu."
  }
]