[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pengikut fir’aun berkata kepada Musa , ”apapun mukjizat yang engkau bawa kepada kami dan apapun petunjuk dan hujjah yang engkau terangkan untuk mengalihkan kami dari keadaan kami dalam meyakini ajaran fir’aun, maka kami tetaplah tidak akan membenarkan dan beriman kepadamu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "132. Para pengikut Fir’aun menolak kebenaran seraya berkata kepada Musa -‘Alaihissalām-, “Manakah tanda serta dalil yang kamu bawa kepada kami? Manakah hujah yang menunjukkan bahwa keyakinan yang kami anut ini salah sehingga kamu menyuruh kami meninggalkannya? dan Manakah bukti yang menunjukkan bahwa ajaran yang kamu bawa itu benar? Kami tidak akan percaya kepadamu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "132. Mereka berkata kepada Musa setelah melihat bukti-bukti Musa yang menunjukkan kebenarannya: “Hai Musa, meskipun kamu mendatangkan kepada kami segala jenis mukjizat yang menjadi bukti kebenaran dakwahmu agar kami meninggalkan apa yang kami yakini, maka kami sekali-kali tidak akan mempercayaimu dan tidak akan mengikuti risalahmu.” Mereka telah menampakkan perlawanan yang tidak mungkin berguna lagi bukti maupun bujukan. Mereka telah menampakkan kebebalan mereka dalam mendustakan risalah, meski nabi mereka telah mendatangkan segala bukti yang mereka minta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "132. وَقَالُوا۟ مَهْمَا تَأْتِنَا بِهِۦ مِنْ ءَايَةٍ لِّتَسْحَرَنَا بِهَا (Mereka berkata: “Bagaimanapun kamu mendatangkan keterangan kepada kami untuk menyihir kami dengan mukjizat itu) Kedurhakaan dan kebebalan telah merasuki diri mereka, dengan menganggap bahwa tidak ada perbedaan antara mukjizat dan sihir. Yakni untuk mengalihkan kami dari keadaan kami ini sebagaimana yang dilakukan para penyihir dengan sihir mereka. فَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ(maka kami sekali-kali tidak akan beriman kepadamu) Mereka ingin membuat Musa putus asa agar tidak kembali mendakwahi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "132. Para pengikut Fir’aun berkata kepada Musa: “Bagaimanapun kamu mendatangkan mukjizat kepada kami untuk memalingkan kami dengan lembut dan manis dari keyakinan atas agama kami sebagaimana sihir yang dibuat para penyihir, niscaya kami tetap menolaknya, tidak akan beriman kepadamu, dan tidak mempercayai risalahmu.” Dengan itu mereka bermaksud untuk menyampaikan kesia-siaan atas keimanan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} kaum Fir’aun berkata kepada Musa {Bukti apa pun yang kamu bawa kepada kami untuk menyihir kami dengan itu, maka kepadamu kami bukanlah orang-orang yang beriman”} orang-orang yang membenarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "132 “dan mereka berkata” menjelaskan kepada Musa bahwa mereka senantiasa dan tetap akan berada pada kebatilan. ”bagaimanapun kamu mendatangkan keterangan kepada kami untuk menyihir kami dengan keterangan itu, maka kami sekali-kali tidak akan beriman kepadamu.” Yakni kami telah yakin bahwa dirimu adalah penyhir, meskipun kamu dengan membawa mukjizat, kami tetap yakin bahwa kamu adalah penyihir, maka kami tidak mempercayaimu dan beriman kepadamu. Ini adalah puncak pengingkaran orang-orang kafir itu, dimana keadaannya adalah sama saja, mukjizat turun atau tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 132",
    "description": "Karena asumsi yang salah seperti inilah mereka tetap mempertahankan kemungkaran. Dan tidak saja menuduh nabi musa sebagai penyebab kesulitan yang mereka hadapi, mereka kaum fir'aun juga berkata kepada nabi musa, bukti apa pun yang engkau bawa kepada kami berupa mukjizat atau bukti kebenaranmu untuk menyihir atau mengelabui kami dengannya, agar kami meninggalkan seruan fir'aun. Kami tidak akan meninggalkan keyakinan kami dan kami tidak akan beriman kepadamu. Disebabkan kedurhakaan fir'aun dan kaumnya yang telah melampaui batas maka sebagai bentuk azab untuk mereka kami kirimkan kepada mereka siksa berupa topan yang menyebabkan banjir besar yang menenggelamkan tanaman mereka, belalang yang memakan tanaman, hasil pertanian, rumah, atap, dan pakaian mereka, kutu berupa serangan hama dan kuman yang merusak buah-buahan, tanaman, dan hewan ternak, katak yang memenuhi bejana minuman, makanan, dan tempat tidur mereka, dan darah dengan menjadikan air sungai dan sumur mereka tidak layak digunakan, sebagai bukti-bukti yang jelas agar mereka beriman. Tetapi watak mereka memang keras dan hati mereka pun membatu, sehingga mereka tetap menyombongkan diri dan mereka adalah kaum pendurhaka yang selalu berdosa."
  }
]