[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kami mengirim kepada mereka banjir yang amat deras yang menenggelamkan tanaman-tanaman dan buah-buahan. Dan kami kirim belalang, yang menghabiskan tanaman-tanaman dan buah-buahan mereka, (merusak) pintu-pintu, atap-atap dan pakaian-pakian mereka. Dan kami kirimkan kutu yang merusak tanaman-tanaman dan mematikan hewan-hewan ternak dan tanaman-tanaman. Dan kami kirim katak-katak yang memenuhi bejana-bejana, makanan-makanan dan tempat pembaringan mereka. Kami juga mengirim darah, sehingga sungai-sungai dan sumur-sumur berubah menjadi darah, akibatnya mereka tidak menemukan air yang layak di minum. Ini merupakan tanda-tanda kekuasaan dari Allah, yang tidak ada yang kuasa mendatangkannya selain Allah, masing-masing tanda kekuasaan datang secara terpisah dari yang lain. Meskipun demikian, kaum fir’aun tetap merasa angkuh dan sombong untuk beriman kepada Allah. Mereka manusia-manusia yang suka berbuat apa yang dilarang oleh Allah berupa maksiat-maksiat dan tindakan kefasikan lain dengan penuh kesombongan dan penolakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "133. Kemudian Kami kirimkan air bah kepada mereka hukuman atas penolakan dan pembangkangan mereka sehingga menenggelamkan lahan pertanian dan buah-buahan mereka. Lalu Kami kirimkan kepada mereka belalang untuk memakan hasil pertanian mereka. Kami juga mengirim kutu yang menyerang tanaman serta menyakiti manusia di rambut kepalanya. Lalu Kami kirimkan kepada mereka katak yang memenuhi wadah-wadah mereka, merusak makanan mereka dan mengganggu tidur mereka. Dan juga Kami kirimkan kepada mereka darah yang membuat air sumur dan sungai mereka berubah menjadi darah. Kami mengirimkan itu semua sebagai bukti yang nyata dan datang silih berganti secara berturut-turut. Meskipun begitu banyak hukuman yang menimpa mereka, tetapi mereka tetap enggan untuk beriman kepada Allah dan percaya kepada ajaran yang dibawa oleh Musa -‘Alaihissalām-. Mereka adalah orang-orang yang suka berbuat maksiat, tidak mau meninggalkan kebatilan dan enggan mengikuti jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "133. Akibat kebebalan dan keburukan sikap mereka, Kami mengirim kepada mereka kumpulan belalang yang memakan tanaman mereka sehingga kebun mereka menjadi tandus, kutu yang memakan biji-bijian dan segala makanan yang mereka simpan dalam rumah, katak-katak yang merusak kehidupan dan mengganggu tidur mereka, dan darah yang mengalir pada air minum dan air sungai mereka sehingga tidak dapat mereka manfaatkan. Allah menguji mereka dengan mukjizat-mukjizat yang jelas ini agar mereka bertaubat dan kembali sadar; namun mereka tetap saja angkuh dan enggan beriman kepada Musa dan mukjizat-mukjizat yang dia datangkan; sehingga kejahatan telah menjadi tabiat mereka, dan kekafiran dan kefasikan menjadi kebiasaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "133. فَأَرْسَلْنَا عَلَيْهِمُ الطُّوفَانَ (Maka Kami kirimkan kepada mereka taufan) Yakni air yang mengalir dengan deras yang menenggelamkan bumi dan merusak rumah-rumah dan pepohonan. Pendapat lain mengatakan taufan yakni kematian. وَالْجَرَادَ (belalang) Allah mengirimnya agar memakan tanaman mereka. Dan belalang itupun memakannya. وَالْقُمَّلَ (kutu) Ada pendapat mengatakan yakni larva, yaitu anak belalang yang belum bisa terbang. Pendapat lain mengatakan yakni kutu. وَالضَّفَادِعَ(katak) Hewan yang ada di air, sebagaimana diketahui. وَالدَّمَ(dan darah) Diriwayatkan bahwa sungai Nil mengaliri mereka air darah. Pendapat lain mengatakan yakni mimisan. ءَايٰتٍ مُّفَصَّلٰتٍ(sebagai bukti yang jelas) Yakni bukti yang nyata. فَاسْتَكْبَرُوا۟(, tetapi mereka tetap menyombongkan diri) Yakni merasa angkuh untuk beriman kepada Allah. وَكَانُوا۟ قَوْمًا مُّجْرِمِينَ(dan mereka adalah kaum yang berdosa) Yakni yang tidak mendapat petunjuk kepada kebenaran dan tidak pula berhenti dari kebathilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "133. Lalu Kami mengirim banjir kepada mereka (hujan yang sangat banyak dan menghancurkan tanaman), belalang yang memakan tanaman, Al-Qummal, yaitu serangga-serangga kecil yang merusak tanaman, bukan kutu pada umumnya, katak yang semakin berkembang biak sehingga memenuhi rumah-rumah, dan darah, yaitu darah mimisan yang keluar dari hidung atau berubahnya air menjadi darah. Hal itu sebagai tanda-tanda penjelas yang menunjukkan kepada kekuasaan Allah SWT dan kebenaran Musa. Lalu mereka enggan beriman kepada Allah dan menjadi kaum yang suka bermaksiat lagi berbuat jahat. Ini adalah 5 pertanda yang dihubungkan dengan dua pertanda di ayat sebelumnya [ayat 130], yaitu kekeringan dan kekurangan buah, dan dua pertanda lagi di surah Yunus [ayat 88] yaitu kehilangan harta benda, yaitu hilangnya dan lenyapnya harta benda, dan tekanan dalam hati, yaitu hatinya terkunci, sehingga tanda-tandanya berjumlah 9"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka Kami mengirimkan kepada mereka banjir besar} air yang banyak yang mengepung mereka lalu memenuhi rumah-rumah suku Qibthi {belalang} hewan-hewan yang memakan tanaman, buah-buahan dan atap-atap rumah mereka {kutu} serangga yang tidak memiliki sayap, yang hinggap di tanaman dan membuat sakit rambut manusia {katak} hewan yang memenuhi rumah mereka, merusak makanan mereka dan membuat mereka tidak bisa tidur di tempat tidur mereka {dan darah} sesuatu yang bercampur dengan air sumur dan air sungai mereka {sebagai bukti-bukti yang terperinci} yang jelas dan rinci yang saling bersambung {Lalu mereka menyombongkan diri dan mereka adalah kaum yang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133 “maka kami kirimkan kepada mereka air bah” yakni banjir bandang yang menenggelamkan pohon-pohon dan tanaman-tanaman serta merugikan mereka dengan kerugian yang besar “dan belalang” yang melahap buah-buahan, tanaman, dan pertanian mereka, ”dan kutu” yakni belalang kecil, dan yang zahir adalah bahwa ia adalah kutu yang dikenal, ”dan katak” yang memenuhi tempat-tempat air mereka sehingga mengganngu mereka dan membuat mereka sagat tidak nyaman, ”dan darah” bisa jadi ia adalah mimisan atau seperti yang dikatakan oleh banyak ahli tafsir bahwa air yang mereka minum berubah menjadi darah, sehingga mereka tidak minum kecuali darah dan tidak memasak kecuali dengan darah, ”sebagai bukti yang jelas” yakni sebagai dalil dan bukti kongkrit bahwa mereka itulah orang-orang yang berdusta lagi zhalim dan bahwa apa yang dibawa oleh Musa adalah kebenaran “tetapi mereka tetap menyombongkan diri” tatkala melihat ayat-ayat itu, ”dan mereka” dulu “adalah kaum yang berdosa” oleh karena itu Allah menghukum mereka dengan tetap membiarkan mereka di atas kesesatan dan penyimpangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 133: Yang memakan tanaman dan buah-buahan mereka. Yang mengiringi belalang, menghabiskan buah-buahan mereka. Yang memenuhi rumah mereka. Air minum mereka berubah menjadi darah. Bahwa apa yang dibawa Nabi Musa ‘alaihis salam adalah benar. Tidak mau beriman. Oleh karena itu, Allah membiarkan mereka di atas kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 133",
    "description": "Disebabkan kedurhakaan fir'aun dan kaumnya yang telah melampaui batas maka sebagai bentuk azab untuk mereka kami kirimkan kepada mereka siksa berupa topan yang menyebabkan banjir besar yang menenggelamkan tanaman mereka, belalang yang memakan tanaman, hasil pertanian, rumah, atap, dan pakaian mereka, kutu berupa serangan hama dan kuman yang merusak buah-buahan, tanaman, dan hewan ternak, katak yang memenuhi bejana minuman, makanan, dan tempat tidur mereka, dan darah dengan menjadikan air sungai dan sumur mereka tidak layak digunakan, sebagai bukti-bukti yang jelas agar mereka beriman. Tetapi watak mereka memang keras dan hati mereka pun membatu, sehingga mereka tetap menyombongkan diri dan mereka adalah kaum pendurhaka yang selalu berdosa. Dan ketika mereka ditimpa azab yang telah diterangkan itu mereka pun bergegas mendatangi nabi musa dan berkata, wahai musa! mohonkanlah untuk kami kepada tuhanmu sesuai dengan janji-Nya kepadamu atau dengan apa yang telah dianugerahkan kepadamu berupa perkenannya mengabulkan doamu, kenabianmu atau rahasia ilahi lainnya, agar menghilangkan azab-azab yang menimpa kami ini. Sesungguhnya jika engkau dengan doamu dapat menghilangkan azab itu dari kami, niscaya kami akan beriman kepadamu, mengikuti ajaranmu dan pasti akan kami biarkan bani israil pergi bersamamu sesuai permintaanmu, kami tidak akan halang-halangi mereka untuk pergi ke mana saja bersamamu."
  }
]