[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika turun siksaan melanda fir’aun dan para pengikutnya, mereka mengiba kepada musa sambil berkata, ”Wahai musa mohonlah kepada tuhanmu dengan apa yang diwahyukanNya kepadamu berupa terangkatnya siksaan melalui taubat. JIka engkau berhasil menyingkirkan siksaan dari kami yang kami tengah mengalaminya, niscaya kami akan benar-benar mengimani risalah yang engkau bawa dan kami pasti akan mengikuti seruan dakwahmu, serta kami benar-benar akan membebaskan bani israil untuk pergi bersamamu. Kami tidak akan menghalangi mereka untuk pergi kemana mereka mau.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "134. Tatkala mereka ditimpa beragam azab tersebut, mereka datang kepada Musa -‘Alaihissalām- dan berkata, “Wahai Musa! Berdoalah kepada Rabbmu untuk kebaikan kami dengan memanfaatkan keistimewaanmu sebagai nabi dan apa yang Dia janjikan kepadamu untuk menghentikan azab dengan tobat. Mudah-mudahan Dia menghentikan azab yang menimpa kami. Jika kamu berhasil menghentikan azab itu dari kami niscaya kami benar-benar akan percaya kepadamu. Dan kami benar-benar akan melepaskan orang-orang Bani Israil dan membiarkan mereka pergi bersamamu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "134. Allah menjelaskan satu bentuk kesombongan dan kebebalan mereka; yaitu ketika Fir’aun dan para pengikutnya ditimpa azab yang disebutkan dalam ayat sebelumnya, mereka mulai meminta kepada Musa dengan tunduk: “Hai Musa, berdoalah kepada Tuhanmu dan mintalah kepada-Nya karena telah mengutusmu kepada kami, agar Dia menyelamatkan kami dari kebinasaan dengan mengangkat azab ini dari kami. Kami bersumpah, jika kamu dapat menghilangkan azab ini pasti kami akan beriman kepadamu dan membiarkanmu pergi membawa Bani Israil.” Namun mereka hanya berdusta, mereka hanya ingin agar azab itu diangkat dari mereka, dan mengira jika azab itu telah diangkat, maka tidak ada azab lain yang akan menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "134. وَلَمَّا وَقَعَ عَلَيْهِمُ الرِّجْزُ (Dan ketika mereka ditimpa azab) Yakni azab dengan hal-hal ini. Pendapat lain mengatakan azab yang ditimpakan mereka adalah penyakit tha’un yang mematikan ribuan kaum Qibthi dalam sehari. قَالُوا۟ يٰمُوسَى ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ ۖ( merekapun berkata: “Hai Musa, mohonkanlah untuk kami kepada Tuhamnu dengan (perantaraan) kenabian yang diketahui Allah ada pada sisimu) Yakni dengan keistimewaan yang diberikan Allah kepadamu berupa kenabian; atau mohonkanlah untuk kami dengan perantaraan perjanjian-Nya denganmu. لَنُؤْمِنَنَّ لَكَ (pasti kami akan beriman kepadamu) Yakni kami pasti akan membenarkan kenabianmu. وَلَنُرْسِلَنَّ مَعَكَ بَنِىٓ إِسْرٰٓءِيلَ (dan akan kami biarkan Bani Israil pergi bersamamu) Dan dulunya mereka ditahan oleh Fir’aun dan kaumnya dipekerjakan dengan berbagai pekerjaan, dan Fir’aun dan kaumnya menjanjiakan Musa untuk membebaskan mereka dan membiarkan mereka pergi bersamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "134. Dan ketika mereka ditimpa azab dengan perkara-perkara ini, mereka berkata: “Wahai Musa, berdoalah kepada Tuhanmu agar mengangkat musibah dari kami dengan perantara janji yang dikhususkan untukmu dan memuliakanmu berupa risalah, nubuwwah. Sungguh jika kamu mengangkat azab dari kami, sungguh kami akan mempercayai kenabian dan wahyu yang dikabarkan oleh Tuhanmu, dan sungguh kami akan mengutus Bani Israil kepadamu dengan memberi mereka kebebasan untuk berpindah dan bepergian dari negeri ini setelah sebelumnya dilarang.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika turun} turun {kepada mereka azab itu} azab {mereka pun berkata,“Wahai Musa, mohonkanlah untuk kami kepada Tuhanmu sesuai dengan janjiNya kepadamu} dengan sesuatu yang Dia khususkan kepadamu berupa kenabian dan Dia ajarkan kepadamu cara agar doamu dikabulkan {Jika kamu dapat mengangkat azab itu dari kami, niscaya kami akan beriman kepadamu dan sungguh kami akan membiarkan Bani Israil bersamamu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "134 “dan ketika mereka ditimpa azab” yakni siksa. Ada kemungkinan bahwa ia adalah penyakit tha’un sebagaimana dinyatakan oleh banyak ahli tafsir, dan kemungkinan pula bencana yang telah disebutkan di atas, yaitu banjir, belalang, kutu, katak dan darah, karena semua ini adalah siksa dan azab. Setiap kali satu darinya menimpa mereka, ”merekapun berakta ’hai musa mohonlah untuk kami kepada Rabbmu dengan (perantaraan) kenabian yang diketahui Allah ada pada sisimu’”. yakni mereka meminta perantara kepada Musa dengan wahyu dan syariat yang Allah berikan kepadaya. ”sesungguhnya jika kamu dapat menghilangkan azab itu daripada kami, pasti kami akan beriman kepadamu dan akan kami biarkan bani israil pergi bersamamu.” Dan mereka itu adalah para pendusta, maksud mereka mengira bahwa jika ia selesai maka tidak ada azab yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 134: Ada yang menafsirkan penyakit tha’un, dan ada pula yang menafsirkan dengan azab yang disebutkan sebelumnya itu, yaitu topan, belalang, kutu, katak, dan darah. Ketika mereka ditimpa masing-masing musibah, mereka mengeluh kepada Nabi Musa ‘alaihis salam. Yakni akan dihilangkan azab itu jika mereka beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 134",
    "description": "Dan ketika mereka ditimpa azab yang telah diterangkan itu mereka pun bergegas mendatangi nabi musa dan berkata, wahai musa! mohonkanlah untuk kami kepada tuhanmu sesuai dengan janji-Nya kepadamu atau dengan apa yang telah dianugerahkan kepadamu berupa perkenannya mengabulkan doamu, kenabianmu atau rahasia ilahi lainnya, agar menghilangkan azab-azab yang menimpa kami ini. Sesungguhnya jika engkau dengan doamu dapat menghilangkan azab itu dari kami, niscaya kami akan beriman kepadamu, mengikuti ajaranmu dan pasti akan kami biarkan bani israil pergi bersamamu sesuai permintaanmu, kami tidak akan halang-halangi mereka untuk pergi ke mana saja bersamamu. Memenuhi permintaan itu, nabi musa pun berdoa kepada Allah agar azab itu dihilangkan, dan Allah pun mengabulkannya. Tetapi setelah kami hilangkan azab itu dari mereka, berkat doa nabi musa, satu demi satu, dari saat ke saat, sesuai permintaan mereka, dan ini berlanjut hingga batas waktu yang harus mereka penuhi, ternyata tiba-tiba mereka ingkar janji yang telah disampaikannya itu dan terus berada dalam kekufuran dan kesesatan. Mereka kembali seperti sedi."
  }
]