[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tetapi, setelah Allah mengangkat dari mereka azab yang diturunkanNya pada mereka hingga batas waktu yang akan mereka akan sampai kepadanya dengan pasti, dimana mereka akan di siksa pada waktu tersebut, tidak bisa bermanfaat bagi mereka penundaan waktu dan diangkatnya siksaan hingga waktu kedatanggannya, tiba-tiba mereka mengingkari perjanjian-perjanjian mereka yang telah mereka ajukan kepada tuhan mereka dan Musa , mereka tetap tegak berdiri di atas kekafiran dan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "135. Kemudian tatkala Kami telah menghentikan azab itu dari mereka sampai batas waktu tertentu sebelum menenggelamkan mereka di laut, ternyata mereka melanggar janji mereka sendiri untuk percaya kepada Musa dan melepaskan orang-orang Bani Israil. Mereka tetap melanjutkan kekafiran mereka dan menolak membebaskan orang-orang Bani Israil bersama Musa -‘Alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "135. Setelah Kami menyingkap azab dari mereka hingga waktu yang telah Kami tetapkan -yaitu hingga waktu mereka ditenggelamkan di laut kelak-, ternyata mereka mengingkari perjanjian yang telah mereka sepakati dan melanggar sumpah yang telah mereka buat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "135. فَلَمَّا كَشَفْنَا عَنْهُمُ الرِّجْزَ إِلَىٰٓ أَجَلٍ هُم بٰلِغُوهُ (Maka setelah Kami hilangkan azab itu dari mereka hingga batas waktu yang mereka sampai kepadanya) Yakni Kami angkat azab dari mereka sampai batas waktu tertentu untuk membinasakan mereka dengan menenggelamkan mereka kelak. إِذَا هُمْ يَنكُثُونَ (tiba-tiba mereka mengingkarinya) Yakni melanggar perjanjian yang mereka buat atas diri mereka dengan menolak membebaskan Bani Israil pergi bersama Musa sebagaimana yang mereka sepakati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "135. Maka ketika Kami mengangkat azab yang lalu berupa kegersangan dan lain-lain dari mereka sampai waktu tertentu untuk mengazab mereka dengan ditenggelamkan, mereka tetap sewenang-wenang. Mereka mereka mengingkari janji yang mereka sepakati sendiri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Kami mengangkat} mengangkat {azab itu dari mereka hingga batas waktu yang harus mereka penuhi} batas waktu yang harus mereka penuhi sehingga mereka dibinasakan dengan ditenggelamkan {ternyata mereka mengingkarinya} mereka mengingkari janji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "135 “maka setelah kami hilangkan azab itu dari mereka hingga batas waktu yang mereka sampai kepadaya.” yakni sampai waktu dimana Allah menentukan keberadaannya pada mereka, bukan pengangangkatan azab untuk seterusnya akan tetapi hanya sementara “tiba-tiba mereka mengingkarinya” yakni janji yang mereka sampaikan kepada Musa bahwa mereka akan beriman kepadanya dan membiarkan bani israil bersamanya. Mereka tidak beriman kepada Musa dan tidak pula melepas Bani israil bersamanya, justru mereka terus berjalan di atas kekufuran tanpa peduli dan tetap menyiksa Bani israil secara terus-menerus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 135: Dengan doa Nabi Musa ‘alaihis salam. Janji mereka adalah akan beriman kepada Musa ‘alaihis salam dan akan melepaskan Bani Israil, namun mereka tidak menepatinya. Mereka tetap kafir kepada Nabi Musa ‘alaihis salam dan tetap menindas Bani Israil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 135",
    "description": "Memenuhi permintaan itu, nabi musa pun berdoa kepada Allah agar azab itu dihilangkan, dan Allah pun mengabulkannya. Tetapi setelah kami hilangkan azab itu dari mereka, berkat doa nabi musa, satu demi satu, dari saat ke saat, sesuai permintaan mereka, dan ini berlanjut hingga batas waktu yang harus mereka penuhi, ternyata tiba-tiba mereka ingkar janji yang telah disampaikannya itu dan terus berada dalam kekufuran dan kesesatan. Mereka kembali seperti sedi karena mereka mengingkari janji untuk percaya kepada ajaran tauhid yang dibawa nabi musa, atau mengingkari janjinya membiarkan bani israil berhijrah bersama nabi musa, dan terus berada dalam kekufuran, maka kami membalas mereka dengan siksa yang lebih berat daripada siksa yang pernah mereka rasakan. Lalu ketika siksa itu datang, kami tenggelamkan mereka di laut, yaitu laut merah, disebabkan karena sesungguhnya mereka telah mendustakan ayat-ayat kami yang demikian agung dan jelas, dan mereka sejak dulu hingga kini adalah orang-orang yang lalai padanya."
  }
]