[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kamipun membalas tindakan mereka ketika batas waktu penghancuran mereka telah tiba. Itu terjadi dengan ditimpakannya siksaan kami pada mereka, yaitu mereka ditenggelamkan di laut disebabkan mereka mendustakan mukjizat-mukjizat yang telah muncul melalui tangan musa, sedang mereka lalai terhadap mukjizat-mukjizat ini. Dan kelalaian itulah yang menyebabkan pendusaan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "136. Maka tatkala waktu jatuh tempo yang ditetapkan untuk membinasakan mereka telah tiba, Kami menurunkan azab Kami kepada mereka dengan menenggelamkan mereka di laut. Hal itu disebabkan oleh perilaku mereka yang mendustakan ayat-ayat Allah dan berpaling dari kebenaran nyata yang ditunjukkan oleh ayat-ayat tersebut yang tidak mengandung keraguan sedikit pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "136. Maka Kami mengazab dan menyiksa mereka akibat pendustaan dan kelalaian mereka dari ayat-ayat Kami yang jelas dan pelajaran-pelajaran Kami yang mudah difahami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "136. فَانتَقَمْنَا مِنْهُمْ (Kemudian Kami menghukum mereka) Saat mereka melanggar perjanjian. فَأَغْرَقْنٰهُمْ فِى الْيَمِّ(maka Kami tenggelamkan mereka di laut) Yakni di laut. بِأَنَّهُمْ كَذَّبُوا۟ بِـَٔايٰتِنَا(disebabkan mereka mendustakan ayat-ayat Kami) Yakni karena sebab tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "136. Lalu Kami membalas mereka atas keingkaran mereka terhadap janji, maka Kami tenggelamkan mereka ke dalam lautan akibat pendustaan dan pertentangan mereka kepada ayat-ayat Kami sehingga mereka seakan-akan menjadi orang-orang yang melupakannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Kami membalas mereka. Kami menenggelamkan mereka di laut} laut {karena mereka telah mendustakan ayat-ayat Kami dan mereka adalah orang-orang yang lengah terhadapnya} menolaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "136 “kemudian kami menghukum mereka” yakni pada waktu kebinasaan mereka telah tiba. Allah memerintahkan Musa agar membawa Bani israil di malam hari. Dan Allah memberitahukan kepada Musa bahwa fir’aun dengan bala tentaranya akan mengejar mereka. Allah berfirman kepada mereka: (Fir’aun berkata): “Sesungguhnya mereka (Bani Israil) benar-benar golongan kecil,. dan sesungguhnya mereka membuat hal-hal yang menimbulkan amarah kita, dan sesungguhnya kita benar-benar golongan yang selalu berjaga-jaga”. Maka Kami keluarkan Fir’aun dan kaumnya dari taman-taman dan mata air. dan (dari) perbendaharaan dan kedudukan yang mulia demikianlah halnya dan Kami anugerahkan semuanya (itu) kepada Bani Israil. Maka Fir’aun dan bala tentaranya dapat menyusuli mereka di waktu matahari terbit.. Maka setelah kedua golongan itu saling melihat, berkatalah pengikut-pengikut Musa: “Sesungguhnya kita benar-benar akan tersusul”. Musa menjawab: “Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku, kelak Dia akan memberi petunjuk kepadaku”. Lalu Kami wahyukan kepada Musa: “Pukullah lautan itu dengan tongkatmu”. Maka terbelahlah lautan itu dan tiap-tiap belahan adalah seperti gunung yang besar. Dan di sanalah Kami dekatkan golongan yang lain. Dan Kami selamatkan Musa dan orang-orang yang besertanya semuanya. Dan Kami tenggelamkan golongan yang lain itu. (QS. asyuaro: 54-66) Maka dalam surat ini Allah berfirman : “maka kami tenggelamkan mereka dilaut disebabkan mereka mendustakan ayat-ayat Kami dan mereka dalah orang-orang yang melalaikan ayat-ayat Kami itu” yakni disebabkan oleh pendustaan mereka kepada ayat-ayat Allah dan berpalingnya mereka dari kebenaran yang datang kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 136: Yakni ketika tiba waktu untuk menghukum mereka. Allah memerintahkan Musa alaihis salam membawa pergi Bani Israil di malam hari dan memberitahukan bahwa Fir’aun dan tentaranya akan menyusul mereka. Kemudian Fir’aun mengirimkan orang ke kota-kota untuk mengumpulkan bala tentaranya mengejar Bani Israil. Fir’aun berkata, “Sesungguhnya mereka (Bani Israil) hanya sekelompok kecil. Sesungguhnya mereka telah membuat kita marah. Kita semua harus selalu waspada.” Maka keluarlah Fir’aun dan tentaranya dari taman-taman dan mata air, dari harta kekayaan dan kedudukan mulia. Dan Allah mewariskannya kepada Bani Israil. Lalu Fir’aun dan bala tentaranya dapat menyusul mereka pada waktu matahari terbit. Maka ketika kedua golongan itu saling melihat, berkatalah pengikut-pengikut Musa, “Kita benar-benar akan tersusul.” Musa menjawab, “Sekali-kali tidak. Sesungguhnya Tuhanku bersamaku, Dia akan memberi petunjuk kepadaku.” Lalu Allah mewahyukan kepada Musa, “Pukulah laut itu dengan tongkatmu.” Maka terbelahlah lautan itu, dan setiap belahan seperti gunung yang besar. Di sanalah Allah mendekatkan golongan yang lain (Fir’aun dan tentaranya), Allah menyelamatkan Musa dan orang-orang yang bersamanya, dan menenggelamkan golongan yang lain itu (Fir’aun dan tentaranya). Sesungguhnya pada yang demikian itu terdapat suatu tanda (kekuasaan) Allah, tetapi kebanyakan mereka tidak beriman, dan sesungguhnya Tuhanmu Dialah Yang Mahaperkasa lagi Maha Penyayang.” (Lihat Surah Asy Syu’araa’: 53-68) Maksudnya tidak mau mentadabburi ayat-ayat Kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 136",
    "description": "Karena mereka mengingkari janji untuk percaya kepada ajaran tauhid yang dibawa nabi musa, atau mengingkari janjinya membiarkan bani israil berhijrah bersama nabi musa, dan terus berada dalam kekufuran, maka kami membalas mereka dengan siksa yang lebih berat daripada siksa yang pernah mereka rasakan. Lalu ketika siksa itu datang, kami tenggelamkan mereka di laut, yaitu laut merah, disebabkan karena sesungguhnya mereka telah mendustakan ayat-ayat kami yang demikian agung dan jelas, dan mereka sejak dulu hingga kini adalah orang-orang yang lalai padanya. Setelah menyampaikan kesudahan kaum durhaka, ayat ini melanjutkan pemberitaannya tentang umat nabi musa, dengan menyatakan bahwa kami tenggelamkan pengikut-pengikut fir'aun bersamanya dan kami wariskan kepada kaum yang tertindas itu, yaitu bani israil, bu-mi bagian timur dan bagian baratnya, yaitu ne-geri syam, mesir dan negeri-negeri sekitar keduanya yang pernah dikuasai fir'aun dahulu, yang telah kami berkahi dengan berbagai nikmat yang berupa tanaman, buah-buahan dan sungai-sungai serta aneka nikmat lainnya. Dan dengan demikian telah sempurnalah firman tuhanmu yang baik itu sebagai janji untuk bani israil (lihat: surah al-qashash/28: 5-6), disebabkan kesa-baran mereka dalam menghadapi siksaan dan ancaman fir'aun dan kaumnya. Dan kami hancurkan apa yang telah dibuat fir'aun dan kaumnya dan apa yang telah mereka bangun, berupa gedung-gedung pencakar langit dan istana-istana megah serta atap-atap untuk tanaman dan pepohonan yang menjalar layaknya rambatan pohon anggur. Itulah bukti kemahakuasaan Allah, dan terbukti benarlah segala yang dijanjikannya kepada bani israil."
  }
]