[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami wariskan kepada kaum bani israil yang mengalami penistaan sebagai budak-budak pelayan, bagian bumi timur dan bagian bumi barat, (yaitu negeri syam) yang telah kami berkahi dengan di tumbuhkannya berbagai macam tanaman, buah-buahan dan keberadaan sungai-sungai. Dan telah sempurna firman tuhanmu yang paling baik (wahai rasul), pada bani israil dengan memberikan kekuasaan di muka bumi dikarenakan kesabaran mereka menghadapi gangguan dari firaun dan para pengikutnya, dan kami pun telah menghancurkan apa yang dibangun oleh fir’aun dan para pengikutnya yaitu berbagai rumah hunian dan persawahan, serta apa yang telah mereka bangun berupa bangunan-bangunan, istana-istana dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "137. Dan Kami wariskan kepada orang-orang Bani Israil yang sebelumnya ditindas oleh Fir’aun dan para pengikutnya itu bumi bagian timur dan barat. Maksudnya ialah negeri-negeri Syam. Yaitu negeri yang diberkati oleh Allah dengan mengeluarkan hasil pertanian dan buah-buahannya dengan kualitas terbaik. Dan sempurnalah kalimat Rabbmu yang terbaik yang terdapat dalam firman-Nya -Ta'ālā-, \"Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (Mesir) itu, dan hendak menjadikan mereka pemimpin serta menjadikan mereka orang-orang yang mewarisi (bumi).” [Surah Al-Qaṣaṣ: 5]. Kemudian Allah memberi mereka kejayaan di muka bumi berkat kesabaran mereka atas kekejaman Fir’aun dan kaumnya terhadap mereka. Dan Kami hancurkan lahan-lahan pertanian dan pemukiman yang dibuat oleh Fir’aun dan juga istana-istana yang ia bangun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "137. Kemudian kaum yang dahulu tertindas di Mesir itu beri kekuasaan atas negeri Syam yang Kami berkahi dengan kesuburan dan rezeki yang banyak. Dan telah berlalu kalimat Tuhanmu yang baik dengan sempurna bahwa Bani Israil akan mendapat kemenangan dan kejayaan di bumi, berkat kesabaran mereka menghadapi kezaliman Fir’aun dan pengikutnya. Dan Kami hancurkan dengan keagungan dan kekuatan Kami apa yang dibangun oleh Fir’aun dan kaumnya, berupa istana-istana yang megah, rumah-rumah yang tinggi, benteng-benteng yang kokoh, dan kebun-kebun yang berbuah lebat. Di sini Musa memulai perjalanan dakwahnya kepada Bani Israil yang dulu tertindas, karena mereka mereka mengingkari kenikmatan-kenikmatan yang telah Allah berikan, dan melupakan kehinaan dan perbudakan yang dahulu mereka alami, serta lebih memilih menyembah berhala-berhala daripada menyembah Allah, dan berbagai kekafiran dan kemaksiatan lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "137. وَأَوْرَثْنَا الْقَوْمَ (Dan Kami pusakakan kepada kaum) Yakni Bani Israil. الَّذِينَ كَانُوا۟ يُسْتَضْعَفُونَ (yang telah ditindas itu) Yakni tertindas dan dipaksa untuk melayani Fir’aun dan kaumnya. مَشٰرِقَ الْأَرْضِ وَمَغٰرِبَهَا الَّتِى بٰرَكْنَا فِيهَا ۖ( negeri-negeri bahagian timur bumi dan bahagian baratnya yang telah Kami beri berkah padanya) Yakni negeri Baitul Maqdis dan Palestina, mulai dari sungai Urdun sampai laut. Berkah dari tanah tersebut berupa tanaman dan buah-buahan yang tumbuh disana mengeluarkan hasil yang sempurna dan bermanfaat. وَتَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنَىٰ( Dan telah sempurnalah perkataan Tuhanmu yang baik) Yakni yakni berlaku dan berlangsung dengan sempurna. Dan yang dimaksud dengan perkataan disini ialah firman Allah: ونريد أن نمن على الذين استضعفوا في الأرض ونحعلهم الوارسين. ونمكن لهم في الأرض “Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (Mesir) itu dan hendak menjadikan mereka pemimpin dan menjadikan mereka orang-orang yang mewarisi (bumi). dan akan Kami teguhkan kedudukan mereka di muka bumi” عَلَىٰ بَنِىٓ إِسْرٰٓءِيلَ(untuk Bani Israil) Berkat kesabaran mereka atas apa yang menimpa mereka dari Fir’aun dan kaumnya dan kesabaran mereka dalam berjihad. وَمَا كَانُوا۟ يَعْرِشُونَ (dan apa yang telah dibangun mereka) Berupa kebun-kebun. Dan pendapat lain mengatakan berupa bangunan-bangunan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan bagaimana kisah yang menceritakan kekejaman fir'aun dan bala tentaranya, kemudian datang setelahnya peristiwa kelahiran Musa yang dibesarkan dalam lingkungan kerajaannya, dan setelah berjalannya 40 tahun dalam kekerasan datanglah pertolongan yang besar kepada Musa : { وَدَمَّرْنَا مَا كَانَ يَصْنَعُ فِرْعَوْنُ وَقَوْمُهُ وَمَا كَانُوا يَعْرِشُونَ } \"Dan Kami hancurkan apa yang telah dibuat Fir'aun dan kaumnya dan apa yang telah dibangun mereka.\" maka kemanakah hasil dari persiapan dan berjuangan yang keras untuk mewujudkan kemenangan mereka ?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "137. Dan Kami wariskan kepada kaum Bani Israil yang dihinakan dengan melayani Fir’aun itu tanah Mesir dan Syam yang Kami berkahi dengan menumbuhkan tanam-tanaman dan buah-buahan yang melimpah. Dan sempurnalah berlakunya janji Allah bagi Bani Israil dengan membinasakan Fir’aun dan Kaumnya karena kesabaran mereka atas siksaan Fir’aun dan para pemukanya, dan beban berat yang mereka pikul. Dan Kami hancurkan dan runtuhkan apa yang dibuat Fir’aun dan kaumnya berupa bangunan dan tanaman, sedangkan mereka tidak pernah membangun bangunan-bangunan dari krom dan pepohonan. Dan warisan dunia yang disebutkan itu abadi, melainkan hanya sebatas ketika mereka tetap istiqamah menjalankan perintah Allah, Kemudian Allah merembut hal itu dari mereka akibat kezaliman mereka, sehingga tidak ada satupun bagi mereka sumber sejarah yang sesuai dengan hal yang mereka sebut tanah perjanjian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami mewariskan kepada kaum yang selalu tertindas itu} mereka yang direndahkan dengan disembelih anak-anak laki-lakinya dan digunakan sebagai pelayan anak-anak perempuannya {bagian timur bumi} negeri Syam {dan bagian baratnya yang telah Kami berkahi. Sempurnalah firman Tuhanmu yang baik itu untuk Bani Israil} telah menjadi nyata janji Allah yang tidak mungkin diingkari kepada Bani israil dengan memusnahkan musuh mereka dan menjadikan mereka penguasa di bumi {karena kesabaran mereka. Kami menghancurkan} meruntuhkan {apa yang telah dibuat Fir‘aun dan kaumnya dan apa pun yang telah mereka bangun} istana yang mereka bangun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "137 “dan kami pusakakan kepada kaum yang telah ditindas itu” di bumi yakni bani israil yang dulu adalah pelayan bagi keluarga fir’aun yang telah menipakan kepada mereka azab yang buruk. Allah mempusakakan kepada mereka “negeri-negeri bagain timur bumi dan bagian baratnya” yang dimaksud dengan bumi disini adalah bumi mesir dimana padanyalah mereka ditindas dan dijajah, yakni Allah menguasakannya kepada mereka dan menjadikan mereka penguasanya. \"Dan telah sempurnalah perkataan Tuhanmu yang baik (sebagai janji) untuk Bani Israil disebabkan kesabaran mereka.” Ketika Musa berkata kepada mereka \"“Mohonlah pertolongan kepada Allah dan bersabarlah; sesungguhnya bumi (ini) kepunyaan Allah; dipusakakan-Nya kepada siapa yang dihendaki-Nya dari hamba-hamba-Nya. Dan kesudahan yang baik adalah bagi orang-orang yang bertakwa”.\"dan kami hancurkan apa yang telah dibuat fir’aun dan kaumnya” yakni bangunan-bangunan yang besar dan tempat tinggal yang indah, ”dan apa yang telah dibangun mereka” itulah rumah-rumah mereka yang hancur karena kezhaliman mereka, sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi kaum yang mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 137: Mereka adalah Bani Israil, di mana sebelumnya mereka diperbudak. Maksudnya negeri Syam, Mesir dan negeri-negeri sekitar keduanya yang pernah dikuasai Fir'aun dahulu. Setelah kerajaan Fir'aun runtuh, negeri-negeri itu diwarisi oleh Bani Israil. Yaitu firman-Nya di Surah Al Qashash ayat 5, “Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (Mesir) itu dan hendak menjadikan mereka pemimpin dan menjadikan mereka orang-orang yang mewarisi (bumi).” Terhadap gangguan musuh mereka. Yang dimaksud dengan bangunan-bangunan Fir'aun yang dihancurkan oleh Allah adalah bangunan-bangunan yang didirikan mereka dengan menindas Bani Israil, seperti kota Ramses; menara yang diperintahkan Hamaan untuk didirikan dan sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 137",
    "description": "Setelah menyampaikan kesudahan kaum durhaka, ayat ini melanjutkan pemberitaannya tentang umat nabi musa, dengan menyatakan bahwa kami tenggelamkan pengikut-pengikut fir'aun bersamanya dan kami wariskan kepada kaum yang tertindas itu, yaitu bani israil, bu-mi bagian timur dan bagian baratnya, yaitu ne-geri syam, mesir dan negeri-negeri sekitar keduanya yang pernah dikuasai fir'aun dahulu, yang telah kami berkahi dengan berbagai nikmat yang berupa tanaman, buah-buahan dan sungai-sungai serta aneka nikmat lainnya. Dan dengan demikian telah sempurnalah firman tuhanmu yang baik itu sebagai janji untuk bani israil (lihat: surah al-qashash/28: 5-6), disebabkan kesa-baran mereka dalam menghadapi siksaan dan ancaman fir'aun dan kaumnya. Dan kami hancurkan apa yang telah dibuat fir'aun dan kaumnya dan apa yang telah mereka bangun, berupa gedung-gedung pencakar langit dan istana-istana megah serta atap-atap untuk tanaman dan pepohonan yang menjalar layaknya rambatan pohon anggur. Itulah bukti kemahakuasaan Allah, dan terbukti benarlah segala yang dijanjikannya kepada bani israil. Dan setelah kami menyelamatkan mereka dan menenggelamkan fir'aun, kami selamatkan bani israil menyeberangi laut itu, yaitu bagian utara dari laut merah. Ketika mereka sampai kepada suatu kaum yang tekun menyembah berhala, muncul keinginan untuk melakukan kebiasaan lama mereka, kebiasaan menyembah berhala yang dilakukan di mesir. Mereka lalu meminta nabi musa untuk membuatkan patung berhala untuk disembah, seperti yang dilakukan oleh kaum yang mereka lihat itu. Mereka bani israil berkata, wahai musa! buatlah untuk kami sebuah tuhan berhala untuk kami sembah sebagaimana mereka mempunyai beberapa tuhan berhala. Nabi musa berusaha mencegah keinginan mereka dan dengan nada mencela, dia menjawab, sungguh, kamu orang-orang yang bodoh, tidak memahami keagungan Allah dan tidak mengetahui bahwa yang patut disembah hanyalah tuhan yang maha esa."
  }
]