[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah seberangkan bani israil melintasi laut, kemudian mereka melewati suatu kaum yang bersimpuh dan menekuni penyembahan terhadap berhala-berhala mereka. bani israil berkata (kepada musa), ”jadikanlah bagi kami wahai Musa patung yang akan kami sembah dan kami jadikan sebagai tuhan seperti orang-orang itu memiliki patung-patung yang mereka sembah.” maka musa berkata kepada mereka, ”Wahai kaumku, sesungguhnya kalian itu orang-orang bodoh yang tidak paham akan keagungan Allah, dan kalian tidak mengetahui bahwa sesungguhnya ibadah itu tidak sepatutnya di kerjakan kecuali bagi Allah semata, Dzat yang Maha Esa lagi maha perkasa. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "138. Dan Kami bawa orang-orang Bani Israil menyeberangi lautan tatkala Musa memukulkan tongkatnya dan laut terbelah. Kemudian mereka berjumpa dengan kaum yang sedang menyembah berhala. Mereka menyembah berhala-berhala mereka selain Allah. Lalu orang-orang Bani Israil berkata kepada Musa -‘Alaihissalām-, “Wahai Musa! Buatkanlah berhala untuk kami agar kami bisa menyembahnya sebagaimana mereka menyembah berhala-berhala mereka selain Allah.” Maka Musa berkata kepada mereka, “Wahai kaumku! Sesungguhnya kalian adalah orang-orang yang tidak mengerti apa yang harus kalian lakukan kepada Allah, yaitu mengagungkan dan mengesakan-Nya. Dan kalian juga tidak mengerti apa yang tidak boleh kalian lakukan terhadap Allah, yaitu menyekutukan-Nya dengan sesuatu maupun menyembah tuhan lain selain Dia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "138. Setelah Allah membalas Fir’aun dan balatentaranya dengan menenggelamkan mereka di depan mata Bani Israil; mereka kemudian menuju ke arah timur setelah menyebrangi laut. Setelah mereka menyebrangi laut yang menenggelamkan musuh mereka, mereka melihat satu kaum yang menyembah berhala-berhala. Maka mereka meminta nabi mereka, Musa, untuk membuatkan mereka berhala-berhala seperti yang dimiliki kaum tersebut. Maka Musa marah besar dan mengolok-olok mereka, dan menyebut mereka sebagai kaum yang bebal dan selalu dalam kejahilan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "138. وَجٰوَزْنَا بِبَنِىٓ إِسْرٰٓءِيلَ الْبَحْرَ (Dan Kami seberangkan Bani Israil ke seberang lautan itu) Yakni Kami berikan mereka kemampuan untuk menyeberangi lautan itu dengan pukulan dari tongkat Nabi Musa sehingga lautannya terbelah dan mereka dapat melewatinya. Dan itu adalah di laut suez. فَأَتَوْا۟ عَلَىٰ قَوْمٍ يَعْكُفُونَ عَلَىٰٓ أَصْنَامٍ لَّهُمْ ۚ (maka setelah mereka sampai kepada suatu kaum yang tetap menyembah berhala mereka) Mereka menyembah berhala tersebut. Terdapat pendapat mengatakan mereka adalah kaum dari bani Lakhm yang memiliki berhal-berhala berupa patung sapi. Pendapat lain mengatakan mereka adalah kaum dari bani Kan’an. قَالُوا۟ يٰمُوسَى اجْعَل لَّنَآ إِلٰهًا (Bani lsrail berkata: “Hai Musa. buatlah untuk kami sebuah tuhan (berhala)) Yakni patung yang kami sembah seperti yang mereka miliki. قَالَ إِنَّكُمْ قَوْمٌ تَجْهَلُونَ (Musa menjawab: “Sesungguh-nya kamu ini adalah kaum yang tidak mengetahui) Mereka telah menyaksikan mukjizat dari Allah yang dapat mencegah seseorang yang paling bodoh sekalipun yang melihatnya dari permintaan untuk menyembah selain Allah. Akan tetapi Bani Israil adalah makhluk yang paling bebal, bodoh, dan pengkhianat. Dalam hadist disebutkan bahwa suatu hari para sahabat melihat orang-orang musyrik memiliki sebuah pohon yang disebut dengan dzatu anwath (pohon yang diberi berbagai gantungan), orang-orang musyrik tersebut menjadikannya tempat ibadah dan menggantungkan senjata-senjata mereka disana. Para sahabat berkata kepada Rasulullah: “Buatkanlah kami dzatu anwath sebagaimana mereka memiliki dzatu anwath”. Rasulullah menjawab: “hampir saja kalian mengatakan seperti apa yang dikatakan pengikut Nabi Musa: “buatlah untuk kami sebuah tuhan (berhala) sebagaimana mereka memiliki berhala-berhala”.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "138. Lalu Kami seberangkan mereka dari perlintasan laut Suez dengan selamat dan aman, lalu mereka bertemu dengan kaum yang menyembah berhala, lalu mereka berkata: “Wahai Musa, buatkanlah kami tuhan atau berhala yang bisa kami sembah sebagaimana berhala-berhala yang dimiliki kaum tersebut.” Musa berkata: “Sesungguhnya kalian tidak mengetahui ketuhanan dan keagungan Allah. Hanya Dia yang layak disembah bukan selainNya. Dan sungguh kalian telah menyaksikan peringatan agar tidak menyembah selain Allah di antara ayat-ayatNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menyeberangkan} menyeberangkan {Bani Israil (melintasi) laut itu. Lalu mereka mendatangi} bertemu {suatu kaum yang masih tetap menyembah} yang tetap menyembah {berhala mereka. Bani Israil berkata,“Wahai Musa, buatlah untuk kami tuhan} berhala yang bisa kami sembah {sebagaimana tuhan-tuhan mereka”} berhala-berhala yang mereka sembah {Musa menjawab,“Sesungguhnya kalian adalah kaum yang bodoh.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "138 “dan kami seberangkan bani israil ke seberang lautan itu” setelah Allah menyelamatkan mereka dari musuh mereka, yaitu fir’aun dan bala tentaranya, dimana Allah telah membinasakan mereka sementara bani israil melihatnya. ”maka setelah mereka sampai” yakni melewati “kepada sesuatu kaum yang sedang menyembah berhala mereka” yakni mereka berdiam padanya, ngalap berkah padanya, dan menyembahnya, lalu mereka berkata kepada nabi mereka, Musa as karena kebodohan dan ketidaktahuan mereka setelah sebelumnya Allah menunjukan kepada mereka ayat-ayatNya. ”hai musa buatlah untuk kami sebuah tuhan (berhala) sebagaimana mereka mempunyai beberapa tuhan (berhala)\" yakni izinkan kami menjadikan berhala-berhala sebagai tuhan kami seperti yang mereka lakukan. Maka Musa menjawab “sesungguhnya kalian ini adalah kaum yang tidak mengetahui (sifat-sifat tuhan)” adakah kejahilan yang lebih besar daripada kejahilan orang tentang tuhan dan penciptanya dan dia ingin menyamakanNya dengan selainNya yang tidak dapat mendatangkan manfaat, mudarat, kematian, kehidupan dan kebangkitan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 138: Maksudnya bagian utara dari laut Merah. Kebodohan apa yang melebihi kebodohan seseorang sampai tidak mengenal Tuhannya dan Penciptanya serta berkeinginan untuk menyamakan yang lain dengan-Nya, padahal yang lain itu tidak berkuasa memberi manfaat dan menghindarkan bahaya, serta tidak berkuasa menghidupkan, mematikan dan membangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 138",
    "description": "Dan setelah kami menyelamatkan mereka dan menenggelamkan fir'aun, kami selamatkan bani israil menyeberangi laut itu, yaitu bagian utara dari laut merah. Ketika mereka sampai kepada suatu kaum yang tekun menyembah berhala, muncul keinginan untuk melakukan kebiasaan lama mereka, kebiasaan menyembah berhala yang dilakukan di mesir. Mereka lalu meminta nabi musa untuk membuatkan patung berhala untuk disembah, seperti yang dilakukan oleh kaum yang mereka lihat itu. Mereka bani israil berkata, wahai musa! buatlah untuk kami sebuah tuhan berhala untuk kami sembah sebagaimana mereka mempunyai beberapa tuhan berhala. Nabi musa berusaha mencegah keinginan mereka dan dengan nada mencela, dia menjawab, sungguh, kamu orang-orang yang bodoh, tidak memahami keagungan Allah dan tidak mengetahui bahwa yang patut disembah hanyalah tuhan yang maha esa. Yang mereka lakukan itu tentu tidak benar, dan sebagai akibatnya, sesungguhnya mereka para penyembah berhala yang kamu lihat tekun itu akan dihancurkan apa yang sedang mereka anut, yaitu akan punah kepercayaan dan ajaran syirik mereka, dan akan sia-sia, tidak bermanfaat sedikit pun, apa yang selalu mereka kerjakan, sebab sembahan itu tidak dapat menyelamatkan mereka dari siksa Allah ketika datang."
  }
]