[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang duduk bersimpuh di depan berhala-berhala tersebut, akan dihancurkan kesyirikan yang ada pada mereka, dan akan disirnakan dan lenyap apa yang mereka perbuat yang berupa penyembahan terhadap berhala-berhala yang sama sekali tidak dapat menghalangi siksaan Allah dari mereka, jika ia turun menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "139. Sesungguhnya orang-orang yang menyembah berhala itu dihancurkan keyakinannya dalam menyembah selain Allah dan hangus semua (pahala) amal kebajikan yang pernah mereka lakukan, karena mereka menyekutukan Allah dan menyembah tuhan lain selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "139. Kemudian Musa menjelaskan kepada mereka bahwa penyembahan kepada berhala yang ingin mereka ikuti pasti akan hancur dan lenyap, karena agama Tauhid akan menguasai negeri ini, sehingga ibadah hanya akan ditujukan kepada Allah Yang Maha Esa dan Perkasa. Dan penyembahan kepada berhala tidak akan memberi mereka manfaat atau menjauhkan mudharat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "139. إِنَّ هٰٓؤُلَآءِ (Sesungguhnya mereka itu) Yakni yang menyembah berhala-berhala. مُتَبَّرٌ مَّا هُمْ فِيهِ(akan dihancurkan kepercayaan yang dianutnya) Makna (التبار) yakni hancur dan binasa. Dan makna مَّا هُمْ فِيهِ yaitu penyembahan terhadap berhala-berhala. وَبٰطِلٌ مَّا كَانُوا۟ يَعْمَلُونَ (dan akan batal apa yang seIalu mereka kerjakan) Yakni sirna dan lenyap segala yang mereka perbuat berupa amalan-amalan yang mereka persembahkan untuk berhala-berhala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "139. Sesungguhnya para penyembah berhala tersebut akan dihancurkan dan dibinasakan, yaitu penyembahan mereka kepada berhala. Seluruh perbuatan mereka berupa amal dan penyembahan berhala itu akan hilang dan lenyap."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya apa yang mereka anut akan dihancurkan} dihancurkan {dan akan sia-sia} lenyap {apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "139 oleh karena itu Musa berkata kepada mereka. ”sesungguhnya mereka itu akan dihancurkan oleh kepercayaan yang dianutnya dan akan batal apa yang selalu mereka kerjakan” karena do'a mereka pada berhala-berhala itu adalah batil dan ia sendiri adalah batil amal dan tujuannya adalah sama-sama batil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 139: Karena doa mereka kepadanya adalah batil (sia-sia), berhala-berhal itu juga batil, sehingga amal mereka batil dan buah(hasil)nya juga batil (sia-sia)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 139",
    "description": "Yang mereka lakukan itu tentu tidak benar, dan sebagai akibatnya, sesungguhnya mereka para penyembah berhala yang kamu lihat tekun itu akan dihancurkan apa yang sedang mereka anut, yaitu akan punah kepercayaan dan ajaran syirik mereka, dan akan sia-sia, tidak bermanfaat sedikit pun, apa yang selalu mereka kerjakan, sebab sembahan itu tidak dapat menyelamatkan mereka dari siksa Allah ketika datangselanjutnya dia, yakni nabi musa berkata, pantaskah aku mencari tuhan untukmu selain Allah, padahal seandainya tidak ada anugerah-Nya kepada kamu selain bahwa dia yang telah menciptakan dan melebihkan kamu atas segala umat pada masa itu, dengan diturunkan banyak nabi dari kalangan kamu dan keutamaan lainnya, maka cukup sudah itu menjadi kewajaran bahkan kewajiban bagi kamu untuk beribadah dan mengabdi kepada-Nya saja."
  }
]