[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iblis berkata kepada Allah , ketika telah putus asa dari rahamat Allah, ”berilah aku kesempatan sampai hari kebangkitan, dan hal itu bertujuan agar aku bisa menyesatkan siapa saja yang dapat aku sesatkan dari keturunan Adam. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Iblis menjawab, “Wahai Rabbku! Berilah aku kesempatan hidup sampai hari Kiamat agar aku bisa menyesatkan manusia yang bisa kusesatkan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Lalu Iblis memohon kepada Tuhannya agar dia dapat hidup kekal sampai hari kiamat. Maka Allah mengabulkan permohonan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. قَالَ أَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ (Iblis menjawab: “Beri tangguhlah saya sampai waktu mereka dibangkitkan”) yakni meminta agar tidak mati selamanya, karena setelah hari kebangkitan tidak ada kematian lagi. Dan yang dimaksud adalah sampai dibangkitkannya Adam dan keturunannya di hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Iblis berkata: “Wahai Tuhan, abaikanlah aku dan jangan percepat kematianku sampai hari kebangkitan yang mana Adam dan keturunannya dibangkitkan dari kuburannya di tiupan (sangkakala) kedua”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Iblis menjawab, “Berilah aku penangguhan waktu} akhirkanlah dan tangguhkanlah aku {sampai hari mereka dibangkitkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. ketika musuh Allah mengumumkan permusuhannya kepada Allah, Adam anak cucunya, dia meminta kepada Allah penangguhan tempo sampai Hari kebangkitan, agar dapat menyesatkan bani Adam dengan apa yang dia mampu. Manakala hikmah Allah menuntut adanya ujian kepada hamba-hambaNya agar jelas mana yang benar keimanannya dan mana yang dusta, siapa yang taat kepadaNYa dan siapa yang taat kepada RasulNYa, maka Allah mengabulkan permintaannya. Dia berfirman ”sesungguhnya kamu termasuk mereka yang diberi tangguh”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 14: Maksudnya: janganlah saya dan anak cucu saya dimatikan sampai hari kiamat sehingga saya berkesempatan menggoda Adam dan anak cucunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 14",
    "description": "Ketika iblis memproklamasikan diri sebagai musuh Allah dan nabi adam serta keturunannya, ia meminta agar Allah menangguhkan usianya sampai hari kiamat. Iblis menjawab perintah Allah untuk keluar dari dalam surga, berilah aku penangguhan waktu, panjangkanlah usia-ku, dan janganlah engkau wafatkan aku sampai hari kiamat, yaitu hari ketika mereka, semua manusia, dibangkitkan agar aku dapat menyesatkan adam dan keturunannya. Dengan hikmah yang dimiliki-Nya, Allah menjadikan iblis sebagai ujian buat umat manusia dan mengabulkan permintaan iblis tersebut. Allah berfirman, benar, kamu termasuk yang diberi penangguhan waktu sampai hari yang ditentukan, yaitu ketika semua makhluk yang hidup dimatikan. (lihat: surah al-a'ijr/15: 38)."
  }
]