[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian (wahai bani israil), nikmat-nikmat kami yang tercurah atas kalian ketika kami menyelamatkan kalian dari penawana fir’aun dan keluarganya, dan keadaan hina dan nista yang meliputi kalian dalam bentuk disembelihnya anak-anak lelaki kalian dan dibiarkan hidup perempuan-perempuan kalian untuk dijadikan pelayan dan penghinaan, serta membawa kalian untuk menghadapi siksaan yang sangat jahat lagi paling menyengsarakan, lalu kami menyelamatkan kalian dari kondisi tersebut, semua ini merupakan cobaan dari Allah, sekaligus menjadi kenikmatan sangat besar bagi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "141. Dan ingatlah -wahai Bani Israil- tatkala Kami menyelamatkan kalian dengan membebaskan kalian dari penindasan Fir’aun dan kaumnya. Yaitu ketika mereka menimpakan beragam tekanan kepada kalian, membunuh anak-anak laki-laki kalian dan mempertahankan anak-anak perempuan kalian untuk dijadikan sebagai pelayan. Dan pembebasan kalian dari penindasan Fir’aun dan kaumnya itu merupakan ujian besar dari Rabb kalian yang menuntut kalian untuk bersyukur kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "141. Musa juga mengingatkan mereka bahwa Allah telah menyelamatkan mereka dari azab dan siksaan, sebagai ujian; apakah mereka akan bersyukur atau mengingkari kenikmatan itu? Maka ingatlah itu hai Bani Israil, agar kalian memperoleh ibrah dan pelajaran, dan bersyukur kepada Allah yang telah memberi kalian kenikmatan ketika menyelamatkan kalian dari kaum Fir’aun yang dahulu menyiksa kalian dengan azab yang sangat berat -yaitu dengan membunuh kaum lelaki mereka dan membiarkan hidup kaum perempuan mereka untuk dijadikan pelayan-. Dan dalam azab jasmani dan rohani yang kalian dapatkan, dan keselamatan kalian darinya, merupakan ujian yang jelas bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "141. يَسُومُونَكُمْ سُوٓءَ الْعَذَابِ ۖ (yang mengazab kamu dengan azab yang sangat jahat) Yakni menyiksa kalian dengan siksaan yang sangat berat sehingga kalian terbiasa dengannya seperti seekor unta yang terbiasa digembalakan. وَفِى ذٰلِكُم (Dan pada yang demikian itu) Yakni pada keselamatan yang diberikan Allah dari mara bahaya yang besar ini. بَلَآءٌ مِّن رَّبِّكُمْ عَظِيمٌ (cobaan yang besar dari Tuhanmu) Dan keselamatan itu merupakan nikmat yang besar, yang diberikan sebagai ujian dan cobaan bagi kalian, apakah kalian mensyukurinya. Lalu bagaimana kalian meminta untuk mendapatkan tuhan selain-Nya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "141. Wahai Bani Israil, Ingatlah, sebaiknya kalian bersyukur kepada Allah, ketika Kami membebaskan kalian dari keluarga Fir’aun yang memberi kalian siksa yang paling berat, yaitu membunuh anak laki-laki kalian dan membiarkan anak perempuan kalian tetap hidup untuk dijadikan pelayan. Dan dalam pertolongan dari marabahaya itu terdapat ujian dan cobaan yang agung dari Tuhan kalian supaya kalian bersyukur atas nikmat dan keutamaanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Kami menyelamatkan kalian dari para pengikut Fir‘aun yang menimpakan kepada kalian} membuat kalian merasakan {buruknya} kerasnya {siksaan. Mereka membunuh anak laki-laki kalian dan membiarkan hidup anak-anak perempuan kalian. Pada yang demikian itu terdapat cobaan} ujian {yang besar dari Tuhan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141 kemudian Musa mengingatkan mereka dengan nikmat Allah kepada mereka, dia berkata “dan ingatlah hai bani israil ketika kami menyelamatkan kamu dari Fir’aun dan kaumnya.” yakni fir’aun dan bala tentaranya. ”yang mengazab kamu dengan azab yang sangat jahat.” yakni menimpakkan kepadamu azab paling buruk, dimana mereka menyembelih “anak-anak lelakimu dan membiarkan hidup wanita-wanitamu. Dan apa yang demikian itu” yakni kebebasan dari azab mereka adalah “cobaan yang besar dari Rabbmu” yakni nikmat yang besar dan karunia yang agung. Atau pada azab yang mereka timpakkan itu terdapat ujian besar dari Rabbmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 141: Balaa’ bisa berarti cobaan, dan bisa berarti nikmat. Sebagai cobaan adalah ketika mereka ditimpakan siksa yang berat, berupa dibunuhnya anak laki-laki mereka dan dibiarkan hidup anak perempuannya, sedangkan sebagai nikmat adalah ketika Allah menyelamatkan mereka dari kekejamaan itu. Maka apakah kamu tidak mengambil pelajaran daripadanya sehingga kamu tidak meminta hal itu (dibuatkan berhala)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 141",
    "description": "Dan ingatlah, wahai bani israil, ketika kami menyelamatkan kamu dari siksaan para pengikut fir'aun, yang menyiksa kamu dengan siksaan yang sangat berat atas perintah fir'aun. Kamu dipaksa melayani mereka untuk melaksanakan pekerjaan-peker-jaan kasar dan sulit. Bahkan, di mata mereka, kamu seperti binatang, tidak mempunyai kehormatan sedikit pun. Di antara bentuk siksaan itu, mereka membunuh anak-anak laki-lakimu dan membiarkan hidup anak-anak perempuanmu. Dan pada yang demikian itu merupakan cobaan yang sangat besar dari tuhan pemelihara kamu, yang tidak ada ujian dan cobaan seberat itu. Dan kami telah menjanjikan kepada nabi musa untuk bermunajat kepada kami dan kami memberikan kitab taurat setelah berlalu waktu tiga puluh malam. Dan untuk melengkapi ibadahnya, kami sempurnakan jumlah malam itu dengan sepuluh malam lagi, maka sempurnalah waktu yang telah ditentukan tuhan pemeliharanya, yaitu empat puluh malam. Dan ingat juga ketika nabi musa berkata kepada saudaranya, yaitu nabi harun, sebelum keberangkatannya untuk memenuhi janji itu, gantikanlah aku dalam memimpin kaumku sampai aku kembali, dan perbaikilah dirimu dan kaummu, dan janganlah engkau mengikuti jalan orangorang yang berbuat kerusakan."
  }
]