[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah telah menjanjikan kepada Musa untuk bermunajat kepada tuhannya selama tiga puluh malam. Kemudian Allah menambah tempo masanya setelah itu dengan sepuluh malam. Dengan demikian, sempurnalah masa yang Allah tentukan bagi Musa untuk Dia berbicara dengannya menjadi empat puluh malam. Musa berkata kepada sauadaranya, Harun , (ketika hendak pergi berjalan untuk bermunajat kepada tuhannya), ”jadilah engkau pengganti diriku bagi kaumku hingga aku pulang. Dan bawalah mereka untuk taat kepada Allah dan beribadahlah kepadaNYa. Dan janganlah engkau mengikuti jalan orang-orang yang berbuat kerusakan di muka bumi. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "142. Dan Allah menjanjikan kepada utusan-Nya, Musa, untuk bermunajat dengan-Nya selama tiga puluh malam. Kemudian Allah menyempurnakannya dengan menambah sepuluh malam sehingga menjadi empat puluh malam. Dan ketika hendak pergi bermunajat dengan Rabbnya Musa berkata kepada saudaranya, Harun, “Wahai Harun! Gantikanlah kedudukanku di tengah-tengah kaumku. Uruslah urusan mereka dengan baik dan lemah lembut. Dan janganlah kamu mengikuti jejak orang-orang yang membuat kerusakan dengan melakukan perbuatan maksiat dan menjadi penolong bagi orang-orang yang bermaksiat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "142. Allah memerintahkan Musa untuk menyendiri selama empat puluh malam, agar menyiapkan dirinya melakukan pertemuan dengan Allah dan menerima Taurat. Hai ini agar turunnya Taurat menjadi sesuatu yang sangat berarti baginya dan selalu dia nantikan. Maka Musa berjanji kepada Tuhannya untuk memenuhi waktu yang telah ditetapkan itu. Setelah Musa menyelesaikan masa empat puluh hari, dia hendak pergi ke bukit Thur untuk bertemu Tuhannya; dan sebelum dia pergi, dia berpesan kepada saudaranya, Harun: “Jadilah penggantiku di kaumku, perbaikilah mereka dengan kesabaranmu agar mereka menyembah Allah dan mentaati-Nya. dan jauhilah jalan orang-orang yang sesat dan berbuat kerusakan.” Musa khawatir kaumnya akan mendapat keburukan, kerena dia mengetahui iman mereka sangat lemah, dan syahwat dan hawa nafsu menguasai mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "142. وَوٰعَدْنَا مُوسَىٰ ثَلٰثِينَ لَيْلَةً (Dan telah Kami janjikan kepada Musa (memberikan Taurat) sesudah berlalu waktu tiga puluh malam) Ini merupakan bagian dari kemuliaan yang diberikan Allah kepada nabi Musa. Allah memberikan tenggang waktu ini sebagai waktu untuk bermunajat dan berbicara dengan-Nya. Dan hal ini agar menjadi penambah keimanan dan keyakinannya sebagaimana yang Dia lakukan kepada Nabi Muhammad di malam isra’ mi’raj, dan juga agar Allah dapat mengambil perjanjian dengannya dan memberinya Taurat. وَأَتْمَمْنٰهَا بِعَشْرٍ(dan Kami sempurnakan jumlah malam itu dengan sepuluh (malam lagi)) Yakni Kami tambah dengan sepuluh hari setelah ia mendatangi tempat perjanjian. وَقَالَ مُوسَىٰ لِأَخِيهِ هٰرُونَ اخْلُفْنِى فِى قَوْمِى (Dan berkata Musa kepada saudaranya yaitu Harun: “Gantikanlah aku dalam (memimpin) kaumku) Yakni jadilah penggantiku bagi mereka. Musa mengatakan perkataan ini ketika ia akan pergi untuk bermunajat. وَأَصْلِحْ(dan perbaikilah) Musa memerintahkannya untuk berbuat baik dan berlemah lembut dalam memperlakukan bani Israil serta memperhatikan kebutuhan mereka. وَلَا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ(dan janganlah kamu mengikuti jalan orang-orang yang membuat kerusakan”) Janganlah kamu menempuh jalan orang-orang yang bermaksiat dan jangan menjadi ponolong orang-orang zalim, namu tempuhlah jalan orang-orang yang baik dan yang membuat perbaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَوَاعَدْنَا مُوسَىٰ ثَلَاثِينَ لَيْلَةً وَأَتْمَمْنَاهَا بِعَشْرٍ } \"Dan telah Kami janjikan kepada Musa (memberikan Taurat) sesudah berlalu waktu tiga puluh malam,\" tidak nampak secara pasti apakah miqat telah selesai pada hari ke 30 atau pada hari ke-40 setelah ditambah 10 hari lainnya ? lalu Allah berfirman : { فَتَمَّ مِيقَاتُ رَبِّهِ أَرْبَعِينَ لَيْلَةً } \"maka sempurnalah waktu yang telah ditentukan Tuhannya empat puluh malam\", maka kita kemudian mengetahui bahwa 10 hari itu masuk ke dalam waktu yang ditentukan lebih awal, dan menjadi bagian darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "142. Dan telah Kami janjikan kepada Musa dengan Taurat setelah berlalu waktu 30 malam bermunajat kepada Kami, yaitu mendirikan shalat di malam hari dan puasa di siang hari. Kemudian Kami beri dia tambahan 10 hari setelah sampai pada Miqatnya (yaitu waktu tertentu untuk mengerjakan sesuatu), sehingga sempurna waktu munajat itu sebanyak 40 malam. Musa berkata kepada saudaranya, Harun ketika hendak bermunajat: “Jadilah kamu wakilku atas mereka. Uruslah perkara Bani Israil dengan menemani mereka dan menghilangkan masalah mereka serta jangan sampai menapaki jalannya orang-orang yang bermaksiat dengan menyetujui kemaksiatan dan membantu orang-orang zalim”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menjanjikan Musa pada tiga puluh malam. Kami menyempurnakan jumlah malam itu dengan sepuluh (malam). Maka sempurnalah waktu yang telah ditentukan Tuhannya menjadi empat puluh malam. Musa berkata kepada saudaranya, Harun,“Gantikanlah aku} jadilah penggantiku {untuk kaumku, perbaikilah, dan janganlah kamu mengikuti jalan} janganlah kamu melintasi jalan {orang-orang yang berbuat kerusakan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "142 Manakala Musa menasihati dan mengingatkan mereka, merekapun menghentikan apa yang mereka inginkan berupa berhala, dan ketika Allah menyempurnakan nikmatNya dengan keselamatan dari musuh mereka dan kekuasaan di muka bumi maka Allah ingin menyempurnakan nikmmatNya dengan menurunkan kitab yang padanya terdapat hukum-hukum syariat dan akidah yang lurus. Maka Allah menjanjikan kepada Musa tiga puluh malam ditambah dengan sepuluh jadi empat puluh malam, agar Musa pergi untuk bermunajat kepada Rabbnya Musa mewasiatkan bani israil kepada harun hal itu karena kasih sayangnya dan ketulusan kepada mereka ”gantikanlah aku dalam memimpin kaumku” yakni jadilah kamu penggantiku dan lakukan kepada mereka apa yang aku lakukan. ”dan perbaikilah” yakni ikutilah jalan kebaikan ”dan janganlah kamu mengikuti jalan orang-orang yang membuat kerusakan” yaitu orang-orang yang berbuat kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 142: Ketika Alah telah menyempurnakan nikmat-Nya kepada mereka dengan menyelamatkan mereka dari Fir’aun dan bala tentaranya, memberi mereka tempat di bumi, Allah ingin menyempurnakan lagi nikmat-Nya kepada mereka, yaitu dengan menurunkan kitab yang mengandung hukum-hukum syar’i dan ‘aqidah yang diridhai, maka Allah Ta’ala menjanjikan Musa untuk memberikan kitab itu setelah berlalu tiga puluh hari, dan ditambah lagi sepuluh hari sehingga jumlahnya empat puluh hari agar Nabi Musa ‘alaihis salam bersiap-siap terhadap janji itu. Ketika Musa hendak pergi ke bukit untuk bermunajat kepada Allah. Dengan menyepakati mereka berbuat maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 142",
    "description": "Dan kami telah menjanjikan kepada nabi musa untuk bermunajat kepada kami dan kami memberikan kitab taurat setelah berlalu waktu tiga puluh malam. Dan untuk melengkapi ibadahnya, kami sempurnakan jumlah malam itu dengan sepuluh malam lagi, maka sempurnalah waktu yang telah ditentukan tuhan pemeliharanya, yaitu empat puluh malam. Dan ingat juga ketika nabi musa berkata kepada saudaranya, yaitu nabi harun, sebelum keberangkatannya untuk memenuhi janji itu, gantikanlah aku dalam memimpin kaumku sampai aku kembali, dan perbaikilah dirimu dan kaummu, dan janganlah engkau mengikuti jalan orangorang yang berbuat kerusakan. Dan ingatlah ketika musa datang untuk bermunajat pada waktu yang telah kami tentukan, yaitu empat puluh malam, dan tuhan telah berfirman langsung kepadanya, menyampaikan wahyu melalui suatu dialog yang tidak sama dengan pembicaraan yang dilakukan manusia, nabi musa ingin mendapat lebih dari itu dan berkata, tuhan pemeliharaku, tampakkanlah diri-Mu yang maha suci kepadaku agar aku dapat'dengan potensi yang engkau anugerahkan padaku'melihat engkau. Dia, yakni Allah, berfirman, engkau, wahai nabi musa, sekali-kali tidak akan sanggup melihat-ku di dunia ini dengan mata telanjang. Kemudian Allah ingin nabi musa dapat menerima ketidaksanggupannya itu, dan berkata, namun lihatlah ke gunung itu yang lebih kokoh bila dibandingkan dengan kondisimu, jika saat kemunculan-ku ia tetap tegar di tempatnya sebagai sediakala ketika aku ber-tajalli, menampakkan apa yang hendak aku tampakkan, niscaya engkau dapat melihat-ku saat aku muncul di hadapanmu. Maka ketikatuhannya ber-tajalli, menampakkan keagungan-Nya atau apa yang hendak ditampakkan-Nya kepada gunung itu, dijadikannya gunung itu hancur luluh, hingga sama rata dengan tanah, dan nabi musa pun jatuh pingsan tak sadarkan diri menyaksikan peristiwa dahsyat itu. Setelah nabi musa sadar kembali, dan yakin bahwa dia tidak dapat melihat-Nya di dunia ini dengan cara apa pun, dia berkata, mahasuci engkau, lagi maha agung, aku bertobat kepada engkau karena telah lancang meminta sesuatu yang tak engkau izinkan, dan aku adalah orang yang pertama-tama beriman, yang percaya bahwa engkau tidak dapat dilihat seperti yang kumohonkan. Para mufasir ada yang berpendapat, pengertian tampak ialah kebesaran dan kekuasaan Allah, dan ada pula yang menafsirkan bahwa yang tampak itu adalah cahaya Allah. Bagaimana pun juga tampaknya Allah itu bukanlah seperti tampaknya makhluk, hanya tampak yang sesuai sifatsifat Allah yang tidak dapat diukur dengan ukuran manusia."
  }
]