[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika Musa telah tiba pada waktu yang telah di tentukan, yaitu tepat pada malam ke empat puluh, dan Tuhannya berbicara kepadanya dengan perkara-perkara yang dibicarakanNya kepada Musa , berupa wahyu, perintahNya dan laranganNya, dia amat antusias untuk melihat Allah. Maka dia meminta kepadaNya, untuk melihatNya. Maka Allah berfirman kepadanya, ”Engkau tidak akan bisa melihatku.” Maksudnya kamu tida akan mampu melihat Ku di dunia, tapi lihatlah kea rah gunung, maka jika gunung tersebut tetap pada tempatnya ketika Aku tampakan diriku kepadanya, maka kamu akan dapat melihatKu. Maka tatkala tuhannya menampakan diri kepada gunung tersebut, Dia menjadikannya hancur rata dengan permukaan tanah dan Musa langsung jatuh pingsan. Lalu tatkala Musa siuman dari pingsannya, dia berkata, ”maha suci engkau wahai tuhanku, dari segala yang tidak pantas dengan keagunganMu. Sesungguhnya aka bertaubat kepadaMu dari permintaanku kepadaMu untuk bisa melihatMu di kehidupan dunia ini. Dan aku adalah orang-orang yang pertama beriman kepadaMu dari kaumku. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "143. Dan tatkala Musa datang untuk bermunajat kepada Rabbnya pada waktu yang telah ditentukan, yaitu selama empat puluh hari penuh, dan Rabbnya telah berfirman kepadanya untuk memberikan perintah-perintah-Nya, larangan-larangan-Nya, dan lain-lain, tiba-tiba Musa ingin sekali melihat Rabbnya. Maka Musa memohon kepada-Nya agar diperkenankan melihat-Nya. Allah -Subḥānahu wa Ta'ālā- menjawab, “Kamu tidak akan bisa melihat-Ku selama hidup di dunia ini. Karena kamu tidak punya kemampuan untuk itu. Tetapi lihatlah ke arah gunung itu. Jika Aku menampakkan diri kemudian gunung itu tetap berada di tempatnya dan tidak terpengaruh sedikit pun, niscaya kamu akan bisa melihat-Ku. Namun jika gunung itu hancur dan rata dengan tanah, maka kamu tidak akan bisa melihat-Ku di dunia ini.” Kemudian tatkala Allah menampakkan diri-Nya di hadapan gunung itu tiba-tiba gunung itu hancur lebur dan rata dengan tanah. Sedangkan Musa jatuh tersungkur tak sadarkan diri. Setelah siuman Musa berkata, “Mahasuci Engkau -wahai Rabbku- dari segala sesuatu yang tidak layak bagi-Mu. Kini aku bertobat kepada-Mu dari permintaanku untuk melihat-Mu di dunia ini. Dan aku adalah orang mukmin pertama di antara kaumku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "143. Setelah Musa sampai pada waktu dan tempat yang telah ditetapkan Allah baginya, dan berbincang dengan Tuhannya; maka dia kemudian ingin melihat-Nya; dia berkata: “Ya Tuhanku, jadikanlah aku dapat melihat-Mu.” Maka Allah menjawab: “Kamu tidak akan dapat melihat-Ku; namun lihatlah gunung yang kokoh itu, jika gunung itu tetap pada tempatnya maka kamu akan melihat-Ku.” Dan ketika Allah menampakkan Diri-Nya pada gunung, gunung itu runtuh; sehingga Musa jatuh pingsan karena melihat kejadian yang mengerikan. Saat dia tersadar dari pingsannya, dia langsung mengagungkan dan menyucikan-Nya, serta bertaubat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "143. وَلَمَّا جَآءَ مُوسَىٰ لِمِيقٰتِنَا (Dan tatkala Musa datang untuk (munajat dengan Kami) pada waktu yang telah Kami tentukan) Yakni untuk berbicara dengan Allah pada waktu yang telah ditentukan. وَكَلَّمَهُۥ رَبُّهُۥ(dan Tuhan telah berfirman (langsung) kepadanya) Yakni Allah memperdengarkan suara-Nya tanpa perantara. قَالَ رَبِّ أَرِنِىٓ أَنظُرْ إِلَيْكَ ۚ (berkatalah Musa: “Ya Tuhanku, nampakkanlah (diri Engkau) kepadaku agar aku dapat melihat kepada Engkau”) Qatadah berkata: ketika Nabi Musa telah mendengar suara-Nya, lalu ia ingin melihat-Nya karena dorongan rasa rindu. قَالَ لَن تَرَىٰنِى (Tuhan berfirman: “Kamu sekali-kali tidak sanggup melihat-Ku) Hal ini menunjukkan bahwa Nabi Musa tidak dapat melihat-Nya saat ia meminta hal itu, adapun untuk dapat melihat-Nya di akhirat maka telah disebutkan dalam banyak hadist mutawatir yang jelas bagi orang yang mengetahui ilmu hadist. وَلٰكِنِ انظُرْ إِلَى الْجَبَلِ فَإِنِ اسْتَقَرَّ مَكَانَهُۥ فَسَوْفَ تَرَىٰنِى ۚ (tapi lihatlah ke bukit itu, maka jika ia tetap di tempatnya (sebagai sediakala) niscaya kamu dapat melihat-Ku”) Yakni kamu tidak akan mampu untuk melihat-Ku sebagaimana makhluk yang lebih besar dan kuat darimu seperti gunung tidak mampu untuk melihat-Ku. Dikatakan bahwa itu merupakan gunung Thur. فإن استقر (maka jika ia tetap di tempatnya) Yakni tetap teguh dan tidak berguncang ketika melihat-Ku. فسوف تراني (niscaya kamu dapat melihat-Ku) Dan jika gunung itu tidak mampu melakukan itu maka kamu pasti lebih lebah darinya. Kalimat ini merupakan perumpamaan yang diberikan kepada Nabi Musa dengan sebuah gunung. فَلَمَّا تَجَلَّىٰ رَبُّهُۥ لِلْجَبَلِ(Tatkala Tuhannya menampakkan diri kepada gunung itu) Menunjukkan diri-Nya kepada gunung. Makna (تجلى) yakni menyingkapkan diri. جَعَلَهُۥ دَكًّا(dijadikannya gunung itu hancur luluh) Yakni menjadikannya hancur lebur sehingga menjadi tanah. Dan disebutkan dalam hadist marfu’ dari Anas: gunung itu menjadi lenyap. وَخَرَّ مُوسَىٰ صَعِقًا ۚ( dan Musa pun jatuh pingsan) Yakni pingsan karena tertimpa petir. فَلَمَّآ أَفَاقَ(Maka setelah Musa sadar kembali) Dari pingsannya. قَالَ سُبْحٰنَكَ(dia berkata: “Maha Suci Engkau) Yakni aku mensucikan-Mu dengan sebenar-benarnya. تُبْتُ إِلَيْكَ(aku bertaubat kepada Engkau) Dari permintaan yang seperti ini lagi. وَأَنَا۠ أَوَّلُ الْمُؤْمِنِينَ (dan aku orang yang pertama-tama beriman”) Beriman kepada-Mu sebelum kaumku, dengan mengakui kebesaran dan keagungan-Mu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sesungguhnya Musa pernah meminta kepada tuhannya satu permintaan yang paling agung yaitu : { رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ } \"Ya Tuhanku, nampakkanlah (diri Engkau) kepadaku agar aku dapat melihat kepada Engkau\" , dan Musa juga meminta sesuatu yang paling kecil dari permintaannya dia mengatakan : { رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ } \"Ya Tuhanku sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku\" [ AL-Qhashas : 24 ]; maka kita juga sebagai hamba Allah memohon dan meminta sesuatu yang paling besar yaitu kebaikan-kebaikan di akhirat, dan sesuatu yang paling kecil adalah kebaikan-kebaikan di dunia : { رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ } \"Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat dan peliharalah kami dari siksa neraka\" [ Al-Baqarah : 201 ]. 2 ). { فَلَمَّا تَجَلَّىٰ رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا } \"Tatkala Tuhannya menampakkan diri kepada gunung itu, dijadikannya gunung itu hancur luluh\" , dalam hadits shahih Rasulullah bersabda : (( إِنَّ أَحَدَكُمْ إِذَا كَانَ فِي الصَّلَاةِ فَإِنَّ اللَّهَ قِبَلَ وَجْهِهِ )) \"Sesungguhnya seseorang dari kalian ketika berdiri shalat, dia sedang berhadapan dengan Allah\" [ Riwayat Bukhori ] Gunung yang hanya seketika dihadapkan kepadanya wajah Allah ia hancur berantakan, namun ada mata yang dihadapkan dengan ayat-ayat Allah namun ia tidak menangis! Sesungguhnya khusu'nya shalah seseorang sangat tergantung kepada perasaannya kepada makna bahwa Allah senantiasa mengawasinya diantara hatinya dan kiblatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "143. Dan ketika Musa sampai pada waktunya untuk berbicara kepada Allah, dia berbicara kepada Tuhannya secara langsung di belakang satir tanpa melalui perantara apapun. Musa berkata: “Wahai Tuhanku, tampakkanlah diriMu kepadaku agar aku bisa melihatMu karena rindu dan ingin menghormati.” Lalu Allah SWT menjawab: “Manusia tidak bisa melihatku di dunia, namun lihatlah gunung itu. Jika masih tetap kokoh maka kamu akan melihatKu, maknanya adalah tidak akan bisa melihatKu, sekalipun gunung itu lebih besar darimu dari segi kepadatan dan kekuatan, dia tidak akan kuasa ketika Tuhan bertajalli di atasnya”. Dan ketika datang nur Allah atas gunung, niscaya nur itu menjadikannya hancur berkeping-keping. Kemudian Musa jatuh pingsan. Tatkala dia sadar dari pingsannya, daia berkata: “Aku mensucikanmu wahai Tuhan. Aku bertaubat atas permintaanku yang ingin melihatMu dan aku adalah orang mukmin pertama dari kaumku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Musa datang untuk pada waktu yang telah Kami tentukan} pada waktu yang telah Kami tentukan untuknya, yaitu genap empat puluh malam {dan Tuhan telah berfirman kepadanya, Musa berkata,“Ya Tuhanku, tampakkanlah kepadaku agar aku dapat melihat Engkau” Dia berfirman,“Engkau tidak akan (sanggup) melihatKu, namun lihatlah ke gunung itu. Jika gunung itu tetap} tetap dan masih ada {di tempatnya, niscaya kamu dapat melihatKu.” Maka, ketika Tuhannya menampakkan} menampakkan dan menunjukkan {pada gunung itu. gunung itu hancur luluh} rata dengan tanah {dan Musa jatuh} jatuh {pingsan} hilang kesadaran {Setelah sadar, dia berkata,“Mahasuci Engkau. Aku bertaubat kepadaMu dan aku adalah orang yang pertama-tama beriman.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "143 “dan tatkala Musa datang untuk (munajat dengan kami) pada waktu yang telah kami tentukan” untuknya untuk menurunkan kitab, ”dan Rabbnya telah berfirman (langsung) kepadanya.” berfirman langsung dengan wahyuNya perintah dan laranganNya, Musa berkeinginan untuk melihat Allah, jiwanya mengharapkan itu karena kecintaannya kepada Rabbnya dan sangat ingin melihatNya. ”berkatalah Musa ‘ya Rabbku, nampakkanlah (diriMu) kepadaku agar aku dapat melihat kepadaMu” Allah menjawab “kamu sekali-kali tidak sanggup melihatMu” yakni sekarang kamu tidak akan mampu melihatku karena Allah menciptakan makhluk di dunia ini dalam kondisi dimana mereka tidak akan kuat dan tidak akan mampu melihat Allah. Ini tidak menunjukan bahwa mereka tidap dapat melihatNya di surge, karena dalil-dalil dari al-qur’an dan assunnah telah menunjukan bahwa penduduk surge akan melihat Rabb mereka dan menikmati melihat kepada wajahNya yang mulia. Dan bahwa Allah menghidupkan mereka secara sempurna yang dengannya mereka mampu melihat Allah oleh karena itu Allah mengaitkan kemungkinan melihat dengan ketetapan gunung. Allah berfirman untuk menenangkan Musa karena tidak bisa mengabulkan permintaannya. ”tapi lihatlah kebukit itu, maka jika ia tetap di tempatnya (sebagaimana sediakala)” jika Allah menampakkan diri kepadanya “niscaya kamu dapat melihatKu. Tatkala Rabbnya menampakkan diri kepada gunung itu.” yang bisu lagi keras. ”dijadikannya gunung itu hancur luluh” yakni hancur berkeping-keping ibarat kerikil, karena kegoncangannya dan tidak kuatnya ia melihat Allah “dan Musa pun jatuh pingsan” ketika melihat apa yang dilihat. Maka jelaslah bagi Musa pada saat itu bahwa jika gunung saja tidak kuat melihat Allah. maka musa lebih tidak kuat melihatNya. Musa memohon ampun kepada Allah karena telah meminta sesuatu yang tidak pada tempatnya. ”Musa berkata ’Maha suci Engkau’” yakni aku menyucikan dan mengagungkanMu dari apa yang tidak layak dengan kebesaranMu. ”aku bertaubat kepada Engkau” dari segala dosa dan kekurangajaran kepadaMu. ”dan aku orang yang pertama-tama beriman” yakni Musa menyempurnakan imanNYa dengan sesuatu yang tidak dia ketahui sebelumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 143: Karena Allah Subhaanahu wa Ta'aala menciptakan manusia di dunia ini dalam keadaan tidak memiliki kesanggupan untuk melihat-Nya. Jangankan manusia, gunung yang kuat saja tidak sangup. Namun dalam ayat ini tidaklah menunjukkan bahwa mereka sama sekali tidak akan melihat-Nya di surga, karena nash-nash Al Qur’an dan As Sunnah menunjukkan bahwa penghuni surga akan melihat Tuhan mereka dan merasa nikmat dengannya. Di surga, Allah menciptakan mereka dalam keadaan yang sempurna yang membuat mereka sanggup melihat Allah. Dari semua yang tidak layak dengan keagungan-Mu. Dari semua dosa dan kurang adab terhadap-Mu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 143",
    "description": "Dan ingatlah ketika musa datang untuk bermunajat pada waktu yang telah kami tentukan, yaitu empat puluh malam, dan tuhan telah berfirman langsung kepadanya, menyampaikan wahyu melalui suatu dialog yang tidak sama dengan pembicaraan yang dilakukan manusia, nabi musa ingin mendapat lebih dari itu dan berkata, tuhan pemeliharaku, tampakkanlah diri-Mu yang maha suci kepadaku agar aku dapat'dengan potensi yang engkau anugerahkan padaku'melihat engkau. Dia, yakni Allah, berfirman, engkau, wahai nabi musa, sekali-kali tidak akan sanggup melihat-ku di dunia ini dengan mata telanjang. Kemudian Allah ingin nabi musa dapat menerima ketidaksanggupannya itu, dan berkata, namun lihatlah ke gunung itu yang lebih kokoh bila dibandingkan dengan kondisimu, jika saat kemunculan-ku ia tetap tegar di tempatnya sebagai sediakala ketika aku ber-tajalli, menampakkan apa yang hendak aku tampakkan, niscaya engkau dapat melihat-ku saat aku muncul di hadapanmu. Maka ketikatuhannya ber-tajalli, menampakkan keagungan-Nya atau apa yang hendak ditampakkan-Nya kepada gunung itu, dijadikannya gunung itu hancur luluh, hingga sama rata dengan tanah, dan nabi musa pun jatuh pingsan tak sadarkan diri menyaksikan peristiwa dahsyat itu. Setelah nabi musa sadar kembali, dan yakin bahwa dia tidak dapat melihat-Nya di dunia ini dengan cara apa pun, dia berkata, mahasuci engkau, lagi maha agung, aku bertobat kepada engkau karena telah lancang meminta sesuatu yang tak engkau izinkan, dan aku adalah orang yang pertama-tama beriman, yang percaya bahwa engkau tidak dapat dilihat seperti yang kumohonkan. Para mufasir ada yang berpendapat, pengertian tampak ialah kebesaran dan kekuasaan Allah, dan ada pula yang menafsirkan bahwa yang tampak itu adalah cahaya Allah. Bagaimana pun juga tampaknya Allah itu bukanlah seperti tampaknya makhluk, hanya tampak yang sesuai sifatsifat Allah yang tidak dapat diukur dengan ukuran manusia. Tatkala Allah menolak permintaan nabi musa untuk melihatnya, dia telah menyiapkan untuknya nikmat-nikmat yang lain sebagai kompensasi penolakan itu. Dia, yakni Allah berfirman, wahai musa! sesungguhnya aku memilih dengan melebihkan dan mengutamakan engkau dari manusia yang lain pada masamu untuk membawa risalah-ku yaitu pesan-pesan kenabian dan firman-ku yang aku sampaikan langsung dengan bercakap-cakap kepadamu, tanpa perantara, sebab itu berpegang-teguhlah kepada apa yang aku berikan kepadamu berupa perintah dan larangan, dan hendaklah engkau termasuk orang-orang yang bersyukur atas nikmat kerasulan dan kekhususan tuhan berbicara langsung kepadamu."
  }
]