[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman, ”Wahai Musa, sesungguhnya aku telah memilihmu di atas sekalian manusia untuk (mengemban) risalah-risalahKu kepada semua makhlukKu yang aku mengutusmu kepada mereka, dan dengan firmanKu kepadamu tanpa ada perantara. Maka ambilah apa yang aku berikan kepadamu berupa perintah dan larangan, pegangilah ia dengan teguh dan amalkan, dan jadilah kamu termasuk orang-orang yang bersyukur kepada Allah atas apa yang diberikanNya kepadamu, berupa risalah dan melebihkanmu dengan berkomunikasi langsung denganNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "144. Allah berfirman kepada Musa, “Wahai Musa! Sesungguhnya Aku memilihmu dan lebih mengutamakanmu dari orang lain untuk menyampaikan risalah-Ku kepada mereka. Dan Aku pun memberimu kelebihan dengan berbicara langsung kepadamu tanpa perantara. Maka terimalah kemuliaan yang Aku berikan kepadamu ini. Dan jadilah kamu orang yang bersyukur kepada Allah atas karunia yang sangat besar ini.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "144. kemudian Allah menjelaskan kepada Musa tentang dirinya: “Aku telah memilihmu di antara manusia yang lain pada zamanmu dengan menjadikanmu sebagai Rasul dan berbicara kepadamu secara langsung tanpa perantara. Aku telah memberimu banyak kenikmatan besar, di antaranya adalah mewahyukan kepadamu Taurat. Maka terimalah kemuliaan sebagai pilihan, kerasulan, kenabian, dan kitab yang telah Aku berikan kepadamu. Dan jadilah termasuk orang-orang yang senantiasa bersyukur atas apa yang telah Aku berikan kepadamu, karena kamu adalah teladan bagi manusia pada zamanmu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "144. إِنِّى اصْطَفَيْتُكَ عَلَى النَّاسِ بِرِسٰلٰتِى وَبِكَلٰمِى (sesungguhnya Aku memilih (melebihkan) kamu dan manusia yang lain (di masamu) untuk membawa risalah-Ku dan untuk berbicara langsung dengan-Ku) Yakni Aku telah memilihmu diantara manusia dengan mengistimewakanmu dengan risalah dan berbicara denganmu tanpa perantara. فَخُذْ مَآ ءَاتَيْتُكَ(sebab itu berpegang teguhlah kepada apa yang Aku berikan kepadamu) Allah memerintahkannya untuk berpegang teguh pada apa yang Dia berikan berupa kemuliaan yang besar ini. وَكُن مِّنَ الشّٰكِرِينَ (dan hendaklah kamu termasuk orang-orang yang bersyukur) Atas pemberian yang besar dan pemuliaan yang agung ini"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "144. Allah berfirman: “Wahai Musa, sesungguhnya aku telah memilihmu di atas manusia yang hidup di jamanmu. Kami mengutamakan dan mengkhususkanmu dengan risalah, nubuwwah, penyampaian perintah-perintahKu dan berbicara kepadaKu tanpa melalui perantara. Maka ambillah keutamaan yang Aku berikan kepadamu dan jadilah orang yang bersyukur atas nikmat dan pemberianku yang luhur”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman,“Wahai Musa, sesungguhnya Aku memilihmu} memilih dan melebihkanmu {di atas manusia dengan membawa risalahKu dan berbicara denganKu} Aku berbicara denganmu. {Maka berpegang teguhlah pada apa yang Aku berikan kepadamu} apa yang AKu berikan kepadamu {dan jadilah kamu termasuk orang-orang yang bersyukur.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "144 Manakala Allah tidak memberikan kesempatan kepada Nabi Musa untuk melihatNya setelah sebelumnya dia sangat menginginkannya, maka Allah memberikan kepadanya kebaikan yang banyak. Allah berfirman ”hai Musa sesungguhnya aku memilih (melebihkan) kamu dari manusia yang lain (dimasamu).” Yakni aku memilihmu, mengangkatmu, melebihkanmu, dan mengkhususkanmu dengan keutamaan yang besar dan kemuliaan-kemulian yang agung. ”untuk membawa risalahKu” dimana Aku tidak mengkhususkan dan memberikannya kecuali kepada orang yang paling mulia, ”dan untuk berbicara denganKu” tanpa perantara. ini adalah keutamaan khusus Musa al-kalim (rasul Allah yang diajak berbicara langsung oleh Allah) dan dia dikenal di kalangan saudara-saudaranya para rasul yang lain dengan itu. ”sebab itu berpegang teguhlah kepada apa yang aku berikan kepadamu.” yakni dari nikmat-nikmat dan ambillah perintah dan larangan yang aku berikan kepadamu dengan lapang dada, terimalah ia dengan ketundukan, ”dan hendaklah kamu termasuk orang-orang yang bersyukur” kepada Allah atas apa yang Dia khususkan dan karuniakan kepadamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 144: Setelah Allah mencegah Musa dari melihat-Nya, sedangkan dirinya rindu kepada-Nya, maka Allah memberikan kepadanya kebaikan yang banyak, yaitu menjadikan orang pilihan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 144",
    "description": "Tatkala Allah menolak permintaan nabi musa untuk melihatnya, dia telah menyiapkan untuknya nikmat-nikmat yang lain sebagai kompensasi penolakan itu. Dia, yakni Allah berfirman, wahai musa! sesungguhnya aku memilih dengan melebihkan dan mengutamakan engkau dari manusia yang lain pada masamu untuk membawa risalah-ku yaitu pesan-pesan kenabian dan firman-ku yang aku sampaikan langsung dengan bercakap-cakap kepadamu, tanpa perantara, sebab itu berpegang-teguhlah kepada apa yang aku berikan kepadamu berupa perintah dan larangan, dan hendaklah engkau termasuk orang-orang yang bersyukur atas nikmat kerasulan dan kekhususan tuhan berbicara langsung kepadamu. Setelah menjelaskan adanya risalah Allah, dan adanya kalam Allah kepada nabi musa, maka ayat ini menjelaskan lebih lanjut tentang kedua hal tersebut, yakni dan telah kami tuliskan untuk musa pada lauh-lauh taurat, yang berupa kepingan dari batu atau kayu yang dahulu biasa digunakan untuk menulis, sebagaimana kertas pada dewasa ini, segala sesuatu sebagai pelajaran dan penjelasan untuk se-gala hal yang dibutuhkan oleh bani israil pada masa itu; maka kami berfirman kepada nabi musa, berpegang teguhlah kepadanya dan suruhlah kaummu berpegang kepadanya dengan melaksanakan kandungannya sebaik-baiknya, seperti mendahulukan sikap memaafkan ketimbang kisas, membebaskan utang ketimbang menangguhkannya, dan mengutamakan yang mudah dari yang sulit. Aku akan memperlihatkan kepadamu negeri orang-orang fasik, yang keluar dari ketaatan kepada Allah, dan kehancuran yang akan diderita, agar menjadi pelajaran bagi kamu. Maka janganlah kamu langgar aturan-aturan Allah, hingga kamu terhindar dari bencana yang menimpa mereka. Allah akan memperlihatkan negeri orang-orang fasik seperti fir'aun, 'ad, samud, dan sebagainya yang hancur bersama mereka akibat akhir kejahatan dan kefasikan mereka."
  }
]