[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah menuliskan bagi Musa di dalam kitab taurat semua yang dibutuhkannya dalam agamanya dari hokum-hukum, sebagai nasihat untuk di jadikan pengendali diri dan sumber pelajaran, dan sebagai penjelas hukum-hukum taklif halal, dan haram, perintah dan larangan, kisah-kisah, keyakinan-keyakinan, berita-berita dan perkara-perkara ghaib. Allah berfirman kepadanya, ”maka ambilah ia dengan kuat” artinya ambilah taurat dengan serius dan penuh kesungguhan.” dan perintahkan kaummu untuk mengamalkan kandungan ajaran yang Allah syariatkan di dalamnya. Barangsiapa berbuat syirik dari mereka dan orang lain, maka sesungguhnya Aku akan perlihatkan kepadanya negeri orang-orang fasik di akhirat.” yaitu neraka Allah yang Dia sediakan bagi musuh-musuhNya yang keluar dari ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "145. Dan Kami telah menuliskan untuk Musa di dalam lembaran terbuat dari kayu dan materi lainnya segala sesuatu yang dibutuhkan oleh Bani Israil dalam urusan agama dan dunia mereka, agar menjadi pelajaran bagi mereka yang mau menjadikannya sebagai pelajaran, dan menjadi penjelasan yang rinci bagi ketentuan-ketentuan hukum yang memerlukan penjelasan secara rinci. Maka ambillah kitab suci Taurat itu -wahai Musa- dengan penuh kesungguhan dan keseriusan. Dan perintahkanlah kepada kaummu, Bani Israil agar mengambil ketentuan-ketentuan terbaik yang ada di dalamnya yang menjanjikan pahala yang lebih besar, seperti melaksanakan perintah dengan sebaik-baiknya, bersabar dan memaafkan. Aku akan menunjukkan kepadamu akibat yang diterima oleh orang yang melanggar perintah-Ku dan tidak taat kepada-Ku. Nasibnya akan berakhir dengan kebinasaan dan kehancuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "145. Allah menjelaskan bahwa Dia telah menuliskan pada lauh-lauh Taurat bagi Musa segala yang dia butuhkan, yaitu penjelasan tentang halal dan haram, dan kebaikan dan keburukan, agar menjadi pelajaran bagi manusia kerena ancaman dan dorongan akan mempengaruhi hati mereka. Dan Allah memerintahkannya agar menerimanya dengan penuh kesungguhan dan kesabaran. Dia juga memerintahkan nabi-Nya untuk menyuruh kaumnya melakukan amalan yang terbaik, yaitu dengan menjalankan perintah-perintah yang wajib dan sunnah. Dan Allah mengancam siapa yang menyelisihi perintah-Nya setelah mendapat penjelasan yang sangat jelas dan gamblang ini, bahwa Dia akan menunjukkan kepada mereka akibat bagi orang yang menyelisihi perintah-Nya dan enggan mentaati-Nya, dan bagaimana dia dibinasakan dan dihancurkan; demikianlah sunnatullah yang tidak akan berubah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "145. وَكَتَبْنَا لَهُۥ فِى الْأَلْوَاحِ مِن كُلِّ شَىْءٍ (Dan telah Kami tuliskan untuk Musa pada luh-luh (Taurat) segala sesuatu) Yakni segala apa yang dibutuhkan oleh Bani Israil dalam urusan agama dan dunia mereka. Lauh-lauh ini adalah kitab Taurat. مَّوْعِظَةً(sebagai pelajaran) Bagi orang dari Bani Israil yang menjadikannya pelajaran. وَتَفْصِيلًا(dan penjelasan) Bagi hukum-hukum yang memerlukan penjelasan. فَخُذْهَا بِقُوَّةٍ (maka Berpeganglah kepadanya dengan teguh) Yakni berpeganglah pada lauh-lauh ini. Atau berpeganglah pada pelajaran dan penjelasan ini dengan sungguh-sungguh serta amalkanlah isi kandungannya. وَأْمُرْ قَوْمَكَ يَأْخُذُوا۟ بِأَحْسَنِهَا ۚ (dan suruhlah kaummu berpegang kepada (perintah-perintahnya) dengan sebaik-baiknya) Yakni dengan sesuatu yang terbaik yang dikandungnya, yang memiliki pahala yang paling besar dari yang lain. Dan yang termasuk paling baik adalah bersabar dalam bermuamalat dengan orang lain, memberi maaf, menjalankan perintah yang ada dengan sebaik-baiknya, dan meninggalkan larangan dan tidak mendekatinya. سَأُو۟رِيكُمْ دَارَ الْفٰسِقِينَ (nanti Aku akan memperlihatkan kepadamu negeri orang-orang yang fasik) Dikatakan: itu merupakan tempat tinggal orang-orang kafir yang kejam dan semena-mena, agar mereka mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "145. Dan telah Kami tuliskan untuk Musa dalam kitab Taurat (yaitu sesuatu yang ditulis) setiap sesuatu yang dibutuhkan Bani Israil berupa perkara agama dan dunia bagi orang yang mau mengambil perlajaran dan sebagai penjelas bagi setiap perkara hukum. Maka peganglah kitab itu dengan sungguh-sungguh dan penuh keteguhan, beramallah sesuai kitab itu, dan mintalah kaummu untuk mengambil kebaikan, dan keutamaan yang terkandung di dalamnya, dan kebanyakan kandungannya adalah pahala seperti ampunan sebagai ganti hukum qishash, sabar atas aturan, melepas kemiskinan, mengerjakan perintah, dan meninggalkan larangan, maka Aku akan memperlihatkanmu rumah orang-orang fasik, yaitu Fir’aun dan pengikutnya, yaitu Mesir, supaya kalian bisa mengambil pelajaran darinya. Dan dikatakan bahwa itu adalah tempatnya orang-orang kafir dari golongan orang-orang yang bertubuh besar, kaum Tsamud dan penduduk Aikah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menuliskan untuk Musa pada lembaran-lembaran} lembaran-lembaran Taurat {segala sesuatu sebagai pelajaran} pelajaran {dan rincian} penjelasan {untuk segala hal. Lalu berpeganglah padanya dengan kuat} dengan sungguh-sungguh dan usaha yang keras {dan suruhlah kaummu untuk berpegang padanya dengan sebaik-baiknya} dengan sebaik-baik sesuatu yang ada di sana berupa pahala yang besar {Aku akan memperlihatkan kepada kalian negeri} akibat {orang-orang fasik.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145 “dan telah kami tuliskan untuk Musa pada lauh-lauh (taurat) segala sesuatu” yang dibutuhkan oleh para hamba “sebagai pelajaran” yang mendorong jiwa untuk berbuat kebaikan dan menakutinya untuk berbuat keburukan. ”dan penjelasan bagi segala sesuatu” dari hukum-hukum syar’i, akidah, akhlak dan adab. ”maka (kami berfirman) ‘berpeganglah kepadanya dengan teguh” yakni dengan sungguh-sunggguh dan serius dalam menegakkannya. ”dan suruhlah kaummu berpegang kepada perintah perintahnya dengan sebaik-baiknya.” yaitu perintah-perintah yang bersifat wajib dan dianjurkan, karena ia adalah yang terbaik. Di dalam penjelasan ini terdapat dalil bahwa perintah Allah dalam setiap syari’at adalah sempurna, adil, dan baik. ”nanti aku akan memperlihatkan kepadamu negeri orang-orang yang fasik” Setelah Allah membinasakan mereka dan menyisakan negeri-negeri mereka sebagai pelajaran sesudah mereka bagi orang-orang Mukmin yang diberi taufik lagi rendah diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 145: Lauh adalah kepingan dari batu atau kayu yang tertulis di sana isi Taurat yang diterima Nabi Musa ‘alaihis salam. setelah bermunajat di gunung Thursina. Yang dibutuhkan dalam agama. Yang mendorong mereka mengerjakan kebaikan dan menakutkan mereka dari mengerjakan keburukan. Seperti hukum-hukum syar’i, ‘aqidah, akhlak dan adab. Dengan melaksanakannya. Maksudnya utamakanlah yang wajib-wajib dahulu dari yang sunat dan yang mubah. Maksudnya negeri Mesir bekas peninggalan Fir’aun dan para pengikutnya agar mereka mengambil pelajaran daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 145",
    "description": "Setelah menjelaskan adanya risalah Allah, dan adanya kalam Allah kepada nabi musa, maka ayat ini menjelaskan lebih lanjut tentang kedua hal tersebut, yakni dan telah kami tuliskan untuk musa pada lauh-lauh taurat, yang berupa kepingan dari batu atau kayu yang dahulu biasa digunakan untuk menulis, sebagaimana kertas pada dewasa ini, segala sesuatu sebagai pelajaran dan penjelasan untuk se-gala hal yang dibutuhkan oleh bani israil pada masa itu; maka kami berfirman kepada nabi musa, berpegang teguhlah kepadanya dan suruhlah kaummu berpegang kepadanya dengan melaksanakan kandungannya sebaik-baiknya, seperti mendahulukan sikap memaafkan ketimbang kisas, membebaskan utang ketimbang menangguhkannya, dan mengutamakan yang mudah dari yang sulit. Aku akan memperlihatkan kepadamu negeri orang-orang fasik, yang keluar dari ketaatan kepada Allah, dan kehancuran yang akan diderita, agar menjadi pelajaran bagi kamu. Maka janganlah kamu langgar aturan-aturan Allah, hingga kamu terhindar dari bencana yang menimpa mereka. Allah akan memperlihatkan negeri orang-orang fasik seperti fir'aun, 'ad, samud, dan sebagainya yang hancur bersama mereka akibat akhir kejahatan dan kefasikan mereka. Janji-janji Allah yang disebut pada ayat-ayat yang lalu akan diperoleh oleh mereka yang melaksanakan tuntunan kitab suci. Yang membangkang (orang-orang fasik) tidak akan meraihnya, karena akan aku palingkan dari tanda-tanda kekuasaan, kebesaran dan keagungan-ku orang-orang yang terus menerus menyombongkan diri di bumi dan enggan menerima kebenaran tanpa alasan yang benar. Mereka tak akan dapat mencermati bukti-bukti kekuasaan-ku yang terdapat dalam diri manusia maupun di alam raya. Kalaupun mereka melihat setiap tanda kekuasaan-ku, mereka tetap tidak akan beriman kepadanya karena keangkuhan mereka. Dan jika mereka melihat jalan yang membawa kepada petunjuk menuju kebenaran dan kebajikan, mereka tidak menjadikannya jalan yang seharusnya mereka tempuh, tetapi jika mereka melihat jalan kesesatan, mereka menempuhnya. Yang demikian, yakni perlakuan kami memalingkan mereka itu, adalah karena mereka mendustakan ayat-ayat kami sehingga tidak ada gunanya kami mendekatkannya kepada mereka, dan juga karena mereka selalu lengah terhadapnya, tidak memperhatikan, bahkan mengabaikannya."
  }
]