[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku akan memalingkan dari pemahaman terhadap hujjah-hujjah dan dalil-dalil yang menunjukan keagaunganKu dan syariatKu serta hukum-hukumKu, hati orang-orang yang angkuh dari ketaatan kepadaku dan sombong di hadapan manusia tanpa alasan yang benar. Mereka tidak mau mengikuti seorang nabi dan tidak mau mendengarkan dengan baik kepadanya karena kesombombonagn mereka. Dan apabila orang-orang yang menyombongan diri dari iman itu menyaksiakan tiap-tiap ayat, mereka tidak beriman kepadanya, karena penolakan dan penentangan mereka kepada Allah. Dan apabila mereka melihat jalan kebaikan, mereka tidak mau mengikuti jalan itu. Dan apabila mereka melihat jalan kesesatan, maksudnya kekafiran, mereka menjadikannya sebagai jalan hidup dan agama. Yang demikian itu disebabkan pendustaan mereka terhadap ayat-ayat Allah dan kelalaian mereka untuk melihatnya dan memikirkan kandungan petunjuk-peunjuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "146. Aku akan memalingkan orang-orang yang sombong kepada hamba-hamba Allah dan enggan menerima kebenaran tanpa alasan yang jelas dari kemauan untuk mengambil pelajaran pada tanda-tanda kekuasaan-Ku yang ada di jagad raya dan di dalam diri manusia, dan dari kemauan untuk memahami ayat-ayat yang ada di dalam Kitab Suci-Ku. Jika mereka melihat setiap ayat mereka tidak percaya kepadanya. Karena mereka menentangnya dan berpaling darinya. Dan juga karena mereka sengaja melawan Allah dan rasul-Nya. Jika mereka melihat jalan yang benar dan mengantarkan kepada rida Allah mereka tidak mau mengikutinya. Dan jika mereka melihat jalan menyimpang dan sesat yang mengantarkan kepada murka Allah mereka selalu mengikutinya. Apa yang menimpa mereka itu semata-mata akibat dari sikap mereka yang mendustakan tanda-tanda kekuasaan Allah yang sangat agung yang menjadi bukti kebenaran ajaran yang dibawa oleh para rasul, dan juga akibat dari kelalaian mereka dalam mempelajarinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "146. Demikianlah Allah mengancam musuh-musuh kebenaran, bahwa Dia akan memalingkan mereka dari mendapat manfaat ayat-ayat dan hujjah-hujjah-Nya, dengan mengunci hati mereka akibat perbuatan mereka, sehingga mereka tidak berfikir, menghayati, dan mendapat pelajaran. Jika mereka melihat suatu mukjizat yang memberi petunjuk kepada kebenaran, mereka tidak beriman akibat hati mereka telah rusak, dan kedengkian mereka terhadap orang lain atas karunia yang telah Allah berikan kepadanya, serta jika mereka mengetahui jalan kebaikan dan kebenaran, mereka enggan menempuhnya karena menuruti hawa nafsu dan syahwat mereka, dan jika mereka melihat jalan kesesatan, mereka langsung memilihnya tanpa berfikir dan menghayati. Dan yang menyebabkan mereka terjerumus ke dalam kesesatan yang luar biasa adalah karena mereka mendustakan ayat-ayat Allah yang menunjukkan kesesatan mereka, dan mereka lalai dari ayat-ayat itu tanpa memikirkan dan mencari pelajaran dan ibrah yang dikandungnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "146. سَأَصْرِفُ عَنْ ءَايٰتِىَ الَّذِينَ يَتَكَبَّرُونَ (Aku akan memalingkan orang-orang yang menyombongkan dirinya dari ayat-ayat-Ku) Yakni Aku akan menghalangi mereka dari memahami kitab-Ku. Pendapat lain mengatakan yakni Aku akan memalingkan mereka dari keimanan kepada ayat-ayat-Ku وَإِن يَرَوْا۟ كُلَّ ءَايَةٍ لَّا يُؤْمِنُوا۟ بِهَا (Mereka jika melihat tiap-tiap ayat(Ku), mereka tidak beriman kepadanya) Meksipun ayat-ayat itu begitu banyak dan jelas. ذٰلِكَ (Yang demikian itu) Yakni keberpalingan mereka itu. بِأَنَّهُمْ كَذَّبُوا۟ بِـَٔايٰتِنَا وَكَانُوا۟ عَنْهَا غٰفِلِينَ(karena mereka mendustakan ayat-ayat Kami dan mereka selalu lalai dari padanya) Disebabkan pendustaan mereka kepada ayat-ayat Allah dan kelalaian mereka terhadapnya. Yakni Allah memalingkan hati mereka dari keimanan kepada risalah karena mereka tetap bersikeras dalam pendustaan dan keberpalingan mereka disebabkan keangkuhan dan kesombongan mereka setelah mereka begitu banyak melihat berbagai mukjizat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Jika seorang hamba menyombongkan diri daripada kebenaran niscaya Allah akan memalingkan hatinya, dan jika Allah memalingkan hatinya maka siapa yang akan peduli kepadanya ? { سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ } \"Aku akan memalingkan orang-orang yang menyombongkan dirinya di muka bumi tanpa alasan yang benar dari tanda-tanda kekuasaan-Ku\". 2 ). Tidaklah orang yang sombong itu lebih bodoh dari selainnya. Ketika ia melihat jalan yang lurus ia berpaling dan pergi meninggalkannya, namu jika ia menyaksikan jalan yang berliku dan curam ia rela melewatinya, sungguh orang yang berkelakuan seperti ini adalah orang orang paling bodoh, Allah berfirman : { وَإِنْ يَرَوْا سَبِيلَ الرُّشْدِ لَا يَتَّخِذُوهُ سَبِيلًا وَإِنْ يَرَوْا سَبِيلَ الْغَيِّ يَتَّخِذُوهُ سَبِيلًا } \"Dan jika mereka melihat jalan yang membawa kepada petunjuk, mereka tidak mau menempuhnya, tetapi jika mereka melihat jalan kesesatan, mereka terus memenempuhnya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "146. Aku akan menghalangi orang-orang yang sombong atas manusia tanpa dibenarkan seperti Fir’aun dan kaumnya itu untuk memahami ayat-ayatKu (dalil-dalil yang menunjukkan kepada keimanan), kitabKu dan syariatKu. Dan jika mereka melihat setiap ayat yang menunjukkan kepada kuasa dan keagungan Allah, mereka tidak akan mempercayainya. Dan jika mereka melihat jalan petunjuk yang datang dari Allah, kebaikan dan keistiqamahan, niscaya mereka tidak akan mengambilnya sebagai cara atau jalan hidup. Namun jika mereka melihat jalan kezaliman dan kesesatan, niscaya mereka akan mengambilnya sabagai cara dan jalan hidup. Penyimpangan itu karena mendustakan ayat-ayat yang turun dari sisi Kami yang mengandung petunjuk dan penyucian jiwa, dan karena kelupaan dan pembangkangan mereka, tanpa merasa keliru."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku akan memalingkan} menghalangi {orang-orang yang menyombongkan diri di bumi tanpa alasan yang benar dari ayat-ayatKu. Jika mereka melihat setiap tanda-tanda itu, mereka tidak beriman padanya. Jika mereka melihat jalan kebenaran} jalan kebenaran dan jalan petunjuk {mereka tidak mau mengambilnya} tidak mau menempuhnya {sebagai jalan. Dan jika mereka melihat jalan kesesatan} jalan kesesatan {mereka mengambilnya sebagai jalan. Demikian itu karena mereka mendustakan ayat-ayat Kami dan mereka lengah terhadapnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "146 Adapun selain meereka, maka Allah berfirman tentang mereka, ”aku akan memalingkan dari tanda-tanda kekuasaanKu” yakni dari mengambil pelajaran dari ayat-ayat yang ada dilangit dan apa yang ada pada diri manusia dan pemahaman terhadap ayat-ayat kitab ”orang-orang yang menyombongkan dirinya dimuka bumi tanpa alasan yang benar.” Yakni mereka menyombongkan diri kepada hamba-hamba Allah dan kepada kebenaran serta kepada pembawanya. Siapa saja yang memiliki kriteria ini, maka Allah tidak akan memberikan kebaikan kepadanya, Allah akan menelantarkannya dan dia tidak dapat memahami ayat-ayat Allah yang bermanfaat bagi diri bahkan bisa jadi hakikat-hakikat perkara menjadi jungkir balik baginya yang selanjutnya dia menganggap yang buruk sebagai sesuatu yang baik. ”jika mereka melihat diantara (ayat-ayatKu) mereka tidak beriman kepadanya.” karena mereka berpaling menyangkal dan menentang Allah dan RasulNya. Dan jika mereka melihat jalan yang membawa kepada petunjuk” yang lurus dan benar yaitu jalan yang mengantarkan kepaada Allah dan kepada rumah kemuliaan Nya (surga) “mereka tidak mau menempuhnya” yakni mereka tidak mau menitinya dan tidak menyukainya. ”tetapi jika mereka melihat jalan kesesatan” yakni kesesatan yang mengantarkan pelakunya kepada rumah kesengsaraan (mereka) “mereka terus menempuhnya” penyebab penyimpangan mereka seperti itu karena “yang demikian itu adalah karena mereka mendustakan ayat-ayat Kami dan mereka selalu lalai dari padanya. ”penolakan mereka terhadap ayat-ayat Allah kelalainya terhadap maksudnya dan pelecehan terhadapnya adalah penyebab mereka menempuh jalan kesesatan dan meninggalkan jalan lurus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 146: Yakni dari mengambil ibrah (pelajaran) pada ayat-ayat yang ada di ufuq dan pada diri mereka sendiri serta dari memahami ayat-ayat Al Qur’an. Dengan merendahkan hamba-hamba Allah dan menolak kebenaran. Orang yang seperti ini sifatnya, Allah akan menghalanginya dari kebaikan yang banyak, ia tidak dapat memahami ayat-ayat Allah yang memberinya manfaat, bahkan terkadang hakikat yang sebenarnya menjadi berubah dan keburukan disangkanya baik, wal ‘iyadz billah. Yaitu jalan yang menghubungkan kepada Allah dan kepada surga-Nya. Yang mengarah kepada kesengsaraan dan kepada neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 146",
    "description": "Janji-janji Allah yang disebut pada ayat-ayat yang lalu akan diperoleh oleh mereka yang melaksanakan tuntunan kitab suci. Yang membangkang (orang-orang fasik) tidak akan meraihnya, karena akan aku palingkan dari tanda-tanda kekuasaan, kebesaran dan keagungan-ku orang-orang yang terus menerus menyombongkan diri di bumi dan enggan menerima kebenaran tanpa alasan yang benar. Mereka tak akan dapat mencermati bukti-bukti kekuasaan-ku yang terdapat dalam diri manusia maupun di alam raya. Kalaupun mereka melihat setiap tanda kekuasaan-ku, mereka tetap tidak akan beriman kepadanya karena keangkuhan mereka. Dan jika mereka melihat jalan yang membawa kepada petunjuk menuju kebenaran dan kebajikan, mereka tidak menjadikannya jalan yang seharusnya mereka tempuh, tetapi jika mereka melihat jalan kesesatan, mereka menempuhnya. Yang demikian, yakni perlakuan kami memalingkan mereka itu, adalah karena mereka mendustakan ayat-ayat kami sehingga tidak ada gunanya kami mendekatkannya kepada mereka, dan juga karena mereka selalu lengah terhadapnya, tidak memperhatikan, bahkan mengabaikannya. Demikian keadaan dan balasan yang diterima oleh mereka yang angkuh dan durhaka terhadap ayat-ayat Allah, dan orang-orang yang mendustakan tanda-tanda kekuasaan kami dan adanya pertemuan yang dijanjikan Allah di akhirat, sia-sialah amal mereka sebab telah kehilangan syarat diterimanya sebuah amal, yaitu iman kepada Allah dan hari akhir. Apakah mereka tidak diberi balasan melainkan dengan balasan yang setimpal dan sesuai dengan apa yang telah mereka kerjakan. Jika niat dan amal mereka baik maka kami akan membalasnya dengan kebaikan, sebaliknya jika buruk maka keburuk-anlah balasannya."
  }
]