[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendustakan ayat-ayat Allah dan hujjah-hujjahNya dan mendustakan perjumpaan dengan Allah di akhirat kelak, maka terhapuslah amal perbuatan mereka, disebabkan kehilangan syaratnya, yaitu beriman kepada Allah dan mengimani balasanNya. Mereka tidak memperoleh balasan di akhirat kelak kecuali balasan yang sesuai apa yang mereka perbuat di dunia berupa kekafiran dan maksiat-maksiat, yaitu abadi di dalam neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "147. Orang-orang yang mendustakan tanda-tanda kekuasaan Kami yang menjadi bukti kebenaran rasul-rasul Kami dan mendustakan perjumpaan dengan Allah di hari Kiamat pasti amal perbuatan mereka berupa ketaatan akan hangus. Mereka tidak akan mendapatkan ganjaran atas amal ibadah mereka karena tidak memenuhi salah satu syaratnya, yaitu iman. Kelak pada hari Kiamat mereka tidak akan mendapatkan balasan apa pun kecuali untuk kekafiran mereka kepada Allah dan perbuatan syirik mereka. Dan balasan untuk hal itu ialah kekal di dalam Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "147. Allah mengancam orang-orang yang mendustakan ayat-ayat-Nya, dan mengingkari hari akhir dan yang ada di dalamnya berupa pahala dan siksaan, bahwa amal kebaikan mereka akan dihapus sehingga menjadi hangus tak bermanfaat. Pada hari kiamat mereka tidak dibalas melainkan sesuai apa yang mereka kerjakan di dunia. Dan Allah tidak akan menzalimi seorangpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "147. وَلِقَآءِ الْاٰخِرَةِ (dan mendustakan akan menemui akhirat) Yakni sampainya mereka pada apa yang dijanjikan kepada mereka. حَبِطَتْ أَعْمٰلُهُمْ ۚ (sia-sialah perbuatan mereka) Yakni amal perbuatan mereka yang secara kasat mata adalah amal ketaatan seperti sedekah dan silaturrahim menjadi sirna, namun karena mereka berada dalam kekafiran maka amalan-amalan itu tidak menjadi sebuah amal ketaatan, padahal mereka telah berharap untuk mendapatkan manfaat dari amalannya. هَلْ يُجْزَوْنَ إِلَّا مَا كَانُوا۟ يَعْمَلُونَ(Mereka tidak diberi balasan selain dari apa yang telah mereka kerjakan) Allah tidak menzalimi mereka sedikitpun, dan tidak menambah siksaan mereka dari yang seharusnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "147. Dan orang-orang yang mendustakan ayat-ayat Kami yang dibawa para rasul Kami, hari kebangkitan, dan hari penghisaban. Amal kebaikan mereka yang dikerjakan di dunia seperti silaturahmi dan sedekah menjadi sia-sia, sehingga tidak ada pahala bagi amal tersebut di akhirat karena tiadanya keimanan (dalam mereka). Mereka tidak dibalas kecuali balasan atas pendustaan dan kemaksiatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mendustakan ayat-ayat Kami dan pertemuan akhirat, sia-sialah} sia-sialah {amal mereka. Bukankah mereka akan dibalas, kecuali apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "147 ”dan orang-orang yang mendustakan ayat-ayat Kami” yang agung, yang menunjukan kebenaran rasul-rasul yang telah kami utus, ”dan mendustakan akan menemui akhirat, maka sia-sialah perbuatan mereka” karena perbuatan tersebut tidak dilakukan di atas fondasi syariat dan telah hilang darinya syarat diterimanya, yaitu beriman kepada ayat-ayatNya dan membenarkan balasanNya. ”mereka tidak diberi balasan” tentang amal perbuatan mereka yang sia sia dan terjadinya apa yang mereka tidak harapkan “selain dari apa yang telah mereka kerjakan” sesungguhnya amal perbuatan orang yang tidak beriman kepada hari akhir tidak ada pahala yang diharapkan padanya dan tidak memiliki tujuan yang dicapai. oleh karena itu ia batl dan sia-sia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": ""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 147: Seperti silaturrahim, sedekah dan amal saleh lainnya. Hal itu, karena orang yang tidak beriman kepada hari akhir tidak mengharap pahala terhadap amal salehnya, dan ia pun tidak memiliki tujuan sehingga menjadi sia-sia. Dengan sia-sianya amal dan tidak memperoleh apa yang diinginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 147",
    "description": "Demikian keadaan dan balasan yang diterima oleh mereka yang angkuh dan durhaka terhadap ayat-ayat Allah, dan orang-orang yang mendustakan tanda-tanda kekuasaan kami dan adanya pertemuan yang dijanjikan Allah di akhirat, sia-sialah amal mereka sebab telah kehilangan syarat diterimanya sebuah amal, yaitu iman kepada Allah dan hari akhir. Apakah mereka tidak diberi balasan melainkan dengan balasan yang setimpal dan sesuai dengan apa yang telah mereka kerjakan. Jika niat dan amal mereka baik maka kami akan membalasnya dengan kebaikan, sebaliknya jika buruk maka keburuk-anlah balasannya. Dan kaum nabi musa, setelah kepergian beliau ke gunung sinai untuk bermunajat kepada Allah, mereka membuat patung anak sapi yang bertubuh dan dapat melenguh atau bersuara dari perhiasan emas. Mereka membuat patung anak sapi dari emas untuk disembah. Patung itu tetaplah patung tidak bernyawa. Suara yang seperti sapi itu hanyalah disebabkan oleh angin yang masuk ke dalam rongga patung itu dengan teknik yang dikenal oleh samiri waktu itu. Apakah mereka tidak mengetahui bahwa patung anak sapi itu tidak dapat berbicara dengan mereka sedikit pun, dengan pembicaraan apa pun, apalagi serupa dengan anugerah Allah kepada nabi musa, dan tidak dapat pula menunjukkan jalan apa pun kepada mereka, apalagi jalan keselamatan seperti dari gangguan dan siksaan fir'aun' mereka menjadikannya sebagai sembahan. Mereka, sejak dahulu hingga kini, adalah orang-orang yang zalim, yang telah merasuk kezalimannya dalam diri mereka."
  }
]