[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kaum musa mengadakan sesembahan setelah kepergiannya meninggalkan mereka untuk bermunajat kepada tuhannya, dari perhiasan emas mereka berupa patung anak sapi bertubuh nyata yang tidak mempunyai ruh dan bersuara. Tidakkah mereka menyadari bahwa sesungguhnya patung anak sapi itu tidak dapat berkomunikasi dengan mereka dan tidak dapat menunjukan mereka kepada kebaikan? Mereka maju melakukan apa yang telah mereka perbuat dari tindakan parah ini. Dan mereka itu telah berbuat zhalim kepada diri mereka, meletakan sesuatu tidak pada tempatnya yang tepat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "148. Setelah Musa pergi untuk bermunajat terhadap Rabbnya, kaumnya membuat sebuah patung anak sapi dari perhiasan mereka. Patung itu tidak bernyawa tetapi bisa bersuara. Tidakkah mereka tahu bahwa patung anak sapi itu tidak bisa berbicara kepada mereka, tidak bisa membimbing mereka ke jalan kebaikan baik yang lahir maupun yang batin, dan tidak bisa mendatangkan manfaat apa pun bagi mereka atau menghilangkan kesulitan dari mereka? Mereka menjadikan patung anak sapi itu sebagai sembahan. Mereka benar-benar menganiaya diri mereka sendiri dengan tindakan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "148. Ketika Musa datang untuk bertemu Tuhannya dengan menjadikan Harun sebagai penggantinya, Bani Israil merendahkannya karena dia adalah orang yang lemah lembut. Mereka membuat patung anak sapi yang dapat mengeluarkan suara dari perhiasan yang mereka punya, agar mereka jadikan sebagai sesembahan. Akan tetapi mereka tidak memahami -karena hati mereka telah buta- bahwa patung anak sapi itu bahkan tidak dapat berbuat sesuatu yang dapat dilakukan manusia, seperti berbicara dan memberi petunjuk ke jalan yang benar. Dan tidak diragukan lagi mereka telah menzalimi diri mereka sendiri karena telah menyembah selain Allah dan menetapkan sesuatu bukan pada tempatnya. Hal ini menunjukkan bahwa kezaliman sudah menjadi tabiat dan kebiasaan mereka sebelum mereka membuat patung itu, dan apa yang mereka lakukan ini bukan sesuatu yang aneh dari mereka, karena hanya dengan melihat kaum yang mengelilingi berhala, membuat mereka meminta Musa untuk membuatkan mereka berhala juga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "148. وَاتَّخَذَ قَوْمُ مُوسَىٰ مِنۢ بَعْدِهِۦ (Dan kaum Musa, setelahnya membuat) Yakni setelah kepergiannya menuju bukit Thur. مِنْ حُلِيِّهِمْ(dari perhiasan-perhiasan (emas) mereka) Dari perhiasan emas mereka. عِجْلًا(anak lembu) Yakni mereka membuat dari perhiasan tersebut patung dalam bentuk anak sapi. جَسَدًا(yang bertubuh) Yang mempunyai tubuh sapi namun tak bernyawa. Dan penyembahan kepada sapi dan pembuatan patung-patung merupakan bagian dari adat kaum Fir’aun. لَّهُۥ خُوَارٌ ۚ(dan bersuara) Makna (الخوار) yakni suara sapi jantan. Diriwayatkan bahwa ketika Nabi Musa menjanjikan kepada kaumnya pergi selama 30 malam, namun ia terlambat kembali karena 10 malam tambahan, maka Samiri berkata kepada bani Israil –dan ia termasuk orang yang ditaati— : “sesungguhnya kalian memiliki perhiasan dari perhiasan kaum Fir’aun yang diserahkan kepada kalian agar kalian pakai di hari raya, kemudian kalian sekarang terbebas dari mereka dengan membawa perhiasan tersebut, sedangkan pemiliknya telah ditenggelamkan Allah; maka berikanlah ia kepadaku”. Maka mereka memberikannya kepada Samiri, lalu ia menjadikannya sebagai patung anak sapi tersebut. أَلَمْ يَرَوْا۟ أَنَّهُۥ لَا يُكَلِّمُهُمْ(Apakah mereka tidak mengetahui bahwa anak lembu itu tidak dapat berbicara dengan mereka) Apalagi mampu memberi mereka manfaat atau menolak mudharat dari mereka. وَلَا يَهْدِيهِمْ سَبِيلًا ۘ (dan tidak dapat (pula) menunjukkan jalan kepada mereka?) Tidak dapat memberi mereka petunjuk ke jalan yang benar, baik itu secara harfiah maupun maknawiah. اتَّخَذُوهُ (Mereka menjadikannya ) sebagai sembahan وَكَانُوا۟ ظٰلِمِينَ (dan mereka adalah orang-orang yang zalim) Terhadap diri mereka sendiri dengan membuat patung tersebut, dan perbuatan lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "148. Setelah kepergian Musa ke gunung Thur untuk bermunajat, kaum Musa mengumpulkan harta mereka berupa perhiasan suku Qubthy yang mereka pinjam untuk pesta dan masih mereka simpan, dan membuat anak sapi sebagai tuhan yang berwujud jasad, yaitu patung sapi yang tidak memiliki ruh, namun bisa mengeluarkan suara (suara sapi) yang mana anak sapi itu dibuat oleh As-Samiry dengan cara membentuk jalan angin di dalamnya sehingga bisa menghasilkan suara. Apakah mereka tidak bisa melihat bahwa patung ini bisu, dan tidak mampu memberi petunjuk mereka kepada kebenaran dan jalan kebaikan. Mereka menganggapnya sebagai tuhan dan mereka menzalimi diri sendiri dalam hal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum Musa setelah kepergiannya} setelah kepergian Musa ke tempat munajatnya kepada Tuhan {mereka membuat dari perhiasan mereka} emas mereka {patung anak sapi yang memiliki tubuh} tubuh yang tidak ada ruhnya {dan memiliki suara} suara seperti suara sapi {Apakah mereka tidak mengetahui bahwa patung itu tidak dapat berbicara dengan mereka dan tidak menunjukkan mereka} tidak menuntun mereka {pada suatu jalan. Mereka menjadikannya (sesembahan). Mereka adalah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "148 “dan kaum Musa setelah kepergian Musa kegunung thur membuat dari perhiasan-perhiasan (emas) mereka anak lembu yang bertubuh” yang dibuat oleh samiri dan dia masukkan bekas jejak rasul kedalamnya, maka ia “bersuara” maka mereka pun menyembahnya dan menjadikannya sebagai tuhan. Samiri berkata ”ini adalah tuhanmu dan tuhan Musa. Musa lupa\" sehingga dia pergi untuk mencarinya. ini adalah kebodohan mereka dan minimnya ilmu mereka. Bagaimana mereka tidak bisa membedakan antara tuhan langit dan bumi dengan anak sapi makhluk yang paling hina? Oleh karena itu Allah menjelaskan bahwa ia tidak memiliki sifat-sifat dzat dan perbuatan menunjukan bahwa ia dalah tuhan. ”apakah mereka tidak mengetahui bahwa anak lembu itu tidak dapat berbicara dengan mereka”. Bisu adalah kekurangan yang nyata. mereka sendiri lebih bicara ”dan tidak dapat pula menunjukan jalan kepada mereka?” yakni ia tidak dapat menunjukan jalan agama dan tidak dapat menghasilkan kebaikan dunia untuk mereka, karena sudah diketahui oleh akal bahwa menyembah tuhan yang tidak bisa bicara, tidak bisa memberi manfaat maupun madarat termasuk kebatilan yang paling batil. dan kedunguan yang paling dungu. ”mereka menjadikannya (sebagai sesembahan) dan mereka adalah orang-orang yang zhalim”. dimana mereka meletakkan ibadah tidak pada tempatnya dan menyekutukan Allah tanpa bukti dalil dariNya. Dalam ayat ini terdapat petunjuk bahwa siapa yang mengingkari kalamallah berarti mengingkari kekhususan uluhiyah Allah, karena Allah menyebutkan bahwa ketidak mampuan berbicara adalah dalil ketidaklayakkannya untuk dijadikan sebagai tuhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 148: Patung anak sapi itu dibuat dari emas oleh Samiri lalu ditaruhnya segenggam jejak Rasul. Ketika sudah jadi patung anak sapi, Samiri berkata kepada kaum Nabi Musa, “Ini adalah tuhan kamu dan tuhannya Musa, namun ia lupa.” Ini adalah kebodohan mereka dan kurangnya bashirah (mata hati) mereka, bagaimana mereka bisa samar terhadap Tuhan Penguasa langit dan bumi oleh patung anak sapi tersebut yang merupakan makhluk lemah? Para mufassir berpendapat bahwa patung itu tetap patung tidak bernyawa, sedangkan suara yang seperti sapi itu hanyalah disebabkan oleh angin yang masuk ke dalam rongga patung itu dengan tekhnik yang dikenal oleh Samiri waktu itu, sedangkan sebagian mufassirin ada yang menafsirkan bahwa patung yang dibuat dari emas itu kemudian menjadi tubuh yang bernyawa dan mempunyai suara sapi (sebagai cobaan). Dalam ayat ini terdapat dalil, bahwa tidak bisa berbicara berarti tidak layak dijadikan sebagai tuhan. Patung tersebut tidak memiliki sifat dzatiyyah (seperti bisa bicara) maupun sifat fi’liyyah (seperti memberi petunjuk) yang menjadikannya layak disembah. Karena mereka meletakkan ibadah bukan pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 148",
    "description": "Dan kaum nabi musa, setelah kepergian beliau ke gunung sinai untuk bermunajat kepada Allah, mereka membuat patung anak sapi yang bertubuh dan dapat melenguh atau bersuara dari perhiasan emas. Mereka membuat patung anak sapi dari emas untuk disembah. Patung itu tetaplah patung tidak bernyawa. Suara yang seperti sapi itu hanyalah disebabkan oleh angin yang masuk ke dalam rongga patung itu dengan teknik yang dikenal oleh samiri waktu itu. Apakah mereka tidak mengetahui bahwa patung anak sapi itu tidak dapat berbicara dengan mereka sedikit pun, dengan pembicaraan apa pun, apalagi serupa dengan anugerah Allah kepada nabi musa, dan tidak dapat pula menunjukkan jalan apa pun kepada mereka, apalagi jalan keselamatan seperti dari gangguan dan siksaan fir'aun' mereka menjadikannya sebagai sembahan. Mereka, sejak dahulu hingga kini, adalah orang-orang yang zalim, yang telah merasuk kezalimannya dalam diri mereka. Setelah nabi musa datang, marah, membakar patung itu, dan menunjukkan kesesatan mereka, mereka pun sadar dan menyesal. Dan setelah mereka menyesali perbuatannya dan mengetahui bahwa mereka sungguh telah tersesat dari jalan kebenaran, mereka pun memohon rahmat dan ampunan dengan berkata, sungguh, jika tuhan pemelihara kami tidak memberi rahmat kepada kami, tidak menerima tobat kami, dan tidak mengampuni dosa kami, pastilah kami menjadi orang-orang yang rugi."
  }
]