[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika menyesal orang-orang yang menyembah patung anak sapi selain Allah itu ketika kembalinya Musa kepada mereka, dan mereka melihat bahwa sesungguhnya mereka telah sesat, melenceng dari jalan yang lurus, dan pergi jauh meninggalkan agama Allah, lalu mereka mulai mengakui penghambaan diri kepada Allah dan memohon ampunan. Mereka berkata, ”sesungguhnya bila tuhan kami tidak merahmati kami dengan menerima taubat kami, dan menutupi dosa-dosa kami dengannya, tentulah kami akan bebar-benar termasuk orang-orang yang binasa yang amal perbuatnnya akan hilang.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "149. Tatkala mereka menyesali perbuatan mereka, bimbang, dan menyadari bahwa mereka telah menyimpang dari jalan yang lurus dengan tindakan mereka menyembah patung anak sapi di samping menyembah Allah, mereka berdoa dengan sungguh-sungguh kepada Allah seraya berkata, “Sungguh, jika Rabb kami tidak berbelas kasih kepada kami dengan membimbing kami pada ketaatan kepada-Nya dan tidak mengampuni kesalahan kami yang telah menyembah patung anak sapi itu niscaya kami benar-benar akan tergolong orang-orang merugi di dunia dan Akhirat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "149. Kemudian Allah menjelaskan penyesalan mereka karena telah menyembah patung anak sapi setelah mereka merasa telah tersesat, seakan-akan mereka melihat aib mereka sehingga mereka menyesal dan memohon rahmat dan ampunan dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "149. وَلَمَّا سُقِطَ فِىٓ أَيْدِيهِمْ (Dan setelah mereka sangat menyesali perbuatannya) Mereka menyesal dan kebingungan. Terdapat pendapat mengatakan bahwa itu terjadi ketika Nabi Musa telah kembali dari pertemuan dengan Allah. وَرَأَوْا۟ أَنَّهُمْ قَدْ ضَلُّوا۟( dan mengetahui bahwa mereka telah sesat) Dengan membuat patung anak sapi, dan mereka telah diuji dengan bermaksiat kepada Allah. قَالُوا۟ لَئِن لَّمْ يَرْحَمْنَا رَبُّنَا وَيَغْفِرْ لَنَا(merekapun berkata: “Sungguh jika Tuhan kami tidak memberi rahmat kepada kami dan tidak mengampuni kami) Mereka kemudian berharap pertolongan Allah dan tunduk dan bersimpuh memohon kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "149. Dan ketika mereka menyesal dan menyadari bahwa mereka salah dan tersesat dari keimanan dengan menganggap patung anak sapi sebagai Tuhan, mereka bertaubat dan memohon pertolongan. Mereka berkata: “Jika Tuhan tidak mengasihi Kami dengan menerima taubat kami dan mengampuni dosa-dosa kami, maka sungguh kami benar-benar termasuk orang-orang yang merugikan diri sendiri atau orang-orang yang dibinasakan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setelah mereka menyesali perbuatannya} ketika mereka sangat menyesal atas perbuatan menyembah anak sapi itu {dan melihat} mengetahui {bahwa mereka benar-benar tersesat, mereka berkata,“Sungguh jika Tuhan kami tidak memberi rahmat kepada kami dan tidak mengampuni kami, pastilah kami menjadi orang-orang yang merugi.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "149 “dan manakala” Musa kembali kepada kaumnya dia mendapati mereka dalam keadaan tersebut. Musa menjelaskan kesesatan mereka, dan merekapun menyesal. ”mereka sangat menyesali perbuatannya” yakni bersedih tanda penyesalan atas perbuatan mereka, ”dan mengetahui bahwa mereka telah sesat” merekapun kembali kepada Allah dan merendahkan diri dihadapanNya “mereka pun berakta ’sungguh jika Rabb kami tidak memberi rahmat kepada kami” dengan membimbing kita ke jalan yang lurus, memberi taufik kepada ibadah kepadaNYa dan kepada amal-amal shalih, ”dan tidak mengampuni kami” atas dosa menyembah anak sapi yang telah kami lakukan, ”pastilah kami menjadi orang-orang yang merugi” yang merugi di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 149: Ketika Nabi Musa ‘alaihis salam kembali kepada kaumnya, Beliau mendapati kaumnya dalam keadaan menyembah patung itu, maka Beliau menerangkan bahwa yang demikian merupakan kesesatan. Di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 149",
    "description": "Setelah nabi musa datang, marah, membakar patung itu, dan menunjukkan kesesatan mereka, mereka pun sadar dan menyesal. Dan setelah mereka menyesali perbuatannya dan mengetahui bahwa mereka sungguh telah tersesat dari jalan kebenaran, mereka pun memohon rahmat dan ampunan dengan berkata, sungguh, jika tuhan pemelihara kami tidak memberi rahmat kepada kami, tidak menerima tobat kami, dan tidak mengampuni dosa kami, pastilah kami menjadi orang-orang yang rugi. Ayat yang lalu menjelaskan penyesalan mereka, sedang ayat ini menjelaskan keadaan nabi musa ketika menemukan kaumnya menyembah anak sapi. Dan ketika nabi musa telah kembali kepada kaumnya, setelah bermunajat kepada Allah, dalam keadaan marah dan sedih hati karena mengetahui kaumnya menyembah patung anak sapi, dia berkata, khususnya kepada nabi harun dan para pemuka kaumnya, alangkah buruknya perbuatan yang kamu kerjakan dalam melaksanakan tugas sebagai pengganti selama kepergianku! kalian lebih mementingkan menyembah patung anak lembu ketimbang mematuhi perintah tuhan untuk menunggu kedatanganku dan menepati janjiku untuk membawa taurat kepada kalian! apakah kamu hendak mendahului janji tuhanmu untuk mempercepat jatuhnya siksa' apakah kamu tidak sabar menanti kedatanganku kembali setelah munajat kepada tuhan, sehingga kamu membuat patung anak sapi untuk disembah sebagaimana menyembah Allah' nabi musa pun melemparkan lauh-lauh taurat yang diterima dari Allah melalui malaikat ketika bermunajat itu dan memegang rambut kepala saudaranya nabi harun sambil menarik ke arahnya. Nabi harun berkata, wahai anak ibuku! kaum yang menyembah sapi ini telah menganggapku lemah serta mengancamku dan hampir saja mereka membunuhku karena aku telah berusaha keras untuk mencegah mereka, sebab itu janganlah engkau menjadikan musuh-Musuh menyoraki melihat kemalanganku dengan kecamanmu yang keras ini, karena itu berarti engkau dan mereka sama mengecamku, dan janganlah engkau jadikan aku dengan kemarahanmu itu sebagai bersama orang-orang yang zalim yang melanggar perintahmu dan menyembah patung anak sapi."
  }
]