[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman, ”sesungguhnya engkau termasuk makhluk yang telah kutakdirkan penundaan ajalnya hingga tiupan sangkakala pertama kelak, tatkala semua makhluk menemui ajal kematiaanya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah berfirman kepadanya, “Hai Iblis! Sesungguhnya kamu termasuk yang diberi kesempatan hidup yang akan mati pada saat tiupan sangkakala yang pertama tatkala seluruh makhluk mati dan hanya sang Pencipta saja yang tersisa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. قَالَ إِنَّكَ مِنَ الْمُنظَرِينَ (Allah berfirman: “Sesungguhnya kamu termasuk mereka yang diberi tangguh”) Yakni termasuk makhluk yang ditangguhkan ajalnya, tidak sampai hari kebangkitan namun sampai sangkakala ditiup di hari kiamat. Terdapat pendapat mengatakan hikmah dari penangguhan ajalnya adalah sebagai cobaan bagi para hamba untuk mengetahui siapa yang taat dan siapa yang durhaka kepada iblis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Allah SWT berfirman: “Sesungguhnya kamu termasuk orang yang diabaikan lagi ditangguhkan sampai waktu terjadinya gempa dan kehancuran dengan tiupan pertama, yaitu tiupan ketakutan, bukan sampai hari kebangkitan” Hikmah dari hal tersebut adalah untuk menguji para hamba, supaya hamba yang taat dipisahkan dari yang bermaksiat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Sesungguhnya kamu termasuk makhluk yang diberi penangguhan waktu.”} yang diakhirkan dan ditangguhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. ketika musuh Allah mengumumkan permusuhannya kepada Allah, Adam anak cucunya, dia meminta kepada Allah penangguhan tempo sampai Hari kebangkitan, agar dapat menyesatkan bani Adam dengan apa yang dia mampu. Manakala hikmah Allah menuntut adanya ujian kepada hamba-hambaNya agar jelas mana yang benar keimanannya dan mana yang dusta, siapa yang taat kepadaNYa dan siapa yang taat kepada RasulNYa, maka Allah mengabulkan permintaannya. Dia berfirman ”sesungguhnya kamu termasuk mereka yang diberi tangguh”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 15: Hikmah (kebijaksanaan) Allah menghendaki untuk menguji hamba-hamba-Nya agar nampak jelas oarng yang jujur dengan orang yang dusta, orang yang taat kepada-Nya dengan orang yang taat kepada musuh-Nya. Oleh karena itu, Dia mengabulkan permohonan Iblis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 15",
    "description": "Dengan hikmah yang dimiliki-Nya, Allah menjadikan iblis sebagai ujian buat umat manusia dan mengabulkan permintaan iblis tersebut. Allah berfirman, benar, kamu termasuk yang diberi penangguhan waktu sampai hari yang ditentukan, yaitu ketika semua makhluk yang hidup dimatikan. (lihat: surah al-a'ijr/15: 38). Mendengar pernyataan Allah tersebut, iblis menjawab, karena engkau telah menyesatkan aku dengan menetapkan kesesatan padaku sampai hari kiamat, aku bersumpah pasti aku akan selalu menghalangi mereka, adam dan anak cucunya, dari jalan-Mu yang lurus, yaitu jalan kebaikan yang dapat mengantarkan manusia menuju kebahagiaan dunia dan akhirat."
  }
]