[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika Musa kembali kepada kaumnya dari bani israil dalam keadaan marah lagi sedih, karena Allah telah mengabarkan kepadanya bahwa Dia telah menguji kaumnya dan sesungguhnya samiri telah menyesatkan mereka, Musa berkata, ”alangkah buruk perubahan keadaan yang kalian lakukan pasca kepergianku. Apakah kalian ingin mendahului perintah kalian?” maksudnya, apakah kalian ingin kedatanganku kepada kalian lebih cepat, padahal telah ditentukan waktunya oleh Allah ? Dan musa melemparkan lauh-lauh taurat sebagai ekspresi marahnya terhadap kaumnya yang telah menyembah patung anak sapi, dan kemarahannya kepada saudaranya, Harun , dan memegang kepala saudaranya, dengan menariknya kearahnya. Harun berkata kepadanya sambil memelas, ”wahai putra ibuku, sesungguhnya kaumku merendahkanku dan memandangku sebagai orang yang lemah, dan hampir-hampir mereka itu akan membunuhku.Maka kamu jangnlah membuat musuh kegirangan karena tindakan yang kamu perbuat kepadaku, dan janganlah kamu menjadikan aku dalam kemarahanmu bersama kaum yang melanggar perintahmu dan menyembah patung anak sapi.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "150. Dan tatkala Musa -setelah bermunajat dengan Rabbnya- kembali kepada kaumnya dengan hati yang penuh kemarahan dan kesedihan karena mendapati mereka menyembah patung anak sapi, ia berkata, “Alangkah buruknya keadaan yang kalian ciptakan sesudah kepergianku dari kalian. Karena keadaan itu bisa menyebabkan datangnya kehancuran dan kesengsaraan. Apakah kalian bosan menungguku, sehingga kalian menyembah patung anak sapi itu?” Lalu Musa melemparkan lembaran-lembaran (Taurat) karena terbakar kemarahan dan kesedihan yang sangat hebat. Dan ia pun memegang kepala dan janggut saudaranya, Harun dan menariknya ke arahnya. Hal itu karena Harun tinggal bersama kaumnya tetapi tidak berbuat apa-apa ketika melihat mereka menyembah patung anak sapi. Harun meminta maaf kepada Musa seraya berkata, “Wahai putra ibuku! Sesungguhnya orang-orang itu menganggapku lemah sehingga mereka meremehkanku, bahkan mereka nyaris membunuhku. Jadi, janganlah kamu menghukumku dengan hukuman yang membuat musuh-musuhku bersuka ria. Dan janganlah kemarahanmu membuatku termasuk ke dalam golongan orang-orang zalim yang menyembah selain Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "150. Musa kembali kepada mereka dengan rasa sedih dan marah, akibat perbuatan yang dilakukan kaumnya selama dia tidak ada. Dia berkata: “Betapa buruk perbuatan yang kalian lakukan ketika aku pergi untuk bermunajat kepada Tuhanku; kalian menyembah patung anak sapi dan kecintaan kepadanya telah merasuk hati kalian, dan kalian tidak mempedulikan wasiat yang aku berikan kepada kalian untuk mengesakan Allah dan ikhlas dalam menyembahnya serta berjalan di atas sunnahku; padahal kewajiban orang yang ditinggalkan adalah berjalan di atas jalan orang yang meninggalkan, bukan dengan menyelisihinya.” Kemudian Musa memarahi mereka: “Apakah dengan menyembah patung anak sapi itu kalian hendak mendahului perintah Tuhan kalian, untuk menungguku dengan sabar dan tetap menjaga wasiatku untuk mengesakan Allah dan ikhlas menyembah-Nya hingga aku kembali kepada kalian dengan membawa kitab dari Allah; namun kalian mengubah wasiat itu dan menyembah patung anak sapi?” Mereka tidak sabar menunggu Musa kembali dari bukit Thur, sehingga Samiri menipu mereka dan membuatkan mereka patung anak sapi itu untuk mereka sembah. Kemudian Allah menjelaskan dua akibat dari kemarahan Musa: Pertama, Musa membuang lauh-lauh Taurat dari tangannya akibat kemarahan besar dan keheranan yang menghampirinya, ketika dia sampai pada kaumnya ternyata mereka sedang menyembah patung anak sapi. Sehingga dia membuang lauh-lauh itu karena kemarahan karena Allah dan membela agamanya serta kemurkaan kepada kaumnya yang menyembah berhala sebagai simbol kesesatan. Kedua, Musa menarik rambut saudaranya, Harun, karena marah kepadanya; sebab Musa mengira dia telah lalai dalam menasehati kaumnya dan melarang mereka menyembah patung anak sapi itu. Namun Harun mulai menenangkan Musa dengan mengungkapkan hubungan persaudaraan di antara keduanya agar kemarahannya hilang dan menghilangkan tuduhan yang diarahkan kepadanya serta agar tidak terburu-buru memarahinya, sebab dia tidak lalai dalam menasehati mereka, akan tetapi merekalah yang memaksa dan menindasnya, bahkan hampir membunuhnya; maka hendaklah Musa tidak menjadikan musuh-musuhnya menertawakan dan menghina mereka berdua, sebab seharusnya dia menolong saudaranya dan tidak menuduhnya berbuat kezaliman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "150. وَلَمَّا رَجَعَ مُوسَىٰٓ إِلَىٰ قَوْمِهِۦ غَضْبٰنَ أَسِفًا (Dan tatkala Musa telah kembali kepada kaumnya dengan marah dan sedih hati) Yakni bersedih. Pendapat lain mengatakan makna dari (الأسف) yakni keadaan yang melebihi kemarahan. قَالَ بِئْسَمَا خَلَفْتُمُونِى مِنۢ بَعْدِىٓ ۖ( berkatalah dia: “Alangkah buruknya perbuatan yang kamu kerjakan sesudah kepergianku) Seburuk-buruk perbuatan adalah apa yang kalian perbuat setelah kepergianku dari kalian. أَعَجِلْتُمْ أَمْرَ رَبِّكُمْ ۖ( Apakah kamu hendak mendahului janji Tuhanmu?) Apakah kalian tidak sabar menunggu janji Allah yang telah diberikan kepadaku yaitu selama 40 hari sehingga kalian melakukan hal ini. Atau maknanya adalah apakah kalian tidak sabar untuk mendapatkan kemurkaan Tuhan kalian dengan menyembah anak sapi. وَأَلْقَى الْأَلْوَاحَ(Dan Musapun melemparkan luh-luh (Taurat) itu) Yakni melemparnya disebabkan besarnya kemarahan dan kekecewaannya, ketika ia mengamati kaumnya telah berada dalam penyembahan kepada anak sapi. وَأَخَذَ بِرَأْسِ أَخِيهِ يَجُرُّهُۥٓ إِلَيْهِ ۚ( dan memegang (rambut) kepala saudaranya (Harun) sambil menariknya ke arahnya) Yakni menarik kepala saudaranya, Harun atau rambut kepalanya, karena ia tinggal bersama mereka namun tidak merubah apa yang dilihatnya berupa penyembahan bani Israil kepada anak sapi. قَالَ ابْنَ أُمَّ إِنَّ الْقَوْمَ اسْتَضْعَفُونِى وَكَادُوا۟ يَقْتُلُونَنِى(Harun berkata: “Hai anak ibuku, sesungguhnya kaum ini telah menganggapku lemah dan hampir-hampir mereka membunuhku) Sehingga aku tidak mampu merubah apa yang mereka lakukan. Musa memanggilnya dengan anak ibuku karena kalimat itu adalah kalimat yang lembut dan santun dan karena ibu mereka sebagaimana disebutkan adalah wanita beriman. فَلَا تُشْمِتْ بِىَ الْأَعْدَآءَ (sebab itu janganlah kamu menjadikan musuh-musuh gembira melihatku) Maka janganlah kamu jadikan mereka senang karena melihatmu menghukumku. وَلَا تَجْعَلْنِى مَعَ الْقَوْمِ الظّٰلِمِينَ (dan janganlah kamu masukkan aku ke dalam golongan orang-orang yang zalim) Yakni janganlah kamu menggolongkanku termasuk orang-orang yang zalim karena kemarahanmu, Yakni termasuk orang-orang yang menyembah anak sapi. Karena aku tidak melakukan apa yang mereka lakukan. Atau maknanya adalah janganlah kamu beranggapan bahwa aku termasuk dalam golongan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَلَمَّا رَجَعَ مُوسَىٰ إِلَىٰ قَوْمِهِ غَضْبَانَ أَسِفًا } \"Dan tatkala Musa telah kembali kepada kaumnya dengan marah dan sedih hati\" marah untuk Allah adalah bagian dari pengagungan kepada-Nya, dan marah karena Allah kepada siapa yang berbuat buruk juga bagian dari pengagungan kepada-Nya, begitupun dengan ceracaan bagi siapapun yang melampaui batas dan melanggar aturan Allah, maka tidaklah ada kebaikan bagi siapa saja yang tidak marah untuk membela kebenaran dari tuannya. 2 ). Pelajaran penting dari ucapan Harun kepada saudaranya Musa : { قَالَ ابْنَ أُمَّ } \"Harun berkata: \"Hai anak ibuku\" Harun tdak mengatakan \"wahai saudaraku\" atau \"wahai Musa\" , karena situasi saat itu adalah permintaan Harun agar Musa menjadi tenang dan memberikan kasih sayangnya, maka Harun pun menyebut Ibunya karena kasih sayang terindah darinya juga kelembutannya yang hangat.. dan apa yang diharapkan benar-benar terjadi, ketika Musa dalam keadaan marah besar seketika terdiam tenang dan berkata : { قَالَ رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ ۖ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ } \"Musa berdoa: “Ya Tuhanku, ampunilah aku dan saudaraku dan masukkanlah kami ke dalam rahmat Engkau, dan Engkau adalah Maha Penyayang di antara para penyayang\" [ Al-A'raf : 151 ]. Sungguh betapa keindahan ucapan sangat mempengaruhi lembutnya hati seseorang. 3 ). Tatkala Musa kembali, ia mendapati kaumnya tengah menyembah anak sapi; dia kemudian marah dan mengambil rambut saudaranya, dan mencelanya dengan claan yang keras, namun Harun hanya bisa berkata kepada Musa : { فَلَا تُشْمِتْ بِيَ الْأَعْدَاءَ } \"sebab itu janganlah kamu menjadikan musuh-musuh gembira melihatku\" , pelajaran penting bagi para pengikut Nabi dalam menyelesaikan masalah mereka sekalipun itu besar, yaitu menjauh dari segala hal yang mengundang kegembiraan musuh-musuh dan orang-orang dengki terhadap kesialan diri kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "150. Dan ketikan Musa kembali kepada kaumnya dari miqat munajatnya dalam keadaan marah dan sedih karena mereka menyembah berhala, dia berkata: “Seburuk-buruk perbuatan adalah perbuatan kalian setelah kepergianku. Apakah kalian mau mendahului perintah dan janji Tuhan, sehingga kalian tidak bersabar. Dia memberi janji kalian selama 40 hari, dan ketika aku tidak kembali dengan cepat, kalian malah menyembah kepada selain Dia” Lalu Musa melemparkan catatan-catatan Taurat karena kemarahan dan kekecewaannya atas penyembahan anak sapi itu, lalu memegang rambut saudaranya dan menariknya untuk memperingatkan tindakannya yang lembek bukan untuk menghinanya. Kemudian Harun berkata kepadanya: “Wahai anak Ibu (Itu adalah kata-kata yang penuh simpati dan keramahan) sesungguhnya kaum yang menyembah anak sapi itu menganggapku lemah dan tidak punya sekutu, bahkan mereka berencana membunuhku, maka janganlah kamu membuat para musuh bergembira dengan penghinaanmu terhadapku dan janganlah menganggapku sebagai salah satu kaum zalim yang menyembah berhala. Aku bukanlah salah satu dari mereka, aku tidak mengerjakan sesuatu seperti mereka, dan jangan salahkan aku atas perbuatan mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Musa kembali kepada kaumnya dalam keadaan marah lagi sedih} sedih {dia berkata,“Alangkah buruknya perbuatan yang kalian kerjakan setelah kepergianku. Apakah kalian hendak mendahului janji Tuhan kalian} Apakah kalian hendak mendahului janji Tuhan kalian {Musa pun melemparkan} melemparkan {lembaran-lembaran itu dan memegang kepala saudaranya sambil menariknya ke arahnya. Harun berkata,“Wahai anak ibuku} wahai anak ibuku {kaum ini telah menganggapku lemah} merendahkanku {dan hampir saja mereka membunuhku. Jadi janganlah membuat senang} membuat gembira {musuh-musuh itu atas diriku dan janganlah menjadikanku bersama kaum yang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "150 “dan tatkala Musa telah kembali kepada kaumnya dengan marah dan sedih hati” yakni Musa dipenuhi oleh amarah dan emosi kepada mereka karena kecemburuannya yang besar terhadap Allah dan kasih sayang serta ketulusannya yang sempurna ”berkatalah dia 'alangkah buruknya perbuatan yang kamu kerjakan sesudah kepergianku” yakni alangkah buruknya keadaan kalian setelah kepergianku dari kalian, sesungguhnya ia adalah keadaan yang menyeret kepada kebinasaan dan kesengsaraan untuk selama-lamanya, ”apakah kamu hendak mendahului janji Rabbmu?” di mana Dia telah menjanjikan kepamu untuk menurunkan kitab tetapi kamu tergesa-gesa dengan akalmu yang rusak sehingga melakukan perbuatan buruk ini. ”dan Musa pun melempar lauh-lauh taurat itu” yakni dia melemparnya karena marah. ”dan (memegang rambut) kepala saudaranya.” harun dan juga jenggotnya. ”sambil menarik kearahnya” dan Musa berkata kepadanya ”apa yang menghalangi kamu ketika mereka telah sesat, (sehingga) kamu tidak mengikuti aku? maka apakah kamu telah (sengaja) mendurhakai perintahku?” kepadamu dengan ucapanku. ”gantikanlah aku dalam memimpin kaumku, dan perbaikilah, dan janganlah kamu mengikuti jalan orang-orang yang berbuat kerusakan” harun menjawab ”hai putra ibuku, janganlah kamu pegang jenggotku dan jangan pula kepalaku, sesungguhnya aku khawatir kamu akan berkata kepadaku ‘kamu telah memcah antara kaum Bani israil dan kamu tidak memelihara amanatku” Dan disini harun menjawab ”hai anak ibuku” ucapan ini untuk melunakkan Musa dengan hanya menyinggung ibu saja. Namun demikian, sebenarnya dia adalah saudara kandungnya, ”sesungguhnya kaum ini telah menganggapku lemah” yakni mereka meremehkanku ketika kau berkata kepada mereka, ”wahai kaumku, kalian hanya di fitnah dengannya dan bahwa Rabbmu adalah Allah yang maha Rahman, maka ikutilah aku dan taatilah perintahku.” \"dan hampir-hampir mereka membunuhku” yakni janganlah kamu mendugaku lalai. ”sebab itu janganlah kamu menjadikan musuh-musuh gembira melihatku” dengan hardikmu kepadaku dan perlakuan burukmu padaku karena musuh-musuh selalu berusaha dengan sungguh-sungguh dalam memunculkan kesalahan dan menemukan kekeliruan padaku, ”dan janganlah kamu masukan aku kedalam golongan orang-orang yang zhalim.” lalu kamu memperlakukanku seperti mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 150: Maksudnya, “Apakah kamu tidak sabar menanti kedatanganku kembali setelah bermunajat dengan Allah sehingga kamu membuat patung untuk disembah sebagaimanas menyembah Allah?” Dalam Surah Thaha ayat 92 dan 93 disebutkan, bahwa Musa berkata kepada Harun, \"Wahai Harun! Apa yang menghalangi kamu ketika kamu melihat mereka telah sesat,--(sehingga) kamu tidak mengikutiku? Apakah kamu telah (sengaja) mendurhakai perintahku?\" Ketika Harun berkata kepada mereka, “Wahai kaumku! Sesungguhnya kamu hanya diberi cobaan dengan anak sapi itu dan sesungguhnya Tuhanmu ialah (Tuhan) yang Maha Pemurah, maka ikutilah aku dan taatilah perintahku.” (lihat Thaha: 90) Yakni “Maka janganlah engkau menyangka bahwa diriku meremehkan dalam memimpin.” Karena mereka ingin sekali melihatku disalahkan. Sehingga engkau bermu’amalah denganku seperti bermu’amalah dengan orang zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 150",
    "description": "Ayat yang lalu menjelaskan penyesalan mereka, sedang ayat ini menjelaskan keadaan nabi musa ketika menemukan kaumnya menyembah anak sapi. Dan ketika nabi musa telah kembali kepada kaumnya, setelah bermunajat kepada Allah, dalam keadaan marah dan sedih hati karena mengetahui kaumnya menyembah patung anak sapi, dia berkata, khususnya kepada nabi harun dan para pemuka kaumnya, alangkah buruknya perbuatan yang kamu kerjakan dalam melaksanakan tugas sebagai pengganti selama kepergianku! kalian lebih mementingkan menyembah patung anak lembu ketimbang mematuhi perintah tuhan untuk menunggu kedatanganku dan menepati janjiku untuk membawa taurat kepada kalian! apakah kamu hendak mendahului janji tuhanmu untuk mempercepat jatuhnya siksa' apakah kamu tidak sabar menanti kedatanganku kembali setelah munajat kepada tuhan, sehingga kamu membuat patung anak sapi untuk disembah sebagaimana menyembah Allah' nabi musa pun melemparkan lauh-lauh taurat yang diterima dari Allah melalui malaikat ketika bermunajat itu dan memegang rambut kepala saudaranya nabi harun sambil menarik ke arahnya. Nabi harun berkata, wahai anak ibuku! kaum yang menyembah sapi ini telah menganggapku lemah serta mengancamku dan hampir saja mereka membunuhku karena aku telah berusaha keras untuk mencegah mereka, sebab itu janganlah engkau menjadikan musuh-Musuh menyoraki melihat kemalanganku dengan kecamanmu yang keras ini, karena itu berarti engkau dan mereka sama mengecamku, dan janganlah engkau jadikan aku dengan kemarahanmu itu sebagai bersama orang-orang yang zalim yang melanggar perintahmu dan menyembah patung anak sapi. Setelah mengetahui alasan saudaranya, nabi harun, dan memahami bahwa dia tidak melalaikan tugasnya, dia, nabi musa berdoa, ya tuhanku, yang selalu memelihara, membimbing dan berbuat baik padaku, ampunilah aku atas kemarahanku ini yang membuatku bertindak tidak wajar, dan ampuni juga saudaraku atas apa yang terjadi antara dia dan kaumku, atau kelalaiannya'jika ada'dalam menjalankan tugas, dan masukkanlah kami berdua ke dalam rahmat engkau yang amat luas, dan engkau adalah maha penyayang dari semua penyayang. Engkau memberi tanpa batas, bahkan kepada mereka yang mendurhakai-Mu."
  }
]