[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata setelah menjadi jelas alasan saudaranya, dan tahu bahwa saudaranya tidak berbuat kesalahan dalam perkara yang menjadi tanggung jawabnya dari perintah Allah, ”wahai tuhanku, amunilah kemarahanku dan ampunilah bagi saudaraku apa yang telah terjadi antara dirinya dan Bani israil. Dan masukanlah kami kedalam rahmatMu yang amat luas. Sesungguhnya Engkau paling penyayang kepada kami daripada seluruh yang penyayang.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "151. Musa berdoa kepada Tuhannya, “Ya Tuhanku! Ampunilah aku. Dan ampunilah saudaraku, Harun. Masukkanlah kami ke dalam rahmat-Mu dan lingkupilah kami dengan rahmat-Mu dari segala penjuru. Karena Engkau -wahai Tuhanku- lebih menyayangi kami dari siapa pun.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "151. Musa akhirnya percaya bahwa Harun tidak bersalah. Maka kemudian Musa berdoa kepada Tuhannya dengan menampakkan kepada Harun permohonan maafnya dan menampakkan kepada musuh-musuhnya bahwa dia telah meridhai saudaranya setelah yakin dia tidak bersalah, dia berdoa: “Ya Tuhanku, ampunilah aku atas kesalahanku berupa perkataan dan perbuatan yang keras terhadap saudaraku, dan ampunilah dia seandainya dia telah lalai, karena Engkau lebih mengetahui; dan masukkanlah kami ke dalam rahmat-Mu yang meliputi segala sesuatu, Engkaulah Yang Maha Merahmati hamba-hamba-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "151. قَالَ رَبِّ اغْفِرْ لِى وَلِأَخِى (Musa berdoa: “Ya Tuhanku, ampunilah aku dan saudaraku) Untuk menghilangkan ketakutan saudaranya dari kegembiraan musuh."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ رَبِّ اغْفِرْ لِي وَلِأَخِي } Ka'b berkata : boleh jadi seseorang yang hanya berdiri mendapat kesyukuran baginya, dan boleh jadi juga seseorang hanya tidur mendapat ampunan dari tuhannya, hal itu ketika dua orang yang saling mencintai karena Allah, kemudian berdirilah salah satu dari keduanya untuk mendirikan shalat, lalu Allah ridho dengan shalat dan doanya, dalam doanya ia menyebut saudaranya dan mendoakan untuknya padahal saudaranya sedang tertidur pulas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "151. Musa berkata: “Wahai tuhanku, ampunilah atas perbuatanku ini terhadap saudaraku, dan ampunilah saudaraku, Harun, jika dia lalai dan membatasi diri untuk mencegah perbuatan mereka, serta masukkanlah kami ke dalam surga dan rahmatMu yang luas. Engkaulah Dzat yang Maha Pengasih di dunia dan akhirat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berdoa,“Ya Tuhanku, ampunilah aku dan saudaraku serta masukkanlah kami ke dalam rahmatMu. Engkaulah Maha Penyayang dari semua yang penyayang.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151 Musa menyesal atas perbuatannya yang teruru-buru terhadap saudaranya sebelum dia mengetahui bahwa saudaranya tidak seperti yang dia duga. Musa berkata, ”ya Rabbku ampunilah aku dan saudaraku” Harun. ”dan masukkanlah kami dalam RahmatMu” yakni di dalamnya jadikanlah RahmatMu meliputi kami dari segala segi karena ia adalah benteng yang kokoh dari segala keburukan dan disanalah seluruh kebaikan dan kebahagiaan. ”dan engkau adalah Maha penyayang diantara para penyayang.” yakni lebih menyayangi kami dari seluruh penyayang, lebih sayang kepada kami daripada bapak, ibu, anak dan diri kami sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 151: Maka Nabi Musa ‘alaihis salam merasa menyesal karena tergesa-gesa menarik kepala saudaranya sebelum mengetahui bahwa Harun tidak salah, karena Harun dikiranya kurang memperhatikan, kemudian Nabi Musa ‘alaihis salam berdoa seperti yang disebutkan dalam ayat di atas. Karena rahmat-Mu merupakan benteng yang paling kokoh yang melindungi dari semua keburukan. Engkau lebih penyayang kepada kami dari bapak dan ibu kami, bahkan daripada diri kami sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 151",
    "description": "Setelah mengetahui alasan saudaranya, nabi harun, dan memahami bahwa dia tidak melalaikan tugasnya, dia, nabi musa berdoa, ya tuhanku, yang selalu memelihara, membimbing dan berbuat baik padaku, ampunilah aku atas kemarahanku ini yang membuatku bertindak tidak wajar, dan ampuni juga saudaraku atas apa yang terjadi antara dia dan kaumku, atau kelalaiannya'jika ada'dalam menjalankan tugas, dan masukkanlah kami berdua ke dalam rahmat engkau yang amat luas, dan engkau adalah maha penyayang dari semua penyayang. Engkau memberi tanpa batas, bahkan kepada mereka yang mendurhakai-Mu. Setelah menjelaskan sikap nabi musa terhadap nabi harun dan doanya kepada Allah. Allah menjelaskan sanksi yang pantas diterima oleh mereka yang durhaka, yaitu sesungguhnya orang-orang yang penuh antusias dan sungguh-sungguh menjadikan patung anak sapi sebagai sembahannya dan enggan bertobat, kelak akan menerima kemurkaan yang besar dari tuhan mereka dengan dijauhkan dari rahmat-Nya, dan kehinaan dalam kehidupan di dunia oleh sebab kekufuran mereka. Demikianlah kami memberi balasan kepada orang-orang yang berbuat kebohongan terhadap Allah, seperti menjadikan anak sapi sebagai sembahan."
  }
]