[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mengerjakan dosa-dosa, berupa kekafiran dan berbagai macam maksiat, kemudian mereka kembali setelah perbuatan tersebut menuju keimanan dan amal shalih, sesungguhnya tuhanmu setelah adanya taubat nasuha benar-benar maha pengampun terhadap perbuatan-perbuatan mereka, tidak mempermalukan mereka dengannya, maha penyayang kepada mereka dan kepada setiap orang yang serupa dengan mereka dari orang-orang yang bertaubat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "153. Orang-orang yang melakukan keburukan seperti menyekutukan Allah dan berbuat maksiat, kemudian bertobat kepada Allah dengan beriman kepada-Nya dan meninggalkan perbuatan maksiat yang telah mereka lakukan, sesungguhnya Rabbmu setelah pertobatan ini dan kembali dari musyrik menuju iman dan dari kemaksiatan menuju ketaatan -wahai Rasul- Maha Pengampun dengan menutupi dan memaafkannya lagi Maha Penyayang bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "153. Kemudian Allah membuka pintu taubat bagi setiap orang yang benar-benar jujur dalam taubatnya, dengan mengabarkan bahwa orang-orang yang berbuat keburukan kemudian bertaubat setelahnya dengan taubat yang sungguh-sungguh dan kembali kepada Allah dengan penuh penyesalan dan keikhlasan, maka setelah mereka berhenti dari melakukan dosa-dosa besar itu, Allah akan mengampuni dan merahmati mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "153. وَالَّذِينَ عَمِلُوا۟ السَّيِّـَٔاتِ (Orang-orang yang mengerjakan kejahatan) Kejahatan apapun itu. ثُمَّ تَابُوا۟ مِنۢ بَعْدِهَا(kemudian bertaubat sesudah itu) Yakni setelah melakukan kejahatan itu. وَءَامَنُوٓا۟( dan beriman) Kepada Allah. إِنَّ رَبَّكَ مِنۢ بَعْدِهَا(sesungguhnya Tuhan kamu sesudah itu) Yakni sesudah taubat itu. Atau seseudah melakukan kejahatan itu lalu beriman kepada Allah. لَغَفُورٌ رَّحِيمٌ (Maha Pengampun lagi Maha Penyayang) Yang memiliki ampunan dan rahmat yang banyak bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "153. Dan orang-orang yang berbuat keburukan atau kemaksiatan, kemudian bertaubat setelahnya, dan beriman kepada Allah dan rasulNya, maka sesungguhnya Tuhanmu itu Maha Pengampun dan Maha Pengasih bagi mereka setelah melakukan taubat, yaitu Dzat yang banyak ampunan dan kasih sayangNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang mengerjakan keburukan, kemudian setelah itu bertaubat dan beriman, sesungguhnya Tuhanmu setelah itu Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153 Mereka telah mendapatkan murka dari Allah dimana Dia merintahkan mereka membunuh dari mereka, dan bahwa Allah tidak meridhai mereka kecuali dengan itu. Lalu sebagaimana dari mereka membunuh sebagaian yang lain dan pembunuhan tersebut memakan korban yang banyak, kemudian Allah mengampuni mereka setelah itu. Oleh karena itu Allah menyebutkan hukum secara umum, dimana mereka dan selain mereka masuk kedalamnya. ”orang-orang yang mengerjakan kejahatan” baik dosa syirik, dosa besar, dan dosa kecil, ”kemudian bertaubat sesudah itu” yakni mereka menyesalinya, meninggalkannya, dan bertekad tidak kembali mengulangnya “dan beriman” kepada Allah dan kepada apa yang Allah wajibakan untuk diimani, dan iman tidak sempurna kecuali dengan amalan hati dan amalan anggota badan yang merupakan tuntutan iman, ”sesungguhnya Rabbmu sesudah taubat yang disertai dengan iman itu,” yakni setelah keadaan taubat dari kejahatan dan kembali pada ketaatan, ”adalah Maha pengampun” mengampuni keburukan dan menghapusnya meskipun ia sepunuh jagad, ”lagi Maha Penyayang” dengan menerima taubat dan memberi taufik untuk dapat beramal shalih dan menerimanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 153: Syirk, dosa besar dan dosa kecil. Dengan menyesali apa yang telah berlalu, berhenti melakukannya, dan berniat keras untuk tidak mengulanginya. Kepada Allah dan kepada apa saja yang wajib diimani, dan iman tidaklah sempurna kecuali dengan amalan hati dan anggota badan yang merupakan hasil dari keimanan. Terhadap semua kejahatan, meskipun sepenuh bumi. Dengan menerima tobatnya, memberinya taufik untuk mengerjakan kebaikan, serta menerimanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 153",
    "description": "Sedangkan mereka yang menyadari kesalahannya dan mau bertobat, Allah menyatakan, dan orang-orang yang telah mengerjakan kejahatan dengan sengaja, dalam bentuk kekufuran dan kemaksiatan, kemudian walau setelah berlalu waktu lama bertobat sesudah kedurhakaan yang dilakukannya itu dan beriman serta beramal shaleh, sesungguhnya tuhan pemeliharamu, pasti setelah itu, yaitu tobat yang disertai iman, maha pengampun sehingga akan menghapus dosa-dosa mereka, lagi maha penyayang dengan melimpahkan anugerah kepada mereka. Setelah menjelaskan sikap masing-masing dan perlakuan Allah terhadap mereka, kisah penyembahan anak sapi diakhiri dengan firmannya, dan setelah amarah nabi musa mereda, dia mengambil kembali lauh-lauh taurat yang tadi dilemparkannya ke tanah itu; dan di dalam tulisannya terdapat petunjuk menuju jalan kebahagiaan dan rahmat bagi orang-orang yang selalu takut kepada tuhannya."
  }
]