[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika Musa telah tenang dari amarahnya, dia mengambil lauh-lauh taurat setelah melemparnya ke tanah.dan di dalamnya terdapat penjelasan tentang kebenaran dan rahmat bagi orang-orang yang takut kepada Allah dan khawatir akan siksaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "154. Setelah kemarahan Musa -‘Alaihissalām- reda, ia mengambil lembaran-lembaran (Taurat) yang dilemparkannya karena dibakar amarahnya. Sedangkan papan-papan tersebut berisi petunjuk dari jalan yang sesat menuju jalan yang benar. Dan juga berisi rahmat bagi orang-orang yang takut kepada Tuhan dan takut akan hukuman-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "154. Ketika kemarahan Musa reda setelah saudaranya meminta maaf dan kaumnya telah bertaubat, Musa kembali mengambil lauh-lauh yang telah dia lempar. Lauh-lauh itu mengandung petunjuk agung menuju jalan yang benar dan rahmat yang luas bagi orang-orang yang sangat takut kepada Pencipta mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "154. وَلَمَّا سَكَتَ عَن مُّوسَى الْغَضَبُ (Sesudah amarah Musa menjadi reda) Ketika telah tenang. أَخَذَ الْأَلْوَاحَ ۖ( lalu diambilnya (kembali) luh-luh (Taurat) itu) Yang telah dilemparnya ketika ia marah. وَفِى نُسْخَتِهَا هُدًى وَرَحْمَةٌ(dan dalam tulisannya terdapat petunjuk dan rahmat) Yakni dalam tulisan yang ada pada lauh-lauh (papan-papan) yang pecah itu, dan dipindah ke papan-papan yang lain, yang berisi hukum-hukum. Adapun rahmat adalah rahmat yang luas yang mereka dapatkan dari Allah ketika mereka mengamalkan isi kandungan Taurat itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "154. Dan ketika kemarahan Musa lenyap dan menjadi tenang, dia mengambil catatan taurat yang dilempar ketika marah. Dan yang tercatat di dalamnya adalah tuntunan bagi orang-orang yang tersesat, petunjuk menuju hikmah, dan rahmat yang luas bagi orang-orang yang takut kepada Tuhannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setelah mereda} tenang {amarah Musa, dia mengambil lembaran-lembaran itu. Di dalam tulisannya} dalam tulisannya {terdapat petunjuk dan rahmat bagi orang-orang yang takut kepada Tuhannya} takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "154 “sesudah amarah Musa menjadi reda” yakni kemarahannya reda, jiwanya tenang, dan dapat mengusai dirinya, maka dia mulai melakukan perkara paling penting padanya, maka dia mengambil ”lauh-lauh (taurat) itu” yang dia lemparkan, dan ia adalah lauh-lauh yang mulia dan berukuran besar ”dan dalam tulisannya” yakni mengandung dan berisi ”petunjuk dan rahmat” yakni di dalamnya terdapat petunjuk dari kesesatan, penjelasan tentang kebenaran dari kebatilan, perbuatan baik dan perbuatan buruk, petunjuk kepada amalan, akhlak, dan adab terbaik, serta rahmat dan kebahagiaan bagi yang melaksankannya dan mengetahui hukum-hukum dan makna-maknanya. Akan tetapi tidak semua orang mau menerima petunjuk Allah dan RahmatNya, yang bersedia menerima, menaati, dan tunduk kepadanya adalah ”Orang-orang yang takut kepada Rabbnya” Adapun orang yang tidak takut kepada Allah dan tidak pula kepada pengadilan di hadapanNYa, maka ia hanya menambah kesombongannya dan penolakannya, dan hujjah Allah pun tegak atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 154: Adapun orang-orang yang tidak takut kepada Tuhannya, maka hal itu tidak menambahnya selain sikap congkak dan menjauh, dan kepadanya hujjah Allah tegak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 154",
    "description": "Setelah menjelaskan sikap masing-masing dan perlakuan Allah terhadap mereka, kisah penyembahan anak sapi diakhiri dengan firmannya, dan setelah amarah nabi musa mereda, dia mengambil kembali lauh-lauh taurat yang tadi dilemparkannya ke tanah itu; dan di dalam tulisannya terdapat petunjuk menuju jalan kebahagiaan dan rahmat bagi orang-orang yang selalu takut kepada tuhannya. Dan nabi musa memilih tujuh puluh orang dari pemuka kaumnya yang terbaik untuk memohon tobat kepada kami di bukit sinai pada waktu yang telah kami tentukan. Sesampainya di tempat itu, mereka menyatakan tidak akan beriman kepada musa sampai dia memperlihatkan kepada mereka tuhan yang pernah berbicara kepadanya. Ketika itu mereka ditimpa gempa bumi yang dahsyat, sampai mati semuanya, dan nabi musa memohon kepada Allah sambil menengadahkan diri dan berkata, ya tuhan pemelihara-ku, apa yang akan aku katakan kepada bani israil ketika aku kembali kepada mereka' engkau telah membinasakan orang-orang yang terbaik dari mereka. Jika seandainya engkau kehendaki, tentulah engkau binasakan mereka, saat terjadi penyembahan anak sapi, karena kelalaian mereka tidak mencegah penyembahan anak sapi, dan juga engkau binasakan aku karena kelalaianku atau sebab lainnya sebelum ini, yaitu sebelum menghadap ke hadirat-Mu, seperti saat aku membunuh seorang koptik. Apakah engkau akan membinasakan kami karena perbuatan orang-orang yang kurang berakal di antara kami yang menyembah anak sapi itu' apa yang dilakukan oleh para penyembah patung anak sapi itu hanyalah cobaan dari-Mu, engkau sesatkan dengan cobaan itu siapa yang engkau kehendaki kesesatannya setelah nyata kehendak mereka untuk sesat dan engkau beri petunjuk kepada siapa yang engkau kehendaki berdasarkan kesiapan jiwa untuk menerima petunjuk. Engkaulah satu-satunya pemimpin dan pelindung kami, maka ampunilah segala dosa kami dan berilah kami rahmat. Engkaulah pemberi ampun yang terbaik karena engkau mengampuni bukan untuk mendapat pujian, atau menghindari kecaman. Perbuatan mereka membuat patung anak sapi dan menyembahnya itu adalah suatu cobaan dari Allah untuk menguji mereka, siapa yang sebenarnya kuat imannya dan siapa yang masih ragu-ragu. Orang yang lemah imannya itulah yang mengikuti samiri dan menyembah patung anak sapi itu. Tetapi orang yang kuat imannya, tetap dalam keimanannya."
  }
]