[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Musa memilih dari kaumnya sebanyak tujuh puluh orang pilihan, dan dia pergi bersama mereka menuju gunung thur(Sinai) dalam waktu dan saat yang telah Allah janjikan kepadanya untuk berjumpa dengaNYa dalam waktu tersebut bersama mereka untuk bertaubat dari tindakan yang dilakukan orang-orang bodoh dari kalanagn bani israil berupa menyembah patung anak sapi. Maka ketika mereka sampai tempat itu, mereka berkata, ”kami tidak akan beriman kepadamu wahai Musa, sampai kamu dapat memperlihatkan Allah kepada kami dengan terang, karena sesungguhnya kamu telah berbicara denganNYa, maka perlihatkanlah Allah kepada kami.” lalu gempa bumi yang dahsyat mengguncang mereka, sehingga mereka mati. Kemudian musa berdiri merendahkan diri memohon kepada Allah dan berucap, ”wahai tuhanku, apa lagi yang harus aku ucapkan kepada bani israil bila aku temui mereka, sedang engkau telah membinasakan orang-orang terbaik mereka? bila engkau kehendaki, niscaya engkau akan membinasakan semuanya sebelum sekarang ini dan aku pun termasuk mereka. Sesungguhnya itu lebih mudah atas diriku. Apakah Engkau akan membinasakan kami lantaran apa yang diperbuat orang-orang yang bodoh dari kami? tidaklah perbuatan yang diperbuat kaumku berupa penyembahan mereka terhadap patung anak sapi, kecuali merupakan cobaan dan ujian. Engkau sesatkan dengannya orang-orang yang Engkau kehendaki dari makhlukMu dan Engkau beri hidayah dengannya orang-orang yang Engkau kehendaki memperoleh hidayah. Engkau adalah pelindung kami dan penolong kami.maka, maka ampunilah dosa-dosa kami dan rahmatilah kami dengan rahmatMu. Dan Engkau adalah sebaik-baik yang memaafkan kejahatan dan menutup dosa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "155. Musa memilih tujuh puluh orang terbaik dari kaumnya untuk memohon ampun kepada Rabb mereka atas tindakan orang-orang awam yang telah menyembah patung anak sapi. Dan Allah memerintahkan kepada mereka agar datang di tempat dan waktu yang ditentukan. Setelah mereka tiba di tempat itu, tiba-tiba mereka bersikap lancang kepada Allah dengan meminta kepada Musa agar memperlihatkan Allah kepada mereka secara nyata. Kemudian mereka diguncang gempa bumi yang sangat dahsyat hingga mereka jatuh pingsan. Lalu Musa menundukkan diri kepada Rabbnya dan berkata, “Ya Rabbku! Sekiranya Engkau berkehendak membinasakan mereka dan membinasakan aku bersama mereka sebelum kedatangan mereka, niscaya Engkau telah membinasakan mereka. Apakah Engkau hendak membinasakan kami disebabkan perbuatan yang dilakukan orang-orang yang bodoh di antara kami? Apa yang dilakukan oleh kaumku yang menyembah patung anak sapi itu tidak lain hanyalah sebuah cobaan dan ujian yang Engkau jadikan sebagai sarana untuk menyesatkan orang-orang yang Engkau kehendaki dan memberikan petunjuk kepada orang-orang yang Engkau kehendaki. Engkau-lah yang mengendalikan urusan kami, maka ampunilah dosa-dosa kami. Dan limpahkanlah kepada kami rahmat-Mu yang sangat luas. Engkau adalah sebaik-baik pengampun dosa dan pemaaf kesalahan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "155. Allah memerintahkan Musa untuk mendatangi-Nya bersama Bani Israil setelah mereka bertaubat dari penyembahan kepada patung anak sapi; maka Musa memilih 70 orang dari mereka untuk pergi bersama mereka ke bukit Thursina sesuai dengan waktu yang telah ditetapkan Tuhannya. Akan tetapi mereka meminta agar dapat melihat Allah, sehingga mereka ditimpa gempa bumi hingga mereka binasa. Sehingga Musa berdoa kepada Allah: “Ya Tuhanku, sungguh aku berharap seandainya Engkau menghendaki kebinasaan mereka ketika mereka belum pergi bersamaku ke tempat ini dan Engkau binasakan aku binasa bersama mereka; sehingga aku tidak merasa bersalah terhadap Bani Israil yang lain, kerena mereka akan berkata, ‘Kamu telah pergi bersama orang-orang terpilih kami untuk membinasakan mereka’. Ya Tuhanku, aku berlindung kepada-Mu agar tidak membinasakan kami akibat dosa orang lain; jika di antara kami terdapat orang yang kurang akal yang tidak mentaati-Mu dan melanggar larangan-Mu, namun kami adalah orang—orang yang taat kepada-Mu. Adapun fitnah yang dilakukan orang-orang yang kurang akal itu adalah ujian dan cobaan bagi hamba-hamba-Mu, Engkaulah yang menguji mereka. Seluruh urusan ada di tangan-Mu, tidak ada yang mampu menghilangkan fitnah cobaan itu kecuali Engkau. Hanya Engkau yang mengatur seluruh urusan kami, maka ampunilah kesalahan yang kami lakukan, dan rahmatilah kami dengan rahmat-Mu yang meliputi segalanya. Engkaulah sebaik-baik pemberi ampun, sebab pemberi ampun selain Engkau hanya memberi ampun karena memiliki tujuan, seperti mengharap pujian atau mendapat manfaat; adapun ampunan-Mu tidak untuk mendapat balasan atau manfaat, namun karena karunia dan kemuliaan-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "155. وَاخْتَارَ مُوسَىٰ قَوْمَهُۥ (Dan Musa memilih kaumnya) Yakni beberapa orang dari kaumnya. لِّمِيقٰتِنَا ۖ (untuk (memohonkan taubat kepada Kami) pada waktu yang telah Kami tentukan) Yakni di waktu yang telah Kami tentukan. Setalah terjadi pada kaumnya kejadian penyembahan anak sapi, Allah memerintahkan Nabi Musa agar datang ke gunung Thur pada waktu yang telah Allah tentukan dengan membawa beberapa utusan dari Bani Israil untuk memohon ampun kepada Allah atas penyembahan anak sapi. الرَّجْفَةُ (gempa bumi) Yakni gempa yang dahsyat. Terdapat pendapat mengatakan bahwa mereka ditimpa gempa bumi sampai mati. قَالَ رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُم مِّن قَبْلُ وَإِيّٰىَ ۖ( Musa berkata: “Ya Tuhanku, kalau Engkau kehendaki, tentulah Engkau membinasakan mereka dan aku sebelum ini) Nabi Musa mengatakan ucapan ini sebagai bentuk kesedihan dan penyesalan. Yakni “jika Engkau menghendaki untuk membinasakan kami sungguh Engkau pasti akan membinasakan kami karena dosa-dosa kami sebelum kami mendatangi-Mu, kemudian Bani Israil berkata bahwa aku membuat tipu daya untuk membinasakan mereka”. أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَآءُ مِنَّآ ۖ( Apakah Engkau membinasakan kami karena perbuatan orang-orang yang kurang akal di antara kami?) Terdapat pendapat mengatakan yang dimaksud adalah Samiri dan pengikutnya. إِنْ هِىَ إِلَّا فِتْنَتُكَ(Itu hanyalah cobaan dari Engkau) Yakni persoalan Samiri dan peribadatan kepada anak sapi adalah cobaan dari-Mu. تُضِلُّ بِهَا مَن تَشَآءُ وَتَهْدِى مَن تَشَآءُ ۖ( Engkau sesatkan dengan cobaan itu siapa yang Engkau kehendaki dan Engkau beri petunjuk kepada siapa yang Engkau kehendaki) Dan di tangan-Mu petunjuk dan kesasatan, seandainya Engkau menghendaki niscaya Engkau akan memberi mereka petunjuk. أَنتَ وَلِيُّنَا(Engkaulah Yang memimpin kami) Kemudian Musa kembali memohon kasih sayang dan berdoa “Engkaulah penolong kami. Yakni Yang mengatur urusan-urusan kami. فَاغْفِرْ لَنَا(maka ampunilah kami) Atas perbuatan dosa yang telah kami lakukan. وَارْحَمْنَا ۖ (dan berilah kami rahmat) Dengan rahmat-Mu yang meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "155. Lalu Musa memilih 70 orang laki-laki dari kaumnya untuk menemaninya di waktu yang telah Kami janjikan untuknya dengan mengikut sertakan mereka dan supaya pendengaran mereka terhadap munajat Musa kepada Tuhannya itu menjadi bukti kebenarannya. Dan menurut pendapat lainnya yaitu bahwa Musa memilih mereka sebagai permohonan maaf karena menyembah berhala, lalu mereka meminta agar melihat Allah dengan jelas, kemudian mereka ditimpa guncangan yang keras sehinga mereka terjatuh. Dengan menyesal Musa berkata: “Wahai Tuhan, kalau Engkau berkehendak untuk membinasakan kami, niscaya Engkau sudah membinasakan kami karena dosa-dosa kami sebelum mendatangiMu di Miqat ini. Apakah Engkau akan membinasakan kami karena orang-orang yang teledor di antara kami. Tidak lain itu adalah ujianMu, yaitu ujian dan cobaan dariMu. Dengan itu, Engkau menyesatkan hamba-hambaMu yang Engkau kehendaki, dan memberi hidayah orang yang Engkau kehendaki. Engkaulah penolong kami dan wali dari urusan-urusan kami, maka ampunilah dosa-dosa kami dan kasihilah kami dengan rahmatMu yang amat luas. Engkaulah sebaik-baik pengampun dosa. Engkau mengampuni dosa untuk menguji keutamaan dan kemuliaan (manusia) bukan karena kemaslahatannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Musa memilih dari kaumnya} dari kaumnya {tujuh puluh orang pada waktu yang telah Kami tentukan. Ketika mereka ditimpa gempa bumi} goncangan yang sangat dahsyat {Musa berkata,“Ya Tuhanku, jika Engkau berkehendak, sungguh Engkau membinasakan mereka dan aku sebelum ini. Apakah Engkau akan membinasakan kami karena perbuatan orang-orang yang bodoh di antara kami. Itu tidak lain kecuali cobaan dariMu} ujian dan cobaan dariMu {Engkau menyesatkan dengan cobaan itu siapa saja yang Engkau kehendaki dan Engkau memberi petunjuk siapa saja yang Engkau kehendaki. Engkaulah Pelindung kami} Pengawas urusan-urusan kami {Maka ampunilah kami dan berilah kami rahmat. Engkaulah sebaik-baik pemberi ampun.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "155 Dan tatkala bani israil bertaubat serta kembali pada jalan mereka yang lurus ”Musa memilih” dari mereka “tujuh puluh orang” terbaik diantara mereka untuk memohon maaf kepada Allah bagi kaum mereka. Allah menjanjikan kepada mereka waktu dimana mereka bisa menghadirinya. Manakala mereka telah hadir, mereka berkata, ”wahai Musa tunjukanlah Allah kepada kami secara nyata” Mereka telah berkata sangat lancang kepada Allah, bersikap kurang ajar kepadaNYa, maka mereka pun digoncangkan gempa, sehingga mereka pingsan dan binasa, maka Musa tiada henti-hentinya bedo’a merendahkan diri kepada Allah dan berkata, ”ya Rabbku kalau Engkau kehendaki tentulah Engkau membinasakan mereka sebelum ini” yakni sebelum mereka hadir dan mereka dalam keadaan memohon maaf untuk kaum mereka, justru mereka sekarang menjadi orang-orang yang zhalim. ”apakah Engkau membinasakan kami karena perbuatan orang-orang yang kurang akal dianatara kami?” yakni orang orang berakal bodoh dan berpikiran pander. Musa merendahkan diri kepada Allah dan memohon pemakluman karena orang-orang yang berbuat kelancangan tidak memiliki akal yang sempurna yang menjaga mereka sehingga mereka tidak mengucapkan dan melakukan demikian, dan bahwa telah terjadi fitnah pada diri mereka yang terlintas pada diri seseorang dan dia khawatir agamanya akan lenyap. Maka dia berkata ”itu hanyaalah cobaan dariMu, engkau sesatkan dengan cobaan itu siapa yang engkau kehendaki dan engkau beri petunjuk kepada siapa orang yang engkau kehendaki. Engkaulah yang mempimpin kami, maka ampunilah kami dan berilah kami rahmat dan engkaulah pemberi ampun yang sebaik-baiknya.\" yakni engkau adalah sebaik-baik pemaaf, sebaik-baik yang menyayangi, dan semulia-mulia pemberi karunia. Seakan-akan Musa berkata 'wahai Rabb', yang dimaksud dengan tujuan pertama bagi kami semua adalah menaatiMu dan beriman kepadaMu dan bahwa orang yang berakal, mengerti dan memahaminya dengan sempurna sesuai dengan taufik yang telah engkau berikan, maka ia tetap bersikap lurus. Adapun orang yang lemah akalnya, pander pemikirannya, dan dibelokkan oleh fitnah, maka dialah yang melakukan pelanggaran itu, meskipun demikian Engkau adalah sebaik-baik penyayang dan sebaik-baik pengampun, maka ampunilah dan sayangilah kami, maka Allah mengabulkan permintaan Musa dan menghidupkan mereka setelah mati dan mengampuni dosa-dosa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 155: Saat Bani Israil telah bertobat dan kembali kepada petunjuk, maka Musa memilih 70 orang dari kaumnya yang tidak menyembah patung anak sapi. Ada yang berpendapat, bahwa mereka ditimpa gempa karena tidak menjauhi kaumnya ketika menyembah patung anak sapi. 70 orang ini bukanlah mereka yang meminta diperlihatkan Allah secara nyata yang kemudian disambar halilintar. Kata-kata ini menunjukkan bahwa orang yang berani kurang sopan kepada Allah adalah mereka yang kurang akal, dan kurang akal inilah yang menyebabkan manusia salah bertindak. Perbuatan mereka membuat patung anak sapi dan menyembahnya itu adalah suatu cobaan Allah untuk menguji mereka; siapa yang sebenarnya kuat imannya dan siapa yang masih ragu-ragu. Orang-orang yang lemah imannya itulah yang mengikuti Samiri dan menyembah patung anak sapi itu. Akan tetapi orang-orang yang kuat imannya, tetap dalam keimanannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 155",
    "description": "Dan nabi musa memilih tujuh puluh orang dari pemuka kaumnya yang terbaik untuk memohon tobat kepada kami di bukit sinai pada waktu yang telah kami tentukan. Sesampainya di tempat itu, mereka menyatakan tidak akan beriman kepada musa sampai dia memperlihatkan kepada mereka tuhan yang pernah berbicara kepadanya. Ketika itu mereka ditimpa gempa bumi yang dahsyat, sampai mati semuanya, dan nabi musa memohon kepada Allah sambil menengadahkan diri dan berkata, ya tuhan pemelihara-ku, apa yang akan aku katakan kepada bani israil ketika aku kembali kepada mereka' engkau telah membinasakan orang-orang yang terbaik dari mereka. Jika seandainya engkau kehendaki, tentulah engkau binasakan mereka, saat terjadi penyembahan anak sapi, karena kelalaian mereka tidak mencegah penyembahan anak sapi, dan juga engkau binasakan aku karena kelalaianku atau sebab lainnya sebelum ini, yaitu sebelum menghadap ke hadirat-Mu, seperti saat aku membunuh seorang koptik. Apakah engkau akan membinasakan kami karena perbuatan orang-orang yang kurang berakal di antara kami yang menyembah anak sapi itu' apa yang dilakukan oleh para penyembah patung anak sapi itu hanyalah cobaan dari-Mu, engkau sesatkan dengan cobaan itu siapa yang engkau kehendaki kesesatannya setelah nyata kehendak mereka untuk sesat dan engkau beri petunjuk kepada siapa yang engkau kehendaki berdasarkan kesiapan jiwa untuk menerima petunjuk. Engkaulah satu-satunya pemimpin dan pelindung kami, maka ampunilah segala dosa kami dan berilah kami rahmat. Engkaulah pemberi ampun yang terbaik karena engkau mengampuni bukan untuk mendapat pujian, atau menghindari kecaman. Perbuatan mereka membuat patung anak sapi dan menyembahnya itu adalah suatu cobaan dari Allah untuk menguji mereka, siapa yang sebenarnya kuat imannya dan siapa yang masih ragu-ragu. Orang yang lemah imannya itulah yang mengikuti samiri dan menyembah patung anak sapi itu. Tetapi orang yang kuat imannya, tetap dalam keimanannya. Nabi musa melanjutkan berdoa, dan tetapkanlah untuk kami kebaikan selama hidup di dunia ini dan kelak di akhirat. Sungguh, kami kembali, yakni bertobat kepada engkau dari segala dosa dan kekurangan, dengan sebenar-benarnya. Mendengar permohonan itu, Allah berfirman, siksaku, baik di dunia maupun di akhirat, akan aku timpakan kepada siapa yang aku kehendaki dari makhluk-ku, seperti yang aku lakukan terhadap kaummu, dan rahmat-ku, yakni anugerah-ku, meliputi segala sesuatu. Maka akan aku tetapkan rahmat-ku yang khusus dan berkesinambungan bagi orang-orang yang bertakwa, terutama yang menunaikan zakat dan orangorang yang selalu terus menerus beriman kepada ayat-ayat kami, yakni dengan membenarkannya melalui hati dan perbuatan."
  }
]