[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jadikanlah kami termasuk orang-orang yang telah Engkau tetapkan baginya amal-amal shalih di dunia dan di akhirat;sesungguhnya kami kembali untuk bertaubat kepaadMu.” Allah berfirman kepada Musa , ”siksaanKu akan Aku timpakan pada orang-orang yang aku kehendaki dari makhlukKu sebagaimana yang telah Aku timpakan pada orang-orang dari kaummu. Dan rahmatKu meliputi seluruh makhlukKu semuanya. Kemudian akan aku tetapkan rahmat itu bagi orang-orang yang takut kepada Allah dan takut dari siksaanNya, lalu mereka menunaikan kewajiban-kewajiban dariNya dan menjauhi perbuatan-perbuatan maksiat kepadaNYa, dan orang-orang yang mengimani dalil-dalil tauhid dan bukti-buktinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "156. Dan jadikanlah kami bagian dari orang-orang yang Engkau muliakan di dalam hidup ini dengan beragam nikmat, jauh dari marabahaya, dan gemar berbuat baik. Dan masukkanlah kami ke dalam golongan orang-orang saleh yang Engkau janjikan Surga di akhirat. Sesungguhnya kami telah bertobat kepada-Mu dan kembali ke jalan-Mu seraya mengakui kekeliruan kami.” Allah -Ta'ālā- berfirman, “Azab-Ku akan Aku timpakan kepada siapa saja yang Aku kehendaki di antara mereka yang berbuat kesesatan, sedangkan rahmat-Ku meliputi segala sesuatu yang ada di dunia. Tidak ada satu pun makhluk yang tidak menerima rahmat, karunia dan kebaikan Allah. Kemudian Aku akan menetapkan rahmat-Ku di Akhirat bagi orang-orang yang bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan mejauhi larangan-larangan-Nya. Dan bagi orang-orang yang membayarkan zakat atas harta kekayaan mereka kepada orang-orang yang berhak menerimanya. Dan juga bagi orang-orang yang beriman kepada ayat-ayat Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "156. Kemudian Musa menutup doanya ini dengan memohon: “Ya Tuhan kami, tetapkanlah kenikmatan, ketaatan, dan taufik bagi kami di dunia; dan tetapkanlah ampunan, rahmat, dan surga yang seluas langit dan bumi bagi kami di akhirat. Karena kami telah bertaubat dari kemaksiatan, maka tetapkanlah bagi kami kebaikan di dunia dan akhirat, dan janganlah Engkau halangi kami dari pemberian-Mu yang besar.” Maka Allah menanggapi doa ini: “Hai Musa, sesungguhnya azab-Ku yang kamu takutkan terhadap kaummu itu Aku timpakan kepada para pelaku kemaksiatan sesuai kehendak-Ku; maka kaummu yang telah bertaubat bukanlah tempat untuk menimpakan azab itu. ketetapan-Ku telah berlaku bahwa Aku akan membalas orang-orang yang berbuat keburukan sesuai amalan mereka, dan membalas orang-orang yang berbuat kebaikan dengan kebaikan. Dan rahmat-Ku meliputi seluruh semesta alam, sehingga tidak ada satu makhlukpun melainkan telah mendapatkan rahmat, karunia, dan kebaikan-Ku. Maka janganlah kamu bersedih terhadap kaummu atau makhluk-Ku yang lain yang layak mendapat rahmat-Ku. Aku akan menetapkan rahmat-Ku bagi orang-orang yang menjaga diri dari segala hal yang dapat mengundang kemurkaan-Ku dan membayar zakat yang diwajibkan atas mereka; dan Aku juga menetapkannya bagi orang-orang yang beriman kepada ayat-ayat Kami dengan keimanan yang ikhlas dan sempurna tanpa ada riya dan keraguan di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "156. وَاكْتُبْ لَنَا فِى هٰذِهِ الدُّنْيَا حَسَنَةً (Dan tetapkanlah untuk kami kebajikan di dunia ini) Dengan memberi kami taufik dalam menjalankan amal-amal shalih. Atau mengaruniakan kepada kami nikmat kesehatan dan kelapangan rezeki di dunia. وَفِى الْاٰخِرَةِ (dan di akhirat) Yakni dan tetapkanlah surga bagi kami di akhirat kelak. إِنَّا هُدْنَآ إِلَيْكَ ۚ (sesungguhnya kami kembali (bertaubat) kepada Engkau) Yakni kami bertaubat kepadamu dan berhenti dari kesesatan kami. قَالَ عَذَابِىٓ أُصِيبُ بِهِۦ مَنْ أَشَآءُ ۖ (Allah berfirman: “Siksa-Ku akan Kutimpakan kepada siapa yang Aku kehendaki) Yang dimaksud adalah gempa bumi atau termasuk didalamnya segala azab serta azab yang telah menimpa mereka. وَرَحْمَتِى وَسِعَتْ كُلَّ شَىْءٍ ۚ( dan rahmat-Ku meliputi segala sesuatu) Baik itu kepada golongan jin dan manusia maupun yang lainnya. Kemudian Allah mengabarkan bahwa Dia akan menetapkan rahmat yang luas ini bagi orang-orang yang menjauhi dosa-dosa dan menunaikan zakat yang diwajibkan atas mereka dan bagi orang-orang yang beriman kepada ayat-ayat-Nya. وَالَّذِينَ هُم بِـَٔايٰتِنَا يُؤْمِنُونَ(dan orang-orang yang beriman kepada ayat-ayat Kami) Yakni mempercayai ayat-ayat tersebut dan mentaatinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ ۚ } Ibnu Abbas berkata : ( قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ أَنَا أَهْلٌ أَنْ أُتَّقَى فَمَنْ اتَّقَانِي فَلَمْ يَجْعَلْ مَعِي إِلَهًا فَأَنَا أَهْلٌ أَنْ أَغْفِرَ لَ ) \"Aku adalah Dzat yang Patut ditakuti, barang siapa yang takut kepadaKu dan tidak membuat sesembahan bersamaku, maka Aku berhak untuk memberikan ampunan kepadanya\". 2 ). Suatu ketika di majlis Sammak bin Al-Fadhl seseorang berkata kepada yang lainnya : Apakah sesuatu yang paling agung ? kemudian mereka pun menjawab langit dan bumi -sedangkan Sammak amsih saja terdiam- kemudian mereka bertanya kepadanya : bagaimana menurut kamu wahai bapaknya al-Fadhl ? beliau pun menjawab : \"tidak ada yang lebih agung daripada rahmat-Nya! Allah berfirman : { وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ ۚ } \"dan rahmat-Ku meliputi segala sesuatu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "156. Dan tetapkanlah (catatlah) bagi kami di dunia ini suatu kebaikan, yaitu dengan kesehatan, kekayaan, dan amal shalih, dan berilah kami surga dan keridhaan di akhirat. Sesungguhnya kami bertaubat kepadaMu dan kembali dari godaan (dunia). Allah SWT berfirman kepada Musa AS: “Azabku menimpa orang yang yang Aku kehendaki, dan disini adalah gempa, sedangkan rahmatKu meliputi setiap sesuatu, yaitu orang yang diberi tanggung jawab maupun orang lain dan Aku telah mendahulukan kemarahanKu, maka di akhirat Aku akan menetapkan rahmatKu itu bagi orang-orang yang bertakwa kepada Allah dengan mengerjakan perintah, menjauhi larangan termasuk yang paling besar yaitu syirik dan dosa besar, menunaikan zakat yang diwajibkan bagi mereka untuk orang yang berhak menerimanya, dan orang-orang yang mempercayai ayat-ayat Kami, bukan yang mengingkarinya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tetapkanlah} wajibkanlah {untuk kami di dunia ini kebaikan} kenikmatan, kesehatan, dan bimbingan untuk beramal shalih {dan di akhirat} ampunan dan surga {Sesungguhnya kami kembali} bertaubat {kepada Engkau. Allah berfirman} Allah SWT {“SiksaKu akan Aku timpakan kepada siapa saja yang Aku kehendaki dan rahmatKu luas} meluas {pada segala sesuatu. Akan Aku menetapkan} mewajibkan {rahmatKu bagi orang-orang yang bertakwa dan menunaikan zakat serta bagi orang-orang yang beriman pada ayat-ayat Kami.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "156 Musa menyempurnakan doanya ”dan tetapkanlah untuk kami kebajikan di dunia ini” berupa ilmu yang bermanfaat, rizki yang lapang, dan amal yang shaleh “sesungguhnya kami kembali (bertaubat) kepadaMu” yakni kami kembali dengan mengakui kelalaian kami. Kami kembali kepadaMu dalam segala urusan kami. ”Allah berfirman ’siksaKu akan kutimpakkan kepada siapa yang aku kehendaki” dari kalangan orang yang sengsara yang menentang sebab-sebabnya. ”dan Rahmatku meliputi segala sesuatu” meliputi langit dan bumi, orang baik dan orang jahat, Mukmin dan kafir, tiada makhluk kecuali rahmat Allah telah dia rasakan, karunia dan kebaikanNya telah dia cicipi, akan tetapi rahmat yang khusus yang berkonsekuensi kepada kebahagiaan dunia dan akhirat tidak dirasakan oleh semua orang. Oleh karena itu Dia berfirman tentangnya “maka akan aku tetapkan Rahmatku untuk orang orang yang bertakwa” dari kemaksiatan besar dan kecil “yang menunaikan zakat” yang wajib ditunaikan kepada yang berhak “dan orang-orang yang beriman kepada ayat-ayat kami”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 156: Seperti ilmu yang bermanfaat, amal yang saleh dan rezeki yang banyak. Yaitu apa yang Allah sediakan untuk wali-wali-Nya yang saleh, berupa pahala. Dengan mengakui kekurangan kami. Yakni kepada mereka yang termasuk orang celaka, di mana mereka mengerjakan sebab-sebabnya. Di dunia, baik kepada orang mukmin maupun orang kafir, orang baik maupun orang jahat. Oleh karenanya, tidak ada satu pun makhluk kecuali rahmat Allah mengena kepadanya. Akan tetapi rahmat yang khusus yang menghendaki untuk bahagia di dunia dan di akhirat tidaklah diberikan kepada semua orang, bahkan untuk mereka yang bertakwa sebagaimana pada lanjutan ayat tersebut. Di akhirat. Termasuk sempurnanya beriman kepada ayat-ayat Allah adalah mengetahui kandungannya dan mengamalkannya. Demikian juga mengikuti Nabi Muhammad shallallahu 'alaihi wa sallam lahir maupun batin, dalam masalah pokok maupun cabang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 156",
    "description": "Nabi musa melanjutkan berdoa, dan tetapkanlah untuk kami kebaikan selama hidup di dunia ini dan kelak di akhirat. Sungguh, kami kembali, yakni bertobat kepada engkau dari segala dosa dan kekurangan, dengan sebenar-benarnya. Mendengar permohonan itu, Allah berfirman, siksaku, baik di dunia maupun di akhirat, akan aku timpakan kepada siapa yang aku kehendaki dari makhluk-ku, seperti yang aku lakukan terhadap kaummu, dan rahmat-ku, yakni anugerah-ku, meliputi segala sesuatu. Maka akan aku tetapkan rahmat-ku yang khusus dan berkesinambungan bagi orang-orang yang bertakwa, terutama yang menunaikan zakat dan orangorang yang selalu terus menerus beriman kepada ayat-ayat kami, yakni dengan membenarkannya melalui hati dan perbuatan. Yaitu orang-orang yang terus menerus dengan penuh ketekunan mengikuti rasul nabi Muhammad, nabi yang ummi, tidak pandai baca tulis, yang nama dan sifatnya mereka, para ulama yahudi dan nasrani, dapati tertulis di dalam taurat dan injil yang ada pada mereka hingga kini, walapun sebagian besar telah mereka hapus dan yang ada sekarang hanya secara tersirat. Di antara sifat nabi Muhammad yang terdapat dalam taurat dan injil adalah dia yang menyuruh mereka berbuat yang makruf, sesuatu yang dikenal menurut agama, logika dan adat istiadat sebagai kebaikan, dan mencegah dari yang mungkar, sesuatu yang tertolak menurut agama dan logika serta adat istiadat. Dan selain itu, di antara tujuan kedatangan nabi Muhammad adalah menghalalkan atas perintah Allah segala yang baik bagi mereka termasuk yang tadinya halal kemudian diharamkan sebagai sanksi atas mereka, seperti lemak (lihat: surah alan'a'm/6: 146). Dan mengharamkan, juga berdasar firman Allah segala yang buruk bagi mereka, seperti bangkai, darah, dan daging babi. Dan membebaskan beban-beban dan belenggu-belenggu yang tadinya ada pada mereka. Dalam syariat yang dibawa oleh nabi Muhammad itu tidak ada lagi beban yang berat yang dipikulkan kepada bani israil, seperti mensyariatkan membunuh diri untuk sahnya tobat, wajib kisas pada pembunuhan baik yang disengaja atau tidak, tanpa boleh membayar diyat (ganti rugi), memotong anggota badan yang melakukan kesalahan, membuang atau menggunting kain yang kena najis, dan sebagainya. Adapun orang-orang yang beriman kepadanya dengan mengakui kenabiannya, memuliakannya, dengan mencegah siapa pun yang bermaksud buruk terhadapnya, menolongnya, mendukungnya dalam penyebaran ajaran islam, dan mengikuti cahaya yang terang yang diturunkan kepadanya, berupa tuntunan Al-Qur'an, mereka itulah orang-orang beruntung."
  }
]