[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Rahmat ini akan Aku tetapkan bagi orang-orang yang takut kepada Allah dan menjauhi perbuatan-perbuatan maksiat kepadaNya, dan mengikuti seorang rasul, lagi nabi yang ummi, yang tidak dapat membaca dan menulis yaitu Muhammad yang mereka jumpai sifat dan beritanya tertulis pada mereka di dalam taurat dan injil, yang memerintahkan mereka untuk bertauhid, taat, serta semua perkara lainnya yang diketahui kebaikannya, dan melarang mereka berbuat syirik, maksiat, dan seluruh perkara yang dimaklumi keburukannya, menghalalkan bagi mereka barang-barang yang baik-baik dari berbagai jenis makanan, minuman, dan hubungan pernikahan, dan mengharamkan atas mereka hal-hal yang keji seperti daging babi, dan semua yang mereka halalkan dari berbagai jenis makanan dan minuman yang diharamkan oleh Allah, dan menghapuskan dari mereka beban yang dipikulkan pada mereka berupa perintah-perintah yang berat, seperti memotong bagian yang terkena najis pada pakaian, dibakarnya harta-harta rampasan perang, dan penjatuhan hukum qishash secara wajib terhadap pelaku pembunuhan, baik pembunuhan yang disengaja ataupun terjadi karena kekeliruan. maka orang-orang yang beriman kepada nabi yang ummi, Muhammad , mengakui kenabiaannya, menghormati dan mengagungkannya, serta membelanya dan mengikuti al-qur’an yang diturunkan padanya dan mengerjakan sunnahnya, mereka itulah orang-orang yang beruntung memperoleh apa yang di janjikan oleh Allah kepada hamba-hambaNya yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "157. Yaitu orang-orang yang menjadi pengikut Muhammad -ṣallallāhu 'alaihi wa sallam-. Dia adalah seorang nabi yang buta huruf, tidak bisa membaca dan menulis. Dia hanya menerima wahyu dari Rabbnya. Ialah sosok nabi yang namanya, sifat-sifatnya, dan apa yang diturunkan kepadanya mereka dapati tertulis di dalam kitab suci Taurat yang diturunkan kepada Musa -‘Alaihissalām- dan kitab suci Injil yang diturunkan kepada Isa -‘Alaihissalām-. Ia menyuruh mereka melakukan sesuatu yang diketahui sebagai sebuah kebaikan dan keselamatan, melarang mereka melakukan sesuatu yang diketahui sebagai suatu keburukan menurut akal yang sehat dan fitrah yang normal, menghalalkan makanan, minuman, dan pernikahan yang dianggap lezat sepanjang tidak berbahaya, mengharamkan menghalalkan makanan, minuman, dan pernikahan yang dianggap menjijikkan, dan menanggalkan beban berat yang semula mereka pikul, seperti keharusan memotong bagian yang terkena najis dan keharusan menghukum mati pelaku pembunuhan baik secara sengaja maupun tidak. Orang-orang Bani Israil maupun lainnya yang percaya kepadanya, mengagungkannya, menghormatinya, membelanya dari serangan orang-orang kafir yang memusuhinya, dan mengikuti ajaran Al-Qur`ān yang diturunkan kepadanya layaknya cahaya yang memberi jalan, mereka itulah orang-orang beruntung yang akan mendapatkan apa yang mereka inginkan dan dijauhkan dari apa yang mereka takutkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "157. kemudian Allah menambahkan sifat lain bagi orang yang layak mendapat rahmat dan keridhaan-Nya; yaitu orang-orang yang mengikuti Rasulullah yang ‘ummi’ secara lahir batin, baik itu dalam pokok-pokok agama maupun cabang-cabangnya. Allah telah menyebutkan sifat-sifat mulia Rasul-Nya yang dapat mendorong orang yang berakal untuk mengikuti dan mengimaninya. Dia adalah Rasulullah yang diutus bagi seluruh manusia sebagai pemberi kabar gembira dan peringatan; seorang nabi yang diberi wahyu berupa syariat yang menyeluruh, sempurna, dan kekal hingga hari kiamat; dan seorang yang ‘ummi’ yang tidak dapat baca tulis dan tidak pernah mengambil ilmu dari orang lain, namun Allah mewahyukan kepadanya dengan perantara malaikat Jibril. Dan sifatnya juga, para Ahli kitab mendapati nama dan ciri-cirinya tertulis dalam kitab Taurat dan Injil mereka; memerintahkan untuk berbuat kebaikan berupa keimanan, amal shalaih, dan akhlak mulia yang didatangkan oleh syariat yang benar; dan melarang perbuatan munkar berupa kekafiran, kemaksiatan, dan akhlak tercela. Dan termasuk sifat-sifatnya, menghalalkan bagi mereka apa yang dahulu diharamkan Allah -seperti memakan lemak dan lain sebagainya- sebagai balasan atas kezaliman dan kefasikan mereka; menghalalkan apa yang telah mereka haramkan sendiri atas diri mereka tanpa mendapat perintah dari Allah -seperti daging dan susu unta-; serta mengharamkan atas mereka segala makanan buruk yang mereka halalkan seperti, darah, bangkai, daging babi, harta riba, dan mengambil harta orang lain dengan cara yang batil. Kemudian Allah menutup penyebutan sifat Rasulullah itu bahwa dia datang dengan membawa agama yang mudah tanpa ada kesukaran, kesulitan, dan beban berat; namun dia diutus dengan syariat yang lurus dan mudah. Karena pada syariat umat-umat terdahulu sangat berat, maka Allah memudahkan syariat bagi umat ini. Maka wajib bagi Bani Israil dan lainnya untuk mengikuti orang yang memiliki sifat-sifat tersebut. Oleh sebab itu, Allah menutup ayat ini dengan penjelasan bahwa orang-orang yang beriman kepada nabi dan rasul yang ‘ummi’ ini, serta mengagungkan, membela, menolong dakwahnya, dan mengikuti kitab yang diturunkan kepadanya -yaitu al-Qur’an yang dapat menerangi manusia dari gelapnya keraguan dan kebodohan-, maka mereka adalah orang-orang yang mendapat kebaikan dunia dan akhirat dan selamat dari keburukannya, karena mereka telah mendatangkan sebab-sebab keberuntungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "157. الَّذِينَ يَتَّبِعُونَ الرَّسُولَ النَّبِىَّ الْأُمِّىَّ ((Yaitu) orang-orang yang mengikut Rasul, Nabi yang ummi) Dia adalah Nabi Muhammad. Makna (الأمي) yakni orang yang bukan dari golongan Ahli kitab. Pendapat lain mengatakan yakni orang yang tidak dapat menulis dan membaca tulisan. الَّذِى يَجِدُونَهُۥ (yang (namanya) mereka dapati) Yakni orang-orang Yahudi dan Nasrani mendapati sifat-sifatnya. مَكْتُوبًا عِندَهُمْ فِى التَّوْرَىٰةِ وَالْإِنجِيلِ (tertulis di dalam Taurat dan Injil yang ada di sisi mereka) Dan dua kitab ini adalah referensi mereka dalam agama. Atha’ bin Yasar berkata: aku bertemu Abdullah bin ‘Amr bin ‘Ash kemudian aku berkata padanya: “beritahulah aku sifat Rasulullah”. Ia menjawab: “Baiklah, demi Allah sungguh sifat beliau disebutkan dalam Taurat dengan sebagian sifatnya yang disebutkan dalam al-Qur’an: “wahai Nabi, Kami telah mengutusmu sebagai saksi, pemberi peringatan dan kabar gembira, dan penjaga orang-orang ummy, engkau adalah hamba dan Rasul-Ku, Aku menyebutmu orang yang bertawakkal, engkau bukan orang yang keras lagi kasar, bukan pula pembuat gaduh di pasar-pasar, engkau tidak membalas kejahatan dengan kejahatan tapi memaafkan dan mengampuni. Allah tidak akan mencabut nyawanya sampai dia meluruskan agama yang telah bengkok dengan menjadikan manusia mengatakan Laa ilaaha illa Allah, ia membuka dengan kalimat itu mata yang buta, telinga yang tuli dan hati yang tertutup”. يَأْمُرُهُم بِالْمَعْرُوفِ(yang menyuruh mereka mengerjakan yang ma’ruf) Yakni segala yang diketahui oleh hati dan tidak diingkarinya, yakni akhlak-akhlak yang mulia. وَيَنْهَىٰهُمْ عَنِ الْمُنكَرِ(dan melarang mereka dari mengerjakan yang mungkar) Yakni apa yang diingkari hati berupa akhlak-akhlak tercela, dan perbuatan dan perkataan yang buruk. وَيُحِلُّ لَهُمُ الطَّيِّبٰتِ (dan menghalalkan bagi mereka segala yang baik) Yakni segala yang nikmat terutama apa yang telah diharamkan untuk bani Israil karena dosa-dosa mereka. وَيُحَرِّمُ عَلَيْهِمُ الْخَبٰٓئِثَ (dan mengharamkan bagi mereka segala yang buruk) Yakni segala yang najis dan buruk hakikatnya, kerena mengandung bahaya dan mudharat, seperti serangga dan babi. وَيَضَعُ عَنْهُمْ إِصْرَهُمْ(dan membuang dari mereka beban-beban) Yakni beban-beban berat. وَالْأَغْلٰلَ الَّتِى كَانَتْ عَلَيْهِمْ ۚ( dan belenggu-belenggu yang ada pada mereka) Yakni beban-beban berat yang dahulu mereka pikul yang tidak memiliki manfaat bagi mereka, namun mereka pikul sebagai hukuman bagi mereka atas perbuatan-perbuatan buruk mereka. فَالَّذِينَ ءَامَنُوا۟ (Maka orang-orang yang beriman) Yakni dari kalian hai Bani Israil dan yang lainnya. بِهِۦ (kepadanya) Kepada Muhammad. وَعَزَّرُوهُ(memuliakannya) Yakni memuliakan dan menghormatinya. وَنَصَرُوهُ (menolongnya) Yakni memberinya pertolongan dari orang yang menyakitinya. وَاتَّبَعُوا۟ النُّورَ الَّذِىٓ أُنزِلَ مَعَهُۥٓ ۙ (dan mengikuti cahaya yang terang yang diturunkan kepadanya) Yakni mengikuti al-Qur’an yang diturunkan kepadanya serta mengikuti sunnahnya dengan mengamalkan perintahnya dan menjauhi larangannya. Sifat-sifat ini pertama-tama terdapat pada para sahabat Rasulullah yang beriman dan berjihad bersamanya, yang menolong dan melindunginya, serta mengerahkan seluruh kemampuan diri mereka di jalan dakwahnya; kemudian terdapat pada para tabi’in, pengikut-pengikut mereka yang setia; kemudian pada setiap orang yang menapaki jalan hidup mereka. Dan orang-orang Bani Israil yang beriman kepada Rasulullah dan menolongnya juga termasuk dalam kabar gemira ini. أُو۟لٰٓئِكَ هُمُ الْمُفْلِحُونَ(mereka itulah orang-orang yang beruntung) Yakni yang memperoleh kebaikan dan kemengan, dan bukan umat-umat yang lain. Dan ketika itu Allah menetapkan rahmat bagi umat Islam. Ibnu Abbas berkata: Nabi Musa meminta Tuhannya suatu permintaan, namun Allah memberikannya kepada Nabi Muhammad dalam firman-Nya: فسأكتبها للذين يتقون (Aku akan menetapkannya bagi orang-orang yang bertakwa). Maka Allah memberikan Nabi Muhammad segala yang diminta oleh Nabi Musa dalam ayat ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) .Seorang mutadabbir berkata menanggapi ayat ini { وَيُحَرِّمُ عَلَيْهِمُ الْخَبَائِثَ } , suatu ketika aku melihat seorang perokok ketika hendak masuk ke dalam masjid, ia memasukkan kotak rokoknya ke dalam sepatunya, lalu apa maksud dari tingkahnya ini? Keburukan telah ditolak oleh fitrah yang baik 2 ). { وَيَضَعُ عَنْهُمْ إِصْرَهُمْ وَالْأَغْلَالَ الَّتِي كَانَتْ عَلَيْهِمْ } \"dan membuang dari mereka beban-beban dan belenggu-belenggu yang ada pada mereka\" 'Aisyah] berkata, \"Pada suatu hari aku penah melihat Rasulullah shallallahu 'alaihi wasallam berdiri di pintu rumahku sedangkan budak-budak Habasyah sedang bermain di dalam Masjid. Rasulullah shallallahu 'alaihi wasallam menutupiku dengan kain selendangnya saat aku menyaksikan permainan mereka, beliau berkata ketika itu : (( لَتَعْلَمُ يَهُودُ أَنَّ فِي دِينِنَا فُسْحَةً إِنِّي أُرْسِلْتُ بِحَنِيفِيَّةٍ سَمْحَةٍ )) \"Agar orang Yahudi mengetahui bahwa dalam agama kami itu ada kelonggaran. Sesungguhnya saya diutus dengan lurus (hanif) dan toleransi.” (Dinyatakan Shahih oleh Al-Albany dalam Shahih Al-Jami, no. 33219)\" 3 ). Tadabbur Qur'an dan ittiba' kepadanya adalah pembeda antara ummat islam terdahuu dan sekarang dan sesungguhnya perbedaan itu sangat jelas, tanpa tadabbur kita telah kehilangan ilmu, dan tanpa ittiba' kita telah kehilangan kesempatan amalan yang benar, dan sesungguhnya kita tidak mampu bangkit dari ketergeinciran ini kecuali dengan kembali kepada al-Qur'an dan iitiba' kepadanya, dan kita tidak akan pernah menang kecuali dengannya pula : { فَالَّذِينَ آمَنُوا بِهِ وَعَزَّرُوهُ وَنَصَرُوهُ وَاتَّبَعُوا النُّورَ الَّذِي أُنْزِلَ مَعَهُ ۙ أُولَٰئِكَ هُمُ الْمُفْلِحُونَ } \"Maka orang-orang yang beriman kepadanya. memuliakannya, menolongnya dan mengikuti cahaya yang terang yang diturunkan kepadanya (Al Quran), mereka itulah orang-orang yang beruntung\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "157. (Yaitu) orang-orang yang mengikuti rasulullah, Muhammad SAW, seorang Nabi yang tidak bisa membaca dan menulis, bukan termasuk ahli kitab, yang namanya, gambarannya, dan sifatnya diketahui oleh orang Yahudi dan Nasrani melalui catatan dalam kitab Taurat dan Injil mereka, yang menyuruh melakukan sesuatu yang dibenarkan oleh syariat dan akal sehat berupa iman kepada Allah dan akhlak mulia, yang melarang kekufuran, kesyirikan dan sesuatu yang tidak dibenarkan syariat dan akal sehat, berupa akhlak buruk, yang menghalalkan bagi mereka kenikmatan, yaitu makanan yang bisa diterima baik oleh jiwa dan akal sehat, yang mengharamkan bagi mereka sesuatu yang buruk dan dibenci akal sehat seperti bangkai, darah yang mengalir, babi, dan binatang sembelihan selain nama Allah, dan yang mengambil dari mereka beban yang memberatkan manusia, sesuatu yang merusak jiwa, dan beban-beban yang sulit lagi berat, seperti bunuh diri untuk bertaubat dan memotong bagian yang terkena najis. Maka orang-orang yang beriman kepada nabi Muhammad SAW, mengagungkannya, menghormatinya, melindunginya dari musuh, menolongnya dari orang yang memusuhinya, dan mengikuti Al-Qur’an yang diwahyukan kepadanya, maka mereka itulah orang-orang yang menang di dunia dan akhirat dengan mendapat hidayah, istiqamah, surga dan keridhaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mengikuti Rasulullah, nabi yang ummi} yang tidak membaca dan menulis {yang mereka temukan} mereka mendapati sifat, nama dan kenabiannya {tertulis di dalam Taurat dan Injil yang ada pada mereka. Dia menyuruh mereka pada kebaikan, mencegah kemungkaran, menghalalkan hal-hal yang baik bagi mereka, mengharamkan atas mereka keburukan} hal-hal yang buruk {dan membebaskan} menghilangkan {dari mereka beban-beban mereka} beban mereka {serta belenggu-belenggu} kesulitan dalam menanggung beban {yang ada pada mereka. Adapun orang-orang yang beriman kepadanya, memuliakannya} mengagungkan dan memuliakannya {menolongnya, dan mengikuti cahaya} Al-Qur’an {yang diturunkan bersamanya, mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "157. diantara kesempurnaan iman kepada ayat-ayat Allah adalah mengetahui maknanya dan menjalankan konsekuensinya termasuk dalam hal ini adalah mengikuti nabi lahir dan batin dalam perkara agama, baik yang ushul (pokok) maupun yang furu (cabang). ”yaitu orang orang yang mengikuti rasul nabi yang umii” dikatakan ummi agar nabi-nabi yang lain tidak termasuk didalamnya, karena yang dimaksud disini adalah Muhammad bin Abdullah bin abdul muthalib, sementara konteks ayatnya adalah tentang bani israil, bahwa iman kepada Nabi Muhammad adalah syarat atas mereka untuk masuk kedalam iman, bahwa orang-orang yang beriman kepadanya yang mengikutinya adalah orang-orang yang mendapatkan rahmat yang mutlak yang telah Allah tulis untuk mereka. Allah mensifatinya dengan ummi karena dia dari bangsa arab umat yang ummi, tidak bias membaca dan menulis, mereka tidak memiliki kitab sebelum al-quran. ”yang (namanya) mereka dapati tertulis di dalam taurat dan injil yang ada di sisi mereka” dengan nama dan sifatnya dimana yang paling mulia dan paling agung adalah apa yang dia dakwahkan dan apa yang dia larang. ”yang menyuruh mereka mengerjakan yang ma’ruf” yaitu semua yang diketahui kebaikannya, kebagusannya, dan manfaatnya. ”dan melarang mereka dari mengerjakan yang mungkar” yaitu semua yang dikenal buruknya menurut akal dan fitrah. Dia memerintahkan mereka untuk shalat, zakat, puasa, haji, dan siltarurahim, berbakti kepada kedua orang tua, berbuat baik kepada tetangga dan hamba sahaya, memberikan manfaat kepada seluruh makhluk, kejujuran, kesucian diri, kebaikan, nasihat, dan lain-lain, Dia melarang syirik kepada Allah, membunuh tanpa alasan yang benar,zina, minum khamar, kezhaliman kepada makhluk lain, dusta, dosa, dan lain-lain. Bukti paling agung bahwa dia adalah Rasul Allah apa yang dia dakwahkan dan dia perintahkan dan apa yang dia larang, apa yang dia halalkan dan apa yang dia haramkan. Dia menghalalkan yang baik-baik dari makanan, minuman, dan pernikahan, ”dan mengharamkan bagi mereka segala yang buruk,” dari makanan, minuman, pernikahan, ucapan dan perbuatan, ”dan membuang dari mereka beban-beban dan belenggu-belenggu yang ada pada mereka” yakni diantara sifatnya adalah bahwa agamanya mudah, ringan, tidak sulit, tidak ada beban, tidak ada belenggu, tidak ada kesulitan, dan tidak ada pembebanan syariat yang berat. “maka orang-orang beriman kepadanya, memuliakannya” yakni mengagungkannya dan menghormatinya ”menolongnya dan megikuti cahaya yang terang yang diturunkan kepadanya” yaitu al-qur’an yang menerangi di kegelapan keraguan dan kebodohan, dijadikan pegangan pada saat terjadi pertentangan pendapat. ”mereka itulah orang-orang yang beruntung” yang meraih kebaikan di dunia dan akhirat, yang selamat dari keburukan dunia dan akhirat karena mereka melakukan sebab keberuntungan terbesar. Adapun orang yang tidak beriman kepada nabi ummi ini, tidak memuliakannya, tidak menolongnya, dan tidak mengikuti cahaya yang dibawanya, maka dia adalah orang-orang yang merugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 157: Siyaq (susunan) ayat ini membicarakan hal ihwal Bani Israil, namun disebutkan di sana Nabi Muhammad shallallahu 'alaihi wa sallam, karena beriman kepada Beliau merupakan syarat masuknya mereka ke dalam golongan orang-orang yang beriman, dan bahwa orang-orang yang beriman kepada Beliau lagi mengikutinya adalah orang-orang yang akan memperoleh rahmat yang mutlak (di dunia dan akhirat). Ma’ruf adalah perbuatan baik, atau perkara yang dikenal baik, cocok dan bermanfaat. Contohnya tauhid, shalat, zakat, puasa, haji, silaturrahim, berbakti kepada kedua orang tua, berbuat baik kepada terangga dan budak yang dimiliki, memberi manfaat kepada semua orang, berkata jujur, menjaga diri (iffah), memberi nasehat, dsb. Munkar adalah perbuatan buruk, atau perkara yang dikenal buruknya menurut akal dan fitrah. Contohnya syirk, membunuh jiwa tanpa alasan yang benar, berzina, meminum yang memabukkan, berbuat zalim kepada yang lain, dusta, berbuat jahat, dsb. Seperti makanan, minuman dan menikah, atau menghalalkan yang sebelumnya diharamkan dalam syari’at mereka. Dalil/bukti besar yang menunjukkan bahwa Beliau adalah utusan Allah adalah dengan melihat apa yang Beliau serukan dan perintahkan, dan apa yang Beliau larang, serta apa yang Beliau halalkan dan apa yang Beliau haramkan. Seperti bangkai dsb. Maksudnya dalam syari'at yang dibawa oleh Nabi Muhammad shallallahu 'alaihi wa sallam tidak ada lagi beban-beban berat seperti yang dipikulkan kepada Bani Israil. Misalnya syari'at membunuh diri dalam bertobat, mewajibkan qisas pada pembunuhan baik yang disengaja atau tidak tanpa membolehkan membayar diat, membuang atau menggunting kain yang terkena najis dsb. Ayat ini menunjukkan bahwa syari’at yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam adalah syari’at yang mudah dan ringan. Al Qur’an merupakan cahaya yang digunakan untuk menyinari kegelapan keraguan dan kebodohan. Sebaliknya, orang yang tidak beriman kepada Nabi yang ummi tersebut (Nabi Muhammad shallallahu 'alaihi wa sallam), tidak memuliakannya, tidak menolongnya dan tidak mengikuti cahaya yang diturunkan kepadanya (Al Qur’an), maka mereka itulah orang-orang yang rugi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 157",
    "description": "Yaitu orang-orang yang terus menerus dengan penuh ketekunan mengikuti rasul nabi Muhammad, nabi yang ummi, tidak pandai baca tulis, yang nama dan sifatnya mereka, para ulama yahudi dan nasrani, dapati tertulis di dalam taurat dan injil yang ada pada mereka hingga kini, walapun sebagian besar telah mereka hapus dan yang ada sekarang hanya secara tersirat. Di antara sifat nabi Muhammad yang terdapat dalam taurat dan injil adalah dia yang menyuruh mereka berbuat yang makruf, sesuatu yang dikenal menurut agama, logika dan adat istiadat sebagai kebaikan, dan mencegah dari yang mungkar, sesuatu yang tertolak menurut agama dan logika serta adat istiadat. Dan selain itu, di antara tujuan kedatangan nabi Muhammad adalah menghalalkan atas perintah Allah segala yang baik bagi mereka termasuk yang tadinya halal kemudian diharamkan sebagai sanksi atas mereka, seperti lemak (lihat: surah alan'a'm/6: 146). Dan mengharamkan, juga berdasar firman Allah segala yang buruk bagi mereka, seperti bangkai, darah, dan daging babi. Dan membebaskan beban-beban dan belenggu-belenggu yang tadinya ada pada mereka. Dalam syariat yang dibawa oleh nabi Muhammad itu tidak ada lagi beban yang berat yang dipikulkan kepada bani israil, seperti mensyariatkan membunuh diri untuk sahnya tobat, wajib kisas pada pembunuhan baik yang disengaja atau tidak, tanpa boleh membayar diyat (ganti rugi), memotong anggota badan yang melakukan kesalahan, membuang atau menggunting kain yang kena najis, dan sebagainya. Adapun orang-orang yang beriman kepadanya dengan mengakui kenabiannya, memuliakannya, dengan mencegah siapa pun yang bermaksud buruk terhadapnya, menolongnya, mendukungnya dalam penyebaran ajaran islam, dan mengikuti cahaya yang terang yang diturunkan kepadanya, berupa tuntunan Al-Qur'an, mereka itulah orang-orang beruntung. Allah memperkenalkan nabi terakhir yang tercantum dalam kitab mereka dan kemuliaan para pengikutnya. Katakanlah wahai nabi Muhammad, wahai seluruh manusia tanpa kecuali! sesungguhnya aku ini utusan Allah bagi kamu semua, dan juga kepada makhluk jin, baik yang semasa denganku maupun tidak, tanpa terkecuali. Allah yang mengutus aku itu adalah yang memiliki kerajaan langit dan bumi; tidak ada tuhan yang berhak disembah selain dia. Semuanya tunduk hanya kepada-Nya. Dia yang mahakuasa untuk menghidupkan dan mematikan, oleh karena itu maka berimanlah kamu kepada Allah yang maha esa dan mahakuasa itu, dan rasul-Nya yang terakhir, yaitu nabi yang ummi, yang tidak pandai membaca dan menulis, namun mendapat informasi yang pasti berupa wahyu dari Allah, yang beriman kepada Allah dan kepada kalimat-kalimat-Nya yaitu kitab-kitab-Nya. Ikutilah dia dalam sistem dan cara hidupnya, dan laksanakan apa yang yang diajarkannya, agar kamu mendapat petunjuk kepada jalan yang lurus."
  }
]