[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada manusia semuanya, ”sesungguhnya aku adalah utusan Allah kepada kalian semua, bukan kepada sebagian kalian saja tanpa diutus kepada sebagian yang lain, Tuhan yang memiliki kerajaan langit dan bumi dan semua yang ada di dalamnya, tidak sepatutnya penuhanan dan ibadah kecuali bagiNya saja, yang Mahatinggi sanjunganNya, yang Maha kuasa menciptakan makhluk, dan menghancurkannya, serta membangkitkannya. maka berimanlah kepada Allah dan akuilah keesaanNya, dan berimanlah kepada rasulNya Muhammad nabi yang ummi yang beriman kepada Allah dan wahyu yang diturunkan kepadanya dari tuhannya dan wahyu yang diturunkan kepada nabi-nabi sebelumnya. Dan ikutilah rasul itu dan komitmenlah untuk mengamalkan apa yang diperintahkannya kepada kalian berupa amal ketaatan, mudah-mudahan kalian memperoleh taufik menuju jalan yang lurus.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "158. Katakanlah -wahai Rasul-, “Wahai manusia! Sesungguhnya aku adalah utusan Allah yang diutus kepada kalian semua, baik bangsa Arab maupun 'Ajam (non-Arab). (Allah adalah satu-satunya Rabb) yang memiliki kerajaan langit dan bumi. Tidak ada tuhan yang berhak disembah selain Dia -Subḥānahu-. Dia lah yang menghidupkan makhluk-makhluk yang mati dan mematikan makhluk-makhluk yang hidup. Maka berimanlah kalian -wahai manusia- kepada Allah. Dan berimanlah kalian kepada Muhammad -ṣallallāhu 'alaihi wa sallam-, seorang Nabi yang tidak bisa membaca dan menulis. Dia datang dengan membawa wahyu yang diwahyukan oleh Rabb kepadanya. Ia beriman kepada Allah dan beriman kepada kitab suci yang diturunkan kepadanya serta kitab suci yang diturunkan kepada nabi-nabi sebelumnya tanpa membedakan satu sama lain. Ikutilah ajaran yang dibawanya dari Rabbnya agar kalian mendapatkan keuntungan di dunia dan di Akhirat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "158. Kemudian Allah memerintahkan rasul-Nya untuk menjelaskan bahwa dia diutus kepada seluruh manusia. Lalu Allah menyifati Dzat-Nya dengan sifat yang menggambarkan kekuasaan dan keesaan-Nya: Dia yang memiliki kerajaan langit dan bumi, Dia mengatur keduanya dengan hikmah kauniyah dan syar’iyah-Nya. Tidak ada Tuhan yang berhak disembah selain Dia, dan cara penyembahan kepada-Nya hanya dapat diketahui melalui para rasul-Nya. Dan bagian yang diatur oleh Allah adalah dalam menghidupkan dan mematikan yang hanya Dia yang melakukannya. Setelah Allah menyebutkan sifat-sifat agung-Nya, Dia kemudian menyeru agar beriman kepada kepada-Nya Semata dan kepada Rasul-Nya, Muhammad, yaitu Nabi yang ‘ummi’ yang beriman kepada Allah dan kepada kitab yang diturunkan kepadanya dan kepada para rasul sebelumnya. Kemudian Allah memerintahkan orang-orang beriman untuk mengikuti jalan Rasulullah dan meneladaninya dalam setiap perintah dan larangannya, agar mereka mendapat petunjuk menuju jalan yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "158. قُلْ يٰٓأَيُّهَا النَّاسُ إِنِّى رَسُولُ اللهِ إِلَيْكُمْ جَمِيعًا (Katakanlah: “Hai manusia sesungguhnya aku adalah utusan Allah kepadamu semua) Allah memerintahkan Nabi Muhammad untuk mengatakan perkataan ini yang menunjukkan keumuman risalahnya bagi seluruh umat manusia, bukan seperti rasul-rasul yang lain yang diutus hanya kepada kaumnya. لَآ إِلٰهَ إِلَّا هُوَ (tidak ada Tuhan (yang berhak disembah) selain Dia) Karena barangsiapa yang memiliki langit, bumi, dan segala yang ada didalamnya maka ia adalah Tuhan yang sesungguhnya; begitu juga Yang Maha menghidupkan dan mematikan adalah satu-satunya yang berhak memiliki sifat ketuhanan dan dijauhkan dari sekutu-sekutu selain-Nya. الَّذِى يُؤْمِنُ بِاللهِ وَكَلِمٰتِهِۦ (yang beriman kepada Allah dan kepada kalimat-kalimat-Nya) Yakni kalimat-kalimat-Nya yang diturunkan Allah kepadanya dan kepada seluruh nabi sebelumnya. وَاتَّبِعُوهُ لَعَلَّكُمْ تَهْتَدُونَ (dan ikutilah dia, supaya kamu mendapat petunjuk) Karena petunjuk dalam agama adalah dengan mengikutinya, baik itu bagi Bani Israil maupun bagi umat dan bangsa lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "158. Katakanlah wahai Rasulullah: “Wahai manusia, Sesungguhnya aku adalah utusan Allah yang diutus untuk seluruh penduduk bumi, maka risalahku itu bagi seluruh manusia secara umum. Rasul yang diutus Allah yang mengatur langit dan bumi sesuai kehendakNya, dan menguasai keduanya sepenuhnya, tiada tuhan selain Dia, Dzat yang menghidupkan dan meniadakan makhluk. Dialah yang layak menjadi Tuhan, tiada sekutu bagiNya, maka berimanlah kepada Allah dan apa yang terkandung dalam kitab-kitabNya, yaitu Taurat, Injil, dan Al-Qur’an berupa hukum-hukum, tuntunan, serta ikutilah apa yang ada di dalamnya, supaya kalian mendapat petunjuk dan bimbingan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Wahai manusia, sesungguhnya aku ini utusan Allah bagi kalian semua, Dzat yang memiliki kerajaan langit dan bumi, tidak ada tuhan selain Dia, Dzat Yang menghidupkan dan mematikan. Maka berimanlah kepada Allah dan RasulNya, nabi ummi yang beriman kepada Allah dan kalimat-kalimatNya} kitab-kitabNya {Ikutilah dia agar kalian mendapat petunjuk.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "158. manakala ahli taurat dari bani israil diajak untuk mengikuti nabi Muhammad dan mungkin ada yang mengira bahwa ajakan tersebut hanya terbatas kepada mereka, maka dihadirkan lafazh yang menunjukan keumuman maka Allah berfirman ”katakanlah hai manusia sesungguhnya aku adalah utusan Allah kepadamu semua” yakni bangsa arab dan yang non arab ahli kitab dan bukan ahli kitab. ”yaitu Allah mempunyai kerajaan langit dan bumi” Dia bertindak pada keduanya dengan hukum-hukumNya yang kauniyah, peraturan-peraturan kekuasaanNya dan hukum syar’iyah diniyah yang diantaranya bahwa dia mengutus kepadamu seorang Rasul yang agung yang mengajakmu kepada Allah dan kepada rumah kemuliaanNya (surge) dan memperingatkanmu dari setiap perkara yang menjauhkanmu dariNya dan dari rumah kemuliaanNya “tidak ada tuhan (yang berhak di sembah) selain Dia” yakni tidak ada yang berhak disembah kecuali Allah semata, tidak ada sekutu bagiNya dan cara beribadah kepadaNYa tidak diketahui kecuali dengan melalui Rasul rasulNya ”yang menghidupkan dan mematikan” yakni diantara pengaturanNya adalah menghidupkan dan mematikan, dimana tidak ada seorangpun yang menyertaiNya dalam hal ini Allah menjadikan sebagai jembatan penyebrangan ke rumah kekekalan dimana barangasiapa yang beriman kepadanya pasti akan membenarkan Rasul. ”maka berimanlah kamu kepada Allah dan RasulNya nabi yang ummi” iman dengan hati yang mencakup amal hati dan anggota badan. ”yang beriman kepada Allah dan kepada kalimat-kalimatNYa (kitab-kitabNya)” yakni berimanlah kepada Rasul yang lurus ini dalam akidah dan perbuatannya. ”dan ikutilah dia, supaya kamu mendapat petunjuk” kepada kebaikan duniamu dan agamamu, karena jika kamu tidak mengikutinya, maka kamu akan tersesat dengan kesesatan yang sangat jauh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 158: Karena ayat sebelumnya lebih mengarah seruannya kepada Ahli Kitab dari kalangan Yahudi, maka agar tidak terkesan bahwa seruan Islam terbatas untuk mereka, dalam ayat ini disebutkan, bahwa seruan Islam ditujukan kepada semua manusia. Di mana Dia mengatur alam semesta dengan hukum-hukum Kauni-Nya (taqdir) dan hukum-hukum syar’i-Nya (syari’at). Termasuk di antaranya adalah dengan mengutus seorang rasul yang mengajak kepada Allah dan kepada surga-Nya, serta memperingatkan segala yang menjauhkan diri dari Allah dan dari surga-Nya. Yang lurus aqidah (keyakinan) dan amalnya. Dalam meniti hidup di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 158",
    "description": "Allah memperkenalkan nabi terakhir yang tercantum dalam kitab mereka dan kemuliaan para pengikutnya. Katakanlah wahai nabi Muhammad, wahai seluruh manusia tanpa kecuali! sesungguhnya aku ini utusan Allah bagi kamu semua, dan juga kepada makhluk jin, baik yang semasa denganku maupun tidak, tanpa terkecuali. Allah yang mengutus aku itu adalah yang memiliki kerajaan langit dan bumi; tidak ada tuhan yang berhak disembah selain dia. Semuanya tunduk hanya kepada-Nya. Dia yang mahakuasa untuk menghidupkan dan mematikan, oleh karena itu maka berimanlah kamu kepada Allah yang maha esa dan mahakuasa itu, dan rasul-Nya yang terakhir, yaitu nabi yang ummi, yang tidak pandai membaca dan menulis, namun mendapat informasi yang pasti berupa wahyu dari Allah, yang beriman kepada Allah dan kepada kalimat-kalimat-Nya yaitu kitab-kitab-Nya. Ikutilah dia dalam sistem dan cara hidupnya, dan laksanakan apa yang yang diajarkannya, agar kamu mendapat petunjuk kepada jalan yang lurus. Tidak semua bani israil durhaka, dan demi menjaga obyektifitas dalam penilaian terhadap mereka ayat ini menjelaskan, dan di antara kaum nabi musa itu, yaitu bani israil, terdapat suatu umat yang memberi petunjuk kepada manusia, khususnya bani israil dengan dasar kebenaran dalam akidah dan syariat, dan dengan itu pula mereka selalu berlaku adil dalam menjalankan keadilan. Mereka memberi petunjuk dan menuntun dengan berpedoman kepada petunjuk dan tuntunan yang datang dari Allah. Dan juga dalam hal mengadili perkara, mereka selalu mencari keadilan dengan berpedoman kepada petunjuk dan tuntunan Allah."
  }
]