[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bani israil dari kaum Musa ada segolongan yang tetap istiqamah di atas kebenaran, memberi petunjuk kepada manusia dengannya, serta berlaku adil dengannya dalam memutuskan hukum dalam perkara-perkara mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "159. \"Dan di antara kaum Musa dari kalangan Bani Israil ada golongan yang memegang teguh kebenaran, menunjukkan manusia kepadanya dan berlaku adil dalam memutuskan perkara di antara manusia.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "159. Lalu Allah menjelaskan bahwa tidak semua kamu Musa tersesat, namun terdapat orang yang baik dan yang buruk. Di antara kaum Musa terdapat kelompok besar yang mendapat petunjuk menuju kebenaran yang datang dari Allah. Dan dengan kebenaran itu mereka menetapkan hukum-hukum tanpa berbuat zalim dan menerima suap, namun mereka berlaku adil dalam setiap perkara."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "159. وَمِن قَوْمِ مُوسَىٰٓ أُمَّةٌ (Dan di antara kaum Musa itu terdapat suatu umat) Setelah Allah mengisahkan aoa yang terjadi pada Samiri dan pengikutnya serta kegoncangan bani Israil dalam beragama, Allah kemudian mengisahkan kepada kita bahwa pada kaum Nabi Musa terdapat golongan yang tidak serupa dengan mereka. يَهْدُونَ بِالْحَقِّ (yang memberi petunjuk (kepada manusia) dengan hak) Yakni menyeru manusia kepada petunjuk dengan kebenaran. وَبِهِۦ (dan dengan yang hak itulah) Yakni dengan kebenaran tersebut. يَعْدِلُونَ(mereka menjalankan keadilan) Diantara manusia dalam memutuskan perkara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "159. Dan di antara kaum Musa, yaitu sebagian Bani israil ada suatu kelompok besar yang mengajak manusia kepada petunjuk dan hidayah, dengan berpegang teguh dan menunaikan kebenaran yang dibawa nabi mereka. Dan terhadap kebenaran itu mereka mengadili hukum-hukum mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara kaum Musa terdapat suatu umat} kelompok {yang memberi petunjuk} memberi petunjuk {dengan kebenaran dan dengan itu mereka berlaku adil} dan dengan kebenaraan itu mereka memberikan keputusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "159. “dan diantara kaum Musa itu terdapat suatu umat” yakni jamaah, ”yang memberi petunjuk (kepada manusia) dengan hak dan dengan yang hak itulah mereka menjalankan keadilan” yakni mereka memberi petunjuk kepada manusia dengan pengajaran dan fatwa kepada mereka dan berlaku adil diantara mereka dalam memutuskan perkara-perkara diantara mereka, sebagaimana Allah berfirman ”dan kami jadikan diantara mereka itu pemimpin-pemimpin yang memberi petunjuk dengan perintah kami ketika mereka sabar. Dan mereka meyakini ayat-ayat kami”. ini menunjukan keutamaan umat nabi Musa dan bahwa Allah menjadikan diantara mereka orang-orang yang memberi petunjuk dengan perintahNYa. Dan sepertinya ayat yang mulia ini hadir untuk menepis kesalahan pemahaman dari penjelasan-penjelasan sebelumnya, karena dalam ayat-ayat sebelumnya Allah menyebutkan sekumpulan ma'ayib bani israil yang bertentangan dan bertabrakan dengan hidayah dan kesempurnaan, mungkin saja ada yang menduga salah bahwa hal itu ada pada bani israil semuanya, maka Allah menyebutkan bahwa diantara mereka ada sekelompok orang yang lurus mendapat petunjuk dan memberi petunjuk tersebut kepada orang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 159: Yakni segolongan orang. Maksudnya mereka menuntun manusia dengan berpedoman kepada petunjuk dan tuntunan yang datang dari Allah Subhaanahu wa Ta'aala. Demikian juga dalam mengadili perkara-perkara, mereka selalu mencari keadilan dengan berpedoman kepada petunjuk dan tuntunan Allah. Dalam ayat ini terdapat keutamaan segolongan orang dari kaum Musa yang mengajarkan petunjuk kepada manusia dan berfatwa untuk mereka dengan ilmu itu, dan bahwa Allah Ta’ala menjadikan di antara mereka para imam yang mengajak kepada petunjuk. Disebutkannya ayat ini adalah untuk mengecualikan dari golongan sebelumnya yang penuh dengan aib, jauh dari kesempurnaan dan berlawanan dengan hidayah agar tidak ada kesan bahwa semua Bani Israil seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 159",
    "description": "Tidak semua bani israil durhaka, dan demi menjaga obyektifitas dalam penilaian terhadap mereka ayat ini menjelaskan, dan di antara kaum nabi musa itu, yaitu bani israil, terdapat suatu umat yang memberi petunjuk kepada manusia, khususnya bani israil dengan dasar kebenaran dalam akidah dan syariat, dan dengan itu pula mereka selalu berlaku adil dalam menjalankan keadilan. Mereka memberi petunjuk dan menuntun dengan berpedoman kepada petunjuk dan tuntunan yang datang dari Allah. Dan juga dalam hal mengadili perkara, mereka selalu mencari keadilan dengan berpedoman kepada petunjuk dan tuntunan Allah. Dan kami membagi dengan mencerai beraikan dan pencarkan mereka kaum nabi musa menjadi dua belas suku, sejumlah anak-anak nabi yakub, yang masing-masing berjumlah besar, dan telah kami wahyukan kepada nabi musa ketika kaumnya meminta air kepadanya, pukullah batu itu dengan tongkatmu! sebagai bentuk mukjizat, maka tanpa memakan waktu yang lama memancarlah dari batu itu dua belas mata air. Sungguh, setiap suku telah mengetahui tempat minumnya masing-masing, sehingga mereka tidak kesulitan memperoleh air dan tidak juga berdesakan. Dan kami naungi mereka dengan awan ketika mereka tersesat di padang pasir dataran sinai yang terik selama empat puluh tahun (lihat : surah alma'idah/5 :26). Dan kami turunkan kepada mereka mann, yaitu makanan yang turun dari langit, rasanya manis seperti madu, dan salwa, yaitu sejenis burung puyuh, sehingga mereka tidak perlu berpayah-payah mencari makanan. Kami berfirman, makanlah yang baik-baik dari sebagian rezeki yang telah kami berikan kepadamu. Sebagian besar mereka tidak bersyukur dan terus berbuat dosa, meski demikian mereka tidak menzalimi kami, tetapi merekalah yang sejak dulu hingga kini selalu menzalimi dirinya sendiri."
  }
]