[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iblis yang dilaknat oleh Allah berkata, ”Disebabkan Engkau sudah memvonis aku sesat, maka aku akan sungguh-sungguh mengerahkan tenaga untuk menyesatkan keturunan Adam dari jalanMu yang lurus. Dan aku benar akan sungguh-sungguh menghalang-halangi mereka dari ajaran islam yang Engkau telah menciptakan fitrah mereka diatasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Iblis berkata, “Karena Engkau telah menyesatkanku sehingga aku tidak melaksanakan perintah-Mu bersujud kepada Adam, maka aku benar-benar akan menghalang-halangi keturunan Adam dari jalan-Mu yang lurus. Aku akan memalingkan dan menyesatkan mereka dari jalan-Mu sebagaimana aku yang tersesat (berpaling) dari sujud kepada bapak mereka, Adam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Kemudian Iblis mengancam Adam dan keturunannya: “Karena Engkau telah menyesatkanku karena Adam, maka sungguh aku akan menggodanya dan keturunannya, dan aku akan menghalangi mereka dari agama Islam; aku akan mendatangi mereka dari segala sudut kebenaran dan kebatial, dan dari segala penjuru untuk menyesatkan mereka, agar aku dapat menghalangi mereka dari kebenaran. Akan aku hiasi kebatilan bagi mereka, dan Engkau akan mendapati mayoritas mereka tidak mentaati-Mu dan tidak bersyukur atas karunia-Mu. Syeikh as-Syinqithi berkata, firman Allah: (ولا تجد أكثرهم شاكرين), apa yang disebutkan Iblis bahwa dia dapat melakukannya terhadap bani Adam adalah prasangkanya dapat menjadikan mereka mentaati ajakannya, sehingga dia dapat membinasakan mereka. Dan Allah menjelaskan dalam surat Saba’ bahwa prasangka ini benar-benar terjadi pada manusia, Dia berfirman: ولقد صدق إبليس ظنه فاتبعوه “Dan sesungguhnya iblis telah dapat membuktikan kebenaran sangkaannya terhadap mereka lalu mereka mengikutinya.” (Saba’: 20)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. قَالَ فَبِمَآ أَغْوَيْتَنِى لَأَقْعُدَنَّ لَهُمْ صِرٰطَكَ الْمُسْتَقِيمَ (Iblis menjawab: “Karena Engkau telah menghukum saya tersesat, saya benar-benar akan (menghalang-halangi) mereka dari jalan Engkau yang lurus) Yakni karena Engkau telah menjadikanku tersesat sehingga aku tidak bersujud kepada Adam lalu Engkau menghukumku dengan hukuman yang membinasakan maka aku akan bersungguh-sungguh dalam menyesatkan manusia agar mereka rusak perbuatannya karenaku sebagaimana perbuatanku rusak karena aku enggan bersujud kepada bapak mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Iblis berkata: “Maka kerena Engkau telah menghukumku dengan kesesatan, maka aku bersumpah akan berusaha keras menghalang-halangi anak Adam menuju keimanan, kebenaran dan hidayah. Dan sungguh aku akan menyesatkan mereka sehingga mereka berbuat kerusakan karenaku, dan mereka tidak menyembah dan mengesakanMu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Iblis menjawab,“Karena Engkau telah menyesatkan aku} menyesatkan aku {sungguh aku akan selalu menghalangi mereka dari jalanMu yang lurus} Sungguh aku akan merintangi mereka dari jalanMu yang lurus dengan cara mencegat agar mereka terhalang darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. yakni iblis berkata manakala dia telah putus harapan dan putus asa dari rahmat Allah “karena engkau telah menghukum saya tersesat, saya akan (benar-benar) menghalangi mereka” yakni manusia. ”dari jalanMu yang lurus” yakni aku akan menguntit jalan dan aku benar-benar akan berusaha dengan segenap kemampuanku untuk mencegah orang-orang darinya agar tidak melewati jalan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 16: Ketika ia sudah putus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 16",
    "description": "Mendengar pernyataan Allah tersebut, iblis menjawab, karena engkau telah menyesatkan aku dengan menetapkan kesesatan padaku sampai hari kiamat, aku bersumpah pasti aku akan selalu menghalangi mereka, adam dan anak cucunya, dari jalan-Mu yang lurus, yaitu jalan kebaikan yang dapat mengantarkan manusia menuju kebahagiaan dunia dan akhirat. Kemudian, kata iblis melanjutkan, untuk mewujudkan tujuanku ini, aku akan menempuh berbagai cara. Pasti aku akan mendatangi mereka dari segala penjuru: dari depan, dari belakang, dari kanan, dan dari kiri mereka. Dan karena manusia amatlah lemah, engkau tidak akan mendapati kebanyakan mereka bersyukur atas nikmat-nikmat-Mu."
  }
]