[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami membagi kaum Musa dari kalangan bani israil menjadi dua belas suku sesuai dengan jumlah asbath, (yaitu anak-anak (keturunan) ya’qub). Dan masing-masing suku sudah diketahui sesuai pemimpinnya. Dan kami wahyukan kepada Musa ketika kaumnya meminta air minum kepadanya, saat mereka di landa kehausan di tempat mereka tersesat jalan, ”pukulah batu itu dengan tongkatmu, ” lalu dia memukulnya dan terpancarlah darinya dua belas mata air. Dan sesungguhnya tiap-tiap suku dari dua belas suku yang ada telah mengetahui tempat minum mereka. Tiap suku tidak masuk ke suku lain dalam tempat minumnya. Dan kami datangkan awan untuk menaungi mereka dan kami turunkan kepada mereka manna, (sesuatu yang menyerupai manisan kenyal yang rasanya menyerupai madu), dan salwa, (sejenis burung yang menyerupai burung puyuh). Dan kami katakan kepada mereka, ”makanlah yang baik-baik dari apa yang kami rizkikan kepada kalian.” Mereka justru tidak menyukainya dan merasa bosan, lantaran terlalu lama terus menerus mengonsumsinya. Mereka pun berkata, ”kami tidak dapat bersabar lagi terhadap satu jenis makanan saja.” Dan mereka menuntut makanan pengganti yang lebih rendah untuk menggantikan makanan yang lebih baik bagi mereka. Mereka tu tidaklah menzdolimi kami ketika tidak mau bersyukur kepada Allah dan tidak melaksanakan kewajiban yang Allah tetapkan atas mereka. Akan tetapi mereka menzholimi diri mereka sendiri, sebab mereka melewatkan semua jenis kebaikan bagi diri mereka dan membawanya kepada keburukan dan siksaan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "160. Dan Kami membagi Bani Israil menjadi dua belas suku. Dan Kami wahyukan kepada Musa ketika kaumnya memintanya berdoa kepada Allah agar mengalirkan air kepada mereka, \"Pukullah batu itu -wahai Musa- dengan tongkatmu!”, kemudian Musa memukul batu itu dengan tongkatnya. Tiba-tiba dari batu itu memancar dua belas mata air sesuai dengan jumlah suku mereka. Dan setiap suku sudah mengetahui mana tempat air minumnya masing-masing. Maka tidak ada suku lain yang bergabung dengannya di tempat air minum itu. Dan Kami naungi mereka dengan awan yang bergerak bersama mereka ke mana pun mereka pergi dan berhenti di mana pun mereka berhenti. Dan Kami turunkan kepada mereka di antara nikmat-nikmat Kami berupa minuman manis seperti madu dan burung kecil yang dagingnya bagus sejenis puyuh. Dan Kami katakan kepada mereka, “Makanlah makanan-makanan yang baik dari rezeki yang telah Aku berikan kepada kalian.” Mereka sama sekali tidak menganiaya Kami ketika mereka berlaku tidak adil, mengingkari nikmat, dan tidak menghargainya dengan semestinya. Tetapi mereka menganiaya diri mereka sendiri ketika mereka menjerumuskan diri mereka sendiri ke jurang kehancuran dengan melanggar perintah Allah dan mengingkari nikmat-nikmat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "160. Dan sebagian kenikmatan yang telah Kami berikan kepada mereka adalah dengan menjadikan mereka 12 kabilah yang saling mengenal; dan mewahyukan kepada Musa untuk memukul batu dengan tongkatnya, ketika mereka meminta kepada Musa air minum; saat Musa memukulnya, memancar dari batu itu 12 mata air, sesuai dengan jumlah kabilah Bani Israil, agar mereka melihat salah satu tanda kekuasaan Allah yang menunjukkan kebenaran risalah Musa, dan agar mereka tidak saling berebut air minum. Setiap kabilah telah mengetahui mata airnya masing-masing, sehingga mereka tidak minum dari mata air kabilah lain dan tidak perlu mengantri dan berebut. Kemudian Allah menyebutkan kenikmatan lain berupa awan yang menaungi mereka dari sinar matahari, menurunkan ‘al-Mann’ -yaitu benda lengket yang jatuh dari pohon yang memiliki rasa seperti madu- dan ‘as-Salwa’ -yaitu burung darat yang mudah ditangkap dan memiliki daging yang nikmat, disebut juga dengan as-Summany-, burung itu terbawa mendekati mereka oleh angin selatan setiap petang hari, sehingga mereka dapat menangkapnya tanpa kesulitan. Setelah Allah menyebutkan nikmat-nikmat yang telah Dia berikan kepada mereka, Dia memerintahkan mereka untuk memakan makanan-makanan yang baik yang telah direzekikan kepada mereka, dan tidak memakan makanan yang haram; dan memerintahkan mereka untuk mensyukuri nikmat-nikmat tersebut, agar Allah menambah kenikmatan bagi mereka. Namun mereka menyelisihi perintah Tuhan mereka dan mengingkari segala kenikmatan besar ini; maka Allah menanggapi perbuatan mereka ini: “Mereka sama sekali tidak menzalimi Kami, namun mereka hanya menzalimi diri mereka sendiri, karena telah menjauhkan diri mereka dari kebaikan dan mendekatkannya pada keburukan dan siksaan.” Mereka melakukan hal ini ketika sedang terusir selama 40 tahun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "160. وَقَطَّعْنٰهُمُ اثْنَتَىْ عَشْرَةَ أَسْبَاطًا (Dan mereka Kami bagi menjadi dua belas suku) Yakni Kami kelompokkan kaum Nabi Musa. Yakni Allah membedakan sebagian mereka dari sebagian yang lain sehingga mereka menjadi bersuku-suku, setiap suku berbeda dari yang lain, dan setiap suku memiliki pemimpin. أُمَمًا ۚ (ang masing-masingnya berjumlah besar) Yakni pada setiap suku terdapat kabilah yang berasal dari bapak yang merupakan anak-anak Nabi Ya’kub yang berjumlah dua belas. وَأَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ إِذِ اسْتَسْقَىٰهُ قَوْمُهُۥٓ (dan Kami wahyukan kepada Musa ketika kaumnya meminta air kepadanya) Ketika mereka tertimpa kehausan saat terusir dari Baitul maqdis. فَانۢبَجَسَتْ (Maka memancarlah) Yakni maka musa memukul batu kemudian batu itu menyemburkan air. مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا ۖ (dari padanya duabelas mata air) Sesuai dengan jumlah suku, bagi setiap suku satu mata air untuk mereka minum. قَدْ عَلِمَ كُلُّ أُنَاسٍ مَّشْرَبَهُمْ ۚ( Sesungguhnya tiap-tiap suku mengetahui tempat minum masing-masing) Yakni setiap suku telah mengetahui mata air khusus untuk mereka minum. وَظَلَّلْنَا عَلَيْهِمُ الْغَمٰمَ(Dan Kami naungkan awan di atas mereka) Yakni Kami menjadikan bagi mereka naungan saat mereka mengembara karena terusir sehingga dapat melindungi mereka dari panas matahari, naungan itu berjalan ketika mereka berjalan dan berhenti ketika mereka berhenti. وَأَنزَلْنَا عَلَيْهِمُ الْمَنَّ وَالسَّلْوَىٰ ۖ (dan Kami turunkan kepada mereka manna dan salwa) Makna dari ayat ini telah dijelaskan dalam surat al-baqarah: 57. كُلُوا۟ مِن طَيِّبٰتِ مَا رَزَقْنٰكُمْ ۚ (Makanlah yang baik-baik dari apa yang telah Kami rezekikan kepadamu) Yakni dan Kami katakan kepada mereka: “makanlah segala kenikmatan yang telah Kami berikan kepada kalian. وَمَا ظَلَمُونَا(Mereka tidak menganiaya Kami) Dengan apa yang mereka lakukan berupa pelanggaran, tidak mensyukuri nikmat-nikmat, dan tidak menghargai nikmat-nikmat itu sebagaimana mestinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "160. Kami membagi dan memisahkan kaum Musa satu sama lain sehingga mereka menjadi 12 kabilah, dimana setiap kabilah bisa dikenali dengan jelas. Al-Asbath adalah cucu. Menurut mereka, hal itu seperti suatu kabilah layaknya keturunan Ismail yang Kami jadikan mereka beberapa umat, yaitu setiap keturunan memiliki kabilah dari satu ayah dari anak-anak Ya’kub. Dan ketika kaumnya meminta minum saat mereka ditimpa kehausan di padang gurun, Kami wahyukan kepada Musa: “Pukullah batu itu dengan tongkatmu”, lalu terpancarlah dari batu itu 12 mata air sesuai jumlah kabilah itu. Dan setiap kabilah itu telah mengetahui tempat minumnya masing-masing. Kami jadikan awan menaungi mereka di gurun pasir sehingga dapat melindungi mereka dari panas matahari. Kami turunkan di atas dedaunan itu Al-Manna (sesuatu berwarna putih dan manis) dan As-Salwa (burung yang menyerupai burung puyuh). Kami berfirman kepada mereka: “Makanlah kenikmatan yang Kami berikan kepada kalian” Mereka tidak menzalimi Kami dengan mengingkari nikmat ini, melainkan menzalimi diri sendiri, yang mana mereka mengarahkannya kepada azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami membagi mereka} membagi mereka {menjadi dua belas suku} kafilah {Kami wahyukan kepada Musa ketika kaumnya meminta air kepadanya,“Pukullah batu itu dengan tongkatmu!” Lalu memancarlah} memancarlah {dari batu itu dua belas mata air. Sungguh setiap suku telah mengetahui tempat minumnya. Kami menaungi mereka dengan awan} awan {dan Kami menurunkan kepada mereka manna dan salwa. “Makanlah yang baik-baik dari rezeki yang telah Kami anugerahkan kepada kalian” Mereka tidak menzalimi Kami, tetapi merekalah yang selalu menzalimi diri sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160. “dan mereka kami bagi menjadi dua belas suku yang masing-masingnya berjumlah besar”yakni dua belas suku yang selalu mengenal dan berhubungan baik. Setiap keturunan seorang laki-laki dari anak ya’qub adalah satu suku. ”dan kami wahyukan kepada Musa ketika kaumnya meminta air kepadanya” yakni mereka meminta kepada nya untuk berdoa kepada Allah agar memberi mereka iar untuk minum mereka dan ternak mereka, hal itu karena -wallahu a'lam- mereka berada di daerah yang minim air. Maka Allah menjawab permintaan mereka dengan mewahyukan kepada Musa “pukullah batu itu dengan tongkatmu” ada kemungkinan ia adalah batu tertentu ada kemungkinan ia adalah jenis batu apa saja. Musa memukulnya “maka memancarlah” dari batu tersebut “dua belas mata air” mengalir. ”sesungguhnya tiap-tiap suku mengetahui tempat minum masing-masing” yakni mata air itu terbagi menjadi dua belas sesuai dengan jumlah suku bani israil, masing-masing suku dengan mata airnya, mereka mengetahuinya, mereka tenang, terbebas dari kelelahan dan tanpa berdesak-desakan, dan ini termasuk nikmat Allah kepada mereka. ”dan kami naungkan awan diatas mereka” ia melindungi mereka dari panas matahari. ”dan kami turunkan kepada mereka manna” yaitu sesuatu yang manis “dan salwa” yaitu daging burung terbaik dan terlezat. Allah mengumpulkan untuk mereka naungan awan, minuman dan makanan yang enak yaitu manna dan salwa yang didapat tanpa lelah dan cape. dikatakan kepada mereka “makanlah yang baik-baik dari apa yang telah kami rizkikan kepadamu, dan mereka tidak menganiaya kami\". manaka mereka tidak bersyukur kepada Allah dan tidak menunaikan apa yang Allah wajibkan atas mereka “tetapi merekalah yang selalu menganiaya dirinya sendiri” dimana ia menyia nyiakan kebaikan dan menentang resiko keburukan dan azab. ini terjadi pada masa di mana mereka tersesat dari bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 160: Saat mereka di tengah padang Tiih (padang atau lapangan luas yang tidak ada tanda yang menunjukkan jalan), lihat pula Surah Al Maa’idah: 26. Ketika mereka berada di padang Tiih, yang melindungi mereka dari panas terik matahari. Manna adalah makanan manis seperti madu, sedangkan Salwa adalah burung sebangsa puyuh. Ketika mereka tidak bersyukur kepada Allah dan tidak mengerjakan kewajiban yang Allah bebankan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 160",
    "description": "Dan kami membagi dengan mencerai beraikan dan pencarkan mereka kaum nabi musa menjadi dua belas suku, sejumlah anak-anak nabi yakub, yang masing-masing berjumlah besar, dan telah kami wahyukan kepada nabi musa ketika kaumnya meminta air kepadanya, pukullah batu itu dengan tongkatmu! sebagai bentuk mukjizat, maka tanpa memakan waktu yang lama memancarlah dari batu itu dua belas mata air. Sungguh, setiap suku telah mengetahui tempat minumnya masing-masing, sehingga mereka tidak kesulitan memperoleh air dan tidak juga berdesakan. Dan kami naungi mereka dengan awan ketika mereka tersesat di padang pasir dataran sinai yang terik selama empat puluh tahun (lihat : surah alma'idah/5 :26). Dan kami turunkan kepada mereka mann, yaitu makanan yang turun dari langit, rasanya manis seperti madu, dan salwa, yaitu sejenis burung puyuh, sehingga mereka tidak perlu berpayah-payah mencari makanan. Kami berfirman, makanlah yang baik-baik dari sebagian rezeki yang telah kami berikan kepadamu. Sebagian besar mereka tidak bersyukur dan terus berbuat dosa, meski demikian mereka tidak menzalimi kami, tetapi merekalah yang sejak dulu hingga kini selalu menzalimi dirinya sendiri. Masih dalam konteks mengingatkan tentang nikmat-nikmat Allah kepada bani israil, yang dibarengi kecaman, ayat ini menyatakan, dan selain nikmat-nikmat yang terdahulu, ingatlah pula, ketika dikatakan oleh Allah melalui rasul kepada mereka, yakni bani israil setelah mereka selamat dari tersesat di padang pasir, diamlah di negeri ini, yaitu baitulmakdis, kota suci yang dijanjikan oleh Allah, dan makanlah dari hasil buminya, yang banyak lagi enak, di mana dan kapan saja kamu kehendaki. Dan katakanlah, a'ia'a'ah, yaitu bebaskanlah kami dari dosa-dosa kami yang banyak dan masukilah pintu gerbangnya sambil membungkuk, atau bersujud dengan penuh kerendahan hati. Kalau itu kamu lakukan, niscaya kelak kami ampuni kesalahan-kesalahanmu, baik yang disengaja maupun yang tidak disengaja. Kelak akan kami tambah pahala dan anugerah kami, baik di dunia maupun di akhirat, kepada orang-orang yang selalu berbuat yang lebih baik dan mantap dalam kebaikannya."
  }
]