[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), kedurhakaan bani israil kepada tuhan mereka dan kepada nabi mereka, Musa dan penggantian yang mereka lakukan terhadap ucapan yang mereka perintahkan untuk melakukannya ketika Allah berkata kepada mereka, ”tinggalah kalian di negeri baitul maqqdis, daan makanlah buah-buahnnya, biji-bijiannya, dan hasil tanamannya, dimanapun kalian berada dan kapanpun kalian kehendaki. Dan ucapkanlah oleh kalian, ’hapuslah dosa-dosa dari kami”, dan masukilah pintu gerbangnya dengan penuh ketundukan kepada Allah, niscaya kami akan ampuni kesalahan-kesalahan kalian dan kami tidak menyiksa kalian karenanya. Dan kami akan memberikan tambahan bagi orang-orang yang berbuat baik dari kebaikan dunia dan akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "161. Ingatlah -wahai Rasul- tatkala Allah berfirman kepada Bani Israil, “Masuklah kalian ke Baitulmakdis dan makanlah dari buah-buahan yang ada di daerah itu, di mana saja dan kapan saja kalian mau. Dan ucapkanlah, ‘Ya Rabb kami! Hapuslah dosa-dosa kami!.’ Dan masuklah ke pintu gerbang itu sambil rukuk serta menundukkan diri kalian kepada Rabb kalian, niscaya Kami akan mengampuni dosa-dosa kalian. Dan Kami akan menambahkan kebaikan di dunia dan di Akhirat bagi orang-orang yang suka berbuat baik.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "161. Hai Bani Israil yang berada pada zaman Nabi Muhammad, ingatlah ketika dikatakan kepada para pendahulu kalian: “Tinggallah kalian di negeri Baitul Maqdis setelah kalian terusir”, dan dikatakan kepada mereka: “Makanlah sesuka hati kalian rezeki yang halal di negeri itu, dan mohonlah kepada Allah agar mengampuni dosa kalian, serta masuklah melewati pintunya dengan rasa tunduk dan syukur kepada Allah yang telah memberikan kalian berbagai kenikmatan; jika kalian melakukan ini niscaya Allah akan mengampuni dosa kalian.” Allah memerintahkan mereka untuk tunduk dan memohon ampun, dan menjanjikan bagi mereka ampunan dan pahala di dunia dan di akhirat, bahkan Allah akan menambah kebaikan dunia dan akhirat bagi orang-orang yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "161. اسْكُنُوا۟ هٰذِهِ الْقَرْيَةَ (tinggallah di negeri ini) Yakni negeri Baitul Maqdis. وَكُلُوا۟ مِنْهَا (dan makanlah dari (hasil bumi)nya) Dari kebaikan-kebaikan yang keluar darinya. حَيْثُ شِئْتُمْ (di mana saja kamu kehendaki) Yakni di tempat manapun yang kalian kehendaki. وَقُولُوا۟ حِطَّةٌ (Dan katakanlah: “Hitthah” (Bebaskanlah kami dari dosa kami)) Tafsir dari ayat ini telah disebutkan dalam surat al-baqarah: 58. وَادْخُلُوا۟ الْبَابَ(dan masukilah pintu gerbangnya) Yakni gerbang kota Baitul Maqdis. سُجَّدًا(sambil membungkuk) Dengan menundukkan diri. نَّغْفِرْ لَكُمْ خَطِيٓـٰٔتِكُمْ ۚ (niscaya Kami ampuni kesalahan-kesalahanmu) Yakni jika kalian memasuki Baitul Maqdis dengan penuh kemenangan namun dengan hal itu kalian juga memasukinya dengan penuh ketundukan kepada Allah, patuh serta mendengarkan dan taat kepada Allah, maka niscaya itu akan menjadi penghapus dosa-dosa kalian. سَنَزِيدُ الْمُحْسِنِينَ (Kelak akan Kami tambah (pahala) kepada orang-orang yang berbuat baik) Dengan kenikmatan-kenikmatan yang dilebihkan untuk mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "161. Dan ingatlah wahai Nabi, ketika dikatakan kepada leluhur Bani Israil setelah keluar dari gurun: “Tinggallah di tanah Baitul Maqdis, dan ucapkanlah: “Bebaskanlah kami”, yaitu Kami diperintahkan untuk tunduk dan maksudnya adalah angkatlah dosa-dosa kami, lalu masuklah ke dalam pintu negeri itu (Baitul Maqdis) dengan bersujud kepada Allah sebagai wujud syukur atas nikmatNya. Itu merupakan salah satu jenis sujud syukur, maka Kami akan mengampuni dosa-dosa kalian saat melakukan hal ini di Baitul Maqdis sebagai orang yang menang. Kami akan menambahkan kebaikan, pahala dan nikmat atas orang-orang yang baik”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dikatakan kepada mereka,“Tinggallah di negeri ini} Baitul maqdis {dan makanlah darinya di mana saja kalian kehendaki, serta katakanlah,”Bebaskanlah dari dosa”} bebaskanlah kami dari dosa-dosa kami {lalu masukilah pintunya sambil membungkuk. Niscaya Kami mengampuni kesalahan-kesalahan kalian.” Kami akan menambah kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "161 “dan ingatlah ketika dikatakan kepada mereka (bani israil) diamlah di negeri ini saja (baitul maqdis)\" yakni masuklah ke dalamnya agar ia menjadi tempat tinggal dan negerimu, yaitu ailia (baitul maqdis) “dan makanlah dari hasil buminya di mana saja kamu kehendaki” yakni negeri dengan pohon yang lebat dan buah yang banyak serta kehidupan yang nyaman. oleh karena itu Allah memerintahkan mereka agar makan darinya sesuka mereka. ”dan katakanlah” ketika kamu masuk “bebaskanlah kami dari dosa kami” yakni hapuskanlah dosa kami dan maafkanlah kesalahan kami ”dan masukilah pintu gerbangnya sambil mebungkuk” yakni dengan merendahkan diri kepada tuhan kalian dan meminta ketenangan karena kemulian-Nya sambal bersyukur atas nikmat-nikmatNYa, maka Dia memerintahkan mereka agar tunduk dan memohon ampunan, dan menjanjikan mereka ampunan atas dosa-dosa mereka dan pahala di dunia akhirat. Dia berfirman ”niscaya kami mengampuni kesalahan-kesalahanmu. kelak kami akan tambah (pahala) kepada orang-orang yang berbuat baik” dari kebaikan dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 161",
    "description": "Masih dalam konteks mengingatkan tentang nikmat-nikmat Allah kepada bani israil, yang dibarengi kecaman, ayat ini menyatakan, dan selain nikmat-nikmat yang terdahulu, ingatlah pula, ketika dikatakan oleh Allah melalui rasul kepada mereka, yakni bani israil setelah mereka selamat dari tersesat di padang pasir, diamlah di negeri ini, yaitu baitulmakdis, kota suci yang dijanjikan oleh Allah, dan makanlah dari hasil buminya, yang banyak lagi enak, di mana dan kapan saja kamu kehendaki. Dan katakanlah, a'ia'a'ah, yaitu bebaskanlah kami dari dosa-dosa kami yang banyak dan masukilah pintu gerbangnya sambil membungkuk, atau bersujud dengan penuh kerendahan hati. Kalau itu kamu lakukan, niscaya kelak kami ampuni kesalahan-kesalahanmu, baik yang disengaja maupun yang tidak disengaja. Kelak akan kami tambah pahala dan anugerah kami, baik di dunia maupun di akhirat, kepada orang-orang yang selalu berbuat yang lebih baik dan mantap dalam kebaikannya. Lalu apa yang mereka katakan dan lakukan' bukannya bersyukur dengan taat kepada Allah, orang-orang yang zalim di antara mereka mengganti perkataan hia'a'ah yang diperintahkan itu dengan perkataan yang tidak dikatakan, yakni diperintahkan kepada mereka. Mereka diperintah untuk mengucap, a'ia'a'ah (kami mohon dilepaskan dari dosa) namun mereka mengubah sambil mencemooh dan mengucapkan, hina'ah yang maknanya kami memohon gandum. Maka kami timpakan kepada mereka azab dari langit berupa penyakit kolera atau lainnya yang mematikan, disebabkan kezaliman mereka."
  }
]