[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian orang-orang yang kafir kepada Alllah dari mereka, mengubah ucapan yang Allah memerintahkan mereka untuk mengucapkannya, dan memasuki pintu gerbang dalam keadaan merangkak dengan pantat-pantat mereka, dan mereka berkata, ”habbaatun fi sya’ratin (biji dari gandum).” maka kami kirim kepada mereka siksaan dari langit, kami binasakan mereka dengannya di sebabkan tindakan aniaya dan kedurhakaan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "162. Kemudian orang-orang yang zalim di antara mereka mengganti ucapan yang diperintahkan kepada mereka dengan ucapan lain. Maka mereka berkata, “Ada satu biji dalam satu bulir gandum.” Mereka tidak meminta ampun kepada Rabb mereka sebagaimana diperintahkan kepada mereka. Lalu mereka masuk ke pintu gerbang sambil merayap dengan menggunakan pantat mereka. Mereka tidak mau masuk sambil menunjukkan ketundukan mereka kepada Allah dengan menundukkan kepala mereka. Kemudian Kami kirimkan kepada mereka azab dari langit disebabkan oleh kezaliman mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "162. Namun setelah Allah menyempurnakan nikmat mereka dengan mengizinkan mereka memasuki Baitul Maqdis, mereka semakin ingkar dan angkuh. Allah memerintahkan mereka untuk tunduk dengan perkataan dan perbuatan dengan memasuki pintu negeri dengan bersujud, namun mereka mengubah perintah itu dengan merangkak mundur dengan kepala yang terangkat penuh kesombongan. Allah memerintahkan mereka untuk mengatakan ‘Hittah’ -ampunilah dosa kami-, namun mereka mengatakan ‘hintah’ -biji gandum-, sebagaimana kisah ini disebutkan dalam shahih Bukhari dan telah dijelaskan pada surat al-Baqarah: 58. Ini merupakan pelanggaran dan pembangkangan yang paling besar, oleh sebab itu Allah menurunkan kepada mereka azab yang berat, berupa penyakit tha’un atau siksaan-siksaan lain. Allah tidak menzalimi mereka dengan siksaan itu, namun Allah menyiksa mereka karena mereka bermaksiat kepada Allah tanpa ada dorongan melainkan keburukan yang ada dalam jiwa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "162. فَبَدَّلَ الَّذِينَ ظَلَمُوا۟ مِنْهُمْ قَوْلًا غَيْرَ الَّذِى قِيلَ لَهُمْ (Maka orang-orang yang zalim di antara mereka itu mengganti (perkataan itu) dengan perkataan yang tidak dikatakan kepada mereka) Penjelasan ayat ini telah disebutkan dalam surat al-baqarah. رِجْزًا مِّنَ السَّمَآءِ بِمَا كَانُوا۟ يَظْلِمُونَ (maka Kami timpakan kepada mereka siksaan dari langit) Yakni azab yang disebabkan kezaliman mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "162. Lalu orang-orang zalim di antara mereka mengganti ucapan mereka, maka Kami menurunkan atas mereka azab dari langit akibat kezaliman mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka orang-orang yang zalim di antara mereka mengganti} mengubah {dengan perkataan yang tidak diperintahkan kepada mereka. Lalu, Kami menimpakan kepada mereka azab} azab {dari langit karena mereka selalu berbuat zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "162. mereka tidak mengubris perintah ilahi ini justru orang-orang zhalim dari mereka merubahnya, yakni mereka melanggar dan meremehkan perintah Allah “dengan perkataan yang tidak dikatakan kepada mereka” sebagai ganti meminta ampun dan mengucapkan ‘hithtah” mereka berkata, ”satu biji gandum”j ika mereka merubah ucapan meski ia sangat mudah, maka mereka lebih berani lagi merubah perbuatan. oleh karena itu mereka masuk dengan cara mengesot ”maka kami timpakan kepada mereka” ketika mereka menyelisihi perintah Allah dan durhaka kepadaNya ”azab dari langit” yakni azab yang berat bisa jadi thaun atau azab dari langit yang lain, Allah tidak menzahlimi mereka dengan azabNYa akan tetapi hal itu “disebabkan kezhaliman mereka”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 162: Mereka diperintah untuk mengucapkan hiththatun (artinya, “Bebaskanlah kami dari dosa”), namun mereka merubahnya sambil mencemooh dan mengucapkan hinthatun (artinya: gandum) sebagai gantinya, atau mengucapkan “hitthatun” namun dengan menambah “Habbah fii sya’iirah” (artinya: biji dalam sebuah gandum), dan lagi mereka masuk ke pintu gerbangnya sambil membelakangi (merangkak dengan mengedepankan bokong mereka). Jika mereka sudah berani merubah ucapan yang diperintahkan kepada mereka padahal ringan melakukannya, maka merubah sikap lebih berani lagi. Oleh karenanya, mereka masuk ke negeri itu dalam keadaan membelakangi (tidak sambil membungkuk). Bisa berupa tha’un atau hukuman dari langit lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 162",
    "description": "Lalu apa yang mereka katakan dan lakukan' bukannya bersyukur dengan taat kepada Allah, orang-orang yang zalim di antara mereka mengganti perkataan hia'a'ah yang diperintahkan itu dengan perkataan yang tidak dikatakan, yakni diperintahkan kepada mereka. Mereka diperintah untuk mengucap, a'ia'a'ah (kami mohon dilepaskan dari dosa) namun mereka mengubah sambil mencemooh dan mengucapkan, hina'ah yang maknanya kami memohon gandum. Maka kami timpakan kepada mereka azab dari langit berupa penyakit kolera atau lainnya yang mematikan, disebabkan kezaliman mereka nikmat berikutnya adalah nikmat melimpahnya ikan buat mereka di hari ibadah. Dan tanyakanlah wahai nabi Muhammad, yakni kepada mereka orang-orang yahudi yang hidup pada masamu tentang kisah penduduk negeri yang terletak di dekat laut, yaitu kota ailah yang terletak di pantai laut merah, atau tepatnya di teluk aqabah, ketika mereka melanggar aturan Allah pada hari sabat, yang menurut aturan mereka merupakan hari yang dikhususkan untuk ibadah dan terlarang untuk bekerja dan mencari ikan, yaitu ketika datang kepada mereka ikan-ikan yang berada di sekitar mereka yang bagaikan terapung-apung di permukaan air, padahal pada hari-hari yang bukan sabat ikan-ikan itu tidak datang kepada mereka. Demikianlah kami menguji mereka disebabkan mereka sering kali berlaku fasik, keluar dari ketaatan kepada alla."
  }
]