[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tanyakanlah (wahai rasul), kepada orang-orang yahudi tentang berita penduduk negeri yang dahulu bermukim di dekat laut (merah), ketika penduduknya berbuat melampaui batas pada hari sabtu terhadap larangan-laranagn Allah, lantaran mereka diperintahkan oleh Allah untuk mengagungkan hari sabtu dan tidak berburu ikan pada hari itu. lalu Allah menguji mereka dan memberikan cobaan kepada mereka; dimana ikan-ikan datang kepada mereka pada hari sabtu dengan sangat banyak lagi mengapung-ngapung di permukaan air laut. Apabila hari sabtu berlalu, ikan-ikan itu pun pergi ke dalam laut, sehingga mereka tidak melihat sedikitpun dari ikan-ikan tersebut. Kemudian merekapun mengadakan rekayasa, mereka mungurung ikan-ikan itu dalam kurungan-kurungan pada hari sabtu, lalu menangkapinya setelah hari itu. Dan demikianlah sebagaimana kami telah gambarkan bagi kalian bentuk cobaan dan ujian denga menapakan ikan di atas permukaan air pada hari yang diharamkan atas mereka untuk berburu padanya, dan menyembunyikannya pada hari yang dihalalkan bagi mereka untuk menangkapnya, demikianlah pula kami menguji mereka di sebabkan perbuatan fasik mereka dan keluarnya mereka dari ketaatan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "163. Dan tanyakanlah -wahai Rasul- kepada orang-orang Yahudi untuk mengingatkan mereka akan hukuman yang pernah menimpa para pendahulu mereka tentang kisah penduduk desa yang ada di dekat laut. Yaitu ketika mereka melanggar larangan Allah dengan menangkap ikan di hari Sabtu setelah mereka dilarang melakukan hal itu. Ketika itu Allah menguji mereka dengan membuat ikan-ikan muncul ke permukaan air laut di hari Sabtu, sedangkan di hari-hari lainnya tidak muncul. Allah memberi mereka ujian itu karena mereka tidak taat kepada Allah dan berbuat maksiat. Kemudian mereka membuat taktik menangkap ikan dengan cara memasang jaring dan menggali lubang-lubang sehingga ikan-ikan yang muncul pada hari Sabtu terjebak di sana. Lalu mereka mengambil ikan-ikan yang terjebak di sana pada hari Ahad dan memakannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "163. Hai Muhammad, tanyalah orang-orang Yahudi itu tentang kisah kaum mereka yang menyelisihi perintah Allah, sehingga Dia menyiksa mereka dengan tiba-tiba. Jumhur ahli tafsir berpendapat bahwa negeri itu merupakan negeri yang terletak di tepi pantai, yaitu negeri Aylah yang terletak di antara negeri Madyan dan Thur. Para penduduknya melanggar kehormatan hari sabtu yang Allah jadikan sebagai hari larangan untuk berburu, sebagai ujian bagi mereka. Namun mereka melanggar ketetapan Allah dan melakukan perburuan pada hari itu. Allah menguji mereka dengan menjadikan ikan paus mendatangi mereka pada hari sabtu, paus itu menampakkan diri di permukaan air dan mendekati daratan sehingga memungkinkan bagi mereka untuk menangkapnya dengan mudah, namun jika hari sabtu telah berlalu, paus itu tidak lagi mendatangi mereka. Kefasikan yang mereka perbuat mengundang ujian dari Allah, kalaulah mereka tidak berbuat fasik niscaya mereka akan dijauhkan dari ujian ini. Namun mereka menyusun rencana untuk menangkap paus itu; mereka menggali lubang dan memasangkan jaring padanya, dan ketika telah datang hari sabtu, paus itu datang dan terperangkap dalam jaring tersebut. Namun mereka tidak mengambil ikan itu pada hari sabtu, akan tetapi mereka ambil pada hari minggu. Sangat banyak rencana dan tipu daya yang mereka buat untuk melakukan perbuatan haram."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "163. وَسْـَٔلْهُمْ (Dan tanyakanlah kepada Bani Israil) Sebagai pengingat bagi mereka atas apa yang telah menimpa para pendahulu mereka, bagaimana Allah mengutuk mereka ketika mereka bermain-main dengan agama-Nya, dan menyiasati perintah dan larangan-Nya. عَنِ الْقَرْيَةِ الَّتِى كَانَتْ حَاضِرَةَ الْبَحْرِ (tentang negeri yang terletak di dekat laut) Terdapat pendapat mengatakan yakni di negeri Ailah sebelah Aqabah. Pendapat lain mengatakan yakni di Thabariah (Tiberias). إِذْ يَعْدُونَ (ketika mereka melanggar aturan) Yakni yang melebihi batas-batas yang telah ditentukan Allah dengan tetap berburu di hari sabtu yang telah dilarang untuk bekerja di hari itu. Sebagaimana disebutkan bahwa mereka tidak menangkap ikan secara terang-terangan namun dengan menggunakan tipu daya, yaitu dengan memasang jaring di hari jum’at, dan mendapat ikan buruan di hari sabtu, lalu mereka mengambilnya di hari ahad. Namun secara tekstual, ayat ini menunjukkan bahwa mereka mengambil ikan itu di hari sabtu; wallahu a’lam tentang kejadian yang sebenarnya. إِذْ تَأْتِيهِمْ حِيتَانُهُمْ يَوْمَ سَبْتِهِمْ شُرَّعًا وَيَوْمَ لَا يَسْبِتُونَ ۙ لَا تَأْتِيهِمْ ۚ كَذٰلِكَ نَبْلُوهُم (di waktu datang kepada mereka ikan-ikan (yang berada di sekitar) mereka terapung-apung di permukaan air, dan di hari-hari yang bukan Sabtu, ikan-ikan itu tidak datang kepada mereka. Demikianlah Kami mencoba mereka) Allah menguji mereka karena kefasikan yang muncul pada mereka, dengan datangnya ikan-ikan kepada mereka dengan jelas di permukaan laut pada hari sabtu, ditempat yang dekat dan mudah sekali ditangkap; dan di hari-hari yang lain ikan-ikan itu tidak muncul dan susah sekali mereka tangkap. Dan ini merupakan ujian bagi mereka dalam kemampuan mereka bersabar untuk menjauhi larangan-larangan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "163. Wahai Nabi, tanyakanlah tentang apa yang terjadi pada penduduk negeri (Ailah) yang berada di samping pegunungan yang ada di atas pesisir laut merah, ketika mereka menyalahi dan melewati batas-batas Allah dengan tetap melaut di hari sabtu sedangkan mereka sudah dilarang, dan ketika ikan-ikan bermunculan di atas permukaan air menghampiri mereka pada hari sabtu dimana mereka diharamkan untuk bekerja, sedangkan pada hari lain, ikan-ikan itu tidak bermunculan menghampiri mereka. Seperti itulah, Kami memberi musibah yang berat itu akibat kefasikan mereka. Dan dalam hal itu terdapat ujian untuk mengetahui kapasitas kemampuan mereka untuk bersabar atas sesuatu yang haram"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tanyakanlah kepada mereka} tanyakanlah kepada orang-orang Yahudi itu {tentang negeri yang terletak di dekat} di samping {laut ketika mereka melanggar aturan pada hari Sabat} mereka melampaui batas dengan memancing pada hari sabtu yaitu diharamkan atas mereka{ketika datang kepada mereka ikan-ikan mereka pada hari sabat} pada hari mereka mengagungkan yang diperintahkan pada hari sabat {bermunculan di permukaan air} muncul di permukaan air {Pada hari-hari yang bukan Sabat} di hari-hari selain hari sabat {ikan-ikan itu tidak datang kepada mereka. Demikianlah Kami menguji mereka} menguji mereka {karena mereka selalu berlaku fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "163. ”dan tanyakanlah kepada bani israil tentang negeri yang terletak di dekat laut” di pantai ketika mereka melanggar dan Allah menghukum mereka “ketika mereka melanggar pada hari sabtu” padahal Allah telah memerintahkan mereka agar menghormatinya dan mengagungkannya dengan tidak menangkap ikan pada hari itu, lalu Allah menguji mereka, dimana hari sabtu ikan-ikan besar muncul di permukaan laut dalam jumlah yang banyak. ”dan di hari hari yang bukan sabtu” yakni jika hari sabru “ikan–ikan itu tidak datang kepada mereka” yakni ia menghilang dan tidak melihat seekorpun “Demikianlah kami mencoba mereka disebabkan mereka berlaku fasik” kefasikan mereka yang menyebabkan Allah menguji mereka dengan ujian tersebut karena jika mereka tidak demikian niscaya Allah membebaskan mereka dan tidak menimpakan ujian dan keburukan kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 163: Sebagai celaan untuk mereka. Yaitu kota Eliah yang terletak di pantai laut merah antara kota Madyan dan bukit Thur. Menurut aturan itu, mereka tidak boleh bekerja pada hari Sabtu, karena hari Sabtu dikhususkan untuk beribadah, namun mereka malah menjaring ikan pada hari itu dengan meletakkan jaringnya di sana. Sikap mereka yang selalu berbuat fasik itulah yang menyebabkan mereka mendapatkan ujian tersebut. Ikan-ikan datang kepada mereka pada hari Sabtu, sedangkan pada hari-hari yang lain tidak datang, maka mereka mensiasatinya dengan membuat galian, lalu meletakkan jaring padanya. Ketika tiba hari Sabtu dan ikan-ikan terjaring ke dalamnya, mereka tidak mengambilnya pada hari itu, pada hari Ahadlah mereka mengambilnya sebagai helat mereka (sikap cari celah dan kesempatan). Kemudian perbuatan itu banyak dilakukan pula oleh yang lain sehingga keadaan mereka terbagi menjadi tiga golongan; (1) golongan yang ikut membuat galian dan meletakkan jaring, (2) golongan yang melarang, dan (3) golongan yang tidak menjaring dan tidak melarang (atau merasa cukup dengan nahi mungkar oleh selain mereka). Golongan yang ketiga inilah yang berkata kepada golongan kedua yang melakukan nahi mungkar (lihat ayat selanjutnya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 163",
    "description": "Nikmat berikutnya adalah nikmat melimpahnya ikan buat mereka di hari ibadah. Dan tanyakanlah wahai nabi Muhammad, yakni kepada mereka orang-orang yahudi yang hidup pada masamu tentang kisah penduduk negeri yang terletak di dekat laut, yaitu kota ailah yang terletak di pantai laut merah, atau tepatnya di teluk aqabah, ketika mereka melanggar aturan Allah pada hari sabat, yang menurut aturan mereka merupakan hari yang dikhususkan untuk ibadah dan terlarang untuk bekerja dan mencari ikan, yaitu ketika datang kepada mereka ikan-ikan yang berada di sekitar mereka yang bagaikan terapung-apung di permukaan air, padahal pada hari-hari yang bukan sabat ikan-ikan itu tidak datang kepada mereka. Demikianlah kami menguji mereka disebabkan mereka sering kali berlaku fasik, keluar dari ketaatan kepada alla setelah menjelaskan keadaan para pendurhaka itu, ayat ini menguraikan sikap orang-orang yang sebelum ini pada ayat 159 telah disinggung, yaitu umat nabi musa yang memberi petunjuk kepada kebenaran. Ayat ini menyatakan, dan ingatlah ketika suatu umat di antara mereka, yaitu tatkala sekelompok orang-orang saleh dari leluhur bani israil'yang tidak berbuat jahat seperti yang lainnya'bertanya kepada mereka yang menasihati orang-orang yang berbuat jahat dengan berkata, mengapa kamu bersusah payah menasihati kaum yang akan dibinasakan sehingga punah sama sekali karena dosa yang mereka lakukan, atau diazab oleh Allah di akhirat nanti dengan azab yang sangat keras' mereka menjawab, kami melakukan itu agar kami mempunyai alasan dan pelepas tanggung jawab kepada tuhanmu, dan sebenarnya kami berharap agar mereka bertakwa. Alasan mereka itu ialah mereka telah melaksanakan perintah Allah untuk memberi peringatan."
  }
]