[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika sekelompok orang dari mereka berkata kepada sekelompok lain yang tengah menasihati orang-orang yang berbuat melampaui batas pada hari sabtu dan melarang mereka dari perbuatan maksiat kepada Allah pada hari itu, ”mengapa kalian menasihati satu kaum yang Allah akan membinasakan mereka di dunia akibat perbuatan maksiat mereka kepadaNya atau akan menyiksa mereka dengan siksaan yang pedih di akhirat kelak?” maka berkatalah orang-orang yang melarang mereka terhadap perbuatan maksiat kepada Allah, ”kami menasihati mereka dan melarang mereka, supaya kami memiliki alasan (untuk bebas dari tanggung jawab) terkait mereka dan menjalankan kewajiabn yang Allah tetapkan atas kami untuk melakukan amr ma’ruf dan nahi mungkar, dan demi berharap mereka itu akan bertakwa kepada Allah, lalu takut kepadaNYa dan bertaubat dari maksiat mereka kepada tuhan mereka dan tiindakan mereka yang melampaui batas yang telah Allah haramkan atas mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "164. Dan ingatlah -wahai Rasul- ketika ada sekelompok orang dari mereka yang melarang mereka melakukan perbuatan terlarang itu kemudian ada kelompok lain yang berkata kepada mereka, “Mengapa kalian menasihati sekelompok orang yang akan dibinasakan oleh Allah di dunia akibat perbuatan maksiat yang mereka lakukan, atau akan menimpakan azab yang berat kepada mereka di hari Kiamat?” Kelompok yang memberi nasihat menjawab, “Nasihat yang kami berikan kepada mereka adalah alasan yang akan kami ajukan kepada Allah bahwa kami telah melaksanakan perintah-Nya, yaitu melakukan amar makruf nahi mungkar, sehingga kami tidak dihukum oleh-Nya karena dianggap melalaikan perintah itu. Dan barangkali saja mereka mau menerima nasihat itu kemudian mereka meninggalkan perbuatan maksiat itu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "164. Maka ketika itu penduduk negeri ini terbagi menjadi tiga golongan: Golongan yang melanggar hukum Allah dengan sengaja, golongan yang menasehati orang-orang yang melanggar agar bertaubat, dan golongan yang mengolok golongan yang memberi nasehat karena telah putus asa dalam menasehati mereka. Golongan ketiga ini berkata: “Untuk apa kalian menasehati orang-orang yang tidak berguna lagi nasehat dan peringatan bagi mereka; padahal Allah telah menetapkan untuk membinasakan mereka dan membersihkan bumi dari mereka, atau mengazab mereka dengan azab yang berat, sebagai balasan atas kebebalan mereka dalam keburukan dan keengganan mereka mendengar nasehat.” Maka golongan yang menasehati menjawab dengan dua alasan: pertama, sebagai alasan di depan Allah terhadap kewajiban menyuruh perbuatan baik dan melarang perbuatan munkar. Kedua, harapan agar mereka berubah dan menerima nasehat sehingga mereka dapat selamat dari siksaan dan mengikuti jalan orang-orang yang mendapat petunjuk. Inilah tujuan utama dalam melarang perbuatan mungkar; sebagai hujjah dan alasan telah melakukan amar ma’ruf dan nahi mungkar, dan harapan Allah akan memberi mereka hidayah sehingga mau mentaati perintah dan larangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "164. وَإِذْ قَالَتْ أُمَّةٌ (Dan (ingatlah) ketika suatu umat di antara mereka berkata) Yakni sekelompok penduduk desa yang sholeh berkata kepada kelompok yang lain. Yakni orang-orang yang bersungguh-sungguh menasehati orang-orang yang melanggar aturan hari sabtu ketika mereka telah putus asa dalam mengharap penerimaan mereka atas nasehat dan berhenti dari kemaksiatan. لِمَ تَعِظُونَ قَوْمًا ۙ اللهُ مُهْلِكُهُمْ (Mengapa kamu menasehati kaum yang Allah akan membinasakan mereka) Yakni melenyapkan mereka semua dengan siksaan. أَوْ مُعَذِّبُهُمْ عَذَابًا شَدِيدًا ۖ (atau mengazab mereka dengan azab yang amat keras?) Karena telah melanggar larangan dan berlarut-larut dalam perbuatan maksiat dengan membuat siasat yang telah terbongkar. قَالُوا۟ مَعْذِرَةً إِلَىٰ رَبِّكُمْ (mereka menjawab: “Agar kami mempunyai alasan (pelepas tanggung jawab) kepada Tuhanmu) Yakni para pemberi nasehat menjawab: nasehat yang kami berikan kepada mereka adalah sebagai alasan di hadapan Allah agar tidak menghukum kami disebabkan tidak menjalankan amar ma’ruf nahi mungkar yang diwajibkan atas kami. وَلَعَلَّهُمْ يَتَّقُونَ (dan supaya mereka bertakwa) Berhenti dari kemaksiatan mereka. Ayat ini menunjukkan bahwa Bani Israil terbagi menjadi tiga kelompok: kelompok yang bermaksiat dan menangkap ikan di hari sabtu, kelompok yangtidak bermaksiat dan tidak berburu ikan namun tidak melarang kelompok yang berburu, dan kelompok yang tidak bermaksiat dan tidak berburu ikan dan mereka melarang orang yang berburu ikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "164. Dan ingatlah juga wahai Nabi ketika suatu golongan dari penduduk negeri itu berkata kepada orang-orang shalih yang memberi nasehat bahwa mereka tidak dilarang untuk melaut: “Kenapa kalian menasehati kaum, sedangkan Allah akan membinasakan mereka di dunia, atau akan memberi mereka azab yang sangat berat di akhirat?” Para pemberi nasehat itu berkata: “Nasehat kami adalah suatu permohonan maaf yang kami mohonkan kepada Allah, agar kita leluasa meninggalkan sesuatu yang dilarang, yaitu supaya kita dimaafkan di sisi Allah dengan menunaikan kewajiban kita” dan supaya mereka bertakwa kepada Allah, lalu menghindari perbuatan maksiat yang bisa mereka kerjakan dan tidak melaut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika suatu umat} kelompok {di antara mereka berkata,“Mengapa kalian menasihati kaum yang akan dibinasakan atau disiksa Allah dengan azab yang sangat keras” Mereka menjawab,“Agar mempunyai alasan kepada Tuhan kalian} kami memberi mereka alasan dari kami kepada Allah, supaya kami tidak dihubungkan dengan kelalaian (mereka) terhadap perintahNya yang melarang kemungkaran {dan agar mereka bertakwa.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "164 namun mereka tetap berburu dengan membuat tipuan, mereka menggali lubang-lubang dan memasang jarring-jaring, jika hari sabtu tiba, maka ikan ikan itu tertangkap kedalam lubang lubang dan jaring-jaring tersebut tetapi mereka tidak mengambil nya pada hari itu, jika hari ahad tiba, maka mereka mengambilnya dan hal itu sering terjadi pada mereka. Mereka terbagi pada tiga kelompok. mayoritas dari mereka tidak mengindahkan dan mereka melanggar secara terang-terangan, kelompok kedua melarang dan mengingkari perbuatn kelompok mayoritas. dan kelompok ketiga merasa cukup dengan apa yang dilakukan oleh kelompok ke dua berupa pengingkaran mereka dan pelarangan mereka kepada kelompok pertama. kelompk ini berkata ”mengapa kamu menasihati kaum yang Allah akan membinaskan mereka atau mengazab mereka dengan azab yang amat keras?\" Sepertinya mereka berkata: tidak ada gunanya menasihati orang yang melanggar larangan Allah dan tidak menghiraukan nasihat yang tulus, tetapi justru tetap teguh di dalam pelanggaran dan kezhaliman, karena Allah pasti akan menghukum mereka, baik dengan kebinasaan atau dengan azab yang pedih. ”orang orang yang memberi nasihat menjawab” kami melarang dan menasihati mereka” agar kami mempunyai alasan (pelepas tanggung jawab) kepada Rabbmu\" yakni agar kami dimaafkan berkenaan dengan apa yang mereka lakukan “dan supaya mereka bertakwa” yakni mereka meninggalkan kemaksiatan yang mereka lakukan. Maka kami tidak berputus asa dari usaha memberi petunjuk kepada mereka, bisa jadi nasihat kami mujarab pada mereka, larangan kami didengar oleh mereka, dan inilah tujuan terbesar dari pengingkaran terhadap kemungkaran, agar ia berfungsi sebagai alasan dan penegakan hujjah atas yang diperintah dan yang dilarang, dan semoga Allah memberinya petunjuk lalu dia melaksanakan tuntutan dari perintah dan larangan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 164: Yakni yang tidak melakukan penjaringan ikan dan tidak melarang. Kepada mereka yang melarang. Alasan mereka adalah bahwa mereka telah melaksanakan perintah Allah untuk memberi peringatan dan agar mereka tidak digolongkan sebagai orang yang membiarkan kemungkaran. Inilah tujuan utama melakukan nahi mungkar, sebagai alasan kepada Allah, menegakan hujjah, dan boleh jadi Allah memberinya petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 164",
    "description": "Setelah menjelaskan keadaan para pendurhaka itu, ayat ini menguraikan sikap orang-orang yang sebelum ini pada ayat 159 telah disinggung, yaitu umat nabi musa yang memberi petunjuk kepada kebenaran. Ayat ini menyatakan, dan ingatlah ketika suatu umat di antara mereka, yaitu tatkala sekelompok orang-orang saleh dari leluhur bani israil'yang tidak berbuat jahat seperti yang lainnya'bertanya kepada mereka yang menasihati orang-orang yang berbuat jahat dengan berkata, mengapa kamu bersusah payah menasihati kaum yang akan dibinasakan sehingga punah sama sekali karena dosa yang mereka lakukan, atau diazab oleh Allah di akhirat nanti dengan azab yang sangat keras' mereka menjawab, kami melakukan itu agar kami mempunyai alasan dan pelepas tanggung jawab kepada tuhanmu, dan sebenarnya kami berharap agar mereka bertakwa. Alasan mereka itu ialah mereka telah melaksanakan perintah Allah untuk memberi peringatan. Nasihat yang berkelanjutan pada ayat-ayat terdahulu bertujuan mengantar para pendurhaka itu sadar dan bertakwa, tetapi ternyata mereka tetap lengah dan lupa. Maka setelah mereka golongan yang diberi nasihat melupakan, yakni mengabaikan, apa yang diperingatkan kepada mereka dan tidak juga mendengarkan nasihat itu, kami selamatkan orang-orang yang terus menerus melarang orang berbuat jahat dan tidak melakukan kejahatan dan kami timpakan kepada orang-orang yang zalim, antara lain kepada mereka yang mengail ikan pada hari sabat, siksaan yang keras, dalam bentuk kesengsaraan dan kemelaratan. Hal itu disebabkan mereka selalu berbuat fasik, tidak mau taat kepada Allah, tuhan mereka."
  }
]