[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika orang-orang yang melampaui batas pada hari sabtu mengabaikan peringatan yang tertuju pada mereka dan tetap berjalan di atas penyelewengan dan tindakan melampaui batas di dalam hari itu, serta tidak menerima ajakan golongn yang menyampaikan nasihat, Allah menyelamatkan orang-orang yang melarang (orang lain) berbuat maksiat kepadaNYa, dan menyiksa orang-orang yang berlaku melampaui batas pada hari sabtu itu dengan siksaan pedih lagi dahsyat, disebabkan oleh pelanggaran mereka terhadap perintah Allah dan keluarnya mereka dari ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "165. Kemudian tatkala orang-orang yang durhaka itu menolak peringatan yang diberikan oleh kelompok pemberi nasihat itu dan tidak mau menghentikan kemaksiatan mereka, maka Kami selamatkan kelompok yang mencegah perbuatan mungkar tersebut dari azab Kami dan Kami hukum kelompok yang menganiaya diri mereka sendiri dengan melakukan penangkapan ikan di hari Sabtu itu dengan azab yang sangat berat. Karena mereka tidak taat kepada Allah dan bersikeras mempertahankan kemaksiatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "165. Kemudian Allah menjelaskan ketika orang-orang zalim itu telah tenggelam dalam kedurhakaan dan enggan menerima nasehat: Kami selamatkan orang-orang yang menyampaikan nasehat, dan Kami azab orang-orang yang durhaka dengan azab yang keras tanpa ampun, akibat pelanggaran mereka terhadap perintah-perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "165. فَلَمَّا نَسُوا۟ مَا ذُكِّرُوا۟ بِهِۦٓ أَنجَيْنَا الَّذِينَ يَنْهَوْنَ عَنِ السُّوٓءِ (Maka tatkala mereka melupakan apa yang diperingatkan kepada mereka, Kami selamatkan orang-orang yang melarang dari perbuatan jahat) Yakni saat penduduk negeri yang bermaksiat meninggalkan nasehat orang-orang shalih yang melarang kemungkaran. وَأَخَذْنَا الَّذِينَ ظَلَمُوا۟( dan Kami timpakan kepada orang-orang yang zalim) Mereka adalah orang-orang yang bermaksiat dengan melanggar larangan hari sabtu. بِعَذَابٍۭ بَـِٔيسٍۭ (siksaan yang keras) Yakni azab yang keras. بِمَا كَانُوا۟ يَفْسُقُونَ (disebabkan mereka selalu berbuat fasik) Yakni karena mereka meninggalkan perintah Allah dengan pergi berburu dan melakukan hal-hal lain di hari sabtu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "'Ikrimah menceritakan : \"Pada suatu hari aku pernah datang kepada Ibnu Abbas. Saat itu Ibnu Abbas sedang menangis, dan ternyata ia sedang memegang mushaf di pangkuannya. Maka aku memberanikan diri untuk maju dan duduk di dekatnya, lalu aku bertanya, 'Hai Ibnu Abbas, apakah yang membuatmu menangis? Semoga Allah menjadikan diriku sebagai tebusanmu.' Ibnu Abbas menjawab, 'Karena lembaran-lembaran ini'.\" Ternyata lembaran-lembaran yang dimaksud adalah surat Al-A'raf. Lalu Ibnu Abbas menceritakan kisah kaum Yahudi tatkala mereka kembali pada hari sabtu untuk mengambil ikan-ikan mereka, lalu Ibnu Abbas berkata : kemudian suatu golongan dari mereka melanggar aturan itu dan mengambil ikan-ika itu, dan orang-orang dari golongan kanan berlepas diri dan mengingkari perbutan golongan pelanggar itu, begitu juga dari golongan kiri berlepas diri dan mereka membiarkan golongan pelanggar itu berbuat.. Kemudian Ibnu Abbas membaca satu ayat : { فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ أَنْجَيْنَا الَّذِينَ يَنْهَوْنَ عَنِ السُّوءِ وَأَخَذْنَا الَّذِينَ ظَلَمُوا بِعَذَابٍ بَئِيسٍ } \"Maka tatkala mereka melupakan apa yang diperingatkan kepada mereka, Kami selamatkan orang-orang yang melarang dari perbuatan jahat dan Kami timpakan kepada orang-orang yang zalim siksaan yang keras\" kemudian Ibnu Abbas melanjutkan : maka golongan yang telah melarang pelanggaran itu melihat bahwa diri mereka telah selamat dari ancaman ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "165 Maka tatkala orang-orang ahli maksiat negeri itu melupakan apa yang diperingatkan kepada mereka, dan mereka tidak henti-henti membangkang, maka Kami selamatkan orang-orang yang melarang dari perbuatan jahat serta buruk akibatnya yaitu dua kelompok lainnya: Yaitu mereka yang melarung namun mereka melakukan sendiri dan yang terus menerobos larangan. Lalu Kami timpakan siksaan yang keras kepada orang-orang yang zalim pada hari Sabtu, disebabkan mereka selalu berbuat kemaksiatan, fasik, dan enggan melakukan ketaatan kepada Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika mereka melupakan apa yang diperingatkan kepada mereka} mereka mengabaikan apa yang diperingatkan untuk mereka {Kami menyelamatkan orang-orang yang mencegah keburukan} kemungkaran {dan Kami menimpakan kepada orang-orang zalim azab yang keras} keras {karena mereka selalu berbuat fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "165 “maka tatkala mereka melupakan apa yang diperintah kepada mereka” mereka meninggalkan apa yang diperingatkan kepada mereka dan mereka terus berjalan diatas pelanggaran dan kesesatan. ”kami selamatkan orang-orang yang melarang dari perbuatan jahat” begitulah sunnah Allah pada hamba-hambaNYa, bahwa jika azab telah turun, maka yang selamat adalah orang-orang yang beramar ma’ruf dan bernahi mungkar. ”dan kami timpakan kepada orang-orang yang zhalim” yaitu orang-orang yang melanggar pada hari sabtu “siksaan yang keras, disebabkan selalu berbuat fasik” adapun kelompok yang lain yang berakata kepada orang-orang yang melarang “mengapa kamu menasihati kaum yang Allah akan membinasakan mereka” maka ahli tafsir berbeda pendapat tentang apakah mereka selamat atau tidak, dan sepertinya mereka itu selamat karena Allah mengkhususkan kebinasaan bagi orang-orang yang zhalim. ini menunjukan bahwa azab hanya menimpa orang orang yang melanggar di hari sabtu saja. Di samping itu amar ma’ruf nahyi munkar adalah fardhu kifayah jika ia telah ditunaikan oleh sebagian orang maka ia gugur dari sebagian yang lain maka mereka merasa cukup dengan pengingkaran orang-orang yang mengingkari dan karena sebenarnya mereka juga mengingkari dengan ucapan mereka, ”mengapa kamu menasihati kaum yang Allah akan membinasakan mereka atau mengazab mereka dengan azab yang amat keras?” mereka menampakkan kemarahan kepada orang-orang zhalim itu menunjukan bahwa mereka sangat membenci perbuatan mereka dan bahwa Allah akan mengazab mereka atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 165: Inilah Sunatullah, yakni bahwa hukuman ketika turun, yang selamat biasanya orang-orang yang melakukan amar ma’ruf dan nahi mungkar. Namun apakah golongan yang tidak melakukan penjaringan ikan tetapi tidak mengingkari ikut selamat? Para mufassir berbeda pendapat, zhahirnya bahwa mereka ikut selamat, karena Allah mengkhususkan hukuman itu kepada orang-orang yang zalim, sedangkan Allah tidak menyebut golongan yang ketiga sebagai zalim, oleh karenanya hukuman itu khusus menimpa orang-orang yang melanggar aturan pada hari Sabat, di samping itu amar ma’ruf dan nahi mungkar hukumnya fardhu kifayah, jika suda ada yang melakukannya maka bagi yang lain menjadi gugur, oleh karenanya mereka mencukupkan diri dengan pengingkaran oleh yang lain. Demikian juga mereka mengingkari dengan hatinya berdasarkan kata-kata, \"Mengapa kamu menasehati kaum yang akan dibinasakan atau diazab Allah dengan azab yang sangat keras?\" di mana mereka juga membenci perbuatan itu dan menampakkan marahnya dengan kata-kata itu"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 165",
    "description": "Nasihat yang berkelanjutan pada ayat-ayat terdahulu bertujuan mengantar para pendurhaka itu sadar dan bertakwa, tetapi ternyata mereka tetap lengah dan lupa. Maka setelah mereka golongan yang diberi nasihat melupakan, yakni mengabaikan, apa yang diperingatkan kepada mereka dan tidak juga mendengarkan nasihat itu, kami selamatkan orang-orang yang terus menerus melarang orang berbuat jahat dan tidak melakukan kejahatan dan kami timpakan kepada orang-orang yang zalim, antara lain kepada mereka yang mengail ikan pada hari sabat, siksaan yang keras, dalam bentuk kesengsaraan dan kemelaratan. Hal itu disebabkan mereka selalu berbuat fasik, tidak mau taat kepada Allah, tuhan mereka. Setelah menjelaskan ancaman siksa dan kebinasaan untuk para pendurhaka, pada ayat ini Allah menguraikan tentang kebinasaan mereka, maka setelah mereka bersikap amat sombong dan melampaui batas terhadap segala apa yang dilarang, dan hati mereka semakin keras membatu, mereka terus melakukan berbagai pelanggaran, sementara azab yang pedih tidak membuat mereka jera. Lalu kami katakan kepada mereka, jadilah kamu kera yang hina, lagi terkutuk. Allah jadikan mereka seperti layaknya kera. Hati mereka berubah seperti kera yang tak dapat memahami kebenaran, dan'seperti halnya kera'mereka pun dijauhkan dari berbagai bentuk kebaikan. Atau boleh jadi, mereka betul-betul menjadi kera yang hina."
  }
]