[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika tuhanmu memberitahukan dengan pemberitahuan yang tegas bahwa Dia akan benar-benar mengirim kepada kaum yahudi orang yang akan menimpakan pada mereka siksaan buruk dan kehinaan hingga hari kiamat. Sesungguhnya tuhanmu (wahai rosul) benar-benar amat cepat siksaanNya bagi orang yang berhak mendapatkannya dikarenakan kekafiran dan perbuatan maksiatnya. Dan sesungguhnya Dia maha pengampun dosa-dosa orang-orang yang bertaubat lagi maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "167. Dan ingatlah -wahai Rasul- tatkala Allah memberikan informasi yang sangat jelas dan tidak diragukan lagi bahwa Dia benar-benar mengirimkan orang yang akan menghinakan dan menistakan orang-orang Yahudi selama hidup mereka di dunia ini sampai hari Kiamat. Sesungguhnya Rabbmu -wahai Rasul- benar-benar Mahacepat hukuman-Nya bagi orang yang durhaka kepada-Nya. Bahkan terkadang Dia menyegerakan hukuman bagi orang tersebut di dunia. Dan Dia Maha Pengampun dosa-dosa hamba-hamba-Nya yang bertobat kepada-Nya lagi Maha Penyayang bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "167. Dan siksaan lain yang Allah berikan kepada Bani Israil adalah siksaan yang Allah sampaikan kepada Nabi Muhammad, bahwa orang-orang Yahudi dan para pendahulunya itu jika mengubah perintah Allah dan tidak beriman kepada para nabi mereka, maka Allah akan menjadikan mereka dikuasai bangsa lain hingga hari kiamat yang menyiksa mereka dengan siksaan yang buruk berupa penindasan, pengambilan harta jizyah, dan siksaan lainnya. Sesungguhnya Allah Maha Cepat siksaan-Nya bagi orang yang kafir dan menyelisihi jalan kebenaran; dan Maha Pengampun dan Penyayang bagi orang yang bertaubat, beriman, dan beramal shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "167. وَإِذْ تَأَذَّنَ رَبُّكَ (Dan (ingatlah), ketika Tuhanmu memberitahukan) Dengan kabar yang jelas. لَيَبْعَثَنَّ عَلَيْهِمْ (bahwa sesungguhnya Dia akan mengirim kepada mereka) Untuk menguasai Bani Israil. إِلَىٰ يَوْمِ الْقِيٰمَةِ مَن يَسُومُهُمْ سُوٓءَ الْعَذَابِ ۗ (sampai hari kiamat orang-orang yang akan menimpakan kepada mereka azab yang seburuk-buruknya) Yakni musuh-musuh mereka untuk berkuasa atas bani Israil. Dan mereka terus dalam keadaan hina, lemah, dan tersiksa dibawah kekuasaan umat-umat lain dan harus membayar jizyah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "167 Ingatlah wahai Nabi, ketika Tuhanmu memberitahukan sesuatu secara zahir bahwa sesungguhnya Dia akan mengirim kepada orang-orang Yahudi orang-orang yang akan menimpakan azab yang seburuk-buruknya kepada mereka sampai hari kiamat. Sesungguhnya Tuhanmu amat cepat siksa-Nya, dan sesungguhnya Dia adalah Maha Pengampun lagi Maha Penyayang bagi orang-orang yang menaatiNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan (Ingatlah) ketika Tuhanmu memberitahu} memberitahu {bahwa sungguh Dia akan mengutus kepada mereka} memberi kuasa atas orang-orang Yahudi {orang yang akan menimpakan kepada mereka} membuat mereka merasakan {seburuk-buruk azab sampai hari kiamat. Sesungguhnya Tuhanmu sangat cepat hukumanNya dan sesungguhnya Dia Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "167 kemudian Allah menyebutkan kehinaan dan kenistaan yang menimpa orang-orang yang tersisa dari mereka. Dia berfirman ”dan (ingatlah) ketika Rabbmu memberitahukan” dengan pemberitahuan yang jelas, ”bahwa sesungguhnya dia akan mengirim kepada mereka (orang-orang yahudi) sampai hari kiamat orang-orang yang akan menimpakan kepada mereka azab yang seburuk buruknya” yakni yang hina dan merendahkan mereka. ”sesungguhnya Rabbmu amat cepat siksaanNya” kepada orang yang mendurhakaiNya, bahwa Dia bisa menyegerakan hukuman di dunia kepadanya ”dan sesungguhnya Dia maha Pengampun lagi maha penyayang” bagi yang kembali dan bertaubat kepadaNYa. Dia mengampuni dosanya dan menutupi aib-aibnya, menyayanginya dengan menerima ketaatan dan membalasnya dengan berbagai macam balasan. Allah telah merealisasikan janjiNya pada mereka, maka mereka selalu dalam kehinaan dan kerendahan dijajah oleh bangsa lain, tidak ada panji dan bendera mereka yang tegak dengan kokoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 167: Seperti kehinaan dan kerendahan, termasuk pula kewajiban membayar jizyah (pajak). Demikianlah keadaan mereka, Allah mengirimkan kepada mereka Nabi Sulaiman, setelahnya Raja Bukhtanasshir yang membunuh dan menawan mereka serta menetapkan mereka untuk membayar pajak yang mereka serahkan kepada orang-orang Majusi sampai diutusnya Nabi kita Muhammad shallallahu 'alaihi wa sallam, dan Beliau menetapkan pemungutan pajak dari mereka. Mereka senantiasa dalam kehinaan dan di bawah kekuasaan orang lain. Kepada orang yang bermaksiat, sehingga Allah menyegerakan hukuman kepadanya di dunia. Kepada orang yang bertobat dan taat kepada-Nya. Dia akan mengampuni dosa-dosa itu, menutupi aiab-aibnya, dan merahmatinya dengan menerima ketaatan mereka dan memberinya balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 167",
    "description": "Begitulah siksa dan kebinasaan yang dialami oleh sebagian kelompok bani israil. Siksa itu akan terus berlanjut selama mereka dalam kedurhakaan. Memerintahkan hal-hal yang perlu diingat, Allah menyatakan, dan ingatlah, ketika tuhanmu wahai nabi Muhammad memberitahukan melalui para nabi-Nya, kepada nenek moyang mereka bahwa sungguh, dia yang mahakuasa itu akan mengirim dari suatu tempat orang-orang yang akan menimpakan azab yang seburuk-buruknya kepada mereka, yaitu orang yahudi yang durhaka, sampai hari kiamat karena mereka telah berbuat zalim dan fasik. Sesungguhnya tuhanmu sangat cepat siksa-Nya, terhadap orang-orang kafir dan siksa itu pasti terlaksana dalam waktu dekat, sebab setiap sesuatu yang bakal terjadi itu sebenarnya telah dekat. Dan meski demikian, sesungguhnya dia juga maha pengampun bagi siapa pun yang memohon ampunan-Nya dan maha penyayang bagi mereka yang bertobat dan kembali menaati-Nya. Ayat sebelum ini menginformasikan bahwa Allah telah menetapkan mereka akan disiksa sampai hari kiamat, pada ayat ini dijelaskan bagaimana orang-orang yahudi itu dipencar-pencar di berbagai belahan bumi. Dan kami pecahkan, cerai-beraikan dan kelompokkan mereka orang-orang yahudi di dunia ini, sehingga mereka menjadi beberapa golongan; namun demikian mereka tidak juga berbuat baik. Di antaranya ada orang-orang yang saleh, yaitu mereka yang beriman dan konsisten dengan keimanannya itu, atau mengikuti tuntunan nabi musa dan kemudian masuk islam setelah kedatangan nabi Muhammad; dan ada juga di antara mereka yang tidak demikian, yakni yang kafir dan durhaka. Dan kami telah dan pasti akan uji mereka dengan jalan memberi nikmat dan berbagai hal yang baik-baik dan bencana atau berbagai hal yang buruk-buruk, agar mereka kembali kepada kebenaran, bertobat dan menyesali pelanggaran-pelanggaran yang mereka lakukan."
  }
]