[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami membagi-bagi bani israil di bumi in menjadi beberapa golongan. Diantara mereka ada golongan orang-orang yang menjalankan hak-hak Allah dan hak-hak hamba-hambaNya. Dan diantara mereka ada golongan yang tidak berbuat banyak kebaikan lagi berbuat zhalim kepada diri mereka, dan kami menguji mereka dengan kenyamanan dalam hidup dan kelapangan dalam rizki, sebagiamana kami juga menguji mereka dengan kesengsaraan dalam hidup, bencana-bencana, dan kesulitan-kesulitan lainnya, demi berharap mereka kembali kepada kataatan kepada tuhan mereka dan bertaubat dari perbuatan-perbuatan maksiat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "168. Kami cerai-beraikan mereka di muka bumi dan Kami cabik-cabik mereka di sana menjadi beberapa golongan setelah sebelumnya mereka bersatu padu. Di antara mereka ada orang-orang saleh yang menjalankan hak-hak Allah dan hak-hak sesama makhluk. Di antara mereka ada pula orang-orang yang bersikap pertengahan. Dan di antara mereka ada orang-orang yang melampaui batas terhadap diri sendiri dengan berbuat maksiat. Dan Kami beri mereka ujian berupa kemudahan dan kesulitan agar mereka menyadari kesalahan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "168. Ini merupakan pengabaran tentang siksaan lain yang diberikan kepada mereka akibat kekafiran dan keingkaran mereka. Siksaan ini berupa pemisahan mereka ke berbagai penjuru bumi dan menjadikan mereka terpecah belah sehingga mereka tidak memiliki kekuatan. Orang-orang Yahudi itu telah Kami pecah belah di muka bumi akibat kemaksiatan dan kefasikan mereka, dan Kami jadikan mereka golongan-golongan yang berbeda-beda tujuannya dan tidak saling mengenal. Dan sebagai bentuk penyampaian kebenaran, Allah berfirman bahwa dari orang-orang Yahudi itu terdapat sekelompok kecil yang beriman kepada Allah, para malaikat, kitab-kitab-Nya, para rasul-Nya, dan hari akhir; kehidupan mereka baik dan memiliki kesudahan yang baik. Adapun mayoritas orang-orang Yahudi itu tidak seperti orang-orang beriman dan shalih tersebut karena mereka menyelisihi perintah Allah dan melanggar larangan-Nya. Allah memperlakukan mereka dengan berbagai ujian dan cobaan; terkadang Allah menguji mereka dengan kenikmatan yang banyak, seperti kesehatan, kemakmuran, dan kelapangan rezeki; dan terkadang dengan berbagai siksaan dan musibah. Hal ini agar mereka kembali mentaati Tuhan mereka dan meninggalkan kemaksiatan dan keburukan yang Allah larang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "168. وَقَطَّعْنٰهُمْ فِى الْأَرْضِ أُمَمًا ۖ (Dan Kami bagi-bagi mereka di dunia ini menjadi beberapa golongan) Sehingga tidak ada negeri dari seluruh negeri yang ada di dunia kecuali terdapat sekelompok dari orang-orang Bani Israil. مِّنْهُمُ الصّٰلِحُونَ (di antaranya ada orang-orang yang saleh) Mereka adalah orang-orang yang beriman kepada Nabi Muhammad dan meninggal dunia sebelum ia diutus dan mereka tidak merubah keyakinan mereka. وَمِنْهُمْ دُونَ ذٰلِكَ ۖ( dan di antaranya ada yang tidak demikian) Yakni selain dari golongan pertama dalam kebaikan. وَبَلَوْنٰهُم بِالْحَسَنٰتِ وَالسَّيِّـَٔاتِ(Dan Kami coba mereka dengan (nikmat) yang baik-baik dan (bencana) yang buruk-buruk) Yakni mereka Kami uji dengan kebaikan dan keburukan, keamanan dan ketakutan, serta kesejahteraan dan mala petaka agar mereka bertaubat dari kekafiran dan kemasiatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "168 Kami jadikan mereka di dunia ini menjadi beberapa golongan, tidak ada satu kelompokpun yang memiliki pemahaman sendiri. Di antara mereka adalah orang-orang yang shalih: mereka adalah orang-orang yang beriman dan istiqamah, dan beberapa di antara mereka ada yang keistiqamahannya tidak seperti orang-orang sebelum mereka, mereka adalah orang-orang kafir dan fasik. Kami coba mereka dengan yang baik-baik dengan kenikmatan, keamanan, dan kesejahteraan satu waktu. Juga Kami coba dengan hal yang buruk-buruk seperti amarah, ketakutan, dan kesempitan di waktu yang lain, agar mereka kembali dari kemaksiatan, kesesatan dan kekafiran kepada kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami membagi mereka} memisahkan kepada mereka {di bumi menjadi beberapa umat} golongan-golongan dan kelompok {Di antara mereka ada orang-orang yang shalih dan ada yang tidak. Kami menguji mereka} Kami menguji mereka {dengan berbagai kebaikan} kesejahteraan dan kesehatan {dan keburukan} kesulitan dan cobaan {agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168 “dan kami bagi-bagi mereka di dunia ini menjadi beberapa golongan” yakni kami memecah dan mencerai beraikan mereka setelah sebelumnya mereka berkumpul ”diantaranya ada orang-orang yang sholeh\" yang melaksanakan hak-hak Allah dan hak-hak hamba-hambaNYa ”dan diantaranya ada yang tidak demikian” yakni dibawah yang pertama, bisa jadi mereka adalah orang-orang pertengahan dan bisa pula orang-orang yang menzhalimi diri mereka. ”dan kami coba mereka” berdasarkan kebiasaan dan sunnah kami “dengan nikmat yang baik-baik dan bencana yang buruk-buruk” yakni dengan kemudahan dan kesulitan ”agar mereka kembali kepada kebenaran” dari kesesatan dimana mereka berada di dalamnya dan mereka berpegang kepada petunjuk yang karenanya mereka diciptakan. diantara mereka selalu ada orang yang baik, tengah tengah, dan yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 168: Setelah sebelumnya mereka berkumpul. Yang memenuhi hak Allah dan hak hamba. Keadaannya ada yang pertengahan dan ada pula yang zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 168",
    "description": "Ayat sebelum ini menginformasikan bahwa Allah telah menetapkan mereka akan disiksa sampai hari kiamat, pada ayat ini dijelaskan bagaimana orang-orang yahudi itu dipencar-pencar di berbagai belahan bumi. Dan kami pecahkan, cerai-beraikan dan kelompokkan mereka orang-orang yahudi di dunia ini, sehingga mereka menjadi beberapa golongan; namun demikian mereka tidak juga berbuat baik. Di antaranya ada orang-orang yang saleh, yaitu mereka yang beriman dan konsisten dengan keimanannya itu, atau mengikuti tuntunan nabi musa dan kemudian masuk islam setelah kedatangan nabi Muhammad; dan ada juga di antara mereka yang tidak demikian, yakni yang kafir dan durhaka. Dan kami telah dan pasti akan uji mereka dengan jalan memberi nikmat dan berbagai hal yang baik-baik dan bencana atau berbagai hal yang buruk-buruk, agar mereka kembali kepada kebenaran, bertobat dan menyesali pelanggaran-pelanggaran yang mereka lakukan. Apakah setelah dicerai-beraikan dan diuji dengan kebaikan dan keburukan mereka kembali kepada kebenaran' ayat ini menjelaskan keadaan mereka setelah itu, dengan menyatakan, maka setelah mereka, yaitu dua golongan yang telah kami kelompokkan tadi, datanglah generasi lain yang lebih buruk yang mewarisi taurat dari leluhur mereka, tetapi mereka tidak mengamalkannya, yang mengambil harta benda dunia yang rendah ini. Kesenangan dunia lebih mereka utamakan daripada kebenaran. Lalu mereka berkata, kami pasti akan diberi ampun, karena Allah maha pengampun. Dan kelak jika harta benda dunia datang kepada mereka sebanyak itu pula, niscaya mereka akan terus-menerus mengambilnya juga. Seakan-akan mereka mengharapkan ampunan, padahal jika mereka diberikan lagi kesenangan dunia seperti sebelumnya, mereka tidak ragu untuk mengambilnya. Begitulah, mereka adalah sekelompok orang yang di samping memohon ampunan, tetapi dalam waktu yang sama selalu saja melakukan dosa. Bukankah mereka sudah terikat perjanjian dalam kitab taurat bahwa mereka tidak akan mengatakan terhadap Allah, kecuali yang benar, padahal mereka telah mempelajari apa yang tersebut di dalamnya' mereka telah mempelajari isinya, dan seharusnya mereka mengatakan kebenaran. Tetapi mereka justru mengatakan kebatilan! sesungguhnya kenikmatan di negeri akhirat yang diperuntukkan bagi mereka yang bertakwa, itu lebih baik daripada segala kesenangan dunia. Maka tidakkah kamu mengerti sehingga tetap memungkiri hal ini' jika demikian halnya, berarti kalian tidak bisa membedakan bahwa kenikmatan akhirat itu sungguh lebih baik daripada kesenangan dunia yang kalian lebih utamakan!"
  }
]