[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka setelah orang-orang yang kami sebutkan karakter mereka itu, datanglah pengganti yang buruk, mereka mengambil kitab (taurat) dari para pendahulu mereka, lalu membaca dan memahaminya, namun menyelisiihi hukumnya. Mereka mengambil apa yang ditawarkan kepada mereka dari kekayaan dunia, melalui cara-cara nista seperti mengambil uang sogokan dan lainnya. Demikian itu dikarenakan sifat ketamakan dan ambisi (duniawi) yang besar mereka. dan selain itu, mereka juga mengatakan, ”Sesungguhnya Allah akan mengampuni dosa-dosa kami’, sebagai bentuk angan-angan kosong mereka kepada Allah. Dan apabila kaum yahudi itu didatangi kekayaan yang fana dari berbagai jenis barang haram, mereka akan mengambilnya dan menganggapnya halal bagi mereka, dengan terus larut dalam dosa-dosa mereka dan mengambil apa-apa yang haram. Apakah belum diambil dari mereka janji-janji untuk menegakan taurat dan mengamalkan kandungannya, dan agar mereka tidak berbicara sembarangan atas nama Allah, kecuali kebenaran dan tidak berdusta atas NamaNya. Dan mereka sudah mengetahui kandungan kitabnya, tetapi mereka menyia-nyiakannya dan mengabaikan untuk mengamalkannya dan mereka melanggar pejanjian Allah terhadap mereka dalam perkara tersebut. Padahal negeri akhirat lebih baik bagi orang-orang yang bertakwa kepada Allah, lalu menjalankan perintah-perintahNya dan menjauhi semua laranganNYa. Tidaklah mau memikirkan mereka itu, orang-orang yang mengambil penghasilan denagn cara rendah, bahwa sesungguhnya apa yang ada di sisi Allah itu jauh lebih baik dan lebih abadi bagi orang-orang yang bertakwa?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "169. Lalu sepeninggal mereka, datanglah orang-orang jahat yang menjadi generasi penerus mereka. Orang-orang jahat itu mengambil kitab suci Taurat dari para pendahulu mereka. Mereka membacanya tetapi enggan mengamalkannya. Mereka mengambil keuntungan duniawi yang sangat rendah sebagai suap untuk mengubah Kitab Allah dan menetapkan hukum berdasarkan sesuatu yang tidak pernah diturunkan oleh Allah. Dan mereka membesarkan harapan mereka sendiri bahwa Allah akan mengampuni dosa-dosa mereka. Dan jika keuntungan duniawi yang datang kepada mereka itu sedikit, mereka akan mengambilnya secara berulang-ulang. Bukankah Allah telah mengambil perjanjian atas mereka bahwa mereka tidak akan mengatakan sesuatu atas nama Allah selain ucapan yang benar tanpa melakukan perubahan atau penggantian sedikit pun? Keengganan mereka untuk mengamalkan isi kitab suci itu bukan karena mereka tidak tahu, bahkan mereka mengetahuinya dengan baik. Karena mereka sudah mempelajari isinya dan menguasainya, maka dosa mereka lebih besar. Padahal kehidupan di Akhirat dan kenikmatan abadi yang ada di dalamnya jauh lebih baik dari kesenangan sementara bagi orang-orang yang takut kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Tidakkah orang-orang yang mengambil keuntungan yang sedikit itu mengerti bahwa apa yang Allah siapkan untuk orang-orang yang bertakwa di Akhirat akan lebih baik dan lebih kekal?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "169. Setelah kaum yang telah kami cerai-beraikan ke penjuru bumi itu, datanglah kaum keturunan mereka yang menjadi generasi yang buruk. Mereka mewarisi Taurat, membacanya, mempelajarinya, dan menemui hukum-hukum yang ada di dalamnya seperti halal, haram, perintah, dan larangan; namun mereka tidak mendapat manfaat darinya, dan menyelisihi hukum-hukum tersebut serta menghalalkan apa yang diharamkan. Bahkan mereka mengambil sesuatu yang rendah berupa uang suap atas pengubahan isi kitab itu, dan mengaku mereka lakukannya untuk memberi kemudahan bagi orang banyak dan berkata: “Allah akan mengampuni dosa-dosa kami dan tidak akan menghukum kami, karena kami adalah keturunan para nabi, kami adalah bangsa pilihan-Nya di antara manusia yang lain.” Namun mereka adalah kaum yang selalu dalam dosa-dosa mereka, dan bukan kaum yang bertaubat, karena jika mereka mendapati harta haram yang lain seperti yang telah mereka ambil terlebih dahulu dengan cara yang batil, maka mereka akan kembali mengambilnya dan menghalalkannya tanpa pernah bertaubat atau menyesal. Kemudian Allah membantah perkataan mereka “Allah akan mengampuni kami”, sedangkan mereka tetap melakukan kemaksiatan, bahwa Allah telah mengambil perjanjian dari mereka dalam Taurat: Bahwa orang yang akan diampuni Allah adalah orang yang hanya mengatakan sesuatu yang benar terhadap Allah dan menyampaikan tentang-Nya dengan jujur serta tidak melanggar hukum-hukum-Nya. Namun mereka telah membaca dan memahami Taurat, akan tetapi mereka tidak menjalankan perjanjian yang telah diambil dari mereka dan tidak mengikuti perintah dan larangan yang ada dalam Taurat. Hal ini karena mereka telah mempelajari Taurat namun tidak mendapat manfaat darinya, dan petunjuk-petunjukknya tidak merasuk ke dalam hati mereka, sehingga mereka menyia-nyiakannya dan menjualnya dengan harga yang murah. Kemudian Allah menjelaskan bahwa kenikmatan yang Allah siapkan di akhirat untuk orang-orang bertakwa yang menjauhi harta haram dan tidak mengambil harta orang lain dengan cara yang batil adalah lebih baik daripada kenikmatan dunia yang dipilih oleh orang-orang yang membuat kedustaan terhadap Allah. Dan di sini Allah berfirman kepada mereka: “Tidakkah kalian memiliki akal yang dapat menimbang apa yang seharusnya dipilih dan diperjuangkan?” Dalam firman-Nya: (أفلا تعقلون) terdapat pengalihan kata ganti dari kata ganti ketiga menuju kata ganti kedua, yang dimaksudkan untuk menegaskan olokan dan hinaan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "169. فَخَلَفَ مِنۢ بَعْدِهِمْ خَلْفٌ (Maka datanglah sesudah mereka generasi (yang jahat)) Yakni anak keturunan yang meneruskan mereka dan generasi yang datang sesudah mereka. Makna (الخلف) yakni penerus dalam keburukan. وَرِثُوا۟ الْكِتٰبَ(yang mewarisi Taurat) Yakni mewarisi Taurat dari pendahulu mereka untuk mereka baca dan amalkan. يَأْخُذُونَ عَرَضَ هٰذَا الْأَدْنَىٰ (yang mengambil harta benda dunia yang rendah ini) Yakni dunia yang ingin mereka percepat untuk mendapatkan kenikmatannya lewat harta suap dan harta haram lainnya sebagai imbalan atas ayat-ayat Allah yang mereka ubah. وَيَقُولُونَ سَيُغْفَرُ لَنَا (dan berkata: “Kami akan diberi ampun”) Mereka beralasan bahwa mereka akan diampuni padahal mereka tetap dalam kesesatan mereka. وَإِن يَأْتِهِمْ عَرَضٌ مِّثْلُهُۥ يَأْخُذُوهُ ۚ (Dan kelak jika datang kepada mereka harta benda dunia sebanyak itu (pula), niscaya mereka akan mengambilnya (juga)) Mereka juga beralasan bahwa mereka akan diampuni, dan begitu seterusnya. أَلَمْ يُؤْخَذْ عَلَيْهِم مِّيثٰقُ الْكِتٰبِ(Bukankah perjanjian dalam al-kitab sudah diambil dari mereka) Yakni kitab taurat. أَن لَّا يَقُولُوا۟ عَلَى اللهِ إِلَّا الْحَقَّ (yaitu bahwa mereka tidak akan mengatakan terhadap Allah kecuali yang benar) Tanpa merubah atau mengganti karena ingin mendapatkan kenikmatan atau takut terhadap sesuatu. وَدَرَسُوا۟ مَا فِيهِ ۗ (padahal mereka telah mempelajari apa yang tersebut di dalamnya?) Mereka tidak menjalankan perjanjian itu padalah mereka telah mempelajari dan mengajarkan isi dari Taurat. Sehingga berpalingnya mereka atas pengetahuan dan bukan karena mereka tidak tahu, dan hal itu adalah dosa yang paling besar dan kejahatan yang paling berat. وَالدَّارُ الْاٰخِرَةُ خَيْرٌ (Dan kampung akhirat itu lebih baik) Daripada kenikmatan dunia itu. لِّلَّذِينَ يَتَّقُونَ ۗ( bagi mereka yang bertakwa) Yakni yang bertakwa kepada Allah dan menjauhi kemaksiatan serta tidak mengubah dan menyiasati ayat-ayat Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan sifat-sifat orang yang Allah peringatkan kita untuk tidak mengikut kepada jalan mereka : { فَخَلَفَ مِنْ بَعْدِهِمْ خَلْفٌ وَرِثُوا الْكِتَابَ يَأْخُذُونَ عَرَضَ هَٰذَا الْأَدْنَىٰ } \"Maka datanglah sesudah mereka generasi (yang jahat) yang mewarisi Taurat, yang mengambil harta benda dunia yang rendah ini\" { وَيَقُولُونَ سَيُغْفَرُ لَنَا وَإِنْ يَأْتِهِمْ عَرَضٌ مِثْلُهُ يَأْخُذُوهُ } \"dan berkata: \"Kami akan diberi ampun\". Dan kelak jika datang kepada mereka harta benda dunia sebanyak itu (pula), niscaya mereka akan mengambilnya (juga)\" kemudian perhatikan penutup dari ayat ini : { وَالدَّارُ الْآخِرَةُ خَيْرٌ لِلَّذِينَ يَتَّقُونَ ۗ أَفَلَا تَعْقِلُونَ } \"Dan kampung akhirat itu lebih bagi mereka yang bertakwa. Maka apakah kamu sekalian tidak mengerti?\" maka apakah kita telah memikirkan apa yang Allah telah peringatkan dan mewasiatkannya kepada kita ?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "169 Maka sesudah mereka datanglah generasi yang jahat, mereka yang mewarisi Taurat dari para pendahulu mereka. Mereka yang mengambil harta benda dunia berupa uang suap yang rendah dan memakan harta haram yang berlawanan dengan perintah Allah. Mereka menerjang hukum kitab Taurat, dan mereka menyangka bahwa mereka akan diampuni dan mengharap sesuatu yang salah. Jika mereka mendapat harta yang melenceng dari syariat mereka tetap mengambilnya, serta menyangka tetap akan diampuni. Al ‘ardl adalah kesenangan yang sementara. Bukankah perjanjian Taurat sudah diambil dari mereka, yaitu bahwa mereka tidak akan mengatakan sesuatu yang berkaitan dengan Allah kecuali yang benar saja, padahal mereka telah mempelajari, membaca, serta faham dan mengerti apa yang tersebut di dalam Taurat?. Mereka meninggalkan perintah itu atas dasar pengetahuan, bukan ketidaktahuan. Lalu bagaimana bisa mereka menyangka akan mendapat ampunan setelah mereka membangkang. Dan negeri akhirat itu lebih bagi mereka yang bertakwa dan berhati-hati atas hukuman-Nya. Maka apakah kamu sekalian tidak berfikir dan tidak mengerti?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan datanglah} datanglah {setelah mereka suatu generasi} pengganti buruk yang tidak ada kebaikan pada mereka {yang mewarisi kitab} mereka mengambil kitab Taurat dari pendahulu mereka {Mereka mengambil harta benda yang rendah ini} kesenangan dunia yang rendah berupa penyuapan untuk menyelewengkan mereka dari kitab Allah {Lalu, mereka berkata,“Kami akan diampuni.” Jika nanti datang kepada mereka harta} kesenangan {sebanyak itu, lalu mereka mengambilnya. Bukankah mereka sudah terikat perjanjian dalam kitab} janji-janji Taurat {bahwa mereka tidak mengatakan kepada Allah, kecuali yang benar, dan mereka telah mempelajari apa yang ada di dalamnya} mereka membaca dan mempelajari apa yang ada di dalam kitab {Negeri akhirat itu lebih baik bagi orang-orang yang bertakwa. Apakah kalian tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "169 sehingga datanglah \"setelah mereka generasai\" yang jahat \"yang mewarisi” sesudah mereka “taurat” mereka menjadikan rujukan kitab itu atas mereka dan memperlakukan kitab itu menurut hawa nafsu mereka. mereka disodori harta agar mereka memberi fatwa dan memutuskan hukum dengan cara yang tidak benar, suap merajalela dikalangan mereka ”yang mengambil harta benda dunia yang rendah ini, dan berakta” mereka mengakui bahwa ia adalah dosa dan bahwa mereka adalah orang-orang zhalim ”kami akan diberi ampun” ini adalah omong kosong bukan kebenarana dan ia bukan istigfar dan minta ampun yang sebenarnya. jika memang demikian niscaya mereka akan menyesal atas apa yang mereka perbuat dan mereka berniat kuat untuk tidak mengulanginya akan tetapi jika ada harta dan suap lain, maka mereka mengambilnya, mereka menukar ayat-ayat Allah dengan harga yang sedikit, mereka mengganti yang baik dengan yang buruk, Allah mengingkari mereka dan menjelaskan kelancangan mereka ”bukankah perjanjian taurat sudah diambil dari mereka, yaitu bahwa mereka tidak akan mengatakan terhadap Allah kecuali yang benar?” lalu mengapa mereka berakata atas namaNYa tanpa kebenaran karena mengikuti hawa nafsu dan cenderung kepada ambisi mereka, ”dan” sebenarnya mereka ”telah mempelajari apa yang tersebut di dalamnya?” tidak ada persoalan mereka atasnya, justru mereka melakukan perbuatan mereka itu dalam keadaan sengaja dan mengetahui. ini lebih besar dosanya, lebih buruk celaannya, dan lebih berat siksaanna. ini termasuk kebodohan akal mereka dan kerendahan pikiran mereka, karena mereka lebih mementingkan dunia daripada akhirat. oleh karena itu Dia berfirman ”dan kampung akhirat itu lebih baik bagi mereka yang bertakwa” dengan menjauhi penghasilan yang bersumber dari suap atas penetapan hukum berdasar kepada selain yang diturunkan oleh Allah dan perkara-perkara haram lainnya. ”maka apakah kamu sekalian tidak mengerti?” yakni apakah kalian tidak mempunyai akal yang dengannya kalian menimbang apa yang semesitnya lebih dipentingkan, apa yang lebih berhak untuk diusahakan dan didahulukan? tugas akal adalah melihat kepada akibat dari sesuatu adapun orang yang berpandangan dangkal lagi pendek, dia tidak dapat meraih nikmat orang yang kekal, dimana akal dan pikirannya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 169: Yang bertindak terhadap Taurat sesuai hawa nafsu mereka. Mereka diberi harta untuk berfatwa dan berhukum dengan tidak benar dan mereka biasa menerima risywah (sogok). Yang halal maupun yang haram. Mengakui bahwa perbuatan itu dosa dan bahwa mereka adalah orang-orang zalim. Yakni “Atas apa yang kami lakukan.” Kata-kata ini bukanlah istighfar (permintaan ampun), karena jika demikian tentu mereka akan menyesal terhadap perbuatan itu dan berniat keras untuk tidak mengulanginya lagi. Bahkan ketika mereka diberi harta atau sogokan, mereka masih tetap mengambilnya. Mereka rela menjual ayat-ayat Alah dengan harga yang murah, menggantinya dengan perhiasan dunia yang rendah, dan lebih mengutamakan kehidupan dunia daripada akhirat. Mereka ingin diampuni, tetapi selalu mengerjakan perbuatan itu, padahal dalam Taurat tidak ada janji akan diampuni jika tetap terus berbuat maksiat. Mereka mengetahui yang hak, namun tidak mau mengamalkannya dan tidak mau memutuskan dengannya. Oleh karena itu, mereka disebut sebagai “golongan yang dimurkai.” Yakni tidakkah mereka dapat menimbang mana yang seharusnya mereka utamakan; dunia atau akhirat? Yang sementara atau yang kekal?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 169",
    "description": "Apakah setelah dicerai-beraikan dan diuji dengan kebaikan dan keburukan mereka kembali kepada kebenaran' ayat ini menjelaskan keadaan mereka setelah itu, dengan menyatakan, maka setelah mereka, yaitu dua golongan yang telah kami kelompokkan tadi, datanglah generasi lain yang lebih buruk yang mewarisi taurat dari leluhur mereka, tetapi mereka tidak mengamalkannya, yang mengambil harta benda dunia yang rendah ini. Kesenangan dunia lebih mereka utamakan daripada kebenaran. Lalu mereka berkata, kami pasti akan diberi ampun, karena Allah maha pengampun. Dan kelak jika harta benda dunia datang kepada mereka sebanyak itu pula, niscaya mereka akan terus-menerus mengambilnya juga. Seakan-akan mereka mengharapkan ampunan, padahal jika mereka diberikan lagi kesenangan dunia seperti sebelumnya, mereka tidak ragu untuk mengambilnya. Begitulah, mereka adalah sekelompok orang yang di samping memohon ampunan, tetapi dalam waktu yang sama selalu saja melakukan dosa. Bukankah mereka sudah terikat perjanjian dalam kitab taurat bahwa mereka tidak akan mengatakan terhadap Allah, kecuali yang benar, padahal mereka telah mempelajari apa yang tersebut di dalamnya' mereka telah mempelajari isinya, dan seharusnya mereka mengatakan kebenaran. Tetapi mereka justru mengatakan kebatilan! sesungguhnya kenikmatan di negeri akhirat yang diperuntukkan bagi mereka yang bertakwa, itu lebih baik daripada segala kesenangan dunia. Maka tidakkah kamu mengerti sehingga tetap memungkiri hal ini' jika demikian halnya, berarti kalian tidak bisa membedakan bahwa kenikmatan akhirat itu sungguh lebih baik daripada kesenangan dunia yang kalian lebih utamakan! setelah menjelaskan keadaan mereka yang durhaka dan menyianyiakan kitab taurat, ayat ini berbicara tentang orang-orang yang berpegang teguh dan mengikuti kebenaran. Dan orang-orang yang selalu berpegang teguh pada kitab, yakni taurat, dengan selalu mengamalkan tuntunannya dan mengikuti nabi Muhammad setelah mendapat penjelasan tentang sifat-sifat dan kabar gembira tentang kedatangannya di dalam taurat, serta melaksanakan kewajiban salat secara sempurna dan berkesinambungan, akan diberi pahala. Sungguh, kami tidak akan menghilangkan pahala orang-orang saleh dan kami tidak membiarkan mereka tanpa ganjaran atas kesalehan dan kebajikan yang mereka lakukan."
  }
]