[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian aku akan mendatangi mereka dari seluruh arah dan sisi. Maka aku akan menghalangi mereka dari jalan kebenaran, dan aku akan tampakan seperti indah kepada mereka sebuah kebatilan, dan aku dorong mereka mencintai dunia serta aku sebarkan keraguan-raguan pada mereka tentang akhirat. Dan Engkau tidak akan mendapati kebanyakan anak keturunan adam bersukur terhadap nikmat-nikmatMu. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Kemudian aku benar-benar akan mendatangi mereka dari segala arah untuk menggoda mereka supaya enggan terhadap urusan Akhirat dan bersemangat terhadap urusan dunia, untuk melontarkan keragu-raguan di dalam hati mereka dan membuat hawa nafsu mereka tampak baik di mata mereka. Dan Engkau -wahai Rabb kami- akan mendapati sebagian besar dari mereka tidak bersyukur kepada-Mu, karena aku telah mengarahkan kekafiran kepada mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. ثُمَّ لَءَاتِيَنَّهُم مِّنۢ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمٰنِهِمْ وَعَن شَمَآئِلِهِمْ (kemudian saya akan mendatangi mereka dari muka dan dari belakang mereka, dari kanan dan dari kiri mereka) Yakni dari empat arah, karena itulah arah dimana seorang musuh menyerang musuhnya. Dan tidak menyebutkan arah atas dan bawah karena rahmat Allah turun dari atas mereka. Yakni aku akan mendatangi mereka dari seluruh arah, berusaha menjerumuskan mereka dari jalan-Mu yang lurus dengan segala cara yang aku mampu. وَلَا تَجِدُ أَكْثَرَهُمْ شٰكِرِينَ (Dan Engkau tidak akan mendapati kebanyakan mereka bersyukur (taat)) Karena akibat dari godaan dan penjerumusanku. Iblis menyesatkan mereka dari amal-amal shaleh dan berusaha merusaknya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "17. ثُمَّ لَءَاتِيَنَّهُم مِّنۢ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمٰنِهِمْ وَعَن شَمَآئِلِهِمْ ۖ (kemudian saya akan mendatangi mereka dari muka dan dari belakang mereka, dari kanan dan dari kiri mereka) Yakni dari empat arah, karena itulah arah dimana seorang musuh menyerang musuhnya. Dan tidak menyebutkan arah atas dan bawah karena rahmat Allah turun dari atas mereka. Yakni aku akan mendatangi mereka dari seluruh arah, berusaha menjerumuskan mereka dari jalan-Mu yang lurus dengan segala cara yang aku mampu. وَلَا تَجِدُ أَكْثَرَهُمْ شٰكِرِينَ (Dan Engkau tidak akan mendapati kebanyakan mereka bersyukur (taat)) Karena akibat dari godaan dan penjerumusanku. Iblis menyesatkan mereka dari amal-amal shaleh dan berusaha merusaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kemudian aku akan mendatangi mereka dari setiap arah untuk menyesatkan dan membuat mereka bingung di akhirat. Lalu Engkau akan mendapati kebanyakan manusia tidak bersyukur kepadaMu atas nikmatMu, dan tidak menaati perintahMu. Ini adalah anggapan dan sangkaan Iblis."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian, pasti aku akan mendatangi mereka dari depan, dari belakang, dari kanan, dan dari kiri mereka. Engkau tidak akan mendapati kebanyakan mereka bersyukur.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17 “kemudian saya akan mendatangi mereka dari muka dan dari belakang mereka, dari kanan dan dari kiri mereka” yakni dari segala arah jurusan dan dari segala jalan yang padanya dia mampu mewujudkan maksudnya pada mereka. manakala iblis yang buruk ini mengetahui bahwa mereka adalah lemah, kelalaian telah mengawasi banyak dari mereka, dan dia sendiri telah bertekad bulat untuk mengeluarkan segala upayanya untuk menyesatkan mereka, maka dia mengira dan memang perkiraannya benar dia berkata” dan Engkau tidak akan mendapati kebanyakan mereka bersyukur (taat)” karena bersyukur termasuk meniti jalan yang lurus. sementara ia ingin menghalang-halangi manusia darinya dan dari bersyukur. Allah berfirman ”karena sesungguhnya setan-setan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala. ” Allah memperingatkan kita dari apa yang iblis katakana dan dia tekadkan untuk melakukannya, agar kita berhati-hati darinya, bersiap-siap menghadapi musuh kita, menjaga diri darinya. Dengan kita (berilmu) mengetahui jalan-jalan dadri mana dia datang, dan celah-celah dimana dia menyusup darinya, maka dengan itu Allah telah memberi nikmat kepada kita dengan kenikmatan yang paling sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 17: Yakni dari semua arah. Ibnu Abbas berkata, “Namun setan tidak mampu mendatangi dari atas mereka agar tidak ada yang menghalangi antara seorang hamba dengan rahmat Allah Ta’ala.” Qatadah menjelaskan bahwa setan akan datang kepada manusia dari depan mereka mengabarkan bahwa tidak ada kebangkitan, surga dan neraka. Dari belakang mereka, dengan menghias perkara dunia dan mengajak mereka kepadanya. Dari kanan mereka, dengan membuat mereka menunda-nunda kebaikan dan dari kiri mereka dengan menghias kejahatan dan maksiat, mengajak mereka kepadanya dan memerintahkannya. Ia akan datang dari semua arah selain dari atas, karena ia tidak sanggup menghalangi seseorang dari rahmat Allah. Ibnu Abbas menafsirkan \"dari kanan mereka\" yakni setan akan membuat samar urusan agama mereka (mendatangkan syubhat), sedangkan dari kiri mereka, yakni membuat mereka senang kepada maksiat (fitnah syahwat). Oleh karena itu, Rasulullah shallallahu 'alaihi wa sallam senantiasa membaca doa berikut di pagi dan sore hari -meminta kepada Allah perlindungan-Nya di berbagai arah-: اَللَّهُمَّ إِنِّي أَسْأَلُكَ اَلْعَافِيَةَ فِي الدُّنْيَا وَالْاَخِرَةِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَ اَلْعَافِيَةَ فِي دِينِي, وَدُنْيَايَ, وَأَهْلِي, وَمَالِي, اَللَّهُمَّ اسْتُرْ عَوْرَاتِي, وَآمِنْ رَوْعَاتِي, اَللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ, وَمِنْ خَلْفِي, وَعَنْ يَمِينِي, وَعَنْ شِمَالِي, وَمِنْ فَوْقِي, وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي \"Ya Allah, sesungguhnya aku meminta ‘afiyat (penjagaan) kepada-Mu di dunia dan akhirat. Ya Allah, sesungguhnya aku meminta kepada-Mu maaf dan 'afiyat baik dalam agamaku, duniaku, keluargaku dan hartaku. Ya Allah, tutupilah cacatku, tenangkanlah rasa takutku. Ya Allah, jagalah aku dari depan dan belakangku, dari kanan dan kiriku serta dari atasku. Aku berlindung dengan keagungan-Mu agar jangan sampai ada yang menghantamku secara tiba-tiba dari bawahku.” (HR. Abu Dawud, Nasa'i, Ibnu Majah, Ibnu Hibban dan Hakim, ia berkata: \"Shahih isnadnya\") Beriman atau taat. Iblis mengatakan hal ini, karena melihat lemahnya manusia, mudah lalai, di samping itu ia akan menggunakan semua kemampuannya untuk menyesatkan mereka. Dengan ayat ini, Allah Subhaanahu wa Ta'aala mengingatkan kita agar selalu waspada terhadap tipu daya Iblis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 17",
    "description": "Kemudian, kata iblis melanjutkan, untuk mewujudkan tujuanku ini, aku akan menempuh berbagai cara. Pasti aku akan mendatangi mereka dari segala penjuru: dari depan, dari belakang, dari kanan, dan dari kiri mereka. Dan karena manusia amatlah lemah, engkau tidak akan mendapati kebanyakan mereka bersyukur atas nikmat-nikmat-Mu. Karena keangkuhan dan kedurhakaannya, Allah kemudian memberi sanksi tegas kepada iblis dan mengingatkan manusia untuk tidak mengikuti ajakannya. Allah berfirman, disebabkan kemaksiatan dan kesombonganmu, keluarlah kamu dari sana, yaitu dari dalam surga, dalam keadaan terhina akibat kedurhakaanmu dan juga dalam keadaan terusir, yakni dijauhkan dari rahmat dan nikmat Allah. Aku bersumpah demi keagungan-ku, sesungguhnya barang siapa di antara mereka, yakni manusia, ada yang mengikutimu dengan senantiasa melakukan kekafiran dan kemaksiatan, pasti akan aku isi neraka jahanam dengan kamu semua, setan dan manusia. Ayat ini menunjukkan bahwa neraka merupakan tempat iblis dan orang-orang yang mengikuti bujuk rayunya dengan bermaksiat kepada Allah."
  }
]