[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang berpegang teguh pada kitab (taurat) dan mengerjakan kandungannya berupa keyakinan-keyakinan dan hukum-hukumnya, serta menjaga ibadah shalat dengan seluruh ketentuannya dengan baik dan tidak menunda-nunda waktu-waktunya, maka sesungguhnya Allah akan memberikan balasan pahala atas amal-amal shalih mereka dan tidak menyia-nyiakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "170. Sedangkan orang-orang yang memegang teguh kitab suci itu, mengamalkan isinya dan mendirikan salat dengan menjaga waktu-waktunya, syarat-syarat, kewajiban-kewajiban, dan sunah-sunahnya, maka Allah membalas amal perbuatan mereka. Karena Allah tidak akan menyia-nyiakan ganjaran orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "170. Kemudian Allah memuji hamba-Nya yang berpegang teguh kepada kitab-Nya, dengan menjelaskan bahwa orang-orang yang berpegang teguh pada perintah-perintah dalam kitab yang diturunkan Allah dan menjadikannya sandaran bagi segala urusannya, niscaya Allah tidak akan menyia-nyiakan balasan mereka, sebab mereka telah berbuat baik bagi agama dan dunia mereka. Dan Allah tidak akan menyia-nyiakan pahala orang yang telah berbuat baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "170. وَالَّذِينَ يُمَسِّكُونَ بِالْكِتٰبِ (Dan orang-orang yang berpegang teguh dengan Al Kitab) Dan dari mereka terdapat golongan yang berpegang teguh dengan Taurat dan mengamalkannya serta menjadikannya sebagai sandaran dalam urusan agama mereka. Mereka adalah orang-orang baik yang tidak akan disia-siakan pahala mereka oleh Allah. Dan keteguhan mereka merupakan bentuk perbaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara perkara penting yang mesti dimiliki oleh setiap muslim pembaharu adalah : memperbaiki dirinya lebih awal kemudian diri orang lain, dengan al-qur'an dan shalat... Allah berfirman : { وَالَّذِينَ يُمَسِّكُونَ بِالْكِتَابِ وَأَقَامُوا الصَّلَاةَ إِنَّا لَا نُضِيعُ أَجْرَ الْمُصْلِحِينَ } . pada lafazh { يُمَسِّكُونَ } jika dibaca takhfif maka maknanya : mereka berpegang teguh dengan diri mereka sendiri, dan jika dibaca tasydid, berarti : mereka berpegang teguh dengan diri mereka dan kepada selain mereka juga. 2 ). Perpegang teguh kepada kitab Allah dengan kesungguhan hati, serta mendirikan shalat dengan segala ketentuanya, adalah dua manhaj rabbani yang menjadi dasar untuk memperbaiki diri, perhatikan firman Allah : { وَالَّذِينَ يُمَسِّكُونَ بِالْكِتَابِ وَأَقَامُوا الصَّلَاةَ إِنَّا لَا نُضِيعُ أَجْرَ الْمُصْلِحِينَ } \"Dan orang-orang yang berpegang teguh dengan Al Kitab (Taurat) serta mendirikan shalat, (akan diberi pahala) karena sesungguhnya Kami tidak menyia-nyiakan pahala orang-orang yang mengadakan perbaikan\" dan pengkhususan shalat dalam ayat ini tanpa ibadah lainnya adalah karena keutamaan yang menjadi tolak ukur keimanan setiap orang, dan mendirikannya akan menghadirkan ibadah-ibadah lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "170 Orang-orang yang berpegang teguh dan mengamalkan perintah Taurat serta senantiasa mendirikan shalat pada waktunya, maka akan diberi pahala karena sesungguhnya Kami tidak menyia-nyiakan pahala orang-orang yang melakukan perbaikan dan ketaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berpegang teguh} berpegang teguh {pada kitab dan mendirikan shalat, sesungguhnya Kami tidak akan menyia-nyiakan pahala orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "170 Orang-orang yang berakal sebenar-benarnya adalah orang-orang yang dicitrakan oleh Allah dengan FirmanNya ”dan orang-orang yang berpegang teguh dengan alkitab (taurat)” yakni berpegang teguh dari segi ilmu dan amal, mereka mengetahui hukum-hukum dan berita-berita yang dikandungnya dimana ilmu tentang itu adalah ilmu yang termulia, mereka menjalankan perintah-perintah agung yang wajib di pegang adalah mendirikan shalat secara lahir dan batin. oleh karena itu Allah menyebutkannya secara khusus karena keutamaannya dan kemuliaannya, dan bahwa ia adalah timbangan amal dan penegakannya mendorong pada penegakan ibadah-ibadah yang lain. karena seluruh amal mereka adalah baik, maka Allah berfirman ”sesungguhnya kami tidak menyia-nyiakan pahala orang-orang yang mengadakan perbaikan” dalam perkataan, perbuatan, dan niat mereka, memperbaiki diri orang lain. Ayat ini dan yang sepertinya menunjukkan bahwa Allah mengutus para RasulNya dengan kebaikan bukan kerusakan dengan manfaat bukan mudarat mereka diutus dengan kebaikan dunia dan akhirat. jadi semakin seseorang itu baik, maka dia semakin dekat kepada sikap mengikuti mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 170: Dengan mempelajari dan mengamalkannya. Seperti Abdullah bin Salam dan kawan-kawannya. Disebutkan secara khusus ibadah shalat, karena ia merupakan timbangan keimanan, mendirikannya dapat membantu mengerjakan ibadah yang lain, sekaligus sebagai benteng yang menjaga seseorang dari perbuatan keji dan munkar. Baik bagi diri maupun orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 170",
    "description": "Setelah menjelaskan keadaan mereka yang durhaka dan menyianyiakan kitab taurat, ayat ini berbicara tentang orang-orang yang berpegang teguh dan mengikuti kebenaran. Dan orang-orang yang selalu berpegang teguh pada kitab, yakni taurat, dengan selalu mengamalkan tuntunannya dan mengikuti nabi Muhammad setelah mendapat penjelasan tentang sifat-sifat dan kabar gembira tentang kedatangannya di dalam taurat, serta melaksanakan kewajiban salat secara sempurna dan berkesinambungan, akan diberi pahala. Sungguh, kami tidak akan menghilangkan pahala orang-orang saleh dan kami tidak membiarkan mereka tanpa ganjaran atas kesalehan dan kebajikan yang mereka lakukan. Allah membantah orang-orang yahudi yang mengatakan bahwa bani israil itu tidak pernah melanggar kebenaran. Maka Allah berfirman, dan ingatlah ketika kami mengangkat gunung sinai ke atas kepala pendahulu, bani israil. Mereka ketakutan karena mengira seakan-akan gunung itu naungan awandan mereka yakin bahwa gunung itu akan jatuh menimpa mereka. Ketika itu kami firmankan kepada mereka, peganglah dengan teguh dan tunjukkan keinginan kuat untuk menaati apa yang telah kami berikan kepadamu berupa petunjuk-petunjuk taurat, serta ingatlah selalu apa yang tersebut di dalamnya, yakni tuntunan, dengan selalu mengamalkannya agar kamu menjadi orang-orang bertakwa, yakni ter-hindar dari sanksi dan siksa Allah. Sampai di sini selesai sudah kisah nabi musa bersama kaumnya."
  }
]