[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika kami mengangkat gunung di atas bani israil, seolah-olah gunung itu awan yang menaungi mereka, dan mereka meyakini bahwa gunung itu akan menimpa mereka bila tidak mau menerima hukum-hukm taurat. Dan kami katakan kepada mereka, ”ambilah apa yang kami berikan kepada kalian dengan kuat.” Maksudnya, laksanakanlah apa (ajaran) yang kami berikan kepada kalian dengan kesungguhan dari kalian.”Dan ingatlah oleh kalian kandungan di dalam kitab kami, berupa perjanjian-perjanjian dan ikrar-ikrar yang telah kami ambil dari kalian untuk patuh menjalankannya;supaya kalian bertakwa kepada tuhan kalian sehingga kalian selamat dari siksaanNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "171. Dan ingatlah -wahai Muhammad- ketika Kami mengangkat gunung itu ke atas Bani Israil tatkala mereka menolak apa yang terkandung di dalam kitab suci Taurat, kemudian gunung itu menjadi seperti awan yang menaungi mereka, dan mereka merasa yakin bahwa gunung itu akan jatuh menimpa mereka, dan dikatakan kepada mereka, “Ambillah apa yang Kami berikan kepada kalian dengan sungguh-sungguh, serius, dan tekad yang kuat. Dan ingatlah hukum-hukum yang terkandung di dalamnya yang telah Allah tetapkan bagi kalian serta jangan pernah melupakannya agar kalian menjadi orang-orang yang bertakwa kepada Allah apabila kalian menjalankannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "171. Allah menutup pembahasan tentang kisah Musa bersama kaumnya dengan menyebutkan kenikmatan lain yang telah diberikan kepada Bani Israil: “Hai Muhammad, ingat dan ingatkanlah Bani Israil yang ada di zamanmu; ketika Kami mengangkat bukit ke atas kepala pendahulu mereka yang ada di zaman Musa, hingga gunung itu seperti awan yang ada di atas kepada mereka; agar Kami menunjukkan kepada mereka salah satu mukjizat sebagai tanda kekuasaan dan keagungan Kami. Peristiwa ini terjadi ketika mereka enggan menjalankan hukum-hukum yang ada dalam Taurat dan terlihat dari mereka usaha untuk menghalangi risalah Musa. Maka Allah mengangkat bukit itu ke atas kepala mereka, kemudian mereka diminta untuk berpegang teguh pada Taurat, dan merekapun melakukannya dan bersujud. Mereka melihat ke atas kepala mereka dan merasa yakin gunung itu akan menimpa mereka, jika mereka tidak memenuhi perintah Nabi mereka. Dikatakan kepada mereka: “Berpegang-teguhlah kepada kitab yang telah Kami berikan kepada kalian, laksanakanlah kandungannya dengan penuh kesungguhan dan semangat, serta terimalah kitab itu tanpa ada kelalaian dan keraguan. Dan jagalah apa yang ada didalamnya dengan menghafal, mempelajari, dan mengamalkannya tanpa melalaikan sesuatu apapun yang ada di dalamnya. Ini semua agar kalian dapat terhindar dari kebinasaan di dunia dan di akhirat dan agar kalian kembali kepada Allah sebagai orang-orang yang bertakwa.” Akan tetapi Bani Israil tidak mengingat dan menghayati perjanjian ini; namun mereka melanggarnya dan tenggelam dalam kemaksiatan, sehingga mereka layak mendaptkan laknat dan kemurkaan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "171. وَإِذْ نَتَقْنَا الْجَبَلَ (Dan (ingatlah), ketika Kami mengangkat bukit) Yakni Kami mencabut gunung dari akarnya, yaitu gunung Thur. كَأَنَّهُۥ ظُلَّةٌ (seakan-akan bukit itu naungan) Seperti awan yang menaungi mereka. وَظَنُّوٓا۟ أَنَّهُۥ وَاقِعٌۢ بِهِمْ (dan mereka yakin bahwa bukit itu akan jatuh menimpa mereka) Yakni jatuh diatas mereka. خُذُوا۟ مَآ ءَاتَيْنٰكُم بِقُوَّةٍ (Peganglah dengan teguh apa yang telah Kami berikan kepadamu) Yakni dan Kami berfirman kepada mereka: “berpegang teguhlah” Makna (القوة) yakni kesungguhan dan keseriusan. وَاذْكُرُوا۟ مَا فِيهِ(serta ingatlah selalu (amalkanlah) apa yang tersebut di dalamnya) Yakni hukum-hukum yang disyariatkan Allah kepada kalian; dan janganlah kalian melupakannya. Qatadah berkata: “Allah mencabut gunung itu dari akarnya lalu mengangkatnya diatas kepala mereka, kemudian Allah berfirman: “berpegang teguhlah pada ketetapan-Ku atau Aku akan menimpakan gunung ini kepada kalian”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "171 Ingatlah wahai Rasul, ketika Kami mengangkat bukit Thur dari tempatnya ke atas mereka, seakan-akan bukit itu naungan awan dan mereka yakin bahwa bukit itu akan jatuh menimpa mereka dari peringatan Allah jika mereka tidak mentaati perintah/hukum Taurat. Kami katakan kepada mereka: “Peganglah dengan teguh apa yang telah Kami berikan kepadamu dalam kitab Taurat, serta ingatlah selalu (amalkanlah) hukum/perintah di dalamnya supaya kamu menjadi orang-orang yang bertakwa dan aman dari siksa-Nya.”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Kami mengangkat} Kami mencabut dan mengangkat {gunung di atas mereka, seakan-akan gunung itu awan} awan yang menaungi {dan mereka yakin} meyakini {bahwa gunung itu akan jatuh menimpa mereka} jatuh menimpa mereka {“Peganglah apa yang telah Kami anugerahkan kepada kalian dengan kuat} dengan teguh dan sungguh-sungguh {serta ingatlah apa yang ada di dalamnya agar kalian bertakwa.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171 kemudian Allah berfirman ”dan ingatlah ketika kami mengangkat bukit keatas mereka” ketika mereka menolak apa yang ada di dalam taurat, Dia mewajibkan mereka beramal dan mengangkat gunung di atas mereka, maka gunung pun diatas mereka ”seakan akan bukit itu sebagai naungan awan dan mereka yakin bahwa bukit itu akan jatuh menimpa mereka” dan dikatakan kepada mereka ”peganglah dengan teguh apa yang telah kami berikan kepadamu” yakni dengan serius dan sungguh-sungguh ”serta ingatlah selalu (amalkanlah) apa yang tersebut di dalamnya” dengan mengkaji dan mempelajari serta mengamalkannya ”supaya kamu menjadi orang-orang yang bertakwa” jika kamu melakukan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 171: Ketika mereka enggan menerima isi kitab Taurat. Jika mereka tidak menerima hukum-hukum Taurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 171",
    "description": "Allah membantah orang-orang yahudi yang mengatakan bahwa bani israil itu tidak pernah melanggar kebenaran. Maka Allah berfirman, dan ingatlah ketika kami mengangkat gunung sinai ke atas kepala pendahulu, bani israil. Mereka ketakutan karena mengira seakan-akan gunung itu naungan awandan mereka yakin bahwa gunung itu akan jatuh menimpa mereka. Ketika itu kami firmankan kepada mereka, peganglah dengan teguh dan tunjukkan keinginan kuat untuk menaati apa yang telah kami berikan kepadamu berupa petunjuk-petunjuk taurat, serta ingatlah selalu apa yang tersebut di dalamnya, yakni tuntunan, dengan selalu mengamalkannya agar kamu menjadi orang-orang bertakwa, yakni ter-hindar dari sanksi dan siksa Allah. Sampai di sini selesai sudah kisah nabi musa bersama kaumnya. Ayat-ayat yang lalu berbicara tentang kisah nabi musa dan bani israil dengan mengingatkan mereka tentang perjanjian yang bersifat khusus, di sini Allah menjelaskan perjanjian yang bersifat umum, untuk bani israil dan manusia secara keseluruhan, yaitu dalam bentuk penghambaan. Allah berfirman, dan ingatlah ketika tuhanmu mengeluarkan dari sulbi, yakni tulang belakang anak cucu adam, keturunan mereka yang melahirkan generasi-generasi selanjutnya. Dan kemudian dia memberi mereka bukti-bukti ketuhanan melalui alam raya ciptaannya, sehingga'dengan adanya bukti-bukti itu'secara fitrah akal dan hati nurani mereka mengetahui dan mengakui kemahaesaan tuhan. Karena begitu banyak dan jelasnya bukti-bukti keesaan tuhan di alam raya ini, seakan-akan Allah mengambil kesaksian terhadap roh mereka seraya berfirman, bukankah aku ini tuhan pemelihara-Mu dan sudah berbuat baik kepadamu' mereka menjawab, betul engkau tuhan kami, kami bersaksi bahwa engkau maha esa. Dengan demikian, pengetahuan mereka akan bukti-bukti tersebut menjadi suatu bentuk penegasan dan, dalam waktu yang sama, pengakuan akan kemahaesaan tuhan. Kami lakukan yang demikian itu agar di hari kiamat kamu tidak lagi beralasan dengan mengatakan, sesungguhnya ketika itu kami lengah terhadap ini, tidak tahu apa-apa mengenai keesaan tuhan."
  }
]