[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika tuhanmu mengeluarkan anak keturunan adam dari tulang-tulang sulbi bapak-bapak mereka dan meminta pengakuan mereka tentang keesaan Allah melalui keyakinan yang Ditanamkan dalam fitrah-fitarah mereka, bahwa sesungguhnya Dia adalah tuhan mereka, pecipta mereka, serta penguasa mereka, kemudian mereka mengakui itu dihadapanNya, karena dikhawatirkan mereka akan mengingkari (hakikat tersebut) pada hari kiamat, sehingga tidak mengakui apapun dari keyakinan-keyakinan tersebut, dan mereka akan menyangka bahwa sesungguhnya hujjah Allah belumlah tegak nyata dihadapan mereka, dan sama sekali tidak ada pengetahuan yang mereka miliki tentangnya. Bahkan sebenarnya mereka itu lalai darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "172. Dan ingatlah -wahai Muhammad- ketika Rabbmu mengeluarkan dari tulang punggung anak-anak Adam keturunan mereka dan meminta pengakuan mereka akan sifat rubūbiyyah-Nya yang telah Dia sematkan di dalam fitrah mereka, yaitu pengakuan bahwa Allah adalah Pencipta dan Rabb mereka. Dia bertanya kepada mereka, “Bukankah Aku ini Rabb kalian?” Mereka semua menjawab, “Ya. Engkau adalah Rabb kami.” Lalu Allah berfirman, “Sesungguhnya Kami hanya menguji kalian dan mengambil perjanjian dari kalian agar kelak di hari Kiamat kalian tidak mengingkari hujah yang Allah tunjukkan kepada kalian. Dan supaya kalian tidak beralasan bahwa kalian tidak mengetahui hal itu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "172. Dan ingatlah hai Rasulullah dan orang-orang yang berakal, ketika Allah mengeluarkan dari sulbi Bani Adam keturunan mereka dan menjadikan mereka beranak pinak dari generasi ke generasi; dan ketika Allah mengeluarkan mereka dari perut ibu mereka dan tulang sulbi ayah mereka; kemudian Allah mengikrarkan kepada mereka ketuhanan-Nya dengan menjadikannya dalam fitrah mereka, bahwa Dia adalah Tuhan, Pencipta, dan Penguasa mereka. Dia berfirman: “Bukankah Aku adalah Tuhan, Penguasa, dan Pengatur kalian?” Mereka menjawab: “Benar, kami bersaksi atas diri kami dengan penuh keyakinan dan keridhaan bahwa Engkau adalah Tuhan dan Pencipta kami, tidak ada Tuhan selain Engkau. Karena rahmat dan kekuasaan-Mu, kami mengikrarkan kesaksian ini.” Allah menyebutkan sebab pengambilan kesaksian ini, yaitu agar mereka tidak mengatakan pada hari kiamat sebagai alasan atas kesyirikan yang mereka lakukan: “Sungguh kami lalai dan tidak mengetahui keesaan dan ketuhanan Engkau.” Akan tetapi karena mereka telah diciptakan dengan fitrah, dan menjadikan dalam setiap makhluk-Nya tanda-tanda yang menunjukkan keesaan-Nya, serta mengutus para rasul yang memberi mereka kabar gembira dan peringatan; maka alasan mereka tidak dapat diterima."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "172. وَإِذْ أَخَذَ رَبُّكَ مِنۢ بَنِىٓ ءَادَمَ مِن ظُهُورِهِمْ ذُرِّيَّتَهُمْ (Dan (ingatlah), ketika Tuhanmu mengeluarkan keturunan anak-anak Adam dari sulbi mereka) Yakni Allah setelah menciptakan nabi Adam mengusap punggungnya dan mengeluarkan keturunannya darinya, kemudian mengambil perjanjian atas mereka. Dan mereka ketika itu berada dalam alam arwah. وَأَشْهَدَهُمْ عَلَىٰٓ أَنفُسِهِمْ (dan Allah mengambil kesaksian terhadap jiwa mereka) Yakni Allah mengambil kesaksian terhadap setiap mereka dengan firman-Nya: Bukankah Aku ini Tuhanmu? أَلَسْتُ بِرَبِّكُمْ ۖ قَالُوا۟ بَلَىٰ ۛ شَهِدْنَآ ۛ (Bukankah Aku ini Tuhanmu?” Mereka menjawab: “Betul (Engkau Tuhan kami), kami menjadi saksinya) Yakni kami bersaksi atas diri kami bahwa Engkau adalah tuhan kami. أَن تَقُولُوا۟ يَوْمَ الْقِيٰمَةِ إِنَّا كُنَّا عَنْ هٰذَا غٰفِلِينَ(agar di hari kiamat kamu tidak mengatakan: “Sesungguhnya kami (bani Adam) adalah orang-orang yang lengah terhadap ini) Yakni agar kalian tidak mengatakan: kami tidak mengetahui bahwa Allah adalah Tuhan kami satu-satunya dan tidak ada sekutu bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "172 Ingatlah juga, ketika Tuhanmu mengeluarkan keturunan anak-anak Adam dari sulbi bani Adam. Saat mereka masih dalam alam rahim mereka diambil janji untuk menetapkan bahwa Allah Maha Wujud dan Esa. Maksudnya adalah bahwa Allah menciptakan manusia beserta fitrahnya dengan bukti kauniyah atau yang nyata untuk menunjukkan dan menuntun kepada kebenaran dan pengenalan kepada Sang Penciptanya. Allah mengambil kesaksian terhadap jiwa mereka secara langsung, bukan wahyu seraya berfirman: “Bukankah Aku ini Tuhanmu?” Mereka menjawab langsung: “Betul, kami bersaksi atas diri kami bahwa Engkau adalah Tuhan Yang berhak kami sembah. Kami lakukan yang demikian itu agar di hari kiamat kamu tidak mengatakan: “Sesungguhnya kami bani Adam adalah orang-orang tidak diperingatkan dan tidak diberitahu bahwa hanya Engkaulah Tuhan Kami dan tiada sekutu bagiMu”,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Tuhanmu mengeluarkan} mengeluarkan {dari tulang punggung anak cucu Adam, keturunan mereka dan Allah mengambil kesaksian mereka terhadap diri mereka sendiri} membuat mereka berikrar untuk mengesakanNya sesuai apa yang difitrahkan untuk mereka {“Bukankah Aku ini Tuhanmu?” Mereka menjawab, “Betul, kami bersaksi.” agar kalian tidak berkata} agar kalian tidak berkata {pada hari kiamat,“Sesungguhnya terhadap hal ini} janji ini {kami adalah orang-orang yang lalai”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "172-173 Allah berfirman ”dan (ingatlah) ketika Rabbmu mengeluarkan keturunan anak-anak adam dari sulbi mereka” yakni Dia mengeluarkan keturunan mereka dari sulbi mereka dan menjadikan mereka beranak pinak dari satu generasi kegenerasi lain. ”dan” ketika Dia mengeluarkan dari perut ibu mereka dan sulbi bapak mereka ”Allah mengambil kesaksian terhadap jiwa mereka (seraya berfirman) bukankah aku ini Rabbmu?” yakni dengan mereka mengakui rububiyahNya dengan fitrah yang Dia berikan kepada mereka bahwa mereka mengakui bahwa Dia adalah Rabb, pencipta, dan pemilik mereka. Merekapun menjawab ”ya, kami mengakui itu” karena sesungguhnya Allah telah memfitrahkan manusia diatas agama yang lurus dan benar, semua manusia dirubah dan diganti oleh perkara-perkara yang menyusup kepada akal dari akidah-akidah yang rusak. Oleh karena itu ”mereka menjawab ’betul(engkau Rabb kami) kami menjadi saksi (kami lakukan yang demikian itu) agar di hari kiamat kamu tidak mengatakan sesungguhnya kami (bani adam) adalah orang-orang yang lengah terhadap ini (keesan Rabb)” yakni kami mengujimu sehingga kamu mengakui apa yang bersemayam di dalam jiwamu bahwa Allah adalah Rabbmu karena biasa saja pada hari kiamat kamu mengklaim bahwa hujjah Allah belum tegak atasmu dan kamu pun tidak mempunyai ilmu tentangnya justru kamu lalai dan teledor darinya. Pada hari ini hujjahmu telah terputus dan yang tegak hanyalah hujjah Allah yang kuat atasmu. Atau bisa jadi kamu berdalih dengan hujjah lain, kamu mengatakan ”sesungguhnya orang-orang tua kami telah mempersekutukan Rabb sejak dahulu sedang kami ini adalah anak-anak keturunan yang (datang) sesudah mereka” maka kami mengikuti jejak mereka dan menelusuri kebatilan mereka. ”maka apakah engkau akan membinasakan kami karena perbuatan yang sesat dahulu” Allah telah menyematkan didalam jiwamu sesuatu yang menunjukanmu bahwa apa yang dilakukan oleh nenek moyangmu adalah batil, dan bahwa kebenaran adalah apa yang dibawa oleh para Rasul, ini menandingi apa yang dibawa oleh para Rasul, ini menandingi apa yang dipegang oleh nenek moyangmu dan mengunggulinya. Benar, terkadang ada pendapat dan pemikiran nenek moyang yang sesat yang diyakini sebagai kebenaran, hal itu tidak lain karena dia berpaling dari hujjah-hujjah Allah keterangan-keterangan dan tanda-tanda kebesaranNya yang terdapat di alam raya atau yang ada pada diri. Maka berpalingnya dia dari hal itu dan kecenderungannya kepada apa yang diucapkan oleh orang-orang yang menyimpang bisa membawa kepada keadaan dimana dia lebih mementingkan kebatilan diatas kebenaran. Inilah yang benar dalam menafsirkan ayat ini. Ada yang mengatakan bahwa ini terjadi pada hari dimana Allah mengambil perjanjian kepada keturunan adam ketika Dia mengeluarkan mereka dari sulbinya dan Allah menuntut mereka bersaksi atas diri mereka lalu mereka bersaksi dengan itu, lalu Dia berhujjah atas mereka dengan apa yang diperintahkannya kepada mereka pada waktu itu atas kezhaliman mereka dalam kekufuran dan pengingkaran mereka di dunia dan diakhirat. Akan tetapi dalam ayat tersebut tidak dapat petunjuk ke arah ini, tidak pula ada korelasi dan pula tidak sesuai dengan hikmah Allah dan realitapun membuktikan itu, karena perjanjian ini yang mereka katakan bahwa ia terjadi manakala Allah mengeluarkan keturunan adam dari sulbinya ketika mereka masih di alam seperti atom, tidak seorangpun yang menyingggungnya dan terlintas dari benak bani adam, bagaimana Allah berhujjah kepada mereka dengan sesuatu dimana mereka tidak memiliki berita tentangnya tidak memiliki wujud dan bekas?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 172: Ayat ini menunjukkan bahwa manusia diciptakan di atas fitrah tauhid (mengesakan Allah). Namun kemudian fitrah ini dirubah oleh akidah-akidah rusak yang datang setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 172",
    "description": "Ayat-ayat yang lalu berbicara tentang kisah nabi musa dan bani israil dengan mengingatkan mereka tentang perjanjian yang bersifat khusus, di sini Allah menjelaskan perjanjian yang bersifat umum, untuk bani israil dan manusia secara keseluruhan, yaitu dalam bentuk penghambaan. Allah berfirman, dan ingatlah ketika tuhanmu mengeluarkan dari sulbi, yakni tulang belakang anak cucu adam, keturunan mereka yang melahirkan generasi-generasi selanjutnya. Dan kemudian dia memberi mereka bukti-bukti ketuhanan melalui alam raya ciptaannya, sehingga'dengan adanya bukti-bukti itu'secara fitrah akal dan hati nurani mereka mengetahui dan mengakui kemahaesaan tuhan. Karena begitu banyak dan jelasnya bukti-bukti keesaan tuhan di alam raya ini, seakan-akan Allah mengambil kesaksian terhadap roh mereka seraya berfirman, bukankah aku ini tuhan pemelihara-Mu dan sudah berbuat baik kepadamu' mereka menjawab, betul engkau tuhan kami, kami bersaksi bahwa engkau maha esa. Dengan demikian, pengetahuan mereka akan bukti-bukti tersebut menjadi suatu bentuk penegasan dan, dalam waktu yang sama, pengakuan akan kemahaesaan tuhan. Kami lakukan yang demikian itu agar di hari kiamat kamu tidak lagi beralasan dengan mengatakan, sesungguhnya ketika itu kami lengah terhadap ini, tidak tahu apa-apa mengenai keesaan tuhan. Atau agar kamu tidak beralasan dengan mengatakan seandainya tidak ada rasul yang kami utus atau tidak ada bukti-bukti itu, sesungguhnya nenek moyang kami telah mempersekutukan tuhan sejak dahulu, sedang kami tidak mempunyai pembimbing selain mereka, sehingga kami mengikuti mereka saja, karena kami adalah keturunan yang datang setelah mereka dan hanya mengikuti jejak mereka. Maka apakah wajar wahai tuhan, engkau akan menyiksa dan membinasakan kami karena perbuatan syirik yang diwariskan kepada kami oleh orang-orang dahulu yang sesat' agar orang-orang musyrik itu jangan mengatakan bahwa nenek moyang mereka dahulu telah mempersekutukan tuhan, sedang mereka tidak tahu menahu bahwa mempersekutukan tuhan itu salah, tidak ada jalan lagi bagi mereka, hanya meniru nenek moyang mereka yang mempersekutukan tuhan. Karena itu mereka menganggap mereka tidak patut disiksa karena kesalahan nenek moyang mereka."
  }
]