[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau agar kelak mereka tidak mengatakan, ”sesungguhnya nenek moyang kami dahulu berbuat syirik sebelum kami dan mereka juga melanggar perjanjian, lalu kami mencontoh mereka setelah mereka tiada, Maka apakah Egkau akan menyiksa kami akibat tindakan yang diperbuat orang-orang yang telah menghapuskan amal perbuatan mereka dengan menjadikan sekutu bagi Allah dalam peribadahan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "173. Atau supaya kalian tidak beralasan bahwa para leluhur kalianlah yang melanggar perjanjian itu kemudian menyekutukan Allah dengan sesuatu. Sedangkan kalian hanya meniru praktik syirik yang kalian dapatkan dari para leluhur kalian. Lalu kalian berkata, “Apakah Engkau -wahai Rabb kami- akan menghukum kami dengan azab disebabkan perbuatan para leluhur kami yang membatalkan amal perbuatan mereka lantaran mereka telah menyekutukan Allah? Jadi kami sama sekali tidak bersalah, karena kami tidak tahu apa-apa. Dan kami hanya meniru para leluhur kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "173. Dan Allah menjelaskan sebab lain dari persaksian ini, yaitu agar mereka tidak berkata pada hari perhitungan: “Sungguh nenek moyang kami yang membuat dan melakukan kesyirikan ini, sedangkan kami hanya mengikuti mereka karena kami adalah keturunan mereka.” Namun alasan kalian ini tidak dapat diterima, karena Allah telah memberi sebab-sebab yang dapat membuka hati kalian agar mendapat cahaya kebenaran, seandainya kalian mau menerima kebenaran itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "173. وَكُنَّا ذُرِّيَّةً مِّنۢ بَعْدِهِمْ ۖ (sedang kami ini adalah anak-anak keturunan yang (datang) sesudah mereka) Kami tidak mendapat petunjuk kepada kebenaran dan tidak mengetahui jalan yang benar, akan tetapi kami hanya melakukan apa yang dilakukan oleh nenek moyang kami. أَفَتُهْلِكُنَا بِمَا فَعَلَ الْمُبْطِلُونَ (Maka apakah Engkau akan membinasakan kami karena perbuatan orang-orang yang sesat?) Yakni orang-orang yang sesat dari nenek moyang kami. Dan tidak ada dosa bagi kami atas ketidaktahuan kami dan atas perbuatan kami mengikuti jejak pendahulu kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "173 Atau agar kamu tidak mengatakan: “Sesungguhnya orang-orang tua kami telah mempersekutukan Tuhan sejak dahulu, adapun kami ini adalah anak-anak keturunan dan pewaris mereka sehingga kami meniru, dan meneruskan perbuatan para pendahulu kami. Sehingga kami tidak mendapat petunjuk kebenaran. Maka apakah Engkau akan membinasakan kami karena perbuatan para pendahulu kami yang dahulu sesat dengan melakukan kesyirikan, adapun kami tidak ada dosa, dan kami tidak tahu menahu?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau kalian (tidak) berkata,“Sesungguhnya nenek moyang kami telah menyekutukan (Tuhan) sebelumnya, dan kami adalah keturunan setelah mereka. Jadi apakah Engkau akan menyiksa kami karena perbuatan orang-orang yang melakukan kebathilan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "172-173 Allah berfirman ”dan (ingatlah) ketika Rabbmu mengeluarkan keturunan anak-anak adam dari sulbi mereka” yakni Dia mengeluarkan keturunan mereka dari sulbi mereka dan menjadikan mereka beranak pinak dari satu generasi kegenerasi lain. ”dan” ketika Dia mengeluarkan dari perut ibu mereka dan sulbi bapak mereka ”Allah mengambil kesaksian terhadap jiwa mereka (seraya berfirman) bukankah aku ini Rabbmu?” yakni dengan mereka mengakui rububiyahNya dengan fitrah yang Dia berikan kepada mereka bahwa mereka mengakui bahwa Dia adalah Rabb, pencipta, dan pemilik mereka. Merekapun menjawab ”ya, kami mengakui itu” karena sesungguhnya Allah telah memfitrahkan manusia diatas agama yang lurus dan benar, semua manusia dirubah dan diganti oleh perkara-perkara yang menyusup kepada akal dari akidah-akidah yang rusak. Oleh karena itu ”mereka menjawab ’betul(engkau Rabb kami) kami menjadi saksi (kami lakukan yang demikian itu) agar di hari kiamat kamu tidak mengatakan sesungguhnya kami (bani adam) adalah orang-orang yang lengah terhadap ini (keesan Rabb)” yakni kami mengujimu sehingga kamu mengakui apa yang bersemayam di dalam jiwamu bahwa Allah adalah Rabbmu karena biasa saja pada hari kiamat kamu mengklaim bahwa hujjah Allah belum tegak atasmu dan kamu pun tidak mempunyai ilmu tentangnya justru kamu lalai dan teledor darinya. Pada hari ini hujjahmu telah terputus dan yang tegak hanyalah hujjah Allah yang kuat atasmu. Atau bisa jadi kamu berdalih dengan hujjah lain, kamu mengatakan ”sesungguhnya orang-orang tua kami telah mempersekutukan Rabb sejak dahulu sedang kami ini adalah anak-anak keturunan yang (datang) sesudah mereka” maka kami mengikuti jejak mereka dan menelusuri kebatilan mereka. ”maka apakah engkau akan membinasakan kami karena perbuatan yang sesat dahulu” Allah telah menyematkan didalam jiwamu sesuatu yang menunjukanmu bahwa apa yang dilakukan oleh nenek moyangmu adalah batil, dan bahwa kebenaran adalah apa yang dibawa oleh para Rasul, ini menandingi apa yang dibawa oleh para Rasul, ini menandingi apa yang dipegang oleh nenek moyangmu dan mengunggulinya. Benar, terkadang ada pendapat dan pemikiran nenek moyang yang sesat yang diyakini sebagai kebenaran, hal itu tidak lain karena dia berpaling dari hujjah-hujjah Allah keterangan-keterangan dan tanda-tanda kebesaranNya yang terdapat di alam raya atau yang ada pada diri. Maka berpalingnya dia dari hal itu dan kecenderungannya kepada apa yang diucapkan oleh orang-orang yang menyimpang bisa membawa kepada keadaan dimana dia lebih mementingkan kebatilan diatas kebenaran. Inilah yang benar dalam menafsirkan ayat ini. Ada yang mengatakan bahwa ini terjadi pada hari dimana Allah mengambil perjanjian kepada keturunan adam ketika Dia mengeluarkan mereka dari sulbinya dan Allah menuntut mereka bersaksi atas diri mereka lalu mereka bersaksi dengan itu, lalu Dia berhujjah atas mereka dengan apa yang diperintahkannya kepada mereka pada waktu itu atas kezhaliman mereka dalam kekufuran dan pengingkaran mereka di dunia dan diakhirat. Akan tetapi dalam ayat tersebut tidak dapat petunjuk ke arah ini, tidak pula ada korelasi dan pula tidak sesuai dengan hikmah Allah dan realitapun membuktikan itu, karena perjanjian ini yang mereka katakan bahwa ia terjadi manakala Allah mengeluarkan keturunan adam dari sulbinya ketika mereka masih di alam seperti atom, tidak seorangpun yang menyingggungnya dan terlintas dari benak bani adam, bagaimana Allah berhujjah kepada mereka dengan sesuatu dimana mereka tidak memiliki berita tentangnya tidak memiliki wujud dan bekas?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 173: Sehingga kami mengikuti mereka. Mereka menganggap bahwa mereka tidak patut disiksa, karena yang salah adalah nenek moyang mereka yang mencontohkan demikian. Dalam ayat ini, Allah menerangkan bahwa tidak bisa berhujjah dengan alasan itu karena mereka diciptakan di atas fitrah tauhid, dan fitrah mereka mendukung bahwa apa yang dilakukan oleh nenek moyang mereka adalah batil, yang benar adalah yang dibawa oleh para rasul, kemudian para rasul juga telah mengingatkan mereka agar bertauhid sesuai fitrah mereka, namun mereka malah menolaknya. Kalau pun terkadang terlintas dalam pikiran manusia bahwa pendapat dan pemikiran nenek moyang mereka benar, maka hal itu tidak lain karena ia berpaling dari hujjah-hujjah Allah, bukti dan ayat-ayat-Nya yang ada di alam semesta dan pada diri mereka sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 173",
    "description": "Atau agar kamu tidak beralasan dengan mengatakan seandainya tidak ada rasul yang kami utus atau tidak ada bukti-bukti itu, sesungguhnya nenek moyang kami telah mempersekutukan tuhan sejak dahulu, sedang kami tidak mempunyai pembimbing selain mereka, sehingga kami mengikuti mereka saja, karena kami adalah keturunan yang datang setelah mereka dan hanya mengikuti jejak mereka. Maka apakah wajar wahai tuhan, engkau akan menyiksa dan membinasakan kami karena perbuatan syirik yang diwariskan kepada kami oleh orang-orang dahulu yang sesat' agar orang-orang musyrik itu jangan mengatakan bahwa nenek moyang mereka dahulu telah mempersekutukan tuhan, sedang mereka tidak tahu menahu bahwa mempersekutukan tuhan itu salah, tidak ada jalan lagi bagi mereka, hanya meniru nenek moyang mereka yang mempersekutukan tuhan. Karena itu mereka menganggap mereka tidak patut disiksa karena kesalahan nenek moyang mereka. Dan demikianlah, dengan penjelasan yang rinci dan penuh hikmah, kami menjelaskan ayat-ayat itu, berupa bukti-bukti keesaan kami dan semua tuntunan kami agar mereka kembali kepada kebenaran, menyadari kesalahan mereka dan tidak menuruti begitu saja orang-orang yang berbuat kebatilan."
  }
]