[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana kami telah uraikan ayat-ayat secara rinci dan kami terangkan di dalamnya apa yang telah kami timpakan pada umat-uamt terdahulu, demikian juga kami jelaskan ayat-ayat dan kami menerangkannya kepada kaummu (wahai rasul), dengan harapan mereka mau kembali dari perbuatan syirik mereka dan mereka kembali kepada tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "174. Sebagaimana Kami menjelaskan ayat-ayat tentang nasib yang menimpa umat-umat yang kafir tersebut, Kami juga menjelaskan ayat-ayat itu kepada mereka agar mereka mau meninggalkan perbuatan syirik mereka untuk beralih kepada ajaran tauhid dan menyembah kepada Allah semata, seperti yang tertuang di dalam perjanjian yang telah mereka buat sendiri untuk Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "174. Demikianlah Kami menjelaskan ayat-ayat dengan terperinci, agar mereka kembali kepada apa yang telah Allah jadikan dalam fitrah mereka, dan kepada perjanjian mereka kepada Allah, sehingga mereka dapat menjauhi keburukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "174. وَكَذٰلِكَ نُفَصِّلُ الْاٰيٰتِ وَلَعَلَّهُمْ يَرْجِعُونَ (Dan demikianlah Kami menjelaskan ayat-ayat itu, agar mereka kembali) Yakni kembali kepada kebenaran dan meninggalkan kebatilan yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "174 Sebagaimana penjelasan atas janji itu, Kami menjelaskan ayat-ayat itu, agar mereka menelaahnya, berpaling dari kesyirikan dan kembali kepada kebenaran. Beriman hanya kepada Allah dan meninggalkan kebiasaan para pendahulu mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Kami merincikan} menjelaskan {ayat-ayat itu dan agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "174 oleh karena itu karena perkara ini jelas dan nyata maka Allah berfirman ”dan demikianlah kami menjelaskan ayat-ayat itu agar mereka kembali (kepada kebenaran)” kepada apa yang Allah titipkan kepada fitrah mereka dan kepada perjanjian Allah, dimana itu membuat mereka tidak melakukan perbuatan buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 174",
    "description": "Dan demikianlah, dengan penjelasan yang rinci dan penuh hikmah, kami menjelaskan ayat-ayat itu, berupa bukti-bukti keesaan kami dan semua tuntunan kami agar mereka kembali kepada kebenaran, menyadari kesalahan mereka dan tidak menuruti begitu saja orang-orang yang berbuat kebatilan. Ayat yang lalu mengisyaratkan bahwa keesaan Allah melekat pada diri manusia, sehingga seharusnya secara fitrah mereka beriman. Tetapi ternyata ada yang durhaka. Di sini Allah mengumpamakan orang-orang yang mendustakan ayat-ayat yang diturunkan kepada rasul-Nya, dan berkata, bacakanlah wahai nabi Muhammad, kepada mereka, berita atau kisah tentang orang yang telah kami berikan ayatayat kami kepadanya, kemudian dia melepaskan diri dari ayat-ayat itu, tidak mempedulikannya dan tidak mengamalkan pesan ayat-ayat itu, melepaskan apa yang melekat pada dirinya bagaikan ular melepaskan kulitnya, maka dia diikuti oleh setan sampai dia tergoda, sehingga jadilah dia termasuk kelompok orang yang sesat."
  }
]