[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ceritakanlah (wahai rasul), kepada umatmu berita tentang seorang lelaki dari bani israil yang telah kami berikan kepada hujjah-hujjah dan dalil-dalil kami, lalu dia mempelajarinya, kemudian mengingkarinya dan membuangnya di belakang punggungnya, maka setan pun menguasainya, sehingga jadilah dia termasuk kedalam golongan orang-orang yang sesat lagi binasa, disebabkan kedurhakaannya kepada perintah tuhannya dan ketaatannya kepada setan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "175. Bacakanlah -wahai Rasul- kepada orang-orang Bani Israil tentang kisah salah seorang dari mereka yang Kami beri ayat-ayat Kami, kemudian ia mengetahuinya dan memahaminya maksudnya dengan benar, tetapi ia tidak mau mengamalkannya, bahkan ia meninggalkannya dan melepaskan diri darinya. Lalu setan merangkul dirinya dan menjadi kawannya. Maka ia pun menjadi orang yang sesat dan celaka setelah sebelumnya ia tergolong orang-orang yang mengikuti petunjuk dan selamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "175. Hai Rasulullah, bacakanlah kepada kaummu kisah ini agar mereka mandapat ibrah dan pelajaran, yaitu kisah orang yang telah Kami beri dia ayat-ayat Kami dengan mengajarinya dan memahamkan tujuan-tujuannya; namun orang ini meninggalkan ayat-ayat tersebut sebagaimana seekor domba yang terlepas dari kulitnya, dan diikuti oleh setan, sehingga menjadi termasuk orang-orang yang tersesat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "175. وَاتْلُ عَلَيْهِمْ (Dan bacakanlah kepada mereka) Yakni ingatkanlah Bani Israil tentang hal lain yang terjadi pada sebagian pendahulu mereka, ketika meninggalkan perintah Allah karena menuruti hawa hafsunya bagaimana Allah menghukum mereka. Ibnu Abbas berkata: yakni seseorang yang berasal dari negeri orang-orang kejam dan perkasa. orang itu bernama Bal’am, ia mempelajari nama Allah yang paling agung (jika ia berdoa dengan nama itu niscaya akan dikabulkan). Ketika Musa akan menyerang negeri itu datanglah kepadanya anak-anak keturunan pamannya bersama kaumnya sambil mengatakan: “sesungguhnya Musa adalah orang yang Tangguh dan ia memiliki tentara yang banyak, apabila ia berhasil mengalahkan kita niscaya akan membinasakan kita semua; oleh sebab itu berdoalah kepada Allah agar menarik mundur Musa dan kaumnya dari kita”. Bal’am menjawab: “jika aku berdoa kepada Allah agar menarik mundur Musa dan kaumnya niscaya akan lenyap dunia dan akhiratku”. Namun mereka tetap merayunya hingga ia akhirnya mau berdoa. Maka ia terlepas dari iman dan pengetahuannya. فَانسَلَخَ مِنْهَا (emudian dia melepaskan diri dari pada ayat-ayat itu) Yakni terlepas darinya secara penuh sebagaimana kambing yang terlepas dari kulitnya. فَأَتْبَعَهُ الشَّيْطٰنُ (lalu dia diikuti oleh syaitan) Dan setan mendapatkannya sehingga ia menjadi temannya. فَكَانَ مِنَ الْغَاوِينَ (maka jadilah dia termasuk orang-orang yang sesat) Yakni yang tetap dalam kesesatan, mereka adalah orang-orang kafir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "175-176 1 ). Islam melarang seseorang menuntut ilmu sampai ia menjadi jenis danc erdas dengannya, namun ia monyombongkan diri di hadapan manusia dengan ilmu tersebut, dan dengannya pula ia menjadikannya sebagai wasilah untuk sebuat kerusakan dan pertengkaran : { وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانْسَلَخَ مِنْهَا فَأَتْبَعَهُ الشَّيْطَانُ فَكَانَ مِنَ الْغَاوِينَ } \"Dan bacakanlah kepada mereka berita orang yang telah Kami berikan kepadanya ayat-ayat Kami (pengetahuan tentang isi Al Kitab), kemudian dia melepaskan diri dari pada ayat-ayat itu, lalu dia diikuti oleh syaitan (sampai dia tergoda), maka jadilah dia termasuk orang-orang yang sesat\". 2 ). { وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانْسَلَخَ مِنْهَا فَأَتْبَعَهُ الشَّيْطَانُ فَكَانَ مِنَ الْغَاوِينَ } Kalau hanya sekedar ilmu tidaklah menjamin tingginya derajat seseorang, dan sesungguhnya Allah telah mendatangkan kepada hamba ini ayat-ayat Nya namun Ia tidak meninggikan derajat hamba itu dengan ilmu tersebut. 3 ). { وَلَوْ شِئْنَا لَرَفَعْنَاهُ بِهَا وَلَٰكِنَّهُ أَخْلَدَ إِلَى الْأَرْضِ وَاتَّبَعَ هَوَاهُ } \"Dan kalau Kami menghendaki, sesungguhnya Kami tinggikan (derajat)nya dengan ayat-ayat itu, tetapi dia cenderung kepada dunia dan menurutkan hawa nafsunya yang rendah\" Sebesar apa seseorang cenderung kepada dunia, sebesar itu pula ia akan jatuh dari langit. 4 ). { فَمَثَلُهُ كَمَثَلِ الْكَلْبِ إِنْ تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَثْ } \"maka perumpamaannya seperti anjing jika kamu menghalaunya diulurkannya lidahnya dan jika kamu membiarkannya dia mengulurkan lidahnya (juga)\" barangsiapa yang tidak dikendalikan oleh ilmunya dari sesuatu yang keji, kekejian itu kebiasaan dirinya, dan tidak sama sekali ia mengambil manfaat dari ilmu tersebut, maka tidaklah keadaan dirinya hanya seperti anjing yang mengulurkan lidahnya meskipun kamu menerima ataupun kamu menolaknya, dan itu adalah keadaan terburuk dari seekor anjing. 5 ). Di dalam al-qur'an Allah membuat dua perumpamaan yang menggambarkan seseorang menjadi lebih buruk dari keadaan dirinya yang sebenarnya, Allah berfiman : { فَمَثَلُهُ كَمَثَلِ الْكَلْبِ إِنْ تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَثْ } , dan Allah berfirman : { مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا } \"Perumpamaan orang-orang yang dipikulkan kepadanya Taurat, kemudian mereka tiada memikulnya adalah seperti keledai yang membawa kitab-kitab yang tebal\" [ Al-Jumu'ah : 5 ]. Pada perumpamaan pertama menggambarkan seorang 'alim yang sesat dan melenceng dari ilmu yang bermanfaat, ia kerap mengulurkan lidahnya demi syahwat kejinya. Dan adapaun perumpamaan kedua menggambarkan orang-orang yang membawa taurat di kepala mereka, akan tetapi sedikitpun mereka tidak mengambil manfaat dari taurat itu, maka apakah yang membedakan antara mereka dengan keledai yang membawa buku di atas punggungnya ?. 6 ). Kisah-kisah qur'ani tidak selamanya menjadi penghibur ketika didengarkan, dan tidak pula sebagai ucapan yang diada-adakan, atau sebagai bahan percobaan rekayasa, melainkan kisah-kisah itu datang untuk meriwayatkan sejarah umat-umat dan generasi-genarasi terdahulu, menampilkan peristiwa-peristiwa hidup yang pernah terjadi, dan sebagai hakikat yang menghantarkan kepada tujuan besar, yaitu tujuan yang akan dicapai dengan tafakkur yang mendalam, dan tadabbur yang waspada, Allah befirman : { فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُونَ } \"Maka ceritakanlah (kepada mereka) kisah-kisah itu agar mereka berfikir\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "175 Bacakan dan ceritakanlah kepada mereka berita tentang orang yang telah Kami berikan kepadanya ayat-ayat Kami (pengetahuan tentang isi Al Kitab): dia adalah Bal’am bin Ba’ura’ seorang ulama Bani Israil. Namun kemudian dia melepaskan diri dan menyepelekan ayat-ayat itu, sehingga dia diikuti oleh syaitan sampai dia tergoda, maka dia menjadi orang-orang yang rugi dalam kesesatan atau orang-orang kafir yang rusak dan merusak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bacakanlah} bacakanlah {kepada mereka berita} kabar {orang yang telah Kami anugerahkan ayat-ayat Kami kepadanya. Kemudian dia melepaskan diri dari ayat-ayat itu} lalu dia keluar dari ayat-ayat itu dengan mengingkarinya {lalu setan mengikutinya} lalu setan menempel kepadanya dan menjadi temannya {sehingga dia termasuk orang-orang yang sesat} orang-orang yang sesat dan dihancurkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "175 Allah berfirman kepada nabiNya ”dan bacakanlah kepada mereka berita orang yang telah kami berikan kepadanya ayat-ayat kami (pengetahuan tentang) isi al-kitab” yakni kami mengajarkan kepadanya ilmu tentang kitab Allah hingga dia menjadi seorang alim besar dan cendekiawan yang mumpuni tetapi dia berlepas diri darinya dan diikuti oleh setan, yakni dia melepaskan diri dari kriteria hakiki seorang ulama yang mengetahui tentang ayat-ayat Alalh karena ilmu tentang itu seharusnya dapat mengantarkan pemiliknya menjadi orang yang menjunjung tinggi sifat kemuliaan akhlak dan keshalihan amal, dia menapaki derajat dan kedudukan tinggi dan mulia. Akan tetapi orang ini membuang kitab Allah dibelakang punggungnya mencampakkan akhlak dan keshalihan amal, dia menapaki derajat dan kedudukan tinggi dan mulia. Akan tetapi orang ini membuang kitab Allah di belakang punggungnya, mencampakkan akhlak yang diperintahkan oleh kitab ia melepasnya seperti melepas pakaian. maka ketika dia berlepas darinya setanpun mengikutinya, yakni setan menguasainya manakala dia keluar dari benteng kokoh dan terjerembab ke dalam derajat terendah maka setan menendangnya kepada kemaksiatan. ”maka jadilah dia termasuk orang-orang yang sesat” padahal sebelumnya dia adalah orang yang lurus dan meluruskan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 175: Ada yang mengatakan, bahwa ia adalah Bal’am bin Ba’uraa salah seorang ulama Bani Israil, di mana ia diminta untuk mendoakan keburukan terhadap Nabi Musa dan akan diberi hadiah, maka ia pun melakukannya. Namun ternyata doa itu berbalik kepadanya dan lisannya menjulur ke dadanya. Ia dikatakan sebagai orang yang melepaskan diri dari ayat-ayat Allah, karena seharusnya orang yang mengetahui ayat-ayat al kitab memberikan dukungan kepada kebenaran, bukan malah menentangnya. Ayat ini berlaku pula bagi setiap orang yang diberi ilmu tentang ayat-ayat-Nya, namun ia melepaskan diri daripadanya. Padahal sebelumnya mendapatkan petunjuk. Inilah orang yang dibiarkan Allah dan diserahkan kepada dirinya sendiri. Nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 175",
    "description": "Ayat yang lalu mengisyaratkan bahwa keesaan Allah melekat pada diri manusia, sehingga seharusnya secara fitrah mereka beriman. Tetapi ternyata ada yang durhaka. Di sini Allah mengumpamakan orang-orang yang mendustakan ayat-ayat yang diturunkan kepada rasul-Nya, dan berkata, bacakanlah wahai nabi Muhammad, kepada mereka, berita atau kisah tentang orang yang telah kami berikan ayatayat kami kepadanya, kemudian dia melepaskan diri dari ayat-ayat itu, tidak mempedulikannya dan tidak mengamalkan pesan ayat-ayat itu, melepaskan apa yang melekat pada dirinya bagaikan ular melepaskan kulitnya, maka dia diikuti oleh setan sampai dia tergoda, sehingga jadilah dia termasuk kelompok orang yang sesat. Ayat ini menguraikan keadaan siapa pun yang melepaskan diri dari pengetahuan tentang ke-esa-an Allah yang telah dimilikinya. Allah menyatakan, dan sekiranya kami menghendaki untuk mengangkat derajatnya ke golongan orang baik niscaya kami tinggikan derajat-Nya dengan memberinya petunjuk untuk mengamalkan ayat-ayat yang kami turunkan itu. Akan tetapi dia selalu cenderung kepada dunia dan mengikuti hawa nafsu keinginannya yang rendah dengan penuh antusias. Maka perumpamaan keadaan-Nya yang selalu berada dalam gundah gulana dan sibuk mengejar hawa nafsu duniawi, persis seperti anjing yang selalu menjulurkan lidahnya. Jika engkau menghalaunya dijulurkan lidahnya dan begitu pula jika kamu membiarkannya dia menjulurkan lidahnya juga. Begitu jugalah seorang budak dunia, selalu tergila-gila dengan kesenangan dan hawa nafsu duniawi. Sesungguhnya demikianlah perumpamaan orang-orang yang mendustakan ayat-ayat yang kami turunkan. Maka, ceritakanlah wahai nabi, kisah-kisah itu kepada kaummu agar mereka berpikir sehingga tidak melakukan apa yang dilakukan oleh yang dikecam ini."
  }
]