[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan seandainya kami menghendaki meninggikan kedudukannya dengan ayt-ayat yang telah kami berikan kepadanya, niscaya kami benar-benar akan melakukannya, akan tetapi dia lebih cenderung kepada dunia dan menuruti hawa nafsunya dan lebih mengutamakan pemenuhan kesenangan-kesenangan dan syahwat pribadinya daripada (kenikmatan) akhirat, dan menolak untuk taat kepaada Allah dan melanggar perintahNYa. Perumpamaan orang ini adalah seperti anjing, bila kamu usir dia atau kamu biarkan saja dia, dia akan menjulurkan lidahnya dalam dua keadaan tersebut. Demikianlah keadaan orang yang melepaskan diri dari ayat-ayat Allah, dia akan terus berada di atas kekafirannya, meskipun kamu berupaya kuat untuk mendakwahinya ataupun membiarkannya. Sifat tersebut (wahai rasul), adalah sifat mereka kaum yang dulu keadaan mereka sesat sebelum datang kepada mereka petunjuk dan risalah, maka ceritakanlah (wahai rosul) berita-berita umat-umat terdahulu. Maka dalam pemberitaanmu tentang kisah-kisah mereka merupakan sebuah mukjizat yang agung, semoga kaummu mengerti apa yang kamu bawa kepada mereka lalu mereka beriman kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "176. Sekiranya Kami hendak memberinya manfaat dari ayat-ayat itu di dunia niscaya Kami akan mengangkat derajatnya dengan memberinya bimbingan untuk mengamalkannya, sehingga derajatnya terangkat di dunia dan di Akhirat. Akan tetapi ia memilih sesuatu yang membuat martabatnya jatuh tatkala ia lebih cenderung kepada kesenangan duniawi. Ia lebih mengutamakan kepentingan dunianya daripada kepentingan Akhiratnya. Ia memilih mengikuti kesenangan hawa nafsunya yang batil. Kerakusannya terhadap dunia tak ubahnya seperti anjing yang terus-menerus menjulurkan lidahnya, seekor anjing saat posisi duduk akan menjulurkan lidahnya, dan ketika dihalau pun akan menjulurkan lidahnya. Itulah perumpamaan bagi orang-orang sesat yang mendustakan ayat-ayat Kami. Maka ceritakanlah -wahai Rasul- kisah-kisah tersebut kepada mereka agar mereka berpikir dan mau meninggalkan kekafiran serta kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "176. Kemudian Allah menjelaskan seandainya Dia menghendaki, niscaya Dia akan mengangkat orang itu menuju derajat kemuliaan berkat ayat-ayat tersebut, sebab tidak ada yang sulit bagi Allah. Namun orang itu sudah terpaut dengan dunia dan mengikuti nafsu syahwatnya. Perumpamaan dirinya seperti seekor anjing, jika kamu mengejarnya, ia akan menjulurkan lidahnya; dan jika kamu membiarkannya, ia juga akan menjulurkan lidahnya, karena itu sudah menjadi tabiatnya. Demikianlah keadaan orang yang telah terpaut dengan dunia dan berpaling dari ayat-ayat yang telah dia ketahui; jika kamu menasehatinya dia tidak akan menerima nasehat itu, karena lebih memilih dunia daripada akhirat; dan jika kamu tidak memberinya nasehat, dia akan tetap tamak terhadap dunia dan syahwatnya. Itulah perumpamaan orang-orang yang mendustakan ayat-ayat Kami yang mengingkari dan menjauhi hidayah padahal telah berada di genggamannya. Kemudian Allah menyampaikan kepada nabi-Nya untuk menceritakan kisah ini kepada kaumnya, agar mereka berfikir dan berhenti dari kekafiran dan kesesatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "176. وَلَوْ شِئْنَا لَرَفَعْنٰهُ بِهَا (Dan kalau Kami menghendaki, sesungguhnya Kami tinggikan (derajat)nya dengan ayat-ayat itu) Yakni sungguh akan Kami muliakan dia dan Kami angkat derajatnya dengan pengetahuan mengenai al-kitab. وَلٰكِنَّهُۥٓ أَخْلَدَ إِلَى الْأَرْضِ (tetapi dia cenderung kepada dunia) Condong kepada dunia, mencintainya dan lebih memilihnya daripada akhirat. وَاتَّبَعَ هَوَىٰهُ ۚ (dan menurutkan hawa nafsunya) Mengikuti apa yang ia inginkan, yaitu berupa kenikmatan dunia yang banyak yang diberikan oleh orang-orang jahat dan kejam itu sebagai upah atas doa untuk keburukan para pembawa kebenaran dan atas tipu daya untuk mereka. إِن تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَث ۚ (jika kamu menghalaunya diulurkannya lidahnya dan jika kamu membiarkannya dia mengulurkan lidahnya) Yakni jika mereka dibebankan untuk memikul hikmah niscaya mereka tidak akan memikulnya, dan apabila ia telah meninggalkannya niscaya mereka tidak akan mendapat petunjuk kepada kebaikan. Pendapat lain mengatakan maknanya adalah apabila kamu menasehatinya niscaya dia akan tetap tersesat, dan apabila kamu tidak menasehatinya dia juga akan tersesat; karena dia dalam kesesatan yang terus-menerus sebab ia berlepas diri dari ayat-ayat tuhannya. Dia bagaikan seekor anjing yang apabila ia berlutut, ia menjulurkan lidahnya, dan apabila ia lari diusir ia juga menjulurkan lidahnya. ذّٰلِكَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَا ۚ (Demikian itulah perumpamaan orang-orang yang mendustakan ayat-ayat Kami) Yakni perumpamaan hina ini adalah perumpamaan bagi orang-orang yang mendustakan ayat-ayat Kami dari golongan orang-orang Yahudi dan lainnya, setelah mereka memiliki pengetahuan tentang ayat-ayat itu namun mereka mengganti dan merubah serta mendustakannya. فَاقْصُصِ الْقَصَصَ (Maka ceritakanlah (kepada mereka) kisah-kisah itu) Yakni tentang sifat orang yang berlepas diri dari ayat-ayat Allah, karena perumpamaan baginya yang telah disebutkan tadi adalah seperti orang-orang Yahudi yang mendustakanmu. لَعَلَّهُمْ يَتَفَكَّرُونَ (agar mereka berfikir) Sehingga berhenti dari kesesatan mereka dan berbalik menuju kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "175-176 1 ). Islam melarang seseorang menuntut ilmu sampai ia menjadi jenis danc erdas dengannya, namun ia monyombongkan diri di hadapan manusia dengan ilmu tersebut, dan dengannya pula ia menjadikannya sebagai wasilah untuk sebuat kerusakan dan pertengkaran : { وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانْسَلَخَ مِنْهَا فَأَتْبَعَهُ الشَّيْطَانُ فَكَانَ مِنَ الْغَاوِينَ } \"Dan bacakanlah kepada mereka berita orang yang telah Kami berikan kepadanya ayat-ayat Kami (pengetahuan tentang isi Al Kitab), kemudian dia melepaskan diri dari pada ayat-ayat itu, lalu dia diikuti oleh syaitan (sampai dia tergoda), maka jadilah dia termasuk orang-orang yang sesat\". 2 ). { وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانْسَلَخَ مِنْهَا فَأَتْبَعَهُ الشَّيْطَانُ فَكَانَ مِنَ الْغَاوِينَ } Kalau hanya sekedar ilmu tidaklah menjamin tingginya derajat seseorang, dan sesungguhnya Allah telah mendatangkan kepada hamba ini ayat-ayat Nya namun Ia tidak meninggikan derajat hamba itu dengan ilmu tersebut. 3 ). { وَلَوْ شِئْنَا لَرَفَعْنَاهُ بِهَا وَلَٰكِنَّهُ أَخْلَدَ إِلَى الْأَرْضِ وَاتَّبَعَ هَوَاهُ } \"Dan kalau Kami menghendaki, sesungguhnya Kami tinggikan (derajat)nya dengan ayat-ayat itu, tetapi dia cenderung kepada dunia dan menurutkan hawa nafsunya yang rendah\" Sebesar apa seseorang cenderung kepada dunia, sebesar itu pula ia akan jatuh dari langit. 4 ). { فَمَثَلُهُ كَمَثَلِ الْكَلْبِ إِنْ تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَثْ } \"maka perumpamaannya seperti anjing jika kamu menghalaunya diulurkannya lidahnya dan jika kamu membiarkannya dia mengulurkan lidahnya (juga)\" barangsiapa yang tidak dikendalikan oleh ilmunya dari sesuatu yang keji, kekejian itu kebiasaan dirinya, dan tidak sama sekali ia mengambil manfaat dari ilmu tersebut, maka tidaklah keadaan dirinya hanya seperti anjing yang mengulurkan lidahnya meskipun kamu menerima ataupun kamu menolaknya, dan itu adalah keadaan terburuk dari seekor anjing. 5 ). Di dalam al-qur'an Allah membuat dua perumpamaan yang menggambarkan seseorang menjadi lebih buruk dari keadaan dirinya yang sebenarnya, Allah berfiman : { فَمَثَلُهُ كَمَثَلِ الْكَلْبِ إِنْ تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَثْ } , dan Allah berfirman : { مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا } \"Perumpamaan orang-orang yang dipikulkan kepadanya Taurat, kemudian mereka tiada memikulnya adalah seperti keledai yang membawa kitab-kitab yang tebal\" [ Al-Jumu'ah : 5 ]. Pada perumpamaan pertama menggambarkan seorang 'alim yang sesat dan melenceng dari ilmu yang bermanfaat, ia kerap mengulurkan lidahnya demi syahwat kejinya. Dan adapaun perumpamaan kedua menggambarkan orang-orang yang membawa taurat di kepala mereka, akan tetapi sedikitpun mereka tidak mengambil manfaat dari taurat itu, maka apakah yang membedakan antara mereka dengan keledai yang membawa buku di atas punggungnya ?. 6 ). Kisah-kisah qur'ani tidak selamanya menjadi penghibur ketika didengarkan, dan tidak pula sebagai ucapan yang diada-adakan, atau sebagai bahan percobaan rekayasa, melainkan kisah-kisah itu datang untuk meriwayatkan sejarah umat-umat dan generasi-genarasi terdahulu, menampilkan peristiwa-peristiwa hidup yang pernah terjadi, dan sebagai hakikat yang menghantarkan kepada tujuan besar, yaitu tujuan yang akan dicapai dengan tafakkur yang mendalam, dan tadabbur yang waspada, Allah befirman : { فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُونَ } \"Maka ceritakanlah (kepada mereka) kisah-kisah itu agar mereka berfikir\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "176 Kalau Kami menghendaki kedudukan yang tinggi baginya, maka sesungguhnya Kami tinggikan derajatnya dengan ayat-ayat itu, tetapi dia cenderung memilih pangkat dunia, menggandrunginya dari pada akhirat dan menuruti hawa nafsunya yang rendah. Maka perumpamaannya adalah seperti anjing, jika kamu menghalaunya diulurkannya lidahnya dan jika kamu membiarkannya dia mengulurkan lidahnya juga. Maksudnya adalah bahwa dia akan menderita selamanya. Dia berlari di belakang dunia. Demikian itulah perumpamaan orang-orang yang mendustakan ayat-ayat Kami orang-orang Yahudi dan musyrikin bahkan setelah mereka mengetahuinya. Maka ceritakanlah kepada mereka kisah-kisah itu agar mereka berfikir dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Kami berhendak, sungguh Kami tinggikan dia dengan ayat-ayat itu} karena ayat-ayat itu {tetapi dia cenderung pada dunia} memilih tinggal pada dunia dan harta yang ada di sana {dan mengikuti hawa nafsunya. Maka perumpamaannya itu seperti anjing. Jika kamu menghalaunya} jika kamu menarik dan membuatnya bergerak {ia menjulurkan lidahnya dan jika kamu membiarkannya dia menjulurkan lidahnya} mengeluarkan lidah untuk menjulurkannya {Demikian itu adalah perumpamaan orang-orang yang mendustakan ayat-ayat Kami. Maka ceritakanlah kisah-kisah itu agar mereka berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "176 ini karena Allah membiarkannya dan menyandarkannya kepada dirinya sendiri. oleh Karena itu Allah berfirman ”dan kalu kami menghendaki sesungguhnya kami tinggikan (derajat) nya dengan ayat-ayat itu” dengan memberinya taufik untuk mengamalkannya, sehingga derajatnya terangkat di dunia dan akhirat dan terlindungi dari musuh musuhnya “tetapi dia” melakukan sesuatu yang menyebabkan kehinaan, dia cenderung kepada dunia, yakni kepada hawa nafsu rendahan dan tujuan duniawi ”dan menurutkan hawa nafsu” serta tidak menaati Rabbnya “maka perumpamaannya” dalam perkara kesungguhannya kepada dunia dan terfokusnya hati kepadanya ”seperti anjing jika kamu menghalaunya diulurkannya lidahnya dan jika kamu membiarkannya dia mengulurkan lidahnya(juga)” yakni dia selalu menjulurkan lidahnya, sementara orang ini selalu berusaha dengan sungguh-sungguh sepenuh hatinya agar kebutuhannya tidak terhalangi oleh dunia sedikitpun ”demikian itulah perumpamaan orang orang yang mendustakan ayat-ayat kami” setelah Allah menjelaskannya kepada mereka tetapi mereka tidak tunduk kepadanya justru mereka mendustakannya dan menolaknya karena tidak berartinya Allah bagi mereka dan hawa nafsu yang mereka ikuti tanpa petunjuk dari Allah “maka ceritakanlah (kepada mereka) kisah-kisah itu agar mereka berfikir” tentang perumpamaan yang dibuat, mengambil pelajaran dari ayat-ayat, jika mereka berpikir maka mereka mengetahui jika mereka mengetahui maka mereka akan beramal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 176: Dengan memberinya taufiq untuk beramal sehingga kedudukannya tinggi di dunia dan di akhirat, serta dapat membentengi dirinya dari musuh-musuhnya. Yang membuatnya dibiarkan Allah Ta’ala. Meninggalkan ketaatan kepada Tuhannya, sehingga Allah merendahkannya. Dalam hal kecenderungannya yang sangat kepada dunia. Yakni selalu menjulurkan lidahnya dan hina dalam setiap keadaan. Sehingga membuat mereka beriman. Dalam ayat ini terdapat dorongan mengamalkan ilmu, dan bahwa yang demikian dapat mengangkat derajatnya, melindunginya dari setan, tarhib (ancaman) meninggalkan ilmu, dan bahwa hal tersebut dapat merendahkan kedudukannya, dan menjadikan setan menguasai dirinya. Ayat ini juga menunjukkan bahwa mengutamakan dunia dan mengikuti hawa nafsu merupakan sebab dibiarkan oleh Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 176",
    "description": "Ayat ini menguraikan keadaan siapa pun yang melepaskan diri dari pengetahuan tentang ke-esa-an Allah yang telah dimilikinya. Allah menyatakan, dan sekiranya kami menghendaki untuk mengangkat derajatnya ke golongan orang baik niscaya kami tinggikan derajat-Nya dengan memberinya petunjuk untuk mengamalkan ayat-ayat yang kami turunkan itu. Akan tetapi dia selalu cenderung kepada dunia dan mengikuti hawa nafsu keinginannya yang rendah dengan penuh antusias. Maka perumpamaan keadaan-Nya yang selalu berada dalam gundah gulana dan sibuk mengejar hawa nafsu duniawi, persis seperti anjing yang selalu menjulurkan lidahnya. Jika engkau menghalaunya dijulurkan lidahnya dan begitu pula jika kamu membiarkannya dia menjulurkan lidahnya juga. Begitu jugalah seorang budak dunia, selalu tergila-gila dengan kesenangan dan hawa nafsu duniawi. Sesungguhnya demikianlah perumpamaan orang-orang yang mendustakan ayat-ayat yang kami turunkan. Maka, ceritakanlah wahai nabi, kisah-kisah itu kepada kaummu agar mereka berpikir sehingga tidak melakukan apa yang dilakukan oleh yang dikecam ini. Sangat buruk perumpamaan keadaan orang-orang yang mendustakan ayat-ayat kami karena mereka mengabaikan tuntunan pengetahuannya, bahkan berbuat zalim. Dengan mengingkari kebenaran, mereka sebenarnya tidak lain telah menzalimi diri mereka sendiri. Begitulah, seburuk-buruk manusia adalah orang yang mempunyai pengetahuan keesaan Allah dan agama-Nya, tetapi karena didorong oleh hawa nafsu duniawi, dia meninggalkan ilmunya dan berubah menjadi kafir kepada Allah."
  }
]