[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Amat buruk perumpamaan kaum yang mendustakan hujjah-hujjah Allah dan bukti-bukti petunjuk dariNya, lalu mereka mengingkarinya, dan terhadap diri mereka saja, mereka itu berbuat aniaya, disebabkan pendustaan mereka terhadap hujjah-hujjah dan dalil-dalil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "177. Ia tidak lebih buruk dari orang-orang yang mendustakan ayat-ayat dan bukti-bukti kekuasaan Kami. Karena dengan tindakan itu mereka telah menganiaya diri mereka sendiri dengan menjerumuskannya ke jurang kehancuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "177. Allah menutup perumpamaan ini dengan menyatakan bahwa perumpamaan yang paling buruk adalah perumpamaan bagi orang-orang yang mendustakan ayat-ayat Kami, karena telah diserupakan dengan anjing; baik itu serupa dalam hal kekurangannya karena mereka tetap tersesat ketika dinasehati atau tidak, maupun dalam hal kehinaan, karena anjing tidak memiliki keinginan kecuali memenuhi perut dan syahwatnya. Maka barangsiapa yang meninggalkan kebaikan hidayah dan ilmu menuju hawa nafsunya, maka dia seperti anjing. Itulah seburuk-buruk perumpamaan. Dengan perbuatan itu mereka telah melakukan dua keburukan; pendustaan ayat-ayat dan kezaliman terhadap diri mereka sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "177. سَآءَ مَثَلًا الْقَوْمُ الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَا (Amat buruklah perumpamaan orang-orang yang mendustakan ayat-ayat Kami) Yakni perumpamaan mereka amatlah buruk disebabkan buruknya perbuatan mereka. وَأَنفُسَهُمْ كَانُوا۟ يَظْلِمُونَ(dan kepada diri mereka sendirilah mereka berbuat zalim) Yakni dengan berbuat kedustaan itu mereka tidak menzalimi kecuali diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "177 Amat buruklah sifat dan perbuatan orang-orang yang mendustakan ayat-ayat yang diturunkan kepada para rasul Kami, dan kepada diri mereka sendirilah mereka berbuat zalim dengan dusta."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sangat buruk} sangat buruk {perumpamaan kaum yang mendustakan ayat-ayat Kami. Mereka hanya menzalimi diri sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "177 “amat buruklah perumpamaan orang-orang yang mendustakan ayat-ayat kami dan kepada diri sendirilah mereka berbuat zhalim\" yakni sungguh buruk dan jelek perumpamaan orang yang mendustakan ayat-ayat Allah dan menzhalimi diri dari berbagai macam kemaksiatan sesungguhnya perumpamaan mereka adalah perumpamaan yang buruk. Orang tersebut yang telah Allah berikan ayat ayatNya kepadanya ada kemungkinan dia adalah orang tertentu yang keadaanya seperti yang Allah jelaskan maka Allah menceritakan kisahnya untuk memberi peringatan kepada hamba-hambaNYa ada kemungkinan lain yaitu bahwa maksudnya adalah laki laki manapun ia mencakup semua orang yang diberi ayat oleh Allah lalu dia berlepas diri darinya. Ayat-ayat ini mengandung anjuran beramal dengan ilmu, dan bahwa itu merupakan derajat tinggi yang diberikan oleh Allah kepada pelakunya dan pelindung dari setan. ayat ini juga mengandung targhib (ancaman) tidak mengaamalkan ilmu yang didapat dan bahwa ia adalah degradasi kepada derajat paling rendah dan kemenangan setan atasnya. ayat ini juga bahwa mengikuti hawa nafsu dan kecenderungan kepada syahwat adalah penyebab kehinaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 177",
    "description": "Sangat buruk perumpamaan keadaan orang-orang yang mendustakan ayat-ayat kami karena mereka mengabaikan tuntunan pengetahuannya, bahkan berbuat zalim. Dengan mengingkari kebenaran, mereka sebenarnya tidak lain telah menzalimi diri mereka sendiri. Begitulah, seburuk-buruk manusia adalah orang yang mempunyai pengetahuan keesaan Allah dan agama-Nya, tetapi karena didorong oleh hawa nafsu duniawi, dia meninggalkan ilmunya dan berubah menjadi kafir kepada AllahAllah tidak meninggikan derajat siapa yang yang dibicarakan keadaannya oleh ayat-ayat yang lalu, karena yang bersangkutan enggan memanfaatkan petunjuk Allah yang telah diraihnya, sehingga Allah pun tidak memberinya kemampuan untuk mengamalkan petunjuk itu."
  }
]