[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa diberi taufik oleh Allah untuk beriman dan taat kepada Nya, maka dia dalah orang yang memperoleh taufik. Dan barngsiapa yang dibiarkan oleh Allah, dan Allah tidak memberinya taufik, maka dialah orang yang merugi lagi binasa. Hidayah dan kesesatan hanya berasal dari Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "178. Barangsiapa yang dibimbing oleh Allah ke jalan yang lurus, maka ia termasuk orang yang benar-benar mendapatkan petunjuk. Dan barangsiapa yang dijauhkan oleh Allah dari jalan yang lurus, maka orang-orang semacam itu adalah orang-orang yang benar-benar mengurangi kebahagiaan mereka sendiri. Mereka merugikan diri mereka sendiri dan merugikan keluarga mereka kelak di hari Kiamat. Ketahuilah bahwa itu adalah kerugian yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "178. kemudian setelah perumpamaan ini, Allah menyebutkan bahwa barangsiapa yang mendapat taufik dari Allah untuk menempuh jalan kebenaran dengan menggunakan akal dan panca indranya sesuai dengan kesucian fitrahnya, maka dia sungguh telah mendapat petunjuk yang dapat mengantarkannya kepada keridhaan Allah. Dan barangsiapa yang dihinakan Allah dengan dihalangi dari taufik-Nya karena lebih memilih jalan hawa nafsu dan setan daripada jalan petunjuk dan keimanan, maka dia adalah orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "178. مَن يَهْدِ اللهُ فَهُوَ الْمُهْتَدِى ۖ (Barangsiapa yang diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk) Yakni petunjuk kepada perintah Allah dan syariat yang ditetapkan bagi hamba-hamba-Nya. وَمَن يُضْلِلْ فَأُو۟لٰٓئِكَ هُمُ الْخٰسِرُونَ (dan barangsiapa yang disesatkan Allah, maka merekalah orang-orang yang merugi) Yakni yang merugi sepenuhnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "178 Barangsiapa yang diberi petunjuk oleh Allah dengan keimanan, kebaikan dan menjalankan perintah Alquran, maka dialah yang benar-benar mendapat petunjuk. Barangsiapa yang disesatkan Allah, maka merekalah orang-orang yang merugi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang diberi petunjuk Allah, maka dia mendapat petunjuk dan siapa saja yang disesatkan Allah, maka mereka adalah orang-orang yang merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "178 kemudian Allah menjelaskan bahwa Dialah satu satunya pemberi hidayah dan kesesatan “barangsiapa yang diberi petunjuk oleh Allah\" yakni dengan memberinya taufik kepada kebaikan menjaganya dari keburukan dan mengajarkan apa yang tidak dia ketahui “maka dialah yang mendapat petunjuk” yang sebenarnya karena dia mementingkan hidayah Allah “dan barangsiapa yang disesatkan Allah” dimana Dia tidak menolongnya dan tidak memberinya taufik kepada kebaikan “maka merekalah orang orang yang merugi\" bagi diri dan keluarga mereka pada hari kiamat itulah kerugian yang sebenarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 178: Ayat ini menunjukkan bahwa Allah sendiri yang memberikan hidayah dan menyesatkan. Dengan memberinya taufik kepada semua kebaikan, menjaganya dari keburukan dan memberinya ilmu tentang apa yang sebelumnya tidak diketahuinya. Karena Dia mengutamakan hidayah Allah Ta’ala. Disesatkan Allah berarti bahwa orang itu sesat berhubung keingkarannya dan tidak mau memahami ayat-ayat Allah, maka Allah akan membiarkannya dan tidak memberinya taufik kepada kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 178",
    "description": "Allah tidak meninggikan derajat siapa yang yang dibicarakan keadaannya oleh ayat-ayat yang lalu, karena yang bersangkutan enggan memanfaatkan petunjuk Allah yang telah diraihnya, sehingga Allah pun tidak memberinya kemampuan untuk mengamalkan petunjuk itu. Jika pada ayat yang lalu berbicara tentang siapa yang mendapat petunjuk dan disesatkan, pada ayat ini dijelaskan mengapa seseorang tidak mendapat petunjuk dan mengapa pula yang lain disesatkan. Dan demi keagungan dan kekuasaan kami, sungguh, akan kami isi neraka jahanam banyak dari kalangan jin dan manusia karena kesesatan mereka. Hal itu karena mereka memiliki hati, tetapi tidak dipergunakannya untuk memahami ayat-ayat Allah dan mereka memiliki mata tetapi tidak dipergunakannya untuk melihat tanda-tanda kekuasaan Allah, dan mereka mempunyai telinga tetapi tidak dipergunakannya untuk mendengarkan ayat-ayat Allah. Mereka layaknya seperti hewan ternak yang tidak menggunakan akal yang diberikan Allah untuk berpikir, bahkan mereka sebenarnya lebih sesat lagi dari binatang, sebab, binatang itu'dengan instinknya' akan selalu mencari kebaikan dan menghindari bahaya, sementara mereka itu malah menolak kebaikan dan kebenaran yang ada. Mereka itulah orang-orang yang lengah."
  }
]