[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada iblis, ”keluarlah dari surga dalam keadan dimurkai lagi terusir. Sesungguhnya aku benar-benar akan memenuhi isi jahanam denganmu dan orang-orang yang mengikutimu dari kalangan anak keturunan Adam bersama-sama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Allah berfirman kepada Iblis, “Keluarlah -wahai Iblis- dari Surga dalam keadaan tercela dan dijauhkan dari rahmat Allah. Dan Aku benar-benar akan memenuhi Neraka Jahanam di hari Kiamat dengan dirimu dan semua orang yang mengikuti dan mematuhimu serta membangkang perintah Rabbnya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Maka Allah membalasnya: \"Keluarlah dari surga dalam keadaan hina dan terusir.\" Kemudian Allah bersumpah bagi Iblis dan para pengikutnya dari golongan jin dan manusia, bahwa Dia akan memenuhi neraka jahanam dengan mereka. Dan Allah mengulangi perintah-Nya agar Iblis turun dari langit, untuk menegaskan dua perintah sebelumnya yaitu dengan berfirman: (فاهبط منها) hingga pada firman-Nya: (فاخرج)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. قَالَ اخْرُجْ مِنْهَا (Allah berfirman: “Keluarlah kamu dari surga itu) Dari langit atau surga. مَذْءُومًا (sebagai orang terhina) Yakni terhina lagi terusir. لَّمَن تَبِعَكَ مِنْهُمْ لَأَمْلَأَنَّ جَهَنَّمَ مِنكُمْ أَجْمَعِينَ (Sesungguhnya barangsiapa di antara mereka mengikuti kamu, benar-benar Aku akan mengisi neraka Jahannam dengan kamu semuanya) Ini merupakan sumpah dan peringatan dari Allah bagi orang yang tidak mentaati-Nya dan mengikuti jalan setan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Untuk menegaskan laknat dan pengasingan dirinya dari penduduk langit, Allah SWT berfirman kepada Iblis: “Keluarlah dari surga dalam keadaan disalahkan, dibenci dan tertolak dari rahmatKu. Dan Aku bersumpah untuk orang yang tidak menaatiKu dan mengikutimu, maka sungguh aku akan memenuhi neraka Jahanam dengan dirimu, keturunanmu dan seluruh orang yang mengikutimu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Keluarlah dari sana} dari surga {dalam keadaan terhina} terhina {dan terusir} terusir {Sungguh siapa pun yang mengikutimu di antara mereka} dari Bani Adam {pasti akan Aku isi neraka Jahanam dengan kalian semua.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. yakni Allah berfirman kepada iblis ketika dia mengatakan apa yang dikatakannya, ”keluarlah kamu dari surga itu” dalam keadaan hina dina bukan mulia, akan tetapi “sebagai yang terhina lagi terusir” dalam keadaan dijauhkan dari Allah dari rahmatNya dan dari segala kebaikan. ”benar-benar aku akan mengisi Neraka jahanam” denganmu dan dengan orang-orang yang mengikutimu “semuanya” ini adalah sumpah dari Allah bahwa neraka adalah tempat para ahli maksiat. Dia pasti memenuhi dengan iblis dan para pengikutnya dari golongan jin dan manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 18: Dari rahmat Allah dan dari semua kebaikan. Kamu dan anak cucumu serta manusia yang mengikutimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 18",
    "description": "Karena keangkuhan dan kedurhakaannya, Allah kemudian memberi sanksi tegas kepada iblis dan mengingatkan manusia untuk tidak mengikuti ajakannya. Allah berfirman, disebabkan kemaksiatan dan kesombonganmu, keluarlah kamu dari sana, yaitu dari dalam surga, dalam keadaan terhina akibat kedurhakaanmu dan juga dalam keadaan terusir, yakni dijauhkan dari rahmat dan nikmat Allah. Aku bersumpah demi keagungan-ku, sesungguhnya barang siapa di antara mereka, yakni manusia, ada yang mengikutimu dengan senantiasa melakukan kekafiran dan kemaksiatan, pasti akan aku isi neraka jahanam dengan kamu semua, setan dan manusia. Ayat ini menunjukkan bahwa neraka merupakan tempat iblis dan orang-orang yang mengikuti bujuk rayunya dengan bermaksiat kepada Allah. Setelah Allah menjelaskan besarnya permusuhan iblis kepada manusia dan ambisinya untuk menyesatkan manusia dengan berbagai cara, pada ayat-ayat berikut Allah menceritakan kisah iblis dalam me-nyesatkan adam dan istrinya. Hal ini amatlah penting agar manusia senantiasa waspada terhadap makar dan godaan iblis. Dan ingatlah ketika Allah berfirman, wahai adam! tinggAllah engkau bersama istrimu dalam surga yang penuh dengan kenikmatan dan makanlah dari berbagai jenis makanan apa saja yang kamu berdua sukai. Akan tetapi, ada satu hal yang terlarang, yaitu janganlah kamu berdua dekati pohon yang satu ini. Apabila kamu mendekatinya, kamu berdua termasuk orang-orang yang zalim. Hikmah dari larangan ini adalah untuk menguji manusia, sejauh mana ia bisa menunaikan perintah dan menghindari larangan. Ketika manusia melanggarnya, ia pun telah menzalimi dirinya."
  }
]