[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah memiliki nama-nama yang paling baik yang menunjukan kesempurnaan keagunganNya,dan tiap-tiap namaNya adalah baik. Maka mintalah kepadaNya dengan nama-namaNya, apa yang kalian kehendaki. Dan tinggalakanlah orang-orang yang melakukan perubahan dalam nama-namaNya dengan menambahi atau mengurangi atau menyelewengkannya, seperti dengan cara menamai dengannya sesuatu yang tidak pantas menyandangnya, seperti penamaan kaum musyrikin dengannya terhadap tuhan-tuhan mereka atau diadakan untuknya makna yang tidak dikehendaki Allah dan rasulNya. karenanya,mereka akan diberi balasan atas perbuatan-perbuatan buruk mereka yang mereka lakukaan di dunia, seperti kekafiran kepada Allah dan penyelewengan terhadap nama-namaNya serta mendustakan RasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "180. Dan Allah mempunyai asmā`ul ḥusnā (nama-nama yang terbaik) yang menunjukkan keagungan dan kesempurnaan-Nya. Maka gunakanlah nama-nama itu untuk tawasul kepada Allah dalam meminta sesuatu yang kalian inginkan dan pujilah menggunakan nama-nama terbaik tersebut. Dan tinggalkanlah orang-orang yang menyimpang dari jalan yang benar dalam memperlakukan nama-nama itu. Yaitu dengan menjadikannya sebagai nama untuk selain Allah, menafikannya dari Allah, menyelewengkan maknanya, atau menyerupakannya dengan selain Allah. Kami akan membalas orang-orang yang menyelewengkan nama-nama itu dari kebenaran dengan azab yang sangat pedih disebabkan apa yang telah mereka perbuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "180. Allah memerintahkan untuk mengikhlaskan ibadah bagi-Nya dan menjauhi orang-orang yang ingkar dan musyrik, yaitu dengan menjelaskan Dia Semata yang memiliki segala nama yang mempunyai makna yang baik, dan karena kesempurnaan nama itu, sehingga Dia tidak diseru kecuali dengan nama tersebut; hal ini mencakup ketika seorang hamba menyeru-Nya untuk beribadah maupun berdoa. Kemudian Allah memerintahkan untuk berpaling dari seluruh orang yang mengingkari nama-nama-Nya. dan hakikat sesungguhnya dari pengingkaran nama-nama itu adalah menjadikannya bukan pada tempatnya; baik itu dengan menamai sesuatu yang tidak layak memiliki nama-nama tersebut, seperti orang-orang musyrik yang menamai berhala-berhala mereka dengan nama-nama itu, mengingkari makna-maknanya dan merubahnya, atau menafsirkan maknanya yang tidak dimaksudkan Allah dan Rasul-Nya. Allah mengancam orang-orang yang mengingkari nama-nama Allah bahwa mereka akan mendapat balasan perbuatan mereka dari Allah, Tuhan semesta alam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "180. وَلِلّٰهِ الْأَسْمَآءُ الْحُسْنَىٰ (Hanya milik Allah asmaa-ul husna) Yakni Allah memiliki nama-nama yang paling baik untuk menunjukkan kebaikan dan kemuliaan Pemilik nama, seperti Maha Menyayangi, Maha berkuasa, Maha Mengetahui, Maha Bijaksana, Maha Perkasa, dan lain sebagainya. فَادْعُوهُ بِهَا ۖ (maka bermohonlah kepada-Nya dengan menyebut asmaa-ul husna itu) Dengan menyebut Ya Rahman, Ya Haliim, Ya ‘Aliim. Kerena Dia jika disebut dengan nama-nama baik-Nya dalam do’a maka itu menjadi salah satu sebab terkabulnya doa. وَذَرُوا۟ الَّذِينَ يُلْحِدُونَ فِىٓ أَسْمٰٓئِهِۦ ۚ (dan tinggalkanlah orang-orang yang menyimpang dari kebenaran dalam (menyebut) nama-nama-Nya) Yakni dengan mengubah lafadznya atau maknanya. Penyimpangan dalam penyebutan nama-nama Allah terjadi dalam tiga bentuk: 1. Dengan merubahnya sebagaimana yang dilakukan orang-orang musyrik, mereka mengambil nama al-Laata (nama berhala mereka) dari kata Allah, nama al-Uzza dari kata al-Aziz, nama al-Manah dari kata al-Mannan. 2. Dengan menambah nama-nama yang ada, yaitu dengan membuat nama-nama lain sesuai keinginan mereka tanpa dalil dari Allah tentang itu. 3. Dengan mengurangi nama-nama yang ada, yaitu dengan mengingkari sebagian nama yang Dia miliki. Ada pendapat mengatakan bahwa ayat ini diturunkan untuk seseorang dari kaum muslimin yang berdoa dalam shalatnya Yaa Rahman Ya Rahim. Lalu seseorang dari orang-orang musyrik berkata: bukankah Muhammad dan para sahabatnya mengaku bahwa mereka menyembah satu tuhan? Lalu mengapa orang ini berdoa kepada dua tuhan? Abu Hurairah berkata: Rasulullah besabda: “sesungguhnya Allah memiliki 99 nama, yakni 100 kurang satu. Barangsiapa yang menyebutkannya niscaya ia akan masuk surga. Dia itu bilangannya ganjil dan menyukai bilangan ganjil.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dan sesungguhnya semua nama yang Ia miliki senantiasa d hati hamba yang taat kepada Allah, dan beriman kepada nama-nama yang baik itu, dan sungguh seorang hamba tidak akan menemukan nama yang lebih baik dan lebih agung daripada nama-nama Allah. Semoga Allah senantiasa memberikan kta kecintaan kepada-Nya dan pengetahuan tentang nama-nama Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "180 Hanya milik Allah lah asmaa-ul husna nama-nama yang baik yang menunjukkan kesempurnaan dan kemuliaan sifat-Nya. Seperti Maha Pengampun, Maha Penyayang, Maha Mengetahui, dan Maha Kuasa, maka mohonlah kepada-Nya dengan menyebut asmaa-ul husna itu: Ya Rahman, Ya Rahim, Ya Halim Ya Ghafur dan seterusnya, sebab dengan menggunakan itu lebih besar peluang untuk dikabulkan doanya. Tinggalkanlah orang-orang musyrik yang menyimpang dari kebenaran dalam menyebut nama-nama-Nya. Seperti penyebutan mereka terhadap lafdhul jalalah dengan Ah yang maknanya mereka rubah dengan penyamaan terhadap makhluk. Juga dengan menyanggah kesempurnaan mutlak dari sifat Allah dengan menafsiri Kemahatahuan, Kemahamendengaran, dan Kemahamelihatan-Nya dengan sifat makhluk. Juga dengan merubah sifat/nama-nama Tuhan. Sebagaimana mereka dari nama Al aziz memeberikan nama uza, Al Manan dirubah dengan munah, atau dengan menambah maupun mengurangi. Nanti mereka akan mendapat balasan terhadap apa yang telah mereka kerjakan. Ayat ini turun untuk seorang laki-laki muslim yang berdoa dalam shalatnya: Ya Rahman, Ya Rahim. Kemudian orang-orang musyrik berkata: Muhammad dan para sahabatnya mengklaim bahwa mereka hanya menyembah satu tuhan, lalu bagaimana dengan perkataan pemuda itu yang menyebut dua tuhan? Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah memiliki nama-nama yang terbaik. Maka berdoalah kepadaNya dengan menyebut itu dan tinggalkanlah} tinggalkanlah {orang-orang yang mengingkari nama-namaNya} menyimpang dari kebenaran dengan nama-namaNya seperti orang-orang musyrik sebagaimana mereka menurunkan nama Latta dari nama “Allah” dan Uzza dari nama “Al-Aziz” {Mereka akan mendapat balasan atas apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "180 ini adalah penjelasan tentang agungnya kemuliaan Allah dan luasnya sifat-sifatNya bahwa Dia memiliki asma’ al husna, yakni Dia mempunyai semua nama yang baik. Pedomannya adalah bahwa ia adalah semua nama yang menunjukkan sifat kesempurnaan yang agung. Dengan itu ia menjadi husna, karena jika seandainya ia tidak menunjukan sifat, hanya sekedar nama saja ia bukan husna. Begitu juga jika seandainya ia menunjukan sifat yang bukan sifat sempurna, bisa sifat kekurangan atau sifat yang mungkin menunjukan sifat kekurangan atau kesempurnaan, maka ia bukan husna, Semua nama-nama Allah menunjukan semua sifat yang mana ia diambil darinya yang meliputi seluruh maknanya. Seperti \"al-alim\" yang menunjukan bahwa Dia memilki ilmu yang umum lagi menyeluruh serta meliputi segala sesuatu, maka tidak ada sekecil apapun di bumi dan di langit yang luput dari ilmu Allah. \"ar-rohim\" yang menunjukan bahwa Dia mempunyai rahmat yang agung yang mencakup segala sesuatu. \"al-Qodir\" yang menunjukan bahwa DIa memiliki kuasa yang sempurna, tak sesuatupun yang dapat melemahkanNya. Dan nama-nama Allah lainnya yang termasuk kesempurnaan husnanya adalah bahwa Dia tidak dipanggil kecuali dengannya. Oleh karena itu Dia berfirman ”maka mohonlah kepadaNYa dengan menyebut Asma al husna itu” Ini mencakup doa ibadah dan doa meminta. Dia dipanggil dalam setiap keinginan yang sesuai dengan keinginan tersebut permohonan misalnya mengucapkan ”ya Allah ampunilah aku, sayangilah aku. Sesungguhnya Engkau maha pengampun lagi maha penyayang terimalah taubatku wahai yang maha menerima taubat. Berikanlah rizki kepadaku wahai Dzat yang memberi rizki. Berlemah lembutlah kepadaku wahai Dzat yang maha lemah lembut. Dan yang sepertinya. FirmanNya, ”dan tinggalkanlah orang-orang yang menyimpang dari kebenaran dalam menyebut nama-namaNYa. Nanti mereka akan mendapat balasan terhadap apa yang telah mereka kerjakan.” yakni sebagai hukuman dan azab atas penyimpangannya pada nama-nama Allah. Hakikat penyimpangan yaitu membelokkannya dari apa yang ia jadikan untuknya. Bisa jadi ia digunakan sebagai nama untuk yang tidak berhak seperti orang-orang musyrikin yang memberi nama tuhan-tuhan mereka dengan nama namaNYa. Bisa jadi dengan meniadakan maknanya dan menyelewengkannya serta menafsirkannya dengan makna yang tidak diinginkan oleh Allah dan RasulNya, bisa pula dengan menyamakan dengan selainNya dengannya. Maka sudah sewajibnya berhati-hati terhadap penyimpangan dari para penyimpang padanya. Dalam hadits shahih dari Nabi beliau bersabda ”sesungguhnya Allah mempunyai Sembilan puluh Sembilan nama. Barangsiapa menghafalnya maka dia masuk surge” (HR. BUKHORI No. 2736)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 180: Karena nama-nama tersebut menunjukkan sifat sempurna yang agung. Contohnya: - Al ‘Aliim (Maha Mengetahui) yang menunjukkan bahwa Dia memiliki ilmu yang meliputi segala sesuatu, tidak keluar dari pengetahuan-Nya seberat biji dzarrah pun di langit maupun di bumi. - Ar Rahiim yang menunjukkan bahwa Dia memiliki sifat rahmat (sayang) yang agung dan luas mengena kepada segala sesuatu. - Al Qadiir yang menunjukkan bahwa Dia memiliki kekuasaan yang menyeluruh, tidak dapat dikalahkan oleh sesuatu. - Dsb. Misalnya berkata, “Yaa Razzaq, urzuqnaa.” (artinya: Wahai Pemberi rezeki, berilah kami rezeki), “Yaa ghafuur, ighfir lii” (artinya: Wahai Maha Pengampun, ampunilah aku), “Yaa rahiiim, irhamnii” (artinya: Wahai Maha Penyayang, sayangilah aku), dsb. Maksudnya: Jangan hiraukan orang-orang yang menyembah Allah dengan nama-nama yang tidak sesuai dengan sifat-sifat dan keagungan Allah, atau dengan memakai asmaa-ul husna, tetapi dengan maksud menodai nama Allah atau mempergunakan asmaa-ul husna untuk nama-nama selain Allah. Contoh ilhad adalah: - Berdoa kepada Allah Azza wa Jalla dengan nama yang tidak sesuai dengan doanya. Misalnya meminta ampunan dengan nama-Nya Al Hasib (Yang Menghisab). Seharusnya dengan nama-Nya Al Ghafuur (Maha Pengampun). - Menambah dan mengurangi. Maksud menambah adalah menambah dari yang diizinkan, yaitu dengan mentasybih (menyerupakan dengan makhluk), sedangkan maksud mengurangi adalah mengurangi dari yang diperintahkan, yaitu meniadakan. - Perbuatan yang dilakukan orang-orang musyrik, mereka menamai berhala mereka dengan 'Uzaa dari nama Allah Al 'Aziz, dan menamai dengan nama Laata, yang diambil dari laaz \"Allah\". Maha suci Allah dari hal tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 180",
    "description": "Demikianlah, seseorang terjerumus ke dalam neraka karena mengabaikan tanda-tanda keesaan Allah dan tidak mengingat-Nya. Maka pada ayat ini, Allah mengingatkan agar kita tidak melalaikannya dan selalu memanggil-Nya dengan nama-nama-Nya yang terbaik. Dan hanya Allah yang memiliki al-asma'' al-a'usna', yakni nama-nama terbaik yang menunjukkan keagungan dan kemahasempurnaan-Nya, maka berdoalah dan bermohonlah kepada-Nya dengan menyebutnya, yaitu al-asma' ala'usna' itu. Dan tinggalkanlah serta waspadalah terhadap orang-orang yang menyimpang dari kebenaran dengan menyalahartikan nama-nama-Nya. Jangan dihiraukan orang-orang yang menyembah Allah dengan menyebut nama-nama yang tidak sesuai dengan sifat-sifat keagungan Allah, atau dengan memakai al-asma' al-husna', tetapi dengan maksud menodai nama Allah atau mempergunakan al-asma' al-husna' untuk nama-nama selain Allah. Mereka kelak, di dunia atau di akhirat, akan mendapat balasan yang sesuai dengan kadar kedurhakaan mereka disebabkan apa yang telah mereka kerjakan. Kalau pada ayat 179 disebutkan tentang siapa yang akan menjadi penghuni neraka dari kalangan manusia dan jin, maka pada ayat ini di-tegaskan, dan di antara orang-orang yang telah kami ciptakan ada umat yang menjadi teladan dan selalu memberi petunjuk dengan dasar kebenaran, dan dengan dasar kebenaran itu pula mereka setiap saat selalu berlaku adil, tidak menyimpang ke kiri dan ke kanan, tetapi menelusuri jalan tengah yang merupakan jalan kebaikan, dan mereka juga selalu berlaku adil dalam memutus segala perkara. Mereka itulah yang akan menjadi penghuni surga."
  }
]