[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara makhluk yang telah kami ciptakan ada satu golongan yang utama yang berjalan dengan petunjuk kebenaran dan mengajak kepadanya, dan dengan itu mereka memutuskan perkara serta berlaku obyektif terhadap manusia. Mereka itu adalah tokoh-tokoh panutan dalam hidayah dan mereka termasuk orang-orang yang Allah menganugerahkan kepada mereka keimanan dan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "181. Di antara makhluk-makhluk Kami ada umat yang mendapatkan petunjuk dengan kebenaran dan mengajak orang lain kepadanya sehingga mereka pun mendapatkan petunjuk, dan dengan kebenaran itu pula mereka berlaku adil serta tidak zalim dalam memutuskan perkara."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "181. Allah menjelaskan bahwa Dia juga menciptakan umat yang sempurna dan menyempurnakan; mereka memberi hidayah kebenaran bagi dirinya dan orang lain, mereka mengetahui kebenaran, lalu mengamalkan dan mengajarkannya; dan mereka memberi hukum di antara manusia dengan kebenaran ketika memutuskan perkara tentang harta, darah, hak-hak, perkataan, dan lain sebagainya. Mereka adalah pemimpin-pemimpin dalam petunjuk dan pembawa cahaya kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "181. وَمِمَّنْ خَلَقْنَآ أُمَّةٌ (Dan di antara orang-orang yang Kami ciptakan ada umat) Terdapat pendapat mengatakan bahwa yang dimaksud adalah umat ini (umat Nabi Muhammad), dan mereka adalah golongan yang akan tetap Berjaya diatas kebenaran sebagaimana yang disebutkan dalam hadist shahih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "181 Di antara orang-orang yang Kami ciptakan ada umat yang memberi petunjuk dengan hak dan kebaikan, dan dengan yang hak itu pula mereka menjalankan keadilan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara orang-orang yang telah Kami ciptakan ada umat yang memberi petunjuk} memberi petunjuk {dengan kebenaran dan dengan itu mereka berlaku adil} menentukan keputusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "181 yakni diantara makhluk ciptaan kami terdapat umat yang utama lagi sempurna pada dirinya dan menyempurnakan yang lain, memberi petunjuk kepada Diri dan orang lain dengan kebenaran, mengamalkannya mengajarkannya mendakwahkannya dan mengajak orang lain untuk beramal dengannya. ”dan dengan yang haq itu (pula) mereka menjalankan keadilan,” diantara mereka dalam hokum-hukum mereka jika mereka menetapkannya pada harta, darah, hak, pendapat dan lain-lain. mereka itu adalah para imam hidayah dan lampu di kegelapan. Mereka itulah yang diberi nikmat oleh Allah dengan nikmat iman, amal shalih, saling berwasiat dalam kebenaran dan kesabaran, mereka itu adalah para shidiqin yang mana derajat mereka dibawah derajat kerasulan. Mereka sendiri bertingkat-tingkat. Masing masing berdasarkan sesuai dengan keadaan dan kedudukannya. Maha suci Allah yang mengkususkan rahmatNya kepada siapa yang dikehendaki dan Allah adalah pemilik karunia yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 181: Di antara orang-orang yang diciptakan Allah ada orang-orang yang sempurna dan menyempurnakan orang lain; mereka mengetahui kebenaran dan mengamalkannya, mengajarkannya dan mengajak manusia kepadanya. Ketika memutuskan, baik dalam masalah harta, darah, hak-hak, maupun lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 181",
    "description": "Kalau pada ayat 179 disebutkan tentang siapa yang akan menjadi penghuni neraka dari kalangan manusia dan jin, maka pada ayat ini di-tegaskan, dan di antara orang-orang yang telah kami ciptakan ada umat yang menjadi teladan dan selalu memberi petunjuk dengan dasar kebenaran, dan dengan dasar kebenaran itu pula mereka setiap saat selalu berlaku adil, tidak menyimpang ke kiri dan ke kanan, tetapi menelusuri jalan tengah yang merupakan jalan kebaikan, dan mereka juga selalu berlaku adil dalam memutus segala perkara. Mereka itulah yang akan menjadi penghuni surga. Dan sebaliknya, orang-orang yang mendustakan ayat-ayat kami, baik berupa ayat-ayat Al-Qur'an, maupun mukjizat para nabi atau buktibukti keesaan dan kekuasaan Allah yang terhampar, akan kami biarkan mereka berangsur-angsur, setahap demi setahap, menuju ke arah kebinasaan, hingga mencapai tahap maksimal. Di saat tingkat kekayaan dan kesenangan dunia telah membuat mereka lupa daratan, maka mereka akan sangat terkejut ketika kebinasaan itu datang dengan cara yang tidak mereka ketahui, dan aku akan memberikan tenggang waktu berupa kesempatan hidup yang cukup, atau menangguhkan siksa dengan menganugerahkan kenikmatan kepada mereka yang menjadikan mereka lupa daratan, tanpa melupakan kejahatan-kejahatan yang mereka lakukan. Sungguh, rencana-ku yang pada lahirnya adalah kenikmatan untuk mereka, tetapi tujuannya adalah kebinasaan, sangat teguh, tidak satu pun yang dapat membatalkannya dan akan sangat menyakitkan mereka, sesuai dengan kadar kejahatan yang mereka lakukan."
  }
]