[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendustakan ayat-ayat kami lalu mereka mengingkarinya, dan tidak mengambilnya sebagai pelajaran,maka Kami akan membukakan bagi mereka pintu-pintu rizki dan berbagai macam jenis sumber penghidupan di dunia sebagai istidraj (penguluran waktu semata) bagi mereka,sehingga mereka terpedaya dengan keadaan mereka dan meyakini bahwa mereka berada di atas kebenaran, kemudian kami akan menyiksa mereka secara tiba-tiba di esok hari sedang mereka dalam keadaan tidak menyadarinya. Ini adalah siksaan dari Allah atas tindak pendustaan terhadap hujjah-hujjah Allah dan ayat-ayatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "182. Dan orang-orang yang mendustakan ayat-ayat Kami dan tidak beriman kepadanya, melainkan ingkar kepadanya, Kami akan buka untuk mereka pintu-pintu rezeki, bukan untuk memuliakan mereka, tetapi untuk mengelabui mereka agar mereka terus melanjutkan kesesatan yang tengah mereka jalani, kemudian azab Kami akan menimpa di saat mereka lengah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "182. Kemudian Allah menjelaskan keadaan orang-orang yang mendustakan ayat-ayat yang menunjukkan kebenaran petunjuk Nabi Muhammad dengan menolak mengimaninya, bahwa Allah akan membiarkan mereka sejenak dan menjerumuskan mereka ke dalam kebinasaan secara pelan-pelan; siksaan mereka akan dilipatgandakan dengan kenikmatan yang telah mereka dapatkan, hingga mereka akan dibinasakan secara tiba-tiba dari arah yang tidak mereka sangka. Allah memperlakukan ini kepada mereka sebagai istidraj."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "182. سَنَسْتَدْرِجُهُم (nanti Kami akan menarik mereka dengan berangaur-angsur (ke arah kebinasaan)) Istidraj yakni siksaan dengan berangsur-angsur tahap demi tahap. Yaitu dengan menjadikan mereka dalam gelimang kenikmatan dan menjadikan mereka lalai untuk bersyukur sehingga mereka benar-benar dalam kesesatan dan jauh dari jalan hidayah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "182 Dan orang-orang yang mendustakan ayat-ayat Kami (Alquran), dari golongan penduduk Makkah dan lainnya, nanti Kami akan tarik mereka menuju kebinasaan dengan berangsur-angsur, dengan cara yang tidak mereka ketahui. Istidraj adalah pemberian secara perlahan-lahan dalam kenikmatan dan tanpa ada rasa syukur dengan maksud menuntun ke arah kebinasaan,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang mendustakan ayat-ayat Kami akan Kami membuat mereka berangsur-angsur} membuat mereka berangsur-angsur tingkatan demi tingkatan menuju kebinasaan {dari arah yang tidak mereka ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "182 yakni dan orang orang yang mendustakan ayat ayat Allah yang menunjukan kebenaran hidayah yang dibawa oleh Muhammad lalu mereka menolaknya dan tidak menerimanya. ”nanti kami akan menarik mereka dengan berangsur angsur (kearah kebinasaan) dengan cara yang tidak mereka ketahui” yakni dengan mengucurkan rizki kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 182: Dengan memperbanyak rezeki mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 182",
    "description": "Dan sebaliknya, orang-orang yang mendustakan ayat-ayat kami, baik berupa ayat-ayat Al-Qur'an, maupun mukjizat para nabi atau buktibukti keesaan dan kekuasaan Allah yang terhampar, akan kami biarkan mereka berangsur-angsur, setahap demi setahap, menuju ke arah kebinasaan, hingga mencapai tahap maksimal. Di saat tingkat kekayaan dan kesenangan dunia telah membuat mereka lupa daratan, maka mereka akan sangat terkejut ketika kebinasaan itu datang dengan cara yang tidak mereka ketahui, dan aku akan memberikan tenggang waktu berupa kesempatan hidup yang cukup, atau menangguhkan siksa dengan menganugerahkan kenikmatan kepada mereka yang menjadikan mereka lupa daratan, tanpa melupakan kejahatan-kejahatan yang mereka lakukan. Sungguh, rencana-ku yang pada lahirnya adalah kenikmatan untuk mereka, tetapi tujuannya adalah kebinasaan, sangat teguh, tidak satu pun yang dapat membatalkannya dan akan sangat menyakitkan mereka, sesuai dengan kadar kejahatan yang mereka lakukan"
  }
]