[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan aku menangguhkan bagi orang-orang yang mendustakan ayat-ayat kami sampai mereka menyangka bahwa sesungguhnya mereka tidak akan tertimpa siksaan, sehingga mereka bertambah kafir dan melampaui batas. Dengan demikian, siksaan mereka akan berlipat ganda. sesungguhnya rencaana hukuman balasanKu adalah mantap, yakni kuat lagi dahsyat, tidak dapat ditolak dengan kekuatan maupun strategi apa pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "183. Kami menunda hukuman mereka sampai mereka mengira bahwa mereka tidak dihukum, sehingga mereka terus melanjutkan penolakan dan kekafiran mereka hingga azab mereka dilipatgandakan. Sesungguhnya tipu daya-Ku sangat kuat. Maka Aku memperlihatkan kebaikan kepada mereka, padahal Aku menghendaki kehinaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "183. Allah akan memanjangkan umur orang-orang yang mendustakan yang diberi istidraj itu, dan melapangkan sebab-sebab kehidupan mewah bagi mereka, hingga mereka merasa tidak akan disiksa, sehingga mereka semakin kafir dan membangkang, serta menambah keburukan; dengan begitu siksaan bagi mereka akan semakin berat dan berlipatganda, sehingga mereka telah membahayakan diri mereka tanpa mereka sadari. Sungguh tipu daya Allah sangat kuat, tidak ada yang mampu melawannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "183. وَأُمْلِى لَهُمْ ۚ (Dan Aku memberi tangguh kepada mereka) Yakni Aku akan memberi mereka tenggang waktu dan mengakhirkan siksaan atas mereka. إِنَّ كَيْدِى مَتِينٌ (Sesungguhnya rencana-Ku amat teguh) Karena secara kasat mata itu merupakan kenikmatan namun sebenarnya merupakan kehinaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "183-184 Aku memberi tangguh hukuman kepada mereka. Sesungguhnya rencana-Ku amat teguh, perkasa tanpa terucap. Apakah mereka lalai dan tidak memikirkan dengan akal mereka atau tidak memperhatikan bahwa teman mereka (Muhammad) tidak berpenyakit gila. Muhammad itu tidak lain hanyalah seorang pemberi peringatan atas siksa Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku memberi tenggang waktu kepada mereka} Aku memberi tenggang waktu mereka dan memanjangkan waktu umur mereka {Sesungguhnya rencanaKu sangat teguh} janjiKu sangat kuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "183 “dan aku memberi tangguh kepada mereka” yakni aku menunda mereka sehingga mereka mengira bahwa mereka dibiarkan dan tidak diazab. maka kejahatan, kekufuran dan keburukan mereka semakin bertambah dengan itu siksa azab mereka bertambah, maka tanpa mereka sadari justru mereka merugikan diri mereka. Oleh karena itu Allah berfirman ”sesungguhnya rencanaKu amat teguh” yakni kuat lagi kokoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 183: Sehingga mereka mengira bahwa mereka tidak akan disiksa dan diberikan hukuman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 183",
    "description": "Dan sebaliknya, orang-orang yang mendustakan ayat-ayat kami, baik berupa ayat-ayat Al-Qur'an, maupun mukjizat para nabi atau buktibukti keesaan dan kekuasaan Allah yang terhampar, akan kami biarkan mereka berangsur-angsur, setahap demi setahap, menuju ke arah kebinasaan, hingga mencapai tahap maksimal. Di saat tingkat kekayaan dan kesenangan dunia telah membuat mereka lupa daratan, maka mereka akan sangat terkejut ketika kebinasaan itu datang dengan cara yang tidak mereka ketahui, dan aku akan memberikan tenggang waktu berupa kesempatan hidup yang cukup, atau menangguhkan siksa dengan menganugerahkan kenikmatan kepada mereka yang menjadikan mereka lupa daratan, tanpa melupakan kejahatan-kejahatan yang mereka lakukan. Sungguh, rencana-ku yang pada lahirnya adalah kenikmatan untuk mereka, tetapi tujuannya adalah kebinasaan, sangat teguh, tidak satu pun yang dapat membatalkannya dan akan sangat menyakitkan mereka, sesuai dengan kadar kejahatan yang mereka lakukan. Mereka terlalu cepat mendustakan, dan karena pengingkaran mereka terhadap ayat-ayat Allah lahir dari pengingkaran terhadap rasul yang menyampaikannya, maka ayat ini menyatakan, dan apakah mereka yang mendustakan ayat-ayat Allah dan ditangguhkan siksa atas mereka itu lengah dan tidak merenungkan bahwa teman yang selalu bersama mereka, yaitu nabi Muhammad, tidak gila. Rasulullah sama sekali tidak gila! dia, nabi Muhammad, tidak lain hanyalah seorang pemberi peringatan, lagi pemberi penjelasan tentang akibat perbuatan syirik mereka."
  }
]