[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang mendustakan ayat-ayat Kami tidak mau berpikir lalu merenungi dengan akal-akal sehat mereka dan mengetahui bahwa sesungguhnya pada diri Muhammad tidak ada itu gejala kegilaan? tiada lain Dia itu hanyalah seorang pemberi peringatan bagi mereka dari siksaan Allah atas orang-orang yang kafir jika mereka tidak mau beriman, lagi seorang pemberi nasihat yang nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "184. Tidakkah orang-orang yang mendustakan ayat-ayat Allah dan rasul-Nya itu mau berpikir dan menggunakan akal sehat mereka agar mereka mendapatkan kejelasan bahwa Muhammad -ṣallallāhu 'alaihi wa sallam- bukanlah orang gila, melainkan utusan dari Allah yang bertugas memberikan peringatan dengan jelas akan adanya azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "184. Kemudian Allah menegaskan kebenaran Rasulullah dan mengingkari penyakit gila yang dituduhkan mereka kepadanya. Seandainya mereka memakai fikiran mereka, apakah orang yang mereka kenal dengan baik itu memiliki sifat-sifat orang gila? Hendaklah mereka melihat akhlak, perilaku, dan sifat-sifatnya, serta apa yang dia serukan, niscaya mereka tidak akan mendapatkan kecuali sebaik-baik sifat dan akhlak yang paling sempurna, serta akal dan kecerdasan yang melebihi orang lain; dan orang yang memiliki ciri demikian adalah seorang pemberi peringatan yang sesungguhnya, dan bukan orang gila sebagaimana yang dikatakan orang-orang musyrik. Dia adalah pemberi peringatan yang jelas, dan tidak lalai dari memperingatkan kalian dari akibat buruk pendustaan risalah dan dari menasehati kalian agar kalian mendapat kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "184. أَوَلَمْ يَتَفَكَّرُوا۟ ۗ (Apakah (mereka lalai) dan tidak memikirkan) Tentang Rasulullah dan apa yang dibawanya. مَا بِصَاحِبِهِم مِّن جِنَّةٍ ۚ (bahwa teman mereka (Muhammad) tidak berpenyakit gila) Yakni sesuatu yang mereka katakan adalah bagian dari kegilaan. إِنْ هُوَ إِلَّا نَذِيرٌ مُّبِينٌ (Dia (Muhammad itu) tidak lain hanyalah seorang pemberi peringatan lagi pemberi penjelasan) Yakni pemberi peringatan dari Allah kepada mereka, dan dia memiliki bukti atas kenabiannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "183-184 Aku memberi tangguh hukuman kepada mereka. Sesungguhnya rencana-Ku amat teguh, perkasa tanpa terucap. Apakah mereka lalai dan tidak memikirkan dengan akal mereka atau tidak memperhatikan bahwa teman mereka (Muhammad) tidak berpenyakit gila. Muhammad itu tidak lain hanyalah seorang pemberi peringatan atas siksa Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak berpikir bahwa teman mereka} Muhammad SAW {tidak gila} gila {Sesungguhnya dia hanyalah pemberi peringatan yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "184 “apakah mereka lalai dan tidak memikirkan bahwa teman mereka (Muhammad) tidak berpenyakit gila” yakni apakah mereka tidak memakai pikiran dan melihat teman mereka yang mereka kenal dan tidak sedikit pun keadaanya yang samar bagi mereka, apakah dia gila? Hendaknya mereka melihat akhlaknya, sifatnya, perangainya dan tingkah lakunya, dan melihat dakwah yang diserukannya, maka mereka pasti tidak menemukan sifat-sifat kecuali yang paling sempurna tidak mendapati akhlak-akhlak kecuali yang paling utama, dan tidak pula menyaksikan akal dan pemikiran kecuali ia mengungguli seluruh manusia. Dia tidak berseru kecuali kepada kebaikan, dan tidak melarang kecuali dari segala yang buruk. Apakah dengan sifat sifat seperti ini wahai orang orang yang berakal dia dianggap gila? ataukah dia adalah imam yang agung pemberi nasihat yang mulia, yang bersifat dermawan, penyayang dan lemah leembut? oleh karena itu Dia berfirman ”Dia Muhammad itu tidak lain hanyalah seorang pemberi peringatan lagi pemberi penjelasan” yakni mengajak makhluk kepada apa yang dapat menyelamatkan mereka dari azab dan meraih pahala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 184: Perhatikanlah akhlaknya, petunjuknya, sifatnya, dan seruannya, bukankah mereka tidak mendapatkan selain sifat, akhlak, akal dan pendapatnya yang sempurna pada dirinya, di samping itu Beliau tidaklah mengajak selain kepada semua kebaikan, dan tidak melarang selain daripada keburukan. Yang mengajak manusia kepada perkara yang menyelamatkan mereka dari azab dan mendatangkan pahala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 184",
    "description": "Mereka terlalu cepat mendustakan, dan karena pengingkaran mereka terhadap ayat-ayat Allah lahir dari pengingkaran terhadap rasul yang menyampaikannya, maka ayat ini menyatakan, dan apakah mereka yang mendustakan ayat-ayat Allah dan ditangguhkan siksa atas mereka itu lengah dan tidak merenungkan bahwa teman yang selalu bersama mereka, yaitu nabi Muhammad, tidak gila. Rasulullah sama sekali tidak gila! dia, nabi Muhammad, tidak lain hanyalah seorang pemberi peringatan, lagi pemberi penjelasan tentang akibat perbuatan syirik merekamereka sungguh telah mendustakan nabi Muhammad yang mengajak mereka untuk mengesakan Allah. Kini Allah mengajak mereka untuk memperhatikan alam raya, dengan firman-Nya, dan apakah mereka juga buta sehingga tidak memperhatikan dan mengambil pelajaran dari apa yang terbentang pada kerajaan langit dan bumi dan segala apa yang diciptakan Allah, yang semuanya menunjuki keesaan, keagungan dan kekuasaan-Nya, dan apakah mereka juga tidak melihat dan memikirkan dengan rasa takut tentang kemungkinan telah dekatnya waktu kebinasaan mereka' mereka tidak berpikir bahwa ajal mereka sebenarnya sudah dekat, atau paling tidak, sudah semakin dekat, sehingga mereka cepat-cepat merenungi dan mencari kebenaran sebelum ajal mereka tiba. Jika Al-Qur'an tidak juga membuat mereka percaya, lalu berita mana lagi setelah ini yang akan mereka percayai'"
  }
]