[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tidak memperhatikan mereka itu orang-orang yang mendustakan ayat-ayat Allah di dalam kerajaan Allah yang agung dan kekuasaanNYa yang besar di langit dan di bumi, dan tidaklah Allah menciptakan apa pun di dalamnya, lalu mereka mau mencermatinya dan mengambil pelajaran darinya dan mereka merenungi ajal-ajal mereka yang mungkin saja telah dekat waktunya, lalu mereka binasa dengan membawa kekafiran dan kemudian berpulang menuju siksaan Allah dan hukumanNya yang pedih? dengan ancaman dan peringatan apalagi setelah peringatan dari al-qur’an ini yang akan mereka percayai dan mereka malakukan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "185. Tidakkah mereka mau memperhatikan kerajaan langit dan bumi dan melihat apa yang Allah ciptakan di dalamnya, seperti hewan, tumbuh-tumbuhan, dan lain-lain, dan memikirkan ajal mereka yang boleh jadi waktunya sudah dekat, kemudian mereka bertobat sebelum terlambat? Jika mereka tidak mau beriman kepada Al-Qur`ān dan isinya, baik berupa janji maupun ancaman, maka kitab apa lagi selain Al-Qur`ān yang akan mereka yakini?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "185. Al-Qur’an menyeru mereka agar mencermati dan menggunakan akalnya untuk mendapatkan dalil kekuasaan Allah, dan menyayangkan kekurangan mereka mencermati ayat-ayat kauniyah setelah al-Qur’an mengolok mereka yang lalai dalam memikirkan perkara Rasulullah. Hal ini kerena mereka tidak mencermati dan mencari pelajaran dari kerajaan langit berupa matahari, bulan, bintang, dan lain sebagainya; dan kerajaan bumi berupa lautan, pegunungan, hewan-hewan, dan lain sebagainya. Mereka juga tidak mencermati berbagai jenis makhluk yang telah diciptakan Allah yang tidak dapat terhitung, yang menjadi bukti bahwa alam semesta ini memiliki Pencipta Yang Maha Kuasa yang berhak disembah dan dipatuhi. Sebagaimana mereka juga tidak mencermati dekatnya ajal mereka yang mungkin bisa terjadi kapan saja, sehingga mereka tidak bersegera dalam mencari kebenaran dan menuju apa yang dapat menyelamatkan mereka sebelum kematian datang kepada mereka dengan tiba-tiba, dan azab menimpa mereka sedangkan mereka masih dalam keadaan tersesat. Maka dengan perkataan seperti apa lagi mereka akan beriman?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "185. أَوَلَمْ يَنظُرُوا۟ فِى مَلَكُوتِ السَّمٰوٰتِ وَالْأَرْضِ (Dan apakah mereka tidak memperhatikan kerajaan langit dan bumi) Maksudnya adalah bahwa mereka tidak berfikir untuk mengambil manfaat dari hasil pemikiran mereka, dan tidak pula mengamati makhluk-makhluk ciptaan Allah sehingga dapat mengantarkan mereka pada keimanan kepada Allah. وَمَا خَلَقَ اللهُ مِن شَىْءٍ(dan segala sesuatu yang diciptakan Allah) Baik itu hewan-hewan, tumbuhan, bintang-bintang, dan yang lainnya. وَأَنْ عَسَىٰٓ أَن يَكُونَ قَدِ اقْتَرَبَ أَجَلُهُمْ ۖ( dan kemungkinan telah dekatnya kebinasaan mereka) Hingga mereka mati dalam waktu dekat. Lalu mengapa mereka tidak mengamati apa yang dapat mengantarkan mereka kepada hidayat dan memberi manfaat bagi mereka sebelum habis waktu yang diberikan kepada mereka untuk mengamati, beriman, dan beribadah dengan datangnya ajal mereka. فَبِأَىِّ حَدِيثٍۭ بَعْدَهُۥ يُؤْمِنُونَ(Maka kepada berita manakah lagi mereka akan beriman sesudah Al Quran itu?) Yakni maka dengan perkataan apa lagi mereka akan beriman jika mereka tidak beriman kepada al-qur’an, karena tidak ada perkataan yang lebih baik dari kalamullah dan tidak ada yang lebih berpengaruh darinya bagi seseorang untuk mengajak berfikir dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "185 Sesungguhnya mereka tidak memperhatikan kerajaan langit dan bumi dan segala sesuatu yang diciptakan Allah berupa bintang, tumbuhan, hewan dan lainnya, sehingga dapat menuntun mereka kepada keimanan, dan kemungkinan telah dekatnya kebinasaan mereka? Maka kepada berita manakah lagi mereka akan beriman sesudah Al Quran itu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan kerajaan langit dan bumi} kerajaan dan kekuasaan Allah di langit dan bumi {dan apa yang diciptakan Allah dan kemungkinan telah makin dekat waktu mereka} waktu kematian mereka mendekat sedangkan mereka masih dalam kekufuran {Lalu berita mana lagi setelah ini yang akan mereka percayai} maka peringatan mana lagi setelah Al-Qur’an yang mereka percayai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "185 “dan apakah mereka tidak memperhatikan kerajaan langit dan bumi” sesungguhnya jika mereka melihat kepadanya, maka mereka akan mendapatinya sebagai bukti yang menunjukkan keesaan penciptanya dan kesempurnaan sifat-sifat yang dimilikiNya “dan” begitu pula hendaknya mereka melihat ”segala sesuatu yang diciptakan Allah” karena seluruh bagian alam raya ini menunjukan secara jelas kepada ilmu Allah, kodratNya, hikmahNya, keluasan rahmatNya, kebaikanNya kehendakNya yang pasti terlaksana, dan sifat sifat agung yang lainnya yang menunjukan keesaanNya dalam penciptaan dan pengaturan yang mengantarkan kepada keyakinan bahwa Dialah yang berhak disembah, dipuji, disucikan, diesakan dan dicintai. Dan firmanNya ”dan kemungkinan telah dekatnya kebinasaan mereka?” yakni hendaknya mereka melihat keadaan mereka sendiri secara khusus, melihat diri mereka sebelum ajal datang mendekat dan kematian hadir secara tiba-tiba, sementara mereka dalam keadaan berpaling dan lalai, maka dalam kondisi itu mereka tidak mungkin mengejar ketertinggalan. ”maka kepada berita manakah lagi mereka akan beriman selain kepada al quran itu?” yakni jika mereka tidak beriman kepada kitab yang mulia ini, lalu kepada apakah mereka beriman? apakah kepada kitab-kitab kesesatan dan kebatilan? ataukah kepada ucapan pendusta dan pembual?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 185: Manusia apabila memperhatikan kerajaan langit dan bumi, tentu akan memperoleh dalil yang menunjukkan keesaan Allah dan sifat-sifat sempurna yang dimiliki-Nya. Demikian pula apabila mereka melihat salah satu ciptaan Allah, maka di sana dia akan mendapatkan dalil terhadap ilmu Allah, kekuasaan-Nya, hikmah-Nya, luas rahmat dan ihsan-Nya, serta menunjukkan berlakunya kehendak Allah dan menunjukkan sifat-sifat-Nya yang agung yang sesungguhnya menunjukkan bahwa Allah sendiri yang mencipta dan mengatur alam semesta. Hal ini sudah barang tentu mengharuskan agar Dia (Allah) saja yang disembah. Hendaknya mereka memperhatikan keadaan mereka, karena boleh jadi maut datang kepada mereka secara tiba-tiba ketika mereka sedang lengah, sehingga mereka tidak mampu mengejar hal yang telah luput. Apakah berita dusta dan sesat yang mereka percayai ataukah berita yang benar ini (Al Qur’an)? Akan tetapi, walau bagaimana pun juga orang yang disesatkan Allah sudah tidak ada jalan lagi untuk menunjukinya sebagaimana diterangkan pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 185",
    "description": "Mereka sungguh telah mendustakan nabi Muhammad yang mengajak mereka untuk mengesakan Allah. Kini Allah mengajak mereka untuk memperhatikan alam raya, dengan firman-Nya, dan apakah mereka juga buta sehingga tidak memperhatikan dan mengambil pelajaran dari apa yang terbentang pada kerajaan langit dan bumi dan segala apa yang diciptakan Allah, yang semuanya menunjuki keesaan, keagungan dan kekuasaan-Nya, dan apakah mereka juga tidak melihat dan memikirkan dengan rasa takut tentang kemungkinan telah dekatnya waktu kebinasaan mereka' mereka tidak berpikir bahwa ajal mereka sebenarnya sudah dekat, atau paling tidak, sudah semakin dekat, sehingga mereka cepat-cepat merenungi dan mencari kebenaran sebelum ajal mereka tiba. Jika Al-Qur'an tidak juga membuat mereka percaya, lalu berita mana lagi setelah ini yang akan mereka percayai' mereka enggan mengikuti Al-Qur'an dan keterangan yang disampaikan rasul, sehingga berlakulah keketapan Allah, yaitu barangsiapa dibiarkan sesat oleh Allah, karena pilihan dan usahanya sendiri, atau karena kebejatan hati dan keengganannya memanfaatkan petunjuk, maka baginya tidak ada seorang pun yang mampu memberi petunjuk guna mengantarkannya kepada kebahagiaan dan memberinya kemampuan untuk melaksanakan petunjuk. Allah akan terus membiarkannya selalu terombang-ambing dalam kesesatan, sehingga tidak menemukan jalan kebenaran."
  }
]