[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), ”aku tidak kuasa mendatangkan kebaikan bagi diriku dan tiadk dapat menolak keburukan yang menimpanya kecuali yang dikehendaki Allah. Dan seandainya aku mengetahui perkara ghaib, pastilah aku menempuh cara-cara yang aku tahu akan memperbanyak kebaikan-kebaikan dan manfaat-manfaat bagi diriku dan tentulah aku dapat menghindari keburukan yang akan terjadi sebelum ia datang. (Namun) aku tidak lain hanyalah seorang utusan Allah. Dia mengutusku kepada kalian. Aku peringatkan kalian dari siksaanNYa dan aku beri kabar gembira dengan pahalaNYa bagi kaum yang mau membenarkan bahwa sesungguhnya aku adalah utusan Allah dan mereka mengamalkan syari’atNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "188. Katakanlah -wahai Muhammad-, “Aku tidak punya kemampuan untuk mendatangkan manfaat bagi diriku sendiri, dan aku pun tak dapat menghindarkan diriku dari mara bahaya, kecuali apa yang dikehendaki oleh Allah. Sesungguhnya semua itu berpulang kepada Allah. Dan aku juga tidak mengetahui apa pun selain apa yang Allah ajarkan kepadaku. Maka aku tidak mengetahui perkara yang gaib. Sekiranya aku mengetahui perkara yang gaib niscaya aku akan melakukan hal-hal yang kuketahui dapat mendatangkan keuntungan bagiku dan menghindarkan diriku dari kerugian, karena (jika demikian) aku akan mengetahui segala sesuatu sebelum terjadi dan mengetahui hasil akhir. Aku bukanlah siapa-siapa melainkan utusan dari Allah. Aku memperingatkan akan adanya siksa Allah yang sangat pedih. Dan aku memberikan kabar gembira akan adanya balasan yang mulia bagi orang-orang yang percaya bahwa aku adalah utusan Allah -Subḥānahu wa Ta'ālā- dan mereka membenarkan ajaran yang kubawa.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "188. Kemudian Allah memerintahkan nabi-Nya untuk menjelaskan kepada manusia bahwa segala urusan berada ditangan Allah, dan ilmu ghaib tidak ada yang mengetahuinya kecuali Allah. Bahkan aku tidak mampu mendatangkan manfaat atau mudharat bagi diriku sendiri kecuali jika Allah menghendaki, sehingga kemampuanku tersebut tergantung pada kehendak Allah. Dan aku tidak memiliki ilmu kecuali yang telah Allah ajarkan kepadaku. Seandainya aku mengetahui ilmu ghaib, niscaya aku akan melakukan hal-hal yang dapat mendatangkan kebaikan dan manfaat bagiku dan menjauhkan segala keburukan yang akan mendatangiku. Aku hanyalah seorang hamba yang diutus Allah sebagai pemberi peringatan terhadap siksaan siksaan dunia dan akhirat, dan menjelaskan perbuatan-perbuatan yang dapat menjerumuskan ke dalamnya; dan sebagai pembawa kabar gembira tentang pahala di dunia dan di akhirat, dan menjelaskan perbuatan-perbuatan yang dapat mengantarkan kepadanya. Akan tetapi tidak semua orang menerima peringatan dan kabar gembira ini, namun hanya orang-orang beriman lah yang mendapat manfaat darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "188. قُل لَّآ أَمْلِكُ لِنَفْسِى نَفْعًا وَلَا ضَرًّا إِلَّا مَا شَآءَ اللهُ ۚ( Katakanlah: “Aku tidak berkuasa menarik kemanfaatan bagi diriku dan tidak (pula) menolak kemudharatan kecuali yang dikehendaki Allah) Kalimat ini untuk menegaskan penjelasan tentang ketidaktahuan Rasulullah tentang bagaimana terjadinya hari kiamat dan kapan terjadi. Maka jika aku tidak mengetahui waktu terjadinya kiamat maka terlebih lagi aku tidak mengetahui ilmu yang dikhususkan Allah bagi diri-Nya. وَلَوْ كُنتُ أَعْلَمُ الْغَيْبَ لَاسْتَكْثَرْتُ مِنَ الْخَيْرِ(Dan sekiranya aku mengetahui yang ghaib, tentulah aku membuat kebajikan sebanyak-banyaknya) Yakni pasti aku akan membeli jika apa yang aku beli itu memberiku keuntungan dan aku pasti akan menjual jika apa yang aku jual itu memberiku keuntungan, sehingga hartaku menjadi banyak dan aku tidak merugi dalam perdagangan. Dan aku pasti akan mendatangi apa yang dapat mendatangkan kebaikan bagiku, dan menjauhi apa yang dapat memberiku keburukan agar tidak menimpaku. إِنْ أَنَا۠ إِلَّا نَذِيرٌ وَبَشِيرٌ لِّقَوْمٍ يُؤْمِنُونَ(Aku tidak lain hanyalah pemberi peringatan, dan pembawa berita gembira bagi orang-orang yang beriman) Yakni sebagai penyampai hukum-hukum Allah, dengannya aku memberi peringatan segolongan umat dan dengannya pula aku memberi kabar gembira segolongan umat yang lain. Dan aku tidak mengetahui hal-hal ghaib Allah, serta tugasku bukanlah sebagai penyampai hal-hal ghaib, dan mengetahui hal ghaib bukanlah sifatku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "188 Katakanlah kepada mereka wahai Nabi sebagai penekanan bahwa engkau tidak tahu mengenai hari kiamat: “Aku tidak berkuasa menarik kemanfaatan bagi diriku dan tidak pula mampu menolak kemudharatan kecuali yang dikehendaki Allah dan ilham dan taufiq-Nya kepadaku. Dan sekiranya aku mengetahui yang ghaib, tentulah aku membuat kebajikan sebanyak-banyaknya dan aku tidak akan ditimpa kemudharatan dan keburukan. Aku tidak lain hanyalah pemberi peringatan bagi orang-orang yang membangkangku dengan neraka, dan pembawa berita gembira bagi orang-orang yang beriman dengan surga”. Mereka adalah orang-orang yang beriman kepada Allah, dan bukan orang-orang yang mengetahui tentang ghaib. Penduduk Makkah berkata: Bukankah Tuhanmu telah memberikan keringanan dan peninggian sampai kita bisa membeli dan kita bisa untung, juga dengan bumi yang tandus ini akan digantikan dengan bumi yang subur. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku tidak mampu mendatangkan manfaat maupun menolak mudharat bagi diriku} Aku tidak mampu atas diriku untuk membawa kebaikan dan menahan keburukan {kecuali apa yang dikehendaki Allah. Jika aku mengetahui yang ghaib, niscaya aku akan memperbanyak kebaikan dan bahaya tidak akan menimpaku. Sesungguhnya aku hanyalah pemberi peringatan dan pembawa berita gembira bagi kaum yang beriman.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "188 “katakanlah aku tidak berkuasa menarik kemanfaatan bagi diriku dan tidak (pula) menolak kemudaratan” karena sesunggunya aku adalah hamba fakir yang diatur, kebaikan tidak datang kepadaku keuali dari Allah dan tidak ada yang menolak kejahatan dariku kecuali Dia, dan akaupun tidak memiliki ilmu kecuali apa yang diajarkan oleh Allah kepadaku “dan sekiranya aku mengetahui yang ghaib tentulah aku membuat kebajikan sebanyak-banyaknya dan aku tidak akan ditimpa kemudaratan” yakni niscaya aku melakukan sebab-sebab yang mana aku mengetahui bahwa ia menghasilkan kebaikan dan kemaslahatan untukku dan akupun harus berhati-hati terhadap segala perkara yang membawaku kepada keburukan dan hal hal yang tidak diinginkan karena aku mengetahui perkara-perkara sebelum ia terjadi dan akupun mengetahui akibat yang ditimbulkan. Akan tertapi karena aku sendiri tidak mengetahui, maka terkadang akupun ditimpa kemalangan dan akupun gagal meraih kebaikan dan kemaslahatan dunia. ini adalah dalil paling kuat bahwa aku tidak memiliki ilmu ghaib. ”aku tidak lain hanyalah pemberi peringatan” yang memperingatkan azab diniyah, duniawiyah dan ukhrawiyah. Aku menjelaskan perbuatan-perbuatan yang mengantarkan kepadanya sekaligus memperingatkannya, aku juga menyampaikan berita gembira pahala dunia dan akhirat, dengan menjelaskan perbuatan-perbuatan yang mengantarkan kepadanya dan mendorong kepadanya. Akan tetapi tidak semua orang mau menerima peringatan dan berita gembira ini. hanya orang-orang Mukminlah yag mau menerima dan mengambil manfaat darinya. Ayat ayat yang mulia ini menjelaskan kebodohan orang yang berdoa kepada nabi untuk mendapatkan kebaikan dan menolak kemudaratan, karena perkaranya tidak berada di tangannya dan dia tidak dapat memberi manfaat kepada orang yang tidak diberi bermanfaat oleh Allah dan tidak dapat menolak mudarat dari orang yang tidak dilindungi oleh Allah kepadanya. ia hanya manfaat bagi orang yang mau menerima berita gembira dan peringatannya serta mengamalkannya, ini adalah manfaat nabi yang mengunggguli manfaat bapak, ibu, saudara dan karib dengan dorongannya kepada semua manusia kepada semua kebaikan dan peringatannya dari segala keburukan, serta penjelasannya kepada mereka dengan sangat jelas dan gamblang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 188: Yakni karena diriku adalah seorang yang fakir dan diatur, tidak ada satu pun kebaikan yang datang kepadaku melainkan berasal dari Allah, dan tidak ada yang menghilangkan bahaya yang menimpaku selain Dia, dan aku pun tidak mengetahui apa-apa selain yang diajarkan Allah kepadaku. Yakni mengerjakan sebab-sebab yang menghasilkan maslahat dan manfaat. Akan tetapi, karena aku tidak mengetahui yang ghaib, maka aku tertimpa bahaya dan luput bagiku berbagai maslahat dunia dan manfaatnya. Ayat yang mulia ini menerangkan kesalahan orang yang meminta dan berdoa kepada Nabi shallallahu 'alaihi wa sallam untuk memperoleh manfaat atau menghindarkan bahaya. Demikian pula menerangkan salahnya orang yang menganggap bahwa Nabi Muhammad shallallahu 'alaihi wa sallam mengetahui yang ghaib. Bagi orang-orang kafir dengan neraka. Dengan surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 188",
    "description": "Bukan hanya soal kapan terjadi hari kiamat, tetapi seluruh persoalan berada dalam genggaman kekuasaan Allah. Nabi Muhammad tidak memiliki wewenang dan pengetahuan, kecuali yang dianugerahkAllah, maka katakanlah, wahai nabi Muhammad kepada mereka, aku tidak kuasa mendatangkan manfaat seberapa besar pun, maupun menolak mudarat sekecil apa pun, karena aku adalah makhluk lemah dan pengetahuanku pun terbatas, bagi diriku, apalagi buat orang lain, kecuali apa yang dikehendaki Allah untuk dianugerahkan-Nya kepadaku. Sekiranya aku mengetahui segala sesuatu yang gaib, seperti yang kalian sangka, niscaya aku dengan pengetahuanku itu akan membuat kebajikan sebanyak-banyaknya dan tidak akan ditimpa bahaya. Tetapi tidak demikian keadaanku; sekali waktu mendapat kebaikan, di kali lain mengalami yang buruk; sekali waktu kalah dalam perang dan di kali lain menang; kadang rencanaku berhasil, terkadang juga gagal. Begitulah, karena memang aku tidak lain hanyalah seorang hamba Allah yang bertugas sebagai pemberi peringatan kepada seluruh manusia mengenai azab, dan pembawa berita gembira berupa balasan atau pahala bagi orang-orang yang beriman. Tugasku tidak terkait dengan pengetahuan yang rinci tentang yang gaib, kecuali yang telah diinformasikan-Nya kepadaku. Begitulah Allah mengalihkan pandangan mereka agar memerhatikan keadaan rasul dan juga mencermati alam raya agar mereka dapat merasakan keesaan tuhan. Kali ini Allah mengajak mereka membaca fakta dalam diri mereka, yaitu bahwa dialah, Allah, yang menciptakan kamu keturunan nabi adam dari jiwa yang satu, yaitu nabi adam, dan dari padanya dia menciptakan pasangannya, yaitu hawa, agar dia merasa tenang dan cenderung hatinya kepada pasangannya. Maka setelah dicampurinya, istrinya mengandung kandungan yang ringan, seperti biasanya kehamilan di masa awal, dan teruslah dia merasa ringan beberapa waktu kemudian ketika dia merasa berat, di saat kandungan semakin besar dan semakin dekat waktu bersalin, keduanya, yakni pasangan suami istri, bermohon kepada Allah, tuhan mereka seraya berkata, demi kekuasaan dan kebesaran-Mu, jika engkau memberi kami anak yang saleh, sempurna, sehat, dan tidak cacat, tentulah kami benar-benar termasuk orang-orang yang bersyukur."
  }
]