[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Adam, tinggalah kamu dan istrimu, hawwa, di dalam surga. makanlah oleh kalian berdua apa saja dari buah-buahan surga yang kalian berdua kehendaki. Dan janganlah kalian memakan buah dari pohon ini (yang ditentukan Allah kepada mereka). Apabila kalian melakukannya, akibatnya kalian termasuk orang-orang yang zhalim yang melanggar rambu-rambu ketentuan Allah. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Allah berfirman kepada Adam, “Wahai Adam! Tinggallah kamu bersama istrimu, Ḥawā` di Surga. Makanlah dari buah-buahan yang baik yang kamu sukai. Tetapi jangan memakan (buah) dari pohon ini (Allah menunjukkan pohon itu kepada keduanya). Karena jika kalian berdua memakannya kalian akan termasuk golongan orang-orang yang melanggar ketentuan Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Sedangkan Allah memuliakan Adam dan istrinya, Hawa untuk tinggal di dalam surga, dan bersenang-senang dengan segala makanan yang ada didalamnya sesuai keinginan mereka; dan Allah memerintahkan mereka berdua untuk menjauhi satu pohon yang dilarang untuk dimakan buahnya, agar mereka tidak terjerumus ke dalam kemaksiatan dan menjadi termasuk orang-orang yang menyelisihi perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَيٰٓـَٔادَمُ اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ ((Dan Allah berfirman): “Hai Adam bertempat tinggallah kamu dan isterimu di surga) Yakni, dan Kami berkata: ”wahai Adam”. Dan perkataan ini setelah Iblis dikeluarkan dari surga. فَكُلَا مِنْ حَيْثُ شِئْتُمَا (serta makanlah olehmu berdua (buah-buahan) di mana saja yang kamu sukai) Yakni dari jenis buah-buahan surga yang kalian berdua ingin makan. وَلَا تَقْرَبَا هٰذِهِ الشَّجَرَةَ (dan janganlah kamu berdua mendekati pohon ini) Allah membolehkan mereka memakan buah dari seluruh pohon yang ada di surga kecuali dari satu pohon ini. Tidak ada hadist yang shahih yang menyebutkan jenis pohon ini, dan tidak ada faidah dalam pembahasannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Setelah mengeluarkan Iblis dari surga, Kami berfirman: “Wahai Adam, tinggallah bersama istrimu di surga, makanlah setiap jenis buah-buahan surga yang kalian kehendaki, dan janganlah kamu mendekati satu pohon ini dengan memakan buahnya, karena itu diharamkan bagi kalian. Lalu kalian akan termasuk orang-orang yang menzalimi diri sendiri dengan menentang perintah Allah SWT (bila memakannya)” Dan tidak ada yang benar juga dalam menentukan (nama) pohon tersebut. Dan dikatakan bahwa pohon itu adalah tanaman gandum"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Wahai Adam, tinggallah kamu dan istrimu di surga. Makanlah apa saja yang kalian berdua sukai dan janganlah mendekati pohon ini sehingga kalian berdua termasuk orang-orang yang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Yakni Allah memerintahkan Adam dan istrinya, hawwa yang Allah berikan kepada Adam sebagai nikmat agar dia merasa tentram karenanya. Allah memerintahkan mereka berdua untuk makan dari surge apa saja yang mereka inginkan, dan menikmati didalamnya apa saja yang mereka sukai. Hanya saja Dia menentukan sebuah pohon dan melarang mereka untuk memakannya. Allah lebih mengetahui pohon itu. Pohon apa tepatnya tidaklah penting bagi kita untuk mengetahuinya. Pohon ini diharamkan atas mereka berdua dengan dalil FirmanNYa “lalu menjadilah kamu berdua termasuk orang-orang yang zhalim”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 19: Yaitu Hawa. Yakni memakannya. Wallahu a’lam, pohon apa yang dilarang itu, dan tida ada faedahnya bagi kita menentukan nama pohonnya. Adam dan Hawa pun senantiasa mengikuti perintah Allah dengan tidak mendekatinya, sehingga tiba saatnya setan mendatangi secara diam-diam dan membisikkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 19",
    "description": "Setelah Allah menjelaskan besarnya permusuhan iblis kepada manusia dan ambisinya untuk menyesatkan manusia dengan berbagai cara, pada ayat-ayat berikut Allah menceritakan kisah iblis dalam me-nyesatkan adam dan istrinya. Hal ini amatlah penting agar manusia senantiasa waspada terhadap makar dan godaan iblis. Dan ingatlah ketika Allah berfirman, wahai adam! tinggAllah engkau bersama istrimu dalam surga yang penuh dengan kenikmatan dan makanlah dari berbagai jenis makanan apa saja yang kamu berdua sukai. Akan tetapi, ada satu hal yang terlarang, yaitu janganlah kamu berdua dekati pohon yang satu ini. Apabila kamu mendekatinya, kamu berdua termasuk orang-orang yang zalim. Hikmah dari larangan ini adalah untuk menguji manusia, sejauh mana ia bisa menunaikan perintah dan menghindari larangan. Ketika manusia melanggarnya, ia pun telah menzalimi dirinya. Iblis ingin menghilangkan kenikmatan surga yang dinikmati adam dan pasangannya. Ia pun berusaha mengeluarkan adam dan pasangannya dari surga. Kemudian, dengan penuh kedengkian, setan membisikkan pikiran jahat kepada mereka, yaitu adam dan pasangannya, agar menampakkan aurat mereka yang selama ini tertutup. Dan setan berkata, tuhanmu hanya melarang kamu berdua mendekati pohon ini, agar kamu berdua tidak menjadi malaikat sehingga kalian memiliki kekuatan dan umur yang panjang atau tidak menjadi orang yang kekal dalam surga."
  }
]