[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesudah Allah memberikan rizki kepada pasangan suami istri tersebut berupa anak shalih, mereka berdua justru mengadakan sekutu-sekutu bagi Allah terhadap anak yang hanya Allah sendiri yang menciptakannya. Mereka menjadikan peribadahannya kepada selain Allah. Maka Maha tinggi Allah dan Maha suci dari segala sekutu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "190. Maka tatkala Allah mengabulkan doa mereka berdua dan memberi mereka seorang anak yang baik sebagaimana doa yang mereka panjatkan, tiba-tiba keduanya menyekutukan Allah dengan sembahan-sembahan lain-Nya terkait apa yang Allah berikan kepada mereka berdua. Mereka menjadikan anak mereka sebagai hamba bagi selain Allah. Mereka memberi nama anak mereka 'Abdul Ḥāriṡ (Hamba Petani). Mahatinggi Allah dan Mahasuci Dia dari segala sesuatu yang dijadikan sekutu bagi-Nya. Karena Dia lah satu-satu-Nya pemilik sifat rubūbiyyah dan ulūhiyyah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "190. Ketika Allah mengaruniai mereka berdua anak yang sempurna sebagaimana yang mereka inginkan, mereka berdua menyekutukan Allah dalam karunia ini dan lalai mensyukuri kenikmatan tersebut. Mereka menganggap karunia itu berasal dari berhala-berhala, hukum alam, dan lain sebagainya yang menyelisihi pengesaan kepada Allah dalam ibadah dan rasa syukur. Allah menutup ayat yang menyebutkan kesyirikan yang mereka lakukan dengan menyucikan diri-nya dari segala kesyirikan yang dilakukan orang-orang yang ingkar tersebut, yang membalas kenikmatan-kenikmatan Allah dengan kesyirikan dan kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "190. فَلَمَّآ ءَاتَىٰهُمَا صٰلِحًا (Tatkala Allah memberi kepada keduanya seorang anak yang sempurna) Yakni anak yang shalih. Pendapat lain mengatakan yakni anak yang sehat sempurna, tidak seperti yang mereka berdua takutkan yaitu terlahir cacat. Dan Allah mengabulkan doa mereka berdua. جَعَلَا لَهُۥ شُرَكَآءَ فِيمَآ ءَاتَىٰهُمَا ۚ (maka keduanya menjadikan sekutu bagi Allah terhadap anak yang telah dianugerahkan-Nya) Sebagian ahli tasfir mengatakan: sesungguhnya yang menjadikan anak mereka sebagai sekutu Allah adalah para keturunan Nabi Adam seperti yang dilakukan oleh orang-orang musyrik, dan bukan Nabi Adam dan Hawa yang melakukannya. Pendapat lain mengatakan yang dimaksud adalah Nabi Adam yang menamai anaknya dengan Abdul Harist (seorang hamba singa) dan ini merupakan bentuk kesyirikan dalam penamaan dan bukan dalam peribadatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "190 Tatkala Allah memberi kepada suami istri (bukan Adam dan Hawa: keturunan Bani Adam) seorang anak yang sempurna, saleh dan sehat, maka keduanya menjadikan sekutu bagi Allah terhadap anak yang telah dianugerahkan-Nya kepada keduanya itu. Maka Maha Tinggi Allah dari apa yang mereka persekutukan dengan anak dan sekutu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian setelah Dia memberi keduanya seorang anak yang shalih, mereka menjadikan} mereka menjadikan anak laki-laki dan anak perempuan termasuk orang-orang musyrik {sekutu bagiNya dalam apa yang telah Dia anugerahkan kepada mereka. Maka Maha tinggi Allah dari apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "190 “tatkala Allah memberi kepada keduanya seorang anak yang sempurna” sesuai dengan permintaan mereka dan sempurnalah nikmat Allah padanya ”maka keduanya menjadikan sekutu bagi Allah terhadap anak yang telah dianugrahkanNya kepada keduanya itu” yakni keduanya menjadikannya sekutu sekutu bagi Allah pada anak tersebut padahal yang menciptakannya, menganugerahkannya, dan membahagiakan kedua orang tuanya hanyalah Allah semata. maka keduanya menjadikannya sebagai hamba selain Allah, bisa memberinya nama dengan nama abd (hamba) yang disandarkan kepada selain Allah abdul haris, abdul uzza, abdul ka’bah, dan lain lain Dan bisa pula keduanya menyekutukan Allah dalam ibadah setelah Allah memberinya nikmat yang tidak seorang hambapun mampu menghitungnya. ini adalah perpindahan dari macam kepada jenis, karena asal pembicaran tentang jenis (yakni jenis manusia secara umum) dan tidak diragukan bahwa hal itu banyak terjadi pada keturunan adam dan hawwa. oleh karena itu Allah menetapkan kebatilan syirik atas mereka dan bahwa dalam hal itu mereka adalah orang orang zhalim dengan kezhaliman yang paling besar. Tiada beda antara syirik dalam ucapan dan syirik dalam perbuatan. Sesungguhnya dzat yang menciptakan mereka dari jiwa yang darinya Dia menciptakan istrinya dan menjadikan untuk mereka pasangan dari jenis mereka sendiri, kemudian menjadikan kasih sayang dan rasa cinta diantara mereka yang menjadikan sebagian merasa senang, cinta dan condong kepada sebagian yang lain, kemudian Dia membimbing mereka kepada apa yang dengannya syahwat kenikmatan, anak-anak dan keturunan bisa diraih, kemudian Dia menciptakan anak cucu di dalam Rahim ibu dalam jangka waktu tertentu yang diidam-idamkan oleh jiwa mereka dan mereka memohon kepada Allah agar melahirkannya dalam keadaan sehat dan selamat, lalu Allah menyempurnakan nikmat bagi mereka, serta mewujudkan keinginan mereka. Apakah Dia tidak berhak disembah tanpa disekutukan dengan sesuatu pun dalam ibadah kepadaNYa dengan mengihlaskan agama hanya kepadaNYa?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 190: Maksudnya orang-orang musyrik itu menjadikan sekutu bagi Allah terhadap anak yang dianugerahkan-Nya itu. Mereka memandang anak mereka sebagai hamba bagi berhala yang mereka sembah. Oleh karena itulah mereka menamakan anak-anak mereka dengan Abdul Uzza, Abdu Manaah, Abdu Syam, ‘Abdul Harits dan sebagainya. Padahal seharusnya mereka bersyukur kepada Allah yang telah menganugerahkan kepada mereka anak yang sempurna fisiknya, namun ternyata mereka malah berbuat syirk, baik syirk dalam beribadah maupun dengan menamai anaknya dengan nama yang menghambakan kepada selain Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 190",
    "description": "Maka setelah dia, yakni Allah memberi keduanya seorang anak yang sempurna, mereka menjadikan sekutu bagi Allah terhadap anak yang telah dianugerahkan-Nya itu, yakni mereka tidak bersyukur. Orang-orang musy-rik menjadikan sekutu bagi tuhan dalam menciptakan anak itu, yaitu bahwa kelahiran anak mereka itu bukan semata-mata karunia Allah, tetapi juga atas berkat berhala-berhala yang mereka sembah. Karena itulah mereka menamakan anak-anak mereka dengan 'abdul 'uzza, 'abdul mana't, abdusy syam dan sebagainya. Maka mahatinggi Allah dari apa yang mereka persekutukan. Begitu banyak bukti-bukti keagungan, ketinggian, dan kesucian Allah dari segala kekurangan dan sekutu, lalu mengapa mereka terus berada dalam kesesatan dan selalu mempersekutukan Allah dengan sesuatu berhala yang tidak dapat menciptakan dan melakukan sesuatu apa pun' padahal berhala itu sendiri diciptakan oleh manusia."
  }
]