[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah pantas kaum musyrikin menyekutukan dalam peribadahan kepada Allah bersama makhluk-makhlukNya, padahal mereka tidak berkuasa untuk menciptakan sesuatupun, bahkan sebaliknya mereka adalah makhluk-makhluk yang diciptakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "191. Apakah mereka menjadikan berhala-berhala itu dan lainnya sebagai sekutu-sekutu bagi Allah dalam beribadah, sedangkan mereka tahu bahwa berhala-berhala dan yang lainnya itu tidak pernah menciptakan sesuatu yang membuatnya berhak disembah, karena berhala-berhala itu adalah makhluk yang diciptakan? Jadi bagaimana mungkin mereka menjadikan berhala-berhala itu sebagai sekutu-sekutu bagi Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "191. Ayat-ayat ini menyebutkan olokan-olokan bagi orang-orang musyrik dan membantah kesyirikan mereka dengan cara yang masuk akal dan penuh hikmah. Ayat ini menyebutkan pertanyaan yang membodohkan perbuatan syirik yang mereka lakukan terhadap Allah yang telah menciptakan mereka dan menciptakan segalanya. Sedangkan sesembahan yang mereka jadikan sekutu Allah tidak dapat menciptakan sesuatu apapun meskipun hanya sesuatu yang kecil, bahkan berhala-berhala yang mereka sembah itu adalah benda yang diciptakan. Maka Bagaimana akal sehat dapat menerima bahwa makhluk yang lemah menjadi sekutu bagi Sang Pencipta Yang Maha Kuasa?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "191. أَيُشْرِكُونَ مَا لَا يَخْلُقُ شَيْـًٔا (Apakah mereka mempersekutukan (Allah dengan) berhala-berhala yang tak dapat menciptakan sesuatupun?) Yakni apakah mereka menjadikan patung-patung sebagai sekutu-sukutu bagi Allah dalam ibadah, padahal mereka mengetahui bahwa patung-patung ini tidak dapat menciptakan apapun sehingga layak untuk disembah. وَهُمْ يُخْلَقُونَ(Sedangkan itu sendiri buatan orang) Yakni berhala-berhala yang mereka jadikan sebagai sesembahan seperti patung-patung atau setan-setan merupakan makhluk-makhluk yang diciptakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "191 Apakah mereka mempersekutukan Allah dengan berhada-berhala yang tak dapat menciptakan sesuatupun? Lalu bagaimana bisa mereka berhak disembah. Sedangkan mereka yang dijadikan berhala-berhala atau setan-setan sebagai sekutu itupun adalah ciptaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka menyekutukan (Allah dengan) sesuatu yang tidak dapat menciptakan sesuatu apa pun, dan sesuatu itu sendiri diciptakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "191-192 akan tetapi perkaranya justru terbalik. Mereka menyekutukan Allah dengan “berhala-berhala yang tak dapat menciptakan sesuatupun sedangkan berhala-berhala itu sendiri buatan orang. Dan berhala-berhala itu tidak mampu memberi perolongan kepada penyembah-penyembahnya dan kepada dirinya sendiripun berhala-berhala itu tidak dapat memberi pertolongan” jika ia tidak dapat menciptakan sesuatu apa pun bahkan seberat biji sawi, justru ia adalah yang diciptakan ia juga tidak mampu menolak hal hal buruk dari penyembahannya bahkan dari dirinya, lalu bagaimana ia diangkat sebagia hutan bersama Allah? Ini hanyalah kezhaliman yang paling zhalim dan kebodohan yang paling bodoh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 191",
    "description": "Begitu banyak bukti-bukti keagungan, ketinggian, dan kesucian Allah dari segala kekurangan dan sekutu, lalu mengapa mereka terus berada dalam kesesatan dan selalu mempersekutukan Allah dengan sesuatu berhala yang tidak dapat menciptakan dan melakukan sesuatu apa pun' padahal berhala itu sendiri diciptakan oleh manusia. Sungguh bodoh mereka yang menjadikan makhluk sebagai sekutu bagi Allah, dan bukan hanya tidak dapat mencipta, berhala-berhala itu juga tidak dapat memberikan pertolongan kepada penyembahnya, dan bahkan kepada dirinya sendiri pun mereka, yakni berhala-berhala itu, tidak dapat memberi pertolongan jika ada yang merusak dan mengganggu mereka."
  }
]