[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka tidak mampu untuk menolong para penyembahnya atau menyingkirkan keburukan dari dirinya sendiri.Jika mereka tidak dapat menciptakan sesuatu, bahkan sebaliknya justru diciptakan, dan tidak mampu menolak keburukan dari para penyembahnya dan tidak juga dari dirinya sendiri, maka bagaimana pantas mereka dijadikan tuhan-tuhan bersama Allah? Sesungguhnya tindakan ini tiada lain merupakan tindakan kezhaliman yang paling besar dan kebodohan yang paling parah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "192. Sembahan-sembahan selain Allah itu tidak mampu menolong orang yang menyembahnya, bahkan tidak mampu menolong dirinya sendiri; bagaimana bisa mereka menyembahnya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "192. Selain berhala-berhala ini merupakan benda yang diciptakan, ia juga tidak dapat memberi kemenangan bagi para penyembahnya atas musuh-musuh mereka. Bahkan ia tidak dapat menjauhkan keburukan dari dirinya sendiri. Dan benda yang memiliki sifat seperti ini bagaimana dapat disembah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "192. وَلَا يَسْتَطِيعُونَ لَهُمْ نَصْرًا (Dan berhala-berhala itu tidak mampu memberi pertolongan kepada penyembah-penyembahnya) Yakni apabila mereka meminta tolong kepadanya. وَلَآ أَنفُسَهُمْ يَنصُرُونَ(dan kepada dirinya sendiripun berhala-berha]a itu tidak dapat memberi pertolongan) Dan barangsiapa yang tidak mampu menolong dirinya sendiri maka ia pasti lebih tidak mampu lagi untuk menolong orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "192 Berhala-berhala itu tidak mampu memberi pertolongan kepada penyembah-penyembahnya jika mereka meminta, bahkan kepada dirinya sendiripun berhala-berhala itu tidak dapat memberi pertolongan atas keburukan dan siksaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesuatu itu tidak dapat memberikan kepada mereka} kepada para penyembahnya {pertolongan dan untuk dirinya sendiri ia tidak dapat memberi pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "191-192 akan tetapi perkaranya justru terbalik. Mereka menyekutukan Allah dengan “berhala-berhala yang tak dapat menciptakan sesuatupun sedangkan berhala-berhala itu sendiri buatan orang. Dan berhala-berhala itu tidak mampu memberi perolongan kepada penyembah-penyembahnya dan kepada dirinya sendiripun berhala-berhala itu tidak dapat memberi pertolongan” jika ia tidak dapat menciptakan sesuatu apa pun bahkan seberat biji sawi, justru ia adalah yang diciptakan ia juga tidak mampu menolak hal hal buruk dari penyembahannya bahkan dari dirinya, lalu bagaimana ia diangkat sebagia hutan bersama Allah? Ini hanyalah kezhaliman yang paling zhalim dan kebodohan yang paling bodoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 192: Ketika ada yang hendak menghancurkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 192",
    "description": "Sungguh bodoh mereka yang menjadikan makhluk sebagai sekutu bagi Allah, dan bukan hanya tidak dapat mencipta, berhala-berhala itu juga tidak dapat memberikan pertolongan kepada penyembahnya, dan bahkan kepada dirinya sendiri pun mereka, yakni berhala-berhala itu, tidak dapat memberi pertolongan jika ada yang merusak dan mengganggu mereka. Dan jangan duga, wahai para penyembah berhala, sembahan-sembahan kamu hanya tidak dapat membela diri atau membantu kamu. Yang lebih ringan dari itu pun mereka tidak mampu, yaitu jika kamu, wahai orang-orang musyrik, selalu menyerunya dengan meminta berhala-berhala itu untuk memberi petunjuk kepadamu, tidaklah berhalaberhala itu dapat memperkenankan seruanmu karena mereka tidak mendengar dan juga tidak mengerti. Sama saja hasilnya buat kamu apakah kamu telah menyeru mereka, walaupun itu berkali-kali, atau sikap kamu mantap berdiam diri, tidak mengucapkan satu kata pun. Sama saja, tidak ada gunanya sama sekali. Mereka tetap tidak akan tersentuh atau bergerak."
  }
]