[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesunggunya apa yang kalian sembah selain Allah (wahai kaum musyrikin), mereka itu dibawah kekuasaan tuhan kalian sebagaimana kalian pun ada dibawah kekuasanNya, maka jika kalian seperti yang kalian kalim adalah orang-orang yang benar ucapannya bahwa berhala-berhala itu berhak mendapatkan perlakuan sedikit saja untuk disembah, maka berdo’alah kepada mereka dan hendaklah mereka mengabulkan permintaan kalian dan mewujudkan keinginan-keinginan kalian. Kalau tidak, maka menjadi jelas bagi kalian bahwa sesungguhnya kalian bohong dan mengada-adakan kedustaan atas nama Allah dengan kedustaan yang paling besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "194. Sesungguhnya berhala-berhala yang kalian sembah selain Allah itu -wahai orang-orang musyrik- adalah makhluk yang diciptakan dan dimiliki oleh Allah. Jadi mereka itu adalah makhluk ciptaan Allah, seperti kalian. Bahkan kondisi kalian lebih baik dari mereka. Karena kalian adalah makhluk hidup yang bisa berbicara, berjalan, mendengar, dan melihat. Sedangkan berhala-berhala kalian itu tidak demikian keadaannya. Maka cobalah kalian memanggil mereka dan persilakan mereka menjawabnya jika memang benar anggapan kalian tentang mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "194. Kemudian Allah menegaskan bagi mereka bahwa benda-benda yang mereka sembah selain Allah atau mereka seru untuk menjauhkan mudharat atau mendatangkan manfaat adalah seperti mereka, yakni sama-sama hamba Allah yang diciptakan untuk tunduk terhadap kekuasaannya; maka tidak ada perbedaan antara kalian dengan mereka. Dan jika berhala-berhala itu memang berhak untuk disembah, maka berdoalah kepada mereka agar mereka mengabulkan doa kalian; jika mereka dapat mengabulkan apa yang kalian minta maka kalian memang benar, Akan tetapi jika mereka tidak dapat melakukannya maka kalian telah berdusta dalam anggapan tersebut dan telah membuat kedustaan terhadap Allah dengan kedustaan yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "194. إِنَّ الَّذِينَ تَدْعُونَ مِن دُونِ اللهِ عِبَادٌ أَمْثَالُكُمْ ۖ (Sesungguhnya berhala-berhala yang kamu seru selain Allah itu adalah makhluk (yang lemah) yang serupa juga dengan kamu) Mereka yang kalian jadikan sesembahan merupakan hamba-hamba Allah sebagaimana kalian juga hamba-hamba-Nya, bahkan kalian lebih sempurna dari mereka karena kalian hidup, dapat berbicara, berjalan, mendengar, dan melihat, adapun patung-patung ini tidak bapat melakukan itu. Namun mereka sama saja dengan kalian, yakni sama-sama kepunyaan Allah yang diciptakan dengan ketetapannya. فَادْعُوهُمْ فَلْيَسْتَجِيبُوا۟ لَكُمْ (Maka serulah berhala-berhala itu lalu biarkanlah mereka mmperkenankan permintaanmu) Yakni hendaklah mereka menjawab seruan kalian seandainya mereka hidup. إِن كُنتُمْ صٰدِقِينَ (jika kamu memang orang-orang yang benar) Yakni benar dalam anggapan kalian bahwa mereka mampu untuk memberi manfaat dan mudharat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "194 Sesungguhnya berhala-berhala yang kamu seru selain Allah itu adalah makhluk yang lemah yang serupa juga dengan kamu, sama juga dalam kekuasaan Allah. Maka serulah berhala-berhala itu baik untuk kemanfaatan ataupun kemadharatan lalu biarkanlah mereka mmperkenankan permintaanmu, jika memang mereka itu hidup juga jika kamu memang orang-orang yang benar dalam menjadikan mereka sebagai sesembahan dan apa yang kalian minta untuk mendatangkan kemanfaatan atau menolak keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya berhala-berhala yang kalian seru} kalian sembah {selain Allah adalah makhluk} makhluk yang dimiliki {seperti kalian. Maka serulah mereka, lalu biarlah mereka memenuhi seruan kalian, jika kalian adalah orang-orang yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "194 ini adalah tantangan kepada orang orang musyrik penyembah berhala. Allah berfirman ”sesungguhnya berhala berhala-berhala yang kamu seru selain Allah itu adalah makhluk (yang lemah) yang serupa juga dengan kamu” yakni tiada beda antara kamu dengan mereka kalian semua adalah hamba yang diatur oleh Allah, jika klaimmu benar bahwa ia berhak disembah “maka serulah berhala-berhala itu lalu biarkanlah mereka memperkenankan permintaanmu” jika mereka menjawab permohonanmu dan mewujudkan keinginanmu, jika tidak maka jelaslah bahwa klaimmu adalah dusta dan kamu berdusta atas nama Allah dengan kedustaan yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 194: Jika mereka tidak dapat memperkenankan seruanmu, berarti kamu orang-orang yang berdusta. Kemudian atas dasar apa kamu menyembah mereka?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 194",
    "description": "Masih dalam konteks menjelaskan kecaman terhadap berhalaberhala sembahan kaum musyrik, ayat ini menyatakan, sesungguhnya mereka, yakni berhala-berhala yang kamu seru selain Allah yang kamu harapkan dapat memberikan manfaat adalah makhluk yang lemah yang serupa juga dengan kamu, yaitu tunduk kepada Allah sesuai tabiat ciptaan mereka, seperti halnya kalian. Kalau benar mereka itu berkuasa, seperti yang kalian sangka, maka serulah mereka, lalu biarkanlah mereka memperkenankan permintaanmu untuk mendatangkan manfaat dan menolak mudarat, jika kamu orang yang benar dalam keyakinanmu bahwa berhala-berhala itu adalah tuhan sekutu bagi Allah. Bahkan berhala-berhala itu lebih rendah derajatnya dari kalian dalam segi ciptaan dan aspek bentuknya. Perhatikanlah, apakah mereka, yakni berhala-berhala itu mempunyai kaki untuk berjalan, seperti kalian yang dapat berjalan, atau mempunyai tangan untuk memegang dengan keras dan menampik mudarat dari diri kalian dan dari diri mereka sendiri' atau mempunyai mata untuk melihat dan mengamati, atau mempunyai telinga untuk mendengar permintaan kalian lalu mewujudkannya' tidak! mereka tidak memiliki semua itu, lalu mengapa kalian mempersekutukan mereka dengan Allah' katakanlah, andaikata dalam dugaan kalian tuhan-tuhan itu bisa mendatangkan mudarat atas diriku atau orang lain, maka panggillah berhala-berhalamu yang kamu anggap sekutu Allah, kemudian lakukanlah bersama mereka tipu daya untuk mencelakakan-ku. Segera sekarang juga, dan jangan kamu tunda lagi. Sungguh mereka itu tidak dapat berbuat sesuatu."
  }
]