[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tuhan-tuhan dan berhala-berhala tersebut memiliki kaki yang dengan itu mereka berjalan bersama kalian untuk memenuhi kebutuhan-kebutuhan kalian? apakah mereka memiliki tangan-tangan yang dapat mereka pergunakan untuk menepis (bahaya) dari kalian dan menolong kalian dari orang yang menginginkan keburukan dan mara bahaya pada kalian? apakah mereka memiliki mata yang mereka melihat dengannya, lalu mereka mengenalkan kepada kalian apa yang dapat mereka lihat langsung dan saksikan dari perkara-perkara ghaib dari kalian yang tidak dapat kalian saksikan? Apakah mereka memiliki telinga untuk mendengar, lalu mereka mengabarkan kepada kalian hal-hal yang belum pernah kalian dengar? maka apabila tuhan-tuhan yang kalian sembah itu tidak memiliki sesuatu pun dari indra-indra ini, maka apa alasan kalian menjadikan penyembah kalian kepada mereka, padahal mereka tidak memiliki apa pun dari hal-hal tersebut yang dipergunakan untuk mendatangkan kemanfaatan atau menolak mudarat? katakanlah (wahai rasul), kepada kaum musyrikin dari para penyembah berhala-berhala, ”panggilah tuhan-tuhan kalian yang kalian jadikan sekutu bagi Allah dalam peribadahan, kemudian bergabunglah untuk menimpakan keburukan dan bahaya kepadaku.Janganlah kalian menunda itu kepadaku dan segeralah kalian lakukan itu. Sesungguhnya aku tidak peduli kepada tuhan-tuhan kalian, karena ketergantunganku kepada perlindungan Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "195. Apakah berhala-berhala yang kalian sembah itu mempunyai kaki untuk berjalan guna memenuhi kebutuhan kalian? Apakah mereka mempunyai tangan untuk melindungi kalian dengan kekuatannya? Apakah mereka mempunyai mata untuk melihat sehingga mampu memberitahukan hal yang tidak bisa kalian lihat? Atau apakah mereka mempunyai telinga untuk mendengar hal yang tersembunyi dari kalian lantas menyampaikannya kepada kalian? Jika memang semuanya itu tidak berfungsi, bagaimana mungkin kalian menyembahnya dengan harapan kalian akan mendapatkan manfaat dan terhindar dari mudarat? Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, “Panggillah berhala-berhala yang kalian anggap setara dengan Allah, kemudian buatlah rekayasa untuk mencelakakanku, dan jangan memberiku kesempatan untuk menghindar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "195. Apakah berhala-berhala yang kalian sebut dapat mendekatkan kalian kepada Allah dengan sedekah dekatnya itu memiliki kaki yang dapat mereka gunakan untuk berusaha menjauhkan mudharat dan mendatangkan manfaat, memiliki tangan yang dapat mereka gunakan untuk mengambil sesuatu yang mereka inginkan, memiliki mata yang dapat mereka gunakan untuk melihat keadaan dan urusan kalian, atau memiliki telinga yang dapat mereka gunakan untuk mendengar perkataan kalian dan mengetahui apa yang kalian minta. Namun berhala-berhala itu sangat lemah karena tidak memiliki Indra Indra tersebut yang merupakan alat untuk bekerja. Hai Rasulallah, maka katakanlah kepada orang-orang yang tidak memakai akal mereka itu: serulah sekutu-sekutu yang kalian anggap sebagai para penolong tersebut; kemudian saling tolong-menolong lah kalian dengan mereka untuk segera memberi mudharat kepadaku. Sungguh Aku adalah orang yang meminta kekuatan kepada Allah dan memohon perlindungan nya, dan barangsiapa yang seperti itu maka tidak akan takut dari seorang makhluk pun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "195. أَلَهُمْ أَرْجُلٌ (Apakah berhala-berhala mempunyai kaki) Yakni mereka yang kalian jadikan sebagai sekutu-sekutu Allah dalam ibadah tidak memiliki anggota-anggota badan seperti yang kalian miliki. أَمْ لَهُمْ أَيْدٍ يَبْطِشُونَ بِهَآ ۖ (atau mempunyai tangan yang dengan itu ia dapat memegang dengan keras) Yakni bekerja atau memukul dengan tangan itu, lalu bagaimana kalian menyembah sesuatu yang tidak memiliki anggota-anggota badan seperti ini dan tidak pula memiliki kekuatan sedikitpun? Makna (البطش) yakni memegang dengan kuat. قُلِ ادْعُوا۟ شُرَكَآءَكُمْ ثُمَّ كِيدُونِ (Katakanlah: “Panggillah berhala-berhalamu yang kamu jadikan sekutu Allah, kemudian lakukanlah tipu daya (untuk mencelakakan)-ku) Yakni berkumppullah kalian dan mereka semua untuk membuat tipu daya terhadapku dengan apapun yang kalian kehendaki. فَلَا تُنظِرُونِ (tanpa memberi tangguh (kepada-ku)) Yakni janganlah kalian biarkan aku lolos dan jangan kalian akhirkan musibah yang ingin kalian timpakan kepadaku jika memang kalian dan berhala-berhala kalian mampu untuk menimpakan musibah. Allah memerintahkan Rasulullah untuk menantang mereka dengan hal ini untuk menunjukkan kelemahan sesembahan mereka dalam melakukan apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "195 Apakah berhala-berhala mempunyai anggota tubuh seperti yang kalian miliki? Apakah dia memiliki kaki yang dengan itu ia dapat berjalan, atau mempunyai tangan yang dengan itu ia dapat memegang dengan keras, atau mempunyai mata yang dengan itu ia dapat melihat, atau mempunyai telinga yang dengan itu ia dapat mendengar? Tidak, mereka tidak mempunyai anggota tubuh ataupun indera seperti kalian. Lalu bagaimana bisa kalian bisa menyembah mereka, yang bahkan mereka lebih tidak sempurna daripada kalian? Katakanlah kepada mereka wahai Nabi: “Panggillah berhala-berhalamu yang kamu jadikan sekutu Allah, kemudian lakukanlah tipu daya untuk mencelakakan-ku. tanpa memberi tangguh kepada-ku jika memang kamu bisa. Ini adalah tantangan untuk menunjukkan kelemahan sesembahan mereka yang tidak bisa melakukan apapun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka} apakah tuhan-tuhan ini {mempunyai kaki untuk mereka berjalan, mempunyai tangan untuk mereka memegang dengan keras, mempunyai mata untuk mereka melihat, atau mempunyai telinga untuk merek mendengar. Katakanlah,“Panggillah sekutu-sekutu kalian, kemudian lakukanlah tipu daya untukku dan jangan kalian tunda lagi} jangan kalian memberiku tenggang waktu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "195 ini tidak memerlukan penjelasan padanya karena jika kamu melihat kepadanya maka bentuknya menunjukkan kepadamu bahwa ia tidak dapat mendatangkan manfaat sedikitpun. ia tidak berkaki untuk berjalan, tak bertangan untuk bekerja, tak bermata untuk melihat, dan tidak bertelinga untuk mendengar. ia tidak memiliki semua kekuatan dan perangkat yang ada pada manusia. jika ia tidak mampu menjawab seruanmu maka ia adalah hamba sepertimu, bahkan kamu lebih sempurna dan lebih kuat daripadanya dalam banyak hal, maka dengan alasan apa kamu menyembahnya? ”katakanlah panggilah berhala-berhalanya yang kamu jadikan sekutu bagi Allah kemudian lakukanlah tipu daya (untuk mencelakakan) ku tanpa memberi tangguh (kepadaku)” yakni berkumpulah kamu dengan sekutu sekutumu untuk menimpakkan kejahatan dan keburukan terhadapku tanpa penundaan dan pengunduran, niscaya kamu tidak akan mampu melakukan itu terhadapku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 195: Dalam ayat ini Allah Subhaanahu wa Ta'aala menerangkan kelemahan berhala-berhala itu dan bahwa penyembahnya ternyata lebih unggul dibanding berhala itu. Dan merupakan sebuah kebodohan jika yang kuat menyembah yang lemah. Yakni kumpulkanlah mereka bersama kamu untuk menimpakan bahaya kepadaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 195",
    "description": "Bahkan berhala-berhala itu lebih rendah derajatnya dari kalian dalam segi ciptaan dan aspek bentuknya. Perhatikanlah, apakah mereka, yakni berhala-berhala itu mempunyai kaki untuk berjalan, seperti kalian yang dapat berjalan, atau mempunyai tangan untuk memegang dengan keras dan menampik mudarat dari diri kalian dan dari diri mereka sendiri' atau mempunyai mata untuk melihat dan mengamati, atau mempunyai telinga untuk mendengar permintaan kalian lalu mewujudkannya' tidak! mereka tidak memiliki semua itu, lalu mengapa kalian mempersekutukan mereka dengan Allah' katakanlah, andaikata dalam dugaan kalian tuhan-tuhan itu bisa mendatangkan mudarat atas diriku atau orang lain, maka panggillah berhala-berhalamu yang kamu anggap sekutu Allah, kemudian lakukanlah bersama mereka tipu daya untuk mencelakakan-ku. Segera sekarang juga, dan jangan kamu tunda lagi. Sungguh mereka itu tidak dapat berbuat sesuatu sangat buruk perumpamaan keadaan orang-orang yang mendustakan ayat-ayat kami karena mereka mengabaikan tuntunan pengetahuannya, bahkan berbuat zalim. Dengan mengingkari kebenaran, mereka sebenarnya tidak lain telah menzalimi diri mereka sendiri. Begitulah, seburuk-buruk manusia adalah orang yang mempunyai pengetahuan keesaan Allah dan agama-Nya, tetapi karena didorong oleh hawa nafsu duniawi, dia meninggalkan ilmunya dan berubah menjadi kafir kepada Allah."
  }
]