[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pelindunganku adalah Allah yang mengurus penjagaan dan bantuan bagiku. Dia lah Dzat yang menurunkan al-qur’an kepadaku dengan sebenarnya, dan Dia melindungi orang-orang shalih dari hamba-hambaNya dan menolong mereka atas musuh-musuh dan tidak mengabaikan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "196. Sesungguhnya penolongku adalah Allah yang senantiasa menjagaku. Maka aku tidak pernah berharap kepada selain Allah. Dan aku tidak takut sedikit pun pada berhala-berhala kalian. Karena Allah lah yang telah menurunkan Al-Qur`ān kepadaku sebagai petunjuk bagi umat manusia. Dan Dia lah yang melindungi orang-orang saleh di antara hamba-hamba-Nya. Dia lah yang menjaga dan menolong mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "196. Allah memerintahkan rasulnya untuk menyatakan dengan penuh kebanggaan bahwa hanya Allah penolongku dan pengatur urusanku, dialah yang menurunkan Alquran ini agar aku dapat mengeluarkan kalian dari kegelapan menuju cahaya. Dan telah berlaku sunnatullah bahwa dia akan menolong orang-orang sholeh yang baik niat, perkataan, dan perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "196. لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا۟ فِى الْبِلٰدِ (Janganlah sekali-kali kamu terperdaya oleh kebebasan orang- orang kafir bergerak di dalam negeri) Dengan melakukan perjalanan untuk berdagang untuk memperlapang kehidupan mereka, karena itu merupakan kenikmatan yang sedikit yang mereka nikmati di dunia ini dan kemudian tempat kembali mereka adalah neraka Jahannam. Ikrimah berkata: yang dimaksud adalah pergerakan mereka di siang dan malam hari dan segala kenikmatan yang berlaku bagi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Barangsiapa yang senantiasa menjaga dan memperbaiki hubungan antara dirinya dengan Allah, niscaya Allah akan menjaganya dalam berbagai hal : - Dalam hidupnya : { وَهُوَ يَتَوَلَّى الصَّالِحِينَ } \"dan Dia melindungi orang-orang yang saleh.\" - Dan dalam tidurnya, sebagaimana yang dikisahkan tentang ashabul kahfi. - Dan setelah kematiannya sekalipun : { و كان أبوهما صالحا }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "196 Sesungguhnya pelindungku ialah Yang telah menurunkan Al Quran dan Dia melindungi dan menolong orang-orang yang shalih. Lalu bagaimana bisa aku takut kepada berhala-berhala ini?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya pelindungku} penolong dan pengawas urusanku {adalah Allah yang telah menurunkan kitab} Al-Qur’an {Dia melindungi orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "196 karena waliku (penolongku) adalah Allah yang menjagaku, Dialah yang mendatangkan manfaat bagiku dan menolak mudarat dariku, ”yang telah menurunkan al kitab (al qur’an)” yang padanya terdapat petunjuk, kesembuhan, dan cahaya. Ia termasuk perlindungan dan pendidikan diniyahNya yang khusus kepada hamba-hambaNYa, ”dan Dia melindungi orang-orang yang shaleh” yang niat, amal dan perkataan mereka adalah baik, sebagaimana Allah berfirman ”Allah pelindung bagi orang-orang yang beriman, Dia mengeluarkan mereka dari kegelapan(kekafiran) kepada cahaya iman” ketika orang orang mukmin yang shalih mengangkat Rabb mereka menjadi pelindung, dengan takwa dan iman, dan tidak mengangkat selainNya yang tidak mampu mendatangkan manfaat dan menolak mudarat, maka Allah melindungi mereka, menyayangi mereka dan menolong mereka dalam perkara kebaikan dan kemaslahatan dunia dan agama, serta menolak segala keburukan dari mereka semua, dengan iman mereka, sebagai mana Allah berfirman ”sesungguhnya Allah membela orang-orang yang telah beriman.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 196: Yang didalamnya terdapat petunjuk, penawar dan cahaya, di mana penurunan kitab itu salah satu bentuk tarbiyah(pendidikan)-Nya kepada hamba-hamba-Nya yang terkait dengan agama. Contoh perlindungan-Nya kepada orang saleh adalah membantu mereka kepada sesuatu yang di sana terdapat kebaikan dan maslahat baik bagi agama maupun dunia mereka dan menghindarkan segala sesuatu yang tidak disukai mereka. Orang saleh adalah orang yang saleh atau baik niatnya, ucapannya dan perbuatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 196",
    "description": "Sangat buruk perumpamaan keadaan orang-orang yang mendustakan ayat-ayat kami karena mereka mengabaikan tuntunan pengetahuannya, bahkan berbuat zalim. Dengan mengingkari kebenaran, mereka sebenarnya tidak lain telah menzalimi diri mereka sendiri. Begitulah, seburuk-buruk manusia adalah orang yang mempunyai pengetahuan keesaan Allah dan agama-Nya, tetapi karena didorong oleh hawa nafsu duniawi, dia meninggalkan ilmunya dan berubah menjadi kafir kepada Allah itulah sifat-sifat Allah yang disembah oleh nabi Muhammad dan para pengikutnya, sedangkan berhala yang disembah oleh orang-orang musyrik yang sesat, sifatnya seperti diurai pada ayat ini. Dan berhalaberhala yang selalu kamu, yakni orang-orang musyrik penyembah berhala seru selain Allah untuk meminta pertolongan dan beribadah kepada mereka, tidaklah sanggup menolongmu dengan cara apa pun, bahkan tidak dapat menolong dirinya sendiri, mereka itu lemah seperti halnya kamu, bahkan lebih lemah dari kamu."
  }
]