[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sedangkan apa yang kalian seru (wahai kaum musyrikin) selain Allah dari tuhan-tuhan kalian, mereka tidak sanggup menolong kalian dan tidak pula berkuasa untuk menolong diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "197. Dan berhala-berhala yang kalian berdoa kepadanya selain Allah itu -wahai orang-orang musyrik- tidak kuasa menolong kalian dan tidak mampu menolong diri mereka sendiri. Mereka lemah tak berdaya. Lalu bagaimana mungkin kalian berdoa kepada mereka selain Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "197. Adapun berhala berhala yang kalian sembah selain Allah dan kalian seru untuk menjauhkan mudharat dan mendatangkan manfaat, sama sekali tidak dapat menolong kalian dalam suatu urusan, karena mereka sendiri tidak dapat menjauhkan diri mereka dari bahaya yang datang dari seseorang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "197 Berhala-berhala yang kamu seru selain Allah tidaklah sanggup menolongmu, bahkan tidak dapat menolong dirinya sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berhala-berhala yang kalian seru selain Allah tidaklah sanggup menolong kalian, bahkan tidak dapat menolong dirinya sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "197-198 Ayat ini juga merupakan penjelasan tentang tidak berhaknya berhala berhala yang mereka sembah selain Allah untuk disembah, karena berhala berhala itu tidak memiliki kemampuan dan kekuatan dalam pembantu dirinya sendiri apalagi membantu para penyembahnya, ia tidak memiliki kekuatan akal dan kemampuan menjawab, ia adalah gambar tanpa kehidupan. kamu melihatnya memandangmu padahal ia sama sekali tidak melihatmu, karena merekalah yang membentuknya dalam bentuk makhluk hidup, seperti manusia dan lain lain. Mereka memberinya mata dan anggota badan. Jika kamu melihatnya kamu melihatnya seperti sedang hidup. Jika kamu mengamatinya maka terbukti bahwa ia adalah benda mati yang tak mau bergerak dan tak hidup, lalu dengan dasar apa orang orang musyrik itu menjadikannya sebagai tuhan bersama Allah? Demi kebaikan dan kemaslahatan apa mereka beritikaf didepannya dan mendekatkan diri dengan berbagai macam ibadah kepadanya. Jika ini telah diketahui maka diketahuilah bahwa orang orang musyrik dengan sesembahan sesembahannya, jika mereka berkumpul dan ingin menimpakan keburukan kepada orang yang dilindungi oleh pencipta langit dan bumi, yang melindungi hamba hambaNya yang shalih niscaya mereka tidak akan mampu menimpakan keburukan sekecil apapun karena sempurnanya ketidak mampuan mereka dan sesembahan mereka dan sempurnanya kekuatan orang yang berlindung di bawah perlindunganNya dan bertawakal kepadaNya. Ada yang menyatakan bahwa makna firmanNya “dan kamu melihat berhala berhala itu memandang kepadamu padahal ia tidak melihat” bahwa dhamir (kata ganti) kembali kepada orang orang musyrik yang mendustakan Rasulullah, kamu mengira mereka melihat kepadamu ya Rasululullah dengan mata perenungan yang dengannya dibedakan antara orang yang benar dan orang yang dusta, padahal sebenarnya mereka tidak melihat hakikatmu. Mereka tidak melihat keindahan, kebenaran, dan kesempurnaanmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 197: Ayat ini juga sama menerangkan ketidakberhakannya berhala-berhala itu disembah karena mereka tidak memiliki kemampuan membela diri ketika ada yang menyerangnya, apalagi sampai menolong penyembahnya. Oleh karena itu, mengapa apa aku harus takut kepadanya?!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 197",
    "description": "Itulah sifat-sifat Allah yang disembah oleh nabi Muhammad dan para pengikutnya, sedangkan berhala yang disembah oleh orang-orang musyrik yang sesat, sifatnya seperti diurai pada ayat ini. Dan berhalaberhala yang selalu kamu, yakni orang-orang musyrik penyembah berhala seru selain Allah untuk meminta pertolongan dan beribadah kepada mereka, tidaklah sanggup menolongmu dengan cara apa pun, bahkan tidak dapat menolong dirinya sendiri, mereka itu lemah seperti halnya kamu, bahkan lebih lemah dari kamu. Dan wahai para penyembah berhala, sesembahan kamu itu bukan hanya tidak mampu menolong kamu atau membela dirinya. Yang lebih lemah dari itu pun mereka tak mampu. Jika kamu para penyembah berhala menyeru mereka, berhala-berhala itu, untuk memberi petunjuk kepada kebaikan dan kebenaran, mereka tidak dapat mendengarnya apalagi mengabulkan permintaan itu. Dan engkau wahai nabi Muhammad lihat mereka, yakni berhala-berhala yang disembah oleh orang-orang musyrik itu ada di hadapanmu seolah-olah memandangmu, sebab berhala-berhala itu dibuat seakan-akan memandang orang yang di hadapannya dengan mata yang bersinar, padahal mereka tidak melihat, karena se-sungguhnya tidak memiliki mata dan tidak pula hati."
  }
]