[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian menyeru (wahai kaum musyrikin) tuhan-tuhan kalian untuk istiaqamah dan berjalan lurus, niscaya mereka tidak mendengar seruan kalian.” Dan kamu bisa lihat (wahai rasul) tuhan-tuhan kaum musyrikin dari para penyembah berhala-berhala, menatap kamu seolah-olah melihat kamu padahal mereka itu tidak dapat melihat. Sebab sesunggguhnya mereka tidak mempunyai penglihatan dan tidak memiliki mata hati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "198. Dan jika kalian -wahai orang-orang musyrik- mengajak berhala-berhala yang kalian sembah selain Allah itu ke jalan yang benar mereka pasti tidak mendengar ajakanmu, dan kalian akan melihat mereka menyambutmu dengan mata buatan yang mati dan tidak bisa melihat. Dahulu mereka membuat patung-patung dalam bentuk manusia atau hewan. Patung-patung buatan mereka itu mempunyai tangan, kaki, dan mata. Tetapi patung-patung itu tetap benda mati yang tidak hidup dan tidak bisa bergerak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "198. وَتَرَىٰهُمْ يَنظُرُونَ إِلَيْكَ (Dan kamu melihat berhala-berhala itu memandang kepadamu) Dahulu mereka membuat patung-patung itu dengan bentuk manusia atau binatang dan memiliki tangan, kaki, dan mata namun tidak dapat dipakai untuk memegang, berjalan, dan melihat apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "198 Jika kamu sekalian menyeru berhala-berhala itu untuk memberi petunjuk, niscaya berhala-herhala itu tidak dapat mendengar seruan kalian. Dan kamu melihat berhala-berhala itu memandang kepadamu padahal ia tidak melihat. Sebab mereka memang tidak hidup, lalu bagaimana mereka bisa kalian harapkan pertolongan dan kebaikan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian menyeru mereka untuk memberi petunjuk, mereka tidak dapat mendengarnya. Kalian mengira mereka memperhatikan kalian, padahal mereka tidak melihat.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "197-198 Ayat ini juga merupakan penjelasan tentang tidak berhaknya berhala berhala yang mereka sembah selain Allah untuk disembah, karena berhala berhala itu tidak memiliki kemampuan dan kekuatan dalam pembantu dirinya sendiri apalagi membantu para penyembahnya, ia tidak memiliki kekuatan akal dan kemampuan menjawab, ia adalah gambar tanpa kehidupan. kamu melihatnya memandangmu padahal ia sama sekali tidak melihatmu, karena merekalah yang membentuknya dalam bentuk makhluk hidup, seperti manusia dan lain lain. Mereka memberinya mata dan anggota badan. Jika kamu melihatnya kamu melihatnya seperti sedang hidup. Jika kamu mengamatinya maka terbukti bahwa ia adalah benda mati yang tak mau bergerak dan tak hidup, lalu dengan dasar apa orang orang musyrik itu menjadikannya sebagai tuhan bersama Allah? Demi kebaikan dan kemaslahatan apa mereka beritikaf didepannya dan mendekatkan diri dengan berbagai macam ibadah kepadanya. Jika ini telah diketahui maka diketahuilah bahwa orang orang musyrik dengan sesembahan sesembahannya, jika mereka berkumpul dan ingin menimpakan keburukan kepada orang yang dilindungi oleh pencipta langit dan bumi, yang melindungi hamba hambaNya yang shalih niscaya mereka tidak akan mampu menimpakan keburukan sekecil apapun karena sempurnanya ketidak mampuan mereka dan sesembahan mereka dan sempurnanya kekuatan orang yang berlindung di bawah perlindunganNya dan bertawakal kepadaNya. Ada yang menyatakan bahwa makna firmanNya “dan kamu melihat berhala berhala itu memandang kepadamu padahal ia tidak melihat” bahwa dhamir (kata ganti) kembali kepada orang orang musyrik yang mendustakan Rasulullah, kamu mengira mereka melihat kepadamu ya Rasululullah dengan mata perenungan yang dengannya dibedakan antara orang yang benar dan orang yang dusta, padahal sebenarnya mereka tidak melihat hakikatmu. Mereka tidak melihat keindahan, kebenaran, dan kesempurnaanmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’raf ayat 198: 198. Dan jika kalian meminta mereka untuk memberi petunjuk kepada sesuatu yang dapat mengantarkan kepada tujuan kalian merupakan penanganan atau lainnya, mereka sama sekali tidak mendengar apa yang kalian minta. Dan seandainya jika mereka mendengar, mereka tidak dapat mengabulkan karena tidak dapat melakukan sesuatu apapun. Kalian melihat berhala-berhala itu seakan-akan melihat kalian dengan mata yang dipahat, namun sebenarnya mereka sama sekali tidak dapat melihat karena mereka merupakan benda mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 198",
    "description": "Dan wahai para penyembah berhala, sesembahan kamu itu bukan hanya tidak mampu menolong kamu atau membela dirinya. Yang lebih lemah dari itu pun mereka tak mampu. Jika kamu para penyembah berhala menyeru mereka, berhala-berhala itu, untuk memberi petunjuk kepada kebaikan dan kebenaran, mereka tidak dapat mendengarnya apalagi mengabulkan permintaan itu. Dan engkau wahai nabi Muhammad lihat mereka, yakni berhala-berhala yang disembah oleh orang-orang musyrik itu ada di hadapanmu seolah-olah memandangmu, sebab berhala-berhala itu dibuat seakan-akan memandang orang yang di hadapannya dengan mata yang bersinar, padahal mereka tidak melihat, karena se-sungguhnya tidak memiliki mata dan tidak pula hati. Setelah ayat-ayat yang lalu mengecam dengan keras kaum musyrik dan sembahan mereka, pada ayat ini Allah menjelaskan kepada nabi Muhammad tentang cara menghadapi kesesatan mereka. Jadilah engkau wahai nabi Muhammad dan juga umatmu orang yang pemaaf, dan tidak meminta sesuatu yang akan menyulitkan orang lain dan suruhlah orang mengerjakan dan mengucapkan yang makruf, berupa kebajikan yang dipandang baik oleh akal, agama dan tradisi masyarakat, serta jangan pedulikan orang-orang yang bodoh, teruslah melangkah dalam berdakwah."
  }
]