[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Terimalah (wahai rasul kamu juga umatmu), apa yang berlebih dari perilaku-perilaku manusia dan tindak-tanduk mereka, dan janganlah kamu menuntut dari mereka hal-hal yang memberatkan mereka agar mereka tidak menjauh. Dan perintahlah (orang) untuk bertutur kata yang baik dan perbuatan yang indah, dan berpalinglah dari setiap penentangan orang-orang yang bodoh dan duduk-duduk bersama orang-orang bodoh lagi dungu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "199. Terimalah -wahai Rasul- perbuatan dan perangai yang mampu dan mudah dilakukan oleh manusia. Jangan membebani mereka dengan sesuatu yang sulit diterima oleh tabiat mereka, karena hal itu akan membuat mereka menjauh darimu. Berikanlah mereka perintah dengan kata-kata yang sangat lembut dan tindakan yang baik. Dan abaikanlah orang-orang yang bodoh. Jangan membalas kebodohan mereka dengan tindakan serupa. Siapa yang menyakitimu jangan kamu balas dengan menyakitinya. Dan siapa yang kikir kepadamu jangan kamu balas dengan kikir kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "199. Hai Muhammad, permudahlah dalam berinteraksi dengan manusia, Dan terimalah dari mereka amalan yang mampu mereka lakukan serta janganlah meminta sesuatu yang memberatkan mereka agar mereka tidak menjauh darimu. Jadilah orang yang lembut dalam berinteraksi dengan pengikutmu, perintah orang lain untuk melakukan amal kebaikan, yaitu segala amalan yang diakui syariat sebagai amalan baik, karena amalan itu akan mudah diterima. Dan lakukanlah bagi orang lain perbuatan berupa mengajarkan ilmu, menyuruh kebaikan, menyambung silaturahim, berbakti kepada orang tua, mendamaikan orang yang berselisih, atau melarang perbuatan buruk. Dan karena Rasulullah pasti menghadapi gangguan dari orang bodoh dan jahil, maka Allah memerintahkannya untuk berpaling dari orang-orang yang tidak memahami nilai dari sesuatu, seseorang, atau ucapan mereka yang merupakan bentuk dari kejahilan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "199. خُذِ الْعَفْوَ (Jadilah engkau pemaaf) Atas perilaku orang lain dan sedekah mereka. Maka janganlah kamu membebankan mereka dengan sesuatu yang memberatkan mereka, kemudian setelah itu mereka dibebani lagi dengan penegakan had dan pembayaran zakat. Rasulullah pernah bersabda: “mudahkanlah dan jangan mempersulit, berilah kabar gembira dan jangan membuat kabur. وَأْمُرْ بِالْعُرْفِ(dan suruhlah orang mengerjakan yang ma’ruf) Perbuatan ma’ruf adalah semua bentuk kebaikan yang dapat diterima oleh akal dan menenangkan hati. وَأَعْرِضْ عَنِ الْجٰهِلِينَ (serta berpalinglah dari pada orang-orang yang bodoh) Jika kamu telah menegakkan hujjah atas mereka dengan menyuruh mereka berbuat ma’ruf lalu mereka tidak mengerjakannya, maka berpalinglah dari mereka dan janganlah kamu mendebat dan membodoh-bodohkan mereka sebagai balasan atas perdebatan dan pembodohan mereka kepadamu, karena mereka memang merupakan orang-orang yang bodoh."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Suatu ketika 'Uyainah bin hisn mendatangi 'Umar dan berkata : Sesunhguhnya kamutidak memberikan kepada hak-hak kami dan tidak pula kamu berlaku adil kepada kami, Umar kemudian marah dan hampir saja ia memukulnya, 'Uyainah kembali berkata : Wahai Amirul mukminin, sesungguhnya Allah berfirman : { خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ } , dan sesungguhnya apa yang terjadi padamu termasuk kejahilan, maka Umar pun tersentak dan terhenti pada ayat yang dibacakan. Begitu indah adab sahabat RAsulullah terhadap kitab Allah. 2 ). Suatu ketika Salim bin Abdullah bin 'Umar melewati suatu kafilah yang didalamnya terdapat jaros, beliau kemudian berkata : sesungguhnya benda terlarang, mereka pun menanggapi perkataan Salim : kami lebih tahu daripada engkau wahai Salim dan sesungguhnya yang dilarang hanyalah lonceng yang besar, dan adapun lonceng ini tidak ada masalah dengannya, Salim seketika menangis, dan berkata : { وَأَعْرِضْ عَنِ الْجَاهِ } \"serta berpalinglah dari pada orang-orang yang bodoh\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "199 Jadilah engkau pemaaf atas perangai-perangai manusia, jangan bebani mereka dengan sesuatu yang berat, dan suruhlah orang mengerjakan kebaikan. Ma’ruf adalah perbuatan atau perkataan baik yang sesuai secara akal dan syariat. Serta berpalinglah dari pada orang-orang yang bodoh. Maka jangan kamu perlakukan mereka sebagaimana perlakuab mereka dengan keburukan, perdebatan dengan batil."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Terimalah maaf} terimalah kemudahan dari akhlak dan amal manusia {perintahlah pada kebaikan} kebaikan {dan berpalinglah dari orang-orang bodoh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "199 Ayat ini mengumpulkan kebaikan akhlak dengan manusia dan apa yang harus dilakukan dalam bergaul dengan mereka. Perkara yang selayaknya dijadikan pedoman dalam bergaul dengan manusia adalah memberi maaf, yakni perangai yang disukai oleh diri mereka. serta merupakan perbuatan dan akhlak yang mudah atas mereka. Jangan membebani mereka dengan apa yang tidak sesuai dengan tabiat mereka, akan tetapi berterima kasihlah kepada setiap orang atas apa yang dia dapatkan darinya dalam bentuk perbuatan dan ucapan yang baik, memaklumi kelalaian dan memaafkan kekurangan mereka. Tidak menyombongkan diri kepada yang lebih kecil karena kecilnya, atau kepada orang bodoh karena kebodohannya, atau kepada orang miskin karena kemiskinannya, akan tetapi dia bergaul dengan semuanya dengan lemah lembut dan perlakuan yang sesuai dengan kondisi, dengan dada yang lapang. ”dan suruhlah orang mengerjakan yang ma’ruf” yakni mengerjakan semua ucapan yang dan perbuatan yang baik dan akhlak yang sempurna baik kepada orang yang dekat maupun kepada orang yang jauh. jadikanlah sesuatu yang kamu berikan kepada manusia dalam bentuk pengajaran ilmu atau dorongan kepada kebaikan, berupa silaturahmi, berbuat baik kepada kedua orang tua, mendamaikan perselisihan diantara dua manusia, memberi nasihat yang berguna, memberi pendapat yang benar, tolong menolong dalam kebaiak, dan takwa, melarang yang buruk, atau memberi petunjuk kepada kemaslahatan agama dan dunia. karena gangguan dari orang bodoh adalah suatu keniscayaan, maka Allah memerintahkan agar menyikapinya dengan berpaling darinya dan tidak membalas kebodohannya. Barangsiapa menyakitimu dengan ucapan atau perbuatannya, maka janganlah kamu menyakitinya. barangsiapa yang tidak memberimu, maka kamu jangan tidak memberinya. Barangsiapa yang memutuskanmu, maka kamu jangan memutuskannya. dan barangsiapa yang menzhalimimu, maka bersikap adil lah kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 199: Ayat ini mencakup akhlak mulia yang patut dilakukan terhadap orang lain dan bagaimana bergaul dengan mereka. Akhlah tersebut adalah: Pertama, ‘afwu, yakni bersikap samahah (toleransi) atau memaafkan kesalahan orang lain dan tidak membesar-besarkannya, berterima kasih terhadap perkataan dan perbuatan baik orang lain, memaafkan kekurangan mereka dan menundukkan pandangannya dari melihat kekurangannya, tidak bersikap sombong terhadap anak kecil karena usianya, tidak bersikap sombong kepada orang yang kurang akal karena kelemahannya, demikian pula tidak bersikap sombong kepada orang miskin karena kefakirannya, bahkan ia bergaul dengan mereka menggunakan kelembutan dan dengan sikap yang sesuai keadaan dan sesuai hal yang menyenangkan hati mereka. Kedua, menyuruh orang lain mengerjakan yang ma’ruf baik dengan menyampaikan ilmu atau mendorong mengerjakan kebaikan, seperti mendirikan shalat, silaturrahim, berbakti kepada orang tua, mendamaikan manusia, atau memberi nasehat yang bermanfaat, tolong-menolong di atas kebaikan dan ketakwaan, melarang perbuatan buruk, memberikan pengarahan terhadap hal yang dapat menghasilkan maslahat agama maupun dunia. Oleh karena mengarahkan kepada kebaikan terkadang mendatangkan gangguan dari orang-orang yang jahil (bodoh), maka Allah Ta’ala memerintahkan melakukan yang ketiga, yaitu: Ketiga, menghadapi orang yang jahil dengan berpaling darinya dan tidak menghadapinya dengan kebodohannya. Siapa saja yang menyakitimu dengan perkataan atau perbuatannya, maka jangan balas menyakitinya. Siapa saja yang tidak memberimu, maka berilah dia, siapa saja yang memutuskan hubungan denganmu, maka sambunglah, dan siapa saja yang menzalimimu, maka berbuat adillah padanya. Inilah tiga sikap yang perlu dilakukan dalam bermu’amalah dengan manusia, adapun sikap yang perlu dilakukan dalam bermu’amalah dengan setan dari kalangan jin dan manusia, maka dijelaskan dalam ayat selanjutnya (lihat ayat 200). Yakni sebagaimana dalam pribahasa Indonesia, “Biarkan anjing menggonggong, kafilah berlalu.” Akan tetapi kata-kata yang digunakan dalam pribahasa ini kurang baik, yang baik adalah apa yang disebutkan dalam Al Qur’an di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 199",
    "description": "Setelah ayat-ayat yang lalu mengecam dengan keras kaum musyrik dan sembahan mereka, pada ayat ini Allah menjelaskan kepada nabi Muhammad tentang cara menghadapi kesesatan mereka. Jadilah engkau wahai nabi Muhammad dan juga umatmu orang yang pemaaf, dan tidak meminta sesuatu yang akan menyulitkan orang lain dan suruhlah orang mengerjakan dan mengucapkan yang makruf, berupa kebajikan yang dipandang baik oleh akal, agama dan tradisi masyarakat, serta jangan pedulikan orang-orang yang bodoh, teruslah melangkah dalam berdakwahrasul sebagai manusia, tentu saja dapat marah jika kemungkaran orang-orang musyrik telah mencapai puncaknya, dan setan akan memanfaatkan itu. Oleh karenanya, nabi dan umatnya diingatkan, dan jika setan datang menggodamu dengan merayu secara halus, melalui suatu bisikan, seperti saat dirimu murka karena hujatan-hujatan jahat mereka, maka berlindunglah kepada Allah, dengan memohon pertolongan kepada-Nya, niscaya dia akan mengusir bisikan-bisikan itu. Sungguh, dia maha mendengar setiap ucapan, termasuk permohonanmu itu, dan dia maha mengetahui setiap perbuatan, termasuk yang direncanakan oleh setan."
  }
]