[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-qur’an ini merupakan kitab yang agung yang diturunkan oleh Allah kepadamu (wahai rasul). maka janganlah ada di dalam hatimu keraguan tentangnya bahwa dia diturunkan dari sisi Allah. Dan janganlah engkau merasa susah menyampaikannya dan memperingatkan (orang) dengannya. Kami menurunkannya kepadamu untuk menakut-nakuti orang-orang kafir dengannya dan mengingatkan orang-orang mukmin dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Al-Qur`ān al-Karīm adalah kitab suci yang Allah turunkan kepadamu, wahai Rasul, maka janganlah ada kesempitan dan keraguan di dalam dadamu terhadap kitab suci ini. Allah menurunkannya kepadamu agar kamu gunakan untuk memperingatkan manusia, menegakkan hujah, dan memberikan pelajaran kepada orang-orang mukmin. Karena hanya orang-orang mukminlah yang bisa mendapatkan manfaat dari pelajaran yang diberikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hai Muhammad, al-Qur'an yang mulia ini adalah kitab yang diturunkan oleh Allah kepadamu, maka janganlah dadamu menjadi sempit akibat pendustaan orang-orang kafir. al-Qur'an telah diturunkan kepadamu untuk mendakwahi dan memperingatkan mereka dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. كِتٰبٌ أُنزِلَ إِلَيْكَ (Ini adalah sebuah kitab yang diturunkan kepadamu) Yakni ini adalah sebuah kitab. فَلَا يَكُن فِى صَدْرِكَ حَرَجٌ مِّنْهُ(maka janganlah ada kesempitan di dalam dadamu karenanya) Yakni janganlah ada kesempitan dalam dadamu saat menyampaikannya kepada manusia karena takut mereka akan mendustakan dan menyakitimu, sebab Allah adalah pelindung dan penolongmu; jangan pula merasa sempit di dadamu karena mereka tidak beriman kepada kitab ini dan tidak menjawab seruanmu sebab tugasmu hanyalah menyampaikan. Pendapat lain mengatakan maknanya adalah janganlah ada dalam dadamu keraguan dan kebimbangan akan hakikat kitab ini adalah kitab Allah yang diturunkan kepadamu untuk menyeru hamba-hamba Allah kepada agama-Nya. لِتُنذِرَ بِهِۦ (supaya kamu memberi peringatan dengan kitab itu) Yakni Kami menurunkan al-qur’an agar dengannya kamu memberi peringatan kepada manusia. وَذِكْرَىٰ لِلْمُؤْمِنِينَ (dan menjadi pelajaran bagi orang-orang yang beriman) Yakni Kami menurunkannya agar menjadi pelajaran bagi mereka. Maka fungsi kitab ini adalah untuk mengingatkan mereka kepada Tuhan dari waktu ke waktu dan kepada hak-Nya dalam hal ketaatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Al-Qur’an ini adalah kitab yang diturunkan kepadamu wahai nabi, maka jangan sampai kamu tertekan dalam menyampaikannya kepada manusia, meskipun mereka mendustakan dan memfitnahmu, Sesungguhnya Allah adalah penjaga, penyelamat dan pemeliharamu. Kami menurunkannya kapadamu supaya kamu memberi peringatan orang yang bermaksiat kepadaNya tentang hukuman Allah dan pengingat bagi kaum mukmin tentang keutamaan Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kitab yang diturunkan kepadamu, maka jangan sampai ada kesesakan dalam dadamu karenanya} keraguan dan kesesakan dalam menyampaikannya {supaya dengannya kamu memberi peringatan, dan menjadi pelajaran} pelajaran {bagi orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah berfirman kepada RasulNya, menjelaskan tentang keagungan al-qur’an kepadanya “ini adalah sebuah kitab yang diturunkan kepadamu” yakni kitab mulia yang memuat segala sesuatu yang dibutuhkan oleh semua hamba, dan seluruh tuntunan-tuntunan ilahiyah, serta tujuan-tujuan syar’I yang akurat lagi teerperinci. Maka janganlah ada rasa di dadamu karenanya, ”kesempitan” yakni kesulitan, keraguan dan kebimbangan. Bahkan agar kamu mengetahui bahwa ia diturunkan dari Dzat yang Maha bijaksana lagi Maha terpuji. Tidak ada kebatilan yang dating dari hadapanNya dan tidak pula dari belakangNya. Oleh karena itu hendaknya dadamu menjadi lapang karenanya, jiwamu menjadi tenang dengannya, dan kamu mau menjelaskan perintah-perintah dan larangan-larangannya (kepada para hamba). Jangan takut kepada orang yang mencela dan menentang, ”supaya kamu memberi peringatan dengan kitab itu”, kepada seluruh manusia, kamu menasihati dan mengingatkan mereka, sehingga hujjah menjadi tegak atas orang-orang yang menetang “dan menjadi pelajaran bagi orang-orang yang beriman”. sebagiamana firman Allah” dan tetaplah memberi peringatan karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman” Dengan ayat itu mereka mengingat jalan yang lurus, amal-amal mereka yang lahir maupun yang batin, dan apa yang menjadi penghalang bagi hamba untuk menitinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 2: Yakni karena khawatir didustakan ketika menyampaikannya. Kepada semua manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 2",
    "description": "Pada akhir surah yang lalu dijelaskan tentang turunnya Al-Qur'an, untuk apa ia diturunkan, perintah untuk mengikutinya, dan ancaman bagi orang yang mengabaikan tuntunannya. Surah ini diawali dengan menyebut kembali Al-Qur'an yang dibicarakan pada surah al-an'a'm itu dan keharusan mengikuti tuntunannya. Inilah kitab yang diturunkan melalui malaikat jibril kepadamu, wahai rasulullah, sebagai penghormatan untukmu, maka janganlah engkau sesak dada karenanya akibat takut terhadap orang kafir yang akan mendustakanmu. Tugasmu adalah menyampaikan Al-Qur'an agar engkau memberi peringatan dengan kitab itu kepada kaummu dan sekalian manusia akan akibat dari dosa yang mereka lakukan, dan menjadi pelajaran bagi orang yang beriman, karena merekalah yang paling siap memanfaatkan isi kandungannya. Al-qur'an mempunyai fungsi yang demikian agung, maka Allah memerin tahkan manusia untuk mengikuti ajarannya. Ayat ini juga ditujukan kepada para juru dakwah dan mubalig. Ikutilah, wahai kaum muslim, apa yang diturunkan kepadamu dari tuhanmu dalam hal apa saja. Yakinilah bahwa semuanya akan membawa kebaikan, karena tuhanmu adalah zat yang maha penyayang kepada makhluk-Nya. Janganlah kamu ikuti siapa pun selain dia sebagai pemimpin lalu kamu pasrahkan semua urusanmu kepada mereka dan kamu taati saja seruan mereka, padahal mereka akan mengajakmu kepada jalan kesesatan. Sedikit sekali kamu mengambil pelajaran sehingga kamu tidak kembali ke jalan yang benar. Ayat ini melarang seorang mengikuti ajakan orang lain dalam urusan agama yang tidak datang dari Allah."
  }
]