[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka setan membisikan keragu-raguan kepada Adam dan Hawwa untuk menjurumuskan mereka kedalam maksiat terhadap Allah dengan memakan buah dari pohon yang Allah larang mereka berdua dari (memakan buahnya) supaya mengakibatkan terbukanya apa yang tertutupi dari aurat mereka. Dan setan berkata kepada mereka dalam upaya memperdayai mereka berdua, ”sesungguhnya tuhan kalian melarang kalian dari memakan buah dari pohon ini hanyalah agar kalian tidak berubah menjadi malaikat dan agar kalian berdua tidak hidup kekal di dalam surga. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Kemudian Iblis menggoda mereka berdua untuk memperlihatkan kepada mereka aurat mereka yang tertutup. Iblis berkata, “Sesungguhnya Allah melarang kalian memakan (buah) dari pohon itu, karena Dia tidak ingin kalian menjadi malaikat dan tidak ingin kalian kekal di dalam Surga.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Ketika setan melihat kemuliaan yang didapatkan Adam dan istrinya, maka ia mulai menggoda mereka berdua agar memakan buah dari pohon terlarang tersebut, supaya mereka terjerumus ke dalam kemaksiatan. Dan akibat dari perbuatan yang mereka lakukan adalah aurat mereka tidak tertutupi. Iblis berkata kepada mereka berdua dengan penuh tipu daya: \"Tuhan kalian melarang kalian dari memakan buah pohon terlarang itu, tidak lain agar kalian tidak menjadi malaikat yang didekatkan kepada-Nya atau agar kalian tidak hidup kekal.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. فَوَسْوَسَ لَهُمَا الشَّيْطٰنُ (Maka syaitan membisikkan pikiran jahat kepada keduanya) Yakni berbicara dengan mereka berdua dengan suara yang rendah. لِيُبْدِىَ لَهُمَا (ntuk menampakkan kepada keduanya) Yakni menunjukkan kepada keduanya. مَا وُۥرِىَ (apa yang tertutup) Yakni yang tertutup. عَنْهُمَا مِن سَوْءٰتِهِمَا (dari mereka yaitu auratnya) Setan ingin menjelekkan mereka berdua dengan menyingkap aurat yang awalnya tertutup, karena mereka berdua pada asalnya tidak melihat uarat masing-masing dan tidak melihat aurat pasangannya. Dan pendapat lain mengatakan bahwa aurat keduanya tidak nampak pada pasangannya. وَقَالَ مَا نَهَىٰكُمَا رَبُّكُمَا عَنْ هٰذِهِ الشَّجَرَةِ (dan syaitan berkata: “Tuhan kamu tidak melarangmu dan mendekati pohon ini) Untuk memakannya. إِلَّآ أَن تَكُونَا مَلَكَيْنِ (melainkan supaya kamu berdua tidak menjadi malaikat) Agar kalian tidak menjadi dua orang malaikat. أَوْ تَكُونَا مِنَ الْخٰلِدِينَ (atau tidak menjadi orang-orang yang kekal) Yakni kekal di dalam surga, yakni termasuk orang-orang yang tidak mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Lalu setan menghasut keduanya, membisikkan sesuatu dari bumi ke langit, dan menggoda keduanya untuk memakan buah dari pohon tersebut, dengan tujuan untuk menyingkap dan berbuat buruk kepada keduanya dengan menampakkan aurat yang menutupi dan menyelimuti keduanya, sehingga tidak ada yang melihat aurat tersebut. Iblis berkata kepada keduanya: “Tuhan kalian tidak melarang kalian memakan buah dari pohon ini, kecuali supaya kalian tidak menjadi malaikat yang dekat (denganNya) atau termasuk makhluk abadi yang tidak akan mati selamanya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu setan membisikkan kepada keduanya} Lalu Iblis melemparkan bisikan kepada keduanya {untuk menampak} menampakkan {kepada keduanya sesuatu yang tertutup sesuatu yang disembunyikan {dari aurat keduanya} aurat keduanya {setan berkata,“Tuhan kalian tidak melarang kalian berdua untuk mendekati pohon ini, kecuali kalian berdua menjadi} agar kalian berdua tidak menjadi {malaikat atau kalian berdua termasuk orang-orang yang kekal”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. keduanya senantiasa menaati perintah allah sampai iblis dating kepada mereka dengan makarnya. Dia menggoda mereka berdua dengan godaan yang menipu dan memperdaya keduanya. Dia berkata ”Rabb kamu tidak melarangmu dari mendekati pohon ini melainkan supaya kamu berdua tidak menjadi malaikat” yakni dari jenis malaikat. ”atau tidak menjadi orang yang kekal (dalam surge)\" seperti disebutkan di ayat yang lain, ”maukah saya tunjukan kepada kamu pohon khuldi (keabadian) dan kerajaan yang tidak akan binasa?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 20",
    "description": "Iblis ingin menghilangkan kenikmatan surga yang dinikmati adam dan pasangannya. Ia pun berusaha mengeluarkan adam dan pasangannya dari surga. Kemudian, dengan penuh kedengkian, setan membisikkan pikiran jahat kepada mereka, yaitu adam dan pasangannya, agar menampakkan aurat mereka yang selama ini tertutup. Dan setan berkata, tuhanmu hanya melarang kamu berdua mendekati pohon ini, agar kamu berdua tidak menjadi malaikat sehingga kalian memiliki kekuatan dan umur yang panjang atau tidak menjadi orang yang kekal dalam surga. Dan iblis tidak sekadar membisikkan atau merayu, tetapi juga berusaha meyakinkan adam. Dia, yakni setan, juga bersumpah kepada keduanya seraya berkata, sesungguhnya aku ini benar-benar termasuk para penasihatmu yang benar-benar tulus."
  }
]