[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apa yang menimpamu (wahai rasul) dari setan berupa amarah dan atau kamu merasakan gangguannya dalam bentuk was-was dan pengikisan semangat dari kebaikan atau dorongan berbuat keburukan, maka berlindunglah kepada Allah dengan memohon perlindungan kepadaNya. Sesungguhnya Dia maha mendengar setiap ucapan lagi maha mengetahui semua perbuaatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "200. Dan jika kamu -wahai Rasul- merasa bahwa setan menggodamu atau menghalang-halangimu agar tidak berbuat baik, maka berlindunglah kepada Allah. Karena Dia Maha Mendengar ucapanmu dan Maha Mengetahui usahamu untuk meminta perlindungan. Niscaya Dia akan melindungimu dari gangguan setan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "200. Kemudian Allah menyampaikan kepada rasul-Nya -dan kaum muslimin-, jika setan mendatangimu dengan godaan agar menimbulkan keraguan dan menyelisihi apa yang diperintahkan kepadamu berupa pemberian maaf, menjalankan amar ma'ruf, dan menjauhi orang-orang yang bodoh; maka mintalah perlindungan kepada Allah dari godaannya, karena Allah Yang Maha Mendengar makhluk yang menggodamu dan perkataan makhluk-Nya yang lain, tidak ada yang tersembunyi darinya; dan Allah Maha Mengetahui apa yang dapat menyingkirkan godaan setan darimu dan dan segala perkara makhluk-Nya. Dia juga Maha Mendengar doamu dan Maha Mengetahui segala urusanmu, hanya Dia yang dapat menghilangkan godaan setan darimu dan melindungimu darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "200. وَإِمَّا يَنزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ (Dan jika kamu ditimpa sesuatu godaan syaitan) Makna (النزغ) yakni godaan untuk berbuat kerusakan. Jika dikatakan (نزغ بيننا) yakni merusak hubungan diantara kami. فَاسْتَعِذْ بِاللهِ ۚ إِنَّهُۥ سَمِيعٌ عَلِيمٌ (maka berlindunglah kepada Allah. Sesungguhnya Dia Maha Mendengar lagi Maha Mengetahui) Yakni berlindunglah kepada-Nya karena Dia mendengarkan dan mengetahui ucapan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah befirman dalam surah (al-A'raf) : { فَاسْتَعِذْ بِاللَّهِ ۚ إِنَّهُ سَمِيعٌ عَلِيمٌ } , dan dalam surah Fushilah Allah berfirman : { فَاسْتَعِذْ بِاللَّهِ ۚ إِنَّهُ هو السَمِيعٌ العَلِيمٌ } , dan adapun hikmah dari pembedaan kedua ayat ini adalah : bahwasanya ayat al-a'raf diturunkan lebih awal daripada ayat fusshilat, maka dari itu katanya dita'rifkan : { هو السَمِيعٌ العَلِيمٌ } yang lebih dulu penyebutannya pada ayat tentang gangguan syaithon."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "200 Dan jika kamu ditimpa sesuatu godaan syaitan, atau bisikan buruk atau kerusakan dengan merusak akhlak maka mintalah perlindungan kepada Allah atas bisikannya agar engkau terbebas darinya. Sesungguhnya Allah Maha Mendengar doa dan Maha Mengetahui segala kondisi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika setan benar-benar menggodamu} mendekati dan menggodamu {dengan halus} bisikan, menghalangi dari kebaikan dan mendorong kepada keburukan {berlindunglah kepada Allah} mintalah perlindungan dan pertolongan kepada Allah {Sesungguhnya Dia Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "200 yakni kapan pun dan dalam kondisi apapun, ”kamu ditimpa sesuatu godaan setan” yakni kamu merasakan godaannya, membuatmu malas berbuat baik atau mendorongmu dan memacumu berbuat buruk, ”maka berlidunglah kepada Allah” yakni berlindunglah kepada naungan perlindungan Allah karena Dia Maha Mendengar apa yang kamu ucapkan. ”mengetahui” niatmu, kelemahanmu, dan kebutuhanmu, akan perlindunganNya, maka Dia kan melindungimu dari fitnahnya dan menjagamu dari godaan, sebagaimana Firman Allah ”katakanlah aku berlindung kepada Rabb (yang memelihara dan menguasai) manusia, Raja manusia, sembahan manusia, dari kejahatan(bisikan) setan yang biasa sembunyi, yang membisikan (kejahatan) kedalam dada manusia, dari (golongan) jin dan manusia”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 200: Ingin memalingkan kamu dari ketaatan kepada-Nya atau melemahkan kamu mengerjakan kebaikan atau mendorong kamu mengerjakan keburukan. Maksudnya membaca A'udzubillahi minasy-syaithaanir-rajiim, niscaya Allah akan menyingkirkan godaan itu. Semua perkataanmu. Niat dan perbuatanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 200",
    "description": "Rasul sebagai manusia, tentu saja dapat marah jika kemungkaran orang-orang musyrik telah mencapai puncaknya, dan setan akan memanfaatkan itu. Oleh karenanya, nabi dan umatnya diingatkan, dan jika setan datang menggodamu dengan merayu secara halus, melalui suatu bisikan, seperti saat dirimu murka karena hujatan-hujatan jahat mereka, maka berlindunglah kepada Allah, dengan memohon pertolongan kepada-Nya, niscaya dia akan mengusir bisikan-bisikan itu. Sungguh, dia maha mendengar setiap ucapan, termasuk permohonanmu itu, dan dia maha mengetahui setiap perbuatan, termasuk yang direncanakan oleh setan. Setelah memberi petunjuk kepada nabi Muhammad, kini petunjuk tertuju kepada kaum bertakwa secara umum. Sesungguhnya orangorang yang bertakwa, yang memberi batas pemisah antara diri mereka dengan perbuatan-perbuatan maksiat, sehingga menghalangi masuknya rayuan dan godaan setan yang dapat memalingkan mereka dari perintah Allah, apabila mereka dibayang-bayangi pikiran jahat untuk berbuat dosa dari setan, mereka pun segera ingat kepada Allah yang telah memerintahkan untuk taat dan bertobat kepada-Nya, maka ketika itu juga, dengan cepat bagaikan tiba-tiba, mereka melihat dan menyadari kesalahan-kesalahannya."
  }
]