[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang bertakwa kepada Allah dari hamba-hambaNya, lalu mereka takut terhadap siksaanNYa, dengan cara menjalankan kewajiban-kewajiaban dan menjauhi larangan-larangan, dan apabila ada sesuatu muncul dari bisikan setan yang menimpa mereka, mereka langsung ingat apa yang Allah wajibkan atas mereka untuk taat dan bertaubat kepadaNYa, kemudian mereka berhenti dari maksiat kepada Allah berdasarkan pengetahuan yang benar, memegangi perintah Allah dan mendurhakai ajakan setan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "201. Sesungguhnya orang-orang yang bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya apabila mereka tergoda oleh bisikan setan kemudian berbuat dosa niscaya mereka akan teringat pada kebesaran Allah, hukuman yang akan diberikan oleh-Nya kepada orang-orang yang durhaka dan ganjaran yang disediakan-Nya bagi orang-orang yang taat kepada-Nya. Kemudian akan bertobat dari dosa-dosa dan kembali ke jalan Rabb mereka. Dan tiba-tiba mereka istikamah di jalan yang benar, menyadari kesalahan yang telah mereka perbuat dan berhenti melakukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "201. Kemudian Allah menjelaskan keadaan orang-orang bertaqwa yang menjauhkan diri mereka dari segala sesuatu yang dapat mengundang kemurkaan-Nya; bahwa jika mereka mendapat godaan setan yang melalaikan dari ketaatan Allah, mereka segera sadar bahwa godaan itu datang dari musuh mereka, dan teringat siksaan dan pahala Allah, serta janji dan ancaman-Nya; sehingga mereka segera bertaubat dan memohon perlindungan dari Allah, kembali kepada ketaatan-Nya, serta menahan diri mereka agar tidak mengikuti setan; sehingga dengan hal ini mereka tetap dapat melihat kebenaran dan memiliki hati yang suci."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "201. طٰٓئِفٌ مِّنَ الشَّيْطٰنِ (was-was dari syaitan) Yakni was-was darinya, karena bisikan setan menyerupai hayalan. Was-was setan yakni perintahnya untuk melakukan keburukan saat seseorang dalam keadaan marah dan ajakannya untuk melakukan kemaksiatan. تَذَكَّرُوا۟( mereka ingat kepada Allah) Yakni mengingat kebesaran Allah dan larangan-Nya. فَإِذَا هُم مُّبْصِرُونَ(maka ketika itu juga mereka melihat kesalahan-kesalahannya) Yakni tersadar dan mengetahui bahwa bisikan itu berasal dari setan, sehingga mereka berhenti dari kemaksiatan kepada Allah, dan tidak mentaati ajakan setan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "201 Sesungguhnya orang-orang yang bertakwa kepada Tuhannya, serta takut atas hukuman-Nya, menaati perintah dan meninggalkan larangan-Nya bila mereka ditimpa was-was dari syaitan, mereka ingat kepada hukuman dan pahala Allah, maka ketika itu juga mereka melihat kebenaran berupa kesalahan-kesalahannya, sehingga mereka kembali dari dari kerusakan menuju kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang bertakwa, jika mereka mendapat} ditimpa {pikiran jahat} bisikan {dari setan, mereka ingat (kepada Allah). Maka seketika itu mereka melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "201 karena hamba pasti lalai dan setan berhasil menipunya karena ia terus bersiap siaga menantikan kelengahan dan kelalaiannya, maka Allah menyebutkan tanda tanda orang orang yang bertakwa dan orang orang yang menyimpang. Adapun yang bertakwa jika dia merasakan dosa, dengan melakukan yang haram atau meninggalkan yang wajib, maka dia segera sadar darimana setan datang dan dari pintu mana setan masuk kepadanya, dia menyadari apa yang diwajibkan Allah atasnya dan apa yang menjadi tuntuan iman, maka dia memohon ampun kepada Allah dia menambal apa yang terlewatkan dengan taubat nasuha dan kebaikan yang banyak, maka dia berhasil mengusir setannya dengan hina dina dan memporak porandakan apa yang setan dapatkan darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 201: Oleh karena seorang hamba terkadang lalai dan terkena godaan setan, yang memang senantiasa mencari kesempatan untuk menggelincirkannya, maka Allah Ta’ala menerangkan ciri orang yang bertakwa dan ciri orang yang tersesat. Orang yang bertakwa ketika merasakan dosa dan tergoda oleh setan sehingga mengerjakan perkara yang haram atau meninggalkan kewajiban, maka ia segera ingat dan menyadari kesalahannya serta meminta ampunan kepada Allah, mengejar kelalaiannya dengan tobat nashuha dan mengiringinya dengan amal saleh, sehinga ia membuat setan rugi dan kecewa. Berbeda dengan kawan-kawan setan (orang-orang sesat), apabila mereka terjatuh ke dalam perbuatan dosa, maka setan-setan menambah lagi mereka berdosa dan tidak henti-hentinya menambahkan dosa dan menyesatkan. Ingat siksa dan pahala Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 201",
    "description": "Setelah memberi petunjuk kepada nabi Muhammad, kini petunjuk tertuju kepada kaum bertakwa secara umum. Sesungguhnya orangorang yang bertakwa, yang memberi batas pemisah antara diri mereka dengan perbuatan-perbuatan maksiat, sehingga menghalangi masuknya rayuan dan godaan setan yang dapat memalingkan mereka dari perintah Allah, apabila mereka dibayang-bayangi pikiran jahat untuk berbuat dosa dari setan, mereka pun segera ingat kepada Allah yang telah memerintahkan untuk taat dan bertobat kepada-Nya, maka ketika itu juga, dengan cepat bagaikan tiba-tiba, mereka melihat dan menyadari kesalahan-kesalahannya. Dan mereka yang bertakwa itu akan selamat, meski teman-teman mereka, yakni orang kafir dan fasik, terus-menerus membantu setansetan dari kalangan jin dan manusia dalam menyesatkan manusia di bumi, dan sikap mereka lebih buruk lagi, karena mereka tidak hanya membantu sekali atau dua kali, tetapi mereka giat melakukan bantuan tersebut secara terus-menerus dan tidak henti-hentinya menyesatkan dan melakukan perbuatan keji yang dilarang oleh Allah."
  }
]