[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan saudara-saudara setan, yaitu orang-orang yang gemar berbuat dosa dari kalangan manusia yang sesat, setan dari bangsa jin mendukung mereka dalam menyesatkan dan membelokan jalan. Dan setan-setan dari bangsa jin tidak akan mengendorkan usaha dalam mendukung setan dari bangsa manusia dalam membelokan jalan. Dan setan-setan dari bangsa manusia tidak mengurangi tenaga dalam menjalankan bisikan yang di hembuskan oleh setan-setan dari bangsa jin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "202. Teman-teman setan yaitu orang-orang jahat dan orang-orang kafir senantiasa dibantu oleh setan untuk terus berada di dalam kesesatan dengan perbuatan dosa demi dosa, tidak akan menyerah. Setan-setan tidak pernah berhenti menyesatkan. Sedangkan orang-orang jahat tidak pernah berhenti tunduk kepada setan dan berbuat jahat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "202. Adapun orang-orang yang musyrik dan lalai, yang tidak bertakwa kepada Allah dan tidak berlindung dengan perlindungan-Nya serta tidak menyelisihi setan, maka setan itu semakin menambah kesesatan mereka melalui godaannya untuk melakukan kemaksiatan. Setan-setan itu tidak pernah berhenti menjerumuskan teman-teman mereka dari golongan manusia dengan berbagai keburukan dan dosa hingga mereka binasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "202. وَإِخْوٰنُهُمْ يَمُدُّونَهُمْ فِى الْغَىِّ (Dan teman-teman mereka (orang-orang kafir dan fasik) membantu syaitan-syaitan dalam menyesatkan) Pada dasarnya pemilik hewan ternak melonggarkan tali ikatannya agar hewan itu dapat memakan rerumputan, setiap hewan itu menjauh darinya maka pemiliknya semakin mengulur talinya agar lebih leluasa memakan rumput, dan jika hewan itu mendekati sesuatu yang membahayakan maka pemiliknya menarik dan mendekatkannya pada dirinya. Makna dari ayat ini adalah para teman setan yaitu orang-orang yang tersesat dari golongan manusia, mereka dilonggarkan oleh setan-setan agar bisa ‘digembalakan’ di padang kesesatan, sehingga orang-orang itu menerima dan mengikuti para setan; dan pera setan itu tidak menghalangi orang-orang tersebut dari apa yang mereka inginkan, akan tetapi malah menambah godaan dan penyesatan kepada mereka hingga mereka binasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "202 Dan teman-teman mereka yaitu orang-orang kafir dan fasik membantu syaitan-syaitan dalam menyesatkan mereka dan mereka tidak henti-hentinya menyesatkan. Yuqshirun di sini bermakna terus-menerus menyesatkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Saudara-saudara mereka} saudara-saudara setan dari golongan manusia {membantu mereka} menambahi mereka {dalam kesesatan} kesesatan {kemudian mereka tidak berhenti} tidak berhenti menyesatkan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "202 adapun teman teman dan wali wali setan, maka mereka apabila terjatuh kedalam dosa, mereka terus berada di dalam kesesatan. Mereka melakukan satu dosa kepada dosa yang lain. bahkan tidak hanya sebatas itu, setan tiada henti hentinya menyesatkan, karena ia berambisi kepada mereka manakala mereka adalah orang orang yang mudah dikendalikan dan tiada henti melakukan perbuatan jahat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 202: Mereka tidak menyadari kesalahannya sebagaimana orang-orang yang bertakwa menyadarinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 202",
    "description": "Dan mereka yang bertakwa itu akan selamat, meski teman-teman mereka, yakni orang kafir dan fasik, terus-menerus membantu setansetan dari kalangan jin dan manusia dalam menyesatkan manusia di bumi, dan sikap mereka lebih buruk lagi, karena mereka tidak hanya membantu sekali atau dua kali, tetapi mereka giat melakukan bantuan tersebut secara terus-menerus dan tidak henti-hentinya menyesatkan dan melakukan perbuatan keji yang dilarang oleh Allah. Teman-teman mereka membantu mereka dalam kesesatan, dan juga kesesatan yang lain, yakni apabila engkau nabi Muhammad tidak membacakan suatu ayat berupa kebenaranmu kepada mereka seperti apa yang mereka inginkan, atau karena dalam beberapa waktu tidak ada ayat yang turun kepadamu, mereka berkata, mengapa tidak engkau buat sendiri ayat itu dari apa yang kami usulkan, atau membuat Al-Qur'an yang lain dari pada menunggu kedatangannya' katakanlah wahai nabi Muhammad kepada mereka, ini bukanlah kewenanganku dan aku tidak dapat melakukannya, sesungguhnya aku hanya mengikuti secara sungguh-sungguh apa yang diwahyukan tuhanku kepadaku melalui malaikat jibril. Al-qur'an ini adalah bukti-bukti yang nyata melebihi apa yang kamu minta, serta bersumber dari tuhanmu. Di samping sebagai bukti yang jelas ia juga merupakan petunjuk kepada jalan kebenaran dan rahmat berupa kasih sayang Allah bagi orang-orang yang beriman."
  }
]