[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kamu (wahai rasul), tidak datang kepada kaum musyrikin membawa satu ayat yang menunjukan kebenaranmu, mereka akan berkomentar, ”mengapa kamu tidak mengadakan dan menciptakannya sendiri?” katakanlah kepada mereka (wahai rasul), ”itu bukan wewenangku dan akau tidak boleh melakukannya. Sebab sesungguhnya Allah hanyalah memerintahkannku untuk mengkuti wahyu yang diwahyukan kepadaku dari sisiNya. Yaitu al-qur’an yang aku bacakan kepada kalian berisi hujjah-hujjah dan bukti-bukti nyata dari tuhan kalian dan sebagai penjelasan yang memberi petunjuk bagi kaum mukminin menuju jalan lurus serta rahmat yang dengannya Allah mencurahkan rahmatNYa kepada hamba-hambaNya yang beriman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "203. Apabila kamu -wahai Rasul- datang dengan membawa ayat, mereka mendustakannya dan berpaling darinya. Dan apabila kamu datang tanpa membawa ayat, mereka berkata, “Mengapa kamu tidak membuat ayat sendiri?” Katakanlah kepada mereka -wahai Rasul-, “Aku tidak berhak membuat ayat menurut kemauanku sendiri. Aku hanya mengikuti apa yang diwahyukan kepadaku. Al-Qur`ān yang kubacakan kepada kalian ini adalah hujah dan bukti yang berasal dari Allah, Pencipta kalian dan Pengatur urusan kalian, serta petunjuk dan rahmat bagi hamba-hamba Allah yang beriman. Sedangkan orang-orang yang tidak beriman adalah orang-orang yang sesat dan celaka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "203. Dan jika kamu tidak mendatangkan kepada mereka suatu ayat Alquran, atau ayat kauniyah dan mukjizat yang mereka usulkan, niscaya mereka akan berkata kepadamu dengan penuh kebodohan: \"Kenapa kamu tidak membuat sendiri ayat itu dengan akalmu, atau terus memintanya dari Tuhanmu?\" Disini Allah memerintahkan rasul-Nya untuk membalas perkataan mereka: \"Sesungguhnya aku hanya orang yang mengikuti ayat-ayat yang Allah wahyukan kepadaku; sehingga aku menyampaikan ayat-ayat itu kepada kalian tanpa mengubahnya. Allah menurunkan ayat-ayat sesuai dengan alasan dan hikmah yang Dia ketahui. Dan jika kalian menginginkan ayat dan mukjizat yang tidak lekang oleh waktu maka inilah Alquran yang merupakan mukjizat yang paling besar dan dalil yang paling jelas; ia bagaikan mata bagi hati untuk melihat kebenaran; dan ia adalah hidayah bagi kalian dari kesesatan; serta rahmat yang dapat menjauhkan azab bagi orang-orang beriman kepadanya dan mengamalkan petunjuk dan perintahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "203. وَإِذَا لَمْ تَأْتِهِم بِـَٔايَةٍ قَالُوا۟ لَوْلَا اجْتَبَيْتَهَا ۚ (Dan apabila kamu tidak membawa suatu ayat Al Quran kepada mereka, mereka berkata: “Mengapa tidak kamu buat sendiri ayat itu?”) Dahulu mereka berkata kepada Rasulullah: apabila wahyu dari Allah telat diturunkan cobalah untuk membuat sendiri ayat-ayat al-qur’an sesuai keinginanmu. قُلْ إِنَّمَآ أَتَّبِعُ مَا يُوحَىٰٓ إِلَىَّ (Katakanlah: “Sesungguhnya aku hanya mengikut apa yang diwahyukan dari Tuhanku kepadaku) Maka apa yang diturunkan dan diwahyukan kepadaku akan aku sampaikan kepada kalian. هٰذَا (Al Quran ini) Yakni al-qur’an yang diturunkan kepadaku ini merupakan bukti-bukti yang nyata dari Tuhanmu, yang digunakan sebagai penerang bagi orang yang menerimanya. وَهُدًى (dan petunjuk) Sebagai petunjuk bagi orang-orang beriman menuju keridhaan Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "203 Apabila kamu tidak membawa suatu ayat Al Quran kepada mereka wahai Nabi, mereka berkata: “Mengapa tidak kamu buat sendiri ayat itu?” Katakanlah: “Sesungguhnya aku hanya mengikut apa yang diwahyukan dari Tuhanku kepadaku. Aku bukanlah pembuat ayat. Al Quran ini adalah bukti-bukti yang nyata dari Tuhanmu, di dalamnya ada kebenaran sebagai petunjuk dan rahmat bagi orang-orang yang beriman. Juga nikmat Allah bagi kaum yang beriman dan melaksanakan perintah-Nya”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kamu tidak mendatangkan satu ayat kepada mereka, mereka berkata,“Mengapa tidak} mengapa tidak {kamu buat sendiri ayat itu”} kamu buat-buat sendiri dan menciptakan sendiri ayat itu dari dirimu sendiri {Katakanlah,“Sesungguhnya aku hanya mengikuti apa yang diwahyukan Tuhanku kepadaku. Ini} Al-Qur’an {adalah bukti-bukti nyata} dalil-dalil dan bukti-bukti nyata {dari Tuhan kalian, petunjuk, dan rahmat bagi kaum yang beriman.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "203 yakni orang orang yang mendustakanmu itu senantiasa berada di dalam kesombongan dan pengingkaran, meskipun kamu hadir kepada mereka dengan ayat ayat yang membuktikan hidayah dan jalan lurus. Jika kamu membawa ayat kepada mereka yang menunjukan kebenaranmu, maka mereka tidak akan tunduk. ”dan apabila kamu tidak membawa satu ayat” dari ayat ayat yang mereka usulkan dan tentukan, ”mereka berkata ’mengapa kamu tidak buat sendiri ayat itu?” yakni mengapa kamu tidak memilih-milih (suatu kalimat yang bisa dijadikan sebagai) ayat, sehingga ia pun menjadi ayat atau mukjizat tertentu, seolah olah kamulah yang menurunkan ayat atau mukjizat tertentu, seolah olah kamulah yang menurunkan ayat yang mengatur seluruh makhluk. Padahal sebenarnya sedikitpun kamu tidak memilki urusan apapun dalam hal ini. Atau (makananya) adalah, mengapa kamu tidak membuatnya sendiri dari dirimu ”katakanlah sesungguh aku hanya mengikuti apa yang diwahyukan dari Rabbku kepadaku” Aku hanyalah seorang hamba yang mengikuti lagi diatur, Allah lah yang menurunkan ayat dan mengirimkannya sesuai dengan tuntunan kebesaranNya dan hikmahNya yang agung. jika kamu menginkan ayat yang tidak teregusur oleh waktu dan hujjah yang tidak luruh dalam segala kesempatan maka ayat tersebut adalah al qur’an yang agung yang merupakan dzikir yang penuh hikmah. “al qur’an ini adalah bukti bukti yang nyata dari Rabbmu” yang dijadikan sebagai penerang dalam seluruh tuntutan ilahiyah dan tujuan insaniyah. Ia adalah dalil dan bukti. Barangsiapa yang merenungkan dan memikirkannya, maka dia mengetahui bahwa dia turun dari dzat yang maha bijaksana lagi maha mulia, tiada kebatilan yang hadir dari depannya atau dari belakangnya dengannya hujjah menjadi tegak atas semua orang yang mengetahuinya, akan tetpi kebanyakan manusia tidak beriman, karena barangasiapa yang beriman maka ia adalah “petunjuk” baginya dari kesesatan ”dan rahmat” baginya dari kesengsaraan. Seorang Mukmin yang mengikuti al qur’an dan mengambil petunjuk darinya, dia akan berbahgia di dunia dan akhiratnya. Adapun orang yang tidak beriman kepadanya, maka dia akan sesat dan sengsara di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 203: Yang mereka usulkan. Aku tidak mendatangkannya dari diriku sendiri. Yakni jika kamu menginginkan ayat yang tidak akan habis meskipun waktu berlalu dan hujah yang tidak batal meskipun hari terus berganti, maka Al Qur’an inilah ayat tersebut yang menjelaskan tuntutan ilahi dan kebutuhan manusia. Barang siapa yang memikirkan dan merenunginya, maka ia akan mengetahui bahwa Al Qur’an turun dari Tuhan Yang Mahabijaksana lagi Maha Terpuji, yang tidak dimasuki kebatilan dari depan maupun dari belakang dan sebagai penegak hujjah bagi orang yang telah sampai kepadanya. Agar tidak celaka dan sengsara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 203",
    "description": "Teman-teman mereka membantu mereka dalam kesesatan, dan juga kesesatan yang lain, yakni apabila engkau nabi Muhammad tidak membacakan suatu ayat berupa kebenaranmu kepada mereka seperti apa yang mereka inginkan, atau karena dalam beberapa waktu tidak ada ayat yang turun kepadamu, mereka berkata, mengapa tidak engkau buat sendiri ayat itu dari apa yang kami usulkan, atau membuat Al-Qur'an yang lain dari pada menunggu kedatangannya' katakanlah wahai nabi Muhammad kepada mereka, ini bukanlah kewenanganku dan aku tidak dapat melakukannya, sesungguhnya aku hanya mengikuti secara sungguh-sungguh apa yang diwahyukan tuhanku kepadaku melalui malaikat jibril. Al-qur'an ini adalah bukti-bukti yang nyata melebihi apa yang kamu minta, serta bersumber dari tuhanmu. Di samping sebagai bukti yang jelas ia juga merupakan petunjuk kepada jalan kebenaran dan rahmat berupa kasih sayang Allah bagi orang-orang yang beriman. Dan sampaikan juga bahwa apabila dibacakan ayat-ayat Al-Qur'an oleh siapa pun, maka dengarkanlah dengan penuh perhatian, dan diamlah sambil memperhatikan tuntunan-tuntunannya dengan tenang agar kamu mendapat rahmat dari Allah. Jika dibacakan Al-Qur'an, kita diperintahkan mendengar dan memperhatikan sambil berdiam diri, baik di dalam salat maupun di luar salat."
  }
]