[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila al-qur’an dibacakan, maka dengarkanlah ia dengan baik (wahai sekalian manusia), dan diamlah untuk memperhatikannya supaya kalian dapat memahminya dengan harapan Allah akan merahmati kalian dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "204. Apabila Al-Qur`ān dibaca maka dengarkanlah bacaannya dengan seksama. Jangan berbicara atau menyibukkan diri dengan hal lain, agar kalian mendapatkan rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "204. Kemudian Allah memerintahkan jika Alquran yang telah disebutkan keutamaannya itu dibacakan kepada kalian, maka dengarkanlah dengan penuh penghayatan kekhusyu'an. Simaklah ia dengan pendengaran dan seluruh anggota badan kalian, agar kalian dapat memahami maknanya dan mengerti perintahnya. Dengarkanlah bacaan itu sampai selesai sebagai bentuk pengagungan baginya agar kalian dapat meraih rahmat dan keridhaan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "204. وَإِذَا قُرِئَ الْقُرْءَانُ فَاسْتَمِعُوا۟ لَهُۥ وَأَنصِتُوا۟ (Dan apabila dibacakan Al Quran, maka dengarkanlah baik-baik, dan perhatikanlah) Agar kalian mendapat manfaat darinya dan mentadabburi hikmah-hikmah dan kebaikan yang terkandung didalamnya. Hal ini berlaku di dalam shalat dan di luar shalat. Janganlah kalian menjadikannya seperti kalam-kalam lainnya yang dicampakkan oleh orang yang ingin mencampakkannya. لَعَلَّكُمْ تُرْحَمُونَ(agar kamu mendapat rahmat) Yakni memperoleh rahmat karena telah menjalankan perintah Allah dan mendengar ayat-ayat dari kitab-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ketika dibacakan kepadamu al-qur'an cobalah untuk merasakan bahwa seakan-akan kamu mendengarnya langsung dari Allah; maka tatkala hal itu dapat ia wujudkan, niscaya hatinya akan dipenuhi dengan indahnya makna ayat-ayat itu serta kelembutan dan keajaiban yang terkandung didalamnya. 2 ). Siapapun yang seksama mendegarkan ayat-ayat Allah dibacakan, sesungguhnya ia sedang menanti turunya rahmat Allah, maka sepanjang malam ini akan menjadi lebih baik jika dseimbangkan antara shalat dan kesetiaanmu untuk mendengarkan kalam Allah, karena itu akan memperbanyak turunya rahmat dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "204 Apabila dibacakan Al Quran di dalam shalat atau lainnya, maka dengarkan dan simaklah baik-baik untuk memahami maknanya, diamlah dari segala kesibukan dan pembicaraan untuk mendengarkan bacaannya, dan perhatikanlah dengan tenang agar kamu mendapat rahmat ketika melaksanakan perintah-Nya dan mendengarkan ayat kitab-Nya. Ayat ini turun saat ada yang meninggikan bacaan shalat di belakang Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika dibacakan Al-Qur’an, dengarkanlah dan diamlah agar kalian dirahmati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "204 perintah ini berlaku umum bagi semua orang yang mendengar al quran, kitabullah dibaca, dia diperintahkan untuk diam, dan mendengarkan. dan perbedaan diantara diam dan mendengarkan adalah bahwa diam secara zahir adalah dengan meninggalkan pembicaraan atau tidak menyibukkan diri dengan sesuatu yang membuatnya tidak mendengar. Adapun mendengar maka maksudnya adalah menyimak dengan membuka hati dan merenungkan apa yang didengar. barangsiapa yang memegang kedua perkara ini ketika kitabullah dibaca, maka dia akan mendaptkan kebaikan yang banyak, ilmu yang melimpah, iman yang diperbarui, petunjuk yang selalu bertambah, dan bashirah dalam agamanya. Oleh karena itu Allah mengaitkan diraihnya rahmat dengan kedua perkara tersebut, hal ini menujukkan bahwa barangsiapa yang dibacakan al qur’an kepadanya, lalu dia tidak mendengar dan tidak diam, maka dia tidak akan meraih bagian rahmat, dan dia telah kehilangan kebaikan yang melimpah. Diantara perintah yang ditekankan kepada pendengar al quran adalah hendaknya dia mendengarkan dan diam untuknya dalam shalat jahriyah ketika imam nya membaca al quran, dalam kondisi ini dia diperintahkan untuk diam, bahkan kebanyakan ulama berkata bahwa diamnya adalah lebih baik daripada dia membaca al fatihah atau lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 204: Dengan menghadirkan hati dan mentadabburi apa yang didengarnya. Dengan tidak melakukan obrolan atau kesibukan lainnya yang memalingkan dari mendengarnya. Maksud ayat ini adalah jika dibacakan Al Quran kita wajib mendengar dan memperhatikan sambil berdiam diri, baik dalam shalat maupun di luar shalat, kecuali dalam shalat berjamaah, maka makmum boleh membaca Al Faatihah sendiri, namun ulama lain berpendapat bahwa ia cukup mendengarkan bacaan imam saja. Ada pula ulama yang berpendapat, bahwa ayat ini turun berkenaan dengan tidak bolehnya berbicara sewaktu khatib berkhutbah, digunakan kata-kata Al Qur’an adalah karena kandungan khutbah isinya ayat-ayat Al Qur’an, ada pula yang berpendapat bahwa perintah untuk mendengarkan dan diam ketika dibacakan Al Qur’an secara mutlak. Seperti mendapatkan kebaikan dan ilmu yang banyak, keimanan yang tetap dan menjadi baru, bertambah petunjuk, dan memperoleh bashirah (ketajaman pandangan) dalam agamanya. Oleh karena itu, orang yang tidak mendengar dan diam ketika Al Qur’an dibacakan, maka ia terhalang mendapatkan bagian dari rahmat dan kebaikan yang banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 204",
    "description": "Dan sampaikan juga bahwa apabila dibacakan ayat-ayat Al-Qur'an oleh siapa pun, maka dengarkanlah dengan penuh perhatian, dan diamlah sambil memperhatikan tuntunan-tuntunannya dengan tenang agar kamu mendapat rahmat dari Allah. Jika dibacakan Al-Qur'an, kita diperintahkan mendengar dan memperhatikan sambil berdiam diri, baik di dalam salat maupun di luar salat. Dan ingatlah tuhanmu dengan sungguh-sungguh hingga keagungan dan kebesaran-Nya hadir dalam hatimu ketika membaca dan mendengar Al-Qur'an atau berzikir, dengan rendah hati dan rasa takut. Kamu akan merasakan kehadiran, kedekatan dan rasa takut pada-Nya. Lakukan itu dengan tidak mengeraskan suara. Tidak perlu kamu bersuara keras atau terlalu lemah. Lakukanlah zikir itu pada waktu pagi dan petang, agar kamu memulai dan mengakhiri harimu dengan mengingat Allah. Dan janganlah kamu termasuk orang-orang yang lengah, tidak mengingat Allah di setiap saat."
  }
]