[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah tuhanmu (wahai rasul), dalam jiwamu dengan khusyu dan merendahkan diri kepada Allah, penuh rasa takut dan malu terhadapNya. Dan berdo’alah kepadaNya dengan suara lirih antara keras dan pelan di permulaan hari dan penghujungnya. Dan janganlah kamu termasuk orang-orang yang lalai dari berdzikir Allah dan sibuk bermain-main hingga melupakannya dalam seluruh waktu mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "205. Dan sebutlah -wahai Rasul- nama Allah Rabbmu dengan khusyuk, rendah hati, dan disertai rasa takut. Dan panjatkanlah doamu dengan suara yang sedang, antara keras dan lirih di pagi hari dan petang hari, mengingat keutamaan dua waktu ini. Dan janganlah kamu termasuk orang-orang yang lalai dari mengingat Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "205. Surat yang mulia ini ditutup dengan perintah untuk berdzikir kepada Allah, Allah berfirman kepada nabi-Nya -serta orang-orang yang beriman-: Ingatlah keagungan Allah di dalam hatimu, Ingatlah Dia dengan apa yang dapat mendekatkanmu kepada-Nya, baik itu dengan cara membaca Alquran, berdoa, bertasbih, bertahmid, bertahlil, dan lain sebagainya. Ingatlah Dia dalam hatimu dengan penuh ketundukan dan ketakutan dan ingatlah Dia dengan lisanmu tanpa meninggikan suara secara berlebihan, yaitu dengan suara pertengahan yang tidak tinggi dan tidak pula rendah, dengan cukup dapat didengar oleh diri sendiri. Ingatlah Allah dalam setiap waktu terlebih lagi pada pagi dan petang hari, karena dua waktu ini adalah dua ujung siang; dan barangsiapa yang memulai dan menutup harinya dengan mengingat Allah maka dia layak mendapat perlindungan-Nya. Kemudian Allah memerintahkan rasul-Nya untuk tidak menyelisihi hal itu dan tidak menjadi termasuk orang-orang yang lalai dalam mengingat Allah, sehingga Allah melupakan mereka; karena orang-orang yang lalai tersebut telah dijauhkan dari kebaikan dunia dan akhirat, serta berpaling dari Dzat yang segala kebahagiaan dan kemenangan terdapat dalam dzikir dan peribadatan kepada-Nya, dan mereka menuju kepada makhluk yang segala kesusahan dan penyesalan berada bersamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "205. وَاذْكُر رَّبَّكَ فِى نَفْسِكَ (Dan sebutlah (nama) Tuhanmu dalam hatimu) Yakni secara lembut dengan memperhatikan dan mentadabburinya. تَضَرُّعًا وَخِيفَةً(dengan merendahkan diri dan rasa takut) Dengan penuh ketundukan dan rasa takut. وَدُونَ الْجَهْرِ مِنَ الْقَوْلِ(dan dengan tidak mengeraskan suara) Yakni cukup dengan suara yang kamu dengar dan janganlah berteriak-teriak ketika menyebutnya, namun mengucapkannya dengan suara yang tidak keras. بِالْغُدُوِّ(di waktu pagi) Yakni di waktu-waktu pagi. Makna (الغدوة) yakni pagi hari. وَالْاٰصَالِ (dan petang) Yakni di waktu-waktu sore. Makna (الأصيل) yakni waktu setelah ashar sampai maghrib. وَلَا تَكُن مِّنَ الْغٰفِلِينَ (dan janganlah kamu termasuk orang-orang yang lalai) Yakni yang lalai dari berzikir kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikan bagaimana Allah menyebutkan dalam dzikir : { وَاذْكُرْ رَبَّكَ فِي نَفْسِكَ تَضَرُّعًا } \"Dan sebutlah (nama) Tuhanmu dalam hatimu dengan merendahkan diri\" dan daam ayat do'a : { ادْعُوا رَبَّكُمْ تَضَرُّعًا } \"Berdoalah kepada Tuhanmu dengan berendah\", kedua ayat ini mengandung perintah yang sama yaitu bersikap rendah diri, karena sesungguhnya ia adalah ruh dalam dzikir dan doa. 2 ). Barangsiapa yang senantiasa istiqomah dalam melantunkan dzikir pada pagi hari dan sorenya, niscaya ia akan terjauh dari sifat orang-orang lalai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "205 Dan sebutlah nama Tuhanmu dalam hatimu dengan merendahkan diri dengan rasa takut, dan dengan tidak mengeraskan suara, di waktu pagi dan petang, dan janganlah kamu termasuk orang-orang yang lalai dari berdzikir kepada Allah. Al-Ghuduw adalah waktu pagi. Dan Al-Ashal adalah waktu antara ashar dan terbenamnya matahari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah Tuhan kalian dalam diri kalian dengan rendah hati} merendah dan tunduk {dan rasa takut} takut kepadaNya {dan tidak mengeraskan suara} dan tengah-tengah antara suara yang keras dan suara pelan {dalam perkataan pada pagi dan petang} permulaan dan akhir siang {dan janganlah kalian termasuk orang-orang yang lengah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "205 Dzikir kepada Allah bisa dengan hati, bisa dengan lisan, bisa dengan keduanya, dan dia adalah bentuk dzikir yang paling sempurna. Allah memerintahkan hambaNYa dan rasulNya Muhammad dan orang orang yang mengikutinya agar mengingat Allah pada dirinya, yakni dengan ikhlas dan dalam keadaan sendiri, ”dengan merendahkan diri”, dengan lisanmu, mengulang ulang macam macm dzikir, ”dan rasa takut” di dalam hatimu, dimana kamu takut kepada Allah, hatimu khawatir dan cemas terhadap amalmu yang mungkin tidak diterima. bukti rasa takut tersebut adalah kesungguhan dan keseriusan dalam menyempurnakan, memperbaiki dan mengikhlaskan amal. ”dan dengan tidak mengeraskan suara” yakni ambilah jalan tengah. janganlah kamu mengeraskan doamu dan jangan pula menyamarkannya, dan carilah jalan tengah di antara itu. ”di waktu pagi dan petang” Dua waktu ini memiliki keistimewaan dan keutamaan untuk berdzikir kepada Allah. ”dan janganlah kamu termasuk orang orang yang lalai” yaitu orang orang yang melupakan Allah lalu Allah menjadikan mereka melupakan diri mereka sendiri. Mereka itu adalah orang orang yang dharamkan untuk mendapatkan dunia dan akhirat. Mereka berpaling dari dzat dimana kebahagiaan dan keberuntungan di dapat dari mengingatNya dan beribadah kepadaNya dan justru menghadap kepada sesuatu di mana kerugian dan kesengsaraan adalah karena menyibukkan diri dengannya. Ini termasuk adab yang semestinya dijaga oleh seorang hamba dengan sebaik-baiknya dzikrullah di siang dan malam hari, khususnya di awal dan di akhir siang, dengan ikhlas khusyu’, merendahkan diri, menundukkan diri, tenang, hati dan lisannya saling mendukung dengan penuh adab, ketenangan dan berkonsentrasi kepada doa dan dzikir, serta hati yang fokus kepadanya, dan tidak lalai darinya, karena Allah tidak menerima doa dari hati yang kosong dan lali"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 205: Dzikr atau mengingat Allah bisa dengan hati dan dengan lisan, atau dengan kedua-duanya, dan inilah yang terbaik. Yakni secara secara ikhlas dan tersembunyi. Takut ika amalmu tidak diterima, yang tandanya adalah dengan berusaha menyempurnakan amal dan memperbakinya serta serius melakukannya. Yakni di atas sir (pelan) dan di bawah jahr (keras) atau pertengahan antara keduanya. Kedua waktu ini memiliki keistimewaan dan kelebihan untuk dzikrullah. Dari mengingat Allah Ta’ala, yaitu mereka yang melupakan Allah, sehingga Allah melupakan mereka dengan membiarkan mereka ketika mereka membutuhkan pertolongan-Nya. Mereka sesungguhnya telah berpaling dari kebahagiaan dan keberuntungan dan beralih kepada kebinasaan dan kerugian karena menyibukkan diri dengan selainnya. Ayat di atas menerangkan adab yang patut diperhatikan hamba, yaitu banyak berdzikr di malam dan siang hari, khususnya di pagi dan sore hari dengan ikhlas, khusyu’, rendah hati, rendah diri, tenang, hatinya memperhatikan apa yang diucapkan lisannya, menghadirkan hatinya dan tidak lalai, karena Allah tidak mengabulkan doa dari hati orang yang lalai lagi lengah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 205",
    "description": "Dan ingatlah tuhanmu dengan sungguh-sungguh hingga keagungan dan kebesaran-Nya hadir dalam hatimu ketika membaca dan mendengar Al-Qur'an atau berzikir, dengan rendah hati dan rasa takut. Kamu akan merasakan kehadiran, kedekatan dan rasa takut pada-Nya. Lakukan itu dengan tidak mengeraskan suara. Tidak perlu kamu bersuara keras atau terlalu lemah. Lakukanlah zikir itu pada waktu pagi dan petang, agar kamu memulai dan mengakhiri harimu dengan mengingat Allah. Dan janganlah kamu termasuk orang-orang yang lengah, tidak mengingat Allah di setiap saat. Jangan enggan berzikir mengingat Allah dan jangan pula enggan membaca serta mempelajari petunjuk-petunjuk Al-Qur'an, karena sesungguhnya mereka yang ada di sisi tuhanmu, yakni para malaikat dan juga hamba-hamba Allah, tidak sesaat pun merasa enggan untuk menyembah Allah dan mereka terus-menerus bertasbih menyucikan-Nya dari sifat-sifat yang tidak layak bagi-Nya, dan hanya kepada-Nya semata mereka bersujud, maka tirulah mereka. Ayat ini adalah salah satu ayat sajdah yang disunahkan kita bersujud setelah membacanya atau mendengarnya baik di dalam salat maupun di luar salat. Sujud ini dinamakan sujud tilawah."
  }
]