[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya malaikat-malaikat yang ada di sisi tuhanmu tidak sombong untuk beribadah kepada Allah. Bahkan mereka tunduk patuh terhadap perintah-perintahNya, dan bertasbih kepadaNya di malam dan siang hari, dan menyucikanNya dari segala hal yang tidak pantas bagiNya. Dan hanya kepadaNya yang tidak ada sekutu bagiNya, mereka itu bersujud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "206. Para Malaikat yang ada di sisi Rabbmu wahai Rasul tidak segan untuk beribadah kepada Allah -Subḥānahu-. Bahkan mereka senantiasa tunduk dan patuh kepada-Nya tanpa henti. Mereka terus menyucikan-Nya dari segala sesuatu yang tidak pantas bagi-Nya siang dan malam. Dan hanya kepada-Nya mereka bersujud."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "206. Kemudian Allah menyebutkan sesuatu yang dapat menguatkan dorongan untuk melakukan dzikir, yaitu dengan memuji para malaikat yang senantiasa berdzikir siang dan malam tanpa lelah. Para malaikat yang ada di sisi Allah itu tidak enggan menyembah-Nya, bahkan mereka menjalankan segala yang diperintahkan dengan penuh ketaatan dan ketundukan, menyucikan-Nya dari segala yang tidak layak bagi-Nya, dan mengesakan-Nya dengan penuh ketundukan, yang gambarkan dalam sujud bagi-Nya Semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "206. إِنَّ الَّذِينَ عِندَ رَبِّكَ (Sesungguhnya malaikat-malaikat yang ada di sisi Tuhanmu) Yang dimaksud adalah para malaikat. وَيُسَبِّحُونَهُۥ (dan mereka mentasbihkan-Nya) Yang mengagungkan dan mensucikan-Nya dari segala keburukan. وَلَهُۥ يَسْجُدُونَ (dan hanya kepada-Nya-lah mereka bersujud) Yakni mengistimewakan-Nya dengan ibadah sujud yang merupakan ibadah yang paling mulia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "206 Sesungguhnya malaikat-malaikat yang ada di sisi Tuhanmu tidaklah merasa sombong untuk menyembah Allah dan mereka mentasbihkan-Nya dari segala yang tidak sesuai dengan-Nya, dan hanya kepada-Nya-lah mereka bersujud dan beribadah, maka kalian akan menjadi seperti mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya yang ada di sisi Tuhanmu} sesungguhnya para malaikat yang dekat dengan Tuhanmu {tidak menyombongkan diri dari ibadah kepadaNya dan mereka menyucikanNya} menyucikanNya dari segala sesuatu yang tidak pantas padaNya {Hanya kepadaNya mereka bersujud}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "206 kemudian Allah menyebutkan bahwa Dia memiliki hamba hamba yang selalu beribadah kepadaNya dan melayaniNya yaitu para malaikat. ketahuilah bahwa Allah tidak ingin memperkaya diri dengan ibadahmu karena kemiskinan dan pula tidak memuliakan diri dari kehinaan. Akan tetapi Dia ingin memberimu manfaat dan agar kamu beruntung dengan keberuntungan yang melipat ganda atas apa yang kamu kerjakan. Dia berfirman ”sesungguhnya malaikat malaikat yang ada di sisi Rabbmu” para malaikat yang dekat dan para pengusung arasy yang setia ”tidaklah merasa enggan menyembah Allah“ bahkan mereka menundukan diri kepadaNya dan menaati segala perintah Rabb mereka. ”dan mereka mentasbihkanNya” di siang dan malam hari tiada henti. ”dan hanya kepadaNyalah” semata tanpa sekutu bagiNya ”mereka bersujud” maka hendaknya para hamba meneladani para malaikat yang mulia itu hendaknya mereka menyembah Maha Raja yang maha mengetahui secara terus menerus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 206: Dalam ayat ini, Allah menerangkan bahwa Dia memiliki hamba-hamba yang senantiasa beribadah dan taat kepada-Nya. Mereka itu adalah para malaikat, makhluk yang lebih perkasa dari kita, agar kita mengetahui bahwa Dia (Allah) ingin memberikan manfaat bagi kita, memberikan laba dan keuntungan yang berlipat ganda. Seperti malaikat yang didekatkan dengan Allah, malaikat pemikul ‘Arsy, dsb. Dari segala sifat yang tidak layak bagi-Nya di malam dan siang hari tidak bosan-bosannya. Oleh karena itu, jadilah kamu seperti mereka dengan banyak beribadah kepada-Nya dan banyak berdzikr. Ayat ini adalah salah satu ayat sajdah yang disunatkan kita bersujud setelah membacanya atau mendengarnya, baik di dalam shalat maupun di luar shalat. Sujud ini dinamakan sujud tilawah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 206",
    "description": "Jangan enggan berzikir mengingat Allah dan jangan pula enggan membaca serta mempelajari petunjuk-petunjuk Al-Qur'an, karena sesungguhnya mereka yang ada di sisi tuhanmu, yakni para malaikat dan juga hamba-hamba Allah, tidak sesaat pun merasa enggan untuk menyembah Allah dan mereka terus-menerus bertasbih menyucikan-Nya dari sifat-sifat yang tidak layak bagi-Nya, dan hanya kepada-Nya semata mereka bersujud, maka tirulah mereka. Ayat ini adalah salah satu ayat sajdah yang disunahkan kita bersujud setelah membacanya atau mendengarnya baik di dalam salat maupun di luar salat. Sujud ini dinamakan sujud tilawah. Ketika terjadi perang badar besar, antara kaum mukmin dan pasukan musyrik, kemenangan yang gemilang ada di pihak orang-orang mukmin. Harta rampasan pun cukup banyak melimpah, sehingga sempat mengundang perselisihan menyangkut persoalan pembagiannya. Mereka para sahabat menanyakan kepadamu, wahai nabi Muhammad, tentang bagaimana cara pembagian harta rampasan perang badar. Sebagai jawaban, katakanlah kepada mereka, harta rampasan perang itu adalah milik Allah dan rasul, sehingga rasul yang akan membagikannya menurut ketentuan Allah. Janganlah kalian berbeda pendapat menyangkut persoalan harta itu, cukuplah kalian menjadikan rasa takut dan taat pada Allah sebagai simbol kebanggaan kalian, maka bertakwalah kepada Allah. Hindari perselisihan yang akan terjadi akibat pembagian harta rampasan dan perbaikilah hubungan di antara sesamamu, serta jadikanlah rasa cinta kasih dan keadilan sebagai asas tali persaudaraan. Dan taatlah kepada Allah dalam segala perintah dan larangan-Nya dan demikian juga kepada rasul-Nya jika memang kamu adalah orangorang yang beriman yang telah mantap keimanan dalam hati."
  }
]