[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setan pun bersumpah dengan nama Allah di hadapan Adam dan hawaa bahwa dia merupakan pemberi nasihat terhadap mereka berdua dalam mengusulkan pendapat untuk makan buah dari pohon tersebut, padahal sebenarnya dia dusta dalam ucapannya itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Iblis bersumpah demi Allah untuk meyakinkan mereka berdua. Dia mengatakan, “Sesungguhnya aku benar-benar tulus dalam memberikan nasihat kepada kalian berdua.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Iblis menegaskan tipu dayanya dengan bersumpah atas nama Allah bahwa dia adalah memberi nasehat bagi mereka. Namun nasehat busuk itu akhirnya menipu Adam dan Hawa sehingga mereka memakan buah dari pohon terlarang tersebut. Setelah keduanya memakan buah itu, aurat mereka terbuka sehingga mereka merasa malu dan mulai menutupi aurat mereka dengan dedaunan dari pohon yang ada di dalam surga. Tuhan mereka kemudian menyeru dan mengolok mereka: \"Bukankah Aku telah memperingatkan kalian untuk tidak memakan buah dari pohon tersebut, dan Aku telah mengatakan bahwa setan adalah musuh yang nyata bagi kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَقَاسَمَهُمَآ إِنِّى لَكُمَا لَمِنَ النّٰصِحِينَ (Dan dia (syaitan) bersumpah kepada keduanya. “Sesungguhnya saya adalah termasuk orang yang memberi nasehat kepada kamu berdua”) Yakni bersumpah kepada mereka. Pendapat lain mengatakan bahwa keduanya bersumpah untuk menerima ajakan iblis sebagaimana iblis bersumpah bahwa ia hanya pemberi nasihat. Maka Adam dan Hawa mempercayainya, dan tidak terbesit dalam pikiran mereka bahwa ia adalah pembohong dan menyesatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dia bersumpah kepada keduanya: “Sesungguhnya aku menasehati kalian, dan lebih mengetahui tentang tempat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setan bersumpah kepada keduanya} Setan bersumpah dengan nama Allah kepada keduanya {“Sesungguhnya aku ini bagi kalian berdua benar-benar termasuk orang-orang yang memberi nasihat.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. tetapi bersama ucapannya (yang menyesatkan) itu dia bersumpah dengan Nama Allah di depan keduanya, ”sesungguhnya saya adalah termasuk orang yang memberi nasihat kepada kamu berdua” yakni termasuk dalam golongan para pemberi nasihat dimana aku telah berkata kepada kalian berdua apa yang aku katakan ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 21",
    "description": "Dan iblis tidak sekadar membisikkan atau merayu, tetapi juga berusaha meyakinkan adam. Dia, yakni setan, juga bersumpah kepada keduanya seraya berkata, sesungguhnya aku ini benar-benar termasuk para penasihatmu yang benar-benar tulus. Dia, setan, pun tak henti-hentinya membujuk mereka dengan berbagai macam tipu daya. Hal tersebut membuat adam dan istrinya lupa akan larangan Allah, sehingga mereka memakan buah pohon itu. Ketika mereka mencicipi dan belum memakan buah pohon itu secara sempurna, tampaklah oleh mereka auratnya masing-masing dan tampak pula bagi masing-masing aurat pasangannya. Hal ini membuat keduanya merasa malu, aurat yang senantiasa tertutup kini tersingkap. Maka mulailah mereka menutupinya, yakni menutupi auratnya, dengan daun-daun surga. Dan ketika itu juga tuhan menyeru mereka sambil mengecam perbuatan mereka, hai kedua hamba-ku! bukankah aku telah melarang kamu dari mendekati pohon itu dan aku telah mengatakan bahwa sesungguhnya setan adalah musuh yang nyata bagi kamu berdua' ayat ini menunjukkan bahwa tersingkapnya aurat seseorang merupakan perkara yang melawan tabiat manusia, karena sejak manusia diciptakan aurat adalah hal yang harus ditutupi."
  }
]