[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka setan berhasil menyeret dan memperdayai mereka berdua, sehingga keduanya memakan buah dari pohon yang Allah larang mereka berdua untuk mendekatinya. Usai memakannya, maka terbukalah aurat mereka dan lenyaplah penutup yang Allah pakaikan untuk menutupi mereka sebelum terjadi pelanggaran itu. Maka mereka pun mulai menempelkan dedaunan surga pada auarat mereka. Kemudian tuhan mereka menyeru mereka, ”bukankan Aku telah melarang kalian berdua dari pohon tersebut, dan telah Aku katakan kepada kalian, ”sesungguhnya setan itu bagi kalian berdua adalah musuh yang nyata permusuhannya?” Dalam ayat ini terkandung satu petunjuk bahwa terbukanya aurat termasuk perkara amat buruk, sebagimana dulu hingga sekarang di pandang menjijikan oleh fitrah manusia dan dianggap buruk oleh akal sehat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Lalu Iblis berhasil menjatuhkan mereka berdua dari kedudukan mereka semula melalui tipu daya dan rekayasa. Maka tatkala keduanya memakan (buah) dari pohon yang terlarang itu aurat mereka berdua terbuka dan terlihat jelas oleh keduanya. Lalu keduanya berusaha menutupi aurat mereka masing-masing dengan dedaunan Surga. Kemudian Allah berfirman kepada keduanya, “Bukankah Aku sudah melarang kalian berdua memakan (buah) dari pohon itu? Dan bukankah Aku sudah mengingatkan kalian berdua dengan mengatakan bahwa setan adalah musuh yang nyata bagi kalian berdua?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. فَدَلَّىٰهُمَا بِغُرُورٍ ۚ (maka syaitan membujuk keduanya (untuk memakan buah itu) dengan tipu daya) Makna kata (التدلية) yakni mengulurkan sesuatu dari atas ke bawah. Dan maksudnya adalah iblis menurunkan keduanya dari derajat yang tinggi –yaitu derajat ketaatan dan kemuliaan— dengan menipu keduanya melalui sumpah dustanya. فَلَمَّا ذَاقَا الشَّجَرَةَ بَدَتْ لَهُمَا سَوْءٰتُهُمَا (Tatkala keduanya telah merasai buah itu, nampaklah bagi keduanya aurat-auratnya) Katika keduanya memakan buah dari pohon itu, tersingkaplah aurat keduanya. وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ الْجَنَّةِ ۖ (dan mulailah keduanya menutupinya dengan daun-daun surga) Yakni langsung memetik dedaunan –terdapat pendapat mengatakan yakni daun pohon tin— kemudian menempelkannya pada aurat mereka untuk menutupinya dengan berlapis-lapis. وَنَادَىٰهُمَا رَبُّهُمَآ (Kemudian Tuhan mereka menyeru mereka) Yakni berfirman kepada keduanya. أَلَمْ أَنْهَكُمَا عَن تِلْكُمَا الشَّجَرَةِ (Bukankah Aku telah melarang kamu berdua dari pohon itu) Dan ini merupakan celaan dari Allah bagi mereka berdua karena telah melanggar perintah-Nya dengan memakan buah dari pohon terlarang itu dan karena keduanya tidak berhati-hati dari peringatan Allah tentang tipu daya setan yang telah Dia firmankan: “Sesungguhnya syaitan itu adalah musuh yang nyata bagi kamu berdua”. إِنَّ الشَّيْطٰنَ لَكُمَا عَدُوٌّ مُّبِينٌ (Sesungguhnya syaitan itu adalah musuh yang nyata bagi kamu berdua) Yakni terang-terangan menyatakan permusuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dia (setan) terus (berusaha) menipu dan menggoda mereka menggunakan sumpah, pemikat, dan tipuan untuk memakan buah dari pohon itu sampai bisa menempatkan mereka dalam kemaksiatan. Ketika mereka berdua memakan buah dari pohon itu, tersingkaplah aurat mereka, lalu mulai memotong dedaunan di surga untuk menutupi aurat mereka. Lalu Tuhan memanggil mereka untuk memarahi dan menegur mereka: “Bukankah aku telah melarang kalian untuk memakan buah dari pohon itu dan telah berkata kepada kalian bahwa setan adalah musuh yang nyata bagi kalian” At-Tadliyah dan Al-Idla’ adalah menurunkan sesuatu ke tempat paling rendah sedikit demi sedikit. Maknanya adalah menurunkan mereka berdua dari derajat ketaatan dan kemuliaan, yaitu merupakan derajat yang tinggi ke derajat yang rendah yaitu kemaksiatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setan menjerumuskan keduanya} memindahkan keduanya dari tempat mereka {dengan tipu daya} dengan tipu muslihat {Maka ketika keduanya telah mencicipi (buah) pohon itu, tampaklah} tampaklah {bagi keduanya aurat mereka} aurat mereka {dan keduanya mulai} mulai {menutupinya} melekatkan {kepada diri mereka daun-daun surga. Tuhan mereka menyeru mereka,“Bukankah Aku telah melarang kalian berdua dari pohon itu dan Aku telah mengatakan bahwa sesungguhnya setan bagi kalian adalah musuh yang nyata”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Keduanya tertipu dengan godaan iblis, nafsu dalam kondisi itu mengalahkan akal. ”maka setan membujuk keduanya (untuk memakan buah itu)\" yakni setan menurunkan keduanya dari derajat yang tinggi, yaitu bersihnya mereka dari dosa-dosa dan kemaksiatan kepada pengotoran diri dengan kotoran-kotorannya, maka keduanya pun memakan pohon itu. ”tatkala keduanya telah merasai buah pohon itu nampaklah bagi keduanya aurat-auratnya” yakni tampaklah aurat mereka setelah sebelumnya tertutup. Dalam kondisi ini ketelanjangan batin dari takwa mempengaruhi pakaian lahir, sehingga iapun terlepas, maka terbukalah auarat keduanya. tatkala aurat keduanya terlihat, keduanya malu dan mulai menutupinya dengan daun surge. ”kemudian Rabb mereka menyeru mereka” mencela dan menyalahkan mereka sementara mereka dalam kondisi seperti itu ”bukankah aku telah melarang kamu berdua dari pohon itu dan aku katakan padamu ‘sesungguhnya setan itu adalah musuh yang nyata bagi kamu berdua” mengapa kamu berdua melakukan yang dilarang dan menaati musuhmu?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 22: Ada pula yang mengartikan, “Lalu setan menurunkan kedudukan mereka berdua yang sebelumnya tinggi.” Sehingga yang sebelumnya Adam dan Hawa’ jauh dari dosa dan maksiat, ketika itu keduanya jatuh ke dalam dosa. Yakni qubul dan duburnya, disebut keduanya “sau’ah” karena ketika nampak memalukan orangnya. Oleh karena itu, ketika seseorang melepas taqwa, maka akan nampak memalukan di luarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 22",
    "description": "Dia, setan, pun tak henti-hentinya membujuk mereka dengan berbagai macam tipu daya. Hal tersebut membuat adam dan istrinya lupa akan larangan Allah, sehingga mereka memakan buah pohon itu. Ketika mereka mencicipi dan belum memakan buah pohon itu secara sempurna, tampaklah oleh mereka auratnya masing-masing dan tampak pula bagi masing-masing aurat pasangannya. Hal ini membuat keduanya merasa malu, aurat yang senantiasa tertutup kini tersingkap. Maka mulailah mereka menutupinya, yakni menutupi auratnya, dengan daun-daun surga. Dan ketika itu juga tuhan menyeru mereka sambil mengecam perbuatan mereka, hai kedua hamba-ku! bukankah aku telah melarang kamu dari mendekati pohon itu dan aku telah mengatakan bahwa sesungguhnya setan adalah musuh yang nyata bagi kamu berdua' ayat ini menunjukkan bahwa tersingkapnya aurat seseorang merupakan perkara yang melawan tabiat manusia, karena sejak manusia diciptakan aurat adalah hal yang harus ditutupi. Menjawab pertanyaan yang merupakan kecaman Allah ini, dengan penuh penyesalan keduanya, yakni adam dan pasangannya, berkata, ya tuhan kami, kami telah menzalimi diri kami sendiri akibat mengikuti perkataan iblis dan melanggar larangan-Mu, padahal engkau telah memperingatkan pada kami. Kami sangat menyesal dan memohon ampun kepada-Mu. Jika engkau tidak mengampuni kami, meng-hapus dosa yang telah kami lakukan, dan memberi rahmat kepada kami dengan memberikan keridaan, taufik, dan hidayah, niscaya kami termasuk orang-orang yang rugi."
  }
]