[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada Adam dan hawa dan anak keturunan mereka, ”disana kalian hidup”, maksudnya di muka bumi kalian akan menghabiskan masa-masa hidup kalian di dunia. ”dan disana pula kalian akan mati. dan dari sana (pula) tuhan kalian akan mengeluarkan kalian”, dan akan mengumpulkan kalian dalam keadaan hidup kembali pada hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Allah berfirman kepada Adam, Ḥawā`, dan anak cucunya, “Di bumi ini kalian akan menjalani hidup sampai batas waktu yang telah ditentukan oleh Allah bagi kalian. Dan di sanalah kalian akan mati dan dikuburkan. Kemudian kalian akan dikeluarkan dari dalam kubur kalian untuk dibangkitkan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. قَالَ فِيهَا تَحْيَوْنَ وَفِيهَا تَمُوتُونَ وَمِنْهَا تُخْرَجُونَ (Allah berfirman: “Di bumi itu kamu hidup dan di bumi itu kamu mati, dan dari bumi itu (pula) kamu akan dibangkitkan) Yakni di bumi kalian akan hidup, dan disana pula kematian akan mendatangi kalian, karena ia adalah negeri tempat kalian tinggal, serta dari sana kalian akan dibangkitkan menuju negeri akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Allah SWT berfirman: “Di bumi kalian akan hidup, mati dan dikubur. Dan dari sana kalian akan dikeluarkan dari kubur menuju akhirat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah berfirman, “Di sana kalian hidup} kalian hidup di bumi {dan di sana kalian mati, dan dari sana kalian akan dikeluarkan} dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24-25 Yakni manakala Allah menurunkan Adam dan istrinya dan menurunkan mereka ke bumi, Dia memberitakan kepada keduanya tentang keadaan kehidupan mereka disana, bahwa Dia menjadikan padanya kehidupan yang akan disusul dengan kematian yang akan diiringi dengan ujian dan cobaan, dan mereka senantiasa didalamnya. Dia mengutus Rasul-Rasul kepada mereka, menurunkan kitab-kitab kepada mereka, sampai kematian datang dan mereka dikubur didalamnya. Kemudian jika telah sempurna, maka Allah akan membangkitkan mereka dan mengeluarkan mereka darinya ke alam yang merupakan alam yang sebenarnya yaitu alam akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 25: Ketika Allah Ta’ala telah menurunkan Adam dan istrinya ke bumi, Allah memberitahukan keberadaan mereka di sana, Dia menjadikan hidup di sana diiringi dengan kematian, penuh dengan ujian dan cobaan, dan mereka akan senantiasa di sana, Dia akan mengutus kepada mereka para rasul-Nya dan akan menurukan kitab-kitab-Nya, barang siapa mengikutinya maka dia akan bahagia, tidak akan tersesat dan tidak akan celaka, sebaliknya barang siapa yang berpaling darinya, maka baginya penghidupan yang sempit.dan akan dihimpunkan pada hari dibangkitkan dalam keadaan buta (lihat Surah Thaha: 123-127)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 25",
    "description": "Allah berfirman, di sana, yakni di bumi, kamu, wahai adam dan ke-turunanmu, hidup, dan di sana pula kamu mati lalu dikuburkan, dan dari sana pula kamu akan dibangkitkan dari dalam kubur. Pada ayat-ayat yang lalu ditegaskan bahwa Allah menyuruh adam dan istrinya keluar dari surga dan bertempat tinggal di bumi, dan dijelaskan pula bahwa setan adalah musuhnya yang sangat berbahaya. Pada ayat-ayat berikut Allah memberikan peringatan dan tuntunan kepada anak keturunan adam akan hal-hal yang dapat memberi mereka manfaat di dunia, dan peringatan terhadap setan yang senantiasa berusaha menyesatkannya. Wahai anak cucu adam! ingatlah dan bersyukurlah pada kami dengan menaati perintah kami, karena sesungguhnya kami telah memberikan karunia kepadamu dengan menyediakan kemudahan untuk mendapatkan pakaian untuk menutupi auratmu dan untuk perhiasan bagimu. Tetapi pakaian takwa, yakni dengan menghambakan diri kepada Allah dengan penuh ketulusan dan kecintaan, itulah yang lebih baik, karena hal tersebut akan mendatangkan kebahagiaan, meraih kecintaan Allah, dan menyelamatkan kamu dari azab Allah. Demikianlah Allah menceritakan tentang adam dan istrinya. Hal tersebut merupakan sebagian tanda-tanda kekuasaan Allah, mudah-Mudahan dengan kisah tersebut mereka, yakni manusia, menjadi ingat dan dapat mengambil pelajaran, bahwa siapa pun yang menyalahi perintah Allah dan melanggar larangan-Nya akan mendapatkan murka Allah."
  }
]