[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai anak cucu adam, sungguh kami telah menjadikan pakaian bagi kalian yang menutupi aurat kalian. Yaitu pakaian pokok, dan pakaian untuk perhiasan dan kecantikan. Pakaian ini yang berfungsi sebagai kesempurnaan penampilan dan kesenangan. Sedang pakaian ketakwaan kepada Allah yaitu dengan cara mengerjakan perintah-perintah dan menjauhi larangan-larangan, itulah sebaik-baiak pakaian bagi seorang mukmin. Dan semua itu yang telah dikaruniakan Allah kepada kalian itu termasuk bukti-bukti rububiyah Allah , keesaan, limpahan karunia, dan rahmatNya kepada hamab-hambaNya. Harapannya, agar kalian selalu mengingat-ngingat nikmat-nikmat tersebut dan kemudian bersyukur kepada Allah atas nikmat-nikmat tersebut. Dan dalah hal ini, terkandung pemberian karunia dari Allah bagi para hambaNYa dengan kenikmatan-kenikmatan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Wahai anak-anak Adam! Kami telah menyediakan pakaian utama untuk menutupi aurat kalian. Dan Kami pun menyediakan pakaian pelengkap bagi kalian untuk mempercantik penampilan kalian di depan umum. Tetapi pakaian takwa yang tidak lain adalah menjalankan perintah Allah dan menjauhi larangan-Nya itu lebih baik dari pakaian fisik. Pakaian tersebut adalah bagian dari tanda-tanda kekuasaan Allah, agar kalian mengingat dan mensyukuri nikmat-nikmat yang diberikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Allah menyampaikan kepada seluruh manusia agar memperhatikan penutupan aurat, bertakwa kepada Allah dengan menjalankan ketaatan, dan memperingatkan mereka dari godaan-godaan setan yang selalu memerangi sifat-sifat mulia dan hukum-hukum Allah. Maka Allah menegaskan bahwa dia telah menurunkan pakaian untuk menutupi aurat dan pakaian untuk berhias, dan dua jenis pakaian ini baik untuk digunakan; akan tetapi pakaian maknawi bagi hati lebih utama dan lebih tinggi derajatnya -ya itu ketakwaan yang dapat memperbaiki hati dengan menjalankan ketaatan kepada Allah-; ia adalah pakaian terbaik bagi seorang mukmin, karena ia akan memperbaiki dan melindungi seluruh tubuh. Karunia yang besar dari Allah Yang Maha Mulia ini merupakan tanda keesaan-Nya, penjelasan tentang rahmat-Nya dan pengaturan-Nya atas urusan manusia. Hal ini agar mereka mengingat keagungan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. يٰبَنِىٓ ءَادَمَ قَدْ أَنزَلْنَا عَلَيْكُمْ لِبَاسًا يُوٰرِى سَوْءٰتِكُمْ (Hai anak Adam, sesungguhnya Kami telah menurunkan kepadamu pakaian untuk menutup auratmu) Yang terbuat dari bulu dan katun serta pakaian lainnya yang telah Allah ajarkan kepada kalian untuk membuatnya. Allah mengaruniakan pakaian-pakaian ini kepada bani Adam untuk menutupi aurat mereka yang telah disingkap oleh Iblis. وَرِيشًا ۖ (dan pakaian indah untuk perhiasan) Yang dimaksud dengan (الريش) yakni pakaian yang digunakan untuk berhias. Yakni pakaian-pakaian ini Allah ilhamkan kepada bani Adam untuk mereka jadikan sebagai penutup aurat dan perhiasan. وَلِبَاسُ التَّقْوَىٰ ذٰلِكَ خَيْرٌ ۚ (Dan pakaian ketakwaan itulah yang paling baik) Yakni pakaian keimanan, amal kebaikan, wara’, menjauhi kemaksiatan, dan takut kepada Allah. Ini merupakan sebaik-baik pakaian dan seindah-indah perhiasan. Pendapat lain mengatakan yang dimaksud adalah baju dan penutup kepala dari besi yang digunakan untuk berjihad di jalan Allah. ذٰلِكَ مِنْ ءَايٰتِ اللهِ(Yang demikian itu adalah sebahagian dari tanda-tanda kekuasaan Allah) Yakni pakaian-pakaian yang diturunkan Allah dan penjelasan tentang pakaian ketakwaan merupakan ayat-ayat yang datang dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Wahai bani Adam, Sungguh Kami telah menciptakan untuk kalian baju yang menutupi aurat kalian dan bulu burung untuk mempercantiknya. Ini adalah pakaian yang dihias. Dan pakaian ketakwaan secara maknawiyah, yaitu pakaian keimanan dan amal shalih itu sebaik-baik pakaian dan lebih utama daripada pakaian materi. Pakaian dan jenisnya itu (pakaian materi dan maknawi) termasuk ayat-ayat Allah yang menunjukkan kepada kuasa, anugerah dan rahmatNya, supaya mereka merenunginya, lalu mereka mensyukuri nikmat Allah dan beriman kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai anak cucu Adam, sungguh Kami telah menurunkan kepada kalian} Kami membuatkan kalian {pakaian untuk menutupi aurat kalian} menutupi aurat kalian {dan bulu} pakaian untuk berhias {dan pakaian takwa itulah yang paling baik. Yang demikian itu merupakan sebagian tanda-tanda Allah agar mereka selalu ingat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Kemudian Allah memberi nikmat kepada mereka dengan apa yang Dia sediakan untuk mereka berupa pakaian pokok dan pakaian lain yang tujuannya adalah keindahan. Begitu pula kebutuhan lainnya, seperti makanan, minuman, kendaraan, pernikahan, dan perkara-perkara lain yang disediakan Allah bagi manusia; baik yang bersifat pokok maupun yang bersifat pelengkap. Kemudian Dia mejelaskan kepada mereka bahwa semua itu bukanlah tujuan itu sendiri, akan tetapi Allah menyediakannya sebagai pendukung dan penopang untuk beribadah dan melakukan ketaatan kepadaNya. oleh karena itu Dia berfirman ”dan pakaian takwa itulah yang paling baik” daripada pakaian badan, karena pakaian takwa akan selalu bersama hamba, tidak usang dan tidak rusak. Ia adalah keindahan hati dan rohani. Adapun pakaian yang Nampak, maka ia hanyalah mentupi aurat yang Nampak pada suatu waktu atau ia menjadi keindahan bagi pemakainya. Dibalik itu tidak ada lagi kegunaan. Seandainya pakaian takwa tidak ada, maka aurat batinnya akan terlihat dan dia akan mendapat kehinaan dan aib. FirmanNYa ”yang demikian itu adalah sebagian dari tanda-tanda kekuasaan Allah mudah-mudahan mereka selalu ingat” yakni pakaian yang disebutkan itu termasuk yang mengingatkanmu tentang apa-apa yang berguna dan apa yang tidak berguna bagimu, dan kamu memakai pakaian lahir sebagai sarana untuk menopang batin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 26: Allah Subhaanahu wa Ta'aala memberi nikmat kepada manusia dengan memudahkan pakaian penting untuk mereka, serta pakaian yang dimaksudkan sebagai keindahan. Demikian pula memudahkan untuk mereka segala sesuatu seperti makanan, minuman, kendaraan, dsb. Allah memudahkan untuk mereka perkara dharuri (primer) dan pelengkapnya (sekunder), serta menerangkan bahwa hal itu bukanlah sebagai tujuan, akan tetapi Alah menurunkannya untuk membantu mereka menjalankan ibadah dan menaati-Nya, oleh karena itu Dia berfirman, “Tetapi pakaian takwa, itulah yang lebih baik.” Maksudnya ialah selalu bertakwa kepada Allah dan beramal saleh itulah yang lebih baik daripada pakaian hissiy (yang dirasakan di luar), karena pakaian takwa akan seantiasa bersama hamba, tidak akan usang dan binasa, serta akan menemaninya ke liang kubur, ia merupakan penghias hati dan ruh. Adapun pakaian luar, maka tujuannya adalah menutup aurat yang nampak dalam waktu tertentu atau penghias manusia, dan tidak ada manfaat lain di luar itu. Di samping itu, jika tidak ada pakaian luar, maka akan nampak aurat luarnya yang jika darurat tidaklah membahayakannya, berbeda jika idak ada pakaian batin, yaitu takwa, maka aurat batinnya terbuka dan ia akan memperoleh kehinaan dan kerugian. Apa yang disebutkan kepada mereka itu dapat mengingatkan sesuatu yang bermanfaat bagi mereka dan yang berbahaya, dan mereka dapat menyerupakan pakaian luar dengan pakaian batin serta memikirkan betapa pentingnya pakaian batin, yaitu takwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 26",
    "description": "Pada ayat-ayat yang lalu ditegaskan bahwa Allah menyuruh adam dan istrinya keluar dari surga dan bertempat tinggal di bumi, dan dijelaskan pula bahwa setan adalah musuhnya yang sangat berbahaya. Pada ayat-ayat berikut Allah memberikan peringatan dan tuntunan kepada anak keturunan adam akan hal-hal yang dapat memberi mereka manfaat di dunia, dan peringatan terhadap setan yang senantiasa berusaha menyesatkannya. Wahai anak cucu adam! ingatlah dan bersyukurlah pada kami dengan menaati perintah kami, karena sesungguhnya kami telah memberikan karunia kepadamu dengan menyediakan kemudahan untuk mendapatkan pakaian untuk menutupi auratmu dan untuk perhiasan bagimu. Tetapi pakaian takwa, yakni dengan menghambakan diri kepada Allah dengan penuh ketulusan dan kecintaan, itulah yang lebih baik, karena hal tersebut akan mendatangkan kebahagiaan, meraih kecintaan Allah, dan menyelamatkan kamu dari azab Allah. Demikianlah Allah menceritakan tentang adam dan istrinya. Hal tersebut merupakan sebagian tanda-tanda kekuasaan Allah, mudah-Mudahan dengan kisah tersebut mereka, yakni manusia, menjadi ingat dan dapat mengambil pelajaran, bahwa siapa pun yang menyalahi perintah Allah dan melanggar larangan-Nya akan mendapatkan murka Allah. Wahai anak cucu adam! janganlah sampai kamu tertipu oleh setan dengan mengikuti bujuk rayunya, karena hal itu akan berakibat buruk sebagaimana halnya dia telah mengeluarkan ibu bapakmu, yakni adam dan istrinya, dari surga, dengan menanggalkan pakaian keduanya untuk memperlihatkan aurat keduanya. Sesungguhnya dia dan pengikutnya dapat melihat kamu dari suatu tempat yang kamu tidak bisa melihat mereka sehingga dia dan pengikutnya dapat mendatangimu dan menggodamu dari arah yang tidak kamu ketahui. Sesungguhnya kami telah menjadikan setan-setan itu pemimpin bagi orang-orang yang tidak beriman."
  }
]