[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”tuhanku memerintahkan berbuat adil, dan memerintahkan kalian mengikhlaskan ibadah kepadaNya dalam tiap-tiap tempat peribadahan, terutama di dalam masjid-masjid. Dan agar kalian menyeruNya dengan penuh ikhlas dalam ketaatan dan ibadah kepadaNya. Dan supaya kalian beriman kepada hari kebangkitan setelah kematian, dan sebagaimana Allah dahulu telah menciptakan kalian dari ketiadaan, Sesungguhnya Dia maha kuasa untuk mengembalikan kehidupan kepada kalian sekali lagi. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Katakanlah -wahai Muhammad- kepada orang-orang musyrik itu, “Sesungguhnya Allah menyuruh berbuat adil, dan tidak pernah menyuruh berbuat keji dan mungkar. Dan Dia menyuruh kalian beribadah kepada-Nya secara umum dengan tulus dan beribadah kepada-Nya secara khusus di dalam masjid. Dia juga menyuruh kalian memanjatkan doa hanya kepada-Nya, seraya memurnikan ketaatan kepada-Nya. Sebagaimana Dia telah menciptakan kalian yang sebelumnya belum ada, Dia juga akan membuat kalian hidup kembali (sesudah mati). Karena yang mampu menciptakan kalian dari awal pasti mampu mengembalikan dan membangkitkan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. قُلْ أَمَرَ رَبِّى بِالْقِسْطِ ۖ (Katakanlah: “Tuhanku menyuruh menjalankan keadilan”) Yakni inilah perintah-perintah Allah, maka dimana perintah-Nya kepada kalian untuk bertelanjang dan berbuat keji? Makna (القسط) yakni adil. Makna dari ayat ini adalah bahwa Allah memerintahkan untuk berbuat adil, tidak seperti yang mereka klaim bahwa Allah memerintahkan mereka untuk berbuat keji. وَأَقِيمُوا۟ وُجُوهَكُمْ عِندَ كُلِّ مَسْجِدٍ (Dan (katakanlah): “Luruskanlah muka (diri)mu di setiap sembahyang) Yakni dirikanlah sholat untuk-Nya dengan menghadap kepada-Nya dalam sholat kalian di masjid manapun. وَادْعُوهُ مُخْلِصِينَ لَهُ الدِّينَ ۚ (dan sembahlah Allah dengan mengikhlaskan ketaatanmu kepada-Nya) Yakni sembahlah Dia dengan penuh keikhlasan dalam berdoa atau beribadah hanya kepada-Nya dan janganlah menyembah selain-Nya. كَمَا بَدَأَكُمْ تَعُودُونَ (Sebagaimana Dia telah menciptakan kamu pada permulaan (demikian pulalah kamu akan kembali kepada-Nya)”) Sebagaimana Allah menciptakan kalian pertama kali maka demikian pula Allah akan mengembalikan kalian. Pendapat lain mengatakan: sebagaimana keadaan kalian ketika dikeluarkan dari perut ibu kalian maka seperti itulah keadaan kalian ketika dikembalikan kepada-Nya, tanpa membawa apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Katakanlah wahai Nabi: “Tuhanku memerintahkan untuk berbuat adil dan istiqamah, bukan kekejian sebagaimana yang mereka asumsikan. Dan menghadaplah hanya kepada Allah dalam shalat kalian dengan menghadap kiblat, dan sembahlah Dia dengan mengikhlaskan doa, ibadah dan ketaatan kalian kepadaNya, sebagaimana Dia menciptakan kalian pertama kalinya dari ketiadaan, lalu menghidupkan kalian lagi pada hari kiamat, lalu membalas kalian atas perbuatan kalian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Tuhanku memerintahkan aku berlaku adil} adil {Hadapkanlah wajah kalian} menghadaplah kepada Allah di setiap shalat kalian {di setiap masjid dan berdoalah kepadaNya dengan mengikhlaskan ketaatan} ibadah {kepadaNya. sebagaimana Dia telah menciptakan kalian pada permulaan, kalian akan kembali”} sebagaimana Dia menciptakan kalian saat pertama kalian, Dia akan membuat kalian hidup lagi setelah mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. kemudian Allah menyebutkan apa yang diperintahkanNya “katakanlah Rabbku menyuruh menjalankan keadilan” adil dalam ibadah dan muamalat bukan dengan kezhaliman dan kesewenang-wenangan. “dan (katakanlah) ‘luruskanlah muka (dirimu) disetiap shalat” yakni menghadaplah kepada Allah, bersungguh-sungguhlah dalam menyempurnakan ibadah, khususnya shalat. Tegakkanlah ia lahir dan batin bersihkan ia dari segala yang mengurangi dan merusaknya. “dan berdoalah (sembahlah) Allah dengan mengikhlaskan ketatanmu kepadaNya” yakni bertujuan dengan itu wajahNya semata, tidak ada sekutu bagiNya. Doa disini mencakup doa permohonan dan doa ibadah, yakni janganlah kamu mencari tujuan dan sasaran dalam doamu selain pengahambaan kepada Allah dan ridhaNya. ”sebagaimana Dia telah menciptakan kamu” pada permulaan ”demikian pula lah kamu akan kembali kepadaNya” dengan di bangkitkan, yang mampu menciptakanmu pertama kali pasti mampu mengembalikannya, bahkan lebih mudah daripada menciptakan pertama kali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 29: Baik dalam ibadah maupun mu’amalah. Maksudnya menghadaplah kepada Allah (pusatkanlah perhatianmu semata-mata kepada Allah) dan berusahalah menyempurnakan ibadah, khususnya shalat, tumpahkanlah perhatianmu kepadanya zhahir maupun batin, dan bersihkanlah ibadah itu dari sesuatu yang mengurangi pahalanya dan yang membatalkannya. Yakni carilah keridhaan-Nya saja. Tuhan yang mampu menciptakan kamu pada mulanya, mampu pula mengembalikan kamu, bahkan mengembalikan seperti semula setelah mati lebih muda daripada memulai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 29",
    "description": "Wahai nabi Muhammad, berilah penjelasan kepada orang-orang yang berlaku dusta tersebut. Katakanlah pada mereka, tuhanku menyuruhku agar kalian dan semua manusia berlaku adil, tidak berlebihan dalam beribadah dan dalam bermuamalah. Maka lakukanlah hal tersebut dalam semua peribadatan kalian. Hadapkanlah wajahmu, yakni arahkanlah seluruh perhatianmu, kepada Allah pada setiap salat. Tunaikanlah salat dengan sebaik-baiknya, sucikanlah lahir dan batinmu, dan bersihkanlah dari segala bentuk kekejian. Dan sembahlah dia dengan mengikhlaskan ibadah semata-mata hanya kepada-Nya, mengharap rahmat-Nya, dan takut dari azab-Nya. Ingatlah, setelah kematian, kamu semua akan dibangkitkan dan dikembalikan kepada-Nya sebagaimana kamu diciptakan semula, sehingga Allah akan membalas segala apa yang kamu perbuat dengan balasan yang setimpal. Ketika dibangkitkan, manusia akan menemui Allah dalam dua kelompok besar. Sebagian kelompok manusia meru-pakan golongan yang telah diberi-Nya petunjuk di dunia, yaitu dengan beribadah kepada Allah dengan penuh ikhlas, inilah yang mengantarkan mereka menuju kebahagiaan, dan sebagian kelompok lagi, merupakan kelompok yang telah pasti dan sepantasnya menjadi sesat karena memilih sendiri jalan kesesatan itu dan enggan memanfaatkan petunjuk. Sebab kesesatan ketika dibangkitkan, manusia akan menemui Allah dalam dua kelompok besar. Sebagian kelompok manusia meru-pakan golongan yang telah diberi-Nya petunjuk di dunia, yaitu dengan beribadah kepada Allah dengan penuh ikhlas, inilah yang mengantarkan mereka menuju kebahagiaan, dan sebagian kelompok lagi, merupakan kelompok yang telah pasti dan sepantasnya menjadi sesat karena memilih sendiri jalan kesesatan itu dan enggan memanfaatkan petunjuk. Sebab kesesatan"
  }
]