[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ikutilah oleh kalian (wahai sekalian manusia). apa yang diturunkan kepada kalian dari tuhan kalian yang berupa kitabullah dan Sunnah dengan menjalankan perintah-perintah dan menjauhi larangan-laranganNya. dan janaganlah kalian mengikuti pemimpin-pemimpin selain Allah, seperti setan-setan, pendeta-pendeta., dan rahib-rahib. Sesungguhnya sedikit sekali dari kalian yang mau memahami nasihat dan mengambil pelajaran sehingga mau kembali menuju kepada yang haq."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Ikutilah -wahai manusia- kitab suci yang Rabbmu turunkan kepada kalian dan sunah nabi kalian. Dan janganlah kalian mengikuti hawa nafsu orang-orang yang kalian lihat menjadi teman-teman setan atau pendeta-pendeta yang jahat. Janganlah kalian berteman dekat dengan mereka seraya meninggalkan kitab suci yang diturunkan kepada kalian demi mengikuti kemauan hawa nafsu mereka. Sesungguhnya kalian jarang sekali mengambil pelajaran. Sebab, sekiranya kalian mau mengambil pelajaran tentu kalian akan lebih memilih kebenaran daripada yang lain. Dan tentu kalian pun akan mengikuti dan mengamalkan agama yang dibawa oleh rasul kalian dan meninggalkan agama lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah memerintahkan seluruh manusia untuk mengikuti al-Qur’an yang telah diwahyukan kepada Nabi Muhammad dan sunnahnya, dan melarang mereka dari mengikuti selainnya. Kemudian Allah memberi dorongan untuk menjalankan hukum-hukumnya, meskipun Kami mengetahui sedikit sekali manusia yang mau mengambil pelajaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. اتَّبِعُوا۟ مَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُمْ (Ikutilah apa yang diturunkan kepadamu dari Tuhanmu) Yakni al-qur’an dan sunnah karena ia sebagai penjelas dan penafsir isi al-qur’an. Allah berfirman: وما آتاكم الرسول فخذوه وما نهاكم فانتهوا “Dan apa saja yang diberikan oleh Rasul kepada kalian, maka terimalah. Dan apa saja yang dilarang oleh dia, maka jauhilah.” وَلَا تَتَّبِعُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ ۗ (dan janganlah kamu mengikuti pemimpin-pemimpin selain-Nya) Yang kalian sembah dan kalian jadikan sebagai sekutu-sekutu Allah,atau janganlah kalian jadikan selain kitab Allah sebagai panutan yang kalian ikuti dalam menjalani agama kalian seperti yang dilakukan orang-orang jahiliyah yang menjadikan pemimpin mereka sebagai panutan dalam pengharaman dan penghalalan sesuatu. قَلِيلًا مَّا تَذَكَّرُونَ(Amat sedikitlah kamu mengambil pelajaran) Yakni sesungguhnya manusia sedikit sekali mengingat urusan keimanan serta melupakan dan tidak memahaminya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Wahai manusia, ikutilah sesuatu yang diturunkan kepada kalian dari Tuhan di dalam Al-Qur’an dan sunah nabi yang menerangkan dan menafsirkan Al-Qur’an. Dan janganlah kalian mengikuti para penolong dari selain kitab Allah seperti diri kalian sendiri dan setan yang mana kalian meniru mereka dalam urusan agama, namun kalian hanya mengingat sedikit tentang perkara iman dan melupakan perkara yang diwajibkan Tuhan atas kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ikutilah apa yang diturunkan kepada kalian dari Tuhan kalian dan janganlah mengikuti pelindung selain Dia} dan janganlah menjadikan selain Allah sebagai pelindung yang kalian taati dalam berbuat maksiat {Sedikit sekali kalian mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. kemudian Allah berbicara kepada hamba-hambanNya dan mengarahkan pandangan mereka kepada kitab ini. Dia berfirman” ikutilah apa yang diturunkan kepadamu dari Rabbmu” yakni kitab yang memang diturunkan demi kamu dan ia “dari Rabbmu” yang ingin menyempurnakan pendidikanNya kepadamu. maka Dia menurunkan kepadamu kitab ini yang nikmatNya atasmu menjadi lengkap dan kamu dibimbing kepada amal dan akhlak terbaik dan termulia. ”dan janganlah kamu mengikuti pemimpin-pemimpin selianNya” yakni kamu menjadikan mereka sebagai pemimpin mengikuti hawa nafsu mereka dan karenanya kamu meninggalkan kebenaran. ”amat sedikitlah kamu mengambil pelajaran (dari padanya)” sekiranya kamu mengambil pelajaran dan mengetahui maslahatnya niscaya kamu tidak akan mengutamakan yang membahayakan daripada yang bermanfaat, dan mengutamakan musuh daripada teman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 3: Khitab (pembicaraan) ini ditujukan kepada semua manusia, sedangkan khitab pada ayat sebelumnya ditujukan kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Yang ingin mentarbiyah (mendidik) kamu secara sempurna. Maksudnya pemimpin-pemimpin yang membawamu kepada kesesatan. Karena kalau kamu mau mengambil pelajaran, tentu kamu tidak akan mengutamakan kerugian di atas keberuntungan, atau mengutamakan bahaya di atas manfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 3",
    "description": "Ikutilah, wahai kaum muslim, apa yang diturunkan kepadamu dari tuhanmu dalam hal apa saja. Yakinilah bahwa semuanya akan membawa kebaikan, karena tuhanmu adalah zat yang maha penyayang kepada makhluk-Nya. Janganlah kamu ikuti siapa pun selain dia sebagai pemimpin lalu kamu pasrahkan semua urusanmu kepada mereka dan kamu taati saja seruan mereka, padahal mereka akan mengajakmu kepada jalan kesesatan. Sedikit sekali kamu mengambil pelajaran sehingga kamu tidak kembali ke jalan yang benar. Ayat ini melarang seorang mengikuti ajakan orang lain dalam urusan agama yang tidak datang dari Allah. Betapa banyak negeri yang telah kami binasakan, seperti negeri kaum nabi-nabi terdahulu, siksaan kami datang menimpa penduduk-Nya pada malam hari ketika mereka tengah terlelap dalam tidur seperti yang terjadi pada kaum nabi lut yang melakukan homoseks. Negeri mereka dijungkirbalikkan dan dihujani dengan batu. Atau siksaan itu datang pada saat mereka beristirahat pada siang hari seperti yang terjadi pada kaum nabi syuaib yang sering melakukan kecurangan dalam takaran dan timbangan. Mereka disiksa dengan suara yang menggelegar. Azab Allah bisa datang kapan saja, secara tak terduga, bahkan ketika waktu istirahat sekalipun."
  }
]