[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menjadikan para hambaNya terbagi dua golongan : satu golongan yang di karunia taufik oleh Allah untuk memperoleh petunjuk menuju jalan yang lurus, dan satu golongan(lain) yang telah ditulis pasti pada mereka kesesatan dari jalan yang lurus; karena sesungguhnya mereka itu telah menjadikan setan-setan sebagai teman setia dan penolong selain Allah, lalu mereka mentaatinya lantaran kebodohan mereka, serta prasangka mereka kalau mereka tengah berjalan di atas jalan hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Dan Allah telah membagi manusia menjadi dua golongan. Ada golongan yang diberi-Nya petunjuk, diberi-Nya kemudahan untuk mendapatkan petunjuk, dan dijauhkan dari hal-hal yang menjadi penghalangnya. Dan ada golongan lain yang dipastikan tersesat dari jalan yang benar. Hal itu disebabkan karena mereka menjadikan setan-setan sebagai pelindung selain Allah. Mereka tunduk kepada setan-setan lantaran kebodohan mereka dan mereka mengira bahwa mereka berada di jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Ketika Allah membangkitkan kalian, Dia akan menjadikan kalian dua golongan yang berbeda; satu golongan mendapat kenikmatan hidayah menuju Islam, dan satu golongan lain terjerumus di dalam hawa nafsu sehingga layak mendapat kesesatan, karena mereka menjadikan setan-setan dari golongan jin dan manusia sebagai penolong selain Allah, sehingga mereka tertipu dengan mereka, mentaati mereka, dan merasa berada di atas jalan yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. فَرِيقًا هَدَىٰ (Sebahagian diberi-Nya petunjuk) Yakni kalian dikembalikan dalam dua golongan, golongan yang akan bahagia dan golongan yang akan sengsara. حَقَّ عَلَيْهِمُ الضَّلٰلَةُ ۗ (telah pasti kesesatan bagi mereka) Golongan yang layak untuk mendapat kesesatan adalah orang-orang kafir. إِنَّهُمُ اتَّخَذُوا۟ الشَّيٰطِينَ أَوْلِيَآءَ مِن دُونِ اللهِ (Sesungguhnya mereka menjadikan syaitan-syaitan pelindung (mereka) selain Allah) Yakni hal itu disebabkan karena mereka mentaati setan-setan untuk bermaksiat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Kalian akan kembali dalam 2 kelompok pada hari kiamat, yaitu kelompok yang bahagia yang dibimbing Allah untuk beriman dan beribadah. Yaitu orang-orang yang masuk Islam, dan kelompok yang bersedih, mereka tersesat karena buruknya pilihan mereka, mereka adalah orang-orang kafir. Sesungguhnya orang-orang kafir itu menjadikan setan sebagai penolong dan penyelamat selain Allah, sehingga setan-setan itu menempatkan mereka pada kemaksiatan dan mengubah sesuatu yang didakwahkan kepada mereka, sehingga mereka beranggapan bahwa mereka itu diberi petunjuk kepada kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sekelompok telah diberi petunjuk dan sekelompok telah pasti} pasti {kesesatan atas mereka. Sesungguhnya mereka menjadikan setan-setan sebagai pelindung selain Allah. Mereka mengira} berprasangka {bahwa mereka adalah orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. ”sebagian“ dari mereka ”diberiNya petunjuk” oleh Allah. yakni Allah memberinya taufik kepada hidayah. memudahkan sebab-sebabnya bagi mereka, dan menepis penghalang-penghalangnya. ”dan sebagian lagi telah pasti kesesatan bagi mereka” yakni mereka pasti akan sesat karena mereka sendiri yang melakukan sebab-sebabnya untuk diri mereka, karena mereka, menjadikan setan-setan pelindung (mereka) selain Allah. ”barangsiapa menjadikan setan sebagai pelindung selain Allah, maka dia telah merugi dengan kerugian yang nyata.\" manakala mereka berlepas diri dari perlindungan Allah dan masuk kedalam perlindungan setan, maka mereka mendapatkan bagian kekalahan yang melimpah dan dijadikan bersandar kepada diri mereka, sehingga merugilah mereka dengan kerugian yang besar, padahal mereka mengira, ”bahwa mereka mendapat petunjuk” karena hakikat perkaranya telah terbalik bagi mereka. Mereka mengira bahwa yang batil adalah benar dan yang benar adalah batil. Ayat-ayat ini mengandung dalil bahwa perintah dan laranan berinduk kepada hikmah dan kemaslahatan, dimana Allah menyatakan bahwa Dia tidak mungkin memerintahkan sesuatu yang keji dan diingkari oleh akal, dan bahwa Dia tidak memerintahkan kecuali yang adil penuh keikhlasan. Dalam ayat ini terdapat dalil bahwa hidayah akan didapatkan dengan karunia dan nikmat Allah, sementara kesesatan adalah jika Allah menelantarkan hamba, karena dengan kebodohan dan kezhalimannya dia menjadikan setan sebagai pelindung , dan dia menyebabkan kesesatan untuk dirinya sendiri, dan bahwa barangsiapa menduga dirinya diatas petunjuk padahal sebenarnya dia sesat, maka tidak ada udzur baginya (yakni udzurnya) tidak akan diterima karena dia tetap berpetualang mendapatkan petunjuk akan tetapi dugaannya itu datang kepadanya hanyalah dari kezhalimannya dengan berpaling dari jalan yang mengantarkan kepada petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 30: Ketika mereka melepaskan diri dari perwalian Allah dan lebih menyukai berteman dengan setan, maka mereka akan dibiarkan tersesat, masalah akan diserahkan kepada mereka sendiri untuk menyelesaikannya sehingga mereka memperoleh kerugian, namun anehnya mereka menyangka bahwa mereka memperoleh petunjuk. Hal itu, karena hakikat menjadi berubah bagi mereka, mereka menyangka kebatilan sebagai kebenaran dan kebenaran sebagai kebatilan. Beberapa ayat di atas menunjukkan, bahwa: - Perintah dan larangan mengikuti hikmah dan maslahat, karena di sana disebutkan bahwa tidak mungkin Allah menyuruh perbuatan yang dianggap keji dan munkar oleh akal. - Allah tidaklah memerintahkan selain keadilan dan ikhlas. - Hidayah merupakan karunia Allah - Kesesatan merupakan akibat dibiarkan oleh Allah saat ia mengutamakan setan dan mengikutinya, karena ia telah memberikan kesempatan bagi setan untuk dirinya. - Orang yang mengira memperoleh petunjuk padahal sebenarnya sesat tidaklah mendapat uzur, karena sesungguhnya ia mampu meraihnya, namun malah ditinggakan dan tidak mau menempuh jalan yang mengarah kepada petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 30",
    "description": "Ketika dibangkitkan, manusia akan menemui Allah dalam dua kelompok besar. Sebagian kelompok manusia meru-pakan golongan yang telah diberi-Nya petunjuk di dunia, yaitu dengan beribadah kepada Allah dengan penuh ikhlas, inilah yang mengantarkan mereka menuju kebahagiaan, dan sebagian kelompok lagi, merupakan kelompok yang telah pasti dan sepantasnya menjadi sesat karena memilih sendiri jalan kesesatan itu dan enggan memanfaatkan petunjuk. Sebab kesesatan ketika dibangkitkan, manusia akan menemui Allah dalam dua kelompok besar. Sebagian kelompok manusia meru-pakan golongan yang telah diberi-Nya petunjuk di dunia, yaitu dengan beribadah kepada Allah dengan penuh ikhlas, inilah yang mengantarkan mereka menuju kebahagiaan, dan sebagian kelompok lagi, merupakan kelompok yang telah pasti dan sepantasnya menjadi sesat karena memilih sendiri jalan kesesatan itu dan enggan memanfaatkan petunjuk. Sebab kesesatan pada ayat yang lalu Allah memerintahkan agar manusia berlaku adil dalam semua urusan, maka pada ayat ini Allah memerintahkan agar memakai pakaian yang baik dalam beribadah, baik ketika salat, tawaf, dan ibadah lainnya. Allah juga memerintahkan manusia untuk makan dan minum secukupnya tanpa berlebih-lebihan. Wahai anak cucu adam! pakailah pakaianmu yang bagus yaitu pakaian yang dapat menutupi aurat kalian atau bahkan yang lebih dari itu ketika kalian beribadah, sehingga kalian bisa melakukan salat dan tawaf dengan nyaman, dan lakukanlah itu pada setiap memasuki dan berada di dalam masjid atau tempat lainnya di muka bumi ini. Dalam rangka beribadah, kami telah menyediakan makanan dan minuman, maka makan dan minumlah apa saja yang kamu sukai dari makanan dan minuman yang halal, baik dan bergizi, tetapi jangan berlebihan dalam segala hal, baik dalam beribadah dengan menambah cara atau kadarnya, ataupun dalam makan dan minum. Karena sungguh, Allah tidak menyukai, yakni tidak melimpahkan rahmat dan ganjaran-Nya kepada orang yang berlebih-lebihan dalam hal apa pun."
  }
]