[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai anak cucu Adam, pastikan diri kalian ketika akan melaksanakan shalat berada dalam kondisi berhias sesuai yang disyariatkan dengan mengenakan pakaian yang menutup aurat, memperhatikan kebersihan dan kesucian dan lain sebagainya. Makan dan minumlah dari barang yang baik-baik yang di karuniakan Allah kepada kalian, dan janganlah kalian melampaui batas kewajaran dalam hal itu. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas dan berlebihan dalam makanan dan minuman dan hal lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Wahai anak-anak Adam! Kenakanlah pakaian yang menutupi aurat dan mempercantik penampilan kalian, yaitu pakaian yang bersih dan suci, ketika kalian menunaikan salat dan melaksanakan tawaf. Makanlah dan minumlah apa saja yang baik yang dihalalkan oleh Allah, tetapi jangan berlebih-lebihan dan jangan melampaui batasan yang wajar dalam hal itu. Dan jangan beralih dari yang halal menuju yang haram. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas-batas yang wajar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Allah menyuruh manusia dengan seruan yang lembut dengan menisbahkan mereka kepada ayah mereka: \"Hai para keturunan Adam, berpakaian dan berhiaslah dengan penampilan yang baik untuk menutupi aurat setiap kali menjalankan shalat. Dan makan dan minumlah dari makanan dan minuman yang baik tanpa berlebih-lebihan; karena sesungguhnya Allah tidak menyukai orang yang berlebih-lebihan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. يٰبَنِىٓ ءَادَمَ خُذُوا۟ زِينَتَكُمْ عِندَ كُلِّ مَسْجِدٍ (Hai anak Adam, pakailah pakaianmu yang indah di setiap (memasuki) mesjid) Allah memerintahkan hamba-hamba-Nya untuk berhias dan menutup aurat ketika mendatangi masjid untuk mendirikan sholat atau mengerjakan Thawaf. وَكُلُوا۟ وَاشْرَبُوا۟ وَلَا تُسْرِفُوٓا۟ ۚ( makan dan minumlah, dan janganlah berlebih-lebihan) Allah melarang mereka berlebih-lebihan dan memerintahkan mereka untuk memakan makanan yang baik-baik, dan hal ini bertentangan dengan apa yang dilakukan oleh orang-orang yang mengaku sebagai orang yang zuhud, karena tidak ada kezuhudan dengan meninggalkan makan dan minum; dan orang yang meninggalkannya sama sekali maka ia telah bunuh diri dan menjadi ahli neraka, adapun orang yang hanya membatasi dirinya dengan sedikit makan dan minum sehingga melemahkan badannya dan menjadikannya tidak mampu untuk menjalankan kewajibannya melakukan ketaatan atau bekerja untuk dirinya dan keluarganya maka ia telah melanggar apa yang Allah perintahkan dan anjurkan. Adapun orang yang berlebih-lebihan dalam membelanjakan hartanya sampai batas perbuatan orang-orang yang lemah akal dan mubadzir maka ia juga termasuk orang yang menyelisihi apa yang telah Allah syariatkan kepada hamba-hamba-Nya dan telah terjerumus kedalam perbuatan yang dilarang dalam al-qur’an."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnul Qoyyim berkata : Agama ini sepenuhnya adalah adab, oleh karena itu ulama-ulama terdahulu menganjurkan setiap lelaki untuk memberindah dirinya sebelum keluar untuk melaksanakan shalat, aku mendengar Syaikhul Islam Ibnu Taimiyah mengatakan : Allah memerintahkan hamba-hamba Nya di atas menutup aurat dalam shalat, yaitu : menggunakan perhiasan, Allah berfirman : { يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ } \"Hai anak Adam, pakailah pakaianmu yang indah di setiap (memasuki) masjid\" Perintah shalat dikaitkan dengan perintah berhias, dan bukan kepada perintah menutup aurat, sebagai pembolehan bahwa semestinya setiap hamba ketika akan melaksanakan shalat memakai pakaiannya yang terbaik. 2 ). Suatu ketika seorang Nashrani (yang juga seorang tabib pribadi Khalifah Harun al-Rasyid) berkata kepada salah seorang ulama : \"dalam kitab kalian tidak sedikitpun dituliskan ilmu tentang kedokteran\", kemudian sang 'alim berkata : \"sesungguhnya Allah telah mengumpulkan ilmu kedokteran dalam satu ayat dari kitab kami\", sang nashrani kemudian bertutur kembali : \"lalu apakah itu ?\" , sang 'Alim kemudian membacakan firman Allah : { وَكُلُوا وَاشْرَبُوا وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ } \"makan dan minumlah, dan janganlah berlebih-lebihan. Sesungguhnya Allah tidak menyukai orang-orang yang berlebih-lebihan\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai anak Adam, berhiaslah dan tutupilah aurat di setiap shalat dan thawaf. Kalian diperbolehkan untuk makan dan minum tanpa berlaku boros, yaitu melampaui batas dalam melakukan setiap sesuatu. Sesungguhnya Allah membenci orang-orang yang berlebihan, meridhai orang yang menghalalkan sesuatu yang halal dan mengharamkan sesuatu yang haram."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai anak cucu Adam, pakailah pakaian kalian yang indah} pakailah pakaian yang menutupi aurat kalian secara indah {pada setiap masjid} shalat dan thawaf {makan dan minumlah, tetapi janganlah berlebihan. Sesungguhnya Dia tidak menyukai orang-orang yang berlebihan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Setelah Allah menurunkan kepada bani Adam pakaian untuk menutupi auratnya dan pakaian indah untuk perhiasaan Allah berfirman ”hai anak Adam, pakailah pakaianmu yang indah di setiap (memasuki) masjid” yakni tutuplah auratmu ketika shalat, baik yang wajib atau yang sunnah karena menutupnya adalah perhiasan bagi tubuh sebagaimana membukanya berarti membiarkan tubuh dalam keadaan buruk dan tidak pantas. Ada kemungkinan bahwa yang dimaksud dengan perhiasan disini adalah lebih dari sekedar berpakaian yaitu pakaian yang bersih dan baik, ini mengandung perintah menutup aurat dalam shalat memperindah diri didalamnya serta kebersihan pakaian tersebut dari kotoran dan najis. Kemudian Dia berfirman ”makan dan minumlah” yakni dari yang baik-baik yang Allah rizkikan kepadamu, ”dan janganlah berlebih-lebihan” dalam hal itu berlebih-lebihan bisa dengan melampaui batas kemewahan dalam makan, minum dan berpakaian, dan bisa pula dengan melampaui batas kemewahan dalam makan, minum dan berpakaian, dan bisa pula dengan melampaui batas yang halal kepada yang haram. ”sesungguhnya Allah tidak menyukai orang-orang yang berlebihan” karena sikap berlebih-lebihan itu dibenci Allah membahayakan tubuh dan kehidupan manusia, bahkan bisa menyebabkan ketidakmampuan untuk memberi nafkah. jadi ayat ini mengandung perintah makan dan minum larangan meninggalkannya serta larangan berlebih-lebihan padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 31: Imam Muslim meriwayatkan dari Ibnu Abbas ia berkata, “Ada wanita yang bertawaf di Baitullah dalam keadaan telanjang, lalu ia berkata, “Siapa yang mau meminjamkan kepadaku pakaian tawaf?” Untuk dia jadikan penutup farjinya dan ia berkata, “Pada hari ini, sebagiannya nampak atau semuanya. Bagian yang nampak daripadanya, tidak saya halalkan.” Maka turunlah ayat, “Khudzuu ziinatakum ‘inda kulli masjid.” Hadits ini dinisbatkan oleh Ibnu Katsir kepada Nasa’i dan Ibnu Jarir (juz 8 hal. 160) dan diriwayatkan oleh Al Waahidiy dalam Asbaabunnuzul. Hakim juga menyebutkan di juz 2 hal. 319-320 dari jalan Syu’bah, di sana disebutkan turunnya ayat ini, “Qul man harrama ziinatallah…dst.” Hakim berkata, “Hadits ini shahih sesuai syarat Bukhari-Muslim, namun keduanya tidak menyebutkan”, dan didiamkan oleh Adz Dzahabi. Mungkin saja kedua ayat ini turun karena sebab tersebut, walahu ‘alam. Yang menutupi auratmu. Maksudnya setiap akan mengerjakan shalat atau thawaf keliling ka'bah atau ibadah-ibadah yang lain. Ayat ini memerintahkan untuk menutupi aurat, karena menutupnya menghiasi badan sebagaimana menanggalkannya menjadikan buruk bagi badan. Dalam ayat ini terdapat perintah menutup aurat ketika shalat dan dalam menjalankan ibadah lainnya, perintah berhias dan membersihkan pakaian dari kotoran dan najis. Maksudnya janganlah melampaui batas yang dibutuhkan oleh tubuh dan jangan pula melampaui batas-batas makanan yang dihalalkan kepada yang diharamkan. Demikian pula terdapat larangan berlebihan (bermewah-mewahan) dalam hal makan, minum dan berpakaian. Berlebih-lebihan adalah perkara yang dibenci Allah, membahayakan badan dan penghidupannya, bahkan terkadang membawanya kepada keadaan yang membuatnya tidak sanggup memenuhi kewajiban. Dalam ayat ini terdapat perintah makan dan minum, larangan meninggalkannya dan larangan berlebih-lebihan dalam makan dan minum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 31",
    "description": "Pada ayat yang lalu Allah memerintahkan agar manusia berlaku adil dalam semua urusan, maka pada ayat ini Allah memerintahkan agar memakai pakaian yang baik dalam beribadah, baik ketika salat, tawaf, dan ibadah lainnya. Allah juga memerintahkan manusia untuk makan dan minum secukupnya tanpa berlebih-lebihan. Wahai anak cucu adam! pakailah pakaianmu yang bagus yaitu pakaian yang dapat menutupi aurat kalian atau bahkan yang lebih dari itu ketika kalian beribadah, sehingga kalian bisa melakukan salat dan tawaf dengan nyaman, dan lakukanlah itu pada setiap memasuki dan berada di dalam masjid atau tempat lainnya di muka bumi ini. Dalam rangka beribadah, kami telah menyediakan makanan dan minuman, maka makan dan minumlah apa saja yang kamu sukai dari makanan dan minuman yang halal, baik dan bergizi, tetapi jangan berlebihan dalam segala hal, baik dalam beribadah dengan menambah cara atau kadarnya, ataupun dalam makan dan minum. Karena sungguh, Allah tidak menyukai, yakni tidak melimpahkan rahmat dan ganjaran-Nya kepada orang yang berlebih-lebihan dalam hal apa pun. Allah mengecam kaum musyrik yang mengharamkan sesuatu yang baik, seperti berpakaian dan memakan makanan yang baik, kemudian mereka mengatakan bahwa ketentuan itu berasal dari Allah. Oleh karena itu, Allah memerintahkan nabi-Nya untuk mengingkari perkataan orang-orang musyrik itu. Katakanlah, wahai nabi Muhammad, kepada mereka yang mengharamkan apa yang dihalalkan Allah, siapakah yang mengharamkan perhiasan dari Allah yang telah disediakan, yakni diizinkan untuk dikenakan dan dinikmati, untuk hamba-hamba-Nya, dan rezeki yang baik-baik yang Allah sediakan di muka bumi ini' katakanlah, pakaian, makanan, atau rezeki lainnya, semua itu untuk orang-orang yang beriman juga orang yang tidak beriman dalam kehidupan dunia, tetapi ia akan menjadi khusus untuk mereka saja yang beriman pada hari kiamat. Demikianlah, kami menjelaskan ayat-ayat, yakni ketetapan-ketetapan hukum atau bukti-bukti kebesaran kami, itu untuk orang-orang yang ingin mengetahui."
  }
]