[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada orang-orang bodoh dari kalangan kaum musyrikin, ”siapakah yang mengharamkan pakaian atas kalian pakaian yang baik yang telah Allah jadikan sebagai perhiasan bagi kalian? Dan siapakah yang mengharamkan kalian untuk bersenang-senang menikmati barang-barang halal lagi baik dari rizki Allah ?” Katakanlah (wahai rasul), kepada kaum musyrikin, ”sesungguhnya apa yang Allah halalkan dari berbagai jenis pakaian dan yang baik-baik dari berbagai macam makanan dan minuman, merupakan hak bagi orang-orang yang beriman di dunia ini, yang juga di nikmati secara bersamaan oleh selain mereka, sementara menjadi khusus bagi mereka saja di hari kiamat.” Dengan uraian yang rinci seperti ini, Allah menjelaskan ayat-ayat itu kepada orang-orang yang mengetahui apa yang dijelaskan kepada mereka dan memahami keistimewaan yang diberikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Katakanlah -wahai Rasul- untuk membantah ucapan orang-orang kafir yang mengharamkan apa-apa yang Allah halalkan, baik dalam urusan pakaian, makanan, maupun lainnya, “Siapakah yang telah mengharamkan kalian memakai pakaian yang menjadi perhiasan bagi kalian? Dan siapakah yang telah mengharamkan makanan, minuman, dan lain-lain yang Allah jadikan rezeki bagi kalian?” Katakanlah -wahai Rasul-, “Sesungguhnya makanan, minuman, pakaian, dan lain-lain yang termasuk dalam kategori baik itu diperuntukkan bagi orang-orang mukmin selama hidup di dunia. Meskipun ada golongan lain yang menikmatinya di dunia, tetapi di hari Kiamat kelak hanya akan diperuntukkan bagi orang-orang yang beriman. Ketika itu tidak ada orang kafir yang bisa menikmatinya bersama mereka. Karena Surga diharamkan bagi orang-orang kafir. Kami menjelaskan ayat-ayat itu secara rinci kepada orang-orang yang mau berpikir. Karena merekalah yang bisa mendapatkan manfaat darinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Allah membantah orang yang mengharamkan makanan, minuman, atau pakaian tanpa berlandaskan syariat Allah; maka Dia memerintahkan Rasulullah untuk berkata kepada orang-orang musyrik sebagai pengingkaran dan olokan bagi mereka: \"Siapakah yang mengharamkan kalian dari pakaian yang bagus dan penampilan yang indah yang telah Allah ciptakan bagi seluruh hamba? Dan siapakan yang mengharamkan makanan dan minuman yang baik?\" Hai Rasulallah, katakanlah kepada mereka: \"Sesungguhnya pakaian dan perhiasan, dan makanan dan minuman yang baik merupakan hak orang-orang beriman dan selain mereka di dunia; namun di akhirat kelak, hanya bagi orang-orang beriman saja.\" Dengan penjelasan itu, Kami jelaskan ayat-ayat yang menunjukkan kesempurnaan agama dan hukum-hukum bagi orang yang mengetahui bahwa itu adalah benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قُلْ مَنْ حَرَّمَ زِينَةَ اللهِ الَّتِىٓ أَخْرَجَ لِعِبَادِهِۦ (Katakanlah: “Siapakah yang mengharamkan perhiasan dari Allah yang telah dikeluarkan-Nya untuk hamba-hamba-Nya) Makna (الزينة) yakni apa yang digunakan oleh manusisa untuk berhias seperti pakaian dan barang-barang lainnya yang boleh dipakai semisal logam-logam, batu-batu berharga dan lain sebagainya. Tidak ada larangan bagi orang yang memakai pakaian baru dan berharga mahal apabila tidak termasuk kedalam batas berlebih-lebihan dan bukan termasuk apa yang diharamkan Allah. Tidak ada larangan pula bagi orang yang memakai seseuatu dengan tujuan berhias apabila hal itu tidak termasuk seseuatu yang dilarang syariat, dan barangsiapa yang menganggap itu sebagai sasuatu yang menyelisihi perbuatan zuhud maka sungguh ia telah salah dalam pemahamannya. وَالطَّيِّبٰتِ(dan (siapa pulakah yang mengharamkan) rezeki yang baik?”) Yakni berupa makanan dan minuman, karena sesungguhnya tidak termasuk tanda kezuhudan dengan meninggalkan yang baik-baik dari makan dan minuman ini. Oleh sebab itu ayat ini diturunkan untuk mengingkari perbuatan orang yang mengharamkan hal-hal tersebut atas dirinya atau mengharamkannya atas orang lain. Dan barangsiapa yang meninggalkan makanan yang baik lagi nikmat ini berupa daging, buah-buahan, manis-manisan dan lain sebagainya yang baik dalam hal cara mendapatkannya dan baik dalam zatnya maka ia masuk kedalam larangan ini. Imam Ahmad dan an-Nasa’i mengeluarkan hadist dari Abdullah bin ‘Amr dari Rasulullah, beliau bersabda: makan, minum, bersedekah, dan berpakaianlah kalian, namun tidak dengan rasa sombong dan berlebih-lebihan. Karena sesungguhnya Allah menyukai ketika melihat jejak kenikmatan-Nya yang diberikan kepada hamba-Nya”. قُلْ هِىَ لِلَّذِينَ ءَامَنُوا۟ فِى الْحَيَوٰةِ الدُّنْيَا (nlah: “Semuanya itu (disediakan) bagi orang-orang yang beriman dalam kehidupan dunia) Yakni pada dasarnya semua kenikmatan itu untuk orang-orang beriman, namun orang-orang kafir juga diberi bagian selama masih hidup di dunia. خَالِصَةً يَوْمَ الْقِيٰمَةِ ۗ( khusus (untuk mereka saja) di hari kiamat”) Yakni semua kenikmatan itu khusus bagi mereka di hari kiamat dan orang-orang kafir tidak akan mendapat bagian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dituliskan begitu banyak yang baik-baik dalam al-Qur'an yang maksudnya adalah kelezatan-kelezatan jika disandingkan dengan rezeki seperti firman Allah : { وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ } \"dan diberi-Nya kamu rezeki dari yang baik-baik\" [ Al-Anfal : 26 ], dan dituliskan juga yang baik-baik yang maksudnya adalah sesuatu halal jika disandingkan dengan penghalalan dan pengharaman seperti firman Allah : { قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ } \"Katakanlah: \"Siapakah yang mengharamkan perhiasan dari Allah yang telah dikeluarkan-Nya untuk hamba-hamba-Nya dan (siapa pulakah yang mengharamkan) rezeki yang baik?\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Wahai Nabi, katakanlah kepada seluruh manusia: “Siapakah yang mengharamkan perhiasan?” yaitu sesuatu yang digunakan manusia untuk berhias, berupa pakaian dan sebagainya yang diperbolehkan seperti logam, permata dan lain-lain. Perhiasan yang tersimpan di bumi itu berupa tanaman, logam dan hewan. Dan siapakah yang mengharamkan rejeki yang baik, yaitu kelezatan makanan dan minuman yang tidak diharamkan syariat? Sesungguhnya Allah senang melihat pengaruh nikmatnya atas hambaNya, sebagaimana yang terkandung dalam hadits shahih. Sesungguhnya perhiasan dan kebaikan bagi orang-orang mukmin dan lainnya itu suatu kebenaran dan selalu diikutkan (pada mereka) selama di dunia, sedangkan kebaikan lainnya itu khusus bagi orang-orang mukmin di akhirat. Perumpamaan penjelasan ini adalah untuk menentukan hukum perhiasan dan kebaikan. Kami menjelaskan tanda-tanda yang menunjukkan kepada kesempurnaan syariat, agama, dan hukum halal-haram bagi kaum yang mengetahui kebutuhan dan perkembangan hidup, lalu mereka merenung dan mengambil pelajaran, bukan bagi kaum yang tidak mengetahui ilmu modern dan peradaban. Ibnu Abbas berkata: “Ada seorang wanita yang Thawaf mengelilingi Ka’bah di zaman jahiliyyah. Dia dalam keadaan telanjang dan menutup farjinya dengan selembar kain. Lalu turunlah dua ayat: {Khudzu ziinatakum …} dan {Qul man harrama …}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Siapakah yang mengharamkan perhiasan (dari) Allah} perhiasan pakaian {yang telah Dia sediakan untuk hamba-hambaNya dan rezeki yang baik-baik. Katakanlah,”Itu adalah untuk orang-orang yang beriman dalam kehidupan dunia, khusus} khusus untuk mereka {pada hari Kiamat.” Demikianlah Kami merincikan} menjelaskan {ayat-ayat itu kepada kaum yang mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah menginkari orang yang keras kepala dan mengahramkan hal-hal yang baik yang dihalalkan oleh Allah dan berfirman ”katakanlah ‘siapakah yang mengaharamkan perhiasan dari Allah yang telah dikeluarkanNya untuk hamba-hambaNya“ dari berbagai macam pakaian dengan berbagai macam jenisnya, dan rizki yang baik-baik, berupa makanan dan minuman dengan beragam macamnya. yakni sipakah gerangan yang berani mengharamkan apa yang Allah halalkan sebagai nikmat kepada hamba-hambaNya? Siapakah gerangan yang mempersulit kepada mereka apa yang telah dilonggarkan Allah? Allah memberikan kelonggaran kepada hamba-hambaNYa menggunakannya sebagai penolong dalam beribadah kepadaNya maka Dia tidak membolehkannya kecuali hanya untuk hamba-hambaNYa yang beriman. oleh karena itu Dia berfirman ”katakanlah semuanya itu (disediakan) bagi orang-orang yang beriman dalam kehidupan dunia khusus untuk mereka saja di hari kiamat” yakni tidak ada persoalan atas mereka padanya. mafhum ayat ini bahwa barangsiapa yang tidak beriman kepada Allah bahkan dia menggunakan kebaikan yang dirizkikan oleh Allah sebagai sarana untuk bermaksiat kepadaNya maka ia tidaklah khusus untuk mereka dan tidak pula dibolehkan untuk mereka, bahkan dia dihukum karenanya dan atas penggunaaannya dan nikmat-nikmat itu akan ditanyakan kepadanya pada Hari kiamat. ”demikianlah kami menjelaskan ayat-ayat itu” kami menerangkan dan merincinya ”bagi orang-orang yang mengetahui” karena mereka itulah yang mengambil manfaaat dari ayat-ayat yang dijelaskan oleh Allah dan mereka mengetahui bahwa ia dari Allah lalu mereka memahaminya dan merenungkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 32: Kepada orang yang membebani diri dan mengharamkan rezeki yang baik-baik yang Allah halalkan. Seperti pakaian. Mafhum ayat ini menunjukkan bahwa barang siapa tidak beriman kepada Allah dan menggunakan nikmat-nikmat-Nya untuk bermaksiat, maka ia tidak berhak menikmatinya, bahkan akan diberikan hukuman terhadapnya dan pada hari kiamat kenikmatan yang mereka rasakan akan ditanya. Maksudnya perhiasan-perhiasan dari Allah dan makanan yang baik itu dapat dinikmati di dunia ini oleh orang-orang yang beriman dan orang-orang yang tidak beriman, sedangkan di akhirat nanti hanya untuk orang-orang yang beriman saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 32",
    "description": "Allah mengecam kaum musyrik yang mengharamkan sesuatu yang baik, seperti berpakaian dan memakan makanan yang baik, kemudian mereka mengatakan bahwa ketentuan itu berasal dari Allah. Oleh karena itu, Allah memerintahkan nabi-Nya untuk mengingkari perkataan orang-orang musyrik itu. Katakanlah, wahai nabi Muhammad, kepada mereka yang mengharamkan apa yang dihalalkan Allah, siapakah yang mengharamkan perhiasan dari Allah yang telah disediakan, yakni diizinkan untuk dikenakan dan dinikmati, untuk hamba-hamba-Nya, dan rezeki yang baik-baik yang Allah sediakan di muka bumi ini' katakanlah, pakaian, makanan, atau rezeki lainnya, semua itu untuk orang-orang yang beriman juga orang yang tidak beriman dalam kehidupan dunia, tetapi ia akan menjadi khusus untuk mereka saja yang beriman pada hari kiamat. Demikianlah, kami menjelaskan ayat-ayat, yakni ketetapan-ketetapan hukum atau bukti-bukti kebesaran kami, itu untuk orang-orang yang ingin mengetahui. Kemudian Allah menjelaskan apa yang sebenarnya diharamkan. Wahai nabi Muhammad, katakanlah kepada mereka yang mempersempit dirinya sehingga mengharamkan sesuatu yang halal, tuhanku hanya mengharamkan segala perbuatan keji, yakni perbuatan yang sangat buruk, baik berupa perkataan maupun perilaku, baik yang terlihat oleh orang lain dan yang tersembunyi, dan juga dia mengharamkan perbuatan dosa, perbuatan zalim tanpa alasan yang benar, dan mengharamkan kamu mempersekutukan Allah dengan sesuatu apa pun, sedangkan dia tidak menurunkan alasan untuk membenarkan perbuatan itu, dan dia juga melarang kamu mem bicarakan tentang Allah apa yang tidak kamu ketahui, apalagi yang kamu ketahui."
  }
]