[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, Sesungguhnya Allah hanyalah mengharamkan perbuatan-perbuatan yang buruk, baik yang tampak maupun yang tersembunyi, dan Dia juga mengharamkan segala jenis perbuatan maksiat, dan diantara maksiat yang paling besar adalah tindakan aniaya terhadap manusia. Sesungguhnya tindakan tersebut bersebrangan dengan kebenaran. Dan Dia mengharamkan kalian menyembah Allah bersama sesuatu selainNya yang Dia tidak menurunkan dalil maupun buktinya sama sekali. Sesungguhnya pelakunya sama sekali tidak memiliki hujjah apapun. Dan Dia mengharamkan atas kalian menisbatkan kepada Allah sesuatu yang tidak pernah disyariatkanNya dengan dasar kebohongan dan kedustaan, seperti ungkapan bahwa Allah memiliki anak, dan mengharamkan sebagian yang halal dari jenis pakaian dan makanan. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang mengharamkan apa yang Allah halalkan itu, “Sesungguhnya Allah hanya mengharamkan hal-hal yang keji bagi hamba-hamba-Nya. Yaitu dosa-dosa yang jelek, baik lahir maupun batin. Dia juga mengharamkan segala macam perbuatan maksiat dan pelanggaran atas hak-hak orang lain, baik menyangkut darah, harta benda, maupun harga dirinya secara semena-mena. Dia juga mengharamkan kalian menyekutukan Allah dengan yang lain tanpa landasan yang benar. Dan Dia juga mengharamkan kalian berbicara tanpa ilmu tentang nama-nama-Nya, sifat-sifat-Nya, tindakan-tindakan-Nya dan ketentuan-ketentuan syariat-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Katakanlah kepada mereka: \"Sesungguhnya Allah telah menentukan hal-hal yang haram dan telah memperingatkannya; yaitu dosa-dosa besar yang nampak maupun yang tersembunyi, segala sesuatu yang menjadi penyebab terjadinya dosa, berbuat kezaliman terhadap orang lain, menyekutukan Allah dalam ibadah akibat kebodohan dan kejahilan, dan mengatakan sesuatu atas nama Allah tanpa landasan dalil, seperti mengharamkan sesuatu yang dihalalkan Allah.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. قُلْ إِنَّمَا حَرَّمَ رَبِّىَ الْفَوٰحِشَ (Katakanlah: “Tuhanku hanya mengharamkan perbuatan yang keji) Yakni maksiat-maksiat yang sangat parah keburukannya. مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ(baik yang nampak ataupun yang tersembunyi) Yakni yang ditunjukkan maupun yang dirahasiakan. وَالْإِثْمَ(dan perbuatan dosa) Meliputi segala maksiat yang menyebabkan siksaan bagi pelakunya. وَالْبَغْىَ بِغَيْرِ الْحَقِّ(melanggar hak manusia tanpa alasan yang benar) Yakni kezaliman kepada orang lain yang melampaui batas. وَأَن تُشْرِكُوا۟ بِاللهِ مَا لَمْ يُنَزِّلْ بِهِۦ سُلْطٰنًا((mengharamkan) mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan hujjah untuk) Yakni kalian menjadikan sekutu bagi Allah padahal Allah tidak menurunkan hujjah kepada kalian tentang hal itu. وَأَن تَقُولُوا۟ عَلَى اللهِ مَا لَا تَعْلَمُونَ(dan (mengharamkan) mengada-adakan terhadap Allah apa yang tidak kamu ketahui”) Yakni kalian tidak mengetahui bahwa Allah mengatakan itu. Dan ini sebagaimana yang mereka lakukan, yaitu menisbatkan penghalalan dan pengharaman kepada Allah padahal Allah tidak membolehkan hal itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "JIka seorang hamba merasa akan amanah yang di wajibkan atasnya, dan keagungan pengawasan dari Allah, merasa akan besarnya tanggung jawab seseorang yang berfatwa, maka ia tidaklah sebaiknya mengeluarkan ucapannya tanpa berfikir terlebih dahulu apa yang mesti dan tidak mesti keluar dari lisannya, sesungguhnya Allah berfirman : { قُلْ إِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالْإِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّ وَأَنْ تُشْرِكُوا بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَأَنْ تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ } \"Katakanlah: \"Tuhanku hanya mengharamkan perbuatan yang keji, baik yang nampak ataupun yang tersembunyi, dan perbuatan dosa, melanggar hak manusia tanpa alasan yang benar, (mengharamkan) mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan hujjah untuk itu dan (mengharamkan) mengada-adakan terhadap Allah apa yang tidak kamu ketahui\"\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Wahai Nabi, katakanlah kepada orang-orang musyrik dan lainnya: “Sesungguhnya Tuhanku mengharamkan kekejian yang tampak maupun tersembunyi, yang jelas maupun dirahasiakan, yaitu maksiat besar yang menjijikkan dan sesuatu yang mengakibatkan dosa, yaitu maksiat kecil, menzalimi manusia, dan melewati batas, dan tindakan menyekutukan Allah yang tidak memiliki hujjah yang masukk akal dan dalil keilmuan, serta tindakan kepada Allah tanpa dilandasi kelimuan dan hujjah, seperti merekayasa dengan menghalalkan sesuatu yang haram dan mengharamkan sesuatu yang halal.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya Tuhanku hanya mengharamkan perbuatan keji} perbuatan buruk yang mengakibatkan dosa {dosa yang tampak dan yang tersembunyi} dan kemaksiatan secara keseluruhan {dan perbuatan melampaui batas} kezaliman yang melebihi batas {tanpa alasan yang benar. Kalian memnyekutukan Allah dengan sesuatu yang Allah tidak menurunkan bukti pembenaran} dalil dan bukti pembenaran {untuk itu dan kalian mengatakan tentang Allah apa yang tidak kalian ketahui.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. kemudian Allah menyebutkan hal-hal yang diharamkan dalam setiap syariat. Dia berfirman ”katakanlah Rabbku hanya mengharamkan perbuatan yang keji” yakni dosa-dosa yang besar yang keji, yang dipandang keji karena keburukan dan kejelekannya, seperti zina, homoseksual, dan lain-lain. FirmanNya ”baik yang Nampak maupun tersembunyi” yakni perbuatan keji yang berkaitan dengan gerakan-gerakan badan dan yang berkaitan dengan amalan-amalan hati seperti sombong, ujub (bangga diri), riya, nifak, dan lain-lain. ”dan perbuatan dosa melanggar hak manusia tanpa alasan yang benar” yakni dosa-dosa yang diganjar siksa dan mengakibatkan hukuman pada hak-hak Allah, dan pelanggaran manusia berkenaan dengan darah, harta, dan kehormatan mereka. Dalam hal ini ia mencakup dosa-dosa kepada Allah dan dosa-dosa kepada manusia. ”mengharamkan mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan hujjah untuk itu” bahkan Dia menurunkan bukti dan dalil atas tauhid. Syirik adalah menyekutukan Allah dengan seorang makhluk dalam beribadah, bisa pula termasuk dalam hal ini adalah syirik kecil, seperti riya dan bersumpah dengan nama selain Allah dan lain-lain. ”dan mengharamkan mengada-ngadakan terhadap Allah apa yang tidak kamu ketahui” dalam nama-namaNYa sifat-sifatNya perbuatan-perbuatanNya dan syariatNya. semua ini diharamkan oleh Allah dan Dia melarang hamba-hambaNYa untuk melakukannya, karena ia mengandung kerusakan, baik yang bersifat khusus dan umum. Karena ia mengandung kezhaliman dan kelancangan terhadap Allah dan kezhaliman kepada hamba-hamba Allah serta perubahan pada agama dan syariat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 33: Yakni dosa-dosa besar seperti zina, liwath (homoseks), dsb. Yang terkait dengan anggota badan. Yang terkait dengan hati, seperti riya’, ujub, sombong, nifak, dsb. Terkait dengan hak Allah. Terkait dengan hak mereka. Padahal yang Dia turunkan alasannya adalah tauhid (mengesakan-Nya dalam beribadah). Baik dalam nama-nama-Nya, sifat-Nya, perbuatan-Nya atau dalam syari’at-Nya, seperti mengharamkan sesuatu yang tidak diharamkan-Nya, dsb. Dalam ayat ini, Allah melarang beberapa perkara, dari mulai yang ringan hingga yang besar, karena di dalamnya terdapat kerusakan baik sifatnya khusus maupun umum, terdapat kezaliman dan sikap berani kepada Allah, menindas hamba-hamba Allah dan karena di dalamnya terdapat perobahan agama Allah dan syari’at-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 33",
    "description": "Kemudian Allah menjelaskan apa yang sebenarnya diharamkan. Wahai nabi Muhammad, katakanlah kepada mereka yang mempersempit dirinya sehingga mengharamkan sesuatu yang halal, tuhanku hanya mengharamkan segala perbuatan keji, yakni perbuatan yang sangat buruk, baik berupa perkataan maupun perilaku, baik yang terlihat oleh orang lain dan yang tersembunyi, dan juga dia mengharamkan perbuatan dosa, perbuatan zalim tanpa alasan yang benar, dan mengharamkan kamu mempersekutukan Allah dengan sesuatu apa pun, sedangkan dia tidak menurunkan alasan untuk membenarkan perbuatan itu, dan dia juga melarang kamu mem bicarakan tentang Allah apa yang tidak kamu ketahui, apalagi yang kamu ketahui. Orang-orang zalim yang melakukan perbuatan keji sebagaimana dijelaskan pada ayat-ayat terdahulu tidak langsung mendapatkan azab dan balasan perbuatan mereka, karena Allah telah menentukan waktu dan ajal tiap-tiap umat. Dan setiap umat atau bangsa yang mendustakan Allah dan rasul-Nya mempunyai ketentuan ajal-Nya, yaitu batas waktu untuk maju atau mundur, jaya atau hancur. Apabila ajalnya, yakni masa ketentuan azab Allah kepada umat atau bangsa, tiba, azab Allah pasti akan turun dan mereka tidak dapat meminta penundaan kedatangannya atau percepatan de-ngan memajukannya walau hanya sesaat atau sekejap pun."
  }
]