[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi tiap-tiap umat yang bersama di atas kekafiran kepada Allah dan pendustaan kepada rasulNya, sudah ada ketentuan waktu turunnya siksaan kepada mereka. Maka jika masa yang sudah ditentukan oleh Allah untuk membinasakan mereka telah tiba, mereka tidak dapat mengahirkan dari waktu tersebut meski barang sekejap pun, dan tidak bisa memajukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Tiap-tiap generasi dan kurun mempunyai masa dan waktu yang ditetapkan bagi ajal mereka. Jika batas waktu yang telah ditetapkan itu sudah tiba, mereka tidak dapat menundanya atau memajukannya sedikit pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Dan bagi setiap generasi yang mendustakan Allah telah ditentukan waktu turunnya azab bagi mereka. Apabila waktu itu telah datang maka mereka tidak akan mampu menangguhkannya dengan selamat dari kebinasaan, dan tidak akan mampu mempercepatnya. Hal ini untuk menjelaskan bahwa apa yang Allah ketahui dan Allah tetapkan sesuai ilmu-Nya, tidak akan ada seorangpun yang mampu mengubahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلِكُلِّ أُمَّةٍ أَجَلٌ ۖ (Tiap-tiap umat mempunyai batas waktu) Yakni waktu dengan batas tertentu yang mereka akan dimatikan. فَإِذَا جَآءَ أَجَلُهُمْ (maka apabila telah datang waktunya) Yakni jika telah datang ajal bagi tiap umat yang telah ditetapkan bagi mereka maka niscaya akan terjadi ketika itu juga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Bagi setiap umat dan manusia itu memiliki batas waktu hidup masing-masing. Dan ketika ajal yang membuat mereka mati telah datang maka itu yang tidak bisa ditunda dan dimajukan sesaat pun. Dan ketentuan itu pasti terjadi pada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap umat} umat dan generasi {mempunyai ajal} waktu {Jika tiba ajal mereka, maka mereka tidak dapat meminta penundaan sesaat pun dan tidak dapat meminta percepatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 yakni Allah telah mengeluarkan bani Adam (dari surga) ke bumi, mengizinkan mereka tinggal di dalamnya, menentukan ajal untuk mereka, tidak ada umat yang maju atau mundur dari ajal yang telah ditentukan tidak secara bersamaan dan tidak pula secara sendiri-sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 34: Allah Subhaanahu wa Ta'aala telah mengeluarkan anak cucu Adam ke bumi dan menempatkan mereka di sana serta menentukan ajal yang tidak maju dan tidak mundur. Yakni setiap bangsa mempunyai batas waktu kejayaan atau keruntuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 34",
    "description": "Orang-orang zalim yang melakukan perbuatan keji sebagaimana dijelaskan pada ayat-ayat terdahulu tidak langsung mendapatkan azab dan balasan perbuatan mereka, karena Allah telah menentukan waktu dan ajal tiap-tiap umat. Dan setiap umat atau bangsa yang mendustakan Allah dan rasul-Nya mempunyai ketentuan ajal-Nya, yaitu batas waktu untuk maju atau mundur, jaya atau hancur. Apabila ajalnya, yakni masa ketentuan azab Allah kepada umat atau bangsa, tiba, azab Allah pasti akan turun dan mereka tidak dapat meminta penundaan kedatangannya atau percepatan de-ngan memajukannya walau hanya sesaat atau sekejap pun. Pada ayat yang lalu Allah menerangkan bahwa tiap-tiap umat atau bangsa ada ajalnya, maka pada ayat-ayat berikut ini diterangkan bahwa Allah mengutus para rasul pada umat manusia. Mereka menyampaikan pokok-pokok syariat sebagai petunjuk kepada manusia ke jalan yang benar. Wahai anak cucu adam! jika datang kepadamu dari Allah rasulrasul dari kalanganmu sendiri agar kamu lebih mudah berkomunikasi dan akrab dengan mereka, yang membacakan dan menceritakan ayatayat-ku kepadamu, dan menerangkan pada kalian bukti-bukti kebenaran risalahnya, maka taatlah kepadanya dan ikutilah ajarannya. Maka barang siapa bertakwa kepada Allah, dengan menaati perintah-Nya dan mengadakan perbaikan, baik dalam arti memperbaiki amalnya, maupun dalam arti memperbaiki diri dan lingkungan, maka tidak ada rasa takut pada diri mereka atas dunia yang harus mereka korbankan, karena tenggelam dalam lezatnya iman yang bersemayam dalam hati mereka. Dan di akhirat, mereka tidak bersedih hati."
  }
]