[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai anak cucu Adam , jika datang kepada kalian para rasulKu yang berasal dari kaum kalian, yang mereka membacakan kepada kalian ayat-ayat kitabKu, dan mereka menjelaskan kepada kalian bukti-bukti atas kebenaran risalah yang mereka bawa kehadapan kalian, maka taatilah para rasul itu. Sesungguhnya barangsiapa yang takut terhadap kemurkaanKu dan memperbaiki amal perbuatannya, maka tidak ada ketakutan pada diri mereka pada hari kiamat terhadap siksaan Allah dan merekapun tidak bersedih hati atas apa yang terlewatkan bagi mereka dari nikmat-nikmat duniawi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Wahai anak-anak Adam! Apabila kalian didatangi utusan-utusan-Ku yang berasal dari kaum kalian sendiri untuk membacakan kitab suci yang Aku turunkan kepada mereka, maka patuhilah mereka dan ikutilah ajaran yang mereka bawa. Karena orang-orang yang bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya, menjauhi larangan-larangan-Nya, dan melaksanakan amal saleh tidak akan ada kekhawatiran atas mereka di hari Kiamat dan mereka tidak bersedih hati atas kekayaan dunia yang tidak mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Allah menyampaikan kepada para keturunan nabi Adam: \"Jika datang kepada kalian rasul-rasul dari golongan kalian untuk menyampaikan hukum-hukum dan perintah-perintah yang Aku syariatkan, maka taati dan percayailah mereka. Karena barangsiapa yang bertakwa kepada Allah dengan melakukan ketaatan dan meninggalkan larangan serta berbuat kebaikan, maka tidak selayaknya mereka takut dari azab di akhirat, atau bersedih atas kenikmatan dunia yang mereka tinggalkan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. يٰبَنِىٓ ءَادَمَ إِمَّا يَأْتِيَنَّكُمْ (Hai anak-anak Adam, jika datang kepadamu) Yakni jika darting kepada kalian. رُسُلٌ مِّنكُمْ يَقُصُّونَ عَلَيْكُمْ ءَايٰتِى ۙ( rasul-rasul daripada kamu yang menceritakan kepadamu ayat-ayat-Ku) Yakni mengabarkan dan menjelaskan kepada kalian tentang hukum-hukum yang Aku tetapkan. Maka taati, benarkan, dan ikutilah Rasul-Rasul itu. فَمَنِ اتَّقَىٰ( maka barangsiapa yang bertakwa) Yakni menjauhi perbuatan maksiat kepada Allah. وَأَصْلَحَ(dan mengadakan perbaikan) Yakni memperbaiki keadaan dirinya dengan mengikuti jejak para Rasul dan menjawab seruan mereka. فَلَا خَوْفٌ عَلَيْهِمْ (tidaklah ada kekhawatiran terhadap mereka) Dari kezaliman atau azab yang menimpa mereka. وَلَا هُمْ يَحْزَنُونَ (dan tidak (pula) mereka bersedih hati) Yakni tidak bersedih di hari kiamat atas apa yang telah menimpa mereka di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Wahai anak Adam, jika telah datang kepada kalian para rasul yang memberitahu kalian hukum-hukum yang disyariatkan kepada kalian, maka taatilah dan percayailah. Barangsiapa menghindari kemaksiatan, dan memperbaiki perbuadan dan keadaannya dengan mengikuti para rasul, maka tidak ada kekhawatiran bagi mereka terhadap azab akhirat, dan tidak pula mereka bersedih atas apa yang datang dan pergi dari mereka di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai anak cucu Adam, jika datang kepada kalian rasul-rasul dari kalangan kalian yang menceritakan} membacakan {kepada kalian ayat-ayatKu, siapa saja yang bertakwa dan melakukan perbaikan, tidak ada rasa takut menimpa mereka dan tidak bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35 manakala Allah mengeluarkan Bani Adam dari surge, Allah menguji mereka dengan para Rasul dan menurunkan kitab-kitab kepada mereka, para rasul itu membacakan ayat-ayat kepada mereka dan menjelaskan hukum-hukumNya. Kemudian Allah menjelaskan keutamaan orang yang menjawab seruan rasul dan kerugian orang yang tidak menjawab. Dia berfirman ”maka barangsiapa yang bertakwa” takut dari syirik, dosa-dosa besar dan dosa-dosa kecil yang diharamkan oleh Allah ”dan mengadakan perbaikan” dengan amal dan lahir batin, ”maka tidaklah ada kekhawatiran terhadap mereka” dan keburukan yang mungkin ditakutkan oleh selain mereka, ”dan tidak pula mereka bersedih hati” terhadap apa yang telah berlalu dan jika rasa takut dan sedih telah hilang maka rasa aman yang sempurna, kebahagiaan, dan keberuntungan abadi akan diraih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 35: Setelah Allah menempatkan Adam dan keturunannya di muka bumi, Allah menguji mereka dengan pengutusan rasul dan penurunan kitab, di mana rasul tersebut menceritakan kepada mereka ayat-ayat Allah dan menerangkan hukum-hukum-Nya. Selanjutnya, Allah menyebutkan keutamaan orang yang mengikuti seruan para rasul-Nya dan menyebutkan kerugian bagi mereka yang tidak mau mengikuti. Ada yang mengartikan dengan menjauhi larangan Allah, berupa syirk, dosa-dosa besar dan dosa-dosa kecil. Terhadap amalnya, baik yang nampak maupun yang tersembunyi. Sebagaimana rasa takut yang dialami oleh selain mereka. Terhadap yang telah luput. Ketika rasa takut dan kesedihan sudah hilang, maka akan tercapai keamanan yang sempurna, kebahagiaan dan keberuntungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 35",
    "description": "Pada ayat yang lalu Allah menerangkan bahwa tiap-tiap umat atau bangsa ada ajalnya, maka pada ayat-ayat berikut ini diterangkan bahwa Allah mengutus para rasul pada umat manusia. Mereka menyampaikan pokok-pokok syariat sebagai petunjuk kepada manusia ke jalan yang benar. Wahai anak cucu adam! jika datang kepadamu dari Allah rasulrasul dari kalanganmu sendiri agar kamu lebih mudah berkomunikasi dan akrab dengan mereka, yang membacakan dan menceritakan ayatayat-ku kepadamu, dan menerangkan pada kalian bukti-bukti kebenaran risalahnya, maka taatlah kepadanya dan ikutilah ajarannya. Maka barang siapa bertakwa kepada Allah, dengan menaati perintah-Nya dan mengadakan perbaikan, baik dalam arti memperbaiki amalnya, maupun dalam arti memperbaiki diri dan lingkungan, maka tidak ada rasa takut pada diri mereka atas dunia yang harus mereka korbankan, karena tenggelam dalam lezatnya iman yang bersemayam dalam hati mereka. Dan di akhirat, mereka tidak bersedih hati. Tetapi orang-orang yang mendustakan ayat-ayat kami, yakni tidak mengindahkan perintah dan larangan kami, dan menyombongkan diri terhadapnya, yaitu dengan menentang aturan-aturan-Nya, mereka itulah penghuni neraka dan mereka kekal di dalamnya. Hal ini disebabkan kekafiran dan pendustaan mereka terhadap para rasul dan ayat-ayat Allah."
  }
]