[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada seorang pun yang lebih besar kezhalimannya dari pada orang yang mengada-adakan kedustaan atas nama Allah , atau mendustakan ayat-ayatNya yang diturunkan. Mereka itulah yang Akan sampai kepada mereka bagian mereka dari kebaikan dan keburukan di dunia yang telah di tuliskan bagi mereka di dalam lauhil mahfudzh. Hingga ketika datang kepada mereka malaikat maut dan para pendampingnya mencabut nyawa-nyawa mereka, para malaikat bertanya kepada mereka, ”dimana mereka yang dahulu kalian sembah selain Allah dari sekutu-sekutu, pembela-pembela dan berhala-berhala agar menyelamatkan kalian dari kondisi yang meliputi kalian sekarang?” mereka menjawab, ”berhala-berhala itu telah lenyap bagi kami. ”Pada saat itu, mereka mengakui sendiri bahwa mereka dahulu di dunia mengingkari dan mendustakan keesaan Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Tidak ada seorang pun yang lebih zalim dari orang yang membuat kebohongan atas nama Allah dengan mengatakan bahwa Dia mempunyai sekutu atau memiliki kekurangan, atau mengatakan bahwa Allah telah mengatakan sesuatu padahal Dia tidak pernah mengatakannya, atau mendustakan ayat-ayat-Nya yang nyata-nyata menunjukkan ke jalan yang benar. Orang-orang seperti itu akan mendapatkan kesenangan dunia yang telah ditetapkan bagi mereka di Loh mahfuz sampai Malaikat maut dan kawan-kawannya mendatangi mereka untuk mencabut nyawa mereka. Malaikat itu akan datang seraya mencela mereka dengan mengatakan, “Di manakah tuhan-tuhan yang kalian sembah selain Allah itu? Panggillah mereka untuk membantu kalian!” Orang-orang musyrik berkata kepada para malaikat, “Tuhan-tuhan yang kami sembah itu sudah pergi meninggalkan kami. Kami tidak tahu di mana mereka berada.” Dan mereka pun mengakui bahwa mereka adalah orang-orang yang ingkar. Akan tetapi pengakuan mereka di saat seperti itu justru menjadi bumerang bagi mereka serta tidak ada gunanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Alah mengingkari kedustaan yang dibuat oleh orang-orang kafir dengan berfirman: \"Siapakah yang lebih zalim dari orang yang sengaja membuat kedustaan atas nama Allah, atau mendustakan ayat-ayat al-Qur'an, atau mengingkari risalah Rasulullah?\" Orang-orang pendusta yang dijauhkan dari rahmat Allah itu akan mendapat bagian kebaikan atau keburukan di dunia yang telah ditetapkan bagi mereka. Dan jika malaikat telah datang untuk mencabut roh mereka seraya berkata: \"Dimanakah sekutu-sekutu yang dahulu kalian sembah selain Allah?\" Mereka menjawab: \"Mereka menghilang dari kami.\" Dan mereka mengakui kekafiran yang mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللهِ كَذِبًا أَوْ كَذَّبَ بِـَٔايٰتِهِۦٓ ۚ (Maka siapakah yang lebih zalim daripada orang yang membuat-buat dusta terhadap Allah atau mendustakan ayat-ayat-Nya?) Yakni tidak ada yang lebih zalim dari orang yang bermaksiat berupa kedustaan terhadap Allah dengan membuat syariat agama yang tidak disyariatkan oleh Allah, atau mendustakan apa yang didatangkan oleh para Rasul. أُو۟لٰٓئِكَ(Orang-orang itu) Yakni yang berdusta terhadap Allah dan mendustakan apa yang datang dari Allah. يَنَالُهُمْ نَصِيبُهُم مِّنَ الْكِتٰبِ (akan memperoleh bahagian yang telah ditentukan untuknya dalam Kitab (Lauh Mahfuzh)) Yakni dari kebaikan atau keburukan yang telah ditetapkan Allah bagi mereka, dan dari kenikmatan dan kesenangan kehidupan dunia. حتَّىٰٓ إِذَا جَآءَتْهُمْ رُسُلُنَا (hingga bila datang kepada mereka utusan-utusan Kami (malaikat)) Yakni malaikat maut dan tantara-tentaranya. قَالُوٓا۟ أَيْنَ مَا كُنتُمْ تَدْعُونَ مِن دُونِ اللهِ ۖ (utusan Kami bertanya: “Di mana (berhala-berhala) yang biasa kamu sembah selain Allah?”) Yakni dimanakah berhala-berhala yang kalian dahulu sembah selain Allah? Carilah mereka agar mereka dapat memberi manfaat bagi kalian. قَالُوا۟ ضَلُّوا۟ عَنَّا(Orang-orang musyrik itu menjawab: “Berhala-berhala itu semuanya telah lenyap dari kami,”) Yakni mereka lenyap sehingga tidak mengetahui dimana kami. Atau mereka pergi meninggalkan kami sehingga kami tidak mengetahui dimana mereka. وَشَهِدُوا۟ عَلَىٰٓ أَنفُسِهِمْ أَنَّهُمْ كَانُوا۟ كٰفِرِينَ(dan mereka mengakui terhadap diri mereka bahwa mereka adalah orang-orang yang kafir) Mereka mengakui kekafiran yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Tidak ada yang lebih zalim dari orang yang merekayasa kebohongan kepada Allah, yaitu dengan mensyariatkan sesuatu yang tidak disyariatkan olehNya, mengaitkan anak dan sekutu kepada Allah, atau mendustakan ayat-ayat Allah, lalu mendustakan Alqur’an atau menentang risalah nabi Muhammad SAW. Mereka itu akan menerima nasib yang ditakdirkan kepada mereka berupa kebaikan dan keburukan, rejeki dan umur sampai datang kepada mereka malaikat maut yang mencabut nyawa mereka dan berkata: “Manakah sekutu-sekutu yang kalian mintai doa dan sembah selain Allah?” Orang-orang itu berkata: “Mereka pergi dari kami dan lenyap, sampai kami tidak tahu keberadaan mereka, dan kami tidak mengharapkan mereka bisa memberi kemanfaatan dan menolak keburukan” Mereka mengakui kekufuran dan kesesatan pada diri mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah} tidak ada satupun {yang lebih zalim daripada orang yang membuat-buat} membuat-buat {kebohongan terhadap Allah atau yang mendustakan ayat-ayatNya. Mereka itu akan memperoleh bagian mereka} bagian mereka {dari ketetapan} dari sesuatu yang telah dicatat untuk mereka di Lauhil Mahfudz berupa kebaikan dan keburukan {sehingga apabila datang kepada mereka para utusan Kami untuk mencabut nyawa mereka} mengambil ruh-ruh mereka {mereka berkata,“Manakah sesembahan yang kalian seru} kalian sembah {selain Allah” Mereka menjawab,“Semuanya telah lenyap dari kami”} mereka pergi dari kami {Mereka bersaksi} berikrar {atas diri mereka sendiri bahwa mereka adalah orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37 yakni tidak ada seoangpun yang lebih zalim “daripada orang yang membuat dusta terhadap Allah” dengan menisbatkan sekutu bagiNya kekurangan kepadaNya dan berkata atas namaNya apa yang tidak dikatakanNya “atau mendustakan ayat-ayatNya” yang menjelaskan lagi menerangkan kebenaran yang nyata yang menunjukan ke jalan yang lurus. Walaupun mereka itu menikmati dunia dan mendapatkan bagian mereka seperti yang telah tertulis di lauhil mahfuzh, tetapi itu tidak berguna apapun baginya. mereka mendapatkan nikmat sebentar, kemudian di azab dalam waktu yang panjang. ”hingga bila datang kepada mereka utusan-utusan kami malaikat untuk mengambil nyawanya” yakni malaikat yang ditugaskan mencabut nyawa dan memenuhi ajal mereka. ”utusan kami bertanya” kepada mereka dalam kondisi itu dengan mencela dan menyalahkan. ”dimana (berhala-berhala) yang biasa kamu sembah selain Allah” yakni patung-patung dan berhala-berhala. Sekaranglah waktunya diperlukan, kalu memang mereka mampu memberi manfaat atau menolak mudarat. ”orang yang musyrik itu menjawab ’berhala-berhala itu semuanya telah lenyap dari kami” yakni hilang dan tak berguna. Tidak berguna bagi kami untuk melindungi sedikitpun dari azab Allah. ”dan mereka mengakui terhadap diri mereka bahwa mereka adalah orang-orang kafir” yang berhak mendapatkan azab yang pedih lagi kekal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 37: Yakni tidak ada yang lebih zalim. Seperti menisbatkan sekutu atau anak kepada-Nya atau berkata terhadap Allah tanpa ilmu. Yaitu Al Qur’an. Berupa rezeki yang sementara, hidup sampai waktu tertentu dan sebagainya sesuai yang tercatat dalam Al Lauhul Mahfuzh. Mereka hanya bersenang-senang sebentar, dan kemudian mereka akan disiksa selamanya. Sambil mencela mereka dengan keras. Apakah mereka dapat memberi manfaat kepadamu atau menghindarkan bahaya? Ketika matinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 37",
    "description": "Siapakah yang lebih zalim daripada orang yang mengada-adakan kebohongan terhadap Allah dengan melakukan kemaksiatan kemudian dengan dusta mereka menyatakan perbuatan itu sebagai perintah Allah, atau yang mendustakan ayat-ayat-Nya, yaitu Al-Qur'an' mereka, yakni orang-orang yang mendustakan dan menentang ayat-ayat Allah, itu akan memperoleh bagian yang telah ditentukan oleh Allah di dunia, dan hal ini telah dituliskan dalam kitab lauh mahfudh. Namun demikian, hal ini berlangsung sampai ketika datang para utusan kami, yaitu malaikat maut, kepada mereka untuk mencabut nyawanya dengan keras sehingga mereka merasakan sakit yang luar biasa. Mereka, yakni para malaikat yang diperintahkan untuk mencabut nyawa tersebut berkata, wahai kalian yang senantiasa mendustakan Allah, manakah sembahan yang dulu biasa kamu sembah selain Allah' apakah mereka mampu menolong kalian dan menyelamatkan diri dari kami' dengan penuh kesadaran, mereka, yakni orang musyrik, menjawab, semuanya telah lenyap dari kami. Dan mereka memberikan kesaksian terhadap diri mereka sendiri bahwa mereka adalah orang-orang kafir. Kepada orang-orang yang mengingkari-Nya, Allah berfirman, masuklah kamu ke dalam api neraka bersama golongan jin dan manusia yang telah sesat dan berlaku kafir lebih dahulu dari kamu. Setiap kali suatu umat masuk neraka, dia melaknat saudaranya yang dahulu sama-sama melakukan kekafiran, sehingga apabila mereka telah masuk neraka semuanya, yakni para pemimpin dan para pengikut, berkatalah orang yang masuk belakangan, yakni para pengikut, kepada para pemimpin mereka yang telah masuk terlebih dahulu, ya tuhan kami, mereka-lah yang telah menyesatkan kami dari kebenaran. Maka datangkanlah siksaan api neraka yang berlipat ganda kepada mereka. Allah berfirman, masing-masing, yakni kamu dan mereka, akan mendapatkan siksaan yang berlipat ganda, tapi kamu tidak mengetahui."
  }
]