[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada kaum musyrikin yang mengada-adakan kedustaan (atas nama Allah), ”masuklah kalian kedalam neraka bersama kelompok umat-umat manusia yang serupa dengan kalian dalam kekafiran yang telah terdahulu sebelum kalian dari bangsa jin dan manusia. Tiap kali suatu kelompok dari pengikut satu ajaran (sesat) masuk neraka, mereka mengutuk kawannya yang menyebabkan mereka sesat gara-gara mengikutinya. Sehingga apabila saling bertemu di neraka antara orang-orang terdahulu dari penganut ajaran-ajaran kafir dan orang-orang belakangan dari mereka semuanya, maka berkatalah orang-orang belakangan yang mengikuti pemimpin mereka di dunia, ”wahai tuhan kami, mereka itulah yang menyesatkan kami di jalan yang benar. Maka timpakan pada mereka siksaan yang berlipat ganda dari neraka. ”Allah berfirman, ”masing-masing akan mendapatkan hukuman yang berlipat ganda.” maksudnya, masing-masing dari kalian dan mereka, akan memperoleh siksaan yang berlipat ganda dari neraka. Akan tetapi kalian wahai para pengikut, tidak mengetahui apa yang akan diterima masing-masing kalian dari siksaan dan kepedihan-kepedihan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Para Malaikat berkata kepada mereka, “Masuklah kalian (wahai orang-orang musyrik) ke dalam golongan umat-umat kafir dan sesat yang telah berlalu sebelum kalian, baik dari bangsa jin maupun manusia, di dalam Neraka. Setiap kali suatu umat masuk (ke dalam Neraka) mereka selalu mengutuk umat lain yang telah mendahuluinya ke dalam Neraka. Sampai ketika mereka semua berjumpa dan berkumpul di dalam Neraka maka orang-orang yang paling akhir masuknya (yaitu para bawahan dan pengikut) berkata kepada orang-orang yang lebih dahulu masuknya (yaitu para pemimpin dan pemuka), “Wahai Rabb kami, para pemimpin itulah yang telah menyesatkan kami dari jalan yang benar. Maka hukumlah mereka dengan hukuman yang berlipat ganda. Karena mereka telah membuat sebuah kesesatan tampak baik di mata kami.” Allah menjawab ucapan mereka itu, “Masing-masing dari kalian akan mendapatkan bagian dari azab yang berlipat ganda. Tetapi kalian tidak mengerti dan tidak mengetahuinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Allah menyampaikan kepada orang-orang yang berdusta itu sebagai olokan dan balasan bagi mereka: \"Masuklah ke dalam neraka bersama umat-umat terdahulu yang kafir dari golongan jin dan manusia.\" Setiap ada umat yang memasuki neraka maka mereka akan melaknat umat sebelumnya akibat kesesatan yang mereka dapatkan dari umat tersebut. Hal ini terus berlangsung hingga ketika mereka semua telah berkumpul di neraka, para pengikut berkata kepada para pemimpin: \"Ya Tuhan kami, mereka adalah para pemimpin yang menyesatkan kami dari petunjuk, maka berilah mereka azab neraka yang berlipat ganda.\" Maka Allah menjawab mereka: \"Setiap kalian dan siapa mereka akan mendapat azab yang berlipat ganda, akan tetapi kalian tidak mengetahui kengerian azab itu.\" Syeikh as-Syinqithi berkata, firman Allah: حتى إذا اداركوا فيها جميعا قالت أخرىهم لأولاهم ربنا هؤلاء أضلونا فئاتهم عذابا ضعفا من النار. فال لكل ضعف ولكن لا تعلمون Dalam ayat ini Allah menjelaskan sebab keberhasilan mereka menyesatkan kaum yang lain; akan tetapi Allah menjelaskannya dalam ayat yang lain, bahwa sebab keberhasilan mereka adalah karena mereka merupakan para pembesar dan pemimpin mereka, dan sudah menjadi hal yang diketahui bahwa para pengikut akan mentaati perintah para pemimpin mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. قَالَ ادْخُلُوا۟ فِىٓ أُمَمٍ قَدْ خَلَتْ مِن قَبْلِكُم (Allah berfirman: “Masuklah kamu sekalian ke dalam neraka bersama yang telah terdahulu sebelum kamu) Yakni bergabunglah bersama umat-umat sebelum kalian. مِّنَ الْجِنِّ وَالْإِنسِ(dari umat-umat jin dan manusia) Yakni orang-orang kafir dari golongan jin dan manusia. كُلَّمَا دَخَلَتْ أُمَّةٌ (Setiap suatu umat masuk (ke dalam neraka)) Yakni umat-umat terdahulu. لَّعَنَتْ أُخْتَهَا ۖ (dia mengutuk kawannya (menyesatkannya)) Yakni umat lain yang lebih dulu memasuki neraka. حَتَّىٰٓ إِذَا ادَّارَكُوا۟ فِيهَا (sehingga apabila mereka masuk semuanya) Makna (التدارك) yakni menyusul, mengikuti, dan berkumpul dengan mereka di neraka. قَالَتْ أُخْرَىٰهُمْ(berkatalah orang-orang yang masuk kemudian di antara mereka) Yakni berkata kepada umat yang dimasukkan ke dalam nereka lebih akhir. Dan mereka adalah para bawahan dan pengikut mereka. لِأُولَىٰهُمْ (kepada orang-orang yang masuk terdahulu) Yakni umat yang masuk neraka terlebih dahulu. Dan mereka adalah para pemimpin dan pembesar mereka. رَبَّنَا هٰٓؤُلَآءِ أَضَلُّونَا (Ya Tuhan kami, mereka telah menyesatkan kami) Karena orang-orang yang menyesatkan adalah mereka para pemimpin. Dan bisa juga bermakna bahwa mereka telah menyesatkan kaum yang lain setelahnya karena mereka mengikuti agama orang yang terdahulu. فَـَٔاتِهِمْ عَذَابًا ضِعْفًا مِّنَ النَّارِ ۖ (sebab itu datangkanlah kepada mereka siksaan yang berlipat ganda dari neraka) Makna (الضعف) yakni lebih dari biasanya satu kali atau berkali-kali lipat. قَالَ لِكُلٍّ ضِعْفٌ (Allah berfirman: “Masing-masing mendapat (siksaan) yang berlipat ganda) Yakni bagi setiap golongan dari kalian akan mendapat azab yang berlipat. Yakni bagi golongan umat yang masuk neraka lebih dahulu atau golongan umat yang masuk selanjutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Allah SWT berfirman kepada orang-orang musyrik di akhirat, atau melalui malaikat: “Masuklah ke neraka dalam golongan umat-umat kafir sebelum kalian, baik dari golongan jin maupun manusia” Setiap kali golongan dari merka memasuki neraka, dia akan mengutuk kelompok lainnya yang menyesatkannya dan mendahuluinya di neraka sampai mereka saling sadar (mereka sadar satu sama lain) dan saling mengikuti untuk masuk neraka. Kelompok lainnya yang baru masuk tinggal tinggal (di neraka), yaitu para pengikut dan bawahan itu berkata kepada kelompok yang lebih awal masuk atau tinggal di neraka, yaitu para pemimpin dan pembesar mereka: “Wahai Tuhan kami, mereka itulah yang menyesatkan kami dan memalingkan kami dari jalan kebenaran, maka berilah mereka azab neraka yang berkali-kali lipat” Allah berfirman: “Masing-masing kalian akan mendapat azab yang berkali-kali lipat, baik kelompok pengikut karena telah meniru dan menambah kesesatan para pemimpin, dan kelompok pemimpin karena telah menyesatkan mereka. Dan alian tidak mengetahui takaran dan jenis azab ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Masuklah kalian ke dalam api neraka bersama umat-umat yang telah berlalu} berlalu {sebelum kalian dari golongan jin dan manusia.” Setiap kali suatu umat masuk, dia melaknat saudaranya} panutannya dalam hal agama yang lebih dahulu masuk neraka {sehingga apabila mereka telah masuk} mereka saling mengikuti dan berkumpul {semua di dalamnya. orang yang terakhir berkata kepada orang yang terlebih dahulu,“Ya Tuhan kami, mereka telah menyesatkan kami. Datangkanlah siksaan neraka yang berlipat ganda} berlipat ganda {kepada mereka.” Allah berfirman,“Masing-masing mendapatkan yang berlipat ganda, tetapi kalian tidak mengetahui.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-39 Maka malaikat-malaikat berkata kepada mereka, ”masuklah kamu sekalian ke dalam neraka bersama umat-umat” yakni dalam kumpulan umat ”jin dan manusia yang telah terdahulu sebelum kamu” yakni mereka yang telah berlalu sama seperti kamu berlalu diatas kekufuran dan kesombonan, maka semuanya berhak mendapatkan kehinaan dan kebinasaan. ”setiap suatu umat masuk (kedalam neraka)” dari umat-umat yang menentang. ”DIa mengutuk kawannnya (yang menyesatkan)” seperti Firman Allah yang lain ” kemudian di Hari kiamat sebagian kamu mengingkari sebagian yang (lain) dan sebagian kamu melaknati sebagian yang lain” “sehingga apabila mereka masuk semuanya” yakni seluruh penghuninya dari orang-orang terdahulu, orang-orang belakangan, para pembesar, para pemimpin. Para pengikut dan para pengekor, semuanya telah berkumpul di neraka. ”berkatalah orang-orang yang masuk belakangan” yakni para pengikut para pemimpin. ”kepada orang-orang yang masuk terdahulu” yakni para pemimpin. Para pengikut itu mengadukan kepada Allah penyesata para pemimpin kepada mereka “ya Rabb kami, mereka telah menyesatkan kami sebab itu datangkanlah kepada mereka siksaan yang berlipat ganda karena mereka telah menyesatkan kami dan menghiasi perbuatan buruk bagi kami. ”dan berkata orang-orang yang masuk terdahulu diantara mereka kepada orang-orang yang masuk belakangan” yakni para pemimpin berkata kepada para pengikut, ”kamu tidak mempunyai kelebihan sedikitpun atas kami” yakni kita melakukan sebab azab secara bersama-sama, lalu keutamaan apa yang kamu miliki dibanding kami?” Allah berfirman \"masing-masing” darimu ”mendapat(siksaan) yang berlipat ganda” dan mendapat bagian dari api neraka ”maka rasakanlah siksaan karena perbuatan yang telah kamu lakukan” Akan tetapi seperti yang sudah diketahui bahwa azab bagi para pengikut sebagaimana nikmat yang didapatkan oleh para imam pemberi petunjuk adalah lebih besar daripada yang akan didapatkan oleh para pengkut. Allah berfirman ”orang-orang yang kafir dan mengahalangi (manusia) dari jalan Allah, kami tambahkan kepada mereka siksaan di atas siksaan disebabkan mereka selalu berbuat kerusakan.” Ayat-ayat ini dan yang sepertinya menunjukan bahwa para pendusta terhadap ayat-ayat Allah akan dikekalkan di dalam azab, mereka sama-sama mendapatkannya, walaupun kadar azab yang mereka dapatkan berbeda-beda menurut amal, pengingkaran, kezhaliman , dan kedustaan mereka, dan bahwa kasih sayang diantara mereka di dunia, pada hari kiamat akan berubah menjadi permusuhan yang saling laknat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 38: Yang pertama hingga yang terakhir, para pemimpin dan para pengikut. Maksudnya para pengikutnya. Maksudnya para pemimpinnya. Dengan menghias amal buruk kepada kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 38",
    "description": "Kepada orang-orang yang mengingkari-Nya, Allah berfirman, masuklah kamu ke dalam api neraka bersama golongan jin dan manusia yang telah sesat dan berlaku kafir lebih dahulu dari kamu. Setiap kali suatu umat masuk neraka, dia melaknat saudaranya yang dahulu sama-sama melakukan kekafiran, sehingga apabila mereka telah masuk neraka semuanya, yakni para pemimpin dan para pengikut, berkatalah orang yang masuk belakangan, yakni para pengikut, kepada para pemimpin mereka yang telah masuk terlebih dahulu, ya tuhan kami, mereka-lah yang telah menyesatkan kami dari kebenaran. Maka datangkanlah siksaan api neraka yang berlipat ganda kepada mereka. Allah berfirman, masing-masing, yakni kamu dan mereka, akan mendapatkan siksaan yang berlipat ganda, tapi kamu tidak mengetahui. Dan orang yang masuk terlebih dahulu berkata kepada yang masuk be-lakangan, wahai para pengikutku, kita sama-sama telah sesat dan ketika di dunia kita sama-sama telah melakukan perbuatan yang mengundang murka Allah, karenanya kalian tidak mempunyai kelebihan sedikit pun atas kami. Maka Allah berfirman kepada mereka semuanya, rasakanlah azab itu karena perbuatan kufur dan maksiat yang telah kalian lakukan ketika hidup di dunia."
  }
]