[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pemimpin dan selainnya dari yang diikuti berkata kepada para pengikut mereka, ”kami dan kalian sama saja dalam penyimpangan dan kesesatan, dan dalam perbuatan yang menyebabkab azab, tidak ada kelebihan bagi kalian sedikitpun atas kami. ” Allah berfirman kepada mereka semua, ”rasakanlah azab ini,” maksudnya siksaan jahanam, ”karena maksiat-maksiat yang dahulu kalian perbuat. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Para pemimpin yang menjadi panutan berkata kepada para pengikutnya, “Kalian (wahai para pengikut) tidak memiliki kelebihan apa pun atas kami yang dapat meringankan azab kalian. Karena yang menjadi pertimbangan ialah amal yang sudah kalian perbuat. Dan kalian tidak punya alasan untuk membenarkan tindakan kalian mengikuti kebatilan. Maka rasakanlah (wahai para pengikut) azab seperti yang kami rasakan, akibat kekafiran dan kemaksiatan yang telah kalian perbuat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Para pemimpin yang lebih dulu melakukan kekafiran itu berkata kepada para pengikut mereka: \"Kalian tidak memiliki keutamaan atas kami, yang dapat membuat agar kalian diringankan; maka rasakanlah azab itu akibat kemaksiatan-kemaksiatan yang telah kalian lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَقَالَتْ أُولَىٰهُمْ لِأُخْرَىٰهُمْ (Dan berkata orang-orang yang masuk terdahulu di antara mereka kepada orang-orang yang masuk kemudian) Golongan terdahulu berkata kepada golongan selanjutnya; atau golongan yang diikuti berkata kepada golongan yang mengikuti. فَمَا كَانَ لَكُمْ عَلَيْنَا مِن فَضْلٍ(Kamu tidak mempunyai kelebihan sedikitpun atas kami) Yakni dalam hal keringanan atas azab, karena yang menjadi acuan adalah perbuatan dan amalan seseorang, dan tidak ada alasan baginya kerena telah mengikuti kebathilan, namun kedua golongan tersebut sama dalam kekafiran kepada Allah dan sama dalam kelayakan mendapat azab. فَذُوقُوا۟ الْعَذَابَ(maka rasakanlah siksaan) Yakni rasakan azab neraka sebagaimana kami merasakannya. بِمَا كُنتُمْ تَكْسِبُونَ(karena perbuatan yang telah kamu lakukan) Berupa kemaksiatan-kemaksiatan dan kekafiran kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Para pendahulu itu berkata kepada yang lainnya, yaitu yang diikuti kepada pengikutinya: “Kalian tidak memiliki keistimewaan dan dan kelebihan atas kami yang bisa digunakan untuk meringankan azab. Sungguh kalian tersesat sebagaimana kami. Maka rasakanlah azab itu akibat kemaksiatan, kekufuran dan kesesatan yang kalian lakukan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang yang terlebih dahulu berkata kepada yang terakhir,“Kalian tidak mempunyai kelebihan sedikit pun atas kami. Maka rasakanlah azab itu karena perbuatan yang telah kalian lakukan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-39 Maka malaikat-malaikat berkata kepada mereka, ”masuklah kamu sekalian ke dalam neraka bersama umat-umat” yakni dalam kumpulan umat ”jin dan manusia yang telah terdahulu sebelum kamu” yakni mereka yang telah berlalu sama seperti kamu berlalu diatas kekufuran dan kesombonan, maka semuanya berhak mendapatkan kehinaan dan kebinasaan. ”setiap suatu umat masuk (kedalam neraka)” dari umat-umat yang menentang. ”DIa mengutuk kawannnya (yang menyesatkan)” seperti Firman Allah yang lain ” kemudian di Hari kiamat sebagian kamu mengingkari sebagian yang (lain) dan sebagian kamu melaknati sebagian yang lain” “sehingga apabila mereka masuk semuanya” yakni seluruh penghuninya dari orang-orang terdahulu, orang-orang belakangan, para pembesar, para pemimpin. Para pengikut dan para pengekor, semuanya telah berkumpul di neraka. ”berkatalah orang-orang yang masuk belakangan” yakni para pengikut para pemimpin. ”kepada orang-orang yang masuk terdahulu” yakni para pemimpin. Para pengikut itu mengadukan kepada Allah penyesata para pemimpin kepada mereka “ya Rabb kami, mereka telah menyesatkan kami sebab itu datangkanlah kepada mereka siksaan yang berlipat ganda karena mereka telah menyesatkan kami dan menghiasi perbuatan buruk bagi kami. ”dan berkata orang-orang yang masuk terdahulu diantara mereka kepada orang-orang yang masuk belakangan” yakni para pemimpin berkata kepada para pengikut, ”kamu tidak mempunyai kelebihan sedikitpun atas kami” yakni kita melakukan sebab azab secara bersama-sama, lalu keutamaan apa yang kamu miliki dibanding kami?” Allah berfirman \"masing-masing” darimu ”mendapat(siksaan) yang berlipat ganda” dan mendapat bagian dari api neraka ”maka rasakanlah siksaan karena perbuatan yang telah kamu lakukan” Akan tetapi seperti yang sudah diketahui bahwa azab bagi para pengikut sebagaimana nikmat yang didapatkan oleh para imam pemberi petunjuk adalah lebih besar daripada yang akan didapatkan oleh para pengkut. Allah berfirman ”orang-orang yang kafir dan mengahalangi (manusia) dari jalan Allah, kami tambahkan kepada mereka siksaan di atas siksaan disebabkan mereka selalu berbuat kerusakan.” Ayat-ayat ini dan yang sepertinya menunjukan bahwa para pendusta terhadap ayat-ayat Allah akan dikekalkan di dalam azab, mereka sama-sama mendapatkannya, walaupun kadar azab yang mereka dapatkan berbeda-beda menurut amal, pengingkaran, kezhaliman , dan kedustaan mereka, dan bahwa kasih sayang diantara mereka di dunia, pada hari kiamat akan berubah menjadi permusuhan yang saling laknat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 39: Maksudnya: kita telah sama-sama tersesat dan telah mengerjakan sebab untuk diazab, lantas apa kelebihan kamu di atas kami? Namun sudah maklum, bahwa azab kepada para pemimpin kesesatan tentu lebih dahsyat daripada kepada para pengikut, sebagaimana nikmat dan pahala yang diperoleh para pemimpin petunjuk lebih besar daripada para pengikut. Oleh karena itu, Allah berfirman:“Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Kami tambahkan kepada mereka siksaan di atas siksaan disebabkan mereka selalu berbuat kerusakan.” (Terj. An Nahl: 88) Ayat ini dan yang semisalnya menunjukkan bahwa orang-orang yang mendustakan ayat-ayat Allah akan kekal diazab, meskipun mereka berbeda-beda tingkatan azabnya tergantung amal mereka, sikap keras mereka, kezaliman dan kedustaan mereka, dan bahwa cinta kasih yang sebelumnya terjalin di antara mereka akan berubah pada hari kiamat menjadi permusuhan dan saling laknat-melaknat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 39",
    "description": "Dan orang yang masuk terlebih dahulu berkata kepada yang masuk be-lakangan, wahai para pengikutku, kita sama-sama telah sesat dan ketika di dunia kita sama-sama telah melakukan perbuatan yang mengundang murka Allah, karenanya kalian tidak mempunyai kelebihan sedikit pun atas kami. Maka Allah berfirman kepada mereka semuanya, rasakanlah azab itu karena perbuatan kufur dan maksiat yang telah kalian lakukan ketika hidup di dunia. Sesungguhnya orang-orang kafir yang mendustakan ayat-ayat yang menunjukkan keesaan kami dan menyombongkan diri terhadapnya dengan tidak mengindahkan syariat kami, sekali-kali tidak akan dibukakan pintu-pintu langit bagi mereka: doanya, perbuatannya, bahkan arwahnya. Dan pada hari kemudian mereka tidak akan mungkin masuk surga, sebelum, yakni kecuali jika terjadi sesuatu yang mustahil menurut akal manusia, yaitu unta masuk ke dalam lubang jarum yang demikian kecil. Demikianlah kami memberi balasan kepada orang-orang yang berbuat jahat, para pendurhaka yang kedurhakaannya telah mendarah daging pada dirinya."
  }
]