[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan banyak dari negeri-negeri yang telah kami hancurkan penduduknya, karena penentangan dan pendustaan mereka terhadap para rasul kami. sehingga hal itu menimpakan pada mereka kehinaan di dunia yang berlanjut dengan kenistaan di akhirat. Maka sekali waktu datanglah siksa kami kepada mereka pada saat mereka tidur pada malam hari, dan sekali waktu saat mereka tidur di siang hari. Allah menyebut dua waktu ini secara khusus, karena merupakan jam tidur dan melepas rasa lelah. Karenanya, kedatangan siksaan pada saat tersebut akan lebih menakutkan dan mengagetkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Betapa banyak negeri yang Kami binasakan dengan azab Kami tatkala mereka bersikeras mempertahankan kekafiran dan kesesatannya. Maka azab Kami yang sangat keras turun ke negeri itu di saat penduduknya lengah di waktu malam atau siang. Sehingga mereka tidak mampu melindungi diri mereka dari azab tersebut. Bahkan tuhan-tuhan yang mereka sembah pun tidak mampu melindungi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Allah memperingatkan hamba-hamba-Nya dari kemaksiatan: Umat-umat yang mendustakan rasul mereka telah Kami balas dengan kebinasaan. Kami menimpakan kepada mereka azab secara tiba-tiba, ketika mereka sedang tidur di siang atau malam hari. Doa dan permintaan tolong mereka saat menyaksikan azab itu tidak lain adalah dengan mengakui segala kezaliman yang telah mereka lakukan, karena sangat menyesal. Namun itu semua tidak bermanfaat lagi bagi mereka, karena mereka telah layak mendapatkan apa yang diancamkan Allah kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَكَم مِّن قَرْيَةٍ أَهْلَكْنٰهَا (Betapa banyaknya negeri yang telah Kami binasakan) Yakni yang hendak Kami binasakan. فَجَآءَهَا بَأْسُنَا(maka datanglah siksaan Kami (menimpa penduduk)nya) Yakni Kami membinasakan penduduk banyak negeri yang mendustakan kebenaran dengan azab yang menimpa mereka. بَيٰتًا(di waktu mereka berada di malam hari) Yakni di malam hari ketika mereka tidur. أَوْ هُمْ قَآئِلُونَ (atau di waktu mereka beristirahat di tengah hari) Makna (القيلولة) yakni istirahat di waktu pertengahan siang. Allah mengkhususkan dua waktu ini (malam hari dan pertengahan siang) karena ini merupakan waktu beristirahat dan mencari ketenangan, sehingga azab yang turun diwaktu tersebut akan lebih keras dan kejam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dan betapa banyak negeri dan penghuninya yang mendustakan kebenaran itu Kami kehendaki kehancurannya. Lalu azab kami menimpa mereka di malam hari, sedangkan mereka dalam keadaan tidur atau beristirahat di waktu qailulah yaitu waktu tidur di separuh siang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Betapa banyak negeri yang telah Kami binasakan. Siksaan Kami} azab Kami {datang pada malam hari} malam hari {atau pada saat mereka beristirahat} tidur pada siang hari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. kemudian Allah memperingatkan mereka terhadap hukuman-hukumanNya yang menimpa umat-umat yang mendustakan apa yang dibawa oleh Rasul mereka, agar mereka tidak meniru umat-umat itu. Dia berfirman ”betapa banyaknya negeri yang telah kami binasakan maka datanglah siksaan kami (menimpa) penduduknya” yakni azab kami yang keras. ”diwaktu mereka berada di malam hari, atau di waktu mereka sedang istirahat di tengah hari” yakni waktu yang mereka lalai, pada waktu mereka bersantai, dimana mereka sama sekali tidak menyangka akan tertimpa kebinasaan, sehingga manakala azab datang mereka tidak bisa melindungi diri mereka. tuhan-tuhan mereka yang mereka harapkan tidak berguna sedikitpun bagi mereka dan tidak pula mengingkari kezhaliman dan kemaksiatan yang mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 4: Karena mendustakan apa yang dibawa para rasul. Tidak terpikir dalam benak mereka, jika saat itu siksaan datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 4",
    "description": "Betapa banyak negeri yang telah kami binasakan, seperti negeri kaum nabi-nabi terdahulu, siksaan kami datang menimpa penduduk-Nya pada malam hari ketika mereka tengah terlelap dalam tidur seperti yang terjadi pada kaum nabi lut yang melakukan homoseks. Negeri mereka dijungkirbalikkan dan dihujani dengan batu. Atau siksaan itu datang pada saat mereka beristirahat pada siang hari seperti yang terjadi pada kaum nabi syuaib yang sering melakukan kecurangan dalam takaran dan timbangan. Mereka disiksa dengan suara yang menggelegar. Azab Allah bisa datang kapan saja, secara tak terduga, bahkan ketika waktu istirahat sekalipun. Maka ketika siksaan kami datang menimpa mereka, keluhan mereka tidak lain, hanya mengucap, sesungguhnya kami adalah orang-orang yang zalim. Mereka mengakui dosa-dosanya, tetapi semua penyesalan itu tidak ada gunanya lagi. Mereka tetap dibinasakan. Inilah siksaan mereka di dunia. Di akhirat nanti, azab Allah akan lebih pedih lagi. Mereka akan dimintakan pertanggungjawaban."
  }
]