[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang kafir yang tidak mengimani hujjah-hujjah dan ayat-ayat kami yang menunjukan keesaan Kami dan tidak melaksanakan syariat Kami karena kesombongan dan kecongkakan mereka, tidak di buka pintu-pintu langit untuk menerima perbuatan mereka di dunia dan roh-roh mereka saat kematian datang. Dan orang-orang kafir tidak mungkin akan masuk ke dalam surga kecuali apabila unta sudah bisa memasuki lubang jarum. Ini satu hal yang mustahil terjadi. Dengan balasan seperti itu, kami akan memberikan balasan kepada orang-orang yang banyak berbuat kejahatan dan sudah kelewatan tindakan kezhaliamannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya orang-orang yang mendustakan ayat-ayat Kami yang terang-benderang dan enggan untuk tunduk dan patuh kepadanya akan berputus asa dari segala kebaikan. Maka pintu-pintu langit tidak akan dibuka untuk menerima amal perbuatan mereka karena kekafiran mereka. Dan juga tidak akan dibuka untuk menerima roh mereka ketika mereka meninggal dunia. Dan mereka tidak akan pernah masuk Surga sampai ada unta (yang merupakan salah satu binatang bertubuh besar) masuk ke lubang jarum yang merupakan salah satu lubang yang sangat kecil. Ini hal yang mustahil. Maka sesuatu yang digantungkan padanya (yaitu masuknya mereka ke dalam Surga) pun merupakan perkara yang mustahil. Balasan seperti itulah yang Allah berikan kepada para pelaku dosa terbesar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Sesungguhnya orang-orang yang mengingkari ayat-ayat kebesaran Kami yang dapat didengar dan dilihat untuk menuntun kepada keimanan, sehingga mereka tidak menerimanya dan tidak mengamalkannya, maka amal kebaikan dan roh mereka tidak dapat naik ke langit karena pintu-pintu langit tertutup bagi mereka. Mereka tidak akan masuk surga hingga seekor unta dapat masuk ke dalam lubang jarum yang sempit; dan ini merupakan hal yang mustahil. Demikianlah balasan bagi orang-orang yang kafir dan membangkang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. لَا تُفَتَّحُ لَهُمْ أَبْوٰبُ السَّمَآءِ (sekali-kali tidak akan dibukakan bagi mereka pintu-pintu langit) Yakni pintu-pintu langit tidak dibuka untuk ruh-ruh mereka ketika mereka mati. Pendapat lain mengatakan pintu-pintu langit tidak dibuka untuk doa-doa mereka ketika mereka berdoa, dan tidak pula untuk amalan-amalan baik mereka apabila mereka beramal, sehingga itu tidak diangkat kepada Allah dan tidak diterima, tapi dikembalikan kepada mereka dan dipakai untuk memukul wajah mereka. وَلَا يَدْخُلُونَ الْجَنَّةَ(dan tidak (pula) mereka masuk surga) Yakni mereka tidak akan masuk surga dalam keadaan apapun. Maka dari itulah Allah men-syaratkan itu dengan hal yang mustahil terjadi dengan firman-Nya: حَتَّىٰ يَلِجَ الْجَمَلُ فِى سَمِّ الْخِيَاطِ حَتَّىٰ يَلِجَ الْجَمَلُ فِى سَمِّ الْخِيَاطِ ۚ( hingga unta masuk ke lubang jarum) Allah menyebutkan kalimat ‘lubang jarum’ karena ia sangat sempit. Adapun makna (الجمل) yakni unta jantan, dan pendapat lain mengatakan yakni tali tebal yang terbuat dari kulit pohon."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya orang-orang yang mendustakan ayat-ayat Kami yang menunjukkan kepada sumber agama dan hukum-hukum syariat tentang akidah, peribadatan dan muamalah yang diturunkan kepada para utusan Kami, dan enggan menerimanya lalu tidak mengimaninya, maka pintu-pintu langit tidak akan terbuka bagi ruh-ruh mereka saat mati. Amal shalih dan doa mereka tidak bisa naik ke langit akibat amal buruk mereka. Mustahil bagi mereka untuk masuk surga, layaknya unta (unta) yang mustahil memasuki lubang jarum. Sebagaimana balasan itulah, Kami akan membalas orang-orang jahat dengan berbuat kufur. As-Sammu adalah menembus dan Al-khiyath adalah lubang jarum. Disebutkan seperti itu karena sangat sempit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang mendustakan ayat-ayat Kami dan menyombongkan diri terhadapnya, tidak akan dibukakan bagi mereka pintu-pintu langit dan mereka tidak akan masuk surga sebelum masuk} masuk {seekor unta ke dalam lubang jarum} lubang jarum {Demikianlah Kami memberi balasan kepada orang-orang yang berbuat durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40 Allah memberitakan hukuman orang-orang yang mendustakan ayat-ayatNya dan tidak beriman kepadanya, padahal ia adalah ayat-ayat yang jelas. Mereka menyombongkan diri darinya, tidak tunduk terhadap hukum-hukumNya, bahkan mereka mendustakan dan berpaling. Allah mengabarkan bahwa mereka berputus asa dari segala kebaikan, JIka mereka mati, maka pintu-pintu langit tidak di buka untuk roh mereka, roh itu naik kepada Allah lalu meminta izin dan tiak diizinkan, sebagaimana di dunia ia tidak sudi beriman kepada Allah, mengetahui dan mencintaiNya, maka setelah mati Allah tidak sudi kepadanya, karena balasan akan sesuai dengan jenis amalnya. Mafhum ayat ini bahwa roh orang-orang mukmin yang tunduk kepada perintah Allah dan membenarkan ayat-ayatNya , dibukakan pintu –pintu langit, sehingga dapat ia bisa bertemu di langit sehingga ia dapat naik kepada Allah dan ia sampai di alam yang tinggi yang di inginkan oleh Allah ia berbahagia karena kedekatan dengan Rabbnya dan mendapatkan ridhaNya. Firman nya tentang penduduk neraka ”dan tidak pula mereka masuk surge, hingga unta masuk” yaitu unta yang sudah dikenal ”ke lubang jarum” yakni sehingga unta yang merupakan binatang bertubuh besar masuk ke lubang jarum yang merupakan lubang tersempit ini merupakan ungkapan mengingatkan sesuatu dengan sesuatu yang mustahil. yakni sebagaimana unta mustahil dapat masuk ke dalam lubang jarum, maka orang-orang yang mendustakan ayat-ayat Allah juga mustahil masuk surge, maka Allah berfirman ”sesungguhnya orang yang mempersekutukan sesuatu dengan Allah maka pasti Allah mengharamkan kepadanya surge, dan tempatnya ialah neraka” Disini Allah berfirman ”demikianlah kami memberi pembalasan kepada orang-orang yang berbuat kejahatan” yakni orang-orang yang berbuat kejahatan dan sangat melapaui batas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 40: Tidak mau beriman. Ketika ruh mereka diangkat ke langit, lalu dijatuhkan ke sijjin (bagian bawah bumi), berbeda dengan orang mukmin, pintu langit akan dibukakan untuknya dan ruhnya dinaikkan ke langit menghadap Allah. Artinya mereka tidak mungkin masuk surga sebagaimana tidak mungkin masuknya unta ke lubang jarum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 40",
    "description": "Sesungguhnya orang-orang kafir yang mendustakan ayat-ayat yang menunjukkan keesaan kami dan menyombongkan diri terhadapnya dengan tidak mengindahkan syariat kami, sekali-kali tidak akan dibukakan pintu-pintu langit bagi mereka: doanya, perbuatannya, bahkan arwahnya. Dan pada hari kemudian mereka tidak akan mungkin masuk surga, sebelum, yakni kecuali jika terjadi sesuatu yang mustahil menurut akal manusia, yaitu unta masuk ke dalam lubang jarum yang demikian kecil. Demikianlah kami memberi balasan kepada orang-orang yang berbuat jahat, para pendurhaka yang kedurhakaannya telah mendarah daging pada dirinya. Kemudian digambarkan keadaan mereka di neraka. Bagi mereka, yaitu orang-orang yang senantiasa kufur dan bermaksiat kepada Allah, ada balasan lainnya yaitu tikar tidur dari api neraka di bawah mereka, dan di atas mereka ada selimut dari api neraka. Dengan balasan yang demikianlah kami memberi balasan yang pantas kepada orang-orang yang senantiasa berbuat zalim, yakni mempersekutukan Allah dan mengadaada sesuatu atas nama-Nya."
  }
]