[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu kekal abdi didalam neraka. Mereka mempunyai tempat tidur dari neraka yang berada di bawah mereka dan diatas mereka terdapat penutup-penutup yang menyelimuti mereka. Dengan siksaan pedih seperti ini, Allah menyiksa orang-orang yang berbuat zhalim yang telah melewati batas-batas ketentuanNya, mereka kufur kepada Nya, dan berbuat maksiat kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Orang-orang yang ingkar dan sombong itu akan mendapatkan hamparan di Neraka Jahanam. Dan bagian di atas mereka akan ada azab yang menaungi mereka. Balasan seperti itulah yang akan Kami berikan kepada orang-orang yang melanggar ketentuan-ketentuan Allah lantaran kekafiran dan sikap mereka yang berpaling darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Balasan bagi mereka adalah neraka jahanam; di bawah mereka terhampar api, dan di atas mereka tertutup api. Demikianlah balasan yang Kami berikan bagi orang-orang yang melanggar hukum-hukum Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. مِهَادٌ (tikar tidur) Yakni tempat tidur. وَمِن فَوْقِهِمْ غَوَاشٍ ۚ( dan di atas mereka ada selimut (api neraka)) Makna (الغواشي) yakni selimut-selimut. Yakni api yang menutupi dari atas mereka seperti selimut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Bagi mereka di neraka Jahannam itu tempat tidur dari api dan di atas mereka ada penutup dari api pula, yaitu mereka ditutupi api dari atas layaknya penutup. Seperti balasan ini, Kami membalas orang-orang yang menzalimi diri sendiri dan orang lain, yaitu orang-orang kafir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi mereka alas tidur dari neraka Jahanam} alas tidur dari bawah mereka {dan di atas mereka ada selimut} penutup darinya {Demikianlah Kami memberi balasan kepada orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41 “mereka mempunyai tikar tidur dari api neraka” yakni kasur di bawah mereka ”dan diaatas mereka ada selimut (api neraka)” yakni naungan azab yang menutupi mereka. ”demikianlah kami memberi balasan kepada orang-orang yang zhalim” kepada diri mereka sebagai balasan yang setimpal, dan Allah tidaklah menzhalimi hamba-hambaNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 41: Mereka terkepung dalam api neraka Dengan balasan yang sesuai, dan Allah sama sekali tidaklah berbuat zalim kepada hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 41",
    "description": "Kemudian digambarkan keadaan mereka di neraka. Bagi mereka, yaitu orang-orang yang senantiasa kufur dan bermaksiat kepada Allah, ada balasan lainnya yaitu tikar tidur dari api neraka di bawah mereka, dan di atas mereka ada selimut dari api neraka. Dengan balasan yang demikianlah kami memberi balasan yang pantas kepada orang-orang yang senantiasa berbuat zalim, yakni mempersekutukan Allah dan mengadaada sesuatu atas nama-Nya. Pada ayat ini, Allah menerangkan tentang amal saleh serta ganjaran bagi orang yang melakukannya. Dan adapun orang-orang yang beriman, membenarkan Allah dan rasul-Nya, meyakini kebenaran wahyu yang dibawa oleh nabi Muhammad, serta mengerjakan kebajikan dengan begitu ringannya dan tidak merasa terbebani, karena kami sedikit pun tidak akan membebani seseorang untuk melakukan perintah dan menjauhi larangan melainkan menurut kadar kesanggupannya. Mereka, yaitu orang-orang yang beriman dan membuktikan keimanannya dengan melakukan amal kebajikan tanpa merasa terbebani, itulah penghuni surga; mereka kekal di dalamnya."
  }
]