[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang beriman kepada Allah dan melakukan amal-amal shalih sesuai dengan batasan kemampuan mereka, dan Allah tidak memikulkan beban pada seseorang dari amal-amalan, kecuali apa yang sanggup dikerjakannya. Mereka itulah penghuni-penghuni surga; mereka tinggal di dalamnya selama-lamanya, tidak akan keluar darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Sedangkan orang-orang yang beriman kepada Rabb mereka dan mengerjakan amal saleh menurut kemampuan mereka (dan Allah memang tidak memberikan beban kepada seseorang di atas kemampuannya) adalah penghuni Surga yang akan masuk dan tinggal di dalamnya untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Dan orang-orang yang beriman kepada Allah dan mengakui keesaan-Nya serta melakukan amalan-amalan shalih sebagai bukti keimanan mereka -dan Kami tidak memberatkan seorangpun dengan suatu ibadah melainkan sesuai dengan kadar kemampuannya-, mereka adalah orang-orang yang memiliki derajad yang tinggi di surga, mereka akan kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. لَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَآ (Kami tidak memikulkan kewajiban kepada diri seseorang melainkan sekedar kesanggupannya) Yakni Kami membebani hamba-hamba yang berada dalam batas kemampuan dan kekuasaannya, dan tidak membebani mereka apa yang tidak mereka mampu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Dan semua orang yang beriman kepada Allah dan rasulNya, dan beramal shalih sesuai kemampuannya dengan mengerjakan perintah dan menjauhi larangan. Kami tidak membebani suatu jiwa dengan untuk beribadah dan taat kecuali sesuai kapasitasnya. Hanya mereka itulah para penghuni surga, bukan selainnya. Mereka tinggal di dalamnya selamanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman dan mengerjakan kebajikan, Kami tidak akan membebani seseorang melainkan sesuai kesanggupannya} kemampuannya {Mereka itulah penghuni surga. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42 manakala Allah menyebutkan hukuman orang-orang yang durhaka lagi zhalim maka setelah itu Dia menyebutkan pahala orang-orang yang taat. Dia berfirman ”dan orang-orang yang beriman” dengan hati mereka ”dan mengerjakan amal-amal yang salih” dengan anggota tubuh mereka. Mereka mengumpulkan antara iman dan amal, antara amalan lahir dengan amalan batin, antara melakukan yang wajib dan menjauhi yang haram. Karena firmanNya ”dan mengerjakan amal shalih” adalah bersifat umum mencakup seluruh amal shalih yang wajib dan dianjurkan, dan bisa jadi sebagian darinya di luar kemampuan seorang hamba, maka Allah berfirman” kami tidak memikulkan kewajiban kepada diri seseorang melainkan sesuai dengan kesanggupannya”. yakni sesuai dengan kemampuannya dan tidak melebihi batas kekuatannya, maka dalam kondisi tersebut dia wajib bertakwa kepada Allah sebatas kemampuannnya. Jika dia tidak mampu melakukan sebagian yang wajib dimana selainnya mampu melakukannya, maka ia gugur darinya, sebagaiamana firmanNya ”Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya” “Allah tidak memikulkan beban kepada seseorang melainkan (sekedar) apa yang Allah berikan kepadanya” “dan sekali-kali tidak menjadikan kesempitan untukmu di dalam agama” “maka bertakwalah kepada Allah menurut kesanggugapanmu” Tiada kewajiban karena ketidakmampuan, dan tiada yang diharamkan pada waktu darurat. “mereka itulah” yaitu orang-orang yang menyandang iman dan mengerjakan amal shalih, adalah “penghuni-penghuni surge, maka mereka kekal didalamnya” yakni mereka tidak berpindah darinya. Tidak mencari penggganti karena mereka telah mendapatkan berbagai macam kelezatan dan kenikmatan yang tiada tertandingi dan tidak ada yang lebih dari itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 42: Dengan hatinya. Dengan anggota badannya, yakni mereka menggabung antara beriman dan beramal; antara amalan yang nampak maupun yang tersembunyi. Amal saleh ini mencakup yang wajib maupun yang sunat. Di antara amal saleh ada amal yang tidak disangupi hamba, maka Allah Subhaanahu wa Ta'aala tidak membebankan perkara yang tidak disanggupi tersebut. Dalam keadaan seperti ini, seorang hamba mesti bertakwa kepada Allah sesuai kemampuannya, oleh karenanya tidaklah wajib suatu perbuatan ketika tidak mampu dilaksanakan dan tidaklah haram ketika darurat. Mereka tidak akan dipindahkan daripadanya, dan lagi mereka tidak akan meminta untuk pindah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 42",
    "description": "Pada ayat ini, Allah menerangkan tentang amal saleh serta ganjaran bagi orang yang melakukannya. Dan adapun orang-orang yang beriman, membenarkan Allah dan rasul-Nya, meyakini kebenaran wahyu yang dibawa oleh nabi Muhammad, serta mengerjakan kebajikan dengan begitu ringannya dan tidak merasa terbebani, karena kami sedikit pun tidak akan membebani seseorang untuk melakukan perintah dan menjauhi larangan melainkan menurut kadar kesanggupannya. Mereka, yaitu orang-orang yang beriman dan membuktikan keimanannya dengan melakukan amal kebajikan tanpa merasa terbebani, itulah penghuni surga; mereka kekal di dalamnya. Berbeda dengan penghuni neraka yang saling mengutuk, penghuni surga hidup dengan hati yang bersih seperti digambarkan pada ayat ini. Dan kami mencabut rasa dendam dari dalam dada mereka. Kemudian termasuk kesempurnaan nikmat yang mereka peroleh di surga adalah tempat tinggal yang di bawahnya mengalir sungai-sungai. Dan ketika hendak memasuki surga, mereka, penduduk surga, berkata, segala puji bagi Allah yang telah menunjukkan kami untuk beramal saleh di dunia dan teguh untuk memegang ajaran-Nya sehingga kami mendapatkan nikmat masuk ke dalam surga ini. Kami tidak akan mendapat petunjuk untuk menempuh jalan yang lurus ini sekiranya Allah tidak menunjukkan kami. Sesungguhnya rasul-rasul tuhan kami telah datang membawa kebenaran, yakni dengan membawa berita gembira bagi yang senantiasa mengikuti perintahnya, dan peringatan bagi orang yang menentangnya. Kini di surga kami menemukan dalam bentuk nyata apa yang mereka sampaikan itu. Dengan penuh penghormatan diserukan kepada mereka, wahai orang yang bertakwa, itulah surga yang telah diwariskan kepadamu, karena apa, yakni amal saleh, yang telah kamu kerjakan."
  }
]