[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menghilangkan apa yang ada di dalam hati para penghuni surga dari segala macam kedengkian dan rasa dendam. Dan termasuk pertanda kesempurnaan nikmat bagi mereka, adalah bahwa sungai-sungai di surga mengalir di bawah kamar-kamar dan tempat-tempat tinggal mereka. Lalu berkatalah para penghuni surga ketika memasukinya, ”segala puji bagi Allah yang telah memberikan taufik kepada kami untuk beramal shalih yang menyebabkan kami memperoleh kenikmatan yang tengah meliputi kami ini. Kami tidak mungkin meperoleh taufik untuk berjalan menuju jalan yang lurus, jikalau Allah tidak menunjuki kami untuk berjalan menuju jalan ini dan tidak memberikan taufik kepada kami untuk tetap teguh di atasnya. Sungguh telah datang para rasul tuhan kami dengan membawa kebenaran berupa berita tentang janji baik bagi orang-orang yang taat kepadaNya dan ancaman bagi orang-orang yang bermaksiat kepadaNya. ”Mereka diseru sebagai bentuk ucapan selamat dan pemuliaan bagi mereka dengan ucapan, ”Bahwa surga itu telah Allah wariskan kepada kalian dengan rahmatNya (kepada kalian) dan dengan apa yang telah kalian perbuat sebelumnya beupa keimanan dan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Salah satu pelengkap kenikmatan yang mereka terima di Surga ialah Allah mencabut rasa benci dan dendam dari dalam hati mereka dan mengalirkan sungai-sungai di bawah tempat tinggal mereka. Dan mereka mengakui karunia yang Allah berikan kepada mereka dengan mengatakan, “Segala puji bagi Allah yang telah membimbing kami untuk melaksanakan amal saleh ini yang membuat kami mendapatkan tempat ini. Dan kami tidak mungkin bisa melaksanakan amal saleh ini dengan kemampuan kami sendiri sekiranya Allah tidak membimbing kami untuk melaksanakannya. Sungguh utusan-utusan Rabb kami telah datang kepada kami dengan membawa kebenaran yang tidak ada keraguan sedikit pun terhadapnya dan membawa janji serta ancaman yang benar.” Dan diserukan kepada mereka, “Sesungguhnya Surga ini, yang pernah diberitahukan oleh para rasul-Ku di dunia, Allah wariskan kepada kalian disebabkan amal saleh yang telah kalian perbuat dengan tujuan untuk mengharap wajah Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Dan Kami akan mengeluarkan kedengkian yang ada dalam hati mereka. Di dalam surga terdapat sungai-sungai yang mengalir di bawah istana-istana dan pepohonannya. Mereka bersyukur kepada Allah dengan mengucapkan: “Segala puji bagi Allah yang telah memberi kami petunjuk menuju agama Islam dan meninggikan derajat kami pada kedudukan ini; kalaulah bukan karena petunjuk dan taufik dari Allah, niscaya kami tidak akan sampai pada derajat ini. Sungguh kami telah membenarkan para rasul tentang janji yang benar yang disampaikan kepada kami. Para malaikat berseru untuk memberi mereka kabar gembira: “Itulah surga yang tinggi yang kalian dapatkan berkat amal kebaikan kalian.” Ali bin Abi Thalib berkata, firman Allah: وَسِيقَ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ إِلَى ٱلْجَنَّةِ زُمَرًا ۖ “Dan orang-orang yang bertakwa kepada Tuhan dibawa ke dalam surga berombong-rombongan (pula).” hingga ketika mereka sampai di depan pintu surga, ternyata mereka melihat sebuah pohon yang pangkalnya mengeluarkan dua mata air; maka mereka menuju salah satu mata air tersebut dan meminum airnya seakan-akan mereka memang diperintah melakukannya; maka keluarlah segala kotoran dan penyakit dari perut mereka. Kemudian mereka menuju mata air lainnya dan memakai airnya untuk berwudhu, seakan-akan mereka memang diperintah melakukannya; maka wajah mereka menjadi bersinar dan berseri-seri, sehingga rambut mereka tidak akan berantakan dan pakaian mereka tidak akan usang. Kemudian mereka memasuki surga. Mereka disambut oleh anak-anak muda yang nampak seperti mutiara yang tersimpan baik. Mereka berkata: “Bergembiralah, karena Allah telah menyiapkan bagimu ini dan itu”. Maka penghuni surga itu melihat pondasi bangunannya dari batu mutiara besar yang berwarna merah, kuning, dan hijau, ia bersinar seperti cahaya kilat; kalaulah Allah tidak menghendaki penglihatannya tetap terjaga, niscaya penglihatannya akan sirna akibat cahaya itu. Kemudian sebagian pemuda itu mendatangi sebagian istri-istri penghuni surga itu, dan berkata: “Bergembiralah, Fulan bin Fulan telah datang -dengan menyebutkan namanya dan nama ayahnya di dunia-. Istri itu bertanya: “Apakah kamu telah melihatnya? Apakah kamu telah melihatnya?” dengan penuh kegembiraan hingga ia berdiri, lalu duduk di depan pintu untuk menyambutnya. Kemudian penghuni surga itu memasuki istananya dan duduk bersandar di atas dipan seraya membaca ayat: الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله \"Segala puji bagi Allah yang telah menunjuki kami kepada (surga) ini. Dan kami sekali-kali tidak akan mendapat petunjuk kalau Allah tidak memberi kami petunjuk.” (diriwayatkan oleh Ibnu Mubarak dalam kitab az-Zuhud, hal. 508-509, no. 1450; dan Abdurrazzaq dalam tafsirnya surat az-Zumar; dan ad-Dhiya al-Maqdisi dalam kitab al-Mukhtarah 2/160 no. 541; dan pentahqiq kitab ini berkata: sanadnya shahih. Dan disebutkan oleh al-Hafidz Ibnu Hajar dalam kitab al-Mathalib al-Aliyah al-Musnadah (ل198 أ-ب , riwayat Ishaq dalam musnadnya; dan dia berkata: Ini adalah hadist shahih yang mencapai derajat marfu’ karena dalam perkara seperti ini tidak boleh menggunakan pendapat akal). Dari Abu Sa’id al-Khudri dan Abu Hurairah, dari Rasulullah, beliau bersabda: “Penyeru akan berseru: ‘Kalian akan selalu sehat tanpa sakit selamanya, hidup tanpa mati selamanya, muda tanpa menua selamanya, dan mendapat kenikmatan selamanya tanpa menderita.’ Hal ini sebagaimana firman Allah: ونودوا أن تلكم الجنة أورثتموها بما كنتم تعملون Dan diserukan kepada mereka: \"ltulah surga yang diwariskan kepadamu, disebabkan apa yang dahulu kamu kerjakan\". (Shahih Muslim 4/2182, no. 2837, kitab: surga, kenikmatannya dan penghuninya. Bab. Kekekalan kenikmatan penghuni surga)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ (Dan Kami cabut segala macam dendam yang berada di dalam dada mereka) Yakni Allah mencabut kedengkian dari hati para ahli surga diantara mereka agar hati mereka menjadi bersih dan dapat saling mencintai sesama. Karena seandainya kedengkian tetap didalam dada mereka sebagaimana ketika mereka di dunia niscaya itu menjadi pengurang kesempurnaan kenikmatan surga. Pendapat lain mengatakan bahwa pencabutan rasa dengki di surga adalah agar mereka tidak saling dengki karena perbedaan derajat diantara mereka. وَقَالُوا۟ الْحَمْدُ لِلّٰهِ الَّذِى هَدَىٰنَا لِهٰذَا (dan mereka berkata: “Segala puji bagi Allah yang telah menunjuki kami kepada (surga) ini) Yakni karena balasan yang besar ini, yaitu berupa kekekalan di surga karena hidayah keimanan dan amal shaleh di dunia. وَمَا كُنَّا لِنَهْتَدِىَ (Dan kami sekali-kali tidak akan mendapat petunjuk) Yakni kami tidak akan mendapat petunjuk dalam hal ini seandainya Allah tidak memberi kami petunjuk. لَقَدْ جَآءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ ۖ (Sesungguhnya telah datang rasul-rasul Tuhan kami, membawa kebenaran) Mereka mengatakan ini karena berharap mendapatkan apa yang telah mereka dapatkan. وَنُودُوٓا۟( Dan diserukan kepada mereka) Sebagai ucapan selamat bagi mereka yang telah mendapatkan kenikmatan dari Allah. أَن تِلْكُمُ الْجَنَّةُ أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ(“ltulah surga yang diwariskan kepadamu, disebabkan apa yang dahulu kamu kerjakan”) Yakni kalian telah mewarisi istana-istana surga karena amalan kalian. Rasulullah bersabda dalam hadist shahih: “tepatilah kebenaran dan dekatilah kesempurnaan, dan katahuilah bahwasannya tidak ada seorangpun dari kalian yang masuk surga dengan amalannya”. Para sahabat bertanya: “Termasuk engkau wahai Rasulullah?”. Beliau bersabda: “termasuk aku, hanya saja Allah meliputi diriku dengan rahmat-Nya”. Andai saja bukan karena karunia dari Allah dengan menjadikannya mampu untuk beramal niscaya ia tidak akan beramal. Rasulullah bersabda: “serulah (kepada para ahli surga) sehatlah kalian dan kalian tidak akan sakit, bersenang-senanglah dan kalian tidak akan sengsara, jadilah muda dan kalian tidak akan menua, dan kekallah dan kalian tidak akan mati”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikanlah ! jika hal ini terjadi pada hati-hati orang-orang shalih, dan naza' menandakan dicabutnya sesuatu dari akarnya, maka bagaimana dengan orang-orang sealain mereka, maka hendaklah kamu mejaga hati dari buruknya sifat dendam ini, karena tidak akan selamat siapapun pada hari dtampakannya semua keburukan hati kecuali : { إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ } \"kecuali orang-orang yang menghadap Allah dengan hati yang bersih\" [ Asy-Syuara' : 89 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Kami telah mengeluarkan apa yang ada dalam dada penghuni surga, yaitu kedengkian yang tersembunyi di dunia, sehingga jiwa mereka bersih dan hal yang menghalangi kenikmatan surga menghilang yang mana sungai-sungai surga mengalir di bawahnya. Mereka berkata: “Syukur dan pujian yang sempurna bagi Allah yang menunjukkan Kami di dunia menuju keimanan dan amal shalih yang akan mendapatkan balasan agung ini. Dan tidaklah kami mendapatkan petunjuk kepadaNya, jika tanpa petunjuk, bimbingan dan pertolonganNya. Sungguh telah datang utusan Allah dengan membawa kebenaran, maka kami mengikuti mereka, dan para malaikat menyeru mereka seraya berkata: “Itulah surga yang diwariskan Allah kepada kalian dengan beramal shalih.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mencabut} mengeluarkan {rasa dengki} dengki dan kemurkaan {dari dalam dada mereka, mengalir di bawah mereka sungai-sungai. Mereka berkata,“Segala puji bagi Allah yang telah menunjukkan kami kepada ini. Kami tidak akan mendapat petunjuk sekiranya Allah tidak memberi petunjuk kepada kami. Sungguh telah datang rasul-rasul dari Tuhan kami dengan membawa kebenaran” Diserukan kepada mereka,“Itulah surga yang telah diwariskan kepada kalian} diberikan untuk kalian {karena apa yang selalu kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43 “dan kami cabut segala macam kedengkian yang berada di dalam dada mereka” ini termasuk kemurahan dan kebaikan Allah kepada penghuni surge. bahwa Allah mencabut dan menghilangkan kebencian dan persaingan yang ada di dalam hati mereka sehingga mereka menjadi bersaudara dan berteman yang saling mencintai Allah, berfirman ”dan kami lenyapkan segala rasa dengki yang berada dalam hati mereka, sedang mereka merasa bersaudara duduk berhadap-hadapan diatas diapan-dipan” Allah menciptakan kemuliaan untuk mereka yang dengannya masing-masing mendapatkan kebahagiaan dan saling ridha satu sama lain. Dengan ini tidak ada saling dengki dan benci karena penyebabnya telah hilang. Dan firmanNya “mengalir dibawah mereka sungai-sungai” yakni mereka dapat memancarkannya sesuka mereka, dimanapun mereka inginkan. Jika mereka mau maka di sela-sela istana, atau dikamar yang tinggi, atau di kebun-kebun surge di bawah pohon-pohon yang rindang, sungai-sungai mengalir tanpa aliran, kenikmatan yang tak berbatas. ”dan” karena itu manakala mereka melihat kenikmatan dan kemuliaan yang Allah berikan kepada mereka, ”mereka berkata, ’segala puji bagi Allah yang telah menunjuki kami kepada (surge) ini” dengan memberi nikmat kepada kami, menuntun hati kami, sehingga hati kami beriman dan tunduk kepada amal kebaikan yang membimbing kami kepada rumah (surge) ini. Allah menjaga iman kami dan amal kami sehingga mengantarkan kami kepada tempat ini, maka alangkah mulianya Rabb yang mulia yang memberi kita nikmat-nikmat dan melimpahkannya, baik lahir maupun batin yang tidak terhitung oleh siapapun (dari hambaNya) “dan kami sekali-kali tidak akan mendapat petunjuk kalau Allah tidak memberi petunjuk” yakni kami tidak mungkin mau menerima petunjuk dan mengikuti rasul-rasulNya seandainya Allah tidak memberikan hidayahNya. ”sesungguhnya telah datang rasul-rasul Rabb kami, membawa kebenaran” yakni ketika mereka bernikmat ria dengan kenikmatan yang pernah dikabarkan oleh para rasul dan ia menjadi haqqul yakin setelah sebelumnya adalah ilmul yaqin, mereka berkata “sungguh kami telah melihat dan membuktikan apa yang diberitakan oleh para rasul bahwa seluruh apa yang mereka bawa tidak ada keraguan padanya. ”dan diserukan kepada mereka” sebagai penghormatan dan penghargaan kepada mereka, ”itulah surge yang diwariskan kepadamu” yakni kamu adalah pewarisnya dan ia menjadi bagianmu, karena neraka adalah bagian orang-orang kafir. Kamu mendapatkannya “disebabkan apa yang dahulu kamu kerjakan” sebagain ulama salaf berkata, ”penghuni surge dengan rahmat Allah, mereka membagi-bagi tempat dan mewarisinya dengan amal shalih dan ia dengan rahmat Allah, bahkan termasuk rahmatNya yang paling tinggi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 43: Sehingga mereka bersaudara dan saling cinta-mencintai. Mereka dapat memancarkannya ke tempat yang mereka inginkan. Mereka dapat mengalirkannya ke sela-sela istana, ke kebun-kebun dan ke lapisan atas, dan sungai-sungai tersebut mengalir tanpa ada parit (lubang galian). Ketika mereka telah menempati tempatnya dan melihat kenikmatan yang Allah berikan. Maksudnya: Dengan memberi nikmat kepada kami, mengilhamkan hati kami, sehingga hati kami beriman dan siap mengerjakan amalan yang menyampaikan kami ke tempat (surga) ini. Allah pula yang menjaga iman dan amal kami hingga kami sampai ke tempat ini, maka segala puji bagi Allah yang telah memulai kami dengan nikmat dan terus melimpahkan kepada kami berbagai nikmat yang nampak maupun yang tersembunyi dalam jumlah yang tidak sanggup kami hitung. Dalam hati kami tidak ada kesiapan menerima petunjuk, jika sekiranya Allah tidak mengaruniakan kepada kami hidayah-Nya dan mengikuti rasul-Nya. Yakni telah terbukti bagi mereka apa yang dijanjikan para rasul. Sebagai ucapan selamat dan penghormatan. Sebagian kaum salaf berkata, “Penghuni surga selamat dari neraka karena maaf dari Allah. Mereka dimasukkan ke surga karena rahmat Allah. Mereka mengambil bagian tempat di surga dan mewarisinya karena amal saleh, dan itu pun termasuk rahmat-Nya, bahkan termasuk bentuk rahmat yang paling tinggi.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 43",
    "description": "Berbeda dengan penghuni neraka yang saling mengutuk, penghuni surga hidup dengan hati yang bersih seperti digambarkan pada ayat ini. Dan kami mencabut rasa dendam dari dalam dada mereka. Kemudian termasuk kesempurnaan nikmat yang mereka peroleh di surga adalah tempat tinggal yang di bawahnya mengalir sungai-sungai. Dan ketika hendak memasuki surga, mereka, penduduk surga, berkata, segala puji bagi Allah yang telah menunjukkan kami untuk beramal saleh di dunia dan teguh untuk memegang ajaran-Nya sehingga kami mendapatkan nikmat masuk ke dalam surga ini. Kami tidak akan mendapat petunjuk untuk menempuh jalan yang lurus ini sekiranya Allah tidak menunjukkan kami. Sesungguhnya rasul-rasul tuhan kami telah datang membawa kebenaran, yakni dengan membawa berita gembira bagi yang senantiasa mengikuti perintahnya, dan peringatan bagi orang yang menentangnya. Kini di surga kami menemukan dalam bentuk nyata apa yang mereka sampaikan itu. Dengan penuh penghormatan diserukan kepada mereka, wahai orang yang bertakwa, itulah surga yang telah diwariskan kepadamu, karena apa, yakni amal saleh, yang telah kamu kerjakan. Dan setelah berada di surga dan bersyukur kepada Allah atas nikmat dan karunia yang diperoleh, para penghuni surga menyeru penghuni-penghuni neraka, wahai penghuni neraka, sungguh, kami kini telah memperoleh secara nyata setelah sebelumnya kami yakini dalam hati apa yang dijanjikan tuhan kepada kami yaitu surga dan berbagai kenikmatan yang ada di dalamnya itu benar. Maka apakah kamu juga telah memperoleh, yakni merasakan, apa yang dijanjikan tuhan kepadamu berupa siksaan dan azab yang pedih bagi para penentang dan pendurhaka itu benar' mereka menjawab, benar, kami telah mendapatkannya dan kini kami benar-benar dalam keadaan tersika. Kemudian penyeru, malaikat, mengumumkan di antara mereka, laknat Allah bagi orang-orang zalim, yaitu orang-orang yang selama hidup di dunia senantiasa menghalang-halangi orang lain dari jalan Allah dengan menempuh berbagai cara, dan, lebih dari itu, mereka pun membelokkannya, yakni menggiring manusia dari kebenaran menuju kesesatan. Mereka itulah yang mengingkari dan tidak mempercayai kehidupan akhirat."
  }
]