[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para penghuni surga berseru Setelah memasukinya kepada penghuni-penghuni nereka dengan berkata kepada mereka, ”sesungguhnya kami telah mendapatkan apa yang di janjikan tuhan kami kepada kami melalui lisan para rasulNya sebagai sebuah kebenaran berupa pemberian balasan baik kepada orang-orang yang taat kepadaNYa, maka apakah kalian (juga) mendapatkan apa yang telah dijanjikan tuhan kalian kepada kalian melalui para rasulNya yang berupa hukuman bagi orang-orang yang bermaksiat kepadaNYa adalah benar adanya?” maka para penghuni neraka menjawab pertanyaan penghuni-penghuni surga dengan berkata, ”betul. sungguh kami telah mendapatkan apa yang sudah di janjikan tuhan kami kepada kami adalah benar adanya.” kemudian satu penyeru mengumumkan di tengah para penduduk surga dan penduduk neraka, ”sesungguhnya laknat Allah atas orang-orang zhalim yang telah berbuat melampaui batas-batas ketentuan Allah, dan ingkar kepada Allah dan rasul-rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Para penduduk Surga berbicara kepada para penduduk Neraka setelah mereka masuk ke tempat masing-masing, “Sungguh kami mendapati Surga yang dijanjikan Rabb kami kepada kami itu benar-benar ada. Kami telah dimasukkan ke dalamnya. Apakah kalian (wahai orang-orang kafir) mendapati Neraka yang Allah ancamkan kepada kalian itu benar adanya?” Orang-orang kafir menjawab, “Sungguh kami mendapati Neraka yang Dia peringatkan kepada kami itu benar-benar ada.” Kemudian seseorang berseru kepada Allah agar Dia mengusir orang-orang yang zalim (kafir) itu dari rahmat-Nya. Karena Dia telah membuka pintu-pintu rahmat-Nya untuk mereka selama di dunia tetapi mereka berpaling darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44-45. Setelah kedua golongan telah menempati tempat mereka masing-masing, para penghuni surga menyeru para penghuni neraka: “Kami benar-benar telah mendapatkan apa yang dijanjikan kepada kami melalui lisan para rasul-Nya berupa kenikmatan yang kekal; apakah kalian juga mendapatkan siksaan yang diancamkan Tuhan kalian kepada kalian?” Maka para penghuni neraka menjawab: “Benar, kami telah mendapatkan itu.” Lalu datanglah penyeru di antara dua golongan itu: “Sesungguhnya laknat Allah pasti didapatkan oleh orang-orang kafir yang telah menghalangi manusia dari mengikuti jalan Allah dan dari masuk ke dalam agama Islam, dan selalu berusaha menjadikan jalan ini penuh liku-liku dengan mendatangkan syubhat-syubhat dan keraguan agar tidak ada yang mau mengikutinya, serta mereka mendustakan pertemuan dengan Allah di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَنَادَىٰٓ أَصْحٰبُ الْجَنَّةِ أَصْحٰبَ النَّارِ (Dan penghuni-penghuni surga berseru kepada Penghuni-penghuni neraka) Yakni para penghuni surga berseru kepada para penghuni neraka setelah semua dari kedua golongan itu telah menetap di tempatnya masing-masing. أَن قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا(Sesungguhnya kami dengan sebenarnya telah memperoleh apa yang Tuhan kami menjanjikannya kepada kami) Yakni kami telah sampai pada kenikmatan yang dijanjikan Allah kepada kami, apakah kalian telah sampai pada azab yang pedih yang dijanjikan Allah kepada kalian? قَالُوا۟ نَعَمْ ۚ (Mereka (penduduk neraka) menjawab: “Betul”) Yakni kami telah mendapati bahwa apa yang dijanjikan Tuhan kami adalah benar. فَأَذَّنَ مُؤَذِّنٌۢ (Kemudian seorang penyeru mengumumkan) Yakni kemudian seorang penyeru menyeru diantara dua golongan. Terdapat pendapat mengatakan penyeru ini merupakan malaikat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu ketika seorang lelaki menemui Sulaiman bin Abdul Malik dan berkata : \"wahai Amirul mukminin sebutkanlah hari panggilan itu!\" lalu beliau berkata : \"dan apakah hari panggilan itu?\" sang lelaki berkata : \"yaitu pada hari yang Allah katakan tentangnya : { فَأَذَّنَ مُؤَذِّنٌ بَيْنَهُمْ أَنْ لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ } \"Kemudian seorang penyeru (malaikat) mengumumkan di antara kedua golongan itu: \"Kutukan Allah ditimpakan kepada orang-orang yang zalim\", Sulaiman kemudian menangis setelah mendengarkan ayat itu dibacakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Setelah keduanya sudah tinggal di masing-masing tempatnya, para penghuni surga menyeru penghuni neraka: “Sungguh kami telah mendapatkan apa yang dijanjikan Tuhan kami melalui lisan para rasul berupa kenikmatan dan kemuliaan yang sesungguhnya, lalu apakah kalian mendapatkan apa yang dijanjikan Tuhan berupa kehinaan dan azab yang pedih?” Mereka berkata: “Benar, kami benar-benar mendapatkannya”. Lalu seseorang menyeru keduanya: “Laknat Allah itu tetap pada orang-orang kafir yang zalim, mereka itu adalah ”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para penghuni surga menyeru para penghuni neraka,“Sungguh, kami telah mendapati bahwa apa yang dijanjikan Tuhan kepada kami itu benar. Apakah kalian telah mendapati bahwa sesuatu yang dijanjikan Tuhan kepadam kalian itu benar” Mereka menjawab,“Benar.” Kemudian penyeru mengumumkan} penyeru menyerukan {di antara mereka,“Laknat Allah bagi orang-orang yang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-45 Allah berfirman setelah menyebutkan bahwa masing-masing kelompok menempati tempat masing-masing. Keduanya mendapatkan kebenaran pahala dan azab yang disampaikaan oleh para rasul dan dinyatakan oleh kitab-kitab, bahwa penduduk surge memanggil penghuni neraka dengan mengatakan \"sesungguhnya kami telah mendapatkan apa yang dijanjikan tuhan kami kepada kami adalah benar\" ketika kami dijanjikan atas keimanan dan amal sholeh kami dengan surge maka kami masuk dan kami melihat apa yang telah Allah sifatkan kepada kami \"apakah kalain medapatkan apa yang dijanjikan kepada kalian juga benar” akibat kekufuran dan kemaksiatan. ”mereka (penduduk neraka) menjawab’betul’. ” Yakni kami benar-benar mendapatkannya. Maka terbuktilah bagi seluruh makhluk dengan bukti yang tidak ada keraguan padanya akan kebenaran janji Allah Dan siapakah yang lebih jujur ucapannya daripada Allah? Keraguan dan kebimbangan telah lenyap dari mereka. Perkaranya telah menjadi haqqul yaqin. Orang-orang mukmin bangga dan berbahagia dengan janji Allah, sementara orang-orang kafir berputus asa dari kebaikan dan mereka mengakui bahwa mereka berhak mendapatkan azab. ”kemudian seorang penyeru (malaikat) mengumumkan dianatara kedua golongan itu “ yakni diantara penduduk surga dan penghuni neraka dengan berkata “kutukan Allah” pengusiran dan penjauhan dari segala kebaikan, ”ditimpakan kepada orang-orang yang zhalim” karena Allah telah membuka pintu rahmatNya untuk mereka, tetapi mereka berpaling darinya karena kezhaliman, dan mereka menghalang-halangi diri mereka mereka sendiri dan juga orang lain dari jalan Allah, maka mereka itu sesat dan menyesatkan. Allah menginginkan jalan itu lurus dan mengarahkan para penitinya kepadanya, sementara mereka menginginkannya “menjadi bengkok” menyimpang dan justru mengahalang-halangi dari jalan lurus. ”dan mereka kafir kepada kehidupan akhirat” dan inilah yang menyebabkan mereka menyimpang dari jalan yang lurus dan gemar menerima keinginan syahwat jiwa yang diharamkan adalah karena ketidak imanan mereka kepada hari kebangkitan. tidak takut kepada azab dan tidak mengharapkan pahala. mafhum dari seruan malaikat ini adalah bahwa Rahmat Allah melimpah kepada orang-orang beriman, kebaikanNya meliputi dan menaungi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 44: Untuk membuat mereka mengakui atau mencela mereka. Berupa pahala dan surga bagi orang yang beriman dan beramal saleh. Berupa siksa dan neraka bagi orang yang kafir dan berbuat maksiat. Ketika itu orang-orang kafir sudah putus asa dari semua kebaikan dan mereka mengakui bahwa mereka berhak memperoleh azab. Yakni dijauhkan dari semua kebaikan. Karena ketika Allah Ta’ala membukakan untuk mereka pintu-pintu rahmat-Nya, namun mereka malah berpaling darinya, bahkan mereka menghalangi orang lain dari jalan Allah, sehingga mereka sesat dan menyesatkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 44",
    "description": "Dan setelah berada di surga dan bersyukur kepada Allah atas nikmat dan karunia yang diperoleh, para penghuni surga menyeru penghuni-penghuni neraka, wahai penghuni neraka, sungguh, kami kini telah memperoleh secara nyata setelah sebelumnya kami yakini dalam hati apa yang dijanjikan tuhan kepada kami yaitu surga dan berbagai kenikmatan yang ada di dalamnya itu benar. Maka apakah kamu juga telah memperoleh, yakni merasakan, apa yang dijanjikan tuhan kepadamu berupa siksaan dan azab yang pedih bagi para penentang dan pendurhaka itu benar' mereka menjawab, benar, kami telah mendapatkannya dan kini kami benar-benar dalam keadaan tersika. Kemudian penyeru, malaikat, mengumumkan di antara mereka, laknat Allah bagi orang-orang zalim, yaitu orang-orang yang selama hidup di dunia senantiasa menghalang-halangi orang lain dari jalan Allah dengan menempuh berbagai cara, dan, lebih dari itu, mereka pun membelokkannya, yakni menggiring manusia dari kebenaran menuju kesesatan. Mereka itulah yang mengingkari dan tidak mempercayai kehidupan akhirat"
  }
]