[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu adalah orang-orang yang dahulu berpaling dari jalan Allah yang lurus, menghalang-halangi manusia untuk menapaki jalanNya, dan mencari segala cara agar jalan tersebut menjadi bengkok sehingga tidak ada yang dapat mengenalnya dengan baik seorangpun. Dan mereka juga orang-orang yang ingkar terhadap akhirat dan apa yang ada di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Mereka itulah orang-orang yang zalim. Yaitu orang-orang yang dengan sadar berpaling dari jalan Allah dan mendorong orang lain untuk berpaling darinya, serta berharap agar jalan yang benar berubah menjadi bengkok supaya tidak dilalui oleh manusia. Dan mereka ingkar terhadap akhirat dan tidak bersiap-siap untuk menghadapinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. الَّذِينَ يَصُدُّونَ عَن سَبِيلِ اللهِ ((yaitu) orang-orang yang menghalang-halangi (manusia) dari jalan Allah) Yang menghalangi manusia dari menempuh jalan kebenaran. وَيَبْغُونَهَا عِوَجًا(dan menginginkan agar jalan itu menjadi bengkok) Yakni menjadikan orang-orang lari dari jalan tersebut, dan menuduh kelurusan jalan ini dengan mengatakan bahwa jalan ini bukanlah jalan kebenaran, adapun jalan kebenaran adalah jalan yang mereka tempuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. (Yaitu) orang-orang yang mencegah manusia untuk mengikuti jalan Allah, syariatNya, dan masuk Islam. Mereka menginginkan agar jalan yang dilewti itu menyimpang, bukan lurus, mereka beranggapan bahwa jalan Allah itu salah dan bathil sedangkan mereka itu di atas kebenaran. Dan terhadap pertemuan dengan Allah di akhirat itu mereka adalah orang-orang yang ingkar dan mendustakannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menghalang-halangi} menghalangi manusia {dari jalan Allah serta menginginkan jalan itu menjadi bengkok} dan menginginkan kebengkokan pada jalan itu {dan mereka itu orang-orang yang mengingkari akhirat."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-45 Allah berfirman setelah menyebutkan bahwa masing-masing kelompok menempati tempat masing-masing. Keduanya mendapatkan kebenaran pahala dan azab yang disampaikaan oleh para rasul dan dinyatakan oleh kitab-kitab, bahwa penduduk surge memanggil penghuni neraka dengan mengatakan \"sesungguhnya kami telah mendapatkan apa yang dijanjikan tuhan kami kepada kami adalah benar\" ketika kami dijanjikan atas keimanan dan amal sholeh kami dengan surge maka kami masuk dan kami melihat apa yang telah Allah sifatkan kepada kami \"apakah kalain medapatkan apa yang dijanjikan kepada kalian juga benar” akibat kekufuran dan kemaksiatan. ”mereka (penduduk neraka) menjawab’betul’. ” Yakni kami benar-benar mendapatkannya. Maka terbuktilah bagi seluruh makhluk dengan bukti yang tidak ada keraguan padanya akan kebenaran janji Allah Dan siapakah yang lebih jujur ucapannya daripada Allah? Keraguan dan kebimbangan telah lenyap dari mereka. Perkaranya telah menjadi haqqul yaqin. Orang-orang mukmin bangga dan berbahagia dengan janji Allah, sementara orang-orang kafir berputus asa dari kebaikan dan mereka mengakui bahwa mereka berhak mendapatkan azab. ”kemudian seorang penyeru (malaikat) mengumumkan dianatara kedua golongan itu “ yakni diantara penduduk surga dan penghuni neraka dengan berkata “kutukan Allah” pengusiran dan penjauhan dari segala kebaikan, ”ditimpakan kepada orang-orang yang zhalim” karena Allah telah membuka pintu rahmatNya untuk mereka, tetapi mereka berpaling darinya karena kezhaliman, dan mereka menghalang-halangi diri mereka mereka sendiri dan juga orang lain dari jalan Allah, maka mereka itu sesat dan menyesatkan. Allah menginginkan jalan itu lurus dan mengarahkan para penitinya kepadanya, sementara mereka menginginkannya “menjadi bengkok” menyimpang dan justru mengahalang-halangi dari jalan lurus. ”dan mereka kafir kepada kehidupan akhirat” dan inilah yang menyebabkan mereka menyimpang dari jalan yang lurus dan gemar menerima keinginan syahwat jiwa yang diharamkan adalah karena ketidak imanan mereka kepada hari kebangkitan. tidak takut kepada azab dan tidak mengharapkan pahala. mafhum dari seruan malaikat ini adalah bahwa Rahmat Allah melimpah kepada orang-orang beriman, kebaikanNya meliputi dan menaungi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 45: Dari agama Allah. Inilah yang membuat mereka menyimpang dari jalan yang lurus dan mengikuti hawa nafsu, yakni karena mengingkari kehidupan akhirat, tidak beriman kepada kebangkitan, tidak takut kepada siksa dan tidak berharap pahala di hari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 45",
    "description": "Dan setelah berada di surga dan bersyukur kepada Allah atas nikmat dan karunia yang diperoleh, para penghuni surga menyeru penghuni-penghuni neraka, wahai penghuni neraka, sungguh, kami kini telah memperoleh secara nyata setelah sebelumnya kami yakini dalam hati apa yang dijanjikan tuhan kepada kami yaitu surga dan berbagai kenikmatan yang ada di dalamnya itu benar. Maka apakah kamu juga telah memperoleh, yakni merasakan, apa yang dijanjikan tuhan kepadamu berupa siksaan dan azab yang pedih bagi para penentang dan pendurhaka itu benar' mereka menjawab, benar, kami telah mendapatkannya dan kini kami benar-benar dalam keadaan tersika. Kemudian penyeru, malaikat, mengumumkan di antara mereka, laknat Allah bagi orang-orang zalim, yaitu orang-orang yang selama hidup di dunia senantiasa menghalang-halangi orang lain dari jalan Allah dengan menempuh berbagai cara, dan, lebih dari itu, mereka pun membelokkannya, yakni menggiring manusia dari kebenaran menuju kesesatan. Mereka itulah yang mengingkari dan tidak mempercayai kehidupan akhirat. Dan di antara keduanya, yakni di antara penghuni surga dan neraka, ada tabir, dinding kokoh yang memisahkan mereka (lihat: surah ala'adid/57: 13), dan di atas dinding tersebut terdapat a'ra'f yaitu tempat yang tertinggi, yang di atasnya ada orang-orang yang kebaikannya sama dengan keburukannya sehingga mereka masih menunggu keputusan Allah atas mereka, yang setiap penduduk surga dan neraka saling mengenal orang-orang tersebut, masing-masing dengan tanda-tandanya. Calon penduduk surga diketahui dengan wajahnya yang putih lagi bercahaya, sementara calon penghuni neraka dikenal dengan wajahnya yang hitam. Ketika mereka melihat surga dan penghuninya, mereka menyeru penghuni surga, sala'mun 'alaikum (salam sejahtera bagimu). Mereka belum dapat masuk surga karena masih menunggu keputusan Allah atas mereka, tetapi mereka ingin segera masuk."
  }
]