[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara para penghuni surga dan penduduk neraka Terdapat batas pemisah besar yang disebut dengan al-a’raf. Di atas batas pemisah ini ada orang-orang yang mengenal para penghuni surga dan para penduduk neraka melalui tanda-tanda mereka masing-masing, seperi rona muka putih para penghuni surga dan gelapnya wajah-wajah penduduk neraka. Orang-orang tersebut adalah orang-orang yang amal kebaikan dan perbuatan buruk mereka seimbang, mereka mengharapkan rahmat dari Allah . dan orang-orang yang berada di atas al-‘araf ini memanggil-manggil penghuni surga dengan sambutan selamat datang dengan berkata kepada mereka, ”salamun ‘alaikum (semoga keselamatan terlimpahkan kepada kalian semua).” Mereka ini belumlah bisa masuk kedalam surga, namun mereka amat berharap untuk memasukinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan di antara dua golongan itu -yakni penduduk Surga dan penduduk Neraka- terdapat dinding pemisah yang bernama Al-A’rāf. Di atas dinding pemisah itu terdapat orang-orang yang amal baiknya setara dengan amal buruknya. Mereka bisa mengenali penduduk Surga dengan melihat tanda-tandanya, seperti wajah mereka yang putih. Dan mereka juga bisa mengenali penduduk Neraka dengan melihat tanda-tandanya, seperti wajah mereka yang hitam. Lalu orang-orang itu menyapa para penduduk Surga dengan nada hormat, “Salāmun 'alaikum.” Penduduk Surga itu belum masuk ke dalamnya, dan mereka sedang berharap untuk masuk Surga dengan rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46-47. Di antara penghuni surga dan penghuni neraka terdapat pagar besar yang disebut dengan, al-A’raf. Di atas pagar ini terdapat sekelompok manusia yang mengetahui ciri-ciri tertentu dari penghuni surga maupun penghuni neraka. Penghuni al-A’raf ini berseru kepada para penghuni surga: “Selamat bagi kalian.” Mereka belum bisa memasuki surga, meski mereka sangat menginginkannya. Dan ketika penglihatan mereka dialihkan kepada para penghuni neraka, mereka berseru dengan penuh ketakutan: “Ya Tuhan kami, janganlah Engkau kumpulkan kami bersama orang-orang yang zalim tersebut.” Ibnu ‘Abbas berkata: Penyebutan ‘para penghuni al-A’raf’ berdasarkan apa yang Allah sebutkan. Dan makna al-A’raf yakni pagar yang ada di antara para penghuni neraka dan penghuni surga, sebagai pembatasnya. Allah berfirman: وإذا صرفت أبصارهم تلقاء أصحاب النار قالوا ربنا لا تجعلنا مع القوم الظالمين Dan apabila pandangan mereka dialihkan ke arah penghuni neraka, mereka berkata: \"Ya Tuhan kami, janganlah Engkau tempatkan kami bersama-sama orang-orang yang zalim itu\". (Kitab az-Zuhd no. 200, diriwayatkan oleh Imam at-Thabari dari jalur Manshur. Dan hadist ini juga disebutkan oleh Imam Ibnu Katsir, dan berkata: Hadist ini juga diriwayatkan oleh Ibnu Abi Hatim dari ayahnya, dari Yahya bin Mughirah, dari Juraij; dan diriwayatkan oleh Sufyan ats-Tsauri dari Habib bin Abi Tsabit, dari Mujahid, dari Abdullah bin Harits dari ucapannya; dan ini lebih shahih. Diriwayatkan pula oleh Mujahid dan Dhahhak selain itu)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَبَيْنَهُمَا حِجَابٌ ۚ (Dan di antara keduanya ada batas) Yakni antara dua golongan, penghuni surga dan neraka. Atau maknanya adalah antara surga dan neraka terdapat pagar pembatas. وَعَلَى الْأَعْرَافِ رِجَالٌ (dan di atas A’raaf itu ada orang-orang) Makna (الأعراف) yakni pinggiran pagar antara surga dan neraka. Adapun makna (الأعراف) secara bahasa yaitu tempat-tempat yang tinggi. Para ulama berbeda pendapat tentang orang-orang yang berada di A’raf ini. Dikatakan: mereka adalah para syuhada’. Pendapat lain mengatakan: mereka adalah orang-orang beriman yang mulia, mereka telah selesai dalam urusan mereka dan menyibukkan diri dalam membantu urusan orang lain, pendapat ini dikemukakan oleh Imam Mujahid. Pendapat lain mengatakan mereka adalah orang-orang yang kebaikannya sebanding dengan keburukannya, amalan mereka menghalangi mereka untuk masuk surga, kemudian mereka memasuki surga berkat karunia dan rahmat Allah, mereka adalah orang-orang yang terakhir masuk surga. Pendapat lain mengatakan mereka adalah para malaikat yang diberi tugas menjaga pagar pembatas tersebut, yang memisahkan orang-orang kafir dari orang-orang beriman sebelum memasukkan mereka kedalam surga atau neraka. يَعْرِفُونَ كُلًّۢا بِسِيمَىٰهُمْ ۚ (yang mengenal masing-masing dari dua golongan itu dengan tanda-tanda mereka) Dengan tanda-tanda yang ada pada mereka seperti wajah yang putih atau hitam. وَنَادَوْا۟ أَصْحٰبَ الْجَنَّةِ (Dan mereka menyeru penduduk surga) Yakni para penghuni A’raf menyeru para penghuni surga ketika melihat mereka. أَن سَلٰمٌ عَلَيْكُمْ ۚ (“Salaamun ‘alaikum”) Sebagai penghormatan, pemuliaan, dan kabar gembira bagi mereka. لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ (Mereka belum lagi memasukinya, sedang mereka ingin segera (memasukinya)) Yakni para penghuni A’raf belum memasuki surga, akan tetapi mereka berharap sekali untuk memasukinya setelah melihat karunia dan rahmat Allah yang diberikan kepada para ahli surga dan melihat bahwa rahmat Allah mengalahkan kemurkaan-Nya. Diriwayatkan bahwa Rasulullah bersabda: “ketika Rabb semesta alam telah selesai memberi keputusan diantara para hamba-Nya Dia berfirman kepada para penghuni A’raf: “kalian adalah hamba-hamba-Ku yang Aku bebaskan, maka pergilah ke surga sesuka kehendak kalian”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Di antara penghuni surga dan neraka itu ada sekat atau tembok penghalang agar tidak terhubung dengan penghuni neraka. Dan di A’raf (yaitu bagian dinding tertinggi) itu ada laki-laki yang kebaikan dan keburukannya sama) Mereka mengetahui tanda-tanda dari masing-masing penghuni surga dan neraka. Para penghuni A’raf itu menyeru kepada penduduk surga ketika melihat mereka dengan berkata: “Kesejahteraan atas kalian, yaitu salam hormat atas kalian” akan tetap mereka (penghuni A’raf) sangat ingi masuk surga ketika melihat keutamaan dan rahmat Allah. Dan rahmatNya itu lebih banyak daripada kemarahanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara keduanya} para penghuni surga dan neraka {ada batas pemisah} pembatas yang menjulang tinggi yang dinamai Al-A’raf {dan di atas Al-A’raf itu ada orang-orang} kaum yang sama timbangan kebaikan dan keburukannya {yang saling mengenal dengan tandanya mereka masing-masing} tanda mereka {Mereka menyeru para penghuni surga,“Semoga keselamatan tercurah kepada kalian.” Mereka belum dapat memasukinya, padahal mereka sangat menginginkan} bercita-cita untuk memasukinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46 Yakni diantara penduduk surge dengan penghuni neraka terdapat pembatas yang bernama al’araf, tidak dari surge tidak pula dari neraka, menghadap ke surge dan neraka. siapa yang disitu dapat melihat keadaan kedua golongan ini, diatas pembatasnya itu terdapat orang-orang yang mengenal masing-masing dari penduduk surga dan penghuni neraka \"dengan tanda-tanda mereka\", yakni dengan ciri khas yang dengannya mereka dibedakan. Jika mereka melihat kepada penduduk surge, mereka berseru kepada mereka, ”saalamun alaikum (salam sejahtera atas kalian)” yakni mereka memberi hormat dan salam kepada mereka akan tetapi mereka sampai saat itu belum masuk surge, walaupun demikian mereka sangat berhasrat untuk memasukinya dan Allah tidak menjadikan hasrat di dalam hati mereka kecuali karena kemuliaanNya yang Dia inginkan untuk mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 46: Ada yang berpendapat, bahwa tabir di sini adalah pagar A’raaf. Namun ada pula yang berpendapat, bahwa tabir tersebut adalah A’raaf yang letaknya tinggi di atas kedua golongan (penghuni surga dan neraka). A'raaf artinya tempat yang tertinggi di antara surga dan neraka. Mereka adalah orang-orang yang kebaikan dengan keburukannya seimbang. Kebaikan mereka tidak membuat masuk surga, dan keburukannya tidak membuat masuk neraka, sehingga mereka tinggal beberapa lama yang dikehendaki Allah di atas A’raaf, namun kemudian Allah memasukkan mereka ke dalam surga karena rahmat-Nya, di mana rahmat-Nya mengalahkan kemurkaan-Nya. Hakim meriwayatkan dari Hudzaifah ia berkata, “Ketika mereka (penghuni A’raaf) dalam keadaan seperti itu, tiba-tiba Tuhan mereka muncul dan berfirman, “Bangunlah! Masuklah kamu ke surga. Sungguh, Aku telah mengampuni kamu.” Penghuni surga dan neraka. Ada yang mengatakan, bahwa tandanya adalah dengan putihnya wajah orang-orang yang beriman, dan hitamnya wajah orang-orang kafir, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 46",
    "description": "Dan di antara keduanya, yakni di antara penghuni surga dan neraka, ada tabir, dinding kokoh yang memisahkan mereka (lihat: surah ala'adid/57: 13), dan di atas dinding tersebut terdapat a'ra'f yaitu tempat yang tertinggi, yang di atasnya ada orang-orang yang kebaikannya sama dengan keburukannya sehingga mereka masih menunggu keputusan Allah atas mereka, yang setiap penduduk surga dan neraka saling mengenal orang-orang tersebut, masing-masing dengan tanda-tandanya. Calon penduduk surga diketahui dengan wajahnya yang putih lagi bercahaya, sementara calon penghuni neraka dikenal dengan wajahnya yang hitam. Ketika mereka melihat surga dan penghuninya, mereka menyeru penghuni surga, sala'mun 'alaikum (salam sejahtera bagimu). Mereka belum dapat masuk surga karena masih menunggu keputusan Allah atas mereka, tetapi mereka ingin segera masuk. Dan apabila pandangan mereka dialihkan ke arah penghuni neraka,"
  }
]