[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila pandangan mata orang-orang yang berada di atas al-‘araf di alihkan ke para sisi penduduk neraka, mereka mengucapkan, ”wahai tuhan kami, janganlah engkau menjadikan kami bersama kumpulan orang-orang yang zhalim akibat perbuatan syirik dan kekafiran mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Apabila pandangan orang-orang yang ada di Al-A'rāf dialihkan ke arah para penduduk Neraka dan menyaksikan beratnya azab yang mereka terima, mereka berdoa kepada Allah, “Wahai Rabb kami! Jangan Engkau kumpulkan kami bersama orang-orang yang zalim lantaran berbuat kufur dan menyekutukan-Mu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَإِذَا صُرِفَتْ أَبْصٰرُهُمْ تِلْقَآءَ أَصْحٰبِ النَّارِ قَالُوا۟ (Dan apabila pandangan mereka dialihkan ke arah penghuni neraka mereka berkata) Yakni para penghuni A’raf berkata. رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِينَ (“Ya Tuhan kami, janganlah Engkau tempatkan kami bersama-sama orang-orang yang zalim itu”) Mereka memohon kepada Allah agar tidak termasuk golongan orang-orang zalim."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pada lafazh { صرفت } menggambarkan bahwa mereka dipaksa untuk melihat kepada penghuni neraka; karena keadaan ketika itu sangat menakutkan, dan pemandangan neraka benar-benar buruk dan menakutkan, tidak satupun yang akan melihat kepadanya dengan oilihan sendiri, sedangkan mereka yang menghuni neraka itu menyeru kepada penghuni surga : { وَنَادَوْا أَصْحَابَ الْجَنَّةِ } \"Dan mereka menyeru penduduk surga: “Salaamun ‘alaikum\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Ketika pandangan penduduk A’raf itu diubah ke arah penghuni neraka dan melihat azab yang ada di dalamnya, dengan mengiba mereka berkata: “Wahai Tuhan kami, janganlah Engkau jadikan kami bersama dengan kaum yang menzalimi diri sendiri itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila pandangan mereka dialihkan} dipindah {ke arah} arah {penghuni neraka, mereka berkata,“Ya Tuhan kami, janganlah Engkau tempatkan kami bersama kaum yang zalim itu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47 “dan apabila pandangan mereka dialihkan ke arah penghuni neraka” mereka melihat pemandangan yang mengerikan dan ketakutan yang mencekam. ”mereka berkata ’ya Rabb kami, janganlah engkau tempatkan kami bersama-sama orang-orang yang zhalim itu” jika orang-orang yang ada di al-araf melihat penduduk surge, mereka berhasrat bisa bersama mereka di surge, memberi hormat dan salam kepada mereka. Manakala pandangan mereka tertuju secara tidak sengaja kepada penghuni neraka, maka mereka memohon perlindungan kepada Allah dari keadaan buruk mereka secara umum."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 47: Mereka melihat pemandangan yang mengerikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 47",
    "description": "Dan apabila pandangan mereka dialihkan ke arah penghuni neraka, dan orang-orang di atas a'ra'f, yaitu tempat yang tertinggi, menyeru penghuni neraka yang dahulu mendustakan ayat Allah dan rasul-Nya dan senantiasa membanggakan harta bendanya, penghuni neraka tersebut adalah orang-orang yang mereka kenal dengan tanda-tandanya, mereka berkata, wahai penghuni neraka, rasakanlah pedihnya azab Allah. Harta yang kamu kumpulkan dan apa yang kamu sombongkan ketika di dunia, ternyata tidak ada manfaatnya sedikit pun buat kamu."
  }
]