[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-0rang yang berada di al-araf menyeru lelaki-lelaki dari tokoh-tokoh orang-orang kafir yang tengah berada di dalam neraka, yang mereka mengenali mereka melalui tanda-tanda khusus yang membedakan tokoh-tokoh itu. Mereka berkata kepada para tokoh tersebut, ”tidak bermanfaat bagi kalian apa yang sudah dapat kalian kumpulkan berupa harta kekayaan dan pengikut-pengikut di alam dunia. Dan tidak bermanfaat kesombongan kalian untuk beriman kepada Allah dan menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Orang-orang yang tinggal di Al-A’rāf itu berseru kepada sejumlah penduduk Neraka yang mereka kenali melalui tanda-tanda mereka, seperti wajah mereka yang hitam dan mata mereka yang berwarna biru, seraya berkata, “Harta benda dan teman yang banyak tidak bermanfaan untuk kalian, demikian juga halnya dengan sikap kalian yang berpaling dari kebenaran karena kesombongan dan keangkuhan tidak berguna bagi kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Dan para penghuni al-A’raf berseru kepada para penghuni neraka yang mereka ketahui dengan ciri-ciri tertentu: “Apa manfaat dari pasukan dan harta yang kalian kumpulkan di dunia, serta kesombongan kalian sehingga enggan untuk beriman?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَنَادَىٰٓ أَصْحٰبُ الْأَعْرَافِ رِجَالًا (Dan orang-orang yang di atas A’raaf memanggil beberapa orang) Yakni dari golongan orang-orang kafir. | يَعْرِفُونَهُم بِسِيمَىٰهُمْ(yang mereka mengenalnya dengan tanda-tandanya) Yakni dengan ciri-ciri mereka. مَآ أَغْنَىٰ عَنكُمْ جَمْعُكُمْ (Harta yang kamu kumpulkan, tidaklah memberi manfaat kepadamu) Yakni yang kalian kumpulkan untuk menghalangi jalan Allah. وَمَا كُنتُمْ تَسْتَكْبِرُونَ(dan apa yang selalu kamu sombongkan) Dan kesombongan kalian tidak memberi manfaat untuk kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Para penghuni A’raf itu berkata kepada para lelaki dari penghuni neraka yang memiliki tanda pembeda dengan yang lainnya: “Harta yang telah kalian kumpulkan itu tidak kalian butuhkan di neraka, tidak pula penolakan kalian dari jalan Allah, dan keengganan kalian untuk beriman”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang di atas Al-A’raf menyeru orang-orang yang mereka kenal dengan tanda-tanda mereka sambil berkata,“Tidak ada manfaatnya bagi kalian yang kalian kumpulkan} sesuatu yang kalian perbanyak {dan apa yang selalu kalian sombongkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48 Kemudian Allah menyebutkan yang khusus setelah yang umum. Dia berfirman ”dan orang-orang yang diatas A’raf memanggil beberapa orang (pemuka-pemuka orang kafir) yang mereka mengenalnya dengan tanda-tandanya”. Mereka adalah penduduk neraka, mereka di dunia memiliki kebanggaan, kehormatan, harta, dan anak-anak. Maka orang-orang al-A’raf berkata kepada mereka ketika melihat mereka terbenam dalam azab tanpa seorangpun penolong dan pembantu. ”harta yang kamu kumpulkan dan apa yang selalu kamu sombongkan itu tidaklah memberi manfaat kepadamu” yakni, bahwa harta di dunia, yang dengannya kamu menolak hal-hal yang tidak kamu inginkan dan dengannya kamu mendapatkan apa yang kamu inginkan di dunia, pada hari ini ia lenyap tak berbekas, tak berguna bagimu sedikitpun bagimu. Begitu pula kesombongan menolak kebenaran dan kesombonganmu kepada orang yang membawanya dan mengikutinya, sama sekali tidak berguna bagimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 48: Dari kalangan penghuni neraka. Penghuni A’raaf berkata seperti pada ayat di atas, kepada mereka saat melihat masing-masing mereka diazab tanpa ada yang menolong dan melindungi. Mereka ketika di dunia memiliki kebesaran, kemuliaan, harta dan anak, dan semua itu tidak bermanfaat apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 48",
    "description": "Dan orang-orang di atas a'ra'f, yaitu tempat yang tertinggi, menyeru penghuni neraka yang dahulu mendustakan ayat Allah dan rasul-Nya dan senantiasa membanggakan harta bendanya, penghuni neraka tersebut adalah orang-orang yang mereka kenal dengan tanda-tandanya, mereka berkata, wahai penghuni neraka, rasakanlah pedihnya azab Allah. Harta yang kamu kumpulkan dan apa yang kamu sombongkan ketika di dunia, ternyata tidak ada manfaatnya sedikit pun buat kamu. Ketika pembicaraan tentang golongan mukmin yang dulu mereka anggap lemah, miskin, dan hina, penghuni a'ra'f mengajukan pertanyaan dengan nada mencela dan menghina, wahai penghuni neraka! itukah orang-orang yang kamu telah berani bersumpah, berlagak sombong, dan menghina mereka bahwa mereka tidak akan mendapat rahmat Allah' kenyataannya sekarang, merekalah yang beruntung dan mendapatkan rahmat Allah. Kemudian sesudah percakapan itu Allah mempersilakan penghuni a'ra'f masuk ke dalam surga, sesudah tertahan sementara di tempat itu. Allah berfirman, masuklah kamu ke dalam surga! tidak ada rasa takut padamu dan kamu tidak pula akan bersedih hati."
  }
]