[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang lemah dan miskin dari penghuni surga itu yang dahulu kalian bersumpah di dunia bahwa Allah tidak akan mencurahkan rahmat kepada merekap pada hari kiamat, dan tidak akan memasukan mereka ke dalam surga?” (Allah berfirman), ”masuklah kalian ke dalam surga wahai para penghuni al-araf. Sungguh telah diampuni dosa-dosa kalian. Tidak ada lagi ketentuan atas kalian terhadap siksaan Allah dan kalian tidak perlu bersedih atas apa yang terlewatkan bagi kalian dari kenikmatan-kenikmatan duniawi.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Allah berfirman seraya menegur keras terhadap orang-orang kafir, “Apakah mereka ini orang-orang yang kalian bersumpah bahwa mereka tidak akan mendapatkan rahmat dari Allah?” Dan Allah berkata kepada orang-orang mukmin, “Masuklah kalian -wahai orang-orang mukmin- ke dalam Surga. Tidak ada kekhawatiran sedikit pun terhadap masa depan kalian. Dan kalian pun tidak bersedih hati atas kekayaan duniawi yang luput dari kalian setelah kalian berjumpa dengan kenikmatan yang abadi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Allah mengingkari dan mengolok para penghuni neraka: “Apakah itu orang-orang beriman yang lemah yang dahulu kalian hina di dunia, yang kalian bersumpah bahwa mereka tidak akan Allah masukkan ke dalam surga? Masuklah ke dalam surga wahai para penghuni al-A’raf, tidak ada ketakutan bagi kalian dari azab, dan tidak pula kesedihan atas kenikmatan dunia yang kalian tinggalkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. أَهٰٓؤُلَآءِ الَّذِينَ أَقْسَمْتُمْ لَا يَنَالُهُمُ اللهُ بِرَحْمَةٍ ۚ (“Itukah orang-orang yang kamu telah bersumpah bahwa mereka tidak akan mendapat rahmat Allah?”) Mereka mengatakan kepada orang-orang kafir dan mengarahkan ucapan ini bagi orang-orang beriman yang telah masuk surga. ادْخُلُوا۟ الْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَآ أَنتُمْ تَحْزَنُونَ(“Masuklah ke dalam surga, tidak ada kekhawatiran terhadapmu dan tidak (pula) kamu bersedih hati”) Ini merupakan perkataan para penghuni A’raf, yakni mereka mengatakan kepada orang-orang beriman: “masuklah kalian ke dalam surga”. Pendapat lain mengatakan ucapan ini adalah perkataan yang ditujukan kepada para penghuni A’raf itu sendiri, Allah memasukkan mereka kedalam surga dengan rahmat-Nya. As-Suddiy berkata: “para penghuni A’raf mengenali manusia dengan ciri-ciri mereka; mengenali ahli neraka dengan wajah mereka yang hitam dan mengenali ahli surga dengan wajah mereka yang putih, apabila ada sekelompok manusia yang melewati mereka untuk dibawa ke surga mereka berkata: “Salamun Alaikum”. apabila ada sekelompok manusia yang melewati mereka untuk dibawa ke neraka mereka berkata: “Ya Tuhan Kami, janganlah Engkau jadikan kami bersama golongan orang-orang yang zalim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Mereka berkata kepada orang-orang kafir, seperti Abu Jahal dan Walid bin Mughirah: “Itukah orang-orang mukmin lemah yang tertindas seperti Bilal dan Amar bin Yasir yang kalian sumpai di dunia bahwa mereka tidak akan menerima rahmat Allah karena kefakiran dan kelemahan mereka serta sedikitnya pengikut mereka?” Para penghuni A’raf itu berkata kepada orang-orang muslim: “Masuklah ke dalam surga, tidak ada ketakutan bagi kalian atas azab, dan tidak pula kalian bersedih atas apa yang telah lewat dan menimpa kalian di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itukah orang-orang yang kalian telah bersumpah} bersumpah {bahwa mereka tidak akan diberi rahmat oleh Allah. “Masuklah kalian ke dalam surga! Tidak ada rasa takut pada kalian dan kalian juga tidak akan bersedih.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49 kemudian mereka menunjuk kepada orang-orang dari penduduk surge yang dahulu di dunia adalah orang-orang miskin papa yang dilecehkan oleh penghuni neraka. Mereka berkata kepada penghuni neraka “itukah orang-orang” yang di masukkan Allah ke surga “yang kamu telah bersumpah bahwa mereka tidak akan mendapat rahmat Allah“ sebagai pelecehan dan penghinaan kepada mereka serta kesombongan dari kalian. Kamu telah melanggar sumpahmu dan ternyata Allah memperlakukan mereka tidak seperti yang kamu kira. ”(kepada orang mukmin itu dikatakan) ‘masuklah kedalam surga“ karena amal yang dulu kamu kerjakan. Yakni dikatakan kepada orang-orang lemah itu sebagai penghormatan dan penghargaan kepada mereka. ”Masuklah ke surga dengan amal shalihmu” “tidak ada kekhawatiran terhadapmu”, terhadap hal-hal yang diinginkan di masa depan. ”dan tidak (pula) kamu bersedih hati” atas perkara yang telah berlalu. Justru kalian akan merasa aman, tenang dan berbahagia dengan segala kebaikan. Ini seperti firman Allah “sesungguhnya orang-orang yang berdosa, adalah mereka yang dahulunya(di dunia) menertawakan orang-orang yang beriman. Dan apabila orang-orang yang beriman berlalu dihadapan mereka, mereka saling mengedip-ngedipkan matanya”. Sampai firman-Nya : “maka pada hari ini, orang-orang yang beriman menertawakan orang-orang kafir mereka (duduk) di atas dipan-dipan sambil memandang”. (QS. Al-Muthoffifin) Para ulama dan ahli tafsir berbeda pendapat tentang siapa ashabul ‘araf itu dan apa amal mereka. Yang benar dari pendapat-pendapat itu adalah bahwa mereka adalah orang-orang yang sama kebaikan dan keburukannya. Keburukan mereka tidak lebih berat sehingga mereka masuk neraka, dan kebaikan mereka juga tidak lebih berat sehingga mereka masuk surge, maka mereka berada di al-a’raf sesuai dengan kehendak Allah, kemudian Allah dengan RahmatNya memasukkan mereka ke surge, karena RahmatNya mendahului dan mengungguli murkaNYa dan RahmatNya meliputi segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 49: Maksudnya penghuni surga yang ketika di dunia keadaannya fakir lagi lemah, lalu diolok-olok oleh penghuni neraka, bahkan mereka sampai bersumpah bahwa rahmat Allah tidak mungkin diberikan kepada mereka. Karena menghina dan menganggap rendah mereka serta ujub terhadap dirimu. Sebagai penghormatan dan pemuliaan terhadap kaum lemah tersebut. Terhadap hal yang telah luput, bahkan kamu akan memperoleh keamanan, ketenteraman dan bergembira dengan segala kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 49",
    "description": "Ketika pembicaraan tentang golongan mukmin yang dulu mereka anggap lemah, miskin, dan hina, penghuni a'ra'f mengajukan pertanyaan dengan nada mencela dan menghina, wahai penghuni neraka! itukah orang-orang yang kamu telah berani bersumpah, berlagak sombong, dan menghina mereka bahwa mereka tidak akan mendapat rahmat Allah' kenyataannya sekarang, merekalah yang beruntung dan mendapatkan rahmat Allah. Kemudian sesudah percakapan itu Allah mempersilakan penghuni a'ra'f masuk ke dalam surga, sesudah tertahan sementara di tempat itu. Allah berfirman, masuklah kamu ke dalam surga! tidak ada rasa takut padamu dan kamu tidak pula akan bersedih hati. Usai mengisahkan dialog penghuni surga dengan penghuni neraka dan dialog penghuni a'ra'f dengan penghuni neraka, pada ayat ini Allah menceritakan dialog antara penghuni neraka dengan penghuni surga dan permintaan mereka agar diberi nikmat yang ada dalam surga itu. Panasnya api neraka membuat penghuni neraka sangat haus dan lapar, maka para penghuni neraka tidak malu-malu meminta tolong dan menyeru para penghuni surga, tuangkanlah sedikit air kepada kami atau rezeki apa saja yang telah dikaruniakan Allah kepadamu. Mereka, yakni penghuni surga, menjawab, sungguh, Allah telah mengharamkan keduanya, yaitu air dan makanan, bagi orang-orang kafir, sebagaimana Allah mengharamkan mereka masuk surga dan menambah pedih siksaan neraka bagi mereka."
  }
]