[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tidaklah ucapan dari mereka ketika siksaan itu datang kecuali pengakuan dari dosa dan kesalahan, dan bahwasannya mereka itu pantas menerima siksaan yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Maka sesudah turunnya azab itu mereka tidak punya pilihan lain selain mengakui kesalahan mereka karena telah ingkar kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَمَا كَانَ دَعْوَىٰهُمْ إِذْ جَآءَهُم بَأْسُنَآ إِلَّآ أَن قَالُوٓا۟ إِنَّا كُنَّا ظٰلِمِينَ (Maka tidak adalah keluhan mereka di waktu datang kepada mereka siksaan Kami, kecuali mengatakan: “Sesungguhnya kami adalah orang-orang yang zalim”) Yakni tidaklah doa yang mereka panjatkan kepada Tuhan mereka ketika ditimpa azab kecuali pengakuan mereka terhadap kezaliman yang mereka lakukan terhadap diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Doa dan permohonan mereka saat datangnya azab Kami itu tidak lain hanyalah pengakuan atas kezaliman terhadap diri sendiri dengan berbuat syirik kepada Allah dan mendustakan para rasulNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jadi tidaklah seruan mereka} seruan mereka {ketika siksaan Kami datang menimpa mereka melainkan mereka berkata,“Sesungguhnya kami adalah orang-orang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5 “maka tidaklah ada keluhan mereka di waktu datang mereka siksaan kami, kecuali mengatakan ‘sesunggguhnya kami adalah orang-orang yang zhalim.\" Sebagaimana firman-Nya : \"Dan berapa banyaknya (penduduk) negeri yang zalim yang teIah Kami binasakan, dan Kami adakan sesudah mereka itu kaum yang lain (sebagai penggantinya). Maka tatkala mereka merasakan azab Kami, tiba-tiba mereka melarikan diri dari negerinya. Janganlah kamu lari tergesa-gesa; kembalilah kamu kepada nikmat yang telah kamu rasakan dan kepada tempat-tempat kediamanmu (yang baik), supaya kamu ditanya. Mereka berkata: “Aduhai, celaka kami, sesungguhnya kami adalah orang-orang yang zaIim”. Maka tetaplah demikian keluhan mereka, sehingga Kami jadikan mereka sebagai tanaman yang telah dituai, yang tidak dapat hidup lagi.\" (QS. AL-ANBIYA :11-15)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 5",
    "description": "Maka ketika siksaan kami datang menimpa mereka, keluhan mereka tidak lain, hanya mengucap, sesungguhnya kami adalah orang-orang yang zalim. Mereka mengakui dosa-dosanya, tetapi semua penyesalan itu tidak ada gunanya lagi. Mereka tetap dibinasakan. Inilah siksaan mereka di dunia. Di akhirat nanti, azab Allah akan lebih pedih lagi. Mereka akan dimintakan pertanggungjawaban. Maka pasti akan kami tanyakan kepada umat yang telah mendapat seruan dari para rasul kami, pertanyaan yang berupa celaan keras: apakah para rasul telah memperingatkan mereka' dan kami akan tanyai pula para rasul untuk menjadi saksi: apakah mereka telah melaksanakan tugas dengan baik, bagaimana sikap kaum mereka, apakah menurut atau menentang, dan sebagainya'"
  }
]