[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penduduk neraka meminta bantuan kepada para penghuni surga dengan meminta dari mereka agar mau menuangkan kepada mereka air atau apa saja yang Allah berikan kepada mereka berupa makanan. Maka penghuni surga menjawab(permintaan) mereka dengan mengatakan bahwa sesungguhnya Allah telah mengharamkan minuman dan makanan atas orang-orang yang mengingkari tauhid dan mendustakan para rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan para penduduk Neraka berseru kepada penduduk Surga dengan nada meminta, “Wahai para penduduk Surga! Limpahkanlah kepada kami sedikit air atau makanan yang Allah berikan kepada kalian.” Para penduduk Surga menjawab, “Sesungguhnya Allah mengharamkannya bagi orang-orang yang kafir. Dan sesungguhnya kami tidak akan menolong kalian dengan sesuatu yang diharamkan oleh Allah bagi kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Allah menyampaikan kepada kita perbincangan yang terjadi antara para penghuni surga dengan para penghuni neraka, setalah mereka semua menempati tempatnya masing-masing. Para penghuni neraka berseru kepada para penghuni surga: “Tolonglah kami dengan sedikit air saja, atau dengan sebagian makanan dan minuman yang telah Allah karuniakan kepada kalian.” Maka para penghuni surga menjawab: “Allah telah mengharamkan makanan dan minuman ini bagi orang-orang kafir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَنَادَىٰٓ أَصْحٰبُ النَّارِ أَصْحٰبَ الْجَنَّةِ أَنْ أَفِيضُوا۟ عَلَيْنَا مِنَ الْمَآءِ (Dan penghuni neraka menyeru penghuni surga: “Limpahkanlah kepada kami sedikit air) Yakni mereka meminta para ahli surga untuk memberi mereka pelipur lara dengan sedikit minuman atau makanan. إِنَّ اللهَ حَرَّمَهُمَا (Sesungguhnya Allah telah mengharamkan keduanya) Yakni air dan apa yang diberikan Allah lainnya. عَلَى الْكٰفِرِينَ (atas orang-orang kafir) Maka kami tidak bisa memberi kalian sedikit penghibur dari apa yang diharamkan Allah bagi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Para penduduk neraka meminta kepada penduduk surga untuk memberi mereka air, makanan, nikmat atau kebaikan yang diberikan oleh Allah. Lalu penduduk surga berkata kepada mereka: “Sesungguhnya Allah melarang keduanya, yaitu air dan rejeki Allah bagi orang-orang kafir, sehingga kami tidak bisa menghibur dan memberi kalian sesuatu yang dilarang oleh Allah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para penghuni neraka menyeru para penghuni surga, “Tuangkanlah} tuangkanlah {air kepada kami atau rezeki yang telah dikaruniakan Allah kepada kalian.” Mereka menjawab,“Sesungguhnya Allah telah mengharamkan keduanya bagi orang-orang kafir.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-52 Yakni penghuni neraka memanggil penduduk surge ketika mereka mendapatkan azab yang sangat pedih, dan ketika kelaparan yang sangat dan kehausan yang menkik dan menerka mereka, mereka memanggil dan meminta tolong kepada penduduk surge. ”limpahkanlah kepada kami sedikit air atau makanan yang telah dirizkikan Allah kepadamu” lalu penduduk surga menjawab “ sesungguhnya Allah telah mengharamkan keduanya” yakni air dan makanan surga “atas orang-orang kafir” dan hal itu adalah sebagai balasan kepada mereka atas kekufuran mereka kepada ayat-ayat Allah dan mereka menjadikan agama yang mereka diperintah agar teguh diatasnya dan dijanjikan balasan yang besar atasnya, ”sebagai main-main dan senda gurau” yakni hati mereka lalai darinya dan berpaling, mereka main-main dan menjadikannya sebagai bahan cemoohan , atau mereka mengganti agama mereka dengan main-main atau senda gurau. Mereka menukar agama yang lurus dengan itu.” dan kehidupan dunia telah menipu mereka” dengan perhiasannya, keindahannya, dan banyaknya propagandanya. Mereka cenderung kepadanya, rela dan berbahagia dengannya, dan mereka lupa dan berpaling dari akhirat. ”maka pada hari (kiamat) ini, kami melupakan mereka” yakni kami membiarkan mereka di dalam azab, “sebagaimana mereka melupakan pertemuan mereka dengan hari ini” seolah-olah mereka hanya diciptakan untuk dunia semata dan di belakang hari nanti tidak ada perhitungan dan balasan amal bagi mereka, ”dan (sebagaimana) mereka selalu mengingkari ayat-ayat kami” padahal pengingkaran mereka itu bukan karena keterbatasan pada ayat-ayat Allah dan kejelasannya, justru “kami telah mendatangkan sebuh kitab (al-qur’an) kepada mereka yang kami telah menjelaskannya” yakni kami jelaskan padanya seluruh tuntutan yang dibutuhkan oleh manusia “atas dasar pengetahuan kami” yakni atas dasar pengetahuan dari Allah terhadap keadaan para hamba di setiap waktu dan tempat, serta apa yang baik dan apa yang tidak baik bagi mereka. Perinciannya bukan perincian orang yang tidak memiliki pengetahuan terhadap perkara-perkara, sehingga ia tidak mengetahui sebagian kondisi yang akibatnya dia meneluarkan hukum yang tidak sesuai. Akan tetapi ini adalah perincian Dzat yang ilmuNya meliputi segala sesuatu “yang menjadi petunjuk dan rahmat bagi orang-orang yang beriman” yakni dengan kitab ini orang-orang mukmin mendapatkan hidayah dari kesesatan, penjelasan tentang yang haq dan yang batil, demikian juga penyimpangan dan kebenaran. Dengannya pula mereka juga mendapatkan rahmat, yaitu kebahagiaan dan kebaikan dunia dan akhirat, sehingga lenyaplah kesesatan dan kesengsaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 50: Ketika mereka memperoleh azab yang demikian dahsyat, dan ketika mereka merasakan lapar dan haus yang sangat. Makanan dan minuman surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 50",
    "description": "Usai mengisahkan dialog penghuni surga dengan penghuni neraka dan dialog penghuni a'ra'f dengan penghuni neraka, pada ayat ini Allah menceritakan dialog antara penghuni neraka dengan penghuni surga dan permintaan mereka agar diberi nikmat yang ada dalam surga itu. Panasnya api neraka membuat penghuni neraka sangat haus dan lapar, maka para penghuni neraka tidak malu-malu meminta tolong dan menyeru para penghuni surga, tuangkanlah sedikit air kepada kami atau rezeki apa saja yang telah dikaruniakan Allah kepadamu. Mereka, yakni penghuni surga, menjawab, sungguh, Allah telah mengharamkan keduanya, yaitu air dan makanan, bagi orang-orang kafir, sebagaimana Allah mengharamkan mereka masuk surga dan menambah pedih siksaan neraka bagi mereka. Yaitu orang-orang yang semasa hidupnya di dunia mengaku beragama tetapi mereka menjadikan agamanya sebagai permainan dan sendagurau, dan mereka telah tertipu dan tenggelam oleh buaian kenikmatan kehidupan dunia sehingga mereka hanya mengikuti hawa nafsu, bersenang-senang dan bergembira tanpa mempedulikan halal dan haram, yang hak dan yang batil. Maka pada hari ini, hari kiamat, kami melupakan mereka sebagaimana mereka dahulu melupakan, yakni mengingkari, pertemuan hari ini, dan karena mereka mengingkari ayat-ayat kami."
  }
]