[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang Allah haramkan atas mereka kenikmatan akhirat adalah orang-orang yang menjadikan agama yang Allah perintahkan mereka untuk mengikutinya sebagai bahan main-main dan senda gurau dan dunia telah memperdayai mereka, serta mereka larut dalam pesona-pesonanya hingga melalaikan mereka dari beramal untuk akhirat. Maka pada hari kiamat kelak, Allah melupakan mereka dan membiarkan mereka berada di dalam siksaan yang pedih, sebagaimana dahulu mereka tak peduli untuk beramal menyongsong pertemuan mereka dengan hari ini, dan karena kondisi mereka dahulu mengingkari ayat-ayat Allah dan bukti-buktiNya, padahal mereka mengetahui bahwa hal itu merupakan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Mereka itu adalah orang-orang yang menjadikan agama mereka sebagai bahan gurauan serta permainan dan mereka terpedaya oleh kehidupan dunia dengan kemegahan dan keelokannya. Maka pada hari Kiamat kelak mereka dilupakan oleh Allah dan dibiarkan berhadapan dengan azab yang sangat keras. Karena mereka dahulu melupakan hari Kiamat, sehingga mereka tidak berbuat sesuatu dan bersiap-siap untuk menghadapinya. Dan juga sebab mereka dahulu menolak dan ingkar kepada dalil-dalil dan bukti-bukti yang Allah berikan, padahal sebenarnya mereka mengetahui bahwa itu semua benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Sebagian ciri-ciri penghuni neraka adalah mereka senantiasa merendahkan agama Allah dan menjadikannya sebagai hinaan dan mainan; dan mereka tertipu oleh kehidupan dunia dan syahwat yang ada di dalamnya. Maka pada hari kiamat ini Kami tinggalkan mereka di dalam azab, sebagaimana mereka meninggalkan amal kebaikan untuk menyiapkan pertemuan dengan Tuhan mereka pada hari ini, dan mendustakan ayat-ayat Allah yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. فَالْيَوْمَ نَنسَىٰهُمْ(Maka pada hari (kiamat) ini, Kami melupakan mereka) Yakni meninggalkan mereka di neraka selamanya sebagaimana mereka telah lupa dengan hari pertemuan ini. وَمَا كَانُوا۟ بِـَٔايٰتِنَا يَجْحَدُونَ (dan (sebagaimana) mereka selalu mengingkari ayat-ayat Kami) Yakni mengingkarinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Orang-orang kafir itu adalah mereka yang menjadikan agama mereka sebagai hiburan, permainan, ejekan dan olok-olokkan, dan mereka ditipu oleh kehidupan dunia dengan perhiasan dan gairahnya, sehingga pada hari kiamat Kami membiarkan mereka dalam neraka dan menerima azab akibat keingkaran mereka kepada ayat-ayat Allah dan apa yang dibawa oleh para rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menjadikan agama mereka sebagai senda gurau dan permainan serta mereka telah tertipu} tertipu {oleh kehidupan dunia. Maka pada hari ini Kami melupakan mereka} membiarkan mereka dalam azab {sebagaimana mereka melupakan pertemuan hari ini} sebagaimana mereka meninggalkan amal untuk pertemuan pada hari ini {dan karena mereka selalu mengingkari ayat-ayat Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-52 Yakni penghuni neraka memanggil penduduk surge ketika mereka mendapatkan azab yang sangat pedih, dan ketika kelaparan yang sangat dan kehausan yang menkik dan menerka mereka, mereka memanggil dan meminta tolong kepada penduduk surge. ”limpahkanlah kepada kami sedikit air atau makanan yang telah dirizkikan Allah kepadamu” lalu penduduk surga menjawab “ sesungguhnya Allah telah mengharamkan keduanya” yakni air dan makanan surga “atas orang-orang kafir” dan hal itu adalah sebagai balasan kepada mereka atas kekufuran mereka kepada ayat-ayat Allah dan mereka menjadikan agama yang mereka diperintah agar teguh diatasnya dan dijanjikan balasan yang besar atasnya, ”sebagai main-main dan senda gurau” yakni hati mereka lalai darinya dan berpaling, mereka main-main dan menjadikannya sebagai bahan cemoohan , atau mereka mengganti agama mereka dengan main-main atau senda gurau. Mereka menukar agama yang lurus dengan itu.” dan kehidupan dunia telah menipu mereka” dengan perhiasannya, keindahannya, dan banyaknya propagandanya. Mereka cenderung kepadanya, rela dan berbahagia dengannya, dan mereka lupa dan berpaling dari akhirat. ”maka pada hari (kiamat) ini, kami melupakan mereka” yakni kami membiarkan mereka di dalam azab, “sebagaimana mereka melupakan pertemuan mereka dengan hari ini” seolah-olah mereka hanya diciptakan untuk dunia semata dan di belakang hari nanti tidak ada perhitungan dan balasan amal bagi mereka, ”dan (sebagaimana) mereka selalu mengingkari ayat-ayat kami” padahal pengingkaran mereka itu bukan karena keterbatasan pada ayat-ayat Allah dan kejelasannya, justru “kami telah mendatangkan sebuh kitab (al-qur’an) kepada mereka yang kami telah menjelaskannya” yakni kami jelaskan padanya seluruh tuntutan yang dibutuhkan oleh manusia “atas dasar pengetahuan kami” yakni atas dasar pengetahuan dari Allah terhadap keadaan para hamba di setiap waktu dan tempat, serta apa yang baik dan apa yang tidak baik bagi mereka. Perinciannya bukan perincian orang yang tidak memiliki pengetahuan terhadap perkara-perkara, sehingga ia tidak mengetahui sebagian kondisi yang akibatnya dia meneluarkan hukum yang tidak sesuai. Akan tetapi ini adalah perincian Dzat yang ilmuNya meliputi segala sesuatu “yang menjadi petunjuk dan rahmat bagi orang-orang yang beriman” yakni dengan kitab ini orang-orang mukmin mendapatkan hidayah dari kesesatan, penjelasan tentang yang haq dan yang batil, demikian juga penyimpangan dan kebenaran. Dengannya pula mereka juga mendapatkan rahmat, yaitu kebahagiaan dan kebaikan dunia dan akhirat, sehingga lenyaplah kesesatan dan kesengsaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 51: Di mana hati mereka lalai dan berpaling daripadanya. Mereka menjadikannya sebagai bahan olokkan. Oleh perhiasan dan keindahannya, serta banyaknya penyeru kepadanya. Mereka lebih senang kepada dunia, bergembira dengannya dan berpaling dari akhirat serta melupakannya. Membiarkan mereka dalam azab. Dengan meninggalkan beramal. Seakan-akan mereka tidak diciptakan kecuali untuk dunia, dan bahwa di hadapan mereka tidak ada pembalasan terhadap amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 51",
    "description": "Yaitu orang-orang yang semasa hidupnya di dunia mengaku beragama tetapi mereka menjadikan agamanya sebagai permainan dan sendagurau, dan mereka telah tertipu dan tenggelam oleh buaian kenikmatan kehidupan dunia sehingga mereka hanya mengikuti hawa nafsu, bersenang-senang dan bergembira tanpa mempedulikan halal dan haram, yang hak dan yang batil. Maka pada hari ini, hari kiamat, kami melupakan mereka sebagaimana mereka dahulu melupakan, yakni mengingkari, pertemuan hari ini, dan karena mereka mengingkari ayat-ayat kami. Pada ayat yang lalu diterangkan tentang keadaan penghuni surga, neraka, dan a'ra'f, dan juga dialog antara mereka yang dapat dijadikan pelajaran dan peringatan agar manusia terhindar dari penyesalan dan mendapat petunjuk kepada jalan yang benar. Pada ayat-ayat ini diterangkan tentang kitab Al-Qur'an sebagai petunjuk bagi manusia, dan diterangkan pula bagaimana akibat orang-orang yang menentang dan mendustakannya pada hari kiamat. Sungguh, kami telah mendatangkan kitab yang agung, yaitu Al-Qur'an, kepada mereka yang kami jelaskan beragam bukti yang mudah dipahami, dan penjelasan itu atas dasar pengetahuan kami yang sangat luas, mantap, dan menyeluruh sehingga tidak ada kekurangan dan kelemahannya. Kitab itu benar-benar sebagai petunjuk dan rahmat bagi orang-orang yang beriman."
  }
]