[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mendatangkan kepada orang-orang kafir al-qur’an yang kami turunkan padamu (wahai rasul), yang telah kami jelaskan dengan mencakup ilmu yang agung, lagi menjadi petunjuk dari jalan kesesatan menuju jalan lurus dan sebagai rahmat bagi kaum yang beriman kepada Allah dan mengamalkan syariatNya. Dia menghususkan penyebutan mereka tanpa yang lainnya, karena sesungguhnya merekalah yang dapat memperoleh manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan sesungguhnya Kami telah mendatangkan kepada mereka Kitab suci Al-Qur`ān ini. Yaitu kitab suci yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam-. Dan Kami telah menjelaskan kitab suci ini berdasarkan ilmu yang berasal dari Kami. Kitab suci ini adalah petunjuk bagi orang-orang mukmin ke jalan yang baik serta benar dan sebagai rahmat bagi mereka, karena mengandung petunjuk untuk menggapai kebahagiaan hidup di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Sungguh, Kami telah datangkan al-Qur’an kepada orang-orang kafir dan Kami telah menjelaskannya dengan ilmu yang agung, sebagai petunjuk menuju kebenaran dan rahmat bagi orang-orang yang beriman kepada Allah dan mengakui keesaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَلَقَدْ جِئْنٰهُم بِكِتٰبٍ (Dan sesungguhnya Kami telah mendatangkan sebuah Kitab kepada mereka) Yakni al-qur’an, serta penjelasan dan perincian. عَلَىٰ عِلْمٍ (atas dasar pengetahuan Kami) Yakni Kami mengetahui apa yang Kami jelaskan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Dan sungguh telah datang kepada penduduk Mekah dan lainnya itu Al-Qur’an yang telah Kami jelaskan dengan sempurna supaya mereka mengetahui apa yang Kami jelaskan di dalamnya, petunjuk kepada manusia menuju kebenaran, penyelamat dari kesesatan, dan rahmat bagi orang yang yeng mengimani dan mengikuti aturan-aturannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah mendatangkan kepada mereka kitab} Al-Qur’an {yang telah Kami rincikan} jelaskan {atas dasar pengetahuan sebagai petunjuk dan rahmat bagi orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-52 Yakni penghuni neraka memanggil penduduk surge ketika mereka mendapatkan azab yang sangat pedih, dan ketika kelaparan yang sangat dan kehausan yang menkik dan menerka mereka, mereka memanggil dan meminta tolong kepada penduduk surge. ”limpahkanlah kepada kami sedikit air atau makanan yang telah dirizkikan Allah kepadamu” lalu penduduk surga menjawab “ sesungguhnya Allah telah mengharamkan keduanya” yakni air dan makanan surga “atas orang-orang kafir” dan hal itu adalah sebagai balasan kepada mereka atas kekufuran mereka kepada ayat-ayat Allah dan mereka menjadikan agama yang mereka diperintah agar teguh diatasnya dan dijanjikan balasan yang besar atasnya, ”sebagai main-main dan senda gurau” yakni hati mereka lalai darinya dan berpaling, mereka main-main dan menjadikannya sebagai bahan cemoohan , atau mereka mengganti agama mereka dengan main-main atau senda gurau. Mereka menukar agama yang lurus dengan itu.” dan kehidupan dunia telah menipu mereka” dengan perhiasannya, keindahannya, dan banyaknya propagandanya. Mereka cenderung kepadanya, rela dan berbahagia dengannya, dan mereka lupa dan berpaling dari akhirat. ”maka pada hari (kiamat) ini, kami melupakan mereka” yakni kami membiarkan mereka di dalam azab, “sebagaimana mereka melupakan pertemuan mereka dengan hari ini” seolah-olah mereka hanya diciptakan untuk dunia semata dan di belakang hari nanti tidak ada perhitungan dan balasan amal bagi mereka, ”dan (sebagaimana) mereka selalu mengingkari ayat-ayat kami” padahal pengingkaran mereka itu bukan karena keterbatasan pada ayat-ayat Allah dan kejelasannya, justru “kami telah mendatangkan sebuh kitab (al-qur’an) kepada mereka yang kami telah menjelaskannya” yakni kami jelaskan padanya seluruh tuntutan yang dibutuhkan oleh manusia “atas dasar pengetahuan kami” yakni atas dasar pengetahuan dari Allah terhadap keadaan para hamba di setiap waktu dan tempat, serta apa yang baik dan apa yang tidak baik bagi mereka. Perinciannya bukan perincian orang yang tidak memiliki pengetahuan terhadap perkara-perkara, sehingga ia tidak mengetahui sebagian kondisi yang akibatnya dia meneluarkan hukum yang tidak sesuai. Akan tetapi ini adalah perincian Dzat yang ilmuNya meliputi segala sesuatu “yang menjadi petunjuk dan rahmat bagi orang-orang yang beriman” yakni dengan kitab ini orang-orang mukmin mendapatkan hidayah dari kesesatan, penjelasan tentang yang haq dan yang batil, demikian juga penyimpangan dan kebenaran. Dengannya pula mereka juga mendapatkan rahmat, yaitu kebahagiaan dan kebaikan dunia dan akhirat, sehingga lenyaplah kesesatan dan kesengsaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 52: Semua tuntutan yang memang dibutuhkan makhluk. Maksudnya atas dasar pengetahuan Kami tentang apa yang menjadi kemaslahatan bagi hamba-hamba Kami di dunia dan akhirat. Agar manusia tidak tersesat. Kebaikan dan kebahagiaan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 52",
    "description": "Pada ayat yang lalu diterangkan tentang keadaan penghuni surga, neraka, dan a'ra'f, dan juga dialog antara mereka yang dapat dijadikan pelajaran dan peringatan agar manusia terhindar dari penyesalan dan mendapat petunjuk kepada jalan yang benar. Pada ayat-ayat ini diterangkan tentang kitab Al-Qur'an sebagai petunjuk bagi manusia, dan diterangkan pula bagaimana akibat orang-orang yang menentang dan mendustakannya pada hari kiamat. Sungguh, kami telah mendatangkan kitab yang agung, yaitu Al-Qur'an, kepada mereka yang kami jelaskan beragam bukti yang mudah dipahami, dan penjelasan itu atas dasar pengetahuan kami yang sangat luas, mantap, dan menyeluruh sehingga tidak ada kekurangan dan kelemahannya. Kitab itu benar-benar sebagai petunjuk dan rahmat bagi orang-orang yang beriman. Orang-orang kafir tidaklah beriman kepada berita-berita dalam alqur'an, walaupun sudah sedemikian jelas bukti-bukti kebenarannya. Tidakkah mereka hanya menanti-nanti melainkan setelah nyata bagi mereka bukti kebenaran Al-Qur'an itu. Pada hari kiamat ketika bukti kebenaran pemberitaan Al-Qur'an itu tiba, seperti berita tentang hari kebangkitan, surga, dan neraka, orang-orang yang sebelum itu mengabaikannya, yakni meninggalkan tuntunannya, berkata, sungguh ketika di dunia, rasul-rasul tuhan kami telah datang membawa kebenaran, antara lain tentang hari kebangkitan, namun kami kafir dan ingkar padanya. Maka adakah pemberi syafaat bagi kami yang akan memberikan pertolongan kepada kami, agar kami terhindar dari siksa yang pedih ini atau agar kami dikembalikan ke dunia sehingga kami akan beramal tidak seperti perbuatan yang pernah kami lakukan dahulu' mereka sebenarnya telah merugikan dirinya sendiri, karena mereka enggan beriman ketika di dunia dan apa yang mereka ada-adakan dahulu, yakni tuhan-tuhan yang mereka sembah telah hilang dan lenyap dari mereka."
  }
]