[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tiadalah yang ditunggu oleh orang-orang kafir, kecuali apa yang diancamkan kepada mereka dalam al-qur’an yang berbentuk siksaan yang menjadi penghujung nasib mereka. Pada hari datangnya kejadian yang sebenarnya, yaitu perhitungan amal perbuatan, adanya pahala dan siksaan pada hari kiamat, orang-orang kafir yang mengabaikan al-qur’an dan mengingkarinya dalam kehidupan dunia berujar, ”sungguh telah jelas bagi kami sekarang ini bahwa para rasul tuhan kami sudah datang dengan membawa kebenaran dan memberi nasihat terhadap kami. Apakah ada kawan-kawan dan para pemberi syafaat yang akan memintakan syafaat bagi kami di sisi tuhan kami, atau dapatkah kami dikembalikan menuju kehidupan dunia sekali lagi, sehingga kami akan berbuat di sana amalan yang menjadikan Allah ridha kepada kami?” sungguh, mereka telah merugikan diri mereka sendiri dengan masuk keadalam neraka dan keabadiaan mereka di dalamnya. Dan hilanglah dari mereka sesembahan-sesembahan yang dahulu mereka sembah selain Allah dan mereka ada-adakan di dunia dengan dusta yang termasuk bagian dari janji manis setan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Orang-orang kafir itu hanya menunggu datangnya azab pedih yang telah disampaikan kepada mereka, yang akan menjadi akhir dari perjalanan nasib mereka di Akhirat. Yaitu pada hari ketika azab yang diberitakan kepada mereka akan tiba dan ganjaran yang beritakan kepada orang-orang mukmin akan datang. Ketika itulah orang-orang yang melupakan Al-Qur`ān semasa hidupnya di dunia dan tidak mau mengamalkan ajaran yang terkandung di dalamnya akan berkata, “Sesungguhnya utusan-utusan Rabb kami telah datang kepada kami dengan membawa kebenaran yang tidak ada keraguan sedikit pun terhadapnya dan tidak ada kebimbangan bahwa kebenaran itu berasal dari sisi Allah. Oh, seandainya saja kami mempunyai perantara yang dapat menolong kami di sisi Allah sehingga kami terbebas dari azab itu. Atau seandainya saja kami bisa kembali ke dunia agar kami bisa mengerjakan amal saleh untuk mengganti perbuatan-perbuatan buruk kami, sehingga kami bisa selamat dari siksa tersebut.” Orang-orang kafir itu telah merugikan diri mereka sendiri dengan menjerumuskan diri mereka sendiri ke dalam jurang kehancuran akibat kekafiran mereka. Dan tuhan-tuhan yang mereka sembah selain Allah semasa di dunia menjauh dari mereka sehingga tidak dapat memberikan manfaat apa pun kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Orang-orang kafir itu tidak lain hanyalah menunggu azab yang diancamkan kepada mereka, di hari tersingkapnya balasan bagi seseorang, azab atau pahala. Orang-orang yang berpaling dari al-Qur’an dan enggan mengamalkannya di dunia, berkata: “Para rasul telah mendatangi kami, dan kebenaran mereka telah jelas bagi kami, namun kami tetap tidak mempercayai mereka. Maka pada hari ini apakah ada orang yang dapat menyelamatkan kami dari azab? Atau dapatkah kami kembali ke dunia untuk beramal shalih?” Mereka telah merugikan diri sendiri karena lebih memilih syahwat dunia dan berpaling dari kenikmatan akhirat. Dan berhala-berhala yang mereka sembah dahulu telah lenyap."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. هَلْ يَنظُرُونَ إِلَّا تَأْوِيلَهُۥ ۚ (Tiadalah mereka menunggu-nunggu kecuali (terlaksananya kebenaran) Al Quran itu) Yakni bukankah mereka menunggu kecuali apa yang dijanjikan kepada mereka, berupa siksaan yang menjadi tempat kembali mereka? يَوْمَ يَأْتِى تَأْوِيلُهُۥ (Pada hari datangnya kebenaran itu) Yakni di hari kiamat. يَقُولُ الَّذِينَ نَسُوهُ مِن قَبْلُ (berkatalah orang-orang yang melupakannya sebelum itu) Yakni mereka meninggalkannya sebelum datang kebenaran itu. قَدْ جَآءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ(Sesungguhnya telah datang rasul-rasul Tuhan kami membawa yang hak) Mereka mengakuinya ketika pengakuan kepada pengutusan para Rasul sudah tidak bermanfaat bagi mereka. فَهَل لَّنَا مِن شُفَعَآءَ(maka adakah bagi kami pemberi syafa’at) Ini merupakan angan-angan mereka. فَيَشْفَعُوا۟ لَنَآ(yang akan memberi syafa’at bagi kami) Yakni pemberi syafaat di sisi Tuhan kami agar mengampuni kami dari siksa neraka. أَوْ نُرَدُّ(atau dapatkah kami dikembalikan (ke dunia)) Atau memberi syafaat kepada kami agar Allah mengembalikan kami ke dunia. فَنَعْمَلَ(sehingga kami dapat beramal) Yakni sungguh jika kami dikembalikan ke dunia niscaya kami akan beramal shalih. غَيْرَ الَّذِى كُنَّا نَعْمَلُ ۚ( yang lain dari yang pernah kami amalkan?) Yakni selain dari maksiat-maksiat yang kami perbuat. قَدْ خَسِرُوٓا۟ أَنفُسَهُمْ(Sungguh mereka telah merugikan diri mereka sendiri) Yakni tidak mendapat manfaat dari diri mereka, bahkan diri mereka menjadi musibah bagi mereka seakan-akan mereka telah rugi dengan diri mereka seperti pedagang yang rugi dengan modalnya. وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ (dan telah lenyaplah dari mereka tuhan-tuhan yang mereka ada-adakan) Yakni kedustaan mereka yang dahulu mereka katakan di dunia telah sirna. Atau maknanya adalah apa yang telah mereka jadikan sebagai sekutu Allah telah pergi meninggalkan mereka, sehingga tidak dapat memberi manfaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Tidaklah mereka menunggu-nunggu, yaitu para pendusta itu kecuali apa yang dijanjikan dalam Al-Qur’an, yaitu azab yang diterangkan perkaranya. Pada hari hukuman itu terjadi, yaitu hari kiamat dan hari dimana kebenaran kabar itu ditampakkan, orang-orang yang tidak mengerjakan isi kandungan Al-Qur’an di dunia berkata: “Sungguh telah datang kepada kami para utusan Tuhan dengan membawa kebenaran, Kami mempercayainya, maka apakah ada penyelamat yang membebaskan kami dari azab atau menolong kami dengan mengembalikan kami lagi ke dunia? Sehingga kami bisa beramal shalih dan tidak berbuat maksiat.” Sungguh mereka telah menyalahkan diri sendiri, menempatkannya ke dalam neraka dan abadi di dalamnya. Apa yang mereka dustakan di dunia dengan berkata: “Sesungguhnya berhala-berhala dan sejenisnya akan menyelamatkan kami di sisi Allah SWT” itu telah lenyap"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada yang mereka tunggu} menunggu {kecuali bukti kebenaran. Pada hari tibanya bukti kebenaran itu} konsekuensi yang dijanjikan untuk mereka dalam Al-Qur’an yaitu hari kebangkitan dan perhitungan {orang-orang yang sebelum itu melupakannya} mengabaikannya {berkata,“Sungguh rasul-rasul Tuhan kami telah datang membawa kebenaran. Maka adakah pemberi syafaat bagi kami yang akan memberikan pertolongan kepada kami atau agar kami dikembalikan} dikembalikan ke dunia {sehingga kami akan beramal tidak seperti perbuatan yang pernah kami lakukan” Sungguh mereka telah merugikan diri sendiri dan telah lenyap} hilang {dari mereka apa yang mereka ada-adakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53 Orang-orang yang ditimpa azab itu tidak beriman kepada kitab yang agung ini, mereka tidak tunduk kepada perintah dan larangannya, maka tidak ada alasan bagi mereka kecuali bahwa mereka berhak menerima apa yang diberitakan oleh Al-qur’an. oleh karena itu Allah berfirman ”tiadalah mereka menunguu-nunggu kecuali (terlaksananya kebenaran) al-qur’an itu” yakni terjadinya apa yang diberitakannya seperti kata nabi yusuf ”inilah tabir mimpiku yang dahulu itu” “pada hari datanganya pemberitaan al-quran itu, berkatalah orang-orang yang melupakannya sebelum itu” dalam keadaan menyesal dan bersedih atas apa yang telah berlalu, memohon syafaat agar dosa-dosa mereka diampuni, mengakui apa yang diberitakan oleh para rasul, “sesungguhnya telah datang rasul-rasul Rabb kami membawa yang haq maka adakah bagi kami pemberi syafaat yang akan memberi syafaat bagi kami, atau dapatkah kami di kembalikan” kedunia, “sehingga kami dapat beramal yang lain dari yang pernah kami amalakan?” waktunya telah berlalu, tidak mungkin kembali kedunia, dan syafaat pemberi syafaat tidaklah berguna bagi mereka. permintaan agar mereka dikembalikan ke dunia untuk beramal dengan amal mereka yang dulu adalah dusta belaka, tujuan mereka hanya membela diri (untuk menghindari) dari apa yang menimpa mereka. “sekiranya mereka di kembalikan kedunia tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya. Dan sesungguhnya mereka itu adalah pendusta-pendusta belaka” “sungguh mereka telah merugikan diri mereka sendiri” dimana mereka menyia-nyiakan keberuntungan dan mengambil jalan kebinasaan. Hal itu tidak seperti kerugian harta, perkakas dan anak-anak, akan tetapi ini adalah kerugian yang tidak mungkin tergantikan. “dan telah lenyaplah dari mereka tuhan-tuhan yang mereka ada-adakan” di dunia yang mereka harap-harapkan dan dijanjikan oleh setan mereka melakukan apa yang tidak pernah mereka perhitungkan dan teranglah kebatilan dan kesesatannya, serta terbukti dan benarlah apa yang dibawa oleh para rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 53: Yakni hari kiamat. Maksudnya orang-orang yang tidak beramal sebagaimana yang digariskan oleh Al Quran atau tidak mau beriman. Jika sekiranya mereka dikembalikan ke dunia, tentu mereka akan mengulangi perbuatan yang dilarang itu, dan mereka hanya berdusta. Dan kerugian ini tidak dapat ditutupi lagi. Yakni yang mereka angan-angankan dan yang dijanjikan setan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 53",
    "description": "Orang-orang kafir tidaklah beriman kepada berita-berita dalam alqur'an, walaupun sudah sedemikian jelas bukti-bukti kebenarannya. Tidakkah mereka hanya menanti-nanti melainkan setelah nyata bagi mereka bukti kebenaran Al-Qur'an itu. Pada hari kiamat ketika bukti kebenaran pemberitaan Al-Qur'an itu tiba, seperti berita tentang hari kebangkitan, surga, dan neraka, orang-orang yang sebelum itu mengabaikannya, yakni meninggalkan tuntunannya, berkata, sungguh ketika di dunia, rasul-rasul tuhan kami telah datang membawa kebenaran, antara lain tentang hari kebangkitan, namun kami kafir dan ingkar padanya. Maka adakah pemberi syafaat bagi kami yang akan memberikan pertolongan kepada kami, agar kami terhindar dari siksa yang pedih ini atau agar kami dikembalikan ke dunia sehingga kami akan beramal tidak seperti perbuatan yang pernah kami lakukan dahulu' mereka sebenarnya telah merugikan dirinya sendiri, karena mereka enggan beriman ketika di dunia dan apa yang mereka ada-adakan dahulu, yakni tuhan-tuhan yang mereka sembah telah hilang dan lenyap dari mereka. Sungguh, tuhanmu, pemelihara dan pembimbingmu, adalah Allah yang menciptakan langit dan bumi dalam enam masa atau periode, lalu dia bersemayam di atas 'arsy sesuai dengan kebesaran dan keagungannya. Dia menutupkan malam dengan kegelapannya kepada siang yang mengikutinya dengan cepat sehingga begitu siang datang, ketika itu juga malam pergi. Semua makhluk-Nya termasuk matahari, bulan, dan bintang-bintang tunduk kepada perintah-Nya. Ingatlah! segala penciptaan, yakni menetapkan ukuran tertentu bagi ciptaan dan segala urusan, menjadi hak-Nya. Mahasuci Allah, tuhan seluruh alam."
  }
]