[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya tuhan kalian (wahai sekaliaan manusia), Dia lah Allah yang menciptakan langit dan bumi dari tidak ada dalam waktu enam hari. Kemudian Dia bersemayam di atas arsy. Maksudnya, tinggi dan berada di atasnya dengan hakikat istiwa (bersemayam) yang sesuai dengan kemuliaan dan keagunganNya. Dia memasukan malam pada siang sehingga menutupinya dengan itu, maka cahayanya itu pergi, dan Dia memasukan siang pada malam sampai kegelapannya pergi. Dan masing-masing dari keduanya mengejar yang lain dengan cepat dan terus menerus. Dan Dia dzat yang menciptakan matahari, bulan dan bintang-bintang dalam keadaan tunduk kepadaNya. Dia mengendalikannya sesuai dengan apa yang dikehendakinNya. Makhluk-makhluk ini temasuk tanda-tanda kebesaran Allah yang sangat besar. Ketahuilah, Bagi Allah hak kekuasaan menciptakan semuanya dan hak menetapkan semua ketentuan. Allah mahatinggi, maha agung lagi maha suci dari setiap urusan kekurangan, penguasa semua makhluk secara keseluruhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Sesungguhnya Rabb kalian -wahai manusia- adalah Rabb yang telah menciptakan langit dan bumi tanpa ada contoh sebelumnya dalam enam hari. Kemudian Dia bersemayam di atas ‘Arsy dengan cara yang sesuai dengan keagungan-Nya, kita tidak tahu bagaimana caranya. Dia menghilangkan gelapnya malam dengan terangnya siang dan menghilangkan terangnya siang dengan gelapnya malam. Keduanya saling menyusul dengan cepat, tidak ada yang terlambat. Jika yang satu menghilang maka yang lain langsung datang. Dan Dia -Subḥānahu- juga menciptakan matahari, bulan, dan bintang-bintang yang ditundukkan dan dipersiapkan. Ingatlah! Hanya Allah-lah Pencipta seluruh makhluk. Adakah pencipta lain selain Allah? Dan Dia lah satu-satunya pemilik perintah. Kebaikan-Nya amat agung dan berlimpah. Dia lah pemilik semua sifat keagungan dan kesempurnaan. Dia adalah Rabb alam semesta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Hai manusia, Pencipta dan Tuhan kalian adalah Allah Yang Maha Esa, Dia menciptakan tujuh langit dan bumi dalam masa enam hari. Kemudian Dia naik -sesuai dengan keagungan dan kemuliaan-Nya- ke ‘arsy yang luasnya meliputi langit, bumi, dan apa yang ada di antara keduanya. Dia menutup siang dengan malam sehingga cahayanya hilang, malam menutup siang dengan cepat, begitu pula dengan siang; setiap kali datang malam, siang akan pergi, dan begitu sebaliknya terus menerus hingga hari kiamat. Dan Allah menciptakan matahari dan bulan, serta bintang-bintang yang banyak dan besar; semua itu beredar dengan perintah-Nya. milik-Nya segala kekuasaan seluruh makhluk, dan milik-Nya segala urusan. Dia disucikan dan diagungkan dengan hak, Pencipta seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. إِنَّ رَبَّكُمُ اللهُ الَّذِى خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ فِى سِتَّةِ أَيَّامٍ (Sesungguhnya Tuhan kamu ialah Allah yang telah menciptakan langit dan bumi dalam enam masa) Terdapat pendapat yang mengatakan yang dimaksud adalah masa dengan perhitungan dunia. Dan pendapat lain mengatakan yakni masa dengan perhitungan akhirat. Terdapat juga pendapat yang mengatakan enam masa ini diawali dengan hari ahad dan diakhiri dengan hari jum’at. Allah berkuasa untuk menciptakannya dalam sekejap dengan berfirman: “jadilah” maka ciptaan itu akan jadi; namun segala sesuatu telah ditetapkan ajalnya. ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ(lalu Dia bersemayam di atas ‘Arsy) Makna (الاستواء) yakni meninggi dan menetap, Wallahu A’lam dengan hakikatnya, namun pastinya hal itu harus sesuai dengan kemuliaan-Nya. Makna (العرش) yakni singgasana raja. Ummu Salamah mengatakan dalam firman Allah (استوى على العرش) bahwa hakikatnya tidak dapat digapai oleh akal, adapun bersemayam merupakan sesuatu yang sudah diketahui, dan membenarkannya merupakan bagian dari iman, serta mengingkarinya merupakan kekafiran. Dari Imam Malik bin Anas bahwa seseorang bertanya kepadanya: “bagaimana Allah bersemayam di atas ‘Arsy?”. Ia menjawab: “hakikatnya tidak dapat digapai oleh akal, adapun bersemayam merupakan sesuatu yang sudah diketahui, dan beriman terhadapnya adalah wajib, dan bertanya tentang itu adalah perbuatan bid’ah”. يُغْشِى الَّيْلَ النَّهَارَ(Dia menutupkan malam kepada siang) Yakni Allah menjadikan malam seperti penutup bagi siang, yang menutupi sinarnya dengan kegelapan. يَطْلُبُهُۥ حَثِيثًا(yang mengikutinya dengan cepat) Yang mana malam hari senantiasa menyingsing siang dengan cepat tanpa pernah lelah. وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ(matahari, bulan dan bintang-bintang) Allah menciptakan semua ini. مُسَخَّرٰتٍۭ بِأَمْرِهِۦٓ ۗ( tunduk kepada perintah-Nya) Yakni berjalan sesuai dengan apa yang dikehendaki-Nya tanpa pernah membangkang. أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ (Ingatlah, menciptakan dan memerintah hanyalah hak Allah) Yakni seluruh alam semesta merupakan penciptaan-Nya, dan perintah didalamnya adalah ditangan-Nya; yakni perintah-perintah penciptaan, dan hukum-hukum syariat. تَبَارَكَ اللهُ رَبُّ الْعٰلَمِينَ (Maha Suci Allah, Tuhan semesta alam) Yakni berkah-Nya banyak dan luas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Sesungguhnya yang mendidik dan mengatur adalah Allah, Dzat yang menciptakan langit, bumi dan apa yang ada di antara keduanya dalam 6 hari, lalu beristiwa’, yaitu meninggi dan bertempat di atas ‘Arsy (‘Arsy adalah makhluk yang sangat agung) dengan istiwa’ yang sesuai dengan keluhuran dan keagunganNya. Kita tidak bisa mengetahui hakikatnya. Dia (Allah) menciptakan malam sebagai penutup bagi siang, yaitu mendatangkan kegelapan setelah cahaya, malam mengikuti siang dengan cepat secara teratur tanpa tertunda dan adanya pemisah. Dia menjadikan matahari, bulan, dan bintang itu tunduk dan terkendali sesuai perintah dan kuasaNya. Ingatlah bahwa semua ciptaan itu hanya milik Allah SWT, juga semua perintah dan aturan. BagiNya pula seluruh makhluk, perkara dan keadaan mereka. Maha Agung Allah, Tuhan semesta alam dari golongan jin dan manusia. AnugerahNya terus meluas, kekuasaanNya terus meninggi, kebaikan dan keberkahanNya terus bertambah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhan kalian adalah Allah yang telah menciptakan langit dan bumi dalam enam masa, kemudian Dia bersemayam} naik tinggi {di atas ʻArasy. Dia menutupkan} menutupkan {malam pada siang yang mengikutinya dengan cepat} masing-masing keduanya saling mengikuti dengan cepat {matahari, bulan, dan bintang-bintang tunduk} tunduk {pada perintahNya. Ingatlah, hanya milikNyalah segala penciptaan dan urusan. Maha berlimpah} Maha Tinggi dan Maha Agung {Allah, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54 Allah menetapkan bahwa Dialah satu-satunya Rabb yang berhak di sembah, tiada sekutu bagiNya. ”sesungguhnya Rabbmu ialah Allah yang telah menciptakan langit dan bumi” dan apa yang ada pada keduanya dengan kebesaran, keluasan, kekuatan dan kecanggihan langit dan bumi, ditambah penciptaan keduanya yang unik, ”dalam enam masa” dimulai dari hari ahad dan diakhiri hari jum’at. Ketika Dia telah menyelesaikan keduanya, dan Dia letakkan berbagai hal pada keduanya. “lalu Dia bersemayam diatas arasy” yang agung yang luasnya mampu mencakup langit dan bumi, apa yang ada padanya, dan apa yang ada diantara keduanya. Dia bersemayam sesuai dengan kebesaran, keagungan dan kemahakuasaanNya. Dia bersemayam di atas arasy, menguasai kerajaanNYa, mengatur makhlukNYa dan memperlakukan kepada mereka hukum-hukumNya, baik kauniyyah maupun diniyah, oleh karena itu Dia berfirman ”Dia menutupkan malam” yang gelap “kepada siang” yang terang. Malam menutupi apa yang ada di permukaan bumi, manusia beristirahat, para makhluk pulang ke tempat tinggalnya, mereka beristirahat dari aktifitas harian yang mereka lakukan di siang hari. ”yang mengikutinya dengan cepat” setiap kali malam datang maka siangpun berlalu, setiap kali siang datang maka malampun berlalu. Begitulah terus menerus sampai Allah menutup alam ini dan para hamba berpindah dari alam ini, ke alam yang lain. “dan (diciptakannya pula) matahari, bulan, dan bintang-bintang (masing-masing) tunduk kepada perintahNya” yakni dengan peraturanNya yang menunjukan kesempurnaan sifat-sifatNya, Dia menciptakan dan mengagungkannya yang menunjukan akan kesempurnaan kuasaNYa, kekuatan dan kecanggihan yang ada padanya membuktikan kesempurnaan hikmahNYa. Dan berbagai manfaat dan maslahat yang ada padanya membuktikan keluasan rahmatNya. Itu semua adalah bukti keluasan ilmuNya dan bahwa Dialah tuhan yang haq, hanya Dialah yang berhak untuk diibadahi. “ingatlah menciptakan dan memerintah hanyalah hak Allah” yakni, Dia adalah pemilik hak mencipta yang dari penciptaan itulah semua makhluk ini menjadi ada, baik yang diatas, yang dibawah, dzatnya, sifatnya, perbuatannya, dan perintah yang meliputi syariat dan kenabian. Hak penciptaan mencakup hukum-hukumNya yang diniyah syariyyah dan seterusnya adalah hukum pembalasan dan hal itu di alam kekekalan (akhirat). “maha suci Allah “ yakni Allah maha agung, maha tinggi kebaikanNya, maha banyak kebaikanNYa, maha suci Allah pada diriNya karena keagungan dan kesempurnaan sifatNya. Dia memberkahi makhlukNya dengan melimpahkan kebaikan yang besar dan banyak. Semua berkah alam ini adalah berkat RahmatNya. oleh karena itu Dia berfirman ”maha suci Allah Rabb semesta alam” Manakala Allah menjelaskan kebesaran dan keagunganNYa yang memberikan bukti pada para pemilik akal bahwa hanya Dia Rabb yang berhak disembah dan yang dituju dalam segala kebutuhan, maka Dia memerintahkan apa yang menjadi konsekuensinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 54: Dimulai dari hari Ahad dan berakhir sampai hari Jum’at. Menurut sebagian ulama, hari di sini seperti hari-hari di dunia. Allah Subhaanahu wa Ta'aala sesungguhnya mampu menciptakan dalam sekejap mata, akan tetapi Allah Subhaanahu wa Ta'aala menghubungkan akibat dengan sebabnya sebagaimana yang dikehendaki oleh hikmah-Nya. Bersemayam di atas 'Arsy ialah satu sifat Allah yang wajib kita imani, sesuai dengan kebesaran Allah dan keagungan-Nya. ‘Arsy adalah makhluk Allah yang paling besar, yang merupakan atap seluruh makhluk, dan makhluk yang paling tinggi, dan Allah berada di atas ‘Arsy. Sehingga bumi yang sebelumnya terang menjadi gelap dan manusia dapat beristirahat. Setiap kali malam tiba, maka siang pun pergi, dan setiap kali siang tiba, maka malam pun pergi. Besarnya makhluk tersebut menunjukkan sempurnanya kekuasaan Allah. Keteraturan dan kerapiannya menunjukkan sempurnanya kebijaksanaan Allah. Manfaat dan maslahat yang diperoleh daripadanya menunjukkan luasnya rahmat Allah dan ilmu-Nya, dan bahwa Dia adalah Tuhan yang berhak disembah satu-satunya. Dia memerintahkan mereka, lalu mereka semua taat. Mencakup pula ke dalamnya hukum-hukum kauni qadariy (ketetapan-Nya di alam semesta). Mencakup ke dalamnya, hukum-hukum syar’i (perintah dan larangan dalam agama) dan hukum-hukum jaza’i (pembalasan terhadap amalan) yang dilakukan di akhirat. Maha Agung, Maha Tinggi dan Maha banyak kebaikan dan ihsan-Nya. Setiap berkah yang ada di alam semesta merupakan atsar (pengaruh) rahmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 54",
    "description": "Sungguh, tuhanmu, pemelihara dan pembimbingmu, adalah Allah yang menciptakan langit dan bumi dalam enam masa atau periode, lalu dia bersemayam di atas 'arsy sesuai dengan kebesaran dan keagungannya. Dia menutupkan malam dengan kegelapannya kepada siang yang mengikutinya dengan cepat sehingga begitu siang datang, ketika itu juga malam pergi. Semua makhluk-Nya termasuk matahari, bulan, dan bintang-bintang tunduk kepada perintah-Nya. Ingatlah! segala penciptaan, yakni menetapkan ukuran tertentu bagi ciptaan dan segala urusan, menjadi hak-Nya. Mahasuci Allah, tuhan seluruh alam. Berdoalah kepada tuhanmu yang telah menciptakan dan memeliharamu, dengan rendah hati dan suara yang lembut, yakni tidak terlalu keras, namun tidak pula terlalu pelan, tetapi di antara keduanya. Sungguh, dia tidak menyukai orang-orang yang melampaui batas dalam berdoa dan segala hal."
  }
]