[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berdo’alah (wahai kaum mukminin), kepada tuhan kalian, dengan keadaan penuh menghinakan diri kepadaNya, dengan suara rendah dan perlahan. Dan hendaknya do’a dilakukan dengan hati khusyu dan jauh dari riya. Sesungguhnya Allah tidak menyukai orang-orang yang bertindak melampaui batas syariatNYa. Dan tindakan melampaui batas yang paling besar adalah perbuatan syirik kepada Allah, seperti berdo’a kepada selain Allah, dengan meminta kepada orang-orang yang sudah mati, berhala-berhala dan yang semisalya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Berdoalah kalian -wahai orang-orang mukmin- kepada Rabb kalian dengan penuh kerendahan dan ketundukan, dan dengan suara yang pelan dan samar, serta tulus dalam berdoa, tidak memperlihatkannya kepada manusia dan tidak menyekutukan-Nya -Subḥānahu- dengan yang lain. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas dalam berdoa. Dan salah satu tindakan yang melampaui batas dalam berdoa ialah memanjatkan doa kepada selain Allah di samping berdoa kepada-Nya seperti yang dilakukan oleh orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-56. Hai orang-orang beriman, berdoalah kepada pencipta kalian dengan penuh ketundukan dan harapan dengan suara yang rendah; karena Dia mencintai kalian, dan tidak menyukai orang-orang yang melampaui batas dalam berdoa dan dalam hal lainnya. Dan janganlah kalian membuat kerusakan di muka bumi dengan melakukan kesyirikan dan kemaksiatan, setelah Allah memperbaikinya dengan mengutus para rasul. Berdoalah kepada-Nya dengan rasa takut dari azab-Nya dan penuh harap mendapat pahala-Nya. Sesungguhnya rahmat Allah sangat luas dan dekat dengan orang-orang yang taat dan banyak melakukan kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. ادْعُوا۟ رَبَّكُمْ تَضَرُّعًا (Berdoalah kepada Tuhanmu dengan berendah diri) Yakni dengan penuh ketundukan, kerendahan diri, kepatuhan, dan harapan kepada-Nya. وَخُفْيَةً ۚ (dan suara yang lembut) Yakni menyembunyikan suaranya karena hal itu lebih dapat menjauhkan sifat riya’. إِنَّهُۥ لَا يُحِبُّ الْمُعْتَدِينَ (Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas) Yakni yang melampaui batas dalam berdoa dan segala hal. Dan yang termasuk doa yang melampaui batas adalah dengan meminta sesuatu yang tidak mungkin seperti meminta agar dapat hidup kekal di dunia, agar mendapat sesuatu yang mustahil baginya, agar dapat mencapai derajat para nabi di akhirat, atau mengangkat suara keras-keras ketika berdoa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Begitu banyak kita temui dari kalangan ummat islam dalam berdoa tidak melakukannya dengan diam-diam, melainkan mereka malakukannya dengan terang-terangan, namun ketahuilah bahwasanya ummat islam dahulu ketika berdoa tidak tidak terdengar dari mereka suara, tetapi sesungguhnya mereka degannya tuhannya saling berbisik-bisik, karena Allah telah berfirman : { ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً } \"Berdoalah kepada Tuhanmu dengan berendah diri dan suara yang lembut\". 2 ). Ada banyak faidah ketika seseorang berdoa kepada tuhannya : 1- Bahwa sesungguhnya ia adalah keimanan yang amat besar, karena hamba meyakini bahwa Allah mendengar dari doa yang ia panjatkan dengan suara lembut. 2- Bahwa seseungguhnya ia adalah adaba yang amat agung. 3- Bahwa seusungguhnya dengan doa seperti itu seorang hamba lebih khusyuk dalam doanya. 4- Dan dengan cara itu pula seorang hamba dalam doanya lebih membawanya kepada keikhlasan.\\ 5-Bahwasanya hal itu menandakan kedekatan seorang hamba kepada tuhannya. 3 ). { ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً ۚ إِنَّهُ لَا يُحِبُّ الْمُعْتَدِينَ } Dan maksud daripada doa adalah : Seorang hamba menyerahkan segala kebutuhannya, dan kelemahannya, dan kefaqirannya kepada tuhannya yang maha kuasa dan maha bijaksana, rahmat-Nya yang begitu luas. Maka ketika seorang hamba meraih apa yang ia butuhkan; hendaknya ia menjaga dirinya dari riya', dan itu dapat dilakukan dengan melembutkan suara dalam berdoa. 4 ). Qaidah doa dan dzikir terdapat di dua tempat dalam surah al-A'raf, dan dua ayat doa itu adalah : { ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً ۚ إِنَّهُ لَا يُحِبُّ الْمُعْتَدِينَ } lalu ayat setelahnya : { وَادْعُوهُ خَوْفًا وَطَمَعًا } \"dan berdoalah kepada-Nya dengan rasa takut (tidak akan diterima) dan harapan (akan dikabulkan)\", dan ayat dzikir, yaitu : { وَاذْكُرْ رَبَّكَ فِي نَفْسِكَ تَضَرُّعًا وَخِيفَةً وَدُونَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالْآصَالِ وَلَا تَكُنْ مِنَ الْغَافِلِينَ } \"Dan sebutlah (nama) Tuhanmu dalam hatimu dengan merendahkan diri dan rasa takut, dan dengan tidak mengeraskan suara, di waktu pagi dan petang, dan janganlah kamu termasuk orang-orang yang lalai\" [205]. 5 ). Datang lafazh الاعتداء (melampaui batas) setelah disebutkan { خفية } ; karena diantara macam i'tida' adalah dengan mengangkat suara dalam doa namun sebenarnya hal itu tidak dibutuhkan, sama halnya ketika kamu berbicara kepada seseorang dengan suara yang tinggi pastinya dia akan terganggu dengan cara itu, maka bagaimana jika dengan cara itu kamu berdoa kepada sang Maha mendengar ? dan sungguh Nabi telah ingkar kepada orang yang berdoa dengan cara seperti itu, beliau bersabda : (( أيها الناس أربعوا على أنفسكم فإنكم لا تدعون أصمَّ ولا غائبا ، إنما تدعون سميعا بصيرا ، إن الذي تدعون أقرب إلى أحدكم من عنق راحلته )) \"Wahai Manusia, rendahkan diri anda. Karena sesungguhnya kamu semua tidak berdoa kepada yang tuli dan tidak juga yang goib. Akan tetapi anda berdoa kepada yang Maha Mendengar dan Maha Melihat. Sesungguhya yang kamu semua berdoa itu lebih dekat dari salah satu diantara kamu dari punuk kendaraannya.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Wahai orang-orang mukmin, berdoalah kepada Tuhan kalian dengan mengiba, merendah dan tunduk dalam kesunyian karena itu jauh dari pamer. Sesungguhnya Allah SWT membenci orang-orang yang melampaui batas dalam berdoa dan hal lainnya dengan meninggikan suara dan menjerit atau berdoa dengan sesuatu yang tidak diperbolehkan atau tidak dianjurkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berdoalah kepada Tuhan kalian dengan rendah hati} dengan rendah hati dan tunduk {dan suara yang lembut} suara rahasia {Sesungguhnya Dia tidak menyukai orang-orang yang melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55 Doa meliputi doa permohonan dan doa ibadah. Dia memerintahkan kita untuk berdoa kepadaNya, ”dengan berendah diri” yakni terus menerus dalam memohon dan ulet dalam beribadah “dan suara yang lembut” yakni tidak keras dan terang-terangan yang dilakukan timbul riya’, akan tetapi dengan lembut dan ikhlas kepadaNya “sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas” yaitu orang-orang yang melampauui batas dalam segala urusan, termasuk didalamnya adalah permintaan seorang hamba kepada Allah terhadap sesuatu yang tidak layak, atau terlalu berlebihan dalam memfasih-fasihkan kalimat doa, atau berlebih-lebihan dalam mengeraskan doanya semua itu termasuk kedalam sikap berlebih-lebihan yang di larang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 55: Setelah Allah menyebutkan keagungan dan kebesaran-Nya yang menunjukkan kepada orang-orang yang berakal bahwa hanya Dia yang berhak diibadahi, ditujukan dalam memenuhi semua kebutuhan, maka dalam ayat ini Allah Subhaanahu wa Ta'aala memerintahkan konsekwensinya. Tidak keras-keras yang dikhawatirkan timbul riya’ daripadanya. Termasuk melampaui batas adalah melampaui batas tentang sesuatu yang diminta (seperti meminta sesuatu yang tidak cocok baginya), berlebihan dalam meminta, melampaui batas dalam cara meminta, keras-keras dalam berdoa, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 55",
    "description": "Berdoalah kepada tuhanmu yang telah menciptakan dan memeliharamu, dengan rendah hati dan suara yang lembut, yakni tidak terlalu keras, namun tidak pula terlalu pelan, tetapi di antara keduanya. Sungguh, dia tidak menyukai orang-orang yang melampaui batas dalam berdoa dan segala hal. Dan janganlah kamu berbuat kerusakan di bumi setelah diciptakan dengan baik. Berdoalah kepada-Nya dengan rasa takut sehingga kamu lebih khusyuk dan terdorong untuk menaati-Nya, dan penuh harap terhadap anugerah-Nya dan pengabulan doamu. Sesungguhnya rahmat Allah sangat dekat kepada orang yang berbuat kebaikan."
  }
]