[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian melakukan perbuatan kerusakan di muka bumi dengan cara apapun dari macam-macam kerusakan, setelah Allah memperbaikinya dengan pengutusan para rasul dan memakmurkannya dengan amal ketaatan kepada Allah. Dan berdoalah kepadaNYa dengan keikhlasan doa bagiNya, dengan diiringi rasa takut terhadap siksaanNya dan berharap akan pahalaNYa. Sesungguhnya rahmat Allah itu dekat kepada orang-orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan janganlah kalian membuat kerusakan di muka bumi dengan melakukan perbuatan maksiat setelah keadaannya diperbaiki oleh Allah melalui pengutusan para rasul -‘Alaihimussalām- dan memakmurkannya dengan ketaatan makhluk-Nya hanya kepada-Nya. Dan berdoalah kalian kepada Allah semata seraya merasa takut akan siksa-Nya dan menunggu datangnya ganjaran dari-Nya. Sesungguhnya rahmat Allah amat dekat dengan orang-orang yang berbuat baik. Maka jadilah kalian orang-orang yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَلَا تُفْسِدُوا۟ فِى الْأَرْضِ (Dan janganlah kamu membuat kerusakan di muka bumi) Dengan membunuh manusia, menghancurkan rumah-rumah, membunuh hewan-hewan dan menebang pepohonan, dan mengeringkan sungai-sungai. Dan termasuk berbuat kerusakan di muka bumi juga, kafir terhadap Allah, terjerumus kedalam kemaksiatan, dan tidak menjalankan aturan sesuai syariat setelah ia ditentukan dan ditetapkan. بَعْدَ إِصْلٰحِهَا(sesudah (Allah) memperbaikinya) Setelah Allah memperbaikinya dengan mengutus para Rasul, menurunkan kutab-kitab, menetapkan syariat-syariat, dan setelah dibangun baik oleh orang beriman atau orang kafir. وَادْعُوهُ خَوْفًا وَطَمَعًا ۚ (dan berdoalah kepada-Nya dengan rasa takut (tidak akan diterima) dan harapan (akan dikabulkan)) Yakni khawatir akan tidak dikabulkan oleh Allah, dan mengharap-harap untuk dikabulkan. إِنَّ رَحْمَتَ اللهِ قَرِيبٌ مِّنَ الْمُحْسِنِينَ (Sesungguhnya rahmat Allah amat dekat kepada orang-orang yang berbuat baik) Dalam ayat ini terdapat dorongan dan pemberian semangat bagi hamba-hamba-Nya untuk berbuat kebaikan. Dan (المحسنون) yaitu orang-orang yang mengumpulkan dalam dirinya keimanan kepada Allah dan kepada hal yang ghaib, dan menjalankan kewajiban-kewajiban kepada Allah, dan menjauhi larangan-larangan-Nya, serta merasa diawasi oleh Allah sehingga mereka memperbaiki amalan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). 'Athiyah berkata : Jauhilah oleh kalian kemaksiatan di dunia karena sesungguhnya Allah akan menahan hujan-Nya dan mematikan tanaman kalian karena kemaksiatan itu, kemudian Al-Baghawi memberi komentar : oleh karena itu makna { بَعْدَ إِصْلَاحِهَا } adalah setelah Allah memperbaiki bumi ini dengan hujan-Nya. 2 ). Tatkala firman Allah : { وَادْعُوهُ خَوْفًا وَطَمَعًا } mencakup seluruh tingkatan-tngkatan iman dan ihsan, yang terdiri dari : al-hub, dan al-Khouf, dan al-Roja', Allah kemudian mengatakan setelahnya : { إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ } \"Sesungguhnya rahmat Allah amat dekat kepada orang-orang yang berbuat baik\", yakni : sesungguhnya hanyalah orang yang takut dan berharap kepada Allah yang akan meraih apa yang ia minta, dan sesungguhnya ia adalah orang yang berbuat baik, dan rahmat Allah akan senantiasa dekat dengannya. 3 ). { وَادْعُوهُ خَوْفًا وَطَمَعًا } Allah menyebutkan \"الطمع\" - yang berarti \"al-Roja' atau harapan- dalam ayat doa ini; karena doa dibangun atas dasar harapan, maka jika seorang hamba berdoa tetapi tidak ada harapan dalam hatinya, maka seakan-akan ia tidak mengharapkan sesuatu dari doanya, dan permintaan yang tidak disertai di dalamnya harapan akan ada halangan untuk terkabulnya doa dan permintaan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Janganlah kalian berbuat kerusakan di bumi dengan berbuat syirik dan maksiat setelah diperbaiki dengan pengutusan para rasul, penurunan kitab, dan dijelaskan tentang syariat. Dan berdoalah kepada Allah SWT karena takut dengan hukumanNya dan menginginkan rahmat dan keutamaanNya. Sesungguhnya rahmat, ampunan dan ijabah Allah atas doa itu merupakan perkara yang dekat dengan orang-orang yang baik amalnya, yaitu orang-orang yang mengikuti perintahNya dan meninggalkan laranganNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah berbuat kerusakan di bumi setelah diatur dengan baik} setelah Allah memperbaikinya dengan mengutus para rasul dan menjelaskan syariat {Berdoalah kepadaNya dengan rasa takut dan penuh harap. Sesungguhnya rahmat Allah sangat dekat dengan orang-orang yang berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56 “dan janganlah kamu membuat kerusakan di muka bumi” dengan kemaksiatan “sesudah (Allah) memperbaikinya” dengan ketaatan, karena kemaksiatan dapat merusak akhlak, amal, dan rizki, sebagaimana firman Allah “telah Nampak kerusakan di darat dan di laut disebabkan karena perbuatan tangan manusia.” Sebagaimana akhlak, amal rizki, keadaan dunia dan akhirat menjadi baik dengan ketaatan. ”dan berdoalah kepadaNya dengan rasa takut (tidak akan diterima) dan harapan (akan dikabulkan)“ yakni takut kepada azabNya dan berharap pahalaNya, berharap di terima dan takut di tolak, bukan doa seorang hamba yang lancang kepada Rabbnya yang mengagumi dirinya dan mendudukannya diatas kedudukan yang semestinya, atau doa dari hamba yang lupa dan lalai. Kesimpulan dari adab doa yang Allah sebutkan adalah hendaknya doa itu diikhlaskan hanya kepada Allah semata, karena hal itu merupakan sikap merendahkan suara, memelankan dan merahasiakannya. Hendaknya hati kita ketika berdoa adalah hati yang takut nan penuh berharap, bukan hati yang lalai, merasa yakin pasti di terima, atau tidak peduli doa itu dikabulkan atau tidak. Ini adalah termasuk berbuat baik dalam doa. karena berbuat baik dalam ibadah adalah mengerahkan usaha padanya dan menunaikannya dengan sempurna, tidak ada kekurangan sedikitpun. Oleh karena itu Dia berfirman ”sesungguhnya rahmat Allah amat dekat kepada orang-orang yang berbuat baik” dalam beribadah kepada Allah, berbuat baik kepada hamba-hamba Allah. semakin banyak seorang hamba berbuat baik, maka dia semakin dekat dengan rahmat Allah, dan Allah pun dekat kepadanya dengan rahmatNya. ini adalah dorongan kepada berbuat baik yang sangat jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 56: Dengan syirk dan kemaksiatan. Dengan mengutus para rasul. Terhadap siksa-Nya dan takut jika ditolak. Terhadap rahmat-Nya, serta berharap agar diterima. Berdasarkan ayat ini, seorang yang berdoa hendaknya tidak merasa ujub dengan dirinya, menempatkan dirinya melebihi kedudukannya, dan berdoa dengan hati yang lalai lagi lengah. Ini semua termasuk ihsan dalam berdoa, karena ihsan dalam beribadah berarti ia melakukannya dengan sunguh-sungguh dan melakukannya dengan sempurna. Yakni orang-orang yang berbuat ihsan dalam ibadahnya dan berbuat ihsan terhadap orang lain. Oleh karena itu, jika seorang hamba banyak berbuat ihsan, maka semakin dekat dengan rahmat Alah. Dalam ayat ini terdapat anjuran berbuat ihsan. Disebutkan kata-kata “qarib” (dekat) dengan bentuk mudzakkar sebagai khabar dari rahmat Allah, karena disandarkan rahmat tersebut kepada Allah, atau karena rahmat tersebut berarti pahala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 56",
    "description": "Dan janganlah kamu berbuat kerusakan di bumi setelah diciptakan dengan baik. Berdoalah kepada-Nya dengan rasa takut sehingga kamu lebih khusyuk dan terdorong untuk menaati-Nya, dan penuh harap terhadap anugerah-Nya dan pengabulan doamu. Sesungguhnya rahmat Allah sangat dekat kepada orang yang berbuat kebaikan. Dialah Allah yang meniupkan dan menggerakkan angin sebagai kabar gembira, yakni tanda yang mendahului kedatangan rahmat-Nya, yaitu turunnya hujan, sehingga apabila angin itu membawa awan mendung, kami halau ke suatu daerah yang tandus yang telah rusak tanamannya karena ketiadaan air, lalu kami turunkan hujan lebat di daerah yang tandus itu hingga daerah tersebut menjadi subur. Kemudian kami tumbuhkan dengan hujan itu berbagai macam buah-buahan dan tanaman yang beragam warna dan rasanya. Seperti menumbuhkan tanah yang sudah mati menjadi subur itulah kami membangkitkan orang yang telah mati, mudahmudahan kamu, wahai manusia, mengambil pelajaran bahwa hari kebangkitan adalah benar adanya."
  }
]