[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah , Dia lah yang telah mengirim angin-angin yang baik dengan membawa kabar gembira akan datangnya hujan yang ia sebarkan dengan izin Allah, sehingga makhluk-makhluk akan meresakan kegembiraan terhadap rahmat Allah, hingga apabila angin itu telah menghimpun awan yang sarat dengan air hujan, Allah menyiramnya dengan air hujan tersebut supaya bisa menghidupkan daerah yang tanahnya telah tandus dan telah mengering pepohonan dan tanaman-tanamannya, maka dengan itu, Allah menurunkan air hujan, dan Allah menumbuhkan dengan sebab hujan itu rerumputan, pepohonan, dan tanaman-tanaman. Setelah itu, pohon-pohon kembali dipenuhi oleh berbagai macam buah-buahan. Sebagiamana kami menghidupkan daerah yang telah mati dengan air hujan, Kami pun akan menghidupkan orang-orang mati dari kubur-kubur mereka dalam keadaan hidup-hidup setelah kehancuran mereka agar kalian dapat mengambil pelajaran dengan itu, dan selanjutnya kalian menjadikannya sebagai petunjuk terhadap keesaan Allah dan kekuasaanNya untuk membangkitkan jasad yang telah mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Allah -Subḥānahu- adalah Rabb yang mengirimkan angin untuk memberi kabar gembira akan datangnya hujan. Sampai ketika angin itu membawa gumpalan awan pekat yang berisi air, maka Kami giring awan itu ke daerah yang gersang, lalu Kami turunkan air hujan di daerah tersebut. Kemudian dengan air itu Kami menumbuhkan segala macam buah-buahan. Dan sebagaimana Kami menumbuhkan buah-buahan itu, Kami akan mengeluarkan orang-orang yang mati dari dalam kuburnya dalam kondisi hidup. Kami melakukan hal itu dengan harapan agar kalian -wahai manusia- mengingat kekuasaan Allah dan keindahan ciptaan-Nya. Sesungguhnya Dia Mahakuasa untuk menghidupkan kembali orang-orang yang sudah mati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Allah mengabarkan tentang karunia-Nya dalam menghidupkan bumi yang mati, sebagai bukti adanya hari kebangkitan. Dia mengirim angin sebagai pembawa kabar gembira akan datangnya hujan; hingga jetika angin itu telah mengumpulkan awan-awan mendung yang dipenuhi air, Kami menurunkannya ke tanah yang tandus yang tidak ada tanaman. Sehingga dengan keagungan dan kekuasaan Kami yang sempurna, Kami menurunkan hujan dari awan tersebut, lalu dengan air itu Kami tumbuhkan segala jenis buah-buahan. Sebagaimana Kami mengeluarkan buah-buahan dari tanah yang tandus, demikian pula Kami mengeluarkan dan menghidupkan orang-orang mati dari kubur mereka pada hari kebangkitan. Hal ini agar kalian mengingat kekuasaan Allah dan beriman kepada hari kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَهُوَ الَّذِى يُرْسِلُ الرِّيٰحَ (Dan Dialah yang meniupkan angin) Ayat ini mengandung penyebutan salah satu nikmat dari nikmat-nikmat yang telah diberikan Allah kepada hamba-hamba-Nya serta sebagai bukti atas ke-Esaan-Nya dan ketetapan sifat ketuhanan-Nya. بُشْرًۢا (sebagai pembawa berita gembira) Yakni angin yang membawa berita gembira berupa hujan. حَتَّىٰٓ إِذَآ أَقَلَّتْ سَحَابًا ثِقَالًا (hingga apabila angin itu telah membawa awan mendung) Yakni hingga ketika angin itu berhembus membawa awan yang berat karena mengandung air. سُقْنٰهُ(Kami halau) Yakni awan itu. لِبَلَدٍ مَّيِّتٍ(ke suatu daerah yang tandus) Yakni tanah gersang yang tidak ada tumbuhan padanya. فَأَنزَلْنَا بِهِ الْمَآءَ(lalu Kami turunkan hujan di daerah itu) Yakni di tanah tersebut. فَأَخْرَجْنَا بِهِۦ(maka Kami keluarkan dengan sebab hujan itu) Yakni dengan air hujan itu. مِن كُلِّ الثَّمَرٰتِ ۚ( pelbagai macam buah-buahan) Yakni dengan semua jenisnya. كَذٰلِكَ نُخْرِجُ الْمَوْتَىٰ( Seperti itulah Kami membangkitkan orang-orang yang telah mati) Yakni sebagaimana dikeluarkannya buah-buahan dengan cara yang menakjubkan tersebut maka adakah sesuatu yang menghalangi Allah untuk mengeluarkan orang-orang mati dari kubur mereka. لَعَلَّكُمْ تَذَكَّرُونَ (mudah-mudahan kamu mengambil pelajaran) Sehingga kalian mengetahui besarnya kekuasaan-Nya dan keluarbiasaan ciptaan-Nya, serta mengetahui bahwa Dia berkuasa untuk membangkitkan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Dialah Allah SWT yang mengutus angin kencang yang membawa kabar baik dan hujan deras, hingga apabila angin itu membawa awan yang penuh dengan air, Kami halau awan itu untuk menghidupkan tanah tandus yang tidak ada tanaman di dalamnya, lalu Kami turunkan air di negeri itu, lalu Kami tumbuhkan berbagai jenis buah. Sebagaimana menumbuhkan buah dan tanaman itu, Kami mengeluarkan orang-orang mati dari kuburan dalam keadaan hidup pada hari pembangkitan, supaya kalian merenung dan mempelajari kuasa Allah untuk membangkitkan dan atas segala sesuatu, serta supaya kalian beriman hanya kepada Allah, tiada sekutu bagiNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang mengutus angin sebagai kabar gembira} kabar gembira {yang mendahului kedatangan rahmatNya} mendahului hujan {sehingga apabila angin itu membawa} angin itu membawa {awan yang berat} yang mengandung air {Kami halau ia ke suatu negeri yang mati} negeri yang tandus, tiada tumbuhan di dalamnya {lalu Kami turunkan hujan di sana. Kemudian Kami tumbuhkan dengan hujan itu berbagai macam buah-buahan. Seperti itulah Kami membangkitkan orang-orang mati agar kalian ingat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57 Allah menjelaskan salah satu bukti kuasaNya dan salah satu bentuk karuniaNYa. Dia berfirman ”dan Dialah yang meniupkan angin sebagai pembawa berita gembira sebelum datang RahmatNya (hujan)” yakni angin yang membawa hujan, yang memicu hujan dari bumi dengan izin Allah maka makhluk bersuka cita dengan rahmat Allah dan hati mereka menjadi tenang sebelum ia turun. ”hingga apabila angin itu membawa awan mendung” sebagian darinya meniupnya lalu ia bertemu dengan angin yang lain, dan bersatu dengan angin yang lain lagi. ”kami halau ke suatu daerah yang tandus” hewan-hewannya hampir mati dan manusianya hampir berputus asa atas rahmat Allah “lalu kami turunkan” pada daerah yang tandus itu “hujan” yang deras dari awan itu. Allah mengirimkan angin yang mengucurkannya dan angin yang meratakannya dengan izin Allah. Lalu kami tumbuhkan dengannya tumbuhan-tumbuhan, maka mereka bersuka cita dengan rahmat Allah, dan menikmati kebaikan Allah. FirmanNYa ”seperti itulah kami membangkitkan orang-orang yang mati. mudah-mudahan kamu mengambil pelajaran.” Yakni sebagaimana kami hidupkan bumi setelah ia mati dengan tumbuhan-tumbuhan, maka begitu pula kami mengeluarkan orang-orang mati dari kubur mereka setelah mereka sebelumnya adalah tulang-belulang yang tercecer. Ini adalah argument yang sangat jelas. karena diantara kedua perkara tersebut tidak ada perbedaan. orang yang mengingkari kebangkitan karena menurutnya mustahil, padahal ia melihat yang sama dengannya adalah orang yang sombong yang mengingkari hal-hal kongkrit. Ini mengandung dorongan untuk merenungkan dan memikirkan nimat-nikmat Allah dengan mata yang dapat mengambil pelajaran dan ibarah, bukan mata yang penuh dengan kelalaian dan kelengahan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 57: Untuk dihidupkannya, di mana sebeumnya hewan-hewannya hampir binasa dan penduduknya hampir berputus asa dari rahmat Allah. Yakni sebagaimana Kami hidupkan tanah yang mati dengan ditumbuhnya pohon-pohon, seperti itulah Kami menghidupkan orang-orang yang telah mati dari kubur-kubur mereka setelah sebelumnya mereka sebagai tulang belulang. Hal ini adalah pendalilan yang jelas, karena tidak ada perbedaan antara kedua perkara tersebut. Oleh karena itu, orang yang mengingkari kebangkitan padahal ia melihat sesuatu yang semisalnya, sama saja orang yang memang keras kepala, dan sama saja mengingkari hal yang dapat dirasakan. Dalam ayat ini terdapat anjuran untuk memikirkan nikmat-nikmat Allah, melihatnya dengan mengambil pelajaran, tidak dengan hati yang lalai dan kurang peduli. Sehingga kamu beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 57",
    "description": "Dialah Allah yang meniupkan dan menggerakkan angin sebagai kabar gembira, yakni tanda yang mendahului kedatangan rahmat-Nya, yaitu turunnya hujan, sehingga apabila angin itu membawa awan mendung, kami halau ke suatu daerah yang tandus yang telah rusak tanamannya karena ketiadaan air, lalu kami turunkan hujan lebat di daerah yang tandus itu hingga daerah tersebut menjadi subur. Kemudian kami tumbuhkan dengan hujan itu berbagai macam buah-buahan dan tanaman yang beragam warna dan rasanya. Seperti menumbuhkan tanah yang sudah mati menjadi subur itulah kami membangkitkan orang yang telah mati, mudahmudahan kamu, wahai manusia, mengambil pelajaran bahwa hari kebangkitan adalah benar adanya. Kemudian Allah memberikan perumpamaan dengan tanah baik dan subur serta tanah yang buruk dan tidak subur untuk menjelaskan sifat dan tabiat manusia. Orang yang baik sifatnya akan dapat menerima kebenaran, sementara orang yang buruk sifat dan tabiatnya tidak dapat menerima kebenaran. Dan jika hujan turun pada tanah yang baik, tanaman-tanamannya akan tumbuh subur dengan izin tuhan; dan adapun jika hujan turun pada tanah yang buruk, ia tidak akan dapat menumbuhkan tanaman yang baik melainkan hanya akan menumbuhkan tanaman-tanamannya yang tumbuh merana. Demikianlah kami menjelaskan berulang-ulang tanda-tanda kebesaran kami bagi orang-orang yang bersyukur."
  }
]