[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tanah yang bersih, jika turun hujan padanya, akan mengeluarkan tanaman-tanaman dengan izin Allah dan kehendakNya dalam keadaan baik-baik lagi mudah. Begitupula seorang mukmin, jika turun padanya ayat-ayat Allah, dia kan mendapatkan manfaat darinya dan menimbulkan pengaruh pada dirinya berupa kehidupan yang baik. Adapun tanah yang bergaram lagi buruk, sesungguhnya ia tidak bisa menumbuhkan tanaman, kecuali dengan susah payah lagi jelek yang tidak membawa manfaat sama sekali, dan tidak dapat menumbuhkan tanaman dengan baik, begitu pula orang kafir, dia tidak memperoleh manfaat dari ayat-ayat Allah. Dengan variasi yang tiada duanya dalam mengetengahkan penjelasan, kami mengemukakan hujjah-hujjah dan bukti-bukti yang berbeda-beda jenisnya untuk menetapkan kebenaran kepada manusia-manusia yang mensyukuri nikmat-nikmat Allah dan taat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Tanah yang baik akan menumbuhkan tanamannya secara baik dan sempurna dengan izin Allah. Begitu pula orang yang beriman akan mendengarkan nasihat dan mendapatkan manfaat darinya, kemudian menghasilkan amal perbuatan yang baik. Sedangkan tanah yang gersang dan tandus tidak akan menumbuhkan tanamannya kecuali dengan susah payah dan tidak baik. Begitu juga orang yang kafir tidak akan mendapatkan manfaat dari nasihat yang diterimanya, sehingga tidak menghasilkan amal perbuatan yang baik dan bermanfaat. Sebagaimana contoh-contoh yang beragam dan indah itu Kami memberikan bukti-bukti dan argumen-argumen yang beragam untuk membuktikan kebenaran bagi orang-orang yang mensyukuri nikmat-nikmat Allah, sehingga mereka tidak mengingkarinya dan senantiasa patuh kepada Rabb mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Dan negeri yang memiliki tanah yang subur akan mengeluarkan tanaman yang baik dan bermanfaat atas kehendak Allah. Sedangkan negeri yang memiliki tanah yang tandus maka hanya akan mengeluarkan tanaman yang buruk yang tumbuh dengan susah payah. Demikianlah perumpamaan orang mukmin, dia adalah orang baik dan amalannya juga baik, seperti tanah yang baik yang mengeluarkan buah yang baik. Sedangkan orang kafir adalah orang yang buruk dan amalannya juga buruk, seperti tanah yang buruk yang buahnya tidak bermanfaat. Dengan penjelasan yang agung ini kami jelaskan ayat-ayat yang menunjukkan besarnya kekuasaan Allah bagi orang-orang yang bersyukur kepada Allah dengan perkataan dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُۥ بِإِذْنِ رَبِّهِۦ ۖ (Dan tanah yang baik, tanaman-tanamannya tumbuh subur dengan seizin Allah) Yakni tanah yang baik dan subur akan menumbuhkan tanaman yang subur atas izin Allah dengan pertumbuhan yang baik dan sempurna. وَالَّذِى خَبُثَ لَا يَخْرُجُ إِلَّا نَكِدًا ۚ( dan tanah yang tidak subur, tanaman-tanamannya hanya tumbuh merana) Adapun tanah yang buruk tidak menumbuhkan kecuali tanaman yang jelek. Ini merupakan perumpamaan bagi hati, Allah memberi perumpamaan hati yang mau menerima pelajaran dan nasehat dengan tanah yang baik lagi subur, dan perumpamaan hati yang jauh dari pelajaran dan nasehat dengan tanah yang tidak subur. لِقَوْمٍ يَشْكُرُونَ (bagi orang-orang yang bersyukur) Yakni bersyukur kepada Allah dan mengakui kenikmatan yang dikaruniakan-Nya. Ibnu Abbas mengatakan dalam tafsir ayat (والبلد الطيب): ini merupakan perumpamaan yang diberikan Allah bagi orang yang beriman, dengan mengatakan: dia adalah orang yang baik dan amalannya juga baik seperti tanah yang subur yang menghasilkan buah yang baik, adapun tanah yang buruk sebagai perumpamaan orang kafir, ia seperti tanah yang memiliki kandungan garam yang tinggi yang tidak membawa keberkahan, karena orang kafir adalah orang yang buruk dan amalannya juga buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Negeri yang baik tanahnya dan sangat subur, yang mana bisa menumbuhkan tanaman yang mekar dengan sempurna, dan negeri yang tidak subur tanahnya, layaknya tanah rawa atau tanah yang mengandung kadar garam yang sangat sukar menumbuhkan tanaman dan tidak mengandung kebaikan. Ini adalah perumpamaan yang dapat dirasakan bagi orang yang menerima panggilan iman dan orang kafir yang menolak beriman. Seperti penjelasan itulah Kami menerangkan ayat-ayat yang menunjukkan kepada kuasa yang luar biasa dan aturan yang sempurna bagi kaum yang bersyukur kepada Allah dan menyadari nikmatNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tanah yang baik, tanaman-tanamannya tumbuh subur atas seizin Tuhannya. Dan tanah yang tidak subur} negeri yang buruk, seperti tanah lumpur yang kering dan tanah-tanah yang serupa {tidak ada menumbuhkan tanaman kecuali hanya merana} kesusahan yang tidak ada kebaikan di dalamnya {Demikianlah Kami menjelaskan} merincikan {tanda-tanda kebesaran bagi orang-orang yang bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58 kemudian Allah menyebutkan perbedaan bumi yang disirami oleh hujan. Dia berfirman “dan tanah yang baik” yakni materi dan strukturnya baik jika disiram air. ”tanaman-tanamannya tumbuh subur” yang memang disiapkan untuknya ”dengan siizin Allah” yakni dengan kehendak dan keinginan Allah, karena sebab tidak secara independen mewujudkan musabab (akibat) sehingga Allah mengijnkannya terjadi. ”dan tanah yang tidak subur, tanaman-tanamannya hanya tumbuh merana” yakni tumbuh-tumbuhan yang tidak berguna dan tidak berlaku. ”demikianlah kami mengulangi tanda-tanda kebesaran (kami) bagi orang-orang yang bersyukur”. Kami membuatya bermacam-macam, kami menjelaskannya, kami membuat perumpamaan padanya, dan kami menyodorkannya kepada umat yang bersyukur kepada Allah dengan mengakui nikmatNya dan menggunakannya dalam keridahanNya. Mereka itulah orang-orang yang dapat mengambil manfaat dengan hukum-hukum dan tuntunan ilahiyah yang diperinci oleh Allah, karena mereka memandang bahwa mereka ia adalah nikmat terbesar dari Rabb mereka kepada mereka, maka mereka pun menerimaanya dengan kebutuhan dan kebahagiaan padaNYa, lalu mereka merenungkan dan memikirkannya, Allah menjelaskan kepada mereka makna-maknanya berdasarkan kesiapan mereka. Ini perumpamaan bagi hati manakala wahyu turun kepadanya yang merupakan sumber kehidupan sebagaimana hujan adalah sumber kehidupan. Hati yang baik, ketika wahyu datang kepadanya, maka ia akan menerimanya, mengetahuinya dan ia tumbuh sesuai dengan dasarnya yang baik dan unsurnya yang bagus. Adapun hati yang busuk yang tida ada kebaikan di dalamnya jika wahyu datang kepadanya, maka ia tidak mau menerimanya, lalai dan berpaling atau menentang. Seperti hujan yang turun ke tanah yang bergaram, berpasir dan berbatuan, ia tidak memberi bekas apapun padanya, seperti FirmanNya” Allah telah menurunkan air hujan dari langit, maka mengalirlah air di lemah-lembah menurut ukurannya, maka arus itu membawa buih yang mengembang”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 58: Seperti inilah perumpamaan orang-orang mukmin yang mendengarkan nasehat, lalu ia mengambil manfaat daripadanya. Yakni susah untuk tumbuh, dan seperti inilah perumpamaan orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 58",
    "description": "Kemudian Allah memberikan perumpamaan dengan tanah baik dan subur serta tanah yang buruk dan tidak subur untuk menjelaskan sifat dan tabiat manusia. Orang yang baik sifatnya akan dapat menerima kebenaran, sementara orang yang buruk sifat dan tabiatnya tidak dapat menerima kebenaran. Dan jika hujan turun pada tanah yang baik, tanaman-tanamannya akan tumbuh subur dengan izin tuhan; dan adapun jika hujan turun pada tanah yang buruk, ia tidak akan dapat menumbuhkan tanaman yang baik melainkan hanya akan menumbuhkan tanaman-tanamannya yang tumbuh merana. Demikianlah kami menjelaskan berulang-ulang tanda-tanda kebesaran kami bagi orang-orang yang bersyukur. Setelah pada ayat yang lalu diterangkan tentang nikmat Allah berupa hujan yang bisa menumbuhkan tanah tandus dan tanamtanaman sebagai bukti keesaan Allah untuk menghidupkan orangorang yang telah mati pada hari kiamat, pada ayat ini dan ayat-ayat selanjutnya Allah menyebutkan kisah beberapa nabi terdahulu dan umatnya sebagai pelajaran bagi umat nabi Muhammad. Penyebutan kisah-kisah nabi ini dimulai dari kisah nabi nuh, rasul pertama yang mengajarkan ajaran tauhid. Sungguh, kami benar-benar telah mengutus nabi nuh kepada kaumnya untuk mengajak mereka mengesakan Allah dan memurnikan ibadah hanya kepada-Nya, lalu dia berkata dengan lemah lembut dan sopan, wahai kaumku! sembahlah Allah yang maha esa! tidak ada tuhan atau sembahan yang layak disembah bagimu selain dia. Sesungguhnya jika kamu durhaka dan tetap menyembah berhalaberhalamu, aku takut kamu akan ditimpa azab yang pedih akibat kekufuranmu pada hari yang dahsyat, yakni hari kiamat."
  }
]