[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kami telah mengutus Nuh kepada kaumnya untuk menyeru mereka agar mengesakan Allah dan mengkhihlaskan ibadah kepadaNYa. Dia berkata kepada mereka, ”wahai kaumku, sembahlah Allah semata dan tunduklah kepadNYa dengan ketaatan. Tidak ada sesembahan bagi kalian yang berhak disembah selainNya. Maka ikhlashkanlah Dia dalam beribadah. Jika kalian tidak melakukannya dan tetap dalam penyembahan terhadap patung-patung, sesungguhnya aku khawatir akan ditimpa kepada kalian siksaan pada hari yang besar mara bahaya nya”. yaitu hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Sungguh Kami telah mengutus Nuh kepada kaumnya sebagai seorang rasul untuk mengajak mereka mengesakan Allah dan melarang mereka menyembah selain Allah. Maka ia berkata kepada mereka, “Wahai kaumku! Sembahlah Allah semata. Karena kalian tidak punya tuhan lain yang berhak disembah selain Dia. Sesungguhnya aku khawatir kalian akan ditimpa azab pada hari yang besar (hari Kiamat) apabila kalian mempertahankan kekafiran kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Sungguh telah Kami utus Nabi Nuh kepada kaumnya untuk menyeru mereka agar beribadah kepada Allah. Nabi Nuh menyeru mereka dengan lembut: \"Hai kaumku, sembahlah Allah Semata karena tidak ada Tuhan selain Dia. Sungguh aku khawatir akibat kesyirikan yang kalian lakukan, kalian akan mendapat azab yang pedih pada hari yang sangat mengerikan, baik itu di dunia maupun di akhirat.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. لَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِۦ (Sesungguhnya Kami telah mengutus Nuh kepada kaumnya) Nabi Nuh merupakan rasul pertama yang diutus di muka bumi setelah Nabi Adam, ia hidup di negeri Irak. Ada pendapat mengatakan bahwa nabi Idris diutus sebelum nabi Nuh. فَقَالَ يٰقَوْمِ اعْبُدُوا۟ اللهَ مَا لَكُم مِّنْ إِلٰهٍ غَيْرُهُۥٓ (lalu ia berkata: “Wahai kaumku sembahlah Allah, sekali-kali tak ada Tuhan bagimu selain-Nya”) Yakni sembahlah Dia karena tidak ada Tuhan bagi kalian selain Dia yang berhak untuk kalian sembah. إِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ (Sesungguhnya (kalau kamu tidak menyembah Allah), aku takut kamu akan ditimpa azab hari yang besar) Yakni jika kalian tidak menyembah-Nya maka aku khawatir kalian akan mendapat azab di hari kiamat, atau azab di hari datangnya banjir bandang. Dahulu kaum nabi Nuh menyembah berhala-berhala mereka yang disebutkan Allah dalam surat Nuh, nama-nama mereka adalah Wadd, Suwaa’, Yaghust, Ya’uuq, dan Nasr. Nabi Nuh menyeru mereka untuk kembali kepada agama tauhid sebagaimana yang ada pada masa Nabi Adam dan generasi setelahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Sungguh Kami telah mengutus Nuh AS sebagai rasul pertama di bumi untuk memberi petunjuk kepada kaumnya, dan berkata: “Wahai kaumku menyembahlah hanya kepada Allah, tiada Tuhan selain Dia. Sesungguhnya aku mengkhawatirkan azab pada hari yang sangat dahsyat atas kalian karena berbuat syirik, yaitu hari kiamat atau hari terjadinya banjir bandang”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah mengutus Nuh kepada kaumnya, lalu ia berkata,“Wahai kaumku, sembahlah Allah, tidak ada tuhan bagi kalian selain Dia.” Sesungguhnya aku takut kalian akan ditimpa azab dari hari yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Setelah Allah memaparkan dalil tauhid dengan kadar yang memadahi, maka Dia mendukung itu dengan memaparkan apa yang telah terjadi dengan nabi-nabiNya yang telah menyeru pada tauhid bersama mereka umat-umatnya yang mengingkaronya. Bagaimana Allah menolng dan menguatkan ahli tauhid dan membinasakan orang-orang yang menentang mereka dan tidak tunduk kepada mereka, bagaiman adakwah para rasul bersatu diatas agama dan keyakinan yang satu. 59 Allah berfirman tentang Nuh, Rasul pertama “sesungguhnya kami telah mengutus Nuh kepada kaumnya”. Dia mengajak mereka supaya beribadah hanya kepada Allah semata manakala mereka menyembah berhala-berhala. ”lalu ia berkata” kepada mereka, “wahai kaumku sembahlah Allah” yakni tauhidkanlah Dia “sekali-kali tidak ada tuhan bagimu selainNya” Karena Dia adalah pencipta, pemberi rizki dan pengatur atas segala sesuatu, sedangkan selainNya adalah makhluk yang diatur yang tidak memiliki perkara sedikitpun. Kemudian mereka menakut-nakuti mereka dengan azab Allah jika mereka tidak menaatinya, ”sesungguhnya jika kamu tidak menyembah Allah aku takut kamu akan ditimpa azab hari yang besar (kiamat)” ini termasuk kepedulian dan kasih sayang Nuh terhadap kaumnya, dimana dia mengkhawatirkan azab dan kesengsaraan abadi menimpa mereka, sama seperti saudara-saudaranya para rasul yang lain menyayangi manusia melebihi kasih sayang bapak ibu mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 59: Setelah Allah menyebutkan dalil-dalil tentang keesaan-Nya secara garis besar, Allah memperkuat dengan kisah para nabi bersama kaumnya. Nabi tersebut mengajak kaumnya kepada tauhid, namun kaumnya malah mengingkari. Di sana Allah menyebutkan, bagaimana Dia menguatkan orang-orang yang membela tauhid dan membinasakan orang-orang yang menentangnya, dan menerangkan bahwa seruan para rasul sama dan di atas agama serta keyakinan yang sama. Jika kamu menyembah selain-Nya. Hal ini menunjukkan bahwa para nabi sangat sayang kepada kaumnya dan menginginkan kebaikan didapatkan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 59",
    "description": "Setelah pada ayat yang lalu diterangkan tentang nikmat Allah berupa hujan yang bisa menumbuhkan tanah tandus dan tanamtanaman sebagai bukti keesaan Allah untuk menghidupkan orangorang yang telah mati pada hari kiamat, pada ayat ini dan ayat-ayat selanjutnya Allah menyebutkan kisah beberapa nabi terdahulu dan umatnya sebagai pelajaran bagi umat nabi Muhammad. Penyebutan kisah-kisah nabi ini dimulai dari kisah nabi nuh, rasul pertama yang mengajarkan ajaran tauhid. Sungguh, kami benar-benar telah mengutus nabi nuh kepada kaumnya untuk mengajak mereka mengesakan Allah dan memurnikan ibadah hanya kepada-Nya, lalu dia berkata dengan lemah lembut dan sopan, wahai kaumku! sembahlah Allah yang maha esa! tidak ada tuhan atau sembahan yang layak disembah bagimu selain dia. Sesungguhnya jika kamu durhaka dan tetap menyembah berhalaberhalamu, aku takut kamu akan ditimpa azab yang pedih akibat kekufuranmu pada hari yang dahsyat, yakni hari kiamat. Kaum nabi nuh tidak menghiraukan perkataan nabi nuh, bahkan pemuka-pemuka atau pembesar kaumnya berkata dengan nada menghina, sesungguhnya kami tidak mempercayai apa yang kamu sampaikan, malah kami memandang kamu benar-benar berada dalam kesesatan yang nyata karena kamu memusuhi tuhan-tuhan kami dan menyalahkan cara ibadah kami."
  }
]