[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kami akan benar-benar menanyakan kepada umat-umat yang telah di utus kepada mereka rasul-rasul. ”apa jawaban kalian terhadap rasul-rasul kami yang diutus ketengah kalian?” dan kami akan benar-benar bertanya kepada rasul-rasul tentang ketuntasan penyampain mereka terhadap risalah-risalah mereka dan apa jawaban umat-umat mereka terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sungguh, kelak pada hari Kiamat Kami benar-benar akan bertanya kepada umat-umat yang menerima kedatangan rasul-rasul Kami tentang tanggapan yang mereka berikan kepada para rasul itu. Dan sungguh Kami benar-benar akan bertanya kepada para rasul itu tentang tugas mereka untuk menyampaikan apa yang Kami perintahkan untuk mereka sampaikan dan tentang tanggapan yang diberikan oleh umat-umat mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Allah menegaskan penjelasan-Nya dengan berfirman: “Dengan keagungan dan kekuasaan Kami, sungguh Kami akan bertanya kepada umat-umat yang telah diutus para rasul kepada mereka: ‘Apakah para rasul telah menyampaikan risalah mereka? Dan bagaimana kalian menanggapi risalah itu?’ Dan Kami pasti akan bertanya kepada para rasul: ‘Apakah kalian telah menyampaikan risalah? Dan Apa tanggapan umat kalian terhadap kalian?’”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. فَلَنَسْـَٔلَنَّ الَّذِينَ أُرْسِلَ إِلَيْهِمْ (Maka sesungguhnya Kami akan menanyai umat-umat yang telah diutus rasul-rasul kepada mereka) Yakni mananyai umat-umat yang terdahulu tentang jawaban mereka terhadap rasul-rasul mereka ketika menjalankan dakwah kepada mereka. وَلَنَسْـَٔلَنَّ الْمُرْسَلِينَ (dan sesungguhnya Kami akan menanyai (pula) rasul-rasul (Kami)) Yakni para Nabi yang diutus oleh Allah. Kami akan menanyai mereka tentang jawaban umat-umat mereka kepada mereka, siapa diantara mereka yang taat dan siapa diantara mereka yang durhaka. Itu semua Kami lakukan agar diketahui bahwa Kami tidak menzalimi para penduduk negeri-negeri tersebut ketika Kami membinasakan mereka, kami membinasakan mereka karena mereka berbuat zalim dengan mendustakan para Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Dan aku menegaskan kepada kalian bahwa sungguh Kami akan menanyai umat-umat terdahulu terkait waktu penerimaan mereka kepada para rasul, dan Kami juga akan menanyai para nabi yang diutus terkait penerimaan kaum mereka, dan orang yang taat dan yang bermaksiat di antara mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami akan menanyai orang-orang yang telah diutus kepada mereka para rasul} umat-umat terkait jawaban mereka terhadap para rasul {dan Sungguh Kami akan menanyai para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. dan firmanNYa “maka sesungguhnya kami akan menanyai umat-umat yang telah diutus rasul-rasul kepada mereka” Yakni Kami akan bertanya kepada umat-umat yang telah Allah utus para rosul kepada mereka tentang apa yang mereka jawab kepada rosul-rosul mereka, Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: “Apakah jawabanmu kepada para rasul?” (QS. Al-Qoshos : 65), ”dan sesungguhnya kami akan menanyai pula rasul-rasul kami” tentang penyampaian mereka terhadap risalah Allah dan apa jawaban umat mereka kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 6: Tentang jawaban mereka terhadap para rasul dan amal yang mereka lakukan setelah mendengar dakwah, dan Dia lebih mengetahui. Allah Subhaanahu wa Ta'aala berfirman: Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata, \"Apakah jawabanmu kepada para rasul?\" (Terj. Al Qashash: 65) Apakah mereka telah menyampaikan dakwahnya, dan apa jawaban umat mereka terhadapnya, dan Dia lebih mengetahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 6",
    "description": "Maka pasti akan kami tanyakan kepada umat yang telah mendapat seruan dari para rasul kami, pertanyaan yang berupa celaan keras: apakah para rasul telah memperingatkan mereka' dan kami akan tanyai pula para rasul untuk menjadi saksi: apakah mereka telah melaksanakan tugas dengan baik, bagaimana sikap kaum mereka, apakah menurut atau menentang, dan sebagainya' dan pasti akan kami beritakan kepada mereka dengan ilmu kami, dan kami tidak jauh dari mereka dengan penjelasan yang disertai bukti-bukti yang meyakinkan, karena Allah selalu mengawasi gerak-gerik mereka. Mereka tidak akan bisa berbohong. Pada saat itulah amalan mereka ditimbang dengan timbangan yang tidak pernah meleset, karena Allah mahaadil."
  }
]