[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka pemimpin-pemimpin dan tokoh-tokoh dari kaum mereka berkata kepadanya, ”sesungguhnya kami benar-benar meyakini (wahai nuh), bahwa sesungguhnya kamu berada dalam kesesatan yang nyata dari jalan yang kebenaran. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Para pemuka dan pemimpin kaumnya menjawab, “Sesungguhnya kami benar-benar melihatmu -wahai Nuh- berada dalam kesesatan yang nyata.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Para pemuka kaumnya yang bodoh menjawab dengan penuh kesombongan: \"Hai Nuh, sungguh kami yakin kamu berada dalam kesalahan yang jelas dan jauh dari kebenaran.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. قَالَ الْمَلَأُ (Pemuka-pemuka dari kaumnya berkata) Yakni para pembesar dan pemimpin kaumnya. إِنَّا لَنَرَىٰكَ (Sesungguhnya kami memandang kamu) Dalam seruanmu untuk menyembah hanya kepada Allah. فِى ضَلٰلٍ (berada dalam kesesatan) Yakni sesat dari jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Para pemimpin dan pembesar kaum itu berkata: “Wahai Nuh, sesungguhnya Kami mendapati dirimu dalam kesalahan yang nyata dan menyimpang dari kebenaran”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pemuka-pemuka dari kaumnya berkata} para pemuka dan pemimpin {“Sesungguhnya kami benar-benar melihatmu dalam kesesatan} kesalahan dan jauh dari jalan kebenaran {yang nyata.”} yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60 mankala Nuh mengatakan itu pada mereka mereka menjawab dengan jawaban terburuk, ”pemuka-pemuka dari kaumnya berkata” yakni orang-orang kaya, para pemimpin yang diikuti yang telah terbiasa menyombongkan diri di depan kebenaran, dan pembangkang kepada para rasul, ”sesungguhnya kami memandang kamu berada di dalam kesesatan yang nyata.” mereka tidak merasa cukup, semoga Allah menjelekkan mereka, hanya dengan pembangkangan. Bahkan lebih dari itu, mereka menyombongkan diri dari tunduk kepadanya. mereka mencela dengan celaan yang pedas. Mereka menisbatkan pada kesesatan. Tidak sebatas sesat, lebih dari itu mereka menyatakan kesesatan dengan kesesatan yang nyata lagi jelas bagi siapaun. Ini bentuk kesombongan diri paling besar yang akan dilakukan oleh orang yang paling lemah akalnya sekalipun. Justru kriteria ini jelas pas untuk kaum Nuh, yang mendatangi berhala-berhala yang mereka bikin. dan mereka bentuk dengan tangan mereka dari benda mati yang tidak bisa mendengar, tidak bisa melihat, dan tidak berguna sedikitpun, tetapi mereka memposisikannya sebagai pencipta langit. Kepada berhala-berhala itu mereka memberikan berbagai macam ibadah. Sekiranya mereka tidak memiliki akal yang dengannya hujjjah Allah tegak atas mereka, niscaya mereka dikatakan lebih sesat daripada orang-orang gila. Justru orang-orang gila itu lebih berakal dan lebih mendapatkan petunjuk daripada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 60",
    "description": "Kaum nabi nuh tidak menghiraukan perkataan nabi nuh, bahkan pemuka-pemuka atau pembesar kaumnya berkata dengan nada menghina, sesungguhnya kami tidak mempercayai apa yang kamu sampaikan, malah kami memandang kamu benar-benar berada dalam kesesatan yang nyata karena kamu memusuhi tuhan-tuhan kami dan menyalahkan cara ibadah kami. Dia, nabi nuh, menjawab tuduhan dan penolakan kaumnya, wahai kaumku! aku menyuruhmu mengesakan Allah dan tidak menyembah tuhan selain dia. Aku tidak sesat seperti dugaanmu, tetapi aku ini seorang rasul yang diutus dari tuhan pencipta dan penguasa seluruh alam."
  }
]