[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah telah berpengaruh dan membuat kalian heran bahwa Allah menurunkan kepada kalian ajaran yang mengingatkan kalian tentang perkara-perkara yang baik bagi kalian, melalui penjelasan lisan seorang lelaki yang berasal dari kalian sendiri, yang kalian ketahui garis keturunan dan kejujuran lisannya, untuk memperingatkan kalian dari azab Allah dan siksaanNya, dan agar kalian takut terhadap kemurkaanNya dengan cara beriman kepadaNya, dan berharap kalian menggapai rahmat dan pahala yang besar dariNya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Apakah kalian merasa heran bahwa kalian menerima wahyu dan peringatan dari Rabb kalian melalui seorang laki-laki yang kalian kenal dari lingkungan kalian sendiri? Karena ia tumbuh dan besar di lingkungan kalian, ia bukan seorang pendusta dan bukan orang yang tersesat, serta ia bukan berasal dari bangsa lain. Dia datang kepada kalian untuk memperingatkan kalian akan hukuman Allah jika kalian berdusta dan durhaka. Hendaklah kalian bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan mudah-mudahan kalian mendapat rahmat-Nya jika kalian beriman kepada-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. أَوَعَجِبْتُمْ (Dan apakah kamu (tidak percaya) dan heran) Apakah kalian merasa heran, tidak percaya, mengingkari, dan merasa aneh. أَن جَآءَكُمْ ذِكْرٌ مِّن رَّبِّكُمْ(bahwa datang kepada kamu peringatan dari Tuhanmu) Yakni berupa wahyu dan pelajaran. عَلَىٰ رَجُلٍ مِّنكُمْ(dengan perantaraan seorang laki-laki dari golonganmu) Lewat lisan seseorang dari golongan kalian yang kalian kenal dan bukan dari golongan makhluk lain seperti malaikat dan jin sehingga kalian akan lari ketakutan, namun ia berasal dari golongan manusia seperti kalian sehingga kalian dapat bercengkrama dengannya, dan ia adalah lelaki yang kalian kenal sejak kecil bahwa ia bukan orang yang sesat atau pendusta. وَلَعَلَّكُمْ تُرْحَمُونَ (dan supaya kamu mendapat rahmat) Atas manfaat yang kalian dapatkan dari peringatan bagi kalian itu, berupa rahmat dan ridha-Nya yang akan mendatangi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Apakah kalian akan mendustakan, ingkar, dan heran bahwa telah datang kepada kalian suatu wahyu dan nasehat dari Tuhan kalian melalui seorang laki-laki yang kalian kenali dan mengejaknya berinteraksi dari golongan kalian agar dia memperingatkan kalian tentang azab jika bermaksiat, dan supaya kalian bertakwa kepada Tuhan denghan mengerjakan perintah-perintahNya dan menjauhi larangan-laranganNya, serta agar kalian bisa meraih rahmat dan keridhaanNya jika taat dan mau mendengarkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian heran bahwa telah datang kepada kalian peringatan} pelajaran {dari Tuhan kalian kepada seorang laki-laki dari golongan kalian untuk memberi peringatan kepada kalian, agar kalian bertakwa, dan agar kalian dirahmati”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63 ‘dan apakah kamu (tidak percaya) dan heran bahwa datang kepada kamu peringatan dari Rabbmu dengan perantaraan seorang laki-laki dari golonganmu” yakni bagaimana kamu bisa heran terhadap sesuatu yang tidak perlu diherankan, yakni peringatan, nasihat dan petuah datang kepadamu melalu tangan seorang laki-laki darimu, dimana kamu mengetahui hakikatnya, kejujurannya dan keadaannya, keadaan ini termasuk perhatian Allah kepadamu dan kebaikanNYa yang semestinya di sambut dengan penerimaan dan rasa syukur. ”agar dia memberi peringatan kepadamu dan mudah-mudahan kamu bertakwa dan supaya kamu mendapat rahmat?” yakni agar dia memberi peringatan kepadamu dari azab yang pedih, kemudian kamu melakukan sebab-sebab keselamatan berupa bertakwa kepada Allah lahir dan batin. Dengan itu mereka meraih sebab-sebab itu dan rahmat Allah yang luaspun turun kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 63: Berupa azab jika kamu tidak beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 63",
    "description": "Selanjutnya nabi nuh berkata, dan herankah, tidak percayakah, kamu bahwa ada peringatan yang datang dari tuhanmu melalui perantaraan seorang laki-laki dari kalanganmu sendiri, yakni dari anggota masyarakatmu yang kamu tahu keturunan dan kejujurannya, untuk memberi peringatan kepadamu dengan azab apabila kamu ingkar dan agar kamu bertakwa mengikuti perintah Allah dan meninggalkan larangan-Nya, sehingga kamu mendapat rahmat dari Allah dan terhindar dari siksa-Nya. Tidaklah pantas kamu heran, bahkan meragukan kebenaran ajaran yang aku bawa setelah datang bukti dan keterangan yang jelas kepadamu. Kaum nabi nuh tetap tidak menghiraukan seruan dan nasihat nabi nuh. Bahkan, kebanyakan dari mereka mendustakannya dan terusmenerus menentang ajarannya. Mereka tetap berada dalam keka-firan sehingga Allah menurunkan azabnya. Lalu kami selamatkan dia, yakni nabi nuh, dan orang-orang yang bersamanya dari siksa dan azab kami di dalam kapal yang telah dia buat berdasarkan petunjuk kami. Adapun balasan bagi kaum yang ingkar, kami tenggelamkan orang-orang yang mendustakan ayat-ayat kami di dalam air banjir. Sesungguhnya lah kaum yang buta mata hatinya sehingga tidak memiliki pandangan yang benar, tidak bisa melihat tanda-tanda kebesaran kami, dan tidak dapat mengambil pelajaran dari peringatan yang disampaikan kepada mereka. Mereka ada."
  }
]