[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, mereka mendustakan Nuh. Maka kami menyelamatkan dirinya dan orang-orang yang beriman bersamanya dalam kapal. Dan kami tenggelamkan orang-orang kafir yang mendustakan hujjah-hujjah Kami yang jelas. Sesungguhnya mereka itu manusia-manusia yang buta mata hatinya untuk melihat kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Kemudian kaumnya mendustakannya dan tidak beriman kepadanya, melainkan tetap mempertahankan kekafiran mereka. Maka ia (Nuh) pun memohon kepada Allah agar membinasakan mereka. Lalu Kami menyelamatkannya beserta orang-orang mukmin yang berada di atas kapal bersamanya dari air bah. Dan Kami binasakan orang-orang yang mendustakan ayat-ayat Kami serta mempertahankan kekafirannya dengan menenggelamkan mereka dalam air bah yang Kami turunkan sebagai hukuman bagi mereka. Sesungguhnya hati mereka buta terhadap kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Namun kebanyakan kaumnya tetap mendustakan, sehingga mereka layak mendapatkan azab. Maka Allah menyelamatkan Nuh dan kaumnya yang beriman dari banjir bandang; dan menenggelamkan orang-orang yang mendustakan ayat-ayat Allah yang telah disampaikan Nuh kepada mereka selama dia tinggal bersama mereka. Mereka adalah kaum yang buta hati dan pikirannya dari petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. فِى الْفُلْكِ (dalam bahtera) Yakni kapal yang Allah perintahkan kepada nabi Nuh untuk membuatnya agar dia dan pengikutnya dapat selamat dari musibah banjir bandang. وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَآ ۚ( dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami) Yakni mendustakan ayat-ayat Kami dan berlarut-larut dalam kemaksiatan itu dan enggan untuk bertaubat. Allah menenggelamkan mereka dalam banjir bandang sedang mereka berada di negeri mereka. إِنَّهُمْ كَانُوا۟ قَوْمًا عَمِينَ (Sesungguhnya mereka adalah kaum yang buta (mata hatinya)) Yakni Kami menenggelamkan orang-orang yang mendustakan ayat-ayat Kami karena mereka mempunyai hati yang buta, tidak bermanfaat pelajaran dan peringatan bagi mereka. Allah telah membahas kisah nabi Nuh dengan kaumnya dan bagaimana ia selamat dengan perahunya serta bagaimana kaumnya ditenggelamkan dari banjir bandang dalam surat Huud: 35-48 secara terperinci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Lalu mereka tetap melanjutkan pendustaan dan pertentangannya. Maka Kami selamatkan Nuh dan sedikit kaum mukmin yang mengikutinya di dalam kapal yang Kami perintahkan (Nuh) untuk membangunnya, dan Kami tenggelamkan orang-orang yang kufur dan tetap pada kesesatan dan melanjutkan pendustaan mereka dengan banjir bandang dan kehancuran yang menyeluruh. Sesungguhnya mereka itu kaum yang buta penglihatan dan hatinya dari kebenaran, sehingga nasehat dan peringatan tidak berguna bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka mendustakannya, lalu Kami menyelamatkan dia dan orang-orang yang bersamanya di dalam bahtera} bahtera {dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah kaum yang buta} hati mereka buta tidak bisa melihat kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64 Ajakan Nuh tidak mereka terima “maka mereka mendustakan Nuh, kemudian kami menyelamatkan dia dan orang-orang yang bersamanya diadalm bahtera” yakni perahu yang dibuat Nuh atas perintah Allah dan Dia mewahyukan kepadanya agar membawa dari masing-masing sepasang binatang dan membawa pula keluarganya dan orang-orang yang beriman bersamanya, maka Nuh membawa mereka dengan perahu tersebut. ”dan kami tenggelamkan orang-orang yang mendustakan ayat-ayat kami. Sesungguhnya mereka kaum yang buta (mata hatinya)” dari hidayah. Mereka melihat kebenaran dan Allah telah memperlihatkan tanda-tandaNya yang jelas melalui Nuh yang dengannya orang-orang yang berakal beriman kepadanya, tetapi mereka mencemooh, menghina, dan kufur padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 64: Yakni kapal yang diperintahkan Allah untuk dibuat oleh Nuh ‘alaihis salam, dan Allah mewahyukan kepadanya, \"Muatkanlah ke dalam kapal itu dari masing-masing binatang sepasang (jantan dan betina), dan keluargamu kecuali orang yang telah terkena ketetapan terdahulu dan (muatkan pula) orang-orang yang beriman.\" (lihat Huud: 40) Dengan banjir besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 64",
    "description": "Kaum nabi nuh tetap tidak menghiraukan seruan dan nasihat nabi nuh. Bahkan, kebanyakan dari mereka mendustakannya dan terusmenerus menentang ajarannya. Mereka tetap berada dalam keka-firan sehingga Allah menurunkan azabnya. Lalu kami selamatkan dia, yakni nabi nuh, dan orang-orang yang bersamanya dari siksa dan azab kami di dalam kapal yang telah dia buat berdasarkan petunjuk kami. Adapun balasan bagi kaum yang ingkar, kami tenggelamkan orang-orang yang mendustakan ayat-ayat kami di dalam air banjir. Sesungguhnya lah kaum yang buta mata hatinya sehingga tidak memiliki pandangan yang benar, tidak bisa melihat tanda-tanda kebesaran kami, dan tidak dapat mengambil pelajaran dari peringatan yang disampaikan kepada mereka. Mereka adasetelah nabi nuh wafat, Allah mengutus nabi hud kepada kaum 'ad untuk meneruskan ajaran tauhid yang telah disampaikan oleh nabi nuh. Dan kepada kaum 'ad, kami utus nabi hud, yang merupakan saudara seketurunan mereka agar mereka memahami ajaran yang ia sampaikan. Dia berkata sebagaimana ucapan nabi nuh kepada kaumnya, wahai kaumku! sembahlah Allah! tidak ada tuhan sembahan bagimu yang layak disembah selain dia. Maka mengapa kamu tidak bertakwa dengan menjalankan perintah Allah dan tidak menyekutukan-Nya dengan yang lain sehingga kamu terhindar dari siksa-Nya'"
  }
]