[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mengutus kepada kaum ‘Ad saudara mereka,Hud, ketika mereka menyembah berhala-berhala selain Allah. Dia berkata kepada mereka, ”Sembahlah Allah semata, tidak ada bagi kalian sesembahan yang berhak diibadahi selainNYa. Maka ikhlaskanlah penyembahan kalian kepadaNya. Apakah kalian tidak takut terhadap azab dan kemurkaanNya pada kalian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Dan kepada suku ‘Ād Kami utus seorang rasul dari kalangan mereka sendiri, yaitu Hud -‘Alaihissalām-, ia berkata, “Wahai kaumku! Sembahlah Allah semata. Karena kalian tidak punya tuhan lain yang berhak disembah selain Dia. Tidakkah kalian takut kepada-Nya dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya agar kalian selamat dari azab-Nya?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Dan kami telah mengutus kepada kaum 'Aad saudara mereka, Huud, di kota Al-Ahqaf yang terletak di Hadramaut. Dia menyeru mereka dengan rasa kasih dalam ikatan kekerabatan: \"Hai kaumku, sembahlah Allah Semata karena, tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian tidak takut terhadap azab Allah?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَإِلَىٰ عَادٍ (Dan (Kami telah mengutus) kepada kaum ‘Aad) Yakni dan Kami telah mengutus kepada kabilah ‘Aad. أَخَاهُمْ(saudara mereka) Yakni seseorang dari kabilah mereka yaitu nabi-Nya Huud. Kaum ‘Aad bermukim di perbukitan pasir di tanah Hadramaut-Yaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Dan Kami telah mengutus kepada suku ‘Aad yang hidup dahulu (yaitu orang-orang yang hidup di lembah-lembah di daerah Hadramaut Yaman) seseorang dari suku atau golongan mereka, yaitu Hud AS. Dia berkata: “Wahai kaumku, menyembahlah hanya kepada Allah dengan benar, tiada Tuhan bagi kalian selain Dia. Apakah kalian tidak takut dengan azabNya?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan (Kami mengutus) kepada kaum ‘Ad saudara mereka, Hud. Dia berkata,“Wahai kaumku, sembahlah Allah, tidak ada tuhan bagi kalian selain Dia. Tidakkah kalian bertakwa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65 “dan kami telah mengutus“ kepada kamum ‘ad yang pertama yang ada di bumi yaman. ”saudara mereka” dari nasab “hud” menyeru mereka kepada tauhid. melarang mereka dari syirik, dan berbuat semena-mena di muka bumi. Dia berkata kepada mereka. ”Hai kaumku, sembahlah Allah, sekali-kali tidak ada tuhan bagimu (yang berhak di sembah) selainNYa. Maka mengapa kamu tidak bertakwa kepadaNya?” Apakah kamu tidak takut dari azab dan siksaNya jika kamu tetap memegang apa yang kamu pegang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 65",
    "description": "Setelah nabi nuh wafat, Allah mengutus nabi hud kepada kaum 'ad untuk meneruskan ajaran tauhid yang telah disampaikan oleh nabi nuh. Dan kepada kaum 'ad, kami utus nabi hud, yang merupakan saudara seketurunan mereka agar mereka memahami ajaran yang ia sampaikan. Dia berkata sebagaimana ucapan nabi nuh kepada kaumnya, wahai kaumku! sembahlah Allah! tidak ada tuhan sembahan bagimu yang layak disembah selain dia. Maka mengapa kamu tidak bertakwa dengan menjalankan perintah Allah dan tidak menyekutukan-Nya dengan yang lain sehingga kamu terhindar dari siksa-Nya' mendengar seruan nabi hud, kebanyakan kaumnya tetap kafir, tidak mau mengikuti ajakan dan dakwahnya. Bahkan, pemuka-pemuka orang-orang yang kafir dari kaumnya yang berkuasa berkata, sesungguhnya kami memandang kamu, yakni melihat dan menilaimu secara keseluruhan, benar-benar kurang waras, tidak memahami apa yang kamu katakan, dan kami kira dan yakin kamu termasuk orang-orang yang berdusta dalam perkataanmu. '"
  }
]