[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tokoh-tokoh besar yang kafir dari kaum Hud berkata, ”sesungguhnya kami tahu benar bahwa sesungguhnya kamu dengan dakwahmu yang engkau serukan kepada kami agar meninggalkan penyembahan terhadap tuhan-tuhan kami dan beribadah hanya kepada Allah, engkau itu orang yang kurang akal. Dan sesungguhnya kami benar-benar yakin bahwa engkau termasuk orang-orang yang berdusta atas Nama Allah dalam pernyataan yang engkau katakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Para pemimpin dan pemuka kaumnya yang ingkar kepada Allah dan mendustakan rasul-Nya berkata, “Sesungguhnya kami tahu bahwa kamu -wahai Hud- benar-benar bodoh dan pandir ketika kamu mengajak kami menyembah Allah semata dan tidak menyembah berhala. Dan kami benar-benar merasa yakin dan mantap bahwa kamu berdusta tentang pengakuanmu bahwa kamu adalah seorang rasul.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Para pemuka kaumnya yang mendustakan menjawab dengan penuh kesombongan: \"Hai Huud, sungguh kami yakin kamu adalah orang yang bodoh dan kurang akal, dan kamu adalah orang yang berdusta dengan mengaku sebagai Rasul!\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. سَفَاهَةٍ (dalam keadaan kurang akal) Yakni kurang akal dan bodoh. Kaumnya menyebutnya dengan sebutan ini sebagai tuduhan dusta dan kebohongan. وَإِنَّا لَنَظُنُّكَ مِنَ الْكٰذِبِينَ (dan sesungguhnya kami menganggap kamu termasuk orang orang yang berdusta) Yakni benar-benar meyakini kedustaan nabi Huud dalam pengakuannya sebagai Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Para pemipin dan petinggi yang kufur dari kaumnya berkata: “Wahai Hud, sesungguhnya Kami melihatmu sedang melamun dan sangat bodoh. Kami yakin bahwa kamu termasuk orang-orang yang berdusta terkait pengakuan kenabian dan kerasulan itu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para pemuka yang ingkar di antara kaumnya berkata,“Sesungguhnya kami benar-benar melihatmu dalam keadaan bodoh dan sesungguhnya kami menduga bahwa kamu termasuk para pembohong.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66 tetapi mereka tidak tunduk dan menyambut baik, \"pemuka-pemuka yang kafir dari kaumnya berkata” membantah ajakannya dan mencela pendapatnya, ”sesungguhnya kami benar-benar memandang kamu dalam keadaan kurang akal dan sesungguhnya kami menganggap kamu termasuk orang-orang yang berdusta.” Yakni kami tidak melihatmu melainkan orang yang bodoh dan tidak berakal. Menurut kami kamu termsuk orang-orang yang berdusta. Hakikat kebenaran bagi mereka telah terbalik dan kebodohan telah menguasai mereka, dimana mereka menuduh Nabi mereka dengan kriteria yang justru merekalah yang memilikinya, sementara mereka orang yang paling jauh darinya. Mereka itulah pendusta sebenarnya. Kebodohan mana yang lebih besar daripada orang yang menyambut kebenaran paling benar dengan penolakan dan pengingkaran, dan menyombongkan diri kepada para pembimbing dan para pemberi nasihat. Hati dan fisik mereka tunduk kepada setan yang durhaka, meletakan mereka dalam ibadah tidak pada tempatnya. Dia menyembah pohon dan batu yang tidak berguna sedikitpun. Adakah dusta yang lebih berat daripada orang yang menisbatkan perkara-perkara ini kepada Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 66: Yang menolak dakwah Nabi Hud ‘alaihis salam dan mencela pandangannya. Padahal siapakah yang kurang waras daripada orang-orang yang menyembah sesuatu yang tidak memberi manfaat apa-apa berupa batu dan pepohonan, bahkan lebih lemah daripada penyembahnya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 66",
    "description": "Mendengar seruan nabi hud, kebanyakan kaumnya tetap kafir, tidak mau mengikuti ajakan dan dakwahnya. Bahkan, pemuka-pemuka orang-orang yang kafir dari kaumnya yang berkuasa berkata, sesungguhnya kami memandang kamu, yakni melihat dan menilaimu secara keseluruhan, benar-benar kurang waras, tidak memahami apa yang kamu katakan, dan kami kira dan yakin kamu termasuk orang-orang yang berdusta dalam perkataanmu. ' dia, hud, menjawab sekaligus memberikan penjelasan tentang kesalahan anggapan dan dugaan kaumnya, wahai kaumku! aku tidak seperti sangkaanmu. Bukan aku kurang waras karena aku sadar dengan ucapan dan tindakanku. Aku juga bukan pendusta, tetapi yang aku lakukan adalah berdasarkan tuntunan dari tuhanku karena aku ini adalah seorang rasul yang diutus dari tuhan seluruh alam kepada kamu semua. Aku menyampaikan kepadamu amanat, pesan, dan tuntunan dari tuhanku dan pemberi nasihat yang menghendaki kebaikan dan kebahagiaanmu dunia dan akhirat, dan aku adalah orang yang tepercaya, jujur, bukan pembohong, yang diutus kepada kamu."
  }
]