[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hud menjawab,”Wahai kaumku,tidak ada cacat pada akalku sedikit pun. Akan tetapi, aku adalah utusan Allah kepada kalian dari penguasa makhluk secara keseluruhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Hud menjawab ucapan kaumnya dengan mengatakan, “Wahai kaumku! Aku tidak bodoh maupun pandir. Sesungguhnya aku adalah utusan dari Rabb semesta alam.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Maka Huud menanggapi mereka dengan penuh kelembutan dan adab: ĺHai kaumku, aku bukan seperti yang kalian sangka, namun aku adalah seorang Rasul yang diutus oleh Pencipta jin dan manusia untuk menyampaikan kepada kalian apa yang telah aku perintahkan tersebut,"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Hud berkata kepada mereka: “Wahai kaumku, Aku bukanlah orang bodoh seperti yang kalian gambarkan, melainkan seorang rasul yang diutus kepada kalian dari Tuhan semesta alam untuk menunjukkan dan membimbing kalian menuju hal yang membahagiakan kalian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hud berkata,“Wahai kaumku, tidak ada padaku suatu kebodohan} kelemahan akal dan kecerobohan {tetapi aku ini adalah rasul dari Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67 “hud berkata ’hai kaumku tidak ada padaku kekurangan akal sedikitpun” Justru dia adalah seorang rasul yang membimbing lagi lurus. ”tetapi aku ini adalah utusan dari Rabb semesta alam”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 67",
    "description": "Dia, hud, menjawab sekaligus memberikan penjelasan tentang kesalahan anggapan dan dugaan kaumnya, wahai kaumku! aku tidak seperti sangkaanmu. Bukan aku kurang waras karena aku sadar dengan ucapan dan tindakanku. Aku juga bukan pendusta, tetapi yang aku lakukan adalah berdasarkan tuntunan dari tuhanku karena aku ini adalah seorang rasul yang diutus dari tuhan seluruh alam kepada kamu semua. Aku menyampaikan kepadamu amanat, pesan, dan tuntunan dari tuhanku dan pemberi nasihat yang menghendaki kebaikan dan kebahagiaanmu dunia dan akhirat, dan aku adalah orang yang tepercaya, jujur, bukan pembohong, yang diutus kepada kamu"
  }
]