[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku sampaikan kepada kalian apa yang Tuhanku mengutusku kepada kalian dengannya, dan aku bagi kalian (dalam apa yang aku dakwahkan kepada kalian dari tauhidulloh dan melaksanakan syariatNya) hanyalah sebagai pemberi nasihat yang menjaga wahyu dari Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Aku menyampaikan pesan Allah kepada kalian tentang keharusan mengesakan-Nya dan menjalankan syariat-Nya. Dan aku benar-benar peduli kepada kalian dan aku dapat dipercaya dalam menyampaikan apa yang harus kusampaikan. Aku tidak menambah atau mengurangi sedikit pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68- 69. Aku menyampaikan kepada kalian dakwah dari Tuhanku, dan aku adalah pemberi nasehat bagi kalian untuk mengikuti seruanku, serta aku adalah orang yang jujur dalam hal ini. Apakah kalian merasa heran dan mendustakanku Jika datang perintah dari Tuhan kalian melalui lisan salah seorang dari kalian, untuk memperingatkan kalian dari azab Allah di dunia dan di akhirat?\" Dan ingatlah kenikmatan Allah yang telah diberikan kepada kalian, dengan menjadikan kalian khalifah di bumi setelah Dia membinasakan kaum Nuh yang mendustakan-Nya, dan Allah telah menambah ukuran tubuh dan kekuatan kalian dibandingkan dengan kaum sebelum kalian. Maka ingatlah kenikmatan-kenikmatan yang telah Allah berikan kepada kalian agar kalian dapat meraih keridhaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Aku menyampaikan kepada kalian apa yang dikirimkan kepadaku berupa tanggung jawab dari Tuhan (yaitu perintah, nasehat dan larangan) Dan aku adalah pemberi nasehat bagi kalian dalam dakwahku dan orang yang dapat dipercaya lagi ikhlas dalam menyampaikan risalah itu kepada kalian, maka tidak mungkin aku berbuat dusta kepada Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku menyampaikan kepada kalian risalah-risalah Tuhanku dan aku terhadap kalian adalah penasihat yang tepercaya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68 “aku menyampaikan amanat-amanat dari Rabbku kepadamu dan aku hanyalah pemberi nasihat yang terpercaya bagimu” yakni wajib atasmu menyambut itu dengan penuh penerimaan dan ketundukan serta ketaatan kepada Rabb para hamba"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 68: Oleh karena itu, kewajiban kamu adalah menerimanya, tunduk dan taat kepada Allah Rabbul ‘alamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 68",
    "description": "Dia, hud, menjawab sekaligus memberikan penjelasan tentang kesalahan anggapan dan dugaan kaumnya, wahai kaumku! aku tidak seperti sangkaanmu. Bukan aku kurang waras karena aku sadar dengan ucapan dan tindakanku. Aku juga bukan pendusta, tetapi yang aku lakukan adalah berdasarkan tuntunan dari tuhanku karena aku ini adalah seorang rasul yang diutus dari tuhan seluruh alam kepada kamu semua. Aku menyampaikan kepadamu amanat, pesan, dan tuntunan dari tuhanku dan pemberi nasihat yang menghendaki kebaikan dan kebahagiaanmu dunia dan akhirat, dan aku adalah orang yang tepercaya, jujur, bukan pembohong, yang diutus kepada kamu. Melihat kaumnya masih tidak percaya, nabi hud mempertanyakan sikap mereka. Dan herankah, tidak percayakah, kamu bahwa ada peringatan yang datang, yakni diturunkan dari tuhanmu melalui seorang laki-laki dari kalangan masyarakat-Mu sendiri, untuk memberi peringatan kepadamu menyangkut azab yang akan menimpamu karena kedurhakaanmu' ini bukanlah hal yang pantas untuk diragukan dan diherankan. Kemudian nabi hud mengingatkan mereka dengan nikmat yang telah Allah berikan. Ingatlah ketika dia menjadikan kamu sebagai khalifah-khalifah yang berkuasa setelah kaum nuh yang telah dibinasakan akibat mendustakan rasulnya, dan dia lebihkan kamu dalam kekuatan tubuh dan perawakan sehingga kamu lebih kuat, besar, dan tegar secara fisik, cerdas, dan memiliki kekuasaan yang lebih besar dibanding umat-umat sebelum kamu. Maka ingatlah dengan penuh rasa syukur dan kerendahan hati akan nikmat-nikmat Allah yang telah diberikan kepadamu agar kamu termasuk orang-orang beruntung, memperoleh apa yang kamu inginkan, sebagai balasan atas segala usaha keras kamu dengan menaati perintah dan menjauhi larangan Allah."
  }
]