[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah telah berpengaruh dan membuat kalian keheranan bahwa Allah menurunkan kepada kalian ajaran yang mengingatkan kalian tentang perkara-perkara yang baik bagi kalian melalui penjelasan seorang lelaki yang berasal dari kalian sendiri, yang kalian ketahui garis keturunan dan kejujuran lisannya, untuk memperingatkan kalian dari azab dan siksaan Allah ? dan ingatlah oleh kalian nikmat Allah yang tercurah kepada kalian ketika Allah menjadikan kalian sebagai manusia-manusia yang menggantikan orang-orang sebelum kalian di muka bumi setelah dibinasakannya kaum Nuh , dan melebihkan pada fisik kalian dengan kekuatan dan perawakan yang lebih besar. Maka Ingatlah oleh kalian nikmat-nikmat Allah yang melimpah banyak atas kalian, supaya kalian dapat memperoleh keberuntungan besar di dunia dan akhirat. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Apakah kalian merasa heran dan aneh bahwa kalian mendapatkan peringatan dari Rabb kalian melalui seorang laki-laki dari bangsa kalian sendiri -bukan dari bangsa malaikat atau jin- untuk mengingatkan kalian? Bersyukurlah dan berterimakasihlah kalian kepada Rabb kalian yang telah menempatkan kalian di bumi dan menjadikan kalian sebagai penerus kaum Nuh yang telah dibinasakan oleh Allah karena kekafiran mereka. Dan bersyukurlah kalian kepada Allah karena Dia telah memberikan keistimewaan kepada kalian berupa tubuh yang besar, kuat, dan perkasa. Dan ingatlah nikmat-nikmat Allah yang diberikan kepada kalian dengan seluas-luasnya agar kalian mendapatkan apa yang kalian inginkan dan terhindar dari apa yang kalian cemaskan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَاذْكُرُوٓا۟ إِذْ جَعَلَكُمْ خُلَفَآءَ مِنۢ بَعْدِ قَوْمِ نُوحٍ (Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh) Yakni aku mengingatkan mereka atas kenikmatan dari Allah berupa menjadikan kalian penghuni bumi ini setelah binasanya kaum Nabi Nuh. وَزَادَكُمْ فِى الْخَلْقِ بَصْۜطَةً ۖ (dan Tuhan telah melebihkan kekuatan tubuh) Yakni tinggi besar dalam perawakan melebihi kaum yang lain. فَاذْكُرُوٓا۟ ءَالَآءَ اللهِ (Maka ingatlah nikmat-nikmat Allah) Yakni nikmat-nikmat Allah untuk kalian, diantaranya adalah menjadikan kalian penghuni bumi ini dan memberi kalian tubuh yang besar, serta nikmat-nikmat lain yang diberikan kepada kalian. لَعَلَّكُمْ تُفْلِحُونَ(supaya kamu mendapat keberuntungan) Karena mengingat kenikmatan yang telah diberikan merupakan sebab yang mendorong untuk bersyurkur; dan barangsiapa yang bersyukur sungguh ia telah beruntung."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَاذْكُرُوا آلَاءَ اللَّهِ لَعَلَّكُمْ تُفْلِحُونَ } Senantiasa mengingat dan menyebut nikmat-nikmat Allah adalah sebab datangnya kemenangan dan kebahagiaan, karena dengan tidak lain hanyalah menambah kecintaan seorang hamba kepada tuhannya, juga pujian, rasa syukur dan keaatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Apakah kalian akan berdusta, menjauh dan heran bahwa telah kepada kalian sebuah wahyu dan nasehat dari Tuhan kalian melalui laki-laki yang kalian kenal dari golongan kalian agar dia memperingatkan kalian tentang azab Allah jika bermaksiat, dan supaya kalian mengingat nikmat Allah atas kalian ketika Dia telah menjadikan kalian khalifah atau penduduk bumi setelah kaum Nuh dibinasakan, dan membuat kalian lebih tinggi, besar dan kuat badannya daripada yang suku lainnya, maka ingatlah nikmat-nikmat Allah yang banyak atas kalian, agar bisa meraih keridhaan dan surga Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian heran bahwa telah datang kepada kalian pelajaran dari Tuhan kalian atas seorang laki-laki dari golongan kalian supaya dia memberi peringatan kepada kalian. Ingatlah, ketika Allah menjadikan kalian khalifah sesudah kaum Nuh, dan melebihkan kalian dalam penciptaan dengan tubuh yang kuat} tinggi dan kuat {Ingatlah nikmat-nikmat Allah} nikmat-nikmat Allah {supaya kalian mendapat keberuntungan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69 “apakah kamu tidak percaya dan heran bahwa datang kepadamu peringatan dari Rabbmu yang dibawa oleh seorang laki-laki diantaramu untuk memberi peringatan kepadamu?” yakni bagaimana kamu merasa heran terhadap suatu perkara yang tidak perlu diherankan, yaitu bahwa Allah mengutus seorang laki-laki kepadamu, kamu mengenalnya, dia mengingatkanmu apa yang baik bagimu, mendorongmu kepada yang bermanfaat bagimu, lalu kamupun herannya seperti herannya para pengingkar. ”dan ingatlah oleh kamu sekalian diwaktu Allah menjadikanmu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum NUh” yakni bersyukur dan pujilah Rabbmu karena Dia telah menempatkanmu di muka bumi dan menjadikanmu sebagai umat-umat yang telah binasa yang mendustakan para rasul, lalu Allah membinasakan mereka dan menyiksakanmu agar mengetahui bagaimana kamu beramal. Waspadalah jangan sampai kamu mendustakan seperti mereka mendustakan, akibatnya adalah apa yang menimpa mereka akan menimpamu. ”dan” ingatlah nikmat Allah kepadamu yang Dia khususkan kepadamu yaitu “Rabb telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum NUh) itu” dalam urusan kekuatan, ukuran tubuh dan kekurangan tenaga. maka ingatlah nikmat-nikmat Allah” yang luas dan karuniaNya yang berulang-ulang, ”supaya kamu” jika kamu mengingatnya dengan mensyukurinya dan menunaikan hak nya “mendapat keberuntungan” yakni kamu beruntung meraih yang diinginkan dan selamat dari yang ditakutkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 69: Oleh karena itu, pujilah Allah dan bersyukurlah kepada-Nya ketika Dia memberi tempat kepadamu di bumi, menjadikan kamu sebagai khalifah-khalifah terhadap umat-umat yang binasa karena mendustakan rasul. Allah membinasakan mereka, dan membiarkan kamu untuk melihat apa yang kamu kerjakan, dan berhati-hatilah jika kamu sama mendustakan seperti mereka, Dia akan menimpakan azab kepadamu sebagaimana kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 69",
    "description": "Melihat kaumnya masih tidak percaya, nabi hud mempertanyakan sikap mereka. Dan herankah, tidak percayakah, kamu bahwa ada peringatan yang datang, yakni diturunkan dari tuhanmu melalui seorang laki-laki dari kalangan masyarakat-Mu sendiri, untuk memberi peringatan kepadamu menyangkut azab yang akan menimpamu karena kedurhakaanmu' ini bukanlah hal yang pantas untuk diragukan dan diherankan. Kemudian nabi hud mengingatkan mereka dengan nikmat yang telah Allah berikan. Ingatlah ketika dia menjadikan kamu sebagai khalifah-khalifah yang berkuasa setelah kaum nuh yang telah dibinasakan akibat mendustakan rasulnya, dan dia lebihkan kamu dalam kekuatan tubuh dan perawakan sehingga kamu lebih kuat, besar, dan tegar secara fisik, cerdas, dan memiliki kekuasaan yang lebih besar dibanding umat-umat sebelum kamu. Maka ingatlah dengan penuh rasa syukur dan kerendahan hati akan nikmat-nikmat Allah yang telah diberikan kepadamu agar kamu termasuk orang-orang beruntung, memperoleh apa yang kamu inginkan, sebagai balasan atas segala usaha keras kamu dengan menaati perintah dan menjauhi larangan Allah. Sekalipun telah diingatkan dengan nikmat yang mereka peroleh, mayoritas kaum nabi hud tetap ingkar dan enggan mengikuti dakwahnya. Mereka berkata dengan angkuh serta tanpa dasar ilmu kecuali mengikuti tradisi nenek moyang mereka, apakah tujuan kedatanganmu kepada kami hanya untuk menyeru agar kami hanya menyembah Allah saja, tidak menyekutukan-Nya dengan yang lain, tidak mengangkat perantara antara kami dan dia, dan meninggalkan apa yang biasa dan terus-menerus disembah oleh nenek moyang kami' padahal, kami telah mengikuti tradisi dan kebiasaan mereka sebelum kedatanganmu. Seruanmu ini jelas tidak bisa kami terima dan kami tidak akan menaatinya. Jika engkau mau mengancam kami karena tidak mengikuti ajakanmu, maka buktikanlah ancamanmu yang kamu katakan kepada kami, jika kamu benar dalam ucapanmu!"
  }
]