[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami sungguh akan memberitahukan kepada semua makhluk tentang apa yang mereka perbuat sesuai dengan pengetahuan kami tentang perbuatan-perbuatan mereka di dunia tentang perkara-perkara yang kami perintahkan kepada mereka dan hal-hal yang kami melarang mereka darinya. Dan kami tidaklah ghaib dari mereka dalam kondisi apapun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sungguh Kami benar-benar akan menceritakan kepada seluruh makhluk tentang apa yang mereka perbuat di dunia berdasarkan pengetahuan Kami. Karena Kami benar-benar mengetahui seluruh perbuatan mereka. Tidak ada sesuatu pun yang luput dari pengetahuan Kami dan Kami tidak pernah jauh dari mereka sepanjang waktu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Sungguh dengan ilmu Kami, akan Kami sampaikan kepada para jin dan manusia tentang amal perbuatan mereka. Kami sekali-kali tidak pernah lalai sesaatpun dari apa yang telah mereka lakukan. Dan amal perbuatan mereka akan di timbang pada hari kiamat; barangsiapa yang keimanan dan amal shalihnya lebih berat maka mereka adalah orang-orang yang mendapat derajat yang tinggi, mereka adalah orang-orang yang meraih kemenangan. Sedangkan barangsiapa yang amal keburukannya lebih berat daripada amal kebaikannya, maka mereka telah jauh dari kemenangan, mereka telah merugikan diri sendiri karena harus masuk ke dalam neraka Jahannam akibat pendustaan yang telah mereka lakukan terhadap ayat-ayat dan tanda-tanda kekuasaan Allah yang dapat didengar dan dilihat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَلَنَقُصَّنَّ عَلَيْهِم بِعِلْمٍ ۖ (maka sesungguhnya akan Kami kabarkan kepada mereka (apa-apa yang telah mereka perbuat), sedang (Kami) mengetahui (keadaan mereka)) Yakni kepada para Rasul dan umat mereka, tentang apa yang terjadi antara mereka ketika para Rasul menjalankan dakwah. Yakni Kami mengetahui apa yang terjadi diantara mereka saat para rasul datang kepada mereka. وَمَا كُنَّا غَآئِبِينَ (dan Kami sekali-kali tidak jauh (dari mereka)) Sehingga tidak ada kejadian yang tersembunyi bagi Kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dan sungguh Kami akan mengajarkan kepada para rasul ilmu yang sempurna dan pasti tentang apa yang terjadi di antara mereka saat mengajak (manusia) untuk beriman. Dan Kami tidaklah mengabaikan mereka sehingga ada kejadian di antara mereka yang luput dari Kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian pasti akan Kami kabarkan kepada mereka} kepada para rasul dan umat yang didatangkan kepada mereka para rasul {berdasarkan ilmu (Kami). Sedikit pun Kami tidak pernah tidak ada untuk mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “maka sesungguhnya akan kami kabarkan kepada mereka (apa-apa yang telah mereka perbuat) “ yakni kepada seluruh manusia apa yang telah mereka perbuat. ”sedang kami mengetahui keadaan mereka “terhadap amal-amal mereka. ”dan kami sekali-kali tidak jauh (dari mereka)”sebagaimana Firman Allah “Allah mengumpulkan (mencatat) amal mereka padahal mereka telah melupkannya” dan juga firman Allah” dan sesungguhnya kami telah menciptakan diatas kamu tujuh buah jalan (tujuh buah langit) dan kami tidaklah lengah terhadap ciptaan (kami). ”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 7: Apa yang mereka kerjakan. Allah tidak lengah terhadap mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 7",
    "description": "Dan pasti akan kami beritakan kepada mereka dengan ilmu kami, dan kami tidak jauh dari mereka dengan penjelasan yang disertai bukti-bukti yang meyakinkan, karena Allah selalu mengawasi gerak-gerik mereka. Mereka tidak akan bisa berbohong. Pada saat itulah amalan mereka ditimbang dengan timbangan yang tidak pernah meleset, karena Allah mahaadiltimbangan yang tidak kita ketahui secara hakiki bagaimana bentuk dan sifatnya, pada hari itu menjadi ukuran kebenaran. Ihwal timbangan ini merupakan perkara gaib; kita wajib mengimaninya dan hanya Allah yang tahu hakikatnya. Maka barang siapa berat timbangan kebaikan-Nya karena banyak melakukan kebaikan, mereka itulah orang yang beruntung. Mereka akan masuk surga dengan segala kenikmatan yang ada di dalamnya."
  }
]