[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Ad berkata kepada Hud , ”apakah engkau menyeru kami untuk hanya menyembah Allah dan meninggalkan penyembahan terhadap patung-patung yang telah kami warisi kebiasaan menyembahnya dari nenek moyang kami? Datangkanlah saja kepada kami siksaan yang engkau ancamkan kepada kami, jika engkau termasuk orang yang jujur dalam apa yang katakan. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Kaumnya berkata, “Apakah kamu -wahai Hud- datang kepada kami untuk menyuruh kami menyembah Allah semata dan meninggalkan apa yang disembah oleh leluhur kami? Datangkanlah azab yang kamu ancamkan kepada kami, jika memang kamu benar dalam hal itu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Namun mereka menanggapinya dengan penuh penentangan dan keangkuhan: \"Hai Huud, apakah kamu datang kepada kami agar kami menyembah Allah semata dan meninggalkan berhala-berhala yang telah kami sembah sejak masa nenek moyang kami? Jika kamu memang berkata benar maka datangkanlah segera apa yang kamu ancamkan kepada kami itu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. قَالُوٓا۟ أَجِئْتَنَا لِنَعْبُدَ اللهَ وَحْدَهُۥ (Mereka berkata: “Apakah kamu datang kepada kami, agar kami hanya menyembah Allah saja) Ini merupakan hal yang mereka ingkari karena mereka mendapati nenek moyang mereka berbeda dengan apa yang diserukan oleh Nabi Huud kepada mereka. وَنَذَرَ مَا كَانَ يَعْبُدُ ءَابَآؤُنَا ۖ (dan meninggalkan apa yang biasa disembah oleh bapak-bapak kami?) Yakni kami meniggalkan apa yang disembah oleh nenek moyang kami. فَأْتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ الصّٰدِقِينَ(maka datangkanlah azab yang kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar”) Ini merupakan permintaan mereka untuk disegerakan azab yang dijanjikan oleh Nabi Huud kepada mereka disebabkan besarnya kedurhakaan mereka kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Mereka berkata: “Apakah kamu mendatangi kami supaya kami menyembah hanya kepada Allah, dan meninggalkan apa yang telah dilakukan bapak-bapak kami, yaitu menyembah berhala, maka datangkanlah kepada kami azab yang kamu peringatkan untuk kami, jika ancaman dan peringatanmu memang benar”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah kamu datang kepada kami agar kami menyembah Allah semata dan meninggalkan} meninggalkan {apa yang biasa disembah oleh nenek moyang kami. Datangkanlah kepada kami apa yang kamu janjikan kepada kami jika kamu termasuk orang-orang yang benar.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70 Selanjutnya hud menasihati dan mengingatkan serta memerintah mereka kepada tauhid, dia menjelaskan siapa dirinya, bahwa dia adalah pemberi nasihat yang dipercaya. Dia memperingatkan mereka agar waspada terhadap azab Allah kepada mereka seperti yang telah Dia timpakan kepada orang-orang sebelum mereka. Dia mengingatkan mereka dengan nikmat-nikmat Allah dan pelimpahan rizki kepada mereka, tetapi mereka tidak merespon dan tidak tunduk. Mereka menjawab dengan penuh keheranan terhadap dakwahnya dan menyatakan bahwa mustahil mereka akan menaatinya. ”apakah kamu datang kepada kami agar kami hanya menyembah Allah saja dan meninggalkan apa yang biasa disembah oleh bapak-bapak kami?” semoga Allah memperburuk mereka, mereka menjadikan perkara yang merupakan kewajiban yang paling wajib dan perkara paling sempurna termasuk perkara-perkara yang dengannya mereka mempertentangkannya dengan apa yang dianut oleh nenek moyang mereka. Mereka mendahulukan kesyirikan dan penyembahan berhala yang dianut oleh nenek moyang mereka daripada tauhid kepada Allah semata yang tiada sekutu bagiNya yang didakwahkan oleh para rasul. Dan mereka berkata ”maka datangkanlah azab yang kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar.” ini adalah tantangan dari mereka agar ditimpakan azab atas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 70",
    "description": "Sekalipun telah diingatkan dengan nikmat yang mereka peroleh, mayoritas kaum nabi hud tetap ingkar dan enggan mengikuti dakwahnya. Mereka berkata dengan angkuh serta tanpa dasar ilmu kecuali mengikuti tradisi nenek moyang mereka, apakah tujuan kedatanganmu kepada kami hanya untuk menyeru agar kami hanya menyembah Allah saja, tidak menyekutukan-Nya dengan yang lain, tidak mengangkat perantara antara kami dan dia, dan meninggalkan apa yang biasa dan terus-menerus disembah oleh nenek moyang kami' padahal, kami telah mengikuti tradisi dan kebiasaan mereka sebelum kedatanganmu. Seruanmu ini jelas tidak bisa kami terima dan kami tidak akan menaatinya. Jika engkau mau mengancam kami karena tidak mengikuti ajakanmu, maka buktikanlah ancamanmu yang kamu katakan kepada kami, jika kamu benar dalam ucapanmu! dia, nabi hud, menjawab tantangan kaumnya, sungguh, kebencian dan kemurkaan dari tuhan sudah pasti akan menimpa kamu akibat kedurhakaan dan kekafiranmu. Apakah kamu hendak berbantah denganku tentang nama-nama berhala yang kamu dan nenek moyangmu buat dan namakan sendiri, padahal pemberian nama dengan nama-nama tuhan kepada berhala dan patung-patung itu tidak masuk akal. Begitu juga menjadikan mereka sebagai perantara untuk mendekatkan diri kepada Allah, sedangkan Allah tidak menurunkan keterangan, dalil, dan alasan untuk membenarkan perbuatan itu' setelah nabi hud menjelaskan siksa yang akan menimpa orang yang ingkar, beliau melanjutkan, jika demikian, apabila kamu masih tetap mengikuti ajaran nenek moyangmu, tunggulah azab dan kemarahan Allah sebagaimana yang kamu minta! sesungguhnya aku pun bersamamu termasuk yang menunggu keputusan Allah. Sesungguhnya kami yakin akan ketentuan Allah, sedang kalian meragukannya, bahkan, tidak meyakininya."
  }
]