[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hud berkata kepada kaumnya, ”Sungguh sudah pasti siksaan dan kemurkaan tuhan kalian akan menimpa kalian. Apakah pantas kalian melancarkan bantahan kepadaku tentang patung-patung yang kalian dan nenek moyang kalian menyebutnya sebagai tuhan-tuhan? padahal Allah tidak menurunkan tentang hal itu hujjah dan bukti kebenarannya. Sebab semua itu merupakan makhluk yang tidak dapat mendatangkan mudarat dan tidak bisa membawa kemanfaatan. Dzat yang benar-benar berhak diibadahi hanyalah Dzat pencipta Yang Maha Suci. Maka tunggulah kedatangan siksaan yang akan menimpa kalian. Sesungguhnya aku juga menunggu kedatangannya bersama kalian.” Ini sudah merupakan ancaman dan peringatan yang paling menakutkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Hud menjawab ucapan mereka dengan mengatakan, “Kalian benar-benar pantas menerima azab dan murka dari Allah. Azab itu pasti akan datang kepada kalian, bukan sesuatu yang mustahil. Apakah kalian hendak berdebat denganku tentang berhala-berhala yang kalian dan leluhur kalian sebut sebagai tuhan, padahal sebenarnya tidak nyata? Karena Allah tidak pernah menurunkan hujah yang bisa kalian jadikan landasan untuk penyebutan berhala-berhala tersebut sebagai tuhan. Maka tunggulah azab yang kalian minta itu. Dan aku pun menunggu bersama kalian. Azab itu pasti datang.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Huud Mengingkari kesombongan dan kesesatan mereka dengan menyatakan: telah datang waktu turunnya azab yang keras dan kemurkaan yang menakutkan dari Tuhan kalian. Apakah kalian mendebatku dengan hujjah tentang berhala-berhala yang kalian dan nenek moyang kalian sendiri yang memberikan namanya? Allah sama sekali tidak menurunkan bukti untuk menyembah berhala-berhala itu. Maka tunggulah turunnya azab, dan aku bersama kalian menunggu apa yang akan menimpa kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. قَدْ وَقَعَ عَلَيْكُم مِّن رَّبِّكُمْ رِجْسٌ وَغَضَبٌ ۖ (Sungguh sudah pasti kamu akan ditimpa azab dan kemarahan dari Tuhanmu) Yakni kalian telah layak untuk mendapat azab dan kemurkaan Allah, dan itu pasti akan menimpa kalian. Nabi Huud menjadikan azab yang belum terjadi ini seakan-akan telah terjadi sebagai peringatan akan kepastian terjadinya. Makna (الرجس) yakni azab yang keras. أَتُجٰدِلُونَنِى فِىٓ أَسْمَآء (Apakah kamu sekalian hendak berbantah dengan aku tentang nama-nama) Yakni nama-nama berhala yang dahulu mereka sembah. Nabi Huud menganggapnya hanya sebatas nama-nama saja, karena berhala-berhala ini kenyataannya tidak ada, dan penyebutannya sebagai tuhan-tuhan adalah sesuatu yang bathil, sehingga seakan-akan seseatu yang tidak ada, hanya sebatas nama saja. سَمَّيْتُمُوهَآ أَنتُمْ وَءَابَآؤُكُم(yang kamu beserta nenek moyangmu menamakannya) Kalian menyebut berhala-berhala sebagai tuhan-tuhan adalah berasal dari pandangan diri kalian sendiri dan nenek moyang kalian, padahal kenyataannya tidak seperti itu. مَّا نَزَّلَ اللهُ بِهَا مِن سُلْطٰنٍ ۚ( padahal Allah sekali-kali tidak menurunkan hujjah untuk itu) Yakni hujjah yang kalian kemukakan sebagai bukti dari pengakuan-pengakuan bathil kalian. فَانتَظِرُوٓا۟ إِنِّى مَعَكُم مِّنَ الْمُنتَظِرِينَ(Maka tunggulah (azab itu), sesungguhnya aku juga termasuk orang yamg menunggu bersama kamu) Yakni tunggulah azab yang kalian tunggu-tunggu itu, dan aku termasuk orang yang menunggu bersama kalian; dan ia pasti akan menimpa kalian tanpa ada keraguan sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Hud AS berkata: “Sungguh azab dan kemurkaan (Allah) pasti dan harus menimpa kalian, Apakah kalian akan mendebatku tentang berhala-berhala yang kalian dan bapak-bapak kalian sebut sebagai Tuhan. Allah tidak menurunkan hujjah tentang berhala itu, dan tidak ada pula bukti (yang membenarkan) tentang penyembahnnya. Maka tunggulah turunnya azab yang dahsyat itu. Sesungguhnya aku termasuk orang menunggunya bersama kalian, dan itu pasti menimpa kalian” Penyebutan berhala dengan Asma’ (nama-nama) itu untuk menyindir bahwa berhala-berhala itu bukanlah sesuatu yang nyata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hud berkata,“Sungguh, sudah pasti} pasti {kalian akan ditimpa azab} azab {dan kemarahan dari Tuhan kalian. Apakah kalian hendak berbantah-bantahan dengan Aku tentang nama-nama} berhala {yang kalian beri nama beserta nenek moyang kalian. Allah tidak menurunkan alasan untuk itu} alasan dan bukti kebenaran {Maka tunggulah. Sesungguhnya aku bersama kalian termasuk orang-orang yang menunggu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71 Hud berkata kepada mereka ”sungguh kamu pasti akan ditimpa azab dan kemarahan dari Rabbmu” yakni azab itu pasti terjadi, karena penyebab-penyebabnya telah terpenuhi dan waktu kebinasaan telah tiba. ”apakah kamu sekalian hendak berbantah denganku tentang nama-nama (berhala) yang kamu dan nenek moyangmu menamakannya, ”yakni, bagaimana kamu mendebat perkara-perkara yang tidak ada hakikatnya dan dalam perkara berhala yang kamu namakan sebagai tuhan padahal ia sama sekali tidak memiliki sifat ketuhanan. ”padahal Allah sekali-kali tidak menurunkan hujjah untuk itu” seandainya berhala-berhala itu adalah benar, niscaya Allah akan menurunkan hujjah untuk itu. Tidak turunnya hujjah tentang hal itu adalah bukti kebatilannya, karena tidak ada perkara yang menjadi suatu tujuan lebih-lebih perkara besar kecuali Allah telah menjelaskan hujjah-hujjahNya yang memadai dan ilmu yang tidak samar sedikitpun. ”maka tunggulah (azab) itu” yang akan menimpamu yang telah aku janjikan kepadamu. ”sesungguhnya aku juga termasuk orang yang menunggu bersamamu” meski kedua penungguan itu tidaklah sama, menunggunya orang yang cemas terhadap turunnya azab dan menungggunya orang yang berharap pertolongan dan pahala dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 71: Karena sebab-sebabnya telah ada. Karena jika hal itu benar, tentu Allah akan menurunkan keterangan. Oleh karena Alah tidak menurunkan keterangan, maka yang demikian menunjukkan bahwa hal itu tidak benar. Maka Allah mengirimkan kepada mereka angin yang membinasakan. Angin itu tidak membiarkan sesuatu pun yang dilandanya, kecuali dijadikannya seperti serbuk (lih. Adz Dzaariyat: 41-42), sehingga tidak ada yang terlihat lagi selain tempat tinggal mereka, maka perhatikanlah bagaimana akibat orang-orang yang telah mendapat peringatan, namun malah menolaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 71",
    "description": "Dia, nabi hud, menjawab tantangan kaumnya, sungguh, kebencian dan kemurkaan dari tuhan sudah pasti akan menimpa kamu akibat kedurhakaan dan kekafiranmu. Apakah kamu hendak berbantah denganku tentang nama-nama berhala yang kamu dan nenek moyangmu buat dan namakan sendiri, padahal pemberian nama dengan nama-nama tuhan kepada berhala dan patung-patung itu tidak masuk akal. Begitu juga menjadikan mereka sebagai perantara untuk mendekatkan diri kepada Allah, sedangkan Allah tidak menurunkan keterangan, dalil, dan alasan untuk membenarkan perbuatan itu' setelah nabi hud menjelaskan siksa yang akan menimpa orang yang ingkar, beliau melanjutkan, jika demikian, apabila kamu masih tetap mengikuti ajaran nenek moyangmu, tunggulah azab dan kemarahan Allah sebagaimana yang kamu minta! sesungguhnya aku pun bersamamu termasuk yang menunggu keputusan Allah. Sesungguhnya kami yakin akan ketentuan Allah, sedang kalian meragukannya, bahkan, tidak meyakininya. Maka tatkala telah datang ketentuan Allah, kami selamatkan dia, yakni nabi hud, dan orang-orang yang beriman bersamanya dengan rahmat dan pertolongan kami dan kami musnahkan sampai ke akar-akarnya tanpa ada sisa orang-orang yang mendustakan ayat-ayat kami dengan angin kencang dan sangat dingin yang menghempaskan mereka sehingga mati tersungkur. Mereka tidak terlihat sama sekali, hanya kelihatan bekasbekas tempat tinggal mereka (lihat: surah al-ahqa'f/46: 25. Mereka dibinasakan karena bukanlah termasuk orang-orang beriman."
  }
]