[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian siksaan Allah terjadi dengan dikirimnya angin yang sangat kencang kepada mereka. Lalu Allah menyelamatkan Hud dan orang-orang yang beriman bersamanya dengan rahmat yang besar dariNya. Dan Dia menghancurkan orang-orang kafir dari kaumnya secara keseluruhannya, dan membinasakan mereka hingga tidak tersisa. Dan mereka tidaklah beriman karena menghimpun antara pendustaan terhadap ayat-ayat Allah dan meninggalkan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Kemudian Kami selamatkan Hud -‘Alaihissalām- dan para pengikutnya dengan rahmat Kami. Dan Kami musnahkan orang-orang yang mendustakan ayat-ayat Kami. Mereka bukan orang-orang mukmin tetapi orang-orang kafir. Maka mereka pantas mendapat azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Maka Kami menyelamatkan Huud dan orang-orang yang beriman yang bersamanya, dengan rahmat yang besar dari Kami. Dan Kami binasakan orang-orang kafir yang mendustakan ayat-ayat yang didatangkan Huud dan terus-menerus berada di dalam kekafiran mereka. Mereka dibinasakan dengan angin yang sangat dingin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. فَأَنجَيْنٰهُ وَالَّذِينَ مَعَهُۥ بِرَحْمَةٍ مِّنَّا (Maka kami selamatkan Hud beserta orang-orang yang bersamanya dengan rahmat yang besar dari Kami) Allah mengabarkan bahwa Dia telah menyelamatkan Nabi Huud dan pengikut-pengikutnya yang beriman dari azab yang menimpa orang-orang kafir dan tidak menerima risalahnya. وَقَطَعْنَا دَابِرَ الَّذِينَ كَذَّبُوا۟ (dan Kami tumpas orang-orang yang mendustakan) Yakni Kami binasakan mereka semua hingga tidak tersisa seorangpun dari mereka. وَمَا كَانُوا۟ مُؤْمِنِينَ (dan tiadalah mereka orang-orang yang beriman) Yakni Kami menumpas kaum yang dalam diri mereka terdapat pendustaan dan kekafiran. Azab yang ditimpakan Allah kepada mereka adalah angin tornado yang berhawa sangat dingin yang menghancurkan rumah-rumah dan pohon-pohon, angin itu berhembus dengan membawa bebatuan yang terlempar ke wajah-wajah mereka, serta menyeret mereka lalu menjatuhkan mereka ke atas tanah. Allah berfirman dalam surat (al-Haqqah: 6-7): “Adapun kaum ‘Aad maka mereka telah dibinasakan dengan angin yang sangat dingin lagi amat kencang, yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat kaum ‘Aad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul pohon kurma yang telah kosong (lapuk)”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Lalu Kami menyelamatkan Hud dan para pengikutnya yang beriman dari azab dengan rahmat yang Kami peruntukkan bagi ahli iman, dan Kami binasakan dan hancurkan kaum yang mendustakan ayat-ayat Kami yang diturunkan untuk pada rasul, dan Kami tidak menyisakan seorangpun karena tidak adanya keimanan pada diri mereka dan pendustaan mereka terhadap rasul mereka,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami selamatkan dia dan orang-orang yang bersamanya karena rahmat dari Kami, dan Kami binasakan} Kami cabut {sampai akar-akarnya} sampai yang terakhir {orang-orang yang mendustakan ayat-ayat Kami dan mereka bukanlah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72 Oleh karena itu Allah membedakan kedua golongan. Dia berfirman ”maka kami selamatkan dia” yakni hud, ”beserta orang-orang” yang beriman bersamanya, ”dengan rahmat yang besar beserta kami” karena Dialah yang memberi mereka petunjuk kepada keimanan dan menjadikan iman mereka sebagai sebab mereka mendapatkan rahmat, maka Allah menyelamatkan mereka dengan rahmatNya” dan kami tumpas orang-orang yang mendustakan ayat-ayat kami” yakni kami binasakan mereka dengan azab yang keras dan tidak menyisakan seorangpun dari mereka. \"Allah mengirim kepada mereka angin yang membinasakan, angin itu tidak akan membiarkan Sesutuatupun dilandanya, melainkan dijadikannya seperti serbuk.\" Maka mereka semua binasa \"sehingga mereka menjadi tidak terlihat kecuali hanya tempat tianggalnya saja\" maka perhatikanlah akibat orang-orang yang sudah diberi peringatan dan Orang-orang yang telah ditegakkan hujjah atas mereka tetapi mereka tidak tunduk kepadanya, dan mereka diperintahkan agar mereka beriman tetapi mereka tidak beriman, maka akibatnya adalah kebinasaan, kehinaan, dan kesengsaraan, \"Dan mereka selalu diikuti dengan kutukan di dunia ini dan (begitu pula) di hari kiamat. Ingatlah, sesungguhnya kaum ‘Ad itu kafir kepada Tuhan mereka. Ingatlah kebinasaanlah bagi kaum ‘Ad (yaitu) kaum Huud itu.\" (HUD :60). dan disini Allah berfirman ”dan kami tumpas orang-orang yang mendustakan ayat-ayat kami dan tiadalah mereka orang-orang ayng beriman” sedikitpun, justru sifat mereka adalah pendustaan dan pengingkaran. Ciri mereka adalah kesombongan dan kerusakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 72",
    "description": "Maka tatkala telah datang ketentuan Allah, kami selamatkan dia, yakni nabi hud, dan orang-orang yang beriman bersamanya dengan rahmat dan pertolongan kami dan kami musnahkan sampai ke akar-akarnya tanpa ada sisa orang-orang yang mendustakan ayat-ayat kami dengan angin kencang dan sangat dingin yang menghempaskan mereka sehingga mati tersungkur. Mereka tidak terlihat sama sekali, hanya kelihatan bekasbekas tempat tinggal mereka (lihat: surah al-ahqa'f/46: 25. Mereka dibinasakan karena bukanlah termasuk orang-orang beriman. Setelah dijelaskan kisah kaum 'ad yang menentang dakwah nabi hud dan azab yang mereka terima, selanjutnya diuraikan kisah nabi saleh dan kaumnya. Dan kepada kaum samud kami utus saudara seketurunan mereka, yaitu nabi saleh. Dia berkata, wahai kaumku! sembahlah Allah tuhan yang maha esa! tidak ada tuhan sembahan yang patut disembah bagimu selain dia. Sesungguhnya telah datang kepadamu bukti yang nyata dan sangat jelas untuk membuktikan kebenaranku sebagai utusan dari tuhanmu. Ini adalah seekor unta betina dari Allah sebagai tanda kenabianku khusus untukmu. Karena unta ini milik Allah, biarkanlah ia makan rerumputan di bumi Allah mana pun ia temukan, janganlah ia disakiti, diganggu apalagi disembelih, karena nanti akibatnya, kamu akan mendapatkan siksaan yang pedih dari Allah."
  }
]