[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kami telah mengutus kepada kaum tsamud saudara mereka, Shaleh, di kala mereka menyembah patung-patung, bukan kepada Allah . Shaleh berkata kepada mereka, ”Wahai kaumku, beribadahlah kepada Allah semata, kalian tidak memiliki sesembahan yang berhak diibadahi selain Allah maka ikhlaskanlah peribadahan kalian kepadaNYa saja. Sesungguhnya aku datang kepada kalian dengan membawa bukti tentang kebenaran ajaran yang aku serukan kepada kalian, yaitu ketika aku berdo’a kepada Allah di hadapan kalian, Lalu dia mengeluarkan bagi kalian satu unta betina besar dari balik batu, sebagaimana yang kalian minta. Maka biarkanlah unta itu makan sesukanya di bumi Allah, di tempat-tempat penggembalaan. Janganlah kalian melancarkan gangguan apa pun kepadanya, maka akan menimpa kalian disebabkan hal itu, siksaan yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Dan kepada suku Ṡamūd Kami utus saudara laki-laki mereka, Ṣāleḥ untuk mengajak mereka mengesakan dan menyembah Allah. Ṣāleḥ berkata kepada mereka, “Wahai kaumku! Sembahlah Allah semata. Karena kalian tidak punya tuhan lain yang berhak disembah selain Dia. Telah datang kepada kalian bukti nyata dari Allah yang menunjukkan kebenaran dari ajaran yang kubawa. Bukti itu ada pada unta yang keluar dari dalam batu. Unta itu mempunyai waktu sendiri untuk minum. Dan kalian pun mempunyai hari tertentu untuk minum. Maka biarkanlah unta itu makan di bumi Allah karena kalian tidak berkewajiban membiayai unta itu sedikit pun. Dan janganlah kalian mengganggunya, karena jika kalian mengganggunya kalian akan ditimpa azab yang sangat menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Dan Allah mengutus kepada kaum Tsamut saudara mereka, Shalih. Dahulu mereka tinggal di Hijr, sebelah selatan kota Madinah. Shalih berkata mereka dengan lembut: “Hai kaumku, sembahlah Allah semata, karena tidak ada Tuhan yang berhak disembah selain Dia. Telah datang kepada kalian mukjizat yang jelas dari Tuhan kalian, berupa unta betina sebagai tanda dan pengingat bagi orang yang menyaksikan dan mendengar tentangnya, biarkanlah unta itu menggembala di bumi Allah sesuka hati, dan janganlah kalian mengganggunya, agar kalian tidak mendapat azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَإِلَىٰ ثَمُودَ أَخَاهُمْ صٰلِحًا ۗ (Dan (Kami telah mengutus) kepada kaum Tsamud saudara mereka Shaleh) Yakni Kami telah mengutus kepada kaum Tsamud saudara mereka. Tsamud adalah kabilah yang bermukim di kota Hijr di negeri Arab, selatan kota Madinah terletak diantara kota Hijaz dan Syam dekat dengan lembah Qura. قَالَ يٰقَوْمِ اعْبُدُوا۟ اللهَ مَا لَكُم مِّنْ إِلٰهٍ غَيْرُهُۥ ۖ( Ia berkata: “Hai kaumku, sembahlah Allah, sekali-kali tidak ada Tuhan bagimu selain-Nya) Nabi Shalih memerintahkan mereka untuk beribadah kepada Allah, karena Allah menciptakan makhluk-Nya untuk beribadah, dan ia mengabarkan mereka bahwa ibadah hanya boleh dilakukan untuk Allah semata. Dua hal ini merupakan intisari dari dakwah para rasul, sebagaimana firman Allah (an-Nahl: 36): “Dan sungguhnya Kami telah mengutus rasul pada tiap-tiap umat (untuk menyerukan): “Sembahlah Allah (saja), dan jauhilah Thaghut itu”. قَدْ جَآءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ ۖ( Sesungguhnya telah datang bukti yang nyata kepadamu dari Tuhanmu) Yakni dengan mukjizat yang jelas berupa unta berina yang dikeluarkan dari batu yang keras. فَذَرُوهَا تَأْكُلْ فِىٓ أَرْضِ اللهِ ۖ (maka biarkanlah dia makan di bumi Allah) Yakni biarkanlah unta itu memakan makanan di bumi Allah karena unta tersebut milik Allah dan bumi ini juga milik-Nya, maka janganlah kalian menghalanginya dari apa yang bukan milik kalian. وَلَا تَمَسُّوهَا بِسُوٓءٍ(dan janganlah kamu mengganggunya dengan gangguan apapun) Dengan suatu gangguan apapun. Yakni janganlah kalian menghalanginya dengan cara apapun yang menyebabkan ia tersakiti atau mendapatkan bahaya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Dan Kami telah mengutus Shalih AS kepada suku Tsamud (suku yang tinggal di Al-Hijr, daerah utara Madinah dan dekat dengan Tabuk). Dia menyeru mereka untuk beriman dan berkata: “Wahai kaumku, menyembahlah hanya kepada Allah. Tiada Tuhan yang berhak kalian sembah selain Dia. Sungguh telah datang kepada kalian mukjizat yang terang dari Allah yang menunjukkan atas kebenaran risalahku, yaitu unta agung dari sisi Allah SWT, maka biarkanlah unta itu makan di tanah Allah. Kalian tidak perlu memberinya makan, dan janganlah kalian menyakitinya. Dan azab yang pedih akan menimpa kalian jika menyerangnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan (Kami mengutus) kepada kaum Tsamud saudara mereka, Shalih. Dia berkata,“Wahai kaumku, sembahlah Allah tidak ada tuhan bagi kalian selain Dia. Sungguh telah datang kepada kalian bukti nyata} dalil yang membuktikan kenabianku {dari Tuhan kalian. Ini adalah unta betina Allah untuk kalian sebagai mukjizat. Maka biarkanlah ia} biarkanlah unta itu {makan di bumi Allah dan janganlah kalian mengganggunya} mengacaukannya {dengan keburukan sehingga kalian ditimpa siksa yang sangat pedih.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73 Dan kami telah mengutus “kepada kaum tsamud” kabilah terkenal yang mendiami hijr dan sekitarnya di tanah hijaz dan jazirah arab. Allah mengutus kepada mereka “saudari mereka, shaleh” sebagai nabi yang mengajak mereka kepada iman dan tauhid dan melarang mereka dari kekufuran dan kesyirikan. Maka shaleh berkata ”hai kaumku, sembahlah Allah, sekali-kali tidak ada ilah bagimu selainNYa” Dakwah shaleh sama dengan dakwah saudAra-saudaranya para Nabi yang lain, yaitu perintah beribadah kepada Allah dan penjelasan bahwa hanya Dialah yang berhak disembah. ”sesungguhnya telah datang bukti yang nyata kepadamu dari Rabbmu” yakni salah satu mukjizat yang tidak lain kecuali dari langit dimana manusia tidak mampu mendatangkannya. Kemudian shaleh menjelaskan mukjizat itu ”unta betina Allah menjadi tanda bagimu” yakni ini adalah unta yang mulia lagi utama karena ia disandarkan kepada Allah sebagai bentuk penghormatan. Padanya terdapat tanda yang besar bagimu. tanda ini disebutkan dalam firmannNya ”ia mempunyai giliran untuk mendapatkan air, dan kamu mempunyai giliran pula untuk mendapatkan air di hari tertentu” Tsamud memiliki sumur yang besar, ia dikenal dengan sumur unta, mereka dengan unta itu saling bergiliran. Satu hari unta itu minum dari sumur dan mereka minum air susunya, dan sehari berikutnya mereka minum dari sumur dan unta itu menjauh. Lalu Nabi mereka shlaeh berkata kepada mereka ”maka biarkanlah dia makan di bumi Allah” makanannya bukan tanggung jawabmu sedikitpun. ”dan janganlah kamu mengganggunya dengan gangguan apapun” dengan menyembelihnya atau dengan yang lain, ”yang karenanya kamu akan ditimpa siksaan yang pedih.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 73: Tsamud adalah kabilah (suku) yang tinggal di Hijr dan sekitarnya, yaitu negeri HIjaz dan jazirah Arab. Yang menunjukkan kebenaranku, di mana sebelumnya mereka meminta bukti kepada Saleh untuk mendatangkan mukjizat, maka Allah mendatangkan unta betina itu. Kamu tidak perlu memberinya makan. Dipukul atau disembelih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 73",
    "description": "Setelah dijelaskan kisah kaum 'ad yang menentang dakwah nabi hud dan azab yang mereka terima, selanjutnya diuraikan kisah nabi saleh dan kaumnya. Dan kepada kaum samud kami utus saudara seketurunan mereka, yaitu nabi saleh. Dia berkata, wahai kaumku! sembahlah Allah tuhan yang maha esa! tidak ada tuhan sembahan yang patut disembah bagimu selain dia. Sesungguhnya telah datang kepadamu bukti yang nyata dan sangat jelas untuk membuktikan kebenaranku sebagai utusan dari tuhanmu. Ini adalah seekor unta betina dari Allah sebagai tanda kenabianku khusus untukmu. Karena unta ini milik Allah, biarkanlah ia makan rerumputan di bumi Allah mana pun ia temukan, janganlah ia disakiti, diganggu apalagi disembelih, karena nanti akibatnya, kamu akan mendapatkan siksaan yang pedih dari Allah. Kaum samud juga diingatkan dengan nikmat-nikmat Allah agar mereka patuh dan taat kepada-Nya. Dan ingatlah nikmat-nikmat dan kebaikan Allah kepadamu ketika dia menjadikan kamu khalifah-khalifah yang berkuasa setelah kebinasaan kaum 'ad dan menempatkan kamu di tempat yang memudahkan kamu melakukan aktivitas di bumi, yakni di negeri hijr, daerah yang strategis untuk tempat tinggal. Di tempat yang datar yakni di daratan rendahnya, kamu dirikan istana-istana, bangunan yang besar, luas, dan indah sebagai tempat tinggal ketika musim panas. Dan di dataran tinggi, bukit-bukit, dan bebatuannya kamu pahat dan lubangi sehingga menjadi rumah-rumah untuk kamu diami pada musim dingin. Maka ingatlah nikmat-nikmat Allah, yang telah diberikan kepadamu supaya kamu bersyukur, dan janganlah kamu membuat kerusakan di bumi dengan mempersekutukan Allah, berbuat maksiat, dan mengabaikan dakwah rasul-Nya."
  }
]