[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian nikmat Allah yang tercurah kepada kalian, ketika Allah menjadikan kalian sebagai manusia-manusia yang menggantikan orang-orang sebelum kalian di muka bumi setelah kaum Ad, dan memberikan kekuasaan bagi kalian di daerah yang baik yang kalian tinggali, kemudian kalian membangun di tanah-tanah datarnya istana-istana megah, dan kalian memahat daerah-daerah gunungnya sebagai rumah-rumah yang lain. Maka ingatlah nikmat-nikmat Allah yang tercurah atas kalian dan janganlah kalian berlalu lalang di muka bumi dengan membuat kerusakan. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Dan ingatlah nikmat Allah yang dilimpahkan kepada kalian ketika kalian menjadi penerus kaum ‘Ād di muka bumi, menempatkan kalian di sana sehingga kalian bisa menikmati apa yang ada di sana dan menemukan apa yang kalian cari. Hal itu terjadi setelah kaum ‘Ād dibinasakan karena mereka telah kufur dan ingkar. Kalian membangun istana-istana di tanah yang datar dan memahat gunung-gunung menjadi tempat tinggal kalian. Maka ingatlah nikmat-nikmat yang Allah berikan kepada kalian agar kalian bersyukur kepada-Nya. Dan tinggalkanlah perbuatan yang mendatangkan kerusakan di muka bumi. Yaitu dengan meninggalkan kekufuran terhadap Allah dan menjauhi perbuatan maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Dan ingatlah karunia Allah yang telah diberikan kepada kalian, ketika menjadikan kalian sebagai khalifah di bumi, sehingga kalian dapat bersenang-senang dengan kenikmatan yang ada di dalamnya setelah kebinasaan kaum ‘Aad. Dan Allah memberi kalian tempat tinggal di tempat bebatuan, kalian membangun istana-istana yang megah di tanahnya yang lapang, dan kalian memahat gunung-gunungnya sebagai rumah yang layak dihuni. Maka ingatlah kenikmatan-kenikmatan yang telah Allah berikan kepada kalian, dan janganlah kalian berbuat kerusakan terhadap negeri dan hamba-hamba yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَاذْكُرُوٓا۟ إِذْ جَعَلَكُمْ خُلَفَآءَ مِنۢ بَعْدِ عَادٍ (Dan ingatlah olehmu di waktu Tuhan menjadikan kamu pengganti-pengganti (yang berkuasa) sesudah kaum ‘Aad) Yakni menjadikan kalian khalifah-khalifah di bumi, atau menjadikan kalian penguasa-penguasa di bumi. وَبَوَّأَكُمْ فِى الْأَرْضِ (dan memberikan tempat bagimu di bumi) Yakni menjadikan bagi kalian tempat tinggal di bumi, yaitu rumah menjadikan kalian tentram di dalamnya. تَتَّخِذُونَ مِن سُهُولِهَا قُصُورًا (Kamu dirikan istana-istana di tanah-tanahnya yang datar) Yakni tanahnya mereka jadikan sebagai batu bata atau ubin dan lain sebagainya kemudian kalian pakai untuk membangun istana-istana. وَتَنْحِتُونَ الْجِبَالَ بُيُوتًا ۖ (dan kamu pahat gunung-gunungnya untuk dijadikan rumah) Karena kekuatan mereka dan keperkasaan badan mereka, mereka memahat gunung-gunung untuk dijadikan gua-gua sebagai tempat tinggal. Pendapat lain mengatakan: karena bangunan-bangunan dan atap-atap rusak sebelum umur mereka habis (maka mereka membangun rumah-rumah dari gunung-gunung agar bertahan lebih lama). فَاذْكُرُوٓا۟ ءَالَآءَ اللهِ(maka ingatlah nikmat-nikmat Allah) Tafsir dari kalimat ini telah dijelaskan pada kisah sebelum ini (pada kisah Nabi Huud). وَلَا تَعْثَوْا۟ فِى الْأَرْضِ مُفْسِدِينَ (dan janganlah kamu merajalela di muka bumi membuat kerusakan) Yakni janganlah kalian banyak berbuat kerusakan di muka bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Dan ingatlah nikmat dan kuasa Allah ketika Dia menjadikan kalian khalifah di bumi setelah kaum ‘Aad dan memberi kalian tempat di bumi sehingga kalian bisa membuat istana-istana yang menjulang tinggi dengan mudah dan memahat gunung-gunung untuk dijadikan rumah dan gua, maka ingatlah nikmat yang banyak dan agung ini, dan janganlah memperbanyak kerusakan di bumi dengan berlebihan dan terus-menerus berbuat kerusakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah ketika Allah menjadikan kalian khalifah-khalifah sesudah kaum ‘Ad dan memberikan kalian tempat} memberi kalian tempat {di bumi. Kalian membuat pada dataran rendahnya istana-istana} kalian membangun pada dataran rendahnya istana-istana yang menjulang {dan kalian memahat gunung-gunungnya menjadi rumah} kalian menggali pada gunung-gunung sebagai rumah {Maka ingatlah nikmat-nikmat Allah dan janganlah kalian melakukan kejahatan} berjalan {di bumi dengan berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74 \"Dan ingatlah olehmu diwaktu Rabb menjadikan kamu pengganti-pengganti (yang berkuasa)\" di bumi, yang padanya kamu bersenang-senang dan meraih keinginanmu. ”sesudah kaum ‘ad” yang telah dibinasakan oleh Allah lalu Allah menjadikanmu pengganti sesudah mereka. ”dan memberikan tempat bagimu dibumi” yakni mengizinkanmu hidup padanya dan memudahkan sarana-sarana yang dengannya kamu meraih apa yang kamu inginkan dan kamu perlukan “kamu dirikan istana-istana di tanah-tanah yang datar” yakni tanah-tanah datar yang bukan gunung, dan disana kamu membangun istana-istana. Dan dari gunung-gunung kamu memahatnya, untuk kamu jadikan sebagai rumah, sebagaimana ia bisa dilihat sampai sekarang peninggalan-peninggalan mereka di gunung yang ada di hijr dan sekelilingnya. Ia tetap ada selama gunung itu ada. ”maka ingatlah nikmat-nikmat Allah” berupa karunia, rizki serta kekuatan yang diberikanNya kepadamu. ”dan janganlah kamu merajalela di muka bumi membuat kerusakan” yakni jangan kamu menghancurkan bumi dengan kerusakan dan kemaksiatan, karena kemaksiatan dapat merubah negri-negri yang makmur menjadi kubangan kesengsaraan, negri-negri itu telah sepi dari penduduknya, sehingga suasananya pun mencekam dan menakutkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 74: Yang dibinasakan Allah. Yang kamu tempati di musim panas. Yang kamu tempati di musim dingin. Dan apa yang diberikan-Nya kepadamu berupa karunia, rezeki dan kekuatan. Dengan merusaknya dan berbuat maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 74",
    "description": "Kaum samud juga diingatkan dengan nikmat-nikmat Allah agar mereka patuh dan taat kepada-Nya. Dan ingatlah nikmat-nikmat dan kebaikan Allah kepadamu ketika dia menjadikan kamu khalifah-khalifah yang berkuasa setelah kebinasaan kaum 'ad dan menempatkan kamu di tempat yang memudahkan kamu melakukan aktivitas di bumi, yakni di negeri hijr, daerah yang strategis untuk tempat tinggal. Di tempat yang datar yakni di daratan rendahnya, kamu dirikan istana-istana, bangunan yang besar, luas, dan indah sebagai tempat tinggal ketika musim panas. Dan di dataran tinggi, bukit-bukit, dan bebatuannya kamu pahat dan lubangi sehingga menjadi rumah-rumah untuk kamu diami pada musim dingin. Maka ingatlah nikmat-nikmat Allah, yang telah diberikan kepadamu supaya kamu bersyukur, dan janganlah kamu membuat kerusakan di bumi dengan mempersekutukan Allah, berbuat maksiat, dan mengabaikan dakwah rasul-Nya. Mendengar peringatan Allah yang disampaikan oleh nabi saleh, pemuka-pemuka dan pembesar masyarakat dari kaumnya yang menyombongkan diri dan angkuh berkata dengan nada ejekan untuk menanamkan keraguan kepada orang-orang yang dianggap lemah, yaitu orang-orang yang telah beriman di antara kaumnya, tahukah atau percayakah kamu bahwa saleh adalah seorang rasul dari tuhannya yang diutus untuk menyampaikan risalah' mereka, orang-orang yang beriman, menjawab dengan tegas, sesungguhnya kami benar-benar percaya kepada apa, yakni risalah, yang disampaikannya, yakni nabi saleh, kepada kami, karena petunjukpetunjuk itu benar dan datangnya dari Allah."
  }
]