[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pemimpin dan tokoh-tokoh dari orang-orang yang menyombongkan diri dari kaum shaleh berkata kepada kaum mukminin yang mereka tindas dan hinakan, ”Apakah kalian tahu secara hakikat bahwa Shaleh telah diutus oleh Allah kepada kita?” Orang-orang yang beriman menjawab, ”Kami mengimani risalah yang Allah mengutus dirinya dengan membawakannya, dan mengikuti ajaran syariatNya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Para pemuka dan pemimpin yang menyombongkan diri di antara kaumnya berkata kepada orang-orang mukmin dari kaumnya yang mereka anggap lemah, “Apakah kalian yakin -wahai orang-orang mukmin- bahwa Ṣāleḥ benar-benar utusan Allah?” Orang-orang mukmin yang mereka anggap lemah menjawab, “Sesungguhnya kami percaya, yakin, dan tunduk kepada ajaran yang dibawa oleh Ṣāleḥ dan mengamalkan syariat-nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Maka para pembesar kaumnya yang sombong berkata kepada orang-orang beriman yang lemah untuk menghina mereka: “Apakah kalian tidak mengetahui jika Shalih itu benar-benar diutus oleh Allah kepada kita?” Maka orang-orang beriman itu menjawab dengan penuh keyakinan dan harga diri: “Kami benar-benar yakin dengan kerasulan Shalih.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. قَالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا۟ مِن قَوْمِهِۦ (Pemuka-pemuka yang menyombongkan diri di antara kaumnya berkata) Yakni pemimpin-pemimpin yang sombong dari kaum Nabi Shalih berkata kepada orang-orang lemah yang dijadikan bawahan oleh orang-orang sombong tersebut. أَتَعْلَمُونَ أَنَّ صٰلِحًا مُّرْسَلٌ مِّن رَّبِّهِۦ ۚ (Tahukah kamu bahwa Shaleh di utus (menjadi rasul) oleh Tuhannya?) Mereka mengatakan ini sebagai celaan dan hinaan. قَالُوٓا۟ إِنَّا بِمَآ أُرْسِلَ بِهِۦ مُؤْمِنُونَ(Mereka menjawab: “Sesungguhnya kami beriman kepada wahyu, yang Shaleh diutus untuk menyampaikannya”) Yakni orang-orang yang beriman yang menjadi pengikut Nabi Shalih berkata: “kami tidak hanya mengetahui kebenarannya namun juga kami beriman kepadanya dan mengikuti perintahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Para pemimpin dari kaum Shalih yang enggan untuk beriman berkata kepada orang-orang mukmin yang lemah dengan cara mengolok-olok dan menghina: “Tahukah kalian bahwa Shalih adalah seorang rasul yang diutus oleh Tuhannya?” Orang-orang (mukmin) yang lemah itu berkata: “Sesungguhnya kami mempercayai risalahnya dan mengikuti perintahnya, selain itu kami juga meyakini kebenarannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pemuka-pemuka yang menyombongkan diri di antara kaumnya berkata kepada orang-orang yang dianggap lemah yang telah beriman di antara mereka,“Apakah kalian tahu bahwa Shalih diutus oleh Tuhannya?” Mereka menjawab, “Sesungguhnya kami beriman kepada apa yang diperintahkan kepadanya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75 “pemuka-pemuka yang menyombongkan diri diantara kaumnya berkata” yakni para pemimpin dan pembesar yang menyombongkan diri dari kebenaran “kepada orang-orang yang dianggap lemah” karena tidak semua orang yang lemah itu beriman, maka mereka berkata ”yang telah beriman diantar mereka tahukah kamu bahwa shaleh itu diutus menjadi rasul oleh Rabbnya?” yakni apakah dia benar atau dusta? lalu orang-orang lemah itu menjawab “sesungguhnya kami beriman kepada wahyu yang shaleh diutus untuk menyampaikannya” yakni tauhid kepada Allah berita tentangNya, perintah dan laranganNYa,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 75: Berupa mengajak kepada tauhid, apa yang diberitakannya, perintahnya dan larangannya kami benarkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 75",
    "description": "Mendengar peringatan Allah yang disampaikan oleh nabi saleh, pemuka-pemuka dan pembesar masyarakat dari kaumnya yang menyombongkan diri dan angkuh berkata dengan nada ejekan untuk menanamkan keraguan kepada orang-orang yang dianggap lemah, yaitu orang-orang yang telah beriman di antara kaumnya, tahukah atau percayakah kamu bahwa saleh adalah seorang rasul dari tuhannya yang diutus untuk menyampaikan risalah' mereka, orang-orang yang beriman, menjawab dengan tegas, sesungguhnya kami benar-benar percaya kepada apa, yakni risalah, yang disampaikannya, yakni nabi saleh, kepada kami, karena petunjukpetunjuk itu benar dan datangnya dari Allah. Menanggapi perkataan orang-orang yang beriman, orang-orang yang menyombongkan diri dari kaum nabi saleh berkata masih de-ngan nada ejekan dan penolakan, sesungguhnya kami mengingkari dan tidak mempercayai sama sekali apa yang kamu, wahai orang-orang yang lemah, percayai. Mereka menyatakan pengingkaran terhadap apa yang diimani kaum yang lemah itu dan menghindari untuk menyatakan ingkar kepada apa yang dibawa nabi saleh, karena khawatir adanya kesan seolah-seolah mereka mengakui kerasulan nabi saleh."
  }
]