[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang menyombongkan diri berkata, ”sesungguhnya kami mengiingkari kenabian shaleh yang kalian Imani dan kalian ikuti. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Orang-orang yang sombong di antara kaumnya berkata, “Sesungguhnya kami ingkar terhadap apa yang kalian percayai itu, wahai orang-orang mukmin. Kami tidak akan beriman kepadanya dan tidak akan mengamalkan syariatnya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Maka orang-orang yang sombong itu berkata: “Adapun kami, sungguh mengingkari apa yang kalian yakini.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Para pemimpin yang enggan mengimani risalah Shalih AS itu berkata: “Sesungguhnya kami menolak dan mengingkari apa yang kalian imani itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menyombongkan diri berkata,“Sesungguhnya kami adalah orang-orang yang mengingkari apa yang kalian imani.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76 “orang-orang yang menyombongkan diri berkata ’sesungguhnya kami adalah orang yang tidak percaya kepada apa yang kamu imani itu’” kesombongan menyeret mereka sehingga mereka menolak tunduk kepada kebenaran seperti orang-orang yang lemah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 76",
    "description": "Menanggapi perkataan orang-orang yang beriman, orang-orang yang menyombongkan diri dari kaum nabi saleh berkata masih de-ngan nada ejekan dan penolakan, sesungguhnya kami mengingkari dan tidak mempercayai sama sekali apa yang kamu, wahai orang-orang yang lemah, percayai. Mereka menyatakan pengingkaran terhadap apa yang diimani kaum yang lemah itu dan menghindari untuk menyatakan ingkar kepada apa yang dibawa nabi saleh, karena khawatir adanya kesan seolah-seolah mereka mengakui kerasulan nabi saleh. Setelah pemuka masyarakat itu menyatakan pengingkaran dengan ucapan dan sikap, mereka juga membuktikan keingkaran itu dengan perbuatan. Kemudian mereka sembelih dan potong kaki unta betina yang menjadi bukti kebenaran nabi saleh itu, dan mereka juga berlaku angkuh terhadap perintah tuhannya dengan mengabaikan tuntunan Allah yang melarang mereka untuk menyakiti unta-Nya. Dan mereka berkata, wahai saleh! buktikanlah ancaman yang kamu janjikan kepada kami, bahwa kalau kami menyakiti unta dan menyembelihnya maka kami akan disiksa. Datangkanlah siksaan itu sekarang juga jika benar engkau salah seorang rasul yang diutus oleh Allah untuk menyampaikan ancaman-Nya."
  }
]