[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian mereka menyembelih unta betina itu sebagai bentuk pelecehan mereka terhadap ancaman shaleh asa , dan mereka bersikaf sombong untuk menaati perintah tuhan mereka, dan mereka berkata dengan nada mengejek dan kemustahilan datangnya siksa, ”Wahia shaleh, datangkanlah kepada kami apa yang engkau ancamkan berupa siksaan, jika kamu memang termasuk utusan-utusan Allah. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Kemudian mereka menyembelih unta yang tidak boleh mereka ganggu itu. Mereka enggan menjalankan perintah Allah. Dan mereka melecehkan ancaman yang disampaikan oleh Ṣāleḥ dengan mengatakan, “Wahai Ṣāleḥ! Datangkanlah kepada kami azab pedih yang kau ancamkan itu, jikalau kamu benar-benar utusan Allah!.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. kemudian mereka berani melanggar perintahnya, dengan menyembelih unta betina itu dan enggan mengikuti perintah Tuhan mereka, serta berkata dengan penuh keangkuhan: “Hai Shalih, datangkanlah kepada kami azab yang kamu ancamkan kepada kami, jika kamu benar-benar seorang rasul.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. فَعَقَرُوا۟ النَّاقَةَ (Kemudian mereka sembelih unta betina itu) Mereka membunuh unta itu dengan menyembelihnya atau memotong urat nadinya. Sebenarnya orang yang menyembelihnya hanya satu orang dari mereka namun dengan kerelaan dan persetujuan yang lain, oleh sebab itu Allah menisbatkan perbuatan itu kepada mereka semua. وَعَتَوْا۟ عَنْ أَمْرِ رَبِّهِمْ(dan mereka berlaku angkuh terhadap perintah Tuhan) Yakni mereka menyombongkan diri dan membangkang. وَقَالُوا۟ يٰصٰلِحُ ائْتِنَا بِمَا تَعِدُنَآ(Dan mereka berkata: “Hai Shaleh, datangkanlah apa yang kamu ancamkan itu kepada kami) Yakni berupa azab. Mereka mengatakan ini untuk menantang dan menyepelekannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Lalu mereka membunuh unta itu dengan menyembelih dan memotong kakinya. Pembunuhan itu dihubungkan dengan seluruh kaum, karena mereka senang dengan perbuatan salah satu golongan mereka. Mereka enggan mengikuti risalah Shalih. Dengan menantang dan mengejek, mereka berkata: “Wahai Shalih, datangkanlah azab yang kamu janjikan untuk kami, jika kamu adalah nabi yang benar-benar diutus”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka memotong} menyembelih {unta betina itu dan mereka melampaui batas} menyombongkan diri {terhadap perintah Tuhan mereka, dan mereka berkata,“Wahai Shalih, datangkanlah kepada kami apa yang kamu janjikan kepada kami jika kamu termasuk orang-orang yang diutus”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77 “kemudian mereka sembelih unta betina itu” dimana shaleh telah mengancam mereka dengan siksa yang pedih jika mereka berani mengganggunya. ”dan mereka berlaku angkuh terhadap perintah Rabb” yakni mereka menolaknya dengan menyombongkan diri terhadap perintah Allah, dimana barangsiapa bersikap demikian maka Allah akan menimpakan azab yang pedih padanya. ”dan mereka berkata” ditambah dengan perbuatan-perbuatan tersebut yang menunjukan kelancangan dan keberanian menentang Allah tanpa mempedulikan apa yang mereka katakan justru mereka membanggakannya, ”hai shaleh, datangkanlah apa yang kamu ancamkan itu kepada kami\", jika(betul) kamu termasuk orang-orang yang diutus (Allah). Maka shaleh menjawab ”bersukarialah kamu sekalian dirumahmu selama tiga hari, itu adalah ajnji yang tidak dapat didustakan”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 77: Unta betina memiliki hari untuk meminum air sumur, dan mereka (kaum Tsamud) pun sama memiliki hari untuk mengambil air sumur, kemudian lama-kelamaan mereka pun bosan, dan menyembelih unta tersebut. Ada yang mengatakan, bahwa yang menyembelihnya adalah Qudar bin Salif atas perintah mereka. Nabi Saleh ‘alaihis salam berkata, “Bersukarialah kamu semua di rumahmu selama tiga hari. Itu adalah janji yang tidak dapat didustakan.” (lihat Huud: 65) Faedah: Syaikh As Sa’diy berkata, “Perlu diketahui, bahwa kebanyakan mufassir menerangkan kisah ini, yakni bahwa unta betina itu keluar dari batu keras yang licin yang sebelumnya mereka usulkan kepada Saleh. Unta tersebut sudah mengandung dan hampir melahirkan, lalu unta itu keluar sedangkan kaumnya melihat langsung. Unta itu sudah melahirkan anaknya ketika mereka menyembelihnya, dan bersuara tiga kali suara, lalu bukit terbelah dan anak unta tersebut masuk ke dalamnya. Nabi Saleh berkata kepada mereka, “Tanda turunnya azab kepada kamu adalah pada hari pertama dari ketiga hari itu adalah mukamu menjadi kuning, hari kedua mukamu merah, dan hari ketiga mukamu hitam.” Lalu terjadilah seperti itu. Semua ini merupakan kisah Isra’iliyyat yang tidak layak dinukil dalam menafsirkan kitab Allah, dan dalam Al Qur’an tidak ada sesuatu yang menunjukkan demikian dari berbagai sisi. Bahkan jika hal itu benar, tentu Allah akan menyebutkannya, karena di dalamnya terdapat keajaiban, pelajaran dan tanda yang tidak mungkin dibiarkan Allah Ta’ala sehingga tidak disebutkan sampai datang dari jalan orang yang tidak ditsiqahkan penukilannya, bahkan Al Qur’an mendustakan sebagiannya, karena Nabi Saleh berkata kepada mereka, “Bersuka rialah di rumah kamu selama tiga hari.” Yakni nikmatilah dan bersenang-senanglah dalam waktu yang singkat ini, karena kamu tidak dapat bersenang-senang dan bersuka ria selain ini. Lantas di manakah kesenangannya bagi mereka yang diancamkan Nabi shallallahu 'alaihi wa sallam akan ditimpakan azab dan menyebutkan pendahulunya, di mana hari demi hari akan terjadi sesuatu yang menimpa mereka secara merata (merahnya muka, kuning dan hitam karena azab), bukankah hal ini bertentangan dengan Al Qur’an dan menyalahinya?!! Dalam Al Qur’an sudah ada kecukupan dan hidayah tidak perlu yang lainnya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 77",
    "description": "Setelah pemuka masyarakat itu menyatakan pengingkaran dengan ucapan dan sikap, mereka juga membuktikan keingkaran itu dengan perbuatan. Kemudian mereka sembelih dan potong kaki unta betina yang menjadi bukti kebenaran nabi saleh itu, dan mereka juga berlaku angkuh terhadap perintah tuhannya dengan mengabaikan tuntunan Allah yang melarang mereka untuk menyakiti unta-Nya. Dan mereka berkata, wahai saleh! buktikanlah ancaman yang kamu janjikan kepada kami, bahwa kalau kami menyakiti unta dan menyembelihnya maka kami akan disiksa. Datangkanlah siksaan itu sekarang juga jika benar engkau salah seorang rasul yang diutus oleh Allah untuk menyampaikan ancaman-Nya. Karena kesombongan dan perbuatan mereka yang melampaui batas itu, lalu datanglah gempa dan petir yang dahsyat menimpa mereka dan menghancurkan bangunan-bangunan yang ada di sekitarnya, dan mereka pun mati binasa, mayat-mayat mereka bergelimpangan di dalam reruntuhan puing-puing rumah mereka."
  }
]