[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka menimpa kepada orang-orang kafir berupa gempa dahsyat yang merenggut hati , lalu mereka menjadi manusia-manusia yang binasa di negeri mereka, tertelungkup dengan lutut-lutut dan wajah-wajah yang menyusur tanah. Tidak ada seorangpun dari mereka yang dapat lolos."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Kemudian orang-orang kafir itu ditimpa azab yang mereka minta itu. Mereka dilanda gempa bumi yang sangat dahsyat. Mereka semua tewas dengan muka dan lutut menghunjam ke tanah. Tidak ada satu pun dari mereka yang selamat dari bencana tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Maka datanglah kepada mereka suara yang sangat keras setelah tiga hari berlalu, suara itu menyebabkan gempa bumi yang dahsyat sehingga membinasakan mereka, mereka menjadi bangkai-bangkai yang bergeletakan di tempat tinggal mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. فَأَخَذَتْهُمُ الرَّجْفَةُ (Karena itu mereka ditimpa gempa) Yakni gampa bumi. Pendapat lain mengatakan: yakni ditimpa dentuman keras yang membuat jantung mereka copot. فَأَصْبَحُوا۟ فِى دَارِهِمْ (maka jadilah mereka di tempat tinggal mereka) Yakni di negeri mereka. جٰثِمِينَ (mayat-mayat yang bergelimpangan) Yakni tergeletak, lutut dan wajah mereka menempel ke tanah seperti burung yang mati, mereka mati dan tak bergerak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman : { فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ } \"Karena itu mereka ditimpa gempa, maka jadilah mereka mayat-mayat yang bergelimpangan di tempat tinggal mereka\" dan Allah berfirman : { وَأَخَذَ الَّذِينَ ظَلَمُوا الصَّيْحَةُ فَأَصْبَحُوا فِي دِيَارِهِمْ جَاثِمِينَ } \"Dan satu suara keras yang mengguntur menimpa orang-orang yang zalim itu, lalu mereka mati bergelimpangan di rumahnya,\" [ Hud : 67 ], Ayat pertama dikatakan di dalamnya \"الرَجْفَةُ\" yang berarti : gempa yang dahsyat, kemudian dikatakan setelahnya kata \"الدَرُ\" dalam bentuk tunggal { فِي دَارِهِمْ }, dan pada ayat kedua dikatakan \"الصَيْحَةُ\" yang berarti : suara yang amat dahsyat, namun pada kata selanjutkan dikatakan { فِي دِيَارِهِمْ } dengan bentuk jamak; hal itu dikarenakan \"الصيحة\" lebih menyebar luas dampaknya ketimbang dapak yang dihasilkan oleh \"الرجْفَةُ\" yang hanya mencakup sebagian kecil dari bumi; oleh karena itu kata yang datang dengan bentuk tunggal disandingkan dengan \"الرجفة\" dan kata yang datang dalam bentuk jamak disandingkan dengan \"الصيحة\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Lalu mereka ditimpa guncangan yang dahsyat, sehingga mereka terlempar-lempar sebagai mayat tak bergerak di negeri dan tempat tinggal mereka sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka ditimpa gempa} goncangan yang dahsyat {sehingga mereka mati bergelimpangan di dalam tempat tinggal mereka} mati bergelimpangan dengan lutut dan wajah mereka menempel di tanah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78 “karena itu mereka ditimpa gempa, maka jadilah mereka mayat-mayat yang bergelimpangan di tempat tinggal mereka” dalam keadaan berlutut Allah membinasakan dan menupas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 78: Dan suara keras dari langit. Di atas lutut mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 78",
    "description": "Karena kesombongan dan perbuatan mereka yang melampaui batas itu, lalu datanglah gempa dan petir yang dahsyat menimpa mereka dan menghancurkan bangunan-bangunan yang ada di sekitarnya, dan mereka pun mati binasa, mayat-mayat mereka bergelimpangan di dalam reruntuhan puing-puing rumah mereka. Setelah melihat kebinasaan yang menimpa kaumnya akibat disambar petir dan gempa, kemudian dia, nabi saleh, pergi dengan berat hati, sedih dan rasa haru meninggalkan mereka yang sudah mati sambil berkata dengan penuh penyesalan dan rasa iba, wahai kaumku! sungguh, aku telah menyampaikan amanat tuhanku berupa pesan dan peringatan-Nya, kepadamu dan aku telah cukup menasihati kamu dengan melarangmu melakukan perbuatan yang akan membawa bencana bagimu. Tetapi kamu tidak menghiraukan seruanku, bahkan tidak menyukai orang yang memberi nasihat, siapa pun dia. Seruan nabi saleh ini menunjukkan cintanya yang sa-ngat besar kepada kaumnya."
  }
]