[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka shaleh meninggalkan kaumnya, ketika mereka menyembelih unta betina itu dan siksaan menimpa mereka, dan dia berkata kepada mereka, ”Wahai kaumku, sungguh aku telah sampaikan kepada kalian apa yang aku diperintahkan untuk menyampaikannya yang berupa perintah dan laranganNya, dan aku sudah mengerahkan segala usahaku untuk mengajak, memperingatkan dan menasihati kalian. Akan tetapi, kalian tidak menyukai orang-orang yang memberi nasihat. Kalian tolak ucapan orang-orang yang memberi nasihat dan justru kalian menaati setan yang terlaknat. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Lalu Ṣāleḥ -‘Alaihissalām- meninggalkan kaumnya setelah ia merasa bahwa mereka tidak akan mengikuti seruannya. Dan ia pun berkata kepada mereka, “Wahai kaumku! Aku telah menyampaikan kepada kalian apa yang harus kusampaikan kepada kalian. Aku juga telah menasihati kalian agar kalian berbuat baik dan meninggalkan keburukan. Akan tetapi kalian adalah kaum yang tidak menyukai orang-orang yang memberi nasihat yang benar-benar ingin menunjukkan kalian kepada kebaikan dan menjauhkan kalian dari keburukan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Maka Shalih berpaling dari mereka setelah mereka binasa dan setelah melihat apa yang telah menimpa mereka. Dia berkata kepada mereka sebagai bentuk kesedihan dan nasehat bagi orang lain: “Demi Allah, aku telah menyampaikan kepada kalian perintah dari Tuhanku dan aku telah berusaha menasehati kalian; namun kalian selalu membenci orang yang menasehati kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. فَتَوَلَّىٰ عَنْهُمْ (Maka Shaleh meninggalkan mereka) Nabi Shalih pergi dari tempat tinggal mereka, berpaling dari mereka ketika telah putus asa dari jawaban kaumnya. وَقَالَ (seraya berkata) Berkata kepada mereka perkataan ini. لَقَدْ أَبْلَغْتُكُمْ رِسَالَةَ رَبِّى وَنَصَحْتُ لَكُمْ وَلٰكِن لَّا تُحِبُّونَ النّٰصِحِينَ (Hai kaumku sesungguhnya aku telah menyampaikan kepadamu amanat Tuhanku, dan aku telah memberi nasehat kepadamu, tetapi kamu tidak menyukai orang-orang yang memberi nasehat) Nabi Shalih menjelaskan tantang dirinya bahwa dia tidak lalai dalam mengerahkan tenaganya untuk menyampaikan risalah dan nasehat. Akan tetapi mereka tetap enggan menerimanya, sehingga mereka layak mendapatkan azab dan akhirnya apa yang mereka dustakan dan minta untuk disegarakan menimpa mereka. Ada kemungkinan ia mengatakan ucapan ini setelah mereka binasa, karena menyayangkan keimanan dan keselamatan dari azab yang mereka lewatkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Singkirkan dari kepalamu kebodohan orang-orang lalai, dan berhati-hatilah dari tidur yang mematikan, dan ketahulah bahwasanya siapa yang membaca al-Qur'an namun tidak jauh dari kemaksiatan dan fitnah dunia; da tidak akan aman dari golongan orang-orang yang menghina ayat-ayat Allah, dan Allah telah mengatakan bahwa pendusta itu adalah ia yang selalu benci kepada pemberi nasihat : { وَلَٰكِنْ لَا تُحِبُّونَ النَّاصِحِينَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Lalu Shalih berpaling dan meninggalkan rumah-rumah mereka usai unta itu dibunuh mereka, dan berkata: “Wahai kaumku, sungguh aku telah menyampaikan risalah Tuhanku kepada kalian. Aku juga telah berusaha menasehati dan membimbing kalian, namun kalian tidak menyukai orang yang memberi nasehat dengan ikhlas, dan mengabaikan nasehatku, maka azab itu pasti menimpa kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Shalih berpaling} Shalih berpaling {dari mereka dan berkata,“Wahai kaumku, sungguh aku telah menyampaikan kepada kalian risalah Tuhanku dan aku telah menasihati kalian, tetapi kalian tidak menyukai para pemberi nasihat.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79 “maka shaleh meninggalkan mereka”, pada waktu Allah menimpakan azab kepada mereka, ”seraya berkata” kepada mereka dalam rangka menghinakan dan mencela mereka setelah Allah membinasakan mereka, ”hai kaumku, sesungguhnya aku telah menyampaikan kepadamu amanat Rabbku, dan aku telah memberi nasihat kepadamu” yakni segala apa yang Allah mengutusku dengannya kepadamu, aku telah menyapaikannya kepadamu. Aku telah berusaha memberimu petunjuk dan akupun telah berupaya membawamu kejalan yang lurus dan agama yang benar. ”tetapi kamu tidak menyukai orang-orang yang memberi nasihat” justru kamu menolak ucapan orang-orang yang tulus memberi nasihat dan menaati semua setan yang terkutuk. Ketahuilah, bahwa banyak ahli tafsir yang menyebutkan pada kisah ini bahwa unta betina itu keluar dari batu besar yang licin atas permintaan mereka kepada shaleh, bahwa batu itu mengejang seperti wanita hamil yang mau melahirkan, lalu unta itu keluar dan mereka melihatnya. Manakala mereka menyembelihnya ia memiliki anak, lalu ia bersuara tiga kali sehingga gunung terbelah dan ia pun masuk kedalamnya. Dan shaleh berkata kepada mereka bahwa tanda turunnya azab adalah wajahmu menguning di hari pertama dari tiga hari yang dijanjikan, pada hari kedua memerah, dan pada hari ketiga menghitam, maka terjadilah seperti apa yang dikatakannya. Ini termasuk kisah-kisah israilliyat yang tidak semestinya dinukil dalam tafsir terhadap kitabbullah, padahal di dalam al-qur’an tidak ada yang menunjukan hal itu sama sekali, justru kalau ia benar pastilah Allah akan menyebutkannya, karena padanya terdapat keajaiban, pelajaran, dan tanda kebesaranNya yang tidak mungkin dilalaikan oleh Alllah dan ditinggalkan sampai ia diceritakan oleh orang yang penukilannya tidak dipercaya. Bahkan al-qur’an mendustakan sebagian yang disebutkan, karena shaleh berkata kepada mereka ” bersuakarialah kamu sekalian di rumahmu selama tiga hari” Yakni bersenang-senaglah dalam waktu yang sangat pendek ini, karena kamu tidak memiliki kenikmatan dan kesenangan kecuali ini. Kenikmatan dan kesukaan apa bagi orang yang diancam oleh Nabi mereka dengan azab dan nabi itu menyebutkan kejadian-kejadian yang menjadi pendahuluan azab tersebut, lalu ia terjadi hari demi hari dalam bentuk yang meliputi dan mencakup mereka, karena memerahnya wajah mereka, menguning dan menghitamnya termasuk azab? Bukankah ini bertentangan dengan alquran dan bertabrakan dengannya? Al-qur’an sudah cukup dan ia sebagai petunjuk dari selainnya, Benar, jika sesuatu darinya ditetapkan secara shahih dari Rasulullah saw yang tidak bertentangan dengan al-qur’an maka wajib diterima dan ia termasuk yang harus diikuti menurut al-qur’an. ”Apa yang diberikan rasul kepadamu maka terimalah dia, Dan apa yang dilarangnya bagimu maka tinggalkanlah” Dan telah dijelaskan bahwa tidak boleh menafsirkan kitabbullah dengan berita-berita isra’iliyat. Walaupun ada pendapat yang membolehkan meriwayatkan dari mereka dalam perkara-perkara yang tidak dibenarkan dan juga tidak didustakan, jadi keduanya tidak mungkin dipertemukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 79",
    "description": "Setelah melihat kebinasaan yang menimpa kaumnya akibat disambar petir dan gempa, kemudian dia, nabi saleh, pergi dengan berat hati, sedih dan rasa haru meninggalkan mereka yang sudah mati sambil berkata dengan penuh penyesalan dan rasa iba, wahai kaumku! sungguh, aku telah menyampaikan amanat tuhanku berupa pesan dan peringatan-Nya, kepadamu dan aku telah cukup menasihati kamu dengan melarangmu melakukan perbuatan yang akan membawa bencana bagimu. Tetapi kamu tidak menghiraukan seruanku, bahkan tidak menyukai orang yang memberi nasihat, siapa pun dia. Seruan nabi saleh ini menunjukkan cintanya yang sa-ngat besar kepada kaumnya. Setelah menuturkan kisah kaum samud yang binasa disambar petir akibat kedurhakaan mereka, selanjutnya Allah menyebutkan kisah yang lain, yakni nabi lut beserta kaumnya. Dan kami juga telah mengutus nabi lut. Ingatlah ketika dia berkata dengan nada keras kepada kaumnya yang ketika itu melakukan kedurhakaan besar, mengapa kamu melakukan perbuatan keji, yakni perbuatan teramat buruk, yaitu homoseksual, yang belum pernah dilakukan oleh seorang pun di zaman apa pun sebelum kamu di dunia ini' nabi lut berharap dengan ucapannya, mereka sadar dan meninggalkan perbuatan itu."
  }
]