[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan penimbangan amal-amal manusia pada hari kiamat dilakukan dengan timbangan hakiki secara adil dan lurus yang tidak ada unsur kezhaliman sama sekali di dalamnya. Barangsiapa yang berat timbangan amal perbuatannya (karena banyaknya amal kebaikannya), maka mereka adalah orang-orang yang beruntung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan timbangan amal di hari Kiamat akan dilakukan secara adil, tidak ada kecurangan maupun kezaliman. Barangsiapa yang timbangan amal baiknya lebih berat dari amal buruknya mereka akan mendapatkan apa yang mereka inginkan dan selamat dari apa yang mereka takutkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَالْوَزْنُ يَوْمَئِذٍ الْحَقُّ ۚ (Timbangan pada hari itu ialah kebenaran (keadilan)) Yakni amalan para hamba ditimbang di hari kiamat dengan timbangan sesungguhnya yang sesuai dengan keadilan yang tidak ada kezaliman didalamnya. فَمَن ثَقُلَتْ مَوٰزِينُهُۥ(maka barangsiapa berat timbangan kebaikannya) Yakni barangsiapa yang amal-amal shalihnya yang ditimbang lebih berat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dan timbangan amal pada hari kiamat itu pasti benar, detail, dan adil, dimana tidak ada kecurangan di dalamnya. Maka barangsiapa kebaikannya lebih berat daripada keburukannya, maka mereka itu adalah orang yang memenangkan keridhaan dan surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Timbangan pada hari itu benar} timbangan amal pada hari kiamat itu adil {Siapa saja yang berat timbangannya} neraca kebaikannya melebihi neraca keburukannya {mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. yakni timbangan pada hari kiamat adalah timbangan yang adil yang tidak ada unsur kesewenang-wenangan dan kezhaliman padanya, ”maka barangsiapa berat timbangan kebaikannya” dimana daun timbangan kebaikan lebih berat daripada daun timbangan keburukan “maka mereka itulah orang-orang yang beruntung” yakni orang-orang yang selamat dari apa yang dibenci, dan meraih apa yang diharapkan. Orang-orang yang mendapatkan keuntungan besar dan kebahagiaan yang terus-menerus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 8: Timbangan ini sebagaimana dalam hadits memiliki dua daun timbangan. Penimbangan dilakukan dengan adil. Selamat dari yang tidak diinginkan, dan memperoleh apa yang diinginkan, memperoleh keberuntungan yang besar dan kebahagiaan yang kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 8",
    "description": "Timbangan yang tidak kita ketahui secara hakiki bagaimana bentuk dan sifatnya, pada hari itu menjadi ukuran kebenaran. Ihwal timbangan ini merupakan perkara gaib; kita wajib mengimaninya dan hanya Allah yang tahu hakikatnya. Maka barang siapa berat timbangan kebaikan-Nya karena banyak melakukan kebaikan, mereka itulah orang yang beruntung. Mereka akan masuk surga dengan segala kenikmatan yang ada di dalamnya. Dan barang siapa ringan timbangan kebaikan-Nya karena banyak melakukan dosa, maka mereka itulah orang yang telah merugikan dirinya sendiri, karena mereka mengingkari ayat-ayat kami. Padahal, ayat-ayat tersebut telah jelas mengemukakan kebenaran yang sulit terbantahkan. Namun kesombongan dan sikap iri pada hati mereka menyebabkan mereka enggan menerima ayat-ayat tersebut, bahkan mendustakannya."
  }
]