[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh mu (wahai rosul) Luth , ketika dia berkata kepada kaumnya, ”apakah kalian pantas berbuat tindakan mungkar yang telah mencapai puncak kebejatannya? Yang tidak ada yang melakukannya seorangpun dari umat manusia sebelum kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Dan ingatlah Lūṭ, saat ia mengingkari kaumnya seraya berkata, “Apakah kalian melakukan perbuatan keji serta menjijikkan, yaitu homoseks? yang merupakan perbuatan baru yang kalian adakan, karena belum pernah dilakukan oleh siapa pun sebelum kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Allah mengingatkan kisah Luth -yang merupakan keponakan dari Nabi Ibrahim-, ketika dia berkata kepada kaumnya untuk mengingkari dan mengolok perbuatan keji yang mereka lakukan: “Mengapa kalian berbuat kejahatan yang sangat buruk dan keji?” yaitu dengan mendatangi sesama laki-laki dari duburnya. Kemudian dia mengolok-olok mereka dengan menyebutkan bahwa mereka adalah kaum yang pertama kali melakukan kekejian itu dari golongan jin dan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَلُوطًا (Dan Luth) Yakni Kami juga telah mengutus Nabi Luth. Nabi Luth merupakan keponakan dari Nabi Ibrahim, ia berhijrah bersama Nabi Ibrahim dari negeri Irak menuju negeri Baitul Maqdis; Allah mengutus Nabi Luth sebagai seorang Rasul ke sebuah negeri bernama Sodom dekat Baitul Maqdis. أَتَأْتُونَ الْفٰحِشَةَ (Mengapa kamu mengerjakan perbuatan keji itu) Yakni dari jenis perbuatan keji yang sangat buruk berupa kawin sesama jenis. مَا سَبَقَكُم بِهَا مِنْ أَحَدٍ مِّنَ الْعٰلَمِينَ(yang belum pernah dikerjakan oleh seorangpun (di dunia ini) sebelummu?) Yakni belum dilakukan seorangpun sebelum kalian, karena kawin sesama jenis belum ada pada umat-umat sebelum mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Dan Kami telah mengutus Luth. Dia adalah keponakan Ibrahim. Ingatlah wahai Nabi (Muhammad) ketika Luth berkata kepada kaumnya dengan memberikan teguran: “Apakah kalian akan terus melakukan perbuatan yang sangat keji, yaitu homo seksual, yang belum pernah dilakukan oleh satupun orang di setiap zaman sebelum kalian, bahkan di zaman yang paling jauh dari kalian belum ada umat yang melakukannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Luth, ketika dia berkata kepada kaumnya,“Apakah kalian melakukan perbuatan keji} perbuatan yang dilarang karena keburukannya, yaitu homoseksual {yang belum pernah dikerjakan oleh seorang pun sebelum kalian di alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80 “dan kami juga telah mengutus luth” kepada kaumnya untuk memerintahkan mereka gar beribadah hanya kepada Allah semata, dan melarang mereka dari perbuatan keji yang tidak pernah dilakukan oleh seseorangpun di dunia sebelum mereka. Luth berkata ”mengapa kamu mengerjakan perbuatan keji itu?” yakni perbuatan yang sangat keji lagi buruk yang mencapai tingkat keburukan tertinggi “yang belum pernah dikerjakan oleh seorangpun di dunia ini sebelummu?” disamping ia adalah perbatan keji yang merupakan perkara terburuk, merekalah juga yang memulai menemukannya dan mencontohkannya bagi orang-orang setelah mereka, ini juga merupakan perbuatan terburuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 80: Yang mengajak kaumnya beribadah kepada Allah saja dan melarang mereka mengerjakan perbuatan keji yang belum pernah dilakukan sebelumnya oleh seorang pun baik dari kalangan jin maupun manusia. Perbuatan faahisyah (keji) di sini adalah homoseksual (laki-laki mendatangi laki-laki di dubur mereka) sebagaimana diterangkan dalam ayat 81 berikut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 80",
    "description": "Setelah menuturkan kisah kaum samud yang binasa disambar petir akibat kedurhakaan mereka, selanjutnya Allah menyebutkan kisah yang lain, yakni nabi lut beserta kaumnya. Dan kami juga telah mengutus nabi lut. Ingatlah ketika dia berkata dengan nada keras kepada kaumnya yang ketika itu melakukan kedurhakaan besar, mengapa kamu melakukan perbuatan keji, yakni perbuatan teramat buruk, yaitu homoseksual, yang belum pernah dilakukan oleh seorang pun di zaman apa pun sebelum kamu di dunia ini' nabi lut berharap dengan ucapannya, mereka sadar dan meninggalkan perbuatan itu. Sungguh, kamu benar-benar telah melampiaskan syahwatmu kepada sesama lelaki dengan mendatangi mereka dari duburnya, bukan kepada perempuan yang seharusnya kepada merekalah kamu menyalurkan naluri seksualmu. Kamu telah melakukan perbuatan yang sangat keji dan rendah serta durhaka. Bahkan kamu benar-benar kaum yang melampaui batas karena melakukan pelampiasan syahwat bukan pada tempatnya, menyimpang dari fitrah manusia."
  }
]