[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kalian mendatangi para pria melalui dubur mereka lantaran ketertarikan kalian terhadap hal tersebut, tanpa mempedulikan sisi kebejatannya, meninggalkan apa yang Allah halalkan bagi kalian untuk menggauli kaum wanita-wanita kalian. Memang kalian itu manusia-manusia yang melampaui batas ketentuan Allah dalam tindakan berlebihan kalian itu. ”Sesungguhnya menggauli kaum pria, bukan kepada wanita, termasuk perbuatan keji yang baru pertama kali di lakukan oleh kaum luth , tidak ada seorangpun dari manusia yang mendahului mereka. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Sesungguhnya kalian mendatangi sesama laki-laki untuk melampiaskan syahwat kalian dan mengabaikan kaum wanita yang diciptakan untuk menyalurkan syahwat bersama kalian. Sungguh kalian benar-benar tidak mengikuti akal sehat, ajaran agama, maupun fitrah yang suci. Kalian telah melanggar aturan Allah karena kalian telah keluar dari kondisi normal yang ada pada diri manusia. Kalian telah menyimpang dari akal sehat dan fitrah yang mulia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Kemudian dia menjelaskan keburukan kejahatan ini dengan berkata: “Kalian mendatangi sesama laki-laki dari dubur mereka demi meluapkan hasrat setan, dan memalingkan para wanita yang telah dihalalkan Allah bagi kalian. Dan kalian terus-menerus melanggar hukum-hukum Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. إِنَّكُمْ لَتَأْتُونَ الرِّجَالَ شَهْوَةً (Sesungguhnya kamu mendatangi lelaki untuk melepaskan nafsumu) Yakni tidak ada tujuan lain dari kalain kecuali hanya untuk melampiaskan hawa nafsu kalian, tanpa ada tujuan dalam melakukan itu untuk tujuan yang dapat diterima oleh akal dan fitrah yang sehat, sehingga dalam hal ini mereka seperti binatang yang mendatangi sesamanya untuk memuaskan syahwatnya. مِّن دُونِ النِّسَآءِ ۚ( bukan kepada wanita) Yakkni dan kalian meninggalkan istri-istri yang diciptakan Allah bagi kalian, dan mereka sesuai bagi fitrah kalian dan mereka adalah tempat untuk melepaskan syahwat (yang benar) serta tempat untuk mendapatkan kenikmatan. بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ(malah kamu ini adalah kaum yang melampaui batas) Ini merupakan pemberitahuan bagi mereka bahwa perbuatan yang keluar dari fitrah yang sehat ini disebabkan karena mereka telah melampaui batas kenormalan manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Sesungguhnya kalian mendatangi para lelaki hanya untuk melampiaskan syahwat, hal itu tidak sesuai dengan akal sehat, Kalian mengabaikan para wanita yang memang itu tempat kalian melampiaskan syahwat yang sesuatu dengan fitrahnya, namun kalian adalah kaum yang melampaui batas dalam berbuat maksiat dan keluar dari batas normal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kalian benar-benar mendatangi laki-laki untuk melampiaskan syahwat, bukan perempuan, bahkan kalian adalah kaum yang melampaui batas.”} melampaui batas-batas ketentuan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81 kemudian luth menjelaskannya dengan ucapannya, ”sesungguhnya kamu mendatangi lelaki untuk melepaskan nafsumu (kepada mereka) bukan kepada wanita” yakni bagaimana kamu tidak berhasrat kepada wanita yang diciptakan oleh Allah untukmu dan padanya terdapat kenikmatan yang sesuai dengan hasrat dan fitrah, justru kamu berhasrat kepada dubur laki-laki yang sangat kotor dan menjijikan, jalan yang keluar darinya kotoran busuk yang untuk menyebutnya pun memalukan lebih-lebih menyentuh dan mendekatinya “maka kamu ini adalah kaum yang melampaui batas” yakni kamu adalah orang yang melanggar batasan Allah dan berani menentang perkara-perkara yang dilarangNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 81: Dari yang halal kepada yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 81",
    "description": "Sungguh, kamu benar-benar telah melampiaskan syahwatmu kepada sesama lelaki dengan mendatangi mereka dari duburnya, bukan kepada perempuan yang seharusnya kepada merekalah kamu menyalurkan naluri seksualmu. Kamu telah melakukan perbuatan yang sangat keji dan rendah serta durhaka. Bahkan kamu benar-benar kaum yang melampaui batas karena melakukan pelampiasan syahwat bukan pada tempatnya, menyimpang dari fitrah manusia. Teguran keras nabi lut ini tidak digubris sama sekali oleh kaumnya. Bahkan, mereka menyuruh nabi lut dan pengikutnya keluar dari negeri mereka. Dan jawaban kaumnya, yakni tanggapan mereka terhadap nasihat nabi lut, tidak lain hanya berkata kepada sesama orang yang durhaka, usirlah mereka, lut dan pengikutnya, dari negerimu ini, sesungguhnya mereka adalah orang lemah yang terus menerus menganggap dirinya suci sehingga tidak patut berkumpul dengan orang-orang yang dianggap kotor dan rusak akhlaknya."
  }
]