[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada jawaban kaum Luth ketika Luth mengingkari perbuatan tidak senonoh mereka itu, kecuali sebagian dari mereka berkata kepada sebagian yang lain, ”usirlah Luth dan keluarganya dari daerah kalian. Sungguh dia dan orang-orang yang mengikuti dirinya menyucikan diri dari menggauli dubur-dubur laki-laki. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Jawaban kaumnya yang melakukan perbuatan keji (homoseks) itu terhadap teguran yang diberikan kepada mereka tiada lain selain berpaling dari kebenaran sembari berkata, “Usirlah Lūṭ beserta keluarganya dari desa kalian. Sesungguhnya mereka adalah manusia-manusia yang menghindari perbuatan kita ini. Jadi, mereka tidak layak berada di tengah-tengah kita.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Namun mereka tetap melakukan kejahatan mereka yang keji, dan membantah nabi mereka dengan penuh penghinaan: “Keluarkanlah Luth dan para pengikutnya yang beriman dari negeri ini; sungguh mereka adalah orang-orang yang merasa suci dari apa yang kita lakukan!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَمَا كَانَ جَوَابَ قَوْمِهِۦٓ (Jawab kaumnya) Yakni jawaban kaum yang terjerumus dalam perbuatan keji ini atas pengingkaran nabi Luth kepada mereka. إِلَّآ أَن قَالُوٓا۟ أَخْرِجُوهُم(tidak lain hanya mengatakan: “Usirlah mereka) Yakni usirlah Luth dan para pengikutnya. مِّن قَرْيَتِكُمْ ۖ (dari kotamu ini) Padahal kewajiban atas kaum Luth adalah membenarkan kenabiannya dan mematuhi perintahnya serta menerima seruannya, namun mereka menjawabnya dengan jawaban ini yang berasal dari jiwa buruk mereka dan fitrah rusak mereka. إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ (sesungguhnya mereka adalah orang-orang yang berpura-pura mensucikan diri) Yakni yang enggan untuk ikut terjerumus kedalam perbuatan ini, maka mereka tidak boleh tinggal bersama kami di negeri ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Ketika ditegur atas keingkaran yang besar ini, tidaklah jawaban kaumnya itu kecuali sebagian mereka berkata kepada yang lainnya: “Usir saja Luth dan pengikutnya yang mukmin dari negeri kalian (Sodom, yaitu kotanya kaum Luth yang terletak di sebelah timur Jordania yang letaknya sangat jauh) Sesungguhnya mereka adalah orang-orang yang sok suci dengan perbuatan kita, maka sebaiknya mereka tidak bersama kita” Mereka berkata seperti itu untuk mengolok-olok dan mengejek"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada jawaban kaumnya selain berkata,“Usirlah mereka dari negeri kalian. Sesungguhnya mereka adalah orang-orang yang menganggap dirinya suci.”} suci dari homoseksual"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82 “jawab kaum nya tidak lain hanya mengatakan, ’usirlah mereka luth dan pengikut-pengikutnya dari kotamu ini , sesungguhnya mereka adalah orang-orang yang berpura-pura menyucikan diri” yakni sok suci (pura-pura menjauhkan diri) dari perbuatan keji “dan mereka tidak menyiksa orang-orang mukmin itu melainkan orang-orang mukmin itu beriman kepada Alllah yang Maha kuasa lagi maha terpuji"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 82",
    "description": "Teguran keras nabi lut ini tidak digubris sama sekali oleh kaumnya. Bahkan, mereka menyuruh nabi lut dan pengikutnya keluar dari negeri mereka. Dan jawaban kaumnya, yakni tanggapan mereka terhadap nasihat nabi lut, tidak lain hanya berkata kepada sesama orang yang durhaka, usirlah mereka, lut dan pengikutnya, dari negerimu ini, sesungguhnya mereka adalah orang lemah yang terus menerus menganggap dirinya suci sehingga tidak patut berkumpul dengan orang-orang yang dianggap kotor dan rusak akhlaknya. Karena kedurhakaan kaum nabi lut yang terus meningkat, Allah menjatuhkan siksa-Nya. Namun sebelum siksaan tersebut diturunkan, terlebih dahulu Allah menyelamatkan nabi lut dan pengikutnya. Kemudian kami selamatkan dia, yakni nabi lut, keluarga, dan pengikutnya yang beriman, kecuali istrinya karena tidak beriman dan tidak mau keluar dari negeri tersebut bersama nabi lut dan pengikutnya. Dia, istri nabi lut itu, termasuk orang-orang yang tertinggal dan dibinasakan bersama kaum nabi lut yang ingkar. Sebelum azab diturunkan, Allah memerintahkan nabi lut dan pengikutnya yang beriman agar meninggalkan negerinya. Kisah ini dapat pula dilihat pada surah hud/11: 8."
  }
]