[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami menyelamatkan Luth dan keluarganya dari siksaan, yaitu dengan memerintahkannya untuk meninggalakan kota tersebut, kecuali istrinya. Sesungguhnya wanita itu termasuk manusia yang binasa dan tinggal dalam deraan siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Kemudian Kami menyelamatkannya (Lūṭ) beserta keluarganya dengan menyuruh mereka keluar di malam hari dari desa yang akan ditimpa azab itu, kecuali istrinya yang memilih tinggal bersama kaumnya. Maka ia pun terkena azab yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83-84. Dan ketika Kami memutuskan akan menghukum mereka dengan azab yang buruk, maka -dengan keagungan dan kekuasaan Kami yang sempurna- Kami selamatkan Luth dan keluarganya dari azab tersebut, kecuali istrinya yang tetap tinggal bersama kaumnya di tempat turunnya azab, karena dia termasuk orang kafir. Kami menimpakan mereka hujan batu yang sangat lebat; maka lihatlah bagaimana kesudahan orang-orang yang berbuat dosa?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَأَنجَيْنٰهُ وَأَهْلَهُۥٓ (Kemudian Kami selamatkan dia dan pengikut-pengikutnya) Allah menyelamatkan Nabi Luth dan para pengikutnya dengan mengeluarkan mereka di malam terjadinya azab yang menimpa negeri tersebut di pagi hari. Kisah ini dijelaskan lebih terperinci pada surat huud: 77-83. Allah tidak mengecualikan istri Nabi Luth dari golongan keluarganya karena ia tidak beriman kepada Nabi Luth. كَانَتْ مِنَ الْغٰبِرِينَ (dia termasuk orang-orang yang tertinggal (dibinasakan)) Yakni termasuk orang-orang yang mendapat azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Lalu Kami selamatkan Luth dan keluarganya serta orang-orang mukmin, kecuali istrinya yang ingkar. Dia (istri luth) termasuk kelompok orang-orang yang dibinasakan bersama kaumnya di tempat turunnya azab itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Kami selamatkan dia dan pengikutnya, kecuali istrinya. Dia termasuk orang-orang yang tertinggal} orang-orang yang dihancurkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83 “kemudian kami selamatkan dia dan pengikut-pengikutnya kecuali istinya, dia termasuk orang-orang yang tertinggal (dibinasakan)” yakni yang tertinggal dan ditimpa azab. Allah memerintahkan luth agar menyingkir di waktu malam karena azab akan turun di pagi hari, maka luth membawa keluarganya kecuali istrinya ia tertimpa apa yang menimpa kaumnya"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 83: Allah memerintahkan Luth beserta pengikutnya pergi di malam hari meninggalkan negeri Sodom tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 83",
    "description": "Karena kedurhakaan kaum nabi lut yang terus meningkat, Allah menjatuhkan siksa-Nya. Namun sebelum siksaan tersebut diturunkan, terlebih dahulu Allah menyelamatkan nabi lut dan pengikutnya. Kemudian kami selamatkan dia, yakni nabi lut, keluarga, dan pengikutnya yang beriman, kecuali istrinya karena tidak beriman dan tidak mau keluar dari negeri tersebut bersama nabi lut dan pengikutnya. Dia, istri nabi lut itu, termasuk orang-orang yang tertinggal dan dibinasakan bersama kaum nabi lut yang ingkar. Sebelum azab diturunkan, Allah memerintahkan nabi lut dan pengikutnya yang beriman agar meninggalkan negerinya. Kisah ini dapat pula dilihat pada surah hud/11: 8 setelah menyelamatkan nabi lut dan pengikutnya, Allah menurunkan siksaan dan azab-Nya kepada kaum yang ingkar. Dan kami hujani, yakni kami turunkan dari langit sehingga mengenai bagian atas mereka, dengan hujan batu yang membinasakan mereka dan meluluhlantakkan negeri mereka. Maka perhatikanlah wahai orang yang mengambil pelajaran dari kisah ini bagaimana kesudahan dan akibat yang diterima orang yang berbuat dosa itu. Mereka hanya memperoleh kebinasaan dan azab lantaran perbuatan mereka."
  }
]