[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kami telah mengutus kepada kaum Madyan saudara mereka, Su’aib . Dia berkata kepada mereka, ”Wahai kaumku, beribadahlah kepada Allah semata, Dia tidak memiliki sekutu apapun. Kalain tidak memiliki sesembahan yang berhak diibadahi selainNya. Maka ikhlaskanlah kepadaNya dalam beribadah. Sungguh telah datang kepada kalian bukti yang nyata dari tuhan kalian tentang kebenaran dakwah yang aku serukan kepada kalian. Maka sempurnakanlah hak-hak orang lain dengan memenuhi takaran dan timbangan. Janganlah kalian mengurangi hak-hak mereka, sehingga akibatnya kalian berbuat zhalim kepada mereka. Dan janganlah kalian berbuat kerusakan di muka bumi, (dengan tindakan kekafiran dan kezhaliman), setelah diperbaiki dengan syari’at-syari’at para nabi sebelumnya. Apa yang aku dakwahkan kepada kalian merupakan kebaikan bagi kalian di dunia dan akhirat kalian, jika kalian mau membenarkan apa yang aku serukan kepada kalian, lagi mengamalkan syariat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Dan kepada suku Madyan Kami telah mengutus saudara mereka, Syu’aib -‘Alaihissalām-. Lalu ia berkata kepada mereka, “Wahai kaumku! Sembahlah Allah semata. Karena kalian tidak punya tuhan lain yang berhak disembah selain Dia. Telah datang kepada kalian bukti yang nyata dari Allah dan dalil yang jelas-jelas menunjukkan bahwa ajaran yang kubawa kepada kalian benar-benar berasal dari Tuhanku. Berikanlah hak-hak manusia dengan menyempurnakan takaran dan timbangan. Dan jangan mengurangi hak-hak mereka dengan cara menjelek-jelekkan dan merendahkan barang dagangan mereka, atau menipu mereka. Dan janganlah kalian membuat kerusakan di muka bumi dengan melakukan kekafiran dan kemaksiatan setelah bumi ini diperbaiki oleh para nabi yang diutus sebelumnya. Hal tersebut akan lebih baik dan lebih bermanfaat bagi kalian jika kalian percaya. Karena hal itu berarti meninggalkan perbuatan maksiat dalam rangka menjauhi larangan Allah dan mendekatkan diri kepada Allah dengan melaksanakan perintah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Dan Kami mengutus kepada kaum Madyan saudara mereka, Syuaib. Dia berkata mereka dengan lembut: “Hai kaumku, sembahlah Allah semata, karena tidak ada Tuhan yang berhak disembah selain Dia. Telah datang kepada kalian bukti yang jelas dari Pencipta kalian yang menunjukkan kebenaran apa yang aku seru. Maka sempurnakanlah takaran dan timbangan dengan sebenar-benarnya, dan janganlah mengurangi hak-hak orang lain; dan janganlah berbuat kerusakan di bumi dengan melakukan kemaksiatan setelah Allah memperbaikinya dengan dakwah para rasul. Perintah agung yang aku dakwahkan kepada kalian ini, lebih baik bagi kalian di dunia dan di akhirat jika kalian mengimani keesaan Allah dan kebenaran risalahku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۗ (Dan pada penduduk Mad-yan saudara mereka, Syu’aib) Yakni dan Kami telah mengutus kepada Madyan yang merupakan sebuah kabilah dari keturunan Nabi Ibrahim dengan seorang rasul dari golongan mereka yaitu nabi Syu’aib. قَالَ يٰقَوْمِ اعْبُدُوا۟ اللهَ مَا لَكُم مِّنْ إِلٰهٍ غَيْرُهُۥ ۖ( Ia berkata: “Hai kaumku, sembahlah Allah, sekali-kali tidak ada Tuhan bagimu selain-Nya) Nabi Syu’aib menyeru kaumnya kepada Allah, ia menyebutkan bahwa mereka adalah kaumnya dan dirinya adalah salah satu dari mereka, ia memerintahkan mereka agar mentauhidkan Allah dan mengesakan-Nya dalam ibadah, dan ini merupakan pokok dari dakwah para rasul, ia juga mengingkari apa yang mereka jadikan sesembahan adalah tuhan yang benar, namun itu merupakan tuhan yang bathil dan akan sirna. فَأَوْفُوا۟ الْكَيْلَ وَالْمِيزَانَ (Maka sempurnakanlah takaran dan timbangan) Yakni janganlah kalian mengurangi hak penjual atau pembeli dengan memakai takaran atau timbangan yang kurang atau lebih dari yang seharusnya, atau dengan cara-cara lainnya. وَلَا تَبْخَسُوا۟ النَّاسَ أَشْيَآءَهُمْ(dan janganlah kamu kurangkan bagi manusia barang-barang takaran dan timbangannya) Makna (البخس) yakni pengurangan. Yaitu dengan memberi cacat pada barang dagangan, atau dengan mengurangi kualitasnya, atau dengan menipu pembelinya. Dan ini semua termasuk perbuatan memakan harta orang lain dengan cara yang bathil. Pendapat lain mengatakan mereka dahulu adalah orang-orang yang mengambil jatah dari para penjual yang masuk kedalam pasar mereka. وَلَا تُفْسِدُوا۟ فِى الْأَرْضِ بَعْدَ إِصْلٰحِهَا ۚ( dan janganlah kamu membuat kerusakan di muka bumi sesudah Tuhan memperbaikinya) Tafsir dari potongan ayat ini telah disebutkan dalam ayat 56 pada surat ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ } \"dan janganlah kamu kurangkan bagi manusia barang-barang takaran dan timbangannya\" yakni : janganlah kalian mengurangi hak-hak mereka, dan adapun ayat ini megatakan : { أَشْيَاءَهُمْ } adallah untuk penyamarataan; sebagai peringatan bahwasanya mereka dahulu mengurangi timbangan sesuatu yang dihormati dan diremehkan, dan sesuatu yang sedikit maupun yang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Dan Kami telah mengutus untuk suku Madyan dari keturunan Ibrahim (negeri mereka itu terletak di antara bukit Sinai dan Al-Furat) seorang rasul dari golongan mereka, yaitu Syu’aib AS. Dia berkata kepada mereka: “Wahai kaumku, menyembahlah hanya kepada Allah, Dialah yang sebenarnya harus disembah. Inilah inti dari dakwah para rasul. Sungguh telah datang kepada kalian hujjah yang terang dari Tuhan kalian yang menunjukkan atas kebenaran risalahku. Maka sempurnakanlah timbangan saat kalian berniaga, dan jangan sampai penjual dan pembeli mengurangi hak-hak orang lain, dengan menjelek-jelekkan atau melebih-lebihkan suatu barang atau mengelabui pembelinya. Semua itu adalah tindakan memakan harta manusia dengan cara bathil. Dan janganlah kalian berbuat kerusakan di bumi dengan berbuat kufur dan bermaksiat setelah para penghuninya telah diperbaiki melalui para nabi dan rasul. Yang aku perintahkan kepada kalian itu lebih baik dan utama di sisi Allah daripada yang kalian lakukan berupa kekufuran dan kezaliman jika kalian mempercayai risalahku, keesaan Allah dan syariatNya, karena iman itu memerlukan tindakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Kepada penduduk Madyan, saudara mereka, Syuʻaib. Dia berkata,“Wahai kaumku, sembahlah Allah. Tidak ada tuhan bagi kalian selain Dia. Sungguh telah datang kepada kalian bukti yang nyata dari Tuhan kalian. Maka sempurnakanlah} sempurnakanlah {takaran dan timbangan, dan janganlah merugikan} mengurangi {sesuatu milik orang lain. Dan janganlah berbuat kerusakan di bumi setelah perbaikannya. Demikian itu lebih baik bagi kalian, jika kalian beriman.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85 dan kami tidak mengutus kepada kabilah yang terkenal di madyan, ”saudara mereka” dari nasab “syuaib” yang mengajak mereka untuk beribadah hanya kepada Allah semata, tiada sekutu bagiNya. Memerintahkan mereka agar memenuhi timbangan dan takaran, agar mereka tidak mengurangi hak-hak manusia, dan agar mereka jangan berbuat kerusakan di muka bumi dengan memperbanyak kemasiatan padanya. Oleh karena itu dia berkata ”dan janganlah kamu membuat kerusakan di muka bumi sesudah Allah memperbaikinya. Yang demikian itu lebih baik bagimu jika kamu memang benar orang-orang yang beriman” karena meninggalkan kemaksiatan demi menjalankan perintah Allah dan mendekatkan diri kepadaNya adalah lebih baik dan lebih berguna bagi seorang hamba daripada melakukannya yang mana ia menyebabkan murkaan dari Allah dan azab neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 85: Madyan adalah nama putera Nabi Ibrahim ‘alaihis salam kemudian menjadi nama kabilah yang terdiri dari anak cucu Madyan itu. Kabilah ini tinggal di suatu tempat yang juga dinamai Madyan yang terletak di pantai laut merah di tenggara gunung Sinai. Atas kebenaranku. Dengan melakukan banyak kekufuran dan kemaksiatan. Dengan diutus-Nya para rasul. Karena meninggalkan kekufuran dan kemaksiatan mengikuti perintah Allah dan mendekatkan diri kepada-Nya lebih baik dan lebih bermanfaat bagi hamba karena akan membahagiakannya dan memasukkannya ke surga daripada mengerjakan perbuatan yang mendatangkan kemurkaan Allah dan membawa kepada kesengsaraan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 85",
    "description": "Setelah dijelaskan kisah kedurhakaan kaum nabi lut, kerusakan akhlak mereka karena melakukan perbuatan homoseksual, dan azab yang mereka terima, selanjutnya pembicaraan beralih kepada kisah nabi syuaib dan kaumnya. Dan kepada penduduk negeri dan suku madyan, kami utus nabi syuaib, saudara mereka sendiri yang terkenal sebagai orator para nabi. Dia berkata, wahai kaumku! sembahlah Allah tuhan yang maha esa. Tidak ada tuhan sembahan yang patut disembah bagimu selain dia. Sesungguhnya telah datang kepadamu bukti yang nyata, yang membuktikan kebenaranku sebagai utusan-Nya. Bukti itu dari tuhan yang senantiasa memilihara-Mu. Maka, karena itu patuhilah tuntunan yang aku sampaikan kepadamu. Sempurnakanlah takaran dan yang ditakar dan timbangan serta yang ditimbang, dan jangan kamu merugikan orang sedikit pun dengan mengurangi takaran dan timbangan. Janganlah kamu berbuat kerusakan di bumi dalam bentuk apa pun setelah diciptakan dengan baik. Itulah yang lebih baik bagimu dan anak keturunan serta generasi sesudahmu jika kamu benar-benar orang beriman kepada Allah dan hari akhir. Dan di samping jangan merusak di muka bumi, janganlah juga kamu duduk sengaja memotong di setiap jalan menuju nabi syuaib, dengan maksud menakut-nakuti orang-orang yang melewatinya dengan ancaman pembunuhan dan terus-menerus menghalang-halangi orangorang yang beriman dari jalan Allah dan ingin membelokkannya dari jalan yang lurus dengan mencari-cari dalih atau kelemahannya untuk menanamkan keraguan terhadap Allah. Ingatlah masa lalumu ketika kamu dahulunya berjumlah sedikit, lalu Allah memperbanyak jumlah kamu dengan mengembangbiakkan keturunanmu dan memberi rezeki yang banyak. Dan perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan dari umat dan suku sebelummu, seperti kaum 'ad dan samud, sebagai pelajaran agar kamu tidak mengalami nasib serupa."
  }
]