[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian duduk di tiap-tiap jalan untuk mengintimidasi manusia dengan ancaman bunuh, bila mereka tidak menyerahkan harta benda mereka kepada kalian, dan untuk menghalang-halangi dari jalan Allah yang lurus orang-orang yang beriman kepada Allah dan beramal shalih, serta kalian berharap jalan Allah menjadi bengkok, menyimpangkannya untuk disesuaikan dengan keinginan hawa nafsu kalian, dan menjauhkan manusia untuk mengikuti jalan Allah. Dan ingatlah oleh kalian nikmat-nikmat Allah yang tercurah kepada kalian, tatkala jumlah kalian sedikit, kemudian Allah memperbanyak jumlah kalian. Maka kalainpun menjadi manusia-manusia kuat lagi kokoh. Coba perhatikan bagaimana nasib-nasib orang-orang yang melakukan kerusakan di muka bumi berserta kebinasaan dan kehancuran yang menimpa mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Janganlah kalian duduk di setiap jalan seraya mengancam setiap orang yang melaluinya untuk merampas harta bendanya. Dan janganlah kalian menghalang orang-orang yang hendak mengikuti agama Allah seraya membuat jalan Allah menjadi bengkok (nampak sulit) agar tidak dilalui oleh manusia (yakni menghindar dari agama Allah). Dan ingatlah nikmat yang Allah berikan kepada kalian agar kalian bersyukur kepada-Nya. Karena dahulu jumlah kalian sedikit, kemudian Allah memperbanyak jumlah kalian. Dan perhatikanlah bagaimana nasib orang-orang yang membuat kerusakan di muka bumi sebelum kalian. Nasib mereka berakhir dengan kebinasaan dan kehancuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Dan janganlah kalian duduk di setiap jalan untuk menebar ketakutan kepada orang yang beriman dengan pembunuhan, menghalangi kaum mukminin dari beriman kepada Allah, mendustakan Nabi Syuaib, dan menebar syubhat dan keraguan agar dapat menjauhkan orang lain dari keimanan kepada Allah dan rasul-Nya. Dan ingatlah karunia yang telah Allah berikan kepada kalian, ketika kalian masih berjumlah sedikit, kemudian Allah memperbanyak keturunan kalian. Dan ambillah pelajaran dari azab-azab yang telah ditimpakan kepada umat-umat terdahulu karena mendustakan para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَلَا تَقْعُدُوا۟ بِكُلِّ صِرٰطٍ (Dan janganlah kamu duduk di tiap-tiap jalan) Makna (الصراط) yakni jalan. تُوعِدُون (dengan menakut-nakuti) Menakut-nakuti orang lain dengan siksaan. Pendapat lain mengatakan mereka dahulu duduk di jalan-jalan yang menuju ke tempat Nabi Syu’aib, mereka menakut-nakuti orang yang akan mendatanginya dengan mengatakan bahwa ia adalah seorang pendusta, maka janganlah kamu mendatanginya. وَتَصُدُّونَ عَن سَبِيلِ اللهِ مَنْ ءَامَنَ بِهِۦ (dan menghalang-halangi orang yang beriman dari jalan Allah) Maksudnya adalah mereka menghalangi orang-orang beriman untuk sampai ke tempat nabi Syu’aib. Pendapat lain mengatakan yang dimaksud adalah Allah melarang mereka untuk duduk diatas jalan agama untuk menghalangi orang yang ingin menempuh jalan itu, dan maksudnya bukan duduk di jalan yang sebenarnya. وَتَبْغُونَهَا عِوَجًا ۚ (dan menginginkan agar jalan Allah itu menjadi bengkok) Mereka mengharapkan agar jalan Allah menjadi bengkok. وَاذْكُرُوٓا۟ إِذْ كُنتُمْ قَلِيلًا (Dan ingatlah di waktu dahulunya kamu sedikit) Yakni jumlah kalian sedikit. فَكَثَّرَكُمْ ۖ( lalu Allah memperbanyak jumlah kamu) Dengan kelahiran. Pendapat lain mengatakan maknanya adalah mereka dahulunya adalah orang-orang yang miskin kemudian Allah menjadikan mereka kaya. وَانظُرُوا۟ كَيْفَ كَانَ عٰقِبَةُ الْمُفْسِدِينَ(Dan perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan) Dari umat-umat terdahulu, sesungguhnya Allah telah membinasakan mereka dan melenyapkan sisa-sisa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Dan janganlah kalian memotong jalan, dimana kalian mengancam menghukum orang yang ingin mendatangi kalian, menghalangi orang untuk beriman kepada agama Allah dan datang kepada Syu’aib, dan menginginkan agar syariat Allah itu menyimpang. Ingatlah ketika jumlah kalian sedikit, lalu Dia (Allah) memperbanyak kelompok kalian dengan memberikan keturunan, serta memperkuat dan memperkaya kalian, dan renungkanlah bagaimana takdir orang-orang dari umat-umat sebelumnya yang berbuat kerusakan lagi zalim, dimana Allah membinasakan mereka akibat kekufuran dan dosa-dosa mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah duduk di setiap jalan} jalan {dengan menakut-nakuti} mengancam orang yang melintas di setiap jalan {dan menghalang-halangi orang-orang yang beriman dari jalan Allah} merintangi dari agama Allah {serta ingin membelokkannya} kalian menginginkan jalan Allah berbelok-belok dengan menyampaikan sesuatu yang serupa {Ingatlah ketika kalian dahulunya sedikit, lalu Allah memperbanyak jumlah kalian. Perhatikanlah bagaimana akibat orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86 “dan janganlah kamu duduk” menghadang orang ”di tiap-tiap jalan” yaitu jalan yang banyak dilalui oleh orang-orang kamu memperingatkan orang-orang darinya “dengan menakut-nakuti” orang-orang yang melewatinya “dan menghalangi orang-orang yang beriman dari jalan Allah” yakni orang yang ingin dijadikannya petunjuk. ”dan menginginkan agar jalan Allah itu menjadi bengkok” dan kamu membelokannnya hanya demi hawa nafsumu. Semestinya kamu dan orang-orang selainmu menghargai dan menghormati jalan –jalan yang Allah letakkan bagi hamba-hambaNya agar mereka bisa menitinya kepada ridha Allah dan rumah kemuliaanNYa yang dengannya Dia merahmati mereka dengan rahmat terbesar. Semestinya kamu menolongnya, menyerukan kepadanya dan membelanya, bukan malah kamu menjadi pembegal yang menghadang dari orang-orang darinya, karena ini adalah merupakan bentuk kekufuran nikmat Allah dan penentangan terhadap Allah serta menjadikan jalan yang paling lurus dan paling adil sebagai jalan yang bengkok, dan kamu menyalahkan orang-orang yag menitinya. ”dan ingatlah” nikmat Allah atas kalian, ”diwaktu dahulunya kamu berjumlah sedikit, lalu Allah memperbanyak jumlahmu” yakni menumbuhbiakkan dengan istri, anak-anak dan kesehatan yang Dia berikan kepadamu. bahwa Dia tidak mengujimu dengan wabah atau penyakit yang mengurangi jumlahmu. Dia juga tidak menguasakanmu kepada musuh yang menumpasmu dan mencerai beraikanmu di muka bumi. Justru Dia memberimu nikmat dengan kesatuanmu, pelimpahan rizki dan banyaknya keturunan. ”dan perhatikanlah kesudahan orang-orang yang berbuat kerusakan” kamu tidak melihat mereka kecuali tercerai berai, yang ada di negri mereka hanyalah kesunyian dan porak poranda. Mereka tidak meningggalkan nama baik, justru di dunia ini mereka mendapatkan laknat, sementara pada hari kiamat mereka lebih hina dan sengsara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 86: Seperti merampas pakaian mereka atau mengenakan pajak kepada barang dagangan yang mereka bawa. Dengan mengancam akan membunuhnya. Mengikuti hawa nafsu kamu, padahal seharusnya sikap kamu dan yang lain adalah menghormati dan memuliakan jalan yang dibentangkan Allah untuk hamba-hamba-Nya agar mereka memperoleh keridhaan Allah dan surga-Nya, menolongnya, mengajak orang lain kepadanya dan membelanya. Tidak malah menjadi pembegal jalan dan menghalangi manusia dari jalan Allah, karena yang demikian merupakan kufur nikmat dan menantang Allah. Dia menjadikan kamu berkumpul, memperbanyak rezeki untukmu dan memperbanyak keturunanmu. Dengan mendustakan para rasul. Di mana keadaan mereka yang sebelumnya bersatu menjadi berpecah belah, tempat tingalnya menjadi dijauhi manusia, tidak disebut kebaikannya, bahkan di dunia ini dilaknat dan di akhirat mendapat kehinaan dan terbongkarnya aib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 86",
    "description": "Dan di samping jangan merusak di muka bumi, janganlah juga kamu duduk sengaja memotong di setiap jalan menuju nabi syuaib, dengan maksud menakut-nakuti orang-orang yang melewatinya dengan ancaman pembunuhan dan terus-menerus menghalang-halangi orangorang yang beriman dari jalan Allah dan ingin membelokkannya dari jalan yang lurus dengan mencari-cari dalih atau kelemahannya untuk menanamkan keraguan terhadap Allah. Ingatlah masa lalumu ketika kamu dahulunya berjumlah sedikit, lalu Allah memperbanyak jumlah kamu dengan mengembangbiakkan keturunanmu dan memberi rezeki yang banyak. Dan perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan dari umat dan suku sebelummu, seperti kaum 'ad dan samud, sebagai pelajaran agar kamu tidak mengalami nasib serupa. Sambil mengajak kaumnya beriman, nabi syuaib mengakhiri seruannya dengan kalimat diplomatis, jika ada segolongan di antara kamu yang beriman kepada ajaran yang aku diutus menyampaikannya agar menyembah Allah dan meninggalkan perbuatan zalim seperti mengurangi hak manusia dalam menimbang dan menakar, dan ada pula segolongan yang tidak beriman dengan apa yang aku sampaikan itu dengan masih tetap kufur dan berbuat zalim, maka bersabarlah, wahai dua golongan yang berbeda, sampai Allah menetapkan keputusan atas perkara itu dengan seadil-adilnya di antara kita. Dialah hakim yang terbaik pemberi keputusan."
  }
]