[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika ada segolongan dari kalian yang mengimani risalah yang aku diutus oleh Allah dengan mengembannya, dan ada sekelompok lain yang tidak mempercayainya, maka tunggulah oleh kalian wahai orang-orang yang mendustakan keputusan Allah yang akan memutuskan antara kami dan kalian ketika menimpa kalian siksaan yang aku peringatkan kalian darinya. Dan Allah adalah sebaik-baik hakim diantara para hambaNya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Jika ada sekelompok orang di antara kalian yang percaya pada ajaran yang kubawa dari Tuhanku dan ada kelompok lain yang tidak percaya maka tunggulah -wahai orang-orang yang tidak percaya- keputusan yang akan Allah berikan di antara kalian, Dia lah yang terbaik dan paling adil dalam memutuskan dan menetapkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Jika tedapat sekelompok kaum ini yang membenarkan risalah yang aku bawa, sedangkan sekelompok lain enggan mengimaninya, maka bersabarlah kalian hingga Allah memutuskan ketetapan-Nya di antara kita; Dia adalah sebaik-baik yang memberi keputusan dan yang paling adil dalam menetapkan hukuman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. فَاصْبِرُوا۟ حَتَّىٰ يَحْكُمَ اللهُ بَيْنَنَا ۚ وَهُوَ خَيْرُ الْحٰكِمِينَ (maka bersabarlah, hingga Allah menetapkan hukumnya di antara kita; dan Dia adalah Hakim yang sebaik-baiknya) Dan ketetapan Allah kepada dua golongan sebagaimana ketetapan bagi dua orang yang berselisih, dengan memenangkan orang-orang yang benar atas orang-orang yang salah. Ayat ini mengandung perintah kepada orang-orang beriman untuk bersabar atas permusuhan orang-orang kafir yang menimpa mereka sampai Allah memberi pertolongan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Dan jika ada kelompok dari kalian yang beriman dengan risalahku dan kelompok lain yang tidak mengimaninya, maka bersabarlah sampai Allah memutuskan dengan benar dan adil antara Kami (Allah) dan kalian, dan terwujudnya pertolongan Kami atas kalian. Dan Allah merupakan sebaik-baik hakim, karena hukumNya itu benar dan adil, tidak ada kezaliman dan pilih kasih di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika ada satu golongan di antara kalian yang beriman kepada sesuatu yang aku diutus menyampaikannya dan ada satu golongan yang tidak beriman, bersabarlah} tunggulah {sampai Allah memutuskan} memutuskan {di antara kita. Dia adalah sebaik-baik pemberi keputusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87 “jika ada segolongan dari kamu beriman kepada apa yang aku diutus untuk menyampaikannya dan ada (pula) segolongan yang tidak beriman” yaitu yang tidak beriman itu adalah mayoritas dari mereka. ”maka bersabarlah hingga Allah menetapkan hukumnya diantara kita dan Dia adalah hakim yang sebaik-baiknya” Allah akan memenangkan (menolong) yang haq dan mengazab yang batil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 87: Inilah yang lebih banyak. Dengan menyelamatkan yang benar dan membinasakan yang batil. Yakni yang paling adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 87",
    "description": "Sambil mengajak kaumnya beriman, nabi syuaib mengakhiri seruannya dengan kalimat diplomatis, jika ada segolongan di antara kamu yang beriman kepada ajaran yang aku diutus menyampaikannya agar menyembah Allah dan meninggalkan perbuatan zalim seperti mengurangi hak manusia dalam menimbang dan menakar, dan ada pula segolongan yang tidak beriman dengan apa yang aku sampaikan itu dengan masih tetap kufur dan berbuat zalim, maka bersabarlah, wahai dua golongan yang berbeda, sampai Allah menetapkan keputusan atas perkara itu dengan seadil-adilnya di antara kita. Dialah hakim yang terbaik pemberi keputusan. Pemuka-pemuka dan pembesar kaum nabi syuaib yang menyombongkan diri dan menolak beriman berkata, wahai syuaib! pasti kami usir engkau bersama orang-orang yang beriman kepadamu dari negeri kami, kecuali jika engkau kembali kepada agama kami atau diam dan membiarkan kami melakukan apa yang kami inginkan. Nabi syuaib berkata, apakah kamu akan mengusir kami, atau kami mengikuti agama kalian yang sesat, atau membiarkan kalian, kendatipun kami tidak suka itu karena kami tahu kesesatannya' tidak mungkin itu akan terjadi."
  }
]