[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan syu’aib berkata kepaad kaumnya untuk menyambung perkataannya, ”sungguh kami telah mengada-ngadakan kedustaan terhadap Allah, jika kami kembali kepada agama kalian, sesudah Allah menyelamatkan kami darinya. Dan bukan hak kami untuk berpindah agama menuju agama selain agama tuhan kami, kecuali jika Allah tuhan kami menghendakinya. Sesungguhnya pengetahuan Allah meliputi segala sesuatu. Dia mengetahui apa saja yang akan mendatangkan kemaslahatan bagi para hambaNYa. Kepada Allah semata ketergantungan kami dalam menggapai hidayah dan kemenangan. Wahai tuhan kami, berilah keputusan antara kami dan kaum kami dengan hak dan Engkaulah pemberi keputusan yang sebaik-baiknya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Sungguh kami telah membuat kebohongan atas nama Allah jika kami mengakui kekafiran dan kemusyrikan yang kalian anut itu setelah Allah menyelamatkan kami darinya dengan karunia-Nya. Dan kami tidak boleh dan tidak pantas kembali kepada agama kalian yang batil itu, kecuali apabila Rabb kami menghendakinya. Karena segala sesuatu tunduk kepada kehendak Allah -Subḥānahu-. Pengetahuan Rabb kami meliputi segala sesuatu. Tidak ada sesuatu pun yang luput dari pengetahuan-Nya. Hanya kepada Allah-lah kami bersandar agar Dia berkenan memantapkan hati kami di jalan yang lurus dan melindungi kami dari jalan menuju Neraka Jahīm. Ya Rabb kami, berilah keputusan yang benar di antara kami dan kaum kami yang kafir itu. Maka tolonglah pihak yang benar dan yang teraniaya untuk mengalahkan pihak yang salah dan ingkar. Karena Engkau -wahai Tuhan kami- adalah sebaik-baik pemberi keputusan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Kemudian Nabi Syuaib menolak dengan tegas, agar mereka tidak mengira dia akan kembali kepada agama mereka. Dia menegaskan: “Jika kami kembali kepada agama mereka maka itu adalah pendustaan terhadap Allah yang telah menyelamatkan kami dengan memberi hidayah kepad agama yang benar dan menjauhkan kami dari kesyirikan; dan tidak boleh bagi kami kembali kepada agama yang batil.” Meskipun dia sangat yakin dengan apa yang dia katakan namun dia tetap menyerahkan perkara itu kepada Allah sebagai adab yang baik kepada-Nya; sehingga dia tidak menegaskan dengan kehendaknya sendiri, namun mengembalikannya kepada kehendak Allah, karena Allah mengetahui apa yang tidak diketahui manusia, yang menjadi rahasia hikmah dan kehendak-Nya, ilmu-Nya meliputi segala sesuatu. Kemudian Nabi Syuaib menyatakan kelemahannya dalam menghadapi orang-orang yang sombong tersebut dengan berkata bahwa dia bertawakkal kepada Allah dan membutuhkan pertolongan-Nya, dan dia hanya bersandar kepada Allah semata, sehingga dia bermunajat kepada-Nya agar menolong orang yang terzalimi yang berada dalam kebenaran atas orang zalim yang memusuhi kebenaran; Dia adalah sebaik-baik pemberi kemenangan bagi hamba-hamba-Nya, Dia menjelaskan antara yang benar dan yang batil, dan petunjuk dan kesesatan. Dia memberi pertolongan dengan menimpakan azab bagi orang-orang zalim, dan menyelamatkan dan memuliakan orang-orang shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. قَدِ افْتَرَيْنَا عَلَى اللهِ كَذِبًا إِنْ عُدْنَا فِى مِلَّتِكُم (Sungguh kami mengada-adakan kebohongan yang benar terhadap Allah, jika kami kembali kepada agamamu) Yaitu kepada kesyirikan. Dan semua kesyirikan adalah kedustaan terhadap Allah dan perbuatan mengada-ada belaka, karena tidak ada bagi segala yang ada di alam semesta ini Tuhan kecuali Allah yang menciptakan segalanya, pengatur, dan sesembahan yang hak; maka barangsiapa yang beranggapan bahwa Allah memiliki sekutu maka ia telah berdusta terhadap Allah dan telah beranggapan ketidaksempurnaan sifat ke-esaan dan ketuhanan-Nya. بَعْدَ إِذْ نَجَّىٰنَا اللهُ مِنْهَا ۚ( sesudah Allah melepaskan kami dari padanya) Karena seandainya terjadi perbuatan dosa yang sangat besar dari seorang yang dulunya kafir kemudian diperintah untuk murtad maka itu tetap saja tidak dibenarkan, sebab kemurtadan setelah beriman adalah dosa dan kekafiran yang paling besar. وَمَا يَكُونُ لَنَآ(Dan tidaklah patut) Yakni tidak boleh dan tidak dibenarkan. أَن نَّعُودَ فِيهَآ(patut kami kembali kepadanya) Dalam keadaan apapun setelah Allah menyelamatkan kami dari kekafiran. إِلَّآ أَن يَشَآءَ اللهُ (kecuali jika Allah menghendaki) Yakni selama Allah tidak menghendaki demikian bagi kami. وَسِعَ رَبُّنَا كُلَّ شَىْءٍ عِلْمًا ۚ (Pengetahuan Tuhan kami meliputi segala sesuatu) Ilmu-Nya meliputi setiap makhluk. عَلَى اللهِ تَوَكَّلْنَا ۚ( Kepada Allah sajalah kami bertawakkal) Kepada-Nya kami bersandar untuk meneguhkan kami diatas keimanan dan melindungi kami dari kekafiran dan penganutnya, serta menyempurnakan kenikmatan bagi kami dan menjauhkan kami dari kemurkaan-Nya. رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ(Ya Tuhan kami, berilah keputusan antara kami dan kaum kami dengan hak (adil)) Yakni putuskanlah urusan antara kami dan kaum kami secara adil, dengan memenangkan orang-orang yang benar atas orang-orang yang salah. Mereka seakan-akan mengharapkan turunnya azab atas orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Dan Syu’aib menambahi: “Sungguh kami telah merekayasa kebohongan terhadap Allah jika kami kembali kepada kerpercayaan kalian, yaitu kesyirikan dan kezaliman setelah Dia menyelamatkan (melepaskan) kami dari hal itu, karena sesungguhnya kembali kepada hal itu merupakan sebesar-besar dosa dan orang yang menolak untuk beriman itu merupakan sebesar-besar kekufuran, kecuali Allah menghendaki itu. Ilmu Allah meliputi segala makhluk. Kami menyerahkan urusan kami kepada Allah dan bersandar kepadaNya supaya Dia meneguhkan keimanan (kami), menyempurnakan nikmat dan penjagaanNya (kepada kami) dari kekufuran dan kedengkian. Wahai Tuhan Kami, tentukanlah hukum antara kami dan kaum kami dengan adil, dengan sesuatu yang layak berupa pertolongan atau kekalahan. Engkau adalah seadil-adil dan sebaik-baik hakim”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kami telah mengada-adakan} membuat-buat {kebohongan kepada Allah jika kami kembali pada agama kalian setelah Allah menyelamatkan kami} menyelamatkan kami {darinya. Tidaklah benar} tidak benar {bagi kami kembali pada agama itu, kecuali jika Allah Tuhan kami menghendaki. Ilmu Tuhan kami meliputi segala sesuatu. Hanya kepada Allah kami bertawakal. Wahai Tuhan kami, berilah keputusan} berilah keputusan {antara kami dan kaum kami dengan benar. Engkaulah sebaik-baik pemberi keputusan.”} pemberi keputusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89 \"Sungguh kami mengada-adakan kebohongan yang besar terhadap Allah, jika kami kembali pada agamamu, sesudah kami menyelamatkan kami daripadanya” yakni, bersaksilah atas kami jika kami kembali kepadanya setelah Allah menyelamatkan kami darinya dan mengentaskan kami dari keburukannya maka kami adalah orang-orang yang berbohong dan berdusta atas nama Allah, karena kami mengetahui bahwa tidak ada dusta yang lebih besar daripada orang yang menjadikan sekutu bagi Allah, padahala Dia adalah yang Maha Esa, maha Tunggal, Tempat bergantung para makhluk yang tidak beristri dan tidak beranak, dan tidak memiliki sekutu di dalam kerajaanNya. ”dan tidaklah patut kami kembali kepadanya” yakni, tidak mungkin orang-orang seperti kami kembali lagi padanya, ini mustahil. Syu’aib membuat mereka tidak lagi berharap darinya untuk mengikuti mereka dari beberapa segi, Dari segi bahwa dia dan orang-orang yang beriman bersamanya membenci dan tidak menyukai kesyirikan yang dipegang oleh kaumnya. Dari segi bahwa dia menjadikan apa yang mereka anut sebagai kedustaan dan dia meminta untuk bersaksi apabila dia dan orang-orang yang bersamanya adalah orang-orang yang berdusta. Diantaranya juga pengakuan mereka terhadap nikmat Allah kepada mereka dimana Dia telah menyelamatkan mereka darinya. Diantaranya juga bahwa kembalinya mereka kepadanya setelah Allah memberi petujuk kepada mereka adalah termasuk perkara yang mustahil jika melihat kepada keadaan mereka saat ini dan apa yang tertanam dalam hati mereka berupa pengagungan kepada Allah, pengakuan ubudiyah kepadaNya, bahwa hanya Dialah yang berhak atas ibadah semata tiada sekutu bagiNya, bahwa tuhan-tuhan kaum musyrikin adalah kebatilan paling batil dan kemustahilan paling mustahil, dimana Allah telah menganugrahkan akal kepada mereka yang dengannya mereka mengetahui kebenaran dan kebatilan, serta petunjuk dan kesesatan. Adapun dari segi kehendak dan keinginan Allah yang pasti berlaku makhlukNya, dimana tidak seorangpun yang bisa menghindar darinya walaupun segala sebab dan kekuatan terkumpul dan tersedia, maka mereka tidak memutuskan atas diri mereka bahwa mereka akan melakukan atau meninggalkan sesuatu. Oleh karena itu mereka mengecualikan dengan mengatakan ”kecuali jika Allah, Rabb kami menghendakinya” yakni tidak mungkin bagi kami ataupun selain kami yang bisa lolos dari kehendakNya yang berdasarkan keadaan ilmu dan hikmahNya. Dan sungguh “pengetahuan Rabb kami meliputi segala seuatu”. Dia mengetahui apa yang baik bagi hamba-hambaNya dan apa yang menjadi aturanNYa pada mereka. “kepada Allah sajalah kami bertawakal” yakni kami percaya bahwa Dia akan meneguhkan kami diatas jalan yang lurus dan melindungi kami dari seluruh jalan neraka, karena barangsiapa yang bertawakal kepada Allah maka Dia akan mencukupkannya dan memudahkan untuknya urusan agama dan dunianya. ”ya Rabb kami berilah keputusan antara kami dan kaum kami dengan hak (adil)” yakni tolonglah orang yang didzalimi dan pemilik hak atas orang yang zhalm, penentang kebenaran. ”Dan engkaulah pemberi keputusan yang sebaik-baiknya” keputusanNYa kepada hamba-hambaNYa ada dua macam: keputusan ilmu dengan menjelaskan kebenaran dan kebatilan, serta petunjuk dan kesesatan, dan siapa yang tegak lurus di atas jalan dan siapa yang membelot darinya. Adapun yang kedua dalah keputusannya dengan pembalasan dan hukuman kepada orang-orang yang zhalim, serta keselamatan dan kemuliaan bagi orang-orang yang shalih. Maka mereka memohon kepada Allah keputusan diantara mereka dengan kaumnya dengan benar dan adil, dan supaya Dia menunjukkan ayat-ayat dan pelajaran-pelajarannya yang menjadi keputusan bagi kedua belah pihak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 89: Kehendak yang mengikuti ilmu dan hikmah (kebijaksanaan)-Nya. Termasuk pula tentang keadaan aku dan keadaan kamu. Yakni kami bersandar kepada-Nya agar Dia meneguhkan kami di atas jalan yang lurus, menjaga kami dari semua jalan yang mengarah kepada neraka, karena barang siapa bertawakkal kepada Allah, niscaya Dia akan mencukupkannya, memudahkan perkara agamanya dan dunianya. Maksudnya, “Tolonglah orang yang teraniaya dan orang yang berada di atas kebenaran terhadap orang yang zalim lagi menentang kebenaran.” Fath (keputusan) Allah kepada hamba-hamba-Nya mencakup dua hal: a. Keputusan dalam arti diterangkan ilmu, yakni diterangkan jalan yang benar dari jalan yang batil, petunjuk daripada kesesatan, dan siapa yang berada di atas jalan yang lurus dengan yang berada di atas jalan yang bengkok. b. Keputusan dalam arti pemberian balasan dan hukuman kepada orang yang zalim, serta keselamatan dan pemuliaan kepada orang-orang yang saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 89",
    "description": "Nabi syuaib menolak keras keinginan mereka agar kembali kepada agama mereka, sungguh, kami telah mengada-adakan kebohongan yang besar terhadap Allah, jika kami kembali kepada agamamu atau merestui perbuatanmu, apalagi setelah Allah melepaskan dan menyelamatkan kami darinya dengan menunjuki kami jalan yang benar. Dan tidaklah pantas kami memilih kembali kepadanya, kecuali jika Allah, tuhan kami menghendaki itu. Tetapi hal itu tidak mungkin terjadi sebab pengetahuan tuhan kami meliputi segala sesuatu, sehingga dia tahu yang terbaik bagi hamba-Nya. Hanya kepada Allah kami bertawakal, menyerahkan segala urusan dengan melaksanakan semua kewajiban, seraya memohon petunjuk dan pertolongan. Selanjutnya nabi syuaib dan pengikutnya bermohon, ya tuhan kami, berilah keputusan antara kami dan kaum kami dengan hak yakni adil. Engkaulah pemberi keputusan terbaik. Para pemuka kaum nabi syuaib merasa putus asa menundukkan syuaib dan pengikutnya yang tetap teguh pada agama mereka. Mereka merasa cemas pengikut nabi syuaib akan semakin banyak melihat kekuatan dan ketegarannya dalam berdakwah. Karena itu, pemukapemuka dari kaumnya yang kafir beralih kepada pengikut mereka, mengancam mereka dengan berkata, sesungguhnya jika kamu mengikuti syuaib, beriman kepadanya dan meninggalkan ajaran dan tradisi leluhur kamu, tentu kamu menjadi orang-orang yang rugi, karena mengikuti agama yang salah, yang belum pernah diikuti oleh leluhur kalian."
  }
]