[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa yang ringan amal perbuatannya (karena banyaknya keburukannnya) maka mereka itu adalah orang-orang yang menyia-nyiakan bagiannya dari keridahaan Allah . disebabkan sikapnya yang melampaui batas dengan mengingkari ayat-ayat Allah dan menolak tunduk kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan barangsiapa yang timbangan amal buruknya lebih berat dari timbangan amal baiknya, maka mereka telah merugikan dirinya sendiri. Mereka telah menjerumuskan diri mereka sendiri ke dalam jurang kehancuran di hari Kiamat karena mereka telah ingkar kepada ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan barangsiapa lebih berat keburukannya daripada kebaikannya, maka mereka itu adalah orang-orang yang merugikan diri sendiri dengan memasukkannya ke dalam neraka dan menyuguhkannya kepada siksaan akibat penolakan mereka terhadap ayat-ayat Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang ringan timbangannya} neraca keburukannya melebihi neraca kebaikannya {mereka itulah orang-orang yang telah merugikan dirinya sendiri karena mereka terhadap ayat-ayat Kami itu selalu mengingkari} menolak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “dan barangsiapa yang ringan timbangan kebaikannya” dimana keburukannya lebih berat dan hukumnya berdasarkan kepadanya, ”maka itulah orang-orang yang merugikan dirinya sendiri” Karena mereka gagal mendapatkan nikmat abadi dan justru mendapatkan azab yang pedih. ”disebabkan mereka selalu mengingkari ayat-ayat kami” mereka tidak tunduk kepadanya padahal itu adalah wajib atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 9: Karena banyaknya keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 9",
    "description": "Dan barang siapa ringan timbangan kebaikan-Nya karena banyak melakukan dosa, maka mereka itulah orang yang telah merugikan dirinya sendiri, karena mereka mengingkari ayat-ayat kami. Padahal, ayat-ayat tersebut telah jelas mengemukakan kebenaran yang sulit terbantahkan. Namun kesombongan dan sikap iri pada hati mereka menyebabkan mereka enggan menerima ayat-ayat tersebut, bahkan mendustakannya. Setelah itu, pada ayat ini Allah menjelaskan tentang anugerah-Nya kepada manusia. Dan sungguh, kami telah menempatkan kamu di bumi menjadi pemilik dan pengelolanya, dan di sana kami sediakan sumber penghidupan untukmu seperti tempat untuk kamu menetap, sumbersumber makanan dan minuman, dan sarana kehidupan lainnya. Akan tetapi, sedikit sekali kamu bersyukur atas semua kenikmatan itu dengan mengerahkan semua energi yang didapat dari semua nikmat itu untuk beribadah kepada Allah. Bahkan, kamu banyak mengingkarinya dengan menyembah selain Allah, serta berbuat kemaksiatan dan kerusakan di bumi."
  }
]