[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah berkata para pemimpin dan pemuka-pemuka yang memdustakan lagi menolak dakwah tauhid sebagai penegasan keangkuhan dan pernentangan mereka demi memperingatkan (manusia) agar tidak mengikuti syu’aib , ”jika kalian mengikuti syu’aib, sesungguhnya kalian akan menjadi orang-orang yang binasa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Para pemimpin dan pemuka kaumnya yang menolak dakwah tauhid itu memperingatkan kaumnya agar waspada terhadap Syu’aib dan agamanya. Mereka mengatakan, “Sungguh, jika kalian masuk ke dalam agama Syu’aib -wahai kaum kami- dan meninggalkan agama leluhur kalian, pasti kalian akan celaka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Setelah itu kaum Syuaib merasa putus asa untuk menarik Syuaib dan para pengikutnya kepada agama mereka. Maka mereka mulai menjauhkan dan manakut-nakuti orang lain agar tidak mengikuti risalahnya dan jalan dakwahnya dengan mengatakan bahwa itu akan menghilangkan kejayaan dan mata pencaharian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. لَئِنِ اتَّبَعْتُمْ شُعَيْبًا (Sesungguhnya jika kamu mengikuti Syu’aib) Yakni jika kalian memeluk agama Syu’aib dan meninggalkan agama kalian. إِنَّكُمْ إِذًا لَّخٰسِرُونَ (tentu kamu jika berbuat demikian (menjadi) orang-orang yang merugi) Kerugian mereka berupa kebinasaan mereka. Atau maksudnya adalah apa yang menjadikan mereka rugi karena menyempurnakan takaran dan timbangan dan meninggalkan pengurangan takaran dan timbangan yang dahulu mereka lakukan ketika bermuamalat dengan orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Para pemimpin kaum kafir berkata kepada kelompoknya: “Sungguh jika kalian beriman kepada Syu’aib dan mengikutinya, maka sesungguhnya kalian itu termasuk orang-orang yang merugi dalam perniagaan dengan meninggalkan hal sepele dalam timbangan dan akan binasa di akhir kehidupannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Para pemuka orang-orang yang ingkar dari kaumnya berkata,“Sungguh jika kalian mengikuti Syuʻaib} masuk dalam agama Syu’aib dan meninggalkan agama kalian {niscaya kalian benar-benar menjadi orang-orang yang rugi.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90 “pemuka-pemuka kaum syu’aib yang kafir berkata (kepada sesamanya)” memperingatkan agar tidak mengikuti syu’aib. ”sesungguhnya jika kamu mengikuti syu’aib tentu kamu jika berniat demikian (menjadi) orang-orang yang merugi” ini termasuk tipuan dari diri mereka, bahwa kerugian dan kesengsaraan ada pada mengikuti kebenaran dan petunjuk. Mereka tidak menyadari bahwa seluruh kerugian berporos pada sikap mereka, berpegang pada kesesatan dan usaha penyesatan kepada orang lain. Dan mereka mengetahui itu manakala azab telah turun menimpa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 90: Memperingatkan yang lain agar tidak mengikuti Nabi Syu’aib ‘alaihis salam. Mereka tidak mengetahui, bahwa kerugian yang sesungguhnya ketika tetap berada di atas kesesatan dan menyesatkan yang lain, dan mereka akan mengetahui siapa yang sesungguhnya rugi ketika azab menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 90",
    "description": "Para pemuka kaum nabi syuaib merasa putus asa menundukkan syuaib dan pengikutnya yang tetap teguh pada agama mereka. Mereka merasa cemas pengikut nabi syuaib akan semakin banyak melihat kekuatan dan ketegarannya dalam berdakwah. Karena itu, pemukapemuka dari kaumnya yang kafir beralih kepada pengikut mereka, mengancam mereka dengan berkata, sesungguhnya jika kamu mengikuti syuaib, beriman kepadanya dan meninggalkan ajaran dan tradisi leluhur kamu, tentu kamu menjadi orang-orang yang rugi, karena mengikuti agama yang salah, yang belum pernah diikuti oleh leluhur kalian. Tak berselang lama, lalu datanglah gempa yang dahsyat menimpa mereka, sebagai bentuk siksa Allah yang pantas mereka terima, dan mereka pun mati bergelimpangan di dalam reruntuhan rumah mereka."
  }
]