[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "A gempa bumi dahsyat menerjang kaum syu’aib , sehingga mereka kemudian menjadi jasad-jasad bergelimpangan yang mati di rumah-rumah mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Kemudian mereka dilanda gempa bumi yang sangat dahsyat hingga mereka tewas di dalam rumah-rumah mereka sendiri. Mereka tewas dalam posisi telungkup dengan lutut bertekuk dan wajah tersungkur di dalam rumah-rumah mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Kemudian datanglah akhir dari orang-orang musyrik yang membangkang dan sombong, yang menghalangi manusia dari jalan Allah, dengan datangnya gempa bumi dahsyat yang menimpa mereka, sehingga mereka menjadi mayat-mayat yang bergeletakan di dalam rumah-rumah mereka. Azab yang diperingatkan nabi mereka ini telah menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. فَأَخَذَتْهُمُ الرَّجْفَةُ (Kemudian mereka ditimpa gempa) Yakni gampa bumi. Pendapat lain mengatakan yakni suara yang amat keras. فَأَصْبَحُوا۟ فِى دَارِهِمْ جٰثِمِينَ(maka jadilah mereka mayat-mayat yang bergelimpangan di dalam rumah-rumah mereka) Tafsir dari kalimat ini telah disebutkan dalam kisah Nabi Shalih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Maka mereka dibinasakan dan dihancurkan dengan guncangan yang keras akibat kemaksiatan dan keteguhan mereka atas kekufuran, lalu mereka menjadi mayat-mayat yang terhambur-hamburkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka ditimpa gempa sehingga mereka mati bergelimpangan di dalam tempat tinggal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91 “kemudian mereka ditimpa gempa” yang dahsyat. ”maka jadilah mereka mayat-mayat yang bergelimpangan di dalam rumah-rumah mereka” yakni tersungkur mati dan tidak bergerak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 91: Di atas lutut mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 91",
    "description": "Tak berselang lama, lalu datanglah gempa yang dahsyat menimpa mereka, sebagai bentuk siksa Allah yang pantas mereka terima, dan mereka pun mati bergelimpangan di dalam reruntuhan rumah mereka. Demikianlah keadaan mereka, sehingga orang-orang yang mendustakan nabi syuaib dan menolak ajaran kebenaran yang disampaikannya, dengan siksa yang menimpa mereka itu seakan-akan mereka belum pernah tinggal dinegeri itu dan bersenang-senang di situ, sebab semuanya hancur binasa, tak ada yang tersisa sedikit pun. Tidak ada lagi bekasbekas peninggalan yang dapat menjadi bukti keberadaan mereka. Jika demikian itu kesudahan yang menimpa mereka, maka mereka yang mendustakan nabi syuaib, dan mengira bahwa orang yang mengikutinya akan merugi, mereka itulah sebenarnya orang-orang yang rugi karena kehilangan kebahagiaan di dunia dan akhirat."
  }
]