[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka syu’aib berpaling meninggalkan mereka tatkala meyakini datangnya siksaan pada mereka. Dan dia berkarta, ”wahai kaumku, sungguh aku telah menyampaikan ajaran-ajaran tuhanku kepada kalian dan aku sudah menasihati kalian untuk memeluk agama Allah dan meninggalkan keyakinan kalian sebelumnya, namun kalian tidak mendengar dan tidak menaatinya. Maka kenapa aku harus bersedih terhadap orang-orang yang mengingkari keesaan Allah dan mendustakan para rasulNya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Dan setelah mereka binasa, Syu’aib -‘Alaihissalām- pergi meninggalkan mereka seraya berkata, “Wahai kaumku! Sesungguhnya aku telah menyampaikan apa yang harus kusampaikan kepada kalian dari Rabbku dan aku pun telah menasihati kalian, tetapi kalian tidak mau menerima nasihatku dan tidak mau mengikuti saranku. Bagaimana mungkin aku bersedih atas orang-orang yang ingkar kepada Allah dan bersikeras mempertahankan kekafirannya?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Di sini cerita mereka berakhir dengan ditinggalkan oleh Syuaib setelah ditimpa oleh azab; dia berkata untuk mengolok mereka: “Hai kaumku, Bukankah aku telah menyampaikan kepada kalian risalah dari Tuhanku yang berisi akidah, hukum-hukum, dan berbagai pelajaran; dan aku telah menasehati kalian dengan sesuatu yang mengandung kebaikan dan petunjuk bagi kalian. Mengapa aku harus bersedih atas kaum yang kafir yang telah aku kerahkan usahaku untuk memberi hidayah dan menyelamatkan mereka, namun mereka tidak menyukai nsehat itu dan lebih memilih kesesatan daripada hidayah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. فَتَوَلَّىٰ عَنْهُمْ (Maka Syu’aib meninggalkan mereka) Yakni nabi Syu’aib berpaling dari mereka setelah menyaksikan azab telah menimpa mereka. فَكَيْفَ ءَاسَىٰ (Maka bagaimana aku akan bersedih hati) Yakni bersedih. عَلَىٰ قَوْمٍ كٰفِرِينَ(terhadap orang-orang yang kafir) Yakni kafir kapada Allah dan berlarut-larut dalam kekafiran mereka serta menolak untuk menerima seruan nabi Syu’aib."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Lalu Syu’aib berpaling dari mereka saat menyaksikan terjadinya azab tersebut atas mereka, dan berkata: “Sungguh aku telah menunaikan kewajibanku dan menyampaikan apa yang diperintahkan kepadaku berupa perintah dan larangan, lalu bagaimana bisa aku menyesal dan bersedih atas kaum yang keras kepala atas kekufuran?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Syu’aib berpaling dari mereka dan berkata,“Wahai kaumku, sungguh aku benar-benar telah menyampaikan risalah Tuhanku kepada kalian dan aku telah menasihati kalian. bagaimana aku akan bersedih} bersedih {terhadap kaum kafir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93 manakala mereka binasa, nabi mereka meninggalkan mereka, ”seraya berkata” kepada mereka setelah mereka mati dalam rangka menyalahkan dan mencela mereka ”hai kaumku, sesungguhnya aku telah menyampaikan kepada kalian amanat-amanat Rabbku” yakni aku telah menyampaikannya dan menjeleskannya kepadamu sehingga ia mencapai sejauh apa yang bisa dicapai pada dirimu dan ia pun telah mencapai hatimu, ”dan aku telah memberi nasihat kepadamu” tetapi kamu tidak menerima nasihatku dan tidak mendengarkan petunjukku, justru kamu bersikap fasik dan melampaui batas. ”bagaimana aku akan bersedih hati terhadap orang-orang yang kafir?” yakni bagaimna aku bersedih kepada kaum yang tidak ada kebaikan bagi mereka, dimana kebaikan mendatangi mereka tapi mereka malah menolaknya dan tidak menerimanya, maka tidak ada yang layak bagi mereka kecuali keburukan. Mereka itu tidak layak dikasihani, justru kebinasaan mereka disyukuri. Kami berlindung kepadaMu ya Allah dari kehinaan dan kenistaan. Adakah kesengsaraan dan hukuman yang lebih berat daripada mereka yang telah mencapai tingkat bahwa orang yang paling tulus kepada mereka berlepas diri dari mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 93: Namun kamu tidak mau beriman. Kami berlindung kepada Engkau ya Allah dari kehinaan seperti ini. Kerugian dan kesengsaraan manakah yang melebihi kerugian orang-orang yang manusia terbaik (para nabi) berlepas diri daripadanya dan tidak berduka cita terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 93",
    "description": "Melihat kehancuran yang menimpa kaumnya yang ingkar, maka nabi syuaib dengan berat hati berpaling meninggalkan mereka seraya berkata dengan penuh sesal dan iba, wahai kaumku! sungguh, aku telah menyampaikan amanat tuhanku berupa pesan-pesan-Nya yang dibuktikan dengan aneka mukjizat kepadamu yang dapat membawa kepada kebaikan jika kamu lakukan, dan aku telah menasihati kamu berupa sesuatu yang dapat menyelamatkan kamu dari hukuman Allah. Maka bagaimana aku akan bersedih hati terhadap penderitaan orang-orang kafir yang telah mendarah daging dalam diri mereka kekufuran' itu tidak akan terjadi, sebab aku sudah berusaha keras memberikan petunjuk dan berupaya menyelamatkan mereka, tetapi mereka malah memilih kehancuran. Dan kami tidak mengutus seorang nabi pun kepada sesuatu negeri, untuk mengajak penduduknya kepada agama Allah yang benar, lalu penduduknya mendustakan nabi itu, melainkan pasti kami timpakan kepada penduduknya kesempitan atau kesulitan berupa penindasan pihak lain atas mereka, serta petaka yang disebabkan oleh peperangan dan bencana alam, dan penderitaan, berupa kemiskinan, penyakit serta krisis yang beragam. Hal itu kami lakukan agar mereka menyadari kesalahan dan tunduk dengan merendahkan diri dan memohon kepada Allah dengan tulus hati agar dibebaskan dari siksa itu."
  }
]