[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidaklah mengutus seorang nabi ketengah satu negeri yang akan mengajak mereka untuk beribadah kepada Allah dan melarang mereka dari adat istiadat yang mereka perbuat yang mengandung syirik, lalu kaumnya mendustakan nabi itu, kecuali kami akan menimpakan cobaan kesulitan dan kesengsaraan hidup. Kami timpakan kepada tubuh-tubuh mereka penyakit-penyakit dan wabah-wabah, pada harta benda mereka kemiskinan dan kekurangan, dengan harapan agar mereka tunduk dan taubat kembali kepada Allah dan kembali ke jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Dan tidaklah Kami mengutus seorang nabi kepada suatu negeri kemudian penduduknya mendustakannya dan ingkar kepadanya melainkan Kami akan menghukum mereka dengan kesulitan, kemiskinan, dan penyakit, agar mereka tunduk kepada Allah dan meninggalkan kekafiran serta kesombongan mereka. Ini adalah peringatan bagi orang-orang Quraisy dan semua orang yang ingkar dan mendustakan (para nabi). dengan menyebutkan kebiasaan (sunah) yang Allah berlakukan kepada umat-umat yang ingkar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Telah berlaku sunnatullah bahwa jika Kami telah mengutus seorang nabi kepada suatu negeri, kemudian mereka mendustakannya maka Kami akan menurunkan kepada mereka berbagai macam musibah sebelum Kami binasakan mereka; hal ini agar mereka mentaati perintah Kami, dan membuat mereka sadar dan menundukkan diri kepada Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. وَمَآ أَرْسَلْنَا فِى قَرْيَةٍ مِّن نَّبِىٍّ (Kami tidaklah mengutus seseorang nabipun kepada sesuatu negeri) Kemudian penduduknya mendustakan nabi tersebut, niscaya Kami akan menghukum mereka. بِالْبَأْسَآءِ (kesempitan) Kesempitan dan kemiskinan. وَالضَّرَّآءِ(dan penderitaan) Malapetaka dan penyakit. لَعَلَّهُمْ يَضَّرَّعُونَ (supaya mereka tunduk dengan merendahkan diri) Yakni agar mereka tunduk dan patuh kepada Allah, sehingga mereka meninggalkan keangkuhan mereka dan pendustaan mereka kepada para nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Dan tidaklah Kami mengutus seorang nabi pada salah satu negeri lalu didustakan penduduknya kecuali Kami memberi mereka kesengsaraan, kefakiran, musibah, dan penyakit supaya mereka tunduk, lalu beriman dan bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus seorang nabi pun di suatu negeri, melainkan Kami menimpakan} memberi hukuman {kepada penduduknya kesempitan dan penderitaan} kemiskinan dan penyakit {agar mereka tunduk} tunduk dan merendahkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94 Allah berfirman “kami tidaklah mengutus seorang nabi pun kepada suatu negri” yang mengajak mereka untuk beribadah kepada Allah dan melarang keburukan yang ada pada mereka tidak tunduk kepadanya, kecuali Allah akan menimpakan kepada mereka “kesempitan dan penderitaan” yakni dengan kemiskinan, penyakit dan musibah-musibah lainnya, ”supaya mereka” jika musibah itu menimpa mereka, jiwa mereka tunduk lalu mereka merendahkan diri dan menaati kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 94: Yang mengajak manusia kepada Allah; menyembah hanya kepada-Nya dan mengerjakan kebaikan serta melarang semua keburukan. Yakni kemiskinan atau kesengsaraan. Seperti sakit dan berbagai bencana lainnya. Sehingga mereka beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 94",
    "description": "Dan kami tidak mengutus seorang nabi pun kepada sesuatu negeri, untuk mengajak penduduknya kepada agama Allah yang benar, lalu penduduknya mendustakan nabi itu, melainkan pasti kami timpakan kepada penduduknya kesempitan atau kesulitan berupa penindasan pihak lain atas mereka, serta petaka yang disebabkan oleh peperangan dan bencana alam, dan penderitaan, berupa kemiskinan, penyakit serta krisis yang beragam. Hal itu kami lakukan agar mereka menyadari kesalahan dan tunduk dengan merendahkan diri dan memohon kepada Allah dengan tulus hati agar dibebaskan dari siksa itu. Ketika mereka tidak menyadari kesalahan mereka dan terus ingkar, kemudian kami ganti penderitaan itu dengan kesenangan; yang miskin menjadi kaya, yang sakit menjadi sehat, dan yang lemah menjadi kuat, sehingga keturunan dan harta mereka bertambah banyak. Lalu dengan bodoh mereka berkata, sungguh, nenek moyang kami telah merasakan penderitaan dan kesenangan. Kesenangan dan kesulitan yang dialami oleh leluhur kami hanyalah masalah waktu. Keduanya berputar di antara manusia. Mereka tidak berpikir bahwa itu adalah balasan atas kekafiran mereka. Mereka terus larut dalam kedurhakaan, maka karenanya kami timpakan siksaan atas mereka dengan tiba-tiba, sehingga tidak ada lagi kesempatan buat mereka bertobat dan memohon. Sedemikian mendadak kedatangan siksa itu sampai-sampai ia datang dalam keadaan tanpa mereka sadari kedatangannya."
  }
]