[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami gantikan dengan kondisi yang lebih baik sebagai pengganti keadaan buruk itu, hingga mereka berada dalam kondisi yang sehat padda tubuh-tubuh mereka, keluasan dan kenyamanan dalam kekayaan duniawi mereka, untuk memberikan kesempaatan bagi mereka lagi, semoga mereka mau bersyukur. Akan tetapi, semua itu tidak bermanfaat bagi mereka sama sekali, dan mereka tidak mau mengambil pelajaran serta tidak meninggalkan keadaan mereka semula. Mereka malah berkata, ”ini sudah merupakan kejadian biasa pada suatu masa bagi penduduknya. Satu hari baik dari hari lainnya susah. Itulah yang terjadi pada nenek moyang sebelumnya. Maka kami pun menimpakan siksaan pada mereka dengan tiba-tiba, ketika mereka telah merasa aman, tidak merasa takut datangnya kehancuran pada benak mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Kemudian Kami ganti kesulitan hidup dan penyakit yang mereka derita itu dengan kebaikan, kekayaan, dan kedamaian, hingga jumlah mereka bertambah banyak dan harta mereka berlimpah ruah. Dan mereka berkata, “Nasib buruk dan nasib baik yang kami alami itu adalah tradisi yang selalu dialami oleh para pendahulu kami di masa lalu.” Mereka tidak menyadari bahwa penderitaan yang mereka alami itu dimaksudkan untuk dijadikan sebagai pelajaran. Dan mereka tidak mengerti bahwa nikmat yang mereka terima adalah istidraj bagi mereka. Maka Kami hukum mereka dengan azab yang tiba-tiba. Mereka tidak pernah menyadari dan tidak pernah mengira datangnya azab itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Setelah Kami menguji mereka dengan musibah dan pendaritaan, Kami angkat ujian itu dari mereka dan Kami ganti dengan kenikmatan, sehingga mereka merasakan kemudahan, kesejahteraan, kesehatan, dan keamanan, hingga harta dan jumlah mereka bertambah banyak. Namun mereka menjadi lalai dan berpaling, sehingga mereka berkata: “Nenek moyang kami dahulu juga telah merasakan kesusahan dan kesenangan, kenikmatan dan marabahaya; dan kami seperti juga tertimpa apa yang telah menimpa mereka.” Maka balasan bagi mereka adalah Allah menimpakan azab kepada mereka secara tiba-tiba, tanpa mereka rasakan dan perkirakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. ثُمَّ بَدَّلْنَا (Kemudian Kami ganti) Yakni kemudian setelah menimpa penduduk negeri Dengan kemiskinan dan penyakit, namun mereka tidak mengambil pelajaran dari kejadian tersebut maka Kami ganti keadaan susah berupa ujian dan cobaan yang Kami timpakan kepada mereka itu dengan kesenangan. الْحَسَنَةَ(dengan kesenangan) Yakni keadaan yang sejahtera, sehingga mereka berada dalam kenikmatan, kelapangan, dan keamanan. حَتَّىٰ عَفَوا۟( hingga keturunan dan harta mereka bertambah banyak) Yakni bertambah jumlah dan harta mereka. وَّقَالُوا۟ قَدْ مَسَّ ءَابَآءَنَا الضَّرَّآءُ وَالسَّرَّآءُ(dan mereka berkata: “Sesungguhnya nenek moyang kamipun telah merasai penderitaan dan kesenangan”) Yakni sesungguhnya apa yang menimpa kita berupa kesempitan dan penyakit kemudian kesejahteraan dan kelapangan setelahnya adalah sesuatu yang juga telah terjadi pada nenek moyang kita sebelumnya, dan itu berarti bahwa semua ini adalah hukum alam yang berlaku bagi orang-orang terdahulu maupun orang-orang selanjutnya. Mereka tidak percaya bahwa semua itu datangnya dari Allah sebagai cobaan bagi mereka dan siksaan atas kezaliman mereka. فَأَخَذْنٰهُم بَغْتَةً(maka Kami timpakan siksaan atas mereka dengan sekonyong-konyong) Yakni dengan tiba-tiba tanpa ada tanda-tanda yang menunjukkan akan datangnya suatu azab. وَهُمْ لَا يَشْعُرُونَ(sedang mereka tidak menyadarinya) Tidak merasakan hal itu dan tidak menyangkanya. Ini datangnya dari Allah untuk menambah siksaan bagi mereka, Allah tidak menyiksa mereka ketika dalam keadaan miskin dan sakit, namun menyiksa mereka setelah mereka dalam kenikmatan yang bergelimang agar azab mereka lebih terasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Lalu Kami beri mereka maqam cobaan dan penderitaan, yaitu kekayaan, kelapangan, kekuatan dan kesehatan sampai bertambah banyak dan berkembang, lalu mereka kufur dan tidak mensyukuri nikmat dan berkata: “Ini didapatkan dalam waktu lama, dan bukan dari Allah. Sungguh bapak-bapak Kami telah ditimpa kesengsaraan kemudian keberuntungan, sehingga kami bisa menempati posisi mereka” Dan mereka tidak menyadari bahwa itu adalah cobaan dan ujian dari Allah, namun mereka melupakannya. Lalu Kami memberi mereka azab seketika tanpa ditunda-tunda, dan mereka tidak menyadari waktu kedatangannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami mengganti penderitaan itu} kesempitan dan penderitaan {dengan kebaikan} keluasan dan kesehatan {sehingga mereka bertambah banyak} sehingga mereka bertambah banyak jumlahnya {Lalu mereka berkata,“Sungguh, nenek moyang kami telah merasakan penderitaan dan kesenangan.” Lalu Kami timpakan siksaan atas mereka dengan tiba-tiba} dengan tiba-tiba {sedangkan mereka tidak menyadari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95 “kemudian” jika musibah itu tidak berguna pada mereka, justru kesombongan mereka berlanjut dan kezhaliman mereka bertambah “kami ganti kesusahan itu dengan ketenangan” Dia melimpahkan berbagai rizki kepada mereka, memberi badan mereka kesehatan dan mengangkat musibah dari mereka ”hingga (keturunan dan harta mereka) bertambah banyak” mereka menjadi banyak rizki mereka melimpah nikmat dan karunia Allah terbentang luas pada mereka dan mereka melupakan musibah yang menimpa mereka. ”dan mereka berkata ’sesungguhnya nenek moyang kami pun telah merasakan penderitaan dan kesenangan” yakni ini adalah kebiasaan yang akan selalu berlaku dan senantiasa ada pada orang-orang dahulu dan orang-orang berikutnya, dimana terkadang mereka dalam kemudahan, terkadang mereka dalam kesulitan, terkadang dalam kebahagiaan dan terkadang dalam kesedihan, sesuai dengan perubahan zaman dan bergantinya hari-hari, dan mereka mengira bahwa itu bukan untuk pelajaran dan peringatan, tidak pula untuk istidraj, sehingga ketika mereka telah berbangga dan berbahagia dengan apa yang mereka dapatkan, dan dunia merupakan sesuatu yang paling membahagiakan mereka, maka kami menurunkan azab kepada mereka ”dengan sekonyong-konyong sedang mereka tidak menyadarinya” yakni kebinasaan yang tidak terlintas di benak mereka, mereka mengira bahwa mereka menguasai apa yang Allah berikan kepada mereka dan bahwa mereka tidak akan binasa dan berpindah darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 95: Dengan memperbanyak rezeki, menyehatkan badan mereka serta menghindarkan musibah dari mereka. Sebagai tanda kufur kepada nikmat Allah. Menurut mereka kesengsaraan, sakit dan musibah adalah hal yang biasa sebagaimana menimpa pula kepada nenek moyang mereka sebelumnya, dan bukan sebagai peringatan dan hukuman Allah, oleh karena itu mereka tetap di atas sikap mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 95",
    "description": "Ketika mereka tidak menyadari kesalahan mereka dan terus ingkar, kemudian kami ganti penderitaan itu dengan kesenangan; yang miskin menjadi kaya, yang sakit menjadi sehat, dan yang lemah menjadi kuat, sehingga keturunan dan harta mereka bertambah banyak. Lalu dengan bodoh mereka berkata, sungguh, nenek moyang kami telah merasakan penderitaan dan kesenangan. Kesenangan dan kesulitan yang dialami oleh leluhur kami hanyalah masalah waktu. Keduanya berputar di antara manusia. Mereka tidak berpikir bahwa itu adalah balasan atas kekafiran mereka. Mereka terus larut dalam kedurhakaan, maka karenanya kami timpakan siksaan atas mereka dengan tiba-tiba, sehingga tidak ada lagi kesempatan buat mereka bertobat dan memohon. Sedemikian mendadak kedatangan siksa itu sampai-sampai ia datang dalam keadaan tanpa mereka sadari kedatangannya. Demikianlah siksa yang dijatuhkan Allah atas mereka yang durhaka, dan sekiranya penduduk negeri yang kami kisahkan keadaan mereka atau selain mereka beriman kepada apa yang dibawa oleh rasul dan bertakwa, yakni melaksanakan perintah Allah dan menjauhi larangan-Nya, pasti kami akan melimpahkan kepada mereka berkah, yaitu pintu-pintu kebaikan dari segala penjuru; langit dan bumi, berupa hujan, tanaman, buahbuahan, binatang ternak, rezeki, rasa aman, dan keselamatan dari segala macam bencana, serta kesejahteraan lahir dan batin lainnya, tetapi ternyata mereka mendustakan ayat-ayat dan rasul-rasul kami, maka kami siksa mereka disebabkan kekufuran dan kemaksiatan yang terus menerus mereka kerjakan. Ketaatan akan membawa nikmat dan keberkahan, sebaliknya, kekufuran mendatangkan laknat dan kesengsaraan."
  }
]