[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya para penduduk negeri-negeri mengimani para rasul mereka dan mengikuti mereka serta menjauhi apa yang Allah telah melarang mereka, Maka Allah akan membukakan bagi mereka pintu-pint kebaikan dari setiap arah, akan tetapi mereka mendustakan, maka Allah pun menjatuhkan siksaan yang membinasakan pada mereka akibat kekafiran dan perbuatan maksiat mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Sekiranya penduduk negeri-negeri ini, yang Kami mengutus rasul-rasul Kami kepada mereka percaya pada ajaran yang dibawa oleh para rasul itu dan takut kepada Rabb mereka dengan meninggalkan kekafiran dan kemaksiatan serta menjalankan perintah-perintah-Nya niscaya Kami akan membukakan untuk mereka pintu-pintu kebaikan dari segala penjuru. Tetapi mereka tidak percaya dan tidak takut kepada Allah. Bahkan mendustakan ajaran yang dibawa oleh rasul-rasul mereka. Maka Kami hukum mereka dengan azab yang datang secara tiba-tiba akibat dosa-dosa yang telah mereka perbuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Seandainya para penduduk negeri yang telah dibinasakan itu beriman kepada risalah yang dibawa oleh para rasul dan menjauhi apa yang diharamkan Allah kepada mereka, niscaya Kami akan melapangkan rezeki mereka, dan mereka akan merasakan kehidupan yang makmur dan sejahtera; namun mereka tidak beriman dan bertakwa, dan mendustakan para rasul yang membawa hidayah bagi mereka; sehingga balasan bagi pendustaan dan keingkaran mereka adalah siksaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. وَلَوْ أَنَّ أَهْلَ الْقُرَىٰٓ (Jikalau sekiranya penduduk negeri-negeri) Yang telah Kami kirim rasul-rasul mereka kepada mereka. ءَامَنُوا۟( beriman) Beriman kepada para rasul yang diutus kepada mereka. وَاتَّقَوْا۟( dan bertakwa) Yakni dengan meninggalkan kekafiran mereka dan tidak menetap pada perbuatan buruk mereka. لَفَتَحْنَا عَلَيْهِم بَرَكٰتٍ مِّنَ السَّمَآءِ وَالْأَرْضِ(pastilah Kami akan melimpahkan kepada mereka berkah dari langit dan bumi) Yakni Kami mudahkan mereka untuk memperoleh kebaikan dari langit dan bumi sebagaimana kemudahan diperoleh didapatkan dengan terbukanya pintu-pintu yang sebelumnya tertutup. Yang dimaksud dengan kebaikan dari langit adalah hujan, dan kebaikan dari bumi adalah tumbuh-tumbuhan dan kebaikan-kebaikan lainnya. وَلٰكِن كَذَّبُوا۟( tetapi mereka mendustakan) Mendustakan ayat-ayat dan para rasul, mereka tidak beriman dan tidak pula bertakwa. فَأَخَذْنٰهُم(maka Kami siksa mereka) Dengan azab. بِمَا كَانُوا۟ يَكْسِبُونَ (disebabkan perbuatannya) Berupa perbuatan-perbuatan dosa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Bukan satu berkah saja, bahkan berkah yang banyak dari langit dan bumi yang akan diraih oleh umat manusia jika mereka memenuhi syarat yang ditetapkan oleh syari'at."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Kalau saja penduduk negeri-neegeri (Seluruh kota) yang Kami utus para rasul kepadanya itu mau beriman kepada Allah dan rasulNya, serta mewaspadai dan menjauhi kekufuran dan perbuatan-perbuatan buruk, sungguh Kami akan melapangkan kebaikan dari langit kepada mereka dengan menurunkan hujan, dan dari bumi dengan menumbuhkan tumbuh-tumbuhan dan logam, namun mereka mendustakan ayat-ayat yang menunjukkan kepada keimanan, mendustakan rasul, dan tidak mau beriman. Maka Kami mengazab dan menghukum mereka akibat kekufuran dan dosa-dosa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika penduduk negeri-negeri itu beriman dan bertakwa, niscaya Kami akan membukakan untuk mereka keberkahan dari langit dan bumi} sungguh Kami akan meluaskan kebaikan bagi mereka dan memberi kemudahan bagi mereka dari segala arah {Akan tetapi mereka mendustakannya. Maka Kami menyiksa mereka karena apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96 Manakala Allah menjelaskan bahwa orang-orang yang mendustakan para rasul diuji dengan kesusahan sebagai nasihat dan peringatan, dan dengan kemudahan sebagai istidraj dan tipuan maka kemudian Allah menjelaskan bahwa seandainya penduduk negri itu beriman dengan hati mereka secara benar yang dibuktikan dengan amal, mereka bertakwa kepada Allah lahir dan batin dengan meninggalkan seluruh yang diharamkan oleh Allah, niscaya Allah akan membukakan kepada mereka keberkahan dari langit dan bumi, Dia akan menurunkan hujan dengan deras dan menumbuhkan bumi dengan apa yang mereka bisa hidup dengannya juga ternak-ternak mereka daalm kehidupan paling subur dan rizki paling melimpah tanpa kelelahan, tanpa kesusahan, tanpa kelebihan dan tanpa kesulitan. Akan tetapi mereka tidak beriman dan bertakwa. ”maka kami siksa mereka disebabkan perbuatan mereka” dengan azab, musibah, dicabutnya keberkahan dan banyaknya penyakit, dimana ia adalah merupakan sebagian dari balasan amal mereka sebab jika tidak demikian, maka seandainya Dia menghukum mereka karena semua dosa mereka, niscaya Dia tidak akan menyaksikan satu binatang melata pun di atas muka bumi. \"Telah nampak kerusakan di darat dan di laut disebabkan karena perbuatan tangan manusi, supay Allah merasakan kepada mereka sebahagian dari (akibat) perbuatan mereka, agar mereka kembali (ke jalan yang benar)\". [QS. AR RUM 30:41]"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 96: Setelah Alah menyebutkan tentang orang-orang yang mendustakan para rasul, bahwa mereka diuji dengan berbagai penderitaan dan musibah sebagai peringatan bagi mereka, dan dengan kesenangan sebagai istidraj (penangguhan) dan makar, Allah menyebutkan, bahwa penduduk negeri jika mau beriman kepada para rasul serta menjauhi kufur dan kemaksiatan, maka Alah menurunkan berkah dari langit dan bumi kepada mereka. Berdasarkan ayat ini, jika amal yang naik kepada Allah adalah amal yang baik, maka Allah Subhaanahu wa Ta'aala akan menurunkan kebaikan. Sebaliknya, jika amal yang naik kepada Alah Ta’ala adalah amal buruk, maka Allah Subhaanahu wa Ta'aala akan menurunkan keburukan pula kepada mereka. Kepada Allah dan rasul-Nya. Menjauhi kekufuran dan kemaksiatan. Seperti diturunkan hujan. Seperti ditumbuhkan tumbuh-tumbuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 96",
    "description": "Demikianlah siksa yang dijatuhkan Allah atas mereka yang durhaka, dan sekiranya penduduk negeri yang kami kisahkan keadaan mereka atau selain mereka beriman kepada apa yang dibawa oleh rasul dan bertakwa, yakni melaksanakan perintah Allah dan menjauhi larangan-Nya, pasti kami akan melimpahkan kepada mereka berkah, yaitu pintu-pintu kebaikan dari segala penjuru; langit dan bumi, berupa hujan, tanaman, buahbuahan, binatang ternak, rezeki, rasa aman, dan keselamatan dari segala macam bencana, serta kesejahteraan lahir dan batin lainnya, tetapi ternyata mereka mendustakan ayat-ayat dan rasul-rasul kami, maka kami siksa mereka disebabkan kekufuran dan kemaksiatan yang terus menerus mereka kerjakan. Ketaatan akan membawa nikmat dan keberkahan, sebaliknya, kekufuran mendatangkan laknat dan kesengsaraan. Karena kedurhakaan dan kebejatan mereka yang sedemikian parah, sampai-sampai mereka merasa tidak mungkin terkena sanksi Allah, maka kepada mereka diajukan pertanyaan yang mengandung kecaman, apakah penduduk negeri-negeri itu mengira bahwa mereka merasa aman sehingga tidak khawatir dari kedatangan siksaan kami yang datang malam hari ketika mereka sedang tidur lelap'"
  }
]