[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah para penduduk negeri-negeri itu menyangka bahwa sesungguhnya mereka berada dalam tempat yang selamat dan aman dari siksaan Allah yang akan menimpa mereka pada malam hari tatkala mereka tertidur?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Apakah penduduk negeri-negeri kafir itu merasa aman dari datangnya azab Kami di malam hari ketika mereka tengah tertidur pulas dengan santai dan tenang?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Setelah turunnya azab itu, apakah para penduduk negeri merasa aman dari kedatangan azab Kami pada waktu mereka sedang lalai, yaitu ketika mereka sedang tidur di malam hari?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. أَفَأَمِنَ أَهْلُ الْقُرَىٰٓ (Maka apakah penduduk negeri-negeri itu merasa aman) Mereka adalah penduduk negeri yang disebutkan sebelumnya. Pendapat lain mengatakan yang dimaksud adalah kota Makkah dan sekitarnya karena mereka mendustakan Rasulullah. أَن يَأْتِيَهُم بَأْسُنَا بَيٰتًا(dari kedatangan siksaan Kami kepada mereka di malam hari) Yakni saat malam hari."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu ketika Harom bin hayyan keluar di suatu malam dan menyeru dengan suaranya yang tinggi : \"Aku takjub dengan surga bagaimana penuntunya tidur ? dan aku juga takjub dengan neraka bagaimana tidurnya orang yang ingin kabur darinya ? kemudian beliau membaca : { أَفَأَمِنَ أَهْلُ الْقُرَىٰ أَنْ يَأْتِيَهُمْ بَأْسُنَا بَيَاتًا وَهُمْ نَائِمُونَ } \"Maka apakah penduduk negeri-negeri itu merasa aman dari kedatangan siksaan Kami kepada mereka di malam hari di waktu mereka sedang tidur?\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Apakah penduduk negeri yang mendustakan rasul-rasul mereka itu merasa aman dengan datangnya azab kepada mereka di malam hari sedangkan mereka dalam keadaan tidur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah penduduk negeri-negeri itu merasa aman jika datang kepada mereka siksa Kami} azab Kami {pada malam hari} pada malam hari {ketika mereka tidur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97 “maka apakah penduduk negeri-negeri itu merasa aman” yakni penduduk yang sesuai dengan konteks. ”dari kedatangan siksaan kami” yang keras “kepada mereka di malam hari di waktu mereka sedang tidur?” yakni dalam keadaan mereka lalai, lengah dan enak-enakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 97",
    "description": "Arena kedurhakaan dan kebejatan mereka yang sedemikian parah, sampai-sampai mereka merasa tidak mungkin terkena sanksi Allah, maka kepada mereka diajukan pertanyaan yang mengandung kecaman, apakah penduduk negeri-negeri itu mengira bahwa mereka merasa aman sehingga tidak khawatir dari kedatangan siksaan kami yang datang malam hari ketika mereka sedang tidur lelap' karena boleh jadi ada yang menduga bahwa jika tidak dalam keadaan tidur boleh jadi mereka dapat menghindar, maka selanjutnya dikemukakan, atau apakah penduduk negeri itu mengira bahwa mereka merasa aman sehingga tidak khawatir dari kedatangan siksaan kami yang datang pada pagi hari di waktu matahari naik sepenggalah ketika mereka sedang bermain dan melakukan hal-hal yang jauh dari keimanan'"
  }
]