[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah para penduduk negeri-negeri itu merasa aman dari keadatangan siksaan Allah di pagi hari, ketika mereka tengah terlena lagi sibuk dengan urusan-urusan dunia mereka? Allah menyebut dua waktu tersebut secara khusus karena pada dua waktu tersebut manusia paling banyak lengah, sehingga datangnya siksaan pada waktu tersebut sangatlah menakutkan dan mengagetkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Atau apakah mereka merasa aman dari datangnya azab Kami di siang hari pada waktu duha ketika mereka sedang lengah serta lalai karena kesibukan mereka dengan urusan dunia mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Atau kedatangan azab Kami kepada mereka pada waktu dhuha, karena itu adalah waktu mereka sibuk dengan kesenangan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. ضُحًى (di waktu matahari sepenggalahan) Yakni permulaan siang apabila matahari telah terbit dan mulai meninggi. وَهُمْ يَلْعَبُونَ (ketika mereka sedang bermain) Yakni sibuk dengan sesuatu yang memberi mereka manfaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Ataukah para penduduk negeri yang disebutkan itu merasa aman dengan datangnya azab Kami di pagi hari sedangkan mereka sedang bermain, yaitu mengerjakan sesuatu yang tidak mengandung manfaat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah penduduk negeri-negeri itu merasa aman jika datang kepada mereka siksa Kami pada waktu dhuha ketika mereka bermain} lalai dan bermain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98 “atau apakah penduduk negeri-negeri itu merasa aman dari kedatangan siksaan kami terhadap mereka di waktu matahari sepenggalan naik ketika mereka sedang bermain” apa yang membuat mereka merasa aman dari hal itu sementara mereka telah melakukan sebab-sebab datangnya azab dan melakukan dosa-dosa besar yang sebagian darinya menyebabkan kebinasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 98",
    "description": "Karena boleh jadi ada yang menduga bahwa jika tidak dalam keadaan tidur boleh jadi mereka dapat menghindar, maka selanjutnya dikemukakan, atau apakah penduduk negeri itu mengira bahwa mereka merasa aman sehingga tidak khawatir dari kedatangan siksaan kami yang datang pada pagi hari di waktu matahari naik sepenggalah ketika mereka sedang bermain dan melakukan hal-hal yang jauh dari keimanan' kecaman lebih keras lagi dinyatakan dengan, atau apakah mereka mengira bahwa mereka merasa aman sehingga tidak khawatir dari siksaan Allah yang tidak terduga dan dikemas dalam bentuk yang indah, atau berupa istidra'j; perlakuan-Nya yang diduga baik karena merupakan nikmat dan kebaikan padahal sebaliknya' sungguh sangat celaka dan merugi mereka dan siapa pun jika demikian, karena tidak ada yang merasa aman dari siksaan atau makar Allah selain orang-orang yang rugi."
  }
]