[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah para penduduk negeri yang mendustakan (para rasul) merasa aman terhadap makar (balasan siksaan) Allah dan penundaan yang diberikanNya bagi mereka untuk mengulur waktu bagi mereka dengan kenikmatan yang Allah curahkan kepada mereka sebagai hukuman bagi mereka atas makar mereka. Maka tidak ada yang merasa aman dari Azab Allah, kecuali orang-orang yang binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Perhatikanlah apa yang Allah berikan kepada mereka berupa tenggang waktu, kekuatan dan rezeki yang berlimpah ruah sebagai istidraj bagi mereka. Apakah orang-orang kafir dari penduduk negeri-negeri itu merasa aman dari azab dan rencana Allah yang tersembunyi? Tidak ada yang merasa aman dari azab Allah selain orang-orang yang celaka. Sedangkan orang-orang yang mendapat petunjuk pasti senantiasa takut akan azab Allah. Mereka tidak terlena dengan karunia yang Dia berikan kepada mereka, melainkan menganggapnya sebagai anugerah-Nya kepada mereka kemudian mereka bersyukur kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Apakah mereka merasa aman dari tipu daya dan makar Allah yang tersembunyi dan tidak diketahui manusia, sehingga mereka lalai dari kekuasaan Allah bahwa Dia berkuasa untuk menurunkan azab bagi mereka pada waktu malam atau dhuha? Jika memang demikian, maka mereka adalah orang-orang yang merugi dan menyia-nyiakan diri dan akal mereka, karena tidak mendapatkan sedikitpun pelajaran dan ibrah yang telah Allah sebar di seluruh penjuru alam semesta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. أَفَأَمِنُوا۟ مَكْرَ اللهِ ۚ (Maka apakah mereka merasa aman dari azab Allah) Yakni hukuman yang diatur Allah bagi mereka, sedang mereka tidak menyadarinya. Pendapat lain mengatakan makna makar Allah disini adalah istidraj bagi mereka dengan kenikmatan dan kesehatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Takut akan azab Allah merupakan salah satu jalan terbaik untuk meningkatkan kualitas amalan seorang hamba dan mengurangi kesalahan. 2 ). Dalam ayat ini ada maksud untuk menakut-nakuti setiap mukmin yang selalu merasa aman dan selamat dari rusaknya keimanan, maka dari itu setiap kita mesti merasa takut da khawatir akan tertimpa musibah rusaknya iman, dan juga harus senantiasa berdoa agar diteguhkan diatas keimanan ini, dan senantiasa berusaha agar terhindar dari penyebab-penyeban terjadinya fitnah; karena seorang hamba sekalipun ia telah sampai kepada tujuan yang ia impikan bukanlah menjadi petimbangan bahwa ia yakin akan selalu berada dalam keselamatan.."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Apakah mereka merasa aman dari hukuman yang direncanakan Allah atas mereka dan godaanNya berupa nikmat dan kesehatan tanpa merasakannya. Maka tidak ada yang merasa aman dari rencana dan kekuatan Allah kecuali kaum yang merugikan diri sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{apakah mereka merasa aman dari siksa Allah} pembiaran Allah dengan memberi nikmat kepada orang-orang yang mendustakannya {Tidak ada orang yang merasa aman dari siksa Allah, selain kaum yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99 “maka apakah mereka merasa aman dari azab Allah (yang tidak terduga-duga)?” dimana Dia menarik mereka kepada kebinasaan secara berangsur-angsur dari arah yang tidak mereka duga dan Dia memberikan penangguhan. Sesungguhnya rencanaNYa amat teguh. ”tiadalah yang merasa aman dari azab Allah berarti dia tidak mempercayai balasan amal perbuatan dan tidak pula beriman kepada para rasul dengan iman yang sebenarnya. Ayat ini mengandung peringatan yang mendalam bahwa seorang hamba tidak sepatutnya merasa aman terhadap keimanan yang dimilikinya, justru hendaknya dia merasa takut dan khawatir jika ditimpa sebuah ujian yang dapat melenyapkan imannya, hendaknya dia selalu berdoa ”wahai dzat yang maha membolak-balikan hati teguhkanlah hati kami diatas iman” hendaknya dia beramal dan berusaha melalui berbagai cara yang bisa membebaskannya dari keburukan pada saat terjadinya fitnah-fitnah karena seorang hamba walaupun dia telah mencapai apa yang telah dicapai, dia tidak benar-benar yakin bisa selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-A’raf ayat 99: Yakni istidraj; penundaan azab dengan memberikan nikmat untuk sementara waktu, lalu azab datang secara tiba-tiba. Syaikh As Sa’diy berkata, “Dalam ayat ini terdapat takhwif (menakutkan) yang dalam agar seorang hamba tidak merasa aman dengan iman yang dimilikinya, bahkan ia harus selalu memiliki rasa takut jika sekiranya ia ditimpa cobaan yang mencabut keimanannya, dan hendaknya ia senantiasa berdoa, يَا مُقَلِّبَ الْقُلُوْبِ ثَبّتْ قَلْبِي عَلَى دِيْنِكَ “Wahai yang membolak-balikkan hati, teguhkanlah hatiku di atas agama-Mu.” Serta beramal dan berusaha melakukan setiap sebab yang dapat meloloskannya dari keburukan ketika terjadi fitnah, karena seorang hamba kalau pun tinggi keadaannya, namun tidak pasti tetap selamat.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’raf Ayat 99",
    "description": "Kecaman lebih keras lagi dinyatakan dengan, atau apakah mereka mengira bahwa mereka merasa aman sehingga tidak khawatir dari siksaan Allah yang tidak terduga dan dikemas dalam bentuk yang indah, atau berupa istidra'j; perlakuan-Nya yang diduga baik karena merupakan nikmat dan kebaikan padahal sebaliknya' sungguh sangat celaka dan merugi mereka dan siapa pun jika demikian, karena tidak ada yang merasa aman dari siksaan atau makar Allah selain orang-orang yang rugi. Atau apakah mereka sedemikian lengah dan bodoh sehingga belum jelas peristiwa-peristiwa yang dialami generasi terdahulu bagi orangorang yang mewarisi dan tinggal di suatu negeri setelah lenyap penduduknya karena dosa-dosa yang mereka lakukan' belum jelaskah bahwa kalau kami menghendaki, kapan pun, pasti kami siksa mereka karena dosadosanya seperti halnya kami membinasakan orang-orang terdahulu yang mereka warisi negerinya itu; dan kami mengunci hati mereka yang kufur sehingga mereka tidak dapat mendengar dan mengambil pelajaran."
  }
]