[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Tha Sin Mim). Keterangan tentang huruf-huruf yang terpisah-pisah (seperti ini) telah berlalu di awal Surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ṭā` Sīn Mīm. Pembahasan tentang huruf-huruf seperti ini telah dijelaskan dalam permulaan surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Al-Bara’ bin ‘Azib bahwa Nabi SAW bersabda: “Sesungguhnya Allah memberiku As-sab’u Ath-Thiwal sebagai ganti Taurat, Al-Mubin sebagai ganti Injil dan Ath-Thawasin sebagai ganti Zabur. Dan aku dikaruniai dengan Al-Hawamim dan Al-Mufashal yang belum pernah dibaca oleh nabi sebelumku” 1. Tha’, Sin, Mim, huruf-huruf ini adalah untuk menarik perhatian dan memberi petunjuk tentang kokohnya Al-Qur’an serta untuk menantang bangsa Arab untuk mendatangkan sesuatu yang serupa, selama terdiri dari huruf hijaiyyah yang merupakan unsur penyusun bahasa Arab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ṭhā Sīn Mīm"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2 Allah sang pencipta mengisyaratkan kepada satu isyarat yang menunjukan betapa agungnya ayat-ayat al-kitab al-mubin (al-qur’an) yang sangat jelas yang menunjukan kepada seluruh tuntutan-tuntutan ilahi dan maqashid syar’iyyah, sehingga tidak ada sedikitpun keraguan bagi orang yang mengamatinya, dan tidak ada syubhat tentang apa yang diberitakannNya atau diputuskanNYa karena kejelasan penunjukkannya (wudhuh ad-dalalah) terhadap makna-makna termulia dan keterkaitan hukum-hukum dengan hikmahnya dan ketertautanya dengan kolerasinya. Rasulullah memperingatkan manusia dengannya, dan dengannya pula beliau menunjukkan (mereka) kepada jalan yang lurus, sehingga banyak hamba-hamba Allah yang bertakwa mendapat petunjuk, sedangkan orang yang telah ditetapkan binasa berpaling darinya, sehingga membuat Rasulullah sangat pilu dan sedih karena mereka tidak beriman, karena kesungguhan beliau kepada kebaikan mereka dan ketulusannya terhadap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 1: Telah lalu pembahasan akan huruf muqatha’ah di awal surat Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 1",
    "description": "'' s'n m'm. Nama-nama huruf yang dengannya Al-Qur'an tersusun. Susunan Al-Qur'an tidak mampu disaingi oleh manusia. Inilah yang menjadikan Al-Qur'an menjadi mukjizat sepanjang zaman. 2. Inilah ayat-ayat kitab (Al-Qur'an) yang jelas yang menjelaskan hal-hal benar yang harus diikuti, dan yang batil yang harus dijauhi, yang baik dan mana yang buruk. Semuanya dijelaskan secara gamblang. Walaupun demikian gamblang, masih banyak manusia yang mengingkari-Nya."
  }
]