[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Dan beritakanlah (wahai Rasul) kepada kaummu ketika Tuhanmu menyeru Musa, “Datangilah Kaum yang berbuat kezhaliman, yaitu kaum Fir’aun. Dan katakanlah kepada mereka, tidakkah mereka itu takut terhadap hukuman Allah dan mau meninggalkan apa yang ada pada mereka berupa kekafiran dan kesesatan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan ingatlah -wahai Rasul- ketika Rabbmu menyeru Musa dengan memerintahkan padanya untuk pergi mendakwahi kaum yang zalim lantaran kekufuran mereka kepada Allah dan kezaliman mereka memperbudak kaum Musa (Bani Israil)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-11. Allah menyebutkan kisah Musa dan Fir’aun, ketika Allah berfirman kepada Musa di sisi gunung Thur: “Pergilah menuju orang-orang kafir, yaitu kaum Fir’aun untuk menyatakan ‘Apakah mereka tidak takut dari azab Allah akibat kekafiran mereka?’”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَإِذْ نَادَىٰ رَبُّكَ مُوسَىٰٓ (Dan (ingatlah) ketika Tuhanmu menyeru Musa) Dari sisi gunung Thur. أَنِ ائْتِ الْقَوْمَ الظّٰلِمِينَ(“Datangilah kaum yang zalim itu) Pada diri mereka terdapat kekafiran yang menjadikan mereka menzalimi diri mereka sendiri dan terdapat kemaksiatan-kemaksiatan yang menjadikan mereka menzalimi orang lain seperti, memperbudak Bani Israil dan membunuh anak laki-laki mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Wahai Nabi ingatlah ketika Tuhanmu menyeru Musa untuk pergi kepada kaum yang menzalimi diri sendiri dengan kekufuran dan kemaksiatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Tuhanmu menyeru Musa,“Datangilah kaum yang zalim itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11 dan ingatlah keadaan yang sangat mulia pada waktu Allah menyeru Nabi Musa saat Dia berbicara langsung kepadanya, mengangkatnya sebagi nabi dan mengutusnya, seraya berfirman, ”datangilah kaum yang zhalim itu,” yaitu orang-orang yang menyombongkan diri di muka bumi ini dan semena-mena terhadap penghuninya, dan pembesar mereka mengklaim sebagai tuhan “(yaitu) kaum fir’aun, ‘mengapa mereka tidak bertakwa?” maksudnya, katakan kepada mereka dengan perkataan yang lembut dan ungkapan yang lunak; mengapa kalian tidak bertakwa kepada Allah yang telah menciptakan kalian dan memberi kalian rizki, kemudian kalian meninggalkan kekafiran yang kalian anut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 10: 10-11. Ingatkanlah wahai Nabi Allah kaummu akan kisah Musa bersama dengan fir’aun dan kaumnya yang pendosa, di mana Allah menyeru Musa di samping kanan gunung thur, dan Ia memerintahkan untuk datang kepada kaum yang dzalim. Yaitu kaum fir’aun dan Musa diperintahkan untuk berkata kepada mereka : Tidakkah kalian takut Allah menimpakan adzab yang pedih dengan sebab kekafiran dan kesesatan kalian yang nyata. Dan Musa mengetahu akan kesombongan dan melampaui batasnya fir’aun; Di mana Musa telah hidup di awal-awal kelahirannya di istananya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengulangi beberapa kali kisah Musa dalam Al Qur’an tidak seperti kisah yang lain, karena di dalamnya terdapat hikmah-hikmah yang besar dan pelajaran, di dalamnya terdapat berita Beliau ketika berhadapan dengan orang-orang zalim, Musa juga sebagai penerima syariat yang besar, penerima Taurat yang merupakan kitab yang paling utama setelah Al Qur’an. Yaitu ketika Dia berbicara dengan Musa, mengangkatnya sebagai nabi dan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 10",
    "description": "Sebagai hiburan kepada nabi Muhammad dan sebagai pelajaran bagi penduduk mekah, Allah menceritakan kembali sejarah nabi-nabi terdahulu dan keingkaran kaumnya terhadap mereka. Dan ingatlah, wahai rasul, ketika tuhanmu di lembah thuwa menyeru nabi musa dengan firman-Nya, 'datangilah dan berserulah, atas nama-ku kepada kaum yang zalim, yang melampaui batas-batas kemanusiaan, itu seperti menyembah kepada selain Allah dan membunuhi bayi-bayi lelaki. \"11. \"yaitu kaum fir'aun di mesir. Datangilah mereka hai musa, dan tanyalah me-reka mengapa mereka tidak bertakwa kepada Allah dengan melaksanakan semua perintah-Nya dan menjauhi larangan-Nya'\"."
  }
]