[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "100-101. Maka tidak ada seorang pun yang bisa memberikan syafaat bagi kami dan membebaskan kami dari siksaan ini, dan tidak ada orang yang tulus untuk mencintai kami dan mengasihi kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Maka kami tidak mempunyai pemberi syafa'at seorang pun yang bisa menolong kami di sisi Allah agar ia menyelamatkan kami dari azab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Dan sekarang dalam musibah ini, kami tidak memiliki penolong-penolong di sisi Allah SWT yang mempu menyelamatkan kami dari azab. Kata {min} berfungsi untuk menunjukkan keuniversalan nafi pada kalimat setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada pemberi syafaat bagi kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96-104 “mereka berkata,” maksudnya, adalah bala tentara iblis, para pemuja berhala dan patung-patung yang mereka sembah, “demi Allah, sungguh kita dahulu (di dunia) dalam kesesatan yang nyata, karena kita telah mempersamakan kamu dengan Rabb semesta alam,” dalam ibadah, mencintai, takut dan berharap. Dan kami berdoa kepada kalian sebagaimana kami berdoa kepadaNYa. Kesesatan mereka saat itu menjadi jelas bagi mereka. Mereka pun mengakui keadilan Allah dalam menghukum mereka, dan hukuman itu benar-benar tepat pada tempatnya. mereka tidak menyetarakan berhala-berhala itu dengan Allah, Rabb semesta alam kecuali dalam hal ibadah, bukan dalam hal menciptakan. Hal ini terbukti melalui ucapan mereka, “dengan Rabb semesta alam,” mereka mengakui bahwa Allah adalah Rabb semesta alam semuanya, yang termasuk di dalamnya adalah patung-patung dan semua berhala mereka. “dan tiadalah yang menyesatkan kami,” dari jalan hidayah dan kebenaran, dan mengajak kami kejalan kesesatan dan kefasikan, “kecuali orang-orang yang berdosa.” Mereka dalah para pemuka yang menyeru kepada api neraka. “maka kami tidak mempunyai,” pada saat itu, “pemberi syafaat seorangpun,” yang dapat memberikan syafaat kepada kami untuk menyelamatkan kami dari azabNya,”dan tidak pula mempunyai teman yang akrab,” maksudnya, seorang kerabat setia yang berguna bagi kami, sebagaimana biasanya dahulu di dunia. Lalu mereka berputus asa dari segala kebaikan dan bersedih hati terhadap apa yang telah mereka lakukan, dan mereka berangan-angan untuk kembali kedunia agar bisa melakukan amal shalih. “maka sekiranya kita dapat kembali sekali lagi,” maksudnya, bisa kembali kedunia,”niscaya kmai menjadi orang-orang yang beriman,” agar kami bisa selamat dari azab dan berhak mendapat pahala! Sama seklai tidak mungkin, sama sekali tidak mungkin! Apa yang mereka inginkan itu sudah tertutup dari mereka dan semua bentuk penggadaian sudah ditutup. “sesungguhnya yang pada demikian itu,” yaitu pada yang telah kami jelaskan kepada kalian dan kami uraikan, “benar-benar terdapat tanda-tanda,” bagi kalian, ”tetapi kebanyakan mereka tidak beriman,” sekalipun tanda-tanda (bukti-bukti kebenaran) itu diturunkan. “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Mahapenyayang,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 100: 100-101. Mereka berkata : Maka siapakah gerangan bagi kami yang akan menolong dan meloloskan kami dari adzab Allah, tidak ada bagi kami walaupun teman yang dekat yang bermanfaat akan sedekahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berbeda dengan orang-orang mukmin yang memiliki pemberi syafaat, seperti para malaikat, para nabi dan orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 100",
    "description": "100. \"maka sehingga kita tidak mempunyai pemberi syafaat yaitu penolong, yang dapat menolong kita dari kesusahan saat ini. \"101. \"dan tidak pula mempunyai teman yang akrab, yang bisa memberikan sedikit pertolongan. \" setelah tidak ada lagi yang membantu, mereka lantas menginginkan kembali lagi ke dunia agar bisa melakukan amal saleh."
  }
]