[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka andai saja ada kesempatan kembali bagi kami ke dunia, lalu kami akan menjadi bagian orang-orang Mukmin yang selamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. maka sekiranya kami dapat kembali sekali lagi ke dunia niscaya kami menjadi orang-orang yang beriman kepada Allah.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. فَلَوْ أَنَّ لَنَا كَرَّةً فَنَكُونَ مِنَ الْمُؤْمِنِينَ (maka sekiranya kita dapat kembali sekali lagi (ke dunia) niscaya kami menjadi orang-orang yang beriman) Yakni andai saja kami dapat kembali ke dunia agar kami dapat menjadi orang-orang yang beriman, menjadi bagian dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Andai saja kami bisa kembali ke dunia, maka kami akan termasuk orang-orang yang beriman. Dan {law} disini digunakan untuk menunjukkan makna tamanniy."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya kami dapat kembali} kembali ke dunia {niscaya kami menjadi orang-orang yang beriman”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96-104 “mereka berkata,” maksudnya, adalah bala tentara iblis, para pemuja berhala dan patung-patung yang mereka sembah, “demi Allah, sungguh kita dahulu (di dunia) dalam kesesatan yang nyata, karena kita telah mempersamakan kamu dengan Rabb semesta alam,” dalam ibadah, mencintai, takut dan berharap. Dan kami berdoa kepada kalian sebagaimana kami berdoa kepadaNYa. Kesesatan mereka saat itu menjadi jelas bagi mereka. Mereka pun mengakui keadilan Allah dalam menghukum mereka, dan hukuman itu benar-benar tepat pada tempatnya. mereka tidak menyetarakan berhala-berhala itu dengan Allah, Rabb semesta alam kecuali dalam hal ibadah, bukan dalam hal menciptakan. Hal ini terbukti melalui ucapan mereka, “dengan Rabb semesta alam,” mereka mengakui bahwa Allah adalah Rabb semesta alam semuanya, yang termasuk di dalamnya adalah patung-patung dan semua berhala mereka. “dan tiadalah yang menyesatkan kami,” dari jalan hidayah dan kebenaran, dan mengajak kami kejalan kesesatan dan kefasikan, “kecuali orang-orang yang berdosa.” Mereka dalah para pemuka yang menyeru kepada api neraka. “maka kami tidak mempunyai,” pada saat itu, “pemberi syafaat seorangpun,” yang dapat memberikan syafaat kepada kami untuk menyelamatkan kami dari azabNya,”dan tidak pula mempunyai teman yang akrab,” maksudnya, seorang kerabat setia yang berguna bagi kami, sebagaimana biasanya dahulu di dunia. Lalu mereka berputus asa dari segala kebaikan dan bersedih hati terhadap apa yang telah mereka lakukan, dan mereka berangan-angan untuk kembali kedunia agar bisa melakukan amal shalih. “maka sekiranya kita dapat kembali sekali lagi,” maksudnya, bisa kembali kedunia,”niscaya kmai menjadi orang-orang yang beriman,” agar kami bisa selamat dari azab dan berhak mendapat pahala! Sama seklai tidak mungkin, sama sekali tidak mungkin! Apa yang mereka inginkan itu sudah tertutup dari mereka dan semua bentuk penggadaian sudah ditutup. “sesungguhnya yang pada demikian itu,” yaitu pada yang telah kami jelaskan kepada kalian dan kami uraikan, “benar-benar terdapat tanda-tanda,” bagi kalian, ”tetapi kebanyakan mereka tidak beriman,” sekalipun tanda-tanda (bukti-bukti kebenaran) itu diturunkan. “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Mahapenyayang,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 102: Kemudian mereka berkata : Duhai kiranya kami kembali lagi ke dunia untuk kali kedua, maka kami akan beriman dan membenarkan, kemudian kami akan menjadi orang-orang yang berhasil lolos dari adzab ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seandainya di sini adalah tamaniy (angan-angan) yang tidak mungkin dicapai. Yakni agar kita selamat dari siksa dan memperoleh pahala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 102",
    "description": "102. \"maka seandainya kita dapat kembali ke dunia niscaya kita menjadi orang-orang yang beriman, dan beramal saleh. \" tapi hal itu mustahil mereka dapatkan, karena hidup di dunia cuma sekali. 103. Sungguh, pada yang demikian itu yaitu pada kisah nabi ibrahim jika direnungkan dengan saksama, terdapat tanda kekuasaan Allah, tetapi kebanyakan mereka tidak beriman."
  }
]