[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "103-104. Sesungguhnya pada kisah Ibrahim benar-benar terkandung pelajaran penting bagi orang-orang yang mau mengambil pelajaran, tetapi kebanyakan orang-orang yang mendengar kisah ini tidak menjadi orang-orang yang beriman. Dan sesungguhnya Tuhanmu itu benar-benar Maha perkasa laagi Mahakuasa untuk melancarkan balasan terhadap orang-orang yang mendustakan, Maha Penyayang terhadap hamba-hambaNya yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Sesungguhnya pada apa yang disebutkan sebelumnya, berupa kisah Ibrahim -'alaihissalām- dan tempat kembalinya orang-orang yang mendustakan Allah, benar-benar terdapat pelajaran bagi yang mau mengambil pelajaran, akan tetapi kebanyakan mereka tidaklah beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103-104. Sungguh pada peristiwa orang-orang yang mendustakan yang tempat kembali mereka adalah neraka terdapat bukti yang jelas atas kekuasaan Allah untuk menegakkan perhitungan. Akan tetapi mayoritas manusia tidak beriman kepada Allah. Hai Rasulullah, Sungguh Tuhanmu Maha Perkasa dalam kerajaan-Nya dan Maha Pengasih kepada makhluk-makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Sesungguhnya dalam cerita Ibrahim beserta kaumnya itu ada pelajaran dan nasehat, namun kebanyakan orang di Mekah dan daerah lainnya itu tidak beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda, tetapi kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96-104 “mereka berkata,” maksudnya, adalah bala tentara iblis, para pemuja berhala dan patung-patung yang mereka sembah, “demi Allah, sungguh kita dahulu (di dunia) dalam kesesatan yang nyata, karena kita telah mempersamakan kamu dengan Rabb semesta alam,” dalam ibadah, mencintai, takut dan berharap. Dan kami berdoa kepada kalian sebagaimana kami berdoa kepadaNYa. Kesesatan mereka saat itu menjadi jelas bagi mereka. Mereka pun mengakui keadilan Allah dalam menghukum mereka, dan hukuman itu benar-benar tepat pada tempatnya. mereka tidak menyetarakan berhala-berhala itu dengan Allah, Rabb semesta alam kecuali dalam hal ibadah, bukan dalam hal menciptakan. Hal ini terbukti melalui ucapan mereka, “dengan Rabb semesta alam,” mereka mengakui bahwa Allah adalah Rabb semesta alam semuanya, yang termasuk di dalamnya adalah patung-patung dan semua berhala mereka. “dan tiadalah yang menyesatkan kami,” dari jalan hidayah dan kebenaran, dan mengajak kami kejalan kesesatan dan kefasikan, “kecuali orang-orang yang berdosa.” Mereka dalah para pemuka yang menyeru kepada api neraka. “maka kami tidak mempunyai,” pada saat itu, “pemberi syafaat seorangpun,” yang dapat memberikan syafaat kepada kami untuk menyelamatkan kami dari azabNya,”dan tidak pula mempunyai teman yang akrab,” maksudnya, seorang kerabat setia yang berguna bagi kami, sebagaimana biasanya dahulu di dunia. Lalu mereka berputus asa dari segala kebaikan dan bersedih hati terhadap apa yang telah mereka lakukan, dan mereka berangan-angan untuk kembali kedunia agar bisa melakukan amal shalih. “maka sekiranya kita dapat kembali sekali lagi,” maksudnya, bisa kembali kedunia,”niscaya kmai menjadi orang-orang yang beriman,” agar kami bisa selamat dari azab dan berhak mendapat pahala! Sama seklai tidak mungkin, sama sekali tidak mungkin! Apa yang mereka inginkan itu sudah tertutup dari mereka dan semua bentuk penggadaian sudah ditutup. “sesungguhnya yang pada demikian itu,” yaitu pada yang telah kami jelaskan kepada kalian dan kami uraikan, “benar-benar terdapat tanda-tanda,” bagi kalian, ”tetapi kebanyakan mereka tidak beriman,” sekalipun tanda-tanda (bukti-bukti kebenaran) itu diturunkan. “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Mahapenyayang,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 103: Allah kemudian menutup ayat ini dengan penjelasan bahwa pada kisah Ibrahim dan kaumnya serta dilemparkanya kaum musyrikin ke dalam jahannam, dan penyesalan mereka serta butuhnya mereka akan syafaat adalah sebagai tanda yang nyata atas kuasa Allah dan sebagai ibrah bagi mereka yang mengambil pelajaran. Dan dengan itu semua sungguh kebanyakan yang telah sampai ayat ini pada mereka, mereka tidak mengimani dan juga tidak membenarkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pada kisah Ibrahim dengan kaumnya, dan keadaan orang-orang kafir di akhirat. Meskipun ayat tersebut sudah disampaikan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 103",
    "description": "103. Sungguh, pada yang demikian itu yaitu pada kisah nabi ibrahim jika direnungkan dengan saksama, terdapat tanda kekuasaan Allah, tetapi kebanyakan mereka tidak beriman. 104. Dan sungguh, tuhanmu benar-benar dialah mahaperkasa, yang mampu mempercepat siksa-Nya, maha penyayang dengan mengakhirkan siksa sampai di akhirat nanti."
  }
]