[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "105-110. Kaum Nuh juga telah mendustakan risalah nabi mereka. Dengan tindakan ini, mereka mendustakan seluruh rasul. Sebab, setiap rasul itu memerintahkan untuk mengimani seluruh rasul. Ketika saudara mereka, Nuh berkata kepada mereka, “Mengapa kalian tidak bertakwa kepada Allah dengan menjauhi peribadatan terhadap selainNya? Sesungguhnya aku adalah seorang rasul yang dapat dipercaya dalam perkara yang aku sampaikan kepada kalian. Maka jadikanlah keimanan sebagai pelindung bagi kalian dari siksaan Allah, dan taatlah kepadaku dengan melaksanakan apa yang aku perintahkan kepada kalian, yaitu beribadah kepada Allah semata. Aku tidak meminta imbalan upah apa pun dari kalian atas penyampaian risalah ini; karena imbalan balasanku hanya kepada Allah, Tuhan semesta alam Yang bertindak terhadap semua makhlukNya. Karena itu waspadalah akan hukumanNya dan taatilah aku dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Kaum Nuh telah mendustakan para rasul tatkala mereka mendustakan nabi Nuh -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105-111. Kaum Nabi Nuh mendustakan seluruh rasul karena telah mendustakan Nabi Nuh, ketika dia berkata kepada mereka: “Tidakkah kalian takut azab Allah karena kalian telah menyembah berhala-berhala? Dan aku adalah rasul dari Allah yang diutus kepada kalian, dan aku jujur dalam menasehati kalian. Maka takutlah kalian dari azab Allah dan taatilah perintahku. Aku tidak meminta upah dari kalian atas dakwah yang aku sampaikan kepada kalian, dan balasanku hanya dari Allah Tuhan semesta alam; maka sekali lagi, takutlah dari azab Allah dan taatilah perintahku.” Namun mereka membalas dengan sombong: “Hai Nuh, apakah kami akan mempercayai dan menjadi pengikutmu; padahal para pengikutmu hanya orang-orang rendahan dari kalangan orang-orang miskin dan lemah?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Kaum Nuh telah mendustakan rasul mereka. Nabi Nuh digunakan untuk menyatakan banyak rasul karena barangsiapa mendustakan seorang rasul, maka sungguh dia telah mendustakan seluruh rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum Nuh telah mendustakan para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105-110 Allah menjelaskan pendustaan kaum nabi Nuh terhadap rasul mereka, yaitu Nuh, dan (menjelaskan) jawabannya terhadap mereka dan jawaban mereka terhadapnya, serta kesudahan semuanya, seraya berfiraman, ”kaum Nuh telah mendustakan para rasul,” semuanya. Sebab pendustaan mereka terhadap Nuh adalah sama dengan mendustakan semua rasul, karena mereka semua sepakat atas satu dakwah dan satu informasi. Maka mendustakan salah satunya sama dengan mendustakan semua kebenaran yang mereka bawa. Mereka telah mendustakannya. “ketika saudara mereka berkata kepada mereka,” maksudnya, saudara senasab, yaitu ,”Nuh,” sesungguhnya Allah hanya mengangkat para rasul itu dari nasab (keturunan, marga) kaum yang mana dia utus kepada mereka, agar mereka tidak merasa jijik (segan) untuk tunduk kepadanya karena sudah mengetahui hakikat jati dirinya, sehingga mereka tidak perlu mencarinya. Maka Nuh berkata kepada mereka dengan ucapan yang paling santun, sebagaimana cara para rasul lainnya, “mengapa kamu tidak bertakwa,” kepada Allah, lalu meninggalkan kebiasaan kalian menyembah berhala-berhala, dan memurnikan ibadah kepada Allah semata. “sesungguhnya aku adalah seorang rasul kepercayaan untuk kalian,” maka keberadaan sebagai utusan (rasul) yang diutus kepada mereka secara khusus mewajibkan mereka menerima apa saja yang diajarkan kepada mereka, beriman kepadanya dan bersyukur kepada Allah atas pengistimewaan yang dianugerahkan kepada mereka berupa seorang rasul yang mulia ini. Dan keberadaannya sebagai orang yang terpercaya itu berarti dia sama sekali tidak berdusta atas nama Allah, tidak menambah wahyuNya dan tidak pula menguranginya. Hal ini mengharuskan mereka untuk membenarkan semua khabar yang diberitakannya dan mematuhi semua perintah-perintahnya,”maka bertakwalah kepada Allah dan taatlah kepadaku,” dalam hal apa saja yang diperintahkan kepada kalian dan dia larang terhadap kalian. Inilah sebenarnya konsekuensi dari keberadaannya sebagai seorang rasul yang terpercaya yang diutus kepada mereka. Maka dari itun dia menyebutkan sebab akibatnya dengan huruf fa’ (pada ungkapan fattaqullah) yang menunjukan arti “sebab” lalu menyebutkan sebab yang mengharuskan kemudian menyebutkan tidak adanya penghalang seraya berfirman,”dan aku sekali-kali tidak minta upah kepadamu atas ajakan-ajakan itu,” sehingga akan membuat kalian terbebani dengan beban yang berat. “upahku tidak lain hanyalah dari Rabb semesta alam.” Aku berharap melalui seruan ini kedekatan dariNya dan pahala yang berlimpah. Adapun kalian, maka angan-angan dan puncak keinginanku dari kalian adalah memberi nasihat kepada kalian dan kalian mau menempuh jalan yang lurus. “maka bertakwalah kepada Allah dan taatlah kepadaku,” beliau mengulangi ungkapan ini karena beliau berulang-ulang mengajak kaumnya dank arena lamanya beliau dalam melakukan tugas ini, sebagaimana Allah berfirman, “lalu dia tinggal ditengah-tengah mereka seribu tahun kurang lima puluh tahun,”(al-ankabut:14) Dan, “Nuh berkata,’ya Rabbku, sesungguhnya kau telah menyeru kaumku malam dan siang, maka seruanku itu hanyalah menambah mereka lari (dari kebenaran)’.” (nuh:5-6)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 105: Allah mengabarkan akan kaum Nuh yang mendustakan dakwah Nabi mereka; Di mana Nuh menyeru kepada tauhid dan keimanan, akan tetapi mereka tidak menerimanya dan mengimaninya. Konsekuensinya adalah pengingkaran mereka kepada seluruh Nabi dan Rasul, di mana dakwah seluruh Nabi adalah satu, agama mereka satu, maka barangsiapa yang mengingkari salah satu dari mereka ia mengingkari keseluruhannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan pendustaan kaum Nuh kepada rasul mereka Nuh ‘alaihis salam, bantahan Beliau terhadap mereka dan bantahan mereka terhadap Beliau, serta akibat akhir dari masing-masing mereka. Kaum Nuh ‘alaihis salam dikatakan telah mendustakan para rasul meskipun yang diutus kepada mereka hanyalah Nabi Nuh ‘alaihis salam, karena yang diserukan Nabi Nuh dan para nabi yang lain adalah sama, yaitu mengajak kepada tauhid dan menjauhi syirk. Atau karena Nabi Nuh ‘alaihis salam tinggal lama di tengah-tengah mereka, sehingga Beliau meskipun sendiri seakan-akan seperti beberapa orang rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 105",
    "description": "105. Kaum nabi nuh telah mendustakan para rasul. Para rasul Allah adalah satu kesatuan yang tidak bisa dipisahkan antara satu dengan yang lain. Mendustakan satu rasul sama saja de-ngan mendustakan semua rasul. 106. Ketika saudara mereka yaitu nuh, saudara senegeri berkata kepada mereka, 'mengapa kamu tidak bertakwa' pertanyaan itu terlontar mengingat bahwa mereka adalah penyembah patung-patung wadd, suwa', yaghuts, yaghuts, dan nasr (lihat: surah: nuh: 23)."
  }
]