[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "105-110. Kaum Nuh juga telah mendustakan risalah nabi mereka. Dengan tindakan ini, mereka mendustakan seluruh rasul. Sebab, setiap rasul itu memerintahkan untuk mengimani seluruh rasul. Ketika saudara mereka, Nuh berkata kepada mereka, “Mengapa kalian tidak bertakwa kepada Allah dengan menjauhi peribadatan terhadap selainNya? Sesungguhnya aku adalah seorang rasul yang dapat dipercaya dalam perkara yang aku sampaikan kepada kalian. Maka jadikanlah keimanan sebagai pelindung bagi kalian dari siksaan Allah, dan taatlah kepadaku dengan melaksanakan apa yang aku perintahkan kepada kalian, yaitu beribadah kepada Allah semata. Aku tidak meminta imbalan upah apa pun dari kalian atas penyampaian risalah ini; karena imbalan balasanku hanya kepada Allah, Tuhan semesta alam Yang bertindak terhadap semua makhlukNya. Karena itu waspadalah akan hukumanNya dan taatilah aku dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Yaitu ketika Nuh berkata kepada mereka, \"Mengapa kalian tidak bertakwa kepada Allah dengan meninggalkan penyembahan kepada selain-Nya sebagai bentuk rasa takut kepada-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. إِذْ قَالَ لَهُمْ أَخُوهُمْ نُوحٌ (Ketika saudara mereka (Nuh) berkata kepada mereka) Yakni Nuh dan mereka memiliki nenek moyang yang sama, yakni Nuh berasal dari kabilah mereka; dan yang dimaksud bukan saudara mereka seagama. أَلَا تَتَّقُونَ(Mengapa kamu tidak bertakwa?) Yakni tidakkah kalian bertakwa kepada Allah dengan tidak menyembah berhala-berhala serta menjawab seruan Rasul-Nya yang diutus kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Ketika saudara mereka se-nasab dan sejenis (bukan saudara dalam agama), yaitu Nuh berkata kepada mereka: “Mengapa kalian tidak bertakwa kepada Allah dengan meninggalkan penyembahan berhala dan beriman kepada Allah dan rasulNya?!” {Alaa} adalah huruf yang memberi motivasi untuk melakukan sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika saudara mereka, Nuh, berkata kepada mereka,“Mengapa kalian tidak bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105-110 Allah menjelaskan pendustaan kaum nabi Nuh terhadap rasul mereka, yaitu Nuh, dan (menjelaskan) jawabannya terhadap mereka dan jawaban mereka terhadapnya, serta kesudahan semuanya, seraya berfiraman, ”kaum Nuh telah mendustakan para rasul,” semuanya. Sebab pendustaan mereka terhadap Nuh adalah sama dengan mendustakan semua rasul, karena mereka semua sepakat atas satu dakwah dan satu informasi. Maka mendustakan salah satunya sama dengan mendustakan semua kebenaran yang mereka bawa. Mereka telah mendustakannya. “ketika saudara mereka berkata kepada mereka,” maksudnya, saudara senasab, yaitu ,”Nuh,” sesungguhnya Allah hanya mengangkat para rasul itu dari nasab (keturunan, marga) kaum yang mana dia utus kepada mereka, agar mereka tidak merasa jijik (segan) untuk tunduk kepadanya karena sudah mengetahui hakikat jati dirinya, sehingga mereka tidak perlu mencarinya. Maka Nuh berkata kepada mereka dengan ucapan yang paling santun, sebagaimana cara para rasul lainnya, “mengapa kamu tidak bertakwa,” kepada Allah, lalu meninggalkan kebiasaan kalian menyembah berhala-berhala, dan memurnikan ibadah kepada Allah semata. “sesungguhnya aku adalah seorang rasul kepercayaan untuk kalian,” maka keberadaan sebagai utusan (rasul) yang diutus kepada mereka secara khusus mewajibkan mereka menerima apa saja yang diajarkan kepada mereka, beriman kepadanya dan bersyukur kepada Allah atas pengistimewaan yang dianugerahkan kepada mereka berupa seorang rasul yang mulia ini. Dan keberadaannya sebagai orang yang terpercaya itu berarti dia sama sekali tidak berdusta atas nama Allah, tidak menambah wahyuNya dan tidak pula menguranginya. Hal ini mengharuskan mereka untuk membenarkan semua khabar yang diberitakannya dan mematuhi semua perintah-perintahnya,”maka bertakwalah kepada Allah dan taatlah kepadaku,” dalam hal apa saja yang diperintahkan kepada kalian dan dia larang terhadap kalian. Inilah sebenarnya konsekuensi dari keberadaannya sebagai seorang rasul yang terpercaya yang diutus kepada mereka. Maka dari itun dia menyebutkan sebab akibatnya dengan huruf fa’ (pada ungkapan fattaqullah) yang menunjukan arti “sebab” lalu menyebutkan sebab yang mengharuskan kemudian menyebutkan tidak adanya penghalang seraya berfirman,”dan aku sekali-kali tidak minta upah kepadamu atas ajakan-ajakan itu,” sehingga akan membuat kalian terbebani dengan beban yang berat. “upahku tidak lain hanyalah dari Rabb semesta alam.” Aku berharap melalui seruan ini kedekatan dariNya dan pahala yang berlimpah. Adapun kalian, maka angan-angan dan puncak keinginanku dari kalian adalah memberi nasihat kepada kalian dan kalian mau menempuh jalan yang lurus. “maka bertakwalah kepada Allah dan taatlah kepadaku,” beliau mengulangi ungkapan ini karena beliau berulang-ulang mengajak kaumnya dank arena lamanya beliau dalam melakukan tugas ini, sebagaimana Allah berfirman, “lalu dia tinggal ditengah-tengah mereka seribu tahun kurang lima puluh tahun,”(al-ankabut:14) Dan, “Nuh berkata,’ya Rabbku, sesungguhnya kau telah menyeru kaumku malam dan siang, maka seruanku itu hanyalah menambah mereka lari (dari kebenaran)’.” (nuh:5-6)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 106: 106-108. Kemudian berkata Nabi mereka (Nuh) kepada mereka : Tidakkah kalian bertaqwa kepada Allah dan takut pada adzab-Nya karena sebab kesyirikan dan ibadah kalian kepada selain-Nya ? Nuh melanjutkan dengan berkata : Sungguh Allah telah mengkhususkan aku sebagai utusan kepada kalian, dan aku adalah orang terpercaya yang menyampaikan kerisalah dari Tuhanku, maka aku tidaklah mengada-ngada dari diriku sendiri. Bertaqwalah kepada Allah dan berimanlah kepada-Nya, taatilah apa yang kalian telah diseru dari ketauhidan dan jauhilah kesyirikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni senasab. Allah Subhaanahu wa Ta'aala mengutus rasul yang sama nasabnya dengan kaumnya agar mereka tidak merasa risih mengikutinya, dan karena mereka mengetahui siapa Beliau, sehingga tidak perlu mengkaji lebih lanjut tentang pribadinya. Kepada Allah; dengan meninggalkan sesembahan yang selama ini kamu sembah dan hanya menyembah kepada Allah saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 106",
    "description": "106. Ketika saudara mereka yaitu nuh, saudara senegeri berkata kepada mereka, 'mengapa kamu tidak bertakwa' pertanyaan itu terlontar mengingat bahwa mereka adalah penyembah patung-patung wadd, suwa', yaghuts, yaghuts, dan nasr (lihat: surah: nuh: 23). 107. \"sesungguhnya aku ini seorang rasul kepercayaan yang diutus kepada-Mu, untuk menyampaikan pesan-pesan tuhanku kepadamu. \"."
  }
]