[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Dan beritakanlah (wahai Rasul) kepada kaummu ketika Tuhanmu menyeru Musa, “Datangilah Kaum yang berbuat kezhaliman, yaitu kaum Fir’aun. Dan katakanlah kepada mereka, tidakkah mereka itu takut terhadap hukuman Allah dan mau meninggalkan apa yang ada pada mereka berupa kekafiran dan kesesatan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Mereka itu kaum Fir'aun, agar dia (Nabi Musa) memerintahkan mereka secara lemah lembut dan baik-baik untuk bertakwa kepada Allah dengan cara mengerjakan perintah dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Mereka itu adalah Fir’aun dan kaumnya. Apakah mereka tidak takut terhadap hukuman Allah atas kekufuran dan kedzaliman mereka?! Katakanlah kepada mereka: “Bertakwalah kepada Allah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum Fir‘aun. Mengapa mereka tidak bertakwa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11 dan ingatlah keadaan yang sangat mulia pada waktu Allah menyeru Nabi Musa saat Dia berbicara langsung kepadanya, mengangkatnya sebagi nabi dan mengutusnya, seraya berfirman, ”datangilah kaum yang zhalim itu,” yaitu orang-orang yang menyombongkan diri di muka bumi ini dan semena-mena terhadap penghuninya, dan pembesar mereka mengklaim sebagai tuhan “(yaitu) kaum fir’aun, ‘mengapa mereka tidak bertakwa?” maksudnya, katakan kepada mereka dengan perkataan yang lembut dan ungkapan yang lunak; mengapa kalian tidak bertakwa kepada Allah yang telah menciptakan kalian dan memberi kalian rizki, kemudian kalian meninggalkan kekafiran yang kalian anut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 11: 10-11. Ingatkanlah wahai Nabi Allah kaummu akan kisah Musa bersama dengan fir’aun dan kaumnya yang pendosa, di mana Allah menyeru Musa di samping kanan gunung thur, dan Ia memerintahkan untuk datang kepada kaum yang dzalim. Yaitu kaum fir’aun dan Musa diperintahkan untuk berkata kepada mereka : Tidakkah kalian takut Allah menimpakan adzab yang pedih dengan sebab kekafiran dan kesesatan kalian yang nyata. Dan Musa mengetahu akan kesombongan dan melampaui batasnya fir’aun; Di mana Musa telah hidup di awal-awal kelahirannya di istananya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka menzalimi diri mereka dengan kafir kepada Allah, dan menzalimi Bani Israil dengan memperbudak mereka. Maksudnya, katakanlah kepada mereka dengan kata-kata yang lembut dan halus, “Mengapa kamu tidak bertakwa?” yakni kepada Allah yang telah menciptakan kamu dan memberimu rezeki dengan meninggalkan kekafiran yang selama ini kamu lakukan. Dengan mentauhidkan-Nya dan menaati-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 11",
    "description": "\"yaitu kaum fir'aun di mesir. Datangilah mereka hai musa, dan tanyalah me-reka mengapa mereka tidak bertakwa kepada Allah dengan melaksanakan semua perintah-Nya dan menjauhi larangan-Nya'\"12. Setelah mendengar perintah dari Allah, dia yakni nabi musa berkata, 'ya tuhanku yang memelihara diriku, aku tahu kezaliman mereka perilaku dan sifat mereka yang sangat buruk. Oleh karena itu sungguh, aku takut mereka akan mendustakan aku ketika aku menyampaikan pesan-pesan-Mu. \"."
  }
]