[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaumnya berkata kepadanya, “Apakah kami akan beriman kepadamu dan mengikuti kamu, sedangkan orang-orang yang mengikuti kamu adalah orang-orang hina dan rendahan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Kaumnya berkata kepadanya, \"Apakah kami akan beriman kepadamu -wahai Nuh- dan mengikuti serta mengamalkan apa yang engkau bawa, padahal faktanya yang mengikutmu hanyalah orang-orang yang hina, dan tidak ada di antara mereka seorang pemuka dan pemilik kemuliaan pun?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. قَالُوٓا۟ أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الْأَرْذَلُونَ (Mereka berkata: “Apakah kami akan beriman kepadamu, padahal yang mengikuti kamu ialah orang-orang yang hina?”) Mereka meremehkan para pengikutnya karena mereka tidak memiliki harta dan kedudukan atau karena nasab mereka yang rendah. Pendapat lain mengatakan, yakni karena mereka memiliki pekerjaan rendahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Kaum Nuh berkata: “Bagaimana bisa kami mengikuti dan membenarkanmu, padahal yang mengikutimu adalah orang-orang rendahan dari golongan orang fakir, orang lemah dan para pengrajin?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah kami harus beriman kepadamu, dan yang mengikutimu adalah orang-orang hina”} orang-orang yang lemah nasab dan tempat tinggalnya di antara orang-orang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111 maka mereka berkata sebagai jawaban terhadap dakwahnya dan penolakan terhadapnya dengan sesuatu yang tidak layak untuk dijadikan sebagai penolakan, ”apakah kami akan beriman kepadamu, padahal yang mengikuti kamu oalah orang-orang hina?” maksudnya, bagaimana mungkin kami akan mengikutimu sedangkan kami tidak melihat para pengikutmu melainkan orang-orang hina, rendah dan samaph masyarakat. Dengan ini dapat diketahui kesombongan mereka terhadap kebenaran dan kebodohan mereka terhadap kenyataan. Sebab, sesungguhnya kalau saja tujuan mereka adalah kebenaran tentu mereka akan mengatakan, (kalau seandainya memiliki rasa ketidakjelasan dan keraguan terhadap dakwahnya), ”jelaskanlah kepada kami kebenaran apa yang engkau ajarkan ini dengan cara-cara yang bisa mengantarkan kepadanya!” kalau seandainya mereka mengamati dengan sebenar-benarnya, tentu mereka mengetahui bahwa para pengikutnya adalah orang-orang yang mulia, sebaik-baik manusia, orang-orang yang memiliki akal yang matang dan akhlak mulia, dan bahwa sebenarnya orang-orang yang hina adalah mereka yang fungsi akalnya dicabut hingaa menganggap baik penyembahan terhadap batu-batu, rela sujud dan berdoa kepadnya, serta enggan tunduk kepada dakwah para rasul yang mulia. Hanya dengan (mengetahui tema) pembicaraan batil yang diungkapkan oleh salah satu dari dua pendebat itu, maka sangat mudah diketahui rusaknya pembicaraan itu, dan akal sudah bisa memastikan kebenaran kliam lawannya. Maka tatkala kita telah mendengar tentang kaum Nuh, yaitu bahwa mereka telah berkata di dalam penolakan mereka terhadap dakwah Nuh, “apakah kami akan beriman kepadamu, padahal yang mengikuti kamu ialah orang-orang hina?” di mana mereka berpegang kepada prinsip yang setiap orang mengetahui ketidakbenarannya dalam penolakannya terahadp dakwah Nuh, maka kita dapat mengetahui bahwa mereka adalah orang-orang sesat lagi salah, sekalipun kita belum menyaksikan bukti-bukti (mukjizat) dari Nuh dan dakwahnya yang mengindikasikan kepastian dan keyakinan akan kejujurannya dan kebenaran ajaran yang dibawanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 111: Mereka (kaum Nuh) menjawab : Apakah kami harus beriman kepadamu dan membenarkanmu serta mengikutimu ?, Sungguh mengikutimu adalah kehinaan manusia dan kemiskinan bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni membantah Beliau dan menentang dengan penentangan yang tidak cocok dipakai untuk menentang. Dari sini diketahui kesombongan mereka, bodohnya mereka terhadap hakikat yang sebenarnya, karena jika maksud mereka adalah mencari yang hak, tentu mereka akan berkata –jika mereka masih meragukan tentang dakwah Beliau-, “Terangkanlah kepada kami kebenaran yang engkau bawa dengan sarana-sarana yang dapat membuktikannya!” Padahal jika mereka memperhatikan dengan seksama, tentu mereka akan mengetahui bahwa para pengikutnya adalah orang-orang yang mulia, manusia-manusia pilihan, berakal cerdas, dan berakhlak tinggi, dan bahwa orang yang hina adalah orang yang mencabut fungsi akalnya, sehingga menganggap baik menyembah batu, ridha sujud kepada yang lebih lemah darinya dan berdoa kepada yang tidak mampu berbuat apa-apa, serta menolak seruan para rasul; insane yang kamil (manusia yang sempurna). Bahkan dengan memperhatikan ucapan mereka ini, “Apakah kami harus beriman kepadamu, padahal pengikut-pengikutmu adalah orang-orang yang hina?” sudah dapat diketahui batilnya bantahan mereka, dan bahwa mereka adalah orang-orang yang sesat dan salah meskipun kita tidak melihat ayat-ayat yang lain yang menunjukkan kebenaran Nabi Nuh ‘alaihis salam dan kebenaran yang Beliau bawa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 111",
    "description": "111. Mereka berkata, 'apakah kami harus beriman kepadamu, padahal pengikut-pengikutmu orang-orang yang hina'' pengikut nabi nuh ba-Nyak dari golongan rakyat jelata, karena merekalah yang banyak terzalimi dari sistem yang ada, bukan dari kalangan bangsawan yang senang dengan kedudukan mereka. Begitulah mereka melihat persoalan bukan dari ajarannya tapi dari orang yang mengikuti ajaran itu. 112. Mendengar ejekan kaumnya, dia, yakni nabi nuh, menjawab, 'tidak ada pengetahuanku tentang apa yang mereka orang-orang yang hina dina itu kerjakan. Aku hanya mengetahui hal-hal yang lahir saja dari mereka saja."
  }
]