[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nuh menjawab mereka dengan berucap, “aku tidaklah dibebani untuk mengetahui amal perbuatan mereka. Sesungguhnya aku hanya diserahi tanggung jawab untuk menyeru mereka menuju keimanan. Dan perhitungan itu berdasar keimanan, bukan dengan kedudukan, keturunan , keahlian maupun karya-karya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Nuh -'alaihissalām- lalu berkata kepada mereka, \"Bagaimana aku mengetahui apa yang dikerjakan oleh orang-orang beriman itu? Aku bukanlah pengurus urusan mereka dengan menghitung segala amalan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112-115. Maha Nuh menjawab: “Apa urusanku dengan pekerjaan mereka dan rahasia hati mereka? Rahasia dan pekerjaan mereka hanya Allah yang akan memperhitungkannya, seandainya kalian mengetahui hal itu. Dan aku tidak akan mengusir orang-orang yang beriman kepadaku dari majelisku. Aku hanyalah seorang rasul yang diutus Allah untuk memberi peringatan kepada para hamba dengan hujjah yang jelas.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. قَالَ وَمَا عِلْمِى بِمَا كَانُوا۟ يَعْمَلُونَ (Nuh menjawab: “Bagaimana aku mengetahui apa yang telah mereka kerjakan?) Yakni aku tidak dituntut untuk mengetahui pekerjaan mereka, namun aku hanya dituntut untuk menyeru mereka kepada keimanan dan memandang hal itu, bukan untuk memandang pekerjaan, kemiskinan, atau kekayaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112. Nuh menjawab: \"Bagaimana aku mengetahui apa yang telah mereka kerjakan?”, sesungguhnya aku tidak diberi tanggung jawab untuk memeriksa perbuatan zahir maupun batin mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menjawab} Nuh menjawab {“Apa pengetahuanku tentang apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112-115 lalu Nuh menjawab, ”bagaimana aku mengetahui apa yang telah mereka kerjakan? Perhitungan (amal perbuatan) mereka tidak lain hanyalah kepada Rabbku, kalau kamu menyadari,” maksudnya, amal perbuatan mereka dan perhitungannya adalah tanggung jawab Allah, sedangkan kewajibanku hanyalah menyampaikan (tabligh), dan biarkanlah mereka (jangan mencampuri urusan mereka). Jika ajaran yang aku bawa ini yang benar, maka tunduklah kepadanya, dan masing-masing mempunyai amal sendiri-sendiri. “dan aku tidak akan sekali-seklai mengusir orang-orang yang beriman,” seakan-akan mereka, (semoga Allah memperburuk mereka), menuntut kepada Nuh agar mengusir orang-orang yang beriman itu karena kesombongan dan kecongkakan mereka (kaum yang tidak beriman) agar mereka mau beriamn. Maka Nuh mengatakan,”dan aku sekali-kali tidak akan mengusir orang-orang yang beriman,” sebab mereka tidak berhak diusir dan dihina, melainkan mereka lebih berhak dihormati, baik dengan perkataan maupun perbuatan, sebagaimana difirmankan oleh Allah, \"Apabila orang-orang yang beriman kepada ayat-ayat Kami itu datang kepadamu, maka katakanlah,’semoga kesejahteraan terlimpahkan kepadamu.’ Rabbmu telah menetapkan atas diriNya kasih sayang,” (al-an’am:54) “tidaklah aku (ini) melainkan pemberi peringatan yang menjelaskan,” maksudnya, aku ini hanyalah seorang pemberi peringatan dan penyampai drai Allah dan seorang yang bersungguh-sungguh di dalam memberikan nasihat kepada manusia, dan aku tidak sama sekali tidak memilki urusan sedikitpun, karena sesungguhnya urusannya adalah milik Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 112: Nuh berkata kepada mereka : Sesungguhnya aku telah diberikan amanah untuk berdakwah kepada manusia kepada tauhid, dan aku tidaklah diberikan beban mengetahui amalan-amalan mereka, kesesatan-kesesatan mereka dan karya-karya mereka dan selainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 112",
    "description": "112. Mendengar ejekan kaumnya, dia, yakni nabi nuh, menjawab, 'tidak ada pengetahuanku tentang apa yang mereka orang-orang yang hina dina itu kerjakan. Aku hanya mengetahui hal-hal yang lahir saja dari mereka saja. 113. Perhitungan amal perbuatan mereka tidak lain hanyalah kepada tuhanku, karena tuhanku yang mengetahui secara hakiki niat dari perbuatan mereka, jika kamu menyadari terhadap apa yang aku katakan. Semestinya kamu memahami persoalan ini dengan akal sehatmu."
  }
]