[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "114-115. Dan aku tidak akan mengusir orang-orang yang mengimani dakwahku, apa pun kondisi mereka, demi menyambut keinginan kalian agar kalian mau beriman kepadaku. Dan aku tidak lain hanyalah pemberi peringatan dengan peringatan yang jelas.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Aku ini tidak lain hanyalah pemberi peringatan yang nyata peringatannya, aku memperingatkan kalian akan azab Allah\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. إِنْ أَنَا۠ إِلَّا نَذِيرٌ مُّبِينٌ (Aku (ini) tidak lain melainkan pemberi peringatan yang menjelaskan”) Yakni aku hanya pemberi peringatan dan penjelasan atas risalah yang Allah perintahkan kepadaku untuk menyampaikannya, dan orang-orang beriman itu adalah bagian dari orang-orang yang wajib aku peringatkan, maka bagaimana aku akan mengusir mereka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Aku ini hanya pemberi peringatan, yang menjelaskan tentang peringatan kepada manusia. Syarif dan wadli’ bermakna sama yaitu mulia\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak lain, kecuali pemberi peringatan yang jelas”} yang jelas peringatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112-115 lalu Nuh menjawab, ”bagaimana aku mengetahui apa yang telah mereka kerjakan? Perhitungan (amal perbuatan) mereka tidak lain hanyalah kepada Rabbku, kalau kamu menyadari,” maksudnya, amal perbuatan mereka dan perhitungannya adalah tanggung jawab Allah, sedangkan kewajibanku hanyalah menyampaikan (tabligh), dan biarkanlah mereka (jangan mencampuri urusan mereka). Jika ajaran yang aku bawa ini yang benar, maka tunduklah kepadanya, dan masing-masing mempunyai amal sendiri-sendiri. “dan aku tidak akan sekali-seklai mengusir orang-orang yang beriman,” seakan-akan mereka, (semoga Allah memperburuk mereka), menuntut kepada Nuh agar mengusir orang-orang yang beriman itu karena kesombongan dan kecongkakan mereka (kaum yang tidak beriman) agar mereka mau beriamn. Maka Nuh mengatakan,”dan aku sekali-kali tidak akan mengusir orang-orang yang beriman,” sebab mereka tidak berhak diusir dan dihina, melainkan mereka lebih berhak dihormati, baik dengan perkataan maupun perbuatan, sebagaimana difirmankan oleh Allah, \"Apabila orang-orang yang beriman kepada ayat-ayat Kami itu datang kepadamu, maka katakanlah,’semoga kesejahteraan terlimpahkan kepadamu.’ Rabbmu telah menetapkan atas diriNya kasih sayang,” (al-an’am:54) “tidaklah aku (ini) melainkan pemberi peringatan yang menjelaskan,” maksudnya, aku ini hanyalah seorang pemberi peringatan dan penyampai drai Allah dan seorang yang bersungguh-sungguh di dalam memberikan nasihat kepada manusia, dan aku tidak sama sekali tidak memilki urusan sedikitpun, karena sesungguhnya urusannya adalah milik Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 115: Berkata Nuh : Tidaklah aku kecuali hanyalah pemberi peringatan yang menjelaskan kepada kalian, menyampaikan kepada kalian dari Allah, dan aku bersungguh-sungguh atas hal itu, dan segala urusannya ada pada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni aku tidak lain hanyalah pemberi peringatan dan penyampai dari Allah serta berusaha memberikan nasehat kepada manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 115",
    "description": "115. Aku, nabi nuh, ini hanyalah pemberi peringatan yang jelas terhadap mereka yang selalu berdusta kepadaku, bahwa nasib mereka pastilah akan jelek. 116. Mendengar jawaban nabi nuh yang demikian tegas dan masuk akal, kaumnya mengintimidasinya. Mereka berkata, 'wahai nuh! sungguh, jika engkau tidak mau berhenti dari ajakanmu, niscaya engkau termasuk orang yang dirajam yaitu dilempari batu sampai mati. ' demikianlah sikap orang-orang zalim pada setiap zaman. Mereka akan menggunakan kekuatan jika kalah dalam adu argumentasi. Mendengar ancaman kaumnya, nabi nuh mengadu kepada tuhannya:."
  }
]