[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "117-118. Maka Tatkala Nuh mendengar perkataan mereka, dia berdoa kepada Tuhannya dengan mengucapkan, “Wahai Tuhanku, sesungguhnya kaumku tetap terus mendustakanku. Maka adakanlah suatu keputusan antara aku dengan mereka dengan ketetapan yang mana Engkau akan membinasakan dengannya orang yang mengingkari keesaanMu dan mendustakan RasulMu. Dan selamatkanlah aku dan orang-orang yang bersamaku dari kaum Mukminin dari siksaan yang Engkau lancarkan kepadaa kaum kafir.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Nuh berdoa kepada Tuhannya, \"Wahai Tuhanku! Sesungguhnya kaumku telah mendustakan aku, dan sama sekali tidak membenarkanku terkait apa yang aku bawa dari sisi-Mu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117-120. Maka Nuh bersimpuh kepada Tuhannya dengan berdoa: “Ya Tuhanku, kaumku terus menerus mendustakanku, maka berilah keputusan antara diriku dengan mereka dengan keputusan yang menjadikan-Mu menolong kebenaran dan menghancurkan kebatilan. Dan selamatkanlah aku dan orang-orang beriman yang bersamaku dari siksaan yang Engkau timpakan kepada orang-orang kafir.” Maka Kami mengabulkan doanya, dan Kami selamatkan dia dan para pengikutnya ke dalam perahu yang penuh dengan barang dan hewan-hewan; kemudian Kami binasakan orang-orang kafir dengan menenggelamkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Nuh berkata: \"Ya Tuhanku, sesungguhnya kaumku telah mendustakan dan menolak ajakanku;”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata, “Wahai Tuhanku, sesungguhnya kaumku telah mendustakanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117-118 sudah tidak diragukan lagi tatkala kezhaliman mereka memuncak dan kekufuran mereka semakin dahsyat, maka Nabi mereka mendoakan mereka dengan suatu doa yang pasti menimpa mereka, seraya berkata, “Ya Rabbku, janganlah Engkau biarkan seorangpun diantara orang-orang kafir itu tinggal diatas bumi,”(nuh:26) Sedangkan di sini dia mengatakan,”Ya Rabbku, sesungguhnya kaumku telah mendustakan aku; maka itu adakanlah suatu keputusan anataku dan antara mereka,” maksudnya, binasakanlah orang yang membangkang kami, sedangkan dia tahu bahwa mereka adalah para pembangkang yang zhalim, maka dari itu dia berkata, “dan selamatkanlah aku dan orang-orang yang beriman besertaku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 117: 117-118. Maka Nuh mengeluhkan kepada Rabbnya, Rabb semesta alam : Wahai Rabbku sungguh kaumku mendustakanku dan tidak membenarkanku serta tidak beriman kepadaku, maka timpakanlah hukuman pada mereka dengan adzab yang membinasakan atas mereka yang dzalim dan berbuat kebathilan kepada kami, dan selamatkanlah kami wahai Rabbku bersama dengan mereka yang beriman kepadaku dan membenarkanku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 117",
    "description": "117. Dia, nabi nuh, berkata, 'ya tuhanku sungguh kaumku telah mendustakan aku. Mereka telah memilih jalan kesesatan, padahal aku, se-suai dengan perintah-Mu, telah mengajak mereka dengan baik-baik, siang dan malam, selama ratusan tahun, untuk kembali ke jalan-Mu. \"118. \"maka berilah keputusan antara aku dengan mereka wahai tuhanku, di tangan-Mu-lah nasib mereka dan aku memohon kepada-Mu, selamatkanlah aku dan mereka yang beriman bersamaku dari siksaan-Mu yang akan engkau timpakan kepada kaumku. \"."
  }
]