[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "117-118. Maka Tatkala Nuh mendengar perkataan mereka, dia berdoa kepada Tuhannya dengan mengucapkan, “Wahai Tuhanku, sesungguhnya kaumku tetap terus mendustakanku. Maka adakanlah suatu keputusan antara aku dengan mereka dengan ketetapan yang mana Engkau akan membinasakan dengannya orang yang mengingkari keesaanMu dan mendustakan RasulMu. Dan selamatkanlah aku dan orang-orang yang bersamaku dari kaum Mukminin dari siksaan yang Engkau lancarkan kepadaa kaum kafir.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Maka dari itu, ambillah keputusan antara diriku dan mereka, yang mana keputusan itu akan membinasakan mereka lantaran bersikeras di atas kebatilan, dan selamatkanlah aku serta orang-orang mukmin yang bersamaku dari azab yang menimpa orang-orang kafir dari kaumku\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. فَافْتَحْ بَيْنِى وَبَيْنَهُمْ فَتْحًا (maka itu adakanlah suatu keputusan antaraku dan antara mereka) Makna (الفتح) adalah keputusan hakim pada perkara antara dua pihak yang berselisih. Yakni putuskanlah antara aku dan mereka dengan putusan yang menunjukkan siapa yang benar dan siapa yang salah. وَنَجِّنِى وَمَن مَّعِىَ مِنَ الْمُؤْمِنِينَ (dan selamatkanlah aku dan orang-orang yang mukmin besertaku) Setelah ia berdoa dengan doa ini, Allah mengabulkan doanya yang ditunjukkan dalam firman-Nya: فَأَنجَيْنٰهُ وَمَن مَّعَهُۥ فِى الْفُلْكِ الْمَشْحُونِ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118. “Maka dari itu Tuhanku, buatlah sebuah keputusan antara aku dan mereka yang bisa menunjukkan mana yang benar dan yang batil. Selamatkanlah aku beserta orang-orang yang mukmin. Hancurkanlah orang-orang yang mendustakan rasul-Mu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berilah keputusan} berilah putusan {antara aku dan mereka dengan suatu putusan} putusan {dan selamatkanlah aku dan orang-orang mukmin yang bersamaku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117-118 sudah tidak diragukan lagi tatkala kezhaliman mereka memuncak dan kekufuran mereka semakin dahsyat, maka Nabi mereka mendoakan mereka dengan suatu doa yang pasti menimpa mereka, seraya berkata, “Ya Rabbku, janganlah Engkau biarkan seorangpun diantara orang-orang kafir itu tinggal diatas bumi,”(nuh:26) Sedangkan di sini dia mengatakan,”Ya Rabbku, sesungguhnya kaumku telah mendustakan aku; maka itu adakanlah suatu keputusan anataku dan antara mereka,” maksudnya, binasakanlah orang yang membangkang kami, sedangkan dia tahu bahwa mereka adalah para pembangkang yang zhalim, maka dari itu dia berkata, “dan selamatkanlah aku dan orang-orang yang beriman besertaku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 118: 117-118. Maka Nuh mengeluhkan kepada Rabbnya, Rabb semesta alam : Wahai Rabbku sungguh kaumku mendustakanku dan tidak membenarkanku serta tidak beriman kepadaku, maka timpakanlah hukuman pada mereka dengan adzab yang membinasakan atas mereka yang dzalim dan berbuat kebathilan kepada kami, dan selamatkanlah kami wahai Rabbku bersama dengan mereka yang beriman kepadaku dan membenarkanku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 118",
    "description": "118. \"maka berilah keputusan antara aku dengan mereka wahai tuhanku, di tangan-Mu-lah nasib mereka dan aku memohon kepada-Mu, selamatkanlah aku dan mereka yang beriman bersamaku dari siksaan-Mu yang akan engkau timpakan kepada kaumku. \"119. Allah pun mengabulkan doa nabi nuh. Kemudian kami menyelamatkannya yakni nuh dan orang-orang yang bersamanya di dalam kapal yang penuh muatan yaitu berupa kebutuhan pokok mereka."
  }
]