[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami menyelamatkannya dan orang-orang yang bersamanya di dalam kapal yang penuh dengan muatan dengan berbagai macam makhluk yang dibawanya bersamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Maka Kami pun memenuhi permohonannya, dan menyelamatkan dirinya dan orang-orang mukmin yang menyertainya di dalam kapal yang penuh muatan manusia dan hewan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. فَأَنجَيْنٰهُ وَمَن مَّعَهُۥ فِى الْفُلْكِ الْمَشْحُونِ (Maka Kami selamatkan Nuh dan orang-orang yang besertanya di dalam kapal yang penuh muatan) Yakni perahu yang bermuatan penuh. Makna (الشحن) adalah muatan perahu, baik itu manusia, hewan, maupun barang-barang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119. Maka Kami kabulkan doa Nuh, dan menyelamatkan Nuh dan orang-orang yang bersamanya di dalam kapal yang penuh muatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menyelamatkan dia dan orang-orang yang bersamanya di dalam kapal yang penuh muatan} yang dipenuhi dengan manusia, hewan dan barang-barang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119-122 “maka kami selamatkan Nuh dan orang-orang yang besertanya di dalam bahtera,” maksudnya, kapal; “yang penuh muatan,” yang terdiri dari manusia dan berbagai macam hewan. “kemudian sesudah itu kami tenggelamkan sesudahnya,” maksudnya, setelah Nuh dan orang-orang yang beriman bersamanya, “orang-orang yang tinggal.” Maksudnya, kami menenggelamkan seluruh kaumnya. “sesungguhnya pada yang demikian itu.” Maksudnya, pada keselamatan Nuh dan para pengikutnya dan kebinasaan orang-orang yang mendustakannya, “benar-benar terdapat tanda,” yang membuktikan kebenaran para rasul Kami dan kebenaran ajaran yang mereka bawa dan kebatilan yang dianut oleh musuh-musuh mereka yang mendustakan itu. “dan sesungguhnya Rabbmu, Dia-lah Yang Mahaperkasa,” yang melumpuhkan musuh-musuhNya dengan keperkasaanNya, sehingga Dia menenggelamkannya dengan badai topan. “lagi Maha penyayang,” kepada para waliNya (orang-orang yang setia kepadaNya), di mana Dia telah menyelamatkan Nuh beserta orang-orang yang bersamanya dari kaum yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 119: Maka Allah mengabulkan doa Nuh, dengan menyelamatkannya dan yang bersamanya di dalam kapal yang telah ia buat berdasarkan wahyu dari Allah dan yang di dalamnya terisi dengan manusia, makhluk yang melata di bumi serta para binatang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang terdiri dari manusia, hewan dan burung-burung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 119",
    "description": "119. Allah pun mengabulkan doa nabi nuh. Kemudian kami menyelamatkannya yakni nuh dan orang-orang yang bersamanya di dalam kapal yang penuh muatan yaitu berupa kebutuhan pokok mereka. 120. Kemudian setelah penyelamatan itu, kami tenggelamkan orang-orang yang tinggal yaitu mereka yang durhaka."
  }
]