[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dalam kisah Nuh dan peristiwa diselamatkannya kaum Mukminin dan dibinasakannya kaum yang mendustakan, terdapat bukti petunjuk dan pelajaran penting bagi orang-orang setelah mereka. Namun, tidaklah kebanyakan orang-orang yang mendengar kisah ini menjadi beriman kepada Allah dan RasulNya, serta ajaran syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Sesungguhnya pada yang disebutkan itu, berupa kisah Nuh dan kaumnya, selamatnya Nuh beserta orang-orang mukmin yang bersamanya, serta binasanya orang-orang kafir dari kalangan kaumnya; benar-benar terdapat pelajaran bagi yang ingin memetik pelajaran darinya, akan tetapi kebanyakan mereka tidaklah beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "121-122. Sungguh pada peristiwa penenggelaman dan penyelamatan itu terdapat ibrah yang besar; akan tetapi mayoritas yang mendengar kisah ini tetap tidak beriman kepada Allah dan rasul-Nya. Hai Rasulullah, Sungguh Tuhanmu Maha Perkasa dalam membalas perbuatan orang-orang yang mendustakan dan Maha Pengasih bagi orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121. Sesungguhnya, dalam kisah itu benar-benar terdapat pelajaran dan hikmah bagi orang-orang yang mau berfikir, tetapi kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya pada yang demikian itu benar-benar terdapat tanda, tetapi kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119-122 “maka kami selamatkan Nuh dan orang-orang yang besertanya di dalam bahtera,” maksudnya, kapal; “yang penuh muatan,” yang terdiri dari manusia dan berbagai macam hewan. “kemudian sesudah itu kami tenggelamkan sesudahnya,” maksudnya, setelah Nuh dan orang-orang yang beriman bersamanya, “orang-orang yang tinggal.” Maksudnya, kami menenggelamkan seluruh kaumnya. “sesungguhnya pada yang demikian itu.” Maksudnya, pada keselamatan Nuh dan para pengikutnya dan kebinasaan orang-orang yang mendustakannya, “benar-benar terdapat tanda,” yang membuktikan kebenaran para rasul Kami dan kebenaran ajaran yang mereka bawa dan kebatilan yang dianut oleh musuh-musuh mereka yang mendustakan itu. “dan sesungguhnya Rabbmu, Dia-lah Yang Mahaperkasa,” yang melumpuhkan musuh-musuhNya dengan keperkasaanNya, sehingga Dia menenggelamkannya dengan badai topan. “lagi Maha penyayang,” kepada para waliNya (orang-orang yang setia kepadaNya), di mana Dia telah menyelamatkan Nuh beserta orang-orang yang bersamanya dari kaum yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 121: Kemudian Allah mengakhiri ayat dengan menjelaskan suatu kabar, padanya dijelaskan pertentangan (yang tidak akan pernah bersatu) antara tauhid dan syirik, antara menangnya ahli tauhid dan binasanya kafir, sebagai tanda yang nyata yang menunjukkan atas kebenaran para utusan Kami dan benarnya apa yang datang bersama mereka. Bersamaan dengan itu semua banyak manusia yang tidak beriman kepada Allah dan syariat-Nya, dan tidak membenarkan para utusan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni selamatnya Nuh dan para pengikutnya dan binasanya orang-orang yang mendustakannya. Bisa juga diartikan, benar-benar terdapat tanda yang menunjukkan kebenaran rasul Kami dan apa yang mereka bawa, serta batilnya apa yang dipegang oleh musuh-musuh mereka yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 121",
    "description": "121. Sungguh, pada kejadian yang demikian itu benar-benar terdapat tanda kekuasaan Allah yang demikian nyata, tetapi kebanyakan mereka tidak beriman. 122. Dan sungguh, tuhanmu, dialah yang mahaperkasa yang tidak berku-rang kekuasaan-Nya walaupun banyaknya orang yang ingkar kepada-Nya, maha penyayang dengan tidak cepat membinasakan orang yang durhaka kepada-Nya, tapi masih memberikan kesempatan kepada mereka untuk bertobat."
  }
]