[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Tuhanmu itu benar-benar Maha perkasa untuk membalas orang-orang yang kafir kepadanya dan melanggar perintahNya, juga Maha Penyayang terhadap hamba-hambaNya yang Mukmin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Dan sesungguhnya Tuhanmu -wahai Rasul- Dia lah Yang Maha Perkasa, yang membalas kejahatan para musuh-musuh-Nya, lagi Maha Penyayang terhadap orang-orang yang bertobat di antara mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122. Sesungguhnya Tuhanmu wahai manusia, Dialah Yang Maha Perkasa, Yang Maha Membalas musuh-musuhNya para orang kafir. Serta Maha Penyayang kepada orang-orang mukmin dan ahli taubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang benar-benar Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119-122 “maka kami selamatkan Nuh dan orang-orang yang besertanya di dalam bahtera,” maksudnya, kapal; “yang penuh muatan,” yang terdiri dari manusia dan berbagai macam hewan. “kemudian sesudah itu kami tenggelamkan sesudahnya,” maksudnya, setelah Nuh dan orang-orang yang beriman bersamanya, “orang-orang yang tinggal.” Maksudnya, kami menenggelamkan seluruh kaumnya. “sesungguhnya pada yang demikian itu.” Maksudnya, pada keselamatan Nuh dan para pengikutnya dan kebinasaan orang-orang yang mendustakannya, “benar-benar terdapat tanda,” yang membuktikan kebenaran para rasul Kami dan kebenaran ajaran yang mereka bawa dan kebatilan yang dianut oleh musuh-musuh mereka yang mendustakan itu. “dan sesungguhnya Rabbmu, Dia-lah Yang Mahaperkasa,” yang melumpuhkan musuh-musuhNya dengan keperkasaanNya, sehingga Dia menenggelamkannya dengan badai topan. “lagi Maha penyayang,” kepada para waliNya (orang-orang yang setia kepadaNya), di mana Dia telah menyelamatkan Nuh beserta orang-orang yang bersamanya dari kaum yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 122: Ketahuilah wahai Nabi Allah bahwasanya Rabbmu sungguh maha perkasa yang menguasai seluruh urusan-Nya, maka dengan kemuliaan-Nya Allah hancurkan para pendusta dan mereka yang sombong, Dialah Allah yang maha pengasih kepada hamba-Nya yang beriman; Di mana Allah menangkan mereka dan Allah jaga mereka dan Allah mudahkan jalan hidayah bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan keperkasaan-Nya, Dia mengalahkan musuh-musuh-Nya, Dia menenggelamkan mereka dengan banjir yang besar. Terhadap wali-wali-Nya, di mana Dia telah menyelamatkan Nuh dan para pengikutnya yang terdiri dari orang-orang beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 122",
    "description": "122. Dan sungguh, tuhanmu, dialah yang mahaperkasa yang tidak berku-rang kekuasaan-Nya walaupun banyaknya orang yang ingkar kepada-Nya, maha penyayang dengan tidak cepat membinasakan orang yang durhaka kepada-Nya, tapi masih memberikan kesempatan kepada mereka untuk bertobat. 123. Kaum 'ad yang mendiami tanah yaman telah mendustakan para rasul. Mendustakan satu rasul, sama saja dengan mendustakan seluruh rasul, karena mereka adalah satu kesatuan, yaitu sebagai utusan Allah."
  }
]