[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Ad mendustakan Rasul mereka, Hud. Dengan tindakan ini, mereka berarti mendustakan semua rasul, lantaran kesatuan dakwah mereka dalam perkara-perkara pokok dan tujuan utamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Kaum 'Ād telah mendustakan para rasul tatkala mereka mendustakan rasul mereka; Hūd -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "123-127. Kabilah ‘Ad telah mendustakan rasul mereka, Hud -dan barangsiapa yang mendustakan seorang rasul maka dia telah mendustakan seluruh rasul-, ketika saudara mereka, Hud berkata kepada mereka: “Tidakkah kalian takut azab Allah karena kalian telah menyembah berhala-berhala? Dan aku adalah rasul dari Allah yang diutus kepada kalian, dan aku jujur dalam menasehati kalian. Maka takutlah kalian dari azab Allah dan taatilah perintahku. Aku tidak meminta upah dari kalian atas dakwah yang aku sampaikan kepada kalian, dan balasanku hanya dari Allah Tuhan semesta alam.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123. Kaum ´Aad telah mendustakan para rasul mereka yaitu nabi Hud. Diungkapkan dengan dhamir jamak hum karena barang siapa mendustakan satu rasul saja mereka telah mendustakan semua rasul"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum ‘Ad telah mendustakan para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123-127 qabilah yang disebut 'Ad telah mendustakan rasul mereka, yaitu Hud. Dan pendustaan mereka terhadapnya (juga) merupakan pendustaan terhadap para rasul lainnya karena kesamaan dakwah mereka, “ketika berkata kepada mereka saudara mereka,” senasab, yaitu “Hud” dengan lembut dan bahsa yang santung, “mengapa kamu tidak bertakwa” kepada Allah, (padahal) dulu kalian meninggalkan syirik dan peribadatan kepada selainNya. “sesungguhnya aku adalah seorang rasul kepercayaan kepadamu,” maksudnya, aku telah diutus oleh Allah kepada kalian sebagai rahmat dan perhatianNya terhadap kalian, sedangkan aku adalah orang kepercayaan, kalian mengetahui hal itu dariku. Setelah itu dilanjutkan oleh firmanNya, ”maka bertakwalah kepada Allah dan taatlah kepadaku.” Maksudnya, tunaikanlah hak-hak Allah, yaitu takwa, dan tunaikanlah hakku, yaitu menaati apa saja yang aku perintahkan kepada kalian dana pa-apa yang aku larang. Hal ini adalah kewajiban agar kalian mengikuti dan taat kepadaku, dan sudah tidak ada penghalang yang dapat mencegah kalian untuk beriman. Sebab, aku tidak meminta upah apa pun atas penyampaian dan nasihatku kepada kalian, sehingga kalian tidak merasa terbebani dengan tanggungan, “upahku tidak lain hanyalah dari Rabb semesta alam,” yang telah melimpahkan nikmat-nikmatNya kepada mereka dan mencurahkan berbagai karunia dan kemurahanNya kepada mereka, terutama sesuatu yang dilimpahkanNya kepada para wali dan para nabiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 123: Allah mengabarkan bahwa kaum Ad mendustakan Nabi mereka Hud; Ketika mereka diseru kepada tauhid dan iman, mereka tidak menerima dan mengimaninya, mereka menunjukkan kesombongan mereka kepada seluruh Nabi dan Rasul, di mana dakwah para Nabi adalah satu, agama mereka satu. Maka barangsiapa yang mendustakan salah satu, maka mendustakan seluruhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kabilah yang bernama ‘Aad telah mendustakan rasul mereka, yaitu Hud ‘alaihis salam, padahal mendustakan seorang rasul sama saja mendustakan semua rasul karena dakwahnya yang sama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 123",
    "description": "123. Kaum 'ad yang mendiami tanah yaman telah mendustakan para rasul. Mendustakan satu rasul, sama saja dengan mendustakan seluruh rasul, karena mereka adalah satu kesatuan, yaitu sebagai utusan Allah. 124. Ketika saudara mereka sendiri yang satu negeri dan satu kabilah yaitu hud berkata kepada mereka dengan tulus ikhlas mengajak mereka ke jalan yang benar, 'mengapa kamu tidak bertakwa'\"."
  }
]