[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "124-127. Ketika saudara mereka, Hud berkata kepada mereka, “Tidakkah kalian takut kepada Allah, lalu kalian memurnikan ibadah hanya untukNya saja? Sesungguhnya aku diutus ke tengah kalian untuk menunjukkan kalian jalan hidayah dan mengarahkan kalian, aku dipercaya mengemban risalah Allah, aku sampaikan kepada kalian sebagaimana Tuhanku memerintahkan aku. Maka takutlah terhadap siksaan Allah dan taatlah kepadaku dalam perkara yang aku bawa kepada kalian dari sisi Allah. Dan aku tidak meminta dari kalian atas ajakanku terhadap kalian kepada tauhid bentuk imbalan jenis apapun. Dan imbalanku tiada lain berasal dari Penguasa alam semesta.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Maka bertakwalah kepada Allah dengan menjalankan perintah dan menjauhi larangan-Nya, dan taatilah aku dalam perkara yang aku perintahkan dan yang aku larang atas kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126. Maka takutlah kalian kepada Allah dengan menjalankan perintah dan menjauhi larangan-Nya, dan taatlah kepadaku atas tugas dan kewajiban agama yang aku sampaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bertakwalah kepada Allah dan taatlah kepadaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123-127 qabilah yang disebut 'Ad telah mendustakan rasul mereka, yaitu Hud. Dan pendustaan mereka terhadapnya (juga) merupakan pendustaan terhadap para rasul lainnya karena kesamaan dakwah mereka, “ketika berkata kepada mereka saudara mereka,” senasab, yaitu “Hud” dengan lembut dan bahsa yang santung, “mengapa kamu tidak bertakwa” kepada Allah, (padahal) dulu kalian meninggalkan syirik dan peribadatan kepada selainNya. “sesungguhnya aku adalah seorang rasul kepercayaan kepadamu,” maksudnya, aku telah diutus oleh Allah kepada kalian sebagai rahmat dan perhatianNya terhadap kalian, sedangkan aku adalah orang kepercayaan, kalian mengetahui hal itu dariku. Setelah itu dilanjutkan oleh firmanNya, ”maka bertakwalah kepada Allah dan taatlah kepadaku.” Maksudnya, tunaikanlah hak-hak Allah, yaitu takwa, dan tunaikanlah hakku, yaitu menaati apa saja yang aku perintahkan kepada kalian dana pa-apa yang aku larang. Hal ini adalah kewajiban agar kalian mengikuti dan taat kepadaku, dan sudah tidak ada penghalang yang dapat mencegah kalian untuk beriman. Sebab, aku tidak meminta upah apa pun atas penyampaian dan nasihatku kepada kalian, sehingga kalian tidak merasa terbebani dengan tanggungan, “upahku tidak lain hanyalah dari Rabb semesta alam,” yang telah melimpahkan nikmat-nikmatNya kepada mereka dan mencurahkan berbagai karunia dan kemurahanNya kepada mereka, terutama sesuatu yang dilimpahkanNya kepada para wali dan para nabiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 126: 124-126. Berkata Hud kepada kaumnya : Tidakkah kalian bertaqwa kepada Allah dan takut dari adzab-Nya karena sebab kesyirikan kalian dan ibadah kalian kepada selain-Nya ? Kemudian dikatakan kepada mereka : Sungguh Allah telah mengkhususkan kalian dengan mengutusku kepada kalian, dan aku adalah orang yang terpercaya atas apa yang aku sampaikan kepada kalian dari Rabbku, tidaklah aku mengada-ada dan membuat-buat sendiri. Maka bertaqwalah kepada Allah dan berimanlah kepada-Nya, taatilah aku dengan apa yang aku seru kepada kalian akan tauhid dan jauhilah syirik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penuhilah hak Allah, yaitu takwa, dan penuhilah hakku, yaitu ditaati dalam semua perintah dan larangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 126",
    "description": "126. \"karena itu bertakwalah kepada Allah dengan menaati semua perintah-Nya dan menjauhi larangan-Nya dan taatlah kepadaku atas apa yang aku katakan kepada kamu. 127. Kemudian agar kaumnya tidak mencurigai missinya sebagai missi yang komersial, nabi hud berkata, \"dan aku tidak meminta imbalan apa pun kepadamu, baik materi maupun jasa atas ajakan itu; karena imba-lanku hanyalah dari tuhan yang mengatur seluruh alam seluruh karena aku adalah utusan-Nya. \"."
  }
]