[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "128-130. Apakah kalian akan mendirikan di tiap-tiap tempat yang tinggi bangunan yang menjulang tinggi yang membuat kalian merasa mulia karenanya dan mengolok-olok orang-orang yang berlalu-lalang dari situ? Itu hanyalah main-main dan pemborosan yang tidak membawa manfaat bagi kalian untuk agama dan dunia kalian. Dan kalian membuat istana-istana yang kuat dan benteng-benteng kokoh, seolah-olah kalian akan hidup abadi di dunia dan tidak akan mati. Dan apabila kalian melancarkan tindakan aniaya terhadap salah seorang makhluk, baik dengan pukulan atau pembunuhan, kalian lakukan itu sebagai orang-orang yang kejam lagi lalim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Apakah kalian mendirikan pada tiap-tiap dataran tinggi bangunan-bangunan untuk hal yang sia-sia saja tanpa memiliki manfaat sama sekali dalam perkara dunia dan akhirat kalian?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "128-131. Kemudian Hud berkata: “Apakah kalian mendirikan bangunan yang besar di setiap tempat yang tinggi yang ada di jalan agar kalian dapat bermain-main dan melakukan hal yang sia-sia? Dan kalian membangun istana-istana yang megah dan kokoh seakan-akan kalian akan hidup kekal dan tidak akan mati. Dan jika kalian menzalimi seseorang maka kalian memukul dan menindasnya seperti orang-orang kejam yang menindas. Takutlah kepada Allah dan taatilah perintahku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. أَتَبْنُونَ بِكُلِّ رِيعٍ ءَايَةً تَعْبَثُونَ (Apakah kamu mendirikan pada tiap-tiap tanah tinggi bangunan untuk bermain-main) Makna (الريع) adalah tempat yang tinggi di permukaan bumi, pendapat lain mengatakan maknanya adalah gunung. Dan mujahid berpendapat maknanya adalah celah antara dua gunung. Makna ayat ini adalah kalian membangun bangunan di setiap tempat yang tinggi, padahal kalian membangunnya sia-sia sebab tidak memiliki manfaat yang jelas kecuali untuk berbangga-bangga dan menyombongkan diri serta mengganggu orang yang lewat dan menghinanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128. Apakah pada tiap-tiap tanah tinggi kamu mendirikan bangunan tinggi laksana gunung. Bukan untuk kebutuhan yang bermanfaat namun hanya untuk bermain-main? Kata tanya tersebut bermaksud untuk menolak atau menunjukkan ketidakrelaan atas kalimat sesudahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian mendirikan bangunan} bangunan yang ingin diketahui oleh orang yang lewat {di setiap tanah yang tinggi} tanah yang tinggi {untuk bermain-main} bermain dengan bangunan-bangunannya tanpa membutuhkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128-135 “apakah kamu mendirikan pada tiap-tiap tanah tinggi,” maksudnya, tempat masuk di antara perbukitan, “bangunan,” yaitu sebagai tanda (kemegahan) “untuk bermain-main” maksudnya, kalian melakukan semua itu dengan sia-sia bukan untuk suatu manfaat yang kembali kepada kemaslahatan agama dan dunia kalian, “dan kamu membuat bangunan-bangunan,” maksudnya, kolam-kolam air dan tempat-tempat mengalirkan air, “dengan maksud supaya kamu kekal.” Padahal tidak ada jalan bagi siapapun untuk bisa kekal. “dan apabila kamu menyiksa,” manusia, “maka kamu menyiksa sebagai orang-orang kejam dan bengis,” dalam bentuk membunuh, mencambuk, dan merampas harta. Memang Allah telah memberikan kepada mereka sutu kekuatan yang hebat, dan semestinya yang wajib mereka lakukan adalah mempergunakan kekuatan ini untuk ketaatan kepada Allah, akan tetapi mereka berlaku congkak dan sombong, dan mengatakan, ”siapa yang lebih kuat dari kami?” mereka telah menghabiskan kekuatan mereka dalam berbagai kedurhakaan terhadap Allah dan dalam perbuatan sia-sia dan kebodohan. Maka dari itu mereka dilarang oleh Nabi mereka dari perbuatan tersebut. “maka bertakwalah kepada Allah,” tinggalkanlah kemusyrikan dan kecongkakan kalian, “dan taatlah kepadaku,” karena kalian telah mengetahui bahwa aku adalah seorang utusan Allah kepada kalian, yang dipercaya lagi tulus. “dan bertakwalah kepada Allah yang telah menganugerahkan kepadamu,” maksudnya, yang telah memberikan kepada kalian, “apa yang kamu ketahui,” maksudnya, yang telah mengaruniakan kepada kalian hal-hal yang sudah diketahui dan tidak bisa dipungkiri, yaitu berupa binatang-binatang ternak. “dia telah menganugerahkan binatang-binatang ternak,” yaitu berupa unta, sapi dan domba, “dan anak-anak,” maksudnya, banyak anak keturunan. Dia telah memperbanyak harta kekayaan kalian dan memperbanyak anak-anak kalian, terutama anak-anak laki-laki yang merupakan yang terbaik dari dua jenis manusia. Ini adalah suatu bentuk tadzkir (mengingatkan kepada) mereka dengan berbagai kenikmatan. Lalu Allah mengingatkan mereka dengan akan datangnya azab Allah, seraya berfirman, ”sesungguhnya kau takut kamu akan ditimpa azab yang besar,” maksudnya, sesungguhnya aku sangat kasihan kepada kalian, aku sangat baik kepada kalian, aku khawatir kalau kalian ditimpa azab yang sangat besar. Apabila azab itu menimpa, maka tidak ada yang bisa menolaknya jika kalian terus tenggelam di dalam kekafiran dan kecongkakan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 128: 128-130. Berkata Hud mengingkari perbuatan kaumnya : Apakah kalian terlalu gembira dengan dunia dan tersibukkan dengannya, dengan banyaknya bangunan kalian di mana-mana yang menjulang tinggi ke atas langit seolah-olah engkau akan hidup selamanya di dunia, dan kenyataannya tidak ada jalan kekal kalian hidup di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tempat masuk di antara gunung-gunung. Maksudnya, untuk bermewah-mewahan dan memperlihatkan kekayaan kepada orang yang lewat tanpa ditempati dan tidak ada maslahatnya bagi dunia mereka dan akhiratnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 128",
    "description": "128. Nabi hud mengecam perilaku buruk kaumnya dan berkata: apakah kamu mendirikan istana-istana pada setiap tanah yang tinggi hanya untuk kemegahan dan kepongahan tanpa ditempati' sungguh hal ini keterlaluan. 129. \"dan kamu membuat benteng-benteng yang kokoh dan kuat, atau penampungan-penampungan air yang besar dengan maksud supaya kamu kekal di dunia'\"."
  }
]