[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-14. Musa berkata,” Wahai Tuhanku, sesungguhnya aku takut bahwa mereka akan mendustakanku dalam risalah (yang kubawa) dan akibatnya dadaku akan sesak dengan kenestapaan karena pendustaan mereka kepadaku, dan lidahku tidaklah lancar untuk menyampaikan dakwah, maka utuslah jibril dengan membawa wahyu yang diturunkan kepada saudaraku, Harun, agar ia dapat membantuku, dan membenarkan apa-apa yang aku katakan, dan menjelaskan kepada mereka apa-apa yang aku sampaikan, karena dia lebih jelas dalam berbicara. Dan aku juga punya dosa terhadap mereka karena membunuh seorang lelaki dari mereka, yaitu lelaki orang Qibthi. Maka aku takut mereka akan membunuhku karenanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan karena pendustaan mereka itu, akan membuat dadaku sempit dan lidahku menjadi kelu untuk berbicara, maka utuslah Jibril -'alaihissalām- kepada saudaraku, Harun, agar dia menjadi penolong dan pendampingku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَيَضِيقُ صَدْرِى (Dan (karenanya) sempitlah dadaku) Akibat kegalauan dalam menyikapi kedustaan mereka terhadapku. وَلَا يَنطَلِقُ لِسَانِى(dan tidak lancar lidahku) Untuk menyampaikan risalah. Hal ini disebabkan lidah Nabi Musa tidak fasih untuk berbicara. فَأَرْسِلْ إِلَىٰ هٰرُونَ(maka utuslah (Jibril) kepada Harun) Yakni berilah ia wahyu agar menjadi penguat dan pembantuku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Sempitlah dadaku karena takut terhadap pendustaan mereka kepadaku, dan lisanku tidak bisa bebas dalam menyampaikan risalah. Maka utuslah Jibril dengan membawa wahyu kepada saudaraku Harun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dadaku terasa sempit dan lidahku tidak lancar. Maka utuslah Harun} Maka utuslah Jibril dengan wahyu kepada saudaraku Harun, agar dia membantuku menyampaikan risalah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-14 lalu Musa berkata seraya memohon maaf kepada Rabbnya dan menjelaskan alasanya, serta memohon kepadaNya pertolongan atas tugas berat ini, “Ya Rabbku, sesungguhnya aku takut bahwa mereka akan mendustakanku. Dan (karenanya) sempitlah dadaku dan tidak lancar lidahku,” lalu dia mengatakan, “Ya Rabbku, lapangkanlah untukku dadaku, dan mudahkanlah untukku urusanku, dan lepaskanlah kekakuan lidahku, supaya mereka mengerti perkataanku, dan jadikanlah untukku seorang pembantu dari keluargaku, (yaitu) Harun saudaraku,” (taha:25-30) “maka utuslah (jibril) kepada Harun,” lalu Allah mengabulkan permohonannya, dan Dia mengangkat saudaranya, harun sebagai nabi, sebagaimana Dia telah menjadikan dirinya sebagai nabi, ”maka utuslah dia bersamaku sebagai pendukung,” (al-qashas:34); maksudnya, sebagai pembantu bagiku atas urusanku ini. “dan aku berdosa terhadap mereka,” maksudnya, dosa dalam membunuh seorang dari suku qibthi, “maka aku takut mereka akan membunuhku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 13: 12-13. Musa berkata : Wahai Tuhanku, sungguh aku merasa takut mereka mendustakanku dan tidak membenarkanku atas apa yang aku seru pada mereka. Aku juga takut dadaku menjadi sempit karena penolakan dari mereka sehingga dadaku terisi dengan kesusahan dan kesedihan. Aku juga takut untuk berkata-kata akan tetapi lidahku tak kuasa menyampaikan seruan dan dengan terbata-bata, maka perintahkanlah saudaraku Harun sebagai penolong bagiku dan pendukungku pada urusan ini dan urusan dakwah dengan kefasihan (ucapan). Maka Allah kabulkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena pendustaan mereka kepadaku. Maksudnya, agar Harun itu diangkat menjadi Rasul untuk membantunya. Maka Allah mengabulkan permintaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 13",
    "description": "Sehingga, karenanya dadaku terasa sempit, sedih dan kesal karena ulah mereka, dan lidahku tidak lancar, tidak fasih untuk memberikan penjelasan kepada mereka seperti apa yang ada di dalam hatiku, maka aku memohon kepada-Mu ya rabbi, utuslah dan angkatlah harun sebagai rasul agar dia bisa bersamaku untuk menyampaikan pesan-pesan-Mu kepada mereka. \"14. Dan aku berdosa terhadap mereka karena aku pernah membunuh salah seorang di antara mereka, maka aku takut mereka akan membunuhku, karena aku yakin, mereka masih menaruh dendam kepadaku."
  }
]