[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "131-134. Maka takutlah kepada allah, dan laksanakanlah perkara yang aku seru kalian kepadanya. Itu akan lebih bermanfaat bagi kalian. Dan takutlah kepada Allah Yang telah memberikan kepada kalian berbagai macam kenikmatan, yang tidak samar bagi kalian. Dia memberikan kepada kalian binatang-binatang ternak, yaitu unta, sapi dan kambing, memberikan kepada kalian anak-anak, memberikan kepada kalian kebun-kebun yang berbuah, serta mengalirkan bagi kalian air dari mata-mata air yang mengalir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "132. Dan takutlah dari kemurkaan Allah yang telah menganugerahkan kepada kalian berbagai nikmat yang kalian ketahui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "132-136. Dan bertakwalah kepada Allah yang telah memberi kalian berbagai kenimatan yang kalian ketahui; berupa hewan-hewan ternak, anak keturunan, kebun-kebun yang subur, dan mata air yang segar. Sungguh aku khawatir -jika kalian tidak bersyukur kepada Allah atas segala kenikmatan tersebut dan menyembah-Nya semata- kalian akan tertimpa azab pada hari yang sangat menakutkan.” Namun mereka menjawab dengan penghinaan: “Sama saja bagi kami, kamu memperingatkan kami atau tidak; karena kami tidak peduli dengan apa yang kamu katakan!”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "132. Bertakwalah kepada Allah dengan ikhlas dalam ibadah hanya kepada-Nya. Dialah Yang telah menganugerahkan kenikmatan dan anugerah kepadamu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bertakwalah kepada Dzat yang telah menganugerahkan kepada kalian apa yang kalian ketahui} memberi kalian nikmat yang kalian ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128-135 “apakah kamu mendirikan pada tiap-tiap tanah tinggi,” maksudnya, tempat masuk di antara perbukitan, “bangunan,” yaitu sebagai tanda (kemegahan) “untuk bermain-main” maksudnya, kalian melakukan semua itu dengan sia-sia bukan untuk suatu manfaat yang kembali kepada kemaslahatan agama dan dunia kalian, “dan kamu membuat bangunan-bangunan,” maksudnya, kolam-kolam air dan tempat-tempat mengalirkan air, “dengan maksud supaya kamu kekal.” Padahal tidak ada jalan bagi siapapun untuk bisa kekal. “dan apabila kamu menyiksa,” manusia, “maka kamu menyiksa sebagai orang-orang kejam dan bengis,” dalam bentuk membunuh, mencambuk, dan merampas harta. Memang Allah telah memberikan kepada mereka sutu kekuatan yang hebat, dan semestinya yang wajib mereka lakukan adalah mempergunakan kekuatan ini untuk ketaatan kepada Allah, akan tetapi mereka berlaku congkak dan sombong, dan mengatakan, ”siapa yang lebih kuat dari kami?” mereka telah menghabiskan kekuatan mereka dalam berbagai kedurhakaan terhadap Allah dan dalam perbuatan sia-sia dan kebodohan. Maka dari itu mereka dilarang oleh Nabi mereka dari perbuatan tersebut. “maka bertakwalah kepada Allah,” tinggalkanlah kemusyrikan dan kecongkakan kalian, “dan taatlah kepadaku,” karena kalian telah mengetahui bahwa aku adalah seorang utusan Allah kepada kalian, yang dipercaya lagi tulus. “dan bertakwalah kepada Allah yang telah menganugerahkan kepadamu,” maksudnya, yang telah memberikan kepada kalian, “apa yang kamu ketahui,” maksudnya, yang telah mengaruniakan kepada kalian hal-hal yang sudah diketahui dan tidak bisa dipungkiri, yaitu berupa binatang-binatang ternak. “dia telah menganugerahkan binatang-binatang ternak,” yaitu berupa unta, sapi dan domba, “dan anak-anak,” maksudnya, banyak anak keturunan. Dia telah memperbanyak harta kekayaan kalian dan memperbanyak anak-anak kalian, terutama anak-anak laki-laki yang merupakan yang terbaik dari dua jenis manusia. Ini adalah suatu bentuk tadzkir (mengingatkan kepada) mereka dengan berbagai kenikmatan. Lalu Allah mengingatkan mereka dengan akan datangnya azab Allah, seraya berfirman, ”sesungguhnya kau takut kamu akan ditimpa azab yang besar,” maksudnya, sesungguhnya aku sangat kasihan kepada kalian, aku sangat baik kepada kalian, aku khawatir kalau kalian ditimpa azab yang sangat besar. Apabila azab itu menimpa, maka tidak ada yang bisa menolaknya jika kalian terus tenggelam di dalam kekafiran dan kecongkakan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 132: 131-134. Hud kemudian berkata kepada mereka : Bertaqwalah kepada Allah dan berimanlah kepada-Nya, taatilah Allah atas apa yang kalian diseru kepada tauhid dan menjauhi syirik, takutlah kepada Allah saja yang telah memberikan kepada kalian segala kenikmatan dunia dan janganlah kalian pura-pura tidak mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa berbagai nikmat dan kesenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 132",
    "description": "132. \"dan bertakwalah kepada Allah yang telah menganugerahkan kepadamu apa yang kamu ketahui dan kamu rasakan, yaitu segala kenikmatan duniawi. \"133. Nabi hud lalu memerinci beberapa kenikmatan itu. Dia telah menganugerahkan dan melimpahkan kepada kamu binatang-binatang ternak yang sangat besar manfaatnya dalam kehidupan kamu dan dia juga memberimu anak-anak yang dengan mereka kamu merasa kuat."
  }
]