[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata kepadanya, “Sama saja bagi kami, kamu memperingatkan kami atau tidak melakukannya. Kami tidak akan beriman dan membenarkan kamu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "136. Kaumnya lalu berkata kepadanya, \"Sama saja bagi kami; ada peringatan yang engkau sampaikan ataupun tidak ada, sebab kami tidak akan pernah beriman kepadamu, dan kami tidak akan meninggalkan segala apa yang kami yakini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "136. قَالُوا۟ سَوَآءٌ عَلَيْنَآ أَوَعَظْتَ أَمْ لَمْ تَكُن مِّنَ الْوٰعِظِينَ (Mereka menjawab: “Adalah sama saja bagi kami, apakah kamu memberi nasehat atau tidak memberi nasehat) Yakni kamu menasehati kami atau tidak sama saja bagi kami, kami tidak akan mempedulikannya dan tidak akan menengok apa yang kamu katakan, serta kami tidak akan berhenti dari apa yang kami lakukan sekarang. Mereka mengatakan hal ini untuk melemahkan semangatnya dan membuatnya putus asa agar berhenti menyeru mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "136. Mereka menjawab: \"Akan sama saja bagi kami, apakah kamu memberi nasehat atau tidak memberi nasehat,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Sama saja bagi kami} sama saja di sisi kami {apakah kamu memberi nasihat atau tidak memberi nasihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "136-138 maka mereka berkata dengan menentang kebenaran lagi mendustakan Nabi mereka, “sama saja bagi kami, apakah kamu memberi nasihat atau tidak memberi nasihat,” maksudnya, semuanya sama! Ini adalah puncak kecongkakan, Karena suatu kaum (umat manusia) yang sampai pada keadaan di mana nasihat-nasihat Allah yang dapat mencairkan gunung-gunung yang tuli lagi keras dan dapat meremukkan hati orang-orang yang berakal, adanya nasihat itu dan ketiadaannya sama saja bagi mereka, adalah benar-benar merupakan kaum yang kezhalimannya telah memuncak, kesengsaraannya sudah amat sangat dahsyat dan sudah terputus harapan untuk bisa memberi mereka hidayah. Oleh karena itu, mereka mengatakan, ini tidak lain hanyalah adat kebiasaan orang dahulu,” maksudnya, semua keadaan dan kenikmatan dan lain-lainnya itu adalah kebiasaan orang-orang terdahulu, yang kadang-kadang mereka tidak membutuhkan dan kadang-kadang mereka membutuhkan. Inilah keadaan (rutinitas) tahunan. Padahal semua keadaan tersebut adalah ujian dan cobaan dari Allah terhadap hamba-hambaNya. “dan kami sekali-kali tidak akan di azab,” ini adalah suatu pengingkaran mereka terhadap kebangkitan (kiamat), atau merupakan cemoohan mereka terhadap nabi, (yang berarti): kalaupun kami dibangkitkan lagi, maka sesungguhnya kami di dunia, maka demikian pula, kenikmatan itu akan terus dilimpahkan kepada kami bila kami dibangkitkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 136: 135-136. Berkata Hud : Ketahuilah wahai kaum, sungguh aku yang paling takut akan kalian jika kalian tidak beriman kepada Allah, akan diturunkannya adzab yang besar dari Allah sehingga kalian akan binasa; Maka mereka menjawab dengan sombong : Jauhkan nasihatmu pada kamu, nasihat apapun itu, kamu tidak akan mengikutimu dan beriman kepadamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil menolak yang hak dan mendustakan nabi mereka. Ini merupakan puncak keangkuhan mereka. Padahal firman Allah Ta’ala dan nasehat-nasehat-Nya dapat meluluhkan gunung yang keras dan membuat hati-hati orang yang berakal terpecah-pecah, akan tetapi di sisi mereka sama saja. Hal ini tidak lain karena besarnya kezaliman mereka, celakanya mereka dan sudah tidak bisa lagi mereka diharapkan untuk mendapatkan hidayah, sehingga layak untuk menerima azab di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 136",
    "description": "136. Namun, dengan sikap sombong, kaumnya menolak ajakannya. Mereka menjawab, \"adalah sama saja bagi kami, apakah kamu wahai hud, memberi nasihat atau tidak memberi nasihat, kami tetap tidak akan menuruti ajakanmu. Kami akan terus berpegang teguh dengan keyakinan kami. Maka kamu tak perlu bersusah payah terus menerus mengajak kami. 137. Mereka berkata lagi, \"agama kami ini tidak lain hanyalah adat kebiasaan orang dahulu. Apa yang dilakukan nenek moyang kami, itulah yang kami ikuti. \" inilah bentuk taklid buta dalam hal keyakinan agama yang sangat dibenci oleh Allah."
  }
]