[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "137-138. Dan mereka mengatakan, “Apa yang kami pegangi ini tiada lain adalah keyakinan agama orang-orang terdahulu dan kebiasaan mereka. Dan kami tidaklah akan disiksa atas apa yang kami perbuat dari siksaan yang kamu peringatkan kepada kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "138. Dan kami sekali-kali tidak akan diazab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "138. وَمَا نَحْنُ بِمُعَذَّبِينَ (dan kami sekali-kali tidak akan di azab) Atas apa yang kami lakukan seperti penyiksaan dan perbuatan lainnya yang kami lakukan sekarang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "138. Kami tidak akan diazab setelah kematian kami, karena hari kebangkitan, hari pembalasaan dan hari perhitungan itu semua tidak ada"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak akan diazab”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "136-138 maka mereka berkata dengan menentang kebenaran lagi mendustakan Nabi mereka, “sama saja bagi kami, apakah kamu memberi nasihat atau tidak memberi nasihat,” maksudnya, semuanya sama! Ini adalah puncak kecongkakan, Karena suatu kaum (umat manusia) yang sampai pada keadaan di mana nasihat-nasihat Allah yang dapat mencairkan gunung-gunung yang tuli lagi keras dan dapat meremukkan hati orang-orang yang berakal, adanya nasihat itu dan ketiadaannya sama saja bagi mereka, adalah benar-benar merupakan kaum yang kezhalimannya telah memuncak, kesengsaraannya sudah amat sangat dahsyat dan sudah terputus harapan untuk bisa memberi mereka hidayah. Oleh karena itu, mereka mengatakan, ini tidak lain hanyalah adat kebiasaan orang dahulu,” maksudnya, semua keadaan dan kenikmatan dan lain-lainnya itu adalah kebiasaan orang-orang terdahulu, yang kadang-kadang mereka tidak membutuhkan dan kadang-kadang mereka membutuhkan. Inilah keadaan (rutinitas) tahunan. Padahal semua keadaan tersebut adalah ujian dan cobaan dari Allah terhadap hamba-hambaNya. “dan kami sekali-kali tidak akan di azab,” ini adalah suatu pengingkaran mereka terhadap kebangkitan (kiamat), atau merupakan cemoohan mereka terhadap nabi, (yang berarti): kalaupun kami dibangkitkan lagi, maka sesungguhnya kami di dunia, maka demikian pula, kenikmatan itu akan terus dilimpahkan kepada kami bila kami dibangkitkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 138: 137-138. Berkata kaum Ad kepada Nabi mereka Hud : Ketahuilah olehmu wahai Hud, bahwasanya kami tidaklah berda di atas keadaan ini kecuali kami semisal dengan kondisi orang-orang sebelum kami, dan ini adalah naluriah zaman, dan kami tidak akan terkena adzab dan merasakan hukuman sebagaimana engkau klaim dan katakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan pengingkaran mereka terhadap kebangkitan atau ejekan mereka kepada nabi mereka. Bahkan mereka sampai menyatakan, bahwa sekiranya kebangkitan itu ada, maka mereka akan diberi kenikmatan sebagaimana ketika di dunia (lihat surah Al Kahf: 35-36)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 138",
    "description": "138. Dan dengan pongahnya mereka berkata lagi, \"dan kami sama sekali tidak akan di azab oleh Allah di akhirat kelak. \" mereka menganggap bahwa kenikmatan yang mereka miliki adalah bentuk kasih sayang Allah kepada mereka, maka di akhirat pun mereka yakin tidak akan disiksa. 139. Sebagai sanksi atas kepongahan mereka, Allah menurunkan siksanya kepada mereka. Maka mereka mendustakan hud terhadap semua ajakan dan nasihatnya, lalu kami binasakan mereka dengan angin yang sangat dingin dan kencang selama tujuh malam dan delapan hari terus menerus (lihat juga surah al-haqqah/69: 7). Sungguh pada kejadian yang demikian itu terdapat tanda kekuasaan Allah yang demikian besar dan nyata yang semestinya menjadi pelajaran bagi mereka, tetapi kebanyakan mereka tidak beriman bahkan mendustakan Allah dan rasul-Nya."
  }
]