[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "139-140. Maka mereka tetap mendustakannya. Akibatnya, Allah membinasakan mereka dengan angin dingin yang dahsyat. Sesungguhnya pada kejadian pembinasaan itu terdapat pelajaran bagi orang-orang setelah mereka. Namun kebanyakan orang-orang yang mendengar kisah mereka tidak menjadi beriman kepadamu. Dan sesungguhnya Tuhanmu itu Mahaperkasa yang Kuasa untuk melakukan apa saja yang dikehendakiNya, berupa membinasakan orang-orang yang mendustakan, juga Maha Penyayang terhadap kaum Mukminin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "139. Maka merekapun terus menerus mendustakan Nabi mereka, Hūd -'alaihissalām-, lalu Kami binasakan mereka lantaran pendustaan mereka dengan mengirimkan angin kencang. Sesungguhnya dalam kebinasaan mereka terdapat pelajaran bagi orang yang ingin mengambil pelajaran, akan tetapi kebanyakan mereka tidak beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "139-140. Mereka mendustakan Hud, maka Kami membinasakan mereka dengan angin kencang. Sungguh kebinasaan itu merupakan ibrah yang besar, akan tetapi mayoritas orang yang mendengar kisah ini tetap tidak beriman kepada Allah dan rasul-Nya. Hai Rasulullah, Sungguh Tuhanmu Maha Perkasa dalam membalas perbuatan orang-orang yang mendustakan dan Maha Pengasih bagi orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "139. فَكَذَّبُوهُ فَأَهْلَكْنٰهُمْ ۗ (Maka mereka mendustakan Hud, lalu Kami binasakan mereka) Allah membinasakan mereka sebagai balasan atas pendustaan mereka. Mereka binasa akibat angin yang membinasakan, sebagaimana dijelaskan pada ayat yang lain, seperti: وأما عاد فأهلكوا بريح صرصر عاتية. سخرها عليهم سبع ليال وثمانية أيام حسوما. فترى القوم فيها صرعى كأنهم أعجاز نخل خاوية. فهل ترى لهم من باقية “Adapun kaum 'Aad maka mereka telah dibinasakan dengan angin yang sangat dingin lagi amat kencang, yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat kaum 'Aad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul pohon kurma yang telah kosong (lapuk). Maka kamu tidak melihat seorangpun yang tinggal di antara mereka.” Al-Haqqah: 6-8"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "139. Maka mereka mendustakan Hud, lalu Kami binasakan mereka dengan angin shar shar atas kedustaan mereka. Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran dan nasehat. Tetapi kebanyakan mereka tidak beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka mereka mendustakannya. Lalu Kami membinasakan mereka. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda, dan kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "139-140 “maka mereka mendustakannya,” maksudnya, sikap mendustakan itu telah menjadi karakter dan moral mereka yang tidak dapat dicegah oleh siapapun. “lalu kami membinasakan mereka,” “dengan angin yang sangat dingin lagi amat kencang, yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat ‘Ad pada waktu itu mati bergelimpangan seakan-akan mereka tanggul-tanggul pohon kurma yang telah kosong (lapuk).” (al-haqqah:6-7) “sesungguhnya pada yang demikian itu benar-benar terdapat tanda,” yang membuktikan kebenaran Nabi kami, Hud alaihi salam dan kebenaran ajaran yang dibawanya, serta kebatilan agama yang dianut kaumnya, berupa kesyirikan dan kecongkakan. “tetapi kebanyakan mereka tidak beriman,” sekalipun sudah ada tanda-tanda yang bisa menunjukkan kepada iman. “dan sesunguhnya Rabbmu, Dia-lah Yang Mahaperkasa,” yang telah membinasakan kaum Hud dengan kekuatanNya di atas kekuatan dan kebringasan mereka, “lagi Maha penyayang,” terhadap NabiNya, Hud di mana Dia menyelamatkannya beserta para pengikutnya dari kalangan kaum Mukminin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 139: 139-140. Inilah pengingkaran kaum Ad terhadap Nabi mereka Hud, dan mereka tidak beriman dengan apa yang dibawa olehnya, sehingga Allah membinasakan mereka dengan angin yang kencang, Allah sifatkan angin tersebut pada ayat yang lain dengan angin yang membinasakan seluruhnya. Kemudian Allah menjelaskan bahwasanya kabar ini adalah pemisah antara ketauhidan dan kesyirikan, serta binasalah orang-orang kafir sebagai tanda dan bukti yang jelas yang menunjukkan atas kebenaran Rasul Kami dan benarnya apa yang dibawanya, akan tetapi bersamaan dengan itu kebanyakan manusia tidak beriman kepada Allah dan syariat-Nya dan tidak mengimani para utusan Kami. Ketahuilah wahai Nabi Allah bahwasanya Rabbmu adalah maha perkasa yang menguasai segala urusan-Nya, dan dengan kemuliaan-Nya, binasalah para pengingkar dan sombong, Dialah Allah yang maha pemurah kepada hamba-Nya yang beriman; Di mana Allah jadikan mereka selamat dan senantiasa Allah menjaga mereka serta memudahkan mereka di atas jalan petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa kembali kepada Hud atau kepada azab yang diancamkan itu. Sikap mendustakan ini menjadi tabiat mereka dan perilakunya. Di dunia dengan angin topan yang sangat dingin, di mana angin tersebut terus menerus menimpa mereka selama tujuh malam delapan hari sehingga mereka mati bergelimpangan (lihat Al Haaqqah: 6-7). Bisa juga diartikan tanda yang menunjukkan kebenaran Nabi Hud ‘alaihis salam dan apa yang Beliau bawa, serta batilnya yang dipegang oleh kaumnya selama ini. Padahal telah ada ayat-ayat yang menghendaki mereka untuk beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 139",
    "description": "139. Sebagai sanksi atas kepongahan mereka, Allah menurunkan siksanya kepada mereka. Maka mereka mendustakan hud terhadap semua ajakan dan nasihatnya, lalu kami binasakan mereka dengan angin yang sangat dingin dan kencang selama tujuh malam dan delapan hari terus menerus (lihat juga surah al-haqqah/69: 7). Sungguh pada kejadian yang demikian itu terdapat tanda kekuasaan Allah yang demikian besar dan nyata yang semestinya menjadi pelajaran bagi mereka, tetapi kebanyakan mereka tidak beriman bahkan mendustakan Allah dan rasul-Nya. 140. Dan sungguh, tuhanmu, dialah yang mahaperkasa yang tidak berkurang kekuasaan-Nya dengan banyaknya orang yang ingkar kepada-Nya, maha penyayang dengan tidak cepat membinasakan orang yang durhaka kepadanya, tapi masih memberikan kesempatan kepada mereka untuk bertobat."
  }
]