[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-14. Musa berkata,” Wahai Tuhanku, sesungguhnya aku takut bahwa mereka akan mendustakanku dalam risalah (yang kubawa) dan akibatnya dadaku akan sesak dengan kenestapaan karena pendustaan mereka kepadaku, dan lidahku tidaklah lancar untuk menyampaikan dakwah, maka utuslah jibril dengan membawa wahyu yang diturunkan kepada saudaraku, Harun, agar ia dapat membantuku, dan membenarkan apa-apa yang aku katakan, dan menjelaskan kepada mereka apa-apa yang aku sampaikan, karena dia lebih jelas dalam berbicara. Dan aku juga punya dosa terhadap mereka karena membunuh seorang lelaki dari mereka, yaitu lelaki orang Qibthi. Maka aku takut mereka akan membunuhku karenanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan aku berdosa terhadap mereka lantaran aku pernah membunuh seorang Qibṭi, maka aku takut bila mereka akan membunuhku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَلَهُمْ عَلَىَّ ذَنۢبٌ فَأَخَافُ أَن يَقْتُلُونِ (Dan aku berdosa terhadap mereka, maka aku takut mereka akan membunuhku”) Dosa yang dimaksud adalah pembunuhan yang dilakukan Nabi Musa terhadap orang Mesir, sehingga Nabi Musa takut mereka akan membunuhnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dan aku memiliki dosa terhadap kaum Fir’aun yaitu membunuh seorang suku qubti saat masih muda sebelum mendapatkan nubuwah. Dan aku khawatir mereka membunuhku karena hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagi mereka aku berdosa} dakwaan dosa, yaitu membunuh salah satu orang Qibthi {Maka aku takut mereka akan membunuhku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-14 lalu Musa berkata seraya memohon maaf kepada Rabbnya dan menjelaskan alasanya, serta memohon kepadaNya pertolongan atas tugas berat ini, “Ya Rabbku, sesungguhnya aku takut bahwa mereka akan mendustakanku. Dan (karenanya) sempitlah dadaku dan tidak lancar lidahku,” lalu dia mengatakan, “Ya Rabbku, lapangkanlah untukku dadaku, dan mudahkanlah untukku urusanku, dan lepaskanlah kekakuan lidahku, supaya mereka mengerti perkataanku, dan jadikanlah untukku seorang pembantu dari keluargaku, (yaitu) Harun saudaraku,” (taha:25-30) “maka utuslah (jibril) kepada Harun,” lalu Allah mengabulkan permohonannya, dan Dia mengangkat saudaranya, harun sebagai nabi, sebagaimana Dia telah menjadikan dirinya sebagai nabi, ”maka utuslah dia bersamaku sebagai pendukung,” (al-qashas:34); maksudnya, sebagai pembantu bagiku atas urusanku ini. “dan aku berdosa terhadap mereka,” maksudnya, dosa dalam membunuh seorang dari suku qibthi, “maka aku takut mereka akan membunuhku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 14: Kemudian berkata Musa : Wahai Tuhanku, sesungguhnya aku memiliki kesalahan terhadap meraka, maka aku takut mereka membunuhku. Dan kesalahan Musa adalah ketika dia membunuh salah seorang yang berseteru dengan bani israil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Musa mengatakan bahwa dirinya berdosa terhadap orang-orang Mesir adalah menurut anggapan orang-orang Mesir itu, karena sebenarnya Musa tidak berdosa karena dia membunuh orang Mesir itu tidak dengan sengaja. Selanjutnya lihat surah Al Qashash ayat 15."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 14",
    "description": "Dan aku berdosa terhadap mereka karena aku pernah membunuh salah seorang di antara mereka, maka aku takut mereka akan membunuhku, karena aku yakin, mereka masih menaruh dendam kepadaku. 15. Mendengar keluhan nabi musa, Allah berfirman, \"hai musa jangan takut terhadap mereka seperti yang kau katakan! mereka tidak akan pernah dapat membunuhmu. Aku akan tetap memeliharamu dan menolongmu maka pergilah kamu berdua menghadap mereka dengan membawa ayat-ayat kami yaitu mukjizat-Mukjizat yang telah kami berikan kepadamu seperti tongkat dan tanganmu. Sungguh, kami bersamamu memeliharamu dan menolongmu, aku akan mendengarkan apa yang mereka katakan."
  }
]