[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "139-140. Maka mereka tetap mendustakannya. Akibatnya, Allah membinasakan mereka dengan angin dingin yang dahsyat. Sesungguhnya pada kejadian pembinasaan itu terdapat pelajaran bagi orang-orang setelah mereka. Namun kebanyakan orang-orang yang mendengar kisah mereka tidak menjadi beriman kepadamu. Dan sesungguhnya Tuhanmu itu Mahaperkasa yang Kuasa untuk melakukan apa saja yang dikehendakiNya, berupa membinasakan orang-orang yang mendustakan, juga Maha Penyayang terhadap kaum Mukminin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "140. Dan sesungguhnya Tuhanmu -wahai Rasul- benar-benar Di alah Yang Maha Perkasa, yang membalas kejahatan para musuh-musuh-Nya, lagi Maha Penyayang terhadap mereka yang bertobat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "140. Sesungguhnya Tuhanmu, Dialah Yang Maha Perkasa dan Maha Memberi balasan kepada para musuh-Nya. Serta Maha Penyayang kepada para kekasih-Nya yang beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang benar-benar Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "139-140 “maka mereka mendustakannya,” maksudnya, sikap mendustakan itu telah menjadi karakter dan moral mereka yang tidak dapat dicegah oleh siapapun. “lalu kami membinasakan mereka,” “dengan angin yang sangat dingin lagi amat kencang, yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat ‘Ad pada waktu itu mati bergelimpangan seakan-akan mereka tanggul-tanggul pohon kurma yang telah kosong (lapuk).” (al-haqqah:6-7) “sesungguhnya pada yang demikian itu benar-benar terdapat tanda,” yang membuktikan kebenaran Nabi kami, Hud alaihi salam dan kebenaran ajaran yang dibawanya, serta kebatilan agama yang dianut kaumnya, berupa kesyirikan dan kecongkakan. “tetapi kebanyakan mereka tidak beriman,” sekalipun sudah ada tanda-tanda yang bisa menunjukkan kepada iman. “dan sesunguhnya Rabbmu, Dia-lah Yang Mahaperkasa,” yang telah membinasakan kaum Hud dengan kekuatanNya di atas kekuatan dan kebringasan mereka, “lagi Maha penyayang,” terhadap NabiNya, Hud di mana Dia menyelamatkannya beserta para pengikutnya dari kalangan kaum Mukminin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 140: 139-140. Inilah pengingkaran kaum Ad terhadap Nabi mereka Hud, dan mereka tidak beriman dengan apa yang dibawa olehnya, sehingga Allah membinasakan mereka dengan angin yang kencang, Allah sifatkan angin tersebut pada ayat yang lain dengan angin yang membinasakan seluruhnya. Kemudian Allah menjelaskan bahwasanya kabar ini adalah pemisah antara ketauhidan dan kesyirikan, serta binasalah orang-orang kafir sebagai tanda dan bukti yang jelas yang menunjukkan atas kebenaran Rasul Kami dan benarnya apa yang dibawanya, akan tetapi bersamaan dengan itu kebanyakan manusia tidak beriman kepada Allah dan syariat-Nya dan tidak mengimani para utusan Kami. Ketahuilah wahai Nabi Allah bahwasanya Rabbmu adalah maha perkasa yang menguasai segala urusan-Nya, dan dengan kemuliaan-Nya, binasalah para pengingkar dan sombong, Dialah Allah yang maha pemurah kepada hamba-Nya yang beriman; Di mana Allah jadikan mereka selamat dan senantiasa Allah menjaga mereka serta memudahkan mereka di atas jalan petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan keperkasaan-Nya, Dia membinasakan kaum ‘Aad yang menganggap dirinya orang yang paling kuat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 140",
    "description": "140. Dan sungguh, tuhanmu, dialah yang mahaperkasa yang tidak berkurang kekuasaan-Nya dengan banyaknya orang yang ingkar kepada-Nya, maha penyayang dengan tidak cepat membinasakan orang yang durhaka kepadanya, tapi masih memberikan kesempatan kepada mereka untuk bertobat. 141. Kaum 'amud telah mendustakan para rasul yang mengajak mereka kembali kepada jalan yang benar, yaitu menauhidkan Allah, tidak menyekutukan-Nya dengan yang lain dan beribadah kepada-Nya dengan ikhlas."
  }
]