[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Tsamud mendustakan rosul mereka, Shaleh, terkait risalah dan seruan dakwahnya kepada tauhidullah. Dengan tindakan itu, mereka mendustakan semua rasul; karena para rasul itu mendakwahkan kepada tauhidullah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "141. Kaum Ṡamūd telah mendustakan para rasul tatkala mereka mendustakan nabi mereka, Ṣāleḥ -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "141-145. Kabilah Tsamud telah mendustakan rasul mereka, Shalih -sehingga dengan demikian mereka telah mendustakan seluruh rasul-, ketika nabi dan saudara mereka, Shalih berkata kepada mereka: “Tidakkah kalian takut azab Allah karena kalian telah menyembah selain-Nya? Dan aku adalah rasul dari Allah yang diutus kepada kalian, dan aku jujur dalam menyampaikan risalah kepada kalian. Maka takutlah kalian dari azab Allah dan taatilah perintahku. Aku tidak meminta upah dari kalian atas dakwah yang aku sampaikan kepada kalian, dan balasanku hanya dari Allah Tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "141. Kaum Tsamud telah mendustakan rasul-rasul mereka yaitu nabi Shalih. Bentuk jamak menunjukkan bahwa siapa yang mendustakan satu rasul saja maka dia telah mendustakan seluruh rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum Tsamud telah mendustakan para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141-144 “kaum tsamud telah mendustakan,” mereka adalah suku terkenal di al-mada’in al-hijr, “rasul-rasul” mereka mendustakan Nabi shaleh yang datang kepada mereka dengan membawa tauhid yang telah diserukan oleh para rasul. Maka demikian, pendustaan mereka terhadap shaleh adalah pendustaan terhadap semua rasul. “ketika saudara mereka, shaleh berkata kepada mereka,” maksudnya adalah saudara senasab, dan ia berkata kepada mereka dengan lembut dan lunak, “mengapa kamu tidak bertakwa,” kepada Allah dan (tidak) meninggalkan syirik dan kemaksiatan? ”sesungguhnya aku adalah seorang rasul untuk kalian,” dari Allah, Rabb kalian. Aku diutus kepada kalian sebagai kasih sayang dan rahmatNya dengan baik dan sikapilah ia dengan tunduk. “terpercaya,” kalian mengetahui hal itu dariku, dan hal ini mengharuskan kalian beriman kepadaku dan kepada ajaran yang aku bawa (ajaranku), “dan aku sekali-kali tidak minta upah kepadamu atas ajakan itu,” sehingga kalian bisa mengatakan, ”yang menghalangi kami untuk mengikutimu adalah karena kamu ingin mengambil harta kami,” “upahku tidak lain hanyalah dari Rabb semesta alam,” maksudnya, aku tidak meminta upah kecuali hanya dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 141: Allah mengabarkan bahwa Tsamud mendustakan seruan Nabi mereka Shalih; Di mana Shalih mendakwahkan tauhid dan keimanan, mereka tidak membenarkannya dan tidak mengimaninya, dengan itu maka pengingkaran mereka termasuk pengingkaran terhadap seluruh Nabi dan Rasul, di mana dakwah mereka para Nabi adalah satu, agama mereka satu. Maka barangsiapa yang mendustakan salah satu di antara mereka, sungguh dia mendustakan seluruhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tsamud adalah nama kabilah yang terkenal di kota-kota Hijr."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 141",
    "description": "141. Kaum 'amud telah mendustakan para rasul yang mengajak mereka kembali kepada jalan yang benar, yaitu menauhidkan Allah, tidak menyekutukan-Nya dengan yang lain dan beribadah kepada-Nya dengan ikhlas. 142. Ketika saudara mereka yang berasal dari negeri dan kabilah mereka sendiri yaitu saleh, berkata kepada mereka dengan maksud menasihati mereka, \"mengapa kamu tidak bertakwa dengan menjaga diri kamu dari murka Allah, dengan menauhidkan-Nya dan menjalani semua perintahnya'\"."
  }
]