[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "142-145. Ketika saudara mereka, Shaleh berkata kepada mereka, “Tidakkah kalian takut terhadap siksaan Allah dengan cara mengesakanNya dengan ibadah? Sesungguhnya aku adalah orang yang diutus kepada kalian dan dipercaya untuk membawa risalah ini sebagaimana aku menerimanya dari Allah. Maka takutlah kalian akan siksaan Allah, dan laksanakanlah ajaran yang aku seru kalian kepadanya. Dan aku tidaklah meminta imbalan apa pun dari kalian atas nasihat dan dakwahku kepada kalian. Balasanku hanyalah dari Penguasa alam semesta.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "144. Maka bertakwalah kepada Allah dengan menjalankan perintah dan menjauhi larangan-Nya, dan taatilah aku dalam perkara yang aku perintahkan dan yang aku larang atas kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "144. Maka beribadahlah kepada Allah dengan penuh keikhlasan, serta taatlah atas perintahku dan laranganku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bertakwalah kepada Allah dan taatlah kepadaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141-144 “kaum tsamud telah mendustakan,” mereka adalah suku terkenal di al-mada’in al-hijr, “rasul-rasul” mereka mendustakan Nabi shaleh yang datang kepada mereka dengan membawa tauhid yang telah diserukan oleh para rasul. Maka demikian, pendustaan mereka terhadap shaleh adalah pendustaan terhadap semua rasul. “ketika saudara mereka, shaleh berkata kepada mereka,” maksudnya adalah saudara senasab, dan ia berkata kepada mereka dengan lembut dan lunak, “mengapa kamu tidak bertakwa,” kepada Allah dan (tidak) meninggalkan syirik dan kemaksiatan? ”sesungguhnya aku adalah seorang rasul untuk kalian,” dari Allah, Rabb kalian. Aku diutus kepada kalian sebagai kasih sayang dan rahmatNya dengan baik dan sikapilah ia dengan tunduk. “terpercaya,” kalian mengetahui hal itu dariku, dan hal ini mengharuskan kalian beriman kepadaku dan kepada ajaran yang aku bawa (ajaranku), “dan aku sekali-kali tidak minta upah kepadamu atas ajakan itu,” sehingga kalian bisa mengatakan, ”yang menghalangi kami untuk mengikutimu adalah karena kamu ingin mengambil harta kami,” “upahku tidak lain hanyalah dari Rabb semesta alam,” maksudnya, aku tidak meminta upah kecuali hanya dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 144: 142-145. Kemudian berkata Nabi mereka Shalih dan saudara senasab dengan Shalih : Tidakkah kalian bertaqwa kepada Allah dan takut dari adzab-Nya karena sebab kesyirikan dan peribadatan kalian kepada selain Allah ?! Shalih berkata kepada mereka : Sungguh telah Allah khususkan kalian dengan diutusnya aku kepada kalian, dan aku adalah orang yang terpercaya atas apa yang aku sampaikan kepada kalian dari Rabbku; Aku tidak mengada-ada dan membuat-buat atas pribadiku, maka bertaqwalah kepada Allah dan berimanlah kepada-Nya, serta taatilah atas apa yang kalian diseru padanya dari tauhid dan menjauhi kesyirikan. Ketahuilah wahai kaum bahwasanya aku tidak meminta kepada kalian upah atas nama dakwahku kepada kalian yang mengajak kepada tauhid, dan aku hanyalah meminta upah dari Allah Rabb semesta alam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 144",
    "description": "144. Karena itu, bertakwalah kepada Allah dan taatlah kepadaku terhadap apa yang aku perintahkan dan yang aku larang kepadamu. 145. \"dan aku tidak meminta suatu imbalan kepadamu atas ajakan itu, baik berupa materi atau non materi. Imbalanku tidak lain hanyalah dari tuhan pemelihara seluruh alam. Dialah yang mengutusku. \"."
  }
]