[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "142-145. Ketika saudara mereka, Shaleh berkata kepada mereka, “Tidakkah kalian takut terhadap siksaan Allah dengan cara mengesakanNya dengan ibadah? Sesungguhnya aku adalah orang yang diutus kepada kalian dan dipercaya untuk membawa risalah ini sebagaimana aku menerimanya dari Allah. Maka takutlah kalian akan siksaan Allah, dan laksanakanlah ajaran yang aku seru kalian kepadanya. Dan aku tidaklah meminta imbalan apa pun dari kalian atas nasihat dan dakwahku kepada kalian. Balasanku hanyalah dari Penguasa alam semesta.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "145. Dan aku sekali-kali tidak meminta upah dari kalian terkait penyampaian wahyu dari Tuhanku; upahku tidak lain hanyalah dari Allah Tuhan segala makhluk, bukan dari selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "145. Sekali-kali aku tidak meminta upah kepadamu atas ajakanku itu, upahku tidak lain adalah urusan Tuhan semesta alam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak meminta imbalan kepada kalian atas itu. Imbalanku tidak lain kecuali dari Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145-152 “adakah kamu akan dibiarkan tinggal disini (di negeri kamu ini) dengan aman, di dalam kebun-kebun serta mata air, dan tanam-tanaman dan pohon-pohon kurma yang mayangnya lembut,” matang lagi banyak. Maksudnya, apakah kalian mengira bahwa kalian dibiarkan berada di dalam berbagai kebaikan dan kenikmatan begitu saja (sia-sia tanpa petunjuk), kalian berfoya-foya dan bersenang-senang sebagaimana halnya hewan ternak? Dan kalian dibiarkan begitu saja tanpa diperintah dan tanpa dilarang, dan kalian menggunakan kenikmatan-kenikmatan ini dalam kemaksiatan kepada Allah? “dan kamu pahat sebagian dari gunung-gunung untuk di jadikan rumah-rumah dengan rajin,” maksudnya, kalian benar-benar telah mencapai kepada kerajinan dan kepintaran hingga bisa membuat rumah-rumah dari gunung yang padat lagi sangat keras. “maka bertakwalah kepada Allah dan taatlah kepadaku; dan janganlah kamu menaati perintah orang-orang yang melewati batas, ”yaitu orang-orang yang melanggar batas, “yang membuat kerusakan di muka bumi dan tidak mengadakan perbaikan,” maksudnya, orang-orang yang karakter dan kebiasaannya adalah membuat kerusakan di muka bumi dengan melakukan kemaksiatan, mengajak kepadanya dengan serusak-rusaknya, bukan untuk memperbaikinya. Ini sangat berbahaya sekali, karena merupakan kejahatan murni. Bagi mereka, seakan-akan ada beberapa orang yang siap untuk menentang nabi mereka, diciptakan untuk mengajak kepada jalan kesesatan. Maka mereka di larang oleh Nabi shaleh agar tidak terpedaya dengan mereka. Mungkin mereka adalah orang-orang yang disebutkan oleh Allah, “dan di kota itu ada sembilah orang laki-laki yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan,” (an-naml:48)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 145: 142-145. Kemudian berkata Nabi mereka Shalih dan saudara senasab dengan Shalih : Tidakkah kalian bertaqwa kepada Allah dan takut dari adzab-Nya karena sebab kesyirikan dan peribadatan kalian kepada selain Allah ?! Shalih berkata kepada mereka : Sungguh telah Allah khususkan kalian dengan diutusnya aku kepada kalian, dan aku adalah orang yang terpercaya atas apa yang aku sampaikan kepada kalian dari Rabbku; Aku tidak mengada-ada dan membuat-buat atas pribadiku, maka bertaqwalah kepada Allah dan berimanlah kepada-Nya, serta taatilah atas apa yang kalian diseru padanya dari tauhid dan menjauhi kesyirikan. Ketahuilah wahai kaum bahwasanya aku tidak meminta kepada kalian upah atas nama dakwahku kepada kalian yang mengajak kepada tauhid, dan aku hanyalah meminta upah dari Allah Rabb semesta alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga kamu mengatakan, “Yang menghalangi kami untuk mengikutimu adalah karena kamu meminta imbalan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 145",
    "description": "145. \"dan aku tidak meminta suatu imbalan kepadamu atas ajakan itu, baik berupa materi atau non materi. Imbalanku tidak lain hanyalah dari tuhan pemelihara seluruh alam. Dialah yang mengutusku. \"146. \"apakah kamu mengira akan dibiarkan tinggal di sini di negeri kamu ini de-ngan segala kenikmatannya, dengan aman, tanpa harus bertanggung jawab terhadap tuhan yang menciptakan kamu'."
  }
]