[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "146-149. Apakah kalian akan dibiarkan oleh Tuhan kalian dalam kenikmatan yang kalian reguk dengan hidup tenang di dunia dan penuh rasa aman dari ancaman siksaan, kehilangan nikmat dan kematian; berada di dalam kebun-kebun yang berbuah, mata-mata air yang mengalir serta tanam-tanaman yang banyak, dan pohon kurma yang buahnya telah matang, lembut lagi masak; dan kalian memahat gunung-gunung menjadi rumah-rumah dengan mahir dalam memahatnya, sombong dan kecongkakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "146. Apakah kalian berharap akan dibiarkan tinggal di negeri ini dengan merasakan berbagai karunia dan kenikmatan, dalam keadaan aman, dan jauh dari rasa takut?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "146-152. Apakah kalian mengira Tuhan kalian akan membiarkan kalian di dunia ini aman dari azab dan kematian? Ketika kalian di kebun-kebun yang subur, mata air yang segar, tanaman-tanaman yang berbuah lebat, pohon-pohon kurma yang buahnya matang dan siap dipanen. Dan kalian dapat membangun rumah-rumah di pegunungan dengan memahatnya dan menyombongkan kemegahannya. Takutlah dari azab Allah dan taatilah perintahku, dan jangan kalian taati perintah orang-orang yang menyesatkan dan selalu berbuat dosa, yang senantiasa berbuat kerusakan di muka bumi dengan menyebarkan kemaksiatan dan enggan memperbaikinya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "146. أَتُتْرَكُونَ فِى مَا هٰهُنَآ ءَامِنِينَ (Adakah kamu akan dibiarkan tinggal disini (di negeri kamu ini) dengan aman) Apakah kalian dalam kenikmatan yang diberikan Allah ini akan dibiarkan aman dari kematian dan azab serta kekal di dunia?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "146. Apakah kalian kira kalian akan dibiarkan tinggal di negeri ini dengan berbagai kenikmatan dan kebaikan bisa aman dari azab dan kematian?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian akan dibiarkan di sini} pada sesuatu yang kalian dapatkan ini berupa kebaikan dan kenikmatan {dengan aman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145-152 “adakah kamu akan dibiarkan tinggal disini (di negeri kamu ini) dengan aman, di dalam kebun-kebun serta mata air, dan tanam-tanaman dan pohon-pohon kurma yang mayangnya lembut,” matang lagi banyak. Maksudnya, apakah kalian mengira bahwa kalian dibiarkan berada di dalam berbagai kebaikan dan kenikmatan begitu saja (sia-sia tanpa petunjuk), kalian berfoya-foya dan bersenang-senang sebagaimana halnya hewan ternak? Dan kalian dibiarkan begitu saja tanpa diperintah dan tanpa dilarang, dan kalian menggunakan kenikmatan-kenikmatan ini dalam kemaksiatan kepada Allah? “dan kamu pahat sebagian dari gunung-gunung untuk di jadikan rumah-rumah dengan rajin,” maksudnya, kalian benar-benar telah mencapai kepada kerajinan dan kepintaran hingga bisa membuat rumah-rumah dari gunung yang padat lagi sangat keras. “maka bertakwalah kepada Allah dan taatlah kepadaku; dan janganlah kamu menaati perintah orang-orang yang melewati batas, ”yaitu orang-orang yang melanggar batas, “yang membuat kerusakan di muka bumi dan tidak mengadakan perbaikan,” maksudnya, orang-orang yang karakter dan kebiasaannya adalah membuat kerusakan di muka bumi dengan melakukan kemaksiatan, mengajak kepadanya dengan serusak-rusaknya, bukan untuk memperbaikinya. Ini sangat berbahaya sekali, karena merupakan kejahatan murni. Bagi mereka, seakan-akan ada beberapa orang yang siap untuk menentang nabi mereka, diciptakan untuk mengajak kepada jalan kesesatan. Maka mereka di larang oleh Nabi shaleh agar tidak terpedaya dengan mereka. Mungkin mereka adalah orang-orang yang disebutkan oleh Allah, “dan di kota itu ada sembilah orang laki-laki yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan,” (an-naml:48)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 146: 146-148. Kemudian berkata Shalih mengingkari kaumnya : Apakah kalian mengira bahwasanya Allah akan membiarkan kalian dia atas kenikmatan dan kenyamanan yang aman dan tenang ? Serta membiarkan kebun-kebun yang hijau ini dan taman-taman yang rimbun, serta mata air yang mengalir dan kebun yang berbuah, yang mana kalian berkhayal akan berbuah banyak dengan tanpa hisab atau pertanyaan tentang syukur dan iman atasnya serta tauhid ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Memperoleh berbagai kesenangan dan dibiarkan begitu saja tidak mendapat perintah dan larangan, dan menggunakan nikmat-nikmat itu untuk bermaksiat kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 146",
    "description": "146. \"apakah kamu mengira akan dibiarkan tinggal di sini di negeri kamu ini de-ngan segala kenikmatannya, dengan aman, tanpa harus bertanggung jawab terhadap tuhan yang menciptakan kamu'147. \"di dalam kebun-kebun yang rindang serta mata air yang jernih dan melimpah, ."
  }
]