[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-17. Allah berfirman kepada Musa, “Sekali-kali tidak. Mereka tidak akan dapat membunuhmu. Dan aku telah mengabulkan permintaanmu terkait Harun. Maka pergilah kalian berdua dengan membawa mukjizat-mukjizat yang menunjukkan kebenaran kalian berdua. Sesungguhnya kami bersama kalian berdua melalui pengetahuan, penjagaan dan pertolongan lagi mendengarkan. Lalu datangilah Fir’aun dan katakanlah kepadanya, sesungguhnya kami berdua diutus kepadamu dan kepada kaummu dari Tuhan alam semesta; karena itu lepaskanlah orang-orang Bani Israil agar pergi bersama kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah berfirman kepada Musa -'alaihissalām-, \"Sekali-kali tidak, mereka tidak akan dapat membunuhmu, maka pergilah engkau bersama saudaramu Harun dengan membawa mukjizat-mukjizat yang membuktikan kebenaran risalah kalian berdua, sesungguhnya Kami bersama kalian berdua dengan menolong dan membantu kalian, sembari mendengarkan apa yang kalian dan mereka katakan, sungguh tidak ada satu halpun yang luput dari Kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-17. Allah berfirman: “Tidak, mereka tidak akan mampu membunuhmu.” Kemudian Allah memerintahkan Musa dan saudaranya, Harun untuk pergi menuju Fir’aun dengan membawa berbagai mukjizat, dan ini setelah Allah mengabulkan permintaan Musa untuk menjadikan Harun sebagai orang yang membantunya. Dan Allah menjanjikan kepada mereka berdua bahwa mereka akan mendapat bantuan dan pertolongan dari-Nya. Dan Allah memerintahkan kepada mereka berdua untuk berkata kepada Fir’aun: “Kami berdua adalah rasul yang diutus Tuhan semesta alam kepadamu; agar kamu membebaskan Bani Israil dan membiarkan mereka pergi bersama kami menuju Baitul Maqdis.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. قَالَ كَلَّا ۖ فَاذْهَبَا بِـَٔايٰتِنَآ ۖ (Allah berfirman: “Jangan takut, maka pergilah kamu berdua dengan membawa ayat-ayat Kami) Jawaban dari Allah ini mengandung pengabulan permintaan Nabi Musa agar Allah menjadikan Harun sebagai Nabi bersamanya. Yakni pergilah kamu dan orang yang kamu ajak itu, dan janganlah kamu takut dari orang-orang Mesir. إِنَّا مَعَكُم مُّسْتَمِعُونَ (sesungguhnya Kami bersamamu mendengarkan) Dengan kalimat ini Allah hendak menguatkan hati keduanya, bahwa Allah yang akan menjaga dan menolong keduanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Allah berfirman: “Janganlah kamu takut untuk dibunuh. Berangkatlah kamu dan saudaramu (mendahulukan fa’il yang hadir atas fa’il yang ghoib) dengan membawa sembilan ayat-ayat kami yang disebutkan dalam surah Al-A’raf [7/133] dan surah Toha [20/17] dan ayat-ayat setelahnya seperti ayat yang menjelaskan tentang banjir bandang dan belalang. Sesungguhnya kami bersama kalian mendengarkan percakapan yang terjadi antara kalian dan Fir’aun”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman} Allah berfirman {“Tidak} mereka tidak akan membunuhmu {Maka pergilah kalian} maka pergilah kamu dan saudaramu, sehingga aku menjadikannya seorang utusan bersamamu {dengan membawa ayat-ayat Kami. Sesungguhnya Kami menyertai kalian dengan mendengarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-17 “Allah berfirman, ’jangan takut’.” Maksudnya, mereka tidak akan bisa membunuhmu, karena Kami akan memberikan suatu kekuasaan kepada kamu berdua, hingga mereka tidak akan bisa menyentuh kamu berdua, hingga mereka tidak akan bisa menyentuh kamu berdua [dengan mukjizat-mukjizat kami], kamu berdua dan orang-orang yang mengikuti kamu berdua adalah yang menang. Maka dari itu, fir’aun tidak mampu membunuh Musa meskipun dia melawannya dengan sangat keras, menganggap bodoh akalnya dan mencap sesat para pengikutnya,.”maka pergilah kamu berdua dengan membawa mukjizat-mukjizat Kami,” yang menunjukkan atas kebenaran kamu berdua dan keshahihan apa yang kamu bawa, “sesungguhnya Kami bersamamu mendengarkan,” aku menjaga dan melindungi kamu berdua. “maka datanglah kamu berdua kepada Fir’aun dan katakanlah olehmu,’sesungguhnya kami adalah Rasul Rabb semesta alam’.” Maksudnya, kami diutus kepadamu agar kamu beriman kepadaNya dan kepada kami, dan agar kamu patuh beribadah kepadaNya dan kepada kami, dan agar kamu patuh beribadah kepadaNya dan tunduk mengesakanNya. “lepaskanlah bani israil (pergi) beserta kami,” maka hentikanlah siksaanmu terhadap mereka dan lepaskanlah tanganmu dari mereka agar mereka bisa beribadah kepada Allah, Rabb mereka, dan agar mereka bisa menegakkan urusan agama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 15: Maka Allah menenangkannya dengan berkata : Sekali-kali tidak, mereka tidak akan membunuhmu, pergilah engkau dan Harun dengan kemukjizaan yang yang menunjukkan atas benarnya kalian berdua, ketahuilah bahwasanya Aku bersama dengan kalian dengan ilmu-Ku, pertolongan dan penglihatan-Ku, dan Aku mendengaran perkataan di antara kalian, dan Aku yang menjaga kalian dari ancaman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meskipun Beliau menentang Fir’aun dan kaumnya, menganggap mereka kurang akal serta menganggap sesat mereka (Fir’aun dan kaumnya). Yang menunjukkan kebenaran kamu berdua dan benarnya apa yang kamu bawa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 15",
    "description": "Mendengar keluhan nabi musa, Allah berfirman, \"hai musa jangan takut terhadap mereka seperti yang kau katakan! mereka tidak akan pernah dapat membunuhmu. Aku akan tetap memeliharamu dan menolongmu maka pergilah kamu berdua menghadap mereka dengan membawa ayat-ayat kami yaitu mukjizat-Mukjizat yang telah kami berikan kepadamu seperti tongkat dan tanganmu. Sungguh, kami bersamamu memeliharamu dan menolongmu, aku akan mendengarkan apa yang mereka katakan. 16. Maka datanglah kamu berdua kepada fir'aun tanpa dihinggapi rasa takut dan katakanlah dengan kesungguhan hati dan kepercayaan diri, 'sesungguhnya kami berdua adalah para rasul tuhan seluruh alam."
  }
]