[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "150-152. Maka takutlah terhadap siksaan Allah, dan terimalah nasihatku, dan janganlah kalian tunduk kepada perintah orang-orang yang melewati batas terhadap diri mereka, yang tidak berhenti dalam bermaksiat kepada Allah, yang berjalan di muka bumi dengan membuat kerusakan tanpa ada tindakan untuk memperbaikinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "151. Dan janganlah kalian mentaati perintah orang-orang yang melewati batas atas diri mereka sendiri dengan melakukan berbagai kemaksiatan,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "151. وَلَا تُطِيعُوٓا۟ أَمْرَ الْمُسْرِفِينَ (dan janganlah kamu mentaati perintah orang-orang yang melewati batas) Yakni orang-orang musyrik yang mengajak mereka untuk menyembah selain Allah dan membuat tipu daya terhadapku dan terhadap dakwah kepada Allah serta memerintahkan kalian untuk mendustai risalahku. Pendapat lain mengatakan mereka adalah orang-orang yang menyembelih unta betina yang merupakan mukjizat Nabi Shalih. Kemudian Allah menyifati orang-orang yang melampaui batas tersebut dengan firman-Nya: الَّذِينَ يُفْسِدُونَ فِى الْأَرْضِ وَلَا يُصْلِحُونَ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "151. Janganlah kalian taati perintah orang-orang yang melewati batas,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menaati perintah orang-orang yang melampaui batas} orang-orang yang melampaui batas dalam kekufuran dan kemasiatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145-152 “adakah kamu akan dibiarkan tinggal disini (di negeri kamu ini) dengan aman, di dalam kebun-kebun serta mata air, dan tanam-tanaman dan pohon-pohon kurma yang mayangnya lembut,” matang lagi banyak. Maksudnya, apakah kalian mengira bahwa kalian dibiarkan berada di dalam berbagai kebaikan dan kenikmatan begitu saja (sia-sia tanpa petunjuk), kalian berfoya-foya dan bersenang-senang sebagaimana halnya hewan ternak? Dan kalian dibiarkan begitu saja tanpa diperintah dan tanpa dilarang, dan kalian menggunakan kenikmatan-kenikmatan ini dalam kemaksiatan kepada Allah? “dan kamu pahat sebagian dari gunung-gunung untuk di jadikan rumah-rumah dengan rajin,” maksudnya, kalian benar-benar telah mencapai kepada kerajinan dan kepintaran hingga bisa membuat rumah-rumah dari gunung yang padat lagi sangat keras. “maka bertakwalah kepada Allah dan taatlah kepadaku; dan janganlah kamu menaati perintah orang-orang yang melewati batas, ”yaitu orang-orang yang melanggar batas, “yang membuat kerusakan di muka bumi dan tidak mengadakan perbaikan,” maksudnya, orang-orang yang karakter dan kebiasaannya adalah membuat kerusakan di muka bumi dengan melakukan kemaksiatan, mengajak kepadanya dengan serusak-rusaknya, bukan untuk memperbaikinya. Ini sangat berbahaya sekali, karena merupakan kejahatan murni. Bagi mereka, seakan-akan ada beberapa orang yang siap untuk menentang nabi mereka, diciptakan untuk mengajak kepada jalan kesesatan. Maka mereka di larang oleh Nabi shaleh agar tidak terpedaya dengan mereka. Mungkin mereka adalah orang-orang yang disebutkan oleh Allah, “dan di kota itu ada sembilah orang laki-laki yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan,” (an-naml:48)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 151: 150-152. Setelah adanya pengingkaran mereka ini, Shalih berkata dengan perasaan takut kepada mereka : Bertaqwalah kepada Allah dan berimanlah, taatilah aku atas apa yang aku seru kepada kalian dari tauhid dan menjauhi kesyirikan, dan janganlah kalian mentaati orang-orang musyrik yang membolehkan menerobos batasan-batasan Allah. Karena sesungguhnya mereka di bumi membuat kerusakan dengan kesyirikan dan menyimpang dari jalan Allah, dan mereka tidak membuat kebaikan di bumi dengan meninggalkan tauhid dan iman kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 151",
    "description": "151. Dan janganlah kamu menaati perintah orang-orang yang melampaui batas, mereka adalah pemuka masyarakat yang kafir, sombong, selalu berbuat onar dan maksiat. Orang-orang yang melakukan itu berjumlah 9 orang (lihat juga: surah an-naml/27: 48). 152. Yang berbuat kerusakan, keonaran dan kemaksiatan di muka bumi yaitu di kawasan antara madinah dan yordania yang disebut dengan negeri madain, tempat tinggal kaum Samud di mana mereka hidup dan mereka sama sekali tidak mengadakan perbaikan dalam kehidupan mereka."
  }
]