[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "153-154. Kaum Tsamud berkata kepada nabi mereka, Shaleh, “Kamu itu tidak lain kecuali termasuk orang yang terkena guna-guna sihir yang banyak sehingga kekuatan sihir menguasai akalmu. Kamu tiada lain hanya seorang manusia yang serupa dengan kami di sisi kemanusiawiannya dari anak keturunan Adam. Mengapa kamu lebih istimewa daripada kami dengan menerima risalah (Allah)? cobalah kamu datangkan sebuah hujjah nyata yang menunjukkan kebenaran kerasulanmu, jika kamu memang jujur dalam pengakuanmu bahwa sesungguhnya Allah telah mengutusmu sebagai rasul kepada kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "153. Kaumnya lalu berkata kepadanya, \"Sesungguhnya engkau adalah salah seorang yang selalu terkena sihir sehingga sihir itu mendominasi akal pikiran mereka dan menghilangkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "153-154. Mereka menjawab dengan penuh kesombongan dan tipu daya: “Kamu hanyalah orang yang terkena sihir yang kuat yang dapat menghilangkan akal. Kamu tidak lain hanyalah manusia seperti kami, datangkanlah mukjizat kepada kami yang menjadi bukti kebenaranmu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "153. قَالُوٓا۟ إِنَّمَآ أَنتَ مِنَ الْمُسَحَّرِينَ (Mereka berkata: “Sesungguhnya kamu adalah salah seorang dari orang-orang yang kena sihir) Yakni termasuk orang-orang yang terkena sihir. Seakan-akan mereka berkata kepadanya: sungguh seorang tukang sihir telah menyihirmu sehingga kamu menganggap sesuatu yang batil sebagai sesuatu yang benar serta mengingkari jalan hidup kami yang damai yang telah dilakukan pula oleh nenek moyang kami. Pendapat lain mengatakan maknanya adalah orang yang bergantung pada makan dan minum. Seakan-akan mereka berkata kepadanya: kamu hanyalah manusia seperti kami yang membutuhkan makan dan minum."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "153. Mereka berkata: \"Sesungguhnya kamu adalah salah satu orang yang gila serta terkena sihir, sehingga kamu menjadi seperti orang yang kerasukan/gila."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Sesungguhnya kamu termasuk orang-orang yang terkena sihir} yang banyak terkena sihir sehingga akalnya didominasi oleh sihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153-154 namun larangan dan nasihat itu sama sekali tidak berguna bagi mereka sedikitpun, maka mereka berkata kepada shaleh,”sesungguhnya kamu adalah salah seorang drai orang-orang yang terkenal sihir,” maksudnya, kamu telah disihir, karena kamu berbicara mengingau tentang suatu yang tidak mempunyai arti. dan “tidaklah kamu melainkan seorang manusia seperti kami,” kelebihan apa yang kamu gunakan untuk menggungguli kami sehingga kamu mengajak kami mengikutimu, ”maka datangkanlah suatu mukjizat, jika kamu termasuk orang-orang yang benar,” padahal hanya dengan mempelajari keadaannya dan kondisi ajaran yang disrukannya sudah merupakan bukti yang sangat jelas atas kebenaran ajaran yang diajarkannya dan kejujurannya. Akan tetapi mereka, karena disebabkan kekerasan hati mereka, maka mereka meminta bukti-bukti yang mereka usulkan yang biasanya orang yang memintanya tidak akan selamat, sebab permintaannya berdasarkan sikap keras kepala, bukan karena mencari petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 153: 153-154. Maka berkata kaum Shalih : Sungguh telah hilang akalmu wahai Shalih, engkat telah terkena sihir yang kuat sehingga membuat akalmu tertutup dan tidak dapat mengontrol ucapanmu sendiri, tidaklah engkau kecuali manusia sama dengan kami, lalu bagaimana mungkin engkau mengklaim bahwasanya Allah mengunggulkanmu atas kami dengan klaim bahwasanya engkau diutus kepada kami ?!, Meskipun engkau sebagaimana yang engkau katakan mengklaim Rasul dari sisi Allah kemudian engkau tidak dapat mendatangkan mukjizat, maka engkau bukanlah Rasul dari sisi Rabb semesta alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga –menurut mereka- ucapan Beliau tidak karuan dan tidak ada maknanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 153",
    "description": "153. Allah menjelaskan sikap penolakan mereka terhadap nabi saleh, mereka berkata: \"sungguh, engkau hanyalah termasuk orang yang kena sihir; karena mereka mendengarkan dakwah nabi saleh dengan ajakan yang tidak sesuai dengan kebiasaan. 154. Engkau wahai saleh, tidak lain hanyalah seorang manusia biasa seperti kami; makan, minum, dan lain-lainnya. Mengapa hanya engkau yang diberi wahyu' maka, oleh karena itu, datangkanlah sesuatu mukjizat, kejadian yang luar biasa jika engkau memang termasuk orang-orang yang benar', bahwa kamu adalah utusan Allah. \"."
  }
]