[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "153-154. Kaum Tsamud berkata kepada nabi mereka, Shaleh, “Kamu itu tidak lain kecuali termasuk orang yang terkena guna-guna sihir yang banyak sehingga kekuatan sihir menguasai akalmu. Kamu tiada lain hanya seorang manusia yang serupa dengan kami di sisi kemanusiawiannya dari anak keturunan Adam. Mengapa kamu lebih istimewa daripada kami dengan menerima risalah (Allah)? cobalah kamu datangkan sebuah hujjah nyata yang menunjukkan kebenaran kerasulanmu, jika kamu memang jujur dalam pengakuanmu bahwa sesungguhnya Allah telah mengutusmu sebagai rasul kepada kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "154. Engkau tidak lain hanyalah seorang manusia biasa seperti kami, dirimu tidak memiliki keistimewaan lebih dari kami yang membuatmu menjadi Rasul, maka datangkanlah suatu mukjizat dan bukti yang menunjukkan kerasulanmu jika engkau memang termasuk orang-orang yang benar dalam klaimmu bahwa engkau seorang Rasul\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "154. مَآ أَنتَ إِلَّا بَشَرٌ مِّثْلُنَا (Kamu tidak lain melainkan seorang manusia seperti kami) Mereka menganggap bahwa karena dia adalah seorang manusia seperti mereka maka berarti ia bohong dalam pengakuannya sebagai seorang nabi. فَأْتِ بِـَٔايَةٍ(maka datangkanlah sesuatu mukjizat) Yakni tanda yang meyakinkan kami ketika kami melihatnya bahwa kamu adalah rasul yang diutus oleh tuhan semesta alam, yaitu mukjizat yang tidak dapat dilakukan manusia. إِن كُنتَ مِنَ الصّٰدِقِينَ(jika kamu memang termasuk orang-orang yang benar) Yakni orang yang benar dalam perkataan dan pengakuannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "154. Kamu wahai Shaleh, tidak lain adalah seorang manusia yang makan juga minum seperti kami; tak ada yang istimewa darimu. Maka datangkanlah suatu mukjizat yang nyata, yang membuktikan kebenaranmu. Jika kamu memang termasuk orang-orang yang benar\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu tidak lain hanyalah manusia seperti kami. Maka datangkanlah tanda, jika kamu termasuk orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153-154 namun larangan dan nasihat itu sama sekali tidak berguna bagi mereka sedikitpun, maka mereka berkata kepada shaleh,”sesungguhnya kamu adalah salah seorang drai orang-orang yang terkenal sihir,” maksudnya, kamu telah disihir, karena kamu berbicara mengingau tentang suatu yang tidak mempunyai arti. dan “tidaklah kamu melainkan seorang manusia seperti kami,” kelebihan apa yang kamu gunakan untuk menggungguli kami sehingga kamu mengajak kami mengikutimu, ”maka datangkanlah suatu mukjizat, jika kamu termasuk orang-orang yang benar,” padahal hanya dengan mempelajari keadaannya dan kondisi ajaran yang disrukannya sudah merupakan bukti yang sangat jelas atas kebenaran ajaran yang diajarkannya dan kejujurannya. Akan tetapi mereka, karena disebabkan kekerasan hati mereka, maka mereka meminta bukti-bukti yang mereka usulkan yang biasanya orang yang memintanya tidak akan selamat, sebab permintaannya berdasarkan sikap keras kepala, bukan karena mencari petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 154: 153-154. Maka berkata kaum Shalih : Sungguh telah hilang akalmu wahai Shalih, engkat telah terkena sihir yang kuat sehingga membuat akalmu tertutup dan tidak dapat mengontrol ucapanmu sendiri, tidaklah engkau kecuali manusia sama dengan kami, lalu bagaimana mungkin engkau mengklaim bahwasanya Allah mengunggulkanmu atas kami dengan klaim bahwasanya engkau diutus kepada kami ?!, Meskipun engkau sebagaimana yang engkau katakan mengklaim Rasul dari sisi Allah kemudian engkau tidak dapat mendatangkan mukjizat, maka engkau bukanlah Rasul dari sisi Rabb semesta alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Engkau tidak mempunyai kelebihan apa-apa di atas kami yang menjadikan kami mengikutimu. Padahal dengan memperhatikan keadaan Beliau dan keadaan seruan Beliau sudah dapat diketahui kebenaran Beliau dan apa yang Beliau bawa, akan tetapi karena kerasnya hati mereka, maka mereka meminta ayat-ayat yang mereka usulkan, di mana pada umumnya orang yang memintanya tidak beruntung, karena permintaannya didasari atas sikap memberatkan diri; bukan untuk mencari petunjuk. Para pemuka mereka kemudian berkumpul dan meminta kepada Nabi Saleh agar Beliau mengeluarkan kepada mereka saat itu juga unta bunting dari sebuah batu yang keras lagi licin yang mereka tunjuk, maka Nabi Saleh mengambil perjanjian dari mereka, bahwa jika Beliau memenuhi keinginan mereka, mereka akan beriman kepadanya dan mengikutinya, lalu mereka mau berjanji. Nabi Saleh Kemudian bangkit, lalu salat, kemudian berdoa kepada Allah ‘Azza wa Jalla agar Dia mengabulkan permintaan mereka, maka pecahlah batu yang keras yang mereka tunjuk itu dan keluar daripadanya unta bunting sesuai yang mereka inginkan, lalu sebagian mereka beriman sedangkan sebagian besarnya tetap kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 154",
    "description": "154. Engkau wahai saleh, tidak lain hanyalah seorang manusia biasa seperti kami; makan, minum, dan lain-lainnya. Mengapa hanya engkau yang diberi wahyu' maka, oleh karena itu, datangkanlah sesuatu mukjizat, kejadian yang luar biasa jika engkau memang termasuk orang-orang yang benar', bahwa kamu adalah utusan Allah. \"155. Kemudian nabi saleh meminta kepada Allah agar diturunkan tanda-tanda kebesaran-Nya sebagaimana yang dimintakan oleh kaum-Nya. Lalu Allah memenuhi permintaan nabi saleh dengan keluarnya seekor unta dari batu-batu besar yang ada di sekeliling mereka. Nabi shaleh menjawab, 'ini seekor unta betina, sebagai pertanda kebenaran kenabianku seperti apa yang kamu inginkan, dengan dua ketentuan. Pertama, dia berhak mendapatkan giliran untuk mendapatkan air minum pada satu hari, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang tertentu, secara bergiliran."
  }
]