[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "155-156. Shaleh berkata kepada mereka setelah membawa seekor unta betina yang Allah keluarkan dari sebongkah batu besar, “Ini adalah unta betina dari Allah, ia mempunyai jatah air pada hari tertentu dan kalian mempunyai jatah dari air itu pada hari yang lain. Kalian tidak boleh mengambil air yang menjadi jatahnya, dan dia pun tidak minum pada hari yang menjadi giliran kalian. Dan janganlah kalian sentuh unta itu dengan tindakan yang akan menyakitinya, seperti memukul, membunuh atau tindakan buruk lainnya, akibatnya Allah akan membinasakan kalian dengan siksaan pada hari yang amat dahsyat, karena kengerian dan kedahsyatan yang terjadi padanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "155. Ṣāleḥ lalu berkata kepada mereka setelah Allah memberikannya tanda kebenaran risalahnya yaitu berupa unta betina yang Allah keluarkan dari sebongkah batu besar, \"Ini seekor unta betina yang bisa dilihat dan disentuh, ia mempunyai kebutuhan air, dan kalian juga mempunyai kebutuhan air, maka ia tidak akan minum pada hari yang menjadi giliran kalian mengambil air, dan kalian juga hendaknya jangan mengambil air pada hari yang menjadi gilirannya untuk minum."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "155-156. Shalih berkata kepada mereka: “Ini merupakan unta betina yang Allah ciptakan bagi kalian, ia memiliki jatah minum di mata air pada hari yang telah ditentukan sehingga kalian dilarang meminumnya pada hari itu, namun kalian dapat meminum air susunya. Dan bagi kalian jatah air pada hari yang telah ditentukan sehingga unta betina itu tidak akan minum pada hari itu. Dan janganlah kalian mengganggu unta betina itu sedikitpun, jika kalian mengganggunya maka Allah akan menyiksa kalian dengan azab yang turun pada hari yang besar.” Abu at-Thufail -yakni ‘Amir bin Wa’ilah- berkata: “Kaum Tsamud berkata kepada Nabi Shalih, ‘Datangkanlah kepada kami bukti jika kamu termasuk orang-orang yang benar’. Maka Shalih berkata, ‘Keluarlah kalian’. Maka mereka keluar menuju gundukan tanah. Ternyata gundukan tanah itu bergerak seperti wanita hamil yang akan melahirkan, kemudian gundukan tanah itu terbelah dan keluar unta betina dari belahan itu. Kemudian Shalih berkata kepada mereka, ‘Ini adalah unta betina yang Allah ciptakan sebagai bukti bagi kalian, maka biarkanlah ia makan di bumi Allah, dan janganlah sekali-kali mengganggunya agar kalian tidak tertimpa azab yang pedih.’ [al-A’raf:73].” (Diriwayatkan oleh al-Bisti dalam tafsirnya. Lihat: at-Tafsir as-Shahih 4/301)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "155. قَالَ هٰذِهِۦ نَاقَةٌ (Shaleh menjawab: “Ini seekor unta betina) Allah mengeluarkan bagi mereka seekor unta betina dari batu gunung setelah mereka meminta mukjizat, yaitu seekor unta yang hidup dan dapat mereka lihat dan pegang dengan tangan mereka agar menjadi bukti atas kenabian Nabi Shalih. لَّهَا شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَّعْلُومٍ (ia mempunyai giliran untuk mendapatkan air, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang tertentu) Kalian tidak boleh minum pada hari yang merupakan giliran unta itu, dan unta itu tidak akan minum pada hari yang merupakan giliran kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "155. Shaleh menjawab: \"Ini seekor unta betina yang Allah ciptakan untuk kalian, ia mempunyai giliran untuk mendapatkan air, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjawab,“Inilah seekor unta betina. Dia punya (giliran) minum} bagian dari air {dan bagi kalian (giliran) minum pada hari yang ditentukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "155-156 maka Shaleh menjawab, “ini seekor unta betina,” akan keluar dari batu besar yang keras lagi mulus,-hal ini banyak kami telusuri dari para ahli tafsir, dan tidak ada faktor penghalang dari hal tersebut- yang akan kalian lihat dan kalian semua saksikan, “ia mempunyai giliran untuk mendapatkan air, dan kamu (mempunyai giliran pula untuk) mendapatkan air di hari yang tertentu.” Maksudnya, unta itu akan minum air sumur suatu hari sedangkan kalian dapat meminum susunya, kemudian ia kembali (pergi) dari kalian pada hari yang lain sedangkan kalian minum dari air sumur, “dan janganlah kamu menyentuhkan unta betina itu dengan suatu kejahatan,” maksudnya, menggoroknya atau lainnya, “yang menyebabkan kamu akan ditimpa oleh azab hari yang besar,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 155: 155-156. Shalih berkata kepada mereka : Unta ini yang keluar dari gunung, Allah telah menjadikannya sebagai mukjizat bagi kalian yang beriman dan membenarkan, unta ini minum air setiap harinya, dan engkau mengairi ladang-ladang kalian dan hewan-hewa ternak kalian setiap harinya, maka janganlah kalian menyentuh unta ini dengan kasar, memukul, mencekik dan lainnya, jika kalian melakukannya sungguh Allah akan mengadzab kalian dengan adzab yang keras, dan pantas bagi kalian terkena adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, hari ini ia meminum air sumurnya dan kamu dapat mengambil air susunya, lalu pada hari berikutnya, ia akan menyingkir dari kamu, sehingga kamu dapat meminum air sumur itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 155",
    "description": "155. Kemudian nabi saleh meminta kepada Allah agar diturunkan tanda-tanda kebesaran-Nya sebagaimana yang dimintakan oleh kaum-Nya. Lalu Allah memenuhi permintaan nabi saleh dengan keluarnya seekor unta dari batu-batu besar yang ada di sekeliling mereka. Nabi shaleh menjawab, 'ini seekor unta betina, sebagai pertanda kebenaran kenabianku seperti apa yang kamu inginkan, dengan dua ketentuan. Pertama, dia berhak mendapatkan giliran untuk mendapatkan air minum pada satu hari, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang tertentu, secara bergiliran. 156. Dan, ketentuan kedua: janganlah kamu sentuh unta betina itu dengan sesuatu kejahatan, baik dengan memukulnya apalagi membunuhnya, hal yang menyebabkan kamu akan ditimpa azab hari yang besar. \"."
  }
]