[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "lalu kemudian mereka menyembelih unta tersebut, maka akibatnya mereka menjadi orang yang merugi atas apa yang mereka kerjakan ketia mereka meyakini datang azab, maka penyesalanmereka sama sekali tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "157. Namun mereka ternyata bersekongkol untuk menyembelihnya, maka iapun disembelih oleh orang yang paling celaka di antara mereka, sehingga merekapun menyesali perbuatan mereka tersebut ketika yakin bahwa azab Allah itu pasti menimpa mereka, dan tidak akan bisa dihindari. Tetapi sungguh penyesalan tatkala menyaksikan turunnya azab sama sekali tidak memberikan manfaat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "157-159. Namun orang yang paling buruk dari mereka menyembelih unta betina itu, sehingga mereka menyesal atas dosa yang telah mereka perbuat. Allah membinasakan mereka semua dengan suara yang menggoncang tanah yang ada di bawah mereka. Akan tetapi mayoritas orang yang mendengar kisah ini tetap tidak beriman kepada Allah dan rasul-Nya. Sungguh pada azab yang besar itu terdapat bukti yang jelas atas besarnya kuasa Allah dalam mengazab orang-orang yang mendustakan dan banyak berdosa. Hai Rasulullah, Sungguh Tuhanmu Maha Perkasa dalam membalas perbuatan orang-orang yang mendustakan dan Maha Pengasih bagi orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "157. فَعَقَرُوهَا فَأَصْبَحُوا۟ نٰدِمِينَ (Kemudian mereka membunuhnya, lalu mereka menjadi menyesal) Yakni menyesal karena telah menyembelihnya setelah mereka mengetahui azab yang menimpa mereka. Allah menangguhkan azab mereka selama tiga hari, dan setiap hari muncul tanda yang menunjukkan azab yang segera turun, sehingga mereka menyesal di saat penyesalan sudah tidak berarti lagi sebab penyesalan tidak dapat bermanfaat bagi mereka saat mereka telah melihat azab dan tanda-tandanya. Sehingga makna firman Allah فَأَصْبَحُوا۟ نٰدِمِينَ , yang dimaksud adalah ketika mereka telah melihat tanda-tanda azab yang akan menimpa mereka sebelum azab itu benar-benar turun pada beberapa hari setelahnya. Lihatlah penjelasannya pada surat Hud ayat 64-68."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "157. Kemudian mereka memanahnya dan unta itu terbunuh, itu dilakukan salah sorang dari mereka dengan persetujuan. Lalu mereka menyesal ketika tanda-tanda turunnya azab telah nampak, dan mereka takut akan kebenaran nabi Shaleh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka membunuhnya} lalu mereka menyembelihnya {dan mereka menjadi orang-orang yang menyesal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "157-159 lalu unta itu pun keluar dan terus berada di sisi mereka dalam keadaan seperti itu, namun mereka tetap tidak beriman dan terus menerus dalam kesesatan mereka, “kemudian mereka membunuhnya, lalu mereka menjadi menyesal, maka mereka ditimpa azab,” yaitu suara dentuman yang sangat keras menimpa mereka hingga membinasakan mereka semua. “sesungguhnya pada yang demikian itu benar-benar terdapat bukti,”yang menunjukkan kebenaran apa yang dibawa (diajarkan) oleh para utusan kami dan kebatilan keyakinan orang-orang yang menentang mereka. “dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Maha penyayang,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 157: 157-159. Akan tetapi mereka masih tetap di atas pengingkaran mereka dan melampaui batas, dan mereka memotong urat kaki agar terjatuh. Kemudian ketika mereka telah yakin bahwa azab akan turun pada mereka, mereka tetap melakukan apa yang mereka lakukan (terhadap unta tersebut); Setelah berlalunya waktu Allah binasakan mereka dengan suara menggelegar yang membinasakan mereka semua. Kemudian Allah menjelaskan bahwa pada kabar ini terdapat tanda yang nyata yang menunjukkan atas kebenaran para utusan Kami dan apa yang datang dari mereka, meskipun demikian kebanyakan manusia tidak beriman kepada Allah dan syariat-Nya dan membenarkan. Ketahuilah wahai Nabi Allah, sungguh bahwasanya Tuhanmu maha kuat yang menguasai segala urusannya, dan dengan kemuliaan-Nya, Allah binasakan para pendusta dan sombong, dialah yang maha penyayang kepada hamba-Nya yang beriman, di mana Allah yang menyelamatan dan menjaga mereka serta memudahkan jalan-jalan hidayah bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang membunuh adalah sebagian mereka, namun yang lain meridhai perbuatan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 157",
    "description": "157. Ternyata mereka melanggar ketentuan ini. Kemudian salah seorang di antara mereka membunuhnya, sementara yang lain mendiamkannya saja, sebagai tanda persetujuan. Dengan persetujuan ini semuanya dianggap ikut terlibat dalam pembunuhan itu. Lalu mereka merasa menyesal atas apa yang telah mereka lakukan, karena mereka tahu akan akibat dari perbuatan mereka yaitu datangnya siksaan Allah. Tapi tak berguna lagi penyesalan itu. Mereka diberi tenggat waktu sampai tiga hari, (lihat: surah hud/11: 65) lalu datanglah azab yang mereka takutkan. 158. Maka mereka ditimpa azab. Yaitu suara yang menggelegar disertai dengan guncangan bumi yang dahsyat (lihat: surah h'd/11:67) dan (al-h'qqah/69: 4). Mereka semua mati bergelimpangan, kecuali nabi saleh dan orang-orang yang beriman kepadanya. Sungguh, pada yang demikian itu, terdapat tanda yang nyata atas ke maha kuasaan Allah dan bahwa janji dan ancaman Allah itu benar adanya. Tetapi kebanyakan mereka tidak beriman, hati mereka terkunci mati oleh kesombongan mereka."
  }
]