[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka datanglah siksaan Allah yang telah diancamkan oleh Shaleh kepada mereka, yang kemudian membinasakan mereka. Sesungguhnya dalam peristiwa dibinasakannya kaum Tsamud benar-benar terdapat pelajaran bagi orang yang mengambil pelajaran dengan kesudahan mereka itu. Dan kebanyakan mereka tidak menjadi orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "158. Maka merekapun ditimpa azab yang telah diperingatkan pada mereka berupa gempa dan teriakan keras. Sesungguhnya apa yang disebutkan berupa kisah Ṣāleḥ dan kaumnya terdapat pelajaran bagi mereka yang benar-benar ingin mengambil pelajaran darinya, akan tetapi kebanyakan mereka tidaklah beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "158. فَأَخَذَهُمُ الْعَذَابُ ۗ (maka mereka ditimpa azab) Azab yang diancamkan kepada mereka. Azab yang menimpa kaum Nabi Shalih adalah bumi yang digoncangkan dengan goncangan yang dahsyat, kemudian muncul suara yang sangat keras yang merontokkan jantung mereka sehingga mereka tergeletak di rumah-rumah mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "158. Maka mereka ditimpa azab, berupa gempa bumi yang sangat dahsyat, sehingga mereka binasa. Sesungguhnya pada yang demikian itu benar-benar terdapat bukti yang nyata. Namun kebanyakan mereka tidak beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka ditimpa azab. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda, dan kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "157-159 lalu unta itu pun keluar dan terus berada di sisi mereka dalam keadaan seperti itu, namun mereka tetap tidak beriman dan terus menerus dalam kesesatan mereka, “kemudian mereka membunuhnya, lalu mereka menjadi menyesal, maka mereka ditimpa azab,” yaitu suara dentuman yang sangat keras menimpa mereka hingga membinasakan mereka semua. “sesungguhnya pada yang demikian itu benar-benar terdapat bukti,”yang menunjukkan kebenaran apa yang dibawa (diajarkan) oleh para utusan kami dan kebatilan keyakinan orang-orang yang menentang mereka. “dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Maha penyayang,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 158: 157-159. Akan tetapi mereka masih tetap di atas pengingkaran mereka dan melampaui batas, dan mereka memotong urat kaki agar terjatuh. Kemudian ketika mereka telah yakin bahwa azab akan turun pada mereka, mereka tetap melakukan apa yang mereka lakukan (terhadap unta tersebut); Setelah berlalunya waktu Allah binasakan mereka dengan suara menggelegar yang membinasakan mereka semua. Kemudian Allah menjelaskan bahwa pada kabar ini terdapat tanda yang nyata yang menunjukkan atas kebenaran para utusan Kami dan apa yang datang dari mereka, meskipun demikian kebanyakan manusia tidak beriman kepada Allah dan syariat-Nya dan membenarkan. Ketahuilah wahai Nabi Allah, sungguh bahwasanya Tuhanmu maha kuat yang menguasai segala urusannya, dan dengan kemuliaan-Nya, Allah binasakan para pendusta dan sombong, dialah yang maha penyayang kepada hamba-Nya yang beriman, di mana Allah yang menyelamatan dan menjaga mereka serta memudahkan jalan-jalan hidayah bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang telah diancamkan, sehingga mereka semua binasa. Bisa juga diartikan, terdapat tanda yang menunjukkan kebenaran apa yang dibawa para rasul dan batilnya perkataan orang-orang yang menentang para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 158",
    "description": "158. Maka mereka ditimpa azab. Yaitu suara yang menggelegar disertai dengan guncangan bumi yang dahsyat (lihat: surah h'd/11:67) dan (al-h'qqah/69: 4). Mereka semua mati bergelimpangan, kecuali nabi saleh dan orang-orang yang beriman kepadanya. Sungguh, pada yang demikian itu, terdapat tanda yang nyata atas ke maha kuasaan Allah dan bahwa janji dan ancaman Allah itu benar adanya. Tetapi kebanyakan mereka tidak beriman, hati mereka terkunci mati oleh kesombongan mereka. 159. Dan sungguh tuhanmu, dialah yang maha perkasa, yang tidak ada yang mampu mengalahkan-Nya, banyaknya orang yang ingkar kepada-Nya tidak mengurangi sedikit pun kekuasaan-Nya. Dia juga maha penyayang yang masih memberikan kesempatan kepada yang berdurhaka untuk kembali bertobat."
  }
]