[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Tuhanmu benar-benar Mahaperkasa Yang berkuasa menundukkan lagi membalas musuh-musuhNya yang mendustakan, juga Maha Penyayang terhadap orang yang beriman dari makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "159. Dan sesungguhnya Tuhanmu -wahai Rasul- benar-benar Dia lah Yang Maha Perkasa, yang membalas kejahatan para musuh-musuh-Nya, lagi Maha Penyayang terhadap mereka yang bertobat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "159. Sesungguhnya Tuhanmu benar-benar Maha Kuasa untuk membalas para musuh-Nya yang kafir. Serta Maha Penyayang kepada para kekasih-Nya yang senantiasa bertaubat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang benar-benar Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "157-159 lalu unta itu pun keluar dan terus berada di sisi mereka dalam keadaan seperti itu, namun mereka tetap tidak beriman dan terus menerus dalam kesesatan mereka, “kemudian mereka membunuhnya, lalu mereka menjadi menyesal, maka mereka ditimpa azab,” yaitu suara dentuman yang sangat keras menimpa mereka hingga membinasakan mereka semua. “sesungguhnya pada yang demikian itu benar-benar terdapat bukti,”yang menunjukkan kebenaran apa yang dibawa (diajarkan) oleh para utusan kami dan kebatilan keyakinan orang-orang yang menentang mereka. “dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Maha penyayang,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 159: 157-159. Akan tetapi mereka masih tetap di atas pengingkaran mereka dan melampaui batas, dan mereka memotong urat kaki agar terjatuh. Kemudian ketika mereka telah yakin bahwa azab akan turun pada mereka, mereka tetap melakukan apa yang mereka lakukan (terhadap unta tersebut); Setelah berlalunya waktu Allah binasakan mereka dengan suara menggelegar yang membinasakan mereka semua. Kemudian Allah menjelaskan bahwa pada kabar ini terdapat tanda yang nyata yang menunjukkan atas kebenaran para utusan Kami dan apa yang datang dari mereka, meskipun demikian kebanyakan manusia tidak beriman kepada Allah dan syariat-Nya dan membenarkan. Ketahuilah wahai Nabi Allah, sungguh bahwasanya Tuhanmu maha kuat yang menguasai segala urusannya, dan dengan kemuliaan-Nya, Allah binasakan para pendusta dan sombong, dialah yang maha penyayang kepada hamba-Nya yang beriman, di mana Allah yang menyelamatan dan menjaga mereka serta memudahkan jalan-jalan hidayah bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 159",
    "description": "159. Dan sungguh tuhanmu, dialah yang maha perkasa, yang tidak ada yang mampu mengalahkan-Nya, banyaknya orang yang ingkar kepada-Nya tidak mengurangi sedikit pun kekuasaan-Nya. Dia juga maha penyayang yang masih memberikan kesempatan kepada yang berdurhaka untuk kembali bertobat. 160-161. Nabi lu' adalah keponakan nabi ibrahim. Kaumnya mendiami negeri sadum, di dataran rendah yordania. Mereka melakukan kejahatan seksual yaitu sodomi. Kaum lu' telah mendustakan para rasul. Setiap rasul dan penggiat kebenaran pasti mendapatkan tantangan dari banyak pihak. Nabi lut menyeru kaumnya untuk kembali ke jalan yang benar. Ketika saudara mereka yang satu negeri dengan mereka, yaitu nabi lu', berkata kepada mereka, \"mengapa kamu tidak bertakwa'' dengan bertakwa kamu akan selamat baik di dunia maupun di akhirat."
  }
]