[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-17. Allah berfirman kepada Musa, “Sekali-kali tidak. Mereka tidak akan dapat membunuhmu. Dan aku telah mengabulkan permintaanmu terkait Harun. Maka pergilah kalian berdua dengan membawa mukjizat-mukjizat yang menunjukkan kebenaran kalian berdua. Sesungguhnya kami bersama kalian berdua melalui pengetahuan, penjagaan dan pertolongan lagi mendengarkan. Lalu datangilah Fir’aun dan katakanlah kepadanya, sesungguhnya kami berdua diutus kepadamu dan kepada kaummu dari Tuhan alam semesta; karena itu lepaskanlah orang-orang Bani Israil agar pergi bersama kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Maka datanglah kamu berdua kepada Fir'aun dan katakanlah kepadanya, \"Sesungguhnya Kami adalah dua Rasul yang diutus kepadamu oleh Rabb segala makhluk,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. فَأْتِيَا فِرْعَوْنَ فَقُولَآ إِنَا رَسُولُ رَبِّ الْعٰلَمِينَ (Maka datanglah kamu berdua kepada Fir’aun dan katakanlah olehmu: “Sesungguhnya Kami adalah Rasul Tuhan semesta alam) Satu orang disebut dengan Rasul, begitu pula dua dan tidak orang. Pendapat lain mengatakan maknanya adalah setiap kami adalah rasul dari Tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Lalu keduanya mendatangi Fir’aun dan berkata kepadanya: “Sesungguhnya kami berdua adalah utusan dari Tuhan semesta alam. Allah mengutus kami kepadamu” Dalam bahasa Arab, penyebutan satu rasul itu untuk menyebut banyak rasul"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu datanglah kepada Fir‘aun dan katakanlah,”Sesungguhnya kami adalah utusan Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-17 “Allah berfirman, ’jangan takut’.” Maksudnya, mereka tidak akan bisa membunuhmu, karena Kami akan memberikan suatu kekuasaan kepada kamu berdua, hingga mereka tidak akan bisa menyentuh kamu berdua, hingga mereka tidak akan bisa menyentuh kamu berdua [dengan mukjizat-mukjizat kami], kamu berdua dan orang-orang yang mengikuti kamu berdua adalah yang menang. Maka dari itu, fir’aun tidak mampu membunuh Musa meskipun dia melawannya dengan sangat keras, menganggap bodoh akalnya dan mencap sesat para pengikutnya,.”maka pergilah kamu berdua dengan membawa mukjizat-mukjizat Kami,” yang menunjukkan atas kebenaran kamu berdua dan keshahihan apa yang kamu bawa, “sesungguhnya Kami bersamamu mendengarkan,” aku menjaga dan melindungi kamu berdua. “maka datanglah kamu berdua kepada Fir’aun dan katakanlah olehmu,’sesungguhnya kami adalah Rasul Rabb semesta alam’.” Maksudnya, kami diutus kepadamu agar kamu beriman kepadaNya dan kepada kami, dan agar kamu patuh beribadah kepadaNya dan kepada kami, dan agar kamu patuh beribadah kepadaNya dan tunduk mengesakanNya. “lepaskanlah bani israil (pergi) beserta kami,” maka hentikanlah siksaanmu terhadap mereka dan lepaskanlah tanganmu dari mereka agar mereka bisa beribadah kepada Allah, Rabb mereka, dan agar mereka bisa menegakkan urusan agama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 16: 16-17. Allah memerintahkan Musa dan Harun untuk masuk menemui fir’aun untuk mendakwahkan tauhid, dan agar mereka berdua berkata : Sungguh kami telah diutus oleh Allah kepadamu untuk beriman kepada-Nya dan mentauhidkan-Nya, dan agar bani israil meninggalkan (penyembahan terhadapmu) dan kembali menyembah Allah dan mengikuti kami serta keluar bersama kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni agar engkau beriman kepada-Nya dan kepada kami serta tunduk beribadah kepada-Nya dan mentauhidkan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 16",
    "description": "Maka datanglah kamu berdua kepada fir'aun tanpa dihinggapi rasa takut dan katakanlah dengan kesungguhan hati dan kepercayaan diri, 'sesungguhnya kami berdua adalah para rasul tuhan seluruh alam. 17. Lepaskanlah bangsa kami yaitu bani israil biarkan mereka pergi bersama kami ketempat yang kami kehendaki. Jangan lagi kau perbudak mereka."
  }
]