[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Luth mendustakan risalahnya. Maka dengan tindakan ini, mereka mendustakan seluruh rasul Allah. sebab, sesungguhnya risalah yang mereka bawa berupa ajaran tauhid dan pokok-pokok ajaran syariat adalah satu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "160. Kaum Lūṭ telah mendustakan para rasul karena mereka mendustakan Nabi mereka, Lūṭ -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "160-164. Kaum Nabi Luth telah mendustakan rasul mereka, Luth sehingga dengan demikian mereka telah mendustakan seluruh rasul-, ketika nabi dan saudara mereka, Luth berkata kepada mereka: “Tidakkah kalian takut azab Allah akibat kalian telah menyembah selain-Nya dan melakukan dosa yang keji? Dan aku adalah rasul dari Allah yang diutus kepada kalian, dan aku jujur dalam menyampaikan risalah kepada kalian. Maka takutlah kalian dari azab Allah dan taatilah perintahku. Aku tidak meminta upah dari kalian atas dakwah yang aku sampaikan kepada kalian, dan balasanku hanya dari Allah Tuhan semesta alam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "160. كَذَّبَتْ قَوْمُ لُوطٍ الْمُرْسَلِينَ (Kaum Luth telah mendustakan rasul-rasul) Tafsir dari ayat 161-164 telah dijelaskan sebelumnya dalam surat ini. Dan kisah nabi Luth telah dijelaskan pula secara lengkap pada surat al-A’raf."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "160. Kaum Luth telah mendustakan rasul-rasul mereka. Bentuk jamak menunjukkan bahwa pendustaan terhadap satu rasul berarti telah mendustakan seluruh rasul"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum Luth telah mendustakan para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160-167 Dia (luth) berkata kepada mereka, dan mereka pun mengatakan seperti yang dikatakan oleh kaum-kaum sebelum mereka. Hati mereka serupa dalam kekafiran, maka serupa pula perkataan-perkataan mereka. Dan mereka, beserta perbuatan syirik yang mereka lakukan juga melakukan perbuatan keji yang tidak pernah dilakukan oleh seorang manusia pun sebelumnya. Maka lebih suka memilih mencabuli para laki-laki, (pencabulan) yang sangat menjijikan lagi sangat busuk, dan mereka tidak menyukai istri-istri mereka yang diciptakan untuk mereka, Karena sikap melampaui batas dan kezahliman mereka. Dan luth pun terus melarang mereka hingga “mereka menjawab, ’hai luth, sesungguhnya jika kamu tidak berhenti, benar-benar kamu termasuk orang-orang yang diusir,” yaitu dari negeri ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 160: Nabi Luth 'alaihis salam berdakwah sebagaimana para nabi sebelumnya, dan kaumnya menyikapi Beliau sebagaimana sikap orang-orang sebelum mereka yang mendustakan para rasul, hati mereka sama dalam kekafiran sehingga ucapannya sama. Di samping mereka (kaum Luth) berbuat syirk, mereka juga mengerjakan perbuatan keji yang belum pernah didahului oleh seorang pun sebelum mereka, mereka lebih memilih menikahi laki-laki dan tidak suka kepada wanita karena sikap melampaui batasnya mereka, maka Nabi Luth senantiasa mendakwahi mereka agar mereka mentauhidkan Allah dan tidak berbuat keji itu, sehingga pada akhirnya kaum Luth berkata, \"Wahai Luth! Jika engkau tidak berhenti, engkau termasuk orang-orang yang terusir.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 160",
    "description": "160-161. Nabi lu' adalah keponakan nabi ibrahim. Kaumnya mendiami negeri sadum, di dataran rendah yordania. Mereka melakukan kejahatan seksual yaitu sodomi. Kaum lu' telah mendustakan para rasul. Setiap rasul dan penggiat kebenaran pasti mendapatkan tantangan dari banyak pihak. Nabi lut menyeru kaumnya untuk kembali ke jalan yang benar. Ketika saudara mereka yang satu negeri dengan mereka, yaitu nabi lu', berkata kepada mereka, \"mengapa kamu tidak bertakwa'' dengan bertakwa kamu akan selamat baik di dunia maupun di akhirat"
  }
]