[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "161-164. Ketika saudara mereka, Luth berkata kepada mereka, “Tidakkah kalian takut kepada siksaan Allah? Sesungguhnya aku adalah utusan dari Tuhan kalian, yang terpercaya untuk menyampaikan risalahNya kepada kalian. Maka hati-hatilah terhadap siksaan Allah atas pendustaan yang kalian lancarkan terhadap RasulNya. Dan ikutilah aku dalam dakwah yang aku serukan kepada kalian. Dan aku tidaklah meminta kepada kalian imbalan atas dakwahku ini untuk menunjukkan kalian kepada jalan hidayah. Dan tidaklah imbalanku kecuali berasal dari Penguasa alam semesta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "161. Tatkala saudara mereka, Lūṭ berkata kepada mereka, \"Mengapa kalian tidak bertakwa kepada Allah dengan meninggalkan berbagai kesyirikan sebagai bentuk rasa takut kepada-Nya?\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "161. Ketika Luth, berkata kepada para saudaranya: \"Mengapa kalian tidak takut atas azab Allah dengan meninggalkan penyembahan terhadap berhala?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika saudara mereka, Luth, berkata kepada mereka,“Mengapa kalian tidak bertakwa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160-167 Dia (luth) berkata kepada mereka, dan mereka pun mengatakan seperti yang dikatakan oleh kaum-kaum sebelum mereka. Hati mereka serupa dalam kekafiran, maka serupa pula perkataan-perkataan mereka. Dan mereka, beserta perbuatan syirik yang mereka lakukan juga melakukan perbuatan keji yang tidak pernah dilakukan oleh seorang manusia pun sebelumnya. Maka lebih suka memilih mencabuli para laki-laki, (pencabulan) yang sangat menjijikan lagi sangat busuk, dan mereka tidak menyukai istri-istri mereka yang diciptakan untuk mereka, Karena sikap melampaui batas dan kezahliman mereka. Dan luth pun terus melarang mereka hingga “mereka menjawab, ’hai luth, sesungguhnya jika kamu tidak berhenti, benar-benar kamu termasuk orang-orang yang diusir,” yaitu dari negeri ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 161",
    "description": "160-161. Nabi lu' adalah keponakan nabi ibrahim. Kaumnya mendiami negeri sadum, di dataran rendah yordania. Mereka melakukan kejahatan seksual yaitu sodomi. Kaum lu' telah mendustakan para rasul. Setiap rasul dan penggiat kebenaran pasti mendapatkan tantangan dari banyak pihak. Nabi lut menyeru kaumnya untuk kembali ke jalan yang benar. Ketika saudara mereka yang satu negeri dengan mereka, yaitu nabi lu', berkata kepada mereka, \"mengapa kamu tidak bertakwa'' dengan bertakwa kamu akan selamat baik di dunia maupun di akhirat. 162. Sungguh, aku ini seorang rasul kepercayaan yang diutus kepadamu untuk membawa misi kebenaran dari tuhan yang mengutusku."
  }
]