[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "165-166. Mengapa kalian berhubungan intim dengan sesama laki dari kalangan Bani Adam, dan kalian meninggalkan wanita-wanita yang diciptakan Allah untuk kesenangan kalian dan kelangsungan keturunan kalian? Bahkan kalian itu dengan tindakan maksiat tersebut adalah kaum yang melewati batas yang telah diperbolehkan oleh Allah bagi kalian, dari perkara yang halal menuju perkara yang diharamkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "165. Mengapa kalian menggauli sesama lelaki di antara manusia lewat dubur-dubur mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "165-166. Kemudian Luth mengingkari perbuatan dosa yang sangat keji: “Mengapa kalian menggauli sesama laki-laki lewat dubur mereka, dan dengan perbuatan keji ini kalian telah menyelisihi tabiat makhluk-makhluk yang lain. Kalian meninggalkan apa yang telah Tuhan kalian halalkan berupa menyalurkan syahwat kepada wanita. Sungguh kalian adalah orang-orang pendosa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "165. أَتَأْتُونَ الذُّكْرَانَ مِنَ الْعٰلَمِينَ (Mengapa kamu mendatangi jenis lelaki di antara manusia) Apakah kalian mengawini orang laki-laki? Padahal itu merupakan perbuatan keji yang belum pernah dilakukan orang-orang sebelum kalian. Kaum Luth melakukan perbuatan keji ini dengan orang-orang asing, sebagaimana dijelaskan pada surat al-A’raf."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "165. Mengapa kamu mendatangi sesama lelaki atau berbuat sodom dengan mereka. Mereka melakukan itu dengan orang-orang aneh/asing"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian mendatangi jenis laki-laki di antara manusia} mengapa kalian mendatangi dubur laki-laki dari anak cucu Adam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160-167 Dia (luth) berkata kepada mereka, dan mereka pun mengatakan seperti yang dikatakan oleh kaum-kaum sebelum mereka. Hati mereka serupa dalam kekafiran, maka serupa pula perkataan-perkataan mereka. Dan mereka, beserta perbuatan syirik yang mereka lakukan juga melakukan perbuatan keji yang tidak pernah dilakukan oleh seorang manusia pun sebelumnya. Maka lebih suka memilih mencabuli para laki-laki, (pencabulan) yang sangat menjijikan lagi sangat busuk, dan mereka tidak menyukai istri-istri mereka yang diciptakan untuk mereka, Karena sikap melampaui batas dan kezahliman mereka. Dan luth pun terus melarang mereka hingga “mereka menjawab, ’hai luth, sesungguhnya jika kamu tidak berhenti, benar-benar kamu termasuk orang-orang yang diusir,” yaitu dari negeri ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 165",
    "description": "165. Mengapa kamu mendatangi, melakukan hubungan seksual dengan sesama jenis laki-laki di antara manusia. Sungguh ini merupakan perbuatan yang sangat keji yang dimurkai Allah. \"166. Dan kamu tinggalkan perempuan yang diciptakan oleh tuhan untuk menjadi istri-istrimu' terhadap merekalah kamu semaikan bibit keturunanmu kelak, untuk menjadi generasi yang saleh yang memakmurkan bumi. Kamu memang orang-orang yang melampaui batas. Karena melakukan sesuatu bukan pada peruntukannya. \"."
  }
]