[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "165-166. Mengapa kalian berhubungan intim dengan sesama laki dari kalangan Bani Adam, dan kalian meninggalkan wanita-wanita yang diciptakan Allah untuk kesenangan kalian dan kelangsungan keturunan kalian? Bahkan kalian itu dengan tindakan maksiat tersebut adalah kaum yang melewati batas yang telah diperbolehkan oleh Allah bagi kalian, dari perkara yang halal menuju perkara yang diharamkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "166. Dan kalian tinggalkan makhluk yang diciptakan oleh Allah untuk pemenuhan syahwat kalian yaitu isteri-isteri kalian? Bahkan kalian adalah orang-orang yang melampaui batas aturan Allah dengan adanya sifat kelainan dan kemungkaran kalian ini\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "166. وَتَذَرُونَ مَا خَلَقَ لَكُمْ رَبُّكُم مِّنْ أَزْوٰجِكُم ۚ (dan kamu tinggalkan isteri-isteri yang dijadikan oleh Tuhanmu untukmu) Yakni dan kalian membiarkan kaum wanita yang diciptakan Allah bagi kalian untuk kalian nikmati. Yang dimaksud dengan kata (الأزواج) adalah kaum wanita, sebab tujuan ucapan Nabi Luth ini adalah mengajak kaumnya untuk menikahi kaum wanita. بَلْ أَنتُمْ قَوْمٌ عَادُونَ(bahkan kamu adalah orang-orang yang melampaui batas) Yakni orang-orang yang melampaui batas dalam melakukan segala kemaksiatan termasuk melakukan kemaksiatan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "166. Justru kalian tinggalkan isteri-isteri yang telah diciptakan oleh Tuhanmu karena kesenanganmu kepada perempuan. Bahkan kamu adalah orang-orang yang melampaui batas dalam kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan kalian meninggalkan} mengabaikan {perempuan yang diciptakan Tuhan untuk menjadi istri-istri kalian. Kalian adalah kaum yang melampaui batas”} melampaui batas-batas ketentuan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160-167 Dia (luth) berkata kepada mereka, dan mereka pun mengatakan seperti yang dikatakan oleh kaum-kaum sebelum mereka. Hati mereka serupa dalam kekafiran, maka serupa pula perkataan-perkataan mereka. Dan mereka, beserta perbuatan syirik yang mereka lakukan juga melakukan perbuatan keji yang tidak pernah dilakukan oleh seorang manusia pun sebelumnya. Maka lebih suka memilih mencabuli para laki-laki, (pencabulan) yang sangat menjijikan lagi sangat busuk, dan mereka tidak menyukai istri-istri mereka yang diciptakan untuk mereka, Karena sikap melampaui batas dan kezahliman mereka. Dan luth pun terus melarang mereka hingga “mereka menjawab, ’hai luth, sesungguhnya jika kamu tidak berhenti, benar-benar kamu termasuk orang-orang yang diusir,” yaitu dari negeri ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 166: Dari yang halal kepada yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 166",
    "description": "166. Dan kamu tinggalkan perempuan yang diciptakan oleh tuhan untuk menjadi istri-istrimu' terhadap merekalah kamu semaikan bibit keturunanmu kelak, untuk menjadi generasi yang saleh yang memakmurkan bumi. Kamu memang orang-orang yang melampaui batas. Karena melakukan sesuatu bukan pada peruntukannya. \"167. Namun dengan angkuh mereka menjawab: \"wahai lu', jika engkau tidak berhenti dari apa yang engkau lakukan, engkau termasuk orang-orang yang terusir dari negeri ini, karena kami tidak menghendaki engkau berada bersama kami. \"."
  }
]