[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Luth berkata kepada Luth, “Jika kamu tidak berhenti dari melarang kami dari menggauli kaum lelaki dan menilai tindakan itu buruk, wahai Luth, pastilah kamu benar-benar termasuk orang-orang yang akan diusir dari negeri kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "167. Kaumnya lalu berkata kepadanya, \"Wahai Lūṭ! Ssesungguhnya jika engkau tidak berhenti melarang kami melakukan perbuatan ini, niscaya engkau dan orang-orang yang mengikutimu termasuk orang-orang yang akan diusir dari negeri kami ini.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "167. Akan tetapi mereka tetap melakukan perbuatan itu, dan mereka bersumpah jika Luth tidak berhenti melarang mereka melakukan perbuatan tersebut maka mereka akan mengusirnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "167. قَالُوا۟ لَئِن لَّمْ تَنتَهِ يٰلُوطُ (Mereka menjawab: “Hai Luth, sesungguhnya jika kamu tidak berhenti) Yakni berhanti mengingkari kami dan menjelek-jelekkan perbuatan kami. لَتَكُونَنَّ مِنَ الْمُخْرَجِينَ (benar-benar kamu termasuk orang-orang yang diusir) Yakni diusir dari negeri kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "167. Mereka menjawab: \"Hai Luth, sesungguhnya jika kamu tidak berhenti untuk melarang perbuatan kami, maka kamu benar-benar termasuk orang-orang yang akan diusir dari negeri kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab,“Wahai Luth, jika tidak berhenti, niscaya kamu benar-benar akan termasuk orang-orang yang diusir”} orang-orang yang diusir dari negeri kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160-167 Dia (luth) berkata kepada mereka, dan mereka pun mengatakan seperti yang dikatakan oleh kaum-kaum sebelum mereka. Hati mereka serupa dalam kekafiran, maka serupa pula perkataan-perkataan mereka. Dan mereka, beserta perbuatan syirik yang mereka lakukan juga melakukan perbuatan keji yang tidak pernah dilakukan oleh seorang manusia pun sebelumnya. Maka lebih suka memilih mencabuli para laki-laki, (pencabulan) yang sangat menjijikan lagi sangat busuk, dan mereka tidak menyukai istri-istri mereka yang diciptakan untuk mereka, Karena sikap melampaui batas dan kezahliman mereka. Dan luth pun terus melarang mereka hingga “mereka menjawab, ’hai luth, sesungguhnya jika kamu tidak berhenti, benar-benar kamu termasuk orang-orang yang diusir,” yaitu dari negeri ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 167: Melakukan nahi munkar terhadap kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 167",
    "description": "167. Namun dengan angkuh mereka menjawab: \"wahai lu', jika engkau tidak berhenti dari apa yang engkau lakukan, engkau termasuk orang-orang yang terusir dari negeri ini, karena kami tidak menghendaki engkau berada bersama kami. \"168. Dia, lut, berkata: \"aku sungguh benci kepada perbuatanmu karena bertentangan dengan fitrah manusia, hanya mengumbar nafsu seksual belaka yang bukan pada tempatnya. \"."
  }
]