[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Luth berkata kepada mereka, “Sesungguhnya aku, terhadap tindakan kalian yang kalian perbuat dengan mendatangi sesama jenis, benar-benar termasuk orang yang membencinya dengan kebencian yang amat besar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "168. Lūṭ berkata kepada mereka, \"Sesungguhnya aku termasuk orang yang sangat benci dan memurkai perbuatan maksiat yang kalian lakukan ini\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "168-173. Luth menjawab mereka dan memandang keji perbuatan mereka: “Sungguh aku termasuk orang yang sangat benci terhadap perbuatan keji yang kalian lakukan. Ya Tuhanku, selamatkanlah aku dan keluargaku dari azab yang berhak mereka dapatkan akibat perbuatan keji mereka.” Dan Kami mengabulkan doa itu, Kami menyelamatkan dia dan keluarganya, kecuali istrinya yang termasuk orang yang akan dibinasakan. Dan Kami binasakan orang-orang lainnya dengan Kami tenggelamkan ke dalam tanah dan Kami hujani mereka dengan hujan batu dari langit, betapa buruknya hujan ini, hujan bagi kaum yang telah diperingatkan oleh nabi mereka namun mereka mendustakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "168. قَالَ إِنِّى لِعَمَلِكُم (Luth berkata: “Sesungguhnya aku kepada perbuatanmu) Yakni perbuatan mengawini sesama lelaki dan perbuatan-perbuatan buruk lainnya yang mereka lakukan. مِّنَ الْقَالِينَ(sangatlah benci) Yakni sangat memurkainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "168. Luth berkata: \"Sesungguhnya aku sangat benci dan marah atas perbuatan sodom yang telah kalian lakukan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Sesungguhnya aku termasuk orang-orang yang sangat benci terhadap perbuatan kalian”} orang-orang yang sangat membenci"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-175 setelah luth melihat mereka terus melakukan kekejian itu, “dia berkata, ’sesungguhnya aku sangat benci kepada perbuatanmu’.” Maksudnya, sangat tidak suka [padanya], melarang dan memperingatkannya. ”(luth berdo’a), ‘ya Rbbku, selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan’.” Yaitu perbuatannya dan dari siksaannya. Maka Allah mengabulkan do’anya. ”lalu kami menyelamatkannya beserta keluarganya semua, kecuali seorang perempuan tua yang termasuk dalam golongan yang tinggal,” maksudnya, yang tingga di dalam siksaan. Dia adalah istrinya. “kemudian kami binasakan yang lain. Dan kami hujani mereka dengan hujan.” Yaitu hujan batu dari sijjil, “maka amatlah jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan itu,” mereka dibinasakan oleh Allah hingga ke akar-akarnya. “sesungguhnya yang pada demikian itu benar-benar terdapat bukti-bukti yang nyata. Dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu, benar-benar Dia-lah Yang Mhaperkasa lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 168",
    "description": "168. Dia, lut, berkata: \"aku sungguh benci kepada perbuatanmu karena bertentangan dengan fitrah manusia, hanya mengumbar nafsu seksual belaka yang bukan pada tempatnya. \"169. Melihat sikap kaumnya yang tidak berubah bahkan menjadi-jadi, nabi lu' memohon keselamatan dari Allah dengan doanya. Lu' berdoa, \"ya tuhanku selamatkanlah aku dan keluargaku dan pengikutku yang beriman dari akibat perbuatan yang mereka kerjakan. \"."
  }
]