[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Luth berdoa kepada Tuhannya ketika sudah putus harapan dari penerimaan mereka terhadap (dakwahnya) dengan berkata, “Wahai Tuhanku, selamatkanlah aku dan selamatkanlah keluargaku dari tindakan yang diperbuat oleh kaumku berupa maksiat yang amat buruk ini dan dari siksaanMu yang akan menimpa mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "169. Iapun berkata memohon kepada Tuhannya, \"Wahai Tuhanku! Selamatkanlah aku beserta keluargaku dari azab yang akan menimpa mereka lantaran kemungkaran yang mereka lakukan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "169. رَبِّ نَجِّنِى وَأَهْلِى مِمَّا يَعْمَلُونَ (Ya Tuhanku selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan) Yakni Nabi Luth berharap kepada Allah untuk melindungi dirinya dan keluarganya dari keburukan kaumnya, dan agar Allah membawanya dan keluarganya pergi dari negeri tersebut supaya terbebas dari perbuatan buruk kaumnya atau selamat dari azab yang akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "169. Nabi Luth berdoa: \"Ya Tuhanku selamatkanlah aku beserta keluargaku dari akibat perbuatan yang mereka kerjakan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Tuhanku, selamatkanlah aku dan keluargaku dari apa yang mereka perbuat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-175 setelah luth melihat mereka terus melakukan kekejian itu, “dia berkata, ’sesungguhnya aku sangat benci kepada perbuatanmu’.” Maksudnya, sangat tidak suka [padanya], melarang dan memperingatkannya. ”(luth berdo’a), ‘ya Rbbku, selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan’.” Yaitu perbuatannya dan dari siksaannya. Maka Allah mengabulkan do’anya. ”lalu kami menyelamatkannya beserta keluarganya semua, kecuali seorang perempuan tua yang termasuk dalam golongan yang tinggal,” maksudnya, yang tingga di dalam siksaan. Dia adalah istrinya. “kemudian kami binasakan yang lain. Dan kami hujani mereka dengan hujan.” Yaitu hujan batu dari sijjil, “maka amatlah jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan itu,” mereka dibinasakan oleh Allah hingga ke akar-akarnya. “sesungguhnya yang pada demikian itu benar-benar terdapat bukti-bukti yang nyata. Dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu, benar-benar Dia-lah Yang Mhaperkasa lagi Maha Penyayang.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 169: Ketika Nabi Luth melihat kaumnya tetap di atas perbuatan itu (syirk dan berbuat keji). Yakni dari perbuatan keji itu dan akibatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 169",
    "description": "169. Melihat sikap kaumnya yang tidak berubah bahkan menjadi-jadi, nabi lu' memohon keselamatan dari Allah dengan doanya. Lu' berdoa, \"ya tuhanku selamatkanlah aku dan keluargaku dan pengikutku yang beriman dari akibat perbuatan yang mereka kerjakan. \"170-171. Lalu kami selamatkan dia bersama keluarganya semua, kecuali seorang perempuan tua yaitu istrinya sendiri, yang termasuk dalam golongan yang tinggal. Dia berkhianat terhadap suaminya, dan bergabung dengan kaumnya yang kafir dan lacur."
  }
]