[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-17. Allah berfirman kepada Musa, “Sekali-kali tidak. Mereka tidak akan dapat membunuhmu. Dan aku telah mengabulkan permintaanmu terkait Harun. Maka pergilah kalian berdua dengan membawa mukjizat-mukjizat yang menunjukkan kebenaran kalian berdua. Sesungguhnya kami bersama kalian berdua melalui pengetahuan, penjagaan dan pertolongan lagi mendengarkan. Lalu datangilah Fir’aun dan katakanlah kepadanya, sesungguhnya kami berdua diutus kepadamu dan kepada kaummu dari Tuhan alam semesta; karena itu lepaskanlah orang-orang Bani Israil agar pergi bersama kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. agar lepaskanlah Bani Israil pergi beserta kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. أَنْ أَرْسِلْ مَعَنَا بَنِىٓ إِسْرٰٓءِيلَ (lepaskanlah Bani Israil (pergi) beserta kami) Yakni ini adalah isi dari risalah ini, yaitu lepaskanlah mereka dari perbudakanmu agar mereka dapat pergi bersamaku meninggalkan Mesir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Isi risalah itu adalah supaya kamu melepaskan Bani Israil bersama kami dan membiarkan mereka lepas dari belenggumu dan perbudakanmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lepaskanlah Bani Israil bersama kami} lepaskanlah Bani Israil dan buatkanlah jalan untuk mereka sehingga mereka bisa berjalan bersama kami menuju Palestina sehingga kamu tidak memperbudak mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-17 “Allah berfirman, ’jangan takut’.” Maksudnya, mereka tidak akan bisa membunuhmu, karena Kami akan memberikan suatu kekuasaan kepada kamu berdua, hingga mereka tidak akan bisa menyentuh kamu berdua, hingga mereka tidak akan bisa menyentuh kamu berdua [dengan mukjizat-mukjizat kami], kamu berdua dan orang-orang yang mengikuti kamu berdua adalah yang menang. Maka dari itu, fir’aun tidak mampu membunuh Musa meskipun dia melawannya dengan sangat keras, menganggap bodoh akalnya dan mencap sesat para pengikutnya,.”maka pergilah kamu berdua dengan membawa mukjizat-mukjizat Kami,” yang menunjukkan atas kebenaran kamu berdua dan keshahihan apa yang kamu bawa, “sesungguhnya Kami bersamamu mendengarkan,” aku menjaga dan melindungi kamu berdua. “maka datanglah kamu berdua kepada Fir’aun dan katakanlah olehmu,’sesungguhnya kami adalah Rasul Rabb semesta alam’.” Maksudnya, kami diutus kepadamu agar kamu beriman kepadaNya dan kepada kami, dan agar kamu patuh beribadah kepadaNya dan kepada kami, dan agar kamu patuh beribadah kepadaNya dan tunduk mengesakanNya. “lepaskanlah bani israil (pergi) beserta kami,” maka hentikanlah siksaanmu terhadap mereka dan lepaskanlah tanganmu dari mereka agar mereka bisa beribadah kepada Allah, Rabb mereka, dan agar mereka bisa menegakkan urusan agama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 17: 16-17. Allah memerintahkan Musa dan Harun untuk masuk menemui fir’aun untuk mendakwahkan tauhid, dan agar mereka berdua berkata : Sungguh kami telah diutus oleh Allah kepadamu untuk beriman kepada-Nya dan mentauhidkan-Nya, dan agar bani israil meninggalkan (penyembahan terhadapmu) dan kembali menyembah Allah dan mengikuti kami serta keluar bersama kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ke Syam. Hentikanlah siksaan-Mu terhadap mereka dan angkatlah tanganmu dari menahan mereka agar mereka dapat beribadah kepada Tuhan mereka serta menegakkan ajaran agama mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 17",
    "description": "Lepaskanlah bangsa kami yaitu bani israil biarkan mereka pergi bersama kami ketempat yang kami kehendaki. Jangan lagi kau perbudak mereka. 18. Mendengar ucapan nabi musa, dia fir'aun, menjawab dengan nada marah dan mengungkit jasanya terhadap nabi musa di masa lalu, 'bukankah kami telah mengasuhmu, memeliharamu dengan sebaik-baiknya dalam lingkungan keluarga kami, yaitu waktu engkau masih kanak-kanak dan engkau tinggal bersama kami beberapa tahun dari umurmu yaitu semenjak engkau masih bayi sampai engkau menjadi pemuda'\"."
  }
]