[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "170-171. Maka Kami menyelamatkan dirinya dan keluarganya dan orang-orang yang menyambut baik dakwahnya semuanya kecuali seorang wanita tua dari keluarganya, yaitu istrinya. Ia tidak ikut beriman. Maka, ia termasuk yang tinggal dalam terpaan siksaan dan kebinasaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "170. Lalu Kami pun mengabulkan doanya, Kami selamatkan ia beserta seluruh keluarganya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "170. فَنَجَّيْنٰهُ وَأَهْلَهُۥٓ أَجْمَعِينَ (Lalu Kami selamatkan ia beserta keluarganya semua) Yakni keluarga dan pengikutnya yang memeluk agamanya, sebab Allah memerintahkan mereka untuk keluar dari negeri itu pada malam hari sebelum azab Allah diturunkan pada pagi harinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "170. Lalu Kami selamatkan ia beserta keluarganya dan orang-orang yang beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami menyelamatkan dia bersama semua keluarganya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-175 setelah luth melihat mereka terus melakukan kekejian itu, “dia berkata, ’sesungguhnya aku sangat benci kepada perbuatanmu’.” Maksudnya, sangat tidak suka [padanya], melarang dan memperingatkannya. ”(luth berdo’a), ‘ya Rbbku, selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan’.” Yaitu perbuatannya dan dari siksaannya. Maka Allah mengabulkan do’anya. ”lalu kami menyelamatkannya beserta keluarganya semua, kecuali seorang perempuan tua yang termasuk dalam golongan yang tinggal,” maksudnya, yang tingga di dalam siksaan. Dia adalah istrinya. “kemudian kami binasakan yang lain. Dan kami hujani mereka dengan hujan.” Yaitu hujan batu dari sijjil, “maka amatlah jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan itu,” mereka dibinasakan oleh Allah hingga ke akar-akarnya. “sesungguhnya yang pada demikian itu benar-benar terdapat bukti-bukti yang nyata. Dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu, benar-benar Dia-lah Yang Mhaperkasa lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 170",
    "description": "170-171. Lalu kami selamatkan dia bersama keluarganya semua, kecuali seorang perempuan tua yaitu istrinya sendiri, yang termasuk dalam golongan yang tinggal. Dia berkhianat terhadap suaminya, dan bergabung dengan kaumnya yang kafir dan lacur"
  }
]