[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "172-173. Kemudian kami membinasakan orang-orang selain mereka dari orang-orang kafir dengan kebinasaan yang paling dahsyat. Dan Kami turunkan pada mereka batu-batu dari langit bak hujan yang membinasakan mereka. Maka amat buruklah hujan yang menimpa orang yang telah diberi peringatan rasul-rasul mereka, namun mereka tidak mau menerima dakwah para rasul itu. Dan sesungguhnya telah diturunkan kepada mereka kebinasaan dan kehancuran yang paling dahsyat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "172. Kemudian ketika Lūṭ dan keluarganya keluar dari negeri Sadūm, Kami binasakan kaumnya yang tinggal di sana dengan sebesar-besarnya kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "172. ثُمَّ دَمَّرْنَا الْاٰخَرِينَ (Kemudian Kami binasakan yang lain) Yakni mereka Kami binasakan dengan tenggelam ke dalam bumi dan dengan angin kencang yang disertai bebatuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "172. Kemudian Kami binasakan yang lain dengan Kami lenyapkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali istri Luth yang terkena azab dan kehancuran {Kemudian Kami binasakan yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-175 setelah luth melihat mereka terus melakukan kekejian itu, “dia berkata, ’sesungguhnya aku sangat benci kepada perbuatanmu’.” Maksudnya, sangat tidak suka [padanya], melarang dan memperingatkannya. ”(luth berdo’a), ‘ya Rbbku, selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan’.” Yaitu perbuatannya dan dari siksaannya. Maka Allah mengabulkan do’anya. ”lalu kami menyelamatkannya beserta keluarganya semua, kecuali seorang perempuan tua yang termasuk dalam golongan yang tinggal,” maksudnya, yang tingga di dalam siksaan. Dia adalah istrinya. “kemudian kami binasakan yang lain. Dan kami hujani mereka dengan hujan.” Yaitu hujan batu dari sijjil, “maka amatlah jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan itu,” mereka dibinasakan oleh Allah hingga ke akar-akarnya. “sesungguhnya yang pada demikian itu benar-benar terdapat bukti-bukti yang nyata. Dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu, benar-benar Dia-lah Yang Mhaperkasa lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 172",
    "description": "172. Kemudian kami binasakan yang lain dan menghancurkan mereka sehancur-hancurnya. 173. Dan setelah negeri mereka dijungkirbalikkan, kami hujani mereka dengan hujan batu yang demikian keras. Maka betapa buruk hujan yang menimpa orang-orang yang telah diberi peringatan itu. Inilah kesudahan dari kaum yang durhaka kepada Allah. Mereka diberi peringatan demi peringatan namun mereka tetap memilih jalan kehidupan yang keji yang dibenci oleh Allah."
  }
]