[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "172-173. Kemudian kami membinasakan orang-orang selain mereka dari orang-orang kafir dengan kebinasaan yang paling dahsyat. Dan Kami turunkan pada mereka batu-batu dari langit bak hujan yang membinasakan mereka. Maka amat buruklah hujan yang menimpa orang yang telah diberi peringatan rasul-rasul mereka, namun mereka tidak mau menerima dakwah para rasul itu. Dan sesungguhnya telah diturunkan kepada mereka kebinasaan dan kehancuran yang paling dahsyat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "173. Dan Kami hujani mereka dengan hujan batu dari langit seperti halnya menurunkan air hujan, maka amat jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan dan diancam oleh Lūṭ dari azab Allah, sebab mereka terus menerus berada dalam kebiasaan mereka mengerjakan berbagai kemungkaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "173. وَأَمْطَرْنَا عَلَيْهِم مَّطَرًا ۖ (Dan Kami hujani mereka dengan hujan (batu)) Yakni bebatuan yang dilempar dari langit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "173. Kami hujani mereka dengan hujan batu dari langit, yang menjadi sejelek-jelek hujan yang menimpa orang-orang yang telah diberi peringatan akan datangnya azab jika mereka tetap durhakan kepada Allah itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menghujani mereka hujan} batu dari tanaah yang mengeras {Betapa buruk} betapa buruk {hujan yang menimpa orang-orang yang telah diberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-175 setelah luth melihat mereka terus melakukan kekejian itu, “dia berkata, ’sesungguhnya aku sangat benci kepada perbuatanmu’.” Maksudnya, sangat tidak suka [padanya], melarang dan memperingatkannya. ”(luth berdo’a), ‘ya Rbbku, selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan’.” Yaitu perbuatannya dan dari siksaannya. Maka Allah mengabulkan do’anya. ”lalu kami menyelamatkannya beserta keluarganya semua, kecuali seorang perempuan tua yang termasuk dalam golongan yang tinggal,” maksudnya, yang tingga di dalam siksaan. Dia adalah istrinya. “kemudian kami binasakan yang lain. Dan kami hujani mereka dengan hujan.” Yaitu hujan batu dari sijjil, “maka amatlah jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan itu,” mereka dibinasakan oleh Allah hingga ke akar-akarnya. “sesungguhnya yang pada demikian itu benar-benar terdapat bukti-bukti yang nyata. Dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu, benar-benar Dia-lah Yang Mhaperkasa lagi Maha Penyayang.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 173: Dari tanah yang keras. Sehingga mereka binasa sampai orang yang terakhir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 173",
    "description": "173. Dan setelah negeri mereka dijungkirbalikkan, kami hujani mereka dengan hujan batu yang demikian keras. Maka betapa buruk hujan yang menimpa orang-orang yang telah diberi peringatan itu. Inilah kesudahan dari kaum yang durhaka kepada Allah. Mereka diberi peringatan demi peringatan namun mereka tetap memilih jalan kehidupan yang keji yang dibenci oleh Allah. 174. Sungguh pada yang demikian itu benar-benar terdapat bukti-bukti yang nyata akan ke maha kuasanya Allah. Dan adalah kebanyakan mereka tidak beriman. Mereka yang ingkar terkena laknat, dan yang yang beriman akan selamat. Inilah ketetapan Allah yang tidak pernah berubah."
  }
]