[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pada siksaan yang menimpa kaum Luth benar-benar terkandung pelajaran dan nasihat yang dapat dipetik oleh orang-orang yang mendustakan, tetapi kebanyakan mereka itu tidak menjadi beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "174. Sesunguhnya pada yang disebutkan itu, berupa azab yang ditimpakan kepada kaum Lūṭ karena perbuatan keji mereka, benar-benar terdapat pelajaran bagi yang ingin mengambil pelajaran darinya, akan tetapi kebanyakan mereka tidaklah beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "174-175. Sungguh pada azab yang besar dan tidak ada tandingannya itu terdapat bukti yang jelas atas besarnya kuasa Allah dalam mengazab orang-orang yang banyak berdosa. Akan tetapi mayoritas orang yang mendengar kisah ini tetap tidak beriman kepada Allah dan rasul-Nya. Hai Rasulullah, Sungguh Tuhanmu Maha Perkasa dalam membalas perbuatan orang-orang yang mendustakan dan Maha Pengasih bagi orang-orang bertakwa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "174-175. Sesunguhnya pada yang demikian itu benar-benar terdapat pelajaran dan nasehat bagi orang yang mau berfikir. Sehingga Allah membinasakan para ahli maksiat dan menyelamatkan orang yang beriman. Kebanyakan mereka tidak beriman. Sesungguhnya Tuhanmu, benar-benar Dialah Yang Maha Perkasa Yang Tidak Terkalahkan lagi Maha Penyayang kepada para kekasih-Nya yang senantiasa bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda, dan kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-175 setelah luth melihat mereka terus melakukan kekejian itu, “dia berkata, ’sesungguhnya aku sangat benci kepada perbuatanmu’.” Maksudnya, sangat tidak suka [padanya], melarang dan memperingatkannya. ”(luth berdo’a), ‘ya Rbbku, selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan’.” Yaitu perbuatannya dan dari siksaannya. Maka Allah mengabulkan do’anya. ”lalu kami menyelamatkannya beserta keluarganya semua, kecuali seorang perempuan tua yang termasuk dalam golongan yang tinggal,” maksudnya, yang tingga di dalam siksaan. Dia adalah istrinya. “kemudian kami binasakan yang lain. Dan kami hujani mereka dengan hujan.” Yaitu hujan batu dari sijjil, “maka amatlah jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan itu,” mereka dibinasakan oleh Allah hingga ke akar-akarnya. “sesungguhnya yang pada demikian itu benar-benar terdapat bukti-bukti yang nyata. Dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu, benar-benar Dia-lah Yang Mhaperkasa lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 174",
    "description": "174. Sungguh pada yang demikian itu benar-benar terdapat bukti-bukti yang nyata akan ke maha kuasanya Allah. Dan adalah kebanyakan mereka tidak beriman. Mereka yang ingkar terkena laknat, dan yang yang beriman akan selamat. Inilah ketetapan Allah yang tidak pernah berubah. 175. Dan sungguh tuhanmu, yang memeliharamu, benar-benar dialah yang mahaperkasa, maha penyayang dengan tidak cepat-cepat menghukum para pendosa, tapi memberikan kesempatan kepada mereka untuk bertobat."
  }
]