[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesumgguhnya Tuhanmu itu Maha perkasa lagi mengalahkan, Yang menundukkan orang-orang yang mendustakan, juga Maha Penyayang terhadap hamba-hambaNya yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "175. Dan sesungguhnya Tuhanmu -wahai Rasul- benar-benar Dia lah Yang Maha Perkasa, yang membalas kejahatan para musuh-musuh-Nya, lagi Maha Penyayang terhadap mereka yang bertobat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "174-175. Sesunguhnya pada yang demikian itu benar-benar terdapat pelajaran dan nasehat bagi orang yang mau berfikir. Sehingga Allah membinasakan para ahli maksiat dan menyelamatkan orang yang beriman. Kebanyakan mereka tidak beriman. Sesungguhnya Tuhanmu, benar-benar Dialah Yang Maha Perkasa Yang Tidak Terkalahkan lagi Maha Penyayang kepada para kekasih-Nya yang senantiasa bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang benar-benar Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-175 setelah luth melihat mereka terus melakukan kekejian itu, “dia berkata, ’sesungguhnya aku sangat benci kepada perbuatanmu’.” Maksudnya, sangat tidak suka [padanya], melarang dan memperingatkannya. ”(luth berdo’a), ‘ya Rbbku, selamatkanlah aku beserta keluargaku dari (akibat) perbuatan yang mereka kerjakan’.” Yaitu perbuatannya dan dari siksaannya. Maka Allah mengabulkan do’anya. ”lalu kami menyelamatkannya beserta keluarganya semua, kecuali seorang perempuan tua yang termasuk dalam golongan yang tinggal,” maksudnya, yang tingga di dalam siksaan. Dia adalah istrinya. “kemudian kami binasakan yang lain. Dan kami hujani mereka dengan hujan.” Yaitu hujan batu dari sijjil, “maka amatlah jeleklah hujan yang menimpa orang-orang yang telah diberi peringatan itu,” mereka dibinasakan oleh Allah hingga ke akar-akarnya. “sesungguhnya yang pada demikian itu benar-benar terdapat bukti-bukti yang nyata. Dan kebanyakan mereka tidak beriman. Dan sesungguhnya Rabbmu, benar-benar Dia-lah Yang Mhaperkasa lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 175",
    "description": "175. Dan sungguh tuhanmu, yang memeliharamu, benar-benar dialah yang mahaperkasa, maha penyayang dengan tidak cepat-cepat menghukum para pendosa, tapi memberikan kesempatan kepada mereka untuk bertobat. 176. Penduduk aikah telah mendustakan para rasul; yaitu nabi syuaib yang diutus kepada mereka, untuk memperbaiki akidah dan akhlak mereka,"
  }
]