[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "176-180. Penduduk yang mendiami tempat yang berpohon rimbun telah mendustakan Rasul mereka, Syu’aib terkait kerasulannya. Maka dengan tindakan itu, mereka telah mendustakan seluruh misi kerasulan. Yaitu tatkala Syu’aib berkata kepada mereka, “Mengapa kalian tidak takut terhadap siksaan Allah atas perbuatan-perbuatan maksiat-maksiat kalian? Sesungguhnnya aku diutus kepada kalian dari Allah untuk menujukkan jalan hidayah bagi kalian, orang yang dapat dipercaya membawakan wahyu yang diwahyukan oleh Allah kepadaku berupa misi risalah. Maka takutlah kalian terhadap siksaan Allah, dan ikutilah apa yang aku serukan kepada kalian, yaitu jalan hidayah menuju Allah; agar kalian mendapat petunjuk. Dan aku tidak meminta dari kalian imbalan apa pun atas seruanku kepada kalian untuk beriman kepada Allah. Dan balasan bagiku tiada lain berasal dari Tuhan alam semesta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "179. Maka bertakwalah kepada Allah dengan menjalankan perintah dan menjauhi larangan-Nya, dan taatilah aku dalam perkara yang aku perintahkan dan yang aku larang atas kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "179. Maka beribadahlah kepada Allah dengan penuh keikhlasan, serta taatlah atas perintahku dan laranganku."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bertakwalah kepada Allah dan taatlah kepadaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "176-180 para penduduk aikah adalah (penduduk) negeri yang penuh dengan kebun-kebun yang lebat dengan pepohonan. Mereka adalah penduduk negeri madyan. Mereka mendustakan nabi mereka, yaitu syu’aib yang datang dengan membawa ajaran yang dibawa oleh para rasul, “ketika syu’aib berkata kepada mereka,’mengapa kamu tidak bertakwa,” kepada Allah, lalu meninggalkan apa yang dapat membuatNya murka dan benci, seperti kekafiran dan kemaksiatan,”sesungguhnya aku adalah seorang rasul untuk kalian, yang terpercaya,” yang semua itu berkonsekuensi agar kalian bertakwa kepada Allah dan taat kepadaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 179",
    "description": "179. Maka bertakwalah kepada Allah dan 'taatlah kepadaku;180. Dan aku tidak meminta imbalan apa pun baik berupa materi atau jasa kepadamu atas ajakan itu, imbalanku tidak lain hanyalah dari tuhan seluruh alam. Dengan tidak adanya imbalan, nabi sy'aib tidak mempunyai kepentingan apa-apa kecuali untuk kemaslahatan mereka."
  }
]