[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan takutlah terhadap siksaan Allah, Dzat yang menciptakan kalian dan menciptakan umat-umat yang mendahului kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "184. Dan bertakwalah kepada Żat yang telah menciptakan kalian dan menciptakan umat-umat yang dahulu dengan cara merasa takut kepada-Nya yang akan menimpakan azab bila kalian tidak beriman\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "184. Dan takutlah kepada Allah dengan mentaati segala perintah-Nya dan menjauhi segala larangan-Nya, Allah-lah yang telah menciptakan kalian dan umat-umat sebelum kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "184. وَاتَّقُوا۟ الَّذِى خَلَقَكُمْ وَالْجِبِلَّةَ الْأَوَّلِينَ (dan bertakwalah kepada Allah yang telah menciptakan kamu dan umat-umat yang dahulu) Yakni kaum-kaum terdahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "184. Takutlah kepada Allah yang telah menciptakan kamu dan umat-umat terdahulu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bertakwalah kepada Dzat yang telah menciptakan kalian dan dan ciptaan} dan menciptakan ciptaan {yang terdahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "181-184 beserta kesyirikan yang mereka lakukan, mereka juga mencurangi takaran dan timbangan. Oleh karena itu, syu’aib berkata kepada mereka,”tunaikanlah takaran,” maksudnya, sempurnakan dan lengkapilah ia, “dan janganlah kamu termasuk orang-orang yang merugikan,” yaitu orang-orang yang mengurangi harta orang lain dan merampasnya dengan mencurangi takaran dan timbangan. “dan timbanglah dengan timbangan yang lurus,” maksudnya, dengan timbangan yang adil, tidak miring. “dan bertakwalah kepada Allah yang telah menciptakan kamu dan umat-umat yang dahulu,” maksudnya, manusia-manusia terdahulu. Sebagimana Dia bersendirian menciptakan kalian dan menciptakan orang-orang sebelum kalian, tanpa ada sekutu bagiNya dalam hal ini, maka dari itu esakanlah Dia dengan ibadah dan tauhid. Sebagimana Dia telah memberi kalian karunia berupa menciptakan kalian dan membekali kalian dengan berbagai nikmat, maka balaslah nikmat itu dengan bersyukur kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 184: Yakni sebagaimana Dia sendiri yang menciptakan kamu dan menciptakan orang-orang sebelum kamu tanpa sekutu, maka sembahlah Dia saja dan jangan menyekutukan-Nya dengan sesuatu, dan sebagaimana Dia sendiri yang memberimu nikmat, maka sikapilah dengan bersyukur kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 184",
    "description": "184. Dan bertakwalah kepada Allah yang telah menciptakan kamu dan umat-umat yang dahulu. Umat terdahulu dari kaum syuaib seperti kaum 'ad, dan 'amud jauh lebih kuat. Mereka dibinasakan oleh Allah karena dosa-dosa mereka. Terhadap ajakan nabi syuaib, mereka mulai berang dan jengkel, lalu mereka mengeluarkan tuduhan dan hasutan yang tidak berdasar. 185. Mereka berkata: \"engkau tidak lain hanyalah orang yang kena sihir, semua nabi yang berdakwah kepada kaumnya dituduh sebagai pesihir sebagai cara untuk menjauhkan para nabi dengan masyarakat."
  }
]