[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "185-187. Mereka berkata, “Sesungguhnya kamu, wahai Syu’aib hanyalah termasuk orang yang terkena pengaruh sihir dengan sangat parah, sehingga mampu mempengaruhi akal-akal mereka sesuai yang diinginkan. Dan tidaklah kamu melainkan seorang manusia persis seperti kami dari sisi kemanusiawian. Mengapa kamu memperoleh keistimewaan mengemban risalah, sementara kami tidak? Sesungguhnya prasangka kuat kami adalah bahwa sesungguhnya kamu termasuk orang-orang yang berdusta dalam pengakuanmu sebagai rasul. Bila kamu memang jujur dalam klaim menjadi seorang nabi, maka mintalah kepada Allah agar Dia menjatuhkan kepada kami sebagian siksaan dari langit yang dapat menghabisi kami sampai ke akar-akarnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "186. Dan engkau tidak lain hanyalah seorang manusia biasa seperti kami. Engkau sama sekali tidak memiliki keistimewaan lebih dari kami yang menjadikan engkau pantas menjadi rasul? Dan sesungguhnya kami tidak menyangkamu kecuali sebagai seorang pendusta dalam klaimmu bahwa dirimu adalah seorang rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "186. Dan kamu tidak lain adalah seorang manusia seperti kami, lalu bagaimana bisa kamu mendapatkan kenabian. Maka sudah ada dua ciri bahwa risalahmu adalah dusta. Manusia yang terkena sihir dan kami yakin bahwa kamu benar-benar termasuk orang-orang yang berdusta"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak lain hanyalah seorang manusia seperti kami dan sesungguhnya kami yakin bahwa kamu benar-benar termasuk orang-orang yang berbohong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "185-187 mereka berkata kepadanya dengan sikap mendustakan dan menolak perkataannya, ”sesungguhnya kamu adalah salah seorang dari orang-orang yang terkenal sihir,” sesungguhnya engkau berbicara dengan pembicaraan orang-orang yang terkenal sihir yang intinya pembicaraanmu tidak perlu digubris, “dan tidaklah kamu melainkan seorang manusia seperti kami,” jadi, kamu tidak sama sekali mempunyai kelebihan yang special (khusus) menggungguli kami, sehingga (mau-maunya) kamu mengajak kami untuk mengikutimu. Ini sama seperti perkataan kaum sebelum dan sesudah mereka yang menentang para rasul dengan syubhat tersebut, yang selalu mereka kemukakan, lakukan dan sepakati, karena kesamaan mereka dalam kekafiran dan keserupaan hati mereka! Para rasul itu menjawab mereka dengan ungkapan, “kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberikan karunia kepada siapa yang Dia kehendaki dari hamba-hambaNya,” (Ibrahim:11) “dan sesungguhnya kami meyakinimu benar-benar orang-orang yang berdusta,” ini adalah sikap lancang, kezhaliman dan perkataan dusta mereka. Mereka sudah sepakat untuk melawan nabi. Karena sesungguhnya tidak seorang rasul pun yang menghadapi kaumnya, mengajak mereka, berdialog dan berdebat dengan mereka melainkan pasti Allah telah memperlihatkan bukti-bukti (mukjizat) melaluinya ynag dapat mereka gunakan untuk meyakini kejujurannya, keamanahannya, terutama nabi syu’aib yang dijuluki orator (singa podium) para nabi, karena sangat baiknya dia dalam menghadapi kaumnya dan mendebat mereka dengan cara terbaik. Kaumnyapun sudah meyakini kejujurannya dan meyakini bahwa yang diajarkannya itu haq (benar), akan tetapi pemberitaan yang mereka lakukan tentang kedustaan syu’aib adalah kedustaan dari mereka sendiri. “maka jatuhkanlah atas kami gumpalan dari langit,” maksudnya, sepotong azab yang dapat mengahabisi kami, “jika kamu termasuk orang-orang yang benar,” ini juga sama dengan perkataan orang-orang yang sejalan dengan mereka, “dan (ingatlah), ketika mereka (orang-orang musyrik) berkata, ’ya Allah, jika betul (al-qur’an) ini benar dari sisiMu, maka hujanilah kami batu dari langit, atau datangkanlah kepadaa kami azab yang pedih,” (aal-anfal:32) atau mereka (memang) meminta sebagian bukti bukti yang mereka usulkan yang mana apa yang mereka minyta itu tidak harus dipenuhi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 186: Yakni engkau tidak memiliki kelebihan di atas kami sehingga kami harus mengikutimu. Hal ini seperti ucapan orang-orang sebelum mereka dan orang-orang setelah mereka yang menentang para rasul dengan syubhat tersebut; syubhat yang senantiasa mereka gunakan, karena sepakatnya mereka di atas kekafiran sehingga hati dan ucapan mereka sama. Syubhat tersebut telah dijawab para rasul, bahwa mereka memang manusia seperti yang lain, akan tetapi Allah memberikan nikmat kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya (lihat surah Ibrahim: 11). Inilah sikap beraninya mereka, berbuat zalim dan berkata dusta. Padahal tidak ada seorang rasul pun kecuali Allah telah menampakkan melalui kedua tangannya ayat-ayat yang menunjukkan kebenaran dan amanahnya, terlebih Syu’aib ‘alaihis salam yang digelari dengan “Khathibul anbiyaa’ (juru bicara para nabi) karena bagusnya dalam menyampaikan nasehat dan dalam berdebat. Kaumnya telah meyakini kebenaran Beliau dan bahwa apa yang Beliau bawa adalah hak (benar), akan tetapi mereka mereka malah menyatakan bahwa Beliau berdusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 186",
    "description": "186. Dan engkau hanyalah manusia seperti kami, yang makan dan minum. Apa keistimewaanmu sehingga engkau menjadi seorang utusan tuhan' dan sesungguhnya kami yakin bahwa engkau benar-benar termasuk orang-orang yang berdusta. Inilah usaha untuk mematikan gerak dakwah nabi syuaib. 187. Mereka dengan pongahnya balik menantang nabi syuaib agar bisa mendatangkan siksaan kepada mereka. Maka cepat jatuhkanlah siksaan tuhanmu kepada kami berupa gumpalan apa saja dari langit, baik berupa batu atau lainnya, jika engkau termasuk orang-orang yang benar bahwa engkau adalah utusan Allah."
  }
]