[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Syu’aib berkata kepada mereka, “Tuhanku lebih mengetahui apa yang kalian perbuat berupa perbuatan syirik dan berbagai maksiat dan (lebih mengetahui) apa yang berhak kalian dapatkan dari jenis siksaan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "188. Syu'aib lalu berkata kepada mereka, \"Tuhanku lebih mengetahui apa yang kalian kerjakan berupa kesyirikan dan maksiat, tidak ada satupun amal perbuatan kalian yang tersembunyi bagi-Nya\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "188. Nabi Syuaib memberi mereka ancaman: “Tuhanku mengetahui segala kemaksiatan dan kekafiran yang kalian kerjakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "188. قَالَ رَبِّىٓ أَعْلَمُ بِمَا تَعْمَلُونَ (Syu’aib berkata: “Tuhanku lebih mengetahui apa yang kamu kerjakan”) Berupa kesyirikan dan kemaksiatan kalian, dan Allah akan membalas kalian jika menghendakinya, dan itu bukan termasuk kuasaku untuk melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "188. Syu´aib berkata: \"Tuhanku lebih mengetahui kemungkaran yang kamu kerjakan. Maha memberi balasan, tidak ada yang tersembunyi dari-Nya. Aku tidak mampu untuk menurunkan azab kepada kalian.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Tuhanku paling mengetahui apa yang kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "188 “syu’aib berkata, ’Rabbku lebih mengetahui apa yang kalian kerjakan,” maksudnya, turunnya azab dan terjadinya bukti-bukti yang diusulkan itu bukan aku yang mendatangkannya atau menimpakannya kepada kalian, kewajibanku tidak lain hanyalah menyampaikan kepada kalian dan menasihati kalian, dan sungguh akupun sudah melakukannya. Dan yang berwenang mendatangkannya adalah Rabbku Yang Maha Mengetahui perbuatan dan keadaan kalian, yang akan memberikan balasan dan akan menghisab (perhitungan amal) kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 188: Maksudnya, turunnya azab dan terjadinya ayat yang diusulkan bukanlah Beliau yang mendatangkan dan menurunkannya, karena tugas Beliau hanyalah menyampaikan dan menasehati, dan hal itu telah Beliau lakukan, dan bahwa yang mendatangkan apa yang mereka minta adalah Allah yang mengetahui amal dan keadaan mereka, yang selanjutnya akan membalas dan menghisab mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 188",
    "description": "188. Nabi syuaib berkata, \"tuhanku lebih mengetahui apa yang kamu kerjakan. \" biarlah dia saja yang akan membuat perhitungan dengan kamu, karena dialah yang mengetahui sepak terjangmu. 189. Kemudian mereka mendustakan syuaib, dengan apa yang dikatakannya, lalu tidak berapa lama, mereka ditimpa azab pada hari yang gelap. Dengan awan ini mereka menganggap bahwa mereka telah selamat, tapi secara mengejutkan mereka dihujani dengan api yang besar dari langit sungguh, azab itulah azab pada hari yang dahsyat. Peristiwa yang memilukan itu semestinya menjadi pelajaran bagi semua pihak."
  }
]