[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tetapi mereka tetap meneruskan pendustaan mereka. Akibatnya, panas yang dahsyat menimpa mereka, sehingga mereka pun berusaha mencari tempat berlindung untuk menaungi mereka. Lalu segumpal awan menaungi mereka. Di bawah awan itu, mereka mendapatkan hawa yang dingin dan angin yang berhembus lembut. Ketika mereka telah berkumpul tepat dibawahnya, tiba-tiba api menyala-nyala menyambar mereka lalu membakar mereka. Itulah peristiwa pembinasaan mereka semua pada hari yang sangat mencekam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "189. Namun kemudian mereka terus mendustakan dirinya, lalu mereka ditimpa azab yang besar, yaitu pada saat hari sangat panas, mereka lalu dinaungi awan yang kemudian menurunkan hujan api yang membakar mereka. Sesungguhnya hari kebinasaan mereka itu adalah hari yang sangat besar kedahsyatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "189. Mereka tetap mendustakannya, sehingga mereka tertimpa azab pada hari ketika mereka dinaungi awan; saat mereka merasakan teriknya matahari, mereka berteduh di bawah naungan awan, dan ketika mereka telah berkumpul semua di bawah awan itu, datanglah api besar yang menimpa mereka semua sehingga mereka terbakar pada hari yang azabnya sangat keras itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "189. فَكَذَّبُوهُ (Kemudian mereka mendustakan Syu’aib) Dan mereka terus-menerus mendustakannya. فَأَخَذَهُمْ عَذَابُ يَوْمِ الظُّلَّةِ ۚ( lalu mereka ditimpa azab pada hari mereka dinaungi awan) Allah menjadikan awan itu di atas kepala mereka kemudian menuruni mereka hujan api yang membinasakan mereka. Allah menimpa mereka dengan apa yang mereka usulkan. إِنَّهُۥ كَانَ عَذَابَ يَوْمٍ عَظِيمٍ(Sesungguhnya azab itu adalah azab hari yang besar) Karena hari itu sangat berat bagi mereka yang tak terukur. Ibnu Abbas berkata: allah mengirim kepada mereka hawa panas dari neraka Jahannam, lalu menyelimuti mereka selama tujuh hari sampai mereka terpanggang hawa panas itu, rumah mereka menjadi sangat panas dan air sumur dan mata air mereka mendidih, lalu mereka berlari dari rumah-rumah mereka sedangkan hawa panas itu tetap menyertai mereka. Allah mengepung mereka dengan matahari yang berada di atas kepala mereka dan pasir yang panas di bawah kaki mereka sampai daging di kaki mereka meleleh, kemudian terbentuk di atas mereka awan hitam yang mereka jadikan sebagai naungan, sampai saat mereka semua telah berada di bawah naungan itu Allah menimpa mereka semua dengan hujan api sehingga mereka binasa, dan Allah menyelamatkan Syu’aib dan orang-orang beriman yang bersamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "189. Kemudian mereka mendustakan Syu´aib, lalu mereka ditimpa azab pada hari dimana mereka dinaungi awan. Awan itu muncul setelah terjadinya panas yang sangat dahsyat. Sesungguhnya azab itu adalah azab pada hari yang agung."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka mendustakannya. Lalu mereka ditimpa azab pada hari yang berawan gelap} awan yang menaungi mereka lalu menurunkan atas mereka api, sehingga mereka semua terbakar {Sesungguhnya itu adalah azab hari yang dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "189-191 “kemudian mereka mendustakannya,” maksudnya, pendustaan telah menjadi karakter mereka, dan kekafiran telah menjadi kebiasaan bagi mereka, hingga bukti-bukti apapun sama sekali tidak bermanfaat bagi mereka dan tidak ada lagi jalan yang terbaik bagi mereka selain turunnya azab. “lalu mereka ditimpa azab pada hari mereka dinaungi awan.” Mereka dinaungi oleh segumpal awan, dan mereka berkumpul di bawahnya sambil menikmati naungannya yang sesungguhnya bukan pemberi naungan. Lalu kilat itu membakar mereka dengan azab, maka mereka akhirnya mati dan meninggalkan kampung halamannya, dan mereka menempati negeri kesengsaraan dan azab. “sesungguhnya azab itu adalah azab hari yang besar,” tidak ada pengembalian lagi bagi mereka kedunia sehingga mereka bisa memperbarui amal mereka, sedangkan azab tidak pernah dihentikan sesaat pun dari mereka, dan tidak pula mereka ditangguhkan. “sesungguhnya pada yang demikian itu benar-benar terdapat tanda,” yang membuktikan kejujuran syu’aib dan kebenaran ajaran yang diserukannya, serta kebatilan penolakan kaumnya terhadapnya, “tetapi kebanyakan mereka tidak beriman,” sekalipun mereka sudah melihat bukti-bukti kebenaran, sebab mereka sama sekali tidak memiliki kesucian dan tidak pula kebaikan. “dan sebagian besar manusia tidak akan beriman walaupun kamu sangat menginginkannya,” (yusuf:103) “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Maha perkasa,” yang dengan kekuatannNya, Dia dapat terhindar dari jangkauan siapapun dan dari tindasan setiap makhluk. “lagi Maha penyayang,” yang rahmat (kasih sayang) adalah sifatNya, yang diantara pengaruhnya adalah seluruh kebaikan yang ada di dunia dan akhirat semenjak Allah menciptakan alam ini hingga tidak ada batasnya; dan di antara keperkasaanNya adalah Dia telah membinasakan musuh-musuhNya saat mereka mendustakan para rasulNya; sedangkan yang termasuk rahmatNya adalah Dia menyelamatkan para wali (kekasihNya) dan orang-orang mukmin yang mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 189: Sikap mendustakan telah melekat dalam diri mereka dan kekafiran telah menjadi kebiasaan mereka, di mana ayat-ayat dan nasehat sudah tidak lagi bermanfaat, sehingga tidak ada cara lain yang dapat menghentikan sikap mereka selain diberikan hukuman. Ibnu Katsir berkata, “Ini termasuk jenis (azab) yang mereka minta, yaitu ditimpakan kepada mereka gumpalan (dari langit). Allah Subhaanahu wa Ta'aala menjadikan hukuman mereka dengan menimpakan panas yang tinggi selama tujuh hari, di mana mereka tidak terlindungi oleh sesuatu apa pun, lalu sebuah awan datang kepada mereka dan menaungi mereka, kemudian mereka pergi ke naungan itu dan berlindung di bawah naungan itu dari panas yang mereka rasakan. Ketika mereka semua telah berkumpul di bawahnya, maka Allah Subhaanahu wa Ta'aala mengirimkan kepada mereka percikan api, gejolaknya dan sinar yang sangat terang, lalu bumi mengguncang mereka, kemudian datang kepada mereka suara keras yang membuat ruh-ruh mereka keluar (mati). Oleh karena itu, Dia berfirman, “Sungguh, itulah azab pada hari yang dahsyat.” Qatadah berkata, “Ubaidullah bin Umar radhiyallahu 'anhu berkata, “Sesungguhnya Allah mengirimkan kepada mereka panas selama tujuh hari, sampai-sampai tidak ada sesuatu pun yang melindungi mereka darinya, kemudian Allah Subhaanahu wa Ta'aala mengadakan untuk mereka sebuah awan, lalu salah seorang di antara mereka pergi kepadanya dan bernaung dengannya, ia merasakan kesejukan dan rasa santai di bawahnya, kemudian ia memberitahukan kepada kaumnya, lalu mereka semua mendatanginya dan bernaung di bawahnya, kemudian dinyalakan api kepada mereka.” Abdurrahman bin Zaid bin Aslam berkata, “Allah mengirimkan kepada mereka naungan, sehingga ketika mereka telah berkumpul (di bawahnya), maka Allah singkirkan naungan itu, lalu sinar matahari dipanaskan kepada mereka, kemudian mereka terbakar sebagaimana belalang terbakar dalam penggorengan.” Muhammad bin Jarir berkata: Dari Yazid Al Bahiliy, (ia berkata), “Aku bertanya kepada Ibnu Abbas tentang ayat ini, “lalu mereka ditimpa azab pada hari yang gelap” maka Beliau menjawab, “Allah mengirimkan kepada mereka guruh dan panas yang tinggi, lalu menimpa nafas mereka, kemudian mereka keluar dari rumah ke lapangan, lalu Allah mengirimkan awan kepada mereka dan menaungi mereka dari panas matahari. Mereka pun merasakan dingin dan kesejukannya, lalu sebagian mereka memanggil (memberitahukan) yang lain, sehingga ketika mereka telah berkumpul di bawah naungan itu, maka Allah mengirimkan api kepada mereka.” Ibnu Abbas melanjutkan, “Itu adalah azab pada hari yang gelap. Itu adalah azab hari yang besar.” Mereka tidak akan kembali lagi ke dunia untuk memperbaiki amal mereka dan mereka akan diazab selama-lamanya, nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 189",
    "description": "189. Kemudian mereka mendustakan syuaib, dengan apa yang dikatakannya, lalu tidak berapa lama, mereka ditimpa azab pada hari yang gelap. Dengan awan ini mereka menganggap bahwa mereka telah selamat, tapi secara mengejutkan mereka dihujani dengan api yang besar dari langit sungguh, azab itulah azab pada hari yang dahsyat. Peristiwa yang memilukan itu semestinya menjadi pelajaran bagi semua pihak. 190. Sungguh, pada kejadian yang demikian itu benar-benar terdapat tanda kekuasaan Allah, tetapi kebanyakan mereka tidak beriman, karena hati mereka sudah tertutup oleh kekafiran, keangkuhan dan kesombongan."
  }
]