[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Fir’aun berkata kepada Musa untuk mengingatkan kebaikan yang tercurah padanya dari Fir’aun, “Bukankah dahulu kami telah mengasuhmu di rumah-rumah kami sewaktu kamu masih kecil, dan kamu tinggal di dalam perawatan kami sekian tahun dari usiamu, dan kemudian kamu berbuat kejahatan dengan membunuh seorang lelaki dari kaumku, ketika kamu memukul dan mendorongnya, dan kamu termasuk orang-orang yang melupakan kenikmatan-kenikmatanku, lagi mengingkari ketuhananku?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan engkau telah berbuat suatu kesalahan besar tatkala membunuh seorang Qibṭik karena menolong seorang kaummu, dan sungguh engkau termasuk golongan orang-orang yang tak tahu balas budi.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَفَعَلْتَ فَعْلَتَكَ الَّتِى فَعَلْتَ (dan kamu telah berbuat suatu perbuatan yang telah kamu lakukan itu) Fir’aun menyebutkan kenikmatan-kenikmatan yang telah ia berikan kepada Musa. Yang dimaksud dengan ‘suatu perbuatan’ di sini adalah perbuatan Musa membunuh orang Mesir. وَأَنتَ مِنَ الْكٰفِرِينَ(dan kamu termasuk golongan orang-orang yang tidak membalas budi) Sebab kamu membunuh salah satu dari kaumku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Lalu kamu membalas asuhan kami terhadapmu dengan mengingkari nikmat yang kami berikan dan membunuh salah seorang dari golongan kami (membunuh seorang suku Qubthy). Kamu itu termasuk orang-orang yang tidak berterima kasih atas nikmat kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu telah melakukan perbuatan yang telah kamu lakukan dan kamu termasuk orang yang ingkar} orang yang mengingkari nikmatku dan kebenaran asuhanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19 maka setelah mereka berdua tiba pada Fir’aun dan mengatakan sesuatu yang telah Allah katakan kepada mereka berdua, fir’aun tetap tidak mau beriman dan tidak mau bersikap lunak, bahkan dia mulai menentang Musa, seraya berkata,”bukankah kami telah mengasuhmu di dalam (keluarga) kami, waktu kamu masih kanak-kanak.” Maksudnya, tidakkah kami telah memberimu segala kebaikan dan kami mengasuhmu semenjak kamu masih bayi dalam asuhan, dan senantiasa tetap demikian, “dan kamu tinggal bersama kami beberapa tahun umurmu. Dan kamu telah berbuat suatu perbuatan yang telah kamu lakukan itu,” yaitu; Musa membunuh seorang qibthi ketika, “orang yang dari golongannya (Bani israil) meminta pertolongan kepadanya, untuk mengalahkan orang yang dari musuhnya (kaum Fir’aun) lalu Musa meninjunya, maka matilah musuhnya itu,” (al-qashah:15) “dan kamu termasuk golongan orang-orang yang kafir,” maksudnya, sedangkan kamu saat itu sejalan dengan kami dan seagama dalam kekafiran. Jadi, fir’aun mengakui kekafiran dirinya secara tidak sadar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 19: 18–19. Berkata fir’aun kepada Musa : Bukankah kami yang memberi kesenangan padamu dan merawatmu ketika engkau kecil serta tidak membunuhmu; Bahkan kami yang memeliharamu di waktu kecil, dan engkau tumbuh bersama kami ? Kemudian engkau berbuat sebagaimana yang telah engkau perbuat dengan membunuh laki-laki Al Qibthi ? Dan engkau termasuk orang yang mengelak atas apa yang telah engkau perbuat, dan telah kami beri engkau kenikmatan kemudian engkau mengingkari nikmat yang kami berikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya adalah perbuatan Nabi Musa ‘alaihis salam membunuh orang Qibti. Lihat pula surah Al Qashash ayat 15."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 19",
    "description": "Fir'aun melanjutkan bicaranya dengan mengungkit kesalahan nabi musa, \"dan engkau, musa, telah melakukan kesalahan dari perbuatan yang telah engkau lakukan dengan membunuh salah seorang bangsaku dan engkau termasuk orang yang tidak tahu berterima kasih. \"20. Dia, yaitu nabi musa, berkata, 'aku telah melakukannya, yakni pembunuhan terhadap seorang qib'i tanpa aku sengaja dan ketika itu aku termasuk orang yang khilaf bahwa pukulanku terhadapnya akan meng-akibatkan kematiannya, padahal aku memukulnya dengan tujuan untuk memberikan pelajaran kepadanya. \"."
  }
]