[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pada peristiwa turunnya siksaan yang menimpa mereka itu benar-benar terdapat petunjuk jelas tentang Kuasa Allah dalam menghukum orang-orang yang mendustakan, dan terkandung pelajaran bagi orang yang mau memetik pelajaran, tetapi kebanyakan dari mereka tidak beriman lagi tidak mau mengambil pelajaran dari kejadian tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "190. Sesungguhnya pada yang disebutkan itu, berupa kebinasaan kaum Syu'aib, terdapat pelajaran bagi orang-orang yang mau mengambil pelajaran, akan tetapi kebanyakan mereka tidaklah beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "190-191. Sungguh pada azab yang besar itu terdapat bukti yang jelas atas besarnya kuasa Allah dalam mengazab orang-orang yang banyak berdosa. Akan tetapi mayoritas orang yang mendengar kisah ini tetap tidak beriman kepada Allah dan rasul-Nya. Hai Rasulullah, Sungguh Tuhanmu Maha Perkasa dalam membalas perbuatan orang-orang yang mendustakan dan Maha Pengasih bagi orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "190. Sesungguhnya dalam cerita penduduk Aikah itu benar-benar terdapat pelajaran bagi orang-orang yang mau berfikir, tetapi kebanyakan kaum Syu’aib mereka tidak beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda, tetapi kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "189-191 “kemudian mereka mendustakannya,” maksudnya, pendustaan telah menjadi karakter mereka, dan kekafiran telah menjadi kebiasaan bagi mereka, hingga bukti-bukti apapun sama sekali tidak bermanfaat bagi mereka dan tidak ada lagi jalan yang terbaik bagi mereka selain turunnya azab. “lalu mereka ditimpa azab pada hari mereka dinaungi awan.” Mereka dinaungi oleh segumpal awan, dan mereka berkumpul di bawahnya sambil menikmati naungannya yang sesungguhnya bukan pemberi naungan. Lalu kilat itu membakar mereka dengan azab, maka mereka akhirnya mati dan meninggalkan kampung halamannya, dan mereka menempati negeri kesengsaraan dan azab. “sesungguhnya azab itu adalah azab hari yang besar,” tidak ada pengembalian lagi bagi mereka kedunia sehingga mereka bisa memperbarui amal mereka, sedangkan azab tidak pernah dihentikan sesaat pun dari mereka, dan tidak pula mereka ditangguhkan. “sesungguhnya pada yang demikian itu benar-benar terdapat tanda,” yang membuktikan kejujuran syu’aib dan kebenaran ajaran yang diserukannya, serta kebatilan penolakan kaumnya terhadapnya, “tetapi kebanyakan mereka tidak beriman,” sekalipun mereka sudah melihat bukti-bukti kebenaran, sebab mereka sama sekali tidak memiliki kesucian dan tidak pula kebaikan. “dan sebagian besar manusia tidak akan beriman walaupun kamu sangat menginginkannya,” (yusuf:103) “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Maha perkasa,” yang dengan kekuatannNya, Dia dapat terhindar dari jangkauan siapapun dan dari tindasan setiap makhluk. “lagi Maha penyayang,” yang rahmat (kasih sayang) adalah sifatNya, yang diantara pengaruhnya adalah seluruh kebaikan yang ada di dunia dan akhirat semenjak Allah menciptakan alam ini hingga tidak ada batasnya; dan di antara keperkasaanNya adalah Dia telah membinasakan musuh-musuhNya saat mereka mendustakan para rasulNya; sedangkan yang termasuk rahmatNya adalah Dia menyelamatkan para wali (kekasihNya) dan orang-orang mukmin yang mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 190: Bisa juga diartikan, “terdapat tanda yang menunjukkan kebenaran Syu’aib, kebenaran dakwah Beliau dan batilnya bantahan kaumnya.” Padahal mereka melihat ayat-ayat itu, namun mereka tidak juga beriman karena tidak ada lagi kebaikan dalam diri mereka dan sudah tidak dapat diharapkan lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 190",
    "description": "190. Sungguh, pada kejadian yang demikian itu benar-benar terdapat tanda kekuasaan Allah, tetapi kebanyakan mereka tidak beriman, karena hati mereka sudah tertutup oleh kekafiran, keangkuhan dan kesombongan. 191. Dan sungguh, tuhanmu, dialah yang maha perkasa. Tidak ada yang bisa mengalahkan-Nya dan tidak terkurangi sedikit pun kekuasaan-Nya dengan banyaknya orang yang kafir kepada-Nya. Dia juga maha penyayang. Yang masih memberikan kesempatan bagi orang yang berdosa untuk bertobat kepada-Nya."
  }
]