[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Tuhanmu itu (wahai Rasul) Dia benar-benar Maha perkasa dalam pembalasanNYa terhadap orang yang Dia hukum dari musuh-musuhNya, Maha Penyayang terhadap hamba-hambaNya yang bertauhid."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "191. Dan sesungguhnya Tuhanmu -wahai Rasul- benar-benar Dia lah Yang Maha Perkasa, yang membalas kejahatan para musuh-musuh-Nya, lagi Maha Penyayang terhadap mereka yang bertobat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "191. Sesungguhnya Tuhanmu benar-benar Maha Perkasa dan Maha Membalas musuh-musuh-Nya, lagi Maha Penyayang kepada para kekasihnya yang beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang benar-benar Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "189-191 “kemudian mereka mendustakannya,” maksudnya, pendustaan telah menjadi karakter mereka, dan kekafiran telah menjadi kebiasaan bagi mereka, hingga bukti-bukti apapun sama sekali tidak bermanfaat bagi mereka dan tidak ada lagi jalan yang terbaik bagi mereka selain turunnya azab. “lalu mereka ditimpa azab pada hari mereka dinaungi awan.” Mereka dinaungi oleh segumpal awan, dan mereka berkumpul di bawahnya sambil menikmati naungannya yang sesungguhnya bukan pemberi naungan. Lalu kilat itu membakar mereka dengan azab, maka mereka akhirnya mati dan meninggalkan kampung halamannya, dan mereka menempati negeri kesengsaraan dan azab. “sesungguhnya azab itu adalah azab hari yang besar,” tidak ada pengembalian lagi bagi mereka kedunia sehingga mereka bisa memperbarui amal mereka, sedangkan azab tidak pernah dihentikan sesaat pun dari mereka, dan tidak pula mereka ditangguhkan. “sesungguhnya pada yang demikian itu benar-benar terdapat tanda,” yang membuktikan kejujuran syu’aib dan kebenaran ajaran yang diserukannya, serta kebatilan penolakan kaumnya terhadapnya, “tetapi kebanyakan mereka tidak beriman,” sekalipun mereka sudah melihat bukti-bukti kebenaran, sebab mereka sama sekali tidak memiliki kesucian dan tidak pula kebaikan. “dan sebagian besar manusia tidak akan beriman walaupun kamu sangat menginginkannya,” (yusuf:103) “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Maha perkasa,” yang dengan kekuatannNya, Dia dapat terhindar dari jangkauan siapapun dan dari tindasan setiap makhluk. “lagi Maha penyayang,” yang rahmat (kasih sayang) adalah sifatNya, yang diantara pengaruhnya adalah seluruh kebaikan yang ada di dunia dan akhirat semenjak Allah menciptakan alam ini hingga tidak ada batasnya; dan di antara keperkasaanNya adalah Dia telah membinasakan musuh-musuhNya saat mereka mendustakan para rasulNya; sedangkan yang termasuk rahmatNya adalah Dia menyelamatkan para wali (kekasihNya) dan orang-orang mukmin yang mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 191: Dengan keperkasaan-Nya Dia mengalahkan musuh-musuh-Nya ketika mereka mendustakan para rasul-Nya. Rahmat (kasih sayang) adalah sifat-Nya, dan di antara atsar (hasilnya) adalah semua kebaikan yang diperoleh makhluk di dunia dan akhirat dari sejak Allah menciptakan alam dan seterusnya. Dengan rahmat-Nya Dia menyelamatkan wali-wali-Nya dan orang-orang yang mengikuti mereka dari kalangan kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 191",
    "description": "191. Dan sungguh, tuhanmu, dialah yang maha perkasa. Tidak ada yang bisa mengalahkan-Nya dan tidak terkurangi sedikit pun kekuasaan-Nya dengan banyaknya orang yang kafir kepada-Nya. Dia juga maha penyayang. Yang masih memberikan kesempatan bagi orang yang berdosa untuk bertobat kepada-Nya. 192. Dan sungguh Al-Qur'an ini benar-benar diturunkan oleh tuhan pemilik dan pemelihara seluruh alam, tuhan yang sangat menyayangi makhluk-Nya, bukan berasal dari yang lain-Nya, sebagaimana yang dituduhkan kaum musyrik, itu bukan untuk mencelakakan mereka."
  }
]