[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "192-195. Dan sesungguhnya al-Qur’an ini, yang didalamnya disebutkan kisah-kisah yang benar sungguh-sungguh diturunkan dari Dzat Yang Maha Pencipta makhluk dan pemilik segala urusan semuanya. Jibril turun dengan membawanya, lalu membacakannya kepadamu (wahai rasul) sehingga kamu dapat menangkapnya dengan hatimu dalam bentuk hafalan dan pemahaman, agar kamu termasuk utusan-utusan Allah yang memperingatkan kaum mereka tentang siksaan Allah. Maka dengan al-Qur’an ini, kamu memperingatkan bangsa manusia dan jin secara keseluruhan. Jibril turun kepadamu dengan membawanya dalan bahasa arab yang jelas maknanya, lagi jelas petunjuknya dalam perkara-perkara yang mereka butuhkan untu memperbaiki urusan-urusan agama dan dunia mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "192. Dan sesungguhnya Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- ini benar-benar diturunkan dari Tuhan segala makhluk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "192-196. Sungguh al-Qur’an ini benar-benar diturunkan dari Tuhan semesta alam; ia diturunkan melalui Jibril kepada hatimu -hai Muhammad- agar kamu dapat mendengar dan menghafalnya serta menjadikan ayat-ayatnya sebagai peringatan dari neraka bagi orang-orang yang mendustakan. Al-Qur’an diturunkan menggunakan bahasa Arab yang fasih dan jelas, dan penurunan al-Qur’an telah dikabarkan dalam kitab-kitab yang dibawa nabi-nabi terdahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "192. Sesungguhnya Al Quran ini benar-benar diturunkan oleh Tuhan semesta alam,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya itu} Sesungguhnya Al-Qur’an {benar-benar diturunkan Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "192 setelah Allah menjelaskan kisah-kisah para Nabi beserta kaumnya masing-masing, bagaimana para nabi itu mengajak mereka, dan bagimana pula kaumnya menolak mereka, serta bagaimana Allah membinasakan musuh-musuh mereka dan kesudahan yang mereka miliki, maka Allah menjelaskan Rasul yang mulia ini, nabi pilihan yang agung (Muhammad) dan ajaran yang dia bawa berupa al-kitab yang di dalamnya terdapat hidayah bagi orang-orang yang berakal, seraya berfirman, ”dan sesungguhnya al-qur’an ini benar-benar diturunkan oleh Rabb semesta alam,” jadi yang menurunkannya adalah pencipta bumi dan langit, yang mengatur seluruh alam dan alam bawah. Sebagiamana Dia membimbing mereka dengan hidayah untuk kemaslahatan dunia dan jasad mereka, maka Dia juga mengurus mereka dengan memberi petunjuk kepada mereka untuk kemaslahatan agama dan akhirat mereka. Dan diantara bentuk pengurusanNya yang paling agung adalah penurunan kitab suci ini (al-qur’an) yang mengandung kebaikan yang banyak dan kebajikan yang berlimpah. Di dalamnya juga terdapat hidayah (pedoman) untuk kemaslahatan dunia dan akhirat dan akhlak mulia yang tidak dimilki oleh kitab suci lainnya. Dan pada firmanNya, “dan sesungguhnya al-qur’an ini benar-benar diturunkan oleh Rabb semesta alam,” terdapat penghormatan terhadapnya dan betapa ia sangat mendapat perhatian karena keberadaannya yang datang dari Allah, bukan drai selainNya, dengan maksud memberikan manfaat dan hidayah kepada kalian di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 192: Setelah Allah Subhaanahu wa Ta'aala menyebutkan kisah para nabi bersama kaumnya masing-masing, bagaimana para nabi mendakwahi mereka dan bagaimana kaumnya menolak seruan para nabi, serta menyebutkan bagaimana Allah membinasakan musuh-musuh-Nya, dan ternyata akibat baik atau kemenangan diperoleh para wali-Nya, maka Dia menyebutkan tentang rasul yang mulia ini, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam, dan kitab yang dibawanya, yang di dalamnya terdapat petunjuk bagi orang-orang yang berakal. Yang menurunkan Al Qur’an adalah Pencipta langit dan bumi, yang mengatur dan menguasai seluruh alam. Sebagaimana Dia mengurus mereka dengan memberikan petunjuk kepada hal yang bermaslahat bagi dunia dan badan mereka, maka Dia mengurus mereka dengan menurunkan kitab yang mulia ini (Al Qur’an) yang mengandung banyak kebaikan, kebijaksanaan, hidayah untuk kebahagiaan di dunia dan akhirat, serta menerangkan akhlak mulia. Dalam kalimat, “Dan sungguh, (Al Quran) ini benar-benar diturunkan oleh Tuhan seluruh alam” terdapat pengagungan-Nya terhadap Al Qur’an ini dan perhatian-Nya terhadapnya, karena ia turun dari sisi Allah, tidak dari selain-Nya, dan maksudnya adalah untuk memberikan manfaat kepada kita serta memberi hidayah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 192",
    "description": "192. Dan sungguh Al-Qur'an ini benar-benar diturunkan oleh tuhan pemilik dan pemelihara seluruh alam, tuhan yang sangat menyayangi makhluk-Nya, bukan berasal dari yang lain-Nya, sebagaimana yang dituduhkan kaum musyrik, itu bukan untuk mencelakakan mereka. 193. Al-qur'an itu dibawa turun secara berangsur-angsur oleh ar-ruh al-amin yaitu jibril, atas izin Allah. Ruh adalah sesuatu yang dengannya raga menjadi hidup, begitu juga Al-Qur'an."
  }
]