[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "192-195. Dan sesungguhnya al-Qur’an ini, yang didalamnya disebutkan kisah-kisah yang benar sungguh-sungguh diturunkan dari Dzat Yang Maha Pencipta makhluk dan pemilik segala urusan semuanya. Jibril turun dengan membawanya, lalu membacakannya kepadamu (wahai rasul) sehingga kamu dapat menangkapnya dengan hatimu dalam bentuk hafalan dan pemahaman, agar kamu termasuk utusan-utusan Allah yang memperingatkan kaum mereka tentang siksaan Allah. Maka dengan al-Qur’an ini, kamu memperingatkan bangsa manusia dan jin secara keseluruhan. Jibril turun kepadamu dengan membawanya dalan bahasa arab yang jelas maknanya, lagi jelas petunjuknya dalam perkara-perkara yang mereka butuhkan untu memperbaiki urusan-urusan agama dan dunia mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "195. Dia menurunkannya dengan bahasa Arab yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "195. بِلِسَانٍ عَرَبِىٍّ مُّبِينٍ (dengan bahasa Arab yang jelas) Allah menjadikan al-Qur’an memakai bahasa Arab sesuai dengan bahasa Rasul yang merupakan orang Arab agar orang-orang musyrik tidak mengatakan “kami tidak dapat memahami apa yang kamu katakan selain bahasa kami” sehingga al-Qur’an yang berbahasa Arab ini dapat memotong alasan mereka dan membantah hujjah mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "195. Allah telah menurunkannya dengan bahasa Arab yang jelas. Yaitu bahasa rasul sendiri, agar orang-orang Arab itu tidak mengatakan bahwa mereka tidak memahami kitab yang diturunkan dengan bahasa lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dengan bahasa Arab yang jelas} yang jelas lagi terang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "193-195 “dia dibawa turun oleh ar-ruh al- amin,” yaitu jibril yang merupakan malaikat yang termulia dan terkuat; yang terpercaya yang telah aman drai keteledoran untuk menambahi dan menguranginya, “kedalam hatimu,” hai Muhammad, “agar kamu menjadi salah seorang dari orang-orang yang memberi peringatan,” kamu menggunakannya untuk membimbing (manusia) ke jalan yang lurus dan dengannya pula kamu memperingatkan mereka dari jalan kesesatan; “dengan bahasa arab yang jelas,” yang merupakan bahasa yang paling mulia, yaitu dengan bahasa orang yang diutus kepada mereka dan langsung mendakwahi mereka semenjak asal; suatu bahasa yang jelas lagi nyata. Cobalah anda renungkan bagaimana keutamaan-keutamaan luar biasa tersebut terhimpun di dalam kitab suci ini. Sesungguhnya ia adalah kitab yang paling utama, dibawa turun oleh malaikat yang paling utama, kepada manusia yang paling utama dan dibelahan bumi yang paling mulia yang merupakan jantungnya, kepada suatu umat yang paling utama yang dikeluarkan untuk manusia, dengan bahasa yang paling utama, paling fasih dan paling mencakup, yaitu bahasa Arab yang sangat jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 195: Yang merupakan bahasa yang paling utama. Dalam Al Qur’an terkandung berbagai keistimewaan, ia merupakan kitab yang paling utama, dibawa oleh malaikat yang paling utama, diturunkan kepada manusia yang paling utama dan disampaikan ke dalam anggota tubuh yang paling utama, yaitu hati serta diberikan kepada umat yang paling utama yang ditampilkan kepada manusia, dan dengan bahasa yang paling utama lagi paling fasih yaitu bahasa Arab yang jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 195",
    "description": "195. Al-qur'an yang diturunkan kepadamu, dan penjelasanmu tentangnya itu dengan bahasa arab yang jelas. Sehingga bisa dengan mudah dipahami oleh masyarakat arab, di mana Al-Qur'an turun pertama kali kepada mereka. 196. Dan sungguh, Al-Qur'an itu benar-benar disebut dalam kitab-kitab orang yang dahulu seperti taurat, zabur, dan injil (lihat: surah al-a'raf/7: 157). Hal ini menunjukkan akan satunya tujuan, satunya sumber, dan keterkaitan antara satu kitab suci dengan kitab suci lainnya sama-sama menyeru kepada tauhid."
  }
]