[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya penyebutan al-qur’an ini benar-benar terbukti kebenarannya di dalam kitab-kitab para nabi terdahulu; kitab-kitab itu memberikan kabar gembira tentangnya dan membenarkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "196. Dan sesungguhnya Al-Qur`ān itu benar-benar telah disebutkan dalam Kitab umat-umat terdahulu, bahkan kitab-kitab samawi terdahulu telah memberitakan tentang turunnya Al-Qur`ān ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "196. وَإِنَّهُۥ لَفِى زُبُرِ الْأَوَّلِينَ (Dan sesungguhnya Al Quran itu benar-benar (tersebut) dalam Kitab-kitab orang yang dahulu) Yakni al-Qur’an ini telah disebutkan dan dikabarkan kedatangannya dalam Taurat dan Injil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "196. Sesungguhnya Al Quran yang turun kepada Muhammad SAW itu benar-benar tersebut sebagai kabar gembira dalam Kitab-kitab orang yang dahulu, yaitu Taurat dan Injil."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Al-Qur’an} sesungguhnya penyebutan turunnya Al-Qur’an {benar-benar ada dalam kitab-kitab orang terdahulu} kitab-kitab para rasul terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "196 “dan sesungguhnya Al-qur’an itu benar-benar (tersebut) dalam kitab-kitab yang dahulu,” maksudnya, telah diberitakan dan dibenarkan oleh kitab-kitab dari umat-umat terdahulu, dan ia pun saat diturunkan sama persis seperti yang diberitakannya, dan al-qur’an pun membenarkannya, bahkan ia datang dengan kebenaran dan membenarkan para rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 196: Yakni diturunkan-Nya Al Qur’an kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni telah diberitakan dan dibenarkan oleh kitab-kitab terdahulu seperti Taurat dan Injil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 196",
    "description": "196. Dan sungguh, Al-Qur'an itu benar-benar disebut dalam kitab-kitab orang yang dahulu seperti taurat, zabur, dan injil (lihat: surah al-a'raf/7: 157). Hal ini menunjukkan akan satunya tujuan, satunya sumber, dan keterkaitan antara satu kitab suci dengan kitab suci lainnya sama-sama menyeru kepada tauhid. 197. Dukungan terhadap kebenaran Al-Qur'an juga datang dari para ulama bani israil. Apakah tidak cukup menjadi bukti bagi mereka, bahwa para ulama bani israil mengetahuinya' mereka, dahulu, bahkan sangat menantikan kedatangan nabi Muhammad."
  }
]