[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apakah tidak cukup bagi mereka, terkait bukti petunjuk bahwa kamu adalah utusan Allah dan al-Qur’an itu haq, pengetahuan para tokoh agama Bani Israil tentang kebenarannya dan orang-orang yang telah beriman kepadanya seperti Abdullah bin Salam?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "197. Dan apakah tidak cukup bagi orang-orang yang mendustakanmu suatu tanda bukti kebenaranmu dengan adanya ilmu dan pengakuan ulama Bani Israil -semisal Abdullah bin Salām- tentang kebenaran wahyu yang turun pada dirimu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "197. Tidakkah orang-orang kafir mendapatkan tanda kebenaran al-Qur’an dan kenabian Muhammad, dan tanda itu diketahui oleh orang-orang berilmu dari kalangan Yahudi dan Nasrani?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "197. أَوَلَمْ يَكُن لَّهُمْ ءَايَةً أَن يَعْلَمَهُۥ عُلَمٰٓؤُا۟ بَنِىٓ إِسْرٰٓءِيلَ (Dan apakah tidak cukup menjadi bukti bagi mereka, bahwa para ulama Bani Israil mengetahuinya?) Yakni ulama Bani Israil yang telah beriman seperti Abdullah bin Salam. Kesaksian Ahli kitab menjadi hujjah atas orang-orang musyrik karena dahulu mereka selalu meminta pandangan dan mempercayai mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "197. Apakah orang musyrik Makkah tidak melihat berbagai bukti kebenaran Alquran dan kenabian nabi Muhammad SAW: artinya agar para Ulama Bani Israil seperti Abdullah bin Salam yang beriman mengetahui pengutusan nabi Muhammad SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah tidak menjadi bukti bagi mereka} bukti atas kebenaran kenabianmu {bahwa Al-Qur’an diketahui oleh para ulama Bani Israil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "197 “dan apakah tidak cukup menjadi bukti bagi mereka,” atas kebenarannya, dan bahwa ia berasal dari Allah, “bahwa para ulama bani israil mengetahuinya?” yaitu orang-orang yang sudah mencapai puncak ilmu sehingga mereka menjadi manusia yang paling mengetahui (ulama), dan mereka adalah orang-orang yang adil. sebab setiap sesuatu yang mengalami ketidak jelasan tentangnya maka dikembalikan kepada ahli ilmu dan pengetahuan, sehingga pendapat mereka menjadi hujjah (argument) terhadap orang-orang selain mereka; sebagaimana halnya para ahli sihir (yang menguasai ilmu sihir) mengetahui kebenaran mukjizat nabi Musa, bahwasannya ia bukan sihir. Maka perkataan orang-orang bodoh sesudah itu tidak perlu dihiraukan lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 197",
    "description": "197. Dukungan terhadap kebenaran Al-Qur'an juga datang dari para ulama bani israil. Apakah tidak cukup menjadi bukti bagi mereka, bahwa para ulama bani israil mengetahuinya' mereka, dahulu, bahkan sangat menantikan kedatangan nabi Muhammad. 198-199. Ayat berikut menjelaskan keangkuhan orang musyrik untuk menerima Al-Qur'an. Dan seandainya Al-Qur'an itu kami turunkan kepada sebagian dari golongan bukan arab yang tidak bisa bercakap arab, lalu ia membacakannya kepada mereka, yakni orang-orang kafir itu, niscaya mereka tidak juga akan beriman kepadanya. Ini menunjukkan keengganan mereka untuk menerima Al-Qur'an. Dari arah mana pun Al-Qur'an itu datang, mereka pasti tak akan beriman dengan berbagai alasan."
  }
]