[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "198-201. Sekiranya Kami menurunkan al-Qur’an ini kepada sebagian orang yang tidak berkomunikasi dengan bahasa Arab, lalu membacakannya kepada orang-orang kafir dari suku Quraisy dengan bahasa Arab yang benar, mereka pasti akan mengingkarinya juga dan mencari-cari alasan atas penentangan mereka itu. Demikianlah, Kami masukkan di hati orang-orang yang durhaka penentangan mereka terhadap al-Qur’an, sehingga menjadi tertanam kuat di hati mereka. Itu disebabkan oleh tindakan zhalim mereka dan kedurhakaan mereka. Maka tidak ada jalan sama sekali (bagi mereka) untuk berubah dari kondisi mereka tersebut dalam mengingkari al-Qur’an, sehingga mereka menyaksikan langsung siksaan dahsyat yang diancamkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "198. Dan jikalau Al-Qur`ān ini Kami turunkan kepada sebagian dari golongan ajam (non-Arab) yang tidak bisa berbahasa Arab,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "198-199. Seandainya al-Qur’an Kami turunkan kepada orang yang tidak berbicara dengan bahasa arab kemudian dia membacakannya kepada orang-orang kafir arab dengan bacaan bahasa arab yang fasih dan benar, niscaya mereka tidak akan beriman kepadanya meski dalam bacaannya terdapat mukjizat yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "198. وَلَوْ نَزَّلْنٰهُ عَلَىٰ بَعْضِ الْأَعْجَمِينَ (Dan kalau Al Quran itu Kami turunkan kepada salah seorang dari golongan bukan Arab) Yakni andai saja Kami turunkan al-Qur’an yang berbahasa Arab kepada orang yang tidak mampu berbicara bahasa Arab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "198. Kalaupun Al Quran itu Kami turunkan kepada salah seorang dari golongan non Arab atau ‘Ajam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya Kami menurunkannya kepada sebagian dari golongan yang bukan Arab} orang-orang yang tidak berbicara bahasa Arab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "198-199 “dan kalau al-qur’an itu kami turunkan kepada salah seorang dari golongan bukan arab,” yaitu orang-orang yang tidak mengerti bahasa orang-orang arab dan tidak bisa mengungkapkannya kepada orang-orang arab sebagaimana mestinya, “lalu dia membacakannya kepada mereka, niscaya mereka tidak akan beriman kepadanya.” Mereka akan mengatakan,”kami tidak mengerti apa yang dia katakan dan kami tidak mengetahui apa yang ia serukan!” maka hendaklah mereka memuji Rabb mereka karena membawakan al-qur’an kepada mereka melalui bahasa drai makhluk yang paling fasih dan paling mampu mengungkapkan maksud-maksud(nya) dengan ungkapan-ungkapan yang sangat jelas, dan orang yang paling tulus. Maka hendaklah mereka segera membenarkannya dan menerimanya dengan patuh dan berserah diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 198: Yakni kaum mafir Mekah ketika itu. Yaitu mereka yang dalam ilmunya dan sebagai manusia yang paling mengetahui. Merekalah orang-orang yang adil, di mana jika terjadi kesamaran, maka kepada merekalah dikembalikan, sehingga ucapan mereka merupakan hujjah terhadap yang lain, sebagaimana para pesihir yang ahli mengetahui bahwa apa yang ditunjukkan Musa ‘alaihis salam bukanlah sihir. Oleh karena itu, ucapan orang-orang jahil setelah mereka tidak perlu diperhatikan. Seperti Abdullah bin Salam dan kawan-kawannya yang ikut beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 198",
    "description": "198-199. Ayat berikut menjelaskan keangkuhan orang musyrik untuk menerima Al-Qur'an. Dan seandainya Al-Qur'an itu kami turunkan kepada sebagian dari golongan bukan arab yang tidak bisa bercakap arab, lalu ia membacakannya kepada mereka, yakni orang-orang kafir itu, niscaya mereka tidak juga akan beriman kepadanya. Ini menunjukkan keengganan mereka untuk menerima Al-Qur'an. Dari arah mana pun Al-Qur'an itu datang, mereka pasti tak akan beriman dengan berbagai alasan"
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Yaitu mereka yang tidak paham bahasa Arab dan tidak sanggup mengungkapkan kepada orang-orang Arab secara baik."
  }
]