[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "198-201. Sekiranya Kami menurunkan al-Qur’an ini kepada sebagian orang yang tidak berkomunikasi dengan bahasa Arab, lalu membacakannya kepada orang-orang kafir dari suku Quraisy dengan bahasa Arab yang benar, mereka pasti akan mengingkarinya juga dan mencari-cari alasan atas penentangan mereka itu. Demikianlah, Kami masukkan di hati orang-orang yang durhaka penentangan mereka terhadap al-Qur’an, sehingga menjadi tertanam kuat di hati mereka. Itu disebabkan oleh tindakan zhalim mereka dan kedurhakaan mereka. Maka tidak ada jalan sama sekali (bagi mereka) untuk berubah dari kondisi mereka tersebut dalam mengingkari al-Qur’an, sehingga mereka menyaksikan langsung siksaan dahsyat yang diancamkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "199. lalu ia membacakannya kepada mereka, niscaya mereka tidak akan beriman kepadanya karena mereka akan menyatakan, \"Kami sama sekali tidak memahaminya.\" Oleh karena itu hendaknya mereka bersyukur kepada Allah yang menurunkannya dengan bahasa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "199. فَقَرَأَهُۥ عَلَيْهِم (lalu ia membacakannya kepada mereka (orang-orang kafir)) Dengan bacaan yang benar. مَّا كَانُوا۟ بِهِۦ مُؤْمِنِينَ(niscaya mereka tidak akan beriman kepadanya) Padahal bacaan al-Qur’an oleh orang yang tidak dapat berbahasa Arab merupakan suatu mukjizat al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "199. Lalu sekalipun ia membacakan Alquran kepada mereka orang-orang kafir; maka niscaya mereka tidak akan beriman kepadanya yaitu dengan membangkang dan menyombongkan diri. Maka dengan diturunkan dengan bahasa Arab terdapat dua mukjizat, yaitu mukjizat dalam batasan hanya Dzat Allah Yang Tahu, dan mukjizat bahwa Alquran bisa dibaca orang non Arab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia membacakannya kepada mereka, niscaya mereka tidak juga akan beriman kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "198-199 “dan kalau al-qur’an itu kami turunkan kepada salah seorang dari golongan bukan arab,” yaitu orang-orang yang tidak mengerti bahasa orang-orang arab dan tidak bisa mengungkapkannya kepada orang-orang arab sebagaimana mestinya, “lalu dia membacakannya kepada mereka, niscaya mereka tidak akan beriman kepadanya.” Mereka akan mengatakan,”kami tidak mengerti apa yang dia katakan dan kami tidak mengetahui apa yang ia serukan!” maka hendaklah mereka memuji Rabb mereka karena membawakan al-qur’an kepada mereka melalui bahasa drai makhluk yang paling fasih dan paling mampu mengungkapkan maksud-maksud(nya) dengan ungkapan-ungkapan yang sangat jelas, dan orang yang paling tulus. Maka hendaklah mereka segera membenarkannya dan menerimanya dengan patuh dan berserah diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 199: Mereka akan berkata, “Kami tidak paham ucapannya dan kami tidak mengerti seruannya,” oleh karena itu, hendaknya mereka memuji Tuhan mereka, karena kitab yang diturunkan-Nya datang kepada mereka melalui lisan manusia yang paling fasih dan paling sanggup mengungkapkan maksud dengan perkataan yang jelas, serta manusia yang paling tulus kepada mereka, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam. Mereka juga hendaknya bersegera membenarkan dan menerimanya, namun ternyata mereka malah mendustakannya padahal tidak ada lagi syubhat, sehingga yang demikian sebagai kekafiran dan sikap membangkang semata serta sebagai perkara yang diwarisi oleh umat-umat terdahulu yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 199",
    "description": "198-199. Ayat berikut menjelaskan keangkuhan orang musyrik untuk menerima Al-Qur'an. Dan seandainya Al-Qur'an itu kami turunkan kepada sebagian dari golongan bukan arab yang tidak bisa bercakap arab, lalu ia membacakannya kepada mereka, yakni orang-orang kafir itu, niscaya mereka tidak juga akan beriman kepadanya. Ini menunjukkan keengganan mereka untuk menerima Al-Qur'an. Dari arah mana pun Al-Qur'an itu datang, mereka pasti tak akan beriman dengan berbagai alasan. 200. Demikianlah, sebagaimana kami memasukkan rasa dusta terhadap Al-Qur'an pada hati orang kafir, kami masukkan sifat dusta dan ingkar terhadap Al-Qur'an itu ke dalam hati orang- orang yang berdosa."
  }
]