[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini adalah ayat-ayat al-Qur’an yang menjelaskan segala sesuatu, yang memisahkan antara hidayah dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Inilah ayat-ayat Al-Qur`ān yang menerangkan kebenaran dari yang batil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Ayat-ayat yang memiliki derajat yang tinggi dan sangat sempurna ini merupakan ayat-ayat al-Qur’an yang penuh dengan penjelasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Ayat-ayat surah ini adalah adalah ayat-ayat Al-Qu’an yang jelas, terang, dan tampak makna-maknanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah ayat-ayat kitab yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2 Allah sang pencipta mengisyaratkan kepada satu isyarat yang menunjukan betapa agungnya ayat-ayat al-kitab al-mubin (al-qur’an) yang sangat jelas yang menunjukan kepada seluruh tuntutan-tuntutan ilahi dan maqashid syar’iyyah, sehingga tidak ada sedikitpun keraguan bagi orang yang mengamatinya, dan tidak ada syubhat tentang apa yang diberitakannNya atau diputuskanNYa karena kejelasan penunjukkannya (wudhuh ad-dalalah) terhadap makna-makna termulia dan keterkaitan hukum-hukum dengan hikmahnya dan ketertautanya dengan kolerasinya. Rasulullah memperingatkan manusia dengannya, dan dengannya pula beliau menunjukkan (mereka) kepada jalan yang lurus, sehingga banyak hamba-hamba Allah yang bertakwa mendapat petunjuk, sedangkan orang yang telah ditetapkan binasa berpaling darinya, sehingga membuat Rasulullah sangat pilu dan sedih karena mereka tidak beriman, karena kesungguhan beliau kepada kebaikan mereka dan ketulusannya terhadap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 2: Surat ini diawali dengan isyarat sebagai tanda-tanda Al Kitab (Al Qur’an) ini yang Allah telah turunkan kepada Nabi-Nya ﷺ, di mana pada surat ini dan selainnya (terdapat) dari tanda-tanda (ayat-ayat) yang jelas dan terang. Telah jelas hukum-hukum, syariat-syariat, perintah-perintah Allah, larangan-larangan-Nya dan urusan-urusan duniar serta akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberi isyarat yang menunjukkan keagungan terhadap ayat-ayat kitab Al Qur’an yang jelas, menerangkan semua tuntutan ilahi dan tujuan syari’at sehingga orang yang memperhatikannya tidak ragu dan samar lagi pada berita yang dikabarkannya atau apa yang ditetapkannya karena begitu jelasnya dan menunjukkan makna yang tinggi, keterikatan hukum-hukum dengan hikmah-Nya dan pengkaitan-Nya dengan munasib (penyesuainya). Oleh karena itu, Rasulullah shallallahu 'alaihi wa sallam memperingatkan manusia dengannya dan menunjuki mereka ke jalan yang lurus, lalu hamba-hamba Allah yang bertakwa memperoleh petunjuk dengannya, tetapi orang-orang yang telah tercatat sebagai orang yang celaka berpaling darinya. Oleh karena itu, Beliau shallallahu 'alaihi wa sallam sangat bersedih sekali ketika manusia tidak beriman karena keinginan Beliau agar mereka memperoleh kebaikan dan rasa tulus Beliau kepada mereka. Menjelaskan mana yang hak dan mana yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 2",
    "description": "Inilah ayat-ayat kitab (Al-Qur'an) yang jelas yang menjelaskan hal-hal benar yang harus diikuti, dan yang batil yang harus dijauhi, yang baik dan mana yang buruk. Semuanya dijelaskan secara gamblang. Walaupun demikian gamblang, masih banyak manusia yang mengingkari-Nya. 3. Boleh jadi engkau, wahai rasul, akan membinasakan dirimu dengan kesedihan yang mendalam karena mereka penduduk mekah itu tidak mau beriman denganmu, padahal kamu sangat menginginkan mereka untuk beriman."
  }
]