[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Musa berkata menjawab Fir’aun, “Aku memang telah melakukan apa yang kamu katakan sebelum Allah menurunkan wahyu kepadaku dan sebelum mengutusku sebagai rasul, lalu aku keluar dari sisi kalian untuk melarikan diri menuju negeri Madyan, karena aku takut kalian akan membunuhku karena apa yang telah aku perbuat tanpa sengaja. Kemudian Tuhanku menganugerahiku kenabian dan ilmu, sebagai bentuk kemurahan dariNya bagiku, dan menjadikanku termasuk di antara rasul-rasul utusanNya. Dan pengasuhan (terhadapku) dahulu dirumahmu kamu anggap sebagai budi baik darimu kepadaku, padahal kamu sungguh telah memperbudak orang-orang Bani Israil, kamu sembelih anak-anak lelaki mereka dan kamu biarkan hidup perempuan-perempuan mereka untuk dijadikan sebagai pembantu dan dihinakan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Musa -'alaihissalām- berkata kepada Fir'aun dengan mengakui perbuatannya, \"Aku telah membunuh orang itu, sedang aku di waktu itu termasuk orang-orang yang jahil dan belum ada wahyu yang turun kepadaku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-21. Musa mengakui kesalahannya dan menyebutkan bahwa itu menjadi sebab dia melarikan diri menuju negeri Madyan karena takut dirinya akan dibunuh. Dan dalam perjalanan itu Allah memberinya hikmah dan Taurat, dan menjadikannya salah seorang nabi dan rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. قَالَ فَعَلْتُهَآ إِذًا وَأَنَا۠ مِنَ الضَّآلِّينَ (Berkata Musa: “Aku telah melakukannya, sedang aku di waktu itu termasuk orang-orang yang khilaf) Yakni Musa berkata: “aku membunuh orang Mesir itu ketika aku masih jahil.” Musa mengingkari bahwa dirinya adalah orang yang tidak tahu balas budi, dan mengatakan bahwa ia melakukan itu pada saat ia masih jahil, sebelum Allah mengajarinya ilmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Musa berkata: “Aku memang telah melakukannya. Dan aku termasuk orang yang bersalah dan tidak mengetahui konsekwensinya sebelum mendapat pengetahuan dan risalah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Musa berkata kepada Fir’aun {“Aku telah melakukannya. Saat itu} Saat itu {aku termasuk orang-orang yang sesat} orang-orang yang bodoh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-22 Lalu Musa berkata, ”aku telah melakukannya, sedang aku di waktu itu termasuk orang-orang yang khilaf,” maksudnya, bukan karena kafir, melainkan karena aku khilaf dan kurang berakal, lalu aku memohon ampun kepada Rabbku, dan Dia pun mengampuniku. “lalu aku lari meninggalkan kamu ketika aku takut kepadamu,” saat kalian berupaya untuk membunuhku, maka aku lari ke negeri madyan dan aku tinggal di sana beberapa tahun, lalu aku datang kepada kalian, “kemudian Rabbku memberikan kepadaku ilmu serta Dia menjadikanku salah seorang drai rasul-rasul.” Walhasil, bahwa penolakan fir’aun terhadap Nabi Musa adalah penolakan seorang yang bodoh atau orang yang berpura-pura bodoh. Sebab, fir’aun telah menjadikan pembunuhan (yang dilakukan oleh Musa) sebagai penghalang untuk menjadi seorang rasul. Oleh karena itu, Musa menjelaskan kepadanya bahwa pembunuhan yang dilakukannya karena khilaf dan tidak sengaja untuk membunuhnya, dan bahwa karunia Allah tidak bisa dihalangi oleh seorang pun. Lalu kenapa kalian menghalangi hikmah dan kerasulan yang telah Allah karuniakan kepadaku? Sekarang, wahai Fir’aun, tinggal argumentasimu, yang kamu katakan, “bukankah kami telah mengasuhmu di dalam (keluarga) kami, waktu kamu masih kanak-kanak?” setelah dicermati, maka jelas sekali bahwa sebenarnya sama sekali tidak ada kebaikan (jasa) sama sekali bagimu pada saat itu. Maka dari itu Musa berkata, ”itu adalah nikmat,” yang dikaruniakan “kepadaku disebabkan kamu telah memperbudak Bani israil,” maksudnya, nikmat ini dilimpahkan kepadaku adalah karena sesungguhnya, kamu telah membuat hina bani israil dan kamu telah menjadikan mereka tak ubahnya seperti budak, sedangkan aku telah engkau selamatkan dari perbudakanmu dan penghinaanmu, dan kamu telah menjadikan hal itu sebagai nikmat bagiku. Jadi, tatkala direnungkan, maka tampak bahwa yang sebenarnya adalah karena engkau telah menzhalimi bangsa yang mulia ini (bani israil), engkau menyiksa mereka dan engkau telah memperkerjakan mereka secara paksa; sedangkan aku telah diselamatkan oleh Allah dari kejahatanmu, pada saat kejahatanmu menimpa kaumku. Lalu jasa apa yang kamu lakukan dan engkau karuniakan kepadaku?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 20: Musa : Aku melakukan demikian karena kekeliruanku dan tanpa landasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni belum memperoleh ilmu dan risalah dari Allah, lalu Beliau meminta ampun kepada Allah dan Dia mengampuninya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 20",
    "description": "Dia, yaitu nabi musa, berkata, 'aku telah melakukannya, yakni pembunuhan terhadap seorang qib'i tanpa aku sengaja dan ketika itu aku termasuk orang yang khilaf bahwa pukulanku terhadapnya akan meng-akibatkan kematiannya, padahal aku memukulnya dengan tujuan untuk memberikan pelajaran kepadanya. \"21. \"lalu aku lari darimu menuju ke negeri madyan, karena aku takut kepadamu akan pembalasanmu. Kemudian tuhanku yang memeliharaku menganugerahkan ilmu yang bermanfaat kepadaku serta dia menjadikan aku salah seorang di antara para rasul sebagaimana para rasul yang lain sebelumku. \"."
  }
]