[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "198-201. Sekiranya Kami menurunkan al-Qur’an ini kepada sebagian orang yang tidak berkomunikasi dengan bahasa Arab, lalu membacakannya kepada orang-orang kafir dari suku Quraisy dengan bahasa Arab yang benar, mereka pasti akan mengingkarinya juga dan mencari-cari alasan atas penentangan mereka itu. Demikianlah, Kami masukkan di hati orang-orang yang durhaka penentangan mereka terhadap al-Qur’an, sehingga menjadi tertanam kuat di hati mereka. Itu disebabkan oleh tindakan zhalim mereka dan kedurhakaan mereka. Maka tidak ada jalan sama sekali (bagi mereka) untuk berubah dari kondisi mereka tersebut dalam mengingkari al-Qur’an, sehingga mereka menyaksikan langsung siksaan dahsyat yang diancamkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "200. Demikianlah Kami masukkan sifat pendustaan dan kekafiran ke dalam hati orang-orang yang durhaka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "200-204. Demikianlah Kami masukkan ke dalam hari orang-orang berdosa keengganan untuk beriman kepada al-Qur’an, mereka tidak akan mempercayainya hingga mereka menyaksikan azab yang pedih, dan azab itu akan menimpa mereka secara tiba-tiba ketika mereka tidak mengira kedatangannya, sehingga mereka akan memohon agar azab itu diakhirkan supaya mereka dapat beriman terlebih dahulu. Namun tidak ada pengunduran azab bagi mereka, dan katakanlah kepada mereka dengan olokan: “Mengapa mereka meminta agar azab itu disegerakan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "200. كَذٰلِكَ سَلَكْنٰهُ فِى قُلُوبِ الْمُجْرِمِين (Demikianlah Kami masukkan Al Quran ke dalam hati orang-orang yang durhaka) Yakni demikian Kami masukkan kemusyrikan dan pendustaan ke dalam hati orang-orang yang durhaka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "200. Sebagaimana Kami telah memasukkan kedustaan dan kekafiran terhadap Al-Quran, Kami juga memasukkan Al Quran ke dalam hati orang-orang kafir Makkah yang durhaka melalui bacaan Nabi SAW. Artinya bahwa kekufuran adalah ciptaan Allah, dan hamba berbuat sesuai apa yang telah dipilihkan kepadanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Kami memasukkan} Kami memasukkan sikap dusta {ke dalam hati para pendurhaka"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 200: Sehingga menjadi sifat mereka disebabkan kezaliman dan kejahatan mereka, oleh karena itu, mereka tidak akan beriman kepadanya sampai mereka melihat azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 200",
    "description": "200. Demikianlah, sebagaimana kami memasukkan rasa dusta terhadap Al-Qur'an pada hati orang kafir, kami masukkan sifat dusta dan ingkar terhadap Al-Qur'an itu ke dalam hati orang- orang yang berdosa. 201. Mereka tidak juga akan beriman kepadanya, yakni Al-Qur'an, hingga mereka melihat azab yang pedih, ."
  }
]