[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "202-203. Lalu datanglah siksaan pada mereka dengan tiba-tiba, sedang mereka tidak mengetahui kedatangannya sebelumnya. Maka saat siksaan itu datang mengagetkan mereka, mereka berkata dengan penuh penyesalan akibat mereka tidak sempat beriman sebelumnya, “Apakah kami dapat diberi kesempatan lagi dan memperoleh penundaan waktu agar kami dapat bertaubat kepada Allah dari perbuatan syirik kami dan kami pun bisa mengejar hal yang kami tinggalkan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "202. Maka datanglah azab itu kepada mereka secara mendadak, sedang mereka tidak menyadari kedatangannya hingga mereka dikagetkan dengannya,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "202. فَيَأْتِيَهُمْ (Maka datanglah azab kepada mereka) yakni siksaan dari Allah. بَغْتَةً (dengan mendadak) yakni secara tiba-tiba. وَهُمْ لَا يَشْعُرُونَ (sedang mereka tidak menyadarinya) yakni mereka dalam keadaan tidak menyadari datangnya azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "202. Maka datanglah azab kepada mereka dengan mendadak, namun mereka tidak menyadarinya,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu datanglah azab kepada mereka secara tiba-tiba} tiba-tiba {sedangkan mereka tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "200-203 akan tetapi pendustaan mereka terhadapnya adalah (pendustaan) tanpa syubhat. Tidaklah ia melainkan kekafiran dan sikap keras kepala belaka, dan merupakan perkara yang telah diwariskan oleh umat-umat yang mendustakan. Maka dari itu Allah berfirman, ”demikianlah kami memasukannya ke dalam hati orang-orang yang durhaka,” maksudnya, kami masukkan pendustaan itu dan kami menggabungkannya kepada hati orang-orang yang durhaka, sebagaimana benang di masukkan ke dalam lubang jarum. Maka hati mereka menyerapnya sehingga pendustaan itu menjadi karakternya. Hal itu disebabkan kezhaliman dan kedurhakaan mereka. Maka dari itu “mereka tidak beriman kepadanya, hingga mereka melihat azab yang pedih,” atas pendustaan mereka. “maka datanglah azab kepada mereka dengan mendadak, sedang mereka tidak menyadarinya,” maksudnya, azab itu menimpa mereka saat mereka lalai, tidak merasakan dan tidak menyadari kedatangannya, agar azab itu menjadi lebih telak dalam menyiksa dan menghajar mereka. “lalu mereka berkata,” pada kala itu, “apakah kami dapat diberi tangguh?” maksudnya, mereka meminta agar diberi tangguh dan tempo waktu. Namun apa boleh buat, semuanya sudah berlalu, dan azab yang tidak akan diangkat dan tidak akan dihentikan dari mereka pun telah menimpa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 202: Agar hukuman yang ditimpakan kepada mereka terasa lebih dahsyat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 202",
    "description": "202. Maka datang azab kepada mereka secara mendadak, ketika mereka tidak menyadarinya, pada saat itulah mereka tersadar akan kesalahan mereka. 203. Lalu mereka berkata, \"apakah kami diberi penangguhan waktu, yakni perpanjangan umur kami, sehingga kami bisa bertobat, beriman kepada Al-Qur'an dan melakukan amal saleh'."
  }
]