[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penundaan yang Aku berikan telah memperdayai mereka sehingga mereka meminta disegerakan turunnya siksaan pada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "204. Maka apakah orang-orang kafir itu meminta supaya disegerakan azab Kami sembari menyatakan, \"Kami tidak akan pernah beriman kepadamu sehingga engkau menjatuhkan langit berkeping-keping seperti yang engkau ancamkan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "204. أَفَبِعَذَابِنَا يَسْتَعْجِلُونَ (Maka apakah mereka meminta supaya disegerakan azab Kami?) Yakni dengan perkataan mereka “hujanilah kami dengan batu dari langit atau datangkanlah kepada kami azab yang pedih.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "204. Maka apakah mereka meminta supaya azab Kami tetap disegerakan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bukankah mereka yang meminta agar azab Kami disegerakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "204 Allah berfirman,”maka apakah dengan azab kami,” yang merupakan azab yang sangat pedih lagi besar yang tidak bisa diremehkan dan disepelekan itu, “mereka minta disegerakan?” apakah yang menipu daya mereka? Apakah mereka mempunyai kekuatan untuk menolaknya atau menghilangkannya apabila ia menimpa? Ataukah mereka dapat melemahkan kami dan mereka mengira bahwa sesungguhnya kami tidak kuasa melakukan hal itu?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 204: Apakah mereka memiliki kekuatan dan kemampuan untuk bersabar menghadapi azab itu? Atau apakah mereka memiliki kekuatan untuk menolaknya atau menyingkirkannya ketika turun?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 204",
    "description": "204. Bukankah mereka yang meminta agar azab kami dipercepat' padahal, pada saat azab menimpa mereka, mereka meminta agar diberi kesempatan sekali lagi untuk bertobat. Inilah sikap mereka yang saling bertentangan. 205. Maka bagaimana pendapatmu, wahai rasul, jika mereka, kami berikan kepada orang-orang kafir itu, kenikmatan hidup beberapa tahun, mereka merasa bahwa mereka kekal di dunia."
  }
]