[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "205-206. Apakah kamu (wahai Rasul) mengetahui bagaimana jika kami beri mereka kesempatan hidup bertahun-tahun lamanya dengan memanjangkan ajal mereka, kemudian turun siksaan yang dijanjikan pada mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "205. Maka bagaimana pendapatmu -wahai Rasul- jika Kami berikan kepada orang-orang kafir yang durhaka terhadap keimanan pada yang engkau bawa itu; kenikmatan hidup selama bertahun-tahun,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "205-207. Hai Rasulullah, katakanlah kepada-Ku jika Kami memberi mereka kenikmatan bertahun-tahun, kemudian datang azab yang dijanjikan kepada mereka, apakah umur yang panjang dan kehidupan yang mewah yang telah mereka dapatkan dapat bermanfaat bagi mereka? Itu semua tidak dapat menjauhkan mereka dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "205. أَفَرَءَيْتَ إِن مَّتَّعْنٰهُمْ سِنِينَ (Maka bagaimana pendapatmu jika Kami berikan kepada mereka kenikmatan hidup bertahun-tahun) Yakni beritahukan kepadaku andai mereka Kami beri merkea kenikmatan bertahun-tahun di dunia dan Kami panjangkan umur mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "205-206. Lalu bagaimana menurutmu jika Kami berikan kenikmatan hidup bertahun-tahun kepada mereka. Kemudian mereka ditimpa azab yang telah diancamkan kepada mereka. Nabi pernah terlihat bingung dan ragu, sehingga mereka bertanya kepada Nabi ada apa gerangan, Nabi menjawab: Tidak, lalu apakah aku melihat bahwa musuhku berasal dari umatku sendiri setelah ini? Kemudian turunlah dua ayat ini, maka nabi menjadi lega."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana pendapatmu} beritahu aku {jika Kami memberikan kenikmatan hidup kepada mereka beberapa tahun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "205-207 “maka bagaimana pendapatmu jika kmai berikan kepada mereka kenikmatan hidup bertahun-tahun?” maksudnya, bagaimana menurutmu kalau kami tidak segera menimpakan azab terhadap mereka dan kami beri tangguh mereka beberapa tahun lagi agar mereka bersenang-senang di dunia ini? “kemudian datang kepada mereka sesuatu yang telah diancamkan kepada mereka,” yaitu azab.” Niscaya tidak berguna bagi mereka sesuatu yang selalu mereka nikmati,” berupa berbagai kelezatan dan kesenangan. Maksudnya, apakah yang dapat bermanfaat dan berguna bagi mereka, sedangkan semua kelezatan dan segala kesenangan itu telah berlalu, sudah sirna dan diganti dengan balasannya, dan azab pun telah dilipatgandakan. Tujuannya di sini adalah berwaspada dari tertimpa azab dan mendapatkan jatah azab untuknya. Adapun masalah disegerakan atau ditundanya azab tersebut, sama sekali tidak penting dan tidak ada artinya baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 205: Yakni, bagaimana pendapatmu jika Kami tidak segera menurunkan azab dan memberi mereka waktu beberapa tahun untuk menikmati kesenangan di dunia?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 205",
    "description": "205. Maka bagaimana pendapatmu, wahai rasul, jika mereka, kami berikan kepada orang-orang kafir itu, kenikmatan hidup beberapa tahun, mereka merasa bahwa mereka kekal di dunia. 206. Kemudian datang kepada mereka azab yang telah diancamkan kepada mereka, sebagaimana juga apa yang mereka minta agar disegerakan turunnya azab."
  }
]