[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kesenangan hidup mereka dengan panjang umur dan kehidupan yang nyaman tidaklah berguna bagi mereka ketika mereka tidak betaubat dari kesyirikan mereka. Siksaan Allah akan jatuh menimpa mereka, cepat atau lambat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "207. Lalu apa manfaat nikmat yang mereka rasakan di dunia dahulu?! Nikmat-nikmat itu telah sirna, serta sama sekali tidak memberikan manfaat apapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "207. مَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يُمَتَّعُونَ (niscaya tidak berguna bagi mereka apa yang mereka selalu menikmatinya) Sebab kenikmatan dunia jika telah selesai seakan-akan tidak pernah dinikmati dan tidak bermanfaat lagi bagi pemiliknya di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "207. Adakah manfaatnya bagi mereka, segala kenikmatan yang telah mereka dapatkan untuk menolak azab bagi mereka? Tidak akan berguna kenikmatan panjang mereka untuk itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Niscaya tidak berguna bagi mereka kenikmatan yang mereka rasakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "205-207 “maka bagaimana pendapatmu jika kmai berikan kepada mereka kenikmatan hidup bertahun-tahun?” maksudnya, bagaimana menurutmu kalau kami tidak segera menimpakan azab terhadap mereka dan kami beri tangguh mereka beberapa tahun lagi agar mereka bersenang-senang di dunia ini? “kemudian datang kepada mereka sesuatu yang telah diancamkan kepada mereka,” yaitu azab.” Niscaya tidak berguna bagi mereka sesuatu yang selalu mereka nikmati,” berupa berbagai kelezatan dan kesenangan. Maksudnya, apakah yang dapat bermanfaat dan berguna bagi mereka, sedangkan semua kelezatan dan segala kesenangan itu telah berlalu, sudah sirna dan diganti dengan balasannya, dan azab pun telah dilipatgandakan. Tujuannya di sini adalah berwaspada dari tertimpa azab dan mendapatkan jatah azab untuknya. Adapun masalah disegerakan atau ditundanya azab tersebut, sama sekali tidak penting dan tidak ada artinya baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 207: Yakni, karena kenikmatan itu telah berlalu dan telah hilang, dan berakhir dengan pertanggungjawaban. Oleh karena itu, disegerakan atau ditunda azab itu tidaklah berguna bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 207",
    "description": "207. Niscaya tidak berguna bagi mereka kenikmatan yang mereka rasakan. Kenikmatan di dunia yang pada akhirnya membawa kesengsaraan di akhirat tidaklah berguna. 208. Terhadap siksaan yang Allah turunkan kepada mereka, Allah memberikan alasan. Dan kami tidak membinasakan sesuatu penduduk negeri mana pun, kecuali setelah ada orang-orang yaitu para rasul yang memberi peringatan kepadanya, dengan sejelas-jelasnya dan menunjukkan berbagai bukti kebenaran mereka, kemudian penduduk negeri tersebut mendustakan mereka. (lihat: surah al-isr'/17:15)."
  }
]