[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "208-209. Dan Kami tidak membinasakan suatu negeri dari negeri-negeri pada umat-umat manusia semuanya kecuali setelah kami mengirimkan kepada mereka rasul-rasul yang memperingatkan mereka, sebagai peringatan bagi mereka dan pengingatan terhadap segala perkara yang mendatangkan keselamatan mereka. Dan Kami tidak menzhalimi dengan menyiksa mereka sebelum Kami mengutus kepada mereka seorang rasul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "208. Dan Kami tidaklah membinasakan salah satu umat di antara sekian umat, melainkan setelah mereka diberikan peringatan dengan pengutusan para rasul kepada mereka dan penurunan kitab-kitab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "208-209. Tidaklah Kami menghancurkan suatu negeri melainkan setelah mendapat peringatan daripara rasul; itu merupakan pelajaran bagi para hamba. Kami tidak pernah berbuat zalim saat mengazab mereka setelah memberi mereka peringatan. Sebagaimana dalam firman Allah: وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبْعَثَ رَسُولًا \"Dan Kami tidak akan mengazab sebelum Kami mengutus seorang rasul.\" (al-Isra: 15). Lihat tafsir yang telah disebutkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "208. وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا لَهَا مُنذِرُونَ (Dan Kami tidak membinasakan sesuatu negeripun, melainkan sesudah ada baginya orang-orang yang memberi peringatan) Yakni kecuali setelah mereka diperingatkan dan diutus rasul kepada mereka serta diturunkan kitab bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "208. Kami tidak membinasakan satu negeripun, melainkan sesudah Kami utus orang-orang yang memberi peringatan dan pemberian kitab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak membinasakan suatu negeri, kecuali setelah ada pemberi peringatan kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "208-209 Allah memberitakan tentang kesempurnaan keadilanNYa dalam membinasakan orang-orang yang mendustakan itu, dan bahwa Dia sekali-kali tidak menimpakan suatu kebinasaan dan azabpun pada suatu negeri melainkan setelah mereka tidak punya alasan dan setelah diutusnya para pemberi peringatan (para rasul) kepada mereka dengan membawa bukti-bukti yang sangat jelas (mukjizat), lalu menyeru mereka kepada hidayah, melarang mereka drai kesesatan dan mengingatkan mereka terhadap pemberian hari-hariNya di dalam kenikmatan dan ancamanNya; “untuk menjadi peringatan,” bagi mereka dan menegakkan hujjah terhadap mereka, “dan kami sekali-kali tidak berlaku zhalim,” maka kami tidak membinasakan negeri-negeri sebelum kami memberi mereka peringatan, dan kami tidak menghukum mereka sedangkan mereka kosong drai para pemberi peringatan, sebagaimana Allah berfirman dalam ayat yang lain, “ dan tidaklah kami menyiksa (suatu kaum) sehingga kami mengutus seorang rasul,” (al-isra:15) Dan firmanNya, “(mereka kami utus) selaku rasul-rasul pembawa berita gembira dan pemberi peringatan agar supaya tidak ada lagi alasan bagi amnesia membantah Allah sesudah diutusnya rasul-rasul itu.” (an-nisa:165)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 208: Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya keadilan-Nya dalam membinasakan orang-orang yang mendustakan, dan bahwa Dia tidaklah membinasakan atau menimpakan azab kepada sebuah penduduk melainkan setelah Dia memperingatkan mereka dengan mengutus para rasul yang membawa ayat-ayat yang jelas, mengajak mereka kepada petunjuk, melarang mereka dari kebinasaan serta mengingatkan peristiwa-peristiwa yang dialami oleh orang-orang yang beriman dan orang-orang yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 208",
    "description": "208. Terhadap siksaan yang Allah turunkan kepada mereka, Allah memberikan alasan. Dan kami tidak membinasakan sesuatu penduduk negeri mana pun, kecuali setelah ada orang-orang yaitu para rasul yang memberi peringatan kepadanya, dengan sejelas-jelasnya dan menunjukkan berbagai bukti kebenaran mereka, kemudian penduduk negeri tersebut mendustakan mereka. (lihat: surah al-isr'/17:15). 209. Hal itu adalah untuk menjadi peringatan bagi yang lain agar tidak melakukan sebagaimana mereka. Dan kami tidak berlaku zalim, karena kami telah mengirimkan utusan untuk memperbaiki keadaan. Mestinya mereka bersyukur. Kami berikan peringatan keras kepada mereka, namun mereka mengejek, mendustakan dan menantang (lihat: al-qa'a'/28: 59)."
  }
]