[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Musa berkata menjawab Fir’aun, “Aku memang telah melakukan apa yang kamu katakan sebelum Allah menurunkan wahyu kepadaku dan sebelum mengutusku sebagai rasul, lalu aku keluar dari sisi kalian untuk melarikan diri menuju negeri Madyan, karena aku takut kalian akan membunuhku karena apa yang telah aku perbuat tanpa sengaja. Kemudian Tuhanku menganugerahiku kenabian dan ilmu, sebagai bentuk kemurahan dariNya bagiku, dan menjadikanku termasuk di antara rasul-rasul utusanNya. Dan pengasuhan (terhadapku) dahulu dirumahmu kamu anggap sebagai budi baik darimu kepadaku, padahal kamu sungguh telah memperbudak orang-orang Bani Israil, kamu sembelih anak-anak lelaki mereka dan kamu biarkan hidup perempuan-perempuan mereka untuk dijadikan sebagai pembantu dan dihinakan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Lalu aku lari meninggalkan kalian menuju negeri Madyan tatkala aku merasa khawatir kalian akan membunuhku, kemudian Rabbku memberikan kepadaku ilmu, serta Dia menjadikanku salah seorang di antara rasul-rasul-Nya yang diutus kepada manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. فَفَرَرْتُ مِنكُمْ لَمَّا خِفْتُكُمْ (Lalu aku lari meninggalkan kamu ketika aku takut kepadamu) Yakni lari ke negeri Madyan sebagaimana disebutkan dalam surat al-Qashash. فَوَهَبَ لِى رَبِّى حُكْمًا(kemudian Tuhanku memberikan kepadaku ilmu) Yakni kenabian atau ilmu dan pemahaman. وَجَعَلَنِى مِنَ الْمُرْسَلِينَ (serta Dia menjadikanku salah seorang di antara rasul-rasul) Yakni memuliakanku dengan menjadikankku salah satu Nabi yang Dia utus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Lalu aku lari dari kalian menuju Madyan karena khawatir kalian akan membunuhku. Lalu Tuhanku memberiku nubuwwah, hikmah dan pengetahuan dengan mendatangkan Taurat dan menjadikanku salah satu nabi yang diutus"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian aku lari} lalu aku lari {dari kalian karena aku takut kepada kalian. Lalu Tuhanku menganugerahkan kepadaku hukum} pengetahuan {dan menjadikanku salah seorang rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-22 Lalu Musa berkata, ”aku telah melakukannya, sedang aku di waktu itu termasuk orang-orang yang khilaf,” maksudnya, bukan karena kafir, melainkan karena aku khilaf dan kurang berakal, lalu aku memohon ampun kepada Rabbku, dan Dia pun mengampuniku. “lalu aku lari meninggalkan kamu ketika aku takut kepadamu,” saat kalian berupaya untuk membunuhku, maka aku lari ke negeri madyan dan aku tinggal di sana beberapa tahun, lalu aku datang kepada kalian, “kemudian Rabbku memberikan kepadaku ilmu serta Dia menjadikanku salah seorang drai rasul-rasul.” Walhasil, bahwa penolakan fir’aun terhadap Nabi Musa adalah penolakan seorang yang bodoh atau orang yang berpura-pura bodoh. Sebab, fir’aun telah menjadikan pembunuhan (yang dilakukan oleh Musa) sebagai penghalang untuk menjadi seorang rasul. Oleh karena itu, Musa menjelaskan kepadanya bahwa pembunuhan yang dilakukannya karena khilaf dan tidak sengaja untuk membunuhnya, dan bahwa karunia Allah tidak bisa dihalangi oleh seorang pun. Lalu kenapa kalian menghalangi hikmah dan kerasulan yang telah Allah karuniakan kepadaku? Sekarang, wahai Fir’aun, tinggal argumentasimu, yang kamu katakan, “bukankah kami telah mengasuhmu di dalam (keluarga) kami, waktu kamu masih kanak-kanak?” setelah dicermati, maka jelas sekali bahwa sebenarnya sama sekali tidak ada kebaikan (jasa) sama sekali bagimu pada saat itu. Maka dari itu Musa berkata, ”itu adalah nikmat,” yang dikaruniakan “kepadaku disebabkan kamu telah memperbudak Bani israil,” maksudnya, nikmat ini dilimpahkan kepadaku adalah karena sesungguhnya, kamu telah membuat hina bani israil dan kamu telah menjadikan mereka tak ubahnya seperti budak, sedangkan aku telah engkau selamatkan dari perbudakanmu dan penghinaanmu, dan kamu telah menjadikan hal itu sebagai nikmat bagiku. Jadi, tatkala direnungkan, maka tampak bahwa yang sebenarnya adalah karena engkau telah menzhalimi bangsa yang mulia ini (bani israil), engkau menyiksa mereka dan engkau telah memperkerjakan mereka secara paksa; sedangkan aku telah diselamatkan oleh Allah dari kejahatanmu, pada saat kejahatanmu menimpa kaumku. Lalu jasa apa yang kamu lakukan dan engkau karuniakan kepadaku?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 21: Kemudian berkata Musa : Lalu aku lari dari mereka dan keluar karena perasaan takut mereka membunuhku, maka aku pergi menuju Madyan, kemudian Allah karuniakan kepadaku dan mengampuniku serta memberiku ilmu yang bermanfaat, dan memilihku sebagai Rasul bagi kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kesimpulannya, penentangan Fir’aun kepada Musa adalah penentangan dari orang jahil (bodoh) atau pura-pura jahil, ia menolak kerasulannya karena Musa telah melakukan pembunuhan, maka Nabi Musa ‘alaihis salam menjawab bahwa perbuatan yang Beliau lakukan itu karena khilaf (tidak disengaja) dan tidak ada maksud untuk membunuh, dan bahwa nikmat Allah Ta’ala, yakni kerasulan tidaklah dihalangi diberikan kepada seseorang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 21",
    "description": "\"lalu aku lari darimu menuju ke negeri madyan, karena aku takut kepadamu akan pembalasanmu. Kemudian tuhanku yang memeliharaku menganugerahkan ilmu yang bermanfaat kepadaku serta dia menjadikan aku salah seorang di antara para rasul sebagaimana para rasul yang lain sebelumku. \"22. Lalu nabi musa membandingkan antara kebaikan yang dia terima dari fir'aun dengan kekejaman fir'aun terhadap bani israil. Musa berkata lagi, \"dan itulah kebaikan yang telah engkau berikan kepadaku, engkau pelihara diriku ketika aku masih bayi sampai aku dewasa. Sementara itu engkau telah memperbudak bani israil, kaumku sendiri. Engkau perlakukan mereka dengan tidak berperi kemanusiaan. Sungguh ini dua hal yang tidak sebanding. Jika bukan karena kekejamanmu, ibuku tidak akan melemparkan aku ke sungai, dan tidak akan kau pelihara diriku. \"."
  }
]