[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "210-212. Dan al-Qur’an tidak dibawa turun oleh setan-setan kepada Muhammad sebagaimana yang disangka oleh orang-orang kafir. Demikian itu tidak benar dari mereka, dan mereka tidak mampu untuk itu. Sebab sesungguhnya mereka terhalangi dari mendengar al-Qur’an dari langit, lagi akan dilontari bola api."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "212. Mereka tidak akan sanggup melakukannya karena sesungguhnya mereka benar-benar dijauhkan dari tempat asal Al-Qur`ān di langit, lalu bagaimana bisa mereka kuasa sampai ke tempat itu lalu menurunkan Al-Qur`ān darinya?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "212. إِنَّهُمْ عَنِ السَّمْعِ (Sesungguhnya mereka dari mendengar Al Quran itu) Yakni mendengar al-Qur’an atau perkataan malaikat. لَمَعْزُولُونَ(benar-benar dijauhkan) Yakni dihalangi dan dirajam dengan kobaran api."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "212. Sesungguhnya mereka benar-benar terhalang dari mendengar bacaan Al-Quran para malaikat itu dengan bintang api, mereka dilempari dengan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya mereka benar-benar dijauhkan} dihalangi {untuk mendengarnya} untuk mendengar Al-Qur’an dari langit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "210-212 setelah Allah menjelaskan kesempurnaan al-qur’an dan keagungannya, maka Dia membersihkannya dari segala sifat kekurangan, dan Dia melindunginya saat diturunkannya dan sesudah diturunkannya (yaitu dilindungi) dari setan-setan bangsa jin dan bangsa manusia, seraya berfirman, ”dan al-qur’an itu bukanlah dibawa turun oleh setan-setan. Dan tidaklah patut mereka membawa turun al-qur’an itu,” maksudnya, tidak lain dengan kondisi mereka dan tidak sesuai dengan mereka. “dan merekapun tidak akan sanggup,” melakukannya. “sesungguhnya mereka benar-benar dijauhkan dari mendengar al-qur’an itu,” yakni: mereka telah dijauhkan drainya, bahkan telah disediakan untuk mereka meteor-meteor untuk menjaganya. Dan al-qur’an itu dibawa turun oleh jibril, malaikat yang terkuat, yang mana setan tidak kuasa untuk mendekatinya atau berkeliaran disekitarnya. Ayat ini mirip dengan firman Allah, “sesungguhnya kami-lah yang menurunkan al-qur’an, dan sesungguhnya kami benar-benar memeliharanya,” (al-hijr:9)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 212: Mereka telah dijauhkan dari Al Qur’an, telah disiapkan meteor untuk menyerang mereka demi menjaga Al Qur’an, dibawa turun oleh malaikat yang paling kuat, di mana setan tidak sanggup mendekatinya dan berkeliling di dekatnya. Hal ini sebagaimana firman Allah Ta’ala di surah Al Hijr: 9: “Sesungguhnya Kamilah yang menurunkan Al Quran, dan sesungguhnya Kami benar-benar memeliharanya.” (Terj. Al Hijr: 9)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 212",
    "description": "212. Di samping alasan di atas, Allah telah menjaga kesucian Al-Qur'an. Sesungguhnya untuk mendengarkannya pun mereka dijauhkan. Karena jalan-jalan di langit yang biasa mereka lalui untuk menyadap kabar-kabar langit. Telah distrilkan dari lalu lalang mereka (lihat: surah jin/72:8-9) sehingga Al-Qur'an bisa sampai kepada nabi secara utuh. 213. Allah mengingatkan nabi Muhammad. Maka janganlah sekali-kali kamu menyeru orang lain untuk menyembah tuhan selain Allah, karena nanti pada hari kiamat, kamu termasuk orang-orang yang diazab karena syirik itu dosa tidak akan diampuni oleh Allah bagi siapa pun yang tidak bertobat ketika di dunia."
  }
]