[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka janganlah kamu menyembah suatu sesembahan lain bersama Allah, sehingga akibatnya akan turun kepadamu siksaan yang dahulu menimpa orang-orang yang menyembah sesembahan lain bersama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "213. Maka janganlah engkau menyembah tuhan lain di samping Allah dengan menyekutukan-Nya, sebab hal itu menjadikan engkau termasuk orang-orang yang diazab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "213-216. Allah memberi petunjuk kepada Rasulullah dengan petunjuk-petunjuk yang agung dan hukum-hukum yang penuh hikmah agar dia menyampaikannya kepada para hamba: Janganlah kamu menyembah sesembahan lain selain Allah, karena jika kamu melakukan itu maka Allah akan mengazabmu dengan neraka Jahannam. Perintah ini ditujukan bagi umatnya, sebab Rasulullah maksum dan terlindungi dari melakukan hal seperti itu. Dan berilah peringatan dari azab neraka kepada keluargamu yang terdekat sampai yang terjauh; dan rendah hatilah kepada para sahabatmu yang beriman itu, dan jika mereka tidak mentaatimu maka katakanlah kepada mereka: “Aku berlepas diri dari kesyirikan kalian terhadap Allah.” Rasulullah telah menjalankan perintah ini, sebagaimana diriwayatkan dari Abu Hurairah, ia berkata: “ketika Allah menurunkan ayat [وأنذر عشيرتك الأقربين], Rasulullah berdiri dan berkata, ‘Wahai orang-orang Quraisy -atau ungkapan yang semisal- Tebuslah diri-diri kalian (dengan amal shalih -pen), karena sungguh aku tidak kuasa sedikitpun melindungi kalian di hadapan Allah kelak. Wahai Bani 'Abdi Manaf! Aku tidak kuasa melindungi kalian sedikitpun di hadapan Allah. Wahai ‘Abbas bin Abdil Mutthalib! Aku tidak kuasa melindungi engkau sedikitpun di hadapan Allah. Wahai Shafiyyah bibi Rasulullah! Aku tidak kuasa melindungi engkau sedikitpun di hadapan Allah. Wahai Fathimah binti Muhammad! mintalah dari hartaku sesukamu, namun aku tidak kuasa melindungi engkau sedikitpun di hadapan Allah kelak’.” (Shahih al-Bukhari 8/360, kitab tafsir surat asy-Su’araa, no. 4771. Dan Shahih Muslim, iman, bab firman Allah [وأنذر عشيرتك الأقربين] no. 207)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "213. فَلَا تَدْعُ مَعَ اللهِ إِلٰهًا ءَاخَرَ فَتَكُونَ مِنَ الْمُعَذَّبِينَ (Maka janganlah kamu menyeru (menyembah) tuhan yang lain di samping Allah, yang menyebabkan kamu termasuk orang-orang yang diazab) Seakan-akan Allah berfirman: Hai Muhammad, kamu adalah makhluk yang paling mulia bagi-Ku dan paling terhormat di sisi-Ku, andai kamu menjadikan Tuhan selain Aku niscaya Aku akan tetap mengazabmu, lalu bagaimana dengan hamba-hamba-Ku yang lain?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "213. Maka janganlah kamu menyembah tuhan yang lain selain Allah, yang menyebabkan kamu termasuk orang-orang yang diazab. Seruan ini adalah untuk umat, dimulai dari Nabi karena dia sebagai teladan dan penyemangat. Artinya bahwa jika kamu melakukan kesyirikan itu lalu Kami azab, maka bagaimana dengan yang lain?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka janganlah menyembah Tuhan lain bersama Allah. sehingga kamu termasuk orang-orang yang diazab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "213 Allah melarang RasulNya sebagai sikap (tauladan) pertama, dan umatnya sebagi sikap meneladaninya dalam hal itu, dari perbutan berdoa kepada selain Allah, dari kalangan makhluk ini(dan dijelaskan) bahwa hal itu mengakibatkan azab yang sangat pedih nan kekal dan hukuman abadi, karena perbuatan itu adalah syirik. Sedangkan siapa saja yang mempersekutukan Allah, maka Allah telah mengharamkan surga atasnya, dan tempatnya adalah neraka. Larangan terhadap sesuatu adalah perintah kepada lawannya. Maka larangan berbuat syirik adalah perintah kepada ketulusan ibadah hanya kepada Allah saja, tiada sekutu bagiNya, dalam bentuk cinta, rasa takut, berharap, rasa hina dan kembali kepadaNya dalam semua waktu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 213: Allah Subhaanahu wa Ta'aala melarang Rasul-Nya dan termasuk pula umatnya dari menyembah selain Allah, dan bahwa yang demikian dapat menyebabkan seseorang terkena azab yang kekal, karena hal itu adalah perbuatan syirk, di mana Allah mengharamkan pelakunya masuk surga dan akan menempatkannya di neraka. Larangan terhadap sesuatu berarti perintah terhadap kebalikannya, larangan terhadap syirk berarti perintah mentauhidkan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 213",
    "description": "213. Allah mengingatkan nabi Muhammad. Maka janganlah sekali-kali kamu menyeru orang lain untuk menyembah tuhan selain Allah, karena nanti pada hari kiamat, kamu termasuk orang-orang yang diazab karena syirik itu dosa tidak akan diampuni oleh Allah bagi siapa pun yang tidak bertobat ketika di dunia. 214. Dan berilah peringatan, wahai rasul, kepada kerabat-kerabatmu yang terdekat, janganlah mereka menyekutukan Allah, dan ajaklah mereka ke jalan yang benar. Keluarga adalah lingkaran pertama yang harus menjadi prioritas dakwah. Mengandalkan unsur kekerabatan tidak bisa menolong dari siksa Allah jika mereka masih tetap berbuat syirik."
  }
]