[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan peringatlkanlah (wahai rasul) kerabatmu yang paling dekat dan kerabat dekatmu selanjutnya dari kaummu dari siksaan Kami yang akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "214. Dan berilah peringatan -wahai Rasul- kepada kerabat-kerabatmu yang terdekat agar mereka tidak ditimpa azab Allah bila mereka tetap berpegang teguh dengan kesyirikan,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "214. وَأَنذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ (Dan berilah peringatan kepada kerabat-kerabatmu yang terdekat) Setelah ayat ini turun, Rasulullah menyeru Bani Quraisy, kemudian mereka berkumpul, lalu Rasulullah memperingatkan mereka secara umum dan secara khusus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "214. Berilah peringatan kepada kerabat-kerabat terdekatmu. Kerabat yang paling dekat, kemudian setelahnya, yaitu Bani Hasyim dan Mutallib. Khususkanlah untuk memberi peringatan terhadap mereka. Ayat ini turun ketika Nabi menyeru suku Quraisy, kemudian mereka berkumpul. Kemudian dimulai menyeru kepada kerabat terdekat terlebih dahulu kemudian umum, kemudian baru memberi peringatan kepada mereka. Dimulai dari keluarga, namun itu sulit bagi muslimin, sehingga Allah menurunkan ayat 215."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Peringatkanlah keluargamu} kafilahmu {yang terdekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "214 setelah Allah memerintahnya berkenaan dengan perkara yang di dalamnya terkandung kesempurnaan dirinya, maka (disini) Allah memerintahnya untuk menyempurnakan orang lain, seraya berfirman,”dan berilah peringatan kepada kerabat-kerabatmu yang terdekat,” yaitu manusia yang paling dekat kepadamu dan paling berhak untuk mendapatkan kebaikan agama dan dunia darimu. Perintah ini sama seklai tidak menafikan perintah untuk memberikan peringatan kepada seluruh manusia, sebagaimana halnya kalau seseorang diperintah untuk berbuat baik secara umum, lalu dikatakan kepadanya,”berbuat baiklah kepada kerabat dekatmu,” maka kekhususan ini menjadi petunjuk atas penekanan dan tambahan anjuran. Maka nabi pun mematuhi perintah ilahi ini, lalu beliau menyeru seluruh tokoh-tokoh utama qabalah quraisy. Maka beliaupun menjelaskan secara umum dan secara khusus, beliau memberikan pelajaran dan nasihat kepada mereka. Nabi tidak menyisakan sedikitpun drai nasihat dan bimbingan yang mampu beliau berikan melainkan pasti beliau melakukannya. Maka ada di antara mereka yang menerima hidayah dan ada pula yang berpaling."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 214: Setelah Allah Subhaanahu wa Ta'aala memerintahkan Nabi-Nya mengerjakan sesuatu yang dapat menyempurnakan dirinya, maka Dia memerintahkan untuk menyempurnakan orang lain. Yaitu Bani Hasyim dan Bani Muththalib, di mana mereka adalah orang-orang yang paling dekat dengan Beliau dan paling berhak mendapatkan ihsan baik dari sisi agama maupun dunia. Hal ini tidaklah menafikan untuk memberikan peringatan kepada semua manusia, seperti halnya ketika seseorang diperintahkan untuk berbuat ihsan kepada semua manusia, lalu diperintahkan pula kepadanya untuk berbuat ihsan kepada kerabatnya, maka yang ini adalah lebih khusus yang menunjukkan penekanan dan memiliki hak lebih. Kemudian Nabi shallallahu 'alaihi wa sallam melaksanakan perintah itu, Beliau berdakwah baik kepada masyarakat umum maupun kepada kerabat-kerabat-kerabat Beliau, mengingatkan dan menasehati mereka tanpa kenal lelah, dan bahwa tidak ada seorang pun di antara mereka yang dapat selamat dari azab Allah kecuali dengan beriman kepada-Nya. Allah Subhaanahu wa Ta'aala juga memerintahkan agar Beliau berendah diri kepada hamba-hamba Allah yang beriman, dan barang siapa yang mendurhakai Beliau siapa pun orangnya, maka hendaklah Beliau berlepas diri dari perbuatannya, dan dengan tetap menasehati mereka serta berusaha mengajak mereka kembali dan bertobat. Sikap berlepas diri dari perbuatannya adalah untuk menolak anggapan bahwa perintah merendahkan diri kepada orang-orang mukmin, menghendaki seseorang untuk bersikap ridha terhadap segala yang muncul dari mereka selama mereka mukmin, bahkan tidak demikian. Hal itu, karena dalam masalah wala’ (setia) dan bara’ (berlepas diri) ada tiga golongan: 1. Orang-orang yang diberikan wala’ murni tanpa dimusuhi sama sekali. Mereka adalah kaum mukmin yang bersih dari kalangan para nabi, para shiddiqin, para syuhada dan orang-orang shalih. Terdepannya adalah Rasulullah shallallahu 'alaihi wa sallam, kemudian istri-istrinya ummahaatul mukminin, ahli baitnya yang baik dan para sahabatnya yang mulia. Kemudian dari kalangan para tabi’in dan orang-orang yang hidup pada abad-abad yang utama, generasi pertama ummat ini dan para imamnya seperti imam yang empat (Imam Malik, Imam Abu Hanifah, Imam Syafi'i dan Imam Ahmad). 2. Orang-orang yang diberi baraa’ murni tanpa ada rasa cinta. Mereka adalah kaum kafir baik dari kalangan, orang-orang musyrik, orang-orang munafik, orang-orang murtad dan orang-orang atheis dan lainnya dengan berbagai macamnya. 3. Orang-orang yang diberi wala' dari satu sisi dan diberi bara' dari sisi lain Yakni wala’ dan bara’ berkumpul padanya, mereka adalah kaum mukminin yang berbuat maksiat. Mencintai mereka, karena mereka masih memiliki iman, dan membenci mereka karena maksiatnya yang tingkatannya di bawah kufur dan syirk. Membenci mukmin yang berbuat maksiat tidaklah sama dengan membenci orang kafir dan memusuhinya, dalilnya adalah hadits yang diriwayatkan oleh Bukhari dari Umar bin Al Khaththab: أَنَّ رَجُلًا عَلَى عَهْدِ النَّبِيِّ كَانَ اسْمُهُ عَبْدَاللَّهِ وَكَانَ يُلَقَّبُ حِمَارًا وَكَانَ يُضْحِكُ رَسُولَ اللَّهِ وَكَانَ النَّبِيُّ قَدْ جَلَدَهُ فِي الشَّرَابِ فَأُتِيَ بِهِ يَوْمًا فَأَمَرَ بِهِ فَجُلِدَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ اللَّهُمَّ الْعَنْهُ مَا أَكْثَرَ مَا يُؤْتَى بِهِ فَقَالَ النَّبِيُّ : لَا تَلْعَنُوهُ فَوَاللَّهِ مَا عَلِمْتُ إِنَّهُ يُحِبُّ اللَّهَ وَرَسُولَهُ “Ada seseorang di zaman Nabi shallallahu 'alaihi wa sallam yang bernama Abdullah, ia digelari “keledai”, ia sering membuat Rasulullah shallallahu 'alaihi wa sallam tertawa. Nabi shallallahu 'alaihi wa sallam pernah menderanya karena ia meminum khamr, suatu ketika ia dihadapkan lagi (karena meminum khamr), lalu Beliau memerintahkan mendera lagi, lalu didera lagi. Kemudian salah seorang yang hadir ada yang mengatakan, “Ya Allah, laknatlah dia, banyak sekali ia melakukannya.” Maka Nabi shallallahu 'alaihi wa sallam bersabda: “Janganlah melaknatnya, demi Allah, apa kamu tidak tahu bahwa ia cinta kepada Allah dan Rasul-Nya” Rasa cinta kepada mereka mengharuskan kita menasehati mereka dan mengingkari mereka. Oleh karena itu, tidak boleh diam terhadap maksiat mereka, bahkan tetap diingkari, dinasehati dan diaak bertobat, disuruhnya mengerjakan yang ma’ruf dan dicegahnya dari yang mungkar, ditegakkan hukuman sampai mereka mau berhenti dan bertobat dari maksiatnya. Akan tetapi, (kita) tidak membenci mereka dengan kebencian murni seperti halnya orang-orang khawaarij."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 214",
    "description": "214. Dan berilah peringatan, wahai rasul, kepada kerabat-kerabatmu yang terdekat, janganlah mereka menyekutukan Allah, dan ajaklah mereka ke jalan yang benar. Keluarga adalah lingkaran pertama yang harus menjadi prioritas dakwah. Mengandalkan unsur kekerabatan tidak bisa menolong dari siksa Allah jika mereka masih tetap berbuat syirik. 215. Dan rendahkanlah dirimu terhadap orang-orang yang beriman yang mengikutimu. Jangan kamu bertindak kasar terhadap mereka, karena mereka akan lari darimu, padahal mereka adalah pembantumu yang utama dalam berdakwah. Perjalanan dakwah tidak selamanya mulus. Ada banyak rintangan, antara lain pembelotan dari pengikut."
  }
]