[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan lunakkanlah sikap pergaulanmu dan tutur katamu untuk bertawadhu dan mengungkapkan rasa sayang kepada orang yang tampak olehmu adanya penerimaan terhadap dakwahmu darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "215. dan rendahkanlah dirimu -dalam berkata-kata dan bertingkah laku- terhadap orang-orang yang mengikutimu dari kalangan mukminin, sebagai bentuk kasih sayang dan lemah lembut terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "215. وَاخْفِضْ جَنَاحَكَ لِمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ (dan rendahkanlah dirimu terhadap orang-orang yang mengikutimu, yaitu orang-orang yang beriman) Yakni tampakkanlah bagi mereka rasa cinta dan kedermawanan serta maafkanlah mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "215. Rendahkanlah dirimu terhadap orang-orang yang mengikutimu, yaitu orang-orang yang beriman. Hadirkan cinta dan kasih sayang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Rendahkanlah dirimu} lembutkanlah dirimu {terhadap orang-orang yang mengikutimu, yaitu orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "215 “dan rendahkanlah dirimu terhadap orang-orang yang mengikutimu, dari kalangan orang-orang yang beriman,” yaitu, dengan sikap lembutmu, tutur katamu yang halus kepada mereka, rasa sayang dan cintamu kepada mereka serta akhlak mulia dan seluruh kebaikanmu terhadap mereka. Dan sungguh nabi melakukan semua ini, sebagiamana Allah firmankan, “maka disebakan rahmat dari Allah-lah kamu berlaku lemah lembut terhadap mereka. Sekiranya kamu bersikap lagi berhati kasar, tentulah mereka menjauhkan diri dari sekelilingmu. Karena itu maafkanlah mereka, mohonkanlah ampun bagi mereka, dan bermusyawarahlah dengan mereka dalam urusan itu,” (ali-imran:160) Itulah akhlak Rasulullah, yaitu akhlak yang paling sempurna, yang dengannya banyak kemaslahatan besar yang diraih, berbagai mudarat tercegah, sebagaimana sudah dimaklumi. Kemudian, apakah pantas bagi seorang yang beriman kepada Allah dan RasulNya yang mengklaim mengikuti dan mensuriteladani Rasulullah, jika menjadi beban bagi kaum Muslimin, berkhlak buruk, bersikap keras [terhadap mereka], berkeras hati dan berkata-kata kasar; dan jika dia melihat mereka melakukan maksiat atau kurang sopan, maka dia langsung memutus hubungan dengan mereka, mencaci dan membenci mereka? Dia sama sekali tidak mempunyai sikap lembut, tidak memilki etika dan tidak juga taufik. Perlakuan seperti ini telah menimbulkan berbagai kerusakan dan terabaikannya berbagai kemaslahatan yang cukup parah. Lain dari itu, anda akan menjumpainya sellau merendahkann orang yang meniru sifat Rasulullah. Dia menuduhnya dengan tuduhan kemunafikan dan cari muka, dan dia menyebut-nyebut dirinya sendiri dan menyanjungnya serta bangga dengan amal yang dilakukannya. Ini semua tidak lain karena kebodohannya, bujukan manis dan tipu daya setan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 215: Yakni dengan tidak sombong kepada mereka, bersikap lembut kepada mereka, bertutur kata yang halus kepada mereka, mencintai mereka, berakhlak mulia dan berbuat ihsan kepada mereka. Inilah akhlak Rasulullah shallallahu 'alaihi wa sallam; akhlak yang paling mulia yang dengannya tercapai berbagai maslahat. Oleh karena itu, pantaskah bagi seorang yang beriman kepada Allah dan Rasul-Nya, mengaku mengikuti Beliau dan meneladaninya tetapi malah menjadi beban kaum muslimin, berakhlak buruk, keras wataknya, hatinya keras dan mulutnya kasar, saat melihat mereka berbuat salah atau kurang adab langsung dijauhi, dibenci dan dimusuhi, tanpa dinasehati dengan cara yang baik dan diajak kembali. Padahal bersikap seperti itu menimbulkan berbagai macam bahaya dan menghilang beberapa maslahat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 215",
    "description": "215. Dan rendahkanlah dirimu terhadap orang-orang yang beriman yang mengikutimu. Jangan kamu bertindak kasar terhadap mereka, karena mereka akan lari darimu, padahal mereka adalah pembantumu yang utama dalam berdakwah. Perjalanan dakwah tidak selamanya mulus. Ada banyak rintangan, antara lain pembelotan dari pengikut. 216. Teruskanlah kamu berdakwah, wahai rasul. Kemudian jika setelah engkau berdakwah kepada mereka, mereka baik itu keluargamu, orang-orang kafir, atau para pengikutmu, mendurhakaimu dan tidak mengikuti perintahmu, maka katakanlah wahai rasul, kepada mereka 'sesungguhnya aku tidak bertanggung jawab terhadap apa yang kamu kerjakan. ' semua itu menjadi tanggung jawabmu di hadapan Allah."
  }
]