[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila mereka menyelisihi perintahmu dan tidak mengikutimu, maka berlepas dirilah kamu dari tindakan-tindakan mereka dan kondisi yang meliputi mereka berupa kesyirikan dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "216. Jika mereka mendurhakaimu dan enggan menerima perintah yang engkau bawa berupa pengesaan Allah dan ketaatan kepada-Nya, maka katakanlah kepada mereka, \"Sesungguhnya aku berlepas diri dari apa yang kalian kerjakan berupa kesyirikan dan maksiat\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "216. Jika mereka mendurhakaimu maka katakanlah: \"Sesungguhnya aku tidak bertanggung jawab terhadap apa yang kamu kerjakan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka mendurhakaimu} menentang perintahmu dan tidak mengikutimu {katakanlah,“Sesungguhnya aku berlepas diri terhadap apa yang kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "216 oleh karenanya, Allah berfirman kepada RasulNya, “jika mereka mendurhakaimu,” dalam salah satu perintah, maka janganlah kamu berlepas diri drai mereka, jangan meninggalkan sikap lembut dan rendah diri dalam berinteraksi dengan mereka, akan tetapi berlepas dirilah dari perbuatan mereka, lalu ingatkanlah mereka dan nasihatilah mereka serta curahkanlah kemampuanmu dalam mencegah mereka dari perbuatan itu dan mengajak mereka bertaubat darinya. Hal ini menolak anggapan orang yang berpraduga salah bahwa Firman Allah, “dan rendahkanlah dirimu terhadap orang-orang yang beriman,” (al-hijr:88) Berkonsekuensi harus rela dengan semua yang mereka lakukan selagi mereka sebagai orang-orang Mukmin. Anggapan tersebut ditolak dengan uraian di atas. Wllahu’alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 216: Yaitu kemaksiatan yang kamu lakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 216",
    "description": "216. Teruskanlah kamu berdakwah, wahai rasul. Kemudian jika setelah engkau berdakwah kepada mereka, mereka baik itu keluargamu, orang-orang kafir, atau para pengikutmu, mendurhakaimu dan tidak mengikuti perintahmu, maka katakanlah wahai rasul, kepada mereka 'sesungguhnya aku tidak bertanggung jawab terhadap apa yang kamu kerjakan. ' semua itu menjadi tanggung jawabmu di hadapan Allah. 217. Dan setelah engkau lakukan tugasmu berdakwah kepada mereka, bertawakAllah, pasrahkanlah semua urusanmu hanya kepada Allah yang mahaperkasa, mahakuat yang mampu menyiksa siapa pun yang berani menantang-Nya, maha penyayang kepada siapa pun yang senantiasa taat kepada-Nya."
  }
]