[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "217-220. Dan serahkanlah urusanmu kepada Allah Dzat Yang Mahaperkasa yang tidak dapat dikalahkan dan tidak dapat ditundukkan, Yang Maha Penyayang yang tidak mengabaikan para waliNya. Dan Dia-lah yang melihatmu saat kamu berdiri mengerjakan shalat sendiran di tengah malam, dan melihat perubahan gerak badanmu besama orang-orang yang bersujud dalam shalat mereka bersamamu, dengan berdiri,rukuk, sujud, dan duduk. Sesungguhnya Dia maha Mendengar bacaan al-Qur’an dan dzikirmu, lagi Maha Mengetahui niat dan amal perbuatanmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "217. Dan bertawakallah dalam seluruh urusanmu kepada Żat Yang Maha Perkasa, yang membalas kejahatan musuh-musuh-Nya, lagi Maha Penyayang terhadap orang-orang yang bertobat dan kembali kepada-Nya,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "217-220. Dan bersandarkanlah kepada Allah dalam setiap urusanmu, Dia Maha Perkasa dalam membalas musuh-musuh-Nya dan Maha Pengasih bagi hamba-hamba-Nya yang beriman. Dia melihatmu ketika kamu berdiri seorang diri melaksanakan shalat tahajjud dan ketika kamu menjadi imam pada shalat fardhu. Dia Maha Mendengar segala perkataan dan Maha Mengetahui segala kejadian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "217. Dan serahkanlah segala urusanmu kepada Allah Yang Maha Perkasa dan Maha Membalas kepada orang kafir, lagi Maha Penyayang kepada orang yang beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bertawakallah kepada Dzat Yang Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "217 pendukung terbesar bagi seorang hamba untuk melkaukan apa yang diperintahkan kepadanya adalah bersandar kepada Rabbnya dan memohon pertolongan kepada tuhannya agar diberi bimbingan dapat mengerjakan perintah. Maka drai itu, Allah memerintahkan tawakkal kepadaNYa, seraya berfirman,”dan bertawakkalah kepada Allah Yang Mahaperkasa lagi Maha penyayng,” tawakal adalah kepasrahan hati kepada Allah dalam mencari manfaat dan menolak berbagai marabahaya yang disertai keyakinannya kepada Allah dan berbaik sangka kepadaNya mengenai keberhasilannya meraih cita-cita. Karena sesungguhnya Dia Mahaperkasa lagi Maha penyayang. Dengan keperkasaanNya, Dia kuasa melimpahkan kebaikan dan menolak segala keburukan dari hambaNya, dan dengan rahmatNya, Dia melakukan hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 217: Yakni serahkanlah semua urusanmu kepada Allah. Penolong terbesar bagi seorang hamba untuk melaksanakan perintah Allah adalah bertawakkal dan bersandar kepada Tuhannya, meminta pertolongan-Nya agar diberi taufiq untuk menjalankan perintah-Nya. Tawakkal artinya bersandarnya hati kepada Allah untuk memperoleh manfaat dan menyingkirkan bahaya sambil memiliki rasa percaya kepada-Nya serta bersangka baik bahwa permintaan dapat dipenuhi, karena Dia Mahaperkasa lagi Maha Penyayang. Dengan keperkasaan-Nya, Dia sanggup memberikan kebaikan kepada hamba-hamba-Nya dan menolak keburukan dari mereka, dan dengan rahmat-Nya Dia melakukan hal itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 217",
    "description": "217. Dan setelah engkau lakukan tugasmu berdakwah kepada mereka, bertawakAllah, pasrahkanlah semua urusanmu hanya kepada Allah yang mahaperkasa, mahakuat yang mampu menyiksa siapa pun yang berani menantang-Nya, maha penyayang kepada siapa pun yang senantiasa taat kepada-Nya. 218. Dialah Allah yang selalu memerhatikanmu. Dia melihat engkau ketika engkau berdiri dengan penuh ketundukan untuk melakukan salat."
  }
]