[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "217-220. Dan serahkanlah urusanmu kepada Allah Dzat Yang Mahaperkasa yang tidak dapat dikalahkan dan tidak dapat ditundukkan, Yang Maha Penyayang yang tidak mengabaikan para waliNya. Dan Dia-lah yang melihatmu saat kamu berdiri mengerjakan shalat sendiran di tengah malam, dan melihat perubahan gerak badanmu besama orang-orang yang bersujud dalam shalat mereka bersamamu, dengan berdiri,rukuk, sujud, dan duduk. Sesungguhnya Dia maha Mendengar bacaan al-Qur’an dan dzikirmu, lagi Maha Mengetahui niat dan amal perbuatanmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "219. dan Dia melihat pula perubahan gerak badanmu dari satu gerakan ke gerakan yang lain di antara orang-orang yang salat, tiada satu gerakan dan perbuatanmu pun yang tersembunyi dari-Nya, dan tidak pula tersembunyi bagi-Nya segala yang dilakukan oleh selainmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "219. وَتَقَلُّبَكَ فِى السّٰجِدِينَ (dan (melihat pula) perubahan gerak badanmu di antara orang-orang yang sujud) Dan Allah melihat ketika kamu menegakkan shalat dalam jama’ah sambil ruku, sujud, dan berdiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "219. Yang melihat pula perubahan gerak badanmu baik berdiri, rukuk, sujud di antara orang-orang yang shalat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan perubahan gerakanmu di antara orang-orang yang sujud} dan melihat perubahanmu dari berdiri, rukuk, sujud dan dudukmu bersama orang-orang yang shalat berjamaah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "218-220 kemudian Allah mengingatkannya pada permohonan pertolongan dengan cara menghadirkan rasa dekat kepada Allah dan memposiskan diri pada tingkat ihsan, seraya berfirman, ”yang melihat kamu ketika kamu berdiri (untuk shalat), dan (melihat pula) perubahan gerak badanmu di antara orang-orang yang sujud,” maksudnya, Dia melihatmu di dalam ibadah yang agung ini, yaitu shalat, waktu kamu berdiri dan waktu kamu berubah gerakan; rukuk dan sujud. Allah mengkhususkan penyebutan shalat karena keutamaan dan kemuliaannya, dan karena siapa saja yang mampu menghadirkan rasa dekat kepada Rabbnya, niscaya dia khusu’, merasa hina dan dapat menyempurnakannya. Dan dengan menyempurnakan shalat itu maka seluruh amalnya menjadi sempurna pula, dan melalui shalat itu pula dia dapat memohon pertolongan atas seluruh urusannya. “sesungguhnya Dia adalah Yang Maha Mendengar\", seluruh suara dengan berbagai macam, ragam dan variasinya, “lagi Maha Mengetahui,” yang mencakup segala hal yang tersembunyi dan yang nampak, yang ghaib dan yang nyata. Tindakan seseorang menghadirkan perasaan selalu dilihat Allah dalam segala kondisinya, dan didengarNya apa saj ayang diucapkannya, serta diketahuiNya apa saja yang ada di dalam hatinya, seperti rasa sedih, tekad dan berbagai niat, adalah termasuk hal yang dapat membantu untuk mencapai kedudukan ihsan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 219: Yakni, Dia melihatmu dalam mengerjakan ibadah yang agung ini, waktu kamu berdiri, merubah gerakan badan, baik dengan ruku’, sujud maupun duduk. Kata sujud disebutkan secara khusus karena keutamaannya, dan karena barang siapa yang berusaha merasakan kedekatan Tuhannya di waktu sujud, maka badannya akan khusyu’, tunduk dan melaksanakannya dengan baik, sedangkan shalat itu sendiri jika disempurnakan maka amal yang lain akan ikut sempurna dan dapat digunakan untuk membantu menghadapi segala urusan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 219",
    "description": "219. Dan dia juga melihat perubahan gerakan badanmu di antara orang-orang yang sujud dalam salat, dari berdiri, sampai duduk atau perge-rakanmu di antara orang-orang yang beriman, sebagaimana para nabi terdahulu. 220. Sungguh, dia maha mendengar semua apa yang kau katakan dan engkau keluhkan, maha mengetahui apa yang kau kerjakan. Semua yang terjadi tidak berlalu begitu saja, tetapi akan mendapatkan perhi-tungan dari Allah."
  }
]