[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Musa berkata menjawab Fir’aun, “Aku memang telah melakukan apa yang kamu katakan sebelum Allah menurunkan wahyu kepadaku dan sebelum mengutusku sebagai rasul, lalu aku keluar dari sisi kalian untuk melarikan diri menuju negeri Madyan, karena aku takut kalian akan membunuhku karena apa yang telah aku perbuat tanpa sengaja. Kemudian Tuhanku menganugerahiku kenabian dan ilmu, sebagai bentuk kemurahan dariNya bagiku, dan menjadikanku termasuk di antara rasul-rasul utusanNya. Dan pengasuhan (terhadapku) dahulu dirumahmu kamu anggap sebagai budi baik darimu kepadaku, padahal kamu sungguh telah memperbudak orang-orang Bani Israil, kamu sembelih anak-anak lelaki mereka dan kamu biarkan hidup perempuan-perempuan mereka untuk dijadikan sebagai pembantu dan dihinakan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Adapun budi baikmu berupa pemeliharaanmu terhadap diriku tanpa memperbudakku, padahal engkau memperbudak Bani Israil, maka benar-benar merupakan satu budi yang engkau berikan padaku, namun hal tersebut tidaklah menghalangiku untuk mendakwahimu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Kemudian Musa mengingkari perkataan Fir’aun: “Bagaimana bisa kamu berjasa kepadaku dengan kebaikanmu itu padahal kamu telah memperbudak dan menindas kaumku, Bani Israil?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَتِلْكَ نِعْمَةٌ تَمُنُّهَا عَلَىَّ أَنْ عَبَّدتَّ بَنِىٓ إِسْرٰٓءِيلَ (dan kebaikan yang kamu limpahkan kepadaku itu adalah (disebabkan) kamu telah memperbudak Bani Israil) Yakni apakah itu suatu kenikmatan? Apakah kamu mengungkit-ungkit kepadaku karena kamu telah mengasuhku saat aku masih kecil sedangkan kamu memperbudak Bani Israil dan membunuh mereka padahal mereka adalah kaumku. Andai saja kamu tidak membunuh anak-anak Bani Israil niscaya ibuku tidak harus menghanyutkanku di sungai. Oleh sebab itu janganlah kamu mengungkit-ungkit terhadapku suatu kesusahan yang kamu sebabkan sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Apakah nikmat yang kamu berikan kepadaku dengan mengasuhku sebagai anak karena kamu telah memperbudak kaumku Bani Israil dan menyembelih anak-anak lelaki mereka?! Kata {An} tersebut adalah An Tafsiriyyah, sehingga kata yang terletak setelahnya menjelaskan kata yang terletak sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah kenikmatan yang kamu berikan kepadaku, dan kamu memperbudak} kamu memperbudak {Bani Israil”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-22 Lalu Musa berkata, ”aku telah melakukannya, sedang aku di waktu itu termasuk orang-orang yang khilaf,” maksudnya, bukan karena kafir, melainkan karena aku khilaf dan kurang berakal, lalu aku memohon ampun kepada Rabbku, dan Dia pun mengampuniku. “lalu aku lari meninggalkan kamu ketika aku takut kepadamu,” saat kalian berupaya untuk membunuhku, maka aku lari ke negeri madyan dan aku tinggal di sana beberapa tahun, lalu aku datang kepada kalian, “kemudian Rabbku memberikan kepadaku ilmu serta Dia menjadikanku salah seorang drai rasul-rasul.” Walhasil, bahwa penolakan fir’aun terhadap Nabi Musa adalah penolakan seorang yang bodoh atau orang yang berpura-pura bodoh. Sebab, fir’aun telah menjadikan pembunuhan (yang dilakukan oleh Musa) sebagai penghalang untuk menjadi seorang rasul. Oleh karena itu, Musa menjelaskan kepadanya bahwa pembunuhan yang dilakukannya karena khilaf dan tidak sengaja untuk membunuhnya, dan bahwa karunia Allah tidak bisa dihalangi oleh seorang pun. Lalu kenapa kalian menghalangi hikmah dan kerasulan yang telah Allah karuniakan kepadaku? Sekarang, wahai Fir’aun, tinggal argumentasimu, yang kamu katakan, “bukankah kami telah mengasuhmu di dalam (keluarga) kami, waktu kamu masih kanak-kanak?” setelah dicermati, maka jelas sekali bahwa sebenarnya sama sekali tidak ada kebaikan (jasa) sama sekali bagimu pada saat itu. Maka dari itu Musa berkata, ”itu adalah nikmat,” yang dikaruniakan “kepadaku disebabkan kamu telah memperbudak Bani israil,” maksudnya, nikmat ini dilimpahkan kepadaku adalah karena sesungguhnya, kamu telah membuat hina bani israil dan kamu telah menjadikan mereka tak ubahnya seperti budak, sedangkan aku telah engkau selamatkan dari perbudakanmu dan penghinaanmu, dan kamu telah menjadikan hal itu sebagai nikmat bagiku. Jadi, tatkala direnungkan, maka tampak bahwa yang sebenarnya adalah karena engkau telah menzhalimi bangsa yang mulia ini (bani israil), engkau menyiksa mereka dan engkau telah memperkerjakan mereka secara paksa; sedangkan aku telah diselamatkan oleh Allah dari kejahatanmu, pada saat kejahatanmu menimpa kaumku. Lalu jasa apa yang kamu lakukan dan engkau karuniakan kepadaku?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 22: Musa kemudian berkata : Ingatlah wahai fir’aun atas pemberian ini (atas kerasulanku) yang engkau diberikan dengannya dariku dan yang tidak ada lagi arah bagimu untuk berpaling serta janganlah engkau lupa bahwasanya engkau telah menjauhkan bani israil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika diteliti dengan seksama, maka diketahui bahwa Fir’aun tidak memberikan kebaikan kepada Nabi Musa ‘alaihis salam, karena Fir’aun telah memperbudak kaum Nabi Musa ‘alaihis salam, yaitu Bani Israil dan menzalimi mereka, adapun Nabi Musa ‘alaihis salam, maka Allah selamatkan Beliau dari kezaliman itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 22",
    "description": "Lalu nabi musa membandingkan antara kebaikan yang dia terima dari fir'aun dengan kekejaman fir'aun terhadap bani israil. Musa berkata lagi, \"dan itulah kebaikan yang telah engkau berikan kepadaku, engkau pelihara diriku ketika aku masih bayi sampai aku dewasa. Sementara itu engkau telah memperbudak bani israil, kaumku sendiri. Engkau perlakukan mereka dengan tidak berperi kemanusiaan. Sungguh ini dua hal yang tidak sebanding. Jika bukan karena kekejamanmu, ibuku tidak akan melemparkan aku ke sungai, dan tidak akan kau pelihara diriku. \"23. Fir'aun penasaran terhadap perkataan nabi musa bahwa dia dan sudaranya harun diutus oleh Allah rabbul 'alamin. Fir'aun bertanya kepada musa, 'siapa tuhan pencipta dan pemelihara seluruh alam itu''."
  }
]