[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "217-220. Dan serahkanlah urusanmu kepada Allah Dzat Yang Mahaperkasa yang tidak dapat dikalahkan dan tidak dapat ditundukkan, Yang Maha Penyayang yang tidak mengabaikan para waliNya. Dan Dia-lah yang melihatmu saat kamu berdiri mengerjakan shalat sendiran di tengah malam, dan melihat perubahan gerak badanmu besama orang-orang yang bersujud dalam shalat mereka bersamamu, dengan berdiri,rukuk, sujud, dan duduk. Sesungguhnya Dia maha Mendengar bacaan al-Qur’an dan dzikirmu, lagi Maha Mengetahui niat dan amal perbuatanmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "220. Sesungguhnya Dia Maha Mendengar apa yang engkau baca berupa Al-Qur`ān atau zikir dalam salatmu, lagi Maha Mengetahui niatmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "220. Sesungguhnya Dia adalah Yang Maha Mendengar kepada doa-doamu, Maha Tahu atas niatmu, maka jangan putus asa, sesungguhnya Allah selalu menjaga kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Dialah Dzat Yang Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "218-220 kemudian Allah mengingatkannya pada permohonan pertolongan dengan cara menghadirkan rasa dekat kepada Allah dan memposiskan diri pada tingkat ihsan, seraya berfirman, ”yang melihat kamu ketika kamu berdiri (untuk shalat), dan (melihat pula) perubahan gerak badanmu di antara orang-orang yang sujud,” maksudnya, Dia melihatmu di dalam ibadah yang agung ini, yaitu shalat, waktu kamu berdiri dan waktu kamu berubah gerakan; rukuk dan sujud. Allah mengkhususkan penyebutan shalat karena keutamaan dan kemuliaannya, dan karena siapa saja yang mampu menghadirkan rasa dekat kepada Rabbnya, niscaya dia khusu’, merasa hina dan dapat menyempurnakannya. Dan dengan menyempurnakan shalat itu maka seluruh amalnya menjadi sempurna pula, dan melalui shalat itu pula dia dapat memohon pertolongan atas seluruh urusannya. “sesungguhnya Dia adalah Yang Maha Mendengar\", seluruh suara dengan berbagai macam, ragam dan variasinya, “lagi Maha Mengetahui,” yang mencakup segala hal yang tersembunyi dan yang nampak, yang ghaib dan yang nyata. Tindakan seseorang menghadirkan perasaan selalu dilihat Allah dalam segala kondisinya, dan didengarNya apa saj ayang diucapkannya, serta diketahuiNya apa saja yang ada di dalam hatinya, seperti rasa sedih, tekad dan berbagai niat, adalah termasuk hal yang dapat membantu untuk mencapai kedudukan ihsan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 220: Semua suara. Ilmu-Nya meliputi yang zahir (luar) maupun yang batin (dalam), yang gaib maupun yang tampak. Oleh karena itu, jika seorang hamba merasakan pengawasaan Allah dalam setiap keadaannya, merasakan pendengaran-Nya terhadap apa yang diucapkannya serta merasakan pengetahuan-Nya terhadapa apa yang disembunyikan dalam dada berupa rasa sedih, azam (kemauan keras) dan niat, maka akan membantunya mencapai derajat ihsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 220",
    "description": "220. Sungguh, dia maha mendengar semua apa yang kau katakan dan engkau keluhkan, maha mengetahui apa yang kau kerjakan. Semua yang terjadi tidak berlalu begitu saja, tetapi akan mendapatkan perhi-tungan dari Allah. 221. Ayat-ayat berikut menjelaskan tentang orang-orang yang mendapat bisikan dari setan dan bekerja sama dengannya untuk menyesatkan manusia. Maukah aku beritakan kepadamu, wahai orang kafir mekah, kepada siapa setan-setan itu turun untuk membisikkan kabar bohongnya'."
  }
]