[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "221-223. Apakah kalian mau Aku beritahukan, wahai sekalian manusia, kepada siapa setan-setan itu turun? Setan-setan turun pada setiap pendusta lagi orang yang banyak dosa, seperti dukun. Setan-setan mencuri pendengaran dan mencupliknya dari para malaikat yang paling tinggi (kedudukannya) lalu mereka melontarkan kepada para dukun dan orang-orang yang serupa dengan mereka dari orang-orang yang fasik. Dan kebanyakan mereka itu berdusta. Salah seorang dari mereka (boleh jadi) berkata benar dalam suatu pernyataanya, tetapi ia menambahkan padanya seratus kedustaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "221. \"Apakah akan Aku beritakan kepadamu, kepada siapa setan-setan itu turun, di mana kalian mengklaim bahwa mereka turun dengan membawa Al-Qur`ān?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "221-223. Hai para hamba, Maukah kalian Aku beritahukan kepada siapa setan-setan turun? Mereka turun kepada setiap pendusta dan jahat. Setan-setan mencuri pembicaraan di langit -sebelum mereka terhalangi oleh lemparan api-, kemudian mereka menyampaikan pembicaraan itu kepada para dukun; dan kebanyakan dukun itu adalah pendusta. Ummul mukminin, Aisyah berkata: “Orang-orang bertanya kepada Rasulullah tentang dukun. Maka beliau menjawab: ‘Mereka (para dukun) bukanlah apa-apa.’ Mereka berkata: ‘Wahai Rasulullah, Terkadang apa yang mereka ceritakan itu benar.’ Rasulullah bersabda: ‘Perkataan yang benar itu adalah perkataan yang dicuri oleh jin, kemudian dia membisikkannya ke telinga walinya (dukun) lalu mereka mencampuradukkannya bersama kebenaran itu dengan seratus kedustaan.” (Shahih al-Bukhari 10/216 no. 5762 kitab pengobatan, bab dukun-dukun. Dan Shahih Muslim 4/1750 no. 2228/122-123)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "221. هَلْ أُنَبِّئُكُمْ عَلَىٰ مَن تَنَزَّلُ الشَّيٰطِينُ (Apakah akan Aku beritakan kepadamu, kepada siapa syaitan-syaitan itu turun?) Ayat ini menjelaskan ketidakmungkinan setan-setan untuk turun kepada Rasulullah sebab setan-setan itu hanya turun kepada para pendusta dan pendosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "221. Apakah mau Aku beritakan kepadamu wahai penduduk Makkah, kepada siapa syaitan-syaitan itu turun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah Aku beritakan kepada kalian} apakah aku kabarkan kepada kalian {kepada siapa setan-setan itu turun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "221-223 ini adalah jawaban terhadap siapa saja dari kalangan pendusta rasul, yang mengatakan, ”setan telah turun kepada Muhammad,” dan juga perkataan orang yang mengatakan, ”dia adalah seorang penya’ir (sastrawan),” Allah berfirman, ”apakan akan Aku beritakan kepadamu,” maksudnya, aku kabarkan kepada kalian berita yang sesungguhnya yang tidak mengandung keraguan sedikitpun dan tidak ada syubhatnya, tentang orang yang mana setan telah turun kepadanya. Maksudnya, dalam gambaran orang yang biasa dituruni setan-setan. “mereka turun kepada tiap-tiap pendusta,” maksudnya, pendusta yang banyak mengatakan perkataan palsu dan kebohongan dengan batil, “lagi yang banyak dosa,” dalam perbuatannya dan banyak maksiat. Itulah orang yang suka dituruni setan, dan kondisinya sama dengan kondisi setan. “mereka menghadapkan,” kepada setan itu, “pendengaran.” Yang mereka curi dari langit. “dan kebanyakan mereka adalah orang-orang pendusta,” maksudnya, kebanyakan berita yang mereka sampaikan itu adalah kedustaan. Dia jujur satukali namun berdusta seratus kali, sehingga kebenaran tercampur aduk dengan kebatilan, dan kebenaran menjadi sirna karena minimnya dan karena tidak diketahui. Itulah ciri orang-orang yang biasa dituruni setan-setan, dan itulah bentuk bisikan mereka kepadanya. Sedangkan Muhammad, keadaannya sungguh sangat berbeda sekali dengan kondisi seperti itu, sebab dia adalah seorang yang jujur dan terpercaya yang telah mengkombinasikan antara kesucian hati, kejujuran ucapan dan kebersihan perbuatan dari hal-hal yang diharamkan, dan wahyu yang diturunkan secara terjaga, terpelihara lagi mengandung kebenaran yang agung yang tidak mengandung keraguan sedikitpun. Apakah sama, wahai orang yang berakal antara yang ini (nabi) dengan mereka (orang-orang yang dituruni setan)? Tidaklah keduanya itu mirip kecuali pada pandangan orang yang tidak waras yang tidak dapat membedakan antara berbagai hal?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 221: Ayat ini merupakan jawaban terhadap orang-orang yang mendustakan rasul; yang mengatakan bahwa Nabi Muhammad shallallahu 'alaihi wa sallam didatangi oleh setan atau mengatakan bahwa Beliau adalah penyair."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 221",
    "description": "221. Ayat-ayat berikut menjelaskan tentang orang-orang yang mendapat bisikan dari setan dan bekerja sama dengannya untuk menyesatkan manusia. Maukah aku beritakan kepadamu, wahai orang kafir mekah, kepada siapa setan-setan itu turun untuk membisikkan kabar bohongnya'222. Mereka, setan-setan itu, tidaklah turun kepada nabi Muhammad sebagaimana apa yang kamu sangkakan selama ini, tapi turun kepada setiap pendusta yang membalikkan sesuatu yang buruk menjadi baik dan sebaliknya, yang banyak berdosa dengan melakukan pelanggaran-pelanggaran norma yang tidak dibenarkan oleh agama."
  }
]