[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "221-223. Apakah kalian mau Aku beritahukan, wahai sekalian manusia, kepada siapa setan-setan itu turun? Setan-setan turun pada setiap pendusta lagi orang yang banyak dosa, seperti dukun. Setan-setan mencuri pendengaran dan mencupliknya dari para malaikat yang paling tinggi (kedudukannya) lalu mereka melontarkan kepada para dukun dan orang-orang yang serupa dengan mereka dari orang-orang yang fasik. Dan kebanyakan mereka itu berdusta. Salah seorang dari mereka (boleh jadi) berkata benar dalam suatu pernyataanya, tetapi ia menambahkan padanya seratus kedustaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "223. Setan-setan itu mencuri kabar dengan menguntit kabar di tempat majelis tertinggi, lalu mereka mengabarkannya kepada orang-orang yang mereka cintai dari kalangan para penyihir dan peramal, dan kebanyakan para peramal itu adalah orang-orang pendusta, bila setan itu benar dalam satu kata, maka mereka menurunkan bersamanya seratus kedustaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "223. يُلْقُونَ السَّمْعَ (mereka menghadapkan pendengaran itu) Yakni setan-setan itu menghadapkan pendengarannya pada para malaikat untuk mencuri berita dari mereka, kemudian mereka akan mengabarkannya kepada para dukun sambil mencampuradukkan berita yang benar dengan seratus kebohongan. Atau yang dimaksud adalah dukun-dukun itu menyimak baik-baik apa yang dibisikkan para setan kepada merekam kemudian mereka menambahkannya dengan kebohongan-kebohongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "223. Mereka menghadapkan pendengaran kepada syaitan itu dan mencuri pendengaran di langit tentang nasib mereka. Kemudian mereka diarahkan untuk pergi ke dukun agar mereka bisa dibohongi, sebab kebanyakan mereka adalah pendusta. Dhomir hum kembali kepada dukun, atau mereka adalah pendusta. Sebab segala yang mereka mengambil dari syaitan berita-berita bohong, sangkaan-sangkaan, dan tipu daya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menyampaikan apa yang didengar} setan menyampaikan apa yang mereka dengar dari malaikat paling tinggi kepada para dukun {dan kebanyakan mereka adalah para pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "221-223 ini adalah jawaban terhadap siapa saja dari kalangan pendusta rasul, yang mengatakan, ”setan telah turun kepada Muhammad,” dan juga perkataan orang yang mengatakan, ”dia adalah seorang penya’ir (sastrawan),” Allah berfirman, ”apakan akan Aku beritakan kepadamu,” maksudnya, aku kabarkan kepada kalian berita yang sesungguhnya yang tidak mengandung keraguan sedikitpun dan tidak ada syubhatnya, tentang orang yang mana setan telah turun kepadanya. Maksudnya, dalam gambaran orang yang biasa dituruni setan-setan. “mereka turun kepada tiap-tiap pendusta,” maksudnya, pendusta yang banyak mengatakan perkataan palsu dan kebohongan dengan batil, “lagi yang banyak dosa,” dalam perbuatannya dan banyak maksiat. Itulah orang yang suka dituruni setan, dan kondisinya sama dengan kondisi setan. “mereka menghadapkan,” kepada setan itu, “pendengaran.” Yang mereka curi dari langit. “dan kebanyakan mereka adalah orang-orang pendusta,” maksudnya, kebanyakan berita yang mereka sampaikan itu adalah kedustaan. Dia jujur satukali namun berdusta seratus kali, sehingga kebenaran tercampur aduk dengan kebatilan, dan kebenaran menjadi sirna karena minimnya dan karena tidak diketahui. Itulah ciri orang-orang yang biasa dituruni setan-setan, dan itulah bentuk bisikan mereka kepadanya. Sedangkan Muhammad, keadaannya sungguh sangat berbeda sekali dengan kondisi seperti itu, sebab dia adalah seorang yang jujur dan terpercaya yang telah mengkombinasikan antara kesucian hati, kejujuran ucapan dan kebersihan perbuatan dari hal-hal yang diharamkan, dan wahyu yang diturunkan secara terjaga, terpelihara lagi mengandung kebenaran yang agung yang tidak mengandung keraguan sedikitpun. Apakah sama, wahai orang yang berakal antara yang ini (nabi) dengan mereka (orang-orang yang dituruni setan)? Tidaklah keduanya itu mirip kecuali pada pandangan orang yang tidak waras yang tidak dapat membedakan antara berbagai hal?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 223: Yang mereka curi berita itu dari para malaikat, lalu menyampaikannya kepada para dukun. Mereka campurkan berita benar dengan seratus kedustaan, mencampurkan yang hak dan yang batil, dan kebenaran pun lenyap karena sedikit jumlahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 223",
    "description": "223. Mereka, para setan itu, menyampaikan hasil pendengaran mereka berupa kabar dari langit yang mereka curi, kemudian mereka mencampurnya dengan sejuta kebohongan, lalu menyampaikannya kepada para dukun, juru ramal dan lainya, sedangkan kebanyakan mereka, para setan atau dukun itu, adalah orang-orang pendusta. Bandingkan hal itu dengan nabi Muhammad, seorang yang tidak pernah berdusta. 224. Orang kafir quraisy menuduh nabi Muhammad sebagai seorang penyair. Allah membantah anggapan itu dengan tegas, dan penyair-penyair itu yang kamu sekalian terpukau dengan syair-syair mereka, diikuti oleh orang-orang yang sesat. Tidak demikian halnya pengikut nabi Muhammad yang sangat taat kepada aturan-aturan agama."
  }
]