[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "224-226. Dan penyair-penyair itu, lantunan syair mereka berasaskan pada kebatilan dan kebohongan. Mereka diikuti oleh orang-orang sesat dan menyimpang yang serupa dengan mereka. Tidakkah kamu, wahai nabi, melihat mereka itu pergi berjalan layaknya orang yang wajahnya tengah kebingungan? Mereka hanyut dalam setiap jenis kedustaan, kata-kata palsu, mencoreng kehormatan manusia, menjelek-jelekkan nasab, melontarkan hinaan terhadap wanita yang terjaga (dari perbuatan keji), dan mereka itu mengatakan apa yang tidak mereka perbuat. Mereka berlebihan dalam memuji para pengusung kebatilan dan mengolok-olok orang-orang yang berada di atas jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "224. Dan penyair-penyair yang kalian klaim bahwa Muhammad itu adalah bagian dari mereka; diikuti oleh orang-orang yang sesat dari jalan petunjuk dan lurus, sehingga merekapun meriwayatkan syair-syair yang mereka katakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "224-227. Allah menyampaikan bahwa para penyair terbagi menjadi dua golongan dari sisi kebaikan dan kefasikan mereka; adapun para penyair yang fasik adalah yang diikuti orang-orang yang sesat dari kebenaran. Tidakkah kamu melihat di setiap perkataan mereka berisi pujian yang buruk, perkataan yang menghina, dan gurauan yang beracun. Mereka berjalan seperti orang yang bingung, dan berpaling dari jalan yang benar. Kebanyakan perkataan meraka adalah dusta, karena mereka mengakui sesuatu yang tidak mereka lakukan. Kemudian Allah mengecualikan golongan penyair yang baik: Kecuali mereka yang beriman kepada Allah dan rasul-Nya, melakukan amalan-amalan shalih yang telah Allah syariatkan, banyak menyebutkan nama Allah dan pujian pada-Nya pada syair-syair mereka, dan mereka membela Rasulullah dan memperjuangkan agama Islam dan umat Islam dalam membela orang yang terzalimi dari mereka. Dan orang-orang yang zalim akan mengetahui di mana tempat mereka akan kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "224. وَالشُّعَرَآءُ يَتَّبِعُهُمُ الْغَاوُۥنَ (Dan penyair-penyair itu diikuti oleh orang-orang yang sesat) Yakni orang-orang yang sesat itu mengikuti jalan para penyair, mereka adalah orang-orang sesat dari kalangan jin dan manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "224. Para penyair-penyair itu diikuti oleh orang-orang yang sesat, sebab kebanyakan perkataan para penyair itu adalah khayalan tanpa kebenaran. Ibnu Abbas berkata: \"Pada zaman nabi ada dua laki-laki yang saling mencambuk. Salah satu dari kalangan Anshor, dan salah satu dari kabilah lain. Setiap dari mereka membawa seorang ahli tipu daya dari kaumnya, mereka adalah orang-orang yang bodoh. Maka turunlah ayat ini\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para penyair itu diikuti oleh orang-orang yang sesat} orang-orang yang tersesat dari jalan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "224-226 setelah Allah membebaskannya dari turunnya setan-setan kepada beliau, maka Allah juga membebaskannya dari sya’ir, seraya berfirman, ”dan penyair-penyair itu.” Maksudnya, Aku sampaikan pula berita tentang kondisi para ahli sya’ir dan sifat permanen mereka, yaitu bahwa sesungguhnya mereka, “diikuti oleh orang-orang yang sesat,” dari jalan petunjuk, yang menulusuri jalan menuju kesesatan dan kebinasaan. Mereka sendiri adalah orang-orang yang sesat, dan Anda akan menemukan para pengikutnya adalah setiap orang sesat lagi celaka. “tidaklah kamu melihat,” betapa sesatnya mereka, “bahwasannya mereka di tiap-tiap lembah,” dari lembah-lembah sya’ir, “mengembara,” kadang-kadang memuji, kadang-kadang mencaci, kadang-kadang dalam kejujuran, dan kadang-kadang memperolok-olok, kadang bersenang-senang dan kadang bersedih. Mereka tidak mempunyai pendirian tetap, dan mereka selalu tidak dalam satu kondisi. “dan bahwasannya mereka suka mengatakan sesuatu yang mereka sendiri tidak mengerjakan,” maksudnya, ini adalah ciri para penyair. Perkataan mereka menyelisihi perbuatan mereka. Apabila engkau mendengar seorang penyair merayu dengan rayuan lembut, maka engkau akan mengatakan, ”orang ini adalah orang yang paling mabuk cinta,” padahal hatinya kosong dari semua itu. Dan apabila engkau mendengarnya memuji atau mencela, maka engkau akan mengatakan, “ini kejujuran,”! padahal itu dusta! Dan kadang-kadang dia memuji-muji pekerjaan-pekerjaan yang tidak pernah dia lakukan, dan larangan-larangan yang dia sendiri tidak meninggalkannya, dan kedermawanan yang dia sendiri belum pernah terjun di ladangnya, serta keberanian yang mengalahkan pasukan berkuda, sementara anda menjumpainya sebagai manusia yang paling pengecut! Itulah karakter mereka. Maka cobalah perhatikan, apakah sama dengan keadaan Rasulullah yang sangat bijak lagi baik, yang diikuti oleh setiap orang yang berakal (bijak) lagi mendapat petunjuk, yang telah berkonsisten berjalan di atas hidayah dan menjauhi kebinasaan. Perbuatan-perbuatannya tidak pernah kontradiksi, [dan perkataan perkataannya belum pernah menyelisihi perbuatannya], yang tidak menyuruh kecuali kepada kebaikan, dan tidak mencegah kecuali terhadap keburukan, tidak pernah memberitakan sesuatu melainkan kebenaran, dan tidak pernah memerintahkan sesuatu melainkan beliau adalah orang pertama yang melakukannya, dan tidak pula pernah mencegah sesuatu melainkan beliau adalah orang pertama yang meninggalkannya. Lalu apakah sama kondisi beliau dengan kondisi para penyair, atau mendekati mereka? Ataukah sangta berbeda dari segala sisi? Semoga shalawat dan salam tetap Allah limpahkan kepada Rasul yang sempurna ini, yang paling bersemangat lagi termulia ini sepanjang masa, yang mana beliau bukanlah seorang penyair, bukan seorang ahli sihir dan bukan seorang yang gila (tidak waras), dan tidak ada (gambaran) yang laik dengannya kecuali segala kesempurnaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 224: Setelah Allah Subhaanahu wa Ta'aala membersihkan Beliau dari tuduhan didatangi oleh setan, maka Dia membersihkan pula Beliau dari tuduhan penyair. Yakni, maukah Aku beritahukan keadaan para penyair dan sifat yang melekat dalam diri mereka? Diri mereka (para penyair) sesat dan pengikutnya pun orang-orang yang sesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 224",
    "description": "224. Orang kafir quraisy menuduh nabi Muhammad sebagai seorang penyair. Allah membantah anggapan itu dengan tegas, dan penyair-penyair itu yang kamu sekalian terpukau dengan syair-syair mereka, diikuti oleh orang-orang yang sesat. Tidak demikian halnya pengikut nabi Muhammad yang sangat taat kepada aturan-aturan agama. 225. Tidakkah engkau melihat bahwa mereka mengembara di setiap lembah dengan mengikuti hawa nafsu mereka' terkadang membenci sesuatu kemudian memujinya dan sebaliknya."
  }
]