[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengecualikan dari para penyair itu para penyair yang mendapatkan hidayah dengan keimanan, dan beramal shalih, serta memperbanyak berdzikir (mengingat dan menyebut) Allah. mereka melantunkan syair tentang mentauhidkan Allah, pujian kepadaNya, Dzat Yang Mahatinggi namaNya, membela Rasulullah Muhammad, mengucapkan kata-kata dengan hikmah, nasihat dan adab-adab yang luhur, serta membela Islam. Mereka mengolok orang yang mengolokNya atau mengolok RasulNya, sebagai sanggahan terhadap para penyair dari orang-orang kafir. Dan orang-orang yang zhalim terhadap diri mereka dengan perbuatan syirik dan maksiat dan menzhalimi orang lain dengan melecehkan hak orang atau menganiaya mereka atau dengan tuduhan-tuduhan yang batil, akan mengetahui tempat kembali manakah dari tempat kembali yang buruk lagi membinasakan yang akan mereka tempati kelak? Sesungguhnya itu adalah tempat kembali yang buruk. Kami memohon kepada Allah keselamatan dan terbebas dari segala keburukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "227. Kecuali penyair-penyair yang beriman, beramal saleh, banyak menyebut Allah dan mendapat kemenangan dari musuh-musuh Allah sesudah mereka menderita kezaliman, semisal Hassān bin Ṡabit -raḍiyallāhu 'anhu-. Dan orang-orang zalim yang melakukan kesyirikan kepada Allah dan kezaliman terhadap hamba-hamba-Nya itu kelak akan mengetahui ke tempat mana mereka akan kembali, mereka pasti akan kembali ke tempat (padang mahsyar) yang agung, dan hisab yang sangat detail."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "227. إِلَّا الَّذِينَ ءَامَنُوا۟ (kecuali orang-orang yang beriman) Yakni orang-orang beriman dari para penyair itu. وَعَمِلُوا۟ الصّٰلِحٰتِ(dan beramal saleh) Mereka telah masuk dalam golongan orang-orang beriman dan mereka berbuat amal shalih. وَذَكَرُوا۟ اللهَ كَثِيرًا(dan banyak menyebut Allah) Dalam sya’ir-sya’ir mereka. وَانتَصَرُوا۟ مِنۢ بَعْدِ مَا ظُلِمُوا۟ ۗ( dan mendapat kemenangan sesudah menderita kezaliman) Seperti membalas ejekan orang yang mengejeknya, atau menolong orang yang berilmu dan mulia, sebagaimana yang dilakukan oleh para penyair Rasulullah, mereka membalas olokan orang yang mengolok Rasulullah, dan mereka melindunginya, membela kehormatannya, serta melawan penyair-penyair musyrik. وَسَيَعْلَمُ الَّذِينَ ظَلَمُوٓا۟ أَىَّ مُنقَلَبٍ يَنقَلِبُونَ(Dan orang-orang yang zalim itu kelak akan mengetahui ke tempat mana mereka akan kembali) Yakni penyair-penyair yang berdusta itu dan orang-orang yang semisalnya akan mengetahui buruknya tempat kembali mereka saat bertemu dengan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "227. Kecuali penyair-penyair yang memiliki empat sifat yaitu beriman kepada Allah dan rasul, beramal saleh melaksanakan perintah dan menjauhi larangan. Senantiasa banyak menyebut Allah dalam puisi mereka, dan menolong agama mereka dari orang-orang zolim/musuh mereka atau orang-orang kafir. Seperti apa yang sudah dilakukan dua penyair pada zaman Nabi yaitu Hasan bin Tsabit dengan melawan orang musyrik dan mendukung Nabi dan seruan Islam. Dan orang-orang yang zalim itu kelak akan mengetahui ke tempat mana mereka akan kembali. Munqalib adalah tempat kembali atau tempat tinggal, yanqalibun adalah kembali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali yang beriman, beramal shalih, banyak mengingat Allah, dan menang setelah terzalimi. Orang-orang yang zalim akan mengetahui tempat kembali mana} kembali {mereka akan dikembalikan} kembali kepadaNya setelah mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "227 setelah Allah menjelaskan kondisi para penyair dengan penjelasan yang telah Dia jelaskan itu, Dia mengecualikan orang yang beriman (dari para penyair itu) kepada Allah, kepada RasulNya dan beramal shalih, suka memperbanyak dzikir kepada Allah dan melawan musuh-musuhnya dari kaum musyrikin setelah menganiaya mereka. Sehingga syair mereka menjadi bagian dari amal shalih dan buah dari iman mereka, karena (syair-syair mereka) mengandung pujian terhadap orang-orang beriman dan perlawanan terhadap ahli syirik dan kafir, serta pembelaan terhadap agama Allah dan penjelasan terhadap ilmu-ilmu yang bermanfaat dan himbauan untuk berakhlak mulia, seraya berfirman, “kecuali orang-orang (penyair-penyair) yang beriman dan beramal shalih dan banyak menyebut Allah dan mendapat kemenangan sesudah menderita kezhaliman. Dan orang-orang yang zhalim itu kelak akan mengetahui ke tempat mana mereka akan kembali,” yaitu ke tempat hisab yang mana tidaklah ia melewati suatu perbuatan (dosa) kecil dan besar melainkan pasti ia mengitungnya, dan tidaklah melewati suatu hak melainkan pasti memenuhinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Asy-Syu’ara ayat 227: Setelah Allah Subhaanahu wa Ta'aala menyebutkan sifat para penyair, maka Allah mengecualikan dari yang disebutkan, yaitu orang-orang yang beriman kepada Allah dan Rasul-Nya dan beramal saleh, banyak mengingat Allah, dan mendapat kemenangan terhadap orang-orang musyrik dan orang-orang kafir, yang membela agama Allah, yang menerangkan ilmu-ilmu yang bermanfaat serta mendorong berakhlak mulia. Sya’ir mereka tidak membuat mereka lalai dari mengingat Allah. Yakni maka mereka tidak tercela. Allah Subhaanahu wa Ta'aala berfirman, “Allah tidak menyukai ucapan buruk, (yang diucapkan) dengan terang-terangan kecuali oleh orang yang dianiaya. Allah Maha Mendengar lagi Maha Mengetahui.” (Terj. An Nisaa’: 148) Baik dari kalangan penyair maupun selainnya. Setelah mati mereka akan mendatangi mauqif (padang mahsyar) dan siap menghadapi hisab yang kemudian akan menerima pembalasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 227",
    "description": "227. Pada ayat ini diterangkan kriteria penyair yang dikecualikan dari penyair yang disebut di atas. Kecuali orang-orang yaitu penyair-penyair yang beriman dengan iman yang benar dan berbuat kebajikan yang sesuai dengan ketentuan syariah dan banyak mengingat Allah, baik siang maupun malam, dan mendapat kemenangan setelah terzalimi karena menja-wab puisi-puisi orang-orang kafir. Pada akhir surah ini Allah memberikan peringatan keras terhadap orang-orang kafir. Dan orang-orang yang zalim kelak yaitu pada hari kebangkitan, akan tahu ke tempat mana me-reka akan kembali. Mereka akan kembali ke neraka. 1. '' s'n. Inilah ayat-ayat Al-Qur'an, dan kitab yang jelas, bahwa kitab ini adalah firman Allah dan menjelaskan pesan-pesan Allah kepada manusia."
  }
]