[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun bertanya kepada Musa, “Siapakah Tuhan semesta alam itu yang kamu mengaku-aku sebagai utusanNya?’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Fir'aun lalu bertanya kepada Musa -'alaihissalām-, \"Siapa Rabb seluruh makhluk yang engkau klaim bahwa Dia lah yang mengutus dirimu?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Mulailah perbincangan Fir’aun dengan Musa tetang hakikat Tuhan semesta alam, setelah Musa berkata bahwa dia adalah utusan dari Tuhan semesta alam. Maka Musa menjawab: “Dia adalah Pencipta tujuh langit dan bumi serta makhluk-makhluk yang ada di antara keduanya, maka berimanlah kepada Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. قَالَ فِرْعَوْنُ وَمَا رَبُّ الْعٰلَمِينَ (Fir’aun bertanya: “Siapa Tuhan semesta alam itu?”) Yakni siapakah Dia?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Fir’aun berkata kepadanya: “Bagaimanakah hakikat tuhan semesta alam sebagaimana yang kamu katakan bahwa kamu adalah utusannya itu?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Fir‘aun berkata,“Siapa Tuhan semesta alam ini”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-25 “fir’aun bertanya, ’siapa Rabb semesta alam itu?” ini adalah pengingkaran fir’aun terhadap Rabbnya secara zhalim dan congkak, padahal dia meyakini kebenaran sesuatu yang diserukan oleh Musa kepadanya, yaitu: “Musa menjawab, ’Rabb pencipta langit dan bumi dan apa saja yang di antara keduanya,” maksudnya, Dzat yang telah menciptakan alam atas dan alam bawah dan yang telah mengaturnya dengan berbagai bentuk pengaturan dan telah mengelolanya dengan berbagai bentuk pengelolaan. Diantaranya adalah kalian semua, wahai yang sekarang sedang diajak bicara! Lalu bagaimana bisa kalian mengingkari Sang Pencipta seluruh makhluk, pencipta bumi dan langit, “jika kamu sekalian adalah orang-orang yang mempercayaiNya.” lalu Fir’aun berkata dengan nada angkuh dan sok heran, “apakah kamu tidak mendengarkan” apa yang dikatakan oleh lelaki ini?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 23: Fir’aun berkata dengan sombong dan takabbur : Dan siapa itu Tuhan semesta alam yang engkau menyeruku bahwasanya engkau (mengklaim) adalah utusan-Nya kepada kami ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang engkau mengaku sebagai Rasul-Nya. Ini merupakan pengingkaran Fir’aun kepada Nabi Musa ‘alaihis salam karena zalim dan sombong, padahal ia yakin terhadap kebenaran yang diserukan Nabi Musa ‘alaihis salam. Oleh karena tidak ada jalan bagi makhluk untuk mengetahui hakikat-Nya, dan mereka hanya bisa mengenal-Nya dengan sifat-sifat-Nya, maka Nabi Musa ‘alaihis salam menjawab dengan sebagian sifat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 23",
    "description": "Fir'aun penasaran terhadap perkataan nabi musa bahwa dia dan sudaranya harun diutus oleh Allah rabbul 'alamin. Fir'aun bertanya kepada musa, 'siapa tuhan pencipta dan pemelihara seluruh alam itu''24. Dia, yakni musa, menjawab, dengan tiga jawaban. Pertama: 'tuhan yang mengutusku adalah tuhan pencipta, pengurus, pemelihara langit dan bumi dan apa yang ada di antara keduanya seperti benda-benda langit dan lainnya. Hal berbeda dengan dirimu yang hanya meguasai negeri mesir dengan kekuatanmu. Aku katakan hal ini kepadamu dengan sebenar-benarnya, jika kamu mempercayai-Nya. \"."
  }
]