[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada para petingginya yang berada di sekelilingnya, “apakah kalian mendengar perkataan Musa yang aneh itu tentang adanya Tuhan selain aku?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Fir'aun berkata kepada para pemuka kaumnya yang ada di sekelilingnya, \"Apakah kalian tidak mendengarkan jawaban Musa yang penuh dengan klaim dusta?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Fir’aun berkata kepada para pemuka kaumnya dengan penuh penghinaan dan tipu daya: “Tidakkah kalian mendengar apa yang dikatakan Musa?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. قَالَ (Berkata Fir’aun) Yakni Fir’aun berkata. لِمَنْ حَوْلَهُۥٓ أَلَا تَسْتَمِعُونَ(kepada orang-orang sekelilingnya: “Apakah kamu tidak mendengarkan?”) Ia mengatakan ini dengan penuh keangkuhan terhadap jawaban yang diberikan Musa. Dan ini merupakan kesalahan Fir’aun yang terlaknat dalam memahami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Fir’aun berkata kepada orang di sekelilingnya, yaitu para pengawal dan bangsawan: “Apakah kalian tidak mendengarkan apa yang dikatakan Musa? Sesungguhnya jawabannya tidak sesuai dengan pertanyaan(ku). Aku bertanya tentang hakikat tuhan alam semesta, namun dia menyebutkan tindakanNya saja karena keheranan sehingga tidak mampu berkata-kata”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata kepada orang-orang di sekitarnya,“Tidakkah kalian mendengar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-25 “fir’aun bertanya, ’siapa Rabb semesta alam itu?” ini adalah pengingkaran fir’aun terhadap Rabbnya secara zhalim dan congkak, padahal dia meyakini kebenaran sesuatu yang diserukan oleh Musa kepadanya, yaitu: “Musa menjawab, ’Rabb pencipta langit dan bumi dan apa saja yang di antara keduanya,” maksudnya, Dzat yang telah menciptakan alam atas dan alam bawah dan yang telah mengaturnya dengan berbagai bentuk pengaturan dan telah mengelolanya dengan berbagai bentuk pengelolaan. Diantaranya adalah kalian semua, wahai yang sekarang sedang diajak bicara! Lalu bagaimana bisa kalian mengingkari Sang Pencipta seluruh makhluk, pencipta bumi dan langit, “jika kamu sekalian adalah orang-orang yang mempercayaiNya.” lalu Fir’aun berkata dengan nada angkuh dan sok heran, “apakah kamu tidak mendengarkan” apa yang dikatakan oleh lelaki ini?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 25: Berkata fir’aun karena (muncul) rasa takut karna sebab kaumnya : Hendaknya kalian tidak mendengarkannya, jangan engkau dengarkan apa yang dikatakan laki-laki ini akan (keterangan) Tuhan semesta alam selainku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Membuat mereka heran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 25",
    "description": "Mendengar jawaban nabi musa ini, fir'aun terasa mulai tersentak. Dia, yakni fir'aun, berkata kepada orang-orang di sekelilingnya, yaitu para pembesar kerajaan, 'apakah kamu tidak mendengar apa yang dikatakannya''26. Jawaban kedua, \"dia yakni musa berkata kepada fir'aun, 'dia itu adalah tuhanmu dan juga tuhan nenek moyangmu terdahulu. ' tuhanku itu satu, tidak ada yang lain. Dialah pencipta alam seluruh dan pencipta manusia dari dahulu sampai kini dan sampai kapanpun, termasuk fir'aun dan kaumnya."
  }
]