[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata, “Tuhan yang aku menyeru kalian kepadaNya, Dia-lah yang menciptakan kalian dan menciptakan nenek moyang kalian yang dahulu, maka bagaimana kalian menyembah orang yang juga makhluk seperti kalian, dia punya nenek moyang yang telah mati, sebagaimana nenek moyang kalian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Musa berkata kepada mereka, \"Allah lah Rabb kalian dan Rabb nenek moyang kalian yang dahulu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Musa berkata dengan penuh kepercayaan diri: “Allah adalah Pencipta kalian, dan pencipta nenek moyang kalian sebelumnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قَالَ رَبُّكُمْ وَرَبُّ ءَابَآئِكُمُ الْأَوَّلِينَ (Musa berkata (pula): “Tuhan kamu dan Tuhan nenek-nenek moyang kamu yang dahulu”) Musa menjelaskan kepada mereka bahwa Fir’aun adalah seorang hamba dan bukanlah tuhan seperti yang ia anggap. Yakni mengapa kalian menyembah salah seorang dari kalian padahal ia adalah makhluk seperti kalian dan ia memiliki nenek moyang yang telah mati sebagaimana nenek moyang kalian juga telah mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Musa berkata: “Allah adalah Tuhan kalian yang telah menciptakan kalian dan Tuhan leluhur kalian terdahulu yang telah menciptakan mereka” Maknanya yaitu bahwa Fir’aun adalah salah satu manusia yang telah diciptakan (olehNya)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Tuhan kalian dan Tuhan nenek moyang kalian terdahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27 lalu Musa berkata, ”Rabbmu dan Rabb nenek-nenek moyangmu yang dahulu,” kalian kaget atau tidak, kalian menyombongkan diri atau tunduk! (faktanya) fir’aun berkata dengan nada menentang kebenaran dan mencemoohkan orang yang membawanya, “sesungguhnya Rasulmu yang diutus kepadamu sekalian benar-benar orang gila,” karena telah meyakini sesuatu yang beralawanan dengan yang kita anut, dan dia menyelisihi sesuatu yang kita pegang. Jadi(menurutnya), yang masuk akal itu adalah ajaranya, sedangkan orang-orang yang berakal itu adalah orang-orang yang beranggapan bahwa mereka tidak diciptakan (oleh sang pencipta) atau orang yang meyakini bahwa langit dan bumi ini memang sudah ada begitu adanya tanpa ada yang menciptakannya, dan bahkan diri mereka sendiri diciptakan tanpa adanya pencipta! Dan yang masuk akal menurutnya adalah ketika makhluk nan lemah itu disembah dari segala sisi! Sedangkan kegilaan itu adalah ketika meyakini Allah Sang Pencipta alam atas dana lam bawah dan pemberi berbagai nikmat yang tampak dan yang tidak tampak dan seruan untuk beribadah kepadaNya!! Ia telah menyulap dan mempercantik ucapan seperti ini kepada kuamnya, sedangkan mereka adalah orang-orang yang kurang berakal dan sangat picik, “maka fir’aun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya. Karena sesungguhnya mereka adalah kaum yang fasik,” (az-zukhruf:54)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 26: Berkata Musa : Allah adalah Tuhanmu dan Tuhan bagi bapak-bapakmu yang terdahulu, Dialah yang menciptakan kalian dan menciptakan bapak-bapak kalian, Dialah yang berhak di ibadahi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni baik kamu heran atau tidak, sombong atau tunduk, Dia adalah Tuhanmu dan Tuhan nenek moyangmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 26",
    "description": "Jawaban kedua, \"dia yakni musa berkata kepada fir'aun, 'dia itu adalah tuhanmu dan juga tuhan nenek moyangmu terdahulu. ' tuhanku itu satu, tidak ada yang lain. Dialah pencipta alam seluruh dan pencipta manusia dari dahulu sampai kini dan sampai kapanpun, termasuk fir'aun dan kaumnya. 27. Fir'aun semakin geram dan marah. Dia yakni fir'aun berkata kepada para pembesar itu dengan penuh kemarahan, 'sungguh, rasulmu yang diutus kepada kamu benar-benar orang gila. ' dia mengatakan sesuatu yang tidak biasa aku dengar."
  }
]