[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada orang-orang dekatnya untuk memprovokasi mereka demi mendustakan Musa, sesungguhnya Rasul kalian ini yang diutus kepada kalian benar-benar orang gila. Ia melontarkan perkataan yang tidak masuk di akal.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Fir'aun berkata, \"Sesungguhnya orang yang mengklaim bahwa ia adalah Rasul yang diutus kepada kalian, benar-benar orang gila, tidak tahu bagaimana menjawab, dan berkata tentang perkara yang ia sendiri tidak mengerti.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Kemudian Fir’aun mulai menyebarkan tuduhan bohong dan penghinaan: “Rasul kalian, Musa yang diutus kepada kalian ini adalah orang gila.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. قَالَ إِنَّ رَسُولَكُمُ الَّذِىٓ أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ (Fir’aun berkata: “Sesungguhnya Rasulmu yang diutus kepada kamu sekalian benar-benar orang gila”) Fir’aun bermaksud menjadikan kaumnya kebingungan dan menunjukkan bahwa ia meremehkan jawaban Musa; seakan-akan ia berkata kepada mereka: “aku bertanya kepada Musa tentang sesuatu namun ia menjawabnya dengan hal lain.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Fir’aun berkata kepada para pengawalnya: “Sungguh rasul yang diutus kepada kalian ini adalah orang gila. Aku menanyainya tentang suatu hal namun dia menjawabnya tentang hal lain dan mengklaim bahwa ada tuhan lain selain aku.” Fir’aun memanggilnya rasul sebagai bentuk hinaan dan ejekan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia (Fir’aun) berkata,“Sesungguhnya rasul kalian yang diutus kepada kalian benar-benar gila”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27 lalu Musa berkata, ”Rabbmu dan Rabb nenek-nenek moyangmu yang dahulu,” kalian kaget atau tidak, kalian menyombongkan diri atau tunduk! (faktanya) fir’aun berkata dengan nada menentang kebenaran dan mencemoohkan orang yang membawanya, “sesungguhnya Rasulmu yang diutus kepadamu sekalian benar-benar orang gila,” karena telah meyakini sesuatu yang beralawanan dengan yang kita anut, dan dia menyelisihi sesuatu yang kita pegang. Jadi(menurutnya), yang masuk akal itu adalah ajaranya, sedangkan orang-orang yang berakal itu adalah orang-orang yang beranggapan bahwa mereka tidak diciptakan (oleh sang pencipta) atau orang yang meyakini bahwa langit dan bumi ini memang sudah ada begitu adanya tanpa ada yang menciptakannya, dan bahkan diri mereka sendiri diciptakan tanpa adanya pencipta! Dan yang masuk akal menurutnya adalah ketika makhluk nan lemah itu disembah dari segala sisi! Sedangkan kegilaan itu adalah ketika meyakini Allah Sang Pencipta alam atas dana lam bawah dan pemberi berbagai nikmat yang tampak dan yang tidak tampak dan seruan untuk beribadah kepadaNya!! Ia telah menyulap dan mempercantik ucapan seperti ini kepada kuamnya, sedangkan mereka adalah orang-orang yang kurang berakal dan sangat picik, “maka fir’aun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya. Karena sesungguhnya mereka adalah kaum yang fasik,” (az-zukhruf:54)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 27: Maka berkata fir’aun dengan angkuh dan sombong : Sesungguhnya (ucapan) ini yaitu klaim bahwasanya dia adalah Rasul adalah tidak masuk akal; Sungguh dia adalah lelaki gila."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menentang yang hak dan mengkritik orang yang membawanya. Yakni karena ucapannya menyalahi yang mereka pegang selama ini, yaitu bahwa mereka ada tanpa Pencipta, demikian pula langit dan bumi ada tanpa ada yang mewujudkannya. Nampaknya mereka tidak berpikir terlebih dahulu sehingga menyimpulkan bahwa langit dan bumi ada dengan sendirinya, demikian pula diri mereka. Tidak usah jauh-jauh untuk membuktikan adanya yang menciptakan langit dan bumi, demikian pula diri mereka; jika ada orang yang datang kepada kita memberitahukan bahwa dia melihat ada sebuah kapal jadi sendiri tanpa ada yang membuatnya, apakah dia menerima berita itu atau tidak? Tentu tidak, dia tidak akan menerimanya, bahkan jika orang yang memberitahukan hal itu bersikap keras dengan mengatakan bahwa kapal itu jadi dengan sendirinya, tentu dia akan mengatakan bahwa orang itu adalah orang gila. Jika hal kapal terwujud dengan sendirinya saja mereka tolak, lalu mengapa mereka menolak adanya Pencipta terhadap langit dan bumi serta diri mereka sendiri. Allah Subhaanahu wa Ta'aala berfirman, “Apakah mereka diciptakan tanpa sesuatu pun ataukah mereka yang menciptakan (diri mereka sendiri)?” (Terj. Ath Thuur: 25)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 27",
    "description": "Fir'aun semakin geram dan marah. Dia yakni fir'aun berkata kepada para pembesar itu dengan penuh kemarahan, 'sungguh, rasulmu yang diutus kepada kamu benar-benar orang gila. ' dia mengatakan sesuatu yang tidak biasa aku dengar. 28. Jawaban ketiga, merupakan jawaban yang telak dan sulit bagi fir'aun untuk mengelaknya. Dia, yakni nabi musa, berkata kepada fir'aun dengan perkataan yang pernah diucapkan juga oleh nabi ibrahim kepada penguasa yang lalim (lihat: al-baqarah/2: 258), 'dialah tuhan yang menguasai ufuk timur tempat terbit matahari dan ufuk barat tempat terbenamnya matahari dan apa yang ada di antara ke-duanya, seperti gunung-gunung, lautan dan lain sebagainya, jika kamu mengerti, dan menggunakan akalmu dengan baik dan benar. ' janganlah kau terus menerus dengan kebatilan, padahal kau tahu kebenaran. Apakah kamu mampu melakukan apa yang dilakukan tuhanku'."
  }
]