[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata, “Tuhan Yang menguasai timur dan barat serta semua yang ada di antara keduanya, berupa cahaya dan kegelapan; ini semua menuntut keharusan beriman kepadaNya semata jika kalian orang-orang yang berakal dan mau merenung!”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Musa berkata, \"Allah yang aku seru kalian kepada agama-Nya adalah Tuhan yang menguasai timur dan barat serta apa yang ada di antara keduanya. Itulah Rabb kalian jika kalian benar-benar memiliki akal yang masih digunakan untuk berpikir.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Musa membantahnya: “Tuhan yang sesungguhnya adalah Tuhan timur yang menerbitkan matahati dari arah timur dan menjadikannya tenggelam di arah barat. Dia Pencipta makhluk-makhluk yang ada di antara timur dan barat; jika kalian memikirkan, tidak ada yang mampu melakukan itu melainkan Allah Tuhan semesta alam.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. قَالَ رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ وَمَا بَيْنَهُمَآ ۖ (Musa berkata: “Tuhan yang menguasai timur dan barat dan apa yang ada di antara keduanya) Nabi Musa tidak menyibukkan diri untuk membantah tuduhan Fir’aun bahwa ia adalah orang gila, namun dengan mengatakan bahwa perubahan-perubahan yang terjadi di alam semesta yang kadang diliputi cahaya dan kadang diliputi kegelapan ini merupakan kuasa Allah. إِن كُنتُمْ تَعْقِلُونَ (jika kamu mempergunakan akal”) Yakni jika kalian termasuk orang yang berakal hai Fir’aun dan pengikutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Musa berkata: “Dia adalah Tuhan yang dapat kalian lihat bukti-bukti kekuasaanNya setiap hari. Dialah Tuhannya arah timur yang memunculkan matahari dan Tuhannya arah barat yang menjadikan matahari terbenam serta Tuhannya seluruh makhluk di antara keduanya jika kalian termasuk orang-orang berakal yang mau berpikir tentang Tuhan alam semesta”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia (Musa) berkata,“Tuhan timur dan barat serta segala yang ada di antara keduanya jika kalian berpikir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28 kemudian Musa berkata dengan nada heran terhadap pengingkaran Fir’aun dan penolakan terhadap Rabb semesta alam, “Rabb yang menguasai timur dan barat dan sesuatu yang ada diantara keduanya” yaitu berupa seluruh makhluk ciptaan, “jika kamu benar-benar mempergunakan akal” sesungguhnya aku telah menyampaikan penjelasan kepada kalian, yang bisa dipahami oleh setiap orang yang memiliki sedikit daya nalar. Lalu kenapa kalian masih tetap saja berpura-pura tidak mengerti terhadap apa yang aku sampaikan kepada kalian? Uraian ini mengandung isyarat dan peringatan bahwa tuduhan gila yang kalian alamatkan kepada Musa sebenarnya adalah penyakit kalian. Kalian telah menuduh manusia yang paling cemerlang akalnya dan paling sempurna ilmunya [dengan tuduhan gila]! Padahal yang benar adalah, kalianlah yang gila, karena akal kalian sudah lenyap disebabkan mengingkari Yang Maha ada, yaitu Pencipta langit dan bumi beserta segala isinya. Lalu kalau kalian mengingkariNya, maka apa yang kalian yakini? Kalau kalian tidak mengetahuiNya, maka apa lagi yang kalian ketahui? Apabila kalian tidak beriman kepadaNya dan kepada ayat-ayatNya, lalu apa lagi selain Allah dan ayat-ayatNya yang kalian yakini? Demi Allah, sesungguhnya orang-orang gila yang sederajat dengan binatang-binatang ternak yang berkeliaran itu masih lebih berpetunjuk daripada kalian!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 28: Dan Musa tetap terus-menerus dalam mendakwahkan kepada fir’aun, serta menegakkan dalil-dalil atas kebathilan seruan-seruan fir’aun, maka Musa menyeru kepada seluruh yang hadir : Allah adalah Tuhan kalian dan Tuhan timur dan barat serta apa yang ada di antara keduanya. Maka renungkanlah jika kalian memiliki akal yang dapat membedakan antara Pencipta dan yang diciptakan, dan akal yang dapat mebedakan Pemelihara dan yang dipelihara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dan menciptakan. Dalam kalimat, “jika kamu mengerti.” Terdapat isyarat bahwa tuduhan gila terhadap Nabi Musa ‘alaihis salam adalah tuduhan yang keji, padahal sesungguhnya merekalah yang gila karena mengingkari keberadaan yang wajib ada, yaitu Pencipta langit dan bumi serta di antara keduanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 28",
    "description": "Jawaban ketiga, merupakan jawaban yang telak dan sulit bagi fir'aun untuk mengelaknya. Dia, yakni nabi musa, berkata kepada fir'aun dengan perkataan yang pernah diucapkan juga oleh nabi ibrahim kepada penguasa yang lalim (lihat: al-baqarah/2: 258), 'dialah tuhan yang menguasai ufuk timur tempat terbit matahari dan ufuk barat tempat terbenamnya matahari dan apa yang ada di antara ke-duanya, seperti gunung-gunung, lautan dan lain sebagainya, jika kamu mengerti, dan menggunakan akalmu dengan baik dan benar. ' janganlah kau terus menerus dengan kebatilan, padahal kau tahu kebenaran. Apakah kamu mampu melakukan apa yang dilakukan tuhanku'29. Fir'aun semakin berang mendengar perkataan nabi musa dan mulai menggunakan kekuatannya, sebagaimana juga penguasa yang lalim, untuk membungkam musuh-Musuh mereka. Dia yaitu fir'aun berkata dengan nada mengancam, 'sungguh, jika engkau menyembah tuhan selain aku, pasti aku masukkan engkau ke dalam penjara. Sebagaimana orang-orang yang telah aku penjarakan. Aku akan siksa dirimu dengan siksaan yang amat pedih. \"."
  }
]