[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada musa untuk mengintimidasi Musa, “Bila kamu menyembah sesembahan selain aku, aku benar-benar akan memenjarakanmu bersama orang-orang yang aku penjarakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Setelah Fir'aun merasa kalah dalam beradu argumen dengan Musa, ia berkata, \"Sungguh, jika engkau menyembah Rabb selain aku, aku benar-benar akan menjadikan engkau salah seorang yang dipenjara.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Setelah Fir’aun kalah berdebat, dia kemudian memakai cara kekerasan dan ancaman: “Hai Musa, sungguh jika kamu mendatangkan Tuhan selain aku maka aku pasti akan memasukkanmu ke dalam penjara.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. قَالَ لَئِنِ اتَّخَذْتَ إِلٰهًا غَيْرِى لَأَجْعَلَنَّكَ مِنَ الْمَسْجُونِينَ (Fir’aun berkata: “Sungguh jika kamu menyembah Tuhan selain aku, benar-benar aku akan menjadikan kamu salah seorang yang dipenjarakan”) Fir’aun yang terlaknat ini kembali menggunakan kekuatannya untuk memaksa Musa agar meninggalkan risalah yang ia bawa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Dengan mengancam, Fir’aun berkata: “Sungguh jika kamu mengambil Tuhan selain aku, maka aku akan menjadikanmu tahanan sampai mati”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia (Fir’aun) berkata,“Sungguh, jika kamu menyembah Tuhan selainku, maka aku benar-benar akan menjadikanmu termasuk orang-orang yang dipenjarakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-33 tatkala argument (hujjah) telah membungkam Fira’un lalu kemampuan dan penjelasannya sudah tidak berdaya menentangnya, maka “dia berkata” untuk mengancam Musa dengan kekuasaanya, ”sungguh jika kamu menyembah tuhan selain aku, benar-benar aku menjadikanmu sebagai salah seorang yang dipenjarakan,” si jahat ini benar-benar telah berambisi kuat untuk menyesatkan Musa, dan akan memaksa Musa agar tidak menjadikan sembahan selain dia. Sebab jika tidak, maka sudah pasti dia beserta para pengikutnya sudah mendapatkan petunjuk perkara (agama) mereka. Maka Musa berkata, “dan apakah (kamu akan melakukan itu) kendatipun aku tunjukan kepadamu sesuatu (keterangan) yang nyata?” Maksudnya, satu tanda yang jelas sekali yang membuktikan kebenaran ajaran yang aku bawa berupa kejadian-kejadian yang luar biasa. “firaun berkata,’Datangkanlah sesuatu (keterangan) yang nyata itu, jika kamu adalah termasuk orang-orang yang benar.’ Maka Musa melemparkan tongkatnya, lalu ntiba-tiba tongkat itu (menjadi) ular,” yaitu ular jantan “yang nyata” maksudnya, yang nampak jelas bagi setiap orang, bukan khayalan dan bukan pula kemiripan. “dan dia menarik tangannya,” dari dalam bajunya, “maka tiba-tiba tangan itu jadi putih bagi norang-orang yang melihatnya,” maksudnya, ia bercahaya sangat besar, tidak memiliki kekurangan sedikitpun bagi siapa saja yang memandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 29: Berkata fir’aun mengancam : Sungguh jika engkau menyembah Tuhan selain dariku dan Rabb selainku, aku akan penjarakan engkau bersama orang-orang yang terpenjara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika hujjah telah mengalahkan Fir’aun dan ia (Fir’aun) tidak sanggup menjawab lagi, maka ia menggunakan kekerasan dan mengancam Nabi Musa ‘alaihis salam. Disebutkan dalam tafsir Al Jalaalain, bahwa penjara Fir’aun sangat keras, yaitu berada di bawah tanah, di mana orang yang dipenjara tidak melihat dan mendengar apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 29",
    "description": "Fir'aun semakin berang mendengar perkataan nabi musa dan mulai menggunakan kekuatannya, sebagaimana juga penguasa yang lalim, untuk membungkam musuh-Musuh mereka. Dia yaitu fir'aun berkata dengan nada mengancam, 'sungguh, jika engkau menyembah tuhan selain aku, pasti aku masukkan engkau ke dalam penjara. Sebagaimana orang-orang yang telah aku penjarakan. Aku akan siksa dirimu dengan siksaan yang amat pedih. \"30. Nabi musa sama sekali tidak gentar dengan ancaman itu, karena yakin Allah selalu bersamanya. Dengan hati yang tenang, nabi musa menawarkan kepada fir'aun satu tawaran. Dia musa berkata, 'apakah engkau tetap akan memenjarakanku sekalipun aku tunjukkan kepadamu sesuatu bukti yang nyata sebagai tanda bahwa aku adalah benar-benar utusan tuhanku'\""
  }
]