[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangkali kamu (wahai Rasul) lantaran besarnya antusiasmu untuk memberi mereka hidayah, akan membinasakan dirimu sendiri, dikarenakan mereka tidak beriman kepadamu dan tidak menjalankan petunjukmu. Maka janganlah kamu melakukan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Boleh jadi engkau -wahai Rasul- akan membinasakan dirimu sendiri lantaran terlalu bersedih dan terlalu bersungguh-sungguh dalam upaya menyampaikan petunjuk pada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Hai Rasulullah, Bisa jadi kami akan membinasakan dirimu sendiri akibat orang-orang kafir yang enggan beriman. Seandainya Kami menghendaki niscaya Kami akan menurunkan ayat yang memaksa mereka beriman dan membuat kepala mereka tertunduk patuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. لَعَلَّكَ بٰخِعٌ نَّفْسَكَ (Boleh jadi kamu (Muhammad) akan membinasakan dirimu) Yakni membunuh dan membinasakan dirimu sendiri. أَلَّا يَكُونُوا۟ مُؤْمِنِينَ(karena mereka tidak beriman) Yakni akibat kesedihan karena kaummu tidak beriman kepada risalah yang kamu bawa. Yang yang dimaksud adalah maka janganlah kamu merasa sedih karena mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Wahai Nabi, boleh jadi kamu menghancurkan dirimu sendiri dengan bersedih dan menyesal karena kaummu tidak beriman pada apa yang kamu bawa. Istifham pada kalimat tersebut adalah istifham inkari yang memberikan makna nahi pada kalimat setelahnya. Ini untuk membahagiakan rasulallah SAW dari kesedihannya yang sangat berat akibat penolakan kaumnya untuk beriman kepada risalahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Boleh jadi kamu akan membinasakan} membunuh {dirimu karena mereka tidak beriman} karena mereka tidak beriman terhadap apa yang kamu bawa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3 maka dari itu Allah berfirman kepada NabiNya, “boleh jadi kamu (Muhammad) akan membinasakan dirimu (dengan kesedihan),” maksudnya, kamu menyengsarakan dan membuat sulit dirimu, “karena mereka tidak beriman,” maka janganlah kamu lakukan dan janganlah kamu menyengsarakan dirimu karena kesedihan terhadap mereka. Sebab hidayah itu ada ditangan Allah, dan kamu telah melaksanakan kewajiban menyampaikan (risalah) sementara tidak ada di luar al-qur’an ini satu pun tanda (mukjizat) untuk kami turunkan agar mereka beriman. Sebab al-qur’an itu sendiri sudah cukup bagi siapa saja yang menghendaki hidayah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 3: Allah menghibur Nabi-Nya ﷺ dengan berkata kepadaya : Janganlah engkau tergesa-gesa atas mereka orang-orang kafir karena sebab mereka tidak beriman kepada Allah dan tidak membenarkan kerisalahanmu serta janganlah engkau bersedih atas mereka, sungguh engkau telah menyampaikan (dari kerisalahanmu)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni membinasakannya dan menyusahkannya. Maksudnya, jangan lakukan hal itu, dan janganlah engkau biarkan dirimu binasa karena kesedihan kepada mereka, karena hidayah di tangan Allah, dan engkau telah menunaikan kewajibanmu yaitu menyampaikan risalah, dan tidak ada lagi ayat (mukjizat) setelah Al Quran yang jelas ini, sehingga Allah perlu menurunkannya agar mereka beriman, karena ia (Al Qur’an) sudah cukup memenuhi kebutuhan orang yang hendak mencari hidayah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 3",
    "description": "Boleh jadi engkau, wahai rasul, akan membinasakan dirimu dengan kesedihan yang mendalam karena mereka penduduk mekah itu tidak mau beriman denganmu, padahal kamu sangat menginginkan mereka untuk beriman. 4. Jika kami menghendaki agar mereka beriman kepadamu, niscaya kami turunkan kepada mereka suatu kejadiaan yang luar biasa, yaitu berupa mukjizat dari langit yang turun kepada mereka yang akan memaksa mereka dan membuat tengkuk mereka tunduk dengan rendah hati kepadanya. Tapi kami tidak menghendaki cara pemaksaan seperti itu. Yang kami inginkan adalah mereka beriman dengan suka rela, tanpa ada satu paksaan apa pun kepada mereka. Karena, iman dengan sukarela akan membuahkan hasil yang baik dan berkelanjutan. Sebaliknya keimanan dengan secara terpaksa, akan menghasilkan sesuatu yang tidak baik pula."
  }
]