[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa menjawab, “Apakah kamu akan menjadikan aku termasuk orang-orang yang dipenjara, meskipun aku membawakan kepadamu satu bukti kuat yang akan memperjelas kebenaranku?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Musa -'alaihissalām- berkata kepadanya, \"Apakah engkau akan tetap memenjarakanku kendatipun aku tunjukkan kepadamu suatu mukjizat yang membuktikan kebenaranku beserta kebenaran wahyu yang aku bawa dari sisi Allah?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Musa membalasnya dengan menampakkan mukjizat: “Apakah kamu tetap akan memenjarakanku jika aku mendatangkan kepadamu bukti kuat yang menunjukkan kebenaranku?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قَالَ أَوَلَوْ جِئْتُكَ بِشَىْءٍ مُّبِينٍ (Musa berkata: “Dan apakah (kamu akan melakukan itu) kendatipun aku tunjukkan kepadamu sesuatu (keterangan) yang nyata?”) Yakni apakah kamu akan tetap memenjarakanku jika aku mendatangkan kepadamu sesuatu yang menunjukkan kebenaran yang aku katakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Musa berkata kepadanya: “Apakah kamu akan menjadikanku tahanan meskipun aku memberimu sesuatu yang menjelaskan tentang kebenaranku dan menguatkan hujjahku?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia (Musa) berkata,“Apakah sekalipun aku mendatangkan kepadamu} apakah kamu tetap melakukan itu kepadaku meskipun aku mendatangkan kepadamu {sesuatu yang jelas”} menjelaskan kebenaran ajakanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-33 tatkala argument (hujjah) telah membungkam Fira’un lalu kemampuan dan penjelasannya sudah tidak berdaya menentangnya, maka “dia berkata” untuk mengancam Musa dengan kekuasaanya, ”sungguh jika kamu menyembah tuhan selain aku, benar-benar aku menjadikanmu sebagai salah seorang yang dipenjarakan,” si jahat ini benar-benar telah berambisi kuat untuk menyesatkan Musa, dan akan memaksa Musa agar tidak menjadikan sembahan selain dia. Sebab jika tidak, maka sudah pasti dia beserta para pengikutnya sudah mendapatkan petunjuk perkara (agama) mereka. Maka Musa berkata, “dan apakah (kamu akan melakukan itu) kendatipun aku tunjukan kepadamu sesuatu (keterangan) yang nyata?” Maksudnya, satu tanda yang jelas sekali yang membuktikan kebenaran ajaran yang aku bawa berupa kejadian-kejadian yang luar biasa. “firaun berkata,’Datangkanlah sesuatu (keterangan) yang nyata itu, jika kamu adalah termasuk orang-orang yang benar.’ Maka Musa melemparkan tongkatnya, lalu ntiba-tiba tongkat itu (menjadi) ular,” yaitu ular jantan “yang nyata” maksudnya, yang nampak jelas bagi setiap orang, bukan khayalan dan bukan pula kemiripan. “dan dia menarik tangannya,” dari dalam bajunya, “maka tiba-tiba tangan itu jadi putih bagi norang-orang yang melihatnya,” maksudnya, ia bercahaya sangat besar, tidak memiliki kekurangan sedikitpun bagi siapa saja yang memandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 30: Maka Musa berkata kepadanya : Apakah engkau tidak melihat jika didatangkan kepada engkau mukjizat yang terang, yang menunjukkan atas kebenaran yang jujur dari kerisalahanku ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni, atas kerasulanku. Ayat atau bukti tersebut adalah mukjizat Beliau yang menunjukkan kebenaran yang Beliau bawa, di mana mukjizat tersebut di luar kebiasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 30",
    "description": "Nabi musa sama sekali tidak gentar dengan ancaman itu, karena yakin Allah selalu bersamanya. Dengan hati yang tenang, nabi musa menawarkan kepada fir'aun satu tawaran. Dia musa berkata, 'apakah engkau tetap akan memenjarakanku sekalipun aku tunjukkan kepadamu sesuatu bukti yang nyata sebagai tanda bahwa aku adalah benar-benar utusan tuhanku'\" 31. Dia, fir'aun, berkata, baiklah kalau begitu. Aku tidak akan memen-jarakanmu, tetapi 'tunjukkan sesuatu bukti yang nyata yang kau janjikan itu, jika engkau termasuk orang yang benar, terhadap peng-akuanmu itu bahwa engkau adalah benar-benar utusan tuhan!\" tidak berselang lama, nabi musa memperlihatkan kepada fir'aun apa yang ditawarkannya, yaitu tongkat yang bisa berubah menjadi ular dan tangan yang mengeluarkan sinar yang berkilauan."
  }
]