[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata, “Bawalah itu kepadaku jika kamu termasuk orang yang benar dalam klaimmu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Fir'aun berkata, \"Datangkanlah mukjizat yang engkau sebutkan sebagai bukti kebenaran dirimu, jika engkau adalah termasuk orang-orang yang benar dalam memberikan klaim.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Fir’aun menantang: “Datangkanlah bukti itu jika kamu benar dalam perkataanmu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. قَالَ فَأْتِ بِهِۦٓ إِن كُنتَ مِنَ الصّٰدِقِينَ (Fir’aun berkata: “Datangkanlah sesuatu (keterangan) yang nyata itu, jika kamu adalah termasuk orang-orang yang benar”) Yakni orang yang benar dalam perkataannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Fir’aun berkata: “Maka datangkanlah bukti yang jelas ini, jika kamu memang orang yang benar hujjahnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia (Fir‘aun) berkata,“Datangkanlah itu jika kamu termasuk orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-33 tatkala argument (hujjah) telah membungkam Fira’un lalu kemampuan dan penjelasannya sudah tidak berdaya menentangnya, maka “dia berkata” untuk mengancam Musa dengan kekuasaanya, ”sungguh jika kamu menyembah tuhan selain aku, benar-benar aku menjadikanmu sebagai salah seorang yang dipenjarakan,” si jahat ini benar-benar telah berambisi kuat untuk menyesatkan Musa, dan akan memaksa Musa agar tidak menjadikan sembahan selain dia. Sebab jika tidak, maka sudah pasti dia beserta para pengikutnya sudah mendapatkan petunjuk perkara (agama) mereka. Maka Musa berkata, “dan apakah (kamu akan melakukan itu) kendatipun aku tunjukan kepadamu sesuatu (keterangan) yang nyata?” Maksudnya, satu tanda yang jelas sekali yang membuktikan kebenaran ajaran yang aku bawa berupa kejadian-kejadian yang luar biasa. “firaun berkata,’Datangkanlah sesuatu (keterangan) yang nyata itu, jika kamu adalah termasuk orang-orang yang benar.’ Maka Musa melemparkan tongkatnya, lalu ntiba-tiba tongkat itu (menjadi) ular,” yaitu ular jantan “yang nyata” maksudnya, yang nampak jelas bagi setiap orang, bukan khayalan dan bukan pula kemiripan. “dan dia menarik tangannya,” dari dalam bajunya, “maka tiba-tiba tangan itu jadi putih bagi norang-orang yang melihatnya,” maksudnya, ia bercahaya sangat besar, tidak memiliki kekurangan sedikitpun bagi siapa saja yang memandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 31: Berkata fir’aun : Jika engkau termasuk orang-orang yang jujur dalam seruanmu, maka tampakkan kepadaku akan klaim darimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 31",
    "description": "Dia, fir'aun, berkata, baiklah kalau begitu. Aku tidak akan memen-jarakanmu, tetapi 'tunjukkan sesuatu bukti yang nyata yang kau janjikan itu, jika engkau termasuk orang yang benar, terhadap peng-akuanmu itu bahwa engkau adalah benar-benar utusan tuhan!\" tidak berselang lama, nabi musa memperlihatkan kepada fir'aun apa yang ditawarkannya, yaitu tongkat yang bisa berubah menjadi ular dan tangan yang mengeluarkan sinar yang berkilauan. 32. Maka dia, yakni musa, melemparkan tongkatnya yang dahulu dia gunakan untuk menggembala kambing di negeri madyan, tiba-tiba tongkat itu atas izin Allah berubah menjadi ular besar yang sebenarnya. Bukan tipuan sebagaimana yang dilakukan oleh para pesihir. Dengan peristiwa ini, Allah mampu mengubah benda mati menjadi benda yang hi-dup. Maka kebangkitan manusia di hari kiamat bukanlah sesuatu yang sulit bagi Allah."
  }
]