[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "32-33. Kemudian Musa melontarkan tongkatnya, lalu berubah menjadi ular yang nyata, bukan suatu tipu daya ilusi sebagaimana yang dilakukan oleh para tukang sihir. Dan dia juga mengeluarkan tangannya dari dalam lubang bajunya yang terbuka sampai ke dada, tiba-tiba menjadi putih seperti salju, bukan karena penyakit kusta, yang membelalakkan pandangan orang-orang yang memandang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dan ia memasukkan tangannya ke dalam bajunya dalam keadaan biasa, lalu menariknya lagi dalam keadaan putih bersinar -bukan putih pucat-. Hal ini juga bisa disaksikan oleh orang-orang yang melihatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Dan mengeluarkan tangannya dari sakunya, seketika tangan itu memiliki cahaya layaknya matahari. Setiap orang yang melihatnya saling berdebat tentang tangannya yang seharusnya terdiri dari kulit, daging dan tulang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang tampak jelas {Dia menarik tangannya} mengeluarkan tangannya dari sakunya {tiba-tiba tangan itu menjadi putih (bercahaya) bagi orang-orang yang melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-33 tatkala argument (hujjah) telah membungkam Fira’un lalu kemampuan dan penjelasannya sudah tidak berdaya menentangnya, maka “dia berkata” untuk mengancam Musa dengan kekuasaanya, ”sungguh jika kamu menyembah tuhan selain aku, benar-benar aku menjadikanmu sebagai salah seorang yang dipenjarakan,” si jahat ini benar-benar telah berambisi kuat untuk menyesatkan Musa, dan akan memaksa Musa agar tidak menjadikan sembahan selain dia. Sebab jika tidak, maka sudah pasti dia beserta para pengikutnya sudah mendapatkan petunjuk perkara (agama) mereka. Maka Musa berkata, “dan apakah (kamu akan melakukan itu) kendatipun aku tunjukan kepadamu sesuatu (keterangan) yang nyata?” Maksudnya, satu tanda yang jelas sekali yang membuktikan kebenaran ajaran yang aku bawa berupa kejadian-kejadian yang luar biasa. “firaun berkata,’Datangkanlah sesuatu (keterangan) yang nyata itu, jika kamu adalah termasuk orang-orang yang benar.’ Maka Musa melemparkan tongkatnya, lalu ntiba-tiba tongkat itu (menjadi) ular,” yaitu ular jantan “yang nyata” maksudnya, yang nampak jelas bagi setiap orang, bukan khayalan dan bukan pula kemiripan. “dan dia menarik tangannya,” dari dalam bajunya, “maka tiba-tiba tangan itu jadi putih bagi norang-orang yang melihatnya,” maksudnya, ia bercahaya sangat besar, tidak memiliki kekurangan sedikitpun bagi siapa saja yang memandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 33: Kemudian Musa memasukkan tangannya di sakunya kemudian mengeluarkannya maka tangannya menjadi putih dan bersinar yang menyebar di kalangan orang-orang yang melihatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 33",
    "description": "-34. Fir'aun mencoba memengaruhi para pembesarnya agar jangan terpengaruh oleh ajakan nabi musa. Dia, fir'aun, berkata kepada para pemuka di sekelilingnya, 'sesungguhnya dia ini pasti seorang pesihir yang sangat pandai, maka janganlah kamu sekalian tertipu olehnya. \"."
  }
]