[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Fir’aun berkata kepada para pemuka kaumnya lantaran takut mereka akan beriman, “Sesungguhnya Musa itu seorang tukang sihir yang lihai. Dengan sihirnya, dia hendak mengeluarkan kalian dari negeri kalian. Maka apakah yang kalian usulkan kepadaku terkait dengan dirinya, niscaya aku akan mengikuti pendapat kalian di dalam masalah itu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Dengan sihirnya ini, ia hendak mengusir kalian dari negeri kalian sendiri; maka apakah yang kalian usulkan untuk menghukum orang ini?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. فَمَاذَا تَأْمُرُونَ (maka karena itu apakah yang kamu anjurkan?”) Yakni apa pendapat kalian untuk menghadapi hal ini? Ia menampakkan kecondongan terhadap pendapat mereka untuk menarik hati mereka, sebab ia menyadari bahwa klaim ketuhanan yang ia katakan hampir hancur. Kalaulah bukan karena hal ini ia tentu sangat angkuh dan tidak akan mau mengatakan kepada mereka perkataan yang mengisyaratkan bahwa ia adalah bagian dari mereka, padahal sebelumnya ia mengklaim bahwa ia adalah tuhan mereka sambil menyebarkan hal ini pada orang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Sesungguhnya Musa ingin mengeluarkan kalian dari tanah Mesir menggunakan sihirnya. Bagaimana pendapat dan pertimbangan kalian tentangnya dan perumpamaan-perumpamaanya yang lebih mendominasi?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia hendak mengeluarkan kalian dari negeri kalian dengan sihirnya. Maka apa yang kalian sarankan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-37 “berkatalah” fir’aun “kepada pembesar-pembesar di sekelilingnya,” sambal menentang kebenaran dan orang yang membawanya, “sesungguhnya Musa ini benar-benar seorang ahli sihir yang pandai, dia hendak mengusir kamu dari negerimu sendiri.” Dia memperdaya mereka karena fir’aun tahu kerendahan akal mereka, bahwa ini (yang diperlihatkan oleh Musa) termasuk drai jenis yang dilakukan oleh para tukang sihir, sebab sudah menjadi suatu ketetapan dikalangan mereka bahwa para tukang sihir itu datang dengan membawa berbagai keanehan yang tidak mampu dilakukan oleh orang awam; dan fir’aun menakut-nakuti mereka bahwa tujuan Musa dengan sihirnya ini adalah agar bisa mengeluarkan mereka dari tanah air mereka, agar mereka bersungguh-sungguh dan berupaya maksimal dalam memusuhi orang yang hendak mengusir dan menjauhkan mereka dari anak-anak dan kampung halaman mereka. “maka karena itu, apakah yang kamu anjurkan,” untuk kita lakukan? “mereka menjawab, ’tundalah (urusan) dia dan saudaranya,” maksudnya, tangguhkanlah keduanya, “dan kirimkanlah ke seluruh negeri orang-orang yang akan mengumpulkan,” maksudnya, orang-orang yang mengumpulkan masyarakat, sehingga mereka datang [dalam keadaan berkumpul] “bersama semua ahli sihir yang pandai,” maksudnya, kirimlah ke seluruh kota (yang merupakan pusat-pusat ilmu dan kantong-kantong para tukang sihir) orang yang mengumpulkan setiap tukang sihir yang mahir lagi menguasai sihirnya, sebab tukang sihir harus dihadapi dengan Sihir yang sejenis dengan sihirnya. Ini merupakann sebagian dari kelembutan Allah, yaitu Dia memperlihatkan kepada hamba-hambaNya kepalsuan sesuatu yang diperdayakan oleh Fir’aun jahil nan sesat lagi menyesatkan ini, yaitu tuduhannya bahwa sesuatu yang dibawa oleh Musa itu adalah sihir. Allah menakdirkan mereka untuk menghimpun tukang-tukang sihir kawakan agar terlaksana suatu majelis (pertemuan) di hadapan masyarakat yang berjumlah banyak sehingga kebenaran tampak mengungguli kebatilan, dan pada gilirannya orang-orang yang berilmu dan orang-orang ahli sihir mengakui kebenaran ajaran yang dibawa oleh Musa, dan bahwa dia bukan tukang sihir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 35: Kemudian fir’aun juga berkata : Sungguh dia (Musa) menginginkan dengan sihirnya mengeluarkan kalian dari negeri-negeri kalian, yaitu dari keyakinan-keyakinan kalian, lalu apa yang akan kalian perbuat setelah kalian melihat tingkahnya ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Fir’aun mengelabui mereka karena dia tahu lemahnya akal mereka, ia menggambarkan kepada mereka bahwa yang ditunjukkan Musa ‘alaihis salam sama seperti yang dibawa para pesihir, karena sudah menjadi maklum oleh mereka bahwa yang membawakan hal-hal yang aneh adalah para pesihir. Dia (Fir’aun) juga menakut-nakuti mereka, bahwa maksud Nabi Musa ‘alaihis salam dengan menunjukkan mukjizat itu adalah untuk mengusir mereka dari negeri mereka, agar mereka berusaha bersama dengan Fir’aun menentang orang yang hendak mengusir mereka itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 35",
    "description": "Dia hendak mengusir kamu dari negerimu yang subur makmur ini, di mana kamu hidup enak dan tenang di dalamnya, dengan ilmu sihirnya; karena itu apakah yang kamu sarankan kepadaku sehingga aku bisa melaksanakannya'' fir'aun merasa terdesak sehingga meminta pertimbangan dari para pembesarnya. Pengusiran seorang dari negerinya adalah sebuah prahara kehidupan, karena mereka harus meninggalkan apa yang mereka cintai. Fir'aun menggunakan taktik ini agar mereka merasa tersentak dan akhirnya melawan nabi musa. 36-37. Para pembesar itu menawarkan kepada fir'aun agar diadakan perang tanding antara nabi musa dan para pesihir mesir. Mereka menjawab, 'tahanlah untuk sementara, jangan kau bunuh dia yaitu musa dan saudaranya yaitu nabi harun, dan utuslah ke seluruh negeri mesir orang-orang yang akan mengumpulkan pesihir, niscaya mereka akan mendatangkan semua pesihir yang pandai kepadamu. '."
  }
]