[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-37. Kaumnya berkata kepadanya, “Kesampingkanlah urusan Musa dan Harun terlebih dahulu, dan utuslah tentara-tentara ke berbagai negeri untuk mengumpulkan para ahli sihir. Mereka akan membawakan kepadamu orang-orang yang cakap dalam ilmu sihir dan unggul dalam menguasainya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Mereka menjawab ucapan Fir'aun, \"Tundalah urusan dia dan saudaranya, dan janganlah tergesa-gesa menghukum mereka berdua, serta kirimkanlah orang-orang ke seluruh pelosok negeri Mesir untuk mengumpulkan ahli sihir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Maka mereka mengusulkan agar Musa dan Harun dipenjara, atau ditunda pertemuan dengannya ke lain waktu kemudian mengutus orang-orang yang dapat mengumpulkan para penyihir hebat yang ada di negeri Mesir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. قَالُوٓا۟ أَرْجِهْ وَأَخَاهُ (Mereka menjawab: “Tundalah (urusan) dia dan saudaranya) Yakni tundalah urusan mereka berdua. وَابْعَثْ فِى الْمَدَآئِنِ حٰشِرِينَ (dan kirimkanlah ke seluruh negeri orang-orang yang akan mengumpulkan (ahli sihir)) Mereka adalah para pasukan yang bertugas mengumpulkan orang-orang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Para pembesar dan pemmpin itu berkata: “Tangguhkanlah urusannya dan saudaranya lalu utuslah pasukan ke seluruh pelosok negeri untuk mengumpulkan penyihir”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Tahanlah dia} tangguhkanlah dia {dan saudaranya serta utuslah ke kota-kota} kota-kota dan daerah-daerah Mesir {orang-orang yang akan mengumpulkan (penyihir)} orang-orang yang mengumpulkan para penyihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-37 “berkatalah” fir’aun “kepada pembesar-pembesar di sekelilingnya,” sambal menentang kebenaran dan orang yang membawanya, “sesungguhnya Musa ini benar-benar seorang ahli sihir yang pandai, dia hendak mengusir kamu dari negerimu sendiri.” Dia memperdaya mereka karena fir’aun tahu kerendahan akal mereka, bahwa ini (yang diperlihatkan oleh Musa) termasuk drai jenis yang dilakukan oleh para tukang sihir, sebab sudah menjadi suatu ketetapan dikalangan mereka bahwa para tukang sihir itu datang dengan membawa berbagai keanehan yang tidak mampu dilakukan oleh orang awam; dan fir’aun menakut-nakuti mereka bahwa tujuan Musa dengan sihirnya ini adalah agar bisa mengeluarkan mereka dari tanah air mereka, agar mereka bersungguh-sungguh dan berupaya maksimal dalam memusuhi orang yang hendak mengusir dan menjauhkan mereka dari anak-anak dan kampung halaman mereka. “maka karena itu, apakah yang kamu anjurkan,” untuk kita lakukan? “mereka menjawab, ’tundalah (urusan) dia dan saudaranya,” maksudnya, tangguhkanlah keduanya, “dan kirimkanlah ke seluruh negeri orang-orang yang akan mengumpulkan,” maksudnya, orang-orang yang mengumpulkan masyarakat, sehingga mereka datang [dalam keadaan berkumpul] “bersama semua ahli sihir yang pandai,” maksudnya, kirimlah ke seluruh kota (yang merupakan pusat-pusat ilmu dan kantong-kantong para tukang sihir) orang yang mengumpulkan setiap tukang sihir yang mahir lagi menguasai sihirnya, sebab tukang sihir harus dihadapi dengan Sihir yang sejenis dengan sihirnya. Ini merupakann sebagian dari kelembutan Allah, yaitu Dia memperlihatkan kepada hamba-hambaNya kepalsuan sesuatu yang diperdayakan oleh Fir’aun jahil nan sesat lagi menyesatkan ini, yaitu tuduhannya bahwa sesuatu yang dibawa oleh Musa itu adalah sihir. Allah menakdirkan mereka untuk menghimpun tukang-tukang sihir kawakan agar terlaksana suatu majelis (pertemuan) di hadapan masyarakat yang berjumlah banyak sehingga kebenaran tampak mengungguli kebatilan, dan pada gilirannya orang-orang yang berilmu dan orang-orang ahli sihir mengakui kebenaran ajaran yang dibawa oleh Musa, dan bahwa dia bukan tukang sihir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 36: Berkata kaum fir’aun : Kami memandang agar membunuh Musa dan Harun dan agar engkau menyuruh tentaramu supaya mengumpulkan ahli-ahli sihir di seluruh kerajaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni para tentara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 36",
    "description": "36-37. Para pembesar itu menawarkan kepada fir'aun agar diadakan perang tanding antara nabi musa dan para pesihir mesir. Mereka menjawab, 'tahanlah untuk sementara, jangan kau bunuh dia yaitu musa dan saudaranya yaitu nabi harun, dan utuslah ke seluruh negeri mesir orang-orang yang akan mengumpulkan pesihir, niscaya mereka akan mendatangkan semua pesihir yang pandai kepadamu. '36-37"
  }
]