[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Lalu dikumpulkanlah para ahli sihir, dan ditetapkan bagi mereka waktu tertentu, yaitu waktu pagi dhuha pada hari yang meriah yang mana mereka meluangkan waktu dari kesibukan-kesibukan pada hari itu, berkumpul dan berpenampilan menarik. Itu tujuannya adalah untuk acara perjumpaan dengan Musa, dan orang-orang didorong agar ikut berkumpul dengan harapan kemenangan menjadi milik para tukang sihir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Lalu Fir'aun mengumpulkan ahli-ahli sihirnya untuk bertanding melawan Musa pada waktu dan tempat yang telah ditentukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-39. Maka Fir’aun mengumpulkan para penyihir pada awal siang di hari raya ketika mereka berhias karena kedatangan banyak orang yang telah dia minta untuk berkumpul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. فَجُمِعَ السَّحَرَةُ لِمِيقٰتِ يَوْمٍ مَّعْلُومٍ (Lalu dikumpulkan ahli-ahli sihir pada waktu yang ditetapkan di hari yang ditentukan itu) Yakni waktu mereka berhias, yaitu hari raya mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Lalu para penyihir dikumpulkan di waktu yang telah ditentukan yaitu hari yang penuh hiasan, hari raya bagi mereka di waktu dhuha. Al-miqat adalah waktu tertentu untuk mengerjakan sesuatu tertentu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka dikumpulkanlah para penyihir pada waktu yang ditetapkan di hari yang telah ditentukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40 kemudian fir’aun melaksanakan usulan orang-orang terdekatnya, dan diapun mengirim orang-orang keseluruh pelosok negeri untuk menghimpun para tukang sihir kawakan, dan dia benar-benar serius dalam hal ini. “lalu dikumpulkanlah orang-orang yang ahli sihir pada waktu yang ditetapkan pada hari yang ditentukan,” yang telah dijanjikan oleh Musa kepada mereka. yaitu hari santai (libur) di mana mereka libur dari semua aktivitas. “dan dikatakan kepada orang banyak, ‘berkumpullah kamu sekalian’,” maksudnya, diumumkan kepada seluruh masyarakat agar berkumpul pada hari yang telah ditentukan itu, ”semoga kita mengikuti ahli-ahli sihir jika mereka adalah orang-orang yang menang.” Maksudnya, mereka berkata kepada semua orang, ”berkumpullah kalian agar kalian bisa melihat kemenangan para tukang sihir melawan Musa, dan bahwa mereka adalah ahli sihir yang piawai, kemudian kita mengikuti mereka, menghormat mereka dan mengetahui keutamaan ilmu sihir,” Kalau saja mereka diberi petunjuk, tentu mereka akan mengatakan,”semoga kita dapat mengikuti siapa yang benar dari mereka dan kita mengetahui yang benar,” maka dari itu peristiwa ini sama sekali tidak berguna bagi mereka kecuali tegaknya hujjah atas mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 38: Kemudian Allah mengabarkan bahwa berkumpullah para penyihir seantero kerajaan dengan Musa pada hari Ied (hari berhias) mereka yang para manusia pada saat itu libur dari bekerja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu di waktu pagi di hari yang dirayakan, di mana pada hari itu mereka berhenti dari kesibukannya, berkumpul dan berhias."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 38",
    "description": "Lalu dikumpulkanlah para pesihir pada waktu yang ditetapkan, yaitu waktu pagi pada hari yang telah ditentukan, yaitu pada hari raya mereka, di mana mereka berhias diri untuk bersenang-senang (lihat: surah thaha/20: 59)39. Dan diumumkan kepada orang banyak untuk segera berkumpul menyaksikan pertandingan yang sangat menentukan nasib para petarung, apakah nabi musa atau para pesihir itu. 'berkumpullah kamu semua, jangan ada di antara kamu yang tertinggal."
  }
]