[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Lalu dikumpulkanlah para ahli sihir, dan ditetapkan bagi mereka waktu tertentu, yaitu waktu pagi dhuha pada hari yang meriah yang mana mereka meluangkan waktu dari kesibukan-kesibukan pada hari itu, berkumpul dan berpenampilan menarik. Itu tujuannya adalah untuk acara perjumpaan dengan Musa, dan orang-orang didorong agar ikut berkumpul dengan harapan kemenangan menjadi milik para tukang sihir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Lalu diserukan kepada orang banyak, \"Apakah kalian sudah berkumpul untuk menyaksikan siapa yang menang; Musa atau para ahli sihir itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَقِيلَ لِلنَّاسِ هَلْ أَنتُم مُّجْتَمِعُونَ (dan dikatakan kepada orang banyak: “Berkumpullah kamu sekalian) Ini merupakan dorongan bagi mereka agar ikut berkumpul untuk menyaksikan pertarungan antara Musa dengan para penyihir dan menyaksikan siapa yang akan menang. Hal ini karena keyakinan bahwa Fir’aun akan menang dan berharap hal itu terjadi di hadapan orang banyak sehingga tidak ada seorangpun yang akan beriman kepada Musa secara sembunyi-sembunyi. Namun berkumpulnya mereka juga sesuai dengan harapan Musa, sebab ia yakin mukjizat Allah yang akan menang dan kekuatan orang-orang kafir akan kalah. Ini merupakan rencana Allah agar dakwah Musa dapat terkenal dan diketahui oleh penduduk Mesir dan Bani Israil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Dan dikatakan pada penduduk Mesir: “Untuk apa kalian dikumpulkan saat ini?”. Itu adalah motivasi bagi mereka untuk berkumpul, seakan-akan dia (Fir’aun) berkata: “Berkumpullah kalian supaya kalian bisa menyaksikan pertarungan antara Musa dan para penyihir. Dan siapakah yang lebih unggul?”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu diumumkan kepada orang banyak,“Apakah kalian semua sudah berkumpul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40 kemudian fir’aun melaksanakan usulan orang-orang terdekatnya, dan diapun mengirim orang-orang keseluruh pelosok negeri untuk menghimpun para tukang sihir kawakan, dan dia benar-benar serius dalam hal ini. “lalu dikumpulkanlah orang-orang yang ahli sihir pada waktu yang ditetapkan pada hari yang ditentukan,” yang telah dijanjikan oleh Musa kepada mereka. yaitu hari santai (libur) di mana mereka libur dari semua aktivitas. “dan dikatakan kepada orang banyak, ‘berkumpullah kamu sekalian’,” maksudnya, diumumkan kepada seluruh masyarakat agar berkumpul pada hari yang telah ditentukan itu, ”semoga kita mengikuti ahli-ahli sihir jika mereka adalah orang-orang yang menang.” Maksudnya, mereka berkata kepada semua orang, ”berkumpullah kalian agar kalian bisa melihat kemenangan para tukang sihir melawan Musa, dan bahwa mereka adalah ahli sihir yang piawai, kemudian kita mengikuti mereka, menghormat mereka dan mengetahui keutamaan ilmu sihir,” Kalau saja mereka diberi petunjuk, tentu mereka akan mengatakan,”semoga kita dapat mengikuti siapa yang benar dari mereka dan kita mengetahui yang benar,” maka dari itu peristiwa ini sama sekali tidak berguna bagi mereka kecuali tegaknya hujjah atas mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 39: Kemudian bahwasanya fir’aun dan kaumya menyeru manusia agar mendatangi dan dan hadir atas hari yang sebagai saksi tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 39",
    "description": "Dan diumumkan kepada orang banyak untuk segera berkumpul menyaksikan pertandingan yang sangat menentukan nasib para petarung, apakah nabi musa atau para pesihir itu. 'berkumpullah kamu semua, jangan ada di antara kamu yang tertinggal. 40. \"tujuannya adalah agar kita mengikuti para pesihir itu, jika mereka yang menang dalam perang tanding ini. \" untuk mengalahkan nabi musa, ternyata fir'aun yang mengaku-ngaku sebagai tuhan, masih menggunakan orang lain, seperti pesihir, bukan kekuatan dirinya."
  }
]