[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika Kami menghendaki, niscaya Kami akan menurunkan kepada orang-orang yang mendustakan dari kaummu itu dari langit satu mukjizat yang menakutkan mereka yang akan memaksa mereka untuk beriman, sehingga leher-leher mereka tunduk dan merendah. Akan tetapi, Kami tidak menghendaki hal tersebut. Sebab, sesungguhnya keimanan yang bermanfaat adalah keimanan terhadap perkara ghaib dengan sukarela."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Jika Kami berkehendak menurunkan tanda-tanda kebesaran (mukjizat) Kami dari langit kepada mereka, niscaya Kami akan melakukannya, sehingga kuduk-kuduk mereka senantiasa tunduk terhina kepadanya. Namun Kami tidak menghendaki demikian sebagai ujian bagi mereka; apakah mereka benar-benar akan beriman dengan perkara gaib?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِن نَّشَأْ نُنَزِّلْ عَلَيْهِم مِّنَ السَّمَآءِ ءَايَةً (Jika kami kehendaki niscaya Kami menurunkan kepada mereka mukjizat dari langit) Yakni mukjizat yang membuat mereka beriman. فَظَلَّتْ أَعْنٰقُهُمْ لَهَا خٰضِعِينَ(maka senantiasa kuduk-kuduk mereka tunduk kepadanya) Yakni mereka menjadi tunduk kepada mukjizat itu dengan terpaksa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Jika berkehendak, niscaya akan Kami turunkan atas orang-orang kafir dari kaummu suatu mukjizat dari langit yang memaksa mereka untuk beriman sehingga leher-leher pemiliknya tunduk. Golongan mereka pasti tunduk kepadanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika berkehendak, niscaya Kami menurunkan bukti kepada mereka dari langit sehingga tengkuk mereka selalu} selalu {tunduk kepadanya} tunduk dan merendah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4 oleh karenanya, Dia berfirman, ”jika kami menghendaki niscaya Kami menurunkan kepada mereka satu mukjizat drai langit,” maksudnya satu dari tanda-tanda yang mereka minta, “maka senantiasa kuduk-kuduk mereka,” maksudnya, leher para pendusta “tunduk kepadanya,” akan tetapi hal itu tidak perlu dan tidak ada maslahatnya, sebab pada waktu itu iman sudah tidak berguna lagi. Sebab, iman yang berguna itu adalah iman kepada yang ghaib, sebagimana Allah berfirman, ”yang mereka nanti-nanti tidak lain hanyalah kedatangan malaikat kepada mereka (untuk mencabut nyawa mereka), atau kedatangan Rabbmu atau kedatangan sebagian tanda-tanda Rabbmu. Pada hari datangnya sebagian tanda-tanda Rabbmu tidaklah bermanfaat lagi iman seseorang bagi dirinya sendiri yang belum beriman sebelum itu, atau dia (belum) mengusahakan kebaikan dalam masa imannya. Katakanlah, ‘tunggulah olehmu, sesungguhnya kami pun menunggu (pula)’.” (al-an’am:158)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 4: Allah mengabarkan kepada Nabi-Nya ﷺ bahwasanya sekiranya Allah ingin menundukkan dan memaksa mereka agar beriman, maka tiadalah mukjizat dari langit yang nampak kepada mereka, menjadikan mereka tunduk dan sungguh mereka akan beramal sebagaimana amalan bani israil, akan tetapi hikmah Allah terkandung bahwasanya tidaklah masuk islam kecuali segolongan orang yang terpilih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang mereka usulkan. Akan tetapi hal itu tidak perlu dan tidak ada maslahatnya, karena ketika itu iman tidaklah bermanfaat, karena iman hanyalah bermanfaat jika kepada yang masih ghaib (tidak nampak)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 4",
    "description": "Jika kami menghendaki agar mereka beriman kepadamu, niscaya kami turunkan kepada mereka suatu kejadiaan yang luar biasa, yaitu berupa mukjizat dari langit yang turun kepada mereka yang akan memaksa mereka dan membuat tengkuk mereka tunduk dengan rendah hati kepadanya. Tapi kami tidak menghendaki cara pemaksaan seperti itu. Yang kami inginkan adalah mereka beriman dengan suka rela, tanpa ada satu paksaan apa pun kepada mereka. Karena, iman dengan sukarela akan membuahkan hasil yang baik dan berkelanjutan. Sebaliknya keimanan dengan secara terpaksa, akan menghasilkan sesuatu yang tidak baik pula. 5. Dan setiap kali disampaikan kepada mereka suatu peringatan baru yakni ayat-ayat Al-Qur'an yang diturunkan dari tuhan yang maha pengasih, mereka selalu berpaling darinya. Mereka tidak mau mendengarkan, tidak mau memedulikannya, bahkan menertawakannya."
  }
]