[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami amat berharap kemenangan ada ditangan tukung-tukang sihir, sehingga kami akan teguh di atas keyakinan kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Dengan harapan agar kita semua mengikuti agama para penyihir itu jika mereka menang menghadapi Musa.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Dia memberi harapan kepada orang-orang yang hadir bahwa kemenangan akan diraih oleh para penyihirnya, agar orang-orang itu dapat mengikuti agama para penyihir tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. لَعَلَّنَا نَتَّبِعُ السَّحَرَةَ (semoga kita mengikuti ahli-ahli sihir) Yakni mengikuti agama mereka. إِن كَانُوا۟ هُمُ الْغٰلِبِينَ (jika mereka adalah orang-orang yang menang”) Mereka menganggap kaum mereka tidak memihak kepada salah satu pihak sebagai bentuk penghinaan terhadap akal mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Salah seorang dari mereka berkata: “Barangkali kami, penduduk Mesir bisa mengikuti agama para ahli sihir itu jika dia menang atas Musa”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Supaya kita mengikuti para penyihir itu jika mereka jadi para pemenang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40 kemudian fir’aun melaksanakan usulan orang-orang terdekatnya, dan diapun mengirim orang-orang keseluruh pelosok negeri untuk menghimpun para tukang sihir kawakan, dan dia benar-benar serius dalam hal ini. “lalu dikumpulkanlah orang-orang yang ahli sihir pada waktu yang ditetapkan pada hari yang ditentukan,” yang telah dijanjikan oleh Musa kepada mereka. yaitu hari santai (libur) di mana mereka libur dari semua aktivitas. “dan dikatakan kepada orang banyak, ‘berkumpullah kamu sekalian’,” maksudnya, diumumkan kepada seluruh masyarakat agar berkumpul pada hari yang telah ditentukan itu, ”semoga kita mengikuti ahli-ahli sihir jika mereka adalah orang-orang yang menang.” Maksudnya, mereka berkata kepada semua orang, ”berkumpullah kalian agar kalian bisa melihat kemenangan para tukang sihir melawan Musa, dan bahwa mereka adalah ahli sihir yang piawai, kemudian kita mengikuti mereka, menghormat mereka dan mengetahui keutamaan ilmu sihir,” Kalau saja mereka diberi petunjuk, tentu mereka akan mengatakan,”semoga kita dapat mengikuti siapa yang benar dari mereka dan kita mengetahui yang benar,” maka dari itu peristiwa ini sama sekali tidak berguna bagi mereka kecuali tegaknya hujjah atas mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 40: Dikatakan kepada manusia : Bergegaslah menjadi saksi dan hadir menyaksikan suatu (urusan) besar, kalian akan menjadi saksi dikalahkannya sihir Musa maka tetaplah di atas agama kalian. Dan mereka (justru) tidak mengatakan : Semoga saja kami mengikuti yang takluk. Menjadi bukti bahwa mereka telah menolak dakwah (Musa)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya adalah bahwa mereka mengharapkan para pesihir itulah yang akan menang agar mereka tetap di atas agama mereka dan tidak mengikuti Musa. Jika mereka ingin mencari kebenaran, tentunya mereka mengatakan, “Agar kita mengikuti yang hak di antara mereka,” oleh karena itulah ketika Nabi Musa ‘alaihis salam yang menang, mereka tetap saja tidak mengikuti, dan hanya penegakkan hujjah saja atas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 40",
    "description": "\"tujuannya adalah agar kita mengikuti para pesihir itu, jika mereka yang menang dalam perang tanding ini. \" untuk mengalahkan nabi musa, ternyata fir'aun yang mengaku-ngaku sebagai tuhan, masih menggunakan orang lain, seperti pesihir, bukan kekuatan dirinya. 41. Maka ketika para pesihir datang, mereka berkata kepada fir'aun, untuk meminta janji imbalan, 'apakah kami benar-benar akan mendapat imbalan yang besar jika kami yang menang melawan musa'\" demikianlah para pesihir bersedia membela fir'aun bukan karena mempertahankan kebenaran tapi menginginkan imbalan yang besar."
  }
]