[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka tatkala ahli-ahli sihir itu datang kepada Fir’aun, mereka berkata kepadanya, “Apakah sesungguhnya kami akan mendapatkan bayaran berupa materi atau kedudukan, bila kami menang melawan Musa?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Maka tatkala para penyihir datang kepada Fir'aun untuk bertanding melawan Musa, merekapun bertanya kepada Fir'aun, \"Apakah kami akan mendapat upah materiil ataupun moril jika kami menang atas Musa?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Ketika para penyihir menghadap Fir’aun, mereka berkata kepadanya: “Apakah kami akan mendapat upah yang besar jika kami dapat mengalahkan Musa dengan sihir kami?” Fir’aun sepakat dan menyemangati mereka: “Iya, kalian akan mendapatkan itu dan lebih dari itu kalian akan menjadi orang-oarng terdekatku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. فَلَمَّا جَآءَ السَّحَرَةُ قَالُوا۟ لِفِرْعَوْنَ أَئِنَّ لَنَا لَأَجْرًا (Maka tatkala ahli-ahli sihir datang, merekapun bertanya kepada Fir’aun: “Apakah kami sungguh-sungguh mendapat upah yang besar) Yakni balasan bagi kami berupa harta atau kedudukan. إِن كُنَّا نَحْنُ الْغٰلِبِينَ(jika kami adalah orang-orang yang menang?”) Maka Fir’aun menyetujui hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Ketika para ahli sihir itu datang pada waktu yang telah ditentukan, mereka berkata kepada Fir’aun: “Apakah ada imbalan materi berupa harta benda atau imbalan moral seperti kemuliaan bagi kami jika menang atas Musa?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika para penyihir datang, mereka berkata kepada Fir‘aun,“Apakah kami benar-benar akan memperoleh imbalan besar jika kami yang menjadi pemenang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42 “maka tatkala ahli-ahli sihir datang,” dan tiba di hadapan fir’aun, mereka berkata kepadanya, ”apakah kami sungguh-sungguh mendapat upah yang besar jika kami adalah orang-orang yang menang?” maksudnya, menang dalam melawan Musa. “fir’aun menjawab, ’ya’.” Kalian akan memperoleh upah dan imabalan, dan kalian benar-benar akan menjadi orang yang didekatkan krepadaku. Fir’aun menjanjikan kepada mereka imbalan dan kedekatan dengannya agar mereka makin giat dan mengeluarkan seluruh kemampuan yang mereka miliki dalam melawan sesuatu yang akan ditimpakan oleh Musa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 41: 41-42. Ketika telah sampai para penyihir kepada fir’aun, mereka berkata kepadanya : Apakah kami dibayar dan diberikan kedudukan jika kami dapat mengalahkan Musa ? Maka fir’aun menjawab mereka : Betul, kalian mendapatkan semua itu serta tambahan atas permintaan kalian, yaitu kalian akan mendapatkan kedudukan yang dekat di sisiku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti harta dan kedudukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 41",
    "description": "Maka ketika para pesihir datang, mereka berkata kepada fir'aun, untuk meminta janji imbalan, 'apakah kami benar-benar akan mendapat imbalan yang besar jika kami yang menang melawan musa'\" demikianlah para pesihir bersedia membela fir'aun bukan karena mempertahankan kebenaran tapi menginginkan imbalan yang besar. 42. Dia, fir'aun, menjawab, 'ya, kalian akan mendapatkan imbalan yang besar dan bahkan di samping itu, kamu pasti akan mendapat kedudukan yang dekat kepadaku, dengan kedudukan itu kamu pasti akan mendapatkan fasilitas-fsilitas terbaik dariku. \"."
  }
]