[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun menjawab, “Betul, bagi kalian imbalan apa saja yang kalian minta dariku. Dan sesungguhnya kalian akan termasuk orang-orang dekat denganku pada waktu itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Fir'aun berkata kepada mereka, \"Ya, kalian pasti mendapatkan upah. Sesungguhnya jika kalian menang, niscaya kalian akan menjadi orang-orang terdekatku dengan menduduki jabatan-jabatan tinggi.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. قَالَ نَعَمْ وَإِنَّكُمْ إِذًا لَّمِنَ الْمُقَرَّبِينَ (Fir’aun menjawab: “Ya, kalau demikian, sesungguhnya kamu sekalian benar-benar akan menjadi orang yang didekatkan (kepadaku)”) Yakni: “Benar, bagi kalian apa yang kalian minta dan selain itu kalian akan menjadi orang-orang terdekatku.” Fir’aun menggoda mereka dengan kedudukan dan jabatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Fir’aun berkata: “Ya, kalian akan mendapat balasan yang sesuai dengan keinginan kalian. Dan jika kalian menang atas Musa, maka kalian termasuk orang-orang yang dekat denganku di kedudukan yang berbeda.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia (Fir‘aun) menjawab,“Ya. bahkan kalian pasti menjadi orang-orang yang dekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42 “maka tatkala ahli-ahli sihir datang,” dan tiba di hadapan fir’aun, mereka berkata kepadanya, ”apakah kami sungguh-sungguh mendapat upah yang besar jika kami adalah orang-orang yang menang?” maksudnya, menang dalam melawan Musa. “fir’aun menjawab, ’ya’.” Kalian akan memperoleh upah dan imabalan, dan kalian benar-benar akan menjadi orang yang didekatkan krepadaku. Fir’aun menjanjikan kepada mereka imbalan dan kedekatan dengannya agar mereka makin giat dan mengeluarkan seluruh kemampuan yang mereka miliki dalam melawan sesuatu yang akan ditimpakan oleh Musa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 42: 41-42. Ketika telah sampai para penyihir kepada fir’aun, mereka berkata kepadanya : Apakah kami dibayar dan diberikan kedudukan jika kami dapat mengalahkan Musa ? Maka fir’aun menjawab mereka : Betul, kalian mendapatkan semua itu serta tambahan atas permintaan kalian, yaitu kalian akan mendapatkan kedudukan yang dekat di sisiku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Fir’aun menjanjikan imbalan dan kedudukan yang dekat untuk mereka agar mereka semakin semangat dan mengerahkan semua kemampuannya untuk mengalahkan Nabi Musa ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 42",
    "description": "Dia, fir'aun, menjawab, 'ya, kalian akan mendapatkan imbalan yang besar dan bahkan di samping itu, kamu pasti akan mendapat kedudukan yang dekat kepadaku, dengan kedudukan itu kamu pasti akan mendapatkan fasilitas-fsilitas terbaik dariku. \"43. Para pesihir mempersilakan nabi musa memperlihatkan kehebatannya terlebih dahulu (lihat: surah al-a'r'f/7: 115). Namun sebelumnya nabi musa mengingatkan mereka agar tidak meneruskan perang tanding ini karena mereka pasti kalah (lihat: surah ''ha:61). Namun mereka tetap dengan pendirian mereka. Perang tanding pun dimulai. Dia, musa, berkata kepada mereka para pesihir itu, \"sekarang aku berikan kesempatan kepada kalian, lemparkanlah apa yang hendak kamu lemparkan, agar nanti bisa terlihat mana yang benar dan mana yang batil. \" lain halnya jika nabi musa terlebih dahulu yang beraksi."
  }
]