[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada para ahli sihir untuk mematahkan sihir mereka dan menampakkan bahwa apa yang ia bawa bukanlah praktek sihir, “Lemparkanlah apa yang kalian hendak lemparkan dari kekuatan sihir.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dengan penuh percaya diri terhadap pertolongan Allah, Musa berkata kepada mereka untuk menjelaskan bahwa apa yang ia bawa bukanlah sihir, \"Lemparkanlah apa yang hendak kalian lemparkan berupa tali-temali dan tongkat-tongkat yang kalian pegang.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Musa berkata kepada mereka: “Lemparlah sihir yang ingin kalian tunjukkan.” Setelah para penyihir itu memberi pilihan kepadanya apakah dia yang akan memulai atau mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. قَالَ لَهُم مُّوسَىٰٓ أَلْقُوا۟ مَآ أَنتُم مُّلْقُونَ (Berkatalah Musa kepada mereka: “Lemparkanlah apa yang hendak kamu lemparkan”) Musa ingin mengalahkan mereka dengan mukjizat dan menunjukkan kepada mereka bahwa yang ia datangkan bukanlah seperti yang hendak mereka lawan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Setelah para ahli sihir itu memilihkan siapa yang melempar pertama dan terakhir, Musa berkata kepada mereka: “Lemparlah sesuatu yang hendak kalian lemparkan!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata kepada mereka,“Lemparkanlah apa yang hendak kalian lemparkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-45 ketika mereka semua berkumpul pada hari yang telah ditentukan, berikut Musa dan seluruh masyarakat negeri Mesir, maka Musa menasihati serta mengingatkan mereka seraya berkata, ”celakalah kamu, janganlah kamu mengadakan kedustaan atas Nama Allah, sehingga Dia Membinasakan kamu dengan siksa. Dan sungguh telah merugi orang yang mengada-adakan kedustaan.”(thaha:61) Lalu mereka berselisih dan berbantah-bantahan, kemudian Fir’aun memberi mereka semangat keberanian dan sebagian drai mereka memberi semangat kepada sebagian yang lain. “Musa berkata kepada mereka,’lemparkanlah sesuatu yang hendak kamu lemparkan’.” Maksudnya, lemparkanlah segala sesuatu yang ada di dalam benak kalian akan dilemparkan. Musa sama seklai tidak mengecualikan apa pun, karena keyakinannya akan kebatilan sesuatu yang mereka hadirkan untuk menentang kebenaran. “lalu mereka melemparkan tali-temali dan tongkat-tongkat mereka; dan dengan sereta-merta semua itu menjadi ular-ular yang merayap cepat, dan dengan itu mereka berhaasil menyihir penglihatan seluruh manusia (yang hdair), dan mereka berkata, “demi keperkasaan fir’aun, sesungguhnya kami benar-benar akan menang,” mereka meminta pertolongan kepada keperkasaan seorang hamba yang lemah lagi rapuh drai segala sisinya; hanya saja ia telah congkak dan tampak baginya sosok seorang raja dengan bala tentaranya, sehingga fenomena itu benar-benar memperdaya mereka, sedangkan mata hati mereka tidak sampai kepada hakikat perkara yang sesungguhnya. Atau, itu adalah sumpah mereka atas nama keperkasaan fir’aun, dan yang disumpahkan adalah bahwasannya mereka pasti menang! “kemudian Musa menjatuhkan tongkatnya maka tiba-tiba ia menelan,” menelan dan mengambil “benda-bena palsu yang mereka ada-adakan itu,” tongkat itu menelan segala sesuatu yang telah mereka lemparkan berupa tali-temali dan berbagai tongkat, sebab semua itu adalah kebohongan, kedustaan dan kepalsuan, dan semua itu adalah batil, tidak dapat tegak dihadapan kebenaran dan tidak pula dapat melawanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 43: 43-44. Berkata Musa kepada para penyihir dengan yakin tanpa ragu-ragu : Lemparkan apa yang engkau ingin lempar, setelah ia menasihati dan menakut-nakuti mereka sebagaimana dalam firman Allah : Celakalah kalian, jangan kalian mereka-reka atas nama Allah sesuatu yang dusta sehingga kalian akan tertimpa adzab, sungguh telah tertimpa mereka yang mengada-ada (Thaha : 61), kemudian dilemparlah tali dan tongkat mereka (para penyihir), maka dibuatlah para hadirin berangan-angan (melihat sesuatu yang dilempar) tersebut menjadi ular berbisa, mereka berkata sembari melempar : Demi kemuliaan fir’aun kami bersumpah, sungguh kami adalah orang-orang yang mengalahkan dan menang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka semua telah berkumpul, baik para pesihir, Nabi Musa ‘alaihis salam dan penduduk Mesir, maka Nabi Musa ‘alaihis salam mengingatkan lebih dulu, “Celakalah kamu, janganlah kamu mengada-adakan kedustaan terhadap Allah, maka Dia membinasakan kamu dengan siksa, dan sesungguhnya telah merugi orang yang mengada-adakan kedustaan.” (Terj. Thaha: 61) Ketika itulah para pesihir bertengkar, sebagian mengatakan, bahwa perkataannya bukanlah perkataan pesihir, tetapi perkataan seorang nabi, sedangkan yang lain mengatakan, bahwa ia pesihir, lalu Fir’aun mendorong mereka untuk maju melawan Nabi Musa ‘alaihis salam dan antara sesama mereka pun saling mendorong untuk maju. Yakni setelah mereka (para pesihir) menawarkan, apakah Musa yang melempar lebih dulu ataukah mereka. Dengan maksud untuk membatalkan sihir mereka dan menunjukkan bahwa yang dibawanya bukanlah sihir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 43",
    "description": "Para pesihir mempersilakan nabi musa memperlihatkan kehebatannya terlebih dahulu (lihat: surah al-a'r'f/7: 115). Namun sebelumnya nabi musa mengingatkan mereka agar tidak meneruskan perang tanding ini karena mereka pasti kalah (lihat: surah ''ha:61). Namun mereka tetap dengan pendirian mereka. Perang tanding pun dimulai. Dia, musa, berkata kepada mereka para pesihir itu, \"sekarang aku berikan kesempatan kepada kalian, lemparkanlah apa yang hendak kamu lemparkan, agar nanti bisa terlihat mana yang benar dan mana yang batil. \" lain halnya jika nabi musa terlebih dahulu yang beraksi. 44. Lalu mereka melemparkan tali temali dan tongkat-tongkat mereka seraya berkata dan bersumpah dengan penuh keyakinan, 'demi kekuasaan fir'aun, pasti kamilah yang akan menang. ' tongkat dan tali temali yang dilemparkan para pesihir itu terlihat oleh pengunjung seperti ular-ular yang berkeliaran ke sana ke mari yang menakutkan. Inilah puncak prestasi sihir mereka. Melihat gelagat ini, nabi musa merasa takut, tapi Allah menentramkannya, \"wahai musa, jangan takut, kamu pasti menang' Allah kemudian memerintahkan nabi musa untuk melemparkan tongkatnya."
  }
]