[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka mereka melemparkan tali-tali dan tongkat-tongkat mereka, dan diilusikan pada pandangan manusia bahwa itu adalah ular-ular yang bergerak-gerak, dan mereka bersumpah dengan kemuliaan fir’aun dengan berkata, “Sesungguhnya kami benar-benar akan menjadi pihak yang menang.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Lalu mereka melemparkan tali-temali dan tongkat-tongkat mereka dan berkata tatkala melemparkannya, \"Demi kemuliaan Fir'aun, sesungguhnya kami benar-benar akan menang, sedangkan Musa akan kalah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Maka para penyihir itu melempar tongkat dan tali-tali mereka, dan mereka bersumpah dengan kemuliaan Fir’aun bahwa mereka pasti akan menang. Lalu mereka menyihir penglihatan orang-orang dan membuat mereka takut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. فَأَلْقَوْا۟ حِبَالَهُمْ وَعِصِيَّهُمْ وَقَالُوا۟ (Lalu mereka melemparkan tali temali dan tongkat-tongkat mereka dan berkata) Mereka berkata ketika melempar. بِعِزَّةِ فِرْعَوْنَ إِنَّا لَنَحْنُ الْغٰلِبُونَ (“Demi kekuasaan Fir’aun, sesungguhnya kami benar-benar akan menang”) Yakni kami akan menang karena kekuasaan Fir’aun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Lalu para ahli sihir itu melempar tali-tali dan tongkat mereka, dan secara bersamaan berkata: “Dengan kekuatan Fir’aun sesungguhnya kami akan menjadi pemenang.” Al-‘Izzah adalah kehebatan/kekuatan yang tidak dapat dikalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka melemparkan tali-tali dan tongkat-tongkat mereka dan berkata, “Demi kekuasaan Fir‘aun} dengan keagungan dan kekuasaan Fir’aun {sesungguhnya kami yang benar-benar menjadi pemenang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-45 ketika mereka semua berkumpul pada hari yang telah ditentukan, berikut Musa dan seluruh masyarakat negeri Mesir, maka Musa menasihati serta mengingatkan mereka seraya berkata, ”celakalah kamu, janganlah kamu mengadakan kedustaan atas Nama Allah, sehingga Dia Membinasakan kamu dengan siksa. Dan sungguh telah merugi orang yang mengada-adakan kedustaan.”(thaha:61) Lalu mereka berselisih dan berbantah-bantahan, kemudian Fir’aun memberi mereka semangat keberanian dan sebagian drai mereka memberi semangat kepada sebagian yang lain. “Musa berkata kepada mereka,’lemparkanlah sesuatu yang hendak kamu lemparkan’.” Maksudnya, lemparkanlah segala sesuatu yang ada di dalam benak kalian akan dilemparkan. Musa sama seklai tidak mengecualikan apa pun, karena keyakinannya akan kebatilan sesuatu yang mereka hadirkan untuk menentang kebenaran. “lalu mereka melemparkan tali-temali dan tongkat-tongkat mereka; dan dengan sereta-merta semua itu menjadi ular-ular yang merayap cepat, dan dengan itu mereka berhaasil menyihir penglihatan seluruh manusia (yang hdair), dan mereka berkata, “demi keperkasaan fir’aun, sesungguhnya kami benar-benar akan menang,” mereka meminta pertolongan kepada keperkasaan seorang hamba yang lemah lagi rapuh drai segala sisinya; hanya saja ia telah congkak dan tampak baginya sosok seorang raja dengan bala tentaranya, sehingga fenomena itu benar-benar memperdaya mereka, sedangkan mata hati mereka tidak sampai kepada hakikat perkara yang sesungguhnya. Atau, itu adalah sumpah mereka atas nama keperkasaan fir’aun, dan yang disumpahkan adalah bahwasannya mereka pasti menang! “kemudian Musa menjatuhkan tongkatnya maka tiba-tiba ia menelan,” menelan dan mengambil “benda-bena palsu yang mereka ada-adakan itu,” tongkat itu menelan segala sesuatu yang telah mereka lemparkan berupa tali-temali dan berbagai tongkat, sebab semua itu adalah kebohongan, kedustaan dan kepalsuan, dan semua itu adalah batil, tidak dapat tegak dihadapan kebenaran dan tidak pula dapat melawanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 44: 43-44. Berkata Musa kepada para penyihir dengan yakin tanpa ragu-ragu : Lemparkan apa yang engkau ingin lempar, setelah ia menasihati dan menakut-nakuti mereka sebagaimana dalam firman Allah : Celakalah kalian, jangan kalian mereka-reka atas nama Allah sesuatu yang dusta sehingga kalian akan tertimpa adzab, sungguh telah tertimpa mereka yang mengada-ada (Thaha : 61), kemudian dilemparlah tali dan tongkat mereka (para penyihir), maka dibuatlah para hadirin berangan-angan (melihat sesuatu yang dilempar) tersebut menjadi ular berbisa, mereka berkata sembari melempar : Demi kemuliaan fir’aun kami bersumpah, sungguh kami adalah orang-orang yang mengalahkan dan menang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata “Bi’izzati” bisa maksudnya mereka meminta pertolongan dengan kekuasaan Fir’aun; makhluk yang lemah dari berbagai sisi, hanya karena ia seorang yang kejam dan ditakuti, sebagai raja dan punya tentara, sehingga kebesarannya membuat mereka tertipu, dan pandangan mereka tidak melihat hakikat yang sebenarnya. Bisa juga maksud, “Bi’izzati”adalah sumpah mereka dengan kekuasaan Fir’aun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 44",
    "description": "Lalu mereka melemparkan tali temali dan tongkat-tongkat mereka seraya berkata dan bersumpah dengan penuh keyakinan, 'demi kekuasaan fir'aun, pasti kamilah yang akan menang. ' tongkat dan tali temali yang dilemparkan para pesihir itu terlihat oleh pengunjung seperti ular-ular yang berkeliaran ke sana ke mari yang menakutkan. Inilah puncak prestasi sihir mereka. Melihat gelagat ini, nabi musa merasa takut, tapi Allah menentramkannya, \"wahai musa, jangan takut, kamu pasti menang' Allah kemudian memerintahkan nabi musa untuk melemparkan tongkatnya. 45. Kemudian musa melemparkan tongkatnya, maka tiba-tiba saja tongkat itu berubah menjadi ular besar yang sangat menakutkan, kemudian ia, ular besar itu menelan benda-benda yang kelihatan seperti ular itu, padahal itu adalah benda-benda yang palsu yang mereka ada-adakan itu, karena berasal dari sihir, dan sihir itu berasal dari setan."
  }
]