[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Musa melemparkan tongkatnya, dan tiba-tiba berubah menjadi ular besar, yang menelan semua yang berasal dari mereka yang merupakan kedustaan dan kepalsuan belaka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Kemudian Musa melemparkan tongkatnya yang seketika berubah menjadi ular sungguhan, dan secara tiba-tiba ia menelan benda-benda yang mereka halusinasikan kepada manusia melalui sihir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Kemudian Musa melempar tongkatnya, dan ternyata tongkat itu segera menelan segala kebohongan dan tipuan yang dibuat para penyihir itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَأَلْقَىٰ مُوسَىٰ عَصَاهُ فَإِذَا هِىَ تَلْقَفُ مَا يَأْفِكُونَ (Kemudian Musa menjatuhkan tongkatnya maka tiba-tiba ia menelan benda-benda palsu yang mereka ada-adakan itu) Yakni menelan kepalsuan dan khayalan yang mereka buat dengan menampakkan suatu benda dari bentuk aslinya menjadi bentuk yang lain. Dan tongkat Musa telah menghabiskan seluruh tongkat dan tali-tali mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Setelah itu, Musa melemparkan tongkatnya. Seketika tongkatnya menelan seluruh sesuatu yang mereka gunakan untuk membohongi manusia, yaitu sihir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Musa melemparkan tongkatnya, tiba-tiba tongkatnya menelan} menelan {sesuatu yang mereka ada-adakan} sesuatu yang mereka buat-buat dan bayangkan itu benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-45 ketika mereka semua berkumpul pada hari yang telah ditentukan, berikut Musa dan seluruh masyarakat negeri Mesir, maka Musa menasihati serta mengingatkan mereka seraya berkata, ”celakalah kamu, janganlah kamu mengadakan kedustaan atas Nama Allah, sehingga Dia Membinasakan kamu dengan siksa. Dan sungguh telah merugi orang yang mengada-adakan kedustaan.”(thaha:61) Lalu mereka berselisih dan berbantah-bantahan, kemudian Fir’aun memberi mereka semangat keberanian dan sebagian drai mereka memberi semangat kepada sebagian yang lain. “Musa berkata kepada mereka,’lemparkanlah sesuatu yang hendak kamu lemparkan’.” Maksudnya, lemparkanlah segala sesuatu yang ada di dalam benak kalian akan dilemparkan. Musa sama seklai tidak mengecualikan apa pun, karena keyakinannya akan kebatilan sesuatu yang mereka hadirkan untuk menentang kebenaran. “lalu mereka melemparkan tali-temali dan tongkat-tongkat mereka; dan dengan sereta-merta semua itu menjadi ular-ular yang merayap cepat, dan dengan itu mereka berhaasil menyihir penglihatan seluruh manusia (yang hdair), dan mereka berkata, “demi keperkasaan fir’aun, sesungguhnya kami benar-benar akan menang,” mereka meminta pertolongan kepada keperkasaan seorang hamba yang lemah lagi rapuh drai segala sisinya; hanya saja ia telah congkak dan tampak baginya sosok seorang raja dengan bala tentaranya, sehingga fenomena itu benar-benar memperdaya mereka, sedangkan mata hati mereka tidak sampai kepada hakikat perkara yang sesungguhnya. Atau, itu adalah sumpah mereka atas nama keperkasaan fir’aun, dan yang disumpahkan adalah bahwasannya mereka pasti menang! “kemudian Musa menjatuhkan tongkatnya maka tiba-tiba ia menelan,” menelan dan mengambil “benda-bena palsu yang mereka ada-adakan itu,” tongkat itu menelan segala sesuatu yang telah mereka lemparkan berupa tali-temali dan berbagai tongkat, sebab semua itu adalah kebohongan, kedustaan dan kepalsuan, dan semua itu adalah batil, tidak dapat tegak dihadapan kebenaran dan tidak pula dapat melawanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 45: 45-47. Maka Musa melemparkan tongkatnya, maka berubahlah menjadi ular besar yang nyata, dimakanlah ular-ular yang palsu, terkejutlah mereka para penyihir dan terpesona akan tanda-tanda yang agung ini. Ketahuilah bahwasanya Musa adalah utusan dari sisi Allah, dan tidaklah kalian kecuali mesti sujud kepada Allah. Dan para penyihir tersebut berkata : Kami beriman kepada Allah dan membenarkan bahwasanya Allah Rabb semesta alam, Rabb Musa dan Harun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, tali temali dan tongkat-tongkat yang dilemparkan para pesihir itu terbayang seolah-olah menjadi ular, semuanya ditelan oleh tongkat Musa yang benar-benar menjadi ular."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 45",
    "description": "Kemudian musa melemparkan tongkatnya, maka tiba-tiba saja tongkat itu berubah menjadi ular besar yang sangat menakutkan, kemudian ia, ular besar itu menelan benda-benda yang kelihatan seperti ular itu, padahal itu adalah benda-benda yang palsu yang mereka ada-adakan itu, karena berasal dari sihir, dan sihir itu berasal dari setan. 46. Sehabis menelan 'ular-ular' para pesihir, nabi musa mengambil tongkatnya kembali. Melihat kejadian yang sangat dramatis ini, para pesihir tertegun, terpana, dan merasa terkalahkan. Mereka yakin bahwa nabi musa bukanlah pesihir. Lalu serta merta mereka bersujud. Maka tanpa menunggu lebih lama lagi menyungkurlah para pesihir itu, bersujud di tanah tanpa ragu-ragu, karena mereka telah menemukan kebenaran."
  }
]