[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada tukang-tukang sihir dengan penuh pengingkaran, “Apakah kalian beriman kepada Musa tanpa seizin dariku?” Dan ia mengatakan sesuatu demi mengesankan bahwa tindakan Musa adalah sihir, “Sesungguhnya ia adalah pmimpin kalian yang mengajarkan sihir kepada kalian. Maka kalian akan tahu hukuman apa yang akan jatuh pada kalian. Sesungguhnya aku akan benar-benar memotong-motong tangan-tangan dan kaki-kaki kalian secara bersilangan: dengan memotong tangan kanan dan kaki kiri atau sebaliknya. Dan sesungguhnya aku akan benar-benar menyalib kalian semua."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Fir'aun berkata sembari mengingkari keimanan para ahli sihir itu, \"Apakah kamu sekalian beriman kepada Musa sebelum aku memberi izin kepada kalian untuk beriman? Sesungguhnya Musa ini benar-benar pemimpin kalian yang mengajarkan sihir kepada kalian, kalian pasti telah bersekongkol untuk mengeluarkan penduduk Mesir dari negeri mereka, maka kalian pasti benar-benar akan mengetahui hukuman yang akan aku berikan; aku pasti akan memotong tangan dan kaki kalian dengan bersilangan yaitu dengan memotong kaki kanan dan tangan kiri atau sebaliknya, dan aku pasti akan menyalib kalian semuanya di batang-batang pohon kurma dan aku tak akan menyisakan seorang pun dari kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Pernyataan mereka ini menggoncang kehormatan Fir’aun, sehingga dia mengingkari dan menegur mereka: “Apakah kalian beriman kepada Musa sebelum meminta izin kepadaku?” Kemudian Fir’aun mulai berdusta dan mengancam: “Musa adalah pemimpin kalian yang telah mengajari kalian sihir. Sungguh kalian akan mengetahui siksaanku; aku akan memotong kaki dan tangan kalian secara menyilang -dengan memotong tangan kanan dan kaki kiri, atau sebaliknya- kemudian aku akan menggantung badan kalian di batang pohon kurma dengan tangan terbentang agar membentuk salib, dan tidak akan ada satupun dari kalian yang dapat selamat dari siksaanku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. قَالَ (Fir’aun berkata) Yakni Fir’aun berkata. ءَامَنتُمْ لَهُۥ قَبْلَ أَنْ ءَاذَنَ لَكُمْ ۖ( Apakah kamu sekalian beriman kepada Musa sebelum aku memberi izin kepadamu?) Yakni tanpa izin dariku. Kemudian Fir’aun hendak menyalahkan para penyihir yang beriman dan ingin menipu orang-orang bahwa apa yang dilakukan Musa adalah bagian dari sihir, sehingga ia mengatakan إِنَّهُۥ لَكَبِيرُكُمُ الَّذِى عَلَّمَكُمُ السِّحْرَ(Sesungguhnya dia benar-benar pemimpinmu yang mengajarkan sihir kepadamu). Ia hendak memasukkan keraguan pada diri orang-orang bahwa apa yang kalian saksikan dari Musa meskipun telah mengalahkan para penyihir itu, namun itu adalah perbuatan sihir juga yang dilakukan oleh pemimpin para penyihir dan guru mereka dalam ilmu ini; oleh sebab itu janganlah kalian menyangka itu adalah sesuatu yang tidak mungkin dilakukan manusia atau menganggap itu adalah perbuatan yang dilakukan Tuhan yang diseru oleh Musa. لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلٰفٍ (sesungguhnya aku akan memotong tanganmu dan kakimu dengan bersilangan) Yakni memotong tangan kanan dan kaki kiri atau sebaliknya. وَلَأُصَلِّبَنَّكُمْ أَجْمَعِينَ(dan aku akan menyalibmu semuanya) Makna (التصليب) yang dimaksud adalah membunuhnya di atas salib, yaitu kayu yang berdiri yang di bagian atasnya terdapat kayu yang melintang. Ia akan ditancapkan di salib tersebut dan dibiarkan sampai meninggal. Adapun Fir’aun hendak menyalib mereka di atas batang pohon kurma agar mereka merasakan siksaan yang lebih berat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Fir’aun berkata kepada para ahli sihir itu: “Bagaimana bisa kalian beriman kepada Musa tanpa aku izinkan untuk beriman”. Kemudian dia menipu orang-orang sehingga tidak mengikuti mereka: “Sesungguhnya Musa adalah pemimpin kalian yang mengajari kalian sihir (Dia menggambarkan bahwa Musa adalah pembesar para ahli sihir untuk membutakan orang-orang dari perbuatannya)” Kemudian Dia (Fir’aun) mengancam mereka dengan berkata: “Sungguh kalian akan mengetahui hukumanku. Aku benar-benar akan memotong tangan dan kaki kalian secara menyilang, yaitu tangan kanan dengan kaki kiri atau sebaliknya, dan akan menyalib kalian semua setelah aku bunuh”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia (Fir‘aun) berkata,“Apakah kalian beriman kepadanya sebelum aku memberi izin kepada kalian. Sesungguhnya dia benar-benar pemimpin kalian yang mengajarkan sihir kepada kalian. Kalian akan tahu. Sungguh akan aku potong tangan dan kaki kalian secara bersilang dan benar-benar akan aku salib kalian semua”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-51 akan tetapi fir’aun menolak, melainkan dia makin bertambah congkak dan sesat, bersikukuh di dalam kesesatanya dan keras kepala. Maka dari itu, dia berkata kepada para ahli sihir,”apakah kamu sekalian beriman kepada Musa sebelum aku membi izin kepadamu,” Dia heran dan membuta kuamnya terheran-heran atas kelancangan para ahli sihir itu terhadapnya dan kelancangan mereka untuk beriman tanpa seizin darinya dan tanpa permusyawaratannya. “sesungguhnya dia benar-benar pemimpinmu yang mengajarkan sihir kepadamu,” demikianlah, padahal dialah yang telah mengumpulkan para ahli sihir, dan para pembesarnya yang telah mengusulkan kepadanya untuk mengumpulkan mereka dari seluruh penjuru negeri. Sementraa mereka mengetahui bahwa mereka sama sekali tidak pernah berkumpul dengan Musa dan tidak pernah melihatnya sebelumnya, dan bahwa mereka telah membawa sihir yang telah menyulap pandangan mata orang-orang yang melihatnya dan membuat mereka terlena. Akhirnya ucapan (fir’aun itu) tersebar di tengah-tengah mereka, yang mereka sendiri sudah mengetahui kebatilannya. Maka tidak aneh bagi orang-orang berakal ini kalau mereka tidak beriman kepada kebenaran yang sudah sangat jelas dan ayat-ayat yang luar biasa ini. Sebab, kalau sekiranya fir’aun berkata kepada mereka tentang apa yang telah terjadi, dan bahwasannya ia benar-benar berlawanan dengan yang hakikatnya, niscaya mereka membenarkannya. Kemudian fir’aun mengancam para ahli sihir, seraya berkata,”sungguh aku akan memotong tanganmu dan kakimu dengan bersilangan,” maksudnya, kaki kanan dan kaki kiri yang dipotong, sebagaimana diberlakukan kepada orang yang membuat kerusakan di muka bumi ini, “dan aku akan menyalibmu semuanya,” agar kalian menjadi hina dan nisat. Lalu para ahli sihir itu berkata setelah merasakan manis dan lezatnya iman, “tidak ada kemudaratan” maksudnya, kami tidak peduli terhadap apa yang engkau ancamkan kepada kami,”sesungguhnya kami akan kembali kepada Rabb kami, sesungguhnya kami amat menginginkan bahwa Rabb kami akan mengampuni kesalahan kami,” berupa kekafiran, sihir dan lain-lain, ”karena kami adalah orang-orang yang pertama-tama beriman,”kepada Musa draipada para pasukan tentara itu. Maka Allah membuta mereka berpendirian teguh dan sabar. Bisa jadi fir’aun betul-betul telah melaksanakan apa yang diancamkannya [terhadap mereka] saat itu karena kekuasaan dan kemampuannya di saat itu masih dominan, dan ada kemungkinan (juga) Allah telah membuatnya tidak bisa melakukan ancaman tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 49: Telah tampak dihadapan fir’aun, akan tetapi ia tetap sombong dan keras kepala serta ia berkata kepada penyihirnya : Kalian beriman dan membenarkan Rabb Musa dan Harun, serta kalian mengikuti Musa ?! Dengan tanpa kalian meminta izin padaku, aku tidak mengijinkan kalian begitu saja. Kemudian orang yang sombong tersebut berkata : Sungguh Musa adalah senior kalian yang lebih paham akan sihir ini. Kemudian ia berkata sembari menjanjikan sesuatu : Kalian akan tahu apa yang telah kalian lihat dari hukuman dan adzab, sungguh akan aku potong tangan dan kaki kalian jika kalian menyelisihi, tangan yang kanan maupun kiri, kemudian akan aku salib kalian di batang pohon kurma."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Padahal Fir'aun dan para pemukanya yang menyuruh mengumpulkan para pesihir dan mereka pun mengetahui, bahwa para pesihir itu belum pernah berkumpul dengan Musa dan belum pernah melihatnya. Lalu Fir’aun membesar-besarkan ucapan ini agar dianggap benar oleh kaumnya, padahal ia mengetahui tidak benarnya ucapan ini. Maksudnya, memotong tangan kanan dan kaki kiri atau sebaliknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 49",
    "description": "Dengan dikalahkannya para pesihir itu, posisi fir'aun semakin terdesak. Padahal kejadian ini disaksikan banyak sekali penduduk yang berkerumun. Fir'aun lalu berkata kapada para pesihir dengan suara lantang dan menggertak, dia, fir'aun, berkata dengan nada geram, 'mengapa kamu beriman kepada musa sebelum aku memberi izin kepadamu' padahal aku adalah pemimpin yang ditaati dan ditakuti. Sesungguhnya dia, musa, pemimpinmu yang mengajarkan sihir kepadamu. \" lalu fir'aun mengancam mereka, \"nanti kamu pasti akan tahu akibat perbuatanmu. Pasti akan kupotong tangan dan kakimu bersilang dan sungguh, akan kusalib kamu semuanya di tiang sampai kamu mati di tiang saliban itu. 50. Namun ancaman fir'aun tidak menyurutkan tekad mereka untuk terus beriman kepada Allah. Demikianlah hati jika sudah tenteram dengan keimanan tidak akan mudah goyah dengan ancaman apa pun. Para pesihir itu bahkan berani berterus terang dengan keimanan mereka. Mereka berkata, 'tidak ada sama sekali yang kami takutkan dengan semua yang engkau ancamkan kepada kami, karena pada akhirnya kami semua akan mati, kami akan kembali kepada tuhan kami dan kami harus mempertanggungjawabkan perbuatan kami di hadapan tuhan kami."
  }
]