[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah datang kepada kaum musyrikin yang mendustakan suatu peringatan dari ar-Rahman yang baru diturunkan satu demi satu, yang memerintahkan mereka dan melarang mereka, dan mengingatkan mereka terhadap agama yang haq ini, melainkan mereka berpaling darinya, dan tidak menerimanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan sekali-kali tidaklah datang kepada orang-orang musyrik itu suatu peringatan yang baru diturunkan dari Tuhan Yang Maha Pemurah beserta bukti yang menunjukkan keesaan dan kebenaran nabi-Nya, melainkan mereka selalu berpaling dari mendengarkannya dan sikap membenarkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Dan tidaklah Rasulullah mendatangkan kepada mereka peringatan dari al-Qur’an yang turun sesuai dengan peristiwa yang terjadi, melainkan mereka akan berpaling dari mendengarnya. Mereka benar-benar telah ingkar terhadapnya. Sungguh akan datang kepada mereka perkara besar yang selalu mereka olok itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَمَا يَأْتِيهِم مِّن ذِكْرٍ مِّنَ الرَّحْمٰنِ مُحْدَثٍ إِلَّا كَانُوا۟ عَنْهُ مُعْرِضِينَ (Dan sekali-kali tidak datang kepada mereka suatu peringatan baru dari Tuhan Yang Maha Pemurah, melainkan mereka selalu berpaling daripadanya) Setiap bagian al-Qur’an yang diturunkan adalah peringatan baru dari Allah yang menurunkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dan tidaklah sesuatu yang dibawa kepada mereka berupa peringatan dan nasehat dari kumpulan ayat-ayat Al-Qur’an yang baru diturunkan itu kecuali mereka menolak untuk mendengarkannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak datang kepada mereka suatu peringatan} peringatan {yang baru} yang baru diturunkan {dari Tuhan Yang Maha Pengasih, kecuali mereka selalu berpaling darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5 “dan sekali-kali tidaklah datang kepada mereka suatu peringatan baru dari Rabb yang MhaPemurah,” Dia memerintah mereka, melarang dan mengingatkan mereka akan segala hal yang bermanfaat bagi mereka dan yang membahayakan, “melainkan mereka selalu berpaling darinya,” dengan hati dan badan mereka. Ini adalah sikap berpaling mereka dari peringatan baru yang biasanya setuhannya (seharusnya) sangat dalam daripada yang lainnya. Lalu bagaimana sikap berpaling mereka dari yang lainnya? Hal itu adalah karena pada diri mereka tidak ada kebaikannya sama sekali dan segala bentuk nasihat tidak efektif bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 5: 5-7. Allah kemudian mengabarkan bahwasanya mereka orang-orang kafir tidaklah datang kepada mereka suatu yang mengada-ada dari Al Qur’an, yaitu bicara akan turunnya Al Qur’an kecuali dengan kedustaan, olok-olok serta penolakan darinya. Mereka berdusta atas nama Al Qur’an, maka akan datang berita akan adzab kepada mereka yang mereka akan mendapatkannya atas kedustaan dan olok-olok mereka. Kemudian Allah mengabarkan kepada mereka orang-orang yang mengolok-olok yang mendustakan akan hari kebangkitan dengan melihat ke bumi bagaimana bumi dapat hidup dengan hujan, dan Allah jadikan padanya sekelompok tumbuh-tumbuhan yang baik, indah dan padanya terdapat jenis laki-laki dan perempuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, ayat-ayat Al Quran yang baru diturunkan yang di dalamnya mengandung perintah dan larangan untuk mereka serta mengingatkan mereka hal yang bermanfaat dan hal yang bermadharrat. Baik dengan hati maupun dengan badan mereka. Inilah sikap mereka terhadap ayat yang baru turun, lalu bagaimana dengan ayat yang telah turun sebelimnya. Hal ini tidak lain, karena tidak ada lagi kebaikan dalam diri mereka dan semua nasehat tidak bermanfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 5",
    "description": "Dan setiap kali disampaikan kepada mereka suatu peringatan baru yakni ayat-ayat Al-Qur'an yang diturunkan dari tuhan yang maha pengasih, mereka selalu berpaling darinya. Mereka tidak mau mendengarkan, tidak mau memedulikannya, bahkan menertawakannya. 6. Sungguh, mereka telah mendustakan Al-Qur'an, bahkan memperolok-olokkannya maka kelak di hari kiamat akan datang kepada mereka kebenaran berita-berita mengenai apa yakni azab yang dulu mereka perolok-olokkan. Pada saat itulah mereka baru tersadarkan diri atas kesalahan mereka. Tapi sudah tidak berguna lagi penyesalan itu."
  }
]