[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-51. Ahli-ahli sihir berkata kepada Fir’aun, “Tidak ada masalah bagi kami terkait siksaan dunia yang meninpa kami, (karena) sesungguhnya kami akan kembali kepada Tuhan kami, lalu Dia akan memberikan kepada kami kenikmatan yang abadi. Sesungguhnya kami berharap semoga Tuhan kami (Allah) mengampuni kesalahan-kesalahan kami dari perbuatan syirik dan lainnya, karena kami adalah orang-orang yang pertama memeluk Islam dari kaummu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Para penyihir itu berkata kepada Fir'aun, \"Tidak ada kemudaratan bagi kami dengan semua yang engkau ancamkan, berupa pemotongan anggota badan dan salib di dunia ini, sebab siksaanmu pasti akan sirna, sedangkan kami akan kembali kepada Rabb kami, dan memasukkan kami ke dalam rahmat-Nya yang kekal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50-51. Para penyihir itu menjawab dengan penuh keimanan: “Tidak apa bagi kami mendapat siksaanmu, karena kami akan kembali kepada Pencipta kami setelah kematian; dan dengan kami menjadi golongan yang pertama beriman dari kaum Fir’aun, kami berharap kepada Allah agar mengampuni segala dosa dan kejahatan kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. قَالُوا۟ لَا ضَيْرَ ۖ إِنَّآ إِلَىٰ رَبِّنَا منقَلِبُونَ (Mereka berkata: “Tidak ada kemudharatan (bagi kami) sesungguhnya kami akan kembali kepada Tuhan kami) Yakni siksaan di dunia tidak akan memberi mudharat bagi kami, sebab siksaan itu akan berhenti dan kami akan kembali kepada Tuhan kami yang akan memberikan kami kenikmatan yang kekal yang tidak terbatas dan tidak dapat dibayangkan sebagai balasan atas keimanan dan kesabaran kami dalam menjalani siksaan ini serta balasan atas keteguhan kami di atas tauhid dan menjauhi kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Para ahli sihir itu berkata kepada Fir’aun: “Hukuman itu dan segala macam azab dunia yang menimpa kami itu tidak merugikan sama sekali bagi. Sesungguhnya kami akan kembali kepada Tuhan kami di akhirat setelah mati. Dan kesuksesan kami yaitu saat kami mendapatkan pahala agung dan dekat dengan Allah SWT.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Tidak ada bahaya} tidak ada mudharat berupa siksa dunia yang akan menimpa kami {Sesungguhnya kami akan kembali} kembali {kepada Tuhan kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-51 akan tetapi fir’aun menolak, melainkan dia makin bertambah congkak dan sesat, bersikukuh di dalam kesesatanya dan keras kepala. Maka dari itu, dia berkata kepada para ahli sihir,”apakah kamu sekalian beriman kepada Musa sebelum aku membi izin kepadamu,” Dia heran dan membuta kuamnya terheran-heran atas kelancangan para ahli sihir itu terhadapnya dan kelancangan mereka untuk beriman tanpa seizin darinya dan tanpa permusyawaratannya. “sesungguhnya dia benar-benar pemimpinmu yang mengajarkan sihir kepadamu,” demikianlah, padahal dialah yang telah mengumpulkan para ahli sihir, dan para pembesarnya yang telah mengusulkan kepadanya untuk mengumpulkan mereka dari seluruh penjuru negeri. Sementraa mereka mengetahui bahwa mereka sama sekali tidak pernah berkumpul dengan Musa dan tidak pernah melihatnya sebelumnya, dan bahwa mereka telah membawa sihir yang telah menyulap pandangan mata orang-orang yang melihatnya dan membuat mereka terlena. Akhirnya ucapan (fir’aun itu) tersebar di tengah-tengah mereka, yang mereka sendiri sudah mengetahui kebatilannya. Maka tidak aneh bagi orang-orang berakal ini kalau mereka tidak beriman kepada kebenaran yang sudah sangat jelas dan ayat-ayat yang luar biasa ini. Sebab, kalau sekiranya fir’aun berkata kepada mereka tentang apa yang telah terjadi, dan bahwasannya ia benar-benar berlawanan dengan yang hakikatnya, niscaya mereka membenarkannya. Kemudian fir’aun mengancam para ahli sihir, seraya berkata,”sungguh aku akan memotong tanganmu dan kakimu dengan bersilangan,” maksudnya, kaki kanan dan kaki kiri yang dipotong, sebagaimana diberlakukan kepada orang yang membuat kerusakan di muka bumi ini, “dan aku akan menyalibmu semuanya,” agar kalian menjadi hina dan nisat. Lalu para ahli sihir itu berkata setelah merasakan manis dan lezatnya iman, “tidak ada kemudaratan” maksudnya, kami tidak peduli terhadap apa yang engkau ancamkan kepada kami,”sesungguhnya kami akan kembali kepada Rabb kami, sesungguhnya kami amat menginginkan bahwa Rabb kami akan mengampuni kesalahan kami,” berupa kekafiran, sihir dan lain-lain, ”karena kami adalah orang-orang yang pertama-tama beriman,”kepada Musa draipada para pasukan tentara itu. Maka Allah membuta mereka berpendirian teguh dan sabar. Bisa jadi fir’aun betul-betul telah melaksanakan apa yang diancamkannya [terhadap mereka] saat itu karena kekuasaan dan kemampuannya di saat itu masih dominan, dan ada kemungkinan (juga) Allah telah membuatnya tidak bisa melakukan ancaman tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 50: 50-51. Mereka (para penyihir) menjawab dengan tanpa ragu setelah bergeser hati mereka bercampur dengan keimanan : Kami tidak peduli dan tidak penting bagi kami atas apa yang akan engkau lakukakan kepada kami setelah Rabb kami memuliakan kami dengan keimanan karena sebab tempat kembali kami hanyalah kepada Allah, yang Ia akan membalas amalan-amalan kami dan ketidak raguan kami serta kami adalah orang-orang yang tengan dengan tauhid dan kekokohan (iman) kemudian bersegara menjemput keimanan, semoga Allah mengampuni kami dari kekufuran, sihir dan selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika merasakan manisnya iman. Bagaimana pun keadaannya, yaitu setelah kami mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 50",
    "description": "Namun ancaman fir'aun tidak menyurutkan tekad mereka untuk terus beriman kepada Allah. Demikianlah hati jika sudah tenteram dengan keimanan tidak akan mudah goyah dengan ancaman apa pun. Para pesihir itu bahkan berani berterus terang dengan keimanan mereka. Mereka berkata, 'tidak ada sama sekali yang kami takutkan dengan semua yang engkau ancamkan kepada kami, karena pada akhirnya kami semua akan mati, kami akan kembali kepada tuhan kami dan kami harus mempertanggungjawabkan perbuatan kami di hadapan tuhan kami. 51. Mereka terus berkata, \"sesungguhnya kami sangat menginginkan sekiranya tuhan kami akan mengampuni segala kesalahan kami yang kami perbuat, karena perbuatan sihir kami, ketaatan kami kepada fir'aun, dan lain-lainnya, karena kami menjadi orang yang pertama-tama beriman. ' kepada tuhan musa dan harun."
  }
]