[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-51. Ahli-ahli sihir berkata kepada Fir’aun, “Tidak ada masalah bagi kami terkait siksaan dunia yang meninpa kami, (karena) sesungguhnya kami akan kembali kepada Tuhan kami, lalu Dia akan memberikan kepada kami kenikmatan yang abadi. Sesungguhnya kami berharap semoga Tuhan kami (Allah) mengampuni kesalahan-kesalahan kami dari perbuatan syirik dan lainnya, karena kami adalah orang-orang yang pertama memeluk Islam dari kaummu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Sesungguhnya kami berharap agar Allah menghapus kesalahan yang pernah kami lakukan, karena kami adalah orang-orang yang pertama-tama beriman kepada Musa dan membenarkannya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Kami berharap Tuhan kami akan mengampuni dosa-dosa kami, karena kami adalah orang-orang pertama dari kaum Fir’aun yang beriman kepada apa yang dibawa oleh Musa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kami sangat menginginkan} sangat mengharapkan {agar} agar {Tuhan kami mengampuni kesalahan-kesalahan kami karena kami adalah orang-orang yang pertama beriman”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-51 akan tetapi fir’aun menolak, melainkan dia makin bertambah congkak dan sesat, bersikukuh di dalam kesesatanya dan keras kepala. Maka dari itu, dia berkata kepada para ahli sihir,”apakah kamu sekalian beriman kepada Musa sebelum aku membi izin kepadamu,” Dia heran dan membuta kuamnya terheran-heran atas kelancangan para ahli sihir itu terhadapnya dan kelancangan mereka untuk beriman tanpa seizin darinya dan tanpa permusyawaratannya. “sesungguhnya dia benar-benar pemimpinmu yang mengajarkan sihir kepadamu,” demikianlah, padahal dialah yang telah mengumpulkan para ahli sihir, dan para pembesarnya yang telah mengusulkan kepadanya untuk mengumpulkan mereka dari seluruh penjuru negeri. Sementraa mereka mengetahui bahwa mereka sama sekali tidak pernah berkumpul dengan Musa dan tidak pernah melihatnya sebelumnya, dan bahwa mereka telah membawa sihir yang telah menyulap pandangan mata orang-orang yang melihatnya dan membuat mereka terlena. Akhirnya ucapan (fir’aun itu) tersebar di tengah-tengah mereka, yang mereka sendiri sudah mengetahui kebatilannya. Maka tidak aneh bagi orang-orang berakal ini kalau mereka tidak beriman kepada kebenaran yang sudah sangat jelas dan ayat-ayat yang luar biasa ini. Sebab, kalau sekiranya fir’aun berkata kepada mereka tentang apa yang telah terjadi, dan bahwasannya ia benar-benar berlawanan dengan yang hakikatnya, niscaya mereka membenarkannya. Kemudian fir’aun mengancam para ahli sihir, seraya berkata,”sungguh aku akan memotong tanganmu dan kakimu dengan bersilangan,” maksudnya, kaki kanan dan kaki kiri yang dipotong, sebagaimana diberlakukan kepada orang yang membuat kerusakan di muka bumi ini, “dan aku akan menyalibmu semuanya,” agar kalian menjadi hina dan nisat. Lalu para ahli sihir itu berkata setelah merasakan manis dan lezatnya iman, “tidak ada kemudaratan” maksudnya, kami tidak peduli terhadap apa yang engkau ancamkan kepada kami,”sesungguhnya kami akan kembali kepada Rabb kami, sesungguhnya kami amat menginginkan bahwa Rabb kami akan mengampuni kesalahan kami,” berupa kekafiran, sihir dan lain-lain, ”karena kami adalah orang-orang yang pertama-tama beriman,”kepada Musa draipada para pasukan tentara itu. Maka Allah membuta mereka berpendirian teguh dan sabar. Bisa jadi fir’aun betul-betul telah melaksanakan apa yang diancamkannya [terhadap mereka] saat itu karena kekuasaan dan kemampuannya di saat itu masih dominan, dan ada kemungkinan (juga) Allah telah membuatnya tidak bisa melakukan ancaman tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 51: 50-51. Mereka (para penyihir) menjawab dengan tanpa ragu setelah bergeser hati mereka bercampur dengan keimanan : Kami tidak peduli dan tidak penting bagi kami atas apa yang akan engkau lakukakan kepada kami setelah Rabb kami memuliakan kami dengan keimanan karena sebab tempat kembali kami hanyalah kepada Allah, yang Ia akan membalas amalan-amalan kami dan ketidak raguan kami serta kami adalah orang-orang yang tengan dengan tauhid dan kekokohan (iman) kemudian bersegara menjemput keimanan, semoga Allah mengampuni kami dari kekufuran, sihir dan selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di masa kami. Mungkin saja Fir’aun melakukan yang dia ancamkan kepada mereka itu, dan mungkin juga Allah menghalanginya sehingga ancaman itu tidak dilakukannya, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 51",
    "description": "Mereka terus berkata, \"sesungguhnya kami sangat menginginkan sekiranya tuhan kami akan mengampuni segala kesalahan kami yang kami perbuat, karena perbuatan sihir kami, ketaatan kami kepada fir'aun, dan lain-lainnya, karena kami menjadi orang yang pertama-tama beriman. ' kepada tuhan musa dan harun. 52. Walaupun fir'aun telah kalah dalam pertarungan, tapi tetap saja dia angkuh dan sombong dan bahkan terus menindas bani israil di mesir. Nabi musa terus berdakwah beberapa tahun lamanya. Sampai pada puncaknya, Allah memerintahkan nabi musa untuk keluar dari tanah mesir menuju ke negeri yang dijanjikan yaitu di baitul maqdis. Dan kami wahyukan serta kami perintahkan kepada musa, 'pergilah pada malam hari dengan membawa serta hamba-hamba-ku, yaitu bani israil, keluar dari tanah mesir, agar mereka lepas dari kezaliman raja fir'aun, sebab pasti kamu akan dikejar. Jika kamu keluar pada malam hari, kamu akan sampai di tepi laut pada pagi harinya. Mereka yang mengejar di pagi hari tidak akan mampu mengejarmu, karena saat itu kamu sudah berada di laut. \" mendengar nabi musa dan bani israil keluar dari mesir, fir'aun memerintahkan kaumnya untuk mengejar nabi musa dan bani israil."
  }
]