[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah mewahyukan kepada Musa, “Berjalanlah kamu di malam hari beserta dengan orang-orang yang beriman dari kaum Bani Israil, karena Fir’aun dan tentaranya akan mengejar kalian, agar mereka tidak dapat menyusul kalian sebelum sampai ke laut.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan Kami wahyukan kepada Musa dengan memerintahkannya pergi membawa Bani Israil pada malam hari, sebab Fir'aun dan pengikutnya pasti akan mengejar mereka untuk mengembalikan mereka (ke Mesir)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Kemudian Kami mewahyukan kepada Musa agar pergi bersama Bani Israil pada malam hari dari Mesir menuju padang pasir Sina, karena Fir’aun dan bala tentaranya akan mengikuti kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَأَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ أَنْ أَسْرِ بِعِبَادِىٓ (Dan Kami wahyukan (perintahkan) kepada Musa: “Pergilah di malam hari dengan membawa hamba-hamba-Ku (Bani Israil)) Allah memerintahkan Musa agar pergi membawa Bani Israil dari Mesir pada malam hari. Allah menyebut mereka sebagai hamba-hamba-Nya sebab mereka beriman kepada Musa dan risalah yang ia bawa. إِنَّكُم مُّتَّبَعُونَ (karena sesungguhnya kamu sekalian akan disusuli) Yakni kalian akan dikejar oleh Fir’aun dan kaumnya untuk mengembalikan kalian ke Mesir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Dan kami perintahkan kepada Musa: “Pergilah bersama hamba-hambaKu dari tanah Mesir pada malam hari. Sesungguhnya kalian diburu oleh Fir’aun dan pasukan-pasukannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang pertama yang beriman di zaman kami {Kami memberi wahyu kepada Musa,“Pergilah pada malam hari dengan hamba-hambaKu} pergilah bersama hamba-hambaKu pada malam hari {Sesungguhnya kalian akan diikuti”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52 kemudian fir’aun beserta para pengikutnya tetap terus dalam kekafiran, lalu Musa mendatangi mereka dengan mukjizat-mukjizat yang sangat jelas. Dan setiap kali datang satu (ayat) mukjizat kepada mereka dan telah membuat mereka tidak berdaya maka mereka berjanji kepada Musa dan bersumpah, jika Allah mencabut dari mereka sesuatu yang telah menimpa niscaya mereka beriman kepadanya dan niscaya mereka akan melepas Bani israil bersama Musa. Maka Allah pun menghilangkannya dari mereka, namun kemudian mereka merusak janji. Nah, setelah Musa merasa putus asa terhadap keimanan mereka, sedangkan kalimat (ketetapan) azab sudah menjadi pasti terhadap mereka, dan sudah saatnya bagi bani israil untuk diselamatkan dari tawanan fir’aun, dan sudah saatnya mereka diberi kekuasaan di bumi ini, maka Allah mewahyukan kepada Musa,”pergilah di malam hari dengan membawa hamba-hambaKu,” maksudnya, pergilah kamu dengan membawa bani israil pada awal malam supaya bisa leluasa dalam kepergian mereka, “karena sesungguhnya kamu sekalian akan disusuli,” maksudnya, kalian akan diikuti oleh Fir’aun dan pasukannya. Lalu benar-benar terjadilah seperti yang dikabarkan, sebab keesokan harinya mereka (fir’aun dan pasukannya) telah menemukan bani israil telah pergi semua di malam hari bersama Musa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 52: 52-56. Allah wahyukan kepada Musa agar keluar bersama bani israil di awal malam, dan Allah kabarkan bahwa fir’aun akan mengikuti untuk mengembalikan kalian. Ketika fir’aun mengetahu Musa yang keluar bersama bani israil, ia sangat marah dan memerintahkan pasukan untuk mengikutinya dengan jumlah yang sedikit, ia marah bukan karena semerta-merta keluar, akan tetapi marah karena meninggalkan agamanya dan membangkang kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Fir’aun dan kaumnya tetap terus di atas kekafirannya meskipun Nabi Musa ‘alaihis salam memperlihatkan berbagai mukjizat. Setiap kali mukjizat yang berupa azab datang kepada mereka, maka mereka mengadakan perjanjian dengan Nabi Musa ‘alaihis salam, bahwa jika azab itu hilang, maka mereka akan beriman dan akan melepaskan Bani Israil bersamanya, lalu Allah menghilangkan azab itu, namun mereka mengingkari janji dan terus menerus seperti itu sampai Nabi Musa ‘alaihis salam berputus asa dari mengharapkan keimanan mereka (Fir’aun dan kaumnya), dan mereka sudah berhak menerima azab, serta telah tiba waktu untuk menyelamatkan Bani Israil dari cengkeraman mereka dan memberikan tempat bagi mereka di bumi. Setelah berlalu beberapa tahun, di mana Beliau mengajak mereka kepada kebenaran dengan membawa mukjizat, namun ajakan Beliau tidak menambah mereka selain kedurhakaan. Dan ternyata demikian. Mereka dikejar oleh Fir’aun dan tentaranya. Para mufassir banyak yang menerangkan, bahwa perginya Nabi Musa ‘alaihis salam membawa Bani Israil dilakukan pada waktu bulan muncul, dan bahwa Nabi Musa ‘alaihis salam sebelumnya bertanya tentang kuburan Nabi Yusuf ‘alaihis salam, lalu ditunjukkanlah oleh perempuan tua Bani Israil, kemudian Beliau membawa peti mayatnya, karena Yusuf ‘alaihis salam berwasiat seperti itu, yakni apabila Bani Israil keluar (dari Mesir), ia meminta agar petinya dibawa bersama mereka. Ketika tiba pagi harinya dan majlis petemuan mereka sepi; tidak ada yang memanggil maupun menjawab, maka bertambahlah kemarahan Fir’aun dan diputuskannya untuk mengejar Bani Israil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 52",
    "description": "Walaupun fir'aun telah kalah dalam pertarungan, tapi tetap saja dia angkuh dan sombong dan bahkan terus menindas bani israil di mesir. Nabi musa terus berdakwah beberapa tahun lamanya. Sampai pada puncaknya, Allah memerintahkan nabi musa untuk keluar dari tanah mesir menuju ke negeri yang dijanjikan yaitu di baitul maqdis. Dan kami wahyukan serta kami perintahkan kepada musa, 'pergilah pada malam hari dengan membawa serta hamba-hamba-ku, yaitu bani israil, keluar dari tanah mesir, agar mereka lepas dari kezaliman raja fir'aun, sebab pasti kamu akan dikejar. Jika kamu keluar pada malam hari, kamu akan sampai di tepi laut pada pagi harinya. Mereka yang mengejar di pagi hari tidak akan mampu mengejarmu, karena saat itu kamu sudah berada di laut. \" mendengar nabi musa dan bani israil keluar dari mesir, fir'aun memerintahkan kaumnya untuk mengejar nabi musa dan bani israil. 53. Kemudian fir'aun mengirimkan orang ke kota-kota untuk memobilisasi umum bala tentaranya dan pengikutnya dalam rangka mengejar nabi musa kemudian membunuhnya. Setelah fir'aun melihat jumlah bala tentaranya demikian besar, dia menganggap remeh nabi musa dan bani israil. Tapi sebenarnya fir'aun sudah merasa panik dan galau."
  }
]