[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-56. Fir’aun berkata, “Sesungguhnya Bani Israil yang lari bersama Musa hanyalah golongan manusia yang hina lagi kecil jumlahnya. Dan sesungguhnya mereka telah memenuhi hati kita dengan kemurkaan, lantaran mereka menyelisihi keyakinan kita, dan pergi tanpa seizin kami. Dan sesungguhnya kami adalah golongan yang terjaga dan siap menghadapi mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Sambil menganggap remeh Bani Israil, Fir'aun berkata, \"Sesungguhnya mereka (Bani Israil) benar-benar golongan kecil lagi sedikit jumlahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. إِنَّ هٰٓؤُلَآءِ لَشِرْذِمَةٌ قَلِيلُونَ (Sesungguhnya mereka (Bani Israil) benar-benar golongan kecil) Ia mengatakan ini untuk meremehkan kedudukan Bani Israil.a"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Fir’aun berkata kepada para pengawal dan pengikutnya: “Sesungguhnya Bani Israil itu hanyalah kelompok kecil sedangkan kalian semua adalah kelompok besar yang mengatur Mesir.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Sesungguhnya mereka adalah kelompok kecil} sungguh satu kelompok yang sangat kecil jumlahnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53-56 “kemudian fir’aun mengirimkan orang yang mengumpulkan (tentaranya) ke kota-kota. Maksudnya, mereka mengumpulkan manusia agar dia bisa menghukum bani israil, dan dia mengatakan dengan nada memotivasi kaumnya, “sesungguhnya mereka.” Maksudnya, bani israil, ”benar-benar golongan kecil, dan sesungguhnya mereka membuat hal-hal yang menimbulkan amarah kita.” Maka kita ingin melampiaskan kemarahan kita terhadap para budak yang telah melarikan diri dari kita. “dan sesungguhnya kita benar-benar golongan yang selalu berjaga-jaga,” semuanya harus bersikap waspada terhadap mereka, mereka adalah musuh kita semua, dan kepentingan ini milik kita bersama."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 54: 52-56. Allah wahyukan kepada Musa agar keluar bersama bani israil di awal malam, dan Allah kabarkan bahwa fir’aun akan mengikuti untuk mengembalikan kalian. Ketika fir’aun mengetahu Musa yang keluar bersama bani israil, ia sangat marah dan memerintahkan pasukan untuk mengikutinya dengan jumlah yang sedikit, ia marah bukan karena semerta-merta keluar, akan tetapi marah karena meninggalkan agamanya dan membangkang kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 54",
    "description": "Fir'aun berkata kepada para pembesarnya, 'sesungguhnya mereka bani israil itu hanya sekelompok kecil. Jumlah mereka sangat tidak sebanding dengan tentaraku. Aku dan bala tentaraku akan dengan mudah bisa mengalahkan mereka. \"55. \"dan sesungguhnya mereka, bani israil itu, telah berbuat hal-hal yang menimbulkan amarah kita, seperti ajakan mereka kepada kita untuk menyembah tuhan mereka, padahal mereka adalah bawahan dan rakyat jelata kita. \"."
  }
]