[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-56. Fir’aun berkata, “Sesungguhnya Bani Israil yang lari bersama Musa hanyalah golongan manusia yang hina lagi kecil jumlahnya. Dan sesungguhnya mereka telah memenuhi hati kita dengan kemurkaan, lantaran mereka menyelisihi keyakinan kita, dan pergi tanpa seizin kami. Dan sesungguhnya kami adalah golongan yang terjaga dan siap menghadapi mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan sesungguhnya mereka membuat hal-hal yang menimbulkan amarah kita,"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Sesungguhnya mereka telah melakukan sesuatu yang membuat kita marah tanpa seizin kita dengan keluar dari Mesir dan membawa perhiasan wanita yang mereka pinjam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka telah membuat kita marah} melakukan perbuatan yang membuat kita marah kepada mereka, karena mereka menentang agama kita, mereka pergi dengan harta kita, dan keluar dari negeri kita tanpa seizing kita"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53-56 “kemudian fir’aun mengirimkan orang yang mengumpulkan (tentaranya) ke kota-kota. Maksudnya, mereka mengumpulkan manusia agar dia bisa menghukum bani israil, dan dia mengatakan dengan nada memotivasi kaumnya, “sesungguhnya mereka.” Maksudnya, bani israil, ”benar-benar golongan kecil, dan sesungguhnya mereka membuat hal-hal yang menimbulkan amarah kita.” Maka kita ingin melampiaskan kemarahan kita terhadap para budak yang telah melarikan diri dari kita. “dan sesungguhnya kita benar-benar golongan yang selalu berjaga-jaga,” semuanya harus bersikap waspada terhadap mereka, mereka adalah musuh kita semua, dan kepentingan ini milik kita bersama."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 55: 52-56. Allah wahyukan kepada Musa agar keluar bersama bani israil di awal malam, dan Allah kabarkan bahwa fir’aun akan mengikuti untuk mengembalikan kalian. Ketika fir’aun mengetahu Musa yang keluar bersama bani israil, ia sangat marah dan memerintahkan pasukan untuk mengikutinya dengan jumlah yang sedikit, ia marah bukan karena semerta-merta keluar, akan tetapi marah karena meninggalkan agamanya dan membangkang kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, Fir’aun hendak menimpakan hukumannya kepada Bani Israil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 55",
    "description": "\"dan sesungguhnya mereka, bani israil itu, telah berbuat hal-hal yang menimbulkan amarah kita, seperti ajakan mereka kepada kita untuk menyembah tuhan mereka, padahal mereka adalah bawahan dan rakyat jelata kita. \"56. Dan sesungguhnya kita semua, tanpa kecuali, harus selalu waspada, mawas diri terhadap segala kemungkinan yang akan terjadi yang diperbuat oleh musa dan bani israil. \" kemudian fir'aun bergerak mengejar nabi musa dan meninggalkan mesir."
  }
]