[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "57-59. Maka Allah mengusir fir’aun dan kaumnya dari negeri Mesir yang penuh dengan kebun-kebun, mata air, perbendaharaan kekayaan dan hunian-hunian yang indah. Sebagaimana Kami mengeluarkan mereka, Kami menjadikan negeri-negeri itu menjadi milik Bani Israil sepeninggal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. dan negeri yang memiliki perbendaharaan harta dan rumah-rumah yang indah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57-58. Lalu Kami keluarkan Fir’aun dan kaumnya dari taman-taman di pinggiran sungai nil, sungai-sungai yang mengalir, gudang harta, dan istana megah yang sangat bagus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{harta kekayaan} perbendaharaan harta yang terbuat dari emas dan perak {dan tempat tinggal yang bagus} dan tempat tingga; yang bagus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-59 lalu Fir’aun bersama tentaranya berangkat dalam satu pasukan perang yang sangat besar dan jumlah yang sangat banyak, tidak seorangpun dari mereka yang absen kecuali orang-orang yang berhalangan karena lemah. Allah berfirman,”maka kami keluarkan fir’aun dan kaumnya dari taman-taman dan mata air,” maksudnya, dari kebun-kebun di mesir, taman-tamnannya yang indah dan mata airnya yang mengalir serta dari tanaman-tanaman yang telah memenuhi sawah mereka dan meramaikan perkotaan dan pedesaannya, “dan dari kedudukan yang mulia,” yang menakjubkan bagi orang-orang yang mengamatinya; mereka telah menikmatinya berabad-abad lamanya, mereka telah merasakan kelezatan dan kenikmatannya dalam waktu yang cukup lama dalam kekafiran, keras kepala dan kesombongan serta kecongkakan terhadap manusia. “demikianlah halnya, dan kami anugerahkan semuanya,” semua kebun-kebun, mata air, tanaman dan kedudukan mulia itu ”kepada bani israil,” yang dahulu telah mereka jadikan sebagai budak dan memperkerjakan mereka dengan pekerjaan-pekerjaan yang sangat berat. Maka Mahasuci Allah yang telah memberikan kerajaan pada siapa saja yang Dia kehendaki, dan menanggalkannya dari siapa saja yang Dia kehendaki, Dia memuliakan siapa saja yang Dia kehendaki karena ketaatan kepadaNya, dan menghinakan siapa saja yang Dia kehendaki karena tindakan maksiat terhadapNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 58: 57-58. Allah kemudian mengeluarkan (dengan takdirnya) fir’aun dan bala tentaranya dari bumi mesir, dari kebun-kebunnya, dari taman-tamannya dan seluruh kesenangannya menuju laut yang ia akan tenggelam karena sebab kekafirannya yang parah serta ke-thaghutannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Harta kekayaan di ayat ini disebut dengan kunuz (simpanan) karena ia (Fir’aun) tidak mengeluarkan untuk hak Allah di sana. Yaitu majlis besar miliknya untuk berbicara dengan para gubernur dan mentri. Dengan pengejaran Fir'aun dan kaumnya untuk menyusul Musa dan Bani Israil, maka mereka telah keluar dari negeri mereka dengan meninggalkan kerajaan, kebesaran, kemewahan dan sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 58",
    "description": "57-58. Kemudian, kami keluarkan mereka, yaitu fir'aun dan kaumnya, dari taman-taman dan mata air, yang sangat indah yang mereka punyai demi untuk sesuatu tujuan yang batil. Dan kami keluarkan mereka juga dari harta kekayaan dan kedudukan yang mulia yang mereka dapatkan. 59. Demikianlah, dan kami anugerahkan semuanya itu kepada bani israi. Merekalah pada akhirnya yang mewarisi kekayaan fir'aun dan peng-ikutnya setelah semuanya binasa."
  }
]