[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Fir’aun dan bala tentaranya dapat menyusul Musa dan orang-orang yang bersama dengannya pada waktu terbitnya matahari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Maka Fir'aun dan bala tentaranya pun mengejar Bani Israil di waktu matahari terbit."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-62. Setelah Musa keluar dari Mesir bersama orang-orang beriman yang menyertainya, Fir’aun dan bala tentaranya mengejar mereka ke arah timur menuju Laut Merah pada waktu terbit matahari. Ketika dua golongan itu semakin berdekatan dan setiap mereka dapat saling melihat satu sama lain, para pengikut Musa merasa takut dan berkata: “Fir’aun dan pengikutnya akan menyusulkita.” Maka Musa membantah untuk menenangkan mereka: “Tidak mungkin, mereka tidak akan menyusul kita, karena Tuhanku bersamaku, dan Dia akan memberiku petunjuk menuju jalan keselamatan dengan penjagaan dan pertolongan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. فَأَتْبَعُوهُم مُّشْرِقِينَ (Maka Fir’aun dan bala tentaranya dapat menyusuli mereka di waktu matahari terbit) Yakni mereka mengejar Bani Israil pada saat matahari terbit. Terdapat pendapat mengatakan mereka pergi ke arah timur, yakni ke arah Sina untuk menuju tanah yang suci Baitul Maqdis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59-60. Demikianlah Kami keluarkan Fir’aun sebagaimana yang Kami gambarkan, lalu Kami wariskan rumah-rumah itu kepada Bani Israil. Kemudian mereka (Fir’aun dan kaumnya) menyusul dan hampir menjangkau Bani Israil saat matahari terbit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Fir’aun dan kaumnya menyusul mereka} lalu Fir’aun dan kaumnya menyusul Bani Israil {pada waktu matahari terbit} waktu matahari terbit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-62 “maka mereka dapat menyusulinya di waktu matahari terbit,” maksudnya, kaum Fir’aun dapat menyusuli kaum Musa pada waktu matahari terbit, dan mereka membuntutinya dari belakang dengan perasaan sangat marah dan jengkel. “maka saat kedua golongan itu saling melihat,” maksudnya, masing-masing lawan saling melihat satu sama lain, “berkatalah pengikut-pengikut Musa,” dengan nada mengadu kepadanya dan sedih, “sesungguhnya kita akan benar-benar tersusul,” lalu Musa menjawab untuk meyakinkan dan memberitakan janji Allah yang benar,”sekali-kali tidak” maksudnya, perkaranya bukan seperti yang kalian sebutkan, yaitu bahwa kalian pasti tersusul. “sesungguhnya Rabbku besertaku, kelak Dia akan memberi petunjuk kepadaku,” yaitu kepada sesuatu yang di situ terdapat keselamatanku dan keselamatan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 60: Kemudian Allah menjelaskan bahwasanya fir’aun dan tentaranya mengikuti (di belakang) Musa yang bersama Musa bani israil di pesisir laut merah ketika terbit matahari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 60",
    "description": "Lalu fir'aun dan bala tentaranya dapat menyusul mereka musa dan bani israil, pada waktu matahari terbit di pagi hari. Kedua kekuatan berada pada jarak yang semakin dekat. Situasi sudah sangat menegangkan. 61. Maka ketika kedua golongan itu saling melihat, berkatalah pengikut-pengikut musa dengan nada gemetar dan takut 'kita benar-benar akan tersusul, oleh fir'aun dan bala tentaranya. \"."
  }
]