[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika masing-masing golongan dapat melihat golongan lainnya, para pengikut Musa berkataa, “Sesungguhnya kekuatan Fir’aun akan menyusul kita dan membinasakan kita.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Maka setelah Fir'aun dan kaumnya saling berdekatan dengan Musa dan kaumnya yang mana kedua golongan ini sudah bisa saling melihat, para pengikut Musa berkata, \"Sungguh Fir’aun dan bala tentaranya pasti akan menyusul kita semua, dan kita tidak akan bisa menghindarkan diri dari mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. فَلَمَّا تَرٰٓءَا الْجَمْعَانِ (Maka setelah kedua golongan itu saling melihat) Yakni setiap golongan saling menatap temannya. قَالَ أَصْحٰبُ مُوسَىٰٓ إِنَّا لَمُدْرَكُونَ(berkatalah pengikut-pengikut Musa: “Sesungguhnya kita benar-benar akan tersusul”) Yakni kaum Fir’aun akan menyusul kita, dan kita tidak akan mampu melawan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Maka ketika melihat dua golongan itu semakin mendekat, salah satu pengikut Musa berkata: “Golongan Fir’aun akan menyusul kita”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika kedua golongan itu saling melihat} ketika kelompok Musa dan kelompok Fir’aun saling berhadapan, dimana masing-masing kelompok melihat temannya {para pengikut Musa berkata,“Sesungguhnya kita benar-benar akan tersusul”} benar-benar akan disusul oleh Fir’aaun dan tentaranya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-62 “maka mereka dapat menyusulinya di waktu matahari terbit,” maksudnya, kaum Fir’aun dapat menyusuli kaum Musa pada waktu matahari terbit, dan mereka membuntutinya dari belakang dengan perasaan sangat marah dan jengkel. “maka saat kedua golongan itu saling melihat,” maksudnya, masing-masing lawan saling melihat satu sama lain, “berkatalah pengikut-pengikut Musa,” dengan nada mengadu kepadanya dan sedih, “sesungguhnya kita akan benar-benar tersusul,” lalu Musa menjawab untuk meyakinkan dan memberitakan janji Allah yang benar,”sekali-kali tidak” maksudnya, perkaranya bukan seperti yang kalian sebutkan, yaitu bahwa kalian pasti tersusul. “sesungguhnya Rabbku besertaku, kelak Dia akan memberi petunjuk kepadaku,” yaitu kepada sesuatu yang di situ terdapat keselamatanku dan keselamatan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 61: Ketika fir’aun dan bala tentaranya mengikuti Musa (bani israil) dan berdekatan kedua kubu, dan satu sama lain saling melihat, berkata bani israil kepada Musa : Sungguh fir’aun dan bala tentaranya mendekat dan mereka telah sampai sedangkan lautan ada dihadapan kita, dan tidak ada daya bagi kita melawan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 61",
    "description": "Maka ketika kedua golongan itu saling melihat, berkatalah pengikut-pengikut musa dengan nada gemetar dan takut 'kita benar-benar akan tersusul, oleh fir'aun dan bala tentaranya. \"62. Dia musa menjawab dengan tenang dan meyakinkan, 'sekali-kali tidak akan tersusul. Sesungguhnya tuhanku bersamaku, dia akan memberi petunjuk kepadaku. Tuhanku yang menyuruhku keluar dari mesir, maka pasti tuhanku jualah yang akan melindungi kita dengan cara-Nya sendiri. \" pada saat genting seperti inilah Allah memerintahkan kepada nabi musa untuk memukulkan tongkatnya ke laut. Allah sebenarnya bisa membelahkan laut tanpa harus ada penyebab berupa pukulan tongkat, tapi Allah ingin agar manusia tetap berusaha."
  }
]