[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada mereka, “Sekali-kali tidak. Nasib kita tidak seperti yang kalian sebutkan, kalian tidak akan bisa tersusul. Sesungguhnya tuhanku bersamaku dengan pertolonganNya, Dia akan menunjukkan kepadaku cara yang mendatangkan keselamatanku dan keselamatan kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Musa berkata kepada kaumnya, \"Sungguh apa yang kalian bayangkan tidak akan terjadi, sesungguhnya Rabbku besertaku untuk membantu dan menolongku, Dia akan memberiku petunjuk kepada jalan keselamatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. قَالَ (Musa menjawab) Musa berkata. كَلَّآ ۖ إِنَّ مَعِىَ رَبِّى(Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku) Sesungguhnya Tuhanku menyertaiku dengan pertolongan dan petunjuk. سَيَهْدِينِ(Dia akan memberi petunjuk kepadaku”) Yakni akan menunjukkan kepadaku jalan untuk menyelamatkan diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Musa berkata: “Tidak akan, mereka tidak akan menjangkau kita. Sesungguhnya Allah akan membimbingku menuju jalan yang menyelamatkan kita dari mereka”. Kata {Kalla} berfungsi untuk mencegah perkataan sebelumnya, yaitu janganlah kalian berkata begitu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Musa berkata {“Tidak} mereka tidak akan mencapai kita {Sesungguhnya Tuhanku bersamaku. Dia akan memberi petunjuk kepadaku”} dia akan menunjukkanku kepada jalan keberhasilan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-62 “maka mereka dapat menyusulinya di waktu matahari terbit,” maksudnya, kaum Fir’aun dapat menyusuli kaum Musa pada waktu matahari terbit, dan mereka membuntutinya dari belakang dengan perasaan sangat marah dan jengkel. “maka saat kedua golongan itu saling melihat,” maksudnya, masing-masing lawan saling melihat satu sama lain, “berkatalah pengikut-pengikut Musa,” dengan nada mengadu kepadanya dan sedih, “sesungguhnya kita akan benar-benar tersusul,” lalu Musa menjawab untuk meyakinkan dan memberitakan janji Allah yang benar,”sekali-kali tidak” maksudnya, perkaranya bukan seperti yang kalian sebutkan, yaitu bahwa kalian pasti tersusul. “sesungguhnya Rabbku besertaku, kelak Dia akan memberi petunjuk kepadaku,” yaitu kepada sesuatu yang di situ terdapat keselamatanku dan keselamatan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 62: Segeralah Musa menguatkan hati dan yakin sembari berkata : Sekali-kali tidaklah demikian, mereka tidak akan sampai dan mendekat kepada kita, karena Allah yang maha tinggi bersama kita, Dialah penolong kita, Yang memberi petunjuk kepada kita menuju jalan keberhasilan kita semua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 62",
    "description": "Dia musa menjawab dengan tenang dan meyakinkan, 'sekali-kali tidak akan tersusul. Sesungguhnya tuhanku bersamaku, dia akan memberi petunjuk kepadaku. Tuhanku yang menyuruhku keluar dari mesir, maka pasti tuhanku jualah yang akan melindungi kita dengan cara-Nya sendiri. \" pada saat genting seperti inilah Allah memerintahkan kepada nabi musa untuk memukulkan tongkatnya ke laut. Allah sebenarnya bisa membelahkan laut tanpa harus ada penyebab berupa pukulan tongkat, tapi Allah ingin agar manusia tetap berusaha. 63. Lalu kami wahyukan kepada musa, 'pukullah laut itu dengan tongkatmu. ' lalu nabi musa memukulkan tongkatnya ke laut, maka seketika itu terbelahlah lautan itu, menjadi daratan yang bisa dilalui oleh nabi musa. Daratan itu terdiri dari dua belas belahan, sesuai dengan kelompok yang ada pada bani israil. Dan setiap belahan seperti gunung yang besar."
  }
]