[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesengguhnya pada peristiwa yang terjadi tersebut benar-benar ada pelajaran besar yang menunjukkan kekuasaan Allah, namun kebanyakan pengikut Fir’aun tidak menjadi beriman meski terjadi tanda kekuasaanNya yang luar biasa tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Sesungguhnya pada peristiwa terbelahnya lautan di hadapan Musa, dan keselamatan dirinya, serta kebinasaan Fir'aun dan kaumnya; benar-benar merupakan bukti kebenaran Musa, tetapi kebanyakan orang yang bersama Fir'aun itu tidaklah beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67-68. Peristiwa pada besar berupa penenggelaman dan penyelamatan itu terdapat ibrah yang besar, akan tetapi mayoritas orang yang mendengar kisah itu tidak beriman kepada Allah dan para rasul-Nya!! Hai Rasulullah, Sungguh Tuhanmu Maha Perkasa dalam membalas perbuatan orang-orang yang mendustakan dan Maha Pengasih bagi orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. إِنَّ فِى ذٰلِكَ (Sesungguhnya pada yang demikian itu) Yakni apa yang terjadi antara Musa dan Fir’aun sampai batas ini adalah bukti yang paling jelas atas kekuasaan Allah dan kebesaran kuasa-Nya. وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ (tetapi kebanyakan mereka tidak beriman) Yakni kebanyakan orang-orang yang bersama Fir’aun itu bukanlah orang-orang beriman, tidak beriman dari mereka kecuali sedikit seperti Asiyah istri Fir’aun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Sesungguhnya dalam azab penenggelaman itu terdapat nasehat, pelajaran dan tanda yang agung atas kekuasaan Allah yang sangat luar biasa. Dan kebanyakan orang-orang Mesir yang ikut bersama Fir’aun itu tidak beriman. Tidak ada yang beriman dari keluarga Fir’aun kecuali Asiyah istri Fir’aun dan ayahnya (Asiyah) yang bernama Hizqil serta Maryam binti Dzamus yang menunjukkan Tabut nabi Yusuf AS."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya pada yang demikian itu benar-benar terdapat tanda, dan kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63-68 “lalu kami wahyukan kepada Musa, ’pukullah lautan itu dengan tongkatmu’.” Dan Musa pun memukulkannya, “maka terbelahlah lautan itu,” menjadi dua belas jalan, “dan tiap-tiap belahan adalah seperti bukit,” maksudnya, seperti gunung “yang besar,” lalu Musa dan kaumnya memasukinya. ”dan disanalah kami dekatkan,” maksudnya, di tempat itu, ”golongan yang lain,” yaitu fir’aun [bersama] para pengikutnya. Kami dekatkan mereka dan Kami masukkan mereka ke jalan yang dilewati oleh Musa bersama pengikutnya. “dan kami selamatkan Musa dan orang-orang yang besertanya semuanya,” mereka semuanya keluar dari lautan itu, tidak seorangpun yang ketinggalan, “kemudian kami tenggelamkan golongan yang lain itu,” tidak seorangpun yang tidak tenggelam. ”sesungguhnya pada yang demikian itu merupakan suatu tanda,” yang luar biasa, yang menunjukkan kebenaran ajaran yang diajarkan Musa dan kebatilan yang dianut oleh fir’aun beserta para pengikutnya, ”tetapi kebanyakan mereka tidak beriman,” sekalipun sudah ada tanda-tanda bukti yang mengantarkan kepada iman disebabkan hati mereka telah rusak. “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Mhapenyayang,” yang dengan keperkasaanNya, Dia telah membinasakan orang-orang kafir yang mendustakan, dan dengan rahmatNya, Dia telah menyelamatkan Musa beserta para pengikutnya seluruhnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 67: 67-68. Kemudian Allah akhiri ayat ini dengan jelas bahwa fir’aun dan bala tentaranya sebagai tanda-tanda yang nyata, dalil yang jelas atas kuasa Allah dan atas benarnya apa yang datang kepada Musa serta bathilnya apa yang di sisi fir’aun dan kaumnya. Dengan itu semua sungguh kebanyakan kaum fir’aun tetap tidak seluruhnya beriman dengan jujur. Ketahuilah wahai Nabi Allah, sesungguhnya Rabbmu, Dialah sungguh maha kuat yang maha kuasa atas urusanmu, dan dengan kemuliaan-Nya, Allah binasakan orang-orang yang mendustakan dan sombong, Dialah yang maha pengasih kepada hambanya yang beriman, di mana Allah menjadikan mereka berhasil, menjaga mereka dan memudahkan jalan hidayah bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penenggelaman Fir’aun dan kaumnya. Ada pula yang menafsirkan dengan terdapat pelajaran bagi orang-orang yang datang setelahnya, atau terdapat bukti yang besar yang menunjukkan benarnya apa yang dibawa Nabi Musa ‘alaihis salam dan batilnya apa yang dipegang oleh Fir’aun dan kaumnya selama ini. Yakni orang-orang Qibthi. Meskipun bukti-bukti telah ditunjukkan. Ada yang mengatakan, bahwa tidak ada yang beriman dari kalangan mereka selain Asiyah istri Fir’aun, Hazqil dari kalangan keluarga Fir’aun, dan Maryam binti Namusa yang menunjukkan tulang-belulang Nabi Yusuf (yakni kuburnya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 67",
    "description": "Sungguh, pada yang demikian itu, yaitu binasanya orang yang durhaka dan selamatnya orang yang beriman, terdapat suatu tanda kekuasaan Allah yang demikian besar, tetapi kebanyakan mereka tidak beriman. 68. Dan sesungguhnya tuhanmu dialah yang mahaperkasa mahakuat atas segala sesuatu, tidak ada yang bisa mengalahkan-Nya, maha penyayang bagi mereka yang beriman dan mau kembali ke jalan Allah."
  }
]