[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Tuhanmu, Dia benar-benar Mahaperkasa lagi Maha Penyayang; dengan sifat keperkasaanNya, Dia membinasakan orang-orang kafir yang mendustakan, dan dengan sifat rahmatNya, Dia menyelamatkan Musa dan orang-orang yang bersamanya semuanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Dan sesungguhnya Rabbmu -wahai Rasul- benar-benar Dia lah Yang Maha Perkasa, yang membalas kejahatan para musuh-musuh-Nya, lagi Maha Penyayang terhadap mereka yang bertobat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Dan sesungguhnya Tuhanmu itu Maha Perkasa lagi Maha Membalas musuh-musuhNya, serta Maha Penyayang bagi para kekasihNya yang beriman kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang benar-benar Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63-68 “lalu kami wahyukan kepada Musa, ’pukullah lautan itu dengan tongkatmu’.” Dan Musa pun memukulkannya, “maka terbelahlah lautan itu,” menjadi dua belas jalan, “dan tiap-tiap belahan adalah seperti bukit,” maksudnya, seperti gunung “yang besar,” lalu Musa dan kaumnya memasukinya. ”dan disanalah kami dekatkan,” maksudnya, di tempat itu, ”golongan yang lain,” yaitu fir’aun [bersama] para pengikutnya. Kami dekatkan mereka dan Kami masukkan mereka ke jalan yang dilewati oleh Musa bersama pengikutnya. “dan kami selamatkan Musa dan orang-orang yang besertanya semuanya,” mereka semuanya keluar dari lautan itu, tidak seorangpun yang ketinggalan, “kemudian kami tenggelamkan golongan yang lain itu,” tidak seorangpun yang tidak tenggelam. ”sesungguhnya pada yang demikian itu merupakan suatu tanda,” yang luar biasa, yang menunjukkan kebenaran ajaran yang diajarkan Musa dan kebatilan yang dianut oleh fir’aun beserta para pengikutnya, ”tetapi kebanyakan mereka tidak beriman,” sekalipun sudah ada tanda-tanda bukti yang mengantarkan kepada iman disebabkan hati mereka telah rusak. “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Mhapenyayang,” yang dengan keperkasaanNya, Dia telah membinasakan orang-orang kafir yang mendustakan, dan dengan rahmatNya, Dia telah menyelamatkan Musa beserta para pengikutnya seluruhnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 68: 67-68. Kemudian Allah akhiri ayat ini dengan jelas bahwa fir’aun dan bala tentaranya sebagai tanda-tanda yang nyata, dalil yang jelas atas kuasa Allah dan atas benarnya apa yang datang kepada Musa serta bathilnya apa yang di sisi fir’aun dan kaumnya. Dengan itu semua sungguh kebanyakan kaum fir’aun tetap tidak seluruhnya beriman dengan jujur. Ketahuilah wahai Nabi Allah, sesungguhnya Rabbmu, Dialah sungguh maha kuat yang maha kuasa atas urusanmu, dan dengan kemuliaan-Nya, Allah binasakan orang-orang yang mendustakan dan sombong, Dialah yang maha pengasih kepada hambanya yang beriman, di mana Allah menjadikan mereka berhasil, menjaga mereka dan memudahkan jalan hidayah bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan keperkasaan-Nya, Dia binasakan orang-orang kafir yang mendustakan. Kepada orang-orang mukmin, sehingga mereka diselamatkan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 68",
    "description": "Dan sesungguhnya tuhanmu dialah yang mahaperkasa mahakuat atas segala sesuatu, tidak ada yang bisa mengalahkan-Nya, maha penyayang bagi mereka yang beriman dan mau kembali ke jalan Allah. 69. Ayat-ayat berikut ini menyebutkan beberapa kisah nabi ibrahim ketika menyeru kaumnya untuk mengesakan Allah. Dan bacakanlah kepada mereka, kaum musyrik mekah, kisah perjuangan nabi ibrahim. Kaum musyrik menganggap bahwa mereka adalah penerus agama nabi ibrahim dan anaknya ismail, padahal hal itu sama sekali bertentangan dengan agama ibrahim yang sebenarnya yaitu agama tauhid."
  }
]