[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Apakah mereka itu mendustakan, sedang mereka tidak memperhatikan bumi di mana Kami menumbuhkan padanya semua jenis tanaman yang indah lagi berguna, yang tidak berkuasa menumbuhkannya kecuali Tuhan semesta alam? Sesungguhnya pada perkara ditumbuhkannya tanaman-tanaman di muka bumi benar-benar terkandung bukti petunjuk yang jelas tentang kesempurnaan Kuasa Allah, dan kebanyakan manusia tidak beriman. Dan sesungguhnya Tuhanmu,benar-benar Dia-lah Dzat Yang Mahaperkasa atas segala makhluk, juga Mahapenyayang, yang rahmatNya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Apakah mereka semua akan terus-terusan berada dalam kekafiran dan tidak mau memperhatikan bumi, berapa banyak Kami tumbuhkan di bumi itu berbagai macam tumbuh-tumbuhan; yang indah dipandang dan banyak manfaatnya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Tidakkah mereka melihat keajaiban-keajaiban di bumi; Kami menumbuhkan berbagai jenis tumbuhan yang indah dan memiliki banyak manfaat? Sungguh penumbuhan itu merupakan bukti yang jelas atas besarnya kekuasaan Allah. Sungguh mayoritas manusia tidak beriman kepada Allah, dan Tuhanmu Maha Perkasa dalam kerajaan-Nya dan Maha Pengasih bagi makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. مِن كُلِّ زَوْجٍ كَرِيمٍ (pelbagai macam tumbuh-tumbuhan yang baik?) Yakni jadi segala jenis yang bermanfaat yang tidak mungkin ditumbuhkan oleh selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Tidakkah mereka melihat betapa menakjubkannya bumi itu. Banyak yang telah Kami tumbuhkan di dalamnya dari setiap jenis pohon dan tanaman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan bumi, betapa banyak Kami telah menumbuhkan di sana setiap jenis yang baik} jenis yang baik yang memiliki banyak manfaat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7 Allah berfirman seraya mengingatkan untuk tafakkur (merenung) yang berguna bagi pelakunya, ”apakah mereka tidak memperhatikan bumi, berapa banyak Kami menumbuhkan di bumi itu berbagai macam tumbuh-tumbuhan yang baik?” dari berbagai macam tumbuh-tumbuhan, yang indah dipandang dan mulia manfaatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 7: 5-7. Allah kemudian mengabarkan bahwasanya mereka orang-orang kafir tidaklah datang kepada mereka suatu yang mengada-ada dari Al Qur’an, yaitu bicara akan turunnya Al Qur’an kecuali dengan kedustaan, olok-olok serta penolakan darinya. Mereka berdusta atas nama Al Qur’an, maka akan datang berita akan adzab kepada mereka yang mereka akan mendapatkannya atas kedustaan dan olok-olok mereka. Kemudian Allah mengabarkan kepada mereka orang-orang yang mengolok-olok yang mendustakan akan hari kebangkitan dengan melihat ke bumi bagaimana bumi dapat hidup dengan hujan, dan Allah jadikan padanya sekelompok tumbuh-tumbuhan yang baik, indah dan padanya terdapat jenis laki-laki dan perempuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman mengingatkan mereka untuk berpikir karena yang demikian bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 7",
    "description": "Allah kemudian mengajak mereka untuk belajar dari alam seluruh, agar mereka tahu bahwa hanya Allah saja yang berhak untuk disembah. Dan apakah mereka yaitu orang musyrik itu tidak memperhatikan apa yang mereka lihat di hamparan bumi, betapa banyak kami tumbuhkan di bumi itu berbagai macam pasangan tumbuh-tumbuhan yang baik' yang membawa banyak sekali kemanfaatan bagi manusia. Bukankah itu pertanda atas kekuasaan Allah, dan anugerah-Nya yang tak terhingga kepada manusia'8. Sungguh, pada yang demikian itu terdapat tanda kebesaran Allah yang mampu menghidupkan tanah yang gersang, menciptakan berbagai ragam tanaman, dan tumbuh-tumbuhan. Tetapi betapa pun banyaknya bukti-bukti kekuasaan Allah yang ada di hadapan mereka, kebanyakan mereka tidak beriman, karena kedengkian, takabur, dan ingin mempertahankan status sosial mereka. Akhirnya Allah mengunci hati mereka."
  }
]