[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "69-70. Dan ceritakanlah pula kepada orang-orang kafir (wahai Rasul) kisah Ibrahim ketika ia berkata kepada ayah dan orang-orang dari kaumnya, “Apakah yang kalian sembah?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Ketika ia berkata kepada bapaknya Āzar dan kaumnya, \"Apakah yang kalian sembah selain Allah itu?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِۦ مَا تَعْبُدُونَ (Ketika ia berkata kepada bapaknya dan kaumnya: “Apakah yang kamu sembah?”) Ibrahim mengetahui bahwa mereka menyembah berhala-berhala, namun ia hanya ingin menegakkan hujjah atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Ketika dia berkata kepada ayahnya, Azar dan kaumnya yang merupakan para penyembah berhala di negeri Babilonia: “Apakah yang kalian sembah?” Pertanyaan terhadap mereka itu untuk menyadarkan mereka bahwa sesungguhnya apa yang mereka sembah berupa berhala itu tidak layak untuk disembah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia berkata kepada bapak dan kaumnya,“Apa yang kalian sembah”} apa yang kalian sembah selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-71 maksudnya, bacakanlah wahai Muhammad, kepada manusia berita tentang Ibrahim al-khalil dan ceritanya yang sangat berharga, terutama dalam kondisi ini. Dan bila tidak demikian, dia masih mempunyai banyak berita lainnya. Akan tetapi diantara berita tentangnya yang sangat menarik dan sangat bagus adalah berita yang mencakup kerasulan dan dakwahnya kepada kaumnya serta perdebatanya dengan mereka tentang batilnya keyakinan yang mereka anut. Maka dari itu ungkapannya di sini diimbuhi dengan zharaf (keterangan waktu), seraya berfirman,” ketika dia berkata kepada bapaknya dan kaumnya, ‘apakah yang kamu sembah?’ mereka menjawab, ”dengan nada bangga terhadap peribadatan mereka, ”kami menyembah berhala-berhala,” yang kami pahat dan kami buat dengan tangan kami sendiri, “dan kami senantiasa tekun menyembahnya,” maksudnya kami selalu menyembahnya pada kebanyakan waktu kami."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 70: 69-71. Kisahkan wahai Nabi Allah kepada orang-orang kafir dari kaummu kabar Ibrahim yang suatu ketika berkata kepada bapaknya dan kaumnya dengan maksud dakwah dan menegakkan hujjah bagi mereka : Apa yang kalian sembah wahai kaumku ? Sedangkau Ibrahim adalah mengetahui akan kaumnya yang berada dalam kesesatan, mereka mengibadahi berhala dan bintang-bintang, akan tetapi mereka menginginkan penjelasan dari Ibrahim yang bahwasanya mereka adalah orang-orang yang sombong, yang mneyembah sesuatu yang tidak memiliki bahaya maupun manfaat, dan bahwasanya usaha mereka (dalam penyembahan) adalah kesia-siaan. Mereka berkata : Kami mengibadahi berhala yang dibuat dari bebatuan dan yang serupa dengannya, kami beri’tikaf dan mendekatkan diri kepada berhala-berhala tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 70",
    "description": "Ketika dia ibrahim berkata kepada ayahnya dan kaumnya, yang me-nyembah berhala di irak selatan, 'apakah yang kamu sembah' bukankah itu benda mati yang dibuat dengan tanganmu sendiri'\"71. Dan barangsiapa bertobat dengan hati yang ikhlas dan mengerjakan kebajikan, sebagai bukti pertobatannya, maka sesungguhnya dia bertobat kepada Allah dengan tobat yang sebenar-benarnya. Dia menyesal dengan penyesalan yang mendalam atas perbuatannya, mengakhiri perilaku buruknya dan berjanji tidak akan mengulangi lagi perbuatan itu. Inilah tobat yang akan diterima oleh Allah."
  }
]