[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "72-73. Ibrahim berkata mengingatkan kerusakan keyakinan mereka itu, “Apakah mereka itu mendengar doa permohonan kalian ketika kalian menyeru mereka, atau mereka mendatangkan suatu kemanfaatan bagi kalian ketika kalian menyembah mereka, atau mereka akan menimpakan pada kalian suatu mara bahaya bila kalian meninggalkan peribadatan kepada mereka?’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Atau dapatkah mereka memberi kalian manfaat bila kalian menaati mereka, atau memberi kalian mudarat bila kalian tidak menaatinya?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. أَوْ يَنفَعُونَكُمْ (atau (dapatkah) mereka memberi manfaat kepadamu) Dengan suatu manfaat. أَوْ يَضُرُّونَ(atau memberi mudharat?”) Yakni apakah mereka akan memberi mudharat kepada kalian jika kalian tidak menyembah mereka? Mereka tidak dapat mendengar atau memberi manfaat dan mudharat, maka tidak ada alasan untuk menyembah mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Ataukah mereka (berhala) akan memberi manfaat saat kalian sembah atau memberi kerugian saat tidak kalian sembah. Dan apabila mereka (berhala) tidak bisa mendengar, memberi manfaat dan memberi kerugian, maka tidak ada alasan untuk menyembahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau memberi manfaat atau mudarat kepada kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72-74 maka Ibrahim berkata kepada mereka untuk menjelaskan bahwa berhala-berhala itu sama sekali tidak berhak di sembah, “apakah berhala-berhala itu mendengar (doa) mu sewaktu kamu berdoa?” lalu mereka mengabulkan doa kalian, menghilangkan kesusahan kalian dan melenyapkan semua hal yang tidak kalian suka dari kalian, “atau (dapatkah) mereka memberi manfaat kepadamu atau memberi mudarat?” lalu mereka mengakui kalau semua itu tidak ada sama sekali padanya. Jadi, ia tidak dapat mendengar doa, tidak dapat memberikan manfaat dan tidak juga menimpakan bahaya! Oleh karenanya, setelah Ibrahim menghancurkan berhala-berhala itu, dia berkata, “sebenarnya patung yang besar itu yang melakukannya, maka tanyakanlah kepada berhala itu, jika mereka dapat berbicara,” (al-anbiya:63) Mereka berkata kepadanya, “sesungguhnya kamu telah mengetahui bahwa berhala-berhala itu tidak dapat berbicara,”(al-anbiya:65) Maksudnya, ini adalah suatu perkara yang sudah pasti drai kondisi berhala, sudah tidak bisa dipermasalahkan dan tidak diragukan lagi. Lalu mereka kembali kepada taqlid (ikut secara membabi buta) kepada nenek moyang mereka yang sesat, maka mereka berkata, ”sebenarnya kami mendapati nenek moyang kami berbuat demikian,” lalu kami mengikuti mereka dalam hal ini, dan kami menelusuri jalan mereka dan kami lestarikan tradisi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 73: 72-73. Berkata Ibrahim kepada mereka : Apakah kalian pernah mendengar (perkataan) berhala ini jika kalian berdoa kepada mereka ? Apakah memberi manfaat pada kalian jika kalian meminta manfaat padanya ? Apakah berhala itu membahayakan dan memusuhi kalian jika kalian tidak lagi mengibadahinya ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika kamu menyembahnya. Jika kamu tidak menyembahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 73",
    "description": "\"atau, dapatkah mereka memberi manfaat kepada kamu seperti rezeki, jika kamu menyembahnya atau mencelakakan kamu jika kamu tidak menyembahnya'\"74. Mereka menjawab, 'tidak, mereka tidak memberikan kemanfaatkan dan mendatangkan bahaya, tetapi kami dapati nenek moyang kami berbuat begitu. ' mereka berbangga dengan perilaku seperti itu. Inilah bentuk taklid buta, yaitu mengikuti cara beribadah orang lain walaupun hal itu salah."
  }
]