[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-82. Ibrahim berkata, “Apakah kalian sudah melihat dengan penuh perhatian apa yang kalian sembah berupa berhala-berhala yang tidak mendengar, tidak memberi manfaat dan tidak dapat mendatangkan mudarat terhadap kalian dan nenek moyang kalian terdahulu sebelum kalian? Sesungguhnya apa yang kalian sembah selain Allah itu adalah musuh-musuhku, dan Tuhan alam semesta dan Pemilik urusan mereka, itulah semata yang aku sembah. Dia-lah Yang menciptakanku dalam bentuk terbaik, lalu Dia menunjukkan kepadaku jalan menuju kemaslahatan dunia dan akhirat. Dan Dia-lah Yang melimpahkan kepadaku kenikmatan makanan dan minuman. Dan apabila suatu penyakit menimpaku, maka Dia-lah yang menyembuhkanku dan menyehatkanku darinya. Dan Dia-lah Yang mematikanku di dunia dengan mencabut ruhku, kemudian Dia akan menghidupkanku pada Hari Kiamat. Tidak ada yang kuasa untuk melakukan semua itu selain Dia. Dan Dia-lah satu-satunya yang aku amat berharap akan mengampuni dosa-dosaku pada Hari Pembalasan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Karena sesungguhnya mereka semua adalah musuhku, sebab semuanya hanyalah kebatilan, kecuali Allah yang merupakan Tuhan seluruh makhluk,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. فَإِنَّهُمْ عَدُوٌّ لِّىٓ (karena sesungguhnya apa yang kamu sembah itu adalah musuhku) Yakni mereka adalah musuh-musuhku, serta aku telah menjadikan permusuhan dengan mereka adalah jalan hidupku, aku akan memusuhi mereka hingga aku dapat menghilangkan penyembahan mereka dari muka bumi. إِلَّا رَبَّ الْعٰلَمِينَ (kecuali Tuhan Semesta Alam) Namun Tuhan semesta alam adalah pelindungku di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Sesungguhnya mereka itu musuh bagiku sehingga aku tidak akan menyembah mereka (berhala), namun aku menyembah Allah SWT, Tuhan seluruh alam dari golongan manusia dan jin. ‘Aduwun digunakan untuk menyebut satu orang atau lebih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya mereka itu adalah musuh} musuh {bagiku kecuali Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-82 lalu Ibrahim berkata kepada mereka, ”kalian dan nenek moyang kalian semuanya adalah penentang dalam perkara [ini], dan pembicaraan bersama orang-orang di atas adalah sama,” maka apakah kamu telah memperhatikan apa yang sellau kamu sembah, kamu dan nenek moyang kamu yang dahulu? Karena sesungguhnya semua itu adalah musuhku,” maka silahkan mereka menimpakan bahaya apa pun terhadapku, dan silahkan mereka melakukan tipu daya terhadapku, maka pasti mereka tidak akan mampu melakukannya, “kecuali Rabb semesta alam, Yang telah menciptakanku, maka Dia-lah yang menunjukiku.” Dia-lah [semata] yang memberikan nikmat penciptaan dan nikmat hidayah untuk kemaslahatan agam dan dunia. Llau dia menyebutkan secara khusus sebagian dari hal-hal yang sudah pasti, seraya berkata,”dan yang memberi makan dan minum kepadaku, dan apabila aku sakit, Dia-lah yang menyembuhkanku, dan yang akan mematikanku, kemudian akan menghidupkanku (kembali), dan yang amat kuinginkan akan mengampuni kesahanku pada Hari kiamat,” Dia-lah semata yang bisa melakukan itu semua sendirian, maka dari itu wajib diesakan dengan ibadah dan ketaatan, sedangkan berhala-berhala yang tidak bisa menciptakan, tidak bisa menyembuhkan, tidak bisa memberi makan dan tidak bisa memberi minum, tidak dapat mematikan dan tidak dapat menghidupkan, tidak berguna bagi penyembahnya, baik dalam menghilangkan kesusahan atau pun memberikan ampunan dosa itu harus ditinggalkan. Ini adalah dalil yang sangat akurat dan hujjah yang mematahkan di mana kalian dan nenek moyang kalian tidak kuasa menentangnya, maka itu membuktikan keikutsertaan kalian dalam kesesatan dan dalam meninggalkan jalan hidayah dan jalan yang lurus. Allah berfirman, “dan dia dibantah oleh kaumnya. Dia berkata, ’apakah kamu hendak membantahku tentang Allah, padahal sesungguhnya Allah telah memberi petunjuk kepadaku…” (al-an’am:80)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 77: 75-77. Ketika Ibrahim yakin bahwasanya mereka sesat dari jalan kebenaran, ia mengikrarkan bahwasanya ia berlepas diri dari apa yang mereka dan bapak-bapak mereka ibadahi, mereka berkata dengan maksud pengingkaran : Tidakkah kalian wahai kaum mengetahui apa yang kalian dan bapak-bapak kalian sembah dari berhala-berhala ini yang tidak memberi manfaat maupun bahaya; Karena sesungguhnya berhala-berhala tersebut adalah musuh bagiku, sebab berhala-berhala tersebut adalah batil, dan aku tidaklah menyembah kecuali hanya kepada Tuhan semesta alam saja tanpa menyekutukan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni oleh karena itu, suruh mereka menimpakan bahaya kepadaku. Yakni Dialah yang aku sembah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 77",
    "description": "Sesungguhnya mereka, yakni apa yang kamu sembah, itu musuhku, karena mereka adalah setan dalam bentuk berhala lain halnya tuhan seluruh alam yang banyak sekali memberikan anugerah kepadaku dan kepada kamu sekalian. Nabi ibrahim menyebutkan satu persatu anugerah tuhannya agar mereka sadar akan kekeliruan mereka dan mengikuti ajakan nabi ibrahim. 78. Yaitu zat yang telah menciptakan aku dalam sebaik-baiknya bentuk dan aku diberi kesempatan dalam hidupku untuk menyembah Allah, maka dia yang memberi petunjuk kepadaku, menuju ke jalan yang benar melalui wahyu yang diberikan kepadaku."
  }
]