[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-82. Ibrahim berkata, “Apakah kalian sudah melihat dengan penuh perhatian apa yang kalian sembah berupa berhala-berhala yang tidak mendengar, tidak memberi manfaat dan tidak dapat mendatangkan mudarat terhadap kalian dan nenek moyang kalian terdahulu sebelum kalian? Sesungguhnya apa yang kalian sembah selain Allah itu adalah musuh-musuhku, dan Tuhan alam semesta dan Pemilik urusan mereka, itulah semata yang aku sembah. Dia-lah Yang menciptakanku dalam bentuk terbaik, lalu Dia menunjukkan kepadaku jalan menuju kemaslahatan dunia dan akhirat. Dan Dia-lah Yang melimpahkan kepadaku kenikmatan makanan dan minuman. Dan apabila suatu penyakit menimpaku, maka Dia-lah yang menyembuhkanku dan menyehatkanku darinya. Dan Dia-lah Yang mematikanku di dunia dengan mencabut ruhku, kemudian Dia akan menghidupkanku pada Hari Kiamat. Tidak ada yang kuasa untuk melakukan semua itu selain Dia. Dan Dia-lah satu-satunya yang aku amat berharap akan mengampuni dosa-dosaku pada Hari Pembalasan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Yaitu Rabb Yang telah menciptakan aku, maka Dia lah yang menunjukkan kepadaku kebaikan dunia Akhirat,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. الَّذِى خَلَقَنِى فَهُوَ يَهْدِينِ ((yaitu Tuhan) Yang telah menciptakan aku, maka Dialah yang memberiku petunjuk) Allah memberiku petunjuk kepada kebaikan agama dan dunia. Ibrahim menyifati Tuhannya dengan sesuatu yang menjadikan-Nya berhak untuk disembah, sebab ia menyebutkan penciptaan, hidayah, dan rezeki yang ia sebutkan dalam ucapannya: وَالَّذِى هُوَ يُطْعِمُنِى وَيَسْقِينِ (dan Tuhanku, Yang memberi makan dan minum kepadaku), serta menyebutkan menjauhkan dari penyakit, mendatangkan kesembuhan, mematikan, dan menghidupkan dalam ucapannya: وَالَّذِى يُمِيتُنِى ثُمَّ يُحْيِينِ وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ (dan apabila aku sakit, Dialah Yang menyembuhkan aku, dan Yang akan mematikan aku, kemudian akan menghidupkan aku) dan Dia mengampuni dosa-dosa. Semua hal ini merupakan kenikmatan-kenikmatan Allah yang wajib disyukuri dengan berbagai macam cara, dan yang paling mulia dan utama adalah dengan menyembah-Nya. Nabi Ibrahim menisbatkan penyakit pada dirinya (yakni dengan mengatakan ‘apabila aku sakit’ dan tidak mengatakan ‘jika Allah memberiku penyakit’) untuk menjaga adab dengan Allah, meskipun penyakit dan lainnya semua datang dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Allahlah Dzat yang menciptakanku, lalu membimbingku kepada kebenaran agama dan dunia. Dua hal itu (Dzat yang menciptakan dan membimbing) adalah sifat Allah yang menciptakan dan memberi petunjuk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang telah menciptakanku. Maka Dia yang memberiku petunjuk} membimbingku kepada hal yang baik di dunia dan akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-82 lalu Ibrahim berkata kepada mereka, ”kalian dan nenek moyang kalian semuanya adalah penentang dalam perkara [ini], dan pembicaraan bersama orang-orang di atas adalah sama,” maka apakah kamu telah memperhatikan apa yang sellau kamu sembah, kamu dan nenek moyang kamu yang dahulu? Karena sesungguhnya semua itu adalah musuhku,” maka silahkan mereka menimpakan bahaya apa pun terhadapku, dan silahkan mereka melakukan tipu daya terhadapku, maka pasti mereka tidak akan mampu melakukannya, “kecuali Rabb semesta alam, Yang telah menciptakanku, maka Dia-lah yang menunjukiku.” Dia-lah [semata] yang memberikan nikmat penciptaan dan nikmat hidayah untuk kemaslahatan agam dan dunia. Llau dia menyebutkan secara khusus sebagian dari hal-hal yang sudah pasti, seraya berkata,”dan yang memberi makan dan minum kepadaku, dan apabila aku sakit, Dia-lah yang menyembuhkanku, dan yang akan mematikanku, kemudian akan menghidupkanku (kembali), dan yang amat kuinginkan akan mengampuni kesahanku pada Hari kiamat,” Dia-lah semata yang bisa melakukan itu semua sendirian, maka dari itu wajib diesakan dengan ibadah dan ketaatan, sedangkan berhala-berhala yang tidak bisa menciptakan, tidak bisa menyembuhkan, tidak bisa memberi makan dan tidak bisa memberi minum, tidak dapat mematikan dan tidak dapat menghidupkan, tidak berguna bagi penyembahnya, baik dalam menghilangkan kesusahan atau pun memberikan ampunan dosa itu harus ditinggalkan. Ini adalah dalil yang sangat akurat dan hujjah yang mematahkan di mana kalian dan nenek moyang kalian tidak kuasa menentangnya, maka itu membuktikan keikutsertaan kalian dalam kesesatan dan dalam meninggalkan jalan hidayah dan jalan yang lurus. Allah berfirman, “dan dia dibantah oleh kaumnya. Dia berkata, ’apakah kamu hendak membantahku tentang Allah, padahal sesungguhnya Allah telah memberi petunjuk kepadaku…” (al-an’am:80)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 78: Berkata Ibrahim : Sesungguhnya aku tidaklah mengibadahi kecuali Tuhan semesta alam yang menciptakanku dari ketiadaan, yang menunjukiku dan memudahkanku menuju jalan kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 78",
    "description": "Yaitu zat yang telah menciptakan aku dalam sebaik-baiknya bentuk dan aku diberi kesempatan dalam hidupku untuk menyembah Allah, maka dia yang memberi petunjuk kepadaku, menuju ke jalan yang benar melalui wahyu yang diberikan kepadaku. 79. Dan yang memberi makan dan minum kepadaku, melalui rezeki dari air hujan yang menyuburkan tanah sehingga menumbuhkan tumbuh-tumbuhan. Dari situlah aku makan dan minum."
  }
]