[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Apakah mereka itu mendustakan, sedang mereka tidak memperhatikan bumi di mana Kami menumbuhkan padanya semua jenis tanaman yang indah lagi berguna, yang tidak berkuasa menumbuhkannya kecuali Tuhan semesta alam? Sesungguhnya pada perkara ditumbuhkannya tanaman-tanaman di muka bumi benar-benar terkandung bukti petunjuk yang jelas tentang kesempurnaan Kuasa Allah, dan kebanyakan manusia tidak beriman. Dan sesungguhnya Tuhanmu,benar-benar Dia-lah Dzat Yang Mahaperkasa atas segala makhluk, juga Mahapenyayang, yang rahmatNya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Sesungguhnya pada proses penciptaan tetumbuhan dengan spesiesnya; benar-benar terdapat suatu tanda paling jelas akan kekuasaan Żat yang menciptakannya dalam menghidupkan makhluk yang telah mati, namun sungguh kebanyakan mereka sama sekali tidak beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. إِنَّ فِى ذٰلِكَ لَاٰيَةً ۖ (Sesungguhnya pada yang demikian itu benar-benar terdapat suatu tanda kekuasaan Allah) Yakni dalam penumbuhan tumbuhan di bumi itu terdapat bukti yang jelas atas kesempurnaan kuasa Allah dan kehebatan penciptaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dalam proses penumbuhan (tanaman) di bumi itu ada dalil yang menjelaskan tentang kesempurnaan kuasa dan kebijaksanaan Allah SWT dan kebanyakan manusia belum beriman kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya pada yang demikian itu terdapat tanda} dalil-dalil atas kuasa Allah {kebanyakan mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8 “sesungguhnya yang pada demikian itu benar-benar terdapat suatu tanda,” yang membuktikan kekuasaan Allah untuk menghidupkan kembali manusia-manusia yang sudah mati, sebagaimana Dia berkuasa menghidupkan bumi setelah ketandusannya. ”dan kebanyakan mereka tidak beriman,” seperti yang difirmankan Allah dalam ayat lain, ”dan sebagian besar manusia tidak akan beriman, walaupun kamu sangat menginginkannya.”(yusuf:103)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 8: 8-9. Allah kemudian mengakhiri ayat ini dengan penjelasan yang bahwasanya tidaklah keluar dari bumi dari macam-macam buah-buahan dan tumbuh-tumbuhan yang beranekan ragam kecuali sebagai tanda yang nyata atas kuasa Allah atas hari kebangkitan, juga akan dihidupkan kembali mayit dan mengembalikan mereka, dengan itu semua sungguh orang-orang musyrik yang mendustakan hari kebangkitan tetap tidak beriman dan membenarkan; Karena sebab mereka mencintai kekufuran atas keimanan; Karena sebab Allah (menurut sangkaan mereka) tidaklah membebani mereka (orang-orang kafir) dengan ibadah. Ketahuilah wahai Nabi Allah bahwasanya Tuhanmu adalah maha kuat, mampu atas untuk membinasakan para pendusta dan orang-orang yang sombong kepada para Nabi dan Rasul, Dialah yang maha suci yang memiliki banyak rahmat kepada hamba-Nya, dan di antara rahmat-Nya adalah menjadikan Nabi orang yang berhasil, beserta para pengikutnya dari orang-orang yang beriman, dan di antara rahmat-Nya adalah menunda dan tidak mensegerakan adzab agar mereka (orang-orang kafir) dapat bertaubat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni terdapat tanda yang membuktikan bahwa Allah mampu menghidupkan manusia yang telah mati sebagaimana Dia menghidupkan bumi setelah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 8",
    "description": "Sungguh, pada yang demikian itu terdapat tanda kebesaran Allah yang mampu menghidupkan tanah yang gersang, menciptakan berbagai ragam tanaman, dan tumbuh-tumbuhan. Tetapi betapa pun banyaknya bukti-bukti kekuasaan Allah yang ada di hadapan mereka, kebanyakan mereka tidak beriman, karena kedengkian, takabur, dan ingin mempertahankan status sosial mereka. Akhirnya Allah mengunci hati mereka. 9. Dan sungguh, tuhanmu dialah yang mahaperkasa, tidak akan terku-rangi kekuasaan-Nya oleh banyaknya orang-orang yang ingkar kepada-Nya, namun demikian, dia juga maha penyayang dengan tidak cepat menyiksa makhluk-Nya yang durhaka, tapi memberikan kesempatan kepada mereka untuk bertobat."
  }
]