[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ibrahim berkata memohon kepada Tuhannya, “Wahai Tuhanku, berilah aku anugerah ilmu dan pemahaman, dan masukkanlah aku kedalam golongan orang-orang yang shalih, dan himpunlah aku dan mereka di dalam surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Ibrahim lalu berdoa kepada Tuhannya, \"Wahai Rabbku! Berikanlah kepadaku pemahaman tentang agama-Mu, dan masukkanlah aku ke dalam golongan orang-orang yang saleh dari kalangan para nabi sebelumku dengan memasukkanku ke dalam Surga bersama mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Setelah mengungkapkan pernyataan ini, Ibrahim bermunajat kepada Allah dengan berdoa sebagaimana yang disebutkan dalam tujuh ayat ini: “Ya Tuhanku, ilhamkanlah kepadaku ilmu dan hikmah, dan jadikanlah aku termasuk golongan orang-orang yang shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. رَبِّ هَبْ لِى حُكْمًا (Ya Tuhanku, berikanlah kepadaku hikmah) Yakni dimaksud dengan hikmah adalah ilmu dan pemahaman. Pendapat lain mengatakan yakni kenabian dan risalah. وَأَلْحِقْنِى بِالصّٰلِحِينَ(dan masukkanlah aku ke dalam golongan orang-orang yang saleh) Yakni kumpulkanlah aku dengan para Nabi sebelumku di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Tuhanku, berilah aku hikmah, pemahaman dan ilmu yang baik. Dan kumpulkanlah aku bersama orang-orang yang sempurna amal shalihnya, yaitu para nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Tuhanku, berikanlah kepadaku hukum} ilmu dan pemahaman {dan pertemukanlah aku dengan orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-84 dan Ibrahim berdoa kepada Rabbnya, seraya mengatakan, “ya Rabbku, berikanlah kepadaku hikmah,” maksudnya, ilmu yang cukup yang dengannya aku dapat mengetahui hukum-hukum, halal dan haram, dan yang dengannya aku dapat memberikan keputusan di antara manusia, “dan masukanlah aku kedalam golongan orang-orang yang shalih,” termasuk saudara-saudaranya, para nabi dan para rasul. “dan jadikanlah untukku buah tutur yang baik bagi orang-orang (yang datang) kemudian,” maksudnya, jadikanlah untukku pujian yang baik yang terus berlangsung hingga akhir masa. Dan Allah pun mengabulkan doanya, lalu Dia karuniakan kepadanya ilmu dan hikmah sehingga dengannya dia menjadi rasul yang termulia, dan dimasukanNya ke dalam kelompok saudara-saudaranya, yaitu para rasul. Allah telah menjadikannya sebagai manusia yang dicintai, diterima, dimuliakan dan dipuji di dalam semua agama pada setiap waktu. Allah berfirman, “kami abadikan untuk Ibrahim itu (pujian yang baik) di kalangan orang-orang yang datang kemudian,(yaitu) ‘kesejahteraan dilimpahkan atas Ibrahim,’ demikianlah kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya dia termasuk hamba-hamba Kami yang beriamn,” (ash-shafat:108-111)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 83: 83-86. Kemudian Ibrahim berdoa kepada Rabbnya : Jadikanlah pada diriku wahai Rabbku, sebutan yang baik, dan pujian yang indah yang tersisa ketika aku telah wafat sampai hari kiamat. Dan Allah telah mengabulkan permintaannya. Kemudian ia berkata : Jadikanlah aku wahai Rabbku penghuni surga yang mereka mewarisi kenikmatan di dalamnya. Ibrahim berkata : Ampunilah bapakku karena ia termasuk orang-orang yang tersesat. Sungguh aku telah berjanji untuk memintakan ampun atas dirinya dari mu. Karena pada saat itu ketika Ibrahim berpisah dengan bapaknya Ibrahim mengatakan padanya : Aku akan meminta ampunan untukmu kepada Rabbku. Akan tetapi ketika jelas bahwasanya bapaknya adalah musuh Allah dan masih tetap di atas kekafiran ia berlepas diri dari bapaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ilmu yang banyak yang dengannya aku mengenal hukum-hukum, mengenal halal dan haram, dan dapat memutuskan masalah di antara manusia dengannya. Yaitu saudara-saudaranya dari kalangan para nabi dan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 83",
    "description": "Nabi ibrahim lantas berdoa untuk kebaikan dirinya, orang tuanya dan orang lain, baik di dunia maupun akhirat, 'ya tuhanku, berikanlah kepadaku ilmu yang bermanfaat dan pemahaman terhadap rahasia agama dan masukkanlah aku ke dalam golongan orang-orang yang saleh yang selalu berada pada jalan yang benar. 84. Dan jadikanlah aku buah tutur yang baik bagi orang-orang yang datang kemudian, Allah mengabulkan doa nabi ibrahim. Namanya tetap bersinar, sikapnya tetap diagungkan, keturunannya adalah para nabi dari bani israil yang terakhir adalah nabi Muhammad sallall'hu 'alaihi wa sallam."
  }
]