[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jadikanlah bagiku pujian yang baik dan kesan yang bagus ditengah orang-orang yang datang sepeninggalku hingga Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Dan jadikanlah diriku sebagai buah tutur dan pujian yang baik bagi orang-orang yang datang dalam kurun-kurun setelahku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84-89. Dan jadikanlah bagiku sebutan yang baik pada generasi-generasi yang datang setelahku. Dan jadikanlah diriku termasuk orang-orang yang berhak mewarisi kenikmatan surga. Dan ampunilah ayahku, Azar, karena dia termasuk orang-orang yang musyrik. Serta janganlah Engkau hinakan aku di hari kebangkitan, hari yang tidak bermanfaat lagi kepemilikan harta dan banyaknya keturunan, kecuali bagi orang yang menghadap Allah dengan hati yang bersih dari kesyirikan dan dosa-dosa besar.” Akan tetapi doa Ibrahim agar ayahnya diampuni tidak terkabulkan, karena ayahnya tetap dalam kekafiran. Abu Hurairah meriwayatkan, Rasulullah bersabda: “Ibrahim bertemu dengan ayahnya, kemudian dia berkata, ‘Ya Tuhanku, Engkau menjanjikanku untuk tidak menghinakanku di hari kebangkitan’. Maka Allah berfirman, ‘Aku mengharamkan surga bagi orang-orang kafir’.” (Shahih al-Bukhari 8/357, kitab tafsir surat as-Syu’ara, bab (ayat tersebut), no. 4769)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَاجْعَل لِّى لِسَانَ صِدْقٍ فِى الْاٰخِرِينَ (dan jadikanlah aku buah tutur yang baik bagi orang-orang (yang datang) kemudian) Yakni jadikanlah pujian yang baik bagiku pada orang-orang setelahku sampai hari kiamat. Dan Allah telah mengabulkan bagi Ibrahim hal itu, sebab setiap umat berpegang teguh padanya dan memuliakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Dan jadikanlah untukku pujian yang baik bagi generasi-generasi terakhir yang hidup setelahku sampai hari kiamat tiba. Pujian itu disesuaikan dengan melakukan amal shalih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jadikanlah aku sebagai buah tutur yang baik} pujian yang baik dan sebutan yang bagus {di kalangan orang-orang kemudian} di kalangan orang-orang yang datang setelahku sampai hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-84 dan Ibrahim berdoa kepada Rabbnya, seraya mengatakan, “ya Rabbku, berikanlah kepadaku hikmah,” maksudnya, ilmu yang cukup yang dengannya aku dapat mengetahui hukum-hukum, halal dan haram, dan yang dengannya aku dapat memberikan keputusan di antara manusia, “dan masukanlah aku kedalam golongan orang-orang yang shalih,” termasuk saudara-saudaranya, para nabi dan para rasul. “dan jadikanlah untukku buah tutur yang baik bagi orang-orang (yang datang) kemudian,” maksudnya, jadikanlah untukku pujian yang baik yang terus berlangsung hingga akhir masa. Dan Allah pun mengabulkan doanya, lalu Dia karuniakan kepadanya ilmu dan hikmah sehingga dengannya dia menjadi rasul yang termulia, dan dimasukanNya ke dalam kelompok saudara-saudaranya, yaitu para rasul. Allah telah menjadikannya sebagai manusia yang dicintai, diterima, dimuliakan dan dipuji di dalam semua agama pada setiap waktu. Allah berfirman, “kami abadikan untuk Ibrahim itu (pujian yang baik) di kalangan orang-orang yang datang kemudian,(yaitu) ‘kesejahteraan dilimpahkan atas Ibrahim,’ demikianlah kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya dia termasuk hamba-hamba Kami yang beriamn,” (ash-shafat:108-111)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 84: 83-86. Kemudian Ibrahim berdoa kepada Rabbnya : Jadikanlah pada diriku wahai Rabbku, sebutan yang baik, dan pujian yang indah yang tersisa ketika aku telah wafat sampai hari kiamat. Dan Allah telah mengabulkan permintaannya. Kemudian ia berkata : Jadikanlah aku wahai Rabbku penghuni surga yang mereka mewarisi kenikmatan di dalamnya. Ibrahim berkata : Ampunilah bapakku karena ia termasuk orang-orang yang tersesat. Sungguh aku telah berjanji untuk memintakan ampun atas dirinya dari mu. Karena pada saat itu ketika Ibrahim berpisah dengan bapaknya Ibrahim mengatakan padanya : Aku akan meminta ampunan untukmu kepada Rabbku. Akan tetapi ketika jelas bahwasanya bapaknya adalah musuh Allah dan masih tetap di atas kekafiran ia berlepas diri dari bapaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maka Allah Subhaanahu wa Ta'aala mengabulkan doanya, mengaruniakan kepadanya ilmu sehingga termasuk rasul-rasul yang paling utama, memasukkannya ke dalam golongan orang-orang yang saleh, menjadikannya diterima oleh manusia lagi dicintai, disebut kebaikannya dan dimuliakan di semua golongan dan di setiap zaman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 84",
    "description": "Dan jadikanlah aku buah tutur yang baik bagi orang-orang yang datang kemudian, Allah mengabulkan doa nabi ibrahim. Namanya tetap bersinar, sikapnya tetap diagungkan, keturunannya adalah para nabi dari bani israil yang terakhir adalah nabi Muhammad sallall'hu 'alaihi wa sallam. 85. \"dan jadikanlah aku termasuk orang yang mewarisi surga yang penuh kenikmatan yang tiada habis-habisnya, sebagai anugerah yang tak terhingga dari Allah."
  }
]