[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jadikanlah aku termasuk hamba-hambaMu yang mewarisi kenikmatan-kenikmatan surga.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Dan jadikanlah aku termasuk orang-orang yang mewarisi istana-istana Surga yang di dalamnya hamba-hamba-Mu yang mukmin meraih berbagai kenikmatan, serta tempatkanlah aku di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Dan jadikanlah aku termasuk orang-orang yang menikmati kenikmatan surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jadikanlah aku termasuk orang yang mewarisi surga yang penuh kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85 “dan jadikanlah aku termasuk orang-orang yang mempusakai surga yang penuh kenikmatan,” maksudnya termasuk penghuni surga yang diwaruskan oleh Allah kepada mereka. Maka Allah pun mengabulkan doanya, Dia pun mengangkat kedudukannya di dalam surga Na’im."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 85: 83-86. Kemudian Ibrahim berdoa kepada Rabbnya : Jadikanlah pada diriku wahai Rabbku, sebutan yang baik, dan pujian yang indah yang tersisa ketika aku telah wafat sampai hari kiamat. Dan Allah telah mengabulkan permintaannya. Kemudian ia berkata : Jadikanlah aku wahai Rabbku penghuni surga yang mereka mewarisi kenikmatan di dalamnya. Ibrahim berkata : Ampunilah bapakku karena ia termasuk orang-orang yang tersesat. Sungguh aku telah berjanji untuk memintakan ampun atas dirinya dari mu. Karena pada saat itu ketika Ibrahim berpisah dengan bapaknya Ibrahim mengatakan padanya : Aku akan meminta ampunan untukmu kepada Rabbku. Akan tetapi ketika jelas bahwasanya bapaknya adalah musuh Allah dan masih tetap di atas kekafiran ia berlepas diri dari bapaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 85",
    "description": "\"dan jadikanlah aku termasuk orang yang mewarisi surga yang penuh kenikmatan yang tiada habis-habisnya, sebagai anugerah yang tak terhingga dari Allah. 86. Nabi ibrahim adalah seorang yang sangat santun kepada orang tuanya, walaupun kafir. Dia berdoa untuk kebaikan ayahnya. \"dan ampunilah ayahku, sesungguhnya dia termasuk orang yang sesat, penyembah berhala. \" namun karena Allah melarang seseorang mendoakan orang kafir yang telah meninggal, nabi ibrahim tidak lagi melanjutkan doa untuk ayahnya."
  }
]