[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Doa dari Ibrahim ini adalah agar Allah menyelamatkan bapaknya dari kesesatan kepada hidayah, sehingga Dia mengampuni dan memaafkannya, sebagaimana yang pernah Ibrahim janjikan bagi bapaknya tersebut untuk mendoakan kebaikan baginya. Akan tetapi setelah jelas bagi Ibrahim, bahwa bapaknya itu terus-menerus di dalam kekafiran dan kesyirikan hingga dia mati, Ibrahim berlepas diri darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. “Dan ampunilah ayahku, karena sesungguhnya ia termasuk orang-orang yang sesat dari kebenaran karena berbuat kesyirikan.” Ibrahim mendoakan ayahnya sebelum mengetahui bahwa ayahnya merupakan salah seorang penghuni neraka Jaḥīm. Setelah beliau mengetahui hal ini secara jelas, beliau pun berlepas diri dari ayahnya dan tidak lagi mendoakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Dan ampunilah ayahku dengan menolongnya agar beriman dan mendapatkan hidayah. Sesungguhnya dia termasuk para pendosa yang menyimpang dari jalan yang lurus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ampunilah ayahku. Sesungguhnya dia termasuk orang-orang sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86 “dan ampunilah bapakku, karena sesungguhnya dia adalah termasuk golongan orang-orang yang sesat,” ini adalah doa (yang) dia panjatkan disebabkan janjinya kepada ayahnya yang telah dia katakan kepadanya, “aku akan meminta ampun bagimu kepada Rabbku. Sesungguhnya Dia sangat baik kepadaku,” (Maryam:47) Allah berfirman, “dan permintaan ampun dari Ibrahim (kepada Allah) untuk bapaknya, tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya itu. Maka tatkala jelas bagi Ibrahim bahwa bapaknya itu adalah musuh Allah, maka Ibrahim berlepas diri darinya. Sesungguhnya Ibrahim adalah seorang yang sangat lembut hatinya lagi penyantun.” (at-taubah:114)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 86: 83-86. Kemudian Ibrahim berdoa kepada Rabbnya : Jadikanlah pada diriku wahai Rabbku, sebutan yang baik, dan pujian yang indah yang tersisa ketika aku telah wafat sampai hari kiamat. Dan Allah telah mengabulkan permintaannya. Kemudian ia berkata : Jadikanlah aku wahai Rabbku penghuni surga yang mereka mewarisi kenikmatan di dalamnya. Ibrahim berkata : Ampunilah bapakku karena ia termasuk orang-orang yang tersesat. Sungguh aku telah berjanji untuk memintakan ampun atas dirinya dari mu. Karena pada saat itu ketika Ibrahim berpisah dengan bapaknya Ibrahim mengatakan padanya : Aku akan meminta ampunan untukmu kepada Rabbku. Akan tetapi ketika jelas bahwasanya bapaknya adalah musuh Allah dan masih tetap di atas kekafiran ia berlepas diri dari bapaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Doa ini merupakan janji Nabi Ibrahim kepada ayahknya, bahwa dia akan memintakan ampunan untuk ayahnya, namun setelah tampak jelas bagi Nabi Ibrahim ‘alaihis salam bahwa ayahnya adalah musuh Allah, maka Nabi Ibrahim berlepas diri darinya, lihat surah At Taubah: 114."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 86",
    "description": "Nabi ibrahim adalah seorang yang sangat santun kepada orang tuanya, walaupun kafir. Dia berdoa untuk kebaikan ayahnya. \"dan ampunilah ayahku, sesungguhnya dia termasuk orang yang sesat, penyembah berhala. \" namun karena Allah melarang seseorang mendoakan orang kafir yang telah meninggal, nabi ibrahim tidak lagi melanjutkan doa untuk ayahnya. 87. \"dan janganlah engkau hinakan aku pada hari mereka dibangkitkan, di hadapan manusia lain bersamaku, tapi tutupilah kesalahanku, hanya engkau sajalah yang mengetahui keadaanku yang sebenarnya."
  }
]