[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "87-89. “Dan janganlah Engkau timpakan kehinaan kepadaku pada hari manusia keluar dari kubur-kubur mereka untuk mengahadapi perhitungan amal dan pembalasannya, pada hari yang harta dan anak-anak tidak bermanfaat bagi siapa pun dari hamba-hamba, kecuali orang yang menghadap Allah dengan hati yang bersih dari kekafiran, kemunafikan dan tindakan-tindakan kenistaan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Yaitu pada saat harta yang telah dikumpulkan manusia ketika di dunia dahulu tidak lagi berguna, dan anak laki-laki tidak lagi bisa memberikan pertolongan,"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Hari itu adalah hari dimana harta dan anak-anak tidak berguna"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika tidak berguna harta dan anak-anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87-89 “dan janganlah Engkau hinakan aku pada hari mereka dibangkitkan,” maksudnya, dengan di caci karena beberapa dosa, dan dengan siksaan serta dengan dipermalukan Karena dosa-dosa itu. Akan tetapi, bahagiakanlah aku pada hari itu, yaitu hari yang tidak berguna lagi harta dan ank laki-laki, “kecuali orang-orang yang menghadap Allah dengan hati yang bersih. Inilah yang akan berguna baginya saat itu, dan inilah orang yang selamat dari siksa dan yang berhak mendapat limpahan pahala. Hati yang selamat, maksudnya adalah hati yang selamat dari syirik, keraguan, cinta kepada keburukan, suka melakukan bid’ah dan dosa, dan keselamatannya drai hal-hal tersebut mengharuskannya berpegang teguh kepada lawan-lawannya, berupa ikhlas, ilmu, yakin, cinta kepada kebaikan dan menghiaskannya di dalam hati, dan mengharuskan kehendak dan kecintaannya mengikuti cinta Allah, dan hawa nafsunya mengikuti apa saja yang datang dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 88: 87-89. Berkata Ibrahim memohon kepada Allah : Janganlah Engkau membuka aibku wahai Rabbku dan janganlah pula menjadikan diriku hina di puncak persaksian manusia di hadapan Rabb seluruh alam, serta berdiri untuk menerima balasan dan hisab. Itulah hari yang tidak bermanfaat harta seorang hamba dan keturunan, tidak bermanfaat padanya kecuali siapa yang datang kepada Allah dengan hati yang selamat yang bersih dari kesyirikan dan keraguan serta kemunafikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 88",
    "description": "Yaitu pada hari ketika harta dan anak-anak tidak lagi berguna, untuk menebus semua dosa-dosa yang ada. Allah tidak membutuhkan semua itu, karena Allah mahakaya. 89. Kecuali orang-orang yang menghadap Allah dengan hati yang bersih, yang selamat dari noda dan dosa."
  }
]