[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "87-89. “Dan janganlah Engkau timpakan kehinaan kepadaku pada hari manusia keluar dari kubur-kubur mereka untuk mengahadapi perhitungan amal dan pembalasannya, pada hari yang harta dan anak-anak tidak bermanfaat bagi siapa pun dari hamba-hamba, kecuali orang yang menghadap Allah dengan hati yang bersih dari kekafiran, kemunafikan dan tindakan-tindakan kenistaan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. kecuali orang-orang yang menghadap Allah dengan hati yang bersih; yaitu orang yang tidak melakukan kesyirikan, kemunafikan, ria dan kesombongan, sebab ia akan mendapatkan manfaat dari harta yang ia infakkan di jalan Allah, dan doa anak-anaknya yang selalu mendoakan dirinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. إِلَّا مَنْ أَتَى اللهَ بِقَلْبٍ سَلِيمٍ (kecuali orang-orang yang menghadap Allah dengan hati yang bersih) Harta dan kerabat seseorang tidak bermanfaat di sisi Allah, yang dapat memberi keselamatan baginya hanyalah hati yang bersih, yaitu hati yang lurus dan sehat, hati orang yang beriman, sebab hati orang kafir dan munafik adalah hati yang sakit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Di sisi Allah, harta dan anak tidak berguna bagi seseorang kecuali orang yang datang dengan hati yang beriman, ikhlas dan bersih dari kekufuran dan kemunafikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali orang yang menghadap kepada Allah dengan hati yang bersih”} bersih dari kesyirikan dan kemunafikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87-89 “dan janganlah Engkau hinakan aku pada hari mereka dibangkitkan,” maksudnya, dengan di caci karena beberapa dosa, dan dengan siksaan serta dengan dipermalukan Karena dosa-dosa itu. Akan tetapi, bahagiakanlah aku pada hari itu, yaitu hari yang tidak berguna lagi harta dan ank laki-laki, “kecuali orang-orang yang menghadap Allah dengan hati yang bersih. Inilah yang akan berguna baginya saat itu, dan inilah orang yang selamat dari siksa dan yang berhak mendapat limpahan pahala. Hati yang selamat, maksudnya adalah hati yang selamat dari syirik, keraguan, cinta kepada keburukan, suka melakukan bid’ah dan dosa, dan keselamatannya drai hal-hal tersebut mengharuskannya berpegang teguh kepada lawan-lawannya, berupa ikhlas, ilmu, yakin, cinta kepada kebaikan dan menghiaskannya di dalam hati, dan mengharuskan kehendak dan kecintaannya mengikuti cinta Allah, dan hawa nafsunya mengikuti apa saja yang datang dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 89: 87-89. Berkata Ibrahim memohon kepada Allah : Janganlah Engkau membuka aibku wahai Rabbku dan janganlah pula menjadikan diriku hina di puncak persaksian manusia di hadapan Rabb seluruh alam, serta berdiri untuk menerima balasan dan hisab. Itulah hari yang tidak bermanfaat harta seorang hamba dan keturunan, tidak bermanfaat padanya kecuali siapa yang datang kepada Allah dengan hati yang selamat yang bersih dari kesyirikan dan keraguan serta kemunafikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Inilah hati yang bermanfaat bagi seseorang di sisi Allah, di mana dengannya ia dapat selamat dari siksa dan berhak memperoleh pahala. Hati yang bersih di sini maksudnya adalah hati yang bersih dari syirk, keraguan, kemunafikan, hasad, dendam, dengki, menipu, sombong, riya’, sum’ah mencintai keburukan dan kemaksiatan. Oleh karena itu hatinya ikhlas, yakin, jujur, mencintai kebaikan, lapang dada dan memaafkan, tulus, tawadhu’, keinginan dan kecintaannya mengikuti kecintaan Allah, niat dan amalnya karena mencari ridha-Nya, dan hawa nafsunya mengikuti yang datang dari Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 89",
    "description": "Kecuali orang-orang yang menghadap Allah dengan hati yang bersih, yang selamat dari noda dan dosa. 90. Dan surga didekatkan kepada orang-orang yang bertakwa yang selalu menjaga diri dari kemaksiatan, agar terhindar dari murka Allah. Surga diperlihatkan kepada mereka, sehingga mereka bisa menikmati pemandangan yang sangat indah di dalamnya. Inilah kenikmatan permulaan sebelum mereka masuk ke dalamnya."
  }
]