[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Apakah mereka itu mendustakan, sedang mereka tidak memperhatikan bumi di mana Kami menumbuhkan padanya semua jenis tanaman yang indah lagi berguna, yang tidak berkuasa menumbuhkannya kecuali Tuhan semesta alam? Sesungguhnya pada perkara ditumbuhkannya tanaman-tanaman di muka bumi benar-benar terkandung bukti petunjuk yang jelas tentang kesempurnaan Kuasa Allah, dan kebanyakan manusia tidak beriman. Dan sesungguhnya Tuhanmu,benar-benar Dia-lah Dzat Yang Mahaperkasa atas segala makhluk, juga Mahapenyayang, yang rahmatNya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan sesungguhnya Rabbmu -wahai Rasul- benar-benar Dia lah Yang Maha Perkasa yang tidak dikalahkan oleh siapapun, lagi Maha Penyayang terhadap hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ (Dan sesungguhnya Tuhanmu benar-benar Dialah Yang Maha Perkasa lagi Maha Penyayang) Yakni Yang Maha berkuasa atas mereka untuk membalas mereka, dan Dia juga Maha Penyayang sehingga tidak menyegerakan siksaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan sesungguhnya Tuhanmu itu Maha Kuat dan Maha Kuasa untuk membalas kekufuran meskipun Dia Maha Pengasih yang mengabaikan mereka dan belum memberi mereka hukuman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang benar-benar Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9 “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa,” yang menundukkan setiap makhluk, dan seluruh alam atas dan bawah tunduk kepadaNYa. “lagi MahaPenyayang,” yang rahmatNya meliputi segala sesuatu, kemurahanNya sampai kepada segala yang hidup; Yang Mahaperkasa membinasakan orang-orang yang sengsara dengan berbagai hukuman, Maha pemurah terhadap orang-orang yang berbahagia, di mana Dia menyelamatkan mereka dari segala keburukan dan bala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 9: 8-9. Allah kemudian mengakhiri ayat ini dengan penjelasan yang bahwasanya tidaklah keluar dari bumi dari macam-macam buah-buahan dan tumbuh-tumbuhan yang beranekan ragam kecuali sebagai tanda yang nyata atas kuasa Allah atas hari kebangkitan, juga akan dihidupkan kembali mayit dan mengembalikan mereka, dengan itu semua sungguh orang-orang musyrik yang mendustakan hari kebangkitan tetap tidak beriman dan membenarkan; Karena sebab mereka mencintai kekufuran atas keimanan; Karena sebab Allah (menurut sangkaan mereka) tidaklah membebani mereka (orang-orang kafir) dengan ibadah. Ketahuilah wahai Nabi Allah bahwasanya Tuhanmu adalah maha kuat, mampu atas untuk membinasakan para pendusta dan orang-orang yang sombong kepada para Nabi dan Rasul, Dialah yang maha suci yang memiliki banyak rahmat kepada hamba-Nya, dan di antara rahmat-Nya adalah menjadikan Nabi orang yang berhasil, beserta para pengikutnya dari orang-orang yang beriman, dan di antara rahmat-Nya adalah menunda dan tidak mensegerakan adzab agar mereka (orang-orang kafir) dapat bertaubat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia berkuasa terhadap semua makhluk dan berkuasa membinasakan orang-orang kafir dengan berbagai macam hukuman. Semua alam, baik alam bagian bawah maupun atas tunduk kepada-Nya. Kepada orang-orang mukmin, di mana Dia menyelamatkan mereka dari keburukan dan musibah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 9",
    "description": "Dan sungguh, tuhanmu dialah yang mahaperkasa, tidak akan terku-rangi kekuasaan-Nya oleh banyaknya orang-orang yang ingkar kepada-Nya, namun demikian, dia juga maha penyayang dengan tidak cepat menyiksa makhluk-Nya yang durhaka, tapi memberikan kesempatan kepada mereka untuk bertobat. 10. Sebagai hiburan kepada nabi Muhammad dan sebagai pelajaran bagi penduduk mekah, Allah menceritakan kembali sejarah nabi-nabi terdahulu dan keingkaran kaumnya terhadap mereka. Dan ingatlah, wahai rasul, ketika tuhanmu di lembah thuwa menyeru nabi musa dengan firman-Nya, 'datangilah dan berserulah, atas nama-ku kepada kaum yang zalim, yang melampaui batas-batas kemanusiaan, itu seperti menyembah kepada selain Allah dan membunuhi bayi-bayi lelaki. \"."
  }
]