[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan (pada hari itu) surga didekatkan kepada orang-orang yang menjauhi kekafiran dan maksiat-maksiat dan datang kepada Allah dengan membawa ketaatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Dan (pada hari itu) Surga didekatkan dari orang-orang yang bertakwa kepada Rabb mereka dengan mengerjakan perintah dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Surga akan didekatkan kepada orang-orang yang mentaati perintah-perintah Allah dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ (dan (di hari itu) didekatkanlah surga kepada orang-orang yang bertakwa) Yakni didekatkan bagi mereka agar mereka memasukinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Dan surga didekatkan kepada orang-orang yang takut terhadap azab dengan berbuat ketaatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Surga didekatkan} didekatkan {kepada orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-95 kemudian Allah menjelaskan sebagian keadaan pada hari yang sangat dahsyat itu dan pahala, serta hukuman yang ada padanya, seraya berfirman,” dan didekatkanlah surga” maksudnya dijadikan dekat, “kepada orang-orang yang bertakwa,” maksudnya orang-orang yang bertakwa kepada Rabb mereka, yaitu orang-orang yang mematuhi perintah-perintahNya, menjauhi larangan-laranganNya dan takut terhadap murka dan siksaNya. “dan diperlihatkan dengan jelas neraka jahim,” maksudnya, neraka jahim ditampakan dalam keadaan telah siap dengan segala siksanya, “kepada orang-orang yang sesat,” yaitu orang-orang yang tenggelam di dalam kemaksiatan kepada Allah dan lancang terhadap segala sesuatu yang diharamkanNya, mendustakan para rasulNya serta menolak ajaran kebenaran yang mereka bawa. “dan dikatakan kepada mereka, ‘dimanakah berhala-berhala yang dahulu kamu selalu sembah, selain dari Allah? Dapatkah mereka menolong kamu atau menolong diri mereka sendiri?” maksudnya, sama sekali hal itu tidak akan terjadi sedikitpun, dan tampaklah kedustaan dan kenistaan mereka, dan jelas pulalah kerugian dan kehinaan mereka, penyesalan mereka nyata dan segala usaha mereka menjadi sia-sia. “maka mereka dijungkirkan kedalamnya,” maksudnya, diceburkan kedalam neraka. ”mereka,” maksudnya, segala sesuatu yang dahulu mereka sembah, “bersama-sama orang yang sesat,” orang-orang yang menjadi penyembahnya, “dan bala tentara iblis semuanya,” dari bangsa manusia dan bangsa jin, yaitu mereka yang telah diseret dalam kemaksiatan sekuat-kuatnya dan menguasai mereka karena kesyirikan dan ketidakberimanan mereka, hingga mereka menjadi para penyerunya dan menjadi para pengupaya untuk memperoleh keridhaannya. Di antara mereka ada yang menjadi penyeru untuk taat kepadanya, ada yang memenuhi seruanya dan ada pula yang menjadi pentaklid buta kepada mereka dalam kesyirikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 90: Pada hari kiamat surga didekatkan bagi hamba Allah yang mereka menjadikan antara diri mereka dan adzab Allah benteng dengan mengerjakan perintah-perintah Allah dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sifat hari yang dahsyat itu serta menyebutkan pahala dan siksa di hari itu. Yaitu orang-orang yan menjalankan perintah Allah dan menjauhi larangan-Nya serta takut kepada kemurkaan Allah dan siksa-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 90",
    "description": "Dan surga didekatkan kepada orang-orang yang bertakwa yang selalu menjaga diri dari kemaksiatan, agar terhindar dari murka Allah. Surga diperlihatkan kepada mereka, sehingga mereka bisa menikmati pemandangan yang sangat indah di dalamnya. Inilah kenikmatan permulaan sebelum mereka masuk ke dalamnya. 91. Dan sebaiknya neraka jahim yang sangat panas dan menakutkan diperlihatkan dengan jelas kepada orang-orang yang memilih jalan sesat, ' yaitu jalan kehidupan yang tidak diridai oleh Allah seperti kekafiran dan kesyirikan."
  }
]