[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan neraka diperlihatkan dengan jelas bagi orang-orang kafir yang sesat dari jalan hidayah dan berani melanggar perkara-perkara yang diharamkan oleh Allah dan mendustakan rasul-rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Dan di padang mahsyar kelak diperlihatkan Neraka secara jelas kepada orang-orang yang sesat, yaitu orang-orang yang tersesat dari jalan kebenaran.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91-95. Dan neraka akan ditampakkan kepada orang-orang kafir, dan akan dikatakan kepada mereka: “Dimana berhala-berhala yang dahulu kalian sembah selain Allah? Apakah mereka dapat menolong kalian dari azab, atau menyelamatkan diri mereka sendiri dengan berlepas diri dari kalian dan dari penyembahan kalian?” Kemudian mereka dilempar ke neraka secara bertumpang tindih bersama pemimpin mereka yang mengajak kepada kesyirikan dan setan-setan mereka dari golongan jin dan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. وَبُرِّزَتِ الْجَحِيمُ لِلْغَاوِينَ (dan diperlihatkan dengan jelas neraka Jahim kepada orang-orang yang sesat) Yakni neraka Jahannam ditampakkan pada mereka. Allah menampakkan surga bagi orang-orang beriman sebelum memasukinya, dan menampakkan neraka bagi orang-orang kafir sebelum memasukinya, hal ini untuk meningkatkan kebahagiaan orang-orang beriman dan memperberat kesedihan orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Dan neraka ditampakkan bagi orang-orang kafir sebelum mereka memasukinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Neraka Jahim diperlihatkan} ditampakkan {kepada orang-orang yang sesat} orang-orang yang teresat dari jalan yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-95 kemudian Allah menjelaskan sebagian keadaan pada hari yang sangat dahsyat itu dan pahala, serta hukuman yang ada padanya, seraya berfirman,” dan didekatkanlah surga” maksudnya dijadikan dekat, “kepada orang-orang yang bertakwa,” maksudnya orang-orang yang bertakwa kepada Rabb mereka, yaitu orang-orang yang mematuhi perintah-perintahNya, menjauhi larangan-laranganNya dan takut terhadap murka dan siksaNya. “dan diperlihatkan dengan jelas neraka jahim,” maksudnya, neraka jahim ditampakan dalam keadaan telah siap dengan segala siksanya, “kepada orang-orang yang sesat,” yaitu orang-orang yang tenggelam di dalam kemaksiatan kepada Allah dan lancang terhadap segala sesuatu yang diharamkanNya, mendustakan para rasulNya serta menolak ajaran kebenaran yang mereka bawa. “dan dikatakan kepada mereka, ‘dimanakah berhala-berhala yang dahulu kamu selalu sembah, selain dari Allah? Dapatkah mereka menolong kamu atau menolong diri mereka sendiri?” maksudnya, sama sekali hal itu tidak akan terjadi sedikitpun, dan tampaklah kedustaan dan kenistaan mereka, dan jelas pulalah kerugian dan kehinaan mereka, penyesalan mereka nyata dan segala usaha mereka menjadi sia-sia. “maka mereka dijungkirkan kedalamnya,” maksudnya, diceburkan kedalam neraka. ”mereka,” maksudnya, segala sesuatu yang dahulu mereka sembah, “bersama-sama orang yang sesat,” orang-orang yang menjadi penyembahnya, “dan bala tentara iblis semuanya,” dari bangsa manusia dan bangsa jin, yaitu mereka yang telah diseret dalam kemaksiatan sekuat-kuatnya dan menguasai mereka karena kesyirikan dan ketidakberimanan mereka, hingga mereka menjadi para penyerunya dan menjadi para pengupaya untuk memperoleh keridhaannya. Di antara mereka ada yang menjadi penyeru untuk taat kepadanya, ada yang memenuhi seruanya dan ada pula yang menjadi pentaklid buta kepada mereka dalam kesyirikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 91: Pada hari kiamat juga neraka ditampakkan bagi orang-orang kafir yang mendustakan dan sesat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang menjatuhkan dirinya ke dalam lembah kemaksiatan, berani mengerjakan larangan-Nya, mendustakan rasul-rasul-Nya dan menolak kebenaran yang mereka bawa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 91",
    "description": "Dan sebaiknya neraka jahim yang sangat panas dan menakutkan diperlihatkan dengan jelas kepada orang-orang yang memilih jalan sesat, ' yaitu jalan kehidupan yang tidak diridai oleh Allah seperti kekafiran dan kesyirikan. 92. Dan pada saat itu dikatakan kepada mereka, 'di mana berhala-berhala yang dahulu kamu sembah. Mestinya berhala-berhala itu berada di sini untuk menolongmu dari siksaan api neraka."
  }
]