[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "92-93. Dan dikatakan kepada mereka sebagai celaan bagi mereka, “Mana sesembahan-sesembahan kalian yang dahulu kalian sembah selain Allah, sedang kalian beranggapan bahwa mereka itu dapat memberikan syafaat bagi kalian hari ini? Apakah sesembahan-sesembahan itu dapat memberikan pertolongan bagi mereka hingga dapat menepis siksaan dari mereka atau dapat membela diri dengan menolak siksaan dari diri mereka sendiri? Tidak ada satu pun yang terjadi dari hal tersebut.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. yaitu yang kalian sembah selain Allah? Dapatkah mereka menolong dengan cara menghalangi azab Allah dari kalian, atau apakah mereka hanya menolong diri mereka sendiri?\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Kalian menyembahnya selain Allah. Apakah mereka (sesembahan itu) bisa menolong kalian dari azab atau menolong dirinya sendiri (dari azab)?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Selain Allah. Dapatkah mereka menolong kalian atau menolong diri sendiri”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-95 kemudian Allah menjelaskan sebagian keadaan pada hari yang sangat dahsyat itu dan pahala, serta hukuman yang ada padanya, seraya berfirman,” dan didekatkanlah surga” maksudnya dijadikan dekat, “kepada orang-orang yang bertakwa,” maksudnya orang-orang yang bertakwa kepada Rabb mereka, yaitu orang-orang yang mematuhi perintah-perintahNya, menjauhi larangan-laranganNya dan takut terhadap murka dan siksaNya. “dan diperlihatkan dengan jelas neraka jahim,” maksudnya, neraka jahim ditampakan dalam keadaan telah siap dengan segala siksanya, “kepada orang-orang yang sesat,” yaitu orang-orang yang tenggelam di dalam kemaksiatan kepada Allah dan lancang terhadap segala sesuatu yang diharamkanNya, mendustakan para rasulNya serta menolak ajaran kebenaran yang mereka bawa. “dan dikatakan kepada mereka, ‘dimanakah berhala-berhala yang dahulu kamu selalu sembah, selain dari Allah? Dapatkah mereka menolong kamu atau menolong diri mereka sendiri?” maksudnya, sama sekali hal itu tidak akan terjadi sedikitpun, dan tampaklah kedustaan dan kenistaan mereka, dan jelas pulalah kerugian dan kehinaan mereka, penyesalan mereka nyata dan segala usaha mereka menjadi sia-sia. “maka mereka dijungkirkan kedalamnya,” maksudnya, diceburkan kedalam neraka. ”mereka,” maksudnya, segala sesuatu yang dahulu mereka sembah, “bersama-sama orang yang sesat,” orang-orang yang menjadi penyembahnya, “dan bala tentara iblis semuanya,” dari bangsa manusia dan bangsa jin, yaitu mereka yang telah diseret dalam kemaksiatan sekuat-kuatnya dan menguasai mereka karena kesyirikan dan ketidakberimanan mereka, hingga mereka menjadi para penyerunya dan menjadi para pengupaya untuk memperoleh keridhaannya. Di antara mereka ada yang menjadi penyeru untuk taat kepadanya, ada yang memenuhi seruanya dan ada pula yang menjadi pentaklid buta kepada mereka dalam kesyirikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 93: 92-93. Kemudian dikatakan kepada orang kafir dengan sindiran yang jelek : Di mana tuhan-tuhan itu yang oleh kalian, kalian sembah selain Allah ?! Apakah mereka (sesembahan itu) memberi manfaat bagi kalian di hari kiamat sehingga menjaga kalian dari adzab ?!! Dan apakah mereka mampu menjaga diri – diri mereka dari adzab ?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 93",
    "description": "Selain Allah' dapatkah mereka menolong kamu atau menolong diri me-reka sendiri'' mereka sama sekali tidak bisa berbuat apa-apa. Bahkan berhala-berhala itu dan yang menyembahnya akan masuk neraka bersama-sama. 94. Maka mereka, sesembahan itu, dijungkirkan ke dalam neraka bersama orang-orang yang sesat, berkali-kali."
  }
]