[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "94-95. Lalu mereka dikumpulkan dan dilemparkan ke dalam jahanam bersama dengan orang-orang yang menyesatkan mereka dan para pendukung iblis yang menjadikan keburukan dipandang baik oleh mereka itu. Tidak ada seorang pun dari mereka yang lolos."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Maka mereka; golongan yang disesatkan dan yang menyesatkan, dilemparkan ke dalam Neraka, sebagian mereka di atas sebagian yang lain,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. فَكُبْكِبُوا۟ فِيهَا هُمْ وَالْغَاوُۥنَ (Maka mereka (sembahan-sembahan itu) dijungkirkan ke dalam neraka bersama-sama orang-orang yang sesat) Sesembahan-sesembahan itu dilemparkan ke neraka. Dan makna (الغاوون) adalah para penyembah mereka, mereka semua dijungkir balikkan ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Kemudian mereka dilemparkan ke dalam neraka Jahannam di atas wajah mereka, yaitu sesembahan yang disembah itu dan para penyembahnya yang sesat yang membujuk orang lain untuk menyembah mereka (sesembahan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka dijungkirkan} mereka dilempar sebagian demi di atas sebagian lain {di dalamnya bersama orang-orang yang sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-95 kemudian Allah menjelaskan sebagian keadaan pada hari yang sangat dahsyat itu dan pahala, serta hukuman yang ada padanya, seraya berfirman,” dan didekatkanlah surga” maksudnya dijadikan dekat, “kepada orang-orang yang bertakwa,” maksudnya orang-orang yang bertakwa kepada Rabb mereka, yaitu orang-orang yang mematuhi perintah-perintahNya, menjauhi larangan-laranganNya dan takut terhadap murka dan siksaNya. “dan diperlihatkan dengan jelas neraka jahim,” maksudnya, neraka jahim ditampakan dalam keadaan telah siap dengan segala siksanya, “kepada orang-orang yang sesat,” yaitu orang-orang yang tenggelam di dalam kemaksiatan kepada Allah dan lancang terhadap segala sesuatu yang diharamkanNya, mendustakan para rasulNya serta menolak ajaran kebenaran yang mereka bawa. “dan dikatakan kepada mereka, ‘dimanakah berhala-berhala yang dahulu kamu selalu sembah, selain dari Allah? Dapatkah mereka menolong kamu atau menolong diri mereka sendiri?” maksudnya, sama sekali hal itu tidak akan terjadi sedikitpun, dan tampaklah kedustaan dan kenistaan mereka, dan jelas pulalah kerugian dan kehinaan mereka, penyesalan mereka nyata dan segala usaha mereka menjadi sia-sia. “maka mereka dijungkirkan kedalamnya,” maksudnya, diceburkan kedalam neraka. ”mereka,” maksudnya, segala sesuatu yang dahulu mereka sembah, “bersama-sama orang yang sesat,” orang-orang yang menjadi penyembahnya, “dan bala tentara iblis semuanya,” dari bangsa manusia dan bangsa jin, yaitu mereka yang telah diseret dalam kemaksiatan sekuat-kuatnya dan menguasai mereka karena kesyirikan dan ketidakberimanan mereka, hingga mereka menjadi para penyerunya dan menjadi para pengupaya untuk memperoleh keridhaannya. Di antara mereka ada yang menjadi penyeru untuk taat kepadanya, ada yang memenuhi seruanya dan ada pula yang menjadi pentaklid buta kepada mereka dalam kesyirikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 94: 94-95. Allah kemudian mengabarkan bahwasanya seluruh orang-orang kafir saling mengikuti binasanya mereka ke dalam neraka satu persatu, bersama dengan mereka bala tentara iblis dan pembantu-pembantunya yang menyimpang dari jalan Allah, dan yang menyeru kepada ibadah selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu para penyembahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 94",
    "description": "Maka mereka, sesembahan itu, dijungkirkan ke dalam neraka bersama orang-orang yang sesat, berkali-kali. 95. Dan juga bala tentara iblis semuanya. Iblis sebagai penggoda, manusia kafir yang tergoda dan berhala-berhala yang dijadikan sesembahan, semuanya akan masuk neraka. Semuanya adalah simbol-simbol pengingkaran gterhadap Allah. Pada saat mereka di neraka terjadilah aksi saling menghujat di antara iblis dan pengikutnya:."
  }
]