[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "96-99. Mereka berkata mengakui kesalahan mereka, sedang mereka saling bertikai di dalam Jahanam dengan orang-orang yang menyesatkan mereka, “Demi Allah, sesungguhnya kita sewaktu di dunia dahulu berada di dalam kessatan yang nyata, tidak ada kesamaran di dalamnya, karena kami mempersamakan kalian dengan Penguasa alam semesta Yang hanya Dia yang berhak diibadahi saja. Dan tidaklah menjerumuskan kami kedalam tempat kembali yang buruk ini kecuali orang-orang yang berdosa yang menyeru kami untuk menyembah selain Allah, lalu kami mengikuti mereka.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. karena kami mempersamakan kalian dengan Rabb seluruh makhluk, sehingga kami pun menyembah kalian sebagaimana kami menyembah-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. إِذْ نُسَوِّيكُم بِرَبِّ الْعٰلَمِينَ (karena kita mempersamakan kamu dengan Tuhan semesta alam) Sehingga kami menyembah kalian sebagaimanan kami menyembah Tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Ketika kami menyamakan kalian dengan Allah, Tuhan semesta alam, untuk ditaati, dicintai, disembah dan ditakuti."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika kami menyamakan kalian} menyamakan kalian {dengan Tuhan alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96-104 “mereka berkata,” maksudnya, adalah bala tentara iblis, para pemuja berhala dan patung-patung yang mereka sembah, “demi Allah, sungguh kita dahulu (di dunia) dalam kesesatan yang nyata, karena kita telah mempersamakan kamu dengan Rabb semesta alam,” dalam ibadah, mencintai, takut dan berharap. Dan kami berdoa kepada kalian sebagaimana kami berdoa kepadaNYa. Kesesatan mereka saat itu menjadi jelas bagi mereka. Mereka pun mengakui keadilan Allah dalam menghukum mereka, dan hukuman itu benar-benar tepat pada tempatnya. mereka tidak menyetarakan berhala-berhala itu dengan Allah, Rabb semesta alam kecuali dalam hal ibadah, bukan dalam hal menciptakan. Hal ini terbukti melalui ucapan mereka, “dengan Rabb semesta alam,” mereka mengakui bahwa Allah adalah Rabb semesta alam semuanya, yang termasuk di dalamnya adalah patung-patung dan semua berhala mereka. “dan tiadalah yang menyesatkan kami,” dari jalan hidayah dan kebenaran, dan mengajak kami kejalan kesesatan dan kefasikan, “kecuali orang-orang yang berdosa.” Mereka dalah para pemuka yang menyeru kepada api neraka. “maka kami tidak mempunyai,” pada saat itu, “pemberi syafaat seorangpun,” yang dapat memberikan syafaat kepada kami untuk menyelamatkan kami dari azabNya,”dan tidak pula mempunyai teman yang akrab,” maksudnya, seorang kerabat setia yang berguna bagi kami, sebagaimana biasanya dahulu di dunia. Lalu mereka berputus asa dari segala kebaikan dan bersedih hati terhadap apa yang telah mereka lakukan, dan mereka berangan-angan untuk kembali kedunia agar bisa melakukan amal shalih. “maka sekiranya kita dapat kembali sekali lagi,” maksudnya, bisa kembali kedunia,”niscaya kmai menjadi orang-orang yang beriman,” agar kami bisa selamat dari azab dan berhak mendapat pahala! Sama seklai tidak mungkin, sama sekali tidak mungkin! Apa yang mereka inginkan itu sudah tertutup dari mereka dan semua bentuk penggadaian sudah ditutup. “sesungguhnya yang pada demikian itu,” yaitu pada yang telah kami jelaskan kepada kalian dan kami uraikan, “benar-benar terdapat tanda-tanda,” bagi kalian, ”tetapi kebanyakan mereka tidak beriman,” sekalipun tanda-tanda (bukti-bukti kebenaran) itu diturunkan. “dan sesungguhnya Rabbmu benar-benar Dia-lah Yang Mahaperkasa lagi Mahapenyayang,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syu’ara ayat 98: 96-99. Berkata mereka para penyembah berhala yang musyrik ketika sedang bercekcok di mana mereka adalah para hamba penyembah berhala : Demi Allah, sungguh kami adalah dalam kesesatan yang nyata yang tidak tersembunyi lagi; Ketika kami menyamakkan (berhala) dengan Rabb semesta alam, dan tidaklah kami terperdaya dan terjauhkan dari jalan kebenaran menuju jalan kesesatan kecuali (disesatkan) oleh mereka para pemimpin yang jahat yang memalingkan kami dari jalan Allah serta kami diseru oleh mereka kepada kesesatan yang melazimkan kami berada di dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dalam beribadah, bukan dalam rububiyyah, karena mereka mengetahui bahwa Allah adalah Rabbul ‘alamin (Pencipta, Penguasa, Pengatur seluruh alam), tetapi mereka malah mengarahkan ibadah kepada selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syu’ara Ayat 98",
    "description": "Karena kita mempersamakan kamu yaitu berhala-berhala itu dengan tuhan seluruh alam. \" penyamaan Allah pencipta dan pengurus alam seluruh dengan berhala yang tidak mempunyai andil apa-apa dalam kehidupan adalah satu kezaliman yang nyata. Penghuni neraka tahu siapa sebenarnya yang menyesatkan mereka. 99. \"dan tidak ada yang menyesatkan kita kecuali orang-orang yang berdosa, yang terdiri dari setan yang berujud jin dan manusia yang tidak henti-hentinya menggoda ke jalan yang sesat. \"."
  }
]