[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian manusia, waspadalah terhadap siksaan Allah dengan cara menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya. Sesungguhnya peristiwa yang terjadi pada Hari Kiamat, berupa kengerian-kengerian dan goncangan dahsyat pada bumi sehingga seluruh sisinya terpecah belah, merupakan kejadian yang sangat besar (dahsyat), tidak bisa diperkirakan tingkatannya dan tidak bisa dibayangkan hakikatnya. Dan tidak ada yang mengetahui bagaimana persisnya kecuali Tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai sekalian manusia! Bertakwalah kepada Tuhan kalian dengan mengimplementasikan apa yang diperintahkan dan menjauhi segala yang dilarangnya kepada kalian, sesungguhnya perkara dahsyat yang menyertai hari Kiamat berupa guncangan gempa bumi, dan hal lainnya merupakan suatu kejadian yang sangat besar, maka wajib bagi kalian untuk mempersiapkan diri menyongsong kedatangannya dengan mengerjakan segala yang diridai Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah memerintahkan manusia agar bertakwa kepada Allah dengan mentaati segala perintah-Nya dan menjauhi segala larangan-Nya. Dan Dia menyampaikan pada hari kiamat mereka akan menghadapi goncangan bumi yang dahsyat, dan kejadiannya sangat mengerikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا النَّاسُ اتَّقُوا۟ رَبَّكُمْ ۚ (Hai manusia, bertakwalah kepada Tuhanmu) Yakni berhati-hatilah dari siksaan-Nya, maka berlindunglah darinya dengan melakukan ketaatan kepada-Nya, yaitu dengan melakukan segala kewajiban dan menjauhi segala larangan. إِنَّ زَلْزَلَةَ السَّاعَةِ شَىْءٌ عَظِيمٌ(sesungguhnya kegoncangan hari kiamat itu adalah suatu kejadian yang sangat besar) Yakni goncangan yang merupakan salah satu tanda-tanda hari kiamat, goncangan di dunia yang terjadi sebelum hari kiamat; ini merupakan pendapat jumhur ulama tafsir. Pendapat lain mengatakan yang dimaksud adalah goncangan yang terjadi bersamaan dengan tiupan sangkakala hari kiamat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Seorang muslim tatkala membaca firman Allah: { إِنَّ زَلْزَلَةَ ٱلسَّاعَةِ شَىْءٌ عَظِيمٌ } \"sesungguhnya kegoncangan hari kiamat itu adalah suatu kejadian yang sangat besar (dahsyat)\" akan terkejut bagaimana seorang ibu akan rela meninggalkan anak bayinya yang sedang menyusu! Dan mencoba untuk membayangkan bagaimana manusia ketika itu seperti orang-orang gila, namun ia tidak mampu membayangkan peristiwa itu padahal ia mengimaninya, maka ketika peristiwa tsunami yang terjadi di Jepang menggambarkan suatu kejadian yang dahsyat, akan terpkirkan dalam benaknya bahwa peristiwa itu hanyalah gambaran kecil dari peristiwa kiamat; maka dengan demikian keimanannya akan bertambah, kecuali orang-orang yang masih tersimpan di dalam hatinya penyakit dan kekafiran. 2 ). Peristiwa yang dahsyat diwarnai oleh kejadian yang menakjubkan: Pepohonan tidak akan dihisab dan dimintai pertangung jawabannya! dan nyamuk pun tidak akan ditanya atas apa yang ia perbuat di dunia! dan semut yang kecil tidak akan ditimbang pada hari kiamat! bahkan kucing yang identik dengan keramahan dan kelembutan tidak akan ditampakkan di surga dan tidak juga d neraka! namun kenapa ayat menggambarkan kejadian pada hari itu secara umum bahwa yang hamil akan menjatuhkan kandungannya, hal ini menunjukkan bahwa kejadian itu benar-benar sangat mengerikan dan menakutkan. 3 ). { يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا } Umumnya diketahui dalam bahasa arab bahwa seorang wanita yang menyusui anaknya disebut dengan murdhi' (مُرْضِعٌ), tapi dalam ayat Allah mengatakan: مُرْضِعَةٌ, dan bukan dengan lafadz mudzakkar? dijawab oleh az-Zamakhsyary sebagaimana yang dinukilkan oleh asy-Syanqithi dalam adhwa' al-Bayan: murdhi'ah yakni susu seorang ibu yang sedang menyuapi anaknya; sedangkan lafazd (مرضع) : merupakan adalah seorang ibu yang memiliki anak yang masih menyusui, sekalipun saat itu ia tidak sedang menyusui, ayat ini dijelaskan dengan lafadz (مُرْضِعَةٌ) menunjukkan bahwa kejadian kiamat ketika itu mengejutkan siapapun sampai-sampai seorang bay yang sedang menyusu di pelukan ibunya, sampai harus melepeskan; dikarenakan keadaan yang sangat menakutkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Al ‘Azizi berkata bahwa surah ini termasuk surah yang menakjubkan. Surah ini turun di waktu malam dan siang, juga turun di waktu perjalanan dan menetap. Turun di Makkah serta Madinah, turun dalam keadaan damai juga dalam keadaan perang, serta sebagai surah muhakkaman dan juga mutasyabihan. 1. Hai seluruh manusia, bertakwalah, takutlah, dan hati-hatilah atas hukuman dari Tuhanmu. Sesungguhnya goncangan hari kiamat itu adalah suatu kejadian yang sangat menakutkan, besar dahsyat, serta mengejutkan manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, bertakwalah kepada Tuhan kalian. Sesungguhnya goncangan hari kiamat itu} dahsyatnya kengerian hari kiamat {adalah sesuatu yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah mengajak bicara seluruh umat manusia, supaya mereka bertakwa kepada Rabb mereka yang telah merawat mereka dengan beragam kenikmatan, yang terlihat maupun tidak. Sepantasnya mereka takut kepadaNya, dengan cara meninggalkan praktik syirik, perbuatan-perbuatan fasik serta maksiat, dan menaati perintah-perintahNya, sesuai dengan kemampuan mereka. Selanjutnya Allah memberitahukan tentang satu faktor yang bisa membantu mereka dalam merealisasikan ketakwaan dan memperingatkan mereka agar tidak meninggalkannya. Yaitu, informasi tentang kondisi-kondisi dahsyat di Hari Kiamat. Allah berfirman, “Sesungguhnya kegoncangan Hari KIamat itu adalah suatu kejadian yang sangat besar (dahsyat),” tingkat kengeriannya tidak mampu diperkirakan dan tidak mampu diketahui bagaimana kenyataannya. Yang demikian itu, saat terjadinya Hari Kiamat, bumi mengalami kekeringan, bergetar dan bergerak-gerak, serta digoncang-goncangkan dengan goncangan yang sangat keras. Gunung-gunung terpecah-belah, tercabut (dari pangkalnya) dan menjelma pasir-pasir bertumpukan yang beterbangan. Kemudian menjadi debu-debu yang berhamburan. Berikutnya, manusia terbagi-bagi menjadi tiga golongan. Di saat itulah, langit terbelah, matahari dan bulan digulung, bintang-bintang jatuh berserakan. Kemudian, terjadilah kekacauan dan prahara yang mengerikan kalbu, menggelisahkan hati, memutihkan rambut anak-anak kecil dan melenyapkan ketulian yang sudah parah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 1: Allah Subhaanahu wa Ta'aala mengarahkan firman-Nya kepada semua manusia agar mereka bertakwa kepada Rabb mereka yang telah mengurus mereka dengan nikmat-nikmat-Nya yang nampak maupun tersembunyi. Oleh karena itu, sudah sepatutnya mereka bertakwa kepada-Nya dengan meninggalkan syirk, kefasikan dan kemaksiatan serta melaksanakan perintah-perintah-Nya semampu mereka. Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan sesuatu yang membantu mereka bertakwa dan memperingatkan mereka untuk tidak meninggalkannya, yaitu keadaan yang terjadi pada hari kiamat. Yakni takutlah kepada-Nya dengan menaati-Nya. Para ulama mufassir berbeda pendapat tentang guncangan hari kiamat ini, apakah setelah manusia bangkit dari kubur kemudian diarahkan ke padang mahsyar atau guncangan itu sebelum manusia bangkit dari kubur. Sebagian mereka berpendapat, bahwa guncangan ini terjadi di akhir umur dunia dan awal peristiwa-peristiwa yang akan terjadi pada hari kiamat. Dalam tafsir Al Jalaalain diterangkan, bahwa setelah guncangan yang dahsyat itu matahari terbit dari barat tanda tibanya kiamat. Karena sangat mengejutkan umat manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 1",
    "description": "Ayat ini mengimbau agar manusia mawas diri serta menjaga diri-Nya dari azab Allah pada hari kiamat dengan beriman dan bertakwa. Wahai manusia! saatnya kamu menyimak pesan Allah, bertakwalah kepada tuhanmu dengan beriman dan melaksanakan perintah-Nya serta menjauhi larangan-Nya; sungguh, meskipun kamu belum meng-alami, guncangan hari kiamat itu adalah suatu kejadian yang sangat besar, menyebabkan manusia takut, panik dan tak tahu harus berbuat apa. 2. Ingatlah wahai manusia, pada hari ketika kamu melihatnya, goncangan dahsyat pada hari kiamat itu, semua perempuan yang menyusui anaknya akan lalai terhadap anak yang disusuinya, karena terkejut dan panik; dan setiap perempuan yang hamil akan keguguran kandungannya, karena goncangan dahsyat itu; dan kamu melihat manusia dalam keadaan mabuk, seperti orang yang tidak sadar, padahal sebenarnya mereka tidak mabuk tetapi azab Allah yang terjadi pada hari kiamat itu sangat keras dirasakan oleh orang-orang kafir."
  }
]