[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-13. Dan diantara manusia ada orang yang masuk ke dalam Islam dengan dorongan yang lemah dan keraguan, sehingga dia menyembah Allah dengan ragu-ragu, layaknya orang yang tengah berdiri di atas tepi gunung atau tembok, dia tidak mantap dalam berdirinya, dan dia mengaitkan keimanannya erat dengan kehidupan dunianya. Apabila dia dalam keadaan sehat dan hidup dengan nyaman, maka dia akan meneruskan ibadahnya. Dan apabila terjadi padanya satu cobaan dengan kejadian yang tidak mengenakkan dan kesulitan, dia mengaitkan kesialannya itu kepada agamanya, lalu dia meninggallkan agamanya sebagaimana orang yang berbalik ke belakang setelah istiqamah. Disebabkan hal itulah, dia merugi di dunia, karena kekafirannya tidak mengubah apa yang ditakdirkan bagi dirinya untuk kehidupan dunianya, dan dia merugi di akhirat karena masuk ke dalam neraka. Dan itu adalah kerugian yang nyata. Orang yang merugi itu menyembah selain Allah yang tidak dapat memadorotkannya bila ia abaikan, dan tidak memberinya manfaat jika ia sembah. Itulah kesesatan nyata yang amat jauh dari kebenaran. Dia menyeru makhluk yang mudaratnya lebih dekat daripada manfaatnya. Alangkah buruknya sesembahan itu sebagai penolong dan amat buruk menjadi kawan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan di antara manusia ada orang yang gamang, dia menyembah Allah dalam keadaan ragu. Apabila ia memperoleh kebaikan berupa kesehatan dan kekayaan, ia akan terus beriman dan beribadah kepada Allah, namun apabila ia memperoleh suatu cobaan berupa penyakit atau kemiskinan, ia akan putus asa dari agamanya hingga murtad. Sungguh dia rugi di dunia, kekafirannya tidak akan menambahnya dari bagian harta dunia yang tidak ditetapkan baginya, dan ia juga rugi di Akhirat kelak karena adanya azab Allah yang akan menimpanya, hal yang demikian ini merupakan kerugian yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-13. Sebagian manusia memiliki iman yang lemah sehingga dia menyembah Allah dengan penuh keraguan karena keimanan belum menetap dalam hatinya; apabila dia diberi kenikmatan dan kesehatan maka dia akan istiqamah dalam agamanya, namun jika dia mendapat musibah maka dia akan keluar dari agamanya dan kembali kafir serta menyia-nyiakan agama dan akhiratnya. Kembali kepada kekafiran merupakan kerugian yang jelas yang tidak ada kerugian yang lebih besar darinya. Dia akan menyembah berhala-berhala yang tidak dapat memberinya mudharat jika tidak menyembahnya, dan tidak dapat memberinya manfaat jika menyembahnya. Kekafiran yang jelas ini merupakan kesesatan yang jauh dari kebenaran. Dia menyembah kepada yang mudharatnya lebih pasti dari pada manfaatnya yang tidak akan dia dapatkan. Itulah seburuk-buruk penolong dan sejahat-jahat kawan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَمِنَ النَّاسِ مَن يَعْبُدُ اللهَ عَلَىٰ حَرْفٍ ۖ (Dan di antara manusia ada orang yang menyembah Allah dengan berada di tepi) Yakni ragu dalam agamanya, tanpa keyakinan, seperti orang yang berada di tepi jurang, hatinya akan bergetar dan kakinya akan lemas. Berbeda dengan orang yang beriman yang menyembah Allah dengan penuh keyakinan dan keteguhan. فَإِنْ أَصَابَهُۥ خَيْرٌ(maka jika ia memperoleh kebajikan) Yakni kebaikan dunia berupa kelapangan dan kesehatan serta kesejahteraan dan harta yang banyak. اطْمَأَنَّ بِهِۦ ۖ( tetaplah ia dalam keadaan itu) Yakni berpegang teguh pada agamanya dan tetap dalam ibadahnya. وَإِنْ أَصَابَتْهُ فِتْنَةٌ(dan jika ia ditimpa oleh suatu bencana) Suatu bencana pada keluarganya, hartanya, atau dirinya. انقَلَبَ عَلَىٰ وَجْهِهِۦ (berbaliklah ia ke belakang) Menjadi murtad dan kembali pada kekafiran. خَسِرَ الدُّنْيَا وَالْاٰخِرَةَ ۚ (Rugilah ia di dunia dan di akhirat) Ia kehilangan dunia dan akhiratnya, sehingga ia tidak bagian di dunia berupa ghanimah dan pujian yang baik dan tidak pula bagian di akhirat berupa pahala dan apa yang telah disiapkan Allah bagi hamba-hamba-Nya yang shalih. ذٰلِكَ (Yang demikian itu) Yakni kerugian di dunia dan di akhirat. هُوَ الْخُسْرَانُ الْمُبِينُ (adalah kerugian yang nyata) Yakni kerugian yang jelas yang tidak ada yang menandinginya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Wahai hamba Allah! sembahlah Allah sesuai apa yang Ia inginkan darimu bukan sesuai keinginanmu; karena barangsiapa yang menyembah-Nya dengan keinginan dirinya sendiri; maka ia termasuk orang yang menyembah Allah sedang ia berada di tepian { فَإِنْ أَصَابَهُۥ خَيْرٌ ٱطْمَأَنَّ بِهِۦ ۖ وَإِنْ أَصَابَتْهُ فِتْنَةٌ ٱنقَلَبَ عَلَىٰ وَجْهِهِۦ خَسِرَ ٱلدُّنْيَا وَٱلْءَاخِرَةَ ۚ ذَٰلِكَ هُوَ ٱلْخُسْرَانُ ٱلْمُبِينُ } \"maka jika ia memperoleh kebajikan, tetaplah ia dalam keadaan itu, dan jika ia ditimpa oleh suatu bencana, berbaliklah ia ke belakang. Rugilah ia di dunia dan di akhirat. Yang demikian itu adalah kerugian yang nyata\", ketika kebaikan dan kecintaan semakin kuat, tidaklah pelakunya akan menerima sesuatu melainkan apa yang diinginkan oleh tuannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Di antara manusia ada orang yang menyembah Allah dengan keragu-raguan terhadap agama-Nya. Namun orang-orang yang benar beriman mereka menyembah Allah dengan ketetapan dan mata hati. Jika orang-orang yang ragu itu memperoleh kebajikan dunia berupa kesehatan ataupun kekayaan mereka tetap teguh dalam agamanya. Namun jika ia ditimpa oleh suatu bencana baik dari keluarga maupun hartanya maka serta merta mereka kembali kepada kekufuran. Rugilah ia di dunia sebab ia tidak mendapatkan kebaikan dunia dan juga rugilah ia di akhirat sebab dia akan diazab. Yang demikian itu adalah kerugian yang nyata, tidak ada kerugian melebihi itu. Maksud kata tharafu adalah berpaling dari agamanya. Ayat ini turun untuk orang yang masuk Islam, apabila mereka mendapat kebaikan berupa mendapatkan anak laki-laki atau kuda mereka melahirkan, maka mereka mengatakan bahwa ini agama baik dan indah. Namun jika mereka mendapat apa yang mereka kira buruk dengan mendapatkan anak perempuan atau kuda mereka tidak beranak maka mereka mengatakan bahwa ini adalah agama yang buruk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara manusia ada yang menyembah Allah di tepi} dengan ragu {Jika ditimpa kebaikan} kesehatan tubuh, kelapangan rezeki {dia tenang dengan itu} ridha dan teguh dengan agamanya {Jika ditimpa suatu cobaa} cobaan pada badannya, kesempitan rezeki {dia berbalik ke belakang} dia murtad kembali ke keadaannya sebelumnya berupa kekufuran {Dia merugi di dunia dan akhirat. Itulah kerugian yang nyata} yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Maksudnya, ada sebagian manusia yang lemah keimanannya. Keimanannya belum memasuki relung hatinya, dan pancaran cahayanya belum melapisinya, akan tetapi keimanan masuk kepadanya, baik lantaran rasa takut maupun (biasanya) keadaan imannya tidak teguh saat berhadapan dengan bermacam cobaan. “Maka jika mem;peroleh kebajikan, tetaplah ia dalam keadaan itu.” Maksudnya jika (curahan) rizki kontinyu baginya dengan melimpah, tidak terjadi sesuatu yang tidak mengenakkan (bencana) padanya, maka dia begitu puas dengan kebaikan tersebut, bukan (tenang) karena keimanannya. Orang semacam ini, mungkin saja Allah membebaskannya (dari ujian), tidak menebar fitnah baginya yang berpotensi membelokannya dari agamanya. “dan jika dia ditimpa oleh suatu bencana,” berupa peristiwa yang tidak baik, atau lenyapnya sesuatu yang dicintai, (maka) “berbaliklah dia ke belakang,” maksudnya dia murtad (keluar) dari agamanya. “Rugilah ia di dunia dan akhirat.” Tentang kerugian di dunia, maka dia meraih apa yang dia idam-idamkan melalui murtadnya sebagai modal dan sebagai barang barter dari angan-angan yang diduganya bisa didapatkan. Usahanya gagal. Tidak ada yang berhasil ia rengkuh melainkan bagian yang telah ditetapkan baginya. Mengenai kerugian akhirat, maka sangat jelas. Ia terhalangi dari surge yang luasnya seluas langit dan bumi. Dan dia dipastikan masuk neraka. “Yang demikian itu adalah kerugian yang nyata,” yaitu yang jelas dan nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 11: Yaitu mereka yang lemah iman, di mana iman tidak masuk dan menyatu ke dalam hatinya, bahkan masuk hanya karena takut atau hanya karena kebiasaan yang jika tersentuh cobaan langsung goyang. Maksudnya, tidak dengan penuh keyakinan. Orang yang berada di atas keraguan diumpamakan seperti berada di tepi gunung karena tidak kokohnya. Seperti kesehatan dan keselamatan pada diri dan hartanya atau hartanya banyak dan tidak mendapatkan bahaya. Karena harta itu, bukan karena imannya. Seperti sakit yang menimpa dirinya dan kebinasaan pada hartanya atau memperoleh hal yang tidak disukainya dan hilang sesuatu yang dicintainya. Maksudnya, kembali kafir lagi. Dengan tidak memperoleh apa yang diharapkannya dari dunia ini selain bagian yang telah ditetapkan untuknya. Diharamkan masuk surga dan tempatnya di neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 11",
    "description": "Di antara umat islam, ada yang beragama secara total, tetapi ada pula yang beragama di pinggirannya saja. Dan di antara manusia ada yang menyembah Allah hanya di tepi, karena rasa beragamanya tidak meresap ke dalam hati dan tidak mengakar ke dalam jiwa. Maka jika dia memperoleh kebajikan duniawi karena keislamannya, dia merasa puas, dan sebaliknya jika dia ditimpa suatu cobaan, baik dirinya maupun keluarganya, dia segera berbalik ke belakang, kembali kepada agama lama. Dia menjadi orang murtad, rugi di dunia, karena dinilai tidak punya pendirian dan rugi di akhirat, karena kekal di dalam neraka. Kerugian di akhirat dengan dimasukkan ke dalam neraka itulah kerugian yang nyata. 12. Dia, orang-orang yang murtad kembali menyeru kepada selain Allah, baik benda, manusia, roh leluhur, jin maupun setan, yang semuanya merupakan sesuatu yang tidak dapat mendatangkan bencana, baik bagi dirinya maupun lingkungan sosialnya, dan tidak pula semua yang di-sembah itu memberi manfaat kepadanya. Mengambil kekufuran dan melepaskan iman dengan murtad itulah kesesatan yang jauh dari kebenaran."
  }
]