[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-13. Dan diantara manusia ada orang yang masuk ke dalam Islam dengan dorongan yang lemah dan keraguan, sehingga dia menyembah Allah dengan ragu-ragu, layaknya orang yang tengah berdiri di atas tepi gunung atau tembok, dia tidak mantap dalam berdirinya, dan dia mengaitkan keimanannya erat dengan kehidupan dunianya. Apabila dia dalam keadaan sehat dan hidup dengan nyaman, maka dia akan meneruskan ibadahnya. Dan apabila terjadi padanya satu cobaan dengan kejadian yang tidak mengenakkan dan kesulitan, dia mengaitkan kesialannya itu kepada agamanya, lalu dia meninggallkan agamanya sebagaimana orang yang berbalik ke belakang setelah istiqamah. Disebabkan hal itulah, dia merugi di dunia, karena kekafirannya tidak mengubah apa yang ditakdirkan bagi dirinya untuk kehidupan dunianya, dan dia merugi di akhirat karena masuk ke dalam neraka. Dan itu adalah kerugian yang nyata. Orang yang merugi itu menyembah selain Allah yang tidak dapat memadorotkannya bila ia abaikan, dan tidak memberinya manfaat jika ia sembah. Itulah kesesatan nyata yang amat jauh dari kebenaran. Dia menyeru makhluk yang mudaratnya lebih dekat daripada manfaatnya. Alangkah buruknya sesembahan itu sebagai penolong dan amat buruk menjadi kawan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dia menyembah patung-patung sebagai tuhan selain Allah yang tidak bisa memberikannya mudarat bila ia menentangnya, dan tidak kuasa mendatangkan baginya manfaat bila ia mentaatinya. Doa yang dipanjatkan kepada patung-patung yang tidak memberikan mudarat dan manfaat itu merupakan kesesatan yang jauh dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يَدْعُوا۟ مِن دُونِ اللهِ مَا لَا يَضُرُّهُۥ وَمَا لَا يَنفَعُهُۥ ۚ (Ia menyeru selain Allah, sesuatu yang tidak dapat memberi mudharat dan tidak (pula) memberi manfaat kepadanya) Yakni orang yang berpaling ke belakang dan kembali kepada kekafiran ini menyembah patung-patung yang tidak membahayakannya jika ia tidak menyembahnya dan tidak memberinya manfaat jika ia menyembahnya, sebab sesembahan itu hanyalah benda mati yang tidak mampu memberi manfaat atau mudharat. ذٰلِكَ هُوَ الضَّلٰلُ الْبَعِيدُ(Yang demikian itu adalah kesesatan yang jauh) Yakni jauh dari kebenaran dan petunjuk. Dan Imam al-Farra’ mengatakan: sangat jauh dan panjang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Inilah yang menjadikan mereka kembali kufur dengan menyembah selain Allah atau berhala. Mereka tidak dapat memberi mudharat jika mereka tidak disembah dan tidak pula kuasa memberi manfaat kepada mereka jika disembah. Yang demikian itu adalah kesesatan yang jauh dari kebenaran dan petunjuk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menyeru} menyembah {selain Allah sesuatu yang tidak dapat mendatangkan mudarat dan tidak pula memberikan manfaat kepadanya. Itulah kesesatan yang jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-13. “Dia menyeru,” orang yang berpaling ini (menyeru) selain Allah, obyek yang tidak mampu menggulirkan manfaat ataupun mendatangkan mudarat. Inilah karakteristik setiap obyek yang diseru dan disembah selain Allah. Ia tidak mampu memberi kemanfaatan dan kemudaratan bagi dirinya sendiri dan pihak lain. “Yang demikian itu adalah kesesatan yang jauh,” yang penyimpangannya sudah mencapai titik klimaks. Ia telah merubah haluan dari penyembahan terhadap dzat yang melimpahkan kemanfaatan, yang mampu memberikan mara bahaya, Yang Mahakaya, lagi Maha Mencukupi, dengan beralih kepada penyembahan makhluk seperti dirinya atau lebih rendah dari tingkatannya. Tidak ada wewenang yang digenggam oleh tangannya. Justru dia lebih dekat kepada hasil yang bertolak-belakang dengan apa yang menjadi hasratnya. Oleh karena itu, Allah berfirman, “Ia menyeru sesuatu yang sebenarnya mudaratnya lebih dekat daripada manfaatnya.” Sesungguhnya bahayanya pada akal dan jasmani, di dunia dan akhirat sudah diketahui bersama. “SEsungguhnya yang diserunya itu adalah sejahat-jahat penolong,” yaitu sesembahan itu “dan sejahat-jahat kawan,” yaitu kawan akrab yang menemani. Tujuan keberadaan pelindung dan kawan, yaitu teraihnya manfaat dan tertolaknya mudarat. Jika tidak terealisasikan sedikit pun dari hal-hal tersebut, maka hubungan itu menjadi tercela lagi tidak baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 12: Seperti patung dan berhala. Jika tidak disembah. Jika disembah. Dari kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 12",
    "description": "Dia, orang-orang yang murtad kembali menyeru kepada selain Allah, baik benda, manusia, roh leluhur, jin maupun setan, yang semuanya merupakan sesuatu yang tidak dapat mendatangkan bencana, baik bagi dirinya maupun lingkungan sosialnya, dan tidak pula semua yang di-sembah itu memberi manfaat kepadanya. Mengambil kekufuran dan melepaskan iman dengan murtad itulah kesesatan yang jauh dari kebenaran. 13. Dia, orang kafir dan orang murtad itu, menyeru dalam ritual dan doanya kepada suatu sembahan yang sebenarnya bencananya dalam persembahan itu, lebih dekat daripada manfaatnya. Sungguh, jika mereka menyadari bahwa sembahan selain Allah itu adalah seburuk-buruk penolong karena menolong kepada kebinasaan, dan sejahat-jahat kawan karena berkawan dengan yang mencelakakan."
  }
]