[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-13. Dan diantara manusia ada orang yang masuk ke dalam Islam dengan dorongan yang lemah dan keraguan, sehingga dia menyembah Allah dengan ragu-ragu, layaknya orang yang tengah berdiri di atas tepi gunung atau tembok, dia tidak mantap dalam berdirinya, dan dia mengaitkan keimanannya erat dengan kehidupan dunianya. Apabila dia dalam keadaan sehat dan hidup dengan nyaman, maka dia akan meneruskan ibadahnya. Dan apabila terjadi padanya satu cobaan dengan kejadian yang tidak mengenakkan dan kesulitan, dia mengaitkan kesialannya itu kepada agamanya, lalu dia meninggallkan agamanya sebagaimana orang yang berbalik ke belakang setelah istiqamah. Disebabkan hal itulah, dia merugi di dunia, karena kekafirannya tidak mengubah apa yang ditakdirkan bagi dirinya untuk kehidupan dunianya, dan dia merugi di akhirat karena masuk ke dalam neraka. Dan itu adalah kerugian yang nyata. Orang yang merugi itu menyembah selain Allah yang tidak dapat memadorotkannya bila ia abaikan, dan tidak memberinya manfaat jika ia sembah. Itulah kesesatan nyata yang amat jauh dari kebenaran. Dia menyeru makhluk yang mudaratnya lebih dekat daripada manfaatnya. Alangkah buruknya sesembahan itu sebagai penolong dan amat buruk menjadi kawan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Orang kafir yang menyembah patung-patung ini menyeru kepada sesuatu yang sebenarnya bencananya yang pasti ada lebih dekat daripada manfaatnya yang semu. Sungguh sesuatu yang mudaratnya lebih dekat daripada manfaatnya adalah seburuk-buruk sesembahan, juga seburuk-buruk penolong bagi yang meminta pertolongannya dan seburuk-buruk kawan bagi yang menemaninya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. يَدْعُوا۟ لَمَن ضَرُّهُۥٓ أَقْرَبُ مِن نَّفْعِهِۦ ۚ (Ia menyeru sesuatu yang sebenarnya mudharatnya lebih dekat dari manfaatnya) bagaimanapun patung-patung itu tidak dapat memberi manfaat, bahkan ia hanya memberi mudharat bagi penyembahnya sebab ia akan masuk neraka karena telah menyembahnya. لَبِئْسَ الْمَوْلَىٰ وَلَبِئْسَ الْعَشِيرُ(Sesungguhnya yang diserunya itu adalah sejahat-jahat kawan) Yakni sesembahan yang memberi mudharat bagi penyembahnya adalah seburuk-buruk penolong dan sejelek-jelek kawan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Ia menyembah sesuatu yang sebenarnya mudharatnya lebih banyak daripada manfaatnya. Sesungguhnya yang mereka sembah itu adalah seburuk-buruk yang mereka jadikan penolong serta seburuk-buruk kawan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menyeru kepada sesuatu yang mudaratnya benar-benar lebih dekat daripada manfaatnya. Sungguh itu seburuk-buruk penolong} penolong {dan sejahat-jahat kawan} kawan yang menemani"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-13. “Dia menyeru,” orang yang berpaling ini (menyeru) selain Allah, obyek yang tidak mampu menggulirkan manfaat ataupun mendatangkan mudarat. Inilah karakteristik setiap obyek yang diseru dan disembah selain Allah. Ia tidak mampu memberi kemanfaatan dan kemudaratan bagi dirinya sendiri dan pihak lain. “Yang demikian itu adalah kesesatan yang jauh,” yang penyimpangannya sudah mencapai titik klimaks. Ia telah merubah haluan dari penyembahan terhadap dzat yang melimpahkan kemanfaatan, yang mampu memberikan mara bahaya, Yang Mahakaya, lagi Maha Mencukupi, dengan beralih kepada penyembahan makhluk seperti dirinya atau lebih rendah dari tingkatannya. Tidak ada wewenang yang digenggam oleh tangannya. Justru dia lebih dekat kepada hasil yang bertolak-belakang dengan apa yang menjadi hasratnya. Oleh karena itu, Allah berfirman, “Ia menyeru sesuatu yang sebenarnya mudaratnya lebih dekat daripada manfaatnya.” Sesungguhnya bahayanya pada akal dan jasmani, di dunia dan akhirat sudah diketahui bersama. “SEsungguhnya yang diserunya itu adalah sejahat-jahat penolong,” yaitu sesembahan itu “dan sejahat-jahat kawan,” yaitu kawan akrab yang menemani. Tujuan keberadaan pelindung dan kawan, yaitu teraihnya manfaat dan tertolaknya mudarat. Jika tidak terealisasikan sedikit pun dari hal-hal tersebut, maka hubungan itu menjadi tercela lagi tidak baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 13: Akibat dari menyembahnya. Yang terbayang seakan-akan bermanfaat, padahal tidak. Bahkan lebih dekat mendapatkan yang bukan harapannya, seperti bahaya dan kerugian. Hal itu, karena yang diinginkan dari penolong dan kawan adalah manfaatnya dan terhindar dari bahaya, namun ternyata yang dia dapatkan darinya adalah bahaya dan tidak mendapatkan manfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 13",
    "description": "Dia, orang kafir dan orang murtad itu, menyeru dalam ritual dan doanya kepada suatu sembahan yang sebenarnya bencananya dalam persembahan itu, lebih dekat daripada manfaatnya. Sungguh, jika mereka menyadari bahwa sembahan selain Allah itu adalah seburuk-buruk penolong karena menolong kepada kebinasaan, dan sejahat-jahat kawan karena berkawan dengan yang mencelakakan. 14. Berbeda dengan perlakuan Allah terhadap orang kafir dan murtad di atas, sungguh, Allah akan memasukkan orang-orang yang beriman yang menjaga imannya hingga akhir hayat dan mengerjakan kebajikan dengan ikhlas ke dalam surga-surga yang mengalir di bawahnya sungai-sungai se-bagai kenikmatan yang tiada terhingga. Sungguh, Allah berbuat apa yang dia kehendaki kepada hamba-hamba-Nya dengan adil."
  }
]