[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman kepada Allah dan RasulNya dan mereka itu teguh di atas keimanan tersebut, serta mengerjakan amal-amal shalih, ke dalam surga-surga yang sungai-sungai mengalir di bawah istana-istana dan pepohonannya. Sesungguhnya Allah berbuat apa saja yang Dia kehendaki, seperti memberi pahala orang-orang yang taat kepadaNya sebagai bentuk keutamaan dariNya dan menyiksa orang-orang yang bermaksiat kepadaNya sebagai bentuk keadilanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Sesungguhnya Allah memasukkan orang-orang yang beriman kepada-Nya dan mengerjakan amal saleh ke dalam surga-surga yang mengalir di bawah istana-istananya sungai-sungai. Sesungguhnya Allah berbuat apa yang Dia kehendaki berupa curahan rahmat kepada orang yang Dia rahmati, dan pemberian azab bagi yang Dia berikan azab. Tidak ada sesuatu pun yang memaksanya untuk melakukan kehendak-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Allah memberi kabar gembira bagi orang-orang beriman yang beramal shalih bahwa Dia akan memasukkan mereka ke dalam surga yang memiliki sungai-sungai yang mengalir di bawah istana-istana dan pepohonannya. Allah melakukan apa yang Dia kehendaki, memuliakan orang-orang beriman dengan karunia-Nya dan mengazab orang-orang kafir dengan keadilan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِنَّ اللهَ يَفْعَلُ مَا يُرِيدُ (Sesungguhnya Allah berbuat apa yang Dia kehendaki) Maka Allah memberi pahala kepada siapa yang Dia kehendaki dan memberi azab siapa yang Dia kehendaki pula."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan mengerjakan amal yang saleh ke dalam surga-surga yang di bawahnya mengalir sungai-sungai. Sesungguhnya Allah berbuat apa yang Dia kehendaki, baik memuliakan orang yang taat, dan menghinakan orang yang durhaka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan beramal shalih ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Sesungguhnya Allah melakukan apa yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Usai memaparkan seluk-beluk pengumbar argumentasi dengan kebatilan, bahwa ia terbagi menjadi dua jenis;seorang yang muqallid (membeo) dan orang yang menyerukannya, maka Allah menyebutkan bahwa orang yang berjuluk dengan keimanan juga terkualifikasi menjadi dua bagian. Satu golongan, keimanan belum memasuki hatinya, seagaimana telah dipaparkan. Dan golongan yang kedua, seorang Mukmin yang sejati. Keimanannya dibenarkan dengan (keberadaan) amalan-amalannya yang shalih. Allah memberitahukan ahwa Dia akan memasukkan mereka ke dalam “surge-surga yang dibawahnya mengalir sungai-sungai.” Surge dinamakan dengan sebutan jannat, karena memuat hunian-hunian, istana-istana, pepohonan dan tumbuhan-tumbuhan yang menutupi orang-orang yang berada di bawahnya dan dapat dijadikan perlindungan lantaran kelebatannya. “SEsungguhnya Allah berbuat apa yang Dia kehendaki,” apa pun yang dikehendaki oleh Allah pasti terjadi, tanpa ada pihak yang menghalang-halangi atau menentang. Di antara kehendakNya adalah menempatkan penduduk surge di dalam surge. Semoga Allah menjadikan kita sekalian termasuk dari kalangan mereka dengan karunia dan kemurahanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 14: Setelah Allah Subhaanahu wa Ta'aala menyebutkan orang-orang yang mendebat kebenaran dengan kebatilan, bahwa mereka terbagi dua; ada yang sebagai muqallid (ikut-ikutan) dan ada pula yang sebagai daa’i (penyeru). Allah menyebutkan, bahwa orang yang menyatakan beriman pun ada dua bagian; ada orang yang imannya tidak sampai masuk ke dalam hatinya, dan ada pula yang sebagai mukmin sejati, di mana ia membenarkan imannya dengan amal saleh. Mereka ini (orang-orang mukmin yang sejati) akan Allah masukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Disebut tempat tinggal yang penuh kenikmatan itu dengan surga (jannah), karena di dalamnya terdapat tempat tinggal, istana, dan pohon-pohon yang melindungi bagian dalamnya dan karena lebatnya sampai menutupinya. Yang fardhu maupun yang sunat. Seperti memuliakan orang yang taat kepada-Nya dan menghinakan orang yang bermaksiat. Apa yang diinginkan Allah untuk dilakukan, maka tidak ada yang dapat menghalangi dan menentangnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 14",
    "description": "Berbeda dengan perlakuan Allah terhadap orang kafir dan murtad di atas, sungguh, Allah akan memasukkan orang-orang yang beriman yang menjaga imannya hingga akhir hayat dan mengerjakan kebajikan dengan ikhlas ke dalam surga-surga yang mengalir di bawahnya sungai-sungai se-bagai kenikmatan yang tiada terhingga. Sungguh, Allah berbuat apa yang dia kehendaki kepada hamba-hamba-Nya dengan adil. 15. Pada ayat di atas Allah menerangkan sikap orang murtad dan hu-kuman atas mereka, serta balasan bagi orang beriman. Pada ayat ini Allah mempersilakan orang kafir yang tidak menyukai perkembangan islam untuk menghentikan pertolongan-Nya. Barang siapa menyangka atau berpendapat bahwa Allah tidak akan menolongnya, Muhammad, di dunia dengan memperoleh kebebasan dari tekanan mereka di mekah serta menemukan tempat yang tepat untuk menyebarkan islam di madinah, dan mendapat balasan kebaikan di akhirat, maka hendaklah dia merentangkan tali ke langit, lalu menggantung dirinya di langit, kemudian dari ketinggian itu berusahalah menghentikan pertolongan Allah kepada rasul-Nya. Kemudian, lalu pikirkanlah apakah langkah tersebut dapat melenyapkan apa yang menyakitkan hatinya, pesatnya perkembang-an islam atas pertolongan Allah kepada kaum muslim."
  }
]