[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa meyakini bahwa sesungguhnya Allah tidak akan menguatkan RasulNya, Muhammad dengan pertolongan di dunia dengan memenangkan agamaNya dan di akhirat dengan meninggikan derajatnya dan menyiksa orang-orang yang mendustakannya, maka hendaklah dia membentangkan seutas tali ke atap rumahnya dan menggantung dirinya dengan tali itu, kemudian memutus tali tersebut, lalu hendaklah dia pikirkan, apakah tindakan itu akan menghilangkan rasa amarah yang ada di dalam dirinya? Sesungguhnya Allah akan menolong NabiNya, Muhammad, dengan pasti tanpa keraguan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Barangsiapa yang menyangka bahwa Allah tidak akan menolong nabi-Nya -ṣallallāhu 'alaihi wa sallam- di dunia dan di Akhirat maka hendaknya ia merentangkan tali ke atap rumahnya, lalu ia menggantung diri dengan tidak menginjakkan kakinya di tanah, kemudian pikirkanlah apakah upaya itu melenyapkan rasa sakit, kesal dan amarah yang ada dalam dirinya?! Sungguh Allah pasti menolong Nabi-Nya, baik pembangkang itu setuju ataupun enggan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Barangsiapa yang mengira Allah tidak akan menolong Nabi Muhammad di dunia dengan memenangkan agamanya dan di akhirat dengan meninggikan derajatnya, maka hendaklah dia membunuh dirinya sendiri jika yang Allah lakukan itu membuatnya sakit hati, yaitu dengan menjulurkan tali ke atap dan mengikatkan lehernya pada tali itu; kemudian hendaklah dia melihat apakah itu dapat menghilangkan sakit hati yang ada di hatinya? Allah pasti akan menolong nabi-Nya kerena ini sudah menjadi janji-Nya, dan janji Allah pasti benar. Arbidah at-Tamimi berkata, aku bertanya kepada Ibnu Abbas: “Menurutmu apa yang dimaksud dalam firman Allah, مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ ٱللَّهُ فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ إِلَى ٱلسَّمَآءِ ثُمَّ لْيَقْطَعْ فَلْيَنظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُۥ مَا يَغِيظُ Barangsiapa yang menyangka bahwa Allah sekali-kali tiada menolongnya (Muhammad) di dunia dan akhirat, maka hendaklah ia merentangkan tali ke langit, kemudian hendaklah ia melaluinya, kemudian hendaklah ia pikirkan apakah tipu dayanya itu dapat melenyapkan apa yang menyakitkan hatinya. Dia menjawab: “Barangsiapa yang mengira Allah tidak akan menolong Nabi Muhammad, maka hendakah dia mengikatkan tali ke atap kemudian menggantung dirinya hingga mati.” (Diriwayatkan Imam at-Tirmidzi, tafsir 17/126-127. Dan Imam Hakim dalam al-Mustadrak 2/386 dari jalur Sufyan dari Abu Ishaq secara ringkas dan menggunakan lafadz [من كان يظن أن لن ينصر الله محمدا]. Dishahihkan dan disepakati oleh Imam ad-Dzahabi, dan disebutkan Imam al-Bukhari dalam kitab Shahih secara mu’allaq dengan lafadz tegas, dia berkata, Ibnu Abbas berkata: (بسبب) yakni dengan tali yang dijulurkan dari atap rumah)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ اللهُ فِى الدُّنْيَا وَالْاٰخِرَةِ (Barangsiapa yang menyangka bahwa Allah sekali-kali tiada menolongnya (Muhammad) di dunia dan akhirat) Yakni barangsiapa yang mengira bahwa Allah tidak akan menolong Nabi Muhammad dan menyangka bahwa Allah akan berhenti menolongnya, maka hendaklah ia merentangkan tali ke langit. فَلْيَمْدُدْ بِسَبَبٍ إِلَى السَّمَآءِ(maka hendaklah ia merentangkan tali ke langit) Yakni hendaklah ia berusaha mencari cara untuk mencapai langit. ثُمَّ لْيَقْطَعْ(kemudian hendaklah ia melaluinya) Yakni kemudian hendaklah ia menghentikan pertolongan yang disiapkan Allah bagi Nabi Muhammad jika ia memang mampu melakukannya. فَلْيَنظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُۥ(kemudian hendaklah ia pikirkan apakah tipu dayanya itu dapat melenyapkan) Yakni makarnya. مَا يَغِيظُ(apa yang menyakitkan hatinya) Yakni apa yang menjadikannya murka, berupa pertolongan Allah kepada Nabi. Pendapat lain mengatakan makna dari ayat ini adalah barangsiapa yang berputus asa dari datangnya rezeki Allah maka hendaklah ia mengikatkan tali pada atap rumahnya kemudian hendaklah ia menggantungkan diri dengan tali itu, lalu hendaklah ia melihat apakah yang dilakukannya itu dapat menghilangkan apa yang menyakitkan hatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Barangsiapa yang menyangka bahwa Allah tidak akan menolong nabi Muhammad dan membuat mereka marah dengan menolong Nabi di dunia dan akhirat, maka hendaklah ia merentangkan tali ke langit, kemudian hendaklah ia melaluinya, kemudian hendaklah ia pikirkan apakah tipu dayanya itu dapat melenyapkan apa yang menyakitkan hatinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang menyangka bahwa Allah tidak akan menolongnya} bahwa Allah tidak akan menolong nabiNya, nabi Muhammad SAW {di dunia dan di akhirat hendaklah dia merentangkan tali ke langit-langit} tali-tali ke atap rumahnya {lalu memutusnya} agar dia tercekik dengan tali itu {Kemudian, hendaklah dia memperhatikan apakah tipu dayanya itu} perbuatan dan tipu muslihatnya {dapat melenyapkan apa yang membuatnya marah} sesuatu yang dia dapati dalam dirinya yang membuatnya marah dan murka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Maksudnya, barangsiapa yang menyangka Allah tidak menolong RasulNya dan agamaNya akan meredup, (ketahuilah) sesungguhnya kemenagan itu dari Allah, datang dari atas langit [“maka hendaklah dia merentangkan tali ke langit, kemudian hendaklah dia memutusnya,” maksudnya memutusnya pertolongan kemenangan dari Rasulullah] “kemudian hendaklah dia pikirkan apakah tipu dayanya itu dapat melenyapkan,” maksudnya tipu daya yang dia lancarkan dan perbuat kepada Rasulullah berupa perlawanan terhadap beliau dan ambisi untuk memberangus agama beliau yang mana telah menjadikan orang tersebut geram karena agama beliau tegak berdiri. Ini merupakan bentuk pertanyaan yang bermakna penafian. Dan sesungguhnya tidak ada orang yang bisa mengobati kejengkelannya (terhadap Islam) dengan usaha-usaha yang dia perbuat. Makna ayat yang mulia ini, wahai orang yang menentang Rasulullah, Muhammad, yang berusaha memadamkan agamanya, dengan kebodohannya, dia menyangka usahanya akan berguna, ketahuilah, bahwa usaha apa pun yang engkau lakukan dan engkau upayakan untuk memperdayai Rasulullah, maka sesungguhnya usaha itu tidak akan menyirnakan kegeramanmu dan tidak bakal bisa mengobati dukamu. Engkau tidak mempunyai kemampuan untuk itu. Tetapi, Kami ingin mengusulkan sebuah usulan kepadamu, yang bisa memuaskan kegeramanmu terhadap Rasulullah dan memutuskan pertolongan kalau memang mungkin. Yaitu, masuklah ke dalam masalah ini melalui pintunya. Dan dakilah menuju arahnya dengan tali-tali. Artinya, carilah tali, pelepah kurma atau lainnya, kemudian gantungkan di langit. Lantas, naiklah sampai engkau mencapai pintu-pintu yang menjadi tempat turunnya pertolongan. Kemudian, tutuplah, kunci dan putuskanlah. Kondisi ini akan menuntaskan kebencianmu. Inilah gagasan dan tipu daya (yang dimaksud). Sedangkan yang lainnya, jangan sampai terlintas di benakmu akan sanggup menyelesaikan kegeramanmu, kalaupun engkau dibantu oleh seluruh makhluk. Ayat yang mulia ini, memuat janji baik dan kabar gembira tentang pertolongan dari Allah bagi agama, RasulNya dan para hamba yang beriman, dengan sangat jelas. Juga mengandung pemangkasan harapan bagi orang-orang kafir yang ingin memadamkan cahaya Allah melalui lidah-lidah mereka. Allah menyempurnakan cahayaNya, walaupun orang-orang kafir membenci. Maksudnya, kendatipun mereka mengusahakan upaya-upaya yang mungkin mereka tempuh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 15: Dan menyangka bahwa agama-Nya tidak akan berkembang. Ada yang mengartikan dengan atap rumahnya, dan ada pula yang mengartikan dengan langit, karena pertolongan Allah turun dari langit. Ada pula yang mengartikan dengan “Lalu ia naik ke atasnya dan memutuskan pertolongan yang turun dari langit.” Terhadap Rasulullah shallallahu 'alaihi wa sallam, seperti merencanakan sesuatu untuk membahayakan Beliau dan berusaha mengalahkan agamanya. Yang menyakitkan hatiya adalah kemajuan Islam. Yakni semua usahanya tidak dapat mengobati rasa kesalnya. Syaikh As Sa’diy berkata, “Maksud ayat yang mulia ini adalah: Wahai musuh Nabi Muhammad shallallahu 'alaihi wa sallam yang berusaha memadamkan agamanya, yang mengira dengan kebodohannya bahwa usahanya akan memberikan sedikit manfaat baginya! Ketahuilah, betapa pun kamu telah mengerjakan berbagai sebab dan berusaha melakukan tipu daya terhadap Rasul, maka yang demikian tidak dapat menghilangkan sesuatu yang menyakitkan hatimu dan mengobati dukamu. Engkau tidak mampu menghilangkannya. Akan tetapi kami tawarkan kepadamu suatu pendapat yang dengannya rasa kesalmu terobati dan pertolongan kepada rasul dapat dihentikan jika memang bisa, yaitu datangilah perkara itu melalui pintunya dan tempuhlah sebab-sebabnya. Ambillah tali dari sabut atau lainnya, lalu gantungkanlah di langit, kemudian naiklah dengannya sampai kamu tiba di pintu-pintunya yang darinya turun pertolongan, lalu sumbat, tutup dan putuskanlah. Dengan cara ini rasa kesal dalam hatimu dapat terobati. Inilah pandangan dan cara yang tepat. Adapun selain itu, maka jangan lamu kira dapat mengobati sakit hatimu meskipun kamu dibantu oleh orang-orang yang membantumu. Ayat yang mulia ini, di dalamnya terdapat janji dan kabar gembira tentang pertolongan Allah terhadap agama-Nya dan Rasul-Nya serta hamba-hamba-Nya yang sungguh jelas. Demikian pula terdapat sesuatu yang membuat orang-orang kafir yang hendak memadamkan cahaya Allah dengan mulut-mulut mereka menjadi berputus asa, dan Allah akan menyempurnakan cahaya-Nya meskipun orang-orang kafir benci.” Sebagian ahli tafsir mengartikan, maka hendaklah ia merentangkan tali ke atap rumahnya kemudian ia mencekik lehernya dengan tali itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 15",
    "description": "Pada ayat di atas Allah menerangkan sikap orang murtad dan hu-kuman atas mereka, serta balasan bagi orang beriman. Pada ayat ini Allah mempersilakan orang kafir yang tidak menyukai perkembangan islam untuk menghentikan pertolongan-Nya. Barang siapa menyangka atau berpendapat bahwa Allah tidak akan menolongnya, Muhammad, di dunia dengan memperoleh kebebasan dari tekanan mereka di mekah serta menemukan tempat yang tepat untuk menyebarkan islam di madinah, dan mendapat balasan kebaikan di akhirat, maka hendaklah dia merentangkan tali ke langit, lalu menggantung dirinya di langit, kemudian dari ketinggian itu berusahalah menghentikan pertolongan Allah kepada rasul-Nya. Kemudian, lalu pikirkanlah apakah langkah tersebut dapat melenyapkan apa yang menyakitkan hatinya, pesatnya perkembang-an islam atas pertolongan Allah kepada kaum muslim. 16. Dan demikianlah kami telah menurunkannya, Al-Qur'an, kepada nabi Muhammad, meskipun orang-orang kafir tidak menyukainya, sebab Al-Qur'an itu yang merupakan ayat-ayat yang nyata, mudah dipahami, masuk akal, dan menyentuh hati bagi orang yang akal dan hatinya terbuka. Sesungguhnya Allah memberikan petunjuk dengan memudahkan memahami Al-Qur'an kepada siapa saja di antara umat manusia yang dia kehendaki."
  }
]