[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana Allah menegakkan hujjah berupa bukti-bukti KuasaNya di hadapan orang-orang kafir untuk membangkitkan mereka, Dia (juga) menurunkan al-Qur’an, yang ayat-ayatnya jelas dalam lafaz-lafaz yang digunakannya dan maknanya, Allah memberikan hidayah dengannya kepada orang-orang yang Allah kehendaki unruk memperoleh hidayah; sebab tidak ada yang sanggup memberikan hidayah selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Sebagaimana Kami telah jelaskan pada kalian tentang bukti nyata adanya hari Kebangkitan, maka Kami juga telah menurunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- Al-Qur`ān sebagai ayat-ayat yang nyata, dan bahwasanya Allah -dengan karunia-Nya- menuntun siapa yang Dia kehendaki ke jalan hidayah dan petunjuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Sebagaimana ayat-ayat kauniyah yang diturunkan dengan jelas, demikian pula Kami turunkan al-Qur’an dengan ayat-ayat dan hujjah-hujjahnya yang jelas. Dan Allah akan memberi hidayah dengan ayat-ayat itu kepada orang yang Dia kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَكَذٰلِكَ أَنزَلْنٰهُ (Dan demikianlah Kami telah menurunkannya) Yakni menurunkan al-Qur’an. ءَايٰتٍۭ بَيِّنٰتٍ(yang merupakan ayat-ayat yang nyata) Yakni ayat yang jelas dalam petunjuknya. وَأَنَّ اللهَ يَهْدِى مَن يُرِيدُ(dan bahwasanya Allah memberikan petunjuk kepada siapa yang Dia kehendaki) Yakni Allah memberi petunjuk bagi orang yang menginginkan petunjuk, atau menambah petunjuk bagi orang yang sebelumnya telah mendapatkan petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Sebagaimana Kami telah menurunkan ayat yang lebih dulu Kami juga menurunkan kepadamu ayat-ayat yang membawa bukti sangat jelas wahai Rasul. Bahwasanya Allah memberikan petunjuk dan menetapkan mereka dalam jalan-Nya kepada siapa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah Kami telah menurunkannya} Kami menurunkan Al-Qur’an {sebagai ayat-ayat yang jelas} yang jelas lafadz dan maknanya {dan sesungguhnya Allah memberi petunjuk kepada siapa saja yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Maksudnya, begitu pula saat Kami menerangkan dalam al-Quran penjelasan-penjelasan yang telah Kami uraikan, Kami menjadikannya sebagai ayat-ayat yang nyata lagi terang, yang menunjukkan kepada segenap kebutuhan-kebutuhan dan permasalahan-permasalahan yang bermanfaat. Hanya saja, hidayah hanya di Tangan Allah. Siapa saja yang dikehendaki oleh Allah untuk dikaruniai hidayah, niscaya dia akan mendapat hidayah melalui al-Quran. Ia akan menjadikannya sebagai petunjuk arah dan sumber keteladanannya dan ia menerangi diri dengan cahayanya. Dan orang yang Allah tidak berkehendak untuk memberinya hidayah, kendatipun setiap ayat telah mendatanginya, niscaya dia tidak akan beriman. Al-Quran tidak bermanfaat baginya sedikit pun. Bahkan akan menjadi penggugat baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 16: Yakni sebagaimana Kami telah menerangkan secara rinci Al Qur’an. Yang menerangkan semua yang dibutuhkan hamba dan mengandung masalah-masalah yang bermanfaat. Meskipun ayat-ayat Al Qur'an begitu jelas dan terang, namun hidayah di Tangan Allah. Barang siapa yang ingin diberi petunjuk oleh Allah, maka dia akan mengambil petunjuk dari Al Qur’an ini, menjadikannya sebagai imam dan panutannya serta mengambil sinarnya. Sebaliknya, barang siapa yang tidak diinginkan Allah mendapatkan hidayah, maka meskipun semua ayat datang kepadanya, ia tetap tidak akan beriman dan Al Qur’an tidak akan bermanfaat baginya, bahkan sebagai hujjah terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 16",
    "description": "Dan demikianlah kami telah menurunkannya, Al-Qur'an, kepada nabi Muhammad, meskipun orang-orang kafir tidak menyukainya, sebab Al-Qur'an itu yang merupakan ayat-ayat yang nyata, mudah dipahami, masuk akal, dan menyentuh hati bagi orang yang akal dan hatinya terbuka. Sesungguhnya Allah memberikan petunjuk dengan memudahkan memahami Al-Qur'an kepada siapa saja di antara umat manusia yang dia kehendaki. 17. Dalam kehidupan dunia perbedaan agama dan keyakinan itu kadang-kadang tidak terlihat pengaruhnya terhadap keberhasilan dan kegagalan hidup, tetapi berbeda dengan di akhirat. Sesungguhnya orang-orang beriman, orang yahudi, orang sabiin, orang nasrani, orang majusi dan orang musyrik, nasib mereka di akhirat berbeda. Allah pasti memberi keputusan di antara mereka pada hari kiamat, orang beriman mendapat rida Allah dan masuk surga, sedangkan orang-orang yang tidak ber-iman mendapat murka Allah dan masuk neraka. Sungguh, Allah menjadi saksi atas segala sesuatu yang terjadi pada diri mereka selama hidup di dunia."
  }
]