[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan RasulNya, Muhammad , orang-orang Yahudi, dan kaum Shabi’in (yaitu kaum yang masih berada di atas fitrah mereka, tidak memiliki ajaran agama tertentu yang mereka ikuti), kaum Nasrani dan kaum Majusi (para penyembah api) dan orang-orang yang mempersekutukan Allah, yaitu para penyembah berhala, sesungguhnya Allah akan memutuskan ketetapan di antara mereka pada Hari Kiamat, lalu memasukkan kaum Mukminin ke dalam surga dan memasukkan orang-orang kafir ke neraka. Sesungguhnya Allah Maha Menyaksikan segala sesuatu, Maha Menyaksikan amalan-amalan hamba-hambaNya dan Maha menghitung dan menjaganya dan akan membalas setiap orang sesuai dengan apa yang berhak diterima oleh mereka berupa balasan yang sesuai dengan jenis perbuatan mereka yang Allah catat dan saksikan mereka melakukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sesungguhnya orang-orang yang beriman dari kalangan umat ini, dan Kaum Yahudi, Sabiin (sekelompok pengikut Nabi-Nabi sebelumnya), Nasrani, para penyembah api, dan para penyembah patung, sungguh Allah akan memberikan keputusan di antara mereka semua hari Kiamat kelak, sehingga orang-orang beriman akan masuk Surga, dan selain mereka akan masuk neraka. Sesungguhnya Allah menjadi saksi atas segala ucapan dan amalan para hamba-Nya, tidak ada yang tersembunyi bagi-Nya, dan Dia pasti memberikan balasan atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Orang-orang beriman, orang-orang Yahudi, orang-orang yang keluar dari agama Yahudi dan Nasrani, orang-orang Nasrani, para penyembah api, dan para penyembah berhala; Allah akan menetapkan hukum di antara mereka pada hari kiamat, dengan memasukkan orang-orang beriman ke dalam surga dengan karunia-Nya dan memasukkan orang-orang kafir ke dalam neraka dengan keadilan-Nya. Dengan demikian selesailah perselisihan yang terjadi yang disebutkan dalam dua ayat setelah ini. Allah Maha Melihat dan Maha Mengetahui segala amalan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. إِنَّ الَّذِينَ ءَامَنُوا۟ (Sesungguhnya orang-orang yang beriman) Yakni beriman kepada Allah dan rasul-Nya, yaitu orang-orang Islam. وَالَّذِينَ هَادُوا۟( orang-orang Yahudi) Mereka adalah orang-orang Yahudi yang menisbatkan diri mereka kepada agama Nabi Musa. وَالصّٰبِـِٔينَ(orang-orang Shaabi-iin) Mereka adalah salah satu golongan keagamaan yang ada di Irak, agama ini tidak merujuk pada salah satu agama yang dibawa oleh para nabi. وَالنَّصٰرَىٰ( orang-orang Nasrani) Mereka adalah orang-orang yang menisbatkan diri kepada Nabi Isa. وَالْمَجُوسَ(orang-orang Majusi) Mereka adalah orang-orang yang menyembah api; mereka mengatakan alam semesta memiliki dua asal, yaitu cahaya dan kegelapan. Terdapat pendapat mengatakan bahwa dahulu mereka memiliki kitab dari Allah kemudian diangkat ke langit. وَالَّذِينَ أَشْرَكُوٓا۟( dan orang-orang musyrik) Yakni orang-orang yang menyembah berhala. إِنَّ اللهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ ۚ( Allah akan memberi keputusan di antara mereka pada hari kiamat) Allah akan memberi keputusan diantara mereka; memasukkan orang-orang beriman ke surga, dan memasukkan orang-orang kafir ke neraka. Pendapat lain mengatakan makna (الفصل) yakni memisahkan antara yang hak dan yang batil. إِنَّ اللهَ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ(Sesungguhnya Allah menyaksikan segala sesuatu) Menyaksikan segala perbuatan, perkataan, dan yang lainnya; tidak ada yang terlewat sedikitpun, sehingga keputusan Allah bagi hamba-hamba-Nya atas dasar pengetahuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Sesungguhnya orang-orang yang beriman kepada Allah dan rasul-Nya Muhammad SAW, beserta orang-orang Yahudi dan Nasrani dan orang-orang Majusi (penyembah api yang mengatakan bahwa sumber Alam ada dua yaitu cahaya dan kegelapan). Juga orang-orang musyrik penyembah berhala dan segala sesuatu selain Allah. Allah akan memberi keputusan di antara mereka pada hari kiamat. Sesungguhnya Allah menyaksikan segala sesuatu yang telah mereka kerjakan, tidak ada yang dapat tersembunyi dari pengawasan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, Sabi’in} orang-orang yang tetap dalam fitrahnya, tidak ada agama apapun yang mereka ikuti {orang-orang Nasrani, Majusi} penyembah api {dan orang-orang yang meusyrik} menyembah berhala {sesungguhnya Allah akan memutuskan} menentukan putusan dan hukum {di antara mereka pada hari kiamat. Sesungguhnya Allah menjadi saksi atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Allah memberitahukan mengenai golongan-golongan penduduk bumi, dari kalangan yang diberi al-kitab, yaitu dari kalangan kaum Mukminin, Yahudi, Nasrani, kaum Shabi’in dan dari kalangan kaum Majusi serta kaum Musyrikin, bahwa Allah akan menghimpun mereka seluruhnya di Hari KIamat kelak, dan menetapkan keputusan di antara mereka dengan hukumNya yang adil, serta membalasi mereka berdasarkan amalan-amalan yang telah Allah simpan, tulis, dan saksikan. Oleh karena itu, Allah berfirman, “SEsungguhnya Allah menyaksikan segala sesuatu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 17: Shaabi’in menurut sebagian mufassir adalah golongan dari Yahudi. Dengan adil dan akan membalas amal mereka yang telah dijaga-Nya, dicatat-Nya dan diksaksikan-Nya. Dia akan memutuskan bahwa orang-orang mukmin akan masuk ke dalam surga dan memutuskan bahwa selain mereka akan masuk ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 17",
    "description": "Dalam kehidupan dunia perbedaan agama dan keyakinan itu kadang-kadang tidak terlihat pengaruhnya terhadap keberhasilan dan kegagalan hidup, tetapi berbeda dengan di akhirat. Sesungguhnya orang-orang beriman, orang yahudi, orang sabiin, orang nasrani, orang majusi dan orang musyrik, nasib mereka di akhirat berbeda. Allah pasti memberi keputusan di antara mereka pada hari kiamat, orang beriman mendapat rida Allah dan masuk surga, sedangkan orang-orang yang tidak ber-iman mendapat murka Allah dan masuk neraka. Sungguh, Allah menjadi saksi atas segala sesuatu yang terjadi pada diri mereka selama hidup di dunia. 18. Apakah kamu tidak memperhatikan semua yang ada di langit dan semua yang ada di bumi bersujud kepada Allah, tunduk dan patuh kepada hukum alam ciptaan Allah seperti matahari, bulan, dan bintang yang setia beredar pada porosnya. Dan juga gunung-gunung, pepohonan, dan hewan-hewan melata, semuanya menjalani kehidupan secara alamiah mematuhi hukum alam yang berlaku. Dan demikian juga, banyak di antara manusia yang mematuhi hukum Allah karena kesadarannya, tetapi lebih banyak lagi manusia yang pantas mendapatkan azab Allah di dunia maupun akhirat, karena sikapnya yang menolak agama Allah. Barang siapa dihinakan Allah, karena sikap mereka yang lebih hina dari binatang, maka terhadap manusia yang bersikap demikian, tidak seorang pun yang akan memuliakannya selain Allah. Sungguh, Allah berbuat apa saja yang dia kehendaki, memuliakan yang layak dimuliakan atau menghinakan yang menutup diri dari petunjuk Allah."
  }
]