[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah Kamu (wahai Rasul) belum tahu bahwa sesungguhnya Allah, bersujud kepadaNya dengan tunduk lagi patuh makhluk yang ada di langit dan yang ada di bumi, juga matahari, bulan, bintang-bintang, gunung-gunung, pepohonan, dan hewan yang bergerak (hidup)? Dan banyak manusia yang bersujud kepada Allah dengan penuh ketaatan dan kemauan sendiri, yaitu orang-orang Mukmin. Dan banyak juga manusia yang telah pasti azab akan meninpanya, maka dia adalah seorang yang hina. Dan manusia manapun yang dihinakan oleh Allah, maka tidak akan ada seorang pun yang dapat memuliakannya. Sesungguhnya Allah pasti melakukan pada makhluk-makhluk ciptaanNya apa-apa yang Dia kehendaki sejalan dengan kebijaksanaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Tidakkah engkau tahu -wahai Rasul-, bahwa seluruh makhluk yang ada di langit dari kalangan Malaikat dan di bumi dari orang-orang mukmin kalangan jin dan manusia bersujud kepada Allah dengan sujud ketaatan, juga matahari, bulan, bintang-bintang langit, gunung-gunung, pepohonan, dan binatang melata semuanya bersujud kepada Allah dengan sujud ketundukan, dan banyak diantara manusia yang bersujud kepadanya dengan sujud ketaatan, akan tetapi banyak pula diantara manusia yang enggan bersujud taat kepada-Nya, sehingga mereka berhak mendapatkan azab Allah lantaran kekafiran mereka, dan barangsiapa yang ditentukan oleh Allah agar hina dan tercela karena kekufurannya, maka tidak akan ada seorang pun yang akan memuliakannya. Sungguh Dia berbuat apa saja yang Dia kehendaki, tidak ada yang memaksanya untuk berbuat sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18.Tidakkah kamu mengetahui bahwa kepada Allah bersujud dan tunduk segala yang ada di tujuh langit dan bumi, matahari, bulan, bintang-bintang, gunung-gunung, orang-orang beriman yang tunduk dengan kerelaan, dan orang-orang kafir yang tunduk dengan terpaksa? Dan barangsiapa yang dihinakan Allah maka tidak akan ada yang dapat memuliakannya, tidak ada yang dapat mengelakkan kehinaan darinya. Allah melakukan apa yang Dia kehendaki terhadap makhluk-Nya sesuai dengan hikmah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. أَلَمْ تَرَ أَنَّ اللهَ يَسْجُدُ لَهُۥ مَن فِى السَّمٰوٰتِ (Apakah kamu tiada mengetahui, bahwa kepada Allah bersujud apa yang ada di langit) Yakni para malaikat. وَمَن فِى الْأَرْضِ(dan apa yang ada di bumi) Yakni orang-orang beriman dari golongan manusia dan jin. Yang dimaksud dengan sujud di sini adalah sujud ketaatan yang dilakukan oleh makhluk-makhluk yang berakal. وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَآبُّ(matahari, bulan, bintang, gunung, pohon-pohonan, binatang-binatang yang melata) Sujud benda-benda ini adalah sujud kepatuhan sepenuhnya. وَكَثِيرٌ مِّنَ النَّاسِ ۖ( dan sebagian besar daripada manusia) Yakni dan banyak manusia yang bersujud kepada-Nya dengan sujud ketaatan. وَكَثِيرٌ حَقَّ عَلَيْهِ الْعَذَابُ (Dan banyak di antara manusia yang telah ditetapkan azab atasnya) Yakni banyak pula yang enggan untuk bersujud sehingga layak untuk mendapatkan azab. وَمَن يُهِنِ اللهُ فَمَا لَهُۥ مِن مُّكْرِمٍ ۚ( Dan barangsiapa yang dihinakan Allah maka tidak seorangpun yang memuliakannya) yakni barangsiapa yang dihinakan Allah dengan menjadikannya orang kafir yang sengsara, maka ia tidak akan mendapatkan orang yang dapat memuliakannya sehingga ia menjadi orang yang bahagia dan terhormat. Yakni orang-orang yang enggan bersujud kepada Allah adalah karena mereka menganggap itu sebagai kehinaan dan kerendahan, padahal sebenarnya itu merupakan kemuliaan bagi orang yang diberi petunjuk oleh Allah. Dan enggan bersujud karena kesombongan merupakan kehinaan yang diberikan Allah bagi yang Dia kehendaki. إِنَّ اللهَ يَفْعَلُ مَا يَشَآءُ (Sesungguhnya Allah berbuat apa yang Dia kehendaki) Termasuk dalam memuliakan dan menghinakan manusia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Di sini pepohonan.. dan di sana bintang-bintang.. dan ini bulan.. dan itu gunung-gunung.. di sini dan di sana binatang-binatang melata yang besar dan kecil, jika semua dkumpulkan dihadapanmu sedang kamu berada di tengah daratan, atau kamu sedang berjalan di suatu jalan, maka ingatlah bahwa mereka semuanya bersujud kepada Allah { أَلَمْ تَرَ أَنَّ ٱللَّهَ يَسْجُدُ لَهُۥ مَن فِى ٱلسَّمَٰوَٰتِ وَمَن فِى ٱلْأَرْضِ وَٱلشَّمْسُ وَٱلْقَمَرُ وَٱلنُّجُومُ وَٱلْجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ } \"Apakah kamu tiada mengetahui, bahwa kepada Allah bersujud apa yang ada di langit, di bumi, matahari, bulan, bintang, gunung, pohon-pohonan, binatang-binatang yang melata\". 2 ). Semua benda-benda padat, tumbuh-tumbuhan, dan hewan sujud kepada Allh.. dengan jumah mereka yang besar.. juga ada diantaranya yang lemah tidak dapat mengikuti sistem yang ada. 3 ). Brangsiapa yang belum mengenal jalan menuju Rabb nya dan tidak pula berusaha untuk mengenalnya, maka ia masuk dalam golongan orang hina yang dikatakan dalam ayat : { وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكْرِمٍ } \"Dan barangsiapa yang dihinakan Allah maka tidak seorangpun yang memuliakannya\". 4 ). Allah befirman dala ayat tentang sujudnya makhluk kepada-Nya: { وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكْرِمٍ }; sesungguhnya ketika mereka mampu untuk sujud kepada Allah, namun menyembunyikannya, dan tidak melakukannya; niscaya Allah akan menghinakan mereka dan tidak siapa pun yang akan memuliakan, siapakah yang mampu memuliakan orang yang dihinakan oleh Allah? atau adakah yang dapat menghinakan orang yang dimuliakan oleh Allah?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Apakah kamu tidak mengetahui, bahwa apa yang ada di langit yaitu para malaikat, dan penduduk bumi yaitu para mukmin dari golongan manusia dan para jin. Serta matahari, bulan, bintang, gunung, pohon-pohonan, binatang-binatang yang melata, semua makhluk dan sebagian besar manusia dengan mengharap rahmat bersujud kepada Allah? Banyak di antara manusia yang telah ditetapkan azab atasnya sebab keengganan mereka untuk sujud dan keengganan mereka melihat kekuasaan Allah. Barangsiapa yang dihinakan Allah maka dia dijadikan bergelimang dalam kekufuran dan kesengsaraan. Tidak ada seorangpun yang akan memuliakannya atau menghilangkan kehinaan mereka. Sesungguhnya Allah Maha berbuat atas apapun yang Dia kehendaki."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak mengetahui} apakah kamu tidak mengetahui {bahwa siapa saja yang ada di langit, yang ada di bumi, matahari, bulan, bintang, gunung, pohon, hewan melata, dan kebanyakan manusia itu bersujud kepadaNya. Dan banyak yang pantas menerima} layak baginya {azab. Siapa saja yang dihinakan Allah} dihinakan dan direndahkan Allah {maka tidak seorang pun yang akan memuliakannya} maka tidak ada satupun orang yang memuliakannya {Sesungguhnya Allah melakukan apa yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Di tengah ayat-ayat ini, Allah menyisipkan penjelasan mengenai sujudnya para makhluk kepadaNya, seluruh makhluk yang berada di langit dan di bumi, matahari, bulan, bintang-bintang, gunung-gunung, pepohonan, bangsa hewan yang mencakup selurih binatang, dan kebanyakan dari kalangan manusia. Mereka adalah kaum Mukminin “dan banyak dari manusia yang telah ditetapkan azab atasnya,” maksudnya pasti dan telah ditetapkan lantaran kekufurannya dan tidak beriman. Allah tidak melimpahkan taufik baginya untuk menjadi orang beriman, karena Allah menghinakannya “dan barangsiapa yang dihinakan Allah, maka tidak seorang pun yang memuliakannya.” Tidak ada yang dapat membendung apa yang diinginkan oleh Allah, dan tidak ada penentang terhadap kehendakNya. Jika semua makhluk bersujud kepada (Allah), tunduk kepada keagunganNya, merasa tak berdaya di hadapan keperkasaanNya, patuh kepada kekuasaanNya, maka hal ini menandakan bahwa Dia-lah semata rabb yang berhak disembah, Raja yang terpuji (satu-satunya). Dan menunjukkan bahwa orang yang berpaling dariNya dengan menyembah kepada selain Allah, maka sungguh dia telah tersesat dengan kesesatan yang nyata, dan merugi dengan kerugian yang jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 18: Semua tunduk kepada-Nya. Mereka adalah kaum mukmin dengan ditambah ketundukan mereka dalam sujud ketika shalat. Mereka adalah kaum kafir, karena mereka enggan sujud disebabkan tidak ada iman dalam diri mereka. Seperti memuliakan dan menghinakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 18",
    "description": "Apakah kamu tidak memperhatikan semua yang ada di langit dan semua yang ada di bumi bersujud kepada Allah, tunduk dan patuh kepada hukum alam ciptaan Allah seperti matahari, bulan, dan bintang yang setia beredar pada porosnya. Dan juga gunung-gunung, pepohonan, dan hewan-hewan melata, semuanya menjalani kehidupan secara alamiah mematuhi hukum alam yang berlaku. Dan demikian juga, banyak di antara manusia yang mematuhi hukum Allah karena kesadarannya, tetapi lebih banyak lagi manusia yang pantas mendapatkan azab Allah di dunia maupun akhirat, karena sikapnya yang menolak agama Allah. Barang siapa dihinakan Allah, karena sikap mereka yang lebih hina dari binatang, maka terhadap manusia yang bersikap demikian, tidak seorang pun yang akan memuliakannya selain Allah. Sungguh, Allah berbuat apa saja yang dia kehendaki, memuliakan yang layak dimuliakan atau menghinakan yang menutup diri dari petunjuk Allah. 19. Pada ayat 17 surah al-'ajj disebutkan enam golongan manusia, orang beriman, yahudi, nasrani, sabiin, majusi, dan orang-orang musyrik. Mereka sebenarnya terbagi dua. Inilah dua golongan, mukmin dan kafir, yang bertengkar tentang keyakinan. Mereka bertengkar mengenai tuhan mereka. Maka bagi orang kafir yang menolak prinsip tauhid dari lima golongan di atas, akan dibuatkan untuk mereka di akhirat pa-kaian-pakaian dari api neraka yang membalut tubuh mereka. Selain itu, ke atas kepala mereka di dalam neraka itu akan disiramkan air yang mendidih hingga tubuh mereka terkelupas."
  }
]