[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-22. Inilah dua golongan yang berselisih tentang Tuhan mereka, yaitu golongan yang beriman dan golongan kafir. Masing-masing mengaku sebagai pihak yang benar. Orang-orang yang kafir dikelilingi oleh siksaan dalam bentuk pakaian yang dibuatkan bagi mereka dari neraka yang mereka kenakan, lalu membakar tubuh-tubuh mereka. Dan dituangkan pada kepala-kepala mereka air yang sudah mencapai derajat tertinggi dalam panasnya, Yang kemudian mengalir turun kedalam rongga tubuh mereka, sehingga melelehkan semua yang ada di dalamnya, sampai menembus kulit-kulit mereka, lalu membakarnya, dan kulit-kulit mereka pun berjatuhan. Dan malaikat memukul mereka pada kepala mereka dengan palu-palu besi. Tiap kali mereka akan keluar dari neraka, (lantaran beratnya kesulitan dan kesengsaraan mereka di sana), mereka dikembalikan lagi ke siksaan di dalamnya, dan dikatakan kepada mereka, “Rasakanlah oleh kalian siksaan neraka yang membakar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. \"Inilah dua golongan yang berselisih mengenai Tuhan mereka, siapakah di antara keduanya yang benar; golongan yang beriman ataukah golongan yang kafir? Maka bagi golongan yang kafir niscaya kelak akan diselimuti api Neraka seperti pakaian yang menyelimuti orang yang memakainya, dan dari atas kepala mereka akan disiramkan air mendidih yang sangat panas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-22. Inilah dua golongan yang saling berselisih, yaitu antara orang-orang beriman dan orang-orang kafir; setiap golongan mengaku berada di atas kebenaran. Orang-orang beriman ingin membela agama Allah, sedangkan orang-orang kafir ingin memadamkan cahaya keimanan. Dan perselisihan mereka akan mendapat keputusan hukumnya; orang-orang kafir akan ditetapkan bagi mereka pakaian dari api yang sesuai dengan badan mereka, kepala mereka akan disiram air yang mendidih oleh api neraka Jahannam sehingga usus dan lambung yang ada dalam perut mereka meleleh, dan kulit mereka terkelupas, dan disiapkan bagi mereka palu dari besi untuk memukul mereka, dan setiap kali mereka ingin lari dari kengerian neraka maka mereka akan dikembalikan kepadanya dan mendapat olokan: “Rasakanlah azab neraka Jahannam”."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. هٰذَانِ خَصْمَانِ (Inilah dua golongan yang bertengkar) Golongan pertama adalah orang-orang Yahudi, Nasrani, Shabi’in, Majusi, dan Musyrik; dan golongan kedua adalah orang-orang Islam. Kedua golongan ini adalah dua golongan yang saling berselisih. Pendapat lain mengatakan dua golongan ini adalah orang-orang yang saling bertarung di perang Badar pada awal perang. Dari golongan orang-orang beriman adalah Hamzah, Ali, dan Ubaidah; sedangkan dari golongan orang-orang kafir adalah Utbah, Syaibah bin Rabi’ah, dan Walid bin Utbah. اخْتَصَمُوا۟ فِى رَبِّهِمْ ۖ (mereka saling bertengkar mengenai Tuhan mereka) Yakni tentang agama-Nya, Dzat-Nya, sifat-sifat-Nya, atau syariat-Nya bagi hamba-hamba-Nya. فَالَّذِينَ كَفَرُوا۟ قُطِّعَتْ لَهُمْ ثِيَابٌ مِّن نَّارٍ(Maka orang kafir akan dibuatkan untuk mereka pakaian-pakaian dari api neraka) Yakni api itu dibentuk kemudian dijadikan pakaian bagi mereka. يُصَبُّ مِن فَوْقِ رُءُوسِهِمُ الْحَمِيمُ(Disiramkan air yang sedang mendidih ke atas kepala mereka) Makna (الحميم) adalah air panas yang mendidih karena api neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Inilah dua golongan yaitu golongan mukmin dan golongan kafir yang bertengkar, mereka saling bertengkar mengenai Tuhan mereka atau tentang agama. Mana yang disebut kebenaran dan mana yang disebut kebatilan, serta hal yang berkaitan dengan sekutu Tuhan dan anak Tuhan. Serta dianggap memiliki anak dan juru selamat. Maka orang kafir yang mengingkari Allah dan rasul-Nya akan dibuatkan untuk mereka pakaian-pakaian dari api neraka. Disiramkan air yang sedang mendidih ke atas kepala mereka. Ayat ini turun untuk dua kelompok yang sedang berperang di perang Badr yaitu Hamzah, Ubaidah, dan Ali dengan Utbah, Syaibah, dan Walid bin Utbah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Inilah dua golongan yang bertengkar} dua golongan yang bertentangan, golongan orang-orang mukmin dan golongan orang-orang kafir {Mereka bertengkar} bereka berselisih {tentang Tuhan mereka} tentang masalah Tuhan mereka {Bagi orang-orang yang ingkar dibuatkan} dijahitkan dan dicirikan {pakaian dari api. Disiramkan dari atas kepala mereka air yang mendidih} air yang sangat panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-22. Setelah itu Allah menjelaskan penetapan keputusan ini dengan berfirman, “Inilah dua golongan (golongan Mukmin dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Rabb mereka.” Setiap pihak mengklaim berada di atas jalan kebenaran. “Maka orang kafir.”lafazh ini meliputi setiap orang kafir dari bangsa Yahudi, Nasrani, Majusi, Shabi’in dan kaum musyrikin “akan dibuatkan untuk mereka pakaian-pakaian dari api neraka,” maksudnya dibuatkan baju bagi mereka yang terbuat dari cairan ter, dinyalakan api padanya, supaya siksaan mengenai mereka secara merata dari semua sisi. “Disiramkan air yang sedang mendidih ke atas kepala mereka,” yaitu air yang sangat panas sekali. “Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka),” seperti daging, lemak serta usus-usus, karena dahsyatnya panas dan kengerian peristiwanya. “Dan untuk mereka cambuk-cambuk dari besi,” yang berada di tangan para malaikat yang kasar lagi keras. Para malaikat memukuli dan menghantam mereka dengannya. Setiap kali mereka hendak keluar dari neraka, niscaya mereka dikembalikan ke dalamnya. Sehingga siksaan tidak diredakan dari mereka, dan mereka tidak mendapatkan tempo. Dikatakan kepada mereka sebagai pencelaan “Rasakanlah azab yang membakar ini,” yakni siksaan yang akan membakar hati dan tubuh-tubuh mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 19: Imam Bukhari meriwayatkan dengan sanadnya dari Abu Dzar ia berkata, “Turun ayat, “Inilah dua golongan (golongan mukmin dan kafir) yang bertengkar, mereka bertengkar mengenai Tuhan mereka…dst.” tentang enam orang Quraisy, yaitu Ali, Hamzah, dan Ubaidah bin Harits dengan Syaibah bin Rabi’ah, Utbah bin Rabii’ah dan Al Walid bin ‘Utbah.” Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Qais bin ‘Ubaad, ia berkata, “Aku mendengar Abu Dzar bersumpah sebuah sumpah, “Sesungguhnya ayat, “Dua golongan (golongan mukmin dan kafir) yang bertengkar, mereka bertengkar mengenai Tuhan mereka…dst.” Turun berkenaan orang-orang yang melakukan perang tanding pada peperangan Badar, yaitu Hamzah, Ali dan Ubaidah bin Harits dengan Utbah dan Syaibah yang keduanya adalah putera Rabi’ah, dan Al Walid bin ‘Utbah.” Masing-masing menyangka bahwa agamanya yang benar, padahal hanya Islam saja yang benar. Mencakup semua orang kafir, baik Yahudi, Nasrani, Majusi, Shaabi’in dan orang-orang musyrik. Yakni pakaian dari ter, lalu dinyalakan dengan api, agar azab rata mengena mereka dari semua sisi. Sehingga mereka terkepung api."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 19",
    "description": "Pada ayat 17 surah al-'ajj disebutkan enam golongan manusia, orang beriman, yahudi, nasrani, sabiin, majusi, dan orang-orang musyrik. Mereka sebenarnya terbagi dua. Inilah dua golongan, mukmin dan kafir, yang bertengkar tentang keyakinan. Mereka bertengkar mengenai tuhan mereka. Maka bagi orang kafir yang menolak prinsip tauhid dari lima golongan di atas, akan dibuatkan untuk mereka di akhirat pa-kaian-pakaian dari api neraka yang membalut tubuh mereka. Selain itu, ke atas kepala mereka di dalam neraka itu akan disiramkan air yang mendidih hingga tubuh mereka terkelupas. 20-21. Dengan air mendidih yang disiramkan ke atas kepala orang-orang kafir itu akan dihancurluluhkan apa yang ada dalam perut dan kulit mereka; kemudian setiap kulit mereka hancur, maka Allah memperbaruinya agar mereka terus merasakan azab Allah. Dan juga azab untuk mereka adalah cambuk-cambuk dari besi untuk memukuli mereka hingga hancur luluh."
  }
]