[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari ketika kalian menyaksikan datangnya Hari Kiamat, sang ibu melupakan bayinya yang masih menyusu pada putingnya, lantaran masalah berat yang dia alami, wanita hamil keguguran janinnya dikarenakan rasa takut yang amat besar, dan akal-akal manusia hilang, dimana mereka layaknya orang-orang mabuk disebabkan dahsyatnya kengerian dan keterkejutan, namun mereka tidak sedang mabuk karena minum khamar. Akan tetapi, dahsyatnya siksaan menyebabkan mereka kehilangan akal dan kesadaran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Yaitu pada hari ketika kalian menyaksikannya, ketika perempuan yang sedang menyusui akan lalai dari anak yang disusuinya, setiap perempuan hamil akan menggugurkan janin dalam kandungannya lantaran dahsyatnya rasa takut pada hari itu. Dan kalian akan menyaksikan manusia seperti dalam keadaan mabuk karena tak lagi bisa berpikir lantaran dahsyatnya kondisi saat itu, padahal sebenarnya tidaklah mabuk seperti halnya peminum khamar, akan tetapi azab Allah itu sangat keras sehingga sanggup menghilangkan akal pikiran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hari ketika kalian menyaksikan kejadian hari kiamat berupa gunung-gunung yang hancur, lautan yang meledak, langit yang terpecah belah. Pada hari itu seorang ibu akan lupa terhadap bayinya, dan wanita yang hamil akan keguguran; dan seluruh manusia akan tercengang melihat kengerian ini seakan-akan mereka sedang mabuk karena minuman keras, padahal mereka tidak sedang mabuk. Dan azab yang ditunggu orang-orang yang bermaksiat sangatlah berat. Dari Abu Sa’id Al-Khudri dia berkata, Nabi bersabda: “Allah pada hari kiamat berfirman: ‘Wahai Adam, lalu Adam berkata; ‘Aku penuhi panggilan-Mu dan kebahagian ada di tangan-Mu wahai Rabb. Lalu dia diseru: Sesungguhnya Allah memerintahkan kepadamu untuk mengeluarkan dari keturunanmu ba’tsunnar (utusan-utusan ke neraka). Adam berkata: Ya Rabb, apa yang Engkau maksud Ba’tsunnar (utusan-utusan neraka) itu? Allah berfirman: ‘Dari setiap 1000 orang terdapat -aku rasa dia bersabda- 999 orang ba’tsunnar’. Kemudian beliau bersabda: ‘Maka pada saat itu wanita yang hamil gugur kandungannya, anak kecil akan beruban, dan kamu melihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk, akan tetapi azab Allah itu sangat kerasnya, (Al Hajj: 2). Hal itu sangat terasa berat bagi umat manusia, hingga wajah mereka berubah. Rasulullah bersabda: ‘999 orang itu adalah dari Ya’juj dan Ma’juj dan satu orangnya dari kalian.’ Rasulullah kemudian bersabda: ‘Adapun kalian pada hari kiamat dalam bandingan seluruh manusia seperti sehelai bulu hitam pada kulit sapi yang berwarna putih, atau seperti sehelai bulu putih pada kulit sapi yang berwarna hitam. Dan sungguh aku berharap kalian menjadi seperempat dari penduduk surga’. Maka kami (para sahabat) bertakbir. Kemudian beliau bersabda: ‘Aku berharap kalian adalah sepertiga dari penduduk surga’, Maka kami bertakbir. Kemudian beliau bersabda: ‘Sungguh aku berharap kalian adalah setengah dari penduduk surga.’ Kami pun bertakbir kembali.” (Shahih a-Bukhari 8/295 no. 4741, kitab tafsir surat al-Hajj, bab {وترى الناس سكارى})."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ أَرْضَعَتْ (pada hari (ketika) kamu melihat kegoncangan itu, lalailah semua wanita yang menyusui anaknya dari anak yang disusuinya) Yakni ketika kalian melihat goncangan itu membuat orang yang menyusui menjadi lalai dan lupa dari anak yang disusuinya, seakan-akan ia tidak memiliki anak yang masih menyusu; hal ini karena kengerian yang dahsyat ketika itu. وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا(dan gugurlah kandungan segala wanita yang hamil) Yakni keluar kandungannya sebelum waktu kelahirannya, disebabkan dahsyatnya kejadian waktu itu. وَتَرَى النَّاسَ سُكٰرَىٰ(dan kamu lihat manusia dalam keadaan mabuk) Yakni orang yang melihat mereka akan mengira mereka sedang dalam keadaan mabuk. وَمَا هُم بِسُكٰرَىٰ(padahal sebenarnya mereka tidak mabuk) Sesungguhnya mereka tidak mabuk. وَلٰكِنَّ عَذَابَ اللهِ شَدِيدٌ (akan tetapi azab Allah itu sangat kerasnya) Karena kengerian yang dahsyat ini menyebabkan akal mereka hilang dan pemahaman mereka goyang sehingga mereka seperti orang-orang yang mabuk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Seorang muslim tatkala membaca firman Allah: { إِنَّ زَلْزَلَةَ ٱلسَّاعَةِ شَىْءٌ عَظِيمٌ } \"sesungguhnya kegoncangan hari kiamat itu adalah suatu kejadian yang sangat besar (dahsyat)\" akan terkejut bagaimana seorang ibu akan rela meninggalkan anak bayinya yang sedang menyusu! Dan mencoba untuk membayangkan bagaimana manusia ketika itu seperti orang-orang gila, namun ia tidak mampu membayangkan peristiwa itu padahal ia mengimaninya, maka ketika peristiwa tsunami yang terjadi di Jepang menggambarkan suatu kejadian yang dahsyat, akan terpkirkan dalam benaknya bahwa peristiwa itu hanyalah gambaran kecil dari peristiwa kiamat; maka dengan demikian keimanannya akan bertambah, kecuali orang-orang yang masih tersimpan di dalam hatinya penyakit dan kekafiran. 2 ). Peristiwa yang dahsyat diwarnai oleh kejadian yang menakjubkan: Pepohonan tidak akan dihisab dan dimintai pertangung jawabannya! dan nyamuk pun tidak akan ditanya atas apa yang ia perbuat di dunia! dan semut yang kecil tidak akan ditimbang pada hari kiamat! bahkan kucing yang identik dengan keramahan dan kelembutan tidak akan ditampakkan di surga dan tidak juga d neraka! namun kenapa ayat menggambarkan kejadian pada hari itu secara umum bahwa yang hamil akan menjatuhkan kandungannya, hal ini menunjukkan bahwa kejadian itu benar-benar sangat mengerikan dan menakutkan. 3 ). { يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا } Umumnya diketahui dalam bahasa arab bahwa seorang wanita yang menyusui anaknya disebut dengan murdhi' (مُرْضِعٌ), tapi dalam ayat Allah mengatakan: مُرْضِعَةٌ, dan bukan dengan lafadz mudzakkar? dijawab oleh az-Zamakhsyary sebagaimana yang dinukilkan oleh asy-Syanqithi dalam adhwa' al-Bayan: murdhi'ah yakni susu seorang ibu yang sedang menyuapi anaknya; sedangkan lafazd (مرضع) : merupakan adalah seorang ibu yang memiliki anak yang masih menyusui, sekalipun saat itu ia tidak sedang menyusui, ayat ini dijelaskan dengan lafadz (مُرْضِعَةٌ) menunjukkan bahwa kejadian kiamat ketika itu mengejutkan siapapun sampai-sampai seorang bay yang sedang menyusu di pelukan ibunya, sampai harus melepeskan; dikarenakan keadaan yang sangat menakutkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Pada hari ketika kamu melihat goncangan itu, semua wanita yang menyusui, lalai terhadap anak yang disusuinya. Semua kandungan dari para perempuan hamil seketika itu menjadi gugur. Kalian akan melihat manusia dalam keadaan mabuk sebab ketakutan yang sangat besar, padahal sebenarnya mereka tidak mabuk. Akan tetapi azab Allah itu sangat dahsyat, sehingga kegaduhan pada hai itu membuat payah siapapun yang ada dan menghilangkan akal mereka. Dua ayat ini turun pada waktu malam saat peperangan dengan Bani Mushthaliq. Rasul membacakannya kepada semua orang, sehingga tidak ada yang lebih mengharukan dari pada malam itu. Sehingga orang-orang bersedih dan memikirkannya terus menerus"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari kalian melihatnya, semua perempuan yang menyusui melupakan} melalaikan {anak yang disusui} anak yang dia susui {setiap perempuan yang hamil akan keguguran kandungannya dan kamu melihat manusia mabuk, padahal mereka tidak mabuk. Akan tetapi azab Allah itu sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Oleh karenannya, Allah berfirman, “(Ingatlah) pada hari (ketika) kamu melihat kegoncangan itu, semua wanita yang menyusui anaknya lalai dari anak yang disusuinya,” padahal seorang ibu tercipta dengan bawaan sangat mencintai anaknya. Terutama dalam kondisi tersebut (masa penyusuan) yang ia (bayi) tidak bisa hidup kecuali bersama ibunya. “Dan segala kandungan wanita yang hamil menjadi gugur,” karena kerisauan dan ketakutan yang sangat dahsyat. “Dan kamu lihat manusia dalam keadaan mabuk, padahal mereka sebenarnya tidak mabuk,” maksudnya engkau wahai orang yang melihat, mengira mereka sedang mabuk karena minum minuman keras. Padahal mereka tidak sedang dilanda mabuk. “Akan tetapi azab Allah itu sangat keras.” Oleh sebab itu, azab itu sanggup meniadakan akal-akal sehat mereka dan mengosongkan hati-hati mereka serta menjejalinya dengan perasaan gelisah. Jantung-jantung sudah sampai ke tenggorokan. Pandangan-pandangan mata menjadi terbelalak. [Dan] pada hari itu, seorang ayah tidak bisa membela anaknya. Demikian juga, anak tidak kuasa membela ayah kandungnya sedikit pun. Pada hari itu, seseorang lari dari saudaranya, ibunya, ayahnya, istrinya dan anak-anaknya serta dari familinya yang melindungi dirinya. Setiap orang pada hari itu, mempunyai urusan yang menyibukannya. Di sana, orang yang zhalim akan mengigit jari seraya berkata, “Aduhai kiranya aku dulu meniti jalan bersama rasul. Aduhai kiranya aku dahulu tidak menjadikan fulan sebagai kawan akrab. Pada hari itu, ada wajah yang menghitam, dan ada wajah yang berubah putih berseri, timbangan-timbangan yang digunakan untuk menghitung berat biji sawi kebaikan dan kejelekan ditegakkan. Lembaran-lembaran amalan dengan seluruh kandungan amalan dan ucapan serta niat-niat, kecil atau besar disebarkan (kepada para pemiliknya). Jalan shirath dibentangkan di atas perut Jahanam. Surge didekatkan bagi kaum muttaqin (orang-orang yang bertakwa). Neraka Jahim diperlihatkan bagi orang-orang yang sesat. Bila ia (Neraka Jahim) melihat mereka dari kejauhan, maka mereka akan mendengar kegeraman dan suara nyalanya. Dan apabila mereka dilemparkan ke tempat yang semit di neraka itu dengan dibelenggu, mereka di sana mengharapkan kebinasaan. Dan akan dkatakan kepada mereka, “Jangan kamu sekalian mengharapkannya satu kebinasaan, (namun) harapkanlah kebinasaan yang banyak.” Apabila mereka memanggil-manggil Rabb mereka, supaya sudi mengeluarkan dari neraka, maka Allah berkata, “HInalah kalian di dalamnya. Jangan sekali-kali mengajak bicara kepadaKu.” Rabb kalian Yang Maha Penyayang telah murka, dan siksaan yang pedih telah mendatangi kalian. Mereka pun putus asa dari setiap kebaikan. Mereka menjumpai seluruh aktivitas amalan mereka, tanpa kehilangan sekecil kulit aria tau qithmir (kulit tipis). Begitulah… sementara itu, kaum yang bertakwa berada dalam perasaan penuh suka cita di taman-taman surge. Dan mereka bergelimang keceriaan dalam beraneka macam kenikmatan. Mereka kekal dalam suasana kenikmatan yang disukai oleh jiwa-jiwa mereka. Sepatutnya bagi orang cerdas yang mengetahui semua peristiwa ini akan datang di hadapannya, maka dia harus mempersiapkan bekal untuk menyongsongnya, jangan sampai angan-angan kosong melalaikanya, hingga akhirnya dia meninggalkan untuk beramal. Hendaknya ketakwaan kepada Allah merupakan semboyannya, rasa takut kepadaNya menjadi selimut yang menutupinya, serta kecintaan dan dzikir kepadaNya menjadi ruh seluruh aktivitasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 2: Padahal seorang ibu biasanya sangat memperhatikan anaknya, namun karena kerasnya guncangan itu sehingga membuatnya sampai tidak memperhatikan lagi anaknya. Karena demikian kagetnya. Yakni kamu kira. Sehingga membuat mereka tidak sadar, hatinya kosong dan penuh rasa kaget, hatinya naik ke atas dan matanya terbelalak. Pada hari itu, seorang bapak tidak dapat menolong anaknya dan seorang anak tidak dapat pula menolong bapaknya. Ketika itu, seseorang lari dari saudaranya, dari ibu dan bapaknya, dari istri dan anaknya, dan masing-masing sibuk dengan dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 2",
    "description": "Ingatlah wahai manusia, pada hari ketika kamu melihatnya, goncangan dahsyat pada hari kiamat itu, semua perempuan yang menyusui anaknya akan lalai terhadap anak yang disusuinya, karena terkejut dan panik; dan setiap perempuan yang hamil akan keguguran kandungannya, karena goncangan dahsyat itu; dan kamu melihat manusia dalam keadaan mabuk, seperti orang yang tidak sadar, padahal sebenarnya mereka tidak mabuk tetapi azab Allah yang terjadi pada hari kiamat itu sangat keras dirasakan oleh orang-orang kafir. 3. Meskipun Allah telah menjelaskan azab yang sangat keras pada hari kiamat bagi orang kafir dan mengajak manusia untuk bertakwa kepada-Nya, tetapi di antara manusia, yang kafir dan keras kepala, ada yang saling membantah tentang Allah, mengingkari agama Allah, tidak meyakini kehidupan sesudah mati, dan tidak meyakini adanya surga dan neraka, tanpa ilmu yang benar; dan mereka mengingkari Allah itu hanya mengikuti bisikan para setan yang sangat jahat membujuk dan menipu manusia."
  }
]