[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-22. Inilah dua golongan yang berselisih tentang Tuhan mereka, yaitu golongan yang beriman dan golongan kafir. Masing-masing mengaku sebagai pihak yang benar. Orang-orang yang kafir dikelilingi oleh siksaan dalam bentuk pakaian yang dibuatkan bagi mereka dari neraka yang mereka kenakan, lalu membakar tubuh-tubuh mereka. Dan dituangkan pada kepala-kepala mereka air yang sudah mencapai derajat tertinggi dalam panasnya, Yang kemudian mengalir turun kedalam rongga tubuh mereka, sehingga melelehkan semua yang ada di dalamnya, sampai menembus kulit-kulit mereka, lalu membakarnya, dan kulit-kulit mereka pun berjatuhan. Dan malaikat memukul mereka pada kepala mereka dengan palu-palu besi. Tiap kali mereka akan keluar dari neraka, (lantaran beratnya kesulitan dan kesengsaraan mereka di sana), mereka dikembalikan lagi ke siksaan di dalamnya, dan dikatakan kepada mereka, “Rasakanlah oleh kalian siksaan neraka yang membakar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Setiap kali mereka hendak keluar dari neraka lantaran dahsyatnya azab dan kesengsaraan yang mereka dapatkan, mereka dikembalikan lagi ke dalamnya, dan dikatakan kepada mereka, \"Rasakanlah azab Neraka yang membakar ini.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. كُلَّمَآ أَرَادُوٓا۟ أَن يَخْرُجُوا۟ مِنْهَا (Setiap kali mereka hendak ke luar darinya) Yakni dari neraka. مِنْ غَمٍّ(lantaran kesengsaraan) Yakni akibat kesengsaraan yang ada di neraka. أُعِيدُوا۟ فِيهَا(mereka dikembalikan ke dalamnya) Yakni dikembalikan ke neraka dengan dipukul menggunakan cambuk-cambuk besi itu. وَذُوقُوا۟ عَذَابَ الْحَرِيقِ (Rasailah azab yang membakar ini) Yakni dan dikatakan kepada mereka “rasakanlah azab yang membakar ini”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Setiap kali mereka ingin keluar dari neraka lantaran kesengsaraan mereka, niscaya mereka dikembalikan ke dalamnya. Kepada mereka dikatakan, \"Rasakanlah azab yang membakar dan sanagat membara ini\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap kali hendak keluar darinya karena tersiksa} karena penderitaan yang mereka dapatkan {mereka dikembalikan ke dalamnya} mereka dikembalikan kepadanya {“Rasakanlah} dikatakan kepada mereka,”Rasakanlah {azab yang membakar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-22. Setelah itu Allah menjelaskan penetapan keputusan ini dengan berfirman, “Inilah dua golongan (golongan Mukmin dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Rabb mereka.” Setiap pihak mengklaim berada di atas jalan kebenaran. “Maka orang kafir.”lafazh ini meliputi setiap orang kafir dari bangsa Yahudi, Nasrani, Majusi, Shabi’in dan kaum musyrikin “akan dibuatkan untuk mereka pakaian-pakaian dari api neraka,” maksudnya dibuatkan baju bagi mereka yang terbuat dari cairan ter, dinyalakan api padanya, supaya siksaan mengenai mereka secara merata dari semua sisi. “Disiramkan air yang sedang mendidih ke atas kepala mereka,” yaitu air yang sangat panas sekali. “Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka),” seperti daging, lemak serta usus-usus, karena dahsyatnya panas dan kengerian peristiwanya. “Dan untuk mereka cambuk-cambuk dari besi,” yang berada di tangan para malaikat yang kasar lagi keras. Para malaikat memukuli dan menghantam mereka dengannya. Setiap kali mereka hendak keluar dari neraka, niscaya mereka dikembalikan ke dalamnya. Sehingga siksaan tidak diredakan dari mereka, dan mereka tidak mendapatkan tempo. Dikatakan kepada mereka sebagai pencelaan “Rasakanlah azab yang membakar ini,” yakni siksaan yang akan membakar hati dan tubuh-tubuh mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 22: Dengan cambuk-cambuk itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 22",
    "description": "Setiap kali mereka, para penghuni neraka, berusaha hendak keluar darinya, yakni neraka, karena tersiksa oleh api yang membalut tubuh, air yang mendidih, dan cambuk yang menghancurkan badan, mereka segera dikembalikan lagi ke dalamnya, karena tidak ada jalan untuk keluar dari neraka, apa lagi kembali ke dunia. Lalu kepada mereka akan dikatakan, 'rasakanlah azab yang membakar ini sebagai balasan atas kekufuran kamu di dunia!'23. Berbeda dengan nasib orang-orang kafir di akhirat, sungguh, Allah akan memasukkan orang-orang yang beriman yang tidak murtad dan mengerjakan kebajikan yang bermanfaat bagi dirinya dan orang banyak ke dalam surga-surga yang mengalir di bawahnya sungai-sungai yang merupakan kenikmatan abadi. Di sana mereka diberi perhiasan gelang-gelang emas dan mutiara, dan pakaian mereka terbuat dari sutera, simbol kebahagiaan dan kenikmatan. Mereka juga mendapat keridaan Allah dan perjum-paan dengan-Nya merupakan kenikmatan tertinggi."
  }
]