[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah memasukkan orang-orang beriman dan beramal shalih ke dalam surga-surga yang kenikmatannya abadi. Yang mengalir sungai-sungai Di bawah istana-istana dan pepohonannya. Dan disana, mereka akan dikenakan perhiasan gelang-gelang emas dan mutiara, dan pakaian keseharian mereka di surga adalah kain sutra, baik lelaki maupun perempuan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Adapun golongan yang beriman maka mereka lah orang-orang yang beriman kepada Allah dan mengerjakan amal saleh, Allah memasukkan mereka ke dalam surga-surga yang dibawah istana dan pepohonannya mengalir sungai-sungai, Allah menghiasi mereka dengan dipakaikan gelang-gelang emas, perhiasan mutiara, dan pakaian yang mereka pakai di dalamnya adalah pakaian sutra.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Allah memasukkan orang-orang beriman yang mengerjakan amal shalih ke dalam surga-surga yang di dalamnya terdapat sungai-sungai yang mengalir di bawah istana-istana dan pepohonannya, mereka mendapat perhiasan yang sangat indah berupa gelang-gelang dari emas dan mutiara, dan pakaian mereka berbahan sutera, baik yang laki-laki maupun yang perempuan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ (Di surga itu mereka diberi perhiasan dengan gelang-gelang dari emas) Yakni Allah akan menghiasi mereka dengan gelang-gelang itu. Atau malaikat yang akan menghiasi mereka atas perintah Allah. وَلُؤْلُؤًا ۖ( dan mutiara) Yakni mereka juga dihiasi dengan mutiara. Makna (اللؤلؤ) adalah apa yang dikeluarkan dari dalam kerang di laut. Al-Qusyairy berpendapat, yang dimaksud adalah gelang-gelang mutiara; dan bukan sesuatu yang tidak mungkin kelak di surga akan terdapat gelang dari mutiara murni sebagaimana terdapat gelang dari emas. وَلِبَاسُهُمْ فِيهَا حَرِيرٌ(dan pakaian mereka adalah sutera) Yakni pakaian jenis ini yang diharamkan bagi mereka di dunia akan menjadi halal bagi mereka di akhirat dan menjadi pakaian mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sesungguhnya Allah memasukkan orang-orang beriman kepada Allah dan rasul-Nya serta mereka yang mengerjakan amal yang saleh yang telah Allah perintahkan, ke dalam surga-surga yang di bawahnya mengalir sungai-sungai. Di surga itu mereka diberi perhiasan dengan gelang-gelang dari emas dengan keindahan yang sangat di dada dan lainnya dan mutiara dari kedalama laut, dan pakaian mereka di surga adalah sutera yang laki-laki dilarang menggunakannya di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan beramal shalih ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Di dalamnya mereka diberi perhiasan} diberi hiasan {dengan gelang dari emas dan mutiara. Pakaian mereka di dalamnya adalah sutra"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Sesungguhnya Allah memasukkan orang-orang beriman dan mengerjakan amal yang shalih ke dalam surge-surga yang di bawahnya mengalir sungai-sungai.” Dan telah diketahui bahwa ciri khas ini tidak cocok disematkan kepada selain kaum Muslimin, yang beriman kepada seluruh kitab Allah dan para RasulNya. “DI surge itu mereka diberi perhiasan dengan gelang-gelang dari emas,” maksudnya dipakaikan gelang-gelang emas di tangan-tangan mereka, kaum lelaki dan perempuan. “Dan pakaian mereka adalah sutra,” kenikmatan mereka menjadi sempurna melalui penyebutan berbagai makanan yang lezat yang telah tercakup oleh makna dari kata surge-surga. Dan penyebutan sungai-sungai yang mengalir, sungai yang berisi air, susu, madu dan khamar, serta beragam sandang dan perhiasan yang mewah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 23: Kepada semua kitab dan semua rasul. Yang ketika di dunia mereka (laki-laki) diharamkan memakainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 23",
    "description": "Berbeda dengan nasib orang-orang kafir di akhirat, sungguh, Allah akan memasukkan orang-orang yang beriman yang tidak murtad dan mengerjakan kebajikan yang bermanfaat bagi dirinya dan orang banyak ke dalam surga-surga yang mengalir di bawahnya sungai-sungai yang merupakan kenikmatan abadi. Di sana mereka diberi perhiasan gelang-gelang emas dan mutiara, dan pakaian mereka terbuat dari sutera, simbol kebahagiaan dan kenikmatan. Mereka juga mendapat keridaan Allah dan perjum-paan dengan-Nya merupakan kenikmatan tertinggi. 24. Dan mereka, para penghuni surga diberi petunjuk dan bimbingan kepada ucapan-ucapan yang baik dan santun dan diberi petunjuk pula, bim-bingan, kepada jalan Allah yang maha terpuji, berjumpa dan melihat Allah, karena selama di dunia berakhlak mulia dan berhati bersih."
  }
]