[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah telah memberikan hidayah bagi mereka di dunia untuk memilih ucapan baik, seperti kalimat tauhid, memuji Allah dan menyanjungNya, dan di akhirat untuk memujiNya atas tempat kesudahan mereka yang baik, sebagaimana Allah telah memberikan hidayah bagi mereka sebelumnya menuju jalan Islam yang terpuji lagi mengantarkan mereka menuju surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan mereka diberi petunjuk oleh Allah di kehidupan dunia ini kepada ucapan-ucapan yang baik seperti syahadat Lā ilāha illallāh, takbir (Allahu Akbar), dan tahmid (Alhamdulillah), dan Dia juga memberikan mereka petunjuk ke jalan Islam yang terpuji."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Adapun perkataan mereka di dalam surga, Allah telah mengilhamkan mereka tasbih, tahmid, tahlil, dan perkataan baik yang jauh dari kesia-siaan dan kedustaan. Allah menunjukkan mereka tempat yang hanya perkataan baik di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَهُدُوٓا۟ إِلَى الطَّيِّبِ مِنَ الْقَوْلِ (Dan mereka diberi petunjuk kepada ucapan-ucapan yang baik) Terdapat pendapat mengatakan ucapan ini adalah kalimat Laa ilaaha illaa Allah. Pendapat lain mengatakan yakni kalimat alhamdulillah. Dan pendapat lain mengatakan yang dimaksud adalah al-Qur’an. وَهُدُوٓا۟ إِلَىٰ صِرٰطِ الْحَمِيدِ (dan ditunjuki (pula) kepada jalan (Allah) yang terpuji) Atau ke jalan Allah yaitu agama-Nya yang lurus, agama Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Di dalam surga mereka diberi petunjuk oleh Allah kepada ucapan-ucapan yang baik yang terdapat pengagungan kepada Allah dan penetapan kebesaran-Nya. Juga untuk menjauhi kata yang sia-sia dan dosa, saling menyampaikan salam. Mereka juga ditunjuki kepada jalan yang terpuji dalam berinteraksi dan bermasyarakat, untuk tidak saling hasad, saling marah, saling dengki, saling bersitegang, atau saling bertengkar. Namun mereka ditunjukkan jalan interaksi layaknya kawan yang saling mencintai."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka diberi petunjuk} mereka dibimbing di dunia {kepada ucapan yang baik} ucapan-ucapan yang baik, seperti kalimat syahadat “Laa ilaaha Illallah”, takbir, tahmid, dan bacaan Al-Qur’an {dan diberi petunjuk ke jalan Dzat Yang Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Demikian ini, lantaran mereka “diberi petunjuk kepada ucapan-ucapan yang baik,” yang paling afdhal dan yang terbaik ialah kalimat ikhlas, disusul dengan perkataan-perkataan baik lain yang memuat dzikrullah atau pencurahan kebaikan bagi sesama manusia. “Dan mereka ditunjuki (pula) kepada jalan Allah yang terpuji,” yaitu jalan yang dipuji. Hal ini karena seluruh syariat mengandung hikmah, pujian, keindahan perkara yang diperintahkan, dan keburukan perkara [yang dilarang]. Itulah agama, yang tidak mengandung ifrath (ekstrimitas) dan tafrith (penyepelean) yang berisikan ilmu yang bermanfaat dan amalan shalih. Atau, bermakna mereka dituntun menuju jalan Allah Yang Maha Terpuji. Karena, seringkali Allah mengaitkan kata shirath kepadaNya. Pasalnya, shirath itu mengantarkan penitinya kepada Allah. Penyebutan kata al-Hamid (yang terpuji) di sini, untuk menjelaskan bahwa mereka bisa menggapai hidayah melalui jasa kebaikan dari Allah dan karuniaaNya yang tercurahkan kepada mereka. Karena itu, mereka mengucapkan di dalam surga, \"Segala puji bagi Allah yang telah menunjuki kami kepada (surga) ini. Dan kami sekali-kali tidak akan mendapat petunjuk kalau Allah tidak memberi kami petunjuk.\" (Al-A’raf:43)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 24: Di mana yang terbaiknya adalah kalimatul ikhlas (Laailaahaillallah), selanjutnya ucapan-ucapan baik lainnya yang di sana terdapat dzikrullah, atau ihsan terhadap hamba-hamba Allah.. Yang demikian adalah karena semua syari’at mengandung hikmah dan pujian, baiknya perintah dan buruknya larangan. Jalan yang terpuji ini adalah agama Allah yang di sana tidak ada sikap ifrath (berlebihan sampai melewati aturan) dan tafrith (meremehkan), yang di dalamnya mengandung ilmu yang bermanfaat dan amal saleh. Bisa juga diartikan jalan Allah yang terpuji, karena Allah sering menghubungkan jalan kepada-Nya, dan karena jalan itu menghubungkan penempuhnya kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 24",
    "description": "Dan mereka, para penghuni surga diberi petunjuk dan bimbingan kepada ucapan-ucapan yang baik dan santun dan diberi petunjuk pula, bim-bingan, kepada jalan Allah yang maha terpuji, berjumpa dan melihat Allah, karena selama di dunia berakhlak mulia dan berhati bersih. 25. Sungguh, orang-orang kafir mekah seperti abu sufyan bin 'arb dan kawan-kawannya yang menghalangi manusia dari jalan Allah untuk memeluk islam dan menghalangi rasulullah dan para sahabat melaksanakan ibadah umrah di masjidilharam yang telah kami jadikan terbuka untuk semua manusia yang beriman, baik yang bermukim di sana maupun yang datang dari luar daerah yang jauh; dan siapa saja yang berada di masjidilharam yang bermaksud melakukan kejahatan seperti membunuh, mengintimidasi, menghalangi manusia masuk islam, dan berbuat kerusuhan secara zalim di dalamnya, niscaya akan kami rasakan kepadanya siksa yang pedih di akhirat berupa api yang terus membakar, air mendidih, dan cambuk yang menghancurluluhkan tubuh."
  }
]