[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang kafir kepada Allah dan mendustakan risalah yang dibawa Muhammad bagi mereka, serta menghalangi orang lain untuk memeluk agama Allah, dan menghambat perjalanan Rasulullah dan kaum Mukiminin pada tahun perjanjian Hudaibiyah menuju Masjidil Haram yang Kami menjadikannya sebagai tempat bagi seluruh kaum Mukminin, baik yang bermukim di situ maupun orang pendatang, bagi mereka siksaan pedih lagi menyakitkan. Dan barangsiapa berniat di masjidil harom untuk berbuat penyimpangan dari kebenaran secara zhalim,kemudian dia bermaksiat kepada Allsh, niscaya Kami akan membuatnya merasakan siksaan pedih lagi menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Sesungguhnya orang-orang yang kafir kepada Allah, yang menghalangi manusia agar tidak masuk ke dalam Islam, dan menghalangi mereka dari mendatangi Masjidil Haram seperti yang dilakukan orang-orang musyrik pada tahun peristiwa Hudaibiyah; niscaya akan Kami rasakan kepada mereka azab yang pedih. Masjid itu yang Kami jadikan sebagai kiblat bagi manusia dalam salat mereka, dan sebagai tempat tawaf mereka dalam ibadah haji atau umrah, sama-sama terbuka untuk penduduk Mekkah, dan bagi siapa saja yang datang dari luar Mekkah, maka barangsiapa sengaja bermaksud menyimpang dari kebenaran dengan melakukan maksiat di dalamnya, niscaya Kami akan rasakan padanya azab yang pedih."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Orang-orang kafir yang menghalangi orang lain dari agama Allah dan menghalangi orang-orang beriman dari Masjidil Haram yang Kami jadikan sebagai tempat beribadah bagi seluruh manusia baik itu orang yang tinggal di sana atau yang dari tempat lain, dan orang yang bertekat melakukan keburukan atau dengan sengaja ingin menzalimi orang lain baik itu yang tinggal di Masjidil Haram atau tempat lain, maka Kami akan memberinya azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِنَّ الَّذِينَ كَفَرُوا۟ وَيَصُدُّونَ عَن سَبِيلِ اللهِ (Sesungguhnya orang-orang yang kafir dan menghalangi manusia dari jalan Allah) Yakni mereka menghalangi orang yang hendak memeluk agama Allah. وَالْمَسْجِدِ الْحَرَامِ(dan Masjidilharam) Dan mereka juga menghalangi orang yang hendak masuk Masjidil Haram. Terdapat pendapat mengatakan yang dimaksud adalah masjid itu sendiri. Dan pendapat lain mengatakan yang dimaksud adalah seluruh wilayah tanah haram, sebab orang-orang Musyrik menghalangi Rasulullah dan para sahabatnya yang akan masuk tanah haram pada hari perjanjian Hudaibiyah. Dan pendapat lain mengatakan yang dimaksud adalah kota Makkah. الَّذِى جَعَلْنٰهُ لِلنَّاسِ سَوَآءً الْعٰكِفُ فِيهِ وَالْبَادِ ۚ( yang telah Kami jadikan untuk semua manusia, baik yang bermukim di situ maupun di padang pasir) Yakni Kami jadikan Masjidil Haram bagi semua manusia secara umum agar dapat mendirikan shalat dan melakukan thawaf di sana; hak untuk beribadah di sana sama antara orang yang bermukim di sana atau orang yang datang dari tempat lain. Imam Malik berpendapat bahwa pemukiman yang ada di Makkah adalah hak bagi penduduk Makkah dan bagi orang yang datang dari tempat lain. Sekelompok ulama mengatakan jika ada orang yang datang ke Makkah dan bertamu kepada orang yang ia inginkan maka tuan rumah wajib untuk menjamunya, baik tuan rumah tersebut menjamunya dengan senang hati maupun dengan terpaksa. Namun jumhur ulama mengatakan bahwa perumahan yang ada di Makkah hukumnya tidak seperti Masjidil Haram, oleh sebeb itu pemiliknya dibolehkan menolak untuk menjamu tamu yang mendatanginya. Akan tetapi, di zaman ini terlihat jelas makna dari ayat ini bahwa penduduk tanah haram Makkah memiliki hak yang sama dengan orang dari selain Makkah, tidak dibedakan diantara mereka dalam hukum Allah, tidak ada keutamaan bagi seseorang diatas orang lain. وَمَن يُرِدْ فِيهِ بِإِلْحَادٍۭ بِظُلْمٍ نُّذِقْهُ مِنْ عَذَابٍ أَلِيمٍ(dan siapa yang bermaksud di dalamnya melakukan kejahatan secara zalim, niscaya akan Kami rasakan kepadanya sebahagian siksa yang pedih) Makna (الإلحاد) adalah berbelok dari kebenaran. Pendapat lain mengatakan maknanya adalah orang yang berbuat kejahatan di luar tanah haram kemudian melarikan diri ke dalam tanah haram. Dan menurut pendapat lain: kesyirikan dan pembunuhan. Pendapat lain juga mengatakan: perbuatan maksiat secara umum."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah mengatakan bahwa masjid al-Haram adalah: { ٱلَّذِى جَعَلْنَٰهُ لِلنَّاسِ } \"yang telah Kami jadikan untuk semua manusia\"; untuk memberi isyarat kepada sebab dihukumnya orang-orang musyrik atas penghalangan mereka untuk masuk ke masjid al-Haram; juga karena mereka melanggar kehendak Allah yang menjadikan masjid itu untuk seluruh manusia dan mereka sama dalam pemanfaatan tempat itu untuk beribadah, baik yang bermukim di sekitar masjid ataupun yang datang dari wilayah padang pasir. 2 ). Kejahatan yang biasa bisa saja menjadi besar dikarenakan dilakukan d tempat yang suci: seperti yang dijelaskan dalam firman Allah: { وَمَن يُرِدْ فِيهِ بِإِلْحَادٍۭ بِظُلْمٍ نُّذِقْهُ مِنْ عَذَابٍ أَلِيمٍ } \"dan siapa yang bermaksud di dalamnya melakukan kejahatan secara zalim, niscaya akan Kami rasakan kepadanya sebahagian siksa yang pedih\" atau dikarenakan kesucian waktu saat kejahatan itu terjadi: sebagaiaman firman Allah tentang bulan-bulan haram: { فَلَا تَظْلِمُوا۟ فِيهِنَّ أَنفُسَكُمْ } \"maka janganlah kamu menganiaya diri kamu dalam bulan yang empat itu\" [ at-Taubah: 36 ]. 3 ). Ayat ini menjadi pendukung dan penenang bagi siapa yang memberikan keamanan bagi jamaah haji, dan sebagai jaminan keselamatan dan ketenagan bagi para jamaah haji bahwasanya Allah akan menolong mereka dan senantiasa diberikan taufiq-Nya jika mereka benar-benar tulus dalam ibadahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-Nya serta menghalangi manusia dari jalan Allah dan ketaatan kepada-Nya, juga menghalangi untuk masuk Masjidil Haram yang telah Kami jadikan tempat haji dan umrah untuk semua manusia, baik yang bermukim di situ maupun di padang pasir. Siapa yang bermaksud melakukan kejahatan secara zalim, niscaya akan Kami jadikan mereka merasakan sebahagian siksa yang pedih. Ibnu Abbas berkata: bahwa ayat ini turun untuk Abu Sufyan bin Harb dan para temannya. Mereka menghalangi Nabi dan para sahabat pada tahun Hudaibiyah untuk masuk ke Masjdil Haram. Nabi telah marah dan hendak memerangi mereka, karena nabi saat itu sudah bersiap untuk umrah, sehingga Nabi menundanya tahun berikutnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jalan Islam yang terpuji yang mengantarkan ke surga {Sesungguhnya orang-orang yang ingkar dan menghalangi dari jalan Allah dan (dari) Masjidil haram yang telah Kami buat untuk semua manusia} Kami membuatnya untuk semua manusia sebagau kiblat untuk shalat mereka, ketentuan peribadatan, dan tempat untuk beribadah {itu sama} sama di dalamnya {baik yang bermukim di sana} yang bermukim di sana dan tidak bisa meninggalkannya {maupun yang datang dari luar} yang datang kesana bukan dari penduduk sana {dan siapa saja yang bermaksud} berkeinginan {melakukan kejahatan secara zalim di dalamnya} perbuatan yang mengerikan berupa kemaksiatan yang besar yang disengaja {Kami akan membuatnya merasakan sebagian siksa yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Allah memberitahukan mengenai kebusukan sikap kaum musyrikin dan kaum kafir terhadap Rabb mereka. Mereka telah menggabungkan antara kekufuran kepada Allah dan para rasulNya dengan usaha pembendungan (orang lain) dari jalan Allah, menghambat orang dari keimanan, dan menghalang-halangi dari Masjidil Haram yang bukan milik mereka ataupun milik nenek moyang mereka. Manusia di dalamnya benar-benar sederajat, baik orang yang menetap disana ataupun pendatang. Bahkan mereka telah menghalangi orang yang terbaik, Muhammad dan para sahabat beliau. Padahal, termasuk bagian dari kesucian, penghormatan dan kebesaran Masjidil Haram, bahwa “barangsiapa yang bermaksud di dalamnya melakukan kejahatan secara zhalim, niscaya akan Kami rasakan kepadanya sebagian siksa yang pedih,” maka hanya bentuk keinginan semata-mata saja untuk berbuat aniaya dan ilhad (maksiat) di wilayah Haram dapat mendatangkan siksaan, walaupun di tempat lainnya, seorang hamba tidak dikenai hukuman kecuali setelah mengerjakan kezhaliman (tidak sekedar niat saja). Lalu bagaimana dengan orang yang berbuat tindakan zhalim yang paling buruk, seperti kekufuran, syirik dan menghalangi orang dari jalan Allah, serta mencegah perjalanan orang yang akan mengunjunginya? Menurut mereka, apa tindakan yang akan Allah perbuat terhadap mereka? Dalam ayat yang mulia ini, terdapat kesimpulan wajibnya menghormati kota Haram dan tingginya tingkat pengagungan terhadapnya, serta peringatan dari niatan untuk berbuat maksiat di dalamnya dan merealisasikannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 25: Allah Subhaanahu wa Ta'aala menyebutkan keburukan keadaan orang-orang musyrik yang kafir kepada Tuhan mereka, di mana mereka menggabung antara kafir kepada Allah dan Rasul-Nya, menghalangi manusia dari jalan Allah dan melarang manusia beriman, dan menghalangi manusia dari Masjidilharam yang sesungguhnya bukan milik mereka dan bukan milik nenek moyang mereka, bahkan dalam hal ini manusia sama, baik yang mukim maupun yang datang dari luar. Jika kezaliman dan tindak kejahatan semata mengharuskan pelakunya mendapatkan azab yang pedih, lalu bagaimana jika yang dilakukan adalah kezaliman yang paling besar, berupa kufur dan kesyirkkan, menghalangi manusia dari Masjidilharam, dan menghalangi orang yang hendak ziarah kepadanya? Dalam ayat ini terdapat dalil wajibnya memuliakan tanah haram, menghormatinya, dan memberikan peringatan kepada orang yang hendak berbuat maksiat dan melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 25",
    "description": "Sungguh, orang-orang kafir mekah seperti abu sufyan bin 'arb dan kawan-kawannya yang menghalangi manusia dari jalan Allah untuk memeluk islam dan menghalangi rasulullah dan para sahabat melaksanakan ibadah umrah di masjidilharam yang telah kami jadikan terbuka untuk semua manusia yang beriman, baik yang bermukim di sana maupun yang datang dari luar daerah yang jauh; dan siapa saja yang berada di masjidilharam yang bermaksud melakukan kejahatan seperti membunuh, mengintimidasi, menghalangi manusia masuk islam, dan berbuat kerusuhan secara zalim di dalamnya, niscaya akan kami rasakan kepadanya siksa yang pedih di akhirat berupa api yang terus membakar, air mendidih, dan cambuk yang menghancurluluhkan tubuh. 26. Dan ingatlah, ketika kami tempatkan ibrahim yang lahir di kaldea dan menetap di palestina berada di tempat baitullah, lalu bersama put-ranya, ismail, meninggikan fondasi kakbah. Kami menyatakan kepada ibrahim, 'janganlah engkau mempersekutukan aku dengan suatu apa pun, karena menyekutukan Allah itu kezaliman yang dahsyat. Dan sucikanlah rumah-ku, kakbah, dari berhala, kemusyrikan, dan perilaku tidak terpuji, serta peruntukkanlah kakbah itu bagi orang-orang yang tawaf, orang-orang yang beribadah, dan orang yang rukuk dan sujud kepada Allah guna mendekatkan diri dan menyucikan jiwa."
  }
]