[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Nabi), ketika Kami menjelaskan kepada Ibrahim tempat Baitullah, dan Kami persiapkan Baitullah baginya, sedang waktu itu tempatnya tidak diketahui, dan Kami perintahkan dia untuk membangunnya di atas asas ketakwaan dan bertauhid kepada Allah, dan membersihkannya dari kekafiran, bid’ah dan najis-najis supaya menjadi tempat yang kondusif bagi orang-orang yang berthawaf dan orang-orang yang mendirikan shalat di sekitarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan ingatlah -wahai Rasul- tatkala Kami menjelaskan kepada Ibrahim -'alaihissalām- tentang tempat Baitullah (Ka'bah), dan batasan-batasannya setelah sebelumnya tidak diketahui, dan Kami mewahyukan kepadanya, \"Janganlah engkau menyekutukan Aku dengan sesuatu apa pun dalam ibadah, tetapi beribadahlah kepada-Ku semata, dan sucikanlah rumah-Ku dari najis yang nampak dan yang tidak nampak untuk orang-orang yang tawaf, dan salat di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-28. Hai Nabi, ingatlah ketika Kami siapkan bagi Ibrahim tempat di Baitul Haram, Kami tempatkan dia di sisi Baitul Haram agar dia dapat membangun Ka’bah atas dasar tauhid. Kami melarangnya berbuat syirik, dan memerintahkannya untuk membersihkan Baitul Haram dari berhala-berhala dan kotoran bagi orang-orang yang bertawaf mengelilingi Ka’bah, orang-orang yang beri’tikaf untuk beribadah, dan orang-orang yang mendirikan shalat di sana. Setelah Ibrahim menjalankan perintah itu, Allah kemudian memerintahkannya untuk menyeru manusia dan menyampaikan kepada mereka kewajiban menunaikan haji ke Baitul Haram, dan Allah mengabarkan bahwa mereka akan memenuhi seruannya, mereka akan datang dari segala penjuru, baik itu dari tempat yang dekat maupun yang jauh dengan berjalan kaki dan mengendarai unta yang telah disiapkan untuk perjalanan jauh dan kendaraan lainnya; hal ini agar mereka dapat mendapat manfaat bagi agama dan dunia mereka dan agar mereka dapat menyebut nama Allah ketika menyembelih hewan hadyu dan hewan kurban pada hari penyembelihan sebagai bentuk rasa syukur atas segala kenikmatan dari Allah dan apa yang telah Allah berikan kepada mereka berupa unta, sapi, domba, dan kambing. Dan Allah menghalalkan bagi mereka daging kurban dan memerintahkan mereka untuk memberi makan orang yang kesulitan karena kemiskinannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَإِذْ بَوَّأْنَا لِإِبْرٰهِيمَ (Dan (ingatlah), ketika Kami memberikan tempat kepada Ibrahim) Yakni Kami jelaskan kepadanya. مَكَانَ الْبَيْتِ(di tempat Baitullah) Agar mendirikan Baitullah di tempat itu untuk beribadah. Dan Kami turunkan firman Kami di sana: أَن لَّا تُشْرِكْ بِى شَيْـًٔا.....الآية أَن لَّا تُشْرِكْ بِى شَيْـًٔا(Janganlah kamu memperserikatkan sesuatupun dengan Aku) Seakan-akan Allah berfirman kepadanya “esakanlah Aku di rumah ini” وَطَهِّرْ بَيْتِىَ (dan sucikanlah rumah-Ku ini) Dari kesyirikan dan penyembahan berhala. Dalam ayat ini terdapat bantahan atas penduduk Baitullah yang menyekutukan Allah; sebab ayat ini merupakan perintah bagi bapak kalian Ibrahim dan bagi orang setelahnya, sedangkan kalian tidak menjalankan perintah tersebut dan menyekutukan Allah serta menjadikan Baitullah tempat berhala-berhala sehingga kalian telah menodainya. لِلطَّآئِفِينَ(bagi orang-orang yang thawaf) Thawaf di baitullah. وَالْقَآئِمِينَ(dan orang-orang yang beribadat) Yakni yang berdiri untuk shalat. وَالرُّكَّعِ السُّجُودِ(dan orang-orang yang ruku’ dan sujud) Yakni sambil ruku’ dan sujud."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَإِذْ بَوَّأْنَا لِإِبْرَٰهِيمَ مَكَانَ ٱلْبَيْتِ أَن لَّا تُشْرِكْ بِى شَيْـًٔا } \"Dan (ingatlah), ketika Kami memberikan tempat kepada Ibrahim di tempat Baitullah (dengan mengatakan): \"Janganlah kamu memperserikatkan sesuatupun dengan Aku\" larangan terhadap kesyirikan adalah perintah pertama kepada Ibrahim setelah Allah meberikan untuknya tempat di Baitullah; perintah ini disampaikan kepada bapaknya para Nabi sekaligus penyeru kepada Tauhid serta penghacur berhala-berhala yang sembah selain Allah, yaitu Ibrahim -عليه السلام-; hal ini menunjukkan betapa pentingnya perkata kesyrikan ini! 2 ). { وَطَهِّرْ بَيْتِىَ لِلطَّآئِفِينَ وَٱلْقَآئِمِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ } Pengabdian kepada masjid al-Haram dan membantu orang-orang yang berusaha menghidupkannya adalah diantara ketaatan yang agung, adapun makna mensucikan dalam ayat ini mencakup secara maknawi ataupun hissi, dan berbuat demikian adalah amalan yang sangat mulia, maka berhati-hati lah ketika seseorang melakukan suatu amalan yang bertolak belakang dengannya. 3 ). Hati mukmin senantiasa dirindukan keintaan kepada Kakbah; sampai-sampai mereka rela meninggalkan kampung halaman dan sanak saudara demi sampai dan beribadah di sekitarnya, perjalanan panjang yang meletihkan mereka nikmati padahal harta begitu banyak dikeluarkan, bahkan sekalipun dengan berjalan kaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Ingatlah wahai Rasul, ketika Kami memberikan tempat kepada Ibrahim tempat Baitullah untuk membangunnya, supaya menjadi pusat pengesaan Allah, dan Kami wasiatkan kepadanya untuk tidak menyekutukan Allah dengan apapun. Juga untuk membersihkan berhala di sekitar Ka’bah agar digunakan untuk thawaf, shalat, berdia, rukuk dan sujud. Ruku’ dan sujud adalah kinayah untuk shalat secara keseluruhan karena keduanya adalah rukun yang paling utama."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Kami menempatkan} menempatkan {Ibrahim di tempat Baitullah,“Janganlah kamu menyekutukan Aku dengan apa pun, sucikanlah rumahKu bagi orang-orang yang tawaf, yang bermukim, serta yang rukuk lagi sujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah memaparkan keagungan Baitul Haram dan kebesarannya serta keagungan orang yang membangunnya, yaitu Khalil ar-Rahman. Allah berfirman, “Dan (ingatlah) ketika Kami memberikan tempat kepada Ibrahim di tempat baitullah,” maksudnya Kami telah mempersiapkan tempat itu bagi dirinya, lalu menempatkannya disana dan menetapkan sebagian keturunan beliau untuk menjadi penduduknya. Allah menitahkan kepada beliau untuk membangunnya. Lalu, beliau mendirikannya di atas pondasi takwa kepada Allah dan membangun pondasinya di atas ketaatan kepada Allah. Beliau melangsungkan pembangunannya bersama putra beliau, Ismail. Allah memerintahkan beliau supaya tidak menyekutukanNYa dengan apa pun, dalam bentuk mengikhlaskan seluruh amaliyah beliau bagi Allah, dan membangunnya atas nama Allah. “Dan sucikanlah rumahKu,” yaitu dari kesyirikan dan maksiat, dari najis-najis dan kotoran-kotoran. Allah menisbatkannya kepada diriNya, karena kemuliaan dan keutamaannya, serta agar rasa cinta kepadaNya semakin besar di kalbu. Hati (para manusia) pun tergerak (mengunjungi) ke sana dari setiap penjuru. Dan supaya lebih besar penyucian dan pengagungan terhadapnya. Karena bangunan itu merupakan rumah Allah bagi orang-orang yang thawaf darn beri’tikaf di sana, yang sedang larut dalam aneka macam ibadah, seperti dzikir, membaca al-Quran, mempelajari ilmu dan mengajarkannya, dan ragam amaliyah lain yang dapat mendekatkan diri kepada Allah. “Dan orang-orang yang rukuk dan sujud,” yaitu orang-orang yang mengerjakan shalat. Maksudnya, sucikanlah (Baitullah) bagi mereka yang mulia itu, yang punya obsesi hanya menaati Rabb mereka, menjadi hambaNya dan berusaha mendekatkan diri kepadaNya di dalam rumahNya. Mereka itulah orang yang paling berhak (dengan Masjidil Haram) dan menerima sambutan kemuliaan. Di antara bentuk suguhan kemuliaan bagi mereka adalah dengan cara menyucikan Baitullah untuk mereka. Termasuk juga dalam konsep penyuciannya, adalah menyucikannya dari suara-suara goyunan dan suara yang tinggi yang akan menganggu orang-orang yang sedang beribadah dengan mengerjakan shalat maupun thawaf. Allah mendahulukan penyebutan thawaf dibandingkan I’tikaf dan shalat, lantaran merupakan ibadah yang berhubungan secara khusus dengan baitullah. Selanjutnya, disebutkan I’tiikaf, karena merupakan jenis ibadah yang khusus (dikerjakan di tempat yang disebut) masjid-masjid."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 26: Di ayat ini, Allah Subhaanahu wa Ta'aala menyebutkan kemuliaan Baitullah al Haram dan kemuliaan pembangunnya, yaitu kekasih Ar Rahman, Nabi Ibrahim ‘alaihis salam. Baik dari syirk maupun maksiat, dari najis maupun kotoran. Allah hubungkan rumah tersebut kepada Diri-Nya karena keutamaannya, kelebihannya dan agar kecintaan manusia kepadanya sangat dalam di hati. Seperti dzikr, membaca Al Qur'an, mendalami agama dan mengajarkannya, dan berbagai bentuk ibadah lainnya. Yakni yang mengerjakan shalat. Maksudnya adalah sucikanlah rumah itu untuk orang-orang yang utama tersebut, di mana perhatian mereka adalah taat dan mengabdi Tuhan mereka, mendekatkan diri kepada-Nya di sisi rumah-Nya. Mereka ini berhak dimuliakan, dan termasuk memuliakan mereka adalah membersihkan Baitullah untuk mereka, demikian pula membersihkannya dari suara keras yang mengganggu ibadah mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 26",
    "description": "Dan ingatlah, ketika kami tempatkan ibrahim yang lahir di kaldea dan menetap di palestina berada di tempat baitullah, lalu bersama put-ranya, ismail, meninggikan fondasi kakbah. Kami menyatakan kepada ibrahim, 'janganlah engkau mempersekutukan aku dengan suatu apa pun, karena menyekutukan Allah itu kezaliman yang dahsyat. Dan sucikanlah rumah-ku, kakbah, dari berhala, kemusyrikan, dan perilaku tidak terpuji, serta peruntukkanlah kakbah itu bagi orang-orang yang tawaf, orang-orang yang beribadah, dan orang yang rukuk dan sujud kepada Allah guna mendekatkan diri dan menyucikan jiwa. 27. Dan serulah manusia, wahai ibrahim, untuk mengerjakan haji me-ngunjungi baitullah guna melaksanakan rangkaian manasik haji sete-lah engkau meninggikan fondasi kakbah dan membebaskannya dari kemusyrikan, niscaya mereka akan datang kepada seruan-Mu sesuai kemampuannya, dengan berjalan kaki bagi yang berjarak dekat, atau me-ngendarai setiap kuda atau unta yang kurus, karena jauhnya perjalanan menuju kakbah hingga kehabisan bekal. Mereka datang untuk menunaikan ibadah haji dari segenap penjuru dunia, baik yang dekat maupun yang jauh."
  }
]