[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-28. Dan umumkanlah (wahai Ibrahim) kepada sekalian manusia tentang kewajiban haji atas mereka, niscaya mereka akan datang kepadamu dalam keadaan berbeda-beda; berjalan kaki dan menunggangi unta yang kurus (yaitu unta yang kurus karena perjalanan dan beban pekerjaan bukan karena berdaging sedikit) yang tiba dari segenap jalan yang jauh, supaya mereka menghadiri hal-hal yang bermanfaat bagi mereka, berupa: pengampunan bagi dosa-dosa mereka, pahala mengerjakan manasik haji dan ketaatan mereka, serta perolehan keuntungan dalam perniagaan mereka dan kepentingan-kepentingan lain, dan agar mereka menyebut Nama Allah ketika menyembelih hewan kurban yang mereka jadikan pendekatan diri kepada Allah, seperti unta, sapi dan kambing pada hari-hari tertentu, yaitu tanggal 10 dzulhijjah dan tiga hari setelahnya, sebagai ungkapan rasa syukur kepada Allah atas nikmat-nikmatNya, sedang mereka diperintah sebagai anjuran saja untuk memakan dari sembelihan-sembelihan tersebut dan memberikan makan orang fakir yang amat sulit ekonominya dari sembelihan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan serulah manusia dengan menyuruh mereka untuk mengerjakan ibadah haji ke Baitullah yang Kami perintahkan padamu untuk membangunnya; niscaya mereka akan mendatangimu dengan berjalan kaki, atau mengendarai onta yang kurus lantaran kelelahan dalam perjalanan, mereka akan datang dengan mengendarai onta dari segenap penjuru yang jauh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَأَذِّن فِى النَّاسِ بِالْحَجِّ (Dan berserulah kepada manusia untuk mengerjakan haji) Sekolompok ahli tafsir mengatakan, ketika Ibrahim telah selesai membangun Baitullah, malaikat Jibril mendatanginya, kemudian ia memerintahkan Ibrahim untuk menyeru manusia untuk melaksanakan ibadah haji. Maka Ibrahim menaiki maqam dan berseru: “Wahai manusia sekalian, diwajibkan atas kalian ibadah haji di Baitullah, maka penuhilah panggilan Tuhan kalian, ‘Laabbaik Allahumma Labbaik’.” يَأْتُوكَ رِجَالًا(niscaya mereka akan datang kepadamu dengan berjalan kaki) Yakni dengan berjalan kaki. وَعَلَىٰ كُلِّ ضَامِرٍ(dan mengendarai unta yang kurus) Makna (الضامر) adalah unta yang kurus karena sering dipakai bepergian. يَأْتِينَ (yang datang) Yakni unta itu datang membawa penunggangnya untuk menunaikan haji. مِن كُلِّ فَجٍّ عَمِيقٍ (dari segenap penjuru yang jauh) Yakni dari jalan yang jauh."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah mencatumkan suara azan Ibrahim tatkala memanggil manusia untuk datag berhaji, sampai azan pun tetap terjaga sampai saat sekarang ini, dan ia juga terus diulang-ulang di setiap waktu shalat, senantiasa dikumandangkan di mihrab-mihrab { وَأَذِّن فِى ٱلنَّاسِ بِٱلْحَجِّ يَأْتُوكَ رِجَالً }. Ayat ini juga menjadi dalil bahwa seorang hamba ketika menginginkan sesuatu hendaknya mengerjakan sebab datangnya keinginannya itu, lalu kemudian menyerahkan apa yang terjadi di belakangnya kepada sang maha tinggi. 2 ). Beberapa orang-orang shalih menyaksikan dari sebagian jamaah haji yang kembali ke negara asal mereka, tatkala dalam perhentian menangis dan berkata: betapa lelahnya aku! lalu kemudian menarik nafas dan berkata lagi: seperti inilah kerugian yang dirasakan oleh siapa yang terputus perjelanannya menuju baitullah, lalu bagaimana dengan dia yang benar-benar terputus hubungannya dengan Rabb pemilik baitullah? 3 ). { يَأْتُوكَ رِجَالًا وَعَلَىٰ كُلِّ ضَامِرٍ } \"datang kepadamu dengan berjalan kaki, dan mengendarai unta yang kurus\" pada potongan ayat ini disebutkan diutamakannya penyebutan pejalan kaki sebelum penyebutan pengendara menunjukkan satu faidah yang berharga: yaitu, Allah memberi syarat bagi mereka yang akan melakukan ibadah haji yakni adanya kemampuan pada diri. 4 ). { وَعَلَىٰ كُلِّ ضَامِرٍ } Ketika manusia menyambut hangat tamu-tamu mereka yang datang dengan kendaraan-kendaraan mewah, dan Allah memuji dan menyambut tamu-tamunya sekalipun kendaraan mereka dengan seeokor unta. 5 ). { مِن كُلِّ فَجٍّ عَمِيقٍ } \"dari segenap penjuru yang jauh\" Sungguh ini adalah pemandangan yang begitu menakjubkan; anda tidak akan mendapatkan pemandangan sperti ini yang mengumpulkan jutaan manusia dari berbagai kewarganegaraan yang berbeda, seperti pemandangan haji ini, hal ini menunjukkan kegungan agama ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Serulah manusia untuk mengerjakan haji, dengan berseru: “Wahai manusia, kalian telah ditetapkan untuk melaksanakan haji, Tuhan kalian telah mewajibkannya. Labbaikallahumma labbaik.” Niscaya mereka akan datang kepadamu dengan berjalan kaki, dan mengendarai unta yang kurus yang datang dari segenap penjuru yang jauh. Mujahid mengatakan Awalnya mereka tidak mengendarai apapun, sehingga Allah menurunkan ayat “Niscaya mereka akan datang kepadamu dengan mengendarai unta yang kurus.” Sehingga diperintahkan untuk berlapang dalam keadaan, dan memberi keringanan kepada mereka untuk berkendara dan berdagang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Serulah} serulah {manusia untuk berhaji, maka mereka akan datang kepadamu dengan berjalan kaki} dalam keadaan berjalan dengan kaki mereka {dan mengendarai unta kurus} dalam keadaan mengendarai setiap unta kurus yang membuatnya lelah setelah melakukan perjalanan {yang datang dari setiap penjuru yang jauh} jalan yang jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Dan berserulah kepada manusia untuk mengerjakan haji.” Beritahukanlah hal ini kepada mereka, dan serulah mereka kepadanya. Sampaikan kepada orang yang dekat dan jauh darinya tentang kewajiban (berhaji) dan keutamaannya. Sungguh, jika engkau telah memanggil mereka, niscaya mereka akan mendatangimu sebagai orang-orang yang berhaji atau mengerjakan umrah, “dengan berjalan kaki,” maksudnya berjalan di atas kaki-kaki mereka karena terdorong oleh rasa kerinduan (kepadanya), “dan mengendarai unta yang kurus,” maksudnya unta kurus yang melintasi perjalanan yang susah dan padang pasir yang ganas. Ia meneruskan langkahnya sampai ke tempat yang paling mulia “dari segenap penjuru yang jauh,” dari setiap negeri yang jauh. Khalil ar-Rahman (Ibrahim) telah melaksanakannya. Sesudah itu disusul oleh keturunannya Muhammad. Maka, mereka berdua menyeru umat manusia untuk berhaji ke Baitullah. Keduanya mensosialisasikan dan mengulang-ulanginya. Dan sungguh telah terwujud janji Allah itu. Orang-orang datang dengan berjalan kaki dan menumpangi kendaraan dari belahan bumi TImur dan Barat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 27: Yakni beritahukanlah mereka, seru mereka, sampaikan kepada orang yang dekat maupun jauh kewajiban haji dan keutamaannya. Karena rasa rindu yang begitu mendalam. Unta yang kurus menggambarkan jauh dan sukarnya yang ditempuh oleh jamaah haji, namun demikian mereka tetap menempuh perjalanan itu. Maka Nabi Ibrahim ‘alaihis salam melakukan hal itu, demikian pula anak keturunannya, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam. Ternyata apa yang dijanjikan Allah itu terlaksana, manusia mendatangi Baitullah dengan berjalan kaki atau berkendaraan dari bagian timur bumi maupun baratnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 27",
    "description": "Dan serulah manusia, wahai ibrahim, untuk mengerjakan haji me-ngunjungi baitullah guna melaksanakan rangkaian manasik haji sete-lah engkau meninggikan fondasi kakbah dan membebaskannya dari kemusyrikan, niscaya mereka akan datang kepada seruan-Mu sesuai kemampuannya, dengan berjalan kaki bagi yang berjarak dekat, atau me-ngendarai setiap kuda atau unta yang kurus, karena jauhnya perjalanan menuju kakbah hingga kehabisan bekal. Mereka datang untuk menunaikan ibadah haji dari segenap penjuru dunia, baik yang dekat maupun yang jauh. 28. Dengan memenuhi seruan nabi ibrahim, mengunjungi baitullah guna menunaikan ibadah haji, kaum muslim mendapat keuntungan dunia akhirat, yakni agar mereka menyaksikan berbagai manfaat untuk mereka, terutama menguatkan perasaan bersaudara di antara umat muslim, dan agar mereka menyebut nama Allah pada beberapa hari yang telah ditentukan dalam rangkaian manasik haji seperti berkurban dengan mengumandangkan takbir pada hari raya haji atau hari tasyriq, yaitu tanggal 10, 11, 12, dan 13 zulhijah atas rezeki yang dia berikan kepada mereka berupa hewan ternak. Maka makanlah sebagian darinya, sebagai tanda bersyukur dan sebagian lagi berikanlah untuk dimakan orang-orang yang sengsara dan fakir sebagai tanda peduli dan berbagi dengan kaum duafa hingga perasaan gembira itu dirasakan bersama."
  }
]