[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-28. Dan umumkanlah (wahai Ibrahim) kepada sekalian manusia tentang kewajiban haji atas mereka, niscaya mereka akan datang kepadamu dalam keadaan berbeda-beda; berjalan kaki dan menunggangi unta yang kurus (yaitu unta yang kurus karena perjalanan dan beban pekerjaan bukan karena berdaging sedikit) yang tiba dari segenap jalan yang jauh, supaya mereka menghadiri hal-hal yang bermanfaat bagi mereka, berupa: pengampunan bagi dosa-dosa mereka, pahala mengerjakan manasik haji dan ketaatan mereka, serta perolehan keuntungan dalam perniagaan mereka dan kepentingan-kepentingan lain, dan agar mereka menyebut Nama Allah ketika menyembelih hewan kurban yang mereka jadikan pendekatan diri kepada Allah, seperti unta, sapi dan kambing pada hari-hari tertentu, yaitu tanggal 10 dzulhijjah dan tiga hari setelahnya, sebagai ungkapan rasa syukur kepada Allah atas nikmat-nikmatNya, sedang mereka diperintah sebagai anjuran saja untuk memakan dari sembelihan-sembelihan tersebut dan memberikan makan orang fakir yang amat sulit ekonominya dari sembelihan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Agar mereka bisa menyaksikan apa yang bermanfaat bagi mereka berupa pengampunan dosa, meraih pahala, penyatuan kalimat, ataupun manfaat lainnya. Hendaklah mereka menyebut nama Allah ketika menyembelih hadyu pada hari-hari tertentu yaitu; 10 Zulhijah dan 3 hari setelahnya, sebagai ungkapan rasa syukur kepada Allah atas karunia dan rezeki-Nya berupa onta, sapi dan kambing. Maka makanlah dari sebagian binatang hadyu ini, dan sebagian lainnya berikanlah untuk dimakan orang-orang yang sangat miskin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. لِّيَشْهَدُوا۟ مَنٰفِعَ لَهُمْ (supaya mereka menyaksikan berbagai manfaat bagi mereka) Terdapat pendapat mengatakan maksudnya adalah agar mereka ikut menyaksikan manasik-manasik haji. Pendapat lain mengatakan, yakni menyaksikan perdagangan dan penyembelihan kurban. وَيَذْكُرُوا۟ اسْمَ اللهِ فِىٓ أَيَّامٍ مَّعْلُومٰتٍ(dan supaya mereka menyebut nama Allah pada hari yang telah ditentukan) Yakni menyebut nama Allah ketika menyembelih hewan hadyu dan hewan kurban. Makna (أيام معلومات) adalah hari-hari penyembelihan kurban. عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ الْأَنْعٰمِ ۖ( atas rezeki yang Allah telah berikan kepada mereka berupa binatang ternak) Yaitu unta, sapi, dan kambing. فَكُلُوا۟ مِنْهَا(Maka makanlah sebahagian daripadanya) Disunnahkan untuk ikut memakan daging dari hewan hadyu dan kurban. Dan pendapat lain mengatakan hal ini diwajibkan. وَأَطْعِمُوا۟ الْبَآئِسَ الْفَقِيرَ(dan (sebahagian lagi) berikanlah untuk dimakan orang-orang yang sengsara dan fakir) Makna (البؤس) adalah kefakiran yang sangat. Maka hendaknya sebagian daging hadyu diberikan untuk orang-orang fakir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Menuntut ilmu dan ibadah haji { لِّيَشْهَدُوا۟ مَنَٰفِعَ لَهُمْ } Abbas ad-Daury berkata : mungkin dahulu kami bersama Ahmad bin Hambal pada hari-hari musim haji, kemudian datang suatu kaum dari jamaah haji lalu disambut oleh Ahmad dan berbincang bersama mereka, lalu kami bertanya: kami heran kenapa ada majlis hadits pada musim haji, maka Ahmad pun menjawab: mereka adalah kaum asing, setelah beberapa hari mereka akan keluar dan kembali ke negara mereka. 2 ). { لِّيَشْهَدُوا۟ مَنَٰفِعَ لَهُمْ } Diantara manfaat berharga dari haji yang terkandung dalam ayat ni adalah: hendaknya seseorang yang menunaikan ibadah haji mencari hal yang bermanfaat baginya untuk akhiratnya, adapun manfaat duniawi, manusia bisa saling berkuasa diantara mereka dalam hal itu, sedangkan manfaat akhirat manusia pada hari ini lebih membutuhkannya, dan masa haji yang cukup singkat, sebaiknya dimanfaatkan untuk mengajarkan manusia tentang agama mereka. 3 ). Tatkala Allah menyebutkan manfaat haji dalam ayat-Nya: { لِّيَشْهَدُوا۟ مَنَٰفِعَ لَهُمْ } Allah menyebutnya dengan konteks umum dan tidak mengikatnya dengan manfaat tertentu; maka ayat ini mencakup manfaat agama dan manfaat duniawi, dan jika manusia menyadari akan hal itu. mereka akan mengisi musim haji itu dengan hal yang lebih bermanfaat bagi agama dan duniawi mereka; maka tatkala mereka kembali ke negara masing-masing akan lebih banyak manfaat yang diraih. 4 ). Seorang pedakwah yang berasal dari Amerika tatkala kembali dari menunaikan ibadah haji mendapatkan pelajaran berharga dari peristiwa mulia yang ia saksikan, seorang dai yang begitu keras menjaga fanatisme golongan berkulit hitam, seketika merupah pola pikirnya setelah menyaksikan langsung bagaimana manusia dari berbagai golongan dan suku yang berbeda, warna kulit yang juga berbeda berkumpul dalam masjid yang sama untuk satu tujuan yang sama, tidak memandang apakah dia dari etnis afrika atau Amerika, kaya ataupun miskin, dari suku Arab atau dari orang asing. 5 ). { وَيَذْكُرُوا۟ ٱسْمَ ٱللَّهِ فِىٓ أَيَّامٍ مَّعْلُومَٰتٍ } \"dan supaya mereka menyebut nama Allah pada hari yang telah ditentukan\" ketika semua kaum muslimin mengetahui bahwa jihad di jalan Allah adalah amalan yang paling afdhol. dan tidak banyak dari ummat ini yang mampu mengerjakannya, Allah kemudian menurunkan wahyu-Nya yang menjelaskan bahwa ada amalan yang dapat menyamai pahalan dari jihad, yaitu amalan pada sepuluh hari di bulan dzul hijjah bahkan bisa melebihi dari segi keutamaannya, kecuali orang yang membawa diri dan hartanya untuk berjihad di jalan Allah, dan ia tidak kembali dengan semua yang ia bawa itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Supaya mereka menyaksikan berbagai manfaat agama maupun dunia lewat berdagang dan sebagainya bagi mereka. Juga supaya mereka menyebut nama Allah pada saat menyembelih hewan qurban pada hari yang telah ditentukan yaitu hari Nahr, hari Id dan hari tasyrik. Mereka menyebut asma Allah ketika menyembelih rezeki yang Allah telah berikan kepada mereka berupa unta, sapu dan kambing. Maka makanlah sebahagiannya dan sebagian lagi berikanlah untuk dimakan orang-orang yang tertimpa kelaparan dan fakir, serta perintahkan untuk memberi makanan yang telah diwajibkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Supaya mereka menyaksikan} supaya mereka merasakan {berbagai manfaat untuk mereka} kemaslahatan agama dan dunia bagi mereka {dan menyebut nama Allah pada beberapa hari yang telah ditentukan} hari-hari tertentu, yaitu sepuluh Dzulhijjah, dan tiga hari setelahnya {atas rezeki yang telah Dia anugerahkan kepada mereka berupa binatang ternak} unta, sapi dan kambing {Makanlah sebagian darinya dan berilah makan orang yang sengsara lagi fakir} yang sangat fakir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Kemudian Allah memerinci manfaat-manfaat yang muncul dari berkunjung ke Baitullah al-Haram untuk memotivasi pergi ke sana. Allah berfirman, “supaya mereka menyaksikan berbagai manfaat bagi mereka,” maksudnya agar mereka memperoleh berbagai kemanfaatan agama di Baitullah, berupa (kesempatan) melakukan ibadah-ibadah yang utama dan ibadah-ibadah yang tidak terlaksana kecuali di tempat itu. (Dan memperoleh) manfaat duniawi, seperti berniaga, meraup keuntungan-keuntungan materi. Ini semua merupakan perkara riil. Setiap orang mengetahuinya. “Dan supaya mereka menyebut Nama Allah pada hari yang telah ditentukan atas rizki yang Allah telah berikan kepada mereka berupa binatang ternak.” Ini termasuk paduan manfaat agama dan duniawi. Maksudnya, agar mereka mengingat Nama Allah saat menyembelih binatang-binatang kurban, sebagai ungkapan syukur kepada Allah atas rizki yang Dia limpahkan kepada mereka dan Dia mudahkan bagi mereka dari binatang-binatang tersebut. Jika kalian menyembelihnya, “maka makanlah sebagian darinya dan (sebagian lagi) berikanlah untuk dimakan orang-orang yang sengsara lagi fakir,” yaitu orang yang sangat membutuhkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 28: Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan beberapa faedah mengunjungi Baitullah al Haram sambil memberikan dorongan terhadapnya. Baik manfaat agama maupun dunia. Manfaat agama adalah dapat melakukan ibadah yang utama dan ibadah yang tidak dapat dilakukan kecuali di sana, sedangkan manfaat dunia adalah bisa berusaha dan memperoleh keuntungan duniawi. Semua ini sudah kita ketahui bersama. Hari yang ditentukan itu adalah hari raya haji dan hari tasyriq, yaitu tanggal 10, 11, 12 dan 13 Dzulhijjah, di mana mereka menyebut nama Allah ketika menyembelih kurban dan banyak mengumandangkan takbir pada hari-hari itu sebagai dzikr mutlak. Yang dimaksud dengan binatang ternak di sini ialah binatang-binatang yang termasuk jenis unta, sapi, kambing dan biri-biri. Oleh kamu wahai orang-orang yang berkurban, meskipun boleh juga menyedekahkan semuanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 28",
    "description": "Dengan memenuhi seruan nabi ibrahim, mengunjungi baitullah guna menunaikan ibadah haji, kaum muslim mendapat keuntungan dunia akhirat, yakni agar mereka menyaksikan berbagai manfaat untuk mereka, terutama menguatkan perasaan bersaudara di antara umat muslim, dan agar mereka menyebut nama Allah pada beberapa hari yang telah ditentukan dalam rangkaian manasik haji seperti berkurban dengan mengumandangkan takbir pada hari raya haji atau hari tasyriq, yaitu tanggal 10, 11, 12, dan 13 zulhijah atas rezeki yang dia berikan kepada mereka berupa hewan ternak. Maka makanlah sebagian darinya, sebagai tanda bersyukur dan sebagian lagi berikanlah untuk dimakan orang-orang yang sengsara dan fakir sebagai tanda peduli dan berbagi dengan kaum duafa hingga perasaan gembira itu dirasakan bersama. 29. Setelah wukuf dilakukan, bermalam di muzdalifah dan melontar jumrah usai dilaksanakan, maka kemudian, para tamu Allah hendaklah menghilangkan kotoran yang ada di badan mereka dengan tahalul awal, memotong rambut, kemudian hendaklah mereka menyempurnakan nazar-nazar mereka, jika mereka bernazar, dan melakukan tawaf ifadah sekeliling rumah tua, baitullah, yang dibangun sejak zaman adam, kemudian melakukan tahalul kedua yang membolehkan melakukan semua larangan berihram."
  }
]