[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian hendaknya orang-orang yang berhaji menyelesaikan manasik-manasik haji yang belum dilaksanakan, supaya dapat kembali ke dalam kondisi halal dan keluar dari keadaan ihram. Demikian itu, dengan cara menghilangkan kotoran yang bertumpuk pada tubuh-tubuh mereka dan memotong kuku-kuku mereka serta menggunduli kepala mereka, dan supaya mereka memenuhi keinginan yang mereka wajibkan atas diri mereka sendiri berupa haji, umrah dan menyembelih hadyu-hadyu, serta supaya mereka melakukan thawaf di sekeliling bangunan rumah tua lagi sudah lama yang Allah pelihara dari cengkraman para tiran, yaitu Ka’bah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Kemudian hendaklah mereka menyelesaikan amalan manasik haji yang tersisa, dan bertahalul dengan mencukur rambut, memotong kuku, menghilangkan kotoran-kotoran badan mereka selama ihram. Juga hendaklah mereka menyempurnakan apa yang mereka wajibkan atas diri mereka berupa ibadah haji, umrah atau hadyu, dan melakukan tawaf ifaḍah di Baitullah yang diselamatkan oleh Allah dari cengkeraman para penguasa yang zalim.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Setelah penyembelihan, Allah memerintahkan mereka untuk membersihkan badan mereka setelah menjalankan ihram, dengan mencukur atau memendekkan rambut mereka, mencukur kumis, dan memotong kuku mereka untuk menyempurnakan nazar yang telah mereka wajibkan atas diri mereka sendiri sebagai bukti ketaatan kepada Allah. Dan hendaklah mereka bertawaf idhafah mengelilingi Ka’bah sebanyak tujuh putaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. ثُمَّ لْيَقْضُوا۟ تَفَثَهُمْ (Kemudian, hendaklah mereka menghilangkan kotoran yang ada pada badan mereka) Yakni hendaklah mereka membersihkan kotoran yang ada pada diri mereka seperti rambut dan kuku yang panjang. Dan ini dilakukan pada hari raya kurban. وَلْيُوفُوا۟ نُذُورَهُمْ(dan hendaklah mereka menyempurnakan nazar-nazar mereka) Yakni perbuatan baik yang mereka nazarkan pada ibadah haji mereka. وَلْيَطَّوَّفُوا۟ بِالْبَيْتِ الْعَتِيقِ (dan hendaklah mereka melakukan melakukan thawaf sekeliling rumah yang tua itu (Baitullah)) Yakni thawaf ifadhah. Baitullah disebut dengan (العتيق) karena Allah membebaskannya dari kekuasaan orang-orang yang sewenang-wenang. Pendapat lain mengatakan makna (العتيق) adalah mulia. Dan bisa jadi juga yang dimaksud adalah masjid yang tua, sebab ia adalah masjid yang pertama didirikan di bumi yang dipakai untuk menyembah Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pernah kah kamu mengamati saat kamu beranjak untuk mensucikan diri, dan mencukur rambut, kemudian memakai wangi-wangian? untuk mengadapkan hati kepada sang pencipta, dan kamu tidak sadar saat pulang seakan-akan kamu baru saja dilahirkan oleh ibumu terbebas dari dosa?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Kemudian, hendaklah mereka menghilangkan kotoran yang ada pada badan mereka karena panjangnya rambut dan kuku. Hendaklah mereka menyempurnakan nazar-nazar mereka dan hendaklah mereka melakukan melakukan thawaf sekeliling Baitullah yang telah dibangun lama untuk beribadah, Allah telah membebaskannya dari belenggu pada Baitullah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian hendaklah mereka menghilangkan kotoran mereka} agar mereka menyempurnakan sesuatu yang tersisa pada diri mereka berupa ketentuan peribadatan haji mereka, seperti mencukur rambut kepala, melempar jumrah, mengambil minum, memotong kuku, mencabut bulu ketiak, dan mencukur bulu kemaluan {menyempurnakan nazar-nazar mereka} menyempurnakan apa yang mereka wajibkan atas diri mereka dalam berhaji {dan melakukan thawaf} dan agar melakukan thawaf ifadah {di sekeliling rumah yang tua itu (Baitullah)} yang terbebas dari kekuasaan para penguasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Kemudian, hendaklah mereka menghilangkan kotoran yang ada pada badan mereka,” maksudnya hendaknya mereka menyelesaikan manasik-manasik mereka dan membersihkan kotoran dan gangguan yang menempel pada tubuh mereka saat berihram. “Dan hendaklah mereka menyempurnakan nadzar-nadzar mereka,” yang mereka wajibkan atas diri mereka, berupa haji, umrah, dan penyembelihan kurban. “Dan hendaklah mereka melakukan thawaf sekeliling rumah yang tua itu (Baitullah),” yaitu yang kuno. Ia adalah masjid yang paling utama secara mutlak, yang terbebaskan dari cengkeraman para dictator. Ayat ini merupakan perintah untuk mengerjakan thawaf, terutama pasca dikeluarkannya perintah melaksanakan manasik-manasik haji secara umum. (Hal ini) lantaran melihat keutamaan dan kemuliaan ibadah thawaf. Sebab, itulah sasaran yang dituju. Sementara ibadah-ibadah sebelumnya berstatus sebagai wasilah (perantara) yang mengantarkan kepadanya. Mungkin saja, wallahu a’lam, juga diarahkan untuk tujuan yang lain. Yaitu bahwasanya thawaf disyariatkan di setiap waktu, sama saja baik menjadi bagian dari manasik haji atau saat menjadi ibadah tersendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 29: Yang dimaksud dengan menghilangkan kotoran di sini ialah memotong rambut, memotong kuku, dan sebagainya. Yang mereka wajibkan diri mereka untuk mengerjakannya, seperti haji, umrah dan hewan ternak yang mereka hadiahkan ke tanah haram. Ia merupakan masjid yang paling utama secara mutlak. Lafaz ‘atiiq dapat juga diartikan mu’taq (yang merdeka), yakni yang tidak dijajah oleh orang-orang kejam. Di ayat ini diperintahkan melakukan thawaf setelah diperintahkan menjalankan manasik secara umum karena keutamaan tawaf, dan karena itu adalah tujuannya, sedangkan sebelumnya hanyalah sarana kepadanya. Menurut Syaikh As Sa’diy pula, mungkin saja –Walahu a’lam- disebutkan thawaf karena faedah yang lain, yaitu bahwa tawaf disyariatkan di setiap waktu, baik mengikuti manasik atau tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 29",
    "description": "Setelah wukuf dilakukan, bermalam di muzdalifah dan melontar jumrah usai dilaksanakan, maka kemudian, para tamu Allah hendaklah menghilangkan kotoran yang ada di badan mereka dengan tahalul awal, memotong rambut, kemudian hendaklah mereka menyempurnakan nazar-nazar mereka, jika mereka bernazar, dan melakukan tawaf ifadah sekeliling rumah tua, baitullah, yang dibangun sejak zaman adam, kemudian melakukan tahalul kedua yang membolehkan melakukan semua larangan berihram. 30. Demikianlah perintah Allah kepada kaum muslim untuk melak-sanakan ibadah haji. Dan barang siapa mengagungkan apa yang terhormat di sisi Allah dengan melaksanakan rangkaian manasik haji dan men-jauhi semua larangan ketika berihram, baik ihram untuk haji maupun umrah, maka sikap yang demikian itu lebih baik baginya, tamu Allah, di sisi tuhannya. Dan dihalalkan bagi kamu semua hewan ternak, baik ketika menunaikan ibadah haji maupun tidak sedang berhaji, kecuali yang diterangkan kepadamu keharamannya di dalam Al-Qur'an dan sunah. Maka, jauhilah olehmu, wahai orang-orang beriman, penyembahan berhala-berhala yang najis itu karena tidak sesuai dengan kesucian dan kemurnian tauhid yang diajarkan para nabi dan rasul; dan jauhilah perkataan dusta, baik ketika berihram untuk haji atau umrah, lebih-lebih ketika sudah menyandang predikat haji."
  }
]