[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara tokoh kekafiran dari sebagian manusia mendebat dan mencoba melontarkan keragu-raguan tentang Kuasa Allah untuk membangkitkan makhluk setelah kematiannya, lantaran kebodohan mereka terhadap hakikat kekuasaanNya dan dikarenakan mengikuti para pemimpin kesesatan dari kalangan setan yang banyak pembangkangannya terhadap Allah dan rasul-rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3.\"Dan dikalangan manusia ada orang yang berbantahan tentang kekuasaan Allah dalam membangkitkan kembali orang-orang yang telah mati tanpa disertai ilmu dan bukti yang memiliki dasar sedikit pun, dan dalam keyakinan dan ucapannya hanya mengikuti para pembangkang terhadap Tuhannya dari kalangan setan, ataupun para pemimpin kesesatan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dan sebagian orang-orang sesat membantah kekuasaan Allah dan sifat-sifat-Nya tanpa ada landasan ilmu, namun mereka hanya berlandasan berbagai kebatilan, dan mereka mengikuti setiap setan yang durhaka dari golongan jin dan manusia. Syeikh as-Syinqithi berkata: Yang dimaksud dengan apa yang Allah sebutkan dalam ayat ini bahwa sebagian orang-orang jahil semisal orang-orang kafir yang membantah Allah tanpa ilmu adalah, mereka membantah tentang Allah tanpa ada landasan ilmu. Makna ini Allah sebutkan dalam beberapa ayat, seperti: وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِى ٱللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَٰبٍ مُّنِير ثَانِىَ عِطْفِهِۦ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ ۖ لَهُۥ فِى ٱلدُّنْيَا خِزْىٌ ۖ وَنُذِيقُهُۥ يَوْمَ ٱلْقِيَٰمَةِ عَذَابَ ٱلْحَرِيقِ Dan di antara manusia ada orang-orang yang membantah tentang Allah tanpa ilmu pengetahuan, tanpa petunjuk dan tanpa kitab (wahyu) yang bercahaya. Dengan memalingkan lambungnya untuk menyesatkan manusia dari jalan Allah. Ia mendapat kehinaan di dunia dan dihari kiamat Kami merasakan kepadanya azab neraka yang membakar. (al-Hajj: 8-9)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَمِنَ النَّاسِ مَن يُجٰدِلُ فِى اللهِ بِغَيْرِ عِلْمٍ (Di antara manusia ada orang yang membantah tentang Allah tanpa dasar pengetahuan) Yakni yang mempertentangkan kekuasaan Allah, ia menganggap Allah tidak mampu untuk membangkitkan manusia. Ia mengatakan itu tanpa ilmu dan hujjah sebagai landasan, namun hanya sekedar khayalan dan sangkaan untuk membantah berita-berita Allah yang disampaikan kepada manusia melalui lisan para Nabi. وَيَتَّبِعُ(dan mengikuti) Yakni mengikuti dan membela perkataan itu. كُلَّ شَيْطٰنٍ مَّرِيدٍ(setiap syaitan yang jahat) Yakni yang durhaka kepada Allah. Yang dimaksud adalah Iblis dan bala tentaranya serta para pemimpin orang-orang kafir yang mengajak para pengikutnya kepada kekafiran dengan ucapan manis. Terdapat pendapat mengatakan ayat ini diturunkan untuk Walid bin Mughirah dan ‘Utbah bin Rabi’ah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "3-4 Ditanyakan kepada sebagian ulama apakah ada dalam al-Qur'an syahid yang menguatkan perumpamaan: \"مَنْ أَعَانَ ظَالِماً سَلَّطَ عَلَيْهِ\" \"barangsiapa yang menolong orang jahat akan dikuasai olehnya\" ? maka dijawab ya, firman Allah: { كُتِبَ عَلَيْهِ أَنَّهُ مَنْ تَوَلَّاهُ فَأَنَّهُ يُضِلُّهُ وَيَهْدِيهِ إِلَىٰ عَذَابِ السَّعِيرِ } \"Yang telah ditetapkan terhadap syaitan itu, bahwa barangsiapa yang berkawan dengan dia, tentu dia akan menyesatkannya, dan membawanya ke azab neraka\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Di antara manusia ada orang yang membantah tentang wujud dan sifat kemahaesaan dan kekuasaan Allah untuk membangkitkan manusia dan lainnya tanpa ilmu dan bukti. Mereka mengikuti bantahan mereka dengan batil dan bisikan jahat syaitan dengan durhaka dan kesombongan terhadap Allah. Ayat ini turun untuk Nadhr bin Harits"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara manusia ada yang berdebat} berbantah-bantahan {tentang Allah tanpa ilmu dan mengikuti setiap (langkah) setan yang sangat membangkang} yang angkuh lagi membangkang kepada Allah dari golongan manusia dan jin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Maksudnya, di antara manusia ada satu golongan dan kelompok. Mereka itu menempuh jalan kesesatan dan mulai menyanggah al-haq dengan kebatilan. Mereka bertujuan untuk menetapkan kebatilan dan memberangus al-haq. Padahal, mereka berada pada puncak kebodohan, tidak mempunyai ilmu sedikit pun. Paling-paling, modal yang mereka miliki hanyalah taklid kepada tokoh-tokoh kesesatan, dari kalangan setan yang jahat, membangkang kepada Allah dan kepada para utusanNya, lagi memusuhi mereka. Sungguh ia telah menentang Allah dan RasulNYa. Dan akhirnya, menjelma seorang tokoh yang mempropagandakan jalan menuju neraka. “Yang telah ditetapkan terhadap setan itu,” telah ditakdirkan pada setan yang jahat ini “bahwa barangsiapa yang berkawan dengannya,” maksudnya barangsiapa mengikutinya “tentu dia akan menyesatkannya,” dari jalan kebenaran dan menjauhkan dirinya dari shiratal mustaqim (jalan yang lurus) “dan membawanya ke dalam azab neraka.” Ini adalah tangan kanan iblis secara nyata. Allah telah berfirman tentang orang semacam ini, \"karena sesungguhnya setan-setan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala \" (Fathir:6). Orang ini, yang berusaha membantah tentang Allah, ia telah memadukan antara kesesatan pribadi dengan upayanya untuk menyesatkan orang-orang. (Dalam melakukannya) ia adalah orang yang hanya mengikuti dan meniru-niru setan yang jahat. Sebuah cerminan berbagai kegelapan yang saling menutupi. Termasuk dalam konteks ini, semua orang-orang kafir dan ahli bid’ah. Sesungguhnya mayoritas mereka hanya mengikuti semata, membantah tanpa dasar ilmu (yang shahih)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 3: Yakni di antara manusia ada yang menempuh jalan yang sesat, tidak hanya itu, bahkan sampai mendebat yang hak dengan kebatilan untuk membenarkan yang batil dan menyalahkan yang hak, padahal sesungguhnya mereka berada dalam kebodohan yang sangat, pegangan mereka tidak lain taqlid (ikut-ikutan) kepada pemimpin mereka yang sesat, yaitu setiap setan yang jahat dan durhaka, yang menentang Allah dan Rasul-Nya. Maksud membantah tentang Allah ialah membantah sifat-sifat dan kekuasaan Allah, misalnya dengan mengatakan bahwa malaikat-malaikat itu adalah puteri- puteri Allah, Al Quran itu adalah dongengan orang- orang dahulu dan bahwa Allah tidak Kuasa menghidupkan orang-orang yang sudah mati yang telah menjadi tanah. Dalam debatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 3",
    "description": "Meskipun Allah telah menjelaskan azab yang sangat keras pada hari kiamat bagi orang kafir dan mengajak manusia untuk bertakwa kepada-Nya, tetapi di antara manusia, yang kafir dan keras kepala, ada yang saling membantah tentang Allah, mengingkari agama Allah, tidak meyakini kehidupan sesudah mati, dan tidak meyakini adanya surga dan neraka, tanpa ilmu yang benar; dan mereka mengingkari Allah itu hanya mengikuti bisikan para setan yang sangat jahat membujuk dan menipu manusia. 4. Allah mengingatkan manusia tentang setan, telah ditetapkan di lauh mahfuz, bahwa siapa yang berkawan dengan dia, dengan meng-ikuti bisikannya, maka dia akan menyesatkannya, dari jalan Allah yang lurus, dan membawanya dengan tidak sadar ke dalam azab neraka yang apinya senantiasa menyala."
  }
]