[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perkara yang Allah perintahkan tersebut, berupa menyelesaikan manasik-manasik haji, memenuhi nadzar dan thawaf di sekeliling Ka’bah, itulah yang diwajibkan Allah atas kalian, maka agungkanlah perkara itu. Dan barangsiapa mengagungkan perkara-perkara terhormat yang ditetapkan Allah, dan diantaranya adalah manasik-manasikNya dengan cara menjalankannya dengan sempurna lagi ikhlas karena Allah, maka itu lebih baik baginya di dunia dan akhirat. Dan Dia telah menghalalkan bagi kalian memakan binatang-binatang ternak, kecuali yang Dia haramkan dalam ayat yang dibacakan kepada kalian di al-Qur’an, seperti bangkai dan lainnya, maka jauhilah. Dan dalam hal ini terkandung pembatalan apa yang diharamkan oleh bangsa arab terhadap beberapa jenis binatang ternak. Dan jauhilah hal-hal najis, yaitu berhala-berhala, dan jauhilah kedustaan terhadap Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Apa yang diperintahkan kepada kalian -berupa tahalul dengan mencukur rambut, memotong kuku, menghilangkan kotoran-kotoran badan, menunaikan nazar, dan tawaf di Baitullah- merupakan perkara yang Allah wajibkan atas kalian. Maka agungkanlah perkara yang diwajibkan-Nya tersebut. Barangsiapa yang menjauhi apa yang diperintahkan-Nya untuk dijauhi ketika berihram karena mengagungkan batasan-batasan Allah agar tidak terjatuh ke dalamnya, dan mengagungkan apa yang terhormat di sisi-Nya agar tidak melakukan maksiat padanya, maka hal itu di sisi Tuhannya lebih baik baginya di dunia dan di Akhirat. Dan dihalalkan bagi kalian -wahai manusia- hewan ternak berupa unta, sapi dan kambing. Dia tidak mengharamkan pada kalian jenis unta ḥām (unta jantan yang telah membuntingkan betina sebanyak 10 kali), baḥīrah (unta betina yang telah beranak lima kali, dan anak kelima itu jantan), atau jenis domba waṣīlah (domba jantan yang memiliki kembaran domba betina). Dia tidak mengharamkan apapun dari hewan tersebut kecuali apa yang kalian dapatkan dalam Al-Qur`ān berupa keharaman bangkai, darah dan lainnya. Maka jauhilah oleh kalian perkara-perkara najis dan menjijikkan itu yaitu berhala, dan jauhilah pula setiap ucapan batil dan kedustaan terhadap Allah atau makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Perintah yang agung ini menjelaskan syiar-syiar Allah. Dan barangsiapa yang mengagungkan hukum-hukum yang Allah syariatkan maka itu lebih baik pahalanya baginya di akhirat. Dan Kami halalkan bagi kalian memakan daging unta, sapi, domba, kambing, dan hewan-hewan ternak lainnya, kecuali apa yang telah diharamkan dalam al-Qur’an seperti bangkai, hewan yang mati tercekik dan yang disembelih untuk selain Allah. Dan jauhilah sejauh-jauhnya penyembahan terhadap berhala-berhala, karena ia buruk dan najis secara maknawi. Dan jauhilah perkataan batil, seperti berdusta dan memberi kesaksian palsu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. ذٰلِكَ وَمَن يُعَظِّمْ حُرُمٰتِ لَّهُۥ (Demikianlah (perintah Allah). Dan barangsiapa mengagungkan apa-apa yang terhormat di sisi Allah) Makna (الحرمات) adalah apa yang wajib dikerjakan dan haram untuk disepelekan, baik itu dalam haji dan lainnya. Dan cara menghormatinya adalah dengan tidak melanggarnya. اللهِ فَهُوَ خَيْرٌ (maka itu adalah lebih baik baginya) Yakni penghormatan itu lebih baik baginya. عِندَ رَبِّهِۦ (di sisi Tuhannya) Yakni di akhirat, lebih baik baginya daripada menyepelekan hal itu. وَأُحِلَّتْ لَكُمُ الْأَنْعٰمُ (Dan telah dihalalkan bagi kamu semua binatang ternak) Yakni unta, sapi, dan kambing. إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ ۖ (terkecuali yang diterangkan kepadamu keharamannya) Yaitu bangkai dan apa yang telah disebutkan lainnya pada awal surat al-Maidah. فَاجْتَنِبُوا۟ الرِّجْسَ مِنَ الْأَوْثٰنِ(maka jauhilah olehmu berhala-berhala yang najis itu) Dan najisnya syirik tidak akan hilang dari orang yang melakukannya kecuali dengan keimanan, sebagaimana tidak akan hilang najis dhahir kecuali dengan air. وَاجْتَنِبُوا۟ قَوْلَ الزُّورِ (dan jauhilah perkataan-perkataan dusta) Yakni ucapan batil dan yang mengandung kesyirikan terhadap Allah dengan lafadz apapun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Setelah Allah menyebutkan tentang manasik dalam surah ini: { ذَٰلِكَ وَمَن يُعَظِّمْ حُرُمَٰتِ ٱللَّهِ فَهُوَ خَيْرٌ لَّهُۥ عِندَ رَبِّهِۦ } \"Demikianlah (perintah Allah). Dan barangsiapa mengagungkan apa-apa yang terhormat di sisi Alla\" kta kemudian mengetahui bahwa ibadah haji bukan sekedar ucapan-ucapan dan amalan-amalan yang sementara, melainkan lebih dari itu semua adalah bagaimana seorang hamba mengagungkan apa-apa yang terhormat di sisi Allah, senantiasa bertaqwa kepada-Nya, dengan menjauhi kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Demikianlah keterangan ibadah haji dan pengagungan Allah. Yaitu wajib haji dan batasan haji. Dan barangsiapa mengagungkan apa-apa yang terhormat di sisi Allah berupa syariat, kewajiban dan hukum agama-Nya, maka pengagungan itu lebih baik baginya di sisi Tuhannya. Telah dihalalkan bagi kamu semua binatang terna: unta, sapi dan kambing, terkecuali yang diterangkan kepadamu keharamannya seperti bangkai dan lainnya. Maka jauhilah berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta, syirik kepada Allah dan perkataan yang keji"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah (perintah Allah). Siapa saja yang mengagungkan hal-hal yang terhormat di sisi Allah} menjauhi sesuatu yang diperintah Allah untuk menjauhinya dalam keadaan ihram, untuk mengagungkan batas-batas Allah agar tidak terjerumus ke dalamnya dan tidak menghalalkan sesuatu yang diharamkan untuknya {itu lebih baik baginya di sisi Tuhannya. Dihalalkan bagi kalian hewan ternak kecuali yang diterangkan kepada kalian. Maka, jauhilah berhala-berhala yang najis itu} sesuatu yang najis yaitu berhala-berhala itu {dan jauhilah perkataan dusta} yang palsu dan bohong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Demikianlah (perintah Allah),” maksudnya Kami menyampaikan kepada kalian tentang hukum-hukum tersebut dan kandungannya, berupa penghormatan terhadap hurumatullah (hal-hal yang diagungkan oleh Allah), pengagungan dan pemuliaan terhadapnya, karena penghormatan hal-hal yang diagungkan oleh Allah termasuk bagian dari perkara-perkara yang dicintai oleh Allah yang bisa menyebabkan kedekatan denganNya. Orang-orang yang mengagungkan dan memuliakannya, niscaya Allah membalasinya dengan pahala yang berlimpah. Itu akan menjadi kebaikan bagi dirinya dalam agama, duniawi maupun ukhrrawi di sisi Rabbnya. Dan yang dimaksud hurumatullah yakni segala sesuatu yang mempunyai kehormatan dan Allah memerintahkan agar dihormati, yang berupa ibadah atau perkara lainnya. Misalnya, manasik haji secara keseluruhan, tanah haram, pelaksanaan ihram, (penyembelihan) hewaan-hewan kurban dan seperti ibadah-ibadah yang Allah menitahkan para hamba untuk melaksanakannya. Mengagungkan hal-hal tersebut seagai bentuk penghormatan kepadanya dengan hati dan mencintainya serta menyempurnakan ubudiyah (pengabdian diri kepada Allah) tanpa meremehkan, malas-malasan, ataupun merasa keberatan (dalam menjalankannya). Kemudian Allah menyebutkan karunia dan curahan kebaikanNya melalui penghalalan hewan-hewan yang Allah tetapkan bagi para hambaaNya, berupa hewan-hewan ternak, seperti unta, sapi, dan kambing. Dan Allah menetapkan aturan syariat padanya (melalui penyembelihan) sebagai bagian dari manasik haji yang difungsikan untuk mendekatkan diri kepadaNYa. Maka karunia Allah yang terkandung pada hewan-hewan ternak menjadi semakin besar ditinjau dari dua sisi. “Terkecuali yang diterangkan kepadamu keharamannya,” ketetapan pengharamannya di dalam al-Quran, seperti FirmanNya, \"Diharamkan bagimu (memakan) bangkai, darah, daging babi, (daging hewan) yang disembelih atas nama selain Allah, yang tercekik, yang dipukul, yang jatuh, yang ditanduk, dan yang diterkam binatang buas, kecuali yang sempat kamu menyembelihnya, dan (diharamkan bagimu) yang disembelih untuk berhala. Dan (diharamkan juga) mengundi nasib dengan anak panah, (mengundi nasib dengan anak panah itu) adalah kefasikan. Pada hari ini orang-orang kafir telah putus asa untuk (mengalahkan) agamamu, sebab itu janganlah kamu takut kepada mereka dan takutlah kepada-Ku. Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridai Islam itu jadi agama bagimu. Maka barang siapa terpaksa karena kelaparan tanpa sengaja berbuat dosa, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\" (Al-Maidah:3) Akan tetapi, yang termasuk rahmat Allah bagi para hambaNya adalah bahwa Allah mengharamkan sesuatu atas mereka dan memcegah mereka dari itu guna menyucikan dan membersihkan diri mereka dari syirik kepadaNya dan perkataan palsu. Oleh karena itu, Allah berfirman, “Maka kalian jauhilah yang najis,” menjijikan lagi kotor “dari berhala-berhala,” yaitu tandingan-tandingan yang sudah kalian daulat sebagai sesembahan bersama Allah. Karena sesungguhnya itu merupakan jenis kotoran yang paling parah. Secara zahir bahwa, kata ‘min’ pada ayat ini bukan berfungsi menjelaskan suatu jenis (min al-jism), sebagaimana disampaikan oleh mayoritas ulama tafsir, namun berfungsi untuk tab’idh (menjelaskan sebagian contoh konkrernya, sebagian), dan bahwa kata ar-Rijs sifanya umum mencakup seluruh larangan dan perkara yang diharamkan. Sehingga menjadi perkara yang terlarang secara umum. Sedangkan larangan dari (penyembahan) berhala-berhala menjadi bagiannya secara khusus. “Dan jauhilah perkataan-perkataan dusta,” yaitu seluruh perkataan yang diharamkan, karena sesungguhnya semua itu masuk kategori perkataan palsu, [yang merupakan kedustaan. Persaskian palsu menjadi salah satu bagiannya. Setelah Allah melarang mereka dari praktik kesyirikan, tindakan keji dan perkataan dusta]."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 30: Yakni hukum-hukum yang telah disebutkan sebelumnya serta pengagungan terhadap apa yang terhormat (hurumat) di sisi Allah adalah karena memuliakan hurumat termasuk perkara yang dicintai Allah, dapat mendekatkan diri kepada Allah, di mana orang yang memuliakan dan mengagungkannya akan Allah berikan pahala yang besar, bahkan sebagai kebaikan baginya untuk agamanya, dunianya dan akhiratnya. Maksudnya adalah semua yang terhormat di sisi Allah dan diperintahkan untuk dimuliakan. Seperti bulan Haram (bulan Zulkaidah, Zulhijjah, Muharram dan Rajab), tanah Haram (Mekah), ihram, ibadah-ibadah yang diperintahkan Allah untuk dikerjakan. Memuliakan hurumat tersebut adalah dengan membesarkannya di hati, mencintainya, menyempurnakan ibadah di sana, tidak meremehkan dan tidak malas, serta tidak merasa berat. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan nikmat dan ihsan-Nya berupa penghalalan-Nya untuk hamba-hamba-Nya binatang ternak, yang terdiri dari unta, sapi dan kambing. Seperti yang disebutkan dalam surah Al Maa’idah : 3, akan tetapi karena rahmat-Nya kepada hamba-hamba-Nya, Dia mengharamkan hal tersebut untuk menyucikan jiwa mereka, membersihkan mereka dari syirk dan ucapan dusta. Yang kamu jadikan sebagai tuhan-tuhan di samping Allah Subhaanahu wa Ta'aala. Termasuk pula persaksian dusta dan semua ucapan yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 30",
    "description": "Demikianlah perintah Allah kepada kaum muslim untuk melak-sanakan ibadah haji. Dan barang siapa mengagungkan apa yang terhormat di sisi Allah dengan melaksanakan rangkaian manasik haji dan men-jauhi semua larangan ketika berihram, baik ihram untuk haji maupun umrah, maka sikap yang demikian itu lebih baik baginya, tamu Allah, di sisi tuhannya. Dan dihalalkan bagi kamu semua hewan ternak, baik ketika menunaikan ibadah haji maupun tidak sedang berhaji, kecuali yang diterangkan kepadamu keharamannya di dalam Al-Qur'an dan sunah. Maka, jauhilah olehmu, wahai orang-orang beriman, penyembahan berhala-berhala yang najis itu karena tidak sesuai dengan kesucian dan kemurnian tauhid yang diajarkan para nabi dan rasul; dan jauhilah perkataan dusta, baik ketika berihram untuk haji atau umrah, lebih-lebih ketika sudah menyandang predikat haji. 31. Menunaikan ibadah haji ke baitullah hendaklah dengan landasan tauhid yang lurus, niat beribadah dengan ikhlas kepada Allah, semata-mata mengharapkan keridaan-Nya, tanpa mempersekutukan-Nya de-ngan sesuatu apa pun. Barang siapa mempersekutukan Allah, kapan dan di mana pun, selama menunaikan ibadah haji maupun sebelumnya, maka seakan-akan dia jatuh dari langit, karena terputus dari tali Allah hingga ibadahnya tidak diterima, lalu disambar oleh burung hingga dirinya makin jauh dari Allah, atau diterbangkan angin ke tempat yang jauh seperti layang-layang putus."
  }
]