[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demikian itulah yang diperintahkan Allah, yaitu mentauhidkanNya dan mengikhlaskan ibadah bagiNya. Dan barangsiapa melaksanakan perintah Allah dan mengagungkan setiap simbol-simbol agama termasuk di dalamnya rangkaian manasik haji dan tempat-tempatnya, serta hewan-hewan kurban yang disembelih padanya, yaitu dengan cara memperlakukannya dengan baik dan menggemukannya, bentuk pengagungan ini, termasuk perbuatan orang-orang yang memiliki hati yang menyandang sifat takwa kepada Allah dan takut kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Itulah yang Allah perintahkan berupa tauhid, memurnikan ibadah kepada-Nya, serta menjauhi berhala-berhala dan ucapan dusta. Dan barangsiapa yang mengagungkan syiar-syiar agama ini -diantaranya; penyembelihan hadyu dan manasik haji- maka pengagungan tersebut merupakan bentuk ketakwaan hati terhadap Tuhannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Perintah yang agung ini merupakan syariat yang Allah perintahkan. Dan barangsiapa yang mengagungkan perkara agama yang diantaranya adalah ibadah haji, maka itu merupakan sikap orang-orang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. ذٰلِكَ وَمَن يُعَظِّمْ شَعٰٓئِرَ اللهِ (Demikianlah (perintah Allah). Dan barangsiapa mengagungkan syi’ar-syi’ar Allah) Yakni syi’ar-syi’ar Allah yang masuk di dalamnya penyembelihan hadyu, manasik haji, dan syi’ar-syi’ar dalam haji lainnya, dan termasuk syi’ar-syi’ar Allah adalah masjid, mushaf al-Qur’an, zikir, dan ibadah-ibadah lainnya. Pengagunggan syi’ar-syi’ar ini merupakan bentuk pengagungan kepada Allah. فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ (maka sesungguhnya itu timbul dari ketakwaan hati) Yakni Pengagunggan syi’ar-syi’ar ini muncul dari ketakwaan hati kepada Allah. Barangsiapa menghinanya dengan perbuatan atau ucapan maka itu merupakan kesesatan dan kebutaan hati terhadap pengagungan yang diwajibkan Allah. Dan salah satu cara mengagungkan syi’ar Allah pada hewan hadyu dan kurban adalah dengan memilih hewan yang bagus dan gemuk sebagai bentuk pendekatan kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikan bagaimana salaf sangat memuliakan malam lailatul qadr: Diriwayatkan bahwa suatu ketika Tamim ad-Dary setelah membaca firman Allah: { ذَٰلِكَ وَمَن يُعَظِّمْ شَعَٰٓئِرَ ٱللَّهِ فَإِنَّهَا مِن تَقْوَى ٱلْقُلُوبِ } kemudian beliau keluar untuk membeli selembar pakaian mahal seharga seribu dirham, dan memakainya pada malam yang diharapkan pada malam itu turunnya lailatul qadr. 2 ). Bulan-bulan haram dimulai dengan masuknya bulan dzul Qo'dah, dan diantara hal yang menjadi keistimewaan seorang hamba dalam memuliakan bulan-bulan ini adalah ketika diketahui bagamana ia semakin memperbanyak amalan shalih dan meningalkan perkara-perkara yang diharamkan. 3 ). Perhatikan makna ayat ini dengan seksama kemudian bandingkan dengan sebagian manusia yang datang ke masjid untuk melaksanakan shalat dengan pakaian tidurnya! { ذَٰلِكَ وَمَن يُعَظِّمْ شَعَٰٓئِرَ ٱللَّهِ فَإِنَّهَا مِن تَقْوَى ٱلْقُلُوبِ } \"Demikianlah (perintah Allah). Dan barangsiapa mengagungkan syi'ar-syi'ar Allah, maka sesungguhnya itu timbul dari ketakwaan hati\" Kata taqwa dinisbatkan kepad hati; karena hakikat taqwa itu ada pada hati seseorang; oleh karena itu dalam hadits shahih Rasulullah mengatakan \"taqwa itu di sini, sebanyak tiga kali, sambil mengisyaratkan ke dadanya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Demikianlah perintah Allah. Barangsiapa mengagungkan syi´ar-syi´ar agama dan hukum Allah yaitu petunjuk, cara berhaji, masjid-masjid dan ibadah, maka sesungguhnya itu adalah rasa takut kepada Allah yang timbul dari ketakwaan hati, yang dilakukan orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah (perintah Allah). Siapa saja yang mengagungkan syiar-syiar Allah} petunjuk-petunjuk agama Allah, di antaranya adalah hadyu, syariat tentang haji {sesungguhnya hal itu} sesungguhnya mengagungkannya {termasuk ketakwaan hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Maksudnya, itu adalah hal-hal yang telah Kami kemukakan kepada kalian yang berupa pengagungan hal-hal yang patut dihormati dan sya’airNya. Yang dimaksud dengan sya’air, yakni symbol-simbol agama yang terlihat oleh mata. •Termasuk di dalamnya, pelaksanaan manasik haji seluruhnya, sebagaimana allah berfirman \"Sesungguhnya Safa dan Marwah adalah sebahagian dari syi`ar Allah.\" (Al-Baqarah:158) •Termasuk juga binatang-binatang kurban dan segala yang dipersembahkan kepada Baitullah. Telah berlalu, bahwa makna pengagungan terhadapnya, yaitu memuliakannya dan melaksanakannya serta menyempurnakan pelaksanaannya sebisa mungkin. •Selain itu, hewan-hewan kurban (hadyu). Cara pengagungannya adalah dengan cara bertindak baik terhadapnya dan berusaha menggemukannya serta hendaknya berujud sempurna ditinjau dari segala sisi. Pengagungan sya’arillah ini tumbuh dari ketakwaan hati. Orang yang mengagungkannya, yaitu orang yang telah membuktikan ketakwaan dan kebenaran imannya. Pasalnya, sikap mengagungkannya muncul dari pengaruh pengagungan kepada Allah dan pemuliaan kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 32: Sudah diterangkan sebelumnya, bahwa maksud mengagungkan syi’ar-syi’ar Allah adalah memuliakannya, melaksanakannya, menyempurnakannya sesuai kemampuan hamba, termasuk juga dalam hal hewan hadyu (yang dihadiahkan ke tanah haram), mengangungkannya adalah dengan mencari hewan yang baik dan gemuk lagi sempurna dari berbagai sisi. Syi'ar Allah adalah tanda-tanda agama Allah yang nampak, termasuk di antaranya segala amalan yang dilakukan dalam rangka ibadat haji, tempat-tempat mengerjakannya, hewan yang dihadiahkan ke Baitullah, dsb. Dengan demikian, mengagungkan syi’ar-syi’ar Allah merupakan bukti ketakwaan di hati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 32",
    "description": "Demikianlah perintah Allah agar seorang muslim menunaikan ibadah haji dengan landasan tauhid yang lurus. Dan barang siapa mengagungkan syiar-syiar Allah dengan menyempurnakan manasik haji yang dilakukan pada tempat-tempat mengerjakannya dengan hati yang bersih, semata-mata mengharap keridaan-Nya, maka sesungguhnya hal itu, hanya akan terlaksana bila menunaikan ibadah haji timbul dari ketakwaan hati. 33. Bagi kamu yang sedang menunaikan ibadah haji padanya, yakni pada hewan hadyu yang disembelih sebagai pengganti (dam) pekerjaan wajib haji yang ditinggalkan; atau sebagai denda karena melanggar hal-hal yang terlarang mengerjakannya di dalam ibadah haji, ada beberapa manfaat yang bisa diambil seperti untuk dikendarai, diambil susunya, dan sebagainya, hingga waktu yang ditentukan, yakni hingga hari nahar, tanggal 10 zulhijah, kemudian tempat penyembelihannya adalah di sekitar baitul atiq, baitullah, di kawasan tanah haram."
  }
]