[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hewan-hewan hadyu ini, kalian dapat mengambil manfaat-manfaat yang kalian nikmati berupa bulu, air susu dan sebagai tunggangan, dan bentuk pemanfaatan lainnya yang tidak berpengaruh buruk padanya hingga hari penyembelihan di sisi Baitullah, yaitu seluruh zona tanah haram."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dalam binatang hadyu yang kalian sembelih terdapat manfaat bagi kalian -seperti bisa menungganginya, mendapatkan kulit atau susunya, atau ia melahirkan anak keturunan- sampai tiba waktu penyembelihannya yang ditentukan di sekitar Baitullah yang Dia bebaskan dari kuasa para penguasa zalim."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Dalam hewan kurban dan hadyu ini terdapat banyak manfaat bagi kalian, di antaranya dapat kalian kembangbiakkan, kalian ambil air susunya, atau kalian tunggangi, hingga sampai masa penyembelihannya di Makkah al-Mukarramah atau di Mina."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. لَكُمْ فِيهَا مَنٰفِعُ (Bagi kamu pada binatang-binatang hadyu itu ada beberapa manfaat) Dan bagian dari manfaatnya adalah sebagai tunggangan, sumber susu, ternak, bulu, dan lainnya. إِلَىٰٓ أَجَلٍ مُّسَمًّى(sampai kepada waktu yang ditentukan) Yaitu sampai waktu penyembelihannya. ثُمَّ مَحِلُّهَآ إِلَى الْبَيْتِ الْعَتِيقِ (kemudian tempat wajib (serta akhir masa) menyembelihnya ialah setelah sampai ke Baitul Atiq (Baitullah)) Yakni hewan itu digiring sampai di sebelah baitullah, kemudian disembelih di sana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Pada syariat-syariat Allah itu ada beberapa manfaat bagi kamu. Yaitu binatang-binatang ternak yang menjadi tanda keagungan-Nya. Yang dapat diambil berbagai manfaat darinya baik untuk kendaraan, peranakan, diambil bulunya dan lainnya hinggga sampai kepada waktu yang ditentukan yaitu hari Nahr. Kemudian tempat wajib (serta akhir masa) menyembelihnya ialah setelah sampai ke Baitul Atiq /Baitullah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi kalian di dalamnya} di dalam hewan hadyu terdapat manfaat seperti susunya, anaknya, wolnya, bulu-bulunya, dan menaiki punggungnya {sampai waktu yang ditentukan} waktu menyembelihnya {kemudian tempat penyembelihannya} tempat penyembelihannya {berada di sekitar rumah tua itu} di sekeliling tanah Haram"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. “Bagi kamu pada binatang-binatang kurban,” yaitu pada binatang-binatang sembelihan kurban “ada beberapa manfaat sampai kepada waktu yang ditentukan.” Ini terkandung pada binatang-binatang kurban yang digiring, yang berupa unta dan binatang ternak lainnya. Para pemiliknya dapat memanfaatkannya dengan menungganginya, memeras air susunya dan kegunaan lainnya yang tidak menyebabkan akibat buruk padanya sampai waktu yang telah diketahui dan ditentukan. Yaitu (waktu) penyembelihannya jika sudah sampai pada tempatnya, yaitu “Baitul ‘Atiq,” yakni wilayah kota haram (suci) seluruhnya, Mina dan lainnya. Bila telah disembelih, maka mereka dapat mengkonsumsinya dan membagikannya sebagai hadiah serta memberi makan orang-orang yang sengsara lagi membutuhkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 33: Maksudnya, binatang (unta, lembu, kambing, biri-biri) yang dibawa ke ka'bah untuk mendekatkan diri kepada Allah, disembelih di tanah Haram dan dagingnya dihadiahkan kepada fakir miskin dalam rangka ibadat haji. Maksudnya, binatang-binatang hadyu itu boleh kamu ambil manfaatnya, seperti dikendarai, diambil susunya dan sebagainya, sampai hari nahar untuk disembelih apabila sampai ke tempatnya, yaitu semua tanah Haram, seperti Mina dan lainnya. Setelah mereka menyembelihnya, maka mereka bisa makan, menghadiahkan dan memberikan kepada orang yang sengsara lagi fakir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 33",
    "description": "Bagi kamu yang sedang menunaikan ibadah haji padanya, yakni pada hewan hadyu yang disembelih sebagai pengganti (dam) pekerjaan wajib haji yang ditinggalkan; atau sebagai denda karena melanggar hal-hal yang terlarang mengerjakannya di dalam ibadah haji, ada beberapa manfaat yang bisa diambil seperti untuk dikendarai, diambil susunya, dan sebagainya, hingga waktu yang ditentukan, yakni hingga hari nahar, tanggal 10 zulhijah, kemudian tempat penyembelihannya adalah di sekitar baitul atiq, baitullah, di kawasan tanah haram. 34. Dan bagi setiap umat di antara umat para nabi terdahulu telah kami syariatkan penyembelihan hewan kurban guna mendekatkan diri kepada Allah, agar mereka menyebut nama Allah saat menyembelih hewan kurban, atas rezeki yang dikaruniakan Allah kepada mereka berupa hewaternak yang dikurbankan. Maka mantapkanlah dalam ucapan, pikiran, dan perasaan bahwa tuhanmu ialah tuhan yang maha esa, tidak ada sekutu bagi-Nya, karena itu berserahdirilah kamu kepada-Nya dengan salat yang khusyuk. Dan sampaikanlah olehmu, Muhammad, kabar gembira kepada orang-orang yang tunduk patuh kepada Allah bahwa mereka akan mendapat surga."
  }
]