[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi tiap golongan yang beriman yang telah lalu, Kami menjadikan baginya rangkaian ibadah manasik, berupa menyembelih dan menumpahkan darah (hewan sembelihan). Yang demikian itu, supaya mereka menyebut nama Allah waktu penyembelihan binatang-binatang ternak yang Allah karuniakan bagi kalian, kemudian bersyukur kepadaNya. Tuhan sembahan kalian (wahai sekalian manusia) adalah Tuhan sembahan Yang Maha Esa, yaitu Allah, maka patuhlah kepada perintahNya dan perintah RasulNya. Dan berilah kabar gembira (wahai Nabi) kepada orang-orang yang tawadhu lagi tunduk kepada Tuhan mereka, dengan kebaikan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan bagi setiap umat yang telah berlalu Kami syariatkan pada mereka suatu ibadah dalam bentuk penyembelihan hewan sebagai kurban kepada Allah, dengan harapan agar mereka menyebut nama Allah atas hewan-hewan kurban yang disembelih tersebut tatkala menyembelihnya; sebagai ungkapan rasa syukur kepada Allah atas rezeki yang Dia limpahkan kepada mereka berupa onta, sapi dan kambing. Maka wahai manusia, Tuhan kalian yang berhak disembah hanyalah Tuhan Yang Maha Esa, tiada sekutu bagi-Nya, hanya kepada-Nya lah hendaknya kalian tunduk dan taat, dan sampaikanlah -wahai Rasul- kabar gembira kepada orang-orang yang khusyuk lagi ikhlas beribadah kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Bagi setiap umat, Kami syariatkan baginya tempat beribadah dan menyembelih, agar mereka menyebut nama Allah Semata dan bersyukur kepada-Nya atas rezeki yang telah diberikan kepada mereka berupa unta, sapi, domba, dan kambing. Hai para hamba, Tuhan kalian Yang Esa adalah Allah, maka esakan dan taatilah Dia. Dan berilah kabar gembira bagi orang-orang yang tunduk dan taat kepada Allah, yang jika disebut nama Allah maka hati mereka akan khusyu’, dan orang-orang yang sabar dalam menghadapi cobaan, dan orang-orang yang senantiasa mendirikan shalat, serta orang-orang yang menginfakkan harta yang Kami berikan kepada mereka di jalan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلِكُلِّ أُمَّةٍ جَعَلْنَا مَنسَكًا (Dan bagi tiap-tiap umat telah Kami syariatkan penyembelihan) Yakni Kami jadikan tempat dan hari raya untuk menyembelih kurban sebagai pendekatan diri kepada Allah. لِّيَذْكُرُوا۟ اسْمَ اللهِ(supaya mereka menyebut nama Allah) Dan menjadikan manasik mereka hanya untuk Allah semata. عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ الْأَنْعٰمِ ۗ( terhadap binatang ternak yang telah direzekikan Allah kepada mereka) Yakni terhadap penyembelihan hewan yang direzekikan kepada mereka. فَإِلٰهُكُمْ إِلٰهٌ وٰحِدٌ (maka Tuhanmu ialah Tuhan Yang Maha Esa) Dia-lah yang menurunkan seluruh agama samawi. فَلَهُۥٓ أَسْلِمُوا۟ ۗ (karena itu berserah dirilah kamu kepada-Nya) Dengan tunduk dalam ketaatan dan ibadah-Nya. وَبَشِّرِ الْمُخْبِتِينَ(Dan berilah kabar gembira kepada orang-orang yang tunduk patuh) Yakni tunduk, patuh, dan ikhlas kepada Allah. Yakni Hai Muhammad berilah kabar gembira kepada mereka berupa pahala yang besar dan pemberian yang banyak yang telah disiapkan Allah bagi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "34-35 1 ). Ayat ini menjadi dalil paling kuat bahwa tingginya kedudukan suatu ibadah diantara ibadah-badah yang ada bagaimana ia disyari'atkan di semua syariat yang pernah ada, dan hal ini ada pada perintah berqurban: { وَلِكُلِّ أُمَّةٍ جَعَلْنَا مَنسَكًا لِّيَذْكُرُوا۟ ٱسْمَ ٱللَّهِ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ ٱلْأَنْعَٰمِ ۗ } \"Dan bagi tiap-tiap umat telah Kami syariatkan penyembelihan (kurban)\" maka apakah seorang muslim mampu menunaikan syi'ar ini semampu mereka?! 2 ). Tatkala Allah menjelaskan bagaimana berqurban diantara umat-ummat yang ada menjadi satu syari'at yang sama, Allah kemudian menutup ayat-Nya dengan: { فَإِلَٰهُكُمْ إِلَٰهٌ وَٰحِدٌ فَلَهُۥٓ أَسْلِمُوا۟ } \"maka Tuhanmu ialah Tuhan Yang Maha Esa, karena itu berserah dirilah kamu kepada-Nya\" maka ayat ini menjadi bukti yang jelas bahwa tujuan utama disatukannya ummat-ummat ini adalah untuk mentauhidkan Allah, dan meninggikan segala kewajiban-kewajiban baik dari segi akhlaq ataupun amalan-amalan. 3 ). { وَبَشِّرِ ٱلْمُخْبِتِينَ , الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ } Ibnu 'Athiyyah menjelaskan bahwa al-Ikhbat berarti tunduk dan takut; beliau kemudian berkata: dan ini adalah contoh yang mulia dari akhlak seorang mukmin yang lembuh sejuk 4 ). Ibadah haji mengajarkan tentang kethawadu'an, dan bagaiman kita berserah diri kepada Allah, ia juga mengajarkan agar sesorang tidak pernah menyombongkan diri kepada hamba Allah yang lainnya, perhatikan firman Allah: { وَبَشِّرِ ٱلْمُخْبِتِينَ } \"Dan berilah kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah)\". 5 ). Keadaan terbaik dari jiwa dan jasmani seorang muslim saat melaksanakan ibadah haji adalah dengan senantiasa tunduk dan takut dihadapan Allah, hatinya selalu condong kepada-Nya, dan hal ini merupakan penolong yang paling baik dalam kehidupan seseorang; mengingat dosa-dosa yang ditutupi oleh Allah dihadapan orang lain, terus mengingat kebaikan dan kasih sayang Allah terhadap dirinya. 6 ). Allah berfirman: { وَبَشِّرِ ٱلْمُخْبِتِينَ , الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَالصَّابِرِينَ عَلَىٰ مَا أَصَابَهُمْ وَالْمُقِيمِي الصَّلَاةِ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ } \"Dan berilah kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah) , (yaitu) orang-orang yang apabila disebut nama Allah gemetarlah hati mereka, orang-orang yang sabar terhadap apa yang menimpa mereka, orang-orang yang mendirikan sembahyang dan orang-orang yang menafkahkan sebagian dari apa yang telah Kami rezekikan kepada mereka\" di dalam ayat disebutkan untuk al-mukhbitin ada empat ciri-ciri: hati-hati mereka gemetar ketika disebutkan nama Allah, dan mereka sabar terhadap semua taqdir yang ditetapkan untuknya, dan mendirikan shalat dengan semua rukunnya baik zhahir maupun bathin, dan mereka senantiasa berbuat baik kepada sesama manusia melaui infaq dan sedekah dari harta yang diberikan oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Bagi tiap-tiap umat telah Kami syariatkan penyembelihan kurban, sebagai cara untuk mendekatkan diri kepada Allah dan supaya mereka menyebut nama Allah atas binatang ternak yang telah direzekikan Allah kepada mereka. Maka Tuhanmu ialah Tuhan Yang Maha Esa, karena itu berserah dirilah kamu kepada-Nya dalam ibadah dan ketaatan. Berilah kabar gembira kepada orang-orang yang tunduk patuh kepada Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagi setiap umat} kelompok yang beriman sebelum kalian {telah Kami syariatkan penyembelihannya} ketentuan penyembelihannya dan mengalirkan darahnya {agar mereka menyebut nama Allah atas binatang ternak yang Dia anugerahkan kepada mereka. Tuhan kalian adalah Tuhan Yang Maha Esa. Maka berserah dirilah kepadaNya} berserah dirilah dan tunduklah {Sampaikanlah kabar gembira kepada orang-orang yang tunduk} orang-orang yang khusyu’ dan ikhlas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. maksudnya, “dan bagi tiap-tiap umat,” dari umat-umat manusia yang telah berlalu, “telah Kami syariatkan penyembelihan (kurban),” maka berlomba-lombalah untuk mengerjakan kebaikan dan bersegeralah untuk melaksanakannya. Dan Kami akan memonitor siapakah orang yang paling baik amalannya. Hikmah Illahi yang tersimpulkan pada ketetapan Allah mengenai manasik haji bagi setiap umat secara tersendiri adalah untuk menghidupkan dzikrullah dan perhatian untuk mensyukuriNya. Oleh karena itu, Allah berfirman, “Supaya mereka menyebut nama Allah terhadap binatang ternak yang telah dirizikikan Allah kepada mereka, maka tuhanmu ialah TUhan Yang Maha Esa.” Kendatipun jenis-jenis aturan syariat berbeda-beda, semuanya sepakat pada satu prinsip dasar, yaitu penetapan uluhiyah bagi Allah dan pengesaanNya dengan ibadah, serta meninggalkan kesyirikan kepadaNya. Oleh karena itu, Allah berfirman, “Karena itu berserah dirilah kamu kepadaNya,” maksudnya patuhlah dan berserah dirilah kamu kepadanya, bukan kepada Dzat lain. Sesungguhnya berserah diri kepadaNya adalah jalan yang mengantarkan menuju Darussalam (surge). “Dan berilah kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah),” dengan kabar kebaikan dunia dan akhirat. Kata ‘almukhbitu’ bermakna orang yang tunduk kepada Rabbnya, pasrah dengan aturanNya, dan tawadhu’ dengan sesame hamba."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 34: Yakni yang beriman sebelum kamu. Ada pula yang menafsirkan “mansak” (lihat ayat tersebut) dengan hari raya. Oleh karena itu, hendaklah mereka bersegera kepada kebaikan dan berlomba-lomba kepadanya, agar Dia melihat siapa di antara kamu yang paling baik amalnya. Hikmah mengapa Allah mensyariatkan penyembelihan pada setiap umat adalah untuk mengingat-Nya dan bersyukur kepada-Nya. Ketika menyembelihnya. Meskipun syariat pada setiap umat berbeda-beda, namun semuanya sepakat terhadap asas yang satu ini, yaitu keberhakan Allah untuk diibadahi dan tidak berbuat syirk. Yakni tunduk dan patuhlah kepada-Nya (Islam), karena Islam merupakan jalan untuk sampai ke negeri keselamatan (surga). Dengan kebaikan di dunia dan akhirat. Yakni tunduk kepada Tuhannya, mengikuti perintah-Nya dan bertawadhu’ kepada hamba-hamba-Nya. Pada ayat selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan sifat orang-orang yang tunduk dan patuh kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 34",
    "description": "Dan bagi setiap umat di antara umat para nabi terdahulu telah kami syariatkan penyembelihan hewan kurban guna mendekatkan diri kepada Allah, agar mereka menyebut nama Allah saat menyembelih hewan kurban, atas rezeki yang dikaruniakan Allah kepada mereka berupa hewaternak yang dikurbankan. Maka mantapkanlah dalam ucapan, pikiran, dan perasaan bahwa tuhanmu ialah tuhan yang maha esa, tidak ada sekutu bagi-Nya, karena itu berserahdirilah kamu kepada-Nya dengan salat yang khusyuk. Dan sampaikanlah olehmu, Muhammad, kabar gembira kepada orang-orang yang tunduk patuh kepada Allah bahwa mereka akan mendapat surga. 35. Mereka yang mantap ketauhidan dan ketundukannya kepada Allah adalah orang-orang yang apabila disebut nama Allah hati mereka bergetar karena kerinduan mereka kepada-Nya; orang-orang yang sabar atas apa yang menimpa mereka, meskipun terasa pahit dan memberatkan punggung mereka; dan orang-orang yang melaksanakan salat wajib dan sunah dengan khusyuk; dan orang-orang yang menginfakkan sebagian rezeki yang kami karuniakan kepada mereka, baik waktu lapang maupun waktu kekurangan."
  }
]