[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang tawadhu lagi takut kepada Allah, di antara sifat mereka adalah, bila disebut nama Allah semata, mereka takut siksaanNya dan waspada jangan sampai menyelisihiNya. dan apabila tertimpa musibah dan kesulitan, mereka bersabar menghadapinya, dengan berharap pahala dari Allah dan menjalankan ibadah shalat dengan sempurna. Selain itu, mereka membelanjakan sebagian yang Allah karuniakan kepada mereka untuk hal-hal yang wajib atas mereka, seperti menunaikan zakat dan menafkahi keluarga dan nafkah orang yang menjadi kewajiban mereka, berinfak di jalan Allah dan infak-infak sunnah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Yaitu orang-orang yang apabila disebut nama Allah, mereka pun merasa takut akan azab-Nya, sehingga mereka pun menjauhi larangan-larangan-Nya, mendirikan salat secara sempurna, bersabar bila ditimpa musibah, dan menginfakkan sebagian rezeki yang dikaruniakan Allah pada mereka dalam hal-hal yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. الَّذِينَ إِذَا ذُكِرَ اللهُ وَجِلَتْ قُلُوبُهُمْ ((yaitu) orang-orang yang apabila disebut nama Allah gemetarlah hati mereka) Yakni benar-benar takut dan khawatir akan menyelisihi-Nya karena mereka memiliki keyakinan yang sempurna dan keimanan yang kuat. وَالصّٰبِرِينَ عَلَىٰ مَآ أَصَابَهُمْ(orang-orang yang sabar terhadap apa yang menimpa mereka) Berupa ujian dan cobaan dalam menjalani ketaatan kepada Allah. وَمِمَّا رَزَقْنٰهُمْ يُنفِقُونَ (dan orang-orang yang menafkahkan sebagian dari apa yang telah Kami rezekikan kepada mereka) Mereka menyedekahkannya pada berbagai jenis kebaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "34-35 1 ). Ayat ini menjadi dalil paling kuat bahwa tingginya kedudukan suatu ibadah diantara ibadah-badah yang ada bagaimana ia disyari'atkan di semua syariat yang pernah ada, dan hal ini ada pada perintah berqurban: { وَلِكُلِّ أُمَّةٍ جَعَلْنَا مَنسَكًا لِّيَذْكُرُوا۟ ٱسْمَ ٱللَّهِ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ ٱلْأَنْعَٰمِ ۗ } \"Dan bagi tiap-tiap umat telah Kami syariatkan penyembelihan (kurban)\" maka apakah seorang muslim mampu menunaikan syi'ar ini semampu mereka?! 2 ). Tatkala Allah menjelaskan bagaimana berqurban diantara umat-ummat yang ada menjadi satu syari'at yang sama, Allah kemudian menutup ayat-Nya dengan: { فَإِلَٰهُكُمْ إِلَٰهٌ وَٰحِدٌ فَلَهُۥٓ أَسْلِمُوا۟ } \"maka Tuhanmu ialah Tuhan Yang Maha Esa, karena itu berserah dirilah kamu kepada-Nya\" maka ayat ini menjadi bukti yang jelas bahwa tujuan utama disatukannya ummat-ummat ini adalah untuk mentauhidkan Allah, dan meninggikan segala kewajiban-kewajiban baik dari segi akhlaq ataupun amalan-amalan. 3 ). { وَبَشِّرِ ٱلْمُخْبِتِينَ , الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ } Ibnu 'Athiyyah menjelaskan bahwa al-Ikhbat berarti tunduk dan takut; beliau kemudian berkata: dan ini adalah contoh yang mulia dari akhlak seorang mukmin yang lembuh sejuk 4 ). Ibadah haji mengajarkan tentang kethawadu'an, dan bagaiman kita berserah diri kepada Allah, ia juga mengajarkan agar sesorang tidak pernah menyombongkan diri kepada hamba Allah yang lainnya, perhatikan firman Allah: { وَبَشِّرِ ٱلْمُخْبِتِينَ } \"Dan berilah kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah)\". 5 ). Keadaan terbaik dari jiwa dan jasmani seorang muslim saat melaksanakan ibadah haji adalah dengan senantiasa tunduk dan takut dihadapan Allah, hatinya selalu condong kepada-Nya, dan hal ini merupakan penolong yang paling baik dalam kehidupan seseorang; mengingat dosa-dosa yang ditutupi oleh Allah dihadapan orang lain, terus mengingat kebaikan dan kasih sayang Allah terhadap dirinya. 6 ). Allah berfirman: { وَبَشِّرِ ٱلْمُخْبِتِينَ , الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَالصَّابِرِينَ عَلَىٰ مَا أَصَابَهُمْ وَالْمُقِيمِي الصَّلَاةِ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ } \"Dan berilah kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah) , (yaitu) orang-orang yang apabila disebut nama Allah gemetarlah hati mereka, orang-orang yang sabar terhadap apa yang menimpa mereka, orang-orang yang mendirikan sembahyang dan orang-orang yang menafkahkan sebagian dari apa yang telah Kami rezekikan kepada mereka\" di dalam ayat disebutkan untuk al-mukhbitin ada empat ciri-ciri: hati-hati mereka gemetar ketika disebutkan nama Allah, dan mereka sabar terhadap semua taqdir yang ditetapkan untuknya, dan mendirikan shalat dengan semua rukunnya baik zhahir maupun bathin, dan mereka senantiasa berbuat baik kepada sesama manusia melaui infaq dan sedekah dari harta yang diberikan oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Orang-orang yang taat dan tunduk yaitu orang-orang yang apabila disebut nama Allah maka gemetarlah hati mereka. Orang-orang yang takut untuk membangkang kepada-Nya, juga orang-orang yang sabar terhadap cobaan dan kesulitan yang menimpa mereka. Serta orang-orang yang mendirikan sholat dengan rukun dan sesuai waktunya. Juga orang-orang yang menafkahkan sebagian dari apa yang telah Kami rezekikan kepada mereka dalam kebaikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang apabila disebut nama Allah, hati mereka bergetar} takut {sabar atas apa yang menimpa mereka, mendirikan shalat, dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Selanjutnya, Allah menerangkan karakteristik orang-orang yang tunduk. Allah berfirman,”(Yaitu) orang-orang yang apabila disebut nama Allah, niscaya gemetarlah hati mereka,” lantaran takut dan pengagungan terhadapNya. Karena itu, mereka meninggalkan perkara-perkara yang diharamkan, lantaran rasa takut dan kekhawatiran mereka kepada Allah semata. “Orang-orang yang sabar terhadap apa yang menimpa mereka,” berupa malapetaka, bahaya dan berbagai macam gangguan, sehingga tidak menyeret mereka untuk geram terhadap salah satu peristiwa yang terjadi. Mereka bersabar untuk mencari Wajah Rabb mereka, mengharapkan ganjaran dariNya dan menunggu-nunggu pahalaNya. “Dan orang-orang yang mendirikan shalat,” yaitu orang-orang yang mengaplikasikannya secara tegak, lurus lagi sempurna, dengan cara, melaksanakan perkara-perkara yang wajib dan mustahab serta ubudiyah (penghambaan diri kepada Allah) yang lahiriah maupun batiniah di dalamnya. “Dan orang-orang yang menafkahkan sebagian dari apa yang telah Kami rizkikan kepada mereka.” Keterangan ini mencakup seluruh jenis nafkah yang wajib (dibayarkan), seperti zakat, kaffarah (denda), nafkah bagi para istri, budak dan kaum kerabat (dan mencakup) nafkah-nafkah yang mustahab, misalnya mengeluarkan sedekah dengan berbagai caranya. Allah mengemukakannya dengan kata (min) yang mengandung pengertian tab’idh (sebagian dari harta), agar diketahui kemudahan esensi perintah Allah dan anjuranNya. Kadarnya (berjumlah) sebagian kecil saja dari limpahan rizki dari Allah. Seorang hamba tidak mempunyai kemampuan untuk menghasilkannya kalau tidak ada orang yang diberi rizki yang Allah karuniakan kepadamu, niscaya Allah akan mencurahkan rizki kepadamu dan menambahi kemurahanNya kepadamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 35: Karena takut dan ta’zhim (mengagungkan) kepada-Nya, sehingga karenanya mereka meninggalkan perbuatan-perbuatan haram. Berupa musibah dan berbagai penderitaan. Mereka tidak berkeluh kesah, bahkan bersabar sambil mengharapkan keridhaan Allah dan mengharapkan pahalanya. Pada waktunya. Mereka kerjakan gerakan dan ucapan yang wajib maupun yang sunatnya. Disebutkan “sebagian (min)” agar diketahui mudahnya perintah Allah, dan bahwa yang diminta tidak banyak-banyak. Oleh karena itu, wahai orang yang mendapatkan rezeki, infakkanlah sebagian dari rezeki itu, niscaya kamu akan diberi nafkah dan diberikan tambahan karunia-Nya. Mencakup semua infak yang wajib, seperti zakat, kaffarat, menafkahi istri dan budak jika ada, menafkahi kerabat terdekat. Demikian pula infak yang sunat, seperti bersedekah dengan semua macamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 35",
    "description": "Mereka yang mantap ketauhidan dan ketundukannya kepada Allah adalah orang-orang yang apabila disebut nama Allah hati mereka bergetar karena kerinduan mereka kepada-Nya; orang-orang yang sabar atas apa yang menimpa mereka, meskipun terasa pahit dan memberatkan punggung mereka; dan orang-orang yang melaksanakan salat wajib dan sunah dengan khusyuk; dan orang-orang yang menginfakkan sebagian rezeki yang kami karuniakan kepada mereka, baik waktu lapang maupun waktu kekurangan. 36. Dan unta-unta yang digemukkan dan diberi kalung untuk dikurbankan itu kami jadikan untuk kamu, para tamu Allah, sebagai bagian dari syiar agama Allah, dalam pelaksanaan ibadah haji; kamu banyak memperoleh kebaikan padanya untuk alat transportasi, mengangkut barang, mengambil susu, dan berkurban. Maka sebutlah nama Allah ketika kamu akan menyembelihnya dalam keadaan unta-unta itu berdiri, karena lazimnya unta disembelih dalam posisi berdiri, dan kaki-kaki-Nya telah terikat dengan kuat. Kemudian apabila unta-unta itu telah rebah, selesai disembelih, maka makanlah oleh kamu sebagian dagingnya dan beri makanlah dengan daging unta itu orang-orang fakir dan miskin yang merasa cukup dengan apa yang ada padanya, yang tidak meminta-minta karena menjaga kehormatan dirinya, dan orang-orang fakir dan miskin yang meminta-minta karena kebutuhan mendesak untuk menjaga kelangsungan hidupnya. Demikianlah kami tundukkan unta-unta itu untukmu, hingga unta-unta itu tidak berontak ketika kamu akan menyembelihnya agar kamu bersyukur kepada Allah atas karunia-Nya yang diberikan kepada kamu."
  }
]