[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menjadikan bagi kalian penyembelihan unta dan sapi yang gemuk itu termasuk syiar agama dan simbol pengenalnya, supaya kalian mendekatkan diri kepada Allah, bagi kalian (wahai orang-orang yang berkurban/mendekatkan diri kepada Allah) ada kebaikan padanya berupa berbagai jenis pemanfaatan darinya seperti makan, sedekah, pahala dan ganjaran. Maka ketika menyembelihnya, ucapkanlah, “Bismillah.” Dan unta disembelih dalam keadaan berdiri dengan tiga kaki yang dibiarkan tegak lurus, sedang kaki keempat dirantai. Kemudian apabila sudah roboh di atas tanah, maka sungguh telah halal untuk memakannya. Lalu hendaklah orang-orang yang berkurban menyantapnya sebagai bentuk ibadah dan memberi makan darinya orang fakir yang tidak meminta-minta untuk menjaga kehormatan dan orang miskin yang meminta-minta karena didesak kebutuhannya. Demikianlah, Allah menundukkan unta bagi kalian supaya kalian bersyukur kepada Allah karena ditundukannya unta bagi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Unta dan sapi yang dibawa ke Baitullah tersebut Kami jadikan sebagai syiar agama Allah bagi kalian. Di dalamnya kalian mendapati manfaat duniawi dan ukhrawi, maka bacalah \"Bismillah\" tatkala menyembelihnya, yaitu setelah kakinya dirapatkan dalam keadaan berdiri, dan salah satu tangannya diikat agar tidak berontak melarikan diri. Dan apabila onta itu telah rebah dan mati, maka makanlah sebagian darinya -wahai orang yang menjadikannya sebagai hadyu-, dan berikanlah sebagiannya kepada orang-orang miskin yang enggan mengemis, dan orang-orang miskin yang datang agar diberi. Sebagaimana Kami tundukkan hewan-hewan itu agar menjadi pembawa barang-barang dan kendaraan kalian, maka demikian pula lah Kami tundukkan hewan-hewan itu agar kalian mudah menyembelihnya; demi mendekatkan diri kepada Allah, agar kalian bersyukur kepada Allah atas karunia ditundukkannya hewan-hewan tersebut bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan berkurban dengan unta yang gemuk untuk Allah telah Kami jadikan sebagai syiar syariat yang Allah perintahkan kepada hamba-hamba-Nya; bagi kalian manfaat darinya di dunia dan di akhirat, maka katakanlah ketika menyembelihnya “Bismillah” ketika unta itu berdiri di atas tiga kakinya, dan kaki yang keempat dalam keadaan terikat; dan ketika unta itu jatuh ke tanah dan nyawanya telah tercabut maka ia menjadi halal untuk dimakan; maka makanlah ia sesuka hati kalian, dan berilah makan kepada orang fakir yang enggan meminta-minta karena ingin menjaga kehormatannya, dan berilah kepada orang yang meminta demi memenuhi kebutuhannya. Demikianlah Kami jadikan unta itu tunduk kepada kalian, agar kalian bersyukur kepada Allah atas segala nikmat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَالْبُدْنَ جَعَلْنٰهَا لَكُم مِّن شَعٰٓئِرِ اللهِ (Dan telah Kami jadikan untuk kamu unta-unta itu sebahagian dari syi’ar Allah) Yakni unta-unta yang dijadikan sebagai binatang hadyu yang digiring ke Bitullah. Yang dimaksud dengan (البدن) adalah unta. Dan terdapat perbedaan pendapat apakah sapi termasuk dari (البدن). لَكُمْ فِيهَا خَيْرٌ ۖ( kamu memperoleh kebaikan yang banyak padanya) Yakni manfaat duniawi dan ukhrawi, sebagaimana telah disebutkan. فَاذْكُرُوا۟ اسْمَ اللهِ عَلَيْهَا(maka sebutlah olehmu nama Allah ketika kamu menyembelihnya) Yakni saat menyembelihnya. صَوَآفَّ ۖ( dalam keadaan berdiri) Yakni dalam keadaan kaki yang terikat, sebab cara menyembelih unta adalah menyembelihnya dalam keadaan terikat salah satu kaki depannya agar tidak berontak atau lari. فَإِذَا وَجَبَتْ جُنُوبُهَا(Kemudian apabila telah roboh) Yakni apabila badan unta itu telah roboh setelah disembelih, yaitu setelah keluar ruhnya. فَكُلُوا۟ مِنْهَا وَأَطْعِمُوا۟ الْقَانِعَ وَالْمُعْتَرَّ ۚ( maka makanlah sebahagiannya dan beri makanlah orang yang rela dengan apa yang ada padanya (yang tidak meminta-minta) dan orang yang meminta) Makna (القانع) adalah orang yang ridha dengan apa yang ia miliki tanpa meminta pada orang lain. Sedangkan makna (المعتر) adalah orang yang meminta-minta. كَذٰلِكَ سَخَّرْنٰهَا لَكُمْ(Demikianlah Kami telah menundukkan unta-unta itu kepada kamu) Sehingga unta-unta itu mau tunduk kepada kalian untuk digiring ke tempat penyembelihan, kemudian kalian menyembelihnya dan memanfaatkannya; dan sebelumnya tunduk pada kalian untuk mengangkut barang dan sebagai tunggangan serta diambil air susunya, dan lain sebagainya. لَعَلَّكُمْ تَشْكُرُونَ(mudah-mudahan kamu bersyukur) Bersyukur atas kenikmatan yang Allah berikan kepada kalian ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu ketika Sa'id bin al-Musayyib menunaikan ibadah haji, dan bersamanya juga Ibnu Harmalah, pada hari penyembelihan qurban Said membeli seekor domba kemudian menyembelihnya, sedangkan Ibnu Harmalah membeli seekor Unta dan menyembelihnya pula, Sa'id kemudian bertanya: kenapa kamu tidak menyembelih sperti yang kami sembeli? Ia kemudian menjawab: sesungguhnya aku telah mendengar firman Allah: { وَٱلْبُدْنَ جَعَلْنَٰهَا لَكُم مِّن شَعَٰٓئِرِ ٱللَّهِ لَكُمْ فِيهَا خَيْرٌ } \"Dan telah Kami jadikan untuk kamu unta-unta itu sebahagian dari syi'ar Allah, kamu memperoleh kebaikan yang banyak padanya\" oleh karena itulah aku ingin mengambil kebaikan darinya sebagaimana Allah memberiku petunjuk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Telah Kami jadikan untuk kamu unta-unta, sapi, dan lainnya itu sebagian dari syiar Allah yang menyeru mereka kepada Baitullah. Kamu memperoleh kebaikan di dunia dan akhirat yang banyak padanya, maka sebutlah nama Allah ketika kamu menyembelihnya dengan berdiri dan telah terikat dengan berucap: Allahu akbar, laa ilaaha illallah, wallahu akbar. Ya Allah ini adalah rezeki dari-Mu dan juga akan kembali pada-Mu. Sebab hewan kurban jika disembelih dengan berdiri dan terikat dengan kencang. Kemudian apabila telah roboh/mati dan telah dikuliti, maka makanlah sebagian dan beri makanlah orang yang fakir yang menjaga diri mereka untuk tidak meminta-minta dan juga orang yang meminta-minta. Sebagaimana Kami telah menjelaskan penyembelihannya dengan berdiri, maka Kami juga telah menundukkan unta-unta itu kepada kamu, agar kamu bersyukur atas nikmat Allah kepadamu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Unta-unta itu} unta, dan sapi yang diserahkan ke Baitullah {Kami jadikan untuk kalian sebagai bagian dari syiar-syiar Allah. Bagi kalian terdapat kebaikan padanya. Maka sebutlah nama Allah padanya} ketika menyembelihnya {dalam keadaan berdiri} dalam keadaan berdiri dengan tiga kaki, dan kakinya yang kiri terikat {Lalu apabila telah rebah} telah terjatuh ke tanah setelah disembelih {makanlah sebagian darinya dan berilah makan orang yang merasa cukup} orang yang berharap yang meminta-minta dengan menunduk {dan orang yang meminta-minta} orang yang tidak memerlukan pemberian, tidak mengharapkannya dan tidak memintanya {Demikianlah Kami telah menundukkannya} menundukkannya {untukmu agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Ini menjadi dalil bahwa syia’ar-syi’ar itu bersifat umum atas semua symbol agama yang zhahir (terlihat). Sudah dipaparkan sebelumnya bahwa Allah memberitahukan bahwa orang yang mengagungkan syi’ar-syi’arNya, maka sikap tersebut adalah bagian dari (cerminan) kerakwaan hati. Di sini, Dia mengabarkan bahwa di antara bentuk syi’ar-syi’arNya (symbol agama) adalah al-Budn yaitu unta atau sapi berdasarkan pendapat lain. Maka, ia diberi perhatian, digemukkan dan disikapi dengan baik. “Kamu memperoleh kebaikan yang banyak padanya,” yaitu pada binatang ternak yang dikurbankan ataupun yang tidak, dalam bentuk dimakan, disedekahkan, dimanfaatkan dan turunnya ganjaran dan pahala. “Maka sebutlah nama Allah ketika kamu menyembelihnya,” saat menyembelihnya, ucapkanlah, “Bismillah,” dan (selanjutnya) sembelihlah “dalam keadaan berdiri (dan terikat),” dalam keadaan berdiri, dengan cara menegakannya di atas kaki empatnya. Tangan (maksudnya, kaki depan) kirinya diikatkan (pada suatu tiang), dan kemudian disembelih. “Kemudian apabila telah roboh (Mati),” maksudnya apabila telah terjatuh di tanah saat dikuliti, kemudian si penjagal mengguling-gulingkan sisinya di tanah. Saat itulah, dagingnya telah siap untuk dimakan. “Maka makanlah sebagiannya,” perintah ini tertuju pada orang yang berkurban. Sehingga dia boleh makan sebagian dari kurbannya. “Dan beri makanlah orang yang rela dengan apa yang ada padanya (yang tidak meminta-minta) dan orang yang meminta,” maksudnya orang fakir yang tidak meminta-minta dan orang yang meminta,” maksudnya orang fakir yang tidak meminta-minta karena qana’ah (menerima apa adanya) yang ingin menjaga kehormatannya dan orang fakir yang meminta-minta. Masing-masing mempunyai hak pada hewan kurban. “Demikianlah Kami telah menundukannya kepada kamu,” yaitu unta “mudah-mudahan kamu bersyukur,” kepada Allah atas pengerahan binatang-binatang ternak (bagi kalian). Sungguh, bila Allah tidak mengendalikannya, maka kalian tidak mempunyai daya untuk (menundukan) nya. Akan tetapi, Dia mengkondisikan dan mengendalikannya bagi kalian sebagai bentuk rahmat dan curahan kebaikanNya kepada kalian. Maka, pujilah Dia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 36: Orang yang mengurbankan hewan tersebut atau selainnya. Maksudnya, berbagai manfaat di dunia dan mendapatkan pahala di akhirat. Manfaat di dunia misalnya, dapat memakannya, menyedekahkannya, memanfaatkannya dsb. Di atas kaki-kakinya yang empat, bagian depan kakinya, yaitu yang kiri diikat, lalu dinahr (ditikam). Setelah dinahr (ditikam). Sehingga kamu dapat menyembelihnya dan menungganginya. Jika Dia tidak menundukkannya, tentu engkau tidak akan sanggup melakukan hal itu. Dia menundukkannya untuk kamu karena rahmat-Nya dan ihsan-Nya kepada kamu. Oleh karena itu, pujilah Dia. Yakni terhadap nikmat-Ku kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 36",
    "description": "Dan unta-unta yang digemukkan dan diberi kalung untuk dikurbankan itu kami jadikan untuk kamu, para tamu Allah, sebagai bagian dari syiar agama Allah, dalam pelaksanaan ibadah haji; kamu banyak memperoleh kebaikan padanya untuk alat transportasi, mengangkut barang, mengambil susu, dan berkurban. Maka sebutlah nama Allah ketika kamu akan menyembelihnya dalam keadaan unta-unta itu berdiri, karena lazimnya unta disembelih dalam posisi berdiri, dan kaki-kaki-Nya telah terikat dengan kuat. Kemudian apabila unta-unta itu telah rebah, selesai disembelih, maka makanlah oleh kamu sebagian dagingnya dan beri makanlah dengan daging unta itu orang-orang fakir dan miskin yang merasa cukup dengan apa yang ada padanya, yang tidak meminta-minta karena menjaga kehormatan dirinya, dan orang-orang fakir dan miskin yang meminta-minta karena kebutuhan mendesak untuk menjaga kelangsungan hidupnya. Demikianlah kami tundukkan unta-unta itu untukmu, hingga unta-unta itu tidak berontak ketika kamu akan menyembelihnya agar kamu bersyukur kepada Allah atas karunia-Nya yang diberikan kepada kamu. 37. Allah menjelaskan bahwa daging hewan kurban dan darahnya itu sekali-kali tidak akan sampai kepada Allah, karena kurban itu bukan sesajen dan Allah tidak membutuhkan darah dan daging, tetapi yang sampai kepada-Nya adalah ketakwaan kamu, yaitu sikap kamu melawan rasa cinta terhadap harta dan kikir dengan berkurban, peduli, dan berbagi kepada fakir miskin dan duafa guna mendekatkan diri kepada Allah. Demikianlah salah satu tujuan dia menundukkannya untuk kamu dengan menjinakkan unta-unta itu untuk disembelih agar kamu mengagungkan Allah dengan mengumandangkan takbir ketika menyembelih hewan kurban itu atas petunjuk yang dia berikan kepadamu dengan mensyariatkan tata cara berkurban, tujuan, dan waktunya. Dan sampaikanlah, oleh kamu Muhammad kabar gembira kepada orang-orang yang berbuat baik yang beriman, berkurban, serta peduli dan berbagi terhadap fakir miskin dan duafa dengan tujuan mengharap keridaan Allah."
  }
]