[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah sampai kepada Allah daging-daging dan darah-darah dari sembelihan-sembelihan itu sedikit pun. Akan tetapi, yang sampai kepadaNya adalah keikhlasan padaNya dan niat mencari Wajah Allah dengannya. Demikianlah Kami menundukkan bagi kalian, (wahai orang-orang yang mendekatkan diri kepada Allah) supaya kalian mengagungkan Allah dan bersyukur kepadaNya atas kebenaran yang Allah tunjukkan pada kalian, karena Dia memang berhak untuk itu. Dan sampaikanlah kabar gembira, (wahai Nabi), kepada orang-orang yang berbuat baik dengan beribadah kepada Allah semata dan juga berbuat kebaikan kepada hamba-hambaNya, dengan segala kebaikan dan keberuntungan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Daging atau darah hewan yang kalian kurbankan sebagai hadyu tersebut sekali-kali tidak akan pernah sampai kepada Allah, dan tidak pula akan diangkat kepada-Nya, tetapi yang akan sampai kepada-Nya hanyalah sifat takwa kalian kepada Allah di dalamnya; yaitu dengan memurnikan ketaatan dalam melakukan perintah-Nya agar dengannya kalian bisa mendekatkan diri kepada Allah. Demikian pula Dia menundukkan hewan tersebut agar kalian mengagungkan Allah sebagai ungkapan rasa syukur pada-Nya atas petunjuk kebenaran yang Dia karuniakan pada kalian. Dan sampaikanlah -wahai Rasul- kabar gembira kepada orang-orang yang berbuat baik dalam beribadah kepada Tuhan mereka dan dalam bergaul dengan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Yang menjadi tujuan dari penyembelihan hewan kurban dan hadyu adalah untuk menampakkan penyembelihannya, namun yang menjadi tujuan adalah agar mencapai keikhlasan kepada Allah. Daging dan darahnya tidak akan sampai kepada Allah, akan tetapi ketakwaan kalianlah yang sampai kepada-Nya dengan mentaati segala perintah-Nya dan menjauhi segala larangan-Nya. Demikianlah Kami menjadikannya tunduk kepada kalian, agar kalian mengagungkan Allah dan mensyukuri hidayah yang diberikan kepada kalian menuju kebenaran. Dan berilah kabar gembira bagi orang-orang yang baik perkataan dan perbuatan mereka, bahwa mereka akan mendapat surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. لَن يَنَالَ اللهَ لُحُومُهَا (Daging-daging unta itu sekali-kali tidak dapat mencapai (keridhaan) Allah) Yakni daging-daging unta yang kalian sedekahkan ini tidak akan naik kepada-Nya dan mencapai keridhaan-Nya. وَلَا دِمَآؤُهَا(dan begitu pula darahnya) Yakni darah yang tumpah pada saat penyembelihannya. وَلٰكِن يَنَالُهُ(tetapi yang dapat mencapainya) Yakni yang dapat mencapainya adalah ketakwaan dari hati kalian, itulah yang akan diterima Allah dan akan dibalas. كَذٰلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا۟ اللهَ (Demikianlah Allah telah menundukkannya untuk kamu supaya kamu mengagungkan Allah) Yakni ucapan penyembelih “Allahu Akbar” ketika menyembelih. Ini merupakan dalil disyariatkan untuk mengucapkan basmalah dan takbir saat menyembelihnya. عَلَىٰ مَا هَدَىٰكُمْ ۗ (terhadap hidayah-Nya kepada kamu) Sesuai dengan apa yang ditunjukkan Allah kepada kalian berupa pengetahuan tentang cara mendekatkan diri kepada Allah. وَبَشِّرِ الْمُحْسِنِينَ (Dan berilah kabar gembira kepada orang-orang yang berbuat baik) Yakni semua orang yang mengerjakan kebaikan karena mengharap ridha Allah dengan penuh kesungguhan dalam beramal dan perasaan diawasi Allah. Ibnu Mundzir mengeluarkan hadits dari Ibnu ‘Abbas, ia berkata: dahulu orang-orang musyrik apabila menyembelih hewan, mereka mengarahkan darahnya ke Ka’bah agar darah itu mengucur ke Ka’bah. Kemudian kaum muslimin hendak melakukan hal itu. Maka Allah menurunkan ayat: لن ينال الله لحومها ولا دماؤها"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sebagian salaf angka bicara mengomentari ayat : { لَن يَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَآؤُهَا وَلَٰكِن يَنَالُهُ ٱلتَّقْوَىٰ مِنكُمْ } \"Daging-daging unta dan darahnya itu sekali-kali tidak dapat mencapai (keridhaan) Allah, tetapi ketakwaan dari kamulah yang dapat mencapainya\" jika kamu bertaqwa kepada Allah melalui unta-unta ini, dan kamu mengerjakannya untuk Allah, dan kamu juga meminta apa yang Allah katakan; dengan tujuan mengagungkan kemuliaan-kemuliaan yang dtetapkan oleh-Nya, maka semua tulah yang akan diterima di sisi Allah. 2 ). Dari ayat yang sama as-Sa'di mengatakan dalam tafsirnya: maka semua ibadah yang tidak dibarengi dengan keikhlasan dan ketaqwaan kepada Allah, bagaikan kulit buah tidak berisi dengan buahnya, dan bagaikan jasad yang tidak ada ruhnya. 3 ). { لَن يَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَآؤُهَا وَلَٰكِن يَنَالُهُ ٱلتَّقْوَىٰ مِنكُمْ } perhatikan satu kata dalam ayat ini: { مِنكُمْ } \"dari kalian\" dapat difahami bahwa semua amalan-amalan ini merupakan pengorbanan yang mest kita lakukan dengan diri kita sendiri, mengeluarkan harta untuk dinfakkan, menyembelih hewan qurban dari harta kita, jika semuanya telah diralisasikan, maka yang tersisisa selanjutnya adalah mewujudkan inti dari semua amalan ini, yaitu taqwa, karena dengannya apa yang telah kita amalan akan dibalas dengan ganjaran yang setimpal, dan sebaliknya jika semuanya terlewatkan, kerugian yang akan kita terima kenyataannya. 4 ). { لَن يَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَآؤُهَا وَلَٰكِن يَنَالُهُ ٱلتَّقْوَىٰ مِنكُمْ } Ayat ini menjadi kaidah utama dalam manasik haji; ketika kalian melihat gerombolan manusia beromba-lomba dan berdesak-desakan untuk menunaikan amalan-amalan yang zhahir ini, maka dahuluilah meraka dalam ketaqwaan kepada Allah. 5 ). Tercantum dalam ayat-ayat haji yang menjelaskan pentingnya peran hati seorang mukmin, dimana tidak tercantum pada rukun-rukun islam lainnya; karena pada mansik haji seseorang bisa melakukan suatu ibadah namun hatinya keluar daripada apa yang ditentukan oleh syari'at dan itu bertolak belakang dengan maksud utama perintah haji, hal ini senada dengan firman Allah: { لَن يَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَآؤُهَا وَلَٰكِن يَنَالُهُ ٱلتَّقْوَىٰ مِنكُمْ } \"Daging-daging unta dan darahnya itu sekali-kali tidak dapat mencapai (keridhaan) Allah, tetapi ketakwaan dari kamulah yang dapat mencapainya\". 6 ). Kalau anda sering membaca dan mengamati ayat-ayat haji anda akan mendapati pengulangan perintah takbir, dzikir kepada Allah, dan semuanya berfokus pada ketaqwaan kepada Allah dan amalan hati; karena betapa banyak orang yang menjalankan ibadah haji hanya menginginkan pandangan manusia kepadanya, sehingga ia terseret keluar dari tujuan utama dar perintah haji yaitu iman dan taqwa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Daging-daging dan darah hewan-hewan kurban itu sekali-kali tidak dapat mencapai dan terangkat di sisi Allah, tetapi ketakwaan kamulah yang akan sampai kepada Allah. Allah akan memberi balasan atas ketakwaanmu. Dan ketakutanmu kepada Allah dengan menjalankan amal saleh dengan keimanan. Demikianlah Allah telah menundukkannya untuk kamu supaya kamu mengagungkan Allah terhadap hidayah-Nya kepada kamu. Dan berilah kabar gembira wahai Nabi kepada orang-orang yang berbuat baik semata-mata mengharab ridho Allah dan dalam ketaatan dengan balasan surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Daging dan darahnya itu tidak akan sampai kepada Allah} ampai kepada Allah {tetapi yang sampai kepadaNya adalah ketakwaan kalian} yang sampai kepadaNya dalah ketakwaan hati dan kehendak kalian yang ikhlas kepadaNya dalam melakukan amal tersebut {Demikianlah Dia menundukkannya untuk kalian agar kalian mengagungkan Allah atas petunjuk yang Dia berikan kepada kalian. Berilah kabar gembira kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Daging-daging unta dan darahnya itu sekali-kali tidak dapat mencapai (keridhaan) Allah,” maksudnya tujuan (yang terselip) padanya (binatang-binatang kurban) itu bukan semata-mata penyembelihannya saja. Tidaak ada sedikit pun dari daging-daging dan darahnya yang sampai kepada Allah. Sebab, Dia Dzat Yang Mahakaya lagi Terpuji. Yang sampai kepadaNya, hanyalah ikhlas (waktu mengurbankan) nya dan mengharapkan pahala serta niatan yang baik. Oleh karena itu, Dia berfirman, “Tetapi ketakwaan dari kamulah yang dapat mencapainya.” Dalam ayat ini tertuang anjuran dan himbauan untuk ikhlas pada saat menyembelih unta. Hendaknya tujuannya adalah mencari Wajah Allah saja, bukan untuk membanggakan diri, riya’ (pamer agar dilihat), sum’ah (pamer agar didengar), ataupun hanya sekedar melaksanakan kebiasaan (budaya). Begitu pula, pada semua jenis ibadah, jika tidak dibarengi dengan ikhlas dan kerakwaan kepada Allah, maka badah tersebut bagaikan kulit (buah) yang tidak ada intisarinya, atau seperti tubuh tanpa roh. “Demikianlah Allah telah menundukannya untuk kamu supaya kamu mengagungkan Allah,”agar kalian mengagungkan dan memuliakanNya. Maka “atas hidayahNya kepadamu,” sebagai timbal balik atas pemberian hidayahNya bagi kalian. Maka sungguh, Dia berhak menerima sanjungan yang paling sempurna, pujian yang paling agung dan pengagungan yang paling tinggi. “Dan berilah kabar gembira kepada orang-orang yang berbuat baik,” dalam beribadah kepada Allah, dengan menyembah Allah seolah-olah mereka melihatNya. Bilamana mereka belum mencapai tingkatan ini, hendaknya mereka beribadah kepadaNya dengan meyakini pengawasan Allah dan pandanganNya kepada mereka pada saat beribadah. Dan hendaklah berbuat baik kepada para hamba Allah dengan beragam cara, baik yang berupa bantuan materi, ilmu, jabatan, nasihat, amar ma’ruf dan nahi munkar, atau kata-kata yang baik dan lain-lain. Kaum Muhsinun, mereka memperoleh kabar gembira dari Allah dalam bentuk kebahagiaan dunia dan akhirat. Allah melimpahkan kebaikan kepada mereka, sebagaimana mereka telah berbuat baik dalam beribadah kepadaNya dan berbuat baik kepada para hambaNya. \"Tidak ada balasan kebaikan kecuali kebaikan (pula).\" (Ar-Rahman:60), dan FirmanNya \"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya\" (Yunus:26)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 37: Maksud daripadanya bukanlah hanya menyembelih semata, dan lagi daging dan darahnya sedikit pun tidak akan sampai kepada Allah, karena Dia Mahakaya lagi Maha Terpuji. Maksudnya amal saleh yang ikhlas karena-Nya dan di atas iman. Dalam ayat ini terdapat dorongan untuk berbuat ikhlas, baik dalam ibadah kurban maupun dalam ibadah lainnya, bukan untuk berbangga, riya atau karena kebiasaan. Semua ibadah yang tidak disertai keikhlasan seperti jasad tanpa ruh. Seperti menunjukkan kepada kita syi’ar-syi’ar agama-Nya dan manasik hajinya, serta menunjukkan kepada kita hal-hal lain yang di sana terdapat kebaikan bagi kita. Yaitu mereka yang beribadah seakan-akan melihat-Nya atau merasakan pengawasan dari-Nya dan orang-orang yang berbuat baik kepada hamba-hamba Allah dengan berbagai macamnya, seperti memberikan manfaat harta, ilmu, kedudukan, saran, amar ma’ruf dan nahi munkar, ucapan yang baik, dsb. Orang-orang yang berbuat ihsan akan mendapatkan kabar gembira dari Allah dengan memperoleh kebahagiaan di dunia dan akhirat, dan Allah akan berbuat ihsan kepada mereka sebagaimana mereka berbuat ihsan dalam ibadah-Nya dan kepada hamba-hamba-Nya, dan bukankah balasan terhadap kebaikan adalah kebaikan pula?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 37",
    "description": "Allah menjelaskan bahwa daging hewan kurban dan darahnya itu sekali-kali tidak akan sampai kepada Allah, karena kurban itu bukan sesajen dan Allah tidak membutuhkan darah dan daging, tetapi yang sampai kepada-Nya adalah ketakwaan kamu, yaitu sikap kamu melawan rasa cinta terhadap harta dan kikir dengan berkurban, peduli, dan berbagi kepada fakir miskin dan duafa guna mendekatkan diri kepada Allah. Demikianlah salah satu tujuan dia menundukkannya untuk kamu dengan menjinakkan unta-unta itu untuk disembelih agar kamu mengagungkan Allah dengan mengumandangkan takbir ketika menyembelih hewan kurban itu atas petunjuk yang dia berikan kepadamu dengan mensyariatkan tata cara berkurban, tujuan, dan waktunya. Dan sampaikanlah, oleh kamu Muhammad kabar gembira kepada orang-orang yang berbuat baik yang beriman, berkurban, serta peduli dan berbagi terhadap fakir miskin dan duafa dengan tujuan mengharap keridaan Allah. 38. Orang-orang kafir mekah dengan segala cara berusaha menghalangi tersebarnya ajaran islam. Pada ayat ini dijelaskan bahwa sesungguhnya Allah membela orang yang beriman dengan menguatkan hati mereka untuk bersabar, memiliki daya tahan, menghadapi segala cobaan dan rintangan yang dilakukan orang-orang kafir mekah tersebut. Sungguh, Allah tidak menyukai setiap orang beriman yang berkhianat terhadap agama, sesama orang beriman, serta perjuangan islam; dan Allah pun sangat tidak menyukai orang-orang yang kufur atas nikmat-Nya."
  }
]