[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah menolak dari kaum Mukminin permusuhan orang-orang kafir dan tipu daya orang-orang jahat; karena sesungguhnya Allah tidak menyukai orang yang suka berkhianat terhadap tugas amanah dari Tuhannya lagi banyak mengingkari nikmat-nikmatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Sesungguhnya Allah melindungi orang-orang yang beriman kepada Allah dari kejahatan musuh-musuh mereka. Sesungguhnya Allah tidak menyukai setiap orang yang mengkhianati amanat yang diembankan padanya, dan orang yang kufur terhadap nikmat Allah, yang tidak bersyukur kepada Allah, bahkan cenderung mendurhakai-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Allah memberi kabar gembira bagi hamba-hamba-Nya yang beriman bahwa Dia akan menolong dan melindungi mereka dari tipu daya musuh-musuh mereka. Sungguh Allah tidak menyukai setiap orang yang suka mengkhianati amanah dan mengingkari kenikmatan-kenikmatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. إِنَّ اللهَ يُدٰفِعُ عَنِ الَّذِينَ ءَامَنُوٓا۟ (Sesungguhnya Allah membela orang-orang yang telah beriman) Allah melindungi orang-orang beriman dari keburukan orang-orang musyrik. Pendapat lain mengatakan Allah akan memenangkan hujjah mereka. إِنَّ اللهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ (Sesungguhnya Allah tidak menyukai tiap-tiap orang yang berkhianat lagi mengingkari nikmat) Namun orang-orang kafir dan pengkhianat adalah orang-orang yang dimurkai Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا } \"Sesungguhnya Allah membela orang-orang yang telah beriman\" dapat dikatakan bahwa: orang-orang kafir menggunakan segala cara untuk merusak orang-orang beriman, oleh karena itu Allah mengahalngi kejahatan mereka dari kaum mukminin. 2 ). Allah mengikat kata pembelaan-Nya untukmu dengan kata Iman; dalam artian setiap imanmu bertambah maka bartambah pula pembelaan Allah untukmum, dan sebaliknya jika iman justru berkurang maka pembelaah Allah untukmu juga berkurang, dan ini sejalan dengan qaidah tafsir yang berbunyi: hukum tergantung bagaimana sifat suatu perkara, bertambah dengan bertambahnya sifat dan berkurang dengan berkurangnya sifat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Sesungguhnya Allah membela orang-orang yang telah beriman dari gangguan orang musyrik. Sesungguhnya Allah tidak menyukai tiap-tiap orang yang berkhianat atas amanah yang mereka emban, dan banyak mengingkari nikmat. Maksudnya Allah akan menghukum mereka sebab perbuatan mereka itu. Ayat ini turun ketika orang beriman telah banyak di Makkah sedangkan orang-orang kafir menyakiti mereka. Sehingga mereka hijrah menuju Habasyah, dan sebagian orang mukmin menghendaki untuk memerangi orang kafir yang telah menipu, menghianati dan membunuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah membela} menghalangi tipu daya orang-orang musyrik {orang-orang yang beriman. Sesungguhnya Allah tidak menyukai setiap orang yang berkhianat} selalu mengkhianati amanat {lagi sangat ingkar} mengingkari nikmat-nikmat Allah yang diberikan kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Ini merupakan informasi, janji dan berita baik dari Allah bag orang-orang yang beriman, bahwa Allah melindungi mereka dari segala hal yang dibenci, mengenyahkan segala kejelekan dari mereka, lantaran keimanan mereka (kepada Allah), seperti kejahatan orang-orang kafir, kejelekan dan bisikan keraguan dari setan, keburukan-keburukan internal mereka, kesalahan-kesalahan amalan-amalan mereka, menanggung beban penderitaan mereka saat datangnya musibah tatkala mereka tidak mampu memikulnya, sehingga meringankannya sampai benar-benar ringan. Setiap Mukmin memperolh hak pembelaan dan keutaman ini sesuai dengan kadar keimanannya, sedikit atau banyak. “Sesungguhnya Allah tidak menyukai tiap-tiap orang yang berkhianat,” maksudnya berkhianat dengan amanah yang dibebankan oleh Allah kepadanya. Ia mengurangi hak-hakNya dan Allah yang menjadi kewajibannya, mengkhianati hak-hakNya dan mengkhianati hak orang lain, “lagi mengingkari (nikmat),” terhadap nikmat-nikmat Allah. Allah mengucurkan kebaikan kepadanya, namun dia (membalasnya) dengan bersikap kufur dan maksiat muncul bersusul-susulan darinya. Oleh karena itu, Allah tidak mencintainya. Sebaliknya, Dia membenci dan memurkainya serta akan membalasinya atas tindakan kekufuran dan pengkhianatannya. Bisa dipahami dari ayat ini (mafhum al-ayat) bahwasanya Allah mencintai setiap orang yan dapat dipercaya, bertanggung jawab dengannya, lagi bersyukur kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 38: Dari kejahatan orang-orang kafir, was-was setan, dan dari kejahatan dan keburukan diri mereka sendiri. Dia akan menanggung apa yang menimpa mereka sehingga musibah itu terasa ringan baginya. Setiap orang mukmin mendapatkan pembelaan dari Allah sesuai tingkat keimanannya. Dalam amanah yang diembankan kepadanya. Misalnya tidak memenuhi hak Allah dan hak hamba-hamba-Nya. Seperti halnya orang-orang musyrik. Mafhum ayat ini adalah bahwa Allah senang kepada setiap orang yang melaksanakan amanahnya dan bersyukur kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 38",
    "description": "Orang-orang kafir mekah dengan segala cara berusaha menghalangi tersebarnya ajaran islam. Pada ayat ini dijelaskan bahwa sesungguhnya Allah membela orang yang beriman dengan menguatkan hati mereka untuk bersabar, memiliki daya tahan, menghadapi segala cobaan dan rintangan yang dilakukan orang-orang kafir mekah tersebut. Sungguh, Allah tidak menyukai setiap orang beriman yang berkhianat terhadap agama, sesama orang beriman, serta perjuangan islam; dan Allah pun sangat tidak menyukai orang-orang yang kufur atas nikmat-Nya. 39. Selama 13 tahun di mekah Allah membela orang yang beriman dengan menguatkan hati mereka untuk bersabar dalam menghadapi hinaan, boikot, pengusiran dan percobaan pembunuhan yang dilakukan orang-orang kafir. Kini, setelah hijrah ke madinah diizinkan kepada orang-orang yang diperangi untuk berperang guna membela diri dan kehormatan agama dalam perang badar, karena sesungguhnya mereka dizalimi selama di mekah. Dan sungguh, Allah mahakuasa menolong me-reka itu pada perang badar dengan menurunkan para malaikat untuk mengalahkan orang-orang kafir mekah."
  }
]