[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dahulu kaum Muslimin pada awal perkembangan mereka, dilarang untuk memerangi orang-orang kafir, dan diperintahkan untuk bersabar mengahadapi gangguan mereka. Kemudian ketika gangguan kaum Musyrikin sudah mencapai puncaknya, sementara Nabi telah keluar berhijrah dari Makkah menuju Madinah, kemudian Islam memiliki kekuatan, Allah mengizinkan kaum Muslimin untuk maju berperang, disebabkan apa yang mereka alami berupa penindasan dan permusuhan. Dan sesungguhnya Allah Mahakuasa untuk menolong mereka dan menghinakan musuh-musuh mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. \"Allah telah mengizinkan orang-orang beriman, yang diperangi orang-orang musyrik, untuk melakukan perlawanan perang, karena musuh-musuh mereka tersebut sudah sangat menzalimi mereka, dan sesungguhnya Allah Maha Kuasa untuk memenangkan orang-orang mukmin atas musuh-musuh mereka meskipun tanpa perang, namun konsekuensi hikmah-Nya mengharuskan Dia menguji orang-orang beriman dengan melakukan perang terhadap orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Allah mengizinkan orang-orang beriman untuk memerangi musuh-musuh yang memerangi mereka, sebab mereka telah dizalimi dengan menghalangi mereka dari agama dan mengusur mereka dari tempat tinggal mereka. Maka mereka diperbolehkan untuk membela diri dan menuntut hak mereka kembali. Sungguh hanya Allah yang mampu menolong hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. أُذِنَ لِلَّذِينَ يُقٰتَلُونَ بِأَنَّهُمْ ظُلِمُوا۟ ۚ (Telah diizinkan (berperang) bagi orang-orang yang diperangi, karena sesungguhnya mereka telah dianiaya) Dahulu orang-orang musyrik Makkah menyakiti para sahabat Rasulullah dengan lidah dan tangan mereka. Lalu para sahabat mengeluhkannya pada Rasulullah, maka Beliau bersabda kepada mereka “Bersabarlah kalian, karena aku belum diperintahkan untuk berperang.” Sampai ketika Rasulullah telah berhijrah, Allah menurunkan ayat ini di Madinah, ini adalah ayat pertama yang membolehkan perang demi membela akidah dan pengikutnya. Pembolehan perang bagi mereka ini adalah bagian dari pembelaan dan perlingdungan Allah bagi orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Orang-orang mukmin yang diperangi orang-orang musyrik telah diizinkan memerangi mereka, karena sesungguhnya mereka telah dianiaya baik lisan maupun perbuatan oleh orang-orang kafir. Dan sesungguhnya Allah, benar-benar Maha Kuasa untuk menolong mereka dengan menghilangkan siksaan orang kafir. Inilah yang menjadi janji Allah dalam dua kondisi. Ayat ini adalah ayat yang pertama turun di Madinah yang mengizinkan untuk berperang, setelah orang mukmin mendapatkan berbagai siksaan di Makkah. Ketika orang mukmin mengadu atas siksaan orang musyrik kepada rasul maka beliau menjawab: Bersabarlah, karena sesungguhnya aku belum mendapat perintah untuk berperang sampai hijrah. Lalu turunlah ayat ini di Madinah. Ketika Nabi berhijrah, Abu Bakar mengatakan: Tunjukkan nabi mereka, sesungguhnya kita semua adalah milik Allah dan akan kembali kepada-Nya. Sehingga turun ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Diizinkan} Allah mengizinkan {kepada orang-orang yang diperangi karena sesungguhnya mereka dizalimi. Sesungguhnya Allah benar-benar Maha kuasa membela mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Dimasa permulaan Islam, kaum Muslimin dilarang memerangi kaum kafir dan diperintahkan untuk bersabar terhadap (gangguan) mereka atas dasar hikmah ilahi. Ketika mereka telah berhijrah ke Madinah dan tetap ditindas, sementara telah terhimpun ketahanan diri dan kekuatan, maka mereka diperbolehkan melancarkan peperangan. Sebagaimana tertuang dalam Firman Allah, “telah diizinkan (berperang) bagi orang-orang yang diperangi.” Dapat dipahami dari ayat tersebut, bahwasanya sebelumnya, mereka dilarang melakukannya. Kemudian Allah mengizinkan bagi mereka untuk memerangi kaum yang melancarkan peperangan (kepada mereka). Allah memberikan lampu hijau bagi mereka (untuk berperang), karena mereka pihak yang terzhalimi, lantaran dihalang-halangi dari (menjalankan) agama mereka dan disakiti karenanya serta diusir dari kampung-kampung mereka “Dan sesungguhnya Allah, benar-benar Mahakuasa menolong mereka itu,” maka hendaknya mereka memohon pertolongan kepadaNya dan meminta bantuan padaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 39: Ayat ini merupakan ayat pertama yang turun berkenaan dengan jihad. Sebelumnya, yakni di awal-awal Islam, kaum muslimin dilarang berperang melawan orang-orang kafir dan diperintahkan bersabar karena hikmah ilahiyyah (kebijaksanaan dari Allah). Ketika mereka berhijrah ke Madinah dan masih disakiti, sedangkan mereka sudah memiliki kekuatan, maka Allah mengizinkan mereka berperang. Mereka yang diperangi adalah orang-orang mukmin. Mereka dilarang menjalankan ibadah dan disakiti ketika menjalankannya, bahkan sampai diusir dari kampung halamannya. Oleh karena itu, mintalah pertolongan kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 39",
    "description": "Selama 13 tahun di mekah Allah membela orang yang beriman dengan menguatkan hati mereka untuk bersabar dalam menghadapi hinaan, boikot, pengusiran dan percobaan pembunuhan yang dilakukan orang-orang kafir. Kini, setelah hijrah ke madinah diizinkan kepada orang-orang yang diperangi untuk berperang guna membela diri dan kehormatan agama dalam perang badar, karena sesungguhnya mereka dizalimi selama di mekah. Dan sungguh, Allah mahakuasa menolong me-reka itu pada perang badar dengan menurunkan para malaikat untuk mengalahkan orang-orang kafir mekah. 40. Orang-orang beriman yang diizinkan untuk berperang itu adalah orang-orang yang diusir dari kampung halamannya di mekah tanpa alasan yang benar, baik menurut akal sehat maupun nurani. Alasan satu-satunya dari tindakan tersebut adalah hanya karena mereka berkata, 'tuhan kami ialah Allah, ' lalu istikamah dalam keyakinannya. Seandainya Allah tidak menolak keganasan sebagian manusia kepada sebagian yang lain yang menumpahkan darah dan saling menghancurkan, dengan diizinkan berperang kepada orang-orang beriman guna membela diri dan menyadarkan penyerang untuk menghentikan serangannya dan bersedia hidup berdampingan dengan toleran, tentu telah dirobohkan biara-biara nasrani, gereja-gereja, rumah-rumah ibadah orang yahudi dan masjid-masjid yang di dalamnya banyak disebut nama Allah akibat keganasan perang. Allah pasti akan menolong orang yang menolong agama-Nya dengan mencegah perang dan memperjuangkan perdamaian. Sungguh, Allah mahakuat, mahaperkasa atas segala sesuatu."
  }
]