[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah telah menetapkan dan menakdirkan pada diri setan, bahwa ia akan menyesatkan setiap makhluk yang mengikutinya, dan tidak menunjukkan kepadanya menuju jalan kebenaran. Bahkan sebaliknya, menyeretnya menuju siksaan Neraka Jahanam yang apinya menyala-nyala, sebagai balasan baginya lantaran mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Telah ditetapkan atas setiap pembangkang dari kalangan setan manusia dan jin itu bahwa barangsiapa yang mengikuti dan membenarkannya maka ia pasti menyesatkannya dari jalan kebenaran, dan mengantarnya ke azab Neraka disebabkan kekafiran dan maksiat yang dilakukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Ketetapan Allah bahwa barangsiapa yang berserikat dengan setan, maka dia akan menyesatkannya dan menyerumuskannya ke dalam neraka Jahannam yang berkobar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. كُتِبَ عَلَيْهِ أَنَّهُۥ مَن تَوَلَّاهُ (yang telah ditetapkan terhadap syaitan itu, bahwa barangsiapa yang berkawan dengan dia) Yakni diteteapkan bagi setan, baik itu setan dari jenis jin maupun dari jenis manusia, bahwa siapa yang mengikuti dan membenarkan perkataan setan dan tidak membenarkan para Nabi dan kitab-kitab yang telah diturunkan, kemudian dia menjadikan setan sebagai kawannya, maka setan akan menyesatkannya. فَأَنَّهُۥ يُضِلُّهُۥ(tentu dia akan menyesatkannya) Karena setan selalu berusaha untuk menyesatkan dari jalan yang benar. وَيَهْدِيهِ إِلَىٰ عَذَابِ السَّعِيرِ(dan membawanya ke azab neraka) Yakni menariknya kepada sesuatu yang dapat menjerumuskannya ke azab neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "3-4 Ditanyakan kepada sebagian ulama apakah ada dalam al-Qur'an syahid yang menguatkan perumpamaan: \"مَنْ أَعَانَ ظَالِماً سَلَّطَ عَلَيْهِ\" \"barangsiapa yang menolong orang jahat akan dikuasai olehnya\" ? maka dijawab ya, firman Allah: { كُتِبَ عَلَيْهِ أَنَّهُ مَنْ تَوَلَّاهُ فَأَنَّهُ يُضِلُّهُ وَيَهْدِيهِ إِلَىٰ عَذَابِ السَّعِيرِ } \"Yang telah ditetapkan terhadap syaitan itu, bahwa barangsiapa yang berkawan dengan dia, tentu dia akan menyesatkannya, dan membawanya ke azab neraka\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Yang telah ditetapkan atas syaitan adalah bahwa barangsiapa mengikuti dan membenarkan bujukan mereka, maka dia akan menyesatkannya dari jalan kebenaran, dan membawanya ke azab neraka Jahannam. Neraka Sair adalah api yang berpijar-pijar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Telah ditetapkan atasnya} telah ditetapkan atas setan yang membangkang itu {bahwa siapa saja yang berteman dengannya} menjadikannya sebagai teman dan mengikutinya {akan disesatkan dan ditunjukkan} digiring {ke azab yang menyala-nyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Maksudnya, di antara manusia ada satu golongan dan kelompok. Mereka itu menempuh jalan kesesatan dan mulai menyanggah al-haq dengan kebatilan. Mereka bertujuan untuk menetapkan kebatilan dan memberangus al-haq. Padahal, mereka berada pada puncak kebodohan, tidak mempunyai ilmu sedikit pun. Paling-paling, modal yang mereka miliki hanyalah taklid kepada tokoh-tokoh kesesatan, dari kalangan setan yang jahat, membangkang kepada Allah dan kepada para utusanNya, lagi memusuhi mereka. Sungguh ia telah menentang Allah dan RasulNYa. Dan akhirnya, menjelma seorang tokoh yang mempropagandakan jalan menuju neraka. “Yang telah ditetapkan terhadap setan itu,” telah ditakdirkan pada setan yang jahat ini “bahwa barangsiapa yang berkawan dengannya,” maksudnya barangsiapa mengikutinya “tentu dia akan menyesatkannya,” dari jalan kebenaran dan menjauhkan dirinya dari shiratal mustaqim (jalan yang lurus) “dan membawanya ke dalam azab neraka.” Ini adalah tangan kanan iblis secara nyata. Allah telah berfirman tentang orang semacam ini, \"karena sesungguhnya setan-setan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala \" (Fathir:6). Orang ini, yang berusaha membantah tentang Allah, ia telah memadukan antara kesesatan pribadi dengan upayanya untuk menyesatkan orang-orang. (Dalam melakukannya) ia adalah orang yang hanya mengikuti dan meniru-niru setan yang jahat. Sebuah cerminan berbagai kegelapan yang saling menutupi. Termasuk dalam konteks ini, semua orang-orang kafir dan ahli bid’ah. Sesungguhnya mayoritas mereka hanya mengikuti semata, membantah tanpa dasar ilmu (yang shahih)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 4: Maksudnya, mengikuti. Dari kebenaran dan menjauhkannya dari jalan yang lurus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 4",
    "description": "Allah mengingatkan manusia tentang setan, telah ditetapkan di lauh mahfuz, bahwa siapa yang berkawan dengan dia, dengan meng-ikuti bisikannya, maka dia akan menyesatkannya, dari jalan Allah yang lurus, dan membawanya dengan tidak sadar ke dalam azab neraka yang apinya senantiasa menyala. 5. Wahai manusia! hidup sesudah mati itu suatu keniscayaan. Jika kamu meragukan hari kebangkitan dari alam kubur, maka perhatikanlah perkembangan hidup kamu. Sesungguhnya kami telah menjadikan kamu dari tanah, yakni saripati makanan yang berasal dari tanah. Kemudian dari setetes mani, yang sudah bercampur antara sperma dan sel telur. Kemudian dari segumpal darah, setelah beberapa minggu. Kemudian dari segumpal daging setelah segumpal darah itu tumbuh-kembang menjadi segumpal daging dengan dua kemungkinan, ada yang sempurna kejadiannya tanpa cacat apa pun, dan yang tidak sempurna, karena ada cacat fisik maupun mental sejak dari kandungan, agar kami jelaskan kepada kamu bahwa kamu berada dalam kekuasaan kami. Dan kami tetapkan kamu sewaktu embrio dalam rahim ibumu menurut kehendak kami hingga tiap orang berbeda rentang waktu berada dalam kandungan ibunya sampai waktu yang sudah ditentukan, biasanya setelah 36 minggu. Kemudian kami keluarkan kamu dari rahim ibu kamu sebagai bayi, kemudian dengan berangsur-angsur kamu sampai kepada usia dewasa. Dan di antara kamu ada yang diwafatkan dalam usia muda, bahkan masih bayi; dan ada pula yang diberi umur panjang, serta dikembalikan kepada usia pikun karena sangat tua, sehingga dia tidak mengetahui lagi sesuatu yang telah diketahuinya karena penyakit ketuaannya. Dan ada contoh lain betapa mudah bagi Allah membangkitkan manusia dari alam kubur, kamu lihat bumi ini kering, karena kekurangan air di musim kemarau, kemudian apabila telah kami turunkan air hujan di atasnya, maka hidup-lah bumi yang kering kerontang itu dan menjadi subur dan bumi yang subur itu menumbuhkan berbagai jenis pasangan tetumbuhan yang indah. Demikianlah paparan empiris tentang argumentasi betapa mudah bagi Allah membangkitkan manusia dari alam kubur menuju mahsyar."
  }
]