[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu, orang-orang yang terpaksa keluar meninggalkan kampung halaman mereka, bukan karena sesuatu (kesalahan) yang mereka perbuat selain karena mereka memeluk agama Islam dan mengatakan, “Tuhan kami adalah Allah semata.” Seandainya bukan karena ketetapan yang sudah Allah syariatkan, untuk menolak kezhaliman yang mengambil manfaat darinya oleh setiap pengikut agama yang diturunkan dan menolak kebatilan dengan jihad yang dizinkan pastilah kebenaran akan terpecundangi pada setiap ummat, dan tentulah bumi akan rusak, dan robohlah tempat-tempat ibadah di muka bumi, seperti biara-biara para rahib, gereja-gereja umat Nasrani dan tempat-tempat penyembahan kaum Yahudi, serta masjid-masjid yang kaum Muslimin mengerjakan shalat di dalamnya dan mengingat Nama Allah di sana dengan sebanyak-banyaknya. Barangsiapa bersungguh-sungguh untuk membela agama Allah, maka sesungguhnya Allah menjadi penolongnya terhadap musuhnya. Sesungguhnya Allah Mahakuat, tidak terkalahkan, lagi Mahaperkasa, yang tidak dapat terjamah; Dia telah menundukkan semua makhluk dan menggenggam ubun-ubun mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Yaitu orang-orang yang diusir oleh orang-orang kafir dari kampung halaman mereka secara zalim, tanpa memiliki dosa apapun, melainkan hanya karena menyatakan, \"Tuhan kami adalah Allah, tiada Tuhan kami selain-Nya,\" Dan seandainya Allah tidak mensyariatkan kepada para Nabi dan orang-orang beriman syariat perang terhadap musuh-musuh mereka, niscaya mereka akan membinasakan tempat-tempat ibadah, mereka pasti akan merobohkan biara-biara para rahib, gereja-gereja Nasrani, rumah-rumah ibadah Yahudi, dan masjid-masjid umat islam yang dibangun untuk tempat ibadah, padahal di dalamnya kaum muslimin banyak menyebut nama Allah, dan Allah pasti akan menolong orang yang menolong agama dan nabi-Nya, sungguh Dia Maha Kuat untuk menolong orang yang menolong agama-Nya, lagi Maha Perkasa yang tidak akan dikalahkan oleh siapa pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Dan sebagian kezaliman yang mereka terima adalah mereka dipaksa untuk meninggalkan negeri mereka tanpa alasan yang benar, namun hanya dikarenakan mereka menyembah Allah semata. Dan seandainya Allah tidak mensyariatkan jihad untuk melawan kezaliman, niscaya kerusakan akan merajalela dengan hancurnya rumah-rumah ibadah, seperti tempat ibadah para rahib, gereja orang-orang Yahudi dan Nasrani, dan masjid kaum muslimin yang mereka jadikan sebagai tempat shalat dan banyak berzikir kepada Allah. Sungguh Allah pasti akan menolong agama dan rasul-Nya. Allah Maha Kuat dalam melakukan apa yang Dia kehendaki, dan Maha Perkasa dalam kerajaan-Nya sehingga tidak ada yang dapat mengalahkan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. الَّذِينَ أُخْرِجُوا۟ مِن دِيٰرِهِم بِغَيْرِ حَقٍّ ((yaitu) orang-orang yang telah diusir dari kampung halaman mereka tanpa alasan yang benar) Yakni dari rumah-rumah milik kaum Muhajirin yang mereka tinggalkan di Makkah. إِلَّآ أَن يَقُولُوا۟ رَبُّنَا اللهُ ۗ(namun hanya karena mereka berkata: “Tuhan kami hanyalah Allah”) Mereka diusir hanya karena mereka mengatakan “Tuhan kami adalah Allah” وَلَوْلَا دَفْعُ اللهِ النَّاسَ(Dan sekiranya Allah tiada menolak (keganasan) sebagian manusia) Yakni seandainya Allah tidak mensyariatkan perang bagi para Nabi dan orang-orang beriman melawan musuh mereka niscaya orang-orang musyrik akan berkuasa dan tempat-tempat ibadah di bumi akan musnah. Makna (الصوامع) adalah kuil-kuil milik para rahib. Makna (البيع) adalah gereja-gereja orang Nasrani. Makna (الصلوات) adalah gereja-gereja orang Yahudi. Dan (المساجد) adalah masjid-masjid orang Islam. Pendapat lain mengatakan makna ayat ini adalah seandainya bukan karena perlindungan Allah niscaya gereja-gereja orang Yahudi akan hancur di zaman Musa, kuil-kuil dan gereja-gereja orang Nasrani di zaman Isa, dan masjid-masjid di zaman Muhammad. يُذْكَرُ فِيهَا اسْمُ اللهِ كَثِيرًا ۗ (yang di dalamnya banyak disebut nama Allah) Yakni perangilah mereka agar kalian dapat menegakkan penyebutan Allah. وَلَيَنصُرَنَّ اللهُ مَن يَنصُرُهُۥٓ ۗ( Sesungguhnya Allah pasti menolong orang yang menolong (agama)-Nya) Yang dimaksud dengan menolong Allah adalah menolong agama dan para kekasih-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "40-41 Berhukum kepada selain hukum Allah adalah diantara sebab perubahan buruk pada suatu negara, dan ini terbukti dari zaman ke zaman, dan barangsiapa yang Allah inginkan baginya kebahagiaan Allah akan menjadikannya belajar dari kebahagiaan yang dirasakan orang lain, sehingga ia pun mengikuti jalan orang-orang yang dikuatkan oleh Allah, dan menjauhi jalan orang-orang yang Allah hinakan baginya, sesungguhnya Allah berfirman: { وَلَيَنصُرَنَّ ٱللَّهُ مَن يَنصُرُهُۥٓ ۗ إِنَّ ٱللَّهَ لَقَوِىٌّ عَزِيزٌ - ٱلَّذِينَ إِن مَّكَّنَّٰهُمْ فِى ٱلْأَرْضِ أَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ وَأَمَرُوا۟ بِٱلْمَعْرُوفِ وَنَهَوْا۟ عَنِ ٱلْمُنكَرِ ۗ وَلِلَّهِ عَٰقِبَةُ ٱلْأُمُورِ } \"Sesungguhnya Allah pasti menolong orang yang menolong (agama)-Nya. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa - (yaitu) orang-orang yang jika Kami teguhkan kedudukan mereka di muka bumi niscaya mereka mendirikan sembahyang, menunaikan zakat, menyuruh berbuat ma'ruf dan mencegah dari perbuatan yang mungkar; dan kepada Allah-lah kembali segala urusan\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Orang yang diizinkan untuk berperang adalah orang-orang yang telah diusir dari kampung halaman mereka Makkah dan diambil harta mereka tanpa alasan yang benar, karena mereka tidak berbuat kesalahan apapun. Namun mereka diusir karena mengatakan: \"Tuhan kami hanyalah Allah. Dan sekiranya Allah tidak menolak keganasan sebagian manusia kepada yang lain, maka pasti biara-biara Nasrani, gereja-gereja, rumah-rumah ibadat orang Yahudi dan masjid-masjid, orang muslim yang di dalamnya banyak disebut nama Allah telah dirobohkan. Sesungguhnya Allah pasti menolong orang yang menolong agama-Nya. Sesungguhnya Allah benar-benar Maha Kuat, Maha Kuasa lagi Maha Perkasa, Maha tidak terkalahkan dan tidak bisa terkalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Yaitu) orang-orang yang diusir dari kampung halamannya tanpa alasan yang benar hanya karena mereka berkata,“Tuhan kami adalah Allah” Seandainya Allah tidak menolak sebagian manusia dengan sebagian yang lain} Seandainya Allah memerintahkan kepada para nabi dan orang-orang mukmin untuk memerangi musuh {sungguh telah dirobohkan} telah diruntuhkan dengan menguasai orang-orang yang musyrik {biara-biara} tembat-tempat ibadah para rahib Nasrani {gereja-gereja} gereja-gereja orang Nasrani {sinagog-sinagog} tempat-tempat ibadah orang-orang Yahudi {dan masjid-masjid} masjid-masjid orang muslim {yang di dalamnya banyak disebut nama Allah. Sungguh Allah menolong orang yang menolong (agama)Nya. Sesungguhnya Allah benar-benar Maha kuat lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Kemudian, Allah menceritakan tentang bentuk tindakan kezhaliman mereka. Allah berfirman, “(yaitu) orang-orang yang telah diusir dari kampung-kampung halaman mereka,” maksudnya mereka dipaksa untuk keluar (dari kampung halaman) dengan melancarkan penindasan dan fitnah (kepada kaum Muslimin) “tanpa alasan yang benar kecuali,” bahwa dosa mereka yang menyebabkan para musuh menindas ialah “karena mereka berkata, ‘Rabb kami hanyalah Allah’,” maksudnya, kecuali karena mereka mengesakan Allah dan menyembahNya dengan mengikhlaskan ibadah kepadaNya. Jika ini memang dosa, maka itulah dosa mereka. Persis seperti Firman Allah, \"Dan mereka tidak menyiksa orang-orang mukmin itu melainkan karena orang-orang mukmin itu beriman kepada Allah Yang Maha Perkasa lagi Maha Terpuji,\" (Al-Buruj:8) Ayat ini menunjukkan kepada hikmah pensyariatan jihad. Sesungguhnya, tujuan jihad yaitu penegakan agama Allah atau menahan orang-orang kafir yang mengganggu kaum Mukminin, yang mengawali perbuatan melampaui batas kepada kaum Mukminin dan tindakan aniaya dan permusuhan mereka terhadap kaum Mukminin, (dan) keleluasaan untuk beribadah kepada Allah, dan penegakan syariat-syariat yang zhahirah. Oleh Karena itu, Allah berfirman, “Dan sekiranya Allah tidak menolak (keganasan) sebagian manusia dengan (keberadaan) sebagian yang lain,” maka Allah mengenyahkan bahaya yang ditimbulkan kaum kafir dengan keberadaan kaum mujahidin di jalanNya, “tentulah telah dirobohkan biara-biara Nasrani, gereja-gereja, rumah-rumah ibadah orang yahudi, danm asjid-masjid,” maksudnya, tempat-tempat ibadah yang besar ini milik sejumlah golongan ahli kitab dari penganut agama Nasrani dan Yahudi dan masjid-masjid kepunyaan kaum Muslimin benar-benar akan hancur berantakan. “Yang didalamnya disebut,” yaitu di tempat-tempat ibadah ini “nama Allah dengan banyak,” shalat-shalat ditegakkan, kitab-kitab Allah dibaca dan penyebutan nama Allah diulang-ulang dengan berbagai jenis dzikir di dalamnya. Seandainya Allah tidak menolak (keganasan) sebagian manusia dengan (keberadaan) sebagian yang lain, niscaya kaum kafir dapat menguasai kaum muslimin. Lalu, mereka melulhlantahkan tempat-tempat ibadah mereka dan melancarkan fitnah yang menguji keyakinan agama mereka. Hal ini menandakan bahwa pelaksanaan jihad disyariatkan untuk tujuan menghentikan amukan pihak tertentu dan yang mengganggu, dan (disyariatkan) untuk sasaran lainnya. Hal ini juga menunjukkan bahwa Negara-negara yang di dalamnya telah terwujud ketenangan untuk melakukan ibadah kepada Allah, masjid-masjidnya dimakmurkan, seluruh symbol-simbol agama menonjol, keadaan ini merupakan bagian dari jasa mulia kaum mujahidin dan keberkahan mereka. Allah melenyapkan kaum kafir darinya. Allah berfirman, \"Seandainya Allah tidak menolak (keganasan) sebahagian manusia dengan sebahagian yang lain, pasti rusaklah bumi ini. Tetapi Allah mempunyai karunia (yang dicurahkan) atas semesta alam.\" (Al-Baqarah:251). Bila anda mengatakan : sekarang ini, kita menyaksikan masjid-masjid kaum Muslimin begitu semarak, tidak rusak. Padahal kebanyakan (negeri-negeri kaum MUslimin) kecil dan pemerintahannya tidak teratur dan mereka tidak terdorong untuk memerangi Negara-negara tetangga dari bangsa barat. Bahkan kita menyaksikan masjid-masjid yang berada di bawah pemerintahana dan penguasaan mereka (kaum kafir) tetap makmur (terpelihara). Para pemiliknya (kaum Muslimin) pun merasa tentram. Padahal penguasa dari kalangan kaum kafir mampu menghancurkannya. Lalu Allah mengabarkan bahwa seandainya tidak ada perlindungan Allah terhadap manusia dengan (keberadaan) sebagian yang lain, niscaya tempat-tempat ibadah itu akan hancur, tapi kita tidak menyaksikan adanya perlindungan? Untuk menjawabnya, bahwasanya jawaban pertanyaan dan masalah ini masuk dalam konteks keumuman ayat ini, dan menjadi salah satu bagiannya. Karena sesungguhnya orang yang mengerti seluk-beluk Negara-negara dan aturannya sekarang ini, yang menganggap bahwa setiap suku dan ras yang berada di bawah dan masuk di dalam kekuasaannya adalah anggota dari kerajaannya, bagian dari pemerintahannya, baik suku tersebut mempunyai kekuatan dengan jumlah orangnya, peresenjataannya, materinya, ilmunya atau pelayanannya, maka pihak pemerintah-pemerintah tersebut memberikan atensi pada kemaslahatan-kemaslahatan kelompok warga tersebut yang bersifat agamis maupun duniawi. Pemerintahan-pemerintahan itu khawatir bila tidak memenuhinya, stabilitas Negara akan goncang dan kehilangan sebagian dari tumpuannya. Maka, pemerintaha tersebut melaksanakan kebijakan yang berkaitan dengan agama atas alasan ini, terutama pembangunan masjid-masjid. Sesungguhnya, masjid-masjid itu sungguh-sungguh terpelihara rapi –walillahil hamd-. Bahkan yang berada di ibukota Negara-negara kafir sekalipun. Negara-negara itu memberikan otoritas otonomi, karena pertimbangan perasaan rakyat merekka dari kaum muslimin, kendatipun masih ada sifat dengki dan kebencian pada Negara-negara Nasrani (untuk kaum Muslimin) yang sudah dikabarkan oleh Allah bahwa ia akan tetap berlangsung sampai Hari KIamat. Maka, pemerintahan Islam yang tidak mampu membela kedaulatannya tetap aman dari bahaya mereka yang banyak lantaran keberadaan sifat kedengkian pada mereka. Tidak ada salah seorang pun dari mereka yang mampu mencengkramkan tangannya kepadanya karena takut dari tindakan Negara Islam membela diri dengan (meminta bantuan) Negara yang lain. Meskipun demikian, Allah pasti akan memperlihatkan kepada para hambaNya tentang kemenangan Islam dan kaum Muslimin yang telah dijanjikan di dalam kitabNya. Walillahil hamd, sudah terlihat faktor-faktor yang mengarah ke sana, dengan timbulnya perasaan di kalangan kaum Muslimin akan pentingnya kembali kepada agama mereka. Timbulnya perasaan ini merupakan dasar amal. Kita memuji Allah dan memintaNya supaya menyempurnakan kenikmatanNya. Oleh karenanya, Dia berfirman mengenai janjiNya yang jujur yang bertepatan dengan realita, “sesungguhnya Allah pasti menolong orang yang menolong (agama) Nya,” yaitu orang yang melakukan pembelaan terhadap agamaNya dengan ikhlas kepadaNya dalam pelaksanannya, berjuang di jalanNya agar kalimatullah-lah yang paling tinggi. “Sesungguhnya Allah benar-benar Mahakuat lagi Mahaperkasa,” maksudnya sempurna kekuatanNya, Mahaperkasa, tidak bisa tertahan. Dia telah menundukan seluruh makhluk dan memegang ubun-ubun mereka. Maka, bergembiralah kalian, wahai kaum MUslimin. Kendatipun jumlah dan kekuatan kalian lemah, sementara musuh kuat, maka sesungguhnya tumpuan kalian yang kuat lagi perkasa dan tempat bergantung kalian adalah Dzat yang telah menciptakan kalian dan menciptakan apa yang telah kalian kerjakan. Maka, tempuhlah langkah-langkah yang diperintahkan untuk dilakukannya. Kemudian, mintalah kemenagan dariNya. Sudah mesti, Dia akan menolong kalian, \"Hai orang-orang yang beriman, jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu.\" (Muhammad:7). Wahai kaum Mslimin, kerjakanlah konsekuensi iman dan amal shalih, sungguh \"Dan Allah telah berjanji kepada orang-orang yang beriman di antara kamu dan mengerjakan amal-amal yang saleh bahwa Dia sungguh-sungguh akan menjadikan mereka berkuasa di bumi, sebagaimana Dia telah menjadikan orang-orang yang sebelum mereka berkuasa, dan sungguh Dia akan meneguhkan bagi mereka agama yang telah diridai-Nya untuk mereka, dan Dia benar-benar akan menukar (keadaan) mereka, sesudah mereka berada dalam ketakutan menjadi aman sentosa. Mereka tetap menyembah-Ku dengan tiada mempersekutukan sesuatu apa pun dengan Aku.\" (An-Nur:55)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 40: Mereka terpaksa keluar dari kampung halamannya karena disakiti dan diberikan cobaan (fitnah). Ucapan ini adalah hak. Oleh karena itu, mengusirnya adalah mengusir tanpa hak. Syaikh As Sa’diy berkata, “Ayat ini menunjukkan hikmah disyariatkan jihad, dan bahwa maksud daripadanya adalah menegakkan agama Allah, menolak gangguan dan kezaliman kaum kafir terhadap kaum mukmin yang memulai terlebih dulu menzalimi, agar dapat beribadah kepada Allah serta menegakkan syariat Islam yang nampak.” Dengan orang-orang yang berjihad di jalan Allah, Dia menghindarkan bahaya orang-orang kafir. Seperti dengan melakukan shalat, membaca kitab Allah, dan berdzikr. Bahkan ibadah bisa menjadi terhenti karena robohnya tempat ibadah tersebut dan orang-orang kafir menguasai kaum muslimin. Hal ini menunjukkan bahwa negeri-negeri yang tercapai di sana ketenteraman beribadah kepada Allah, masjid-masjidnya makmur, ditegakkan syi’ar-syi’ar Islam di sana merupakan sebab perjuangan para mujahid fii sabilillah. Syaikh As Sa’diy berkata, “Jika anda bertanya, “Kita melihat sekarang masjid-masjid kaum muslimin ramai tidak roboh, padahal sebagian besarnya di bawah pemerintahan kecil dan pemerintahan yang tidak teratur, sedang mereka tidak memiliki kekuatan untuk memerangi negara-negara sebelahnya yang berada di Benua Eropa. Bahkan kita menyaksikan masjid-masjid yang berada di bawah kekuasaan mereka ramai, penduduknya aman dan tenteram padahal para penguasa mereka yang kafir sanggup merobohkannya, namun Allah memberitahukan bahwa kalau seandainya Allah tidak menolak (keganasan) sebagian manusia dengan sebagian yang lain tentu rumah-rumah ibadah itu hancur, dan kami tidak menyaksikan adanya penolakan tersebut?” Jawab: Pertanyaan dan kemusykilan ini masuk ke dalam keumuman ayat ini dan salah satu bagiannya. Karena barang siapa mengetahui keadaan negara-negara sekarang dan sistem pemerintahannya, di mana mereka memperhatikan semua umat dan semua bangsa yang berada di bawah kekuasaannya dan masuk ke dalam pemerintahannya, ia menganggapnya sebagai bagian dari anggota kerajaannya dan pemerintahannya, baik umat itu memiliki kemampuan karena jumlahnya atau karena perlengkapannya atau karena hartanya, atau karena pekerjaannya maupun pelayanannya, maka semua pemerintahan itu memperhatikan maslahat orang-orang asing tersebut baik agama maupun dunia, mereka khawatir jika tidak melakukan yang demikian tatanan pemerintahannya menjadi rusak dan kehilangan sebagian tiangnya, sehingga sebagian ajaran agama tegak karena sebab itu, khususnya masjid-masjid, di mana ia –wal hamdulillah- benar-benar tertata rapi, bahkan di ibukota negara-negara besar. Negara-negara yang merdeka itu pun memperhatikan kebutuhan rakyat mereka yang muslim meskipun terdapat kedengkian dan kebencian dari negara-negara Nasrani; yang Allah beritahukan bahwa hal itu akan senantiasa ada sampai hari kiamat. Dengan demikian, tetaplah pemerintahan Islam yang tidak sanggup dan tidak bisa membela dirinya selamat dari banyak bahaya mereka yang timbul karena adanya rasa hasad pada mereka, namun tidak ada seorang pun di antara mereka yang sanggup menguasainya karena takut terhadap perlindungan dari yang lain, padahal sesungguhnya Allah Subhaanahu wa Ta'aala tetap akan memperlihatkan kemenangan Islam dan kaum muslimin kepada hamba-hamba-Nya sebagaimana yang dijanjikan-Nya dalam kitab-Nya. Dan Al hamdulillah, telah nampak sebab-sebab kemenangan itu dengan adanya kesadaran kaum muslimin tentang perlunya kembali kepada agama mereka, di mana kesadaran merupakan awal mula kebangkitan. Oleh karena itu, Kita memuji Allah dan meminta kepada-Nya agar Dia menyempurnakan nikmat-Nya. Oleh karena itu Dia berfirman dalam janji-Nya yang benar dan sesuai kenyataan, “Allah pasti akan menolong orang yang menolong (agama)-Nya.” Yakni orang yang menegakkan agama-Nya, ikhlas dalam menegakkannya, berperang di jalan-Nya agar kalimatullah menjadi tinggi.” Allah Mahakuat lagi Mahaperkasa, semua makhluk tunduk di hadapan-Nya dan Dia berkuasa terhadap mereka. Maka bergembiralah kamu wahai kaum muslimin, karena meskipun jumlah atau perlengkapan kamu sedikit, sedangkan jumlah dan perlengkapan musuh banyak, maka sandaran kamu adalah Yang Mahakuat lagi Mahaperkasa. Oleh karena itu, kerjakanlah semua sebab yang diperintahkan, kemudian mintalah pertolongan kepada-Nya, niscaya Dia akan menolong kamu. Allah Subhaanahu wa Ta'aala berfirman, “Wahai orang-orang mukmin! Jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu.” (Terj. Muhammad: 7) Oleh karena itu, penuhilah hak iman dan amal saleh, karena sesungguhnya Dia telah menjanjikan kepada orang-orang yang beriman dan mengerjakan amal saleh, bahwa Dia sungguh-sungguh akan menjadikan mereka berkuasa di muka bumi, sebagaimana Dia telah menjadikan orang-orang sebelum mereka berkuasa, dan sungguh, Dia akan meneguhkan bagi mereka agama yang telah diridhai-Nya untuk mereka, dan Dia benar-benar akan menukar (keadaan) mereka, setelah mereka dalam ketakutan menjadi aman sentosa. Mereka tetap menyembah-Nya dengan tidak mempersekutukan sesuatu apa pun dengan-Nya. (lihat An Nuur: 55)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 40",
    "description": "Orang-orang beriman yang diizinkan untuk berperang itu adalah orang-orang yang diusir dari kampung halamannya di mekah tanpa alasan yang benar, baik menurut akal sehat maupun nurani. Alasan satu-satunya dari tindakan tersebut adalah hanya karena mereka berkata, 'tuhan kami ialah Allah, ' lalu istikamah dalam keyakinannya. Seandainya Allah tidak menolak keganasan sebagian manusia kepada sebagian yang lain yang menumpahkan darah dan saling menghancurkan, dengan diizinkan berperang kepada orang-orang beriman guna membela diri dan menyadarkan penyerang untuk menghentikan serangannya dan bersedia hidup berdampingan dengan toleran, tentu telah dirobohkan biara-biara nasrani, gereja-gereja, rumah-rumah ibadah orang yahudi dan masjid-masjid yang di dalamnya banyak disebut nama Allah akibat keganasan perang. Allah pasti akan menolong orang yang menolong agama-Nya dengan mencegah perang dan memperjuangkan perdamaian. Sungguh, Allah mahakuat, mahaperkasa atas segala sesuatu. 41. Para sahabat nabi yang diusir dari kampung halamannya hanya karena mereka meyakini tidak ada tuhan selain Allah itu adalah orang-orang yang jika kami beri kedudukan kepada mereka di bumi dengan menjadi umara, mereka akan menggunakan kekuasaannya untuk mengajak umat melaksanakan salat berjamaah, di masjid, awal waktu; menunaikan zakat, infak, dan sedekah dengan manajemen yang baik untuk kesejahteraan umat, dan menyuruh berbuat yang makruf kepada seluruh lapisan masyarakat dan mencegah dari yang mungkar dari siapa saja yang mengindikasikan melanggar hukum dan menyimpang dari aturan yang berlaku; dan kepada Allah-lah kembali segala urusan dengan seadil-adilnya mengenai nasib manusia di akhirat."
  }
]