[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang Kami janjikan dengan pertolongan dari Kami ialah orang-orang yang bila Kami teguhkan kedudukan mereka di muka bumi dan kami jadikan mereka penguasa di sana, dengan memenangkan mereka atas musuh-musuh mereka,mereka mendirikan shalat dengan menjalankannya pada waktu-waktunya dengan memperhatikan batasan –batasannya, mengeluarkan zakat harta mereka kepada orang-orang yang berhak menerimanya, memerintahkan setiap perkara yang diperintahkan Allah, terkait hak-hakNya dan hak hamba-hambaNya, dan melarang dari setiap perkara yang dilarang oleh Allah dan RasulNya. Dan kepada Allah semata tempat kembali semua perkara itu, dan kesudahan yang baik bagi orang-orang yang bertakwa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Orang-orang yang dijanjikan kemenangan itu adalah orang-orang yang apabila Kami beri kejayaan di muka bumi dengan mendapatkan kemenangan atas musuh-musuhnya, mereka senantiasa mendirikan salat secara sempurna, menunaikan zakat harta mereka, memerintahkan apa yang diperintahkan syariat, dan melarang dari apa yang dilarangnya. Dan hanya kepada Allah lah kembalinya segala urusan baik berupa pahala ataupun azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Orang-orang yang Kami janjikan pertolongan bagi mereka, jika Kami memberi mereka kekuasaan di muka bumi maka mereka akan menyembah Allah, senantiasa mendirikan shalat dan menunaikan zakat, dan menyeru kepada kebaikan dan melarang keburukan. Dan kepada Allah tempat kembali segala urusan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. الَّذِينَ إِن مَّكَّنّٰهُمْ فِى الْأَرْضِ ((yaitu) orang-orang yang jika Kami teguhkan kedudukan mereka di muka bumi) Yakni mereka adalah orang yang akan ditolong Allah karena mereka telah menolong agama-Nya. Dan yang dimaksud bukanlah mereka yang menjajah negeri orang lain untuk mengeksploitasi sumber daya alamnya. Dalam ayat ini terdapat perintah untuk menjalankan amar ma’ruf nahi mungkar bagi orang yang diberi kedudukan di bumi dan diberi kekuasaan untuk menjalankan hal ini. وَلِلّٰهِ عٰقِبَةُ الْأُمُورِ(dan kepada Allah-lah kembali segala urusan) Yakni segala urusan kembali pada keputusan dan aturan Allah semata."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "40-41 Berhukum kepada selain hukum Allah adalah diantara sebab perubahan buruk pada suatu negara, dan ini terbukti dari zaman ke zaman, dan barangsiapa yang Allah inginkan baginya kebahagiaan Allah akan menjadikannya belajar dari kebahagiaan yang dirasakan orang lain, sehingga ia pun mengikuti jalan orang-orang yang dikuatkan oleh Allah, dan menjauhi jalan orang-orang yang Allah hinakan baginya, sesungguhnya Allah berfirman: { وَلَيَنصُرَنَّ ٱللَّهُ مَن يَنصُرُهُۥٓ ۗ إِنَّ ٱللَّهَ لَقَوِىٌّ عَزِيزٌ - ٱلَّذِينَ إِن مَّكَّنَّٰهُمْ فِى ٱلْأَرْضِ أَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ وَأَمَرُوا۟ بِٱلْمَعْرُوفِ وَنَهَوْا۟ عَنِ ٱلْمُنكَرِ ۗ وَلِلَّهِ عَٰقِبَةُ ٱلْأُمُورِ } \"Sesungguhnya Allah pasti menolong orang yang menolong (agama)-Nya. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa - (yaitu) orang-orang yang jika Kami teguhkan kedudukan mereka di muka bumi niscaya mereka mendirikan sembahyang, menunaikan zakat, menyuruh berbuat ma'ruf dan mencegah dari perbuatan yang mungkar; dan kepada Allah-lah kembali segala urusan\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Yaitu orang-orang yang jika Kami teguhkan kedudukan mereka di muka bumi dengan pertolongan dari musuh mereka, niscaya mereka mendirikan sholat pada waktunya, menunaikan zakat kepada yang berhak, menyuruh berbuat ma´ruf sesuai syariat baik perkataan maupun perbuatan, dan mencegah dari perbuatan yang mungkar; dan kepada hukum Allah-lah tempat kembalinya segala urusan di dunia, begitu juga di akhirat tentang pahala dan siksa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang jika Kami tempatkan di bumi, mereka menegakkan shalat, menunaikan zakat, menyuruh berbuat baik, dan mencegah dari yang mungkar. Hanya kepada Allah kesudahan segala urusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Kemudian, Allah menyebutkan tanda orang yang menolongNya. Dengan itu, bisa diketahui bahwa orang yang mengklaim diri menolong Allah dan menolong agamNya, akan tetapi tidakmemenuhi kriteria sifat ini, maka ia dusta. Allah berfirman, “(Yaitu) orang-orang yang jika Kami teguhkan kedudukan mereka di muka bumi ini,” maksudnya Kami menjadikan mereka memilikinya dan menguasainyatanpa ada pihak penentang yang menentang ataupun menghadang, “niscaya mereka menegakkan shalat,” pada waktu-waktunya, ketentuan-ketetuannya, rukun-rukunnya dan syarat-syaratnya, baik dalam shalat Jum’at maupun jamaah, “dan menunaikan zakat,” yang menjadi kewajiban mereka secara khusus dan kewajiban atas orang-orang yang berada di bawah tanggungannya secara umum. Mereka menyerahkannya kepada para penerimanya yang (benar-benar) mereka adalah pihak yang berhak. “Dan menyuyruh berbuat yang ma’ruf.” Ini mencakup segala kebajikan yang sudah dikenal dalam kaca mata syariat dan akal sehat, berupa hak-hak Allah dan hak-hak sesame manusia. “Dan mencegah dari perbuatan yang mungkar.” Setiap kemungkaran menurut syariat dan akal sehat, keburukannya sudah diketahui bersama. “Perintah terhadap sesuatu dan larangan darinya” meliputi pula (perintah dan larangan) segala yang tidak terpenuhi kecuali dengannya. Apabila (aplikasi) kebaikan dan kemungkaran tergantung pada proses belajar dan mengajar. Jika (pelaksanaan amar ma’ruf dan nahi mungkar) terikat dengan sanksi terukur dan tidak terukur secara syariat, seperti berbagai macam ta’zir (sanksi), maka mereka mesti mengerjakannya. Jika amar ma’ruf dan nahi munkar itu tergantung pada penetapan sejumlah orang untuk menanganinya, maka hal itu mesti dilakukan, dan lain sebagainya, yang termmasuk perkara-perkara pelaksanaan amar ma’ruf dan nahi mungkar tidak terlaksana kecuali dengannya. “Dan kepada Allah-lah segala urusan kembali,” maksudnya segala urusan kembali kepada Allah. Sungguh, Allah telah mengabarkan bahwa kesudahan yang baik adalah bagi (orang-orang yang bertakwa). Barangsiapa yang telah Allah tetapkan sebagai penguasa umat manusia, dari kalangan para raja kemudian dia menjalankan perintah Allah, maka baginya penutupan yang baik dan kondisi yang lurus. Dan siapa saja yang berkuasa atas mereka dengan tangan besi dan menjalankan ungkapan hawa nafsunya di tengah mereka, sungguh babak akhirnya tidak baik, kepemimpinannya menghasilkan kesialan, dan akhirnya tercela."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 41: Di ayat ini Allah Subhaanahu wa Ta'aala menyebutkan tanda orang yang menolong agama-Nya, dan dari sini dapat diketahui siapa yang menolong agama-Nya itu, dan barang siapa yang mengaku menolong agama Allah, namun pada kenyataannya, ia tidak memiliki sifat yang akan disebutkan, maka sesungguhnya pengakuannya dusta. Dengan dimenangkan terhadap musuh mereka atau berkuasa atas mereka. Pada waktunya dan dengan berjamaah. Yakni semua ketaatan, baik yang terkait dengan hak Allah maupun yang terkait dengan hak manusia. Jika perkara yang ma’ruf dan yang munkar kurang diketahui karena keadaan yang telah berubah, maka mereka mendorong rakyatnya belajar dan bagi yang berilmu untuk mengajarkan kepada yang tidak mengetahui. Demikian pula mereka siapkan segala sesuatu yang dapat menyempurnakan amar ma’ruf dan nahi munkar, seperti diadakan dewan hisbah (kepolisian yang ditugaskan melakukan amar ma’ruf dan nahi munkar). Semua urusan kembali kepada Allah, dan Dia telah memberitahukan bahwa akibat yang baik akan diperoleh oleh orang-orang yang bertakwa. Oleh karena itu, barang siapa yang diberikan kekuasaan oleh Allah, lalu ia menjalankan perintah Allah, maka ia akan memperoleh akibat yang baik. Sebaliknya, barang siapa yang diberikan kekuasaan oleh Allah, namun ia mengedepankan hawa nafsunya, maka meskipun ia memperoleh kekuasaan dalam waktu tertentu, namun akibatnya tidak baik dan kepemimpinannya tercela."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 41",
    "description": "Para sahabat nabi yang diusir dari kampung halamannya hanya karena mereka meyakini tidak ada tuhan selain Allah itu adalah orang-orang yang jika kami beri kedudukan kepada mereka di bumi dengan menjadi umara, mereka akan menggunakan kekuasaannya untuk mengajak umat melaksanakan salat berjamaah, di masjid, awal waktu; menunaikan zakat, infak, dan sedekah dengan manajemen yang baik untuk kesejahteraan umat, dan menyuruh berbuat yang makruf kepada seluruh lapisan masyarakat dan mencegah dari yang mungkar dari siapa saja yang mengindikasikan melanggar hukum dan menyimpang dari aturan yang berlaku; dan kepada Allah-lah kembali segala urusan dengan seadil-adilnya mengenai nasib manusia di akhirat. 42-43. Dan jika mereka, orang-orang musyrik yang kaya dan berkuasa di mekah, mendustakan ajaran engkau, Muhammad, yang bersumber dari wahyu Allah, maka sungguh begitulah sikap kaum sebelum mereka, mendustakan ajaran yang dibawa oleh para nabi mereka seperti kaum nuh, 'ad, dan samud, dan demikian juga sifat dan karakter kaum ibrahim dan kaum lut yang secara terbuka menantang dan mendustakan ajaran para nabi yang diutus kepada mereka."
  }
]