[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-44. Dan apabila kaummu mendustakan kamu (wahai Rasul) maka sungguh kaum NUh telah mendahului mereka dalam urusan mendustakan para rasul mereka, begitu juga kaum Ad, kaum Tsamud, kaum Ibrahim, kaum Luth, penduduk (Madyan) yang mendustakan Syu’aib, dan Fir’aun dan pengikutnya mendustakan Musa. Namun, Aku tidak menyegerakan siksaan pada mereka, akan tetapi Aku menangguhkan waktu bagi mereka, kemudian Aku siksa masing-masing dari mereka dengan siksaan. Maka (perhatikanlah) bagaimanakah pengingkaranKu terhadap mereka atas kekafiran dan pendustaan mereka dan perubahan kenikmatan yang ada pada mereka dengan siksaan dan kebinasaan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Dan penduduk Madyan telah mendustakan Syu'aib. Dan Fir'aun beserta kaumnya telah mendustakan Musa. Namun Aku tunda penurunan azab kepada kaum-kaum tersebut sebagai bentuk istidrāj atas mereka, kemudian Aku mengazab mereka. Maka perhatikanlah, betapa besarnya pengingkaran-Ku terhadap kedustaan mereka, hingga Aku pun membinasakan mereka lantaran kekufuran mereka itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. فَأَمْلَيْتُ لِلْكٰفِرِينَ (lalu Aku tangguhkan (azab-Ku) untuk orang-orang kafir) Aku mengakhirkan dan menunda siksaan bagi orang-orang kafir. ثُمَّ أَخَذْتُهُمْ ۖ( kemudian Aku azab mereka) Setelah habis waktu penangguhan bagi mereka. فَكَيْفَ كَانَ نَكِيرِ(maka (lihatlah) bagaimana besarnya kebencian-Ku (kepada mereka)) Yakni lihatlah bagaimana kemurkaan-Ku atas mereka, dan bagaimana kenikmatan-kenikmatan mereka yang telah berubah, serta kebinasaan mereka akibat kekafiran mereka dan keburukan amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Penduduk Madyan juga mendustakan nabi mereka nabi Syu’aib. Nabi Musa telah didustakan kaum Fir’aun. lalu Aku tangguhkan azab-Ku untuk orang-orang kafir, kemudian Aku azab mereka. Maka lihatlah bagaimana besarnya kebencian-Ku kepada mereka itu dan nikmat-Ku akan Ku rubah dengan azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan penduduk Madyan. Musa juga telah didustakan} Fir’aun dan kaumnya telah mendustakan Musa {Lalu Aku memberi tenggang waktu kepada orang-orang kafir} lalu AKu menangguhkan orang-orang kafir, dan menangguhkan hukuman mereka {kemudian Aku menyiksa mereka} menghukum mereka {Maka bagaimana besarnya kemurkaanKu} kemurkaanKu dan hukumanKu terhadap mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42-44. Allah berfirman kepada NabiNya, Muhammad, “Kendatipun kaum musyrikin mendustakan dirimu, tapi engkau bukanlah rasul yang pertama kali didustakan. Dan mereka pun bukan umat manusia yang pertama kali didustakan. Dan mereka pun bukan umat manusia yang pertama kalian mendustakan rasul mereka.” “Sesungguhnya telah mendustakan juga sebelum mereka kaum Nuh, ‘Ad dan Tsamud dan kaum Ibrahim dan kaum Luth dan penduduk Madyan,” yaitu kaum Nabi Syua’ib. “Dan telah didustakan Musa, lalu Aku tangguhkan (azabKu) untuk orang-orang kafir,” yaitu orang-orang yang mendustakan. Aku tidak menyegerakan siksaan bagi mereka. Justru Aku memberikan masa penangguhan lagi sehingga mereka menjalankan tindak melampaui batas mereka dalam keadaan pandangan yang tertutup, dan semakin bertambah kekufuran dan keburukan mereka. “Kemudian Aku azab mereka,” dengan siksaan oleh Dzat Yang Mahaperkasa lagi Mahakuasa. “Maka (lihatlah) bagaimana besarnya kebencianKu (kepada mereka itu),” maksudnya pengingkaranKu terhadap kekufuran dan pendustaan mereka. Bagaimanakah keadaannya? Bentuknya adalah hukuman yang sangat berat dan siksaan yang sangat mengerikan. Di antara mereka ada yang ditenggelamkan. Ada yang disambar oleh petir. Sebagian lain dibinasakan oleh angina kencang. Ada yang diratakan dengan bumi. Dan di antara mereka ada yang dikirimi siksaan hari yang dinaungi oleh gumpalan mendung. Hendaknya kaum yang mendustakan memetik pelajaran (dari kejadian-kejadian yang menimpa mereka ini), agar (tidak) ditimpa oleh siksaan yang melanda mereka. Sesungguhnya mereka tidak lebih baik daripada orang-orang sebelumnya. Dan tidak tertuliskan surat bebas (siksaan bagi mereka) di dalam kitab-kitab yang diturunkan dari Allah. Berapa banyak orang-orang yang ditimpa siksaan lagi binasa semisal mereka!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 44: Oleh orang-orang Qibthi (Mesir). Sehingga mereka semakin melampaui batas, dan semakin bertambah kekafiran dan keburukannya. Dapat pula diartikan, “Maka betapa hebatnya pengingkaran-Ku terhadap kekafiran dan pendustaan mereka dengan membinasakan mereka.” Di antara mereka ada yang ditimpa hujan batu kerikil, ada yang ditimpa suara keras yang mengguntur, ada yang dibenamkan ke dalam bumi, dan di antara mereka ada yang ditenggelamkan. Allah sekali-kali tidaklah menzalimi mereka, akan tetapi merekalah yang menzalimi diri mereka sendiri. Oleh karena itu, mereka yang mendustakan Rasulullah shallallahu 'alaihi wa sallam hendaknya mengambil pelajaran dari azab yang menimpa generasi sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 44",
    "description": "Dan demikian pula penduduk madyan telah menustakan ajaran nabi syu'aib. Dan juga ajaran nabi musa, juga telah didustakan oleh firaun dan bani israil, maka aku telah memberikan tenggang waktu kepada orang-orang kafir dengan memanjangkan umur mereka di dunia, kemudian aku menyiksa mereka di akhirat dengan merasakan azab-ku di dalam neraka, maka betapa hebatnya siksaan-ku yang dirasakan oleh mereka yang menolak ajaran-ku yang dibawa oleh para rasul. 45. Allah menurunkan adzabnya kepada umat-umat terdahulu yang telah mendustakan dan mengingkari ajaran para rasul-Nya yang diutus kepada mereka. \"maka, betapa banyak negeri yang telah kami binasakan, karena penduduknya dalam keadaan zalim terhadap diri mereka sendiri dengan tidak beriman dan bertindak sewenang-wenang terhadap para rasul, menghina, mendustakan, dan membunuh mereka, lalu kami mengazab mereka sehingga runtuhlah bangunan-bangunannya; dan betapa banyak pula sumur yang telah ditinggalkan, karena penduduk negeri itu telah binasa; dan istana yang tinggi, mewah dan indah telah menjadi rumah tua yang tidak ada penghuninya, \" demikian Allah menjelaskan."
  }
]