[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Banyak dari negeri-negeri yang (penduduknya) berbuat kezhaliman dengan kekafiran, Kami hancurkan penduduknya, sehingga pemukiman-pemukiman mereka runtuh, kosong dari penghuni-penghuninya, sumur-sumur mereka tidak dapat dimanfaatkan untuk minum, istana-istana yang menjulang tinggi lagi penuh hiasan tidak dapat menolak siksaan buruk dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Betapa banyak negeri yang telah Kami binasakan dengan azab yang menyeluruh karena penduduknya berbuat zalim dengan melakukan kekafiran, sehingga tempat tinggal mereka runtuh bangunan-bangunannya, dan serasa kosong tanpa ada lagi penghuninya, dan betapa banyak pula sumur yang tidak ada lagi orang yang mengambil airnya lantaran mereka telah binasa, dan betapa banyak istana yang megah lagi penuh hiasan yang tidak bisa melindungi penghuninya dari datangnya azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Para penduduk banyak negeri menengtang Tuhan mereka, sehingga mereka tertimpa azab Kami, Kami menghancurkannya akibat kekafiran penduduknya dan karena mereka mendustakan para rasul mereka, negeri-negeri itu hancur dan tidak berpenghuni, sehingga sungai-sungainya tidak terpakai; istana-istananya yang megah tidak lagi ada yang memanfaatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَكَأَيِّن مِّن قَرْيَةٍ أَهْلَكْنٰهَا وَهِىَ ظَالِمَةٌ (Berapalah banyaknya kota yang Kami telah membinasakannya, yang penduduknya dalam keadaan zalim) Yakni banyak sekali negeri yang Kami binasakan akibat kezaliman penduduknya. فَهِىَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا(maka (tembok-tembok) kota itu roboh menutupi atap-atapnya) Ini disebabkan azab yang menimpanya sehingga rumah-rumah di begeri itu runtuh dan tembok-temboknya roboh di atas atap-atapnya. وَبِئْرٍ مُّعَطَّلَةٍ(dan (berapa banyak pula) sumur yang telah ditinggalkan) Yakni ditinggalkan pemiliknya setelah mereka binasa. Pendapat lain mengatakan maknanya adalah timba dan talinya tidak terpakai lagi. وَقَصْرٍ مَّشِيدٍ (dan istana yang tinggi) Yakni bangunan yang tinggi. Pendapat lain mengatakan makna (المشيد) adalah bangunan yang diplaster. Makna ayat ini adalah berapa banyak bangunan tinggi yang ditinggal oleh pemiliknya, atau dikosongkan dari perabotnya, dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Berapa banyak kota (banyak sekali) yang telah Kami binasakan, yang penduduknya telah zalim terhadap diri mereka sendiri dengan kekufuran dan kedustaan. Maka tembok-tembok kota itu roboh menutupi atap-atapnya dan berapa banyak pula sumur yang telah ditinggalkan dan tidak dimanfaatkan juga istana-istana yang tinggi yang tidak terpakai ditinggalkan penghuninya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Betapa banyak negeri} banyak negeri {yang telah Kami binasakan karena dalam keadaan zalim sehingga bangunan-bangunannya runtuh} runtuh bangunan-bangunan di sekitarnya di atas atap-atapnya {dan sumur yang ditelantarkan} banyak sumur-sumur yang ditelantarkan, tidak ada yang mengambil minum darinya karena kehancuran penduduknya {serta istana tinggi} banyak istana-istana yang menjulang tinggi bangunannya terlantar, tidak ada satu pun orang di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Untuk itu, Allah berfirman, “Berapa banyaknya kota,” maksudnya alangkah banyak kota “yang telah Kami binasakan,” dengan siksaan yang keras dan kehinaan di dunia, “yang penduduknya dalam keadaan zhalim,” lantaran kekufuran mereka terhadap Allah dan pendustaan mereka kepada para RasulNya. Hukuman yang Kami timpakan bukan bentuk kezhaliman Kami kepada mereka. “Maka (tempat tinggal mereka berhancuran, istana dan dinding-dindingnya telah roboh dengan atapnya, sehingga berubah luluh-lantak padahal sebelumnya terpelihara, dan terlihat kuat, setelah sebelumnya layak dihuni dan nyaman bagi penghuninya. “dan (berapa banyak pula) sumur yang dahulu orang-orang berdesakan di sana untuk mengambil air mimun bagi mereka dan hewan-hewan ternak mereka. Orang-orang itu lenyap. Tiada lagi sesosok orang pun yang datang dan muncul di situ. Alangkah banyak istana, yang pemiliknya telah susah payah membangun dan meninggikannya, menguatkan dan menghiasinya, lalu ketika ketetapan (siksaan) Allah menghampiri mereka, maka itu semua tidak bermanfaat sama sekali bagi mereka. Tempat ini menjadi kosong dari penghuninya. Mereka telah menjadi sumber pelajaran bagi orang-orang yang mau mengambil pelajaran dan permisalan bagi orang-orang yang mau berpikir dan merenung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 45: Dengan azab yang pedih dan kehinaan duniawi. Dengan berbuat kafir kepada Allah dan mendustakan Rasul-Nya, dan hukuman Allah bukanlah karena kezaliman-Nya, akan tetapi karena keadilan-Nya. Sumur yang sebelumnya ramai didatangi manusia menjadi sepi ditinggalkan, dan istana yang sebelumnya ditinggikan dan diperkuat serta diberi hiasan menjadi sepi tidak berpenghuni, semuanya menjadi pelajaran bagi generasi yang datang setelahnya jika mereka mau mengambil pelajaran. Karena penduduknya telah mati dibinasakan. Daerahnya yang sebelumnya makmur menjadi sepi, dan yang sebelumnya disenangi menjadi dijauhi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 45",
    "description": "Allah menurunkan adzabnya kepada umat-umat terdahulu yang telah mendustakan dan mengingkari ajaran para rasul-Nya yang diutus kepada mereka. \"maka, betapa banyak negeri yang telah kami binasakan, karena penduduknya dalam keadaan zalim terhadap diri mereka sendiri dengan tidak beriman dan bertindak sewenang-wenang terhadap para rasul, menghina, mendustakan, dan membunuh mereka, lalu kami mengazab mereka sehingga runtuhlah bangunan-bangunannya; dan betapa banyak pula sumur yang telah ditinggalkan, karena penduduk negeri itu telah binasa; dan istana yang tinggi, mewah dan indah telah menjadi rumah tua yang tidak ada penghuninya, \" demikian Allah menjelaskan. 46. Allah lalu bertanya kepada orang-orang yang menolak ajaran Allah yang dibawa rasulullah, \"maka apakah mereka tidak pernah berjalan di bumi menyaksikan peninggalan umat terdahulu atau mengkajinya secara mendalam sehingga kalbu, kecerdasan emosi, dan spiritual mereka dapat memahami atau merenungkan ajaran Al-Qur'an atau telinga mereka dapat mendengar ajakan rasul untuk beriman kepada Allah'\" mata, telinga, dan pikiran mereka tertutup. Oleh sebab itu, sejatinya bukan mata lahiriah mereka itu yang buta sehingga tidak dapat melihat bukti-bukti kebenaran ajaran rasulullah, tetapi yang buta adalah mata hati mereka yang ada di dalam dada mereka."
  }
]