[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah orang-orang yang mendustakan dari suku Quraisy itu berjalan di muka bumi untuk menyaksikan bekas-bekas kehancuran orang-orang yang di binasakan, sehingga mereka mau berpikir dengan akal-akal mereka, dan kemudian mengambil pelajaran darinya dan mendengarkan berita-berita mereka dengan penuh perenungan, sehingga dapat memetik pelajaran darinya? Karena sesungguhnya hakikat kebutaan bukanlah kebutaan penglihatan, akan tetapi kebutaan yang membinasakan adalah kebutaan mata hati untuk menangkap kebenaran dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Maka tidak pernahkah orang-orang yang mendustakan Rasul -ṣallallāhu 'alaihi wa sallam- itu berjalan di muka bumi agar mereka dapat menyaksikan jejak negeri-negeri yang telah dibinasakan, sehingga mereka bisa berpikir menggunakan akal sehat agar mengambil pelajaran darinya, dan mendengar kisah-kisah mereka dengan seksama supaya mengambil peringatan darinya, karena sesungguhnya kebutaan yang hakiki bukanlah buta mata, namun kebutaan hakiki yang membinasakan dan menghinakan adalah kebutaan baṣīrah (ilmu dan iman); di mana orang yang memiliki kebutaan seperti ini tidak akan mungkin mendapatkan pelajaran dan peringatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Tidakkah orang-orang kafir pergi bersafar dan menyaksikan tempat-tempat orang yang dibinasakan, sehingga mereka dapat mengambil ibrah dari kehancuran yang mereka rasakan, dan tidakkah mereka mendengar azab bagi orang-orang kafir? Kebutaan itu bukanlah kebutaan mata, namun kebutaan yang membinasakan adalah kebutaan hati sehingga tidak dapat menemukan kebenaran dan ibrah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. أَفَلَمْ يَسِيرُوا۟ فِى الْأَرْضِ (maka apakah mereka tidak berjalan di muka bumi) Allah mendorong manusia agar melakukan perjalanan ke penjuru dunia untuk melihat tempat umat-umat tersebut dibinasakan agar mereka dapat mengambil pelajaran. فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِهَآ(lalu mereka mempunyai hati yang dengan itu mereka dapat memahami) Maknanya adalah karena mereka telah menyaksikan pelajaran itu hendaknya mereka memiliki hati yang mampu memahami apa yang harus dipahami. أَوْ ءَاذَانٌ يَسْمَعُونَ بِهَا ۖ( atau mempunyai telinga yang dengan itu mereka dapat mendengar) Yakni kalamullah yang dibacakan Muhammad kepada mereka yang harus mereka dengar. فَإِنَّهَا لَا تَعْمَى الْأَبْصٰرُ وَلٰكِن تَعْمَى الْقُلُوبُ الَّتِى فِى الصُّدُورِ(Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada) Yakni tidak ada masalah dengan panca indra mereka, namun masalahnya adalah hati dan akal mereka. Yakni akal mereka tidak dapat memahami kebenaran dan pelajaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). DIantara cara untuk mengambil pelajaran dari suatu zaman adalah dengan mempelajari sejarah secara umum, dan mengikuti langkah-langkah sejarah ayat-ayat Allah tentang segala penjuru, dan mentadabburi keadaan ummat-ummat yang pernah ada. 2 ). { فَإِنَّهَا لَا تَعْمَى ٱلْأَبْصَٰرُ وَلَٰكِن تَعْمَى ٱلْقُلُوبُ ٱلَّتِى فِى ٱلصُّدُورِ } \"Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada.\" Qatadah berkata: Penglihatan yang nampak adalah: penglihatan pada kecukupan dan kenikmatan, dan penglihatan hati adalah: penglihatan yang bermanfaat bagi agama dan dirimu. 3 ). \"Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada.\" pada ayat ini Allah mengabarkan bahwa indera perasa itu mengikuti kerja akal, dan bahwasanya orang berakal yang dikalahkan oleh nafsunya sesungguhnya ia tidak mendapat manfaat apa-apa dari indera nya. 4 ). Memiliki mata tidak menjamin anda dapat melihat! { فَإِنَّهَا لَا تَعْمَى ٱلْأَبْصَٰرُ وَلَٰكِن تَعْمَى ٱلْقُلُوبُ ٱلَّتِى فِى ٱلصُّدُورِ } yakni: butanya penglihatan hati itulah buta yang sesungguhnya, bukan bukan buta penglihatan, maka kebutaan hati mereka lebih berbahaya dari kebutaan mata; oleh karena itu pada penghujung ayat dikatakan { ٱلَّتِى فِى ٱلصُّدُورِ } \"yang di dalam dada.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Maka apakah mereka tidak berjalan di muka bumi, lalu mereka mempunyai hati yang dengan itu mereka dapat memahami atau mempunyai telinga yang dengan itu mereka dapat mendengar? Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada. Mereka sangat buruk dalam menggunakan akal, karena mereka menuruti hawa nafsu mereka. Dada disebutkan sebagai penekanan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidakkah mereka berjalan di bumi sehingga hati mereka dapat memahaminya atau telinga mereka dapat mendengarnya. Sesungguhnya bukanlah penglihatan yang buta, tetapi yang buta adalah hati yang berada dalam dada"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Oleh karena itu, Allah menyeru para hambaNYa untuk mengembara di bumi supaya mereka merenung dan mengambil pelajaran. Allah berfirman, “Maka apakah mereka tidak berjalan di muka bumi,” dengan fisik dan hati yang dengan itu mereka dapat memahami,” ayat-ayat Allah dan mencermati sumber-sumber pelajaran dengannya “atau mempunyai tellinga yang dengan itu mereka mendengar,” berita-berita umat yang telah berlalu dan kabar-kabar mengenai bangsa-bangsa yang dilanda siksaan. Kalau tidak ditujukan untuk maksud demikian, maka pandangan mata, pendengaran telinga dan gerakan tubuh yang nihil dari upaya perenungan dan pengambilan pelajaran tidak bermanfaat dan tidak mengantarkan kepada tujuan yang mesti dicapai. Karena alasan itu, Allah berfirman, “Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada,” maksudnya model kebutaan yang membahayakan dalam agama ini adalah kebutaan hati terhadap kebenaran. Akibatnya tidak mampu menyaksikannya sebagaimana orang buta tidak dapat melihat obyek-obyek pandangan. Sementara itu, kebutaan pandangan indra mata, maka puncak (pengaruh negatifnya) hanya mengganggu mata pencaharian dan kemanfaatan duniawi saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 46: Oleh karena itulah, Allah mengajak hamba-hamba-Nya mengadakan perjalanan di muka bumi untuk memperhatikan keadaan orang-orang terdahulu yang telah binasa dan mengambil pelajaran daripadanya. Dengan badan dan hati mereka. Ayat-ayat Allah dan memperhatikan tempat-tempat yang terdapat ibrah (pelajaran). Untuk mendengarkan berita kebinasaan dan kehancuran orang-orang yang mendustakan, sehingga mereka dapat mengambil pelajaran daripadanya. Akan tetapi, jika sebatas memandang dan mendengar atau berjalan-jalan tanpa bertafakkur dan mengambil pelajaran, maka yang demikian tidaklah bermanfaat dan tidak mencapai maksud yang diinginkan. Buta yang berbahaya adalah buta dalam agama, yaitu butanya hati dari melihat yang hak sehingga ia tidak melihat yang hak itu sebagaimana mata yang buta tidak dapat melihat sesuatu yang terlihat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 46",
    "description": "Allah lalu bertanya kepada orang-orang yang menolak ajaran Allah yang dibawa rasulullah, \"maka apakah mereka tidak pernah berjalan di bumi menyaksikan peninggalan umat terdahulu atau mengkajinya secara mendalam sehingga kalbu, kecerdasan emosi, dan spiritual mereka dapat memahami atau merenungkan ajaran Al-Qur'an atau telinga mereka dapat mendengar ajakan rasul untuk beriman kepada Allah'\" mata, telinga, dan pikiran mereka tertutup. Oleh sebab itu, sejatinya bukan mata lahiriah mereka itu yang buta sehingga tidak dapat melihat bukti-bukti kebenaran ajaran rasulullah, tetapi yang buta adalah mata hati mereka yang ada di dalam dada mereka. 47. Karena mata hati mereka buta dan telinga mereka tertutup, dan mereka dengan sombong dan menantang meminta kepadamu, Muhammad, agar azab yang dijanjikan kepada orang-orang kafir itu disegerakan di dunia ini. Mereka tidak mengetahui bahwa Allah tidak akan pernah menyalahi janji-Nya bahwa azab yang pedih bagi orang-orang kafir itu akan diberikan di akhirat. Dan sungguh, jika mereka menyadari bahwa sehari di sisi tuhanmu di akhirat seperti seribu tahun menurut perhitunganmu di dunia sehingga merasakan azab sehari saja di dalam neraka sebanding dengan seribu tahun di dunia. Betapa dah-syatnya azab Allah, mengapa mereka menantang'."
  }
]