[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang Kafir Quraisy meminta untuk menyegerakan siksaan kepadamu (wahai Rasul) yang kamu memperingatkan mereka dengannya, (karena kebodohan mereka yang parah), ketika mereka tetap bersikeras berada di atas kekafiran, dan Allah tidak akan menyalahi janji yang Dia janjikan kepada mereka berupa siksaan, hal itu pasti akan terjadi. Dan sungguh Allah telah menyegerakan siksaan pada mereka di dunia pada Perang Badar, dan sesungguhnya satu hari dari hari-hari Allah (yaitu Hari Kiamat) seperti seribu tahun dari tahun yang kalian hitung di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan orang-orang kafir dari kaummu meminta kepadamu -wahai Rasul- agar segera diturunkan azab kepada mereka di dunia ini, dan disegerakan pula azab di akhirat kelak, padahal Allah tidak akan menyalahi janji-Nya kepada mereka berupa azab itu. Diantara azab yang disegerakan pada mereka adalah kekalahan mereka dalam perang Badar. Dan sesungguhnya satu hari masa azab di Akhirat seperti seribu tahun menurut perhitungan kalender tahunan kalian di dunia ini, lantaran kerasnya azab yang ditimpanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Hai Nabi, orang-orang kafir memintamu agar Allah menyegerakan azab bagi mereka untuk mengolokmu. Azab itu akan menimpa mereka pada waktu yang telah Allah tetapkan, baik azab itu di dunia, di akhirat, atau di keduanya. Satu hari di akhirat di sisi Allah seperti seribu tahun dengan perhitungan dunia. Maka azab yang menimpa mereka bagi Allah tidak akan lama lagi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ (Dan mereka meminta kepadamu agar azab itu disegerakan) Sebab mereka sangat mengingkari datangnya azab, sehingga mereka berharap untuk disegerakan sebagai ejekan dan olokan. وَلَن يُخْلِفَ اللهُ وَعْدَهُۥ ۚ( padahal Allah sekali-kali tidak akan menyalahi janji-Nya) Dan janji ini telah ditetapkan maka kedatangannya pasti akan terjadi. وَإِنَّ يَوْمًا عِندَ رَبِّكَ كَأَلْفِ سَنَةٍ مِّمَّا تَعُدُّونَ (Sesungguhnya sehari disisi Tuhanmu adalah seperti seribu tahun menurut perhitunganmu) Yakni waktu yang singkat di sisi-Nya sama dengan waktu yang lama, sehingga satu hari dan seribu tahun menurut kuasa-Nya adalah waktu yang sama; oleh sebab itu Allah memberi mereka penangguhan. Pendapat lain mengatakan maknanya adalah sehari di akhirat yang dipenuhi dengan ketakutan dan kesengsaraan seperti seribu tahun di dunia yang dipenuhi dengan ketakutan dan kesengsaraan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Mereka orang musyrik Makkah meminta kepadamu agar azab itu disegerakan, dengan maksud menghina dan merendahkan. Sesungguhnya sehari disisi Tuhanmu di negeri akhirat dalam hal azab, setara dengan seribu tahun menurut perhitunganmu di dunia. Satu hari dan seribu hari adalah hari yang dinisbatkan untuk menggambarkan kekuasaan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka meminta kepadamu agar azab itu disegerakan, dan Allah tidak akan menyalahi janjiNya. Sesungguhnya sehari di sisi Tuhanmu adalah seperti seribu tahun menurut apa yang kalian hitungan} apa yang kalian hitung dalam tahun dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Kaum yang mendustakan meminta engkau menyegerakan datangnya siksaan, lantaran kebodohan, kezhaliman dan penentangan mereka, dalam rangka untuk melumpuhkan kekuatan (hujjah) Allah dan mendustakan para RasulNya. Allah tidak akan memungkiri janjiNya. Siksaan yang telah dijanjikan, pasti tiba. Tidak ada penghalang yang bisa menghambatnya. Tentang mempercepat dan menyegerakan waktu kedatangannya maka bukan tergantung pada dirimu, wahai Muhammad. Janganlah permintaan mereka dan tindakan untuk melemahkan Kami membuatmu kendor. Sesungguhnya, di hadapan mereka terdapat Hari Kiamat yang mana orang-orang dahulu dan orang-orang belakangan akan dikumpulkan di hari Tersebut. Mereka dibalasi berdasarkan amalyah mereka. Dan siksaan yang abadi lagi menyakitkan akan meliputi mereka. Oleh sebab itu, Allah berfirman, “Sesungguhnya sehari di sisi Rabbmu adalah seperti seribu tahun menurut perhitunganmu,” lantaran waktunya yang panjang, kedahsyatan dan kengeriannya. Sama saja, baik mereka telah ditimpa siksaan di dunia atau siksaan itu tertunda di akhirat, karena sesungguhnya hari itu pasti akan menghadang mereka. Makna yang dimaksud dengan ayat ini juga mengarah ke pengertian, bahwasanya Allah itu Mahabijak, walaupun mereka meminta penyegeraan azab. Sesungguhnya satu hari di sisiNya bagaikan seribu tahun lamanya dalam hitungan kalian. Jarak ini kendatipun kalian anggap masih lama, dan kalian anggap kedatangan siksaan itu lamban, maka sesungguhnya Allah sekedar memberikan tempo yang panjang, tidak sedang melupakan kalian. Manakala tiba waktu Allah untuk menyiksa orang-orang zhalim dengan siksaanNYa, niscaya Dia tidak akan meloloskan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 47: Yang demikian karena kebodohan, kezaliman, penentangannya dan karena mengira bahwa Allah lemah serta karena mendustakan Rasul-Nya. Oleh karena itu, apa yang diancamkan Allah pasti akan terjadi, dan tidak ada yang menghalangi mereka dari Allah. Adapun untuk penyegeraannya, maka itu bukan urusan Beliau, karena di hadapan mereka ada hari kiamat, hari di mana orang-orang terdahulu mereka dan orang-orang yang datang kemudian dikumpulkan dan diberikan balasan. Maksudnya adalah sehari di sisi Allah seperti seribu tahun menurut perhitunganmu karena lamanya dan dahsyatnya, dan sama saja apakah mereka mendapat azab di dunia atau azab itu ditunda dari mereka, maka sesungguhnya hari yang diancamkan itu akan datang. Bisa juga maksudnya, bahwa Allah Maha Penyantun, kalau sekiranya mereka meminta disegerakan azab, maka sesungguhnya sehari di sisi-Nya seperti seribu tahun menurut perhitungan manusia. Waktu tersebut, meskipun terasa lama dan manusia menganggap lama turunnya azab, akan tetapi Allah memberi waktu yang panjang bukan berarti membiarkan, sehingga apabila tiba saat Dia menyiksa orang-orang zalim, maka tidak ada yang diloloskan-Nya. Ada pula yang berpendapat, bahwa mereka meminta disegerakan azab, padahal sehari dari hari-hari diazabnya mereka di akhirat itu sama seperti seribu tahun. Ada pula yang berpendapat, bahwa maksudnya adalah sehari di sisi Allah dan seribu tahun dalam waktu penangguhan adalah sama, karena Dia berkuasa menyiksa mereka kapan saja, dan kalau pun ditunda, maka yang demikian tidaklah membuat luput, sehingga dalam kekuasaan-Nya sama saja apakah yang mereka minta itu terjadi atau ditunda nanti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 47",
    "description": "Karena mata hati mereka buta dan telinga mereka tertutup, dan mereka dengan sombong dan menantang meminta kepadamu, Muhammad, agar azab yang dijanjikan kepada orang-orang kafir itu disegerakan di dunia ini. Mereka tidak mengetahui bahwa Allah tidak akan pernah menyalahi janji-Nya bahwa azab yang pedih bagi orang-orang kafir itu akan diberikan di akhirat. Dan sungguh, jika mereka menyadari bahwa sehari di sisi tuhanmu di akhirat seperti seribu tahun menurut perhitunganmu di dunia sehingga merasakan azab sehari saja di dalam neraka sebanding dengan seribu tahun di dunia. Betapa dah-syatnya azab Allah, mengapa mereka menantang'48. Tantangan orang kafir agar disegerakan pemberian azab bagi me-reka dijawab Allah dengan berfirman, \"dan perhatikanlah, berapa banyak negeri yang aku tangguhkan penghancurannya, meskipun penduduknya meminta agar azab yang dijanjikan itu disegerakan \"karena penduduknya berbuat zalim, tidak beriman, menghina, dan mengusir utusan Allah, kemudian aku azab mereka saat mereka merasa aman dari azab-ku. Dan hanya kepada-kulah tempat kembali setiap orang dalam kehidupan sesudah mati, baik yang beriman maupun yang kufur."
  }
]