[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kebanyakan dari negeri-negeri yang berbuat kezhaliman, dimana penduduknya tetap bersikeras di atas kekafiran, lalu Kami tangguhkan mereka, dan tidak Aku timpakan hukuman pada mereka dengan segera, sehingga mereka merasa lengah, kemudian Aku siksa mereka dengan siksaanKu di dunia, dan kepadaKu-lah tempat kembali mereka setelah kehancuran mereka, lalu Aku siksa mereka dengan siksaan yang pantas mereka terima di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan betapa banyak negeri yang Aku tunda penurunan azab kepadanya karena penduduknya berbuat zalim dengan kafir kepada Allah, dan Aku tidak menyegerakan azab tersebut sebagai bentuk istidrāj (pemberian tenggang waktu agar azab mereka semakin berat) atas mereka, kemudian Aku mengazab mereka dengan azab yang menyeluruh, dan hanya kepada Aku lah tempat mereka kembali hari Kiamat kelak, lalu Aku memberikan balasan kekafiran mereka dengan azab yang kekal abadi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Banyak penduduk negeri-negeri yang zalim, Aku akhirkan azab mereka, kemudian Aku akan membinasakan mereka secara tiba-tiba. Kepada Allah mereka kembali untuk mendapatkan siksaan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَكَأَيِّن مِّن قَرْيَةٍ أَمْلَيْتُ لَهَا وَهِىَ ظَالِمَةٌ ثُمَّ أَخَذْتُهَا وَإِلَىَّ الْمَصِيرُ (Dan berapalah banyaknya kota yang Aku tangguhkan (azab-Ku) kepadanya, yang penduduknya berbuat zalim, kemudian Aku azab mereka, dan hanya kepada-Kulah kembalinya) Yakni dan banyak negeri yang penduduknya adalah orang-orang zalim seperti kalian, mereka Aku beri penangguhan beberapa saat, kemudian Aku timpakan azab kepada mereka, dan semua itu kembali pada ketetapan-Ku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Berapa banyak kota yang telah Aku tangguhkan azab-Ku kepadanya namun mereka tetap zalim kepada diri mereka sendiri dengan kekufuran seperti kalian wahai para orang kafir. Kemudian Aku azab mereka, dan hanya kepada-Ku lah tempat kembali segala sesuatu baik setelah binasa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Berapa banyak negeri yang Aku tangguhkan} Aku menangguhkannya dan tidak menyegerakan hukumannya {padahal penduduknya berbuat zalim, kemudian Aku menyiksa mereka. Hanya kepadaKulah tempat kembali} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “Dan berapa banyak kota yang Aku tangguhkan (azabKu) kepadanya,” Kami menundanya untuk waktu yang lama “yang penduduknya berbuat zhalim,” meskipun mereka berbuat kezhaliman, laju mereka untuk berbuat kezhaliman tidak serta merta membuat Kami mempercepat hukuman (mereka). “Kemudian Aku azab mereka, dan hanya kepadaKu-lah kembalinya segala sesuatu,” disertai siksa yang menghampiri mereka di dunia, mereka akan kembali kepada Allah, lalu menyiksa mereka dengan siksaNYa. Maka, hati-hatilah orang-orang yang berbuat kezhaliman terhadap datangnya hukuman Allah. Jangan sampai mereka terpedaya dengan penangguhan waktu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 48: Dengan waktu yang cukup lama. Kesegeraan mereka berbuat zalim tidaklah menjadikan Allah segera menyiksa mereka. Setelah mendapat azab di dunia, ia akan dikembalikan kepada Allah, Dia akan mengazabnya karena dosa-dosanya. Oleh karena itu, hendaknya orang-orang zalim takut jika sudah turun azab Allah, dan hendaknya mereka tidak tertipu oleh penangguhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 48",
    "description": "Tantangan orang kafir agar disegerakan pemberian azab bagi me-reka dijawab Allah dengan berfirman, \"dan perhatikanlah, berapa banyak negeri yang aku tangguhkan penghancurannya, meskipun penduduknya meminta agar azab yang dijanjikan itu disegerakan \"karena penduduknya berbuat zalim, tidak beriman, menghina, dan mengusir utusan Allah, kemudian aku azab mereka saat mereka merasa aman dari azab-ku. Dan hanya kepada-kulah tempat kembali setiap orang dalam kehidupan sesudah mati, baik yang beriman maupun yang kufur. 49. Orang-orang musyrik mekah, sebagaimana disebutkan pada ayat di atas, mengolok-olok rasulullah dengan meminta disegerakan datangnya azab. Pada ayat ini disebutkan bahwa tugas beliau adalah menyampaikan peringatan. Katakanlah olehmu, Muhammad, 'wahai manusia! urusan menurunkan azab itu wewenang Allah. Sesungguhnya aku di-utus kepadamu dan seluruh manusia hingga hari kiamat sebagai pemberi peringatan yang nyata bahwa beriman akan mendapatkan rida Allah, sedangkan mendustakan akan mendapatkan murka-Nya. '."
  }
]