[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian manusia, jika kalian itu berada dalam keraguan bahwa Allah berkuasa menghidupkan orang-orang yang mati, maka sesungguhnya Kami telah menciptakan moyang kalian, Adam, dari tanah, kemudian anak keturunannya berkembang biak dari setetes air, yaitu cairan sperma yang dipancarkan seorang lelaki (suami) pada Rahim istrinya. Kemudian dengan kuasa Allah,berubah menjadi ‘alaqah,yaitu darah merah yang bergumpal kental, lalu menjadi mudhghah,yaitu gumpalan daging kecil sebesar suapan yang dikunyah dalam mulut. Kadang-kadang gumpalan daging itu berbentuk mukhallaqah, yaitu sempurna bentuk fisiknya hingga berakhir dengan janin terlahir hidup-hidup, dan kadang-kadang berbentuk fisik yang tidak sempurna, sehingga mengalami keguguran sebelum usia kandungan sempurna. Tujuannya, agar Kami menerangkan kepada kalian kesempurnaan Kuasa Kami dengan mengendalikan fase-fase penciptaan makhluk, dan Kami mempertahankan apa yang ada di dalam Rahim sesuai dengan kehendak Kami, yaitu janin yang sempurna hingga masa kelahiran. Fase-fase itu berakhir dengan dilahirkannya janin-janin dalam rupa anak-anak kecil yang akan berkembang terus hingga menginjak usia dewasa, yaitu masa muda, penuh kekuatan, dan kematangan akal. Dan sebagian anak kecil terkadang meninggal sebelum masa itu. Dan sebagian bertumbuh hingga masa lanjut usia, dan menurunnya kemampuan akal, sehingga orang yang panjang umur ini tidak mengetahui apa yang pernah dia ketahui pada masa sebelumnya. Kamu lihat bumi itu kering lagi mati, tidak ada tanaman diatasnya. Ketika Kami menurunkan air hujan padanya, bumi menjadi bergerak dan terkuak oleh tumbuhan-tumbuhan, meninggi dan bertambah padat karena cukupnya air pdanya, dan menumbuhkan berbagai macam tumbuhan yang indah yang menyenangkan orang-orang yang memandangnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Wahai sekalian manusia! Jika kalian memiliki keraguan terhadap kekuasaan Kami untuk membangkitkan kalian setelah kematian, maka perhatikanlah proses penciptaan kalian; Kami telah menciptakan nenek moyang kalian, Adam dari tanah, kemudian Kami menciptakan anak keturunannya dari tetesan air mani yang dimasukkan seorang laki-laki ke dalam rahim perempuan, lalu mani itu berubah menjadi gumpalan darah yang membeku, lalu gumpalan darah itu berubah menjadi gumpalan daging persis seperti potongan daging yang dikunyah, lalu potongan daging itu berubah menjadi satu makhluk sempurna yang tetap bertahan dalam rahim hingga keluar sebagai anak yang lahir dan hidup, atau bisa berubah menjadi makhluk tidak sempurna yang kemudian digugurkan oleh rahim; semua ini terjadi agar Kami jelaskan tentang kekuasaan Kami kepada kalian dalam menciptakan kalian dalam beberapa fase, dan Kami tetapkan dalam rahim itu janin-janin sesuai kehendak Kami sampai ia dilahirkan dalam kurun waktu tertentu yaitu sembilan bulan, lalu Kami keluarkan kalian dari rahim ibu kalian sebagai bayi, lalu dengan berangsur-angsur kalian sampai pada fase sempurnanya tenaga dan akal pikiran (dewasa), dan di antara kalian ada yang diwafatkan sebelum itu, dan ada yang terus hidup sampai mencapai usia renta dimana tenaga dan akal pikirannya melemah sehingga kondisinya menjadi lebih buruk daripada bayi yaitu tidak mengingat lagi apa yang dahulunya ia ketahui. Dan kalian menyaksikan bumi ini kering tanpa ditumbuhi tumbuh-tumbuhan di atasnya, kemudian apabila Kami menurunkan air hujan di atasnya, bumi itu pun merekah dengan tumbuhnya tetumbuhan, bahkan menjadi tinggi lantaran suburnya tumbuh-tumbuhan tersebut, dan mengeluarkan dari setiap jenis tetumbuhan sesuatu yang indah dipandang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah menyampaikan kepada seluruh hamba tentang ayat-ayat kauniyah: “Jika kalian meragukan kekuasaan Kami untuk menghidupkan kalian kembali setelah kematian kalian, maka lihatlah awal mula penciptaan kalian agar keraguan itu hilang. Kami telah menciptakan Adam dari tanah, kemudian Kami menciptakan keturunannya dari air mani yang dipancarkan laki-laki ke rahim perempuan. Kemudian dengan kekuasaan Allah, air mani itu berubah menjadi segumpal darah, kemudian berubah menjadi segumpal daging yang mirip dengan daging yang terdapat bekas gigitannya; terkadang penciptaan ini sampai pada tahap yang sempurna, dan terkadang tidak sampai sempurna. Hal ini agar Kami menjelaskan besarnya kekuasaan Kami. Dan Kami menjadikan janin yang sempurna penciptaannya tetap di dalam rahim hingga datang masa kelahiran; kemudian Kami mengeluarkan janin ini sebagai bayi yang lemah badan dan panca indranya, yang secara berkala meningkat kekuatannya. Dan sebagian kalian meninggal pada masa muda, dan sebagian lain diberi umur panjang hingga usia lanjut sampai orang ini tidak mengetahui sama sekali apa yang dahulu dia ketahui. Dan hal lain yang menjadi bukti kebenaran hari kebangkitan adalah tanah yang tandus jika Kami turunkan kepadanya air hujan, maka tanah itu akan mulai ada kehidupan yang bergerak dan mulai menumbuhkan berbagai jenis tanaman yang memberi rasa bahagia bagi orang yang melihatnya karena kecantikan dan keindahannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. يٰٓأَيُّهَا النَّاسُ إِن كُنتُمْ فِى رَيْبٍ مِّنَ الْبَعْثِ (Hai manusia, jika kamu dalam keraguan tentang kebangkitan) Yakni jika kalian memiliki keraguan tentang kekuasaan Kami untuk membangkitkan kalian maka hendaklah kalian memperhatikan bagaimana kalian diciptakan. فَإِنَّا خَلَقْنٰكُم مِّن تُرَابٍ(sesungguhnya Kami telah menjadikan kamu dari tanah) Bersama penciptaan bapak kalian Adam. ثُمَّ مِن نُّطْفَةٍ(kemudian dari setetes mani) Yakni kemudian Kami menciptakan kalian dari mani. ثُمَّ مِنْ عَلَقَةٍ(kemudian dari segumpal darah) Makna (العلقة) adalah darah yang menggumpal yang terbentuk dari mani. ثُمَّ مِن مُّضْغَةٍ(kemudian dari segumpal daging) Yakni segumpal daging yang terbentuk dari gumpalan darah. مُّخَلَّقَةٍ(yang sempurna kejadiannya) Yakni dengan bentuk yang telah jelas. وَغَيْرِ مُخَلَّقَةٍ(dan yang tidak sempurna) Yakni fase sebelum pembentukan anggota badan sehingga belum terlihat jelas bentuknya. لِّنُبَيِّنَ لَكُمْ ۚ( agar Kami jelaskan kepada kamu) Menjelaskan kesempurnaan kuasa Kami dengan merubah fase-fase penciptaan kalian. وَنُقِرُّ فِى الْأَرْحَامِ مَا نَشَآءُ(dan Kami tetapkan dalam rahim, apa yang Kami kehendaki) Sebagian Kami tetapkan sehingga tidak gugur dan sebagian lainnya Kami gugurkan sehingga kehamilannya tidak selesai sempurna. إِلَىٰٓ أَجَلٍ(sampai waktu) Yakni sampai waktu kelahiran. مُّسَمًّى(yang sudah ditentukan) Yakni telah ditentukan dan ditetapkan Allah, yaitu Sembilan bulan bagi manusia. Dan bagi setiap hewan memiliki usia kehamilan tertentu pula. ثُمَّ نُخْرِجُكُمْ طِفْلًا(kemudian Kami keluarkan kamu sebagai bayi) Yakni Kami keluarkan dari perut ibu kalian dalam bentuk bayi. ثُمَّ لِتَبْلُغُوٓا۟ أَشُدَّكُمْ ۖ( kemudian (dengan berangsur-angsur) kamu sampailah kepada kedewasaan) Makna (الأشد) adalah kesempurnaan akal, serta kekuatan dan kesadaran. Terdapat pendapat mengatakan kesempurnaan akal ini terjadi antara usia 30 sampai 40 tahun. وَمِنكُم مَّن يُتَوَفَّى(dan di antara kamu ada yang diwafatkan) Yakni sebelum sampai usia dewasa. وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرْذَلِ الْعُمُرِ (dan (adapula) di antara kamu yang dipanjangkan umurnya sampai pikun) Yakni sampai usia lanjut hingga tidak dapat mengingat sesuatu lagi, dan keadaan ini lebih buruk dari keadaan anak kecil yang belum berakal. لِكَيْلَا يَعْلَمَ مِنۢ بَعْدِ عِلْمٍ شَيْـًٔا ۚ( supaya dia tidak mengetahui lagi sesuatupun yang dahulunya telah diketahuinya) Setelah dahulu mengetahui berbagai hal kemudian menjadi tidak mengetahuinya lagi. وَتَرَى الْأَرْضَ هَامِدَةً (Dan kamu lihat bumi ini kering) Tidak tumbuh di atasnya tanaman apapun. فَإِذَآ أَنزَلْنَا عَلَيْهَا الْمَآءَ (kemudian apabila telah Kami turunkan air di atasnya) Yakni air hujan. اهْتَزَّتْ(hiduplah bumi itu) Yakni bergejolak tanamannya karena saking banyaknya. وَرَبَتْ(dan suburlah) Yakni tumbuh meninggi. Atau membesar. وَأَنۢبَتَتْ(dan menumbuhkan) Yakni mengeluarkan. مِن كُلِّ زَوْجٍۭ بَهِيجٍ (berbagai macam tumbuh-tumbuhan yang indah) Dari berbagai jenis dan warna yang indah. Makna (البهيج) adalah keindahan yang memberi rasa senang bagi orang yang melihatnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{وَتَرَى ٱلْأَرْضَ هَامِدَةً فَإِذَآ أَنزَلْنَا عَلَيْهَا ٱلْمَآءَ ٱهْتَزَّتْ وَرَبَتْ} seorang mutadabbir mengatakan: suatu ketika aku mengingat ayat ini, dan aku melihat kepada kaum muslimin, bagaimana roda kehidupan mereka berganti ketika masuk bulan ramadhan, sungguh mereka seakan-akan seperti baru lahir kembali, betapa mudahnya jalan kehidupan jika dipandu oleh aturan islam dan dengan niat yang benar-benar tulus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Hai manusia jika kamu raguan tentang hari kebangkitan dari kubur sebagai kekuasaan Allah, maka ketahuilah bahwa sesungguhnya Kami telah menciptakan Adam dari tanah. Kemudian menciptakan anak cucunya dari setetes mani yang ada secara terus menerus yang ditanamkan dalam rahim. Kemudian menjadi segumpal darah, kemudian menjadi segumpal daging, kemudian menjadi wujud dengan bentuk sempurna maupun tidak sempurna. Kemudian Kami keluarkan kalian dengan wujud bayi dari perut ibu kalian. Thiflan adalah keadaan yang dialami oleh kalian semua. Kemudian Kami memelihara kalian dengan berangsur-angsur hingga kalian sampai pada masa kedewasaan yaitu antara umur tiga puluh hingga empat puluh. Ada di antara kalian yang diwafatkan sebelum usia dewasa dan adapula yang dipanjangkan umurnya sampai pikun, supaya dia tidak mengetahui apapun lagi yang dahulu telah diketahui. Kalian lihat bumi ini kering tanpa tumbuhan, kemudian apabila telah Kami turunkan hujan, bumi itu menjadi hidup dan subur yang menumbuhkan berbagai macam tumbuh-tumbuhan yang indah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, jika kalian ragu} ragu {tentang hari kebangkitan, sesungguhnya Kami telah menciptakan kalian dari tanah, kemudian dari setetes mani} air mani laki-laki yang dimasukkan ke dalam Rahim wanita {lalu segumpal darah} segumpal darah yang padat {lalu segumpal daging} segumpal daging kecil seukuran daging bisa dikunyah {yang sempurna penciptaannya} yang sempurna penciptaannya {atau pun tidak sempurna} kurang penciptaannya {agar Kami menjelaskan kepada kalian. Kami menetapkan} meneguhkan {dalam rahim sesuatu yang Kami kehendaki sampai waktu yang sudah ditentukan. Kemudian Kami mengeluarkan kalian sebagai bayi, sampai kalian mencapai usia dewasa} sempurnanya kekuatan, akal dan daya pembeda kalian {Di antara kalian ada yang diwafatkan dan ada yang dikembalikan ke umur yang sangat tua} umur yang sangat tua dan akalnya sudah lemah {sehingga dia tidak mengetahui lagi sesuatu yang pernah diketahuinya. Kamu melihat bumi itu kering} kering tidak tumbuh apa pun {Jika Kami menurunkan air di atasnya, bumi menjadi bergerak} bergerak karena ada tanaman {menjadi subur} meninggi dan tumbuh {serta menumbuhkan berbagai jenis} jenis {yang indah} indah dan menyenangkan orang yang melihatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Allah berfirman, “Hai manusia, jika kamu dalam keraguan tentang kebangkitan (dari kubur),” keragu-raguan, kesangsian serta ketidakyakinan akan kejadiannya, padahal kewajiban kalian adalah mempercayai Rabb kalian dan membenarkan para rasulNya dalam masalah itu. Akan tetapi, jika kalian menampik segalanya selain sikap ragu-ragu semata, maka ambillah dua bukti logis yang kalian saksikan. Masing-masing menunjukkan dengan bukti yang pasti kepada perkara yang kalian ragu tentangnya dan menghilangkan unsur syak pada hati-hati kalian. Pertama, pengambilan bukti melalui penciptaan manusia pertama kali, dan bahwa Dzat yang memulai penciptaannya akan (bisa) mengulanginya kembali. Allah berfirman mengenai ini, “Sesungguhnya Kami telah menciptakan kamu dari tanah,” maksudnya menciptakan nenek moyang manusia, Adam “Kemudian dari setetes air mani,” yakni dari mani. Inilah permulaan proses penciptaan manusia. “Kemudian dari segumpal darah,” maksudnya air mani itu berubah menjadi darah yang merah dengan izin Allah. “Kemudian dari segumpal daging,” maksudnya darah itu beralih wujud menjadi mudghah, yakni segumpal daging dengan ukuran yang bisa dikunyah. Segumpal daging tersebut, terkadang “sempurna kejadiannya,” maksudnya terbentuk bakal manusia dan terkadang “tidak sempurna” karena Rahim mengeluarkannya sebelum proses pembentukannya “agar Kami jelaskan kepadamu,” asal muasal penciptaan kalian, meskipun Allah mampu menyempurnakan penciptaannya dalam sekejap saja. Hanya saja, untuk menjelaskan kepada kita sekalian kesempurnaan hikmahNya dan keagungan kekuasaanNya serta keluasan rahmatNya. “Dan Kami tetapkan dalam Rahim, apa yang Kami kehendaki sampai waktu yang sudah ditentukan,” [maksudnya] Kami menetapkan kehamilan dalam Rahim yang tidak dicampakannya yang Kami kehendaki keberlangsungannya sampai wakktu yang telah ditentukan, yaitu masa kehamilan. “Kemudian Kami keluarkan kamu,” dari perut-perut ibu kalian “sebagai bayi,” yang mana kalian tidak mengetahui apa pun dan kalian tidak punya kekuatan. Selanjutnya Kami mengerahkan para ibu bagi kalian dan mengadakan rizki bagi kalian melalui air susunya. Kemudian kalian tumbuh dari fase ke fase berikutnya sampai memasuki masa kedewasaan. Yaitu masa kematangan kekuatan dan daya pikir. “Dan di antara kamu ada yang diwafatkan,” sebelum mencapai usia kedesawaan. Dan di antara kalian ada yang melewati usia tua sehingga “dipanjangkan umurnya sampai pikun,” usia yang mengenaskan dan hina, yiatu masa tua renta dan pikun, yang menyebabkan akal sehat hilang dan berkurang. Sebagaimana kekuatan fisiknya yang lain juga hilang dan melemah “supaya dia tidak mengetahui lagi sesuatu pun yang dahulunya telah diketahuinya,” maksudnya agar orang yang dipanjangkan umurnya ini tidak mengetahui perkara-perkara yang mereka ketahui sebelumnya. Lantaran melemahnya kekuatan akal yang dimiliknya. Kekuatan seorang manusia dikelilingi oleh dua kelemahan: (1). Kelemahan pada masa kanak-kanak dan kekurangan padanya; (2). Kelemahan masa tua dan kekurangan padanya. Seperti yang difirmankan oleh Allah, \"Allah, Dialah yang menciptakan kamu dari keadaan lemah, kemudian Dia menjadikan (kamu) sesudah keadaan lemah itu menjadi kuat, kemudian Dia menjadikan (kamu) sesudah kuat itu lemah (kembali) dan beruban. Dia menciptakan apa yang dikehendaki-Nya dan Dialah Yang Maha Mengetahui lagi Maha Kuasa.\" (Ar-Rum:54). Kedua: menghidupkan bumi setelah mati. Allah berfirman, “Dan kamu lihat bumi ini kering,” diam, penuh debu-debu, tidak ada tanaman dan juga tidak ada hijau-hijauan padanya “kemudian apabila Kami turunkan air di atasnya, hiduplah bumi itu,” maksudnya bergerak-gerak karena ada tumbuh-tmbuhan “dan suburlah,” maksudnya menjadi semakin tinggi pasca diamnya. Yaitu dengan pertumbuhan tanamannya “dan menumbuhkan berbagai macam tumbuh-tumbuhan,” yaitu satu jenis dari jenis-jenis tumbuhan “yang indah,” mengagumkan orang-orang yang melihatnya dan menyenangkan orang-orang yang memandangnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 5: Padahal seharusnya kamu percaya dengan Tuhanmu dan dengan utusan-Nya. Yakni berikut dua dalil aqlinya (secara akal): Pertama, diciptakan-Nya pertama kali manusia dari yang sebelumnya tidak ada, dan bahwa yang memulainya pertama kali tentu mampu mengulangi kembali. Kedua, dihidupkan-Nya bumi yang sebelumnya mati menjadi subur dan menumbuhkan tumbuh-tumbuhan. Yakni bapak kamu, yaitu Adam ‘alaihis salam. Yakni Kami ciptakan keturunannya. Yakni berubah dari mani menjadi darah yang beku. Yakni berubah dari darah yang beku menjadi segumpal daging. Maksudnya, berbentuk manusia. Yakni keluar dari rahim sebelum berbentuk. Maksudnya, untuk menjelaskan asal kejadianmu meskipun sesungguhnya Dia mampu menciptakan menjadi manusia dalam sekejap, akan tetapi untuk menerangkan sempurnanya kebijaksanaan-Nya, kekuasaan-Nya dan rahmat-Nya. Demikian pula agar mereka dapat mengetahui bahwa Dia mampu menciptakan mereka kembali setelah mati. Maksudnya sampai berakhir waktu mengandung. Dari perut ibumu. Di mana kamu tidak mengetahui apa-apa dan tidak memiliki kemampuan. Usia yang sudah cukup sempurna fisik dan akalnya, yaitu antara 30-40 tahun. Sebelum mencapai usia dewasa. Di samping fisiknya yang semakin melemah. Oleh karena itu, kekuatan manusia dikelilingi oleh dua kelemahan; kelemahan ketika kecilnya dan kelemahan ketika tuanya. ‘Ikrimah berkata, “Barang siapa yang membaca Al Qur’an, maka keadaannya tidak akan seperti ini.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 5",
    "description": "Wahai manusia! hidup sesudah mati itu suatu keniscayaan. Jika kamu meragukan hari kebangkitan dari alam kubur, maka perhatikanlah perkembangan hidup kamu. Sesungguhnya kami telah menjadikan kamu dari tanah, yakni saripati makanan yang berasal dari tanah. Kemudian dari setetes mani, yang sudah bercampur antara sperma dan sel telur. Kemudian dari segumpal darah, setelah beberapa minggu. Kemudian dari segumpal daging setelah segumpal darah itu tumbuh-kembang menjadi segumpal daging dengan dua kemungkinan, ada yang sempurna kejadiannya tanpa cacat apa pun, dan yang tidak sempurna, karena ada cacat fisik maupun mental sejak dari kandungan, agar kami jelaskan kepada kamu bahwa kamu berada dalam kekuasaan kami. Dan kami tetapkan kamu sewaktu embrio dalam rahim ibumu menurut kehendak kami hingga tiap orang berbeda rentang waktu berada dalam kandungan ibunya sampai waktu yang sudah ditentukan, biasanya setelah 36 minggu. Kemudian kami keluarkan kamu dari rahim ibu kamu sebagai bayi, kemudian dengan berangsur-angsur kamu sampai kepada usia dewasa. Dan di antara kamu ada yang diwafatkan dalam usia muda, bahkan masih bayi; dan ada pula yang diberi umur panjang, serta dikembalikan kepada usia pikun karena sangat tua, sehingga dia tidak mengetahui lagi sesuatu yang telah diketahuinya karena penyakit ketuaannya. Dan ada contoh lain betapa mudah bagi Allah membangkitkan manusia dari alam kubur, kamu lihat bumi ini kering, karena kekurangan air di musim kemarau, kemudian apabila telah kami turunkan air hujan di atasnya, maka hidup-lah bumi yang kering kerontang itu dan menjadi subur dan bumi yang subur itu menumbuhkan berbagai jenis pasangan tetumbuhan yang indah. Demikianlah paparan empiris tentang argumentasi betapa mudah bagi Allah membangkitkan manusia dari alam kubur menuju mahsyar. 6. Adapun yang demikian itu, membangkitkan manusia dari alam kubur, sangat mudah bagi Allah, karena sungguh Allah, dialah yang hak, satu-satunya tuhan yang berhak disembah, dan sungguh, dialah tuhan yang kekuasaan-Nya terasa dalam kehidupan ini, yaitu menghidupkan segala yang telah mati, dan sungguh, dia, tuhan, yang mahakuasa atas segala sesuatu, sehingga tak ada satu pun makhluk yang sanggup melawan kekuasaan-Nya."
  }
]