[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidaklah mengutus sebelummu (wahai Rasul) seorang Rasul maupun seorang Nabi, kecuali ketika dia membaca Kitabullah yang dia diutus dengannya berupa ayat-ayat, maka setan melontarkan pada bacaannya bisikan-bisikan dan syubhat-syubhat, agar dapat menghalangi manusia dari mengikuti apa yang dibacakan dan disampaikan oleh nabi atau rasul itu. Akan tetapi, Allah mematahkan tipu daya setan, lalu melenyapkan bisikan-bisikannya dan mengukuhkan ayat-ayatNya yang nyata. Dan Allah Maha Mengetahui segala sesuatu yang telah terjadi dan yang akan terjadi, tidak ada sesuatu yang tersembunyi bagiNya, Mahabijaksana dalam penetapan takdirNya dan pengaturanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan Kami tidaklah mengutus seorang rasul atau nabi sebelummu -wahai Rasul- melainkan apabila ia membaca Kitab Allah maka setan pun memasukkan dalam bacaannya itu tambahan kata-kata -yang membenarkan argumen orang-orang kafir- sehingga mereka pun menyangka bahwa itu bagian dari wahyu, namun Allah menghilangkan apa yang dimasukkan setan itu, dan menguatkan ayat-ayat-Nya. Sungguh Allah Maha Mengetahui segala sesuatu, tidak ada yang tersembunyi bagi-Nya, Maha Bijaksana dalam penciptaan-Nya, takdir-Nya, dan pengaturan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Hai Rasulullah, Kami tidak mengutus seorang rasul dan nabi sebelummu, melainkan jika dia membaca apa yang Allah perintahkan dan mengajak kepada perbaikan, maka setan akan membisikkan was-was dan syubhat ke dalam hati manusia, agar dia dapat menghalangi mereka dari seruan rasul dan nabi. Kemudian Allah akan melenyapkan tipu daya setan itu, sehingga tidak dapat mempengaruhi hati orang-orang beriman, dan Allah akan meneguhkan ayat-ayat dan hukum-hukum-Nya dalam hati orang-orang beriman. Allah Maha Mengetahui segala kejadian, dan Maha Bijaksana dalam perkataan dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. مِن رَّسُولٍ وَلَا نَبِىٍّ (seorang rasulpun ataupun seorang nabi) Terdapat pendapat mengatakan yang dimaksud dengan Rasul adalah orang yang diutus kepada para makhluk dengan diutusnya Jibril kepadanya untuk menyampaikan wahyu secara langsung. Sedangkan Nabi adalah orang yang diberi wahyu lewat ilham atau mimpi. Pendapat lain mengatakan Rasul adalah orang yang diutus dengan syariat khusus dan diperintahkan untuk menyampaikan syariat tersebut. Sedangkan Nabi adalah orang yang diberi wahyu, sehingga istilah Nabi meliputi Rasul dan meliputi orang yang diperitahkan untuk menyeru kepada syariat Rasul sebelumnya, namun tidak diturunkan kepadanya kitab. إِلَّآ إِذَا تَمَنَّىٰٓ أَلْقَى الشَّيْطٰنُ فِىٓ أُمْنِيَّتِهِۦ(melainkan apabila ia mempunyai sesuatu keinginan, syaitanpun memasukkan godaan-godaan terhadap keinginan itu) Menurut sekelompok ahli tafsir, sebab turunnya ayat ini adalah Nabi Muhammad ketika merasa sedih akibat kaumnya yang berpaling darinya, Beliau berharap andai saja tidak diturunkan kepadanya sesuatu yang menjauhkan kaumnya darinya, hal ini karena besarnya keinginan beliau terhadap keimanan mereka. Suatu hari Beliau duduk di satu tempat berkumpul kaumnya, dan ketika itu telah diturunkan kepadanya surat an-Najm, lalu ia membacanya sampai ayat (أفرأيتم اللات والعزى. ومناة الثالثة الأخرى) “apakah kamu patut (hai orang-orang musyrik) menganggap al-Laata dan al-Uzza yang ketiga) namun terucap di lisannya was-was setan yang dibisikkan ketika beliau membacanya (تلك الغرانيق العلى وإن شفاعتها لترتجى) “itulah burung bangau putih yang tinggi. Dan sungguh syafaatnya sangat diharapkan.” Ketika kaum Quraisy mengengar ini mereka bergembira. Dan ketika Rasulullah bersujud pada akhir surat ini seluruh orang beriman dan musyrik yang ada di tempat perkumpulan itu ikut bersujud. Kemudian orang-orang Quraisy bubar dengan rasa senang sambil berkata: Muhammad telah menyebut tuhan-tuhan kami dengan sebutan yang sangat baik. Lalu malaikat Jibril mendatangi Rasulullah dan berkata: “apa yang telah kamu lakukan? Kamu telah membaca untuk orang-orang apa yang tidak diturunkan oleh Allah.” Setelah itu Rasulullah merasa sedih dan sangat takut. Maka Allah menurunkan ayat ini. Demikianlah yang disebutkan oleh beberapa mufassir, kisah ini diriwayatkan dalam hadits-hadits mursal dan atsar-atsar yang sanadnya terputus, dan dengan sanad yang tidak ada yang shahih. Imam al-Baghawi lebih memilih bahwa makna dari firman Allah: أَلْقَى الشَّيْطٰنُ فِىٓ أُمْنِيَّتِهِۦ yakni setan menjadikan apa yang didengar oleh orang-orang musyrik adalah kalimat itu –kalimat yang disebutkan dalam kisah sebelumnya— tanpa Rasulullah mengucapkannya. Maka janganlah kamu takut dan merasa sedih karena hal itu, karena para Rasul dan para Nabi sebelummu juga telah mengalami yang seperti itu. Yakni jika Rasulullah membaca al-Qur’an, setan berbicara dan menjadikan apa yang di dengar manusia adalah apa yang tidak diucapkan oleh Rasulullah. فَيَنسَخُ اللهُ مَا يُلْقِى الشَّيْطٰنُ(Allah menghilangkan apa yang dimasukkan oleh syaitan itu) Yakni menjadikannya hilang dan sirna. ثُمَّ يُحْكِمُ اللهُ ءَايٰتِهِۦ ۗ( dan Allah menguatkan ayat-ayat-Nya) Yakni meneguhkan ayat-ayat Allah dengan sirnanya kalam setan. وَللهُ عَلِيمٌ حَكِيمٌ (Dan Allah Maha Mengetahui lagi Maha Bijaksana) Yakni memiliki banyak ilmu dan hikmah dalam seluruh firman dan perbuatan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Kami tidak mengutus sebelum kamu seorang rasulpun dan tidak pula seorang nabi, melainkan apabila ia mempunyai sesuatu keinginan, syaitanpun memasukkan godaan-godaan terhadap keinginan itu, Allah menghilangkan apa yang dimasukkan oleh syaitan itu, dan Allah menguatkan ayat-ayat-Nya. Dan Allah Maha Mengetahui atas apa yang Dia wahyukan kepada Nabinya dan juga tentang kondisi manusia. Juga atas apa yang direncanakan/lakukan setan. Maha bijaksana dalam segala apa yang diberlakukan-Nya kepada para makhluk. Dalam beberapa riwayat yang mursalat namur tidak musnadah ayat ini turun ketika nabi membaca surat An Najm ayat 19-29. Maka setan menirukan bacaan Nabi. Berhala/sesembahan mereka itu yang tinggi. Andai mereka bisa memberi pertolongan pasti akan dimintai doa. Ibnu Khuzaimah mengatakan bahwa cerita ini dari orang zindik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus seorang rasul dan tidak pula seorang nabi sebelum kamu, kecuali apabila dia berkeinginan} kecuali dia membaca dan menelaah kitab Allah SWT {setan memasukkan ke dalam keinginannya itu} bacaannya sesuatu yang bukan dari kitab itu, supara orang-orang kafir beranggapan bahwa itu berasal dari sana }Lalu Allah menghapus} melenyapkan {apa yang dimasukkan setan itu, kemudian Allah meguhkankan ayat-ayatNya} meneguhkan {Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Allah memberitahukan kandungan hikmahNya yang luhur dan seleksi yang Allah tentukan untuk memilih salah seorang dari kalangan para hambaNya, dan bahwa Allah tidaklah mendelegasikan sebelum Muhammad “seorang rasul pun dan tidak (pula) seorang nabi, melainkan apabila dia mempunyai suatu keinginan,” maksudnya dia membaca sesuatu untuk mengunggah umat manusia dan memerintahkan mereka serta melarang mereka “setan pun memasukkan godaan-godaan terhadap keinginan itu,” yaitu padanya bacaannya, berupa trik-trik dan tipu daya yang menghantam bacaan tersebut, kendatipun Allah telah membentengi para rasul pada aspek risalah yang mereka sampaikan dari Allah dan memelihara wahyuNya biar tidak rancu dan bercampuraduk dengan lainnya. Akan tetapi, lontaran godaan dari setan ini tidak selalu eksis dan berlangsung terus-menerus. Itu hanyalah sekedar hambatan yang timbul kemudian lenyap. Hambatan-hambatan ini terbatasi oleh ketentuan-ketentuan. Untuk itu, Allah berfirman, “Maka Allah menghilangkan apa yang dimasukkan oleh setan itu,” maksudnya Allah melenyapkan dan menghilangkannya serta menggugurkannya, dan menerangkan bahwa itu bukan dari bagian dari ayat-ayatNya. Dan “Allah menguatkan ayat-ayatNya,” mengokohkannya dan mensterilkan serta menjaganya, hingga tetap bersih murni dari dampak pencampuran hembusan godaan setan. “Dan Allah [Mahaperkasa], sempurna kekuatan dan kuasaNya. Dengan kesempurnaan kekuatanNya, Dia memelihara wakyuNya dan mengenyahkan lontaran campur tangan setan-setan. “Lagi Mahabijaksana,” meletakkan seluruh perkara pada tempatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 52: Imam Ibnu Katsir berkata, “Banyak para mufassir yang menyebutkan di ayat ini kisah Gharaniq (sejenis burung air) serta kembalinya para sahabat yang sudah berhijrah ke Habasyah karena mereka mengira bahwa kaum musyrik Quraisy sudah masuk Islam. Singkat ceritanya adalah sebagai berikut: Dari Sa’id bin Jubair ia berkata: Rasulullah shallallahu 'alaihi wa sallam ketika di Mekah membacakan surah An Najm. Ketika sampai ayat, “Afara’atumullaata wal ‘uzza, wa manaatats tsaalitsatal ukhraa” (artinya: Maka apakah patut kamu (hai orang-orang musyrik) mengaggap al Lata dan al Uzza,-- dan Manah yang ketiga, yang paling terkemudian (An Najm: 19-20)) Setan memasukkan godaan ke lisan Beliau, “Itulah gharaniq yang utama dan perantaraannya dapat diharapkan.” Mereka (orang-orang musyrik) berkata, “Beliau belum pernah sebelum hari ini menyebut baik tuhan-tuhan kita.” Maka Beliau sujud dan mereka pun ikut sujud. Kemudian Allah ‘Azza wa Jalla menurunkan ayat ini, “Dan Kami tidak mengutus seorang rasul dan tidak pula seorang nabi sebelum engkau (Muhammad), melainkan apabila dia mempunyai suatu keinginan, setan pun memasukkan godaan-godaan ke dalam keinginannya itu. Tetapi Allah menghilangkan apa yang dimasukkan setan itu. Dan Allah akan menguatkan ayat-ayat-Nya. Dan Allah Maha Mengetahui lagi Mahabijaksana,” Muhammad bin Ishaq menyebutkan kisah yang mirip seperti ini dalam As Sirah, namun semuanya adalah mursal dan terputus, wallahu a’lam. Imam Al Bahgawi pun sama menyebutkan kisah ini, namun Beliau mempertanyakan hal tersebut, “Bagaimana bisa terjadi seperti ini padahal wahyunya terpelihara dan dijamin oleh Allah Ta’ala untuk Rasul-Nya shallallahu 'alaihi wa sallam?” Kemudian Beliau menyebutkan berbagai jawaban dari beberapa orang (ulama). Di antara jawaban yang paling halusnya adalah, bahwa setan memasukkan ke telinga kaum musyrik hal tersebut, sehingga mereka mengira bahwa kalimat tersebut keluar dari Rasulullah shallallahu 'alaihi wa sallam, padahal sesungguhnya tidak. Bahkan ia merupakan pekerjaan setan, bukan dari Rasul Ar Rahman shallallahu 'alaihi wa sallam, wallahu a’lam.” Ayat ini merupakan hiburan dari Allah kepada Rasul-Nya shallallahu 'alaihi wa sallam. Yaitu nabi yang diperintahkan untuk menyampaikan. Yaitu nabi yang tidak diperintahkan menyampaikan. Ibnu Abbas berkata, “Apabila Beliau hendak menyampaikan perkataan, maka setan memasukkan godaan dalam perkataannya, lalu Allah menghilangkan godaan tersebut.” Suatu keinginan di sini adalah apabila hendak membaca Kitabullah. Imam Ibnu Katsir berkata, “Hakikat naskh (lihat lafaz ayat tersebut-peny) secara bahasa adalah menghilangkan dan mengangkat. Ibnu Abbas berkata, “Yakni Allah Subhaanahu wa Ta'aala menghilangkan godaan yang dimasukkan setan.” As Suyuthi setelah menyebutkan riwayat-riwayat ini (yakni tentang kisah Gharaniq) dalam Al Lubaab berkata, “Semuanya bisa lemah atau terputus.” Al Haafizh Ibnu Hajar berkata, “Akan tetapi banyaknya jalan menunjukkan bahwa kisah ini (kisah Gharaniq) memiliki dasarnya.” Ibnul ‘Arabi berkata, “Sesungguhnya riwayat-riwayat ini batil tidak ada asalnya.” Adh Dhahhak berkata, “Jibril dengan perintah Allah menghapuskan godaan setan dan Allah menguatkan ayat-ayat-Nya.” Syaikh As Sa’diy berkata,”Dia menyingkirkan (godaan setan itu), menghilangkannya, membatalkannya dan menerangkan bahwa hal itu bukan termasuk ayat-ayat-Nya.” Yakni merapihkannya dan memeliharanya, sehingga bersih dari godaan yang hendak dimasukkan setan. Dia mengetahui apa yang akan terjadi dan tidak ada satu pun yang samar baginya. Dia meletakkan sesuatu pada tempat-tempatnya, di antara sempurnya hikmah adalah diberikan kesempatan kepada setan untuk menyampaikan godaannya sebagai cobaan bagi orang-orang yang di dalam hatinya ada penyakit dan yang kasar hatinya sebagaimana diterangkan pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 52",
    "description": "Setelah dijelaskan bagaimana orang kafir menantang ayat-ayat Allah, pada ayat ini dijelaskan usaha setan melemahkan ayat-Nya, ketika ayat itu diwahyukan kepada para nabi dan rasul. Dan kami tidak mengutus seorang rasul pun di antara rasul-rasul Allah, dan tidak pula seorang nabi sebelum engkau Muhammad, melainkan apabila dia mempunyai suatu keinginan untuk memberi peringatan kepada orang-orang kafir, mereka segera mengikuti bacaan nabi dengan tambahan kata-kata yang membenarkan keyakinan mereka melalui usaha setan memasukkan kata-kata sesat ke dalam bacaan itu. Akan tetapi usaha ini tidak akan pernah berhasil. Karena Allah segera menghilangkan apa yang dimasukkan setan itu dengan cepat; dan Allah akan menguatkan ayat-ayat-Nya pada jiwa rasulullah dengan melindungi beliau dari kemungkinan menyampaikan kata-kata setan. Dan Allah maha mengetahui atas segala sesuatu, lagi mahabijaksana dalam semua perbuatan-Nya. 53. Allah mengizinkan setan menyisipkan kata-kata sesat ke dalam ayat-ayat-Nya ketika diwahyukan, karena dia ingin menjadikan kata-kata sesat yang ditimbulkan setan itu sebagai cobaan yang bisa menyesatkan, bagi orang-orang yang lemah iman yaitu bagi orang-orang yang dalam hatinya ada penyakit kemunafikan dan orang yang berhati keras sehingga tertutup dari cahaya Allah. Dan sungguh orang-orang yang zalim itu, karena meyakini kata-kata setan itu bagian dari wahyu Allah, benar-benar dalam permusuhan terhadap Allah dan rasul-Nya yang jauh dari kebe-naran."
  }
]