[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah tindakan dari setan ini muncul kecuali supaya Allah menjadikannya sebagai cobaan bagi orang-orang yang di dalam hati mereka terdapat keraguan dan kemunafikan, dan bagi orang-orang berhati keras dari kaum musyrikin yang sama sekali tidak terpengaruh oleh peringatan apa pun. dan sesungguhnya orang-orang zhalim, baik dari golongan munafik maupun golongan musyrikin, berada dalam api permusuhan besar terhadap Allah dan RasulNya dan perlawanan terhadap al-haq, lagi jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Setan memasukkan dalam bacaan Nabi -ṣallallāhu 'alaihi wa sallam- tambahan kata-kata sebagai ujian bagi kaum munafik dan orang-orang musyrik yang keras hatinya. Dan sungguh orang-orang zalim dari kalangan kaum munafik dan musyrik benar-benar melakukan permusuhan dengan Allah dan rasul-Nya, dan mereka sungguh jauh dari kebenaran dan petunjuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Allah akan menjadikan was-was dan syubhat itu sebagai ujian bagi orang-orang munafik dan orang-orang kafir, agar kesesatan dan kejahatan mereka semakin bertambah. Orang-orang yang menzalimi diri mereka sendiri itu sangat jauh dari petunjuk, dan mereka sangat memusuhi orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. لِّيَجْعَلَ مَا يُلْقِى الشَّيْطٰنُ فِتْنَةً (agar Dia menjadikan apa yang dimasukkan oleh syaitan itu, sebagai cobaan) Yakni apa yang diucapkan setan adalah kesesatan. لِّلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ(bagi orang-orang yang di dalam hatinya ada penyakit) Yakni terdapat keraguan dan kelemahan iman. وَالْقَاسِيَةِ قُلُوبُهُمْ ۗ( dan yang kasar hatinya) Mereka adalah orang-orang musyrik. وَإِنَّ الظّٰلِمِينَ لَفِى شِقَاقٍۭ بَعِيدٍ (Dan sesungguhnya orang-orang yang zalim itu, benar-benar dalam permusuhan yang sangat) Yakni permusuhan yang keras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Agar Dia menjadikan apa yang dimasukkan oleh syaitan itu, sebagai cobaan bagi orang-orang yang di dalam hatinya ada penyakit dan yang kasar hatinya. Dan sesungguhnya orang-orang yang zalim itu, benar-benar dalam permusuhan yang sangat,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia hendak menjadikan apa yang dimasukkan setan itu sebagai cobaan} ujian {bagi orang-orang yang di dalam hatinya ada penyakit} keraguan dan kemunaafikan {dan hatinya keras. Sesungguhnya orang-orang yang zalim itu benar-benar dalam perselisihan yang jauh} permusuhan yang sangat dahsyat dan perselisihan yang jauh dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Termasuk tanda kesempurnaan sifat hikmah Allah, Dia membuat setan mampu untuk melontarkan godaan-godaan itu, biar nyata apa yang disampaikan dalam FirmanNya, “agar Dia menjadikan apa yang dimasukkan oleh setan itu sebagai fitnah,” bagi dua golongan manusia yang Allah tidak mempedulikan mereka. [Mereka itu orang yang] “di dalam hatinya ada penyakit,” yaitu kelemahan dan kekosongan iman yang sampai titik nadir dan (tidak adanya) pembenaran yang teguh. Hingga syubhat paling ringan saja yang muncul sudah dapat berpengaruh pada hati mereka. Apabila mereka mendengarkan lontaran godaan dari setan, maka keraguan dan syak pun melekat pada hati mereka. Maka, jadilah ia fitnah bagi mereka. “Dan yang kasar hatinya,” maksudnya yang kaku, yang tidak mempan oleh larangan dan peringatan, tidak mencerna maksud dari Allah dan RasulNya, lantaran kekerasannya. Jika mendengarkan lontaran godaan setan, mereka menjadikannya sebagai hujjah mereka atas kebatilan mereka. Dengan dasar itu, mereka melancarkan adu argumentasi. Mereka menentang Allah dan RasulNya. Oleh karena itu, Allah berfirman, “Dan sesungguhnya orang-orang yang zhalim itu benar-benar dalam permusuhan yang sangat,” maksudnya dalam persengketaan mereka dengan Allah, perlawanan terhadap al-haq dan penentangan terhadapnya, jauh dari rel kebenaran. Tipu daya yang dilancarkan setan berubah menjadi fitnah bagi kedua belah kelompok ini. Dengan itu, terlihat kebusukan yang tersembunyi di hati-hati mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 53: Dengannya semakin nampak keburukan yang tersembunyi dalam diri mereka. Adapun bagi orang-orang yang diberi ilmu, maka sebagai rahmat. Maksudnya adalah penyakit keraguan dan kemunafikan. Yaitu kaum musyrik karena enggan menolak kebenaran, di mana hal tersebut mereka jadikan hujjah terhadap kebatilan mereka dan mereka gunakan untuk mendebat dan menentang Allah dan Rasul-Nya. Yakni orang yang hatinya ada penyakit dan orang-orang yang kasar hatinya (kaum musyrik). Terhadap Nabi shallallahu 'alaihi wa sallam dan kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 53",
    "description": "Allah mengizinkan setan menyisipkan kata-kata sesat ke dalam ayat-ayat-Nya ketika diwahyukan, karena dia ingin menjadikan kata-kata sesat yang ditimbulkan setan itu sebagai cobaan yang bisa menyesatkan, bagi orang-orang yang lemah iman yaitu bagi orang-orang yang dalam hatinya ada penyakit kemunafikan dan orang yang berhati keras sehingga tertutup dari cahaya Allah. Dan sungguh orang-orang yang zalim itu, karena meyakini kata-kata setan itu bagian dari wahyu Allah, benar-benar dalam permusuhan terhadap Allah dan rasul-Nya yang jauh dari kebe-naran. 54. Penjelasan Allah di dua ayat di atas bertujuan agar orang-orang yang telah diberi ilmu akal dan ilmu kalbu meyakini bahwa Al-Qur'an itu benar dari tuhanmu, tidak akan pernah bisa disusupi kata-kata setan; lalu mereka beriman kepada Al-Qur'an dengan mantap; dan hati mereka pun tunduk kepadanya tanpa ada keraguan sedikit pun. Dan sungguh, Allah adalah maha pemberi petunjuk bagi orang-orang beriman kepada jalan yang lurus, agama islam yang hanif, karena pikiran, perasaan, dan ruhaninya tercerahkan dengan cahaya Allah."
  }
]