[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan agar orang-orang berilmu yang dengan ilmu yang mereka miliki, mereka membedakan antara kebenaran dan kebatilan, menjadi tahu bahwa sesungguhnya al-qur’an al-Karim itulah kebenaran yang turun dari sisi Allah kepadamu, wahai rasul, tidak ada syubhat padanya, dan tidak ada jalan bagi setan kepadanya, kemudian iman mereka bertambah kepadanya dan hati mereka tunduk kepadanya. Dan sesungguhnya Allah benar-benar akan menunjukkan orang-orang yang beriman kepadaNya dan kepada RasulNya ke jalan kebenaran yang nyata, yaitu Islam, Dia menyelamatkan mereka dengannya dari kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Dan agar orang-orang yang telah dianugerahi Allah ilmu meyakini bahwa Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- merupakan suatu kebenaran yang diwahyukan Allah kepada engkau -wahai Rasul-, sehingga merekapun akan bertambah imannya, dan hati mereka akan tunduk dan takut kepada-Nya. Dan sesungguhnya Allah pemberi petunjuk bagi orang-orang beriman pada-Nya ke jalan yang benar lagi lurus, sebagai balasan atas ketundukan dan ketaatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Dan agar orang-orang berilmu mengatahui bahwa al-Qur’an benar-benar diturunkan dari Allah, kemudian mereka akan mengimaninya sehingga hati mereka menjadi tentram dan badan mereka menjadi tenang. Allah-lah yang memberi petunjuk orang-orang beriman menuju agama Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَلِيَعْلَمَ الَّذِينَ أُوتُوا۟ الْعِلْمَ أَنَّهُ الْحَقُّ مِن رَّبِّكَ (dan agar orang-orang yang telah diberi ilmu, meyakini bahwasanya Al Quran itulah yang hak dari Tuhan-mu) Yakni kebenaran yang turun dari sisi-Nya. فَيُؤْمِنُوا۟ بِهِۦ (lalu mereka beriman) Yakni teguh di atas keimanannya. فَتُخْبِتَ لَهُۥ قُلُوبُهُمْ ۗ (dan tunduk hati mereka kepadanya) Yakni khusyu’, tenang, dan taat. Keimanan dan ketundukan ini tidak mungkin berasal dari setan, namun dari al-Qur’an. وَإِنَّ اللهَ لَهَادِ الَّذِينَ ءَامَنُوٓا۟( dan sesungguhnya Allah adalah Pemberi Petunjuk bagi orang-orang yang beriman) Dalam urusan agama mereka. إِلَىٰ صِرٰطٍ مُّسْتَقِيمٍ(kepada jalan yang lurus) Yakni jalan yang benar yang tidak bengkok sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Agar orang-orang yang telah diberi ilmu, meyakini bahwasanya Al Quran itulah yang hak dari Tuhan-mu lalu mereka beriman dan tunduk hati mereka kepadanya dan sesungguhnya Allah adalah Pemberi Petunjuk bagi orang-orang yang beriman kepada jalan yang lurus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Agar orang-orang yang telah diberi ilmu itu mengetahui bahwa itu adalah kebenaran dari Tuhanmu} bahwa Al-Qur’an itu adalah kebenaran yang turun dari sisi Allah SWT {sehingga mereka beriman dan hati mereka tunduk} tunfduk {kepadanya. Sesungguhnya Allah benar-benar Maha Pemberi petunjuk menuju jalan yang lurus kepada orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Sementara golongan ketiga, hal itu menjadi pancaran rahmat bagi mereka. Mereka itulah yang disebutkan pada FirmanNya, “Dan agar orang-orang yang telah diberi ilmu, meyakini bahwasanya al-Quran itulah yang haq dari Rabbmu.” Allah mencurahkan anugerah ilmu bagi mereka yang menjadi (piranti) merekka untuk mengetahui antara kebenaran dan kebatilan, hidayah dan kesesatan, dan mereka pun membedakan antara dua hal itu, antara kebenaran yang kokoh yang Allah teguhkan dan kebatilan yang timbul yang Allah hapuskan, dengan dasar bukti-bukti dari masing-masing. Dan supaya mereka mengetahui bahwasanya Allah Mahabijaksana, Dia mendatangkan beberapa ujian yang dengan itu, tersibak rahasia-rahasia jiwa-jiwa yang baik dan jelek. “Lalu mereka beriman kepadanya,” dengan sebab tersebut, dan keimanan mereka terderek naik manakala halangan dan syubhat-syubhat telah terhindarkan. “Dan hati mereka tunduk kepadanya,” maksudnya khusyu’ tunduk dan berserah diri terhadap kandungan hikmahNya. Ini termasuk (pertanda) limpahan hidayah Allah pada mereka. “Dan sesungguhnya Allah adalah pemberi petunjuk bagi orang-orang yang beriman,” karena keimanan mereka “kepada jalan yang lurus,” mengetahui kebenaran dan mengamalkan tuntutannya. Maka, Allah meneguhkan orang-orang yang beriman melalui perkataan yang teguh di kehidupan dunia dan akhirat. Ini salah satu macam peneguhan Allah bagi hambaNya. Ayat-ayat ini memuat penjelasan bahwa Rasulullah mempunyai sumber teladan dari rekan-rekan beliau dari kalangan para rasul, lantaran apa yang terjadi pada beliau ketika membaca Surat an-Najm, ketika sampai pada ayat, \"Maka apakah patut kamu (hai orang-orang musyrik) menganggap Al Lata dan Al Uzza, dan Manah yang ketiga, yang paling terkemudian (sebagai anak perempuan Allah)?\" (An-Najm:19-20). Setan melontarkan godaannya pada bacaan beliau, “Itu adalah burung-burung yang tinggi, dan sesungguhnya syafaat mereka benar-benar diharapkan.” Maka, dengan peristiwa itu, timbullah kesedihan pada diri Rasulullah dan fitnah bagi umat manusia. Sebagaimana telah dipaparkan oleh Allah. Maka, Allah menurunkan ayat-ayat ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 54: Yakni ilmu yang dengannya mereka dapat mengetahui mana yang hak dan mana yang batil, mana petunjuk dan mana kesesatan, mereka pun dapat membedakan keduanya; kebenaran yang tetap yang dikokohkan Allah dan kebatilan yang baru datang yang dihapus Allah dengan syahid (bukti) terhadap masing-masingnya, dan agar mereka mengetahui bahwa Allah Mahabijaksana, Dia menetapkan sebagian cobaan agar nampak apa yang tersembunyi dalam hatinya berupa kebaikan dan keburukan. Dengan sebab itu dan iman mereka bertambah ketika syubhat tersingkirkan. dan menerima kebijaksanaan-Nya, dan hal ini termasuk hidayah-Nya kepada mereka. Karena iman yang ada dalam diri mereka. Yaitu pengetahuan terhadap yang hak dan mengamalkannya. Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh itu (Laailaahaillallah) dalam kehidupan di dunia, dan hal ini termasuk peneguhan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 54",
    "description": "Penjelasan Allah di dua ayat di atas bertujuan agar orang-orang yang telah diberi ilmu akal dan ilmu kalbu meyakini bahwa Al-Qur'an itu benar dari tuhanmu, tidak akan pernah bisa disusupi kata-kata setan; lalu mereka beriman kepada Al-Qur'an dengan mantap; dan hati mereka pun tunduk kepadanya tanpa ada keraguan sedikit pun. Dan sungguh, Allah adalah maha pemberi petunjuk bagi orang-orang beriman kepada jalan yang lurus, agama islam yang hanif, karena pikiran, perasaan, dan ruhaninya tercerahkan dengan cahaya Allah. 55. Berbeda dengan orang-orang yang diberi ilmu, lalu beriman kepada Al-Qur'an dengan mantap, bahwa orang-orang kafir itu senantiasa ragu mengenai Al-Qur'an dengan keraguan yang terus-menerus hingga saat kematian datang kepada mereka dengan tiba-tiba, atau bahkan keraguan mereka itu terbawa hingga merasakan azab hari kiamat yang datang kepada mereka dengan cepat."
  }
]