[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir yang mendustakan akan terus dalam keraguan terhadap apa-apa yang engkau bawa kepada mereka, berupa al-Qur’an, hingga kiamat datang kepada mereka secara tiba-tiba sementara mereka masih di atas sikap mendustakan, atau azab akan menimpa mereka pada hari yang tidak ada kebaikan padanya, yaitu Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan orang-orang yang kafir terhadap Allah dan mendustakan rasul-Nya itu senantiasa terus-menerus berada dalam keraguan terhadap ayat-ayat Al-Qur`ān yang diturunkan kepadamu, mereka terus berada dalam keraguan itu hingga datangnya hari Kiamat secara tiba-tiba, atau datangnya azab pada hari yang tidak ada rahmat dan kebaikan bagi mereka di dalamnya, sehingga seakan hari itu merupakan Kiamat bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Dan orang-orang kafir masih tetap meragukan al-Qur’an akibat was-was dari setan hingga hari kiamat datang secara tiba-tiba atau hingga azab yang sangat mengerikan yang belum pernah mereka lihat mendatangi mereka, sehingga azab itu membinasakan mereka semua tanpa tersisa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَلَا يَزَالُ الَّذِينَ كَفَرُوا۟ فِى مِرْيَةٍ مِّنْهُ (Dan senantiasalah orang-orang kafir itu berada dalam keragu-raguan terhadap Al Quran) Yakni dalam keraguan terhadap al-Qur’an. Atau terhadap agama. حَتَّىٰ تَأْتِيَهُمُ السَّاعَةُ (hingga datang kepada mereka saat (kematiannya)) Yakni datang hari kiamat. بَغْتَةً(dengan tiba-tiba) Yakni datang seketika. أَوْ يَأْتِيَهُمْ عَذَابُ يَوْمٍ عَقِيمٍ(atau datang kepada mereka azab hari kiamat) Yakni hari kiamat. Disebut dengan (العقيم) karena tidak ada hari setelahnya. Pendapat lain mengatakan karena tidak ada rahmat bagi mereka di hari itu sehingga kebaikan tidak akan mendatangi mereka. Pendapat lain mengatakan yakni hari mereka diperangi, seperti pada hari terjadinya perang Badar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Dan orang-orang kafir itu senantiasa berada dalam keragu-raguan terhadap Al Quran, hingga datang kepada mereka saat kematiannya dengan tiba-tiba atau datang kepada mereka azab ketika hari kiamat. Hari yang tidak ada guna lagi untuk beramal, sebab tidak ada hari lagi setelah hari itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang ingkar itu senantiasa dalam keraguan} keraguan-raguan {tentang itu} tentang Al-Qur’an {sehingga datang kepada mereka kiamat} kiamat {secara tiba-tiba} tiba-tiba {atau datang kepada mereka azab hari dimana semuanya tidak berguna} hari dimana tidak ada kebaikan dan rahmat bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Allah mengabarkan mengenai kondisi orang-orang kafir bahwa mereka senantiasa ragu terhadap risalah yang engkau emban, wahai Muhammad, karena dorongan sikap penentangan dan penyimpangan mereka. Mereka masih saja konsisten berada dalam keadaan ini, “hingga datang kepada mereka saat (kematiannya) dengan tiba-tiba,” maksudnya dengan sekonyong-konyong. “Atau datang kepada mereka azab Hari Kiamat,” maksudnya yang tidak ada kebaikannya sedikit pun, yaitu Hari KIamat. Apabila telah datang waktu yang telah ditentukan atau hari itu telah mendatangi mereka, niscaya orang-orang kafir itu mengetahui bahwa mereka telah melakukan kebohongan (atas ucapan-ucapan mereka di dunia), dirundung penyesalan pada saat penyesalan tidak berguna bagi mereka, tersiksa dan putus asa dari segala kebaikan. Mereka berharap-harap, seandainya dahulu beriman kepada Rasul dan menempuh jalan bersama beliau. Dalam ayat ini terkandung peringatan terhadap mereka karena konsistensi mereka dalam keragu-raguan dan kedustaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 55: Ada yang mengartikan “‘Adzaabu yaumin ‘aqiim” dengan perang Badar. Dinamakan perang badar dengan yaumun ‘aqiim (hari yang tidak berkelanjutan) karena mereka tidak melihat malam harinya, di mana mereka sudah mati terbunuh sebelum sore hari, ada pula yang berpendapat, karena pada hari itu tidak ada kebaikan sama sekali bagi orang-orang kafir, dan ada yang berpendapat, karena tidak ada hari yang lebih dahsyat daripada hari itu, karena malaikat ikut berperang. Namun yang rajih menurut Ibnu Katsir, bahwa yaumun ‘aqiim adalah hari kiamat meskipun perang Badar termasuk ke dalam hari yang diancamkan, tetapi itu bukan maksudnya. ‘Ikrimah dan Mujahid berkata, “Ia adalah hari kiamat, di mana tidak ada malamnya.” Sehingga mereka pun menyesal dan berputus asa dari semua kebaikan, dan mereka ingin sekali kalau seandainya mereka beriman kepada Rasulullah shallallahu 'alaihi wa sallam dan mengambil jalannya. Dalam ayat ini terdapat peringatan bagi mereka agar mereka berhenti dari keraguan dan kedustaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 55",
    "description": "Berbeda dengan orang-orang yang diberi ilmu, lalu beriman kepada Al-Qur'an dengan mantap, bahwa orang-orang kafir itu senantiasa ragu mengenai Al-Qur'an dengan keraguan yang terus-menerus hingga saat kematian datang kepada mereka dengan tiba-tiba, atau bahkan keraguan mereka itu terbawa hingga merasakan azab hari kiamat yang datang kepada mereka dengan cepat. 56. Pada ayat ini ditegaskan, baik orang yang beriman kepada Al-Qur'an maupun yang kufur, pada hari kiamat kehilangan kekuasaannya. Kekuasaan pada hari itu hanya ada pada Allah. Pada hari itu dengan keadilan-Nya, dia memberi keputusan di antara mereka yang beriman dan yang kufur dengan seadil-adilnya. Maka orang-orang yang beriman dan mengerjakan kebajikan selama hidupnya di dunia berada dalam surga-surga yang penuh kenikmatan yang kekal selama-lamanya."
  }
]