[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56-57. Kerajaan dan kekuasaan pada hari tersebut hanya milik Allah semata. Allah akan menetapkan keputusan di antara kaum Mukminin dan orang-orang kafir. Maka orang-orang yang beriman kepada Allah dan RasulNya, dan mengerjakan amal-amal shalih, bagi mereka kenikmatan abadi di dalam surga-surga, sedangkan orang-orang kafir kepada keesaan Allah dan mendustakan RasulNya, dan mengingkari ayat-ayat al-Qur’an, maka bagi mereka siksaan yang menghinakan dan merendahkan mereka di dalam jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Kekuasaan pada hari Kiamat kelak hanya milik Allah, yaitu hari di mana azab yang dijanjikan ditimpakan kepada mereka, tidak ada yang menyaingi kekuasaan-Nya pada hari itu. Dia lah yang memberikan keputusan antara orang-orang mukmin dan orang-orang kafir, Dia memberi masing-masing dari mereka keputusan yang pantas mereka dapatkan. Orang-orang yang beriman kepada Allah dan mengerjakan amal saleh mendapatkan pahala yang besar yaitu Surga yang penuh kenikmatan lagi kekal abadi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Seluruh kerajaan dan urusan hanya milik Allah pada hari kiamat, Dia yang memberi keputusan antara orang-orang beriman dan orang-orang kafir. Orang-orang beriman yang mengerjakan perintah Allah akan berada di surga yang penuh kenikmatan, sedangkan orang-orang kafir yang mendustakan ayat-ayat Allah yang jauh dari rahmat-Nya akan berada dalam azab yang kekal di neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. الْمُلْكُ يَوْمَئِذٍ لِّلّٰهِ (Kekuasaan di hari itu ada pada Allah) Yakni kekuatan dan kekuasaan sepenuhnya hanya milik Allah. يَحْكُمُ بَيْنَهُمْ ۚ فَالَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ فِى جَنّٰتِ النَّعِيمِ(Dia memberi keputusan di antara mereka. Maka orang-orang yang beriman dan beramal saleh adalah di dalam surga yang penuh kenikmatan) Yakni mereka berada di dalamnya, tenggelam dalam kenikmatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Kekuasaan mutlak dan sempurna di hari itu hanya ada pada Allah. Dia memberi keputusan di antara semua manusia. Maka orang-orang yang beriman kepada-Nya dan Rasul-Nya, dan beramal saleh atas apa yang telah Allah perintahkan maka mereka akan dimasukkan ke dalam surga yang penuh kenikmatan selamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kekuasaan} Kekuatan dan kekuasaan {pada hari itu} hari kiamat {hanya milik Allah. Dia memberi keputusan di antara mereka. Orang-orang yang beriman dan beramal shalih berada di dalam surga-surga yang penuh kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-57. “Kekuasaan di hari itu,” yaitu Hari KIamat “ada pada Allah,” Yang Mahatinggi, bukan bagi selainNya. “Dia memberi keputusan di antara mereka,” dengan ketetapan hukumNya yang adil dan keputusanNya yang tuntas. “Maka orang-orang yang beriman,” kepada Allah dan para RasulNya serta risalah-risalah yang mereka bawa “dan beramal shalih,” untuk membuktikan kebenaran keimanan mereka dengannya “berada di dalam surge yang penuh dengan kenikmatan.” Kenikmatan hati, jiwa dan raga, yang tidak dapat di deskripsikan oleh orang-orang dan tidak mampu diterawang oleh akal. “Sedangkan orang-orang kafir,” kepada Allah dan para RasulNya “dan mendustakan ayat-ayat Kami,” yang menunjukkan kepada al-haq dan jalan yang benar, maka mereka berpaling darinya atau menentangnya “maka mereka mendapatkan azab yang menghinakan,” mereka mendapatkan siksaan yang keras lagi pedih, dan siksaan tersebut sampai ke kalbu-kalbu mereka. Sebagaimana mereka telah menghinakan para RasulNya dan ayat-ayatNya, maka Allah menghinakan mereka dengan siksaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 56: Yaitu hari kiamat. Orang-orang mukmin dan orang-orang kafir dengan keputusan yang adil. Kepada Allah dan rasul-rasul-Nya serta beriman kepada apa yang mereka bawa. Mereka benarkan iman mereka dengan amal saleh. Karena karunia Allah. Mereka memperoleh kenikmatan hati, ruh dan badan yang sulit disebutkan sifatnya dan tidak dapat dicapai akal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 56",
    "description": "Pada ayat ini ditegaskan, baik orang yang beriman kepada Al-Qur'an maupun yang kufur, pada hari kiamat kehilangan kekuasaannya. Kekuasaan pada hari itu hanya ada pada Allah. Pada hari itu dengan keadilan-Nya, dia memberi keputusan di antara mereka yang beriman dan yang kufur dengan seadil-adilnya. Maka orang-orang yang beriman dan mengerjakan kebajikan selama hidupnya di dunia berada dalam surga-surga yang penuh kenikmatan yang kekal selama-lamanya. 57. Sedangkan orang-orang yang kafir kepada Allah dan rasul-Nya dan orang-orang yang mendustakan ayat-ayat kami dengan mengolok-olokkannya, maka mereka di akhirat akan merasakan azab yang menghinakan dan mereka kekal selama-lamanya."
  }
]