[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56-57. Kerajaan dan kekuasaan pada hari tersebut hanya milik Allah semata. Allah akan menetapkan keputusan di antara kaum Mukminin dan orang-orang kafir. Maka orang-orang yang beriman kepada Allah dan RasulNya, dan mengerjakan amal-amal shalih, bagi mereka kenikmatan abadi di dalam surga-surga, sedangkan orang-orang kafir kepada keesaan Allah dan mendustakan RasulNya, dan mengingkari ayat-ayat al-Qur’an, maka bagi mereka siksaan yang menghinakan dan merendahkan mereka di dalam jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan adapun orang-orang yang kafir kepada Allah dan mendustakan ayat-ayat yang Kami turunkan kepada rasul Kami, maka akan merasakan azab yang menghinakan, dengannya Allah menghinakan mereka dalam Neraka Jahanam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَالَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايٰتِنَا (Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami) Yakni mereka mengumpulkan sifat kafir kepada Allah dan mendustakan ayat-ayat-Nya. فَأُو۟لٰٓئِكَ لَهُمْ عَذَابٌ مُّهِينٌ (maka bagi mereka azab yang menghinakan) Mereka yang diazab benar-benar dalam kehinaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Orang-orang yang kafir kepada Allah dan rasul-Nya dan mendustakan ayat-ayat Kami di antaranya di dalam Al-quran, maka pada hari kiamat mereka akan mendapatkan azab yang sangat menghinakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang ingkar dan mendustakan ayat-ayat Kami, maka bagi mereka itu azab yang menghinakan} menghinakan dan merendahkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-57. “Kekuasaan di hari itu,” yaitu Hari KIamat “ada pada Allah,” Yang Mahatinggi, bukan bagi selainNya. “Dia memberi keputusan di antara mereka,” dengan ketetapan hukumNya yang adil dan keputusanNya yang tuntas. “Maka orang-orang yang beriman,” kepada Allah dan para RasulNya serta risalah-risalah yang mereka bawa “dan beramal shalih,” untuk membuktikan kebenaran keimanan mereka dengannya “berada di dalam surge yang penuh dengan kenikmatan.” Kenikmatan hati, jiwa dan raga, yang tidak dapat di deskripsikan oleh orang-orang dan tidak mampu diterawang oleh akal. “Sedangkan orang-orang kafir,” kepada Allah dan para RasulNya “dan mendustakan ayat-ayat Kami,” yang menunjukkan kepada al-haq dan jalan yang benar, maka mereka berpaling darinya atau menentangnya “maka mereka mendapatkan azab yang menghinakan,” mereka mendapatkan siksaan yang keras lagi pedih, dan siksaan tersebut sampai ke kalbu-kalbu mereka. Sebagaimana mereka telah menghinakan para RasulNya dan ayat-ayatNya, maka Allah menghinakan mereka dengan siksaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 57: Kepada Allah, para rasul-Nya dan mendustakan ayat-ayat-Nya yang menunjukkan kepada kebenaran, namun mereka berpaling darinya atau menentangnya. Karena kerasnya, pedihnya dan sampai ke hati sebagaimana mereka menghina para rasul dan ayat-ayat-Nya, sehingga Allah menghinakan mereka dengan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 57",
    "description": "Sedangkan orang-orang yang kafir kepada Allah dan rasul-Nya dan orang-orang yang mendustakan ayat-ayat kami dengan mengolok-olokkannya, maka mereka di akhirat akan merasakan azab yang menghinakan dan mereka kekal selama-lamanya. 58. Pada ayat yang lalu diterangkan bahwa Allah selalu menjaga rasul, kemurnian Al-Qur'an, dan memberi balasan yang adil di akhirat. Pada ayat ini dijelaskan balasan bagi orang yang meninggal ketika hijrah pada jalan Allah. Dan orang-orang beriman yang berhijrah di jalan Allah, mengubah pola hidup yang buruk dengan pola hidup islami, kemudian mereka terbunuh ketika memperjuangkan perubahan itu atau mati secara normal; sungguh, Allah akan memberikan kepada mereka, baik yang terbunuh maupun yang meninggal biasa, rezeki yang baik, berupa surga de-ngan segala kenikmatannya, yang kekal. Dan sesungguhnya Allah adalah pemberi rezeki yang terbaik kepada siapa saja di antara hamba-hamba-Nya yang beriman dan berhijrah pada jalan Allah."
  }
]