[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang keluar meninggalkan kampung-kampung halaman mereka guna mencari ridha Allah dan membela agamaNya, dan orang yang terbunuh dari mereka, ketika berperang melawan orang-orang kafir, dan orang yang meninggal dari mereka bukan dalam peperangan, niscaya Allah benar-benar akan memberikan karunia kepada mereka berupa surga dan kenikmatan di dalamnya yang tidak akan terputus dan habis. Dan sesungguhnya Allah benar-benar sebaik-baik pemberi rizki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan orang-orang yang hijrah meninggalkan kampung halaman dan negeri mereka demi meraih rida Allah dan menegakkan agama-Nya, lalu mereka terbunuh dalam menjalani jihad di jalan-Nya, atau mereka mati, Allah pasti akan mengaruniakan mereka rezeki yang baik lagi kekal abadi di surga-Nya, sesungguhnya Allah Maha Pemberi Rezeki yang paling baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58-59. Dan orang-orang yang berhijrah demi mendapat keridhaan Allah, kemudian dia diperangi di jalan Allah atau meninggal di luar peperangan, maka sungguh Allah akan memberi mereka surga dengan seluruh keindahan dan kenikmatannya. Allah dengan kemuliaan-Nya adalah sebaik-baik pemberi karena Dia memberi tanpa perhitungan. Kemudian Allah menegaskan hal ini dengan firman-Nya: Sungguh Allah akan menempatkan mereka di tempat di surga yang mereka ridhai. Allah Maha Mengetahui segala urusan hamba-hamba-Nya, dan Dia tidak segera menurunkan siksaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَالَّذِينَ هَاجَرُوا۟ فِى سَبِيلِ اللهِ (Dan orang-orang yang berhijrah di jalan Allah) Mereka adalah orang-orang yang berhijrah dari Makkah ke Madinah. ثُمَّ قُتِلُوٓا۟ أَوْ مَاتُوا۟( kemudian mereka di bunuh atau mati) Yakni dibunuh atau mati saat ia berhijrah. لَيَرْزُقَنَّهُمُ اللهُ رِزْقًا حَسَنًا ۚ( benar-benar Allah akan memberikan kepada mereka rezeki yang baik) Mereka makan dan minum di surga, dan menikmati segala kenikmatannya tanpa henti. Dan yang dimaksud dengan ini adalah setelah kematian mereka langsung sebelum terjadinya kiamat, sebab mereka tetap hidup dan mendapat rezeki di sisi Tuhan mereka. Dalam hadits disebutkan: “Arwah para syuhada’ berada di perut burung hijau, ia memakan buah-buahan surga.” وَإِنَّ اللهَ لَهُوَ خَيْرُ الرّٰزِقِينَ(Dan sesungguhnya Allah adalah sebaik-baik pemberi rezeki) Allah memberinya rezeki tanpa batas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Dan orang-orang yang berhijrah dan meninggalkan negeri mereka Makkah menuju Madinah dengan ketaatan dan mengharap ridho Allah, kemudian mereka di bunuh atau mati dalam medan perjuangan, atau meninggal dalam perjalanan hijrah, benar-benar Allah akan memberikan kepada mereka rezeki yang baik berupa surga. Dan sesungguhnya Allah adalah sebaik-baik pemberi rezeki Yang Maha memberi rizki tanpa perhitungan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang berhijrah di jalan Allah, kemudian terbunuh atau mati, sungguh akan dianugerahi oleh Allah rezeki yang baik. Sesungguhnya hanya Allah sebaik-baik pemberi rezeki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Ini merupakan berita gembira besar bagi yang menempuh perjalanan hijrah di jalan Allah. Dia keluar meninggalkan kampung halaman dan wilayahnya, anak-anak serta harta kekayaannya dalam rangka menggapai ridha Allah, baik dia meninggal di atas kasurnya atau terbunuh sebagai mujahid di jalan Allah. “Benar-benar Allah akan memberikan kepada mereka rizki yang baik (di surge),” di alam Barzakh dan di Hari Kiamat dengan masuk surge yang berisikan rahmat, keindahan, kebaikan, dan kenikmatan hati dan jasmani. Ayat ini juga bisa mengandung pengertian bahwasanya orang yang berhijrah di jalan Allah, sungguh Allah telah menjamin rizkinya di dunia dengan rizki yang melimpah lagi baik. Sama saja, baik Allah mengetahuinya akan meninggal di atas ranjangnya atau terbunuh di medan laga (mati syahid). Masing-masing akan terjamin rizkinya. Maka, jangan dikira bahwa orang yang pergi meninggalkan kampung halamannya, harta bendanya akan menjadi fakir dan butuh, karena pemberi rezekinya adalah Dia Sebaik-baik peberi rezeki, dan ini telah terjadi sebagaimana yang Allah beritakan, sesungguhnya kaum muhajirin terdahulu, telah meninggalkan negeri, anak dan harta mereka demi membela agama Allah. Tidak berapa lama, Allah menaklukkan negeri-negeri bagi mereka dan menjadikan mereka penguasa atas umat manusia. Mereka berhasil menggenggam harta kekayaan negeri-negeri itu. Dengan itu, mereka tergolong orang-orang yang terkaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 58: Ayat ini merupakan kabar gembira yang besar bagi orang yang berhijrah di jalan Allah, di mana ia keluar dari rumahnya, kampungnya, dan hartanya karena mencari keridhaan Allah dan hendak membela agama-Nya, maka orang ini berhak mendapat pahala dari Allah, baik ia meninggal di atas tempat tidur atau terbunuh sebagai mujahid fii sabiilillah. Di alam barzakh dan pada hari kiamat dengan masuk ke dalam surga yang penuh kenikmatan, baik bagi hati maupun badan. Maksud ayat ini bisa juga, bahwa orang yang berhijrah di jalan Allah telah ditanggung Allah rezekinya di dunia dengan rezeki yang banyak lagi baik, baik ia akan mati di kasurnya atau terbunuh sebagai syahid, mereka semua ditanggung rezekinya, sehingga jangan dikira bahwa apabila ia keluar meninggalkan rumah dan hartanya, maka ia akan miskin, karena Tuhannya adalah Pemberi rezeki yang terbaik. Ternyata apa yang diberitakan terjadi sesuai kenyataan, kaum muhajirin yang meninggalkan rumah dan harta mereka untuk membela agama Allah tidak lama kemudian diberikan oleh Allah kemenangan di atas kemenangan dan mereka menjadi manusia yang kaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 58",
    "description": "Pada ayat yang lalu diterangkan bahwa Allah selalu menjaga rasul, kemurnian Al-Qur'an, dan memberi balasan yang adil di akhirat. Pada ayat ini dijelaskan balasan bagi orang yang meninggal ketika hijrah pada jalan Allah. Dan orang-orang beriman yang berhijrah di jalan Allah, mengubah pola hidup yang buruk dengan pola hidup islami, kemudian mereka terbunuh ketika memperjuangkan perubahan itu atau mati secara normal; sungguh, Allah akan memberikan kepada mereka, baik yang terbunuh maupun yang meninggal biasa, rezeki yang baik, berupa surga de-ngan segala kenikmatannya, yang kekal. Dan sesungguhnya Allah adalah pemberi rezeki yang terbaik kepada siapa saja di antara hamba-hamba-Nya yang beriman dan berhijrah pada jalan Allah. 59. Rezeki yang baik yang disebut ayat di atas adalah surga. Sungguh, dia, Allah, pasti akan memasukkan mereka, orang beriman yang ber-hijrah pada jalan Allah, ke tempat masuk, yakni surga dengan segala kenikmatannya yang mereka sukai. Dan sesungguhnya Allah maha mengetahui segala sesuatu, maha penyantun kepada hamba-hamba-Nya yang beriman."
  }
]