[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah benar-benar akan memasukkan mereka ke dalam tempat yang amat mereka sukai, yaitu surga, dan sesungguhnya Allah benar-benar Maha Mengetahui orang yang keluar di jalanNYa dan orang yang keluar demi mencari dunia, juga Mahalembut terhadap orang yang bermaksiat kepadaNya, sehingga tidak menyegerakan hukuman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Sungguh, Dia pasti akan memasukkan mereka ke dalam tempat yang mereka sukai yaitu Surga, dan sesungguhnya Allah Maha Mengetahui amal perbuatan dan niat mereka, lagi Maha Penyantun, tidak menyegerakan kepada mereka azab atas kelalaian dan dosa-dosa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. لَيُدْخِلَنَّهُم مُّدْخَلًا يَرْضَوْنَهُۥ ۗ (Sesungguhnya Allah akan memasukkan mereka ke dalam suatu tempat (surga) yang mereka menyukainya) Ini merupakan sesuatu yang sesuai dengan diri dan keinginan mereka. Mereka akan melihat di surga sesuatu yang belum pernah dilihat oleh mata, didengar oleh telinga, dan belum pernah terbesit dalam hati manusia. وَإِنَّ اللهَ لَعَلِيمٌ (Dan sesungguhnya Allah Maha mengetahui) Mengetahui derajat orang-orang yang beramal dan kedudukan yang layak bagi mereka. حَلِيمٌ (lagi Maha Penyantun) Yakni menyantuni kelalaian orang yang lalai sehingga tidak menyegerakan siksaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Sesungguhnya Allah akan memasukkan mereka ke dalam suatu tempat yaitu surga yang mereka senangi dengan keridhoan Allah. Sesungguhnya Allah Maha mengetahui kondisi keadaan dan derajat mereka, lagi Maha Penyantun Yang menangguhkan hukuman dan tidak menghukum apa yang telah lewat/lalai dari mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Dia benar-benar akan memasukkan mereka ke tempat masuk yang mereka ridhai} tempat yang mereka ridhai, yaitu surga {Sesungguhnya Allah benar-benar Maha Mengetahui lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Berdasarkan pernyataan ini, Firman Allah, “Sesungguhnya Allah akan memasukkan mereka ke dalam suatu tempat (surge) yang mereka menyukainya,” baik bermakna Allah menaklukan negeri-negeri bagi mereka, terutama penaklukan kota Makkah yang dimuliakan. Mereka memasukinya dengan diliputi rasa ridha dan suka cita. Atau yang dimaksudkan adalah rizki di akhirat yang berbentuk masuk ke dalam surge. Sehingga ayat ini memadukan antara dua jenis limpahan rizki; rizki di dunia dan rizki di akhirat. Lafazh (yang dipakai) sejalan dengan seluruh makna ini. Dan maknanya tetap benar. Maka, tidak ada salahnya ditujukan pada semua makna itu. “dan sesungguhnya Allah Maha Mengetahui,” segala urusan, yang zhahir maupun batin, yang terdahulu dan yang terjadi belakangan “lagi Maha Penyantun,” para makhluk mendurhakaiNya dan menentangNya dengan berbagai macam dosa besar, akan tetapi Dia tidak menyegerakan siksaan atas mereka, kendatipun sangat mampu melakukannya. Justru tetap mencurahkan rizki bagi mereka dan mengucurkan kebaikan untuk mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 59: Maksud “tempat masuk yang mereka sukai” bisa maksudnya surga, dan bisa juga maksudnya diberikan kemenangan dan berhasil menaklukkan negeri-negeri, seperti berhasil menaklukkan Mekah, di mana mereka memasuki Mekah dalam keadaan ridha dan senang. Dengan demikian, mereka mendapatkan dua rezeki; rezeki di dunia dan di akhirat. Terhadap semua urusan, luar dan dalam, awal dan akhir. Makhluk-makhluk-Nya mendurhakai-Nya, namun Dia tidak segera memberikan hukuman padahal mampu melakukannya, bahkan masih tetap mengalirkan rezeki dan karunia-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 59",
    "description": "Rezeki yang baik yang disebut ayat di atas adalah surga. Sungguh, dia, Allah, pasti akan memasukkan mereka, orang beriman yang ber-hijrah pada jalan Allah, ke tempat masuk, yakni surga dengan segala kenikmatannya yang mereka sukai. Dan sesungguhnya Allah maha mengetahui segala sesuatu, maha penyantun kepada hamba-hamba-Nya yang beriman. 60. Orang beriman boleh melakukan perlawanan atau pembelaan diri jika dizalimi. Demikianlah, Allah mengizinkan kepada orang-orang beriman untuk membela diri dengan adil, dan barang siapa membalas perlakuan zalim sebanding dengan kezaliman atau penganiayaan yang pernah dia derita di masa lalu, kemudian dia dizalimi lagi, karena mempertahankan hak, pasti Allah akan menolongnya di dunia maupun di akhirat. Sungguh, Allah maha pemaaf kepada hamba-hamba-Nya yang memaafkan kesalahan orang lain, maha pengampun kepada mereka yang bertobat."
  }
]