[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hal-hal yang tekah disebutkan terdahulu itu termasuk tanda-tanda kekuasaan Allah. Di dalamnya terdapat bukti petunjuk pasti bahwa sesungguhnya Allah, Dia-lah Tuhan Yang berhak diibadahi, yang tidak sepantasnya peribadahan dilakukan kecuali bagiNya semata. Dia Maha Menghidupkan orang-orang yang mati, dan Dia Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Yang Kami sebutkan itu -berupa penciptaan kalian pertama kali, fasenya dan keadaan anak yang lahir dari kalian- agar kalian beriman bahwa Allah yang menciptakan kalian adalah yang hak, tidak ada keraguan tentang keberadaan-Nya, berbeda dengan patung-patung yang kalian sembah selain-Nya, dan agar kalian juga beriman bahwa Dia lah yang menghidupkan orang yang mati, dan bahwasanya Dia Maha Kuasa atas segala sesuatu, tidak memiliki sifat lemah sedikit pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Dalil ini menunjukkan empat hal: Pertama, Allah adalah Tuhan yang berhak disembah dan mampu menghidupkan makhluk yang telah mati. Kedua, Allah mampu melakukan segalanya, tidak ada yang tidak dapat Dia lakukan. Ketiga, hari kiamat pasti akan terjadi. Keempat, Allah akan menghidupkan manusia yang telah mati dan membangkitkan mereka dari kubur menuju tempat perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. ذٰلِكَ بِأَنَّ اللهَ هُوَ الْحَقُّ (Yang demikian itu, karena sesungguhnya Allah, Dialah yang haq) Al-Haq yakni Dzat yang tidak akan berubah dan tidak akan sirna. وَأَنَّهُۥ يُحْىِ الْمَوْتَىٰ (dan sesungguhnya Dialah yang menghidupkan segala yang mati) Sebagaimana menghidupkan tanah yang tandus. وَأَنَّهُۥ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ (dan sesungguhnya Allah Maha Kuasa atas segala sesuatu) Sebagaimana berkuasa menghidupkan tanaman dengan penuh keajaiban."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Yang demikian itu, yaitu penciptaan manusia hingga perkembangannya serta penghidupan bumi, tidak lain karena sesungguhnya Allah Yang Haq. Yang Maha Ada dan Kekal. Sesungguhnya Dialah yang menghidupkan segala yang mati dan sesungguhnya Allah Maha Kuasa atas segala sesuatu,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikian itu karena sesungguhnya Allah, Dialah yang Maha benar dan sesungguhnya Dia menghidupkan orang-orang yang mati dan sesungguhnya Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-7. Dua bukti kuat di atas menunjukkan lima perkara penting. Yaitu, berikut ini: “Yang demikian itu.” Dzat yang menciptakan manusia dari bahan yang sudah Allah sebutkan cirinya, dan menghidupkan bumi setelah kekeringannya “karena Allah, Dia-lah yang haq,” Rabb yang berhak diibadahi yang tidak sepantasnya ibadah diarahkan kepada selainNya. Ibadah kepadaNyalah yang merupakan tindakan benar. Sementara beribadah kepada selainNya merupakan bentuk kebatilan. “Dan bahwa Dia-lah yang menghidupkan segala yang mati,” sebagaimana Allah memulai penciptaan makhluk-makhlukNya dan menghidupkan bumi pasca kekeringannya “dan bahwa Allah Mahakuasa atas segala sesuatu,” sebagaimana Allah telah mempertontonkan kepada kalian bentuk kekuasaanNya yang special, dan ciptaanNya yang agung yang sudah kalian saksikan “dan bahwa Hari KIamat itu pastilah datang, taka da keraguan padanya.” Tidak ada alasan untuk menganggapnya musthil “dan bahwasanya Allah membangkitkan semua orang didalam kubur.” Dia akan membalasi kalian berdasarkan amalan-amalan kalian, yang baik dan yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 6: Maksudnya, yang disebutkan di ayat sebelumnya dari mulai penciptaan manusia diakhiri dengan hidupnya bumi setelah matinya. Maksudnya, Allah-lah Tuhan yang sebenarnya, yang berhak disembah dan Yang Mahakuasa, sedangkan selain-Nya adalah batil dan tidak berkuasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 6",
    "description": "Adapun yang demikian itu, membangkitkan manusia dari alam kubur, sangat mudah bagi Allah, karena sungguh Allah, dialah yang hak, satu-satunya tuhan yang berhak disembah, dan sungguh, dialah tuhan yang kekuasaan-Nya terasa dalam kehidupan ini, yaitu menghidupkan segala yang telah mati, dan sungguh, dia, tuhan, yang mahakuasa atas segala sesuatu, sehingga tak ada satu pun makhluk yang sanggup melawan kekuasaan-Nya. 7. Dan ketahuilah, wahai manusia, sesungguhnya hari kiamat itu pasti datang, meskipun Allah merahasiakan waktunya. Oleh karena itu, tidak ada keraguan padanya, karena kiamat itu ketetapan Allah; dan sungguh, pada hari kiamat itu Allah akan membangkitkan semua yang berada di dalam kubur untuk dikumpulkan di mahsyar."
  }
]