[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berita itulah yang Kami kisahkan kepadamu, yaitu dimasukannya orang-orang yang berhijrah ke dalam surga. Sedangkan orang yang tertindas dan terzholimi, sungguh telah di buka pintu izin baginya untuk membalas pelaku kezhaliman itu dengan tindakan yang serupa dengan perbuatannya. Hal itu tidak masalah baginya. Dan apabila pelaku penindasan kembali melancarkan gangguan dan berbuat kezhaliman, maka sesungguhnya Allah akan menolong orang yang terzhalimi lagi tetindas. Sebab, tidak dibenarkan melancarkkan kezhaliman pada seseorang yang mengambil haknya untuk membela diri. Sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun, memaafkan orang-orang yang berbuat dosa, sehingga tidak mempercepat hukuman pada mereka dan mengampuni dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Apa yang disebutkan sebelumnya berupa dimasukkannya orang-orang yang berhijrah ke dalam Surga, dan perintah-Nya tentang pemberian balasan kepada orang zalim sesuai kadar kezalimannya, dan apabila orang zalim itu kembali berbuat zalim maka Allah pasti akan menolong orang yang dizalimi, sungguh Allah Maha Pemaaf atas dosa-dosa orang beriman dan Maha Pengampun bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Itulah janji yang mulia. Dan barangsiapa yang membalas kejahatan orang lain sesuai dengan kejahatan yang didapatkannya, kemudian dia dizalimi, maka sungguh Allah akan menolongnya. Allah Maha Memaafkan dosa hamba-hamba-Nya yang bertaubat dan Maha Mengampuni mereka sehingga Dia tidak segera menurunkan siksaan-Nya. Itu adalah pertolongan yang Allah janjikan, karena Dia mampu melakukannya. Bahkan Dia mampu menciptakan yang lebih besar daripada itu, berupa ayat-ayat kauniyah yang tidak dapat terlepas dari manusia; seperti kekuasaan-Nya untuk memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam, dengan mengurangi waktu malam dan menambah waktu siang dan sebaliknya. Allah Maha Mendengar segala perkataan dan Maha melihat segala kejadian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوقِبَ بِهِۦ (dan barangsiapa membalas seimbang dengan penganiayaan yang pernah ia derita) Yakni barangsiapa yang membalas orang zalim dengan mengqishashnya sesuai kadar kezalimannya tanpa melebih-lebihkan. ثُمَّ بُغِىَ عَلَيْهِ(kemudian ia dianiaya (lagi)) Yakni ia kembali dizalimi lagi setelah kezaliman pertama. لَيَنصُرَنَّهُ اللهُ ۗ( pasti Allah akan menolongnya) Yakni Allah pasti akan menolong orang yang terzalimi atas orang yang zalim. إِنَّ اللهَ لَعَفُوٌّ غَفُورٌ(Sesungguhnya Allah benar-benar Maha Pemaaf lagi Maha Pengampun) Yakni memiliki banyak maaf dan ampunan bagi orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Demikianlah, dan barangsiapa membalas seimbang dengan penganiayaan yang pernah ia derita kemudian ia dianiaya lagi, pasti Allah akan menolongnya dari orang yang mendholiminya. Sesungguhnya Allah benar-benar Maha Pemaaf lagi Maha Pengampun kepada orang-orang mukmin. Ayat ini turun ketika sekelompok orang musyrik membunuh segerombolan orang muslim pada bulan haram meskipun telah dimohon / didesak sahabat agar orang musyrik tidak membunuh mereka. Namun mereka tidak menghiraukannya, maka orang-orang muslim memerangi mereka dan mereka diberikan pertolongan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah, siapa yang membalas serupa dengan penganiayaan yang telah dia derita kemudian dia dizalimi} disakiti {sungguh Allah akan menolongnya. Sesungguhnya Allah benar-benar Maha Pemaaf lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Hal demikian ini, Karena orang yang ditimpa kejahatan dan penganiayaan, maka dia boleh membalas pelaku dengan balasan serupa. Bila dia melakukan pembalasan itu, maka tidak ada cara untuk menyalahkannya dan ia pun tidak tercela. Jika setelah itu, dia diperlakukan semena-mena lagi, sungguh Allah akan menolongnya. Pasalnya, dia seorang yang mazhlum (teraniaya). Maka, dia tidak boleh dianiaya lagi karena dia (hanyalah) meminta haknya dikembalikan secara utuh. Apabila ada seseorang yang membalas orang lain atas ulah buruknya saat dia dizhalimi lagi, niscaya Allah akan menolongnya, maka sosok yang pada dasarnya tidak berusaha balas dendam terhadap siapa pun jika dia menjadi obyek penganiayaan dan kejahatan, tentu pertolongan (dari Allah) akan lebih dekat dengannya. “Sesungguhnya Allah benar-benar Maha Pemaaf lagi Maha Pengampun,” maksudnya, Allah memaafkan orang-orang yang berbuat dosa, tidak mempercepat kedatangan hukuman bagi mereka dan mengampuni dosa-dosa mereka serta menghapuskannya dan menghilangkan dampak-dampaknya dari mereka. Inilah sifat Allah yang selalu menyertai DzatNya dan cara pendekatanNya kepada para makhlukNya dalam semua waktu dengan membuka pintu maaf dan ampunan. Maka sudah sepatutnya kalian wahai orang-orang yang teraniaya lagi ditimpa kejahatan, untuk membuka pintu maaf dan ampunan. Agar Allah memperlakukan kalian sebagaimana sikap kalian memperlakukan sesame hamba-Nya. \"Barangsiapa memaafkan dan mengusahakan perbaikan, maka pahalanya ada di tanggungan Allah.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 60: Maksudnya, yang kami ceritakan kepadamu. Maka sesungguhnya ia boleh membalas serupa, dan jika ia melakukan pembalasan, maka ia tidak disalahkan, bahkan jika ia dizalimi lagi, maka Allah akan menolongnya, karena ia terzalimi. Dalam tafsir Ibnu Katsir diterangkan, bahwa ayat ini turun berkenaan sariyyah (pasukan kecil) para sahabat ketika mereka menemui sekumpulan kaum musyrik di bulan haram, maka kaum muslimin meminta mereka agar tidak menyerang di bulan itu, tetapi kaum musyrik tetap ingin menyerang, maka terpaksa kaum muslimin memerangi mereka dan Allah memberikan pertolongan kepada kaum muslimin dalam peperangan itu. Seperti diusir dari kampung halamannya. Allah Maha Pemaaf terhadap orang-orang yang berdosa, Dia tidak menyegerakan hukuman kepada mereka, Dia mengampuni dosa mereka, menghilangkannya, dan menghilangkan pengaruhnya. Inilah sifat dzatiyah Allah yang selalu pada-Nya. Dia bermu’amalah (berhubungan) dengan hamba-hamba-Nya dalam setiap waktu dengan memaafkan dan mengampuni. Oleh karena itu, sudah sepatutnya kamu wahai orang-orang yang terzalimi memaafkan dan mengampuni."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 60",
    "description": "Orang beriman boleh melakukan perlawanan atau pembelaan diri jika dizalimi. Demikianlah, Allah mengizinkan kepada orang-orang beriman untuk membela diri dengan adil, dan barang siapa membalas perlakuan zalim sebanding dengan kezaliman atau penganiayaan yang pernah dia derita di masa lalu, kemudian dia dizalimi lagi, karena mempertahankan hak, pasti Allah akan menolongnya di dunia maupun di akhirat. Sungguh, Allah maha pemaaf kepada hamba-hamba-Nya yang memaafkan kesalahan orang lain, maha pengampun kepada mereka yang bertobat. 61. Untuk memberi pertolongan kepada orang-orang beriman yang dizalimi pasti akan ditepati. Demikianlah, janji Allah, karena Allah berkuasa memasukkan malam ke dalam siang sehingga siang di musim panas lebih panjang, dan memasukkan siang ke dalam malam sehingga malam lebih panjang di musim dingin; dan sungguh, Allah maha mendengar doa setiap hamba dan maha melihat keberadaan seluruh makhluk-Nya."
  }
]