[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketetapan-ketetapan hokum yang disyariatkan bagi kalian berupa hokum-hukum yang adil itulah kebenaran sejati. Dan Dia MahaKuasa atas segala yang Dia kehendaki. Dan diantara bukti KuasaNYa, Dia memasukkan waktu malam yang berkurang pada waktu siangnya, dan memasukkan waktu-waktu siang yang menyusut ke dalam waktu-waktu malam, dan sesungguhnya Allah Maha Mendengar semua suara, Maha Melihat seluruh perbuatan, tidak ada sesuatu yang tersembunyi bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Pertolongan itu diberikan kepada orang yang terzalimi karena Allah Maha Kuasa atas segala sesuatu. Di antara kekuasaan-Nya adalah memasukkan malam ke dalam siang, dan memasukkan siang ke dalam malam; dengan menambah jangka waktu salah satunya dan mengurangi jangka waktu lainnya, dan sungguh Allah Maha Mendengar ucapan para hamba-Nya, tidak ada yang tersembunyi bagi-Nya, dan Dia akan memberikan mereka balasan sesuai amal perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. ذٰلِكَ بِأَنَّ اللهَ يُولِجُ الَّيْلَ فِى النَّهَارِ (Yang demikian itu, adalah karena sesungguhnya Allah (kuasa) memasukkan malam ke dalam siang) Allah menolong orang yang terzalimi karena Allah Maha Kuasa, dan bagian dari kesempurnaan kuasa-Nya adalah mampu memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam, dan bertambahnya salah satu dari siang dan malam adalah pengurangan bagi lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Yang demikian itu, adalah karena sesungguhnya Allah Maha kuasa untuk memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam agar satu bertambah atau berkurang. Satu perkara menutupi perkara lainnya. Dan bahwasanya Allah Maha Mendengar dengan jelas lagi Maha Melihat dengan luas. Maha mendengar segala perkataan dan Maha melihat segala perbuatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu karena sesungguhnya Allah memasukkan} memasukkan {malam ke dalam siang dan memasukkan siang ke dalam malam. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Dzat yang menetapkan hukum-hukum yang baik lagi (berorientasi kepada) keadilan, ialah Dzat Yang Mahabaik pengelolaannya dalam menentukan dan mengatur, yang “(kuasa) memasukkan malam ke dalam siang,” maksudnya memasukkan ini ke sana dan itu ke sini. Dia mendatangkan malam setelah waktu siang hari dan mendatangkan waktu siang sesudah waktu malam hari. Allah menambahkan perpanjangan durasi pada salah satu waktu tersebut yang sama dari waktu yang lain, dan sebaliknya. Sebagai akibatnya, muncullah berbagai macam musim, kemaslahatan yang timbul dari pergantian malam dan siang hari, serta kegunaan keberadaan matahari dan bulan yang merupakan sebagian kenikmatan terbesar yang dianugerahkan kepada para hambaNya yang mana ia merupakan kebutuhan-kebutuhan primer bagi mereka. “Dan bahwasanya Allah Maha Mendengar,” mendengarkan gemuruh suara-suara dalam berbagai bahasa untuk bermacam-macam permohonana. “Lagi Maha Melihat,” menyaksikan langkah semut hitam yang berada di bawah batu berwarna hitam-pekat di malam hari yang gelap-gulita, sama saja, baik salah seorang di antara kalian yang meirihkan perkataannya dan mengeraskannya dan rang-orang yang tersembunyi di malam hari dan bergerak-gerak di siang hari."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 61: Yakni pertolongan itu, atau hukum-hukum yang baik dan adil yang disyariatkan kepada kamu. Di mana hal tersebut terdapat banyak maslahat bagi hamba dan sebagai nikmat bagi mereka. Doa kaum mukmin. Dia memberikan keimanan dalam hati mereka, lalu mengabulkan doa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 61",
    "description": "Untuk memberi pertolongan kepada orang-orang beriman yang dizalimi pasti akan ditepati. Demikianlah, janji Allah, karena Allah berkuasa memasukkan malam ke dalam siang sehingga siang di musim panas lebih panjang, dan memasukkan siang ke dalam malam sehingga malam lebih panjang di musim dingin; dan sungguh, Allah maha mendengar doa setiap hamba dan maha melihat keberadaan seluruh makhluk-Nya. 62. Demikianlah, Allah memperlihatkan kekuasaan-Nya memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam, karena Allah, dialah tuhan yang hak sehingga hanya dia yang ber-hak disembah. Dan sungguh apa saja yang mereka seru selain dia yang dianggap tuhan dan disembah, itulah tuhan dan persembahan yang batil, salah, sesat, dan jauh dari kebenaran; dan sungguh Allah, dialah yang mahatinggi dari semua tuhan-tuhan yang dianggap tinggi oleh manusia; mahabesar, kekuasaan-Nya atas segala sesuatu."
  }
]