[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demikian itu, karena sesungguhnya Allah itulah Tuhan Yang Haq, yang tidak layak ditujukan sebuah peribadahan kecuali kepadaNya, dan sesungguhnya obyek yang disembah oleh kaum musyrikin selain Allah, berupa berhala-berhala dan tandingan-tandingan itulah kebatilan yang tidak membawa manfaat dan mendatangkan bahaya. Dan sesungguhnya Allah, Dia-lah Yang MahaTinggi di atas MakhlukNya, Yang MahaTinggi dari keserupaan-keserupaan dan tandingan-tandingan, lagi MahaBesar dalam Dzat, Nama-namaNya, dan sifat-sifatNya; Dia lebih besar dari segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Apa yang disebutkan sebelumnya berupa kekuasaan Allah memasukkan malam ke dalam siang dan sebaliknya; hal itu terjadi karena Allah adalah Tuhan Yang Maha Benar, agama-Nya benar, janji-Nya benar, dan pertolongan-Nya kepada orang-orang beriman adalah benar adanya, dan bahwasanya apa yang disembah oleh orang-orang musyrik selain Allah berupa berhala dan patung-patung itu adalah perkara batil yang tidak berdasar sama sekali. Dan sesungguhnya Allah Maha Tinggi di atas hamba-hamba-Nya baik dari segi Żat, ataupun kekuasaan-Nya, juga Maha Besar yang hanya milik-Nya lah segala kebesaran, dan keagungan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Kekuasaan dan keagungan yang sempurna Allah itu karena Dia adalah Tuhan Yang Hak; sedangkan apa yang disembah orang-orang kafir selain-Nya adalah batil. Allah Maha Tinggi dari hamba-Nya dan Maha Agung, tidak ada yang melebihi kebesaran-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. ذٰلِكَ بِأَنَّ اللهَ هُوَ الْحَقُّ (yang demikian itu, adalah karena sesungguhnya Allah, Dialah (Tuhan) Yang Haq) Agama-Nya benar, penyembahan kepada-Nya benar, pertolongan bagi para kekasih-Nya atas musuh-musuh-Nya adalah benar, dan janji-Nya adalah benar. وَأَنَّ مَا يَدْعُونَ مِن دُونِهِۦ (dan sesungguhnya apa saja yang mereka seru selain dari Allah) Yakni menyeru berhala-berhala. هُوَ الْبٰطِلُ(itulah yang batil) Yang tidak kekal dan bukan merupakan tuhan. وَأَنَّ اللهَ هُوَ الْعَلِىُّ (dan sesungguhnya Allah, Dialah Yang Maha Tinggi) Yakni Maha Tinggi atas segala sesuatu, Maha Suci dari segala sekutu, dan jauh dari apa yang dikatakan orang-orang zalim. الْكَبِيرُ (lagi Maha Besar) Yakni memiliki keangkuhan, kebesaran, dan keagungan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Kuasa Allah yang demikian itu, adalah karena sesungguhnya Allah adalah Tuhan Yang Haq dan sesungguhnya apa saja yang mereka seru selain dari Allah, itulah yang batil, dan sesungguhnya Allah adalah Yang Maha Tinggi lagi Maha Besar atas segala sesuatu dengan kekuasaan dan keagungan-Nya. Yang Maha Agung dari segala apapun yang tidak akan ada persekutuan bagi-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu karena Allah adalah Dzat Yang Maha benar dan sesungguhnya sesuatu yang mereka seru selain Dia itulah yang bathil. Sesungguhnya Allah adalah Dzat Yang Maha tinggi} Maha tinggi atas segala sesuatu dengan Dzat, keperkasaan, dan kekuasaannya {lagi Maha besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “(Kuasa Allah) yang demikian itu,” Dzat yang memegang kekuasaan dan menetapkan hukum-hukum “adalah karena sesungguhnya Dia-lah (Rabb) Yang Haq,” maksudnya yang tetap eksis, senantiasa ada dan tidak akan pupus. Allah bernama al-Awwal, yang tidak ada sesuatu pun yang mendahuluiNya. Dia-lah al-Akhir, yang tidak ada sesuatu pun setelahNya, sempurna dalam nama-nama dan sifat-sifatNya, jujur dalam janjiNya, yang janjiNya benar-benar terjadi, perjumpaan denganNya pasti, agamaNya benar, peribadahan untukNya itulah (pilihan) yang benar, yang akan bermanfaat lagi lestari dalam keabadian. “Dan sesungguhnya apa saja yang mereka seru selain Allah,” berupa arca-arca, tandingan-tandingan dari bangsa binatang dan benda-benda mati “itulah yang batil,” yang memang keberadaannya merupakan kebatilan dan peribadahan untuknya pun satu bentuk kebatilan. Lantaran ia bertumpu pada benda yang lemah lagi binasa, maka ia menjadi batil pula akibat terpengaruh dengan tujuan dan maksudnya yang batil. “Dan bahwasanya Allah Mahatinggi lagi Mahabesar.” Yang Mahatinggi dalam DzatNya, Dia Mahatinggi di atas segala makhlukNya, (Mahatinggi) dalam kemuliaanNya. Dia Mahasempurna dalam sifat-sifatNya, yang termasuk petunjuk keagungan dan kebesaranNya, bahwa bumi berada di GenggamanNya di Hari Kiamat, langit-langit terlipat-lipat di Tangan kananNya. Dan termasuk tanda kebesaranNya bahwa kursiNya telah memenuhi langit dan bumi. Termasuk pertanda keagungan dan kebesaranNya, bahwa ubun-ubun para hambaNya berada di TanganNya. Tidaklah mereka menjalankan apa ppun melainkan tergantung kehendakNYa, tidaklah mereka bergerak dan diam melainkan dengan iradahNya. Dan hakikat kibriya’ (kebesaran) Allah tidak di ketahui kecuali oleh Allah saja, tidak diketahui oleh malaikat terdekat, nabi yang diutus; yaitu setiap sifat kesempurnaan, kemuliaan, kebesaran dan keagungan. Sifat-sifat itu melekat pada Allah. Kepemilikan Allah terhadap sifat-sifat itu, adalah yang paling sempurna dari sifat-sifat itu. Di antara (indiikasi) kebesaranNya, bahwasanya seluruh ibadah yang berasal dari penghuni langit dan bumi secara keseluruhan, tujuannya untuk membesar-besarkan, mengagungkan, memuliakan, dan menghormatiNya. Untuk itu, takbir menjadi symbol bagi ibadah-ibadah yang utama seperti shalat dan ibadah lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 62: Dia senantiasa kekal dan tidak akan fana, Dia yang pertama di mana tidak ada sesuatu sebelum-Nya, dan Dia yang terakhir, di mana tidak ada sesuatu setelah-Nya, Dia sempurna nama dan sifat-Nya, benar janji-Nya, janji-Nya hak, pertemuan dengan-Nya adalah hak, agama-Nya adalah hak, beribadah hanya kepada-Nya adalah hak, Dia Yang Memberikan Manfaat dan Yang Kekal selalu. Dirinya batil dan menyembahnya pun batil. Dzat-Nya tinggi di atas semua makhluk-Nya, kedudukan-Nya tinggi, sifat-Nya sempurna, dan mengalahkan semua makhluk-Nya. Dia Mahabesar dzat-Nya, nama-Nya, sifat-Nya, di mana karena kebesaran dan keagungan-Nya bumi dalam genggaman-Nya pada hari kiamat, langit dilipat dengan Tangan Kanan-Nya. Karena kebesaran-Nya, kursi-Nya sampai meliputi langit dan bumi. Karena kebesaran-Nya, semua makhluk di bawah kekuasaan-Nya. Hakikat kebesaran yang tidak diketahui kecuali oleh-Nya adalah bahwa ia merupakan semua sifat sempurna, agung dan besar. Sifat yang dimiliki-Nya adalah sifat yang paling besar dan sempurna. Karena kebesaran-Nya, semua ibadah yang keluar dari penghuni langit maupun bumi tujuan-Nya adalah untuk membesarkan dan mengagungkan-Nya. Oleh karena itulah, takbir menjadi syiar terhadap ibadah-ibadah yang besar seperti shalat dan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 62",
    "description": "Demikianlah, Allah memperlihatkan kekuasaan-Nya memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam, karena Allah, dialah tuhan yang hak sehingga hanya dia yang ber-hak disembah. Dan sungguh apa saja yang mereka seru selain dia yang dianggap tuhan dan disembah, itulah tuhan dan persembahan yang batil, salah, sesat, dan jauh dari kebenaran; dan sungguh Allah, dialah yang mahatinggi dari semua tuhan-tuhan yang dianggap tinggi oleh manusia; mahabesar, kekuasaan-Nya atas segala sesuatu. 63. Tidakkah engkau memperhatikan fenomena alam semesta, termasuk siklus air yang terjadi dalam kehidupan kita, bahwa Allah menurunkan air hujan dari langit, kemudian sebagian air itu tersimpan pada pepohonan sehingga bumi menjadi hijau' sungguh, Allah mahahalus, kasih sayang-Nya dengan menyediakan oksigen dan protein nabati yang diperlukan seluruh makhluk hidup, maha mengetahui segala sesuatu, termasuk yang paling dibutuhkan mereka."
  }
]