[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu (wahai Rasul) belum mengetahui bahwa sesungguhnya Allah menurunkan hujan dari langit, kemudian permukaan tanah menjadi kehijauan dengan tumbuh-tumbuhan yang tumbuh padanya? Sesungguhnya Allah Maha Lembut terhadap hamba-hambaNya dengan mengeluarkan tanaman dari dalam tanah melalui air tersebut, juga Maha Mengetahui kemaslahatan-kemaslahatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Tidakkah engkau memperhatikan -wahai Rasul- bahwasanya Allah menurunkan air hujan dari langit sehingga setelah hujan bumi menjadi hijau lantaran tumbuhnya tetumbuhan di atasnya, Sungguh Allah Maha Lembut terhadap hamba-hamba-Nya di mana Dia menurunkan untuk mereka air hujan, dan menghijaukan bumi bagi mereka, dan Dia Maha Mengetahui akan maslahat mereka, tidak ada yang tersembunyi sedikit pun bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-64. Hai hamba Allah, tidakkah kamu mengetahui bahwa Allah telah menurunkan hujan dari awan, sehingga bumi memiliki permadani hijau, dan hujan itu menumbuhkan berbagai macam tanaman? Allah Maha Lembut terhadap hamba-hamba-Nya dan Maha Mengetahui mereka. Milik-Nya segala yang ada di tujuh langit dan bumi, dan Allah Maha Kaya terhadap segala sesuatu dan Maha Terpuji dalam setiap keadaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. أَلَمْ تَرَ أَنَّ اللهَ أَنزَلَ مِنَ السَّمَآءِ مَآءً فَتُصْبِحُ الْأَرْضُ مُخْضَرَّةً ۗ (Apakah kamu tiada melihat, bahwasanya Allah menurunkan air dari langit, lalu jadilah bumi itu hijau?) Karena tumbuhan yang tumbuh di bumi. إِنَّ اللهَ لَطِيفٌ(Sesungguhnya Allah Maha Halus) Ilmu-Nya sampai pada segala sesuatu yang paling kecil atau yang paling besar. خَبِيرٌ (lagi Maha Mengetahui) Mengetahui apa yang sesuai bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Apakah kamu tidak melihat, bahwasanya Allah menurunkan air hujan dari langit, (baca: segala yang lebih tinggi dari bintang-bintang) lalu jadilah bumi itu hijau dengan tumbuhan? Sesungguhnya Allah Maha Halus kepada hamba-Nya lagi Maha Mengetahui dengan segala kedetailan dan kemahatinggian-Nya. Maha Tahu atas segala kejadian yang zahir maupun batin, niat maupun kondisi nyata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan bahwa Allah menurunkan air dari langit sehingga bumi menjadi hijau} menjadi hijaau dengan tanaman-tamaman {Sesungguhnya Allah Maha lembut lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Ini adalah himbauan dariNya dan anjuran untuk menyaksikan tanda-tanda kekuasaanNya yang menandakan keesaan dan kesempurnaanNya. Allah berfirman, “Apakah kamu tidak melihat,” maksudnya tidakkah engkau menyaksikan dengan pandanganmu dan mata hatimu “bahwasanya Allah menurunkan air dari langit,” yaitu hujan. Ia turun di tanah keras lagi tandus, seluruh sisinya telah tertutupi oleh debu, tanaman dan pepohonan yang berada di atasnya telah mengering sehingga menjadi kehijau-hijauan. Telah terhiasi dengan segala tanaman yang berpasangan lagi menarik. Maka, muncullah panorama yang memikat darinya. Sesungguhnya Dzat yang menghidupkannya setelah kematian dan kegersangannya adalah Dzat yang benar-benar berkuasa menghidupkan orang-orang yang mati pasca perubahan mereka menjadi debu-debu. “Sesungguhnya Allah Mahahalus lagi Maha Mengetahui,” yang mengetahui kandungan-kandungan segala sesuatu yang tersembunyi, rinciannya dan rahasia-rahasianya yang mendatangkan kebaikan kepada para hambaNya, mengenyahkan kejelekan dari mereka melalui cara-cara yang lembut yang tidak terdeteksi oleh manusia. Di antara tanda kelembutanNya bahwa Allah memperlihatkan kekuatanNya saat melakukan pembalasan (kepada para hambaNya yang durhaka), dan kesempurnaan kekuasaanNya, selanjutnya mempertontonkan kelembutanNya setelah seorang hamba merasa berada di ujung kebinasaan. Tanda kelembutan Allah (lainnya) bahwa Dia mengetahui tempat-tempat sumber hujan di bumi ini dan benih-benih yang tertanam di dalamnya. Maka Dia mengarahkan air ke tempat benih-benih itu yang tidak terjangkau oleh makhluk-makhluk. Dari situ, tumbuhlah berbagai macam tumbuh-tumbuhan. “Maha Mengetahui,” rahasia-rahasia dari berbagai perkara, misteri-mmisteri hati dan teka-teki permasalahan-permasalahan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 63: Ayat ini merupakan dorongan dari Allah Ta'ala agar hamba-hamba-Nya memperhatikan ayat-ayat-Nya yang menunjukkan keesaan-Nya dan kesempurnaan. Dengan mata kepalamu dan mata hatimu. Allah menurunkan air hujan ke tanah yang gersang, lalu tanah itu menjadi hijau dan pemandangannya indah. Sesungguhnya yang mampu menghidupkan tanah yang mati benar-benar berkuasa menghidupkan orang yang telah mati. Allah mengetahui bagian dalam sesuatu serta yang samarnya, Dia memberikan kebaikan kepada hamba dan menghindarkan keburukan dengan cara-cara yang halus lagi tersembunyi bagi hamba. Di antara kelembutan-Nya adalah Dia menampakkan kepada hamba-Nya keperkasaan-Nya dalam memberikan hukuman dan sempurnanya kekuasaan-Nya, kemudian kelembutan-Nya akan nampak setelah seorang hamba hampir binasa. Di antara kelembutan-Nya juga adalah Dia mengetahui tempar-tempat untuk diturunkan hujan dan Dia mengetahui di mana tempat benih-benih yang berada di perut bumi, lalu Dia arahkan air itu ke benih tersebut sehingga tumbuhlah berbagai tumbuhan yang indah. Yang ada dalam hati mereka ketika mereka menanti turunnya hujan, Dia mengetahui rahasia segala urusan dan yang disembunyikan dalam dada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 63",
    "description": "Tidakkah engkau memperhatikan fenomena alam semesta, termasuk siklus air yang terjadi dalam kehidupan kita, bahwa Allah menurunkan air hujan dari langit, kemudian sebagian air itu tersimpan pada pepohonan sehingga bumi menjadi hijau' sungguh, Allah mahahalus, kasih sayang-Nya dengan menyediakan oksigen dan protein nabati yang diperlukan seluruh makhluk hidup, maha mengetahui segala sesuatu, termasuk yang paling dibutuhkan mereka. 64. Oleh karena itu, Allah benar-benar tuhan yang mengelola dan maha berkuasa atas jagat raya. Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi sehingga tidak satu pun peristiwa yang terjadi di keduanya di luar kekuasaan-Nya. Dan Allah benar-benar mahakaya, karena dia pemilik mutlak langit dan bumi dengan segala isinya, maha terpuji, karena dia sangat lembut kepada makhluk-Nya dan sangat teratur ciptaan-Nya."
  }
]