[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kepunyaan Allah semua yang ada di langit dan di bumi dalam hal penciptaan, kepemilikan dan penghambaan diri mereka. Semuanya membutuhkan pengaturan dan curahan karuniaNYa. Dan sesungguhnya Allah benar-benar Yang Maha Kaya Yang tidak membutuhkan sesuatu pun, lagi Maha Terpuji dalam seluruh keadaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Milik-Nya lah segala apa yang ada di langit dan di bumi, dan sesungguhnya Allah Maha Kaya yang tidak memerlukan bantuan seorang pun dari makhluk-Nya, lagi Maha Terpuji dalam segala keadaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. أَلَمْ تَرَ أَنَّ اللهَ أَنزَلَ مِنَ السَّمَآءِ مَآءً فَتُصْبِحُ الْأَرْضُ مُخْضَرَّةً ۗ (Apakah kamu tiada melihat, bahwasanya Allah menurunkan air dari langit, lalu jadilah bumi itu hijau?) Karena tumbuhan yang tumbuh di bumi. إِنَّ اللهَ لَطِيفٌ(Sesungguhnya Allah Maha Halus) Ilmu-Nya sampai pada segala sesuatu yang paling kecil atau yang paling besar. خَبِيرٌ (lagi Maha Mengetahui) Mengetahui apa yang sesuai bagi hamba-hamba-Nya. 64. لَّهُۥ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۗ (Kepunyaan Allah-lah segala yang ada di langit dan segala yang ada di bumi) Allah yang menciptakan, memiliki, dan mengatur segalanya; dan semuanya butuh terhadap rezeki-Nya. وَإِنَّ اللهَ لَهُوَ الْغَنِىُّ (Dan sesungguhnya Allah benar-benar Maha Kaya) Sehingga tidak butuh terhadap apapun. الْحَمِيدُ (lagi Maha Terpuji) Berhak atas pujian dalam segala keadaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Kepunyaan Allah-lah segala yang ada di langit dan segala yang ada di bumi, makhluk maupun kerajaan. Sesungguhnya Allah benar-benar Maha Kaya pada Dzat-Nya atas segala sesuatu sehingga tidak membutuhkan siapapun, lagi Maha Terpuji dan berhak dipuji atas segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah apa yang ada di langit dan apa yang ada di bumi. Sesungguhnya Allah benar-benar Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Kepunyaan Allah-lah segala yang ada di langit,” dan (apa yang ada) di bumi sebagai makhluk ciptaan dan hambaNya. Allah menetapkan apa saja pada mereka dengan kekuasaan, hikmah, dan kesempurnaan kemampuanNya. Tidak ada seorang pun yang memiliki wewenang pengaturan sedikit pun. “Dan sesungguhnya Allah benar-benar Mahakaya,” dengan DzatNya, yang mempunyai kekayaan mutlak lagi sempurna dari segala sisi. Pertanda kekayaanNya bahwa Dia tidak memerlukan (bantuan) siapa pun dari makhlukNya, tidak mengangkat mereka sebagai pembela karena kehinaan, dan tidak ingin terlihat banyak dalam pandangan mereka karena memiliki sedikit (miskin). Di antara bukti kekayaanNya, Allah tidak memiliki istri tempat bergantung, tidak makan dan tidak minum, dan tidak membutuhkan seperti apa yang dibutuhkan oleh makhluk dari sisi apa pun. Dia-lah yang memberikan makanan, tanpa diberi makan (oleh siapa pun). Di antara kekayaanNya bahwa seluruh makhluk membutuhkanNYa dalam penciptaan, perkembangan dan dukungan serta dalam masalah agama dan duniawi mereka. Termasuk tanda kekayaanNya bahwa andai seluruh penghuni langit dan bumi, baik yang masih hidup ataupun yang sudah mati berada di satu tanah lapang, masing-masing memanjatkan permohonan apa yang mereka angan-angankan, kemudian Allah memberi mereka lebih dari apa yang mereka harapkan, maka ini tidak mengurangi kekuasaanNya sedikit pun. Tanda kekayaanNya yang lain bahwa Tangan Allah selalu terbuka dengan kebaikan dan keberkahan, malam dan siang hari. Kemurahan Allah senantiasa tercurah pada mahkluk-makhluk. Pertanda kekayaan dan kemurahanNya adalah sesuatu yang Dia sediakan di tempat kemuliaanNya (surge) berupa kenikmatan-kenikmatan yang tidak pernah terlihat oleh pandangan mata, belum terdengar oleh telinga dan tidak pernah terbetik di hati orang. “Lagi Maha Terpuji,” yang terpuji pada DzatNya, nama-nama dan sifat-sifatNYa, karena nama-namaNya mengandung keindahan dan sifat-sifatNya seluruhnya merupakan kesempurnaan, dan (terpuji) pada perbuatan-perbuatanNya, karena berporos pada keadilan, curahan kebaikan dan rahmat serta hikmah. Dan (terpuji) karena aturan syariatNya, lantaran tidaklah Dia memerintahkan melainkan pasti karena sesuatu yang berisi kerusakan total atau dominan unsur kerusakannya. BagiNya pujian yang memenuhi tempat-tempat di langit dan bumi, dan tempat yang terletak antara keduanya dan tempat-tempat lain yang dikehendaki olehNya, yang bentuk pujian-pujian bagiNya tidak dapat dihitung oleh para hambaNya. Akan tetapi Dia sesuai dengan pujian yang Dia sampaikan untuk DiriNya dan lebih tinggi dari sanjungan yang diungkapkan oleh para hambaNya. Dia terpuji atas pemberian taufik kepada orang-orang yang Allah limpahi kemudahan, dan (terpuji) atas penetapan kesesatan bagi orang yang Allah terlantarkan. Dia Mahakaya pada sanjunganNya dan Yang Maha Terpuji pada kekayaanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 64: Yakni ciptaan-Nya dan hamba-Nya. Dia mengatur mereka dengan kekuasaan-Nya, hikmah-Nya dan sempurnanya kekuasaan-Nya. Dia Mahakaya dari berbagai sisi. Di antara kekayaan-Nya adalah, bahwa Dia tidak butuh kepada seorang pun di antara makhluk-Nya. Di antara kekayaan-Nya pula adalah, bahwa Dia tidak memiliki seorang istri maupun anak. Di antara kekayaan-Nya adalah Dia adalah Ash Shamad, Dia tidak makan dan tidak minum serta tidak membutuhkan sesuatu pun yang dibutuhkan makhluk, Dia memberi makan dan tidak diberi makan. Di antara kekayaan-Nya adalah semua makhluk butuh kepada-Nya, butuh diwujudkan, butuh diberikan kesiapan untuk menjalani hidup dan butuh diberi pertolongan. Di antara kekayaan-Nya adalah kalau seandainya semua orang yang ada di langit dan yang ada di bumi yang hidup maupun yang telah mati berkumpul di suatu tempat, lalu masing-masing mereka meminta kebutuhannya, kemudian Dia memberikan, maka tidaklah berkurang apa yang ada di sisi-Nya kecuali seperti jarum dimasukkan ke tengah lautan lalu diangkat, yakni tidak berkurang sama sekali. Dia selalu memberi nikmat dan karunia di malam dan siang hari, dan di antara kekayaan-Nya adalah Dia menyiapkan di surga sesuatu yang belum pernah terlihat oleh mata, terdengar oleh telinga dan belum pernah terlintas di hati manusia. Dia Maha Terpuji dzat-Nya, nama-Nya karena semuanya indah dan sifat-Nya karena semuanya sifat sempurna. Dia terpuji pula perbuatan-Nya karena berjalan di antara keadilan dan ihsan, rahmat dan hikmah (kebijaksanaan). Dia terpuji pula dalam syariat yang ditetapkan-Nya karena Dia tidak memerintahkan kecuali yang di sana terdapat maslahat saja atau lebih besar maslahatnya, dan tidaklah melarang kecuali karena di dalamnya terdapat mafsadat saja atau lebih besar mafsadatnya. Dia berhak mendapatkan pujian yang memenuhi langit dan bumi dan apa yang di antara keduanya dan apa yang Dia kehendaki setelahnya, di mana semua hamba tidak dapat menjumlahkan pujian untuk-Nya, bahkan Dia sebagaimana pujian-Nya untuk Diri-Nya dan di atas pujian hamba untuk-Nya. Dia Maha Terpuji karena taufiq yang diberikan-Nya dan karena dibiarkan-Nya orang yang dibiarkan-Nya, Dia Maha Kaya di tengah pujian untuk-Nya dan Maha Terpuji di tengah Mahakaya-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 64",
    "description": "Oleh karena itu, Allah benar-benar tuhan yang mengelola dan maha berkuasa atas jagat raya. Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi sehingga tidak satu pun peristiwa yang terjadi di keduanya di luar kekuasaan-Nya. Dan Allah benar-benar mahakaya, karena dia pemilik mutlak langit dan bumi dengan segala isinya, maha terpuji, karena dia sangat lembut kepada makhluk-Nya dan sangat teratur ciptaan-Nya. 65. Disamping mengajak nabi untuk memperhatikan dan memikirkan proses turunnya hujan dari langit, Allah juga mengajak nabi untuk memperhatikan kekuasaan-Nya yang lain dengan bertanya, \"tidakkah engkau, Muhammad, memperhatikan dengan nalar dan kalbu bahwa Allah menundukkan bagimu, manusia, apa yang ada di perut bumi, maupun yang di permukaannya, di darat maupun laut, berbagai jenis hewan, tumbuh-tumbuhan, dan berbagai jenis makhluk hidup bagi kepentingan kamu. Dan apakah kamu tidak memperhatikan kapal yang berlayar di lautan, terapung meskipun membawa beban yang berat menempuh jarak ribuan mil dengan mematuhi perintah-Nya, hukum alam ciptaan Allah' dan, apakah kamu tidak memperhatikan bahwa dia, Allah, menahan benda-benda langit, matahari, bulan, bintang, dan berbagai planet agar tidak jatuh ke bumi, yang akan menghancurkan kehidupan manusia, kecuali dengan izin-Nya' sungguh, Allah maha penyantun kepada seluruh makhluk, maha penyayang kepada manusia yang beriman dengan memasukkan mereka ke dalam surga."
  }
]