[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu memperhatikan bahwa sesungguhnya Allah telah menundukkan bagi kalian semua yang ada di muka bumi dari berbagai macam binatang, hewan ternak, tanam-tanaman, buah-buahan dan benda-benda mati untuk di gunakan sebagai tunggangan kalian, makanan kalian dan manfaat-manfaat lain bagi kalian. Sebagaimana Dia telah menundukkan kapal-kapal bagi kalian, yang berlayar di permukaan laut dengan kuasa dan perintah Allah. kapal-kapal itu mengangkut kalian beserta barang-barang bawaan kalian ke tempat mana saja yang kalian kehendaki dari negeri-negeri dan tempat tujuan. Dia- lah juga yang menahan langit lalu memeliharanya sehingga tidak roboh ke bumi sehingga akan membinasakan semua yang ada padanya kecuali dengan kehendak Allah untuk itu? Sesungguhnya Allah Maha Pengasih lagi Penyayang terhadap sekalian manusia dengan kasih sayang yang luas di dunia maupun di akhirat, dan diantara bertuk kasih sayangNya adalah dengan segala sesuatu yang ditundukanNya bagi mereka dari berbagai hal ini dan lainnya, sebagai karunia dariNya bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Tidakkah engkau memperhatikan -wahai Rasul- bahwasanya Allah telah menundukkan bagimu dan bagi manusia segala apa yang ada di muka bumi berupa hewan, dan benda-benda agar kalian mendapatkan manfaat darinya dan memenuhi kebutuhan kalian. Dia juga menundukkan bagi kalian kapal-kapal yang berlayar di lautan dengan perintah dan pengaturan-Nya yang berpindah dari suatu negeri ke negeri lainnya. Dan Dia menahan benda-benda langit agar tidak jatuh ke bumi kecuali dengan izin-Nya, seandainya Dia mengizinkan langit untuk jatuh ke bumi niscaya ia akan jatuh seketika, sungguh Allah Maha Pengasih lagi Penyayang kepada manusia yang telah menundukkan segala apa yang ada di bumi ini bagi mereka meskipun mereka berbuat kezaliman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Hai manusia, tidakkah kamu mengetahui bahwa Allah telah menundukkan bagi kalian hewan dan tumbuh-tumbuhan yang ada di bumi, dan menundukkan kapal yang berlayar di lautan dengan perintah-Nya, dan Allah yang menahan dan menjaga langit agar tidak jatuh ke bumi, kecuali jika Allah menghendaki? Allah memiliki kelembutan yang agung dan rahmat yang luas bagi seluruh manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. أَلَمْ تَرَ أَنَّ اللهَ سَخَّرَ لَكُم مَّا فِى الْأَرْضِ (Apakah kamu tiada melihat bahwasanya Allah menundukkan bagimu apa yang ada di bumi) Berupa binatang-binatang, pepohonan, dan sungai-sungai; Allah menciptakan semuanya untuk mereka manfaatkan. وَالْفُلْكَ(dan bahtera yang berlayar) Yakni Allah juga menundukkan bagi kalian kapal-kapal yang berlayar di lautan. وَيُمْسِكُ السَّمَآءَ أَن تَقَعَ عَلَى الْأَرْضِ (Dan Dia menahan (benda-benda) langit jatuh ke bumi) Hal itu karena Allah menciptakannya dalam keadaan tetap kokoh. إِنَّ اللهَ بِالنَّاسِ لَرَءُوفٌ رَّحِيمٌ (Sesungguhnya Allah benar-benar Maha Pengasih lagi Maha Penyayang kepada Manusia) Yakni memiliki banyak kasih sayang dan rahmat sehingga Allah menundukkan hal-hal tersebut bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Apakah kamu tidak melihat bahwasanya Allah menundukkan hewan dan tumbuhan yang ada di bumi dan bahtera yang berlayar di lautan dengan perintah-Nya untuk kemanfaatanmu. Dia menahan benda-benda langit jatuh ke bumi, melainkan dengan izin dan kekuasaan-Nya? Sesungguhnya Allah benar-benar Maha Pengasih lagi Maha Penyayang dan Luas Rahmat kepada Manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan bahwa Allah menundukkan} menundukkan {bagi kalian apa yang ada di bumi dan kapal} dan menundukkan untuk kalian bahtera {yang berlayar di laut dengan perintahNya. Dia menahan langit sehingga tidak jatuh} agar tidak jatuh {ke bumi, kecuali dengan izinNya. Sesungguhnya Allah benar-benar Maha Penyantun lagi Maha Penyayang kepada manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Maksudnya, tidakkah engkau menyaksikan kenikmatan Rabbmu yang melimpah-ruah dan karuniaNya yang luas dengan pandangan matamu dan mata hatimu, dan “bahwasanya Allah menundukkan bagimu apa yang ada di bumi,” berupa binatang-binatang, tumbuhan dan benda-benda padat yang tak bernyawa. Seluruh obyek yang berada di bumi, ditundukkan untuk anak keturunan Adam. Hewan-hewannya untuk ditunggangi, dibebani dan digunakan menjalankan tugas-tugasnya serta untuk dikonsumsi dan kegunaan-kegunaan lain yang variatif. Sementara tumbuh-tumbuhan dan buah-buahnya untuk dinikmati. Sungguh Allah telah memberikan kekuasaan untuk dapat menanam dan memanfaatkannya. Dan sumber-sumber pertambangan yang dapat dia eksplorasi dan nikmati manfaatnya. “Dan bahtera,” maksudnya dan telah Kami tundukkan bahtera, yaitu kapal-kapal bagi kalian, “yang berlayar di lautan dengan perintahNya,” yang mengangkut kalian dan barang-barang perniagaan yang kalian miliki, mengantarkan kalian dari suatu wilayah ke wilayah lain. Dan kalian bisa mengeksplorasi perhiasan dari lautan yang kalian pakai. Dan sebagian dari pertanda rahmat Allah pada kalian adalah, “Dia menahan (benda-benda) langit jatuh ke bumi,” seandainya tidak ada curahan rahmat dan kekuasaan dariNya, niscaya langit akan jatuh runtuh di atas bumi, sehingga hancurlah segala sesuatu yang berada di permukaannya dan binasaalah penghuninya. Allah berfirman, \"Sesungguhnya Allah menahan langit dan bumi supaya jangan lenyap; dan sungguh jika keduanya akan lenyap tidak ada seorang pun yang dapat menahan keduanya selain Allah. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun\" (Fathir:41). “Sesungguhnya Allah benar-benar Maha Pengasih lagi Maha Penyayang,” lebih mengasihi mereka daripada orang tua mereka dan diri mereka sendiri. Untuk itu, Allah menginginkan kebaikan bagi mereka. Sedangkan mereka justru berminat meraih kejelekan dan bahaya bagi jiwa-jiwa mereka. Dan bukti rahmat Allah lainnya bahwa Dia mengerahkan semua ini bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 65: Dengan mata dan hatimu nikmat Tuhanmu yang banyak dan karunia-Nya yang luas. Seperti makhluk hidup, tumbuhan, benda mati dan semua yang ada di muka bumi. Semuanya ditundukkan untuk manusia agar mereka dapat memanfaatkannya baik dengan ditunggangi, dibawa, dimakan, dikelola, dsb. Perahu itu dapat mengangkut kamu dan mengangkut barang-barang kamu serta menyampaikan kamu ke tempat yang jauh, dan kamu dapat mengeluarkan dari lautan berbagai perhiasan yang dapat kamu pakai. Demikian pula benda-benda langit. Jika tidak ditahan-Nya tentu manusia akan binasa. Yang demikian merupakan rahmat Allah kepada manusia. Dalam hal menundukkan semua yang ada di bumi untuk manusia dan menahan langit dan benda-bendanya agar tidak jatuh menimpa manusia. Sesungguhnya Allah Maha Pengasih lagi Maha Penyayang kepada manusia, di mana Dia lebih Penyayang kepada mereka daripada ibu bapak mereka dan diri mereka sendiri. Oleh karena itulah, Dia menginginkan kebaikan untuk mereka, tidak membiarkan mereka kebingungan, bahkan mengutus rasul dan menurunkan kitab agar mereka tidak salah jalan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 65",
    "description": "Disamping mengajak nabi untuk memperhatikan dan memikirkan proses turunnya hujan dari langit, Allah juga mengajak nabi untuk memperhatikan kekuasaan-Nya yang lain dengan bertanya, \"tidakkah engkau, Muhammad, memperhatikan dengan nalar dan kalbu bahwa Allah menundukkan bagimu, manusia, apa yang ada di perut bumi, maupun yang di permukaannya, di darat maupun laut, berbagai jenis hewan, tumbuh-tumbuhan, dan berbagai jenis makhluk hidup bagi kepentingan kamu. Dan apakah kamu tidak memperhatikan kapal yang berlayar di lautan, terapung meskipun membawa beban yang berat menempuh jarak ribuan mil dengan mematuhi perintah-Nya, hukum alam ciptaan Allah' dan, apakah kamu tidak memperhatikan bahwa dia, Allah, menahan benda-benda langit, matahari, bulan, bintang, dan berbagai planet agar tidak jatuh ke bumi, yang akan menghancurkan kehidupan manusia, kecuali dengan izin-Nya' sungguh, Allah maha penyantun kepada seluruh makhluk, maha penyayang kepada manusia yang beriman dengan memasukkan mereka ke dalam surga. 66. Allah tidak hanya menjadikan alam sebagai fasilitas bagi hidup dan kehidupan manusia dan menahan benda-benda langit agar tidak berjatuhan, tetapi juga menegaskan, 'dan dia-lah yang menghidupkan kamu dengan meniupkan roh ke dalam dirimu, ketika kamu masih berupa janin, lalu kamu tumbuh dan berkembang; kemudian mematikan kamu dengan mencabut roh dari diri kamu, kemudian menghidupkan kamu kembali dalam kehidupan baru pada hari kebangkitan. Sungguh, manusia itu sangat kufur dan menutup diri dari nikmat Allah."
  }
]