[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia –lah Allah Yang menghidupkan kalian dan mengadakan wujud kalian setelah sebelumnya tidak ada, kemudian mematikan kalian sesudah habisnya jatah usia kalian, kemudian menghidupkan kalian (kembali) dengan membangkitkan kembali setelah kematian, untuk menghitung amal perbuatan kalian. Sesungguhnya manusia itu benar-benar makhluk yang sangat ingkar terhadap bukti-bukti nyata yang menunjukkan Kuasa dan Keesaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Dan Dia lah Allah yang menghidupkan kalian, menjadikan kalian setelah sebelumnya kalian tidak ada, kemudian mematikan kalian setelah ajal kalian tiba, kemudian menghidupkan kalian kembali setelah mati supaya Dia menghisab amal perbuatan kalian dan membalaskannya, namun sungguh manusia itu sangat ingkar terhadap nikmat Allah dengan menyekutukan-Nya padahal nikmat-nikmat itu sangat menampakkan kebesaran Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Dan Allah yang menghidupkan kalian dari ketidakadaan, kemudian mematikan kalian saat ajal kalian telah tiba, lalu menghidupkan kembali di akhirat ketika hari kebangkitan. Sungguh manusia sangat ingkar terhadap kenikmatan-kenikmatan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. وَهُوَ الَّذِىٓ أَحْيَاكُمْ (Dan Dialah Allah yang telah menghidupkan kamu) Yang sebelumnya kalian hanyalah benda mati. ثُمَّ يُمِيتُكُمْ(kemudian mematikan kamu) Saat umur kalian telah habis. ثُمَّ يُحْيِيكُمْ ۗ( kemudian menghidupkan kamu (lagi)) Saat membangkitkan kalian untuk perhitungan dan pembalasan. إِنَّ الْإِنسٰنَ لَكَفُورٌ(sesungguhnya manusia itu, benar-benar sangat mengingkari nikmat) Yakni sangat ingkar terhadap nikmat-nikmat Allah kepadanya, padahal nikmat-nikmat tersebut sangat jelas. Termasuk pula keingkaran mereka terhadap kekuasaan Allah untuk menghidupkan orang yang telah mati, padahal ia mengetahui bahwa dirinya awalnya tidak ada kemudian Allah menciptakannya sebagai manusia yang sempurna bentuknya, lalu ia tumbuh dengan kenikmatan dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Dialah Allah yang telah menghidupkan kamu dengan menjadikan kamu tumbuh setelah dalam bentuk keras yaitu unsur mani, kemudian mematikan kamu ketika ajalmu selesai, kemudian menghidupkan kamu lagi pada hari kebangkitan, sesungguhnya manusia itu, benar-benar sangat mengingkari nikmat ketika tidak mengesakan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Dzat yang menghidupkan kalian, kemudian mematikan kalian, kemudian menghidupkan kalian lagi. Sesungguhnya manusia itu benar-benar sangat ingkar} sungguh menyangkal nikmat-nikmat Allah beserta segala perwujudan nikmatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. “Dan Dia-lah Allah yang telah menghidupkan kamu,” mengadakan wujud kalian dari ketiadaan. “Kemudian mematikan kamu,” sesudah Dia menghidupkan kalian. “Kemudian menghidupkan kamu (lagi),” pasca kematian kalian; supaya Allah membalasi orang yang berbuat jelek atas dasar ulah buruknya. “Sesungguhnya manusia itu,” maksudnya bangsa manusia kecuali yang Allah pelihara, “benar-benar sangat mengingkari nikmat,” maksudnya kenikmatan-kenikmatan Allah, mereka sungguh-sungguh mengkufuri Allah dan tidak mengakui curahan kebaikanNYa. Bahkan terkadang mengingkari Hari Kebangkitan dan kekuasaan Rabbnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 66: Ketika sudah tiba ajalmu. Agar Dia memberikan balasan kepada kamu. Kecuali orang yang dijaga Allah Subhaanahu wa Ta'aala. Ia kufur terhadap nikmat, kufur kepada Allah, tidak mengetahui ihsan-Nya, bahkan ada yang kafir kepada kebangkitan dan kekuasaan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 66",
    "description": "Allah tidak hanya menjadikan alam sebagai fasilitas bagi hidup dan kehidupan manusia dan menahan benda-benda langit agar tidak berjatuhan, tetapi juga menegaskan, 'dan dia-lah yang menghidupkan kamu dengan meniupkan roh ke dalam dirimu, ketika kamu masih berupa janin, lalu kamu tumbuh dan berkembang; kemudian mematikan kamu dengan mencabut roh dari diri kamu, kemudian menghidupkan kamu kembali dalam kehidupan baru pada hari kebangkitan. Sungguh, manusia itu sangat kufur dan menutup diri dari nikmat Allah. 67. Bagi setiap umat, seperti yahudi dan nasrani, telah kami tetapkan melalui para utusan Allah cara beribadah yang harus mereka amalkan guna mendekatkan diri kepada-Nya. Maka tidak sepantasnya mereka, kaum yahudi dan nasrani, berbantahan dengan engkau, Muhammad, dalam urusan cara beribadah kepada Allah ini; dan serulah kaum yahudi dan nasrani itu kepada tuhanmu untuk beriman kepada Al-Qur'an. Sungguh, engkau Muhammad, berada di jalan yang lurus, baik dalam bidang akidah, ibadah (syariah), maupun akhlak."
  }
]