[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi umat-umat yang telah berlalu, Kami menjadikan aturan syariat dan tata cara peribadahan yang Kami perintahkan untuk mereka laksanakan. Kemudia mereka melaksanakannya. Maka janganlah kaum musyrikin Quraisy sampai membantahmu (wahai Rasul) dalam urusan ajaran syariat agamamu dan hal-hal yang Allah memerintahkanmu dalam manasik haji dan jenis-jenis ibadah lain secara keseluruhan. Dan serulah (manusia) menuju pengesaan Tuhanmu dan pemurnian ibadah hanya bagiNya dan mengikuti perintahNYa. Sesungguhnya kamu itu berada di atas ajaran agama yang lurus, yang tidak ada kebengkokan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Bagi setiap pemeluk agama telah Kami tetapkan syariat tertentu, mereka beramal sesuai syariat mereka masing-masing, maka janganlah orang-orang musyrik dan pemeluk agama lain itu berbantahan dengan dirimu wahai Rasul mengenai urusan syariatmu, sebab engkau lebih pantas berada di atas kebenaran dibanding mereka, karena mereka adalah pengusung kebatilan. Dan serulah manusia agar memurnikan tauhid kepada Allah, sungguh engkau berada di jalan lurus, yang tidak menyimpang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67-69. Kami menetapkan bagi setiap umat syariat dan ibadah yang mereka kerjakan, maka tidak ada seorang musyrikpun yang dapat menentangmu dalam perkara agama. Dan serulah manusia agar menyembah Allah semata. Hai Nabi, kamu sungguh di atas agama yang lurus yang dapat mengantarkan ke surga yang penuh dengan kenikmatan. Dan jika orang-orang musyrik menentangmu, maka katakanlah kepada mereka: “Allah lebih mengetahui amalan kalian, dan pada hari kiamat Dia akan memutuskan perkara agama yang kalian dan orang-orang beriman perselisihkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. لِّكُلِّ أُمَّةٍ جَعَلْنَا مَنسَكًا (Bagi tiap-tiap umat telah Kami tetapkan syari’at tertentu) Yakni bagi setiap umat Kami tetapkan syariat khusus sehingga setiap umat tidak melampaui syariat yang khusus baginya dengan melakukan syariat umat lain. هُمْ نَاسِكُوهُ ۖ( yang mereka lakukan) Yakni umat tersebutlah yang menjalankan syariatnya; Taurat adalah syariat bagi umat yang ada sejak diutusnya Nabi Musa sampai diutusnya Nabi Isa, Injil adalah syariat uamt yang ada sejak diutusnya Nabi Isa sampai diutusnya Nabi Muhammad, dan al-Qur’an adalah syariat bagi orang-orang Islam. Pendapat lain mengatakan makna (المنسك) adalah tempat pelaksanaan suatu ketaatan. Dan pendapat lain mengatakan maknanya adalah ibadah penyembelihan. فَلَا يُنٰزِعُنَّكَ فِى الْأَمْرِ ۚ( maka janganlah sekali-kali mereka membantah kamu dalam urusan (syari’at) ini) Ini merupakan suatu kewajiban bagi orang yang masih tersisa dari umat terdahulu untuk tidak menyelisihi Rasulullah dan ini merupakan keharusan bagi mereka dalam mentaati Rasulullah, sebab agama Islam adalah syariat yang dimulai sejak diutusnya Nabi Muhammad. وَادْعُ إِلَىٰ رَبِّكَ ۖ( dan serulah kepada (agama) Tuhanmu) Yakni serulah orang-orang yang membantahmu itu, atau serulah manusia kepada agama Allah dan kepada tauhid dan keimanan kepada-Nya. إِنَّكَ لَعَلَىٰ هُدًى مُّسْتَقِيمٍ (Sesungguhnya kamu benar-benar berada pada jalan yang lurus) Yakni jalan yang tidak bengkok."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Bagi tiap-tiap umat telah Kami tetapkan syari´at dan ibadah yang menjadi tanggung jawab mereka, dan yang mereka lakukan, maka janganlah sekali-kali mereka orang musyrik membantah kamu dalam urusan syari´at ini diantaranya urusan penyembelihan kurban dan serulah kepada pengesaan dan ibadah kepada Tuhanmu. Sesungguhnya kamu benar-benar berada pada jalan yang lurus. Ayat ini turun ketika musyrik Khaza’ah berkata: apakah kalian akan memakan hasil perang kalian dan tidak akan memakan hasil yang telah Allah menangkan untukmu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagi setiap umat} setiap pemeluk agama {telah Kami tetapkan syariat} syariat {yang amalkan} yang mereka amalkan {Mereka sekali-kali tidak boleh membantahmu dalam urusan itu} maka mereka tidak boleh membantahmu dalam perkara syariatmu {dan serulah kepada Tuhanmu. Sesungguhnya kamu benar-benar berada dalam petunjuk yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Allah memberitahukan bahwasanya Dia menjadikan bagi setiap umat manusia “syariat tertentu” maksudnya tempat ibadah dan cara peribadahan. Terkadang mengalami perbedaan di beberapa sisi, walaupun tetap memuat nuansa keadilan dan hikmah. Sebagaimana kandungan Firman Allah, \"Untuk tiap-tiap umat di antara kamu, Kami berikan aturan dan jalan yang terang. Sekiranya Allah menghendaki, niscaya kamu dijadikan-Nya satu umat (saja), tetapi Allah hendak menguji kamu terhadap pemberian-Nya kepadamu, maka berlomba-lombalah berbuat kebajikan. Hanya kepada Allah-lah kembali kamu semuanya, lalu diberitahukan-Nya kepadamu apa yang telah kamu perselisihkan itu,\" (Al-Maidah:48). “Yang mereka kerjakan,” maksudnya mereka mengamalkannya selaras dengan kondisi dan latar belakang mereka, sehingga tidak terjadi penentangan terhadap suatu syariat. Terutama dari kaum ‘ummi (yang buta huruf), dari kalangan masyarakat paganis dan jahiliyah yang sudah sangat nyata. Karena jika telah terbukti kebenaran risalah seorang rasul melalui dalil-dalil, maka wajib diterima seluruh ajaran yang ia bawa dengan tulus dan berserah diri, tanpa penolakan. Karena itu, Allah berfirman, “Maka janganlah sekai-kali mereka membantah kamu dalam urusan (syariat) ini,” maksudnya jangan sampai orang-orang yang mendustakan saling melancarkan penentangan kepadaMu, menampik sebagian ajaran yang engkau bawa dengan dorongan akal-akal mereka yang sudah rusak, seperti penentangan mereka dalam masalah penghalalan bangkai sambil berujar, “Kalian memakan binatang yang kalian sembelih, tetapi tidak sudi memakan binatang yang Allah matikan langsung?! Dan seperti pernyataan mereka, \"sessungguhnya jual beli itu seperti riba\" (Al-Baqarah:275),… dan lain sebagainya, yang berupa penolakan mereka yang tidak mesti disanggah satu persatu. Mereka pada dasarnya mengingkari risalah. Tidak perlu ditegakkan perdebatan dan adu argumentasi bagi masing-masing lontaran syubhat itu. Ada sikap khusus sesuai dengan situasi dan kondisi. Orang yang melontarkan sanggahan, lagi mengingkari risalah rasul, jika ia berdalih melakukan perdebatan untuk mendapat petunjuk, maka hendaklah disampaikan kepadanya: permasalahan kami denganmu berhubungan dengan ada tidaknya risalah. Apabila tidak demikian, maka merasa puas dengan perdebatan ini menjadi bukti bahwa tujuannya adalah untuk mempertontonkan penentangan dan usaha pembungkaman. Untuk itu, Allah memerintahkan RasulNya agar beliau menyerukan dakwah dengan sarat hikmah dan mau’izhah hasanah (nasihat yang baik) serta konsisten dengan metode pendekatan ini, baik mereka akan menghalang-halangi atau tidak. Dan seharusnya tidak boleh ada sesuatu pun yang membelokkan dirimu dari dakwah. Pasalnya, engkau berada “pada jalan yang lurus,” yaitu jalan yang tengah-tengah, yang mengantarkan menuju tujuan yang ingin digapai, yang sarat dengan ilmu kebenaran dan pengamalannya. Jadi, engkau telah berada di atas tumpuan kepercayaan terhadap urusan yang sedang engkau jalankan dan berpegang teguh atas keyakinan terhadap agamamu. Hal ini mengharuskan lahirnya sikap pantang menyerah pada dirimu dan terus bergerak melaksanakan perintah Rabbmu. Kamu tidaklah berada dalam perkara yang meragu-ragukan atau perkataan yang dusta, sehingga membuatmu mesti bercampur-baur bersama orang-orang, dan keinginan-keinginan serta pikiran-pikiran mereka sehingga penentangan mereka menghentikanmu. Senada dengan ini , Firman Allah, \"Sebab itu bertawakallah kepada Allah, sesungguhnya kamu berada di atas kebenaran yang nyata.\" (An-Naml:79). Kendatipun dalam Firman Allah, “sesungguhnya kamu benar-benar berada pada jalan yang lurus,” termuat petunjuk untuk mencounter orang-orang yang menyanggah beberapa point pada aturan syariat melalui daya nalar yang sehat. Karena al-huda (petunjuk) di sini merupakan gambaran bagi setiap ajaran yang dibawa oleh Rasululllah. Dan hakikat al-huda ialah segala sesuatu yang mendatangkan hidayah dalam masalah-masalah ushul (prinsipil) dan furu’ (cabang-cabang). Yang dimaksud adalah, perkara-perkara yang dapat didteksi sisi kebaikan, keadilan dan kebijaksanaannya melalui akal dan fitrah yang masih lurus. Hasil ini bisa diketahui dengan cara menyelami perintah-perintah dan larangan-larangan secara mendalam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 67: Yang berbeda-beda dalam sebagian masalah, namun asasnya sama yaitu tauhid (beribadah kepada Allah saja dan menjauhi sesembahan selain-Nya), dan masing-masing syariat sama-sama menyeru kepada keadilan dan kebijaksanaan. Yakni dalam masalah syariat, misalnya dalam penyembelihan, dengan mengatakan, “Apa yang dibunuh Allah (yakni mati sendiri) lebih berhak kamu makan daripada apa yang dibunuh kamu (dengan disembelih).”Atau seperti perkataan, “Jual beli sama dengan riba,” dsb. Orang yang suka membantah seperti ini jika maksudnya adalah hendak mencari petunjuk, maka perlu dikatakan kepadanya, “Pembicaraan ini tergantung apakah anda mempercayai risalah atau tidak? Jika tidak mempercayai, maka cukup sampai di sini dan berarti tujuan anda membantah adalah untuk melemahkan dan mencari-cari kesalahan.” Oleh karena itulah Allah memerintahkan Rasul-Nya untuk tetap mengajak manusia kepada agama-Nya dengan hikmah dan nasehat yang baik, dan tetap meneruskan dakwahnya baik mereka merintangi atau tidak, karena Beliau di atas jalan yang lurus yang sampai ke tempat tujuan. Sama dalam hal ini firman-Nya, “Sebab itu bertawakkallah kepada Allah, Sesungguhnya kamu berada di atas kebenaran yang nyata.” (Terj. An Naml: 79) Kalimat, “Sungguh, engkau (Muhammad) berada di jalan yang lurus” tedapat petunjuk agar menjawab orang-orang yang membantah Beliau tentang masalah syariat dengan akal, karena syariat sudah maklum baiknya, adil dan bijaksananya berdasarkan akal dan fitrah yang masih sehat, dan hal ini dapat diketahui dengan memikirkan perintah dan larangan yang rinci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 67",
    "description": "Bagi setiap umat, seperti yahudi dan nasrani, telah kami tetapkan melalui para utusan Allah cara beribadah yang harus mereka amalkan guna mendekatkan diri kepada-Nya. Maka tidak sepantasnya mereka, kaum yahudi dan nasrani, berbantahan dengan engkau, Muhammad, dalam urusan cara beribadah kepada Allah ini; dan serulah kaum yahudi dan nasrani itu kepada tuhanmu untuk beriman kepada Al-Qur'an. Sungguh, engkau Muhammad, berada di jalan yang lurus, baik dalam bidang akidah, ibadah (syariah), maupun akhlak. 68. Dan jika mereka, kaum yahudi dan nasrani, membantah engkau, Muhammad, ketika engkau mengajarkan tauhid yang lurus, ibadah yang sempurna, dan akhlak yang mulia; maka katakanlah kepada ahli kitab, yahudi dan nasrani yang membantah kamu itu, 'Allah lebih tahu tentang apa yang kamu kerjakan, ' karena Allah benar-benar mengetahui yang tampak maupun yang tersembunyi."
  }
]