[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memutuskan perkara di antara kaum muslimin dan orang-orang kafir pada hari kiamat perihal perselisihan dalam masalah agama. Dalam ayat ini terkandung satu etika luhur dalam membantah orang yang mengajak berdebat dalam rangka menampakkan penentangan dan kesombongannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Allah akan mengadili di antara semua hamba-Nya, baik orang mukmin ataupun orang kafir, pada hari Kiamat kelak tentang apa yang dahulu kalian perselisihkan dari perkara agama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. اللهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيٰمَةِ (Allah akan mengadili di antara kamu pada hari kiamat) Yakni antara orang-orang Islam dan orang-orang kafir. فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ(tentang apa yang kamu dahulu selalu berselisih) Yakni dalam urusan agama; sehingga kebenaran menjadi jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Allah akan mengadili kamu pada hari kiamat tentang apa yang kamu dahulu selalu perselisihkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah akan memutuskan di antara kalian pada hari kiamat tentang apa yang selalu kalian perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68-69. Karena itu, dalam kondisi seperti ini, Allah menitahkan mengurung diri untuk meladeni perdebatan mereka. Dia berfirman, “Dan jika mereka membantah kamu, maka katakanlah, ‘Allah lebih mengetahui tentang apa yang kamu kerjakan’,” maksudnya Dia Maha Mengetahui harapan-harapan yang ingin kalian capai dan niat-niat kalian. Dia akan memberikan balasannya kepada kalian di Hari Kiamat yang menjadi (momentum) bagi Allah untuk menetapkan keputusan (masalah yang terjadi) di antara kalian “tentang apa yang kamu dahulu selalu berselisih padanya.” Barangsiapa tepat berada di atas Shiratal mustaqim, maka dia termasuk penghuni Surga Na’im, dan barangsiapa membelok darinya, maka dia menjadi penghuni Neraka Jahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 69: Wahai orang mukmin dan orang kafir dengan ilmu-Nya, karena tidak ada satu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 69",
    "description": "Allah tidak hanya mengetahui perbuatan kamu yang tampak maupun yang tersembunyi, tetapi juga mengadili di antara kamu pada hari kiamat sehingga terungkap siapa yang salah dan siapa yang benar tentang apa yang dahulu, seperti waktu kamu hidup bersama rasulullah di madinah, kamu perselisihkan tentang kebenaran Al-Qur'an sebagai wahyu Allah dan kerasulan nabi Muhammad. 70. Tidakkah engkau, Muhammad, tahu dengan ilmu yakin bahwa Allah mengetahui apa yang di langit, seperti malaikat dan benda-benda langit, dan seluruh makhluk Allah yang berada di bumi, baik yang kasat mata maupun tersembunyi bagi manusia' sungguh, yang demikian itu bahwa Allah mengetahui secara detil dan terperinci semua ciptaan-Nya di la-ngit maupun di bumi, sudah terdapat dalam sebuah kitab induk yang tersimpan di lauh mahfuzh sesungguhnya yang demikian itu, tercatatnya data seluruh ciptaan Allah pada sebuah buku induk, sangat mudah bagi Allah, karena Allah tuhan yang memelihara seluruh alam."
  }
]