[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bahwasanya waktu kebangkitan makhluk setelah kematian itu akan tiba, tidak ada keraguan sedikit pun tentang itu, dan bahwasanya Allah akan membangkitkan orang-orang mati dari kubur-kubur mereka untuk memperhitungkan amal perbuatan mereka dan memberikan balasan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan agar kalian beriman bahwa hari Kiamat itu pasti akan datang, tidak ada keraguan tentang kedatangannya, dan bahwasanya Allah akan membangkitkan setiap orang mati dari kubur mereka untuk diberikan balasan atas amal perbuatan yang telah mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَأَنَّ السَّاعَةَ ءَاتِيَةٌ (dan sesungguhnya hari kiamat itu pastilah datang) Di waktu yang akan datang. لَّا رَيْبَ فِيهَا(tak ada keraguan padanya) Tanpa ada keraguan. وَأَنَّ اللهَ يَبْعَثُ مَن فِى الْقُبُورِ (dan bahwasanya Allah membangkitkan semua orang di dalam kubur) Kemudian Allah akan membalas amal perbuatan mereka; amal baik akan dibalas dengan kebaikan dan amal buruk akan dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Bahwa sesungguhnya hari kiamat itu pasti tanpa ada keraguan. Serta telah menjadi ketetapan/kepastian bahwa Allah membangkitkan semua orang di dalam kubur/kematian beserta burung, ikan, serta lainnya sesuai dengan janji-Nya tanpa ada bantahan sedikitpun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kiamat itu pasti datang, tidak ada keraguan di dalamnya dan sesungguhnya Allah akan membangkitkan siapa pun yang di dalam kubur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-7. Dua bukti kuat di atas menunjukkan lima perkara penting. Yaitu, berikut ini: “Yang demikian itu.” Dzat yang menciptakan manusia dari bahan yang sudah Allah sebutkan cirinya, dan menghidupkan bumi setelah kekeringannya “karena Allah, Dia-lah yang haq,” Rabb yang berhak diibadahi yang tidak sepantasnya ibadah diarahkan kepada selainNya. Ibadah kepadaNyalah yang merupakan tindakan benar. Sementara beribadah kepada selainNya merupakan bentuk kebatilan. “Dan bahwa Dia-lah yang menghidupkan segala yang mati,” sebagaimana Allah memulai penciptaan makhluk-makhlukNya dan menghidupkan bumi pasca kekeringannya “dan bahwa Allah Mahakuasa atas segala sesuatu,” sebagaimana Allah telah mempertontonkan kepada kalian bentuk kekuasaanNya yang special, dan ciptaanNya yang agung yang sudah kalian saksikan “dan bahwa Hari KIamat itu pastilah datang, taka da keraguan padanya.” Tidak ada alasan untuk menganggapnya musthil “dan bahwasanya Allah membangkitkan semua orang didalam kubur.” Dia akan membalasi kalian berdasarkan amalan-amalan kalian, yang baik dan yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 7: Tidak ada jalan untuk mengingkarinya. Kemudian akan memberikan balasan terhadap amal yang mereka kerjakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 7",
    "description": "Dan ketahuilah, wahai manusia, sesungguhnya hari kiamat itu pasti datang, meskipun Allah merahasiakan waktunya. Oleh karena itu, tidak ada keraguan padanya, karena kiamat itu ketetapan Allah; dan sungguh, pada hari kiamat itu Allah akan membangkitkan semua yang berada di dalam kubur untuk dikumpulkan di mahsyar. 8. Manusia ada yang bertindak melampaui batas. Allah menegaskan, bahwa di antara manusia ada yang berbantah tentang Allah, mengingkari agama-Nya, tidak meyakini kehidupan sesudah mati, dan tidak meyakini adanya akhirat tanpa ilmu yang benar dan meyakinkan, juga tanpa petunjuk dari Allah, dan tanpa sumber dari kitab wahyu yang disampaikan kepada para rasul yang memberi penerangan dari kegelapan."
  }
]