[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu mengetahui (wahai Rasul) bahwasanya Allah mengetahui segala yang ada di langit dan di bumi dengan pengetahuan yang sempurna, yang telah ditetapkanNya di dalam Lauhul Mahfuzh? Sesungguhnya pengetahuan tentang hal tersebut merupakan perkara ringan bagi Allah, yang tidak ada satu perkara pun dapat melemahkanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Tidakkah engkau tahu -wahai Rasul- bahwasanya Allah mengetahui segala apa yang ada di langit dan di bumi? tidak ada yang tersembunyi bagi-Nya segala sesuatu yang ada pada keduanya, ilmu tentang itu semua telah tertulis dalam Lauḥ Maḥfuẓ, dan untuk mengetahui semua itu sangat mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Hai hamba Allah, tidakkah kamu mengetahui bahwa Allah Maha Mengetahui segala yang ada di tujuh langit dan bumi? Ilmu itu telah tertulis dalam lauhul mahfuzh, dan itu adalah perkara yang mudah bagi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. أَلَمْ تَعْلَمْ (Apakah kamu tidak mengetahui) Yakni Wahai Muhammad, kamu telah mengetahui dan meyakini. أَنَّ اللهَ يَعْلَمُ مَا فِى السَّمَآءِ وَالْأَرْضِ ۗ( sesungguhnya Allah mengetahui apa saja yang ada di langit dan di bumi) Dan termasuk mengetahui apa yang kalian perselisihkan. إِنَّ ذٰلِكَ(bahwasanya yang demikian itu) Yakni pengetahuan apa yang ada di langit dan di bumi. فِى كِتٰبٍ ۚ( terdapat dalam sebuah kitab) Yakni tertulis di sisi Allah. إِنَّ ذٰلِكَ عَلَى اللهِ يَسِيرٌ(Sesungguhnya yang demikian itu amat mudah bagi Allah) Yakni mengetahui apa yang ada di langit dan di bumi adalah sesuatu yang mudah bagi-Nya. Imam Abu Daud dan lainnya mengeluarkan hadits dari ‘Ubadah bin Shamit, Rasulullah bersabda: “sesungguhnya makhluk yang pertama kali diciptakan Allah adalah pena, lalu Allah berfirman kepada pena itu: “tulislah!” pena itu menjawab: “Ya Tuhanku, apa yang harus aku tulis?” Allah berfirman: “tulislah takdir-takdir segala sesuatu sampai datangnya hari kiamat.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Apakah kamu tidak mengetahui bahwa sesungguhnya Allah Maha Mengetahui apa saja yang ada di langit dan di bumi? Diantaranya adalah tentang perselisihan yang sedang terjadi; bahwasanya yang demikian itu terdapat dalam sebuah kitab yang disebut Lauhil Mahfuzh. Sesungguhnya yang demikian itu amat mudah bagi Allah. Tidak ada kesulitan bagi-Nya. Maha Suci Allah Yang menunjukkan bukti ketuhanan. Adapun kami tidak mengetahui apa yang tidak bisa kami saksikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak tahu bahwa sesungguhnya Allah mengetahui apa yang di langit dan di bumi. Sesungguhnya hal itu sudah terdapat dalam kitab} di Lauhil Mahfuz {Sesungguhnya yang demikian itu sangat mudah} mudah bagi Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Menjadi tanda kesempurnaan ketetapan hukumNya, bahwa keputusan hukum itu bersumberkan dari ilmu. Oleh sebab itu, Allah menyebutkan betapa besarnya penguasaan ilmuNya dan muatan kitabNya. Allah berfirman, “Apakah kamu tidak mengetahui bahwa Allah mengetahui apa saja yang ada di langit dan bumi.” Tidak ada perkara tersembunyi yang terlewatkan olehNya, baik perkara yang terjangkau (oleh pandangan manusia) atau perkara-perkara rahasia, yang pelik ataupun yang terang, yang sudah lama terjadi maupun yang bakal muncul. [Sesungguhnya] ilmuNya meliputi segala yang ada di langit dan bumi, Allah telah membakukannya dalam sebuah kitab (buku catatan); yaitu Lauhul Mahfuzh ketika Allah menciptakan al-Qalam, Dia berkata kepada nya \"tulislah\", dia menjawab \"apa yang harus aku tulis?\" Allah menjawab \"tulislah segala sesuatu yang terjadi sampai hari kiamat\". “SEsungguhnya yang demikian itu amat mudah bagi Allah,” meskipun imajinasi kalian tidak melingkupinya. Sedangkan Allah, mudah bagiNya meliputi segala sesuatu dengan ilmuNya dan menuliskannya di kitab yang akan cocok dengan fakta (yang terjadi)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 70: Yakni Lauh Mahfuzh. Ketika Allah menciptakan pena, Dia berfirman kepadanya, “Catatlah!” Pena berkata, “Apa yang harus aku catat?” Allah berfirman, “Catatlah semua yang akan terjadi sampai hari Kiamat.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 70",
    "description": "Tidakkah engkau, Muhammad, tahu dengan ilmu yakin bahwa Allah mengetahui apa yang di langit, seperti malaikat dan benda-benda langit, dan seluruh makhluk Allah yang berada di bumi, baik yang kasat mata maupun tersembunyi bagi manusia' sungguh, yang demikian itu bahwa Allah mengetahui secara detil dan terperinci semua ciptaan-Nya di la-ngit maupun di bumi, sudah terdapat dalam sebuah kitab induk yang tersimpan di lauh mahfuzh sesungguhnya yang demikian itu, tercatatnya data seluruh ciptaan Allah pada sebuah buku induk, sangat mudah bagi Allah, karena Allah tuhan yang memelihara seluruh alam. 71. Dan mereka, orang-orang kafir itu, menyembah tuhan selain Allah dengan bangga, tanpa merasa bersalah, tanpa dasar yang jelas tentang itu, baik yang bersumber dari akal sehat, nurani, apa lagi dari wahyu; dan mereka pun menyembah tuhan selain Allah, tidak mempunyai pengetahuan yang menjadi dasar penyembahan itu. Allah menegaskan, bagi orang-orang yang zalim, yakni orang-orang yang menyembah tuhan selain Allah, akan kekal di dalam neraka. Tidak ada seorang penolong pun yang dapat menyelamatkan mereka dari azab yang pedih itu."
  }
]