[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir Quraisy terus ngotot di atas kesyirikan kepada Allah, meski kebatilan keyakinan mereka itu sudah tampak kebatilannya. Mereka menyembah Tuhan sesembahan, yang tidak ada bukti petunjuk yang turun dalam salah satu kitab-kitab suci Allah yang menunjukkan bahwa ia layak untuk disembah. Dan mereka pun tidak memiliki pengetahuan terkait apa yang mereka perdebatkan sendiri dan mereka ada-adakan terhadap Allah. Hal itu hanyalah merupakan satu perkara yang mereka sekedar mengikuti bapak-bapak mereka padanya tanpa ada dalil (petunjuk yang benar). Maka apabila telah tiba waktu perhitungan amal perbuatan di akhirat, maka tidak ada penolong bagi kaum musyrikin yang akan menolong mereka atau yang dapat menolak siksaan dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan orang-orang musyrik itu menyembah patung-patung sebagai tuhan selain Allah, padahal Dia tidak pernah turunkan dalam kitab-Nya suatu hujah pun agar patung-patung itu disembah. Mereka sama sekali tidak memiliki dalil yang jelas dalam penyembahan patung itu, sebab dalil utama mereka hanyalah taklid buta terhadap nenek moyang mereka, dan bagi orang-orang zalim itu tidak ada seorang penolong pun yang bisa melindungi mereka dari turunnya azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71-72. Orang-orang musyrik menyembah berhala-berhala tanpa mereka miliki dalil dan bukti dari Allah untuk menyembah mereka, dan mereka tidak memiliki ilmu tentang itu. orang-orang zalim itu tidak memiliki penolong bagi diri mereka. Dan jika ayat-ayat al-Qur’an yang jelas itu dibacakan niscaya akan tampak kebencian di wajah orang-orang kafir; hampir-hampir mereka memukul orang-orang beriman yang mambaca al-Qur’an kepada mereka karena kemurkaan mereka yang begitu besar. Hai Rasulullah, katakanlah: “Apakah mau aku sampaikan hal yang lebih buruk dari hal itu? Ia adalah neraka Jahannam yang Allah janjikan bagi orang-orang kafir yang mendustakan ayat-ayat-Nya. Dan neraka adalah seburuk-buruk tempat kembali.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَيَعْبُدُونَ مِن دُونِ اللهِ مَا لَمْ يُنَزِّلْ بِهِۦ سُلْطٰنًا (Dan mereka menyembah selain Allah, apa yang Allah tidak menurunkan keterangan tentang itu) Yakni mereka menyembah berhala-berhala tanpa sandaran hujjah yang jelas dari Allah dalam penyembahan itu. وَمَا لَيْسَ لَهُم بِهِۦ عِلْمٌ ۗ( dan apa yang mereka sendiri tiada mempunyai pengetahuan terhadapnya) Yakni mereka tidak memiliki dalil secara logika yang menunjukkan dibolehkannya perbuatan itu dari berbagai sisi; atau dalil secara syariat yang mereka dapatkan dari Allah atau dari Rasulullah. وَمَا لِلظّٰلِمِينَ مِن نَّصِيرٍ(Dan bagi orang-orang yang zalim sekali-kali tidak ada seorang penolongpun) Penolong yang dapat menolong dan melindungi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Mereka orang-orang musyrik menyembah selain Allah berupa berhala, apa yang Allah tidak menurunkan hujjah/bukti tentang itu. Juga tidak ada bukti ilmiah maupun akal atas apa yang telah mereka lakukan. Dan bagi orang-orang yang zalim itu sekali-kali tidak akan mempunyai seorang penolongpun, yang bisa menetapkan keyakinan mereka ataupun membebaskan mereka dari azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menyembah selain Allah tanpa bukti} dalil dan bukti {yang Dia turunkan dan yang tidak mereka ketahui tentangnya. Tidak ada seorang penolong pun bagi orang-orang zalim} penolong yang menolong mereka dari azab Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Allah menyebutkan kondisi kaum musyrikin yang berpaling dariNya kepada sesembahan yang lain, bahwa kondisi mereka sangatlah buruk. Sebetulnya tidak ada alasan kuat bagi mereka untuk membenarkan tindakan yang mereka kerjakan. Mereka tidak didukung oleh ilmu. Hanya taklid saja yang mereka genggam dari para nenek moyang mereka yang sesat. Terkadang, ada orang yang tidak memiliki ilmu tentang apa yang dia lakukan, akan tetapi dia (pada perkara itu sendiri) mempunyai hujjah yang di ketahuinya. Maka, Allah mengabarkan di sini bahwa Allah tidak menurunkan tentang itu “keterangan,” yaitu kekuatan hujjah yang mengarah ke sana dan memperbolehkannya. Justru (sebaliknya) Allah menurunkan sejumlah bukti yang kokoh yang menandakan kerusakan dan kebatilannya. Selanjutnya, Allah mengancam orang-orang yang berbuat zhalim dari kalangan mereka, lagi menentang kebenaran. Allah berfirman, “Dan orang-orang yang berbuat zhalim sekali-kali tidak mendapatkan seorang penolong pun,” yang menyelamatkan mereka dari siksaan Allah bila telah turun dan menghampiri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 71: Allah Subhaanahu wa Ta'aala menerangkan keadaan orang-orang musyrik, dan bahwa keadaan mereka sangat buruk sekali, di mana perbuatan yang mereka lakukan sama sekali tidak memiliki sandaran. Mereka tidak memiliki ilmu sama sekali terhadapnya, mereka hanya bertaklid (ikut-ikutan) dengan nenek moyang mereka yang sesat. Maksudnya, mereka tidak mengetahui apakah sesembahan-sesembahan itu berhak disembah atau tidak? Dengan berbuat syirk. Yang menolong mereka dari azab Allah ketika datang. Kemudian apakah dalam hati mereka ada keinginan untuk mengikuti petunjuk ketika datang? Atau apakah mereka telah ridha dengan kebatilan mereka? Maka Allah Subhaanahu wa Ta'aala menerangkan keadaan hati mereka sebagaimana dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 71",
    "description": "Dan mereka, orang-orang kafir itu, menyembah tuhan selain Allah dengan bangga, tanpa merasa bersalah, tanpa dasar yang jelas tentang itu, baik yang bersumber dari akal sehat, nurani, apa lagi dari wahyu; dan mereka pun menyembah tuhan selain Allah, tidak mempunyai pengetahuan yang menjadi dasar penyembahan itu. Allah menegaskan, bagi orang-orang yang zalim, yakni orang-orang yang menyembah tuhan selain Allah, akan kekal di dalam neraka. Tidak ada seorang penolong pun yang dapat menyelamatkan mereka dari azab yang pedih itu. 72. Orang-orang kafir tidak hanya menyembah tuhan selain Allah, tetapi juga apabila dibacakan di hadapan mereka, oleh nabi atau para sahabat, ayat-ayat kami yang berisi ajaran tauhid, ibadah, dan akhlak yang terang, karena rasional atau masuk akal, niscaya engkau akan melihat tanda-tanda keingkaran pada wajah orang-orang yang kafir itu terhadap ajaran tauhid, ibadah, dan akhlak. Kemarahan mereka kepada orang yang membacakan ayat itu demikian dahsyat. Hampir-hampir mereka menyerang para mubalig, orang-orang yang membacakan ayat-ayat kami kepada mereka sehingga mengancam keselamatan mereka. Katakanlah, wahai Muhammad kepada orang-orang kafir itu, 'apakah kamu bersedia mendengarkan, akan aku kabarkan kepada kamu sesuatu yang lebih buruk dari itu, yaitu neraka'' Allah telah menjadikan neraka ancaman yang membahayakan kepada orang-orang kafir. Dan neraka itu seburuk-buruk tempat kembali di akhirat."
  }
]