[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dibacakan ayat-ayat al-Qur’an yang jelas kepada kaum musyrikin, kamu dapat melihat kebencian tampak jelas pada wajah-wajah mereka. Mereka hampir-hampir melancarkan serangan sadis terhadap kaum Mukminin yang menyeru mereka kepada Allah dan membacakan ayat-ayatNya kepada mereka. Katakanlah kepada mereka (wahai Rasul), “Maukah kalian aku beritahukan tentang sesuatu yang lebih kalian benci daripada mendengarkan kebenaran dan melihat para penyeru kepada Allah?” yaitu, neraka yang sudah Allah sediakan bagi orang-orang kafir di akhirat. Dan seburuk-buruk tempat mereka kembali adalah neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Dan apabila engkau membacakan pada mereka ayat-ayat Al-Qur`ān Kami yang jelas, niscaya engkau akan melihat tanda keingkaran pada wajah orang-orang kafir yaitu bermuka masam tatkala mendengarkannya, bahkan lantaran besarnya kedengkian dan amarah mereka maka hampir saja mereka memukul orang-orang yang membacakan ayat-ayat Kami pada mereka. Maka katakanlah pada mereka wahai Rasul, \"Maukah kalian aku kabarkan mengenai sesuatu yang lebih buruk dari sikap dengki, amarah, dan sikap muka masam kalian?\" Yaitu Neraka yang Allah janjikan untuk dimasuki oleh orang-orang kafir, dan sungguh seburuk-buruk tempat kembali adalah neraka yang menjadi tempat kembali mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. تَعْرِفُ فِى وُجُوهِ الَّذِينَ كَفَرُوا۟ الْمُنكَرَ ۖ (niscaya kamu melihat tanda-tanda keingkaran pada muka orang-orang yang kafir itu) Yakni tanda kemurkaan dan muka masam mereka saat mendengar ayat-ayat Allah. Pendapat lain mengatakan yakni tanda kesombongan dan keangkuhan mereka. يَكَادُونَ يَسْطُونَ بِالَّذِينَ يَتْلُونَ عَلَيْهِمْ ءَايٰتِنَا ۗ( Hampir-hampir mereka menyerang orang-orang yang membacakan ayat-ayat Kami di hadapan mereka) Yakni memukul, mencaci, atau menarik tangan mereka. Asal makna dari kata (السطو) adalah memaksa. قُلْ أَفَأُنَبِّئُكُم(Katakanlah: “Apakah akan aku kabarkan kepadamu) Yakni apakah aku akan memberitahu kalian. بِشَرٍّ مِّن ذٰلِكُمُ ۗ( yang lebih buruk daripada itu) Yakni daripada kemurkaan yang ada pada kalian terhadap orang yang membaca ayat-ayat Allah kepada kalian. النَّارُ(yaitu neraka) Yang telah disiapkan Allah bagi kalian. وَبِئْسَ الْمَصِيرُ (Dan neraka itu adalah seburuk-buruknya tempat kembali) Yakni tempat kesudahan kalian, yaitu neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Dan apabila dibacakan di hadapan mereka ayat-ayat Al-quran yang secara jelas menunjukkan keesaan Allah, niscaya kamu melihat tanda-tanda keingkaran pada muka orang-orang yang kafir itu. Hampir-hampir mereka menyerang orang-orang yang membacakan ayat-ayat Kami di hadapan mereka. Katakanlah: \"Apakah akan aku kabarkan kepadamu yang lebih buruk daripada itu, yaitu neraka?\" Allah telah mengancamkannya kepada orang-orang yang kafir. Dan neraka itu adalah seburuk-buruknya tempat kembali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila dibacakan ayat-ayat Kami yang terang} yang jelas petunjuknya {di hadapan mereka, kamu akan mengetahui keingkaran} tanda-tanda keingkaran berupa kerutan, kemurkaan, dan kebencian {pada wajah orang-orang yang ingkar itu. Mereka hampir menyerang} menyerang {orang-orang yang membacakan ayat-ayat Kami kepada mereka. Katakanlah,“Apakah aku akan mengabarkan kepada kalian} apakah aku akan mengabarkan kepada kalian {yang lebih buruk daripada itu. yaitu neraka yang telah diancamkan Allah kepada orang-orang yang ingkar. Itulah seburuk-buruks} seburuk-buruk {tempat kembali (72)} tempat yang mereka tinggali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Apakah orang-orang yang tidak mempunyai dasar ilmu atas tindak-tanduk yang biasa mereka jalani bermaksud mengikuti ayat-ayat Allah dan al-huda bila telah datang kepada mereka. Ataukah mereka sudah merasa cukup dengan kebatilan yang mengungkungi mereka? Allah menceritakan itu dalam FirmanNya, “Dan apabila dibacakan di hadapan mereka ayat-ayat Kami,” yang merupakan ayat-ayat Allah yang agung lagi ditujukan untuk menerangkan kebenaran agar terbedakan dari kebatilan, niscaya mereka tidak memberikan perhatian kepadanya dan tidak mempedulikannya. Bahkan “niscaya kamu melihat tanda-tanda keingkaran pada muka orang-orang yang kafir itu,” lantaran kebencian dan antipasti mereka, kita menyaksikan wajah-wajah mereka masam dan air muka mereka cemberut. “Hampir-hampir mereka menyerang orang-orang yang membacakan ayat-ayat Kami di hadapan mereka,” maksudnya hampir saja mereka menimpakan usaha pembunuhan terhadap orang-orang itu dan bogem mentah karena besarnya kebencian dan permusuhan terhadap mereka dan kebenaran. Keadaan orang-orang kafir ini merupakan sejelek-jelek keadaan. Dan keburukan yang muncul dari mereka merupakan sejelek-jelek keburukan. Akan tetapi, masih ada sesuatu yang lebih buruk dari itu, Allah berfirman “Katakanlah, ‘Apakah akan aku kabarkan kepadamu yang lebih buruk daripada itu, yaitu neraka.’ Allah telah mengancamkannya kepada orang-orang yang kafir. Dan mereka itu adalah seburuk-buruk tempat kembali’.” Neraka ini, keburukannya sangat panjang lagi meluas. Ketidaknyamanan dan kepedihannya semakin bertambah selama-lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 72: Maksudnya, Al Qur’an. Yakni engkau akan melihat wajah mereka cemberut dan masam. Dengan memukul atau membunuh. Keadaan ini adalah keadaan yang paling buruk, akan tetapi di sana ada yang lebih buruk lagi, yaitu tempat kembali mereka yang tidak lain adalah neraka, di mana keburukannya melebar, meluas dan memanjang, dan deritanya selalu bertambah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 72",
    "description": "Orang-orang kafir tidak hanya menyembah tuhan selain Allah, tetapi juga apabila dibacakan di hadapan mereka, oleh nabi atau para sahabat, ayat-ayat kami yang berisi ajaran tauhid, ibadah, dan akhlak yang terang, karena rasional atau masuk akal, niscaya engkau akan melihat tanda-tanda keingkaran pada wajah orang-orang yang kafir itu terhadap ajaran tauhid, ibadah, dan akhlak. Kemarahan mereka kepada orang yang membacakan ayat itu demikian dahsyat. Hampir-hampir mereka menyerang para mubalig, orang-orang yang membacakan ayat-ayat kami kepada mereka sehingga mengancam keselamatan mereka. Katakanlah, wahai Muhammad kepada orang-orang kafir itu, 'apakah kamu bersedia mendengarkan, akan aku kabarkan kepada kamu sesuatu yang lebih buruk dari itu, yaitu neraka'' Allah telah menjadikan neraka ancaman yang membahayakan kepada orang-orang kafir. Dan neraka itu seburuk-buruk tempat kembali di akhirat. 73. Allah menjelaskan bagaimana kualitas tuhan-tuhan selain Allah yang disembah oleh orang-orang kafir. Wahai manusia! perhatikanlah dengan cermat, telah dibuat suatu perumpamaan yang harus dijadikan renungan oleh kamu. Maka dengarkanlah dengan saksama! sesungguhnya semua tuhan selain Allah yang kamu seru dalam ritual kamu tidak dapat menciptakan seekor lalat pun, yang menunjukkan ketidakpantasan tuhan-tuhan selain Allah itu dijadikan tuhan, walaupun mereka bersatu dalam sebuah tim untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tuhan-tuhan selain Allah itu tidak akan dapat merebutnya kembali dari lalat itu, karena patung-patung yang disembah itu benda mati. Sama lemahnya yang menyembah dan yang disembah, karena keduanya sama-sama makhluk Allah yang tidak mampu menciptakan apapun baik makhluk hidup maupun benda mati."
  }
]