[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik tidak mengagungkan Allah dengan pengagungan yang sepatutnya, karena mengadakan bagi Allah sekutu-sekutu, padahal Dia adalah Dzat Yang MahaKuat Yang menciptakan segala sesuatu, juga MahaPerkasa Yang tidak terkalahkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Mereka tidak mengagungkan Allah dengan sebenar-benarnya pengagungan tatkala menyembah sebagian makhluk disamping Allah. Sungguh Allah Maha Kuat. Di antara bentuk kekuatan-Nya adalah penciptaan langit dan bumi beserta segala apa yang ada pada keduanya, juga Maha Perkasa yang tidak dikalahkan oleh seorang pun, berbeda dengan patung-patung orang-orang musyrik itu yang lemah lagi hina karena tidak bisa menciptakan sesuatu pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Orang-orang musyrik itu tidak mengagungkan Allah dengan sebenar-benarnya. Sesungguhnya Allah Maha Sempurna kekuatan-Nya dan Maha Mulia dalam kerajaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. مَا قَدَرُوا۟ اللهَ حَقَّ قَدْرِهِۦٓ ۗ (Mereka tidak mengenal Allah dengan sebenar-benarnya) Yakni mereka tidak mengagungkan dan mengenal Allah dengan sebenar-benarnya, karena mereka telah menjadikan berhala-berhala yang lemah ini sebagai sekutu-sekutu Allah, padahal keadaan berhala-berhala itu demikian lemah. إِنَّ اللهَ لَقَوِىٌّ عَزِيزٌ (Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa) Tidak seperti tuhan-tuhan milik orang-orang musyrik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pelajran dari peristiwa Tsunami di Jepang: { مَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ } \"Mereka tidak mengenal Allah dengan sebenar-benarnya.\" Bayangkan bagaimana mobil-mobil yang bertaburan dan bergelinding bagaikan bebatuan tasbih yang tadinya berjejer rapi, rel-rel kereta dan jalan-jalan mobil bagaikan tali batu tasbih itu, korban yang meninggal dan luka dengan cepatnya berjumlah ribuan orang, hanya menunggu waktu selama 24 jam. Seketika mereka seperti dihadapan pintu kiamat dan kamu mereka mereka seakan-akan mabuk padahal tidak, kejadian dan penampakan yang menggores dalam hati menunjukkan satu diantara bukti kekuasaan sang maha kuasa, dan menunjukkan betapa lemahnya manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Mereka orang-orang musyrik tidak mengagungkan Allah dengan sebenar-benarnya, juga tidak mengenal-Nya dengan betul. Sehingga mereka menyekutukan-Nya dengan berhala yang lemah. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa dan tidak terkalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak mengagungkan} tidak mengagungkan {Allah dengan sebenar-benarnya} dengan sebenar-benarnya mengagungkan {Sesungguhnya Allah benar-benar Maha kuat lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73-74. Ini sebuah permisalan yang Allah (gariskan) untuk menggambarkan keburukan peribadahan kepada berhala-berhala dan menjelaskan cacatnya akal-akal orang-orang yang menjalankan ibadah kepadanya serta (menjelaskan) kelemahan semua pihak. Allah berfirman, “Hai manusia.” Ini pembicaraan yang terarah kepada kaum Mukminin dan kaum kafir. Dengan itu, orang-orang Mukminin akan melonjak tingkat ilmu dan bashirah mereka. Sedangkan bagi kaum kafir, ayat itu menjadi hujjah yang menggugat mereka. “Telah dibuat perumpamaan, maka kalian dengarkanlah perumpamaan itu,” maksudnya condongkanlah pendengaran-pendengaran kalian ke arahnya. Dan pahami kandungannya. Jangan sampai mengenai hati yang sedang lalai dan pendengaran yang sedang membelok. Benar-benar arahkan hati dan pendengaran kalian. Yaitu Firman Allah ini, “SEsungguhnya segala yang kamu seru selain Allah,” keterangan ini mencakup setiap obyek yang disembah selain Allah, “sekali-kali tidak dapat menciptakan seekor lalat pun,” yang merupakan binatang yang paling hina lagi menjijikkan. Mereka tiada berdaya untuk menciptakan makhluk yang lemah ini. Apalagi benda-benda yang lebih baik darinya (sudah mesti mereka lebih tidak berdaya). “Walaupun mereka bersatu untuk menciptakannya,” bahkan, lebih parah daripada itu, “dan jika lalat itu merampas sesuatu dari mereka, tidaklah mereka dapat merebutnya.” Ini merupakan titik puncak kelemahannya. “Amat lemahlah yang menyembah,” yaitu yang menyembah sesembahan selain Allah, “dan amat lemah (pulalah) yang disembah,” yaitu lalat. Masing-masing lemah. Lebih lemah lagi daripada keduanya adalah orang yang bergantung kepada makhluk yang lemah ini dan memposisikannya sebagai Rabbul ‘Alamin (Penguasa alam semesta). Orang ini tidak menghormati Allah dengan sebenar-benarnya. Dia telah menyamakan obyek yang membutuhkan peran pihak lain lagi tanpa daya (dilihat) dari segala aspek dengan Dzat Yang Mahakaya lagi Kuat dari segala sisi. Dia telah mempersamakan obyek yang tidak mempunyai kemampuan (bagi dirinya dan bagi orang lain) yang menetapkan kebaikan, bahaya, kematian, kehidupana, dan kebangkitan dengan Dzat yang Maha Pemberi kemanfaatan dan bahaya, Yang Melimpahkan dan Menahan 9kenikmatan), Pemilik kerajaan, dan Yang Mengatur dengan berbagai macam aturan di dalamnya. “Sesungguhnya Allah benar-benar Mahakuat lagi Mahaperkasa,” maksudnya sempurna kekuatanNya, sempurna kemuliaanNya. Di antara kesempurnaan kekuatan dan kemuliaanNya; bahwasanya ubun-ubun seluruh makhluk berada di dua TanganNya. Tidaklah ada benda yang bergerak dan diam melainkan (pasti) dengan keinginan dan kehendakNya. Apa yang dikehendaki oleh Allah, niscaya terjadi, dan apa-apa yang tidak diinginkan oleh Allah, niscaya tidak akan terlaksana. Di antara kesempurnaan kekuatan Allah bahwa Dia memegangi langit-langit dan bumi sehingga tidak terjatuh. Dan (bukti) kesempurnaan kekuatan Allah, Dia membangkitkan seluruh makhluk (setelah kehancurannya), sejak makhluk yang pertama dan yang paling akhir hanya dengan satu tiupan, dan Allah dapat membinasakan para dictator dan umat-umat manusia yang sombong, hanya dengan sesuatu yang kecil dan cemeti dari siksaanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 74: Karena menyekutukan Allah dengan sesuatu yang lebih lemah dari lalat, menyamakan antara yang lemah dengan Yang Kuasa, dan menyamakan yang fakir dengan Yang Kaya. Dia sempurna kekuataan-Nya dan sempurna keperkasaan-Nya. Di antara sempurna kekuatan dan keperkasaan-Nya adalah bahwa semua makhluk di bawah kekuasaan-Nya, dan tidak ada satu pun yang bergerak dan diam kecuali dengan kehendak-Nya, apa yang dikehendaki-Nya pasti terjadi dan apa yang tidak dikehendaki-Nya tidak akan terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 74",
    "description": "Manusia yang menyembah tuhan selain Allah sejatinya mereka tidak mengagungkan Allah dengan sebenar-benarnya, bahkan merendahkan-Nya dengan tidak mengibadati-Nya. Sesungguhnya Allah benar-benar mahakuat meskipun tidak dijadikan tuhan oleh mereka dan mahaperkasa untuk mengalahkan tuhan-tuhan selain dia. 75. Allah memilih para utusan-Nya dari malaikat untuk menyampaikan wahyu kepada para nabi dan rasul, dan juga memilih dari manusia, sejak nabi adam hingga nabi Muhammad, karena kasih sayang-Nya kepada manusia untuk menjelaskan kepada mereka bahwa sesungguhnya tidak ada tuhan selain Allah dan tidak layak beribadah kecuali kepada-Nya. Sesungguhnya Allah maha mendengar semua pembi-caraan makhluk, baik yang terucap maupun yang tersimpan dalam hati; maha melihat seluruh ciptaan-Nya, baik yang di langit maupun di perut bumi."
  }
]