[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-76. Allah memilih utusan-utusan dari kalangan malaikat kepada nabi-nabiNya dan memilih dari kalangan manusia rasul-rasul untuk menyampaikan risalahNya kepada semua makhluk. Sesungguhnya Allah Maha Mendengar ucapan-ucapan hamba-hambaNya, juga Maha Melihat segala sesuatu dan orang yang dipilihNya dari makhlukNya untuk mengemban risalahNya. Dan Dia mengetahui apa yang di depan malaikat-malaikat dan rasul-rasulNya sebelum menciptakan mereka, dan Dia mengetahui apa saja yang akan terjadi sesudah kebinasaan mereka. Dan kepada Allah saja segala sesuatu akan dikembalikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Dia mengetahui segala yang berkaitan dengan utusannya dari kalangan Malaikat dan manusia, baik sebelum mereka diciptakan atau pun setelah mereka diwafatkan. Dan hanya kepada Allah lah segala urusan dikembalikan pada hari Kiamat kelak, di mana Dia membangkitkan seluruh hamba-Nya lalu membalas amal perbuatan yang telah mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Allah Maha Mengetahui segala keadaan para rasul-Nya; perkataan dan perbuatan yang telah mereka kerjakan dan yang akan mereka kerjakan. Kepada Allah segala urusan makhluk dikembalikan, dan Dia akan membalas mereka atas yang telah mereka kerjakan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۗ (Allah mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka) Yakni Allah mengetahui apa yang dilakukan oleh para Rasul-Nya dari kalangan malaikat dan manusia. Mereka tidak dapat menyembunyikan sesuatu apapun yang Allah perintahkan untuk mereka sampaikan, dan tidak mampu menyembunyikan sesuatu yang mereka sampaikan dari apa yang tidak diperintahkan untuk disampaikan. Pendapat lain mengatakan maksudnya adalah Allah mengetahui amalan kebaikan dan keburukan yang telah dilakukan manusia dan yang belum dilakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Allah mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka, juga apa yang mereka kerjakan atau mereka ketahui. Dan hanya kepada Allahlah semua urusan akan dikembalikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mengetahui apa yang di hadapan dan di belakang mereka. Hanya kepada Allah segala urusan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-76. Usai menerangkan kesempurnaanNya dan kelemahan berhala-berhala itu, dan Dia-lah Dzat yang berhak disembah dengan sebenarnya, maka Allah menjelaskan sifat-sifat para rasul dan keistimewaan mereka yang membedakan mereka dari para makhluk yang lain, dengan keutamaan-keutamaan yang (melekat) pada mereka. Allah berfirman, “Allah memilih utusan-utusanNya dari malaikat dan dari manusia,” maksudnya memilih dan menyeleksi utusan-utusan dari kalangan malaikat dan dari kalangan manusia. Mereka (utusan-utusan pilihan ini) menjadi elemen-elemen yang paling suci dari kalangan dan paling sarat degan sifat-sifat kemuliaan dan paling berhak untuk menjadi (duta) pilihan. Para utusan ini tidak lain merupakan sekumpulan makhluk terpilih secara mutlak. Dzat yang memilih dan menyeleksi mereka tidak buta terhadap seluk beluk semua perkara atau (hanya) mengetahui secuil pengetahuan saja. Dzat yang memilih adalah Dzat Yang Maha Mendengar lagi Maha Mengetahui. Yang ilmu, pendengaran, dan pandanganNya telah meliputi segala sesuatu. Jadi, pemilihan mereka olehNya berdasarkan ilmu dariNya bahwa mereka memang pantas mengembannya dan bahwa wahyu cocok dengan mereka. Sebagaimana Firman Allah, \"Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan.\" (Al-An’am:124). “Dan hanya kepada Allah dikembalikan semua urusan,” maksudnya Dia mengutus para rasul untuk mendakwahi umat manusia kepada Allah. Di antara mereka ada yang menyambut seruan, ada pula yang menolak dakwah para rasul itu. Ada yang merespon positif, da nada pula yang berbelok arah. Itulah tugas para rasul. Mengenai balasan atas amal perbuatan itu, maka dikembalikan kepada Allah. Janganlah engkau meniadakan kemurahan maupun keadilan dariNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 76: Yakni yang telah mereka kerjakan, yang sedang mereka kerjakan dan yang akan mereka kerjakan. Allah yang mengutus para rasul, di mana mereka yang mengajak manusia kepada Allah. Di antara mereka ada yang memenuhi panggilan-Nya, dan di antara mereka ada yang menolaknya. Ini adalah tugas para rasul, adapun memberikan balasan terhadap amal, maka kembalinya kepada Allah ‘Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 76",
    "description": "Allah tidak hanya maha mendengar dan maha melihat, tetapi dia juga mengetahui apa yang di hadapan mereka, yang belum terjadi, karena pengetahuan Allah tidak terikat oleh ruang dan waktu, dan mengetahui pula apa yang di belakang mereka, yang sudah terjadi di masa silam. Oleh karena itu, manusia harus meyakini dengan penuh keinsafan bahwa hanya kepada Allah dikembalikan segala urusan, karena sesungguhnya Allah yang mengurus seluruh alam dan seluruh manusia akan kembali menghadap Allah di akhirat. 77. Orang beriman diperintahkan untuk beribadah kepada Allah yang maha mengetahui keadaan manusia. Wahai orang-orang yang beriman, karena kamu sudah membenarkan dan meyakini bahwa sesungguhnya tidak ada tuhan selain Allah, maka rukuklah, sujudlah, dan beribadahlah kepada tuhanmu dengan melaksanakan salat wajib dan berbagai salat sunah, dan sebagai dampak ketekunan beribadah tersebut, maka berbuatlah kebaikan kepada sesama manusia agar kamu beruntung dalam kehidupan pribadi, keluarga dan masyarakat."
  }
]