[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-78. Wahai orang-orang yang beriman kepada Allah dan RasulNya, Muhammad, rukuk dan sujudlah kalian dalam shalat kalian, sembahlah Tuhan kalian semata, tanpa menyekutukan apa pun denganNya, dan lakukanlah kebajikan-kebajikan, agar kalian beruntung. Dan berjihadlah menundukkan diri kalian sendiri, laksanakanlah perintah Allah dengan sempurna, dan serulah manusia ke jalanNYa. Berjihadlah kalian dengan harta benda, lisan dan diri kalian, dengan mengikhlaskan niat padanya karena Allah, juga berserah diri kepadaNya dengan hati dan anggota tubuh kalian. Dia telah memilih kalian untuk mengemban agama ini. Dan Dia telah mencurahkan kenikmatan pada kalian dengan menjadikan ajaran syariat agama kalian penuh kemudahan, tidak menyempitkan dan tidak menyulitkan dalam beban ajaran-ajaran dan hokum-hukumNya, sebagaimana dulu terjadi pada sebagian umat sebelum kalian. Ajaran agama yang penuh kemudahan ini merupakan ajaran bapak moyang kalian, Ibrahim. Dan sesungguhnya Dia telah menamakan kalian dengan nama “orang-orang Muslim” sejak sebelumnya, yaitu dalam kitab-kitab suci yang diturunkan sebelumnya dan juga dalam al-Qur’an ini. Dan Dia telah mengkhususkan kalian dengan pilihan ini supaya penutup para rasul,Muhamad menjadi saksi atas kalian bahwa dia telah menyampaikan risalah Tuhannya pada kalian, dan kalian menjadi saksi-saksi atas umat-umat bahwa rasul-rasul mereka sungguh telah menyampaikan apa yang dikabarkan Allah pada kalian dalam kitab sucinya. Maka kewajiban kalian untuk menyadari urgensi kenikmatan ini, lalu kalian mensyukurinya, dan menjaga rambu-rambu agama Allah dengan menjalankan shalat dengan memenuhi rukun-rukun dan syarat-syaratnya, mengeluarkan zakat yang wajib, dan agar kalian kembali kepada Allah dan bertawakal kepadaNya. Dia adalah sebaik-baik Pelindung bagi orang yang berwala’ kepadaNYa dan Dia sebaik-baik Penolong bagi hamba yang meminta pertolongan kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Wahai orang-orang yang beriman kepada Allah dan mengerjakan syariat-Nya, rukuk dan sujudlah kepada Allah semata dalam salat kalian, dan berbuatlah kebajikan semisal sedekah atau silaturrahim, agar kalian beruntung mendapatkan apa yang kalian inginkan dan selamat dari yang kalian takuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Allah memerintahkan orang-orang beriman untuk menjalankan hukum-hukum yang disebutkan dalam dua ayat ini: “Ruku’ dan sujudlah kepada Allah dalam shalat kalian, dan tunduklah kepada-Nya dengan mentaati-Nya dan kerjakanlah segala kebaikan yang Dia perintahkan, agar kalian dapat meraih kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ ارْكَعُوا۟ وَاسْجُدُوا۟ (Hai orang-orang yang beriman, ruku’lah kamu, sujudlah kamu) Yakni laksanakanlah shalat yang disyariatkan Allah bagi kalian. وَاعْبُدُوا۟ رَبَّكُمْ(sembahlah Tuhanmu) Yakni kerjakanlah segala bentuk ibadah yang diperintahkan Allah kepada kalian. وَافْعَلُوا۟ الْخَيْرَ(dan perbuatlah kebajikan) Yakni segala kebaikan, dan yang paling utama adalah perintah yang wajib, kemudian yang sunnah. Dan yang termasuk kebaikan yang paling baik adalah menolong orang lain. لَعَلَّكُمْ تُفْلِحُونَ (supaya kamu mendapat kemenangan) Yakni agar kalian menjadi orang-orang yang meraih rahmat dan keridhaan Allah di hari kiamat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Di dalam surat al-Haj.. banyak perkara yang dibahas dengan lugas: tentang Tauhid, hikmah-hikmah dan nasihat. Singkatnya surat ini menjadi penjelas bagi siapa yang mentadabburinya, dijelaskan juga tentang perkara-perkara wajib dan yang dibolehkan seluruhya: Tauhid, Shalat, Zakat, Puasa terkumpul dalam satu ayat: { يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱرْكَعُوا۟ وَٱسْجُدُوا۟ وَٱعْبُدُوا۟ رَبَّكُمْ وَٱفْعَلُوا۟ ٱلْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ } \"Hai orang-orang yang beriman, ruku'lah kamu, sujudlah kamu, sembahlah Tuhanmu dan perbuatlah kebajikan, supaya kamu mendapat kemenangan.\" 2 ). Suatu hal jika disebutkan salah satu bagian yang terkandung di dalamnya, maka dapat dipastikan ia adalah inti/rukun dalam bagian itu. Dalam hal ini dapat diambil contoh dari penetapan rukuk dan sujud sebagai rukun dalam shalat yang disebutkan secara khusus dalam ayat ini: { يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱرْكَعُوا۟ وَٱسْجُدُوا۟ وَٱعْبُدُوا۟ رَبَّكُمْ وَٱفْعَلُوا۟ ٱلْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ } \"Hai orang-orang yang beriman, ruku'lah kamu, sujudlah kamu, sembahlah Tuhanmu dan perbuatlah kebajikan, supaya kamu mendapat kemenangan.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Hai orang-orang yang beriman, shalatlah kamu dengan aturan yang telah Allah syariatkan. Esakan dan sembahlah Tuhanmu dalam ibadah. Lakukan kewajiban, kesunnahan, membantu orang lain, berakhlak baik, maka kalian akan beruntung dan mendapat kemenangan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, rukuklah, sujudlah, dan sembahlah Tuhan kalian, serta lakukanlah kebaikan agar kalian beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Allah memerintahkan para hambaNya yang beriman untuk menegakkan shalat. Penyebutan rukuk dan sujud (untuk mewakili shalat), karena keutamaan dan status keduanya sebagai rukun shalat, (dan memerintahkan) untuk beribadah kepadaNya yang merupakan penyejuk mata dan penghibur hati yang pedih. Rububiyah dan curahan kebaikanNya pada hamba menuntut mereka untuk memurnikan ibadah bagiNya. Dia memerintahkan mereka untuk berbuat kebaikan secara umum dan mengaitkan keberuntungan seorang pada perkara-perkara tersebut. Allah berfirman, “Supaya kamu mendapatkan kemenangan,” maksudnya kalian akan meraup kemenangan dengan meraih harapan yang diinginkan dan selamat dari kejelekan (yang dikhawatirkan). Tidak ada jalan apa pun untuk menggapai keberuntungan selain bersikap ikhlas dalam menjalankan ibadah kepada al-KHaliq dan mengusahakan diri dapat bermanfaat bagi sesame. Siapa saja yang mendapatkan taufik untuk melaksanakan itu, maka dia mendapatkan porsi yang besar dari nikmat kebahagiaan, keselamatan, dan keberuntungan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 77: Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya mendirikan shalat. Disebutkan ruku’ dan sujud karena keutamaan keduanya dan karena ia merupakan rukun shalat. Demikian pula Dia memerintahkan beribadah kepada-Nya, di mana beribadah kepada-Nya merupakan penyejuk mata dan penyenang hati yang sedih. Rububiyyah dan ihsan-Nya kepada para hamba menghendaki mereka untuk mengikhlaskan ibadah kepada-Nya. Yakni esakanlah Dia. Seperti silaturrahmi dan berakhlak mulia. Keberuntungan terkait dengan beberapa perkara ini; shalat, ibadah dengan ikhlas dan berbuat baik kepada orang lain, seperti berusaha memberikan manfaat kepada orang lain. Arti falaah (keberuntungan) adalah tercapainya apa yang diharapkan dan selamat dari marabahaya, termasuk di antaranya adalah masuk ke dalam surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 77",
    "description": "Orang beriman diperintahkan untuk beribadah kepada Allah yang maha mengetahui keadaan manusia. Wahai orang-orang yang beriman, karena kamu sudah membenarkan dan meyakini bahwa sesungguhnya tidak ada tuhan selain Allah, maka rukuklah, sujudlah, dan beribadahlah kepada tuhanmu dengan melaksanakan salat wajib dan berbagai salat sunah, dan sebagai dampak ketekunan beribadah tersebut, maka berbuatlah kebaikan kepada sesama manusia agar kamu beruntung dalam kehidupan pribadi, keluarga dan masyarakat. 78. Setelah dijelaskan pada ayat di atas bahwa untuk meraih keberuntungan, orang beriman diperintahkan untuk beribadah kepada Allah dan berbuat baik kepada sesama manusia, pada ayat ini dijelaskan bahwa untuk meraih keberuntungan, orang beriman diperintahkan untuk berjihad pada jalan Allah. Untuk meraih keberuntungan itu, beribadahlah kamu, wahai orang-orang yang beriman, dan berjihadlah kamu di jalan Allah, yakni mencurahkan seluruh potensi dan kemampuan untuk mengharumkan islam dan kaum muslim dengan jihad yang sebenar-benarnya, perjuangan yang total dalam menggali seluruh potensi dan kemampuan. Dia telah memilih kamu, wahai Muhammad untuk menjadi nabi dan rasul pamungkas; dan dia, Allah, tidak menjadikan kesukaran untukmu dalam agama, yakni dalam melaksanakan ajaran islam ini, karena islam menekankan prinsip memudahkan, meminimalkan beban, dan bertahap dalam menetapkan syariah, hukum agama. Memeluk islam dan menjadi muslim itu merupakan kelanjutan dari agama nenek mo-yangmu ibrahim, yakni meyakini tidak ada tuhan selain Allah dan tidak beribadah kecuali kepada-Nya. Dia (Allah) telah menamakan kamu, orang-orang yang meyakini prinsip tauhid itu, adalah orang-orang muslim, berserah diri kepada Allah, sejak dahulu, dan begitu pula kamu dinamakan muslim dalam Al-Qur'an ini, agar rasul, nabi Muhammad itu menjadi saksi atas diri kamu semua dalam mengamalkan ajaran islam dan agar kamu semua menjadi saksi atas segenap manusia dalam mewujudkan prinsip tidak ada tuhan selain Allah dan tidak beribadah kecuali kepada-Nya. Maka, sejalan dengan prinsip tersebut, laksanakanlah salat dengan baik dan benar sesuai syarat dan rukunnya, serta tepat waktu; tunaikanlah zakat dengan sempurna, dan berpegangteguhlah kepada Allah dalam pikiran dan perasaan. Dialah pelindungmu dari segala bencana dunia-akhirat; dia sebaik-baik pelindung dan sebaik-baik penolong bagi manusia dan seluruh makhluk."
  }
]