[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-78. Wahai orang-orang yang beriman kepada Allah dan RasulNya, Muhammad, rukuk dan sujudlah kalian dalam shalat kalian, sembahlah Tuhan kalian semata, tanpa menyekutukan apa pun denganNya, dan lakukanlah kebajikan-kebajikan, agar kalian beruntung. Dan berjihadlah menundukkan diri kalian sendiri, laksanakanlah perintah Allah dengan sempurna, dan serulah manusia ke jalanNYa. Berjihadlah kalian dengan harta benda, lisan dan diri kalian, dengan mengikhlaskan niat padanya karena Allah, juga berserah diri kepadaNya dengan hati dan anggota tubuh kalian. Dia telah memilih kalian untuk mengemban agama ini. Dan Dia telah mencurahkan kenikmatan pada kalian dengan menjadikan ajaran syariat agama kalian penuh kemudahan, tidak menyempitkan dan tidak menyulitkan dalam beban ajaran-ajaran dan hokum-hukumNya, sebagaimana dulu terjadi pada sebagian umat sebelum kalian. Ajaran agama yang penuh kemudahan ini merupakan ajaran bapak moyang kalian, Ibrahim. Dan sesungguhnya Dia telah menamakan kalian dengan nama “orang-orang Muslim” sejak sebelumnya, yaitu dalam kitab-kitab suci yang diturunkan sebelumnya dan juga dalam al-Qur’an ini. Dan Dia telah mengkhususkan kalian dengan pilihan ini supaya penutup para rasul,Muhamad menjadi saksi atas kalian bahwa dia telah menyampaikan risalah Tuhannya pada kalian, dan kalian menjadi saksi-saksi atas umat-umat bahwa rasul-rasul mereka sungguh telah menyampaikan apa yang dikabarkan Allah pada kalian dalam kitab sucinya. Maka kewajiban kalian untuk menyadari urgensi kenikmatan ini, lalu kalian mensyukurinya, dan menjaga rambu-rambu agama Allah dengan menjalankan shalat dengan memenuhi rukun-rukun dan syarat-syaratnya, mengeluarkan zakat yang wajib, dan agar kalian kembali kepada Allah dan bertawakal kepadaNya. Dia adalah sebaik-baik Pelindung bagi orang yang berwala’ kepadaNYa dan Dia sebaik-baik Penolong bagi hamba yang meminta pertolongan kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Dan berjihadlah di jalan Allah dengan jihad yang ikhlas karena mengharap rida-Nya. Dia memilih kalian dan menjadikan agama kalian sebagai agama yang mudah, tidak ada kesukaran dan pemaksaan di dalamnya. Agama yang mudah ini adalah agama nenek moyang kalian, Ibrahim -'alaihissalām-, dan Allah telah menamai kalian dalam kitab-kitab terdahulu dan dalam Al-Qur`ān sebagai orang-orang muslim, agar rasul menjadi saksi atas kalian bahwa ia telah menyampaikan pada kalian apa yang diperintahkan padanya untuk disampaikan, dan agar kalian menjadi saksi atas segenap umat-umat terdahulu bahwa rasul-rasul mereka telah menyampaikan wahyu Allah tersebut. Maka bersyukurlah kalian kepada Allah atas nikmat itu dengan mendirikan salat secara sempurna, tunaikanlah zakat harta kalian, kembalilah kepada Allah, dan berpegang teguhlah kepada-Nya dalam segala urusan, sungguh Dia sebaik-baik pelindung bagi orang-orang mukmin yang dilindungi-Nya, dan sebaik-baik penolong bagi orang-orang mukmin yang ditolong-Nya, maka mintalah perlindungan dan pertolongan kepada-Nya niscaya Dia pasti melindungi dan menolong kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Dan berjihadlah dengan sebenar-benarnya menggunakan harta dan diri kalian demi meninggikan kalimat Allah, dengan mengerahkan seluruh kemampuan dan tenaga dalam segala aspek; dalam berdakwah, melawan hawa nafsu, dan dalam peperangan. Allah telah memilih kalian untuk agama-Nya dan menolong syariat-Nya. Allah tidak menjadikan syariat yang diperintahkan kepada kalian agar kalian mendapat kesusahan. Teguhlah di atas agama ayah kalian, Ibrahim, agama yang penuh kemudahan dan toleransi. Ibrahim adalah orang yang menyebut kalian sebagai kaum muslimin sebelum al-Qur’an diturunkan dan dalam al-Qur’an -sebagaimana dalam firman Allah ‘Ya Tuhan kami jadikanlah kami dua orang yang berserah diri kepada-Mu (muslim) dan dari keturunan kami umat yang berserah diri kepada-Mu (muslimin). (al-Baqarah: 128)- agar Nabi Muhammad menjadi saksi atas kalian bahwa dia telah menyampaikan risalahnya kepada kalian, dan agar kalian menjadi saksi atas umat-umat yang lain bahwa para rasul mereka telah menyampaikan risalah kepada mereka. Dan dirikanlah shalat pada waktunya dan tunaikanlah zakat kepada orang-orang yang berhak menerimanya. Dan serahkanlah urusan kalian kepada Allah, Dia adalah penolong kalian dan pengatur urusan kalian. Dialah sebaik-baik penolong bagi orang-orang beriman.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَجٰهِدُوا۟ فِى اللهِ (Dan berjihadlah kamu pada jalan Allah) Yakni berperang melawan orang-orang kafir dan membela diri dari serangan mereka jika mereka menyerang negeri kaum muslimin. حَقَّ جِهَادِهِۦ ۚ( dengan jihad yang sebenar-benarnya) Yakni jihad yang ikhlas karena Allah tanpa takut cercaan orang lain. هُوَ اجْتَبَىٰكُمْ (Dia telah memilih kamu) Yakni Wahai kaum muslimin, Allah telah memilih kalian untuk memeluk agama-Nya. وَمَا جَعَلَ عَلَيْكُمْ فِى الدِّينِ مِنْ حَرَجٍ ۚ (dan Dia sekali-kali tidak menjadikan untuk kamu dalam agama suatu kesempitan) Yakni kesempitan dan kesulitan. Allah memberi keringanan bagi kalian dalam pernikahan dengan membolehkan untuk menikahi dua, tiga, dan empat perempuan serta budak wanita yang kalian miliki; membolehkan mengqashar shalat dan tidak berpuasa bagi musafir, menjalankan shalat dengan isyarat bagi yang tidak mampu melakukannya dengan sempurna. Allah tidak mempersempit mereka dengan membebankan apa yang berat bagi mereka, Allah memberi jalan keluar bagi dosa mereka dengan taubat dan menerima permohonan ampun serta penghapusan dosa dengan kaffarat dan ganti rugi yang disyariatkan Allah dalam hal ini, dan berbagai rukhshah lainnya. مِّلَّةَ أَبِيكُمْ إِبْرٰهِيمَ ۚ( agama orang tuamu Ibrahim) Yakni ikutilah agama bapak kalian, Nabi Ibrahim. هُوَ(Dia) Yakni Allah. سَمَّىٰكُمُ الْمُسْلِمِينَ مِن قَبْلُ(telah menamai kamu sekalian orang-orang muslim dari dahulu) Yakni dalam kitab-kitab yang terdahulu. Pendapat lain mengatakan yang menamai mereka adalah Nabi Ibrahim dengan perkataannya (ومن ذريتنا أمة مسلمة لك) “dan (jadikanlah) anak cucu kami (juga) umat yang berserah diri kepada-Mu” وَفِى هٰذَا(dan (begitu pula) dalam (Al Quran) ini) Yakni kalian disebut dalam al-Qur’an dengan sebutan orang-orang muslim. لِيَكُونَ الرَّسُولُ شَهِيدًا عَلَيْكُمْ ( supaya Rasul itu menjadi saksi atas dirimu) Bahwa dia telah menyampaikan risalah kepada kalian. وَتَكُونُوا۟ شُهَدَآءَ عَلَى النَّاسِ ۚ (dan supaya kamu semua menjadi saksi atas segenap manusia) Bahwa Rasul mereka telah menyampaikan risalah kepada mereka. Atau maksudnya adalah agar kalian menjadi saksi atas umat-umat yang telah kalian sampaikan kepada mereka agama Allah. فَأَقِيمُوا۟ الصَّلَوٰةَ وَءَاتُوا۟ الزَّكَوٰةَ(maka dirikanlah sembahyang, tunaikanlah zakat) Allah mengkhususkan penyebutan dua ibadah ini karena keduanya memiliki keutamaan yang lebih. وَاعْتَصِمُوا۟ بِاللهِ(dan berpeganglah kamu pada tali Allah) Yakni jadikanlah Dia sebagai pelindung dari apa yang kalian takuti, dan kembalilah kepada-Nya dalam setiap urusan. هُوَ مَوْلَىٰكُمْ ۖ( Dia adalah Pelindungmu) Yakni penolong kalian dan pengatur urusan kalian. فَنِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ (maka Dialah sebaik-baik Pelindung dan sebaik-baik Penolong) Yakni tidak ada yang menyerupai-Nya dalam mengurus urusan kalian dan dalam menolong kalian untuk melawan musuh-musuh kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Al-Hasan al-Bashri pernah berkata: Sesungguhnya seseorang bisa berjihad di jalan Allah dengan sesungguhnya, sekalipun dia tidak memukulkan pedangnya. 2 ). Allah menutup surah al-Haj dengan ayat: { وَجَٰهِدُوا۟ فِى ٱللَّهِ حَقَّ جِهَادِهِ }, hal ini menunjukkan bahwa setelah melakukan semua ibadah-ibadah yang diperintahkan dalam surah ini merupakan kewajiban bagi setiap muslim untuk terus berijtihad dan bermujahadah dalam melaksanakan ibadah-ibadah tersebut, dan hari-hari yang mulia dengan mengambil keutamaan di dalamnya, dan memperbanyak amalan-amalan yang berbeda di dalamnya, dan bahwasanya ibadah-ibadah itu ditunaikan bukan dikhususkan untuk hari-hati tersebut, melainkan setiap hamba lah yang membutuhkan ibadah itu, shalat, puasa, zakat, dan senantiasa berpegang teguh di atas jalan Allah. 3 ). Jika diperhatikan dengan seksama, bahwasanya ada kemudahan yang Allah berikan kepada hamba-Nya dalam melaksanakan ibadah, namun kemudahan itu tidak mengikuti hawa nafsu dan keingnanan seorang hamba tersebut, kemudahan itu bukan berart tidak adanya tantangan dan keletihan dalam melaksanakan ibadah, bukan kah Allah mengakhiri surah ini dengan ayat-Nya: { وَجَٰهِدُوا۟ فِى ٱللَّهِ حَقَّ جِهَادِهِ } \"Dan berjihadlah kamu pada jalan Allah dengan jihad yang sebenar-benarnya\" dari ayat ini dapat difahami bahwa tingkat balasan dan pahala bagi seorang tergantung besaran dan keletihan dalam melaksanakan ibadah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Berjihadlah pada jalan Allah untuk melawan musuh-musuh dengan jihad yang sebenar-benarnya hanya mengharap keridhoan-Nya. Dia telah memilih kamu untuk menolong syariat-Nya. Dia sekali-kali tidak menjadikan untukmu kesempitan dan kesulitan dalam agama. Namun Dia menjadikannya mudah dan ringan. Dia telah memberi keringanan kepadamu seperti boleh mengqashr dan menjamak shalat, berbuka ketika bulan Ramadan bagi musafir dan orang yang sakit. Tayamum, boleh memakan bangkai karena mendesak. Sesungguhnya syariat yang mudah ini adalah syariat nenek moyangmu Ibrahim yang dijadikan bapak bagi umat muslim. Sebab beliau adalah bapak rasul sallallahu ‘alaihi wa sallam atau kakeknya. Rasul layaknya bapak dalam kemurahan hari terhadap umat. Maka Ikutilah agama orang tuamu Ibrahim. Dia Allah telah menamai kamu sekalian orang-orang muslim dari dahulu dengan berkata sebagaimana pada surat Al-baqarah ayat 128 dalam Alquran ini, supaya Rasul itu menjadi saksi atas dirimu dan supaya kamu semua menjadi saksi atas segenap manusia, maka dirikanlah shalat, tunaikanlah zakat dan berpeganglah kamu pada tali Allah. Dia adalah Pelindungmu, maka Dialah sebaik-baik Pelindung dan sebaik-baik Penolong bagi orang yang beriman. Tidak ada penolong yang lebih baik dari-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berjuanglah pada (jalan) Allah} berjihadlah di jalan Allah dan memerangi musuh-musuhNya {dengan sebenar-benarnya} dengan jihad yang sebenarnya dan ikhlas karenaNya {Dia telah memilih kalian} memilih kalian untuk agamaNya {dan tidak menjadikan kesulitan} kesempitan dan penderitaan {untuk kalian dalam agama. {Agama nenek moyang kalian} Dia meluaskan agama kalian seberti agama ayah kalian {Ibrahim. Dia telah menamai kalian dengan orang-orang muslim sebelumnya} Allah adalah Dzat yang menamai kalian dengan orang-orang muslim sebelumnya dalam kitab-kitab terdahulu {dan dalam (kitab) ini} Al-Qur’an {agar Rasul menjadi saksi atas kalian dan agar kalian menjadi saksi atas manusia. Maka tegakkanlah shalat, tunaikanlah zakat, dan berpegang teguhlah pada Allah} berlindunglah kepada Allah dalam semua urusan kalian {Dia adalah pelindung kalian} penolong dan pengawas urusan-urusan kalian {Dia adalah sebaik-baik pelindung dan sebaik-baik penolong}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. “Dan berjihadlah kamu pada jalan Allah dengan jihad yang sebenar-benarnya,” maksud dari kata al-jihad, yaitu mengerahkan kemampuan untuk dapat menggenggam tujuan yang dibidik. Jihad di jalan Allah dalam artian sebenarnya, yaitu melaksanakan perintah Allah dengan sepenuhnya, menyeru sesame manusia kepada jalanNya dengan berbagai macam cara yang dapat merealisasikannya, berupa pemberian nasihat, pembelajaran, peperangan, pembinaan, pencelaan, ceramah, dan lain sebagainya. “Dia telah memilih kamu,” maksudnya Dia telah memilih kalian wahai kaum Muslimin dari kalangan umat manusia dan memilihkan agama bagi kalian serta meridhainya bagi kalian (sebagai ajaran agama). Dia juga memilihkan kitab terbaik dan utusan yang paling uatama bagi kalian. Maka, terimalah anugerah besar ini dengan menegakkan jihad di jalannya dengan sepenuh arti. Manakala Firman Allah yang berbunyi, “Dan berjihadlah kamu pada jalan Allah dengan jihad yang sebenar-benarnya,” mungkin ada orang yang meyangka bahwa ini merupakan bentuk taklif (pembebanan tanggung jawab) yang diluar batas kemampuan atau taklif yang memberatkan, maka Allah menyisihkannya dari anggapan itu dengan FirmanNYa, “Dan Dia sekali-kali tidak menjadikan untuk kamu dalam agama suatu kesempitan,” maksudnya, suatu kepellikan dan kesulitan. Justru benar-benar meringankannya dan memudahkan dengan kemudahan yang paling puncak. Pertama : tidaklah Allah memerintahkan dan mengharuskan melainkan (pasti) sesuatu yang mudah dirasakan oleh manusia, tidak memberatkan dan menyusahkannya. Selain itu, bila muncul beberapa faktor yang mengharuskan adanya dispensasi (peringanan), maka Allah meringankan kewajiban yang Allah perintahkan, baik dengan menggugurkannya atau menggugurkan sebagiannya. Dari ayat ini, bisa dipetik sebuah kaidah syar’i: “masyaqqah (kesulitan) mendatangkan taisir (kemudahan masalah)” dan “keadaan darurat memperbolehkan hal-hal yang yang diharankan.” Sehingga banyak hukum furu’ (cabang) (yang dikenal di dalam kitab-kitab hukum) masuk ke dalam kaidah ini. “Agama orang tuamu, Ibrahim,” maksudnya ajaran agama yang telah disebutkan dan perintah-perintah yang tertuliskan meruppakan (hakikat) ajaran agama ayah kalian, Ibrahim yang beliau pegangi, maka tepatilah dan berpegang teguhlah dengannya. “DIa menamai kamu sekalian orang-orang Musllim dari dahulu,” maksudnya dalam kitab-kitab terdahulu, kalian telah disebutkan dan sudah dikenal masyhur. “Dan (begitu pula) dalam (al-Quran ini),” kitab ini dan aturan syariat ini. Pengertiannya, bahwa nama ini menjadi milik kalian dahulu dan sekarang ini. “Supaya Rasul itu menjadi saksi atas dirimu,” beserta amalan-amalan kalian; baik atau buruk. “Dan supaya kalian semua menjadi saksi atas segenap manusia,” lantaran status kalian sebagai umat terbaik yang dimunculkan bagi umat manusia, umat yang wasath (pertengahan), adil lagi terpilih. Kalian bersaksi untuk mendukung para rasul bahwa mereka telah menyampaikan risalah kepada umat-umat mereka, dan bersaksi di hadapan para umat bahwa para rasul mereka telah menyampaikan ajaran agama kepada mereka, melalui berita yang Allah kabarkan kepada kalian dalam kitabNya. “Maka dirikanlah shalat,” dengan rukun-rukun, syarat-syarat dan atuaran-aturan serta seluruh kelaziman (yang melengkapinya), “dan tunaikanlah zakat,” yang diwajibkan kepada pihak-pihak yang berhak menerimanya, dalam rangka wujud rasa syukur kepada Allah atas limpahan kenikmatan kepada mereka. “Dan berpeganglah kamu pada tali Allah,” maksudnya bertahanlah denganNYa dan bertawakallah kepadaNya dalam menjalankannya, janganlah kalian berpangku pada adaya dan kekuatan kalian semata. “DIa adalah Pelindungmu,” Dzat yang menangani urusan-urusan kalian, hingga mengatur kalian dengan aturan yang bagus dan mengurusi kalian sesuai dengan ketentuan yang terbaik. “Maka Dia-lah sebaik-baik Pelindung dan sebaik-baik Penolong,” maksudnya sebaik-baik penguasa bagi obyek yang ditangani, sehingga terealisasikan apa yang ingin dicapai olehnya. Dan sebaik-baik Penolong bagi orang yang memohon pertolongan, hingga melenyapkan kejelekan darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 78: Untuk menegakkan agama-Nya. Jihad artinya mengerahkan kemampuan untuk mencapai sesuatu. Berjihad di jalan Allah dengan sebenar-benarnya maksudnya adalah melaksanakan perintah Allah dan mengajak manusia kepada jalan-Nya dengan segala cara yang dapat mengantarkan kepadanya, seperti dengan nasehat, pengajian, memerangi, memberi adab, melarang, menasehati, dsb. Wahai kaum muslimin, di antara sekian manusia, Dia memilih agama Islam untukmu dan meridhainya bagimu. Demikian pula memilihkan untukmu kitab yang paling utama dan rasul yang paling utama, maka terimalah nikmat yang besar itu dengan berjihad di jalan Allah dengan sebenar-benarnya. Oleh karena berjihad di jalan Allah terkadang timbul kesan, bahwa hal tersebut menyulitkan, maka Allah menerangkan, bahwa dalam agama tidak ada satu pun yang menyulitkan. Oleh karena itu, Dia memberikan kemudahan ketika darurat, seperti adanya qasar (mengurangi jumlah rakaat shalat), tayammum, memakan bangkai, berbuka ketika sakit dan kerika safar (bepergian jauh). Dari ayat ini dapat diambil kaidah, “Al Masyaqqah tajlibut taisir.” (Kesulitan mendatangkan kemudahan) dan “Adh Dharuuraatu tubiihul mahzhuuraat” (Darurat itu membolehkan hal yang terlarang). Agama Beliau adalah Islam. Maksudnya, dalam kitab-kitab yang telah diturunkan kepada nabi-nabi sebelum Nabi Muhammad shallallahu 'alaihi wa sallam. Nama ini “Muslim” senantiasa dipakai untukmu dahulu maupun sekarang. Yakni terhadap amalmu, baik dan buruk. Yakni bahwa para rasul telah menyampaikan risalah mereka. Maksudnya, percayalah kepada-Nya dan bertawakkallah kepada-Nya. Karena orang yang meminta perlindungan-Nya akan dilindungi. Bagi orang yang meminta pertolongan kepada-Nya, sehingga Dia akan menghindarkan sesuatu yang tidak diinginkannya. Selesai tafsir surah Al Hajj dan al Hamdulillahi Rabbil ‘aalamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 78",
    "description": "Setelah dijelaskan pada ayat di atas bahwa untuk meraih keberuntungan, orang beriman diperintahkan untuk beribadah kepada Allah dan berbuat baik kepada sesama manusia, pada ayat ini dijelaskan bahwa untuk meraih keberuntungan, orang beriman diperintahkan untuk berjihad pada jalan Allah. Untuk meraih keberuntungan itu, beribadahlah kamu, wahai orang-orang yang beriman, dan berjihadlah kamu di jalan Allah, yakni mencurahkan seluruh potensi dan kemampuan untuk mengharumkan islam dan kaum muslim dengan jihad yang sebenar-benarnya, perjuangan yang total dalam menggali seluruh potensi dan kemampuan. Dia telah memilih kamu, wahai Muhammad untuk menjadi nabi dan rasul pamungkas; dan dia, Allah, tidak menjadikan kesukaran untukmu dalam agama, yakni dalam melaksanakan ajaran islam ini, karena islam menekankan prinsip memudahkan, meminimalkan beban, dan bertahap dalam menetapkan syariah, hukum agama. Memeluk islam dan menjadi muslim itu merupakan kelanjutan dari agama nenek mo-yangmu ibrahim, yakni meyakini tidak ada tuhan selain Allah dan tidak beribadah kecuali kepada-Nya. Dia (Allah) telah menamakan kamu, orang-orang yang meyakini prinsip tauhid itu, adalah orang-orang muslim, berserah diri kepada Allah, sejak dahulu, dan begitu pula kamu dinamakan muslim dalam Al-Qur'an ini, agar rasul, nabi Muhammad itu menjadi saksi atas diri kamu semua dalam mengamalkan ajaran islam dan agar kamu semua menjadi saksi atas segenap manusia dalam mewujudkan prinsip tidak ada tuhan selain Allah dan tidak beribadah kecuali kepada-Nya. Maka, sejalan dengan prinsip tersebut, laksanakanlah salat dengan baik dan benar sesuai syarat dan rukunnya, serta tepat waktu; tunaikanlah zakat dengan sempurna, dan berpegangteguhlah kepada Allah dalam pikiran dan perasaan. Dialah pelindungmu dari segala bencana dunia-akhirat; dia sebaik-baik pelindung dan sebaik-baik penolong bagi manusia dan seluruh makhluk. 1-2. Sungguh, pasti beruntung orang-orang mukmin yang telah mantap imannya dan terbukti dengan mengerjakan amal-amal saleh. Orang yang demikian itu ialah orang yang khusyuk dalam salatnya, yakni tumakninah, rendah hati, fokus, serta menyadari dengan sepenuuhnya bahwa dia sedang menghadap sang penciptanya (lihat juga: al-baqarah/2: 45'46)."
  }
]