[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Diantara orang-orang kafir ada orang yang mendebat dengan dasar kebatilan tentang Allah; tentang keesaanNya serta pilihanNya yang jatuh pada RasulNya , serta turunnya al-Qur’an padanya. Sanggahan itu dilakukan tanpa dasar ilmu dan keterangan yang benar, serta tanpa kitab dari Allah yang berisi bukti kebenaran dan hujjah yang jelas. Dia membelokkan lehernya dalam kesombongannya, berpaling dari kebenaran, supaya dapat menghalang-halangi orang lain dari keinginan masuk kedalam agama Allah. Maka dia akan menemui kehinaan di dunia dengan kekalahan dan terkuaknya jati dirinya. Dan Kami membakarnya pada Hari Kiamat dengan api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Sambil memalingkan lehernya secara congkak agar memalingkan manusia dari keimanan kepada Allah dan masuk ke dalam agama Allah. Orang yang memiliki sifat seperti ini mendapat kehinaan di dunia dengan azab yang akan menimpanya, dan di akhirat kelak Kami akan berikan kepadanya rasa azab Neraka yang membakar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. ثَانِىَ عِطْفِهِۦ (dengan memalingkan lambungnya) Yakni kanan dan kiri badannya. Yang dimaksud adalah orang yang menggelengkan lehernya karena rasa angkuh dan kesombongan. Pendapat lain mengatakan, yakni orang yang berpaling dari zikir. لِيُضِلَّ عَن سَبِيلِ اللهِ (untuk menyesatkan manusia dari jalan Allah) Yakni tujuannya adalah menyesatkan orang lain dari jalan Allah, meski mereka tidak mengakui hal itu. لهُۥ فِى الدُّنْيَا خِزْىٌ ۖ (Ia mendapat kehinaan di dunia) Makna (الخزي) di sini adalah kehinaan yang didapat oleh orang yang sombong, yaitu kehinaan dari siksaan di dunia yang disegerakan dan penyebutan yang buruk baginya dari lisan-lisan manusia. وَنُذِيقُهُۥ يَوْمَ الْقِيٰمَةِ عَذَابَ الْحَرِيقِ(dan dihari kiamat Kami merasakan kepadanya azab neraka yang membakar) Yakni azab neraka yang membakar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dengan memalingkan lambungnya dengan kesombongan, serta penolakan yang terang-terangan, untuk menyesatkan manusia dari agama Allah. Dia mendapat kehinaan di dunia berupa azab zahir ataupun maknawi dengan nasib yang buruk yang disegerakan. Serta kehinaan di hari kiamat Kami jadikan mereka mereka merasakan azab neraka yang membakar dan membara."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sambil memalingkan lehernya} memalingkan lehernya karena sombong {untuk menyesatkan} untuk menghalangi {dari jalan Allah} agama Allah {Bagi dia, kehinaan} kerendahan dan kehinaan {di dunia dan pada hari kiamat Kami membuatnya merasakan azab yang membakar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Disamping itu, dia “memalingkan lambungnya,” memiringkan badan bagian samping dan lehernya. Ini merupakan sebuah kinayah (kiasan) mengenai keangkuhan mereka terhadap al-haq dan pelecehan mereka terhadap sesame manusia. Sungguh, dia merasa gembira dengan ilmunya yang tidak berguna dan merendahkan para pembela kebenaran dan kebenaran yang mereka sandang “untuk menyesatkan,” orang-orang. Maksudnya, agar dia menjadi bagian orang-orang yang mempropagandakan kesesatan. Termasuk dalam konteks ini, semua tokoh kekkufuran dan kesesatan. Selanjutnya, Allah menerangkan hukuman duniawi dan ukhrawi (yang mesti menimpa mereka). Allah berfirman, “Ia mendapat kehinaan di dunia,” terbukalah kedok buruknya di dunia ini sebelum di akhirat. Peristiwa ini termasuk tanda-tanda kekuasaan Allah yang sangat menakjubkan. Engkau tidak akan menjumpai seorang penyeru dari kalangan propagandis kekufuran dan kesesatan melainkan pasti dia menerima kemarahan, kutukan, kebencian dan celaan di tengah kalangan manusia yang pantas dia terima. Masing-masing tergantung dengan keadaannya. “Dan di Hari KIamat, Kami merasakan kepadanya azab neraka [yang membakar],” maksudnya Kami akan menimpakan kepadanya di Hari Kiamat kelak panasnya neraka yang sangat dahsyat dan nyala apinya yang sangat tinggi. Demikian ini, lantaran amalan yang telah dia perbuat “[dan bahwasanya Allah sekali-kali bukanlah penganiaya hamba-hambaNya].”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hajj ayat 9: Tidak hanya itu. Demikian pula lehernya yang menunjukkan kesombongannya; menolak yang hak dan meremehkan manusia. Dia merasa bangga dengan pengetahuan yang dimilikinya padahal tidak bermanfaat dan merendahkan orang yang benar lagi membawa kebenaran. Yakni dia termasuk pemimpin kesesatan. Yakni dari agama Allah. Syaikh As Sa’diy berkata, “Hal ini termasuk ayat-ayat Allah yang menakjubkan, di mana engkau tidak akan menemukan salah seorang di antara penyeru kekafiran dan kesesatan, kecuali ia akan mendapatkan kemurkaan di alam semesta, mendapatkan laknat, kemarahan, celaan serta sesuatu yang layak baginya, dan masing-masing sesuai keadaannya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hajj Ayat 9",
    "description": "Manusia yang mengingkari Allah dengan hatinya yang gelap, sambil memalingkan lambungnya dengan congkak berusaha dengan segala cara untuk menyesatkan manusia dari jalan Allah. Dia sebenarnya mendapat kehinaan di dunia karena hidup tanpa kecerdasan emosi dan kecerdasan spiritual hingga hidupnya dibiarkan tanpa bimbingan Allah; dan pada hari kiamat sebagai balasan atas kekufurannya, kami berikan kepadanya rasa azab neraka yang membakar hingga kulitnya hangus, kemudian kulitnya diperbarui supaya terus bisa merasakan azab yang membakar. 10. Pada hari kiamat akan dikatakan kepada orang kafir, 'hukuman itu diberikan kepada kamu, karena perbuatan yang dilakukan dahulu oleh kedua tanganmu, menolak agama Allah dan berusaha menyesatkan manusia dari jalan Allah, dan Allah sekali-kali tidak menzalimi hamba-hamba-Nya dengan menghukum mereka yang tidak bersalah."
  }
]