[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Qaf). Pembicaraan tentang huruf-huruf terpisah (di awal surat seperti ini) telah hadir di awal Surat al-baqarah. Allah bersumpah dengan al-Quran yang mulia, yang memiliki keagungan dan kehormatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Qāf. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah. Allah bersumpah dengan Al-Qur`ānul Karīm karena kandungan maknanya, kebaikan dan berkah yang banyak di dalamnya, bahwa kalian pasti akan dibangkitkan pada hari Kiamat untuk mendapatkan perhitungan dan balasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. (ق) Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an. Demi al-Qur’an yang memiliki kemuliaan di atas seluruh perkataan selainnya, sungguh kamu benar-benar utusan Allah -hai Muhammad-, dan sungguh hari kebangkitan pasti akan terjadi. Namun orang-orang kafir Makkah merasa heran dengan kedatangan pemberi peringatan dari kaum mereka, sehingga mereka mengingkarinya. Mereka berkata: “Ini adalah hal yang mengherankan! Jika kami telah meninggal dan tulang belulang kami telah bercampur dengan tanah, apakah kami akan dibangkitkan? Sungguh itu adalah hal mustahil yang tidak mungkin kami percayai!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. قٓ ۚ (Qaaf) Telah dijelaskan pada awal surat al-Baqarah tentang huruf-huruf muqattha’ah seperti yang ada pada awal-awal surat seperti ini. وَالْقُرْءَانِ الْمَجِيدِ (Demi Al Quran yang sangat mulia) Yakni al-Qur’an yang mulia. Pendapat lain mengatakan, yakni yang memiliki kedudukan yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Muslim, Abu Dawud, Al-Baihaqi, dan Ibnu Majah dari Ummu Hisyam binti Haritsah bin Nu’man berkata: “Aku tidak pernah mendengar bacaan {Qaf, Wal qur’aanil majiid} kecuali dari lisan Rasulallah SAW. Beliau membacanya di atas mimbar setiap hari jumat saat berkhutbah kepada orang-orang” 1. Qaf, yaitu huruf hijaiyyah yang menjadi pusat perhatian untuk melemahkan Al-Qur’an dan menantang orang Arab untuk mendatangkan kata serupa, asalkan itu tersusun dari huruf-huruf dalam bahasa mereka. Dan untuk menunjukkan betapa pentingnya kalimat setelahnya. Aku bersumpah demi Al-Qur’an yang bernilai sangat tinggi dan sangat mulia di atas semua kitab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Qāf. Demi Al-Qur’an yang mulia} yang terhormat lagi mulia menurut Allah, dan mengandung banyak kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah bersumpah dengan, “Demi al-Qur’an yang sangat mulia,” maksudnya, yang bermakna amat luas, agung kandungannya, banyak sisinya, banyak berkahnya, penunjuk kepada kebaikan yang agung serta mulia, sifatnya luas dan agung serta mulia, dan kalam yang paling benar yang dengannya al-Quran disifati, yang mencakup ilmu orang-orang yang pertama hingga terakhir, yang mencakup sempurnanya kefasihan, kata-kata yang paling agung dan makna-maknanya yang umum dan indah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 1: Surat ini dimulai dengan huruf muqatha’ah dan ia adalah huruf Qaf, dan telah berlalu atas huruf muqatha’ah pada permulaan surat Al Baqarah. Kemudian huruf (Qaf) ini dijadikan nama bagi surat. Kemudian Allah bersumpah dengan Al Qur’an Al Majid, yaitu yang memiliki kemuliaan, ketinggian dan keagungan. Sungguh engkau wahai Nabi ﷺ diutus oleh Kami dan dibenarkan atas dakwahmu yang dari Rabbmu, yaitu dari dakwah akan hari kebangkitan, hisab, balasan, dan ini adalah jawaban bagi sumpah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah dengan Al Qur’an yang mulia; luas maknanya dan sungguh agung, banyak sisi-sisinya dan banyak berkahnya serta banyak kebaikannya. Majd (mulia) artinya luasnya sifat dan agung, dan ucapan yang paling berhak disifati dengan itu (majd) adalah Al Qur’anul Karim yang mengandung ilmu orang-orang terdahulu dan yang datang kemudian, yang mengandung kefasihan yang paling sempurna dan lafaz yang paling fasih, makna yang paling merata dan paling baik. Hal ini tentu mengharuskan untuk diikuti secara sempurna dan segera tunduk kepadanya serta bersyukur kepada Allah atas nikmat ini. Akan tetapi kebanyakan manusia tidak menghargai nikmat-nikmat Allah dengan penghargaan yang semestinya. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “(Mereka tidak menerimanya) bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 1",
    "description": "Q'f. Allah bersumpah dengan kitab-Nya : demi Al-Qur'an yang mulia. 2. Sesungguhnya kami mengutus engkau wahai nabi Muhammad sebagai rasul untuk menyampaikan wahyu-wahyu kami, tetapi kaum musyrik mekah mengingkarinya, bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari kalangan mereka sendiri yang mempunyai kebiasaan makan, minum dan berkeluarga sebagaimana manusia pada umumnya. Maka berkatalah orang-orang kafir, 'ini adalah suatu yang sangat ajaib. '"
  }
]