[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami juga menumbuhkan kurma tinggi ke atas, yang mempunyai pucuk yang sebagian tersusun dari sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan Kami tumbuhkan dengan air itu pohon kurma yang panjang dan tinggi yang mempunyai mayang yang bersusun, sebagian berada di atas sebagian yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَالنَّخْلَ بَاسِقٰتٍ (dan pohon kurma yang tinggi-tinggi) Makna (الباسقات) yakni menjulang tinggi. لَّهَا طَلْعٌ نَّضِيدٌ(yang mempunyai mayang yang bersusun-susun) Makna (الطلع) yakni permulaan buah kurma yang muncul. Sedangkan (النضيد) yakni saling bertumpuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kami juga menumbuhkan kurma yang memiliki ciri pohon tinggi dan buah yang tersusun, yaitu saling tersusun ke atas satu sama lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan pohon-pohon kurma yang tinggi} yang menjulang tinggi {yang mayangnya bersusun-susun} yang buahnya saling bersusun satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-11. Allah secara khusus menyebutkan berbagai kebun dari berbagai manfaat tersebut, kebun yang mencakup berbagai jenis buah-buahan lezat seperti anggur, delima, lemon, apel dan jenis buah-buahan lainnya, terdapat juga pohon kurma yang tinggi, yang manfaatnya untuk waktu yang panjang, tinggi menjulang ke langit hingga tingginya tidak bisa dicapai oleh berbagai pohon lain, dari mayangnya keluar buah sebagai rizki untuk para hamba sebagai makanan, lauk dan buah yang bisa dimakan dan disimpan untuk mereka dan binatang ternak mereka. Begitu juga yang dikeluarkan oleh Allah melalui hujan serta pengaruhnya yang berupa sungai yang ada di permukaan bumi yang dibawahnya terdapat “biji-biji tanaman yang diketam,” yang berupa gandum, jagung, beras, jewawut dan lainnya. Memandang dan merenungkan semua hal itu adalah, “untuk menjadi pelajaran,” yang bisa membuka mata hati orang yang diliputi kebodohan dan “peringatan,” yang dijadikan sebagai peringatan yang berguna di dunia dan akhirat, dijadikan sebagai peringatan terhadap berita yang disampaikan Allah dan RasulNya. Namun hal itu tidak berlaku bagi semua orang, ia hanya berlaku bagi, “tiap-tiap hamba yang kembali (mengingat Allah).” Menghadap kepadaNya dengan rasa cinta, takut, pengharapan serta terkabulnya doanya. Adapun orang-orang yang mendustakan atau berpaling itu, maka ayat-ayat dan berbagai peringatan tidaklah berguna bagi orang-orang yang tidak beriman. Kesimpulannya, semua penciptaan menawan, kekuatan dan kekokohan merupakan bukti kesempurnaan Kuasa Allah. Semua keindahan, kerapian, keelokan bentuk serta ciptaan merupakan bukti bahwa Allah adalah Dzat yang paling bijaksana, Dia Maha Mengetahui segala sesuatu. Semua manfaat dan kepentingan untuk para hamba merupakan bukti kasih sayang Allah yang meliputi semua makhluk hidup. Semua keagungan bentuk serta rapinya peraturan merupakan bukti bahwa Allah adalah Maha Esa, yang tidak memiliki sekutu sama sekali, Dia-lah Dzat yang semua bentuk ibadah, ketundukan, dan kecintaan hanya ditujukan padaNya. Bumi yang dihidupkan setelah sebelumnya mati dan gersang merupakan bukti bahwa Allah Kuasa menghidupkan kembali orang-orang yang sudah mati, agar Allah bisa memberikan balasan atas mereka, karena itulah Allah berfirman, “Kami hidupkan dengan air itu tanah yang mati (kering). Seperti itulah terjadinya kebangkitan (kembali nanti).” Setelah mereka diingatkan dengan berbagai tanda-tanda kekuasaan Allah yang ada di langit dan bumi, setelah ditakut-takuti dengan siksaan yang menimpa berbagai umat sebelumnya agar mereka tidak terus menerus mendustakan sehingga akan tertimpa sebagaimana yang pernah menimpa saudara-saudara mereka yang juga mendustakan, Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 10: Allah menjelaskan bahwasanya dia menumbuhkan dengan hujan ini apa yang Ia jadikan atas ciptaan-Nya dengan zaman yang panjang, seperti pepohonan kurma yang penuh dengan buah-buahan, yang saling bertindih satu sama lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 10",
    "description": "Dan kami tumbuhkan pula pohon kurma yang tinggi-tinggi yang mempunyai mayang yang bersusun-susun karena banyak sekali buahnya. 11. Itu semua kami ciptakan sebagai rezeki bagi hamba-hamba kami, dan kami ingatkan bahwa kami hidupkan dengan air itu negeri yang mati, yakni kami hidupkan tanah yang tandus yang tidak terdapat padanya tumbuh-tumbuhan sehingga menjadi tanah yang subur dan dapat menumbuhkan bermacam-macam tanaman yang indah. Seperti itulah, kekuasaan Allah menghidupkan sesuatu yang mati, terjadinya kebangkitan manusia dari kuburnya."
  }
]