[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-14. Sebelum orang-orang musyrik dari Quraisy, kaum Nuh,-orang yang mendiami sumur, kaum Tsamud, Ad, Fir’aun, kaum Luth, penduduk Aikah kaum Syu’aib dan kaum Tubba’ al-Himyari. Mereka semuanya mendustakan utusan-utusan Allah kepada mereka, maka menjadi pasti ancaman Allah atas mereka yang sebelumnya Dia ancamkan karena kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Kaum 'Ād, Fir'aun dan kaum nabi Lūṭ juga telah mendustakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَإِخْوٰنُ لُوطٍ (dan kaum Luth) Yakni kaum yang kepada mereka diutus nabi Luth, yang merupakan menduduk kota Sodom dan Umurah yang terletak di negeri Palestina."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Begitu juga Kaum ‘Aad yang merupakan kaumnya nabi Hud, Fir’aun yang menjadi raja Mesir dan kaumnya, dan kaum nabi Luth, mereka itu mendustakan hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kaum ‘Ad, Fir‘aun, kaum Luth"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-14. Orang-orang dari kalangan beberapa umat sebelum mereka telah mendustakan para rasul mereka yang mulia dan para nabi mereka yang agung seperti Nabi Nuh yang didustakan oleh kaumnya, kaum Tsamud yang mendustakan Nabi Shalih, kaum ‘Ad yang mendustakan Nabi Hud, kaum nabi Luth yang mendustakannya, kaum Aikah yang mendustakan Nabi Syu’aib, kaum Tubba’ (para raja Yaman yang pada masa lalu sebelum Islam) juga mendustakan para rasul yang diutus oleh Allah kepada mereka, hanya saja Allah tidak memberitahukan kepada kita siapakah para rasul yang diutus ke kaum Tubba’ itu dan siapakah Tubba’ itu, karena –wallahu a’lam- hal itu sudah masyhur di kalangan bangsa Arab, khususnya peristiwa-peristiwa besar seperti ini. Mereka semua mendustakan para rasul yang diutus oleh Allah kepada mereka sehingga mereka pantas menerima ancaman serta hukuman dari Allah. Kalian wahai orang-orang yang mendustakan Rasulullah, tidaklah lebih baik dari mereka, para rasul mereka juga tidak lebih mulia di sisi Allah dari rasul kalian. Untuk itu waspadalah terhadap kejahatan mereka agar kalian tidak tertimpa azab yang menimpa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 13: Begitu juga kaum Ad yang mendustakan nabi mereka Hud, begitu juga Firaun yang mendustakan beserta kaumnya, Musa. Begitu juga kaum Nabi Luth yang mendustakan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 13",
    "description": "Dan demikian juga kaum 'ad, yakni kaum nabi hud, kaum fir'aun, yang ditenggelamkan dalam laut, dan kaum lut, yang diporakporandakan pemukiman mereka akibat merajalelanya homoseksual di kalangan mereka, 14. Dan (juga) penduduk aikah, yaitu kaum nabi syu'aib, serta kaum tubba', yaitu penduduk negeri yaman, juga dibinasakan Allah. Semua-Nya telah mendustakan rasul-rasul maka berlakulah ancaman-ku atas mereka."
  }
]