[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah Kami tidak sanggup memulai penciptaan pertama yang sebelumnya bukan sesuatu lalu Kami pun juga tidak sanggup mengembalikan mereka sebagai makhluk baru sesudah mereka fana? Semua itu tidak melemahkan Kami, sebaliknya Kami mampu melakukannya. Tetapi mereka dalam kebimbangan dan kebingungan tentang perkara kebangkitan kembali dan dikumpulkan (pada Hari Kiamat)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Apakah Kami lemah dalam menciptakan kalian yang pertama sehingga Kami menjadi lemah dalam membangkitkan kalian? Justru mereka berada dalam keraguan tentang penciptaan yang baru setelah penciptaan mereka yang pertama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. أَفَعَيِينَا بِالْخَلْقِ الْأَوَّلِ ۚ (Maka apakah Kami letih dengan penciptaan yang pertama?) Yakni Kami telah menciptakan mereka dahulu sebelum mereka menjadi sesuatu apapun, maka apakah Kami menjadi tidak mampu untuk membangkitkan mereka? بَلْ هُمْ فِى لَبْسٍ مِّنْ خَلْقٍ جَدِيدٍ(Sebenarnya mereka dalam keadaan ragu-ragu tentang penciptaan yang baru) Yakni mereka dalam keraguan dan kebingungan tentang penciptaan mereka kembali, yaitu kebangkitan orang-orang mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Apakah kami tidak mampu memulai penciptaan makhluk, sehingga kami tidak mampu mengembalikan mereka lagi setelah mati? Itu adalah ejekan bagi orang-orang yang mengingkari hari kebangkitan dan sebagai jawaban atas untuk meniadakan argument mereka tentang kebangkitan kembali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah Kami letih} Apakah Kami lelah {dengan penciptaan yang pertama. bahkan mereka dalam keadaan ragu} kebingungan dan keraguan {tentang penciptaan yang baru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Kemudian Allah beristidlal dengan penciptaan pertama untuk penciptaan yang lain (kebangkitan kembali nanti). Sebagaimana Allah menciptakan mereka dari ketiadaan, Allah juga akan mengembalikan mereka lagi setelah mereka mati dan setelah mereka menjadi bangkai yang hancur. Allah berfirman, “Maka apakah Kami letih,” apakah Kami lemah dan tidak mampu, “dengan penciptaan yang pertama,” tidaklah demikian halnya. Kami tidak lemah dan letih untuk hal itu dan mereka sendiri pun tidak meragukan hal itu, hanya saja “sebenarnya mereka dalam keadaan ragu-ragu tentang penciptaan yang baru (nanti itu).” Inilah yang membuat mereka ragu dan tidak jelas halnya, padahal sebenarnya tidak ada tempat bagi ketidakjelasan, sebab mengembalikan itu tentu lebih mudah daripada memulai, sebagaimana yang disebutkan dalam Firman Allah, \"Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya.\" -Rum:27-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 15: Kemudian Allah mengulangi pembicaraan atas urusan hari kebangkitan yang diingkari oleh umat-umat terdahulu, Allah berkata: Apakah kami lemah, ketika kami menciptakan mereka orang-orang musyrik pada pertama kalinya dan menjadikan mereka dari ketiadaan? Maka jika menciptakan dan mengadakan untuk pertama kalinya tidak memberatkan kami; Maka apakah mengembalikan mereka lebih susah bagi kami dan kuasa Kami? ; bahkan mereka orang-orang musyrik dalam keraguan atas kekuasaan Kami menciptakan mereka untuk kedua kalinya setelah kematian mereka dan kebinasaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala berdalih dengan penciptaan-Nya yang pertama untuk menunjukkan berkuasanya Dia mengulangi penciptaan kembali. Yakni sama sekali tidak, sehingga Dia tidak pula letih mengulangi penciptaan kembali, bahkan mengulangi penciptaan lebih ringan bagi-Nya daripada memulai pertama kali. Yaitu pembangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 15",
    "description": "Maka apakah kami letih yakni tidak mampu lagi melakukan penciptaan dengan sebab telah melakukan penciptaan yang pertama' sama sekali kami tidak letih! kami mampu untuk menciptakan yang baru dan itu lebih mudah bagi kami. Sesungguhnya bahkan mereka, orang kafir itu, dalam keadaan ragu-ragu tentang penciptaan yang baru, yakni membangkitkan manusia setelah kematiannya. 16. Pada ayat ini diterangkan bahwa Allah mengetahui apa yang dibisikkan oleh manusia dan tidak ada sesuatu pun yang samar atau tersembunyi bagi-Nya. Dan sungguh, kami, yakni Allah dengan kuasa-Nya bersama ibu bapak yang dijadikannya sebagai perantara telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, baik kebaikan maupun kejahatan, dan kami lebih dekat kepadanya daripada urat lehernya. Yakni Allah maha mengetahui keadaan manusia walau yang paling tersembunyi sekali pun."
  }
]