[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah menciptakan manusia, dan Kami mengetahui apa yang dibicarakan oleh hatinya. Kami lebih dekat kepadanya daripada hablil warid, yaitu urat lehernya yang bersambung dengan hati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan Kami telah menciptakan manusia dan Kami mengetahui apa yang dibisikkan oleh jiwanya berupa lintasan-lintasan dan pemikiran-pemikiran, dan Kami lebih dekat kepadanya daripada urat yang berada di lehernya yang tersambung dengan jantungnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-18. Sungguh Kami telah menciptakan manusia dan Kami mengetahui rahasia yang diucapkan pada dirinya sendiri, dan Kami -dengan ilmu Kami- lebih dekat kepadanya daripada urat yang ada di lehernya yang terhubung dengan jantung. Ketika dua malaikat mencatat perkataan dan perbuatan manusia; salah satunya berada di sebelah kanannya untuk mencatat kebaikan, dan yang lain berada di sebelah kirinya untuk mencatat keburukan. Tidaklah seseorang berbicara melainkan malaikat mengawasi perkataan dan perbuatannya, malaikat itu selalu bersamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَنَعْلَمُ مَا تُوَسْوِسُ بِهِۦ نَفْسُهُۥ ۖ (Dan sesungguhnya Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya) Yakni apa yang terbesit dalam hati dan perasaannya. وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ(dan Kami lebih dekat kepadanya daripada urat lehernya) Makna (الوريد) yakni pembuluh darah yang menuju jantung. Yakni Kami lebih dekat kepadanya daripada pembuluh darahnya sendiri, maka bagaimana akan tersembunyi dari Kami apa yang ada dalam hatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Demi Allah, sungguh kami telah menciptakan manusia dan mengetahui apa yang dibicarangan oleh dirinya dengan sembunyi-sembunyi. Kami lebih dekat dengannya daripada pembuluh darah yang ada di bagian depan leher yang di dalamnya darah mengalir dan kembali ke jantung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menciptakan manusia dan mengetahui apa yang dibisikkan} yang dibicarakan {oleh dirinya. Kami lebih dekat kepadanya daripada urat lehernya} urat leher yang terhubung dengan jantung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Allah memberitahukan bahwa Dia-lah semata yang menciptakan jenis manusia, baik lelaki maupun perempuan, Dia yang mengetahui hal-ihwal manusia serta rahasia mereka dan bisikan jiwa mereka, dan sesungguhnya Dia “lebih dekat kepadanya daripada urat lehernya,” yang merupakan sesuatu yang terdekat pada manusia yaitu urat saraf yang tersimpan dibalik urat lehernya. Hal ini menyeru manusia untuk selalu muraqabah terhadap Pencipta yang mengetahui hati dan batinnya, yang lebih dekat kepadanya dalam berbagai keadaannya sehingga manusia akan merasa malu ketika Allah melihatnya melakukan yang dilarang atau tidak melaksanakan yang diperintahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 16: Dan di antara bukti kekuasaan Allah bahwasanya Allah menciptakan manusia dan menjadikannya ada dari ketiadaan, dan bahwasanya Allah mengetahui hal yang membahayakan, serta apa yang disembunyikan dalam hati. Sungguh Allah Maha Dekat daripada urat leher, yaitu urat yang mengalirkan darah yang terhubung kepada jantung, maka tiada yang tersembunyi bagi Allah sesuatu pun selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia sendiri yang menciptakan manusia, baik yang laki-laki maupun yang perempuan. Dia mengetahui keadaan mereka, apa yang mereka sembunyikan dan apa yang dibisikkan oleh hati mereka, dan Dia lebih dekat kepada manusia daripada urat lehernya dengan ketinggian Dzat-Nya. Hal ini menghendaki manusia untuk selalu merasakan pengawasan Allah yang mengetahui hati dan batin mereka, sehingga mereka merasa malu jika berbuat maksiat karena senantiasa dilihat-Nya. Demikian pula hendaknya mereka mengetahui bahwa para malaikat yang mencatat ada bersamanya di sebelah kanan dan sebelah kirinya, sehingga mereka menghormatinya dan berhati-hati agar tidak mengerjakan atau mengucapkan kata-kata yang tidak diridhai Allah Rabbul ‘aalamin yang kemudian akan dicatat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 16",
    "description": "Pada ayat ini diterangkan bahwa Allah mengetahui apa yang dibisikkan oleh manusia dan tidak ada sesuatu pun yang samar atau tersembunyi bagi-Nya. Dan sungguh, kami, yakni Allah dengan kuasa-Nya bersama ibu bapak yang dijadikannya sebagai perantara telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, baik kebaikan maupun kejahatan, dan kami lebih dekat kepadanya daripada urat lehernya. Yakni Allah maha mengetahui keadaan manusia walau yang paling tersembunyi sekali pun. 17. Ingatlah ketika dua malaikat mencatat perbuatan manusia, yang satu duduk di sebelah kanan, yaitu malaikat yang mencatat kebaikan dan yang lain di sebelah kiri, yaitu malaikat yang mencatat kejahatan."
  }
]