[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saat dua malaikat yang disiapkan di kanan dan kirinya mencatat amal-amalnya. Yang kanan menulis kebaikan-kebaikan dan yang kiri menulis keburukan-keburukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Ketika dua malaikat yang mencatat amal perbuatannya, salah satunya duduk di sebelah kanannya dan yang kedua duduk di sebelah kirinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. إِذْ يَتَلَقَّى الْمُتَلَقِّيَانِ عَنِ الْيَمِينِ (ketika dua orang malaikat mencatat amal perbuatannya, seorang duduk di sebelah kanan) Mereka adalah dua malaikat yang ditugaskan untuk mencatat amal manusia, mereka akan mengawasi apa yang dikatakan dan dilakukan oleh seseorang, kemudian mencatatnya. وَعَنِ الشِّمَالِ قَعِيدٌ(dan yang lain duduk di sebelah kiri) Yakni yang satu duduk di sebelah kanan dan yang lainnya duduk di sebelah kiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Ingatlah saat dua malaikat yang mendampingi manusia mencatat apa yang dia bicarakan. Salah satunya duduk di sebelah kanan untuk mecatat kebaikannya dan yang lain duduk di sebelah kiri untuk mencatat amal buruknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika duduk} duduk {dua malaikat mencatat} dua malaikat yang ditugaskan mengawasi manusia {di sebelah kanan} duduk {dan di sebelah kiri duduk} duduk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Begitu juga manusia harus menempatkan para malaikat mulia yang menulis semua amalnya di dalam pikirannya, para malaikat dimuliakan dan dihormati dan selalu waspada untuk tidak berbuat atau berkata sesuatu yang dicatat yang tidak diridhoi oleh Rabb semesta alam. Karena itulah Allah berfirman, “Ketika dua orang malaikat mencatat amal perbuatannya,” yakni mencatat semua amal manusia, satu berada “di sebelah kanan,” yang mencatat segala amal baik, dan lainnya “di sebelah kiri,” yang mencatat seluruh amal buruk, masing-masing dari kedua malaikat itu terikat untuk tugas tersebut, disiapkan untuk tugasnya yang dipersiapkan untuknya dan tetap senantiasa melakukan tugas itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 17: Allah mengabarkan bawa disana ada 2 malaikat yang mencatat seluruh amalan-amalan seorang hamba, salah satu di antara mereka ada di kanan untuk menulis amalan-amalan kebaikan, dan salah satunya lagi ada di kiri untuk menulis amalan-amalan buruk. Allah tidak membutuhkan pengkabaran atas amalan-amalan yang telah dicatat malaikat dari hamba-nya, akan tetapi Allah yang wajib dibutuhkan oleh makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang mencatat amal baiknya. Yang mencatat amal buruknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 17",
    "description": "Ingatlah ketika dua malaikat mencatat perbuatan manusia, yang satu duduk di sebelah kanan, yaitu malaikat yang mencatat kebaikan dan yang lain di sebelah kiri, yaitu malaikat yang mencatat kejahatan. 18. Tidak ada suatu kata yang diucapkannya, yang mengandung keba-ikan maupun kejahatan, melainkan ada di sisinya malaikat pengawas yang selalu siap mencatat dengan sangat teliti."
  }
]