[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seseorang tidak mengeluarkan kata-kata dan berbicara, kecuali di sisinya ada malaikat yang mengawasi ucapannya dan menulisnya, malaikat yang selalu hadir dan disiapkan untuk melakukan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Tidak ada satu ucapan pun yang diucapkan kecuali di dekatnya ada Malaikat yang mengawasi apa yang diucapkannya dan selalu hadir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Tidak ada kata atau kalimat yang diucapkan manusia kecuali ada malaikat yang dekat dengan ucapan dan tindakannya lalu mencatat dan menjaganya. Dia ada di sisinya dan tidak dapat dipisahkan, untuk menulis kebaikan dan keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada suatu kata pun yang terucap, melainkan ada di sisinya malaikat pengawas} malaikat yang mengawasi dan mencatat ucapannya {lagi selalu siap} menyaksikan lagi siap untuk itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Tiada suatu ucapan pun yang diucapkan,” baik ataupun buruk “melainkan ada di dekatnya malaikat pengawas yang selalu hadir,” yakni selalu mengawasinya dan menyaksikan hal ihwalnya, seperti yang disebutkan dalam Firman Allah, \"Padahal sesungguhnya bagi kamu ada (malaikat-malaikat) yang mengawasi (pekerjaanmu), yang mulia (di sisi Allah) dan mencatat (pekerjaan-pekerjaanmu itu. mereka mengetahui apa yang kamu kerjakan.\" -Al Infithar:10-12"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 18: Allah menjelaskan bahwa apa yang manusia ucapkan maupun yang tidak diucapkan dari kebaikan maupun kejelekan, kecuali di sisi seorang hamba bersiap malaikat Raqib yang senantiasa hadir untuk menulis, atas apa yang dikatakan seorang hamba."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini sebagaimana firman Allah Ta’ala, “Padahal Sesungguhnya bagi kamu ada (malaikat-malaikat) yang mengawasi (pekerjaanmu),--Yang mulia (di sisi Allah) dan mencatat (pekerjaan-pekerjaanmu itu),--Mereka mengetahui apa yang kamu kerjakan.” (Terj. Al Infithar: 10-12)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 18",
    "description": "Tidak ada suatu kata yang diucapkannya, yang mengandung keba-ikan maupun kejahatan, melainkan ada di sisinya malaikat pengawas yang selalu siap mencatat dengan sangat teliti. 19. Dan datanglah sakaratul maut dengan sebenar-benarnya, yakni pasti dan tidak dapat dihindari oleh siapa pun. Datangnya kematian itulah yang dahulu hendak kamu hindari."
  }
]