[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sakratul maut dengan kesulitannya datang dengan kebenaran yang tidak bisa ditolak dan tidak bisa berlari darinya. Itulah yang berusaha kamu hindari dan kamu berlari darinya (wahai manusia)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan telah datang kerasnya kematian dengan sebenar-benarnya, yang tidak ada tempat lari darinya. Dan itulah yang kamu -wahai manusia yang lalai- selalu berusaha berpaling dan lari darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-22. Orang yang mendustakan ayat-ayat Allah ini didatangi sakaratul maut yang membawa perkara yang sangat menakutkan; perkara berat yang dahulu kamu hindari. Dan malaikat meniup sangkakala tiupan yang kedua, itulah waktu yang sangat menakutkan, yang merupakan hari yang Allah janjikan kepada orang-orang kafir, dan setiap orang akan digiring oleh malaikat ke padang mahsyar, dan malaikat yang lain menjadi saksi atas apa yang ia lakukan di dunia. Hai orang yang kafir, sungguh kamu dahulu lalai dari kejadian mengerikan ini, maka sekarang Kami singkap penutup yang dahulu menutupi hati, pendengaran, dan penglihatanmu di dunia; sehingga hari ini penglihatanmu sangat tajam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَجَآءَتْ سَكْرَةُ الْمَوْتِ (Dan datanglah sakaratul maut) Yakni datang keras dan sakitnya kematian yang menimpa manusia, yang mengalahkan akal pikirannya. بِالْحَقِّ ۖ (dengan sebenar-benarnya) Yakni ketika kematian datang, jelaslah kebenaran yang sesungguhnya. Akan nampak kebenaran kabar tentang kebangkitan, surga, dan neraka yang dikabarkan oleh para Rasul. ذٰلِكَ (Itulah) Yakni kematian itu. مَا كُنتَ مِنْهُ تَحِيدُ (yang kamu selalu lari daripadanya) Yakni yang selalu kalian jauhi dan hindari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Telah datang kematian yang sangat menyakitkan dan mengacaukan akal orang kafir tentang hakikat setiap perkara yang diingkarinya berupa perkara akhirat. Itulah kematian yang kamu hindari dan takuti. Saat sakaratul maut, ditampakkan kepada orang kafir itu kebenaran sesuatu yang dibawa oleh para rasul, berupa kabar tentang hari kebangkitan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan datanglah sakratul maut} kedahsyatan kematian {dengan sebenar-benarnya. Itulah yang dahulu hendak kamu hindari} kalian hindari dan lari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Artinya, orang yang lari serta mendustakan ayat-ayat Allah ini didatangi oleh “sakaratul maut yang sebenar-benarnya,” yang tidak bisa ditolak dan dihindari. “Itulah yang kamu selalu lari dari padanya,” yang kau hindari dan lari darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 19: Maka sungguh telah datang kepadamu wahai manusia kesengsaraan dari kematian dan kengerian dengan sebenar-benarnya, yang tidak ada tempat untuk lari darinya, di mana engkau akan berusaha lari dan meloloskan diri darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang yang lalai lagi mendustakan ayat-ayat Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 19",
    "description": "Dan datanglah sakaratul maut dengan sebenar-benarnya, yakni pasti dan tidak dapat dihindari oleh siapa pun. Datangnya kematian itulah yang dahulu hendak kamu hindari. 20. Dan ditiuplah sangkakala, pada hari kiamat itulah hari yang diancamkan, hari kebangkitan manusia untuk mempertanggung jawabkan perbuatannya."
  }
]