[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mendustakan Rasul itu merasa heran saat mereka didatangi oleh seorang dari kalangan mereka yang memberi peringatan tentang azab Allah kepada mereka. Maka orang-orang yang kafir kepada Allah dan RasulNya berkata, “Ini adalah sesuatu yang aneh yang mengundang keheranan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Sebab mereka menolakmu bukan karena mereka menganggap kamu berdusta. Mereka tahu kejujuranmu, akan tetapi mereka heran dengan kedatangan seorang utusan yang memberi peringatan kepada mereka dari jenis mereka sendiri (manusia), bukan dari jenis malaikat, dan mereka berkata dalam keheranan, “Kedatangan seorang rasuln dari golongan manusia kepada kami sungguh sesuatu yang mengherankan!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. بَلْ عَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ (bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri) Yakni orang-orang kafir merasa heran ketika seseorang diantara mereka menjadi seorang pemberi peringatan, yaitu Muhammad. Mereka tidak hanya merasa ragu, namun juga menganggapnya sebagai hal yang mengherankan. فَقَالَ الْكٰفِرُونَ هٰذَا شَىْءٌ عَجِيبٌ(maka berkatalah orang-orang kafir: “Ini adalah suatu yang amat ajaib”) Yakni keheranan mereka terhadap seorang Rasul yang merupakan manusia seperti mereka, serta keheranan mereka tehadap adanya hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Bahkan orang-orang musyrik terkejut dengan datangnya utusan yang memberi peringatan tentang hukuman Allah bagi orang yang bermaksiat kepadaNya, yaitu Muhammad SAW, lalu kenapa mereka ragu? Bahkan mereka berkata: “Peringatan ini, panggilan untuk bertauhid kepada Allah, dan keimanan pada hari kebangkitan adalah sesuatu yang mengejutkan”. Bal berfungsi untuk berpindah dari satu kalimat ke kalimat lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bahkan mereka heran karena telah datang kepada mereka seorang pemberi peringatan dari kalangan mereka} rasul dari kalangan mereka {Orang-orang kafir berkata,“Ini adalah sesuatu yang mengherankan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Hal ini mengharuskan untuk diikuti serta dipatuhi secara cepat serta bersyukur kepada Allah atas karuniaNya, hanya saja kebanyakan manusia tidak memuliakan nikmat-nikmat Allah dengan sebenarnya. Karena itulah Allah berfirman, “(Mereka tidak menerimanya) bahkan mereka tercengang,” yakni, mereka yang mendustakan Rasulullah, “karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri,” yakni, memberi peringatan kepada mereka akan sesuatu yang membahayakan mereka dan memerintahkan mereka pada yang bermanfaat untuk mereka. Dan pembawa berita ancaman itu (Rasulullah) berasal dari kalangan mereka yang memungkinkan bagi mereka untuk menemuinya serta mengetahui hal-ihwal serta kebenarannya, namun mereka tercengang terhadap urusan yang tidak seharusnya diperlakukan seperti itu, bahkan orang yang mengerti dan memahami orang yang tercengang pun ikut tercengang, “maka berkatalah orang-orang kafir,” yakni orang-orang yang diseret oleh kekufuran serta kedustaan mereka meski kecerdasan dan pandangan mereka tidak ada kekurangannya, “Ini adalah suatu yang amat ajaib,” yakni, sesuatu yang aneh. Orang-orang yang berada dalam rasa heran ini kemungkinan berada di antara dua hal; adakalanya mereka benar dalam rasa heran itu dan hal itu menunjukkan puncak kebodohan mereka serta lemahnya akal mereka, sama seperti orang gila yang merasa aneh terhadap perkataan orang berakal, seperti pengecut yang merasa kagum ketika bertemu dengan pasukan berkuda, seperti orang pelit yang merasa aneh terhadap sikap derma orang dermawan, lantas bahaya apa yang bisa menyamai keheranan orang yang kondisinya seperti ini? Tidakalah rasa heran orang seperti itu melainkan itu adalah sebagian indikasi yang menunjukkan kebodohan serta kezhalimannya. Kemungkinan kedua adalah adakalanya mereka yang merasa heran itu karena mereka mengetahui kesalahan mereka dalam perasaan tersebut dan tindakan ini termasuk kezhaliman terbesar dan paling keji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 2: Allah mengabarkan bahwasanya orang-orang kafir yang mendustakan Rasul ﷺ mereka merasa heran dengan kedatangan pemberi peringatan dari kalangan manusia yaitu Muhammad ﷺ, yang memberi peringatan kepada mereka akan hari kebangkitan, lalu kemudian mereka mendustakannya mengingkarinya, mereka berkata: Sungguh hari kebangkitan jangan kau berbicara tentangnya wahai Muhammad, sangat mengherankan dan asing, serta jauh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang mendustakan Rasulullah shallallahu 'alaihi wa sallam. Yaitu Rasul yang memperingatkan mereka dengan neraka. Atau maksudnya, Beliau memperingatkan mereka sesuatu yang memadharratkan mereka agar mereka menjauhinya dan memerintahkan sesuatu yang bermanfaat bagi mereka. Beliau berasal dari jenis mereka sendiri yang memungkinkan mereka untuk menimba ilmu dari Beliau serta mengetahui keadaan Beliau serta kejujurannya. Namun mereka heran terhadap sesuatu yang tidak pantas diherankan. Dimana kekafiran dan pendustaan mereka mendorong mereka untuk mengatakan seperti yang disebutkan dalam ayat di atas, bukan karena kurangnya kecerdasan dan pandangan mereka. Yakni sesuatu yang aneh, dimana keadaan mereka dalam dua kemungkinan; bisa anggapan aneh itu benar-benar terjadi pada mereka, maka jika demikian menunjukkan dalamnya kebodohan mereka dan lemahnya akal mereka seperti halnya orang yang gila yang menganggap aneh kata-kata orang yang berakal dan seperti orang yang bakhil yang merasa heran terhadap kedermawanan orang yang dermawan, dan keheranan mereka menunjukkan dalamnya kezaliman dan kebodohan mereka, atau bisa saja mereka heran karena tahu kesalahan mereka, maka ini merupakan kezaliman yang paling besar dan paling buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 2",
    "description": "Sesungguhnya kami mengutus engkau wahai nabi Muhammad sebagai rasul untuk menyampaikan wahyu-wahyu kami, tetapi kaum musyrik mekah mengingkarinya, bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari kalangan mereka sendiri yang mempunyai kebiasaan makan, minum dan berkeluarga sebagaimana manusia pada umumnya. Maka berkatalah orang-orang kafir, 'ini adalah suatu yang sangat ajaib. ' 3. Setelah menyaksikan bahwa kehadiran rasul itu membawa peringatan tentang hari kebangkitan, dengan penuh rasa keingkaran dan cemoohan, orang-orang kafir itu berkata, \"apakah apabila kami telah mati dan sudah menjadi tanah akan kembali lagi' itu adalah suatu pengembalian yang tidak mungkin, dan sangat jauh dari penerimaan akal. Karena bagaimana mungkin jasmani yang sudah bercampur dengan tanah dapat kembali seperti semula. \"."
  }
]