[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sangkakala ditiup untuk kedua kalinya, tiupan kebangkitan. Tiupsn itulah merupakan hari terwujudnya ancaman Allah yang Dia ancamkan kepada orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan malaikat yang ditugaskan untuk meniup terompet telah meniupnya dengan tiupan kedua, itulah hari Kiamat, hari ancaman bagi orang-orang kafir dan para pelaku maksiat dengan siksaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَنُفِخَ فِى الصُّورِ ۚ (Dan ditiuplah sangkakala) Yakni tiupan terakhir yang membangkitkan seluruh makhluk. ذٰلِكَ يَوْمُ الْوَعِيدِ (Itulah hari terlaksananya ancaman) Yang diancamkan Allah bagi orang-orang kafir dengan azab di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Pada saat itu ditupkan tiupan kebangkangkitan. Itu adalah tiupan kedua. Hari itu adalah hari yang dijanjikan oleh Allah kepada orang kafir. Itu adalah hari terpenuhinya janji dan terwujudnya azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan sangkakala ditiup} sangkakala {Itulah hari yang dijanjikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Dan ditiuplah sangkakala. Itulah hari terlaksananya ancaman,” hari di mana orang-orang zhalim akan menuai ancaman Allah berupa azab, hari di mana orang-orang yang beriman akan menuai janji Allah berupa pahala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 20: Allah mengabarkan bahwasanya akan ditiup sangkakala untuk kebangkitan, yaitu di mana hari yang Allah janjikan bagi orang-orang kafir dengan azab, dan Allah janjikan bagi orang-orang yang beriman dengan ganjaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang kafir dengan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 20",
    "description": "Dan ditiuplah sangkakala, pada hari kiamat itulah hari yang diancamkan, hari kebangkitan manusia untuk mempertanggung jawabkan perbuatannya. 21. Pada hari itu setiap orang akan datang bersama malaikat penggiring ke padang mahsyar dan malaikat yang menjadi saksi atas amal diperbuat oleh manusia di dunia."
  }
]