[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setiap jiwa datang dengan dua malaikat. Salah satunya menggiringnya ke padang mahsyar dan satunya lagi bersaksi atas apa yang dilakukannya di dunia, baik kebaikan maupun keburukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan setiap jiwa datang bersama malaikat yang menggiringnya dan malaikat yang menjadi saksi atas perbuatannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَجَآءَتْ كُلُّ نَفْسٍ مَّعَهَا سَآئِقٌ وَشَهِيدٌ (Dan datanglah tiap-tiap diri, bersama dengan dia seorang malaikat penggiring dan seorang malaikat penyaksi) Yakni dia akan diiringi oleh malaikat yang menggiringnya dan malaikat yang akan bersaksi terhadapnya. Mujahid berpendapat bahwa penggiring dan pemberi kesaksian itu adalah dari malaikat. Dan pendapat lain mengatakan bahwa penggiring itu merupakan malaikat yang mencatat amalan-amalan buruk, sedangkan pemberi kesaksian adalah malaikat yang mencatat amalan-amalan baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Pada hari itu setiap jiwa dibawa menuju padang mahsyar dengan diiringi oleh malaikat yang menggiringnya menuju padang mahsyar. Saksi dari golongan malaikat bersaksi untuknya tentang amal baik atau amal buruknya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu setiap orang akan datang bersama penggiringnya} malaikat yang menggiringnya menuju tempat berkumpul {dan saksi} malaikat yang menjadi saksi atas apa yang telah dia perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Dan datanglah tiap-tiap diri, bersama dengan dia seorang malaikat penggiring,” yang akan menggiringnya ke tempat pemberhentian pada Hari Kiamat, sehingga setiap diri tidak mungkin untuk tidak mendatangi tempat itu, “dan seorang malaikat saksi,” yang akan memberikan kesaksian tentang semua amalnya, baik dan buruknya. Ini menunjukkan perhatian Allah terhadap para hambaNya dan Allah menjaga amal-amalnya kemudian dibalas secara adil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 21: Kemudian pada hari itu datang setiap jiwa bersamanya malaikat yang menuntunnya, yaitu yang menuntunnya menuju ke Allah dan menjadi saksi atas amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menggiringnya ke tempat pemberhentian di hari Kiamat, sehingga ia tidak dapat menolaknya atau mundur. Yang akan menjadi saksi terhadap amalnya; baik atau buruk, seperti tangan, kaki dan lainnya. Ini menunjukkan perhatian Allah kepada hamba dan dijaga-Nya amal mereka serta akan diberi-Nya balasan secara adil. Hal ini adalah sesuatu yang perlu diperhatikan sekali dan diingat oleh seorang hamba."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 21",
    "description": "Pada hari itu setiap orang akan datang bersama malaikat penggiring ke padang mahsyar dan malaikat yang menjadi saksi atas amal diperbuat oleh manusia di dunia. 22. Ketika kematian datang menjemput seseorang, maka dikatakan kepada manusia, \"sungguh, kamu dahulu ketika hidup di dunia lalai tentang peristiwa kematian dan kebangkitan ini, maka kami singkapkan tutup yang menutupi matamu, sehingga penglihatanmu pada hari ini sangat tajam. Dengan demikian keraguanmu akan sirna. \"."
  }
]