[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kamu dalam kelalaian terhadap hari yang kamu saksikan saat ini wahai manusia. Kami membuka tabirmu yang menutupi hatimu, maka kelalaian itu sirna darimu, penglihatanmu di hari ini menjadi kuat dan tajam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan dikatakan kepada orang yang sedang digiring tersebut, “Kamu telah berada di dunia dalam kondisi lalai terhadap hari ini disebabkan kamu tertipu oleh syahwat-syahwatmu dan kenikmatan-kenikmatanmu, lalu Kami ungkap untukmu kelalaianmu dengan siksa dan kesusahan yang kamu lihat, dan pandanganmu pada hari itu tajam, mampu melihat apa yang pernah kamu lalaikan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. لَّقَدْ كُنتَ فِى غَفْلَةٍ مِّنْ هٰذَا (Sesungguhnya kamu berada dalam keadaan lalai dari (hal) ini) Yakni akan dikatakan kepadanya: “Kamu dahulu berada dalam kelalaian terhadap kesudahan ini” فَكَشَفْنَا عَنكَ غِطَآءَكَ(maka Kami singkapkan daripadamu tutup (yang menutupi) matamu) Yakni ketika kamu masih di dunia. Yakni Kami angkat penutup yang menghalangi antara dirimu dan urusan akhirat. فَبَصَرُكَ الْيَوْمَ حَدِيدٌ (maka penglihatanmu pada hari itu amat tajam) Yakni kini matamu dapat melihat apa yang dulu terhalang darimu ketika di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dikatakan kepada orang kafir: “Sungguh, di dunia kamu telah melalaikan hal yang kamu saksikan dan akibat buruk ini, Maka kami akan menyingkap penutup yang di dunia selalu menutupimu dari perkara akhirat. Pada hari ini, penglihatanmu akan berfungsi dengan jelas sehingga kamu dapat melihat apa yang kamu ingkari di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh kamu benar-benar telah lalai tentang ini, maka Kami menyingkap penutup matamu} penutup kelalaianmu tentang akhirat {sehingga penglihatanmu pada hari ini sangat tajam} sangat tajam sehingga kamu bisa melijat apa yang sebelumnya tertutup darimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Ini merupakan masalah yang harus diperhatikan oleh para hamba, tapi kebanyakan manusia lalai, karena itulah Allah berfirman, “Sungguh kamu berada dalam keadaan lalai dari (hal) ini.” Artinya, dikatakan pada orang yang berpaling dan mendustakan Hari Kiamat. Perkataan ini sebagai celaan dan penghinaan, kalian dulunya mendustakan Hari Kiamat dan tidak mau beramal untuk Hari Kiamat, “maka” sekarang “Kami singkapkan dari padamu tutup (yang menutupi) matamu,” yang menutupi hatimu, dulu kalian banyak terlelap dan terus menerus berpaling, “maka penglihatanmu pada hari itu sangat tajam,” yakni melihat berbagai macam azab yang membuatnya takut. Penafsiran lain, atau ini adalah pembicaraan Allah untuk hambaNya yang ketika berada di dunia melalaikan tujuan mengapa dia diciptakan. Tapi pada Hari Kiamat orang itu menjadi waspada dan kantuknya lenyap di saat-saat di mana semua yang telah ditinggalkan tidak mungkin bisa dikejar lagi. Semua ini merupakan ancaman Allah untuk para hambaNya serta penyampaian berita menakutkan dengan menyebutkan balasan yang diterima mereka yang mendustakan pada hari yang amat besar itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 22: Kemudian dikatakan kepada orang-orang kafir pada hari ini : Sungguh engkau wahai hamba dalam keadaan lalai dari tempat kembali mu, maka kami akan menurunkan untuk engkau kelalaian dan meningkat serta membuka tabir yang menutupi hatimu. Allah menampakan pada hari ini kejelekan yang dipandang oleh orang-orang kafir yang mereka ingkari di dunia dari hari bangkitan dan pembalasan atas azab dan penghinaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kemudian dikatakan kepada orang kafir atau orang yang berpaling lagi mendustakan pada hari Kiamat secara keras. Yakni meninggalkan beramal saleh untuknya. Yakni engkau melihat secara yakin apa yang telah engkau ingkari di dunia. Atau bisa saja ucapan ini dari Allah untuk seorang hamba, karena ketika di dunia ia berada dalam kelalaian terhadap tujuan ia diciptakan, dan pada hari Kiamat ia akan menyadarinya, akan tetapi saat itu bukan waktu untuk mengejar hal yang telah luput. Ini semua merupakan penakut-nakutan dari Allah kepada semua hamba dengan menerangkan apa yang akan diperoleh oleh orang yang mendustakan pada hari yang besar itu. Nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 22",
    "description": "Ketika kematian datang menjemput seseorang, maka dikatakan kepada manusia, \"sungguh, kamu dahulu ketika hidup di dunia lalai tentang peristiwa kematian dan kebangkitan ini, maka kami singkapkan tutup yang menutupi matamu, sehingga penglihatanmu pada hari ini sangat tajam. Dengan demikian keraguanmu akan sirna. \"23. Ayat ini melanjutkan apa yang akan dialami manusia di hari kemudian. Dan malaikat yang menyertainya berkata, 'inilah manusia yang engkau tugaskan kepadaku untuk mengawasinya telah aku hadirkan beserta seluruh catatan perbuatan yang ada padaku. '."
  }
]