[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "malaikat penulis sekaligus saksi atasnya, berkata, “Inilah bukti catatan amalnya yang ada padaku, ia selalu siap, tercatat dan akurat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan Malaikat yang ditugasi untuk menyertainya berkata, “Ini catatan amal perbuatannya ada padaku, tanpa dikurangi maupun ditambahi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-26. Malaikat yang bertugas mengawasinya berkata: “Kitab yang mencatat seluruh amalanmu yang ada padaku ini telah disiapkan.” Kemudian Allah memerintahkan dua malaikat yang menggiringnya dan yang menjadi saksinya: “Lemparlah ke dalam neraka Jahannam setiap orang kafir yang sangat mendustakan dan menentang kebenaran, dan sangat berusaha agar kebaikan tidak sampai kepada orang yang berhak mendapatkannya; yang menzalimi orang lain, meragukan agama, dan yang menyembah tuhan-tuhan lain selain Allah. Lemparlah ia ke dalam azab neraka Jahannam yang sangat menyakitkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَقَالَ قَرِينُهُۥ هٰذَا مَا لَدَىَّ عَتِيدٌ (Dan yang menyertai dia berkata: “Inilah (catatan amalnya) yang tersedia pada sisiku”) Mujahid mengatakan: malaikat berkata kepada Tuhan: “Inilah orang yang Engkau tugaskan kepadaku untuk mengawasinya, ia telah aku hadirkan besama catatan amalannya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Malaikat yang mendampingi dan dekat dengannya berkata: “Yang ada di sisiku ini adalah catatan amal perbuatanmu yang sudah siap untuk dihadirkan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang menyertainya berkata} malaikat yang ditugaskan di sampingnya {“Inilah yang ada padaku”} inilah catatan amal yang telah disiapkan dan dijadikan sebagai saksi yang ada padaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah berfirman, “Dan yang menyertai dia berkata,” yakni malaikat yang menyertai orang yang mendustakan dan berpaling. Mereka adalah para malaikat yang ditugaskan Allah untuk menjaganya dan mencatat amalnya, catatan dan amalnya itu akan diperlihatkan pada Hari Kiamat. Malaikat itu berkata, “Inilah (catatan amalnya) yang tersedia pada sisiku,” yaitu aku telah memperlihatkan tugasku untuk menjaganya dan mencatat amalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 23: Kemudian berkata para malaikat menguatkan sebagai wakil dengan tulisan amalan-amalannya: Inilah yang kami catat wahai Rabbku dari anak keturunan Adam, aku telah hadirkan catatan amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu malaikat yang Allah serahkan untuk menjaga hamba dan menjaga amalnya, lalu ia mendatangi hamba itu dan membawakan amalnya sambil berkata seperti yang disebutkan dalam ayat di atas. Yakni aku telah menyelesaikan tugasku, yaitu menjaganya dan menjaga amalnya,” sehingga ia akan diberi balasan sesuai amalnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 23",
    "description": "Ayat ini melanjutkan apa yang akan dialami manusia di hari kemudian. Dan malaikat yang menyertainya berkata, 'inilah manusia yang engkau tugaskan kepadaku untuk mengawasinya telah aku hadirkan beserta seluruh catatan perbuatan yang ada padaku. '24-26. Allah berfirman kepada malaikat penggiring dan penyaksi, 'lemparkanlah olehmu berdua ke dalam neraka jahanam semua orang yang sangat ingkar kepada Allah dan keras kepala dalam menentang kebenaran, yang sangat enggan melakukan kebajikan dan menghalangi orang-orang yang melakukan kebajikan, melampaui batas dengan melakukan kezaliman dan bersikap ragu-ragu tentang adanya Allah dan kebenaran agama-Nya atau menanamkan keraguan di hati orang lain, mereka yang mempersekutukan Allah dengan tuhan lain, maka, Allah mengukuhkan perintah-Nya kepada kedua malaikat, \"lemparkanlah dia ke dalam azab yang keras, di neraka jahanam. \"."
  }
]