[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-26. Allah berfirman kepada dua malaikat yang menggiring dan yang bersaksi sesudah Allah menetapkan keputusanNYa di antara manusia, “lemparkanlah ke dalan Neraka Jahanam semua orang yang mengingkari bahwa Allah Tuhan Sembahan Yang Haq, banyak melakukan kekafiran, mendustakan dan menentang kebenaran, menolak menunaikan kewajiban-kewajibannya pada hartanya, melanggar hamba-hamba Allah dan batasan-batasanNya, ragu-ragu terhadap janji pahala dan ancaman siksaNya, yang menyekutukan Allah, menyembah selain Allah dari makhlukNya bersama Allah, lemparkanlah dia ke dalam azab Jahanam yang keras.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan Allah berfirman kepada dua malaikat yang menggiring dan menjadi saksi, “Lemparkan ke dalam neraka Jahanam setiap orang yang ingkar terhadap kebenaran dan keras kepala tidak mau menerima kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَلْقِيَا فِى جَهَنَّمَ (Allah berfirman: “Lemparkanlah olehmu berdua ke dalam neraka) Ini merupakan firman Allah kepada malaikat yang menggiring dan memberi kesaksian terhadap manusia tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dikatakan pada malaikat penggiring dan malaikat yang menjadi saksi: “Kalian lemparkan semua orang kafir yang menolak kebenaran itu ke dalam neraka Jahannam”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Lemparkanlah} lemparlah wahai malaikat {ke dalam neraka Jahanam semua orang yang sangat ingkar lagi keras kepala} sangat menentang kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Kemudian orang itu pun dibalas amalnya dan dikatakan bagi orang yang berhak masuk neraka, “Lemparkanlah olehmu berdua ke dalam neraka semua orang yang sangat ingkar dank eras kepala,” yakni, mereka yang banyak kufurnya serta menentang ayat-ayat Allah, banyak berbuat maksiat, lancang dalam melakukan berbagai keharaman dan dosa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 24: Allah berbicara kepada para malaikat yang menuntun dan para saksi dengan berkata : Lemparkan mereka ke dalam neraka, yaitu mereka orang-orang kafir yang menolak ketauhidan kepada Allah dan hari perjumpaan dengan-Nya, yang mereka adalah orang-orang yang sombong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang sangat kafir dan keras kepala kepada ayat-ayat Allah, yang banyak melakukan maksiat dan berani mengerjakan perbuatan dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 24",
    "description": "24-26. Allah berfirman kepada malaikat penggiring dan penyaksi, 'lemparkanlah olehmu berdua ke dalam neraka jahanam semua orang yang sangat ingkar kepada Allah dan keras kepala dalam menentang kebenaran, yang sangat enggan melakukan kebajikan dan menghalangi orang-orang yang melakukan kebajikan, melampaui batas dengan melakukan kezaliman dan bersikap ragu-ragu tentang adanya Allah dan kebenaran agama-Nya atau menanamkan keraguan di hati orang lain, mereka yang mempersekutukan Allah dengan tuhan lain, maka, Allah mengukuhkan perintah-Nya kepada kedua malaikat, \"lemparkanlah dia ke dalam azab yang keras, di neraka jahanam. \"24-26"
  }
]