[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-26. Allah berfirman kepada dua malaikat yang menggiring dan yang bersaksi sesudah Allah menetapkan keputusanNYa di antara manusia, “lemparkanlah ke dalan Neraka Jahanam semua orang yang mengingkari bahwa Allah Tuhan Sembahan Yang Haq, banyak melakukan kekafiran, mendustakan dan menentang kebenaran, menolak menunaikan kewajiban-kewajibannya pada hartanya, melanggar hamba-hamba Allah dan batasan-batasanNya, ragu-ragu terhadap janji pahala dan ancaman siksaNya, yang menyekutukan Allah, menyembah selain Allah dari makhlukNya bersama Allah, lemparkanlah dia ke dalam azab Jahanam yang keras.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Yang banyak menolak kebenaran yang diwajibkan oleh Allah atas dirinya, menerjang batas hukum-hukum Allah, ragu-ragu terhadap janji dan ancaman yang dikabarkan kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. مَّنَّاعٍ لِّلْخَيْرِ (yang sangat menghalangi kebajikan) Yakni enggan melakukan kebaikan. مُعْتَدٍ(melanggar batas) Yakni menzalimi orang lain tanpa alasan yang benar. مُّرِيبٍ(lagi ragu-ragu) Yakni meragukan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Orang yang banyak menolak kebaikan yang akan disalurkan pada orang yang berhak menerimanya seperti zakat, menyerang orang lain dan berbuat zalim dengan mengingkari keesaan Allah SWT serta meragukanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sangat enggan melakukan kebaikan} sering menahan harta terhadap orang-orang yang wajib diberi {melampaui batas} zalim lagi melampaui batas {bersikap ragu-ragu} ragu tentang janji dan ancaman Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Yang sangat enggan melakukan kebajikan,” yakni, mencegah kebaikan yang ada di dekatnya, di mana yang paling agung adalah beriman kepada Allah, malaikat, kitab-kitab Allah dan para rasulNya, enggan melakukan kebajikan pada harta dan dirinya, “melanggar batas,” terhadap hamba-hamba Allah, banyak berbuat dosa “lagi ragu-ragu” meragukan janji dan ancaman Allah, mereka tidak memiliki keimanan dan kebaikan bahkan Allah menyifatinya dengan kekufuran, pembangkangan, ragu, pelit, menjadikan sesembahan-sesembahan lain selain Allah Yang Maha Pemurah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 25: Di antara sifat orang-orang kafir adalah: Mereka mencegah dari kebaikan, mereka tidak bersungguh-sungguh dalam berwasiat; Bahkan mereka ragu atas janji Allah dan ancamannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti zakat, atau ia menghalangi kebaikan untuk dirinya seperti beriman. Demikian pula ia menghalangi dirinya untuk memberikan manfaat kepada orang lain dengan hartanya dan badannya. Yakni zalim kepada hamba-hamba Allah dan melanggar batasan-batasan Allah. Dalam agamanya, atau ia ragu-ragu terhadap janji Allah dan ancaman-Nya, sehingga ia tidak beriman apalagi berbuat ihsan, bahkan yang ada adalah kekafiran, kezaliman, keraguan dan kebimbangan serta mengadakan tandingan bagi Allah Ar Rahman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 25",
    "description": "24-26. Allah berfirman kepada malaikat penggiring dan penyaksi, 'lemparkanlah olehmu berdua ke dalam neraka jahanam semua orang yang sangat ingkar kepada Allah dan keras kepala dalam menentang kebenaran, yang sangat enggan melakukan kebajikan dan menghalangi orang-orang yang melakukan kebajikan, melampaui batas dengan melakukan kezaliman dan bersikap ragu-ragu tentang adanya Allah dan kebenaran agama-Nya atau menanamkan keraguan di hati orang lain, mereka yang mempersekutukan Allah dengan tuhan lain, maka, Allah mengukuhkan perintah-Nya kepada kedua malaikat, \"lemparkanlah dia ke dalam azab yang keras, di neraka jahanam. \"24-26"
  }
]