[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-26. Allah berfirman kepada dua malaikat yang menggiring dan yang bersaksi sesudah Allah menetapkan keputusanNYa di antara manusia, “lemparkanlah ke dalan Neraka Jahanam semua orang yang mengingkari bahwa Allah Tuhan Sembahan Yang Haq, banyak melakukan kekafiran, mendustakan dan menentang kebenaran, menolak menunaikan kewajiban-kewajibannya pada hartanya, melanggar hamba-hamba Allah dan batasan-batasanNya, ragu-ragu terhadap janji pahala dan ancaman siksaNya, yang menyekutukan Allah, menyembah selain Allah dari makhlukNya bersama Allah, lemparkanlah dia ke dalam azab Jahanam yang keras.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Yang menjadikan sesembahan tandingan selain Allah, menyekutukan Allah dengannya dalam ibadah, maka lemparkan dia ke dalam siksa yang pedih.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَأَلْقِيَاهُ فِى الْعَذَابِ الشَّدِيدِ (yang menyembah sembahan yang lain beserta Allah maka lemparkanlah dia ke dalam siksaan yang sangat) Ini merupakan penekanan terhadap terintah-Nya yang pertama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Orang musyrik yang menjadikan tuhan lain di sisi Allah. Lemparkanlah dia (sebagai penegasan) ke dalam azab yang amat dahsyat dalam neraka Jahanam. Ayat [24-26] diturunkan untuk Walid bin Mughirah yang melarang keponakannya melakukan kebaikan yaitu dengan masuk Islam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan yang menyekutukan Allah dengan tuhan lain. Maka lemparkanlah dia ke dalam azab yang keras”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Karena itulah Allah berfirman, “Yang menyembah sembahan yang lain beserta Allah,” yakni menyembah selain Allah disamping menyembah Allah; sesembahan itu tidak bisa membahayakan dirinya dan tidak pula dapat membawa manfaat, tidak bisa mematikan dan tidak bisa menghidupkan dan tidak pula bisa membangkitkan. “Maka lemparkanlah dia,” wahai dua malaikat yang menyertainya, “ke dalam siksaan yang sangat,” yaitu siksaan yang paling besar, paling berat, dan paling keji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 26: Di antara dari sifat orang-orang kafir adalah mereka menyekutukan Allah dalam peribadatan, maka mereka beribadah kepada selain Allah bersamaan dengan ibadah kepada-Nya. Kemudian Allah memerintahkan dua malaikat untuk mengambil orang-orang kafir dan memasukkannya ke dalam neraka jahannam, agar mereka merasakan azab yang keras."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang tidak berkuasa memberikan manfaat maupun madharrat, tidak berkuasa menghidupkan, mematikan maupun membangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 26",
    "description": "24-26. Allah berfirman kepada malaikat penggiring dan penyaksi, 'lemparkanlah olehmu berdua ke dalam neraka jahanam semua orang yang sangat ingkar kepada Allah dan keras kepala dalam menentang kebenaran, yang sangat enggan melakukan kebajikan dan menghalangi orang-orang yang melakukan kebajikan, melampaui batas dengan melakukan kezaliman dan bersikap ragu-ragu tentang adanya Allah dan kebenaran agama-Nya atau menanamkan keraguan di hati orang lain, mereka yang mempersekutukan Allah dengan tuhan lain, maka, Allah mengukuhkan perintah-Nya kepada kedua malaikat, \"lemparkanlah dia ke dalam azab yang keras, di neraka jahanam. \"27. Setelah datang perintah untuk memasukkan orang kafir ke dalam neraka, orang kafir itu mengadu bahwa yang menyesatkannya adalah setan. Setan yang menyertainya berkata, 'ya tuhan kami, aku tidak menyesatkannya tetapi dia sendiri yang berada dalam kesesatan yang jauh, sehingga aku mengajaknya berbuat jahat dan dia menerima ajakanku dengan kemauannya. \"."
  }
]