[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setan yang bersamanya di dunia berkata, “Wahai Tuhan kami, bukan aku yang menyesatkannya, akan tetapi dia memang berada di jalan yang jauh dari jalan petunjuk.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Yang menyertainya dari kalangan setan berkata untuk melepaskan diri darinya, “Wahai Rabb kami! Kami tidak menyesatkannya, akan tetapi justru dia yang berada di kesesatan yang jauh dari kebenaran.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-30. Dia berusaha kabur dari azab itu dengan menyebutkan penyesatan setan yang dilakukan terhadapnya. Maka setan membalas ucapannya: “Ya Tuhan kami, aku tidak menyesatkannya, namun dia memang orang yang sesat dan menentang kebenaran.” Kemudian Allah menjawab mereka: “Janganlah kalian saling berselisih di hadapan-Ku pada hari ini; sungguh Aku telah memberi peringatan kepada kalian dari azab-Ku melalui lisan para rasul-Ku. Aku tidak mengubah ketetapan-Ku dengan menyiksa kalian, dan Aku tidak melakukan kezaliman dengan menyiksa seseorang tanpa kesalahan.” Hai Rasulullah, sebutkanlah kepada kaummu kejadian di hari kiamat, pada hari ketika Kami berkata kepada neraka Jahannam: “Apakah kamu telah penuh?” Maka neraka menjawab: “Apakah masih ada jin dan manusia yang akan dimasukkan lagi?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. قَالَ قَرِينُهُۥ رَبَّنَا مَآ أَطْغَيْتُهُۥ (Yang menyertai dia berkata (pula): “Ya Tuhan kami, aku tidak menyesatkannya) Yang dimaksud dengan orang yang menyertainya adalah setan yang dijadikan pendamping orang kafir tersebut, dia mengelak telah menyesatkannya. وَلٰكِن كَانَ فِى ضَلٰلٍۭ بَعِيدٍ(tetapi dialah yang berada dalam kesesatan yang jauh) Yakni jauh dari kebenaran. Aku mengajaknya kemudian dia menurutiku, seandainya dia adalah hamba-Mu yang tulus dalam imannya niscaya aku tidak akan mampu menyesatkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Setan yang mengiringi dan menyesatkannya berkata: “Wahai Tuhan, Aku tidak membuatnya menjadi zalim, tetapi dia telah berada dalam penyimpangan yang sangat jauh dari kebenaran, maka perkenankanlah aku untuk memilihnya (sebagai teman)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan yang menyertainya} setan yang mendampinginya di dunia {berkata,“Ya Tuhan kami, aku tidak menyesatkannya} Aku tidak menyesatkannya {tetapi dia sendiri yang berada dalam kesesatan yang jauh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Yang menyertai dia berkata (pula),” yakni setan yang berlepas diri darinya yang membawa dosa-dosanya, “Ya Rabb kami, aku tidak menyesatkannya,” karena aku tidak memiliki kekuasaan, hujjah, dan juga penjelasan atasnya, “tetapi dialah yang berada dalam kesesatan yang jauh,” dia sendirilah yang tersesat dan jauh dari kebenaran berdasarkan pilihannya sendiri, sebagaimana yang disebutkan dalam firman Allah \"Dan berkatalah syaitan tatkala perkara (hisab) telah diselesaikan: “Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku akan tetapi cercalah dirimu sendiri. Aku sekali-kali tidak dapat menolongmu dan kamupun sekali-kali tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu”. Sesungguhnya orang-orang yang zalim itu mendapat siksaan yang pedih.\" –Ibrahim: 22-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 27: Allah menyebutkan keburukan orang-orang kafir dan qarinnya (setan), dimana qorinnya berkata (yang ia menghiasi amalan yang buruk) : Sesungguhnya aku tidak melanggar perintahmu dan aku juga tidak kufur dan bermaksiat, akan tetapi orang kafir tersebutlah yang jauh dari petunjuk dan kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menyesatkannya di dunia berlepas diri darinya. Lalu aku mengajaknya, ternyata dia mau mengikutiku. Hal ini sebagaimana firman Allah Ta’ala, “Dan berkatalah setan ketika perkara (hisab) telah diselesaikan, \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencela aku akan tetapi celalah dirimu sendiri. aku sekali-kali tidak dapat menolongmu dan kamupun sekali-kali tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.\" (Terj. Ibrahim: 22)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 27",
    "description": "Setelah datang perintah untuk memasukkan orang kafir ke dalam neraka, orang kafir itu mengadu bahwa yang menyesatkannya adalah setan. Setan yang menyertainya berkata, 'ya tuhan kami, aku tidak menyesatkannya tetapi dia sendiri yang berada dalam kesesatan yang jauh, sehingga aku mengajaknya berbuat jahat dan dia menerima ajakanku dengan kemauannya. \"28. Kepada setan yang menyertainya itu Allah berfirman, 'janganlah kamu bertengkar di hadapan-ku dan sungguh dahulu aku telah memberikan ancaman kepadamu. Tetapi engkau mengabaikan ancamanku, maka berlakulah hukuman-ku kepadamu. \"."
  }
]