[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman, “Jangan berdebat di hadiratKu hari ini di tempat perhitungan amal dan balasan, karena hal itu tidak berfaidah, karena Aku sudah memberi peringatan kepada kalian di dunia terhadap siapa yang kafir kepadaKu dan maksiat kepadaKu,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Allah berfirman, “Janganlah kalian bertengkar di hadapan-Ku, itu tidak ada faedahnya, karena dahulu Aku pernah menunjukkan kepada kalian di dunia apa yang dibawa oleh Rasul-Ku berupa siksa yang pedih bagi orang yang kafir dan berbuat maksiat terhadap-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. قَالَ لَا تَخْتَصِمُوا۟ لَدَىَّ (Allah berfirman: “Janganlah kamu bertengkar di hadapan-Ku) Yakni pertengkaran antara orang-orang kafir dengan setan-setan yang menyertai mereka. Allah melarang mereka untuk saling berselisih ketika sedang dihisab. وَقَدْ قَدَّمْتُ إِلَيْكُم بِالْوَعِيدِ(padahal sesungguhnya Aku dahulu telah memberikan ancaman kepadamu”) Dengan mengutus para Rasul dan menurunkan kitab-kitab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Dikatakan kepada mereka berdua: “Kalian jangan saling berdebat di hadapanku saat berada di tempat hisab. Perdebatan itu tidak berguna disini. Dahulu, di dalam kitab dan rasul-rasul telah disampaikan janjiKu tentang azab kepada kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman} Allah SWT berfirman {“Janganlah bertengkar di hadapanKu dan sungguh dahulu Aku telah memberikan ancaman kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Allah berfirman seraya menjawab perdebatan di antara mereka, “Janganlah kamu bertengkar di hadapanKu,” artinya, perdebatan kalian di hadapanKu tidak ada gunanya, “padahal,” karena sesungguhnya Aku “telah memberikan ancaman kepadamu.” Artinya, para RasulKu telah mendatangimu dengan berbagai ayat yang menjelaskan dan hujjah serta bukti yang nyata, hujjahKu telah tegak pada kalian sehingga alasan kalian sama sekali tidak berguna, engkau telah memberikan amal-amal yang telah engkau lakukan kepadaKu yang harus diberi balasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 28: Allah berkata janganlah kalian berselisih atas urusan hari ini, hari ini adalah hari pembalasan dan hisab; Maka tidak ada manfaatnya atas perdebatan dan perselisihan kalian. Dan telah berlalu peringatan bagi kalian dan telah diperingatkan kalian ketika di dunia melalui lisan para utusan-Ku yang diutus kepada kalian ketika kalian kufur kepada-Ku dan bermaksiat kepada-Ku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, tidak ada faedahnya kamu bertengkar di hadapan-Ku. Yaitu dengan azab di akhirat jika kamu tidak beriman. Para rasul telah datang kepadamu memberikan peringatan dengan membawa bukti yang nyata sehingga tegak kepadamu hujjah-Nya, namun kamu malah mengingkari dan menolaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 28",
    "description": "Kepada setan yang menyertainya itu Allah berfirman, 'janganlah kamu bertengkar di hadapan-ku dan sungguh dahulu aku telah memberikan ancaman kepadamu. Tetapi engkau mengabaikan ancamanku, maka berlakulah hukuman-ku kepadamu. \"29. \"di hari pembalasan ini, keputusan-ku tidak dapat diubah dan aku tidak menzalimi hamba-hamba-ku. Sekali-kali aku tidak pernah menyiksa orang-orang yang tidak berdosa. \"."
  }
]