[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "PerkataanKu (keputusanKu) tidak dapat dirubah. Aku tidak menyiksa seseorang karena dosa orang lain. Aku hanya mengazab seseorang karena dosanya sendiri sesudah tegaknya hujjah atasnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Ucapan dari-Ku tidak berubah, janji-Ku tidak berganti dan Aku tidak menganiaya para hamba dengan mengurangi kebaikan-kebaikan mereka maupun dengan menambahi keburukan-keburukan mereka, justru Aku membalas mereka atas apa yang mereka kerjakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. مَا يُبَدَّلُ الْقَوْلُ لَدَىَّ (Keputusan di sisi-Ku tidak dapat diubah) Yakni janji-Ku tidak akan diingkari, namun pasti akan terjadi; dan Aku telah menetapkan azab bagi kalian, maka itu tidak akan dapat diubah. Pendapat lain mengatakan bahwa makna ayat ini adalah tidak ada yang dapat berdusta di hadapan-Ku dengan alasan yang banyak maupun sedikit, sebab Aku mengetahui hal ghaib. وَمَآ أَنَا۠ بِظَلّٰمٍ لِّلْعَبِيدِ(dan Aku sekali-kali tidak menganiaya hamba-hamba-Ku) Yakni Aku tidak mengazab mereka tanpa dosa yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. UcapanKu itu tidak akan berubah, begitu juga janjiKu. Aku tidak menzalimi siapapun, sehingga aku tidak akan menyiksa siapapu kecuali yang berdosa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "KeputusanKu tidak dapat diubah} tidak diganti {dan Aku tidak menzalimi para hamba"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. ”Keputusan di sisiKu tidak dapat diubah.” Artinya, Allah tidak mungkin memungkiri apa yang difirmankan dan diberitakanNya, sebab tidak ada yang perkataannya paling benar selain Allah. “Dan Aku sekali-kali tidak menganiaya hamba-hambaKu.” Aku membalas mereka sesuai dengan amalan mereka baik dan buruknya, kejelekan mereka tidak ditambah sedikit pun dan kebaikan mereka tidak dikurangi sedikit pun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 29: Ketahuilah wahai orang-orang kafir bahwasanya Allah tidak menzalimi hamba-Nya yang tidak berdosa. Karena sebab Allah mengharamkan kedholiman atas diri-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti mengazab mereka tanpa ada kesalahan yang mereka lakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 29",
    "description": "\"di hari pembalasan ini, keputusan-ku tidak dapat diubah dan aku tidak menzalimi hamba-hamba-ku. Sekali-kali aku tidak pernah menyiksa orang-orang yang tidak berdosa. \"30. Ingatlah pada hari ketika orang kafir ditetapkan masuk neraka, kami, Allah dan para malaikat-Nya bertanya kepada jahanam, 'apakah kamu sudah penuh oleh para pendurhaka'' ia menjawab, 'masih adakah tambahan'' ayat ini menunjukkan betapa luas dan dalamnya neraka jahanam. Jin dan manusia dilemparkan ke dalamnya sehingga penuh sesak."
  }
]