[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah bila kami sudah mati dan menjadi tanah, bagaimana kami yang sudah demikian itu dikembalikan hidup kembali? Itu adalah pengembalian yang mustahil terjadi.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Apakah kami akan dibangkitkan jika kami telah mati dan telah menjadi tanah? Kebangkitan itu, dan kembalinya kehidupan ke tubuh-tubuh kami setelah hancur adalah sesuatu yang jauh dari nalar, tidak mungkin terjadi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. أَءِذَا مِتْنَا وَكُنَّا تُرَابًا ۖ (Apakah kami setelah mati dan setelah menjadi tanah (kami akan kembali lagi)?) Yakni apakah Allah akan membangkitkan kami seperti yang kamu katakan, dan mengembalikan kami kepada-Nya setelah kami tercerai-berai di kubur dan menjadi tanah? ذٰلِكَ (itu) Yakni kebangkitan itu. رَجْعٌۢ بَعِيدٌ(suatu pengembalian yang tidak mungkin) Yakni tidak dapat diterima oleh akal, karena itu adalah hal yang mustahil –menurut anggapan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Apakah kami akan dibangkitkan setelah mati dan menjadi tanah yang berserakan untuk dihisab dan dibalas? Kebangkitan itu dalah kebangkitan atau kembali hidup setalah mata, yang mana hal itu sulit dilakukan dan tidak masuk akal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah setelah kami mati dan sudah menjadi tanah. Itu adalah pengembalian} kembali hidup {yang tidak mungkin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Kemudian Allah menyebutkan alasan mengapa merasa heran, Allah berfirman (tentang ucapan mereka), “Apakah kami setelah mati dan setelah menjadi tanah (kami akan kembali lagi), itu adalah suatu pengembalian yang tidak mungkin.” Mereka menyamakan Kuasa Allah yang Mahakuasa atas segala sesuatu dan Mahasempurna dari segala hal, dengan kuasa manusia yang memerlukan pertolongan dan lemah dalam berbagai hal. Mereka menyamakan orang bodoh yang tidak mengetahui apa pun, dengan Allah Yang Maha Mengetahui segala sesuatu, yang mengetahui “apa yang dihancurkan oleh bumi,” berupa jasad-jasad mereka selama mereka berada di alam barzakh. Dan Allah telah mencatat semua yang terjadi pada mereka, baik ketika mereka hidup maupun setelah mati, itulah catatan di sisi Allah yang terjaga dari perubahan dan penggantian. Ini adalah sebagai bukti sempurnanya ilmu Allah yang hanya Dia semata yang mengetahui segala sesuatu, Dia mampu untuk menghidupkan kembali orang-orang yang sudah mati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 3: Allah menjelaskan tentang sisi keheranan mereka, mereka berkata: Apakah jika suatu saat nanti kami mati wahai Muhammad, tertimbun jasad-jasad kami dengan tanah, Apakah kami akan dihidupkan kembali serta akan dikembalikan sebagaimana kami saat ini ? Kemudian mereka menjawab: Tidak akan mungkin atas hal itu; Bahkan mereka berkata: Kembalinya kami di dunia ini untuk hidup adalah sebuah kemustahilan; Mustahil akan hal itu; Karena akal kami berpendapat adanya kedustaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah menyebutkan sisi keheranan mereka. Mereka menyamakan kemampuan Allah Yang Mahakuasa atas segala sesuatu lagi sempurna dari berbagai sisi dengan kemampuan hamba yang fakir dan lemah dari berbagai sisi, serta menyamakan yang jahil yang tidak mengetahui sesuatu dengan yang mengetahui segala sesuatu, dimana Dia mengetahui apa yang ditelan bumi dari (tubuh-tubuh) mereka selama mereka berada dalam kubur mereka, dan Dia mencatat dalam kitab-Nya yang terpelihara dari perobahan (Lauh Mahfuzh) semua yang terjadi pada mereka ketika masih hidup dan setelah mereka mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 3",
    "description": "Setelah menyaksikan bahwa kehadiran rasul itu membawa peringatan tentang hari kebangkitan, dengan penuh rasa keingkaran dan cemoohan, orang-orang kafir itu berkata, \"apakah apabila kami telah mati dan sudah menjadi tanah akan kembali lagi' itu adalah suatu pengembalian yang tidak mungkin, dan sangat jauh dari penerimaan akal. Karena bagaimana mungkin jasmani yang sudah bercampur dengan tanah dapat kembali seperti semula. \"4. Hal itu tidak aneh. Sungguh, kami telah mengetahui apa yang ditelan bumi dari tubuh mereka baik sebelum maupun sesudah kematiannya, sebab pada kami ada kitab yang berisi catatan tentang keadaan dan perbuatan mereka yang terpelihara baik. Dengan demikian tidak ada keraguan sedikit pun tentang kebangkitan dan bahwa itu pasti terjadi."
  }
]