[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sampaikanlah kepada umatmu (wahai Rasul) saat Kami berfirman kepada Neraka Jahanam pada Hari Kiamat, “Apakah kamu sudah penuh?” jahannam menjawab, “Apakah masih ada tambahan dari kalangan jin dan manusia?” maka Tuhan Yang MahaAgung meletakkan Telapak KakiNya padanya, lalu sebagian darinya menyimpit ke sebagian yang lain, dan ia berkata, “Cukup-cukup. Sudah penuh, tidak ada lagi tempat untuk tambahan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Pada hari ketika Kami berkata kepada neraka Jahanam, “Apakah kamu sudah penuh dengan orang yang dilemparkan kepadamu dari kalangan orang-orang kafir dan para pelaku maksiat?” Maka Neraka menjawab Rabbnya, “Masih adakah tambahan?” sebagai bentuk permintaan terhadap Rabbnya, dan marah karena Rabbnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. مَا يُبَدَّلُ الْقَوْلُ لَدَىَّ (Keputusan di sisi-Ku tidak dapat diubah) Yakni janji-Ku tidak akan diingkari, namun pasti akan terjadi; dan Aku telah menetapkan azab bagi kalian, maka itu tidak akan dapat diubah. Pendapat lain mengatakan bahwa makna ayat ini adalah tidak ada yang dapat berdusta di hadapan-Ku dengan alasan yang banyak maupun sedikit, sebab Aku mengetahui hal ghaib. وَمَآ أَنَا۠ بِظَلّٰمٍ لِّلْعَبِيدِ(dan Aku sekali-kali tidak menganiaya hamba-hamba-Ku) Yakni Aku tidak mengazab mereka tanpa dosa yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Ingatlah saat kami berkata kepada neraka Jahanam: “Apakah kamu penuh dengan orang-orang yang disiksa? Aku akan memenuhi janjiKu kepadamu” Lalu dia menjawab: “Apakah ada tambahan lagi dari mereka?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) Kami bertanya kepada neraka Jahanam, “Apakah kamu sudah penuh” Ia menjawab,“Apakah ada tambahan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Allah berfirman seraya menakut-nakuti para hambaNya, “(Dan ingatlah akan) hari (yang pada hari itu) Kami bertanya kepada Jahanam, ‘Apakah kamu sudah penuh?’” demikian itu karena terlalu banyaknya yang dilemparkan ke dalamnya, “dia menjawab, ‘Masih adakah tambahan?’” artinya, Neraka Jahanam terus meminta agar ditambah dari kalangan orang-orang yang berdosa dan pendurhaka, dengan marah terhadap orang-orang kafir, Allah telah menjanjikan Jahanam akan penuh sebagaimana yang disebutkan dalam Firman Allah : \"sesungguhnya Aku akan memenuhi neraka Jahannam dengan jin dan manusia (yang durhaka) semuanya.\" –Hud: 119- Hingga Rabb Pemilik Keperkasaan meletakkan KakiNya Yang Mulia (Yang Mahasuci dari Keserupaan) dan melebarkan pojok masing-masing, Neraka Jahanam berkata, “Cukup, cukup, aku sudah cukup dan penuh.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 30: Ingatlah wahai nabi Allah, pada hari di mana kami berkata kepada jahanam: Apakah sudah penuh? Maka neraka menjawab: Apakah ada lagi tambahan wahai Rabbku dari manusia atau jin? neraka menjawab dengan penuh adab. Maka pada keadaan ini di mana Allah mengetahui bahwasannya jahanam belum penuh sehingga meletakkan kakinya ke dalam neraka, dan neraka berkata: cukup cukup."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menakut-nakuti hamba-hamba-Nya. Hal ini karena banyak sekali orang yang dilemparkan ke dalamnya. Neraka Jahanam senantiasa meminta tambahan dari para pelaku dosa dan maksiat karena marah kepada orang-orang kafir, dimana marahnya dilakukan karena Allah Subhaanahu wa Ta'aala, sehingga Allah meletakkan kaki-Nya yang mulia ke neraka, maka neraka itu berhimpit sambil berkata, “Cukup-cukup,” yakni aku telah penuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 30",
    "description": "Ingatlah pada hari ketika orang kafir ditetapkan masuk neraka, kami, Allah dan para malaikat-Nya bertanya kepada jahanam, 'apakah kamu sudah penuh oleh para pendurhaka'' ia menjawab, 'masih adakah tambahan'' ayat ini menunjukkan betapa luas dan dalamnya neraka jahanam. Jin dan manusia dilemparkan ke dalamnya sehingga penuh sesak. 31. Setelah ayat yang lalu menjelaskan keadaan orang kafir dan neraka yang akan dihuninya, selanjutnya ayat ini menjelaskan keadaan orang yang bertakwa dan kenikmatan yang dijanjikan Allah kepada mereka. Sedangkan surga didekatkan kepada orang-orang yang bertakwa, yang mantap ketakwaannya, pada tempat yang tidak jauh dari mereka. Me-reka dapat melihat kenikmatan dan kelezatan yang disediakan untuk mereka."
  }
]