[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "surga didekatkan kepada orang-orang yang bertakwa pada sebuah tempat yang tidak jauh dari mereka. Mereka menyaksikannya sebagai tambahan kebahagiaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Surga didekatkan kepada orang-orang yang bertakwa kepada Rabb mereka dengan mengerjakan segala perintah-perintah-Nya dan menjauhi segala larangan-larangan-Nya, lalu mereka menyaksikan kenikmatan yang ada di dalamnya tidak jauh dari mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31-35. Dan surga akan didekatkan bagi orang-orang bertakwa sehingga menjadi tempat yang tidak jauh. Akan dikatakan kepada mereka: “Ini adalah balasan yang dijanjikan bagi kalian melalui lisan para rasul, yaitu bagi setiap orang yang senantiasa bertaubat dan mentaati Allah, menjaga perjanjian-Nya, takut kepada-Nya ketika dalam keadaan sendiri, saat tidak ada yang melihatnya selain Allah, dan yang menghadap Allah dengan hati yang bersih dan bertaubat dari dosa-dosa.” Dan akan dikatakan kepada mereka: “Masuklah ke surga dalam keadaan selamat dari segala keburukan.” Hari yang agung itu merupakan hari untuk hidup kekal di dalam surga selamanya. Mereka akan mendapatkan segala yang mereka inginkan, dan Kami menyiapkan bagi mereka kenikmatan yang lebih, dan yang paling agung adalah kenikmatan melihat wajah Allah Yang Maha Mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ (Dan didekatkanlah surga itu kepada orang-orang yang bertakwa pada tempat yang tiada jauh (dari mereka)) Yakni didekatkan kepada orang-orang bertakwa sehingga mereka dapat melihatnya dan melihat isinya yang tidak pernah dilihat, didengar, dan dibayangkan sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Dan surga berada sangat dekat dan tidak jauh dari mereka, namun mereka hanya bisa menyaksikannya dengan mata mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun surga didekatkan} didekatkan {kepada orang-orang yang bertakwa pada tempat yang tidak jauh} tempat yang dekat yang tidak jauh dari mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. “Dan didekatkanlah surga itu,” artinya surga itu didekatkan sehingga bisa disaksikan dan dilihat kenikmatan abadi serta kesenangan yang ada di dalamnya. Surga didekatkan hanya untuk hamba-hamba Allah yang bertakwa padaNya, yang meninggalkan kesyirikan besar dan kecil, yang melaksanakan perintah-perintah Rabb mereka serta tunduk dan patuh kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 31: Allah mengabarkan bahwasanya surga dekat bagi orang-orang yang bertakwa, di mana mereka menjadikan di antara mereka azab Allah dan pencegahannya, yaitu hamba tersebut mengerjakan perintah-Nya dan menjauhi larangan-Nya dan surga tidak jauh darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang melaksanakan perintah Allah dan menjauhi larangan-Nya. Lalu mereka melihatnya dan menyaksikan apa yang ada di dalamnya berupa kenikmatan dan kesenangan, sehingga membuat mereka rindu memasukinya. Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar (Ya Allah, sesungguhnya kami meminta surga kepada-Mu dan berlindung kepada-Mu dari neraka). Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar. Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 31",
    "description": "Setelah ayat yang lalu menjelaskan keadaan orang kafir dan neraka yang akan dihuninya, selanjutnya ayat ini menjelaskan keadaan orang yang bertakwa dan kenikmatan yang dijanjikan Allah kepada mereka. Sedangkan surga didekatkan kepada orang-orang yang bertakwa, yang mantap ketakwaannya, pada tempat yang tidak jauh dari mereka. Me-reka dapat melihat kenikmatan dan kelezatan yang disediakan untuk mereka. 32. Para malaikat berkata kepada mereka 'inilah nikmat, yakni surga dan segala kenikmatannya yang dijanjikan kepadamu, yaitu kepada setiap hamba yang senantiasa bertobat kepada Allah dan memelihara semua peraturan-peraturan-Nya."
  }
]