[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "32-33. Dikatakan kepada mereka, “Inilah yang dulu dijanjikan kepada kalian (wahai orang-orang yang bertakwa) bagi setiap orang yang bertaubat dari dosa-dosanya, menjaga apa yang mendekatkannya kepada Tuhannya, yaitu amal-amal ketaatan dan kewajiban, orang yang takut kepada Allah di dunia dan bertemu denganNya di Hari Kiamat dengan hati yang bertaubat dari dosa-dosanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan dikatakan kepada mereka, “Inilah apa yang dijanjikan oleh Allah kepada kalian bagi orang-orang yang kembali kepada Rabbnya dengan tobat, menjaga apa yang diwajibkan oleh Rabbnya terhadapnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. هٰذَا مَا تُوعَدُونَ (Inilah yang dijanjikan kepadamu) Yakni segala macam jenis kenikmatan yang kalian lihat itu adalah apa yang dijanjikan bagi kalian. لِكُلِّ أَوَّابٍ حَفِيظٍ ((yaitu) kepada setiap hamba yang selalu kembali (kepada Allah) lagi memelihara) Makna (الأواب) yakni orang yang senantiasa kembali kepada Allah dengan bertaubat dari kemaksiatannya. Pendapat lain mengatakan, yakni orang yang senantiasa bertasbih. Dan pendapat lain mengatakan, yakni orang yang mengingat dosanya ketika dalam kesendirian, kemudian memohon ampun kepada Allah. Makna (الحفيظ) yakni orang yang mengingat-ingat dosanya agar ia bertaubat darinya dan tidak melalaikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dikatakan kepada mereka: “Ini adalah pahala yang dijanjikan kepadamu melalui lisan para rasul, yaitu bagi setiap orang yang mau bertaubat kepada Allah, menaatiNya dan menjaga syari’atNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Inilah yang dijanjikan kepada kalian, kepada setiap hamba yang bertaubat} kembali kepada Allah dengan bertaubat {lagi patuh} mematuhi perintah Allah atas dirinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Dan dikatakan kepada mereka seraya diberi ucapan selamat, “INilah yang dijanjikan kepadamu, (yaitu) bagi setiap hamba yang selalu kembali (kepada Allah) lagi memelihara (semua peraturan-peraturanNya).” Artinya, surga ini serta berbagai kesenangan yang diinginkan jiwa dan dipandang nikmat oleh mata yang ada di dalamnya itu adalah yang dijanjikan Allah kepada setiap orang yang kembali kepada Allah, kembali kepadaNya di segala waktu, mengingatNya, mencintaiNya, meminta pertolongan, berdoa, takut dan berharap kepadaNya. “Memelihara,” yaitu menjaga apa yang diperintahkan Allah, melaksanakan dengan ikhlas serta sempurna untuk Allah semata dan menjaga batasan-batasan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 32: Kemudian dikatakan kepada mereka: Wahai orang-orang yang bertakwa sesungguhnya kenikmatan ini yang kalian telah lihat adalah apa yang dijanjikan oleh Allah, yang kalian menjauhkan diri dari maksiat menuju ketaatan kepada Allah, dengan banyak bertaubat, dan menjaga batasan-batasan Allah serta syariat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni surga dan apa yang dijanjikan di dalamnya berupa hal yang disenangi jiwa dan sejuk dipandang mata, Allah janjikan untuk setiap hamba yang banyak kembali kepada Allah di setiap waktu dengan beribadah, baik dengan menyebut nama-Nya, mencintai-Nya, meminta pertolongan kepada-Nya, berdoa, takut dan berharap kepada-Nya. Yakni menjaga perintah Allah dengan melaksanakannya secara ikhlas dan sempurna serta menjaga batasan-batasan (larangan-larangan)-Nya dengan menjauhinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 32",
    "description": "Para malaikat berkata kepada mereka 'inilah nikmat, yakni surga dan segala kenikmatannya yang dijanjikan kepadamu, yaitu kepada setiap hamba yang senantiasa bertobat kepada Allah dan memelihara semua peraturan-peraturan-Nya. 33. Allah menjelaskan pada ayat ini sifat-sifat orang yang bertakwa, yaitu orang yang takut kepada Allah yang maha pengasih sekalipun dia maha ghaib, tidak kelihatan olehnya dan dia datang kepada-Nya dengan hati yang bertobat dan tunduk kepada-Nya."
  }
]