[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "32-33. Dikatakan kepada mereka, “Inilah yang dulu dijanjikan kepada kalian (wahai orang-orang yang bertakwa) bagi setiap orang yang bertaubat dari dosa-dosanya, menjaga apa yang mendekatkannya kepada Tuhannya, yaitu amal-amal ketaatan dan kewajiban, orang yang takut kepada Allah di dunia dan bertemu denganNya di Hari Kiamat dengan hati yang bertaubat dari dosa-dosanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Barangsiapa takut kepada Allah saat sembunyi-sembunyi di mana tidak ada yang melihat kecuali Allah, menjumpai Allah dengan hati yang bersih, bertobat kepada-Nya dan tunduk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. مَّنْ خَشِىَ الرَّحْمٰنَ بِالْغَيْبِ ((Yaitu) orang yang takut kepada Tuhan Yang Maha Pemurah sedang Dia tidak melihat-Nya) Yakni ketika dia sedang sendirian tidak ada yang melihatnya. Imam al-Hasan mengatakan, yakni jika dia telah memasang tirai dan menutup pintu. وَجَآءَ بِقَلْبٍ مُّنِيبٍ (dan dia datang dengan hati yang bertaubat) Yakni kembali kepada Allah dengan hati yang ikhlas mentaati-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Barangsiapa takut dengan hukuman Allah di waktu dan tempat yang tidak diketahui oleh siapapun, datang dengan hati yang selamat mau menaati Allah dan Ikhlas dalam beribadah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang yang takut} takut {kepada Dzat Yang Maha Pengasih dengan tanpa melihatNya} dengan ghaib dimana tidak ada satupun yang melihatNya kecuali Allah itu sendiri {dan dia datang dengan hati yang bertaubat} kembali kepada Allah SWT"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. “(Yaitu) orang yang takut kepada Rabb Yang Maha Pemurah,” artinya, takut kepadaNya karena mengenal Rabbnya, mengharap rahmatNya serta senantiasa takut terhadap Allah meski tidak berada di hadapan orang. Dan inilah rasa takut yang sebenarnya. Sedangkan rasa takut di hadapan dan dalam pandangan orang, maka rasa takut itu adalah riya’ dan sum’ah yang tidak menunjukkan rasa takut. Rasa takut yang membawa manfaat adalah rasa takut, baik di kala sendirian maupun ketika bersama orang lain. Kemungkinan maksud ayat ini juga adalah takut terhadap Allah meski tidak terlihat oleh mata seperti halnya yang dimaksud dengan beriman kepada yang ghaib. Ghaib adalah kebalikan dari nyata, karena iman dan rasa takut adalah sesuatu yang vital bukan alternative karena bisa menentukan azab, kemudian ayat-ayat Allah datang dan inilah yang Nampak. “Dan ia datang dengan hati yang kembali,” ia disifati dengan kembali kepada Penolongnya serta tertarik oleh berbagai faktor pendorong menuju keridhaanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 33: Ketika kemudian dikatakan kepada mereka: Ketahuilah bahwasanya kenikmatan ini adalah balasan bagi hamba yang takut kepada Allah dalam kesendirian maupun keramaian, mereka adalah orang-orang yang meluruskan hatinya untuk Allah yang istiqomah di atas ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni takut kepada-Nya dengan mengenal Tuhannya, berharap kepada rahmat-Nya dan senantiasa takut kepada Allah dalam keadaan gaibnya, yakni dalam keadaan tidak diketahui manusia. Inilah takut yang hakiki, adapun takut ketika di hadapan manusia, maka bisa saja riya’ dan sum’ah sehingga tidak menunjukkan takut. Bahkan takut yang bermanfaat adalah takut baik pada saat terang-terangan maupun sembunyi-sembunyi. Bisa juga maksud “bilghaib” dalam ayat di atas adalah sekalipun tidak kelihatan olehnya. Yakni sifatnya kembali kepada Allah dan terdorong dirinya untuk mengerjakan hal-hal yang diridhai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 33",
    "description": "Allah menjelaskan pada ayat ini sifat-sifat orang yang bertakwa, yaitu orang yang takut kepada Allah yang maha pengasih sekalipun dia maha ghaib, tidak kelihatan olehnya dan dia datang kepada-Nya dengan hati yang bertobat dan tunduk kepada-Nya. 34. Sebagai penghormatan kepada mereka, para malaikat berkata, \"masuklah ke dalam surga dengan aman, tanpa dihalangi, dan damai, penuh ketenteraman. Maka bergembiralah dan bersenang-senanglah kalian semua. Itulah hari yang abadi, tidak ada kematian dan kesulitan sesudah itu. '."
  }
]