[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikatakan kepada orang-orang yang beriman itu, “Masuklah ke dalam surga dengan penuh keselamatan dari segala keburukan dan penyakit, aman dari segala hal yang dibenci. Itulah hari kekekalan yang tidak berakhir.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dikatakan kepada mereka, “Masuklah kalian ke Surga dalam kondisi selamat dari apa yang tidak kalian sukai, itu adalah hari yang kekal, tidak fana setelahnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. ادْخُلُوهَا (masukilah surga itu) Yakni masuklah ke dalam surga. بِسَلٰمٍ (dengan aman) Yakni dengan keselamatan dari azab. Pendapat lain mengatakan, yakni dengan ucapan salam dari Allah dan para malaikat. ذٰلِكَ(itulah) Yakni hari itu. يَوْمُ الْخُلُودِ(hari kekekalan) Karena hari itu akan kekal selamanya"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Maka dikatakan kepada mereka: “Masuklah ke dalam surga. Kalian selamat dari ketakutan dan azab. Salam Kami untuk kalian. Hari itu adalah hari keabadian dalam surga.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Masuklah ke dalamnya} masuklah ke dalam surga {dengan aman} dengan disertai keselamatan dari petaka dan hal-hal yang dibenci {Itulah hari yang abadi”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Dikatakan kepada mereka yang bertakwa dan berbakti, “Masukilah surga itu dengan aman,” masuk disertai dengan keselamatan dari segala bahaya dan keburukan, aman dari seluruh hal yang tidak diinginkan, kenikmatan mereka tidak pernah terputus, tidak terkotori dan tidak ada habisnya. “Itulah hari kekekalan,” tidak bisa lenyap, tidak ada kematian dan tidak ada sesuatu pun yang bisa mengotorinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 34: Kemudian dikatakan kepada mereka: Masuklah kalian ke dalam surga dengan keselamatan, maka mereka memasukinya dengan keselamatan dari azab, dan kekalnya kenikmatan. Allah memberikan salam kepada mereka, beserta para malaikat. Itulah hari yang kekal, mereka kekal di dalam surga dan bertempat di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari segala kekhawatiran dan keburukan. Yang tidak ada lagi kematian dan kefanaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 34",
    "description": "Sebagai penghormatan kepada mereka, para malaikat berkata, \"masuklah ke dalam surga dengan aman, tanpa dihalangi, dan damai, penuh ketenteraman. Maka bergembiralah dan bersenang-senanglah kalian semua. Itulah hari yang abadi, tidak ada kematian dan kesulitan sesudah itu. '35. Mereka di dalamnya, yakni di dalam surga, memperoleh apa yang me-reka kehendaki, berupa segala macam kenikmatan dan pada kami ada tambahannya, kenikmatan yang tidak ada taranya yang tidak pernah terlintas oleh pikiran."
  }
]