[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang Mukmin itu di surga mendapatkan apa saja yang mereka inginkan, Kami sendiri punya apa yang Kami berikan kepada mereka sebagai tambahan kenikmatan bagi mereka, yang paling besar darinya adalah melihat kepada Wajah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Bagi mereka di dalamnya apa yang mereka inginkan dari kenikmatan-kenikmatan yang tidak akan lenyap, dan di sisi Kami ada tambahan kenikmatan lain yang tidak pernah dilihat mata, tidak pernah didengar telinga dan tidak pernah terlintas dalam hati manusia, di antaranya adalah melihat kepada Allah -Subḥānahu-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. لَهُم مَّا يَشَآءُونَ فِيهَا (Mereka di dalamnya memperoleh apa yang mereka kehendaki) Yakni dalam surga terdapat segala yang diinginkan jiwa dan dinikmati mata, dengan berbagai jenis kenikmatan dan kebaikan, sesuai dengan yang mereka harapkan. وَلَدَيْنَا مَزِيدٌ(dan pada sisi Kami ada tambahannya) Yakni kenikmatan tambahan yang tidak pernah terfikir sebelumnya dalam fikiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Bagi orang-orang yang bertakwa itu adlah apa yang mereka harapkan dan inginkan berupa nikmat yang sangat beragam. Kami juga tambahkan kepada mereka nikmat yang tidak membahayakan mereka saat menerimanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi mereka di dalamnya apa yang mereka kehendaki dan pada Kami masih ada lagi tambahan} tambahan kenikmatan, dan memuliakannya dengan memandang Allah yang Maha Mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “Mereka di dalamnya memperoleh apa yang mereka kehendaki,” artinya semua yang berkaitan dengan kehendak mereka akan didapatkan di dalam surga. “Dan pada sisi Kami,” di samping itu “ada tambahan (nya),” yaitu pahala yang dibentangkan oleh Allah Yang Maha Pemurah lagi Maha Penyayang yang belum pernah dilihat oleh mata, belum pernah didengar oleh telinga dan belum pernah terlintas di benak manusia. Dan yang lebih agung serta besar dari semua kenikmatan tersebut adalah memandang WajahNya Yang Mulia, mendengarkan FirmanNya, menikmati berdekatan denganNya. Kita memohon karuniaNya ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 35: Allah menjelaskan bahwasanya bagi mereka di surga ini setiap apa yang mereka inginkan dan seluruh apa yang mereka minta diberikan. Mereka memiliki tambahan berupa kenikmatan, yang ia adalah sebesar-besar nikmat yang didapatkan surga, yaitu melihat wajah Allah Subhanahu Wa Ta'ala dan mendengar ucapan Allah serta menikmati kedekatan dengannya dengannya, bergembira dengan keridhoan Allah atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari apa yang mereka kerjakan dan yang mereka minta, dimana tambahan itu tambahan yang belum pernah mereka lihat, belum pernah mereka dengar dan belum pernah terlintas di hati mereka. Dan tambahan yang paling besar dan paling agungnya adalah melihat wajah Allah Yang Mulia, mendengarkan firman-Nya dan bersenang-senang di dekat-Nya. Kita meminta kepada Allah, agar Dia menjadikan kita termasuk mereka, aamiin ya Mujiibas saa’iliin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 35",
    "description": "Mereka di dalamnya, yakni di dalam surga, memperoleh apa yang me-reka kehendaki, berupa segala macam kenikmatan dan pada kami ada tambahannya, kenikmatan yang tidak ada taranya yang tidak pernah terlintas oleh pikiran. 36. Setelah Allah memperingatkan orang-orang kafir dan menjelaskan siksaan yang akan menimpa mereka, pada ayat ini Allah memperingatkan mereka tentang datangnya azab yang dapat disegerakan kepada mereka di dunia, sebagaimana sunah Allah terhadap para pendusta. Ayat ini menyatakan dan betapa banyak umat yang telah kami binasakan sebelum mereka, seperti kaum 'ad, kaum Samud dan lain-lain padahal mereka lebih hebat kekuatannya daripada mereka, kaum musyrik mekah. Mereka pernah menjelajah di beberapa negeri untuk mencari rezeki. Adakah tempat pelarian dari kebinasaan bagi mereka' sama sekali tidak. Mereka semuanya telah binasa akibat kekafiran mereka kepada Allah dan pembangkangan terhadap rasul-Nya."
  }
]