[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami telah membinasakan umat-umat dalam jumlah yang banyak sebelum orang-orang musyrik Quraisy itu. Umat-umat tersebut lebih kuat dan lebih hebat dari orang-orang musyrik. Mereka mengembara di seluruh negeri, menempuh semuan jalan untuk menghindari kebinasaan. Adakah tempat berlari dari azab Allah saat ia datang kepada mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan betapa banyak umat yang telah Kami hancurkan sebelum orang-orang musyrik yang mendustakan dari penduduk Makkah, dan mereka telah meneliti beberapa negeri dengan harapan mereka bisa mendapatkan tempat untuk lari dari siksa, akan tetapi mereka tidak mendapatkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Kami telah membinasakan banyak umat sebelum orang-orang musyrik Makkah, seperti kaum ‘Ad dan Tsamud. Dahulu mereka memiliki kekuatan dan kekuasaan yang lebih besar daripada kaum musyrik Makkah, sehingga mereka dapat menjelajah negeri, membangun dan menghancurkannya. Maka apakah ada tempat berlindung dari azab Allah? Sungguh kehancuran umat-umat terdahulu merupakan pelajaran bagi orang yang mempunyai hati yang hidup yang mampu memahami dan menghayati, atau memiliki pendengaran yang seksama dan penuh kesadaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَكَمْ أَهْلَكْنَا قَبْلَهُم (Dan berapa banyaknya yang telah Kami binasakan sebelum mereka) Yakni sebelum orang-orang kafir Quraisy dan orang-orang yang serupa dengan mereka. مِّن قَرْنٍ(dari umat-umat) Yakni dari sebuah kaum. هُمْ أَشَدُّ مِنْهُم بَطْشًا(mereka yang mereka itu lebih besar kekuatannya daripada mereka ini) Seperti kaum ‘Aad, Tsamud, dan lainnya. فَنَقَّبُوا۟ فِى الْبِلٰدِ(maka mereka (yang telah dibinasakan itu) telah pernah menjelajah di beberapa negeri) Yakni telah menjelajahi dan mengelilingi tempat-tempatnya. هَلْ مِن مَّحِيصٍ (Adakah (mereka) mendapat tempat lari (dari kebinasaan)?) Yakni apakah mereka memiliki tempat lari yang dapat menyelamatkan mereka dari azab?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Banyak umat pada satu masa yang telah kami hancurkan sebelum kaum kafir Quraisy (Mereka itu digabungkan dalam satu masa). Mereka lebih kuat dari kaum kafir Quraisy, seperti kaum ‘Aad, Tsamud, dan kaum lainnya. Mereka berpindah dan menjelajah banyak negeri, namun mereka berbuat bathil dengan rejeki dan keamanan mereka. Adakah tempat untuk lari agar terbebas dari azab?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Betapa banyak umat} umat {sebelum mereka yang telah Kami binasakan. Mereka itu lebih hebat kekuatannya} kekuatan dan kemampuannya {daripada mereka itu, sehingga mampu menjelajah} mengamati {beberapa negeri. Apakah ada tempat pelarian} tempat lari dari azab Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Allah berfirman seraya menakut-nakuti kaum musyrikin yang mendustakan Rasulullah “Dan berapa banyaknya umat-umat yang telah Kami binasakan sebelum mereka,” yakni umat-umat yang banyak, “yang mereka itu lebih besar kekuatannya daripada mereka ini,” artinya, lebih kuat dan lebih kuat bekas karyanya di atas muka bumi ini, karena itulah Allah berfirman, “Mereka menjelajah di beberapa negeri,” mereka pernah membangun benteng yang kokoh, rumah yang tinggi menjulang, menanam pohon, membuat sungai, bercocok tanam, memakmurkan sekaligus menghancurkan, ketika mereka mendustakan utusan Allah serta menentang ayat-ayatNya, Allah menyiksa mereka dengan azab yang pedih dan berat. “Adakah (mereka) mendapat tempat lari (dari kebinasaan)?” artinya, tidak ada tempat bagi mereka untuk lari dari azab Allah ketika azab itu datang kepada mereka dan tidak ada sesuatu pun yang dapat menyelamatkan mereka. Kekuatan, harta, dan anak-anak mereka sama sekali tidak berguna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 36: Allah mengabarkan bahwasanya Allah membinasakan umat-umat yang terdahulu sebelum Quraisy, di mana mereka kaum yang kuat dan memiliki peninggalan di bumi. Mereka membangun benteng-benteng yang kokoh, dan rumah-rumah yang tinggi. Maka ketika datang adzab, maka leburlah semuanya, maka apakah bagi mereka ada celah, jalan keluar atau tempat untuk lari ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menakut-nakuti kaum musyrik yang mendustakan Rasulullah shallallahu 'alaihi wa sallam. Yaitu sebelum kaum kafir Quraisy. Mereka bangun benteng-benteng yang kokoh, bangunan-bangunan yang tinggi, menanam pepohonan, mengalirkan sungai-sungai, memakmurkan area yang kosong, dan lain-lain. Ketika mereka mendustakan ayat-ayat Allah, maka Allah menyiksa mereka dengan azab yang keras. Bahkan kekuatan mereka, harta dan anak-anak mereka tidak berguna apa-apa bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 36",
    "description": "Setelah Allah memperingatkan orang-orang kafir dan menjelaskan siksaan yang akan menimpa mereka, pada ayat ini Allah memperingatkan mereka tentang datangnya azab yang dapat disegerakan kepada mereka di dunia, sebagaimana sunah Allah terhadap para pendusta. Ayat ini menyatakan dan betapa banyak umat yang telah kami binasakan sebelum mereka, seperti kaum 'ad, kaum Samud dan lain-lain padahal mereka lebih hebat kekuatannya daripada mereka, kaum musyrik mekah. Mereka pernah menjelajah di beberapa negeri untuk mencari rezeki. Adakah tempat pelarian dari kebinasaan bagi mereka' sama sekali tidak. Mereka semuanya telah binasa akibat kekafiran mereka kepada Allah dan pembangkangan terhadap rasul-Nya. 37. Sungguh, pada yang demikian itu, yakni siksa yang menimpa para pendurhaka, pasti terdapat peringatan bagi orang-orang yang mempunyai hati untuk memikirkan dan mengetahui kebenaran atau yang menggunakan pendengarannya untuk mendengarkan petunjuk, sedang dia menyaksikannya, yakni menyaksikan dengan sadar terhadap peringatan Allah."
  }
]