[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pembinasaan umat-umat terdahulu mengandung pelajaran bagi siapa yang punya hati untuk memahami atau dia membuka pendengarannya dengan hati yang hadir, tidak lalai dan tidak lupa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Sesungguhnya di dalam apa yang telah disebutkan berupa dihancurkannya umat-umat yang terdahulu, terdapat peringatan dan pelajaran bagi orang yang mempunyai hati yang berakal atau mendengarkan dengan pendengaran yang dihadiri hati, tidak lalai."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. إِنَّ فِى ذٰلِكَ لَذِكْرَىٰ (Sesungguhnya pada yang demikian itu benar-benar terdapat peringatan) Yakni kisah-kisah mereka yang telah disebutkan mengandung pelajaran dan peringatan. لِمَن كَانَ لَهُۥ قَلْبٌ(bagi orang-orang yang mempunyai akal) Yakni bagi orang yang berakal. Pendapat lain mengatakan, yakni bagi orang yang hidup jiwanya. أَوْ أَلْقَى السَّمْعَ(atau yang menggunakan pendengarannya) Yakni yang mendengarkan wahyu yang dibacakan kepadanya. وَهُوَ شَهِيدٌ (sedang dia menyaksikannya) Yakni yang menghayatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Sesungguhnya yang telah disebutkan dalam surah ini merupakan kisah mereka (orang kafir) yang digunakan sebagai peringatan dan pelajaran bagi orang yang memiliki akal dan kesadaran untuk menyadari kebenaran dan pendengaran untuk mendengar nasehat. Hal itu membuat kita dapat berpikir dan paham serta membangunkan hati (yang tertidur)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya pada yang demikian itu pasti terdapat peringatan} peringatan dan pelajaran {bagi orang-orang yang mempunyai hati atau yang menggunakan pendengarannya} menggunakan pendengaran {dan dia menyaksikan} menghadirkan hatinya sehingga tidak lalai dan lupa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Sesungguhnya pada yang demikian itu benar-benar terdapat peringatan bagi orang-orang yang mempunyai hati,” yakni hati yang agung, hidup, cerdas, dan suci. Apabila ayat-ayat Allah datang, hati mengingat dan memanfaatkannya sehingga nilainya semakin naik. Dan begitu juga orang yang mendengarkan ayat-ayat Allah untuk dijadikan petunjuk hati, “sedang dia menyaksikannya,” yaitu ada, ini juga memiliki peringatan, nasihat, pengobat, dan petunjuk. Adapun orang yang berpaling dan tidak mau mendengarkan ayat-ayat Allah, maka semua itu tidak berguna sama sekali, sebab hatinya tidak bisa menerima, sehingga hikmah Allah tidak bisa memberikan hidayah pada orang yang memiliki sifat seperti itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 37: Ketahuilah wahai manusia, apa yang mencelakakan bagi umat-umat yang lalu adalah sebagai peringatan bagi yang memiliki hati yang hidup dan akal yang sehat. Dan peringatan yang bermanfaat bagi siapa yang mau mendengar untuk dibacakan wahyu kepadanya, yaitu ia yang menghadirkan pemahaman, dan menghidupkan hati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni hadir hatinya. Adapun orang yang berpaling yang tidak mau menggunakan pendengarannya untuk mendengarkan ayat-ayat Allah, maka ayat-ayat itu tidak berfaedah apa-apa baginya, karena tidak ada kesiapan menerima padanya dan tidak sejalan dengan kebijaksanaan Allah memberi petunjuk kepada orang yang seperti ini sifatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 37",
    "description": "Sungguh, pada yang demikian itu, yakni siksa yang menimpa para pendurhaka, pasti terdapat peringatan bagi orang-orang yang mempunyai hati untuk memikirkan dan mengetahui kebenaran atau yang menggunakan pendengarannya untuk mendengarkan petunjuk, sedang dia menyaksikannya, yakni menyaksikan dengan sadar terhadap peringatan Allah. 38. Dalam ayat ini Allah bersumpah atas kekuasaannya. Dan sungguh, kami telah menciptakan langit yang berlapis-lapis dan bumi yang terhampar dan apa yang ada antara keduanya dalam enam masa, dan kami tidak merasa letih sedikit pun. Dengan ayat ini Allah menyatakan kesalahan anggapan orang-orang yahudi yang mengatakan bahwa Allah menciptakan langit dan bumi dalam enam hari, dimulai pada hari ahad dan diakhiri pada hari jumat dan istirahat pada hari sabtu, lalu berbaring di atas 'arasy karena merasa letih. Maka Allah membantah pendapat itu. Mahasuci Allah dari segala sifat kekurangan dan kelemahan."
  }
]