[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah menciptakan langit dan bumi dan apa yang ada di antara keduanya berupa makhluk-makhluk dengan berbagai macamnya dalam 6 hari. Kami tidak capek dan tidak pula lelah dalam mencipta . dalam Kuasa besar ini membuktikan bahwa Allah lebih kuasa lagi untuk menghidupkan orang-orang yang sudah mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan sungguh telah Kami ciptakan langit dan Kami ciptakan bumi dan apa yang ada di antara keduanya dalam enam hari padahal Kami mampu menciptakannya dalam sekejap, dan tidaklah Kami merasa capek sebagaimana yang dikatakan oleh orang-orang Yahudi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Sungguh Kami telah menciptakan tujuh langit dan bumi serta makhluk-makhluk yang ada di antara keduanya dalam waktu enam hari, dan dalam penciptaan itu Kami sama sekali tidak merasa lelah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَمَا مَسَّنَا مِن لُّغُوبٍ (dan Kami sedikitpun tidak ditimpa keletihan) Makna (اللغوب) yakni kelelahan dan keletihan. Dikatakan bahwa orang-orang Yahudi berkata: “Allah menciptakan langit dan bumi serta segala isinya dalam enam hari, Dia memulai di hari Ahad dan berakhir di hari Jum’at, dan Dia beristirahat di hari Sabtu.” Maka Allah membantah perkataan mereka ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Sungguh kami telah menciptakan langit, bumi dan segala isinya berupa makhluk, dan Kami tidak merasa lelah dan letih. Ayat ini diturunkan untuk menanggapi orang Yahudi yang beranggapan bahwa Allah beristirahat di hari ke-7 setelah menciptakan langit dan bumi, yaitu pada hari sabtu, lalu Allah SWT menyangkal (anggapan) mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menciptakan langit, bumi, dan apa yang ada antara keduanya dalam enam masa dan Kami tidak merasa} Kami tidak ditimpa {letih} keletihan dan kelelahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Ini adalah pemberitahuan Allah tentang KuasaNya yang Mahaagung serta kehendakNya yang pasti terlaksana, yang dengan itu Allah menciptakan makhluk terbesar yaitu “ langit dan bumi dana pa yang ada di antara keduanya dalam enam masa,” dimulai dari Hari ahad dan berakhir pada Hari Jumat tanpa lelah dan letih. Allah yang menciptakan langit dan bumi segitu besar dan luasnya tentu lebih mampu untuk menghidupkan manusia yang telah mati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 38: Allah mengabarkan bahwa Dia menciptakan langit dan bumi beserta apa yang ada di dalamnya, yang Allah jadikan dari ketiadaan menjadi ada dengan tanpa permisalan yang telah lalu, pada enam masa dengan tanpa kepayahan. Tidak sebagaimana yang dikatakan oleh yahudi yang mengatakan : Bahwa Allah istirahat pada hari sabtu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan berita dari Allah Subhaanahu wa Ta'aala tentang kekuasaan-Nya yang besar dan kehendak-Nya yang berlaku, dimana dengannya Dia ciptakan makhluk-makhluk yang besar. Dimulai dari hari Ahad dan diakhiri dengan hari Jum’at. Ayat ini sebagai bantahan terhadap orang-orang Yahudi yang mengatakan, bahwa Allah beristirahat pada hari Sabtu. Oleh karena itu, Tuhan yang mampu menciptakan makhluk-makhluk yang besar itu tentu mampu menghidupkan orang-orang yang telah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 38",
    "description": "Dalam ayat ini Allah bersumpah atas kekuasaannya. Dan sungguh, kami telah menciptakan langit yang berlapis-lapis dan bumi yang terhampar dan apa yang ada antara keduanya dalam enam masa, dan kami tidak merasa letih sedikit pun. Dengan ayat ini Allah menyatakan kesalahan anggapan orang-orang yahudi yang mengatakan bahwa Allah menciptakan langit dan bumi dalam enam hari, dimulai pada hari ahad dan diakhiri pada hari jumat dan istirahat pada hari sabtu, lalu berbaring di atas 'arasy karena merasa letih. Maka Allah membantah pendapat itu. Mahasuci Allah dari segala sifat kekurangan dan kelemahan. 39. Maka bersabarlah engkau, wahai nabi Muhammad, terhadap apa yang mereka katakan, yaitu pengingkaran mereka terhadap keniscayaan hari kiamat dan bertasbihlah dengan memuji tuhanmu sebelum matahari terbit, yakni salat subuh, dan sebelum terbenam, yakni salat zuhur dan asar."
  }
]