[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Maka bersabarlah (wahai Rasul), atas apa yang diucapkan oleh orang-orang yang mendustakan, karena Allah selalu mengawasi mereka. Shalatlah untuk tuhanmu dengan memujiNya pada shalat shubuh sebelum terbit matahari dan shalat Ashar sebelum terbenam matahari. Shalatlah di malam hari dan bertasbihlah dengan memuji Tuhanmu sesudah Shalat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Maka bersabarlah kamu -wahai Rasul- atas apa yang dikatakan oleh orang-orang Yahudi dan selain mereka, dan salatlah untuk Rabbmu dengan memuji-Nya dengan salat fajar sebelum terbitnya matahari dan salatlah asar sebelum terbenamnya matahari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39-42. Hai Rasulullah, bersabarlah atas kesyirikan dan pendustaan yang dikatakan orang-orang kafir, dan bertasbihlah memuji Tuhanmu, serta dirikanlah shalat subuh sebelum terbit matahari dan shalat ashar sebelum terbenam matahari -dua kewajiban shalat ini ada sebelum peritiwa isra’ mi’raj-, dan dirikanlah shalat tahajjud. Bertasbihlah dan perbanyaklah zikir setelah shalat fardhu; dan dengarkanlah ketika malaikat menyeru dengan meniup sangkakala dari tempat yang dekat untuk membangkitkan para makhluk, pada hari seluruh makhluk dapat mendengar tiupan yang pasti terjadi ini. Pada hari yang besar itu manusia akan keluar dari kubur mereka dalam keadaan hidup. Ibnu ‘Abbas berkata: “Allah memerintahkan Rasulullah untuk bertasbih setelah melaksanakan setiap shalat dengan firman-Nya: (وأدبار السجود) ‘setiap selesai shalat’.” (Shahih al-Bukhari, kitab tafsir, surat Qaf, bab [وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب] 8/462-463, no. 4852)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ (dan bertasbihlah sambil memuji Tuhanmu sebelum terbit matahari dan sebelum terbenam(nya)) Yakni sucikanlah Allah dari segala yang tidak pantas bagi-Nya dengan mengatakan: “Maha Suci Allah dan segala puji bagi-Nya” pada waktu pagi dan sore hari. Pendapat lain mengatakan, yang dimaksud adalah perintah menjalankan shalat subuh dan shalat ashar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Bersabarlah wahai nabi atas apa yang dikatakan oleh orang-orang musyrik yang mengingkari hari kebangkitan dan risalahmu. Allah Maha Kuasa dan Maha Membalas mereka. Bersabarlah juga terhadap perkataan orang Yahudi yang menyamakan sang Pencipta dengan manusia dan mendustakanmu. Sucikanlah Allah dari sesuatu yang tidak sesuai denganNya sebelum terbitnya matahari (di saat shalat subuh) dan sebelum terbenamnya matahari (di saat shalat zhuhur dan ashar)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka bersabarlah atas apa yang mereka katakan dan bertasbihlah dengan memuji Tuhanmu} dan shalatlah kepada Tuhanmu dengan memujiNya {sebelum terbit} shalat fajar sebelum terbitnya matahari {dan terbenamnya matahari} shalat ashar sebelum terbenamnya matahari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “Maka bersabarlah kamu terhadap apa yang mereka katakan,” yakni yang mencelamu dan mendustakan risalah yang kau bawa, sibukkan dirimu dengan ketaatan terhadap Rabbmu dan bertasbihlah di permulaan siang dan di penghujungnya dan pada waktu malam hari serta setiap selesai shalat , karena mengingat Allah bisa membawa pelipur untuk jiwa, melegakkan jiwa, dan meringankan beban untuk bersabar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 39: Allah mengabarkan kepada Nabi-Nya ﷺ agar bersabar atas ucapan mereka orang-orang musyrik yang dusta. Dan agar mensucikan Allah dari apa yang tidak pantas bagi-Nya, dan agar mendekatkan diri dengan ibadah dan ketaatan sebelum munculnya matahari yaitu waktu fajar, dan sebelum terbenamnya matahari, yaitu waktu ashar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa celaan dan pendustaan kepada apa yang engkau bawa. Sibukkanlah dengan ketaatan kepada Tuhanmu dan bertasbihlah kepada-Nya baik di awal siang maupun akhirnya, di malam hari dan setelah shalat, karena sesungguhnya mengingat Allah dapat menghibur jiwa, menenangkannya dan membantu untuk bersabar. Yakni shalatlah. Yaitu shalat Subuh. Yaitu shalat Zhuhur dan Ashar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 39",
    "description": "Maka bersabarlah engkau, wahai nabi Muhammad, terhadap apa yang mereka katakan, yaitu pengingkaran mereka terhadap keniscayaan hari kiamat dan bertasbihlah dengan memuji tuhanmu sebelum matahari terbit, yakni salat subuh, dan sebelum terbenam, yakni salat zuhur dan asar. 40. Dan bertasbihlah kepada-Nya pada malam hari, yakni salat magrib dan isya dan setiap selesai salat, yakni bertasbihlah setiap selesai mengerjakan salat."
  }
]