[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami mengetahui bahwa bumi tidak mengurangi dan menghancurkan jasad mereka. Kami punya kitab yang tejaga dari pergantian dan perubahan, yang mencatat apa yang terjadi pada mereka dalam hidup mereka dan sesudah mereka mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kami telah mengetahui apa yang dimakan oleh bumi dari tubuh-tubuh mereka setelah kematian, tidak ada sesuatu pun yang tersembunyi bagi Kami terkait hal itu, dan Kami memiliki satu kitab yang mencatat apa yang telah ditakdirkan oleh Allah atas mereka dalam kehidupan mereka dan setelah kematian mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Kami telah mengetahui dengan pasti jasad, daging, dan darah mereka yang termakan tanah saat mereka telah mati; Kami juga memiliki kitab yang mencatat hal itu dan segala yang terjadi di kehidupan, kematian, dan kebangkitan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. قَدْ عَلِمْنَا مَا تَنقُصُ الْأَرْضُ مِنْهُمْ ۖ (Sesungguhnya Kami telah mengetahui apa yang dihancurkan oleh bumi dari (tubuh-tubuh) mereka) Yakni Kami mengetahui jasad mereka yang dimakan tanah, sehingga tidak ada yang terlewat dari Kami tentang hal itu. وَعِندَنَا كِتٰبٌ حَفِيظٌۢ (dan pada sisi Kamipun ada kitab yang memelihara (mencatat)) Yakni yang mencatat jumlah dan nama-nama mereka serta mencatat segala sesuatu, yaitu kitab Lauhul mahduzh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Allah menjawabi mereka, sesungguhnya kami mengetahui apa yang dimakan bumi dari jasadmu setelah mati. Tidak ada yang tersembunyi dari kami. Kami memiliki catatan rinci lagi menyeluruh yang menyimpan (informasi) tentang segala sesuatu dan perbuatan. Itu adalah Lauhil Mahfudz"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah mengetahui apa yang dimakan bumi dari mereka} apa yang dimakan bumi dari tubuh mereka setelah kematian mereka {karena di sisi Kami ada kitab yang terpelihara baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Kemudian Allah menyebutkan alasan mengapa merasa heran, Allah berfirman (tentang ucapan mereka), “Apakah kami setelah mati dan setelah menjadi tanah (kami akan kembali lagi), itu adalah suatu pengembalian yang tidak mungkin.” Mereka menyamakan Kuasa Allah yang Mahakuasa atas segala sesuatu dan Mahasempurna dari segala hal, dengan kuasa manusia yang memerlukan pertolongan dan lemah dalam berbagai hal. Mereka menyamakan orang bodoh yang tidak mengetahui apa pun, dengan Allah Yang Maha Mengetahui segala sesuatu, yang mengetahui “apa yang dihancurkan oleh bumi,” berupa jasad-jasad mereka selama mereka berada di alam barzakh. Dan Allah telah mencatat semua yang terjadi pada mereka, baik ketika mereka hidup maupun setelah mati, itulah catatan di sisi Allah yang terjaga dari perubahan dan penggantian. Ini adalah sebagai bukti sempurnanya ilmu Allah yang hanya Dia semata yang mengetahui segala sesuatu, Dia mampu untuk menghidupkan kembali orang-orang yang sudah mati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 4: Allah menjawab atas ucapan-ucapan mereka dengan berkata: Ketahuilah wahai orang-orang kafir bahwasanya Kami mengetahui dengan sebenar-benar pengetahuan, dengan apa yang bumi ia memakan jasad-jasad manusia yang mati; Tidak ada kesesatan dari Kami sesuatu pun atas hal itu, karena di sisi Kami terdapat satu kitab yang terjaga yang di dalamnya berisi seluruh perihal hamba; Tidak akan luput sesuatu apapun darinya; meskipun sebelum datangnya kematian mereka (yaitu para hamba) maupun setelah kematian mereka. Dan kitab ini adalah Lauhul Mahfudz."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini berdalih dengan kesempurnaan dan keluasan ilmu Allah untuk menunjukkan kekuasaan-Nya menghidupkan orang-orang yang telah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 4",
    "description": "Hal itu tidak aneh. Sungguh, kami telah mengetahui apa yang ditelan bumi dari tubuh mereka baik sebelum maupun sesudah kematiannya, sebab pada kami ada kitab yang berisi catatan tentang keadaan dan perbuatan mereka yang terpelihara baik. Dengan demikian tidak ada keraguan sedikit pun tentang kebangkitan dan bahwa itu pasti terjadi. 5. Akan tetapi mereka tetap saja mengingkari kebangkitan itu, meskipun bukti-bukti telah dijelaskan. Bahkan mereka telah mendustakan kebenaran, yakni kebenaran Al-Qur'an dan kenabian nabi Muhammad, ketika kebenaran itu datang kepada mereka, maka mereka berada dalam keadaan kacau balau. Mereka sebenarnya mengetahui kebenaran, tetapi mengingkarinya."
  }
]