[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Maka bersabarlah (wahai Rasul), atas apa yang diucapkan oleh orang-orang yang mendustakan, karena Allah selalu mengawasi mereka. Shalatlah untuk tuhanmu dengan memujiNya pada shalat shubuh sebelum terbit matahari dan shalat Ashar sebelum terbenam matahari. Shalatlah di malam hari dan bertasbihlah dengan memuji Tuhanmu sesudah Shalat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Dan pada malam hari salatlah untuk-Nya dan sucikanlah Dia setiap selesai salat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَمِنَ الَّيْلِ فَسَبِّحْهُ (Dan bertasbihlah kamu kepada-Nya di malam hari) Yakni bertasbihlah kepada-Nya di sebagian malam. Pendapat lain mengatakan yang dimaksud adalah perintah untuk menjalankan sholat malam. وَأَدْبٰرَ السُّجُودِ(dan setiap selesai sembahyang) Yakni dan bertasbihlah kepada-Nya di setiap selesai shalat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sucikanlah Allah di malam hari dengan melaksanakan shalat maghrib dan ‘isya’ da di akhir-akhir waktu shalat. Adbar yaitu waktu-waktu terakhir suatu hal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bertasbihlah juga kepadaNya} dan shalatlah {pada sebagian malam dan setiap selesai shalat} dan bertasbihlah dengan memujiNya di setiap selesai shalat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “Maka bersabarlah kamu terhadap apa yang mereka katakan,” yakni yang mencelamu dan mendustakan risalah yang kau bawa, sibukkan dirimu dengan ketaatan terhadap Rabbmu dan bertasbihlah di permulaan siang dan di penghujungnya dan pada waktu malam hari serta setiap selesai shalat , karena mengingat Allah bisa membawa pelipur untuk jiwa, melegakkan jiwa, dan meringankan beban untuk bersabar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 40: Allah juga memerintahkan untuk memperbanyak shalat di malam hari, dan agar bertasbih serta berdzikir selepas shalat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu shalat Maghrib dan Isya. Maksudnya, kerjakan pula shalat-shalat sunat setelah shalat fardhu. Ada pula yang berpendapat, bahwa maksudnya perintah untuk mengucapkan tasbih dan tahmid pada waktu-waktu tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 40",
    "description": "Dan bertasbihlah kepada-Nya pada malam hari, yakni salat magrib dan isya dan setiap selesai salat, yakni bertasbihlah setiap selesai mengerjakan salat. 41. Dan dengarkanlah seruan pada hari kiamat, ketika penyeru, yaitu malaikat israfil, menyeru dari tempat yang dekat, sehingga mudah terdengar oleh sekalian makhluk, agar mereka berkumpul di padang mahsyar untuk dihisab dan menerima pembalasan."
  }
]