[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Dengarkanlah (wahai Rasul) hari di mana malaikat memanggil dengan meniup sangkakala dari tempat yang dekat. Hari itu mereka mendengar teriakan kebangkitan yang benar, yang tidak ada kebimbangan dan keraguan padanya, itu adalah hari keluarnya penghuni-penghuni kubur dari kubur mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Pada hari ketika seluruh makhluk mendengar teriakan kebangkitan dengan sebenar-benarnya yang tidak ada keraguan padanya. Pada hari mereka mendengarkan teriakan itu adalah hari keluarnya orang-orang mati dari kuburan mereka untuk perhitungan dan pembalasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَاسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ (Dan dengarkanlah (seruan) pada hari penyeru (malaikat) menyeru) Yakni ketika malaikat Israfil meniup sangkakala pada kedua kalinya. Pendapat lain mengatakan ketika itu malaikat Israfil meniup sangkakala dan malaikat Jibril menyeru orang-orang yang ada di padang mahsyar “Kemarilah untuk menjalankan hisab” مِن مَّكَانٍ قَرِيبٍ(dari tempat yang dekat) Yakni dari tempat yang seruannya dapat terdengar oleh seluruh penghuni padang mahsyar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Hari dimana seluruh makhluk mendengar teriakan hari kebangkitan yaitu tiupan kedua dari Israfil. Tiupan ini sesuai dengan kebenaran yang mereka ingkari. Itulah hari dimana mereka keluar dari kubur untuk dihisab dan dibalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu mereka mendengar suara dahsyat} tiupan kedua {dengan sebenar-benarnya} dengan sebenarnya {Itulah hari (manusia) keluar} hari ketika orang-orang mati keluar dari kubur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “(Yaitu) pada hari mereka mendengar teriakan,” di mana semua makhluk bisa mendengarnya, ”teriakan” yang mengusik dan membuat takut ”dengan sebenar-benarnya,” yang tidak ada keraguan dan tidak perlu diperdebatkan. ”Itulah hari keluar” dari kubur, yang hanya Allah Yang Mahakuasa atas segala sesuatu yang bisa melakukannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 42: Pada hari para makhluk mendengar tiupan ini, dan mereka semua tahu bahwa ini adalah hari kebangkitan. Dan hari dimana manusia keluar dari kubur-kubur mereka, dan dikumpulkan dalam satu barisan untuk dibalas dan dihisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu tiupan kedua untuk kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 42",
    "description": "Yaitu pada hari ketika mereka mendengar suara dahsyat dengan sebe-narnya. Itulah hari keluar dari kubur. 43. Sungguh, kami yang menghidupkan manusia di dunia dan mematikan manusia pada waktu yang ditentukan, dan kepada kami tempat kembali semua makhluk untuk menerima pembalasan atas amal perbuatannya."
  }
]