[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Sesungguhnya Kami menghidupkan makhluk dan mematikan mereka di dunia. Hanya kepada Kami tempat kembali mereka semuanya di Hari Kiamat untuk perhitungan amal dan pembalasan. Hari itu bumi terbelah dan mengeluarkan orang-orang yang mati yang dikubur di dalamnya, mereka keluar dengan cepat kepada penyeru. Pengumpulan mereka semuanya di tempat perhitungan amal adalah suatu yang mudah bagi Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Pada hari itu bumi terbelah lalu mereka keluar dengan tergesa-gesa. Itu adalah pengumpulan yang mudah bagi Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ ((Yaitu) pada hari bumi terbelah-belah menampakkan mereka) Yakni terbelah bagi mereka, sehingga mereka dapat keluar dan digiring ke padang mahsyar. سِرَاعًا ۚ( (lalu mereka ke luar) dengan cepat) Yakni mereka dengan cepat menuju malaikat yang menyeru mereka. ذٰلِكَ حَشْرٌ(Yang demikian itu adalah pengumpulan) Yakni pembangkitan dan pengumpulan. عَلَيْنَا يَسِيرٌ(yang mudah bagi Kami) Yakni mudah untuk Kami lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Pada hari itu bumi terpecah belah untuk ditampakkan pada mereka, sehingga mereka bergegas menuju penyeru itu dan menuju padang mahsyar. Itulah hari kebangkitan dan pengumpulan yang mudah bagi Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu bumi terbelah} tebelah {dengan mengeluarkan mereka dengan bergegas} lalu mereka keluar dengan bergegas {Yang demikian itu adalah pengumpulan yang mudah bagi Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-44. Karena itulah Allah berfirman, ”Sesungguhnya Kami menghidupkan dan mematikan dan hanya kepada Kami-lah tempat kembali (semua makhluk). (Yaitu) pada hari bumi terbelah-belah menampakkan mereka,” menampakkan semua manusia “dengan cepat,” di mana mereka bersegera memenuhi panggilan yang memanggil mereka untuk menuju tempat pemberhentian pada hari Kiamat. “Yang demikian itu adalah pengumpulan yang mudah bagi Kami,” artinya, mudah bagi Allah, tidak ada kelelahan dalam melakukannya dan tidak ada beban."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 44: Ingatlah wahai manusia pada hari dibelahnya bumi maka keluarlah jasad-jasad dari kubur-kubur mereka dengan cepat menjawab seruan. Ketahuilah bahwa urusannya hanyalah terkumpul kepada Allah, dengan tanpa kesulitan dan halangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang berada dalam kubur. Untuk mendatangi penyeru mereka ke tempat pemberhentian (padang mahsyar) pada hari Kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 44",
    "description": "Yaitu pada hari ketika bumi terbelah, mereka keluar dari kubur dengan cepat menuju ke padang mahsyar. Yang demikian itu adalah pengumpulan bagi sekalian manusia yang mudah bagi kami. 45. Kami lebih mengetahui tentang apa yang mereka katakan, yakni kebohongan kaum kafir mekah, dan engkau wahai nabi Muhammad bukanlah seorang pemaksa terhadap mereka. Tugasmu adalah memberikan peringatan, maka berilah peringatan dengan Al-Qur'an kepada siapa pun yang takut kepada ancaman-ku."
  }
]