[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami lebih mengetahui tentang apa yang dikatakan oleh orang-orang musyrik, yaitu kedustaan atas nama Allah dan pendustaan kepada ayat-ayatNya. Kamu (wahai rasul) tidak memiliki kuasa untuk memaksa mereka masuk Islam, karena kamu hanya diutus sebagai penyampai. Maka ingatkanlah dengan al-Quran ini siapa yang takut terhadap ancamanKu, karena siapa yang tidak takut kepada suatu ancaman, maka dia tidak akan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Kami lebih mengetahui apa yang dikatakan oleh para pendusta, dan tidaklah kamu -wahai Rasul- berkuasa atas mereka sehingga memaksa mereka untuk beriman. Engkau hanyalah seorang penyampai apa yang diperintahkan oleh Allah untuk disampaikan, maka berilah peringatan dengan Al-Qur`ān kepada orang yang takut ancaman-Ku bagi orang-orang kafir dan pelaku kemaksiatan, karena orang yang takut itu orang yang bisa menerima nasihat dan ingat apabila diingatkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Allah mengancam orang-orang musyrik akibat kedustaan mereka: “Kami lebih mengetahui kedustaan mereka terhadap Allah yang mereka ucapkan. Hai Rasulullah, kamu bukanlah orang yang memaksa mereka memeluk Islam; maka berilah peringatan dengan al-Qur’an bagi orang yang takut terhadap ancaman-Ku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَمَآ أَنتَ عَلَيْهِم بِجَبَّارٍ ۖ (dan kamu sekali-kali bukanlah seorang pemaksa terhadap mereka) Yakni orang yang memaksa mereka agar mereka beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Kami mengetahui apa yang dikatakan oleh kaum kafir Quraisy. Kamu tidak lain hanya orang yang diberi kuasa untuk mengabarkan kepada mereka tentang iman. Ingatkanlah orang-orang yang takut terhadap janjiKu dengan Al-Qur’an"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami lebih mengetahui apa yang mereka katakan dan kamu bukanlah seorang pemaksa bagi mereka} orang yang kuasa memaksa mereka untuk masuk Islam {Maka berilah peringatan dengan Al-Qur’an kepada siapa saja yang takut pada ancamanKu} azabKu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “Kami lebih mengetahui tentang apa yang mereka katakan,” hinaan yang mereka katakana kepadamu yang membuatmu sedih. Jika Kami mengetahui hal itu, maka engkau juga mengetahui bagaimana Kami memperhatikanmu dan memudahkan segala urusanmu serta menolongmu atas musuh-musuhmu, engkau mengetahui bagaimana Kami memperhatikanmu dan memudahkan segala urusanmu serta menolongmu atas musuh-musuhmu, maka bergembiralah hatimu, tenangkan jiwamu dan hendaknya engkau mengetahui bahwa Kami menyayangimu dan mencintai jiwamu. Yang hanya bisa kau lakukan adalah menanti janji Allah dan meneladani para rasul-rasul ulul azmi, “Dan kamu sekali-kali bukanlah seorang pemaksa terhadap mereka,” yakni menguasai mereka. Karena itulah Allah berfirman, “Maka berilah peringatan dengan al-Quran ini orang yang takut kepada ancamanKu,” peringatan adalah sesuatu yang menancap di akal dan fitrah berupa rasa cinta terhadap kebaikan, mengutamakan serta melakukan kebaikan, membenci keburukan dan menjauhinya. Mereka yang bisa memanfaatkan peringatan Allah adalah yang takut akan ancamanNya, sedangkan orang yang tidak takut terhadap ancaman Allah dan tidak beriman kepadaNya, maka manfaat dari peringatan tersebut adalah penegakkan hujjah padanya agar tidak beralasan \"belum datang rasul pembawa berita gembira dan ancaman\"."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 45: Allah berkata kepada Nabi-Nya ﷺ : Kami lebih tahu atas Rasul-Nya atas apa yang dikatakan orang-orang kafir yang ingkar dengan hari kebangkitan serta mengolok-oloknya. Ketahuilah bahwa engkau tidaklah memiliki wewenang atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang membuat hatimu sedih. Maksudnya, jika Kami lebih mengetahuinya, maka sesungguhnya engkau mengetahui bagaimana perhatian Kami kepadamu, kemudahan dari Kami terhadap semua urusanmu dan pertolongan Kami terhadap musuh-musuhmu. Oleh karena itu, tenangkanlah hatimu dan bergembiralah. Ketahuilah, bahwa Kami lebih sayang kepadamu daripada dirimu sendiri. Oleh karena itu, tidak ada ada lagi sikap bagimu selain menunggu kedatangan janji-Nya dan mengikuti jejak para rasul ulul ‘azmi. Yakni engkau hanyalah seorang pemberi peringatan. Kata ‘Fadzakkir’ artinya maka ingatkanlah, yakni ingatkanlah dengan Al Qur’an perkara yang telah terpendam dalam akal dan fitrah berupa mencintai kebaikan, mengutamakannya dan mengerjakannya, serta kebencian kepada keburukan dan menjauhinya. Namun hanya orang yang takut kepada ancaman Allah-lah yang dapat ingat atau sadar, sedangkan orang yang tidak takut kepada ancaman Allah dan tidak beriman kepadanya, maka mengingatkannya hanyalah untuk menegakkan hujjah agar ia tidak berkata, “Belum datang kepada kami seorang pemberi peringatan dan pembawa kabar gembira.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 45",
    "description": "Kami lebih mengetahui tentang apa yang mereka katakan, yakni kebohongan kaum kafir mekah, dan engkau wahai nabi Muhammad bukanlah seorang pemaksa terhadap mereka. Tugasmu adalah memberikan peringatan, maka berilah peringatan dengan Al-Qur'an kepada siapa pun yang takut kepada ancaman-ku. 1'4. Surah yang lalu diakhiri dengan penjelasan tentang hari kebangkitan yang pada saat itu akan terbukti ancaman-ancaman Allah yang telah diungkapkan sebelumnya. Oleh karena itu sangat tepat ketika surah ini dimulai dengan kalimat-kalimat yang mengukuhkan ancaman tersebut. Pengukuhan itu diungkapkan dengan sumpah-Nya bahwa semua yang diperingatkan itu pasti akan terbukti. :'demi angin kencang yang menerbangkan debu dengan tiupannya yang sangat kuat dan dahsyat, dan demi awan yang gumpalannya mengandung banyak air hujan yang menyuburkan tanah, dan demi kapal-kapal yang berlayar dengan membawa segala keperluan ke seluruh penjuru dengan mu-dah karena tiupan angin yang kuat, dan demi malaikat-malaikat yang membagi-bagi urusan yang diamanahkan kepada mereka, seperti menurunkan hujan, membagi rezeki, dan lainnya."
  }
]