[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu justru mendustakan al-Quran saat ia datang kepada mereka. Urusan mereka goncang dan kacau, mereka tidak teguh diatas satu keadaan dan tidak stabil diatasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Akan tetapi orang-orang musyrik itu mendustakan Al-Qur`ān tatkala dibawa oleh Rasul kepada mereka. Mereka dalam keadaan goncang, tidak mempunyai pendapat yang tetap dalam hal ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Mereka tidak meyakini kebenaran yang Rasulullah datangkan, mereka mendustakannya, sungguh mereka berada dalam perkara yang meragukan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَهُمْ فِىٓ أَمْرٍ مَّرِيجٍ (maka mereka berada dalam keadaan kacau balau) Yakni dalam hal yang tidak pasti, terkadang mereka mengatakan Muhammad adalah tukang sihir, terkadang mengatakan dia adalah penyair, dan terkadang mengatakan dia adalah dukun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Namun kenyataannya mereka tetap mendustakan Al-Qur’an dan risalah kenabian yang diteguhkan dengan mukjizat yang telah sampai kepada mereka dan telinga mereka. Mereka terganggu dengan isi Al-Qur’an, apakah itu sihir, ilmu perdukunan, ataukah syair?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang menjaga rincian segala sesuatu {Bahkan mereka mendustakan kebenaran} Al-Qur’an {ketika datang kepada mereka. Maka mereka berada dalam keadaan kacau balau} kekacauan dan campur baur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Maksudnya, “sebenarnya,” perkataan yang mereka ucapkan itu hanyalah merupakan (bentuk) pembangkangan serta pendustaan mereka terhadap kebenaran yang merupakan tingkat kejujuran yang paling tinggi, “tatkala kebenaran itu datang kepada mereka, maka mereka berada dalam keadaan kacau balau,” yakni, kacau dan campur aduk. Mereka tidak menetapkan atas sesuatu pun dan tidak ada ketetapan sama sekali, terkadang mereka berkata kepadamu, “Sesungguhnya engkau adalah tukang sihir,” terkadang “Engkau adalah orang gila,” terkadang “Engkau adalah penyair.” Dan mereka juga menjadikan al-Quran sebagai bahan olok-olokkan. Masing-masing yang dikatakan itu berdasarkan pandangannya yang rusak. Dan memang seperti itulah kondisi semua orang yang mendustakan kebenaran, ia berada dalam kekacauan, tidak mengetahui sisi yang tepat. Sehingga engkau akan bisa melihat semua sikapnya saling kontradiksi dan dusta. Sebagaimana orang yang mengikuti kebenaran serta membenarkannya memiliki keteguhan dan lurus jalannya. Perbuatannya membenarkan perkataannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 5: Allah menjelaskan buah yang buruk dan hina atas kedustaan mereka yaitu pengingkaran mereka akan Al Quran ketika telah datang kepada mereka, yang kemudian mereka menjadikan urusan yang ada di dalam Al Qur’an perselisihan yaitu dalam urusan kitab Allah dan rasul-Nya. Karena sebab mereka meyakini sebagaimana peninggalan-peninggalan para pendahulu mereka, yang melekat pada pikiran-pikiran mereka dan juga hawa nafsu-hawa nafsu mereka karena tidak mau dituntut untuk terbebani dengan syariat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, ucapan yang muncul dari mereka adalah sikap membangkang dan mendustakan kebenaran yang kebenarannya berada pada posisi yang paling tinggi. Sesekali mereka mengatakan sebagai sihir, sesekali sebagai sya’ir dan sesekali sebagai dukun. Mereka tidak kokoh dalam sesuatu, bahkan mereka membagi-bagi Al Qur’an sebagian mereka percayai dan sebagian lagi mereka ingkari, masing-masing berkata tentang Beliau dan Al Qur’an dengan pendapatnya yang rusak. Demikianlah semua orang yang mendustakan kebenaran, keadaannya kacau balau, tidak ada arah dan hal yang tetap. Kita dapat melihat, semua urusannya bertentangan dan dibuat-buat. Sebaliknya, orang yang mengikuti kebenaran dan membenarkannya, maka akan lurus urusannya, lurus jalannya dan benarnya antara perbuatan dengan perkataannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 5",
    "description": "Akan tetapi mereka tetap saja mengingkari kebangkitan itu, meskipun bukti-bukti telah dijelaskan. Bahkan mereka telah mendustakan kebenaran, yakni kebenaran Al-Qur'an dan kenabian nabi Muhammad, ketika kebenaran itu datang kepada mereka, maka mereka berada dalam keadaan kacau balau. Mereka sebenarnya mengetahui kebenaran, tetapi mengingkarinya. 6. Setelah Allah menyebutkan bahwa orang-orang kafir itu menganggap tidak mungkin terjadinya kebangkitan setelah mati, maka dilanjutkan pada ayat ini dengan menyebutkan dalil-dalil yang membantah perkataan mereka. Maka tidakkah mereka memperhatikan langit yang ada di atas mereka, bagaimana cara kami membangunnya, menciptakan dan meninggikannya, dan menghiasinya dengan bintang-bintang, dan tidak terdapat pada langit itu retak-retak sedikit pun yang menjadikannya cacat'."
  }
]