[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka itu lalai saat mereka mendustakan kebangkitan, lalu mereka tidak melihat kepada langit diatas mereka, bagaimana Kami membangunnya dengan pilar-pilarnya yang seimbang dan tegak kokoh, dan Kami menghiasinya dengan bintang-bintang yang tidak retak dan pecah, serta bebas dari ketidakserasian dan cacat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Apakah orang-orang yang mendustakan itu tidak memperhatikan langit yang ada di atas mereka bagaimana Kami menciptakannya, membangunnya dan menghiasinya dengan bintang-bintang yang Kami letakkan padanya, tanpa ada keretakan yang mengurangi kekuatannya? Maka Żat yang menciptakan langit ini tentu kuasa dalam membangkitkan orang-orang mati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-8. Allah mengingkari orang-orang yang tidak mempercayai kebangkitan: Tidakkah mereka melihat dengan seksama pada langit dunia yang ada di atas mereka; bagaimana Kami meninggikannya tanpa memerlukan tiang, dan Kami mengiasinya, serta kamu melihatnya tanpa ada keretakan atau kekurangan. Dan Kami menghamparkan dan meluaskan bumi, dan menciptakan padanya gunung-gunung yang kokoh agar bumi tidak berguncang, dan Kami menumbuhkan berbagai jenis tumbuhan yang sedap dipandang karena warna dan buah-buahannya yang indah? Kami menciptakan ayat-ayat kauniyah yang besar ini sebagai pelajaran dan peringatan terhadap kesempurnaan kuasa Kami bagi setiap hamba yang menghadap kepada Allah dengan penuh kecintaan, ketakutan, dan harapan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. أَفَلَمْ يَنظُرُوٓا۟ إِلَى السَّمَآءِ فَوْقَهُمْ كَيْفَ بَنَيْنٰهَا (Maka apakah mereka tidak melihat akan langit yang ada di atas mereka, bagaimana Kami meninggikannya) Yakni bagaimana Kami menciptakannya dengan sifat yang begitu menakjubkan, yang tinggi tanpa ada tiang yang menyanggahnya. وَزَيَّنّٰهَا (dan menghiasinya) Yakni Kami jadikan dengan warna yang indah dan bintang-bintang yang bersinar seperti lampu-lampu. وَمَا لَهَا مِن فُرُوجٍ(dan langit itu tidak mempunyai retak-retak sedikitpun?) Yakni tidak ada keretakan atau pecah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Saat mereka mengingkari hari kebangkitan, apa mereka tidak melihat berlangsungnya kuasa Allah melalui makhluk-makhluk langit yang sangat menakjubkan di atas mereka, Bagaimana kami membangun dan menjunjungnya tanpa tiang, menghiasinya dengan planet-planet, memberinya warna biru tua dan tidak terjadi penyimpangan di dalamnya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak memperhatikan langit yang ada di atas mereka, bagaimana Kami membangunnya dan menghiasinya tanpa ada retakan padanya} retakan dan celah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Setelah Allah menyebutkan kondisi orang-orang yang mendustakan serta mencela mereka, Allah menyerukan mereka untuk merenungkan tanda-tanda kekuasaan Allah yang ada di atas langit agar mereka bisa mengambil pelajaran dan petunjuk kepada apa yang didasarkan olehnya. Allah berfirman, “Maka apakah mereka tidak melihat kepada langit yang ada di atas mereka.” Artinya , perenungan itu tidak memerlukan usaha keras serta perjalanan berat tapi perenungan itu benar-benar mudah, sehingga mereka bisa memperhatikan, “bagaimana Kami meninggikannya,” berbentuk langit, semua sisinya lurus, kokoh bangunannya, dihiasi dengan bintang yang tetap berada di tempatnya serta meteor yang melesat dari satu ufuk ke ufuk lainnya, dibuat dengan bentuk yang paling sempurna, engkau tidak melihat adanya cacat, cela dan kerusakan padanya. Allah menjadikannya sebagai atap bagi penduduk bumi serta meletakkan di dalamnya berbagai kepentingan vital."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 6: Allah memulai menjelaskan bukti-bukti kekuasaan-Nya, dengan berkata: Tidaklah mereka orang-orang yang mendustakan hari kebangkitan melihat langit ini yang di atas mereka, memikirkannya bagaimana bisa ditinggikan dengan tanpa tiang, kemudian Kami menghiasi langit tersebut dengan bintang-bintang dan matahari yang tidak ada padanya keretakan maupun celah !? ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang-orang yang mendustakan dan celaan mereka terhadap Rasul dan Al Qur’an yang dibawanya, maka Allah mengajak mereka untuk memperhatikan ayat-ayat-Nya yang ada di ufuk langit agar mereka mengambil pelajaran dan berdalih dengannya untuk menunjukkan hakikat kebenaran. Ketika mereka mengingkari kebangkitan. Yang tidak perlu susah payah menyaksikannya, bahkan dapat melihatnya dengan mudah. Tanpa tiang. Dengan bintang-bintang. Tampak indah dilihat dan tidak tampak adanya cacat dan kekurangan. Allah Subhaanahu wa Ta'aala menjadikannya sebagai atap bagi penghuni bumi dan menyediakan di dalamnya segala kebutuhan dharuri (penting) yang dibutuhkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 6",
    "description": "Setelah Allah menyebutkan bahwa orang-orang kafir itu menganggap tidak mungkin terjadinya kebangkitan setelah mati, maka dilanjutkan pada ayat ini dengan menyebutkan dalil-dalil yang membantah perkataan mereka. Maka tidakkah mereka memperhatikan langit yang ada di atas mereka, bagaimana cara kami membangunnya, menciptakan dan meninggikannya, dan menghiasinya dengan bintang-bintang, dan tidak terdapat pada langit itu retak-retak sedikit pun yang menjadikannya cacat'7. Dan apakah mereka tidak memperhatikan bumi yang kami hamparkan dengan mantap untuk kediaman bagi manusia dan kami pancangkan di atasnya gunung-gunung yang kokoh yang berfungsi sebagai pasak bumi agar bumi tidak goyah dan kami tumbuhkan di atasnya tanam-tanaman yang indah dipandang mata'."
  }
]