[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami luaskan dan bentangkan bumi, lalu Kami jadikan gunung-gunung yang kokoh agar bumi tidak miring bersama penduduknya. Kami juga menumbuhkan diatasnya semua jenis tanaman yang indah dan bermanfaat, yang menenangkan dan membuat kagum orang yang memandangnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan bumi telah Kami hamparkan sehingga layak untuk dijadikan tempat tinggal dan telah Kami pancangkan padanya gunung-gunung yang kokoh sehingga tidak bergoncang serta telah Kami tumbuhkan padanya setiap jenis dari berbagai tumbuh-tumbuhan dan pepohonan yang indah dilihat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَالْأَرْضَ مَدَدْنٰهَا (Dan Kami hamparkan bumi itu) Yakni Kami menghamparkannya. وَأَلْقَيْنَا فِيهَا رَوٰسِىَ(dan Kami letakkan padanya gunung-gunung yang kokoh) Yakni gunung-gunung yang berdiri kokoh. وَأَنۢبَتْنَا فِيهَا مِن كُلِّ زَوْجٍۭ بَهِيجٍ(dan Kami tumbuhkan padanya segala macam tanaman yang indah dipandang mata) Yakni segala jenis tanaman yang indah yang menjadikan takjub orang yang memandangnya dengan warna yang yang indah dan bermacam-macam, serta dengan bentuk yang bagus dan aroma yang harum, dan buahnya memiliki rasa yang nikmat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dan kami hamparkan bumi sejauh pandangan manusia di sekelilingnya dan Kami letakkan padanya gunung-gunung yang kokoh. Kami juga menumbuhkan setiap jenis tanaman yang baik darinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan bumi yang Kami hamparkan} yang Kami hamparkan {serta Kami teguhkan di atasnya gunung-gunung yang kokoh} gunung-gunung yang kokoh {dan Kami tumbuhkan di atasnya berbagai jenis (tumbuhan) yang indah} berbagai jenis yang indah dipandang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Dan agar mereka memperhatikan bumi bagaimanakah Kami membentangkan serta meluaskannya hingga memungkinkan semua yang hidup untuk menempatinya serta bersiap-siap mengumpulkan seluruh kepentingannya. Allah juga mengokohkan bumi dengan gunung-gunung agar aman dari guncangan dan gelombang, “dan Kami tumbuhkan padanya segala macam tanaman yang indah dipandang mata.” Artinya, dari seluruh jenis tanaman yang membuat orang-orang yang memandangnya senang dan kagum, membuat orang yang memandang tanaman-tanaman itu senang dan untuk dimakan oleh manusia, binatang ternak mereka, serta untuk berbagai kepentingan dan kemanfaatan untuk mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 7: Begitu juga tidakkah mereka orang-orang yang mendustakan hari kebangkitan melihat bumi ini yang terhampar dan kami jadikan gunung padanya dengan kokoh, agar tidak terguncang, dan kami jadikan padanya sungai-sungai dan lautan serta kami tumbuhkan padanya beraneka ragam tumbuh-tumbuhan dan pepohonan yang menjadikan bergembira bagi orang-orang yang memandangnya?! ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Allah melapangkannya dan meluaskannya agar semua makhluk hidup dapat tinggal di atasnya dan dapat menetap serta Dia menyiapkan semua maslahatnya, dan menancapkan gunung-gunung agar tidak goncang. Yang menyenangkan orang yang melihatnya dan membuat tercengang orang yang memandangnya serta menyejukkan pandangannya. Tanaman-tanaman tersebut dapat dimakan manusia, dimakan hewan serta memberikan manfaat bagi mereka. Terlebih dengan kebun-kebun yang terdapat buah-buahan yang enak dimakan seperti anggur, delima, jeruk, apel dan buah-buahan lainnya. Adapula pohon kurma yang menjulang tinggi ke langit yang mempunyai mayang yang bersusun-susun yang di tangkainya terdapat rezeki bagi hamba, dimana mereka dapat memakannya dan menyimpannya. Belum lagi dengan apa yang Allah keluarkan dengan hujan dan yang dihasilkan dari sungai-sungai yang mengalir di permukaan bumi, dan dari biji-biji yang ada di bumi yang dapat dipanen seperti beras, gandum, jagung, dsb. Maka dengan memperhatikan semua itu terdapat pelajaran yang dengannya seseorang dapat melihat dari butanya kebodohan sekaligus sebagai pengingat terhadap hal yang bermanfaat pada agama dan dunianya, dan ia pun dapat mengingat apa yang Allah dan Rasul-Nya beritakan, namun hal itu tidak untuk semua orang, bahkan hanya untuk hamba yang kembali (tunduk Allah). Kesimpulannya, bahwa apa yang tampak di alam semesta berupa penciptaan yang besar, indah dan rapi terdapat dalil yang menunjukkan sempurnanya kekuasaan Allah, kebijaksanaan-Nya dan ilmu-Nya. Demikian pula apa yang ada di sana berupa manfaat dan maslahat bagi hamba terdapat dalil yang menunjukkan luasnya rahmat Allah dan meratanya kepemurahan-Nya. Apa yang tampak di sana berupa besarnya ciptaan Allah, rapih dan indahnya terdapat dalil yang menunjukkan bahwa Allah Ta’ala Mahaesa, Tuhan yang semuanya bergantung kepada-Nya, Dia tidak beranak dan tidak pula diperanakkan dan tidak ada seorang pun yang setara dengan Dia, dan bahwa tidak ada yang berhak diibadahi, diberikan kehinaan dan dicintai selain Allah Ta’ala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 7",
    "description": "Dan apakah mereka tidak memperhatikan bumi yang kami hamparkan dengan mantap untuk kediaman bagi manusia dan kami pancangkan di atasnya gunung-gunung yang kokoh yang berfungsi sebagai pasak bumi agar bumi tidak goyah dan kami tumbuhkan di atasnya tanam-tanaman yang indah dipandang mata'8. Itu semua kami ciptakan untuk menjadi pelajaran betapa besar kekuasaan Allah dan untuk menjadi peringatan bagi setiap hamba yang kembali kepada Allah, tunduk dan taat kepada-Nya."
  }
]