[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan langit dan bumi dan apa yang ada pada keduanya berupa tanda-tanda Kuasa Allah yang besar sebagai pelajaran untuk membebaskan dari kebutaan dan kebodohan, peringatan bagi hamba yang tunduk, takut dan sungkan kepada Allah, yang senantiasa kembali kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Kami menciptakan semua itu agar menjadi pelajaran dan peringatan bagi setiap hamba yang kembali kepada Rabbnya dengan ketaatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُّنِيبٍ (untuk menjadi pelajaran dan peringatan bagi tiap-tiap hamba yang kembali (mengingat Allah)) Dan Dzat yang mampu menciptakan hal-hal tersebut tentu juga mampu membangkitkan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kami menciptakan semua itu sebagai sarana untuk melihat dan mengingat kekuasaan kami bagi setiap hamba yang akan kembali kepada Allah SWt dengan taat. Siapa yang lebih berkuasa di atas Sang Maha Kuasa atas hari kebangkitan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sebagai pelajaran dan pengingat} pengingat {bagi setiap hamba yang kembali} yang kembali kepada Allah dengan taat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-11. Allah secara khusus menyebutkan berbagai kebun dari berbagai manfaat tersebut, kebun yang mencakup berbagai jenis buah-buahan lezat seperti anggur, delima, lemon, apel dan jenis buah-buahan lainnya, terdapat juga pohon kurma yang tinggi, yang manfaatnya untuk waktu yang panjang, tinggi menjulang ke langit hingga tingginya tidak bisa dicapai oleh berbagai pohon lain, dari mayangnya keluar buah sebagai rizki untuk para hamba sebagai makanan, lauk dan buah yang bisa dimakan dan disimpan untuk mereka dan binatang ternak mereka. Begitu juga yang dikeluarkan oleh Allah melalui hujan serta pengaruhnya yang berupa sungai yang ada di permukaan bumi yang dibawahnya terdapat “biji-biji tanaman yang diketam,” yang berupa gandum, jagung, beras, jewawut dan lainnya. Memandang dan merenungkan semua hal itu adalah, “untuk menjadi pelajaran,” yang bisa membuka mata hati orang yang diliputi kebodohan dan “peringatan,” yang dijadikan sebagai peringatan yang berguna di dunia dan akhirat, dijadikan sebagai peringatan terhadap berita yang disampaikan Allah dan RasulNya. Namun hal itu tidak berlaku bagi semua orang, ia hanya berlaku bagi, “tiap-tiap hamba yang kembali (mengingat Allah).” Menghadap kepadaNya dengan rasa cinta, takut, pengharapan serta terkabulnya doanya. Adapun orang-orang yang mendustakan atau berpaling itu, maka ayat-ayat dan berbagai peringatan tidaklah berguna bagi orang-orang yang tidak beriman. Kesimpulannya, semua penciptaan menawan, kekuatan dan kekokohan merupakan bukti kesempurnaan Kuasa Allah. Semua keindahan, kerapian, keelokan bentuk serta ciptaan merupakan bukti bahwa Allah adalah Dzat yang paling bijaksana, Dia Maha Mengetahui segala sesuatu. Semua manfaat dan kepentingan untuk para hamba merupakan bukti kasih sayang Allah yang meliputi semua makhluk hidup. Semua keagungan bentuk serta rapinya peraturan merupakan bukti bahwa Allah adalah Maha Esa, yang tidak memiliki sekutu sama sekali, Dia-lah Dzat yang semua bentuk ibadah, ketundukan, dan kecintaan hanya ditujukan padaNya. Bumi yang dihidupkan setelah sebelumnya mati dan gersang merupakan bukti bahwa Allah Kuasa menghidupkan kembali orang-orang yang sudah mati, agar Allah bisa memberikan balasan atas mereka, karena itulah Allah berfirman, “Kami hidupkan dengan air itu tanah yang mati (kering). Seperti itulah terjadinya kebangkitan (kembali nanti).” Setelah mereka diingatkan dengan berbagai tanda-tanda kekuasaan Allah yang ada di langit dan bumi, setelah ditakut-takuti dengan siksaan yang menimpa berbagai umat sebelumnya agar mereka tidak terus menerus mendustakan sehingga akan tertimpa sebagaimana yang pernah menimpa saudara-saudara mereka yang juga mendustakan, Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 8: Allah menjelaskan bahwasanya dia menciptakan apa yang tersebut ini dan setiap apa yang dilihat bagi orang-orang yang memiliki akal, dan tidak ragu bahwasanya Allah mampu menciptakan segala sesuatunya dari ketiadaan dan juga tidak ada yang melemahkannya atas urusan hari kebangkitan. Kaum musyrikin terheran-heran dan memandang hal itu jauh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang menghadap kepada-Nya dengan mencintai-Nya, takut dan berharap kepada-Nya serta memenuhi seruan-Nya. Adapun orang yang mendustakan atau berpaling, maka peringatan dan ayat-ayat tidaklah bermanfaat baginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 8",
    "description": "Itu semua kami ciptakan untuk menjadi pelajaran betapa besar kekuasaan Allah dan untuk menjadi peringatan bagi setiap hamba yang kembali kepada Allah, tunduk dan taat kepada-Nya. 9. Ayat ini masih merupakan lanjutan dari pemaparan bukti-bukti ke-kuasaan Allah. Pada ayat ini Allah menyebutkan karunia-Nya kepada makhluk-Nya, dalam firman-Nya dan dari langit kami turunkan air yang memberi berkah bagi penghuni bumi, lalu kami tumbuhkan dengan air yang tercurah itu bermacam-macam pepohonan yang rindang dan biji-bijian yang dapat dipanen, seperti gandum, jagung dan sebagainya."
  }
]