[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami juga menurunkan dari langit hujan yang banyak manfaatnya, lalu dengannya Kami menumbuhkan kebun-kebun dengan pohon-pohon yang banyak dan tanaman yang bijinya dipanen."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan Kami telah turunkan dari langit air yang banyak manfaatnya dan kebaikannya, lalu Kami tumbuhkan dengan air itu taman-taman serta Kami tumbuhkan apa yang kalian panen berupa biji gandum dan sebagainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-11. Dan Kami turunkan hujan dari awan, yang membawa banyak kebaikan dan keberkahan; kemudian dengan air hujan itu Kami tumbuhkan kebun-kebun yang subur, biji-bijian yang dapat dipanen, dan pohon-pohon kurma yang menjulang tinggi dan buahnya saling bertumpuk. Kami menumbuhkan berbagai kebaikan ini sebagai rezeki bagi para hamba, agar mereka memanfaatkannya. Dan Kami menumbuhkan dengan air yang diberkahi ini tanah yang tandus, sehingga menjadi hijau dan subur. Seperti itulah Kami akan mengeluarkan kalian dari kubur dalam keadaan hidup."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. فَأَنۢبَتْنَا بِهِۦ جَنّٰتٍ (lalu Kami tumbuhkan dengan air itu pohon-pohon) Yakni taman-taman yang banyak. وَحَبَّ الْحَصِيدِ(dan biji-biji tanaman yang diketam) Yakni biji-biji yang dipanen dan dipakai untuk makanan pokok, seperti biji gandum dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan Kami turunkan hujan yang mengandung banyak kebaikan, keberkahan dan manfaat dari awan-awan yang melayang-layang di langit. Melalui air itu, Kami tumbuhkan taman-taman yang terdiri dari banyak pepohonan dan bermacam-macam kebun yang memiliki banyak bibit tanaman seperti gandung dan jerawut yang dpat dipanen dan dipelihara."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menurunkan dari langit air yang diberkahi} mengandung banyak kebaikan dan manfaat {lalu Kami tumbuhkan dengannya kebun-kebun} kebun-kebun {dan biji-bijian yang dapat dipanen} biji-biji tanaman yang bisa dipanen"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-11. Allah secara khusus menyebutkan berbagai kebun dari berbagai manfaat tersebut, kebun yang mencakup berbagai jenis buah-buahan lezat seperti anggur, delima, lemon, apel dan jenis buah-buahan lainnya, terdapat juga pohon kurma yang tinggi, yang manfaatnya untuk waktu yang panjang, tinggi menjulang ke langit hingga tingginya tidak bisa dicapai oleh berbagai pohon lain, dari mayangnya keluar buah sebagai rizki untuk para hamba sebagai makanan, lauk dan buah yang bisa dimakan dan disimpan untuk mereka dan binatang ternak mereka. Begitu juga yang dikeluarkan oleh Allah melalui hujan serta pengaruhnya yang berupa sungai yang ada di permukaan bumi yang dibawahnya terdapat “biji-biji tanaman yang diketam,” yang berupa gandum, jagung, beras, jewawut dan lainnya. Memandang dan merenungkan semua hal itu adalah, “untuk menjadi pelajaran,” yang bisa membuka mata hati orang yang diliputi kebodohan dan “peringatan,” yang dijadikan sebagai peringatan yang berguna di dunia dan akhirat, dijadikan sebagai peringatan terhadap berita yang disampaikan Allah dan RasulNya. Namun hal itu tidak berlaku bagi semua orang, ia hanya berlaku bagi, “tiap-tiap hamba yang kembali (mengingat Allah).” Menghadap kepadaNya dengan rasa cinta, takut, pengharapan serta terkabulnya doanya. Adapun orang-orang yang mendustakan atau berpaling itu, maka ayat-ayat dan berbagai peringatan tidaklah berguna bagi orang-orang yang tidak beriman. Kesimpulannya, semua penciptaan menawan, kekuatan dan kekokohan merupakan bukti kesempurnaan Kuasa Allah. Semua keindahan, kerapian, keelokan bentuk serta ciptaan merupakan bukti bahwa Allah adalah Dzat yang paling bijaksana, Dia Maha Mengetahui segala sesuatu. Semua manfaat dan kepentingan untuk para hamba merupakan bukti kasih sayang Allah yang meliputi semua makhluk hidup. Semua keagungan bentuk serta rapinya peraturan merupakan bukti bahwa Allah adalah Maha Esa, yang tidak memiliki sekutu sama sekali, Dia-lah Dzat yang semua bentuk ibadah, ketundukan, dan kecintaan hanya ditujukan padaNya. Bumi yang dihidupkan setelah sebelumnya mati dan gersang merupakan bukti bahwa Allah Kuasa menghidupkan kembali orang-orang yang sudah mati, agar Allah bisa memberikan balasan atas mereka, karena itulah Allah berfirman, “Kami hidupkan dengan air itu tanah yang mati (kering). Seperti itulah terjadinya kebangkitan (kembali nanti).” Setelah mereka diingatkan dengan berbagai tanda-tanda kekuasaan Allah yang ada di langit dan bumi, setelah ditakut-takuti dengan siksaan yang menimpa berbagai umat sebelumnya agar mereka tidak terus menerus mendustakan sehingga akan tertimpa sebagaimana yang pernah menimpa saudara-saudara mereka yang juga mendustakan, Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Qaf ayat 9: Allah mengulang dalam menjelaskan bukti-bukti kekuasaannya, Allah mengabarkan bahwasanya dia menurunkan dari langit hujan yang banyak penuh berkah, yang baik dan bermanfaat, kemudian Allah menumbuhkan dengan hujan ini kebun-kebun yang banyak yang di dalamnya terdapat banyak pepohonan, diantaranya yang dipanen dari gandum, dari jagung, dari biji-bijian dan selainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Qaf Ayat 9",
    "description": "Ayat ini masih merupakan lanjutan dari pemaparan bukti-bukti ke-kuasaan Allah. Pada ayat ini Allah menyebutkan karunia-Nya kepada makhluk-Nya, dalam firman-Nya dan dari langit kami turunkan air yang memberi berkah bagi penghuni bumi, lalu kami tumbuhkan dengan air yang tercurah itu bermacam-macam pepohonan yang rindang dan biji-bijian yang dapat dipanen, seperti gandum, jagung dan sebagainya. 10. Dan kami tumbuhkan pula pohon kurma yang tinggi-tinggi yang mempunyai mayang yang bersusun-susun karena banyak sekali buahnya."
  }
]