[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Azab besar bagi orang orang yang curang dalam takaran dan timbangannya, Yaitu orang orang yang bila mereka membeli dari manusia dengan takaran atau timbangan,mereka menakar dan menimbang secara penuh, Tetapi manakala mereka menimbang dan menakar untuk manusia,mereka mengurangi timbangan dan takaran. Bagaimana keadaan orang yang mencuri dan mengambil barang barang yang ditakar dan ditimbang,serta mengurangi hak-hak manusia? dia lebih patut diancam daripada orang orang yang mengurangi takaran dan timbangan. Apakah orang-orang yang berbuat curang itu tidak yakin bahwa Allah akan membangkitkan mereka dan menghisab amal perbuatan mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Kehancuran dan kerugian bagi orang-orang yang curang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Allah memperingatkan manusia dari berbuat curang dalam menunaikan hak orang lain dalam timbangan dan takaran, dan mengancam mereka dengan siksaan dan kebinasaan bagi orang-orang yang mengurangi hak orang lain, jika mereka mengambil barang yang ditimbang atau ditakar dari orang lain maka mereka akan meminta agar mendapat timbangan dan takaran yang sempurna; namun ketika mereka menimbang atau menakar untuk orang lain maka mereka akan mengurangi hak orang tersebut; atau bahkan mereka minta untuk mendapat lebih dari yang seharusnya mereka dapatkan dari orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَيْلٌ لِّلْمُطَفِّفِينَ (Kecelakaan besarlah bagi orang-orang yang curang) Makna (المطفف) yakni orang yang mengurangi timbangan atau takaran meski hanya sedikit saja. Dan terkadang salah satu dari mereka memiliki dua takaran, satu untuk menakar bagi orang lain dan satu takaran lagi untuk menakar bagi dirinya sendiri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1) . Salman al- Farisi berkata: “Sholat adalah takaran, barangsiapa menyempurnakanya, maka dia akan disempurnakan, dan barangsiapa berlaku curang, maka kalian telah mengetahui apa yang (Allah) firmankan mengenai orang-orang yang berlaku curang”, dan inilah salah satu kehebatan ilmu para salaf (orang terdahulu) dalam memaknai ayat-ayat Al-Qur'an, dalam hal ini Salman Al-Farisi menjadikan makna ancaman yang ada dalam surah ini untuk siapapun yang berlaku curang walaupun bukan dalam persoalan jual beli. 2) . Ayat ini : { وَيْلٌ لِلْمُطَفِّفِينَ } diturunkan atas perlakuan orang-orang yang berbuat curang pada timbangan dan takaran dalam jual beli, akan tetapi makna yang terkandung didalamnya juga berlaku bagi siapa saja yang berbuat curang diluar perkara tersebut, sebagai contoh : sesorang memiliki tanggung jawab dalam suatu kepentingan dia memberikan kemudahan kepada pihak tertentu dan tidak memberikannya pada pihak lain, atau dia mementingan keperluan dirinya saja tanpa memikirkan nasib orang lain, atau sesorang tidak memuji satu pihak tertentu seperti yang disampaikan kepada pihak lainnya yang pada hakikatnya mereka adalah satu kepentingan, dan contoh diatas menyalahi tujuan dari diturunkannya Al-Qur'an, Allah berfirman : { اللَّهُ الَّذِي أَنْزَلَ الْكِتَابَ بِالْحَقِّ وَالْمِيزَانَ } ( Allah-lah yang menurunkan kitab dengan (membawa) kebenaran dan (menurunkan) neraca (keadilan) ) [ Asy Syura : 17 ] . Maka perlu diketahui bahwa dengan Al-Qur'an segala sesuatu menjadi seimbang, dan menjadi perumpamaan sesuatu yang sebelumnya belum disebutkan perumpamaannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Kerusakan dan siksa bagi orang-orang yang mengurangi timbangan meskipun sedikit. Baik mengurangi takaran atau timbangan, juga atau menambahnya. Diriwayatkan dari An-nasai dan Ibnu Majah dengan sanad yang sahih dari Ibnu Abbas, berkata: “Ketika Nabi SAW masuk Madinah, diketahui bahwa penduduknya terkenal akan timbangannya yang paling kecil. Maka Allah menurunkan ayat: “Kecelakaanlah bagi orang-orang yang mengurangi timbangan.” Maka setelah itu semua timbangan diperbaiki sesuai takaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah} celaka dan merugilah {orang-orang yang curang} orang-orang yang mengurangi takaran dan timbangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Madaniyah Ayat 1-6 “Kecelakaan besarlah,” adalah kata-kata azab dan siksaan, “bagi orang-orang yang curang.” Ini dijelaskan oleh Allah dengan FirmanNya kemudian, “(Yaitu) orang-orang yang apabila menerima takaran dari orang lain,” yakni mengambil dari mereka sebagai timbal balik, mereka menginginkannya secara utuh, tidak kurang, “dan apabila mereka menakar atau menimbang untuk orang lain,” yakni bila memberikan hak orang lain yang harus ditunaikan dengan takaran atau timbangan, “mereka mengurangi,” yakni menguranginya dengan cara mengurangi takaran atau dengan cara lainnya. Ini adalah pencurian harta orang lain dan tidak bersikap adil terhadap mereka. Karena ancaman ini ditunjukkan pada orang yang mengurangi takaran dan timbangan orang lain, maka orang yang mengambil harta orang lain secara paksa atau dengan cara mencuri, tentu lebih berhak mendapatkan ancaman ini dari orang-orang yang sekedar berbuat curang. Ayat mulia ini menunjukkan bahwa orang sebagaimana berhak mendapatkan haknya dari orang lain, ia juga harus memberikan semua milik orang lain secara penuh, baik berupa harta maupun yang lain. Bahkan hujjah dan pernyataan juga termasuk dalam keumuman ayat ini. Biasanya, masing-masing dari dua orang yang berdebat berusaha mempertahankan hujjahnya, ia juga berkewajiban menjelaskan hujjah rivalnya yang tidak ia ketahui dan mempertimbangkan argumen-argumen rivalnya sebagaimana ia juga harus mempertimbangkan argumen-argumennya sendiri. Di sini dapat diketahui sikap obyektif atau fanatisme seseorang, kerendahan hati atau kesombongan, berakal atau bodoh. Semoga Allah berkenan menolong kita pada setiap kebaikan. Selanjutnya Allah mengancam orang-orang yang berbuat curang serta merasa bangga atas kondisi mereka serta tetapnya mereka berada di atas kecurangan seraya berfirman, “Tidaklah orang-orang itu yakin, bahwa sesungguhnya mereka akan dibangkitkan, pada suatu hari yang besar, (yaitu) hari (ketika) manusia berdiri menghadap Rabb semesta alam?” yang mendorong mereka untuk berbuat curang adalah tidak beriman pada Hari Akhir, sebab bila mereka beriman pada Hari Akhir dan mereka mengetahui akan berdiri di hadapan Allah yang akan menghisab mereka atas amalan kecil dan besar, niscaya mereka menjauhkan diri mereka dari kecurangan dan bertaubat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kata { وَيل } bisa bermakna : kata yang bermakna celaka atau buruk, juga bisa bermakna : suatu lembah yang ada didalam neraka jahannam, Allah berfirman : { وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ } ( Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan. ) [ Al-Mursalat : 15 ] Celakalah pada hari kiamat mereka yang { لِلْمُطَفِّفِينَ } yang curang dalam timbangannya ketika didunia, dan kata { الْمُطَفِّفِينَ } berasal dari kata ( التطفيف ) yang berarti : mengurangi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَيْلٌ [wail] Adalah kata yang sering terulang dalam al-Quran, kalimat ini menurut pendapat yang benar adalah untuk mengingkapkan ancaman. Dengan kata Allah subhaanahu wa Ta’ala mengancam siapa saja yang menyelisihi perintah-Nya atau melakukan larangan-Nya yang disesuaikan dengan kalimat yang datang setelah kata ini. Pada ayat ini Allah ‘Azza Wa Jalla berfirman: وَيْلٌ لِلْمُطَفِّفِينَ “bagi orang-orang yang curang,” Siapakah orang-orang yang curang yang disebutkan ayat ini? Orang-orang yang curang di sini dijelaskan oleh ayat-ayat setelahnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 1: 1-3. Surat ini dimulai dengan pengertian yang berkenaan dengan manusia (yang) curang dalam timbangan, Allah berkata : Celaka dan adzablah yang akan didapat pada hari kiamat bagi siapa yang berlaku curang dalam takaran dan timbangan, yang mereka licik dalam memebrikan hak-hak manusia. Kemudian Allah jelaskan keadaan orang-orang yang curang dalam timbangan, yaitu ketika mereka membeli sesuatu dari manusia, mereka meminta takaran atau timbangannya agar tepat (pas) dan sempurna. Dan jika mereka menakar atau menimbang untuk orang lain, mereka akan kurangi takran dan timbangannya. Semua ini bukanlah ciri manusia yang inshaf dan adil; Jika engkau ingin agar hakmu dipenuhi secara sempurna, maka wajib pula memenuhi hak-hak manusia secara sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Majah berkata: Telah menceritakan kepada kami Abdurrahman bin Bisyr bin Al Hakam dan Muhammad bin ‘Uqail bin Khuwailid, keduanya berkata: Telah menceritakan kepada kami Ali bin Al Husain bin Waqid, (ia berkata): telah menceritakan kepadaku bapakku Yazid An Nahwiy, bahwa ‘Ikrimah menceritakan kepadanya dari Ibnu Abbas ia berkata: Ketika Nabi shallallahu 'alaihi wa sallam tiba di Madinah, mereka (penduduk Madinah) adalah manusia yang paling buruk dalam menakar, maka Allah Subhaanahu wa Ta'aala menurunkan firman-Nya, “Celakalah bagi orang-orang yang curang (dalam menakar dan menimbang).” Maka setelah itu, mereka memperbaiki takarannya. (Hadits ini diriwayatkan pula oleh Nasa’i sebagaimana dikatakan Al Haafizh Ibnu Katsir juz 4 hal. 483 dari jalan Muhammad bin ‘Uqail. Para perawinya adalah tsiqah kecuali Ali bin Al Husain bin Waqid, maka padanya terdapat pembicaraan. Ibnu Hibban juga meriwayatkan di halaman 438 di Mawaariduzh Zham’aan, demikian pula Ibnu Jarir di juz 29 hal. 91, di sana terdapat mutaba’ah (penguat dari jalan yang sama) bagi Ali bin Al Husain bin Waqid, ia telah dimutabaahkan oleh Yahya bin Wadhih, dimana ia adalah seorang hafizh dan termasuk para perawi jamaah, akan tetapi Syaikhnya Ibnu Jarir yaitu Muhammad bin Humaid Ar Raaziy terdapat pembicaraan. Hakim di juz 2 hal. 23 juga meriwayatkan dan ia berkata, “Shahih isnadnya.” Dan didiamkan oleh Adz Dzahabiy. Dalam Mustadrak Hakim disebutkan mutaba’ah Ali bin Al Husain bin Syaqiq yang termasuk perawi jamaah sebagaimana dalam Tahdzibut Tahdzib, akan tetapi pada jalan kepadanya terdapat Muhammad bin Musa bin Hatim Al Qaasyaaniy, yang muridnya berkata, “Ia di sini adalah Al Qaasim bin Al Qaasim As Sayyaariy yang aku lepas tangan darinya.” Ibnu Abi Sa’dan berkata, “Muhammad bin ‘Ali Al Haafizh berpandangan buruk terhadapnya.” Demikian yang disebutkan dalam Lisaanul Miizaan. Syaikh Muqbil berkata, “Tetapi keseluruhan mutabaah ini menunjukkan bahwa hadits tersebut tsabit (sah), wallahu a’lam.” (lihat Ash Shahihul Musnad hal. 266), Syaikh Al Albani dalam Shahih Ibnu Majah (2223) menghasankan hadits tersebut.) Kata “Wail” artinya ucapan azab dan ancaman atau sebuah lembah di neraka Jahannam, seperti yang diterangkan oleh penyusun tafsir Al Jalaalain. Ada pula yang menafsirkan, bahwa kata “wail” artinya kebinasaan dan kehancuran.Apabila ancaman keras ini ditujukan kepada orang-orang yang mengurangi harta orang lain dalam hal takaran dan timbangan, dimana di dalamnya terdapat pengambilan harta orang lain secara tersembunyi, maka orang yang mengambil harta orang lain secara terang-terangan atau secara paksa dan atau mencuri harta mereka, tentu lebih berhak mendapatkan ancaman yang keras ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 1",
    "description": "Pada permulaan surah ini Allah memberi peringatan keras kepada mereka yang berbuat curang dalam timbangan dan takaran. Celakalah bagi orang-orang yang berbuat curang dalam menimbang dan menakar sehingga merugikan banyak orang!2-3. Mereka yang berbuat curang itu adalah orang-orang yang apabila menerima takaran atau timbangan dari orang lain, mereka minta takaran itu dicukupkan dan dipenuhi sehingga tidak berkurang sedikit pun, dan apabila mereka menakar sesuatu dengan alat takar, seperti beras, gandum, atau lainnya, atau menimbang suatu barang seperti emas, perak, atau lainnya untuk orang lain, mereka mengurangi takaran atau timbangannya secara sengaja dengan cara licik agar tidak diketahui oleh pembeli. Hal ini sangat merugikan orang lain, dan harta yang diperoleh dari upaya ini hukumnya haram, tidak berkah, dan mengantar pelakunya ke neraka."
  }
]