[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-17. Azab besar pada hari itu bagi orang orang yang mendustakan. Yaitu orang orang yang mendustakan hari pembalasan. Tidak ada yg mendustakannya kecuali orang yang dzhalim dan banyak berbuat dosa. Apabila ayat-ayat al-qur’an dibacakan kepadanya, dia berkata,”ini adalah kebatilan-kebatilan orang orang dulu.” Perkaranya tidak sebagaimana yang mereka tuduhkan, sebaliknya al-qur’an adalah firman Allah dan wahyu NYA kepada nabi NYA. Yang membuat hati mereka terhalang untuk membenarkan adalah apa yang menutupinya akibat banyaknya dosa dosa yang mereka lakukan. Perkaranya tidak sebagaimana yang diucapkan oleh orang orang kafir, sebaliknya pada hari kiamat,mereka terhalang sehingga tidak bisa melihat tuhan mereka di surga. Kemudian orang-orang kafir itu masuk kedalam api neraka,mereka merasakan panasnya, Kemudian kepada mereka dikatakan, “ini adalah balasan yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Kehancuran dan kerugian pada hari itu bagi orang-orang yang mendustakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-17. Allah mengancam orang-orang yang mendustakan hari perhitungan dengan ancaman kebinasaan dan siksaan. Tidaklah ada orang yang terjerumus dalam pendustaan ini melainkan orang yang telah melanggar hak Allah dan hak orang lain, sangat sering melakukan dosa-dosa, dan jika dibacakan kepadanya ayat-ayat al-Qur’an maka dia akan berkata, ‘Itu hanyalah dongeng-dongeng dari orang-orang terdahulu’. Sungguh kenyataannya tidak seperti yang mereka kira, namun hati mereka memang telah tertutup oleh dosa-dosa yang telah mereka lakukan. Sungguh orang-orang yang mendustakan itu tidak akan mendapat rahmat Allah pada hari kiamat, kemudian mereka akan memasuki neraka dan merasakan panas kobarannya, lalu para malaikat yang bertugas mengazab mereka akan berkata, ‘Inilah azab yang dahulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kecelakaan dan siksaan pada hari kiamat bagi para pendusta kebenaran Al-quran dan hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Celakalah pada hari itu bagi para pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 10-13 “Kecelekaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.” selanjutnya Allah menjelaskan siapakah mereka dengan FirmanNya, “(yaitu) orang-orang yang mendustajkan Hari Pembalasan,” yakni hari pembalasan amal dan perbuatan. Di hari itu Allah akan membalas amal perbuatan mereka. “Dan tidak ada yang mendustakan Hari Pembalasan itu melainkan setiap orang yang melampaui batas,” atas larangan-larangan Allah, melampaui batas dari halal hingga haram, “lagi berdosa” yakni banyak dosanya. Sikap permusuhan inilah yang mendorongnya untuk mendustakan, dan kesombongannya membuatnya menolak kebenaran. Karena itu “apabila dibacakan kepadanya ayat-ayat Kami,” yang menunjukkan pada kebenaran dan atas kebenaran risalah yang dibawa oleh para rasul, ia mendustakan dan menentangnya seraya berkata, “Itu adalah dongengan orang-orang yang dahulu,” yakni hanya berasal daari cerita orang-orang terdahulu dan berita umat-umat yang sudah berlalu, bukan berasal dari Allah; semua itu karena didorong rasa sombong dan menentang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kecelakaan dan azab yang pedih bagi orang-orang mendustakan agama, azab bagi mereka yang mendustakan Rasul dan kitab yang diturunkan kepadanya, juga bagi mereka yang mengingkari adanya hari kiamat, mengingkari hari perhitungan amalan, azab bagi mereka yang mengingkari hari pembalasan,. { وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ } Sungguh banyak diantara manusia yang mengingkari hari kebangkitan itu, mereka mengingkarinya dengan tujuan ingin menjauh dan menghindar dari kengerian hari kiamat, dan mereka pun mendustakan Nabi Muhammad ﷺ , mereka mengatakan : kitab ini hanyalah dongeng umat terdahulu, ini hanyalah sebuah hayalan, bahkan umat-umat terdahulu pun mengingkari wahyu yang Allah wahyukan kepada RAsul-rasul Nya, dan apa yang mereka katakan sama seperti yang dikatakan oleh kaum musyrikin zaman sekarang, juga yang dikatakan oleh seorang ilmuan Thaha husain dalam bukunya yang dengannya dia memperoleh gelar doktor di perancis : sesungguhnya apa yang terkandung dalam Al-Qur'an ini hanyalah hayalan yang sangat berlebihan dan pada hakikatnya Al-Qur'an ini tidak ada kebenaran didalamnya, dia juga menyebut bahwa AL-Qur'an ini tidak lain kecuali hanya sebuah rangkuman syair-syair kaum jahiliyah, akan tetapi ulama-ulama telah membantah perkataan tersebut dan telah dituliskan dalam beberapa buku."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,” وَيل [Wail] Penjelasan tentang kata ini telah dipaparkan di awal surat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 10: 10-12. Allah mengabarkan (keadaan) orang-orang yang mendustakan dengan berkata : Celaka dan binasalah kalian di hari kiamat wahai para pendusta ! Yaitu mereka yang mendustakan hari perhitungan dan pembalasan. Dan ketahuilah oleh kalian, bahwa Allah tidaklah mengadzab pada hari perhitungan dan pembalasan kecuali bagi siapa yang melewati (menghalalkan) batasan-batasan yang telah Dia tetapkan, yaitu dari kekufuran dan kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 10",
    "description": "Celakalah pada hari itu bagi orang-orang yang mendustakan hari kebangkitan, sebagaimana mereka yang berbuat curang dalam menimbang dan menakar. 11. Merekalah orang-orang yang mendustakan hari pembalasan. Keingkaran pada hari kiamat membuat seseorang tega melakukan apa pun karena tidak ada rasa takut pada dirinya terhadap akibat perbuatannya yang merugikan orang lain."
  }
]