[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-17. Azab besar pada hari itu bagi orang orang yang mendustakan. Yaitu orang orang yang mendustakan hari pembalasan. Tidak ada yg mendustakannya kecuali orang yang dzhalim dan banyak berbuat dosa. Apabila ayat-ayat al-qur’an dibacakan kepadanya, dia berkata,”ini adalah kebatilan-kebatilan orang orang dulu.” Perkaranya tidak sebagaimana yang mereka tuduhkan, sebaliknya al-qur’an adalah firman Allah dan wahyu NYA kepada nabi NYA. Yang membuat hati mereka terhalang untuk membenarkan adalah apa yang menutupinya akibat banyaknya dosa dosa yang mereka lakukan. Perkaranya tidak sebagaimana yang diucapkan oleh orang orang kafir, sebaliknya pada hari kiamat,mereka terhalang sehingga tidak bisa melihat tuhan mereka di surga. Kemudian orang-orang kafir itu masuk kedalam api neraka,mereka merasakan panasnya, Kemudian kepada mereka dikatakan, “ini adalah balasan yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Yaitu yang mendustakan adanya hari Pembalasan, pada hari itu Allah membalas hamba-hamba atas amal perbuatan mereka di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Yaitu orang yang mendustakan kebenaran hari penghitungan dan pembalasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yaitu orang-orang yang mendustakan hari pembalasan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 10-13 “Kecelekaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.” selanjutnya Allah menjelaskan siapakah mereka dengan FirmanNya, “(yaitu) orang-orang yang mendustajkan Hari Pembalasan,” yakni hari pembalasan amal dan perbuatan. Di hari itu Allah akan membalas amal perbuatan mereka. “Dan tidak ada yang mendustakan Hari Pembalasan itu melainkan setiap orang yang melampaui batas,” atas larangan-larangan Allah, melampaui batas dari halal hingga haram, “lagi berdosa” yakni banyak dosanya. Sikap permusuhan inilah yang mendorongnya untuk mendustakan, dan kesombongannya membuatnya menolak kebenaran. Karena itu “apabila dibacakan kepadanya ayat-ayat Kami,” yang menunjukkan pada kebenaran dan atas kebenaran risalah yang dibawa oleh para rasul, ia mendustakan dan menentangnya seraya berkata, “Itu adalah dongengan orang-orang yang dahulu,” yakni hanya berasal daari cerita orang-orang terdahulu dan berita umat-umat yang sudah berlalu, bukan berasal dari Allah; semua itu karena didorong rasa sombong dan menentang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ الَّذِينَ يُكَذِّبُونَ } Yaitu orang-orang yang mendustakan { بِيَوْمِ الدِّينِ } hari pembalasan, mereka mendustakan hari yang ketika itu semua manusia berdiri menghadap Tuhan semesta alam, tapi orang-orang kafir dan musyrikin mendustakan dan mengingkari peristiwa itu, ereka mengatakan bahwa AL-Qur'an ini hanyalah dongeng umat terdahulu. sebagiman yang Allah katakan : { إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ } ( Yang apabila dibacakan kepadanya ayat-ayat Kami, ia berkata: “Itu adalah dongengan orang-orang yang dahulu” ) [ Al-Muthaffifin : 13 ]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ “(yaitu) orang-orang yang mendustakan hari pembalasan.” Maknanya: Mendustakan hari pembalasan, yaitu hari kiamat. Orang-orang yang mendustakan hari pembalasan diancam Allah dengan kecelakaan, karena orang-orang yang mendustakan hari pembalasan tidak mungkin lurus di atas syari’at Allah. Tidak ada yang istiqomah di atas syari’at Allah melainkan orang-orang yang beriman meyakini akan hari pembalasan. Kerena orang yang tidak mengimaninya, ia hanya beriman kepada kehidupan semata, ia tidak akan meperhatikan apa yang akan terjadi setelahnya, dan tidak akan berbuat untuk nanti. Ia bak binatang-binatang ternak, menikmati dan makan-makan bak binatang-binatang ternak, sedangkan neraka adalah tempat kembali mereka. Allah senantiasa menyandingkan keimanan kepada-Nya dengan keimanan kepada hari akhir, karena keimanan kepada Allah adalah permulaannya dan keimamanan kepada hari akhir adalah iringannya, maka anda beriman kepada Allah kemudian anda beramal untuk hari akhir yang di mana itu adalah tempat menetap. Mereka itu wal-‘iyaadzu billah mendustakan hari pembalasan, dan siapa saja yang tidak beriman kepadanya maka tidak mungkin beramal demi hari itu kapan pun, karena amalan dibangun di atas akidah keyakinan, jika tidak memiliki akidah maka tidak akan ada amalan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 11: 10-12. Allah mengabarkan (keadaan) orang-orang yang mendustakan dengan berkata : Celaka dan binasalah kalian di hari kiamat wahai para pendusta ! Yaitu mereka yang mendustakan hari perhitungan dan pembalasan. Dan ketahuilah oleh kalian, bahwa Allah tidaklah mengadzab pada hari perhitungan dan pembalasan kecuali bagi siapa yang melewati (menghalalkan) batasan-batasan yang telah Dia tetapkan, yaitu dari kekufuran dan kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni hari yang di sana Allah membalas amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 11",
    "description": "Merekalah orang-orang yang mendustakan hari pembalasan. Keingkaran pada hari kiamat membuat seseorang tega melakukan apa pun karena tidak ada rasa takut pada dirinya terhadap akibat perbuatannya yang merugikan orang lain. 12. Dan tidak ada yang mendustakannya, yakni hari pembalasan itu, melainkan setiap orang yang melampaui batas dalam aturan agama dan berdosa akibat melakukan perbuatan mungkar dan maksiat."
  }
]