[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-17. Azab besar pada hari itu bagi orang orang yang mendustakan. Yaitu orang orang yang mendustakan hari pembalasan. Tidak ada yg mendustakannya kecuali orang yang dzhalim dan banyak berbuat dosa. Apabila ayat-ayat al-qur’an dibacakan kepadanya, dia berkata,”ini adalah kebatilan-kebatilan orang orang dulu.” Perkaranya tidak sebagaimana yang mereka tuduhkan, sebaliknya al-qur’an adalah firman Allah dan wahyu NYA kepada nabi NYA. Yang membuat hati mereka terhalang untuk membenarkan adalah apa yang menutupinya akibat banyaknya dosa dosa yang mereka lakukan. Perkaranya tidak sebagaimana yang diucapkan oleh orang orang kafir, sebaliknya pada hari kiamat,mereka terhalang sehingga tidak bisa melihat tuhan mereka di surga. Kemudian orang-orang kafir itu masuk kedalam api neraka,mereka merasakan panasnya, Kemudian kepada mereka dikatakan, “ini adalah balasan yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Jika dibacakan kepadanya ayat-ayat Kami yang diturunkan kepada Rasul Kami, ia berkata, “Ini adalah cerita-cerita umat yang terdahulu, bukan dari sisi Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. إِذَا تُتْلَىٰ عَلَيْهِ ءَايٰتُنَا (yang apabila dibacakan kepadanya ayat-ayat Kami) Yang diturunkan kepada Muhammad. قَالَ أَسٰطِيرُ الْأَوَّلِينَ(ia berkata: “Itu adalah dongengan orang-orang yang dahulu”) Yakni dongeng dan kedustaan mereka yang mereka tulis dalam kitab mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Apabila mereka dibacakan ayat Alquran, mereka menyahuti: \"Ini hanyalah dongeng, kebohongan dan isapan jempol dari orang-orang terdahulu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila dibacakan kepadanya ayat-ayat Kami, dia berkata,“dongeng orang-orang dahulu.”} cerita sia-sia orang-oranv terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 10-13 “Kecelekaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.” selanjutnya Allah menjelaskan siapakah mereka dengan FirmanNya, “(yaitu) orang-orang yang mendustajkan Hari Pembalasan,” yakni hari pembalasan amal dan perbuatan. Di hari itu Allah akan membalas amal perbuatan mereka. “Dan tidak ada yang mendustakan Hari Pembalasan itu melainkan setiap orang yang melampaui batas,” atas larangan-larangan Allah, melampaui batas dari halal hingga haram, “lagi berdosa” yakni banyak dosanya. Sikap permusuhan inilah yang mendorongnya untuk mendustakan, dan kesombongannya membuatnya menolak kebenaran. Karena itu “apabila dibacakan kepadanya ayat-ayat Kami,” yang menunjukkan pada kebenaran dan atas kebenaran risalah yang dibawa oleh para rasul, ia mendustakan dan menentangnya seraya berkata, “Itu adalah dongengan orang-orang yang dahulu,” yakni hanya berasal daari cerita orang-orang terdahulu dan berita umat-umat yang sudah berlalu, bukan berasal dari Allah; semua itu karena didorong rasa sombong dan menentang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Jika dibacakan kepada mereka ayat-ayat Al-Qur'an dan wahyu yang diturunkan kepada Rasul-rasul Allah ﷻ yang disebutkan didalamnya tentang kebangkitan, hari perhitungan, dan hari pembalasan, mereka mengatakan bahwa ayat-ayat Al-Qur'an itu tidak ada kebenaran didalamnya, mereka menyamakan Al-Qur'a dengan buku dongeng yang ada sekarang ini, mereka menganggap ayat-ayat AL-Qur'an adalah kumpulan syair, buku sejarah, novel, dan sebagainya. Begitulah sikap orang-orag kafir terhadap ayat-ayat Allah, mereka mengatakan Al-Qur'an ini bukan dari perkataan Allah, mereka menuduh Rasulullah ﷺ telah berbohong kepada ummatnya demi kepentingan dirinya, dan menurut pemahaman kelompok \"jahmiyah\" dan \"mu'tazilah\" bahwasanya Allah itu tidak berbicara, sehingga mereka menyebut Al_Qur'an ini perkataan Jibril atau perkataan Muhammad, mereka menyamakan Allah dengan berhala yang tidak mampu berbicara, oleh karena itu ketika Nabi Ibrahim berkata kepada bapaknya : { إِذْ قَالَ لِأَبِيهِ يَا أَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِي عَنْكَ شَيْئًا } ( Ingatlah ketika ia berkata kepada bapaknya; “Wahai bapakku, mengapa kamu menyembah sesuatu yang tidak mendengar, tidak melihat dan tidak dapat menolong kamu sedikitpun? ) [ Maryam : 42 ], mereka menyamakan Allah dengan berhala yang tidak dapat melihat, tidak dapat mendengar, tidak dapat berbicara, dan itulah yang disembah oleh orang-orang musyrik, kemudian ketika para menyembah berhala itu berkata kepada Ibrahim : siapakah yang menghancurkan patung-patung ini ? lalu Ibrahim menjawab : { قَالَ بَلْ فَعَلَهُ كَبِيرُهُمْ هَٰذَا فَاسْأَلُوهُمْ إِنْ كَانُوا يَنْطِقُونَ } ( Ibrahim menjawab: “Sebenarnya patung yang besar itulah yang melakukannya, maka tanyakanlah kepada berhala itu, jika mereka dapat berbicara”. ) [ Al-Anbiya' :63 ] , akan tetapi mereka tidak dapat membuktikan kemampuan berhala-berhala itu dan inilah bukti bahwa Allah ﷻ berbicara, { ثُمَّ نُكِسُوا عَلَىٰ رُءُوسِهِمْ لَقَدْ عَلِمْتَ مَا هَٰؤُلَاءِ يَنْطِقُونَ , قَالَ أَفَتَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُكُمْ شَيْئًا وَلَا يَضُرُّكُمْ } ( Kemudian kepala mereka jadi tertunduk (lalu berkata): “Sesungguhnya kamu (hai Ibrahim) telah mengetahui bahwa berhala-berhala itu tidak dapat berbicara” , Ibrahim berkata: Maka mengapakah kamu menyembah selain Allah sesuatu yang tidak dapat memberi manfaat sedikitpun dan tidak (pula) memberi mudharat kepada kamu?” ) [ Al-Anbiya' : 65-67 ] . Juga ketika bani israil menjadikan anak lembu yang dibuat oleh samiri dari emas sebagai sembahan, Samiri mengatakan kepada mereka : { هَٰذَا إِلَٰهُكُمْ وَإِلَٰهُ مُوسَىٰ } ( Inilah Tuhanmu dan Tuhan Musa ) [ Thaha : 88 ] , maka mereka pun menjadikan anak lembu itu sebagai sesembahan dan mempercayai apa ayng dikatakan oleh Samiri, lalu Allah kemudian berkata : { أَفَلَا يَرَوْنَ أَلَّا يَرْجِعُ إِلَيْهِمْ قَوْلًا وَلَا يَمْلِكُ لَهُمْ ضَرًّا وَلَا نَفْعًا } ( Maka apakah mereka tidak memperhatikan bahwa patung anak lembu itu tidak dapat memberi jawaban kepada mereka, dan tidak dapat memberi kemudharatan kepada mereka dan tidak (pula) kemanfaatan? ) [ Thaha : 89 ], Allah juga mengatakan : { أَلَمْ يَرَوْا أَنَّهُ لَا يُكَلِّمُهُمْ وَلَا يَهْدِيهِمْ سَبِيلًا ۘ اتَّخَذُوهُ وَكَانُوا ظَالِمِينَ } ( Apakah mereka tidak mengetahui bahwa anak lembu itu tidak dapat berbicara dengan mereka dan tidak dapat (pula) menunjukkan jalan kepada mereka? Mereka menjadikannya (sebagai sembahan) dan mereka adalah orang-orang yang zalim. ) [ Al-A'raf : 148 ]. { أَسَاطِيرُ } Yaitu kata jamak dari \"أُسْطُورَةٌ\" adalah dongen atau mitos bohongan yang tertulis dalam naskah khusus, orang-orang musyrikin dan kafir tidak membedakan antara AL-Qur'an dan dongeng, atau cerita seribu satu malam, itulah kebodohan dan kesesatan mereka. { قَالَ أَسَاطِيرُ الْأَوَّلِينَ } Mereka mengangggap bahwa AL-Qur'an ini tidak penting bagi kehidupan manusia, karena tidak ada kebenaran yang terkandung didalamnnya, sungguh kesesatan yang menyelimuti diri mereka. Walaupun sebagian dari mereka ada yang percaya dengan Al-Qur'an, akan tapi mereka mengartikan dan memahami kandunganya sesuka mereka, dan tidak menempatkannya pada arti atau makna yang sebenarnya, mereka mengatakan tentang isi kandungan Al-Qur'an sesuai hawa mereka, jika mendapati ayat-ayat yang tidak sesuai dengan kesenangan dan hawa nafsu mereka maka mereka lebih mendahului hawa nafsu dalam mengartikan ayat-ayat tersebut, dan seperti itulah kebodohan dan kejahiliyaan orang-orang yang berfaham liberal."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذَا تُتْلَى عَلَيْهِ آيَاتُنَا “apabila dibacakan kepadanya ayat-ayat Kami, ia berkata: \"Itu adalah dongengan orang-orang yang dahulu” Yakni: jika ada seseorang yang membacakan ayat-ayat tersebut kepadanya. Ini menunjukkan bahwa orang ini tidak berfikir untuk mau membaca ayat-ayat Allah, namun ayat-ayat tersebut dibacakan kepadanya. Jika dibacakan kepadanya maka قَالَ أَسَاطِيرُ الْأَوَّلِينَ Ini adalah asaathirul awwaliin. Asaathiir adalah bentuk jama Usthuurah. Yaitu cerita fiktif belaka yang diungkapkan untuk hiburan, tidak memiliki hakikat kebenaran, tidak ada sumbernya, ia mengatakan: Al-Quran ini adalah dongeng-dongeng orang dahulu, al-Quran tidak bermanfaat baginya padahal ia adalah pembicaraan yang tertinggi, dan yang paling berberbekas ke hati, sehingga Allah Ta’ala berfirman: إِنَّ فِي ذَلِكَ لَذِكْرَى لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ “Sesungguhnya pada yang demikian itu benar-benar terdapat peringatan bagi orang-orang yang mempunyai hati atau yang menggunakan pendengarannya, sedang dia menyaksikannya.”(QS. Qaf: 37) Karena ia telah mendustakan hari pembalasan, dan tidak ada yang mendustakannya melainkan orang yang melampaui batas lagi pendosa, maka ia bukan orang beriman, sehingga cahaya ayat-ayat Allah ‘Azza Wa Jalla tidak akan sampai ke hatinya. Bahkan ia akan memandang ayat-ayat itu seperti dongeng-dongeng orang terdahulu yang diceritakan oleh orang yang sudah tua, yang tidak memiliki hakikat dan kesungguhan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 13: Kemudian Allah mensifati para pendosa yang melampaui batas yang bahwasanya mereka jika membaca ayat Al Qur’an mereka berkata : Sungguh ayat-ayat itu adalah dongeng-dongeng belaka, dan ia hanyalah kabar bagi umat yang telah lalu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menunjukkan kepada kebenaran dan menunjukkan benarnya apa yang dibawa para rasul. Dengan sombong sambil mendustakan dan menentangnya. Yakni cerita-cerita bohong orang-orang terdahulu. Berbeda dengan orang-orang yang adil dan sadar, yang maksudnya adalah mencari kebenaran, maka dia tidak akan mendustakan hari pembalasan, karena Allah Subhaanahu wa Ta'aala telah menegakkan dalil-dalilnya yang qath’i (pasti) dan bukti-buktinya yang menjadikan hal itu sebagai haqqul yaqin (kebenaran yang pasti) yang saking jelasnya seperti matahari di siang hari. Adapun orang yang ditutup hatinya oleh keburukan dan kemaksiatan yang dilakukannya, maka ia terhalangi dari melihat yang hak (benar). Oleh karena itu, ia dibalas dengannya, yakni ditutupi dari melihat Allah sebagaimana hatinya dihalangi dari ayat-ayat-Nya di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 13",
    "description": "Itulah orang yang apabila dibacakan kepadanya ayat-ayat kami, yaitu Al-Qur'an yang berisi ajaran islam yang mulia, dia berkata sembari menertawakannya, 'itu adalah dongeng dan bualan orang-orang dahulu. '14. Sekali-kali tidak demikian! Al-Qur'an adalah kalam dan wahyu Allah kepada nabi Muhammad. Bahkan apa yang mereka kerjakan itu, yaitu kekufuran dan maksiat, telah menutupi hati mereka sehingga tidak mampu membedakan antara yang hak dan batil."
  }
]