[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-17. Azab besar pada hari itu bagi orang orang yang mendustakan. Yaitu orang orang yang mendustakan hari pembalasan. Tidak ada yg mendustakannya kecuali orang yang dzhalim dan banyak berbuat dosa. Apabila ayat-ayat al-qur’an dibacakan kepadanya, dia berkata,”ini adalah kebatilan-kebatilan orang orang dulu.” Perkaranya tidak sebagaimana yang mereka tuduhkan, sebaliknya al-qur’an adalah firman Allah dan wahyu NYA kepada nabi NYA. Yang membuat hati mereka terhalang untuk membenarkan adalah apa yang menutupinya akibat banyaknya dosa dosa yang mereka lakukan. Perkaranya tidak sebagaimana yang diucapkan oleh orang orang kafir, sebaliknya pada hari kiamat,mereka terhalang sehingga tidak bisa melihat tuhan mereka di surga. Kemudian orang-orang kafir itu masuk kedalam api neraka,mereka merasakan panasnya, Kemudian kepada mereka dikatakan, “ini adalah balasan yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Perkara ini bukan seperti yang dibayangkan oleh para pendusta itu. Justru perbuatan maksiat yang pernah mereka lakukan telah mengalahkan fungsi akal mereka itu sehingga mereka tidak bisa melihat kebenaran dengan hati mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. كَلَّا ۖ (Sekali-kali tidak) Ini merupakan peringatan dan bantahan bagi orang yang banyak berdosa itu dari perkataan batilnya dan pendustaannya terhadap al-Qur’an. بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُوا۟ يَكْسِبُونَ (sesungguhnya mereka pada hari itu benar-benar tertutup dari (rahmat) Tuhan mereka) Kemaksiatan dan dosa mereka sangat banyak sehingga meliputi hati mereka. Dan itulah yang menutupi hati mereka itu. Imam Tirmidzi meriwayatkan hadits dan menshahihkannya dari Abu Hurairah, dari Nabi, beliau bersabda: “Sesungguhnya seorang hamba jika melakukan suatu dosa maka akan diberikan titik hitam di hatinya, dan jika ia bertaubat, meninggalkan dosa itu, dan memohon ampun maka hatinya akan dibersihkan kembali. Namun jika ia kembali melakukan dosa itu maka titik hitamnya akan bertambah hingga menutupi hatinya. Dan itulah ‘Raan’ yang disebutkan Allah dalam al-Qur’an.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1) . Ali bin Thalib berkata : \"sesungguhnya iman itu terlihat seperti sinar yang putih, apabila seorang hamba melakukan kebaikan, maka sinar tersebut akan tumbuh dan bertambah sehingga hati (berwarna) putih. Sedangkan kemunafikan terlihat seperti titik hitam, maka bila seorang melakukan perkara yang diharamkan, maka titik hitam itu akan tumbuh dan bertambah hingga hitamlah (warna) hati”, kemudian membaca ayat Allah : { كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ } . 2) . Bersiap-siaplah sebelum hati itu menjadi mati. Berkata Al Hasan al-basri tentang ayat { كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ } : \"Yaitu dosa yang semakin menumpuk sampai hati itu buta, dan akhirnya mati. 3) . Semakin dosa-dosa seseorang menumpuk, akan ada tanda dalam hatinya, dan ketika itulah hati menjadi buta dan tidak sanggup untuk menerima kebenaran dan baiknya agama, urusan akhirat akan direndahkan dibawah urusan dunia. : { كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ } 4) . Hati telah menjadi rusak karena kemegahan dunia telah mengalahkannya, hatinya patuh kepada segala perintah dunia dengan kelezatan didalamnya, oleh karena itu setiap hamba harus mampu menguasai dirinya sehingga ia mampu kembali kepada mengingat tuhannya dan kepada peringatan akan akhirat dengan segala peristiwa menakutkan didalamnya, sehingga kita tidak termasuk kedalam golongan orang-orang yang Allah katakan dalam ayat-Nya : { كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ } ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Jangan begitu! Ungkapan untuk membantah dan mencerca para pendusta atas ejekan mereka terhadap Al-quran. Al-quran bukanlah dongeng orang terdahulu, tetapi merekalah yang hatinya terhalang dan tertutup sehingga cahaya hidayah tidak bisa masuk pada hati mereka. Penghalang itu adalah dosa dan amal buruk mereka semua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sekali-kali tidak. Bahkan, telah menutupi} telah menaklukkan {hati mereka itu apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 14-17 Sedangkan orang yang bersikap adil lagi obyektif dan bertujuan mencari kebenaran yang nyata, ia tidak mendustakan Hari Pembalasan, karena Allah telah menegakkan dalil-dalil pasti dan bukti-bukti nyata yang membuatnya yakin dengan sebenarnya. Bukti dan dalil itu bagi pandangan hatinya laksana matahari bagi pandangan matanya. Tidak seperti orang yang hatinya tertutup oleh kemaksiatan-kemaksiatannya. Ia terhalang dari kebenaran. Karena itu balasannya adalah terhalang dari Allah sebagaimana hatinya dulu ketika di dunia terhalang dari menerima ayat-ayat Allah. “Kemudian sesungguhnya mereka,” di samping siksaan berat itu, “benar-benar masuk neraka, kemudian dikatakan (pada mereka),” “inilah azab yang dahulu selalu kamu dustakan.” Di sini Allah menyebutkan tiga macam azab untuk mereka; azab Neraka Jahim, azab celaan dan cemoohan, dan azab terhalang dari Rabb semesta alam yang mencakup murka dan marah Allah atas mereka dan hal itu lebih berat bagi mereka daripada siksaan neraka. Kontekstual ayat ini menunjukkan bahwa orang-orang yang beriman akan melihat Rabb mereka pada Hari Kiamat dan di surga. Mereka merasa niikmat dengan memandang Allah yang jauh lebih besar dari seluruh kenikmatan. Mereka bergembira berbincang-bincang denganNya dan senang dekat denganNya sebagaimana disebutkan Allah dalam berbagai ayat al-Qur’an serta riwayat mutawatir yang dinukil dari Rasulullah. Dalam ayat-ayat ini terdapat peringatan dari berbagai dosa, karena dosa bisa menutupi hati sedikit demi sedikit hingga cahaya hati padam dan pandangan hati mati dan inilah yang akan memutarbalikkan kebenaran (pada diri seseorang), sehingga kabatilan dalam pandangannya adalah kebenaran dan kebenaran dalam pandangannya adalah kebatilan. Dan inilah salah satu hukuman dosa terbesar."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Benar, sesungguhnya apa yang mereka katakan tentang AL-Qur'an ini tidak sesuai dengan perkara yang sebenarnya, itu dikarenakan hati mereka telah tertutup, sehingga tidak sampai kepadanya cahaya Al-Qur'an, dan wahyu Allah itu tidak bermanfaat bagi mereka, hati mereka telah tetutup rapat, dosa-dosa telah bertumpuk di hati mereka sampai akhirnya hati itu buta dan tertutup tidak mampu menerima kebenaran, peringatan dan nasehat tidak berpengaruh bagi diri mereka yang bodoh itu. Dalam sebuah hadits Nabi diterangkan bahwasanya jika anak Adam melakukan satu kemaksiatan, maka akan tertulis di hatinya satu titik hitam, jika ia bertaubat titik hitam itu akan terhapu, dan kalau ia belum betaubat dan terus melakukan kemaksiatan, maka titik hitam itu akan terus bertambah sampai menutupi seluruh bagian dari harinya. { كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ } Hati mereka telah tertutup disebabkan oleh dosa kemaksiatan yang telah mereka perbuat, Allah juga mengatakan dalam ayat lain tentang keadaan orang-orang kafir : { خَتَمَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ } ( Allah telah mengunci-mati hati dan pendengaran mereka, dan penglihatan mereka ditutup. Dan bagi mereka siksa yang amat berat. ) [ Al-Baqarah : 7 ] semua itu disebabkan oleh kekafiran dan kemaksian mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَلَّا بَلْ Maknanya: Ayat-ayat itu bukanlah dongeng-dongeng orang dahulu namun itu karena mereka رَانَ عَلَى قُلُوبِهِمْ Maknanya: berkumpul lalu menghalanginya dari kebenaran مَا كَانُوا يَكْسِبُونَ “apa-apa yang mereka usakan” Maknanaya: Berupa perbuatan-perbuatan jelek, karena perbuatan-perbuatan jelek akan membatasi seseorang dengan petunjuk sebagaiamana Allah Ta’ala berfirman: وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ “Dan orang-orang yang mendapat petunjuk Allah menambah petunjuk kepada mereka dan memberikan kepada mereka (balasan) ketakwaannya.”(QS. Muhammad: 17) Barang siapa yang mendapat petunjuk dari petunjuk Allah, dan patuh terhadap apa yang Allah perintahkan, meninggalkan larangan-Nya, membenarkan yang diberitakan Allah , dan melakukan hal-hal itu juga terhadap yang datang dari Rasulullah shallallaahu ‘alaihi wa sallam, maka tidak diragukan lagi bahwa harinya akan bercahaya, ia akan melihat kebenaran dengan sebenar-benarnya, dan melihat kebatilan dengan hakikatnya, dapat mengambil pelajaran dari ayat-ayat Allah ‘Azza Wa Jalla, ia akan memandang bahwa kedudukan ayat-ayat itu di atas semua ucapan, dan petunjuk Muhammad shallallaahu ‘alaihi wa sallam di atas segala petunjuk. Inilah orang yang hatinya diberi cahaya oleh Allah dengan keimanan. Ada pun orang yang hatinya terlumuri dengan kotoran dan najis kemaksiatan, maka ia tidak akan memandah ayat-ayat Allah sebagai kebenaran, bahkan ia akan memandang bahwa ayat-ayat tersebut adalah dongeng-dongeng orang terdahulu, sebagaimana disebutkan ayat ini كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ “Sekali-kali tidak (demikian), sebenarnya apa yang selalu mereka usahakan (berupa dosa) itu menutup hati mereka.”. Pada lafaz بَلْ [Bal] terdapat sedikit saktah (menghentikan bacaan sejenak) menurut sebagian ahli qiro’ah, sebagian lainnya tidak memandang demikian, kita boleh membacanya dengan mensaktahkan boleh juga dengan membacanya tanpa berhenti saktah كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ \" Sekali-kali tidak (demikian), sebenarnya apa yang selalu mereka usahakan (berupa dosa) itu menutup hati mereka.\" , ini tidak akan mengubah makna, baik anda membaca dengan sakta atau tidak, maknanya tidak akan berubah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 14: Ketahuilah oleh kalian, bahwa tidak demikian urusannya (sebagaimana yang mereka para pendusta katakan) mengenai Al Qur’an. Akan tetapi, merekalah manusia yang tertutup hatinya dan tidaklah apa yang mereka usahakan hanyalah menghasilkan dosa (bagi mereka sendiri), sampai-sampai menutupi hati dan pikiran mereka sendiri. Berkata Al Hasan : Keburukan itu adalah dosa yang kian menumpuk hingga membutakan hati dan hitam dengan sebab dosa. Dan memiliki tabiat (perangai) buruk yang tersimpan dalam hati, lebih besar daripada keburukan itu sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Katsir berkata, “Yakni perkaranya tidaklah seperti yang mereka sangka, dan tidak seperti yang mereka katakan, yaitu bahwa Al Qur’an adalah dongengan-dongengan orang-orang terdahulu, bahkan ia adalah firman Allah, wahyu-Nya, dan kitab yang diturunkan-Nya kepada Rasul-Nya shallallahu 'alaihi wa sallam. Dan sesungguhnya yang menghalangi hati mereka dari beriman kepadanya adalah karena Ar Raan yang menutupi hati mereka karena banyaknya dosa dan kesalahan. Oleh karena itu, Allah berfirman, “apa yang mereka kerjakan.” Rain menimpa hati orang-orang kafir, ghaim menimpa hati orang-orang baik, sedangkan ghain menimpa hati orang-orang yang dekat (dengan Allah)” Berupa kemaksiatan. Sehingga hati mereka seperti berkarat. Syaikh As Sa’diy berkata, “Dalam beberapa ayat ini terdapat peringatan terhadap dosa, karena ia akan menutupi hati sedikit demi sedikit sampai hilang cahayanya dan mati ketajaman pandangannya sehingga hakikat menjadi terbalik atasnya, ia akan melihat kebatilan sebagai kebenaran dan kebenaran sebagai kebatilan, dan ini di antara hukuman terhadap dosa.” Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada Abu Hurairah dari Rasulullah shallallahu 'alaihi wa sallam, bahwa Beliau bersabda: إِنَّ الْعَبْدَ إِذَا أَخْطَأَ خَطِيئَةً نُكِتَتْ فِي قَلْبِهِ نُكْتَةٌ سَوْدَاءُ فَإِذَا هُوَ نَزَعَ وَاسْتَغْفَرَ وَتَابَ سُقِلَ قَلْبُهُ وَإِنْ عَادَ زِيدَ فِيهَا حَتَّى تَعْلُوَ قَلْبَهُ وَهُوَ الرَّانُ الَّذِي ذَكَرَ اللَّهُ : كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ “Sesungguhnya seorang hamba apabila melakukan suatu kesalahan, maka akan digoreskan satu titik hitam di hatinya. Apabila dia berhenti, beristighfar dan bertobat, maka akan mengkilap lagi hatinya, dan jika ia mengulangi lagi, maka akan ditambah lagi (titik itu) sampai menutupi hatinya. Itulah Ar Raan yang disebutkan Allah (dalam Al Qur’an),” yaitu firman-Nya, “Sekali-kali tidak! Bahkan apa yang mereka kerjakan itu telah menutupi hati mereka.” (Tirmidzi berkata, “Hadits ini hasan shahih.” Syaikh Al Albani menghasankan hadits ini dalam Shahih At Tirmidzi (3334). Hadits ini menurut penyusun Tuhfatul Ahwadzi diriwayatkan pula oleh Ahmad, Nasa’i, Ibnu Majah, Ibnu Hibban dan Hakim, ia berkata, “Shahih sesuai syarat Muslim.”) Penyusun Tuhfatul Ahwadzi berkata, “Asal kata ‘Raan’ dan ‘Rain’ adalah tutupan, ia seperti karat yang menimpa sesuatu yang mengkilap.” Ath Thiibiy berkata, “Ar Raan dan Ar Rain adalah sama seperti kata ‘Aab dan ‘Aib. Ayat tersebut adalah berkenaan dengan orang-orang kafir, akan tetapi orang-orang mukmin ketika melakukan dosa, maka seperti mereka dalam hal hitamnya hati dan bertambahnya hal itu dengan bertambahnya dosa.” Ibnul Malak berkata, “Ayat ini disebutkan berkenaan dengan orang-orang kafir, akan tetapi Rasulullah shallallahu 'alaihi wa sallam menyebutkannya untuk menakut-nakuti orang-orang mukmin agar mereka berhati-hati dari terjatuh ke dalam banyak dosa agar hati mereka tidak menghitam sebagaimana menghitamnya hati orang-orang kafir. Oleh karena itu, dikatakan bahwa kemaksiatan-kemaksiatan adalah pengantar kekafiran.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 14",
    "description": "Sekali-kali tidak demikian! Al-Qur'an adalah kalam dan wahyu Allah kepada nabi Muhammad. Bahkan apa yang mereka kerjakan itu, yaitu kekufuran dan maksiat, telah menutupi hati mereka sehingga tidak mampu membedakan antara yang hak dan batil. 15. Sekali-kali tidak! sesungguhnya mereka yang kafir dan berbuat maksiat pada hari pembalasan itu benar-benar terhalang dari rahmat tuhannya. Mereka tidak mendapatkan rahmat Allah dan tidak pula mampu melihat-Nya di akhirat nanti."
  }
]