[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-17. Azab besar pada hari itu bagi orang orang yang mendustakan. Yaitu orang orang yang mendustakan hari pembalasan. Tidak ada yg mendustakannya kecuali orang yang dzhalim dan banyak berbuat dosa. Apabila ayat-ayat al-qur’an dibacakan kepadanya, dia berkata,”ini adalah kebatilan-kebatilan orang orang dulu.” Perkaranya tidak sebagaimana yang mereka tuduhkan, sebaliknya al-qur’an adalah firman Allah dan wahyu NYA kepada nabi NYA. Yang membuat hati mereka terhalang untuk membenarkan adalah apa yang menutupinya akibat banyaknya dosa dosa yang mereka lakukan. Perkaranya tidak sebagaimana yang diucapkan oleh orang orang kafir, sebaliknya pada hari kiamat,mereka terhalang sehingga tidak bisa melihat tuhan mereka di surga. Kemudian orang-orang kafir itu masuk kedalam api neraka,mereka merasakan panasnya, Kemudian kepada mereka dikatakan, “ini adalah balasan yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sungguh, mereka akan terhalangi untuk melihat kepada Rabb mereka pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. كَلَّآ إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ (Sekali-kali tidak, sesungguhnya mereka pada hari itu benar-benar tertutup dari (rahmat) Tuhan mereka) Yakni tertutup dari Tuhan mereka pada hari kiamat, mereka tidak dapat melihat-Nya layaknya orang-orang beriman. Sebagaimana Allah telah menghalangi mereka dari tauhid di dunia, Allah juga menghalangi mereka dari melihat-Nya di akhirat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1) . Imam Syafi'i berkata : \"Ayat ini merupakan dali bahwasanya orang-orang beriman pada hari kiamat akan melihat tuhannya\" Kemudian dari perkataan itu Ibnu katsir memberi komentar : Perkataan Imam Syafi'i ini adalah perkataan yang sangat baik, dia menjadikannya dalil atas pemahaman yang baik terhadap ayat ini, dan itu satu makna dengan ayat : { وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ , إِلَىٰ رَبِّهَا نَاظِرَةٌ } ( Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri , Kepada Tuhannyalah mereka melihat. ) [ Al-Qiyamah : 22-23 ] . 2) . Al-Husain bin al-fadhl berkata tentang ayat ini : \"Sebagaimana di dunia Allah menutupi hati-hati orang kafir dari cahaya Tauhid, Dia pun menutupi mereka dari melihat kepada-Nya pada hari kiamat\" . 3) . Tabir di dunia dan tabir di akhirat ! Sesungguhnya azab yang paling besar bagi penghuni neraka adalah tabir yang menutupi mereka dari melihat kepada Tuhannya, hati-hati mereka yang keras membatu menjadi sebab cahaya iman tidak mampu sampai kepada mereka, maka balasan yang pantas bagi mereka adalah tabir yang menutup dari melihat kepada sang pencipta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Jangan begitu! Ungakapan untuk memperingatkan lagi. Orang-orang kafir itu benar-benar terhalang dan terlarang dari Tuhannya pada hari kiamat. Mereka tidak bisa melihat Tuhannya seperti orang-orang yang beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak. Sesungguhnya mereka dari Tuhan mereka} dari melihat Tuhan mereka {pada hari itu benar-benar terhalang} terhalang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 14-17 Sedangkan orang yang bersikap adil lagi obyektif dan bertujuan mencari kebenaran yang nyata, ia tidak mendustakan Hari Pembalasan, karena Allah telah menegakkan dalil-dalil pasti dan bukti-bukti nyata yang membuatnya yakin dengan sebenarnya. Bukti dan dalil itu bagi pandangan hatinya laksana matahari bagi pandangan matanya. Tidak seperti orang yang hatinya tertutup oleh kemaksiatan-kemaksiatannya. Ia terhalang dari kebenaran. Karena itu balasannya adalah terhalang dari Allah sebagaimana hatinya dulu ketika di dunia terhalang dari menerima ayat-ayat Allah. “Kemudian sesungguhnya mereka,” di samping siksaan berat itu, “benar-benar masuk neraka, kemudian dikatakan (pada mereka),” “inilah azab yang dahulu selalu kamu dustakan.” Di sini Allah menyebutkan tiga macam azab untuk mereka; azab Neraka Jahim, azab celaan dan cemoohan, dan azab terhalang dari Rabb semesta alam yang mencakup murka dan marah Allah atas mereka dan hal itu lebih berat bagi mereka daripada siksaan neraka. Kontekstual ayat ini menunjukkan bahwa orang-orang yang beriman akan melihat Rabb mereka pada Hari Kiamat dan di surga. Mereka merasa niikmat dengan memandang Allah yang jauh lebih besar dari seluruh kenikmatan. Mereka bergembira berbincang-bincang denganNya dan senang dekat denganNya sebagaimana disebutkan Allah dalam berbagai ayat al-Qur’an serta riwayat mutawatir yang dinukil dari Rasulullah. Dalam ayat-ayat ini terdapat peringatan dari berbagai dosa, karena dosa bisa menutupi hati sedikit demi sedikit hingga cahaya hati padam dan pandangan hati mati dan inilah yang akan memutarbalikkan kebenaran (pada diri seseorang), sehingga kabatilan dalam pandangannya adalah kebenaran dan kebenaran dalam pandangannya adalah kebatilan. Dan inilah salah satu hukuman dosa terbesar."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sungguh orang-orang beriman pada hari kiamat akan melihat Tuhan mereka dengan mata kepala mereka sendiri, mereka nyaman dengan melihat-Nya, sedangkan orang-orang kafir tidak akan bisa mendapankan nikmat yang sama, karena mereka enggan beriman kepada Allah ketika didunia, oleh karena itu mereka pun tertutup dari melihat Tuhan mereka dihari kiamat. Orang-orang yang ketika didunia mereka beriman akan mendapat nikmat terbesar dari Tuhan mereka di hari kiamat, ketika masih didunia mereka tidak mampu melihat wujud Tuhan mereka secara langsung, tapi mereka tetap istiqomah pada keimanan mereka, semua makhluk yang ada di dunia tidak mampu dan tidak memiiki kekuatan untu melihat wujud Tuhan semesta alam secara lagsung, akan tetapi pada hari kiamat Allah menjadikan jasad-jasad mereka menjadi kuat, sehingga mereka pun mampu melihat Allah dengan kemuliaannya, Rasululah ﷺ bersabda : (( عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ حَدَّثَنَا جَرِيرٌ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْبَدْرِ فَقَالَ إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ يَوْمَ الْقِيَامَةِ كَمَا تَرَوْنَ هَذَا لَا تُضَامُونَ فِي رُؤْيَتِهِ )) \" dari Qais bin Abu Hazim telah menceritakan kepada kami Jarir, bahwa Rasulullah Shallallahu'alaihiwasallam menemui kami di malam purnama, lantas beliau bersabda: \"Kalian akan melihat Tuhan kalian pada hari kiamat sebagaimana kalian melihat bulan ini dengan tidak kesulitan melihatnya.\" Imam Syafi'i berkata : hadits ini merupakan dalil bahwa orang mukmin pasti akan melihat Tuhannya pada hari kiamat, karena jika hal itu tertup bagi orang-orang kafir maka sudah bisa dipastikan bahwa hal itu mungkin bagi orang-orang yang beriman kepada Allah, dan dalil-dalil tentang itu cukup banyak diriwayatkan dari Rasulullah ﷺ , dan melihat Allah dalam wujudnya yang asli adalah merupakan nikmat yang terbesar bagi orang-orang mukmin, mereka akan bahagia dengan nikmat yang agung itu, seperti itulah balasan bagi mereka yang menyatakan keimanannya kepada Allah dan taat atas segala perintahnya, menjauh dari segala larangannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ \" Sekali-kali tidak (demikian), sebenarnya apa yang selalu mereka usahakan (berupa dosa) itu menutup hati mereka.\" Maknanya: benar-benar mereka terhalangi dari Rabb mereka, ini terjadi saat hari kiamat, mereka akan terhalangi dari memandang kepada Allah ‘Azza Wa Jalla, sebagaimana mereka pun telah terhalangi dari memandang syari’at, ayat-ayat-Nya, mereka memandang ayat-ayat-Nya itu seperti dongeng-dongeng terdahulu belaka. Ahlussunnah waljama’ah menjadikan ayat ini sebagai dalil untuk ketetapan adanya melihat Allah ‘Azza Wa Jalla. Sisi pendalilannya jelas. Sesungguhnya tidaklah mereka terhalangi ketika dimurkai Allah melainkan Allah memberikan kemampuan orang-orang baik untuk melihat-Nya Ta’ala ketika mendapatkan leridhoan., jika mereka,orang-orang yang fajir terhalangi maka orang-orang baik tidak akan terhalangi. Jika saja keduanya terhalangi maka tidak ada faedah sama sekali dari pengkhususan terhalang ini bagi orang-orang fajir saja. Adanya melihat Allah ‘Azza Wa Jalla ditetapkan berdasarkan dalil al-Quran, hadits mutawatir dan ijma’ sahabat dan aimmah, tidak ada masalah (perselisihan) pada hal ini, bahwa Allah Ta’ala akan dilihat dengan mata sebagaimana Allah Ta’ala berfirman: وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ (22) إِلَى رَبِّهَا نَاظِرَةٌ “Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri. Kepada Rabbnyalah mereka melihat.”(QS. AL-Qiyamah: 22-23) Allah Ta'ala juga berfirman: لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ “Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya.” (QS. Yunus: 26) Nabi shallallaahu ‘alaihi wa sallam manfsirkan tambahan dengan melihat wajah Allah Ta’ala(1) Sebagaimana dalam firman Allah ta’ala juga: لَهُمْ مَا يَشَاءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ “Mereka di dalamnya memperoleh apa yang mereka kehendaki; dan pada sisi Kami ada tambahannya.”(QS. Qaf: 35) Tambahan dalam ayat ini bermakna tambahan yang ada pada firman-Nya: لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ “Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya.” Sebagaimana Allah Ta’ala berfirman: لَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ “Dia tidak dapat dijangkau oleh penglihatan mata, sedang Dia dapat melihat segala penglihatan itu”(QS. Al-An’am: 103) Peniadaan jangkauan penglihatan di sini menunjukkan pada dasarnya adanya melihat Allah, oleh karenanya ayat ini dijadikan ulama salaf sebagai dalil penetap adanya penglihatan kepada Allah, sedang kholaf menjadikan dalil tidak adanya penglihatan kepada Allah, tidak diragukan lagi ayat ini adalah dalil yang mebantah mereka. Karena Allah di sini tidak meniadakan penglihatan, tetapi Allah maniadakan jangkauan, sedangkan peniadaan jangkauan pandangan menunjukkan pada dasarnya penglihatan itu ada. Kesimpulannya: bahwa AL-Quran menunjukkan adanya rukyah (melihat) Allah ‘Azza waJalla secara hakiki dengan mata, begitu juga hadits hadits shahih menunjukkan demikian pula, yang mana Nabi shallallaahu ‘alaihi wa sallam bersabda: إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ عَيَانًا كَمَا تَرَوْنَ الشَّمْسَ صَحْوًا لَيْسَ دُوْنَهَا سَحَابٌ “ Sesungguhnya kalian akan melihat Rabb kalian denagn mata sebagaimana kalian melihat matahari dengan jelas tanpa dihalangi awan ”(2) Beliau juga bersabda: إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ الْقَمَرَ لَيْلَةَ الْبَدْرِ لَا تَضَامُّوْنَ فِيْ رُؤْيَتِهِ “Sesungguhnya kalian akan melihat Rabb kalian sebagaimana kalian melihat bulan di malam purnama, kalian tidak akan bedesakan dalam melihat-Nya” (3) Para Sahabat radhiyallaahu ‘anhu, para pengikut mereka dengan kebaikan dari kalangan salaf telah mengimani hal tersebut, begitu juga para imam-imam umat ini. tetapi orang-orang yang akal dan hatinya tertupi kebenaran mereka mengingkarinya, mereka mengatakan: Sesungguhnya Allah tidak mungkin dilihat dengan mata, sedangkan yang dimaksud penglihatan dalam ayat-ayat adalah penglihatan dengan hati, yaitu dengan keyakinan. Tidak diragukan lagi bahwa ini adalah pernyataan yang batil, menyelisihi al-Quran, hadits dan ijma’ salaf. Juga keyakinan tersebut akan ada pada selain mereka juga, sampai-sampai orang fajir pun di hari kiamat nanti akan melihat apa-apa yang dulu dijanjikan kepada mereka dengan sebenar-benarnya dan dengan keyakinan, di sini bukan saatnya untuk memperpanjang pembahasan penetapan penglihatan kepada Allah ‘Azza Wa Jalla dan mendiskusikan dalil-dalil kedua kubu ini, karena perkara ini –walillaahil hamdu- sudah amat jelas tidak perlu diulas secara panjang lebar. (1) Dikeluarkan Muslim (181) dari hadits Shuhaib radhiyallaahu 'anhu (2) Penggalan awal hadits ini dikeluarkan Bukhari (7435) dan sabdanya yang artinya \"sebagaimana memandang matahari…\" Muslim (183) (3) Dikeluarkan Bukhari (554) dan Muslim (633) dari hadits Jarir Bin Abdullaah radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 15: Allah memberi ancaman kepada kaum musyrikin dengan berkata : Cegahlah (hari kiamat ini) wahai orang-orang musyrik sebagaimana yang kalian klaim bahwa : Nanti di hari kiamat kalian akan menjadi orang-orang yang dekat (di sisi) Allah; Bahkan kalian di akhirat adalah orang-orang yang terhalang dari melihat Allah dan kalian tak akan dapat melihat-Nya. Karena sebagaimana kalian di dunia menghalangi diri-diri kalian dari mentauhidkan Allah, maka kalian akan terhalangi dari melihat Rabb kalian di hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata “Kalla” di ayat ini bisa diartikan “Tentu atau pasti”."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 15",
    "description": "Sekali-kali tidak! sesungguhnya mereka yang kafir dan berbuat maksiat pada hari pembalasan itu benar-benar terhalang dari rahmat tuhannya. Mereka tidak mendapatkan rahmat Allah dan tidak pula mampu melihat-Nya di akhirat nanti. 16. Setelah terhalang dari rahmat Allah, kemudian sesungguhnya mereka yang ingkar dan berbuat maksiat itu benar-benar masuk neraka yang penuh siksa mengerikan."
  }
]