[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-17. Azab besar pada hari itu bagi orang orang yang mendustakan. Yaitu orang orang yang mendustakan hari pembalasan. Tidak ada yg mendustakannya kecuali orang yang dzhalim dan banyak berbuat dosa. Apabila ayat-ayat al-qur’an dibacakan kepadanya, dia berkata,”ini adalah kebatilan-kebatilan orang orang dulu.” Perkaranya tidak sebagaimana yang mereka tuduhkan, sebaliknya al-qur’an adalah firman Allah dan wahyu NYA kepada nabi NYA. Yang membuat hati mereka terhalang untuk membenarkan adalah apa yang menutupinya akibat banyaknya dosa dosa yang mereka lakukan. Perkaranya tidak sebagaimana yang diucapkan oleh orang orang kafir, sebaliknya pada hari kiamat,mereka terhalang sehingga tidak bisa melihat tuhan mereka di surga. Kemudian orang-orang kafir itu masuk kedalam api neraka,mereka merasakan panasnya, Kemudian kepada mereka dikatakan, “ini adalah balasan yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Kemudian sungguh mereka akan masuk ke dalam Neraka, mereka merasa tersiksa karena panasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. ثُمَّ إِنَّهُمْ لَصَالُوا۟ الْجَحِيمِ (Kemudian, sesungguhnya mereka benar-benar masuk neraka) Yakni mereka akan masuk neraka dan merasakan panasnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Kemudian orang-orang kafir itu benar-benar akan masuk neraka yang membara dan kekal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka kemudian benar-benar masuk neraka Jahim} benar-benar masuk neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 14-17 Sedangkan orang yang bersikap adil lagi obyektif dan bertujuan mencari kebenaran yang nyata, ia tidak mendustakan Hari Pembalasan, karena Allah telah menegakkan dalil-dalil pasti dan bukti-bukti nyata yang membuatnya yakin dengan sebenarnya. Bukti dan dalil itu bagi pandangan hatinya laksana matahari bagi pandangan matanya. Tidak seperti orang yang hatinya tertutup oleh kemaksiatan-kemaksiatannya. Ia terhalang dari kebenaran. Karena itu balasannya adalah terhalang dari Allah sebagaimana hatinya dulu ketika di dunia terhalang dari menerima ayat-ayat Allah. “Kemudian sesungguhnya mereka,” di samping siksaan berat itu, “benar-benar masuk neraka, kemudian dikatakan (pada mereka),” “inilah azab yang dahulu selalu kamu dustakan.” Di sini Allah menyebutkan tiga macam azab untuk mereka; azab Neraka Jahim, azab celaan dan cemoohan, dan azab terhalang dari Rabb semesta alam yang mencakup murka dan marah Allah atas mereka dan hal itu lebih berat bagi mereka daripada siksaan neraka. Kontekstual ayat ini menunjukkan bahwa orang-orang yang beriman akan melihat Rabb mereka pada Hari Kiamat dan di surga. Mereka merasa niikmat dengan memandang Allah yang jauh lebih besar dari seluruh kenikmatan. Mereka bergembira berbincang-bincang denganNya dan senang dekat denganNya sebagaimana disebutkan Allah dalam berbagai ayat al-Qur’an serta riwayat mutawatir yang dinukil dari Rasulullah. Dalam ayat-ayat ini terdapat peringatan dari berbagai dosa, karena dosa bisa menutupi hati sedikit demi sedikit hingga cahaya hati padam dan pandangan hati mati dan inilah yang akan memutarbalikkan kebenaran (pada diri seseorang), sehingga kabatilan dalam pandangannya adalah kebenaran dan kebenaran dalam pandangannya adalah kebatilan. Dan inilah salah satu hukuman dosa terbesar."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian sesungguhnya mereka ( orang kafir ) akan msuk kedalam Neraka Jahannam yang sangat panas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ إِنَّهُمْ لَصَالُو الْجَحِيمِ “Kemudian, sesungguhnya mereka benar-benar masuk neraka.” Yaitu mereka orang-orang fajir لَصَالُو الْجَحِيمِ \" benar-benar masuk neraka.\" Maknanya: mereka akan memasuki panasnya dan siksanya, kita memohon kepada Allah keselamatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 16: 16-17. Orang-orang kafir akan dijebloskan ke dalam neraka sehingga terpanggang oleh nyala apinya. Kemudian malaikat adzab berkata kepada mereka : Inilah adazb yang kalian tidak benarkan (kalian ragu) ketika di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di samping hukuman yang disebutkan sebelumnya (dihalangi dari melihat Allah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 16",
    "description": "Setelah terhalang dari rahmat Allah, kemudian sesungguhnya mereka yang ingkar dan berbuat maksiat itu benar-benar masuk neraka yang penuh siksa mengerikan. 17. Kemudian dikatakan kepada mereka dengan nada geram, 'inilah azab yang dahulu kamu dustakan. ' pada saat itulah mereka yang dahulu mendustakan hari akhirat merasakan sakitnya siksa, kerugian, dan penyesalan yang mendalam."
  }
]