[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-17. Azab besar pada hari itu bagi orang orang yang mendustakan. Yaitu orang orang yang mendustakan hari pembalasan. Tidak ada yg mendustakannya kecuali orang yang dzhalim dan banyak berbuat dosa. Apabila ayat-ayat al-qur’an dibacakan kepadanya, dia berkata,”ini adalah kebatilan-kebatilan orang orang dulu.” Perkaranya tidak sebagaimana yang mereka tuduhkan, sebaliknya al-qur’an adalah firman Allah dan wahyu NYA kepada nabi NYA. Yang membuat hati mereka terhalang untuk membenarkan adalah apa yang menutupinya akibat banyaknya dosa dosa yang mereka lakukan. Perkaranya tidak sebagaimana yang diucapkan oleh orang orang kafir, sebaliknya pada hari kiamat,mereka terhalang sehingga tidak bisa melihat tuhan mereka di surga. Kemudian orang-orang kafir itu masuk kedalam api neraka,mereka merasakan panasnya, Kemudian kepada mereka dikatakan, “ini adalah balasan yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Kemudian dikatakan kepada mereka pada hari Kiamat sebagai bentuk hinaan terhadap mereka, “Siksa yang sedang kalian rasakan ini adalah balasan dari pendustaan kalian terhadapnya di dunia ketika Rasul kalian mengabarkannya kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Lalu akan dikatakan kepada mereka para bahan bakar neraka: Inilah siksa yang dulu kalian dustakan ketika di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dikatakan,“Inilah (azab) yang selalu kalian dustakan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 14-17 Sedangkan orang yang bersikap adil lagi obyektif dan bertujuan mencari kebenaran yang nyata, ia tidak mendustakan Hari Pembalasan, karena Allah telah menegakkan dalil-dalil pasti dan bukti-bukti nyata yang membuatnya yakin dengan sebenarnya. Bukti dan dalil itu bagi pandangan hatinya laksana matahari bagi pandangan matanya. Tidak seperti orang yang hatinya tertutup oleh kemaksiatan-kemaksiatannya. Ia terhalang dari kebenaran. Karena itu balasannya adalah terhalang dari Allah sebagaimana hatinya dulu ketika di dunia terhalang dari menerima ayat-ayat Allah. “Kemudian sesungguhnya mereka,” di samping siksaan berat itu, “benar-benar masuk neraka, kemudian dikatakan (pada mereka),” “inilah azab yang dahulu selalu kamu dustakan.” Di sini Allah menyebutkan tiga macam azab untuk mereka; azab Neraka Jahim, azab celaan dan cemoohan, dan azab terhalang dari Rabb semesta alam yang mencakup murka dan marah Allah atas mereka dan hal itu lebih berat bagi mereka daripada siksaan neraka. Kontekstual ayat ini menunjukkan bahwa orang-orang yang beriman akan melihat Rabb mereka pada Hari Kiamat dan di surga. Mereka merasa niikmat dengan memandang Allah yang jauh lebih besar dari seluruh kenikmatan. Mereka bergembira berbincang-bincang denganNya dan senang dekat denganNya sebagaimana disebutkan Allah dalam berbagai ayat al-Qur’an serta riwayat mutawatir yang dinukil dari Rasulullah. Dalam ayat-ayat ini terdapat peringatan dari berbagai dosa, karena dosa bisa menutupi hati sedikit demi sedikit hingga cahaya hati padam dan pandangan hati mati dan inilah yang akan memutarbalikkan kebenaran (pada diri seseorang), sehingga kabatilan dalam pandangannya adalah kebenaran dan kebenaran dalam pandangannya adalah kebatilan. Dan inilah salah satu hukuman dosa terbesar."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian dikatakan kepada mereka : inilah azab yang kalian dustakan didunia, kalian mendustakan Al-Qur'an yang didalamnya terkandung ayat-ayat azab, lalu kalian mengatakan itu hanyalah dongeng umat terdahulu, dan sekarang rasakanlah apa yang kalian dustakan itu, Allah berfirman : { هَٰذِهِ النَّارُ الَّتِي كُنْتُمْ بِهَا تُكَذِّبُونَ } ( (Dikatakan kepada mereka): “Inilah neraka yang dahulu kamu selalu mendustakannya”.) [ At-Thur : 14 ], Allah juga mengatakan : { اصْلَوْهَا فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاءٌ عَلَيْكُمْ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ } ( Masukklah kamu ke dalamnya (rasakanlah panas apinya); maka baik kamu bersabar atau tidak, sama saja bagimu; kamu diberi balasan terhadap apa yang telah kamu kerjakan. ) [ At-Thur : 16 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Sebagai bentuk hardikan dan celaan, kemudian akan dikatakan kepada mereka: هَذَا الَّذِي كُنْتُمْ بِهِ تُكَذِّبُونَ “Inilah azab yang dahulu selalu kalian dustakan” oleh karena itu mereka akan mengatakan “” Allah berfirman: “\"Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman\", (tentulah kamu melihat suatu peristiwa yang mengharukan). Tetapi (sebenarnya) telah nyata bagi mereka kejahatan yang mereka dahulu selalu menyembunyikannya. Sekiranya mereka dikembalikan ke dunia, tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya. Dan sesungguhnya mereka itu adalah pendusta-pendusta belaka.”(QS. Al-An’am: 27-28) Setelah menyebutkan keadaan-keadaan orang-orang fajir, dan siksaan yang menimpa mereka, Allah menyebutkan keadaan-keadaan orang-orang yang baik, dan kenikmatan yang akan mereka perolah,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 17: 16-17. Orang-orang kafir akan dijebloskan ke dalam neraka sehingga terpanggang oleh nyala apinya. Kemudian malaikat adzab berkata kepada mereka : Inilah adazb yang kalian tidak benarkan (kalian ragu) ketika di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan demikian, mereka ditimpa tiga macam azab; azab neraka, azab celaan, dan azab dihalangi dari melihat Rabbul ‘aalamin yang di dalamnya mengandung marah dan murka Allah kepada mereka, dan yang demikian lebih besar dari azab neraka. Kebalikan dari itu adalah, bahwa kaum mukmin dapat melihat Tuhan mereka pada hari Kiamat dan ketika mereka di surga, dan mereka juga merasa nikmat karena melihat kepada-Nya bahkan hal itu melebihi semua kenikmatan. Mereka juga merasa senang dengan pembicaraan Allah Subhaanahu wa Ta'aala dan merasa gembira dengan dekatnya mereka dengan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 17",
    "description": "Kemudian dikatakan kepada mereka dengan nada geram, 'inilah azab yang dahulu kamu dustakan. ' pada saat itulah mereka yang dahulu mendustakan hari akhirat merasakan sakitnya siksa, kerugian, dan penyesalan yang mendalam. 18. Sekali-kali tidak! tidaklah sama keadaan orang kafir dan orang mukmin di akhirat nanti. Sesungguhnya catatan perbuatan orang-orang yang berbakti, beriman, dan beramal saleh benar-benar tersimpan dalam 'illiyyin."
  }
]