[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-21. Benar, sesungguhnya perkara yang telah ditetapkan bagi orang orang yang berbakti, (yaitu orang orang yang bertakwa),adalah bahwa mereka berada di derajat yang tinggi di dalam surga. Tahukah kamu (wahai rasul) apa derajat yang tinggi itu? Ketetapan bagi orang-orang baik itu sudah tercatat dan sudah selesai,tidak ditambah dan tidak dikurangi. Para malaikat di setiap langit yang didekatkan (kepada Allah) melihatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Sekali-kali tidak, kenyataannya tidak seperti yang kalian bayangkan bahwa tidak ada Hari Perhitungan dan pembalasan. Sesungguhnya kitab orang-orang yang berbakti benar-benar berada di 'illiyyin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-21. Sungguh kitab catatan amal orang-orang beriman yang taat kepada Allah berada di tempat yang tinggi di langit ketujuh. Dan apa yang kamu ketahui -hai Rasulullah- tentang tempat yang tinggi itu? ia adalah kitab yang mencatat amalan-amalan shalih, para malaikat yang dekat kepada Allah di setiap langit akan mendatangi dan menjaganya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. لَفِى عِلِّيِّينَ ((tersimpan) dalam ‘Illiyyin) Yakni mereka telah tertulis sebagai penduduk illiyyin, yaitu surga atau tempat-tempat yang tinggi di surga. Makna (الأبرار) yakni orang-orang yang taat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Jangan begitu! Sebagai peringatan seperti sebelumnya. Sesungguhnya catatan orang-orang yang beriman dan benar telah tertulis pada susunan yang baik dan dartar orang-orang baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak! Sesungguhnya catatan orang-orang yang berbakti benar-benar tersimpan dalam ‘Illiyyīn} langit tingkat tujuh di bawah Arsy"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 18-21 Setelah menyebutkan bahwa catatan amal orang-orang berdosa berada di tempat paling bawah dan sempit, selanjutnya Allah menyebutkan bahwa catatan amal orang-orang baik berada di tempat yang paling atas dan luas. Catatan amal mereka tertulis dan “disaksikan oleh malaikat-malaikat yang didekatkan (kepada Allah),” dari kalangan malaikat mulia, ruh para nabi, orang-orang jujur dalam beriman dan para syuhada’. Allah menyebutkan mereka di kalangan malaikat tertinggi. Dan illiyyun nama surga tertinggi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ } makna \" الأبرار \" : kata jamak dari \" بَرٍّ \" yaitu mereka yang melakukan amal shalih, sedangkan \" البِرِّ \" adalah kebaikan atau amal shalih, Allah ﷻ berfirman : { لَيْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَٰكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَالْمَلَائِكَةِ وَالْكِتَابِ وَالنَّبِيِّينَ وَآتَى الْمَالَ عَلَىٰ حُبِّهِ ذَوِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينَ وَابْنَ السَّبِيلِ وَالسَّائِلِينَ وَفِي الرِّقَابِ وَأَقَامَ الصَّلَاةَ وَآتَى الزَّكَاةَ وَالْمُوفُونَ بِعَهْدِهِمْ إِذَا عَاهَدُوا ۖ وَالصَّابِرِينَ فِي الْبَأْسَاءِ وَالضَّرَّاءِ وَحِينَ الْبَأْسِ ۗ أُولَٰئِكَ الَّذِينَ صَدَقُوا ۖ وَأُولَٰئِكَ هُمُ الْمُتَّقُونَ } ( Bukanlah menghadapkan wajahmu ke arah timur dan barat itu suatu kebajikan, akan tetapi sesungguhnya kebajikan itu ialah beriman kepada Allah, hari kemudian, malaikat-malaikat, kitab-kitab, nabi-nabi dan memberikan harta yang dicintainya kepada kerabatnya, anak-anak yatim, orang-orang miskin, musafir (yang memerlukan pertolongan) dan orang-orang yang meminta-minta; dan (memerdekakan) hamba sahaya, mendirikan shalat, dan menunaikan zakat; dan orang-orang yang menepati janjinya apabila ia berjanji, dan orang-orang yang sabar dalam kesempitan, penderitaan dan dalam peperangan. Mereka itulah orang-orang yang benar (imannya); dan mereka itulah orang-orang yang bertakwa. ) [ Al-Baqarah : 177 ] . { كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ } kitab orang-orang beriman yang didalamnya tertulis kebaikan dan amalan shalih mereka tersimpan dan terjaga di tempat yang tinggi didalam surga, sedangkan kitab orang-orang kafir berada ditempat yang paling rendah didalam neraka, itulah perbandingan antara orang yang beriman dan orang yang berbuat kekafiran kepad Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ \" Sekali-kali tidak, sesungguhnya kitab orang-orang berbakti itu (tersimpan) dalam 'Illiyyin.\" Pada ayat ini Allah ‘Azza Wa Jalla menyebutkan berita yang ditegaskan dengan إنَّ [Inna: sesungguhnya] karena Inna dalam bahasa arab adalah salah satu kata pengat. Jika anda mengatakan: اَلرَّجُلُ قَائِم [Ar-Rajulu Qaimun] “Laki-laki ini berdiri” jika anda mengatakan إنَّ الرَّجُلَ قَائِمٌ [Sungguh laki-laki ini berdiri] maka akan menjadi berita yang ditegaskan, maka Allah ‘Azza Wa Jalla berfirman: إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ “sesungguhnya kitab orang-orang berbakti itu (tersimpan) dalam 'Illiyyin. ” Adalah kebalikan dari firman-Nya إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ “karena sesungguhnya kitab orang yang durhaka tersimpan dalam sijjin.” Maka catatan orang-orang yang fajir terdapat di sijjin, di bumi terdalam, sedangkan catatan orang-orang yang baik berada di ‘illiyyiin, yaitu surga tertinggi. Maksudnya: Bahwa mereka d di tempat yang tinggi ini, telah tertulis di sisi Allah ‘Azza Wa Jalla sebelum Allah menciptakan langit dan bumi, sebelum lima puluh ribu tahun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 18: 18-19. Allah kabarkan bahwa urusannya tidak sebagaimana yang mereka para pendusta klaim, akan tetapi (ketahuilah oleh kalian) kitab orang-orang yang berhasil itu mengikuti apa yang diperintahkan Allah dan Rasul-Nya ﷺ tersimpan di illiyyin diletakkan (di tempatkan) di tempat yang tinggi. Apakah engkau tahu wahai Nabi apa itu tingkatan tempat yang tinggi ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa kitab catatan amal orang-orang yang durhaka berada di tempat paling bawah dan paling sempit, maka Allah Subhaanahu wa Ta'aala menyebutkan bahwa kitab catatan amal orang-orang yang berbakti berada di tempat paling atas dan paling luas, dan bahwa kitab catatan amal mereka itu disaksikan oleh makhluk yang didekatkan (lihat ayat ke 21) seperti para malaikat, ruh para nabi, para shiddiqin dan para syuhada, dan bahwa Allah Subhaanahu wa Ta'aala meninggikan nama mereka di hadapan makhluk di sisi-Nya. Kata “Kalla” di ayat ini bisa diartikan “Tentu atau pasti”. Kitab yang mencatat perbuatan orang-orang yang berbakti tersimpan di 'Illiyyin. Ada yang berpendapat, bahwa ‘Illiyyin artinya tempat di langit ketujuh di bawah ‘Arsy. Al A’masy meriwayatkan dari Hilal bin Yasaf ia berkata: Ibnu ‘Abbas pernah bertanya kepada Ka’ab tentang Sijjin, sedangkan saya hadir di situ?” Ia (Ka’ab) menjawab, “Ia adalah bumi yang ketujuh dan di sana terdapat ruh-ruh orang-orang kafir.” Lalu Ibnu Abbas bertanya kepadanya tentang Sijjin? Ia menjawab, “Ia adalah langit ketujuh, dan di sana terdapat ruh-ruh orang-orang mukmin.”Ibnu Abbas berkata tentang ayat, “Benar-benar tersimpan dalam 'Illiyyin.” “Yaitu surga.” Dan dalam sebuah riwayat darinya, bahwa maksudnya amal-amal mereka di langit di sisi Allah. Qatadah berkata, “Illiyyun adalah betis/tonggak kanan ‘Arsy.” Yang lain berpendapat, “Illiyyun adalah di dekat Sidratul Muntaha.” Menurut Ibnu Katsir, yang tampak, bahwa ‘Illiyyin diambil dari kata ‘uluw (tinggi), dan setiap kali sesuatu tinggi dan naik, maka semakin besar dan luaslah tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 18",
    "description": "Sekali-kali tidak! tidaklah sama keadaan orang kafir dan orang mukmin di akhirat nanti. Sesungguhnya catatan perbuatan orang-orang yang berbakti, beriman, dan beramal saleh benar-benar tersimpan dalam 'illiyyin. 19. Untuk menggugah perhatian manusia, Allah bertanya, 'dan tahukah engkau apakah 'illiyyin itu'."
  }
]