[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-21. Benar, sesungguhnya perkara yang telah ditetapkan bagi orang orang yang berbakti, (yaitu orang orang yang bertakwa),adalah bahwa mereka berada di derajat yang tinggi di dalam surga. Tahukah kamu (wahai rasul) apa derajat yang tinggi itu? Ketetapan bagi orang-orang baik itu sudah tercatat dan sudah selesai,tidak ditambah dan tidak dikurangi. Para malaikat di setiap langit yang didekatkan (kepada Allah) melihatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Tahukah kamu -wahai Rasul- apa 'illiyyin itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَمَآ أَدْرَىٰكَ مَا عِلِّيُّونَ (Tahukah kamu apakah ‘Illiyyin itu?) Yakni hai Muhammad, apakah kamu mengetahui apakah illiyyin itu? Pertanyaan ini adalah sebagai pengagunggan bagi illiyyin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19-20. Apakah engkau tahu apa ‘illiyyin itu? Ungkapan ini adalah ungkapan untuk mengagungkan, bahwa buku catatan itu adalah catatan orang-orang yang taat. Buku catatan itu adalah catatan yang tersusun dengan jelas sehingga bisa diketahui"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu mengetahui apa itu ‘Illiyyīn"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 18-21 Setelah menyebutkan bahwa catatan amal orang-orang berdosa berada di tempat paling bawah dan sempit, selanjutnya Allah menyebutkan bahwa catatan amal orang-orang baik berada di tempat yang paling atas dan luas. Catatan amal mereka tertulis dan “disaksikan oleh malaikat-malaikat yang didekatkan (kepada Allah),” dari kalangan malaikat mulia, ruh para nabi, orang-orang jujur dalam beriman dan para syuhada’. Allah menyebutkan mereka di kalangan malaikat tertinggi. Dan illiyyun nama surga tertinggi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Penyebutan \" العليون \" kembali diulang dengan maksud mengangungkannya, yakni dia memiliki kedudukan yang tinggi, juga menjadi pertanyaan : tahukah kamu apa itu \" العليون \" ? , tidak siapapun yang mengetahui bentuknya bagaimana atau seperti apakah ciri-ciri tepatnya melainkan hanya Allah ﷻ lah yang mengetahuinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا أَدْرَاكَ مَا عِلِّيُّونَ Maknanya: Apa yang memberitahumu apa itu ‘illiyuun? Kalimat tanya disini dalam rangka pembesaran dan pengagungan. Yaitu sesuatu apakah yang mengenalkanmu kepadanya? Sungguh ia itu agung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 19: 18-19. Allah kabarkan bahwa urusannya tidak sebagaimana yang mereka para pendusta klaim, akan tetapi (ketahuilah oleh kalian) kitab orang-orang yang berhasil itu mengikuti apa yang diperintahkan Allah dan Rasul-Nya ﷺ tersimpan di illiyyin diletakkan (di tempatkan) di tempat yang tinggi. Apakah engkau tahu wahai Nabi apa itu tingkatan tempat yang tinggi ?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 19",
    "description": "Untuk menggugah perhatian manusia, Allah bertanya, 'dan tahukah engkau apakah 'illiyyin itu'20. 'illiyyin adalah kitab yang berisi catatan perbuatan yang tertulis dengan jelas sehingga mudah dibaca oleh mereka yang berhak mendapatkannya."
  }
]