[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-21. Benar, sesungguhnya perkara yang telah ditetapkan bagi orang orang yang berbakti, (yaitu orang orang yang bertakwa),adalah bahwa mereka berada di derajat yang tinggi di dalam surga. Tahukah kamu (wahai rasul) apa derajat yang tinggi itu? Ketetapan bagi orang-orang baik itu sudah tercatat dan sudah selesai,tidak ditambah dan tidak dikurangi. Para malaikat di setiap langit yang didekatkan (kepada Allah) melihatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Malaikat yang didekatkan ke setiap langit hadir menyaksikan kitab ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. يَشْهَدُهُ الْمُقَرَّبُونَ (yang disaksikan oleh malaikat-malaikat yang didekatkan (kepada Allah)) Yakni para malaikat menyaksikan kitab tersebut. Terdapat pendapat mengatakan bahwa para malaikat menyaksikan isi kitab itu pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Tulisan/catatan itu disaksikan oleh para malaikat dan orang-orang yang dekat dengan Allah. Orang-orang yang mempunyai kedudukan khusus di sisi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang disaksikan oleh (malaikat-malaikat) yang didekatkan} dihadiri oleh malaikat-malaikat yang didekatkan di setiap langit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 18-21 Setelah menyebutkan bahwa catatan amal orang-orang berdosa berada di tempat paling bawah dan sempit, selanjutnya Allah menyebutkan bahwa catatan amal orang-orang baik berada di tempat yang paling atas dan luas. Catatan amal mereka tertulis dan “disaksikan oleh malaikat-malaikat yang didekatkan (kepada Allah),” dari kalangan malaikat mulia, ruh para nabi, orang-orang jujur dalam beriman dan para syuhada’. Allah menyebutkan mereka di kalangan malaikat tertinggi. Dan illiyyun nama surga tertinggi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kitab-kitab orang beriman yang disimpan di tempat yang mulia disaksikan oleh para Malaikat yang mulia. Itulah kemuliaan orang yang beriman kepada Allah, kedudukan yang tinggi bagi orang yang beramal shalih dan mereka juga beriman kepada Rasul-rasul Allah, mereka mengamalkan apa yang tertulis dalam Al-Qur'an baik itu perintah maupun larangan, serta apa yang Rasulullah syari'atkan melalui sunnahnya mereka berlomba-lomba mengamalkannya, tempat kembali mereka pada hari kiamat sangatlah mulia dan penuh dengan kenikmatan dan kebahagiaan, ketika membaca ayat-ayat Allah tentang kenikmatan bagi orang beriman, seakan-akan semua itu nampak didepan kita, karena ayat-ayat itu benar-benar diturunkan dari Sang Maha Kuasa bukan dari dongeng orang terdahulu atau hayalan belaka, semua yang terkandung dalam Al-Qur'an diturun oleh Malikat yang mulia dari Sang Pencipta yang mulia ﷻ, Allah berfirman : { لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ } ( Yang tidak datang kepadanya (Al Quran) kebatilan baik dari depan maupun dari belakangnya, yang diturunkan dari Rabb Yang Maha Bijaksana lagi Maha Terpuji. ) [ Fussilat : 42 ] , dengan Al-Qur'an mata orang-orang beriman terasa sejuk dan nyaman mereka selalu bergantung padanya, sedangkan orang-orang kafir hanya bergantung kepada khurafat-khurafat yang mengandung kebohongan dan tipu daya syaithon, mereka menjauh dari Al-Qur'an dan menjadikan bait-bait syair dan lantunan lagu sebagai pedoman hidup, menjauh dari Al-Qur'an dan mencari perkataan-perkataan bathil, seperti itulah kehidupan orang-orang celaka yang jauh dari cahaya Al-Qur'an."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَشْهَدُهُ الْمُقَرَّبُونَ “yang disaksikan oleh orang-orang yang didekatkan (kepada Allah). ” Menyaksikannya: Maknanya: Menghadirinya, atau dipersaksikan oleh muqarrabun [yang didekatkan] maksudnya adalah orang-orang yang didekatkan di sisi Allah. Mereka adalah orang yang mendekatkan diri kepada Allah dengan mentaati-Nya. Setiap kali seorang insan lebih banyak melakukan ketaatan kepada Allah maka di akan lebih dekat dengan Allah, setiap kali seorang insan merendahkan diri kepada Allah maka ia akan lebih mulia di sisi Allah, ia akan lebih tinggi di sisi Allah. Allah Ta’ala berfirman: يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ “niscaya Allah akan meninggikan orang-orang yang beriman di antaramu dan orang-orang yang diberi ilmu pengetahuan beberapa derajat. Dan Allah Maha Mengetahui apa yang kamu kerjakan.” (QS. Al-Mujadalah: 11) dengan demikian, Muqarrabun adalah orang-orang yang mendekatkan diri kepada Allah Ta’ala dengan amalan-amalan saleh, sehingga Allah mendekatkan mereka ke sisi-Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 21: 20-21. Kemudian Allah jelaskan tentang kitab orang-orang yang berhasil yaitu kitab yang tertulis di dalmnya amalan-amalan mereka (pemiliknya). Dan kitab tersebut ada di tempat yang tinggi, di ketinggian yang melebihi derajat surga. Para malaikat hadir di sana dan menjadi saksi mereka (orang-orang yang berhasil) atas apa yang ada dalam isi kitab tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 21",
    "description": "Itulah kitab yang berada di tempat yang luhur, yang disaksikan oleh malaikat-malaikat yang didekatkan kepada Allah karena kepatuhan mereka. Kesaksian malaikat terhadap catatan amal orang-orag mukmin menunjukkan kebenaran isi kitab itu dan penghormatan kepada penerimanya. 22. Demikianlah buku catatan amal orang yang berbakti. Sesungguhnya orang-orang yang berbakti benar-benar berada dalam surga yang penuh kenikmatan. Itulah surga yang penuh kenikmatan yang tidak terbayang sebelumnya dalam benak manusia mana pun. Kenikmatan itu abadi, tidak pernah membosankan apalagi berkurang."
  }
]