[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-28. Sesungguhnya orang-orang yang jujur dan taat berada di dalam surga, Mereka mendapatkan kenikmatan di atas ranjang-ranjang,mereka melihat kepala tuhan mereka dan kepada kebaikan-kebaikan yang disiapkan bagi mereka. Kamu melihat tanda kenikmatan pada wajah mereka. Mereka diberi minumam khamer yang bening,yang wadah-wadahnya bagus, yang akhirnya adalah aroma kasturi. Hendaknya orang-orang berlomba-lomba untuk mendapatkan kenikmatan yang abadi ini. Minuman ini campurannya adalah mata air di surga yang dikenal dengan nama “tasnim” karena ketinggiannya, Yaitu mata air yang disipkan untuk minuman orang orang yang di dekatkan (Kepada ALLAH),mereka menikmatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Sesungguhnya orang-orang yang memperbanyak ketaatan pasti akan berada di dalam kenikmatan abadi pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-28. Allah memberi kabar gembira bagi orang-orang baik itu dengan apa yang telah Dia siapkan bagi mereka di surga; mereka berada di derajat yang mulia dan kenikmatan yang kekal, di atas dipan-dipan indah sambil melihat kepada berbagai macam kenikmatan, dan kenikmatan yang paling besar adalah dapat melihat Allah. Kamu dapat melihat wajah mereka berseri-seri dan gembira. Para pelayan surga akan memberi mereka minuman dari khamr yang lezat yang tempatnya tertutup dengan misk yang sangat wangi. Pada kedudukan yang tinggi dan mulia itu, orang-orang saling berlomba untuk mendapatkannya. Dan minuman yang beraroma misk itu berasal dari mata air yang bernama ‘Tasnim’ yang dikhususkan bagi orang-orang yang berada di derajat yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22-23. Sesungguhnya orang-orang yang beriman dan taat benar-benar akan mendapat kenikmatan surga yang abadi. Mereka di atas dipan-dipan sambil melihat semua nikmat dan kemuliaan yang diberikan kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang berbakti benar-benar berada dalam kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 22-28 Pada saat menyebutkan catatan amal mereka, Allah menyebutkan bahwa mereka berada dalam kenikmatan. Nikmat adalah kata menyeluruh untuk kenikmatan hati, ruh, dan raga. “Mereka (duduk) di atas dipan-dipan,” yakni di atas dipan yang berhiaskan hamparan indah, “sambil memandang” segala kenikmatan yang disiapkan Allah untuk mereka dan mereka memandang wajah Rabb mereka Yang Mulia. “Kamu dapat mengetahui,” wahai orang yang memandang, “dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.” Yakni kebahagiaan, keindahan, dan keasrian karena kenikmatan, kegembiraan, dan kebahagiaan membuat wajah berseri, indah, dan asri. “Mereka diberi minum dari khamar murni,” yang merupakan minuman yang paling nikmat dan lezat, “yang dilak (tempatnya),” minuman tersebut “laknya adalah kasturi,” kemungkinan yang dimaksudkan adalah tertutup agar tidak dimasuki sesuatu yang bisa mengurangi kenikmatannya dan bisa merusak cita rasanya. Penutupnya adalah minyak kasturi. Kemungkinan lain yang dimaksud adalah yang ada di ujung bejana yang mereka minum adalah minyak kasturi jenis azfar. Cawan ini seperti biasanya di dunia menjadi tempat untuk menuangkan, seperti itu juga di dalam surga. “Dan untuk demikkian itu,” yakni nikmat abadi yang kebaikan dan ukurannya hanya diketahui Allah semata, “hendaknya orang berlomba-lomba,” yaitu hendaklah mereka saling berlomba-lomba dan bersegera menujunya serta melakukan amalan yang menghantarkan padanya. Inilah hal utama di mana jiwa yang paling berharga perlu dikorbankan dan ia adalah sesuatu yang paling layak diperebutkan oleh guna mencapainya. Dan campuran minuman ini “adalah dari tasnim” yaitu mata air “yang meminum darinya orang-orang yang didekatkan” yaitu mata air yang paling tinggi di surga yang dikhususkan bagi mereka yang dekat dengan Allah, yang derajatnya paling tinggi dan dicampurkan bagi golongan kanan. Dicampurkan dengan khamar dan minuman nikmat lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sesungguhnya orang-orang yang beramal shalih bagi mereka kenikmatan yang tidak pernah terbayang dibenak mereka melainkan hanya Allah ﷻ yang mengetahuinya, berbeda dengan kaum kuffar yang tempat kembali mereka telah ditetapkan bahwa mereka pasti akan masuk kedalam jahannam yang paling panas, dlam ayat lain dikatakan : { وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ } ( Dan sesungguhnya orang-orang yang durhaka benar-benar berada dalam neraka. ) [ Al-Infitar : 14 ]. { إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ } Bagi orang-orang yang beramal shalih kenikmatan di akhirat, dan bagi mereka pula kedudukan yang agung disana, serta kenikmatan didunia yaitu ketenangan hati,dan ketentraman jiwa, lain halnya dengan orang-orang kafir kehidupan mereka dipenuhi dengan kegundahan hati dan permasalahn dunia, bahkan masalah-masalah yang menimpa mereka sering menyebabkan terjadinya bunuh diri dantara mereka, orang-orang yang beriman kepada Allah hidup mereka penuh dengan kebahagiaan didunia, jika masalah datang menimpa, maka sabarlah menjadi penawarya, dan jika tertimpa kesenanan, mereka bersyukur kepada Allah ﷻ, dan kesyukuran itu nikmat bagi mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ الْأَبْرَارَ الْأَبْرَار [al-Abraar] adalah bentuk jamak dari بَر [Barr] sedangkan alBarr adalah yang banyak kebaikannya, banyak ketaatannya, banyak berbuat baiknya dalam ibadah kepada Allah dan berbuat baik kepada hamba-hamba Allah, Mereka adalah orang-orang yang baik yang mendapatkan karunia dari Allah untuk berbuat baik dan meninggalkan kemungkaran لَفِي نَعِيمٍ “benar-benar dalam kenikmatan” Kenikmatan di sini mencakup kenikmatan badan dan kenikmatan hati, ada pun kenikamatan badan maka tidak perlu ditanya lagi, sungguh Allah subhaanahu Wa Ta’ala berfirman tentang surga: وَفِيهَا مَا تَشْتَهِيهِ الْأَنْفُسُ وَتَلَذُّ الْأَعْيُنُ وَأَنْتُمْ فِيهَا خَالِدُونَ “dan di dalam surga itu terdapat segala apa yang diinginkan oleh hati dan sedap (dipandang) mata dan kalian kekal di dalamnya.”(QS. Az-Zukhruf: 71) Allah Ta’ala juga berfirman: فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ “Seorang pun tidak mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyedapkan pandangan mata sebagai balasan terhadap apa yang telah mereka kerjakan.”(QS. As-Sajdah: 17) Maksud dari kenikmatan hati, maka tidak perlu ditanya juga. Akan dikatakan kepada mereka, setelah mereka menyaksikan disembelihnya kematian: Hai penduduk surga, abadi tidak ada kematian. Dan dikatakan kepada mereka: Masuklah dengan keselamatan, dan dikatakan juga: Kalian akan merasakan kenikmatan dan tidak akan ditimpa keburukan selamanya, kalian akan sehat dan tidak akan pernah sakit selamanya, kalian akan senantiasa awet muda dan tidak akan menua selamanya. Semua itu adalah yang memasukkan kebahagiaan ke dalam hati, maka dengan begitu mereka memperoleh kenikmatan jiwa dan raga. Para malaikat akan masuk menemui mereka dari semua pintu surga, mereka akan mengatakan: Keselamatan bagi kalian karena kesabaran kalian. Betapa nikmatnya negeri akhirat ini. semoga Allah menjadikan kita termasuk dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 22: 22-24. Kemudian panjang lebar disebutkan apa yang disebut kenikmatan bagi orang-orang yang berhasil (dengan sebab ketaatan pada Allah). Mereka (orang-orang yang berhasil) hidup bersama keluarga mereka di tempat yang tinggi, mereka semua melihat apa yang dijanjikan oleh Allah dari kenikmatan yang terus akan didapati. Dan dikatakan bahwa mereka melihat wajah Allah Yang Mulia (Kami meminta kepada Allah dan karunia-Nya). Jika engkau melihat wajah-wajah mereka, engkau akan dapati kemulian, kebahagian, cahaya dan kesegaran atas wajah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan kitab catatan amal orang-orang yang berbakti, maka Dia menyebutkan bahwa mereka berada di dalam na’iim atau kenikmatan; yang mencakup kenikmatan bagi hati, bagi ruh dan bagi badan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 22",
    "description": "Demikianlah buku catatan amal orang yang berbakti. Sesungguhnya orang-orang yang berbakti benar-benar berada dalam surga yang penuh kenikmatan. Itulah surga yang penuh kenikmatan yang tidak terbayang sebelumnya dalam benak manusia mana pun. Kenikmatan itu abadi, tidak pernah membosankan apalagi berkurang. 23. Mereka yang berbakti itu duduk di atas dipan-dipan melepas pandangan ke arah pemandangan yang indah, menenangkan, dan mendamaikan. Inilah kebahagiaan hakiki, balasan bagi orang yang taat dan patuh kepada Allah."
  }
]