[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-28. Sesungguhnya orang-orang yang jujur dan taat berada di dalam surga, Mereka mendapatkan kenikmatan di atas ranjang-ranjang,mereka melihat kepala tuhan mereka dan kepada kebaikan-kebaikan yang disiapkan bagi mereka. Kamu melihat tanda kenikmatan pada wajah mereka. Mereka diberi minumam khamer yang bening,yang wadah-wadahnya bagus, yang akhirnya adalah aroma kasturi. Hendaknya orang-orang berlomba-lomba untuk mendapatkan kenikmatan yang abadi ini. Minuman ini campurannya adalah mata air di surga yang dikenal dengan nama “tasnim” karena ketinggiannya, Yaitu mata air yang disipkan untuk minuman orang orang yang di dekatkan (Kepada ALLAH),mereka menikmatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. di atas kasur-kasur yang berhias melihat kepada Rabb mereka dan kepada semua yang menyenangkan hati serta menggembirakan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. عَلَى الْأَرَآئِكِ (mereka (duduk) di atas dipan-dipan) Makna (الأرائك) yakni dipan yang ada di dalam kelambu. يَنظُرُونَ (sambil memandang) Yakni memandang kepada kenikmatan yang telah disiapkan Allah bagi mereka. Pendapat lain mengatakan: yakni memandang ke wajah Allah Ta’ala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22-23. Sesungguhnya orang-orang yang beriman dan taat benar-benar akan mendapat kenikmatan surga yang abadi. Mereka di atas dipan-dipan sambil melihat semua nikmat dan kemuliaan yang diberikan kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di atas dipan-dipan} dipan-dipan yang dihias {dengan memandang} memandang Tuhan mereka, dan kemuliaan yang disediakan untuk mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 22-28 Pada saat menyebutkan catatan amal mereka, Allah menyebutkan bahwa mereka berada dalam kenikmatan. Nikmat adalah kata menyeluruh untuk kenikmatan hati, ruh, dan raga. “Mereka (duduk) di atas dipan-dipan,” yakni di atas dipan yang berhiaskan hamparan indah, “sambil memandang” segala kenikmatan yang disiapkan Allah untuk mereka dan mereka memandang wajah Rabb mereka Yang Mulia. “Kamu dapat mengetahui,” wahai orang yang memandang, “dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.” Yakni kebahagiaan, keindahan, dan keasrian karena kenikmatan, kegembiraan, dan kebahagiaan membuat wajah berseri, indah, dan asri. “Mereka diberi minum dari khamar murni,” yang merupakan minuman yang paling nikmat dan lezat, “yang dilak (tempatnya),” minuman tersebut “laknya adalah kasturi,” kemungkinan yang dimaksudkan adalah tertutup agar tidak dimasuki sesuatu yang bisa mengurangi kenikmatannya dan bisa merusak cita rasanya. Penutupnya adalah minyak kasturi. Kemungkinan lain yang dimaksud adalah yang ada di ujung bejana yang mereka minum adalah minyak kasturi jenis azfar. Cawan ini seperti biasanya di dunia menjadi tempat untuk menuangkan, seperti itu juga di dalam surga. “Dan untuk demikkian itu,” yakni nikmat abadi yang kebaikan dan ukurannya hanya diketahui Allah semata, “hendaknya orang berlomba-lomba,” yaitu hendaklah mereka saling berlomba-lomba dan bersegera menujunya serta melakukan amalan yang menghantarkan padanya. Inilah hal utama di mana jiwa yang paling berharga perlu dikorbankan dan ia adalah sesuatu yang paling layak diperebutkan oleh guna mencapainya. Dan campuran minuman ini “adalah dari tasnim” yaitu mata air “yang meminum darinya orang-orang yang didekatkan” yaitu mata air yang paling tinggi di surga yang dikhususkan bagi mereka yang dekat dengan Allah, yang derajatnya paling tinggi dan dicampurkan bagi golongan kanan. Dicampurkan dengan khamar dan minuman nikmat lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ عَلَى الْأَرَائِكِ } yakni : tempat-tempat duduk yang tinggi ( dipan ), dan tidak satupun yang mengetahui bentuknya kecuali Allah ﷻ, bukan seperti tempat duduk yang ada didunia : ( sofa ) seperti yang kita istilahkan dalam kehidupan kita. Diatas dipan itu mereka duduk sambil memandang tuhan mereka, juga memandang kepada kenikmatan yang ada disekitar mereka, mereka juga melihat ke musuh-musuh mereka yang sedang disiksa didalam neraka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Dan Firman-Nya: عَلَى الْأَرَائِكِ “”الْأَرَائِكِ [al-Araa’ik] adalah jamak dari أَرِيْكَة [Ariikatun] maknanya adalah dipan atau kasur yang dihiasi hiasan dan ada teduhannya, ini adalah jenis dipan yang termewah. Mereka di atas dipan-dipan yang indah lagi mewah itu يَنْظُرُونَ Akan melihat kenikmatan yang Allah berikan yang tidak dapat terjangkau oleh jiwa-jiwa sekarang. فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ “Seorang pun tidak mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyedapkan pandangan mata”(QS. As-Sajdah: 17) Sebagian ulama mengatakan: Pandangan tersebut termasuk memandak kepada wajah Allah. Para ulama menjadikan ayat ini di antara dalil yang menunjukkan ketatapan adanya melihat Allah ‘Azza Wa Jalla di surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 23: 22-24. Kemudian panjang lebar disebutkan apa yang disebut kenikmatan bagi orang-orang yang berhasil (dengan sebab ketaatan pada Allah). Mereka (orang-orang yang berhasil) hidup bersama keluarga mereka di tempat yang tinggi, mereka semua melihat apa yang dijanjikan oleh Allah dari kenikmatan yang terus akan didapati. Dan dikatakan bahwa mereka melihat wajah Allah Yang Mulia (Kami meminta kepada Allah dan karunia-Nya). Jika engkau melihat wajah-wajah mereka, engkau akan dapati kemulian, kebahagian, cahaya dan kesegaran atas wajah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada kenikmatan yang Allah sediakan untuk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 23",
    "description": "Mereka yang berbakti itu duduk di atas dipan-dipan melepas pandangan ke arah pemandangan yang indah, menenangkan, dan mendamaikan. Inilah kebahagiaan hakiki, balasan bagi orang yang taat dan patuh kepada Allah. 24. Wajah-wajah mereka berseri. Kamu dapat mengetahui dari wajah mereka kesenangan hidup yang penuh kenikmatan."
  }
]