[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-28. Sesungguhnya orang-orang yang jujur dan taat berada di dalam surga, Mereka mendapatkan kenikmatan di atas ranjang-ranjang,mereka melihat kepala tuhan mereka dan kepada kebaikan-kebaikan yang disiapkan bagi mereka. Kamu melihat tanda kenikmatan pada wajah mereka. Mereka diberi minumam khamer yang bening,yang wadah-wadahnya bagus, yang akhirnya adalah aroma kasturi. Hendaknya orang-orang berlomba-lomba untuk mendapatkan kenikmatan yang abadi ini. Minuman ini campurannya adalah mata air di surga yang dikenal dengan nama “tasnim” karena ketinggiannya, Yaitu mata air yang disipkan untuk minuman orang orang yang di dekatkan (Kepada ALLAH),mereka menikmatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Jika kamu melihat mereka, maka kamu lihat di wajah-wajah mereka tanda kenikmatan yang indah dan anggun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. تَعْرِفُ فِى وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ (Kamu dapat mengetahui dari wajah mereka kesenangan mereka yang penuh kenikmatan) Yakni jika kamu melihatnya pasti kamu akan mengetahui bahwa mereka adalah orang-orang yang mendapatkan kenikmatan, karena kamu melihat wajah mereka bercahaya, dan berseri-seri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dari wajah mereka terpancar wajah orang-orang baik dan raut suka cita bersinar atas nikmat yang mereka dapatkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu dapat mengetahui pada wajah mereka terdapat gemerlap} kebahagiaan dan keindahan {kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 22-28 Pada saat menyebutkan catatan amal mereka, Allah menyebutkan bahwa mereka berada dalam kenikmatan. Nikmat adalah kata menyeluruh untuk kenikmatan hati, ruh, dan raga. “Mereka (duduk) di atas dipan-dipan,” yakni di atas dipan yang berhiaskan hamparan indah, “sambil memandang” segala kenikmatan yang disiapkan Allah untuk mereka dan mereka memandang wajah Rabb mereka Yang Mulia. “Kamu dapat mengetahui,” wahai orang yang memandang, “dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.” Yakni kebahagiaan, keindahan, dan keasrian karena kenikmatan, kegembiraan, dan kebahagiaan membuat wajah berseri, indah, dan asri. “Mereka diberi minum dari khamar murni,” yang merupakan minuman yang paling nikmat dan lezat, “yang dilak (tempatnya),” minuman tersebut “laknya adalah kasturi,” kemungkinan yang dimaksudkan adalah tertutup agar tidak dimasuki sesuatu yang bisa mengurangi kenikmatannya dan bisa merusak cita rasanya. Penutupnya adalah minyak kasturi. Kemungkinan lain yang dimaksud adalah yang ada di ujung bejana yang mereka minum adalah minyak kasturi jenis azfar. Cawan ini seperti biasanya di dunia menjadi tempat untuk menuangkan, seperti itu juga di dalam surga. “Dan untuk demikkian itu,” yakni nikmat abadi yang kebaikan dan ukurannya hanya diketahui Allah semata, “hendaknya orang berlomba-lomba,” yaitu hendaklah mereka saling berlomba-lomba dan bersegera menujunya serta melakukan amalan yang menghantarkan padanya. Inilah hal utama di mana jiwa yang paling berharga perlu dikorbankan dan ia adalah sesuatu yang paling layak diperebutkan oleh guna mencapainya. Dan campuran minuman ini “adalah dari tasnim” yaitu mata air “yang meminum darinya orang-orang yang didekatkan” yaitu mata air yang paling tinggi di surga yang dikhususkan bagi mereka yang dekat dengan Allah, yang derajatnya paling tinggi dan dicampurkan bagi golongan kanan. Dicampurkan dengan khamar dan minuman nikmat lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kamu bisa mengetahui dari wajah-wajah mereka bahwasanya mereka adalah orang yang beramal shalih, terpancar dari wajah mereka cahaya yang menujukkan sifat tersebut, ada kegembiraan dan kebahagiaan mengiasi wajah-wajah mereka, berbeda dengan wajah orang-orang kafir, Allah ﷻ berfirman : { وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ , تَرْهَقُهَا قَتَرَةٌ , أُولَٰئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ } ( Dan banyak (pula) muka pada hari itu tertutup debu , Dan ditutup lagi oleh kegelapan , Mereka itulah orang-orang kafir lagi durhaka. ) [ Abasa : 40-42 ] wajah orang-orang kafir pada hari kiamat menjadi gelap, sedangkan orang-orang beriman wajah mereka bersinar dengan cahaya iman . { تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ } , makna \" النضرة \" : kebahagiaan, kesenangan, suka cita, sifat-sifat ini nampak di wajah mereka yang beriman kepada Allah ﷻ, dari wajah sesorang dapat diketahui bagaimana keadaan dirinya, baik dikala dia senang ataupun sedang dalam kesedihan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ \" Kamu dapat mengetahui dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.\" Maknanya: Engkau mengetahui hai yang memandang mereka فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ “” Maknanya: bagus dan indahnya kenikmatan itu, maknanya: menikmati, kalian pun menyaksikannya sekarang di dunia bahwa orang-orang yang menikmati dan yang hidup mewah tidak sama dengan wajah orang-orang yang bekerja keras dan bekerja, anda akan mendapatinya cerah, senang. Penduduk surga engkau ketahui pada wajah mereka ada kecerahan dan kebahagiaan, karena mereka dalam kondisi yang paling senang dan paling menikmati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 24: 22-24. Kemudian panjang lebar disebutkan apa yang disebut kenikmatan bagi orang-orang yang berhasil (dengan sebab ketaatan pada Allah). Mereka (orang-orang yang berhasil) hidup bersama keluarga mereka di tempat yang tinggi, mereka semua melihat apa yang dijanjikan oleh Allah dari kenikmatan yang terus akan didapati. Dan dikatakan bahwa mereka melihat wajah Allah Yang Mulia (Kami meminta kepada Allah dan karunia-Nya). Jika engkau melihat wajah-wajah mereka, engkau akan dapati kemulian, kebahagian, cahaya dan kesegaran atas wajah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu karena berulang-ulang dan terus-menerusnya mereka mendapatkan kesenangan dapat mencerahkan muka, menghiasnya dan memperindahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 24",
    "description": "Wajah-wajah mereka berseri. Kamu dapat mengetahui dari wajah mereka kesenangan hidup yang penuh kenikmatan. 25. Mereka diberi minum dari khamar murni yang tidak memabukkan, yang tempatnya masih dilak dan disegel sehingga isinya terjaga keaslian serta kesegarannya, dan belum pernah ada yang meminum bahkan menyentuhnya."
  }
]