[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-28. Sesungguhnya orang-orang yang jujur dan taat berada di dalam surga, Mereka mendapatkan kenikmatan di atas ranjang-ranjang,mereka melihat kepala tuhan mereka dan kepada kebaikan-kebaikan yang disiapkan bagi mereka. Kamu melihat tanda kenikmatan pada wajah mereka. Mereka diberi minumam khamer yang bening,yang wadah-wadahnya bagus, yang akhirnya adalah aroma kasturi. Hendaknya orang-orang berlomba-lomba untuk mendapatkan kenikmatan yang abadi ini. Minuman ini campurannya adalah mata air di surga yang dikenal dengan nama “tasnim” karena ketinggiannya, Yaitu mata air yang disipkan untuk minuman orang orang yang di dekatkan (Kepada ALLAH),mereka menikmatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Pelayan-pelayan memberikan kepada mereka minuman khamar yang disegel bejananya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. يُسْقَوْنَ مِن رَّحِيقٍ مَّخْتُومٍ (Mereka diberi minum dari khamar murni yang dilak (tempatnya)) Makna (الرحيق) adalah khamr yang murni tanpa campuran apapun yang dapat merusaknya. Sedangkan (المختوم) yakni yang memiliki segel. Khamr itu terlarang bagi tangan siapapun hingga orang-orang taat itulah yang membuka segelnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Mereka diberi minuman yang sangat murni, tidak palsu dan tidak rusak. Yaitu khamr yang tidak memabukkan. Minuman dan bahkan wadahnya-pun tidak pernah tersentuh oleh tangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka diberi minum dari khamr murni} khamr murni {yang masih terkunci} yang wadahnya masih terkunci"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 22-28 Pada saat menyebutkan catatan amal mereka, Allah menyebutkan bahwa mereka berada dalam kenikmatan. Nikmat adalah kata menyeluruh untuk kenikmatan hati, ruh, dan raga. “Mereka (duduk) di atas dipan-dipan,” yakni di atas dipan yang berhiaskan hamparan indah, “sambil memandang” segala kenikmatan yang disiapkan Allah untuk mereka dan mereka memandang wajah Rabb mereka Yang Mulia. “Kamu dapat mengetahui,” wahai orang yang memandang, “dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.” Yakni kebahagiaan, keindahan, dan keasrian karena kenikmatan, kegembiraan, dan kebahagiaan membuat wajah berseri, indah, dan asri. “Mereka diberi minum dari khamar murni,” yang merupakan minuman yang paling nikmat dan lezat, “yang dilak (tempatnya),” minuman tersebut “laknya adalah kasturi,” kemungkinan yang dimaksudkan adalah tertutup agar tidak dimasuki sesuatu yang bisa mengurangi kenikmatannya dan bisa merusak cita rasanya. Penutupnya adalah minyak kasturi. Kemungkinan lain yang dimaksud adalah yang ada di ujung bejana yang mereka minum adalah minyak kasturi jenis azfar. Cawan ini seperti biasanya di dunia menjadi tempat untuk menuangkan, seperti itu juga di dalam surga. “Dan untuk demikkian itu,” yakni nikmat abadi yang kebaikan dan ukurannya hanya diketahui Allah semata, “hendaknya orang berlomba-lomba,” yaitu hendaklah mereka saling berlomba-lomba dan bersegera menujunya serta melakukan amalan yang menghantarkan padanya. Inilah hal utama di mana jiwa yang paling berharga perlu dikorbankan dan ia adalah sesuatu yang paling layak diperebutkan oleh guna mencapainya. Dan campuran minuman ini “adalah dari tasnim” yaitu mata air “yang meminum darinya orang-orang yang didekatkan” yaitu mata air yang paling tinggi di surga yang dikhususkan bagi mereka yang dekat dengan Allah, yang derajatnya paling tinggi dan dicampurkan bagi golongan kanan. Dicampurkan dengan khamar dan minuman nikmat lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mereka diberi minum dari air yang sanga manis, yaitu khamar, ya.. khamar yang dibolehkan untuk diminum pada hari akhir nanti, berbeda dengan khamar didunia yang mengandung bahan berbahaya yang dapat menghilangkan akal manusia, sedangkan khamar di akhirat terbebas dari semua bahan-bahan berbahaya tersebut dan tentunya sangan baik bagi siapa yang meminumnya, Allah berfirman : { لَا يُصَدَّعُونَ عَنْهَا وَلَا يُنْزِفُونَ } ( Mereka tidak pening karenanya dan tidak pula mabuk ) [Al-Waqi'ah : 19 ] yakni mereka tidak merasa pusing karena meminum khamar di akhirat, dan tidak pula mereka akan mabuk dan kehilangan akal, dan minuman mereka disiapkan diwadah yang sangat bagus."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Dalam menjelaskan kenikmatan yang mereka peroleh, Allah Ta’ala berfirman: يُسْقَوْنَ مِنْ رَحِيقٍ مَخْتُومٍ “Mereka diberi minum dari khamar murni yang dilak (tempatnya),” kata ganti yang terkandung pada kata يُسْقَوْنَ kembail pada al-abraar. Allah Ta’ala akan menuangkan untuk mereka dari tangan para pembantu yang Allah sebutkan ciri-cirinya dengan firman-Nya: يَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُخَلَّدُونَ (17) بِأَكْوَابٍ وَأَبَارِيقَ وَكَأْسٍ مِنْ مَعِينٍ (18) لَا يُصَدَّعُونَ عَنْهَا وَلَا يُنْزِفُونَ “Mereka dikelilingi oleh anak-anak muda yang tetap muda, dengan membawa gelas, cerek dan sloki (piala) berisi minuman yang diambil dari air yang mengalir, mereka tidak pusing karenanya dan tidak pula mabuk,” (QS. Al-Waqi'ah: 17-19) يُسْقَوْنَ مِنْ رَحِيقٍ Maknanya: Dari minuman khamer yang jernih, tidak tercampur dan tidak membahayakan ke akal, tidak pula menimbulkan rasa sakit ke kepala. Berbeda dengan khamer di dunia, yang membuat hilang akal dan membuat pusing kepala. Sungguh itu adalah minuman terlezat yang jernih, tidak mengandung zat berbahaya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 25: 25-27. Dan dari nikmat yang didapatkan orang-orang yang berhasil adalah diberikan minuman dari khamr yang putih bening; Dan khamr tersebut disimpan rapat-rapat dan terkunci. Tidaklah terbuka kecuali dapat dibuka oleh pemiliknya, dan jika mereka meminumnya, Tercium bau semerbak wangi misk oleh yang lainnya, tidak memabukkan. Dan untuk mendapatkannya, seyogyanya manusia saling bergegas dan berlomba-lomba dengan ikhlas ibadah kepada Allah, mengerjakan apa yang dicintai oleh Allah dan diridhai-Nya, kemudian meninggalkan apa yang membuat Allah marah dan abai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang merupakan minuman yang paling enak dan paling nikmat. Bisa maksud ‘makhtum’ adalah ditutup dari dimasuki sesuatu yang mengurangi kenikmatannya atau merusak rasanya. Penutupnya adalah minyak kesturi. Bisa juga maksudnya akhir gelas atau ampas yang mereka minum khamr murni darinya adalah minyak kesturi yang sangat wangi yang biasanya di dunia ampas itu ditumpahkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 25",
    "description": "Mereka diberi minum dari khamar murni yang tidak memabukkan, yang tempatnya masih dilak dan disegel sehingga isinya terjaga keaslian serta kesegarannya, dan belum pernah ada yang meminum bahkan menyentuhnya. 26. Khamar itu dilak dengan rapat, di mana laknya berasal dari kasturi yang beraroma harum dan menyegarkan. Bagusnya lak menunjukkan khamr itu sangat baik dan berkualitas. Dan untuk yang demikian itu hendaknya orang berlomba-lomba untuk mendapatkan kebahagiaan tersebut, yakni dengan banyak beribadah dan beramal saleh."
  }
]