[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-28. Sesungguhnya orang-orang yang jujur dan taat berada di dalam surga, Mereka mendapatkan kenikmatan di atas ranjang-ranjang,mereka melihat kepala tuhan mereka dan kepada kebaikan-kebaikan yang disiapkan bagi mereka. Kamu melihat tanda kenikmatan pada wajah mereka. Mereka diberi minumam khamer yang bening,yang wadah-wadahnya bagus, yang akhirnya adalah aroma kasturi. Hendaknya orang-orang berlomba-lomba untuk mendapatkan kenikmatan yang abadi ini. Minuman ini campurannya adalah mata air di surga yang dikenal dengan nama “tasnim” karena ketinggiannya, Yaitu mata air yang disipkan untuk minuman orang orang yang di dekatkan (Kepada ALLAH),mereka menikmatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Semerbak bau minyak kesturi sampai pada puncaknya. Demi mendapatkan ganjaran yang mulia ini, hendaknya orang berlomba-lomba untuk mendapatkannya dengan mengamalkan apa yang diridai Allah dan meninggalkan apa yang dimurkai-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. خِتٰمُهُۥ مِسْكٌ ۚ (laknya adalah kesturi) Yakni penghujung rasanya beraroma Kasturi. Yakni jika orang yang meminumnya telah menjauhkan bibirnya dari minuman itu maka ia akan mencium aroma seperti aroma Kasturi. Pendapat lain mengatakan: yakni wadahnya tersegel dengan Kasturi. وَفِى ذٰلِكَ فَلْيَتَنَافَسِ الْمُتَنٰفِسُونَ (dan untuk yang demikian itu hendaknya orang berlomba-lomba) Yakni handaklah orang-orang menginginkannya sehingga mereka saling berlomba-lomba untuk mendapatkannya dan tidak memberikan kepada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Penutup meja sajiannya tercium harum minyak kasturi. Maka senanglah mereka semua. Mereka berlomba-lomba dalam ketaatan kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Laknya dari kasturi} akhir rasanya beraroma kasturi {Untuk yang demikian itu hendaknya orang berlomba-lomba"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 22-28 Pada saat menyebutkan catatan amal mereka, Allah menyebutkan bahwa mereka berada dalam kenikmatan. Nikmat adalah kata menyeluruh untuk kenikmatan hati, ruh, dan raga. “Mereka (duduk) di atas dipan-dipan,” yakni di atas dipan yang berhiaskan hamparan indah, “sambil memandang” segala kenikmatan yang disiapkan Allah untuk mereka dan mereka memandang wajah Rabb mereka Yang Mulia. “Kamu dapat mengetahui,” wahai orang yang memandang, “dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.” Yakni kebahagiaan, keindahan, dan keasrian karena kenikmatan, kegembiraan, dan kebahagiaan membuat wajah berseri, indah, dan asri. “Mereka diberi minum dari khamar murni,” yang merupakan minuman yang paling nikmat dan lezat, “yang dilak (tempatnya),” minuman tersebut “laknya adalah kasturi,” kemungkinan yang dimaksudkan adalah tertutup agar tidak dimasuki sesuatu yang bisa mengurangi kenikmatannya dan bisa merusak cita rasanya. Penutupnya adalah minyak kasturi. Kemungkinan lain yang dimaksud adalah yang ada di ujung bejana yang mereka minum adalah minyak kasturi jenis azfar. Cawan ini seperti biasanya di dunia menjadi tempat untuk menuangkan, seperti itu juga di dalam surga. “Dan untuk demikkian itu,” yakni nikmat abadi yang kebaikan dan ukurannya hanya diketahui Allah semata, “hendaknya orang berlomba-lomba,” yaitu hendaklah mereka saling berlomba-lomba dan bersegera menujunya serta melakukan amalan yang menghantarkan padanya. Inilah hal utama di mana jiwa yang paling berharga perlu dikorbankan dan ia adalah sesuatu yang paling layak diperebutkan oleh guna mencapainya. Dan campuran minuman ini “adalah dari tasnim” yaitu mata air “yang meminum darinya orang-orang yang didekatkan” yaitu mata air yang paling tinggi di surga yang dikhususkan bagi mereka yang dekat dengan Allah, yang derajatnya paling tinggi dan dicampurkan bagi golongan kanan. Dicampurkan dengan khamar dan minuman nikmat lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ خِتَامُهُ مِسْكٌ } Penutup minuman itu memiliki aroma yang sangat bagus seperti minyak kesturi, atau dalam makna riwayat lain : akhir dari minuman itu memiliki aroma seperti kesturi, khamar yang manis dan baunya yang harum. { وَفِي ذَٰلِكَ } dengan nikmat itu , dan minuman yang istimewa itu { فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ } maka hendaklah setiap hamba berlomba-loba untuk meraih nikmat yang agung itu dengan memperbanyak amalan shalih, dan orang yang menang adalah mereka yang mampu meraih semua kenikmatan yang disiapkan bagi orang beriman di akhirat, bukan mereka yang mensia-siakan dunia dan akhiratnya dengan kemaksiatan. Seperti itulah yang seharusnya menjadi tujuan utama setiap manusia dalam menjalani hidupnya didunia, mereka berlomba-lomba dalam meraih segala kebaikan yang balasannya jauh lebih banyak dan lebih mulia, maka menjauh dari fitnah dunia yang hina ini adalah suatu kemualiaan yang besar, tapi pada hakikatnya mengambil kemewahan dunia boleh saja dengan mengukur sesuai kebutuhannya saja tanpa berlebihan, dan dengan harta itu ia jadikan sebagai wasilah untuk meningkatkan ketaqwaanya kepada Allah, dan tidak menjadikan kemewahan dunia sebagi tujuan hidupnya. { فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ } mereka adalah orang berlomba dalam mengumpulkan segala kebaikan didunia, mereka berlomba dalam menginfakkan hartanya, berlomba dalam memperbanyak ibadah, berlomba-loba dalam melaksanakan sunnah-sunnah Nabi ﷺ , seperti : shalat tahajjud, sedekah, dan shalat-shalat sunnah lainnya yang Rasulullah ﷺ pernah contohkan semasa hidupnya, dan seorang mukmin seharusnya tidak rela jika orang lain mendahuluinya dalam kebaikan"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "مَخْتُومٍ (25) خِتَامُهُ مِسْكٌ Maknanya: Sisa dan akhirnya misik, maksudnya beraroma wangi misik, berbeda dengan khamer dunia, yang berbau tidak sedap. Maka orang-orang baik setelah mereka menahan diri-diri mereka dari kelezatan yang diharamkan Allah kepada mereka di dunia, maka ia akan diberikan di hari kiamat. وَفِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ “dan untuk yang demikian itu hendaknya orang berlomba-lomba.” Maknanya: Kepada ganjaran dan balasan ini فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ Makananya: Hendaknya berlomba-lomba dengan sungguh-sungguh, sampai ke batasan nafas, itu adalah kinayah cepat dalam berlomba. Dikatakan: نَافَسْتُهُ [Naafastuhu] maknanya aku berlomba dengannya hingga nafas melampauiku. Berlomba yang sesungguhnya dalam kebaikan adalah berlomba kepada ketaatan kepada Allah ‘Azza Wa Jalla, kepada yang diridhai Allah subhaanahu wa Ta’ala, dan jauh dari murka Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 26: 25-27. Dan dari nikmat yang didapatkan orang-orang yang berhasil adalah diberikan minuman dari khamr yang putih bening; Dan khamr tersebut disimpan rapat-rapat dan terkunci. Tidaklah terbuka kecuali dapat dibuka oleh pemiliknya, dan jika mereka meminumnya, Tercium bau semerbak wangi misk oleh yang lainnya, tidak memabukkan. Dan untuk mendapatkannya, seyogyanya manusia saling bergegas dan berlomba-lomba dengan ikhlas ibadah kepada Allah, mengerjakan apa yang dicintai oleh Allah dan diridhai-Nya, kemudian meninggalkan apa yang membuat Allah marah dan abai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kenikmatan yang kekal itu, yang tidak diketahui indah dan besarnya kecuali oleh Allah Subhaanahu wa Ta'aala. Dengan bersegera mengerjakan amal yang dapat memasukkan ke dalamnya. Kenikmatan inilah yang seharusnya disiapkan segala yang berharga untuknya dan dikejar oleh orang-orang yang berakal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 26",
    "description": "Khamar itu dilak dengan rapat, di mana laknya berasal dari kasturi yang beraroma harum dan menyegarkan. Bagusnya lak menunjukkan khamr itu sangat baik dan berkualitas. Dan untuk yang demikian itu hendaknya orang berlomba-lomba untuk mendapatkan kebahagiaan tersebut, yakni dengan banyak beribadah dan beramal saleh. 27. Dan tidak hanya dilak dengan kasturi, campurannya dari tasnim."
  }
]