[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-28. Sesungguhnya orang-orang yang jujur dan taat berada di dalam surga, Mereka mendapatkan kenikmatan di atas ranjang-ranjang,mereka melihat kepala tuhan mereka dan kepada kebaikan-kebaikan yang disiapkan bagi mereka. Kamu melihat tanda kenikmatan pada wajah mereka. Mereka diberi minumam khamer yang bening,yang wadah-wadahnya bagus, yang akhirnya adalah aroma kasturi. Hendaknya orang-orang berlomba-lomba untuk mendapatkan kenikmatan yang abadi ini. Minuman ini campurannya adalah mata air di surga yang dikenal dengan nama “tasnim” karena ketinggiannya, Yaitu mata air yang disipkan untuk minuman orang orang yang di dekatkan (Kepada ALLAH),mereka menikmatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Yaitu mata air di Surga tertinggi, orang-orang yang didekatkan kepada Allah meminumnya dalam kondisi bersih dan murni. Demikian pula orang-orang mukmin yang lain minum darinya, ia bercampur dengan minuman yang lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ ((yaitu) mata air yang minum daripadanya orang-orang yang didekatkan kepada Allah) Yakni mereka meminum khamr murni dengan dicampur dengan air dari mata air surga dalam gelas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Tasnim: Mata air yang diminum oleh orang-orang yang baik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) mata air yang diminum} yang diminum {oleh mereka yang didekatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 22-28 Pada saat menyebutkan catatan amal mereka, Allah menyebutkan bahwa mereka berada dalam kenikmatan. Nikmat adalah kata menyeluruh untuk kenikmatan hati, ruh, dan raga. “Mereka (duduk) di atas dipan-dipan,” yakni di atas dipan yang berhiaskan hamparan indah, “sambil memandang” segala kenikmatan yang disiapkan Allah untuk mereka dan mereka memandang wajah Rabb mereka Yang Mulia. “Kamu dapat mengetahui,” wahai orang yang memandang, “dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.” Yakni kebahagiaan, keindahan, dan keasrian karena kenikmatan, kegembiraan, dan kebahagiaan membuat wajah berseri, indah, dan asri. “Mereka diberi minum dari khamar murni,” yang merupakan minuman yang paling nikmat dan lezat, “yang dilak (tempatnya),” minuman tersebut “laknya adalah kasturi,” kemungkinan yang dimaksudkan adalah tertutup agar tidak dimasuki sesuatu yang bisa mengurangi kenikmatannya dan bisa merusak cita rasanya. Penutupnya adalah minyak kasturi. Kemungkinan lain yang dimaksud adalah yang ada di ujung bejana yang mereka minum adalah minyak kasturi jenis azfar. Cawan ini seperti biasanya di dunia menjadi tempat untuk menuangkan, seperti itu juga di dalam surga. “Dan untuk demikkian itu,” yakni nikmat abadi yang kebaikan dan ukurannya hanya diketahui Allah semata, “hendaknya orang berlomba-lomba,” yaitu hendaklah mereka saling berlomba-lomba dan bersegera menujunya serta melakukan amalan yang menghantarkan padanya. Inilah hal utama di mana jiwa yang paling berharga perlu dikorbankan dan ia adalah sesuatu yang paling layak diperebutkan oleh guna mencapainya. Dan campuran minuman ini “adalah dari tasnim” yaitu mata air “yang meminum darinya orang-orang yang didekatkan” yaitu mata air yang paling tinggi di surga yang dikhususkan bagi mereka yang dekat dengan Allah, yang derajatnya paling tinggi dan dicampurkan bagi golongan kanan. Dicampurkan dengan khamar dan minuman nikmat lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mata air ( tasnim ) berada di ketinggian pada salah satu bagian di surga, sungai yang mengalir dari ketiggian surga itulah para penghuni surga ( al-muqorrobun ) mengambil air untuk mereka minum, karena orang beriman itu terbagi menjadi tiga tingkatan : TIngkatan pertama : ( فَمِنْهُمْ ظَالِمٌ لِنَفْسِهِ ) yaitu mereka yang menzholimi diri mereka ; dan mereka adalah para pelaku ( كبائر ) dosa-dosa besar, Allah mengampuni atau menghukum mereka tergantung seberapa berat dosa kemaksiatan mereka, lalu kemudian masuk ke surga, ya.. mereka telah menzholimi diri mereka sendiri, tapi sebenarnya mereka telah menyatakan keimanan mereka kepada Allah ﷻ , dan mereka bukan dari kaum kuffar karena dosa-dosa besar ( berbuat syirik ), maka masih ada sifat keimanan dalam diri mereka . TIngkatan yang kedua : ( وَمِنْهُمْ مُقْتَصِدٌ ) mereka yang melakukan amalan shalih tapi masih belum maksimal dalam melaksanakannya serta menjauhi kemaksiatan, sedangkan orang yang menzholimi diri mereka sendiri yaitu orang-orang yang beramal shalih, tapi bersama keimanan dan amalan shalih mereka, mereka juga gemar melakukan perbuatan tidak terpuji atau kemaksiatan. Tingkatan yang ketiga : ( المقربون ) dan inilah tingkatan yang paling tinggi { وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ } yaitu mereka yang beramal shalih dengan maksimal, melaksanakan kewajiban yang diperintahkan, dan menjauhi segala kemaksiatan dan perbuatan yang diharamkan dalam islam. المقربون : yaitu mereka yang melaksanakan semua kewajiban dan sunnah Rasulullah, mereka juga meninggalkan semua hal-hal diharaman dalam islam serta hal-hal yang dimakruhkan, mereka melakukan semua kebaikan dengan maksimal, maka kedudukan mereka disisi Allah lebih tinggi dari tingkatan yang lainnya, Allah ﷻ berfirman : { ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَ } ( Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami ) yakni Al-Qur'an, { فَمِنْهُمْ ظَالِمٌ لِنَفْسِهِ } ( lalu di antara mereka ada yang menganiaya diri mereka sendiri ) dengan kitab ini, { وَمِنْهُمْ مُقْتَصِدٌ } ( dan di antara mereka ada yang pertengahan ) yakni mereka hanya melaksanakanyang wajib saja dan meninggalkan yang diharamkan saja, { وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ بِإِذْنِ اللَّهِ ۚ} ( dan diantara mereka ada (pula) yang lebih dahulu berbuat kebaikan dengan izin Allah ) yaitu mereka yang melaksanakan kewajiban dan sunnah Rasul dan meninggalkan yang diharamkan juga yang dimakruhkan, { ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ } ( Yang demikian itu adalah karunia yang amat besar. ) , { جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ } ( (Bagi mereka) surga ‘Adn mereka masuk ke dalamnya, di dalamnya mereka diberi perhiasan dengan gelang-gelang dari emas, dan dengan mutiara, dan pakaian mereka didalamnya adalah sutera. ) [ Fathir : 32-33 ]. { عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ } Dalam hal ini bisa dikatakan bahwa mata air \"tasnim\" adalah mata air yang darinya \"al-muqorrobun\" minum air yang murni tanpa adanya campuran lain, dan itulah mata air yang paling tinggi tingkatannya, sedangkan \"الأَبرار / al-abror \" mereka akan minum dari air yang bercampur dengan jenis air lainnya, mereka akan minum dari khamar yang bercampur dengan mata air \"tasnim\"."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ Maknanya: Bahwa mata air dan air yang memancar serta sungai yang mengalir, Muqarrabun akan meminum dengannya. Dan akan ada yang bertanya: Mengapa dikatakan: Meminum dengannya, apakah “dengannya” itu adalah dengan bejana yang dibawa sehingga dikatakan: meminum dengan bejana? Jawabannya: Tidak, karena mata air dan sungai tidak bisa dibawa, kalau begitu mengapa tidak dikatakan: muqarrabun meminum darinya? Ada dua jawaban untuk menjawab pertanyaan ini: di antara ulama ada yang mengatakan bahwa huruf ب ba di sini bermakna مِنْ[min: dari] maka makna يَشْرَبُ بِهَا adalah: meminum darinya (bukan dengannya. Karena asal arti huruf ba adalah bermakna dengan). Di antara mereka ada yang mengatakan: Meminum disini bermakna menghilangkan dahaga. Maka makna يَشْرَبُ بِهَا adalah muqarrabun menghilangkan dahaga dengannya. Ini adalah pemaknaan yang lebih bagus daripada yang sebelumnya, karena pemaknaan ini mencakup dua hal yang menguatkannya: pertama, menetapkan huruf jarr (ba) sesuai dengan makna aslinya. Kedua: Bahwa fi’il (يَشْرَبُ) [yasyrabu] memiliki cakupan makna lebih luas dari sekedar memimum, yaitu hilangnya dahaga. Betapa banyak manusia meminum namun dahaganya tidak hilang. Tetapi jika dahaganya telah pergi pasti dia telah minum. Dengan penjelasan ini maka pemaknaan kedua lebih bagus, yaitu dikarenakan fi’il Yasyrabu (meminum) mencakup makna menghilangkan dahaga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 28: Allah jelaskan bahwa minuman di surga berasal dari mata air, yang disebut juga tasnim. Sumber mata air ini akan diminum oleh mereka yang dekat dengan Allah yang airnya jernih, putih, bersih dan ia adalah semulia-mulianya minuman untuk ahli surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka yang dekat kepada Allah adalah manusia yang paling tinggi kedudukannya dimana minuman mereka adalah minuman penduduk surga yang paling utama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 28",
    "description": "Tasnim adalah mata air surga yang berada di ketinggian dan berkualitas tinggi pula. Itulah mata air yang diminum oleh mereka yang dekat kepada Allah karena sungguh-sungguh beriman dan beramal saleh. Inilah salah satu penghargaan tertinggi yang Allah berikan kepada mereka. 29. Berbeda dari orang-orang berbakti yang selalu beriman dan beramal saleh, sesungguhnya orang-orang yang berdosa dan kafir adalah mereka yang dahulu menertawakan orang-orang yang beriman, terutama yang fakir dan miskin. Mereka beranggapan bahwa agama yang benar adalah yang banyak diikuti oleh kaum bangsawan dan kaya."
  }
]