[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-33. Sesungguhnya orang orang yang gemar berbuat dosa itu adalah orang orang yang dulu di dunia mengejek orang orang yang beriman. Bila orang-orang beriman lewat di dekat mereka,mereka saling memberi isyarat sebagai ejekan bagi mereka. Bila orang-orang yang gemar berbuat dosa itu pulang kepada keluarga dan kerabat mereka,mereka terus mengejek orang orang yang beriman, Bila orang orang kafir itu melihat para sahabat Muhammad yang telah mengikuti hidayah, mereka berkata, “sesungguhnya mereka adalah orang-orang yang tersesat karena mengikuti Muhammad.” Padahal para pendosa itu tidak diutus untuk mengawasi para sahabat Muhammad sholallohu alaihi wasallam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Sesungguhnya orang-orang yang durhaka dengan kekufurannya dahulu menertawakan orang-orang yang beriman sebagai bentuk ejekan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-34. Orang-orang yang melakukan kekafiran dan kemunafikan itu dahulu ketika di dunia selalu menghina dan menertawakan orang-orang beriman; jika mereka berjalan melewati orang-orang beriman maka mereka akan melakukan gerakan yang menghina, dan jika mereka pulang ke keluarga mereka maka akan pulang dalam keadaan puas dan menikmati perbuatan mereka dalam menghina orang-orang beriman. Dan jika mereka melihat orang-orang beriman maka akan menuduh mereka sebagai orang-orang yang sesat. Sungguh Allah tidak menjadikan orang-orang yang penuh dosa itu untuk menghakimi orang-orang beriman dan mengawasi perbuatan mereka. Dan pada hari pembalasan, orang-orang beriman akan berbalik menertawakan orang-orang kafir, sebagai balasan atas perbuatan mereka di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. إِنَّ الَّذِينَ أَجْرَمُوا۟ (Sesungguhnya orang-orang yang berdosa) Yakni orang-orang kafir. كَانُوا۟ مِنَ الَّذِينَ ءَامَنُوا۟ يَضْحَكُونَ(adalah mereka yang menertawakan orang-orang yang beriman) Yakni menghina orang-orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "29-36 . Dunia bukanlah akhir dari segala perjalanan : { إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ } tatkala orang-orang berdosa menertawakan orang-orang beriman atas ketaatan mereka didunia kepada Allah, maka pada hari kiamat keadaan akan terbalik orang-orang beriman akan menertawakan orang-orang kafir pula atas azab yang ditimpakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Sesungguhnya orang-orang kafir dari golongan pembesar Makkah yang sebelumnya mereka beriman yang di dunia sibuk mengolok-olok. Di antara pembesar orang-orang kafir adalah Abu Jahal dan Walid bin Mughirah dan ‘Ash bin Wail As Sahmi. Mereka mentertawakan Amar, Shuhaib dan Bilal dan lainnya dari golongan orang Islam yang miskin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang berdosa adalah mereka yang dahulu selalu mentertawakan orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 29-33 Pada saat menjelaskan balasan orang-orang yang berdosa dan balasan orang-orang yang berbuat baik, Allah menyebutkan adanya perbedaan besar antara keduanya. Allah mengabarkan bahwa orang-orang yang berdosa ketika berada di dunia menguasai dan mencibir orang-orang yang beriman, “menertawakan” mereka dan “saling mengedip-ngedipkan matanya,” ketika berpapasan dengan mereka, seraya merendahkan dan meremehkan. Meski demikian, kau lihat mereka tenang dan sama sekali tidak terlintas rasa takut di benak mereka. “Dan apabila orang-orang berdosa itu kembali kepada kaumnya,” di pagi dan di sore hari, “mereka kembali dengan gembira,” yakni bersuka cita dan inilah ketertipuan terbesar. Mereka menyatukan antara puncak perlakuan pada orang lain sedangkan mereka merasa aman di dunia hingga seolah-olah telah datang kitab dan janji dari Allah untuk mereka bahwa mereka adalah orang-orang yang berbahagia. Mereka memutuskan pada diri mereka sendiri bahwa mereka adalah orang yang mendapatkan petunjuk sedangkan orang-orang yang beriman adalah orang yang sesat seraya berdusta atas nama Allah dan berani berkata-kata tentang Allah tanpa ilmu. Allah berfirman, “Padahal orang-orang yang berdosa itu tidak dikirim untuk menjadi penjaga bagi orang-orang Mukmin,” yakni tidaklah mereka diutus untuk menjaga orang-orang beriman, yang ditugaskan menjaga amal perbuatan mereka hingga mereka bisa menegaskan bahwa orang-orang beriman adalah orang-orang sesat. Hal ini mereka lakukan karena pembangkangan dan sikap bermain-main yang tidak memiliki landasan dan bukti nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّ الَّذِينَ أَجْرَمُوا } Sesungguhnya orang-orang kafir { كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ } ketika didunia merka menertawakan orang-orang beriman, mereka merendahkan dan meremehkan orang-orang beriman, padahal sebenarnya mereka adalah orang-orang bodoh, mereka adalah para penganiaya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ الَّذِينَ أَجْرَمُوا “Sesungguhnya orang-orang yang berdosa, ”Maknanya: yang melakukan kejahatan yaitu kemaksiatan dan pelanggaran, كَانُوا dahulu di dunia مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ “adalah mereka yang menertawakan orang-orang yang beriman.” Dalam rangka menghina, mengejek dan meremehkan mereka"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 29: 29-33. Allah sebutkan orang-orang yang banyak melakukan dosa di dunia dan mereka menyimpang, mencemooh dan tertawa (mengejek) kepada siapa yang mereka beriman. Dan ketika mereka (para pendosa) kembali kerumah-rumah mereka, mereka menggunjing, asik membicarakan (ahli iman), mencela dan mencemooh mereka ahli ibadah yang beriman kepada Allah. Dan jika mereka (ahli syirik) bertemu dengan ahli iman mereka berkata : Mereka ini adalah orang-orang yang tersesat, manusia akan kehilangan arah (petunjuk) jika menjadi pengikut mereka. Dan mereka (para pendosa) akan dibangkitkan (dan dibalas) atas perlakuannya kepada orang-orang muslim yang taat menjaga amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan balasan orang-orang yang berdosa dan balasan orang-orang yang beriman serta menerangkan perbedaan besar antara keduanya, maka Dia memberitahukan bahwa orang-orang yang berdosa itu adalah mereka yang dahulu di dunia menertawakan orang-orang mukmin dan mengolok-olok mereka, bahkan ketika orang-orang mukmin lewat, maka mereka mengedipkan matanya sambil menghinanya. Sambil mengolok-olok mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 29",
    "description": "Berbeda dari orang-orang berbakti yang selalu beriman dan beramal saleh, sesungguhnya orang-orang yang berdosa dan kafir adalah mereka yang dahulu menertawakan orang-orang yang beriman, terutama yang fakir dan miskin. Mereka beranggapan bahwa agama yang benar adalah yang banyak diikuti oleh kaum bangsawan dan kaya. 30. Dan apabila mereka, yakni orang-orang yang beriman, melintas di hadapan mereka yang berdosa dan kafir itu, mereka saling mengedip-ngedipkan matanya sebagai tanda ejekan terhadap mereka."
  }
]