[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Azab besar bagi orang orang yang curang dalam takaran dan timbangannya, Yaitu orang orang yang bila mereka membeli dari manusia dengan takaran atau timbangan,mereka menakar dan menimbang secara penuh, Tetapi manakala mereka menimbang dan menakar untuk manusia,mereka mengurangi timbangan dan takaran. Bagaimana keadaan orang yang mencuri dan mengambil barang barang yang ditakar dan ditimbang,serta mengurangi hak-hak manusia? dia lebih patut diancam daripada orang orang yang mengurangi takaran dan timbangan. Apakah orang-orang yang berbuat curang itu tidak yakin bahwa Allah akan membangkitkan mereka dan menghisab amal perbuatan mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Apabila menakar atau menimbang untuk orang lain maka mereka mengurangi timbangan dan takaran. Demikianlah kondisi penduduk Madinah saat Nabi -ṣallallāhu 'alaihi wa sallam- berhijrah kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ (dan apabila mereka menakar atau menimbang untuk orang lain, mereka mengurangi) Yakni dan jika mereka menakar untuk orang lain maka mereka mengurangi takarannya, begitu pula ketika mereka menimbang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Apabila menimbang atau menakar untuk orang lain mereka mengurangi timbangannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan apabila mereka menakar atau menimbang untuk orang lain} apabila mereka menakar dan menimbang untuk orang lain {mereka mengurangi} mereka mengurangi takaran dan timbangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Madaniyah Ayat 1-6 “Kecelakaan besarlah,” adalah kata-kata azab dan siksaan, “bagi orang-orang yang curang.” Ini dijelaskan oleh Allah dengan FirmanNya kemudian, “(Yaitu) orang-orang yang apabila menerima takaran dari orang lain,” yakni mengambil dari mereka sebagai timbal balik, mereka menginginkannya secara utuh, tidak kurang, “dan apabila mereka menakar atau menimbang untuk orang lain,” yakni bila memberikan hak orang lain yang harus ditunaikan dengan takaran atau timbangan, “mereka mengurangi,” yakni menguranginya dengan cara mengurangi takaran atau dengan cara lainnya. Ini adalah pencurian harta orang lain dan tidak bersikap adil terhadap mereka. Karena ancaman ini ditunjukkan pada orang yang mengurangi takaran dan timbangan orang lain, maka orang yang mengambil harta orang lain secara paksa atau dengan cara mencuri, tentu lebih berhak mendapatkan ancaman ini dari orang-orang yang sekedar berbuat curang. Ayat mulia ini menunjukkan bahwa orang sebagaimana berhak mendapatkan haknya dari orang lain, ia juga harus memberikan semua milik orang lain secara penuh, baik berupa harta maupun yang lain. Bahkan hujjah dan pernyataan juga termasuk dalam keumuman ayat ini. Biasanya, masing-masing dari dua orang yang berdebat berusaha mempertahankan hujjahnya, ia juga berkewajiban menjelaskan hujjah rivalnya yang tidak ia ketahui dan mempertimbangkan argumen-argumen rivalnya sebagaimana ia juga harus mempertimbangkan argumen-argumennya sendiri. Di sini dapat diketahui sikap obyektif atau fanatisme seseorang, kerendahan hati atau kesombongan, berakal atau bodoh. Semoga Allah berkenan menolong kita pada setiap kebaikan. Selanjutnya Allah mengancam orang-orang yang berbuat curang serta merasa bangga atas kondisi mereka serta tetapnya mereka berada di atas kecurangan seraya berfirman, “Tidaklah orang-orang itu yakin, bahwa sesungguhnya mereka akan dibangkitkan, pada suatu hari yang besar, (yaitu) hari (ketika) manusia berdiri menghadap Rabb semesta alam?” yang mendorong mereka untuk berbuat curang adalah tidak beriman pada Hari Akhir, sebab bila mereka beriman pada Hari Akhir dan mereka mengetahui akan berdiri di hadapan Allah yang akan menghisab mereka atas amalan kecil dan besar, niscaya mereka menjauhkan diri mereka dari kecurangan dan bertaubat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan apabila mereka yang menakar atau menimbang untuk orang lain mereka mengurangi timbangan itu, mereka memenuhi timbangan jika itu milik mereka dan menguranginya jika timbangan atau takaran itu milik orang lain, dalam hadits disebutkan : \"bahwasanya ketika Rasulullah ﷺ berhijrah dari Makkah ke Madinah beliau mendapati kebanyakan dari para pedagang dikota itu berbuat curang dalam timbangan dan takaran, kemudian turunlah surah ini, dan akhirnya mereka menjadi pedagang yang paling jujur dalam timbangan''. Dalam ayat lain Allah mengatakan : { وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ } ( Dan tegakkanlah timbangan itu dengan adil dan janganlah kamu mengurangi neraca itu. ) [ Ar Rahman : 9 ] berlaku adillah kalian dalam menimbang sesuatu dan janganlah kalian menguranginya, Allah juga mengatakan : { وَأَوْفُوا الْكَيْلَ إِذَا كِلْتُمْ وَزِنُوا بِالْقِسْطَاسِ الْمُسْتَقِيمِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا } ( Dan sempurnakanlah takaran apabila kamu menakar, dan timbanglah dengan neraca yang benar. Itulah yang lebih utama (bagimu) dan lebih baik akibatnya. ) [ Al Isra : 35 ], Alla memerintahakan untuk berlaku adil dalam menimbang atau menakar. Dan Nabi Muhammad ﷺ juga telah memerintahkan kepada ummatnya untuk berbuat adil dalam timbangan dan takaran, dalam Hadits yang diriwayatkan oleh Imam Muslim : (( أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- مَرَّ عَلَى صُبْرَةِ طَعَامٍ فَأَدْخَلَ يَدَهُ فِيهَا فَنَالَتْ أَصَابِعُهُ بَلَلاً فَقَالَ « مَا هَذَا يَا صَاحِبَ الطَّعَامِ ». قَالَ أَصَابَتْهُ السَّمَاءُ يَا رَسُولَ اللَّهِ. قَالَ « أَفَلاَ جَعَلْتَهُ فَوْقَ الطَّعَامِ كَىْ يَرَاهُ النَّاسُ مَنْ غَشَّ فَلَيْسَ مِنِّى » )) “Rasulullah shallallahu ‘alaihi wa sallam pernah melewati setumpuk makanan, lalu beliau memasukkan tangannya ke dalamnya, kemudian tangan beliau menyentuh sesuatu yang basah, maka pun beliau bertanya, “Apa ini wahai pemilik makanan?” Sang pemiliknya menjawab, “Makanan tersebut terkena air hujan wahai Rasulullah.” Beliau bersabda, “Mengapa kamu tidak meletakkannya di bagian makanan agar manusia dapat melihatnya? Ketahuilah, barangsiapa menipu maka dia bukan dari golongan kami.” Oleh karena itu menjadi kewajiban bagi setiap mereka melakukan transaksi jual beli agar lebih memperhatikan hal ini, karena apa yang dia ambil dan itu melebihi timbangan yang sebenarnya adalah haram baginya, dan itu akan dipertanggung jawabkan di hari kiamat nanti."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ “dan apabila mereka menakar atau menimbang untuk orang lain,” Yakni: Apabila mereka menakar untuk orang-orang, mereka menjadi penjual makanan yang ditakar, apabila menakar untuk orang-orang yang membeli sesuatu yang ditakar atau ditimbang maka mereka akan mengurangi timbangannnya. يُخْسِرُونَ “mereka mengurangi.” Mereka meminta orang lain memenuhi hak mereka, tapi mereka mengurangi hak orang lain, sehingga terkumpul dua perangai, antara ketamakan dan pelit. Ketamakan: Dalam meminta hak mereka tanpa tawar menawar dan belas kasih. Sedangkan pelit: Menahan hak yang wajib mereka berikan berupa menyempurnakan takaran dan timbangan. Contoh yang Allah ‘Azza Wa Jalla sebutkan disini berupa takaran dan timbangan adalah sekedar contoh saja. Hal-hal lainnya yang serupa bisa dianalogikan dengannya, oleh karenanya siapa saja yang meminta haknya diberikan secara utuh dari orang yang harus memberikannya sedangkan ia menahan hak orang lain yang harus ia berikan maka ini juga termasuk dalam keumuman ayat ini. Contohnya, seorang suami menginginkan istrinya memenuhi haknya secara sempurna, tidak mengabaikan sedikit pun haknya, namun sang suami mengabaikan penunaian dan pemberian hak istrinya. Betapa banyak istri-istri yang mengeluhkan hal ini dari suami mereka, wal-‘iyaadzu billaah, banyak dari perempuan yang dituntut suaminya agar mereka menunaikan hak-hak suami secara sempurna, namun suami tidak memberikan hak mereka secara sempurna, bisa jadi mengurangi banyak haknya beripa nafkah, digauli dengan baik dan hak lainnya. Sungguh kezaliman kepada manusia lebih berat dari pada seseorang menzalimi dirinya sendiri berkaitan dengan hak Allah, karena kezaliman yang dilakukan seorang insan kepada dirinya sendiri yang berkaitan dengan maksiat kepada Allah, kedudukannya tergantung kehendak Allah, jika lebih ringan dari kesyirikan, Jika Allah menghendaki maka bisa diampuni, dan jika Allah menghendaki, bisa dihukum. Tetapi hak yang berkaitan dengan orang lain maka harus dipenuhi, oleh karenanya Nabi shallallaahu ‘alaihi wa sallam bersabda: مَنْ تَعُدُّو نَ الْمُفْلِسَ فِيْكُمْ؟ “ Siapakah yang kalian anggap bangkrut di antara kalian? ” Para sahabat menjawab: Orang yang bangkrut menurut kami adalah orang yang tidak punya dirham (uang) sedikit pun tidak juga punya bekal. Maka Rasulullah shallallaahu ‘alaihi wa sallam bersabda: إِنَّ الْمُفْلِسَ مِنْ أُمَّتِي مَنْ يَأْتِي يَوْمَ الْقِيَامَةِ بِحَسَنَاتٍ أَمْثَالِ الْجِبَالِ –كَثِيْرَة- فَيَأْتِي وَقَدْ ظَلَمَ هَذَا، وشَتَمَ هَذَا، وَأَخَذَ مَالَ هَذَا، فَيَأْخُذَ هَذَا مِنْ حَسَنَاتِهِ، و هَذَا مِنْ حَسَنَاتِهِ، و هَذَا مِنْ حَسَنَاتِهِ، فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ أَنْ يُقْضَى مَا عَلَيْهِ أَخَذَ مِنْ خَطَايَاهُم فَطُرِحَتْ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِ “ Sesungguhnya orang muflis (bangkrut) dari umatku adlah orang yang datang pada hari kiamat dengan membawa kebaikan bagai gunung-gunung (sangat banyak), ia datang namun ia telah menzalimi orang ini, mencerca orang ini, memukul orang ini, mengambil harta ini, maka orang ini akan menambil kebaikan-kebaikannya, yang ini juga mengambil kebaikan-kebaikannya, dan yang ini juga mengambil kebaikan-kebaikannya, jika kebaikannya sudah habis sebelum memenuhi hak mereka, maka keburukan mereka akan diambil dan dilemparkan kepadanya, kemudian ia pun dilempar ke neraka ”(1) Maka nasehatku untuk suami-suami yang mengabaikan hak istri-istrinya, hendaknya mereka bertakwa kepada Allah ‘Azza Wa Jalla, sesungguhnya Nabi shallallaahu ‘alaihi wa sallam telah berwasiat tentang perempuan di perkumpulan terbesar dunia islam pada masa hidup Rasulullah ‘alaihissholaatu wassalaam, pada hari arafah saat haji wada, beliau bersabda: اتَّقُوا اللَّهَ فِى النِّسَاءِ فَإِنَّكُمْ أَخَذْتُمُوهُنَّ بِأَمَانِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ “ Bertakwalah kepada Allah berkaitan dengan istri-istri kalian, sesungguhnya kalian telah mengambil mereka dengan amanah dari Allah, kalian menghalalkan kemaluan-kemaluan mereka dengan kalimat Allah ”(2) Rasulullah shallallaahu ‘alaihi wa sallam memerintahkan kita bertakwa kepada Allah berkenaan dengan para istri, beliau juga bersabda: اتَّقُوا اللَّهَ فِى النِّسَاءِ فَإِنَّهُنَّ عَوَانٌ عِنْدَكُمْ “Bertakwalah kepada Allah berkenaan dengan istri-istri kalian, sesungguhnya mereka tawanan di sisi kalian” (3) maknanya: kedudukannya seperti para tawanan karena tawanan itu jika sang penawan menginginkan untuk melepasnya maka lepaskanlah dan jika berkehendak maka menahannya. Istri pun di sisi suaminya demikian, jika ia mau maka ia bisa mentalaknya dan jika ia mau ia bisa menetapkannya, kedudukannya seperti tawanan di sisi suaminya, maka bertakwalah kepada Allah pada istrinya. Begitu juga kami dapati sebagian orang tua menginginkan anak-anaknya menunaikan hak-haknya dengan sempurna, namun mengabaikan hak-hak anak yang wajib mereka berikan, ia ingin agar anak-anaknya berbakti dan menunaikan haknya, ingin agar mereka berbakti dengan harta dan raga, dan di segala sesuatu berupa bakti, namun ia melalaikan anak-anak mereka, ia tidak melakukan kewajiban yang harus ia lakukan kepada anak-anak mereka. Kita katakan: Yang seperti ini adalah Muthaffif (Orang yang curang) sebagaimana yang kita katakan juga pada masalah yang pertama, yaitu masalah suami terhadap istrinya, sesungguhnya jika sang suami ingin istrinya menunaikan haknya secara sempurna sedangkan ia melalaikan kewajibannya kepada istrinya. Yang seperti ini juga orang yang curang. Sang ayah yang ingin anak-anaknya berbakti kepadanya dengan sempurna, sedangkan ia kurang dalam memenuhi hak anak-anaknya, kita katakan: Anda adalah orang yang curang, kita katakan juga kepada ia: ingatlah firman Allah Ta’ala: وَيْلٌ لِلْمُطَفِّفِينَ (1) الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ (2) وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ يُخْسِرُونَ “Kecelakaan besarlah bagi orang-orang yang curang, orang-orang yang apabila menerima takaran dari orang lain mereka minta dipenuhi, dan apabila mereka menakar atau menimbang untuk orang lain, mereka mengurangi.” (1) Dikeluarkan Muslim (2581) dari hadits Abu Hurairah radhiyallaahu 'anhu (2) Dikeluarkan Muslim (1218) dari hadits Jabir Bin Abdillah radhiyallaahu 'anhu (3) Dikeluarkan Tirmidziy (1163) dan Ibnu Majah (1851) dari hadits Amer Bin Al-Ahwash radhiyallaahu 'anhu dan dinyatakan hasan oleh Al-Albaniy dalam Shahihuljami' (7880)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 3: 1-3. Surat ini dimulai dengan pengertian yang berkenaan dengan manusia (yang) curang dalam timbangan, Allah berkata : Celaka dan adzablah yang akan didapat pada hari kiamat bagi siapa yang berlaku curang dalam takaran dan timbangan, yang mereka licik dalam memebrikan hak-hak manusia. Kemudian Allah jelaskan keadaan orang-orang yang curang dalam timbangan, yaitu ketika mereka membeli sesuatu dari manusia, mereka meminta takaran atau timbangannya agar tepat (pas) dan sempurna. Dan jika mereka menakar atau menimbang untuk orang lain, mereka akan kurangi takran dan timbangannya. Semua ini bukanlah ciri manusia yang inshaf dan adil; Jika engkau ingin agar hakmu dipenuhi secara sempurna, maka wajib pula memenuhi hak-hak manusia secara sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk pula ke dalam hal ini orang-orang yang ingin dipenuhi hak mereka secara sempurna, tetapi mereka tidak mau memenuhi hak orang lain yang menjadi tanggung jawabnya (tidak seimbang antara hak dan kewajiban) atau selalu menuntut hak, namun kewajiban tidak dilakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 3",
    "description": "2-3. Mereka yang berbuat curang itu adalah orang-orang yang apabila menerima takaran atau timbangan dari orang lain, mereka minta takaran itu dicukupkan dan dipenuhi sehingga tidak berkurang sedikit pun, dan apabila mereka menakar sesuatu dengan alat takar, seperti beras, gandum, atau lainnya, atau menimbang suatu barang seperti emas, perak, atau lainnya untuk orang lain, mereka mengurangi takaran atau timbangannya secara sengaja dengan cara licik agar tidak diketahui oleh pembeli. Hal ini sangat merugikan orang lain, dan harta yang diperoleh dari upaya ini hukumnya haram, tidak berkah, dan mengantar pelakunya ke neraka. 4-5. Allah mengecam mereka, 'mengapa mereka berbuat curang' tidaklah mereka itu mengira bahwa sesungguhnya mereka akan dibangkitkan, pada suatu hari yang besar, yaitu hari kebangkitan yang penuh kejadian mengerikan dan menegangkan''."
  }
]