[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-33. Sesungguhnya orang orang yang gemar berbuat dosa itu adalah orang orang yang dulu di dunia mengejek orang orang yang beriman. Bila orang-orang beriman lewat di dekat mereka,mereka saling memberi isyarat sebagai ejekan bagi mereka. Bila orang-orang yang gemar berbuat dosa itu pulang kepada keluarga dan kerabat mereka,mereka terus mengejek orang orang yang beriman, Bila orang orang kafir itu melihat para sahabat Muhammad yang telah mengikuti hidayah, mereka berkata, “sesungguhnya mereka adalah orang-orang yang tersesat karena mengikuti Muhammad.” Padahal para pendosa itu tidak diutus untuk mengawasi para sahabat Muhammad sholallohu alaihi wasallam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Jika mereka kembali kepada keluarga mereka, mereka kembali dengan gembira atas kekufuran dan hinaan mereka terhadap orang-orang yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَإِذَا انقَلَبُوٓا۟ (Dan apabila orang-orang yang berdosa itu kembali) Yakni orang-orang kafir itu kembali إِلَىٰٓ أَهْلِهِمُ (kepada keluarganya) Dari majelis-majelis mereka. انقَلَبُوا۟ فَكِهِينَ (mereka kembali dengan gembira) Yakni mereka membangga-banggakan kenikmatan yang mereka rasakan dan menertawakan orang-orang beriman dengan tuduhan dan olokan kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "29-36 . Dunia bukanlah akhir dari segala perjalanan : { إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ } tatkala orang-orang berdosa menertawakan orang-orang beriman atas ketaatan mereka didunia kepada Allah, maka pada hari kiamat keadaan akan terbalik orang-orang beriman akan menertawakan orang-orang kafir pula atas azab yang ditimpakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Ketika orang-orang durhaka itu pulang ke rumah mereka, mereka menceritakan kepada keluarga apa yang mereka lakukan kepada orang-orang mkmin dengan penuh kesenangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila kembali} kembali {kepada kaumnya, mereka kembali dengan gembira} senang dengan ejekan mereka terhadap orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 29-33 Pada saat menjelaskan balasan orang-orang yang berdosa dan balasan orang-orang yang berbuat baik, Allah menyebutkan adanya perbedaan besar antara keduanya. Allah mengabarkan bahwa orang-orang yang berdosa ketika berada di dunia menguasai dan mencibir orang-orang yang beriman, “menertawakan” mereka dan “saling mengedip-ngedipkan matanya,” ketika berpapasan dengan mereka, seraya merendahkan dan meremehkan. Meski demikian, kau lihat mereka tenang dan sama sekali tidak terlintas rasa takut di benak mereka. “Dan apabila orang-orang berdosa itu kembali kepada kaumnya,” di pagi dan di sore hari, “mereka kembali dengan gembira,” yakni bersuka cita dan inilah ketertipuan terbesar. Mereka menyatukan antara puncak perlakuan pada orang lain sedangkan mereka merasa aman di dunia hingga seolah-olah telah datang kitab dan janji dari Allah untuk mereka bahwa mereka adalah orang-orang yang berbahagia. Mereka memutuskan pada diri mereka sendiri bahwa mereka adalah orang yang mendapatkan petunjuk sedangkan orang-orang yang beriman adalah orang yang sesat seraya berdusta atas nama Allah dan berani berkata-kata tentang Allah tanpa ilmu. Allah berfirman, “Padahal orang-orang yang berdosa itu tidak dikirim untuk menjadi penjaga bagi orang-orang Mukmin,” yakni tidaklah mereka diutus untuk menjaga orang-orang beriman, yang ditugaskan menjaga amal perbuatan mereka hingga mereka bisa menegaskan bahwa orang-orang beriman adalah orang-orang sesat. Hal ini mereka lakukan karena pembangkangan dan sikap bermain-main yang tidak memiliki landasan dan bukti nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan jika mereka kembali ke rumah-rumah mereka, mereka senang dan bahagia atas apa yang telah mereka lakukan kepada orang-orang beriman, mereka menceritakan hal itu kepada keluarga mereka, mereka bangga dengan kelakuan yang mereka perbuat. Dalam riwayat lain dikatakan : { وَإِذَا انْقَلَبُوا إِلَىٰ أَهْلِهِمُ انْقَلَبُوا فَكِهِينَ } yakni ketika mereka kembali kerumah mereka dan mendapati didalamnya ada makanan ataupun minuman dan segala kenikmatan dunia, mereka tidak bersyukur kepada Alllah ﷻ , bahkan mereka menjelek-jelekkan ciptaan Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا مَرُّوا Fa’il (istilah dalam bahasa arab digunakan untuk kata yang kedudukannya sebagai subyek) bisa dimaknakan: Apa bila orang-orang yang beriman melewati orang-orang yang jahat itu, atau juga: apabila orang-orang jahat itu melewati orang-orang yang beriman. Kaedah yang mesti difahami dalam tafsir: Apabila sebuah ayat memiliki kemungkinan dua makna yang tidak menafikan makna salah satunya maka ayat tersebut harus dibawa kedalam kedua makna tersebut. Karena dengan begitu maknanya lebih luas. Jika kita pemaknaan dengan keduanya maka maknanya: Bahwa saat orang-orang jahat melewati orang-orang beriman yang sedang duduk mereka akan saling melirik meremehkannya,dan apabila orang-orang yang beriman melewati orang-orang jahat itu yang sedang duduk maka mereka pun saling melirik meremehkannya, sehingga di sini mencakup dua kondisi: kondisi lewatnya orang-orang yang jahat kepada orang-orang yang beriman,dan kondisi lewatnya orang-orang yang beriman kepada orang-orang yang jahat. يَتَغَامَزُونَ “mereka saling mengedip-ngedipkan matanya.” Yakni: Saling melirik: Lihatlah mereka, dalam rangka mengejek, menghina dan meremehkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 31: 29-33. Allah sebutkan orang-orang yang banyak melakukan dosa di dunia dan mereka menyimpang, mencemooh dan tertawa (mengejek) kepada siapa yang mereka beriman. Dan ketika mereka (para pendosa) kembali kerumah-rumah mereka, mereka menggunjing, asik membicarakan (ahli iman), mencela dan mencemooh mereka ahli ibadah yang beriman kepada Allah. Dan jika mereka (ahli syirik) bertemu dengan ahli iman mereka berkata : Mereka ini adalah orang-orang yang tersesat, manusia akan kehilangan arah (petunjuk) jika menjadi pengikut mereka. Dan mereka (para pendosa) akan dibangkitkan (dan dibalas) atas perlakuannya kepada orang-orang muslim yang taat menjaga amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka sungguh tertipu karena mereka menggabung antara bersikap buruk dengan merasa aman di dunia, seakan-akan mereka telah mendapatkan informasi dan jaminan dari Allah, bahwa mereka tergolong orang-orang yang berbahagia, bahkan mereka menyatakan bahwa diri merekalah yang mendapat petunjuk sedangkan orang-orang beriman adalah orang-orang yang sesat dengan mengadakan kedustaan terhadap Allah Subhaanahu wa Ta'aala serta berani berkata terhadap-Nya tanpa ilmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 31",
    "description": "Dan tidak hanya mengejek orang beriman di jalan, apabila orang-orang yang berdosa dan kafir kembali kepada kaumnya, mereka kembali dengan gembira ria karena telah menertawakan orang beriman. Mereka dengan riang menceritakan kepada kaumnya hinaan dan ejekan yang telah mereka lakukan kepada kaum mukmin. Dan apabila kembali kepada kaumnya, mereka kembali dengan gembira ria. 32. Dan apabila mereka yang berdosa dan kafir itu melihat orang-orang mukmin, mereka mengatakan, 'sesungguhnya mereka benar-benar orang-orang sesat karena telah beriman kepada Muhammad dan meninggalkan keyakinan nenek moyang mereka. '."
  }
]