[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-33. Sesungguhnya orang orang yang gemar berbuat dosa itu adalah orang orang yang dulu di dunia mengejek orang orang yang beriman. Bila orang-orang beriman lewat di dekat mereka,mereka saling memberi isyarat sebagai ejekan bagi mereka. Bila orang-orang yang gemar berbuat dosa itu pulang kepada keluarga dan kerabat mereka,mereka terus mengejek orang orang yang beriman, Bila orang orang kafir itu melihat para sahabat Muhammad yang telah mengikuti hidayah, mereka berkata, “sesungguhnya mereka adalah orang-orang yang tersesat karena mengikuti Muhammad.” Padahal para pendosa itu tidak diutus untuk mengawasi para sahabat Muhammad sholallohu alaihi wasallam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Padahal Allah tidak menugaskan mereka untuk menjaga amal perbuatan kaum mukminin sehingga mereka mengatakan perkataan ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَمَآ أُرْسِلُوا۟ عَلَيْهِمْ حٰفِظِينَ (padahal orang-orang yang berdosa itu tidak dikirim untuk penjaga bagi orang-orang mukmin) Yakni mereka tidak diutus Allah kepada orang-orang beriman untuk mengawasi perbuatan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "29-36 . Dunia bukanlah akhir dari segala perjalanan : { إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ } tatkala orang-orang berdosa menertawakan orang-orang beriman atas ketaatan mereka didunia kepada Allah, maka pada hari kiamat keadaan akan terbalik orang-orang beriman akan menertawakan orang-orang kafir pula atas azab yang ditimpakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Padahal orang-orang kafir tidak diutus untuk menjaga amal-amal orang mukmin, juga bukan diutus menjadi pemerhati amal-amal orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan mereka itu tidak diutus sebagai penjaga} pengawas yang mengawasi amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 29-33 Pada saat menjelaskan balasan orang-orang yang berdosa dan balasan orang-orang yang berbuat baik, Allah menyebutkan adanya perbedaan besar antara keduanya. Allah mengabarkan bahwa orang-orang yang berdosa ketika berada di dunia menguasai dan mencibir orang-orang yang beriman, “menertawakan” mereka dan “saling mengedip-ngedipkan matanya,” ketika berpapasan dengan mereka, seraya merendahkan dan meremehkan. Meski demikian, kau lihat mereka tenang dan sama sekali tidak terlintas rasa takut di benak mereka. “Dan apabila orang-orang berdosa itu kembali kepada kaumnya,” di pagi dan di sore hari, “mereka kembali dengan gembira,” yakni bersuka cita dan inilah ketertipuan terbesar. Mereka menyatukan antara puncak perlakuan pada orang lain sedangkan mereka merasa aman di dunia hingga seolah-olah telah datang kitab dan janji dari Allah untuk mereka bahwa mereka adalah orang-orang yang berbahagia. Mereka memutuskan pada diri mereka sendiri bahwa mereka adalah orang yang mendapatkan petunjuk sedangkan orang-orang yang beriman adalah orang yang sesat seraya berdusta atas nama Allah dan berani berkata-kata tentang Allah tanpa ilmu. Allah berfirman, “Padahal orang-orang yang berdosa itu tidak dikirim untuk menjadi penjaga bagi orang-orang Mukmin,” yakni tidaklah mereka diutus untuk menjaga orang-orang beriman, yang ditugaskan menjaga amal perbuatan mereka hingga mereka bisa menegaskan bahwa orang-orang beriman adalah orang-orang sesat. Hal ini mereka lakukan karena pembangkangan dan sikap bermain-main yang tidak memiliki landasan dan bukti nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Padahal kami tidak mengutus orang-orang kafir itu untuk mengawasi para mukminin, kemudian mengikuti atau memata-matai kesalahan yang dilakukan oleh orang-orang beriman, mereka tidak diutus untuk menjelek-jelekkan orang-orang beriman, dan ketika sesorang diantara orang beriman itu melakukan kesalahan kecil, mereka langsung menyebarkan berita tentang itu, mereka menghina orang-orang beriman itu dengan hinaan yang sangat buruk. Kalian hanya bertanggung jawab atas diri kalian, dan janganlah kalian menyibukkan diri untuk mencari-cari kesalahan orang beriman itu. dan jika kalian menemukan kesalahan yang dilakukan oleh orang beriman itu, kalian lupa bahwa kesalahan yang terbesar itu ada pada diri kalian, biarkanlah orang-orang beriman itu melaksanakan ibadah mereka dengan khusyuk, dan jangan kalian terus menghina mereka dengan kesalahnnya yang sangat kecil."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ “padahal orang-orang yang berdosa itu tidak dikirim untuk penjaga bagi orang-orang mukmin.” Maknanya: bahwa orang-orang jahat itu tidaklah diutus untuk menjaga mengawasi dan menghukumi orang-orang beriman, namun sejatinya hukum itu milik Allah ‘Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 33: 29-33. Allah sebutkan orang-orang yang banyak melakukan dosa di dunia dan mereka menyimpang, mencemooh dan tertawa (mengejek) kepada siapa yang mereka beriman. Dan ketika mereka (para pendosa) kembali kerumah-rumah mereka, mereka menggunjing, asik membicarakan (ahli iman), mencela dan mencemooh mereka ahli ibadah yang beriman kepada Allah. Dan jika mereka (ahli syirik) bertemu dengan ahli iman mereka berkata : Mereka ini adalah orang-orang yang tersesat, manusia akan kehilangan arah (petunjuk) jika menjadi pengikut mereka. Dan mereka (para pendosa) akan dibangkitkan (dan dibalas) atas perlakuannya kepada orang-orang muslim yang taat menjaga amalan-amalan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 33",
    "description": "Mereka menganggap sesat orang mukmin, padahal mereka yang kafir dan berdosa itu tidak diutus oleh Allah sebagai penjaga orang-orang mukmin. Mereka bukanlah pihak yang berhak menilai dan menentukan sesat-tidaknya satu kaum. 34. Sebagai balasan atas perilaku mereka yang kafir itu, maka pada hari pembalasan ini, giliran orang-orang yang beriman yang menertawakan orang-orang kafir yang dulu menertawakan mereka."
  }
]