[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Diatas tempat-tempat yang mewah,orang orang beriman melihat kemuliaan dan kenikmatan yang Allah berikan kepada mereka di surga. salah satu terbesar dari nikmat itu adalah melihat kepada wajah Allah yang mulia. Apakah orang-orang kafir itu dibalas sesuai dengan amal perbuatan mereka,yakni balasan yang pas dengan apa yang mereka lakukan didunia. Yaitu keburukan dan dosa-dosa? ya,mereka dibalas dengan balasan yang penuh dan paling adil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Di atas kasur-kasur yang berhias mereka melihat kepada kenikmatan abadi yang disediakan oleh Allah untuk mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35-36. Orang-orang beriman itu akan duduk di atas dipan-dipan dan kasur-kasur yang mewah, seraya melihat kenikmatan dan kedudukan mulia yang telah Allah berikan. Apakah orang-orang kafir mendapat balasan azab akibat dosa-dosa yang telah mereka lakukan? Iya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. عَلَى الْأَرَآئِكِ يَنظُرُونَ (mereka (duduk) di atas dipan-dipan sambil memandang) Yakni melihat musuh-musuh Allah disiksa, sedangkan orang-orang beriman menikmati berbagai kenikmatan di atas dipan-dipan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "29-36 . Dunia bukanlah akhir dari segala perjalanan : { إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ } tatkala orang-orang berdosa menertawakan orang-orang beriman atas ketaatan mereka didunia kepada Allah, maka pada hari kiamat keadaan akan terbalik orang-orang beriman akan menertawakan orang-orang kafir pula atas azab yang ditimpakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Mereka duduk-duduk di atas dipan-dipan melihat derajat mereka yang lebih tinggi daripada orang kafir yang diazab di neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di atas dipan-dipan mereka memandang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 34-36 Karena itulah balasan mereka di akhirat sesuai dengan amal perbuatan meraka. Allah berfirman, “Maka pada hari ini,” yaitu Hari Kiamat, “orang-orang yang beriman menertawakan orang-orang kafir,” ketika melihat mereka terbolalk-balik dalam azab dan semua yang dulu mereka dustakan telah lenyap, sedangkan orang-orang yang beriman berada di puncak kenikmatan dan ketenangan, “mereka (duduk) di atas dipan-dipan,” ranjang yang berhias, “sambil memandang,” kenikmatan yang dijanjikan Allah pada mereka dan memandang wajah Rabb mereka Yang Mulia. “Sesungguhnya orang-orang kafir telah diberi ganjaran tehadap apa yang dahulu mereka kerjakan,” yakni, mereka diberi balasan sesuai amal perbuatan mereka. Sebagaimana mereka menertawakan orang-orang Mukmin ketika berada di dunia dan menuduh mereka sebagai orang-orang sesat, maka di akhirat orang-orang yang beriman menertawakan mereka ketika melihat mereka berada dalam siksaan yang merupakan azab kesesatan. Ya, mereka diberi balasan atas apa yang telah lakukan sebagai keadilan dan kebijaksanaan dari Allah dan Allah Maha Mengetahui lagi Mahabijaksana."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Diatas dipan-dipan tinggi disurga orang-orang beriman menatap ke orang-orang kafir yang sedang disiksa, orang beriman pada hari itu menjadi mulia disisi Tuhannya, diatas dipan itu mereka bahagia dengan kenikmatan yang Allah anugerahkan kepada mereka, diatas dipan itu pula mereka menatap wajah Tuhan mereka, mereka menatap keseluruh penjuru sekitar mereka yang penuh dengan kenikmatan dan kesenangan yang merupakan balasan atas ketaatan mereka kepada Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "عَلَى الْأَرَائِكِ يَنْظُرُونَ Maknanya: Bahwa orang-orang beriman akan berada di atas dipan-dipan yang indah nan bercahaya. يَنْظُرُونَ Maknanya: mereka akan melihat apa-apa yang telah Allah siapkan untuk mereka berupa pahala, dan melihat orang-orang yang telah mengejek mereka di dunia, mereka akan melihatnya sedang berada dalam siksaan Allah Ta’ala: قَالَ قَائِلٌ مِنْهُمْ إِنِّي كَانَ لِي قَرِينٌ (51) يَقُولُ أَإِنَّكَ لَمِنَ الْمُصَدِّقِينَ (52) أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَدِينُونَ (53) قَالَ هَلْ أَنْتُمْ مُطَّلِعُونَ “Berkatalah salah seorang di antara mereka: Sesungguhnya aku dahulu (di dunia) mempunyai seorang teman, yang berkata: \"Apakah kamu sungguh-sungguh termasuk orang-orang yang membenarkan (hari berbangkit)? Apakah bila kita telah mati dan kita telah menjadi tanah dan tulang belulang, apakah sesungguhnya kita benar-benar (akan dibangkitkan) untuk diberi pembalasan?\" Berkata pulalah ia: \"Maukah kamu meninjau (temanku itu)?” Ia berkata kepada teman-temannya di surga, ditawarkan kepada mereka agar dapat melihat rekannya yang dahulu di dunia mengingkari dan mendustakan kebangkitan: فَاطَّلَعَ فَرَآهُ فِي سَوَاءِ الْجَحِيمِ “Maka ia meninjaunya, lalu ia melihat temannya itu di tengah-tengah neraka menyala-nyala.” di jurangnya dan dasarnya ia berkata padanya: تَاللَّهِ إِنْ كِدْتَ لَتُرْدِينِ (56) وَلَوْلَا نِعْمَةُ رَبِّي لَكُنْتُ مِنَ الْمُحْضَرِينَ ” Demi Allah, sesungguhnya kamu benar-benar hampir mencelakakanku, jikalau tidaklah karena nikmat Tuhanku pastilah aku termasuk orang-orang yang diseret (ke neraka).”(QS. Ash-shafaat: 51-57) Anda melihat bahwa orang-orang yang beriman mereka akan melihat orang-orang kafir sedang disiksa di dalam nereka sedangkan orang-orang beriman berada di surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 35: Allah kabarkan sesungguhnya orang-orang mukmin, mereka duduk-duduk di atas dipan yang terbuat dari mutiara dan permata menikmati tontonan terhadap orang-orang kafir dan menertawakan mereka, tidak gembira dengan kondisi mereka, akan tetapi untuk membalas tertawannya orang-orang kafir atas mereka di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada kenikmatan yang Allah siapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 35",
    "description": "Mereka yang beriman itu duduk di atas dipan-dipan sambil melepas pandangan ke arah pemandangan yang indah, bersama orang yang mereka cintai, sembari menikmati makanan dan minuman yang sangat lezat. 36. Saat orang-orang kafir itu di akhirat nanti mendapat siksa jahim, tertutup dari rahmat tuhan, dan mendapat hinaan dari orang mukmin yang dahulu mereka hina, apakah orang-orang kafir itu sudah diberi balasan dan hukuman setimpal terhadap apa yang telah mereka perbuat di dunia dulu, berupa kekafiran dan kemaksiatan' tentu sudah."
  }
]