[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Diatas tempat-tempat yang mewah,orang orang beriman melihat kemuliaan dan kenikmatan yang Allah berikan kepada mereka di surga. salah satu terbesar dari nikmat itu adalah melihat kepada wajah Allah yang mulia. Apakah orang-orang kafir itu dibalas sesuai dengan amal perbuatan mereka,yakni balasan yang pas dengan apa yang mereka lakukan didunia. Yaitu keburukan dan dosa-dosa? ya,mereka dibalas dengan balasan yang penuh dan paling adil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sungguh orang-orang kafir telah mendapatkan balasan amal perbuatan yang dahulu mereka lakukan di dunia berupa siksa yang menghinakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا۟ يَفْعَلُونَ (Sesungguhnya orang-orang kafir telah diberi ganjaran terhadap apa yang dahulu mereka kerjakan) Yakni orang-orang kafir telah dibalas atas perbuatan mereka di dunia menertawakan dan menghina orang-orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "29-36 . Dunia bukanlah akhir dari segala perjalanan : { إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ } tatkala orang-orang berdosa menertawakan orang-orang beriman atas ketaatan mereka didunia kepada Allah, maka pada hari kiamat keadaan akan terbalik orang-orang beriman akan menertawakan orang-orang kafir pula atas azab yang ditimpakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Apakah perbuatan orang-orang kafir di dunia yang mengolok-olok dan mencemooh itu dibalas dengan balasan setimpal? Makna tatswib adalah memberi balasan yang sering digunakan untuk mengungkapkan balasan baik. Namun pada konteks ini digunakan sebagai cemoohan terhadap orang kafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang-orang kafir itu telah diberi balasan} diberi balasan {terhadap apa yang selalu mereka kerjakan}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 34-36 Karena itulah balasan mereka di akhirat sesuai dengan amal perbuatan meraka. Allah berfirman, “Maka pada hari ini,” yaitu Hari Kiamat, “orang-orang yang beriman menertawakan orang-orang kafir,” ketika melihat mereka terbolalk-balik dalam azab dan semua yang dulu mereka dustakan telah lenyap, sedangkan orang-orang yang beriman berada di puncak kenikmatan dan ketenangan, “mereka (duduk) di atas dipan-dipan,” ranjang yang berhias, “sambil memandang,” kenikmatan yang dijanjikan Allah pada mereka dan memandang wajah Rabb mereka Yang Mulia. “Sesungguhnya orang-orang kafir telah diberi ganjaran tehadap apa yang dahulu mereka kerjakan,” yakni, mereka diberi balasan sesuai amal perbuatan mereka. Sebagaimana mereka menertawakan orang-orang Mukmin ketika berada di dunia dan menuduh mereka sebagai orang-orang sesat, maka di akhirat orang-orang yang beriman menertawakan mereka ketika melihat mereka berada dalam siksaan yang merupakan azab kesesatan. Ya, mereka diberi balasan atas apa yang telah lakukan sebagai keadilan dan kebijaksanaan dari Allah dan Allah Maha Mengetahui lagi Mahabijaksana."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ هَلْ ثُوِّبَ الْكُفَّارُ } Apakah orang-orang kafir itu mendapat balasan dari amalan mereka, tapi maksud sbenarnya dari ayat ini adalah pertanyaan penetapan, yakni orang-orang kafir telah diberi balasan atas apa yang telah mereka lakukan didunia. Dan diawal surah kita melihat kondisi orang-orang yang keras hatinya : { وَيْلٌ لِلْمُطَفِّفِينَ , الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ , وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ يُخْسِرُونَ } perhatikanlah bagaimana mereka menipu orang-orang dengan kecurangannya, kita meihat bagaimana mereka mengambil harta orang lain dengan cara yang tidak benar, selain itu mereka pun kerap merendahkan kedudukan orang lain, menghina mereka, seperti yang disebutkan pada ayat-ayat akhir dari surah iniز Dan hasilnya : bahwasanya orang-orang kafir dan orang-orang munafik dan para pelaku kemaksiatan walaupun mereka dapat bebas melakukan apa yang mereka inginkan walaupun mereka bangga dengan apa yang mereka katakan tentang orang-orang beriman, akan tetapi sesungguhnya semua keadaan yang brkaitan dengan kelakuan mereka pasti akan terbalik, orang-orang beriman yang telah bersabar atas kekejian yang dilakukan oleh kaum kuffar kepada mereka, tapi akan tiba masanya mereka akan menghadapi keadaan yang lebih buruk dari apa yang telah dihadapi oleh kaum muslimin, dan keadaan itu akan terus berlanjut tanpa henti."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ \" Sesungguhnya orang-orang kafir telah diberi ganjaran terhadap apa yang dahulu mereka kerjakan.\" diberi pahala maknanya dalah diberi ganjaran, dan هَلْ adalah untuk mengungkapkan ketetapan.sehingga maknanya: Bahwa Allah Ta’ala telah memberikan balasan perbuatan mereka di dunia. Dialah Allah subhaanahu Wa Ta’ala Yang Maha Bijaksana lagi Maha Adil. Kebiksanaannya melingkupi keadilan dan karunia. Jika dikaitkan dengan orang-orang yang beriman maka kebijaksanaan dan pahalanya adalah karunia, sedangkan jika dikaitkan denagn orang kafir maka kebijaksanaan dan balasan-Nya adalah keadilan. Maka segala puji bagi Allah Rabb alam semesta. Dengan demikian, sempurnalah pembahasan yang Allah ‘Azza Wa Jalla mudahkan berkaitan dengan surat al-Muthafifiin. Kita memohon kepada Allah agar memberikan manfaat kepada kita semua dengan pembahasan ini, dan menjadikan kita sebagai orang yang dapat mengambil pelajaran.Sungguh dialah Yang Maha Dermawan lagi Maha Mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 36: Kemudian Allah berkata dengan menyindir dan mengolok-olok mereka (orang-orang kafir) : Apakah telah dibalas orang-orang yang telah kafir dengan adzab, dengan sebab apa yang telah mereka lakukan di kehidupan mereka (di dunia) yaitu dari kesyirikan, kedzaliman dan kesesatan ? Mereka menjawab : Benar, (kami) telah di ganjar dengan adzab yang tidaklah mengetahui seorang pun kecuali hanya Rabbul Alamin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bukankah mereka telah diberi balasan sesuai yang mereka kerjakan? Oleh karena mereka (orang-orang kafir) menertawakan orang-orang mukmin di dunia serta menuduh mereka telah sesat, maka orang-orang mukmin akan menertawakan mereka di akhirat dan akan melihat mereka dalam azab dan siksaan akibat kesesatan mereka. Mereka benar-benar telah dibalas sesuai yang mereka kerjakan sebagai keadilan Allah dan kebijaksanaan-Nya, dan Allah Maha Mengetahui lagi Mahabijaksana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 36",
    "description": "Saat orang-orang kafir itu di akhirat nanti mendapat siksa jahim, tertutup dari rahmat tuhan, dan mendapat hinaan dari orang mukmin yang dahulu mereka hina, apakah orang-orang kafir itu sudah diberi balasan dan hukuman setimpal terhadap apa yang telah mereka perbuat di dunia dulu, berupa kekafiran dan kemaksiatan' tentu sudah. 1-2. Apabila langit yang kukuh itu terbelah ketika Allah menghilangkan keseimbangan di antara benda-benda langit. Terjadilah tabrakan antarbenda langit. Langit pun terbelah lalu digulung dan akhirnya terempas tidak berbekas. Dan langit pada saat itu patuh kepada tuhan pencipta dan pengatur-Nya, dan sudah semestinya langit itu patuh, demikian pula alam raya, kepada tuhan (lihat: surah fussilat/41: 11)."
  }
]