[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Azab besar bagi orang orang yang curang dalam takaran dan timbangannya, Yaitu orang orang yang bila mereka membeli dari manusia dengan takaran atau timbangan,mereka menakar dan menimbang secara penuh, Tetapi manakala mereka menimbang dan menakar untuk manusia,mereka mengurangi timbangan dan takaran. Bagaimana keadaan orang yang mencuri dan mengambil barang barang yang ditakar dan ditimbang,serta mengurangi hak-hak manusia? dia lebih patut diancam daripada orang orang yang mengurangi takaran dan timbangan. Apakah orang-orang yang berbuat curang itu tidak yakin bahwa Allah akan membangkitkan mereka dan menghisab amal perbuatan mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Apakah orang-orang yang melakukan kemungkaran ini tidak meyakini bahwa mereka akan dibangkitkan kepada Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-6. Allah mengolok orang-orang yang mengingkari hari kebangkitan dan perhitungan: tidakkah orang-orang yang curang dalam menimbang dan menakar itu mengetahui bahwa Allah akan mengeluarkan mereka dari dalam kubur dalam keadaan hidup pada hari kiamat yang sangat mengerikan? Hari ketika seluruh hamba akan berdiri menghadap Tuhan mereka untuk menjalani hisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. أَلَا يَظُنُّ أُو۟لٰٓئِكَ أَنَّهُم مَّبْعُوثُونَ (Tidaklah orang-orang itu menyangka, bahwa sesungguhnya mereka akan dibangkitkan) Yakni tidak terbesit dalam fikiran mereka bahwa mereka akan dibangkitkan dan akan ditanya atas apa yang telah mereka lakukan. Maka mengapa mereka tidak mengiranya sehingga mereka dapat menghayati hal itu sehingga dapat meninggalkan apa yang mereka takutkan akibatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Apakah mereka merasa aman dari azab yang akan diterima orang-orang yang mengurangi timbangan, padahal mereka akan dibangkitkan, amal mereka ditimbang. Apakah mereka tidak memikirkan azab atas perbuatan mereka?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak mengira bahwa sesungguhnya mereka akan dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Madaniyah Ayat 1-6 “Kecelakaan besarlah,” adalah kata-kata azab dan siksaan, “bagi orang-orang yang curang.” Ini dijelaskan oleh Allah dengan FirmanNya kemudian, “(Yaitu) orang-orang yang apabila menerima takaran dari orang lain,” yakni mengambil dari mereka sebagai timbal balik, mereka menginginkannya secara utuh, tidak kurang, “dan apabila mereka menakar atau menimbang untuk orang lain,” yakni bila memberikan hak orang lain yang harus ditunaikan dengan takaran atau timbangan, “mereka mengurangi,” yakni menguranginya dengan cara mengurangi takaran atau dengan cara lainnya. Ini adalah pencurian harta orang lain dan tidak bersikap adil terhadap mereka. Karena ancaman ini ditunjukkan pada orang yang mengurangi takaran dan timbangan orang lain, maka orang yang mengambil harta orang lain secara paksa atau dengan cara mencuri, tentu lebih berhak mendapatkan ancaman ini dari orang-orang yang sekedar berbuat curang. Ayat mulia ini menunjukkan bahwa orang sebagaimana berhak mendapatkan haknya dari orang lain, ia juga harus memberikan semua milik orang lain secara penuh, baik berupa harta maupun yang lain. Bahkan hujjah dan pernyataan juga termasuk dalam keumuman ayat ini. Biasanya, masing-masing dari dua orang yang berdebat berusaha mempertahankan hujjahnya, ia juga berkewajiban menjelaskan hujjah rivalnya yang tidak ia ketahui dan mempertimbangkan argumen-argumen rivalnya sebagaimana ia juga harus mempertimbangkan argumen-argumennya sendiri. Di sini dapat diketahui sikap obyektif atau fanatisme seseorang, kerendahan hati atau kesombongan, berakal atau bodoh. Semoga Allah berkenan menolong kita pada setiap kebaikan. Selanjutnya Allah mengancam orang-orang yang berbuat curang serta merasa bangga atas kondisi mereka serta tetapnya mereka berada di atas kecurangan seraya berfirman, “Tidaklah orang-orang itu yakin, bahwa sesungguhnya mereka akan dibangkitkan, pada suatu hari yang besar, (yaitu) hari (ketika) manusia berdiri menghadap Rabb semesta alam?” yang mendorong mereka untuk berbuat curang adalah tidak beriman pada Hari Akhir, sebab bila mereka beriman pada Hari Akhir dan mereka mengetahui akan berdiri di hadapan Allah yang akan menghisab mereka atas amalan kecil dan besar, niscaya mereka menjauhkan diri mereka dari kecurangan dan bertaubat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tidak mereka yang berbuat curang itu mengira bahwa mereka akan dibangkitan kembali setelah mereka mati, dibangkitkan kembali pada hari pembalasan dan perhitungan amalan, dan mereka akan melihat apa yang telah mereka kerjakan didunia. Dalam riwayat lain dikatakan : bahwa makna ( ّيَظُن ) disini adalah meyakini, sebagaimana yang dituliskan dalam ayat lain : { الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ } ( (yaitu) orang-orang yang meyakini, bahwa mereka akan menemui Tuhannya, dan bahwa mereka akan kembali kepada-Nya. ) [ Al Baqarah : 46 ] { أَلَا يَظُنُّ } yakni : apakah mereka tidak meyakini dan mempercayai bahwasanya akan datang waktunya manusia dibangkitkan kembali dari kuburnya kemudian mereka dibawah kesuatu tempat dimana semua manusia berkumpul ditempat itu untuk dihisab amalan mereka, kemudian setelah itu mereka akan mendapat balasan ata ganjaran dari amalan-amalan yang mereka kerjakan didunia, akan tetapi orang-orang kafir dan musyrikin tidak meyakini adanya peristiwa ini, mereka hanya mengira bahwa apa yang telah mereka lakukan akan pergi begitu saja, setelah mereka mengambil harta orang lain lalu kemudian perkara itu selesai, mereka telah berbuat zholim dan mengira bahwa kezholiman mereka tidak akan dipertanggung jawakan. Tapi sesungguhnya hari kiamat itu benar-benar akan terjadi, dan setiap perbuatan akan ada balasannya, pada hari itu juga Allah akan mengumpulkan secara khusus mereka yang terzholimi dan akan dikembalikan hak-hak mereka dari para pelaku kezholiman itu, lalu apakah hak mereka dikembalikan seperti yang diambil dari mereka didunia.. ? tidak.. akan tetapi hak-hak mereka dikembalikan dengan dipindahkannya kebaikan-kebaikan dari para pelaku kezholiman itu. Pengadilan pada hari kiamat tidak dengan dirham ataupun dinar, melainkan dengan amalan ; baik itu amalan kebaikan atau keburukan, maka mereka yang telah berbuat zholim akan diambil kebaikan-kebaikan mereka dan diberikan kepada orang ia zholimi didunia, dan jika kebiakan mereka telah habis maka mereka akan binasa dalam neraka jahnnam. Para pelaku kezholiman akan rugi dan bangkrut pada hari itu sebagaimana mereka telah merugikan orang lain ketika didunia, maka menjadi pelajaran dan peringatan bagi mereka yang terlibat dalam tranasaksi jual beli."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta’ala berfirman: أَلَا يَظُنُّ أُولَئِكَ أَنَّهُمْ مَبْعُوثُونَ \" Tidakkah orang-orang itu yakin, bahwa sesungguhnya mereka akan dibangkitkan,\" Tidakkah mereka meyakini dan mengetahui secara yakin, karena الظَّن [azh-zhonn: menduga] yang bermakna yakin sangat banyak dalam al-Quran seperti dalam firman-Nya Ta’ala: الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ “(yaitu) orang-orang yang meyakini, bahwa mereka akan menemui Tuhannya, dan bahwa mereka akan kembali kepada-Nya.”(QS. Al-Baqarah: 46) firman Allah: الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ “(yaitu) orang-orang yang meyakini, bahwa mereka akan menemui Tuhannya”Mereka yakin bahwa mereka akan menemui Allah, tetapi Azh-zhann juga banyak digunakan dengan makna yakin dalam bahasa arab juga. Dalam ayat ini Allah ‘Azza Wa Jalla berfirman: أَلَا يَظُنُّ أُولَئِكَ أَنَّهُمْ مَبْعُوثُونَ \" Tidakkah orang-orang itu yakin, bahwa sesungguhnya mereka akan dibangkitkan,\" tidakkah mereka meyakini bahwa mereka akan dibangkitkan, yakni dikeluarkan dari kubur-kubur mereka untuk Allah Rabb semesta alam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 4: Allah takjub (heran) dengan mereka Al Muthaffifin dan berkata : Tidakkah mereka tahu akan konsekuensi dari kedzaliman (mereka) yang nanti akan (dibalas) ketika dibangkitkan di hari kiamat ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengancam kembali orang-orang yang berlaku curang itu, dan mengapa mereka masih saja melakukan kecurangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 4",
    "description": "4-5. Allah mengecam mereka, 'mengapa mereka berbuat curang' tidaklah mereka itu mengira bahwa sesungguhnya mereka akan dibangkitkan, pada suatu hari yang besar, yaitu hari kebangkitan yang penuh kejadian mengerikan dan menegangkan''4-5"
  }
]