[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-6. Pembangkitan mereka akan terjadi pada hari yang sangat menakutkan, Hari yang mana manusia akan bangkit berdiri dihadapan Allah kemudian Allah menghitung amal yang sedikit dan yang banyak. Hari itu mereka semuanya tunduk kepada tuhan alam semesta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Suatu hari di saat manusia berdiri untuk menghadap Rabb segala makhluk untuk dihisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعٰلَمِينَ ((yaitu) hari (ketika) manusia berdiri menghadap Tuhan semesta alam?) Yakni mereka menunggu sambil berdiri keputusan Tuhan semesta alam, atau menunggu balasan dan hisab-Nya. Ayat ini menunjukkan besarnya dosa mengurangi takaran atau timbangan, dan betapa buruk siksa akan diberikan. Hal ini karena dalam perbuatan tersebut terdapat pengkhianatan terhadap amanat, serta memakan harta orang lain dengan cara yang tidak benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. Mereka akan dibangkitkan pada hari yang penuh dengan bencana dan hiruk pikuk yaitu hari kiamat. Hari dimana mereka dibangkitkan dari kubur, kemudian menghadap Allah untuk dihisab dan diberi balasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari (ketika) manusia bangkit menghadap Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Madaniyah Ayat 1-6 “Kecelakaan besarlah,” adalah kata-kata azab dan siksaan, “bagi orang-orang yang curang.” Ini dijelaskan oleh Allah dengan FirmanNya kemudian, “(Yaitu) orang-orang yang apabila menerima takaran dari orang lain,” yakni mengambil dari mereka sebagai timbal balik, mereka menginginkannya secara utuh, tidak kurang, “dan apabila mereka menakar atau menimbang untuk orang lain,” yakni bila memberikan hak orang lain yang harus ditunaikan dengan takaran atau timbangan, “mereka mengurangi,” yakni menguranginya dengan cara mengurangi takaran atau dengan cara lainnya. Ini adalah pencurian harta orang lain dan tidak bersikap adil terhadap mereka. Karena ancaman ini ditunjukkan pada orang yang mengurangi takaran dan timbangan orang lain, maka orang yang mengambil harta orang lain secara paksa atau dengan cara mencuri, tentu lebih berhak mendapatkan ancaman ini dari orang-orang yang sekedar berbuat curang. Ayat mulia ini menunjukkan bahwa orang sebagaimana berhak mendapatkan haknya dari orang lain, ia juga harus memberikan semua milik orang lain secara penuh, baik berupa harta maupun yang lain. Bahkan hujjah dan pernyataan juga termasuk dalam keumuman ayat ini. Biasanya, masing-masing dari dua orang yang berdebat berusaha mempertahankan hujjahnya, ia juga berkewajiban menjelaskan hujjah rivalnya yang tidak ia ketahui dan mempertimbangkan argumen-argumen rivalnya sebagaimana ia juga harus mempertimbangkan argumen-argumennya sendiri. Di sini dapat diketahui sikap obyektif atau fanatisme seseorang, kerendahan hati atau kesombongan, berakal atau bodoh. Semoga Allah berkenan menolong kita pada setiap kebaikan. Selanjutnya Allah mengancam orang-orang yang berbuat curang serta merasa bangga atas kondisi mereka serta tetapnya mereka berada di atas kecurangan seraya berfirman, “Tidaklah orang-orang itu yakin, bahwa sesungguhnya mereka akan dibangkitkan, pada suatu hari yang besar, (yaitu) hari (ketika) manusia berdiri menghadap Rabb semesta alam?” yang mendorong mereka untuk berbuat curang adalah tidak beriman pada Hari Akhir, sebab bila mereka beriman pada Hari Akhir dan mereka mengetahui akan berdiri di hadapan Allah yang akan menghisab mereka atas amalan kecil dan besar, niscaya mereka menjauhkan diri mereka dari kecurangan dan bertaubat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Di hari yang agung itu semua manusia akan bangkit dari kubur mereka, dan dikala itulah mereka akan diutus ke padang mahsyar untuk disidang. Dalam riwata lain dikatakan : { يَوْمَ يَقُومُ النَّاسُ } yakni semua manusia di padang mahsyar berdiri dihadapan Tuhannya selama lma puluh ribu tahun tanpa beralaskan kaki dan tidak pula berbusana apapun dan mata mereka semua terbelalak ketika matahari tepat berada diatas kepala mereka, sebagian dari mereka ada yang keringatnya menggelamkan seluruh tubuh mereka, ada juga yang keringatnya meneggelamkan kedua telingannya, keadaan manusia ketika berbeda-beda dan mengerikan. Hari ketika manusia menghadap ( لِرَبِّ الْعَالَمِينَ ) Tuhan semesta alam, dan ( الْعَالَمِينَ ) kata jamak dari ( العالم ) yaitu seluruh makhluk disebut \"العالم\" alam , semua yang berwujud selain Allah ﷻ disebut \"العالم\" alam ( makhluk ). Dan alam itu sendiri berbeda-beda : ada alam jin, alam manusia, alam burung-burung, alam binatang, alam tumbuh-tumbuhan, Allah menciptakan alam yang luas ini dengan penngelompokan yang berbeda-beda, Dialah Allah ﷻ yang mengatur segala keadaan di alam yang luas ini, Dia yang menciptakannya dan Dia pula yang akan menghancurkan dengan kuasa-Nya ﷻ , semua makhluk yang ada di alam ini Allah lah yang memberikannya makan, Dialah yang menjaganya, Dialah Allah ﷻ \"Rabb\" semesta alam, ( ّالرَب ) makna \"Rabb\" disini adalah : Yang mendidik hamba-Nya dengan melimpahkan kepadanya nikmat yang banyak, Dialah \"Rabb\" yang mendidik akal dan fikiran hamba-Nya, serta mendidik Aqidah mereka dengan pemahaman yang benar, adapun makna lain dari \"Rabb\" adalah : Pemilik, Pencipta, Dan Allah lah pemilik dan pencipta alam semesta ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ “(yaitu) hari (ketika) manusia berdiri menghadap Rabb semesta alam? ”Maknanya: Hari yang agung ini adalah يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ “(yaitu) hari (ketika) manusia berdiri menghadap Rabb semesta alam? Dialah Alla Tabaraka wa Ta’ala: Mereka akan bangkit dari kubur-kubur mereka dalam keadaan tidak beralas kaki baik sendal maupun khuff, telanjang tanpa baju, gamis, celana sarung dan kain penutup, tidak dalam keadaan telah dikhitan maknanya kulit ujung kemaluannya yang dikhitan akan kembali sediakala pada pemiliknya, sebagaimana Allah Ta’ala berfirman: كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ “Sebagaimana Kami telah memulai penciptaan pertama begitulah Kami akan mengulanginya.”(QS. Al-Anbiya: 104) Allah akan mengembalikannya untuk menjelaskan kesempuarnaan kuasa-Nya Ta’ala. Bahwa Dia akan mengembalikan penciptaan sebagaimana mereka tercipta pertama kali, kulit kemaluan dikhitan ketika di dunia bertujuan agar membersihkan dari kotoran-kotoran, karena jika dibiarkan akan tersisa najis berupa air kencing, yang menghalangi kotoran. Tetapi ini di akhirat nanti tidak diperlukan lagi, karena penghuni surga kelak tidak akan kencing dan tidak akan buang kotoran, karena akhirat bukanlah negeri pembebanan tatapi di sana adalah negeri pembalasan, hanya saja Allah subhanahu wa ta’ala memberikan beban sebagai bentuk ujian sebagaimana Allah Ta’ala berfirman: يَوْمَ يُكْشَفُ عَنْ سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ (42) خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ وَقَدْ كَانُوا يُدْعَوْنَ إِلَى السُّجُودِ وَهُمْ سَالِمُونَ “Pada hari betis disingkapkan dan mereka dipanggil untuk bersujud; maka mereka tidak kuasa, (dalam keadaan) pandangan mereka tunduk ke bawah, lagi mereka diliputi kehinaan. Dan sesungguhnya mereka dahulu (di dunia) diseru untuk bersujud, dan mereka dalam keadaan sejahtera.”(QS. Al-Qolam: 42-43) Manusia saat itu dalam keadaan, tak beralas kaki, telanjang, tak dikhitan, sebagaian hadits menyebutkan tambahan: Buhman Para ulama mengatakan: Al-Buhm maknanya adalah orang-orang yang mempunyai harta sama sekali, pada hari kiamat kelak, manusia tidak akan punya harta yang bisa dijadikan tebusan dari siksa di hari kiamat. Tidak akan ada anak yang meberikan balasan dari bapaknya sedikit pun begitu pun sebaliknya, tidak juga seorang istri, kabilah, semua orang akan mengatakan: Diriku diriku : لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ “Setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya.”(QS. Abasa: 37) Kita memohon kepada Allah Ta’ala agar menolong kita dari kejadian-kejadian mengerikan hari kiamat dan memudahkan kita. Allah Ta’ala berfirman: لِرَبِّ الْعَالَمِينَ “ Kepada Rabba semesta alam” Dialah Allah Jalla Wa ‘Ala, pada hari itu semua kerajaan akan hancur kecuali kerajaan Rabb semesta alam Jalla Wa ‘Ala, Allah Tala’ala berfirman: يَوْمَ هُمْ بَارِزُونَ لَا يَخْفَى عَلَى اللَّهِ مِنْهُمْ شَيْءٌ لِمَنِ الْمُلْكُ الْيَوْمَ لِلَّهِ الْوَاحِدِ الْقَهَّارِ (16) الْيَوْمَ تُجْزَى كُلُّ نَفْسٍ بِمَا كَسَبَتْ لَا ظُلْمَ الْيَوْمَ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ “(yaitu) hari (ketika) mereka keluar (dari kubur); tiada suatu pun dari keadaan mereka yang tersembunyi bagi Allah. (Lalu Allah berfirman): Kepunyaan siapakah kerajaan pada hari ini?\" epunyaan Allah Yang Maha Esa lagi Maha Mengalahkan. Pada hari ini tiap-tiap jiwa diberi balasan dengan apa yang diusahakannya. Tidak ada yang dirugikan pada hari ini. Sesungguhnya Allah amat cepat hisabnya.”(QS. Ghafir: 16-17)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 6: Hari itu adalah hari dimana manusia berhenti di hadapan Allah untuk ditampakkan dan dihisab (amalan-amalan mereka), mereka tunduk di hadapan Allah (Rabbul Alamin). Setiap dari mereka menunggu dan meminta keselamatan kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari kubur mereka. Untuk dihisab dan diberikan pembalasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 6",
    "description": "Yaitu pada hari ketika semua orang bangkit dari kubur mereka untuk menghadap tuhan seluruh alam. Tuhan akan menghisab perilaku mereka. Pada saat itu tidak ada kekuasaan selain kuasa Allah. 7. Allah menegur sekali lagi perilaku mereka, 'sekali-kali jangan begitu; jangan berbuat curang! sesungguhnya catatan perbuatan orang yang durhaka, berbuat jahat, melanggar aturan agama, dan merugikan orang lain dalam bentuk apa pun, benar-benar tersimpan dengan baik dalam sijjin. '."
  }
]