[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Benar,tempat kembali orang orang durhaka adalah tempat yang sempit. Tahukah kamu apakah tempat yang sempit ini? Ia adalah penjara abadi dan azab yang pedih. Inilah yang ditulis bagi mereka untuk kembali kepadanya,ditetapkan dan diberlakukan,tidak ditambah dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Perkaranya tidak seperti yang kalian bayangkan, bahwa tidak ada kebangkitan setelah kematian. Sesungguhnya kitab orang-orang yang durhaka dari golongan orang-orang kafir dan munafik itu berada dalam kerugian di lapisan tanah terbawah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Kenyataannya tidak seperti yang mereka kira, namun mereka akan mendapat balasan atas kecurangan mereka; bahkan dosa-dosa besar yang tercatat dalam kitab-kitab yang ada di dasar bumi tidak akan berubah. Dan tahukah kamu apa itu sijjin? Ia adalah kitab yang mencatat segala keburukan yang telah mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. كَلَّآ إِنَّ كِتٰبَ الْفُجَّارِ لَفِى سِجِّينٍ (Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka tersimpan dalam sijjin) Yakni orang-orang yang durhaka yang termasuk diantaranya adalah orang-orang yang mengurangi takaran dan timbangan, tertulis sebagai penghuni neraka; atau akan dimasukkan ke dalam penjara dan kesempitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Jangan begitu! Ungkapan untuk memperingatkan pendengarnya tentang kehidupan setelah mati. Sesungguhnya catatan amal orang-orang kafir tersimpan dalam golongan ahli neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sekali-kali begitu! Sesungguhnya catatan orang yang durhaka benar-benar ada dalam Sijjīn} lapisan ketujuh paling bawah dari bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 7-9 Allah berfirman, “Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka,” ini mencakup seluruh orang yang durhaka dari berbagai macam orang-orang kafir, munafik, dan fasik, “tersimpan dalam sijjin,” kemudian Allah menafsirkannya dengan FirmanNya, “Tahukah kamu apakah sijjin itu? (Ialah) kitab yang bertulis,” yakni, kitab catatan amal yang di dalamnya tercatat amalan-amalan buruk mereka. Sijjin adalah tempat yang sempit. Sijjin lawan dari illiyyin yang merupakan tempat kitab catatan orang-orang baik sebagaimana akan dijelaskan selanjutnya. Ada yang menyatakan, sijjin adalah bumi ketujuh yang paling bawah dan tempat kembali orang-orang durhaka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Benar, { إِنَّ كِتَابَ الْفُجَّارِ } kitab amalan orang-orang durhaka , { الْفُجَّارِ } yaitu orang-orang yang keluar dari ketaatan kepada Allah, yaitu mereka yang melakukan kemungkaran dan kefasikan serta kekafiran. { لَفِي سِجِّينٍ } kitab amalan mereka disimpan setelah mereka mati ditempat yang sangat sempit, dalam riwayat lain dikatakan : { سِجِّينٍ } yakni, salah satu nama dari nama-nama neraka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ “Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka tersimpan dalam sijjin.” كَلَّا [Kalla] dalam al-Quran datang dengan banyak makna disesuaikan dengan konteks ayat, terkadang ia sebagah kata sanggahan dan bantahan dan terkadang bermakna “benar-benar” bisa juga bermakna lainnya yang disesusiakan dengan konteksnya, karena kosa kata dalam bahasa arab tidak ada yang memiliki makna secara zatnya yang tidak mungkin bermakna lain, tetapi banyak sekali kosa kata dalam bahasa arab memiliki makna yang banyak yang dapat berbeda disesuaikan dengan konteks pembicaraannya. Pada ayat ini Allah ‘Azza Wa Jalla berfirman: كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ Maka bisa dimungkinkan bermakna “Benar-benar sungguh buku orang-orang fajir dalam sijjin, atau bisa juga bermakna bantahan terhadap pendustaan terhadap hari akhir. Yang terpenting Allah Ta’ala menjelaskan dalam ayat yang mulia ini bahwa buku catatan orang-orang yang fajir di dalam sijjin, sedangkan makna sijjid dijelaskan okeh para ulama: bahwa ia diambil dari kata السجن As-Sijnu yang berarti sempit. Jadi maknanya adalah tempat yang sempit yaitu neraka jahannam wal-‘iyaadzu billaah, sebagaimana Allah Tabaaraka Wa Ta’ala berfirman: وَإِذَا أُلْقُوا مِنْهَا مَكَانًا ضَيِّقًا مُقَرَّنِينَ دَعَوْا هُنَالِكَ ثُبُورًا (13) لَا تَدْعُوا الْيَوْمَ ثُبُورًا وَاحِدًا وَادْعُوا ثُبُورًا كَثِيرًا “Dan apabila mereka dilemparkan ke tempat yang sempit di neraka itu dengan dibelenggu, mereka di sana mengharapkan kebinasaan. (Akan dikatakan kepada mereka): \"Jangan kamu sekalian mengharapkan satu kebinasaan, melainkan harapkanlah kebinasaan yang banyak.”(QS. Al-Furqan: 13-14). Dalam hadits Al-Barra Bin ‘Azib yang panjang yang terkenal dalam mengisahkan orang yang hampir meninggal dan yang terjadi setelah kematian, bahwa Allah Subhaanahu Wa Ta’ala berfirman: اُكْتُبُوا كِتَابَ عَبْدِي فِي السِّجِّيْنَ فِيْ الْأَرْضِ السَّابِعَةِ السُّفْلَى “ Tulislah ketentuan untuk hambaku –yang kafir- ke dalam sijjin di dalam lapisan bumi yang ke tujuh yang terdalam ”(1) maka Sijjin itu adalah bumi yang terdalam yang itulah tempat menetapnya api, kita berlindung kepada Allah darinya, kitab ini di sijjin. (1) Dikeluarkan Ahmad (18063) dinyatakan shahih oleh al-Albaniy dalam shahihuljaami' (1676)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 7: 7-9. Kemudian Allah mengancam mereka (Muthaffifin) dan berkata : Menjauhlah kalian wahai orang-orang yang curang, dari kelalaian hari kebangkitan dan pembalasan (jika mampu), karena seseungguhnya amalan buruk (kalian) telah dibukukan. Dan bagi merka orang-orang munafik tempat kembalinya adalah di neraka yang sempit, gelap dan paling dasar. Apakah kalian tahu apa yang dimaksud tempat yang sempit dan gelap ini ? Ia adalah Sijn yang adzab (di dalamnya) sangat keras dan pedih, tertulis di dalamnya nama-nama orang yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata “Kalla” di ayat ini bisa diartikan “Tentu atau pasti”. Seperti orang-orang kafir, orang-orang munafik dan orang-orang fasik. Kitab yang mencatat perbuatan orang-orang yang durhaka seperti para setan, orang-orang kafir dan orang-orang munafik tersimpan di Sijjin. Ada yang berpendapat, bahwa Sijjin adalah sumur di neraka Jahannam, dan ada pula yang berpendapat bahwa Sijjin adalah tempat paling bawah di bumi ketujuh yang merupakan tempat kembali orang-orang yang durhaka. Menurut Ibnu Katsir, yang benar bahwa Sijjiin diambil dari kata sajn yang artinya sempit. Karena semua makhluk setiap kali ke bawah, maka tempatnya semakin sempit, sedangkan jika semakin ke atas, maka (tempatnya) semakin luas, demikian juga karena tempat kembali orang-orang durhaka adalah ke neraka Jahannam yang tempatnya berada di paling bawah atau rendah. Ayat ini menunjukkan bahwa neraka berada di bawah, sedangkan surga berada di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 7",
    "description": "Allah menegur sekali lagi perilaku mereka, 'sekali-kali jangan begitu; jangan berbuat curang! sesungguhnya catatan perbuatan orang yang durhaka, berbuat jahat, melanggar aturan agama, dan merugikan orang lain dalam bentuk apa pun, benar-benar tersimpan dengan baik dalam sijjin. '8. Allah mengajukan pertanyaan untuk memberi kesan betapa besar dan serius persoalan ini, 'dan tahukah engkau apakah sijjin itu''."
  }
]