[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Benar,tempat kembali orang orang durhaka adalah tempat yang sempit. Tahukah kamu apakah tempat yang sempit ini? Ia adalah penjara abadi dan azab yang pedih. Inilah yang ditulis bagi mereka untuk kembali kepadanya,ditetapkan dan diberlakukan,tidak ditambah dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Tahukah kamu -wahai Rasul- apa sijjin itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Apakah kamu tahu apa itu catatan Sijjin? Itu adalah catatan amal ahli neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu mengetahui apa itu Sijjīn"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 7-9 Allah berfirman, “Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka,” ini mencakup seluruh orang yang durhaka dari berbagai macam orang-orang kafir, munafik, dan fasik, “tersimpan dalam sijjin,” kemudian Allah menafsirkannya dengan FirmanNya, “Tahukah kamu apakah sijjin itu? (Ialah) kitab yang bertulis,” yakni, kitab catatan amal yang di dalamnya tercatat amalan-amalan buruk mereka. Sijjin adalah tempat yang sempit. Sijjin lawan dari illiyyin yang merupakan tempat kitab catatan orang-orang baik sebagaimana akan dijelaskan selanjutnya. Ada yang menyatakan, sijjin adalah bumi ketujuh yang paling bawah dan tempat kembali orang-orang durhaka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tahukah kamu apakah tempat yang sempit itu ?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah ‘Azza Wa Jalla mengagungkan sijjin dengan firman-Nya: وَمَا أَدْرَاكَ مَا سِجِّينٌ “Tahukah, kamu apakah sijjin itu?” Kata tanya disini tujuannya adalah untuk takdzim membesarkan, maknanya: Apa yang memberitakanmu tentang sijjin? Apa kamu telah mencarinya? Dan apakah anda sudah bertanya sehingga telah dijelaskan kepadamu? Sedangkan takdzim bisa kerena agung dan tingginya kedudukan sesuatu, sebagaimana dalam firman-Nya : كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ “Sekali-kali tidak, sesungguhnya kitab orang-orang berbakti itu (tersimpan) dalam 'Illiyyin.”(QS. Al-Muthafifin: 18) bisa pula untuk mengungkapkan betapa rendah dan hinanya sesuatu, sedangkan takdzim untuk sijjin bukanlah karena tinggi dan agungnya ia namun kerena rendah dan hinanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 8: 7-9. Kemudian Allah mengancam mereka (Muthaffifin) dan berkata : Menjauhlah kalian wahai orang-orang yang curang, dari kelalaian hari kebangkitan dan pembalasan (jika mampu), karena seseungguhnya amalan buruk (kalian) telah dibukukan. Dan bagi merka orang-orang munafik tempat kembalinya adalah di neraka yang sempit, gelap dan paling dasar. Apakah kalian tahu apa yang dimaksud tempat yang sempit dan gelap ini ? Ia adalah Sijn yang adzab (di dalamnya) sangat keras dan pedih, tertulis di dalamnya nama-nama orang yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 8",
    "description": "Allah mengajukan pertanyaan untuk memberi kesan betapa besar dan serius persoalan ini, 'dan tahukah engkau apakah sijjin itu''9. Sijjin yaitu kitab yang berisi catatan perilaku orang yang melakukan kejahatan dan akan diperlihatkan kepada mereka pada hari kiamat nanti untuk menjadi bukti kejahatan mereka."
  }
]