[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Benar,tempat kembali orang orang durhaka adalah tempat yang sempit. Tahukah kamu apakah tempat yang sempit ini? Ia adalah penjara abadi dan azab yang pedih. Inilah yang ditulis bagi mereka untuk kembali kepadanya,ditetapkan dan diberlakukan,tidak ditambah dan tidak dikurangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Sesungguhnya kitab mereka itu tertulis, tidak ada penambahan di dalamnya maupun pengurangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. كِتٰبٌ مَّرْقُومٌ (kitab yang bertulis) Yakni kitab yang di dalamnya tertulis nama-nama mereka adalah kitab yang telah berisi tulisan. Pendapat lain mengatakan: asal kata (السجين) adalah (السجيل) yang berarti kitab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Yaitu kitab yang tersusun dengan jelas. Di dalamnya terdapat catatan nama-nama orang durhaka. Orang yang membacanya akan tahu semua kejelekan orang-orang yang tercatat di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) kitab yang berisi catatan} catatan yang berisi bilangan pahala yang tidak bisa dihapus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 7-9 Allah berfirman, “Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka,” ini mencakup seluruh orang yang durhaka dari berbagai macam orang-orang kafir, munafik, dan fasik, “tersimpan dalam sijjin,” kemudian Allah menafsirkannya dengan FirmanNya, “Tahukah kamu apakah sijjin itu? (Ialah) kitab yang bertulis,” yakni, kitab catatan amal yang di dalamnya tercatat amalan-amalan buruk mereka. Sijjin adalah tempat yang sempit. Sijjin lawan dari illiyyin yang merupakan tempat kitab catatan orang-orang baik sebagaimana akan dijelaskan selanjutnya. Ada yang menyatakan, sijjin adalah bumi ketujuh yang paling bawah dan tempat kembali orang-orang durhaka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "( Tempat sempit itu adalah tempat kembali bagi orang-orang yang durhaka ) dan semua perbuatan mereka didunia tertulis dalam { كِتَابٌ مَرْقُومٌ } kitab yang terjaga dengan baik, tiada satu kata pun yang hilang dari kitab itu, Alla berfirman : { مَالِ هَٰذَا الْكِتَابِ لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا ۚ وَوَجَدُوا مَا عَمِلُوا حَاضِرًا ۗ وَلَا يَظْلِمُ رَبُّكَ أَحَدًا } ( kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang juapun”. ) [ Al-Kahfi : 49 ] , walaupun kalian melupakan apa yang telah kalian perbuat didunia, akan tetapi ketahuilah sesungguhnya semua perbuatan kalian tertulis, dan akan diperlihatkan dihadapan kalian di hari kiamat, dan kalian semua akan membacanya, bahkan mereka yang dulunya tidak mampu membaca pada hari itu mereka akan membaca catatan amalan mereka, Allah ﷻ berfirman : { وَنُخْرِجُ لَهُ يَوْمَ الْقِيَامَةِ كِتَابًا يَلْقَاهُ مَنْشُورًا , اقْرَأْ كِتَابَكَ } ( Dan Kami keluarkan baginya pada hari kiamat sebuah kitab yang dijumpainya terbuka , Bacalah kitabmu ) [ Al-Isra' : 13-14 ] , akan dikatakan kepada setiap jiwa { اقْرَأْ كِتَابَكَ } \"bacalah kitabmu\" , maka mereka pun membacanya { كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا } ( cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu ) tidak satupun dari mereka yang bisa mengingkari, semuanya mengakui apa yang telah mereka perbuat. { كِتَابٌ مَرْقُومٌ } Dalam riwayat lain dikatakan : Yakni kitab yang penulisannya telah selesai dan tidak ada tambahan lagi ataupun pengurangan pada tulisannya, dan tidak ada satupun yang berhak merubah isi kitab itu ataupun merobeknya dengan harapan bisa terbebas dari persidangan dihari kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta’ala berfirman: كِتَابٌ مَرْقُومٌ “ buku yang tertulus” kitab pada ayat ini tidak dikembalikan (disandarkan) kepada sijjin tetapi ia kembali kepada kitab yang terdapat dalam firman Allah Ta’ala: كَلَّا إِنَّ كِتَابَ الْفُجَّارِ “Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka” seakan-akan ada pertanyaan: Apa kitab tersebut maka jawabannya: كِتَابٌ مَرْقُومٌ Maknanya: Tertulis, tidak ditambah isinya, dikurangi, diganti atau dirubah, tapi itulah tempat kembali dan menetap mereka wal-‘iyaadzu billaah, abadi selama-lamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muthaffifin ayat 9: 7-9. Kemudian Allah mengancam mereka (Muthaffifin) dan berkata : Menjauhlah kalian wahai orang-orang yang curang, dari kelalaian hari kebangkitan dan pembalasan (jika mampu), karena seseungguhnya amalan buruk (kalian) telah dibukukan. Dan bagi merka orang-orang munafik tempat kembalinya adalah di neraka yang sempit, gelap dan paling dasar. Apakah kalian tahu apa yang dimaksud tempat yang sempit dan gelap ini ? Ia adalah Sijn yang adzab (di dalamnya) sangat keras dan pedih, tertulis di dalamnya nama-nama orang yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kitab yang disebutkan di sana amal mereka yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muthaffifin Ayat 9",
    "description": "Sijjin yaitu kitab yang berisi catatan perilaku orang yang melakukan kejahatan dan akan diperlihatkan kepada mereka pada hari kiamat nanti untuk menjadi bukti kejahatan mereka. 10. Celakalah pada hari itu bagi orang-orang yang mendustakan hari kebangkitan, sebagaimana mereka yang berbuat curang dalam menimbang dan menakar."
  }
]