[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Ha Mim). Pembicaraan tentang huruf-huruf terpisah-pisah (seperti ini) telah hadir di awal Surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ḥā Mīm. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Haamiiim: bermakna kemuliaan al-Qur’an yang terdiri dari huruf kalimat arab, orang arab tidak bisa menentang pemaknaan tersebut, dan untuk mewaspadai kesalahan adanya salah tafsir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ḥā Mīm"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. ini adalah sumpah dengan al-qur’an atas al-qur’an sendiri. Allah bersumpah dengan al-kitab yang nyata untuk segala sesuatu yang perlu dijelaskan, bahwa Dia menurunkannya “pada suatu malam yang diberkahi,” yaitu yang banyak kebaikan dan berkahnya, yaitu malam lailatul qadar, malam yang lebih baik dari seribu bulan. Allah menurunkan perkataan terbaik, di malam terbaik dan di hari terbaik kepada manusia yang juga terbaik dengan bahasa arab yang mulia, agar dijadikan sebagai peringatan bagi kaum yang dilanda kebodohan dan dikuasai oleh kesengsaraan, agar mereka bisa menjadikannya sebagai cahaya dan mengambilnya serta berjalan di belakangnya, agar kebaikan dunia dan akhirat didapatkan, karena Allah berfirman, “sesungguhnya kamilah yang memberi peringatan,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 1: (Ha Mim) hanya Allah sajalah yang mengetahui arti dan maksudnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 1",
    "description": "H' m'm2. Allah bersumpah dalam ayat ini dengan kitab suci Al-Qur'an mengatakan, 'demi kitab, yaitu Al-Qur'an yang menjelaskan petunjuk-petunjuk Allah untuk manusia agar senantiasa berada pada jalan yang benar."
  }
]