[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-12. maka tunggulah orang-orang musyrik itu (wahai Rasul) di hari di mana langit mengeluarkan asapnya yang nyata dan jelas yang menyelimuti manusia. Dikatakan kepada mereka, “Ini adalah azab yang pedih dan menyakitkan.” Kemudian mereka memohon agar diangkat dan dihilangkan dari mereka, “Wahai Tuhan kami, angkatlah azab ini dari kami, bila Engkau mengangkatnya dari kami, maka sesungguhnya kami akan beriman kepadaMu.” Hal ini telah terjadi dan mereka tidak beriman seperti yang mereka janjikan sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Maka tunggulah -wahai Rasul- siksa bagi mereka yang sudah dekat saat langit membawa kabut yang jelas terlihat oleh mata mereka karena begitu sakit."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-14. Hai Rasulullah, tungguhlah hari ketika langit mengeluarkan kabut yang tebal dan jelas, yang menyelimuti seluruh orang kafir dan menimpakan kepada mereka musibah yang besar. Mereka berkata: “Ini merupakan azab yang pedih”. Dan mereka bermunajat kepada Allah: “Ya Tuhan kami, hilangkanlah azab ini dari kami, kami benar-benar telah beriman kepada-Mu.” Mengapa mereka baru tersadar setelah azab turun, padahal Nabi Muhammad telah mendatangkan mereka risalah yang jelas, namun mereka berpaling darinya dan menuduh bahwa risalah itu berasal dari orang lain dan Muhammad hanyalah orang gila!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. مِّن وَرَآئِهِمْ جَهَنَّمُ ۖ (Di hadapan mereka neraka Jahannam) Yakni dibalik kebanggaan dengan dunia dan keangkuhan mereka terhadap kebenaran terdapat Jahannam bagi mereka, dan pasti akan meliputi mereka. Pendapat lain mengatakan bahwa yang dimaksud adalah di depan mereka, sebab mereka menghadap kepada Jahannam. وَلَا يُغْنِى عَنْهُم مَّا كَسَبُوا۟ شَيْـًٔا(dan tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan) Yakni harta dan anak keturunan mereka sama sekali tidak dapat menjauhkan mereka dari azab Allah, serta tidak bermanfaat bagi mereka sedikitpun. وَلَا مَا اتَّخَذُوا۟ مِن دُونِ اللهِ أَوْلِيَآءَ ۖ( dan tidak pula berguna apa yang mereka jadikan sebagai sembahan-sembahan (mereka) dari selain Allah) Yakni patung-patung dan tuhan-tuhan yang mereka sembah selain Allah juga tidak bermanfaat bagi mereka, padahal mereka berhadap dapat memberi mereka manfaat dan menjauhkan mereka dari mudharat. وَلَهُمْ عَذَابٌ عَظِيمٌ (Dan bagi mereka azab yang besar) Yakni azab neraka Jahannam yang ada di depan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Maka Nabi, nantikanlah, apa yang telah dilakukan oleh golongan yang menyekutukan Allah dan mengejek, mereka akan menunggu datangnya awan gelap di atas langit, mereka akan gelisah sebab awan gelap itu seakan-akan seperti asap tebal yang begitu Nampak, itulah salah satu tanda datangnya hari kiamat. Sebagaimana Imam Bukhari dan Imam Muslim meriwayatkan dari Ibn Mas’ud: “ketika kaum Quraisy bermaksiat pada Rasulullah SAW dan menolak Islam, Rasul berdoa:”ya Allah karuniakanlah padaku, sepertujuh daru tujuh yang dimiliki Nabi Yusuf, timpakanlah kekeringan dan kerakusan atas mereka, hingga mereka memakan tulang belulang, kemudian seorang laki-laki menjadi berdoa menghadap langit, dia melihat dianta dirinya dan langit seperti asap kelaparan, dan Allah berfirman: “(maka tunggulah ketika langit membawa….)”, laki-laki tsb mendatangi Rasul dan bertanya: “wahai Rasul mintakanlah hujan pada Allah dari derita ini, maka Rasul memintakan hujan pada Allah, hujan pun turun pada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka tunggulah} maka tunggulah {hari (ketika) langit mendatangkan kabut asap yang jelas} yang jelas dipandang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-16. “maka tunggulah,” yakni, nantikanlah azab yang akan ditimpakan terhadap mereka karena waktunya telah dekat, “hari ketika langit membawa kabut yang nyata, yang meliputi manusia,” yakni, diliputi oleh kabut itu, dimana dikatakan kepada mereka, ”inilah azab yang pedih,” para ahli tafsir berbeda pendapat tentang maksud dari kabut ini. Ada yang berpendapat bahwa kabut tersebut ialah yang meliputi manusia ketika neraka mendekati orang-orang berdosa pada hari kiamat, Allah mengancamkan siksa hari kiamat pada mereka dan memerintahkan nabiNya untukm menanti hari itu bersama mereka. Penafsiran ini dikuatkan bahwa cara tersebut adalah cara al-qur’an dalam memberi ancaman kepada orang-orang kafir serta menakut-nakuti mereka akan azab pada hari itu, beriman dengan menanti orang-orang yang menyakiti mereka juga dikuatkan dengan firman Allah, ”bagaimana mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan.” Hal ini dikatakan pada hari kiamat untuk orang-orang kafir ketika mereka meminta untuk dikembalikan ke dunia, dijawab, “waktu kembali sudah lenyap,” Yang lain menafsirkan,maksudnya adalah, kondisi yang menimpa orang-orang kafir quraisy ketika mereka enggan beriman dan bersikap tinggi hati terhadap kebenaran hingga nabi mendoakan mereka. “ya Allah tolonglah aku atas mereka dengan (menimpa mereka) tahun-tahun paceklik sebagaimana tahun-tahun paceklik nabi yusuf’” Kemudian Allah mengirimkan kelaparan hebat hingga melihat semacam kabut di antara langit dan bumi padahal tidak ada, hal itu dikarenakan hebatnya rasa lapar. Berdasarkan penafsiran di atas, “maka tunggulah hari ketika langit membawa kabut yang nyata.” Adalah berkaitan dengan penglihatan serta apa yang mereka saksikan, padahal bukan kabut sesungguhnya. Mereka (orang-orang kafir Quraisy) tetap berada dalam kondisi seperti itu hingga mereka meminta belas kasih Rasulullah dan memintanya agar berdoa kepada Allah untuk melenyapkan derita mereka. Rasulullah berdoa kepada Rabbnya dan kesengsaraannya dilenyapkan. Atas penafsiran ini, maka maksud firman Allah “sesungguhnya kalau kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar),” adalah pemberitahuan bahwa Allah akan melenyapkan dari mereka dan ancaman bagi mereka bila kembali lagi pada kesombongan dan pendustaan, serta pemberitahuan akan terjadunya hal tersebut dan benar-benar terjadi. Dan Allah kelak akan menyiksa mereka dengan siksaan yang besar. Menurut para ahli tafsir yang dimaksud adalah peristiwa perang badar. Dalam pendapat ini terdapat pandangan yang jelas. Yang lain menafsirkan, hal itu merupakan salah satu tanda kiamat. Diakhir zaman akan ada kabut yang mencabut nyawa manusia, orang-orang beriman akan terkena layaknya kabut. Pendapat yang benar adalah pendapat yang pertama. Dalam ayat ini terdapat kemungkinan bahwa yang dimaksud oleh firman Allah, “maka tunggulah hari ketika langit membawa kabut yang nyata, yang melliputi manusia. Inilah azab yang pedih,(mereka berdoa),’ya Rabb kami, lenyapkanlah dari kami azab itu, sesungguhnya kami akan beriman, ’bagaimanakah mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan, kemudian mereka berpaling darinya dan berkata, ’Dialah adalah seorang yang menerima jaran (dari oang lain) lagi pula seorang yang gila’,” bahwa ini akan tejadi pada hari kiamat dan fiman Allah, “sesungguhnya (kalau) kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar). (ingatlah) hari (ketika) kami menghantam mereka dengan hantaman yang keras.” Sesungguhnya ini terjadi pada orang quraisy sebagaimana dijelaskan sebelumnya. Dan bila ayat-ayat di atas diturunkan dengan kedua makna tersebut, maka tidak tedapat adanya sesuatu yang menghalanginya, justru kata-kata dalam ayat-ayat di atas sesuai dengan kedua makna tesebut. Dan inilah pendapat yang kuat menurut saya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 10: (Maka tunggulah hari ketika langit membawa kabut yang nyata) maka kala itu bumi menjadi tandus kelaparan serta paceklik makin menjadi-jadi, sehingga karena memuncaknya keadaan, akhirnya mereka melihat seolah-olah ada sesuatu yang berupa kabut di antara langit dan bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Masruq, ia berkata: Abdullah (Ibnu Mas’ud) berkata, “Sesungguhnya hal ini adalah karena orang-orang Quraisy ketika mereka mendurhakai Nabi shallallahu 'alaihi wa sallam, maka Beliau mendoakan mereka agar ditimpakan kemarau panjang seperti kemarau (pada zaman) Nabi Yusuf, sehingga mereka merasakan kelaparan dan kesusahan sampai mereka memakan tulang, lalu ada seorang yang melihat ke langit dan ia lihat antara dirinya dengan langit ada seperti asap, hal itu karena penderitaan yang menimpanya, maka Allah Ta’ala menurunkan ayat, “Maka tunggulah pada hari ketika langit membawa kabut yang tampak jelas,-- yang meliputi manusia. Inilah azab yang pedih.” (Ad Dukhan: 10-11) Maka orang itu mendatangi Rasulullah shallallahu 'alaihi wa sallam, lalu dikatakan kepada Beliau, “Wahai Rasulullah, mintakanlah hujan kepada Allah untu suku Mudhar, karena mereka telah binasa.” Beliau menjawab, “(Apa) untuk Mudhar? Sesungguhnya engkau benar-benar lantang.” Maka Beliau meminta hujan, lalu mereka diberi hujan, maka turunlah ayat, “Tentu kamu akan kembali (ingkar).” (Ad Dukhan: 15) Ketika mereka memperoleh kesenangan, maka mereka kembali kepada keadaan mereka ketika senang sebelumnya, lalu Allah ‘Azza wa Jalla menurunkan ayat, “(Ingatlah) pada hari (ketika) Kami menghantam mereka dengan keras. Kami pasti memberi balasan.” (Terj. Ad Dukhaan: 16) Ia (Ibnu Mas’ud) berkata, “Yaitu pada perang Badar.” Syaikh Muqbil berkata, “Hadits di atas diriwayatkan pula oleh Imam Muslim juz 17 hal. 141 dan di sana disebutkan bahwa ada seorang laki-laki yang datang kepada Abdullah dan berkata, “Saya tinggalkan seseorang di masjid yang menafsirkan Al Qur’an dengan pendapatnya, ia menafsirkan ayat, “Pada hari ketika langit membawa kabut yang tampak jelas,” bahwa pada hari Kiamat akan datang kepada manusia dukhaan (asap) lalu mengena kepada nafas-nafas mereka sehingga mengenai mereka seperti pilek, lalu Abdullah berkata, “Barang siapa yang mengetahui ilmu, maka katakanlah dan barang siapa yang tidak tahu, maka katakanlah, “Allahu a’lam (Allah lebih tahu).” Karena termasuk kepandaian seseorang adalah mengatakan kepada yang tidak ia ketahui, “Allahu a’lam.” Sesungguhnya hal ini adalah karena…dst.” Lalu disebutkanlah hadits itu. Hadits itu ada di Bukhari juga, dan diriwayatkan oleh Ahmad juz 1 hal. 381.” Yakni azab. Para mufassir berbeda pendapat tentang maksud dukhan (asap/kabut) di ayat ini. Ada yang berpendapat, bahwa dukhan tersebut adalah asap yang meliputi manusia ketika neraka mendekat kepada orang-orang yang berdosa pada hari Kiamat, dan bahwa Dia mengancam mereka dengan azab pada hari Kiamat serta menyuruh Nabi-Nya menunggu hari itu. Hal ini diperkuat oleh jalan yang dilalui Al Qur’an dalam memberikan ancaman kepada orang-orang kafir dan menakut-nakuti mereka dengan hari itu dan azabnya, sekaligus menghibur rasul dan kaum mukmin agar menunggu azab yang menimpa orang yang mengganggu mereka. Hal ini juga diperkuat dengan firman-Nya, “Bagaimana mereka dapat menerima peringatan, padahal (sebelumnya pun) seorang rasul telah datang memberi penjelasan kepada mereka.” (Terj. Ad Dukhaan: 13) Hal ini diucapkan pada hari Kiamat kepada orang-orang kafir ketika mereka meminta kembali ke dunia lalu dikatakan bahwa waktunya telah hilang. Adapula yang berpendapat, bahwa maksud dukhan (kabut/asap) yang nyata ialah bencana kelaparan yang menimpa kaum Quraisy karena mereka menentang Nabi Muhammad shallallahu 'alaihi wa sallam, tidak mau beriman dan sombong kepada kebenaran sehingga Nabi Muhammad shallallahu 'alaihi wa sallam berdoa kepada Allah agar menimpakan kepada mereka kemarau yang menimpa bangsa Mesir pada zaman Nabi Yusuf ‘alaihis salam. Kemudian Allah Subhaanahu wa Ta'aala menimpakan kepada mereka kelaparan yang dahsyat sehingga mereka memakan bangkai dan tulang serta melihat seperti ada kabut di antara langit dan bumi karena lapar yang dahsyat. Mereka tetap seperti ini sampai meminta kepada Rasulullah shallallahu 'alaihi wa sallam agar dikasihani serta meminta kepada Beliau agar Beliau berdoa kepada Allah Subhaanahu wa Ta'aala agar Dia menghilangkan azab itu dari mereka, lalu Beliau berdoa dan Allah menghilangkan azab itu. Sehingga firman-Nya, “Sungguh, (kalau) Kami melenyapkan azab itu sedikit saja, tentu akan kembali (ingkar).” Merupakan pemberitahuan bahwa Allah Subhaanahu wa Ta'aala akan menghilangkannya dan memberitahukan bahwa mereka akan kembali ingkar, dan bahwa Allah Subhaanahu wa Ta'aala akan menghukum mereka dengan azab yang lebih besar lagi sebagaimana pada lanjutan ayatnya (ayat 16), yaitu dengan terjadinya perang Badar. Ada pula yang berpendapat, bahwa maksud dukhan adalah salah satu tanda Kiamat dan bahwa pada akhir zaman akan ada dukhan (asap/kabut) yang mengena kepada nafas manusia dan menimpa orang-orang mukmin di antara mereka seperti asap. Wallahu a’lam. Syaikh As Sa’diy berkata, “Jika beberapa ayat ini turun menurut dua makna (kemungkinan itu), maka engkau tidak temukan dalam lafaz yang menolaknya, bahkan engkau menemukannya sama persis, dan inilah yang tampak dan rajih menurut saya, wallahu a’lam.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 10",
    "description": "10-11. Maka oleh sebab itu, tunggulah wahai nabi Muhammad, atau siapa pun, hari ketika langit membawa kabut, yaitu debu yang beterbangan dari tanah akibat kekeringan yang berkepanjangan yang tampak jelas bagi mereka, yang meliputi manusia sehingga mereka tidak dapat melihat apa pun di sekitar mereka dan melindungi diri mereka. Inilah azab yang pedih bagi orang-orang yang melakukan perbuatan dosa"
  }
]