[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Bagaimana mereka akan mengambil pelajaran dan nasihat setelah azab turun menimpa mereka, sedangkan seorang utusan yang nyata telah datang kepada mereka, yaitu Muhammad, kemudian mereka berpaling darinya dan berkata, “Dia belajar dari manusia, dukun dan setan, dia gila dan bukan seorang rasul?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Bagaimana mungkin mereka mengambil pelajaran dan kembali kepada Rabb mereka padahal telah datang kepada mereka seorang Rasul yang jelas kerasulannya dan mereka mengetahui kejujuran dan amanahnya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. أَنَّىٰ لَهُمُ الذِّكْرَىٰ (Bagaimanakah mereka dapat menerima peringatan) Yakni bagaimana mereka akan mendapat peringatan dan pelajaran dari apa yang telah menimpa mereka. وَقَدْ جَآءَهُمْ رَسُولٌ مُّبِينٌ(padahal telah datang kepada mereka seorang rasul yang memberi penjelasan) Yakni yang menjelaskan kepada mereka segala sesuatu yang mereka butuhkan dalam agama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Bagaimana dan darimana mereka mengingat ketika adzab lenyap dari mereka? Yaitu ketika Rasul datang pada mereka dan menjelaskan kebenara pada mereka, serta segala perkara agama yang mereka butuhkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{padahal telah datang kepada mereka seorang Rasul yang memberi penjelasan} menjelaskan risalah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-16. “maka tunggulah,” yakni, nantikanlah azab yang akan ditimpakan terhadap mereka karena waktunya telah dekat, “hari ketika langit membawa kabut yang nyata, yang meliputi manusia,” yakni, diliputi oleh kabut itu, dimana dikatakan kepada mereka, ”inilah azab yang pedih,” para ahli tafsir berbeda pendapat tentang maksud dari kabut ini. Ada yang berpendapat bahwa kabut tersebut ialah yang meliputi manusia ketika neraka mendekati orang-orang berdosa pada hari kiamat, Allah mengancamkan siksa hari kiamat pada mereka dan memerintahkan nabiNya untukm menanti hari itu bersama mereka. Penafsiran ini dikuatkan bahwa cara tersebut adalah cara al-qur’an dalam memberi ancaman kepada orang-orang kafir serta menakut-nakuti mereka akan azab pada hari itu, beriman dengan menanti orang-orang yang menyakiti mereka juga dikuatkan dengan firman Allah, ”bagaimana mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan.” Hal ini dikatakan pada hari kiamat untuk orang-orang kafir ketika mereka meminta untuk dikembalikan ke dunia, dijawab, “waktu kembali sudah lenyap,” Yang lain menafsirkan,maksudnya adalah, kondisi yang menimpa orang-orang kafir quraisy ketika mereka enggan beriman dan bersikap tinggi hati terhadap kebenaran hingga nabi mendoakan mereka. “ya Allah tolonglah aku atas mereka dengan (menimpa mereka) tahun-tahun paceklik sebagaimana tahun-tahun paceklik nabi yusuf’” Kemudian Allah mengirimkan kelaparan hebat hingga melihat semacam kabut di antara langit dan bumi padahal tidak ada, hal itu dikarenakan hebatnya rasa lapar. Berdasarkan penafsiran di atas, “maka tunggulah hari ketika langit membawa kabut yang nyata.” Adalah berkaitan dengan penglihatan serta apa yang mereka saksikan, padahal bukan kabut sesungguhnya. Mereka (orang-orang kafir Quraisy) tetap berada dalam kondisi seperti itu hingga mereka meminta belas kasih Rasulullah dan memintanya agar berdoa kepada Allah untuk melenyapkan derita mereka. Rasulullah berdoa kepada Rabbnya dan kesengsaraannya dilenyapkan. Atas penafsiran ini, maka maksud firman Allah “sesungguhnya kalau kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar),” adalah pemberitahuan bahwa Allah akan melenyapkan dari mereka dan ancaman bagi mereka bila kembali lagi pada kesombongan dan pendustaan, serta pemberitahuan akan terjadunya hal tersebut dan benar-benar terjadi. Dan Allah kelak akan menyiksa mereka dengan siksaan yang besar. Menurut para ahli tafsir yang dimaksud adalah peristiwa perang badar. Dalam pendapat ini terdapat pandangan yang jelas. Yang lain menafsirkan, hal itu merupakan salah satu tanda kiamat. Diakhir zaman akan ada kabut yang mencabut nyawa manusia, orang-orang beriman akan terkena layaknya kabut. Pendapat yang benar adalah pendapat yang pertama. Dalam ayat ini terdapat kemungkinan bahwa yang dimaksud oleh firman Allah, “maka tunggulah hari ketika langit membawa kabut yang nyata, yang melliputi manusia. Inilah azab yang pedih,(mereka berdoa),’ya Rabb kami, lenyapkanlah dari kami azab itu, sesungguhnya kami akan beriman, ’bagaimanakah mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan, kemudian mereka berpaling darinya dan berkata, ’Dialah adalah seorang yang menerima jaran (dari oang lain) lagi pula seorang yang gila’,” bahwa ini akan tejadi pada hari kiamat dan fiman Allah, “sesungguhnya (kalau) kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar). (ingatlah) hari (ketika) kami menghantam mereka dengan hantaman yang keras.” Sesungguhnya ini terjadi pada orang quraisy sebagaimana dijelaskan sebelumnya. Dan bila ayat-ayat di atas diturunkan dengan kedua makna tersebut, maka tidak tedapat adanya sesuatu yang menghalanginya, justru kata-kata dalam ayat-ayat di atas sesuai dengan kedua makna tesebut. Dan inilah pendapat yang kuat menurut saya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 13: (\"Bagaimana mereka dapat menerima peringatan) maksudnya, iman tidak akan bermanfaat buat mereka bila azab diturunkan (padahal telah datang kepada mereka seorang rasul yang memberi penjelasan) artinya yang jelas risalahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 13",
    "description": "Bagaimana mereka dapat menerima peringatan yang telah kami berikan kepada mereka dengan ke hadiran azab itu, padahal sebelumnya pun seorang rasul yang agung, yaitu nabi Muhammad, telah datang memberi penjelasan kepada mereka, tetapi mereka tetap membangkang dan ingkar. 14. Kemudian karena ke ingkaran dan ke kafiran mereka terhadap rasul itu, mereka berpaling darinya dengan mengingkari kerasulannya dan bukti-bukti yang disampaikannya dan berkata dengan nada mengejek dan mencela, \"dia, rasul Muhammad yang di utus, itu orang yang menerima ajaran dari orang lain, bukan dari Allah, \" dan di saat lain mereka mengatakan bahwa dia adalah orang gila."
  }
]