[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami akan mengangkat azab dari mereka sesaat, dan kalian akan melihat bahwa kalian akan kembali kepada kekafiran, kesesatan dan pendustaan dan bahwa Kami akan menghukum kalian atas itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya saat Kami memalingkan siksa dari kalian sedikit saja, kalian kembali kepada kekufuran dan pendustaan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Kami akan menghilangkan azab dari kalian sebentar saja, namun kemudian kalian akan kembali kepada kekafiran. Suatu hari Kami akan mengazab orang-orang kafir di dunia -seperti yang terjadi pada perang Badar-, dan di akhirat Kami akan mengazab mereka dengan api neraka. Kami memberi mereka balasan di dunia dan di akhirat. Masruq berkata, “Dahulu kami pernah duduk di majelis Abdullah, sedangkan dia dalam keadaan berbaring di antara kami. Kemudian datang seorang lelaki seraya berkata: ‘Hai Abu Abdurrahman, ada seorang tukang cerita di pintu-pintu pemukiman Bani Kindah, yang bercerita bahwa dukhan akan datang dan merenggut nafas orang-orang kafir; dan mengambil nafas orang-orang beriman seperti gejala pilek.’ Abdullah berkata dengan marah seraya duduk bangkit dari berbaring, ‘Hai manusia, bertakwalah kepada Allah, barangsiapa di antara kalian mengetahui sesuatu maka hendaklah dia berkata sesuai kadar pengetahuannya. Dan barangsiapa yang tidak mengetahui maka hendaklah dia berkata ‘Allahu A’lam’; karena orang yang mengatakan ‘Allahu A’lam’ ketika dia tidak mengetahui maka dia adalah orang yang paling berilmu di antara kalian; karena sesungguhnya Allah berfirman kepada Nabi Muhammad: “Katakanlah (hai Muhammad): \"Aku tidak meminta upah sedikitpun padamu atas dakwahku dan bukanlah aku termasuk orang-orang yang memaksakan diri.” [Shad: 86]. Ketika Rasulullah melihat orang-orang berpaling darinya, beliau berdoa: “Ya Allah, datangkanlah tujuh tahun paceklik seperti tujuh tahun paceklik Nabi Yusuf.” Maka mereka tertimpa paceklik yang mendatangkan krisis dalam segala hal, hingga mereka memakan kulit dan bangkai karena kelaparan. Lalu seseorang di antara mereka memandang ke langit dan melihat kabut tebal. Maka Abu Sufyan mendatangi Rasulullah dan berkata: “Hai Muhammad, kamu diutus untuk memerintahkan ketaatan kepada Allah dan menyambung silaturrahim; sedangkan kaummu telah binasa, maka berdoalah kepada Allah untuk mereka.” Maka Allah berfirman: (Maka tunggulah -wahai Rasul- siksa bagi mereka yang sudah dekat saat langit membawa kabut yang jelas terlihat oleh mata mereka karena begitu sakit) Hingga Firman Allah (Kalian akan kembali ingkar) [Ad-Dukhan: 10-15]. Lalu Abdullah berkata: Apakah azab akhirat juga akan dihilangkan? ((Ingatlah) hari (ketika) Kami menghantam mereka dengan hantaman yang keras. Sesungguhnya Kami adalah Pemberi balasan) [Ad-Dukhan: 16]. Yang dimaksud hantaman adalah hari terjadinya perang Badar. Dan telah berlalu tanda dukhan, hantaman, ajal, dan tanda rum. (Shahih Muslim 4/2155-2156 no. 2798, kitab sifat-sifat orang-orang munafik dan hukum-hukum yang berkaitan dengan mereka, bab ad-dukhan. Dan Shahih al-Bukhari, al-istisqa no. 1007, dan at-tafsir no. 4809. Dan hadits ini menggunakan lafazh Muslim)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِنَّا كَاشِفُوا۟ الْعَذَابِ قَلِيلًا (Sesungguhnya (kalau) Kami akan melenyapkan siksaan itu agak sedikit) Yakni Kami akan mengangkat azab dari mereka beberapa saat. إِنَّكُمْ عَآئِدُونَ (sesungguhnya kamu akan kembali (ingkar)) Yakni kembali kepada kemusyrikan kalian dahulu. Dan mereka benar-benar kembali kepada kekafiran dan kedurhakaan mereka sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Allah mewahyukan pada Nabi, bahwa kalau (kami) akan melenyapkan siksaan itu, sebab doa Nabi SAW, untuk melenyapkan sementara dalam waktu yang singkat, karena kalian semua akan kembali kafir, dan mereka akan kembali kafir sebagaimana tabiat mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kalau Kami melenyapkan azab itu sebentar} dalam waktu sebentar {sesungguhnya kalian akan kembali (ingkar)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-16. “maka tunggulah,” yakni, nantikanlah azab yang akan ditimpakan terhadap mereka karena waktunya telah dekat, “hari ketika langit membawa kabut yang nyata, yang meliputi manusia,” yakni, diliputi oleh kabut itu, dimana dikatakan kepada mereka, ”inilah azab yang pedih,” para ahli tafsir berbeda pendapat tentang maksud dari kabut ini. Ada yang berpendapat bahwa kabut tersebut ialah yang meliputi manusia ketika neraka mendekati orang-orang berdosa pada hari kiamat, Allah mengancamkan siksa hari kiamat pada mereka dan memerintahkan nabiNya untukm menanti hari itu bersama mereka. Penafsiran ini dikuatkan bahwa cara tersebut adalah cara al-qur’an dalam memberi ancaman kepada orang-orang kafir serta menakut-nakuti mereka akan azab pada hari itu, beriman dengan menanti orang-orang yang menyakiti mereka juga dikuatkan dengan firman Allah, ”bagaimana mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan.” Hal ini dikatakan pada hari kiamat untuk orang-orang kafir ketika mereka meminta untuk dikembalikan ke dunia, dijawab, “waktu kembali sudah lenyap,” Yang lain menafsirkan,maksudnya adalah, kondisi yang menimpa orang-orang kafir quraisy ketika mereka enggan beriman dan bersikap tinggi hati terhadap kebenaran hingga nabi mendoakan mereka. “ya Allah tolonglah aku atas mereka dengan (menimpa mereka) tahun-tahun paceklik sebagaimana tahun-tahun paceklik nabi yusuf’” Kemudian Allah mengirimkan kelaparan hebat hingga melihat semacam kabut di antara langit dan bumi padahal tidak ada, hal itu dikarenakan hebatnya rasa lapar. Berdasarkan penafsiran di atas, “maka tunggulah hari ketika langit membawa kabut yang nyata.” Adalah berkaitan dengan penglihatan serta apa yang mereka saksikan, padahal bukan kabut sesungguhnya. Mereka (orang-orang kafir Quraisy) tetap berada dalam kondisi seperti itu hingga mereka meminta belas kasih Rasulullah dan memintanya agar berdoa kepada Allah untuk melenyapkan derita mereka. Rasulullah berdoa kepada Rabbnya dan kesengsaraannya dilenyapkan. Atas penafsiran ini, maka maksud firman Allah “sesungguhnya kalau kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar),” adalah pemberitahuan bahwa Allah akan melenyapkan dari mereka dan ancaman bagi mereka bila kembali lagi pada kesombongan dan pendustaan, serta pemberitahuan akan terjadunya hal tersebut dan benar-benar terjadi. Dan Allah kelak akan menyiksa mereka dengan siksaan yang besar. Menurut para ahli tafsir yang dimaksud adalah peristiwa perang badar. Dalam pendapat ini terdapat pandangan yang jelas. Yang lain menafsirkan, hal itu merupakan salah satu tanda kiamat. Diakhir zaman akan ada kabut yang mencabut nyawa manusia, orang-orang beriman akan terkena layaknya kabut. Pendapat yang benar adalah pendapat yang pertama. Dalam ayat ini terdapat kemungkinan bahwa yang dimaksud oleh firman Allah, “maka tunggulah hari ketika langit membawa kabut yang nyata, yang melliputi manusia. Inilah azab yang pedih,(mereka berdoa),’ya Rabb kami, lenyapkanlah dari kami azab itu, sesungguhnya kami akan beriman, ’bagaimanakah mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan, kemudian mereka berpaling darinya dan berkata, ’Dialah adalah seorang yang menerima jaran (dari oang lain) lagi pula seorang yang gila’,” bahwa ini akan tejadi pada hari kiamat dan fiman Allah, “sesungguhnya (kalau) kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar). (ingatlah) hari (ketika) kami menghantam mereka dengan hantaman yang keras.” Sesungguhnya ini terjadi pada orang quraisy sebagaimana dijelaskan sebelumnya. Dan bila ayat-ayat di atas diturunkan dengan kedua makna tersebut, maka tidak tedapat adanya sesuatu yang menghalanginya, justru kata-kata dalam ayat-ayat di atas sesuai dengan kedua makna tesebut. Dan inilah pendapat yang kuat menurut saya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 15: (Sesungguhnya kalau Kami lenyapkan siksaan itu) kelaparan dan paceklik itu dari mereka selama beberapa waktu (dalam waktu yang tidak lama) lalu Allah melenyapkan azab itu dari mereka (sesungguhnya kalian akan kembali) kepada kekafiran, dan memang mereka kembali lagi kepada kekafirannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ternyata mereka kembali ingkar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 15",
    "description": "Permohonan mereka untuk di lepaskan dari azab itu tidak di kabulkan. Lalu Allah membalasnya dengan mengatakan, 'sesungguhnya, kalau kami melenyapkan azab yang di turunkan itu sedikit saja dari kamu, tentu kamu akan kembali ingkar, tidak akan pernah mau beriman. 16. Ingatlah pada hari ketika terjadi peperangan badr, kami menghantam mereka dengan hantaman yang keras dan sehebat-hebatnya sehingga mereka mengalami kekalahan yang besar dan banyak pemimpin-pemimpin mereka yang tewas. Kami adalah pemberi balasan terhadap mereka yang durhaka dan berdosa. '."
  }
]