[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di hari di mana Kami menyiska seluruh orang-orang kafir dengan azab yang paling besar di hari Kiamat, itulah hari pembalasan Kami kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Maka tunggulah mereka -wahai Rasul- pada hari saat Kami menghantam orang-orang kafir dengan hantaman yang besar yaitu di perang Badar. Sesungguhnya Kami membalas mereka karena kekufuran mereka kepada Allah dan pendustaan mereka kepada rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَىٰٓ ((Ingatlah) hari (ketika) Kami menghantam mereka dengan hantaman yang keras) Terdapat pendapat mengatakan bahwa yang dimaksud adalah hari terjadinya perang Badar. Ketika mereka kembali kepada pendustaan dan kekafiran mereka setelah azab diangkar dari mereka, maka Allah membalas mereka dengan kekalahan pada perang Badar. Pendapat lain mengatakan bahwa yang dimaksud adalah azab neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Ketika kami memberikan peringatan besar dengan hantaman yang keras pada hari kiamat atau hari kebangkitan, itu adalah ketika kalian kembali pada jalan yang sesat, sesungguhnya kami adalah pemberi balasan atas kalian sebagaimana pembalasan atas orang-orang terdahulu, sampai tidak tersisa kemusyrikan pada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) pada hari Kami menghantam mereka dengan hantaman yang besar} Kami menghukum mereka dengan keras pada hari perang Badar {Sesungguhnya Kami adalah pemberi balasan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-16. “maka tunggulah,” yakni, nantikanlah azab yang akan ditimpakan terhadap mereka karena waktunya telah dekat, “hari ketika langit membawa kabut yang nyata, yang meliputi manusia,” yakni, diliputi oleh kabut itu, dimana dikatakan kepada mereka, ”inilah azab yang pedih,” para ahli tafsir berbeda pendapat tentang maksud dari kabut ini. Ada yang berpendapat bahwa kabut tersebut ialah yang meliputi manusia ketika neraka mendekati orang-orang berdosa pada hari kiamat, Allah mengancamkan siksa hari kiamat pada mereka dan memerintahkan nabiNya untukm menanti hari itu bersama mereka. Penafsiran ini dikuatkan bahwa cara tersebut adalah cara al-qur’an dalam memberi ancaman kepada orang-orang kafir serta menakut-nakuti mereka akan azab pada hari itu, beriman dengan menanti orang-orang yang menyakiti mereka juga dikuatkan dengan firman Allah, ”bagaimana mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan.” Hal ini dikatakan pada hari kiamat untuk orang-orang kafir ketika mereka meminta untuk dikembalikan ke dunia, dijawab, “waktu kembali sudah lenyap,” Yang lain menafsirkan,maksudnya adalah, kondisi yang menimpa orang-orang kafir quraisy ketika mereka enggan beriman dan bersikap tinggi hati terhadap kebenaran hingga nabi mendoakan mereka. “ya Allah tolonglah aku atas mereka dengan (menimpa mereka) tahun-tahun paceklik sebagaimana tahun-tahun paceklik nabi yusuf’” Kemudian Allah mengirimkan kelaparan hebat hingga melihat semacam kabut di antara langit dan bumi padahal tidak ada, hal itu dikarenakan hebatnya rasa lapar. Berdasarkan penafsiran di atas, “maka tunggulah hari ketika langit membawa kabut yang nyata.” Adalah berkaitan dengan penglihatan serta apa yang mereka saksikan, padahal bukan kabut sesungguhnya. Mereka (orang-orang kafir Quraisy) tetap berada dalam kondisi seperti itu hingga mereka meminta belas kasih Rasulullah dan memintanya agar berdoa kepada Allah untuk melenyapkan derita mereka. Rasulullah berdoa kepada Rabbnya dan kesengsaraannya dilenyapkan. Atas penafsiran ini, maka maksud firman Allah “sesungguhnya kalau kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar),” adalah pemberitahuan bahwa Allah akan melenyapkan dari mereka dan ancaman bagi mereka bila kembali lagi pada kesombongan dan pendustaan, serta pemberitahuan akan terjadunya hal tersebut dan benar-benar terjadi. Dan Allah kelak akan menyiksa mereka dengan siksaan yang besar. Menurut para ahli tafsir yang dimaksud adalah peristiwa perang badar. Dalam pendapat ini terdapat pandangan yang jelas. Yang lain menafsirkan, hal itu merupakan salah satu tanda kiamat. Diakhir zaman akan ada kabut yang mencabut nyawa manusia, orang-orang beriman akan terkena layaknya kabut. Pendapat yang benar adalah pendapat yang pertama. Dalam ayat ini terdapat kemungkinan bahwa yang dimaksud oleh firman Allah, “maka tunggulah hari ketika langit membawa kabut yang nyata, yang melliputi manusia. Inilah azab yang pedih,(mereka berdoa),’ya Rabb kami, lenyapkanlah dari kami azab itu, sesungguhnya kami akan beriman, ’bagaimanakah mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan, kemudian mereka berpaling darinya dan berkata, ’Dialah adalah seorang yang menerima jaran (dari oang lain) lagi pula seorang yang gila’,” bahwa ini akan tejadi pada hari kiamat dan fiman Allah, “sesungguhnya (kalau) kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar). (ingatlah) hari (ketika) kami menghantam mereka dengan hantaman yang keras.” Sesungguhnya ini terjadi pada orang quraisy sebagaimana dijelaskan sebelumnya. Dan bila ayat-ayat di atas diturunkan dengan kedua makna tersebut, maka tidak tedapat adanya sesuatu yang menghalanginya, justru kata-kata dalam ayat-ayat di atas sesuai dengan kedua makna tesebut. Dan inilah pendapat yang kuat menurut saya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 16: Ingatlah (hari ketika Kami menghantam dengan hantaman yang keras) yaitu pada perang Badar. (Sesungguhnya Kami Pemberi balasan) kepada orang-orang yang kafir itu. Lafal Al-Bathsyu artinya menghantam dengan keras."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hantaman yang keras itu terjadi di peperangan Badar di mana orang-orang musyrik dipukul dengan sehebat-hebatnya sehingga menderita kekalahan dan banyak di antara pemimpin-pemimpin mereka yang tewas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 16",
    "description": "Ingatlah pada hari ketika terjadi peperangan badr, kami menghantam mereka dengan hantaman yang keras dan sehebat-hebatnya sehingga mereka mengalami kekalahan yang besar dan banyak pemimpin-pemimpin mereka yang tewas. Kami adalah pemberi balasan terhadap mereka yang durhaka dan berdosa. '17. Dan sesungguhnya, sebelum mereka, yakni kaum musyrik mekah, kami benar-benar telah menguji kaum fir'aun bersama dengan fir'aun dengan berbagai nikmat dan ke senangan hidup dan telah datang kepada mereka seorang rasul yang mulia akhlaknya, yaitu nabi musa."
  }
]