[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah menguji kaum Fir’aun sebelum orang-orang musyrik itu, di mana seorang rasul yang mulia telah datang kepada mereka, yaitu Musa, maka mereka mendustakannya, akibatnya mereka binasa. Begitulah Kami berbuat terhadap musuh-musuhmu wahai Rasul, bila mereka tidak beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan telah Kami uji kaum Fir'aun sebelum mereka, dan telah datang kepada mereka seorang utusan yang mulia dari sisi Allah, mengajak mereka untuk mentauhidkan Allah dan menyembah-Nya, yaitu Musa -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Sungguh kaum Fir’aun telah Kami uji sebelum orang-orang musyrik Makkah, telah datang kepada mereka rasul yang sangat mulia yaitu Musa, dan dia menyeru mereka untuk menyembah Allah dan melepaskan Bani Israil kepadanya. Dan dia menegaskan bahwa dia adalah utusan Allah yang mengemban amanah wahyu dan risalah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَلَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ فِرْعَوْنَ (Sesungguhnya sebelum mereka telah Kami uji kaum Fir’aun) Allah mengirim para rasul kepada mereka yang memerintahkan mereka untuk menjalankan syariat-Nya, namun mereka mendustakan para rasul itu. Atau Allah melapangkan rezeki mereka namun mereka menjadi bertindak zalim dan semena-mena. وَجَآءَهُمْ رَسُولٌ كَرِيمٌ (dan telah datang kepada mereka seorang rasul yang mulia) Yakni orang yang mulia di sisi Allah, dan mulia dalam kaumnya, dan dia adalah Nabi Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Ketika kami memberi khabar kepada kaum sebelum kaum musyrik makkah yaitu, kaum fir’aun dan kaum luth, Allah telah mengutus utusan pada mereka untuk kebaikan, yaitu, Nabi Musa AS."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menguji} Kami menguji dan memberi cobaan {kaum Fir‘aun sebelum mereka dan telah datang pula kepada mereka seorang rasul yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. ketika Allah menyebutkan pendustaan orang-orang yang mendustakan rasul Muhammad, Allah menyebutkan bahwa mereka memilki panutan dari orang-orang yang mendustakan sebelumnya. Allah menyebutkan kisah mereka bersama musa dan apa yang Allah timpakan pada mereka agar mereka yang mendustakan agama yang dibawa Muhammad gentar. Allah berfirman, ”sungguh sebelum mereka telah kami uji kaum fir’aun,” yaitu kami uji dan tes mereka dengan diutusnya rasul kami, musa bin Imran, kepada mereka, seorang rasul mulia yang di dalam dirinya terdapat kemuliaan dan akhlak baik yang tidak dimiliki oleh yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 17: (Sesungguhnya telah Kami coba) Kami uji (sebelum mereka kaum Firaun) berikut Firaun sendiri (dan telah datang kepada mereka seorang rasul) yaitu Nabi Musa .s. (yang mulia) di sisi Allah swt."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan pendustaan orang-orang yang mendustakan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam, maka Dia menyebutkan bahwa mereka mempunyai pendahulu mereka yang sama mendustakan, yaitu kaum Fir’aun. Allah Subhaanahu wa Ta'aala menyebutkan kisah mereka dengan Nabi Musa ‘alaihis salam dan apa yang Allah timpakan kepada mereka agar orang-orang yang mendustakan itu berhenti dari apa yang mereka pegang selama ini berupa kesyirkkan dan kekufuran. Pada diri Beliau (Nabi Musa ‘alaihis salam) terdapat kemuliaan dan akhlak yang mulia yang tidak ada pada orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 17",
    "description": "Dan sesungguhnya, sebelum mereka, yakni kaum musyrik mekah, kami benar-benar telah menguji kaum fir'aun bersama dengan fir'aun dengan berbagai nikmat dan ke senangan hidup dan telah datang kepada mereka seorang rasul yang mulia akhlaknya, yaitu nabi musa. 18-19. Rasul yang kami utus itu berkata kepada mereka dengan lembut, 'serahkanlah kepadaku dengan penuh kerelaan hamba-hamba Allah, yaitu bani israil, kaumku dan keluargaku, dengan membebaskan mereka dari perbudakan dan siksaanmu. Sesungguhnya aku adalah utusan Allah, tuhan seluruh alam yang dapat di percaya oleh-Nya untuk menyampaikan apa yang seharusnya aku sampaikan kepadamu, dan janganlah kamu menyombongkan diri terhadap Allah dengan menolak aku sebagai rasul yang di utus-Nya kepadamu dan mengabaikan apa yang di perintahkan-Nya. Sungguh, aku datang dan di utus oleh-Nya kepadamu dengan membawa bukti, berupa mukjizat yang nyata tentang kerasulanku. '."
  }
]