[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata pada mereka, ”Serahkanlah kepadaku hamba-hamba Allah dari Bani Israil dan biarkanlah mereka bersamaku, supaya mereka bisa menyembah Allah semata, tiada sekutu bagiNya. Sesungguhnya aku bagi kalian adalah utusan yang dipercaya oleh Allah untuk menyampaikan wahyu dan risalahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Musa berkata kepada Fir'aun dan kaumnya, “Serahkan padaku Bani Israil, mereka adalah hamba-hamba Allah, kalian tidak berhak untuk memperbudak mereka, sesungguhnya aku adalah utusan Allah, yang dipercaya atas apa yang diperintahkan kepadaku untuk aku sampaikan kepada kalian, tidak aku kurangi sedikitpun darinya dan tidak pula aku tambahi sedikitpun.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. أَنْ أَدُّوٓا۟ إِلَىَّ عِبَادَ اللهِ ۖ ((dengan berkata): “Serahkanlah kepadaku hamba-hamba Allah) Yakni lepaskanlah hamba-hamba Allah, yaitu Bani Israil; dan bebaskanlah mereka dari siksaanmu. إِنِّى لَكُمْ رَسُولٌ أَمِينٌ (Sesungguhnya aku adalah utusan (Allah) yang dipercaya kepadamu) Yakni dipercaya dalam mengemban risalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Untuk menyerahkan kepadaku kaum Bani Israil (yang kamu perbudak) atau mengajak untuk kembali pada jalan kebenaran Allah SWT untuk beriman kepadaNya dan menerima ajaran da’wah, sesungguhnya aku (Musa) adalah utusan yang telah diamanahi wahyu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Kembalikanlah kepadaku hamba-hamba Allah} serahkanlah kepadaku Bani Israil, bebaskanlah mereka dari siksaan {Sesungguhnya aku adalah utusan yang dapat dipercaya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “serahkan kepadaku hamba-hamba Allah (bani israil yang kamu perbudak).” Artinya, nabi musa berkata kepada fir’aun dan kaumnya, “serahkanlah bani israil dan lepaskan mereka dari siksaan pedih kalian, karena mereka adalah kaumku dan orang-orang terbaik di masa mereka, kalian telah menzhalimi mereka dan memperbudak mereka tanpa hak, lepaskan mereka agar mereka menyembah Rabb mereka, “sesungguhnya aku adalah utusan (Allah) yang dipercaya kepadamu,” yaitu utusan dari Rabb semesta alam, dipercaya atas apa yang diutuskan padaku. dan ini mengharuskan ketundukan fir’aun padanya secara sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 18: (Dengan berkata, \"Hendaknya) atau hendaknyalah (kalian tunaikan kepadaku) apa yang aku seru kalian untuk melakukannya, yaitu beriman kepada Allah. Maksudnya, tampakkanlah iman kalian kepadaku, hai (hamba-hamba Allah. Sesungguhnya aku adalah utusan Allah yang dipercaya kepada kalian) dipercaya untuk menyampaikan apa yang aku diutus untuknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni lepaskanlah mereka dari siksaanmu, karena mereka adalah keluargaku dan bangsa yang paling mulia di zaman ini. Kamu telah menzalimi dan memperbudak mereka dengan tanpa hak, maka lepaskanlah mereka agar beribadah kepada Tuhan mereka. Ayat ini juga bisa diartikan, “Lakukanlah apa yang aku seru kepadamu, yaitu beriman wahai hamba-hamba Allah.” Yakni dapat dipercaya terhadap risalah-Nya kepadaku, aku tidak akan menyembunyikannya meskipun sedikit, aku tidak menambah dan tidak pula mengurangi. Hal ini seharusnya membuat mereka tunduk secara sempurna kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 18",
    "description": "18-19. Rasul yang kami utus itu berkata kepada mereka dengan lembut, 'serahkanlah kepadaku dengan penuh kerelaan hamba-hamba Allah, yaitu bani israil, kaumku dan keluargaku, dengan membebaskan mereka dari perbudakan dan siksaanmu. Sesungguhnya aku adalah utusan Allah, tuhan seluruh alam yang dapat di percaya oleh-Nya untuk menyampaikan apa yang seharusnya aku sampaikan kepadamu, dan janganlah kamu menyombongkan diri terhadap Allah dengan menolak aku sebagai rasul yang di utus-Nya kepadamu dan mengabaikan apa yang di perintahkan-Nya. Sungguh, aku datang dan di utus oleh-Nya kepadamu dengan membawa bukti, berupa mukjizat yang nyata tentang kerasulanku. '18-19"
  }
]