[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-21. Hendaknya kalian jangan menyombongkan diri di depan Allah dengan mendustakan utusan-utusanNya. Sesungguhnya aku datang kepada kalian dengan membawa bukti nyata atas kebenaran risalahku. Sesungguhnya aku berlindung kepada Allah, Tuhanku dan tuhan kalian, bila kalian hendak membunuhku dengan melempariku dengan batu. Bila kalian tidak membenarkanku dalam apa yang aku bawa kepada kalian, maka biarkanlah aku dan jangan menyakitiku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan janganlah kalian takabur kepada Allah dengan tidak menyembah-Nya dan sombong kepada hamba-hamba-Nya, sesungguhnya aku datang kepadamu dengan membawa hujah yang jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-22. Dan menyeru agar mereka tidak berpaling dari ketaatan Allah. Aku mendatangkan bukti yang jelas kepada kalian atas kebenaran risalahku, dan aku berlindung kepada Tuhanku dan Tuhan kalian agar kalian tidak membunuhku dengan melempariku batu. Jika kalian tidak beriman kepadaku maka janganlah kalian menyakitiku. Kemudian Musa berdoa kepada Allah untuk mengadu bahwa Fir’aun dan kaumnya merupakan orang-orang yang jahat karena kekafiran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَأَن لَّا تَعْلُوا۟ عَلَى اللهِ ۖ (dan janganlah kamu menyombongkan diri terhadap Allah) Yakni janganlah kalian bersikap sombong dan angkuh terhadap Allah dengan enggan mentaati-Nya dan mengikuti rasul-rasul-Nya. إِنِّىٓ ءَاتِيكُم بِسُلْطٰنٍ مُّبِينٍ (Sesungguhnya aku datang kepadamu dengan membawa bukti yang nyata) Yakni dengan membawa hujjah yang jelas yang tidak mungkin terbantahkan, yaitu berupa mukjizat dari tongkat, tangan, dan mukjizat-mukjizat lain yang berjumlah sembilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Dan janganlah kalian sombong kepada Allah dengan meninggalkan ketaatan kepadaNya, meremehkan wahyu dan utusanNya, sesungguhnya aku datang kepada kalian dengan petunjuk yang jelas atas ajaranku, dan ini merupakan alasan larangan menghindari takabbur dan sombong"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menyombongkan diri} Janganlah menyombongkan diri {terhadap Allah karena sesungguhnya aku datang kepada kalian dengan membawa bukti yang nyata} bukti yang menjelaskan atas kebenaran ucapanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “dan janganlah kamu menyombongkan diri terhadap Allah,” dengan merasa sombong untuk menyembahNya serta tinggi hati terhadap hamba-hamba Allah, “sesungguhnya aku datang kepadamu dengan membawa bukti yang nyata,” yaitu dengan hujjah yang jelas dan nyata. Itulah mukjizat-mukjizat nyata dan bukti-bukti yang kuat dan memaksa yang dibawa Musa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 19: (Dan Janganlah kalian menyombongkan diri) berlaku takabur (terhadap Allah) yaitu tidak menaati-Nya. (Sesungguhnya aku datang kepada kalian dengan membawa bukti) tanda bukti (yang nyata\") yang menunjukkan kebenaran risalahku. Tetapi sebaliknya mereka mengancam akan merajamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan enggan beribadah kepada-Nya serta bersikap sombong terhadap hamba-hamba Allah. Yaitu mukjizat dan dalil, namun ternyata mereka mendustakan Beliau dan hendak membunuh Beliau dengan mengancam akan merajam Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 19",
    "description": "18-19. Rasul yang kami utus itu berkata kepada mereka dengan lembut, 'serahkanlah kepadaku dengan penuh kerelaan hamba-hamba Allah, yaitu bani israil, kaumku dan keluargaku, dengan membebaskan mereka dari perbudakan dan siksaanmu. Sesungguhnya aku adalah utusan Allah, tuhan seluruh alam yang dapat di percaya oleh-Nya untuk menyampaikan apa yang seharusnya aku sampaikan kepadamu, dan janganlah kamu menyombongkan diri terhadap Allah dengan menolak aku sebagai rasul yang di utus-Nya kepadamu dan mengabaikan apa yang di perintahkan-Nya. Sungguh, aku datang dan di utus oleh-Nya kepadamu dengan membawa bukti, berupa mukjizat yang nyata tentang kerasulanku. '20. Lalu mereka mendustakannya dan berkeinginan untuk membunuhnya. Akan tetapi, musa tetap menyeru mereka, 'dan se sungguhnya aku, sebagai rasul utusan-Nya berlindung kepada tuhanku yang mengutus dan memeliharaku dan tuhanmu yang telah menciptakan, memelihara, dan menjagamu, dari ancamanmu untuk merajamku, yakni melukaiku dengan batu atau membunuhku dengan melempariku dengan batu. '."
  }
]