[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-8. Allah bersumpah dengan al-Quran yang lafazh dan maknanya jelas, sesungguhnya Kami menurunkannya di malam Qadar, malam yang penuh dengan kebaikan dan keberkahan yang banyak, yang ada di Bulan Ramadhan. Sesungguhnya Kami memberi peringatan kepada manusia tentang apa yang bermanfaat bagi mereka dan apa yang merugikan mereka. Hal itu dengan mmengutus para rasul dan menurunkan kitab-kitab, agar hujjah Allah tegak atas hamba-hambaNYa. Di malam itu segala perkara yang pasti mencakup ajal dan rizki dalam setahun itu serta hal-hal lainnya yang terjadi padanya sampai akhir ditetapkan dan dialihkan ke buku-buku para malaikat pencatat dari Lauhul Mahfuzh, tidak diganti dan tidak dirubah. Keputusan bijaksana itu adalah keputusan dari Kami. Segala apa yang terjadi, maka ia dengan takdir Allah dan apa yang Dia wahyukan, maka ia dengan perintah, izin, dan ilmu Allah. Sesungguhnya Kami mengutus kepada manusia para rasul, yaitu Muhammad dan para rasul sebelumnya, sebagai rahmat dari Tuhanmu (wahai rasul), kepada kaum yang mana kamu diutus kepada mereka. Sesungguhnya Allah Maha Mendengar yang mendengar segala suara, Maha Mengetahui segala urusan makhlukNya, yang lahir maupun yang batin. Dia adalah Pencipta langit dan bumi dan segala sesuatu yang ada pada keduanya, bila kalian adalah orang-orang yang meyakini hal itu, maka ketahuilah, bahwa Tuhan seluruh makhluk adalah Sembahan mereka Yang Haq; tiada tuhan yang berhak untuk disembah kecuali Dia semata, tiada sekutu bagiNya, Yang menghidupkan dan Yang mematikan. Tuhan kalian dan Tuhan nenek moyang kalian yang terdahulu, maka sembahlah Dia, bukan tuhan-tuhan yang tidak kuasa mendatangkan manfaat dan mudarar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Allah bersumpah dengan Al-Qur`ān yang menjelaskan jalan petunjuk menuju kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-7. Sungguh demi al-Qur’an yang menjelaskan dengan berbagai bentuk kefasihannya dan cahaya hidayahnya, Kami -dengan keagungan dan kekuasaan Kami yang sempurna- menurunkan al-Qur’an pada malam lailatul qadar yang penuh dengan kebaikan. Kami memperingatkan manusia dari keburukan. Pada malam lailatul qadar itu Allah menjelaskan segala perkara ajal dan rezeki dengan jelas. Ini merupakan perkara agung yang berasal dari Allah Yang Maha Mulia. Kami telah mengutus para rasul untuk menyampaikan hidayah, sebagai bentuk rahmat yang luas dari Tuhanmu hai Rasulullah. Allah Maha Mendengar segala perkataan, Maha Mengetahui segala keadaan dan perbuatan. Dia Pencipta tujuh langit dan bumi serta seluruh makhluk yang ada di antara keduanya, jika kalian menyakini hal ini. Ibnu Abbas berkata: “Sungguh kamu mungkin melihat seseorang yang berjalan di pasar, namun namanya telah tercatat sebagai orang yang mati.” Kemudian dia membaca ayat: إِنَّآ أَنزَلْنَٰهُ فِى لَيْلَةٍ مُّبَٰرَكَةٍ ۚ إِنَّا كُنَّا مُنذِرِينَ فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ “Sesungguhnya Kami menurunkannya pada suatu malam yang diberkahi dan sesungguhnya Kami-lah yang memberi peringatan. Pada malam itu dijelaskan segala urusan yang penuh hikmah.” (Ad-Dukhan: 3-4). Yakni pada malam lailatul qadar, pada malam itu ditetapkan perkara di dunia sampai lailatur qadar tahun depan.” (al-Mustadrak 2/448-449, kitab at-Tafsir. Dishahihkan oleh al-Hakim dan ad-Dzahabi. Dan diriwayatkan al-Baihaqi dari al-Hakim dalam Syu’abul Iman 7/261-262 no. 3388. Pentahqiq kitab ini mengatakan sanad para rawinya Tsiqat)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Saya bersumpah bahwa al-Qur’an ini, merupakan penjelasan bagi umat manusia sebagai pedoman hukum-hukum dan syari’at"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi kitab yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. ini adalah sumpah dengan al-qur’an atas al-qur’an sendiri. Allah bersumpah dengan al-kitab yang nyata untuk segala sesuatu yang perlu dijelaskan, bahwa Dia menurunkannya “pada suatu malam yang diberkahi,” yaitu yang banyak kebaikan dan berkahnya, yaitu malam lailatul qadar, malam yang lebih baik dari seribu bulan. Allah menurunkan perkataan terbaik, di malam terbaik dan di hari terbaik kepada manusia yang juga terbaik dengan bahasa arab yang mulia, agar dijadikan sebagai peringatan bagi kaum yang dilanda kebodohan dan dikuasai oleh kesengsaraan, agar mereka bisa menjadikannya sebagai cahaya dan mengambilnya serta berjalan di belakangnya, agar kebaikan dunia dan akhirat didapatkan, karena Allah berfirman, “sesungguhnya kamilah yang memberi peringatan,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 2: (Demi Alkitab) yaitu Alquran (yang menjelaskan) yang memenangkan perkara yang halal atas perkara yang haram."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah sumpah Allah Subhaanahu wa Ta'aala dengan Al Qur’an untuk Al Qur’an. Allah Subhaanahu wa Ta'aala bersumpah dengan Al Qur’an yang menjelaskan, yakni menjelaskan semua yang butuh dijelaskan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 2",
    "description": "Allah bersumpah dalam ayat ini dengan kitab suci Al-Qur'an mengatakan, 'demi kitab, yaitu Al-Qur'an yang menjelaskan petunjuk-petunjuk Allah untuk manusia agar senantiasa berada pada jalan yang benar. 3. Sesungguhnya kami menurunkannya pertama kali dari lauhul-mahf'z ke langit dunia sekaligus pada malam yang di berkahi. Sungguh, kamilah yang memberi peringatan."
  }
]