[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-21. Hendaknya kalian jangan menyombongkan diri di depan Allah dengan mendustakan utusan-utusanNya. Sesungguhnya aku datang kepada kalian dengan membawa bukti nyata atas kebenaran risalahku. Sesungguhnya aku berlindung kepada Allah, Tuhanku dan tuhan kalian, bila kalian hendak membunuhku dengan melempariku dengan batu. Bila kalian tidak membenarkanku dalam apa yang aku bawa kepada kalian, maka biarkanlah aku dan jangan menyakitiku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan sesungguhnya aku berlindung kepada Rabbku dan Rabb kalian dari tindakan kalian untuk membunuhku dengan merajamku dengan batu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَإِنِّى عُذْتُ بِرَبِّى وَرَبِّكُمْ أَن تَرْجُمُونِ (Dan sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu, dari keinginanmu merajamku) Musa memohon perlindungan dari Allah ketika Fir’aun dan kaumnya mengancam akan membunuhnya dengan lemparan batu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Aku benar-benar menjaga dan menghindari maksiat kepada Allah Tuhanku, dan Tuhan kalian dari keinginan kalian untuk merajamku."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya aku berlindung} aku berlindung {kepada Tuhanku dan Tuhan kalian dari ancaman kalian untuk merajamku} kalian akan membunuhku dengan melempari batu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. tapi mereka mendustakannya dan hendak membunuh beliau. Musa kembali kepada Rabbnya dari keburukan mereka seraya berkata, “dan sesungguhnya berlindung kepada Rabbku dan Rabbmu, dari keinginanmu merajamku,” yakni, kalian membunuhku dengan cara paling buruk, yaitu dengan cara melempari dengan batu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 20: Maka berdoalah Nabi Musa, (\"Dan sesungguhnya aku berlindung kepada Rabbku dan Rabb kalian, dari keinginan kalian merajamku) dengan batu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maka Nabi Musa ‘alaihis salam berlindung kepada Allah Subhaanahu wa Ta'aala dari ancaman itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 20",
    "description": "20. Lalu mereka mendustakannya dan berkeinginan untuk membunuhnya. Akan tetapi, musa tetap menyeru mereka, 'dan se sungguhnya aku, sebagai rasul utusan-Nya berlindung kepada tuhanku yang mengutus dan memeliharaku dan tuhanmu yang telah menciptakan, memelihara, dan menjagamu, dari ancamanmu untuk merajamku, yakni melukaiku dengan batu atau membunuhku dengan melempariku dengan batu. '21. Dan selanjutnya nabi musa berkata kepada mereka, 'jika kamu tetap tidak mau beriman kepadaku walau aku sudah menyampaikan bukti-bukti tentang kerasulanku dan keesaan Allah, maka biarkanlah aku memimpin bani israil dan jangan mengganggu aku untuk menyampaikan pesan-pesan tuhanku kepada mereka. '."
  }
]