[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-21. Hendaknya kalian jangan menyombongkan diri di depan Allah dengan mendustakan utusan-utusanNya. Sesungguhnya aku datang kepada kalian dengan membawa bukti nyata atas kebenaran risalahku. Sesungguhnya aku berlindung kepada Allah, Tuhanku dan tuhan kalian, bila kalian hendak membunuhku dengan melempariku dengan batu. Bila kalian tidak membenarkanku dalam apa yang aku bawa kepada kalian, maka biarkanlah aku dan jangan menyakitiku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Jika kalian tidak percaya pada apa yang aku bawa maka tinggalkanlah aku dan janganlah kalian memperlakukanku dengan buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَإِن لَّمْ تُؤْمِنُوا۟ لِى فَاعْتَزِلُونِ (dan jika kamu tidak beriman kepadaku maka biarkanlah aku) Yakni jika kalian tidak mempercayaiku dan mengakui kenabianku maka biarkanlah aku dan jangan kalian menggangguku hingga Allah memberi keputusan di antara kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Apabila kalian tidak membenarkan risalahku, maka pergilah dan tinggalkanlah aku, tinggalkan jalanku tapi janganlah menyakitiku."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian tidak beriman kepadaku, maka biarkanlah aku} maka biarkanlah aku dan berhentilah menyakitiku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “dan jika kamu tidak beriman kepadaku, maka biarkanlah aku (memimpin bani isail).” Artinya, kalian memilki tiga alternative;beriman kepadaku dan itulah yang aku inginkan dai kalian, bila alternative ini tidak kalian lakukan, maka tinggalkan aku, aku tidak menanggung apa pun dan aku tidak mendapatkan apa pun, jangan kau ganggu aku. Tapi alternatif petama dan kedua tidak mereka lakukan, justru mereka tetap membangkang kepada Allah dan memusuhi nabiNya, Musa, tanpa memberinya kesempatan untuk mengajak kaumnya bani israil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 21: (Dan jika kalian tidak beriman kepadaku) tidak percaya kepadaku (maka biarkanlah aku\") artinya, janganlah kalian menyakitiku, akan tetapi mereka tidak mau membiarkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jika kamu tidak mau beriman kepadaku, maka jangan menggangguku. Tetapi mereka di samping tidak mau beriman malah menambah dengan mengganggunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 21",
    "description": "Dan selanjutnya nabi musa berkata kepada mereka, 'jika kamu tetap tidak mau beriman kepadaku walau aku sudah menyampaikan bukti-bukti tentang kerasulanku dan keesaan Allah, maka biarkanlah aku memimpin bani israil dan jangan mengganggu aku untuk menyampaikan pesan-pesan tuhanku kepada mereka. '22. Karena telah nyata kekafiran dan ke engganan mereka untuk ber iman kepada Allah dan kepada nabi musa, lalu dia berdoa kepada tuhannya, 'sesungguhnya, mereka ini, yakni fir'aun dan kaumnya, adalah kaum yang berdosa dan pendurhaka kepada tuhannya. Oleh sebab itu, segerakanlah azab kepada mereka. '."
  }
]