[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Musa berdoa kepada Tuhannya (ketika Fira’un dan kaumnya mendustakannya dan tidak beriman kepadanya) “Sesungguhnya mereka adalah kaum yang menyekutukan Allah dan kafir.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Maka Musa -'alaihissalām- berdoa kepada Rabbnya, “Sesungguhnya mereka itu -Fir'aun dan para pembesarnya- adalah kaum yang berdosa, pantas untuk disegerakan siksa bagi mereka.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Musa berdoa pada Tuhannya bahwa: “Fir’aun dan kaumnya adalah kafir”. Yang menjadi sebab doa jelek Musa atas mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia berdoa kepada Tuhannya,“Sesungguhnya mereka ini adalah kaum yang durhaka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “kemudian Musa berdoa kepada Rabbnya,’sesungguhnya mereka ini adalah kaum yang berdosa (segerakanlah azab kepada mereka)’.” Yakni, mereka melakukan dosa yang mewajibkan disegerakannya siksaan. Nabi musa memberitahukan kondisi mereka. Ini adalah doa dengan kondisi yang lebih mengena daripada doa dengan kata-kata sebagaimana yang nabi musa doakan untuk dirinya sendiri, ”ya Rabbku, sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku,”(al-qashash:24)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 22: (Kemudian Musa berdoa kepada Rabbnya, \"Bahwasanya) (mereka ini adalah kaum yang berdosa\") orang-orang yang musyrik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka telah mengerjakan dosa yang mengharuskan untuk disegerakan hukuman. Nabi Musa ‘alaihis salam berdoa dengan menyebutkan keadaan mereka, dan ini adalah doa bil haal (dengan menyebutkan keadaan), dimana doa ini lebih dalam daripada doa dengan perkataan sebagaimana doa Nabi Musa ‘alaihisa salam ketika lapar, “Ya Rabbi, sesungguhnya aku butuh kepada kebaikan yang Engkau turunkan.” Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan Beliau membawa pergi Bani Israil pada malam hari dan memberitahukan, bahwa Fir’aun dan kaumnya akan mengejar mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 22",
    "description": "Karena telah nyata kekafiran dan ke engganan mereka untuk ber iman kepada Allah dan kepada nabi musa, lalu dia berdoa kepada tuhannya, 'sesungguhnya, mereka ini, yakni fir'aun dan kaumnya, adalah kaum yang berdosa dan pendurhaka kepada tuhannya. Oleh sebab itu, segerakanlah azab kepada mereka. '23-24. Allah menyambut permohonan nabi musa dengan berfirman kepadanya, 'karena itu berjalanlah pada malam hari dengan hamba-hamba-ku, sesungguhnya kamu, wahai musa dan pengikut-pengikutmu, akan di ikuti, yakni di kejar oleh fir'aun dan bala tentaranya, dan jika kamu semua nanti sampai di laut merah, maka pukulkanlah tongkatmu, dan laut akan terbelah, lalu menyeberanglah kamu semua. Bila kamu telah tiba di pantai, biarkanlah laut itu tetap terbelah sehingga fir'aun dan bala tentaranya berusaha menyeberangi laut itu. Sesungguhnya mereka, yakni fir'aun dan pengikut-pengikutnya adalah bala tentara yang akan di tenggelamkan ketika mereka berada di tengah-tengah laut itu. '."
  }
]