[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "berjalanlah kamu (wahai Musa) bersama hamba-hambaKu (yang membenarkanmu, juga beriman kepadamu dan mengikutimu, dan bukan orang-orang yang mendustakanmu dari mereka) di malam hari. Namun Kalian akan dikejar oleh Fir’aun dan bala tentaranya, namun kalian akan selamat, sedangkan Fir’aun dan bala tentaranya akan tenggelam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Maka Allah memerintahkan Musa agar pergi bersama kaumnya pada malam hari, dan mengabarkan kepadanya bahwa Fir'aun dan kaumnya akan mengikutinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-27. Maka Allah mewahyukan kepada Musa: pergilah di malam hari bersama orang-orang yang beriman kepadamu, karena kalian akan dikejar oleh Fir’aun dan tentaranya. Dan biarkanlah lautan terbelah setelah kamu pukul dengan tongkatmu, hingga Fir’aun dan tentaranya memasukinya; maka mereka akan tenggelam di laut itu. Mereka semua tenggelam, dan meninggalkan kebun-kebun hijau, mata air, berbagai jenis tanaman, istana-istana mewah, dan kehidupan yang penuh dengan kenikmata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. فَأَسْرِ بِعِبَادِى لَيْلًا ((Allah berfirman): “Maka berjalanlah kamu dengan membawa hamba-hamba-Ku pada malam hari) Allah mengabulkan do’anya, maka Allah memerintahkannya untuk pergi bersama Bani Israil pada malam hari. إِنَّكُم مُّتَّبَعُونَ (sesungguhnya kamu akan dikejar) Yakni dikejar oleh Fir’aun dan bala tentaranya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Maka berjalanlah (Musa) beserta Bani Israil (kaumku) pada malam hari, sesungguhnya kalian semua akan dikejar oleh pengikut fir’aun dan pasukannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Maka berjalanlah dengan hamba-hambaKu } maka berjalanlah bersama Bani Israil {pada malam hari. Sesungguhnya kalian akan diikuti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. kemudian Allah memerintahkan agar pergi bersama hamba-hambaNya di malam hari dan Allah memberitahukan bahwa fir’aun dan kaumnya akan mengikutinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 23: Maka Allah swt. berfirman, (\"Maka berjalanlah kamu) lafaz ini dapat dibaca Fa-asri atau Fasri (dengan membawa hambahamba-Ku) yaitu Bani Israel (pada malam hari, sesungguhnya kalian akan dikejar) oleh Firaun dan kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 23",
    "description": "23-24. Allah menyambut permohonan nabi musa dengan berfirman kepadanya, 'karena itu berjalanlah pada malam hari dengan hamba-hamba-ku, sesungguhnya kamu, wahai musa dan pengikut-pengikutmu, akan di ikuti, yakni di kejar oleh fir'aun dan bala tentaranya, dan jika kamu semua nanti sampai di laut merah, maka pukulkanlah tongkatmu, dan laut akan terbelah, lalu menyeberanglah kamu semua. Bila kamu telah tiba di pantai, biarkanlah laut itu tetap terbelah sehingga fir'aun dan bala tentaranya berusaha menyeberangi laut itu. Sesungguhnya mereka, yakni fir'aun dan pengikut-pengikutnya adalah bala tentara yang akan di tenggelamkan ketika mereka berada di tengah-tengah laut itu. '23-24"
  }
]