[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tinggalkan lautan sebagaimana ia sebelum kamu menyebranginya, tenang dan tidak bergolak, sesungguhnya Fir’aun dan bala tentaranya tenggelam di dalam lautan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan Allah memerintahkan kepadanya apabila dia dan Bani Israil telah menyeberangi laut agar membiarkan laut itu tetap terbelah sebagaimana semula, sesungguhnya Fir'aun dan kaumnya adalah tentara yang hancur dengan ditenggelamkan ke dalam laut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَاتْرُكِ الْبَحْرَ رَهْوًا ۖ (dan biarkanlah laut itu tetap terbelah) Yakni biarkan tetap tenang tak bergerak. إِنَّهُمْ جُندٌ مُّغْرَقُونَ(Sesungguhnya mereka adalah tentara yang akan ditenggelamkan”) Allah mengabarkan ini kepada Musa agar menenangkan hati dan jiwanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Biarkanlah laut yang tenang itu terbelah, setelah dipukul dengan tongkat oleh Musa. Sehingga fir’aun dan pasukannya tenggelam didalamnya, dan pasukan tersebut mereka tenggelam di laut, khabar ini menjadikan Musa dan pengikutnya tenang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Biarkanlah laut itu tenang} tetap pada bentuknya {Sesungguhnya mereka adalah bala tentara yang akan ditenggelamkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “dan biarkanlah laut itu tetap terbelah,” yaitu seperti kondisinya. Hal itu karena ketika Musa dan bani istail pergi di malam hai sebagaimana diperintahkan Allah dan diikuti oleh fi’aun Allah memerintahkan Nabi Musa untuk memukul laut kemudian berubah menjadi dua belas jalan. Air laut yang ada di sela-sela jalan itu seperti gunung besa. Musa dan kaumnya pun melintas. Ketika mereka keluarr dari laut, Allah memerintahkan nabi musa untuk membiarkannya tetap terbelah agar dilintasi oleh firaun dan bala tentaranya. “sesungguhnya mereka adalah tentara yang akan ditenggelamkan,” ketika seluruh kaum nabi musa keluar dari air dan kaum firaun masuk, Allah memerintahkan nabi musa untuk memukul ke arah mereka dan mereka semua tenggelam dan meninggalkan semua kenikmatan dunia. Allah menjadikan bani israil yang pernah diperbudak oleh mereka sebagai yang mewarisi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 24: (Dan biarkanlah laut itu) apabila kamu dan pengikut-pengikutmu telah menempuhnya (terbelah) tenang dalam keadaan terbelah hingga orang-orang Koptik atau kaum Firaun memasukinya (sesungguhnya mereka adalah tentara yang akan ditenggelamkan\") maka tenanglah kamu jangan khawatir. Akhirnya mereka ditenggelamkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Nabi Musa ‘alaihis salam membawa pergi Bani Israil pada malam hari sebagaimana yang Allah perintahkan, lalu Fir’aun mengejar mereka, maka Allah Subhaanahu wa Ta'aala memerintahkan Musa memukul laut. Lalu Musa memukulnya sehingga terbelahlah dua belas jalan, dan ketika itu air laut seperti gunung yang besar, lalu Musa dan kaumnya melintasinya. Setelah mereka melintasinya, maka Allah Subhaanahu wa Ta'aala memerintahkan Musa agar membiarkan laut seperti itu agar Fir’aun dan tentaranya melintasinya karena mereka akan ditenggelamkan. Ketika kaum Fir’aun telah masuk ke dalamnya, maka Allah Subhaanahu wa Ta'aala memerintahkan laut agar menyatu sehingga mereka (Fir’aun dan kaumnya) tenggelam semuanya, mereka mati dalam keadaan meninggalkan kesenangan yang banyak dari kehidupan dunia (lihat ayat 26-28 surah ini) dan Allah mewariskannya kepada Bani Israil yang sebelumnya diperbudak oleh mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 24",
    "description": "23-24. Allah menyambut permohonan nabi musa dengan berfirman kepadanya, 'karena itu berjalanlah pada malam hari dengan hamba-hamba-ku, sesungguhnya kamu, wahai musa dan pengikut-pengikutmu, akan di ikuti, yakni di kejar oleh fir'aun dan bala tentaranya, dan jika kamu semua nanti sampai di laut merah, maka pukulkanlah tongkatmu, dan laut akan terbelah, lalu menyeberanglah kamu semua. Bila kamu telah tiba di pantai, biarkanlah laut itu tetap terbelah sehingga fir'aun dan bala tentaranya berusaha menyeberangi laut itu. Sesungguhnya mereka, yakni fir'aun dan pengikut-pengikutnya adalah bala tentara yang akan di tenggelamkan ketika mereka berada di tengah-tengah laut itu. '25-27. Setelah mereka ditenggelamkan dan semuanya mati, maka Allah menjelaskan bahwa betapa banyak taman-taman yang indah lagi menawan dan mata air mata air yang mengalir yang mereka tinggalkan, juga kebun-kebun yang beraneka ragam dan macamnya serta tempat-tempat kediaman yang nyaman, menyenangkan, dan indah, dan kesenangan-kesenangan hidup yang berlimpah yang mereka semua adalah penikmatnya sebelum peristiwa penenggelaman itu terjadi."
  }
]