[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-27. Berapa banyak harta peninggalan Fir’aun dan kaumnya setelah mereka binasa dengan ditenggelamkannya mereka oleh Allah berupa kebun-kebun dan ladang-ladang hijau, mata air yang mengalir, tanaman dan bangunan-bangunan yang indah dan kehidupan di mana mereka dulu mereguk kenikmatan di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Betapa banyak Fir'aun dan kaumnya meninggalkan taman-taman dan mata air yang mengalir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Banyak taman-taman nan hijau dan sumber mata air mengalir yang mereka tinggalkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Betapa banyak taman-taman} kebun-kebun {dan mata-mata air yang mereka tinggalkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-28. karena itu Allah berfirman, ”alangkah banyaknya taman dan mata air yang mereka tinggalkan, dan kebun-kebun serta tempat-tempat yang indah-indah, dan kesenangan –kesenangan yang mereka menikmatinya, demikianlah dan kami wariskan,” nikmat tersebut “kepada kaum yang lain” , dalam ayat lain ”seperti itulah kami mewaiskannya untuk bani israil.” (asy syura:59)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 25: (Alangkah banyaknya taman yang mereka tinggalkan) yaitu kebun-kebun (dan mata air) yang mengalir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 25",
    "description": "25-27. Setelah mereka ditenggelamkan dan semuanya mati, maka Allah menjelaskan bahwa betapa banyak taman-taman yang indah lagi menawan dan mata air mata air yang mengalir yang mereka tinggalkan, juga kebun-kebun yang beraneka ragam dan macamnya serta tempat-tempat kediaman yang nyaman, menyenangkan, dan indah, dan kesenangan-kesenangan hidup yang berlimpah yang mereka semua adalah penikmatnya sebelum peristiwa penenggelaman itu terjadi"
  }
]