[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dengan hukuman seperti itu Allah menghukum orang-orang yang mendustakan dan mengganti nikmat Allah dengan kekafiran, dan setelah Fir’aun dan kaumnya binasa, Kami mewariskan nikmat-nikmat itu kepada kaum yang lain yang meneruskan mereka dari Bani Israil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Demikianlah yang terjadi pada mereka sebagaimana yang diceritakan kepada kalian, dan Kami wariskan seluruh taman-taman, mata air, kebun-kebun dan tempat-tempat indah kepada kaum yang lain, yaitu Bani Israil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Demikianlah Kami membinasakan mereka. Kami mewariskan kerajaan dan tempat tinggal mereka kepada kaum dari Bani Israil. Tidak ada penghuni langit dan bumi yang bersedih atas kebinasaan mereka. Siksaan yang telah ditetapkan bagi mereka sama sekali tidak diakhirkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. كَذٰلِكَ ۖ وَأَوْرَثْنٰهَا قَوْمًا ءَاخَرِينَ (demikianlah. Dan Kami wariskan semua itu kepada kaum yang lain) Yakni Kami ambil dari mereka kenikmatan itu, kemudian Kami binasakan mereka dan Kami wariskan kenikmatannya kepada Bani Israil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Demikianlah perintah tersebut: kami mewariskan harta benda kami kepada kaum lain yaitu, Bani Israil"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah. Kami mewariskan itu} Kami memberi kepemilikan itu {kepada kaum yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-28. karena itu Allah berfirman, ”alangkah banyaknya taman dan mata air yang mereka tinggalkan, dan kebun-kebun serta tempat-tempat yang indah-indah, dan kesenangan –kesenangan yang mereka menikmatinya, demikianlah dan kami wariskan,” nikmat tersebut “kepada kaum yang lain” , dalam ayat lain ”seperti itulah kami mewaiskannya untuk bani israil.” (asy syura:59)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 28: (Demikianlah) lafal Kadzaalika ini menjadi Khabar dari Mubtada; maksudnya, perkaranya demikianlah. (Dan Kami wariskan semua itu) yakni harta benda mereka (kepada kaum yang lain) yakni, kaum Bani Israel."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 28",
    "description": "Demikianlah kami menguraikan dan menggambarkan keadaan mereka sebelum itu dan balasan yang kami timpakan kepada mereka karena perbuatan mereka sendiri, dan kami wariskan semua itu, yakni peninggalan mereka itu, kepada kaum yang lain sesudah mereka. 29. Maka langit dan bumi yang menyaksikan azab dan balasan yang di timpakan oleh Allah kepada fir'aun dan pengikut-pengikutnya tidak menangisi mereka dan mereka pun tidak di beri penangguhan waktu, yakni kesempatan untuk memperbaiki diri mereka."
  }
]