[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Langit dan bumi tidak menangis sedih untuk Fir’aun dan kaumnya, dan azab yang menimpa mereka juga tidak ditunda."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Maka langit dan bumi tidak menangisi Fir'aun dan kaumnya tatkala mereka tenggelam, dan mereka tidak mendapatkan lagi kesempatan untuk bertobat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَمَا بَكَتْ عَلَيْهِمُ السَّمَآءُ وَالْأَرْضُ (Maka langit dan bumi tidak menangisi mereka) Mereka tidak pernah melakukan amal kebaikan di muka bumi yang dapat membuat langit menangisi mereka, begitu pula tidak pernah amal baik mereka diangkat ke langit; sehingga penduduk langit dan bumi dari kalangan malaikat dan manusia tidak menangisi kematian mereka. Dan kemungkinan maksud dari ayat ini adalah bahwa orang kafir yang sombong dan angkuh tidak pernah melihat segala sesuatu di dunia melebihi dirinya, dia merasa dialah sesuatu yang paling agung; maka Allah menunjukkan kepadanya bahwa ketika dia pergi dari dunia ini ternyata tidak ada yang berubah dari dunia. وَمَا كَانُوا۟ مُنظَرِينَ(dan merekapun tidak diberi tangguh) Namun mereka segera disiksa karena kekafiran mereka yang besar dan kedurhakaan mereka yang sangat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Maka langit tidak menangisi mereka karena tidak adanya perbuatan baik, bumipun tidak menangis karena tidak ada ibadah padanya, dan itu menjadi perumpamaan karena tidak adanya perhatian sebab kefasikan mereka dan jumlah keberadaan mereka. Mereka tidak menunda siksaan tetapi mereka menyegerakan penderitaan kekafiran mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Langit dan bumi tidak menangis untuk mereka} untuk Fir’aun dan kaumnya {dan mereka pun tidak diberi penangguhan waktu} ditangguhkan untuk bertaubat dan tidak pula untuk hal lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “maka langit dan bumi tidak mengisi mereka, langit dan bumi tidak mengisi mereka, maksudnya tidak bersedih atas mereka dan tidak berduka karena berpisah dengan mereka. Bahkan semuanya hingga langit dan bumi bergembira karena kebinasaan dan lenyapnya firaun dan kaumnya, sebab mereka tidak meninggalkan jejak apapun selain apa yang membuatk elam wajah mereka dan mengharuskan mereka mendapatkan laknat serta kemurkaan seluruh alam, bahkan seketika itu juga mereka diratakan dengan tanah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 29: (Maka langit dan bumi tidak menangisi mereka) berbeda dengan orang-orang yang beriman, jika mereka mati tanah tempat salat mereka menangisinya dan langit tempat naiknya amal mereka menangisinya pula (dan mereka pun tidak diberi tangguh) diakhirkan tobatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bahkan merasa senang dengan kematian mereka, karena mereka meninggalkan sesuatu yang buruk yang merusak bumi. Berbeda dengan orang-orang mukmin, maka bumi yang menjadi tempat shalat mereka akan menangisi mereka, demikian pula langit yang menjadi tempat naiknya amal mereka akan menangis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 29",
    "description": "Maka langit dan bumi yang menyaksikan azab dan balasan yang di timpakan oleh Allah kepada fir'aun dan pengikut-pengikutnya tidak menangisi mereka dan mereka pun tidak di beri penangguhan waktu, yakni kesempatan untuk memperbaiki diri mereka. 30-31. Dan dengan penenggelaman fir'aun dan bala tentaranya sesungguhnya telah kami selamatkan bani israil dengan kekuasaan kami dari siksaan yang menghinakan, dari siksaan fir'aun dan bala tentaranya. Sesungguhnya dia itu orang yang sombong terhadap Allah dan manusia, serta termasuk orang-orang yang melampaui batas, yaitu berlebihan dalam melakukan kejahatan dan perbuatan dosa."
  }
]