[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah menyelamatkan Bani Israil dari azab yang menghinakan mereka dengan dibunuhnya anak-anak lelaki mereka dan dibiarkannya hidup anak-anak perempuan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Dan sesungguhnya Kami telah menyelamatkan Bani Israil dari siksa yang menghinakan, yaitu tatkala Fir'aun dan kaumnya membunuh anak-anak lelaki mereka dan membiarkan hidup anak-anak perempuan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-33. Sungguh Kami telah menyelamatkan Bani Israil dari siksaan Fir’aun yang menghinakan. Fir’aun termasuk orang angkuh yang sangat zalim dan kafir. Sungguh Kami telah memilih Bani Israil -berdasarkan ilmu Kami- di antara manusia lain pada zaman mereka, dan Kami telah memberi mereka berbagai bukti keesaan Allah dan banyak mukjizat sebagai ujian yang jelas bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَلَقَدْ نَجَّيْنَا بَنِىٓ إِسْرٰٓءِيلَ مِنَ الْعَذَابِ الْمُهِينِ (Dan sesungguhnya telah Kami selamatkan Bani Israil dari siksa yang menghinakan) Yakni Kami bebaskan mereka dengan kebinasaan musuh mereka dari perbudakan, pembunuhan anak laki-laki, dan pembebanan pekerjaan yang sangat berat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Kami benar-benar membersihkan Bani Israil dari kehinaan, perbudakan dan membunuh anak-anak, dari sebab kefasikan musuh-musuh mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menyelamatkan Bani Israil dari siksaan yang menghinakan} yang menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-31. selanjutnya Allah memberikan karunia pada Bani Israil seraya berfirman, “Dan sungguh telah Kami selamatkan Bani Israil dari siksaan yang menghinakan,” yang pernah mereka alami, “dari (azab) Firaun,” karena Firaun menyembelih anak laki-laki mereka dan membiarkan wanita hidup. “Sesungguhnya dia adalah orang yang sombong,” yaitu bersikap tinggi hati di bumi tanpa hak, dan “salah seorang dari orang-orang yang melampaui batas,” yang melanggar hukum-hukum Allah dan berani menerjang larangan-laranganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 30: (Dan sesungguhnya telah Kami selamatkan Bani Israel dari siksa yang menghinakan) yakni dari pembunuhan Firaun terhadap anak-anak laki-laki mereka dan perbudakannya terhadap anak-anak perempuan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberikan nikmat kepada Bani Israil. Yaitu pembunuhan anak laki-laki dan menjadikan kaum wanita sebagai pelayan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 30",
    "description": "30-31. Dan dengan penenggelaman fir'aun dan bala tentaranya sesungguhnya telah kami selamatkan bani israil dengan kekuasaan kami dari siksaan yang menghinakan, dari siksaan fir'aun dan bala tentaranya. Sesungguhnya dia itu orang yang sombong terhadap Allah dan manusia, serta termasuk orang-orang yang melampaui batas, yaitu berlebihan dalam melakukan kejahatan dan perbuatan dosa"
  }
]