[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dari Fir’aun, sesungguhnya dia adalah orang yang sangat sombong yang termasuk orang-orang musyrik, yang bertindak melampaui batas dan angkuh di depan hamba-hamba Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Kami telah menyelamatkan mereka dari siksa Fir'aun, karena sesungguhnya ia adalah orang yang sombong dan melanggar perintah dan agama Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. مِن فِرْعَوْنَ ۚ (dari Fir’aun) Yakni dari siksaan yang diberikan Fir’aun. إِنَّهُۥ كَانَ عَالِيًا(Sesungguhnya dia adalah orang yang sombong) Yakni sangat parah dalam kesombongan dan kesewenang-wenangan. مِّنَ الْمُسْرِفِينَ(salah seorang dari orang-orang yang melampaui batas) Dalam kekafiran terhadap Allah dan perbuatan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Kami menyelamatkan mereka dari kedzaliman dan penyiksaan Fir’aun, sesungguhnya fir’aun merasa tinggi dari manusia, ia termasuk golongan orang-orang yang melampaui batas dalam kekufuran dan kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dari Fir‘aun. Sesungguhnya dia adalah orang yang sombong} orang yang sombong lagi sewenang-wenang {lagi termasuk orang-orang yang melampaui batas} melampaui batas terhadap perintah dan agama Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-31. selanjutnya Allah memberikan karunia pada Bani Israil seraya berfirman, “Dan sungguh telah Kami selamatkan Bani Israil dari siksaan yang menghinakan,” yang pernah mereka alami, “dari (azab) Firaun,” karena Firaun menyembelih anak laki-laki mereka dan membiarkan wanita hidup. “Sesungguhnya dia adalah orang yang sombong,” yaitu bersikap tinggi hati di bumi tanpa hak, dan “salah seorang dari orang-orang yang melampaui batas,” yang melanggar hukum-hukum Allah dan berani menerjang larangan-laranganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 31: (Dari siksaan Firaun) menurut suatu pendapat menjadi Badal dari lafal Al'Adzaabi yang ada pada ayat sebelumnya dengan memperkirakan adanya Mudhaf sebelumnya, yaitu lafal 'Adzaabi, lengkapnya Min 'Adzaabi Firaun, artinya: dari siksaan Firaun. Tetapi menurut pendapat lain ia menjadi Hal atau kata keterangan keadaan dari lafal Al 'Adzaabi (sesungguhnya dia adalah orang yang sombong lagi salah seorang dari orang-orang yang melampaui batas.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia sombong di muka bumi dengan tanpa hak. Yakni yang melanggar batasan Allah dan berani mengerjakan larangan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 31",
    "description": "30-31. Dan dengan penenggelaman fir'aun dan bala tentaranya sesungguhnya telah kami selamatkan bani israil dengan kekuasaan kami dari siksaan yang menghinakan, dari siksaan fir'aun dan bala tentaranya. Sesungguhnya dia itu orang yang sombong terhadap Allah dan manusia, serta termasuk orang-orang yang melampaui batas, yaitu berlebihan dalam melakukan kejahatan dan perbuatan dosa. 32. Dan dengan sungguh-sungguh, kami telah memilih mereka, yakni bani israil, dengan dasar ilmu kami untuk memiliki kelebihan di atas semua bangsa-bangsa yang lain pada masa itu."
  }
]