[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah mengangkat bani Israil dengan ilmu (sepengetahuan) dari Kami atas orang-orang di zaman mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan Kami telah memilih Bani Israil berdasarkan pengetahuan Kami atas manusia pada jaman mereka karena banyaknya para Nabi dari kalangan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَإِذَا قِيلَ إِنَّ وَعْدَ اللهِ حَقٌّ (Dan apabila dikatakan (kepadamu): “Sesungguhnya janji Allah itu adalah benar) Yakni dikatakan kepada orang-orang kafir itu. Yakni jika Rasulullah memberitahu mereka dari Allah tentang janji-Nya dalam hari kebangkitan dan perhitungan, atau semua janji yang berhubungan dengan sesuatu yang akan terjadi yang itu pasti akan terjadi. وَالسَّاعَةُ(dan hari berbangkit itu) Yakni hari kiamat. لَا رَيْبَ فِيهَا(tidak ada keraguan padanya) Tentang kejadiannya. قُلْتُم مَّا نَدْرِى مَا السَّاعَةُ (niscaya kamu menjawab: “Kami tidak tahu apakah hari kiamat itu) Yakni apa itu hari kiamat? إِن نَّظُنُّ إِلَّا ظَنًّا(kami sekali-kali tidak lain hanyalah menduga-duga saja) Yakni kami hanya mengira-ngira tanpa ada pengetahuan. وَمَا نَحْنُ بِمُسْتَيْقِنِينَ (dan kami sekali-kali tidak meyakini(nya)”) Yakni kami tidak memiliki keyakinan; kami hanya mengira bahwa hari kiamat akan datang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dan sesungguhnya kami pilih Bani Israil dibandingkan manusia lain di zamannya, atas ilmu dari kami sebab kelayakan mereka di zamannya, karena mereka adalah kaum mukmin, meskipun kebanyakan dari selain mereka adalah penyembah berhala, maka ketika mereka berpaling dan menyangkal wahyu Allah, Allah murka pada mereka selamanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh atas dasar pengetahuan Kami telah memilih mereka} Kami telah memilih mereka {di atas seluruh alam} di seluruh alam pada zaman itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. “Dan sungguh telah Kami pilih mereka,” yakni, Kami seleksi mereka “dengan pengetahuan (Kami),” yakni, berdasarkan pengetahuan Kami pada mereka dan keberhakan mereka atas keutamaan, “atas bangsa-bangsa,” yakni atas bangsa-bangsa di masa mereka dan orang-orang sebelum serta sesudah mereka hingga umat Muhammad datang, mereka adalah umat terbaik secara keseluruhan. Allah menjadikan umat Muhammad sebagai umat terbaik yang dikeluarkan untuk manusia dan memberi mereka karunia yang tidak diberikan pada umat lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 32: (Dan sesungguhnya telah Kami pilih mereka) yaitu kaum Bani Israel (dengan pengetahuan) Kami yang mengetahui semua keadaan mereka (atas orang-orang yang pandai) di zamannya, yakni mereka dipilih menjadi orang-orang yang lebih pandai daripada orang-orang yang pandai di zamannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan pengetahuan Kami terhadap keadaan mereka dan layaknya mereka mendapatkan keutamaan itu. Allah melebihkan mereka pada masa itu dan memberi mereka nikmat yang tidak diberikan-Nya kepada selain mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 32",
    "description": "Dan dengan sungguh-sungguh, kami telah memilih mereka, yakni bani israil, dengan dasar ilmu kami untuk memiliki kelebihan di atas semua bangsa-bangsa yang lain pada masa itu. 33. Dan telah kami berikan kepada mereka, melalui nabi musa yang kami utus sebagai rasul kami, di antara tanda-tanda kebesaran dan bukti ke kuasaan kami sesuatu yang di dalamnya terdapat ujian serta nikmat yang nyata."
  }
]