[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Sesungguhnya orang-orang musyrik dari kaummu (wahai Rasul) pasti akan berkata, “Tidak ada kecuali kematian yang kami rasakan, yaitu kematian pertama sekaligus terakhir, setelah kami mati, kami tidak dibangkitkan untuk dihisab dan menerima pahala atau hukuman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sesungguhnya orang-orang musyrik yang pendusta benar-benar berkata untuk mengingkari adanya kebangkitan,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-37. Hai Rasulullah, orang-orang musyrik itu berkata: “Kematian tidak lain hanyalah satu kematian kita di dunia saja, dan kita tidak akan dibangkitkan dari kubur. Jika kebangkitan itu benar, maka bangkitkanlah nenek moyang kami yang telah mati sebelumnya, jika kalian benar dalam keyakinan tentang kebangkitan itu.” Apakah orang-orang musyrik itu lebih kuat dari pada kaum Tubba’ al-Himyari dan umat-umat kafir sebelum mereka? Kami telah membinasakan mereka akibat kekafiran dan dosa-dosa besar yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34-35. إِنَّ هٰٓؤُلَآءِ (Sesungguhnya mereka) Yakni orang-orang kafir Quraisy. لَيَقُولُونَ إِنْ هِىَ إِلَّا مَوْتَتُنَا الْأُولَىٰ (itu benar-benar berkata “tidak ada kematian selain kematian di dunia ini.) Yakni tidak ada kehidupan maupun kebangkitan setelahnya. وَمَا نَحْنُ بِمُنشَرِينَ (Dan kami sekali-kali tidak akan dibangkitkan) Yakni bukan termasuk orang-orang yang dibangkitkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35. Sesungguhnya kaum musyrik dan kaum Quraisy tersebut berkata: “tidak ada kematian selain kematian kita di dunia ini, dan kami tidak akan dibangkitkan setelah mati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka itu pasti akan berkata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35. Allah mengabarkan bahwa, “sesungguhnya mereka (kaum musyrikin) itu,” yang mendustakan berkata seraya mengingkari Hari Kebangkitan, “Tidak ada kematian selain kematian di dunia ini. Dan kami sekali-kali tidak akan dibangkitkan,” yakni, tidak ada kehidupan lain selain kehidupan dunia, tidak ada kebangkitan, surga atau neraka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 34: (Sesungguhnya mereka itu) yakni orang-orang kafir Mekah (benar-benar berkata,)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kaum musyrik yang mengingkari kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 34",
    "description": "34-35. Sesungguhnya mereka, kaum musyrik mekah itu, yang mendustakan nabi Muhammad dan mendustakan kebangkitan di hari akhirat, pasti akan berkata, 'sesungguhnya tidak ada kehidupan selain kehidupan yang disusul dengan kematian di dunia ini. Dan karena itu pula, kami tidak akan dibangkitkan setelah kematian di dunia ini. '34-35"
  }
]