[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Sesungguhnya orang-orang musyrik dari kaummu (wahai Rasul) pasti akan berkata, “Tidak ada kecuali kematian yang kami rasakan, yaitu kematian pertama sekaligus terakhir, setelah kami mati, kami tidak dibangkitkan untuk dihisab dan menerima pahala atau hukuman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. “Tidak ada kematian selain kematian kami di dunia ini, dan tidak ada kehidupan setelahnya, dan tidaklah kami akan dibangkitkan setelah kematian ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35. Sesungguhnya kaum musyrik dan kaum Quraisy tersebut berkata: “tidak ada kematian selain kematian kita di dunia ini, dan kami tidak akan dibangkitkan setelah mati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Tidak ada lagi selain kematian kami yang pertama dan kami tidak akan dibangkitkan} dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35. Allah mengabarkan bahwa, “sesungguhnya mereka (kaum musyrikin) itu,” yang mendustakan berkata seraya mengingkari Hari Kebangkitan, “Tidak ada kematian selain kematian di dunia ini. Dan kami sekali-kali tidak akan dibangkitkan,” yakni, tidak ada kehidupan lain selain kehidupan dunia, tidak ada kebangkitan, surga atau neraka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 35: (\"Tidak ada kematian) yang sesudahnya ada kehidupan lagi (selain kematian di dunia ini) sewaktu mereka masih dalam keadaan berupa air mani. (Dan kami sekali-kali tidak akan dibangkitkan) tidak akan dihidupkan kembali sesudah kematian yang pertama tadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menurut mereka, tidak ada kehidupan selain di dunia saja, setelah itu tidak ada kebangkitan, surga dan neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 35",
    "description": "34-35. Sesungguhnya mereka, kaum musyrik mekah itu, yang mendustakan nabi Muhammad dan mendustakan kebangkitan di hari akhirat, pasti akan berkata, 'sesungguhnya tidak ada kehidupan selain kehidupan yang disusul dengan kematian di dunia ini. Dan karena itu pula, kami tidak akan dibangkitkan setelah kematian di dunia ini. '36. Begitu besar keingkaran mereka terhadap kebangkitan itu, sampai-sampai mereka menantang dengan mengatakan, 'jika kehidupan yang kedua itu akan ada, maka hadirkanlah atau hidupkanlah kembali nenek moyang kami yang sudah meninggal itu jika kamu orang yang benar. '."
  }
]