[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka juga berkata, “Datangkanlah olehmu (wahai Muhammad dan oleh orang-orang yang bersamamu) nenek-nenek moyang kami yang telah mati, bila kalian adalah orang-orang yang benar dalam apa yang kalian janjikan bahwa Allah membangkitkan orang-orang dari kubur dalam keadaan hidup.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Maka datangkanlah olehmu -wahai Muhammad- beserta para pengikutmu yang bersamamu, bapak-bapak kami yang telah mati dalam keadaan hidup jika kalian adalah orang-orang yang benar dalam seruan kalian bahwa Allah akan menghidupkan orang-orang yang sudah mati untuk perhitungan amal perbuatan dan pembalasan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَأْتُوا۟ بِـَٔابَآئِنَآ (maka datangkanlah (kembali) bapak-bapak kami) Yakni kembalikanlah mereka ke dunia setelah kematian mereka. إِن كُنتُمْ صٰدِقِينَ (jika kamu memang orang-orang yang benar”) Benar tentang hari kebangkitan yang kalian katakan kepada kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Apabila kebangkitan itu nyata, maka datangkanlah (kembali) bapak-bapak kami yang meninggal sebelum kami dan kembalikan mereka pada kami setelah mereka mati, jika kalian memang orang-orang yang benar dalam keyakinan akan kebangkitan beserta khabar-khabar akhirat yang telah kalian sampaikan pada kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Datangkanlah nenek moyang kami jika kalian orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Selanjutnya mereka berkata dengan lancang terhadap Rabb mereka dan melemahkan Nabi Muhammad, “Maka datangkanlah (kembali) bapak-bapak kami jika kamu memang orang-orang yang benar.” Inilah usulan orang-orang bodoh lagi menentang yang jauh. Apa korelasinya antara kebenaran Rasulullah dengan dihidupkannya bapak-bapak mereka. Telah banyak tanda-tanda kebesaran Allah berlaku sebagai bukti kebenaran risalah yang dibawa Rasulullah kepada mereka dan sudah sangat masyhur didengar dari generasi ke generasi secara berantai dari berbagai segi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 36: (Maka datangkanlah bapak-bapak kami) dalam keadaan hidup (jika kalian memang orang-orang yang benar\") bahwasanya kami akan dibangkitkan menjadi hidup kembali sesudah kami mati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya mereka berkata dengan lancang dan berani kepada Tuhan mereka sambil mencoba melemahkan-Nya. Ini adalah usulan orang-orang yang bodoh lagi menentang. Padahal dimana letak keterkaitan kebenaran Rasulullah shallallahu 'alaihi wa sallam dengan dihadirkan kembali nenek moyang mereka, karena ayat-ayat telah membuktikan kebenaran apa yang Beliau bawa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 36",
    "description": "Begitu besar keingkaran mereka terhadap kebangkitan itu, sampai-sampai mereka menantang dengan mengatakan, 'jika kehidupan yang kedua itu akan ada, maka hadirkanlah atau hidupkanlah kembali nenek moyang kami yang sudah meninggal itu jika kamu orang yang benar. '37. Apakah mereka, yakni kaum musyrik mekah itu yang lebih baik kekuasaan dan kekuatannya atau kaum tubba', yaitu orang-orang himyar dan raja-raja mereka di yaman serta orang-orang yang musyrik dan para pendurhaka sebelum mereka' tidak, sama sekali tidak. Kami telah binasakan mereka walaupun mereka memiliki kekuasaan dan kekuatan yang lebih, tetapi kekuasaan mereka tidak bermanfaat sedikit pun untuk menolak azab kami. Sesungguhnya mereka itu adalah betul-betul para pendosa dan pendurhaka yang telah mendarah daging dalam diri mereka."
  }
]