[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang musyrik itu lebih baik atau kaum Tubba’ al-Himyari dan orang-orang sebelum mereka dari umat-umat yang kafir kepada Tuhannya? Kami telah membinasakan mereka karena kejahatan dan kekafiran mereka, dan orang-orang musyrik itu tidak lebih baik daripada kalian, sehingga Kami memaafkan mereka dan tidak membinasakan mereka, dan mereka juga adalah orang-orang yang kafir kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Apakah orang-orang musyrik yang mendustakanmu itu -wahai Rasul- lebih kuat dan lebih bertahan, ataukah kaum Tubba' dan orang-orang sebelum mereka seperti kaum 'Ād dan Ṡamūd, Kami telah menghancurkan mereka semua, sesungguhnya mereka itu kaum yang berdosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. أَهُمْ خَيْرٌ أَمْ قَوْمُ تُبَّعٍ (Apakah mereka (kaum musyrikin) yang lebih baik ataukah kaum Tubba’) Apakah mereka lebih kuat atau kaum Tubba’ al-Himyary yang mampu mengelilingi dunia dengan pasukannya dan mengalahkan seluruh penduduk dunia. وَالَّذِينَ مِن قَبْلِهِمْ ۚ( dan orang-orang yang sebelum mereka) Seperti kaum ‘Aad, Tsamud, dan lainnya. أَهْلَكْنٰهُمْ ۖ إِنَّهُمْ كَانُوا۟ مُجْرِمِينَ(Kami telah membinasakan mereka karena sesungguhnya mereka adalah orang-orang yang berdosa) Maka pembinasaan orang yang lebih lemah dari mereka karena kezalimannya adalah lebih mudah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Bukankah kaum musyrik (mereka) itu baik dalam kekuatan dan penguatan. Ataukah kaum Tubba’ yang terkenal dari kesultanan Yaman, yang menguasai di penjuru dunia dan menghinakan mereka, tetapi ada salah satu diantara mereka yang berbuat kebajikan? Begitu pula golongan orang-orang sebelum mereka, seperti kaum ‘Ad dan kaum Tsamud yang kami binasakan sebab dosa mereka, karena mereka kafir. Kafir disini bukanlah kaum kafir Quraisy"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka yang lebih baik} apakah mereka lebih perkasa, lebih kuat dan lebih bisa mencegah {atau kaum Tubba‘dan orang-orang yang sebelum mereka. Kami telah membinasakan mereka karena sesungguhnya mereka adalah orang-orang yang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Allah berfirman, “Apakah mereka (kaum musyrikin) yang lebih baik,” yakni, mereka yang menjadi objek dialog, “ataukah kaum TUbba’ dan orang-orang yang sebelum mereka? Kami telah membinasakan mereka kaena sesungguhnya mereka adalah orang-orang yang berdosa,” orang-orang kafir Quraisy tidak lebih baik dari mereka dan orang-orang kafir telah sama-sama melakukan dosa. Untuk itu hendaklah mereka mengharap kebinasaan seperti yang pernah menimpa kawan-kawan mereka sesama pendosa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 37: Allah swt. berfirman, (\"Apakah mereka yang lebih baik ataukah kaum Tubba'\") Tubba' adalah seorang nabi atau seorang yang saleh (dan orang-orang yang sebelum mereka) umat-umat sebelum mereka (Kami telah membinasakan mereka) karena kekafiran mereka. Makna ayat, bahwasanya orang-orang musyrik itu tidaklah lebih kuat daripada mereka, dan ternyata mereka pun telah dibinasakan (karena sesungguhnya mereka adalah orang-orang yang berdosa.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman. Kaum Tubba' ialah orang-orang Himyar di Yaman dan Tubba' adalah gelar raja-raja mereka. Yakni mereka (kaum musyrik) saat ini tidaklah lebih baik dari mereka, bahkan sama-sama berdosa. Oleh karena itu, hendaklah mereka menunggu apa yang telah menimpa saudara-saudara mereka dahulu dari kalangan orang-orang yang berdosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 37",
    "description": "Apakah mereka, yakni kaum musyrik mekah itu yang lebih baik kekuasaan dan kekuatannya atau kaum tubba', yaitu orang-orang himyar dan raja-raja mereka di yaman serta orang-orang yang musyrik dan para pendurhaka sebelum mereka' tidak, sama sekali tidak. Kami telah binasakan mereka walaupun mereka memiliki kekuasaan dan kekuatan yang lebih, tetapi kekuasaan mereka tidak bermanfaat sedikit pun untuk menolak azab kami. Sesungguhnya mereka itu adalah betul-betul para pendosa dan pendurhaka yang telah mendarah daging dalam diri mereka. 38. Dan tidaklah kami menciptakan langit demikian luas dan bertingkat-tingkat dan bumi yang kokoh dan terhampar luas dengan segala isinya serta aturannya yang tertata dan harmonis serta apa yang ada di antara keduanya, yakni antara langit dan bumi yang dapat kamu saksikan, dengan bermain-main."
  }
]