[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Kami tidak menciptakan langit dan bumi dan apa yang ada diantara keduanya dengan main-main, Kami tidak menciptakan keduanya kecuali dengan kebenaran yang merupakan sunnah Allah pada makhlukNya dan pengaturanNya. Akan tetapi orang-orang musyrik itu tidak mengetahui hal itu. Oleh karenanya mereka tidak memikirkannya, karena mereka tidak berharap pahala dan tidak takut hukuman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan tidaklah Kami menciptakan langit, bumi dan apa yang ada di antara keduanya dengan main-main dalam menciptakannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-39. Kami tidak menciptakan tujuh langit dan bumi serta makhluk yang ada di antara keduanya untuk sesuatu yang sia-sia dan tanpa tujuan. Tidaklah Kami menciptakan keduanya melainkan dengan kebenaran yang hanya dengannya semua di atur; akan tetapi orang-orang musyrik enggan mengetahui kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Kami tidak menciptakan langit dan bumi dan apa yang ada diantara keduanya dengan main-main."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menciptakan langit, bumi, dan apa yang ada di antara keduanya secara main-main"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-39. Allah memberitahukan tentang kesempunaan Kuasa dan hikmahNya, Dia tidak menciptakan langit dan bumi karena sia-sia dan main-main tanpa adanya guna, Allah tidak menciptakan keduanya “melainkan dengan haq.” Yakni, penciptaan keduanya itu sendiri dengan haq dan penciptaannya mengandung haq. Allah menciptakan keduanya agar mereka semua menyembahNya semata, yang tidak ada sekutu bagiNya dan agar Allah memerintah, melarang, memberi pahala dan menyiksa paa hamba. “Tetapi kebanyakan mereka tidak mengetahui,” karena itu mereka tidak mau merenungkan penciptaan langit dan bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 38: (Dan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan bermain-main) dalam menciptakan hal tersebut; lafal Laa`ibiina menjadi Hal atau kata keterangan keadaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya kekuasaan-Nya dan sempurnanya hikmah (kebiaksanaan)-Nya, yaitu Dia tidaklah menciptakan langit dan bumi dengan main-main atau percuma saja tanpa faedah, bahkan Dia menciptakan keduanya dengan hak (kebenaran), mengandung yang hak, dan bahwa Dia menciptakan keduanya adalah agar mereka menyembah-Nya, agar Dia memerintah dan melarang hamba, memberi pahala dan memberi siksa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 38",
    "description": "Dan tidaklah kami menciptakan langit demikian luas dan bertingkat-tingkat dan bumi yang kokoh dan terhampar luas dengan segala isinya serta aturannya yang tertata dan harmonis serta apa yang ada di antara keduanya, yakni antara langit dan bumi yang dapat kamu saksikan, dengan bermain-main. 39. Tidaklah kami ciptakan keduanya, yakni langit dan bumi itu, melainkan dengan haq atau benar sebagai bukti ke-esaan dan kekuasaan kami untuk kesempurnaan kehidupan manusia di dunia ini, tetapi kebanyakan mereka, kaum musyrik mekah atau manusia tidak mengetahui."
  }
]