[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Kami tidak menciptakan langit dan bumi dan apa yang ada diantara keduanya dengan main-main, Kami tidak menciptakan keduanya kecuali dengan kebenaran yang merupakan sunnah Allah pada makhlukNya dan pengaturanNya. Akan tetapi orang-orang musyrik itu tidak mengetahui hal itu. Oleh karenanya mereka tidak memikirkannya, karena mereka tidak berharap pahala dan tidak takut hukuman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan tidaklah Kami menciptakan langit dan bumi kecuali dengan hikmah yang tinggi, akan tetapi kebanyakan dari orang-orang musyrik tidak mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Kami tidak menciptakan keduanya dan apa yang ada diantara keduanya melainkan dengan penciptaan yang lazim dan pasti (haq), untuk menegakkan kebenaran, tetapi kebanyakan dari mereka yaitu kaum musyrik makkah tidak mengetahui perintah tersebut sebab dangkalnya akal mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menciptakan keduanya, kecuali dengan benar. Akan tetapi kebanyakan dari mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-39. Allah memberitahukan tentang kesempunaan Kuasa dan hikmahNya, Dia tidak menciptakan langit dan bumi karena sia-sia dan main-main tanpa adanya guna, Allah tidak menciptakan keduanya “melainkan dengan haq.” Yakni, penciptaan keduanya itu sendiri dengan haq dan penciptaannya mengandung haq. Allah menciptakan keduanya agar mereka semua menyembahNya semata, yang tidak ada sekutu bagiNya dan agar Allah memerintah, melarang, memberi pahala dan menyiksa paa hamba. “Tetapi kebanyakan mereka tidak mengetahui,” karena itu mereka tidak mau merenungkan penciptaan langit dan bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 39: (Kami tidak menciptakan keduanya) dan apa yang ada di antara keduanya (melainkan dengan hak) dengan sebenarnya, daripadanya dapat disimpulkan tentang kekuasaan dan keesaan Kami, dan hal-hal lainnya (tetapi kebanyakan mereka) yaitu orang-orang kafir Mekah (tidak mengetahui.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni untuk menunjukkan kekuasaan dan keesaan Kami. Oleh karena itu, mereka tidak memikirkan penciptaan langit dan bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 39",
    "description": "Tidaklah kami ciptakan keduanya, yakni langit dan bumi itu, melainkan dengan haq atau benar sebagai bukti ke-esaan dan kekuasaan kami untuk kesempurnaan kehidupan manusia di dunia ini, tetapi kebanyakan mereka, kaum musyrik mekah atau manusia tidak mengetahui. 40-42. Sesungguhnya hari penetapan keputusan tentang siapa yang taat dan siapa yang durhaka, yaitu hari kiamat dan hari pemutusan dan pemilahan antara yang hak dan yang batil, itu adalah waktu yang dijanjikan bagi mereka semuanya, yakni semua manusia mukallaf untuk mempertanggungjawabkan semua amal mereka, yaitu pada hari ketika seorang teman sama sekali tidak dapat memberi manfaat sedikit pun kepada teman lainnya dan mereka tidak akan dapat ditolong oleh siapa pun untuk menghindarkan diri dari azab Allah, kecuali orang-orang yang diberi rahmat oleh Allah, yaitu syafaat dan perlindungan-Nya yang dapat meringankannya dari siksa. Sungguh, dia mahaperkasa, yang tidak dapat dihalangi kekuasaan-Nya untuk mengazab orang-orang yang berdoa, dan maha penyayang terhadap hamba-hamba-Nya yang taat."
  }
]