[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-8. Allah bersumpah dengan al-Quran yang lafazh dan maknanya jelas, sesungguhnya Kami menurunkannya di malam Qadar, malam yang penuh dengan kebaikan dan keberkahan yang banyak, yang ada di Bulan Ramadhan. Sesungguhnya Kami memberi peringatan kepada manusia tentang apa yang bermanfaat bagi mereka dan apa yang merugikan mereka. Hal itu dengan mmengutus para rasul dan menurunkan kitab-kitab, agar hujjah Allah tegak atas hamba-hambaNYa. Di malam itu segala perkara yang pasti mencakup ajal dan rizki dalam setahun itu serta hal-hal lainnya yang terjadi padanya sampai akhir ditetapkan dan dialihkan ke buku-buku para malaikat pencatat dari Lauhul Mahfuzh, tidak diganti dan tidak dirubah. Keputusan bijaksana itu adalah keputusan dari Kami. Segala apa yang terjadi, maka ia dengan takdir Allah dan apa yang Dia wahyukan, maka ia dengan perintah, izin, dan ilmu Allah. Sesungguhnya Kami mengutus kepada manusia para rasul, yaitu Muhammad dan para rasul sebelumnya, sebagai rahmat dari Tuhanmu (wahai rasul), kepada kaum yang mana kamu diutus kepada mereka. Sesungguhnya Allah Maha Mendengar yang mendengar segala suara, Maha Mengetahui segala urusan makhlukNya, yang lahir maupun yang batin. Dia adalah Pencipta langit dan bumi dan segala sesuatu yang ada pada keduanya, bila kalian adalah orang-orang yang meyakini hal itu, maka ketahuilah, bahwa Tuhan seluruh makhluk adalah Sembahan mereka Yang Haq; tiada tuhan yang berhak untuk disembah kecuali Dia semata, tiada sekutu bagiNya, Yang menghidupkan dan Yang mematikan. Tuhan kalian dan Tuhan nenek moyang kalian yang terdahulu, maka sembahlah Dia, bukan tuhan-tuhan yang tidak kuasa mendatangkan manfaat dan mudarar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Pada malam itu diperinci setiap urusan yang sudah ditetapkan yang berkenaan dengan rezeki, kematian dan lain-lain yang akan diterapkan oleh Allah pada tahun itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ (Pada malam itu dijelaskan segala urusan yang penuh hikmah) Makna (يفرق) yakni dijelaskan dan digamblangkan. Makna (الأمر الحكيم) yakni urusan yang ditetapkan. Sebab Allah menetapkan pada malam lailatul qadar segala apa yang akan terjadi selama satu tahun penuh seperti kematian dan kelahiran, kelapangan dan kesempitan rezeki, kebaikan dan keburukan, dan lain sebagainya; demikianlah menurut Mujahid, Qatadah, dan Hasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Pada malam lailatul Qadr setiap perkara yang berhukum menjadi terperinci dan jelas, seperti halnya, syari’at, rizqi, ajal dan lain sebagainya. Perumpaan kata يفرق adalah untuk pembeda dari masa yang akan datang dengan yang telah lampau, dengan tujuan adanya perumpamaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada malam itu dijelaskan} ditetapkan dan dijelaskan {segala urusan yang penuh hikmah} urusan yang ditentukan, berupan kebaikan, keburukan, ajal dan rezeki pada tahun itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. ”pada malam itu,” yakni di malam yang utama itu di mana al-qur’an diturunkan, ”dijelaskan segala urusan yang penuh hikmah.” Maksudnya, dijelaskan dan dibedakan serta dituliskan segala urusan takdir dan syariat yang telah ditetapkan oleh Allah. Penulisan dan pembedaan yang ada pada malam lailatul qadar merupakan salah satu pencatatn yang ditetapkan dan dibedakan, sehingga sesuai dengan pencatatan yang telah ditetapkan Allah yang menetapkan takdir seluruh makhluk, berupa ajal, rizki, perbuatan dan kondisi mereka. Selanjutnya akan berlaku pada setiap hamba ketika berada di perut ibunya. Selanjutnya Allah mewakilkan mereka pada saat manusia keluar ke alam dunia untuk mencatat amal perbuatannya. Allah menetapkan apa pun yang akan terjadi selama satu tahun pada malam lailatul qadar. Semua itu karena sempurna ilmu, hikmah, kerapian, penjagaan, serta perhatian Allah pada makhlukNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 4: (Pada malam itu) yakni pada malam Lailatulkadar, atau malam pertengahan bulan Syakban (dijelaskan) dirincikan (segala urusan yang penuh hikmah) segala urusan yang telah ditentukan, yaitu berupa rezeki dan ajal serta perkara-perkara lainnya, mulai dari malam itu sampai dengan malam yang sama untuk tahun berikutnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan segala urusan di sini ialah segala perkara yang berhubungan dengan kehidupan makhluk seperti hidup, mati, rezeki, keberuntungan, kerugian dan sebagainya. Ibnu Katsir berkata, “Yakni pada malam Lailatul qadr dijelaskan dari Lauh Mahfuzh kepada para malaikat yang mencatat, urusan yang terjadi setahun, dan apa yang terjadi pada tahun itu berupa ajal, rezeki, dan apa yang terjadi sampai akhir tahun.” Syaikh As Sa’diy menjelaskan, “Yakni dipisahkan dan dicatat semua perkara, baik yang qadari (terhadap alam semesta) dan yang syar’i (terhadap agama) yang Allah putuskan. Pemisahan dan pencatatan yang terjadi pada malam Lailatul qadr ini adalah salah satu catatan yang ditulis dan dipisahkan, sehingga bersesuaian antara catatan pertama yang Allah catat dengannya taqdir semua makhluk, ajalnya, rezeki, amal dan keadaan mereka, kemudian Allah Subhaanahu wa Ta'aala mewakilkan kepada para malaikat untuk mencatat apa yang akan terjadi pada seorang hamba, yaitu ketika dia masih dalam perut ibunya. Selanjutnya Dia menyerahkan kepada mereka (para malaikat) setelah manusia terlahir ke dunia, Allah menyerahkan kepada para malaikat yang mulia lagi mencatat, mereka menulisnya dan menjaga amal manusia. Kemudian Allah Subhaanahu wa Ta'aala menaqdirkan pada malam Lailatul qadr apa yang terjadi dalam setahun. Semua ini termasuk sempurnanya pengetahuan-Nya, sempurnanya kebijaksanaan-Nya, teliti menjaganya dan perhatian-Nya kepada makhluk-Nya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 4",
    "description": "4-6. Pada malam itu dijelaskan oleh Allah segala urusan yang penuh hikmah, yaitu segala perkara yang berhubungan dengan kehidupan makhluk di bumi, seperti hidup, mati, rezeki, nasib baik, nasib buruk, dan sebagainya, yaitu urusan yang datang dari sisi kami. Sungguh, kamilah yang mengutus rasul-rasul kepada umat-umat terdahulu dan termasuk engkau, ya Muhammad, yang diutus kepada kaummu, sebagai rahmat yang di limpahkan kepada mereka dari tuhanmu, wahai nabi Muhammad. Sungguh, dia maha mendengar semua yang mereka katakan, dan maha mengetahui semua yang mereka lakukan, 4-6"
  }
]