[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya hari keputusan diantara seluruh makhluk dengan apa yang mereka lakukan di dunia, yang baik atau yang buruk, adalah waktu berkumpul mereka semuanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya hari Kiamat saat untuk Allah memisahkan di antara para hamba-Nya merupakan waktu yang dijanjikan kepada seluruh makhluk, Allah mengumpulkan mereka semua pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40-42. Allah mengancam orang-orang kafir dengan keadaan dan azab mereka pada hari kiamat: Hari pemberian ketetapan antara seluruh makhluk merupakan waktu azab bagi orang-orang kafir itu; hari dimana seorang kerabat tidak dapat memberi manfaat sediktipun bagi kerabatnya, dan mereka tidak dapat menghindar dari azab, kecuali orang-orang beriman yang dirahmati Allah dengan syafaat-Nya. Allah Maha Perkasa dalam kerajaan-Nya dan dalam memberi balasan, Maha Pengasih bagi hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِنَّ يَوْمَ الْفَصْلِ مِيقٰتُهُمْ أَجْمَعِينَ (Sesungguhnya hari keputusan (hari kiamat) itu adalah waktu yang dijanjikan bagi mereka semuanya) Yakni itulah waktu yang ditentukan untuk membedakan antara orang baik dan orang jahat, orang yang berada di pihak yang benar dan yang salah, hari itu telah ditentukan bagi mereka pada ilmu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya hari keputusan diantara para makhluk, yaitu hari kiamat, yang membedakan orang yang berbuat kebajikan dan yang berbuat keburukan yaitu waktu mereka kembali pada adzab yang kekal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya hari keputusan} hari kiamat dimana Allah memberi keputusan di antara para makhluk {itu adalah waktu yang dijanjikan bagi mereka} waktu yang dijanjikan untuk mereka {semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “SEsungguhnya hari keputusan,” yakni, Hari Kiamat yang di hari itu Allah memberi putusan antara orang-orang pertama dan orang-orang terakhir dan memberi keputusan antara setiap orang yang berselisih, “adalah hari yang di janjikan,” untuk para makhluk, “semuanya,” yakni, semuanya akan dikumpulkan oleh Allah pada hari itu. Allah menghadirkan mereka dan mendatangkan amal perbuatan mereka, dan berdasarkan amal itulah balasan berlaku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 40: (Sesungguhnya hari keputusan itu) yakni hari kiamat adalah hari di mana Allah memutuskan perkara di antara hambahamba-Nya (adalah waktu yang dijanjikan bagi mereka semuanya) untuk menerima azab yang abadi"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada hari itu Allah Subhaanahu wa Ta'aala memberikan keputusan kepada hamba-hamba-Nya. Semuanya akan Allah kumpulkan pada hari itu, Dia menghadirkan mereka dan menghadirkan amal mereka dan pembalasan disesuaikan dengan amal mereka. Ketika itu seorang kerabat atau teman tidak dapat menolong kerabatnya atau temannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 40",
    "description": "40-42. Sesungguhnya hari penetapan keputusan tentang siapa yang taat dan siapa yang durhaka, yaitu hari kiamat dan hari pemutusan dan pemilahan antara yang hak dan yang batil, itu adalah waktu yang dijanjikan bagi mereka semuanya, yakni semua manusia mukallaf untuk mempertanggungjawabkan semua amal mereka, yaitu pada hari ketika seorang teman sama sekali tidak dapat memberi manfaat sedikit pun kepada teman lainnya dan mereka tidak akan dapat ditolong oleh siapa pun untuk menghindarkan diri dari azab Allah, kecuali orang-orang yang diberi rahmat oleh Allah, yaitu syafaat dan perlindungan-Nya yang dapat meringankannya dari siksa. Sungguh, dia mahaperkasa, yang tidak dapat dihalangi kekuasaan-Nya untuk mengazab orang-orang yang berdoa, dan maha penyayang terhadap hamba-hamba-Nya yang taat"
  }
]