[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Hari itu, seorang teman tidak menolong temannya sedikit pun, sebagian tidak membantu sebagian yang lain. Kecuali siapa yang dirahmati oleh Allah dari orang-orang yang beriman, karena seorang Mukmin mungkin memberi syafaat bagi Mukmin lainnya di sisi Allah setelah mendapatkan izin dariNya. Sesungguhnya Allah Mahaperkasa dalam pembalasanNya terhadap musuh-musuhNya, namun Maha Penyayang kepada wali-wali-Nya dan ahlu taat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Kecuali orang yang mendapat rahmat Allah dari kalangan manusia, maka dia bisa mendapat manfaat dari amal saleh yang telah dikerjakannya. Sesungguhnya Allah Maha Perkasa, tidak ada seorang pun yang mengalahkan-Nya, dan Maha Penyayang terhadap hamba-hamba-Nya yang bertobat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. إِلَّا مَن رَّحِمَ اللهُ ۚ (kecuali orang yang diberi rahmat oleh Allah) Namun orang yang mendapat rahmat Allah akan meraih pertolongan dan keselamatan. إِنَّهُۥ هُوَ الْعَزِيزُ الرَّحِيمُ (Sesungguhnya Dialah Yang Maha Perkasa lagi Maha Penyayang) Dialah yang Maha Perkasa yang tidak mungkin seseorang dapat menolong orang yang Dia kehendaki untuk diazab, dan Dia Maha Penyayang kepada orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Kecuali dengan rahmat Allah dan maaf dari Allah dan syafa’at dari Allah, itulah orang mukmin, yaitu orang yang beruntung dengan izin Allah, sesungguhnya Allah ta’ala Maha Kuat dan Maha Pemenang, maka tidak ada pertolongan bagi orang yang dikehendaki (Allah) disiksaNya, Maha Pengasih bagi orang yang dikehendaki diRahmatiNya, dan mereka adalah orang mukmin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali orang yang diberi rahmat oleh Allah. Sesungguhnya Dialah Dzat Yang Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “Kecuali orang yang diberi rahmat oleh Allah. Sesungguhnya Dia-lah Yang Mahaperkasa lagi Maha Penyayang,” karena dialah orang yang mendapatkan guna dan derajat, berkat rahmat Allah yang menjadi penyebabnya dan mereka lakukan semasa di dunia. Selanjutnya Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 42: (Kecuali orang yang diberi rahmat oleh Allah) mereka adalah orang-orang mukmin, sebagian dari mereka dapat memberikan syafaat kepada sebagian lainnya dengan seizin Allah. (Sesungguhnya Dialah Yang Maha Perkasa) Maha Menang di dalam pembalasan-Nya terhadap orang-orang kafir (lagi Maha Penyayang) terhadap orang-orang mukmin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka adalah kaum mukmin, dimana sebagian mereka memberi syafaat kepada yang lain dengan izin Allah Subhaanahu wa Ta'aala. Dalam memberikan hukuman kepada orang-orang kafir. Kepada orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 42",
    "description": "40-42. Sesungguhnya hari penetapan keputusan tentang siapa yang taat dan siapa yang durhaka, yaitu hari kiamat dan hari pemutusan dan pemilahan antara yang hak dan yang batil, itu adalah waktu yang dijanjikan bagi mereka semuanya, yakni semua manusia mukallaf untuk mempertanggungjawabkan semua amal mereka, yaitu pada hari ketika seorang teman sama sekali tidak dapat memberi manfaat sedikit pun kepada teman lainnya dan mereka tidak akan dapat ditolong oleh siapa pun untuk menghindarkan diri dari azab Allah, kecuali orang-orang yang diberi rahmat oleh Allah, yaitu syafaat dan perlindungan-Nya yang dapat meringankannya dari siksa. Sungguh, dia mahaperkasa, yang tidak dapat dihalangi kekuasaan-Nya untuk mengazab orang-orang yang berdoa, dan maha penyayang terhadap hamba-hamba-Nya yang taat. 43-44. Ayat-ayat yang lalu menggambarkan hukuman atau azab dunia bagi orang yang melakukan perbuatan dosa. Ayat-ayat berikut menggambarkan azab atau hukuman akhirat bagi mereka yang ingkar. Di antara hukuman itu adalah makanan berupa pohon zaqqum. Sesungguhnya pohon zaqqum itu, yang terdapat di pangkal api neraka itu, adalah makanan bagi orang yang banyak melakukan perbuatan dosa."
  }
]