[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Sesungguhnya pohon Zaqqum yang keluar di dasar neraka Jahim, buahnya adalah makanan bagi pelaku dosa-dosa yang banyak, dan dosa paling besar adalah syirik kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Sesungguhnya pohon Zaqqūm yang ditumbuhkan Allah di dasar neraka Jahim,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43-50. Pohon Zaqqum yang tumbuh dari dasar neraka merupakan makanan bagi orang-orang musyrik dan kafir, ia merupakan makanan yang mirip dengan tembaga meleleh yang mendidih dalam perut mereka karena bagitu panasnya. Para penjaga neraka akan diperintah: “Tangkaplah orang yang banyak berbuat dosa ini, dan pukul-lah dia untuk menggiringnya ke tengah neraka, lalu tuangkanlah air mendidih di atas kepalanya.” Kemudian akan dikatakan kepadanya sebagai olokan: “Rasakanlah azab ini, sungguh kamu sedang dimuliakan.” Inilah azab yang dulu kalian ragukan dan kalian bantah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43-44. إِنَّ شَجَرَتَ الزَّقُّومِ (Sesungguhnya pohon zaqqum itu) Ini merupakan pohon yang diciptakan Allah dalam neraka Jahannam, Allah menyebutnya dengan pohon terlaknat; jika penghuni neraka merasa lapar maka mereka akan menuju pohon ini dan memakan buahnya. طَعَامُ الْأَثِيمِ (adalah makanan orang yang banyak berdosa) Makna (الأثيم) yakni orang yang banyak melakukan dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43-44. Sesungguhnya pohon zaqqum itu, berbuah pahit, yang tumbuh didasar neraka, makanan orang-orang yang banyak berbuat dosa. Imam malik berkata: “sesungguhnya Abu Jahal datang di hari kiamat membawa kurma dan mentega”, lalu ia berkata: “berilah makan dengan Zaqqum, sesungguhnya Muhammad menjanjikan Zaqqum ini pada kalian”, dan turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pohon zaqum itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-50. ketika Allah menyebutkan hari kiamat dan Dia memberi putusan terhadap sesame hambanya di hari itu, selanjutnya Allah menyebutkan dua golongan hamba-hambaNya; golongan yang ada di surga dan golongan yang ada di neraka. Golongan kedua adalah orang-orang yang berdosa karena mengerjakan kekufuran dan kemaksiatan. Makanan mereka adalah “pohon Zaqqum,” pohon yang paling buruk dan keji, rasanya “seperti kotoran minyak,” yaitu seperti kotoran minyak yang berbau busuk dan rasanya amat panas, “yang mendidih di dalam perut, seperti mendidihnya air yang sangat panas,” dan dikatakan kepada orang yang disiksa yang menyakitkan ini, “sesungguhnya kamu orang yang perkasa dan akan dapat menangkal azab Allah dank au orang mulia sehingga Allah tidak boleh menimpakan azab padamu. Pada hari ini terlihat jelas bahwa kau adalah tercela, hina, dan rendah.”sesungguhnya ini adalah azab yang dahulu kamu selalu meragukannya,” yakni, engkau sangsikan dan sekarang menjadi kebenaran yang meyakinkan bagi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 43: (Sesungguhnya pohon zaqqum itu) zaqqum adalah pohon yang paling buruk dan sangat pahit rasanya yang tumbuh di daerah Tihamah, kelak Allah akan menumbuhkannya pula di dasar neraka Jahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang hari Kiamat dan bahwa pada hari itu Dia akan memberikan keputusan di antara hamba-hamba-Nya, maka Dia menyebutkan bahwa mereka terbagi menjadi dua golongan; golongan yang menjadi penghuni surga dan golongan yang menjadi penghuni neraka. Adapun golongan penghuni neraka yaitu mereka yang melakukan dosa dengan mengerjakan kekufuran dan kemaksiatan, maka balasannya sebagaimana yang disebutkan dalam ayat di atas. Zaqqum adalah jenis pohon yang tumbuh di neraka, pohon tersebut adalah pohon yang paling jelek dan paling buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 43",
    "description": "43-44. Ayat-ayat yang lalu menggambarkan hukuman atau azab dunia bagi orang yang melakukan perbuatan dosa. Ayat-ayat berikut menggambarkan azab atau hukuman akhirat bagi mereka yang ingkar. Di antara hukuman itu adalah makanan berupa pohon zaqqum. Sesungguhnya pohon zaqqum itu, yang terdapat di pangkal api neraka itu, adalah makanan bagi orang yang banyak melakukan perbuatan dosa"
  }
]