[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Sesungguhnya pohon Zaqqum yang keluar di dasar neraka Jahim, buahnya adalah makanan bagi pelaku dosa-dosa yang banyak, dan dosa paling besar adalah syirik kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. adalah makanan bagi orang yang banyak berbuat dosa, ia makan dari buahnya yang menjijikkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43-44. Sesungguhnya pohon zaqqum itu, berbuah pahit, yang tumbuh didasar neraka, makanan orang-orang yang banyak berbuat dosa. Imam malik berkata: “sesungguhnya Abu Jahal datang di hari kiamat membawa kurma dan mentega”, lalu ia berkata: “berilah makan dengan Zaqqum, sesungguhnya Muhammad menjanjikan Zaqqum ini pada kalian”, dan turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adalah makanan orang yang berdosa} memiliki banyak dosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-50. ketika Allah menyebutkan hari kiamat dan Dia memberi putusan terhadap sesame hambanya di hari itu, selanjutnya Allah menyebutkan dua golongan hamba-hambaNya; golongan yang ada di surga dan golongan yang ada di neraka. Golongan kedua adalah orang-orang yang berdosa karena mengerjakan kekufuran dan kemaksiatan. Makanan mereka adalah “pohon Zaqqum,” pohon yang paling buruk dan keji, rasanya “seperti kotoran minyak,” yaitu seperti kotoran minyak yang berbau busuk dan rasanya amat panas, “yang mendidih di dalam perut, seperti mendidihnya air yang sangat panas,” dan dikatakan kepada orang yang disiksa yang menyakitkan ini, “sesungguhnya kamu orang yang perkasa dan akan dapat menangkal azab Allah dank au orang mulia sehingga Allah tidak boleh menimpakan azab padamu. Pada hari ini terlihat jelas bahwa kau adalah tercela, hina, dan rendah.”sesungguhnya ini adalah azab yang dahulu kamu selalu meragukannya,” yakni, engkau sangsikan dan sekarang menjadi kebenaran yang meyakinkan bagi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 44: (Makanan orang yang banyak dosa) seperti Abu Jahal dan teman-temannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 44",
    "description": "43-44. Ayat-ayat yang lalu menggambarkan hukuman atau azab dunia bagi orang yang melakukan perbuatan dosa. Ayat-ayat berikut menggambarkan azab atau hukuman akhirat bagi mereka yang ingkar. Di antara hukuman itu adalah makanan berupa pohon zaqqum. Sesungguhnya pohon zaqqum itu, yang terdapat di pangkal api neraka itu, adalah makanan bagi orang yang banyak melakukan perbuatan dosa. 45-46. Pohon itu bentuknya seperti cairan tembaga/minyak yang mendidih di dalam perut, seperti mendidihnya air yang sangat panas yang panasnya mencapai titik puncak."
  }
]