[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tangkaplah pendosa lagi durjana itu dan doronglah ia, lalu giringlah ia dengan keras ke tengah Neraka Jahim di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan dikatakan kepada Zabaniyah, malaikat penjaga Neraka, “Ambillah ia dan seretlah ia secara paksa dan keras ke tengah-tengah Neraka Jahim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. خُذُوهُ فَاعْتِلُوهُ (Peganglah dia kemudian seretlah dia) Yakni dikatakan kepada para malaikat yang bertugas menjaga neraka: tangkaplah orang yang banyak melakukan dosa itu, lalu seretlah dia. إِلَىٰ سَوَآءِ الْجَحِيمِ (ke tengah-tengah neraka) Yakni ke tengah neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Dikatakan pada malaikat Zabaniyah: “peganglah si pendosa itu, dan seret dia dengan keras ke tengah neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Peganglah dia,lalu seretlah dia} seretlah dia dengan keras {sampai ke tengah-tengah neraka Jahim} di tengah-tengah neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-50. ketika Allah menyebutkan hari kiamat dan Dia memberi putusan terhadap sesame hambanya di hari itu, selanjutnya Allah menyebutkan dua golongan hamba-hambaNya; golongan yang ada di surga dan golongan yang ada di neraka. Golongan kedua adalah orang-orang yang berdosa karena mengerjakan kekufuran dan kemaksiatan. Makanan mereka adalah “pohon Zaqqum,” pohon yang paling buruk dan keji, rasanya “seperti kotoran minyak,” yaitu seperti kotoran minyak yang berbau busuk dan rasanya amat panas, “yang mendidih di dalam perut, seperti mendidihnya air yang sangat panas,” dan dikatakan kepada orang yang disiksa yang menyakitkan ini, “sesungguhnya kamu orang yang perkasa dan akan dapat menangkal azab Allah dank au orang mulia sehingga Allah tidak boleh menimpakan azab padamu. Pada hari ini terlihat jelas bahwa kau adalah tercela, hina, dan rendah.”sesungguhnya ini adalah azab yang dahulu kamu selalu meragukannya,” yakni, engkau sangsikan dan sekarang menjadi kebenaran yang meyakinkan bagi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 47: (Peganglah dia) dikatakan kepada malaikat Zabaniyah, \"Peganglah orang yang berdosa (kemudian seretlah dia) dapat dibaca Fa'tiluuhu atau Fa'tuluuhu artinya, seretlah dia dengan keras dan kasar (ke tengah-tengah jahim) ke tengah-tengah neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang yang berdosa itu. Perkataan ini diucapkan kepada malaikat Zabaniyyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 47",
    "description": "47-48. Ketika orang-orang yang berdosa sudah mendekat di pintu neraka, maka Allah memerintahkan kepada para malaikat, 'peganglah dia, yakni pendosa dan pendurhaka itu, kemudian seretlah dia secara kasar dan paksa sampai ke tengah-tengah neraka yang sedang menyala-Nyala itu, kemudian tuangkanlah di atas kepalanya azab, yaitu siksaan, berupa air yang sangat panas. '47-48"
  }
]