[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian tuangkan di atas kepala pendosa ini air yang sangat panas, sehingga azab tidak pernah terpisah darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Kemudian tuangkan ke atas kepala orang yang sedang diazab ini air yang panas, sehingga ia tidak terlepas dari siksa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. ثُمَّ صُبُّوا۟ فَوْقَ رَأْسِهِۦ مِنْ عَذَابِ الْحَمِيمِ (Kemudian tuangkanlah di atas kepalanya siksaan (dari) air yang amat panas) Yakni air yang sangat panas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Kemudian tuangkanlah air yang amat panas keatas kepalanya sehingga melelehkan kepalanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian tuangkanlah di atas kepalanya azab air yang sangat panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-50. ketika Allah menyebutkan hari kiamat dan Dia memberi putusan terhadap sesame hambanya di hari itu, selanjutnya Allah menyebutkan dua golongan hamba-hambaNya; golongan yang ada di surga dan golongan yang ada di neraka. Golongan kedua adalah orang-orang yang berdosa karena mengerjakan kekufuran dan kemaksiatan. Makanan mereka adalah “pohon Zaqqum,” pohon yang paling buruk dan keji, rasanya “seperti kotoran minyak,” yaitu seperti kotoran minyak yang berbau busuk dan rasanya amat panas, “yang mendidih di dalam perut, seperti mendidihnya air yang sangat panas,” dan dikatakan kepada orang yang disiksa yang menyakitkan ini, “sesungguhnya kamu orang yang perkasa dan akan dapat menangkal azab Allah dank au orang mulia sehingga Allah tidak boleh menimpakan azab padamu. Pada hari ini terlihat jelas bahwa kau adalah tercela, hina, dan rendah.”sesungguhnya ini adalah azab yang dahulu kamu selalu meragukannya,” yakni, engkau sangsikan dan sekarang menjadi kebenaran yang meyakinkan bagi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 48: (Kemudian tuangkanlah di atas kepalanya siksaan dari air yang amat panas) sehingga azab tiada henti-hentinya menimpa mereka dan tidak pernah berpisah darinya. Pengertian ayat ini lebih keras daripada apa yang diungkapkan dalam ayat lain, yaitu, \"Disiramkan air yang sedang mendidih ke atas kepala mereka...\" (Q.S. Al-Hajj, 19)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 48",
    "description": "47-48. Ketika orang-orang yang berdosa sudah mendekat di pintu neraka, maka Allah memerintahkan kepada para malaikat, 'peganglah dia, yakni pendosa dan pendurhaka itu, kemudian seretlah dia secara kasar dan paksa sampai ke tengah-tengah neraka yang sedang menyala-Nyala itu, kemudian tuangkanlah di atas kepalanya azab, yaitu siksaan, berupa air yang sangat panas. '49. Lalu dikatakan kepada mereka dengan nada mengejek dan menghina, 'rasakanlah semua siksaan yang ditimpakan kepadamu saat ini, sesungguhnya kamu benar-benar orang yang perkasa lagi mulia. '."
  }
]