[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-8. Allah bersumpah dengan al-Quran yang lafazh dan maknanya jelas, sesungguhnya Kami menurunkannya di malam Qadar, malam yang penuh dengan kebaikan dan keberkahan yang banyak, yang ada di Bulan Ramadhan. Sesungguhnya Kami memberi peringatan kepada manusia tentang apa yang bermanfaat bagi mereka dan apa yang merugikan mereka. Hal itu dengan mmengutus para rasul dan menurunkan kitab-kitab, agar hujjah Allah tegak atas hamba-hambaNYa. Di malam itu segala perkara yang pasti mencakup ajal dan rizki dalam setahun itu serta hal-hal lainnya yang terjadi padanya sampai akhir ditetapkan dan dialihkan ke buku-buku para malaikat pencatat dari Lauhul Mahfuzh, tidak diganti dan tidak dirubah. Keputusan bijaksana itu adalah keputusan dari Kami. Segala apa yang terjadi, maka ia dengan takdir Allah dan apa yang Dia wahyukan, maka ia dengan perintah, izin, dan ilmu Allah. Sesungguhnya Kami mengutus kepada manusia para rasul, yaitu Muhammad dan para rasul sebelumnya, sebagai rahmat dari Tuhanmu (wahai rasul), kepada kaum yang mana kamu diutus kepada mereka. Sesungguhnya Allah Maha Mendengar yang mendengar segala suara, Maha Mengetahui segala urusan makhlukNya, yang lahir maupun yang batin. Dia adalah Pencipta langit dan bumi dan segala sesuatu yang ada pada keduanya, bila kalian adalah orang-orang yang meyakini hal itu, maka ketahuilah, bahwa Tuhan seluruh makhluk adalah Sembahan mereka Yang Haq; tiada tuhan yang berhak untuk disembah kecuali Dia semata, tiada sekutu bagiNya, Yang menghidupkan dan Yang mematikan. Tuhan kalian dan Tuhan nenek moyang kalian yang terdahulu, maka sembahlah Dia, bukan tuhan-tuhan yang tidak kuasa mendatangkan manfaat dan mudarar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Setiap perkara yang sudah ditetapkan berasal dari sisi Kami, sesungguhnya Kami telah mengutus para Rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5-6. أَمْرًا مِّنْ عِندِنَآ ۚ ((yaitu) urusan yang besar dari sisi Kami) Allah menurunkan al-Qur’an yang mengandung wahyu dan syari’at Allah. إِنَّا كُنَّا مُرْسِلِينَ رَحْمَةً مِّن رَّبِّكَ ۚ (Sesungguhnya Kami adalah Yang mengutus rasul-rasul sebagai rahmat dari Tuhanmu) Yakni Kami memberi peringatan itu karena Kami mengirim rahmat kepada manusia melalui pengutusan para rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Allah menghendaki, ini merupakan hal yang (kami) peroleh dari hikmah kami bahwa kami telah memberikan peringatan akan datangnya utusan para Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{urusan dari sisi Kami. Sesungguhnya Kami adalah yang mengutus (para rasul)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. ”(yaitu) urusan yang besar dari sisi kami,” yakni, urusan bijak ini berasal dari sisi kami. “sesungguhnya kami adalah yang mengutus,” yakni, para rasul dan kami menurunkan al-kitab. Para rasul menyampaikan perintah-perintah yang dititahkan dan memberitahukan keputusan-keputusanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 5: (Yaitu urusan yang besar) rinciannya (dari sisi Kami. Sesungguhnya Kami adalah yang mengutus rasul-rasul) Nabi Muhammad dan rasul-rasul sebelumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni perkara yang penuh hikmah ini muncul dari sisi Kami. Yakni untuk menyampaikan perintah-perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 5",
    "description": "4-6. Pada malam itu dijelaskan oleh Allah segala urusan yang penuh hikmah, yaitu segala perkara yang berhubungan dengan kehidupan makhluk di bumi, seperti hidup, mati, rezeki, nasib baik, nasib buruk, dan sebagainya, yaitu urusan yang datang dari sisi kami. Sungguh, kamilah yang mengutus rasul-rasul kepada umat-umat terdahulu dan termasuk engkau, ya Muhammad, yang diutus kepada kaummu, sebagai rahmat yang di limpahkan kepada mereka dari tuhanmu, wahai nabi Muhammad. Sungguh, dia maha mendengar semua yang mereka katakan, dan maha mengetahui semua yang mereka lakukan, -."
  }
]