[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya azab yang ditimpakan kepada kalian hari ini adalah azab yang dulu kalian ragukan di dunia, dan kalian tidak meyakininya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Sesungguhnya siksa ini adalah yang kalian ragukan terjadinya pada hari Kiamat, maka telah hilang keraguan dari kalian dengan melihatnya langsung.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. إِنَّ هٰذَا (Sesungguhnya ini) Yakni azab ini. مَا كُنتُم بِهِۦ تَمْتَرُونَ(adalah azab yang dahulu selalu kamu meragu-ragukannya) Yakni yang kalian ragukan ketika di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Sesungguhnya ini adalah adzab yang dulu selalu kamu ragu-ragukan di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ini adalah sesuatu yang selalu kalian ragukan”} kalian ragukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-50. ketika Allah menyebutkan hari kiamat dan Dia memberi putusan terhadap sesame hambanya di hari itu, selanjutnya Allah menyebutkan dua golongan hamba-hambaNya; golongan yang ada di surga dan golongan yang ada di neraka. Golongan kedua adalah orang-orang yang berdosa karena mengerjakan kekufuran dan kemaksiatan. Makanan mereka adalah “pohon Zaqqum,” pohon yang paling buruk dan keji, rasanya “seperti kotoran minyak,” yaitu seperti kotoran minyak yang berbau busuk dan rasanya amat panas, “yang mendidih di dalam perut, seperti mendidihnya air yang sangat panas,” dan dikatakan kepada orang yang disiksa yang menyakitkan ini, “sesungguhnya kamu orang yang perkasa dan akan dapat menangkal azab Allah dank au orang mulia sehingga Allah tidak boleh menimpakan azab padamu. Pada hari ini terlihat jelas bahwa kau adalah tercela, hina, dan rendah.”sesungguhnya ini adalah azab yang dahulu kamu selalu meragukannya,” yakni, engkau sangsikan dan sekarang menjadi kebenaran yang meyakinkan bagi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 50: Dan dikatakan kepada mereka, \"(Sesungguhnya ini) azab yang kalian rasakan ini (yang dahulu selalu kalian meragukannya\") yaitu meragukan keberadaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sekarang kamu baru meyakininya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 50",
    "description": "Sesungguhnya, azab inilah, yakni semua yang kamu rasakan saat ini, yang dahulu sewaktu di dunia kamu ragukan. 51-53. Sungguh, orang-orang yang bertakwa, patuh, taat melaksanakan perintah Allah dan taat meninggalkan larangan-larangan-Nya, berada dalam tempat yang aman, damai, dan indah yang tidak dapat di lukiskan oleh manusia, yaitu di dalam taman-taman yang sangat indah dan mata air mata air yang jernih mengalir, mereka memakai sutra yang halus dan sutra yang tebal yang berkilauan, sambil duduk berhadap-hadapan."
  }
]