[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang bertakwa kepada Allah dengan menjalankan apa yang Dia perintahkan dan menjauhi apa yang Dia larang di dunia, di akhirat mereka akan mendapatkan tempat tinggal yang aman dari kesedihan, kesulitan dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Sesungguhnya orang-orang yang bertakwa kepada Rabb mereka dengan menjalankan segala perintah-perintah-Nya dan menjauhi segala larangan-larangan-Nya berada di tempat terhormat, aman dari setiap hal yang tidak disukai yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-57. Allah memberi kabar gembira bagi orang-orang bertakwa bahwa di akhirat mereka akan mendapat tempat yang mulia dan aman dari segala keburukan. Mereka berada dalam kebun-kebun indah dan mata air segar, memakai pakaian terbaik dari sutera tipis dan tebal sesuai keinginan mereka; mereka duduk saling berhadapan. Kedudukan yang mulia ini bagi bagi orang-orang bertakwa. Dan Kami muliakan mereka dengan menikahkan mereka dengan bidadari-bidadari cantik yang memiliki mata yang indah. Orang-orang bertakwa itu dapat meminta segala jenis buah-buahan di surga, dengan merasa aman dari segala yang membahayakan; mereka tidak akan merasakan kematian selamanya dan terlindung dari azab neraka Jahannam. Karunia yang luas dan beraneka ragam ini merupakan karunia dari Allah; karunia ini merupakan kemenangan yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51-52. Golongan orang-orang yang bertakwa berada dalam tempat yang aman, dari segala bentuk ketakutan akhirat, di dalam taman-taman nan hijau, dan mata air yang mengalir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang bertakwa berada di tempat} di tempat dan kediaman {yang aman} yang aman dari petaka dan sesuatu yang dibenci"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51-53. inilah balasan orang-orang yang bertakwa kepada Allah. Orang-orang yang menjaga diri dari murka dan azab Allah dengan cara menjauhi segala kemaksiatan dan mengajarkan berbagai ketaatan. Kala murka dan azab tidak ada, yang ada bagi mereka adalah keridhaan dan pahala besar dari Allah dalam naungan teduh banyaknya pepohonan dan buah-buhan serta mata air yang mengalir, di bawah mereka sungai mengalir deras di dalam surga yang penuh kenikmatan, karena semua yang terdapat dalam surga adalah kenikmatan. Semuanya adalah kenikmatan dan kebahagiaan sempurna darri berbagai sisi. Tidak ada sesuatu pun yang kotor dan keruh secara mutlak. Pakaian mereka terbuat dari sutera hijau yang tebal dan tipis yang disukai jiwa, dan mereka “saling berhadap-hadapan,” di hati dan wajah mereka dalam sempurnanya kenikmatan, kedamaian, cinta kasih, pergaulan, dan etika baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 51: (Sesungguhnya orang-orang yang bertakwa berada di dalam tempat) atau kedudukan (yang aman) dari semua hal-hal yang menakutkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan balasan untuk orang-orang yang bertakwa, yaitu mereka yang ketika di dunia menjaga diri dari kemurkaan dan azab-Nya dengan meninggalkan maksiat dan mengerjakan ketaatan, sehingga mereka memperoleh keridhaan Allah dan pahala-Nya. Mereka berada dalam naungan yang teduh karena banyak pepohonan dan buah-buahan serta mata air, di bawahnya mengalir sungai-sungai dan mereka dapat memancarkannya dengan sebaik-baiknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 51",
    "description": "51-53. Sungguh, orang-orang yang bertakwa, patuh, taat melaksanakan perintah Allah dan taat meninggalkan larangan-larangan-Nya, berada dalam tempat yang aman, damai, dan indah yang tidak dapat di lukiskan oleh manusia, yaitu di dalam taman-taman yang sangat indah dan mata air mata air yang jernih mengalir, mereka memakai sutra yang halus dan sutra yang tebal yang berkilauan, sambil duduk berhadap-hadapan. 47-48. Ketika orang-orang yang berdosa sudah mendekat di pintu neraka, maka Allah memerintahkan kepada para malaikat, 'peganglah dia, yakni pendosa dan pendurhaka itu, kemudian seretlah dia secara kasar dan paksa sampai ke tengah-tengah neraka yang sedang menyala-Nyala itu, kemudian tuangkanlah di atas kepalanya azab, yaitu siksaan, berupa air yang sangat panas. '."
  }
]