[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di taman-taman dan mata-mata air yang mengalir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Berada di taman-taman dan mata air yang mengalir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51-52. Golongan orang-orang yang bertakwa berada dalam tempat yang aman, dari segala bentuk ketakutan akhirat, di dalam taman-taman nan hijau, dan mata air yang mengalir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) di dalam taman-taman dan mata air"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51-53. inilah balasan orang-orang yang bertakwa kepada Allah. Orang-orang yang menjaga diri dari murka dan azab Allah dengan cara menjauhi segala kemaksiatan dan mengajarkan berbagai ketaatan. Kala murka dan azab tidak ada, yang ada bagi mereka adalah keridhaan dan pahala besar dari Allah dalam naungan teduh banyaknya pepohonan dan buah-buhan serta mata air yang mengalir, di bawah mereka sungai mengalir deras di dalam surga yang penuh kenikmatan, karena semua yang terdapat dalam surga adalah kenikmatan. Semuanya adalah kenikmatan dan kebahagiaan sempurna darri berbagai sisi. Tidak ada sesuatu pun yang kotor dan keruh secara mutlak. Pakaian mereka terbuat dari sutera hijau yang tebal dan tipis yang disukai jiwa, dan mereka “saling berhadap-hadapan,” di hati dan wajah mereka dalam sempurnanya kenikmatan, kedamaian, cinta kasih, pergaulan, dan etika baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 52: (Yaitu di dalam taman-taman) kebun-kebun (dan mata air-mata air.)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 52",
    "description": "47-48. Ketika orang-orang yang berdosa sudah mendekat di pintu neraka, maka Allah memerintahkan kepada para malaikat, 'peganglah dia, yakni pendosa dan pendurhaka itu, kemudian seretlah dia secara kasar dan paksa sampai ke tengah-tengah neraka yang sedang menyala-Nyala itu, kemudian tuangkanlah di atas kepalanya azab, yaitu siksaan, berupa air yang sangat panas. '47-48"
  }
]