[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka memakai sutra yang lembut dan sutra tebal, sebagian menghadapkan wajahnya kepada sebagian lainnya, sebagian tidak melihat tengkuk yang lain, majelis mereka selalu duduk melingkar bila mereka berkumpul melingkar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Di Surga mereka mengenakan sutera yang tipis dan sutera yang tebal, masing-masing saling berhadap-hadapan dan tidak seorang pun dari mereka yang melihat tengkuk orang lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. يَلْبَسُونَ مِن سُندُسٍ وَإِسْتَبْرَقٍ (mereka memakai sutera yang halus dan sutera yang tebal) Makna (السندس) adalah sutera tipis, sedangkan (الإستبرق) adalah sutera tebal. مُّتَقٰبِلِينَ(sambil (duduk) berhadap-hadapan) Yakni mereka duduk saling memandang dengan penuh kasih sayang dan kebahagiaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Mereka (golongan orang-orang bertakwa) mengenakan pakaian dari kain sutra yang tebal nan kasap. Mereka saling berhadap-hadapan satu sama lain didalam surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka mengenakan sutra yang halus dan sutra yang tebal} hiasan yang tipis dan tebal {dengan dudu berhadapan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51-53. inilah balasan orang-orang yang bertakwa kepada Allah. Orang-orang yang menjaga diri dari murka dan azab Allah dengan cara menjauhi segala kemaksiatan dan mengajarkan berbagai ketaatan. Kala murka dan azab tidak ada, yang ada bagi mereka adalah keridhaan dan pahala besar dari Allah dalam naungan teduh banyaknya pepohonan dan buah-buhan serta mata air yang mengalir, di bawah mereka sungai mengalir deras di dalam surga yang penuh kenikmatan, karena semua yang terdapat dalam surga adalah kenikmatan. Semuanya adalah kenikmatan dan kebahagiaan sempurna darri berbagai sisi. Tidak ada sesuatu pun yang kotor dan keruh secara mutlak. Pakaian mereka terbuat dari sutera hijau yang tebal dan tipis yang disukai jiwa, dan mereka “saling berhadap-hadapan,” di hati dan wajah mereka dalam sempurnanya kenikmatan, kedamaian, cinta kasih, pergaulan, dan etika baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 53: (Mereka memakai sutera yang halus dan sutera yang tebal) (seraya berhadap-hadapan) lafal Mutaqaabiliina adalah Hal atau kata keterangan keadaan, yakni, sebagian dari mereka tidak dapat melihat tengkuk sebagian yang lain, karena dipan-dipan tempat mereka duduk berbentuk bundar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan santai yang sempurna, tenang, saling mencintai, berhubungan baik dan beradab baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 53",
    "description": "47-48. Ketika orang-orang yang berdosa sudah mendekat di pintu neraka, maka Allah memerintahkan kepada para malaikat, 'peganglah dia, yakni pendosa dan pendurhaka itu, kemudian seretlah dia secara kasar dan paksa sampai ke tengah-tengah neraka yang sedang menyala-Nyala itu, kemudian tuangkanlah di atas kepalanya azab, yaitu siksaan, berupa air yang sangat panas. '54. Demikianlah kenikmatan dan kedamaian yang dapat di rasakan oleh orang-orang yang bertakwa di dalam surga. Kemudian, di samping itu, kami tambahkan lagi sesuatu yang dapat membahagiakan mereka dengan menjadikan mereka berpasangan dengan bi dadari, sosok yang bermata indah."
  }
]