[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana Kami memberikan kemuliaan kepada orang-orang yang bertakwa di akhirat dengan memasukkan mereka ke dalam surga dan memakaikan mereka sutra tebal dan sutra lembut, Kami juga memuliakan mereka dengan memberi mereka pasangan-pasangan yang sangat cantik dengan mata yang lebar lagi indah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Sebagaimana mereka telah Kami muliakan dengan hal-hal yang telah disebutkan itu, mereka Kami nikahkan dengan bidadari-bidadari yang rupawan, bermata lebar dengan putih bola matanya sangat putih dan hitamnya pun sangat hitam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَزَوَّجْنٰهُم بِحُورٍ عِينٍ (Dan Kami berikan kepada mereka bidadari) Yakni Kami muliakan mereka dengan memasangkan mereka dengan bidadari-bidadari yang Kami halalkan bagi mereka. Setiap mereka mendapat bidadari yang mereka kehendaki. Kata (الحور) merupakan bentuk jamak dari (الحوراء) yang berarti putih, atau warna bola mata yang sangat putih di antara retina mata yang sangat hitam. Dan kata (العين) adalah bentuk jamak dari (العيناء) yakni wanita yang memiliki mata yang lebar dan jelita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Keadaan tersebut merupakan keadaan penduduk Ahli Surga. Mereka didamppingi bidadari-bidadari yang elok parasnya, matanya indah, kulitnya putih bersih dan rambutnya hitam lebat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah dan Kami menjadikan mereka berpasangan dengan bidadari yang bermata elok} perempuan-perempuan yang putih dan matanya yang lebar itu indah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “demikianlah,” kenikmatan dan kebahagiaan sempurna, “dan kami bereikan kepada mereka bidadari,” wanita-wanita rupawan. Begitu rupawannya hingga membuat tatapan mata bimbang, akal tercengang karena kecantikan mereka dan hati terpanah karena kesempurnaan meeka. Dan kata yakni, mata mereka lebih lebar dan indah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 54: (Demikianlah) sebelum lafal ini diperkirakan adanya lafal Al-Amru, yakni perkaranya demikianlah. (Dan Kami kawinkan mereka) dijodohkan atau mereka dibuat senang (dengan bidadari-bidadari) dengan wanita yang putih kulitnya dan jeli matanya serta sangat cantik rupanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kenikmatan dan kesenangan yang sempurna itu. Yakni wanita-wanita yang cantik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 54",
    "description": "Demikianlah kenikmatan dan kedamaian yang dapat di rasakan oleh orang-orang yang bertakwa di dalam surga. Kemudian, di samping itu, kami tambahkan lagi sesuatu yang dapat membahagiakan mereka dengan menjadikan mereka berpasangan dengan bi dadari, sosok yang bermata indah. 55. Di dalamnya, yaitu surga, mereka dapat meminta segala macam buah-buahan sesuai dengan selera mereka dengan aman dan tenteram, ."
  }
]