[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di surga orang-orang yang bertakwa itu meminta buah-buahan apa pun yang mereka inginkan, mereka aman tanpa kematian dan apa yang mereka dapatkan tiada berakhir dan berhenti."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Mereka memanggil pelayan-pelayan mereka agar membawakan semua buah-buahan yang mereka inginkan, dan mereka merasa aman dari habisnya buah-buahan itu maupun dari bahayanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. يَدْعُونَ فِيهَا بِكُلِّ فٰكِهَةٍ ءَامِنِينَ (Di dalamnya mereka meminta segala macam buah-buahan dengan aman) Yakni mereka terbebas dari kekenyangan, wabah penyakit, rasa sakit, kematian, kelelahan, godaan setan, dan kenikmatan yang terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Di dalam surga mereka bebas melakukan apa yang mereka inginkan meminta segala macam buah-buahan dan yang lainnya dengan rasa aman tanpa kekhawatiran dan ketakutan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di dalamnya mereka meminta} meminta {segala macam buah-buahan dengan aman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “mereka meminta di dalamnya,” yakni, di surga, “segala macam buah-buhan,” yang sebagain namanya terdapat di dunia dan juga yang tidak ada padanananya di dunia. Kala penduduk surga menginginkan macam dan jenis buah-buahan apa pun, seketika itu juga buah yang diinginkannya datang tanpa bersusah payah dan meeka aman dari terputusnya buah yang diharapkan (selalu ada dan tidak musiman), aman dari bahaya, kotoran dana man untuk tidak dikeluarkan dari surga serrta terbebas dari kematian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 55: (Mereka meminta) meminta kepada para pelayan surga (di dalamnya) di dalam surga, supaya para pelayan itu mendatangkan buat mereka (segala macam buah-buahan) surga (dengan aman) dari kehabisan dan dari kemudaratannya, serta aman dari segala kekhawatiran. Lafal Aaminiina berkedudukan menjadi Hal atau kata keterangan keadaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik yang ada namanya di dunia maupun yang tidak ada namanya serta tidak ada bandingannya di dunia. Buah-buahan itu ada pada saat itu di hadapan mereka tanpa susah payah memperolehnya. Maksudnya, mereka aman dari dikeluarkan dari surga dan aman dari kematian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 55",
    "description": "Di dalamnya, yaitu surga, mereka dapat meminta segala macam buah-buahan sesuai dengan selera mereka dengan aman dan tenteram, 56-57. Mereka tidak akan merasakan di dalamnya, yakni dalam surga itu, kematian selain kematian pertama sewaktu mereka di dunia. Allah melindungi mereka dari azab neraka, sebagai karunia dari tuhanmu, wahai Muhammad. Demikian itulah kemenangan yang agung yang akan di peroleh oleh orang-orang yang taat dan patuh kepada Allah di akhirat nanti."
  }
]