[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56-58. Orang-orang yang bertakwa di surga itu tidak merasakan lagi kematian setelah kematian yang mereka rasakan di dunia. Allah melindungi orang-orang yang bertakwa itu dari azab Neraka Jahim sebagai kebaikan dan karunia dariNya. Apa yang Kami berikan kepada orang-orang yang bertakwa di akhirat berupa kemuliaan ini adalah kemenangan yang besar dimana tiada kemenangan sesudahnya. Kami memudahkan lafazh dan makna al-Quran dengan menggunakan bahasamu wahai rasul agar mereka dapat mengambil pelajaran dan merasa takut (dari berbuat maksiat)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Sebagai anugerah dan kebaikan dari Rabbmu -wahai Rasul- untuk mereka. Hal tersebut -yaitu dimasukkannya mereka ke dalam Surga dan selamat dari Neraka- adalah kemenangan besar yang tidak ada kemenangan lain yang menandinginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Allah memberikan keutamaan dan kebaikan yang berlipat kepada mereka, itulah kemenangan yang sejati karena tidak ada kemenangan setelahnya, sebab keikhlasan mereka menjauhi kemungkaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebagai karunia dari Tuhanmu. Itulah kemenangan yang sangat agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “sebagai kaunia dari Rabbmu,” yakni, diraihnya kenikmatan dan terhindanya dari azab adalah berkat karunia dan kebaikan Allah pada mereka, karena Dialah yang menolong mereka untuk mengerjakan amal shalih yang dengan amal itu mereka mendapatkankebaikan akhirat. Mereka juga diberi sesuatu yang tidak di gapai oleh amal meeka. “yang demikian itu adalah keberuntungan yang besar,” dan keberuntungan apa lagi yang lebih besar dari mendapatkan keridhaan Allah dan surgaNYa seta selamat darri azab dan mukaNya?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 57: (Sebagai karunia) lafal Fadhlan adalah Mashdar yang bermakna Tafadhdhulan, yakni pemberian karunia; dinashabkan oleh lafal Tafadhdhala yang diperkirakan keberadaannya sebelumnya (dari Rabbmu Yang demikian itu adalah keberuntungan yang besar.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mendapatkan nikmat dan terhindar dari azab termasuk karunia Allah kepada mereka dan kemurahan-Nya karena Allah yang memberi mereka taufiq untuk mengerjakan amal saleh sehingga mereka memperoleh kebaikan akhirat, serta memberikan kepada mereka apa yang tidak dicapai oleh amal mereka. Kemenangan apa yang lebih besar daripada memperoleh keridhaan Allah dan surga-Nya, serta selamat dari azab dan kemurkaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 57",
    "description": "56-57. Mereka tidak akan merasakan di dalamnya, yakni dalam surga itu, kematian selain kematian pertama sewaktu mereka di dunia. Allah melindungi mereka dari azab neraka, sebagai karunia dari tuhanmu, wahai Muhammad. Demikian itulah kemenangan yang agung yang akan di peroleh oleh orang-orang yang taat dan patuh kepada Allah di akhirat nanti. 58. Setelah menjelaskan berbagai nikmat yang diperoleh oleh orang-orang yang bertakwa di akhirat nanti, Allah lalu menggambarkan bahwa Al-Qur'an adalah tuntunan untuk mendapatkan kebahagiaan akhirat itu. Allah berfirman, 'sungguh, kami memudahkannya, yakni memudahkan penyampaian pesan-pesan Al-Qur'an itu dengan bahasamu, yaitu bahasa arab dengan harapan agar mereka mendapat pelajaran mengenai hari kiamat, siksaan, dan nikmat yang di peroleh di akhirat kelak."
  }
]