[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56-58. Orang-orang yang bertakwa di surga itu tidak merasakan lagi kematian setelah kematian yang mereka rasakan di dunia. Allah melindungi orang-orang yang bertakwa itu dari azab Neraka Jahim sebagai kebaikan dan karunia dariNya. Apa yang Kami berikan kepada orang-orang yang bertakwa di akhirat berupa kemuliaan ini adalah kemenangan yang besar dimana tiada kemenangan sesudahnya. Kami memudahkan lafazh dan makna al-Quran dengan menggunakan bahasamu wahai rasul agar mereka dapat mengambil pelajaran dan merasa takut (dari berbuat maksiat)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Maka sesungguhnya Kami memudahkan Al-Qur`ān ini dan Kami gampangkan dengan diturunkannya dalam lisan Arabmu -wahai Rasul- agar mereka mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58-59. Hai Rasulullah, Kami menurunkan al-Qur’an dengan bahasamu dan bahasa kaummu, Kami memudahkan lafazh dan maknanya agar mereka mengingat petunjuk yang lurus yang ada di dalamnya. Hai Rasulullah, tunggulah kemenangan yang Kami janjikan bagimu, dan sungguh mereka menunggu kematian dan kekalahanmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. فَإِنَّمَا يَسَّرْنٰهُ بِلِسَانِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ (Sesungguhnya Kami mudahkan Al Quran itu dengan bahasamu supaya mereka mendapat pelajaran) Yakni Kami turunkan al-Qur’an dengan bahasamu yang juga merupakan bahasa mereka, dan Kami mudahkan al-Qur’an itu untuk dipahami agar kaummu dapat memahaminya, sehingga dapat mengambil pelajaran dan ibrah serta dapat mengamalkan isi kandungannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Sesungguuhnya kami (Allah) telah menurunkan al-Qur’an dalam bahasa kalian, agar kalian mudah memahaminya, agar kalian mendapat pelajaran dan mendapat nasihat darinya, maka imanilah itu (al-Qur’an)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah memudahkannya} Kami telah memudahkan Al-Qur’an {dengan lisanmu supaya mereka mendapat pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “sesungguhnya kami mudahkan al-qur’an itu dengan bahasamu,”yaitu kami memudahkannya dengan bahasamu yang merupakan bahasa paling fasih dan mulia secara mutlak. Dengan bahasa itu, kata-kata dan makna al-qur’an menjadi mudah, “supaya mereka mendapat pelajaran,” manfaat yang terdapat di dalamnya sehingga mereka bisa melaksanakannya dan bahaya yang ada di dalamnya sehingga mereka bisa meninggalkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 58: (Sesungguhnya Kami mudahkan ia) Kami mudahkan Alquran itu (dengan bahasamu) dengan bahasa Arab supaya orangorang Arab dapat memahaminya darimu (supaya mereka mendapat pelajaran) supaya mereka dapat mengambilnya sebagai nasihat, karena itu lalu mereka beriman kepadamu; tetapi ternyata mereka tidak juga mau beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami mudahkan Al Qur’an dengan bahasamu yang merupakan bahasa yang paling fasih secara mutlak dan paling agung sehingga lafaz dan maknanya mudah. Yakni mengingatkan mereka sesuatu yang bermanfaat bagi mereka sehingga mereka mengerjakannya, dan mengingatkan sesuatu yang terdapat madharrat sehingga mereka meninggalkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 58",
    "description": "Setelah menjelaskan berbagai nikmat yang diperoleh oleh orang-orang yang bertakwa di akhirat nanti, Allah lalu menggambarkan bahwa Al-Qur'an adalah tuntunan untuk mendapatkan kebahagiaan akhirat itu. Allah berfirman, 'sungguh, kami memudahkannya, yakni memudahkan penyampaian pesan-pesan Al-Qur'an itu dengan bahasamu, yaitu bahasa arab dengan harapan agar mereka mendapat pelajaran mengenai hari kiamat, siksaan, dan nikmat yang di peroleh di akhirat kelak. 59. Maka tunggulah, wahai Muhammad, apa yang akan terjadi pada mereka dengan dosa-dosa mereka. Sesungguhnya, mereka itu juga sedang menunggu apa yang akan terjadi pada dirimu dan dakwahmu."
  }
]