[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-8. Allah bersumpah dengan al-Quran yang lafazh dan maknanya jelas, sesungguhnya Kami menurunkannya di malam Qadar, malam yang penuh dengan kebaikan dan keberkahan yang banyak, yang ada di Bulan Ramadhan. Sesungguhnya Kami memberi peringatan kepada manusia tentang apa yang bermanfaat bagi mereka dan apa yang merugikan mereka. Hal itu dengan mmengutus para rasul dan menurunkan kitab-kitab, agar hujjah Allah tegak atas hamba-hambaNYa. Di malam itu segala perkara yang pasti mencakup ajal dan rizki dalam setahun itu serta hal-hal lainnya yang terjadi padanya sampai akhir ditetapkan dan dialihkan ke buku-buku para malaikat pencatat dari Lauhul Mahfuzh, tidak diganti dan tidak dirubah. Keputusan bijaksana itu adalah keputusan dari Kami. Segala apa yang terjadi, maka ia dengan takdir Allah dan apa yang Dia wahyukan, maka ia dengan perintah, izin, dan ilmu Allah. Sesungguhnya Kami mengutus kepada manusia para rasul, yaitu Muhammad dan para rasul sebelumnya, sebagai rahmat dari Tuhanmu (wahai rasul), kepada kaum yang mana kamu diutus kepada mereka. Sesungguhnya Allah Maha Mendengar yang mendengar segala suara, Maha Mengetahui segala urusan makhlukNya, yang lahir maupun yang batin. Dia adalah Pencipta langit dan bumi dan segala sesuatu yang ada pada keduanya, bila kalian adalah orang-orang yang meyakini hal itu, maka ketahuilah, bahwa Tuhan seluruh makhluk adalah Sembahan mereka Yang Haq; tiada tuhan yang berhak untuk disembah kecuali Dia semata, tiada sekutu bagiNya, Yang menghidupkan dan Yang mematikan. Tuhan kalian dan Tuhan nenek moyang kalian yang terdahulu, maka sembahlah Dia, bukan tuhan-tuhan yang tidak kuasa mendatangkan manfaat dan mudarar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Kami mengutus para rasul sebagai rahmat dari Rabbmu -wahai Rasul- untuk kaum yang diutusi para Rasul. Sesungguhnya Dia -Subḥānahu- Maha Mendengar ucapan-ucapan hamba-hamba-Nya, Maha Mengetahui perbuatan-perbuatan mereka dan niat-niat mereka, tidak ada sedikitpun dari hal itu yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. فَبِأَىِّ حَدِيثٍۭ بَعْدَ اللهِ وَءَايٰتِهِۦ يُؤْمِنُونَ (maka dengan perkataan manakah lagi mereka akan beriman sesudah (kalam) Allah dan keterangan-keterangan-Nya) Yakni Allah adalah paling benar perkataan-Nya, jika mereka tidak mempercayai-Nya lalu kepada siapa lagi mereka akan percaya? Dan jika mereka tidak beriman kepada ayat-ayat dalam kitab-Nya, lalu kepada kitab siapa mereka akan beriman?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Kami telah menurunkan utusan untuk manusia, yaitu,secerdas-cerdas utusan bagi manusia, maha Suci Allah yang telah menurunkan KalamNya pada hambaNya, yang Maha Mengetahui keadaan dan perbuatan manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebagai rahmat dari Tuhanmu. Sesungguhnya Dia Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “sebagai Rahmat dari Rabbmu,” yakni, sesungguhnya pengutusan para Rasul dan diturunkannya kitab-kitab suci di mana al-qur’an adalah yang terbaik, merupakan rahmat dari Rabb para hamba terhadap para hamba. Tidaklah Allah memberi rahmat kepada para hamba yang lebih agung daripada petunjuk dengan kitab suci dan para rasul. Mereka mendapatkan semua kebaikan, baik di dunia maupun diakhirat, karena itulah tujuan dan sebab diturunkannya kitab suci dan diutusnya para rasul. “sesungguhnya Dilah Yang Mahamendengar lagi maha mengetahui,” yakni, mendengar segala suara, mengetahui segala hal yang lahir dan batin. Allah mengetahui pentingnya para rasul dan kitab suci untuk para hamba. Karena itu Allah merahmati mereka dan menganugerahkan para rasul dan kitab suci untuk mereka. Segala puji, karunia, dan kebaikan hanya bagi Allah semata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 6: (Sebagai rahmat) maksudnya, karena belas kasihan kepada manusia diutuslah rasul-rasul kepada mereka (dari Rabbmu. Sesungguhnya Dialah Yang Maha Mendengar) perkataan-perkataan mereka (lagi Maha Mengetahui) perbuatan-perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, pengutusan rasul dan penurunan kitab adalah rahmat dari Rabbul ‘alamin. Allah Subhaanahu wa Ta'aala tidaklah memberikan rahmat yang lebih besar daripada memberikan hidayah kepada mereka dengan menurunkan kitab dan mengutus rasul, dimana setiap kebaikan yang mereka peroleh di dunia dan akhirat adalah karena hal itu dan sebabnya. Dia mendengar semua suara dan mengetahui semua perkara yang lahir maupun yang batin. Dia mengetahui butuhnya hamba-hamba-Nya kepada para rasul dan kitab, maka Dia merahmati mereka dengan menurunkan kitab dan mengutus para rasul serta menganugerahkan nikmat kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 6",
    "description": "-7. Tuhan, pencipta, pemelihara, dan pengatur semua langit dan bumi dan apa yang ada di antara keduanya, baik yang tampak bagi kamu maupun yang tidak tampak; jika kamu orang-orang yang meyakini kebesaran dan kemahakuasaan-Nya."
  }
]