[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-8. Allah bersumpah dengan al-Quran yang lafazh dan maknanya jelas, sesungguhnya Kami menurunkannya di malam Qadar, malam yang penuh dengan kebaikan dan keberkahan yang banyak, yang ada di Bulan Ramadhan. Sesungguhnya Kami memberi peringatan kepada manusia tentang apa yang bermanfaat bagi mereka dan apa yang merugikan mereka. Hal itu dengan mmengutus para rasul dan menurunkan kitab-kitab, agar hujjah Allah tegak atas hamba-hambaNYa. Di malam itu segala perkara yang pasti mencakup ajal dan rizki dalam setahun itu serta hal-hal lainnya yang terjadi padanya sampai akhir ditetapkan dan dialihkan ke buku-buku para malaikat pencatat dari Lauhul Mahfuzh, tidak diganti dan tidak dirubah. Keputusan bijaksana itu adalah keputusan dari Kami. Segala apa yang terjadi, maka ia dengan takdir Allah dan apa yang Dia wahyukan, maka ia dengan perintah, izin, dan ilmu Allah. Sesungguhnya Kami mengutus kepada manusia para rasul, yaitu Muhammad dan para rasul sebelumnya, sebagai rahmat dari Tuhanmu (wahai rasul), kepada kaum yang mana kamu diutus kepada mereka. Sesungguhnya Allah Maha Mendengar yang mendengar segala suara, Maha Mengetahui segala urusan makhlukNya, yang lahir maupun yang batin. Dia adalah Pencipta langit dan bumi dan segala sesuatu yang ada pada keduanya, bila kalian adalah orang-orang yang meyakini hal itu, maka ketahuilah, bahwa Tuhan seluruh makhluk adalah Sembahan mereka Yang Haq; tiada tuhan yang berhak untuk disembah kecuali Dia semata, tiada sekutu bagiNya, Yang menghidupkan dan Yang mematikan. Tuhan kalian dan Tuhan nenek moyang kalian yang terdahulu, maka sembahlah Dia, bukan tuhan-tuhan yang tidak kuasa mendatangkan manfaat dan mudarar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Rabb langit, Rabb bumi dan Rabb yang ada di antara keduanya, jika kalian meyakini hal itu, maka berimanlah kepada para Rasul-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَيْلٌ لِّكُلِّ أَفَّاكٍ أَثِيمٍ (Kecelakaan besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa) Yakni bagi setiap pendusta dan banyak berbuat dosa yang melanggar setiap kewajibannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Pencipta dan pemilik langit dan bumi dan apa-apa yang ada diantara keduanya, jika kalian meyakininya dan menginginkannya, jika kalian mengakui bahwa Allah SWT adalah sang Pencipta, maka kalian harus mengakui akan keEsa-an Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yaitu Tuhan langit dan bumi serta apa yang ada di antara keduanya jika kalian adalah orang-orang yang yakin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “rabb yang memelihara langit dan bumi dan apa yang ada diantara keduanya,” yakni, pencipta langit dan bumi serta pengatur dan menggunakannya sebagaimana yang Dia kehendaki, ”jika kamu adalah orang yang meyakini,” yakni, mengetahui hal itu secara pasti dan yakin. Untuk itu ketauhilah bahwa tuhan yang menciptakan para makhluk itulah sesembahan mereka yang benar, karena itu Allah berfirman, ”tidak ada tuhan yang berhak disembah melainkan Dia,” yaitu tidak ada yang berhak diibadahi selain Dia, ”yang menghidupkan dan yang mematikan,” artinya, Dialah sendiri yang memiliki otoritas menghidupkan dan mematikan serta akan mengumpulkan kalian setelah kematian dan memberi balasan atas amal perbuatan kalian. Perbuatan baik dibalas baik dan perbuatan buruk dibalas buruk. “(Dialah) Rabbmu dan Rabb bapak-bapakmu yang terdahulu,” yakni, Rabb orang-orang terdahulu dan yang kemudian, yang mengatur mereka dengan berbagai nikmat dan menghindarkan berbagai siksaan dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 7: (Rabb yang memelihara langit dan bumi dan apa yang ada di antara keduanya) jika dibaca Rabbus Samaawaati berarti menjadi Khabar yang ketiga, jika dibaca Rabbis Samaawaati berarti menjadi Badal dari lafal Rabbika (jika kalian) hai penduduk Mekah (orang-orang yang meyakini) bahwasanya Dia adalah Rabb langit dan bumi, maka yakinilah bahwa Muhammad itu adalah rasul-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia yang menciptakan semua itu, yang mengaturnya dan yang bertindak padanya sesuai yang Dia kehendaki. Jika kamu meyakini bahwa Allah Subhaanahu wa Ta'aala Tuhan pemelihara langit dan bumi, maka yakinilah bahwa Dia yang berhak disembah saja dan bahwa Muhammad shallallahu 'alaihi wa sallam adalah utusan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 7",
    "description": "Tuhan, pencipta, pemelihara, dan pengatur semua langit dan bumi dan apa yang ada di antara keduanya, baik yang tampak bagi kamu maupun yang tidak tampak; jika kamu orang-orang yang meyakini kebesaran dan kemahakuasaan-Nya. 8. Tidak ada tuhan yang patut dan wajib disembah selain dia, dia yang senantiasa menghidupkan dan mematikan. Dialah tuhan pemelihara kamu, dan tuhan pemelihara nenek moyangmu dahulu."
  }
]