[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-8. Allah bersumpah dengan al-Quran yang lafazh dan maknanya jelas, sesungguhnya Kami menurunkannya di malam Qadar, malam yang penuh dengan kebaikan dan keberkahan yang banyak, yang ada di Bulan Ramadhan. Sesungguhnya Kami memberi peringatan kepada manusia tentang apa yang bermanfaat bagi mereka dan apa yang merugikan mereka. Hal itu dengan mmengutus para rasul dan menurunkan kitab-kitab, agar hujjah Allah tegak atas hamba-hambaNYa. Di malam itu segala perkara yang pasti mencakup ajal dan rizki dalam setahun itu serta hal-hal lainnya yang terjadi padanya sampai akhir ditetapkan dan dialihkan ke buku-buku para malaikat pencatat dari Lauhul Mahfuzh, tidak diganti dan tidak dirubah. Keputusan bijaksana itu adalah keputusan dari Kami. Segala apa yang terjadi, maka ia dengan takdir Allah dan apa yang Dia wahyukan, maka ia dengan perintah, izin, dan ilmu Allah. Sesungguhnya Kami mengutus kepada manusia para rasul, yaitu Muhammad dan para rasul sebelumnya, sebagai rahmat dari Tuhanmu (wahai rasul), kepada kaum yang mana kamu diutus kepada mereka. Sesungguhnya Allah Maha Mendengar yang mendengar segala suara, Maha Mengetahui segala urusan makhlukNya, yang lahir maupun yang batin. Dia adalah Pencipta langit dan bumi dan segala sesuatu yang ada pada keduanya, bila kalian adalah orang-orang yang meyakini hal itu, maka ketahuilah, bahwa Tuhan seluruh makhluk adalah Sembahan mereka Yang Haq; tiada tuhan yang berhak untuk disembah kecuali Dia semata, tiada sekutu bagiNya, Yang menghidupkan dan Yang mematikan. Tuhan kalian dan Tuhan nenek moyang kalian yang terdahulu, maka sembahlah Dia, bukan tuhan-tuhan yang tidak kuasa mendatangkan manfaat dan mudarar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Tidak ada yang berhak disembah selain Dia, Dia menghidupkan dan mematikan, selain Dia tidak ada yang bisa menghidupkan dan mematikan, dan Dia Rabb kalian dan Rabb bapak-bapak kalian yang terdahulu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Tidak ada Tuhan yang berhak disembah selain Allah, tidak ada sekutu bagi-Nya. Dia Maha Menghidupkan yang telah mati dan Mematikan yang masih hidup. Dia adalah Tuhan kalian dan nenek moyang kalian, akan tetapi orang-orang kafir tidak beriman kepada Allah dan tidak mentaati Rasul-Nya, mereka ragu dan lalai terhadap hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. يَسْمَعُ ءَايٰتِ اللهِ تُتْلَىٰ عَلَيْهِ ثُمَّ يُصِرُّ (dia mendengar ayat-ayat Allah dibacakan kepadanya kemudian dia tetap) Yakni dia tetap di dalam kekafirannya dan perbuatan yang biasa dia lakukan, dia enggan mengambil pelajaran dari kalamullah yang dia dengar. مُسْتَكْبِرًا(menyombongkan diri) Yakni bersikeras di atas kekafirannya dan karena keangkuhannya dia enggan mengikuti kebenaran yang berupa ayat-ayat dari Tuhannya dan Penciptanya. كَأَن لَّمْ يَسْمَعْهَا ۖ( seakan-akan dia tidak mendengarnya) Yakni keadaannya seperti keadaan orang yang tidak mendengarnya sehingga tidak menengoknya sama sekali. فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ (Maka beri khabar gembiralah dia dengan azab yang pedih) Yakni beritahukan kepadanya bahwa baginya azab yang sangat menyakitkan dari Allah sebagai balasan atas kebebalan, keangkuhan, dan keengganannya mendengar ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Tiada Tuhan yang berhak disembah kecuali Allah yang Maha Esa dan tiada sekutu bagiNya, Dia-lah yang menghidupkan dan mematikan sebagaimana yang kalian telah saksikan, yang telah menciptakan kalian semua, dan nenek moyang sebelum kalian semua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada tuhan selain Dia, Dzat yang menghidupkan dan mematikan. Tuhan kalian dan Tuhan nenek moyang kalian terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “rabb yang memelihara langit dan bumi dan apa yang ada diantara keduanya,” yakni, pencipta langit dan bumi serta pengatur dan menggunakannya sebagaimana yang Dia kehendaki, ”jika kamu adalah orang yang meyakini,” yakni, mengetahui hal itu secara pasti dan yakin. Untuk itu ketauhilah bahwa tuhan yang menciptakan para makhluk itulah sesembahan mereka yang benar, karena itu Allah berfirman, ”tidak ada tuhan yang berhak disembah melainkan Dia,” yaitu tidak ada yang berhak diibadahi selain Dia, ”yang menghidupkan dan yang mematikan,” artinya, Dialah sendiri yang memiliki otoritas menghidupkan dan mematikan serta akan mengumpulkan kalian setelah kematian dan memberi balasan atas amal perbuatan kalian. Perbuatan baik dibalas baik dan perbuatan buruk dibalas buruk. “(Dialah) Rabbmu dan Rabb bapak-bapakmu yang terdahulu,” yakni, Rabb orang-orang terdahulu dan yang kemudian, yang mengatur mereka dengan berbagai nikmat dan menghindarkan berbagai siksaan dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 8: (Tidak ada tuhan melainkan Dia, Yang menghidupkan dan Yang mematikan Dialah Rabb kalian dan Rabb bapak-bapak kalian yang terdahulu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia yang sendiri menghidupkan dan mematikan, dan akan menghimpun kamu setelah kamu mati, lalu memberi balasan kepada amalmu, jika baik maka dibalas dengan kebaikan dan jika buruk, maka dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 8",
    "description": "Tidak ada tuhan yang patut dan wajib disembah selain dia, dia yang senantiasa menghidupkan dan mematikan. Dialah tuhan pemelihara kamu, dan tuhan pemelihara nenek moyangmu dahulu. 9. Tetapi mereka senantiasa dalam keraguan, mereka bermain-main terhadap tanda-tanda ke kuasaan Allah yang telah di tunjukkan kepada mereka."
  }
]