[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Justru orang-orang musyrik itu benar-benar dalam kebimbangan terhadap kebenaran. Mereka lalai dan bermain-main, dan tidak membenarkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Orang-orang musyrik tidak meyakini hal itu, justru mereka meragukannya, bermain-main dengan kesesatan yang ada pada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. بَلْ هُمْ فِى شَكٍّ (Tetapi dalam keragu-raguan) Tentang keesaan Allah dan hari kebangkitan. يَلْعَبُونَ (mereka bermain-main) Yakni mereka bermain-main dalam pengakuan mereka bahwa Allah adalah pencipta mereka dan makhluk-makhluk yang lain, dan pengakuan mereka ini hanya untuk bermain-main dan mengolok-olok."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Tetapi mereka yang menyekutukan Allah, ragu-ragu akan adanya hari kebangkitan dan ragu akan al-Qur’an ini, mereka menertawakan Nabi SAW, menertawakan keyakinan Nabi SAW beserta pengikutnya bahwa Allah SWT lah yang menciptakan mereka dan menciptakan makhluk semesta alam, mereka menjadikan hal tsb sebagai permainan dan tertawaan. Mereka menolak Nabi sebab keyakinan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tetapi mereka dalam keraguan dan mereka bermain-main"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. kala Allah menegaskan rububiyah dan uluhiyahNya yang mewajibkan untuk diketahui secara sempurna dan menghilangkan keraguan, Allah memberitahukan bahwa orang-orang kafir meski dengan penjelasan seperti ini, “mereka bermain-main dalam keraguan-raguan,” yakni, tenggelam dalam keraguan dan syubhat, melalaikan tujuan kenapa mereka diciptakan dan lebih sibuk dengan permainan-permainan batil yang tidak bermanfaat bagi mereka, justru hanya memudaratkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dukhan ayat 9: (Tetapi mereka dalam keragu-raguan) tentang adanya hari berbangkit (adalah orang-orang yang bermain-main) dengan maksud mengejek kamu, hai Muhammad. Maka Nabi berdoa, \"Ya Allah! Bantulah aku untuk menghadapi mereka, timpakanlah kepada mereka paceklik selama tujuh tahun sebagaimana paceklik yang diminta oleh Nabi Yusuf.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyatakan rububiyyah dan uluhiyyah-Nya (ketuhanan dan keberhakan-Nya disembah) dimana hal ini mengharuskan ada pengetahuan yang sempurna (yakin) dan menolak keraguan, maka Dia memberitahukan, bahwa orang-orang kafir setelah dijelaskan hal ini, ternyata masih bergelimang di atas keraguan dan syubhat serta lalai dari tujuan mereka diciptakan, demikian juga mereka menyibukkan dengan permainan yang batil yang tidak menghasilkan bagi mereka selain bahaya. Terhadap tauhid dan kebangkitan. Yakni mengolok-olok Nabi Muhammad shallallahu 'alaihi wa sallam, maka Beliau berdoa kepada Allah agar menimpakan kepada mereka kemarau panjang selama tujuh tahun sebagaimana yang menimpa bangsa Mesir di zaman Nabi Yusuf ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dukhan Ayat 9",
    "description": "Tetapi mereka senantiasa dalam keraguan, mereka bermain-main terhadap tanda-tanda ke kuasaan Allah yang telah di tunjukkan kepada mereka. 10-11. Maka oleh sebab itu, tunggulah wahai nabi Muhammad, atau siapa pun, hari ketika langit membawa kabut, yaitu debu yang beterbangan dari tanah akibat kekeringan yang berkepanjangan yang tampak jelas bagi mereka, yang meliputi manusia sehingga mereka tidak dapat melihat apa pun di sekitar mereka dan melindungi diri mereka. Inilah azab yang pedih bagi orang-orang yang melakukan perbuatan dosa."
  }
]