[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), “Dia lah Allah pemilik tunggal uluhiyah dan rububiyah, nama nama dan sifat sifat, tidak seorangpun yang bersekutu dengan NYA padanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Katakan -wahai Rasul-, “Dia lah Allah yang esa dalam uluhiyah, tiada tuhan yang berhak disembah selain-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-4. Allah memerintahkan Rasulullah untuk menyampaikan dengan tegas kepada orang-orang musyrik yang berkata, “Sebutkanlah kepada kami nasab Tuhanmu!” Maka Allah mengajarkan Rasulullah bantahan terhadap mereka: Sungguh Tuhanku adalah Allah, satu-satunya yang berhak disembah, tidak ada satupun sekutu-Nya dalam peribadatan; Dia Maha Sempurna kekuasaan dan kemuliaan-Nya; Dia tidak beranak dan tidak mengangkat seorang anak, sekutu, atau sesuatu yang menyamai-Nya baik itu dalam Dzat, sifat, maupun perbuatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. قُلۡ هُوَ اللّٰهُ اَحَدٌ‌ ۚ‏ (Katakanlah: “Dialah Allah, Yang Maha Esa) Orang-orang musyrik mengatakan: “Hai Muhamamd, sebutkan kepada kami nasab tuhanmu!” Maka turunlah surat ini. Yakni jika kalian menanyakan nasab-Nya, maka Dia adalah Allah Yang Maha Esa, tidak ada sekutu bagi-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Muqoddimah surah al-Ikhlas : 1 ). Beberapa orang alim yang fasih dan ahli balaghoh di andalusia mencoba untuk menyusun kitab beberapa ayat yang serupa dengan al-Qur'an, maka mereka pun mengamati dan mempelajari surah al-Ikhlas; untuk mereka tiru dalam penyusunan surah yang serupa, tanpa disadari seseorang dari mereka berkata : aku ditimpa ketakutan pada sebuah kertas; yang kemudian membawaku pada pintu taubat dan penyesalan. 2 ). Surah al-Ikhlas diibaratkan seperti sepetiga al-Qur'an sebagaimana yang dijelaskan dalam sebuah hadits yang shohih; hal itu berdasarkan bahwasanya ilmu yang terkandung dalam al-Qur'an ada tiga pembagian : tauhid, hukum-hukum, dan kisah, dan surah al-ikhlas mencakup didalamnya pembahsan tentang tauhid yang merupakan sepertiga bagian dari al-Qur'an. { قُلْ هُوَ اللَّهُ أَحَدٌ , اللَّهُ الصَّمَدُ } 1-2 1 ). Mungkin sebagian dari mereka ada yang menyangka bahwa dua ayat ini pada hakikatnya bersambung : قُلْ هُوَ اللَّهُ الأَحَدٌ الصَّمَدُ , tetapi nyatanya kedua ayat ini saling terpisah, karena kalimat dari ayat ini disesuaikan agar menjadi tetap dalam diri-diri siapa yang yang membacanya dan untuk pengagungan untuknya, maka lebih sesuai jika setiap kalimat tidak terikat dengan yang lainnya. 2 ). { اللَّهُ الصَّمَدُ } Dzat yang digantungkan kepada-Nya segala urusan, dan tidak kepada selain-Nya perkara dan urusan itu digantungkan : { وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ }. Maka apakah Allah yang menjadi tempat pertama kita melaporkan segala sesuatu yang kita butuhkan, dalam susah ataupun senang, dalam keadaan sempit ataupun lapang ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Imam Ahmad dan Imam Bukhari dari Abu Sa’id Al-Khudzri yang berkata: Rasulallah SAW bersabda kepada para sahabatnya: ”Apakah salah satu dari kalian ada yang keberatan untuk membaca sepertiga Al-Qur’an di malam hari?” Maka pecahlah kondisi ketika itu. Mereka berkata: “Siapa di antara kami yang menanggung beban itu ya Rasulallah?”. Lalu Rasulallah bersabda: “Allahul Waahidush Shomad (surah Al-Ikhlash) adalah sepertiga Al-Qur’an” 1. Katakanlah wahai Nabi: Allah adalah yang Maha Esa dengan DzatNya. Tidak ada bagiNya Tuan dan tidak pula materi. Dialah Dzat yang Maha Esa dan tidak ada sekutu bagiNya. Ayat ini diturunkan ketika orang-orang musyrik berkata: “Wahai Muhammad, nasabkanlah Tuhanmu kepada kami, maksudnya yaitu sebutkanlah nasab Tuhanmu kepada kami” kemudian turunlah surah ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Dialah Allah Yang Maha Esa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. “Katakanlah,” dengan perkataan tegas, dengan yakin, dan mengetahui maknanya, “Dia-lah Allah Yang Maha Esa,” yakni, kemahaesaan itu hanya terbatas padaNya. Dia-lah Yang Maha Esa, yang tersendiri dengan kesempurnaan, hanya bagiNya nama-nama indah, sifat-sifat sempurna yang tinggi dan perbuatan-perbuatan yang suci, yang tidak ada tandinganNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tiga surah terakhir ini : Al-Ikhlash, dan Al-mu'awwidzatain ( al-falaq dan an-nas ), adalah tiga surah penutup Al-Qur'an, tiga surah yang agung dan mulia surah yang sering dibaca oleh Rasulullah ﷺ setiap sebelum tidur dengan meniupkan pada kedua telapak tangannya dan membaca ketiga surah ini, kemudian ﷺ mengusap wajahnya, dan sebisa yang dapat ia usap dari badannya, surah yang dijadikan oleh Rasulullah ﷺ sebagai penangkal kejahatan sihir dengan izin Allah ﷻ , surah yang mengandung banyak keutamaan didalamnya. Adapun sebab dinamakan surah ini \"Al-Ikhlas\" adalah bahwasanya Allah memurnikan / mengkhususkan surat tersebut hanya untuk-Nya, yaitu Allah tidak menyebutkan sedikitpun di dalamnya hukum-hukum syar'i dan tidak juga khabar-khabar tentang selain-Nya. Yang ada, Allah hanya menyebutkan pengkhabaran tentang diri-Nya. Tauhid yang terdiri dari \"Tauhid asma' wa sifat\" terlampir didalam surah yang agung ini, juga hadits shahih menjelaskan salah satu keutamaan dari surah ini, yaitu surah ini sebanding dengan sepertiga Al-Quran, yakni dari segi keutamaan surah ini sebanding dengan sepertiga Al-Qur'an, dalam hadits dikatakan : (( أَنَّ رَجُلاً سَمِعَ رَجُلاً يَقْرَأُ: قُلْ هُوَ اللهُ أَحَدٌ يُرَدِّدُهَا، فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُوْلِ اللهِ ، فَذَكَرَ ذَلِكَ لَهُ، وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا، فَقَالَ رَسُوْلُ اللهِ : ((وَالَّذِيْ نَفْسِيْ بِيَدِهِ، إِنَّهَا لَتَعْدِلُ ثُلُثَ القُرْآنِ. )) “Sesungguhnya seseorang mendengar orang lain membaca قُلْ هُوَ اللهُ أَحَدٌ dengan mengulang-ulangnya, maka tatkala pagi harinya, ia mendatangi Rasulullah n dan menceritakan hal itu kepadanya, dan seolah-olah orang itu menganggap remeh surat itu, maka bersabdalah Rasulullah Shallallahu ‘alaihi wa sallam : “Demi Dzat yang jiwaku berada di tanganNya, sesungguhnya surat itu sebanding dengan sepertiga al Qur`an” [ HR al Bukhari, 4/1915 no. 4726 ] . Dalam hadits lain dikatakan : (( أَنَّ النَّبِيَّ بَعَثَ رَجُلاً عَلَى سَرِيَّةٍ، وَكَانَ يَقْرَأُ لأَصْحَابِهِ فِي صَلاَتِهِ، فَيَخْتِمُ بِـ قُلْ هُوَ اللهُ أَحَدٌ، فَلَمَّا رَجَعُوا، ذَكَرُوا ذَلِكَ لِلنَّبِيِّ ، فَقَالَ: ((سَلُوْهُ، لأَيِّ شَيْءٍ يَصْنَعُ ذَلِكَ؟))، فَسَأَلُوْهُ، فَقَالَ: لأَنَّهَا صِفَةُ الرَّحْمَنِ، وَأَنَا أُحِبُّ أَنْ أَقْرَأَ بِهَا، فَقَالَ النَّبِيُّ : أَخْبِرُوْهُ أَنَّ اللهَ يُحِبُّهُ )) “Sesungguhnya Nabi Shallallahu ‘alaihi wa sallam mengutus seseorang kepada sekelompok pasukan, dan ketika orang itu mengimami yang lainnya di dalam shalatnya, ia membaca, dan mengakhiri (bacaannya) dengan قُلْ هُوَ اللهُ أَحَدٌ, maka tatkala mereka kembali pulang, mereka menceritakan hal itu kepada Rasulullah Shallallahu ‘alaihi wa sallam, lalu beliau pun bersabda: “Tanyalah ia, mengapa ia berbuat demikian?” Lalu mereka bertanya kepadanya. Ia pun menjawab: “Karena surat ini (mengandung) sifat ar Rahman, dan aku mencintai untuk membaca surat ini,” lalu Nabi Shallallahu ‘alaihi wa sallam bersabda: “Beritahu dia, sesungguhnya Allah pun mencintainya” [ HR al Bukhari, 6/2686 no. 6940; Muslim, 1/557 no. 813 ] . { قُلْ هُوَ اللَّهُ أَحَدٌ } Katakanlah wahai Muhammad, sampaikanlah kepada ummat mu, bahwasanya Dialah Allah ﷻ yang esa, Dia ﷻ yang sempurna sifat-sifat dan nama-Nya, tiada sembahan selain-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Disebutkan tentang sebab diturunkannya surat ini bahwa orang-orang musyrik atau yahudi berkata kepada Nabi shallallaahu ‘alaihi wa sallam: Sebutkan sifat Tuhanmu kepada kami? Maka Allah menurunkan surat ini. قُلْ “katakanlah” yang diajak bicara di sini adalah Rasul ‘alaihissholaatu wassalaam, dan untuk umat islam juga dan هُوَ اللَّهُ أَحَدٌ “Dia-lah Allah, Yang Maha Esa,” Dhamir asy-Sya’en menurut para pakar I’rab (gramatika Bahasa arab) dan lafadzul jalaalah الله adalah khabar mubtada dan أَحَدٌ [Ahad] khabar mubtada kedua."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ikhlas ayat 1: Allah memerintahkan Nabi ﷺ agar berkata kepada manusia : Sesungguhnya Allah menyendiri dalam ke-Uluhiyyahan, Rububiyyah dan Nama serta Sifat-Nya, tidak bersekutu sesuatu apapun dengan-Nya. Inilah yang dimaksud makna ahad (Esa). Tidak sebagaimana diklaim oleh Mu’tazilah dan Asya’irah : Dia tunggal tidak terbagi-bagi dan terpisah-pisah, dengan kata lain : Dia tidak memiliki pembagian (Uluhiyyah, Rububiyyah dan Asma wa Sifat). Dan bantahan bagi mereka firman Allah yang ada dalam akhir akhir surat ini وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ yang artinya : Dan tidak ada sesuatupun yang semisal dengan Dia. Ini lebih utama dan mencakup secara keseluruhan dibandingkan ucapan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan memastikan, meyakininya dan mengetahui maknanya. Dan jawablah dengan surah ini orang-orang yang bertanya tentang siapa Allah Subhaanahu wa Ta'aala? Dia sendiri dengan kesempurnaan, memiliki nama-nama yang indah dan sifat-sifat yang tinggi yang sempurna serta perbuatan-perbuatan yang suci, dimana pada semua itu tidak ada yang menyamainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ikhlas Ayat 1",
    "description": "Wahai nabi Muhammad, katakanlah kepada kaum musyrik yang menanyakan sifat dan nasab Allah dengan tujuan mengejek, 'dia lah Allah, yang maha esa. Tidak ada sekutu bagi-Nya. Dia tidak berbilang dalam nama, sifat, dan ketuhanan-Nya. 2. Allah tempat meminta segala sesuatu. Dia maha pencipta, mahakaya, dan mahakuasa. Dia tidak memerlukan yang lain, sedangkan semua makhluk bergantung kepada-Nya."
  }
]