[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah yang sempurna dalam sifat-sifat kemuliaan dan keutamaan serta keagungan, yang dituju oleh makhluk-makhluk dalam memenuhi kebutuhan dan keinginan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia lah Tuhan yang berada di puncak dalam hal kesempurnaan dan keindahan, Żat Yang menjadi tumpuan semua makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. اَللّٰهُ الصَّمَدُ‌ ۚ‏ (Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu) Makna (الصمد) adalah Dzat yang diserahi untuk mengabulkan segala kebutuhan, karena hanya Dia yang mampu mengabulkannya. Ibnu Abbas mengatakan: (الصمد) yakni Tuhan yang Maha Sempurna sifat ketuhanan-Nya, Mulia yang Maha Sempurna Keagungan-Nya, Maha Pengasih yang Maha Sempurna kasih-Nya, Maha Kaya yang Maha Sempurna kekayaan-Nya, Perkasa yang Maha Sempurna keperkasaan-Nya, Mengetahui yang Maha Sempurna pengetahuan-Nya, Dialah Allah yang memiliki sifat-sifat ini yang tidak layak kecuali bagi-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Mungkin sebagian dari mereka ada yang menyangka bahwa dua ayat ini pada hakikatnya bersambung : قُلْ هُوَ اللَّهُ الأَحَدٌ الصَّمَدُ , tetapi nyatanya kedua ayat ini saling terpisah, karena kalimat dari ayat ini disesuaikan agar menjadi tetap dalam diri-diri siapa yang yang membacanya dan untuk pengagungan untuknya, maka lebih sesuai jika setiap kalimat tidak terikat dengan yang lainnya. 2 ). { اللَّهُ الصَّمَدُ } Dzat yang digantungkan kepada-Nya segala urusan, dan tidak kepada selain-Nya perkara dan urusan itu digantungkan : { وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ }. Maka apakah Allah yang menjadi tempat pertama kita melaporkan segala sesuatu yang kita butuhkan, dalam susah ataupun senang, dalam keadaan sempit ataupun lapang ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah adalah Dzat yang menguasai tujuan dari semua kebutuhan selama-lamanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tempat meminta segala sesuatu} penguasa yang sempurna dalam kekuasaanNya dan menjadi tujuan agar ditunaikan segala keperluan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Allah adalah Tuhan yang bergantung kepadaNya segala sesuatu,” yakni yang dituju dalam seluruh kebutuhan. kepadaNya mereka meminta apa yang mereka perlukan dan keadaNya mereka bergantung pada apa yang mereka inginkan, karena Dia Maha Sempurna dalam sifat-sifatNya, Maha Mengetahui Yang sempurna ilmuNya, Maha Penyantun yang sempurna SantunNya, Maha Penyayang yang sempurna rahmatNya, yang meliputi segala sesuatu dan seperti itulah seluruh sifat-sifatNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ اللَّهُ الصَّمَدُ } \"Allah\" adalah nama Allah yang paling tinggi dan paling agung ﷻ , berarti : yang hanya kepada-Nya segala sembahan dan peribadatan oleh makhluk-Nya. Dialah ﷻ yang berhak disembah, dan barangsiapa yang menyembah dan beribadah kepada selain-Nya adalah suatu kebathilan yang besar, { الصَّمَدُ } Dialah penguasa tunggal tempat menyandarkan segala kesulitan dan kebutuhan. { الصَّمَدُ } Imam Ibnu Jarir ath-Thabari dalam tafsir beliau meriwayatkan ucapan shahabat yang mulia Abdullah bin ‘Abbas radhiyallahu ‘anhuma yang berkata: “Ash-Shamad adalah penguasa yang maha sempurna kekuasaan-Nya, maha mulia yang sempurna kemuliaan-Nya, maha agung yang sempurna keagungan-Nya, maha penyantun yang sempurna sifat penyantun-Nya, maha kaya yang sempurna kekayaan-Nya, maha perkasa yang sempurna keperkasaan-Nya, maha mengetahui yang sempurna pengetahuan-Nya, dan maha bijaksana yang sempurna hikmah/kebijaksanaan-Nya, Dialah yang maha sempurna dalam semua bentuk kemuliaan dan kekuasaan, Dialah Allah yang maha suci dan sifat-sifat ini hanyalah pantas (diperuntukkan) bagi-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "اللَّهُ الصَّمَدُ “Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu.” Kalimat tersendiri. اللَّهُ أَحَدٌ “Allah, Yang Maha Esa,” Maknanya: Dialah Allah yang sedang kalian perbincangkan dan kalian tanyakan أَحَد [ahad] maknya: Dia Maha Esa dengan kemuliaan dan keagungan-Nya, tidak ada penyerupa-Nya, tidak ada sekutu bagi-Nya. Dia Maha Esa dengan kemuliaan dan keagungan ‘Azza Wa Jalla. اللَّهُ الصَّمَدُ “Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu.” Kalimat tersendiri. الصَّمَدُ [ash-shamad] Makna yang paling mencakup dengan isi kandungan nama ini adalah bahwa Dia maha sempurna dalam sifat-sifat-Nya, yang mana Dia dibutuhkan oleh semua makhluk-Nya. Telah diriwayatkan dari Ibnu Abbas: ash-shamad adalah yang sempurna ilmunya, yang sempurna kelembutannya, yang maha semprna kemuliaan-Nya dan yang sempurna kuasa-Nya… hingga akhir yang disebutkan dalam atsar ini. Ini berarti bahwa Allah tidak membutuhkna semua makhluk-makhluknya, Karena Dia sempurna. Telah datang juga penjelasan bahwa ash-shomad adalah tempat bergantung makhluk-makhluk dalam memenuhi kebutuhan-kebutuhan mereka. Ini berarti semua makhluk membutuhkan Allah. Dengan ini disimpulkan bahwa definisi yang paling merangkum makna shamad adalah: Yang sempurna dalam sifat-sifat-Nya yang mana semua makhluk-makhluk membutuhkan kepada-Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ikhlas ayat 2: Allah memerintahkan agara Nabi ﷺ berkata kepada manusia : Sesungguhnya Allah Maha Esa, yang wajib bagi diri-Nya untuk memenuhi kebutuhan-kebutuhan makluknya karena Ia Al Qadir (Yang Maha Mampu) atas segala kondisi manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang dituju dalam semua kebutuhan. Oleh karena itu, makhluk yang berada di bawah maupun di atas semuanya membutuhkan-Nya, meminta dan berharap kepada-Nya untuk dipenuhi kebutuhan mereka, karena Dia sempurna dalam sifat-sifat-Nya; Dia Maha Mengetahui yang sempurna ilmunya, Dia Mahasantun yang sempurna santunnya, Dia Maha Penyayang yang sempurna sayangnya dimana rahmat-Nya meliputi segala sesuatu, demikian pula sifat-sifat-Nya yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ikhlas Ayat 2",
    "description": "Allah tempat meminta segala sesuatu. Dia maha pencipta, mahakaya, dan mahakuasa. Dia tidak memerlukan yang lain, sedangkan semua makhluk bergantung kepada-Nya. 3. Dia tidak beranak; tidak ada yang sejenis dengan Allah sehingga bisa menikah dengan-Nya dan melahirkan anak; dan dia tidak pula diperanakkan karena dia kekal dan tidak bermula. Sesatlah orang yahudi yang meyakini 'uzair sebagai putra Allah, orang nasrani yang meyakini nabi isa sebagai putra Allah, dan orang musyrik arab yang meyakini malaikat sebagai putri Allah."
  }
]