[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia tidak punya anak,tidak juga bapak,dan tidak juga istri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Yang tidak melahirkan sesuatu pun dan tidak pula dilahirkan oleh sesuatu, maka Dia -Subḥānahu- tidak mempunyai anak -Mahasuci Allah- dan tidak pula mempunyai bapak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. لَمۡ يَلِدۡ ۙ وَلَمۡ يُوۡلَدۡ (Dia tiada beranak dan tidak pula diperanakkan) Yakni tidak pernah keluar dari-Nya seorang anak atau apapun, sebab tidak ada yang serupa dengan-Nya, dan permulaan dan akhir dari-Nya tidak mungkin berlaku bagi-Nya. sebab yang diperanakkan pasti tidak berwujud sebelum dilahirkan. Maka Allah tidak memiliki bapak untuk dinisbatkan kepada-Nya. Qatadah mengatakan: orang-orang arab yang musyrik berkata: “para malaikat adalah anak-anak perempuan Allah”. Orang-orang Yahudi mengatakan: “Uzair adalah anak Allah.” Dan orang-orang Nasrani berkata: “Isa al-Masih adalah anak Allah.” Maka Allah membantah mereka dengan firman-Nya: لَمۡ يَلِدۡ ۙ وَلَمۡ يُوۡلَد"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ada bantahan terhadap sebagian besar firqoh sesat, yang diketuai oleh yahudi yang mengatakan : uzair adalah anak Allah, dan nashrani yang mengatakan : al-masih adalah anak Allah, dan selain dari mereka yang juga berada dalam kesesatan"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dia tidak melahirkan satupun (anak) dan tidak juga dilahirkan oleh siapapun, karena Dialah Dzat yang Maha Terdahulu, tidak terikat oleh waktu dan tidak diadakan. Dan Dia tidak menciptakan satupun yang menyerupai DzatNya, Sifat-sifatNya dan TindakanNya. Maka tidak ada satupun yang menyamaiNya dan menjadi sekutu bagiNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia tidak beranak dan tidak pula diperanakkan} Dia tidak beranak sehingga menjadi bapak, dan tidak pula diperanakkan sehinga Dia menjadi anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Dan di antara kesempurnaanNya, Dia “tidak beranak dan tiada pula diperanakkan,” karena kesempurnaan kecukupanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ لَمْ يَلِدْ وَلَمْ يُولَدْ } Dijelaskan dalam sebuah hadits tentang sebab turunnya surah ini : Dari Ubai bin Ka’ab, bahwa orang-orang musyrik berkata kepada Rasulullah saw.: “Ceritakan mengenai Tuhanmu kepada kami!” Lantas Allah swt. menurunkan: “Katakanlah: \"Dia-lah Allah, Yang Maha Esa. Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu.” (QS. Al-Ikhlas: 1-2). “Dia tiada beranak dan tiada pula diperanakkan.” (QS. Al-Ikhlas: 3). Karena sesuatu yang dilahirkan pastilah akan mati. Dan yang mati akan mewariskan. Sesungguhnya Allah Ta’ala tidak akan mati dan mewariskan. “dan tidak ada seorangpun yang setara dengan Dia.” (QS. Al-Ikhlas: 4) Tidak ada yang menyerupai-Nya, dan tidak serupa dengan apapun. { لَمْ يَلِدْ } Allah - تعالى - sama sekali tidak memiliki anak, karena sedungguhnya Dia tidak butuh dengan seorang anak, Allah - عز وجل - berfirman : { قَالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ سُبْحَانَهُ ۖ هُوَ الْغَنِيُّ ۖ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ } ( Mereka (orang-orang Yahudi dan Nasrani) berkata: “Allah mempuyai anak”. Maha Suci Allah; Dialah Yang Maha Kaya; kepunyaan-Nya apa yang ada di langit dan apa yang di bumi. ) [ Yunus : 68 ] Allah membantah perkataan orang-orang Yahudi yang menyatakan bahwasanya Allah memiliki anak, karena Allah tidak butuh dengan anak, dan sesungguhnya seorang anak adalah bagian dari seorang ayah, dan orang-orang Yahudi menjadikan dari hamba Allah seorang anak untuk-Nya, akan tetapi sesungguhnya Allah - عز وجل - tidak menyimpan bagian apapun dari diri-Nya pada makhluk-Nya. Dan anak juga merupakan bentuk serupa dari sang ayah walaupun itu tidak begitu sempurna, maka jika Allah - عز وجل - memiliki anak, itu berarti menjadikan selain Allah makhluk yang serupa dengan -Nya, sedangkan Allah tidak satupun yang serupa dengan-Nya ﷻ, oelah karena itu surah ini sebagai batahan untuk pernyataan orang-orang nashrani dan Yahudi yang terlaknat, mereka mengatakan : \"Sesungguhnya Isa Al-masih adalah anak Allah, sedangkan orang-orang musyrik Arab mengatakan : Sesungguhnya para Malaikat adalah anak-anak Allah. Allah tidak melahirkan anak dan tidak pula Dia dilahirkan oleh siapapun, Allah suci dan terbebas dari prasangka kaum musyrikin yang mengatakan bahwasanya Allah memiliki anak, karena Dialah \"Al-Awwal\" yang berarti tidak didahului oleh apapun, dan Dia juga \"Al-Akhir\" berarti yang terakhir, yang tidak ada sesuatu pun setelahnya, { هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ } ( “Dialah al-Awwal (Yang Pertama), al-Akhir (Yang Terakhir), azh-Zhahir (Yang paling Tampak), al-Bathin (Yang paling Tersembunyi) dan Dia Mahatahu atas segala sesuatu.” ) [ Al-Hadid : 4 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لَمْ يَلِدْ “Dia tiada beranak” Karena Dia Jalla wa ‘Alaa tidak ada penyerupa bagi-Nya. Dan anak adalah pecahan (keturunan) dari orang tuanya, dan bagain darinya, sebagaimana Nabsi shallallaahu ‘alaihi wa sallam bersabda tentang Fatimah: إِنَّهَا بِضْعَةٌ مِنِّي “ Ia adalah bagian dari darah dagingku”(1) Dan Allah Jalla wa ‘Alaa, tidak ada penyerupa bagi-Nya. Dan juga anak itu ada untuk memenuhi kebutuhan dunia atu juga untuk menyambung garis keturunan. Sedangkan Allah ‘Azza Wa Jalla tidak membutuhkan hal ini. Oleh karenanya, Dia tidak beranak, karena Dia tidak mempunyai penyerupa, dan karena Dia tidak membutuhkan kepada seorang pun ‘Azza Wa Jalla. Allah telah menjelaskan kemustahilan-Nya beranak juga dalam firman-Nya Ta’ala: أَنَّى يَكُونُ لَهُ وَلَدٌ وَلَمْ تَكُنْ لَهُ صَاحِبَةٌ وَخَلَقَ كُلَّ شَيْءٍ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ “Bagaimana Dia mempunyai anak padahal Dia tidak mempunyai istri. Dia menciptakan segala sesuatu; dan Dia mengetahui segala sesuatu.”(QS. Al-An’aam) Anak membutuhkan perempuan yang melahirkannya. Begitu juga Allah, Dialah pencipta segala sesuatu, maka jika Dia adalah pencipta segalanya, berarti Dia terpisah dan tidak bergabung dengannya. Dan dalam firman-Nya لَمْ يَلِدْ “Tidak beranak” mengandung bantahan kepada tiga kelompok yang menyimpang dari anak-anak Adam. Mereka adalah orang-orang musyrik, yahudi dan nashrani. Karena orang-orang Musyrik menjadikan malaikat-malaikat, hamba-hamba Ar-Rahman sebagai anak-anak permpuan, mereka mengatakan: Sesungguhnya malaikat-malaikat adalah anak-anak perempuan Allah. Yahudi mengatakan ‘Uzair anak Allah. Nasrani mengatakan: Al-Masih (Isa) anak Allah. Maka Allah mendustakan mereka dengan firman-Nya: لَمْ يَلِدْ وَلَمْ يُولَدْ “Dia tiada beranak dan tiada pula diperanakkan,” Karena Allah ‘Azza Wa Jalla adalah al-Awwal yang tidak ada sesuatu apa pun yang mendahului keberadaan-Nya, maka bagaimana mungkin Dia dilahirkan!! (1) Dikeluarkan Bukhari (3714) dan Muslim (2449) dari hadits Miswar Bin Makhramah radhiyallaahu ‘anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ikhlas ayat 3: Allah juga memerintahkan agar mengatakan kepada mereka : Allah Maha Kaya dari kebutuhannya akan anak dan sahabat; Allah tidak memiliki bapak dan ibu serta anak dan istri. Dan Allah tidaklah dilahirkan, karena tidak ada sesuatupun yang mendahului-Nya, (dan) tidak ada sesuatupun sebelumnya"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara kesempurnaan-Nya adalah bahwa Dia tidak beranak dan tidak pula diperanakkan, karena sempurnanya kecukupan-Nya. Allah Subhaanahu wa Ta'aala berfirman: “Dia Pencipta langit dan bumi. bagaimana Dia mempunyai anak padahal Dia tidak mempunyai isteri. Dia menciptakan segala sesuatu; dan Dia mengetahui segala sesuatu.” (Terj. Al Ana’aam: 101)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ikhlas Ayat 3",
    "description": "Dia tidak beranak; tidak ada yang sejenis dengan Allah sehingga bisa menikah dengan-Nya dan melahirkan anak; dan dia tidak pula diperanakkan karena dia kekal dan tidak bermula. Sesatlah orang yahudi yang meyakini 'uzair sebagai putra Allah, orang nasrani yang meyakini nabi isa sebagai putra Allah, dan orang musyrik arab yang meyakini malaikat sebagai putri Allah. 4. Dan tidak ada sesuatu yang setara dengan dia, baik dari segi zat, sifat, maupun tidakan-Nya."
  }
]