[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia tidak punya tandingan dan padanan dari makhluk NYA, tidak dalam nama nama NYA,tidak dalam sifat-sifat NYA, tidak pula dalam perbuatan-perbuatan NYA, maha banyak kebaikan NYA, maha tinggi, dan maha Suci"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan tidak pula ada yang menyamai-Nya dari ciptaan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَلَمۡ يَكُنۡ لَّهٗ كُفُوًا اَحَدٌ (dan tidak ada seorangpun yang setara dengan Dia) Tidak ada yang setara atau menyerupai-Nya, dan tidak pula ada yang memiliki sifat yang sempurna seperti-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dia tidak melahirkan satupun (anak) dan tidak juga dilahirkan oleh siapapun, karena Dialah Dzat yang Maha Terdahulu, tidak terikat oleh waktu dan tidak diadakan. Dan Dia tidak menciptakan satupun yang menyerupai DzatNya, Sifat-sifatNya dan TindakanNya. Maka tidak ada satupun yang menyamaiNya dan menjadi sekutu bagiNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{serta tidak ada sesuatu pun yang setara} serupa {denganNya}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan tidak ada seorang pun yang setara dengan Dia,” baik dalam nama-namaNya, sifat-sifatNya maupun perbuatan-perbuatanNya. Mahasuci dan Mahatinggi Allah. Surat ini mencakup tauhid asma’ dan sifat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan Dia ﷻ tidak punya satupun dari makhluk-Nya yang menyerupai-Nya, apalagi yang melebihi kekuasaan-Nya ﷻ , ayat ini merupakan bantahan bagi golongan \"Al-Musyabbih\" yaitu golongan atau kelompok yang mensamakan Allah dengan makhluk-Nya, sebagaimana surah ini juga menjadi bantahan bagi kelompok \"Al-Mu'aththilah\" yang menafikan dari Allah ﷻ sifat-sifat Nya. { وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ } Dan Dialah Allah ﷻ yang tidak ada satupun yang serupa dengan-Nya, { لَيْسَ كَمِثْلِهِ شَيْءٌ ۖ وَهُوَ السَّمِيعُ الْبَصِيرُ } ( Tidak ada sesuatupun yang serupa dengan Dia, dan Dialah yang Maha Mendengar dan Melihat ) [ As Syura : 11 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَد “dan tidak ada seorang pun yang setara dengan Dia” Maknanya: Tidak ada seorang pun yang sama dalam semua sifat-Nya. Allah SUbhaanahu wa Tala’a meniadakan dari dirinya mempunyai anak, atau Dia dilahirkan, atau memiliki penyerupa. Surat ini memiliki keutamaan yang besar, Nabi shallallaahu ‘alaihi wa sallam bersabda: إِنَّهَا تَعْدِلُ ثُلُثَ الْقُرْآنِ “Sesungguhnya surah ini setara dengan sepertiga al-Qur’an”(1) Tatapi surat ini hanya sekedar setara dengan sepertiga al-quran namun tidak bisa menggantikan posisinya. Surat ini sebanding dengan sepertiga al-Quran tetapi tidak bisa menggantikan kedudukan sepertiga bagian Al-Quran. Buktinya adalah kalau saja seorang insan mengulang surat ini sebanyak tiga kali saat shalat wajib, maka surat ini tidak bisa menggantikan al-Fatihah, padahal seandainya jika ia membacanya tiga kali maka seakan-akan dia membaca seluruh al-Quran, tetapi ini tidak dianggap. Dan jangan dianggap aneh Sesutu yang sebanding dengan yang lain, tapi tidak bisa menggantikan kedudukannya. Lihatlah Nabi ‘alaihissholaatu wassalaam memberitakan bahwa yang mengatakan: لَا اِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، فَكَأَنَّمَا أَعْتَقَ أَرْبَعَةَ أَنْفُسِ مِنْ بَنِي إِسْمَاعِيلَ أَوْ: وَلَدُ اِسْمَاعِيلَ “Laa ilaaha illallaahu wahdahu laa syariika lahu, lahul mulku walahul hamdu wa huwa ‘alaa kulli syai’in qadiir –tidak ada sesembahan yang benar kecuali Allah tidak ada sekutu bagi-Nya. Milik-Nya lah kerajaan dan milik-Nya lah segala pujian, dan Dialah yang Maha kuasa atas segala sesuatu- maka seakan akan ia telah memerdekakan empat jiwa dari keturunan atau anak Ismail”(2) Walau demikian, seandainya ia wajib membayar kafarah berupa seorang budak, lalu ia mengucapkan dzikir ini, itu tidak bisa menggantikan kafarat tersebut. Maka tidaklah mesti sesuatu sebanding dengan yang lainnya, bisa menggantikan kedudukannya. Surat ini senantiasa Rasul ‘alaihissalaatu wassalaam baca pada saat shalat sunnah fajar di rakaat ke dua(3), shalat sunnah maghrib (4) dan dua raka’at thawaf(5) beliau juga membacanya ketika shalat witir (6) karena surat ini dibangun di atas keikhlasan yang sempurna kepada Allah, oleh karenanya disebut dengan surat al-Ikhlas. (1) Dikeluarkan Bukhari (5051) dari hadits Abu Sa’id al-Khudriy radhiyallaahu ‘anhu dan Muslim (811) dari hadits Abud Dardaa radhiyallaahu ‘anhu. (2) Dikeluarkan Muslim (2693) dari hadits Abu Ayub al-Anshariy radhiyallaahu ‘anhu. (3) Dikeluarkan Muslim (726) dari hadits Abu Hurairah radhiyallaahu ‘anhu. (4) Dikeluarkan Tirmidziy (431) dan Ibnu Majah (1166) dari hadits Abdullah Bin Mus’ud radhiyallaahu ‘anhu, Al-Albani mengatakan dalam shahih at-Tirmdziy: Hasan shahih. (5) Dikeluarkan Muslim (1218) dari hadits Jabir radhiyallahu ‘anhu. (6) Dikeluarkan At-Tirmidziy (463) dari hadits ‘Aisyah radhiyallaahui ‘anha dan dinyatakan shahih oleh al-ALbaniy dalam Al-Misykaah (1269)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ikhlas ayat 4: Allah juga memerintahkan agar mengatakan kepada mereka : Allah tidak serupa dan sama dengan apapun; Maha Suci Allah Tuhan seluruh alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dalam nama-Nya, sifat-Nya maupun perbuatan-Nya. Surah yang mulia mengandung tauhid asmaa’ wa shifaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ikhlas Ayat 4",
    "description": "Dan tidak ada sesuatu yang setara dengan dia, baik dari segi zat, sifat, maupun tidakan-Nya. 1. Wahai nabi Muhammad, katakanlah kepada umatmu, 'aku berlindung kepada tuhan yang menguasai subuh, waktu yang membelah kegelapan malam. Allah mahakuasa menyingkirkan segala kejahatan dari hamba-Nya karena semua makhluk berada dalam genggaman-Nya."
  }
]