[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-14. Apabila matahari digulung dan cahayanya lenyap. Dan apabila bintang-bintang berjatuhan dan cahayanya lenyap. Dan apabila gunung-gunung berterbangan diatas permukaan bumi,ia menjadi debu beterbangan. Dan apabila unta-unta bunting dibiarkan dan ditinggalkan. Dan apabila hewan-hewan buas dikumpulkan dan dicampur agar allah melakukan qishas untuk sebagian darinya atas sebagian yang lain. Dan apabila lautan dinyalakan dan ia berubah menjadi api besar yang berkobar. Dan apabila jiwa-jiwa disandingkan dengan padanan dan rekanannya. Dan apabila anak perempuan yang dikubur hidup-hidup ditanya pada hari kiamat untuk menenangkannya dan membuat menangis orang yang mengkuburkannya, “dosa apa yang membuatnya dikubur?” Dan apabila buku catatan amal disodorkan. Dan apabila langit di runtuhkan dan dilenyapkan dari tempatnya. Dan apabila api dinyalakan sehingga ia berkobar. Dan apabila surga yang penuh kenikmatan didekatkan kepada penghuninya,(yaitu orang orang yang bertakwa). Dan apabila semua ini terjadi, setiap jiwa yakin dan melihat apa yang dilakukannya, baik atau buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Apabila matahari telah dihimpun planet-planetnya dan cahayanya telah hilang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-6. Allah memberi peringatan kepada para hamba dari kejadian-kejadian mengerikan yang harus dilewati seluruh makhluk pada hari kiamat, agar mereka bersiap-siap menghadapi hisab dan mendapatkan siksa atau pahala. Hal ini dijelaskan dalam 14 ayat berikut ini: Jika matahari telah redup cahayanya, bintang-bintang telah berjatuhan, gunung-gunung tercabut dan berubah menjadi debu-debu yang berterbangan, unta betina yang hamil tua dilalaikan pemiliknya, hewan-hewan liar yang biasa bersembunyi dari manusia telah keluar dari sarangnya dan berkumpul, dan jika lautan telah dinyalakan dengan api sehingga airnya menjadi lenyap."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِذَا الشَّمْسُ كُوِّرَتْ (Apabila matahari di gulung) Yakni dijadikan berbentuk bundar yang kemudian dilempar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-3 . Suatu ketika dalam sebuah majelis, seorang qori' membacakan ayat-ayat ini, dan dalam majelis itu hadir bersama mereka Abu wafa' ibnu 'aqil, maka seseorang bertanya kepadanya : setelah Allah membangkitkan manusia untuk menghadapi hari pembalsan, kemudian Allah memasangkan setiap jiwa kepada taqdirnya masing dengan pahala ataupun azab, lalu untuk apa Allah menghancurkan bangunan-bangunan di bumi dan gunung-gunung diterbangkan, dan bumi pun dihancurkan, langit di belah, bintang-bintang, matahari, dan bulan di tabrakkan satu sama lain ? Ibnu 'aqil kemudian menjawab : sesungguhnya Allah membangunkan bagi hamba-Nya bangunan-bangunan hanya untuk mereka tempati untuk beristirahat dan bersenang-senang, dan Allah juga menjadikan apa-apa yang yang ada didunia ini agar mereka mengambil dari pelajaran dan agar mereka bertafakkur tentangnya, agar mereka menjadikan ciptaan Allah ini sebagai perantara untuk mendekatkan diri kepada Allah, maka tatkala ketika masa tinggal itu telah berakhir waktunya Allah kemudian menghancurkan dunia ini, untuk mereka berpindah kepada alam lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Imam Ahmad, Trimidzi, dan Hakim dari Ibnu Umar, berkata: Rasul SAW bersabda: “Barang siapa yang senang memperhatikan berbagai peristiwa yang akan terjadi pada hari kiamat, hendaknya dia membaca ayat “idza asy-syamsu kuwwirat, dan idza as-samaau infatharat, dan idza as-samaau insyaqqat. 1. Apabila matahari telah digulung dan dilipat sinar dan cahayanya. Inilah peristiwa ke-12 dari rentetan peristiwa hari kiamat pada tiupan sangkakala pertama sampai peristiwa perhitungan dan keputusan pembalasan yang akan terjadi setelah tiupan sangkakala kedua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila matahari digulung} digulung dan lenyap cahayanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-14 Maknanya, bila hal-hal besar ini terjadi, manusia akan menjadi jelas perbedaannya (satu sama lain). Masing-masing mengetahui perbuatannya yang telah dilakukan untuk Hari Akhirat serta segala yang dilakukan, baik dan buruknya. Karena ketika Hari Kiamat terjadi, matahari digulung, rembulan dipadamkan cahayanya dan keduanya dlemparkan ke neraka. “Dan apabila bintang-bintang berjatuhan,” yakni berubah dan berguguran dari garis edarnya. “Dan apabila gunung-gunung dihancurkan,” yakni berubah menjadi tumpukan pasir yang beterbangan lalu berubah seperti kapas yang berhamburan lalu berubah kemudian menjadi debu beterbangan dan dilenyapkan dari tempatnya. “Dan apabila unta-unta yang bunting ditinggalkan (tidak diperdulikan),” artinya, pada hari itu manusia tidak lagi memperdulikan harta-harta mereka yang berharga yang dulunya mereka pedulikan dan mereka jaga setiap waktu. Lalu datanglah kengerian yang membuat mereka melalaikannya. Allah mengingatkan dengan unta-unta bunting yang merupakan harta paling berharga bagi bangsa Arab kala itu, tapi maknanya berlaku untuk semua barang yang berharga. “Dan apabila binatang-binatang liar dikumpulkan,” yakni dikumpulkan pada Hari Kiamat agar Allah menghukumi satu sama lain dan semua manusia mengetahui sempurnanya keadilan Allah hingga ia menghukum qishash pada kambing bertanduk untuk kambing yang tidak bertanduk seraya dikatakan padanya,. “Jadilah dabu” “Dan apabila lautan dipanaskan,” yaitu dinyalakan sehingga saking besarnya api yang dinyalakan. “Dan apabila ruh-ruh dipertemukan (dengan tubuh),” yakni setiap jiwa yang berbuat disandingkan pada padanannya; yang baik dipertemukan dangan yang baik dan yang keji dipertemukan dengan yang keji. Orang-orang yang beriman dinikahkan dengan bidadari bermata jeli sedangkan orang-orang kafir dinikahkan dengan setan-setan. Hal ini seperti yang disebutkan dalam Firman Allah, “Orang-orang kafir dibawa ke Neraka Jahanam bergerombol-gerombol.” (Az-Zumar:71) “Dan orang-orang yang bertakwa dibawa ke surga bergerombol-gerombol.” (Az-Zumar:73). “Kumpulkanlah orang-orang zhalim dan istri-istri mereka.” (Ash-Shaffat:22). “dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya,” tentang apa yang pernah dilakukan oleh orang-orang jahiliah dengan mengubur hidup-hidup anak perempuan tanpa sebab, hanya karena takut melarat. Ia ditanya , “karena dosa apakah dia dibunuh,” dan sebagaimana diketahui, ia tidak memiliki dosa apapun. Dalam ayat ini terdapat celaan bagi orang yang membunuhnya. “dan apabila catatan-catatan (amal perbuatan manusia),” yang mencakup semua pekerjaan yang dilakukan orang, baik dan buruknya “dibuka,” dan dibagikan untuk pemiliknya. Ada yang mengambil catatan amalnya dengan tangan kanan, ada yang mengambil dengan tangan kiri dan ada juga yang mengambil dari belakang punggung. “Dan apabila langit dilenyapkan,” yaitu diilenyapkan sebagaimana disebutkan dalam firman Allah yang lain “dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut dan diturunkanlah malaikat bergelombang-gelombang.” (Al-Furqon:25). “Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya padahal bumi seluruhnya dalam genggamannya pada hari kiamat dan langit digulung dengan tangan kananNya. Maha Suci Dia dan Maha Tinggi Dia dari apa yang mereka persekutukan.” (Az-Zumar:67). “Dan apabila Neraka Jahim dinyalakan,” yakni dinyalakan hingga berkobar hebat tidak seperti sedia kala. “Dan apabila surga didekatkan,” yakni didekatkan pada orang-orang yang bertakwa. “maka tiap-tiap jiwa akan mengetahui,” yaitu masing-masing jiwa karena disebutkan dalam konteks syarat, seperti yang disebutkan dalam Firman Allah, “Dan mereka menemukan apa yang mereka perbuat hadir.” (Al-Kahfi:49). Sifat-sifat Hari Kiamat yang disebutkan oleh Allah di atas adalah termasuk sifat-sifat yang menggetarkan jiwa dan semakin memperbesar musibah, membuat badan menggigil, menyebarkan rasa takut, dan mendorong orang-orang yang berakal agar mempersiapkan diri menghadapi hari itu serta melarang mereka melakukan segala sesuatu yang mengundang celaan. Karena itu ada orang salaf berkata, “barangsiapa yang ingin mempersiapkan diri untuk Hari Kiamat, seolah-olah ia telah melihatnya dengan mata kepala, hendaklah merenungkan ayat, “dan apabila matahari digulung.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada surah ini ( التكوير ), dan surah setelahnya ( الانفطار ) dan surah ( النشقاق ), ketiga surah ini menggambarkan bagaimana keadaan dan apa saja yang terjadi ketika kiamat itu terjadi yang menampakkan berebagai kengerian yang hebat. Oleh karena itu berkata sebagian ulama salaf : Barangsiapa yang ingin melihat peristiwa hari kiamat yang seakan-akan dia melihatnya dengan nyata, maka hendaknya ia membaca surah ( التكوير ) dan surah ( الانفطار ). Allah berfirman : { إِذَا الشَّمْسُ كُوِّرَتْ } Apabila matahari itu digulung, seperti seseorang menggulung kain sorban, maka cahaya akan sirna dan kemudian dilemparkan. dan sebagian ulama menafsirkan : apabila matahari itu cahaya di hentikan, dan sebagian lainnya menafsirkan : apabila matahari itu dilemparkan dan dihempaskan. Dan jika penafsiran yang berbeda diatas dikumpulkan maka makanya yang tepat adalah : Matahari itu digulung kemudian cahaya sirna kemudian dilemparkan dan dihempaskan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذَا الشَّمْسُ كُوِّرَتْ “Apabila matahari digulung,” Ini terjadi pada hari kiamat. At-Takwiir: Mengumpulkan sesuatu sebagiannya dengan sebagian lainnya, dan menggulungnya sebagaimana digulungnya sorban di kepala. Matahari adalah gumpalan api sangat besar, luas yang pada hari kiamat nanti Allah ‘Azza Wa Jalla akan kumpulkan sehingga akan tergulung semua, terlipat seluruh bagiannya, sehingga cahayanya pun akan hilang. Dan Allah ‘Azza wa Jalla akan melemparkannya ke neraka, menunjukkan kemurkaan kepada orang-orang yang menyembahnya selain Allah, Allah Tabaaraka wa Ta’ala berfirman: أَنْتُمْ لَهَا وَارِدُونَ “kamu pasti masuk ke dalamnya. ” (QS. Al-Anbiya: 98) terkecuali orang-orang yang disembah selain Allah yang termasuk wali-wali Allah, maka mereka tidak dilemparkan ke neraka, sebagai mana Allah Ta’ala berfirman setelah ayat tadi: إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنَى أُولَئِكَ عَنْهَا مُبْعَدُونَ (101) لَا يَسْمَعُونَ حَسِيسَهَا وَهُمْ فِي مَا اشْتَهَتْ أَنْفُسُهُمْ خَالِدُونَ “Bahwasanya orang-orang yang telah ada untuk mereka ketetapan yang baik dari Kami, mereka itu dijauhkan dari neraka, mereka tidak mendengar sedikit pun suara api neraka, dan mereka kekal dalam menikmati apa yang diingini oleh mereka. ” (QS. Al-Anbiya: 101-102)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 1: 1-13. (Dalam permulaan surat ini) Allah memulai dengan banyak sumpah, di mana Allah bersumpah dengan matahari apabila digulung seperti bola yang terang sinarnya, dan dikeluarkan dari peredarannya, kemudian dilemparkannya (matahari tersebut) ke dalam neraka. Allah juga bersumpah dengan bintang-bintang apabila jatuh dan berhamburan serta menyebar (menuju bumi). Allah juga bersumpah dengan gunung-gunung yang tercabut dari bumi dan berpisah dari tempatnya, remuk lebur, menyebar di udara (bagaikan) debu. Allah juga bersumpah dengan unta betina yang hamil dan tidak peduli dengan janinnya. Allah juga bersumpah dengan binatang-binatang liar yang jika dikumpulkan maka biantang-binatang tersebut kebingungan karena kengerian yang membuat panik, yang menimpa satu sama lain dari binatang tersebut. Dan Allah juga bersumpah dengan lautan yang meluap dari panas api. Allah juga bersumpah dengan diri-diri yang dipertemukan (ketika ruh dan jasad menyatu), maka dikumpulkan antara manusia-manusia yang selamat dengan yang selamat, begitu juga ahli maksiat dengan ahli maksiat. Dan Allah bersumpah terhadap orang-orang yang beriman dimana mereka telah berpasangan dengan bidadari surga. Dan Allah bersumpah terhadap bayi-bayi perempuan yang ketika ditanya dengan sebab apa dia dibunuh, maka ia akan menjawab : Bahwasanya ia dibunuh dengan tanpa sebab (dosa) akan tetapi maksud (pembunuhannya) adalah karena sebab aib dan malu (memiliki anak perempuan). Allah juga bersumpah dengan lembaran-lembaran amal diterbangkan agar sampai kepada pemiliknya di saat hari pembalasan hingga mereka tidak percaya akan hal itu; Orang-orang yang beriman akan menerima dengan tangan kanannya dan orang-orang yang kafir akan menerima dengan tangan kirinya. Allah juga bersumpah dengan langit yang terbelah, sebagaimana terbelahnya kulit hewan yang disembelih dan jadilah semisal dengan muhl (yaitu terbelah dan terdapat luluhan yang mendidih). Allah juga bersumpah dengan neraka yang dinyalakan, dihidupkan, dan dibakar. Allah juga bersumpah dengan surga yang didekatkan bagi hamba Allah yang shalih, atau didekatkan untuk turun kepada mereka (orang-orang shalih)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksud ayat ini dan setelahnya adalah, apabila terjadi peristiwa-peristiwa yang menegangkan ini, yaitu pada hari Kiamat, maka manusia akan terbedakan, masing-masing mengetahui amal yang telah dilakukannya selama di dunia, baik atau buruk. Yakni digabung dan dilipat serta diredupkan cahayanya. Demikian pula bulan, ia akan diredupkan cahayanya, kemudian keduanya (matahari dan bulan) dijatuhkan ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 1",
    "description": "1-7. Allah mengawali surah ini dengan menyebutkan dua belas peristiwa besar yang akan terjadi pada hari kiama ' disebutkan dari ayat 1 s. D. 13. Apabila matahari yang demikian besar digulung dengan mudah seperti halnya serban, hingga cahayanya memudar dan redup. Dan apabila bintang-bintang yang begitu banyak dan menghiasi cakrawala berjatuhan, tidak berada di garis edarnya lagi akibat hilangnya gaya tarikmenarik antar-benda langit. Dan apabila gunung-gunung yang demikian tegar dan kukuh dihancurkan hingga luluh lantak menjadi pasir, kemudian diempaskan oleh angin dahsyat dengan mudahnya seperti gumpalan kapas raksasa yang beterbangan. Dan apabila unta-unta yang bunting dan menjadi harta yang dibanggakan ditinggalkan begitu saja dan tidak lagi dipedulikan dan diurus oleh pemiliknya. Hal ini mengisyaratkan betapa besar kebingungan yang meliputi manusia saat kiamat tiba. Dan apabila binatang-binatang liar dikumpulkan untuk diberi balasan bila berbuat aniaya kepada sesamanya. Binatang liar yang saling memusuhi saat itu bisa dikumpulkan menjadi satu dalam suasanya yang sangat menegangkan. Dan apabila lautan dipanaskan dan dijadikan meluap. Air laut memanas akibat munculnya kobaran api mahadahsyat dari dasarnya. Dan apabila roh-roh dipertemukan dengan tubuh sehingga manusia hidup kembali dalam suasana yang sama sekali berbeda dari kehidupan dunia. Manusia saat itu bergabung dengan manusia lain yang senasib; penaat bersama penaat, begitupun sebaliknya"
  }
]