[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-14. Apabila matahari digulung dan cahayanya lenyap. Dan apabila bintang-bintang berjatuhan dan cahayanya lenyap. Dan apabila gunung-gunung berterbangan diatas permukaan bumi,ia menjadi debu beterbangan. Dan apabila unta-unta bunting dibiarkan dan ditinggalkan. Dan apabila hewan-hewan buas dikumpulkan dan dicampur agar allah melakukan qishas untuk sebagian darinya atas sebagian yang lain. Dan apabila lautan dinyalakan dan ia berubah menjadi api besar yang berkobar. Dan apabila jiwa-jiwa disandingkan dengan padanan dan rekanannya. Dan apabila anak perempuan yang dikubur hidup-hidup ditanya pada hari kiamat untuk menenangkannya dan membuat menangis orang yang mengkuburkannya, “dosa apa yang membuatnya dikubur?” Dan apabila buku catatan amal disodorkan. Dan apabila langit di runtuhkan dan dilenyapkan dari tempatnya. Dan apabila api dinyalakan sehingga ia berkobar. Dan apabila surga yang penuh kenikmatan didekatkan kepada penghuninya,(yaitu orang orang yang bertakwa). Dan apabila semua ini terjadi, setiap jiwa yakin dan melihat apa yang dilakukannya, baik atau buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan jika lembaran catatan amal para hamba telah dibuka, agar masing-masing bisa membaca catatan amal perbuatannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَإِذَا الصُّحُفُ نُشِرَتْ (dan apabila catatan-catatan (amal perbuatan manusia) dibuka) Yakni kitab-kitab amal perbuatan yang disebarkan untuk dilakukan hisab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10-11. Apabila lembaran catatan perbuatan dibuka lebar-lebar. Apabila langit telah dilenyapkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila lembaran-lembaran} lembaran amal {telah dibuka lebar} dibuka dan ditampakkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-14 Maknanya, bila hal-hal besar ini terjadi, manusia akan menjadi jelas perbedaannya (satu sama lain). Masing-masing mengetahui perbuatannya yang telah dilakukan untuk Hari Akhirat serta segala yang dilakukan, baik dan buruknya. Karena ketika Hari Kiamat terjadi, matahari digulung, rembulan dipadamkan cahayanya dan keduanya dlemparkan ke neraka. “Dan apabila bintang-bintang berjatuhan,” yakni berubah dan berguguran dari garis edarnya. “Dan apabila gunung-gunung dihancurkan,” yakni berubah menjadi tumpukan pasir yang beterbangan lalu berubah seperti kapas yang berhamburan lalu berubah kemudian menjadi debu beterbangan dan dilenyapkan dari tempatnya. “Dan apabila unta-unta yang bunting ditinggalkan (tidak diperdulikan),” artinya, pada hari itu manusia tidak lagi memperdulikan harta-harta mereka yang berharga yang dulunya mereka pedulikan dan mereka jaga setiap waktu. Lalu datanglah kengerian yang membuat mereka melalaikannya. Allah mengingatkan dengan unta-unta bunting yang merupakan harta paling berharga bagi bangsa Arab kala itu, tapi maknanya berlaku untuk semua barang yang berharga. “Dan apabila binatang-binatang liar dikumpulkan,” yakni dikumpulkan pada Hari Kiamat agar Allah menghukumi satu sama lain dan semua manusia mengetahui sempurnanya keadilan Allah hingga ia menghukum qishash pada kambing bertanduk untuk kambing yang tidak bertanduk seraya dikatakan padanya,. “Jadilah dabu” “Dan apabila lautan dipanaskan,” yaitu dinyalakan sehingga saking besarnya api yang dinyalakan. “Dan apabila ruh-ruh dipertemukan (dengan tubuh),” yakni setiap jiwa yang berbuat disandingkan pada padanannya; yang baik dipertemukan dangan yang baik dan yang keji dipertemukan dengan yang keji. Orang-orang yang beriman dinikahkan dengan bidadari bermata jeli sedangkan orang-orang kafir dinikahkan dengan setan-setan. Hal ini seperti yang disebutkan dalam Firman Allah, “Orang-orang kafir dibawa ke Neraka Jahanam bergerombol-gerombol.” (Az-Zumar:71) “Dan orang-orang yang bertakwa dibawa ke surga bergerombol-gerombol.” (Az-Zumar:73). “Kumpulkanlah orang-orang zhalim dan istri-istri mereka.” (Ash-Shaffat:22). “dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya,” tentang apa yang pernah dilakukan oleh orang-orang jahiliah dengan mengubur hidup-hidup anak perempuan tanpa sebab, hanya karena takut melarat. Ia ditanya , “karena dosa apakah dia dibunuh,” dan sebagaimana diketahui, ia tidak memiliki dosa apapun. Dalam ayat ini terdapat celaan bagi orang yang membunuhnya. “dan apabila catatan-catatan (amal perbuatan manusia),” yang mencakup semua pekerjaan yang dilakukan orang, baik dan buruknya “dibuka,” dan dibagikan untuk pemiliknya. Ada yang mengambil catatan amalnya dengan tangan kanan, ada yang mengambil dengan tangan kiri dan ada juga yang mengambil dari belakang punggung. “Dan apabila langit dilenyapkan,” yaitu diilenyapkan sebagaimana disebutkan dalam firman Allah yang lain “dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut dan diturunkanlah malaikat bergelombang-gelombang.” (Al-Furqon:25). “Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya padahal bumi seluruhnya dalam genggamannya pada hari kiamat dan langit digulung dengan tangan kananNya. Maha Suci Dia dan Maha Tinggi Dia dari apa yang mereka persekutukan.” (Az-Zumar:67). “Dan apabila Neraka Jahim dinyalakan,” yakni dinyalakan hingga berkobar hebat tidak seperti sedia kala. “Dan apabila surga didekatkan,” yakni didekatkan pada orang-orang yang bertakwa. “maka tiap-tiap jiwa akan mengetahui,” yaitu masing-masing jiwa karena disebutkan dalam konteks syarat, seperti yang disebutkan dalam Firman Allah, “Dan mereka menemukan apa yang mereka perbuat hadir.” (Al-Kahfi:49). Sifat-sifat Hari Kiamat yang disebutkan oleh Allah di atas adalah termasuk sifat-sifat yang menggetarkan jiwa dan semakin memperbesar musibah, membuat badan menggigil, menyebarkan rasa takut, dan mendorong orang-orang yang berakal agar mempersiapkan diri menghadapi hari itu serta melarang mereka melakukan segala sesuatu yang mengundang celaan. Karena itu ada orang salaf berkata, “barangsiapa yang ingin mempersiapkan diri untuk Hari Kiamat, seolah-olah ia telah melihatnya dengan mata kepala, hendaklah merenungkan ayat, “dan apabila matahari digulung.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِذَا الصُّحُفُ نُشِرَتْ } Dan apabila catatan amal perbuatan manusia dibagikan, segala sesuatu yang diperbuat oleh tubuh manusia tercatat dalam lembaran khusus, catatan itu ditulis oleh Malaikat yang terpercaya, dan pada hari kiamat catatan itu akan diperihatkan kepada pemiliknya, entah mereka akan menerimanya dengan tangan kanan atau tangan kiri, kemudian dikatakan kepada mereka : { اقْرَأْ كِتَابَكَ كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا } ( “Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu”.) [ Al Isra : 14 ] , dan ketika orang mukmin pun bahagia dengan diterimanya lembaran amalan mereka dan mereka berkata : { هَاؤُمُ اقْرَءُوا كِتَابِيَهْ } ( “Ambillah, bacalah kitabku (ini)”. ) [ Al Haqqoh : 19 ] mereka pun menyampaikannya kepada orang-orang karena bahagia, sedangkan mereka yang celaka akan berkata ketika catatan amalan mereka terima : { يَا لَيْتَنِي لَمْ أُوتَ كِتَابِيَهْ , وَلَمْ أَدْرِ مَا حِسَابِيَه , مَا أَغْنَىٰ عَنِّي مَالِيَهْ ۜ } ( “Wahai alangkah baiknya kiranya tidak diberikan kepadaku kitabku (ini) , Dan aku tidak mengetahui apa hisab terhadap diriku , Wahai kiranya kematian itulah yang menyelesaikan segala sesuatu ) [ Al Haqqoh : 25 - 27 ] , orang-orang celaka tidak menginginkan kitab mereka disodorkan kepada mereka, akan tetapi lembaran catatan amalan itu sudah menjadi ketentuan Allah dan akan diserahkan kepada setiap pemiliknya, Allah berfirman : { وَكُلَّ إِنْسَانٍ أَلْزَمْنَاهُ طَائِرَهُ فِي عُنُقِهِ ۖ وَنُخْرِجُ لَهُ يَوْمَ الْقِيَامَةِ كِتَابًا يَلْقَاهُ مَنْشُورًا , اقْرَأْ كِتَابَكَ كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا } [ Al Isra' : 13-14 ] setiap orang akan membaca catatan amalannya walaupun ketika didunia ia tidak dapat membaca, Allah berfirman : { وَوُضِعَ الْكِتَابُ فَتَرَى الْمُجْرِمِينَ مُشْفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَا وَيْلَتَنَا مَالِ هَٰذَا الْكِتَابِ لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا ۚ وَوَجَدُوا مَا عَمِلُوا حَاضِرًا ۗ وَلَا يَظْلِمُ رَبُّكَ أَحَدًا } ( Dan diletakkanlah kitab, lalu kamu akan melihat orang-orang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata: “Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang juapun”. ) [ Al Kahfi : 49 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا الصُّحُفُ نُشِرَتْ “dan apabila catatan-catatan (amal perbuatan manusia) dibuka,” الصُّحُفُ [Ash-Shuhuf] jamak untuk kata صَحِيْفَة [Shahiifah] yang berarti tempat ditulisnya perbuatan-perbuatan manusia. Ketahuilah wahai insan, bahwa segala tindakan yang kamu lakukan berupa ucapan atau perbuatan semua itu ditulis dan direkam dalam catatan-catatan yang dipegang oleh malaikat-malaikat yang amanat, mulia yang menulisnya, mereka tahu segala perbuatan kalian, segala sesuatu yang kamu perbuat terekam hingga nantinya akan dibalas di hari kiamat. Sesungguhnya Allah ‘Azza Wa Jalla mengatakan dalam kitab-Nya: وَكُلَّ إِنْسَانٍ أَلْزَمْنَاهُ طَائِرَهُ فِي عُنُقِهِ “Dan tiap-tiap manusia itu telah Kami tetapkan kalungnya pada lehernya. ” Yakni: amal perbuatannya di lehernya وَنُخْرِجُ لَهُ يَوْمَ الْقِيَامَةِ كِتَابًا يَلْقَاهُ مَنْشُورًا “Dan Kami keluarkan baginya pada hari kiamat sebuah kitab yang dijumpainya terbuka.” terbuaka. اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا “Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.” (QS. Al-Israa: 14) Ucapan kita sekarang, yang kita bicarakan ini ditulis, ucapan sebagian kalian dengan yang lain ditulis, semua ucapan ditulis: مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ “Tiada suatu ucapan pun yang diucapkannya melainkan ada di dekatnya malaikat pengawas yang selalu hadir.”(QS. Qaf: 18) Oleh karenanya, Nabi shallallaahu ‘alaihi wa sallam bersabda: مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيْهِ “ Di antara wujud baiknya keislaman seseorang adalah meninggalkan sesuatu yang tidak pantas baginya ”(1) Beliau juga bersabda: مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ “ Barang siapa yang beriman kepada Allah dan hari akhir maka berkatalah yang baik atau diam ”(2) kerena segala sesuatu akan ditulis, dan barang siapa yang banyak bicara maka ia akan sering terjatuh, yakni orang yang sering berbicara maka ia akan banyak terjatuh dan keliru. Maka jagalah lisanmu, kerena catatan-catatan akan tertulis didalamnya segala yang anda ucapkan dan akan dibukakan untukmu di hari kiamat kelak. (1) dikeluarkan Tirmidzi (2317) Ibnu Majah (3976) dari hadits Abu Hurairah radhiyallaahu anhu dinyatakan shahih oleh al-Albaniy dalam shahihuljaami' (5911) (2) Dikeluarkan Bukhari (6018) dan Muslim (47) dari hadits Abu Hurairah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 10: 1-13. (Dalam permulaan surat ini) Allah memulai dengan banyak sumpah, di mana Allah bersumpah dengan matahari apabila digulung seperti bola yang terang sinarnya, dan dikeluarkan dari peredarannya, kemudian dilemparkannya (matahari tersebut) ke dalam neraka. Allah juga bersumpah dengan bintang-bintang apabila jatuh dan berhamburan serta menyebar (menuju bumi). Allah juga bersumpah dengan gunung-gunung yang tercabut dari bumi dan berpisah dari tempatnya, remuk lebur, menyebar di udara (bagaikan) debu. Allah juga bersumpah dengan unta betina yang hamil dan tidak peduli dengan janinnya. Allah juga bersumpah dengan binatang-binatang liar yang jika dikumpulkan maka biantang-binatang tersebut kebingungan karena kengerian yang membuat panik, yang menimpa satu sama lain dari binatang tersebut. Dan Allah juga bersumpah dengan lautan yang meluap dari panas api. Allah juga bersumpah dengan diri-diri yang dipertemukan (ketika ruh dan jasad menyatu), maka dikumpulkan antara manusia-manusia yang selamat dengan yang selamat, begitu juga ahli maksiat dengan ahli maksiat. Dan Allah bersumpah terhadap orang-orang yang beriman dimana mereka telah berpasangan dengan bidadari surga. Dan Allah bersumpah terhadap bayi-bayi perempuan yang ketika ditanya dengan sebab apa dia dibunuh, maka ia akan menjawab : Bahwasanya ia dibunuh dengan tanpa sebab (dosa) akan tetapi maksud (pembunuhannya) adalah karena sebab aib dan malu (memiliki anak perempuan). Allah juga bersumpah dengan lembaran-lembaran amal diterbangkan agar sampai kepada pemiliknya di saat hari pembalasan hingga mereka tidak percaya akan hal itu; Orang-orang yang beriman akan menerima dengan tangan kanannya dan orang-orang yang kafir akan menerima dengan tangan kirinya. Allah juga bersumpah dengan langit yang terbelah, sebagaimana terbelahnya kulit hewan yang disembelih dan jadilah semisal dengan muhl (yaitu terbelah dan terdapat luluhan yang mendidih). Allah juga bersumpah dengan neraka yang dinyalakan, dihidupkan, dan dibakar. Allah juga bersumpah dengan surga yang didekatkan bagi hamba Allah yang shalih, atau didekatkan untuk turun kepada mereka (orang-orang shalih)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dan dibagikan kepada para pelakunya, maka di antara mereka ada yang mengambil dengan tangan kanannya, ada pula yang mengambil dengan tangan kirinya atau dari belakang punggungnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 10",
    "description": "8-13. Dan apabila bayi-bayi perempuan yang dikubur hidup-hidup tanpa dosa dan kesalahan ditanya, karena dosa apa dia dibunuh. Masyarakat jahiliah merasa malu bila mempunyai anak perempuan karena wanita dianggap tidak mempunyai peran apa-apa dalam kehidupan. Untuk menutup rasa malu, mereka rela mengubur anak-anak perempuannya hidup-hidup. Dan apabila lembaran-lembaran yang berisi catatan perbuatan manusia, yang besar maupun yang kecil, dibuka lebar-lebar. Pada saat itu manusia tidak bisa mengelak dari apa yang telah dia perbuat di dunia. Dia yang menerima catatan amal dengan tangan kanan akan berbahagia. Sebaliknya, mereka yang menerima dengan tangan kiri akan celaka. Dan apabila langit dilenyapkan. Langit yang semula menjadi atap bagi penduduk bumi akan dikelupas layaknya kulit binatang dikelupas dari tubuhnya. Dan apabila neraka jahim dinyalakan dengan suhu panas yang tidak terbayangkan. Neraka itu disediakan bagi mereka yang ingkar kepada Allah. Dan apabila surga dengan segala kenikmatannya didekatkan kepada mereka yang beriman dan beramal saleh"
  }
]