[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-14. Apabila matahari digulung dan cahayanya lenyap. Dan apabila bintang-bintang berjatuhan dan cahayanya lenyap. Dan apabila gunung-gunung berterbangan diatas permukaan bumi,ia menjadi debu beterbangan. Dan apabila unta-unta bunting dibiarkan dan ditinggalkan. Dan apabila hewan-hewan buas dikumpulkan dan dicampur agar allah melakukan qishas untuk sebagian darinya atas sebagian yang lain. Dan apabila lautan dinyalakan dan ia berubah menjadi api besar yang berkobar. Dan apabila jiwa-jiwa disandingkan dengan padanan dan rekanannya. Dan apabila anak perempuan yang dikubur hidup-hidup ditanya pada hari kiamat untuk menenangkannya dan membuat menangis orang yang mengkuburkannya, “dosa apa yang membuatnya dikubur?” Dan apabila buku catatan amal disodorkan. Dan apabila langit di runtuhkan dan dilenyapkan dari tempatnya. Dan apabila api dinyalakan sehingga ia berkobar. Dan apabila surga yang penuh kenikmatan didekatkan kepada penghuninya,(yaitu orang orang yang bertakwa). Dan apabila semua ini terjadi, setiap jiwa yakin dan melihat apa yang dilakukannya, baik atau buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Apabila peristiwa tersebut sudah terjadi, setiap jiwa mengetahui bekal yang telah dilakukannya untuk menghadapi Hari itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. عَلِمَتْ نَفْسٌ مَّآ أَحْضَرَتْ (maka tiap-tiap jiwa akan mengetahui apa yang telah dikerjakannya) Yakni setiap orang mengetahui kebaikan atau keburukan yang telah ia lakukan saat kitab catatan amal telah disebarkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Setiap jiwa akan tahu apapun yang telah mereka perbuat, baik atau buruk. Allah bersumpah dengan bintang-bintang yang tampak diwaktu malam dan hilang di waktu siang karena sinar matahari, untuk meyakinkan kebenaran berita ini. Mereka adalah Zuhal, Musytari, Zuhroh dan Athorid"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{setiap jiwa mengetahui apa yang telah dikerjakannya} apa yang dikerjakan berupa kebaikan maupun keburukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-14 Maknanya, bila hal-hal besar ini terjadi, manusia akan menjadi jelas perbedaannya (satu sama lain). Masing-masing mengetahui perbuatannya yang telah dilakukan untuk Hari Akhirat serta segala yang dilakukan, baik dan buruknya. Karena ketika Hari Kiamat terjadi, matahari digulung, rembulan dipadamkan cahayanya dan keduanya dlemparkan ke neraka. “Dan apabila bintang-bintang berjatuhan,” yakni berubah dan berguguran dari garis edarnya. “Dan apabila gunung-gunung dihancurkan,” yakni berubah menjadi tumpukan pasir yang beterbangan lalu berubah seperti kapas yang berhamburan lalu berubah kemudian menjadi debu beterbangan dan dilenyapkan dari tempatnya. “Dan apabila unta-unta yang bunting ditinggalkan (tidak diperdulikan),” artinya, pada hari itu manusia tidak lagi memperdulikan harta-harta mereka yang berharga yang dulunya mereka pedulikan dan mereka jaga setiap waktu. Lalu datanglah kengerian yang membuat mereka melalaikannya. Allah mengingatkan dengan unta-unta bunting yang merupakan harta paling berharga bagi bangsa Arab kala itu, tapi maknanya berlaku untuk semua barang yang berharga. “Dan apabila binatang-binatang liar dikumpulkan,” yakni dikumpulkan pada Hari Kiamat agar Allah menghukumi satu sama lain dan semua manusia mengetahui sempurnanya keadilan Allah hingga ia menghukum qishash pada kambing bertanduk untuk kambing yang tidak bertanduk seraya dikatakan padanya,. “Jadilah dabu” “Dan apabila lautan dipanaskan,” yaitu dinyalakan sehingga saking besarnya api yang dinyalakan. “Dan apabila ruh-ruh dipertemukan (dengan tubuh),” yakni setiap jiwa yang berbuat disandingkan pada padanannya; yang baik dipertemukan dangan yang baik dan yang keji dipertemukan dengan yang keji. Orang-orang yang beriman dinikahkan dengan bidadari bermata jeli sedangkan orang-orang kafir dinikahkan dengan setan-setan. Hal ini seperti yang disebutkan dalam Firman Allah, “Orang-orang kafir dibawa ke Neraka Jahanam bergerombol-gerombol.” (Az-Zumar:71) “Dan orang-orang yang bertakwa dibawa ke surga bergerombol-gerombol.” (Az-Zumar:73). “Kumpulkanlah orang-orang zhalim dan istri-istri mereka.” (Ash-Shaffat:22). “dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya,” tentang apa yang pernah dilakukan oleh orang-orang jahiliah dengan mengubur hidup-hidup anak perempuan tanpa sebab, hanya karena takut melarat. Ia ditanya , “karena dosa apakah dia dibunuh,” dan sebagaimana diketahui, ia tidak memiliki dosa apapun. Dalam ayat ini terdapat celaan bagi orang yang membunuhnya. “dan apabila catatan-catatan (amal perbuatan manusia),” yang mencakup semua pekerjaan yang dilakukan orang, baik dan buruknya “dibuka,” dan dibagikan untuk pemiliknya. Ada yang mengambil catatan amalnya dengan tangan kanan, ada yang mengambil dengan tangan kiri dan ada juga yang mengambil dari belakang punggung. “Dan apabila langit dilenyapkan,” yaitu diilenyapkan sebagaimana disebutkan dalam firman Allah yang lain “dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut dan diturunkanlah malaikat bergelombang-gelombang.” (Al-Furqon:25). “Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya padahal bumi seluruhnya dalam genggamannya pada hari kiamat dan langit digulung dengan tangan kananNya. Maha Suci Dia dan Maha Tinggi Dia dari apa yang mereka persekutukan.” (Az-Zumar:67). “Dan apabila Neraka Jahim dinyalakan,” yakni dinyalakan hingga berkobar hebat tidak seperti sedia kala. “Dan apabila surga didekatkan,” yakni didekatkan pada orang-orang yang bertakwa. “maka tiap-tiap jiwa akan mengetahui,” yaitu masing-masing jiwa karena disebutkan dalam konteks syarat, seperti yang disebutkan dalam Firman Allah, “Dan mereka menemukan apa yang mereka perbuat hadir.” (Al-Kahfi:49). Sifat-sifat Hari Kiamat yang disebutkan oleh Allah di atas adalah termasuk sifat-sifat yang menggetarkan jiwa dan semakin memperbesar musibah, membuat badan menggigil, menyebarkan rasa takut, dan mendorong orang-orang yang berakal agar mempersiapkan diri menghadapi hari itu serta melarang mereka melakukan segala sesuatu yang mengundang celaan. Karena itu ada orang salaf berkata, “barangsiapa yang ingin mempersiapkan diri untuk Hari Kiamat, seolah-olah ia telah melihatnya dengan mata kepala, hendaklah merenungkan ayat, “dan apabila matahari digulung.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan jika semua itu terjadi, maka setiap jiwa akan mengetahui apa yang telah ia perbuat didunia, baik mauoun buruknya, dan sekali-kali mereka tidak mungkin akan mengingkari dan tidak pula mereka akan menghidar darinya; dan jika lisan mereka mendustakan maka kulit merekalah yang akan menjadi saksi, anggota tubuh lainnya akan bersaksi atas apa yang telah mereka perbuat didunia, amalan yang dilakukan oleh anakn adam tidak akan sia-sia, semuanya akan mendapat balasan ataupun ganjaran."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah Ta’ala berfirman: عَلِمَتْ نَفْسٌ مَا أَحْضَرَتْ “maka tiap-tiap jiwa akan mengetahui apa yang telah dikerjakannya.” Maknanya: Apa apa yang telah ia lakukan berupa kebaikan dan keburukan, sebagaimana Allah Ta’ala berfirman: يَوْمَ تَجِدُ كُلُّ نَفْسٍ مَا عَمِلَتْ مِنْ خَيْرٍ مُحْضَرًا وَمَا عَمِلَتْ مِنْ سُوءٍ “Pada hari ketika tiap-tiap diri mendapati segala kebajikan dihadapkan (dimukanya), begitu (juga) kejahatan yang telah dikerjakannya” Yakni: dihadirkan juga: تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُ أَمَدًا بَعِيدًا وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ “Ia ingin kalau kiranya antara ia dengan hari itu ada masa yang jauh; dan Allah memperingatkan kamu terhadap diri (siksa) Nya. Dan Allah sangat Penyayang kepada hamba-hamba-Nya.” (QS. Ali Imran: 30) pada hari itu setiap jiwa akan tahu apa-apa yang telah ia hadirkan dari kebaikan atau keburukan, di dunia pun kita mengetahui apa apa yang telah kita perbuat berupa kebaikan dan keburukan namun betapa cepatnya kita melipakannya, kita melupakan canyak sesuatu, baik itu ketaatan ketaatan juga kemaksiatan-kemaksiatan, namun itu semua tidak akan pergi begitu saja sebagaimana kita melupakannya begitu saja! Namun demi Allah, itu akan tetap ada, apa bila kiamat tiba, anda akan menghadirkannya dengan mengikrarkan pengakuan bahwa anda yang telah berbuat, oleh karenanya Allah Ta’ala berfirman: عَلِمَتْ نَفْسٌ مَا أَحْضَرَتْ “maka tiap-tiap jiwa akan mengetahui apa yang telah dikerjakannya.” Maka sepantasnya, bahkan wajib atas setiap insan memperhatikan ayat-ayat ini, dan mengambil pelajaran dari pelajaran-pelajaran yang terkandung di dalamnya, dan mengimaninya seakan-akan ia melihatnya dengan mata telanjang, karena segala yang diberitakan Allah, dan kita mengetahui kandungannya, semua itu lebih diyakini kebenarannya bagi kita dari pada apa-apa yang kita saksikan dengan mata-mata kita dan kita dengan dengan telinga kita, karena berita Allah tidak mungkin dusta, pasti benar, sedangkan yang kita lihat atau kita dengan banyak berita yang tidak jelas, terkadang anda melihat sesuatu yang jauh terlihat hantu yang tergamvar dibenak anda, padahal itu tidak sesuai dengan kenyataannya, terkadang anda mendengar suara suara sesuatu yang tergambar di benak padahal kenyataannya tidak sepeti yang anda kira, dugaan yang tidak jelas kebenaran itu terlintas denganpanca indra, tetapi berita dari Allah ‘Azza Wa Jalla, jika sudah diketahui kandungannya tidak mungkin ada ketidak pastian atau ketidak jelasan selamanya. Karena beritanya pasti benar, perkara-perkara yang Allah sebutkan pada ayat-ayat ini adalah perkara hakiki, anda wajib mengimaninya, seakan-akan anda melihatnya dengan mata telanjang. Kemudian setelah mengimaninya wajib bagi anda untuk mengamalkan konsekuensi yang ditunjukkan oleh ayat-ayat ini dengan mengambil pelajaran dan peringatan juga melaksanakan kewajiban, dan meninggalkan larangan-larangan, sehingga anda menjadi ahli al-Quran yang membacanya dengan sebenar-benarnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 14: Kemudian datang (jawaban) sebagai jawaban dari sumpah-sumpah yang telah disebutkan, dimana jika terjadi setiap dari kejadian yang telah disebutkan tadi, maka sungguh setiap jiwa akan merasa sadar (yakin) dan mendapati (balasan) atas apa yang telah lalu dari kebaikan maupun keburukan. Berkata Syaikh Ibnu Utsaimin dalam pelajaran tafsirnya ketika ditanya firman Allah {إِذَا ٱلشَّمْسُ كُوِّرَتْ [٨١:١]} maka syaik menjawab : Sungguh matahari akan didekatkan sejarak satu mil dan hari kiamat kadarnya (lama) waktu dalam seharinya adalah lima puluh ribu tahun. Akan sangat banyak perhentian dan keadaan (pada hari itu); Maka akan berkata, membisu dan dikumpulkan orang-orang mujrim (para pendosa) dengan wajah membiru (muram), kemudian menghitam wajahnya, dan itu adalah waktu yang terkandung didalamnya semua keadaan (yang ada di hari kiamat itu). Ahmad dan Tirmidzi telah mengeluarkan dari Ibnu Umar, berkata Rasulullah ﷺ : Barangsiapa yang ingin melihat rahasia hari kiamat yang seolah-olah melihat dengan mata langsung, maka bacalah إِذَا ٱلشَّمْسُ كُوِّرَتْ, وَإِذَا ٱلنُّجُومُ ٱنكَدَرَتْ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik atau buruk. Peristiwa-peristiwa pada hari Kiamat yang Allah Subhaanahu wa Ta'aala sebutkan ini termasuk peristiwa yang mencemaskan hati, menegangkannya, dan membuat anggota badan merinding ketakutan. Demikian juga mendorong orang-orang yang berakal untuk mempersiapkan diri menghadapi hari itu serta mencegah mereka dari melakukan sesuatu yang mendatangkan celaan. Oleh karena itulah, sebagian kaum salaf berkata, “Barang siapa yang ingin memperhatikan hari Kiamat seakan-akan ia melihatnya secara langsung, maka tadabburilah surah Idzasy syamsu kuwwirat.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 14",
    "description": "Pada saat itulah setiap jiwa akan mengetahui apa yang telah dikerjakannya di dunia, apakah perbuatan baik atau buruk. 15-18. Usai menjelaskan ihwal hari kiamat dan kesudahan manusia, Allah beralih menjelaskan kedudukan Al-Qur'an sebagai kalamullah yang didustakan oleh kafir quraisy. Aku bersumpah demi bintang-bintang yang cahayanya redup di siang hari dan terang di malam hari. Yang beredar di garis edarnya dan terbenam, demi malam apabila telah larut dan meninggalkan gelapnya, atau datang dengan kegelapan yang dibawanya, dan demi subuh apabila fajar telah menyingsing, tersibak cahayanya sedikit demi sedikit, layaknya orang bernafas. Ketiga peristiwa tersebut merupakan tanda-tanda kebesaran Allah di alam semesta yang dapat dilihat. Begitupun, Al-Qur'an merupakan tanda kebesaran-Nya yang dapat dibaca."
  }
]