[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-21. Allah bersumpah dengan bintang-bintang yang cahayanya redup saat siang hari. Yang berjalan dan bersembunyi pada orbit-orbitnya, Juga dengan malam saat datang dengan kegelapannya, Juga dengan waktu shubuh saat datang dengan cahayanya, Sesungguhnya al-qur’an disampaikan oleh utusan yang mulia,yaitu jibril, Pemilik kekuatan dalam melaksankan apa yang diperintahkan kepadanya, pemilik kedudukan tinggi dan mulia di sisi allah, Ditaati oleh para malaikat, dipercaya atas wahyu yang dia bawa turun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah bersumpah dengan bintang-bintang yang tersembunyi sebelum terbit pada malam hari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-22. Ini merupakan sumpah yang ditegaskan demi bintang-bintang yang tidak terlihat pada siang hari yang beredar di porosnya bersama matahari dan bulan yang kemudian menghilang ketika terbenam; demi malam jika telah berlalu; dan demi waktu subuh ketika cahayanya mulai memancar. Sungguh al-Qur’an ini benar-benar risalah yang disampaikan Jibril, malaikat yang sangat kuat, memiliki derajat yang tinggi di sisi Allah, ditaati para malaikat lain yang berada di bawah pimpinannya, dan diberi amanah untuk menyampaikan wahyu tanpa mengkhianatinya. Dan sungguh Nabi Muhammad bukanlah orang gila."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. عَلِمَتْ نَفْسٌ مَّآ أَحْضَرَتْ (maka tiap-tiap jiwa akan mengetahui apa yang telah dikerjakannya) Yakni setiap orang mengetahui kebaikan atau keburukan yang telah ia lakukan saat kitab catatan amal telah disebarkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Setiap jiwa akan tahu apapun yang telah mereka perbuat, baik atau buruk. Allah bersumpah dengan bintang-bintang yang tampak diwaktu malam dan hilang di waktu siang karena sinar matahari, untuk meyakinkan kebenaran berita ini. Mereka adalah Zuhal, Musytari, Zuhroh dan Athorid"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Aku bersumpah} Aku bersumpah, huruf \"Laa\" berguna untuk menegaskan sumpah {demi bintang-bintang} bintang-bintang yang cahayanya dilenyapkan pada siang hari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 15-16 Allah bersumpah dengan “bintang-bintang,” yakni bintang-bintang yang berjalan terlambat dari lintasan biasanya hingga ke arah timur. Itulah tujuh bintang yang berjalan; matahari, rembulan, venus, yupiter, mars, saturnus, dan merkurius. Ketujuh bintang ini memiliki dua putaran: putaran ke arah barat bersama bintang-bintang lain, dan lalu berputar dari arah berlawanan dari arah timur yang hanya ditempuh oleh ketujuh bintang tersebut saja. Allah bersumpah dengannya pada saat terlambat melintas dan saat melintas serta disaat sinarnya terhalang diwaktu siang. Bisa juga yang dimaksudkan adalah seluruh bintang yang beredar dan lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Allah bersumpah dengan bintang-binta yang pada siang hari tidak terlihat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَلَا أُقْسِمُ بِالْخُنَّسِ \" Sungguh, Aku bersumpah dengan bintang-bintang, \" Firman Allah Ta’ala: فَلَا أُقْسِمُ Sebagian orang mengangka bahwa لَا [laa] disini adalah La Nafiyah (yang berarti meniadakan) padahal bukan, yang benar adalah untuk menyatakan ketetapan sumpah, digunakan pada susunan semisal pada ayat ini dalam rangka penegasan, maka maknanya adalah: Saya bersumpah dengan khunnas (bintang-bintang) jamak khanisah, adalah bintang yang kembali, ketika anda melihatnya di atas ufuk langit ternyata dia tiba-tiba sudah kembali akhir ufuk, ini dikarenakan wallaahu a’lam tinggi dan jauhnya ia, sehingga bintang-bintang yang lain lebih cepat beredar jika dilihat pandangan mata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 15: 15-17. Kemudian Allah bersumpah dengan Al Khuns yaitu bintang-bintang yang bersinar yang tertutupi cahaya siang dan akan namapak pada malam hari. Dan Allah bersumpah dengan bintang-bintang yang beredar di peredarannya yang kemudian bersembunyi ketika waktu tenggelamnya matahari. Allah juga bersumpah dengan malam ketika datang dan pergi. Allah juga bersumpah dengan waktu subuh sampai datang waktu siang secara jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa’diy menerangkan, yakni bintang-bintang yang terlambat jalan dengan bintang-bintang lainnya yang biasa menuju arah timur, yaitu bintang-bintang (planet-planet) yang tujuh. Bintang-bintang itu adalah matahari, bulan, Zahrah (venus), Musytariy (Yupiter), Mirrikh (Mars), Zuhal (Saturnus) dan ‘Uthaarid (Merkurius). Tujuh planet ini memiliki dua perjalanan; perjalanan ke arah barat bersama bintang-bintang yang lain, dan perjalanan ke arah kebalikannya dari arah timur yang hanya dilakukan oleh tujuh planet ini. Allah Subhaanahu wa Ta'aala bersumpah dengan keadaannya yang terlambat dan keadaannya ketika berjalan dan dengan keadaannya ketika menghilang dengan adanya siang hari. Bisa juga maksudnya, Allah bersumpah dengan semua bintang yang berjalan dan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 15",
    "description": "15-18. Usai menjelaskan ihwal hari kiamat dan kesudahan manusia, Allah beralih menjelaskan kedudukan Al-Qur'an sebagai kalamullah yang didustakan oleh kafir quraisy. Aku bersumpah demi bintang-bintang yang cahayanya redup di siang hari dan terang di malam hari. Yang beredar di garis edarnya dan terbenam, demi malam apabila telah larut dan meninggalkan gelapnya, atau datang dengan kegelapan yang dibawanya, dan demi subuh apabila fajar telah menyingsing, tersibak cahayanya sedikit demi sedikit, layaknya orang bernafas. Ketiga peristiwa tersebut merupakan tanda-tanda kebesaran Allah di alam semesta yang dapat dilihat. Begitupun, Al-Qur'an merupakan tanda kebesaran-Nya yang dapat dibaca"
  }
]