[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-21. Allah bersumpah dengan bintang-bintang yang cahayanya redup saat siang hari. Yang berjalan dan bersembunyi pada orbit-orbitnya, Juga dengan malam saat datang dengan kegelapannya, Juga dengan waktu shubuh saat datang dengan cahayanya, Sesungguhnya al-qur’an disampaikan oleh utusan yang mulia,yaitu jibril, Pemilik kekuatan dalam melaksankan apa yang diperintahkan kepadanya, pemilik kedudukan tinggi dan mulia di sisi allah, Ditaati oleh para malaikat, dipercaya atas wahyu yang dia bawa turun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Yang beredar di orbitnya dan terbenam saat datangnya pagi, sebagaimana kijang yang masuk ke dalam rumahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. الْجَوَارِ (yang beredar) Yakni beredar di orbitnya. الْكُنَّسِ (dan terbenam) Yakni terbenam pada waktu terbenamnya. Kata ini berasal dari kata (الكناس) yaitu hewan liar seperti rusa dan lainnya yang bersembunyi pada waktu tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Bintang-bintang yang berjalan bersama matahari saat siang, dan tertutupi cahaya matahari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang beredar lagi terbenam} yang beredar dan bersembunyi pada garis edarnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 15-16 Allah bersumpah dengan “bintang-bintang,” yakni bintang-bintang yang berjalan terlambat dari lintasan biasanya hingga ke arah timur. Itulah tujuh bintang yang berjalan; matahari, rembulan, venus, yupiter, mars, saturnus, dan merkurius. Ketujuh bintang ini memiliki dua putaran: putaran ke arah barat bersama bintang-bintang lain, dan lalu berputar dari arah berlawanan dari arah timur yang hanya ditempuh oleh ketujuh bintang tersebut saja. Allah bersumpah dengannya pada saat terlambat melintas dan saat melintas serta disaat sinarnya terhalang diwaktu siang. Bisa juga yang dimaksudkan adalah seluruh bintang yang beredar dan lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu bintang-bintang atau planet-planet yang berputar pada porosnya masing-masing, Allah berfirman : { كُلٌّ فِي فَلَكٍ يَسْبَحُونَ } ( Masing-masing dari keduanya itu beredar di dalam garis edarnya. ) [ Al Anbiya' : 33 ] Allah bersumpah dengan bintang-bintang karena itu adalah merupakan bagian dari ayat-ayat Allah yang agung, dan Allah tidak bersumpah dengan sesuatu apapun melainkan sesuatu itu memiliki kedudukan yang penting dalam kehidupan manusia dan darinya terdapat pelajaran yang penting, Allah berkehendak bersumpah atas makhluknya sesukanya, sedangkan manusia sebagai makhluk Allah tidak diperbolehkan bersumpah kecuali atas nama Allah. { الْكُنَّسِ } Yakni benda-benda angkasa itu pada malam hari nampak jelas, dan pada siang hari bersembunyi tidak menampakkan dirinya, dan ini mencakup semua bintang-bintang dan planet-planet yang ada di angkasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "الْجَوَارِ asalnya adalah الجَوَارِي [al-Jawarii] ada huruf ya di akhir, namun dihapus untuk meringankan lafaz, الْكُنَّسِ Bintang yang masuk ke tempat terbenamnya. Allah bersumpah dengan bintang-bintang ini"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 16: 15-17. Kemudian Allah bersumpah dengan Al Khuns yaitu bintang-bintang yang bersinar yang tertutupi cahaya siang dan akan namapak pada malam hari. Dan Allah bersumpah dengan bintang-bintang yang beredar di peredarannya yang kemudian bersembunyi ketika waktu tenggelamnya matahari. Allah juga bersumpah dengan malam ketika datang dan pergi. Allah juga bersumpah dengan waktu subuh sampai datang waktu siang secara jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 16",
    "description": "15-18. Usai menjelaskan ihwal hari kiamat dan kesudahan manusia, Allah beralih menjelaskan kedudukan Al-Qur'an sebagai kalamullah yang didustakan oleh kafir quraisy. Aku bersumpah demi bintang-bintang yang cahayanya redup di siang hari dan terang di malam hari. Yang beredar di garis edarnya dan terbenam, demi malam apabila telah larut dan meninggalkan gelapnya, atau datang dengan kegelapan yang dibawanya, dan demi subuh apabila fajar telah menyingsing, tersibak cahayanya sedikit demi sedikit, layaknya orang bernafas. Ketiga peristiwa tersebut merupakan tanda-tanda kebesaran Allah di alam semesta yang dapat dilihat. Begitupun, Al-Qur'an merupakan tanda kebesaran-Nya yang dapat dibaca"
  }
]