[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-21. Allah bersumpah dengan bintang-bintang yang cahayanya redup saat siang hari. Yang berjalan dan bersembunyi pada orbit-orbitnya, Juga dengan malam saat datang dengan kegelapannya, Juga dengan waktu shubuh saat datang dengan cahayanya, Sesungguhnya al-qur’an disampaikan oleh utusan yang mulia,yaitu jibril, Pemilik kekuatan dalam melaksankan apa yang diperintahkan kepadanya, pemilik kedudukan tinggi dan mulia di sisi allah, Ditaati oleh para malaikat, dipercaya atas wahyu yang dia bawa turun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan Allah bersumpah dengan awal malam jika datang dan akhir malam ketika pergi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَالَّيْلِ إِذَا عَسْعَسَ (demi malam apabila telah hampir meninggalkan gelapnya) Yakni ketika telah hilang gelapnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17-18. Allah bersumpah atas malam apabila telah gelap atau datang. Itu adalah ungkapan-ungkapan kebalikan. Dan apabila pagi telah datang diliputi dengan sinar cahayanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi malam apabila telah larut} demi malam ketika kegelapannya datang dan pergi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-18 “Dan demi malam apabila telah hampir meninggalkan gelapnya,” ada yang berpendapat apabila datang, dan ada juga yang berpendapat apabila pergi. “dan demi Shubuh apabla fajarnya mulai menyingsing,” yakni nampak tanda-tanda Shubuh kemudian cahaya muncul sedikit demi sedikit hingga sempurna dan matahari terbit."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan Allah juga bersumpah dengan malam, yaitu malam yang berpaling dari kegelapan ketika waktu fajar telah datang, maksud dari sumpah ini adalah mengabarkan bahwa malam juga merupakan ayat-ayat Allah, Allah ﷻ berfirman : { وَآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُمْ مُظْلِمُونَ } ( Dan suatu tanda (kekuasaan Allah yang besar) bagi mereka adalah malam; Kami tanggalkan siang dari malam itu, maka dengan serta merta mereka berada dalam kegelapan. ) [ Yaa Siin : 37 ] pergantian siang dan malalm adalah salah satu ayat Allah ﷻ yang paling agung, dan jika Dia berkehendak maka dia berkuasa menjadikan dunia ini selalu dalam kegelapan malam, dan jika Dia berkeinginan menjadikan dunia ini selalu terang dengan adanya siang hari Dia juga berkuasa melakukannya, Allah ﷻ berfirman : { قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِضِيَاءٍ ۖ أَفَلَا تَسْمَعُونَ , قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ } ( Katakanlah: “Terangkanlah kepadaku, jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar?” , Katakanlah: “Terangkanlah kepadaku, jika Allah menjadikan untukmu siang itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan?” ) [ Al Qashash : 71-72 ] itulah diantara ayat-ayat Allah yang paling agung."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah berfirman: وَاللَّيْلِ إِذَا عَسْعَسَ (17) وَالصُّبْحِ إِذَا تَنَفَّسَ \" demi malam apabila telah hampir meninggalkan gelapnya, dan demi subuh apabila fajarnya mulai menyingsing, \" Ma’na firman-Nya عَسْعَس [‘As’asa] datang ada yang mengatakan juga maknanya pergi, karena kata ‘As-‘asa dalam bahasa Arab dapat bermakna pergi dan datang, namun yang nampak sesuai disini adalah bermakna datang, karena kesesuaiannya dengan sumpah setelahnya, yaitu firman Allah: وَالصُّبْحِ إِذَا تَنَفَّسَ \" dan demi subuh apabila fajarnya mulai menyingsing,\" sehingga Allah bersumpah dengan malam saat tibanya, dan dengan siang saat tibanya juga. Allah Ta’ala bersumpah dengan makhluk-makhluk-Nya karena keagungannya dan karena itu semua adalah di antara tanda-tanda-Nya yang besar. Siapa yang mampu mendatangkan siang jika malam telah tiba?! Siapa yang mampu mendatangkan malam jika siang telah tiba?! Allah ‘Azza Wa Jalla berfirman: قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَى يَوْمِ الْقِيَامَةِ مَنْ إِلَهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِضِيَاءٍ أَفَلَا تَسْمَعُونَ (71) قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَى يَوْمِ الْقِيَامَةِ مَنْ إِلَهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِلَيْلٍ تَسْكُنُونَ فِيهِ أَفَلَا تُبْصِرُونَ (72) وَمِنْ رَحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ “Katakanlah: \"Terangkanlah kepadaku, jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat, siapakah Rabb selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar?\" Katakanlah: \"Terangkanlah kepadaku, jika Allah menjadikan untukmu siang itu terus menerus sampai hari kiamat, siapakah Rabb selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan?\" Dan karena rahmat-Nya, Dia jadikan untukmu malam dan siang, supaya kamu beristirahat pada malam itu dan supaya kamu mencari sebahagian dari karunia-Nya (pada siang hari) dan agar kamu bersyukur kepada-Nya.”(QS. Al-Qashash: 71-73)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 17: 15-17. Kemudian Allah bersumpah dengan Al Khuns yaitu bintang-bintang yang bersinar yang tertutupi cahaya siang dan akan namapak pada malam hari. Dan Allah bersumpah dengan bintang-bintang yang beredar di peredarannya yang kemudian bersembunyi ketika waktu tenggelamnya matahari. Allah juga bersumpah dengan malam ketika datang dan pergi. Allah juga bersumpah dengan waktu subuh sampai datang waktu siang secara jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 17",
    "description": "15-18. Usai menjelaskan ihwal hari kiamat dan kesudahan manusia, Allah beralih menjelaskan kedudukan Al-Qur'an sebagai kalamullah yang didustakan oleh kafir quraisy. Aku bersumpah demi bintang-bintang yang cahayanya redup di siang hari dan terang di malam hari. Yang beredar di garis edarnya dan terbenam, demi malam apabila telah larut dan meninggalkan gelapnya, atau datang dengan kegelapan yang dibawanya, dan demi subuh apabila fajar telah menyingsing, tersibak cahayanya sedikit demi sedikit, layaknya orang bernafas. Ketiga peristiwa tersebut merupakan tanda-tanda kebesaran Allah di alam semesta yang dapat dilihat. Begitupun, Al-Qur'an merupakan tanda kebesaran-Nya yang dapat dibaca"
  }
]