[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-21. Allah bersumpah dengan bintang-bintang yang cahayanya redup saat siang hari. Yang berjalan dan bersembunyi pada orbit-orbitnya, Juga dengan malam saat datang dengan kegelapannya, Juga dengan waktu shubuh saat datang dengan cahayanya, Sesungguhnya al-qur’an disampaikan oleh utusan yang mulia,yaitu jibril, Pemilik kekuatan dalam melaksankan apa yang diperintahkan kepadanya, pemilik kedudukan tinggi dan mulia di sisi allah, Ditaati oleh para malaikat, dipercaya atas wahyu yang dia bawa turun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Sesungguhnya Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- adalah benar-benar firman Allah yang disampaikan oleh malaikat yang memegang amanat, yaitu Jibril -'alaihissalām- yang diberi amanat oleh Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَالصُّبْحِ إِذَا تَنَفَّسَ (dan demi subuh apabila fajarnya mulai menyingsing) Yakni ketika datang dengan kesegaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Sesungguhnya Al-quran adalah kalam Allah yang disampaikan kepada rasul melalui Jibril alaihis salam. Seperti yang diturunkan Allah kepada Nabi SAW melalui Jibril"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya (Al-Qur’an) itu} Sesungguhnya Al-Qur'an itu {benar-benar firman (yang dibawa) utusan yang mulia} kalam Allah yang dibawa oleh malaikat terpercaya yaitu Jibril AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 19 Tanda-tanda kebesaran ini disumpahkan Allah karena kuatnya sanad al-Qur’an, keluhurannya, dan terjaga dari setiap setan yang terkutuk. Allah berfirman, “Sesungguhnya al-Qur’an itu benar-benar Firman (Allah yang dibawa ole) utusan yang mulia,” yaitu Jibril yang turun membawanya dari Allah, seperti disebutkan dalam Firman Allah yang lain, “Dan sesungguhnya al-Qur’an ini benar-benar diturunkan oleh Rabb semesta alam, ia dibawa turun oleh ar-Ruh al-Amin (Jibril) , ke dalam hatimu (Muhammad) agar kamu menjadi salah seorang di antara orang-orang yang memberi peringatan.” (Asy-Syu’ara’: 192-194) Allah menyebutkan sifatnya yang mulia karena mulianya akhlak dan banyaknya sifat-sifat terpuji. Jibril adalah malaikat paling utama dan paling tinggi derajatnya disisi Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ayat ini adalah merupakan jawaban daripada sumpah-sumpah Allah ﷻ yang disebutkan pada ayat-ayat sebelumnya, Allah mengatakan : { إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ } sesungguhnya Al-Qur'an itu benar-benar ayat Allah yang dibawakan oleh utusan Allah yang Mulia ( Yaitu Jibril ), Al-Qur'an yang didustakan oleh orang-orang kafir, dan para orang-orang musyrik, dan juga orang-orang munafik, dan bahwasanya AL-Qur'an ini bukanlah perkataan seorang penyihir ataupun dukun, dan bukan pula perkataan yang keluar dari lisan seorang penyair, akan tetapi mereka yang mendustakan Al-Qur'an ini mengatakan bahwa Al-Qur'an adalah : sebuah syi'ir , mereka juga mengatakan ini hanyalah perkataan seorang penyihir atau hanya sebuah dongeng orang-orang terdahulu, akan tetapi Allah membantah perkataan mereka dengan menyebutkan ayat ini, Allah menjelaskan bagaimana perjalanan Al-Qur'an hinga sampai ketangan Muhammad, yaitu melalui Rasul-Nya yang mulia Jibril 'alaihissalam, kemudian disampaikan kepada Rasulullah Muhammad ﷺ, lalu beliau menyampaikannya kepada ummatnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Ciptaan-ciptaan tersebut, Allah bersumpah dengan mereka karena keagungan yang akan disumpahkan yaitu dalam firman-Nya: إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ “sesungguhnya Al Qur'an itu benar-benar firman (Allah yang dibawa oleh) utusan yang mulia (Jibril),” Dia adalah malaikat Jibril ‘alaihissholaatu wassalaam, dia adalah utusan Allah kepada rasul-rasul-Nya dengan membawa wahyu yang turun kepada mereka, Allah mensifatinya dengan karom (mulia) karena kebagusan wujudnya, sebagaimana Allah Ta’ala berfirman dalam ayat lain: ذُو مِرَّةٍ فَاسْتَوَى (QS. An-Najm: 6) ذُو مِرَّةٍ Para ulama mengatakan: maknanya adalah memilik wujud yang bagus, dan bentuk yang indah. Jibril ‘Alahissholaatu wassalaam disifati dengan sifat ini Yaitu sifat mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 19: 19-22. Kemudian datang jawaban atas sumpah-sumpah (pada ayat sebelumnya) sebagai bentuk penegasan yang banyak, yaitu bahwasanya Al Qur’an ini diturunkan kepada Nabi ﷺ oleh Jibril dan ia (Al Qur’an) adalah Kalamullah. Dan sungguh Jibril sangat kuat dalam menjalankan tugasnya dan ia memiliki kedudukan di sisi Allah. Jibril adalah malaikat yang ditaati di alam malaikat dan ia adalah malaikat yang amanah dengan wahyu. Dan bahwasanya ia sahabatmu (Muhammad ﷺ) wahai orang-orang arab! Bukanlah orang yang gila."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyifati malaikat Jibril dengan “karim” (yang mulia) karena mulianya akhlaknya dan banyak kebaikannya, karena ia adalah malaikat yang paling utama dan paling tinggi kedudukannya di hadapan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 19",
    "description": "Demi ketiga hal itu, sesungguhnya Al-Qur'an itu benar-benar firman Allah yang dibawa turun oleh utusan yang mulia, yaitu jibril yang diamanati untuk mengawal wahyu Allah kepada para nabi. 20. Kami turunkan Al-Qur'an melalui jibril yang memiliki kekuatan yang tidak tertandingi oleh makhluk lain. Jibril mempunyai 600 sayap. Dengan sayap sebanyak itu jibril sanggup menembus langit ketujuh dengan kecepatan luar biasa. Itulah jibril yang memiliki kedudukan tinggi di sisi Allah yang memiliki 'arsy, singgasana yang agung karena ketaatannya kepada Allah dan tugasnya yang sangat mulia sebagai pembawa wahyu."
  }
]