[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-21. Allah bersumpah dengan bintang-bintang yang cahayanya redup saat siang hari. Yang berjalan dan bersembunyi pada orbit-orbitnya, Juga dengan malam saat datang dengan kegelapannya, Juga dengan waktu shubuh saat datang dengan cahayanya, Sesungguhnya al-qur’an disampaikan oleh utusan yang mulia,yaitu jibril, Pemilik kekuatan dalam melaksankan apa yang diperintahkan kepadanya, pemilik kedudukan tinggi dan mulia di sisi allah, Ditaati oleh para malaikat, dipercaya atas wahyu yang dia bawa turun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Yang mempunyai kekuatan dan kedudukan agung di sisi Pemilik Arasy Yang Mahasuci."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. ذِى قُوَّةٍ عِندَ ذِى الْعَرْشِ مَكِينٍ (yang mempunyai kekuatan, yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai ‘Arsy) Yakni memiliki kekuatan yang besar dan kedudukan yang tinggi di sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Diturunkan kepada Rasul yang memiliki keahlian yang besar dan ingatan yang istimewa, dan memiliki kedudukan yang mulia di sisi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang memiliki kekuatan di sisi Dzat yang memiliki ʻArsy lagi memiliki kedudukan tinggi} pemilik temoat yang tinggi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 20 “Yang mempunyai kekuatan” atas apa yang diperintahkan Allah padanya. Di antara kekuatannya adalah ia mampu membalikkan negeri kaum Luth dan membinasakan mereka, “yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai Arasy.” Artinya, Jibril adalah malaikat yang dekat dengan Allah, ia memiliki derajat tinggi dan istimewa dari Allah yang dikhususkan padanya. Jibril memiliki kedudukan dan derajat di atas kedudukan seluruh malaikat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dialah Jibril yang Allah berikan kepadanya kekuatan, Allah berfirman dengan menyebutkan sifat Jibril, yaitu: { ذُو مِرَّةٍ } ( Yang mempunyai akal yang cerdas ) [ An Najm : 6 ] dan kata ( مِرَّةٍ ) juga berati kekuatan, dialah Jibril yang Kuat dan loyal, Allah memberikannya kekuatan yang super. Dalam ayat ini beberapa sifat yang dimiliki oleh Malaikat Jibril : { عِنْدَ ذِي الْعَرْشِ مَكِينٍ } Jibril memiliki kedudukan yang tinggi disisi Allah ﷻ, dan dialah Malaikat yan paling dekat dengan Allah ﷻ, dan dia pula yang lebih mengetahui diantara para Malikat tentang Tuhannya di langit. Itulah diantara sifat-sifat yang dimiliki oleh Jibril : Malaikat yang kuat perkasa, dan dekat dengan Allah, yakni kedudukannya disisi Allah tinggi. Dan diantara Malaikat-malaikat Allah, pada hakikatnya mereka dekat dengan Tuhannya akan tetapi kedudukan mereka tidak setinggi kedudukannya dengan Jibril, seperti Malaikat \"Arrubawiyyin\" yaitu Malaikat yang membawa 'Arsy, dan juga Malaikat-malaikat lainnya yang bertugas membawa langit-lagit yang kokoh itu, para Malaikat-malaikat itu tidak semua dari mereka dalam satu kedudukan, tugas mereka pun berbeda satu sama lainnya, dan yang paling kuat diantara mereka adalah Jibril."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ذِي قُوَّةٍ عِنْدَ ذِي الْعَرْشِ مَكِينٍ “yang mempunyai kekuatan, yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai Arasy,”ذِي قُوَّةٍ “yang mempunyai kekuatan” Allah mensifatinya dengan kekuatan yang besar, Sesungguhnya Rasulullah shallallaahu ‘alaihi wa sallam pernih melihat wujud asli Jibril yang Allah ciptakan, ia memiliki 600 sayap yang menutupi seluruh ufuk langit karena keagungannya(1), ‘alaihissholaatu wassalaam, Firman-Nya: عِنْدَ ذِي الْعَرْشِ “yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai Arasy” Maknannya: Di sisi pemilik ‘Arsy –Yaitu Allah Jalla Wa ‘Allaa- dan ‘Arsy di atas segala sesuatu, sedangkan di atas Arsy ada Rabb semesta alam, Allah Ta’ala berfirman: رَفِيعُ الدَّرَجَاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ “(Dialah) Yang Maha Tinggi derajat-Nya, Yang mempunyai Arasy, Yang mengutus Jibril dengan (membawa) perintah-Nya kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya”(QS. Ghafir: 15) Pemilik Arsy adalah Allah. Firman-Nya: مَكِينٍ Maknanya: mempunyai kedudukan, yakni di sisi Allah Jibril memiliki kedudukan dan kemuliaan, oleh karenanya Allah memberikan keistimewaan dengan nikmat terbesar atas para hamba-Nya, yaitu nikmat wahyu. Sungguh kenikmatan jika kita perhatikan maka ia terbagi menjadi dua jenis: Nikmat yang sama antara hewan-hewan dengan manusia, yaitu nikmat jasmani makanan, minuman, menikah dan tempat tinggal, ini adalah kenikmatan yang sama antara manusia dan hewan. Manusia menikmati apa yang dimakan, diminum, menikah dan tempat tinggal, begitu juga hewan-hewan. Dan kenikmatan dari jenis lainnya yang hanya dinikmati manusia, yaitu syari’at-syari’at yang diturunkan kepada para rasul, agar kehidupan manusia berlangsung seimbang, karena kehidupan manusia yang dengannya akan diperoleh kebahagiaan dunia dan akhirat tidak mungkin akan lurus kecuali disertai syari’at. مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ “Barang siapa yang mengerjakan amal saleh, baik laki-laki maupun perempuan dalam keadaan beriman, maka sesungguhnya akan Kami berikan kepadanya kehidupan yang baik dan sesungguhnya akan Kami beri balasan kepada mereka dengan pahala yang lebih baik dari apa yang telah mereka kerjakan.”(QS. An-Nahl: 97) sejatinya seorang mukmin yang mengamalkan amalan-amalan salehlah yang memperoleh kehidupan yang baik di dunia dan pahala yang banyak di akhirat. Demi Allah andai anda mengamati para raja dan anak-anaknya, mentri-mentri dan anak-anaknya, penguasa-penguasa dan anak-anaknya, orang-orang kaya dan anak-anaknya yang tidak beriman dan beramal saleh, andai anda mengamatinya dan mengamati orang-orang yang beriman dan beramal saleh pasti anda akan dapati kehidupan golongan yang kedua lebih baik, pikiran lebih tenang, dada lebih tentram, karena Allah ‘Azza Wa Jalla yang di Tangan-Nya kunci-kunci langit dan bumi yang langsung mencukupinya, Allah Ta’ala berfirman: مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً “Barang siapa yang mengerjakan amal saleh, baik laki-laki maupun perempuan dalam keadaan beriman, maka sesungguhnya akan Kami berikan kepadanya kehidupan yang baik”(QS) Anda akan dapati seorang mukmin yang melakukan amalan-amalan saleh, hatinya gembira, dadanya tentram, meneriman ketentuan Allah dan takdir-Nya. Jika ia dikaruniakan kebaikan maka ia akan bersyukur kepada Allah, jika ia ditimpa sebaliknya ia akan menerima dan berbaik sangka kepada Allah, dan mengetahui bahwa yang menimpanya itu karena dosa-dosanya sendiri. Maka ia kembali kepada Allah Azza Wa Jalla. Nabi ‘alaihissholaatu wassalaam bersabda: عَجَبًا لِلْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّه خَيْرٌ وَلَيْسَ ذَلِكَ لِأَحَدٍ إِلّا لِلْمُؤْمِنِ، إِنْ أَصَابَتْه سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَه، وَإِنْ أَصَابَتْهُ ضّرَّاءُ فَكَانَ خَيْرًا لَهُ “ Alangkah menakjubkannya seorang mukmin, sungguh semua perkaranya baik, ini tidak didapati kecuali hanya pada seorang mukmin, jika ia mendapatkan kegembiraan ia akan bersyukur, maka ini baik baginya, jika ia ditimpa musibah ia akan bersabdar, maka ini juga baik baginya ” (2) Benar yang diucapkan Nabi shallallaahu ‘alaihi wa sallam Kalau begitu, maka nikmat terbesar yang Allah turunkan kepada manusia adalah nikmat agama yang dapat menopang kehidupan manusia di dunia dan di akhirat. Kehidupan yang hakiki adalah kehidupan akhirat. Dalilnya Adalah firman Allah ‘Azza Wa Jalla di surat al-Fajr: يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي “Dia mengatakan: \"Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini.\"”(QS. Al-Fajr: 24) maka dunia ini tidak ada apa-apanya. Kehidupan yang hakiki sejatinya adalah kehidupan akhirat, orang yang beramal untuk akhirat maka ia akan hidup dengan kehidupan yang baik di dunia. Seorang mukmin yang mengamalkan amalan-amalan saleh, ia lah yang akan memperoleh dua kehidupan yang baik: kehidupan dunia dan kehidupan akhirat, sedangkan orang kafir dia yang rugi dunia dan akhirat: قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ أَلَا ذَلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ “Katakanlah: \"Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari kiamat\". Ingatlah yang demikian itu adalah kerugian yang nyata.”(QS. Az-Zumar: 15)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 20: 19-22. Kemudian datang jawaban atas sumpah-sumpah (pada ayat sebelumnya) sebagai bentuk penegasan yang banyak, yaitu bahwasanya Al Qur’an ini diturunkan kepada Nabi ﷺ oleh Jibril dan ia (Al Qur’an) adalah Kalamullah. Dan sungguh Jibril sangat kuat dalam menjalankan tugasnya dan ia memiliki kedudukan di sisi Allah. Jibril adalah malaikat yang ditaati di alam malaikat dan ia adalah malaikat yang amanah dengan wahyu. Dan bahwasanya ia sahabatmu (Muhammad ﷺ) wahai orang-orang arab! Bukanlah orang yang gila."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk melaksanakan perintah Allah ‘Azza wa Jalla. Di antara kekuatannya adalah dia (malaikat Jibril) mampu membalikkan negeri kaum Luth dan membinasakan mereka. Jibril ‘alaihis salam adalah malaikat yang didekatkan dengan Allah Subhaanahu wa Ta'aala, memiliki kedudukan yang tinggi di sisi-Nya di atas malaikat yang lain, dan mendapatkan keistimewaan dari Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 20",
    "description": "Kami turunkan Al-Qur'an melalui jibril yang memiliki kekuatan yang tidak tertandingi oleh makhluk lain. Jibril mempunyai 600 sayap. Dengan sayap sebanyak itu jibril sanggup menembus langit ketujuh dengan kecepatan luar biasa. Itulah jibril yang memiliki kedudukan tinggi di sisi Allah yang memiliki 'arsy, singgasana yang agung karena ketaatannya kepada Allah dan tugasnya yang sangat mulia sebagai pembawa wahyu. 21. Itulah jibril yang di sana, di alam malaikat, ditaati dan dipercaya atas wahyu yang disampaikannya."
  }
]