[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-21. Allah bersumpah dengan bintang-bintang yang cahayanya redup saat siang hari. Yang berjalan dan bersembunyi pada orbit-orbitnya, Juga dengan malam saat datang dengan kegelapannya, Juga dengan waktu shubuh saat datang dengan cahayanya, Sesungguhnya al-qur’an disampaikan oleh utusan yang mulia,yaitu jibril, Pemilik kekuatan dalam melaksankan apa yang diperintahkan kepadanya, pemilik kedudukan tinggi dan mulia di sisi allah, Ditaati oleh para malaikat, dipercaya atas wahyu yang dia bawa turun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Ditaati oleh para penghuni langit, menunaikan amanat yang dibebankan kepadanya berupa wahyu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. مُّطَاعٍ ثَمَّ أَمِينٍ (yang ditaati di sana (di alam malaikat) lagi dipercaya) Yakni di sana ia ditaati oleh malaikat lain, dan ia dipercaya untuk menyampaikan wahyu dan lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Semua malaikat di langit taat kepada perintahnya, yang menjaga dan amanah terhadap wahyu dan risalah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang ditaati disana} di langit sana {lagi dipercaya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 21 “Yang ditaati di sana (di alam malaikat),” artinya, Jibril adalah malaikat yang ditaati dalam komunitas malaikat, karena Jibril termasuk di antara malaikat yang dekat dengan Allah, perintahnya dilaksanakan dalam golongan mereka, pandangannya ditaati, “lagi dipercaya,” yakni mempunyai sifat dan sikap amanah dan melakukan apa yang diperintahkan, tidak kurang dan tidak lebih, dan tidak menerjang batasan yang telah ditentukan baginya. Semua itu menunjukkan mulianya al-Qur’an melalui perantara malaikat mulia yang memiliki sifat-sifat sempurna tersebut. Biasanya, para raja hanya mengirim utusan paling mulia dalam urusan-urusan penting dan untuk mengirim surat-surat mulia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ مُطَاعٍ } Dia juga jibril yang ditaati oleh para Malaikat, dialah tuannya para Malaikat yang para Malaikat taat kepadanya atas perintah Allah. { ثَمَّ } Yakni disana dilangit { أَمِينٍ } Selain sifat kuat yang dimiliki oleh Jibril, ia juga Malaikat yang hanya kepadanyalah Allah memberikan kepercayaan untuk menyampaiakan wahyu kepada Rasulullah Muahmmad ﷺ, apa yang Allah sampaikan kepadanya dari wahyu tidak ia tambah apalagi menguranginya, dan Allah lah yang memberinya gelar الأمين : yang dipercaya, Allah berfirman : { نَزَلَ بِهِ الرُّوحُ الْأَمِينُ , عَلَىٰ قَلْبِكَ لِتَكُونَ مِنَ الْمُنْذِرِينَ , بِلِسَانٍ عَرَبِيٍّ مُبِينٍ } ( Dia dibawa turun oleh Ar-Ruh Al-Amin (Jibril) , Ke dalam hatimu (Muhammad) agar kamu menjadi salah seorang di antara orang-orang yang memberi peringatan , Dengan bahasa Arab yang jelas. ) [ Asy Syu'ara' : 193-195 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "مُطَاعٍ ثَمَّ أَمِينٍ \" yang ditaati di sana (di alam malaikat) lagi dipercaya. \" : Amanah menyampaikan segala tugas yang diembannya, Jibrilah yang ditaati, maka siapa yang mentaatinya. Para Ulama mengatakan: Yang mentaatinya adalah malaikat-malaikat lainnya, karena ia turun berdasarkan perintah dari Allah, Allah memerintahkan malaikat maka mereka pun taat. Jibril punya kewenangan perintah dan ditaati oleh malaikat lain, kemudian rasul-rasul ‘alaihissholaatu wassalaam, yang Jibril turun kepada mereka, mereka memiliki kewenangan perintah dan ditaati oleh manusia mukallaf: وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَاحْذَرُوا فَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّمَا عَلَى رَسُولِنَا الْبَلَاغُ الْمُبِينُ “Dan taatlah kamu kepada Allah dan taatlah kamu kepada Rasul (Nya) dan berhati-hatilah. Jika kamu berpaling, maka ketahuilah bahwa sesungguhnya kewajiban Rasul Kami, hanyalah menyampaikan (amanat Allah) dengan terang.”(QS. Al-Maidah: 92) Dalam ayat-ayat ini إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (19) ذِي قُوَّةٍ عِنْدَ ذِي الْعَرْشِ مَكِينٍ “sesungguhnya Al Qur'an itu benar-benar firman (Allah yang dibawa oleh) utusan yang mulia (Jibril), yang mempunyai kekuatan, yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai Arasy,” Allah ‘Azza Wa Jalla bersumpah bahwa quran ini adalah ucapan utusan, malaikat mulia, Jibril ‘alaihissholaatu wassalaam, dan di ayat lainnya Allah ‘Azza Wa Jalla menjelaskan dan bersumpah bahwa Al-Quran ini adalah perkataan Utusan mulia, seorang manusia dalam firman-Nya: فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ (38) وَمَا لَا تُبْصِرُونَ (39) إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (40) وَمَا هُوَ بِقَوْلِ شَاعِرٍ “Maka Aku bersumpah dengan apa yang kamu lihat. Dan dengan apa yang tidak kamu lihat. Sesungguhnya Al Qur'an itu adalah benar-benar wahyu (Allah yang diturunkan kepada) asul yang mulia, dan Al Qur'an itu bukanlah perkataan seorang penyair.”(QS. Al-Haaqqah: 38-41) Rasul di sini di surat At-Takwir adalah malaikat, yaitu Jibril ‘alaihissholaatu wassalaam, dan di surat lainnya adalah utusan berupa manusia yaitu Muhammad ‘alaihissholaatu wassalaam, sudah jelas. Pada ayat ini Allah berfirman: إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (19) ذِي قُوَّةٍ عِنْدَ ذِي الْعَرْشِ مَكِينٍ “sesungguhnya Al Qur'an itu benar-benar firman (Allah yang dibawa oleh) utusan yang mulia (Jibril), yang mempunyai kekuatan, yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai Arasy,” Ini adalah karakter Jibril, karena dialah yang di sisi Allah, adapun Muhammad shallallaahu ‘alaihi wa sallam beliau di bumi, dalam ayat lain, Allah berfirman: فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ (38) وَمَا لَا تُبْصِرُونَ (39) إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (40) وَمَا هُوَ بِقَوْلِ شَاعِرٍ “Maka Aku bersumpah dengan apa yang kamu lihat. Dan dengan apa yang tidak kamu lihat. Sesungguhnya Al Qur'an itu adalah benar-benar wahyu (Allah yang diturunkan kepada) asul yang mulia, dan Al Qur'an itu bukanlah perkataan seorang penyair.” Sebagai bantahan perkataan orang-orang kafir: Ini adalah perkataan penyair, bukan pula ucapan paranormal. Sumpah mana yang lebih besar: فَلَا أُقْسِمُ بِالْخُنَّسِ (15) الْجَوَارِ الْكُنَّسِ (16) وَاللَّيْلِ إِذَا عَسْعَسَ (17) وَالصُّبْحِ إِذَا تَنَفَّسَ (18) إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ “Sungguh, Aku bersumpah dengan bintang-bintang, yang beredar dan terbenam, demi malam apabila telah hampir meninggalkan gelapnya, dan demi subuh apabila fajarnya mulai menyingsing, sesungguhnya Al Qur'an itu benar-benar firman (Allah yang dibawa oleh) utusan yang mulia (Jibril),” atau فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ (38) وَمَا لَا تُبْصِرُونَ (39) إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ “Maka Aku bersumpah dengan apa yang kamu lihat. Dan dengan apa yang tidak kamu lihat. Sesungguhnya Al Qur'an itu adalah benar-benar wahyu (Allah yang diturunkan kepada) Rasul yang mulia” tentu yang kedua lebih agung, tidak ada yang lebih umum dari sumpah itu, بِمَا تُبْصِرُونَ (38) وَمَا لَا تُبْصِرُونَ “dengan apa yang kamu lihat. Dan dengan apa yang tidak kamu lihat.” segala sesuatu baik yang kita lihat mau pun yang tidak kita lihat. Dengan begitu, Allah telah bersumpah dengan segala sesuatu, sedangkan di ayat-ayat ini Allah hanya bersumpah dengan tanda-tanda kebesaran-Nya yang tinggi (dilangit). فَلَا أُقْسِمُ بِالْخُنَّسِ (15) الْجَوَارِ الْكُنَّسِ (16) وَاللَّيْلِ إِذَا عَسْعَسَ (17) وَالصُّبْحِ إِذَا تَنَفَّسَ “Sungguh, Aku bersumpah dengan bintang-bintang, yang beredar dan terbenam, demi malam apabila telah hampir meninggalkan gelapnya, dan demi subuh apabila fajarnya mulai menyingsing” Tanda-tanda kebesaran-Nya yang tinggi dilangit tersebut sesuai dengan yang disumpah bahwa itu adalah ucapannya, yaitu Jibril, karena Jibril di sisi Allah. Jika ada orang yang bertanya: Bagaimana Allah mensifati bahwa Al-Quran adalah perkataan Rasul berupa manusia dan utusan berupa malaikat? Maka kita jawab: Ya, Utusan berupa malaikat menyampaikan ucapan wahyu itu kepada rasul berupa manusia, rasul berupa manusia itu menyampaikannya kepada umat, Jadi perkataan wahyu itu berupa perwakilan, perkataan jibril adalah perwakilan, dan perkataan Muhammad adalah perwakilan, yang mengataakannya pertama adalah Allah ‘Azza Wa Jalla. Al-Quran adalah perkataan Allah secara hakiki, kerena Dialah yang mengatakannya pertama, dan perkataan Jibril jika ditinjau bahwa ia menyampaikan kepada Muhammad, dan perkataan Muhammad jika ditinjau bahwa beliau menyampaikan kepada Ummat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 21: 19-22. Kemudian datang jawaban atas sumpah-sumpah (pada ayat sebelumnya) sebagai bentuk penegasan yang banyak, yaitu bahwasanya Al Qur’an ini diturunkan kepada Nabi ﷺ oleh Jibril dan ia (Al Qur’an) adalah Kalamullah. Dan sungguh Jibril sangat kuat dalam menjalankan tugasnya dan ia memiliki kedudukan di sisi Allah. Jibril adalah malaikat yang ditaati di alam malaikat dan ia adalah malaikat yang amanah dengan wahyu. Dan bahwasanya ia sahabatmu (Muhammad ﷺ) wahai orang-orang arab! Bukanlah orang yang gila."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia (malaikat Jibril) adalah malaikat yang amanah, yang mampu menjalankan perintah Allah tanpa menambah dan tanpa mengurangi serta tidak melampaui apa yang telah ditetapkan untuknya. Ini semua adalah untuk menunjukkan kemuliaan Al Qur’an di sisi Allah Ta’ala, karena Dia mengirim malaikat yang mulia yang telah disifati dengan sifat-sifat sempurna itu untuk membawa Al Qur’an. Dan biasanya raja-raja tidaklah mengirimkan orang yang mulia kecuali untuk misi yang penting dan mulia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 21",
    "description": "Itulah jibril yang di sana, di alam malaikat, ditaati dan dipercaya atas wahyu yang disampaikannya. 22. Kami turunkan wahyu melalui jibril kepada nabi Muhammad, temanmu yang kamu kenal baik sifatnya. Dan temanmu itu bukanlah orang gila seperti tuduhanmu kepadanya. Dia adalah seorang yang santun, tepercaya, dan berakhlak mulia. Perkataan orang gila bersifat racauan, tidak beraturan, dan tidak mempunyai nilai. Berbeda dari alqur'an, kitab yang susunan kalimat maupun kandungannya mempunyai nilai sangat tinggi."
  }
]