[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-25. Muhammad yang kalian kenal bukan orang gila. Muhammad telah melihat jibril yang datang dengan membawa wahyu kepadanya dalam wujud aslinya sebagaimana Allah menciptakannya,di ufuk besar dari arah timur di Makkah,itu adalah penglihatan nabi kepada jibril yang pertama di gua hira. Muhammad tidak kikir dalam menyampaikan wahyu. Al-qur’an ini bukan ucapan setan yang terkutuk yang terusir dari rahmat Allah, sebaliknya ia adalah kalam dan wahyu Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan teman kalian (Muhammad) yang telah kalian ketahui akalnya, amanatnya, kejujurannya, sekali-kali bukanlah orang gila sebagaimana yang kalian tuduhkan kepadanya dengan curang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمَا صَاحِبُكُم بِمَجْنُونٍ (Dan temanmu (Muhammad) itu bukanlah sekali-kali orang yang gila) Allah menyebut Nabi Muhammad dengan sebutan ‘teman kalian’, untuk mengisyaratkan bahwa mereka mengetahui urusannya dan mengenal sifatnya bahwa dia adalah orang yang paling cerdas dan sempurna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Wahai para musrik Makkah, sahabat kalian Muhammad SAW itu bukanlah orang gila seperti apa yang telah kalian kira. Kalian semua sebenarnya tahu kebenaran, akal, dan hikmah yang dimiliknya, karena dia adalah sahabat kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dipercayai atas wahyu yang diturunkan melalui dia {Temanmu itu} nabi Muhammad SAW {bukanlah orang gila ."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 22 Ketika Allah menyebutkan keutamaan utusan dari kalangan malaikat yang datang membawa al-Qur’an, Allah menyebutkan keutamaan utusan dari kalangan manusia yang diberi al-Qur’an seraya berfirman, “Dan temanmu (Muhammad) itu sekali-kali bukanlah orang yang gila,” seperti yang diucapkan para musuhnya yang mendustakan risalahnya dan yang mengatakan ucapan-ucapan dengan tujuan ingin memadamkan risalah yang dibawa. Muhamad adalah orang yang paling sempurna akalnya, paling lurus pendapatnya, dan paling jujur tuturnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَمَا صَاحِبُكُمْ } Dan rekan kalian, yaitu : Muhammad ﷺ, disebut sebagai rekan karena mereka ( orang-orang Quraisy ) mengetahui siapa Muhammad itu, dan jikalau mereka tidak mengetahuinya, maka tidak disebut sebagai rekan atau sahabat, dan Muhammad itu tinggal diantara mereka sejak kecil hingga besar, mereka mengetahui keseharian Muhammad itu bagaimana, mereka mengetahui garis keturunan Nabi Muhammad ﷺ, Nabi Muhammad tidak asing lagi bagi mereka oleh karena itu Muhammad sebagai rekan atau sahabat bagi mereka. { وَمَا صَاحِبُكُمْ } Dan tidaklah rekan kalian itu gila, begitulah orang-orang Quraisy katakan tentang rekan mereka Muhammad ﷺ, bagaimana mungkin mereka mengatakan bahwa Muhammad ﷺ itu gila sedangkan yang ia katakan adalah Al-Qur'an, maka datanglah ini sebagai bantahan atas perkataan mereka tentang Rasulullah Muhammad ﷺ, dan sesungguhnya mereka itu tidak berfikir dan telah melampaui batas. Allah menurunkan ayat ini sebagai bantahan atas celaan orang-orang qurays terhadap Nabi ﷺ, dalam ayat lain Allah berfirman : { مَا أَنْتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُونٍ } ( Berkat nikmat Tuhanmu kamu (Muhammad) sekali-kali bukan orang gila. ) [ Al Qalam : 2 ] , dialah Muhammad yang paling cemerlang akalnya diantara manusia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا صَاحِبُكُمْ بِمَجْنُونٍ Dan teman kalian itu bukanlah sekali-kali orang yang gila.Maknanya: Muhammad, Rasulullah shallallaahu ‘alaihi wa sallam dan perhatikan Allah berfirman: وَمَا صَاحِبُكُمْ “Dan teman kalian itu” disandarkan kepada mereka agar sindiran kepada mereka lebih tegas ketika mereka menolak dakwahnya, seakan-akan Allah berfirman: Tidaklah sahabat kalian yang kalian kenali ini, kalian bersamanya selama 40 tahun di Mekah sebelum kenabian, mereka mengenali beliau, mereka tahu kejujuran dan sifat amanah beliau, sampai-sampai mereka mereka menjulukinya al-Amin. وَمَا صَاحِبُكُمْ بِمَجْنُونٍ Yakni: Tidak gila. Bahkan sebenarnya belau orang yang paling berakal ‘alaihisholaatu wassalaam, manusia paling sempurna akalnya, tidak diragukan lagi, dan yang paling lurus pendapatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 22: 19-22. Kemudian datang jawaban atas sumpah-sumpah (pada ayat sebelumnya) sebagai bentuk penegasan yang banyak, yaitu bahwasanya Al Qur’an ini diturunkan kepada Nabi ﷺ oleh Jibril dan ia (Al Qur’an) adalah Kalamullah. Dan sungguh Jibril sangat kuat dalam menjalankan tugasnya dan ia memiliki kedudukan di sisi Allah. Jibril adalah malaikat yang ditaati di alam malaikat dan ia adalah malaikat yang amanah dengan wahyu. Dan bahwasanya ia sahabatmu (Muhammad ﷺ) wahai orang-orang arab! Bukanlah orang yang gila."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 22",
    "description": "Kami turunkan wahyu melalui jibril kepada nabi Muhammad, temanmu yang kamu kenal baik sifatnya. Dan temanmu itu bukanlah orang gila seperti tuduhanmu kepadanya. Dia adalah seorang yang santun, tepercaya, dan berakhlak mulia. Perkataan orang gila bersifat racauan, tidak beraturan, dan tidak mempunyai nilai. Berbeda dari alqur'an, kitab yang susunan kalimat maupun kandungannya mempunyai nilai sangat tinggi. 23. Ayat ini menegaskan pertemuan antara jibril dalam wujudnya yang asli dengan nabi Muhammad sesaat setelah nabi menerima wahyu pertama di gua hira. Kaum musyrik mendustakan hal tersebut. Dan sungguh, dia telah melihatnya, yakni melihat jibril, di ufuk yang terang, sehingga tidak dapat diragukan bahwa sosok yang datang itu adalah jibril."
  }
]