[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-25. Muhammad yang kalian kenal bukan orang gila. Muhammad telah melihat jibril yang datang dengan membawa wahyu kepadanya dalam wujud aslinya sebagaimana Allah menciptakannya,di ufuk besar dari arah timur di Makkah,itu adalah penglihatan nabi kepada jibril yang pertama di gua hira. Muhammad tidak kikir dalam menyampaikan wahyu. Al-qur’an ini bukan ucapan setan yang terkutuk yang terusir dari rahmat Allah, sebaliknya ia adalah kalam dan wahyu Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Teman kalian ini telah melihat Jibril di ufuk langit yang jelas dalam bentuk asli sebagaimana ia diciptakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-25. Sungguh Muhammad telah melihat Jibril di ufuk langit dengan jelas; dia sama sekali tidak pelit untuk menyampaikan wahyu sehingga dia tidak menyembunyikannya dari kalian. Dan al-Qur’an bukanlah perkataan setan yang terkutuk dan dijauhkan dari rahmat Allah; akan tetapi al-Qur’an merupakan firman Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَلَقَدْ رَءَاهُ بِالْأُفُقِ الْمُبِينِ (Dan sesungguhnya Muhammad itu melihat Jibril di ufuk yang terang) Yakni Muhammad telah melihat Jibril dengan rupa sebenarnya, ia memiliki enam ratus sayap. Mujahid mengatakan: Rasulullah melihatnya di arah Ajyad yang terletak di timur kota Makkah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sungguh, Muhammad SAW itu telah melihat secara langsung wujud asli Jibril di atas awang-awang, dia memliki 600 sayap"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, dia benar-benar telah melihatnya} sunggun nabi Muhammad SAW benar-benar melihat Jibril AS, dengan bentuk sebenarnya ketika dia diciptakan {di ufuk yang terang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 23 “Dan sesungguhnya Muhammad itu pernah melihat Jibril di ufuk yang terang,” yakni Muhammad itu pernah melihat Jibril di ufuk yang terang, yaitu tempat yang paling tinggi yang terlihat pandangan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sungguh Muhammad ﷺ telah melihat Jibril pada bentuknya yang asli di sebelah ufuk, entah itu di ufuk timur atau di ufuk barat, selain itu Jibril pun kerap mendatangi Rasulullah ﷺ dengan wujud seorang laki-laki, Dan Rasulullah melihat Jibril pada bentuknya yang asli sebanyak dua kali, yang pertama ketika Nabi Muhammad ﷺ sedang berada disuatu tempat di kota Makkah beliau melihat Jibril dengan jelas diantara langit dan bumi yang besarnya menutupi semua ufuk. Dan kali yang kedua : Yaitu ketika Rasulullah ﷺ melakukan perjalanan malam ( Isra' Mi'raj ) , Dalam Al-Qur'an Allah mengatakan tentang hal itu : { ثُمَّ دَنَا فَتَدَلَّىٰ } ( Kemudian dia mendekat, lalu bertambah dekat lagi. ) Yakni : Jibril , { فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَىٰ , فَأَوْحَىٰ إِلَىٰ عَبْدِهِ مَا أَوْحَىٰ , مَا كَذَبَ الْفُؤَادُ مَا رَأَىٰ , أَفَتُمَارُونَهُ عَلَىٰ مَا يَرَىٰ , وَلَقَدْ رَآهُ نَزْلَةً أُخْرَىٰ , عِنْدَ سِدْرَةِ الْمُنْتَهَىٰ } ( Maka jadilah dia dekat (pada Muhammad sejarak) dua ujung busur panah atau lebih dekat (lagi). , Lalu dia menyampaikan kepada hamba-Nya (Muhammad) apa yang telah Allah wahyukan , Hatinya tidak mendustakan apa yang telah dilihatnya , Dan sesungguhnya Muhammad telah melihat Jibril itu (dalam rupanya yang asli) pada waktu yang lain , (yaitu) di Sidratil Muntaha. ) [ An Najm : 8-14 ] Nabi Muhammad telah melihat Jibril dalam rupanya yang asli di langit pada malam mi'raj, dan beliau ﷺ juga telah melihat jibril di bumi ketika kaumnya yang pada saat itu mempersempit kegiatan dakwah Rasulullah ﷺ , maka muncullah Jibril 'alaihissalam di ufuk, kemudian Jibril mengajak Rasulullah berbicara dan menenangkannya dari keburukan kaumnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَلَقَدْ رَآهُ Dan sesungguhnya Muhammad itu melihat Jibril \" Maknanya: Muhammad melihat Jibril بِالْأُفُقِ الْمُبِينِ \" di ufuk yang terang \" Ufuk adalah sisi langit, jelas lagi tinggi, Maka Rasul ‘alaissholaatu wassalaam pernah melihat Jibril dengan wujud aslinya dua kali, pertama di gua hira, kedua di langit yang ketujuh saat isra mi’raj. Yang dimaksud pada ayat ini adalah melihat di gua hiro (1), karena Allah berfirman: بِالْأُفُقِ الْمُبِينِ Maka di sini jelas bahwa Muhammad berada di bumi (1) Dikeluarkan Bukhari (4) dan Muslim (161) dari hadits Aisyah radhiyallaahu 'anha"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 23: 23-25. Kemudian Allah bersumpah bahwa Nabi ﷺ melihat Jibril dalam bentuk aslinya yang Allah ciptakan atasnya. Ia (Jibril) nampak di ufuk timur ketika terbitnya matahari. Dan Allah bersumpah bawasanya Muhammad ﷺ bukanlah orang yang bakhil (pelit) dengan apa yang mestinya ia sampaikan (kepada umat) dan tidak juga orang yang dicurigai atau selainnya. Ketahuilah olehmu ! Bahwa apa yang diucapkan oleh Muhammad ﷺ adalah Al Qur’an Al Karim, bukan ucapan yang dilemparkan oleh setan atas lisan Muhammad ﷺ sebagaimana kalian klaim dan tuduh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam bentuk aslinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 23",
    "description": "Ayat ini menegaskan pertemuan antara jibril dalam wujudnya yang asli dengan nabi Muhammad sesaat setelah nabi menerima wahyu pertama di gua hira. Kaum musyrik mendustakan hal tersebut. Dan sungguh, dia telah melihatnya, yakni melihat jibril, di ufuk yang terang, sehingga tidak dapat diragukan bahwa sosok yang datang itu adalah jibril. 24. Dan dia bukanlah orang yang kikir untuk menerangkan ihwal perkara yang gaib, seperti Allah, malaikat, dan hari kiamat. Nabi dengan senang hati memberi penjelasan demi kemaslahatan banyak orang. Hal ini berbeda dari para dukun yang hanya mau membeberkan hal yang rahasia jika diberi imbalan."
  }
]