[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-25. Muhammad yang kalian kenal bukan orang gila. Muhammad telah melihat jibril yang datang dengan membawa wahyu kepadanya dalam wujud aslinya sebagaimana Allah menciptakannya,di ufuk besar dari arah timur di Makkah,itu adalah penglihatan nabi kepada jibril yang pertama di gua hira. Muhammad tidak kikir dalam menyampaikan wahyu. Al-qur’an ini bukan ucapan setan yang terkutuk yang terusir dari rahmat Allah, sebaliknya ia adalah kalam dan wahyu Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan tidaklah teman kalian ini sebagai orang yang bakhil, yang enggan untuk menyampaikan kepada kalian apa yang diperintahkan kepadanya untuk disampaikan kepada kalian, dan dia juga tidak mengambil upah sebagaimana para dukun mengambil upah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَمَا هُوَ (Dan bukanlah dia) Yakni Muhammad. عَلَى الْغَيْبِ (untuk menerangkan yang ghaib) Yakni berita-berita langit. بِضَنِينٍ (orang yang bakhil) Yakni tidak kikir dan tidak lalai dalam menyampaikan risalah, namun dia mengajarkan firman dan hukum-hukum Allah kepada manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Muhammad SAW bukanlah orang yang kikir untuk menyampaikan dan mengajarkan wahyu Allah dan kabar dari langit yang ghaib"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan dia terhadap yang ghaib itu tidaklah} dan nabi Muhammad itu terhadap wahyu dan kabar dari langit tidaklah {kikir} enggan menyampaikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 24 “dan Muhammad bukanlah orang yang bakhil untuk menerangkan yang ghaib” yakni Muhammad bukanlah seorang yang tertuduh menambahi, mengurangi, atau menyembunyikan sebagian yang diwahyukan Allah padanya, tapi Muhammad adalah yang paling terpercaya dari kalangan penduduk bumi dan langit yang menyampaikan risalah Rabbnya dengan nyata, sama sekali tidak bersifat bakhil pada orang kaya, orang miskin, pemimpin, rakyat, orang lelaki, perempuan, orang kota, orang desa, dan lainnya. Karena itu Allah mengutus beliau di tengah-tengah kaum yang tidak bisa membaca dan menulis lagi bodoh. Dan belulah Nabi Muhammad meninggal dunia, tapi mereka semua menjadi ulama-ulama rabbani dan ilmuwan-ilmuwan yang memiliki pikirian tajam. Puncak segala ilmu berakhir pada mereka, mereka adalah para guru sedangkan lainnya paling tinggi hanyalah murid-murid mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَمَا هُوَ } Dan tidaklah dia ( Muhammad ) { عَلَى الْغَيْبِ بِضَنِينٍ } pantas dicurigai atas apa yang ia sampaikan tentang hal-hal ghaib ( Wahyu ) karena dia adalah orang yang jujur lagi baik, dan menurut riwayat lain { بِضَنِينٍ } berarti kikir, yakni tidklah Muhammad ﷺ itu seorang yang kikir dalam menyampaikan risalah yang Allah wahyukan kepadanya, Muhammad bukanlah orang yang pantas dicurigai kebohongannya dan bukan pula orang kikir dalam menyampaikan risalah islam, akan tetapi dia adalah Rasul yang mulia yang kejujurannya tidak pantas diragukan. Lalu bagaimana mungkin mereka mencerca apa yang tertulis dalam Al-Qur'an, bukankah Al Qur'an itu dibawakan oleh Rasul yang mulia dan jujur yang Allah pun percaya akan kedudukan dirinya, ِdan Al Qur'an ini selalu dalam perindungan Allah dan tiada satupun yang dapat mengganggunya dan merusaknya, Allah berfirman : { وَمَا تَنَزَّلَتْ بِهِ الشَّيَاطِينُ , وَمَا يَنْبَغِي لَهُمْ وَمَا يَسْتَطِيعُونَ , إِنَّهُمْ عَنِ السَّمْعِ لَمَعْزُولُونَ } ( Dan Al Quran itu bukanlah dibawa turun oleh syaitan-syaitan , Dan tidaklah patut mereka membawa turun Al Quran itu, dan merekapun tidak akan kuasa. , Sesungguhnya mereka benar-benar dijauhkan daripada mendengar Al Quran itu. ) [ As Syu'ara' : 210-213 ] Wahyu itu diturunkan oleh Allah melalui perantaraan Malaikat, Mereka dipercaya untuk membawa wahyu Allah kebumi, dan sekali-kali setan tidak akan mampu menganggunya, Allah berfirman : { هَلْ أُنَبِّئُكُمْ عَلَىٰ مَنْ تَنَزَّلُ الشَّيَاطِينُ , تَنَزَّلُ عَلَىٰ كُلِّ أَفَّاكٍ أَثِيمٍ } ( Apakah akan Aku beritakan kepadamu, kepada siapa syaitan-syaitan itu turun ? , Mereka turun kepada tiap-tiap pendusta lagi yang banyak dosa, ) [ As Syu'ara' : 221-222 ] dan setan-setan itu tidak mungkin turun kepada para Nabi, mereka ( orang-orang kafir quraisy ) mengatakan bahwa Al Qur'an itu diturunkan melalui para syaiton, akan tetapi perkatan mereka itu hanyalah dusta dan merupaka sebuah penghinaan, melainkan merekalah yang kepadanya syaiton-syaito itu turun, sedangkan yang turun kepada para Nbi dan Rasul dengan membawa wahyu Allah yaitu para Malaikat yang mulia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا هُوَ \"Dan tidaklah dia\"Yaitu Muhammad shallallaahu ‘alaihi wa sallam عَلَى الْغَيْبِ Yakni: terhadap wahyu yang diturunkan kepadanya dari sisi Allah: بِضَنِينٍ Dengan huruf dhad, artinya: Pelit, beliau ‘alaihissholaatu wassalaam tidak tertuduh (dusta) dalam menyampaikan wahyu, tidak juga pelit, tetapi beliau orang yang paling getol dalam menyampaikan wahyu, beliau senantia mengajarkan manusia di setiap kesempatan, beliau orang yang paling jauh dari tuduhan, karena sempurnanya kejujuran dan amanah beliau, ‘alaihissholaatu wassalaam. Dalam cara baca yang lain dengan zhoo,artinya tertuduh, azh-zhan artinya tuhmah [tuduhan]."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 24: 23-25. Kemudian Allah bersumpah bahwa Nabi ﷺ melihat Jibril dalam bentuk aslinya yang Allah ciptakan atasnya. Ia (Jibril) nampak di ufuk timur ketika terbitnya matahari. Dan Allah bersumpah bawasanya Muhammad ﷺ bukanlah orang yang bakhil (pelit) dengan apa yang mestinya ia sampaikan (kepada umat) dan tidak juga orang yang dicurigai atau selainnya. Ketahuilah olehmu ! Bahwa apa yang diucapkan oleh Muhammad ﷺ adalah Al Qur’an Al Karim, bukan ucapan yang dilemparkan oleh setan atas lisan Muhammad ﷺ sebagaimana kalian klaim dan tuduh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa maksudnya, bahwa Beliau bukanlah orang yang tertuduh menambah, mengurangi atau menyembunyikan sebagian wahyu Allah, bahkan Beliau adalah manusia yang paling amanah, Beliau menyampaikan risalah Tuhannya dengan sempurna tanpa mengurangi atau menambah. Beliau juga tidak bakhil sehingga menyembunyikan sebagian wahyu Allah, bahkan Beliau tidaklah wafat kecuali setelah berhasil mendidik umat yang sebelumnya jahil menjadi umat yang berilmu yang menjadi rujukan oleh generasi yang datang setelahnya dalam ilmu dan pemahaman, mereka yang telah dididiknya menjadi guru, sedangkan generasi setelahnya merupakan murid-murid mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 24",
    "description": "Dan dia bukanlah orang yang kikir untuk menerangkan ihwal perkara yang gaib, seperti Allah, malaikat, dan hari kiamat. Nabi dengan senang hati memberi penjelasan demi kemaslahatan banyak orang. Hal ini berbeda dari para dukun yang hanya mau membeberkan hal yang rahasia jika diberi imbalan. 25. Dan Al-Qur'an itu bukanlah perkataan setan yang terkutuk. Ada perbedaan nyata antara Al-Qur'an dan perkataan setan. Al-qur'an mengajarkan nilai-nilai kebenaran dan keadilan, sedangkan setan mengajak kepada kebatilan, kemaksiatan, dan kemungkaran."
  }
]