[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-25. Muhammad yang kalian kenal bukan orang gila. Muhammad telah melihat jibril yang datang dengan membawa wahyu kepadanya dalam wujud aslinya sebagaimana Allah menciptakannya,di ufuk besar dari arah timur di Makkah,itu adalah penglihatan nabi kepada jibril yang pertama di gua hira. Muhammad tidak kikir dalam menyampaikan wahyu. Al-qur’an ini bukan ucapan setan yang terkutuk yang terusir dari rahmat Allah, sebaliknya ia adalah kalam dan wahyu Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan tidaklah Al-Qur`ān ini merupakan ucapan setan yang tertolak dari rahmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَمَا هُوَ بِقَوْلِ شَيْطٰنٍ رَّجِيمٍ (Dan Al Quran itu bukanlah perkataan syaitan yang terkutuk) Yakni al-Qur’an bukanlah perkataan setan yang mencuri berita dari langit yang kemudian dilempar dengan kobaran api."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Al-quran ini bukanlah perkataan setan yang mencuri pendengaran, terlaknat, dan terhalangi dari rahmat Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Al-Qur’an) itu bukanlah} Al-Qur'an itu bukanlah {perkataan setan yang terkutuk} yang terusir dari rahmat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 25 “Dan al-Qur’an itu bukanlah perkataan setan yang terkutuk.” Pada saat Allah menjelaskan kemuliaan KitabNya dan karuniaNya dengan menyebutkan dua utusan mulia yang sampai pada manusia melalui tangan mereka berdua, Allah memuji-muji keduanya menghilangkan berbagai kekurangan yang menodai kejujurannya seraya berfirman, “Dan al-Qur’an itu buknlah perkataan setan yang terkutuk,” yakni setan itu amat jauh dari Allah dan jauh dari (status) kedekatan terhadapNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَمَا هُوَ } Dan Al-Qur'an ini { بِقَوْلِ شَيْطَانٍ رَجِيمٍ } sekali-kali bukanlah perkataan setan seperti yang kalian katakan wahai orang-orang kafir, dan { رَجِيمٍ } yakni yang dijauhkan ( dari rahmat Allah ), maka bagaimana mungkin setan yang dijauhkan dari rahmat Allah bisa mendekati Al-Qur'an yang suci dan mulia ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَجِيمٍ “Dan Al Qur'an itu bukanlah perkataan setan yang terkutuk,” Maknanya: Al-Quran bukanlah perkataan salah satu setan-setan, para dukun yang mendapatkan wangsit dari setan-setan yang berdusta kepada mereka, kemudian dukun-dukun itu memberitakan kepada manusia, dan mereka menyangka para dukun itu berkata jujur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 25: 23-25. Kemudian Allah bersumpah bahwa Nabi ﷺ melihat Jibril dalam bentuk aslinya yang Allah ciptakan atasnya. Ia (Jibril) nampak di ufuk timur ketika terbitnya matahari. Dan Allah bersumpah bawasanya Muhammad ﷺ bukanlah orang yang bakhil (pelit) dengan apa yang mestinya ia sampaikan (kepada umat) dan tidak juga orang yang dicurigai atau selainnya. Ketahuilah olehmu ! Bahwa apa yang diucapkan oleh Muhammad ﷺ adalah Al Qur’an Al Karim, bukan ucapan yang dilemparkan oleh setan atas lisan Muhammad ﷺ sebagaimana kalian klaim dan tuduh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keutamaan kitab-Nya dan memuliakannya dengan menyebutkan dua makhluk yang mulia yang membawanya yang kemudian disampaikan kepada manusia, dan setelah Allah Subhaanahu wa Ta'aala memuji kedua utusan itu serta membersihkan Al Qur’an dari segala cacat dan kekurangan yang dapat menodai kebenarannya, maka Allah Subhaanahu wa Ta'aala berfirman, “Dan (Al Qur'an) itu bukanlah perkataan setan yang terkutuk,”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 25",
    "description": "Dan Al-Qur'an itu bukanlah perkataan setan yang terkutuk. Ada perbedaan nyata antara Al-Qur'an dan perkataan setan. Al-qur'an mengajarkan nilai-nilai kebenaran dan keadilan, sedangkan setan mengajak kepada kebatilan, kemaksiatan, dan kemungkaran. 26. Maka, ke manakah kamu akan pergi' jalan mana yang akan kamu pilih untuk menemukan kebenaran' tidak ada yang lebih terang daripada jalan yang dijelaskan oleh Al-Qur'an."
  }
]