[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-29. Dimana akal kalian saat kalian mendustakan al-qur’an setelah argument-argument yang kuat ini? Al-qur’an adalah nasihat bagi seluruh manusia, Yaitu bagi siapa yang berkenan dari kalian untuk berjalan lurus diatas kebenaran dan iman. Kalian tidak sanggup beristiqamah dan tidak menghendakinya kecuali dengan kehendak Allah tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Maka alasan apalagi yang kalian gunakan untuk mengingkari bahwa Al-Qur`ān ini dari Allah setelah hujah-hujah ini?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-29. Maka jalan mana yang akan kalian tempuh untuk mendustakan al-Qur’an setelah mendapat menjelasan yang jelas ini? Al-Qur’an ini merupakan peringatan bagi kalian -hai para jin dan manusia-; yaitu bagi orang yang hendak beristiqamah di atas jalan yang benar. Dan kalian tidak akan menghendakinya melainkan jika Allah Tuhan semesta alam menghendakinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَأَيْنَ تَذْهَبُونَ (maka ke manakah kamu akan pergi?) Yakni jalan mana yang dapat kalian tempuh yang paling jelas daripada jalan yang telah aku jelaskan bagi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Maka kemana lagi kamu akan pergi setelah kalian mengingkari Al-quran?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka, ke manakah kalian akan pergi} maka jalan manakah yang akan kalian gunakan untuk mendustakan Al-Qur'an setelah dalil-dalil ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 26 “Maka kemanakah kamu akan pergi,” yakni, bagaimanakah hal ini terlintas di benak kalian. Kemanakah hilangnya akal kalian hingga kalian menjadikan kebenaran yang merupakan tingkat kejujuran tertinggi sebagai kedustaan yang merupakan tingkat kebatilan terendah? Ini tidak lain kecuali karena memutarbalikkan kebeneran."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mana bukti-bukti kalian atas apa yang kalian katakan tentang Al-Qur'an, bukti apa yang dapat kalian perlihatkan perihal Rasulullah dan Jibril seperti yang kalian dustakan tentangnya, mereka sama sekali tidak memiliki bukti dan dalil atas perkataan mereka itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَأَيْنَ تَذْهَبُونَ (26) إِنْ هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ “maka ke manakah kalian akan pergi? Al Qur'an itu tiada lain hanyalah peringatan bagi semesta alam,” إن [In] di sini bermakna huruf ما [Maa] yang berfungsi sebagai nafiyah [peniadaan] karena إن [In] bisa berfungsi sebagai nafiyah, bisa juga berfungsi syarthiyah dan juga bisa bentuk mukhaffafah dari huruf Inna yang bertasydid, yang bisa membedakan makna-makna ini adalah konteks kalimat. Jika إن datang setelah Illa Maka ia bermakna nafiyah (peniadaan), maknanya: Tidaklah al-Quran yang dibawa oleh Muhammad shallallaahu ‘alaihi wa sallam dan Jibril turun dengannya pada hatinya, إِلَّا ذِكْرٌ لِلْعَالَمِينَ “hanyalah peringatan bagi semesta alam,” Dzikir di sini maknanya pengingat atau pembelajaran, yaitu al-Quran adalah pengingat dan pembelajaran untuk seluruh alam. Yaitu bahwa mereka belajar dan mengambil pelajaran dengan al-Quran, yang dimaksud seluruh alam di sini adalah siapa pun yang diutus kepadanya Rasulullah shallallaahu ‘alaihi wa sallam sebagaimana Allah Ta’ala berfirman: وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ “Dan tiadalah Kami mengutus kamu, melainkan untuk (menjadi) rahmat bagi semesta alam.” (QS. Al-Anbiya: 107) Allah Ta’ala juga berfirman: تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا “Maha Suci Allah yang telah menurunkan Al-Furqaan (Al Qur'an) kepada hamba-Nya, agar dia menjadi pemberi peringatan kepada seluruh alam,” (QS. Al-Furqan: 1) Maka yang dimaksudkan dengan al-‘Aalamiin di sini adalah orang-orang yang diutuk kepada mereka Muhamma shallallaahu ‘alaihi wasallam"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 26: Kemudian Allah tegur mereka : Jalan mana lagi yang akan kalian tempuh untuk kebohongan kalian pada Al Qur’an ini wahai orang-orang musyrik ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, setelah diterangkan bahwa Al Quran itu benar-benar datang dari Allah dan di dalamnya berisi pelajaran dan petunjuk yang memimpin manusia ke jalan yang lurus dengan diperkuat bukti-buktinya, ditanyakanlah kepada orang-orang kafir itu, \"Maka ke manakah kamu akan pergi?” Padahal tidak ada setelah kebenaran selain kebatilan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 26",
    "description": "Maka, ke manakah kamu akan pergi' jalan mana yang akan kamu pilih untuk menemukan kebenaran' tidak ada yang lebih terang daripada jalan yang dijelaskan oleh Al-Qur'an. 27. Al-qur'an itu tidak lain adalah peringatan bagi seluruh alam. Al-qur'an menjelaskan segala sesuatu untuk kebaikan manusia, baik urusan dunia maupun akhirat; mereka yang berbuat baik akan mendapat pahala dan surga, dan yang berbuat jahat akan mendapat dosa dan neraka."
  }
]