[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-29. Dimana akal kalian saat kalian mendustakan al-qur’an setelah argument-argument yang kuat ini? Al-qur’an adalah nasihat bagi seluruh manusia, Yaitu bagi siapa yang berkenan dari kalian untuk berjalan lurus diatas kebenaran dan iman. Kalian tidak sanggup beristiqamah dan tidak menghendakinya kecuali dengan kehendak Allah tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Tidaklah Al-Qur`ān itu melainkan peringatan dan nasihat bagi jin dan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعٰلَمِينَ (Al Quran itu tiada lain hanyalah peringatan bagi semesta alam) Yakni al-Qur’an adalah pelajaran dan peringatan bagi seluruh makhluk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "27-28 1 ) Pada kedua ayat ini isyarat bahwasanya orang-orang yang tidak ingin menjadikan Al-Qur'an sebagai peringatan, tidak ada penghalang bagi mereka untuk itu kecuali hanya diri mereka sendiri yang tidak menginginkan berada dalam garis yang lurus, bahkan mereka ridho dengan diri mereka sendiri terjerumus kedalam kesesatan dan penyimpangan agama, dan barangsiapa yang ridho terhadap dirinya pada kesesatan, maka ia akan dijauhkan dari hidayah Allah : { فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ } ( Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka; dan Allah tidak memberi petunjuk kepada kaum yang fasik. ) [ As-Shaf : 5 ] . 2 ) Pada ayat ini { لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ } juga isyarat bahwasnya menimbang perkara agama dengan timbangan keadaan sebagian kaum muslimin atau sebagian besar dari mereka adalah sebuah kesalahan ( sebagiamana yang dilakukan oleh orang-orang yang memiliki pandangan yang pendek dari kalangan orang-orang barat dan semisalnya ) , mereka menjadikan akal mereka sebagai tolak ukur untuk mengatasi permasalahan ummat islam, kemudian mereka menyimpulkan dari hasil penelitian mereka hukum-hukum umum untuk dijadikan sebagai landasan ideologi mereka tentang agama islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Al-quran ini hanyalah peringatan dan nasihat untuk seluruh alam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Al-Qur’an) itu tidak lain} Al-Qur'an itu tidak lain {kecuali peringatan} pelajaran {bagi semesta alam} jin dan manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "“Al-Qur’an itu tiada lain hanyalah peringatan bagi semesta alam.” Dengan al-Qur’an mereka ingat Rabb mereka, sifat-sifat sempurnaNya serta terhindarNya Dia dari berbagai kekurangan, kehinaan, dan kesurupan. Mereka juga ingat akan perintah-perintah dan larangan-larangan serta hikmahnya. Dengan al-Qur’an, mereka ingat hukum-hukum takdir, hukum-hukum syari’at, dan hukum-hukum balasan. Secara garis besar, al-Qur’an mengingatkan mereka pada kepentingan dunia akhirat, dan dengan mengamalkannya, mereka mendapatkan kebahagiaan dunia dan akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Al Qur'an itu tidak lain kecuali sebagai nasehat bagi seluruh alam, Allah tidak mengatakan bahwa Al Qur'an itu hanya untuk kalangan arab saja, atau hanya untuk orang-orang Makkah saja, akan tetapi Al Qur'an itu diturunkan dan diwahyukan kepada Nabi Muhammad ﷺ sebagai pegangan hidup bagi seluruh ummat manusia di penjuru dunia, maka barang siapa Yang mengimaninya niscaya Al Qur'an itu akan menjadi penolong baginya di hari kiamat, dan barang siapa yang menolak untuk beriman kepadanya, maka sesungguhnya Al-Qur'an itu akan menjadi musuh baginya di hari kiamat kelak."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَأَيْنَ تَذْهَبُونَ (26) إِنْ هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ “maka ke manakah kalian akan pergi? Al Qur'an itu tiada lain hanyalah peringatan bagi semesta alam,” إن [In] di sini bermakna huruf ما [Maa] yang berfungsi sebagai nafiyah [peniadaan] karena إن [In] bisa berfungsi sebagai nafiyah, bisa juga berfungsi syarthiyah dan juga bisa bentuk mukhaffafah dari huruf Inna yang bertasydid, yang bisa membedakan makna-makna ini adalah konteks kalimat. Jika إن datang setelah Illa Maka ia bermakna nafiyah (peniadaan), maknanya: Tidaklah al-Quran yang dibawa oleh Muhammad shallallaahu ‘alaihi wa sallam dan Jibril turun dengannya pada hatinya, إِلَّا ذِكْرٌ لِلْعَالَمِينَ “hanyalah peringatan bagi semesta alam,” Dzikir di sini maknanya pengingat atau pembelajaran, yaitu al-Quran adalah pengingat dan pembelajaran untuk seluruh alam. Yaitu bahwa mereka belajar dan mengambil pelajaran dengan al-Quran, yang dimaksud seluruh alam di sini adalah siapa pun yang diutus kepadanya Rasulullah shallallaahu ‘alaihi wa sallam sebagaimana Allah Ta’ala berfirman: وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ “Dan tiadalah Kami mengutus kamu, melainkan untuk (menjadi) rahmat bagi semesta alam.” (QS. Al-Anbiya: 107) Allah Ta’ala juga berfirman: تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا “Maha Suci Allah yang telah menurunkan Al-Furqaan (Al Qur'an) kepada hamba-Nya, agar dia menjadi pemberi peringatan kepada seluruh alam,” (QS. Al-Furqan: 1) Maka yang dimaksudkan dengan al-‘Aalamiin di sini adalah orang-orang yang diutuk kepada mereka Muhamma shallallaahu ‘alaihi wasallam"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 27: 27-28. Dan Allah jelaskan bahwa Al Qur’an ini adalah petuah (nasihat) bagi seluruh makhluk, dan sebagai peringatan bagi siapa yang istiqamah di atas kebenaran, keimanan, dan ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan Al Qur’an, mereka dapat mengingat Tuhan mereka, sifat-sifat sempurna yang dimiliki-Nya, bersihnya Dia dari segala kekurangan dan tandingan. Demikian pula dengan Al Qur’an, mereka dapat mengingat perintah dan larangan-Nya, mengingat hukum-hukum qadari-Nya, hukum-hukum syar’i-Nya dan hukum-hukum jaza’i(balasan)-Nya. Singkatnya, dengan Al Qur’an, mereka dapat mengenal dan mengingat segala yang bermaslahat bagi mereka di dunia dan akhirat, dan dengan mengamalkannya mereka akan memperoleh kebahagiaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 27",
    "description": "Al-qur'an itu tidak lain adalah peringatan bagi seluruh alam. Al-qur'an menjelaskan segala sesuatu untuk kebaikan manusia, baik urusan dunia maupun akhirat; mereka yang berbuat baik akan mendapat pahala dan surga, dan yang berbuat jahat akan mendapat dosa dan neraka. 28. Peringatan Al-Qur'an itu ditujukan bagi siapa di antara kamu yang menghendaki menempuh jalan yang lurus, yaitu agama islam, dan beristikamah dalam mengamalkan ajarannya."
  }
]