[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-29. Dimana akal kalian saat kalian mendustakan al-qur’an setelah argument-argument yang kuat ini? Al-qur’an adalah nasihat bagi seluruh manusia, Yaitu bagi siapa yang berkenan dari kalian untuk berjalan lurus diatas kebenaran dan iman. Kalian tidak sanggup beristiqamah dan tidak menghendakinya kecuali dengan kehendak Allah tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Bagi siapa di antara kalian yang ingin istikamah di atas jalan kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "27-28 1 ) Pada kedua ayat ini isyarat bahwasanya orang-orang yang tidak ingin menjadikan Al-Qur'an sebagai peringatan, tidak ada penghalang bagi mereka untuk itu kecuali hanya diri mereka sendiri yang tidak menginginkan berada dalam garis yang lurus, bahkan mereka ridho dengan diri mereka sendiri terjerumus kedalam kesesatan dan penyimpangan agama, dan barangsiapa yang ridho terhadap dirinya pada kesesatan, maka ia akan dijauhkan dari hidayah Allah : { فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ } ( Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka; dan Allah tidak memberi petunjuk kepada kaum yang fasik. ) [ As-Shaf : 5 ] . 2 ) Pada ayat ini { لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ } juga isyarat bahwasnya menimbang perkara agama dengan timbangan keadaan sebagian kaum muslimin atau sebagian besar dari mereka adalah sebuah kesalahan ( sebagiamana yang dilakukan oleh orang-orang yang memiliki pandangan yang pendek dari kalangan orang-orang barat dan semisalnya ) , mereka menjadikan akal mereka sebagai tolak ukur untuk mengatasi permasalahan ummat islam, kemudian mereka menyimpulkan dari hasil penelitian mereka hukum-hukum umum untuk dijadikan sebagai landasan ideologi mereka tentang agama islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Yaitu bagi kalian yang menghendaki untuk berpegang teguh kepada jalan yang terang dengan mengikuti kebenaran dan beriman kepada Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) bagi siapa saja di antara kalian yang menghendaki jalan yang lurus} mengikuti dan menegakkan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "“(Yaitu) bagi siapa di antara kamu yang mau menempuh jalan yang lurus,” setelah jelas antara petunjuk dan kesesatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Al-Qur'an sebagai pedoman bagi seluruh alam, yakni bagi siapapun yang ingin berada dijalan yang lurus dan menginginkan petunjuk dari Allah, Allah berfirman : { إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ } ( Sesungguhnya Al Quran ini memberikan petunjuk kepada (jalan) yang lebih lurus ) [ Al Isra' : 9 ] , maka barangsiapa yang menginginkan petunjuk hendaklah ia menjadikan Al Qur'an sebagai pegangan, dan menjauh dari segala hal yang bertentangan dengan Al Qur'an, seperti perkataan para filsuf, dan lainnya yang setara dengan mereka. { لِمَنْ شَاءَ } bagi yang menginginkannya, pada kalimat ini difahami bahwasanya setiap hamba dapat memilih apakah ia berkeinginan menjadi hamba yang baik ataupun sebaliknya, dan ayat ini pula merupakan bantahan terhadap perkataan kelompok al-jabariyah yang mengatakan bahwasanya setiap manusia dikpaksa untuk melaksanakan segala perintah yang ada didalam Al-Qur'an dan tiada pilihan bagi mereka untuk menentukan jalan yang mereka tempuh, akan tetapi dengan adanya ayat ini perkataan mereka terbantahkan, maka barangsiapa yang belum berkeinginan menjadi insan yang taat maka baginya apa yang ia tentukan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ “(yaitu) bagi siapa di antara kamu yang mau menempuh jalan yang lurus.”لِمَنْ شَاءَ “(yaitu) bagi siapa di antara kamu yang mau” Jumlah (susunan kalimat) ini adalah badal (kalimat ulang yang berfungsi penjelas) dari yang sebelumnya, namun akan terlihat jika ‘amilnya diulang, yaitu إلا[Illa] seakan akan Allah berfirman إِنْ هُوَ إِلَّا ذِكْرٌ لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ “Tidaklah itu melainkan pengingat bagi di antara kalian yang mau istiqomah (menempuh jalan yang lurus)” Maka dalam ayat ini ada pengkhususan (yaitu yang mau istiqomah) setelah penyebutan umum (yaitu seluruh alam). Adapun orang yang tidak menghendaki dirinya istiqomah maka ia tidak dapat mengambil pelajaran dan manfaat dari al-Quran sebagaimana Allah berfirman: إِنَّ فِي ذَلِكَ لَذِكْرَى لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ “Sesungguhnya pada yang demikian itu benar-benar terdapat peringatan bagi orang-orang yang mempunyai hati atau yang menggunakan pendengarannya, sedang dia menyaksikannya.”(QS. Qaf: 37)Maka insan yang tidak ingin istiqomah, ia tidak akan bisa mengambil manfaat dari Al-Quran. Akan tetapi jika ada orang yang bertanya: Apakah kehendak manusia sesuai dengan pilihannya? Kita jawab: Ya, kehendak manusia sesuai dengan pilihannya. Allah ‘Azza Wa Jalla juga memberikan manusia pilihan dan kehendak, jika ia berkehendak maka ia lakukan, dan jika tidak, dia tidak melakukannya. Karena jika tidak begitu, maka hujjah tidak akan tegak kepada manusia yang diutus kepada mereka para rasul, dengan diutusnya para rasul (tidak ada faedahnya jika manusia tidak diberi pilihan). Apa-apa yang kita kerjakan itu semua atas dasar pilihan dan kehendak kita. Kalau kita tidak bisa memilih maka diutusnya rasul tidak bisa menjadi hujjah buat kita. Tidak diragukan bahwa manusia melakukan perbuatan sesuai pilihannya, semua manusia mengetahui bahwa bila ia hendak pergi ke Mekkah maka itu sesuai pilihannya, bila ia hendak pergi ke Madinah maka itu sesuai pilihannya, bila ia hendak pergi ke Baitulmaqdis maka itu sesuai pilihannya, bila ia hendak pergi ke Riyadh maka itu sesuai pilihannya atau ia hendak pergi kemana pun ia mau, maka itu semua seusai keinginannya dia tidak melihat dan merasakan ada seorang pun yang memaksanya. Begitu juga orang yang hendak melakukan ketaatan kepada Allah maka itu sesuai kehendaknya dan orang yang ingin melakukan kemaksiatan kepada Allah maka itu pun sesuai pilihannya. Manusia memiliki kehendak dan kita yakin bahwa ia tidak lah menghendaki sesuai kecuali itu adalah kehendak Allah dari sebelumya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 28: 27-28. Dan Allah jelaskan bahwa Al Qur’an ini adalah petuah (nasihat) bagi seluruh makhluk, dan sebagai peringatan bagi siapa yang istiqamah di atas kebenaran, keimanan, dan ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah jelas mana yang benar dan mana yang salah, petunjuk daripada kesesatan. Dalam ayat ini terdapat bantahan terhadap golongan Jabriyyah yang mengatakan bahwa manusia tidak memiliki kehendak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 28",
    "description": "Peringatan Al-Qur'an itu ditujukan bagi siapa di antara kamu yang menghendaki menempuh jalan yang lurus, yaitu agama islam, dan beristikamah dalam mengamalkan ajarannya. 29. Hanya saja, keinginan seseorang untuk berbuat sesuatu tidak akan terlaksana kecuali jika Allah menghendaki. Dan kamu tidak dapat menghendaki menempuh jalan itu kecuali apabila dikehendaki Allah, tuhan seluruh alam."
  }
]