[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-29. Dimana akal kalian saat kalian mendustakan al-qur’an setelah argument-argument yang kuat ini? Al-qur’an adalah nasihat bagi seluruh manusia, Yaitu bagi siapa yang berkenan dari kalian untuk berjalan lurus diatas kebenaran dan iman. Kalian tidak sanggup beristiqamah dan tidak menghendakinya kecuali dengan kehendak Allah tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan tidaklah kalian mampu berkehendak untuk istikamah atau berkehendak lainnya kecuali bila Allah -Rabb segala makhluk- berkehendak demikian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَمَا تَشَآءُونَ إِلَّآ أَن يَشَآءَ اللَّـهُ رَبُّ الْعٰلَمِينَ (Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah, Tuhan semesta alam) Yakni tidaklah kalian menghendaki atau mampu untuk beristiqamah kecuali dengan kehendak dan taufik dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Kamu sekali-kali tidak akan bisa menempuh jalan lurus itu kecuali hanya ketika Allah menghendaki itu padamu. Dia-lah Penguasa seluruh makhluk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian tidak dapat berkehendak, kecuali apabila dikehendaki Allah, Tuhan semesta alam} Tuhan semua makhluk."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 29 “Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah, Rabb semesta alam,” yakni, kehendak Allah pasti terlaksanan, tidak mungkin dicegah dan dihalangi. Dalam ayat ini dan ayat-ayat serupa terdapat bantahan untuk golongan yang menafikan takdir dan golongan yang menyatakan bahwa manusia dipaksa melakukan segala sesuatu sebagaimana contohnya telah dijelaskan sebelumnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kehendak hamba itu mengikuti kehendak Allah ﷻ, dan ayat ini merupakan bantahan atas pemahaman para pengikut \"al-qodariyah'' dari golongan ''al-mu'tazilah'' yang mengatakan : Setiap hamba memiliki keinginan tersendiri, dan keinginan itu tidak ada campur tangan dari Allah ﷻ. Dan orang-orang yang berada dalam kebenaran mengatakan : Setiap hamba memiliki keinginan ataupun kehendak akan tetapi keinginan itu mengikuti keinginan dan kehendak Allah ﷻ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya Allah berfirman: وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ “Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah,” Tidaklah kita menghendaki sesuatu melainkan itu sudah dikehendaki Allah sebelumnya. Jika kita sudah menghendaki sesuatu kita tahu itu juga atas kehendak Allah, kalau bukan karena kehendak Allah maka itu tidak bisa kita realisasikan, sebagaimana Allah Ta’ala berfirman: وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلَ الَّذِينَ مِنْ بَعْدِهِمْ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ وَلَكِنِ اخْتَلَفُوا فَمِنْهُمْ مَنْ آمَنَ وَمِنْهُمْ مَنْ كَفَرَ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلُوا “Dan kalau Allah menghendaki, niscaya tidaklah berbunuh-bunuhan orang-orang (yang datang) sesudah rasul-rasul itu, sesudah datang kepada mereka beberapa macam keterangan, akan tetapi mereka berselisih, maka ada di antara mereka yang beriman dan ada (pula) di antara mereka yang kafir. Seandainya Allah menghendaki, tidaklah mereka berbunuh-bunuhan.”(QS. Al-Baqoroh: 253) Jika kita melakukan sesuatu maka kita tahu bahwa itu sesuai dengan kehendak dan pilihan kita, akan tetapi kita tahu bahwa kehendak dan pilihan kita tersebut dapat terwujud setelah kehendak Allah ‘Azza Wa Jalla, kalau bukan karena kehendak Allah maka kita tidak bisa berbuat apa pun. Jika ada yang mengatakan: Kalau begitu kita punya hujjah (alasan) dalam melakukan kemaksiatan, karena kita tidak berkehendak bermaksiat kecuali setelah dikehendaki Allah. Jawabannya: Tidak ada hujjah (alasan) bagi kita, karena kita tidak tahu bahwa Allah telah menghendakinya kecuali setelah kita lakukan, dan kita lakukan berdasarkan pilihan kita, oleh karena itu, tidak mungkin kita mengatakan Allah telah menghendaki demikian kecuali setalah itu terjadi, jika telah terjadi maka mengapa itu bisa terjadi? Itu terjadi karena keinginan dan kehendak kita. Maka dari itu tidak mungkin bagi pelaku maksiat mempunyai hujjah kepada Allah ‘Azza Wa Jalla, Allah telah membantah hujjah ini dalam firman-Nya: سَيَقُولُ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا أَشْرَكْنَا وَلَا آبَاؤُنَا وَلَا حَرَّمْنَا مِنْ شَيْءٍ كَذَلِكَ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ حَتَّى ذَاقُوا بَأْسَنَا “Orang-orang yang mempersekutukan Allah, akan mengatakan: \"Jika Allah menghendaki, niscaya kami dan bapak-bapak kami tidak mempersekutukan-Nya dan tidak (pula) kami mengharamkan barang sesuatu apa pun\". Demikian pulalah orang-orang yang sebelum mereka telah mendustakan (para rasul) sampai mereka merasakan siksaan Kami.”(QS. Al-An’am: 148) Kalau saja mereka tidak tidak punya hujjah (kalau mereka punya hujjah) maka mereka tidak akan merasakan siksa Allah, dan pasti mereka akan selamat dari siksa Allah. Namun mereka tidak memiliki hujjah, maka mereka akan merasakan siksa Allah. Kita semua tahu jika ada seseorang ditawarkan bahwa ada negeri aman dan tentram, rejekinya mengalir di seluruh penjuru negeri itu, di dalamnya terdapat mata pencaharian yang tidak didapati di negeri lainnya, dan ada negeri satunya, negeri yang menakutkan tidak tentram, perekonomiannya goncang dan keamanannya tidak stabil, maka ia akan pergi ke negeri yang mana? Tentu pasti dia akan pergi ke negeri yang pertama murni kerena keinginannya sendiri, begitu juga dalam memilih jalan kebaikan dan jalan keburukan. Allah telah menjelaskan kepada kita, ini jalan ke neraka jahannam, ini jalan ke surga. Allah juga menjelaskan kepada kita tentang kenikmatan yang ada disurga, dan juga tentang azab neraka, maka yang mana yang akan kita tempuh? Tentu sangat jelas pasti kita akan menempuh jalan ke surga tanpa ragu, sebagaimana dalam contoh sebelumnya kita akan menempuh jalan menuju negeri yang aman yang menghasilkan rejeki yang lancar di setiap penjurunya. Jika saja yang kita tempuh adalah jalan ke neraka maka kita akan memperoleh celaan dan kehinaan. Kita akan dipanggil dengan sebutan bodoh, sebagaimana jika kita menempuh jalan ke negeri yang menakutkan, goncang yang tidak ada ketentraman di dalamnya, maka setiap orang akan mencela dan menycibir kita. Sehingga, dalam firman Allah ta’ala: لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ “(yaitu) bagi siapa di antara kamu yang mau menempuh jalan yang lurus.” terdapatpenetapan bahwa manusia melakukan sesuatu dengan kehendak dan keinginannya, namun setelah ia melakukan dan menghendaki sesuatu itu kita tahu bahwa Allah telah menghendakinya sebelumnya, seandainya Allah berkehendak lain maka tidak mungkin ia dapat mengerjakannya. Dan banyak hal yang seorang manusia telah bertekad sesuatu, dan menuju ke tekadnya itu, namun tidak lama kemudian dia berpaling darinya atau dipalingkan darinya, karena Allah tidak menghendakinya. Kita banyak menginginkan pergi ke Masjid untuk mendengarkan ceramah, tiba tiba kita pergi karena ada suatu sebab atau tanpa sebab, terkadang sebabnya kita ingat bahwa kita punya kesibukan lain sehingga kita pulang, dan terkadang kita pulang tanpa sebab, kita tidak tahu melainkan karena Allah telah memalingkan keinginan kita darinya maka kita pun pulang. Oleh karena itu jika orang arab badui di tanya: Dengan apa engkau mengenal Rabb-Mu? Ia akan menjawab: Dengan dihilangkannya tekad-tekad dan dipalingkannya keinginan kita. Dengan dihilangkannya tekad-tekad: Yakni seorang manusia bertekad sesuatu dengan tekan yang kuat, tiba tiba tekad itu hilang! Siapa yang menghilangkan tekadnya itu, dia tidak merasakannya, bahwa di sana yang mendorongnya yang mengharuskan ia meniadakan tekad awalnya itu, itu adalah murni kehendak Allah. Dipalingkannya keinginan kita: Insan menginginkan sesuatu ia menuju kepadanya dengan sempurna, tiba-tiba ia mendapati dirinya berpaling dari itu, baik yang memalingkannya itu berupa penghalang yang dapat ia rasakan dengan indranya atau bisa juga hanya sekedar pilihannya, pilihan untuk tidak meneruskannya. Semua itu murni dari Allah ‘Azza Wa Jalla. Kesimpulannya: Bahwa Allah berfirman: لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ “(yaitu) bagi siapa di antara kamu yang mau (istiqomah) menempuh jalan yang lurus.” Istiqomah adalah keadilan (keseimbangan) dan tidak ada keadilan yang lebih lurus daripada keadilan Allah ‘Azza Wa Jalla dalam syari’at-Nya. Syari’at-syari’at terdahulu itu menyesuaikan dengan kondisi, waktu dan keadaan umat-umat terdahulu, dan setelah diutusnya Rasulullah ‘alaihissholaatu wassalaam, maka syari’at pasti sesuai dengan umat diutusnya Nabi shallallaahu ‘alaihi wa sallam dari sejak awal diutusnya beliau hingga dunia ini berakhir. Oleh karena itu, ada ungkapan yang dikenal mengatakan: “Bahwa agama islam baik untuk setiap zaman, tempat dan keadan”. Seandainya manusia berpegang dengannya maka pasti Allah akan memperbaiki manusia. Misalnya, Coba perhatikan, pertama-tama ia harus solat dengan berdiri, jika tidak mampu maka duduk, jika tidak mampu maka berbaring, dengan begitu syari’at ini berkembang sesuai dengan kondisi seseorang, karena agama baik untuk setiap waktu, tempat dan keadaan. Seorang yang tidak dalam kondisi suci bersuci wajib bersuci dengan air, kalau tidak mampu menggunakan air karena sakit atau tidak ada air maka ia boleh bertayammum, jika tidak mampu, tidak ada debu, atau tidak bisa mengenakan debu maka ia tetap sholat tanpa sesuatu, tanpa bersuci dengan air juga tanpa bersuci dengan tayammum. Semua ini dikarenakan syari’at Allah ‘Azza Wa Jalla dibangun di atas keadilan, tidak ada unsur semena-mena dan kezaliman di dalamnya, tanpa dan tekananan dan yang memberatkan/ oleh karenanya Allah berfirman: أَنْ يَسْتَقِيمَ “yang mau (istiqomah) menempuh jalan yang lurus.” sedangkan kebalikan dari istiqomah adalah inhiraf (menyimpang) yang terbagi menjadi dua: penyimpangan berupa belebihan dan ghuluw, dan penyimpangan berupa bermudah-mudah dan menyepelekan. Oleh karena itu manusia dalam menyikapi agama Allah ‘Azza Wa Jalla ada tiga macam: Dua macam dan yang tengah-tengah, ada yang berlebihan, guluw, memaksakan dan memberat-beratkan, dan ada yang mnggampangkan, menyepelekan dan bermudah-mudah, dan yang ketiga adalah yang tengah-tengah antara yang berlebihan dengan yang bermudah-mudah, lurus di atas agama Allah, inilah yang terpuji. Adapun yang berlebihan dan yang bermudah-mudah keduanya binasa sesuai kadar berlebihan dan bermudah-mudahannya. Nabi shallallaahu ‘alaihi wa sallam melarang berlebihan, melampaui, memaksakan diri (dalam agama) sehingga beliau bersabda: هَلَكَ الْمُتَنَطِّعُوْنَ، هَلَكَ الْمُتَنَطِّعُوْنَ، هَلَكَ الْمُتَنَطِّعُوْنَ “ Binasalah orang-orang yang memaksakan diri, binasalah orang-orang yang memaksakan diri ”(1) karena memaksakan diri mengandung unsur memberatkan diri di dalamnya terdapat unsur keluar dari agama Allah ‘Azza Wa Jalla. Sebagaimana beliau juga mencela orang yang melalaikan dan bemudah-mudah, Allah berfirman dalam mensifati orang-orang munafik: وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَى “Dan apabila mereka berdiri untuk salat mereka berdiri dengan malas.” (QS. An-Nisa: 142) Agama Allah pertengahan antara berlebihan dengan bermudah-mudah, oleh karenanya Allah di sini berfirman: لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ “(yaitu) bagi siapa di antara kamu yang mau (istiqomah) menempuh jalan yang lurus.” tidak condong baik ke kiri mau pun ke kanan. Sehingga berjalan dengan seimbang di atas agama Allah ‘Azza Wa Jalla. Selain berlaku saat berinteraksi dengan Al-Khaliq ‘Azza wa Jalla, yaitu dalam ibadah, istiqamah juga harus diterapkan saat bermu’amalah dengan makhluk, maka hendaknya engkau berinteraksi dengan orang-orang dengan sikap pertengahan, antara sikap keras, kasar dan garang dengan sikap santai, mengalah dan merendah, jadilah seorang yang tegas dalam suatu kondisi dan jadilah orang yang lembut pada kondisi yang lain. Oleh karenanya para Fuqoha rahimahumullah berkaitan dengan hakim, mengatakan: “Hendaknya ia lembut tanpa menunjukkan kelemahan, kuat tanpa kekerasan” Sehingga kelembutannya tidak terlampau hingga lemah dan kekuatannya tidak terlampai hingga kasar, namun pertengahan keduanya, lembut tidak lemah dan kuat tanpa harus kasar sehingga perkaranya lurus. Sebagian memperlakukan orang lain dengan kekerasan, kasar dan memandang dirinya lebih tinggi dari orang lain, dan orang lain lebih rendah darinya. Ini adalah kekeliruan. Sebagian orang juga ada yang merendahkan dirinya sampai-sampai kerendahannya itu malampaui batas diremehkan dan tidak peduli, sehingga ia tidah ada kehormatan di hadapan manusia, ini juga kesalahan. Seharusnya seorang insan memiliki karakter antara dua sifat yang bertentangan tersebut sebagaimana petunjuk Nabi shallallaahu ‘alaihi wa sallam. Sungguh beliau shallallaahu ‘alaihi wa sallam akan tegas di saat yang mengharuskannya tegas, dan bersikap lembut di saat yang semestinya lembut, maka seorang insan mengumpulkan antara sikap tegas, keras dengan sikap lembut, santun dan kasih sayang. (1) Dikeluarkan Muslim (2670) dari hadits Abdullah Bin Mas'ud radhiyallaahu 'anhu وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ “Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah,” Maknanya: Kalian tidak mungkin menghendaki terwujudnya sesuatu kecuali Allah telah menghendakinya sebelumnya, maka kehendak manusia tidak terjadi kecuali setelah kehendak Allah ‘Azza Wa Jalla, jikalau Allah menghendaki tidak akan terjadi, dan kalau Allah menghendaki sesuatu tidak terjadi pasti tidak akan terjadi walau pun anda menghendakinya, sampai pun kalau anda menghendakinya sedangkan Allah tidak menghendaki maka itu tidak akan pernah terjadi. Bahkan Allah Ta’ala akan mendatangkan sebab-sebab yang akan menghalangi anda dengan perkara itu sehingga tidak terjadi, ini adalah permasalahan yang harus diperhatikan oleh setiap insan, hendaknya mengetahui bahwa perbuatannya adalah kehendaknya sendiri secara utuh tanpa paksaan, namun kehendaknya ini terkait dengan kehendak Allah, ia mengetahui bahwa tidaklah ia menghendaki sesuatu kecuali setelah kehendak Allah, dan seandainya Allah berkehendak untuk tidak terjadi maka insan tidak mungkin mewujudkannya atau jika manusia tetap menghendakinya namun ia akan tehalangi dengan sebab-sebab dan penghalang-penghalang. رَبُّ الْعَالَمِينَ “Rabb semesta Alam” Mengandung isyarat kepada keumuman rububiyah Allah, dan bahwa rububiyah Allah mencakup segala sesuatu, namun perlu kita ketahui makna ‘Aalamiin pada ayat ini tidak sama dengan ‘aalamiin pada firman Allah إِنْ هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ “Al Qur'an itu tiada lain hanyalah peringatan bagi semesta alam\" Makna ‘Aalamiin yang pertama: ذِكْرٌ لِلْعَالَمِينَ “peringatan bagi semesta alam\" adalah orang-orang yang diutus rasul kepada mereka adapun pada ayat ini : رَبُّ الْعَالَمِينَ “Rabb semesta Alam” maka maksudnya adalah segala sesuatu selain Allah (makhluk), semua selain Allah maka itu disebut ‘aalam, karena tidak ada di sini kecuali Raabb (pencipta, pengatur) dan marbub. Jika dikatakan: Rabb al-‘aalamiin (semesta alam) maka pasti maknanya adalah segala sesuatu selain Allah, Sebagaimana dikatakan oleh al-Imam, Syaikhul Islaam Muhammad Bin Abdulwahhaab rahimahullah: “ dan segala sesuatu selain Allah disebut ‘aalam dan aku adalah salah satu dari ‘aalam ” Kesimpulannya: Bahwa Surat ini adalah surat yang agung, yang mengandung peringatan dan pelajaran yang selayaknya seorang mukmin membacanya dengan mentadabburinya, perlahan dan mengambil pelajaran dari kandungannya sebagaimana ini wajib ia lakukan di semua surat dan ayat dalam al-Quran, sehingga ia tergolong orang yang dapat mengambil pelajaran dan manfaat dari kitabullaah. Kita memohon kepada Allah Ta’ala agar memberikan pelajaran dengan kitab-Nya, petunjuk rasul-Nya shallallaahu ‘alaihi wa sallam dan tanda-tanda kebesaran-Nya yang nyata, sesungguhnya Dia Maha kuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 29: Ketahuilah oleh kalian ! Sesungguhnya kalian tidak akan mampu melakukan apapun kepada siapa yang istiqamah kecuali atas izin Allah, dan telah Allah muliakan atas hamba-hamba-Nya dan Allah jadikan mereka pilihan; Maka silahkan bagi yang ingin beriman silahkan beriman dan bagi yang ingin kafir silahkan kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kehendak-Nya berlaku, tidak mungkin ditolak atau dihalangi. Allah Subhaanahu wa Ta'aala menerangkan demikian, adalah agar manusia tidak bersandar kepada dirinya, bahkan hendaknya ia mengetahui bahwa hal itu terkait dengan kehendak Allah sehingga ia pun meminta kepada Allah hidayah-Nya kepada apa yang dicintai-Nya dan diridhai-Nya. Dalam ayat ini terdapat bantahan terhadap golongan Qadariyyah yang beranggapan bahwa manusia berkuasa mutlak terhadap tindakannya dan bahwa Allah sama sekali tidak berkuasa. Yang benar adalah jalan yang ditempuh Ahlussunnah wal jama'ah, di mana jalan tersebut merupakan jalan As Salafush Shalih, yakni bahwa manusia berbuat sesuai kehendak dan pilihannya, namun kehendak dan pilihannya mengikuti kehendak Allah Ta'ala, jika Dia menghendaki, maka akan terjadi perbuatan itu dan jika tidak menghendaki, maka tidak akan terjadi perbuatan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 29",
    "description": "Hanya saja, keinginan seseorang untuk berbuat sesuatu tidak akan terlaksana kecuali jika Allah menghendaki. Dan kamu tidak dapat menghendaki menempuh jalan itu kecuali apabila dikehendaki Allah, tuhan seluruh alam. 1-4. Ada empat peristiwa besar pada hari kiamat yang disebutkan di bagian awal surah ini, dari ayat 1 s. D. 4. Dua peristiwa yang pertama terjadi di langit dan sisanya di bumi. Apabila langit yang demikian besar dan kukuh terbelah, retak, kemudian digulung. Dan apabila bintang-bintang jatuh berserakan, keluar dari garis edarnya, dan berhamburan secara acak akibat hilangnya gaya tarik-menarik antar-benda angkasa. Dan apabila lautan dijadikan meluap, di mana batas antara satu laut dengan lainnya terbelah dan hancur sehingga air meluap. Air tawar dan asin pun menyatu, berkumpul menjadi lautan raksasa tak bertepi. Dan apabila kuburan-kuburan dibongkar sehingga mayat-mayat yang ada di dalamnya hidup kembali lalu berhamburan keluar tak tentu arah."
  }
]