[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-14. Apabila matahari digulung dan cahayanya lenyap. Dan apabila bintang-bintang berjatuhan dan cahayanya lenyap. Dan apabila gunung-gunung berterbangan diatas permukaan bumi,ia menjadi debu beterbangan. Dan apabila unta-unta bunting dibiarkan dan ditinggalkan. Dan apabila hewan-hewan buas dikumpulkan dan dicampur agar allah melakukan qishas untuk sebagian darinya atas sebagian yang lain. Dan apabila lautan dinyalakan dan ia berubah menjadi api besar yang berkobar. Dan apabila jiwa-jiwa disandingkan dengan padanan dan rekanannya. Dan apabila anak perempuan yang dikubur hidup-hidup ditanya pada hari kiamat untuk menenangkannya dan membuat menangis orang yang mengkuburkannya, “dosa apa yang membuatnya dikubur?” Dan apabila buku catatan amal disodorkan. Dan apabila langit di runtuhkan dan dilenyapkan dari tempatnya. Dan apabila api dinyalakan sehingga ia berkobar. Dan apabila surga yang penuh kenikmatan didekatkan kepada penghuninya,(yaitu orang orang yang bertakwa). Dan apabila semua ini terjadi, setiap jiwa yakin dan melihat apa yang dilakukannya, baik atau buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan jika anak perempuan yang pernah dikubur hidup-hidup ditanya oleh Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8-9. وَإِذَا الْمَوْءُۥدَةُ سُئِلَتْ ِأَىِّ ذَنۢبٍ قُتِلَتْ (dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya karena dosa apakah dia dibunuh) Dahulu orang Arab jika dikaruniai anak perempuan maka ia akan menguburnya hidup-hidup karena takut mendapat aib atau kemiskinan. pada hari kiamat anak itu akan ditanya sebagai olokan bagi pembunuhnya, sebab ia dibunuh tanpa dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8-9. Apabila bayi-bayi perempuan yang dipendam hidup-hidup itu ditanya: “Apa dosa kalian sehingga kalian dibunuh?” Ini adalah celaan bagi para pembunuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{apabila bayi-bayi perempuan yang dikubur hidup-hidup} bayi-bayi perempuan yang dikubur hidup-hidup {ditanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-14 Maknanya, bila hal-hal besar ini terjadi, manusia akan menjadi jelas perbedaannya (satu sama lain). Masing-masing mengetahui perbuatannya yang telah dilakukan untuk Hari Akhirat serta segala yang dilakukan, baik dan buruknya. Karena ketika Hari Kiamat terjadi, matahari digulung, rembulan dipadamkan cahayanya dan keduanya dlemparkan ke neraka. “Dan apabila bintang-bintang berjatuhan,” yakni berubah dan berguguran dari garis edarnya. “Dan apabila gunung-gunung dihancurkan,” yakni berubah menjadi tumpukan pasir yang beterbangan lalu berubah seperti kapas yang berhamburan lalu berubah kemudian menjadi debu beterbangan dan dilenyapkan dari tempatnya. “Dan apabila unta-unta yang bunting ditinggalkan (tidak diperdulikan),” artinya, pada hari itu manusia tidak lagi memperdulikan harta-harta mereka yang berharga yang dulunya mereka pedulikan dan mereka jaga setiap waktu. Lalu datanglah kengerian yang membuat mereka melalaikannya. Allah mengingatkan dengan unta-unta bunting yang merupakan harta paling berharga bagi bangsa Arab kala itu, tapi maknanya berlaku untuk semua barang yang berharga. “Dan apabila binatang-binatang liar dikumpulkan,” yakni dikumpulkan pada Hari Kiamat agar Allah menghukumi satu sama lain dan semua manusia mengetahui sempurnanya keadilan Allah hingga ia menghukum qishash pada kambing bertanduk untuk kambing yang tidak bertanduk seraya dikatakan padanya,. “Jadilah dabu” “Dan apabila lautan dipanaskan,” yaitu dinyalakan sehingga saking besarnya api yang dinyalakan. “Dan apabila ruh-ruh dipertemukan (dengan tubuh),” yakni setiap jiwa yang berbuat disandingkan pada padanannya; yang baik dipertemukan dangan yang baik dan yang keji dipertemukan dengan yang keji. Orang-orang yang beriman dinikahkan dengan bidadari bermata jeli sedangkan orang-orang kafir dinikahkan dengan setan-setan. Hal ini seperti yang disebutkan dalam Firman Allah, “Orang-orang kafir dibawa ke Neraka Jahanam bergerombol-gerombol.” (Az-Zumar:71) “Dan orang-orang yang bertakwa dibawa ke surga bergerombol-gerombol.” (Az-Zumar:73). “Kumpulkanlah orang-orang zhalim dan istri-istri mereka.” (Ash-Shaffat:22). “dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya,” tentang apa yang pernah dilakukan oleh orang-orang jahiliah dengan mengubur hidup-hidup anak perempuan tanpa sebab, hanya karena takut melarat. Ia ditanya , “karena dosa apakah dia dibunuh,” dan sebagaimana diketahui, ia tidak memiliki dosa apapun. Dalam ayat ini terdapat celaan bagi orang yang membunuhnya. “dan apabila catatan-catatan (amal perbuatan manusia),” yang mencakup semua pekerjaan yang dilakukan orang, baik dan buruknya “dibuka,” dan dibagikan untuk pemiliknya. Ada yang mengambil catatan amalnya dengan tangan kanan, ada yang mengambil dengan tangan kiri dan ada juga yang mengambil dari belakang punggung. “Dan apabila langit dilenyapkan,” yaitu diilenyapkan sebagaimana disebutkan dalam firman Allah yang lain “dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut dan diturunkanlah malaikat bergelombang-gelombang.” (Al-Furqon:25). “Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya padahal bumi seluruhnya dalam genggamannya pada hari kiamat dan langit digulung dengan tangan kananNya. Maha Suci Dia dan Maha Tinggi Dia dari apa yang mereka persekutukan.” (Az-Zumar:67). “Dan apabila Neraka Jahim dinyalakan,” yakni dinyalakan hingga berkobar hebat tidak seperti sedia kala. “Dan apabila surga didekatkan,” yakni didekatkan pada orang-orang yang bertakwa. “maka tiap-tiap jiwa akan mengetahui,” yaitu masing-masing jiwa karena disebutkan dalam konteks syarat, seperti yang disebutkan dalam Firman Allah, “Dan mereka menemukan apa yang mereka perbuat hadir.” (Al-Kahfi:49). Sifat-sifat Hari Kiamat yang disebutkan oleh Allah di atas adalah termasuk sifat-sifat yang menggetarkan jiwa dan semakin memperbesar musibah, membuat badan menggigil, menyebarkan rasa takut, dan mendorong orang-orang yang berakal agar mempersiapkan diri menghadapi hari itu serta melarang mereka melakukan segala sesuatu yang mengundang celaan. Karena itu ada orang salaf berkata, “barangsiapa yang ingin mempersiapkan diri untuk Hari Kiamat, seolah-olah ia telah melihatnya dengan mata kepala, hendaklah merenungkan ayat, “dan apabila matahari digulung.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan apabila bayi-bayi perempuan yang dikubur hidup-hidup sampai ia mati dibawah tanah, sebagaimana yang dilakukan oleh orang-orang jahiliyah kepada anak-anak perempuan mereka, mereka benci dengan adanya anak perempuan dikeluarga mereka, dikarenakan mereka takut dengan kemiskinan akan menimpa mereka, atau mereka takut dengan penyakit yang bisa menimpa bayi mereka, dan penyakit itu akan menular ke badan mereka, maka mereka pun menghindari hal itu dengan membunuh bayi-bayi perempuan mereka, Allah berfirman : { وَإِذَا بُشِّرَ أَحَدُهُمْ بِمَا ضَرَبَ لِلرَّحْمَٰنِ مَثَلًا ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ } ( Padahal apabila salah seorang di antara mereka diberi kabar gembira dengan apa yang dijadikan sebagai misal bagi Allah Yang Maha Pemurah; jadilah mukanya hitam pekat sedang dia amat menahan sedih. ) [ Az Zukhruf : 17 ] , dalam ayat lain Allah berfirman : { أَمْ يَدُسُّهُ فِي التُّرَابِ ۗ أَلَا سَاءَ مَا يَحْكُمُونَ يَتَوَارَىٰ مِنَ الْقَوْمِ مِنْ سُوءِ مَا بُشِّرَ بِهِ ۚ أَيُمْسِكُهُ عَلَىٰ هُونٍ } ( Ia menyembunyikan dirinya dari orang banyak, disebabkan buruknya berita yang disampaikan kepadanya. Apakah dia akan memeliharanya dengan menanggung kehinaan ataukah akan menguburkannya ke dalam tanah (hidup-hidup)?. Ketahuilah, alangkah buruknya apa yang mereka tetapkan itu. ) [ Am Nahl : 59 ] . Allah menciptakan perempuan dengan tujuan agar mereka melakukan pekerjaan yang diadakan karena penciptaan mereka sendiri, agar mereka beribadah hanya kepada Allah, agar mereka menjadi itsri sholehah bagi suami-suami mereka, agar mereka merawat anak-anak mereka, mereka memilik pekerjaan yang baik yang tidak dapat dilakukan oleh laki-laki, begitupun sebaliknya ada pekerjaan yang tidak dapat mereka lakukan kecuali hanya kaum laki-laki yang dapat melakukannya, segala sesuatu telah Allah tentukan sesuai dengan kadarnya masing-masing, sehingga terlengkapilah semua kemaslahatan dan semua kerja keras dapat terselesaikan dengan saling menopang satu sama liannya, agar terbentuk keluarga yang darinya komunitas masyarakat dapat terbentuk. Pada zaman sekarang ini bermunculan diantara manusia orang-orang yang mengikuti jejak orang-orang jahiliyah, mereka yang dulunya pada zaman jahiliya menguburkan anak-anak perempuan mereka dibawah tanah, dan sekarang cara mereka adalah dengan menguburkan anak perempuan mereka hidup-hidup diatas tanah, yakni : mereka menguliti anak perempuan mereka dari dari segi akhlaknya dan mereka juga melepaskan anak-anak perempuan mereka dari pekerjaan yang sesuai untuk mereka, dan mengalihkannya kepada pekerjaan kaum laki-laki, mereka pun membuat anak-anak perempuan mereka menghilangkan rasa malu, dan akhirnya dengan akhlaq yang buruk mereka pun seakan-akan tidak berpenampilan layaknya wanita dan tidak pula seperti laki-laki, karena tidak mungkin seorang wanita berubah menjadi laki-laki dan seorang wanita yang terlepas dari kriteria akhlaq baik seorang wanita , tidak layak pula disebut sebagai wanita, maka seolah-olah ia tidak nampak layaknya seorang pria ataupun wanita, itulah yang dimaksud dengan mengubur hidup-hidup secara maknawi, bahkan bisa lebih buruk dari makna yang sebenarnya, karena jika sesorang dikubur hidup-hidup maka ia akan mati terbunuh, akan tetapi dengan cara mebgubur mereka hidup-hidup dari segi akhlaq tentunya mereka masih hidup dalam kehinaan, dan tidak lagi berharga diantara manusia, itulah yang orang-orang kafir inginkan terhadap wanita-wanita muslimah, dan hal itu telah mereka lakukan dengan bekerjasama dengan sekutu-sekutu mereka dari orang-orang sekuler dan liberal yang sebenarnya mereka adalah dari kaum muslimin. { سُئِلَتْ } Apakah anak-anak perempuan yang dikubur hidup-hidup itu akan ditanya ? ya.. mereka akan ditanya, dan dikatakan kepada mereka : siapakah yang telah membunuhmu ? dan mereka pun mengatakan : ayahku lah yang telah membunuhku."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا الْمَوْءُودَةُ سُئِلَتْ “apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya,” المَوْءُوْدَة[al-Maudah] maknanya adalah anak perempuan yang dikubur hidup-hidup. Ini adalah kebiasaan orang-orang jahiliyah karena kebodohan mereka di mana dan buruk sangkanya mereka kepada Allah dan ketidakmampuan mereka menahan rasa malu, mereka saling mencela apabila dianugarahi anak perempuan, maka apabila: بُشِّرَ أَحَدُهُمْ بِالْأُنْثَى ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ “Dan apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, hitamlah (merah padamlah) mukanya, dan dia sangat marah.” penuh rasa gundah dan duka يَتَوَارَى مِنَ الْقَوْمِ “Ia menyembunyikan dirinya dari orang banyak,” Ia bersembunyi dari mereka مِنْ سُوءِ مَا بُشِّرَ بِهِ أَيُمْسِكُهُ عَلَى هُونٍ أَمْ يَدُسُّهُ فِي التُّرَابِ “disebabkan buruknya berita yang disampaikan kepadanya. Apakah dia akan memeliharanya dengan menanggung kehinaan ataukah akan menguburkannya ke dalam tanah (hidup-hidup)?”(QS. An-Nahl: 58-59) Yakni: Apa bila dkatakan kepada mereka: Kita kabarkan bahwa Allah menganugerahkanmu seorang anak permpuan, ia akan gundah dan berduka, dan terus dipenuhi rasa gundah dan duka, sampai-sampai ia berfikir apakah apakah anak perempuannya ini dibiarkan tetap hidup dalam keadaan ia meresa hina dan rendah? Atau ia menguburnya di tanah, sehingga ia merasa lega? Sebagian mereka membiarkan anak perempuannya tetap hidup sambil menahan rasa malu, sebagian yang lain menguburkannya, sebagian mereka ada yang menguburnya hidup-hidup, baik sebelum tamyiz (belum faham apapun) atau setelah tamyiz. Sampai-sampai sebagian mereka sengaja menggali lubang untuk mengubur anak perempuannya, sampai jika pasir mengenai janggutnya, ia mengibaskankannya, ia terus menggali untuk menguburnya, ia tidak memiliki rasa kasih sayang sama sekali. Ini menunjukkan bahwa perkara jahiliyah sangatlah terbelakang lagi rendah. Binatang-binatang buas menyayangi mereka, padahal mereka hewan buas. Sedangkan orang-orang jahiliyah, mereka tidak menyayangi anak-anak mereka. Allah ‘Azza Wa jalla berfirman: وَإِذَا الْمَوْءُودَةُ سُئِلَتْ “apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya,” ditanya pada hari kiamat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takwir ayat 8: 1-13. (Dalam permulaan surat ini) Allah memulai dengan banyak sumpah, di mana Allah bersumpah dengan matahari apabila digulung seperti bola yang terang sinarnya, dan dikeluarkan dari peredarannya, kemudian dilemparkannya (matahari tersebut) ke dalam neraka. Allah juga bersumpah dengan bintang-bintang apabila jatuh dan berhamburan serta menyebar (menuju bumi). Allah juga bersumpah dengan gunung-gunung yang tercabut dari bumi dan berpisah dari tempatnya, remuk lebur, menyebar di udara (bagaikan) debu. Allah juga bersumpah dengan unta betina yang hamil dan tidak peduli dengan janinnya. Allah juga bersumpah dengan binatang-binatang liar yang jika dikumpulkan maka biantang-binatang tersebut kebingungan karena kengerian yang membuat panik, yang menimpa satu sama lain dari binatang tersebut. Dan Allah juga bersumpah dengan lautan yang meluap dari panas api. Allah juga bersumpah dengan diri-diri yang dipertemukan (ketika ruh dan jasad menyatu), maka dikumpulkan antara manusia-manusia yang selamat dengan yang selamat, begitu juga ahli maksiat dengan ahli maksiat. Dan Allah bersumpah terhadap orang-orang yang beriman dimana mereka telah berpasangan dengan bidadari surga. Dan Allah bersumpah terhadap bayi-bayi perempuan yang ketika ditanya dengan sebab apa dia dibunuh, maka ia akan menjawab : Bahwasanya ia dibunuh dengan tanpa sebab (dosa) akan tetapi maksud (pembunuhannya) adalah karena sebab aib dan malu (memiliki anak perempuan). Allah juga bersumpah dengan lembaran-lembaran amal diterbangkan agar sampai kepada pemiliknya di saat hari pembalasan hingga mereka tidak percaya akan hal itu; Orang-orang yang beriman akan menerima dengan tangan kanannya dan orang-orang yang kafir akan menerima dengan tangan kirinya. Allah juga bersumpah dengan langit yang terbelah, sebagaimana terbelahnya kulit hewan yang disembelih dan jadilah semisal dengan muhl (yaitu terbelah dan terdapat luluhan yang mendidih). Allah juga bersumpah dengan neraka yang dinyalakan, dihidupkan, dan dibakar. Allah juga bersumpah dengan surga yang didekatkan bagi hamba Allah yang shalih, atau didekatkan untuk turun kepada mereka (orang-orang shalih)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena merasa malu mempunyai anak perempuan atau karena takut miskin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takwir Ayat 8",
    "description": "8-13. Dan apabila bayi-bayi perempuan yang dikubur hidup-hidup tanpa dosa dan kesalahan ditanya, karena dosa apa dia dibunuh. Masyarakat jahiliah merasa malu bila mempunyai anak perempuan karena wanita dianggap tidak mempunyai peran apa-apa dalam kehidupan. Untuk menutup rasa malu, mereka rela mengubur anak-anak perempuannya hidup-hidup. Dan apabila lembaran-lembaran yang berisi catatan perbuatan manusia, yang besar maupun yang kecil, dibuka lebar-lebar. Pada saat itu manusia tidak bisa mengelak dari apa yang telah dia perbuat di dunia. Dia yang menerima catatan amal dengan tangan kanan akan berbahagia. Sebaliknya, mereka yang menerima dengan tangan kiri akan celaka. Dan apabila langit dilenyapkan. Langit yang semula menjadi atap bagi penduduk bumi akan dikelupas layaknya kulit binatang dikelupas dari tubuhnya. Dan apabila neraka jahim dinyalakan dengan suhu panas yang tidak terbayangkan. Neraka itu disediakan bagi mereka yang ingkar kepada Allah. Dan apabila surga dengan segala kenikmatannya didekatkan kepada mereka yang beriman dan beramal saleh"
  }
]