[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami memberimu (wahai nabi), kebaikan yang banyak di dunia dan akhirat, diantaranya adalah sungai al kautsar di surga yang kedua sisinya adalah tenda mutiara yang berongga dan tanah nya adalah kasturi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sesungguhnya Kami telah memberimu -wahai Rasul- kebaikan yang banyak, di antaranya sungai Al-Kauṡar di Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Kami -dengan keagungan dan kekuasaan Kami- telah memberikan kepadamu hai Rasulullah kebaikan yang banyak di dunia dan di akhirat, dan sungai di surga yang ada di tenda yang terbuat dari mutiara yang dipahat, dan pada dua tepi sungai itu terdapat aroma misk. Maka senantiasalah mendirikan shalat dan beribadahlah hanya kepada-Nya, dan sembelihlah hewan ternak dengan menyebut nama Allah semata sebagai bentuk rasa syukur bagi-Nya. Sungguh musuhmu yang murka terhadapmu itu telah terputus dari segala kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِنَّاۤ اَعۡطَيۡنٰكَ الۡكَوۡثَرَ (Sesungguhnya Kami telah memberikan kepadamu nikmat yang banyak) Makna (الكوثر) yakni sungai di surga yang Allah ciptakan untuk memuliakan Rasulullah dan umatnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Muqoddimah surah al-Kautsar : 1 ). Surah al-Kautsar menjelaskan ( dengan keistimewaan yang dimiliki ) tentang hakikat kebaikan yang tidak akan terwujud kecuali dengan dua perkara : -1- Pemberian yang berkesinambungan. -2- Menghindari segala hal-hal yang dapat mencemari kebaikan. Hamba yang berakal sehat tidak seharusnya sibuk dengan agama atau dunianya dengan mengedapankan perkara yang pertama tanpa menyeimbangkannya dengan perkara kedua. 2 ). Prhatikanlah susunan surat al-kautsar, kamu akan menemukan rangkaian yang menakjubkan ! Jika Allah memberikan kepadamu kebaikan yang besar ( dan yang yang paling besar itu adalah agama ini ) dan menggunakanmu untuk mengajak manusia kepadanya dan mengajarkan mereka tentang nya, dan mendedikasikan diri untuk beribadah kepada tuhanmu dengan segala bentuk ibadah yang sempurna, dan janganlah kamu berpaling kepada apa yang menjadi tipu daya musuh-musuhmu kepadamu dari kekejian hissi ataupun maknawi, dan jangan lah kamu gelisah karenya, karena sesungguhnya akibat bagi mereka adalah kerugian yang besar dan kegelisahan { إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ } \"Sesungguhnya orang-orang yang membenci kamu dialah yang terputus\" [ al-Kautsar : 3 ]. { إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ } ( 1 ) 1 ). Ayat ini mengisyaratkan bahwa Allah ta'ala menganugerahkan kepada Nabi-Nya segala kebaikan yang utuh, meskipun sebagian dari ummatnya merasakan sedikit dari kebaikan itu maka itu adalah berkah dari ketaatan mereka dalam ittiba' kepada Nabi mereka. 2 ). Tidaklah seseorang merasa cukup dalam segala urusan didunia kecuali berdzikir mengingat nikmat Allah ta'ala, maka kemewahan apa di dunia yang dapat digantikan dengan kautsar ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Imam Ahmad mengatakan dari Anas bin Malik bahwa sesungguhnya Nabi SAW tidur sejenak kemudian tersenyum karena turunnya surah ini kepada beliau. Beliau menafsiri Al-Kautsar dengan sabdanya yaitu “Telaga yang diberikan oleh Tuhanku yang Maha Agung dan Maha Tinggi kepadaku di surga. Di dalamnya ada banyak kebaikan. Umatku akan dikembalikan kepadanya pada hari kiamat, sehingga disebut dengan telaga maurud (tempat kembali)” 1-2. Sesungguhnya kami memberimu wahai Rasulallah telaga Kautsar, yaitu kebaikan yang diberikan dalam jumlah banyak di akhir nanti, di antaranya adalah telaga di surga sebagaimana diriwayatkan oleh Imam Ahmad dan Imam Muslim dan lainnya. Maka langgengkanlah shalat yang diwajibkan dengan ikhlas hanya karena Allah dan juga shalat hari raya sebagai rasa syukur atas nikmatNya; dan kurbankanlah hewan kurbanmu untuk Allah dengan hanya menyebut namaNya sebagai pembeda dari apa yang dilakukan bangsa Arab Jahiliyyah yang shalat dan berkurban untuk selain Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah memberimu nikmat yang banyak} kebaikan yang banyak, di antaramya adalah telaga Kautsar yang ada di surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman kepada NabiNya, Muhammad, seraya menganugerahkan karunia kepada beliau, “Sesungguhnya Kami telah memberikan kepadamu nikmat yang banyak,” yakni kebaikan dan karunia yang banyak, yang di antaranya adalah sungai al-Kautsar yang diberikan Allah kepadanya pada Hari Kiamat. Dan juga telaga yang panjangnya selama perjalanan sebulan dan luasnya selama perjalanan sebulan. Airnya lebih putih dari susu, dan lebih manis dari madu, jumlah gelasnya sejumlah bintang-bintang di langit dari segi banyak dan gemerlapnya. Siapapun yang meminum satu kali tegukan dari air telaga ini, maka tidak akan haus setelahnya selamanya.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Allah - عز وجل - berkata kepada Nabi-Nya : { إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ } Sesungguhnya kami telah memberikan kepadamu begitu banyak kebaikan dan kenikmatan, Dalam riwayat lain dikatakan : \"Al-Kautsar adalah sungai yang ada di surga, dan riwayat ini shahih dari Nabi ﷺ bahwasnya beliau diberikan oleh Allah - عز وجل - sebuah sungai yang mengalir dari mata air surga, airnya yang lebih dari warna susu, dan lebih masin dari manisnya madu, dan sungai ini akan mengalir sampai ke telaga Nabi ﷺ , beliau akan memberi minum untuk ummatnya dari telaga ini, telaga yang memliki wadah-wadah yang jumlahnya sebanyak bintang di langit, barangsiapa yang minum darinya tidak akan merasakan haus setelahnya sampai kapan pun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Disebutkan tentang surat ini bahwa surat ini adalah surat Makkiyah, dan disebutkan juga bahwa ini adlah surat madaniyah. Al-Makkiy adalah surat yang turun seblum hijrahnya Nabi shallallaahu 'alaihi wa sallam ke kota Madinah, baik itu turun di Mekah atau pun di Madinah, atau ketika dalam perjalanan. Setiap surat yang turun setelah hijrah maka dia adalah surat madaniy, dan surat yang turun sebelum hijrah maka disebut surat makkiy, inilah pendapat terkuat di antara pendapat-pendapatnya para ulama. Allah 'Azza Wa Jalla berfirman berinteraksi dengan Nabi shallallaahu 'alaihi wa sallam: إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ \" Sesungguhnya Kami telah memberikan kepadamu nikmat yang banyak.\" Al-Kautsar: Dalam bahasa arab berarti kebaikan yang banyak. Begitulah Nabi shallallaahu 'alaihi wa sallam diberikan oleh Allah Ta'ala kebaikan yang banya di dunia dan di akhirat, di antaranya: Sungai yang besar di surga yang memancar darinaya dua sungai di atas telaganya yang datang tentangnya shallallaahu 'alaihi wa sallah, airnya lebih putih dari susu, lebih manis dari madu, lebih harum dari misik. Dan telaga ini pada hari kiamat, ada pada tahapan-tahapan hari kiamat, orang-orang beriman dari umat Muhammad shallallaahu 'alaihi wa sallam akan mendatanginya, bejana-bejananya sebanyak dan seindah bintang-bintang dilangit. Siapa saja yang berjalan di atas syari'at beliau di dunia maka dia akan berjalan mendatangi telaganya di akhirat, dan sapa saja yang tidak berjalan di atas syari'atnya maka dia terhalangi dari telaga ini di akhirat. Dan di antara kebaikan yang banyak yang diberikan kepada Nabi shallallaahu 'alaihi wa sallam di dunia adalah: Apa yang datang dalam shahihain dari hadits Jabir radhiyallaahu 'anhu bahwa Nabi shallallaahu 'alaihi wa sallam bersabda: أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ أَحَدٌ قَبْلِي نُصِرْتُ بِالرُّعْبِ مَسِيرَةَ شَهْرٍ وَجُعِلَتْ لِيَ الْأَرْضُ مَسْجِدًا وَطَهُورًا فَأَيُّمَا رَجُلٍ مِنْ أُمَّتِي أَدْرَكَتْهُ الصَّلَاةُ فَلْيُصَلِّ وَأُعْطِيتُ الشَّفَاعَةَ وَأُحِلَّتْ لِي الْمَغَانِمُ وَكَانَ النَّبِيُّ يُبْعَثُ إِلَى قَوْمِهِ خَاصَّةً وَبُعِثْتُ إِلَى النَّاسِ عَامَّة \"Aku diberikan lima hal yang tidak diberikan kepada seorang nabi pun sebelum ku: aku diberikan kemenangan dengan rasa takut pada musuh sejarak satu bulan, bumi dijadikan masjid dan pensuci untukku, maka kapan pun seseorang dari umatku telah memasuki waktu sholat maka shalatlah, aku diberikan syafa'at, dihalalkan untukku harta rampasan perang dan seorang Nabi diutus kepada kaumnya secara khusus dan aku diutus kepada semua manusia.\"(1) Ini adalah di antara kebaikan yang banyak, karena beliau diutus kepada seluruh manusia, konsekuansinya beliau adalah nabi yang paling banyak pengikutnya, dan memang benar beliau adalah Nabi yang paling banyak pengikutnya. Dan telah diketahui bahwa orang yang memberikan petunjuk kepada kebaikan seperti yang berbuat kebaikan itu sendiri. Dan orang yang memberikan petunjuk kepada umat yang besar ini yang jumlahnya melebihi umat-umat lain adalah Muhammad shallallaahu 'alaihi wa sallam, dengan demikian maka Rasulullah shallallaahu 'alaihi wa sallam memperoleh jatah pahala dari setiap orang dari umatnya, dan tidak ada yang mampu menghitung jumlah umat ini selain Allah 'Azza Wa Jalla. Dan di antara kebaikan yang diberikan kepada beliau di akhirat adalah maqam mahmud, dan juga syafa'at 'uzhmaa. Sungguh manusia ketika hari kiamat akan dirundung kegundahan dan himpitan yang tidak mampu mereka tahan, maka mereka meminta syafa'at. Mereka datang kepada Adam, kemudian Nuh, kemudian Ibrahim, Musa, Isa 'alaihisholaatu wassalaam hingga sampai kepada Nabi shallallaahu 'alaihi wa sallam, maka beliau berdiri dan memberi syafa'at, lalu Allah memutuskan perkara di antara hamba-hamba dengan syafa'at beliau, ini adalah kedudukan yang dipuji dengannya oleh orang-orang terdahulu hingga akhir, dan masuk dalam firman Allah Ta'ala berfirman: عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا \" mudah-mudahan Tuhan-mu mengangkat kamu ke tempat yang terpuji. \"(QS. Al-Isra: 79) Dengan demikian, al-kautsar adalah kebaikan yangbanya, di antaranya juga sungai yang berada di surga. Sungai yang berada di surga pun tidak diragukan lagi adalah al-Kautsar, sungai tersebut diberi nama kautsar. Tetapi tidak itu saja yang Allah berikan kepada Nabi-Nya shallallaahu 'alaihi wa sallam dari kebaikan. (1) Dikeluarkan Bukhari (335) dan Muslim (521)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kautsar ayat 1: Surat ini dimulai (ditujukan) kepada Nabi ﷺ, yaitu bahwasanya Allah memberikan kebaikan yang banyak, yang terus menurus kepada Nabi ﷺ di dunia dan akhirat. Dan diantaranya adalah diberikan telaga Al Kautsar, yang barangsiapa meminumnya sekali tegukan, tidak akan pernah haus selamanya. Ini merupakan penghargaan dan pemulian atas kedudukan tinggi Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti kenabian, Al Qur’an, syafaat, dsb. Al Kautsar juga berarti sungai di surga yang dijanjikan Allah Subhaanahu wa Ta'aala untuk Beliau. Syaikh As Sa’diy berkata, “Allah Subhaanahu wa Ta'aala berfirman kepada Nabi-Nya memberikan nikmat kepadanya, “Sungguh, Kami telah memberimu (Muhammad) nikmat yang banyak.” Yakni kebaikan yang banyak dan karunia yang melimpah yang di antaranya adalah apa yang Allah berikan kepada Nabi-Nya shallallahu 'alaihi wa sallam pada hari Kiamat berupa sungai yang disebut dengan Al Kautsar, dan telaga yang panjangnya selama sebulan, lebarnya selama sebulan, airnya lebih putih daripada susu, lebih manis daripada madu, bejananya seperti bintang-bintang di langit karena banyak dan bersinarnya. Barang siapa yang meminumnya, maka dia tidak akan haus setelahnya selama-lamanya.” Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Anas bin Malik ia berkata: بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ بَيْنَ أَظْهُرِنَا إِذْ أَغْفَى إِغْفَاءَةً ثُمَّ رَفَعَ رَأْسَهُ مُتَبَسِّمًا فَقُلْنَا مَا أَضْحَكَكَ يَا رَسُولَ اللَّهِ قَالَ « أُنْزِلَتْ عَلَىَّ آنِفًا سُورَةٌ » . فَقَرَأَ « بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ( إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ * فَصَلِّ لِرَبِّكَ وَانْحَرْ * إِنَّ شَانِئَكَ هُوَ الأَبْتَرُ ) » . ثُمَّ قَالَ « أَتَدْرُونَ مَا الْكَوْثَرُ » . فَقُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ . قَالَ « فَإِنَّهُ نَهْرٌ وَعَدَنِيهِ رَبِّى عَزَّ وَجَلَّ عَلَيْهِ خَيْرٌ كَثِيرٌ هُوَ حَوْضٌ تَرِدُ عَلَيْهِ أُمَّتِى يَوْمَ الْقِيَامَةِ آنِيَتُهُ عَدَدُ النُّجُومِ فَيُخْتَلَجُ الْعَبْدُ مِنْهُمْ فَأَقُولُ رَبِّ إِنَّهُ مِنْ أُمَّتِى . فَيَقُولُ مَا تَدْرِى مَا أَحْدَثَتْ بَعْدَكَ » . زَادَ ابْنُ حُجْرٍ فِى حَدِيثِهِ بَيْنَ أَظْهُرِنَا فِى الْمَسْجِدِ . “Suatu hari ketika Rasulullah shallallahu 'alaihi wa sallam berada di antara kami, tiba-tiba Beliau tertidur sejenak, lalu Beliau mengangkat kepalanya sambil tersenyum. Maka kami berkata, “Apa yang membuatmu tersenyum wahai Rasulullah?” Beliau bersabda, “Baru saja diturunkan kepadaku satu surah.” Beliau pun membacakan surah itu, “Dengan menyebut nama Allah Yang Maha Pemurah lagi Maha Penyayang.-- Sungguh, Kami telah memberimu (Muhammad) Al Kautsar-- Maka laksanakanlah shalat karena Tuhanmu, dan berkurbanlah-- Sungguh, orang-orang yang membencimu dialah yang terputus (dari rahmat Allah).” (Terj. Al Kautsar: 1-3) Kemudian Beliau bersabda, “Tahukah kamu apa Al Kautsar?” Kami menjawab, “Allah dan Rasul-Nya lebih tahu.” Beliau bersabda, “Sesungguhnya ia adalah sungai yang dijanjikan Tuhanku ‘Azza wa Jalla kepadaku, di atasnya terdapat kebaikan yang banyak; yaitu telaga yang akan didatangi umatku pada hari Kiamat, bejananya sejumlah bintang (di langit), lalu ada seorang hamba yang ditarik darinya, maka aku pun berkata, “Yaa Rabbi, sesunggunya ia termasuk umatku.” Allah berfirman, “Engkau tidak mengetahui apa yang mereka ada-adakan setelahmu.” Ibnu Hujr –salah seorang rawi- menambahkan dalam haditsnya, “(Rasulullah shallallahu 'alaihi wa sallam) berada di antara kami di masjid.” (Hadits ini diriwayatkan pula oleh Abu Dawud dan Nasa’i)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kautsar Ayat 1",
    "description": "Wahai nabi Muhammad, sungguh kami telah memberimu nikmat yang banyak dan langgeng, meliputi kenikmatan duniawi maupun ukhrawi, seperti kenabian, Al-Qur'an, syafaat, telaga di surga, dan sebagainya. 2. Karena itu, sebagai rasa syukurmu kepada tuhanmu, maka laksanakanlah salat dengan ikhlas semata-mata karena tuhanmu, bukan dengan tujuan ria; dan berkurbanlah demi Allah dengan menyembelih hewan sebagai ibadah dan sarana mendekatkan diri kepada Allah."
  }
]