[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ikhlaskanlah shalatmu seluruhnya hanya untuk tuhanmu,dan sembelihlah binatang sembelihanmu untuk NYA dan hanya dengan nama NYA semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Maka tunaikan rasa syukur kepada Allah atas nikmat ini dengan melaksanakan salat dan menyembelih (qurban) untuk Allah semata, berbeda dengan ibadah yang dilakukan oleh orang-orang musyrik berupa pendekatan diri dengan menyembelih untuk patung-patung mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. فَصَلِّ لِرَبِّكَ (Maka dirikanlah shalat karena Tuhanmu) Yakni shalat wajib lima waktu. وَانۡحَرۡ( dan berkorbanlah) Dahulu manusia mengerjakan shalat dan menyembelih kurban untuk selain Allah. Maka Allah memerintahkan Nabi-Nya agar menjadikan shalat dan kurbannya hanya bagi Allah semata. Qatadah, ‘Atha, dan Ikrimah berkata: yang dimaksud adalah shalat ‘idhul adha dan menyembelih kurban setelah itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara faidah pengalihan kata ganti ghoib ke kata ganti khitob pada ayat adalah menandakan bahwasanya tuhanmu berhak atas hamba-Nya segala peribadatan, dan kamu pantas untuk menyembah kepada-Nya dan berqurban hanya karena-Nya. 2 ). Tatkala Allah menyebutkan kebaikan-Nya kepada Nabi-Nya dengan ayat berikut : { إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ } Dia kemudian memerintahkannya untuk bersyukur atas pemberian itu pada ayat setelahnya : { فَصَلِّ لِرَبِّكَ وَانْحَرْ } dan ayat ini juga menjelaskan bahwa salah satu tanda syukur yang paling besar adalah : dengan amal ( amalan hati dan amalan aggota tubuh ). 3 ). { إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ , فَصَلِّ لِرَبِّكَ وَانْحَرْ } Qurban yang dilakukan oleh seorang hamba pada hari-hari tasyriq adalah lebih baik dari zakat yang dibayarnya pada hari fitri, karena itu Allah memerintahkan kepda nabi-Nya untuk mensyukuri al-kautsar pemberian-Nya dengan mendirikan shalat dan berqurban, sebagaimana yang juga diperintah kepada kekasih-Nya Ibrahim dengan menyembelih anaknya, yang kemudian ketatannya itu ditebus dengan qurban besar. 4 ). { إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ , فَصَلِّ لِرَبِّكَ وَانْحَرْ } Tidaklah Allah menyebutkan dua ayat ini secara khusus, melainkan karena dua perintah yang terkandung di dalamnya adalah sebaik-baiknya amal ibadah seorang hamba dan cara terbaik untuk mendekatkan diri kepada Allah, juga karena shalat terkandung di dalamnya ketundukan hati dan jiwa hamba kepada Allah, sedangkan dalam berqurban seorang hamba mendekatkan diri kepada Allah dengan hewan qurban terbaik yang dimiliki olehnya. dan mengeluarkan harta yang menjadi fitrah bagi setiap orang untuk mencintainya. 5 ). Ketika sholat dan menyembelih hewan qurban menjadi amal ibadah yang paling banyak di persembahkan oleh orang-orang mausyrik kepada berhala-berhala mereka, maka Allah menghusukan dalam surah ini perintah kedua perintah tersebut dengan { فَصَلِّ لِرَبِّكَ وَانْحَرْ } , karena maksud dan tujuan yang paling penting dari keduanya adalah : { لِرَبِّكَ } , oleh karena itu al-Qur'an tidak hanya menyebutkan : ( فضل و انحر ) tanpa penisbatan keduanya kepada Allah, agar makna dan maksud utama dari perintah itu lebih jelas, yaitu : ( فضل لربك ) maka dirikanlah shalat untuk Tuhanmu dan ( فاتحر لربك ) berqurbanlah juga hanya untuk tuhanmu, tanpa mensekutukannya dengan yang lain, sebagai pembeda atas keangkuhan orang-orang musyrik yang menjadikan shalat dan qurban mereka kepada selain Allah. 6 ). { فَصَلِّ لِرَبِّكَ وَانْحَرْ } Mendekatlah kepada Allah dengan cara menyembelih hewan qurban, secara bahasa kata \"النحر\" dikhususkan untuk hewan qurban dari unta, adapun untuk sapi dan domba menggunakan kata \"الذبح\" , tetapi dalam surah ini menggunakan kata النحر ; karena unta lebih memberikan manfaat yang banyak untuk orang-orang miskin; oleh karena itu Rasulullah memberi hadiah hewan qurban dalam hajinya 100 ekor unta, dan beliau menyembelih diantaranya 63 ekor, dan sisanya disembelih oleh Ali bin Abi thalib."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Sesungguhnya kami memberimu wahai Rasulallah telaga Kautsar, yaitu kebaikan yang diberikan dalam jumlah banyak di akhir nanti, di antaranya adalah telaga di surga sebagaimana diriwayatkan oleh Imam Ahmad dan Imam Muslim dan lainnya. Maka langgengkanlah shalat yang diwajibkan dengan ikhlas hanya karena Allah dan juga shalat hari raya sebagai rasa syukur atas nikmatNya; dan kurbankanlah hewan kurbanmu untuk Allah dengan hanya menyebut namaNya sebagai pembeda dari apa yang dilakukan bangsa Arab Jahiliyyah yang shalat dan berkurban untuk selain Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka shalatlah kepada Tuhanmu dan berkurbanlah} dan sembelihlah hewan kurbanmu karenaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Dan setelah Allah menyebutkan karunia yang diberikan padanya, Allah menyuruhnya untuk bersyukur seraya berfirman, “Maka dirikanlah shalat karena Rabbmu; dan berkurbanlah.” Allah menyebut dua ibadah ini secara khusus karena keduanya merupakan ibadah paling utama dan amalan untuk mendekatkan diri kepada Allah yang paling mulia. Disamping itu karena shalat mencakup ketundukan hati dan raga kepada Allah dan mendorong orang untuk melakukan berbagai macam ibadah, dan dalam berkurban terdapat nilai pendekatan diri kepada Allah dengan sembelihan paling baik yang dimiliki seseorang dan mengeluarkan harta yang secara fitrah amat dicintai dan dijaga oleh jiwa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{فَصَلِّ لِرَبِّكَ } Maka dirikanlah shalat hanya untuk mengharap ridho dari tuhanmu, bukan shalat yang dilakukan karena riya mengharap sanjungan dari orang lain, ikhlaskan niatmu untuk mendirikan shalat karena Allah - عز وجل - , karena shalat adalahsebaik-baiknya amalan seorang hamba, dan amalan inilah yang akan pertama kali dihisab pada hari kiamat, oleh karena itu shalat memiliki kdudukan yang sangat tinggi dalam agama islam, dan kebaikan yang terkandung didalamnya sangat banyak, baik itu shalat wajib maupun shalat sunnah yang akan memberikan nilai tambah bagi siapa yang mengerjakannya. { وَانْحَرْ } Dan berkurbanlah, yakni sembelih lah hewan qurban, \"Qurban\" berarti mendekatkan diri kepada Allah dengan menyembelih hewan, seperti menyembelih hewan saat hari iedul adha, dan saat mengadakan aqiqah, semuanya adalah macam-macam qurban yang dilakukan untuk mendekatkan diri kepada Allah - عز وجل - , menyembelih hewan qurban adalah salah satu diantara amal ibadah yang paling mulia dan paling utama bagi umat islam, hal karena perintahnya disandingkan dengan perintah mendirikan shalat, sama halnya dengan zakat yang perintah untuk melakukannya sering disandingkan dengan perintah mendirikan shalat. Adapun menyembelih hewan diluar dari waktu-waktu tertentu diatas, seperti menyembelih hewan untuk sekedar dimakan, atau untuk menyambut kedatangan tamu tertentu, maka hal itu adalah suatu kebolehan yang hukumnya tidak sampai pada derajat wajib, dan perkara ini juga tidak termasuk dalam perintah qurban yang disebutkan dalam ayat ini. Sedangkan orang-orang yang menyembelih hewan dengan tujuan untuk persembahan kepada selain Allah , seperti mnyembelih untuk kuburan dan makhluk-makhluk lainnya baik itu yang hidup maupun yang telah mati, maka perkara ini tidak dibenar dalam islam, dan ini adalah kesyirikan yang besar, kesyirikan yang dapat mengeluarkan seorang hamba dari koridor islam, karena Allah - تعالى - menyebutnya bersamaan dengan perintah shalat, hal itu menandakan akan keagungan ibadah ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Setelah Allah menyebutkan karunia-Nya berupa kebaikan yang banyak, Allah berfirman: فَصَلِّ لِرَبِّكَ وَانْحَرْ \" Maka dirikanlah salat karena Tuhanmu dan berkorbanlah.\" Sebagai wujud rasa syukur kepada Allah atas nikmat yang besar tersebut, dengan shalat dan menyembelih kurban untuk Allah, yang dimaksud dengan shalat di sini adalah seluruh shalat, dan shalat yang paling masuk dalam ayat ini adalah shalat yang berdampingan dengan ibadah kurban, yaitu sholat iedul adh-ha. Tetapi ayat ini umum mencakup seluruhnya. فَصَلِّ لِرَبِّكَ \" Maka dirikanlah salat karena Tuhanmu \" Sholat-sholat wajib dan sunnah, sholat-sholat ied dan jum'at وَانْحَرْ \"dan berkurbanlah\" Bertaqarrublah dengan nahr. Nahr adalah penyembelihan khusus unta, sedangkan dzab-hu penyembelihan sapi dankambing. Tetapi dalam ayat ini disebutkan dengan nahr, karena unta adalah lebih bermanfaat dari hewan kurban lainnya bagi orang-orang miskin. Oleh karenanya, Nabi shallallaahu 'alaihi wa sallam berhadyu (menyembelih hadyu) ketika haji wada' dengan seratus ekor unta, beliau menahr (menyembelih) enam puluh tiga ekor unta, dan menyerahkan sisanya kepada Ali Bin Abi Thalib radhiyallaahu 'anhu, beliau menyembelihnya, dan menyedekahkan seluruh bagiannya kecuali satu bagian tubuh dari setiap ekor unta itu, beliau mengambilnya dan dimasak di atas kuali, beliau makan dagingnya dan meminum kuahnya, beliau memerintahkan untuk menyedekahkan perangkatnya dan kulit-kulitnya. Perintah dalam ayat ini adalah perintah untuk beliau dan untuk umat, maka hendaknya kita ikhlas kepada Allah dalam shalat, dan ikhlas dalam menyembelih untuk Allah, sebagaimana Nabi shallallahu 'alaihi wa sallam kita diperintahkan demikian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kautsar ayat 2: Allah memerintahkan Nabi-Nya ﷺ, agar menjadikan shalatnya hanya karena Allah saja yang ia (Nabi) telah diberikan kenikmatan yang banyak. Dan diperintahkan agar menyembelih unta dan selainnya hanya untuk Allah saja; Bahkan seluruh amalan-amalannya (wajib) ikhlas karena Allah saja tanpa menyekutukan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya, maka Alah Subhaanahu wa Ta'aala memerintahkan Beliau untuk mensyukurinya dengan firman-Nya di atas. Ada yang menafsirkan dengan shalat ‘Idul Adh-ha. Yang dimaksud berkurban di sini ialah menyembelih hewan Qurban dan mensyukuri nikmat Allah. Disebutkan secara khusus shalat dan kurban karena keduanya termasuk ibadah yang paling utama dan pendekatan diri yang paling mulia. Di samping itu, karena dalam shalat terdapat ketundukan hati dan anggota badan kepada Allah Subhaanahu wa Ta'aala dan mengalihkannya kepada ibadah-ibadah lainnya, sedangkan dalam shalat terdapat pendekatan diri kepada Allah Subhaanahu wa Ta'aala dengan hewan kurban yang terbaik miliknya dan mengeluarkan harta yang dicintainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kautsar Ayat 2",
    "description": "Karena itu, sebagai rasa syukurmu kepada tuhanmu, maka laksanakanlah salat dengan ikhlas semata-mata karena tuhanmu, bukan dengan tujuan ria; dan berkurbanlah demi Allah dengan menyembelih hewan sebagai ibadah dan sarana mendekatkan diri kepada Allah. 3. Sungguh orang-orang yang membencimu dan mengacuhkan hidayah yang engkau bawa, dialah orang yang terputus. Tidak hanya terputus jejaknya, mereka pun dijauhkan dari rahmat Allah dan segala kebaikan. Keteladanan dan kebaikanmu akan terus menjadi pembicaraan sepanjang zaman dan keturunanmu akan terus mewarisi kebaikanmu."
  }
]