[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang yang membencimu dan membenci apa yang kamu bawa,dari hidayah dan cahaya,adalah orang yang tidak meninggalkan jejak kebaikan,terputus dari segala kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya orang yang benci kepadamu adalah orang yang terputus dari setiap kebaikan, yang terlupakan, yang apabila namanya disebut maka yang teringat darinya hanyalah keburukannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. فَصَلِّ لِرَبِّكَ (Maka dirikanlah shalat karena Tuhanmu) Yakni shalat wajib lima waktu. وَانۡحَرۡ( dan berkorbanlah) Dahulu manusia mengerjakan shalat dan menyembelih kurban untuk selain Allah. Maka Allah memerintahkan Nabi-Nya agar menjadikan shalat dan kurbannya hanya bagi Allah semata. Qatadah, ‘Atha, dan Ikrimah berkata: yang dimaksud adalah shalat ‘idhul adha dan menyembelih kurban setelah itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah menyebutnya dengan orang-orang yang membenci, seakan-akan Allah mengatakan : inilah orang yang membencimu tidak bisa berbuat apa-apa kecuali hanya membencimu, dan pembenci ketika ia sudah tidak lagi mampu berbuat keji, maka ketika itu hatinya akan terbakar dengan kemarahan dan kebencian. 2 ). Diantara ciri-ciri orang yang membenci Rasulullah yaitu ketika ia membenci risalah yang beliau bawakan, Ibnu Taimiyah mengomentari ayat ini, beliau mengatakan : hati-hatilah wahai kalian membenci risalah yang dibawakan oleh Rasulullah, atau kamu menolaknya hanya karena membela hawa nafsu, atau ingin mengangkat loyalitas kelompokmu, atau gurumu, atau bahkan kamu ingin menyibukkan diri untuk memuaskan syahwatmuu, atau sibuk dengan dunia, ketahuilah sesungguhnya Allah tidak memerintahkan ketaatan kepada selain-Nya kecuali ketaatan kepada Rasul-Nya. 3 ). Tidaklah seseorang itu lebih mengutamakan berkataan manusia dan pengetahunnya diatas al-Qur'an dan sunnah Rasul, dan jika saja ia tidak benci dengan apa dibawakan oleh Rasulullah niscaya ia tidak akan melakukan hal itu, bahkan diantara manusia ada yang melupakan al-Qur'an setelah menghafalkannya, dan mengangkat derajat perkataan manusia diatas al-Qur'an dan sunnah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Sesungguhnya pembencimu wahai Rasulallah, dia terputus dari kebaikan dunia dan akhirat, yaitu sebutan yang baik dan pujian yang indah. Akan tetapi secara lazim, mereka mendapat sebutan buruk yang selalu melekat selamanya sampai di neraka Jahanam. Adapun kamu wahai Nabi SAW, maka sebutanmu dan seruanmu yang baik akan tetap abadi sampai hari kiamat dan di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang yang membencimu} orang yang membencimu {dialah yang terputus} terputus dari setiap kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Sesungguhnya orang-orang yang membenci kamu,” yaitu orang yang tidak suka, mencela dan menghinamu, “dialah yang terputus,” yakni terputus dari semua kebaikan, terputus amal dan reputasi (nama) baiknya. Sementara Muhammad adalah sosok yang benar-benar sempurna yang memiliki kesempurnaan yang membuat manusia mengagungkan sebutannya dan banyak penolong serta pengikutnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّ شَانِئَكَ } Sesungguhnya orang-orang yang membencimu karena membawa risalah dari tuhanmu , { هُوَ الْأَبْتَرُ } dia terputus dari segala kebaikan, namanya tidak disebutkan untuk kebaikan, dan tidak juga dipuji karena kebaikan, urusanmu dengan mereka terputus. Sedangkan Nabi ﷺ telah ditinggikan penyebutannya baik ketika beliau masih hidup maupun setelah beliau meninggal dunia, bahkan sampai hari kiamat nama beliau akan terus ditinggikan, oleh karenanya tidak pernah putus dalam pendengaran kita ketika disebut nama Allah pasti nama bleiau disebut setelahnya, baik itu ketika azan dikumandangkan, atau dalam iqomah, dan saat khutbah dibacakan, dan ketika kita shalat pun nama beliau terus disebut bersaamaan dengan nama Allah ﷻ, Allah ﷻ berfirman : { وَرَفَعْنَا لَكَ ذِكْرَكَ } ( Dan Kami tinggikan bagimu sebutan (nama)mu ) [ Asy Syarh : 4 ] . Beberapa riwayat yang menjelaskan sebab turunnya ayat ini : Diriwayatkan oleh Ibnu Jarir yang bersumber dari Syamr bin ‘Athiyyah bahwa ‘Uqbah bin Abi Mu’aith berkata: “Tidak ada seorang pun anak laki-laki Nabi Muhammad saw yang hidup hingga keturunannya terputus.” Ayat ke 3 ini turun sebagai bantahan terhadap ucapan itu. Dan diriwayatkan oleh Ibnul Mundzir yang bersumber dari Ibnu Juraij bahwa ketika Ibrahim putra Rasulullah saw wafat, kaum Quraisy berkata, “Serkarang Muhammad menjadi abtar (terputus keturunannya).” Hal ini menyebabkan Nabi Muhammad saw bersedih hati. Maka turunlah ayat ini (al-Kautsar 1-3) sebagai penghibur baginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ \" Sesungguhnya orang-orang yang membenci kamu dialah yang terputus.\" Ini adalah pembanding dari pemberian yang banyak, Allah berfirman إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ \" Sesungguhnya orang-orang yang membenci kamu dialah yang terputus.\" Maknanya: Orang yang membencimu, الشَّنَآنُ [Asy-Syana'aan] maknanya adalah kebencian, contohnya adalah seperti dalam firman Allah Ta'ala: وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ أَنْ صَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ أَنْ تَعْتَدُوا \" Dan janganlah sekali-kali kebencian (mu) kepada sesuatu kaum karena mereka menghalang-halangi kamu dari Masjidilharam, mendorongmu berbuat aniaya (kepada mereka).\"(QS. Al-Maidah: 2) Janganlah engkau terbawa kebencian kepada mereka sehingga engkau berbuat semena-mena. وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَى أَلَّا تَعْدِلُوا اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَى \" Dan janganlah sekali-kali kebencianmu terhadap sesuatu kaum, mendorong kamu untuk berlaku tidak adil. Berlaku adillah, karena adil itu lebih dekat kepada takwa.\" Maknanya: Janganlah kamu terbawa kebencianmu kepada mereka sehingga kamu meninggalkan keadilan اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَى \" Berlaku adillah, karena adil itu lebih dekat kepada takwa.\" Kata شَانِئَكَ [Syani'aka] dalam firman-Nya إِنَّ شَانِئَكَ maknanya: Pembencimu هُوَ الْأَبْتَرُ Kata الأَبْتَر [al-Abtar] adalah isim tafdhil dari بَتْرٌ [Batrun] maknyanya putus. Makna abtar di sini adalah yang paling terputus dari segala kebaikan. Hal ini kaitannya tentang orang-orang kafir Quraisy yang mengatakan: Muhammad abtar (terputus dari semua kebaikan), tidak ada kebaikan dan keberkahan padanya dan pengikut-pengikutnya, terputus dari kebaikan. Ini terjadi saat anak beliau bernama Qasim radhiyallaahu 'anhu. Mereka mengatakan: Muhammad abtar, tidak diberi keturunan, meskipun diberi keturunan, keturunannya terputus. Maka Allah 'Azza Wa Jalla menjelaskan bahwa abtar sebenarnya adalah orang yang membenci Rasul shallallaahu 'alaihi wa sallam, inilah yang sebenarnya abtar, terputus dari segala kebaikan, yang tidak mendapatkan keberkahan, kehidupannya adalah penyesalan baginya. Jika pembenci beliau seperti ini maka samajuga orang yang membenci syari'atnya. Maka siapa saja yang membenci syari'at Rasul 'alaihissholaatu wassalaam, atau membenci syi'ar-syi'ar agama islam, atau membenci suatu ketaatan berupa ibadah yang dilakukan orang-orang dalam agama islam maka ia kafir, keluar dari agama, berdasarkan firman Allah Ta'ala: ذَلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنْزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ \" Yang demikian itu adalah karena sesungguhnya mereka benci kepada apa yang diturunkan Allah (syari'at islam) lalu Allah menghapuskan amal-amal mereka. \"(QS. Muhammad: 9) Dan amalan tidaklah gugur kecuali dengan kekufuran, maka siapa aja yang membenci wajibnya shalat maka ia kafir, walau pun ia shalat, dan siapa saja yang membenci zakat maka ia kafir walaupun menunaikannya. Tapi siapa saja yang merasa keberatan dengannya tanpa membenci maka pada dirinya terdapat perangai kemunafikan, tetapi ia tidak kafir, bedakanlah antara orang yang keberatan dengan orang yang membenci sesuatu. Kesimpilannya, surat ini mengandung penjelasan nikmat Allah kepada rasul-Nya shallallaahu 'alaihi wa sallam berupa pemberian kebaikan yang banyak kepadanya, kemudian mengandung perintah agar berbuat ikhlas kepada Allah 'Azza Wa Jalla di dalam shalt-shalat dan sembelihan, dan juga dalam semua ibadah-ibadah, kemudian mengandung penjelasan bahwa orang yang membenci Rasul 'alaihissholaatu wassalaam, atau membeci sedikit saja dari syari'atnya maka dialah yang terputus yang tidak ada kebaikan sama sekali padanya, tidak ada keberkahan padanya, kita meminta kepada Allah perlindungan dan keselamatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kautsar ayat 3: Ketahuilah wahai Nabi Allah, Allah bershalawat atasmu dan mengangkat kedudukanmu. Dan orang-orang yang membencimu adalah orang yang terputus dari segala kebaikan dan dari kedudukan yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk pula yang mencelamu dan merendahkanmu. Yakni terputus dari semua kebaikan, terputus namanya atau terputus keturunannya. Adapun Nabi shallallahu 'alaihi wa sallam, maka Beliau adalah seorang yang sempurna; yang memimiliki kesempurnaan yang mungkin pada makhluk berupa nama yang tinggi, banyak pembela dan pengikut. Menurut penyusun tafsir Al Jalaalain, ayat ini turun berkenaan dengan ‘Aash bin Wa’il yang menyebut Nabi shallallahu 'alaihi wa sallam sebagai abtar (yang terputus keturunannya) ketika wafat putera Beliau, yaitu Al Qaasim, wallahu a’lam. Ibnu Katsir berkata: Al Bazzar berkata: Telah menceritakan kepada kami Ziyad bin Yahya Al Hassaaniy, telah menceritakan kepada kami Ibnu Abi ‘Addiy dari Dawud dari Ikrimah dari Ibnu Abbas, ia berkata: Ka’ab bin Al Asyraf pernah datang ke Mekah, lalu orang-orang Quraisy berkata kepadanya, “Engkau adalah tokoh mereka, tidakkah engkau melihat kepada laki-laki hina ini yang terputus (keturunannya) dari kalangan kaumnya, ia mengatakan bahwa dirinya lebih baik daripada kita, padahal kita adalah orang-orang yang melakukan haji, para pelayan (Ka’bah) dan para pemberi minum (jamaah haji).” Maka Ka’ab berkata, “Kamu lebih baik darinya.” Maka turunlah ayat, “Sungguh, orang-orang yang membencimu dialah yang terputus.” (HR. Al Bazzar dan isnadnya adalah shahih. Hadits ini diriwayatkan pula oleh Ibnu Jarir (30/330) dari jalan gurunya Muhammad bin Basysyar, telah menceritakan kepada kami Ibnu Abi ‘Addiy, dst. Dan di sana ditambahkan, “Dan diturunkanlah kepada Beliau, “Alam tara ilalladziina uutuu nashiibam minal kitaab Sampai firman Allah Ta’ala, “nashiiraa.” (An Nisaa’: 51-52) Namun yang rajih menurut Syaikh Muqbil, bahwa hadits tersebut adalah mursal (Lihat Ash Shahiihul Musnad hal. 271)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kautsar Ayat 3",
    "description": "Sungguh orang-orang yang membencimu dan mengacuhkan hidayah yang engkau bawa, dialah orang yang terputus. Tidak hanya terputus jejaknya, mereka pun dijauhkan dari rahmat Allah dan segala kebaikan. Keteladanan dan kebaikanmu akan terus menjadi pembicaraan sepanjang zaman dan keturunanmu akan terus mewarisi kebaikanmu. 1. Wahai nabi Muhammad, katakanlah, 'wahai orang-orang yang me-milih kafir sebagai jalan hidup!."
  }
]