[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. Apabila bumi diguncang dengan dahsyat, Bumi mengeluarkan isi perutnya, yaitu orang orang mati dan kekayaannya. Dan manusia bertanya tanya ketakutan, ”apa yang terjadi padanya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Apabila bumi diguncangkan dengan guncangan keras yang terjadi pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Ketika bumi digoncangkan dengan keras pada hari kebangkitan, yang merupakan bagian dari goncangan alam semesta yang setelahnya manusia akan dibangkitkan dan berdiri di hadapan Allah untuk menjalani hisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا (Apabila bumi digoncangkan dengan goncangan (yang dahsyat)) Yakni jika bumi digoncangkan dengan goncangan yang keras hingga segala yang ada di atasnya hancur lebur."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Muhammad bin ka'ab al-Qurzy berkata : \"Membaca az-zalzalah dan al-Qori'ah tanpa melebihi keduanya di malam hariku, serta mengulang-ulaىginya dan bertafakkur tentang keduanya, lebih aku suka daripada membaca al-Qur'an lebih banyak dengan bacaan yang cepat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Tirmidzi, Abu Dawud, dan Nasa’I mengatakan dari Abdullah bin Umar dalam hadits yang menjelaskan bahwa ada seorang laki-laki yang berkata: ”Bacakanlah untukku ya Rasulallah satu surah secara keseluruhan”, kemudian beliau membaca {Idza zulzilatil ardhu zilzaalaha} [Az-Zalzalah: 99/1] sampai ayat terakhir. Kemudian dia berkata: “Demi Dzat yang mengutusmu sebagai nabi dengan membawa kebenaran, aku tidak akan menambah-nambahi {bacaan} surah ini selama-lamanya”. Lalu Rasulallah SAW bersabda: “Beruntunglah engkau, beruntunglah engkau”. Tirmidzi juga mengatakan dari Anas bin Malik bahwa sesungguhnya Rasulallah SAW bersabda: “{idza zulzilatil ardhu} adalah seperempat Al-Qur’an” 1-2. Tatkala bumi diombang-ambingkan dan digerak-gerakan dengan gerakan yang sangat keras pada hari kiamat di tiupan pertama (sangkakala) dan (tiupan-tiupan) setelahnya diiringi guncangan-guncangan tertentu, maka dia akan mengeluarkan semua isi perutnya yang berupa mayat-mayat, timbunan-tumbunan dan hal-hal lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila bumi diguncangkan} digerakkan {dengan guncangan yang dahsyat} dengan guncangan yang dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah memberitahukan tentang apa yang terjadi pada Hari Kiamat. Bumi bergoncang dan bergoyang hingga meruntuhkan bangunan dan gunung yang ada di atasnya. Gunung digoncang dan diratakan puing-puingnya hingga menjadi hamparan tanah luas yang tidak ada celahnya. “Dan bumi telah mengeluarkan beban-beban berat (yang dikandungnya),” yakni apa saja yang ada di perutnya berupa mayat dan yang tersimpan bumi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Allah - عز وجل - mengabarkan bahwasanya akan terjadi suatu peristiwa besar di bumi ini setelah sebelumnya ketenangan dan kehidupan yang aman meliputinya, akan datang padanya zaman ketika itu bumi terguncang dengan sangat dahsyat, yaitu ketika kiamat tiba dengan segala kehancuran yang di tetapkan untuk bumi serta semua penghuninya, yaitu pada hari berakhirnya kehidupan didunia ini. Allah- عز وجل - berfirman : { إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا } Apabila bila bumi ini digoncangkan dengan goncangan sangat dahsyat, semua bagian-bgian bumi akan digoncangkan tanpa pengecualian, bukan goncangan yang terjadi saat sekarang ini ketika terjadi gempa di sebagian dari belahan bumi, walaupun demikian goncangan yang kecil itu memporak-porandakan wilayah yang terkena gempa tersebut, lalau bagaimana dengan goncangan yang akan menghancurkan seluruh bagian dari bumi, peristiwa yang sangat dahsyat, ole karenaitu Allah - عز وجل - berfirman : { يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ ۚ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ , يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَىٰ وَمَا هُمْ بِسُكَارَىٰ وَلَٰكِنَّ عَذَابَ اللَّهِ شَدِيدٌ } ( Hai manusia, bertakwalah kepada Tuhanmu; sesungguhnya kegoncangan hari kiamat itu adalah suatu kejadian yang sangat besar (dahsyat) , (Ingatlah) pada hari (ketika) kamu melihat kegoncangan itu, lalailah semua wanita yang menyusui anaknya dari anak yang disusuinya dan gugurlah kandungan segala wanita yang hamil, dan kamu lihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk, akan tetapi azab Allah itu sangat kerasnya. ) [ Al-Hajj : 1-2 ] . di ayat lain Allah berfirman : { يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيبًا مَهِيلًا } ( Pada hari bumi dan gunung-gunung bergoncangan, dan menjadilah gunung-gunung itu tumpukan-tumpukan pasir yang berterbangan. ) [ Al-Muzzammil : 14 ] , dan Allah berfirman : { يَوْمَ تَرْجُفُ الرَّاجِفَةُ , تَتْبَعُهَا الرَّادِفَةُ } ( (Sesungguhnya kamu akan dibangkitkan) pada hari ketika tiupan pertama menggoncang alam , Tiupan pertama itu diiringi oleh tiupan kedua. ) [ An Nazi'at : 6-7 ] , ayat-ayat diatas bermaksud satu makna yang sama walaupun lafazh nya berbeda. Bumi akan tergoncang pada hari kiamat dengan goncangan yang sangat dahsyat dan mengahcurkan, maka seketika apa yang ada diatasnya akan berubah, dan apa yang ditimbun dalam perutnya akan keluar, perisiwa yang sungguh sangat menakutkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا \" Apabila bumi diguncangkan dengan guncangannya (yang dahsyat),\" Yang di maksud di sini adalah sebagaimana yang disebutkan Allah Ta'ala dalam firman-Nya: يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ (1) يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ \" Hai manusia, bertakwalah kepada Tuhanmu; sesungguhnya keguncangan hari kiamat itu adalah suatu kejadian yang sangat besar (dahsyat). (Ingatlah) pada hari (ketika) kamu melihat keguncangan itu, lalailah semua wanita yang menyusui anaknya dari anak yang disusuinya dan gugurlah kandungan segala wanita yang hamil, dan kamu lihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk, akan tetapi azab Allah itu sangat keras.\"(QS. Al-Hajj:1-2) Dan firman-Nya: زِلْزَالَهَا \"Guncangannya\" Yaitu guncangan besar yang belum pernah terjadi sebelumnya sama sekali, oleh karenanya Allah 'Azza Wa Jalla berfirman: وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى \" dan kamu lihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk \" Karena saking paniknya mereka, dan yang apa-apa yang menimpa mereka, anda mendapati mereka seperti sedang mabuk, padahal sebenarnya mereka tidak mabuk, bahkan mereka dalam kondisi sehat. Tetapi karena betapa ngerinya hari itu, manusia menjadi seperti sedang mabuk, dia tidak tahu bagaimana harus bertindak dan berbuat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 1: 1-3. Surat ini dimulai dengan kejadian berkenaan dengan goncangan besar yang akan terjadi pada hari kiamat, Allah berkata : Jika aku guncangkan bumi, aku getarkan dan aku hancurkan sehancur-hancurnya. Dan aku keluarkan padanya perbendaharaan dan semua apa yang terkandung dalam perutnya. Adapun mayit-mayit akan Allah keluarkan ketika tiupan yang kedua, maka berkatalah manusia kebingungan dengan apa yang dilihat dan nampak : Apa yang sebenarnya telah terjadi ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang hal yang akan terjadi pada hari Kiamat, yaitu bahwa bumi akan diguncangkan dengan guncangan yang dahsyat sehingga bangunan-bangunan di atasnya runtuh semua. Demikian pula gunung-gunung dan perbukitan akan diratakan sehingga menjadi datar sama sekali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 1",
    "description": "1-3. Banyak kejadian dahsyat yang terjadi di bumi ketika kiamat tiba. Apabila bumi diguncangkan oleh malaikat atas perintah Allah dengan guncangan yang dahsyat setelah israfil meniupkan sangkakala pertama, dan bumi telah mengeluarkan beban-beban berat yang dikandung-Nya, baik kekayaan yang ada di dalamnya atau mayat-mayat yang terkubur, dan pada saat itu manusia bertanya dengan penuh kekalutan dan ketakutan, 'apa yang terjadi pada bumi ini' mengapa bumi berguncang sedemikian dahsyat dan mengeluarkan apa saja yang dikandungnya' apakah ini hari kiamat''1-3"
  }
]