[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. Apabila bumi diguncang dengan dahsyat, Bumi mengeluarkan isi perutnya, yaitu orang orang mati dan kekayaannya. Dan manusia bertanya tanya ketakutan, ”apa yang terjadi padanya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan bumi mengeluarkan mayat-mayat dan kandungan lainnya yang berada di dalam perutnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Ketika bumi mengeluarkan isi perutnya, baik itu lapisannya, barang-barang tembaga, dan segala yang terkubur. Hal ini disebabkan letusan dahsyat yang berulang-ulang atas izin Allah. Dan ketika itu keluar juga seluruh mayat dari perutnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا(dan bumi telah mengeluarkan beban-beban berat (yang dikandung)nya) Berupa mayat-mayat dan segala yang terkubur di dalamnya. Adapun mayat-mayat itu akan keluar dari bumi pada tiupan sangkakala kedua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Tatkala bumi diombang-ambingkan dan digerak-gerakan dengan gerakan yang sangat keras pada hari kiamat di tiupan pertama (sangkakala) dan (tiupan-tiupan) setelahnya diiringi guncangan-guncangan tertentu, maka dia akan mengeluarkan semua isi perutnya yang berupa mayat-mayat, timbunan-tumbunan dan hal-hal lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan bumi telah mengeluarkan beban-beban beratnya} mayat-mayat dan harta simpanannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah memberitahukan tentang apa yang terjadi pada Hari Kiamat. Bumi bergoncang dan bergoyang hingga meruntuhkan bangunan dan gunung yang ada di atasnya. Gunung digoncang dan diratakan puing-puingnya hingga menjadi hamparan tanah luas yang tidak ada celahnya. “Dan bumi telah mengeluarkan beban-beban berat (yang dikandungnya),” yakni apa saja yang ada di perutnya berupa mayat dan yang tersimpan bumi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا } Dan bumi akan megeluarkan seluruh isi perutnya yang menjadi beban, seperti mayat-mayat, barang tambang, harta timbunan, dan sebagainya, bumi akan memuntahkan apaun yang tertimbun didalam perutnya ketika peristiwa kiamat yang maha dahsyat itu terjadi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا \" dan bumi telah mengeluarkan beban-beban berat (yang dikandung) nya,\" Maksud beban-beban berat di sini adalah para penghuni kubur. Sesungguhnya apabila ditiupkan sangkakala, maka siapa pun yang ada di langit dan di bumi akan mati, kecuali yang Allah kehendaki. Kemudian ditiupkan lagi ke berikutnya, serntak mereka berdiri kembali dan menunggu, mereka keluar dari kubur-kubur mereka untuk menghadap Rabbul 'alamiin 'Azza Wa Jalla, sebagaimana Allah Tabaraka Wa Ta'ala berfirman: يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ \" (yaitu) hari (ketika) manusia berdiri menghadap Tuhan semesta alam?\"(QS. Al-Muthaffifin: 6)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 2: 1-3. Surat ini dimulai dengan kejadian berkenaan dengan goncangan besar yang akan terjadi pada hari kiamat, Allah berkata : Jika aku guncangkan bumi, aku getarkan dan aku hancurkan sehancur-hancurnya. Dan aku keluarkan padanya perbendaharaan dan semua apa yang terkandung dalam perutnya. Adapun mayit-mayit akan Allah keluarkan ketika tiupan yang kedua, maka berkatalah manusia kebingungan dengan apa yang dilihat dan nampak : Apa yang sebenarnya telah terjadi ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu perbendaharaannya dan orang-orang yang telah mati yang dikubur di dalamnya. Semua itu akan dimuntahkan ke atasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 2",
    "description": "1-3. Banyak kejadian dahsyat yang terjadi di bumi ketika kiamat tiba. Apabila bumi diguncangkan oleh malaikat atas perintah Allah dengan guncangan yang dahsyat setelah israfil meniupkan sangkakala pertama, dan bumi telah mengeluarkan beban-beban berat yang dikandung-Nya, baik kekayaan yang ada di dalamnya atau mayat-mayat yang terkubur, dan pada saat itu manusia bertanya dengan penuh kekalutan dan ketakutan, 'apa yang terjadi pada bumi ini' mengapa bumi berguncang sedemikian dahsyat dan mengeluarkan apa saja yang dikandungnya' apakah ini hari kiamat''1-3"
  }
]