[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. Apabila bumi diguncang dengan dahsyat, Bumi mengeluarkan isi perutnya, yaitu orang orang mati dan kekayaannya. Dan manusia bertanya tanya ketakutan, ”apa yang terjadi padanya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan manusia berkata dalam kondisi bingung, “Kenapa bumi bergerak dan berguncang?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dan kamu akan melihat manusia tidak dapat mengurusi urusannya sama sekali, sehingga ia akan ketakutan dan kebingungan karena melihat sesuatu yang belum pernah dia lihat, kemudian dia akan bertanya-tanya, apa yang sedang terjadi?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَقَالَ الْإِنسٰنُ مَا لَهَا (dan manusia bertanya: “Mengapa bumi (menjadi begini)?”) Yakni ia bertanya karena merasa heran dengan apa yang menimpa bumi: “mengapa bumi digoncang dan dikeluarkan segala isinya?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Maka orang kafir yang terkejut dengan hal yang dia ingkari itu berkata: “Apa yang membuat bumi mengalami guncangan ini”. Dia terkejut dengan kondisi genting ini. Pada hari itu, bumi mengabarkan beritanya, dia berbicara menggunakan situasi atau ungkapan itu, untuk menyampaikan firman Allah SWT melalui semua hal yang dialaminya baik kebaikan maupun keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan manusia bertanya, \"Apa yang terjadi padanya\"} apa yang terjadi pada bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan manusia bertanya,” ketika melihat hal-hal besar yang menimpa bumi karena begitu besarnya peristiwa itu, “Mengapa bumi (jadi begini)?” yakni apa yang menimpanya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَقَالَ الْإِنْسَانُ مَا لَهَا } Dan manusia bertanya-tanya : \"ada apa dengan bumi ini ? \", \"apa yang menjadi penyebab bergoncangnya bumi ? \" ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَقَالَ الْإِنْسَانُ مَا لَهَا \" dan manusia bertanya: \"Mengapa bumi (jadi begini)?\" Manusia yang dimaksudkan di sini adalah jenis, yaitu: Bahwa manusia akan mengatakan: Apa yang terjadi pada bumi? Apa yang terjadi padanya dengan guncangan ini? Ini karena ia muncul seakan akan sebagaimana diberitakan Allah \"mereka mabuk\"(QS. Al-Hajj: 2) Ia berkata: Apa yang terjadi pada bumi apa gerangannya? Karena saking mankutkannya hari itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 3: 1-3. Surat ini dimulai dengan kejadian berkenaan dengan goncangan besar yang akan terjadi pada hari kiamat, Allah berkata : Jika aku guncangkan bumi, aku getarkan dan aku hancurkan sehancur-hancurnya. Dan aku keluarkan padanya perbendaharaan dan semua apa yang terkandung dalam perutnya. Adapun mayit-mayit akan Allah keluarkan ketika tiupan yang kedua, maka berkatalah manusia kebingungan dengan apa yang dilihat dan nampak : Apa yang sebenarnya telah terjadi ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu orang yang kafir kepada kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 3",
    "description": "1-3. Banyak kejadian dahsyat yang terjadi di bumi ketika kiamat tiba. Apabila bumi diguncangkan oleh malaikat atas perintah Allah dengan guncangan yang dahsyat setelah israfil meniupkan sangkakala pertama, dan bumi telah mengeluarkan beban-beban berat yang dikandung-Nya, baik kekayaan yang ada di dalamnya atau mayat-mayat yang terkubur, dan pada saat itu manusia bertanya dengan penuh kekalutan dan ketakutan, 'apa yang terjadi pada bumi ini' mengapa bumi berguncang sedemikian dahsyat dan mengeluarkan apa saja yang dikandungnya' apakah ini hari kiamat''4. Pada hari itu bumi menyampaikan beritanya kepada manusia, mengapa bumi berguncang dan mengeluarkan semua kandungannya. Pada hari itu pula bumi bersaksi kepada Allah dengan rinci apa saja yang telah manusia lakukan di atasnya: kebajikan atau keburukan, besar atau kecil."
  }
]