[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Pada hari kiamat,bumi akan mengabarkan tentang apa yang di lakukan diatasnya, kebaikan atau keburukan, Dan bahwasanya Allah memerintahkannya agar mengabarkan tentang apa yang dilakukan di atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Pada hari yang agung itu bumi mengabarkan tentang apa yang pernah dilakukan di atasnya, yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Pada waktu yang sulit dan menakutkan itu, bumi bergoncang dan mengeluarkan beban yang ada di perutnya. Dan manusia akan berkata, apa yang terjadi dengan bumi? Maka ketika itu bumi akan mengatakan kepada manusia tentang keadaannnya yang menakutkan dan sebab ia mengelurkan beban-bebannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا (pada hari itu bumi menceritakan beritanya) Yakni menceritakan tentang dirinya dan mengatakan kebaikan dan keburukan yang dilakukan di atas permukaannya. Allah menjadikannya dapat berbicara agar menjadi saksi atas manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Maka orang kafir yang terkejut dengan hal yang dia ingkari itu berkata: “Apa yang membuat bumi mengalami guncangan ini”. Dia terkejut dengan kondisi genting ini. Pada hari itu, bumi mengabarkan beritanya, dia berbicara menggunakan situasi atau ungkapan itu, untuk menyampaikan firman Allah SWT melalui semua hal yang dialaminya baik kebaikan maupun keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu bumi menyampaikan beritanya} bumi memberitahukan apa yang dilakukan di atasnya, kebiakan ataupun keburukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-5. “Pada hari itu bumi menceritakan beritanya,” yakni bumi akan bersaksi atas perbuatan baik dan buruk yang dilakukan manusia di atasnya. Bumi adalah satu dari sekian saksi yang bersaksi untuk manusia atas perbuatan-perbuatan mereka. Demikian itu “karena sesungguhnya Rabbmu telah memerintahkan (yang demikian itu) kepadanya,” yakni memerintahkan bumi untuk memberitahukan perbuatan yang dilakukan di atasnya dan bumi tidak mendurhakai perintahNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ يَوْمَئِذٍ } Pada hari bergongangnya bumi, { تُحَدِّثُ أَخْبَارَهَا } bumi menceritakan kabar tentangnya, tentang apa yang telah diperbuat oleh manusia diatasnya, baik itu kabar baik maupun kabar buruk, bumi akan bersaksi atas apa yang telah dilakukan oleh manusia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَوْمَئِذٍ \"Pada hari itu\" Maknanya: Pada hari ketika bumi berguncang تُحَدِّثُ أَخْبَارَهَا \" bumi menceritakan beritanya \" Maknanya: Memberitakan tentang apa yang telah diperbuat manusia di atasnya baik perbuatan baik atau pun buruk. Dan telah datang hadits Nabi Shallallaahu 'alaihi wa sallam bahwa muadzin apabila ia azan maka sungguh tidaklah mendengar lantunan suaranya, baik pohon, batu dan sesuatu melainkan akan menjadi saksi baginya pada hari kiamat (1). Bumi akan menjadi saksi terhadap apa yang diperbuat oleh manusia di atasnya, baik berupa amalan baik atau amalan buruk, dan kesaksian ini adalah bertujuan menjelaskan adilnya Allah 'Azza Wa Jalla, dan bahwa Allah Subhaanahu Wa Ta'ala tidak akan mengazab manusia melainkan sesuai dengan amalan yang telah mereka perbuat, meski begitu, Allah tetap Maha Meliputi mengetahui segala sesuatu. Tetapi dalam rangka menegakkan keadilan dan agar tidak ada pengingkaran orang jahat, karena orang orang jahat mereka ingkar (engkan mengaku) kalau mereka adalah orang-orang musyrik. Allah Ta'ala berfirman: ثُمَّ لَمْ تَكُنْ فِتْنَتُهُمْ إِلَّا أَنْ قَالُوا وَاللَّهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ \" Kemudian tiadalah fitnah mereka, kecuali mengatakan: \"Demi Allah, Tuhan kami, tiadalah kami mempersekutukan Allah\" \" karena ketika mereka melihat ahlut tauhid, telah terbebas dari siksa dan selamat darinya, mereka mengiingkari (enggan mengakui) kesyirikan mereka, mereka berharap selamat dari siksa, tetapi mulut-mulut mereka dibungkam, dan yang berbicara adalah tangan-tangan,dan kaki-kaki, kulit dan lidah menjadi saksi atas perbuatan manusia terhadap perbuatannya. Pada saat itu ia tidak bisa lagi terus mengingkari perbuatannya tapi dia akan mengikrarkan dan mengaku, hanya saja penyesalan tidak lagi bermanfaat pada saat itu. Dan Firman Allah: يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا \" pada hari itu bumi menceritakan beritanya,\"adalah jawaban dari firman AllahTa'ala إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا (1) وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا (2) وَقَالَ الْإِنْسَانُ مَا لَهَا \" Apabila bumi diguncangkan dengan guncangannya (yang dahsyat), dan bumi telah mengeluarkan beban-beban berat (yang dikandung) nya, dan manusia bertanya: \"Mengapa bumi (jadi begini)?\" (1) Dikeluarkan Bukhari (609) dari hadits Abu Sa'id al-Khudriy radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 4: 4-5. Allah menjelaskan bahwa bumi pada saat digoncangkan ia ketakutan, dan akan mengabarkan atas apa yang telah diperbuat padanya dari kebaikan maupun keburukan. pengkabaran itu terjadi karena sebab Allah memuliakan urusannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni memberitakan apa yang dikerjakan di atasnya; kebaikan atau keburukan. Syaikh As Sa’diy berkata, “Bumi akan bersaksi terhadap orang-orang yang beramal tentang apa yang mereka kerjakan di atasnya, baik atau buruk, karena bumi termasuk para saksi terhadap hamba tentang amal yang mereka kerjakan.” Hal itu, karena Allah Subhaanahu wa Ta'aala memerintahkan bumi untuk memberitahukan apa yang dikerjakan di atasnya, maka ia tidak mendurhakai perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 4",
    "description": "Pada hari itu bumi menyampaikan beritanya kepada manusia, mengapa bumi berguncang dan mengeluarkan semua kandungannya. Pada hari itu pula bumi bersaksi kepada Allah dengan rinci apa saja yang telah manusia lakukan di atasnya: kebajikan atau keburukan, besar atau kecil. 5. Bumi menyampaikan kepada manusia apa yang terjadi padanya dan bersaksi di hadapan Allah tentang apa saja yang manusia lakukan di atasnya karena sesungguhnya tuhan'mu telah memerintahkan padanya untuk berbuat demikian."
  }
]