[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Pada hari kiamat,bumi akan mengabarkan tentang apa yang di lakukan diatasnya, kebaikan atau keburukan, Dan bahwasanya Allah memerintahkannya agar mengabarkan tentang apa yang dilakukan di atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Karena Allah memberitahukan kepadanya dan memerintahkannya untuk itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا (karena sesungguhnya Tuhanmu telah memerintahkan (yang sedemikian itu) kepadanya) Yakni bumi menceritakan beritanya dengan wahyu dan perintah dari Allah agar berbicara dan menjadi saksi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dia berbicara melalui kejadian itu atas perintah Allah kepadanya. Allah memerintahkannya untuk mengeluarkan beban-beban beratnya dan berbicara tentang beritanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{karena sesungguhnya Tuhanmu telah memerintahkan padanya} karena Allah memerintahkannya untuk memberitahu apa yang dilakukan di atasnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-5. “Pada hari itu bumi menceritakan beritanya,” yakni bumi akan bersaksi atas perbuatan baik dan buruk yang dilakukan manusia di atasnya. Bumi adalah satu dari sekian saksi yang bersaksi untuk manusia atas perbuatan-perbuatan mereka. Demikian itu “karena sesungguhnya Rabbmu telah memerintahkan (yang demikian itu) kepadanya,” yakni memerintahkan bumi untuk memberitahukan perbuatan yang dilakukan di atasnya dan bumi tidak mendurhakai perintahNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Apa yang menjadikan bumi ini berbicara dan menceritakan berita tentangnya ? { بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا } Allah - عز وجل - yang menjadikan bumi ini mampu berbicara kemudian ia menceritakan kabar-kabar yang telah terjadi diatasnya, bumi juga menjadi saksi atas perbuatan ummat manusia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah: بِأَنَّ رَبَّكَ أَوْحَى لَهَا \" karena sesungguhnya Tuhanmu telah memerintahkan (yang sedemikian itu) kepadanya.\" Maknanya: Karena disebabkan Allah telah mewahyukan kepadanya, yakni: Allah telah mengizinkannya untuk memberitakan berita-beritanya. Dan Allah subhaanahu wa Ta'ala Maha Kuasa atas segala sesuatu, apa bila Allah memerintah dangan suatu perintah, maka itu pasti terjadi. Allah mengajak bicara benda mati, maka benda mati itu bisa berbicara sebagaimana Allah Ta'ala berfirman: ثُمَّ اسْتَوَى إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ \" Kemudian Dia menuju ke atas langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi: \"Datanglah kamu keduanya menurut perintah-Ku dengan suka hati atau terpaksa\". Keduanya menjawab: \"Kami datang dengan suka hati\"(QS. Fishilat: 11) Allah Ta'ala berfirman kepada al-Qalam (pena): اُكْتُبْ \"Tulislah?\" ia menjawab: \"Ya Rabb, apakah yang saya tulis? Allah menjawab: اُكْتُبْ مَا هُوَ كَائْنٌ إِلَى يَوْمِ القِيَامَةِ \" Tulislah apa-apa yang terjadi hingga hari kiamat \"(1) Allah ta'ala berfirman: الْيَوْمَ نَخْتِمُ عَلَى أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ (65) \" Pada hari ini Kami tutup mulut mereka; dan berkatalah kepada Kami tangan mereka dan memberi kesaksianlah kaki mereka terhadap apa yang dahulu mereka usahakan.\"(QS. Yasin: 65) Allah 'Azza Wa Jalla bila mengajak bicara kepada sesuatu walau pun itu adalah benda mati maka ia akan bisa berbicara kepada Allah. Oleh karenanya Allah berfirman: يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا (4) بِأَنَّ رَبَّكَ أَوْحَى لَهَا \" pada hari itu bumi menceritakan beritanya, karena sesungguhnya Rabbmu telah memerintahkan (yang sedemikian itu) kepadanya.\" (1) Dikeluarkan oleh Abu Daud (4700) dan Tirmidziy (2155) dari hadits Ubadah Bin Shamit radhiyallaahu 'anhu, dinyatakan shahih oleh Al-Albaniy dalam shahih al-Jami' (2017)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 5: 4-5. Allah menjelaskan bahwa bumi pada saat digoncangkan ia ketakutan, dan akan mengabarkan atas apa yang telah diperbuat padanya dari kebaikan maupun keburukan. pengkabaran itu terjadi karena sebab Allah memuliakan urusannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 5",
    "description": "Bumi menyampaikan kepada manusia apa yang terjadi padanya dan bersaksi di hadapan Allah tentang apa saja yang manusia lakukan di atasnya karena sesungguhnya tuhan'mu telah memerintahkan padanya untuk berbuat demikian. 6. Pada hari itu manusia keluar dari kuburnya untuk menuju tempat hisab, atau beranjak dari tempat hisab itu, dalam keadaan berkelompok-kelompok. Kondisi mereka beragam; sebagian merasa tenang dan sebagian yang lain begitu gundah dan ketakutan. Mereka digiring dengan gegas ke surga atau neraka untuk diperlihatkan kepada mereka balasan semua perbuatannya yang telah Allah janjikan."
  }
]