[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari itu, seluruh manusia pulang ketempat perhitungan amal dalam kelompok kelompok yang beragam, agar Allah memperlihatkan kepada mereka apa yang mereka lakukan, kebaikan-kebaikan atau keburukan-keburukan, lalu membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Pada Hari yang agung itu, di saat bumi bergoncang, manusia keluar secara berkelompok dari tempat perhitungan untuk menyaksikan amal perbuatan yang pernah mereka lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Ketika itu semua terjadi, manusia akan menuju padang mahsyar secara berkelompok-kelompok; setiap kelompok pergi ke arah yang sesuai dengan amalan dan kedudukannya, seperti orang-orang yang pergi dari mata air. Mereka pergi untuk menerima balasan amal perbuatan mereka dan melihatnya dengan mata kepala mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا (Pada hari itu manusia ke luar dari kuburnya dalam keadaan bermacam-macam) Yakni manusia keluar dari kuburnya menuju tempat untuk hisab, mereka berhamburan ke kiri dan ke kanan sesuai dengan agama dan amalan mereka. لِّيُرَوْا۟ أَعْمٰلَهُمْ (supaya diperlihatkan kepada mereka (balasan) pekerjaan mereka) Yakni agar Allah menunjukkan kepada mereka amal yang telah mereka perbuat. Pendapat lain mengatakan: yakni untuk menunjukkan kepada mereka balasan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Pada hari itu, manusia keluar dari kuburnya menuju tempat penghitungan (amal) secara terpisah untuk diperlihatkan oleh Allah kepada balasan perbuatan mereka yaitu surga atau neraka. Jadi barangsiapa melakukan suatu kebaikan di dunia seberat dzarrah (semut kecil), maka dia akan mengetahui balasannya di akhirat. Imam Bukhari dan Imam Muslim mengatakan dari Abu Hurairah bahwa sesungguhnya Rasulallah SAW menamai ayat ini sebagai ayat yang sangat dahsyat secara keseluruhannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu manusia keluar} manusia keluar menuju tempat perhitungan {dalam berkelompok-kelompok} dalam kelompok-kelompok {untuk diperlihatkan kepada mereka semua perbuatan mereka} supaya Allah memperlihatkan kepada mereka amal yang telah mereka perbuat di muka bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Pada hari itu manusia keluar dari kuburnya,” menuju tempat pemberhentian kiamat ketika Allah memutuskan perkara di antara mereka, “dalam keadaan yang bermacam-macam,” yakni bermacam-macam golongan, “supaya diperlihatkan kepada mereka balasan pekerjaan mereka,” yakni supaya Allah memberitahukan perbuatan baik atau buruk yang mereka lakukan dan memberitahukan balasannya dengan sempurna."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ يَوْمَئِذٍ يَصْدُرُ النَّاسُ } Pada hari itu manusia keluar dari tempat pemberhentiannya setelah menjalani kehidupan di dunia, yakni kubur kemudian mereka akan keluar dari tepat berkumpulnya seluruh umat manusia setelah kematian, { أَشْتَاتًا } mereka akan keluar dengan berbondong-bondong dan dalam keadaan berbeda-beda, seluruh orang-orang beriman, dan juga orang-orang kafir, ketika di dunia mereka bercampur baur dalam komunikasi, dan ketika di padang mahsyar mereka juga dikumpulkan dalam keadaan bercampur satu sama lain, lalu kemudian mereka akan dipisahkan satu sama lain tanpa adanya pertemuan setelahnya, sebagaimana yang Allah - عز وجل - katakan dalam firman-Nya : { وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَتَفَرَّقُونَ , فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ , وَأَمَّا الَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا وَلِقَاءِ الْآخِرَةِ فَأُولَٰئِكَ فِي الْعَذَابِ مُحْضَرُونَ } ( Dan pada hari terjadinya kiamat, di hari itu mereka (manusia) bergolong-golongan , Adapun orang-orang yang beriman dan mengerjakan amal saleh, maka mereka di dalam taman (surga) bergembira , Adapun orang-orang yang kafir dan mendustakan ayat-ayat Kami (Al Quran) serta (mendustakan) menemui hari akhirat, maka mereka tetap berada di dalam siksaan (neraka) ) [ Ar-Rum : 14 - 15 ] , Allah juga berfirman : { رِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ } ( Segolongan masuk surga, dan segolongan masuk Jahannam ) [ Asy-Syura : 7 ] , untuk apa mereka dipisahkan seperti itu ? { لِيُرَوْا أَعْمَالَهُمْ } Setiap mereka akan melihat apa yang telah diperbuat di dunia, bai itu amalan baik maupun amalan buruk, dan tidak mungkin bisa mereka akan merubah amalan-amalan tersebut, atau ingin kembali melakukan apa yang belum diperbuat dari amalan shalih, atau bahkan ingin bertaubat maka itu tidak akan bermanfaat baginya, tidak seorang pun akan bisa berbuat atau berharap demikian jika kiamat itu telah tiba."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta'ala: يَوْمَئِذٍ \"pada hari itu\" Yakni: Pada hari berguncangnya bimu dengan guncangannya يَصْدُرُ النَّاسُ أَشْتَاتًا لِيُرَوْا أَعْمَالَهُمْ \" manusia ke luar dari kuburnya dalam keadaan yang bermacam-macam, supaya diperlihatkan kepada mereka (balasan) pekerjaan mereka\" Maknanya: Kelompok-kelompok yang bermacam-macam, mereka keluar menuji tempat kembalinya. Para penghun surga – semoga Allah menjadikan kita termasuk mereka- mereka menuju ke surga, dan penghuni neraka – semoga Allah melindungi kita – akan digiring ke neraka يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا (85) وَنَسُوقُ الْمُجْرِمِينَ إِلَى جَهَنَّمَ وِرْدًا (86) لَا يَمْلِكُونَ الشَّفَاعَةَ إِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمَنِ عَهْدًا \" (Ingatlah) hari (ketika) Kami mengumpulkan orang-orang yang takwa kepada Tuhan Yang Maha Pemurah sebagai perutusan yang terhormat, dan Kami akan menghalau orang-orang yang durhaka ke neraka Jahanam dalam keadaan dahaga.Mereka tidak berhak mendapat syafaat kecuali orang yang telah mengadakan perjanjian di sisi Tuhan Yang Maha Pemurah.\"(QS. 85-87) Manusia akan keluar dengan berkelompok berdasarkan golongan-golongan yang berbeda-benda, dengan perbendaan yang besar, sebagaimana Allah Ta'ala berfirman: انْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ وَلَلْآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلًا \" Perhatikanlah bagaimana Kami lebihkan sebagian dari mereka atas sebagian (yang lain). Dan pasti kehidupan akhirat lebih tinggi tingkatnya dan lebih besar keutamaannya.\"(QS. Al-Isra: 21) لِيُرَوْا أَعْمَالَهُمْ \" supaya diperlihatkan kepada mereka (balasan) pekerjaan mereka.\" Yakni: Mereka datang dengan berkelompok lalu mereka diperlihatkan amalan-amalan mereka, Allah Ta'ala akan memperlihatkan kepada mereka. Jika baik maka akan baik jika buruk maka akan buruk, ini akan terjadi dengan perhitungan dan dengan tulisan. Manusia akan menerima kitabnya bisa dengan tangan kanannya bisa juga dengan tangan kirinyaa, kemudian akan dihisab sesuai dengan yang tercatat dalam kitab. Allah 'Azza Wa Jalla akan menghitungnya. Ada pun orang mukmin, maka Allah Ta'ala akan berbicar berdua dengannya sendirian, dan menyadarkannya terhadap dosa-dosanya lalu berkata: Engkau telah bebuat dosa ini, engkau telah berbuat dosa ini dan itu, sampai ia sadar dan mengaku. Maka apabila ia sudah menyangka dia akan binasa, Allah 'Azza Wa Jalla berfirman: إِنِّي سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا، وَأَنَا أَغْفِرُهَا الْيَوْمَ \"Sesungguhnya Aku telah menutupinya atas dirimu di dunia, dan Aku mengampuninya pada hari ini\"(1) Sedangkan orang kafir wal'iyadzu billaah, maka ia tidak akan mendapatkan interaksi seperti itu, tapi akan diteriakan di hadapan para saksi هَؤُلَاءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ \" \"Orang-orang inilah yang telah berdusta terhadap Rabb mereka\". Ingatlah, kutukan Allah (ditimpakan) atas orang-orang yang zalim.\"(QS. Hud: 18) لِيُرَوْا أَعْمَالَهُمْ \" supaya diperlihatkan kepada mereka (balasan) pekerjaan mereka.\" Kata al-a'maal (perbuatan perbuatan) diidhafahkan , dan keadaan idhafah seperti ini (dalam teks ayat) memberikan faedah umum, dan secara zahir mereka akan melihat amalan perbuatan mereka yang kecil dan juga yang besar, dan ini memang demikian. Kecuali yang Allah ampuni sebelumnya dengan kebaikan-kebaikan, atau karena doa atau yang sejenisnya, maka ini akan dihapus, sebagaimana Allah Ta'ala berfirman: إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ \" Sesungguhnya perbuatan-perbuatan yang baik itu menghapuskan (dosa) perbuatan-perbuatan yang buruk. Itulah peringatan bagi orang-orang yang ingat.\"(QS. Hud: 114) Maka setiap insan akan mlihat amalannya, melihat amalannya sedikit dan banyak, hingga jelas perkara baginya dan diserahkan kepadanya kitabnya lalu dikatakan: اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا \" \"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.\" (QS. Al-Isra: 14) Oleh karenanya hendaknya seorang insan tidak melakukan apa-apa yang tidak membuat Allah 'Azza Wa Jalla ridha, karena dia mengetahui bahwa itu dicatat, dan itu akan dihisab. (1) Dikeluarkan Bukhari (2441) dan Muslim (2728) dari hadits Ibnu Umar radhiyallaahu 'anhuma."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 6: Allah mengabarkan bahwa manusia akan kembali di tempat perhitungan (hisab), dengan kondisi berbeda antara satu jamaah dengan jamaah yang lain, setelah Allah putuskan diantara mereka semua. Sebagian dari mereka adalah orang-orang yang tenang, sebagian lagi gemetar, panic karena ketakutan; Kemudian Allah berkata pada setiap kelompok : Lihatlah oleh kalian, amalan-amalan kalian yang kalian kerjakan di dunia, dan lihatlah tempat kalian di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, pada hari itu manusia tampil di padang mahsyar ketika Allah Subhaanahu wa Ta'aala memberikan keputusan di antara mereka dengan keadaan yang berbeda-beda; ada yang berbahagia dan ada yang celaka. Ada yang yang diperintahkan ke surga dan ada yang diperintahkan ke neraka. Ada yang putih mukanya dan ada pula yang hitam dan sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 6",
    "description": "Pada hari itu manusia keluar dari kuburnya untuk menuju tempat hisab, atau beranjak dari tempat hisab itu, dalam keadaan berkelompok-kelompok. Kondisi mereka beragam; sebagian merasa tenang dan sebagian yang lain begitu gundah dan ketakutan. Mereka digiring dengan gegas ke surga atau neraka untuk diperlihatkan kepada mereka balasan semua perbuatannya yang telah Allah janjikan. 7. Pada saat itu setiap manusia akan mengetahui nasib dirinya. Maka barang siapa mengerjakan kebaikan seberat zarrah, niscaya dia akan melihatnya dalam buku catatan amalnya lalu dia akan menerima pahala atasnya. Dia merasa senang dan bahagia karena perbuatannya tidak sia-sia."
  }
]