[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Barangsiapa yang melakukan kebaikan seberat semut kecil, dia akan melihat pahalanya di akhirat. Dan barangsiapa melakukan keburukan seberat semut kecil, dia akan melihat balasannya di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Maka barangsiapa berbuat kebaikan dan pengabdian seberat semut kecil, maka dia akan melihatnya di depannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Barangsiapa yang mengerjakan suatu amalan -sekecil apapun ukuran dan timbangannya- maka dia akan menerima balasannya, baik itu amalan baik maupun buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَمَن يَعْمَلْ (Barangsiapa yang mengerjakan) Ketika di dunia. مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُۥ (kebaikan seberat dzarrahpun, niscaya dia akan melihat (balasan)nya) Yakni dia akan melihatnya di hari kiamat dalam kitab catatan amalnya, sehingga ia merasa bahagia. Atau dia akan melihatnya terpampang baginya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Abu darda' berkata : \"Janganlah sekali-kali engkau meremahkan suatu keburukan yang nilainya kecil lantas kamu mengerjakannya, dan jangan pula kamu mengabaikan suatu kebaikan yang kelihatannya kecil lalu kamu tinggalkan, karena sesungguhnya Allah berfirman : { مَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ , وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ } \"Barangsiapa yang mengerjakan kebaikan seberat dzarrahpun, niscaya dia akan melihat (balasan)nya , Dan barangsiapa yang mengerjakan kejahatan sebesar dzarrahpun, niscaya dia akan melihat (balasan)nya pula.\" 2 ) . Segala kemaslahatan dan amalan, besar dan kecilnya, sedikit dan banyaknya, baik dan buruknya, pada akhirnya akan jatuh kedalam dua ayat ini : { فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ } { إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَالْبَغْيِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ } \" Sesungguhnya Allah menyuruh (kamu) berlaku adil dan berbuat kebajikan, memberi kepada kaum kerabat, dan Allah melarang dari perbuatan keji, kemungkaran dan permusuhan. Dia memberi pengajaran kepadamu agar kamu dapat mengambil pelajaran\". An-Nahl : 90. 3 ) . Jika seorang petani saja rela merasakan letih saat menanam dan membajak tanah, dengan harapan akan meraih hasil yang baik ketika musim panen tiba, sesungguhnya dunia ini adalah ladang kebaikan untuk kehidupan diakhirat, maka berkebunlah kamu diatasnya segala kebaikan; agar kamu dapat memanen hasilnya di hari ketika setiap amalan manusia akan dihitung. { فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Pada hari itu, manusia keluar dari kuburnya menuju tempat penghitungan (amal) secara terpisah untuk diperlihatkan oleh Allah kepada balasan perbuatan mereka yaitu surga atau neraka. Jadi barangsiapa melakukan suatu kebaikan di dunia seberat dzarrah (semut kecil), maka dia akan mengetahui balasannya di akhirat. Imam Bukhari dan Imam Muslim mengatakan dari Abu Hurairah bahwa sesungguhnya Rasulallah SAW menamai ayat ini sebagai ayat yang sangat dahsyat secara keseluruhannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka barangsiapa mengerjakan kebaikan seberat zarrah} seberat semut yang sangat kecil {niscaya dia akan melihatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “Barangsiapa yang mengerjakan kebaikan seberat dzarrah pun, niscaya dia akan melihat (balasan) nya. Dan barangsiapa yang mengerjakan kejahatan seberat dzarrah pun, niscaya dia akan melihat (balasan) nya pula.” Ini bersifat umum untuk seluruh kebaikan dan keburukan, karena bila manusia bisa melihat amalan seberat biji dzarrah yang merupakan sesuatu yang terkecil dan diberi balasannya, maka yang lebih besar tentu bisa dilihat,. Sebagaimana firman Allah : Pada hari ketika tiap-tiap diri mendapati segala kebajikan dihadapkan (dimukanya), begitu (juga) kejahatan yang telah dikerjakannya; ia ingin kalau kiranya antara ia dengan hari itu ada masa yang jauh. (Qs. ali-imran.30) dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). (QS. surat-al-kahfi.49) Dalam ayat ini terdapat anjuran untuk mengerjakan kebaikan meski suatu yang kecil serta ancaman dari perbuatan buruk meski suatu yang sepele."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَمَنْ يَعْمَلْ } Maka barangsiapa yang beramal ketika di dunia, { مِثْقَالَ ذَرَّةٍ خَيْرًا } amalan kebaikan seberat satu dzarroh, yaitu : seekor semut hitam kecil, amalan seseorang tidak akan di sia-siakan walau sekecil apapun, baik itu amalan kebaikan ataupun amalan keburukan. { فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ } Setiap hamba akan melihat amalan yang telah dikerjakannya ketika di dunia, maka barangsiapa yang telah berbuat baik sekecil apapun itu dia akan melihat amalan tersebut, dan barangsiapa yang telah berbuat buruk sekecil apapun dia akan melihatnya, Allah - عز وجل - berfirman : { إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِنْ لَدُنْهُ أَجْرًا عَظِيمًا } ( Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah, dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar ) [ An Nisaa : 40 ] , setiap amalan manusia terkendali baik itu yang baik maupun yang buruk, semuanya diawasi tanpa terkecuali. Barangsiapa yang mengerjakan amalan shalih ketika ia hidp di dunia walaupun amalan itu sekecil semut hitam, { يَرَهُ } maka dia akan melihat dan merasakan ganjaran amal tersebut."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ (7) وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ (8) \" Barang siapa yang mengerjakan kebaikan seberat zarah pun, niscaya dia akan melihat (balasan) nya. Dan barang siapa yang mengerjakan kejahatan seberat zarah pun, niscaya dia akan melihat (balasan) nya pula.\" (من [man] siapa saja ) adalah syarthiyah yang memberikan faedah umum, maksudnya: Manusia beramal sebasar semut kecil sungguh ia akan melihatnya baik itu berupa amalan baik ataupun amalan buruk. مِثْقَالَ ذَرَّةٍ \" seberat zarrah \" Yakni: seberat zarrah maksudnya adalah semut-semut kecil, sebagaimana diketahui, dan bukanlah bermaknak yang dipahami saat ini sebagaiamana sangkaan sebagian orang (yang berarti atom). Karena zarrah yang dipahami saat ini tidaklah dikenal pada waktu terdahulu, sedangkan Allah 'Azza Wa Jalla tidaklah mengajak bicara manusia keculai dengan yang mereka pahami. Allah menyebutkan zarrah karena itu sebagai perumpamaan yang amat kecil, sebagaimana Allah Ta'ala berfirman: إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِنْ لَدُنْهُ أَجْرًا عَظِيمًا \" Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah, dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar. \"(QS. An-Nisa: 40) dan diketahui bahwa siapa saja yang beramala dengan perbuatan yang lebih kecil dari sarah sekali punm maka ia pasti akan mendapatinya, tetapi zara dijadikan perumpamaan pada sesuatu yang kecil, Allah Ta'ala berfirman: فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ \" Barang siapa yang mengerjakan kebaikan seberat zarah pun, niscaya dia akan melihat (balasan) nya.\" Firman Allah Tabaraka wa Ta'ala: مِثْقَالَ ذَرَّةٍ \" seberat zarah \" Memberikan faedah bahwa yang ditimbang adalah amalan-amalan perbuatan. Ini adalah di antara pembahasan yang diperselisihkan oleh para ulama: Di antara ulama ada yang mengatakan: Yang ditimbang adalah amal perbuatan. Di antara mereka ada yang mengatakan: Yang ditimbang adalah buku catatan-catatan amal perbuatan. Di antara mereka ada yang mengatakan: Yang ditimbang adalah orang yang beramal itu sendiri. Setiap pendapat mempunyai dalil. Yang mengatakan bahwa yang ditimbang adalah amala perbuatan, ia berdalil dengan ayat ini: فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ \" Barang siapa yang mengerjakan kebaikan seberat zarah, \" Karena pengukuran ayat tersebut disebutkan siapa saja yang beramal dengan perbuatan seberat zarrah. Mereka juga berdalil dengan sabda Nabi shallallaahu 'alaihi wa sallam: كَلِمَتَانِ حَبِيبَتَانِ إِلَى الرَّحْمَنِ خَفِيفَتَانِ عَلَى اللِّسَانِ ثَقِيلَتَانِ فِي الْمِيزَانِ سُبْحَانَ اللهِ وَبِحَمْدِهِ سُبْحَانَ اللهِ الْعَظِيمِ \"dua kalimat yang dicintai oleh Ar-Rahman, ringan diucapkan lisan lagi berat dalam timbangan, adalah subhanallaaah wa bihamdihi [maha suci Allah dengan memuji-Nya] subhaanallaah al-'Azhim [maha suci Allah yang Maha Agung]\"(1) Namun yang menjadi pertanyaan bahwa amalan tidaklah berbentuk benda yang bisa ditaruh di atas timbangan, tetapi amalan yang diamalkan hilang dan berakhir (setelah di amalkan). Maka ini dijawab dengan dikatakan: Pertama-tama: Hendaknya seseorang membenarkan apa-apa yang diberitakan Allah dan rasul-Nya shallallaahu 'alaihi wa sallam berupa perkara-perkara ghaib, meskipun akalnya tidak menjangkaunya, dan merasa aneh dan mengatakan bagaimana bisa begitu? Maka hendaknya ia membenarkannya, karena kuasa Allah Ta'ala di atas jangkauan nalar yang kita bayangkan. Maka kewajiban seorang muslim adalah menerima dan berserah diri dan tidak mengatakan bagaimana? Karena perkara-perkara ghaib diluar jangkauan bayangan nalarnya. Kedua: Bahwa Allah Ta'ala menjadikan amalan-amalan perbuatan menjadi benda-benda yang bisa diletakkan di timbanagan yang menjadi berat dan ringan. Dan Allah Ta'ala maha Kuasa untuk menjadikan perkara-perkara yang besifat maknawi menjadi benda-benda berwujud. Sebagaimana telah shahih dari Nabi shallallaah 'alaihi wa sallam bahwa kematian nanti alan didatangkan dengan bentuk seekor domba, dan diletakkan antara surga dan neraka. Lalu dikatakan: Wahai penduduk surga, maka mereka melihat kepadanya. Lalu dikatakan: Wahai penduduk neraka, maka mereka melihat kepadanya. Kemudian dikatakan kepada mereka: Apakah kalian tahu ini? Mereka menjawab: Ya, ini adalah kematian, padahal kematian dalam bentuk seekor domba, sedangkan kamtian adalah sebuah perkara maknawi yant tidak berbentuk benda (tubuh), tetapi Allah Ta'ala menjadikannya berbentuk tubuh (seekor domba) pada hari kiamat. Mereka mengatakan: Ini adalah kematian, maka kematian (yang sudah menjadi seekor domba) disembelih di hadapan mereka, lalu dikatakan kepada penduduk surga: Keabadian dan tidak ada kematian lagi, wahai penduduk neraka, keabadian dan tidak ada kematian lagi (2) Sedangkan yang berpendapat: Bahwa yang ditimbang adalah buku catatan-catatan perbuatan, mereka berdalil dengan hadits bithaqah (kartu) yang didatangkan pada hari kiamat, lalu dikatakan: Lihatlah kepada perbuatanmu, maka dibentangkanlah catatan-catatan yang tertulis di dalamnya perbuatan buruk, buku catatan-catatan yang besar. Ketika dia melihat akan kebinasaan menimpa dirinya, didatangkanlah kartu kecil di dalamnya tertulis laa ilaaha illallaah maka ia berkata: Ya Rabb, ada apa dengan kartu ini dibanding dengan catatan-catatam ini? Maka dikatakan padanya: Sesungguhnya engkau tidaklah berbuat zalim sedikit pun. Kemudian ditimbanglah kartu tersebut dalam neraca dan catatan-catatan di neraca lainnya, maka kartu tersebut lebih berat dari buku catatan-catatan tadi, kartu itu adalah laa ilaaha illallaah (3) mereka mengatakan: Ini adalah dalil bahwa yang ditimbang adalah buku-buku catatan amal perbuatan. Sedangkan yang mengatakan bahwa yang ditimbang adalah yang berbuat itu sendiri, mereka berdalil dengan hadits Abdullaah Bin Mas'ud radhiyallaaahu 'anhu: Bahwa suatu hari ia bersama Nabi shallallaahu 'alaihi wa sallam, maka berhembuslah angin yang kencang. Lalu Abdullah Bin Mas'ud berdiri maka angin itu menggoyangkannya, karena kedua kaki dan betis beliau kurus. Maka orang-orang tertawa. Lalu Nabi shallallaahu 'alaihi wa sallam berkata: مِمَّ تَضْحَكُونَ أَوْ مِمَّ تَعْجَبُونَ؟ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ سَاقَيْهِ فِي الْمِيزَانِ أَثْقَلُ مِنْ أُحُدٍ \" Karena sebab apa kalian tertawa atau karena sebab apa kalian takjub? Demi (Allah) Yang jiwaku berada ditangan-Nya, sungguh kedua betisnya itu dalam timbangan (mizan) lebih berat dari gunung uhud\"(4) Dan hadits ini menunjukkan bahwa yang ditimbang adalah yang beramal. Maka dijawab: Kami mengambil pendapat yang pertama, bahwa yang ditimbang adalah amalan, tetapi bisa jadi sebagian manusia ditimbang lembaran-lembaran catatan amalannya dan sebagian manusia yang ditimbang adalah dirinya sendiri. Jika ada yang mengatakan: Berdasarkan pendapat ini, bahwa yang diti,bang adalah yang beramal, apakah diukur dengan tubuh-tubuh manusia di dunia, dan bahwa orang ynag memiliki badan besar menjadi berat timbangannya di hari kiamat? Jawabannya: Tidak diukur dengan ukuran tubuh di dunia, dari Abu Hurairah radhiyallaahu 'anhu, dari Rasulullah shallallaahu 'alaihi wa sallam bersabda: إِنَّهُ لَيَأْتِي الرَّجُلُ الْعَظِيمُ السَّمِيْنُ يَوْمَ الْقِيَامَةِ لَا يَزِنُ عِنْدَ اللهِ جَنَاحَ بَعُوْضَةٍ وَقَالَ: اِقْرَءُوا: \"Sesungguhnya akan datang seorang lelaki besar lagi gemuk pada hari kiamat, tidaklah bobotnya di sisi Allah seberat sayap nyamuk. Lalu beliau bersabda: Bacalah oleh kalian: فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا \" dan Kami tidak mengadakan suatu penilaian (berat) bagi (amalan) mereka pada hari kiamat.\" (5) Lihatlah Abdullah Bin Mas'ud, Nabis 'alaihissholaatu wassalaam bersabda tentangnya: إِنَّ سَاقَيْهِ فِي الْمِيزَانِ أَثْقَلُ مِنْ أُحُدٍ \" sungguh kedua betisnya itu dalam timbangan (mizan) lebih berat dari gunung uhud \" Yang menjadi tolak ukur beratnya badan dan beratnya di hari kiamat adalah amalan-amalan saleh yang membersamainya. (1) Dikeluarkan Bukhari (6406) dan Muslim (2694) dari hadits Abu Hurairah radhiyallaah 'anhu (2) Dikeluarkan Bukhari (4730) dan Muslim (2849) dari hadits Abu Sa'id al-Khudriy radhiyallaaahu 'anhu (3) Dikeluarkan Tirmidziy (2639) dan Ibnu Majah (4300) dari hadits Abdullah bin Amr radhiyallaahu 'anhuma, dinyatakan shahih oleh Al-Albaniy dalam shahih Al-Jami' (1776) (4) Dikeluarkan Ahmad (3981) dari hadits Abdullah Bin Mas'ud radhiyallaahu 'anhu dan dinyatakan shahih oleh Al-Albaniy dalam ash-Shahihah (3192) (5) Dikeluarkan Bukhari (4729) dan Muslim (2785) dari hadits Abu Hurairah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 7: 7-8. Allah menjelaskan barangsiapa yang dulu di dunia beramal dengan amalan yang baik, sangat dekat amalannya dan akan melihat balasan dari amalannya. Dan barangsiapa yang beramal dengan amalan yang buruk sewaktu di dunia meskipun sedikit, akan melihat hukumannya di akhirat. Dengan kata lain, tidaklah hilang sesuatupun dari apa yang telah lalu atas amalannya baik besar maupun kecilnya, baik amalan yang baik maupun buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni seukuran semut yang kecil. Jika amal seukuran itu saja diperlihatkan, lalu bagaimana dengan amal yang lebih besar dari itu? Tentu lebih diperlihatkan lagi. Allah Subhaanahu wa Ta'aala berfirman, “Pada hari ketika setiap diri mendapatkan segala kebajikan dihadapkan kepadanya, begitu (pula) kejahatan yang telah dikerjakannya; ia ingin kalau kiranya antara ia dengan hari itu ada masa yang jauh; dan Allah memperingatkan kamu terhadap siksa-Nya. dan Allah sangat Penyayang kepada hamba-hamba-Nya.” (Terj. Ali Imran: 30)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 7",
    "description": "Pada saat itu setiap manusia akan mengetahui nasib dirinya. Maka barang siapa mengerjakan kebaikan seberat zarrah, niscaya dia akan melihatnya dalam buku catatan amalnya lalu dia akan menerima pahala atasnya. Dia merasa senang dan bahagia karena perbuatannya tidak sia-sia. 8. Dan sebaliknya, barang siapa mengerjakan kejahatan seberat zarrah dan menganggapnya remeh, niscaya dia akan melihatnya dalam buku catatan amalnya lalu dia pun akan menerima balasannya. Inilah bukti kemahaadilan Allah; dia tidak menzalimi siapa pun."
  }
]