[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Barangsiapa yang melakukan kebaikan seberat semut kecil, dia akan melihat pahalanya di akhirat. Dan barangsiapa melakukan keburukan seberat semut kecil, dia akan melihat balasannya di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan barangsiapa berbuat kejahatan seberat semut kecil pula, maka ia pun akan melihatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَمَن يَعْمَلْ (Dan barangsiapa yang mengerjakan) Ketika di dunia. مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُۥ(kejahatan sebesar dzarrahpun, niscaya dia akan melihat (balasan)nya pula) Yakni dia akan melihatnya di hari kiamat, sehingga dia akan merasa sedih; dan bisa jadi Allah akan mengampuninya. Makna (الذر) yakni debu yang beterbangan yang terlihat saat terkena sinar matahari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dan barangsiapa melakukan keburukan di dunia seberat dzarrah, maka dia akan mengetahui balasannya di akhirat. Ibnu Abu Hatim dari Sa’id bin Jubair berkata: “Saat ayat ini turun {wa yuth’imuunath tha’aama ‘ala hubbihi …} orang-orang muslim beranggapan bahwa mereka tidak menerima pahala atas sesuatu yang sedikit bila memberikannya (kepada orang lain), sedangkan yang lain beranggapan bahwa mereka tidak akan disalahkan atas dosa yang remeh, yaitu berbohong, mengintip, mengumpat dan dosa-dosa lain yang serupa, sesungguhnya Allah hanya menjanjikan neraka bagi orang-orang yang berdosa besar, maka Allah menurunkan dua ayat ini [ayat 7 dan 8]”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan barang siapa mengerjakan kejahatan seberat zarrah, niscaya dia akan melihatnya}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “Barangsiapa yang mengerjakan kebaikan seberat dzarrah pun, niscaya dia akan melihat (balasan) nya. Dan barangsiapa yang mengerjakan kejahatan seberat dzarrah pun, niscaya dia akan melihat (balasan) nya pula.” Ini bersifat umum untuk seluruh kebaikan dan keburukan, karena bila manusia bisa melihat amalan seberat biji dzarrah yang merupakan sesuatu yang terkecil dan diberi balasannya, maka yang lebih besar tentu bisa dilihat,. Sebagaimana firman Allah : Pada hari ketika tiap-tiap diri mendapati segala kebajikan dihadapkan (dimukanya), begitu (juga) kejahatan yang telah dikerjakannya; ia ingin kalau kiranya antara ia dengan hari itu ada masa yang jauh. (Qs. ali-imran.30) dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). (QS. surat-al-kahfi.49) Dalam ayat ini terdapat anjuran untuk mengerjakan kebaikan meski suatu yang kecil serta ancaman dari perbuatan buruk meski suatu yang sepele."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا } Dan barangsiapa yang mengerjakan amalan buruk walau sekecil semut hitam, { يَرَهُ } dia pasti akan melihatnya dengan matanya sendiri, amalan seseorang akan membahagiakannya jika itu baik, dan jika amalannya buruk maka amalan itu akan menyengsarakanny, dan ia tidak mungkin lagi bisa bertaubat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah 'Azza Wa Jalla berfirman: فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ (7) وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ (8) \" Barang siapa yang mengerjakan kebaikan seberat zarah pun, niscaya dia akan melihat (balasan) nya. Dan barang siapa yang mengerjakan kejahatan seberat zarah pun, niscaya dia akan melihat (balasan) nya pula.\" Surat ini seluruhnya adalah peringatan dan ancaman dari goncangan bumi, di dalamnya terdapat dorongan untuk beramal saleh, di dalamnya juga dijelaskan bahwa amalan tidak akan hilang walau pun sepele, walau pun sekecul semut kecil atau bahkan lebih kecil lagi, maka sesungguhnya seorang insan pasti akan melihatnya pada hari kiamat kelak. Kita meminta kepada Allah agar mengakhiri kehidupan kita dengan kebaikan dan kebahagiaan, kesalehan dan keberuntungan, dan menjadikan kita termasuk orang-orang yang dikumpulkan kepada Ar-Rahman dengan baik, sesungguhnya Dia Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zalzalah ayat 8: 7-8. Allah menjelaskan barangsiapa yang dulu di dunia beramal dengan amalan yang baik, sangat dekat amalannya dan akan melihat balasan dari amalannya. Dan barangsiapa yang beramal dengan amalan yang buruk sewaktu di dunia meskipun sedikit, akan melihat hukumannya di akhirat. Dengan kata lain, tidaklah hilang sesuatupun dari apa yang telah lalu atas amalannya baik besar maupun kecilnya, baik amalan yang baik maupun buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat di atas terdapat targhib (dorongan) untuk mengerjakan kebaikan meskipun kecil, dan tarhib (penakut-nakutan) tehadap perbuatan buruk meskipun ringan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zalzalah Ayat 8",
    "description": "Dan sebaliknya, barang siapa mengerjakan kejahatan seberat zarrah dan menganggapnya remeh, niscaya dia akan melihatnya dalam buku catatan amalnya lalu dia pun akan menerima balasannya. Inilah bukti kemahaadilan Allah; dia tidak menzalimi siapa pun. 1-6. Demi kuda perang yang berlari kencang dan bernafas terengah-engah ke arah musuh dengan penuh keberanian dan semangat guna membawa tuannya berperang di jalan Allah. Dan demi kuda yang memercikkan bunga api karena hentakan kuku kakinya beradu dengan batu batu. Hal ini menunjukkan keberaniannya menghadapi rintangan sebesar apa pun. Dan demi kuda yang menyerang dengan tiba-tiba pada waktu pagi hal ini menunjukkan kesiagaannya untuk berjihad tanpa mengenal waktu, sehingga dengan serangan kuda-kuda itu menerbangkan debu yang tebal, tanda betapa dahsyat serangan mereka ke arah musuh, lalu menyerbu bersama dengan kepulan debu itu ke tengah-tengah kumpulan musuh dengan gagah berani. Demi kuda-kuda perang yang demikian sifatnya, sungguh manusia itu enggan bersyukur dan sangat ingkar kepada nikmat tuhannya. Manusia, kecuali yang dirahmati Allah, malas bersyukur ketika mendapatkan nikmat dan tidak mau memenuhi kewajiban yang dibebankan kepadanya."
  }
]