[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "( Ha Mim). Pembicaraan tentang huruf-huruf yang terpisah-pisah di awal surat seperti ini telah hadir di awal surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ḥā Mīm. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. حمٓ (Haa Miim) Ini merupakan termasuk huruf-huruf muqattha’ah pada pembukaan surat-surat, dan penjelasannya telah disebutkan pada awal surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Disebut juga dengan surat Al-mukmin, karena menyebutkan kisah seorang mukmin dari keluarga Imran. Surat ini turun setelah surat Az-zumar. Ibnu Mas’ud berkata bahwa surat ini adalah dibajul quran. 1. Haa miim merupakan permulaan beberapa surat dengan huruf sebagai penekanan tentang isi surat tersebut, juga sebagai tantangan kepada masyarakat Arab untuk menandingi Al-quran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ḥā Mīm"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah subhnahu wata’ala mengabarkan tentang kitab-Nya yang agung, yaitu bahwa sesungguhnya ia berasal dan diturunkan dari sisi Allah yang berhak dipuja dan disembah, karena kemahasempurnaan-nya dan keesaan-Nya dalam segala perbuatan-Nya. “Yang Maha Perkasa” yang dengan keperkasaan-Nya Dia menundukan semua makhluk. “Yang Maha Mengetahui” segala sesuatu. “yang Mengampuni dosa” dari orang-orang yang berbuat dosa. “Dan Menerima taubat” dari orang-orang yang betaubat. “Lagi keras hukuman-Nya” terhadap siapa saja yang lancang berbuat dosa dan tidak bertaubat darinya. “yang mempunyai karunia”, maksudnya, pemilik karunia dan kebaikan yang menyeluruh. Setelah Allah menetapkan sebagian dari kemahasempurnaan-Nya, dan hal itu memastikan bahwa hanya Dia saja yang berhak disembah, yang amal ibadah hanya dimurnikan untuk-Nya, maka karena itu Dia kemudian berfirman, “Tiada tuhan yang berhak disembah melainkan Dia. Hanya kepada-Nya lah (semua makhluk) kembali.” Sisi korelasi penyebutan turunnya al-Quran dari sisi Allah yang mempunyai sifat-sifat tersebut tadi adalah bahwa sifat-sifat tersebut memastikan seluruh makna yang terkandung di dalam al-Quran. Karena itu, sesungguhnya al-Quran boleh jadi adalah informasi tentang nama-nama, sifat-sifat dan perbuatan-perbuatan Allah, dan ini adalah nama-nama, sifat-sifat dan perbuatan-perbuatan dan boleh jadi informasi tentang hal yang gaib yang telah lalu dan yang akan datang, dan ini adalah pemberitahuaan dari yang Maha Mengetahui kepada hamba-hamba-Nya. Boleh jadi pula informasi tentang karunia-karunia-Nya yang sangat besar dan nikmat-nikmatNya yang luar biasa dan segala perintah yang mengantarkan kepada nikmat tersebut. Yang demikian ini ditunjukan oleh firmanNya “Yang mempunyai karunia”. Boleh jadi juga informasi tentang hukumannya yang sangat keras dan hal apa saja yang menyebabkan dan memastikan dari berbagai perbuatan maksiat. Hal ini ditunjukan oleh firmanNya “yang amat keras hukumanNya”. Boleh jadi juga seruan kepada orang-orang yang berdosa untuk bertaubat, berinabah dan memohon ampunan (kepada Allah). Ini diisyaratkan oleh firmanNya, “Yang mengampuni dosa dan menerima taubat lagi keras hukumanNya”. Boleh jadi juga ini informasi bahwa hanya Dia yang berhak diibadahi dan disembah, kemudian berbagai dalil aqli dan naqli dikemukakan untuknya, himbauan untuk beribadah kepadaNya dan larangan beribadah kepada selain Dia, serta penegakan argument-argumen naqli dan aqli terhadap ketidak benaran penyembahan kepada selain Allah itu serta ancaman nya. itulah sebabnya Dia berfirman, “Tiada tuhan yang berhak disembah melainkan Dia”. Serta boleh jadi juga informasi tentang balsanNya yang sangat adil dan pahala bagi orang-orang yang berbuat baik serta siksaan bagi orang-orang yang durhaka. Hal ini diisyaratkan oleh firmanNya, “Hanya kepadaNya-lah (semua makhluk) kembali.” Itulah yang dicakup di dalam al-Quran berupa al-Matholib al-‘Aliyah (nilai-nilai yang luhur)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 1: (Haa Miim) hanya Allah saja yang mengetahui arti dan maksudnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 1",
    "description": "'' m'm, hanya Allah yang mengetahui maksudnya. 2. Di ayat-ayat terakhir surah az-zumar, Al-Qur'an menggambarkan bagaimana perlakuan yang ditetapkan oleh Allah terhadap orang-orang kafir dan orang-orang mukmin. Salah satu penyebab dari terjadinya dua bentuk perlakukan tersebut adalah sikap mereka terhadap Al-Qur'an. Oleh sebab itu, ayat-ayat berikut di awal surah ini menegaskan kembali kebenaran Al-Qur'an itu. Kitab ini yakni Al-Qur'an yang diturunkan kepadamu, wahai nabi Muhammad, benar-benar dari Allah yang mahaperkasa lagi maha mengetahui."
  }
]