[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari bahwa Allah adalah Tuhan sembahan Yang Haq dan memberikan ibadah kepada selainNya, pada saat mereka menyaksikan siksa api neraka dengan diri mereka, maka mereka akan membenci diri mereka sendiri sebenci-bencinya. Saat itu para penjaga neraka jahanam memanggil mereka, “ Murka Allah terhadap kalian di dunia (saat Dia meminta kalian agar beriman kepadaNya dan mengikuti rasul-rasulNya, lalu kalian menolak) adalah lebih besar daripada kebencian kalian terhadap diri kalian sendiri saat ini setelah kalian mengetahui bahwa kalian memang berhak untuk mendapat murka Allah dan siksaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sesungguhnya orang-orang yang kafir kepada Allah dan para rasul-Nya akan dipanggil pada hari Kiamat ketika mereka masuk Neraka dan mencela serta melaknat diri mereka sendiri, “Sungguh murka Allah atas kalian lebih berat dibandingkan kemarahan kalian terhadap diri kalian sendiri, saat di dunia kalian diajak untuk beriman kepada Allah, namun kalian malah kafir kepada-Nya, dan kalian mengangkat tuhan-tuhan selain Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-12. Allah mengolok orang-orang kafir dan menjelaskan tempat kembali mereka pada hari kiamat, bahwa para malaikat akan berseru kepada mereka dari tempat yang jauh saat orang-orang kafir itu di dalam neraka: “Sungguh kemurkaan Allah terhadap kalian ketika di dunia lebih besar daripada kebencian kalian terhadap diri kalian sendiri ketika kalian telah berada di dalam neraka ini. Dahulu ketika kalian di dunia diajak untuk beriman, kalian enggan.” Kemudian orang-orang kafir berkata: “Ya Tuhan kami, Engkau telah mematikan kami dua kali; yaitu ketika kami masih di dalam tulang sulbi bapak kami, kemudian Engkau menghidupkan kami ke dunia sampai ajal kami datang, lalu Engkau menghidupkan kami kembali pada hari kiamat. Kami sekarang mengakui dosa-dosa yang telah kami lakukan, maka apakah kami dapat keluar dari neraka Jahannam?” Demikianlah azab yang berat bagi kalian akibat keingkaran kalian terhadap ajakan mengesakan Allah; namun ketika Allah disekutukan, kalian mempercayainya! Ketetapan hanya milik Allah Yang Maha Tinggi dari segalanya, dan Maha Besar, selain-Nya adalah hal kecil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِنَّ الَّذِينَ كَفَرُوا۟ يُنَادَوْنَ لَمَقْتُ اللهِ أَكْبَرُ مِن مَّقْتِكُمْ أَنفُسَكُمْ (Sesungguhnya orang-orang yang kafir diserukan kepada mereka (pada hari kiamat): “Sesungguhnya kebencian Allah (kepadamu) lebih besar daripada kebencianmu kepada dirimu sendiri) Yakni setiap penghuni neraka berkata kepada diri mereka sendiri: “hai diriku, aku membencimu di dunia ini.” Maka para malaikat berkata kepada mereka ketika mereka telah di dalam neraka: “sungguh kebencian Allah kepada kalian di dunia ketika kalian diseru untuk beriman namun kalian menolak, itu lebih besar daripada kebencian kalian kepada diri kalian sendiri ketika kalian menyaksikan neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya, pada hari kiamat orang-orang kafir diseru oleh para malaikat : “Kemurkaan dan kebencian Allah untuk kalian ketika di dunia lebih besar dari pada kebencian kalian terhadap diri kalian sendiri pada hari ini karena kalian akan dimasukkan ke neraka. Bagaimana tidak, ketika kalian diajak untuk beriman kepada Allah ketika di dunia kalian justru mengingkarinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang kafir akan diseru} akan dikatakan kepada mereka pada hari kiamat ketika memasuki neraka {“Sungguh kebencian Allah} sungguh kemurkaan Allah yang sangat besar terhadap kalian {jauh lebih besar daripada kebencian kalian kepada diri kalian} kemurkaan kalian yang besar terhadap diri kalian ketika melihat neraka {ketika kalian diseru untuk beriman, lalu kalian ingkar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Allah mengabarkan tentang kenistaan dan kehinaan yang menimpa orang-orang kafir, dan tentang permohonan mereka untuk dikembalikan ke dunia dan dikeluarkan darri neraka serta ketidakmungkinan hal tersebut bagi mereka dan cercaan terhadap mereka, seraya befirman, “sesungguhnya orang-orang yang kafir”, yang disini diungkapkan secaa umum, agar maknanya meliputi segala bentuk kekafiran, seperti kafir terhadap Allah, terhadap kitab-kitabNya, para osulNya dan terhadap hari kemudian. Nanti pada saat mereka masuk neraka dan mereka mengakui bahwa memang berhak memasukinya karena berbagai dosa dan kejahatan yang telah mereka lakukan. Lalu mereka membenci diri mereka sendiri karenanya dengan kebencian yang paling hebat, mereka sangat memurkainya dengan puncak kemurkaan, maka mereka pun diseru pada saat itu dan dikatakan kepada mereka “sesungguhnya kebencian Allah” terhadap kalian, karena saat kalian diajak untuk beriman namun kalian mengingkarinya, yakni, pada saat rosul dan para pengikutnya menyeru kalian untuk beiman dan mengemukakan berbagai bukti penjelasan yang dengannya kebenaran menjadi jelas, namun kalian mengingkarinya dan kalian tidak mau beriman, padahal itu adalah tujuan Allah mencipatakan kalian, dan kalian pun keluar dari rahmaNya yang Maha luas itu, maka dari itu Dia membenci dan memurkai kalian, Maka yang demikian itu “lebih besar dari pada kebencianmu kepada dirimu sendiri”. Maksudnya, kebencian ini akan terus melanda kalian dan kemurkaan dari Allah yang Maha pemurah menimpa kalian, hingga kalian menjadi sepeti yang sedang kalaian rasakan ini. Maka pada hari ini, kemurkaan dan hukuman Allah menimpa kalian, di mana pada saat yang sama orang-orang yang beriman memperoleh keridhoan Allah dan pahalaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 10: (Sesungguhnya orang-orang yang kafir diserukan kepada mereka) oleh para malaikat, sedangkan mereka membenci diri mereka sendiri sewaktu mereka dimasukkan ke dalam neraka (\"Sesungguhnya kebencian Allah) kepada kalian (lebih besar daripada kebencian kalian kepada diri kalian sendiri karena kalian diseru) sewaktu di dunia (untuk beriman, lalu kalian kafir.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang terbukanya aib dan kehinaan yang menimpa orang-orang kafir, permintaan mereka untuk kembali ke dunia dan keluar dari neraka, dan tidak dikabulkannya permohonan mereka itu serta dicelanya mereka. Disebutkan secara mutlak “orang-orang kafir” agar mencakup semua bentuk kekafiran, baik kafir kepada Allah, kitab-kitab-Nya, para rasul-Nya, hari akhir, dsb.. Yaitu saat mereka masuk ke neraka dan mereka mengakui bahwa mereka berhak memasukinya karena dosa-dosa yang mereka kerjakan, maka ketika itu mereka sangat marah kepada diri mereka dengan kemarahan yang besar, lalu diserulah mereka ketika itu seperti yang disebutkan dalam ayat di atas. Ketika para rasul dan pengikutnya mengajakmu beriman dan mereka tegakkan buktinya, namun kamu malah mengingkarinya dan kamu benci kepada keimanan yang sesungguhnya Allah menciptakan kamu untuknya, dan kamu malah keluar dari rahmat-Nya yang luas, sehingga Allah murka kepada kamu, dan kemurkaan-Nya jauh lebih besar daripada kemurkaanmu kepada dirimu sendiri. Kemurkaan dan siksa-Nya terus menimpamu, sedangkan hamba-hamba-Nya yang mukmin memperoleh keridhaan Allah dan pahala-Nya. Ketika itulah mereka berangan-angan untuk kembali ke dunia sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 10",
    "description": "Sesungguhnya bagi orang-orang yang kafir, kepada mereka pada hari kiamat itu diserukan oleh para malaikat, 'sungguh, kebencian Allah, kepadamu, wahai orang-orang yang durhaka, jauh lebih besar daripada kebencianmu kepada dirimu sendiri, karena ketika kamu diseru oleh rasul dan orang-orang beriman untuk beriman kepada Allah dan rasul-Nya, lalu kamu mengingkarinya dengan menolak seruan itu. '11. Mereka, orang-orang kafir itu pun menjawab, 'ya tuhan kami, kami sadar bahwa engkau telah mematikan kami dua kali dan telah menghidupkan kami dua kali pula, lalu sekarang kami sadari pula engkau kuasa menghidupkan orang yang sudah mati. Oleh sebab itulah, kami meng-akui dosa-dosa yang telah kami perbuat ketika hidup di dunia. Maka adakah bagi kami ya Allah yang maha pengampun jalan untuk keluar dari neraka ini dan kembali ke kehidupan dunia untuk memperbaiki diri''."
  }
]