[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir berkata, Wahai tuhan kami, Engkau telah mematikan kami dua kali, yaitu saat kami masih dalam Rahim ibu kami dalam bentuk setetes air mani sebelum ditiupkannya ruh, dan saat ajal kami di dunia telah habis. Dan Engkau telah menghidupkan kami dua kali, di dunia saat kami lahir dan disaat kami dibangkitkan dari kubur kami. Sekarang kami mengakui kesalahan-kesalahan masa lalu kami. Adakah jalan bagi kami untuk keluar dari api neraka lalu Engkau mengembalikan kami ke dunia agar kami bisa beramal menaatimu?” Akan tetapi alangkah ruginany mereka, karena pengakuan ini sama sekali tidak berguna bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Orang-orang kafir dalam kondisi mengakui dosa-dosa mereka saat pengakuan dan tobat mereka tidak berguna lagi bagi mereka berkata, “Wahai Rabb kami! Engakau telah mematikan Kami dua kali di mana kami tidak ada lalu Engkau mengadakan kami, kemudian Engkau mematikan kami sesudah kehidupan kami, dan Engkau hidupkan kami dua kali dengan menciptakan kami dari ketiadaan dan menghidupkan kami untuk kebangkitan, lalu kami mengakui dosa-dosa yang kami perbuat. Apakah ada jalan keluar dari Neraka yang bisa kami ambil lalu kami kembali ke dunia untuk memperbaiki amal-amal kami sehingga Engkau meridai kami?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. قَالُوا۟ رَبَّنَآ أَمَتَّنَا اثْنَتَيْنِ وَأَحْيَيْتَنَا اثْنَتَيْنِ (Mereka menjawab: “Ya Tuhan kami Engkau telah mematikan kami dua kali dan telah menghidupkan kami dua kali (pula)) Yang dimaksud dengan mematikan dua kali yakni mereka sebelumnya hanyalah air mani yang mati yang ada di dalam tulang sulbi bapak kalian, kemudian Allah mematikan kamu setelah kalian hidup di dunia. Dan yang dimaksud dengan menghidupkan dua kali yakni Allah menghidupkan mereka pertama kali di dunia dan menghidupkan mereka ketika hari kebangkitan. فَاعْتَرَفْنَا بِذُنُوبِنَا (lalu kami mengakui dosa-dosa kami) Yang telah kami lakukan di dunia dengan mendustakan para rasul, menyekutukan Allah, dan tidak mengesakan-Nya. Mereka menyatakan pengakuan mereka di saat tidak berguna lagi pengakuan itu, dan menyesal ketika tidak bermanfaat lagi penyesalan. فَهَلْ إِلَىٰ خُرُوجٍ مِّن سَبِيلٍ(Maka adakah sesuatu jalan (bagi kami) untuk keluar (dari neraka)?”) Yakni apakah mungkin bagi kami mendapatkan jalan untuk keluar dari neraka dan kembali ke dunia?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Orang-orang lafir berkata: “Ya Tuhan kami, Engkau telah mematikan kami dua kali, Engkau juga telah menciptakan kami dari tanah. Ketika kami masih dalam sulbi orang tua kami, kemudian Engkau mematikan kami ketika sudah sampai ajal kami, kemudian Engkau menghidupkan kami kembali.” Kehidupan pertama adalah kehidupan di dunia, kehidupan kedua adalah saat dibangkitkan. Maka pada hari ini kami telah mengetahui dan menyadari dosa-dosa yang telah kami perbuat. Seperti menyekutukan-Mu, mendustakan rasul-Mu, dan tidak mengesakan-Mu. Namun pengakuan itu sudah terlambat dan tidak bermanfaat apa-apa. Adakah kemungkinan bagi kami untuk keluar dari azab Jahannam meskipun hanya kecil untuk kemudahan bagi kami?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab} orang-orang kafir berkata {“Wahai Tuhan kami, Engkau telah mematikan kami dua kali} Mematikan kami dua kali, taitu ketika kami menjadi sperma dan ketika ajal kami telah selesai di kehidupan dunia {dan telah menghidupkan kami dua kali} dan menghidupkan kami dua kali, yaitu ketika kami dilahirkan dan ketika kami dibangkitkan dari kubur kami {lalu kami mengakui dosa-dosa kami. Maka apakah ada jalan untuk keluar} ada jalan untuk kami keluar dari neraka untuk kembali ke dunia sehingga kami akan memperbaiki amal kami dan mengerjakan ketaatan kepadaMu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. lalu mererka berangan-angan kembali ke dunia dan “mereka berkata, ‘Ya rabb kami. Engkau telah mamatikan kami dua kali.” Yang mereka maksud adalah kematian yang pertama dan kematian yang terjadi antara dua tiupan sangkakala menurut satu pendapat, atau ketiadaan total sebelum mereka diciptakan lalu mereka dimatikan sesudah itu. “dan telah menghidupkan kamu dua kali pula”. Kehidupan dunia dan kehidupan akhirat, “lalu kami mengakui dosa-dosa kami: maka adakah suatu jalan untuk keluar?” maksudnya, mereka mengeluh dan mengatakn perkataan tersebut, namun tidak berguna dan tidak bermanfaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 11: (Mereka menjawab, \"Ya Rabb kami, Engkau telah mematikan kami dua kali) yakni dua kali mati (dan telah menghidupkan kami dua kali pula) yakni dua kali hidup. Karena sesungguhnya sebelum itu mereka berupa mani, dalam keadaan mati, kemudian mereka dijadikan hidup, lalu mereka dimatikan lagi, lalu mereka dihidupkan lagi pada hari berbangkit (lalu kami mengakui dosa-dosa kami) yaitu dosa keingkaran kami terhadap adanya hari berbangkit. (Maka adakah untuk keluar) dari neraka lalu kembali lagi ke dunia, supaya kami dapat menjalani ketaatan kepada Rabb kami (sesuatu jalan\") yakni jalan keluar, maka jawaban mereka adalah tidak ada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksud dua kali mati adalah adalah kematian yang pertama dan kematian antara dua tiupan sangkakala. Ada pula yang berpendapat bahwa kematian yang pertama adalah pada saat mereka belum ada dan kematian yang kedua adalah kematian yang terjadi setelah mereka terwujud ke dunia. Yaitu kehidupan di dunia dan kehidupan di akhirat. Dan kembali ke dunia untuk menaati Tuhan kami. Mereka menyesal sekali terhadap langkah mereka yang salah ketika di dunia dan berkata seperti yang disebutkan dalam ayat di atas, padahal kata-kata itu tidak ada faedah dan gunanya sama sekali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 11",
    "description": "Mereka, orang-orang kafir itu pun menjawab, 'ya tuhan kami, kami sadar bahwa engkau telah mematikan kami dua kali dan telah menghidupkan kami dua kali pula, lalu sekarang kami sadari pula engkau kuasa menghidupkan orang yang sudah mati. Oleh sebab itulah, kami meng-akui dosa-dosa yang telah kami perbuat ketika hidup di dunia. Maka adakah bagi kami ya Allah yang maha pengampun jalan untuk keluar dari neraka ini dan kembali ke kehidupan dunia untuk memperbaiki diri''12. Yang demikian itu tidak bisa terjadi lagi, karena sesungguhnya kamu ketika di kehidupan dunia telah mengingkari seruan apabila kalian diseru untuk menyembah Allah saja tanpa mempersekutukan-Nya. Dan jika Allah dipersekutukan, kamu sangat percaya bahwa Allah itu mempunyai sekutu. Maka keputusan sekarang ini wewenangnya adalah hanya pada Allah yang mahatinggi lagi mahabesar."
  }
]