[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Siksa yang kalian peroleh itu (wahai orang-orang kafir) adalah disebabkan karena kalian dulu diajak untuk mentauhidkan Allah dan mengikhlaskan amal perbuatan untukNya, namun kalian justru malah ingkar kepadaNya, tetapi bila ada sekutu yang diangkat bersama Allah, kalian justru membenarkan dan mengikutinya. Maka Allah adalah Pemberi putusan hukum terhadap makhlukNya, Yang Mahaadil yang tidak bertindak zhalim, memberi hidayah kepada siapa yang Dia kehendaki dan menyesatkan siapa yang Dia kehendaki, merahmati siapa yang Dia kehendaki dan menyiksa siapa yang Dia kehendaki. Tiada Tuhan yang berhak disembah kecuali Dia yang Mahatinggi DzatNya, kedudukanNya, dan kekuasaanNya, serta bagiNya kebesaran dan keagungan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Azab yang menimpa kalian adalah disebabkan karena bila kalian diajak kepada Allah semata dan tidak menyekutukan-Nya dengan sesuatu, kalian malah kafir kepada Allah dan mengangkat sekutu-sekutu bagi-Nya, namun bila ada sekutu yang disembah di samping Allah, kalian malah beriman. Keputusan hanya milik Allah semata, Yang Mahatinggi dengan Żat, kodrat dan kekuatan-Nya, lagi Mahabesar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. ذٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِىَ اللهُ وَحْدَهُۥ كَفَرْتُمْ ۖ (Yang demikian itu adalah karena kamu kafir apabila Allah saja disembah) Yakni azab yang menimpa kalian itu adalah akibat kalian ketika disebutkan Allah semata di dunia, kalian mengingkari-Nya dan tidak mau mengesakan-Nya. وَإِن يُشْرَكْ بِهِۦ (Dan apabila Allah dipersekutukan) Dengan berhala-berhala dan lain sebagainya. تُؤْمِنُوا۟ ۚ( kamu percaya) Yakni percaya kepada penyekutuan itu dan kalian menerima seruan itu. فَالْحُكْمُ لِلّٰهِ(Maka putusan (sekarang ini) adalah pada Allah) Yakni keputusan hanya milik Allah semata, Dialah yang memutuskan bagi kalian kekekalan di neraka dan kalian tidak akan bisa keluar darinya. الْعَلِىِّ(Yang Maha Tinggi) Maha Tinggi dari segala sekutu bagi-Nya dalam Dzat dan sifat-Nya. الْكَبِيرِ(lagi Maha Besar) Maha Besar dari memiliki tandingan, pasangan, anak, atau sekutu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Azab seperti itu diberikan sebab pengingkaran kalian, ketika kalian diseru di dunia untuk menyembah Allah semata bukan yang lainnya, kalian justru mengingkari untuk mengesakan Allah. Kalian justru membuat sekutu atau mempunyai sesembahan lain, dan kalian juga membenarkan penyekutuan terhadap Allah itu. Maka takdir mubram atas nasib kalian pada hari ini adalah keputisan Allah semata Yang Maha Esa. Allah Maha Tinggi dari segala macam persekutuan dan permisalan terhadap sifat dan dzat-Nya. Allah Maha Besar atas segala ciptaan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Demikian itu karena apabila diseru untuk menyembah hanya kepada Allah, kalian ingkar. Jika Dia dipersekutukan, kalian percaya. Maka keputusan ini ada pada Allah Yang Maha tinggi} yang Maha Tinggi atas ciptaanNya, dalam Dzat, dan kekuasaanNya {lagi Maha besar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Mereka dicerca karena tidak melakukan sebab-sebab keselamatan. Dikatakan kepada mereka “yang demikian itu adalah karena apabila Allah saja yang disembah”, yakni, apabila diserukan untuk mengesakan Allah dan mengikhlaskan amal kepadaNya serta menjauhi perbuatan syirik kepadaNya “kamu kafir” kepadaNya, hati kalian merasa jijik terhadap hal itu dan kalian benar-benar sangat menghindar, “dan kamu percaya apabila Allah dipersekutukan”, yakni, inilah yang telah menceburkan kalian kepada jurang ini dan menempatkan kalian pada tempat ini, yaitu kalian kafir kepada iman kalian dan kalian mempercayai kekafiran. Kalian rela dengan keburukan dan kerusakan di dunia dan akhirat, dan kalian tidak menyukai apa yang menjadi kebaikan dan keshalihan di dunia dan akhirat. Kalian lebih mengutamakan sesbab-sebab kesengsaraan, kehinaan, dan murka, dan kalian tidak menyukai sebab-sebab kemenangan, keberuntungan dan nasib baik. “tetapi jika mereka melihat jalan kesesatan, mereka terus menempuhnya. “ (Al-A’rof :146) “maka keputusan adalah pada Allah Yang Mahatinggi lagi Mahabesar”, yang mahatinggi, yang milikNya-lah ketinggian yang absolut dari semua sisinya: Ktinggian Dzat, kedudukan, dan ketinggian keperkasaan. Di anatara ketinggian kedudukanNya adalah kemahasempurnaan keadilanNya, yang Dia menempatkan tipa sesuatu masing-masing pada tempatnya dan Dia tidak menyamakan orang-orang yang bertakwa dengan para pelaku dosa. Yang Mahabesar, yang hanya milikNya-lah kebesarran, keagungan dan kemuliaan pada nama-nama, sifat-sifat dan perbuatanNya, Yang Mahasuci dari segala penyakit, cela dan kekurangan. Apabila keputusan itu adalah milikNya dan Dia telah memutuskan kekekalan abadi terhadap kalian, maka keputusanNya tidak akan dirubah dan diganti."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 12: (Yang demikian itu) maksudnya, azab yang kalian sedang jalani itu (adalah karena) ketika di dunia (kalian kafir apabila Allah saja disembah) artinya, kalian kafir bilamana Dia diesakan. (Dan apabila Allah dipersekutukan) menjadikan sekutu bagiNya (kalian percaya) kalian percaya kepada kemusyrikan itu. (Maka putusan) untuk mengazab kalian (adalah pada Allah Yang Maha Tinggi) atas semua makhluk-Nya (lagi Maha Besar) Maha Agung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka dicela karena tidak mengerjakan sebab-sebab keselamatan. Kamu ridha dengan sesuatu yang buruk dan rusak di dunia dan akhirat (syirk), dan kamu benci dengan sesuatu yang baik dan saleh di dunia dan akhirat (tauhid). Kamu dahulukan sebab kesengsaraan, kehinaan dan kemurkaan, dan kamu benci sebab kebahagiaan, kemuliaan dan keridhaan. Hal ini sebagaimana dalam firman Allah Ta’ala berikut: “Aku akan memalingkan orang-orang yang menyombongkan dirinya di bumi tanpa alasan yang benar dari tanda-tanda kekuasaan-Ku. Jika mereka melihat setiap ayat-ayat(Ku), mereka tidak beriman kepadanya. Dan jika mereka melihat jalan yang membawa kepada petunjuk, mereka tidak mau menempuhnya, tetapi jika mereka melihat jalan kesesatan, mereka terus memenempuhnya. Yang demikian itu adalah karena mereka mendustakan ayat-ayat Kami dan mereka selalu lalai dari padanya.”(Terj. Al A’raaf: 146) Jika keputusan milik-Nya, maka Dia telah memutuskan bahwa kamu wahai orang-orang kafir akan kekal di neraka selamanya, dan keputusan-Nya tidak akan dirubah dan diganti. Dia Mahatinggi secara mutlak dari berbagai sisi, tinggi dzat-Nya, tinggi kedudukan-Nya, dan tinggi kekuasaan-Nya. Termasuk di antara tinggi kedudukan-Nya adalah sempurnanya keadilan Allah Subhaanahu wa Ta'aala, dan bahwa Dia meletakkan segala sesuatu pada tempatnya serta tidak menyamakan antara orang-orang yang bertakwa dengan orang-orang yang durhaka. Dia memiliki kebesaran, keagungan dan kemuliaan, baik pada nama-Nya, sifat-Nya mupun perbuatan-Nya yang suci dari setiap cacat dan kekurangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 12",
    "description": "Yang demikian itu tidak bisa terjadi lagi, karena sesungguhnya kamu ketika di kehidupan dunia telah mengingkari seruan apabila kalian diseru untuk menyembah Allah saja tanpa mempersekutukan-Nya. Dan jika Allah dipersekutukan, kamu sangat percaya bahwa Allah itu mempunyai sekutu. Maka keputusan sekarang ini wewenangnya adalah hanya pada Allah yang mahatinggi lagi mahabesar. 13. Pada ayat-ayat yang lalu digambarkan bagaimana orang-orang kafir menyesal dan memohon untuk dikembalikan ke kehidupan dunia agar dapat memperbaiki diri. Untuk itu, guna menghindari timbulnya penyesalan yang sama, ayat-ayat berikut memperingatkan umat manusia agar peduli terhadap tanda-tanda kekuasaan Allah. Dialah Allah tuhan yang maha esa, yang memperlihatkan tanda-tanda kekuasaan-Nya kepa-damu, dan menurunkan rezeki yang berlimpah dari langit untukmu. Dan sungguh tidak lain, yang mendapat pelajaran dari tanda-tanda kekuasaan Allah itu hanyalah orang-orang yang kembali kepada-Nya."
  }
]