[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah yang memperlihatkan KuasaNya kepada kalian (wahai manusia) melalui apa yang kalian saksikan berupa tanda-tanda agung yang menunjukkan kesempurnaan Pencipta dan Pembuatnya, Dia juga menurunkan hujan untuk kalian dari langit yang dengannya kalian mendapatkan rizki. Dan tiada yang mengambil pelajaran dari ayat-ayat ini kecuali orang-orang yang kembali kepada ketaatan kepada Allah dan mengikhlaskan ibadah hanya untukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah memperlihatkan tanda-tanda keagungan-Nya di alam raya dan pada diri kalian untuk menunjukkan kepada kalian kodrat dan keesaan-Nya. Allah menurunkan hujan bagi kalian agar ia menjadi sebab dari rezeki kalian, yaitu tanaman, tumbuhan dan lainnya. Dan tidak ada yang mengambil pelajaran dari ayat-ayat Allah kecuali orang yang kembali kepada Allah dengan bertobat secara ikhlas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-16. Allah menunjukkan kepada kalian tanda-tanda kekuasaan dan keesaan-Nya, dan menurunkan air hujan dari awan sehingga menjadi sebab datangnya rezeki yang baik. Tidak ada yang mengambil ibrah dari tanda-tanda itu selain orang yang kembali kepada Allah dengan taubat dan ketaatan. Maka sembahlah Allah Semata, meski orang-orang kafir membenci hal itu. Allah Maha Tinggi, tidak ada yang menandingi ketinggian derajat-Nya, Dia adalah pemilik ‘arsy. Allah menurunkan wahyu dengan perintah-Nya kepada rasul yang Dia pilih, agar dia dapat memberi peringatan dari hari kiamat ketika seluruh makhluk berkumpul pada satu tempat untuk menjalani hisab, mereka semua tampak hakikatnya, tidak ada satupun amal perbuatan mereka yang tersembunyi dari Allah. Ketika itu Allah akan berfirman kepada mereka: “Siapa Raja Yang Berkuasa pada hari ini?” Maka Mereka menjawab: “Allah Yang Maha Esa yang tidak memiliki sekutu dalam kerajaan dan kekuasaan-Nya, Yang Maha Berkuasa atas selain-Nya sesuai kehendak-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. هُوَ الَّذِى يُرِيكُمْ ءَايٰتِهِۦ (Dialah yang memperlihatkan kepadamu tanda-tanda (kekuasaan)-Nya) Yakni yang menunjukkan keesaan-Nya dan tanda kekuasaan-Nya. وَيُنَزِّلُ لَكُم مِّنَ السَّمَآءِ رِزْقًا ۚ( dan menurunkan untukmu rezeki dari langit) Yakni berupa air hujan, karena ia adalah sebab rezeki. Allah menyebutkan bahwa Dia memperlihatkan tanda-tanda kekuasaan-Nya dan menurunkan rezeki, karena tanda-tanda kekuasaan-Nya adalah asas bagi agama dan rezeki adalah asas bagi tubuh. وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ(Dan tiadalah mendapat pelajaran kecuali orang-orang yang kembali (kepada Allah)) Yakni tidak ada orang yang mengambil pelajaran dari tanda-tanda kekuasaan Allah yang luarbiasa itu kecuali orang yang kembali kepada ketaatan kepada Allah setelah melihat tanda-tanda itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dialah Allah Yang memperlihatkan kepada kalian berbagai bukti kekuasaan dan keesaan-Nya. Dialah Yang menurunkan hujan dari awan, yang menjadi sebab turunnya rizki kalian. Dialah Yang mengumpulkan nyawa dan jasad. Tidak seorangpun yang bisa mengambil pelajaran dari berbagai macam bukti yang telah Allah tampakkan itu kecuali orang yang tidak menyekutukan dan tidak durhaka kepada Allah. Mereka senantiasa taat kepada Allah dan bertafakur atas ayat-ayat Allah tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Dzat yang memperlihatkan ayat-ayatNya kepada kalian dan menurunkan rezeki dari langit untuk kalian} hujan yang Kami anugerahkan {Yang mendapat pelajaran} yang mengambil perlajaran dengan ayat ini {tidak lain, kecuali orang-orang yang kembali} kembali kepada Allah dengan bertaubat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Allah menyebutkan nikmat-nikmatNya yang sangat besar atas hamba-hambaNya yang telah menjelaskan yang haq daei yang batil, dengan cara memperlihatkan kepada mereka ayat-ayatnya di dalam dii manusia, di jagat raya dan di dalam al-Quan, yang membuktikan segala yang dicari lagi diinginkan, yang menjelaskan petunjuk dari kesesatan, sehingga tidak ada sedikit pun keraguan dalam mengetahui kenyataan yang sebenanya bagi oang yang mengamati dan orang-oang yang merenungkannya. Ini merupakan bagian dai nikmatNya yang tebesa atas hamba-hambaNya, sehingga yang haq tidak menjadi sama dan yang bena tidak campur aduk. Bahkan Allah meragamkan bukti-bukti dan menjelaskan tanda-tanda aga orang yang binasa itu binasa berdasarkan bukti yang pasti dan supaya orang yang hidup itu hidup berdasarkan bukti yang pasti pula. Semakin besar dana gung permasalahan-perrmasalahannya, maka bukti-bukti yang membuktikannya semakin banyak dan semakin mudah. Perhatikanlah masalah tauhid. Oleh karrena permasalahan tauhid itu meprupakan permasalah yang paling besar, bahkan yang terbesar, maka dalil-dalil aqli dan naqli yang membuktikannya pun sangat banyak dan beragam. Dan Allah memberikan berbagai perumpamaan untuknya dan Allah juga membeikan cara-cara pembuktian yang banyak. Maka dari itu, pada tempat ini Dia menyebutkan dan menjelaskan sejumlah darri dalil-dalilnya, seraya berfirman, “maka sembahlah Allah dengan memurnikan kapatuhan kepadaNya”. Setelah Allah menjelaskan bahwasanya Dia memperrlihatkan bebeapa ayat=ayatNya kepada hamba-hambaNya, maka Dia mengingatkan akan satu tanda yang sangat besar dan luar biasa, seraya berfirman, “dan Dia menurunkan rizki dari langit” maksudnya, hujan yang dengannya kalian diberi rizki dan kalian beseta hewan ternak kalian hidup. Ini membuktikan bahwa semua nikmat adalah berasal darriNya. Di antara karuniaNya adalah agama. Ia adalah permasalahan-permasalahan religi dengan dalil-dalil serta pengamalannya. Semua nikmat duniawi, seperti nikmat yang timbul akibat hujan yang dengannya daerah-daerah dan manusia bisa hidup, membuktikan dengan pasti bahwasanya hanya Dia-lah yang berhak disembah, dan ketaatan harus murni kepadaNya, sebagaimana Dia sematalah pemberri nikmat. “dan tiadalah mendapat pelajaran” dari tanda-tanda ketia ia dingatkan dengannya “kecuali orang-orang yang kembali” kepadaNya dengan memusatkan diri mencintaiNya, takut kepadaNya, taat kepadaNya dan merendahkan diri di hadapanNya. Inilah orang yang bisa mengambil manfaat dari tanda-tanda itu, dan tanda-tanda itu menjadi rahmat baginya dan dengannya ia menjadi lebih mengetahui."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 13: (Dialah yang memperlihatkan kepada kalian tanda-tanda-Nya) yang menunjukkan akan keesaan-Nya (dan menurunkan untuk kalian rezeki dari langit) berupa hujan. (Dan tiadalah mendapat pelajaran) yakni mengambil nasihat (kecuali orang-orang yang kembali kepada Allah) dari kemusyrikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan nikmat-nikmat-Nya yang besar kepada hamba-hamba-Nya dengan menerangkan yang hak dari yang batil, memperlihatkan kepada hamba-hamba-Nya ayat-ayat-Nya yang ada dalam diri mereka, dan yang tampak di penjuru langit serta yang ada dalam Al Qur’an; yang menunjukkan kepada setiap tuntutan yang diinginkan dan yang menerangkan petunjuk dari kesesatan, dimana tidak ada lagi sedikit pun keraguan bagi orang yang memperhatikannya dan menelitinya untuk mengetahui semua hakikat. Ini termasuk nikmat terbesar yang Allah berikan kepada hamba-hamba-Nya, dimana Dia tidak menyisakan sedikit pun syubhat terhadap yang hak dan tidak menyisakan kesamaran pun terhadap kebenaran. Bahkan Allah Subhaanahu wa Ta'aala menunjukkan dengan cara yang beraneka ragam (tidak satu macam) dan memperjelas ayat agar binasa orang yang binasa di atas bukti dan agar hidup orang yang hidup di atas bukti. Jika masalahnya lebih agung dan lebih besar, maka dalil terhadapnya lebih banyak dan lebih mudah lagi. Perhatikanlah kepada tauhid, karena masalahnya sangat besar sekali bahkan paling besar, maka banyak sekali dalil-dalilnya baik secara ‘aqli (akal) maupun naqli dan ditunjukkan dengan cara yang beraneka ragam, dan Allah membuatkan perumpamaan untuknya serta memperbanyak pengambilan dalil darinya. Oleh karena itu, Allah Subhaanahu wa Ta'aala sebutkan ayat-ayat yang menunjukkan kepada tauhid dan mengingatkan sebagian besar dalilnya, selanjutnya Dia berfirman, “Maka sembahlah Allah dengan memurnikan ibadah kepada-Nya, meskipun orang-orang kafir tidak menyukai(nya).” Yang menunjukkan keesaan-Nya. Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa Dia memperlihatkan kepada hamba-hamba-Nya ayat-ayat-Nya, maka Dia mengingatkan pula ayat yang besar, yaitu firman-Nya, “dan menurunkan rezeki dari langit untukmu.” Rezeki dari langit di sini adalah hujan, dimana dengannya manusia memperoleh rezeki dan dapat hidup, baik mereka maupun hewan ternak mereka. Hal ini menunjukkan bahwa semua nikmat berasal dari-Nya. Dari-Nya nikmat-nikmat agama, yaitu berbagai masalah agama dan dalil-dalilnya dan sesuatu yang mengikutinya berupa pengamalannya. Demikian pula dari-Nya nikmat-nikmat dunia, seperti nikmat yang muncul dari hujan yang diturunkan-Nya, dimana dengannya tanah maupun hamba menjadi hidup. Hal ini menunjukkan secara qath’i (pasti) bahwa Allah yang berhak disembah dan yang harus diberikan keikhlasan dalam beragama sebagaimana Dia saja yang mengaruniakan nikmat. Dari ayat-ayat tersebut ketika diingatkan. Yaitu dengan mencintai-Nya, takut kepada-Nya, menaati-Nya dan bertadharru’ (merendahkan diri) kepada-Nya. Orang inilah yang dapat mengambil manfaat dari ayat-ayat tersebut dan ayat-ayat tersebut menjadi rahmat baginya serta menambahkan bashirah (ketajaman pandangan)nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 13",
    "description": "Pada ayat-ayat yang lalu digambarkan bagaimana orang-orang kafir menyesal dan memohon untuk dikembalikan ke kehidupan dunia agar dapat memperbaiki diri. Untuk itu, guna menghindari timbulnya penyesalan yang sama, ayat-ayat berikut memperingatkan umat manusia agar peduli terhadap tanda-tanda kekuasaan Allah. Dialah Allah tuhan yang maha esa, yang memperlihatkan tanda-tanda kekuasaan-Nya kepa-damu, dan menurunkan rezeki yang berlimpah dari langit untukmu. Dan sungguh tidak lain, yang mendapat pelajaran dari tanda-tanda kekuasaan Allah itu hanyalah orang-orang yang kembali kepada-Nya. 14. Maka oleh sebab itu, sembahlah Allah, dan dengan tulus ikhlas-lah beragama kepada-Nya, meskipun orang-orang kafir tidak menyukai sikap keberagamaan kalian itu."
  }
]