[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ikhlaskanlah (wahai orang-orang Mukmin) ibadah dan doa hanya kepada Allah semata, selisihilah jalan orang-orang musyrik sekalipun hal itu membuat mereka marah, jangan pedulikan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Berdoalah kepada Allah -wahai orang-orang yang beriman- dengan mengikhlaskan ketaatan dan mengikhlaskan doa hanya kepada-Nya tanpa menyekutukan-Nya, sekalipun orang-orang kafir membenci hal itu dan membuat mereka marah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فَادْعُوا۟ اللهَ مُخْلِصِينَ لَهُ الدِّينَ (Maka sembahlah Allah dengan memurnikan ibadat kepada-Nya) Yakni mengikhlaskan ibadah bagi-Nya sebagaimana kalian diperintahkan. وَلَوْ كَرِهَ الْكٰفِرُونَ(meskipun orang-orang kafir tidak menyukai(nya)) Maka janganlah kalian pedulikan ketidaksukaan mereka, dan biarkan mereka mati dengan ketidaksukaan mereka itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Maka, teguh dan ikhlaslah dalam menyembah dan beribadah kepada Allah dengan tidak menyekutukan-Nya. Meskipun orang-orang kafir tidak menyukai itu dan mereka enggan melakukannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka sembahlah Allah dengan mengikhlaskan ketaatan} ketaatan dan ibadah {kepadaNya meskipun orang-orang kafir tidak suka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. oleh karena tanda-tanda itu membuahkan kesadaran dan kesadaan menimbulkan keikhlasan kepada Allah, maka perintah untuk memurnikan kepatuhan kepadaNya didahulukan dengan “fa” yang bemakna “sababiyyah” seraya berfiman, “maka sembahlah Allah dengan memurnikan kepatuhan kepadaNya”. Perintah ini mencakup doa ibadah dan doa masalah. Ikhlas di sini artinya memurnikan niat hanya kepada Allah dalam segala bentuk ibadah yang wajib dan yang Sunnah, hak-hak Allah dan hak-hak hamba-hambanya. Maksudnya, ikhlaskan-lah untuk Allah setiap apa yang kalian jadikan sebagai agama dan apala uang kalian jadikan sebaga taqorrub kepadaNya. “meskipun orang-orang kafi tidak menyukai” hal itu, jangan hiaukan mereka dan hal itu jangan sampai menghalangi kalian dai agama kalian, dan jangan sampai cacian oang yang mencaci membuat kalian diam, sebab orang-orang kafir itu memang selalu membenci ikhlash kepada Allah dengan sebenci-bencinya, seperti yang difirmankan oleh Allah : “Dan apabila hanya nama Allah saja yang disebut, kesallah hati orang-orang yang tidak beriman kepada kehidupan akhirat; dan apabila nama sembahan-sembahan selain Allah yang disebut, tiba-tiba mereka bergirang hati.” (Az-Zumar: 45)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 14: (Maka serulah Allah) sembahlah Dia (dengan memurnikan ibadah kepada-Nya) artinya, memurnikan agama dari kemusyrikan (meskipun orang-orang kafir tidak menyukainya) sekalipun mereka tidak menyukai keikhlasan kalian kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena ayat tersebut membuat seseorang sadar, dan kesadaran mengharuskan seseorang berbuat ikhlas kepada Allah, maka Allah Subhaanahu wa Ta'aala lanjutkan dengan perintah berbuat ikhlas. Yakni dengan berbuat ikhlas dalam beribadah dan dalam taqarrub (pendekatan diri) kepada-Nya. Ikhlas artinya membersihkan niat karena Allah Subhaanahu wa Ta'aala dalam semua ibadah baik yang wajib maupun yang sunat, baik yang terkait dengan hak Allah maupun hak hamba Allah. Oleh karena itu jangan pedulikan mereka dan janganlah yang demikian itu menghalangi kamu dari menjalankan agamamu, dan janganlah kamu berhenti hanya karena ada celaan orang yang mencela, karena memang orang-orang kafir tidak suka sekali dengan ikhlas sebagaimana yang diterangkan dalam surah Az Zumar: 45."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 14",
    "description": "Maka oleh sebab itu, sembahlah Allah, dan dengan tulus ikhlas-lah beragama kepada-Nya, meskipun orang-orang kafir tidak menyukai sikap keberagamaan kalian itu. 15. Yakinlah dengan seyakin-yakinnya bahwa dialah yang mahatinggi derajat-Nya, dan dia pula yang memiliki 'arsy, dan yang menurunkan wah-yu yakni Al-Qur'an dengan perintah-Nya kepada siapa yang dia kehendaki di antara hamba-hamba-Nya untuk menjadi rasul-Nya, agar rasul itu memperingatkan manusia tentang hari pertemuan, yaitu hari kiamat."
  }
]