[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah, Dia-lah Yang Mahatinggi, yang derajat-derajatNya membubung tinggi sehingga Dia tidaklah sama dengan makhluk-makhlukNya, dan kedudukanNya juga tinggi, dan Dia adalah Pemilik Arasy yang agung. Diantara bentuk rahmatNya kepada hamba-hambaNya adalah bahwa Dia mengutus para Rasul kepada mereka untuk menyampaikan wahyu yang dengannya mereka hidup, sehingga mereka menjalani segala urusan mereka dengan dasar ilmu yang jelas, agar para rasul itu mempertakutkan hamba-hamba, di samping juga memberikan peringatan kepada mereka tentang Hari Kiamat di mana di sana orang-orang terdahulu dan orang-orang terakhir akan bertemu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah lah yang berhak mendapatkan keikhlasan dalam ketaatan dan doa. Derajat-Nya tinggi, terpisah dari segala makhluk-Nya, Dia adalah Rabb Arasy yang agung, menurunkan wahyu kepada siapa yang Dia kehendaki dari hamba-hamba-Nya agar mereka hidup dan menghidupkan selain mereka, untuk memperingatkan manusia terhadap hari Kiamat yang orang-orang terdahulu dan yang kemudian bertemu pada hari itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. رَفِيعُ الدَّرَجٰتِ ((Dialah) Yang Maha Tinggi derajat-Nya) Yakni Dialah yang menunjukkan tanda-tanda kekuasaan-Nya dan memiliki sifat yang Maha Tinggi. ذُو الْعَرْشِ(Yang mempunyai ‘Arsy) Yakni penguasa, pencipta, dan pengatur ‘Arsy, Dia bersemayam di atasnya, dan ini menunjukkan ketinggian dan keagungan kekuasaan-Nya. يُلْقِى الرُّوحَ مِنْ أَمْرِهِۦ(Yang mengutus Jibril dengan (membawa) perintah-Nya) Allah menyebut wahyu dengan sebutan ruh, karena dengannya manusia dapat hidup dari kematian kekafiran, sebagaimana badan yang hidup dengan ruh. Dan makna kata ‘perintah-Nya’ yakni syari’at-syari’at yang diwahyukan kepada nabi-nabi-Nya agar mereka menjalankannya dalam kehidupan mereka. عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ(kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya) Mereka adalah para nabi, Allah memilih mereka dari hamba-hamba-Nya yang lain. لِيُنذِرَ يَوْمَ التَّلَاقِ (supaya dia memperingatkan (manusia) tentang hari pertemuan (hari kiamat)) Yakni agar dia memperingatkan dari azab yang ada pada hari bertemunya penduduk langit dengan penduduk bumi di padang mahsyar, serta bertemunya orang-orang terdahulu dengan para penerusnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Dialah Allah Yang memiliki sifat-sifat yang luhur, Yang Maha Suci dari segala persamaan terhadap makhluk. Yang Menciptakan, Memiliki dan Menguasai “Arsy, juga Yang Berhak Melakukan segala sesuatu atasnya. Dia berkehendak menurunkan wahyu kepada hamba-Nya. Wahyu itu disebut sebagai ruh, karena wahyu itu seperti ruh untuk jasad. Dia menyampaikannya melalui kalam-Nya, sebagai peringatan dan ancaman atas datangnya hari dimana makhluk kembali kepada pencipta-Nya untuk dihisab dan diberi balasan atas segala amalnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat Yang Maha tinggi derajatNya} Dzat yang tinggi derajatNya yang jelas bagi makhlukNya {yang memiliki ʻArsy, yang menurunkan wahyu} menurunkan wahyu {dengan perintahNya} dengan keputusanNya {kepada siapa saja yang Dia kehendaki di antara hamba-hambaNya agar memperingatkan tentang hari pertemuan} hari kiamat dimana orang-orang terdahulu dan akan datang bertemu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Kemudian Allah menjelaskan bagian dari kebesaran dan kesempurrnaanNya, hal yang menuntut keharusan memurnikan ibadah kepadaNya, seraya berfirman, “Yang Mahatinggi derajatNya, Yang mempunyai ‘Arasy”, yakni Yang Mahatinggi lagi tertinggi, yang bersemayam di atas Arasy dan itu adalah keistimewaanNya. Derajatnya tinggi dan ketinggian yang menjadikan Dia terpisah dari semua makhlukNya dan dengan itu pula martabatnya semakin tinggi, sifat-sifatNya luhur, DzatNya Maha tinggi, tidak bisa di dekati kecuali dengan amal yang bersih lagi suci dan menyucikan, yaitu ikhlash yang bisa mengangkat derajat para pelakunya, mendekatkan mereka kepadaNya dan menjadikan mereka berada di atas makhlukNya. Kemudian Allah mengingatkan akan nimtaNya atas hamba-hambaNya berupa kerasulan dan wahyu seraya berfirman, “Yang menyampaikan ruh”. Maksudnya adalah wahyu yang bagi ruh dan hati laksana ruh bagi jasad. Jasad tanpa ruh tidak akan bisa hidup, dan demikian pula ruh dan hati tanpa ruh wahyu tidak bisa menjadi baik dan tidak akan berruntung. Maka Allah “yang menyampaikan ruh dengan perintahNya” yang di dalamnya terkandung kebaikan dan kemaslahatan bagi manusia, “kepada siapa yang dikehendakiNya di antara hamba-hambaNya” yaitu para rosul yang telah Dia utamakan dan istimewakan dengan wahyu dan bedakwah kepada hamba-hambaNya. Faidah dari diutusnya para rosul adalah menggapai kebehagiaan untuk manusia di dunia, agama dan akhirat mereka, dan menghilangkan kesengsaraaan dari mereka dalam urusan dunia, agama dan akhirat mereka, maka dari itu Allah berfirman, “supaya Dia memperingatkan”. Maksudnya, supaya orang-orang yang diberi wahyu oleh Allah itu meberi peringatan, “tentang hari pertemuan”. Maksdunya, supaya ia mempertakuti manusia akan hari itu dan menghimbau mereka untuk mempersiapkan diri dengan melakukan sebab-sebab yang dapat menyelamatkan diri mereka dari apa yang akan terjadi pada hari itu. Allah menyebutnya yaumut talaq adalah karena pada hari itu sang Khaliq bertemu dengan makhluk-makhlukNya, dan pertemuan antara sesame mereka serte pertemuan para pelaku dengan amal-amal perbuatannya dan juga balasannya untuk mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 15: (Dialah Yang Maha Tinggi derajat-Nya) maksudnya, Allah Maha Agung sifat-sifat-Nya, atau Dialah Yang mengangkat derajat orang-orang yang beriman di surga (Yang mempunyai Arasy) Yang menciptakannya (Yang menurunkan Ar-Ruuh) yakni wahyu (dari perintah-Nya) atau firman-nya (kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya, supaya dia memperingatkan) maksudnya, orang yang menerima wahyu itu diperintahkan untuk menyampaikan wahyu-Nya kepada manusia (tentang hari pertemuan) dapat dibaca At-Talaaqi atau At-Talaaqiy dengan memakai huruf Ya. Yakni hari kiamat, karena pada hari itu penduduk langit dan penduduk bumi bertemu, dan bertemu pula antara Yang Disembah dan yang menyembah, sebagaimana dipertemukan pula antara orang yang aniaya dan orang yang dianiaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala karena keagungan dan kesempurnaan-Nya menyebutkan sesuatu yang menghendaki untuk berbuat ikhlas dalam beribadah kepada-Nya. Bisa juga diartikan, bahwa Dia meninggikan derajat orang-orang mukmin di surga. Yakni yang Mahatinggi, dimana Dia bersemayam di atas ‘Arsy-Nya. Derajat-Nya begitu tinggi sehingga jauh berbeda dengan makhluk-Nya, kedudukan-Nya pun sangat tinggi, sifat-sifat-Nya tampak jelas, Dzat-Nya tinggi sekali dan tidak ada amal yang dapat dipersembahkan kepada-Nya kecuali amal yang bersih, suci lagi menyucikan, yaitu ikhlas, dimana ia akan mengangkat derajat pemiliknya dan mendekatkan mereka kepada-Nya serta menjadikan mereka berada tinggi di atas yang lain. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya kepada hamba-hamba-Nya berupa risalah dan wahyu. Wahyu disebut dengan ruh, karena ia ibarat ruh bagi jasad, dimana jasad tidak akan hidup tanpanya. Oleh karena jasad tidak akan hidup kecuali dengan ruh, maka ruh itu sendiri tanpa wahyu tidak akan baik dan beruntung. Maka Allah Subhaanahu wa Ta'aala menurunkan wahyu dengan perintah-Nya, dimana di dalamnya terdapat manfaat bagi hamba dan maslahat mereka. Yaitu para rasul yang Allah lebihkan dan istimewakan mereka dengan wahyu-Nya dan dengan berdakwah kepada kaumnya. Faedah diutusnya rasul adalah untuk menghasilkan kebahagiaan bagi hamba baik pada agama mereka, dunia mereka maupun akhirat mereka serta menyingkirkan kesengsaraan dari mereka baik pada agama, dunia maupun akhiratnya. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “agar memperingatkan (manusia) tentang hari pertemuan (hari kiamat).” Dia menakut-nakuti manusia dengannya, mendorong mereka untuk bersiap-siap menghadapinya dengan menyiapkan sebab-sebab yang dapat menyelamatkan seseorang pada hari itu. Hari Kiamat disebut hari pertemuan karena ketika itu penghuni langit bertemu dengan penghuni bumi, yang menyembah bertemu yang disembah, yang beramal bertemu dengan amalnya, dan yang zalim bertemu dengan yang dizalimi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 15",
    "description": "Yakinlah dengan seyakin-yakinnya bahwa dialah yang mahatinggi derajat-Nya, dan dia pula yang memiliki 'arsy, dan yang menurunkan wah-yu yakni Al-Qur'an dengan perintah-Nya kepada siapa yang dia kehendaki di antara hamba-hamba-Nya untuk menjadi rasul-Nya, agar rasul itu memperingatkan manusia tentang hari pertemuan, yaitu hari kiamat. 16. Yaitu pada hari ketika mereka, manusia keluar dari kubur tanpa kemampuan menyembunyikan rahasia diri; dan tidak sesuatu pun keadaan perbuatan mereka yang tersembunyi di sisi Allah. Lalu Allah berfirman, 'milik siapakah kerajaan pada hari ini'' kemudian terdengar jawaban, 'milik Allah yang maha esa lagi maha mengalahkan. '."
  }
]