[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di Hari Kiamat, seluruh makhluk akan menghadap Tuhan mereka, tiada seorang pun dari mereka yang samar bagi Allah, tiada sedikit pun amal yang mereka lakukan di dunia yang tidak diketahui oleh Allah, saat itu Allah berfirman, “Milik siapa kerajaan dan hak bertindak di hari ini ?” lalu Allah sendiri yang menjawab, “Hanya milik Allah yang Maha Esa dengan nama-nama dan sifat-sifatNya serta perbuatan-perbuatanNya, juga Mahakuat Yang mengalahkan seluruh makhluk dengan Kuasa dan keperkasaanNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Hari di saat mereka datang, berkumpul di satu tanah lapang, tidak ada sesuatu yang samar bagi Allah, tidak diri mereka, tidak amal perbuatan mereka, tidak pula balasan mereka. Allah berfirman, “Milik siapa kekuasaan pada hari ini?” Tidak ada jawaban kecuali satu, “Kekuasaan adalah milik Allah yang tunggal pada żat, sifat-sifat dan perbuatan-perbuatan-Nya, lagi Mahakuat yang mengalahkan segala sesuatu, dan segala sesuatu tunduk kepada-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. يَوْمَ هُم بٰرِزُونَ ۖ ((Yaitu) hari (ketika) mereka keluar (dari kubur)) Yakni ketika mereka keluar dari kubur mereka dalam keadaan telanjang, tanpa berbusana apapun. لَا يَخْفَىٰ عَلَى اللهِ مِنْهُمْ شَىْءٌ ۚ( tiada suatupun dari keadaan mereka yang tersembunyi bagi Allah) Yakni amalan-amalan yang mereka kerjakan di dunia tidak ada yang tersembunyi dari-Nya, baik itu yang ada di dada mereka maupun yang mereka nampakkan. لِّمَنِ الْمُلْكُ الْيَوْمَ ۖ( (Lalu Allah berfirman): “Kepunyaan siapakah kerajaan pada hari ini?”) Yakni jika telah dihadirkan semua makhluk yang ada di langit dan di bumi, Allah akan berfirman: “Siapa pemilik kerajaan pada hari ini?” yakni pada hari kiamat. Namun tidak ada yang menjawab, maka Allah menjawabnya sendiri dengan firman-Nya: لِلّٰهِ الْوٰحِدِ الْقَهَّارِ(Kepunyaan Allah Yang Maha Esa lagi Maha Mengalahkan) Imam al-Hasan berkata: Allah-lah yang bertanya, dan ketika tidak ada yang menjawabnya maka Allah menjawabnya sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Hari dimana mereka muncul dan keluar dari kubur-kubur mereka. Tidak ada sama sekali amal perbuatan mereka ketika di dunia yang dapat tersembunyi dari Allah. Allah berkata pada waktu itu: “Milik siapakah kekuasaan dan kerajaan pada hari ini?” Tidak ada satupun yang menjawab, sehinggga Allah Yang Maha Suci menjawab dengan perkataan: “Milik Yang Maha Esa dan Maha Satu, Yang Maha Mengalahkan atas semua makhluk-Nya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Yaitu) pada hari mereka tampak} mereka keluar dari kubur mereka tanpa tabir apapun {tidak (ada) satu pun dari mereka yang tersembunyi di sisi Allah.“Milik siapakah kerajaan pada hari ini. Milik Allah Yang Maha Esa lagi Maha Mengalahkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Yaitu hari ketika mereka keluar,” yakni, tampak di atas bumi dan mereka berkumpul di satu padang yang datar yang tidak ada cekung dan gundukannya. Mereka akan diperdengakan oleh sang penyeru, dan mata mereka akan benar-benar melihat, “tiada suatu pun yang tersembunyi bagi Allah” dari bagian-bagian jasad mereka, amal mererka ataupun balasan atas amal-amal mereka tersebut. “kepunyaan siapakan kerajaan pada hai ini?” Maksudnya, siapakah yang memiliki hari yang sangat dahsyat yang menghimpun seluruh umat manusia yang terdahulu dan yang kemudian, paa penghuni langit dan penghuni bumi, yang pada hari itu semua perserikatan teroutus, tidak ada sesuatu pun yang tersisa selain amal-alam sholih dana mal-amal buruk? Kerajaan itu adalah “kepunyaan Allah Yang Maha esa lagi Maha Mengalahkan” yakni, Yang esa pada Dzat, nama-nama, sifat-sifat dan perbuatan-perrbuatannNya, tidak ada sekutu apapun bagiNya dalam semua itu dari sisi manapun, maha Mengalahkan seluruh makhlukNya, yang kepadaNya-lah seluruh makhluk tunduk, hina dan patuh, terutama pada hari itu, hari yang semua wajah tunduk kepada Yang Mahahidup lagi Mengurusi makhlukNya, tidak ada seorang pun yang berbicara kecuali dengan izin dari Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 16: (Yaitu hari ketika mereka keluar) dari kuburnya masing-masing (tiada suatu pun dari keadaan mereka yang tersembunyi bagi Allah berfirman, \"Kepunyaan siapakah kerajaan pada hari ini?\") Allah sendiri yang mengatakannya, kemudian Dia sendiri pula yang menjawabnya, yaitu, (\"Hanya kepunyaan Allah Yang Maha Esa lagi Maha Mengalahkan\") atas semua makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka berkumpul di tanah padang mahsyar yang rata. Seruan terdengar oleh mereka semua dan sebuah pandangan dapat melihat mereka semua. Yakni siapakah yang memiliki hari yang agung itu, yang menghimpun manusia yang terdahulu maupun yang datang kemudian baik penghuni langit maupun penghuni bumi, dimana tidak ada keikutsertaan dalam kepemilikan itu, dan hubungan pun terputus sehingga tidak ada yang tersisa selain amal yang saleh atau amal yang buruk? Yakni yang esa dalam Dzat-Nya, nama-Nya, sifat-Nya dan perbuatan-Nya. Tidak ada sekutu bagi-Nya sedikit pun dalam hal itu dari berbagai sisi. Semua makhluk tunduk kepada-Nya, khususnya pada hari yang wajah-wajah tertunduk kepada Allah Yang Mahahidup lagi Berdiri Sendiri. Pada hari itu, tidak ada seorang pun yang berbicara kecuali dengan izin-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 16",
    "description": "Yaitu pada hari ketika mereka, manusia keluar dari kubur tanpa kemampuan menyembunyikan rahasia diri; dan tidak sesuatu pun keadaan perbuatan mereka yang tersembunyi di sisi Allah. Lalu Allah berfirman, 'milik siapakah kerajaan pada hari ini'' kemudian terdengar jawaban, 'milik Allah yang maha esa lagi maha mengalahkan. '17. Ayat-ayat yang lalu menegaskan bahwa Allah telah memperingatkan manusia tentang hari pertemuan, yang pada hari itu semua tampak dengan jelas, tanpa kemampuan menutup apa yang dirahasiakan. Ayat ini memperjelas penegasan tersebut, dengan firman Allah, 'pada hari itu, yakni pada hari pertemuan, setiap jiwa diberi balasan sesuai de-ngan apa yang telah dikerjakannya di kehidupan dunia. Tidak ada yang dirugikan atau dianiaya pada hari itu. Sungguh, Allah yang maha bijaksana sangat cepat perhitungan-Nya."
  }
]