[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari itu, setiap jiwa akan diberikan balasan atas apa yang dikerjakannya di dunia, kebaikan atau keburukan, tidak ada kedzhaliman bagi seorangpun dengan dikurangi pahalanya atau ditambahkan keburukannya. Sesungguhnya Allah Mahacepat hisabNya, maka jangan pernah merasa bahwa hari itu masih jauh, karena sebenarnya ia sudah dekat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Pada hari ini, setiap orang mendapatkan balasan atas amal perbuatan yang dikerjakannya, bila baik maka balasannya baik, bila buruk maka balasannya buruk. Tidak ada kezaliman pada hari ini, karena hakimnya adalah Allah yang Mahaadil. Sesungguhnya Allah Mahacepat hisab-Nya bagi hamba-hamba-Nya, karena ilmu-Nya meliputi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Pada hari ini -hari pemberian ketetapan di antara para hamba- setiap orang akan mendapat balasan atas kebaikan dan keburukan yang telah dia lakukan di dunia, tidak ada seorangpun yang terzalimi dengan pahala yang kurang atau siksaan yang lebih dari seharusnya. Sungguh Allah memberi perhitungan kepada seluruh manusia dengan cepat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. الْيَوْمَ تُجْزَىٰ كُلُّ نَفْسٍۭ بِمَا كَسَبَتْ ۚ (Pada hari ini tiap-tiap jiwa diberi balasan dengan apa yang diusahakannya) Baik itu amal kebaikan atau keburukan. لَا ظُلْمَ الْيَوْمَ ۚ( Tidak ada yang dirugikan pada hari ini) Baik itu dengan mengurangi pahalanya atau menambah siksaannya. إِنَّ اللهَ سَرِيعُ الْحِسَابِ (Sesungguhnya Allah amat cepat hisabnya) Allah sangat cepat perhitungan-Nya, sebab Allah tidak membutuhkan pembantu untuk melakukannya karena Allah mengetahui segala sesuatu, maka tidak ada yang terlewat dari-Nya walau sebesar biji sawi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Pada hari ini, setiap jiwa akan diberi balasan sesuai dengan amal perbuatannya, entah itu baik atau buruk. Pada hari itu tidak ada seorangpun yang dirugikan, tidak dikurangi juga tidak diberi tambahan. Allah sangat cepat dalam menimbang amal semua manusia, kira-kira setara dengan separuh hari di dunia. Itu semua karena Ilmu Allah meliputi segala sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ini setiap jiwa diberi balasan sesuai dengan apa yang telah diusahakan. Tidak ada satu pun yang dizalimi pada hari ini. Sesungguhnya Allah sangat cepat perhitunganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “pada hari ini tiap-tiap jiwa diberi balasan dengan apa yang diusahakannya,” di dunia, yang baik dan yang buruk, yang sedikit dengan yang banyak. ”tidak ada kezhaliman pada hari ini,” terhadap seseorang, dengan ditambah kejahatan-kejahatannya atau di kurangi sebagian dari kebaikan-kebaikannya. “sesungguhnya Allah maha cepat hisabnya.” Maksudnya, jangan kalian menganggap hari itu masih jauh, karena ia pasti datang, dan setiap yang pasti datang itu dekat. Dan Dia juga sangat cepat perhitunganNYa terhadap hamba-hambaNYa pada hari kiamat itu karena pengetahuanNya yang meliputi dan kemahasempurnaan kekuasaanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 17: (Pada hari ini tiap-tiap jiwa diberi balasan dengan apa yang diusahakannya. Tidak ada yang dirugikan pada hari ini. Sesungguhnya Allah amat cepat hisab-Nya) Dia menghisab semua makhluk hanya dalam waktu setengah hari dunia, demikianlah menurut keterangan hadis."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dunia, baik atau buruk. Dengan ditambah keburukannya atau dikurangi kebaikannya. Hal itu karena ilmu-Nya yang meliputi segala sesuatu dan sempurna kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 17",
    "description": "Ayat-ayat yang lalu menegaskan bahwa Allah telah memperingatkan manusia tentang hari pertemuan, yang pada hari itu semua tampak dengan jelas, tanpa kemampuan menutup apa yang dirahasiakan. Ayat ini memperjelas penegasan tersebut, dengan firman Allah, 'pada hari itu, yakni pada hari pertemuan, setiap jiwa diberi balasan sesuai de-ngan apa yang telah dikerjakannya di kehidupan dunia. Tidak ada yang dirugikan atau dianiaya pada hari itu. Sungguh, Allah yang maha bijaksana sangat cepat perhitungan-Nya. 18. Dan wahai nabi Muhammad, berilah mereka para pendurhaka itu peringatan akan hari yang semakin lama semakin dekat yakni hari kiamat, di hari ketika hati kaum musyrik itu menyesak sampai di kerongkongan karena menahan kesedihan. Tidak ada seorang pun teman setia atau karib kerabat maupun teman sejawat bagi orang yang zalim itu, dan tidak ada juga baginya seorang penolong yang diterima pertolongannya. '."
  }
]