[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berilah peringatan (wahai Rasul) kepada manusia tentang kedatangan Hari Kiamat yang sudah dekat, sekalipun mereka menganggapnya masih jauh, hari di mana hati para hamba, karena ketakutannya pada Allah, naik ke dada mereka, sehingga ia mencapai kerongkongan mereka sedangkan mereka dipenuhi rasa ketakutan dan kesedihan. Dan orang-orang zhalim tidak memiliki kawan, kerabat dan pemberi syafaat yang membantu mereka di hadapan Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Peringatkanlah mereka -wahai Rasul- tentang hari Kiamat yang sudah dekat, ia pasti tiba. Setiap yang datang adalah dekat. Pada hari itu, hati manusia naik ke tenggorokan karena ketakutan mereka yang luar biasa, mereka semuanya diam tidak seorang pun berkata-kata kecuali siapa yang Allah Maha Penyayang izinkan. Dan orang-orang yang zalim terhadap diri mereka dengan kesyirikan dan kemaksiatan tidak lagi mempunyai teman dan kerabat serta pemberi syafaat yang ditaati bila dianggap bahwa ia bisa memberi syafaat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Hai Rasulullah, peringatkanlah mereka dari hari kiamat yang telah dekat kedatangannya; ketika hati berguncang dengan keras sehingga hampir-hampir keluar dari tenggorokan karena ketakutan. Hati mereka akan dipenuhi kegundahan dan kesedihan, dan orang-orang kafir tidak akan memiliki teman atau kerabat, dan tidak mendapatkan pemberi syafaat yang dapat menyelamatkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَأَنذِرْهُمْ يَوْمَ الْاٰزِفَةِ (Berilah mereka peringatan dengan hari yang dekat) Yakni hari kiamat, disebut sebagai hari yang dekat karena hari ini sangat dekat kedatangannya. إِذِ الْقُلُوبُ لَدَى الْحَنَاجِرِ(ketika hati (menyesak) sampai di kerongkongan) Seakan-akan hati itu berpindah dari tempatnya akibat ketakutan yang dahsyat sehingga sampai di kerongkongan. كٰظِمِينَ ۚ( dengan menahan kesedihan) Yakni penuh dengan kegalauan dan kekhawatiran. مَا لِلظّٰلِمِينَ مِنْ حَمِيمٍ(Orang-orang yang zalim tidak mempunyai teman setia seorangpun) Yakni tidak memiliki teman dekat yang dapat memberi manfaat bagi mereka. وَلَا شَفِيعٍ يُطَاعُ (dan tidak (pula) mempunyai seorang pemberi syafa’at yang diterima syafa’atnya) Dalam mensyafa’ati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Peringatkanlah mereka tentang hari kiamat wahai Nabi, yang disebut juga sebagai hari penentuan. Hari itu hati menyesak hingga kerongkongan karena kesedihan yang sangat. Itu adalah ungkapan kinayah/majas atas kesempitan dan ketakutan yang amat sangat. Hati mereka dipenuhi dengan duka cita dan kesedihan. Orang-orang kafir tidak mempunyai siapa-siapa, bahkan teman atau kerabat yang dapat menyelamatkan mereka. Juga tidak akan mendapatkan syafaat dari siapapun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Peringatkanlah mereka tentang hari yang semakin dekat} pada hari kiamat yang semaki mendekat {ketika hati sampai di kerongkongan} pada hari itu karena ketakutan, hati melewati tempatnya naik menuju kerongkongan, sehingga tidak bisa keluar dari mulut mereka, dan tidak bisa kembali ke tempatnya {karena menahan} karena menahan {Tidak ada satu pun teman setia} teman dan sahabat yang berguna {bagi orang yang zalim dan tidak ada seorang penolong} memberi pertolongan bagi mereka di sisi Allah {yang diterima} diterima"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Allah berfirman kepada NabiNya Nabi Muhammad saw “berilah mereka peringatan dengan hari yang dekat,” maksudnya, hari kiamat yang sesungguhnya telah dekat dan waktunya sudah hampir mencapai kepada prahara, keganasan, dan kegoncangannya, “ketika hati menyesak sampai kerongkongan,” yakni, sudah naik menyesak dan hatinya sudah menjadi hampa dan ruh menyesak ke kerengkongan karena rasa takut dan kengerian hebat yang menyelimuti dengan mata terbelak, “dengan menahan kesedihan,” dimana mereka tidak berbicara kecuali orang yang diberi izin oleh Allah yang Rahman, dan ia mengatakan yang benar, mereka menahan rasa takut yang sangat dahsyat. “orang-orang yang zhalim tidak mempunyai teman yang setia satu pun,” tidak teman dekat, maupun sahabat karib,” dan tidak pula mempunyai seorang yang pemberi syafaat yang dipatuhi,” karena para pemberi syafaat tidak akan memberikan syafaat terhadap orang zhalim karena berbuat syirik. Kalaupun dipastikan bisa memberi syafaat, namun Allah tidak akan meridhai syafaatnya dan tidak memperkenankannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 18: (Berilah mereka peringatan dengan hari yang dekat) yakni hari kiamat. Berasal dari kata Azifar Rahiilu, artinya, Waktu berangkat telah dekat (yaitu ketika kalbu) menyesak karena dicekam rasa takut (sampai) artinya hingga sesaknya terasa sampai (di kerongkongan dengan menahan kedukaan) penuh dengan kesedihan. Lafal Kaazhimiina ini adalah Hal atau kata keterangan keadaan bagi lafal Al-Quluubu, kemudian dianggap sebagai jamak dengan memakai huruf Ya dan Nun karena diibaratkan kepada para pemiliknya. (Tiada teman-teman yang setia bagi orang-orang yang zalim) maksudnya tiada teman sejawat dan dekat (dan tidak pula mempunyai seorang pemberi syafaat yang diterima syafaatnya) yang dapat diterima syafaatnya; lafal Yuthaa'u sebagai sifat, tidak mengandung pengertian apa-apa, karena pada asalnya tiada syafaat bagi mereka, sebagaimana yang telah diungkapkan oleh firman-Nya yang lain, yaitu, \"Maka kami tidak mempunyai pemberi syafaat seorang pun.\" (Q.S. Asy-Syu'ara, 100). Tetapi kalau lafal Syafii'in, memang mengandung makna, karena ditinjau dari segi dugaan mereka yaitu, bahwasanya mereka memiliki pemberi-pemberi syafaat. Maksudnya, seandainya mereka memberi syafaat, niscaya syafaat mereka tidak akan diterima."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman kepada Nabi-Nya Muhammad shallallahu 'alaihi wa sallam untuk memberikan peringatan kepada manusia terhadap hari yang semakin dekat, yaitu hari Kiamat. Hari Kiamat disebut hari yang dekat, karena sesuatu yang akan datang adalah dekat, dan karena ketika manusia menyaksikannya, maka mereka menganggap bahwa hidup mereka di dunia hanya sebentar saja; pada waktu sore atau waktu Duha. Hati mereka kosong, rasa takut naik ke tenggorokan dan mata mereka terbuka. Demikian pula menahan takut yang sangat. Karena pemberi syafaat tidak akan memberi syafaat kepada orang yang menzalimi dirinya dengan syirk. Kalau pun mereka mau memberi syafaat, namun Allah Subhaanahu wa Ta'aala tidak ridha sehingga tidak diterima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 18",
    "description": "Dan wahai nabi Muhammad, berilah mereka para pendurhaka itu peringatan akan hari yang semakin lama semakin dekat yakni hari kiamat, di hari ketika hati kaum musyrik itu menyesak sampai di kerongkongan karena menahan kesedihan. Tidak ada seorang pun teman setia atau karib kerabat maupun teman sejawat bagi orang yang zalim itu, dan tidak ada juga baginya seorang penolong yang diterima pertolongannya. '19. Dia, yakni Allah, mengetahui pandangan mata yang khianat, seperti kerlingan sekejap yang mengarah kepada perbuatan maksiat walau orang lain tidak melihat, dan apa yang tersembunyi dalam dada yang tidak diutarakan dengan kata-kata."
  }
]