[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengetahui lirikan pandangan-pandangan sekilas yang dilakukan oleh mata, juga kebaikan atau keburukan yang manusia simpan di dalam dadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Allah mengetahui pencurian yang dilakukan oleh mata orang yang memandang, mengetahui apa yang disembunyikan oleh dada, tidak ada sesuatu pun yang samar bagi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Allah memperingatkan hamba-hamba-Nya dari pandangan mata yang haram, Allah mengetahui perbuatan itu dan akan memberi perhitungan terhadapnya. Dan Allah mengetahui kebaikan atau keburukan yang tersembunyi dalam hari. Allah menyampaikan bahwa Dia menetapkan hukum di antara para hamba dengan adil; adapun sesembahan-sesembahan yang disembah selain Allah tidak dapat melakukan hal itu. Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala keadaan dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. يَعْلَمُ(Dia mengetahui) Allah mengetahui. خَآئِنَةَ الْأَعْيُنِ((pandangan) mata yang khianat) Yakni curian pandangan kepada hal yang tidak halal untuk dilihat. Qatadah mengatakan maknanya adalah memberi isyarat dengan mata dalam hal yang tidak disukai Allah. وَمَا تُخْفِى الصُّدُورُ(dan apa yang disembunyikan oleh hati) Yakni segala kemaksiatan yang disukai hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Allah Maha Tahu terhadap pandangan mata yang khianat, yaitu pandangan birahi terhadap sesuatu yang tidak halal baginya. Allah juga Maha Mengetahui apa yang tersembunyi dalam hati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia mengetahui mata yang berkhianat} mencuri pandangan pada hal yang tidak boleh untuk dipandang {dan apa yang tersembunyi di dalam dada"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dia mengetahui penghkianatan pandangan mata,” maksudnya, pandangan yang disembunyikan oleh seseorang dari temannya dan dari rekan-rekannya, yaitu mencuri pandangan,” dan apa yang disembunyikan oleh hati” dari hal-hal yang tidak dijelaskan oleh seseorang kepada orang lain. Jadi Allah mengetahui yang tersembunyi itu, apalagi perkara-perkara yang nyata, tentu Dia lebih mengetahui lagi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 19: (Dia mengetahui) Allah mengetahui (mata yang khianat) ketika mencuri pandang melihat hal-hal yang diharamkan (dan apa yang disembunyikan oleh hati) yang tersimpan di dalam kalbu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan pandangan mata yang khianat adalah pandangan yang dilarang, seperti memandang kepada wanita yang bukan mahramnya. Menurut Syaikh As Sa’diy, bahwa maksudnya adalah pandangan yang disembunyikan oleh seorang hamba terhadap kawannya, ia adalah pencurian pandangan. Yang tidak ditampakkan oleh seorang hamba. Jika yang tersembunyi saja diketahui oleh Allah, maka yang tampak tentu lebih diketahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 19",
    "description": "Dia, yakni Allah, mengetahui pandangan mata yang khianat, seperti kerlingan sekejap yang mengarah kepada perbuatan maksiat walau orang lain tidak melihat, dan apa yang tersembunyi dalam dada yang tidak diutarakan dengan kata-kata. 20. Dan karena Allah itu maha mengetahui lagi maha bijaksana, dia mahasanggup memutuskan perkara dengan kebenaran. Sedang mereka dan apa yang disembah oleh mereka selain-Nya, tidak akan mampu memutuskan dengan sesuatu apa pun. Sesungguhnya Allah, hanya dialah tuhan yang maha mendengar lagi maha melihat."
  }
]