[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Diturunkannya al-Qur’an kepada nabi Muhammad adalah dari sisi Allah yang Mahaperkasa yang dengan keperkasaanNya mengalahkan seluruh makhluk, juga maha Mengetahui segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Diturunkannya Al-Qur`ān kepada Muhammad -ṣallallāhu 'alaihi wa sallam- adalah dari Allah yang Maha Perkasa, yang tidak ada seorang pun bisa mengalahkannya, yang Maha mengetahui kemaslahatan hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah memuji al-Qur’an ini, ia adalah kitab yang diturunkan Allah Yang Maha Perkasa dalam kerajaan-Nya dan Maha Mengetahui segala keadaan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. تَنزِيلُ الْكِتٰبِ مِنَ اللهِ الْعَزِيزِ الْعَلِيمِ (Diturunkan Kitab ini (Al Quran) dari Allah Yang Maha Perkasa lagi Maha Mengetahui) Yakni al-Qur’an benar-benar diturunkan oleh Allah, dan bukan kedustaan yang dibuat atas namanya. Makna (العزيز) yakni Maha Perkasa dan Kuasa. Dan (العليم) yakni Maha Mengetahui makhluk-makhluk-Nya dan apa yang mereka katakan dan lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Al-quran ini diturunkan dengan kebenaran bukan dusta. Dari sisi Allah Yang Maha Perkasa, Maha Penakluk dan tidak terkalahkan. Yang Maha Luas Pengetahuan-Nya terhadap keadaan makhluk-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diturunkannya kitab ini dari Allah Yang Maha perkasa lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah subhnahu wata’ala mengabarkan tentang kitab-Nya yang agung, yaitu bahwa sesungguhnya ia berasal dan diturunkan dari sisi Allah yang berhak dipuja dan disembah, karena kemahasempurnaan-nya dan keesaan-Nya dalam segala perbuatan-Nya. “Yang Maha Perkasa” yang dengan keperkasaan-Nya Dia menundukan semua makhluk. “Yang Maha Mengetahui” segala sesuatu. “yang Mengampuni dosa” dari orang-orang yang berbuat dosa. “Dan Menerima taubat” dari orang-orang yang betaubat. “Lagi keras hukuman-Nya” terhadap siapa saja yang lancang berbuat dosa dan tidak bertaubat darinya. “yang mempunyai karunia”, maksudnya, pemilik karunia dan kebaikan yang menyeluruh. Setelah Allah menetapkan sebagian dari kemahasempurnaan-Nya, dan hal itu memastikan bahwa hanya Dia saja yang berhak disembah, yang amal ibadah hanya dimurnikan untuk-Nya, maka karena itu Dia kemudian berfirman, “Tiada tuhan yang berhak disembah melainkan Dia. Hanya kepada-Nya lah (semua makhluk) kembali.” Sisi korelasi penyebutan turunnya al-Quran dari sisi Allah yang mempunyai sifat-sifat tersebut tadi adalah bahwa sifat-sifat tersebut memastikan seluruh makna yang terkandung di dalam al-Quran. Karena itu, sesungguhnya al-Quran boleh jadi adalah informasi tentang nama-nama, sifat-sifat dan perbuatan-perbuatan Allah, dan ini adalah nama-nama, sifat-sifat dan perbuatan-perbuatan dan boleh jadi informasi tentang hal yang gaib yang telah lalu dan yang akan datang, dan ini adalah pemberitahuaan dari yang Maha Mengetahui kepada hamba-hamba-Nya. Boleh jadi pula informasi tentang karunia-karunia-Nya yang sangat besar dan nikmat-nikmatNya yang luar biasa dan segala perintah yang mengantarkan kepada nikmat tersebut. Yang demikian ini ditunjukan oleh firmanNya “Yang mempunyai karunia”. Boleh jadi juga informasi tentang hukumannya yang sangat keras dan hal apa saja yang menyebabkan dan memastikan dari berbagai perbuatan maksiat. Hal ini ditunjukan oleh firmanNya “yang amat keras hukumanNya”. Boleh jadi juga seruan kepada orang-orang yang berdosa untuk bertaubat, berinabah dan memohon ampunan (kepada Allah). Ini diisyaratkan oleh firmanNya, “Yang mengampuni dosa dan menerima taubat lagi keras hukumanNya”. Boleh jadi juga ini informasi bahwa hanya Dia yang berhak diibadahi dan disembah, kemudian berbagai dalil aqli dan naqli dikemukakan untuknya, himbauan untuk beribadah kepadaNya dan larangan beribadah kepada selain Dia, serta penegakan argument-argumen naqli dan aqli terhadap ketidak benaran penyembahan kepada selain Allah itu serta ancaman nya. itulah sebabnya Dia berfirman, “Tiada tuhan yang berhak disembah melainkan Dia”. Serta boleh jadi juga informasi tentang balsanNya yang sangat adil dan pahala bagi orang-orang yang berbuat baik serta siksaan bagi orang-orang yang durhaka. Hal ini diisyaratkan oleh firmanNya, “Hanya kepadaNya-lah (semua makhluk) kembali.” Itulah yang dicakup di dalam al-Quran berupa al-Matholib al-‘Aliyah (nilai-nilai yang luhur)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 2: (Diturunkan Kitab ini) yakni Alquran, menjadi Mubtada (dari Allah) Khabar Mubtada (Yang Maha Perkasa) di dalam kerajaan-Nya (lagi Maha Mengetahui) tentang makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang kitab-Nya yang agung, bahwa ia turun dari Allah Tuhan yang berhak disembah karena kesempurnaan-Nya dan karena Dia yang sendiri dengan perbuatan-Nya. Dengan keperkasaan-Nya Dia tundukkan semua makhluk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 2",
    "description": "Di ayat-ayat terakhir surah az-zumar, Al-Qur'an menggambarkan bagaimana perlakuan yang ditetapkan oleh Allah terhadap orang-orang kafir dan orang-orang mukmin. Salah satu penyebab dari terjadinya dua bentuk perlakukan tersebut adalah sikap mereka terhadap Al-Qur'an. Oleh sebab itu, ayat-ayat berikut di awal surah ini menegaskan kembali kebenaran Al-Qur'an itu. Kitab ini yakni Al-Qur'an yang diturunkan kepadamu, wahai nabi Muhammad, benar-benar dari Allah yang mahaperkasa lagi maha mengetahui. 3. Dia Allah yang maha pengampun, mengampuni dosa dan menerima tobat bagi orang yang mau memohon ampunan dan bertobat, dan pada waktu yang bersamaan juga sangat keras hukuman-Nya; serta dia juga yang memiliki karunia. Tidak ada tuhan yang berhak untuk disembah selain dia. Hanya kepada-Nya saja-lah semua makhluk kembali."
  }
]