[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menetapkan menetapkan sebuah keputusan diantara manusia dengan adil sesuai dengan apa yang berhak mereka dapatkan, sedangkan tuhan-tuhan selain Allah yang disembah oleh manusia itu tidak memutuskan apa pun karena mereka memang tidak mampu untuk melakukan hal itu. Sesungguhnya Allah Maha Mendengar perkataan-perkataaan makhlukNya, Maha Melihat perbuatan-perbuatan dan amal-amal mereka, lalu Dia membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Allah menetapkan keputusan dengan adil, tidak menganiaya seorang pun dengan mengurangi kebaikannya atau menambah keburukannya. Sembahan-sembahan yang kaum musyrikin sembah tidak dapat memutuskan apa pun, karena mereka memang tidak memiliki apa pun. Sesungguhnya Allah Maha Mendengar perkataan hamba-hamba-Nya, Maha Melihat niat dan amal perbuatan mereka, dan akan membalaskannya atas mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَاللهُ يَقْضِى بِالْحَقِّ ۖ (Dan Allah menghukum dengan keadilan) Maka dari itu Dia membalas setiap orang dengan kebaikan atau keburukan yang layak bagi mereka. وَالَّذِينَ يَدْعُونَ مِن دُونِهِۦ(Dan sembahan-sembahan yang mereka sembah selain Allah) Yakni berhala-berhala dan sembahan-sembahan yang menjadi tempat memanjatkan do’a orang-orang musyrik kepada selain Allah. لَا يَقْضُونَ بِشَىْءٍ ۗ( tiada dapat menghukum dengan sesuatu apapun) Sebab mereka tidak mengetahui sesuatu apapun dan tidak mampu melakukan apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Allah memberi keputusan dengan penuh keadilan, sebab Dia adalah Raja Yang Mutlak dan Pengetahuan-Nya Maha Luas atas segala sesuatu. Adapun orang-orang yang menyembah selain Allah yaitu berhala yang tidak bisa berbuat apa-apa sebab berhala adalah benda mati yang tidak bisa mengetahui apapun. Allah Maha Mendengar segala perkataan mereka dan Maha Melihat atas segala perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah memutuskan dengan benar} memutuskan sesuatu dengan adil {dan mereka yang disembah selain Dia} yang kalian sembah selain Allah {tidak mampu memutuskan dengan suatu apa pun} tidak memutuskan sesuatu apa pun {Sesungguhnya Allah, Dialah Yang Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “dan Allah menghukum dengan haq,” sebab FirmanNya adalah haq dan hukum syariatNya juga haq serta hukum balasanNyapun haq. Dia-lah yang meliputi segala sesuatu dengan ilmuNya, catatan maupun pemeliharaan. Dialah yang suci drai perbuatan dzalim, kekurangan, dan dari seluruh cacat. Dialah yang memutuskan takdirNya yang apabila Dia menghendaki sesuatu, pasti terjadi, dan bila Dia tidak kehendaki, tidak terjadi. Dan Dialah yang memberi keputusan dari segenap hamba-hambaNYa yang beriman dan yang kafir di dunia dan memisah diantara mereka dengan suatu kemenangan yang dengannya Dia membela para wali dan hamba-hamba yang dia cintaiNya. “dan sembahan-sembahan yang mereka sembah selain Allah,” ini mencakup segala sesuatu yang disembah selain Allah,” tiada dapat menghukum dengan suatu apapun,” karena mereka lemah dan tidak mempunyai keinginan kepada kebaikan dan tidak memiliki kemampuan untuk melakukannya. “sesungguhnya Allah, Dialah yang Maha mendengar,” segenap suara dengan berbagai macam perbedaan bahasa dan beragam kebutuhan, “lagi Maha melihat,” terhadap apa yang terjadi dan yang akan terjadi, dan apa yang bisa dilihat dan tidak bisa dilihat, apa yang diketahui manusia dan apa yang tidak mereka ketahui. Pada awal dua ayat di atas Dia berfirman, ”berilah mereka peringatan dengan hari yang dekat,” kemudian Dia menyifatinya (mendeskrepsikannya) dengan beberapa sifat yang bisa mengantarkan kepada persiapan untuk menghadapi hari nan dahsyat itu, karena sifat-sifat tersebut mengandung dorongan (dari satu sisi) dan ancaman (dari sisi yang lainnya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 20: (Dan Allah menghukum dengan keadilan. Dan sesembahan-sesembahan yang mereka seru) yang mereka sembah (selain Allah) yakni berhala-berhala (tiada dapat menghukum dengan sesuatu apa pun) mana mungkin mereka menjadi sekutu-sekutu Allah? (Sesungguhnya Allah Dialah Yang Maha Mendengar) semua perkataan mereka (lagi Maha Melihat) semua perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu karena firman-Nya hak (benar), hukum syar’i-Nya hak, dan hukum jaza’i(pembalasan)-Nya hak. Dia meliputi segala sesuatu baik dalam hal ilmu-Nya, pencatatan-Nya, maupun pemeliharaan-Nya. Dia bersih dari kezaliman, kekurangan dan semua aib. Dia yang memutuskan dengan keputusan qadari-Nya, dimana apabila Dia menghendaki sesuatu maka akan terjadi dan jika Dia tidak menghendaki, maka tidak akan terjadi. Dia yang memberikan keputusan antara kaum mukmin dan orang-orang kafir di dunia dengan memberikan pertolongan kepada kaum mukmin dan mengalahkan orang-orang kafir. Apa pun bentuknya. Jika mereka tidak mampu memutuskan sesuatu apa pun karena kelemahan mereka, maka mengapa mereka dijadikan sekutu bagi Allah. Semua suara dengan beraneka bahasa dan beragam kebutuhan. Perbuatan manusia dan apa yang dikehendaki oleh hatinya. Allah Subhaanahu wa Ta'aala mengawali dua ayat di atas dengan firman-Nya, “Wa andzirhum…dst.” Selanjutnya menyebutkan keadaan pada hari Kiamat agar manusia bersiap-siap untuk menghadapi hari yang besar itu sekaligus sebagai targhib dan tarhib (dorongan dan ancaman)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 20",
    "description": "Dan karena Allah itu maha mengetahui lagi maha bijaksana, dia mahasanggup memutuskan perkara dengan kebenaran. Sedang mereka dan apa yang disembah oleh mereka selain-Nya, tidak akan mampu memutuskan dengan sesuatu apa pun. Sesungguhnya Allah, hanya dialah tuhan yang maha mendengar lagi maha melihat. 21. Untuk memperoleh bukti-bukti yang lebih akurat betapa Allah maha mengetahui, maka ayat-ayat berikut menganjurkan untuk mengembara di muka bumi menemukan bukti-bukti tersebut. Dan apakah me-reka orang-orang musyrik mekah itu, tidak mengadakan pengembaraan atau perjalanan di bumi, lalu memperhatikan dengan saksama bagaimana kesudahan buruk yang dialami oleh orang-orang yang durhaka sebelum mereka' orang-orang sebelum mereka itu malah lebih hebat kekuatannya daripada mereka, dan lebih banyak peninggalan-peninggalan peradaban-Nya di muka bumi, tetapi Allah tetap mengazab mereka karena dosa-dosa-Nya. Dan kalau Allah sudah menjatuhkan azab, tidak akan ada sesuatu pun yang melindungi mereka dari azab Allah itu."
  }
]