[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang mendustakan risalahmu itu (wahai rasul) tidak berjalan di bumi untuk melihat bagaimana akhir hidup orang-orang terdahulu? Umat-umat itu lebih dahsyat kekuatannya daripada mereka dan lebih meninggalkan bekas di muka bumi, namun kekuatan mereka yang dahsyat dan kebesaran jasad mereka itu tidak berguna bagi mereka, Allah menetapkan hukumanNya atas mereka disebabkan kekafiran mereka dan dosa-dosa yang mereka kerjakan. Mereka tidak memiliki pelindung yang bisa melindungi mereka dari azab Allah dan mencegah azab itu dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Apakah orang-orang musyrikin itu tidak berjalan di muka bumi, lalu mereka memperhatikan bagaimana akhir kehidupan umat-umat yang mendustakan sebelum mereka, akhir kehidupan mereka sangat buruk, padahal umat-umat tersebut lebih kuat daripada mereka, lebih menguasai bumi dengan pembangunan yang tidak dilakukan oleh mereka, maka Allah membinasakan umat-umat tersebut karena dosa-dosa mereka. Tidak ada pembela bagi mereka yang bisa menyelamatkan mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Tidakkah orang-orang musyrik itu mengambil pelajaran dari perjalanan yang mereka lakukan setelah melihat sisa-sisa dari tempat tinggal orang-orang yang mendustakan? Mereka melihat kehancuran dan siksaan yang Allah turunkan kepada umat-umat tersebut, padahal mereka dahulu memiliki kekuatan yang besar dan mempunyai benteng-benteng dan istana yang paling kuat di dunia. Namun Allah menghancurkan mereka akibat dosa-dosa yang mereka kerjakan; dan mereka tidak dapat melindungi diri dari azab dari Allah itu. Itulah azab yang besar akibat pendustaan mereka terhadap para rasul yang datang kepada mereka dengan membawa bukti-bukti yang jelas. Allah Maha Kuat, tidak ada yang dapat mengalahkan-Nya; dan sangat berat siksaan-Nya bagi orang yang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أَوَلَمْ يَسِيرُوا۟ فِى الْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عٰقِبَةُ الَّذِينَ كَانُوا۟ مِن قَبْلِهِمْ ۚ (Dan apakah mereka tidak mengadakan perjalanan di muka bumi, lalu memperhatikan betapa kesudahan orang-orang yang sebelum mereka) Allah mengarahkan mereka agar mengambil pelajaran dari orang-orang kafir lain sebelum mereka. كَانُوا۟ هُمْ أَشَدَّ مِنْهُمْ قُوَّةً(Mereka itu adalah lebih hebat kekuatannya daripada mereka) Yakni mereka lebih kuat daripada orang-orang kafir sekarang. وَءَاثَارًا فِى الْأَرْضِ(dan (lebih banyak) bekas-bekas mereka di muka bumi) Dengan benteng-benteng dan istana-istana yang telah mereka bangun. فَأَخَذَهُمُ اللهُ بِذُنُوبِهِمْ(maka Allah mengazab mereka disebabkan dosa-dosa mereka) Yakni akibat dosa-dosa mereka. وَمَا كَانَ لَهُم مِّنَ اللهِ مِن وَاقٍ(Dan mereka tidak mempunyai seorang pelindung dari azab Allah) Yakni tidak memiliki pembela yang dapat membela mereka dari azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Apakah mereka orang-orang musyrik tidak berjalan menuju tempat-tampat lain di bumi yang luas ini, sehingga dapa melihat bagaimana nasib para pendahulu mereka yang mendustakan rasul mereka. Padahal para pendahulu mereka itu lebih pandai dan berperadaban tinggi daripada mereka. Peninggalan para pendahulu mereka bahkan lebih besar seperti kastil, benteng dan istana, itu semua pun tidak berguna apa-apa bagi mereka. Sehingga Allah menghukum sebab dosa-dosa dan kekufuran mereka. Mereka tidak punya penolong dan penyelamat yang dapat membebaskan mereka dari azab Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak berjalan di bumi, lalu memperhatikan bagaimana kesudahan} kesudahan {orang-orang yang sebelum mereka. Orang-orang itu lebih hebat kekuatannya daripada mereka dan peninggalan mereka di bumi} dan mereka meninggalkan jejak di bumi dengan keterangan dan tanda-tanda yang tidak mampu mereka buat {Lalu Allah mengazab mereka karena dosa-dosa mereka. Tidak ada suatu apa pun yang melindungi mereka dari (azab) Allah} pelindung yang melindungi mereka dari azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. Allah berfirman, “dan apakah mereka tidak melakukan perjalanan di muka bumi,” yakni, dengan jiwa dan raga mereka dengan perjalanan untuk merenungkan, mengambil pelajaran dan memikirkan bekas-bekasnya. Lalu mereka melihat bagaimana akhir kesudahan orang-orang sebelum mereka di antara orang-orang yang mendustakan. Tentu mereka akan menjumpainya sebagai seburuk-buruk kesudahan, kesudahan berupa kebinasaan, kehancuran, kenbistaan, dan kehinaan padahal mereka sebelumnya adalah jauh lebih kuat daripada mereka (yang sekarang) dari sisi jumlah, persiapan, dan kebesaran postur tubuh, “dan” lebih kuat “bekas-bekas mereka di muka bumi,” yang terdiri dari berbagai bangunan dan tanaman. Kekuatan bekas (peninggalan) membuktikan kekuatan para pelakunya dan menunjukkan bahwa mereka menikmatinya. “maka Allah mengazab mereka” dengan siksaanNya. ”disebabkan dosa-dosa mereka,” ketika mereka tetap dan terus melakukannya. “sesungguhnya Dia Maha kuat dan maha keras hukumanNya,” maka kekuatan mereka sama sekali tidak ada gunanya sedikit pun di sisi Allah. Bahakan diantara umat yang paling besar kekuatannya adalah kaum ‘ad yang telah berkata,” siapa diantara kita yang lebih kuat?” maka Allah meniupkan angina kepada mereka yang melumpuhkan kekuatan mereka. Angin itu membinasakan mereka dengan total."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 21: (Dan apakah mereka tidak mengadakan perjalanan di muka bumi, lalu memperhatikan betapa kesudahan orang-orang yang sebelum mereka. Mereka itu adalah lebih hebat daripada mereka) menurut suatu qiraat lafal Minhum dibaca Minkum, artinya lebih hebat daripada kalian (kekuatannya dan lebih banyak bekas-bekas mereka di muka bumi) seperti bangunanbangunan dan gedung-gedungnya (maka Allah mengazab mereka) membinasakan mereka (disebabkan dosa-dosa mereka. Dan sekali-kali mereka tidak mempunyai seorang pelindung dari azab Allah) dari siksaan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan hati dan badan mereka, yaitu perjalanan dengan maksud melihat dan mengambil pelajaran serta memikirkan keadaan yang masih ada. Yaitu dari kalangan orang-orang yang mendustakan. Mereka tentu akan menyaksikan bahwa akibat mereka adalah kebinasaan, kehancuran, dan kehinaan. Padahal mereka lebih hebat dari orang-orang kafir itu dalam hal jumlah, perlengkapan dan kekuatan fisik. Seperti bangunan, perlengkapan, benteng-benteng dan istana-istana. Ketika mereka terus menerus bergelimang di atas dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 21",
    "description": "Untuk memperoleh bukti-bukti yang lebih akurat betapa Allah maha mengetahui, maka ayat-ayat berikut menganjurkan untuk mengembara di muka bumi menemukan bukti-bukti tersebut. Dan apakah me-reka orang-orang musyrik mekah itu, tidak mengadakan pengembaraan atau perjalanan di bumi, lalu memperhatikan dengan saksama bagaimana kesudahan buruk yang dialami oleh orang-orang yang durhaka sebelum mereka' orang-orang sebelum mereka itu malah lebih hebat kekuatannya daripada mereka, dan lebih banyak peninggalan-peninggalan peradaban-Nya di muka bumi, tetapi Allah tetap mengazab mereka karena dosa-dosa-Nya. Dan kalau Allah sudah menjatuhkan azab, tidak akan ada sesuatu pun yang melindungi mereka dari azab Allah itu. 22. Yang demikian itu, yakni azab yang mereka terima adalah karena se-sungguhnya rasul-rasul telah datang kepada mereka dengan membawa bukti-bukti yang nyata, berupa mukjizat dan hukum-hukum dari Allah, lalu mereka ingkar kepada para rasul itu; maka Allah mengazab mereka. Sungguh, dia mahakuat, lagi mahakeras hukuman-Nya."
  }
]