[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Azab yang menimpa orang-orang yang mendustakan yang telah berlalu itu disebabkan oleh sikap mereka terhadap rasul-rasul mereka yang hadir membawa bukti-bukti yang kuat atas kebenaran dakwah mereka, namun mereka malah kafir kepada utusan tersebut dan mendustakan mereka, maka Allah mengambil mereka semuanya dengan azabNya. Sesungguhnya Allah Mahakuat, tidak seorang pun mengalahkanNya, juga Mahakeras hukumanNya bagi siapa yang kafir dan bermaksiat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Azab yang menimpa mereka itu terjadi karena ketika rasul-rasul yang Allah utus kepada mereka datang membawa dalil-dalil yang jelas dan mukjizat-mukjizat yang mengagumkan, mereka tetap kafir kepada Allah dan mendustakan rasul-rasul-Nya. Sekalipun mereka memiliki kekuatan, tetapi Allah tetap membinasakan mereka. Sesungguhnya Allah Mahakuat lagi Mahakeras hukuman-Nya terhadap orang yang kafir kepada-Nya dan mendustakan utusan-utusan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. ذٰلِكَ بِأَنَّهُمْ كَانَت تَّأْتِيهِمْ رُسُلُهُم بِالْبَيِّنٰتِ (Yang demiklan itu adalah karena telah datang kepada mereka rasul-rasul mereka dengan membawa bukti-bukti yang nyata) Yakni hujjah-hujjah yang jelas. فَكَفَرُوا۟( lalu mereka kafir) Terhadap apa yang dibawa oleh para rasul kepada mereka. فَأَخَذَهُمُ اللهُ ۚ إِنَّهُۥ قَوِىٌّ(maka Allah mengazab mereka. Sesungguhnya Dia Maha Kuat) Yakni Dia mampu melakukan segala yang Dia kehendaki kerena tidak ada yang dapat menghalangi-Nya. شَدِيدُ الْعِقَابِ(lagi Maha Keras hukuman-Nya) Bagi orang yang bermaksiat dan tidak bertaubat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Azab itu adalah sebab dari pengingkaran dan kekufuran mereka terhadap ajaran rasul. Padahal para rasul sudah menyampaikan hujjah yang sangat jelas disertai dengan berbagai mukjizat yang menakjubkan. Sehingga kemudian mereka dibinasakan Allah sebab dosa-dosa mereka. Sungguh Allah Maha Kuasa atas segala sesuatu, tidak ada yang dapat mengalahkan-Nya, dan hukuman-Nya sangat keras bagi yang durhaka pada-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Yang demikian itu adalah karena sesungguhnya telah datang kepada mereka para rasul dengan bukti-bukti yang nyata} dalil-dalil nyata {lalu mereka ingkar. Maka Allah mengazab mereka. Sesungguhnya Dia Maha kuat lagi Maha keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. Allah berfirman, “dan apakah mereka tidak melakukan perjalanan di muka bumi,” yakni, dengan jiwa dan raga mereka dengan perjalanan untuk merenungkan, mengambil pelajaran dan memikirkan bekas-bekasnya. Lalu mereka melihat bagaimana akhir kesudahan orang-orang sebelum mereka di antara orang-orang yang mendustakan. Tentu mereka akan menjumpainya sebagai seburuk-buruk kesudahan, kesudahan berupa kebinasaan, kehancuran, kenbistaan, dan kehinaan padahal mereka sebelumnya adalah jauh lebih kuat daripada mereka (yang sekarang) dari sisi jumlah, persiapan, dan kebesaran postur tubuh, “dan” lebih kuat “bekas-bekas mereka di muka bumi,” yang terdiri dari berbagai bangunan dan tanaman. Kekuatan bekas (peninggalan) membuktikan kekuatan para pelakunya dan menunjukkan bahwa mereka menikmatinya. “maka Allah mengazab mereka” dengan siksaanNya. ”disebabkan dosa-dosa mereka,” ketika mereka tetap dan terus melakukannya. “sesungguhnya Dia Maha kuat dan maha keras hukumanNya,” maka kekuatan mereka sama sekali tidak ada gunanya sedikit pun di sisi Allah. Bahakan diantara umat yang paling besar kekuatannya adalah kaum ‘ad yang telah berkata,” siapa diantara kita yang lebih kuat?” maka Allah meniupkan angina kepada mereka yang melumpuhkan kekuatan mereka. Angin itu membinasakan mereka dengan total."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 22: (Yang demikian itu adalah karena telah datang kepada mereka rasul-rasul mereka dengan membawa bukti-bukti) yakni mukjizat-mukjizat yang tampak (lalu mereka kafir; maka Allah mengazab mereka. Sesungguhnya Dia Maha Kuat lagi Maha Keras hukuman-Nya.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mukjizat, hukum-hukum, dan ajaran-ajaran yang dibawanya. Ternyata kekuatan mereka tidak ada apa-apanya di hadapan kekuatan Allah, seperti halnya kaum ‘Aad yang sampai berkata, “Siapakah yang lebih hebat kekuatannya daripada kami?” Lalu Allah mengirimkan angin yang melemahkan kekuatan mereka dan menghancurkan mereka sehancur-hancurnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 22",
    "description": "Yang demikian itu, yakni azab yang mereka terima adalah karena se-sungguhnya rasul-rasul telah datang kepada mereka dengan membawa bukti-bukti yang nyata, berupa mukjizat dan hukum-hukum dari Allah, lalu mereka ingkar kepada para rasul itu; maka Allah mengazab mereka. Sungguh, dia mahakuat, lagi mahakeras hukuman-Nya. 23. Salah satu bukti dari kebesaran Allah adalah diutusnya nabi musa. Dan sungguh, kami telah mengutus nabi musa dengan membawa ayat-ayat kami, berupa mukjizat, dan keterangan, serta bukti yang nyata."
  }
]