[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah mengutus Musa dengan membawa ayat-ayat Kami yang agung yang membuktikan kebenaran tugas yang diembannya, dan hujjah yang nyata lagi jelas atas kebenaran dakwahnya serta kebatilan perbuatan kaum di mana Musa diutus kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Sungguh Kami telah mengutus Musa dengan tanda-tanda (mukjizat) yang jelas dan bukti yang kuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-25. Sungguh Kami telah mengutus Musa dengan sembilan mukjizat dan bukti yang jelas yang membuktikan kebenarannya kepada para pemimpin orang-orang kafir; yaitu Fir’aun, Haman, dan Qarun. Namun mereka malah menghinanya dan mengatakan bahwa dia adalah penyihir yang hebat dan pendusta dalam mukjizat-mukjizatnya. Ketika Musa mendatangi mereka dengan mukjizat-mukjizat dari Kami itu, mereka mendustakannya dan memerintahkan untuk membunuh semua anak laki-laki dari orang-orang yang beriman kepada Musa, dan membiarkan anak-anak perempuan mereka tetap hidup untuk dijadikan sebagai pelayan dan untuk mereka hinakan. Akan tetapi makar orang-orang kafir hanya menghasilkan kegagalan dan kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايٰتِنَا (Dan sesungguhnya telah Kami utus Musa dengan membawa ayat-ayat Kami) Yang dimaksud adalah sembilan mukjizat Musa yang telah disebutkan pada surat yang lain. وَسُلْطٰنٍ مُّبِينٍ (dan keterangan yang nyata) Yakni hujjah yang jelas dan terang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Kami telah mengutus Musa untuk membawa ayat-ayat sembilan Kami. Sembilan itu adalah mukjizat yang terkenal: yaitu banjir bandang, belalang, kutu, katak, darah, kekeringan panjang, kekurangan buah-buahan, menghanguskan harta, dan berbagai perangai hati. Kami mengutus itu semua dengan hujjah yang sangat jelas. Kami jadikan beberapa dari mereka menjadi tangan dan tongkat sebagai pengganti dari dua ayat Kami yang terakhir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah mengutus Musa dengan ayat-ayat Kami dan keterangan yang nyata} dalil nyata yang jelas atas kebenarannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “dan sungguh telah kami utus” kepada orang-orang yang mendustakan itu secara umum, “musa” bin Imran, “dengan membawa ayat-ayat kami” yang sangat agung yang membuktikan dengan pasti hakikat ajaran yang karenanya ia di utus, dan kebatilan apa yang dianut oleh orang-orang yang kepada mereka Musa diutus, yaitu syirik dan segala perangkatnya. “dan keterangan yang nyata,” maksudnya, hujjah (mukjizat, bukti, keterangan) yang sangat jelas dapat menguasai hati hingga membuatnya tunduk, seperti ular besar dan tongkat beberapa mukjizat-mukjizat lainnya yang dengannya Allah memperkuat nabi Musa dan meneguhkan pada kebenanran yang diserukannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 23: (Dan sesungguhnya telah Kami utus Musa dengan membawa ayat-ayat Kami dan keterangan yang nyata) bukti yang jelas dan tampak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ayat-ayat Kami yang besar yang menunjukkan kebenaran apa yang Beliau bawa dan batilnya apa yang dipegang oleh kaumnya yang menentang, yaitu syirk dan perbuatan maksiat lainnya. Yakni hujjah yang nyata yang menguasai hati sehingga menjadikannya tunduk, seperti tongkatnya yang berubah menjadi ular, tangan yang bercahaya, dsb. dimana dengannya Allah Subhaanahu wa Ta'aala menguatkan Musa dan menguatkan kebenaran yang diserukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 23",
    "description": "Salah satu bukti dari kebesaran Allah adalah diutusnya nabi musa. Dan sungguh, kami telah mengutus nabi musa dengan membawa ayat-ayat kami, berupa mukjizat, dan keterangan, serta bukti yang nyata. 24. Ayat-ayat dan bukti-bukti nyata itu ditujukan kepada fir'aun, haman, qarun, dan bala tentara fir'aun. Setelah nabi musa menyampaikan ayat dan bukti-bukti tersebut, lalu mereka semua berkata dengan nada melecehkan, 'musa itu adalah seorang pesihir lagi seorang pendusta yang nyata. '."
  }
]