[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "kepada Fir’aun, Raja Mesir, Haman, menterinya; dan Qarun, hartawan pemilik kekayaan melimpah-ruah, lalu mereka mengingkari risalahnya dan menyombongkan diri. Mereka berkata tentangnya, “sesungguhnya dia adalah tukang sihir pembohong, bagaimana dia mengaku bahwa dirinya diutus kepada manusia sebagai Rasul?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Kepada Fir'aun, perdana menterinya Hāmān dan Qārūn. Mereka berkata, “Musa adalah penyihir dan pembual yang mengaku sebagai rasul.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. إِلَىٰ فِرْعَوْنَ وَهٰمٰنَ وَقٰرُونَ فَقَالُوا۟ سٰحِرٌ كَذَّابٌ (kepada Fir’aun, Haman dan Qarun; maka mereka berkata: “(Ia) adalah seorang ahli sihir yang pendusta”) Yakni ia adalah tukang sihir dan pendusta dalam apa yang ia datangkan. Allah menyebutkan Fir’aun, Haman, dan Qarun karena mereka adalah para pemimpin orang-orang yang mendustakan Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Kami mengutusnya kepada Fir’aun, penguasa Mesir juga kepada Haman pembesar para menteri Fir’aun. Juga kepada Qarun, orang kaya dari kaum Nabi Musa. Mereka semua berkata tentang Musa : “Sesungguhnya Musa hanyalah penyihir dan pendusta atas risalahnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kepada Fir‘aun, Haman, dan Qarun. Lalu mereka berkata,“Dia itu seorang penyihir lagi pendusta”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “yang menjadi sasaran adalah, “fir’aun dan haman,” yang merupakan menterinya, ”dan qarun,” yang termasuk kaum nabi Musa yang membangkang terhadapnya karena harta kekayaannya. Semuanya menolak nabi Musa dengan penolakan yang sengit terhadap (seruan) nabi musa bahkan mereka mengatakan, “ia adalah seorang ahli sihir yang pendusta.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 24: (Kepada Firaun, Haman dan Qarun; maka mereka berkata,) \"Dia (adalah seorang ahli sihir yang pendusta.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Haman adalah menteri Fir’aun. Qarun termasuk kaum Nabi Musa ‘alaihis salam, lalu ia bersikap sombong terhadap kaumnya dengan hartanya. Fir’aun, Haman dan Qarun sama-sama menentang Nabi Musa ‘alaihis salam dengan keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 24",
    "description": "Ayat-ayat dan bukti-bukti nyata itu ditujukan kepada fir'aun, haman, qarun, dan bala tentara fir'aun. Setelah nabi musa menyampaikan ayat dan bukti-bukti tersebut, lalu mereka semua berkata dengan nada melecehkan, 'musa itu adalah seorang pesihir lagi seorang pendusta yang nyata. '25. Maka ketika dia, nabi musa, datang kepada mereka, yakni kepada fir'aun, haman, dan qarun, membawa kebenaran dari kami, mereka berkata, 'bunuhlah anak-anak laki-laki dari orang-orang yang beriman bersama dia dan juga musa, dan biarkan hidup perempuan-perempuan mereka untuk dijadikan budak. ' begitulah para pendurhaka mengatur tipu daya, namun tipu daya orang-orang kafir itu pasti akan sia-sia belaka."
  }
]