[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika Musa datang kepada Fir’aun, Haman, dan Qarun dengan membawa mukjizat-mukjizat yang jelas dari sisi Kami, mereka tidak cukup hanya dengan menentang dan mengingkarinya, mereka malah berkata, “Bunuhlah anak-anak lelaki orang-orang yang beriman bersamanya dan biarkanlah anak-anak perempuan mereka tetap hidup untuk menjadi pelayan dan budak kami.” Rencana jahat orang-orang kafir hanyalah akan sia-sia dan binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Maka ketika Musa datang dengan bukti yang menunjukkan kebenarannya, Fir'aun berkata, “Bunuhlah anak-anak lelaki dari orang-orang yang beriman dan biarkanlah anak-anak perempuan mereka sebagai penghinaan bagi mereka.” Maka upaya orang-orang kafir menyedikitkan jumlah orang-orang Mukmin hanyalah usaha sia-sia, punah, tidak berpengaruh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. فَلَمَّا جَآءَهُم بِالْحَقِّ مِنْ عِندِنَا (Maka tatkala Musa datang kepada mereka membawa kebenaran dari sisi Kami) Yakni membawa mukjizat-mukjizat yang jelas. قَالُوا۟ اقْتُلُوٓا۟ أَبْنَآءَ الَّذِينَ ءَامَنُوا۟ مَعَهُۥ وَاسْتَحْيُوا۟ نِسَآءَهُمْ ۚ( mereka berkata: “Bunuhlah anak-anak orang-orang yang beriman bersama dengan dia dan biarkanlah hidup wanita-wanita mereka”) Setelah Allah mengutus Musa, maka Fir’aun kembali memerintahkan pembunuhan terhadap Bani Israil, dia menyuruh membunuh kaum lelaki, dan membiarkan kaum perempuan karena dia menghendaki kaum perempuan itu; dan dua hal ini adalah musibah yang nyata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Ketika Musa menyampaikan kebenaran dari Kami kepada mereka berupa mukjizat yang tampak, Fir’aun dan kaumnya berkata: “Lanjutkan pembunuhan putera-putera orang mukmin, dan biarkanlah anak perempuan mereka hidup sebagaimana disebutkan dalam surat Al-qashash ayat 4. Yang berarti ketika Allah mengutus nabi Musa, Fir’aun tetap membunuh bayi laki-laki dari Bani Israil. Dan yang dilakukan oleh Fir’aun itu adalah kesia-siaan belaka, tidak akan berdampak apa-apa kepada utusan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia datang kepada mereka membawa kebenaran dari sisi Kami. Mereka berkata,“Bunuhlah anak laki-laki orang-orang yang beriman bersama dia dan biarkan hidup perempuan-perempuan mereka”} dan sisakanlah perempuan-perempuan mereka sebagai pelayan {Tidaklah tipu daya} tipu daya {orang-orang kafir itu kecuali sia-sia} binasa dan lenyap"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “maka tatkala Musa datang kepada mereka membawa kebenaran dari sisi kami,” dan ia pun diperkuat oleh Allah dengan beberapa mukjizat yang sangat hebat yang memaksa mereka harus benar-benar tunduk, namun mereka tidak menerimanya, bahkan mereka tidak cukup hanya dengan sikap mengabikan dan berpaling, dan bahkan tidak sekedar mengingkari dan menentangnya dengan kebatilan mereka, justru sampai pada tindakan yang sangta keji sekali, dimana “mereka berkata,’bunuhlah anak-anak orang yang beriman bersamanya dan biarkanlah hidup wanita-wanita mereka,’ dan tipu daya orang-orang kafir itu tidak lain,” dimana mereka telah merencanakan tipu daya ini dan mereka beranggapan bahwa apabila mereka membunuh anak-anak lelaki para pengikut Musa itu, maka mereka tidaka akan pernah menjadi kuat dan mereka akan tetap dalam perbudakan dan dibawah kendali mereka. Maka tipu daya mereka tidak lain ”hanyalah sia-sia” karena apa yang mereka inginkan tidak terjadi. Malah mereka ditimpa oleh kebalikan apa yang mereka renacanakan itu, di mana Allah membinasakan dan memusnahkan mereka secara total. Disini ada suatu kaidah penting; renungkanlah satu poin yang banyak disebutkan di dalam kitabullah ini, yaitu apabila konteksnya tentang satu kisah tertentu atau atas suatu permasalahan tertentu, sedangkan yang Allah inginkan adalah memberikan keputusan terhadapnya dengan suatu hukum (keputusan) yang tidak hanya khusus dengannya, maka Allah menyebutkan hukuman tersebut dan menetapkannya dengan ungkapan yang bersifat umum agar bermakna lebih luas, termasuk di dalamnya bentuk (putusan) yang karenanya kalimat tersebut dipaparkan, dan supaya asumsi bahwa hukum tersebut khusus untuk sesuatu yang khusus tersebut menjadi tidak ada. Maka dari itu dia tidak mengatakan (dan tipu daya mereka tidak lain melainkan sia-sia belaka), melainkan Dia berfirman, ”dan tipu daya orang-orang kafir itu tidak lain melainkan sia-sia belaka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 25: (Maka tatkala Musa datang kepada mereka membawa kebenaran) yakni dengan membawa perkara yang hak (dari sisi Kami, mereka berkata, \"Bunuhlah anak-anak orang-orang yang beriman bersama dengan dia dan biarkanlah hidup) yakni biarkanlah tetap hidup (wanita-wanita mereka.\" Dan tipu daya orang-orang kafir itu tak lain hanyalah sia-sia belaka) yakni 300 menjerumuskan mereka sendiri dalam kebinasaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah menguatkan Beliau dengan beberapa mukjizat yang besar yang mengharuskan mereka tunduk dan tidak menolaknya. Namun mereka malah menolaknya dan berpaling, mengingkarinya dan menentangnya dengan kebatilan mereka, bahkan lebih dari itu, mereka sampai melakukan tindakan yang sangat keji, yaitu membunuh anak-anak laki-laki kaum mukmin dan membiarkan hidup anak-anak wanitanya. Mereka mengira bahwa jika mereka membunuh anak-anak Bani Israil, maka Bani Israil akan menjadi lemah dan tetap dalam perbudakan kepada mereka. Yakni tujuan mereka untuk melemahkan Bani Israil gagal, bahkan mereka memperoleh kebalikan dari apa yang mereka harapkan; Allah membinasakan mereka dan menghabisi mereka sampai ke akar-akarnya. Sering sekali kalimat semakna dengan ini, “Wa maa kaidul kaafiriina illaa fi dhalaal” (artinya: Namun tipu daya orang-orang kafir sia-sia belaka) diulang dalam Al Qur’an, yakni apabila susunannya menceritakan tentang kisah tertentu atau masalah tertentu, dan Allah ingin menghukumi hal tertentu itu, maka Allah tidak menghukumi dengan khusus, bahkan Allah hukumi dengan sifat yang umum, agar hukum-Nya mengena kepada semuanya, oleh karenanya Allah Subhaanahu wa Ta'aala tidak berfirman, “Wa maa kaiduhum illaa fii dhalaal” (artinya: Namun tipu daya mereka itu sia-sia belaka), tetapi mengatakan, “Wa maa kaidul kaafiriina illaa fi dhalaal” (artinya: Namun tipu daya orang-orang kafir sia-sia belaka)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 25",
    "description": "Maka ketika dia, nabi musa, datang kepada mereka, yakni kepada fir'aun, haman, dan qarun, membawa kebenaran dari kami, mereka berkata, 'bunuhlah anak-anak laki-laki dari orang-orang yang beriman bersama dia dan juga musa, dan biarkan hidup perempuan-perempuan mereka untuk dijadikan budak. ' begitulah para pendurhaka mengatur tipu daya, namun tipu daya orang-orang kafir itu pasti akan sia-sia belaka. 26. Dan fir'aun berkata kepada pembesar-pembesarnya, 'biar aku sen-diri yang membunuh musa, dan sebelum itu suruh dia memohon kepada tuhannya untuk mendapatkan perlindungan. Apabila musa tidak dibunuh, sesungguhnya aku sangat khawatir dia akan menukar agamamu, wahai penduduk mesir, dengan agama yang dia bawa, atau dia pasti akan menimbulkan kerusakan di bumi sehingga bisa mengganggu kehidupan kita. '."
  }
]