[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada para pembesar kaumnya, “Biarkan aku membunuh Musa dan biarkan dia memanggil Tuhannya yang dia anggap Dia mengutusnya kepada kita agar Dia bisa melindunginya dari apa yang hendak dia lakukan terhadapnya. Sesungguhnya aku khawatir dia akan mengganti agama yang telah kalian pegang atau akan menghadirkan kerusakan di bumi Mesir ini.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Fir'aun berkata, “Biarkanlah aku membunuh Musa sebagai hukuman baginya. Silakan dia memanggil Rabbnya agar melindunginya dariku, aku tidak peduli bila dia memanggil Rabbnya, sesungguhnya aku khawatir dia akan merubah agama yang kalian pegang atau melakukan kerusakan di bumi dengan membunuh dan menghancurkan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Fir’aun berkata kepada pasukannya dengan penuh keangkuhan: “Biarkanlah aku membunuh Musa, dan hendaklah dia berdoa kepada Tuhannya agar Dia dapat menyelamatkannya dariku. Jika aku tidak membunuhnya maka aku takut dia akan mengubah keyakinan kalian atau membuat kerusakan di negeri Mesir dengan menyebarkan berbagai fitnah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَقَالَ فِرْعَوْنُ ذَرُونِىٓ أَقْتُلْ مُوسَىٰ (Dan berkata Fir’aun (kepada pembesar-pembesarnya): “Biarkanlah aku membunuh Musa) Yakni “biarkan aku membunuhnya.” وَلْيَدْعُ رَبَّهُۥٓ ۖ( dan hendaklah ia memohon kepada Tuhannya) Yang telah mengutusnya seperti yang dia katakan, sehingga Dia dapat menghalangi pembunuhan ini jika Dia mampu, sebab Dia bukan Tuhan yang sebenarnya, namun akulah Tuhan yang maha tinggi itu. إِنِّىٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمْ (karena sesungguhnya aku khawatir dia akan menukar agamamu) Yakni agama kalian sekarang yang menyembah selain Allah, dan memasukkan kalian ke dalam agamanya yang hanya menyembah Allah. أَوْ أَن يُظْهِرَ فِى الْأَرْضِ الْفَسَادَ (atau menimbulkan kerusakan di muka bumi) Yakni menimbulkan permusuhan dan perselisihan di antara manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Fir’aun berkata: “Biarkan aku yang akan membunuh Musa dengan tanganku sendiri. Suruh dia berdoa kepada Tuhannya agar selamat dariku” Ucapan Fir’aun itu mengandung tipu daya, kedengkian dan kesombongan. “Jika aku tidak membunuhnya, aku khawatir kalian akan berubah halauan dalam beribadah. Yaitu dalam menyembahku dan menyembah para berhala. Atau juga merusak tanah Mesir ini dengan warisan fitnah dan pertentangan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Fir‘aun berkata,“Biarkan aku} biarkan aku {yang membunuh Musa dan agar dia memohon kepada Tuhannya. Sesungguhnya aku khawatir bahwa dia akan menukar} menukar {agama kalian atau menimbulkan kerusakan di bumi} negeri Mesir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. ”Dan fir’aun berkata” dengan rasa sombong, congkak dan memperdaya kaumnya yang dungu “biarkanlah aku membunuh Musa dan hendaklah ia memohon kepada Rabbnya.” Yakni ia menyangja -semoga Allah menghinakannya- bahwa kalau saja tidak karena menjaga perasaan kaumnya tentu ia telah membunuhnya; dan mengklaim bahwa doa Nabi Musa kepada Tuhannya tidak akan bisa menghalanginya. Kemudian fir’aun menjelaskan hal yang menyeretnya untuk membunuh nabi Musa, yaitu sebagai kesetiaannya kepada kaum (rakyat)nya dan keinginan memberantas kejahatan di muka bumi ini, seraya berkata, ”karena sesungguhnya aku khawatir ia akan menukar agama kalian,” yang kalian anut ini, “atau menimbulkan kerusakan di muka bumi,” sungguh sangat mengherankan! Bagaimana manusia yang paling jahat menasihati masyarakat untuk tidak mengikuti manusia pilihan! Itu semua tindakan pengelabuan dan propaganda yang tidak akan ada yang mengikutinya kecuali akal orang yang disebutkan oleh Allah,” maka fir’aun membodoh-bodohi kaumnya( dengan perkataan itu) lalu mereka patuh kepadanya. Karena sesungguyhnya mereka adalah kaum yang fasik,” (az-zukhruf:54)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 26: (Dan berkata Firaun kepada pembesar-pembesarnya, \"Biarkanlah aku membunuh Musa) karena mereka mencegahnya melakukan pembunuhan terhadap Musa (dan hendaklah ia memohon kepada Rabbnya) supaya Dia mencegah niatku yang akan membunuhnya (karena sesungguhnya aku khawatir dia akan menukar agama kalian) mencegah kalian menyembahku, lalu kalian mengikutinya (atau menimbulkan kerusakan di muka bumi\") seperti melakukan pembunuhan dan lain sebagainya. Menurut suatu qiraat lafal Au dibaca Wa. Dan menurut qiraat lainnya dibaca Ay Yazhhara Fil Ardhil Fasaadu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan sikap sombong dan kejam. Hal itu karena para pembesarnya menghalangi Fir’aun membunuh Musa. Inilah yang mendorong Fir’aun harus membunuh Musa ‘alaihis salam, dengan maksud menipu kaumnya. Ini termasuk hal yang sangat mengherankan, yaitu manusia yang paling buruk (Fir’aun) mengaku memberi nasihat kepada kaumnya. Ini tidak lain melainkan untuk mengelabui dan menyembunyikan hakikat yang sebenarnya, seperti halnya maling teriak maling. Hal ini diterangkan pula dalam surah Az Zukhruf: 54, “Maka Fir'aun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya. Sesungguhnya mereka adalah kaum yang fasik.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 26",
    "description": "Dan fir'aun berkata kepada pembesar-pembesarnya, 'biar aku sen-diri yang membunuh musa, dan sebelum itu suruh dia memohon kepada tuhannya untuk mendapatkan perlindungan. Apabila musa tidak dibunuh, sesungguhnya aku sangat khawatir dia akan menukar agamamu, wahai penduduk mesir, dengan agama yang dia bawa, atau dia pasti akan menimbulkan kerusakan di bumi sehingga bisa mengganggu kehidupan kita. '27. Rencana jahat fir'aun itu diketahui oleh nabi musa, dan nabi musa pun berkata, 'sesungguhnya aku berlindung kepada Allah, tuhanku dan tuhanmu juga, dari kejahatan setiap orang yang menyombongkan diri. Aku juga berlindung dari kejahatan orang yang tidak beriman kepada hari perhitungan. '."
  }
]