[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Musa berkata kepada Fir’aun dan orang-orangnya, “Sesungguhnya aku memohon perlindungan kepada Tuhanku dan Tuhan kalian (wahai kaum) dari setiap orang yang menyombongkan diri dengan menolak untuk mentauhidkan Allah dan menaatiNya dan dia tidak beriman kepada suatu hari di mana saat itu Allah akan memperhitungkan amal seluruh makhlukNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Ketika Musa mengetahui ancaman Fir'aun, dia berkata, “Sesungguhnya aku berlindung kepada Rabbku dan Rabb kalian dari setiap orang yang menyombongkan diri dan tidak beriman kepada kebenaran, yang tidak beriman kepada hari Kiamat termasuk apa yang ada padanya berupa hisab dan pembalasan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Dan Musa berkata: “Aku memohon pertolongan dari Tuhanku dan Tuhan kalian dari setiap orang yang enggan mengikuti kebenaran dan tidak beriman kepada hari perhitungan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَقَالَ مُوسَىٰٓ إِنِّى عُذْتُ بِرَبِّى وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٍ لَّا يُؤْمِنُ بِيَوْمِ الْحِسَابِ (Dan Musa berkata: “Sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu dari setiap orang yang menyombongkan diri yang tidak beriman kepada hari berhisab”) Musa memohon perlindungan dari setiap orang yang enggan beriman karena keangkuhannya yang tidak beriman kepada hari kebangkitan dan pengumpulan; termasuk di dalamnya adalah Fir’aun, bahkan dialah maksud utama Musa mengatakan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Nabi Musa berkata: “Aku hanya meminta tolong.dan memohon perlindungan kepada Tuhanku juga Tuhan kalian semua wahai manusia. Berlindung dari segala keburukan orang-orang yang sombong dan enggan untuk beriman kepada Allah, kepada hari kebangkitan, hari perkumpulan dan hari perhitungan. Fir’aun dan golongannya yang sombong itu masuk dalam golongan tersebut sebagai penguniversalan terhadap golongan yang dibenci dalam doa Nabi Musa dengan sejelas-jelasnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Musa berkata,“Sesungguhnya aku berlindung} Aku berlindung dan meminta penjagaan {kepada Tuhanku dan Tuhan kalian dari setiap orang yang menyombongkan diri yang tidak beriman kepada hari perhitungan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. ”dan Musa berkata,” ketika fir’aun mengatakan perkataan keji tadi, yang lahir karena keangkuhannya dengan menggunakan kekuatan dan kekuasaannya, sambil Nabi Musa meminta pertolongan kepada Rabbnya, “sesungguhnya aku berlindung kepada Rabbku dan Rabb kalian” maksudnya; aku berlindung kepada rububiyahNya dan dengannya Dia mengatur segala urusan, “dari setiap orang yang menyombongkan diri, yangb tidak beriman kepada hari berhisab,” maksudnya, kesombongan dan keengganannya yang beriman kepada hari perhitungan amal (kiamat) telah menyeretnya untuk berbuat kejahatan dan kerusakan. Fir’aun dan yang lainnya masuk kedalam hukum ini sebagaimana telah dijelaskan pada kaidah di atas. Dan Allah melindungi nabi Musa dengan kelembutanNya dari setiap orang yang menyombongkan diri yang tidak beriman kepada hari miamat, dan Allah telah membentangkan segala sebab (cara) yang dengannya ia selamat dari kejahatan fir’aun dan para pembesarnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 27: (Dan Musa berkata,) kepada kaumnya sedangkan dia telah mendengar ancaman Firaun tadi (\"Sesungguhnya aku berlindung kepada Rabbku dan Rabb kalian dari setiap orang yang menyombongkan diri yang tidak beriman kepada hari berhisab.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Fir’aun mengucapkan kata-kata yang keji itu. Yakni kesombongan serta tidak beriman kepada hari perhitungan yang membuatnya bersikap buruk dan membuat kerusakan, seperti yang terjadi pada Fir’aun dan orang-orang yang semisalnya yang terdiri dari para pemimpin kesesatan. Maka dengan kelembutan Allah, Dia melindungi Musa dari setiap orang yang sombong lagi tidak beriman kepada hari perhitungan. Allah Subhaanahu wa Ta'aala juga menetapkan berbagai sebab yang dengannya Beliau terhindar dari kejahatan Fir’aun dan para pemukanya. Di antara sejumlah sebab itu adalah laki-laki dari keluarga Fir’aun yang dihormati dan ucapannya didengar, terlebih ketika luarnya ia seperti sama dengan mereka, namun batinnya beriman, maka biasanya mereka akan memperhatikan kata-katanya. Hal ini sebagaimana Allah Subhaanahu wa Ta'aala menjaga nabi-Nya Muhammad shallallahu 'alaihi wa sallam dari orang-orang Quraisy melalui pamannya yang disegani oleh mereka, yaitu Abu Thalib, dimana ia adalah orang yang tua di kalangan mereka dan sama dengan agama mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 27",
    "description": "Rencana jahat fir'aun itu diketahui oleh nabi musa, dan nabi musa pun berkata, 'sesungguhnya aku berlindung kepada Allah, tuhanku dan tuhanmu juga, dari kejahatan setiap orang yang menyombongkan diri. Aku juga berlindung dari kejahatan orang yang tidak beriman kepada hari perhitungan. '28. Dan seseorang yang beriman kepada Allah dan rasul-Nya di antara keluarga fir'aun, yang senantiasa menyembunyikan imannya di hadapan fir'aun, berkata, 'apakah kamu, wahai fir'aun, akan membunuh seseorang hanya karena dia berkata, 'tuhanku yang aku sembah adalah Allah, ' padahal sungguh, dia telah datang menyampaikan kebenaran kepadamu dengan membawa bukti-bukti yang nyata dan sulit terbantahkan, dan itu dari tuhanmu juga. '."
  }
]