[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seorang laki-laki dari keluarga Fir’aun yang beriman kepada Allah yang menyembunyikan imannya berkata mengingkari kaumnya, “Bagaimana kalian membolehkan diri kalian untuk membunuh seorang laki-laki yang tidak melakukan dosa di tengah-tengah kalian kecuali karena dia berkata, ‘Tuhanku adalah Allah.’ padahal dia telah membawa bukti-bukti yang kuat dari sisi Tuhan kalian yang menunjukkan kebenaran apa yang dikatakannya? Bila Musa berdusta, maka akibat buruk dustanya akan menimpa dirinya sendiri, namun bila dia benar, maka sebagian dari apa yang dia ancamkan kepada kalian akan menimpa kalian. Sesungguhnya Allah tidak membimbing kepada jalan kebenaran siapa yang melampaui batas dengan meninggalkan kebenaran dan mengambil kebatilan serta pendusta dengan menisbatkan apa yang dilakukannya itu kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Seorang laki-laki yang beriman dari kalangan kaum Fir'aun yang menyembunyikan imannya dari kaumnya berkata sebagai pengingkaran atas rencana mereka untuk membunuh Musa, “Apakah kalian akan membunuh seorang laki-laki yang tidak bersalah hanya karena dia berkata, 'Rabbku adalah Allah,' dan dia telah datang kepada kalian dengan membawa mukjizat dan bukti yang menunjukkan kebenaran ucapannya bahwa dia adalah utusan dari Rabbnya? Seandainya dia berdusta, maka akibat buruk dustanya akan menimpa dirinya sendiri, dan bila dia benar maka sebagian dari apa yang dia ancamkan kepada kalian berupa azab akan menimpa kalian segera.” Sesungguhnya Allah tidak membimbing kepada kebenaran siapa yang melampaui batas-batas-Nya, yang membuat kebohongan atas nama-Nya dan atas rasul-rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Orang beriman dari kaum Fir’aun dan menyembunyikan keimanannya berkata: “Apakah kalian hendak membunuh seseorang hanya karena dia berkata bahwa Allah adalah Tuhannya semata; sedangkan dia telah datang kepada kalian dengan berbagai mukjizat dari Tuhan kalian yang membuktikan kebenarannya? Jika dia berbohong maka dosa kebohongannya akan dia tanggung sendiri, dan jika dia benar dalam risalahnya maka kalian pasti akan tertimpa sebagian siksaan yang diancamkan pada kalian. Sungguh Allah tidak memberi taufik kepada kebenaran bagi orang yang zalim dan banyak berdusta. Hai kaumku, hari ini hanya kalian yang mengusai negeri Mesir, akan tetapi siapa yang akan melindungi kita dari azab Allah jika azab itu mendatangi kita setelah kita membunuh Musa?” Maka Fir’aun menjawab perkataannya dengan angkuh: “Aku tidak menasehati kalian kecuali dengan perkara yang aku nasehatkan kepada diriku sendiri, dan aku tidak memberi kalian petunjuk melainkan kepada jalan yang benar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَقَالَ رَجُلٌ مُّؤْمِنٌ مِّنْ ءَالِ فِرْعَوْنَ يَكْتُمُ إِيمٰنَهُۥٓ (Dan seorang laki-laki yang beriman di antara pengikut-pengikut Fir’aun yang menyembunyikan imannya berkata) Al-Hasan berkata bahwa orang ini adalah orang Mesir yang merupakan keponakan Fir’aun. أَتَقْتُلُونَ رَجُلًا أَن يَقُولَ رَبِّىَ اللهُ(“Apakah kamu akan membunuh seorang laki-laki karena dia menyatakan: “Tuhanku ialah Allah) Akibat perkataannya ini. وَقَدْ جَآءَكُم بِالْبَيِّنٰتِ مِن رَّبِّكُمْ ۖ( padahal dia telah datang kepadamu dengan membawa keterangan-keterangan dari Tuhanmu) Padahal dia telah datang kepada kalian dengan mukjizat-mukjizat yang jelas, dan bukti-bukti yang terang yang menunjukkan kenabiannya dan kebenaran risalahnya. Kemudian dia merayu mereka untuk membela Musa dengan mengatakan: وَإِن يَكُ كٰذِبًا فَعَلَيْهِ كَذِبُهُۥ ۖ وَإِن يَكُ صَادِقًا يُصِبْكُم بَعْضُ الَّذِى يَعِدُكُمْ ۖ( Dan jika ia seorang pendusta maka dialah yang menanggung (dosa) dustanya itu; dan jika ia seorang yang benar niscaya sebagian (bencana) yang diancamkannya kepadamu akan menimpamu”) Perkataan ini bukan karena keraguannya, sebab dia adalah benar-benar orang yang beriman sebagaimana yang Allah sebutkan. Makna perkataan “niscaya sebagian (bencana) yang diancamkannya kepadamu akan menimpamu” yakni jika kalian tidak ditimpa semua yang diancamkan kepada kalian maka paling tidak akan menimpa kalian sebagiannya, dan itu sudah cukup untuk membinasakan kalian. إِنَّ اللهَ لَا يَهْدِى مَنْ هُوَ مُسْرِفٌ كَذَّابٌ (Sesungguhnya Allah tidak menunjuki orang-orang yang melampaui batas lagi pendusta) Ini merupakan lanjutan dari perkataan lelaki beriman itu. Yakni kalau memang Musa adalah orang yang zalim dan pendusta maka Allah tidak akan memberinya mukjizat-mukjizat itu, andai dia berdusta atas nama Allah niscaya Allah akan menghinakan dan membinasakannya sehingga kalian tidak perlu membunuhnya lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Ada seorang mukmin dari kerabat Fir’aun, dia anak dari pamannya dan juga salah satu teman pengawalnya. Dia merahasiakan keimanannya karena takut kepada Fir’aun. Dia berkata: “Apakah kamu bermaksud membunuh seseorang yang tidak berdosa hanya karena dia berkata bahwa Tuhannya hanya Allah semata? Sementara sudah jelas bukti dan mukjizat yang menunjukkan kebenaran kenabiannya? Adapun jika memang dia seorang pendusta maka dia sendiri yang akan menanggung dosa-dosanya itu sendiri. Namun jika dia benar atas risalah yang dia bawa maka sebagaian bencana yang telah diancamkan kepadamu akan segera menimpamu. Sesungguhnya Allah tidak akan memberi petunjuk kepada orang yang bermaksiat dengan melampaui batas dan pendusta. Maksudnya adalah, jika Musa memang seorang pendusta maka sudah pasti dia tidak akan mampu untuk menampakkan mukjizat dari tangannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seorang laki-laki mukmin dari keluarga Fir‘aun yang menyembunyikan} menyembunyikan {imannya berkata,“Apakah kalian akan membunuh seseorang karena dia berkata} karena dia berkata {”Tuhanku adalah Allah. Sungguh dia telah datang kepada kalian dengan bukti-bukti yang nyata dari Tuhan kalian. Jika dia seorang pendusta, maka atas dirinyalah dusta itu, dan jika dia seorang yang benar, niscaya kalian akan ditimpa} akan ditimpa {sebagian yang diancamkan kepada kalian} bencana yang diancamkan kepada kalian {Sesungguhnya Allah tidak memberi petunjuk kepada orang yang melampaui batas} melampaui batas dengan berbuat syirik, membunuh tanpa ada alasan yang benar {lagi pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. di antara sebab- sebab itu adalah seorang lelaki beriman dari kaum fir’aun yang bersal dari istana kerajaan, yang pasti memiliki ucapan-ucapan yang didengar, terutama ketika menampakkan keberpihakknya kepada mereka dan merahsiakan imannya. Mereka biasanya menaruh perhatian kepadanya, dan sebaliknya, mereka tidak akan menaruh perhatian kepadanya kalau ia menampakkan sikap bersebrangan dengan mereka. Sebagaimana Allah telah melindungi nabi Muhammad dari kaum Quraisy melalui pamannya, Abu thalib, yang mana Abu thalib adalah tokoh yang disegani di kalangan mereka. Kalau seandainya saja dia seorang muslim, tentu perlindungan itu tidak akan terjadi darinya. Lelaki beriman yang cerdas lagi tegas (dari istana fir’aun) itu berkata dengan nada mencemooh tindakan kaumnya dan kekejian rencana yang hendak mereka lakukan, “apakah kamu akan membunuh seorang laki-laki karena ia menyatakan, ‘Rabbku ialah Allah’?” maksudnya, bagaimana kalian menghalalkan pembunuhannya, padahal dosa dan kejahatannya hanya karena ia mengucapkan “tuhanku adalah Allah” perkataan lelaki ini juga bukan perkataan yang kosong dari argument. Maka dari itu ia berkata, “padahal dia (nabi Musa) telah datang kepadamu dengan membawa keterangan-keterangan dari Rabbmu,” karena keterangan (bukti, mukjizat, dan argument) nya sudah sangat popular dikalangan mereka, diketahui oleh anak kecil dan orang dewasa. Artinya, orang itu tidak boleh dibunuh hanya karena lasan seperti ini. Maka kenapa kalian tidak membatalkan terlebih dahulu kebenaran yang ia bawa dan kalian respons argumennya dengan argument yang dapat mencampakkannya, baru setelah itu kalian lihat apakah halal (pantas) membunuhnya apabila kalian telah unggul atasnya berdasarkan argument atau tidak?! Sekarang sungguh hujjahnya telah mengungguli dan argumennya menang, sehingga ada jarak pemisah yang sangat jauh antara kalian dengan dia yang dengannya kalian tidak punya alasan untuk membunuhnya! Lalu lelaki beriman itu mengatakan kepada mereka satu perkataan yang dapat meyakinkan setiap orang yang berakal dalam kondisi seperti apa pun adanya, seraya berkata, ”dan jika ia seorang pendusta, maka ialah yang menanggug dustanya itu, dan jika ia adalah seorang yang benar, niscaya sebagian yang diancamkannya kepadamu akan menimpamu.” Maksudnya, nabi Musa itu ada pada dua kemungkinan; sebagai seorang pendusta dalam klaimnya atau sebagai seorang yang benar. Jika ia adalah seorang pendusta, maka kedustaanya dan bahaya kedustaannya hanya akan menimpa dirinya sendiri, tidak ada bahaya apapun terhadap kalian dalam masalah ini, dimana kalian telah menolak seruannya dan menolak untuk mempercayainya. Tetapi jika ia benar, sedangkan ia telah datang kepada kalian dengan membawa bukti-bukti dan ia pun telah menyampaikan kepada kalian bahwa jika kalian tidak menerimanya. Niscaya kalian di azab oleh Allah dengan satu azab di dunia ini dan satu azab lagi di akhirat nanti. Sesungguhnya sebagian yang diancamkannya terhadap kalian pasti akan menimpa kalian, dan itu adalah azab kalian di dunia. Ini adalah sebagian kecerdasan akalnya dan kelembutan pembelaannya untuk nabi Musa, dimana ia telah mengemukakan jawaban yang tidak ada kekacauannya terhadap mereka, dan ia telah menempatkan permasalahan berkisar antara dua kondisi. Yang jelas, membunuhnya adalah suatu kedunguan dan kebodohan dari kalian. Setelah itu orang yang beriman tersebut (semoga Allah meridhai, mengampuni, dan merahmatinya,) beralih pada perkara yang lebih tinggi dari itu dan penjelasan tentang kedekatan Nabi Musa kepada kebenaran,seraya berkata, ”sesungguhnya Allah tidak menunjuki orang-orang yang berlebihan,” maksudnya, melampaui batas, karena meninggalkan yang haq dan mengutamakan yang batil, “lagi pendusta,” karena menisbatkan tindakan melampaui batsa itu kepada Allah. Maka orang seperti ini tidak akan diberi petunjuk oleh Allah menunju jalan kebenaran, baik pada maknanya maupun pada dalilnya. Dan Allah tidak akan membimbingnya kepada jalan yang lurus. Maksudnya, kalian telah melihat kebenaran yang diserukan Nab Musa dan argument-argumen logis (aqli) dan mukjizat-mukjizat samawi yang telah Allah tunjukkan kepadanya untuk dijelaskan. Maka orang yang berpedoman kepada petunjuk ini tidak mungkin seorang yang melampaui batas ataupun seorang pendusta. Ini juga membuktikan kematangan ilmunya, kecerdasan akal dam ma’rifatnya tentang Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 28: (Dan berkatalah seorang laki-laki yang beriman di antara keluarga Firaun) menurut suatu pendapat disebutkan, bahwa ia adalah anak paman Firaun atau saudara sepupunya (yang menyembunyikan imannya, \"Apakah kalian akan membunuh seorang laki-laki karena) sebab (dia menyatakan, 'Rabbku ialah Allah' padahal dia telah datang kepada kalian dengan membawa keterangan-keterangan) yakni mukjizat-mukjizat yang jelas (dari Rabb kalian. Dan jika ia seorang pendusta maka dialah yang menanggung dosa-dustanya itu) yakni dia sendirilah yang menanggung akibat dari kedustaannya (dan jika ia seorang yang benar niscaya sebagian bencana yang diancamkannya kepada kalian akan menimpa kalian\") yakni sebagian azab yang diancamkannya kepada kalian akan segera menimpa diri kalian. (Sesungguhnya Allah tidak menunjuki orang-orang yang melampaui batas) yakni orang yang musyrik (lagi pendusta) yang banyak dustanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bagaimana kamu menganggap halal membunuhnya hanya karena dia mengatakan Tuhanku adalah Allah, dan lagi ucapannya tidak hanya sekedar ucapan, ia juga telah memperkuat dengan bukti-bukti yang sudah diketahui bersama. Mengapa sebelum kamu membunuhnya, kamu tidak menghadapinya dengan bukti-bukti untuk menolaknya? Setelah itu, kamu memperhatikan apakah ia layak dibunuh ketika kamu mengalahkan hujjahnya atau tidak? Namun jika ternyata hujjahnya yang menang dan buktinya yang tinggi, maka antara kamu dengan halalnya dibunuh terdapat padang sahara yang harus kamu lalui. Selanjutnya ia mengucapkan kata-kata yang sejalan dengan akal sehat dan dapat menundukkan semua orang yang berakal. Yakni Musa ‘alaihis salam berada di antara dua keadaan; bisa dusta dan bisa benar. Jika dusta, maka Beliaulah yang menanggung dosanya dan bahayanya hanya untuk dirinya, dan kamu tidak akan menerima bencana jika kamu tidak memenuhi seruannya dan mengimaninya, namun jika Beliau benar dan ternyata Beliau juga telah membawakan bukti-bukti terhadap kebenarannya, dan Beliau telah memberitahukan kamu bahwa jika kamu tidak mau mengikuti, maka Allah akan mengazabmu di dunia dan di akhirat, maka pasti sebagian dari bencana yang diancamkan kepadamu itu, yaitu azab di dunia, akan menimpamu. Ini termasuk kecerdasan akal orang mukmin tersebut, dan memang orang-orang mukmin adalah orang-orang yang cerdas meskipun tingkat kecerdasannya berbeda-beda sebagaimana tingkat iman mereka juga berbeda-beda. Hal ini juga termasuk kelembutan orang tersebut dalam membela Nabi Musa ‘alaihis salam, dimana ia mengucapkan kata-kata yang diakui oleh mereka dan menjadikan masalah tersebut mengandung dua kemungkinan, serta menerangkan bahwa masing-masing kemungkinan itu tetap memberikan kesimpulan untuk tidak membunuhnya, dan bahwa membunuhnya merupakan tindakan bodoh dan jahil dari mereka. Selanjutnya orang ini –semoga Allah meridhainya, mengampuninya dan merahmatinya- beralih kepada perkara yang lebih tinggi dari itu dan menerangkan dekatnya Musa ‘alaihis salam dengan kebenaran. Dia berkata, “Sesungguhnya Allah tidak memberi petunjuk kepada orang yang melampaui batas dan pendusta.” Yaitu dengan meninggalkan yang hak setelah datang, dan beralih kepada yang batil. Yaitu dengan menisbatkan sikap melampaui batas itu kepada Allah Subhaanahu wa Ta'aala. Orang yang seperti ini tidak akan ditunjuki oleh Allah kepada jalan yang benar dan tidak diberi taufiq ke jalan yang lurus. Yakni, kamu telah mendengar dan melihat apa yang diserukan Nabi Musa dan pemberian Allah kepadanya berupa bukti-bukti yang diterima akal dan mukjizat yang luar biasa. Jika kamu tidak beriman kepadanya, padahal bukti-buktinya begitu jelas, maka berarti kamu orang yang melampaui batas dan pendusta. Hal ini menunjukkan sempurnanya ilmu, akal dan pengenalan orang mukmin tersebut kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 28",
    "description": "Dan seseorang yang beriman kepada Allah dan rasul-Nya di antara keluarga fir'aun, yang senantiasa menyembunyikan imannya di hadapan fir'aun, berkata, 'apakah kamu, wahai fir'aun, akan membunuh seseorang hanya karena dia berkata, 'tuhanku yang aku sembah adalah Allah, ' padahal sungguh, dia telah datang menyampaikan kebenaran kepadamu dengan membawa bukti-bukti yang nyata dan sulit terbantahkan, dan itu dari tuhanmu juga. '29. Wahai kaumku! pada hari ini kerajaan ada pada genggaman-Mu yang dengan kerajaan itu kamu berkuasa di bumi, tetapi bagaimana kalau yang disampaikan oleh musa itu benar, maka siapa yang akan menolong kita dari azab Allah jika azab itu menimpa kita'' mendengar ucapan seorang mukmin itu, fir'aun berusaha meyakinkan kaumnya dengan berkata, 'aku hanya mengemukakan kepadamu, apa yang menurutku aku pandang baik; dan aku berdasarkan pandanganku itu hanya semata-mata ingin menunjukkan kepadamu jalan yang benar dan lurus. '."
  }
]