[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, bagi kalian kekuasaan di hari ini, kalian berkuasa di bumi Mesir atas rakyat kalian dari Bani Israil dan lainnya. Lalu siapa yang menolak azab Allah dari kita bila ia datang menimpa kita?’ fir’aun berkata kepada kaumnya untuk menjawab perkataannya, “Wahai manusia, aku tidak menunjukkan kepada kalian berupa pendapat atau nasihat kecuali apa yang aku pandang baik dan benar untuk diriku sendiri dan bagi kalian, dan aku tidak mengajak kalian kecuali kepada jalan yang benar lagi haq.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. “Wahai kaumku! Hari ini kalian mempunyai kekuasaan yang berjaya di bumi Mesir, lalu siapa yang akan menolong kita dari azab Allah bila ia datang karena kalian membunuh Musa?” Fir'aun berkata, “Pendapat adalah pendapatku, keputusan adalah keputusanku, aku telah memutuskan membunuh Musa untuk menepis keburukan dan kerusakan, aku tidak mengajak kalian kecuali kepada kebaikan dan kelurusan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. يٰقَوْمِ لَكُمُ الْمُلْكُ الْيَوْمَ ظٰهِرِينَ فِى الْأَرْضِ ((Musa berkata): “Hai kaumku, untukmulah kerajaan pada hari ini dengan berkuasa di muka bumi) Lelaki beriman ini mengatakan demikian agar mereka bersyukur kepada Allah dan tidak terus menerus dalam kekafiran mereka. Yang dimaksud adalah bumi Mesir. فَمَن يَنصُرُنَا مِنۢ بَأْسِ اللهِ إِن جَآءَنَا ۚ( Siapakah yang akan menolong kita dari azab Allah jika azab itu menimpa kita!”) Yakni siapa yang dapat melindungi kita dari azab-Nya saat azab itu datang. Setelah Fir’aun mendengar nasehat yang diberikan lelaki ini, maka ia mulai memperdaya kaumnya seakan-akan ia adalah orang yang menasehati dan menjaga mereka serta ia tidak menuntun mereka kecuali kepada sesuatu yang bermanfaat dan menjauhkan mereka dari mudharat. Maka sebab itu ia berkata: قَالَ فِرْعَوْنُ مَآ أُرِيكُمْ إِلَّا مَآ أَرَىٰ( Fir’aun berkata: “Aku tidak mengemukakan kepadamu, melainkan apa yang aku pandang baik) Yakni aku tidak menunjukkan kepada kalian kecuali apa yang menurutku baik. وَمَآ أَهْدِيكُمْ إِلَّا سَبِيلَ الرَّشَادِ (dan aku tiada menunjukkan kepadamu selain jalan yang benar) Dan aku tidak menunjukkan kepada kalian dengan pendapatku ini kecuali kepada jalan yang benar yang jika kalian tapaki maka kalian tidak akan tersesat. Abu Na’im dalam –bab keutamaan-keutamaan para sahabat— dan al-Bazzar meriwayatkan dari Ali bin Abi Thalib bahwa ia berkata: “hai Manusia, beritahukan kepadaku siapakah orang yang paling pemberani?” mereka menjawab: “Kamu.” Lalu ia berkata: “kalau diriku, memang tidaklah aku bertanding dengan seseorang melainkan aku pasti mengalahkannya; namun beritahukan kepadaku siapakah orang yang paling pemberani?” Mereka menjawab: “Kami tidak tahu siapa.” Maka ia berkata: “orang yang paling pemberani adalah Abu Bakar; suatu hari aku melihat Rasulullah ditangkap oleh kaum Quraisy, sebagian memukulinya dan sebagian lainnya menyeretnya sambil berkata: “Apakah kamu yang menjadikan tuhan-tuhan kami hanya menjadi satu tuhan saja?” Ali bin Abi Thalib melanjutkan: “Demi Allah, tidak ada dari kami yang berani mendekatinya kecuali Abu Bakar, dia memukuli sebagian dan menyeret sebagian dari mereka seraya berkata: “celakalah kalian, apakah kalian akan membunuh seseorang hanya karena dia berkata ‘Tuhanku adalah Allah?’” Lalu Ali melepas surban yang dipakainya, kemudian dia menangis hingga membasahi jenggotnya. Kemudian dia berkata: “Aku serukan kepada kalian, apakah lelaki beriman dari kerabat Fir’aun itu atau Abu Bakar yang lebih baik?” Namun orang-orang terdiam. Maka dia bertanya kepada mereka: “Mengapa kalian tidak menjawab? Demi Allah, apa yang dilakukan Abu Bakar lebih baik daripada yang dilakukan lelaki beriman dari kerabat Fir’aun; lelaki itu menyembunyikan imannya, sedangkan Abu Bakar menampakkan imannya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. “Wahai kaumku! Pada hari ini kerajaan Mesir ini ada di tangan kalian. Kalian berkuasa dan berpangkat tinggi atas Bani Israil, kalian juga bebas berbuat apapun. Namun kepada siapa kita akan meminta pertolongan atas dahsyatnya azab Allah jika kita sudah membunuh Musa?” Kemudian Fir’aun mengelak dan membantah dengan penuh percaya diri untuk bisa menangkal bahaya dengan berkata: “Aku hanya mengemukakan kepada kalian sesuatu yang aku anggap benar, yaitu membunuh Musa, aku tidak memerintahkan kalian kecuali itu adalah suatu kebenaran.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai kaumku, pada hari ini kerajaan ada pada kalian dengan berkuasa di bumi} berkuasa di negeri Mesir {Maka siapa yang akan menolong kita} menjaga kita {dari azab Allah} azab Allah {jika datang kepada kita” Fir‘aun berkata,“Aku tidak menyampaikan pendapat kepada kalian kecuali apa yang aku pandang saja} Aku tidak menyampaikan pendapat kepada kalian kecuali yang aku pandang {dan aku tidak menunjukkan kepada kalian} Aku tidak membimbing kalian {melainkan menuju jalan yang benar”} jalan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. kemudian orang mukmin itu mewanti-wanti kaumnya, menasihati mereka, dan mempertakuti dengan azab dana lam akhirat, ia juga mencegah mereka agar tidak terpesona dengan kekuasaan yang nampak, seraya berakta,”hai kaumku, untukmulah kerajaan hari ini,” maksudnya, di dunia ini,”dengan berkuasa di muka bumi” terhadap rakyat kalian, dimana kalian memberlakukan aturan apa saja yang kalian kehendaki. Terhadap mereka. Andaikata hal itu benar-benar kalian raih dan kalian miliki, “maka siapakah yang akan menolong kita dari azab Allah,” yakni siksaanNya, “jika ia datang menimpa kita!” ini adalah bagian dari kepandaiannya dalam berdakwah, di mana permasalahan ia jadikan sebagai permasalahan bersama di antara mereka, dengan mengatakan, “siapakah yang akan menolong kita.” Ini untuk memberikan pemahaman kepada mereka bahwasannya ia menasihati mereka sebagaimana halnya (pada saat yang sama) ia menasihati dirinya sendiri, dan ia menginginkan bagi mereka apa yang ia inginkan bagi dirinya sendiri. Maka fir’aun berkata dengan menentangnya dan mempropaganda kaumnya agr tidak mengikuti nabi Musa, ”aku tidak mengemukakan kepadamu, melainkan apa yang aku pandang baik; dan aku tiada menunjukkan kepadamu selain jalan yang benar.” Ia benar pada ucapannya, “aku tidak mengemukakan kepadamu melainkan apa yang aku pandang baik,” tetapi apa yang ia pandang baik itu?! Ia memandang untuk membodoh-bodohi kaumnya agar mereka mengikutinya sehingga ia bisa melanggengkan kekuasaanya terhadap mereka. Ia tidak memandang kebenaran ada di pihaknya, bahkan ia melihat kebenaran ada di pihak nabi Musa, namun ia mengingkari padahal hatinya meyakininya. Dan fir’aun berdusta pada ucapannya “dan aku tiada menunjukkan kepadamu selain jalan yang benar.” Sebab, ini adalah tindakan membalikan kebenaran. Kalau saja ia memerintahkan kepada mereka untuk mengikutinya, murni atas kekafiran dan kesesatannya, tentu keburukannya blebih ringan. Tetapi malah ia memerintah mereka mengikutinya sambil mengklaim, bahwa kalau mengikuti dirinya berarti mengikuti kebenaran, sedangkan kalau mengikuti kebenaran (yang ada pada Nabi Musa) berarti mengikuti kesesatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 29: (Hai kaumku! Untuk kalianlah kerajaan pada hari ini dengan berkuasa) artinya, dengan mengalami kemenangan; lafal Zhaahiriina berkedudukan menjadi Hal atau kata keterangan keadaan (di muka bumi) di negeri Mesir. (Siapakah yang akan menolong kita dari azab Allah) dari azab-Nya bila kalian membunuh kekasih-kekasih-Nya (jika azab itu menimpa kita) tiada seorang pun yang dapat menolong kita (Firaun berkata, \"Aku tidak mengemukakan kepada kalian, melainkan apa yang aku pandang baik;) maksudnya, aku tidak memberikan isyarat kepada kalian melainkan apa yang telah aku putuskan itu, yaitu membunuh Musa (dan aku tiada menunjukkan kepada kalian, selain jalan yang benar\") jalan yang mengandung kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya ia mengingatkan kaumnya dan menasihati mereka serta menakut-nakuti mereka dengan azab di akhirat dan melarang mereka tertipu oleh kerajaan yang tampak pada saat itu. Atas rakyat kamu, dimana kamu dapat memberlakukan apa saja ketetapanmu atas mereka. Karena kamu membunuh utusan-Nya. Kata-katanya ini agar mereka paham bahwa maksudnya adalah memilihkan yang terbaik untuk mereka sebagaimana ia memilih yang terbaik untuk dirinya, serta meridhai untuk mereka sesuatu yang ia ridhai untuk dirinya sendiri. Untuk menentangnya sambil memperdaya kaumnya agar tidak mengikuti Musa ‘alaihis salam. Ia memandang untuk kepentingan pribadinya agar kekuasaannya tetap langgeng meskipun ia tahu bahwa kebenaran bersama Nabi Musa ‘alaihis salam, namun ia mengingkarinya meskipun mengakui kebenarannya. Ia (Fir’aun) memutarbalikkan fakta. Kalau sekiranya ia menyuruh mereka mengikuti kekafiran dan kesesatannya saja, maka keburukannya lebih ringan, tetapi ia menyuruh mereka mengikutinya dan mengatakan bahwa dengan mengikutinya, maka mereka berada di atas kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 29",
    "description": "Wahai kaumku! pada hari ini kerajaan ada pada genggaman-Mu yang dengan kerajaan itu kamu berkuasa di bumi, tetapi bagaimana kalau yang disampaikan oleh musa itu benar, maka siapa yang akan menolong kita dari azab Allah jika azab itu menimpa kita'' mendengar ucapan seorang mukmin itu, fir'aun berusaha meyakinkan kaumnya dengan berkata, 'aku hanya mengemukakan kepadamu, apa yang menurutku aku pandang baik; dan aku berdasarkan pandanganku itu hanya semata-mata ingin menunjukkan kepadamu jalan yang benar dan lurus. '30. Dan orang yang beriman dari pengikut fir'aun itu berkata, 'wahai kaumku! sesungguhnya aku khawatir jika kamu membinasakan musa, kamu akan ditimpa bencana seperti hari kehancuran golongan yang ber-sekutu yang memusuhi para nabi dan rasul."
  }
]