[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia pengampun terhadap dosa orang-orang yang berbuat dosa, Penerima taubat dari orang-orang yang bertaubat, maha keras hukumanNya bagi siapa yang berani melakukan dosa-dosa dan tidak mau bertaubat darinya. Dia pemilik karunia dan nikmat atas hamba-hambaNya yang taat, tiada sesembahan yang berhak untuk disembah selainNya, hanya kepadaNya tempat kembali seluruh makhluk di hari perhitungan amal perbuatan, lalu Dia membalas masing-masing orang sesuai dengan haknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Allah mengampuni dosa-dosa para pelakunya, menerima tobat para hamba yang bertobat kepada-Nya. Dia pemilik kebaikan dan karunia, tidak ada sesembahan yang hak selain Dia, hanya kepada-Nya semata tempat manusia kembali pada hari Kiamat, lalu Dia memberi mereka balasan atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah menghapus dosa-dosa hamba-Nya yang bertaubat dan menerima taubatnya, dan Dia sangat berat siksaan-Nya bagi orang-orang yang angkuh dan ingkar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. غَافِرِ الذَّنۢبِ وَقَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ (Yang Mengampuni dosa dan Menerima taubat lagi keras hukuman-Nya) Yakni Allah mengampuni dosa para kekasih-Nya dan menerima taubat mereka, serta siksaan-Nya sangat berat bagi para musuh-Nya. ذِى الطَّوْلِ ۖ (Yang mempunyai karunia) Yakni memiliki kenikmatan yang diberikan kepada para hamba-Nya yang sebenarnya bukan hak mereka, namun hanya karena kemurahan-Nya. لَآ إِلٰهَ إِلَّا هُوَ ۖ إِلَيْهِ الْمَصِيرُ (Tiada Tuhan (yang berhak disembah) selain Dia. Hanya kepada-Nya-lah kembali (semua makhluk)) Yakni hanya kepada-Nya kembali, dan itu terjadi pada hari akhir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Yang Maha Mengampuni dosa orang-orang mukmin yang senantiasa bertaubat. Yang Maha Menerima taubat sebagai keutamaan dan rahmat dari-Nya. Yang Maha Memberi azab pedih bagi orang-orang kafir. Yang Maha Memberi keutamaan dan dan nikmat kepada hamba-Nya. Tidak ada tuhan yang berhak disembah kecuali Dia. Hanya kepada-Nya segala sesuatu akan kembali untuk dihisab dan diberi balasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pengampun dosa, Penerima taubat} taubat {Pemberi hukuman yang keras, dan Pemilik karunia} pemiliki nikmat dan karunia {Tidak ada tuhan selain Dia. Hanya kepadaNyalah (semua) kembali} kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah subhnahu wata’ala mengabarkan tentang kitab-Nya yang agung, yaitu bahwa sesungguhnya ia berasal dan diturunkan dari sisi Allah yang berhak dipuja dan disembah, karena kemahasempurnaan-nya dan keesaan-Nya dalam segala perbuatan-Nya. “Yang Maha Perkasa” yang dengan keperkasaan-Nya Dia menundukan semua makhluk. “Yang Maha Mengetahui” segala sesuatu. “yang Mengampuni dosa” dari orang-orang yang berbuat dosa. “Dan Menerima taubat” dari orang-orang yang betaubat. “Lagi keras hukuman-Nya” terhadap siapa saja yang lancang berbuat dosa dan tidak bertaubat darinya. “yang mempunyai karunia”, maksudnya, pemilik karunia dan kebaikan yang menyeluruh. Setelah Allah menetapkan sebagian dari kemahasempurnaan-Nya, dan hal itu memastikan bahwa hanya Dia saja yang berhak disembah, yang amal ibadah hanya dimurnikan untuk-Nya, maka karena itu Dia kemudian berfirman, “Tiada tuhan yang berhak disembah melainkan Dia. Hanya kepada-Nya lah (semua makhluk) kembali.” Sisi korelasi penyebutan turunnya al-Quran dari sisi Allah yang mempunyai sifat-sifat tersebut tadi adalah bahwa sifat-sifat tersebut memastikan seluruh makna yang terkandung di dalam al-Quran. Karena itu, sesungguhnya al-Quran boleh jadi adalah informasi tentang nama-nama, sifat-sifat dan perbuatan-perbuatan Allah, dan ini adalah nama-nama, sifat-sifat dan perbuatan-perbuatan dan boleh jadi informasi tentang hal yang gaib yang telah lalu dan yang akan datang, dan ini adalah pemberitahuaan dari yang Maha Mengetahui kepada hamba-hamba-Nya. Boleh jadi pula informasi tentang karunia-karunia-Nya yang sangat besar dan nikmat-nikmatNya yang luar biasa dan segala perintah yang mengantarkan kepada nikmat tersebut. Yang demikian ini ditunjukan oleh firmanNya “Yang mempunyai karunia”. Boleh jadi juga informasi tentang hukumannya yang sangat keras dan hal apa saja yang menyebabkan dan memastikan dari berbagai perbuatan maksiat. Hal ini ditunjukan oleh firmanNya “yang amat keras hukumanNya”. Boleh jadi juga seruan kepada orang-orang yang berdosa untuk bertaubat, berinabah dan memohon ampunan (kepada Allah). Ini diisyaratkan oleh firmanNya, “Yang mengampuni dosa dan menerima taubat lagi keras hukumanNya”. Boleh jadi juga ini informasi bahwa hanya Dia yang berhak diibadahi dan disembah, kemudian berbagai dalil aqli dan naqli dikemukakan untuknya, himbauan untuk beribadah kepadaNya dan larangan beribadah kepada selain Dia, serta penegakan argument-argumen naqli dan aqli terhadap ketidak benaran penyembahan kepada selain Allah itu serta ancaman nya. itulah sebabnya Dia berfirman, “Tiada tuhan yang berhak disembah melainkan Dia”. Serta boleh jadi juga informasi tentang balsanNya yang sangat adil dan pahala bagi orang-orang yang berbuat baik serta siksaan bagi orang-orang yang durhaka. Hal ini diisyaratkan oleh firmanNya, “Hanya kepadaNya-lah (semua makhluk) kembali.” Itulah yang dicakup di dalam al-Quran berupa al-Matholib al-‘Aliyah (nilai-nilai yang luhur)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 3: (Yang mengampuni dosa) orang-orang mukmin (dan menerima tobat) mereka (lagi keras hukuman-Nya) terhadap orangorang kafir, yaitu Dia mengeraskan azab-Nya terhadap mereka (Yang mempunyai karunia) yakni Pemberi nikmat yang lapang; Dia bersifat demikian selama-lamanya. Dimudhafkannya lafal Ghaafir kepada Adz-Dzanbi, lafal Qaabil kepada At-Taubi, dan lafal Syadiid kepada Al-Iqaabi mengandung makna Takrif sebagaimana lafal terakhir yaitu Dzith Thauli. (Tiada Tuhan selain Dia. Hanya kepada-Nyalah kembali) semua makhluk pasti kembali kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagi orang-orang yang berdosa. Bagi orang-orang kafir atau orang yang berani berbuat dosa dan tidak mau bertobat darinya. Setelah Allah Subhaanahu wa Ta'aala menetapkan apa yang Dia tetapkan tentang kesempurnaan-Nya, dimana hal itu mengharuskan Dia saja yang diibadahi dan diikhlaskan amal untuk-Nya, maka Dia berfirman, “Tidak ada Tuhan (yang berhak disembah) selain Dia.” Sisi kesesuaian ayat di atas dengan menyebutkan turunnya Al Qur’an dari sisi Allah Yang memiliki sifat-sifat di atas adalah bahwa sifat-sifat tersebut menghendaki semua makna yang dicakup oleh Al Qur’an. Hal itu, karena Al Qur’an isinya memberitakan tentang nama-nama Allah, sifat-Nya dan perbuatan-Nya, sedangkan ayat di atas menyebutkan nama-nama Allah, sifat-Nya dan perbuatan-Nya. Bisa juga isinya memberitakan tentang perkara-perkara gaib yang lalu dan yang akan datang, dimana hal itu termasuk pengajaran Allah Yang Maha Mengetahui kepada hamba-hamba-Nya. Bisa juga memberitakan tentang nikmat-nikmat-Nya yang besar dan banyak serta perkara-perkara yang dapat menyampaikan kepadanya, dimana hal ini ditunjukkan oleh firman-Nya, “Dzith thaul” (artinya: yang memiliki karunia). Bisa juga memberitakan tentang hukuman-Nya yang keras dan sesuatu yang membuat seseorang dihukum demikian serta maksiat yang mengharuskan hukuman itu, dimana hal ini ditunjukkan oleh firman-Nya, “Syadiidil ‘iqaab” (artinya: dan keras hukuman-Nya). Bisa juga berisi ajakan kepada orang-orang yang berdosa untuk bertobat, kembali dan beristighfar, dimana hal ini ditunjukkan oleh firman-Nya, “Ghaafiridz dzanbi wa qaabilit taubi syadiidil ‘iqaab” (artinya: Yang mengampuni dosa dan menerima tobat dan keras hukuman-Nya;). Bisa juga isinya pemberitaan bahwa Allah satu-satunya yang berhak diibadahi serta penegakkan dalil ‘aqli (akal) maupun naqli (wahyu) yang menunjukkan demikian, yang mendorong kepadanya, serta melarang beribadah kepada selain Allah sambil menerangkan dalil-dalil ‘aqli dan naqli yang menunjukkan rusaknya syirk dan menakut-nakutinya, dimana hal ini ditunjukkan oleh firman-Nya, “Laailaaha illaa Huwa” (artinya: tidak ada Tuhan yang berhak disembah selain Dia). Bisa juga memberitakan tentang hukum jaza’i(balasan)-Nya yang adil, pahala untuk orang-orang yang berbuat ihsan, hukuman bagi orang-orang yang durhaka, dimana hal ini ditunjukkan oleh firman Allah Ta’ala, “Ilaihil mashiir” (kepada-Nyalah semua kembali). Inilah yang dicakup Al Qur’an yang merupakan tuntutan yang tinggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 3",
    "description": "Dia Allah yang maha pengampun, mengampuni dosa dan menerima tobat bagi orang yang mau memohon ampunan dan bertobat, dan pada waktu yang bersamaan juga sangat keras hukuman-Nya; serta dia juga yang memiliki karunia. Tidak ada tuhan yang berhak untuk disembah selain dia. Hanya kepada-Nya saja-lah semua makhluk kembali. 4. Adalah suatu keniscayaan bahwa tidak ada orang yang memperdebatkan tentang kebenaran dari ayat-ayat Allah dengan tujuan memperolok-olokkan atau menimbulkan keraguan terhadapnya, kecuali apa yang dilakukan oleh orang-orang yang kafir. Karena itu, janganlah engkau wahai nabi Muhammad tertipu oleh keberhasilan usaha mereka yang menghasilkan berbagai kesenangan yang mereka peroleh di seluruh negeri."
  }
]