[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Laki-laki yang beriman dari keluarga fir’aun itu berkata menasihati dan memperingatkan Fir’aun dan pengikutnya, “Sesungguhnya aku takut terhadap kalian bila kalian membunuh Musa, maka kalian akan ditimpa seperti hari al- Ahzab saat mereka bersekongkol melawan nabi-nabi mereka,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Laki-laki yang beriman menasihati kaumnya, “Sesungguhnya aku khawatir, bila kalian tetap membunuh Musa secara zalim, maka kalian akan ditimpa azab seperti azab yang menimpa kaum yang mendustakan dan bersekutu melawan rasul-rasul mereka yang terdahulu, maka Allah membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-33. Orang beriman yang berasal dari golongan Fir’aun itu berkata kepada Fir’aun dan bala tentaranya: “Aku khawatir kalian akan mendapat akibat buruk dari pendustaan kalian terhadap Musa, sehingga kalian tertimpa seperti azab yang telah menimpa umat-umat terdahulu yang bersama-sama melawan dan mendustakan nabi mereka; seperti yang menimpa kaum Nabi Nuh, kaum ‘Aad, Tsamud, dan kaum-kaum setelahnya. Allah telah membinasakan mereka akibat pendustaan yang mereka lakukan; dan Allah sama sekali tidak menzalimi hamba-hamba-Nya. Hai kaumku, aku khawatir kalian akan tertimpa azab pada hari kiamat, hari ketika orang-orang kafir saling meminta pertolongan dan ketika kalian berusaha melarikan diri, namun tidak ada orang yang mampu menolong kalian dari Allah. Barangsiapa yang Allah sesatkan dari jalan yang benar maka dia tidak akan mendapatkan orang yang dapat memberinya petunjuk kepada kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. مِّثْلَ يَوْمِ الْأَحْزَابِ (seperti peristiwa kehancuran golongan yang bersekutu) Yakni seperti hari diturunkan kepada umat-umat terdahulu yang bersekutu melawan nabi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Orang yang beriman itu kemudian berkata: “Wahai kaumku, aku sungguh khawatir dan takut atas kalian terhadap tipu daya Fir’aun dan ajakannya untuk membunuh Musa, aku takut kalian akan menjadi seperti orang-orang terdahulu yang mendustakan dan mengingkari nabinya. Aku takut kalian akan ditimpa bencana dan kebinasaan sebagaimana yang telah mereka alami.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang yang beriman berkata,“Wahai kaumku, sesungguhnya aku khawatir kalian akan ditimpa (bencana) seperti harinya golongan yang bersekutu} hari dimana golongan yang bersekutu menentang para nabi sebelum kalian itu diazab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. ”dan orang yang beriman itu berkata” mengulangi kembali dakwah (menyeru) kaumnya, dimana ia tidak berputus asa dalam membawa mereka menunju hidayah, seperti halnya kebiasaan para da’I yang mengajak kepada Allah, mereka terus dan selalu mengajak kepada Allah, tidak ada sesuatu apapun yang mampu merintangi mereka, dan kecongkakakan orang-orang yang mereka seru tidak dapat membuat mereka surut untuk berdakwah. Maka ia berkata kepada mereka,” hai kaumku, sesungguhnya aku khawatir kamu akan ditimpa seperti peristiwa kehancuran golongan yang bersekutu,” yakni, umat-umat yang mendustakan yang bersatu (berkoalisi) untuk memernagi para nabi mereka dan bersatu menentangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 30: (Dan orang yang beriman itu berkata, \"Hai kaumku! Sesungguhnya aku khawatir kalian akan ditimpa -bencana- seperti peristiwa kehancuran golongan yang bersekutu) yakni azab yang telah menimpa umat-umat terdahulu, golongan demi golongan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengulang-ulang mendakwahi kaumnya dan tidak putus asa berusaha memberi petunjuk kepada mereka sebagaimana keadaan para da’i ilallah. Mereka senantiasa mengajak manusia kepada Tuhannya dan tidak menghalangi mereka orang yang menolaknya serta tidak melemahkan mereka sikap keras dari orang yang mereka dakwahi. Mereka bersekutu untuk menentang para nabi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 30",
    "description": "Dan orang yang beriman dari pengikut fir'aun itu berkata, 'wahai kaumku! sesungguhnya aku khawatir jika kamu membinasakan musa, kamu akan ditimpa bencana seperti hari kehancuran golongan yang ber-sekutu yang memusuhi para nabi dan rasul. 31. Yakni seperti kebiasaan kaum nuh yang ditenggelamkan banjir besar, kaum ad yang dibinasakan dengan angin topan yang sangat dingin, kaum Samud yang dimusnahkan dengan gempa bumi yang dahsyat, dan orang-orang atau umat yang datang setelah mereka. Padahal Allah tidak menghendaki terjadi kezaliman sedikit pun terhadap hamba-hamba-Nya. '."
  }
]