[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, sesungguhnya aku takut hukuman di Hari Kiamat akan menimpa kalian, di hari itu sebagian manusia berseru memanggil sebagian yang lain karena beratnya kengerian di hari itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Wahai kaumku! Sesungguhnya aku mengkhawatirkan kalian tentang hari Kiamat, hari ketika sebagian manusia memanggil sebagian lainnya karena adanya hubungan kekerabatan atau kedudukan, mereka menyangka bahwa cara ini berguna bagi mereka di tempat yang menakutkan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَيٰقَوْمِ إِنِّىٓ أَخَافُ عَلَيْكُمْ يَوْمَ التَّنَادِ (Hai kaumku, sesungguhnya aku khawatir terhadapmu akan siksaan hari panggil-memanggil) Yakni hari mereka saling memanggil dan meminta pertolongan, atau hari ketika para penghuni neraka memanggil para penghuni surga dan sebaliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. “Wahai kaumku aku sungguh khawatir kepada kalian jika hari kiamat nanti datang. Hari dimana orang-orang kafir saling memanggil satu sama lain untuk meminta pertolongan dan pembelaan atas segala kesulitan dan bencana pada hari itu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai kaumku sesungguhnya aku khawatir terhadap kalian tentang hari (dimana orang) saling memanggil} hari kiamat dimana orang saling memanggil satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. setelah ia mempertakuti mereka dengan azab-azab duniawi, maka ia pertakuti mereka dengan azab-azab duniawi, maka ia pertakuti pula dengan azab-azab akhirat seraya berakata, “hai kaumku, sesungguhnya aku khawatir terhadapmu akan siksaan hari panggil-memanggil,” maksudnya, hari kiamat saat penghuni surga memanggil- manggil para penghuni neraka. “\"Sesungguhnya kami dengan sebenarnya telah memperoleh apa yang Tuhan kami menjanjikannya kepada kami. Maka apakah kamu telah memperoleh dengan sebenarnya apa (azab) yang Tuhan kamu menjanjikannya (kepadamu)?\" Mereka (penduduk neraka) menjawab: \"Betul\". Kemudian seorang penyeru (malaikat) mengumumkan di antara kedua golongan itu: \"Kutukan Allah ditimpakan kepada orang-orang yang lalim,” (Al-A’rof : 44) “Dan penghuni neraka menyeru penghuni surga: \"Limpahkanlah kepada kami sedikit air atau makanan yang telah dirizekikan Allah kepadamu\". Mereka (penghuni surga) menjawab: \"Sesungguhnya Allah telah mengharamkan keduanya itu atas orang-orang kafir,” (Al-A’rof : 50) Dan Ketika ahli nereka menyeru malaikat “supaya memustuskan tuhanmu kepada kami” “sesungguhnya kalian adalah orang-orang yang mentap”, Dan ketika mereka menyeru tuhan mereka, ”ya rabb kami, keluarkalan kami darinya, (dan kembalikanlah kami ke dunia,) maka jika kami kembali (juga pada kekafiran), sesungguhnya kami adalah orang yang zhalim,” Dia (Allah) berfirman, ”tinggalah dengan hina di dalamnya, dan janganlah kamu berbicara dengan aku,” (al-mu’minun:107-108) Dan ketika dikatakan kepada kaum musyrikin, ”serulah olehmu sekutu-sekutu kamu,” lalu mereka menyerunya, maka sekutu-sekutu itu tidak memperkenankan (seruan) mereka.” (al-qashas :64)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 32: (Hai kaumku, sesungguhnya aku khawatir terhadap kalian akan siksa hari panggil-memanggil) dapat dibaca At-Tanaadi atau At-Tanaadiy dengan memakai huruf Ya pada akhirnya. Artinya ialah hari kiamat, yang pada hari itu banyak sekali panggilmemanggil antara ahli surga dan ahli neraka; setiap panggilan sesuai dengan apa yang dialami oleh pemanggilnya. Maka panggilan yang mengandung kebahagiaan adalah bagi ahli surga dan panggilan yang mengandung kecelakaan adalah bagi ahli neraka; selain itu masih banyak pula jenis panggilan atau seruan lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah dia menakut-nakuti mereka dengan hukuman di dunia, maka dia menakut-nakuti mereka dengan hukuman di akhirat. Hari kiamat disebut hari saling memanggil karena orang yang berkumpul di padang mahsyar sebagiannya memanggil sebagian yang lain untuk meminta tolong sebagaimana panggilan mereka kepada para nabi ulul ‘azmi untuk memberi syafaat. Ada pula yang berpendapat, bahwa ketika itu banyak panggilan penghuni surga kepada penghuni neraka dan sebaliknya (lihat surah Al A’raaf: 44-50), demikian pula seruan berbahagia untuk orang yang berhak mendapatkannya dan seruan kesengsaraan untuk orang yang berhak memperolehnya. Termasuk pula seruan penghuni neraka kepada malaikat Malik agar dia meminta kepada Allah agar Allah mematikan mereka (lihat Az Zukhruf: 77), dan perintah kepada orang-orang musyrik, “Serulah olehmu sekutu-sekutu kamu\", lalu mereka menyerunya, maka sekutu-sekutu itu tidak memperkenankan (seruan) mereka, dan mereka melihat azab. (Mereka ketika itu berkeinginan) sekiranya mereka dahulu menerima petunjuk.” (Terj. Al Qashash: 64)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 32",
    "description": "Orang yang beriman itu melanjutkan penjelasannya, 'dan sadarilah, wahai kaumku! sesungguhnya aku benar-benar khawatir terhadapmu akan siksaan yang akan diturunkan pada hari saling memanggil, yakni ketika setiap orang berteriak meminta tolong. 33. Yaitu pada hari ketika kalian berpaling lalu lari ke belakang guna menghindari siksa, dan ingatlah tidak ada seorang pun yang mampu menyelamatkan kalian dari azab Allah. Dan barang siapa yang memilih ke-sesatan, maka dia dibiarkan sesat oleh Allah, dan apabila seseorang telah dibiarkan sesat oleh Allah niscaya tidak ada sesuatu pun yang mampu memberi petunjuk keluar dari kesesatan itu. '."
  }
]