[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di hari dimana kalian berlarian tak tentu arah, kalian tidak memiliki pelindung dan penolong dari Allah yang bisa membantu kalian. Barangsiapa dibiarkan oleh Allah dan tidak dibimbing ke jalan lurus, maka tidak ada sesuatu pun yang membimbing yang menuntunnya ke jalan yang benar dan haq."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Hari di saat kalian berlari karena takut dari Neraka. Tidak ada seorang pun yang bisa melindungi kalian dari azab Allah. Barangsiapa Allah telantarkan, tidak Dia bimbing kepada iman, maka tidak ada yang bisa memberinya petunjuk, karena hidayah taufik hanya di tangan Allah semata.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. يَوْمَ تُوَلُّونَ مُدْبِرِينَ ((yaitu) hari (ketika) kamu (lari) berpaling ke belakang) Yakni mereka meninggalkan padang mahsyar menuju neraka, atau ketika mereka mencoba berlari dari neraka. مَا لَكُم مِّنَ اللهِ مِنْ عَاصِمٍ ۗ( tidak ada bagimu seorangpun yang menyelamatkan kamu dari (azab) Allah) Yang melindungi kalian dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Hari itu adalah hari dimana kalian lari menghindar karena ketakutan terhadap azab yang akan menimpa kalian. Tidak akan ada yang bisa menyelamatkan kalian dari azab Allah. Barangsiapa dijauhkan dari kebenaran atau dibiarkan dalam kesesatan, maka itulah seburuk-buruk pilihan baginya. Tidak akan ada sesuatu apapun yang dapat memberinya petunjuk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari (ketika) kalian dipalingkan} dikembalikan {dengan berbalik ke belakang} lari dari neraka {Tidak ada seorang pun penyelamat dari (azab) Allah} penjaga yang menjaga kalian dari azabNya {Siapa saja yang disesatkan oleh Allah maka tidak ada baginya seorang pemberi petunjuk pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. ia pun mempertakuti mereka, (semoga Allah meridhainya) akan hari yang sangat mengerikan ini dan ia merasa sangat prihatin terhadap mereka jika mereka tetap dalam kesyirikan. Maka dari itu ia berkata, ”hari ketika kamu berpaling, kebelakang,” maksudnya, hari itu telah menyeret kalian ke neraka, “tidak ada bagimu bseorangpun yang menyelamatkan kamu dari Allah,” dan tidak pula kekuatan dari diri kalian untuk menolak azab Allah dan tidak ada pula seorang pun yang bisa menolong kalian selain Dia. “pada hari ditampakkannya segala rahasia, maka sekali-kali tidak ada bagi manusia itu suatu kekuatan pun dan tidak (pula) seorang penolong,” (ath-thariq:9-10) “dan siapa yang disesatkan Allah, niscaya tidak ada baginya seorangpun yang akan memberi petunjuk,” sebab petunjuk itu ada di tangan Allah. Maka apabila Allah mencegah pertunjuk bagi seorang hamba karena Dia tahu bahwa ia tidak laik mendapat petunjuk karena kebusukannya, maka tidak ada jalan apapun untuk memberinya petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 33: (Yaitu hari ketika kalian lari berpaling ke belakang) dari tempat hisab untuk dibawa ke neraka (tidak ada bagi kalian dari Allah) yakni dari azab-Nya (seorang pun yang dapat menyelamatkan kalian) yakni yang dapat mencegah azab dari diri kalian (dan siapa yang disesatkan Allah, niscaya tidak ada baginya seorang pun yang akan memberi petunjuk.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena hidayah di Tangan Allah Subhaanahu wa Ta'aala. Jika Dia menghalangi hamba-Nya dari memperoleh hidayah karena Dia mengetahui bahwa ia tidak layak memperolehnya disebabkan keburukannya, maka tidak ada jalan untuk memberinya petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 33",
    "description": "Yaitu pada hari ketika kalian berpaling lalu lari ke belakang guna menghindari siksa, dan ingatlah tidak ada seorang pun yang mampu menyelamatkan kalian dari azab Allah. Dan barang siapa yang memilih ke-sesatan, maka dia dibiarkan sesat oleh Allah, dan apabila seseorang telah dibiarkan sesat oleh Allah niscaya tidak ada sesuatu pun yang mampu memberi petunjuk keluar dari kesesatan itu. '34. Dan sungguh ingatlah, bahwa sebelum masa kalian ini, nabi yusuf telah datang kepada leluhur kalian dengan membawa bukti-bukti yang nyata, tetapi kalian senantiasa meragukan apa yang dibawanya itu, bahkan ketika dia, nabi yusuf itu, wafat, kalian kemudian berkata, 'Allah tidak akan mengirim seorang rasul pun setelahnya, yakni setelah nabi yusuf tiada. ' demikianlah Allah membiarkan sesat orang yang telah memilih kesesatan dengan berperilaku melampaui batas dan ragu-ragu terhadap kebenaran."
  }
]