[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Allah telah mengutus kepada kalian seorang Nabi yang mulia, Yusuf bin Ya’qub sebelum Musa dengan membawa bukti-bukti yang jelas atas kebenarannya, dan dia memerintahkan kalian agar menyembah Allah semata, tidak ada sekutu bagiNya, namun kalian senantiasa dalam kebimbangan terhadap apa yang dia bawa dalam hidupnya, sehingga saat dia meninggal, semakin bertambahlah keragu-raguan dan kesyirikan kalian, dan kalian berkata, “Sesungguhnya Allah tidak akan mengutus seorang rasul sesudahnya.” Dengan kesesatan seperti itulah Allah menyesatkan setiap orang yang bertindak melampaui batas kebenaran, selalu dalam keraguan tentang keesaan Allah, sehingga Allah tidak memberinya taufik ke jalan hidayah lagi lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sungguh telah datang kepada kalian Yusuf sebelum Musa dengan membawa bukti-bukti yang nyata tentang tauhid Allah, namun kalian senantiasa dalam keraguan dan pendustaan terhadap apa yang dibawanya, hingga ketika dia wafat, kalian semakin bertambah ragu dan bimbang. Kalian berkata, “Allah tidak akan mengutus seorang rasul sesudahnya.” Seperti kesesatan kalian dari kebenaran, Allah menyesatkan setiap orang yang melebihi aturan-aturan Allah, meragukan keesaan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Sungguh sebelum Musa telah datang kepada kalian Nabi Yusuf dengan berbagai mukjizat yang menunjukkan kebenarannya; akan tetapi kalian tetap dalam keraguan seperti para nenek moyang kalian yang mendustakan risalahnya. Hingga ketika Nabi Yusuf meninggal, kalian berkata: “Allah tidak akan mengutus seorang rasul setelahnya.” Seperti kesesatan kalian itu Allah menyesatkan orang-orang zalim yang meragukan keesaan Allah dan membantah bukti-bukti yang jelas yang Allah turunkan, mereka membantah semua itu tanpa memiliki hujjah dan bukti dari Allah. Sungguh penentangan itu mendatangkan kemurkaan dari Allah dan orang-orang beriman. Demikianlah Allah menutup hati setiap orang yang berpaling dari kebenaran dan sangat zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَقَدْ جَآءَكُمْ يُوسُفُ مِن قَبْلُ بِالْبَيِّنٰتِ (Dan sesungguhnya telah datang Yusuf kepadamu dengan membawa keterangan-keterangan) Yakni Yusuf bin Ya’qub yang datang kepada mereka membawa mukjizat dan ayat-ayat yang jelas tentang agama Allah dan syari’at-syari’at-Nya sebelum kedatangan Musa kepada mereka. Yakni ketika Yusuf datang kepada nenek moyang kalian. فَمَا زِلْتُمْ فِى شَكٍّ مِّمَّا جَآءَكُم بِهِۦ ۖ( tetapi kamu senantiasa dalam keraguan tentang apa yang dibawanya kepadamu) Yakni keraguan terhadap ayat-ayat itu dan kalian tidak mengimaninya. حَتَّىٰٓ إِذَا هَلَكَ(hingga ketika dia meninggal) Yakni ketika Yusuf meninggal. قُلْتُمْ لَن يَبْعَثَ اللهُ مِنۢ بَعْدِهِۦ رَسُولًا ۚ( kamu berkata: “Allah tidak akan mengirim seorang (rasulpun) sesudahnya) Mereka kafir terhadapnya ketika Yusuf masih hidup dan mereka juga kafir terhadap rasul-rasul yang datang kepada mereka setelah kematian Yusuf. كَذٰلِكَ يُضِلُّ اللهُ مَنْ هُوَ مُسْرِفٌ مُّرْتَابٌ(Demikianlah Allah menyesatkan orang-orang yang melampaui batas dan ragu-ragu) Yakni orang yang banyak bermaksiat kepada Allah dan meragukan agama, keesaan, janji, dan ancaman-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dahulu, Nabi Yusuf bin Ya’qub AS benar-benar telah datang kepada pendahulu kalian wahai orang-orang Mesir. Mereka diutus sebelum Nabi Musa AS, namun kalian tetap meragukan kebenaran dan bukti yang telah disampaikan Nabi Yusuf kepada kalian, kalian pun tidak beriman kepadanya dengan sepenuh hati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh sebelum itu} sebelum Musa {Yusuf benar-benar telah datang kepada kalian dengan bukti-bukti nyata. Lalu kalian masih dalam keraguan} keraguan {terhadap apa yang datang kepada kalian sampai dia wafat} mati {kalian berkata,”Allah tidak akan mengirim seorang rasul pun setelahnya. Demikianlah Allah membiarkan sesat orang yang melampaui batas} melampaui batas ketentuan Allah {dan ragu-ragu”} ragu untuk mengesakanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Dan sungguh telah datang yusuf kepadamu”, yakni ,Yusuf bin Ya’kub, “sebelumnya” maksudnya sebelum kedatangan nabi Musa, dengan mukjizat-mukjizat yang membuktikan kebenarqannya, dan ia perintahkan kepada kalian untuk beribadah hanya kepada Allah, tanpa mempersekutukan-Nya. “tetapi kamu senantiasa dalam keraguan tentang apa yang dibawanya kepadamu” pada masa hidupnya, “sehingga ketika dia telah meninggal”, kalian bertambah ragu dan makkin berbuat syirik. “kamu berkata ‘Allah tidak akan mengirimkan seseorang rosul pun sesudhnya”. Itulah dugaan palsu kalian dan perkiraan kalian yang sesungguhnya sangat tidak laik bagi Allah. Sebab Allah tidak akan membiarkan manusia ini sia-sia; tidak memerintahkan mereka dan tidak melarang mereka. Tetapi Allah mengutus Rosul-rosulNya kepada mereka. Maka dugaan bahwa Allah tidak akan mengutus seorang rosul adalah dugaan sesat, maka dari itu Dia berfirman, “Demikianlah Allah menyesatkan orang-orang yang melampaui batas dan ragu-ragu”. Itulah karakter mereka yang sesungguhnya, yang telah membuat mereka berlaku zhalim dan congkak terhadap Nabi Musa. Maka mereka adalah orang-orang yang berlebih-lebihan karena telah melampaui batas kebenaran dan berpaling darinya menuju kesesatan. Mereka adalah para pendusta di mana mereka menisbatkan semua itu kepada Allah dan mendustkan para rosulNya. Jadi orang yang karakternya melampaui batas dan dusta, di mana keduanya tidak pernah terlepas darinya adalah orang-orang yang tidak akan diberi hidayah oleh Allah dan tidak dibimbing kepada kebaikan. Sebab ia telah menolak kebenaran setelah kebenaran itu sampai kepadanya dan setelah ia ketahui. Maka balasannya adalah, Allah menghukumnya dengan menghalangi hidayah darinya, sebagaimana FirmanNya, “Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka;” (As-Shaf : 5) “Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Qur'an) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.” (Al-An’am : 110) “dan Allah tidak memberi petunjuk kepada orang-orang yang lalim.” (Al-baqoroh : 258)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 34: (Dan sesungguhnya telah datang Yusuf kepada kalian sebelumnya) yakni sebelum Nabi Musa; menurut suatu pendapat ia adalah Yusuf bin Yakub yang usianya dipanjangkan sampai zaman Nabi Musa; atau menurut pendapat yang lain dia adalah Yusuf bin Ibrahim bin Yusuf bin Nabi Yakub (dengan membawa keterangan-keterangan) mukjizat-mukjizat yang tampak jelas (tetapi kalian senantiasa dalam keraguan tentang apa yang dibawanya kepada kalian, sehingga ketika dia meninggal, kalian berkata,) tanpa memakai bukti yang benar lagi (\"Allah tidak akan mengirim seorang rasul pun sesudahnya.\") selagi kalian masih tetap dalam keadaan kafir atau ingkar kepada Nabi Yusuf dan rasul-rasul lainnya. (Demikianlah) maksudnya sebagaimana kalian disesatkan (Allah menyesatkan orang yang melampaui batas) yakni orang yang musyrik (lagi ragu-ragu) artinya, tidak percaya kepada mukjizat-mukjizat yang telah disaksikannya sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Yusuf bin Ya’qub ‘alaihimas salam. Wahai penduduk Mesir. Yang menunjukkan kebenarannya dan memerintahkan kamu untuk beribadah kepada-Nya. Semasa hidupnya. Nabi Yusuf ‘alaihis salam ketika itu menjabat sebagai bendaharawan Mesir sekaligus sebagai rasul yang mengajak umatnya kepada Allah, namun mereka tidak menaatinya kecuali karena Beliau sebagai pemerintah dan karena mereka menginginkan kedudukan duniawi darinya. Keraguan dan kesyirkkanmu bertambah. Inilah anggapan kamu yang batil dan sangkaan yang tidak layak bagi Allah Subhaanahu wa Ta'aala, karena Allah Subhaanahu wa Ta'aala tidaklah meninggalkan begitu saja makhluk ciptaan-Nya, tidak memerintah dan tidak melarang serta tidak mengirimkan utusan-Nya. Oleh karena itu, anggapan bahwa Allah tidak akan mengirim seorang rasul adalah anggapan yang sesat. Oleh karenanya dalam lanjutan ayatnya, Allah Subhaanahu wa Ta'aala berfirman, “Demikianlah Allah membiarkan sesat orang yang melampaui batas dan ragu-ragu.” Inilah sifat mereka yang hakiki, namun mereka lemparkan kepada Nabi Musa ‘alaihis salam secara zalim dan sombong. Merekalah orang-orang yang melampaui batas dari hak kepada kesesatan, di samping mereka juga sebagai pendusta karena menisbatkan hal itu kepada Allah dan mendustakan rasul-Nya. Orang yang memiliki sifat melampaui batas dan ragu-ragu dan tidak dapat dilepasnya, maka Allah tidak akan memberinya petunjuk dan tidak memberinya taufiq kepada kebaikan, karena ia menolak yang hak setelah mengetahuinya, maka balasannya adalah Allah hukum dengan tidak diberi-Nya hidayah sebagaimana firman Allah Ta’ala, “Maka ketika mereka berpaling (dari kebenaran), Allah memalingkan hati mereka; dan Allah tidak memberi petunjuk kepada kaum yang fasik.” (Terj. Ash Shaff: 5)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 34",
    "description": "Dan sungguh ingatlah, bahwa sebelum masa kalian ini, nabi yusuf telah datang kepada leluhur kalian dengan membawa bukti-bukti yang nyata, tetapi kalian senantiasa meragukan apa yang dibawanya itu, bahkan ketika dia, nabi yusuf itu, wafat, kalian kemudian berkata, 'Allah tidak akan mengirim seorang rasul pun setelahnya, yakni setelah nabi yusuf tiada. ' demikianlah Allah membiarkan sesat orang yang telah memilih kesesatan dengan berperilaku melampaui batas dan ragu-ragu terhadap kebenaran. 35. Yaitu orang-orang yang selalu memperdebatkan kebenaran ayat-ayat Allah yang sudah sangat jelas kebenarannya itu tanpa alasan dan bukti-bukti yang kuat dan nyata yang sampai kepada mereka. Sangat besar kemurkaan bagi mereka di sisi Allah dan juga di sisi orang-orang yang ber-iman. Demikianlah Allah mengunci mati hati setiap orang yang sombong dan juga mengunci mati hati setiap orang yang berlaku sewenang-wenang."
  }
]