[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendebat ayat-ayat Allah dan hujjah-hujjahNya untuk menolaknya dengan tanpa memiliki hujjah-hujjah yang bisa diterima, perdebatan tersebut benar-benar besar dosanya sehingga itu mendatangkan murka Allah dan orang-orang yang beriman, sebagaimana Allah mengunci hati orang-orang yang mendebat itu dengan kesesatan dan Dia telah menutup dari hidayah, Allah juga menutup hati orang-orang yang menyombongkan diri sehingga menolak mentauhidkanNya dan menaatiNya, angkuh dengan banyak melakukan kezhaliman dan permusuhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Orang-orang yang membantah ayat-ayat Allah agar bisa membatalkannya tanpa hujah dan bukti yang mereka punya. Pembantahan mereka itu sungguh besar dosanya di sisi Allah dan sisi orang-orang yang beriman kepada Allah dan kepada rasul-rasul-Nya. Sebagaimana Allah menutup hati orang-orang yang membantah ayat-ayat Kami untuk membatalkannya, maka Allah menutup hati setiap orang yang menyombongkan diri dari kebenaran dan angkuh di depannya, sehingga dia tidak mengetahui jalan menuju kebenaran dan tidak terbimbing kepada kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. الَّذِينَ يُجٰدِلُونَ فِىٓ ءَايٰتِ اللهِ بِغَيْرِ سُلْطٰنٍ أَتَىٰهُمْ ۖ ((Yaitu) orang-orang yang memperdebatkan ayat-ayat Allah tanpa alasan yang sampai kepada mereka) Yakni mereka memperdebatkan ayat-ayat Allah untuk menghancurkannya, padahal mereka tidak memiliki hujjah dan dalil yang jelas. كَبُرَ مَقْتًا عِندَ اللهِ وَعِندَ الَّذِينَ ءَامَنُوا۟ ۚ( Amat besar kemurkaan (bagi mereka) di sisi Allah dan di sisi orang-orang yang beriman) Yakni sungguh perdebatan mereka itu sangat membuat Allah dan orang-orang beriman murka, sebab perdebatan mereka tidak berlandaskan pada asas yang benar dan mereka mengemukakannya demi menghancurkan dakwah kepada Allah serta menjadikan orang yang akan beriman menjadi ragu. كَذٰلِكَ يَطْبَعُ اللهُ عَلَىٰ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ(Demikianlah Allah mengunci mati hati orang yang sombong dan sewenang-wenang) Yakni sebagaimana Allah mengunci hati orang-orang yang memperdebatkan ayat-ayat Allah, demikian pula Allah mengunci hati setiap orang yang sombong dan semena-mena."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. (yaitu) Orang-orang yang memperdebatkan ayat-ayat Allah yang telah diturunkan kepada mereka untuk menyalahkannya tanpa alasan dan dasar yang jelas. Mereka mebesar-besarkan perdebatan mereka dengan penuh kebencian. Kemurkaan Allah dan kemurkaan orang mukmin sangat besar kepada mereka. Al muqtu adalah kemarahan yang sangat besar, karena mereka telah memperdebatkan Al-quran dengan buruk dan penuh kesombongan. Seperti Allah telah menutup hati orang-orang yang memperdebatkan ayat-ayat Allah itu, begitu juga Allah telah menutup hati orang-orang yang menyombongkan diri dan angkuh sebagi hukuman bagi mereka. Ketika hati telah sombong maka sombonglah seluruh anggota badannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang berdebat} yang berbantah-bantahan {tentang ayat-ayat Allah tanpa alasan} dalil dan bukti {yang sampai kepada mereka, sangat besar kemurkaan di sisi Allah dan di sisi orang-orang yang beriman. Demikianlah Allah mengunci} mengunci {hati setiap orang yang sombong lagi sewenang-wenang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. kemudian Allah menyebutkan sifat orang yang melampaui batas lagi pendusta, seraya berfirman “orang yang memperdebatkan ayat-ayat Allah” yang menjelaskan kebenaran dari kebatilan, yang karena sangat jelas ayat-ayat itu hingga laksana mentari bagi pandangan mata, mereka memperdebatkannya sekalipun ayat-ayat itu sudah sangat jelas sekali, agar mereka bisa menolak dan membatalkannya. “tanpa alasan yang sampai kepada mereka”. Maksudnya, tanpa argument dan alasan yang benar. Ini adalah karakter pokok setiap orang yang memperdebatkan ayat-ayat Allah, sebab, mustahil ia akan bisa berdebat berdasarkan argument, sebab kebenaran itu tidak bisa ditentang oleh siapa pun. Maka ia sama sekali tidak memungkinkan menolaknya dengan dalil syar’I atau ‘aqli. “amat besar” ucapan yang mengandung penolakan terhadap kebenaran dengan batil itu, dan merupakan “kemurkaan di sisi Allah dan di sisi orang-orang yang beriman”. Jadi, Allah sangat murka terhadap pengucapannya, sebab ucapannya mengandung pendustaan terhadap kebenaran dan membenarkan kebatilan serta menisbatkannya kepada Allah. Ini semua adalah perkara-perkara yang membuat Allah sangat murka kepadanya dan kepada siapa saja yang berkarakterkan demikian. Dan demikian pula hamba-hambaNya yang beriman sangat membenci perbuatan tersebut dengan sebenci-bencinya, sejalan dengan Tuhan mereka. Mereka adalah manusia-manusia pilihan Allah. Dan kebencian mereka adalah bukti atas kekejian orang yang mereka benci. “Demikianlah” sebagaimana Allah mengunci mati hati keluarga fir’aun, maka “Allah mengunci mati setiap hati yang sombong dan sewenang-wenang”. Yang menyombongkan diri terhadap kebenaran dan menolaknya dan terhadap manusia dengan meremehkan mereka: sewenang-wenang dengan banyak berbuat kezhaliman dan jahat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 35: (Orang-orang yang memperdebatkan ayat-ayat Allah) yaitu mukjizat-mukjizatnya; kalimat ayat ini menjadi Mubtada (tanpa alasan) tanpa argumentasi (yang datang kepada mereka. Amat besar) dosa perdebatan mereka itu, lafal Kabura ini menjadi Khabar dari Mubtada (kemurkaan -bagi mereka- di sisi Allah dan di sisi orang-orang yang beriman. Demikianlah) sebagaimana disesatkan-Nya mereka (Allah mengunci mati) artinya, menyesatkan (hati setiap orang yang sombong lagi sewenang-wenang) dapat dibaca Qalbin Mutakabbirin atau Qalbi Mutakabbirin. Manakala kalbu seseorang merasa sombong, maka takaburlah pemiliknya, dan demikian pula sebaliknya. Lafal Kullun menurut dua qiraat di atas menunjukkan makna tiap-tiap orang yang memiliki kalbu yang sesat, jadi bukan ditujukan kepada semua orang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sifat orang yang melampaui batas lagi ragu-ragu. Ayat-ayat itu menerangkan mana yang hak dan mana yang batil, dimana karena begitu terangnya sebagaimana, ia ibarat matahari bagi penglihatan, namun mereka malah memperdebatkannya -padahal begitu jelas- untuk membatalkannya. Maksudnya mereka menolak ayat-ayat Allah tanpa hujjah dan alasan yang datang kepada mereka. Seperti inilah sifat pada orang-orang yang memperdebatkan ayat-ayat Allah, karena termasuk mustahil ayat-ayat Allah didebat dengan hujjah, karena kebenaran tidak mungkin ditentang dengan dalil naqli maupun ‘aqli, bahkan dalil naqli dan ‘aqli malah mendukungnya. Yaitu perkataan yang isinya menolak yang hak dengan yang batil. Namun Allah Subhaanahu wa Ta'aala lebih murka lagi kepada pelakunya, karena perkataan itu mengandung pendustaan kepada yang hak, pembenaran yang batil dan menisbatkan hal itu kepada Allah. Perkara ini merupakan perkara yang sangat dimurkai Allah demikian pula pelakunya, bahkan orang-orang mukmin juga murka terhadapnya karena Allah. Murkanya Allah dan kaum mukmin menunjukkan buruknya perkara itu dan orang yang melakukannya. Sebagaimana Fir’aun dan bala tentaranya dikunci hatinya. Terhadap kebenaran dengan menolaknya, dan sombong kepada manusia dengan menghinanya. Dengan banyak berbuat zalim dan aniaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 35",
    "description": "Yaitu orang-orang yang selalu memperdebatkan kebenaran ayat-ayat Allah yang sudah sangat jelas kebenarannya itu tanpa alasan dan bukti-bukti yang kuat dan nyata yang sampai kepada mereka. Sangat besar kemurkaan bagi mereka di sisi Allah dan juga di sisi orang-orang yang ber-iman. Demikianlah Allah mengunci mati hati setiap orang yang sombong dan juga mengunci mati hati setiap orang yang berlaku sewenang-wenang. 36. Dan fir'aun berkata kepada salah seorang menterinya bernama haman, 'wahai haman! buatkanlah untukku sebuah bangunan yang tinggi yang dapat terlihat oleh semua orang dan agar aku dapat naik sampai ke pintu-pintu langit."
  }
]