[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-37. Fir’aun berkata mendustakan dakwah Musa untuk mengakui ketuhanan tuhan alam semesta dan berserah diri kepadaNya, “Wahai Haman, dirikanlah untukku sebuah bangunan yang tinggi, yang bisa menyampaikanku kepada pintu-pintu langit sehingga aku ingin melihat sendiri Tuhan Musa. Sesungguhnya aku menyangka Musa telah berdusta dalam kata-katanya bahwa kita memiliki Tuhan dan bahwa Tuhan itu di atas langit.” Demikianlah perbuatan Fir’aun yang buruk itu dijadikan indah sehingga dia pun melihatnya baik, maka dia terhalangi dari jalan kebenaran disebabkan kebatilan yang dihiasi untuknya. Taktik yang digunakan oleh Fir’aun untuk mengelabuhi manusia bahwa dirinya berada di pihak yang benar dan bahwa Musa adalah pihak yang salah, hanya kerugian dan kesia-siaan; tidak bermanfaat sama sekali selain hanya menambah kesengsaraan baginya di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Fir'aun berkata kepada perdana menterinya Hāmān, “Wahai Hāmān! Buatkanlah untukku satu bangunan yang tinggi, aku ingin sampai ke jalan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Fir’aun berkata kepada Haman dengan penuh keangkuhan: “Hai Haman, dirikanlah bagiku istana yang tinggi agar aku dapat sampai ke jalan menuju langit, sehingga aku dapat melihat Tuhannya Musa; dan aku sangat yakin Musa telah berdusta dalam perkataannya.” Demikianlah setan menghiasi amalan Fir’aun yang batilnya itu agar dia menganggapnya sebagai perbuatan yang benar dan agar dia tidak dapat menemukan jalan yang benar. Dan tipu daya Fir’aun hanya menghasilkan kebinasaan dan kerugian baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَقَالَ فِرْعَوْنُ يٰهٰمٰنُ ابْنِ لِى صَرْحًا (Dan berkatalah Fir’aun: “Hai Haman, buatkanlah bagiku sebuah bangunan yang tinggi) Yakni istana yang tinggi dan megah. لَّعَلِّىٓ أَبْلُغُ الْأَسْبٰبَ(supaya aku sampai ke pintu-pintu) Yakni jalan-jalan langit. Dan Qatadah mengatakan maknanya adalah pintu-pintu langit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Fir’aun (penguasa Mesir) berkata: Wahai Haman (menteri Fir’aun) bangunkan untukku kastil (qashir bangunan yang tinggi) yang kuat dan kokoh. Supaya aku bisa sampai pada pintu-pintu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Fir‘aun berkata,“Hai Haman, buatkanlah untukku sebuah bangunan tinggi} bangunan tinggi {agar aku sampai ke pintu-pintu} jalan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. “dan berkatalah Firaun” seraya menetang nabi Musa daqn mendiustkan dakwah beliau untuk beriman kepada robbul ‘alamin yang bersemayam di Arasy dan maha tinggi di atas makhlukNya. “Hai Haman, buatkanlah bagikku senuah bangunan yang tinggi.” Maksudnya, sebuah bangunan raksasa yang tinggi. Tujuannya adalah agar aku bisa melihat “Tuhannya Musa dan sesungguhnya aku memandangnya seorang pendusta” dalam dakwahnya bahwa kita mempunyai Rabb, dan bahwa Rabb itu di atas langit sana. Firaun sebenarnya hanya ingin mewaspadai dan menguji permasalahan secara langsung. Allah berfirman dalam menjelaskan apa yang menyeret Firaun mengucapkan perkataan tersebut, “Demikianlah dijadikan Firaun memandang baik perbuatan yang buruk itu”. Dihiasi baginya agar dia memandang baik perbuatan jahat itu, dan setan pun terus memperindahnya, menyerukannya dan menghiasinya, hingga Firaun melihatnya indah lalu menyerukannya dan melakukan perdebatan seolah-oleh perdebatan orang yang berbuat kebenaran, padahal ia sebenarnya adalah pembuat kerusakan terbesar, “Dan dia dihalangi dari jalan” kebenaran disebabkan kebatilan yang dihiaskan kepadanya. “dan tidaklah tipu daya Firaun itu”, yaitu yang ia maksudkan untuk memberangus kebenaran dan mengelabui manusia dia adalah yang benar sedangkan Nabi Musa adalah yang berbuat kebatilan, “kecuali membawa kerugian”, maksudnya kegagalan dan sia-sia, tidak menguntungkannya sama sekali. Melainkan kesengsaraan baginya dan bagi orang yang mengikutinya di dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 36: (Dan berkatalah Firaun, \"Hai Haman! Buatkanlah bagiku sebuah bangunan yang tinggi) bangunan pencakar langit (supaya aku sampai ke pintu-pintu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil menentang Musa dan mendustakan dakwah Beliau agar mengakui Allah Rabbul ‘alamin yang bersemayam di atas ‘Arsyi-Nya dan berada di atas semua makhluk-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 36",
    "description": "Dan fir'aun berkata kepada salah seorang menterinya bernama haman, 'wahai haman! buatkanlah untukku sebuah bangunan yang tinggi yang dapat terlihat oleh semua orang dan agar aku dapat naik sampai ke pintu-pintu langit. 37. Yaitu pintu-pintu langit yang tinggi, agar aku dapat melihat tuhan yang dipercayai dan diajarkan oleh musa, tetapi aku tetap memandang-Nya sebagai seorang pendusta tentang apa yang diajarkannya. ' dan demikianlah kondisi fir'aun, dimana kesombongan dan kedurhakaannya dijadikan terasa indah bagi fir'aun akan perbuatan buruknya itu, dan dia tertutup dari jalan yang benar; dan tipu daya fir'aun untuk memadamkan cahaya kebenaran itu tidak lain hanyalah membawa kerugian dan kebinasaan bagi dirinya."
  }
]