[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang beriman itu mengulangi nasihatnya kepada kaumnya, “Wahai kaumku ikutilah aku, niscaya aku akan menunjukkan kalian jalan yang lurus dan benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Laki-laki yang beriman dari kalangan kaum Fir'aun menasihati kaumnya, menunjukkan kepada mereka jalan yang benar, “Wahai kaumku! Ikutilah aku, niscaya aku membimbing dan menunjukkan kalian ke jalan yang benar, hidayah kepada kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-40. Orang yang mengimani kebenaran dari kaum Fir’aun itu menegaskan nasehatnya dengan panggilan kekerabatan: “Hai kaumku, ikutilah aku karena akau dapat menunjukkan kalian jalan yang benar. Hai kaumku, kehidupan dunia ini hanyalah kenikmatan yang fana; sedangkan akhirat adalah kehidupan yang kekal. Barangsiapa yang berbuat kemaksiatan di dunia maka dia akan mendapat balasannya sesuai dengan kadar kemaksiatannya itu sebagai bentuk keadilan dari Allah. Dan barangsiapa yang beramal shalih, baik dia seorang laki-laki maupun perempuan dan dia beriman kepada Allah dan para rasul; maka dia merupakan orang yang memiliki derajat yang tinggi, dia akan memasuki surga sebagai bentuk karunia dari Allah; dia akan mendapat rezeki yang mulia tanpa batas.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَقَالَ الَّذِىٓ ءَامَنَ يٰقَوْمِ اتَّبِعُونِ أَهْدِكُمْ سَبِيلَ الرَّشَادِ (Orang yang beriman itu berkata: “Hai kaumku, ikutilah aku, aku akan menunjukkan kepadamu jalan yang benar) Yakni ikutilah aku dalam agama ini, jika kalian melakukan ini niscaya kalian akan mengetahui jalan yang mengantarkan kepada kebenaran yang sesungguhnya, dan orang yang melaluinya akan selamat, dan ini adalah jalan surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Seorang mukmin dari kerabat Fir’aun juga berkata: “Wahai kaumku, ikutilah perkataan/petunjukku, dan lakukanlah apa yang telah aku nasihatkan kepadamu. Aku telah menunjukkanmu kepada jalan kebenaran, bukan kesesatan, juga jalan keberuntungan dan keselamatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang yang beriman itu berkata,“Wahai kaumku, ikutilah aku. Aku akan menunjukkan kepada kalian jalan yang benar} Aku akan membimbing kalian menuju jalan petunjuk dan jalan yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. “Orang yang beriman itu berkata” mengulangi nasihatnya kepada kaumnya, “Hai Kaumku, ikutilah aku, aku akan menunjukan kepadamu jalan yang benar”, tidak seperti yang dikatakan kepada kalian oleh Firaun, sebab dia tidak menunjukan kepada kalian keculai jalan kesesatan dan kerusakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 38: (Orang yang beriman itu berkata, \"Hai kaumku! Ikutilah aku) dapat dibaca Ittabi'uuni atau Ittabi'uuniy tanpa atau dengan Ya Mutakallim (aku akan menunjukkan kepada kalian jalan yang benar) penafsirannya sebagaimana yang telah lalu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengulangi nasihatnya kepada kaumnya. Tidak seperti yang dikatakan Fir’aun kepada kamu, maka sesungguhnya dia tidak menunjukkan kepadamu selain kesesatan dan kesengsaraan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 38",
    "description": "Dan orang yang beriman yang menyembunyikan keimanan di hadap-an fir'aun itu berkata, 'wahai kaumku! ikutilah aku dengan sungguh-sungguh, niscaya aku nanti akan menunjukkan kepada kalian jalan yang benar yang diridai Allah. 39. Wahai kaumku! sesungguhnya kehidupan dunia yang fana ini hanyalah kesenangan sementara yang mudah didapat dan mudah pula lenyap, dan sesungguhnya akhirat itulah negeri yang tidak akan pernah lenyap dan kekal selama-lamanya. '."
  }
]