[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, sesungguhnya kehidupan dunia ini adalah kenikmatan sesaat bagi manusia, kemudian setelah itu terputus habis, maka janganlah kalian condong kepadanya. Sesungguhnya alam akhirat dengan segala kenikmatannya yang langgeng adalah tempat tinggal di mana kalian akan menetap selamanya di sana. Maka hendaklah kalian mendahulukannya dan beramal untuknya dengan amal-amal shalih yang membuat kalian berbahagia di sana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Wahai kaumku! Sesungguhnya kehidupan dunia ini hanyalah kesenangan dan kenikmatan yang sementara, kalian jangan sampai tertipu oleh kesenangan yang sirna. Sesungguhnya alam Akhirat dengan kenikmatannya yang abadi, yang tidak terputus adalah alam keabadian dan tempat tinggal sebenarnya, karena itu beramallah untuknya dengan menaati Allah, dan waspadailah kesibukan hidup duniawi yang melalaikan kalian dari amal untuk Akhirat ."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. يٰقَوْمِ إِنَّمَا هٰذِهِ الْحَيَوٰةُ الدُّنْيَا مَتٰعٌ (Hai kaumku, sesungguhnya kehidupan dunia ini hanyalah kesenangan (sementara)) Yakni kenikmatan di dunia ini akan diberikan sebentar saja, kemudian akan berhenti dan sirna. وَإِنَّ الْاٰخِرَةَ هِىَ دَارُ الْقَرَارِ (dan sesungguhnya akhirat itulah negeri yang kekal) Karena akan berlangsung selamanya dan terus menerus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. “Wahai kaumku, sesungguhnya kehidupan dunia ini hanyalah kenikmatan sementara yang akan lenyap, adapun akhirat adalah tempat yang kekal dan abadi selamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai kaumku sesungguhnya kehidupan dunia ini hanyalah kesenangan} kesenangan yang sederhana kemudian menghilang {dan sesungguhnya akhirat itulah negeri yang kekal} yang tetap dan kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. “hai kaumku, sesungguhnya kehidupan ini hanyalah kesenangan sementara,” disenangi dan dinikmati hanya sebentar saja, lalu terputus dan sirna. Maka janganlah kalian tertipu atau terpedaya dari tujuan kalian diciptakan. “Dan sesungguhnya akhirat itulah negeri yang kekal”. Yang menjadi tempat tinggal, tempay kedamaian, dan tempat ketentraman. Maka hendaknya kalian mengutamakannya dan melakukan amalan untuknya yang dapat membuat kalian bahagia di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 39: (Hai kaumku, sesungguhnya kehidupan dunia ini hanyalah kesenangan -sementara-) kesenangan yang bersifat sementara lenyap (dan sesungguhnya akhirat itulah negeri yang kekal.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, janganlah kamu tertipu sehingga kamu lupa terhadap tujuan kamu diciptakan. Oleh karena itu, seharusnya kamu mengutamakannya dan mencari jalan agar kamu dapat bahagia di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 39",
    "description": "Wahai kaumku! sesungguhnya kehidupan dunia yang fana ini hanyalah kesenangan sementara yang mudah didapat dan mudah pula lenyap, dan sesungguhnya akhirat itulah negeri yang tidak akan pernah lenyap dan kekal selama-lamanya. '40. Dialog yang terjadi antara fir'aun dengan salah seorang kaumnya yang beriman secara sembunyi-sembunyi itu, memberi pesan kuat tentang perbuatan baik dan perbuatan jahat. Oleh sebab itu, renungkanlah bahwa barang siapa mengerjakan perbuatan jahat dan berbuat kebinasaan di muka bumi, maka dia akan dibalas sebanding dengan kejahatan itu. Dan barang siapa mengerjakan kebajikan dan beramal saleh, baik laki-laki maupun perempuan sedangkan dia dalam keadaan beriman dengan sungguh-sungguh, maka mereka akan masuk ke dalam surga atas anugerah Allah, dan mereka diberi rezeki di dalamnya dengan nikmat tidak terhingga."
  }
]