[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tiada yang menentang ayat-ayat al-Qur’an dan dalil-dalilnya yang menetapkan keesaan Allah dan menyikapinya dengan kebatilan, kecuali orang-orang yang ingkar yang mengingkari bahwa Allah adalah Tuhan Yang Haq yang berhak untuk disembah. Maka janganlah kamu (wahai Rasul) terperdaya oleh hilir mudik mereka di berbagai negeri dengan berbagai macam perniagaan dan mata pencaharian, kenikmatan dan perhiasan dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Tidaklah mendebat ayat-ayat Allah yang menunjukkan keesaan-Nya dan kebenaran para rasul-Nya kecuali orang-orang yang kafir kepada Allah karena akal mereka memang rusak. Maka kamu tidak usah bersedih terhadap mereka, jangan tertipu oleh apa yang mereka dapatkan berupa rezeki dan kenikmatan, karena penangguhan terhadap mereka adalah istidraj dan makar terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Tidaklah ada yang menentang ayat-ayat al-Qur’an untuk menyebarkan keraguan dan pendustaan terhadapnya kecuali orang-orang yang mengingkari keesaan Allah. Hai orang beriman, janganlah tingkah laku dan kehidupan mereka yang penuh dengan kenikmatan dunia membuatmu tertipu. Sebelum orang-orang kafir itu, umat-umat terdahulu telah melakukan pendustaan; seperti kaum Nabi Nuh dan umat-umat setelahnya yang mendustakan para Rasul, seperti kaum ‘Aad, Tsamud, kaum Nabi Luth, dan lainnya. Setiap umat itu berusaha membunuh dan menyiksa rasul mereka; dan mereka menentang para rasul dengan menyebar kebatilan dan kedustaan, agar mereka dapat melawan kebenaran dari Allah. Maka Aku membinasakan mereka dengan azab, dan lihatlah bagaimana azab-Ku bagi mereka ketika itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. مَا يُجٰدِلُ فِىٓ ءَايٰتِ اللهِ إِلَّا الَّذِينَ كَفَرُوا۟ (Tidak ada yang memperdebatkan tentang ayat-ayat Allah, kecuali orang-orang yang kafir) Yakni tidak ada yang berusaha menentang ayat-ayat Allah dan mendustakannya melainkan hanya orang-orang yang kafir. Yang dimaksud di sini adalah perdebatan yang batil yang bertujuan untuk melawan kebenaran. Adapun perdebatan yang bertujuan untuk menjelaskan kebenaran dan mengembalikan orang-orang yang tersesat kepada kebenaran, maka itu termasuk amalan besar yang dapat mendekatkan kepada Allah. Allah berfirman: ولا تجادلوا إلا بالتي هي أحسن “Dan janganlah kamu berdebat denganAhli Kitab, melainkan dengan cara yang paling baik.” (Al-'Ankabut: 46) فَلَا يَغْرُرْكَ تَقَلُّبُهُمْ فِى الْبِلٰدِ(Karena itu janganlah pulang balik mereka dengan bebas dari suatu kota ke kota yang lain memperdayakan kamu) Allah melarang Rasulullah untuk terperdaya dengan kesuksesan duniawi mereka, seperti perniagaan ke negeri-negeri lain dan keuntungan yang didapat darinya, dan harta yang dapat mereka kumpulkan; sebab mereka sebentar lagi akan disiksa, meskipun mereka kini ditangguhkan namun mereka tidak diloloskan dari siksaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Tidak ada yang memperdebatkan ayat Al-quran untuk menghilangkan dan menghapuskannya kecuali orang-orang kafir dan musyrik. Maka dari itu jangan engkau tertipu dengan keberhasilan mereka di seluruh negeri dalam perdagangan dan keuntungan, mengumpulkan harta dan berbagai kemuliaan dunia, maka sesungguhnya azab bagi mereka akan segera mereka terima. Abu Malik berkata: ayat ini turun untuk Harits bin Qais As-sahmi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada yang memperdebatkan} berbantah-bantahan {tentang ayat-ayat Allah, kecuali orang-orang yang ingkar. Maka jangan sampai menipumu} maka jangan sampai menipumu {perputaran perjalanan mereka di seluruh negeri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah mengabarkan bahwa tidak ada yang memperdebatkan ayat-ayatNya selain oang-oang kafir. Yang dimaksud mempedebatkan disini adalah pedebatan untuk menolak ayat-ayat Allah dan meresponnya dengan cara yang tidak benar. Inilah bagian dari perrilaku orang-orang kafir. Adapun orang-orang yang beriman, mereka tunduk kepada kebenaran dan dengannya mereka mencapakkan kebatilan. Maka hendaknya seseorang tidak terpedaya oleh kondisi duniawi seseorang, dan hendaknya ia tidak mengira bahwa pemberian Allah yang dilimpahkan kepadanya di dunia ini adalah sebagai bukti atas cinta Allah kepadanya, dan bahwa dia berada dalam kebenaran! Maka dari itu Allah berfirman, “karena itu janganlah pulang balik mereka dengan bebas dari suatu kota ke kota yang lain memperdayakan kamu.” Maksudnya, pulang pergi mereka di negeri ini dengan berbagai bentuk perniagaan dan usaha bisnis. Malah yang wajib atas semua orang adalah menilai orang lain dari sisi kebenarannya dan melihat kepada nilai-nilai syariat dan denganya ia menilai manusia, jangan menilai kebenaran dengan manusia sebagaimana yang dilakukan oleh orang-orang yang tidak berilmu dan tidak berakal!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 4: (Tidak ada yang memperdebatkan tentang ayat-ayat Allah) yakni Alquran (kecuali orang-orang yang kafir) dari kalangan penduduk kota Mekah. (Karena itu janganlah mereka pulang-balik dengan bebas dari suatu kota ke kota yang lain memperdayakan kamu) mereka pulang balik untuk mencari penghidupan dalam keadaan selamat, janganlah hal itu membuatmu teperdaya, karena sesungguhnya akibat dan tempat kembali mereka adalah neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitakan bahwa tidak ada yang mendebat tentang ayat-ayat-Nya kecuali orang-orang yang kafir. Maksud mendebat di sini adalah mendebat dengan maksud menolak ayat-ayat Allah, menghadapinya dengan kebatilan, dimana hal ini termasuk perbuatan orang-orang kafir. Berbeda dengan orang-orang mukmin, mereka tunduk kepada Allah Subhaanahu wa Ta'aala yang menurunkan kebenaran untuk mengalahkan yang batil. Demikian pula tidak sepatutnya bagi seseorang tertipu dengan keadaan duniawi seseorang, dan mengira bahwa pemberian Allah kepadanya dalam hal dunia menunjukkan kecintaan-Nya kepadanya dan bahwa dia berada di atas yang benar. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Karena itu jangan engkau (Muhammad) tertipu oleh keberhasilan usaha mereka di seluruh negeri.” Oleh karena itu yang wajib bagi seorang hamba adalah mengukur manusia dengan kebenaran, melihat kepada hakikat syar’i, dan menimbang manusia dengannya, dan tidak menimbang kebenaran dengan manusia sebagaimana yang dilakukan oleh orang-orang yang tidak punya ilmu dan akal. Karena tempat akhir mereka adalah neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 4",
    "description": "Adalah suatu keniscayaan bahwa tidak ada orang yang memperdebatkan tentang kebenaran dari ayat-ayat Allah dengan tujuan memperolok-olokkan atau menimbulkan keraguan terhadapnya, kecuali apa yang dilakukan oleh orang-orang yang kafir. Karena itu, janganlah engkau wahai nabi Muhammad tertipu oleh keberhasilan usaha mereka yang menghasilkan berbagai kesenangan yang mereka peroleh di seluruh negeri. 5. Sebelum mereka, orang-orang musyrik mekah, mendustakan wahyu Allah, kaum nuh dan golongan-golongan yang bersekutu setelah mereka telah terlebih dahulu melakukan hal yang sama, yakni mendustakan rasul-rasul Allah, dan setiap umat ketika itu juga telah merencanakan tipu daya terhadap rasul mereka untuk menawannya bahkan sampai mencelakakannya, dan mereka membantah dengan alasan yang batil untuk melenyapkan kebenaran yang dibawa oleh para rasul itu. Karena itu, aku, Allah yang mahaperkasa, tawan dan siksa mereka dengan azab. Maka camkanlah dengan sungguh-sungguh bahwa betapa pedihnya azab-ku'."
  }
]