[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa durhaka kepada Allah dalam hidupnya dan menyimpang dari jalan hidayah, maka dia tidak dibalas di akhirat kecuali dengan hukuman yang sesuai dengan kedurhakaannya. Dan barangsiapa menaati Allah dan mengerjakan amal shalih dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya, baik dia laki-laki atau perempuan, sementara dia beriman kepada Allah dan mentauhidkanNya, maka mereka akan masuk surga, di dalamnya Allah memberi mereka rizki dari buah-buahannya dan kenikmatannya serta kelezatannya tanpa batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Barangsiapa melakukan amal buruk, maka dia tidak dihukum kecuali seperti apa yang dilakukannya, hukuman atasnya tidak digandakan. Sebaliknya, barangsiapa beramal saleh dalam rangka mencari wajah Allah, baik laki-laki atau perempuan, dia beriman kepada Allah dan rasul-rasul-Nya, maka orang-orang yang memiliki sifat-sifat terpuji tersebut adalah orang-orang yang masuk Surga pada hari Kiamat. Allah memberi mereka rezeki dari apa yang Dia sediakan di sana berupa buah-buahan dan kenikmatan abadi yang tidak terputus selamanya tanpa perhitungan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزَىٰٓ إِلَّا مِثْلَهَا ۖ (Barangsiapa mengerjakan perbuatan jahat, maka dia tidak akan dibalasi melainkan sebanding dengan kejahatan itu) Yakni barangsiapa yang melakukan suatu kemaksiatan di dunia maka dia tidak akan diazab melainkan sesuai dengan ukurannya. وَمَنْ عَمِلَ صٰلِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ(Dan barangsiapa mengerjakan amal yang saleh baik laki-laki maupun perempuan sedang ia dalam keadaan beriman) Yakni barangsiapa yang melakukan amal shalih dan dia beriman kepada Allah dan apa yang dibawa oleh para rasul-Nya. فَأُو۟لٰٓئِكَ(maka mereka) Yakni orang-orang yang beramal shalin dan beriman. يَدْخُلُونَ الْجَنَّةَ يُرْزَقُونَ فِيهَا بِغَيْرِ حِسَابٍ (akan masuk surga, mereka diberi rezeki di dalamnya tanpa hisab) Yakni rezeki yang baik dan banyak yang tak terhingga. Muqatil berkata: maknanya adalah mereka tidak dimintai pertanggungjawaban atas kebaikan yang telah mereka dapatkan di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Barangsiapa berbuat maksiat di dunia maka tidak akan dihukum kecuali sesuai perbuatannya, itu adalah curahan sifat Adil Allah. Barangsiapa berbuat kebaikan, laki-laki maupun perempuan, dan mereka senantiasa beriman kepada Allah dan rasul-Nya, maka merekalah yang akan masuk surga bukan orang-orang di luar mereka. Di surga, mereka akan diberi kelimpahan rizki yang baik, tanpa ada batas ukuran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang mengerjakan keburukan maka dia tidak dibalas, kecuali sebanding dengan keburukan itu. Siapa saja yang mengerjakan kebajikan, baik laki-laki maupun perempuan dan dia beriman, maka mereka akan masuk surga. Mereka dianugerahi rezeki di dalamnya tanpa perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Barangsiapa mengerjakan perbuatan jahat” seperti syirik, kefasikan, atau maksiat, “maka dia tidak akan dibalas melainkan sebanding dengan kejahatannya itu”. Maksudnya, tidak dibalas kecuali dengan balasan yang membuatnya buruk dan sedih, Karena balasan kejahatan adalah keburukan. “Dan barangsiapa yang mengerjakan amal yang shalih baik laki-laki maupun perempuan”, baik berupa amalan-amalan hati, anggota tubuh, atau ucapan-ucapan lisan, “maka mereka akan masuk syurga, mereka diberi rizki di dalamnya tanpa hisab.” Maksudnya, mereka diberi balasan pahala tanpa batas dan tanpa hitungan, malah ia diberi balasan pahala oleh Allah dengan balasan yang jauh melebihi apa yang bisa dicapai oleh amal-amal mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 40: (Barang siapa yang mengerjakan perbuatan jahat, maka dia tidak akan dibalas melainkan sebanding dengan kejahatan itu. Dan barang siapa mengerjakan amal yang saleh, baik laki-laki maupun perempuan sedang ia dalam keadaan beriman, maka mereka akan masuk surga) dapat dibaca Yudkhaluuna atau Yadkhuluuna (mereka diberi rezeki di dalamnya tanpa hisab) diberi rezeki yang banyak tanpa perhitungan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik yang terkait dengan hati, lisan maupun anggota badan. Allah Subhaanahu wa Ta'aala akan memberikan rezeki kepada mereka yang tidak dicapai oleh amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 40",
    "description": "Dialog yang terjadi antara fir'aun dengan salah seorang kaumnya yang beriman secara sembunyi-sembunyi itu, memberi pesan kuat tentang perbuatan baik dan perbuatan jahat. Oleh sebab itu, renungkanlah bahwa barang siapa mengerjakan perbuatan jahat dan berbuat kebinasaan di muka bumi, maka dia akan dibalas sebanding dengan kejahatan itu. Dan barang siapa mengerjakan kebajikan dan beramal saleh, baik laki-laki maupun perempuan sedangkan dia dalam keadaan beriman dengan sungguh-sungguh, maka mereka akan masuk ke dalam surga atas anugerah Allah, dan mereka diberi rezeki di dalamnya dengan nikmat tidak terhingga. 41. Pada ayat yang lalu Allah menegaskan bahwa balasan yang seban-ding akan diberikan kepada siapa saja yang mengerjakan perbuatan jahat dan berbuat kebinasaan di muka bumi. Sebaliknya, siapa saja yang mengerjakan kebajikan, beramal saleh, dan beriman dengan sungguh-sungguh, maka mereka akan masuk ke dalam surga dan diberi rezeki dan nikmat yang tidak terhingga. Pada ayat ini serta beberapa ayat berikutnya, Allah menjelaskan bagaimana cara mendapatkan nikmat yang tiada terhingga itu melalui perkataan salah seorang pengikut fir'aun yang menyembunyikan keimanannya, 'dan ketahuilah wahai kaumku, sungguh mengherankan sikap kalian! bagaimanakah duduk perkara ini, aku menyerumu dengan sungguh-sungguh kepada keselamatan, tetapi kamu mendorong dan menyeruku untuk masuk ke dalam api neraka'."
  }
]