[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, bagaimana aku tidak mengajak kalian agar beriman kepada Allah dan mengikuti RasulNya, Musa, sementara dakwahku ini menyampaikan kalian kepada surga dan menjauhkan kalian dari api neraka, sementara kalian mengajakku kepada amal perbuatan yang membawa kepada azab Allah dan hukumanNya di neraka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. “Wahai kaumku! Mengapa ketika aku mengajak kalian kepada keselamatan dari kerugian di kehidupan dunia ini dan Akhirat dengan iman kepada Allah dan amal saleh, kalian justru mengajakku untuk masuk Neraka dengan ajakan kalian kepadaku untuk kufur kepada Allah dan maksiat kepadanya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Dan orang beriman ini melanjutkan ucapannya dengan panggilan kekerabatan: “Hai kaumku, mengapa ketika aku menyeru kalian kepada jalan hidayah dan surga, kalian malah menyeruku menuju kesesatan dan neraka. Kalian menyeruku untuk mendustakan Allah dan menyekutukan-Nya dengan sesuatu yang tidak aku ketahui apakah ia berhak disembah atau tidak. Padahal, aku menyeru kalian kepada Allah Yang Maha Perkasa dalam kerajaan-Nya dan dalam melakukan pembalasan, Maha Pengampuni hamba-hamba-Nya yang bertaubat. Sungguh aku yakin tuhan-tuhan yang kalian serukan itu tidak mampu mengabulkan doa orang yang menyerunya di dunia dan di akhirat; dan aku yakin tempat kembali kita pada hari kiamat adalah kepada Allah semata; serta orang-orang yang menentang kebenaran adalah para penghuni neraka dan akan menjadi bahan bakarnya. Kalian akan membenarkan perkataanku ini ketika azab telah menimpa kalian. Hanya kepada Allah aku bertawakkal; Dia Maha Mengetahui segala keadaan seluruh hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَيٰقَوْمِ مَا لِىٓ أَدْعُوكُمْ إِلَى النَّجَوٰةِ (Hai kaumku, bagaimanakah kamu, aku menyeru kamu kepada keselamatan) Lelaki beriman itu kembali menyeru mereka kepada Allah, dan dia berterus terang tentang keimanannya, dia tidak memakai cara yang sudah dia tempuh yaitu dengan menunjukkan seakan-akan dia termasuk dalam golongan mereka. Yakni beritahukan kepadaku mengapa ketika aku mengajak kalian menuju keselamatan dari neraka dan untuk memasuki surga dengan beriman kepada Allah dan menerima seruan rasul-rasul-Nya. وَتَدْعُونَنِىٓ إِلَى النَّارِ(tetapi kamu menyeru aku ke neraka?) Namun kalian malah mengajakku ke neraka dengan menginginkan kemusyrikan dariku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Wahai kaumku, aku mengajak kalian kepada jalan keberhasilan, yaitu hanya mengimani Allah (Beliau mengulang-ulang hal itu sebagai bentuk penegasan dan pernyataan tentang keimanannya), namun kalian malah mengajakku untuk memasuki neraka dengan berbuat syirik. Maknanya: “Bagaimana bisa, aku mengajak kalian masuk surga dengan beriman, sedangkan kalian malah mengajakku masuk neraka dengan berbuat kufur?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai kaumku Apa yang aku serukan kepada kalian menuju keselamatan, dan kalian menyeruku kepada neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Hai kaumku, bagaimanakah kamu, aku menyeru kamu kepada keselamatan” dengan apa yang telah aku katakan kepada kalian, “tetapi kamu menyeru aku ke neraka” dengan tidak mau mengikuti Nabiyulloh Musa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 41: (Hai kaumku bagaimanakah kalian, aku menyeru kalian kepada keselamatan, tetapi kalian menyeru aku ke neraka.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan kata-kataku itu. Dengan tidak mengikuti Nabi-Nya Musa ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 41",
    "description": "Pada ayat yang lalu Allah menegaskan bahwa balasan yang seban-ding akan diberikan kepada siapa saja yang mengerjakan perbuatan jahat dan berbuat kebinasaan di muka bumi. Sebaliknya, siapa saja yang mengerjakan kebajikan, beramal saleh, dan beriman dengan sungguh-sungguh, maka mereka akan masuk ke dalam surga dan diberi rezeki dan nikmat yang tidak terhingga. Pada ayat ini serta beberapa ayat berikutnya, Allah menjelaskan bagaimana cara mendapatkan nikmat yang tiada terhingga itu melalui perkataan salah seorang pengikut fir'aun yang menyembunyikan keimanannya, 'dan ketahuilah wahai kaumku, sungguh mengherankan sikap kalian! bagaimanakah duduk perkara ini, aku menyerumu dengan sungguh-sungguh kepada keselamatan, tetapi kamu mendorong dan menyeruku untuk masuk ke dalam api neraka'42. Mengapa pula kamu menyeruku agar memilih jalan untuk kafir kepada Allah dan melakukan perbuatan-perbuatan yang mempersekutukan-Nya dengan sesuatu hal yang aku sendiri tidak mempunyai ilmu tentang hal itu, padahal aku menyerumu agar beriman kepada Allah, tuhan yang mahaperkasa lagi maha pengampun'."
  }
]