[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian mengajakku untuk kafir kepada Allah dan menyekutukanNya dengan sesuatu yang aku tidak memiliki ilmu tentangnya bahwa ia memang berhak untuk disembah selain Allah (dan ini adalah dosa paling besar sekaligus paling buruk) sementara aku mengajak kalian kepada jalan yang menyampaikan kalian kepada Allah yang Mahaperkasa dalam pembalasanNya dan Maha Pengampun bagi siapa yang bertaubat kepadaNya setelah maksiat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Kalian mengajakku pada kebatilan kalian dengan harapan aku akan kafir kepada Allah dan menyembah bersama-Nya makhluk yang aku tidak tahu keabsahan penyembahannya bersama Allah, sedangkan aku mengajak kalian untuk beriman kepada Allah yang Maha Perkasa yang tidak seorang pun bisa mengalahkan-Nya, Dia Mahaperkasa yang tidak bisa dikalahkan oleh siapapun, Maha Penerima tobat para hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Kemudian orang mukmin ini menjelaskan tentang dua ajakan itu dengan berkata: ”Kalian mengajakku untuk kafir dan menyekutukan Allah. Kalian mengajakku untuk menyekutukan Allah dengan sesuatu yang tidak memiliki wujud dan tidak aku ketahui sama sekali. Sedangkan aku mengajak kalian untuk beriman kepada Allah SWT yang Maha Kuat lagi Maha Perkasa yang tidak mungkin dikalahkan serta Maha Pengampun bagi orang yang mau bertaubat, beriman dan beramal shalih ”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian menyeruku agar ingkar kepada Allah dan menyekutukanNya dengan sesuatu yang tidak aku ketahui tentangnya, padahal aku menyeru kalian kepada Dzat Yang Maha perkasa lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Lalu orang mukmin itu menguraikan seraya berkata “Kamu menyeruhku supaya aku kafir kepada Allah dan mempersekutukanNya dengan apa yang tida aku ketahui” bahwasanya ia berhak disembah selain Allah. Padahal berkata atas nama Allah tanpa ilmu adalah termasuk dosa yang paling besar dan paling buruk, “sedangkan aku menyeru kamu kepada yang mahaperkasa” yang kepunyaanNya sajalah seluruh kekuatan, sedangkan selain Dia sama sekali tidak mempuanyai wewenang apapun, “Lagi Maha Pengampun” yang apabila manusia melampaui batas diri mereka dan lancang melakukan apa-apa yang dimurkai Allah, lalu ia bertaubat dan kembali padaNya, maka Dia hapus dosa-dosa dan kesalahan mereka dan mencegah akibat buruknya, yaitu hukuman dan siksa dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 42: (-Kenapa- kalian menyeruku supaya kafir kepada Allah dan mempersekutukan-Nya dengan apa yang tidak kuketahui padahal aku menyeru kalian -beriman- kepada Yang Maha Perkasa) Yang Maha Menang atas semua perkara-Nya (lagi Maha Pengampun?) kepada orang yang bertobat kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya diterangkan jalan kepada neraka. Yaitu pengetahuan bahwa ada pula yang berhak disembah selain Allah. Yakni bahkan aku tidak mengetahui ada pula yang berhak disembah selain Allah, dan jika kamu tetap berkeyakinan seperti itu, maka berarti kamu berkata tentang Allah tanpa ilmu, padahal yang demikian termasuk dosa yang paling besar. Yang memiliki kekuasatan secara keseluruhan, sedangkan selain-Nya tidak berkuasa apa-apa. Apabila ada orang yang melampaui batas terhadap diri mereka dan berani mengerjakan perbuatan yang mendatangkan kemurkaan-Nya, lalu setelahnya ia menyesal dan bertobat serta kembali kepada-Nya, maka ia akan mendapati-Nya sebagai Tuhan Yang Maha Pengampun; Dia menghapuskan kejahatan dan dosa-dosa yang dilakukan seseorang serta menghindarkan hukuman dunia dan akhirat yang diperuntukkan kepada pelaku kejahatan dan maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 42",
    "description": "Mengapa pula kamu menyeruku agar memilih jalan untuk kafir kepada Allah dan melakukan perbuatan-perbuatan yang mempersekutukan-Nya dengan sesuatu hal yang aku sendiri tidak mempunyai ilmu tentang hal itu, padahal aku menyerumu agar beriman kepada Allah, tuhan yang mahaperkasa lagi maha pengampun'43. Sudah pasti dan tidak dapat disangkal lagi bahwa apa yang kamu serukan sedemikian rupa kepadaku agar aku beriman kepadanya, bukanlah suatu seruan yang baik yang akan berguna bagi kehidupan, baik di dunia maupun di akhirat. Dan sadarilah bahwa sesungguhnya tempat kembali kita pada akhirnya pasti kepada Allah tuhan yang maha esa, dan ketahuilah sesungguhnya orang-orang yang melampaui batas dengan berbuat durhaka kepada Allah, mereka itu-lah orang-orang yang akan menjadi penghuni neraka."
  }
]