[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Benar, dakwah yang kalian serukan kepadaku agar aku meyakininya adalah sesuatu yang tidak patut untuk didakwahkan, ia tidak bisa dimintai perlindungan, tidak di dunia dan tidak pula di akhirat, karena kelemahan dan kekurangannya. Ketahuilah, bahwa tempat kembali seluruh makhluk adalah kepada Allah, Dia membalas setiap pelaku perbuatan sesuai dengan perbuatannya, dan bahwa orang-orang yang melanggar batasan-batasanNya dengan melakukan kemaksiatan, menumpahkan darah dan kekafiran, mereka adalah penduduk neraka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Sungguh, apa yang kalian mengajakku untuk menyembahnya dan menaatinya tidak memiliki hak untuk disembah dengan benar di dunia dan di Akhirat, dan dia tidak menjawab seruan penyembahnya. Dan bahwa tempat kembali kita semuanya adalah Allah semata, dan bahwa orang-orang yang melampaui batas dalam kekufuran dan kemaksiatan adalah para penghuni Neraka yang mereka pasti memasukinya pada hari Kiamat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "Kemudian dia menjelaskan perbedaan dua ajakan itu, dengan mengatakan: 43. لَا جَرَمَ (Sudah pasti) Yakni kenyataannya bukan seperti yang kalian katakan, namun kebenaran adalah apa yang telah aku sebutkan kepada kalian. أَنَّمَا تَدْعُونَنِىٓ إِلَيْهِ لَيْسَ لَهُۥ دَعْوَةٌ فِى الدُّنْيَا وَلَا فِى الْاٰخِرَةِ(bahwa apa yang kamu seru supaya aku (beriman) kepadanya tidak dapat memperkenankan seruan apapun baik di dunia maupun di akhirat) Yakni telah jelas kesalahan ajakan setiap orang yang memohon kepada selain Allah, sebab segala doa yang dipanjatkan kepada berhala atau orang mati, mereka tidak akan mengabulkannya dengan melakukan sesuatu yang dipinta atau memberi suatu manfaat bagi orang yang memohon mereka. Pendapat lain mengatakan maknanya adalah berhala atau orang mati itu tidak memiliki doa yang dipanjatkan kepadanya yang menjadikannya tuhan di dunia maupun di akhirat. وَأَنَّ مَرَدَّنَآ إِلَى اللهِ(Dan sesungguhnya kita kembali kepada Allah) Yakni kita kembali kepada Allah pertama-tama dengan kematian kemudian dengan kebangkitan dari kubur. وَأَنَّ الْمُسْرِفِينَ هُمْ أَصْحٰبُ النَّارِ(dan sesungguhnya orang-orang yang melampaui batas, mereka itulah penghuni neraka) Yakni orang-orang yang banyak melakukan kemaksiatan adalah para penghuni neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Tentu saja, apa yang kamu serukan kepadaku supaya aku menyembahnya itu tidak mampu mengabulkan doa orang meminta kepadanya di dunia maupun akhirat. Tempat kembali kami setelah mati adalah Allah. Sesungguhnya orang-orang yang banyak melakukan kemaksiatan seperti syirik, zalim, dan mengalirkan darah adalah penduduk neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak diragukan} Tidak diragukan {bahwa apa yang kalian serukan kepadaku untuk menyembahnya bukanlah seruan yang layak} seruan yang tidak memiliki jawaban bagi para penyerunya {di dunia dan di akhirat. Sesungguhnya tempat kembali kita} tempat kembali kita {kepada Allah dan sesungguhnya orang-orang yang melampaui batas} orang-orang yang melampaui bataas dalam kekufuran dan kemaksiatan {akan menjadi penghuni neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Sudah pasti” maksudnya, yang sudah pasti dan yakin “bahwa apa yang kamu serukan kepadaku itu tidak dapat memperkenankan seruan apapun, baik dunia maupun di akhirat”. Maksudnya, tidak berhak diserukan kepadanya dan tidak pula dijadikan sandaran di dunia dan di akhiat karena ketidakberdayaan dan kelemahannya, dan karena tidak bisa memberi manfaat ataupun menimpakan marabahaya, tidak bisa mematikan, menghidupkan ataupun membangkitkan. “Dan sesungguhnya kita kembali kepada Allah” mlalu Dia akan memberikan balasan kepada setiap orang sesuai dengan pebuatannya. “Dan sesungguhnya orang-orang yang melampaui batas, mereka itulah penghuni neraka.” Merekalah orang-orang yang telah melampaui batas terhadap diri mereka dengan lancang terhadap Allah, melakukan kemaksiatan dan kekafiran kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 43: (Sudah pasti) yakni pastilah (bahwa apa yang kalian seru supaya aku -beriman- kepadanya) artinya, supaya aku menyembahnya (tidak dapat memperkenankan seruan apa pun) maksudnya, tidak dapat memperkenankan suatu doa pun (baik di dunia maupun di akhirat. Dan sesungguhnya kita kembali) atau kembali kita (kepada Allah dan sesungguhnya orang-orang yang melampaui batas) yakni orang-orang kafir (mereka itulah penghuni neraka.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni agar aku menyembahnya. Maksudnya, tidak dapat menolong baik di dunia maupun di akhirat, atau tidak perlu didakwahkan karena tidak ada gunanya dan karena lemahnya sesembahan itu, tidak mampu memberikan manfaat, menghindarkan bahaya, menghidupkan dan mematikan serta tidak mampu membangkitkan. Lalu Dia akan memberikan balasan terhadap amal kita. Dengan berani kepada Tuhannya, yaitu dengan melakukan kekufuran dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 43",
    "description": "Sudah pasti dan tidak dapat disangkal lagi bahwa apa yang kamu serukan sedemikian rupa kepadaku agar aku beriman kepadanya, bukanlah suatu seruan yang baik yang akan berguna bagi kehidupan, baik di dunia maupun di akhirat. Dan sadarilah bahwa sesungguhnya tempat kembali kita pada akhirnya pasti kepada Allah tuhan yang maha esa, dan ketahuilah sesungguhnya orang-orang yang melampaui batas dengan berbuat durhaka kepada Allah, mereka itu-lah orang-orang yang akan menjadi penghuni neraka. 44. Maka dengan demikian kelak kamu akan ingat dan mengakui kebe-naran yang aku sampaikan kepada kamu dan bahkan apa yang kukatakan kepadamu selama ini sesuatu yang layak untuk diyakini. Dan oleh sebab itu, aku menyerahkan seluruh urusanku hanya kepada Allah. Sungguh, Allah maha melihat akan apa yang diperbuat oleh hamba-hamba-Nya dan akan memberi balasan yang setimpal dengan apa yang diperbuat. '."
  }
]