[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka ketika dia menasehati mereka dan mereka tidak menaatinya, dia berkata kepada mereka, “Kalian pasti akan teringat bahwa aku pernah menasehati dan mengingatkan kalian, kalian pasti akan menyesal di hari di mana penyesalan itu tidak berguna. Aku berserah diri kepada Allah dan berlindung kepadaNya serta bertawakal kepadaNya. Sesungguhnya Allah Maha Melihat keadaan hamba-hambaNya dan balasan yang layak mereka dapatkan, tiada sesuatu pun yang samar bagiNya darinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Maka kaumnya menampik nasihatnya. Dia berkata, “Kalian akan mengingat nasihat yang aku berikan kepada kalian, kalian akan menyesal karena menolaknya. Aku menyerahkan segala urusanku kepada Allah semata. Sesungguhnya Allah Maha melihat hamba-hamba-Nya, tidak sedikit pun amal mereka yang samar bagi-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. فَسَتَذْكُرُونَ مَآ أَقُولُ لَكُمْ ۚ (Kelak kamu akan ingat kepada apa yang kukatakan kepada kamu) Jika azab telah menimpa kalian, dan kalian akan mengetahui bahwa aku benar-benar telah menyampaikan nasehat dan memperingatkan kalian. وَأُفَوِّضُ أَمْرِىٓ إِلَى اللهِ ۚ( Dan aku menyerahkan urusanku kepada Allah) Yakni aku bertawakkal dan aku sandarkan urusanku kepada-Nya. Terdapat pendapat mengatakan bahwa dia mengatakan ini ketika mereka hendak membunuh mereka. Dan Muqatil mengatakan bahwa lelaki beriman ini kemudian melarikan diri ke gunung sehingga mereka tidak dapat membunuhnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Saat melihat azab, kalian akan mengingat nasehat yang aku ucapkan kepada kalian. Aku menyerahkan urusanku dan memasrahkan diri kepada Allah. Sesungguhnya Dia mengetahui keadaan-keadaan dan tindakan hamba-hambaNya berupa ketaatan atau kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian akan mengingat apa yang aku katakan kepada kalian. Aku menyerahkan} Aku menyerahkan {urusanku kepada Allah. Sesungguhnya Allah Maha Melihat hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Setelah ia menasihati mereka, mengingatkan dan mewanti-wanti mereka, namun tetap mereka tidak mematuhinya dan tidak pula mereka menyetujuinya, maka ia berkata kepada mereka “Kelak kamu akan ingat kepada apa yang kukatakan kepadamu” dari nasihat ini, dan kalian melihat akibat buruk dari tidak menerima nasihatku ini pada saat siksa menimpa kalian nanti dan saat kalian tidak diberi limpahan pahala. “Dan aku menyerahkan urusanku kepada Allah” Maksudnya, aku bersandar kepada Allah, berlindung kepadaNya dan aku serahkan semua urusanku semua kehadiatNya, dan aku bertawakal kepadaNya dalam segala maslahatku dan dalam mencegah bahaya yang akan menimpaku dari kalian, atau dari orang selain kalian. “Sesungguhnya Allah melihat akan hamba-hambaNya.” Dia mengetahui keaadan dan perihal kalian dan apa yang berhak kalian peoleh. Dia mengetahui keaadanku dan ketidakberdayaanku, lalu Dia akan melindungiku dari kalian dan memeliharaku dari kejahatan kalian; dan Dia Mengetahui keadaan kalian. Oleh karena itu kalian tidak akan berbuat melainkan atas kehendakNya. Jika Dia menjadikan kalian menguasaiku, maka itu berdasarkan hikmahNya, dan berdasarkan kehendak dan kemauanNya semua itu terjadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 44: (Kelak kalian akan ingat) bila kalian menyaksikan azab dengan mata kalian sendiri (kepada apa yang kukatakan kepada kalian. Dan aku menyerahkan urusanku kepada Allah. Sesungguhnya Allah Maha melihat akan hamba-hamba-Nya\") Ia mengatakan demikian ketika mereka mengancamnya jika ia menentang agama mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah dia menasihati mereka dan memperingatkannya, namun ternyata mereka tidak mau taat dan tidak setuju terhadap ucapannya, maka dia berkata sebagaimana yang disebutkan dalam ayat di atas. Ketika kamu menyaksikan azab. Yakni aku serahkan semua urusanku kepada-Nya, aku bersandar kepada-Nya dalam hal yang bermaslahat bagi-Ku dan penghindaran musibah yang menimpaku dari kamu atau dari selain kamu. Dia mengetahui keadaan mereka dan apa yang pantas mereka peroleh, Dia juga mengetahui keadaanku dan kelemahanku sehingga Dia yang melindungiku dari kamu, Dia juga mengetahui keadaan kamu sehingga kamu tidak dapat bertindak kecuali dengan kehendak-Nya. Jika Dia memberikan kekuasaan kepada kamu terhadap diriku, maka hal itu karena kebijaksanaan-Nya dan hal itu muncul dari kehendak-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 44",
    "description": "Maka dengan demikian kelak kamu akan ingat dan mengakui kebe-naran yang aku sampaikan kepada kamu dan bahkan apa yang kukatakan kepadamu selama ini sesuatu yang layak untuk diyakini. Dan oleh sebab itu, aku menyerahkan seluruh urusanku hanya kepada Allah. Sungguh, Allah maha melihat akan apa yang diperbuat oleh hamba-hamba-Nya dan akan memberi balasan yang setimpal dengan apa yang diperbuat. '45. Demikianlah dikisahkan bahwa seruan yang disampaikan oleh seorang mukmin yang menyembunyikan keimanannya itu tidak diterima oleh fir'aun dan pengikutnya. Fir'aun bahkan merencanakan suatu perbuatan yang buruk kepadanya, maka Allah memeliharanya dari berbagai maksud buruk dan kejahatan tipu daya yang mereka lakukan itu, sedangkan fir'aun sendiri beserta kaumnya dikepung oleh azab yang sangat buruk."
  }
]