[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Allah melindungi laki-laki beriman lagi diberi taufik itu dari siksa yang ditimpakan oleh Fir’aun dan bala tentaranya, sebaliknya Fir’aun dan bala tentaranya ditimpa azab terburuk di mana Allah menenggelamkan mereka semuanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Maka Allah menjaganya dari keburukan makar kaumnya manakala mereka hendak membunuhnya. Lalu azab penenggelaman menimpa kaum Firaun. Allah menenggelamkannya dan seluruh bala tentaranya di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Dan berkat nasehat ini, dia terlindungi dari siksaan Allah yang menimpa Fir’aun dan kaumnya akibat tipu daya mereka. Mereka dibinasakan dengan tenggelam di laut; kemudian mereka akan mendapatkan azab di alam kubur, neraka akan ditampakkan kepada mereka setiap pagi dan petang hingga hari kiamat. Dan ketika hari kiamat telah datang, Allah akan menyuruh para malaikat: “Masukkanlah kaum Fir’aun ke dalam neraka yang memiliki azab yang sangat berat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَوَقَىٰهُ اللهُ سَيِّـَٔاتِ مَا مَكَرُوا۟ ۖ (Maka Allah memeliharanya dari kejahatan tipu daya mereka) Yakni Allah melindunginya dari rencana buruk yang mereka timpakan kepadanya. وَحَاقَ بِـَٔالِ فِرْعَوْنَ سُوٓءُ الْعَذَابِ(dan Fir’aun beserta kaumnya dikepung oleh azab yang amat buruk) Yakni azab buruk mengepung dan menimpa mereka. Mereka telah diazab di dunia dengan ditenggelamkan ke laut, dan mereka akan diazab di akhirat dengan api neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Lalu Allah memelihara dan menjaganya dari tipu daya mereka dan keburukan sesuatu yang mereka inginkan. Lalu azab yang buruk turun dan meliputi Fir’aun dan pasukan-pasukannya dengan menenggelamkan mereka di dunia dan memasukkan mereka ke neraka saat berada di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Allah melindunginya dari berbagai kejahatan tipu daya mereka} tipu daya buruk yang mereka inginkan kepadanya {dan Fir‘aun beserta kaumnya dikepung} diliputi {oleh seburuk-buruknya azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-46. “Maka Allah memeliharanya dari kejahatan tipu daya mereka”. Allah Yang Mahakuat lagi Maha Pengasih memelihara lelaki beriman yang mendapat hidayah itu dari keburukan apa yang telah direncanakan Firaun, dan Allah melindunginya dai rencana Firaun untuk membunuh dan membinasakannya karena ia telah menampakan kepada mereka sikap yang tidak mereka sukai dan ia menampakkan kepada mereka bahwa ia berpihak kepada Nabi Musa, ia mengajak mereka kepada apa yang diserukan oleh Nabi Musa. Ini adalah pekara yang mereka tidak sanggup melakukannya padahal pada saat itu mereka adalah orang-orang yang berkuasa. Lelaki ini telah membuat mereka sangat marah dan jengkel kepadanya. Maka dari itu mereka hendak malakukan tipudaya terhadapnya, namun Allah melindunginya dari tipudaya dan rencana jahat mereka. Tipudaya dan rencana jahat mereka berbalik menimpa mereka sendiri. “Dan Firaun beserta kaumnya dikepung oleh azab yang amat buruk.” Allah menenggelamkan mereka semuanya dalam satu pagi hari, dan di alam barzakh kemudian, “kepada mereka ditampakan neraka pada pagi dan petang, dan pada hari terjadinya Kiamat (dikatakan kepada malaikat), ‘masukanlah Firaun dan kaumnya ke dalam azab yang sangat keras’.” Itulah siksaan dan hukuman yang sangat keji yang ditimpakan terhadap orang-orang yang mendustkan para utusan Allah dan membangkang terhadap perintahNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 45: (Maka Allah memeliharanya dari kejahatan tipu daya mereka) terhadap dirinya, yaitu mereka merencanakan akan membunuhnya (dan turunlah) menimpa (kepada keluarga Firaun) maksudnya, kepada kaumnya yang mengikutinya (azab yang buruk) yaitu ditenggelamkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu usaha untuk membunuh orang mukmin tersebut oleh Fir’aun dan kaumnya, karena ia mengemukakan kepada mereka sesuatu yang mereka tidak sukai dan menunjukkan sikap setuju dengan apa yang dibawa Nabi Musa ‘alaihis salam dan yang diserukannya. Yaitu ditenggelamkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 45",
    "description": "Demikianlah dikisahkan bahwa seruan yang disampaikan oleh seorang mukmin yang menyembunyikan keimanannya itu tidak diterima oleh fir'aun dan pengikutnya. Fir'aun bahkan merencanakan suatu perbuatan yang buruk kepadanya, maka Allah memeliharanya dari berbagai maksud buruk dan kejahatan tipu daya yang mereka lakukan itu, sedangkan fir'aun sendiri beserta kaumnya dikepung oleh azab yang sangat buruk. 46. Kepada mereka akan diperlihatkan di alam barzakh azab yang amat buruk, yakni neraka yang diperlihatkan pada setiap pagi dan petang, dan juga pada hari terjadinya kiamat, lalu kepada malaikat diperintahkan, 'masukkanlah fir'aun dan kaumnya ke dalam neraka yang di dalamnya terdapat azab yang sangat keras!'."
  }
]