[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sungguh mereka pertamanya tenggelam lalu mereka semua binasa, kemudian di dalam kubur mereka disiksa, di mana neraka diperlihatkan kepada mereka dipagi dan petang hari sampai hari perhitungan amal, dan di Hari Kiamat dikatakan, “Masukkanlah keluarga Fir’aun ke dalam neraka sebagai balasan atas perbuatan buruk yang telah mereka lakukan.” Ayat ini merupakan dasar yang menetapkan adanya siksa kubur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan sesudah mereka mati, ditampakkan kepada mereka Neraka di alam kubur mereka di pagi dan sore hari, dan pada hari Kiamat dikatakan, “Masukkanlah para pengikut Fir'aun ke dalam azab yang paling keras dan paling berat, karena kekufuran dan pendustaan mereka, serta sikap menghalang-halangi dari jalan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. النَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا ۖ (Kepada mereka dinampakkan neraka pada pagi dan petang) Mayoritas ulama mengatakan bahwa penampakan ini terjadi di alam barzakh, yakni setelah kematian mereka dan sebelum hari kiamat. Imam Bukhari, Muslim, dan lainnya meriwayatkan dari Ibnu Umar, ia berkata, Rasulullah bersabda: “sungguh setiap kalian apabila meninggal akan dinampakkan kepadanya tempat duduknya pada pagi dan sore hari; jika ia termasuk penghuni surga maka akan ditampakkan sebagai penghuni surga, dan jika ia termasuk penghuni neraka maka akan ditampakkan sebagai penghuni neraka; akan dikatakan kepada mereka “inilah tempatmu kelak hingga kamu dibangkitkan kepadanya pada hari kiamat”.” وَيَوْمَ تَقُومُ السَّاعَةُ أَدْخِلُوٓا۟ ءَالَ فِرْعَوْنَ أَشَدَّ الْعَذَابِ(dan pada hari terjadinya Kiamat. (Dikatakan kepada malaikat): “Masukkanlah Fir’aun dan kaumnya ke dalam azab yang sangat keras”) Akan dikatakan kepada para malaikat: “Masukkanlah Fir’aun dan kaumnya ke dalam Jahannam di tempat yang azabnya lebih berat daripada tempat lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Arwah-arwah mereka ditunjukkan kepada neraka saat berada di alam barzah (alam setelah kematian dan sebelum kiamat) setiap pagi dan sore untuk membuat mereka gelisah. Ditampakkan pula akibat dari azab yang menimpa jasad mereka, meskipun sudah hancur. Pada hari terjadinya kiamat, dikatakanlah kepada para malaikat: “Masukkanlah para pasukan fir’aun ke dalam azab yang bermacam-macam di neraka.” Faktanya bahwa azab kubur itu abadi bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Neraka diperlihatkan kepada mereka pada pagi dan petang} permulaan dan akhir siang {Pada hari terjadinya kiamat,“Masukkanlah Fir‘aun dan kaumnya ke dalam sekeras-kerasnya azab”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-46. “Maka Allah memeliharanya dari kejahatan tipu daya mereka”. Allah Yang Mahakuat lagi Maha Pengasih memelihara lelaki beriman yang mendapat hidayah itu dari keburukan apa yang telah direncanakan Firaun, dan Allah melindunginya dai rencana Firaun untuk membunuh dan membinasakannya karena ia telah menampakan kepada mereka sikap yang tidak mereka sukai dan ia menampakkan kepada mereka bahwa ia berpihak kepada Nabi Musa, ia mengajak mereka kepada apa yang diserukan oleh Nabi Musa. Ini adalah pekara yang mereka tidak sanggup melakukannya padahal pada saat itu mereka adalah orang-orang yang berkuasa. Lelaki ini telah membuat mereka sangat marah dan jengkel kepadanya. Maka dari itu mereka hendak malakukan tipudaya terhadapnya, namun Allah melindunginya dari tipudaya dan rencana jahat mereka. Tipudaya dan rencana jahat mereka berbalik menimpa mereka sendiri. “Dan Firaun beserta kaumnya dikepung oleh azab yang amat buruk.” Allah menenggelamkan mereka semuanya dalam satu pagi hari, dan di alam barzakh kemudian, “kepada mereka ditampakan neraka pada pagi dan petang, dan pada hari terjadinya Kiamat (dikatakan kepada malaikat), ‘masukanlah Firaun dan kaumnya ke dalam azab yang sangat keras’.” Itulah siksaan dan hukuman yang sangat keji yang ditimpakan terhadap orang-orang yang mendustkan para utusan Allah dan membangkang terhadap perintahNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 46: Kemudian (neraka ditampakkan kepada mereka) maksudnya, mereka dibakar oleh api neraka (pada pagi dan petang) di setiap pagi dan petang (dan pada hari terjadinya kiamat) dikatakan kepada mereka, (\"Masuklah kalian) hai (Firaun dan kaumnya) menurut suatu qiraat dibaca Adkhiluu yang artinya, Masukkanlah Firaun dan kaumnya. Ini merupakan perintah Allah kepada malaikat-malaikat-Nya (ke dalam azab yang sangat keras\") yakni azab neraka"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di alam barzakh. Maksudnya, ditampakkan kepada mereka neraka pagi dan petang sebelum hari berbangkit. Ayat ini menunjukkan adanya azab kubur. Yaitu azab Jahanam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 46",
    "description": "Kepada mereka akan diperlihatkan di alam barzakh azab yang amat buruk, yakni neraka yang diperlihatkan pada setiap pagi dan petang, dan juga pada hari terjadinya kiamat, lalu kepada malaikat diperintahkan, 'masukkanlah fir'aun dan kaumnya ke dalam neraka yang di dalamnya terdapat azab yang sangat keras!'47. Ayat yang lalu memberitakan azab yang diterima oleh fir'aun dan pengikut-pengikutnya di dalam neraka. Melalui ayat ini dan ayat-ayat berikut, Allah menjelaskan kondisi saling menghujat di kalangan peng-huni neraka. Dan ingatlah bagaimana kelak pada waktu mereka ber-ada dalam neraka, ketika itu mereka berbantah-bantahan di dalam neraka, maka orang yang lemah sebagai pengikut berkata kepada orang-orang yang menyombongkan diri yang memimpin mereka, 'sesungguhnya kami dahulu ketika kita sama-sama hidup di dunia adalah pengikut-pengikutmu yang setia. Maka oleh sebab itu, dapatkah kamu melepaskan kami dari azab ini ataupun memikul sebagian dari azab api neraka yang sedang menimpa kami'."
  }
]