[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tatkala penduduk neraka bertikai, sebagian menyalahkan sebagian yang lain, lalu orang-orang yang mengikuti dan bertaklid membantah para pemimpin yang sombong yang menyesatkan mereka dan menghiasi jalan kesengsaraan untuk mereka, mereka berkata kepada para pemimpin, “Apakah kalian bisa membantu kami sedikit dengan memikul sebagian dari siksa neraka yang kami rasakan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Ingatlah -wahai Rasul- manakala orang-orang yang manut berbantah-bantahan dengan orang-orang yang dipanuti, dan mereka semuanya adalah penghuni neraka. Orang-orang manut yang tertindas berkata kepada orang-orang yang dipanuti yang menyombongkan diri, “Sesungguhnya dulu kami adalah pengikut kalian dalam kesesatan di dunia, apakah kalian berkenan memikul untuk kami sebagian azab Allah?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-49. Allah menyebutkan percakapan yang terjadi di antara para penghuni neraka ketika mereka saling berselisih di neraka. Para pengikut berkata kepada pada pemimpin mereka yang sombong: “Kami dahulu di dunia adalah para pengikut kalian, apakah sekarang kalian dapat menolong kami dari azab neraka?” Maka para pemimpin yang sombong ketika di dunia itu menjawab: “Kita semua sekarang di dalam neraka, tidak ada cara untuk keluar darinya karena Allah telah menetapkan bahwa orang-orang beriman akan masuk surga sedangkan orang-orang kafir akan masuk neraka. Maka kami sama sekali tidak dapat meringankan azab dari kalian.” Seluruh penghuni neraka itu kemudian meminta kepada para malaikat penjaga neraka agar memberi syafaat bagi mereka di sisi Allah, agar Allah meringankan azab neraka bagi mereka sehari saja."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَإِذْ يَتَحَآجُّونَ فِى النَّارِ (Dan (ingatlah), ketika mereka berbantah-bantah dalam neraka) Para penghuni neraka saling berselisih di dalam neraka. فَيَقُولُ الضُّعَفٰٓؤُا۟ لِلَّذِينَ اسْتَكْبَرُوٓا۟( maka orang-orang yang lemah berkata kepada orang-orang yang menyombongkan diri) Yakni kepada orang-orang yang enggan mentaati dan mengikuti para nabi karena kesombongan mereka serta membuat tipu daya agar dapat menghalangi manusia dari keimanan kepada para nabi tersebut. Mereka ini adalah para pemimpin kekafiran. إِنَّا كُنَّا لَكُمْ تَبَعًا(Sesungguhnya kami adalah pengikut-pengikutmu) Yakni orang-orang yang mengikuti kalian, dan kalian adalah pemimpin kami. Kami telah mempercayai apa yang kalian dulu katakan kepada kami sehingga ketaatan kami kepada kalian menjerumuskan kami ke dalam neraka. فَهَلْ أَنتُم مُّغْنُونَ عَنَّا نَصِيبًا مِّنَ النَّارِ(maka dapatkah kamu menghindarkan dari kami sebahagian azab api neraka?”) Yakni apakah kalian dapat menghindarkan sebagian azab itu dari kami atau menanggungnya bersama kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Wahai nabi, ingatlah saat penduduk neraka saling bertengkar, maka para orang lemah akan berkata: “Para pengikut itu akan berkata pada pemimpin-pemimpin yang enggan beriman yang merupakan pimpinan kekufuran: “Sesungguhnya di dunia kami menjadi pengikut kalian dan mengerjakan perintah kalian, lalu apakah kalian bisa melindungi kami dari azab neraka?” Kata {Maghnun} mengandung makna (orang-orang yang mencegah/melindungi)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka berbantah-bantahan} berbantah-bantahan {di dalam neraka. Orang yang lemah berkata kepada orang-orang yang menyombongkan diri,“Sesungguhnya kami adalah pengikut-pengikut kalian, apakah kalian bisa melepaskan} melindungi {kami dari sebagian} sebagian {neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Allah menginformasikan tentang pertengkaran para penghuni neraka, cacian sebagian mereka terhadap sebagian yang lain, permintaan keselamatan mereka kepada para malaikat penjaga neraka dan tidak bergunanya semua itu, seraya berfirman, “Dan ketika mereka berbantah-bantahan dalam neraka,” di mana para pengikut memprotes para pemimpinnya karena mereka telah menyesatkan, sedangkan para pemimpin itu berlepas tangan dari mereka, “orang-orang yang lemah berkata,” maksudnya, para pengikut kepada para pemimpin yang menyombongkan diri terhadap kebenaran dan mengajak mereka kepada apa yang mereka sombongkan itu, “sesungguhnya kami adalah pengikut-pengikutmu.” Kalianlah yang telah menyesatkan kami dan memperindah syirik dan kejahatan untuk kami, “maka dapatkah kamu menghindarkan dari kami sebagian azab api neraka,” walaupun hanya sedikit saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 47: (Dan) ingatlah (ketika mereka berbantah) yaitu ketika orang-orang kafir saling berbantah-bantahan (dalam neraka, maka orang-orang yang lemah berkata kepada orang-orang yang menyombongkan diri, \"Sesungguhnya kami adalah pengikutpengikut kalian) lafal Taba'an adalah bentuk jamak dari lafal Taabi'un (maka dapatkah kalian menghindarkan) artinya menolak (dari kami sebagian) yakni suatu bagian dari (azab api neraka?\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang perdebatan penduduk neraka (antara pengikut dengan pemimpin) dan keadaan mereka yang saling mencela dan berlepas tanggung jawab, serta permintaan mereka kepada penjaga neraka dan bahwa permintaan mereka itu tidak ada faedahnya. Yaitu para pengikut. Yaitu para pemimpin yang bersikap sombong terhadap kebenaran. Kamu yang menyesatkan kami dan menghias syirk dan keburukan kepada kami. Meskipun sedikit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 47",
    "description": "Ayat yang lalu memberitakan azab yang diterima oleh fir'aun dan pengikut-pengikutnya di dalam neraka. Melalui ayat ini dan ayat-ayat berikut, Allah menjelaskan kondisi saling menghujat di kalangan peng-huni neraka. Dan ingatlah bagaimana kelak pada waktu mereka ber-ada dalam neraka, ketika itu mereka berbantah-bantahan di dalam neraka, maka orang yang lemah sebagai pengikut berkata kepada orang-orang yang menyombongkan diri yang memimpin mereka, 'sesungguhnya kami dahulu ketika kita sama-sama hidup di dunia adalah pengikut-pengikutmu yang setia. Maka oleh sebab itu, dapatkah kamu melepaskan kami dari azab ini ataupun memikul sebagian dari azab api neraka yang sedang menimpa kami'48. Mendengar ucapan orang-orang lemah yang menjadi pengikutnya itu, orang-orang yang menyombongkan diri menjawab, 'sesungguhnya kita semua saat ini sama-sama berada dalam siksa api neraka. Kita semua sama-sama sedang merasakan siksa sesuai dengan dosa yang kita perbuat, karena Allah telah menetapkan siksa apa yang kita terima sebagai keputusan yang adil antara hamba-hamba-Nya. '."
  }
]