[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pemimpin yang sombong itu menjawab mengakui kelemahan mereka, “Kami tidak bisa memikul sebagian dari azab neraka untuk kalian sementara kita semuanya ada di dalamnya, kita tidak memiliki jalan untuk keluar darinya. Sesungguhnya Allah telah membagi azab diantara kita sesuai dengan kadar yang menjadi haknya, sejalan dengan ketetapanNya yang adil.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Orang-orang yang diikuti nan sombong menjawab, “Kita semuanya, yang mengikuti dan yang diikuti, masuk ke dalam Neraka, tidak seorang pun dari kita yang memikul azab orang lain, sesungguhnya Allah telah menetapkan keputusan di antara hamba-hamba, Dia memberi setiap orang haknya dari azab.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. قَالَ الَّذِينَ اسْتَكْبَرُوٓا۟ إِنَّا كُلٌّ فِيهَآ (Orang-orang yang menyombongkan diri menjawab: “Sesungguhnya kita semua sama-sama dalam neraka) Yakni kami dan kalian semua berada di neraka Jahannam, lalu bagaimana kami akan menyelamatkan kalian. إِنَّ اللهَ قَدْ حَكَمَ بَيْنَ الْعِبَادِ (karena sesungguhnya Allah telah menetapkan keputusan antara hamba-hamba-(Nya)”) Yakni Allah menetapkan diantara mereka bahwa sebagian akan ke surga dan sebagian lainnya akan ke neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Para pimpinan yang enggan beriman itu berkata: “Sesungguhnya kami dan kalian bersama-sama di neraka jahanam, bagaimana bisa kami lebih kuasa dari kalian?” Sesungguhnya Allah menentukan hukum dengan adil di antara para hamba dan tidak mengubah hukumNya. Setiap pengikut golongan itu kembali kepada tempatnya masing-masing."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menyombongkan diri menjawab,“Sesungguhnya kita semua sama-sama di dalamnya. Sesungguhnya Allah telah menetapkan keputusan di antara para hamba"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “orang-orang yang menyombongkan diri menjawab,” menjelaskan ketidakberdayaan mereka dan hebatnya keputusan ilahi terhadap semua (makhluk) “sesungguhnya kita semua sama-sama dalam neraka karena sesungguhnya Allah telah menetapkan keputusan antara hamba-hamba(Nya),” dan Dia telah menetapkan bagian dari azab terhadap masing-masing, Dia tidak akan menambahkannya, tidak akan menguranginya dan tidak pula akan merubah apa yang telah ditetapkan oleh Yang Mahabijaksana itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 48: (Orang-orang yang menyombongkan diri menjawab, \"Sesungguhnya kita semua sama-sama dalam neraka karena sesungguhnya Allah telah menetapkan keputusan antara hamba-hamba-Nya\") oleh karena itu maka Dia memasukkan orangorang yang beriman ke dalam surga, dan orang-orang kafir ke dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menerangkan kelemahan mereka dan berlakunya keputusan Allah kepada semuanya. Yakni Dia telah menetapkan bagian azab pada masing-masing mereka, sehingga tidak dapat ditambah dan dikurang serta tidak dapat dirubah ketetapan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 48",
    "description": "Mendengar ucapan orang-orang lemah yang menjadi pengikutnya itu, orang-orang yang menyombongkan diri menjawab, 'sesungguhnya kita semua saat ini sama-sama berada dalam siksa api neraka. Kita semua sama-sama sedang merasakan siksa sesuai dengan dosa yang kita perbuat, karena Allah telah menetapkan siksa apa yang kita terima sebagai keputusan yang adil antara hamba-hamba-Nya. '49. Setelah para penghuni neraka itu menyadari bahwa ketetapan Allah tidak bisa diubah dan siksa yang diterima oleh seseorang tidak dapat diringankan oleh orang lain, maka mereka kemudian menoleh kepada para penjaga neraka. Dan orang-orang yang berada dalam neraka, apakah itu yang menjadi pemimpin ataupun pengikut, berkata kepada para malaikat penjaga-penjaga neraka jahanam, 'mohonkanlah kepada tuhanmu dengan sungguh agar dia, Allah yang maha pengampun dan maha pemberi maaf itu, meringankan azab-Nya atas kami walaupun hanya sehari saja. '."
  }
]