[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penduduk neraka dari kalangan orang-orang yang sombong dan orang-orang yang lemah berkata kepada para penjaga Jahanam, “Mintalah kepada Tuhan kalian agar Dia berkenan meringankan siksa dari kami sehari saja, sehingga kami bisa beristirahat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Orang-orang yang diazab di dalam Neraka, baik para pengikut dan orang-orang yang diikuti, berkata kepada para penjaga Jahanam manakala mereka tidak lagi punya harapan untuk keluar dan kembali ke kehidupan dunia untuk bertobat, “Doakan kepada Rabb kalian agar meringankan dari kami azab yang terus menerus ini sehari saja.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَقَالَ الَّذِينَ فِى النَّارِ (Dan orang-orang yang berada dalam neraka berkata) Yakni umat-umat yang kafir baik itu pemimpin mereka atau pengikutnya. لِخَزَنَةِ جَهَنَّمَ (kepada penjaga-penjaga neraka Jahannam) Mereka adalah para malaikat yang bertugas mengazab penghuni neraka. ادْعُوا۟ رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًا مِّنَ الْعَذَابِ(“Mohonkanlah kepada Tuhanmu supaya Dia meringankan azab dari kami barang sehari”) Orang-orang kafir itu meminta para malaikat agar mensyafa’ati mereka kepada Allah untuk sedikit meringankan azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Penduduk neraka berkata kepada penjaga neraka Jahanam (mereka adalah malaikat yang bertugas menyiksa mereka): “Berdoalah kepada Allah Tuhanmu supaya meringankan dan memudahkan azab kami meskipun itu hanya sehari” Maknanya mereka meminta malaikat untuk memintakan pertolongan kepada Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berada di dalam neraka berkata kepada penjaga-penjaga neraka Jahanam,“Mohonkanlah kepada Tuhan kalian agar Dia meringankan azab atas kami sehari saja”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “Dan orang-orang yang berada dalam neraka berkata,” mereka adalah sebagian dari orang-orang yang menyombongkan diri dan orang-orang yang lemah, “kepada penjaga-penjaga neraka Jahannam, ‘Mohonkanlah pada Robbmu supaya Dia meringankan azab dari kami barang sehari.” Dengan harapan supaya ada sedikit istirahat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 49: (Dan orang-orang yang berada di dalam neraka berkata kepada penjaga-penjaga neraka Jahanam, \"Mohonkanlah kepada Rabb kalian supaya Dia meringankan daripada kami barang sehari) atau selama sehari (dari azab ini.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik yang sombong maupun yang lemah. Agar mereka dapat beristirahat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 49",
    "description": "Setelah para penghuni neraka itu menyadari bahwa ketetapan Allah tidak bisa diubah dan siksa yang diterima oleh seseorang tidak dapat diringankan oleh orang lain, maka mereka kemudian menoleh kepada para penjaga neraka. Dan orang-orang yang berada dalam neraka, apakah itu yang menjadi pemimpin ataupun pengikut, berkata kepada para malaikat penjaga-penjaga neraka jahanam, 'mohonkanlah kepada tuhanmu dengan sungguh agar dia, Allah yang maha pengampun dan maha pemberi maaf itu, meringankan azab-Nya atas kami walaupun hanya sehari saja. '50. Ketika mendengar permohonan itu, malaikat para penjaga neraka itu menghardik mereka, 'maka penjaga-penjaga neraka jahanam ber-kata, 'apakah rasul-rasul belum pernah datang kepadamu ketika kalian masih di dunia dengan membawa bukti-bukti yang nyata serta keterangan-keterangan yang jelas'' mereka menjawab, 'benar, rasul-rasul sudah pernah datang kepada kami di kehidupan dunia, tetapi kami abaikan dan dustakan. ' penjaga-penjaga neraka jahanam berkata, 'berdoa-lah kamu sendiri sekarang ini, hanya itu yang bisa kalian lakukan!' namun demikian, ketahuilah bahwa doa orang-orang kafir itu sia-sia belaka karena tidak akan dikabulkan oleh Allah."
  }
]