[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Telah mendustakan sebelum orang-orang kafir itu, kaum Nuh dan umat-umat yang datang sesudah mereka yang mengumumkan perang melawan rasul, seperti Ad dan Tsamud, di mana mereka bertekad untuk menyakiti para rasul dan bersekutu untuk mengganggu mereka atau membunuh mereka, masing-masing umat dari umat-umat yang mendustakan tersebut berkeinginan untuk membunuh rasulnya dan mendebatnya dengan kebatilan, sehingga mereka bisa membatalkan kebenaran dengan debat mereka, maka Aku menghukum mereka. Maka bukankah hukumanKu atas mereka mengandung pelajaran bagi makhluk dan nasihat bagi orang-orang yang datang sesudah mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Telah mendustakan sebelum mereka kaum Nuh -'alaihissalām-, dan sesudah kaum Nuh adalah sekutu-sekutu kufur, yaitu kaum 'Ād, Ṡamūd, kaum Lūṭ, penduduk Madyan dan Fir'aun. Setiap umat berniat jahat terhadap rasulnya untuk menangkapnya lalu membunuhnya. Mereka mendebat dengan kebatilan yang ada pada mereka untuk melenyapkan kebenaran. Maka Aku menghukum mereka semuanya. Maka perhatikanlah bagaimana hukuman-Ku atas mereka, sungguh itu adalah hukuman yang berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَالْأَحْزَابُ مِنۢ بَعْدِهِمْ ۖ (Sebelum mereka, kaum Nuh dan golongan-golongan yang bersekutu sesudah mereka telah mendustakan (rasul)) Yakni golongan-golongan yang bergabung untuk melawan para rasul setelah kaum Nabi Nuh, seperti kaum ‘Aad dan Tsamud. وَهَمَّتْ كُلُّ أُمَّةٍۭ بِرَسُولِهِمْ لِيَأْخُذُوهُ ۖ( dan tiap-tiap umat telah merencanakan makar terhadap rasul mereka untuk menawannya) Yakni setiap umat yang mendustakan rasul yang diutus kepada mereka itu berharap agar dapat mengalahkan para rasul agar dapat memenjarakan, menyiksa, dan melakukan pa yang mereka inginkan terhadap para rasul tersebut. وَجٰدَلُوا۟ بِالْبٰطِلِ لِيُدْحِضُوا۟ بِهِ الْحَقَّ(dan mereka membantah dengan (alasan) yang batil untuk melenyapkan kebenaran dengan yang batil itu) Yakni mereka mendebat para rasul dengan perkataan batil agar dapat mengalahkan kebenaran, yakni agar dapat membuat kebenaran sirna dan menghancurkan keimanan. فَأَخَذْتُهُمْ ۖ( karena itu Aku azab mereka) Yakni Aku kemudian mengazab orang-orang yang mendebat dengan kebatilan itu sebelum mereka dapat mengazab rasul mereka. فَكَيْفَ كَانَ عِقَابِ(Maka betapa (pedihnya) azab-Ku) Yakni siksa-Ku yang Aku timpakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Yang lebih dulu mendustakan rasul sebelum kaummu adalah kaum Nuh. Juga golongan-golongan yang bersekutu untuk melawan rasul seperti kaum Ad dan Tsamud, serta lainnya. Setiap kaum dari mereka berniat menyakiti rasul mereka diantaranya memenjarakan, menyiksa dan membunuh. Mereka menyanggah rasul mereka dengan perkataan penuh kebatilan (di luar kebenaran). Itu semua bertujuan agar mereka dapat menghapus kebenaran dan keimanan. Sehingga Aku timpakan azab dan kebinasaan bagi mereka. Maka betapa pedihnya azab-Ku?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perjalanan mereka di banyak negeri untuk melakukan beragam perniagaan dan usaha. Maka sesungguhnya kesudahan perintah mereka adalah azab {Sebelum mereka, kaum Nuh dan golongan-golongan yang bersekutu setelah mereka mendustakan (rasul)} umat-umat yang bersekutu melawan rasul mereka dengan mendustakannya, yaitu kaum setelah Nuh, seperti kaum ‘Ad dan Tsamud {Setiap umat telah merencanakan tipu daya terhadap rasul mereka untuk membunuhnya} untuk membunuhnya {Mereka membantah dengan alasan yang bathil untuk melenyapkan} untuk melenyapkan dengan bantahan mereka {kebenaran. Maka Aku menyiksa mereka. Bagaimanakah azabKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. kemudian Allah mengancam siapa saja yang memperdebatkan ayat-ayat Allah dengan tujuan merusaknya sebagaimana telah dilakukan oleh umat-umat sebelumnya dari “kaum Nuh” dan ‘Ad “dan golongan yang bersekutu sesudah mereka” yang berkoalisi dan bergabung untuk memberangus kebenaran dan membela kebatilan. “dan” keadaannya samapai membuat mereka dan koalisi mereka telah menyeret merekan untuk melakukan tindakan, “tiap-tiap umat telah merencanakan” maksudnya, tiap-tiap umat telah merencanakan makar “terhadap rosul mereka untuk menawannya,” maksudnya, untuk membunuhnya. Inilah cobaan yang hebat yang dihadapi oleh para rosul, para pelopor ahli kebaikan, yang mebawa kebenaran murni yang tidak ada keraguan atau ketidakjelasan padanya. Kaum yang bersukutu itu benar-benar telah merencanakan untuk membunuh mereka. Maka apakah sesudah kedzaliman, kesesatan, dan kesengsaraan ini ada hal lain selain azab yang berat yang bisa membebaskan mereka darinya?. Kerena itu Allah befirman tentang hukuman duniwi dan ukhrowi mereka , “karena itu Aku azab mereka”, disebabkan pendustaan yang mereka lakukan dan persekutuan jahat mereka itu. “maka betapa pedihnya azabku.” Ia adalah azab yang paling berat dan paling keji, ia tiada lain adalah suara keras atauu bencana yang menimpa mereka dari langit, atau Allah memerintahkan kepada bumi untuk menelan mereka, atau kepad laut untuj meneggelamkan mereka. Maka mereka pun menjadi mati tidak berdaya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 5: (Sebelum mereka, kaum Nuh dan golongan-golongan yang bersekutu telah mendustakan) rasul-rasulnya, seperti Ad dan Tsamud serta kaum-kaum lainnya (sesudah mereka, dan tiap-tiap umat telah merencanakan makar terhadap rasul mereka untuk menawannya) untuk membunuhnya (dan mereka membantah dengan alasan yang batil untuk melenyapkan) untuk menghapuskan (kebenaran dengan yang batil itu; karena itu Aku azab mereka) dengan siksaan. (Maka betapa pedihnya azabKu) terhadap mereka; hal itu sesuai dengan imbalan yang harus mereka terima."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengancam orang-orang yang mendebat ayat-ayat Allah untuk membatalkannya sebagaimana yang dilakukan oleh generasi sebelum mereka, seperti kaum Nuh, kaum ‘Aad, dan orang-orang yang bersekutu lainnya yang bersama-sama berusaha membatalkan kebenaran dan membela yang batil. Sampai-sampai mereka telah bertekad kuat untuk membunuh pemimpin kebaikan, yaitu rasul yang diutus kepada mereka. Bukankah ini menunjukkan kezaliman, kesesatan dan kesengsaraan mereka, sehingga tidak ada setelahnya selain azab yang dahsyat. Seperti ‘Aad, Tsamud dan lainnya. Yang selanjutnya membunuh rasul tersebut. Disebabkan pendustaan mereka dan berkumpulnya mereka untuk memerangi kebenaran. Ada yang berupa suara keras yang mengguntur, hujan batu, ditelan oleh bumi, ditenggelamkan ke laut, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 5",
    "description": "Sebelum mereka, orang-orang musyrik mekah, mendustakan wahyu Allah, kaum nuh dan golongan-golongan yang bersekutu setelah mereka telah terlebih dahulu melakukan hal yang sama, yakni mendustakan rasul-rasul Allah, dan setiap umat ketika itu juga telah merencanakan tipu daya terhadap rasul mereka untuk menawannya bahkan sampai mencelakakannya, dan mereka membantah dengan alasan yang batil untuk melenyapkan kebenaran yang dibawa oleh para rasul itu. Karena itu, aku, Allah yang mahaperkasa, tawan dan siksa mereka dengan azab. Maka camkanlah dengan sungguh-sungguh bahwa betapa pedihnya azab-ku'6. Dan sebagaimana telah dijatuhkan sanksi kepada umat terdahulu yang durhaka, demikianlah juga telah pasti berlaku ketetapan tuhanmu dalam bentuk azab yang pedih terhadap orang-orang kafir dari umatmu, wahai nabi Muhammad, yaitu sesungguhnya mereka, orang-orang musyrik mekah, itu adalah penghuni neraka."
  }
]