[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para penjaga Jahanam menjawab sambil menghardik mereka, “Permintaan itu tidak berguna apa pun untuk kalian, bukankah kalian telah didatangi oleh rasul-rasul kalian dengan membawa hujjah-hujjah yang jelas dari Allah lalu kalian mendustakan mereka?” Maka orang-orang yang ingkar itu mengakuinya dan mereka berkata, “Benar.” Maka para penjaga Jahanam berlepasdiri dari mereka dan berkata, “Kami tidak mendoakan kebaikan untuk kalian, dan tidak memberi syafaat kepada kalian, maka berdoalah kalian sendiri, namun doa itu tetap tidak berguna apa pun bagi kalian, karena kalian adalah orang-orang kafir.” Doa orang-orang kafir hanya kesia-siaan, tidak diterima dan tidak dijawab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Para penjaga neraka Jahanam menjawab permintaan orang-orang kafir, “Bukanlah para rasul telah datang kepada kalian dengan membawa bukti-bukti dan tanda-tanda yang jelas.” Maka orang-orang kafir berkata, “Benar. Para rasul telah datang kepada kami dengan membawa bukti-bukti dan tanda-tanda yang jelas.” Maka para penjaga neraka Jahanam berkata mencibir mereka, “Kalian saja yang berdoa, kami tidak mau membantu orang-orang kafir.” Dan doa orang-orang kafir hanya sia-sia dan tidak berguna apa pun, karena Allah tidak menerimanya dari mereka karena kekufuran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Akan tetapi permintaan mereka itu tidak dapat dikabulkan, bahkan para malaikat penjaga neraka itu membalas permintaan mereka dengan siksaan dan olokan: “Bukankah para rasul dari Allah telah datang kepada kalian dengan membawa berbagai bukti yang jelas?” Merekapun mengakui hal itu dengan berkata: “Benar.” Maka para malaikat berlepas diri dari permohonan dan doa mereka: “Maka memohonlah kalian, akan tetapi doa dan permohonan orang-orang kafir hanya sia-sia dan tidak akan terpenuhi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. قَالُوٓا۟ أَوَلَمْ تَكُ تَأْتِيكُمْ رُسُلُكُم بِالْبَيِّنٰتِ ۖ قَالُوا۟ بَلَىٰ ۚ (Penjaga Jahannam berkata: “Dan apakah belum datang kepada kamu rasul-rasulmu dengan membawa keterangan-keterangan?” Mereka menjawab: “Benar, sudah datang”) Yakni “benar, telah datang, namun kami mendustakan mereka dan kami tidak beriman kepada mereka dan hujjah yang mereka datangkan. قَالُوا۟( Penjaga-penjaga Jahannam berkata) Setelah orang-orang kafir itu mengakuinya, maka para malaikat yang menjaga neraka Jahannam berkata kepada mereka. فَادْعُوا۟ ۗ( “Berdoalah kamu”) Yakni jika memang demikian maka berdoalah kalian, sebab kami tidak berdoa untuk orang yang kafir terhadap Allah dan mendustakan rasul-rasul-Nya setelah datang dengan hujjah-hujjah yang jelas. Kemudian para malaikat memberitahu mereka bahwa doa mereka tidak akan bermanfaat sedikitpun, dengan mengatakan: وَمَا دُعٰٓؤُا۟ الْكٰفِرِينَ إِلَّا فِى ضَلٰلٍ (Dan doa orang-orang kafir itu hanyalah sia-sia belaka) Yakni hanyalah sia-sia dan tidak akan dikabulkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Dengan nada ejekan, malaikat penjaga itu berkata: “Bukankah para rasul dan para nabi telah datang kepada kalian dengan berbagai hujjah untuk mengesakan Allah?” Mereka berkata: “Benar, mereka datang kepada kami dengan hujjah itu, namun kami mendustakan mereka” Penjaga neraka itu kemudian berkata: “Berdoalah sendiri, sesungguhnya kami tidak berdoa untuk orang yang kafir kepada Allah dan mendustakan para rasulNya.” Doa orang-orang kafir itu tidak lain hanya kesia-siaan dan tidak dikabulkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} penjaga-penjaga neraka Jahanam berkata {“Bukankah para rasul telah datang kepada kalian dengan bukti-bukti yang nyata.” Mereka menjawab,“Benar” Mereka berkata,“Maka Memohonlah” Dan tidaklah doa orang-orang kafir itu kecuali sia-sia belaka} hilang dan sia-sia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. lalu “penjaga jahanam bekata” dengan nada mencela dan menjelaskan bahwa syafa’at mereka (para penjaga jahanam) tidak bermanfaat bagi meeka dan doa mereka pun tidak beguna sama sejali. “dan apakah belum datang kepadamu rasul-rasulmu dengan membawa keterangan-keterangan,” yang dengannya kalian dapat mendekat kepadaNya dan yang menjauhkan dariNya? “mereka menjawab,’benar’,” mereka sudah datang kepada kami dengan bukti-bukti, dan hujjah yang pasti pun telah ditegakkan terhadap kami. Namun kami berbuat zhalim dan kami menentang kebenaran itu sesudah menjadi jelas bagi kami. “mereka berkata,” maksudnya, para penjaga neraka kepada para penghuni neraka sambil berlepas dirri dai doa dan syafa’at untuk meeka, “berdoalah,” kalian. Akan tetapi doa tersebut bermanfaat ataukah tidak?! Allah berfirman, “dan doa orang-orang kafir itu hanyalah sia-sia belaka.” Maksudnya, batal dan sia-sia, hal itu karena kekafiran itu menggugurkan semua amal-amal shalih dan menjadi penghalang untuk dikabulkannya doa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 50: (Para penjaga neraka Jahanam berkata) dengan nada sinis, (\"Dan apakah belum datang kepada kalian rasul-rasul kalian dengan membawa keterangan-keterangan?\") yakni mukjizat-mukjizat yang tampak. (Mereka menjawab, \"Benar, sudah datang\") tetapi mereka kafir kepada rasul-rasul mereka itu. (Penjaga-penjaga Jahanam berkata, \"Berdoalah kalian\") karena sesungguhnya kami tidak akan memberikan syafaat/pertolongan kepada orang-orang kafir. Lalu Allah berfirman, (Tiadalah doa orang-orang kafir itu melainkan sia-sia belaka) yakni tiada gunanya, karena pasti tidak akan diperkenankan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil mencela. Dimana kebenaran menjadi jelas dengannya dan jalan yang lurus menjadi terang. Demikian pula menjadi jelas jalan yang mendekatkan kepada Allah dan yang menjauhkan dari-Nya. Namun mereka kafir kepadanya. Yakni karena kami tidak memberi syafaat kepada orang-orang kafir. Hal itu karena kekafiran menghapuskan semua amal dan menghalangi dikabulkannya doa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 50",
    "description": "Ketika mendengar permohonan itu, malaikat para penjaga neraka itu menghardik mereka, 'maka penjaga-penjaga neraka jahanam ber-kata, 'apakah rasul-rasul belum pernah datang kepadamu ketika kalian masih di dunia dengan membawa bukti-bukti yang nyata serta keterangan-keterangan yang jelas'' mereka menjawab, 'benar, rasul-rasul sudah pernah datang kepada kami di kehidupan dunia, tetapi kami abaikan dan dustakan. ' penjaga-penjaga neraka jahanam berkata, 'berdoa-lah kamu sendiri sekarang ini, hanya itu yang bisa kalian lakukan!' namun demikian, ketahuilah bahwa doa orang-orang kafir itu sia-sia belaka karena tidak akan dikabulkan oleh Allah. 51. Sebagai pamungkas dari dialog yang terjadi di neraka tersebut, Allah kemudian mengingatkan semua, apakah itu orang-orang kafir ataupun orang-orang mukmin, dengan berfirman, 'sesungguhnya kami akan senantiasa menolong rasul-rasul yang telah kami utus dan juga orang-orang yang beriman dalam kehidupan dunia dan juga menolong mereka pada hari tampilnya para saksi yakni hari kiamat. '."
  }
]