[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami benar-benar akan menolong utusan-utusan Kami dan orang-orang Mukmin yang mengikuti mereka, dan Kami akan menjaga mereka dari pihak yang menyakiti mereka di kehidupan dunia ini dan di Hari Kiamat. Di hari itu para malaikat, para nabi dan orang-orang beriman bersaksi atas umat-umat yang mendustakan utusan-utusannya, maka mereka bersaksi bahwa para rasul itu telah menyampaikan risalah Tuhan mereka dan bahwa umat-umat mereka mendustakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Sesungguhnya Kami menolong rasul-rasul Kami dan orang-orang yang beriman kepada Allah dan kepada para rasul-Nya di dunia dengan memenangkan hujah mereka dan memenangkan mereka atas musuh-musuh mereka. Kami juga menolong mereka pada hari Kiamat dengan memasukkan mereka ke dalam Surga, juga dengan menghukum musuh-musuh mereka ketika dunia dengan memasukkan mereka ke dalam Neraka sesudah para nabi, para malaikat dan orang-orang beriman bersaksi bahwa seruan dakwah sudah sampai kepada mereka dan bahwa umat-umat mereka mendustakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Allah menegaskan kabar gembira berupa pertolongan bagi para rasul-Nya dan orang-orang beriman di dunia dan di hari kiamat, hari ketika para malaikat bersaksi bahwa para nabi dan rasul telah menyampaikan risalah mereka. Pada hari itu tidak berguna lagi segala alasan dari orang-orang kafir, mereka akan dijauhkan dari rahmat Allah dan kehidupan yang buruk dalam azab neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. إِنَّا لَنَنصُرُ رُسُلَنَا وَالَّذِينَ ءَامَنُوا۟ (Sesungguhnya Kami menolong rasul-rasul Kami dan orang-orang yang beriman) Yakni Kami akan menjadikan mereka menang melawan para musuh mereka. Makna Allah akan menolong mereka adalah Dia akan membalas amalan mereka dengan memasukkan mereka ke dalam surga dan memuliakan mereka dengan kemulian-kemuliaan dari-Nya. فِى الْحَيَوٰةِ الدُّنْيَا(dalam kehidupan dunia) Dengan balasan yang selalu Allah berikan kepada mereka berupa terbunuh dalam peperangan, tertawan, terampas hartanya, dan terkalahkan. وَيَوْمَ يَقُومُ الْأَشْهٰدُ (dan pada hari berdirinya saksi-saksi) Yakni pada hari kiamat. Dan saksi-saksi tersebut adalah para malaikat yang memberi kesaksian bagi para nabi bahwa mereka telah menyampaikan risalah, dan para nabi yang bersaksi atas umat-umat merekka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Sesungguhnya Kami menolong para rasul Kami dan orang-orang mukmin. Kami menjadikan mereka menang atas musuh-musuh mereka di dunia dengan membunuh, menawan, dan mengikat mereka serta menunjukkan hujjah kepada mereka. Pada hari kiamat saat para malaikat bersaksi tentang penyampaian risalah para nabi dan rasul, serta bersaksi tentang pendustaan orang-orang kafir, Allah memasukkan ahli iman ke dalam surga dan memasukkan orang-orang kafir ke dalam neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami akan menolong rasul-rasul Kami dan orang-orang yang beriman di kehidupan dunia dan pada hari dihadirkannya para saksi} dan pada hari ketika para malaikat, para nabi, dan orang-orang mukmin bersaksi tentang risalah dan penyampaian mereka, bahwa umat-umat mereka mendustakan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. setelah Allah menyebutkan siksaan keluarga fir’aun di dunia, di alam barzakh dan pada hari kiamat dan menyebutkan kondisi ahli neraka yang sangat mengerikan, yaitu mereka yang telah menentang dan memerangi rasul-rasulNYa, maka Allah berfirman, ”sesungguhnya kami menolong para rasul-rasul Kami dan orang-orang yang beriman pada kehidupan dunia,” yaitu, dengan hujjah, argumen dan pertolongan, dan di akhiat dengan keputusan, untuk para pengikutnya dengan pahala dan untuk orang-orang yang memeranginya dengan azab yang sangat dahsyat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 51: (Sesungguhnya Kami menolong rasul-rasul Kami dan orang-orang yang beriman dalam kehidupan dunia dan pada hari berdirinya saksi-saksi) yaitu hari kiamat. Lafal Al-Asyhaad adalah bentuk jamak dari lafal Syaahidun; para saksi tersebut adalah malaikat-malaikat yang memberikan kesaksian bagi para rasul, bahwasanya rasul-rasul itu telah menyampaikan risalah-Nya dan mereka mendustakan orang-orang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan hujjah, bukti dan pertolongan. Di akhirat, dengan menetapkan pahala untuk para rasul dan orang-orang yang beriman, sedangkan untuk orang-orang yang memerangi mereka akan memperoleh azab yang keras. Para saksi di sini menurut Mujahid adalah para malaikat. Mereka tampil memberikan kesaksian, bahwa para rasul telah menyampaikan risalahnya dan orang-orang kafir malah mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 51",
    "description": "Sebagai pamungkas dari dialog yang terjadi di neraka tersebut, Allah kemudian mengingatkan semua, apakah itu orang-orang kafir ataupun orang-orang mukmin, dengan berfirman, 'sesungguhnya kami akan senantiasa menolong rasul-rasul yang telah kami utus dan juga orang-orang yang beriman dalam kehidupan dunia dan juga menolong mereka pada hari tampilnya para saksi yakni hari kiamat. '52. Yaitu hari yang ketika itu permintaan maaf yang diajukan kepada Allah tidak berguna lagi bagi orang-orang yang zalim lagi berdosa, dan mereka secara khusus mendapat laknat berupa kutukan jauh dari nikmat dan rahmat Allah, dan juga memperoleh tempat tinggal yang sangat buruk di neraka jahanam."
  }
]