[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di hari perhitungan amal, orang-orang kafir yang melanggar batasan-batasan Allah tidak merasakan manfaat sedikit pun dari alasan-alasan yang mereka suguhkan, karena sebelumnya mereka telah mendustakan utusan-utusan Allah, mereka diusir dari rahmat Allah, bagi mereka tempat tinggal yang buruk di akhirat, yaitu neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Hari itu, alasan apapun tidak berguna lagi bagi orang-orang yang menzalimi diri mereka sendiri dengan kekufuran dan kemaksiatan atas kezaliman yang mereka lakukan. Pada hari itu mereka diusir dari rahmat Allah, bagi mereka tempat yang buruk di Akhirat karena di sana mendapatkan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. يَوْمَ لَا يَنفَعُ الظّٰلِمِينَ مَعْذِرَتُهُمْ ۖ ((yaitu) hari yang tidak berguna bagi orang-orang zalim permintaan maafnya) Sebab itu adalah alasan yang batil dan syubhat yang palsu. وَلَهُمُ اللَّعْنَةُ(dan bagi merekalah laknat) Yakni dijauhkan dari rahmat Allah. وَلَهُمْ سُوٓءُ الدَّارِ(dan bagi merekalah tempat tinggal yang buruk) Yakni neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Pada hari kiamat, permohonan maaf orang-orang kafir itu tidak berguna dan tidak diterima karena permohonan maaf itu lemah dan bathil. Mereka itu ditolak dan dijauhkan dari rahmat Allah, dan bagi mereka itu neraka yang mereka tinggali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{hari (ketika) tidak berguna bagi orang-orang zalim permintaan maaf mereka} alasan mereka {Bagi mereka itu laknat} diusir dan dijauhkan dari rahmat {dan bagi mereka itu tempat tinggal yang buruk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “hai yang tidak berguna bagi orang-orang zhalim permintaaan maafnya” saat mereka meminta maaf” dan bagi mereka laknat dan bagi merekalah tempat tinggal yang buruk,” yaitu, negeri yang sangat buruk yang menyiksa penghuninya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 52: (Yaitu hari yang tidak berguna) dapat dibaca Yanfa'u atau Tanfa'u (bagi orang-orang zalim permintaan maafnya) yakni permintaan maaf mereka seandainya mereka meminta maaf (dan bagi merekalah laknat) yaitu dijauhkan dari rahmat Allah (dan bagi mereka tempat tinggal yang buruk) di akhirat, yaitu mendapat azab yang sangat pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jauh dari rahmat. Yang menyakitkan penduduknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 52",
    "description": "Yaitu hari yang ketika itu permintaan maaf yang diajukan kepada Allah tidak berguna lagi bagi orang-orang yang zalim lagi berdosa, dan mereka secara khusus mendapat laknat berupa kutukan jauh dari nikmat dan rahmat Allah, dan juga memperoleh tempat tinggal yang sangat buruk di neraka jahanam. 53. Ayat-ayat yang lalu menggambarkan apa yang dialami oleh orang-orang yang durhaka di dalam neraka jahanam. Maka untuk menghindari agar tidak mengalami hal seperti itu, Allah menurunkan petunjuk kepada manusia, seperti apa yang diturunkan kepada nabi musa. 'dan sungguh kami bersumpah bahwa kami telah memberikan petunjuk kepada musa sehingga ia tidak mengalami kesesatan dalam hidupnya; dan kami juga telah mewariskan kitab taurat kepada bani israil."
  }
]