[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "53-54. Sungguh Kami telah memberi Musa Taurat dan mukjizat-mukjizat yang bisa menunjukkan kepada Kebenaran dan Kami menjadikan Bani Israil mewarisi Taurat dari satu generasi ke generasi berikutnya, Taurat itu membimbing ke jalan yang lurus dan nasihat bagi orang-orang yang memiliki akal yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Sungguh Kami telah memberi Musa mukjizat-mukjizat dan ilmu yang dengannya Bani Israil terbimbing ke jalan yang benar. Kami menjadikan Taurat sebagai kitab yang diwarisi di kalangan Bani Israil dari satu generasi ke generasi berikutnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53-54. Sungguh Kami telah memberi Musa kitab Taurat dan sembilan mukjizat, dan Kami jadikan Bani Israil mewarisi Taurat secara turun temurun; dalam kitab itu terkandung petunjuk menuju jalan yang benar dan peringatan dari kebatilan bagi orang-orang yang berakal sehat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَلَقَدْ ءَاتَيْنَا مُوسَى الْهُدَىٰ (Dan sesungguhnya telah Kami berikan petunjuk kepada Musa) Yakni Kami telah memberinya kitab Taurat dan kenabian. Muqatil berpendapat, yakni memberinya petunjuk dari kesesatan berupa kitab Taurat. وَأَوْرَثْنَا بَنِىٓ إِسْرٰٓءِيلَ الْكِتٰبَ(dan Kami wariskan Taurat kepada Bani Israil) Kitab Taurat tetap ada setelah kematian Musa, dan Bani Israil terus mewariskannya kepada setiap generasi selanjutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Sungguh kami memberi Musa sesuatu yang digunakan sebagai petunjuk dari kegelapan menuju kebenaran, berupa kitab Taurat yang berisi hukum-hukum dan mukjizat yang terikat dengan kebenaran. Kami juga mewariskan kitab Taurat kepada Bani Israil yang hidup setelah Musa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan kepada Musa sebuah petunjuk} pengetahuan yang menunjukkannya kepada kebenaran {dan mewariskan kepada Bani Israil kitab} Taurat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53-54. setelah Allah menjelaskan apa yang terjadi terhadap nabi Musa dan fir’aun dan akhir kesudahan pengikut fir’aun dan pasukannya, kemudian menjelaskan keputusan umum yang menyeluruh untuknya dan juga untuk para penghuni neraka, maka disini Allah menjelaskan bahwa Dia menguraikan kepada nabi Musa “petunjuk” yaitu, mukijat-mukjizat dan ilmu yang dijadikan petunjuk oleh orang-orang yang mendapat petunjuk, “dan kami wariskan al-kitab kepada bani israil,” maksudnya, kami menjadikannya saling diwarisi di antara mereka dari generasi-kegenarasi, yaitu kitab taurat. Kitab tersebut berisikan petunjuk, yang pada dasarnya adalah ilmu tentang hukum-hukum syar’I dan lain-lain, dan juga anjuran kepada kebajikan dan ancaman dai kejahatan. Hal itu tidak dimiliki oleh setiap orang, ia hanya “bagi orang-oang yang berpikir,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 53: (Dan sesungguhnya telah Kami berikan petunjuk kepada Musa) berupa kitab Taurat dan mukjizat-mukjizat (dan Kami wariskan kepada Bani Israel) sesudah Musa tiada (kitab) yakni Taurat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan kisah Musa dengan Fir’aun serta menyebutkan akhir kehidupan Fir’aun dan bala tentaranya, Dia menyebutkan hukum yang umum yang mengena kepada Fir’aun dan penduduk neraka seperti yang disebutkan dalam ayat sebelumnya. Selanjutnya Dia menyebutkan, bahwa Dia telah memberikan kepada Musa petunjuk, yakni ayat-ayat dan ilmu yang dipakai sebagai petunjuk. Yakni Kami jadikan kitab itu (Taurat) diwarisi oleh mereka dari generasi ke generasi. Kitab tersebut mengandung petunjuk, yakni ilmu tentang hukum-hukum syariat dan lainnya, berisikan targhib dan tarhib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 53",
    "description": "Ayat-ayat yang lalu menggambarkan apa yang dialami oleh orang-orang yang durhaka di dalam neraka jahanam. Maka untuk menghindari agar tidak mengalami hal seperti itu, Allah menurunkan petunjuk kepada manusia, seperti apa yang diturunkan kepada nabi musa. 'dan sungguh kami bersumpah bahwa kami telah memberikan petunjuk kepada musa sehingga ia tidak mengalami kesesatan dalam hidupnya; dan kami juga telah mewariskan kitab taurat kepada bani israil. 54. Kitab taurat itu diberikan untuk menjadi petunjuk dalam menempuh jalan supaya tidak tersesat dan juga sebagai peringatan bagi orang-orang yang berpikiran sehat dan mau menerima kebenaran."
  }
]