[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bersabarlah (wahai Rasul) terhadap gangguan orang-orang musyrik, karena sungguh Kami telah menjanjikan kepadamu akan meninggikan kalimatmu, dan janji Kami adalah haq yang tidak diingkari, mohonlah ampunan kepada Allah atas dosamu dan hendaknya kamu selalu menyucikan Tuhanmu dari apa yang tidak layak bagiNya di akhir dan di awal siang hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Bersabarlah -wahai Rasul- atas apa yang kamu hadapi, yaitu pendustaan kaummu dan gangguan mereka terhadapmu. Sesungguhnya janji Allah yang akan memenangkan dan menolongmu adalah benar tidak ada keraguan padanya, maka mintalah ampun kepada Allah, dan bertasbihlah dengan memuji Rabbmu di pagi dan petang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-56. Hai Rasulullah, bersabarlah dalam menghadapi gangguan orang lain; sungguh janji Allah untuk menolongmu melawan para musuh merupakan janji yang benar. Dan mohonlah ampun atas dosamu agar umatmu menjadikanmu teladan mereka; senantiasalah bertasbih dan bertahmid setiap pagi dan petang. Orang-orang yang menentang ayat-ayat Allah qur’aniyah dan kauniyah tanpa memiliki alasan yang benar, sesungguhnya yang ada dalam dada mereka tidak lain hanyalah keengganan untuk mengikuti kebenaran; mereka tidak dapat mencapai keinginan mereka untuk mengalahkan orang-orang beriman. Maka hendaklah kamu berlindung kepada Allah dari keburukan mereka, Dia Maha Mendengar segala perkataan dan Maha Melihat segala keadaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. فَاصْبِر (Maka bersabarlah kamu) Yakni bersabarlah atas gangguan orang-orang musyrik sebagaimana para rasul sebelummu telah bersabar. إِنَّ وَعْدَ اللهِ(karena sesungguhnya janji Allah) Yang dijanjikan bagi para rasul-Nya. حَقٌّ(adalah benar) Yakni tidak akan diingkari, dan tidak diragukan kepastiannya. وَاسْتَغْفِرْ لِذَنۢبِكَ(dan mohonlah ampunan untuk dosamu) Untuk menambah pahalanya, sebab Allah telah menghapus seluruh dosanya yang telah lalu dan yang akan datang. وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِىِّ وَالْإِبْكٰرِ(dan bertasbihlah seraya memuji Tuhanmu pada waktu petang dan pagi) Yakni senantiasalah menyucikan Allah seraya memuji-Nya. Pendapat lain mengatakan yang dimaksud adalah, dirikanlah shalat ashar dan shalat subuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Maka bersabarlah wahai nabi terhadap siksaan orang-orang musyrik. Sesungguhnya janji Allah berupa pertolonganNya dan tingginya kalam Allah itu pasti terjadi dan tidak akan berubah selamanya. Beristighfarlah atas dosamu dan untuk menambah pahalamu. Keberadaanmu sebagai pemimpin umat itu bertujuan agar mereka tidak putus asa terhadapmu. Sucikanlah Allah dengan disertai bertahmid dan bersyukur kepadaNya dan tetaplah melakukan hal itu di sore dan pagi hari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bersabarlah, sesungguhnya janji Allah itu benar, mohonlah ampunan untuk dosamu, dan bertasbihlah dengan memuji Tuhanmu pada waktu petang dan pagi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “maka bersabarlah kamu” wahai rasul, sebagaimana para ulul azmi sebelummu telah bersabar, “karena sesungguhnya janji Allah itu benar.” Maksudnya tidak akan ada keraguan di dalamnya maupun kedustaan, sehingga kami harus merasa sulit untuk sabar. Sesungguhnya ia adalah kebenaran murni dan petunjuk belaka yang karenanya kaum yang sabar besabar dan orang –orang yang berakal bersungguh-sungguh berpegang teguh kepadanya. Ungkapan “sesungguhnya janji Allah itu benar” termasuk ungkapan yang menghimbau untuk bersikap sabar dalam menjalankan ketaatan kepada Allah dan menjauhi Apa yang Allah sukai. “dan mohon ampunlah untuk dosamu,” yang menghalangimu untuk meraih kemenangan dan kebahagiaa mu. jadi, Allah memerintahkannya untuk besabar yang dengannya harapan dan dicapai, dan disuruh beristigfar di dalamnya terkandung perlindungan dari hal yang membahayakan, dan bertasbih memuji Allah teutama “pada waktu petang dan pagi,” yang keduanya merupakan dua waktu yang paling utama. Pada keduanya dilaksanakan berbagai wirid, tugas-tugas yang wajib dan yang Sunnah; karena semua itu menjadi pertolongan atas semua persoalan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 55: (Maka bersabarlah kamu) hai Muhammad (karena sesungguhnya janji Allah itu) untuk menolong kekasih-kekasih-Nya (benar) dan kamu beserta orang-orang yang mengikutimu adalah termasuk kekasih-kekasih-Nya (dan mohonlah ampun untuk dosamu) supaya hal ini dijadikan teladan bagi umatmu (dan bertasbihlah) yakni, salatlah seraya (memuji Rabbmu pada waktu petang) yaitu sesudah matahari tergelincir (dan pagi) yang dimaksud adalah salat lima waktu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Wahai Muhammad sebagaimana para rasul ulul ‘azmi sebelummu bersabar. Untuk menolong para wali-Nya. Kata-kata ini mendorong untuk bersabar di atas ketaatan kepada Allah dan menjauhi larangan-Nya. Karena dosa itu menghalangimu dari memperoleh kemenangan dan kebahagiaan. Maka Allah Subhaanahu wa Ta'aala memerintahkan Beliau untuk bersabar agar memperoleh sesuatu yang dicintai, memerintahkan beristighfar agar terhindar dari bahaya, serta bertasbih sambil memuji Allah khususnya pada waktu petang dan pagi hari, karena keduanya adalah waktu yang utama; terdapat wirid dan amalan utama dan lagi karena hal itu membantu Beliau untuk bersabar. Ada pula yang menafsirkan dengan shalat lima waktu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 55",
    "description": "Demikian pula yang terjadi terhadap nabi Muhammad. Beliau telah dianugerahi kitab serta dijanjikan akan beroleh kemenangan menghadapi orang-orang musyrik mekah. 'maka tetaplah tabah dan bersabarlah kamu, wahai nabi Muhammad, sesungguhnya janji Allah tentang akan beroleh kemenangan itu adalah janji yang benar, dan oleh sebab itu, mohonlah ampun untuk dosamu dan ajaklah para pengikutmu melakukannya serta bertasbihlah menyucikan Allah dari segala bentuk ketidakwajaran seraya memuji keagungan dan kebesaran tuhanmu pada waktu petang dan pagi. 56. Orang-orang durhaka itu mendustakan wahyu Allah dengan cara mendebat untuk menolak apa yang dikandung oleh wahyu Allah tersebut. Sesungguhnya orang-orang yang senantiasa mendebat untuk menolak kebenaran ayat-ayat Allah yang begitu jelas dan terang benderang tanpa alasan dan bukti-bukti yang sampai kepada mereka, maka yang ada dalam dada mereka hanyalah keinginan akan kebesaran dan keangkuhan agar dapat menyaingimu, wahai nabi Muhammad, yang hal itu pasti tidak akan pernah mereka capai. Maka oleh sebab itu, mintalah perlindungan kepada Allah. Sungguh, dia, maha mendengar lagi maha melihat. '."
  }
]