[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menolak kebenaran dengan kebatilan, menolak hujjah-hujjah Allah yang shahih dengan syubhat-syubhat yang rusak tanpa ada bukti dan hujjah dari Allah, di dalam dada mereka hanyalah ada kesombongan untuk menerima kebenaran ditambah dengan kedengkian dari mereka atas karunia yang Allah berikan kepada NabiNya dan kemuliaan derajat kenabian yang Dia limpahkan kepadanya, sesuatu yang tidak akan mereka dapatkan dan raih, maka berlindunglah kepada Allah dari keburukan mereka. Sesungguhnya Allah Maha Mendengar perkataan-perkataan mereka, Maha Melihat perbuatan-perbuatan mereka dan Dia akan membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Sesungguhnya orang-orang yang membantah ayat-ayat Allah sebagai usaha untuk membatalkannya tanpa hujah dan bukti, yang mendorong mereka berbuat demikian hanyalah ambisi untuk menguasai dan menyombongkan diri di depan kebenaran, mereka tidak akan pernah bisa mewujudkan apa yang mereka inginkan. Maka berlindunglah -wahai Rasul- kepada Allah. Sesungguhnya Allah Maha Mendengar perkataan hamba-hamba-Nya, Maha Melihat amal-amal mereka, tidak ada sesuatu pun yang luput dari Allah dan Dia akan membalas mereka atasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. إِنَّ الَّذِينَ يُجٰدِلُونَ فِىٓ ءَايٰتِ اللهِ بِغَيْرِ سُلْطٰنٍ أَتَىٰهُمْ ۙ (Sesungguhhnya orang-orang yang memperdebatkan tentang ayat-ayat Allah tanpa alasan yang sampai kepada mereka) Yakni tanpa hujjah yang jelas yang datang dari Allah. إِن فِى صُدُورِهِمْ إِلَّا كِبْرٌ(tidak ada dalam dada mereka melainkan hanyalah (keinginan akan) kebesaran) Yakni kesombongan mereka terhadap kebenaran membuat mereka mendustakanmu. مَّا هُم بِبٰلِغِيهِ ۚ(yang mereka sekali-kali tiada akan mencapainya) Yakni mereka menyombongkan diri atas Muhammad dan berharap dapat menyakitimu, namun mereka tidak dapat mencapai harapan mereka itu. atau mereka sangat berusaha untuk dapat membunuhmu dan sebagainya namun mereka tidak dapat melakukan itu. فَاسْتَعِذْ بِاللهِ ۖ إِنَّهُۥ هُوَ السَّمِيعُ الْبَصِيرُ(maka mintalah perlindungan kepada Allah. Sesungguhnya Dia Maha Mendengar lagi Maha Melihat) Yakni maka mintalah perlindungan Allah dari keburukan, tipu daya, dan kezaliman mereka, Dia Maha Mendengar ucapan mereka dan Maha Melihat perbuatan mereka, tidak ada sedikitpun yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Sesungguhnya orang-orang yang berdebat tentang ayat-ayat Al-Qur’an tanpa hujjah dan bukti-bukti yang datang dari Allah, maka di dalam hati mereka itu tidak lain hanya enggan untuk mengikuti kebenaran. Apa yang mereka sampaikan hanyalah keinginan mereka yaitu kepemimpinan dan keunggulan atas nabi. Maka berlindunglah kepada Allah atas kejahatan dan tipu daya mereka. Sesungguhnya Allah itu Maha mendengar ucapan mereka dan Maha melihat keadaan dan tindakan mereka. Ayat ini diturunkan untuk orang-orang yang mengingkari hari kebangkitan, orang-orang musyrik Mekah dan orang-oang kafir secara umum"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang mendebat} membantah {ayat-ayat Allah tanpa alasan} dalil dan bukti {yang sampai kepada mereka, tidak ada dalam dada mereka} tidak ada dalam hati mereka {kecuali kesombongan yang tidak akan mereka capai} Dengan harapan dan kehendak mereka tas kesombongan itu, mereka tidak akan mampu memadamkan kebenaran dan meninggikan kebathilan {maka mintalah pelindungan} maka mintalah perlindungan {kepada Allah. Sesungguhnya Dia Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Allah mengabarkan bahwasannya oang-orang yang memperdebatkan ayat-ayatNya untuk membatalkannya dengan kebatilan tanpa bukti yang jelas dariNYa dan tanpa hujjah (argument), adalah besumberr dari kesombongan yang ada dalam dada mereka terhadap kebenaran dan terhadap orang yang membawa kebenaran itu. Mereka ingin menguasainya (menganiayanya) dengan kebatilan yang mereka miliki. Inilah tujuan dan keinginan meeka. Namun semua ini tidak akan tejadi dan mereka tidak akan mencapainya. Ini adalah nash (penyataan) yang sangat tegas dan berita gembira bahwa setiap orang yang memperdebatkan kebenaran pasti kalah, dan siapa saja yang menyombongkan diri terhadapnya, maka pada akhirnya ia hina. “maka mintalah perlindungan,” maksudnya, maka berlindung dan kembalilah “kepada Allah,” disini tidak disebutkan permohonan dan perlindungan dari apa, adalah agar maknanya umum. Maka maknanya adalah: mintalah perlindungan kepada Allah dari sifat sombong yang bisa berakibat takabbur terhadap kebenaran, dan mohonlah perlindungan kepada Allah dari seluruh kejahatan. “sesungguhnya Dia Maha mendengar” segenap suara dengan berbagai perbedaannya, “lagi Maha Melihat,” seluruh yang dapat dilihat di mana saja dan kapan saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 56: (Sesungguhnya orang-orang yang memperdebatkan tentang ayat-ayat Allah) yakni Alquran (tanpa alasan) tanpa argumentasi (yang sampai kepada mereka, tidak ada) (dalam dada mereka melainkan hanyalah keinginan akan kebesaran) yakni tinggi diri dan tamak ingin mengatasi kamu (yang mereka sekali-kali tiada akan mencapainya maka mintalah perlindungan) dari kejahatan mereka (kepada Allah. Sesungguhnya Dia Maha Mendengar) akan semua perkataan mereka (lagi Maha Melihat) keadaan mereka; ayat ini diturunkan berkenaan dengan orang-orang yang ingkar kepada hari berbangkit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa orang yang memperdebatkan ayat-ayat-Nya untuk membatalkannya dengan kebatilan bukan dengan hujjah, maka sesungguhnya hal itu muncul dari kesombongan yang ada dalam hati mereka kepada kebenaran dan kepada orang yang membawanya, dan bahwa mereka menginginkan kebesaran dengan kebatilan itu. Inilah tujuan dan maksud mereka. Tetapi tujuan mereka tidak akan tercapai dan mereka tidak akan sampai kepadanya. Ayat ini merupakan nash yang tegas dan kabar gembira, bahwa orang yang mendebat kebenaran pasti akan kalah, dan bahwa setiap orang yang sombong terhadapnya, maka akan berakhir kepada kehinaan. Maksudnya mereka menolak ayat-ayat Allah tanpa alasan yang datang kepada mereka. Dari kejahatan mereka. Adapun menurut Syaikh As Sa’diy, tidak disebutkan dari apa seseorang berlindung menunjukkan umum, yakni hendaknya ia berlindung kepada Allah dari kesombongan itu sendiri yang membuat seseorang menolak yang hak, demikian pula hendaknya ia berlindung dari setan baik dari kalangan jin maupun manusia serta berlindung dari semua keburukan. Semua ucapan mereka. Semua keadaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 56",
    "description": "Orang-orang durhaka itu mendustakan wahyu Allah dengan cara mendebat untuk menolak apa yang dikandung oleh wahyu Allah tersebut. Sesungguhnya orang-orang yang senantiasa mendebat untuk menolak kebenaran ayat-ayat Allah yang begitu jelas dan terang benderang tanpa alasan dan bukti-bukti yang sampai kepada mereka, maka yang ada dalam dada mereka hanyalah keinginan akan kebesaran dan keangkuhan agar dapat menyaingimu, wahai nabi Muhammad, yang hal itu pasti tidak akan pernah mereka capai. Maka oleh sebab itu, mintalah perlindungan kepada Allah. Sungguh, dia, maha mendengar lagi maha melihat. '57. Titik fokus yang mereka debat dari pemberitaan ayat-ayat Allah itu adalah pada kebangkitan manusia dari alam kubur. Maka, Allah membantahnya dengan menyebut bahwa penciptaan langit dan bumi lebih besar peristiwanya daripada hanya sekadar menciptakan kembali manusia yang sudah mati. Sungguh, bahwa penciptaan langit dan bumi itu, jauh lebih besar serta lebih hebat memperlihatkan kemahakuasaan Allah, daripada hanya sekadar penciptaan manusia kembali untuk bangkit dari kubur. Akan tetapi, kebanyakan manusia, yakni orang-orang yang durhaka, tidak mengetahui hakikat perbandingan antara penciptaan langit dan bumi serta membangkitkan manusia dari kubur."
  }
]