[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penciptaan Allah terhadap langit dan bumi adalah lebih besar daripada penciptaan manusia dan mengembalikan mereka hidup kembali setelah mereka mati, akan tetapi kebanyakan manusia tidak mengetahui bahwa menciptakan semua itu adalah mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Penciptaan langit dan bumi dengan kebesaran dan keluasan keduanya adalah lebih besar dibandingkan penciptaan manusia. Yang menciptakan keduanya dengan keagungan keduanya tentu Mahakuasa untuk membangkitkan manusia dari alam kubur mereka dalam keadaan hidup untuk menghisab dan membalas mereka, akan tetapi kebanyakan manusia tidak mengetahui, maka mereka tidak mengambil pelajaran darinya dan tidak menjadikannya sebagai bukti atas kebangkitan sekalipun itu sangat jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57-58. Allah menjelaskan keagungan kuasa-Nya atas seluruh makhluk dan perkara membangkitkan mereka merupakan hal yang mudah bagi-Nya: Sungguh penciptaan Allah terhadap tujuh langit dan bumi lebih besar daripada penciptaan-Nya terhadap manusia dan pembangkitan mereka setelah kematian; akan tetapi kebanyakan hamba yang tidak mengetahui hal ini. Sebagaimana tidak sama antara orang buta dengan yang dapat melihat, demikian pula tidak sama antara orang beriman yang menjalankan ketaatan, dengan orang yang mendustakan Allah yang selalu melakukan dosa. Sungguh sedikit kalian mengambil pelajaran dan peringatan wahai para hamba."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. لَخَلْقُ السَّمٰوٰتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ (Sesungguhnya penciptaan langit dan bumi lebih besar daripada penciptaan manusia) Yakni keduanya lebih besar dalam jiwa karena kebesaran ukuran keduanya dan kekokohan keduanya tanpa tiang serta planet-planet yang beredar pada orbitnya. Maka bagaimana mereka mengingkari hari kebangkitan yang lebih remeh daripada keduanya dari segala sisi, sebagaimana disebutkan dalam firman-Nya: أوليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم “Dan tidaklah Tuhan yang menciptakan langit dan bumi itu berkuasa menciptakan yang serupa dengan itu?” (Yasin: 81) وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ(akan tetapi kebanyakan manusia tidak mengetahui) Yakni tidak mengetahui keagungan kuasa Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Kemudian Allah menanggapi orang-orang kafir yang mengingkari hari kebangkitan itu dengan menjelaskan bahwa sesungguhnya penciptaan langit dan bumi untuk mengawali adanya alam semesta itu lebih agung daripada pembangkitan manusia setelah mati, namun kebanyakan manusia tidak mengetahui sesuatu yang berada dalam kekuasaan Allah dan tidak mau berangan-angan tentang kelupaan mereka, serta mengikuti hawa nafsu mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh penciptaan langit dan bumi itu lebih besar daripada penciptaan manusia, tetapi kebanyakan manusia tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Allah mengabarkan apa yang sudah di terima oleh akal sehat bahwa “sungguh penciptaan langit dan bumi,” dengan segala kebesaran dan keluasan keduanya lebih agung dan “lebih besar daripada penciptaan manusia,” manusia, bila dibandingkan dengan langit dan gunung sungguh sangat amat kecil sekali. Maka yang telah kuasa menciptakan planet-planet raksasa dan dengan sangat rapi itu kuasa pula mengulangi penciptaan manusia. Ini adalah salah satu bukti (dalil) rasional yang membuktikan kebenaran kebangkitan dengan pembuktian yang pasti walau hanya dengan perenungan pikiran sederhana padanya, ia dapat dibuktikan dengan pembuktian yang tidak menerima keraguan dan kerancuan tentang benarnya apa yang disampaikan oleh para rasul, seperti akan dihidupkannya kembali manusia. Dan tidak setiap orang mengarahkan pikirannya ke sana dan konsentrasi merenungkannya. Maka dari itu Allah berfiman, “akan tetapi kebanyakan manusia tiada mengetahui.” Maka dari itu mereka tidak mengambil pelajaran, dan tidak pula mereka menghiraukannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 57: (Sesungguhnya penciptaan langit dan bumi) yakni permulaannya (lebih besar daripada penciptaan manusia) untuk yang kedua kalinya, yaitu mengulanginya (tetapi kebanyakan manusia) yakni orang-orang kafir Mekah (tidak mengetahui) hal tersebut, perihal mereka sama dengan orang buta, sedangkan orang yang mengetahui hal tersebut perumpamaannya sama dengan orang yang melihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun berkenaan dengan orang-orang yang mengingkari kebangkitan. Allah Subhaanahu wa Ta'aala mengingatkan sesuatu yang telah diakui oleh akal, bahwa penciptaan langit dan bumi dengan keadaannya yang besar dan luas adalah lebih besar daripada penciptaan manusia, karena manusia jika dibandingkan dengan langit dan bumi, maka tidak ada artinya, bahkan ia sebagai makhluk yang sangat kecil. Nah, Tuhan yang mampu menciptakan makhluk-makhluk yang besar itu dan merapikannya, mampu mengulangi penciptaan manusia setelah mereka mati. Ini merupakan salah satu dalil ‘aqli (akal) yang menunjukkan benarnya kebangkitan. Namun sayang, kebanyakan manusia tidak mau memikirkan hal itu. Oleh karena itu, di akhir ayat Allah Subhaanahu wa Ta'aala berfirman, “Akan tetapi kebanyakan manusia tidak mengetahui.” Mereka yang tidak mengetahui ini seperti orang yang buta, sedangkan orang yang mengetahuinya seperti orang yang melihat, dan tidak sama antara orang yang buta dengan orang yang melihat sebagaimana dijelaskan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 57",
    "description": "Titik fokus yang mereka debat dari pemberitaan ayat-ayat Allah itu adalah pada kebangkitan manusia dari alam kubur. Maka, Allah membantahnya dengan menyebut bahwa penciptaan langit dan bumi lebih besar peristiwanya daripada hanya sekadar menciptakan kembali manusia yang sudah mati. Sungguh, bahwa penciptaan langit dan bumi itu, jauh lebih besar serta lebih hebat memperlihatkan kemahakuasaan Allah, daripada hanya sekadar penciptaan manusia kembali untuk bangkit dari kubur. Akan tetapi, kebanyakan manusia, yakni orang-orang yang durhaka, tidak mengetahui hakikat perbandingan antara penciptaan langit dan bumi serta membangkitkan manusia dari kubur. 58. Sangatlah benar bahwa orang-orang yang mampu menangkap hakikat tersebut tidak sama dengan orang yang tidak mampu melakukan dan memahaminya, sehingga Allah menegaskan bahwa tidak sama orang yang buta mata hatinya dengan orang yang mampu melihat dengan mata hatinya, dan dengan demikian, tidak sama pula orang-orang yang beriman kepada kebenaran wahyu Allah dan mengerjakan kebajikan de-ngan orang-orang durhaka yang berbuat kejahatan. Hanya sedikit sekali dari perbandingan itu yang kamu ambil dan jadikan pelajaran, wahai manusia."
  }
]