[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang melihat tidak sama dengan orang buta, demikian juga orang-orang yang beriman yang mengakui bahwa Allah adalah Tuhan Yang Haq yang tidak ada sekutu bagiNya, juga memenuhi seruan rasul-rasulNya dan mengamalkan SyariatNya tidak sama dengan orang-orang yang mengingkari dan memungkiri bahwa Allah adalah Tuhan Yang Haq, mendustakan rasul-rasulNya dan tidak mengamalkan SyariatNya. Hanya sedikit kalian (wahai manusia) merenungkan hujjah-hujjah Allah, lalu mengambil pelajaran dan nasihat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Tidak sama antara orang yang bisa melihat dengan orang yang tidak bisa melihat, tidak sama orang-orang yang beriman kepada Allah, membenarkan para rasul-Nya serta melakukan ramal baik, mereka tidak sama dengan orang yang buruk amalnya karena akidah yang rusak dan perbuatan maksiat. Dan kalian tidak memikirkan kecuali sedikit saja, karena bila kalian memikirkan niscaya kalian mengetahui perbedaan di antara kedua belah pihak, selanjutnya kalian akan berusaha masuk ke dalam rombongan orang-orang yang beriman dan beramal saleh demi mendapatkan rida Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَمَا يَسْتَوِى الْأَعْمَىٰ وَالْبَصِيرُ (Dan tidaklah sama orang yang buta dengan orang yang melihat) Yakni antara orang yang berdebat untuk kebatilan dan orang yang berdebat untuk kebenaran. وَالَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ وَلَا الْمُسِىٓءُ ۚ( dan tidaklah (pula sama) orang-orang yang beriman serta mengerjakan amal saleh dengan orang-orang yang durhaka) Dan tidak sama antara orang yang baik dengan imannya dan beramal shalih dengan orang yang buruk dengan kekafiran dan kemaksiatan. قَلِيلًا مَّا تَتَذَكَّرُونَ (Sedikit sekali kamu mengambil pelajaran)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Orang kafir dengan mukmin, orang bodoh dengan berilmu, serta orang yang pelupa dengan cerdas itu tidak sama. Begitu juga orang baik yang beriman dan beramal shalih dengan orang jahat yang perbuatannya terbatas pada kekufuran dan kemaksiatan itu tidak sama. Yang kalian ambil pelajarannya itu hanya sedikit wahai manusia. Maknanya pengetahuan mereka tentang hukum itu sangat sedikit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah sama orang buta dengan orang yang melihat. Tidak pula orang-orang yang beriman dan beramal shalih dengan orang-orang yang berbuat keburukan} orang yang berbuat keburukan {Sedikit sekali kalian mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. kemudian Allah berfirman,” Dan tidaklah sama orang yang buta dengan orang yang melihat, dan tidaklah pula sama orang-orang yang beriman serta mengerjakan amal shalih dengan orang-orang yang duhaka.” Maksudnya, sebagaimana halnya tidak sama orang yang buta dengan yang melihat, maka demikian pula tidak sama orang yang berriman kepada Allah dan beamal shalih dengan orang yang menyombongkan diri untuk beribadah kepada Allah, berani melakukan kemaksiatan-kemaksiatan dan selalu melakukan perbuatan-perbuatan yang dimurkaiNYa. “sedikit sekali kamu mengambil pelajaran,” maksudnya, kesadaran kalian sangat minim sekali. Sebab, seandainya kalian menyadari tingkatan-tingkatan berbagai perrkara, kedudukan kebaikan-kebaikan dan keburukan, dan perbedaan antara orang-orang yang bebakti dengan orang-orang yang durhaka sedangkan kalian mempunyai keinginan tinggi tentu kalian mengutamakan yang bermanfaat daripada yang buruk, petunjuk daripada kesesatan dan kebahagiaan abadi daripada dunia fana ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 58: (Dan tidaklah sama orang yang buta dengan orang yang melihat, dan) tidak sama pula (orang-orang yang beriman serta mengerjakan amal saleh) yaitu orang yang selalu berbuat kebaikan (dengan orang-orang yang durhaka) di dalam lafal ayat ini terdapat tambahan huruf Laa (Sedikit sekali kalian mengambil pelajaran) mengambil nasihat; dapat dibaca Yatadzakkaruuna atau Tatadzakkaruuna, yakni kesadaran mereka terhadap hal ini sangat sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalau sekiranya kamu banyak mengambil pelajaran, memperhatikan tempat orang-orang yang baik dan orang-orang yang buruk, perbedaan antara keduanya dan kamu memiliki cita-cita yang tinggi, tentu kamu akan mengutamakan yang bermanfaat daripada yang berbahaya, petunjuk daripada kesesatan serta kebahagiaan yang kekal daripada kesenangan dunia yang sementara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 58",
    "description": "Sangatlah benar bahwa orang-orang yang mampu menangkap hakikat tersebut tidak sama dengan orang yang tidak mampu melakukan dan memahaminya, sehingga Allah menegaskan bahwa tidak sama orang yang buta mata hatinya dengan orang yang mampu melihat dengan mata hatinya, dan dengan demikian, tidak sama pula orang-orang yang beriman kepada kebenaran wahyu Allah dan mengerjakan kebajikan de-ngan orang-orang durhaka yang berbuat kejahatan. Hanya sedikit sekali dari perbandingan itu yang kamu ambil dan jadikan pelajaran, wahai manusia. 59. Setelah menegaskan bahwa menciptakan langit dan bumi merupakan pekerjaan yang jauh lebih besar dibandingkan dengan membangkitkan manusia dari kubur, maka sekarang Allah mempertegas keniscayaan akan datangnya kiamat. Sesungguhnya hari kiamat yang dijanjikan itu pasti akan datang, tidak ada keraguan tentang kedatangan-Nya sedikit pun. Akan tetapi, kebanyakan manusia tidak beriman walaupun sudah terlalu banyak bukti yang diperlihatkan untuk itu."
  }
]