[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kiamat pasti datang, tidak ada kebimbangan padanya, maka yakinlah bahwa ia akan datang sebagaimana hal itu telah dikabarkan oleh para Rasul, akan tetapi kebanyakan manusia tidak mempercayai kehadirannya dan tidak beramal untuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Sesungguhnya hari Kiamat yaitu pada saat Allah membangkitkan manusia dari alam kubur untuk dihisab dan diberi balasan amal pasti datang, tidak bisa tidak, tidak ada keraguan padanya, akan tetapi kebanyakan manusia tidak membenarkan kedatangannya, karena itu mereka tidak menyiapkan diri untuk menghadapinya dengan iman dan amal saleh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Sungguh hari kiamat pasti akan datang, tanpa diragukan lagi; akan tetapi kebanyakan hamba tidak mempercayai hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. إِنَّ السَّاعَةَ لَاٰتِيَةٌ لَّا رَيْبَ فِيهَا (Sesungguhnya hari kiamat pasti akan datang, tidak ada keraguan tentangnya) Yakni tidak diragukan kedatangan dan kejadiannya. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ (akan tetapi kebanyakan manusia tiada beriman) Yakni mereka tidak beriman kepada hari kiamat karena pemahamannya yang pendek dan akal mereka yang lemah untuk memahami hujjah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Sesungguhnya kiamat itu pasti datang, dan tidak dapat diragukan. Akan tetapi, kebanyakan manusia tidak mempercayai hal itu dan tidak membenarkannya karena pikiran dan proses akal mereka lemah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya hari kiamat} hari kiamat {pasti akan datang. Tidak ada keraguan tentangnya} tidak ada keraguan tentang itu {tetapi kebanyakan manusia tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. “sesungguhnya hari kiamat pasti akan datang, tiada keraguan tentangnya.” Sesudah diberitakan oleh semua rosul yang merupakan manusia yang paling jujur dan dibicarakan oleh kitab-kitab suci samawi yang seluruh informasinya merupakan tingkatan kebenaran yang paling tinggi, dan telah dibuktikan oleh berbagai bukti-bukti yang dapat dilihat dan tanda-tanda di alam semesta, “akan tetapi kebanyakan manusia tidak beriman” terhadap permasalahan-permasalahan yang mengharuskan penuh keimanan dan rasa tunduk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 59: (Sesungguhnya hari kiamat pasti akan datang, tidak ada keraguan) artinya, tidak diragukan lagi (tentangnya, akan tetapi kebanyakan manusia tidak beriman) kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para rasul yang merupakan manusia paling jujur telah memberitahukannya, kitab-kitab samawi telah menyebutkannya, dimana berita dari semua itu menduduki posisi paling atas dalam kebenarannya, disamping didukung oleh penguat yang dapat disaksikan dan ayat-ayat yang ada di ufuk. Meskipun banyak dalilnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 59",
    "description": "Setelah menegaskan bahwa menciptakan langit dan bumi merupakan pekerjaan yang jauh lebih besar dibandingkan dengan membangkitkan manusia dari kubur, maka sekarang Allah mempertegas keniscayaan akan datangnya kiamat. Sesungguhnya hari kiamat yang dijanjikan itu pasti akan datang, tidak ada keraguan tentang kedatangan-Nya sedikit pun. Akan tetapi, kebanyakan manusia tidak beriman walaupun sudah terlalu banyak bukti yang diperlihatkan untuk itu. 60. Dengan semakin dekat hari kiamat, Allah kemudian mengajak manusia dengan kasih sayang-Nya agar datang dan mendekatkan diri kepada-Nya. Dan tuhanmu berfirman, 'berdoalah kepada-ku dengan mendekatkan diri, niscaya akan aku perkenankan bagimu apa yang kamu harapkan berupa hidayah dan anugerah nikmat. Sesungguhnya orang-orang yang angkuh dan sombong sehingga membuat mereka tidak mau menyembah-ku, mereka akan masuk ke dalam neraka jahanam dalam keadaan hina dina. '."
  }
]