[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana hukumanKu benar-benar telah menimpa umat-umat terdahulu yang mendustakan para RasulNya, maka ketetapanKu pasti berlaku pula atas orang-orang kafir bahwa mereka adalah penduduk neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sebagaimana Allah menghukum dengan membinasakan umat-umat yang mendustakan, telah pasti (berlaku) kalimat Rabbmu -wahai Rasul- atas orang-orang yang kafir bahwa mereka adalah para penghuni Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai Rasulullah, sebagaimana Kami telah membinasakan orang-orang yang mendustakan para rasul sebelummu, maka orang-orang kafir ini juga layak mendapatkan azab. Demikianlah ketetapan azab atas kaummu yang mendustakan, mereka adalah penghuni nereka yang kekal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَكَذٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى الَّذِينَ كَفَرُوٓا۟ (Dan demikianlah telah pasti berlaku ketetapan azab Tuhanmu terhadap orang-orang kafir) Yakni sebagaimana telah berlaku ketetapan azab bagi umat-umat yang mendustakan rasul mereka, maka berlaku pulalah ketetapan azab itu bagi orang-orang yang mendustakanmu, membantahmu dengan batil, dan berkumpul untuk mengalahkanmu hai Muhammad. أَنَّهُمْ أَصْحٰبُ النَّارِ(karena sesungguhnya mereka adalah penghuni neraka) Dan ketetapan itu yaitu bahwa mereka berhak mendapatkan neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Ketetapan Tuhanmu pasti terjadi, yaitu kebinasaan dan janji-Nya memesukkan orang kafir uamt terdahulu ke dalam neraka. Itu juga berlaku bagi orang kafir dari kaum, yang ditunjukkan pada kalimat: “annahum mustahiqquu annara”, bahwa mereka akan menerima azab neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah, ketetapan Tuhanmu itu berlaku} wajib dan berlaku {bagi orang-orang yang ingkar bahwa mereka adalah para penghuni neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Dan demikianlah, telah pasti berlakuk ketetapan azab Rabbmu terhadap orang-orang kafir,” maksudnya, sebagaimana ketetapan itu telah ditetapkan terhadap orang-orang terdahulu, maka demikian pula ketetapan kesesatan telah dipastikan terhadap mereka, yang karenanya azab ditimpakan kepada mereka. Maka dari itu dikatakan “sesungguhnya mereka adalah penghuni neraka”."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 6: (Dan demikianlah telah pasti berlaku ketetapan azab Rabbmu) sebagaimana yang telah diungkapkan-Nya dalam firman yang lain, yaitu, \"Sesungguhnya akan Aku penuhi neraka Jahanam itu...\" (Q.S. As-Sajdah, 13) (terhadap orang-orang kafir, karena sesungguhnya mereka adalah penghuni neraka) lafal Annahum Ashhaabun Naari merupakan Badal dari lafal Kalimatu Rabbika."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana berlaku ketetapan Allah Subhaanahu wa Ta'aala terhadap generasi terdahulu yang mendustakan, maka berlaku pula terhadap mereka yang mendustakan sekarang ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 6",
    "description": "Dan sebagaimana telah dijatuhkan sanksi kepada umat terdahulu yang durhaka, demikianlah juga telah pasti berlaku ketetapan tuhanmu dalam bentuk azab yang pedih terhadap orang-orang kafir dari umatmu, wahai nabi Muhammad, yaitu sesungguhnya mereka, orang-orang musyrik mekah, itu adalah penghuni neraka. 7. Pada ayat-ayat yang lalu telah digambarkan bagaimana bentuk permusuhan yang dilakukan oleh orang-orang kafir terhadap para rasul dan orang-orang beriman. Maka, untuk mengimbangi hal itu, ayat-ayat berikut menggambarkan bagaimana bentuk kasih sayang para malaikat terhadap para rasul dan orang-orang beriman. Ketahuilah bahwa malaikat-malaikat yang memikul 'arsy dan juga malaikat yang berada di sekelilingnya, bertasbih dengan memuji tuhannya, dan mereka semua senantiasa beriman kepada-Nya, serta memohonkan ampunan untuk orang-orang yang beriman seraya bermohon, 'ya tuhan kami, rahmat dan ilmu yang ada pada-Mu sangatlah luas, dan meliputi segala sesuatu. Maka, atas perkenan-Mu, ya Allah, berilah ampunan kepada orang-orang yang bertobat kembali ke jalan-Mu dan orang yang sejak awal telah mengikuti jalan agama-Mu, dan peliharalah mereka dari azab dan siksa neraka yang apinya menyala-Nyala."
  }
]