[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan kalian (wahai para hamba) telah berfirman, “Berdoalah hanya kepadaKu semata dan khususkanlah ibadah hanya bagiKu, niscaya Aku menjawab untuk kalian. Sesungguhnya orang-orang yang menyombongkan diri sehingga mereka menolak untuk mengakui keesaanKu dalam ubudiyah dan uluhiyahKu, mereka akan masuk ke dalam Neraka Jahanam dalam keadaan hina dina.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Rabb kalian -wahai manusia- berfirman, “Esakanlah Aku dalam (doa) ibadah dan permintaa, nisacaya Aku akan memperkenankan doa kalian, memaafkan kalian dan merahmati kalian. Sesungguhnya orang-orang yang menyombongkan diri dari beribadah kepada-Ku akan masuk ke neraka Jahanam pada hari Kiamat dalam keadaan hina dina.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Pencipta kalian dan Pengatur urusan kalian berfirman: “Hai manusia, mintalah kepada-Ku niscaya Aku akan mengabulkannya; sungguh orang-orang yang enggan berdoa kepada-Ku dan mentaati-Ku pasti akan masuk neraka Jahannam dalam keadaan hina.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَقَالَ رَبُّكُمُ ادْعُونِىٓ أَسْتَجِبْ لَكُمْ ۚ (Dan Tuhanmu berfirman: “Berdoalah kepada-Ku, niscaya akan Kuperkenankan bagimu) Yang dimaksud dengan doa yakni permoohonan untuk mendapatkan manfaat dan dijauhkan dari mudharat. Berdoa merupakan suatu ibadah, bahkan ia adalah isi ibadah itu sendiri, sebagaimana disebutkan dalam hadits shahih serta ayat ini juga merupakan dalil tentang hal ini, kerena Allah berfirman “Berdoalah kepada-Ku, niscaya akan Kuperkenankan bagimu” kemudian melanjutkan “Sesungguhnya orang-orang yang menyombongkan diri dari menyembah-Ku” yakni dari berdo’a kepada-Ku. Dengan ini barangsiapa yang memohon dari orang-orang mati untuk memenuhi kebutuhannya serta mendatangkan kepadanya manfaat dan menjauhkan dari mudharat, maka ia telah menyembah mereka dengan do’anya itu dan dengan sangkaannya bahwa mereka mengetahui hal ghaib serta mempersembahkan sesuatu yang tidak boleh dipersembahkan kecuali kepada Allah. Dan berdoa kepada selain Allah tidak memberi manfaat sedikitpun bagi orang yang berdoa itu, sebab yang mampu mengabulkan do’a hanyalah Allah, dan Dia telah memerintahkan hamba-hamba-Nya untuk berdo’a kepada-Nya dan menjanjikan kepada mereka akan mengabulkannya, dan janji-Nya pasti benar. إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِى(Sesungguhnya orang-orang yang menyombongkan diri dari menyembah-Ku) Yakni dari berdo’a kepada-Ku. سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ(akan masuk neraka Jahannam dalam keadaan hina dina”) Ini merupakan ancaman keras bagi orang yang enggan berdo’a kepada Allah kerena kesombongannya. Maka wahai hamba-hamba Allah, sampaikan dan sandarkanlah segala keinginan dan permohonan kalian kepada Dzat yang memerintahkan kalian untuk menyampaikan doa kepada-Nya, dan yang telah menjamin kalian untuk mengabulkannya, sebab Dialah yang Maha Pemurah yang mengabulkan doa orang yang berdoa kepada-Nya, dan murka terhadap orang yang enggan meminta karunia-Nya yang agung dan kekayaan-Nya yang luas, baik itu mengenai kebutuhan dunia maupun akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Tuhan kalian berkata: “Sembahlah Aku, maka Aku akan memberimu pahala dan memintalah kepadaKu, maka Aku akan memberimu” Makna doa tersebut adalah meminta kemanfaatan dan meminta perlindungan dari kemudharatan. Hal itu menurutNya adalah bentuk ibadah, karena doa adalah inti ibadah, sebagaimana dalam hadits shahih. Sesungguhnya orang-orang yang enggan menyembahKu dan berdoa kepadaKu akan dimasukkan ke dalam neraka Jahanam dengan keadaan rendah dan hina. Ini adalah janji bagi setiap orang yang enggan menyembah Allah dan berdoa kepadaNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhan kalian berfirman,“Berdoalah kepadaKu, niscaya Aku akan memperkenankannya bagi kalian. Sesungguhnya orang-orang yang enggan beribadah kepadaKu akan masuk neraka Jahanam dalam keadaan hina”} hina lagi rendah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. ini adalah bagian dari kelembutan Allah terhadap hamba-hambaNya dan nikmatNya yang sangat besar, di mana Dia menyeru mereka kepada apa yang di dalamnya terdapat kebaikan bagi Agama dan dunia mereka, dan Dia perintahkan mereka untuk berdoa dengan doa ibadah dan doa permohonan, dan Dia berjanji kepada mereka akan mengabulkannya, dan sebaliknya Dia pun mengancam siapa yang menyombongkan diri terhadapnya, seraya berfirman, “Sesungguhnya orang-orang yang menyombongkan diri dari menyembahKu akan masuk neraka dalam keadaan hina dina.” Maksudnya, dengan nista dan terhina, azab dan penghinaan ditimpakan terhadapnya sebagai balasan atas kesombongannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 60: (Dan Rabb kalian berfirman, \"Berdoalah kepada-Ku, niscaya akan Kuperkenankan bagi kalian) maksudnya, sembahlah Aku, niscaya Aku akan memberi pahala kepada kalian. Pengertian ini disimpulkan dari ayat selanjutnya, yaitu, (Sesungguhnya orang-orang yang menyombongkan diri dari menyembah-Ku akan masuk) dapat dibaca Sayadkhuluuna atau Sayudkhaluuna, menurut bacaan yang kedua artinya, mereka akan dimasukkan ke dalam (neraka Jahanam dalam keadaan hina dina\") dalam keadaan terhina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini termasuk kelembutan Allah kepada hamba-hamba-Nya dan nikmat-Nya yang besar, dimana Dia mengajak mereka kepada sesuatu yang di sana terdapat kebaikan bagi agama dan dunia mereka, serta memerintahkan mereka berdoa kepada-Nya dan menjanjikan akan mengabulkan doa mereka. Demikian pula mengancam orang-orang yang sombong dari berdoa kepada-Nya. Yakni tidak mau berdoa kepada-Ku. Mereka akan memperoleh azab dan kehinaan sebagai balasan terhadap kesombongan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 60",
    "description": "Dengan semakin dekat hari kiamat, Allah kemudian mengajak manusia dengan kasih sayang-Nya agar datang dan mendekatkan diri kepada-Nya. Dan tuhanmu berfirman, 'berdoalah kepada-ku dengan mendekatkan diri, niscaya akan aku perkenankan bagimu apa yang kamu harapkan berupa hidayah dan anugerah nikmat. Sesungguhnya orang-orang yang angkuh dan sombong sehingga membuat mereka tidak mau menyembah-ku, mereka akan masuk ke dalam neraka jahanam dalam keadaan hina dina. '61. Ajakan untuk berdoa dan mendekatkan diri kepada Allah adalah merupakan keniscayaan semata yang harus dilakukan oleh manusia. Sebenarnya disembah ataupun tidak, Allah tetaplah sebagai pencipta alam semesta. Ayat ini dan ayat-ayat berikut mengukuhkan kenisca-yaan tersebut. Allah-lah yang menjadikan malam itu gelap untukmu agar kamu dapat beristirahat padanya; dan menjadikan siang terang benderang agar kamu dapat bekerja mencari nafkah memenuhi kebutuhan hidup. Sungguh, Allah benar-benar memiliki karunia yang tiada terhingga yang dilimpahkan-Nya kepada manusia, tetapi kebanyakan manusia tidak bersyukur atas karunia itu."
  }
]