[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya Allah semata yang menjadikan malam untuk kalian agar kalian bisa tenang di dalamnya dan mengambil jatah istirahat dengan baik, dan Allah menjadikan siang bersinar sehingga kalian bisa mencari penghidupan kalian. Sesungguhnya Allah benar-benar memiliki karunia yang besar atas manusia, akan tetapi kebanyakan dari mereka tidak mensyukuri Allah dengan menaatiNya dan mengikhlaskan ibadah hanya kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Allah yang menjadikan untuk kalian malam gelap agar kalian bisa beristirahat dengan tenang. Dan Allah yang menjadikan siang terang benderang agar kalian bisa bekerja padanya. Sesungguhnya Allah adalah Pemilik karunia yang besar atas manusia manakala Dia mencurahkan kepada mereka nikmat-nikmat-Nya yang lahir dan yang batin, akan tetapi kebanyakan manusia tidak mensyukuri-Nya terkait kenikmatan yang Dia berikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61-62. Allah mengabarkan tentang keagungan kuasa-Nya dalam memberi karunia bagi para hamba-Nya: “Hanya Allah yang menjadikan malam gelap gulita sebagai waktu istirahat kalian, dan menjadikan siang terang benderang sebagai waktu kalian mencari penghidupan. Sungguh Allahlah Pemberi karunia kepada seluruh manusia, akan tetapi kebanyakan mereka tidak bersyukur atas karunia itu. Allah Yang Maha Agung itu merupakan Tuhan kalian, Dia Menciptakan seluruh makhluk, tidak ada Tuhan yang berhak disembah selain Dia; maka mengapa kalian berpaling dari beriman kepada-Nya dan menyembah selain-Nya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. اللهُ الَّذِى جَعَلَ لَكُمُ الَّيْلَ لِتَسْكُنُوا۟ فِيهِ (Allah-lah yang menjadikan malam untuk kamu supaya kamu beristirahat padanya) Yakni agar kalian berhenti dari kegiatan kalian mencari penghidupan, karena Allah telah menjadikannya gelap dan sejuk sehingga sesuai untuk beristirahat dengan tenang. وَالنَّهَارَ مُبْصِرًا ۚ( dan menjadikan siang terang benderang) Yakni bercahaya, agar kalian dapat melihat kebutuhan-kebutuhan kalian dan beraktifitas untuk mencari nafkah. إِنَّ اللهَ لَذُو فَضْلٍ عَلَى النَّاسِ(Sesungguhnya Allah benar-benar mempunyal karunia yang dilimpahkan atas manusia) Yakni Allah mengaruniakan mereka nikmat-nikmat yang tidak terhitung. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ(akan tetapi kebanyakan manusia tidak bersyukur) Yakni tidak mensyukuri nikmat-nikmat-Nya, baik itu dengan keingkaran mereka atau dengan kelalaian mereka untuk memikirkan kenikmatan Allah yang wajib mereka syukuri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Allah adalah Dzat yang menciptakan malam gelap bagi kalian agar kalian bisa beristirahat di dalamnya dari lelahnya pekerjaan dan usaha di siang hari. Dia juga menciptakan siang yang cerah bagi kalian agar kalian bisa melihat pekerjaan dan kebutuhan kalian. Sesungguhnya Allah adalah pemilik keutamaan yang agung yang diberikan kepada manusia berupa nikmat yang sangat tak terhitung banyaknya, namun kebanyakan manusia tidak bersyukur kepada Allah atas nikmat ini, tidak mengimaniNya dan tidak menaati apa yang diperintahkan olehNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah adalah Dzat yang menjadikan malam untuk kalian agar kalian beristirahat} agar kalian beristirahat {padanya dan siang terang-benderang} bersinar terang agar kalian bisa bekerja ketika itu {Sesungguhnya Allah benar-benar memiliki karunia kepada manusia, tetapi kebanyakan manusia tidak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Firman Allah “Allah lah yang menjadikan malam untuk kamu”. Maksudnya, karena kalianlah Allah menjadikan malam itu gelap “supaya kamu beristirahat padanya” dari gerak aktivitas kalian yang kalau seandainya terus tanpa henti, maka kan berakibat burruk. Kalian beristirahat di tempat tidur dan Allah kemudian menidurkan kalian yang dengannya pikiran dan badan menjadi istirahat. Tidur merupakan kebutuhan primer manusia, ia tidak akan bisa hidup tanpa tidur. Pada malam hari juga setiap kekasih merasakan kedamaian kepada kekasihnya, pikiran bisa focus dan segala yang menyibukkan berkurang. “Dan” Allah menjadikan “siang terang benderang”, dengan adanya matahair yang berotasi di ufuk, lalu kalian bangun dari tempat tidur kepada kesibukan Agama dan dunia kalian. Sebagian waktu untuk berdzikir dan membaca dan sebagian untuk sholat, sebagian lagi untuk menuntut ilmu dan belajarr, sebagian lagi untuk aktivitas jual-beli, untuk membangun, untuk menempa besi dan untuk berbagai aktivitas produksi lainnya. Sebagian lagi untuk beperrgian jauh lewat darat maupun laut, untuk bercocok tanam, dan untuk mengurusi hewan-hewan terrnaknya. “sesungguhnya Allah benar-benar mempunyai karunia” yang sangat besar sekali, “atas manusia” di mana Dia karuniakan kepada mereka nikmat-nikmat ini dan yang lainnya, dan Dia jauhkan berbagai bencana dari mereka. Ini semua mengharuskan bersyukur penuh dan berdzikir kepadaNya. “akan tetapi kebanyakan manusia tidak bersyukur” disebabkan oleh kebodohan dan kedzaliman mereka. “dan sedikit sekali di antara hamba-hambaKu yang bersyukur” (Saba: 13) Yaitu menyangkut nikmat-nikmat dari Allah, mereka tunduk kepadaNya dan mencintaiNya, seraya menggunakan nikmat-nikmat tersebut dalan rangka taat kepadaNya dan mencari keridhoanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 61: (Allahlah yang menjadikan malam untuk kalian supaya kalian beristirahat padanya; dan menjadikan siang terangbenderang) dikaitkannya pengertian melihat kepada siang hanyalah majaz atau kata kiasan belaka, karena pada siang hari manusia dapat melihat. (Sesungguhnya Allah benar-benar mempunyai karunia yang dilimpahkan atas manusia, akan tetapi kebanyakan manusia tidak bersyukur) kepada Allah, malahan mereka tidak beriman kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dan setelahnya (ayat 61 s.d 65) menunjukkan luasnya rahmat Allah besarnya karunia-Nya dan wajibnya semua itu disyukuri, serta menunjukkan sempurnanya kekuasaan-Nya, besar dan luasnya kerajaan-Nya, meratanya penciptaan-Nya kepada segala sesuatu, sempurnanya hidup-Nya, disifati-Nya dengan pujian atas semua sifat sempurna pada-Nya, atas perbuatan-Nya yang indah dan sempurnanya rububiyyah-Nya (pengurusan-Nya) terhadap seluruh alam dan sendirinya Dia dalam mengurusnya. Ayat tersebut juga menunjukkan bahwa semua pengurusan terhadap alam bagian atas maupun alam bagian bawah baik di masa lalu, sekarang maupun yang akan datang berada di Tangan Allah Ta’ala. Tidak seorang pun yang berkuasa terhadapnya. Oleh karena itu, Dia sajalah yang berhak disembah. Dari ayat-ayat ini, diharapkan hati seseorang dapat terpenuhi dengan ma’rifatullah (mengenal Allah), mencintai-Nya, takut dan berharap kepada-Nya. Kedua perkara ini, yakni mengenal Allah dan beribadah kepada-Nya adalah maksud diciptakan manusia, itulah yang diinginkan Allah Subhaanahu wa Ta'aala dari hamba-hamba-Nya, dan keduanya adalah kenikmatan yang paling tinggi secara mutlak, dan keduanya merupakan sesuatu yang jika hilang, maka akan hilang semua kebaikan dan akan datang semua keburukan. Oleh karena itu, kita meminta kepada Allah Subhaanahu wa Ta'aala agar Dia memenuhi hati kita dengan ma’rifat (mengenal-Nya) dan mencintai-Nya, dan menjadikan gerakan kita baik yang tampak maupun tersembunyi ikhlas karena-Nya dan mengikuti perintah-Nya, sesungguhnya Dia tidak berat untuk diminta. Dari melakukan aktifitas, dimana jika kamu terus menerus beraktifitas tentu akan memadharatkan dirimu. Kamu dapat pergi ke tempat tidur, lalu Allah melimpahkan nikmat tidur kepadamu sehingga hati dan badanmu dapat beristirahat. Dengan diciptakan-Nya matahari. Kamu dapat bangun dari tempat tidurmu untuk melakukan aktifitas selanjutnya, baik yang terkait dengan agama maupun dunia. Aktifitas yang terkait dengan agama seperti dzikr, shalat, membaca Al Qur’an, dan menuntut ilmu serta mengajarkannya. Aktifitas yang terkait dengan dunia seperti berusaha, berdagang, jual beli, bertani, bepergian, dan lain-lain. Yang besar. Dia melimpahkan nikmat-nikmat itu dan nikmat-nikmat lainnya serta menghindarkan bahaya dari mereka. Hal ini seharusnya membuat mereka bersyukur dan mengingat-Nya. Disebabkan kebodohan dan kezaliman mereka. Dalam ayat lain, Allah Subhaanahu wa Ta'aala menerangkan, bahwa sedikit sekali hamba-hamba-Nya yang bersyukur, yakni yang mengakui nikmat Tuhannya, tunduk kepada-Nya dan mencintai-Nya serta menggunakan nikmat itu untuk ketaatan kepada-Nya dan mencari keridhaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 61",
    "description": "Ajakan untuk berdoa dan mendekatkan diri kepada Allah adalah merupakan keniscayaan semata yang harus dilakukan oleh manusia. Sebenarnya disembah ataupun tidak, Allah tetaplah sebagai pencipta alam semesta. Ayat ini dan ayat-ayat berikut mengukuhkan kenisca-yaan tersebut. Allah-lah yang menjadikan malam itu gelap untukmu agar kamu dapat beristirahat padanya; dan menjadikan siang terang benderang agar kamu dapat bekerja mencari nafkah memenuhi kebutuhan hidup. Sungguh, Allah benar-benar memiliki karunia yang tiada terhingga yang dilimpahkan-Nya kepada manusia, tetapi kebanyakan manusia tidak bersyukur atas karunia itu. 62. Demikianlah Allah, tuhanmu yang maha pengasih lagi maha penyayang, pencipta segala sesuatu, tidak ada tuhan yang layak disembah selain dia. Oleh sebab itu, maka bagaimanakah kamu dapat dipalingkan dari mengakui kebenaran ayat-ayat Allah'."
  }
]