[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang melimpahkan nikmat-nikmat ini kepada kalian adalah Tuhan kalian yang telah menciptakan segala sesuatu seluruhnya, tidak ada tuhan yang berhak disembah selainNya. Maka bagaimana kalian bisa menyimpang sehingga tidak beriman kepadaNya dan menyembah berhala-berhala selain Allah setelah jelas bagi kalian petunjuk-petunjukNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Allah yang telah melimpahkan nikmat-nikmat-Nya kepada kalian adalah Pencipta segala sesuatu, tidak ada Pencipta selain-Nya, tidak ada sesembahan yang hak selain-Nya, bagaimana kalian dipalingkan dari ibadah kepada-Nya, beralih kepada ibadah selain-Nya yang tidak memiliki manfaat dan mudarat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. فَأَنَّىٰ تُؤْفَكُونَ (maka bagaimanakah kamu dapat dipalingkan?) Yakni bagaimana kalian berpaling dari beribadatan-Nya dan enggan untuk mengesakan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Dzat yang Maha Pencipta lagi Maha Pemberi Nikmat itu adalah Allah, Tuhan kalian yang menciptakan setiap sesuatu di langit dan bumi. Tidak ada Tuhan yang layak disembah dengan haq kecuali Allah, lalu bagaimana bisa kalian mengganti menyembah Allah dengan menyembah selainNya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Allah, Tuhan kalian, Pencipta segala sesuatu, tidak ada tuhan selain Dia; maka bagaimana bisa kalian dipalingkan} maka bagaimana kalian dipalingkan dari menyembahNya menjadi menyembah kepada selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “yang demikian itu”, yang melakukan semua itu “adalah Allah Rabbmu” yakni yang Esa dalam UluihiyyahNya dan Esa dalam RububiyyahNya. Sebab keesaanNya dalam memberikan nikmat-nikmat tersebut adalah bagian dari RububiyyahNya, dan diwajibkannya bersyukur adalah bagian dari UluhiyyahNya. “pencipta segala sesuatu”. Ini adalah pernyataan tentang RububiyyahNya “tiada Tuhan yang berhak disembah selain Dia” adalah pernyataan bahwa Dia-lah yang berhak disembah, tidak ada sekutu bagiNya. Kemudian ditegaskan perintah untuk menyembahNya seraya berfirman, “maka bagaimanakah kamu dapat dipalingkan?” maksdunya, bagaimana kalian berpaling dari ibadah kepadaNya semata, tidak ada sekutu bagiNya setelah ditegaskan dalilnya kepada kalian dan ditampakkan jalan-jalannya kepada kalian?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 62: (Yang demikian itu adalah Allah, Rabb kalian, Pencipta segala sesuatu, tiada Tuhan melainkan Dia, maka bagaimanakah kalian dapat dipalingkan?) maksudnya, bagaimanakah kalian dipalingkan dari iman kepada-Nya, padahal bukti-bukti-Nya sudah jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang berhak disembah satu-satunya dan yang sendiri mengatur alam semesta, karena sendirinya Dia memberikan nikmat-nikmat itu termasuk rububiyyah(pengaturan)-Nya, dan wajibnya disyukuri nikmat-nikmat itu termasuk uluhiyyah-Nya(keberhakan-Nya disembah). Pernyataan terhadap Rububiyyah-Nya. Pernyataan terhadap Uluhiyyah-Nya. Selanjutnya Allah menegaskan perintah-Nya untuk beribadah hanya kepada-Nya. Dari beriman dan beribadah kepada-Nya padahal jelas buktinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 62",
    "description": "Demikianlah Allah, tuhanmu yang maha pengasih lagi maha penyayang, pencipta segala sesuatu, tidak ada tuhan yang layak disembah selain dia. Oleh sebab itu, maka bagaimanakah kamu dapat dipalingkan dari mengakui kebenaran ayat-ayat Allah'63. Demikianlah caranya bagaimana orang-orang durhaka yang selalu mengingkari ayat-ayat Allah dipalingkan disebabkan oleh keangkuhan dan kesombongan mereka."
  }
]