[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana kalian (wahai orang-orang kafir Quraisy) mendustakan kebenaran dan berpaling darinya kepada kebatilan, maka seperti itu pula orang-orang yang mengingkari hujjah-hujjah Allah juga dipalingkan dari kebenaran dan keimanan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Sebagaimana Allah memalingkan mereka dari iman dan ibadah kepada Allah, maka Dia memalingkan siapa yang mengingkari ayat-ayat-Nya yang menunjukkan keesaan-Nya di setiap zaman dan tempat, maka dia tidak terbimbing kepada kebenaran dan tidak tertuntun kepada jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Keberpalingan dari kebenaran menuju kebatilan inilah yang menyesatkan seluruh orang yang mendustakan ayat-ayat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. كَذٰلِكَ يُؤْفَكُ الَّذِينَ كَانُوا۟ بِـَٔايٰتِ اللهِ يَجْحَدُونَ (Seperti demikianlah dipalingkan orang-orang yang selalu mengingkari ayat-ayat Allah) Yakni demikianlah dipalingkan orang-orang yang mengingkari ayat-ayat Allah dan keesaan-Nya dan dipalingkan dari jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Seperti itulah kesesatan dan penyimpangan mereka dari menyembah Allah menjadi menyembah berhala. Setiap orang yan menyangkal ayat-ayat dan mukjizat Allah itu dipalingkan. Dia mengingkari keesaan Allah dengan enggan mengikuti jalan yang lurus"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seperti itulah orang-orang yang selalu mengingkari ayat-ayat Allah dipalingkan} dipalingkan dari keimanan kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “Seperti demikianlah dipalingkan orang-orang yang selalu mengingkari ayat-ayat Allah”. Yakni, sebagai hukuman atas kekafiran mereka terhadap ayat-ayat Allah dan atas sikap zhalim merreka terhadap rosul-rosulNya, maka mereka dipalingkan dari tauhid dan keikhlasan, sebagaimana difirmankanNya, “Dan apabila diturunkan suatu surat, maka di antara mereka (orang-orang munafik) ada yang berkata: \"Siapakah di antara kamu yang bertambah imannya dengan (turunnya) surat ini?\" Adapun orang-orang yang beriman, maka surat ini menambah imannya, sedang mereka merasa gembira.” (At-Taubah : 127)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 63: (Seperti demikianlah dipalingkan) artinya sebagaimana mereka dipalingkan, maka dipalingkan pula (orang-orang yang terhadap ayat-ayat Allah) yakni mukjizat-mukjizat-Nya (mereka ingkar.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari tauhid dan ikhlas sebagai hukuman karena mengingkari ayat-ayat Allah dan melampaui batas terhadap rasul-rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 63",
    "description": "Demikianlah caranya bagaimana orang-orang durhaka yang selalu mengingkari ayat-ayat Allah dipalingkan disebabkan oleh keangkuhan dan kesombongan mereka. 64. Masih dalam kaitan keniscayaan bahwa Allah memang layak untuk disembah, Allah kemudian menegaskannya kembali dalam ayat ini. Allah-lah tuhan yang maha esa dan mahakuasa yang menjadikan bumi pada dasarnya untukmu, wahai manusia, sebagai tempat menetap yang layak untuk kehidupan, dan menjadikan langit sebagai atap tanpa tiang, dan membentukmu dengan bentuk yang sebaik-baiknya lalu memperin-dah rupamu serta memberimu rezeki dari yang baik-baik serta bermanfaat. Demikianlah Allah menciptakan semua itu bagi manusia, dialah yang menjadi tuhanmu, mahasuci Allah, tuhan seluruh alam."
  }
]