[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah Yang menciptakan bumi untuk kalian agar kalian bisa tinggal di atasnya, Allah memudahkan untuk kalian menetap di atasnya, Dia juga menjadikan langit sebagai atap bagi bumi, di sana Allah menebarkan tanda-tanda yang membimbing, Dia menciptakan kalian dalam bentuk paling sempurna dan penciptaan paling bagus, Dia melimpahkan karunianya kepada kalian dengan rizki yang halal, makanan dan minuman yang lezat, yang memberi kalian nikmat-nikmat tersebut adalah Allah, Tuhan kalian, kebaikanNya melimpah, begitu juga karunia dan berkahNya, Mahasuci dari segala apa yang tidak layak bagiNya, Dia adalah Tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Allah yang menjadikan bagi kalian -wahai manusia- bumi tenang tempat yang baik untuk tinggal kalian. Allah yang menjadikan langit dengan bangunan yang kokoh di atas kalian yang tidak jatuh. Allah yang membentuk kalian saat berada di dalam rahim ibu kalian, lalu Allah membaguskan bentuk kalian, dan Dia yang memberi kalian rezeki berupa makanan yang halal dan nikmat. Itulah Allah Rabb kalian yang memberi kalian nikmat-nikmat ini. Mahamulia Allah Rabb alam semesta, tidak ada yang berhak disembah selain-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64-65. Allah mengabarkan tentang karunia-Nya yang besar bagi manusia dalam kehidupan dan penciptaan mereka: “Hanya Allah yang menciptakan bumi sebagai tempat hidup kalian, menciptakan langit sebagai atap untuk melindungi kalian dan tempat asal rezeki kalian, menciptakan kalian dengan sebaik-baik rupa, dan memberi kalian rezeki berupa makanan dan minuman yang lezat. Allah Yang Memberi kalian rezeki itu adalah Tuhan kalian, sungguh besar dan banyak kebaikan dari-Nya. Dia Maha Hidup dengan sifat kehidupan yang sempurna sesuai dengan keagungan-Nya; tidak ada Tuhan selain Dia; maka sembahlah Dia semata. Pujian dan syukur bagi-Nya, Tuhan semesta alam dan Pengatur seluruh urusan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. اللهُ الَّذِى جَعَلَ لَكُمُ الْأَرْضَ قَرَارًا (Allah-lah yang menjadikan bumi bagi kamu tempat menetap) Yakni sebagai tempat mereka menetap dan sebagai tempat berdirinya bangunan-bangunan dan perabotan kalian tanpa goyah, meski bumi bergerak pada orbitnya dengan kecepatan yang tinggi; dan di sanalah kalian akan hidup dan mati. وَالسَّمَآءَ بِنَآءً(dan langit sebagai atap) Yakni atap yang kokoh berdiri. وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ(dan membentuk kamu lalu membaguskan rupamu) Yakni Allah menciptakan kalian dengan bentuk yang paling baik, yang lebih baik dari semua hewan yang ada. وَرَزَقَكُم مِّنَ الطَّيِّبٰتِ ۚ( serta memberi kamu rezeki dengan sebahagian yang baik-baik) Yakni rezeki yang nikmat-nikmat. ذٰلِكُمُ(Yang demikian itu) Yakni Dzat yang disifati dengan sifat-sifat yang agung ini. اللهُ رَبُّكُمْ ۖ فَتَبَارَكَ اللهُ رَبُّ الْعٰلَمِينَ(adalah Allah Tuhanmu, Maha Agung Allah, Tuhan semesta alam) Yakni kebaikan dan keberkahan-Nya sangat banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Hanya Allahlah Dzat yang menciptakan bumi sebagai tempat tinggal untuk kalian dan langit yang dibangun dengan penuh akurasi. Dia juga menciptakan kalian dengan bentuk paling baik dan memberi kalian rejeki yang baik dan lezat. Dzat yang Maha Pencipta lagi Maha Pemberi Rejeki itu adalah Allah, Tuhan kalian. Maha Suci Allah, Tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allahlah yang menjadikan bumi untuk kalian sebagai tempat menetap} tempat tinggal {dan langit sebagai atap} atap {dan membentuk kalian, lalu memperindah bentuk kalian, serta menganugerahi rezeki kepada kalian dari yang baik-baik. Demikianlah Allah Tuhan kalian. Maha suci Allah, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Allah-lah yang menjadikan bumi bagi kamu sebagai tempat menetap” maksudnya, diam, tenang lagi disiapkan segala kemaslahat kalian, kalian dapat menyangkulnya, menanam tanaman di atasnya, membuat bangunan di atasnya, bepergian jauh dan tinggal padanya, “dan langit sebagai atap” yakni, atap bagi bumi yang mana kalian berada di dalamnya. Dan Allah telah menjadikan di dlamnya apa-apa yang kalian dapat manfaatkan, seperti berbagai cahaya dan tanda-tanda (bintang-bintang) yang dapat dijadikan sebagai petunjuk dalam kegelapan di darat dan di lautan. “Dan membentuk kamu lalu membaguskan rupamu.” Tidak ada pada jenis hewan yang lebih indah bentuknya dan rupanya daripada manusia, sebagaimana Allah firmankan, “sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya.” (At-Tin :4) Jika anda ingin mengetahui keindahan rupa manusia dan kesempurnaan kebijaksanaan Allah padanya, maka lihatlah pada tiap-tiap anggota tubuhnya satu persatu. Apakah Anda menemukan salah satu dari anggota tubuh Anda yang sangat serasi dengannya dan pantas untuk ditempatkan bukan pada tempatnya? Dan cobalah perhatikan juga kecenderungan yang ada di dalam hati hewan-hewan itu, apakah Anda menjumpai pada selain manusia? Dan perhatikanlah pula keistimewaan yang Allah anugrahkan kepadanya, seperti akal, iman, rasa cinta, dan ma’rifat yang merupakan sifat-sifat yang terbaik yang hanya pantas untuk bentuk yang paling indah. “serta memberi rizki kamu dengan sebagian yang baik-baik.” Ini mencakup segala rizki yang baik dari makanan, minuman, perkawinan, pakaian, penglihatan dan pendengaran serta berbagai kebaikan lainnya yang Allah mudahkan bagi hamba-hambaNya dan gampangkan sebab-sebabnya, dan Dia cegah mereka dari hal-hal yang keji yang berlawanan dengannya dan membahayakan fisik, jiwa dan agama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 64: (Allahlah yang menjadikan bumi bagi kalian sebagai tempat menetap dan langit sebagai atap) maksudnya, yang menaungi (dan membentuk kalian lalu membaguskan rupa kalian serta memberi kalian rezeki dengan sebagian yang baik-baik. Yang demikian itu adalah Allah Rabb kalian, Maha Agung Allah, Rabb semesta Alam.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan tenang dan telah siap segala sesuatu yang dibutuhkan untuk maslahat kamu. Kamu bisa menggarapnya, membuat bangunan di atasnya, bepergian dan tinggal di sana. Yakni sebagai atap bagi bumi yang kamu tempati. Allah telah menjadikan di langit sesuatu yang dapat kamu ambil manfaat darinya, seperti cahaya dan tanda-tanda yang dipakai rambu-rambu di tengah kegelapan malam di daratan dan lautan. Oleh karena itu, tidak ada makhluk hidup di dunia yang lebih baik bentuknya daripada manusia sebagaimana diterangkan dalam surah At Tiin: 5. Jika kita ingin mengetahui bagusnya bentuk manusia dan sempurnanya hikmah Allah Ta’ala padanya, maka perhatikanlah anggota badannya satu persatu, apakah kamu mendapatkan ada anggota badan yang tidak cocok ditaruh di sana? Rezeki yang baik-baik ini mencakup makanan, minuman, pernikahan, pakaian, pemandangan, suara yang enak didengar, dan hal-hal baik lainnya yang Allah mudahkan untuk hamba-hamba-Nya dan Dia mudahkan sebab-sebabnya, serta Dia hindarkan dari mereka perkara yang buruk yang bertentangan dengannya; yang membahayakan badan, hati, dan agama mereka. Yakni yang mengatur urusan dan mengaruniakan berbagai nikmat kepadamu. Yakni Maha Agung dan Maha banyak kebaikan dan ihsan-Nya yang mengurus alam semesta dengan nikmat-nikmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 64",
    "description": "Masih dalam kaitan keniscayaan bahwa Allah memang layak untuk disembah, Allah kemudian menegaskannya kembali dalam ayat ini. Allah-lah tuhan yang maha esa dan mahakuasa yang menjadikan bumi pada dasarnya untukmu, wahai manusia, sebagai tempat menetap yang layak untuk kehidupan, dan menjadikan langit sebagai atap tanpa tiang, dan membentukmu dengan bentuk yang sebaik-baiknya lalu memperin-dah rupamu serta memberimu rezeki dari yang baik-baik serta bermanfaat. Demikianlah Allah menciptakan semua itu bagi manusia, dialah yang menjadi tuhanmu, mahasuci Allah, tuhan seluruh alam. 65. Keniscayaan bahwa Allah-lah yang layak dijadikan tuhan dan se-bagai tempat memohonkan doa lebih dikukuhkan lagi dengan ayat ini. Dialah yang hidup kekal yang memberikan kehidupan bagi semua yang hidup, tidak ada tuhan yang layak disembah selain dia; maka oleh sebab itu, berdoa dan sembahlah dia dengan tulus ikhlas beragama kepada-Nya dengan tidak mempersekutukan-Nya dengan yang lain. Segala puji bagi Allah, dia maha esa, tuhan seluruh alam."
  }
]