[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ".Dia-lah Allah Yang Mahahidup dengan kehidupan yang sempurna dan lengkap tiada tuhan yang haq disembah kecuali Dia, maka mintalah kepadaNya dan berikanlah ibadah kalian hanya kepadaNya dengan memurnikan agama dan ketaatan kepadaNya. Segala puji dan sanjungan sempurna hanya bagi Allah, tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Allah Mahahidup tidak mati, tidak ada sesembahan yang hak selain-Nya, maka berdoalah kepada Allah dengan doa ibadah dan doa permintaan dengan berharap wajah-Nya semata, jangan menyekutukan Allah dengan selain-Nya dari makhluk-makhluk-Nya. Segala puji bagi Allah Rabb seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. هُوَ الْحَىُّ لَآ إِلٰهَ إِلَّا هُوَ (Dialah Yang hidup kekal, tiada Tuhan (yang berhak disembah) melainkan Dia) Yakni Dzat yang kekal dan tidak akan sirna, serta mempunyai keesaan dalam ketuhanan. فَادْعُوهُ مُخْلِصِينَ لَهُ الدِّينَ ۗ( maka sembahlah Dia dengan memurnikan ibadat kepada-Nya) Yakni ikhlaskanlah doa dan ibadah bagi-Nya. الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِينَ (Segala puji bagi Allah Tuhan semesta alam) Ibnu ‘Abbas berkata: “Barangsiapa yang mengucapkan ‘Laailaahaillallaah’ maka hendaklah ia mengucapkan setelahnya ‘alhamdulillahi rabbil ‘alamin’, hal ini berdasarkan firman-Nya: فَادْعُوهُ مُخْلِصِينَ لَهُ الدِّينَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِينَ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Maha Suci Allah yang Maha hidup selamanya lagi Maha Abadi yang tidak mungkin mati. Tidak ada yang haq disembah kecuali Dia. Maka berdoalah dan beribadahlah kepadaNya dengan ikhlas penuh ketaatan. Ucapkanlah: “Rasa syukur dan pujian sepenuhnya itu hanya milik Allah, Tuhan seluruh makhluk”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Dzat yang hidup kekal, tidak ada tuhan selain Dia, maka berdoalah kepadaNya dengan mengikhlaskan ketaatan} ketaatan dan ibadah {kepadaNya. Segala puji bagi Allah, Tuhan alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. “Dia-lah yang Maha Hidup” yang memiliki kehidupan sempurna lagi parripurna yang menuntut adanya sifat dzatiyyah yang pasti dimilikiNya, yang kehidupanNya tidak akan sempurna kecuali dengan adanya, seperti, mendengar, melihat, kuasa, berilmu, berbicarra dan sifat-sifat kesempurnaan dan kebesaranNya yang lain. “Tiada Tuhan yang berhak disembah melainkan Dia” tiada sesembahan yang haq melainkan Dia, Yang Mahamulia “maka berdoalah kepadaNya”. Ini mencakup doa ibadah dan doa permohonan, “dengan memurnikan ibadah kepadaNya”. Maksdunya, niatlah dalam setiap ibadah, doa, dan amal untuk mendapat keridhoan Allah. Sebab ikhlaslah yang diperintahkan, sebagaimana ditegaskan oleh firmanNya, “Padahal mereka tidak disuruh kecuali supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agama dengan lurus,” (Al-Bayyinah: 5) “segala puji bagi Allah, rabb semesta alam”. Maksudnya, seluruh bentuk pujian, sanjungan dan persembahan dengan ucapan, seperti ucapan manusia yang menyebutNya dan dengan pekerjaan, seperti beribadah kepadaNya, semua itu adalah hanya untuk Allah semata. Tiadasekutu bagiNya, karena kesempurnaan sifat-sifat, perbuatan, dan nikmat-nikmatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 65: (Dialah Yang hidup kekal tiada Tuhan melainkan Dia, maka serulah Dia) sembahlah Dia (dengan memurnikan ibadah kepada-Nya) dari kemusyrikan. (Segala puji bagi Allah Rabb semesta alam.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia Mahahidup secara sempurna, dimana hal ini mengharuskan adanya sifat-sifat Dzatiyah yang dengannya kehidupan menjadi sempurna, yaitu mendengar, melihat, berkuasa, mengetahui, berfirman, dan lainnya yang termasuk sifat kesempurnaan-Nya dan keagungan-Nya. Kalimat “Fad'uuh\" (maka berdoalah kepada-Nya), mencakup doa ibadah dan doa mas’alah. Doa Ibadah maksudnya, seseorang beribadah dengan doa itu dengan mengharap pahala-Nya dan takut kepada siksa-Nya. Sedangkan Doa Masalah maksudnya, meminta kebutuhan. Hal ini (doa mas’alah) bisa menjadi ibadah jika dari seorang hamba kepada Tuhannya, karena di dalamnya mengandung rasa butuh kepada Allah Ta’ala, kembali kepada-Nya dan meyakini bahwa Dia Mahakuasa, Maha Pemurah lagi Mahaluas karunia dan rahmat-Nya, dan diperbolehkan apabila berasal dari seorang hamba kepada hamba yang lain jika yang diminta itu mengerti doa itu dan mampu memenuhinya, sebagaimana dalam kata-kata seseorang, “Wahai fulan, berilah saya makan.” Yakni niatkanlah dalam semua ibadah, doa dan amal saleh untuk mencari keridhaan Allah, karena ikhlas itulah yang diperintahkan sebagaimana firman Allah Ta’ala, “Padahal mereka tidak disuruh kecuali agar menyembah Allah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agama yang lurus, dan agar mereka mendirikan shalat dan menunaikan zakat; dan yang demikian Itulah agama yang lurus.” (Terj. Al Bayyinah: 5) Yakni semua pujian dan sanjungan dengan ucapan seperti ucapan makhluk ketika mengingat-Nya, dan dengan perbuatan seperti ibadah mereka kepada-Nya. Semua ini untuk Allah Subhaanahu wa Ta'aala saja tidak ada sekutu bagi-Nya karena sempurnanya sifat-Nya dan perbuatan-Nya dan karena sempurna nikmat-nikmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 65",
    "description": "Keniscayaan bahwa Allah-lah yang layak dijadikan tuhan dan se-bagai tempat memohonkan doa lebih dikukuhkan lagi dengan ayat ini. Dialah yang hidup kekal yang memberikan kehidupan bagi semua yang hidup, tidak ada tuhan yang layak disembah selain dia; maka oleh sebab itu, berdoa dan sembahlah dia dengan tulus ikhlas beragama kepada-Nya dengan tidak mempersekutukan-Nya dengan yang lain. Segala puji bagi Allah, dia maha esa, tuhan seluruh alam. 66. Setelah jelas dan tuntas tentang keniscayaan bahwa hanya Allah yang layak untuk disembah dan sebagai tempat meminta, bukan kepada yang lain, maka pada ayat di atas dan ayat-ayat berikut disampaikan larangan untuk menyembah selain Allah. Katakanlah, wahai nabi Muhammad, 'sungguh, aku sangat dilarang untuk menyembah sembahan yang kamu sembah selain Allah yang maha esa, setelah datang kepadaku keterangan-keterangan dan bukti-bukti dari tuhanku; dan lebih dari itu aku diperintahkan agar dengan bersungguh-sungguh berserah diri kepada tuhan pemelihara seluruh alam. '."
  }
]