[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang musyrik dari kaummu, “Sesungguhnya aku dilarang untuk menyembah apa-apa yang kalian sembah selain Allah, ketika ayat-ayat yang jelas telah datang kepadaku dari sisi Tuhanku dan Dia telah memerintahkanku agar tunduk dan patuh dengan memberikan ketaatan sempurna kepadaNya, Mahasuci Allah, Tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Katakanlah -wahai Rasul-, “Sesungguhnya Allah melarangku untuk menyembah apa-apa yang kalian sembah selain Allah berupa berhala-berhala yang tidak mendatangkan manfaat dan mudarat manakala bukti-bukti dan argumentasi-argumentasi yang nyata atas kebatilan penyembahannya telah datang kepadaku. Allah memerintahkanku agar tunduk kepada-Nya semata dengan beribadah hanya kepada-Nya. Dia adalah Rabb seluruh makhluk tidak ada yang hak kecuali Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Allah memerintahkan Nabi Muhammad untuk menyampaikan kepada umatnya larangan menyembah selain-Nya, setelah Allah menurunkan kepadanya ayat-ayat yang jelas yang dapat didengar dan disaksikan; dan untuk menyampaikan bahwa beliau diperintahkan untuk taat dan patuh kepada-Nya, Tuhan seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. قُلْ إِنِّى نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِن دُونِ اللهِ (Katakanlah (ya Muhammad): “Sesungguhnya aku dilarang menyembah sembahan yang kamu sembah selain Allah) Yakni patung-patung dan orang-orang mati yang disembah oleh orang-orang musyrik. لَمَّا جَآءَنِىَ الْبَيِّنٰتُ مِن رَّبِّى(setelah datang kepadaku keterangan-keterangan dari Tuhanku) Yakni dalil-dalil secara akal dan wahyu, yang mengharuskan untuk mengesakan Allah. وَأُمِرْتُ أَنْ أُسْلِمَ لِرَبِّ الْعٰلَمِينَ(dan aku diperintahkan supaya tunduk patuh kepada Tuhan semesta alam) Yakni aku menyerahkan diri kepada-Nya dengan mentaati perintah-Nya dan tunduk kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Katakanlah kepada orang-orang musyrik wahai nabi: “Sesungguhnya aku dilarang dan dicegah untuk menyembah sesuatu yang kalian sembah selain Allah, berupa berhala-berhala dan patung-patung setelah datang kepadaku dalil-dalil yang jelas dan terang yang menunjukkan pada keesaan Allah. Dalil yang menunjukkan Tuhanku itu mendidikku dengan nikmat-nikmatNya. Aku diperintahkan untuk menyerahkan dan memasrahkan semuanya kepada Allah, Tuhan seluruh makhluk” Jubair dari Ibnu Abbas berkata: “Sesungguhnya Walid bin Mughirah dan Syaibah bin Rabi’ah berkata: “Wahai Muhammad, tariklah ucapanmu tentang agama leluhurmu” Lalu Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya aku dilarang menyembah sesembahan yang kalian seru} kalian sembah {selain Allah setelah datang kepadaku keterangan-keterangan dari Tuhanku. Aku diperintahkan agar berserah diri} berserah diri dan tunduk dengan melakukan ketaatan dan beribadah {kepada Tuhan alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. setelah Allah menjelaskan perintah ikhlas beribadah kepada Allah semata dan menyebutkan dalil-dalinnya dan bukti-buktinya, maka Dia secara tegas melarang ibadah kepada selainNya seraya berfirman, “katakanlah” wahai nabi “sesungguhnya aku dilarang menyenbah sembahan yang kamu sembah selain Allah”. Seperti berhala dan patung-patung serta segala apa saja yang disembah dari selain Allah. Aku sama sekali tidak ragu terhadap perkaraku ini, melainkan benarr-benar atas dasar keyakinan dan pengetahuan yang dalam, dank arena itu beliau berrkata “setelah datang kepadaku keterangan-keterangan dari Rabbku; dan aku diperintahkan supaya tunduk patuh kepada Rabb semesta alam” dengan hati, lisan, dan selurruh anggota tubuhku, sehingga semuanya tunduk taat kepadaNya, berrserah diri kepada perintahNya. Ini adalah perintah yang paling agung secara mutlak, sebagaimana halnya larangan beribadah kepada selainNya merupakan larangan yang paling agung secara mutlak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 66: (Katakanlah, \"Sesungguhnya aku dilarang menyembah sesembahan yang kalian seru) yang kalian sembah (selain Allah setelah datang kepadaku keterangan-keterangan) yakni bukti-bukti tauhid (dari Rabbku, dan aku diperintahkan supaya tunduk patuh kepada Rabb semesta alam.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menyebutkan perintah beribadah dengan ikhlas kepada Allah, dan menyebutkan pula dalil dan buktinya, maka Dia menegaskan larangan beribadah kepada selain-Nya. Baik berupa patung, berhala maupun lainnya. Yang menunjukkan keesaan-Nya. Baik dengan hatiku, lisanku maupun anggota badanku, yaitu dengan tunduk menaati-Nya dan menyerahkan diri kepada perintah-Nya. Perintah mentauhidkan-Nya merupakan perintah paling agung secara mutlak, dan larangan berbuat syirk merupakan larangan paling agung secara mutlak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 66",
    "description": "Setelah jelas dan tuntas tentang keniscayaan bahwa hanya Allah yang layak untuk disembah dan sebagai tempat meminta, bukan kepada yang lain, maka pada ayat di atas dan ayat-ayat berikut disampaikan larangan untuk menyembah selain Allah. Katakanlah, wahai nabi Muhammad, 'sungguh, aku sangat dilarang untuk menyembah sembahan yang kamu sembah selain Allah yang maha esa, setelah datang kepadaku keterangan-keterangan dan bukti-bukti dari tuhanku; dan lebih dari itu aku diperintahkan agar dengan bersungguh-sungguh berserah diri kepada tuhan pemelihara seluruh alam. '67. Setelah menjelaskan bahwa hanya dia yang layak disembah, Allah lalu menguraikan beberapa bukti kekuasaan-Nya yang ada dalam diri manusia. Dialah tuhan yang maha esa, yang telah menciptakanmu, wahai manusia, dari tanah, kemudian sesudah itu dari setetes mani yang bertemu dengan indung telur dalam rahim, lalu sesudah itu dari segumpal darah, kemudian setelah menempuh waktu sembilan bulan atau lebih, kamu dilahirkan sebagai seorang anak, kemudian dibiarkan-Nya kamu tumbuh sampai menjadi manusia dewasa, lalu kemudian menjadi tua dan lanjut usia. Akan tetapi, di antara kamu ada yang dimatikan sebelum itu atau sebelum mencapai usia dewasa atau tua. Kami perbuat demikian agar kamu menyadari bahwa ada batas sampai kepada kurun waktu yang ditentukan bagi setiap orang, agar kamu mengerti dan memahami ketentuan ini."
  }
]