[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah Allah Yang menciptakan bapak kalian, Adam, dari tanah, kemudian Dia menciptakan kalian dari sperma dengan KuasaNya, setelah itu kalian berganti kepada fase segumpal darah merah yang kental, kemudian kalian mengalami beberapa proses dalam Rahim sampai kalian lahir sebagai bayi kecil, kemudian jasad kalian menjadi kuat sampai kalian menjadi tua, diantara kalian ada yang mati sebelum itu dan agar dengan proses yang telah ditetapkan tersebut kalian mencapai ajal yang telah ditetapkan yang habis saat usia kalian berakhir, dan agar kalian merenungkan hujjah-hujjah Allah atas kalian dengan itu dan memikirkan ayat-ayatNya, sehingga kalian mengetahui bahwa tidak ada tuhan yang berhak disembah kecuali Allah yang melakukan hal itu, dan bahwa hanya Dia yang berhak untuk disembah, bukan selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Allah yang menjadikan bapak kalian, Adam, dari tanah, kemudian menjadikan kalian sesudahnya dari setetes air mani, kemudian sesudahnya menjadi darah yang menggumpal, kemudian Allah mengeluarkan kalian dari rahim ibu kalian sebagai anak-anak, kemudian kalian mencapai puncak kekuatan kalian, kemudian kalian memasuki masa paruh baya hingga masa tua. Di antara kalian ada yang mati sebelum itu, dan agar kalian mencapai masa yang telah ditetapkan dalam ilmu Allah, tidak berkurang dan tidak bertambah. Semoga dengan hujah-hujah dan bukti-bukti ini kalian mengetahui kekuasaan Allah dan keesaan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67-68. Hai manusia, Allahlah yang menciptakan asal kalian dari tanah dengan menciptakan Nabi Adam darinya; kemudian setelah penciptaan Nabi Adam Allah, menjadikan perkembangbiakan kalian dari air mani yang berkembang menjadi segumpal darah. Lalu Allah mengeluarkan kalian dari rahim setelah melewati beberapa fase, agar kalian dapat mencapai kesempurnaan akal dan kekuatan, lalu kalian akan sampai pada usia tua; dan agar kalian dapat menghayati bagaimana Allah mengatur makhluk-Nya, dan mengetahui bahwa hanya Dia Tuhan yang berhak disembah dan hanya Dia yang mampu mematikan dan menghidupkan. Jika Dia menetapkan suatu perkara maka dia akan berfirman ‘Jadilah’, maka perkara itu akan terjadi sesuai dengan kehendak-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. هُوَ الَّذِى خَلَقَكُم مِّن تُرَابٍ (Dialah yang menciptakan kamu dari tanah) Yakni Allah-lah yang menciptakan bapak pertama kalian yaitu Adam, Dia menciptakannya dari tanah yang menjadikan keturunannya juga berasal dari tanah. ثُمَّ مِن نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ(kemudian dari setetes mani, sesudah itu dari segumpal darah) Tafsir kalimat ini telah disebutkan pada surat al-Hajj dan surat al-Mu’minun. ثُمَّ يُخْرِجُكُمْ طِفْلًا(kemudian dilahirkannya kamu sebagai seorang anak) Yakni mengeluarkan setiap diri kalian dalam bentuk anak kecil. ثُمَّ لِتَبْلُغُوٓا۟ أَشُدَّكُمْ (kemudian (kamu dibiarkan hidup) supaya kamu sampai kepada masa (dewasa)) Yakni mencapai masa terkumpulnya akal dan kekuatan dalam diri kalian. Dan telah dijelaskan makna kata (الأشد) dengan lengkap pada surat al-An’am: 152. ثُمَّ لِتَكُونُوا۟ شُيُوخًا ۚ( kemudian (dibiarkan kamu hidup lagi) sampai tua) Dan orang yang tua adalah orang yang telah mencapai umur 40 tahun. وَمِنكُم مَّن يُتَوَفَّىٰ مِن قَبْلُ ۖ (antara kamu ada yang diwafatkan sebelum itu) Yakni sebelum masa tua. وَلِتَبْلُغُوٓا۟ أَجَلًا مُّسَمًّى (supaya kamu sampai kepada ajal yang ditentukan) Yakni sapai pada waktu kematian atau hari kiamat. وَلَعَلَّكُمْ تَعْقِلُونَ(dan supaya kamu memahami(nya)) Yakni agar kalian memahami keesaan Tuhan kalian, serta mengetahui kebesaran kuasa-Nya dalam menciptakan kalian dengan fase-fase yang berbeda tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Wahai manusia, hanya Allah yang menciptakan kalian dengan menciptakan bapak kalian Adam AS dari tanah, kemudian menciptakan kalian dari sperma (mani) lalu segumpal darah (darah yang mengental), dan mengeluarkan kalian sebagai anak (At-Thiflu digunakan untuk menamai satu anak atau lebih), yaitu setiap kalian keluar sebagai seorang anak. Kemudian kalian mencapai tahap yang pertumbuhan yang kuat, yaitu tahap penyempurnaan kekuatan dan akal dari umur 30 sampai 40 tahun. Lalu kalian mencapai umur tua di masa tua (umur setelah 60 tahun). Di antara kalian ada yang mati sebelum dua tahapan itu atau salah satu darinya. Allah melakukan yang demikian itu supaya kalian bisa mencapai batas waktu, yaitu waktu kematian dan supaya kalian berangan-angan dan berpikir tentang bukti-bukti keesaan dan kekuasaan Tuhan dalam hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menciptakan kalian dari tanah, kemudian dari setetes mani, lalu dari darah yang menggumpal} sepotong darah yang kaku {kemudian Dia mengeluarkan kalian sebagai seorang anak kecil, kemudian kalian sampai usia dewasa} usia sempurnanya kekuatan, akal, dan kemampuan membedaka kalian {lalu kalian menjadi tua. Di antara kamu ada yang dimatikan sebelum itu. agar kalian sampai kepada ajal yang ditentukan} waktu tertentu dimana umur kalian habis {dan agar kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. kemudian Allah menetapkan tauhid ini, yaitu bahwa sesungguhnya Dia-lah pencipta kalian dan yang mengembangkan fase-fase penciptaan kalian. Oleh karena Dia semata yang menciptakan kalian, maka sembahlah Dia semata, seraya berfiman,” Dialah yang menciptakanmu dari tanah,” yakni, ketika menciptakan asal-usul kalian dan bapak pertama kalian, Adam, “kemudian dari setetes mani,” ini adalah permulaan penciptaan seluruh jenis manusia saat masih dalam rahim ibunya. Allah mengingatkan dengan permulaan penciptaan atas fase-fase lainnya, seperti segumpal darah, lalu segumpal daging, kemudian tulang belulang dan pada akhirnya peniupan ruh, “kemudian dilahirkannya kamu sebagai seorang anak, kemudian,” demikianlah kalian berproses dalam penciptaan ilahi hingga “sampai kepada masa dewasa,” yang terdiri dari kekuatan akal, tubuh dan seluruh kekuatan lahir dan batin. “kemudian sampai tua, dan diantara kamu ada yang diwafatkan sebelum itu,” yakni sebelum mencapai usia dewasa. ”serta supaya kamu sampai” melalui fase-fase yang telah ditetapkan ini hingga batas ajal “yang ditentukan” dimana usia kalian berakhir di situ, “dan supaya kamu memahami,”kondisi kalian, sehingga kalian mengetahui bahwa yang menumbuhkan kalian dalam fase-fase tesebut sempurna kekuasaanNYa, dan hanya Dia-lah yang pantas disembah, sedangkan kalian lemah (berkekurangan) dari segala sisi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 67: (Dialah Yang menciptakan kalian dari tanah) yang menciptakan bapak moyang kalian yaitu Nabi Adam dari tanah liat (kemudian dari setetes nuthfah) yakni air mani (sesudah itu dari segumpal darah) yakni dari kental (kemudian dikeluarkan-Nya kalian sebagai seorang anak) lafal Thiflan sekalipun bentuknya mufrad atau tunggal, bermakna jamak (kemudian) dibiarkan-Nya kalian hidup (supaya kalian sampai kepada masa dewasa) masa sempurnanya kekuatan kalian, yaitu di antara umur tiga puluh sampai dengan empat puluh tahun (kemudian -dibiarkan-Nya kalian hidup- sampai tua) dapat dibaca Syuyuukhan atau Syiyuukhan (di antara kalian ada yang diwafatkan sebelum itu) sebelum dewasa dan sebelum mencapai usia tua. Dia melakukan hal tersebut kepada kalian supaya kalian hidup (dan supaya kalian sampai pada ajal yang ditentukan) yakni waktu yang telah dibataskan bagi hidup kalian (dan supaya kalian memahami) bukti-bukti yang menunjukkan keesaan-Nya, kemudian kalian beriman kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Dia mengokohkan perkara tauhid, dengan menyatakan bahwa Dia adalah Pencipta kamu, yang mengubah penciptaan kamu kejadian demi kejadian. Oleh karena Dia saja yang menciptakan kamu, maka sembahlah Dia saja. Yaitu dengan menciptakan nenek moyang kamu Adam 'alaihis salam dari tanah. Ini merupakan awal proses kejadian anak cucu Adam ketika di perut ibunya, yaitu dari mani, lalu menjadi ‘alaqah (segumpal darah), kemudian menjadi mudhghah (segumpal daging), lalu dijadikan tulang belulang, lalu tulang belulang itu dibungkus dengan daging (lihat Al Mu’minuun: 14). Yakni usia ketika kekuatanmu semakin sempurna, yaitu usia 30 s.d 40 tahun. Ketika itu usiamu berakhir. Keadaan kamu, sehingga kamu mengetahui bahwa yang menciptakan kamu kejadian demi kejadian Mahasempurna kekuasaan-Nya, dan bahwa tidak ada yang berhak disembah selain Dia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 67",
    "description": "Setelah menjelaskan bahwa hanya dia yang layak disembah, Allah lalu menguraikan beberapa bukti kekuasaan-Nya yang ada dalam diri manusia. Dialah tuhan yang maha esa, yang telah menciptakanmu, wahai manusia, dari tanah, kemudian sesudah itu dari setetes mani yang bertemu dengan indung telur dalam rahim, lalu sesudah itu dari segumpal darah, kemudian setelah menempuh waktu sembilan bulan atau lebih, kamu dilahirkan sebagai seorang anak, kemudian dibiarkan-Nya kamu tumbuh sampai menjadi manusia dewasa, lalu kemudian menjadi tua dan lanjut usia. Akan tetapi, di antara kamu ada yang dimatikan sebelum itu atau sebelum mencapai usia dewasa atau tua. Kami perbuat demikian agar kamu menyadari bahwa ada batas sampai kepada kurun waktu yang ditentukan bagi setiap orang, agar kamu mengerti dan memahami ketentuan ini. 68. Allah selanjutnya menguraikan bahwa menghidupkan dan mematikan manusia dan makhluk lainnya adalah hal yang mudah bagi Allah. Dialah Allah tuhan yang mahakuasa yang menghidupkan makhluk dan dia pula yang mematikan-Nya. Maka apabila dia hendak menetapkan se-suatu urusan itu adalah sangat mudah, dia hanya cukup berkata kepada-Nya, 'jadilah!' maka jadilah sesuatu itu."
  }
]