[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para malaikat yang memikul Arasy Tuhan Yang Maha Pengasih dan para malaikat di sekeliling Arasy dari kalangan para malaikat yang mengelilinginya, mereka menyucikan Allah dari segala kekurangan, memujiNya dengan pujian yang layak untukNya, mereka beriman kepadaNya dengan sebenar-benar iman, dan mereka memohon kepadaNya agar memaafkan orang-orang Mukmin. Mereka berdoa, “Wahai Tuhan Kami, ilmu dan rahmatMu meliputi segala sesuatu, maka ampunilah orang-orang yang bertaubat dari syirik dan kemaksiatan, lalu mengambil jalan yang Engkau perintahkan agar mereka mengambilnya, yaitu Islam, dan jauhkanlah mereka dari azab api neraka dan kengeriannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Para malaikat yang memikul Arasy Rabbmu -wahai Rasul- dan para malaikat yang ada di sekelilingnya menyucikan Rabb mereka dari apa yang tidak layak bagi-Nya, beriman kepada-Nya, memohon ampunan kepada-Nya untuk orang-orang yang beriman kepada Allah, mereka berkata dalam doa mereka, “Wahai Rabb kami, ilmu dan rahmat-Mu meliputi segala sesuatu, maka ampunilah orang-orang yang bertobat dari dosa-dosa mereka dan mengikuti agama-Mu, jagalah mereka dari siksa Neraka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Para malaikat yang mulia yang memikul ‘arsy Allah dan para malaikat yang ada di sekitar ‘arsy, mereka semua senantiasa melafazhkan tasbih dan tahmid, beriman kepada Allah, dan memohonkan ampunan dari Allah bagi orang-orang beriman dengan penuh ketundukan: “Ya Tuhan kami, Maha Luas rahmat-Mu dan ilmu-Mu tentang seluruh makhluk, maka ampunilah dosa orang-orang beriman yang bertaubat dari kesyirikan dan kemaksiatan serta mengikuti ajaran agama Islam, dan jauhkanlah dari mereka azab neraka Jahannam. Ya Tuhan kami, masukkanlah mereka ke dalam surga-surga sehingga mereka dapat tinggal di sana selamanya, sebab Engkau telah menjanjikan surga bagi mereka ketika di dunia; dan masukkanlah mereka ke dalam surga bersama orangtua, istri, dan keturunan mereka yang shalih. Sungguh Engkau Maha Perkasa dalam kerajaan-Mu dan Maha Bijaksana dalam mengatur para makhluk. Dan jauhkanlah mereka dari perbuatan keji dan mungkar. Barangsiapa yang Engkau jauhkan darinya dan dari akibatnya pada hari kiamat sungguh dia telah Engkau rahmati dan Engkau selamatkan dari azab neraka. Penjagaan dan keselamatan itu merupakan kemenangan besar berupa surga yang penuh dengan kenikmatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. الَّذِينَ يَحْمِلُونَ الْعَرْشَ وَمَنْ حَوْلَهُۥ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِۦ وَيَسْتَغْفِرُونَ لِلَّذِينَ ءَامَنُوا۟ ((Malaikat-malaikat) yang memikul ‘Arsy dan malaikat yang berada di sekelilingnya bertasbih memuji Tuhannya dan mereka beriman kepada-Nya serta memintakan ampun bagi orang-orang yang beriman) Yakni para malaikat yang memikul ‘Arsy yang merupakan malaikat yang paling tinggi kedudukannya dan para malaikat yang ada di sekeliling ‘Arsy senantiasa menyucikan Allah sambil memuji-Nya atas segala kenikmatan yang telah Dia berikan, mereka beriman kepada Allah dan memohon ampun dari-Nya bagi hamba-hamba-Nya yang beriman. Mereka mengatakan: رَبَّنَا وَسِعْتَ كُلَّ شَىْءٍ رَّحْمَةً وَعِلْمًا(“Ya Tuhan kami, rahmat dan ilmu Engkau meliputi segala sesuatu) Yakni rahmat dan ilmu-Mu meliputi segala sesuatu. فَاغْفِرْ لِلَّذِينَ تَابُوا۟ وَاتَّبَعُوا۟ سَبِيلَكَ(maka berilah ampunan kepada orang-orang yang bertaubat dan mengikuti jalan Engkau) Yakni mereka yang telah bertaubat dari dosa-dosanya dan kemudian mengikuti jalan Allah yaitu agama Islam. وَقِهِمْ عَذَابَ الْجَحِيمِ(dan peliharalah mereka dari siksaan neraka yang menyala-nyala) Yakni jagalah mereka dari api neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Malaikat-malaikat yang memikul Arsy – hanya Allah Yang Maha Tahu atas segala tentangnya – mereka adalah para malaikat yang palih luhur. Mereka senantiasa bertasbih dan memuji Allah atas berbagai anugerah-Nya. Mereka berucap: Ya Tuhan kami, rahmat-Mu luas meliputi segala sesuatu, ilmu-Mu maha luas meliputi segala sesuatu. Maka ampunilah mereka yang bertaubat kepadamu dari kesyirikan dan dosa. Ampunilah mereka yang senantiasa mengikuti jalan-Mu agama Islam. Jagalah dan jauhkanlah mereka dari azab neraka Jahannam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(malaikat) yang memikul ʻArsy dan yang berada di sekelilingnya} malaikat yang berada di sekeliling ‘Arsy {bertasbih dengan memuji Tuhan mereka, beriman kepadaNya, dan memohonkan ampunan untuk orang-orang yang beriman. “Wahai Tuhan kami, rahmat dan ilmuMu meliputi segala sesuatu. Maka ampunilah orang-orang yang bertaubat serta mengikuti jalanMu} agamaMu {dan lindungilah mereka} jauhkanlaah mereka {dari azab neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah mengabarkan tentang kesempurnaan kemaha lembutanNya terhadap hamba-hambaNya yang beriman dan berbagai sebab-sebab yang di luar kemampuan mereka yang telah Dia sediakan untuk kebahagiaan mereka, seperti permohonan ampunan para malaikat al-muqorrobin untuk mereka dan do’a-do’anya untuk kebaikan agama dan akhiat mereka. Dan di dalam kabar itu terdapat infomasi tentang kemuliaan paa malaikat yang bertugas memikul ‘Arasy dan paa malaikat lainnya yang berada di dekatnya, serta kedekatan mereka dari Allah, rabb mereka, dan betapa banyak ibadah (pengabdiab mereka kepada Allah) dan nasihat mereka kepada hamba-hamba Allah, karena mererka mengetahi bahwa Allah mencintai perbuatan yang mereka lakukan itu. Allah berfirman, “Yang memikul ‘Arsy” maksudnya, Arasy Allah yang maha pengasih, yang merupakan atap bagi seluruh makhluk, ia adalah makhluk yang paling besar, paling luas, paling indah dan terdekat kepada Allah, yang luasnya melebihi langit, bumi dan kursiNya. Para malaikat tersebut telah diberi tugas oleh Allah untuk memikul ‘Arasy Nya yang agung, dan lebih kuat dari malaikat yang lainnya. Mereka dipilih oleh Allah untuk memikul ‘Aasy Nya dan diistimewakan dengan dzikir dan dekat dariNya, membuktikan bahwa mereka adalah jenis malaikat yang paling utama. Allah berfirman, “dan ada delapan malaikat yang memikul ‘Arasy rabbmu pada saat itu” (Al-Haqqah :17) “dan para malaikat yang ada di sekelilingnya”, maksudnya, para malaikat yang didekatkan karena kedudukan dan keutamaan mereka, “bertasbih memuji Robbnya,” ini adalah suatu sanjungan buat mereka karena betapa banyaknya ibadah mereka kepada Tuhannya. Terutama ibadah dalam bentuk tasbih dan tahmid. Semua bentuk ibadah-ibadah lainnya adalah termasuk dalam tasbih dan tahmid kepada Allah. Sebab ia merupakan penyucian terhadap Allah darri perrbuatan mengalihkan ibadah-ibadah kepada selain Dia, dan merupakan pujian kepadaNya. Bahkan pujian itu adalah ibadah kepada Allah. Adapun ucapan seseorang “subahanlloh wabihamdihi.” Termasuk di dalamnya dan meupakan salah satu bentuk ibadah. “dan merke memintakan ampunan bagi orang-orang yang beriman.” Ini adalah salah satu diantara faidah-faidah dan keutamaan-keutamaan beiman yang sangat banyak itu, yang di mana paa malaikat yang sama sekali tidak mempunyai dosa memohonkan ampunan utnuk orang-orang yang beirman. Jadi, seorang mukmin, karena imannya memperoleh karunia yang sangat agung ini. Oleh karena ampunan itu mempunyai sebab-sebab lazin yang tidak akan bisa diperoleh tanpanya, tidak seperti terbersit dalam banyak dugaan oang, yaitu bahwa memohon dan meminta ampunan itu bisa diperoleh, yang ujungnya adalah sekedar pengampunan dosa-, maka Allah menyebutkan pola pemohonan para malaikat terrsebut untuk orang-oang yang beiman supaya dibei ampunan, yaitu menyebutkan hal-hal yang harus, yang tidak akan pernah tecapai kecuali dengannya, seraya berfirman, “ya Rabb kami, rahmat dan ilmuMu meliputi segala sesuatu.” Jadi, ilmu pengetahuanMu sudah meliputi segala sesuatu, tiada sesuatu pun yang tersembunyi dariMu dan tidak ada sesuatu pun sebesar dzaroh di bumi atau di langit, atau yang lebih kecil atau yang lebih besar darinya yang lepas dari pengetahuanMu. Dan RahmatMu meliputi segala sesuatu. Alam semesta, yang di atas dan yang di bawah telah tepenuhi oleh rahmat Allah dan meliputi mereka semuanya dan yang telah sampai kepada apa yang telah dirasakan oleh makhlukNya. “maka berilah ampunan kepada orang-orang yang bertaubat” dari syirik dan maksiat, “dan mengikuti jalanMu,” yaitu mengikuti parra rosulMu dengan mengesakanMu dan taat kepadaMu. “dan peliharalah mereka dai siksa neraka yang menyala-nyala.” Maksudnya, lindungilah mereka darri azab itu sendiri dan lindungilah mereka dari segala sebab-sebab yang dapat menceburkan mereka ke dalam azab tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 7: (Malaikat-malaikat yang memikul Arasy) berkedudukan menjadi Mubtada (dan malaikat yang berada di sekelilingnya) diathafkan kepada ayat sebelumnya (bertasbih) menjadi Khabar dari Mubtada (memuji Rabb mereka) artinya, seraya memujiNya yaitu mengucapkan kalimat, \"Subhaanallaah Wa Bihamdihi\" (dan mereka beriman kepada-Nya) kepada Allah swt. dengan kalbu mereka, maksudnya, mereka percaya kepada keesaan-Nya (serta memintakan ampun bagi orang-orang yang beriman) seraya mengucapkan, (\"Ya Rabb kami! Rahmat dan ilmu Engkau meliputi segala sesuatu) maksudnya, rahmat-Mu meliputi segala sesuatu, dan ilmu-Mu meliputi segala sesuatu. (Maka berilah ampun kepada orang-orang yang bertobat) dari kemusyrikan (dan mengikuti jalan Engkau) yakni agama Islam (dan peliharalah mereka dari siksa neraka Jahim) yang apinya menyala-nyala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya kelembutan Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya yang mukmin, dan ketentuan-Nya menyiapkan sebab-sebab bahagia mereka berupa sebab-sebab yang berada di luar kemampuan mereka, yaitu permintaan ampun malaikat yang didekatkan untuk mereka, doa mereka untuk kebaikan agama dan akhirat mereka, dimana di dalamnya menunjukkan kemuliaan para malaikat pemikul ‘Arsy dan yang berada di sekitarnya serta dekatnya mereka dengan Tuhan mereka, banyaknya ibadah mereka, dan sikap tulus mereka kepada hamba-hamba Allah karena mereka tahu bahwa Allah Subhaanahu wa Ta'aala suka hal itu dilakukan mereka. ‘Arsy adalah atap seluruh makhluk dan merupakan makhluk paling besar, paling luas dan paling bagus, serta paling dekat dengan Allah Subhaanahu wa Ta'aala. Arsy tersebut luasnya meliputi langit, bumi dan kursi Allah serta malaikat tersebut. Sedangkan malaikat yang diserahkan Allah untuk memikulnya adalah malaikat paling besar dan paling kuat. Allah Subhaanahu wa Ta'aala memilih mereka untuk memikul ‘Arsy-Nya, mendahulukan menyebut mereka dan kedekatan mereka menunjukkan bahwa mereka adalah malaikat yang paling utama. Allah Subhaanahu wa Ta'aala berfirman, “Dan malaikat-malaikat berada di penjuru-penjuru langit. Dan pada hari itu delapan malaikat menjunjung 'Arsy Tuhanmu di atas (kepala) mereka.” (Terj. Al Haaqqah: 17) Yang termasuk malaikat yang didekatkan dengan Allah, dan memiliki kedudukan serta keutamaan yang besar. Ini merupakan pujian bagi mereka karena banyaknya ibadah mereka kepada Allah Subhaanahu wa Ta'aala, khususnya tasbih, tahmid serta semua ibadah yang termasuk ke dalam tasbih dan tahmid. Karena tasbih adalah menyucikan Allah Subhaanahu wa Ta'aala dari sikap manusia beribadah kepada selain-Nya, sedangkan tahmid adalah ibadah kepada Allah Subhaanahu wa Ta'aala. Adapun ucapan seorang, “Subhaanallahi wabihamdih” juga masuk di dalamnya dan termasuk di antara sekian ibadah. Ini di antara sejumlah faedah dari beriman dan keutamaannya, yaitu para malaikat yang tidak punya dosa memintakan ampunan untuk orang-orang yang beriman. Oleh karena itu, seorang mukmin dengan imannya menjadi sebab memperoleh keutamaan yang besar ini. Oleh karena ampunan itu memiliki sesuatu yang melekat, dimana tidak akan sempurna ampunan itu kecuali dengannya –di samping yang langsung ditangkap oleh akal pikiran, bahwa meminta ampunan itu adalah agar diampuni dosa-dosa-, maka Allah Subhaanahu wa Ta'aala menyebutkan sifat doa mereka meminta ampunan dengan menyebutkan sesuatu yang dengannya menjadi sempurna, yaitu ucapan, \"Ya Tuhan kami, rahmat dan ilmu yang ada pada-Mu meliputi segala sesuatu, maka berilah ampunan kepada…dst.” Yakni ilmu-Mu meliputi segala sesuatu, tidak ada satu pun yang samar bagi-Mu dan tidak ada yang tersembunyi oleh ilmu-Mu seberat dzarrah (biji sawi) pun di langit maupun di bumi, dan rahmat-Mu meliputi segala sesuatu. Oleh karena itu, alam baik bagian atas maupun bagian bawah telah penuh dengan rahmat Allah Ta’ala. Dari syirk dan maksiat. Yaitu agama Islam, yang intinya adalah mentauhidkan Allah, menaati-Nya dan mengikuti rasul-Nya. Yakni peliharalah mereka dari azab itu sendiri dan sebab-sebabnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 7",
    "description": "Pada ayat-ayat yang lalu telah digambarkan bagaimana bentuk permusuhan yang dilakukan oleh orang-orang kafir terhadap para rasul dan orang-orang beriman. Maka, untuk mengimbangi hal itu, ayat-ayat berikut menggambarkan bagaimana bentuk kasih sayang para malaikat terhadap para rasul dan orang-orang beriman. Ketahuilah bahwa malaikat-malaikat yang memikul 'arsy dan juga malaikat yang berada di sekelilingnya, bertasbih dengan memuji tuhannya, dan mereka semua senantiasa beriman kepada-Nya, serta memohonkan ampunan untuk orang-orang yang beriman seraya bermohon, 'ya tuhan kami, rahmat dan ilmu yang ada pada-Mu sangatlah luas, dan meliputi segala sesuatu. Maka, atas perkenan-Mu, ya Allah, berilah ampunan kepada orang-orang yang bertobat kembali ke jalan-Mu dan orang yang sejak awal telah mengikuti jalan agama-Mu, dan peliharalah mereka dari azab dan siksa neraka yang apinya menyala-Nyala. 8. Para malaikat meneruskan permohonan mereka kepada Allah, 'ya tuhan kami yang maha pengasih lagi maha penyayang, masukkanlah mereka, orang-orang mukmin itu, ke dalam surga 'adn, yang sebelumnya telah engkau janjikan kepada mereka, dan yang juga telah engkau janjikan kepada orang yang saleh di antara nenek moyang, istri-istri, dan keturunan mereka. Sungguh, engkaulah tuhan yang mahaperkasa lagi mahabijaksana."
  }
]