[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "70-72. Orang-orang musyrik yang mendustakan al-Quran dan kitab-kitab samawi yang Allah turunkan kepada rasul-rasulNya untuk membimbing manusia, orang-orang yang mendustakan tersebut akan mengetahui akibat dari pendustaan mereka saat belenggu-belenggu dipasangkan di leher-leher mereka dan rantai-rantai di kaki-kaki mereka, mereka diseret oleh para malaikat Zabaniyah dala air yang sangat panas dan bergejolak, kemudian mereka dijebloskan ke dalam api Neraka Jahanam yang membakar mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Orang-orang yang mendustakan Al-Qur`ān dan kebenaran yang Kami mengutus para rasul dengannya, mereka yang mendustakan itu akan mengetahui akibat dari pendustaan mereka, mereka akan melihat buruknya akibat tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. الَّذِينَ كَذَّبُوا۟ بِالْكِتٰبِ((Yaitu) orang-orang yang mendustakan Al Kitab) Yakni mendustakan al-Qur’an atau seluruh kitab yang diturunkan Allah. وَبِمَآ أَرْسَلْنَا بِهِۦ رُسُلَنَا ۖ( dan wahyu yang dibawa oleh rasul-rasul Kami yang telah Kami utus) Yakni apa yang diwahyukan kepada para rasul selain kitab. فَسَوْفَ يَعْلَمُونَ(Kelak mereka akan mengetahui) Mengetahui kesudahan urusan mereka dan akibat kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Orang-orang yang mendustakan Al-Qur’an dan kitab-kitab samawi selainnya serta apa yang kami risalahkan kepada para rasul Kami berupa ajakan untuk mengesakan Allah, hari kebangkitan, akhlak, syariat dan hukum-hukumNya, maka mereka akan mengetahui akibat dari perbuatan dan pendustaan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang mendustakan kitab} Al-Qur’an {dan wahyu yang Kami utus para rasul dengan itu. Kelak mereka akan mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70-72. sungguh betapa sangat buruk sekali apa yang mereka tukar dan mereka pilih untuk diri mereka, dengan mendustakan al-kitab yang ia bawa dari sisi Allah dan apa yang karenanya Allah mengutus rasul-rasulNya, yang merupakan manusia-manusia terbaik, terjujur, terbesar akalnya. Maka mereka (yang menentang itu) balasannya tidak lain hanyalah neraka yang panas. Maka dari itu Allah mengancam mereka dengan azab neraka, seraya berfirman,”kelak mereka akan mengetahui, ketika belenggu dipasang di leher mereka,” yang karenanya mereka tidak dapat bergerak, “dan rantai” yang diikatkan kepada mereka dan kepada setan-setan “seraya mereka diseret kedalam air yang sangat panas” yakni, air yang sudah sangat mendidih dan mencapai puncak pansanya, “kemudian mereka dibakar di dalam api,” yakni bagi mereka dinyalakan luapan api yang sangat besar, lalu mereka dimasukkan di dalamnya, kemudian mereka di cela atas perbuatan syirik dan dusta mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 70: (Orang-orang yang mendustakan Alkitab) yakni Alquran (dan wahyu yang dibawa oleh rasul-rasul Kami yang telah Kami utus) dengan membawa ajaran tauhid dan berita tentang adanya hari berbangkit; mereka adalah orang-orang kafir Mekah. (Kelak mereka akan mengetahui) akibat dari kedustaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 70",
    "description": "Orang-orang yang mendebat dengan batil wahyu Allah itu adalah orang-orang yang mendustakan kitab, yakni Al-Qur'an, dan wahyu yang dibawa oleh rasul-rasul kami yang telah kami utus, yakni zabur, taurat, dan injil. Kelak mereka akan mengetahui akibat dari sanggahan mereka itu. 71. Akibat dari sanggahan mereka terhadap kebenaran wahyu-wahyu Allah akan mereka rasakan ketika belenggu mengikat tangan mereka, dan rantai dipasang di leher mereka, seraya mereka diseret dengan tarikan yang sangat kuat."
  }
]