[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "70-72. Orang-orang musyrik yang mendustakan al-Quran dan kitab-kitab samawi yang Allah turunkan kepada rasul-rasulNya untuk membimbing manusia, orang-orang yang mendustakan tersebut akan mengetahui akibat dari pendustaan mereka saat belenggu-belenggu dipasangkan di leher-leher mereka dan rantai-rantai di kaki-kaki mereka, mereka diseret oleh para malaikat Zabaniyah dala air yang sangat panas dan bergejolak, kemudian mereka dijebloskan ke dalam api Neraka Jahanam yang membakar mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Mereka mengetahui akibatnya saat leher mereka dibelit oleh belenggu-belenggu, kaki-kaki mereka diikat, dan malaikat Zabaniyah menyeret mereka menuju azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71-72. إِذِ الْأَغْلٰلُ فِىٓ أَعْنٰقِهِمْ وَالسَّلٰسِلُ(ketika belenggu dan rantai dipasang di leher mereka) Yakni pada leher mereka. يُسْحَبُونَ فِى الْحَمِيمِ(seraya mereka diseret ke dalam air yang sangat panas) Yakni pada leher mereka terdapat belenggu dan rantai untuk menyeret mereka ke dalam air yang sangat panas. Makna (الحميم) yakni air yang sangat panas. ثُمَّ فِى النَّارِ يُسْجَرُونَ(kemudian mereka dibakar dalam api) Yakni neraka dinyalakan dengan diri mereka, sehingga mereka menjadi bahan bakar neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71-72. Ketika belenggu diletakkan di leher mereka, mereka akan mengetahuinya. Mereka akan ditarik menggunakan rantai (ikatan besi pada kedua tangan dan kaki) dengan kasar menuju neraka Jahanam. Al-Hamim adalah air yang sangat panas, kemudian mereka dibakar dan dipanaskan dalam neraka. {Idza} digunakan untuk fiil Madhi. Sedangkan (Idza) yang serupa disini digunakan untuk fiil mustaqbal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika belenggu} belenggu {di leher mereka dan rantai} ikatan di kaki mereka {seraya mereka diseret} di seret {ke dalam air yang sangat panas} air panas yang sangan mendidih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70-72. sungguh betapa sangat buruk sekali apa yang mereka tukar dan mereka pilih untuk diri mereka, dengan mendustakan al-kitab yang ia bawa dari sisi Allah dan apa yang karenanya Allah mengutus rasul-rasulNya, yang merupakan manusia-manusia terbaik, terjujur, terbesar akalnya. Maka mereka (yang menentang itu) balasannya tidak lain hanyalah neraka yang panas. Maka dari itu Allah mengancam mereka dengan azab neraka, seraya berfirman,”kelak mereka akan mengetahui, ketika belenggu dipasang di leher mereka,” yang karenanya mereka tidak dapat bergerak, “dan rantai” yang diikatkan kepada mereka dan kepada setan-setan “seraya mereka diseret kedalam air yang sangat panas” yakni, air yang sudah sangat mendidih dan mencapai puncak pansanya, “kemudian mereka dibakar di dalam api,” yakni bagi mereka dinyalakan luapan api yang sangat besar, lalu mereka dimasukkan di dalamnya, kemudian mereka di cela atas perbuatan syirik dan dusta mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 71: (Ketika belenggu dipasang di leher mereka) lafal Idz di sini bermakna Idzaa yakni ketika (dan rantai-rantai) pun dipasang pula di leher mereka. Lafal As-Salaasilu ini diathafkan kepada lafal Al-Aghlaalu. Atau berkedudukan menjadi Mubtada sedangkan Khabarnya tidak disebutkan, yaitu lafal Fii Arjulihim. Dengan demikian maka artinya ialah, Dan rantai-rantai pun dipasang pada kaki mereka Atau Khabar lafal As-Salaasilu ini ialah ayat berikutnya, yaitu (seraya mereka diseret) dengannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka tidak dapat bergerak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 71",
    "description": "Akibat dari sanggahan mereka terhadap kebenaran wahyu-wahyu Allah akan mereka rasakan ketika belenggu mengikat tangan mereka, dan rantai dipasang di leher mereka, seraya mereka diseret dengan tarikan yang sangat kuat. 72. Mereka diseret dengan sangat kuat ke dalam air yang sangat panas dan mendidih, kemudian mereka dibakar di dalam api neraka."
  }
]