[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "73-74. lalu dikatakan kepada mereka sebagai celaan disaat mereka sedang dalam keadaan yang menyesakkan tersebut, “Mana Tuhan-tuhan yang dulu kalian sembah selain Allah? adakah di hari ini mereka menolong kalian? Panggillah mereka agar mereka menyelamatkan kalian dari azab yang menimpa kalian ini bila mereka mampu.” Orang-orang yang mendustakan itu menjawab, “Kami tidak mellihat mereka, mereka tidak memberi manfaat apa pun kepada kami.” Mereka mengaku bahwa tuhan-tuhan mereka sama sekali tidak tahu urusan mereka dan bahwa ibadah kepada mereka adalah batil, tidak berarti apapun, sebagaimana Allah menyesatkan orang-orang yang mana apa yang mereka sembah di dunia selain Allah tidak membantu mereka sedikit pun di dalam Neraka Jahanam, Allah juga menyesatkan orang-orang yang kafir kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Kemudian dikatakan kepada mereka sebagai bentuk merendahkan dan menghinakan, “Di mana tuhan-tuhan palsu yang kalian persekutukan dengan menyembah mereka,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73-77. Kemudian akan dikatakan kepada mereka: “Dimana berhala dan patung-patung yang kalian sembah selain Allah?” Mereka menjawab: “Mereka pergi meninggalkan kami, dan sama sekali tidak bermanfaat bagi kami. Bahkan di dunia kami tidak pernah menyembah sesuatu yang berhak disembah.” Demikianlah Allah menyesatkan orang-orang yang mendustakan-Nya, sehingga mereka tidak mendapat petunjuk menuju kebenaran. Itulah kesesatan yang sangat akibat kesenangan yang kalian tampakkan di dunia ketika melakukan kemaksiatan dan kebatilan, dan akibat kesombongan dan keangkuhan kalian. Akan dikatakan kepada mereka: “Masuklah ke dalam tujuh pintu neraka, kalian akan kekal di dalamnya; itulah seburuk-buruk tempat bagi orang-oarng yang angkuh terhadap kebenaran.” Hai Rasulullah, bersabarlah dalam menghadapi gangguan dari mereka; karena janji Allah untuk monolongmu dari mereka merupakan janji yang benar. Jika Kami menunjukkan kepadamu sebagian azab yang Kami janjikan bagi mereka, maka itulah yang diharapkan; atau Kami akan mewafatkanmu sebelum kamu menyaksikan azab mereka, maka mereka akan kembali kepada Kami pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73-74. ثُمَّ قِيلَ لَهُمْ (kemudian dikatakan kepada mereka) Yakni para malaikat berkata kepada mereka sebagai olokan bagi mereka. أَيْنَ مَا كُنتُمْ تُشْرِكُونَ مِن دُونِ اللهِ (Manakah berhala-berhala yang selalu kamu persekutukan (yang kamu sembah) selain Allah?”) Yakni dimanakah sekutu-sekutu yang kalian dahulu sembah selain Allah, mengapa kalian tidak menolong kalian dari azab ini? قَالُوا۟ ضَلُّوا۟ عَنَّا (Mereka menjawab: “Mereka telah hilang lenyap dari kami) Yakni mereka menghilang dari kami, dan kami tidak melihat mereka lagi. بَل لَّمْ نَكُن نَّدْعُوا۟ مِن قَبْلُ شَيْـًٔا ۚ( bahkan kami dahulu tiada pernah menyembah sesuatu”) Yakni kami tidak menyembah apapun. Mereka mengatakan ini setelah mengetahui bahwa mereka dahulu berada dalam kesesatan dan kejahilan, dan mereka dulu telah menyembah sesuatu yang tidak dapat melihat dan mendengar, dan tidak dapat memberi manfaat atau mudharat. Dan apa yang mereka katakan ini merupakan pengakuan mereka bahwa penyembahan mereka terhadap berhala-berhala adalah sesuatu yang batil. كَذٰلِكَ يُضِلُّ اللهُ الْكٰفِرِينَ(Seperti demikianlah Allah menyesatkan orang-orang kafir) Yakni demikianlah Allah menyesatkan orang-orang kafir, yang mana telah menyembah berhala-berhala yang menjerumuskan mereka ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Lalu dikatakan kepada mereka dengan nada teguran dan celaan: “Dimana berhala dan patung yang kalian sembah dan kalian jadikan sekutu Allah di dunia?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian dikatakan kepada mereka,“Manakah berhala-berhala yang selalu kalian persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73-74. “dan dikatakan” kepada mereka,’manakah berhala-berahala yang selalu kamu persekutukan selain Allah?” apakah berguna bagi kalian atau dapatkah mereka melepaskan sebagian azab dari kalian?! “mereka menjawab,’mereka telah hilang lenyap dari kami,” mereka telah tiada dan tidak hadir, dan sekalipun hadir, mereka tidak akan berguna. Kemudian mereka mengingkari seraya berkata,”bahkan kami dahulu tidak pernah menyembah sesuatu,” bisa jadi maksud mereka dari ungkapan ini adalah mengingkari, dan mereka mengira bahwa keingkaran itu berguna dan bermanfaat bagi mereka. Dan bisa juga, dan ini yang lebih kuat, bahwa maksud mereka adalah mengakui kepalsuan ketuhanan apa-apa yang dahulu mereka sembah itu, dan sesungguhnya Allah, sebenarnya tidak memilki sekutu, dan mereka adalah orang-orang yang sesat dan keliru karena telah menyembah sesuatu yang tidak memilki sifat-sifat ilahiyah. Makna ini dikuatkan oleh Allah ”seperti demikianlah Allah menyesatkan orang-orang kafir,” maksudnya, demikianlah kesesatan yang mereka anut dahulu di dunia adalah kesesatan yang sangat nyata bagi setiap orang, hingga mereka sendiri akan mengakui kepalsuannya di hari kiamat. Dan juga firman Allah, ”dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka.” (yunus:66) Juga dikuatkan oleh firmanNYa, ”dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (doanya) sampai hari kiamat.” (al-ahqaf:5)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 73: (Kemudian dikatakan kepada mereka) sebagai celaan dan penelanjangan, (\"Manakah berhala-berhala yang selalu kalian persekutukan?)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil dicela dengan keras. Yakni apakah mereka dapat memberimu manfaat dan menghindarkan sebagian azab?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 73",
    "description": "Kemudian dalam keadaan direbus dan dibakar di dalam api neraka, dikatakan kepada mereka, 'manakah berhala-berhala yang banyak itu yang selalu kamu persekutukan dengan Allah. 74. Itukah berhala-berhala yang kamu sembah selain Allah'' mereka para pendebat itu, menjawab, 'mereka telah hilang lenyap dari pandang-an kami, bahkan sebenarnya kami dahulu sebelum keberadaan kami di akhirat ini tidak pernah menyembah sesuatu yang layak untuk disembah. ' demikianlah cara Allah membiarkan sesat orang-orang kafir dari kebenar-an sebagai hasil pilihan bebas mereka."
  }
]