[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "73-74. lalu dikatakan kepada mereka sebagai celaan disaat mereka sedang dalam keadaan yang menyesakkan tersebut, “Mana Tuhan-tuhan yang dulu kalian sembah selain Allah? adakah di hari ini mereka menolong kalian? Panggillah mereka agar mereka menyelamatkan kalian dari azab yang menimpa kalian ini bila mereka mampu.” Orang-orang yang mendustakan itu menjawab, “Kami tidak mellihat mereka, mereka tidak memberi manfaat apa pun kepada kami.” Mereka mengaku bahwa tuhan-tuhan mereka sama sekali tidak tahu urusan mereka dan bahwa ibadah kepada mereka adalah batil, tidak berarti apapun, sebagaimana Allah menyesatkan orang-orang yang mana apa yang mereka sembah di dunia selain Allah tidak membantu mereka sedikit pun di dalam Neraka Jahanam, Allah juga menyesatkan orang-orang yang kafir kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. selain Allah berupa berhala-berhala kalian yang tidak mendatangkan manfaat dan mudarat?” Orang-orang kafir menjawab, “Mereka menghilang dari kami, kami tidak melihat mereka, Justru kami di dunia tidak menyembah yang berhak untuk disembah.” Allah menyesatkan orang-orang kafir dari kebenaran di setiap zaman dan tempat seperti Allah menyesatkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Kalian menjadikannya sekutu selain Allah saat beribadah. Apakah mereka bisa melindungi kalian dari azab? Mereka berkata: “Mereka meninggalkan kami dan menghilang, jadi mereka tidak memberi kami manfaat, bahkan kami belum menyembah apapun yang layak untuk disembah di dunia” Sesungguhnya mereka mengingkari peribadatan mereka terhadap berhala-berhala itu. Mereka mengaku bahwa berhala-berhala itu hanya ilusi sebagaimana kesesatan mereka. Allah menyesatkan orang-orang kafir dan tidak menunjukkan mereka kepada kebaikan akibat pendustaan dan kesesatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Selain Allah” Mereka menjawab, “Mereka telah lenyap dari kami} mereka telah menghilang dari kami sehingga kami tidak bisa melihat mereka {Sebenarnya kami dahulu tidak menyembah sesuatu pun” Demikianlah Allah membiarkan sesat orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73-74. “dan dikatakan” kepada mereka,’manakah berhala-berahala yang selalu kamu persekutukan selain Allah?” apakah berguna bagi kalian atau dapatkah mereka melepaskan sebagian azab dari kalian?! “mereka menjawab,’mereka telah hilang lenyap dari kami,” mereka telah tiada dan tidak hadir, dan sekalipun hadir, mereka tidak akan berguna. Kemudian mereka mengingkari seraya berkata,”bahkan kami dahulu tidak pernah menyembah sesuatu,” bisa jadi maksud mereka dari ungkapan ini adalah mengingkari, dan mereka mengira bahwa keingkaran itu berguna dan bermanfaat bagi mereka. Dan bisa juga, dan ini yang lebih kuat, bahwa maksud mereka adalah mengakui kepalsuan ketuhanan apa-apa yang dahulu mereka sembah itu, dan sesungguhnya Allah, sebenarnya tidak memilki sekutu, dan mereka adalah orang-orang yang sesat dan keliru karena telah menyembah sesuatu yang tidak memilki sifat-sifat ilahiyah. Makna ini dikuatkan oleh Allah ”seperti demikianlah Allah menyesatkan orang-orang kafir,” maksudnya, demikianlah kesesatan yang mereka anut dahulu di dunia adalah kesesatan yang sangat nyata bagi setiap orang, hingga mereka sendiri akan mengakui kepalsuannya di hari kiamat. Dan juga firman Allah, ”dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka.” (yunus:66) Juga dikuatkan oleh firmanNYa, ”dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (doanya) sampai hari kiamat.” (al-ahqaf:5)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 74: (Selain Allah?\") yang kalian sembah selain-Nya; yang dimaksud adalah berhala-berhala. (Mereka menjawab, \"Mereka telah hilang lenyap) artinya, telah tiada (dari kami) maka kami tidak melihat mereka (bahkan kami dahulu tiada pernah menyembah sesuatu\") mereka mengingkari penyembahan mereka kepada berhala-berhala itu. Kemudian berhala-berhala sesembahan mereka itu didatangkan, selanjutnya dikatakan kepada mereka, sebagaimana yang disebutkan dalam ayat yang lain, yaitu firman-Nya, \"Sesungguhnya kalian dan apa yang kalian sembah selain Allah, adalah makanan Jahanam.\" (Q.S. AlAnbiya, 98). (Seperti demikianlah) yakni sebagaimana disesatkan-Nya orang-orang yang mendustakan Alquran (Allah menyesatkan orang-orang kafir.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka mengingkari penyembahan mereka kepadanya, lalu berhala-berhala itu dihadirkan, maka Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan Jahannam, kamu pasti masuk ke dalamnya.” (Terj. Al Anbiyaa’: 98) Menurut Syaikh As Sa’diy, bisa maksudnya –dan inilah pendapat yang lebih kuat- bahwa maksud mereka dengan kata-kata itu adalah mengakui batilnya penyembahan kepada sesembahan-sesembahan itu, dan bahwa Allah tidak memiliki sekutu. Merekalah yang sesat dan salah ibadahnya, malah menyembah yang tidak berhak disembah. Hal ini ditunjukkan oleh firman Allah Ta’ala, “Demikianlah Allah membiarkan sesat orang-orang kafir.” Yakni seperti itulah kesesatan yang mereka pegang selama di dunia, kesesatan yang jelas bagi setiap orang sehingga mereka mengakui kebatilannya pada hari Kiamat, dan benarlah firman Allah Ta’ala, “Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka, dan mereka hanyalah menduga-duga.” (Terj. Yunus: 66) Hal ini ditunjukkan pula oleh firman Allah Ta’ala, “Dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tidak dapat memperkenankan (doa)nya sampai hari kiamat dan mereka lalai dari (memperhatikan) doa mereka?” (Terj. Al Ahqaaf: 5)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 74",
    "description": "Itukah berhala-berhala yang kamu sembah selain Allah'' mereka para pendebat itu, menjawab, 'mereka telah hilang lenyap dari pandang-an kami, bahkan sebenarnya kami dahulu sebelum keberadaan kami di akhirat ini tidak pernah menyembah sesuatu yang layak untuk disembah. ' demikianlah cara Allah membiarkan sesat orang-orang kafir dari kebenar-an sebagai hasil pilihan bebas mereka. 75. Masih dalam kaitan kesesatan para pendebat ayat-ayat Allah itu, Al-Qur'an menjelaskan bahwa hal itu disebabkan karena mereka terlena dalam kesukariaan di bumi. 'kesesatan yang demikian itu disebabkan karena kamu dalam kehidupan dunia bersukaria di bumi dengan cara berlebih-lebihan tanpa mengindahkan kebenaran yang sesungguhnya, dan juga karena kamu selalu bersukaria dalam kemaksiatan. '."
  }
]