[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Azab yang menimpa kalian hanyasanya disebabkan oleh kelalaian kalian Dalam kehidupan dunia, di mana kalian justru berbahagia dengan dosa-dosa dan kemaksiatan-kemaksiatan yang kalian kerjakan, dan kalian membanggakan keangkuhan dan kesombongan serta pelanggaran terhadap hamba-hamba Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Dikatakan kepada mereka, “Azab yang kalian rasakan itu dikarenakan kalian dulu bergembira dengan kesyirikan yang kalian praktikkan dan kalian berlebih-lebihan dalam kegembiraan kalian itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. ذٰلِكُم بِمَا كُنتُمْ تَفْرَحُونَ فِى الْأَرْضِ (Yang demikian itu disebabkan karena kamu bersuka ria di muka bumi) Yakni azab itu disebabkan kegirangan kalian dalam bermasiat kepada Allah dan kegembiraan kalian dalam menyelisihi para rasul dan kitab-kitab-Nya ketika kalian di dunia. وَبِمَا كُنتُمْ تَمْرَحُونَ (dan karena kamu selalu bersuka ria) Yakni akibat keangkuhan dan kesombongan kalian. Makna (المرح) yakni sombong dan angkuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Azab itu karena kalian sombong dan bangga dengan menunjukkan kebahagiaan atas perbuatan maksiat tanpa memperhatikan kebenaran di dunia, yaitu berupa kesyirikan, kemaksiatan dan pengingkaran terhadap hari kebangkitan. Azab itu juga karena kalian berlagak sombong dan angkuh, senang dengan kemaksiatan serta menentang para rasul dan kitab-kitabnya. Al-Farhu Al-Madzmum adalah keberania untuk berbuat mungkar dengan anggapan bahwa itu adalah tanda-tanda kekuatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu karena kalian bersenang-senang} berlebihan dalam bersenang-senang dengan penuh kedengkian dan kesombongan {di bumi tanpa (alasan) yang benar dan karena kalian selalu bergembira"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. dan dikatakan kepada para penghuni neraka,”yang demikian itu,” maksudnya, azab yang ditimpakan secara beragam terhadap kalian itu. “disebabkan karena kamu bersuka ria dimuka bumi dengan tidak benar dan karena kamu selalu bersuka ria,” maksudnya, kalian bersuka ria dengan kebatilan yang kalian anut dan dengan ilmu-ilmu yang dengannya kalian menyelisihi ilmu para rasul, dan kalian mempermainkan hamba-hamba Allah dengan congkak, zhalim dan durhaka, seperti difirmankan Allah diakhir surat ini, “maka tatkala datang kepada mereka rasul-rasul (yang dulu diutus kepada) mereka dengan membawa keterangan-keterangan, mereka merasa senang dengan pengetahuan yang ada pada mereka,”(ghafir:83) Dan seperti apa yang dikatakan para pengikut qarun kepadanya,” janganlah kamu terlalu bangga; sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri,” (al-qashash:76) Itulah sukaria(kebanggan) yang tercela yang mengakibatkan hukuman. Berbeda dengan suka ria yang terpuji, seperti yang Allah katakan, “ katakanlah,’dengan karunia Allah dan rahmatNYa, hendaklah dengan itu mereka bergembira,” (yunus:58). Maksudnya, bergembira dengan ilmu yang bermanfaat dan amal shalih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 75: Dikatakan pula kepada mereka, (\"Yang demikian itu) yakni azab itu (disebabkan kalian bersuka ria di muka bumi dengan tidak benar) yaitu melakukan perbuatan syirik dan ingkar kepada adanya hari berbangkit (dan karena kalian selalu bersuka ria) artinya, terlalu berlebih-lebihan di dalam bersuka ria."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dikatakan pula kepada penduduk neraka. Yakni azab yang bermacam-macam itu. Yakni karena kamu bersuka ria dan berbangga dengan kebatilan yang kamu pegang dan dengan ilmu yang menyelisihi ilmu rasul serta kamu bersikap sombong terhadap hamba-hamba Allah secara zalim dan aniaya sebagaimana firman Allah Ta’ala di akhir surah ini, “Maka ketika para rasul datang kepada mereka dengan membawa bukti-bukti yang nyata, mereka merasa senang dengan ilmu yang ada pada mereka.”(Terj. Al Mu’min: 83) Dan sebagaimana firman Allah Ta’ala tentang Qarun, “Janganlah kamu terlalu bangga; sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri.” (Terj. Qarun: 76) Bergembira seperti inilah bergembira yang tercela yang mengharuskan mendapat siksa, berbeda dengan bergembira yang terpuji yaitu bergembira karena ilmu yang bermanfaat dan amal yang saleh, seperti pada firman Allah Ta’ala, “Katakanlah, \"Dengan karunia Allah dan rahmat-Nya, hendaklah dengan itu mereka bergembira. Karunia Allah dan rahmat-Nya itu adalah lebih baik dari apa yang mereka kumpulkan.” (Terj. Yunus: 58)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 75",
    "description": "Masih dalam kaitan kesesatan para pendebat ayat-ayat Allah itu, Al-Qur'an menjelaskan bahwa hal itu disebabkan karena mereka terlena dalam kesukariaan di bumi. 'kesesatan yang demikian itu disebabkan karena kamu dalam kehidupan dunia bersukaria di bumi dengan cara berlebih-lebihan tanpa mengindahkan kebenaran yang sesungguhnya, dan juga karena kamu selalu bersukaria dalam kemaksiatan. '76. Oleh sebab itu, dikatakan kepada mereka, 'masuklah kamu ke pintu-pintu neraka jahanam sebagai tempat tinggalmu, dan kamu kekal di dalamnya selama-lamanya. Maka itulah seburuk-buruk dan sejahat-jahat tempat bagi orang-orang yang sombong yang mendustakan ayat-ayat Allah. '."
  }
]