[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Masuklah kalian melalui pintu-pintu jahanam sebagai hukuman atas kekafiran kalian kepada Allah dan kemaksiatan kalian, kalian kekal di dalamnya. Jahanam adalah seburuk-buruk tempat tinggal bagi orang-orang yang menyombongkan diri terhadap Allah di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Masuklah ke dalam neraka Jahanam melalui pintu-pintunya untuk tinggal kekal di dalamnya dan ia adalah seburuk-buruk tempat tinggal bagi orang-orang yang menyombongkan diri yang mereka tinggal di sana seterusnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. ادْخُلُوٓا۟ أَبْوٰبَ جَهَنَّمَ خٰلِدِينَ فِيهَا ۖ ((Dikatakan kepada mereka): “Masuklah kamu ke pintu-pintu neraka Jahannam, sedang kamu kekal di dalamnya) Dikatakan kepada mereka hal ini setelah mereka memasuki neraka untuk mengolok mereka dan membuat mereka putus asa dari harapan untuk lolos dari azab ini atau berhentinya azab ini. فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ (Maka itulah seburuk-buruk tempat bagi orang-orang yang sombong”) Yakni Jahannam adalah seburuk-buruk tempat bagi orang-orang yang sombong dari menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Ketika dimasukkan ke dalam neraka, dikatakan kepada mereka dengan cara mencaci dan mencela: “Masuklah ke dalam neraka dengan menetap di dalamnya selama-lamanya. (Itulah) tempatnya orang-orang yang enggan menyembah Allah dan beriman kepada akhirat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Masuklah ke pintu-pintu neraka Jahanam dan kekal di dalamnya. Itulah seburuk-buruk tempat} tempat tinggal dan menetap {bagi orang-orang yang sombong”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. “masuklah kamu ke pintu-pintu neraka jahanam,” masing-masing sesuai dengan tingkatannya menurut kadar amal perbuatannya, “dengan kekal di dalamnya,” mereka tidak akan keluar darinya selama-lamanya. “dan itulah seburuk-buruk tempat bagi orang-orang yang sombong,” tempat di mana mereka dihinakan, dinistakan, ditahan, dan disiksa. Mereka bolak-balik antara puncak dan puncak dinginnya jahanam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 76: (Masuklah kalian ke pintu-pintu neraka Jahanam, sedangkan kalian kekal di dalamnya. Maka itulah seburuk-buruk tempat) yakni tempat tinggal (bagi orang-orang yang sombong.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Masing-masing berada di lapisan-lapisannya sesuai amalnya. Di tempat itu mereka dihinakan dan direndahkan, dipenjara dan disiksa serta bolak-balik merasakan panas yang tinggi dan dingin yang tinggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 76",
    "description": "Oleh sebab itu, dikatakan kepada mereka, 'masuklah kamu ke pintu-pintu neraka jahanam sebagai tempat tinggalmu, dan kamu kekal di dalamnya selama-lamanya. Maka itulah seburuk-buruk dan sejahat-jahat tempat bagi orang-orang yang sombong yang mendustakan ayat-ayat Allah. '77. Demikianlah, setelah dibentangkan apa yang dialami oleh para pendurhaka yang mendebat dengan batil ayat-ayat Allah serta digambarkan pula apa yang akan diperoleh orang-orang yang beriman, maka nabi Muhammad dan kaum beriman diminta untuk konsisten dalam keimanan dan perjuangan menyampaikan kebenaran. Maka bersabarlah engkau, wahai nabi Muhammad dan kaum beriman, sesungguhnya janji Allah itu adalah benar dan dia tidak akan memungkiri janji-Nya. Oleh sebab itu, meskipun kami perlihatkan kepadamu di masa hidupmu sebagian siksa yang kami ancamkan kepada mereka para durhaka itu, ataupun kami wafatkan engkau sebelum ajal menimpa mereka, namun mere-ka orang-orang durhaka itu tidak dibiarkan begitu saja, karena kepada kamilah mereka dikembalikan. '."
  }
]