[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bersabarlah (wahai Rasul) dan tetaplah berdakwah, sesungguhnya janji Allah adalah haq, Dia akan mewujudkan janjiNya kepadamu, bisa saja Kami memperlihatkan kepadamu sebagian dari apa yang Kami ancamkan kepada orang-orang musyrik itu berupa azab, atau Kami mewafatkanmu sebelum azab itu menimpa mereka, maka kepada Kami- lah tempat mereka kembali di Hari Kiamat, dan Kami akan membuat mereka merasakan azab yang keras akibat kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Bersabarlah -wahai Rasul- terhadap gangguan kaummu dan pendustaan mereka terhadapmu, sesungguhnya janji kemenangan dari Allah kepadamu adalah hak yang tidak ada keraguan padanya, terkadang Kami memperlihatkan kepadamu sebagian dari wujud janji Kami di dunia sebagaimana yang terjadi di perang Badar atau mungkin Kami mewafatkanmu sebelum itu, maka hanya kepada Kami semata kalian akan kembali pada hari Kiamat, lalu Kami membalas kalian terkait amal-amal kalian. Kami memasukkan mereka ke dalam neraka yang mereka kekal selama-lamanya di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. فَاصْبِرْ إِنَّ وَعْدَ اللهِ حَقٌّ ۚ( Maka bersabarlah kamu, sesungguhnya janji Allah adalah benar) Yakni ancaman Allah untuk membalas mereka pasti terjadi, baik itu di dunia maupun di akhirat. فَإِمَّا نُرِيَنَّكَ بَعْضَ الَّذِى نَعِدُهُمْ(maka meskipun Kami perlihatkan kepadamu sebagian siksa yang Kami ancamkan kepada mereka) Dengan azab di dunia berupa terbunuh di medan perang atau tertawan. أَوْ نَتَوَفَّيَنَّكَ(ataupun Kami wafatkan kamu) Sebelum kamu melihat azab diturunkan kepada mereka. Oleh sebab itu janganlah kamu meragukan kedatangannya yang pasti, dan kemenangan akhir adalah bagi dakwah Islam. فَإِلَيْنَا يُرْجَعُونَ (namun kepada Kami sajalah mereka dikembalikan) Yakni pada hari kiamat agar Kami mengazab mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Wahai Nabi, maka bersabarlah atas penderitaan yang diberikan orang-orang musyrik. Sesungguhnya Allah berjanji untuk menolongmu dan membalas musuh-musuhmu dengan pasti. Kalaupun kami menunjukkanmu sebagian azab dunia yang Kami persiapkan untuk mereka berupa pembinasaan dan penawanan atau kami membuatmu wafat sebelum melihat azab mereka. Sungguh hanya kepada Kamilah mereka akan dipulangkan dan dikembalikan pada hari kiamat, supaya Kami bisa membalas mereka atas perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bersabarlah. Sesungguhnya janji Allah itu benar. Jika Kami benar-benar memperlihatkan kepadamu sebagian dari apa yang Kami janjikan kepada mereka, ataupun jika Kami mewafatkanmu, kepada Kamilah mereka dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. maksudnya, ”maka bersabarlah kamu,” wahai rasul dalam menyeru kaummu dan terhadap gangguan mereka yang menimpamu, dan perkuatlah kesabaranmu dengan imanmu. “sesungguhnya janji Allah adalah benar,” Dia akan memenangkan agamaNYa dan meninggikan kalimatNYa serta memberikan kemenangan kepada rasul-rasulNya di dunia dan di akhirat. Dan perkuat pula itu dengan kepastian turunnya siksaan terhadap musuh-musuhmu di dunia dan akhirat nanti. Maka dari itu Dia berfirman,” maka meskipun kami perlihatkan kepadamu sebagian siksa yang kami ancamkan kepada mereka,” di dunia, maka itu sudah cukup. “ataupun kami wafatkan kamu,” sebelum mereka di siksa, “namun kepada kami sajalah mereka dikembalikan,” lalu kami beri mereka balasan atas amal perbuatan mereka. Maka jangan kamu sekali-kali mengira bahwa Allah lali terhadap apa yang dilakukan oleh orang-orang yang zhalim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 77: (Maka bersabarlah kamu, sesungguhnya janji Allah) yang akan mengazab mereka (adalah benar; maka jika Kami perlihatkan kepadamu) lafal Immaa adalah berasal dari In Syarthiyah yang diidgamkan kepada Maa Zaidah yang berfungsi mengukuhkan makna Syarat di awal Fi'il, kemudian menyusul Nun Taukid sesudahnya yang juga mengukuhkan makna syarath tadi (sebagian siksa yang Kami ancamkan kepada mereka) yakni semasa kamu masih hidup Kami menurunkan sebagian azab kepada mereka. Jawab Syarathnya tidak disebutkan, yaitu lafal Fadzaaka, yakni maka itulah sebagian dari azab Kami (atau pun Kami wafatkan kamu) yaitu sebelum mereka diazab (namun kepada Kami sajalah mereka dikembalikan) lalu Kami akan mengazab mereka dengan siksaan yang sangat keras. Jawab Syarath yang telah disebutkan di atas tadi hanyalah untuk Ma'thuf saja, yakni hanya untuk kalimah, Fa-immaa Nuriyannaka Ba'dhal Ladzii Na'iduhum, Fadzaaka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam berdakwah terhadap kaummu dan dalam merasakan gangguan dari mereka. Agar engkau dapat bersabar, maka yakinilah bahwa janji Allah adalah benar. Dia akan menolong agama-Nya, meninggikan kalimat-Nya, dan menolong rasul-rasul-Nya. Demikian juga agar engkau dapat bersabar, maka ingatlah bahwa hukuman akan menimpa musuhmu, jika tidak di dunia, maka di akhirat, karena kembali mereka kepada Allah, lalu Dia akan memberikan balasan kepada mereka sesuai yang mereka kerjakan. Allah Subhaanahu wa Ta'aala berfirman, “Dan janganlah sekali-kali kamu (Muhammad) mengira, bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zalim. Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak,” (Terj. Ibrahim: 42)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 77",
    "description": "Demikianlah, setelah dibentangkan apa yang dialami oleh para pendurhaka yang mendebat dengan batil ayat-ayat Allah serta digambarkan pula apa yang akan diperoleh orang-orang yang beriman, maka nabi Muhammad dan kaum beriman diminta untuk konsisten dalam keimanan dan perjuangan menyampaikan kebenaran. Maka bersabarlah engkau, wahai nabi Muhammad dan kaum beriman, sesungguhnya janji Allah itu adalah benar dan dia tidak akan memungkiri janji-Nya. Oleh sebab itu, meskipun kami perlihatkan kepadamu di masa hidupmu sebagian siksa yang kami ancamkan kepada mereka para durhaka itu, ataupun kami wafatkan engkau sebelum ajal menimpa mereka, namun mere-ka orang-orang durhaka itu tidak dibiarkan begitu saja, karena kepada kamilah mereka dikembalikan. '78. Bila pada ayat yang lalu ditegaskan tentang kepastian terlaksananya janji Allah berupa ancaman, maka pada ayat ini Allah mengingatkan melalui lisan nabi akan datangnya janji Allah berkaitan dengan ancam-an itu bahwa Allah akan memberi putusan dengan adil. Firman Allah, 'sesungguhnya kami, tuhan yang maha kuasa'telah mengutus beberapa rasul sebelum engkau, wahai nabi Muhammad. Di antara me-reka, para rasul yang kami utus itu, ada yang kami ceritakan kepadamu, seperti nabi ibrahim, nabi sulaiman, nabi nuh, nabi musa, dan nabi isa, dan di antaranya ada pula yang tidak kami ceritakan kepadamu. Para rasul yang kami utus itu dilengkapi dengan mukjizat, dan ketahuilah bahwa tidak ada seorang rasul membawa suatu mukjizat, kecuali seizin Allah. Maka oleh sebab itu, apabila telah datang perintah, yaitu ketentuan Allah berkaitan dengan siksa dan juga untuk semua perkara, ketentuan itu diputuskan dengan adil. Dan dengan demikian, ketika itu akan merasa rugilah orang-orang yang berpegang kepada yang batil. '."
  }
]