[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah mengutus sebelummu (wahai Rasul) rasul-rasul dalam jumlah yang banyak kepada kaum mereka. Para utusan itu mengajak mereka dan bersabar atas gangguan kaum mereka, di antara mereka ada yang Kami kisahkan beritanya kepadamu, dan di antara mereka ada yang tidak Kami kisahkan beritanya kepadamu. Semua utusan itu diperintahkan untuk menyampaikan apa yang Allah wahyukan kepada mereka, dan salah seorang dari mereka tidak mendatangkan satu tanda dari tanda-tanda yang terindra maupun yang masuk akal kecuali dengan izin Allah dan kehendakNya. Bila perintah Allah untuk mengazab orang-orang yang mendustakan telah tiba, maka Allah menetapkan keputusan antara para utusan dengan orang-orang yang mendustakan mereka dengan adil, dan pada saat itu para pembohong tersebut merugi karena kebohongan mereka atas Nama Allah dan penyembahan mereka terhadap selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Sungguh Kami telah mengutus rasul-rasul dalam jumlah yang banyak sebelummu -wahai Rasul- kepada umat-umat mereka, lalu umat-umat tersebut mendustakan mereka, menyakiti mereka, namun mereka bersabar atas pendustaan dan gangguan umat-umat mereka. Di antara para rasul itu ada yang telah Kami beritakan kisahnya kepadamu dan ada yang tidak Kami beritakan. Seorang rasul tidak bisa mendatangkan kepada kaumnya sebuah mukjizat dari Rabbnya kecuali dengan kehendak Rabbnya. Permintaan orang-orang kafir dari umat-umat mereka kepada para rasul mereka agar mendatangkan mukjizat adalah kezaliman. Jika keputusan Allah datang, keputusan berupa kemenangan atau keputusan antara para rasul dengan kaum-kaum mereka, maka keputusan itu adalah keputusan yang adil. Allah membinasakan orang-orang kafir dan menyelamatkan para rasul. Dan pada saat Allah menetapkan keputusan-Nya di antara hamba-hamba-Nya itu, para pengusung kebatilan merugi karena mereka sendiri yang mengambil sebab-sebab kebinasaan akibat dari kekufuran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Hai Rasulullah, sungguh Kami telah mengutus para rasul kepada umat-umat sebelummu; sebagian mereka Kami sampaikan kisahnya kepadamu melalui wahyu, dan sebagian lainnya tidak kami ceritakan kisah mereka. Dan tidak ada seorang rasulpun yang mendatangkan mukjizat melainkan dengan izin Allah. Jika telah datang ketetapan Allah untuk menurunkan azab atas orang-orang kafir di dunia maupun di akhirat, maka akan ditetapkan dengan adil antara orang-orang beriman dan orang-orang kafir; yaitu orang-orang beriman akan diselamatkan, sedangkan orang-orang kafir akan dibinasakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَلَقَدْ أَرْسَلْنَا رُسُلًا مِّن قَبْلِكَ مِنْهُم مَّن قَصَصْنَا عَلَيْكَ (Dan sesungguhnya telah Kami utus beberapa orang rasul sebelum kamu, di antara mereka ada yang Kami ceritakan kepadamu) Yakni Kami telah menceritakan kisah-kisah mereka apa yang mereka dapatkan dari kaum mereka. وَمِنْهُم مَّن لَّمْ نَقْصُصْ عَلَيْكَ ۗ( dan di antara mereka ada (pula) yang tidak Kami ceritakan kepadamu) Yakni Kami tidak sampaikan kepadamu pengetahuan tentang apa yang terjadi antara dia dengan kaumnya. Rasul-rasul yang disebutkan Allah di dalam al-Qur’an sekitar 25 rasul, sedangkan yang tidak disebutkan jauh lebih banyak dari itu; dan disebutkan dalam sebagian hadits-hadits bahwa jumlah seluruh rasul lebih dari 300 orang. وَمَا كَانَ لِرَسُولٍ أَن يَأْتِىَ بِـَٔايَةٍ إِلَّا بِإِذْنِ اللهِ ۚ( Tidak dapat bagi seorang rasul membawa suatu mukjizat, melainkan dengan seizin Allah) Bukan dengan kehendakmu. Yang dimaksud dengan (الآية) yakni mukjizat yang menunjukkan kebenaran kenabiannya. فَإِذَا جَآءَ أَمْرُ اللهِ(maka apabila telah datang perintah Allah) Yakni jika datang waktu yang ditentukan untuk dilaksanakannya perintah Allah dalam terjadinya hari kiamat. قُضِىَ بِالْحَقِّ(diputuskan (semua perkara) dengan adil) Yakni diputuskanlah antara mereka dengan benar. Kemudian Allah akan menyelamatkan hamba-hamba-Nya yang benar dengan ketetapan-Nya yang benar. وَخَسِرَ هُنَالِكَ(Dan ketika itu rugilah) Yakni pada saat itu. الْمُبْطِلُونَ(orang-orang yang berpegang kepada yang batil) Yakni orang-orang yang mengikuti dan melakukan kebatilan. Maka hendaklah kamu bersabar hai Muhammad, sebagai keteladanan dengan para nabi sebelummu, dan jika perintah Allah telah datang untuk memberi keputusan antara kamu dengan kaummu, niscaya Allah akan memutuskannya dengan benar, sehingga kamu akan menang dan orang-orang yang berbuat batil yang menghalangi dakwahmu akan merugi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Sungguh Kami telah mengutus banyak utusan kepada umat-umat sebelum kamu wahai Rasulallah. Di antara mereka ada yang Kami kabarkan kepadamu. Ada juga yang kami jadikan pengingat bagimu. Tidaklah seorang utusan itu mendapatkan mukjizat yang menunjukkan tentang kenabiannya kecuali atas perintah dan kehendak Allah. Jika Allah memerintahkan untuk menurunkan azab atas orang-orang kafir di dunia atau akhirat, maka Dia menentukan hukum antara para rasul dengan orang-orang yang mendustakan mereka dengan haq, yaitu menolong orang yang benar dan mengazab orang yang bathil. Ketika itu, tampaklah kerugian orang-orang yang mengikuti dan mengerjakan kebathilan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah mengutus rasul-rasul sebelummu. Di antara mereka ada yang Kami ceritakan kepadamu dan ada yang tidak Kami ceritakan kepadamu. Tidak ada seorang rasul pun membawa suatu mukjizat, kecuali seizin Allah. Maka apabila telah datang perintah Allah} azab dan peringatan Allah {maka diputuskanlah (perkara) dengan adil} diputuskanlah (perkara) dengan adil antara para rasul dan orang-orang yang mendustakannya {Ketika itu merugilah orang-orang yang berbuat bathil itu} orang-orang yang berpegang pada kebathilan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. “Dan susungguhnya telah kami utus beberapa Rosul sebelum kamu,” yang cukup banyak kepada kaumnya masing-masing, menyeru mereka dan mereka pun sabar dalam menghadapi gangguan kaumnya. “Di antara mereka ada yang Kami ceritakan kepadamu,” yakni sejarah mereka “dan di antarra mereka ada pula yang tidak Kami ceritakan kepadamu.” Setiap Rosul itu dikendalikan, mereka sama sekali tidak mempunyai wewenang “tidak dapat” bagi seorang rosul “membawa satu ayat” darri ayat-ayat naqliyah dan aqliyah “melainkan dengan seizin Allah”. Maksudnya dengan kehendak dan perintah dari Allah. Maka usulan orang yang mengusulkan kepada rosul agar mendatangkan ayat-ayat adalah perbuatan zhalim, sikap keras dan pendustaan setelah para rosul itu diperkuat oleh Allah dengan bukti-bukti yang membuktikan kejujuran mereka dan kebenaran ajaran yang mereka bawa. “maka apabila telah datang perintah Allah” untuk memberi keputusan di antara para rosul dengan musuh-musuh mereka dan kemenangan “diputuskan” di antara mereka “dengan adil” yang tepat pada tempatnya dan tetap pada yang benar, yaitu dengan menyelamatkan para rosul beserta para pengikutnya dan membinasakan orang-orang yang mendustakan, “dan ketika itu rugilah,” maksudnya, ketika keputusan itu diputuskan “orang-orang yang berpegang kepada yang batil” yaitu orang-orang yang karakter mereka adalah palsu dan ilmu dan amal yang mereka bawa pun palsu. Dan tujuan yang mereka maksud pun adalah batil. Maka hendaknya orang-orang yang ditegur waspada kalau mereka tetap terus dalam kebatilan, karena mereka akan merugi, sebagaimana orang-orang sebelumnya rugi. Sesungguhnya mereka sama sekali tidak memiliki kebaikan dan tidak pula memiliki pembebasan dalam kitab-kitab suci dengan keselamatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 78: (Dan sesungguhnya telah Kami utus rasul-rasul sebelum kamu; di antara mereka ada yang Kami ceritakan kepadamu dan di antara mereka ada -pula- yang tidak Kami ceritakan kepadamu) menurut suatu riwayat diceritakan, bahwa Allah swt. telah mengutus delapan ribu orang nabi untuk menjadi rasul; yang empat ribu orang di antaranya dari kaum Bani Israel, sedangkan yang empat ribu orang lagi dari kalangan umat-umat selain Bani Israel. (Tidak dapat bagi seorang rasul) di antara rasul-rasul itu (membawa suatu mukjizat, melainkan dengan seizin Allah) karena mereka juga hamba-hamba Allah yang diperintah oleh-Nya (maka apabila telah datang perintah Allah) yang memerintahkan supaya azab diturunkan atas orang-orang kafir (diputuskan) semua perkara di antara rasul-rasul dan orang-orang yang mendustakannya (dengan adil. Dan ketika itu rugilah orang-orang yang berpegang kepada yang batil) yakni, keputusan itu merupakan kemenangan bagi rasul-rasul dan kerugian bagi orangorang yang mendustakannya; pada hakikatnya sebelum itu pun orang-orang yang mendustakan para rasul sudah merugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menghibur Beliau dan menyabarkannya dengan mengingatkan kepada saudara-saudara Beliau dari kalangan para rasul. Yang berdakwah kepada kaumnya, lalu mereka bersabar terhadap gangguan kaumnya. Karena mereka adalah hamba yang diatur. Oleh karena itu usulan kepada para rasul agar mendatangkan ayat (mukjizat) sesuai yang mereka inginkan setelah Allah mendatangkan ayat-ayat yang menunjukkan kebenaran rasul-Nya merupakan usulan yang zalim dan memberatkan diri. Untuk memutuskan perkara antara para rasul dan musuh-musuh mereka. Yang sesuai dengan tempatnya dan sejalan dengan kebenaran, yaitu dengan menyelamatkan para rasul dan pengikutnya serta membinasakan orang-orang yang mendustakan. Saat diberikan keputusan. Yang sifat mereka adalah kebatilan, ilmu dan amal yang muncul dari mereka adalah batil, dan tujuannya juga batil. Oleh karena itu, hendaknya mereka yang ditujukan ayat ini khawatir jika terus menerus di atas kebatilan mereka, maka mereka akan rugi sebagaimana generasi sebelum mereka telah rugi, karena mereka sudah tidak ada lagi kebaikannya dan tidak ada jaminan selamat dari azab dalam kitab-kitab terdahulu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 78",
    "description": "Bila pada ayat yang lalu ditegaskan tentang kepastian terlaksananya janji Allah berupa ancaman, maka pada ayat ini Allah mengingatkan melalui lisan nabi akan datangnya janji Allah berkaitan dengan ancam-an itu bahwa Allah akan memberi putusan dengan adil. Firman Allah, 'sesungguhnya kami, tuhan yang maha kuasa'telah mengutus beberapa rasul sebelum engkau, wahai nabi Muhammad. Di antara me-reka, para rasul yang kami utus itu, ada yang kami ceritakan kepadamu, seperti nabi ibrahim, nabi sulaiman, nabi nuh, nabi musa, dan nabi isa, dan di antaranya ada pula yang tidak kami ceritakan kepadamu. Para rasul yang kami utus itu dilengkapi dengan mukjizat, dan ketahuilah bahwa tidak ada seorang rasul membawa suatu mukjizat, kecuali seizin Allah. Maka oleh sebab itu, apabila telah datang perintah, yaitu ketentuan Allah berkaitan dengan siksa dan juga untuk semua perkara, ketentuan itu diputuskan dengan adil. Dan dengan demikian, ketika itu akan merasa rugilah orang-orang yang berpegang kepada yang batil. '79. Penjatuhan sebuah sanksi dengan pertimbangan yang adil dan tidak menzalimi merupakan bentuk dari kasih sayang Allah sebagai pemilik alam semesta. Allah berkuasa mutlak atas apa yang dia miliki itu. Ayat-ayat berikut menguraikan kemahakuasaan Allah yang berkaitan dengan berbagai fenomena makhluk ciptaan-Nya. 'Allah-lah yang menjadikan dan menundukkan hewan ternak untukmu, seperti unta, kuda, kambing, sapi, dan lain sebagainya. Sebagian dari hewan ternak itu untuk kamu kendarai dan sebagian lagi untuk kamu makan."
  }
]