[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "79-80. Allah Yang menciptakan hewan ternak untuk kalian agar kalian mengambil manfaat darinya, yaitu manfaat mengendarai, dikonsumsi dan manfaat- manfaat lainnya. Dengan mengendarainya kalian bisa sampai ke negeri-negeri jauh di mana hal itu adalah hajat yang ada dalam dada kalian, di atas punggung hewan-hewan inilah kalian diangkut di daratan sebagaimana kalian diangkut oleh kapal di lautan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Allah yang menciptakan unta, sapi dan domba untuk kalian. Sebagiannya kalian tunggangi, dan sebagiannya lagi kalian makan dagingnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79-81. Allah mengabarkan tentang karunia-Nya bagi para hamba; yang telah menciptakan bagi mereka unta sebagai tunggangan dan makanan, serta menetapkan padanya berbagai manfaat seperti susu, kulit, dan bulunya. Dan agar kalian dapat memenuhi kebutuhan kalian untuk sampai di negeri yang jauh. Di atas hewan-hewan ini dan kapal-kapal kalian diangkut. Dan Allah memperlihatkan kepada kalian tanda-tanda yang menunjukkan keesaan-Nya; maka tanda dan bukti apalagi yang akan kalian ingkari?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. اللهُ الَّذِى جَعَلَ لَكُمُ الْأَنْعٰمَ (Allahlah yang menjadikan binatang ternak untuk kamu) Yakni Allah menciptakannya bagi kalian, binatang-binatang ternak ini adalah delapan pasang binatang yang disebutkan pada surat al-An’am: 143. لِتَرْكَبُوا۟ مِنْهَا وَمِنْهَا تَأْكُلُونَ(sebagiannya untuk kamu kendarai dan sebagiannya untuk kamu makan) Yakni agar sebagiannya dapat kalian tunggangi dan sebagian lainnya dapat kalian makan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Allah SWT adalah Dzat yang menciptakan hewan ternak (yang dimaksud di sini adalah unta) untuk kalian agar dapat kalian kendarai sebagian dan kalian makan sisanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allahlah Dzat yang menjadikan hewan ternak untuk kalian, agar bisa kalian kendarai sebagian darinya dan sebagian lainnya untuk kalian makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79-80. Allah mengingatkan akan karuniaNya terhadap hamba-hambaNya, dimana Dia telah menciptakan untuk mereka binatang-binatang ternak berkaki empat yang dengannya banyak sekali didapat pemberian nikmat, di antaranya adalah nikmat mengendarainya dan memuatinya dengan muatan. Di antaranya, ada yang dagingnya dimakan dan air susunya diminum. Di antaranya Juga manfaat untuk kehangatan badan dan menjadikannya sebagai alat-alat perabotan yang dibuat dari kulit, bulu dan rrambutnya, serta berbagai manfaat lainnya. “Dan supaya kamu mencapai keperluan yang tersimpan dalam hati dengan mengendarainya,” seperti bisa sampai ke daerah-daerah lain yang sangat jauh, tercapainya rasa senang dan bahagia bagi para penghuninya, “dan kamu dapat diangkut dengan mengendarai binatang-binatang itu dan dengan mengendarai bahtera (perahu layar).” Maksudnya, kalian diangkut di atas kendaraan-kendaraan darat dan bahtera laut, di situ kalian diangkut oleh Allah yang telah mendudukan kendaraan itu, dan telah menyediakan berbagai fasilitas untuknya yang semua itu tidak bisa dicapai kecuali dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 79: (Allahlah yang menjadikan binatang ternak untuk kalian) menurut suatu pendapat dikatakan, bahwa yang dimaksud hanyalah unta saja. Tetapi menurut pendapat yang kuat, ternak yang dimaksud mencakup pula sapi dan kambing (sebagiannya untuk kalian kendarai dan sebagiannya untuk kalian makan.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberi nikmat kepada hamba-hamba-Nya dengan menjadikan untuk mereka binatang ternak yang dari sana mereka memperoleh berbagai kenikmatan, di antaranya manfaat menungganginya, manfaat memakan dagingnya, meminum susunya, menghangatkan badan dengan kulitnya, dan membuat berbagai alat dari kulit, bulu dan rambutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 79",
    "description": "Penjatuhan sebuah sanksi dengan pertimbangan yang adil dan tidak menzalimi merupakan bentuk dari kasih sayang Allah sebagai pemilik alam semesta. Allah berkuasa mutlak atas apa yang dia miliki itu. Ayat-ayat berikut menguraikan kemahakuasaan Allah yang berkaitan dengan berbagai fenomena makhluk ciptaan-Nya. 'Allah-lah yang menjadikan dan menundukkan hewan ternak untukmu, seperti unta, kuda, kambing, sapi, dan lain sebagainya. Sebagian dari hewan ternak itu untuk kamu kendarai dan sebagian lagi untuk kamu makan. 80. Dan di samping itu, bagi kamu ada lagi manfaat-manfaat yang lain padanya, seperti mengambil manfaat dari bulu, kulit, susu hewan ternak itu, dan juga agar kamu mencapai suatu keperluan atau tujuan yang tersimpan dalam hatimu dengan mengendarainya. Dan dengan mengendarai binatang-binatang itu bila dalam perjalanan di darat, dan bila dalam perjalanan di laut atau di sungai mereka dapat diangkut di atas kapal."
  }
]