[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Tuhan kami, masukkanlah orang-orang yang beriman ke dalam surga-surga Adn yang telah Engkau janjikan kepada mereka, dan orang-orang yang shalih karena iman dan amal shalih dari bapak-bapak mereka, istri-istri mereka dan anak-anak mereka. Sesungguhnya Engkau Mahaperkasa yang menundukkan segala sesuatu, juga Mahabijaksana dalam penciptaan dan pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Para Malaikat berkata, “Wahai Rabb kami! Masukkanlah orang-orang Mukmin ke dalam surga kekekalan yang telah Engkau janjikan kepada mereka, masukkanlah siapa yang amalnya saleh dari bapak-bapak mereka, istri-istri mereka dan anak-anak mereka. Sesungguhnya Engkau Maha Perkasa, tidak seorang pun bisa mengalahkan-Mu, dan Maha Bijaksana dalam takdir dan pengaturan-Mu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. رَبَّنَا وَأَدْخِلْهُمْ جَنّٰتِ عَدْنٍ الَّتِى وَعَدتَّهُمْ (ya Tuhan kami, dan masukkanlah mereka ke dalam surga ‘Adn yang telah Engkau janjikan kepada mereka) Yakni dengan janji itu. وَمَن صَلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوٰجِهِمْ وَذُرِّيّٰتِهِمْ ۚ( dan orang-orang yang saleh di antara bapak-bapak mereka, dan isteri-isteri mereka, dan keturunan mereka semua) Dan masukkanlah bersama mereka orang-orang sholeh yang beriman dan yang mengesakan Allah serta yang beramal shaleh dari kerabat mereka untuk menyempurnakan kenikmatan dan kebahagiaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Ya Tuhan kami, masukkanlah mereka ke dalam surga ‘Adn selamanya sebagaimana yang Engkau janjikan kepada mereka melalui para utusan-Mu. Sertakan juga para orang tua nenek moyang, para istri dan keluarga mereka yang saleh, yaitu mereka yang beriman dan mengesakan-Mu. Mereka telah menjalankan perintah-Mu, sungguh Engkau Maha Perkasa Maha Penakluk dan tidak terkalahkan. Yang Maha Bijaksana dalam segala keputusan dan pekerjaan. Yang meletakkan segala sesuatu pada tempat yang paling sesuai"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Tuhan kami, masukkanlah mereka ke dalam surga ‘Adn yang telah Engkau janjikan kepada mereka serta orang yang shalih di antara nenek moyang, istri, dan keturunan mereka. Sesungguhnya Engkaulah Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “ya robb kami, dan masukanlah mereka ke suga ‘Adn yang telah Engkau janjikan kepada meeka” melalui lisan para rosulMu. “dan orang-orang sholeh”, maksudnya, oang yang sholeh karena beriman dan beramal kebajikan, “di antara bapak-bapak dan isti-istri mereka”, maksudnya, istri-istri mereka, suami-suami mereka, para sahabat dan rekan-rekan mereka, “dan keturunan mereka semua. Sesungguhnya Engkau-lah yang Maha perkasa”. Yang mengalahkan segela sesuatu, maka dengan keperkasaanMu itulah Engkau mengampuni mereka dan mengangkat segala maabahaya dari mereka serta mengantakan mererka dengannya kepada segala kebaikan, “lagi Mahabijaksana” Yang meletakansegala sesuatu tepat pada tempat-tempatnya. Kami tidak akan memohon kepadaMu, Wahai Robb kami, sesuatu pekaa yang kebijakanMu menghendaki yang lain dari itu, melainkan dai kebijaksanaanMu yang telah Engkau beitakan melalui lisan para rosulMu dan menjadi tuntutan karuniaMu, yaitu ampunan bagi orang-orang yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 8: (Ya Rabb kami! Masukkanlah mereka ke dalam surga Adn) sebagai tempat tinggal mereka (yang telah Engkau janjikan kepada mereka dan orang-orang yang saleh) lafal Man shalaha diathafkan kepada lafal Hum yang terdapat di dalam lafal Waadkhilhum atau yang terdapat pada lafal Wa'adtahum (dari bapak-bapak mereka, dan istri-istri mereka, dan keturunan mereka. 299 Sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana) di dalam perbuatan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Melalui lisan para rasul-Mu. Mereka menjadi saleh karena iman dan amal saleh. Dengan keperkasaan-Mu, Engkau ampuni dosa mereka, Engkau hilangkan hal yang dikhawatirkan mereka dan Engkau sampaikan mereka kepada semua kebaikan. Yakni yang meletakkan sesuatu pada tempatnya. Oleh karena itu, kami tidak meminta kepada-Mu sesuatu yang menyelisihi kebijaksanaan-Mu, bahkan termasuk hikmah-Mu yang Engkau beritahukan melalui lisan para rasul-Mu dan dikehendaki oleh karunia-Mu, yaitu memberi ampunan kepada orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 8",
    "description": "Para malaikat meneruskan permohonan mereka kepada Allah, 'ya tuhan kami yang maha pengasih lagi maha penyayang, masukkanlah mereka, orang-orang mukmin itu, ke dalam surga 'adn, yang sebelumnya telah engkau janjikan kepada mereka, dan yang juga telah engkau janjikan kepada orang yang saleh di antara nenek moyang, istri-istri, dan keturunan mereka. Sungguh, engkaulah tuhan yang mahaperkasa lagi mahabijaksana. 9. Permohonan para malaikat selanjutnya, 'dan ya Allah tuhan kami yang maha pemurah, peliharalah mereka dari bencana kejahatan. Dan orang-orang yang engkau pelihara mereka dari bencana kejahatan pada hari itu, maka sungguh, engkau telah menganugerahkan rahmat yang sa-ngat luas kepadanya dan demikian itulah curahan rahmat kemenangan yang teramat agung. '."
  }
]