[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "79-80. Allah Yang menciptakan hewan ternak untuk kalian agar kalian mengambil manfaat darinya, yaitu manfaat mengendarai, dikonsumsi dan manfaat- manfaat lainnya. Dengan mengendarainya kalian bisa sampai ke negeri-negeri jauh di mana hal itu adalah hajat yang ada dalam dada kalian, di atas punggung hewan-hewan inilah kalian diangkut di daratan sebagaimana kalian diangkut oleh kapal di lautan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Kalian mendapatkan dari makhluk-makhluk ini manfaat yang beraneka ragam dan sesuai dengan keadaan zaman. Dan kalian bisa memenuhi kebutuhan-kebutuhan yang kalian inginkan dari hewan tersebut, salah satunya adalah untuk perjalanan dari satu tempat ke tempat lainnya melalui jalan darat atau laut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَلَكُمْ فِيهَا مَنٰفِعُ (Dan (ada lagi) manfaat-manfaat yang lain pada binatang ternak itu untuk kamu) Yakni manfaat-manfaat lain selain sebagai tunggangan dan makanan, seperti kalian dapat mengambil manfaat dari bulu, wol, rambut, lemak, keju, dan lain sebagainya. وَلِتَبْلُغُوا۟ عَلَيْهَا حَاجَةً فِى صُدُورِكُمْ(supaya kamu mencapai suatu keperluan yang tersimpan dalam hati dengan mengendarainya) Yakni hewan-hewan itu dapat mengangkut barang-barang kalian dari satu negeri ke negeri lain untuk menyelesaikan keperluan kalian di negeri yang jauh itu dengan mudah. وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُونَ(Dan kamu dapat diangkut dengan mengendarai binatang-binatang itu dan dengan mengendarai bahtera) Yakni mengendarai unta di daratan dan kapal di lautan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Dalam hewan ternak itu, ada banyak manfaat lain bagi kalian seperti susu, kulit, wol dan bulu unta. Selain itu, supaya kalian bisa memenuhi kebutuhan kalian untuk bepergian ke berbagai negeri dengan mengendarainya dan membawa beban berat. Al-Haajah adalah sesuatu yang penting. Kalian bisa membawanya saat mengendarainya atau menaiki perahu ketika berada di laut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi kalian ada manfaat-manfaat lain darinya. Kalian bisa memenuhi keperluan yang ada dalam dada kalian dengan mengendarainya} apapun itu {Di atasnya dan di atas kapal-kapal} di atas unta ketika di darat dan di atas bahtera ketika di laut {kalian diangkut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79-80. Allah mengingatkan akan karuniaNya terhadap hamba-hambaNya, dimana Dia telah menciptakan untuk mereka binatang-binatang ternak berkaki empat yang dengannya banyak sekali didapat pemberian nikmat, di antaranya adalah nikmat mengendarainya dan memuatinya dengan muatan. Di antaranya, ada yang dagingnya dimakan dan air susunya diminum. Di antaranya Juga manfaat untuk kehangatan badan dan menjadikannya sebagai alat-alat perabotan yang dibuat dari kulit, bulu dan rrambutnya, serta berbagai manfaat lainnya. “Dan supaya kamu mencapai keperluan yang tersimpan dalam hati dengan mengendarainya,” seperti bisa sampai ke daerah-daerah lain yang sangat jauh, tercapainya rasa senang dan bahagia bagi para penghuninya, “dan kamu dapat diangkut dengan mengendarai binatang-binatang itu dan dengan mengendarai bahtera (perahu layar).” Maksudnya, kalian diangkut di atas kendaraan-kendaraan darat dan bahtera laut, di situ kalian diangkut oleh Allah yang telah mendudukan kendaraan itu, dan telah menyediakan berbagai fasilitas untuknya yang semua itu tidak bisa dicapai kecuali dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 80: (Dan -ada lagi- manfaat-manfaat lain pada binatang ternak itu untuk kalian) yaitu berupa air susu, keturunan binatang ternak itu dan juga dari bulu-bulunya (dan supaya kalian mencapai suatu keperluan yang tersimpan dalam hati) maksudnya, dapat kalian gunakan untuk mengangkut barang-barang ke berbagai negeri (dengan mengendarainya) di daratan (dan dengan menaiki bahtera) yakni perahu melalui jalan laut (kalian dapat menaiki semuanya.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu sampai ke negeri yang jauh sambil merasakan kebahagiaan dan kegembiraan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 80",
    "description": "Dan di samping itu, bagi kamu ada lagi manfaat-manfaat yang lain padanya, seperti mengambil manfaat dari bulu, kulit, susu hewan ternak itu, dan juga agar kamu mencapai suatu keperluan atau tujuan yang tersimpan dalam hatimu dengan mengendarainya. Dan dengan mengendarai binatang-binatang itu bila dalam perjalanan di darat, dan bila dalam perjalanan di laut atau di sungai mereka dapat diangkut di atas kapal. 81. Dan dia telah memperlihatkan tanda-tanda kebesaran dan kekuasaan-Nya kepadamu. Lalu tanda-tanda kebesaran dan kekuasaan Allah yang mana lagi yang kamu ingkari'' melalui ayat ini diharapkan manusia menyadari keberadaan Allah sebagai tuhan satu-satunya yang layak dipertuhankan, disembah, dan dimintai pertolongan-Nya."
  }
]