[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Manakala umat-umat yang mendustakan itu didatangi para rasul mereka dengan membawa bukti-bukti yang nyata, mereka berbahagia dengan ilmu yang mereka miliki yang bertentangan dengan apa yang dibawa oleh utusan-utusan mereka, karena kebodohan mereka. Azab pun menimpa mereka, padahal sebelumnya mereka menghina dan mengejek para utusan untuk segera mendatangkan azab tersebut. Ayat ini mengandung dalil bahwa setiap ilmu yang bertentangan dengan Islam atau mencederai Islam atau meragukan kebenaran Islam, ilmu tersebut adalah ilmu yang tercela dan dibenci, serta orang yang meyakininya bukan termasuk diantara para pengikut Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Ketika para rasul datang kepada mereka dengan bukti-bukti yang nyata dan mukjizat-mukjizat yang mengagumkan, mereka mendustakannya. Mereka rela berpegang kepada ilmu mereka yang bertentangan dengan apa yang dibawa oleh para rasul mereka, maka turunlah kepada mereka apa yang mereka remehkan sebelumnya, yaitu azab yang telah diperingatkan oleh para rasul mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَلَمَّا جَآءَتْهُمْ رُسُلُهُم بِالْبَيِّنٰتِ (Maka tatkala datang kepada mereka rasul-rasul (yang diutus kepada) mereka dengan membawa ketarangan-keterangan) Yakni dengan hujjah-hujjah yang jelas dan mukjizat-mukjizat yang terang. فَرِحُوا۟ بِمَا عِندَهُم مِّنَ الْعِلْمِ(mereka merasa senang dengan pengetahuan yang ada pada mereka) Yakni mereka menampakkan kesenangan atas apa yang mereka miliki yang mereka sebut dengan ilmu, padahal sebenarnya itu hanyalah syubhat dan pengakuan palsu mereka. Pendapat lain mengatakan yang dimaksud adalah mereka merasa senang dengan ilmu tentang dunia yang mereka miliki, dan bukan ilmu tentang agama, sebagaimana disebutkan dalam firman Allah: يعلمون ظاهرا من الحياة الدنيا “Mereka hanya mengetahui yang lahir (saja) dari kehidupan dunia.” (ar-Rum: 7) وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ(dan mereka dikepung oleh azab Allah yang selalu mereka perolok-olokkan itu) Yakni mereka dikepung oleh balasan olokan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Ketika para rasul datang kepada mereka dengan mukjizat dan dalil untuk mengesakan Allah, mereka lebih memilih akidah menyimpang dan menolak para rasul itu. Lalu turunlah azab yang sering mereka ejek itu kepada mereka. Mereka juga dipertontonkan kepada balasan atas olok-olokan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika para rasul datang kepada mereka dengan bukti-bukti nyata, mereka merasa senang dengan pengetahuan yang ada pada mereka} akidah yang menyimpang dan keraguan yang bathil {mereka dikepung} dikelilingi {oleh azab yang dahulu mereka olok-olok"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Allah menyebutkan kejahatan besar mereka, seraya berfirman “Maka tatkala datang kepada mereka rosul-rosul mereka dengan membawa keterangan-keterangan,” seperti kitab-kitab ilahi dan mukjizat-mukjizat hebat, ilmu yang bermanfaat yang membedakan antara hidayah dengan kesesatan, yang haq dan yang batil, “mereka justru merasa senang dengan pengetahuan yang ada pada mereka” yang berlawanan dengan agama para rosul itu. Padahal sudah dimaklumi bahwa kesenangan mereka menunjukan kepada betapa sangat rela dan berpegang teguhnya mereka kepadanya, dan betapa mereka menentang kebenaran yang dibawa oleh para rosul itu, serta menjadikan kebatilan mereka sebagai kebenaran. Ini umum mencakup semua ilmu yang digunakan untuk menentang ajaran yang dibawa oleh para Rosul. Dan yang paling berhak masuk ke dalam kategori ini adalah ilmu filsafat dan mantiq Yunani yang dengannya banyak sekali ayat-ayat Al-quran yang ditolak, dan menyepelekan kedudukannya di dalam hati, dan menjadikan dalil-dalilnya yang pasti lagi meyakinkan itu sebagai dalil-dalil lafdzi belaka, tidak menginformasikan keyakinan sedikitpun. Dan akal orang-orang dungu lagi sesat pun lebih diutamakan atas ayat-ayat Al-Quran. Ini merupakan tindakan kekufuran terbesar terhadap ayat-ayat Allah, perlawanan, dan pembatalan terhadapnya. Hanya kepada Allah-lah kita memohon pertolongan “Dan mereka dikepung” mereka dilandan oleh azab yang dahulu mereka perolok-olokan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 83: (Maka tatkala datang kepada mereka rasul-rasul mereka dengan membawa keterangan-keterangan) yakni mukjizatmukjizat yang nyata (mereka merasa senang) orang-orang kafir itu (dengan apa yang ada pada mereka) yakni rasul-rasul itu (yaitu pengetahuan mereka) pengertian gembira di sini mengandung makna ejekan dan olok-olokan seraya ingkar kepada apa yang didatangkan oleh para rasul itu (dan menimpalah) maksudnya, turunlah (kepada mereka apa yang selalu mereka perolokolokkan itu) yaitu, azab Allah yang selalu mereka ejek itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah menyebutkan kesalahan besar mereka. Yaitu dengan kitab-kitab samawi, mukjizat, ilmu yang bermanfaat yang menerangkan petunjuk daripada kesesatan, yang hak dari yang batil. Mereka merasa senang dengan pengetahuan yang ada pada mereka maksudnya ialah bahwa mereka sudah merasa cukup dengan ilmu pengetahuan yang ada pada mereka dan tidak merasa perlu lagi dengan ilmu pengetahuan yang diajarkan oleh rasul-rasul mereka, malah mereka memandang enteng dan memperolok-olokkan keterangan yang dibawa rasul-rasul itu. Sudah menjadi maklum, bahwa kegembiraan mereka menunjukkan ridhanya mereka terhadapnya dan berpegangnya mereka kepadanya serta menentang kebenaran yang dibawa para rasul. Termasuk ke dalam contoh ilmu yang biasanya manusia berbangga dengannya adalah ilmu Filsafat dan ilmu Mantiq Yunani, dimana dengan ilmu itu mereka bantah banyak ayat-ayat Al Qur’an, mengurangi keagungannya di hati manusia, serta menjadikan dalil-dalilnya yang yakin dan qath’i (pasti) sebagai dalil-dalil lafzhi yang tidak membuahkan sedikit pun keyakinan, mereka dahulukan akal orang-orang yang bodoh dan batil daripada dalil-dalil tersebut. Ini termasuk sikap menyimpang dalam ayat-ayat Allah dan menentangnya, wallahul musta’aan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 83",
    "description": "Mengapa peradaban umat-umat terdahulu itu hancur dan hanya tinggal sejarahnya saja berupa fosil atau tinggalan lainnya' itu semua tidak lain karena disebabkan oleh kedustaan dan olok-olokan mereka terhadap para rasul yang diutus dari kalangan mereka sendiri. 'maka ketika para rasul yang berasal dari kalangan mereka sendiri, datang kepada mereka dengan membawa bukti-bukti yang nyata berupa petunjuk dari Allah, mereka membelakangi petunjuk Allah yang dibawa oleh para rasul itu, karena congkak dan sombong, merasa lebih senang dan lebih hebat dengan ilmu yang ada pada mereka, dan karena itu, mereka dikepung oleh azab yang dahulu mereka memperolok-olokkannya. 84. Maka ketika mereka umat terdahulu itu melihat betapa berat dan mengerikan azab kami itu, mereka pun berkata dengan nada bermohon, 'kami hanya beriman kepada Allah yang maha esa saja, dan kami ingkar kepada sembahan-sembahan yang dahulu kami sembah dan yang telah kami persekutukan dengan Allah. '."
  }
]