[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tatkala mereka melihat azab Kami, mereka pun mengakui disaat di mana pengakuan tidak berguna. Mereka berkata, “Kami beriman kepada Allah semata dan kafir kepada apa yang telah Kami persekutukan dengan Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Ketika mereka menyaksikan azab Kami, mereka mengaku saat pengakuan tidak berguna lagi dengan mengatakan, “Kami beriman kepada Allah semata, kami kafir kepada apa yang selama ini kami sembah berupa sekutu-sekutu dan berhala-berhala.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. فَلَمَّا رَأَوْا۟ بَأْسَنَا (Maka tatkala mereka melihat azab Kami) Yakni ketika mereka menyaksikan azab Kami yang turun kepada mereka. قَالُوٓا۟ ءَامَنَّا بِاللهِ وَحْدَهُۥ وَكَفَرْنَا بِمَا كُنَّا بِهِۦ مُشْرِكِينَ(mereka berkata: “Kami beriman hanya kepada Allah saja, dan kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah”) Yakni kafir kepada berhala-berhala yang dahulu mereka sembah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Ketika melihat dahsyatnya siksa Kami, mereka berkata: “Kami hanya beriman kepada Allah dan kami mengingkari apa yang kami sekutukan dalam ibadah berupa berhala dan patung” Sesungguhnya mereka itu berlepas diri dari kesyirikan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka melihat azab Kami} azab kami {mereka berkata,“Kami hanya beriman kepada Allah saja dan kami mengingkari sesembahan yang telah kami persekutukan denganNya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. “maka tatkala mereka melihat azab kami.” Maksudnya, siksaan kami, mereka pun mengakui, di mana pengakuan sudah tidak berguna lagi. Dan “mereka bekata ‘Kami beriman hanya kepada Allah saja dan kami kafir kepada sembahan-sembahan yang telah kami perrsekutukan dengan Allah” yaitu seperti patung dan berhala, dan kami berlepas dirri dari apa saja yang menyalahi para rosul, dalam ilmu ataupun amal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 84: (Maka tatkala mereka melihat azab Kami) yakni betapa kerasnya azab Kami (mereka berkata, \"Kami beriman hanya kepada Allah saja, dan kami kafir kepada sesembahan-sesembahan yang telah kami mempersekutukannya dengan Allah.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai sikap pengakuan, namun ketika itu pengakuan tidak lagi bermanfaat. Baik patung maupun berhala, dan kami berlepas diri dari segala sesuatu yang menyelisihi rasul, baik yang berupa ilmu maupun amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 84",
    "description": "Maka ketika mereka umat terdahulu itu melihat betapa berat dan mengerikan azab kami itu, mereka pun berkata dengan nada bermohon, 'kami hanya beriman kepada Allah yang maha esa saja, dan kami ingkar kepada sembahan-sembahan yang dahulu kami sembah dan yang telah kami persekutukan dengan Allah. '85. Maka tak pelak lagi, iman mereka ketika mereka telah melihat dan merasakan azab kami, tidak berguna lagi sama sekali bagi mereka. Itulah ketentuan Allah yang telah berlaku terhadap hamba-hamba-Nya yang durhaka. Dan ketika itu rugilah orang-orang kafir yang berbuat durhaka dengan penuh kesombongan."
  }
]