[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iman mereka tidak berguna bagi mereka saat mereka melihat azab Kami. Hal itu karena iman dalam kondisi tersebut adalah iman yang terpaksa, bukan iman suka rela dan pilihan. Sunnah dan keputusan Allah yang berlaku untuk seluruh umat, bahwa iman tidak berguna saat pelakunya mengikrarkannya dalam keadaan melihat azab. Saat azab Allah datang, maka binasalah orang-orang kafir dan orang-orang yang ingkar terhadap tauhid Allah dan tidak menaatiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Ketika mereka telah menyaksikan azab Kami turun atas mereka, maka ketika itu iman mereka tidak berguna lagi sedikitpun bagi mereka, Sunnah Allah yang berlaku pada hamba-hamba-Nya yang telah berlalu bahwa iman mereka tidak berguna manakala mereka menyaksikan azab Allah. Orang-orang kafir itu merugi manakala azab datang, karena mereka telah menjerumuskan diri mereka ke dalam sebab-sebab kebinasaan akibat dari kekufuran mereka kepada Allah, dan mereka tidak bertobat darinya sebelum mereka melihat azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. فَلَمْ يَكُ يَنفَعُهُمْ إِيمٰنُهُمْ لَمَّا رَأَوْا۟ بَأْسَنَا ۖ (Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami) Yakni ketika mereka menyaksikan azab Kami. Sebab keimanan itu bukan keimanan yang dapat bermanfaat bagi pemiliknya, karena keimanan yang bermanfaat bagi pemilihnya hanya keimanan yang didapat atas pilihannya, bukan karena terpaksa. Dan ketika mereka menyaksikan azab itu sudah tidak berlaku lagi kewajiban syari’at, sebab ketika itu semua orang akan beriman. Begitu pula di akhirat kelak, tidak bermanfaat iman seseorang pada saat terjadinya kiamat yang sebelumnya tidak beriman di dunia. سُنَّتَ اللهِ الَّتِى قَدْ خَلَتْ فِى عِبَادِهِۦ ۖ( Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya) Yakni Allah telah menetapkan ketetapan ini bagi seluruh umat, yaitu tidaklah bermanfaat iman seseorang yang telah melihat azab. وَخَسِرَ هُنَالِكَ الْكٰفِرُونَ (Dan di waktu itu binasalah orang-orang kafir) Yakni ketika mereka melihat azab Allah. Dan orang kafir sebenarnya merugi setiap saat, namun kerugian mereka akan nampak ketika mereka melihat azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Keimanan mereka saat melihat azab Kami itu tidak berguna karena waktu penerimaan taubat telah habis. Sesungguhnya iman yang pilih-pilih itu tidak berguna, tidak juga iman karena terpaksa. Ketentuan tentang ketidak bergunaan iman itu terjadi ketika (mereka) menyaksikan azab. Itu adalah sunnatullah yang ditentukan oleh Allah kepada seluruh umat. Orang-orang kafir itu mendapatkan kerugian yang tidak dapat diganti oleh apapun saat mereka melihat azab itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak} tidak {berguna bagi mereka keimanan mereka setelah melihat azab Kami. (Yang demikian itu) merupakan sunatullah yang telah berlaku terhadap hamba-hambaNya} cara Allah yang berlaku pada seluruh umat, bahwa tidak berguna keimanan mereka ketika melihat azab {Ketika itu merugilah orang-orang kafir}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. “Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami”, maksudnya, pada saat itu. Inilah “Sunnah Allah” yakni kebinasaanNya, “yang telah berlaku terhadap hamba-hambaNya.” Yaitu bahwa orang-orang yang mendustakan, pada saat mereka ditimpa azab Allah dan hukumannya, maka mereka pun berriman. Namun, iman mereka tidak benar dan tidak dapat menyelamatkan mereka dari siksa itu. Hal itu disebabkan kererna iman meerka adalah iman terpaksa, mereka terpaksa melakukannya, dan iman setelah menyaksikan siksaan. Sedangkan iman yang bermanfaat yang dapat menyelamatkan pelakunya adalah iman dengan yang ghaib, yaitu yang terjadi sebelum ada tanda-tanda azab. “Dan di waktu itu rugilah,” maksudnya, waktu dibinasakan dan ditimpakan azab “orang-orang kafir” terhadap agama, dunia, dan akhiat mereka. Ia tidak cukup hanya sekedar kerrugian di sana, melainkan harus ada kerugian yang menyengsarakan di dalam azab yang amat dahsyat dan kekal di dalamnya selama-lamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 85: (Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami. Itulah sunah Allah) dinashabkannya lafal Sunnatallaahi karena menjadi Mashdar dari Fi'il yang diperkirakan keberadaannya, dan Fi'il tersebut diambil dari lafalnya (yang telah berlaku terhadap hamba-hamba-Nya) yaitu pada semua umat, bahwasanya iman tiada gunanya apabila timbul di kala azab turun. (Dan di waktu itu merugilah orang-orang kafir) yakni jelaslah kerugian mereka; masing-masing di antara mereka mengalami kerugian yang nyata; dan memang sebelum itu pun mereka adalah orang-orang yang merugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni iman tidaklah bermanfaat ketika azab telah datang. Hal itu, karena iman tersebut adalah iman karena terpaksa dan sudah menyaksikan langsung, padahal iman hanyalah bermanfaat ketika masih gaib, yaitu sebelum ada tanda-tanda azab. Yakni jelas sekali kerugian mereka bagi setiap orang. Sedangkan mereka sebelum itu juga selalu rugi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 85",
    "description": "Maka tak pelak lagi, iman mereka ketika mereka telah melihat dan merasakan azab kami, tidak berguna lagi sama sekali bagi mereka. Itulah ketentuan Allah yang telah berlaku terhadap hamba-hamba-Nya yang durhaka. Dan ketika itu rugilah orang-orang kafir yang berbuat durhaka dengan penuh kesombongan. 1. '' m'm. Hanya Allah saja yang maha tahu tentang apa maksudnya."
  }
]