[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan palingkanlah dari mereka akibat buruk dari amal-amal keburukan mereka, maka jangan menyiksa mereka karenanya. Dan barangsiapa yang Engkau palingkan darinya akibat buruk perbuatannya di hari perhitungan, maka Engkau telah merahmatinya dan memberi nikmat kepadanya dengan keselamatan dari siksaMu, dan itu adalah kemenangan yang besar di mana tiada kemenangan sepertinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Peliharalah mereka dari akibat buruk perbuatan jahat mereka, jangan mengazab mereka karenanya, dan barangsiapa Engkau pelihara pada hari Kiamat dari hukuman-Mu karena akibat amalnya yang buruk maka Engkau telah merahmati-Nya. Penjagaan dari azab dan rahmat dengan masuk Surga adalah kemenangan besar yang tidak tertandingi oleh kemenangan apapun.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَقِهِمُ السَّيِّـَٔاتِ ۚ( dan peliharalah mereka dari (balasan) kejahatan) Yakni jagalah mereka dari azab akibat amal keburukan yang telah mereka lakukan dengan memberi ampunan kepada mereka dan tidak membalas keburukan mereka, dan jauhkanlah mereka dari azab yang akan menyakiti mereka. وَمَن تَقِ السَّيِّـَٔاتِ يَوْمَئِذٍ(Dan orang-orang yang Engkau pelihara dari (pembalasan) kejahatan pada hari itu) Yakni pada hari kiamat. فَقَدْ رَحِمْتَهُۥ ۚ( maka sesungguhnya telah Engkau anugerahkan rahmat kepadanya) Dengan menjauhkannya dari azab-Mu dan memasukkannya ke dalam surga-Mu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Selamatkanlah mereka dari bencana dunia dan akhirat. Ini adalah doa/ungkapan dzikrul am ba’dal khos yaitu penyebutan secara umum kemudian diikuti penyebutan secara khusus, adapun yang dimaksud adalah azab neraka Jahim. Agar Engkau mengampuni mereka dan tidak sedikitpun mengazab mereka. Perlindungan dari keburukan bermakna agar Allah menyelamatkan mereka dari balasan dari keburukan pada hari kiamat. Sehingga Engkau telah menyelamatkan dan mengasihi mereka dari belenggu azab-Mu. Itulah keberuntungan yang besar, tidak ada yang melebihi keberuntungan itu yaitu keridhoan Allah dan surga Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lindungilah mereka dari keburukan} dan jauhkanlah mereka dari kesudahan yang buruk bagi mereka {Siapa saja yang Engkau lindungi dari keburukan} yang Engkau jauhkan dari kesudahan yang buruk {pada hari itu} hari kiamat {sungguh Engkau telah merahmatinya. Itulah kemenangan yang agung”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Dan peliharalah mereka dari keburukan pada hari itu”. Maksudnya, pada Harri Kiamat, “maka sesungguhnya telah Engkau anugrahkan rahmat kepadanya”, sebab rahmatMu terus tercurah kepada manusia, tidak ada yang bisa menghalanginya kecuali dosa mereka dan amal perbuatan buruk mereka. Maka siapa saja yang Engkau pelihara dari keburukan dan Engkau bimbing ia untuk beramal kebajikan dan memperoleh pahala yang sangat besar. “dan itulah” yakni, hilangnya hal-hal yang membahayakan karena dipelihara dari keburukan-keburukan dan kaena tercapainya rahmat itu, “adalah kemenangan yang besar” yang tidak ada kemenangan yang sebanding dengannya dan tidak ada pula yang diperlombakan oleh manusia yang lebih baik darinya. Doa para malaikat di atas mengandung dalil sempurrna nya pengetahuan mereka tentang Tuhannya, juga (diisyaratkannya) betawasul kepada Allah dengan nama-namaNya yang indah yang Dia suka kalau hamba-hambaNya bertawasul kepadaNya dengan nama-nama tesebut dan memohon dengan apa-apa yang sangat pantas untuk dijadikan doa kepadaNya. Oleh karena doa mereka demi tercapainya rahmat dan dihapusnya dosa segala bekas dosa yang telah dikerjakan oleh jiwa manusia yang telah diketahui oleh Allah kelemahan dan akibatnya karena kemaksiatan-kemaksiatan yang telah dilakukannya, dan prinsip-prinsip serta sebab-sebab lainnya yang semua itu telah diketahui Allah, maka para malaikat bertawasul dengan a-rohim dan al-‘alim. Doa diatas juga mengandung makna kesempurnaan etika terhadap Allah, di mana mereka mengikrarkan rububiyyahNya terhadap mereka dengan rububiyyah yang umum dan yang khusus, dan ikar mereka bahwa mereka sama sekali tidak memiliki kewenangan sedikitpun. Doa yang mereka lakukan kepada Allah itu benar-benar hanya berasal dari hamba yang faqir dari segala sisinya, tidak pernah berjasa sedikitpun kepada Rabb, melainkan semua itu adalah murni merupakan karunia Allah, kemurahan dan kebaikanNya. Dan ia juga mengandung makna sikap sempurna mereka yang selalu sejalan dengan kehendak Allah, yaitu mencintai amal perbuatan apa saja yang dicintaiNya, yang sebenarnya iada adalah berupa amal ibadah yang mereka lakukan. Dan mereka bersungguh-sungguh seperti kesungguhan orang yang mencintai, dan dari para pengabdi yang mana mereka adalah orang-orang Mukmin yang dicintai Allah di antara makhlukNya. Semua makhluk yang mukallaf itu diberrnci oleh Allah kecuali orang-orang yang beriman diantara mereka. Dan di antarar bentuk-bentuk kecintaan para malaikat kepada mereka adalah mereka berdoa kepada Allah dan berusaha keras untuk kebaikan kondisi mereka. Sebab doa bagi seseorang adalah merupakan bukti yang paling tinggi kecintaan, ia tidak akan berdoa kecuali untuk orang yang dicintainya. Dan juga mengandung makna tentang apa yang Allah uraikan dan rincikan dari doa mereka setelah firmanNya, “mereka memintakan ampunan bagi orang-orang yang beriman.” Yaitu peringatan yang sangat lembut tentang bagaimana mentadaburi kitabNya, dan seharusnya orang yang menghayati tidak berhenti hanya sekedar pada lafaznya saja, melainkan semestinya ia menghayati makna yang terkandung di dalam lafaznya. Lalu apabila ia telah memahaminya dengan pemahaman yang benar sebagaimana mestinya, maka ia mencermati dengan akal pikirannya kepada perintah dan kepada metode-metode yang dapat mengantarkan kepadanya, kepada apa-apa yang tidak akan bisa tercapai kecualidengannya, dan kepada apa-apa yang menjadi sandarannya, lalu memastikan bahwa itulah yang Allah kehendaki, dan sebagaimana Dia pastikan bahwa Dia menghendaki makna khusus yang dikandung oleh lafaz itu. Dan yang wajib dipastikan bahwa Allah menghendakinya adalah dua hal : Pertama, pengetahuan dan keyakinannya bahwasanya makna tersebut bagian dari makna lafaz dan yang dimaksud. Kedua, pengetahuannya bahwa Allah mengetahui segala sesuatu, dan bahwa Allah memerintahkan hamba-hambaNya untuk mengjayati makna-makna kitabNya. Dia-lah yang memberi informasi bahwa kitabNya itu adalah petunjuk, cahaya, dan penjelasan bagi segala sesuatu, dan ia adalah ungkapan (pekataan) yang paling fasih dan paling jelas. Maka dengan demikian seseorang akan memperoleh ilmu yang sangat agung dan kebaikan yang berlimpah sesuai dengan bimbingan Allah kepadanya. Dan dalam tafsir kami ini terdapat hal-hal seperti ini yang sangat banyak sekali, Allah telah mengarruniakan kepada kami, yang kadang-kadang pada sebagian ayat tidak tampak bagi orang yang tidak merenungkan akan kebenaran makna tersebut. Kami memohon kepada Allah, semoga Dia berrkenan membukakan kepada kami sebagian dari pembendaharaaan rahmatNya yang menjadi sebab bagi kebaikan kondisi kami dan kondisi kaum muslimin. Kami tidak memiliki selain ketergantungan kepada kemurahanNya dan bertawasul dengan kebaikanNya yang terus kamim panjatkan setiap saat dan setiap waktu. Dan kami memohon kepadaNya sebagian dai karuniaNya untuk memelihara kami dari kejahatan jiwa kami yang selalu menjadi penghalang dan rintangan untuk meperoleh rahmatNya. Suseungguhnya Dia Maha Pemurah lagi Maha pemberi, yang telah mengaruniakan segala sebab-sebab dan faktir-faktornya. Dan doa itu juga mengandung makna bahwa pendamping, yaitu istri, anak dan sahabat akan merasakan kebahagiaan dengan teman karibnya, dan bahkan hubungannya dengannya menjadi sebab bagi kebaikan yang ia raih di luar amalannya dan menjadi sebab amalannya, sebagaimana para malaikat mendoakan orang-orang yang mukmin dan orang-orang yang sholih dari bapak-bapak mereka, istri-istri, dan anak keturunan mereka. Jadi, harus ada keshalihan mereka, sebab Allah berfirman, “dan orang-orang sholih”, barulah yang demikian itu merupakan hasil dai amal mereka. Wallohu A’lam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mu’min ayat 9: (Dan peliharalah mereka dari kejahatan) dari balasan azabnya (Dan orang-orang yang Engkau pelihara dari balasan kejahatan pada hari itu) pada hari kiamat (maka sesungguhnya telah Engkau anugerahkan rahmat kepadanya dan itulah kemenangan yang besar.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kejahatan di sini adalah amal yang buruk dan akibatnya, karena ia membuat sedih pelakunya. Yaitu hari Kiamat. Karena rahmat-Mu senantiasa mengalir kepada hamba-hamba-Mu, tidak ada yang menghalanginya selain dosa-dosa hamba dan keburukannya. Oleh karena itu, barang siapa yang Engkau pelihara dari kejahatan, maka berarti Engkau telah memberinya taufik kepada kebaikan dan kepada balasannya yang baik. Yakni hilangnya hal yang dikhawatirkan karena dipelihara dari kejahatan dan diperolehnya hal yang dicintai karena memperoleh rahmat. Dimana tidak ada kemenangan yang serupa dengannya. Syaikh As Sa’diy menerangkan, bahwa doa malaikat ini mengandung beberapa hal: - Sempurnanya pengetahuan mereka (para malaikat) terhadap Tuhan mereka. - Bertawassul (menggunakan sarana dalam berdoa) kepada Allah dengan nama-nama-Nya yang indah, dimana Dia suka jika hamba-hamba-Nya bertawassul dengannya. - Berdoa dengan dengan menggunakan Asmaa’ul Husna yang sesuai. Oleh karena doa mereka isinya meminta rahmat dan meminta disingkirkan pengaruh dari tabiat kemanusiaan yang diketahui Allah kekurangannya dan keinginannya berbuat maksiat serta dasar-dasar dan sebab-sebab yang diketahui oleh Allah, maka mereka bertawassul dengan nama-Nya Ar Rahiim (Yang Maha Penyayang) dan Al ‘Aliim (Yang Maha Mengetahui). - Sempurnanya adab mereka terhadap Allah Ta’ala dengan pengakuan rububiyyah (pengurusan) Allah baik rububiyyyah ‘aammah (umum) maupun khaashshah (khusus). - Mereka (para malaikat) tidak memiliki kekuasaan apa-apa dan bahwa doa mereka kepada Tuhan mereka muncul dari mereka yang fakir (butuh) dari berbagai sisi, tidak bisa megemukakan keadaan apa pun, dan itu tidak lain karena karunia Allah, kemurahan dan ihsan-Nya. - Menurutnya mereka kepada Tuhan mereka dengan mencintai amal yang dicintai Tuhan mereka, yaitu ibadah yang mereka lakukan dan mereka bersungguh-sungguh sebagaimana bersungguh-sungguhnya orang-orang yang cinta. Demikian pula mereka mencintai orang-orang yang beramal, yaitu kaum mukmin, dimana mereka (kaum mukmin) adalah orang-orang yang dicintai Allah di antara sekian makhluk-Nya. Semua manusia yang sudah mukallaf (terkena kewajiban) dibenci Alah kecuali orang-orang yang beriman, maka di antara kecintaan malaikat kepada mereka (kaum mukmin) adalah mereka berdoa kepada Allah dan berusaha untuk kebaikan keadaan mereka, karena doa untuk seseorang termasuk bukti yang menunjukkan kecintaannya, karena seseorang tidaklah berdoa kecuali kepada orang yang ia cintai. - Dari penjelasan Allah secara rinci tentang permohonan ampun para malaikat terdapat catatan yang perlu disadari bagaimana cara mentadabburi (memikirkan) kitab-Nya, dan bahwa tadabbur tidaklah terbatas pada makna lafaz secara satuannya, bahkan sepatutnya ia mentadabburi makna (kandungan) lafaz. Jika ia memahaminya dengan pemahaman yang benar sesuai maksudnya, maka dengan akalnya ia melihat perkara itu dan jalan yang mencapaikan kepadanya, sesuatu yang menjadi penyempurnanya dan tergantung padanya, dan ia pun dapat meyakini bahwa Allah menginginkan demikian, sebagaimana ia yakini makna khusus yang ditunjukkan oleh sebuah lafaz. Yang perlu tetapkan adalah, bahwa Allah Subhaanahu wa Ta'aala menginginkan dua perkara: Pertama, mengetahui dan memastikannya bahwa ia termasuk yang ikut dalam makna tersebut dan tergantung dengannya. Kedua, pengetahuannya bahwa Allah mengetahui segala sesuatu, dan bahwa Allah memerintahkan hamba-hamba-Nya untuk mentadabburi dan memikirkan kitab-Nya. Allah Subhaanahu wa Ta'aala mengetahui sesuatu yang melekat dengan makna itu, dan Dia yang memberitahukan bahwa kitab-Nya adalah petunjuk, cahaya dan penjelas segala sesuatu, dan bahwa ia adalah ucapan yang paling fasih dan paling jelas. Dengan demikian, seorang hamba dapat memperoleh ilmu yang banyak dan kebaikan yang besar sesuai taufiq yang Allah berikan kepadanya. Namun terkadang sebagian ayat samar maknanya bagi selain peneliti yang sehat pemikirannya. Oleh karena itu kita meminta kepada Allah Subhaanahu wa Ta'aala agar Dia membukakan kepada kita sebagian di antara perbendaharaan rahmat-Nya yang menjadi sebab baiknya keadaan kita dan kaum muslimin. Kita tidak bisa berbuat apa-apa selain bergantung dengan kemurahan-Nya, bertawassul dengan ihsan-Nya; dimana kita senantiasa berada di dalamnya di setiap waktu dan setiap saat. Demikian pula kita meminta kepada Allah karunia-Nya agar Dia memelihara kita dari keburukan diri kita yang menjadi penghalang bagi kita untuk sampai kepada rahmat-Nya, sesungguhnya Dia Maha Pemberi, yang mengaruniakan sebab dan musabbabnya. - Dari ayat di atas juga dapat diketahui bahwa pendamping, baik istri, anak dan kawan bisa menjadi bahagia dengan kawannya, dan berhubungan dengannya menjadi sebab untuk kebaikan yang akan diperolehnya, di luar amalnya dan sebab amalnya sebagaimana para malaikat mendoakan kaum mukmin dan orang-orang saleh dari kalangan nenek moyang mereka, istri-istri mereka dan keturunan mereka, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’min Ayat 9",
    "description": "Permohonan para malaikat selanjutnya, 'dan ya Allah tuhan kami yang maha pemurah, peliharalah mereka dari bencana kejahatan. Dan orang-orang yang engkau pelihara mereka dari bencana kejahatan pada hari itu, maka sungguh, engkau telah menganugerahkan rahmat yang sa-ngat luas kepadanya dan demikian itulah curahan rahmat kemenangan yang teramat agung. '10. Sesungguhnya bagi orang-orang yang kafir, kepada mereka pada hari kiamat itu diserukan oleh para malaikat, 'sungguh, kebencian Allah, kepadamu, wahai orang-orang yang durhaka, jauh lebih besar daripada kebencianmu kepada dirimu sendiri, karena ketika kamu diseru oleh rasul dan orang-orang beriman untuk beriman kepada Allah dan rasul-Nya, lalu kamu mengingkarinya dengan menolak seruan itu. '."
  }
]