[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Sucikanlah nama tuhanmu yang maha tinggi dari sekutu dan kekurangan dengan penyucian yang layak dengan keagungan NYA, Yang menciptakan makhluk-makhluk dan membaguskan serta menguatkan penciptaannya. Yang menetapkan takdir segala sesuatu, lalu membimbing makhluk kepada apa yang cocok baginya, Yang menumbuhkan padang gembala hijau, Lalu sesudahnya menjadikannya mengering dan berubah menjadi hitam setelah ia berwarna hijau."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sucikanlah Rabbmu yang Mahatinggi di atas makhluk-Nya dengan melafalkan nama-Nya saat engkau menyebut-Nya, dan ketika engaku mengagungkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Allah memerintahkan Nabi Muhammad dan umatnya untuk bertasbih menyucikan-Nya dari segala hal yang tidak pantas bagi Dzat, sifat, perbuatan, nama, dan hukum-Nya; sebab Dia Maha Tinggi, tidak ada yang lebih tinggi dari-Nya, Dia Yang menciptakan seluruh makhluk dengan sebaik-baik penciptaan, tidak ada dari ciptaan itu yang tidak sesuai, Dia menetapkan pada makhluk segala yang berguna, dan menyesuaikannya dengan penuh kesesuaian susunan dan detailnya, serta mengilhamkan hal yang Dia tetapkan untuk bekerja sesuai fungsinya dan memberinya kemampuan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى (Sucikanlah nama Tuhanmu Yang Maha Tinggi) Yakni sucikanlah Allah dari segala yang tidak pantas bagi-Nya dengan mengucapkan: “Subhaana Rabbiyal a’laa”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1) . Pada suatu kesempatan Ibnu Mas'ud membaca beberapa ayat dari surah ini : { سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى } tatkala beliau sampai pada ayat : { بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا } Ibnu Mas'ud kemudian menghentikan bacaannya dan menemui sahabat-sahabat Nabi lainnya, lalu berkata : \"Dunia telah menggoda kita, karena kita telah menyaksikan perhiasannya, dan juga wanita-wanitanya, makanan dan minum yang berlimpah didalamnya, dan akhirat telah sirna dari harapan kita karenannya, kita lebih memilih kenikmatan yang sementara ini ketimbang kenikmatan akhirat yang akan kekal selamanya\". 2) . Surah al-Ghasyiah dan surah al-A'la memiliki kesamaan pada satu kata yang terkandung didalamnya, yaitu kata { فذكر } yang menerangkan bahwasanya dua surah ini berfokus pada satu tujuan yang sama yaitu sebagai peringatan akan keagungan dan kuasa Allah, menjadikan dalil dari ayat-ayat Nya, dan mengingatkan akan azab-Nya yang amat sangat pedih, oleh karena itu Allah berfirman pada surah ini : { النَّارَ الْكُبْرَىٰ } \"api yang besar\" , dan pada surah al-ghasyiah Allah berkata dengan satu kalimat yang saling berkaitan satu sama lainnya : { الْعَذَابَ الْأَكْبَرَ ) , dua ayat yang memberi peringatan kepada orang-orang beriman untuk selalu mengintropeksi diri, dan selalu waspada dari penyimpangan syari'at tuhannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Keutamaan: Diriwayatkan dari Bukhari Muslim, bahwa Nabi berkata kepada Mu’adz: “Wahai Mu’adz, Mengapa dalam shalatmu, kamu tidak membaca sabbih isma rabbika al a’la atau wasy syamsi wa dhulhaha atau wa al laili idzza yaghsya saja?” 1. Bertasbihlah wahai Nabi dengan menyebut nama Tuhanmu yang memiliki Keagungan sangat tinggi dan tidak ada yang sepadan dengan-Nya. Dengan perkataanmu : Maha Suci Tuhanku yang Maha Tinggi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sucikanlah nama Tuhanmu} Sucikanlah Tuhanmu dengan menyebut namaNya {Yang Maha tinggi} Yang tinggi Dzat dan kekuasaanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-3 Allah memerintahkan para hamba untuk memahasucikanNya (dengan melakukan hal-hal) yang mencakup dzikir, ibadah, tunduk dan patuh terhadap keagungan Allah serta merendah karena keagunganNya. Pujian tersebut adalah pujian yang pantas dan sesuai dengan keagungan Allah, yakni dengan menyebutkan nama-namaNya yang baik lagi tinggi di atas setiap nama dengan maknanya yang agung. Dan menyabutkan perbuatan-perbuatanNya yang di antaranya adalah menciptakan dan menyempurnakan dan membaguskan penciptaanNya. “Dan yang menentukan,” yakni takdir yang diikuti oleh takdir-takdir yang lain, “dan memberi petunjuk,” kepada semua makhluk ciptaan kepada takdir tersebut ini adalah hidayah (petunjuk) secara umum, yang intinya bahwa Dia menunjuki setiap makhluk kepada apa-apa yang merupakan kemaslahatan baginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Surah yang agung ini serta surah Al-Ghasyiah seruing dibaca oleh Rasulullah ﷺ ketika melaksanakan shalat Jum'at bersama para kaum muslimin lannya, juga ketika beliau ﷺ melaksanakan shalat Ied ( sebagaimana yang terdapat dalam hadits yang diriwayatkan oleh Imam Muslim : 878 dari hadits Nu'man bin Basyir ) , beliau ﷺ juga sering membacanya dalam shalat witir ; beliau ﷺ membaca surah ini pada rakaat pertama dan surah \"Al-Kafirun\" di rakaat kedua, dan surah \"al-Ikhlas\" pada rakaat witir ( terakhir ). Dan itu menandakan keagungan dan petingnya mempelajari kandugan surah ini, sebagian besar Ulama mengatakan bahwasanya surah ini termasuk \"Surah Makkiyah\" yang diturunkan kepada Rasulullah ﷺ di Kota Makkah, dan sebagian lainnya mengatakan bahwasanya surah ini termasuk \"Surah Madaniyah\" . { سَبِّحِ } Kata perintah untuk bertasbih, { اسْمَ رَبِّكَ الْأَعْلَى } yakni bertasbihlah kamu dengan menyebut nama Tuhanmu yang paling tinggi, dan Allah ﷻ memliki nama yang mulia yang jumlahnya sangant banyak dan tidak diketahui secara pasti selain Dia ﷻ yang mengetahuinya, nama-nama itu menjadi bukti akan keagungan dan kesempurnaan yang Allah ﷻ miliki, diantara nama-nama itu ada 99 nama yang Allah ﷻ kabarkan kepada hambanya yang beriman yang barangsiapa mengetahuinya, maka ia akan masuk kedalam surga Allah ﷻ sebagaimana yang disebutkan didalam hadits yang diriwayatkan oleh Imam Bukhori : 2737 dan Imam Muslim : 2677 dari hadits Abu Hurairah, Allah ﷻ juga berfirman : { وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا ۖ وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ ۚ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ } ( Hanya milik Allah asmaa-ul husna, maka bermohonlah kepada-Nya dengan menyebut asmaa-ul husna itu dan tinggalkanlah orang-orang yang menyimpang dari kebenaran dalam (menyebut) nama-nama-Nya. Nanti mereka akan mendapat balasan terhadap apa yang telah mereka kerjakan. ) [ Al-A'raf : 180 ] , dalam ayat lain Allah berfirman : { اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ } ( Dialah Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia. Dia mempunyai al asmaaul husna (nama-nama yang baik), ) [ Thaha : 8 ] , Allah juga mengatakan dalam surah Al-Hasyr : { هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ } ( Dialah Allah Yang Menciptakan, Yang Mengadakan, Yang Membentuk Rupa, Yang Mempunyai Asmaaul Husna. Bertasbih kepada-Nya apa yang di langit dan bumi. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana. ) [ Al-Hasyr : 24 ] , seluruh nama-nama Allah adalah baik dan mulia, nama-nama yang mengandung makna yang sangat agung, dan bukan sekedar nama yang tidak bermakna apapun. Dan setiap nama-nama yang dimiliki oleh-Nya adalah menunjukkan sifat-sifat yang Allah ﷻ miliki, sebagai contoh : السَمِيع menunjukkan bahwasanya Allah ﷻ itu Maha mendengar, dan البصِير menunjukkan bahwasanya Allah ﷻ itu Maha melihat, dan العَليم menunjukkan bahwasanya Allah ﷻ itu Maha mengetahui, dan seterusnya, semua nama-nama Allah ﷻ yang tertera dalam Al-Qur'an dan Sunnah adalah menunjukkan akan sifat-sifat Allah ﷻ . Firman Allah { سَبِّحِ اسْمَ رَبِّكَ } bermakna : bahwasnya semua nama-nama Allah itu harus dimuliaan dan diagungkan, dan berdoalah kepada Allah ﷻ dengan menyebutkan nama-nama Nya yang Mulia itu, dan bertawassul lah dengan nama-nama Allah ﷻ yang agung itu, berbeda dengan mereka yang meniadakan nama dan sifat Allah ﷻ , mereka mengahapuskan semua nama-nama dan sifat yang agung dan mulia itu dari Allah ﷻ , diantara mereka juga ada yang merubah lafazh asli dari nama-nama itu sehingga mengandung makna yang berbeda dan salah, ada juga yang menafsirkan makna dari nama-nama Allah itu kedalam pebahasan yang salah dan rusak, mereka adalah dari kelompok : \"Al-Jahmiyah\" dan \"Al-Mu'tazilah\" , mereka yang meniadakan nama dan sifat Allah itu tidak pernah memuliakan dan mengagungkan nama-nama dan sifat Allah ﷻ , mereka tidak mengetahui makna nama-nama tersebut yang sesuai dengan keagungan Allah ﷻ. . Dikatakan dalam riwayat lain ditafsirkan : bahwasanya makna : { سَبِّحِ اسْمَ رَبِّكَ } yakni : sucikanlah Tuhanmu, Muliakanlah dan Agungkanlah Tuhanmu, walaupun demikian, dari dua penafsiran diatas tidak menghilangkan maksud utama dari pensucian nama-nama Allah ﷻ , karena barangsiapa yang memuji nama tertentu maka sesungguhnya dia telah memuji pemilik nama tersebut. { الْأَعْلَى } Adalah salah satu sifat dari sifat-sifat Allah yang dimiliki oleh-Nya, pendapat lain mengatakan : sifat yang dimiliki oleh nama itu sendiri, yakni nama-nama Allah ﷻ, nama yang paling tinggi dan paling agung ; yaitu nama yang merupakan sifat untuk Allah ﷻ , atau sifat untuk nama Allah ﷻ itu sendiri, karena kedudukan yang paling tinggi hanya untuk Allah ﷻ, dan untuk nama-nama Nya, dan sifat-sifat Nya, serta apapun yang Dia ﷻ lakukan, dzat yang paling tinggi kedudukannya diatas segala makhluk, dan kekuatan yang paling besar, serta kekuasaan yang paling luas, dan kedudukan yang paling besar dan paling agung hanyalah milik Allah ﷻ, termasuk nama dan sifat yang dimiliki-Nya ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى \" Sucikanlah nama Rabbmu Yang Maha Tinggi,\" Yang diajak bicara pada ayat ini adalah Rasul shallallaahu 'alaihi wa sallam. Pembicaraan yang ditujukan kepada Rasul dalam al-Quran al-Karim terbagi menjadi tiga: Pertama: Yang terdapat dalil yang mengkhususkannya tertuju hanya bagi rasul saja maka ini khusus untuk Rasul. Kedua: Yang Terdapat dalil bahwa itu umum maka itu umum. Ketiga, Yang tidak terdapat dalil yang menunjukkan salah satu dari yang pertama dan kedua. Maka yang seperti ini secara lafaz khusus untuknya namun secara keberlakuan hukum mencakup untuk seluruh umat. Contoh untuk yang pertama: Firman Allah Tabaaraka wa Ta'ala: أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ (1) وَوَضَعْنَا عَنْكَ وِزْرَكَ \" Bukankah Kami telah melapangkan untukmu dadamu?, Dan Kami telah menghilangkan dari padamu bebanmu, \"(QS. Asy-Syarh: 1-2) Contohnya juga: Firman Allah Ta'ala: وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولًا \" Kami mengutusmu menjadi Rasul kepada segenap manusia. \"(QS. An-Nisa: 79)Sudah diketahui bahwa ini khusus bagi Nabi Shallallaahu 'alaihi wa sallam. Contoh kedua yang ditujukan kepada Rasul 'alaihissholaatu wassalaam, di dalamnya ada qarinah (indikasi) menunjukkan keumuman: Firman Allah Ta'ala: يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ \" Hai Nabi, apabila kamu menceraikan istri-istrimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) idahnya (yang wajar) dan hitunglah waktu idah itu \"(QS. Ath-Thalaq: 1) Pembicaraan pada ayat ini pertama-tama tertuju kepada Nabi shallallahhu 'alai wa sallam, Allah berfirman: \"Hai nabi\" Allah tidak berfirman: \"Hai Orang-orang yang beriman apabila kalian mentalak…\" Allah Berfirman: أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ \"Hai Nabi apanila kalian mentalak \" Ini menunjukan bahwa pembicaraan yang tertuju kepada Rasul 'alaihissholaatu wassalaam, selain tertuju kepada beliau juga tertuju kepada seluruh umatnya. Ada pun contoh-vontoh untuk yang ketiga maka ini sangat banyak, Allah mengarahkan pembicaraan kepada Rasul 'alaihissholaatu wassalaam, sedangkan maksudnya secara lafadz tertuju untuk beliau namun secara hukum tertuju secara umum. Di sini Allah 'Azza wa Jalla berfirman: سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى \" Sucikanlah nama Rabbmu Yang Maha Tinggi,\" Maknanya: Sucikanlah Allah dari segala yang tidak layak bagi kemuliaan dan keagungan-Nya, sesungguhnya tasbih itu berarti pensucian. Jika anda mengucapkan Subhaanallaah maka artinya: bahwa saya mensucikan Allah dari segala kejelekan dari segala aib, dari segala kekurangan. Oleh karenanya di antara nama-nama Allah Ta'ala: As-Salaam (Maha selamat)al-Quddus (Maha Suci) karena Dia terbebas dari semua aib. Saya beri contoh: Di antara sifat-sifat Allah Ta'ala, kehidupan yang tidak ada kekurangannya dari segala sisi, sedangkan kehidupan manusia terdapat kekurangan di dalamnya. Pertama: Karena kehidupan manusia di dahului dengan ketiadaan, Manusia tidaklah azaliy (azaliy adalah yang kehidupannya tidak diawalai ketiadaan) Kedua: kehidupan manusia akan bertemu dengan kefanaan كُلُّ مَنْ عَلَيْهَا فَانٍ \"Semua yang ada di bumi itu akan binasa. \"(QS. Ar-Rahman: 27) Contoh lainnya: Pendengaran Allah 'Azza Wa Jalla tidak terdapat kekurangan di dalamnya, Dia mendengarkan segala sesuatu, sehingga ada wanita yang datang kepada nabi, ia mengeluh kepada Nabi shallallahu 'alaihi wa sallam , yang Allah sebutkan kisahnya dalam surat al-Muajadalah. Wanita tersebut berbicara dengan Nabi shallallaahu 'alaihi w sallam, pada saat itu Aisyah berada di dalam kamar, sebagian pembicaraannya samar kurang terdegar olehnya, tetapi Allah Ta'ala berfirman dalam kitab-Nya: قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا \" Sesungguhnya Allah telah mendengar perkataan wanita yang memajukan gugatan kepada kamu tentang suaminya, \"(QS. Al-Mujadalah: 1) Oleh karena itu Aisyah mengatakan: اَلْحَمْدُ لِلهِ الَّذِي وَسِعَ سَمْعُهُ الْأْصْوَاتَ، إِ نَّ الْمَرأَةَ الْمُجَادِلَةَ لَتَشْتَكِي إِلَى النَّبِيِّ صّلَّى اللهُ عَلَيْهِ وَسَلَّم وَإِنَّه لَيَخْفَى عَلَيَّ بَعضُ حَدِيْثِهَا \" Dengan menyebut nama Allah yang pendengaran-Nya meliputi suara-suara, sungguh wanita yang yang mengadu, mengeluh kepada Nabi shallallaahu 'alaihi wa sallam, dan sungguh sebagian pembicaraannya samar (tidak terdengar) dariku. \" (1) dengan begitu maka makna Sabbih adalah sucikanlah Allah dari segala aib dan kekuarangan Firman Allah اسْمَ رَبِّكَ الْأَعْلَى \" nama Rabbmu Yang Maha Tinggi,\" sebagian ahli tafsir mengatakan: Sesungguhnya firman Allah اسْمَ رَبِّكَ الْأَعْلَى \" Sucikanlah nama Tuhanmu Yang Maha Tinggi,\" yakni: sebutan (nama) Rabbmu karena Tasbih bukanlah untuk nama (Allah) namun tasbih itu tertuju kepada Allah itu sendiri, tetapi yang benar bahwa maknanya adalah sucikanlah Rabb mu dengan menyebutkan nama-Nya, yakni: tidak bertasbih dengan hati saja namun sucikanlah Dia dengan hati dan Lisan, itu dengan cara menyebutkan nama Allah Ta'ala, yang menunjukkan makna ini adalah firman Allah Ta'ala: فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ \" Maka bertasbihlah dengan (menyebut) nama Rabbmu Yang Maha Besar. \"(QS. Al-Waqi'ah: 96) Yakni: bertasbihlah dengan tasbih yang disertai dengan (penyebutan) nama, itu dikerenakan bertasbih kepada Allah bisa dengan hati dengan keyakinan dan bisa dengan lisan, dan bisa juga dengan keduanya, maksudnya disini adalah bertasbih dengan keseluruhannya, dengan hati disertai pengucapan dengan lisan. Firman-Nya: رَبِّكَ \"Rabbmu\" Ar-rabb maknanya adalah: Yang mencipakan, yang memiliki dan yang mengatur segala perkara. Allah adalah yang menciptakan, Dia juga yang memilki (menguasai) dan Dia juga yang mengatur segala perkara. Orang-orang musyrik mengakui hal tersebut, وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ \" Dan sesungguhnya jika kamu tanyakan kepada mereka: \"Siapakah yang menciptakan langit dan bumi?\" entu mereka akan menjawab: \"Allah\". \"(QS. Luqman: 25) وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ \" Dan sungguh jika kamu bertanya kepada mereka: \"Siapakah yang menciptakan mereka, niscaya mereka menjawab: \"Allah\" \"(QS. Az-Zukhruf: 87) Allah subhaanahu wa Ta'ala ,engabarkan bahwa apabila mereka ditanya : أَمَّنْ يَمْلِكُ السَّمْعَ وَالْأَبْصَارَ وَمَنْ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَمَنْ يُدَبِّرُ الْأَمْرَ فَسَيَقُولُونَ اللَّهُ \" siapakah yang kuasa (menciptakan) pendengaran dan penglihatan, dan siapakah yang mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup dan siapakah yang mengatur segala urusan?\" Maka mereka akan menjawab: \"Allah\" \"(QS. Yunus: 31) Mereka mengakui bahwa Allah memiliki kuasa, memiliki kemampuan mengatur dan menciptakan, tetapi di sisi lain mereka tetap menyembah yang lain-Nya, ini adalah kebodohan, bagaimana mungkin anda mengakui bahwa Allah satu-satunya Pencipta, pemilik (juga penguasa) dan Pengatur segala perkara namun anda menyembah selain-Nya?!! Dengan begitu maka makna Rab adalah Pencipta, Pemilik dan pengatur segala perkara, dan setiap manusia yang mengakui hal terebut maka seharusnya ia tidak menyembah kecuali hanya kepada Allah, sebagaimana ditunjukkan oleh banyak ayat: يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِنْ قَبْلِكُمْ \" Hai manusia, sembahlah Rabbmu Yang telah menciptakanmu dan orang-orang yang sebelummu, \"(QS. Al-baqarah: 21) Allah berfirman: اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ \" sembahlah Rabbmu Yang telah menciptakanmu \" Maknanya: janganlah sembah selain-Nya. الْأَعْلَى \"Maha Tinggi\" berasal dari kata al-'Uluw (tingggi) Tingginya Allah 'Azza Wa Jalla terbagi menjadi dua jenis: Tinggi secara sifat dan tinggi secara zat. Ada pun maksud tingginya Allah 'Azza Wa Jalla secara sifat, adalah sifat yang paling sempurna adalah milik Allah 'Azza Wa Jalla, Allah Ta'ala berfirman: وَلِلَّهِ الْمَثَلُ الْأَعْلَى \" dan Allah mempunyai sifat yang Maha Tinggi \"(QS. An-Nahl: 60) Sedangkan ketinggian Allah secara zat: Maka ketinggian itu adalah bahwa Allah di atas hamba-hamba-Nya dan beristiwa di atas arsy-Nya. Jika sorang insan mengatakan Ya Allah, kemana ia akan mengarahkan? Ia akan mengarah ke langit ke atas, Allah Jalla wa 'Alaa di atas segala sesuatu dia tinggi beristiwa di atas arsy. Dengan begitu maka al-A'laa, jika anda membacanya maka rasakanlah dengan dirimu bahwa Allah maha tinggi dengan sifat-sifat-Nya dan maha tinggi dengan zat-Nya. Oleh karenanya, jika seorang insan bersujud ia mengucapkan: Subhaana Rabbiyal a'laa [maha suci Allah Rabbku yang mahatinggi] ia mengingat betapa rendahnya dirinya. Karena ia saat itu turun (dengan sujud). Anggota badan manusia yang paling mulia dan paling tinggi adalah wajahnya, walau demikian ia menjadikannya di tanah yang diinjak dengan kaki-kaki. Di antara hikmah jika seorang insan mengatakan: Subhaana rabbiyal a'laa, yakni: Aku mensucikan Rabb ku yang berada di atas segala sesuatu, karena aku turun (merendahkan) pada tempat terendah. Maka anda bertasbuih kepada Allah yang Mahatinggi dengan sifat-sifat-Nya, dan Mahatinggi secara zat-Nya, Anda merasakan ketika anda mengatakan: Subhaana rabbiyal a'laa bahwa Rabb anda Ta'ala berada di atas segala sesuatu dan bahwa Dia memiliki sifat yang paling sempurna. (1) Dikeluarkanoleh Bukhari secara Ta'liq dalam kitab tauhid bab qaulillaah Ta'ala وَكَانَ اللَّهُ سَمِيعًا بَصِيرًا \" Dan Allah Maha Mendengar lagi Maha Melihat. \" (QS. An-Nisaa: 134)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 1: Surat ini dimulai dengan perintah Nabi ﷺ untuk mensucikan Rabbnya Yang Maha Tinggi dan Maha Agung dari sifat-sifat-Nya yang memiliki kekurangan dalam dzat, sifat, nama, perbuatan, hukum dan maksud Allah (dalam) memerintahkan orang-orang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh Ibnu ‘Utsaimin dalam Tafsir Juz ‘Amma berkata, “Khithab (arah pembicaraan) di sini untuk Rasulullah shallallahu 'alaihi wa sallam, dan khithab kepada Rasul shallallahu 'alaihi wa sallam dalam Al Qur’anul Karim terbagi menjadi tiga bagian: (1) Adanya dalil bahwa khithab itu khusus tertuju kepada Beliau, sehingga menjadi khusus untuk Beliau, (2) Adanya dalil bahwa khithab itu umum sehingga menjadi umum, (3) Tidak adanya dalil terhadap ini (khusus untuk Beliau) dan itu (khusus untuk umatnya), maka hal ini menjadi khusus lafaznya saja (kepada Rasulullah shallallahu 'alaihi wa sallam), namun secara hukumnya buat umat juga.” Syaikh As Sa’diy berkata, “Allah Subhaanahu wa Ta'aala memerintahkan bertasbih kepada-Nya yang di dalamnya mengandung dzikr dan beribadah kepada-Nya, tunduk kepada keagungan-Nya dan merendahkan diri kepada kebesaran-Nya, dan hendaknya tasbih itu yang sesuai dengan keagungan Allah Ta’ala, yaitu dengan disebut nama-nama-Nya yang indah lagi tinggi di atas semua nama, dengan maknanya yang indah dan agung. Demikian pula dengan disebut perbuatan-Nya yang di antaranya adalah Dia menciptakan semua makhluk lalu menyempurnakannya, yakni merapihkan dan memperbagus ciptaan-Nya.” Yakni sucikanlah Tuhanmu dari segala yang tidak layak bagi-Nya. Dr. Abdurrahman Al Khumais dalam Anwaarul Hilaalain fit Ta’aqqubaat ‘alal Jalaalain berkata, “Al A’laa adalah salah satu nama Allah yang di dalamnya menetapkan sifat ketinggian bagi Allah Ta’ala; yang maknanya adalah Yang Paling Tinggi di atas segala sesuatu. Ia adalah Af’al tafdhil (bentuk kata yang menunjukkan paling) yang menunjukkan ketinggian Allah Ta’ala dengan semua makna ketinggian. Oleh karena itu, Dia paling tinggi kedudukannya, paling tinggi berkuasa, paling tinggi zat-Nya di atas segala sesuatu. Disebutkan nama-Nya Al A’laa di sini adalah untuk menerangkan keberhakan-Nya disucikan, yakni disucikan dari semua kekurangan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 1",
    "description": "Wahai nabi, sucikanlah nama tuhanmu yang mahatinggi dari hal-hal yang tidak layak bagi kemuliaan-Nya. 2. Dialah tuhan yang menciptakan segala sesuatu dari tiada, lalu menyempurnakan penciptaan-Nya. Ciptaannya sepadan, teratur, padu, rapi, dan sempurna dari semua sisi."
  }
]