[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Orang yang sengsara yang tidak takut kepada tuhannya akan menjauhi dari nasihat, Yaitu orang yang akan masuk kedalam neraka jahanam yang besar yang akan dia rasakan panasnya, Kemudian dia tidak mati disana sehingga bisa beristirahat,tidak pula hidup dengan hidup yang bermanfa’at baginya. Sungguh telah beruntung bagi siapa yang telah membersihkan dirinya dari akhlak-akhlak buruk, Mengingat Allah lalu mentauhidkan Nya, berdoa kepada Nya dan melakukan apa yang diridhai tuhannya,dan mendirikan shalat pada waktunya, dalam rangka mencari ridha allah dan menjalankan syari’atNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Kemudian ia abadi di dalam Neraka, tidak pernah mati yang menjadikannya bisa beristirahat dari siksa yang menyengsarakannya, dan tidak pula ia bisa merasakan hidup yang baik dan mulia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Dan kengerian neraka ini ditegaskan dengan disebutkannya salah satu sifatnya, yaitu azabnya tidak akan terhenti dengan kematian, dan tidak akan ada yang dapat menyelamatkannya. Orang yang memasuki neraka akan tetap merasakan panasnya karena efek pembakarannya tidak menjadikannya mati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. ثُمَّ لَا يَمُوتُ فِيهَا (Kemudian dia tidak akan mati di dalamnya) Untuk beristirahat dari azab. وَلَا يَحْيَىٰ( dan tidak (pula) hidup) Yakni hidup yang bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Mereka, di dalam neraka itu, tidak mati dan tidak hidup dengan nyaman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia di sana tidak mati dan tidak hidup"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 9-13 “Oleh sebab itu berikanlah peringatan,” akan syariat dan tanda-tanda kebesaranNya. “Karena peringatan itu bermanfaat,” yakni selama peringatan diterima, dijadikan petuah dan didengar, baik apakah seluruh maksud dari peringatan tercapai atau sebagiannya saja. Kentekstual ayat, bila peringatan tidak membawa guna, misalnya hanya menambah keburukan atau bisa mengurangi kebaikan, maka peringatan tidak diperintahkan, bahkan terlarang. Dalam peringatan, manusia terbagi menjadi dua: Orang-orang yang memanfaatkan dan orang-orang yang tidak memanfaatkan. Orang-orang yang memanfaatkan peringatan disinggung oleh Allah  dalam firmanNya, “orang yang takut (kepada Allah) akan mendapatkan pelajran,” karena takut kepada Allah  Dan mengetahui balasan-balasan yang akan diberikan Allah  atas berbagai perbuatan akan menghentikan seseorang dari apa yang dibenci Allah  serta mendorongnya untuk melakukan kebaikan. Sedangkan mereka yang tidak memanfaatkan peringatan, Allah  menyinggung mereka dengan firmanNya, “Orang-orang yang celaka (kafir) akan menjauhinya. (Yaitu) orang yang akan memasuki api yang besar (neraka),” yaitu neraka yang dinyalakan yng mrerasuk hingga ke hati. “Kemudian dia tidak mati di dalamnya dan tidak juga hidup,” yakni disiksa dengan siksaan yang pedih tanpa jeda dan istiraha hingga mereka mengharapkan bisa mati, tapi harapan mereka tidak aka ada gunanya. Hal itu semakna dengan firman Allah , “Mereka tidak dibinasakan ssehiingga mereka mati dan tidak (pula) diringankan dari mereka azabnya.” (Fatir: 36)."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian dia didalam neraka jahannam itu tidak mati dan tidak pula hidup, dia didalamnya antara hidup dan mati, dia tidak hidup dengan tenang, dan tidak pula mati dengan tenang, begitulah keadaan penghuni neraka jahannam. { ثُمَّ لَا يَمُوتُ فِيهَا } Dia tidak mati didalam neraka itu dengan mati yang indah, { وَلَا يَحْيَىٰ } dan tidak dia hidup dengan keadaan yang menyenangkan, tetapi dia akan merasakan kehidupan yang penuh dengan kesengsaraan dan siksaan, dan kematian lebih baik dari itu, oleh karena itu dalam AL-Qur'an dituliskan bagaimana penghuni neraka berkata { وَنَادَوْا يَا مَالِكُ } wahai malaikat penjaga neraka { وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ } ( Mereka berseru: “Hai Malik biarlah Tuhanmu membunuh kami saja”) mereka meminta agar Allah mematikan mereka saja, mereka mengharapkan kematian akan hal itu tidak dapa mereka dapatkan, { قَالَ إِنَّكُمْ مَاكِثُونَ , لَقَدْ جِئْنَاكُمْ بِالْحَقِّ وَلَٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كَارِهُونَ } ( Dia menjawab: “Kamu akan tetap tinggal (di neraka ini)” , Sesungguhnya Kami benar-benar telah membawa kebenaran kepada kamu tetapi kebanyakan di antara kamu benci pada kebenaran itu ) [ Az Zukhruf : 77 - 78 ] , itulah akibat bagi siapa yang menolak kebenaran."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Dia menjawab: “Kamu akan tetap tinggal (di neraka ini)”. **** Ini adalah makna firman-Nya : لَا يَمُوتُ فِيهَا وَلَا يَحْيَى \" dia tidak mati di dalamnya dan tidak (pula) hidup.\" Karena sebagian oran mempersoalkan bagaimana bisa manusia tidak hidup juga tidak mati? Sedangkan manusia bisa jadi dia hidup dan bisa juga mati saja? Maka dijawab: Tidak mati di dalamnya dengan kematian yang mengistirahatkan, dan tidak juga hidup dengan kehidupan bahagia, tetapi ia di dalam siksa, neraka dan kesulitan, ia berangan-angan mati tapi itu tidak terjadi, itulah makna firman Allah Ta'ala: لَا يَمُوتُ فِيهَا وَلَا يَحْيَى \" dia tidak mati di dalamnya dan tidak (pula) hidup.\" (1) dikeluarkan Bukhari (3265) dan Muslim (2843) dari hadits Abu Hurairah radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 13: 12-13. Kemudian Allah menjelaskan orang-orang yang menjadi keras kepala yaitu ia akan masuk ke dalam neraka jahannam yang disiksa dengan panas dan adzabnya. Dan orang yang kafir ini tidak akan mati di dalam neraka dan tidak pula ada istirahat dari kerasnya adzab dan pedihnya, ia tidak juga hidup dengan kehidupan yang baik di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga dapat beristirahat. Sampai-sampai mereka berharap agar dimatikan saja, namun harapan mereka tidak diberikan. Dengan nikmat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 13",
    "description": "Selanjutnya, dia yang celaka dan kafir itu di neraka sana tidak akan mati, tidak memperoleh kesempatan sejenak pun untuk lepas dari siksa, dan tidak pula hidup dengan nyaman. Telah menjadi ketentuan Allah bahwa semua penghuni surga dan neraka tidak akan mati selamanya. 14. Sungguh beruntung orang yang menyucikan diri dengan beriman kepada Allah secara hakiki, membersihkan diri dari dosa, ."
  }
]