[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Orang yang sengsara yang tidak takut kepada tuhannya akan menjauhi dari nasihat, Yaitu orang yang akan masuk kedalam neraka jahanam yang besar yang akan dia rasakan panasnya, Kemudian dia tidak mati disana sehingga bisa beristirahat,tidak pula hidup dengan hidup yang bermanfa’at baginya. Sungguh telah beruntung bagi siapa yang telah membersihkan dirinya dari akhlak-akhlak buruk, Mengingat Allah lalu mentauhidkan Nya, berdoa kepada Nya dan melakukan apa yang diridhai tuhannya,dan mendirikan shalat pada waktunya, dalam rangka mencari ridha allah dan menjalankan syari’atNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Sungguh beruntunglah orang-orang yang telah membersihkan diri dari kesyirikan dan kemaksiatan dengan mendapatkan apa yang diinginkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Adapun orang yang mendapat manfaat dari peringatan dan menyucikan dirinya lahir dan batin, maka dia akan meraih apa yang dia inginkan; karena telah menyucikan diri, mengambil manfaat dari apa yang Allah turunkan kepada Rasul-Nya, dan mengerahkan segenap kemampuan untuk menyucikan dirinya. Dan jiwa yang suci dan bersih akan mendapat petunjuk, sehingga akan mendatangi apa yang bermanfaat baginya dan berzikir menyebut nama Tuhannya. Zikir ini meliputi zikir dengan lisan untuk mengagungkan Allah, dan zikir dalam hati. Dan mendekatkan diri kepada Allah dapat dilakukan dengan shalat yang merupakan bentuk ketundukan ketaatan dan pujian bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. قَدْ أَفْلَحَ مَن تَزَكَّىٰ (Sesungguhnya beruntunglah orang yang membersihkan diri) Yakni yang membersihkan diri dari kemusyrikan, lalu beriman kepada Allah dan mengesakan-Nya serta mengamalkan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Sungguh benar-benar beruntung orang-orang yang senantiasa mensucikan hatinya dari kekufuran dan maksiat. Sehingga mereka hanya beriman kepada Allah dan menjalankan perintah-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh beruntung} keberuntungan yang diinginkan {orang yang menyucikan diri membersihkan diri dari kemusyrikan dan kemaksiatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 14-15 “sungguh beruntunglah orang yang membersihkan diri (dengan beriman),” yakni menang dan beruntunglah orang yang membersihkan diri dari kesyirikan, kezholiman, dan akhlak-akhlak tercela. “dan dia ingat nama Rabbnya, lalu dia shalat,” yakni orang yang memiliki sifat selalu ingat kepada Allah  dan hatinya terpatri dengan dzikir sehingga hal itu mengharuskannya mengerjakan sesuatu yang diridhoi Allah  khususnya shalat yang merupakan neraca keimanan. Inilah makna ayat di atas. Sedangkan yang menafsirkan Firman Allah , “orang yang membersihkan diri,” dengan arti mengeluarkan zakat fitrah dan “dia ingat nama Rabbnya, lalu dia shalat,” sholat ‘Id, meski penafsiran tersebut termasuk dalam kata-kata shalat dan sebagian dari cabangnya, tapi maknanya bukan hanya sesempit itu saja."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ قَدْ أَفْلَحَ } Sungguh telah beruntunglah dan telah selamatlah, { مَنْ تَزَكَّىٰ } bagi siapa yang telah memberihkan jiwanya, mereka yang telah membersihkan jiwanya dari dosa, kekafiran dan kesyirikan, serta kemaksiatan, mereka membersihkan diri dengan iman dan ketaatan kepada Allah ﷻ , dan mengikuti sunnah Rasulullah ﷺ . Selain pembersihan diri, ada juga yang disebut dengan pembersihan harta, yaitu dengan menunaikan kewajiban berzakat, disebut zakat karena kewajiban itu sebagai pembersihan harta dari hal-hal yang menghalanginya dari berkah, sedangkan membersihkan diri dari kemaksiatan dilakukan dengan ketaatan dan keimanan kepada Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "قَدْ أَفْلَحَ مَنْ تَزَكَّى (14) وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى \" Sesungguhnya beruntunglah orang yang membersihkan diri (dengan beriman), dan dia ingat nama Tuhannya, lalu dia sembahyang.\" [Aflaha] diambil dari kata al-falaah yang berarti, sedangkan al-falah (keberuntungan) adalah kata yang mencakup yaitu (mencakup): berhasil memperoleh yang dicari dan selamat dari yang ditakuti, inilah makna keberuntungan. Sebuah kata yang merangkum semua kebaikan dan mencegah dari segala keburukan. Firman-Nya: مَنْ تَزَكَّى \"\" di ambil dari kata at-Tazkiyah (pensucian) yang artinya pensucian, dari situlah zakat disebut zakat, karena zakat dapat mensucikan manusia dari akhlah yang buruk, akhlak pelit sebagaimana Allah Ta'ala berfirman: خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِمْ بِهَا \" Ambillah zakat dari sebagian harta mereka, dengan zakat itu kamu membersihkan dan mensucikan mereka, \"(QS. At-Taubah: 103) dengan demikian maka تَزَكَّى berarti suci, baik lahiriyahnya mau pun batiniyahnya, pertama tama ia mensucikan diri dari kesyirikan ketika berinteraksi dengan Allah, ia beribadah kepada Allah dengan memurnikan agama untuk-Nya, tidak riya, tidak ingin didengar, dan tidak mencari jabatan dan tahta pada ibadah yang ia lakukan kepada Allah 'Azza Wa Jalla, ia hanya mengharap wajah Allah dan negeri akhirat. Mensucikan diri dengan mengikuti Rasul shallallaahu 'alaihi wa sallam, di mana ia tidak mebuat perkara bid'ah dalam syari'atnya baik sedikit atau pun banyak, tidak dalam perkara aqidah tidak dalam ucapan-ucapan dan tidak juga dalam perbuatan-perbuatan, yang saya maksudkan di sini adalah pensucian untuk Rasul 'alaihissholaatu wassalaam, yaitu dengan cara mengikuti tanpa membuat-buat bid'ah, tidak mungkin terwujud dengan sempurna kecuali dengan jalannya salaf, jalannya ahlussunnah wal jama'ah, yang beriman kepada setiap sifat yang Allah tetapkan untuk diri-Nya dalam kitab-Nya juga ditetaokan oleh lisan Rasul-Nya shallallaahu 'alaihi wa sallam, di atas jalan orang-orang salaf (terdahulu yang saleh) yang tidak membuat kebid'ahan sedikit pun dalam ibadah yang bersifat ucapan juga tidak dalam ibadah-ibadah yang berupa perbuatan dalam agama Allah, anda akan dapati mereka mengikuti yang datang dari syari'at, berbeda dengan yang diperbuat oleh sebagian ahli bid'ah berupa zikir-zikir bid'ah, baik itu berupa bentuknya atau pun tata cara dan prakateknya, sebagaimana yang dilakukan oleh sebagian orang dari kalangan tarekat-tarekat sufiyah dan yang lainnya. Ia juga mensucikan dirinya ketika berinteraksi dengan orang-orang, di mana ia akan mensucikan dari iri dan dengki kepada saudara-saudaranya kaum muslimin, anda akan mendapatinya senantiasa berhati bersih, ia mencintai untuk saudaranya apa-apa yang ia cintai untuk dirinya, ia tidak rela orang lain tertimpa keburukan, ia suka jika semua orang terselamatkan dari segala keburukan, dan diberikan taufik untuk segala kebaikan. Maka مَنْ تَزَكَّى maknanya adalah siapa saja yang memebersihkan diri baik lahir dan batinnya, ia mensucikan batinnya dair kesyirikan kepada Allah 'azza Wa Jalla dan dari keraguan, kemunafikan, permusuhan dan kebencian kepada kaum muslimin dan hal lainnya berupa perkara yang hati harus bersih darinya. Dia juga mensucikan lahirnya dari membiarkan mulut dan anggota badannya melampaui batas kepada hamba-hamba Allah 'Azza Wa Jalla, ia tidak mengghibah siapa pun, tidak mengadu domba siapa pun, tidak mencaci siapa pun, tidak menyakiti siapa pun dengan pukulan atau mengambil harta atau hal lainnya, maka tazakki (pensucian diri) adalah sebuah kalimat yang umum mencakup membersihka diri dari noda baik lahir mau pun batin. Sehingga tazkiyah (pensucian diri) terkait dengan tiga hak: Pertama: Yang terkait dengan hak Allah. Kedua: Yang terkait dengan Hak Rasul Ketiga: Yang terkait dengan hak manusia. Yang terkait dengan hak Allah Ta'ala: pensucian dari kesyirikan, sehingga ia beribadah kepada Allah Ta'ala dengan mengikhlaskan agama untuk-Nya. Yang terkait dengan Rasul: Pensucian diri dari berbuat bid'ah, dengan beribadah sesuai dengan tuntunan syari'at Nabi Shallallaahu 'alaihi wa Sallam, baik dalam perkara aqidah, perkataan mau pun perbuatan. Yang terkait dengan interaksi dengan manusia: Mensucikan dari rasa iri, dengki, permusuhan dan kebencian, dan segala yang dapat mengundang permusuhan dan kebencian antara kaum muslimin dijauhinya, dan melakuakan perkara yang mangundang rasa cinta dan suka, di antara bentuknya adalah menebarkan salam yang Rasul 'alaihissholaatu wassalaam bersabda tentangnya: لاَ تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلاَ تُؤْمِنُوا حَتَّى تَحَابُّوا. أَفَلاَ أَدُلُّكُمْ عَلَى شَىْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلاَمَ بَيْنَكُمْ \"Kalian tidak akan masuk surge hingga kalian beriman, dan kalian tidak akan beriman (secara sempurna) hingga kalian saling mencintai, tidakkah kalian ingin jika ku beritahukan tentang suatu perkara jika kalian melakukannya kalian akan saling mencintai, sebarkanlah salam di antara kalian\"(1) mengucapkan salam adalah di antara sebab terkuat yang dapat mengundang rasa cinta di tengah kaum muslimin. Ini ada sesuatu yang dapat disaksikan, andai ada seorang yang lewat di hadapan anadaa dan tidak mengucapkan salam maka anda akan mendapati hati anda ada sesuatu, dan jika anda tidak mengucapkan salam kepadanya maka akan timbul sesuatu dalam dirinya, tetapi jika anda mengucapkan salam kepadanya atau dia mengucapkan salam kepadamu maka ini akan menajadi seperti tali yang mengkat antara kalian berdua yang mengundang rasa cinta. Nabi 'alaissholaatu wassalaam bersabda tentas salam: تَقْرَأُ السَّلَامَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَا تَعْرِفْ \"Anda ucapkan salam kepada orang yang anda kenal dan orang yang tidak anda kenal\" (2) Sedangkan kebanyakan orang hari ini apa bila ia mengucapkan salam, ia hanya mengucapkannya kepada yang ia kenal saja, tetapi orang yang tidak ia kenal, ia tidak mengucapkannya, ini adalah kesalahan, karena jika anda mengucapkan salam hanya kepada orang yang anda kenal maka salam anda belum ikhlas karena Allah, ucapkanlah salam kepada yang anda kenal dan orang yang tidak anda kenal dari kaum muslimin, sehingga anda memperoleh kecintaan kaum muslimin satu dengan yang lainnya, dan kesempurnaan juga diakhiri dengan masuk ke dalam surge, semoga Allah menjadikan kita termasuk penduduknya. (1) Dikeluarkan Muslim (54) dari hadits Abu Hurairah radhiyallaahu 'anhu. (2) Dikeluarkan oleh Bukhari (6236) dan Muslim (39) dari hadits Abdullah Bin Amer radhiyallaahu 'anhumaa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 14: 14-15. Allah kabarkan sesungguhnya telah menang dan berhasil (lolos) dari neraka karena sebab bersihnya dirinya dengan keimanan dan kebaikan amalannya, dan kosong dari syirik begitu juga maksiat. Ia hadirkan dalama hatinya nama dan sifat Rabbnya serta apa yang terkandung dari keagungan dan kesempurnaan-Nya. Allah diingat kemuliaan-Nya dalam ketinggian-Nya. Kemudian (seorang hamba tersebut) menegakkan shalat yang diwajibkan di waktunya dengan khusyuk dan penuh ketundukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari syirk, kezaliman dan akhlak yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 14",
    "description": "Sungguh beruntung orang yang menyucikan diri dengan beriman kepada Allah secara hakiki, membersihkan diri dari dosa, 15. Dan mengingat nama tuhannya setiap waktu, baik lapang maupun sempit, lalu dia menunaikan salat dengan khusyuk dan sempurna sebagai tanda penghambaanya kepada Allah."
  }
]