[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Orang yang sengsara yang tidak takut kepada tuhannya akan menjauhi dari nasihat, Yaitu orang yang akan masuk kedalam neraka jahanam yang besar yang akan dia rasakan panasnya, Kemudian dia tidak mati disana sehingga bisa beristirahat,tidak pula hidup dengan hidup yang bermanfa’at baginya. Sungguh telah beruntung bagi siapa yang telah membersihkan dirinya dari akhlak-akhlak buruk, Mengingat Allah lalu mentauhidkan Nya, berdoa kepada Nya dan melakukan apa yang diridhai tuhannya,dan mendirikan shalat pada waktunya, dalam rangka mencari ridha allah dan menjalankan syari’atNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Dan mengingat Rabbnya sesuai cara yang disyariatkan-Nya dengan berbagai zikir dan mendirikan salat dengan tata cara yang seharusnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَذَكَرَ اسْمَ رَبِّهِۦ (dan dia ingat nama Tuhannya) Terdapat pendapat mengatakan: yakni dengan menyebut nama Tuhannya dengan lisannya. فَصَلَّى (lalu dia sembahyang) Yakni kemudian dia mendirikan shalat lima waktu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Mereka selalu mengingat nama Tuhannya dengan lisannya. Mereka menghayati sifat Tuhannya dengan hati. Dan melaksanakan shalat lima waktu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan mengingat nama Tuhannya, lalu shalat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 14-15 “sungguh beruntunglah orang yang membersihkan diri (dengan beriman),” yakni menang dan beruntunglah orang yang membersihkan diri dari kesyirikan, kezholiman, dan akhlak-akhlak tercela. “dan dia ingat nama Rabbnya, lalu dia shalat,” yakni orang yang memiliki sifat selalu ingat kepada Allah  dan hatinya terpatri dengan dzikir sehingga hal itu mengharuskannya mengerjakan sesuatu yang diridhoi Allah  khususnya shalat yang merupakan neraca keimanan. Inilah makna ayat di atas. Sedangkan yang menafsirkan Firman Allah , “orang yang membersihkan diri,” dengan arti mengeluarkan zakat fitrah dan “dia ingat nama Rabbnya, lalu dia shalat,” sholat ‘Id, meski penafsiran tersebut termasuk dalam kata-kata shalat dan sebagian dari cabangnya, tapi maknanya bukan hanya sesempit itu saja."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَذَكَرَ اسْمَ رَبِّهِ } Dan dia memperbanyak menyingat dan menyebut nama tuhannya, yaitu dengan memperbanyak tasbih, tahlil, takbir, dan tilawah Al-Qur'an, dan ini adalah ibadah lisan { فَصَلَّىٰ } Kemudian dia mendrikan shalat, yaitu ibadah yang dilakukan oleh anggota badan, kenapa Allah ﷻ menempatkan shalat dengan dzikir, karena shalat adalah merupakan pintu segala kebaikan, dan shalah adalah tiang utama dalam islam, dan amalan yang paling pertama yang akan dihisab pada hari kiamat adala shalat. { فَصَلَّىٰ } Mereka mendirikan shalat, baik shalat wajib maupun shalat sunnah, orang-orang yang mengerjakan amalan inilah yang akan meraih kemenangan dan keselmatan di hari kiamat, bahkan didunia pun mereka selalu dalam kebaikan dan kemenangan, hati-hati mereka selalu lapang, bahagia, tenang, selalu ridho dengan ketentuan yang Allah ﷻ tetapkan, walaupun dalam kehidupan ini mereka tidak memiliki harta yang berlimpah, akan tetapi kebahagiaan selalu terpancar dari diri mereka, mereka senantiasa merasakan kebahagiaan di hati mereka, kalian akan mendapati mereka sebagai manusia yang paling bahagaia hanya karena senantiasa mengingat Allah ﷻ dan beribadah kepada-Nya, dan kalian akan mendapati para penggemar kekayaan berada dalam kesengsaraan yang dalam didunia, Allah ﷻ berfirman : { وَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ أَنْ يُعَذِّبَهُمْ بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنْفُسُهُمْ وَهُمْ كَافِرُونَ } ( Dan janganlah harta benda dan anak-anak mereka menarik hatimu. Sesungguhnya Allah menghendaki akan mengazab mereka di dunia dengan harta dan anak-anak itu dan agar melayang nyawa mereka, dalam keadaan kafir. ) [ At Taubah : 86 ] , orang-orang mukmin didunia ini selalu berada dalam kebaikan dan ketentraman, dada mereka terus berada dalam kelapangan mereka ridho kepada Allah ﷻ . Itulah kebahagiaan yang hakiki, hanya dengan mengingat Allah ﷻ kebahagiaan itu bisa diraih walaupun harta dunia hanya setetes yang dirasakan, karena ketaatan kepada Allah ﷻ hanya memberikan kebaikan kepada siapa yang melakukannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firmannya: وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى \" dan dia ingat nama Tuhannya, lalu dia sembahyang.\" Maknanya: Berdzikir kepada Allah, tetapi di sini disebutkan nama Allah subhaanahu wa ta'ala agar dzikir ini dipraktekan dengan lisan, karena dia di dalam dzikirnya akan mengucapkan nama Allah, misalnya mengatakan subhaanallaah, ALhamdu lillaah, Allahu akbar, maka ia menyebut nama Allah , maknanya juga adalah berzikir kepada Allah dengan beribadah kepada-Nya. Dan termasuk zikir kepada Allah adalah berwudhu, berwudhu termasuk zikir kepada Allah, Pertama-tama: karena tidaklah seoran insan yang berwudhu melainkan karena mematuhi perintah Allah. Kedua: karena jika ia memulai wudhunya ia berkata bismillaah, dan ketika selesai dia mengucapkan Asyhadu Allaa ilaaha illallaaahu wa ashyhadu anna muhaammadan abduhu wa rasuuluh, Allaahummaj'alnii minattawaabiina waj'alnii minal mutathihhiriin \"Aku bersaksi bahwa tiada sesembahan yang benar selain Allah dan aku bersaksi bahwa Muhammad hamba dan utusan-Nya ya Allah jadikanlah aku termasuk orang-orang yang betaubat dan jadikanlah aku temasuk orang-orang yang bersuci\" Dan di antara zikir kepada Allah 'Azza Wa Jalla adalah khutbah jum'at, khutbah jumat termasuk zikir kepada Allah, sebagaimana firman Allah Ta'ala: يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ \" Hai orang-orang yang beriman, apabila diseru untuk menunaikan sembahyang pada hari Jumat, maka bersegeralah kamu kepada mengingat Allah dan tinggalkanlah jual beli.\" (QS. Al-Juma'ah: 9) Atas dasar ini, sebagian ulama mengatakan: وَذَكَرَ اسْمَ رَبِّهِ \" dan dia ingat nama Tuhannya, lalu dia sembahyang.\" Maksudnya adalah khatib yang berkhutbah pada hari jum'at فَصَلَّى \"kemudian shalat\" maknanya: shalat jum'at. Ayat ini mencakup semua sholat yang didahului dengan zikir, dan tidak ada shalat kecuali ia didahului zikir, karena seorang insan yang berwudhu sebelum shalat , maka ia akan berzikir kepada Allah kemudian ia shalat. Tatapi yang shahih adalah: Bahwa ayat ini lebih umum dari itu, dan maksudnya adalah semua penyebutan nama Allah azza wa Jalla, kaitu setiap kali seorang insan menyebut nama Allah ia kembali mengingat dan menghadap kepada Allah dan melaksanakan shalat, sedangkan sholat sudah diketahu bahwa ia adalah sebuah ibadah yang mengandung perkataan-perkataan dan perbuatan-perbuatan yang dimulai dengan takbir dan diakhiri dengan salam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 15: 14-15. Allah kabarkan sesungguhnya telah menang dan berhasil (lolos) dari neraka karena sebab bersihnya dirinya dengan keimanan dan kebaikan amalannya, dan kosong dari syirik begitu juga maksiat. Ia hadirkan dalama hatinya nama dan sifat Rabbnya serta apa yang terkandung dari keagungan dan kesempurnaan-Nya. Allah diingat kemuliaan-Nya dalam ketinggian-Nya. Kemudian (seorang hamba tersebut) menegakkan shalat yang diwajibkan di waktunya dengan khusyuk dan penuh ketundukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 15",
    "description": "Dan mengingat nama tuhannya setiap waktu, baik lapang maupun sempit, lalu dia menunaikan salat dengan khusyuk dan sempurna sebagai tanda penghambaanya kepada Allah. 16. Sedangkan kamu, wahai kebanyakan manusia, lebih memilih kehidupan dunia daripada kehidupan akhirat. Kalian melalaikan hal-hal yang menjamin kebahagiaanmu di akhirat dan terlena dengan gemerlap dunia."
  }
]