[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kalian (wahai manusia), mementingkan perhiasan dunia atas kenikmatan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Akan tetapi kalian justru mengedepankan kehidupan dunia atas kehidupan Akhirat padahal perbedaan di antara keduanya sangat besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Akan tetapi orang-orang kafir tidak mempedulikan kemenangan itu; namun lebih menginginkan kehidupan dunia. Mereka jauh sekali dari usaha untuk meraih kemenangan, dan tidak menghiraukan kehidupan akhirat yang kekal. Jika disebutkan kehidupan akhirat kepada mereka maka mereka akan berpaling darinya, sungguh mereka telah berpaling dari hal yang lebih baik dan lebih kekal."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "16-17 1). Malik bin dinar berkata : Jika seandainya dunia ini diibaratkan seperti emas yang punah, sedangkan akhirat hanya seperti keramik yang tersisa, maka hakikatnya manusia lebih memilih keramik yang tersisa itu, lalu bagaimana jika seandainya akhirat diibaratkan seperti emas yang tersisa, sedangkan dunia seperti keramik yang musnah ?! 2) . Orang bahagia adalah ketika Allah menjadikannya mencintai akhirat bahkan dia akan mengatakan : tidak ada sesuatupun yang lebih baik darinya, maka tatkala ia mengurangi kecintaannya terhadap dunia dan kekayaan yang ada didalamnya dengan mengharap lebih besar di akhirat nanti, Allah tidak akan menghilangkan baginya porsi didunia, dan tidak pula Dia mengurangi kebahagiaannya didalamnya, adapun orang sengsara adalah ketika syaithon menjadikannya cinta kepada dunia dan dia akan mengatakan : tidak sesuatupun lebih baik dari dunia ini, maka Allah pun menjadikannya tenggelam dalam kegelapan nikmat dunia yang ia pilih, dan akhirnya dia akan menemukan hidupnya setelahnya akan lebih sengsara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Wahai manusia, namun nyatanya kalian lebih memilih kenikmatan dunia yang hanya sementara dan fana, daripada kehidupan akhirat yang lebih kekal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tetapi kalian mengutamakan} kalian mengutamakan {kehidupan dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 16-17 “Tetapi kamu (0rang-orang) kafir memilih kehidupan duniawi,” artinya, kalian lebih mengedepankan dunia daripada kehidupan akhirat dan kalian lebih memilih nikmatnya yang lusuh dan kotor serta fana melebihi akhirat. “Sedang kehidupan akhirat adalah lebih baik,” lebih baik dari dunia dalam segala sifat yang diinginkan, “dan lebih kekal,” karena akhirat adalah negri ke abadian, kekekalan, dan kesucian, sedangkan dunia adalah negri yang fana. Orang Mukmin yang berakal tidak akan memilh sesuatu yang lebih jelek dari sesuatu yang lebih baik dan tidak menukar kenikmatan sesaat dengan kenikmatan abadi. Karen itu, cinta terhadap dunia dan lebih dikedepankan melebihi akhirat merupakan induk segala kesalahan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ بَلْ تُؤْثِرُونَ } Akan tetapi kamu ( orang kafir ) memilih { الْحَيَاةَ الدُّنْيَا } kemewahan dan kekuasaan dunia, diantara manusia ada yang hanya mementingkan dunia, mereka tidak pernah mengingat akhirat dan peristiwa besar yang kan terjadi didalamnya, dunia telah meutupi hati mereka dengan kekayaan dan kemaksiatan, dia hanya sibuk dengan kepentingan dunia yang akan musnah ini, atau harta itu akan musnah dan tinggallah mereka sebagai orang miskin melarat, begitulah keadaan mereka didunia. { بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا } Kalian ( wahai orang kafir ) hanya mengutamakan urusan duni, dan menjauh dari ancaman yang akan kalian hadapi di akhirat, kalian sibuk bekerja untuk dunia dan merendahkan pentingnya kehidupan akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah ta'ala berfirman: بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا (16) وَالْآخِرَةُ خَيْرٌ وَأَبْقَى \" Tetapi kamu (orang-orang kafir) memilih kehidupan duniawi. Sedang kehidupan akhirat adalah lebih baik dan lebih kekal.\" Bal dalam aya ini untuk mengungkapkan pindahan pembahasan karena bal bisa datang untuk mengungkapkan pengingkaran dan bisa juga datang untuk mengungkapkan pindahan pembahasan. Maknanya: Bahwa Allah subhaanahu wa Ta'ala berpindah (tema) untuk menjelaskan kondisi manusia bahwa ia lebih mengutamakan kehidupan dunia, karena ia bersifat segera (tersedia) sedangkan manusia itu sendiri tercipta dari 'ajal (ketergesaan) yang berkonsekuansi tergesa-gesa, maka anda akan mendapatinya lebih mengutamakan kehidupan dunia, sedangkan pada hakikatnya dunia ini sifatnya dekat, baik secara waktu dan sifatnya. Maksud kondisi atau sifat dunia ini dekat secara waktu, itu dikarenakan dunia mendahului akhirat, ia lebih dahulu daripada akhirat, maknanya dekat. Sedangkan jika ditinjau dari sifat dunia ini dekatlagi kurang maka itulah memang kenyataannya karena dunia ini walau pun usia seseorang itu panjang, maka ujung dan akhirnya adalah kefanaan, walau pun kehidupannya seorang insan megah makapasti kesudahannya adalah kebinasaan, oleh karenanya tidak ada hari yang anda lewati dalam kesenangan melainkan akan diakhiri dengan kesedihan. Ada pujangga arab yang bersenandung tentang hal ini. فـَـــيَوْمٌ عَلَيـــناَ وَيَــوْمٌ لَـــنَا وَيـــوْمٌ نُـــسَاءُ وَيَومٌ نُسَرُّ Suatu hari kita ditimpa kesulitan di hari lain kita mendapatkan keberuntungan… Suatu hari kita sengsara di hari lainnya kita berbahagia… Perhatikanlah kondisi anda di dunia, anda dapati tidak ada waktu yang selalu nampak cerah, pasti ada keruhnya, dan tidak selalu riang gembira , pasti ada kesedihannya, tidak selalu santai pasti ada lelahnya, dunia ini sesuai dengan namanya dunia (sangat dekat)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 16: 16-17. Bersamaan dengan itu, Allah menjelaskan yang tidaklah mereka menjadi (hamba) yang berhasil kecuali mereka jadikan (keimanannya) memberikan dampak dari kelezatan-kelezatan fana yang berlalu begitu saja dengan cepat di dunia, dibandingkan dengan akhirat yang akan datang dan abadi; Mereka menjadikan apa yang menjadikannya berhasil dengan (meninggikan) keadaan hari akhirat yang mereka tidak banyak berpikir (ragu-ragu) yaitu dengan (balasan) mendapatkan surga yang lebih utama dibandingkan dunia"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang kenikmatannya sementara dan tidak sempurna. Dengan demikian, cinta dunia merupakan sumber setiap keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 16",
    "description": "Sedangkan kamu, wahai kebanyakan manusia, lebih memilih kehidupan dunia daripada kehidupan akhirat. Kalian melalaikan hal-hal yang menjamin kebahagiaanmu di akhirat dan terlena dengan gemerlap dunia. 17. Kamu lalai dari kehidupan akhirat, padahal kehidupan akhirat itu lebih baik dan lebih kekal. Kebahagiaan ukhrawi lebih murni dan tak berbatas, sedangkan kebahagiaan duniawi bersifat melenakan dan akan segera sirna."
  }
]