[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alam akhirat dengan segala kenikmatan abadi yang ada padanya adalah lebih baik dan lebih kekal daripada dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sungguh Akhirat itu lebih baik dan lebih utama dari dunia dengan berbagai kesenangan dan kenikmatan yang ada padanya serta lebih abadi, karena kenikmatan yang ada di dalamnya tidak pernah berhenti selamanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "16-17 1). Malik bin dinar berkata : Jika seandainya dunia ini diibaratkan seperti emas yang punah, sedangkan akhirat hanya seperti keramik yang tersisa, maka hakikatnya manusia lebih memilih keramik yang tersisa itu, lalu bagaimana jika seandainya akhirat diibaratkan seperti emas yang tersisa, sedangkan dunia seperti keramik yang musnah ?! 2) . Orang bahagia adalah ketika Allah menjadikannya mencintai akhirat bahkan dia akan mengatakan : tidak ada sesuatupun yang lebih baik darinya, maka tatkala ia mengurangi kecintaannya terhadap dunia dan kekayaan yang ada didalamnya dengan mengharap lebih besar di akhirat nanti, Allah tidak akan menghilangkan baginya porsi didunia, dan tidak pula Dia mengurangi kebahagiaannya didalamnya, adapun orang sengsara adalah ketika syaithon menjadikannya cinta kepada dunia dan dia akan mengatakan : tidak sesuatupun lebih baik dari dunia ini, maka Allah pun menjadikannya tenggelam dalam kegelapan nikmat dunia yang ia pilih, dan akhirnya dia akan menemukan hidupnya setelahnya akan lebih sengsara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Balasan akhirat adalah lebih baik dari pada dunia seisinya. Di akhirat ada surga yang lebih kekal dan lebih mulia daripada dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Padahal kehidupan akhirat itu lebih baik dan lebih kekal} dan lebih kekal daripada dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 16-17 “Tetapi kamu (0rang-orang) kafir memilih kehidupan duniawi,” artinya, kalian lebih mengedepankan dunia daripada kehidupan akhirat dan kalian lebih memilih nikmatnya yang lusuh dan kotor serta fana melebihi akhirat. “Sedang kehidupan akhirat adalah lebih baik,” lebih baik dari dunia dalam segala sifat yang diinginkan, “dan lebih kekal,” karena akhirat adalah negri ke abadian, kekekalan, dan kesucian, sedangkan dunia adalah negri yang fana. Orang Mukmin yang berakal tidak akan memilh sesuatu yang lebih jelek dari sesuatu yang lebih baik dan tidak menukar kenikmatan sesaat dengan kenikmatan abadi. Karen itu, cinta terhadap dunia dan lebih dikedepankan melebihi akhirat merupakan induk segala kesalahan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالْآخِرَةُ خَيْرٌ } Dan kehidupan akhirat itu jauh lebih baik daripada kehidupan dunia, { وَأَبْقَىٰ } dan kehidupan diakhirat adalah kekal selamanya, sedangkan didunia hanyalah sebatas kenikmatan sementara dan pasti akan musnah. Kehidupan dunia walaupun didalamnya penuh dengan kenikmatan dan kebaikan, akan tetapi semuanya akan hancur dan sirna, bahkan kebaikan yang ada terkadang hanyalah sebatas bayangan dan pada hakikatnya adalah kesengsaraan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالْآخِرَةُ خَيْرٌ وَأَبْقَى \" Sedang kehidupan akhirat adalah lebih baik dan lebih kekal.\" Sedangkan akhirat lebih baik dari dunia dan lebih kekal, leboh baik dengan apa-apa yang ada di dalamnya berupa kenikamatan dan kebahagiaan yang terus-menerus yang tidak diselingi dengan keletihan لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُمْ مِنْهَا بِمُخْرَجِينَ \" Mereka tidak merasa lelah di dalamnya dan mereka sekali-kali tidak akan dikeluarkan daripadanya.\"(QS. Al-Hijr: 48) akhirat juga lebih kekal dari dunia, karena ketetapan dunia ini sebagaimana sesaat tadi kita bicarakan, sedikit, akan pergi dan sirna, berbeda dengan ketetapan akhirat, maka sungguh negeri akhirat akan kekal abadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 17: 16-17. Bersamaan dengan itu, Allah menjelaskan yang tidaklah mereka menjadi (hamba) yang berhasil kecuali mereka jadikan (keimanannya) memberikan dampak dari kelezatan-kelezatan fana yang berlalu begitu saja dengan cepat di dunia, dibandingkan dengan akhirat yang akan datang dan abadi; Mereka menjadikan apa yang menjadikannya berhasil dengan (meninggikan) keadaan hari akhirat yang mereka tidak banyak berpikir (ragu-ragu) yaitu dengan (balasan) mendapatkan surga yang lebih utama dibandingkan dunia"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 17",
    "description": "Kamu lalai dari kehidupan akhirat, padahal kehidupan akhirat itu lebih baik dan lebih kekal. Kebahagiaan ukhrawi lebih murni dan tak berbatas, sedangkan kebahagiaan duniawi bersifat melenakan dan akan segera sirna. 18-19. Dasar-dasar ajaran agama samawi adalah sama, yaitu mereka yang beriman, beramal saleh, ingat kepada Allah, membersihkan diri dari dosa, dan memilih kehidupan akhirat akan berbahagia. Sebaliknya, mereka yang memilih jalan kekafiran dan hidup berlumur dosa akan celaka. Sesungguhnya ini terdapat dalam kitab-kitab yang dahulu, yang diturunkan sebelum Al-Qur'an, yaitu kitab-kitab ibrahim dan musa. Kedua nabi ini sangat disegani oleh para pengikut agama samawi. Nabi ibrahim menerima sepuluh suhuf, sedangkan nabi musa menerima taurat."
  }
]