[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Sesungguhnya apa yang dikabarkan kepada kalian dalam surat ini termasuk apa yang maknanya terpatri pada shuhuf shuhuf yang diturunkan sebelum al-qur’an, Yaitu shuhuf Ibrahim dan Musa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Sesungguhnya apa yang Kami sebutkan kepada kalian berupa perintah-perintah dan berita-berita ini termaktub dalam kitab-kitab yang telah Kami turunkan sebelummu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-19. Penjelasan tentang kemenangan bagi orang yang menyucikan diri itu, orang-orang kafir yang lebih memilih kehidupan dunia, serta kebaikan dan kekekalan itu ada di akhirat; merupakan peringatan-peringatan jelas yang tercantum dalam kitab-kitab sebelum al-Qur’an; yaitu kitab-kitab yang diturunkan kepada Nabi Ibrahim dan Nabi Musa, karena hal ini merupakan kebenaran yang sama-sama berasal dari Allah Yang telah menciptakan dan menyempurnakan penciptaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. إِنَّ هٰذَا (Sesungguhnya ini) Yakni kemenangan yang didapatkan oleh orang yang membersihkan dirinya dan seterusnya sebagaimana yang telah disebutkan. لَفِى الصُّحُفِ الْأُولَى (benar-benar terdapat dalam kitab-kitab yang dahulu) Yakni tercantum di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Ini semua adalah keberuntungan bagi orang-orang yang senantiasa mensucikan hatinya dan senantiasa sholat. Bagi mereka kehidupan akhirat lebih baik daripada dunia seisinya. Keterangan ini juga terdapat dalam kitab-kitab yang turun sebelum Al-quran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya ini terdapat dalam lembaran-lembaran yang terdahulu} kitab-kitab terdahulu yang diturunkan sebelum Al-Qur'an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 18-19 “Sesungguhnya ini,” yang disebutkan untuk kalian dalam surat yang penuh berkah ini berupa hal indah dan berita-berita bagus “benar-benar terdapat dalm kitab-kitab terdahulu, (yaitu) kitab-kitab Ibrahim dan Musa,” keduanya adalah rasul paling mulia setelah Muhammad . Semua perintah-perintah diatas terdapat dalam seluruh syariat karen berguna untuk dunia dan akhirat. Perintah-perintah tersebut merupakan maslahat diseluruh waktu dan tempat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّ هَٰذَا } Perkara yang telah kami sampaikan kepadamu dalam surah ini { لَفِي الصُّحُفِ الْأُولَىٰ } telah kami sebutkan didalam kitab-kitam sebelum kitab ini ( Al-Qur'an ) datang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ هَذَا لَفِي الصُّحُفِ الْأُولَى (18) صُحُفِ إِبْرَاهِيمَ وَمُوسَى (19) \" Sesungguhnya ini benar-benar terdapat dalam kitab-kitab yang dahulu,. (yaitu) Kitab-kitab Ibrahim dan Musa.\" إِنَّ هَذَا \"sesungguhnya ini\" Maknanya: Apa-apa yang disebutkan tentang manusia bahwa ia lebih mengutamakan kehidupan dunia daripada akhirat, dan melupakan akhirat, dan juga apa-apa yang terkandung dalam ayat-ayat ini berupa pelajaran-pelajaran لَفِي الصُّحُفِ الْأُولَى \" benar-benar terdapat dalam kitab-kitab yang dahulu,.\" Maknanya: yang terdahulu sebelum umat ini صُحُفِ إِبْرَاهِيمَ وَمُوسَى \" Kitab-kitab Ibrahim dan Musa.\" Yaitu lembaran-lembaran yang dibawa oleh Ibrahim dan Musa 'alaihimassholaatu wassalaam, di dalamnya terdapat peringatan peringatan yang dapat melembutkan hati, dan memperbaiki keadaan-keadaan, Kita memohon kepada Allah Ta'ala agar menjadikan kita termasuk orangorang yang diberikan kebaikan dunia dan kebaikan di akhirat, dan yang dilindungi dari siksa api neraka, sesungguhnya Dia MakaPemberi lahi Mahadermawan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 18: 18-19. Allah tutup surat ini dengan nasihat-nasihat yang memiliki keutamaan yang tinggi yang tersebut dalam surat ini, yang juga telah disebutkan dalam lembaran-lembaran yang telah lalu, yang telah diturunkan kepada Ibrahim dan Musa, yang syariat menganjurkannya karena kesempurnaan (isinya) dan maslahat bagi seorang hamba di dunia maupun di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni beruntungnya orang-orang yang menyucikan dirinya dan bahwa akhirat itu lebih baik daripada dunia, atau yang disebutkan dalam surah yang penuh berkah ini berupa perintah-perintah dan berita-berita yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 18",
    "description": "18-19. Dasar-dasar ajaran agama samawi adalah sama, yaitu mereka yang beriman, beramal saleh, ingat kepada Allah, membersihkan diri dari dosa, dan memilih kehidupan akhirat akan berbahagia. Sebaliknya, mereka yang memilih jalan kekafiran dan hidup berlumur dosa akan celaka. Sesungguhnya ini terdapat dalam kitab-kitab yang dahulu, yang diturunkan sebelum Al-Qur'an, yaitu kitab-kitab ibrahim dan musa. Kedua nabi ini sangat disegani oleh para pengikut agama samawi. Nabi ibrahim menerima sepuluh suhuf, sedangkan nabi musa menerima taurat"
  }
]