[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Sesungguhnya apa yang dikabarkan kepada kalian dalam surat ini termasuk apa yang maknanya terpatri pada shuhuf shuhuf yang diturunkan sebelum al-qur’an, Yaitu shuhuf Ibrahim dan Musa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Yaitu kitab-kitab yang diturunkan kepada Ibrahim dan Musa -'alaihimassalām-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. صُحُفِ إِبْرٰهِيمَ وَمُوسَىٰ ((yaitu) Kitab-kitab Ibrahim dan Musa) Yakni seluruh kitab Allah menyebutkan bahwa akhirat lebih baik dan lebih kekal dari dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Yaitu 10 shuhuf Ibrahim, dan 10 shuhuf Musa, selain Taurat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) lembaran-lembaran Ibrahim dan Musa}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 18-19 “Sesungguhnya ini,” yang disebutkan untuk kalian dalam surat yang penuh berkah ini berupa hal indah dan berita-berita bagus “benar-benar terdapat dalm kitab-kitab terdahulu, (yaitu) kitab-kitab Ibrahim dan Musa,” keduanya adalah rasul paling mulia setelah Muhammad . Semua perintah-perintah diatas terdapat dalam seluruh syariat karen berguna untuk dunia dan akhirat. Perintah-perintah tersebut merupakan maslahat diseluruh waktu dan tempat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ صُحُفِ إِبْرَاهِيمَ } Yaitu kitab yang terdiri dari lembaran-lembaran yang diturunkan kepada Imam para Nabi yaitu Nabi Ibrahim 'alaihissalam, { وَمُوسَىٰ } dan juga yang diturunkan kepada Nabi Musa 'alaihissalam, dua Nabi yang mulia ini telah diturunkan kepadanya kitab Taurat, kitab yang dituliskan didalamnya apa yang juga dituliskan didalam surah ini . Allah ﷻ menyebutkan kitab dua Nabi ini ( Ibrahim dan Musa ) karena keduanya adalah Nabi yang paling mulia setelah Nabi Muhammad ﷺ , ada banyak hal-hal yang autentik yang ditertulis dikitab-kitab wahyu selain dari Al-Alqur'an dan dua kitab ini, dan banyak juga perkara-perkara yang tertulis dikitab tertentu tapi tidak tertulis dikitab wahyu lainnya, akan tetapi permasalahan tauhid tertulis disemua kitab wahyu yang Allah ﷻ turunkan kepada Nabi dan Rasul-Nya. dan dengan perkara itulah para Nabi dan Rasul berdakwah kepada Ummatnya, mereka menyampaikan risalah ilahiyah yang melarang dari perbuatan syirik, para Nabi dan Rasul berdakwah kepada ummatnya mengajak mereka kepada akhlak yang baik dan kepada kejujuran dan berbuat kebaikan, smua perkara ini tertulis didalam kitab-kitab wahyu yang Allah ﷻ turunkan kepada para Nabi dan Rasul-Nya. Sedangkan hukum syari'at halal dan haram Allah ﷻ mensyariatkan atas hamba-Nya tergantung kebutuhan hamba-Nya yang berbeda-beda disetiap zaman, Allah ﷻ menghapus suatu hukum tertentu dalam syari'at-Nya sesuai kehendak-Nya, dan menggantinya dengan hukum lain sesuai dengan kehendak-Nya pula, Allah ﷻ berfirman : { ۚ لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا } ( Untuk tiap-tiap umat diantara kamu, Kami berikan aturan dan jalan yang terang ) [ Al-Maidah : 48 ] , dan perkara ini berlaku disetiap syari'at-syariat Allah yang diturunkan kepada Para Nabi dan Rasul-Nya, dan apa yang dituliskan didalam surah ini adalah perkara yang juga berlaku pada syari'at-syariat sebelumnya, hal ini menandakan akan keutamaan dan kemuliaan surah ini, oleh karena itu Rasulullah ﷺ kerap mengkhususkan bacaan surah ini pada waktu-waktu shalat tertentu, seperti shalat Jum'at yang dibaca bersama surah ini surah Al-Ghasyiah, dan beliau juga kerap membaca dua surah ini di dua shalat ied."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Telah disebutkan pada ayat sebelumnya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 19: 18-19. Allah tutup surat ini dengan nasihat-nasihat yang memiliki keutamaan yang tinggi yang tersebut dalam surat ini, yang juga telah disebutkan dalam lembaran-lembaran yang telah lalu, yang telah diturunkan kepada Ibrahim dan Musa, yang syariat menganjurkannya karena kesempurnaan (isinya) dan maslahat bagi seorang hamba di dunia maupun di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan demikian, perintah-perintah ini ada dalam setiap syariat karena bermaslahat di dunia dan akhirat, di setiap waktu dan setiap tempat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 19",
    "description": "18-19. Dasar-dasar ajaran agama samawi adalah sama, yaitu mereka yang beriman, beramal saleh, ingat kepada Allah, membersihkan diri dari dosa, dan memilih kehidupan akhirat akan berbahagia. Sebaliknya, mereka yang memilih jalan kekafiran dan hidup berlumur dosa akan celaka. Sesungguhnya ini terdapat dalam kitab-kitab yang dahulu, yang diturunkan sebelum Al-Qur'an, yaitu kitab-kitab ibrahim dan musa. Kedua nabi ini sangat disegani oleh para pengikut agama samawi. Nabi ibrahim menerima sepuluh suhuf, sedangkan nabi musa menerima taurat. 1. Hari kiamat adalah rahasia besar. Wahai nabi, sudahkah sampai kepadamu berita tentang hari kiamat yang penuh kengerian itu'."
  }
]