[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Sucikanlah nama tuhanmu yang maha tinggi dari sekutu dan kekurangan dengan penyucian yang layak dengan keagungan NYA, Yang menciptakan makhluk-makhluk dan membaguskan serta menguatkan penciptaannya. Yang menetapkan takdir segala sesuatu, lalu membimbing makhluk kepada apa yang cocok baginya, Yang menumbuhkan padang gembala hijau, Lalu sesudahnya menjadikannya mengering dan berubah menjadi hitam setelah ia berwarna hijau."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia lah yang menciptakan manusia dengan sempurna dan menyeimbangkan bentuknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. الَّذِى خَلَقَ فَسَوَّىٰ (yang menciptakan, dan menyempurnakan (penciptaan-Nya)) Yakni Allah menciptakan manusia dengan sempurna, menyesuaikan bentuknya dan menyempurnakan pemahamannya serta menyiapkannya untuk menanggung beban syariat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah yang menciptakan manusia dan semua makhluk. Allah menjadikan manusia sebagai ciptaan yang proporsional yang lebih dari makhluk lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang menciptakan, lalu menyempurnakan} yang menjadikan ciptaanNya sempurna"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-3 Allah memerintahkan para hamba untuk memahasucikanNya (dengan melakukan hal-hal) yang mencakup dzikir, ibadah, tunduk dan patuh terhadap keagungan Allah serta merendah karena keagunganNya. Pujian tersebut adalah pujian yang pantas dan sesuai dengan keagungan Allah, yakni dengan menyebutkan nama-namaNya yang baik lagi tinggi di atas setiap nama dengan maknanya yang agung. Dan menyabutkan perbuatan-perbuatanNya yang di antaranya adalah menciptakan dan menyempurnakan dan membaguskan penciptaanNya. “Dan yang menentukan,” yakni takdir yang diikuti oleh takdir-takdir yang lain, “dan memberi petunjuk,” kepada semua makhluk ciptaan kepada takdir tersebut ini adalah hidayah (petunjuk) secara umum, yang intinya bahwa Dia menunjuki setiap makhluk kepada apa-apa yang merupakan kemaslahatan baginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dialah Allah ﷻ yang menciptakan dan tidak satupun selain Dia ﷻ yang mampu menciptakan sesuatu apapun, Dialah satu satunya dzat yang berhak atas-Nya penciptaan, { الَّذِي خَلَقَ } Dia mewujudkan sesuatu yang tidak ada menjadi ada, { فَسَوَّىٰ } kemudian Dia menjadikan ciptaan-Nya itu sama dan berbuat adil kepada nya, menjadikan pada setiap makhluk sama dalam penciptaan, sama dalam kepemilikan bentuk fisik, dan struktu tubuh, Dia ﷻ menyeimbangkan penciptaan makhluk-Nya tanpa ada kekurangan apapun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: الَّذِي خَلَقَ فَسَوَّى \" yang menciptakan dan menyempurnakan (penciptaan-Nya), \" خَلَقَ \"Menciptakan\"Yakni: mengadakannya dari ketiadaan, semua makhluk telah Allah 'Azza Wa Jalla adakan. Allah Tabaaraka wa Ta'ala berfirman: يَا أَيُّهَا النَّاسُ ضُرِبَ مَثَلٌ فَاسْتَمِعُوا لَهُ إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَنْ يَخْلُقُوا ذُبَابًا وَلَوِ اجْتَمَعُوا لَهُ وَإِنْ يَسْلُبْهُمُ الذُّبَابُ شَيْئًا لَا يَسْتَنْقِذُوهُ مِنْهُ \" Hai manusia, telah dibuat perumpamaan, maka dengarkanlah olehmu perumpamaan itu. Sesungguhnya segala yang kamu seru selain Allah sekali-kali tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, tiadalah mereka dapat merebutnya kembali dari lalat itu. \"(QS. Al-Hajj: 73) Itu adalah perumpamaan yang besar, semua tuhan yang kalian serukan selain Allah tidak akan pernah bisa menciptakan lalat meskipun semuanya bersatu, seandainya semua sesembahan-sesembahan yang disembah selain Allah, semua penguasa, semua pemimpin dan semua insinyur bersatu padu dalam rangka menciptakan seekor lalat, mereka semua tidaka akan mampu melakukannya. Kita di zaman ini, telah melampaui kemajuan teknologi yang sangat pesat, seandainya semua orang itu berkumpul untuk menciptakan seekor lalat niscaya tidak akan mampu, walau pun kata mereka: mereka telah membuat manusia robot, mereka tidak akan bisa menciptakan lalat. Manusia robot tersebut hanyalah rangakaian alat-alat yang mampu bergerak saja, ia tidak merasakan lapar, haus, panas, dingin tidak mungkin bergerak kecuali digerakkan. Lalat tidak mungkin diciptkan oleh siapa pun keculai oleh Allah. Maka Allah subhaanahu wa Ta'ala Dialah sendiri Sang Pencipta, dengan apa Dia menciptakan? Yaitu dengan sebuah kata: إِنَّ مَثَلَ عِيسَى عِنْدَ اللَّهِ كَمَثَلِ آدَمَ خَلَقَهُ مِنْ تُرَابٍ ثُمَّ قَالَ لَهُ كُنْ فَيَكُونُ \" Sesungguhnya misal (penciptaan) Isa di sisi Allah, adalah seperti (penciptaan) Adam. Allah menciptakan Adam dari tanah, kemudian Allah berfirman kepadanya: \"Jadilah\" (seorang manusia), maka jadilah dia. \"(QS. Ali Imran: 59) إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ \" Sesungguhnya perintah-Nya apabila Dia menghendaki sesuatu hanyalah berkata kepadanya: Jadilah!\" maka terjadilah ia. \"(QS. Yasin: 82) Satu kata, semua ciptaan akan mati dan fana, dan ditelan bumi, dimakan binatang buas, terbakar api. Ketika hari kiamat kelak, Allah akan mengembalikan mereka dengan satu tiupan: Keluarlah maka akan keluar. فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ (13) فَإِذَا هُمْ بِالسَّاهِرَةِ \" Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja, maka dengan serta merta mereka hidup kembali di permukaan bumi. \"(QS. An-Nazi'at: 13-14) إِنْ كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَدَيْنَا مُحْضَرُونَ \" Tidak adalah teriakan itu selain sekali teriakan saja, maka tiba-tiba mereka semua dikumpulkan kepada Kami. \" (QS. Yasin: 3) seluruh alam, manusia, jin, binatang-binatang buas, binatang-binatang kecil dan yang lainnya di hari kiamat kelak akan dikumpulkan dengan satu teriakan. Dengan demikian, Maka Allah Azza Wa Jalla sematalah sang Pencipta tidak ada pencipta lain yang bersekutu dengan-Nya, penciptaan tidak menyulitkan-Yya tidak juga melemahkan-Nya. Itu semua mudah bagi-Nya, itu semua hanya dengan satu kata. Firman-Nya فَسَوَّى \"Menyempurnakannya\" Menyempurnakan ciptaan-Nya dengan sebaik-baik bentuk, dan bentuk yang serasi. Misalnya manusia, Allah berfirman dalam surat al-Infithar: الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ (7) فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ \" Yang telah menciptakan kamu lalu menyempurnakan kejadianmu dan menjadikan (susunan tubuh) mu seimbang, dalam bentuk apa saja yang Dia kehendaki, Dia menyusun tubuh-mu. \"(7-8) لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ \" sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya. \" (QS. At-Tin: 4) tidak ada makhluk yang bentuknya lebih bagus dari bentuk manusia, kepalanya di atas, dan jantungnya di dada, dan memiliki bentuk sempurna, oleh karenanya yang pertama-tama masuk dalam firman-Nya فَسَوَّى \"Menyempurnakannya\" adalah kesempurnaan manusia الَّذِي خَلَقَ فَسَوَّى \" yang menciptakan dan menyempurnakan (penciptaan-Nya), \" semuanya disempurnakan sesuai dengan bentuk yang layak untuknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 2: Allah menjelaskan ke Maha Sucian-Nya, karena Ia yang menciptakan segala sesuatunya, dan tidak ada pengecualian. Dan Allah jadikan teratur dan sempurna (ciptaan-Nya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga menjadi sesuai dan seimbang anggota tubuhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 2",
    "description": "Dialah tuhan yang menciptakan segala sesuatu dari tiada, lalu menyempurnakan penciptaan-Nya. Ciptaannya sepadan, teratur, padu, rapi, dan sempurna dari semua sisi. 3. Dialah pula yang menentukan kadar masing-masing ciptaan-Nya dengan kadar dan ukuran yang sempurna, dan memberi petunjuk kepada makhluk hidup apa yang menjadi kebutuhan dan kemaslahatan hidupnya melalui naluri yang Allah ciptakan pada diri mereka."
  }
]