[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Sucikanlah nama tuhanmu yang maha tinggi dari sekutu dan kekurangan dengan penyucian yang layak dengan keagungan NYA, Yang menciptakan makhluk-makhluk dan membaguskan serta menguatkan penciptaannya. Yang menetapkan takdir segala sesuatu, lalu membimbing makhluk kepada apa yang cocok baginya, Yang menumbuhkan padang gembala hijau, Lalu sesudahnya menjadikannya mengering dan berubah menjadi hitam setelah ia berwarna hijau."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan Yang menciptakan berbagai makhluk dengan segala jenis, macam dan sifatnya serta memberi petunjuk kepada setiap makhluk apa-apa yang sesuai dan cocok baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَالَّذِى قَدَّرَ فَهَدَىٰ (dan yang menentukan kadar (masing-masing) dan memberi petunjuk) Yakni Allah menentukan jenis, bentuk, perbuatan, perkataan, dan ajal segala sesuatu; kemudian memberi petunjuk kepada semuanya sesuai dengan keharusannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dia-lah yang Maha Kuasa atas segala sesuatu, diantaranya adalah memberi rejeki dengan ukurannya. Allah memberi tahu tentang kemanfaatan segala yang telah Allah ciptakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang menentukan takdir dan memberi petunjuk} yang menentukan takdir ciptaanNya berupa jenis, ragam dan sifatnya, lalu menunjukkan masing-masing makhluk kepada apa yang sesuai dan cocok dengannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-3 Allah memerintahkan para hamba untuk memahasucikanNya (dengan melakukan hal-hal) yang mencakup dzikir, ibadah, tunduk dan patuh terhadap keagungan Allah serta merendah karena keagunganNya. Pujian tersebut adalah pujian yang pantas dan sesuai dengan keagungan Allah, yakni dengan menyebutkan nama-namaNya yang baik lagi tinggi di atas setiap nama dengan maknanya yang agung. Dan menyabutkan perbuatan-perbuatanNya yang di antaranya adalah menciptakan dan menyempurnakan dan membaguskan penciptaanNya. “Dan yang menentukan,” yakni takdir yang diikuti oleh takdir-takdir yang lain, “dan memberi petunjuk,” kepada semua makhluk ciptaan kepada takdir tersebut ini adalah hidayah (petunjuk) secara umum, yang intinya bahwa Dia menunjuki setiap makhluk kepada apa-apa yang merupakan kemaslahatan baginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالَّذِي قَدَّرَ } Dan Dia ﷻ yang telah menetapkan takdir semua makhluk-Nya, semua makhluk dimuka bumi ini telah ditetapkan takdirnya tidak lebih dan tidak pula kurang, Allah ﷻ berfirman : { وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا } ( dan dia telah menciptakan segala sesuatu, dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya ) [ Al-Furqan : 2 ] , segala sesuatu telah telah ditetapkan tibangan dan ukurannya, Allah ﷻ telah menetapkan segala sesuatu pada ukuran, timbangannya masing-masing, tidak ada kesalahan apapun padanya, kita melihat bagaiaman alam manusia, alam hewan, alam tumbuh-tumbuhan, alam serangga, alam burung-burung, semuanya telah ditetapkan kehidupannya dengan takdirnya masing-masing. { فَهَدَىٰ } Setelah ditetapkan takdirnya masing-masing, Allah ﷻ kemudian membimbing mereka menentukan jalan yang benar untuk kemaslahatan mereka masing-maisng, tanpa adanya bimbingan khusus dari siapapun disekitarnya mereka mampu menentukan jalan itu demi kemasahatan hidup mereka, semua itu berjalan dengan fitrohnya masing-masing dengan izin Allah ﷻ, bagaimana Allah ﷻ membimbing bayi yang baru lahir, apakah itu dari manusia maupun hewan, hal yang pertama dia cari adalah susu ibunya, hal itu terjadi tanpa adanya bimbingan dari orang sekitarnya. Begitupun dengan hewan yang berjenis jantan mencari betina, semuanya berjalan dengan bimbingan dari sang pencipta ﷻ , Allah ﷻ berfirman tentang kisah Musa bersama Fir'aun : { قَالَ فَمَنْ رَبُّكُمَا يَا مُوسَىٰ , قَالَ رَبُّنَا الَّذِي أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَىٰ } ( Berkata Fir’aun: “Maka siapakah Tuhanmu berdua, hai Musa? , Musa berkata: “Tuhan kami ialah (Tuhan) yang telah memberikan kepada tiap-tiap sesuatu bentuk kejadiannya, kemudian memberinya petunjuk. ) [ Thaha : 49 - 50 ] Dia Allah ﷻ membimbing siapapun untuk kemaslahatannya dan keuntungannya masing-masing. { وَالَّذِي قَدَّرَ فَهَدَىٰ } Ayat ini juga sebagai bukti akan kuasa dan ilmu Allah ﷻ dan Dia ﷻ meliputi segala hal, Dia ﷻ menciptakan makhluk sebaik-baiknya ciptaan, Allah ﷻ berfirman : { صُنْعَ اللَّهِ الَّذِي أَتْقَنَ كُلَّ شَيْءٍ ۚ إِنَّهُ خَبِيرٌ بِمَا تَفْعَلُونَ } ( (Begitulah) perbuatan Allah yang membuat dengan kokoh tiap-tiap sesuatu; sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan. ) [ An Naml : 88 ] , bukti dan dalil bahwasanya Allah ﷻ berkusa atas segala sesuatu dan kewajiban bagi setiap manusia untuk bertuhan dan beribadah hanya kepada-Nya ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالَّذِي قَدَّرَ فَهَدَى \" dan yang menentukan kadar (masing-masing) dan memberi petunjuk, \" Allah Azza Wa Jalla yang menentukan kadar segala sesuatu sebagaimana Allah Ta'ala berfirman: وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا \" dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya. \"(QS. Al-Furqan: 2) menentukan kondisinya, tempat kembalinya, zatnya dan sifat-sifatnya, segala sesuatu ada kadar batasnya. Ajal-ajal manusia dibatasi, kondisi-kondisi ditentukan, dan tubuh-tubuh pun ditentukan, segala sesuatu ditentukan sesuai ketentuannya sebagaimana Allah Ta'ala berfirman: وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا \" dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya. \" Firman-Nya فَهَدَى \"kemudian memberi petunjuk\" mencakup petunjuk syari'at dan petunjuk kauniyah (alamiah) Petunjuk kauniyah: Allah memberi petunjuk segala sesuatu kepada tujuan ciptaan-Nya. Fir'aun berkata kepada Musa: قَالَ فَمَنْ رَبُّكُمَا يَا مُوسَى (49) قَالَ رَبُّنَا الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَى \" Maka siapakah Tuhanmu berdua, hai Musa? Musa berkata: \"Tuhan kami ialah (Tuhan) yang telah memberikan kepada tiap-tiap sesuatu bentuk kejadiannya, kemudian memberinya petunjuk. \" (QS. Thoha: 49-50) Anda akan mendapati setiap makhluk telah mendapatkan petunjuk kepada apa yang ia butuhkan. Seorang bayi jika ia keluar dari perut ibunya dan ia ingin menyusui, Allah 'Azza Wa Jalla akan menunjukannya ke pada susu ibunya ia akan menghisapnya. Lihatlah serangga yang terkecil, semut misalnya, ia tidak membangun sarangnya kecuali di tempat yang tinggi di tanah, ia takut terhempas banjir yang masuk ke sarangnya sehingga merusaknya, dan jika hujan turun, sedangkan ia berada di sarangnya terdapat makanan berupa biji-bijian ia akan keluar membawanya, jika matahari terbit ia akan menebarnya agar tidak membusuk, ia juga sebelum menyimpannya ia akan memakan ujung biji itu agar tidak tumbuh lalu merusak sarang mereka. ini semua dapat disaksikan dan teruji, siapakah yang memberinya petunjuk untuk itu? Sungguh dialah Allah 'azza Wa Jalla, inilah hidayah kauniyah, bahwa Dia telah memberikan petunjuk semua makhluk kepada yang mereka butuhkan. Sedangkan hidayah syar'iyah, inilah hidayah yang paling penting jika dilihat bagi anak-anak adam: Hidayah ini pun telah dijelaskan Alla 'Azza Wa Jalla, hingga orang-orang kafir pun telah Allah beri petunjuk, yakni telah Allah memberi penjelasan untuk mereka. Allah Ta'ala berfirman: وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ فَاسْتَحَبُّوا الْعَمَى عَلَى الْهُدَى \" Dan adapun kaum Tsamud maka mereka telah Kami beri petunjuk tetapi mereka lebih menyukai buta (kesesatan) dari petunjuk itu, \"(QS. Fushilat: 17) Hidayah syar'iyah itulah yang dimaksudkan dari kehidupan anak adam: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ \" Dan Aku tidak menciptakan jin dan manusia melainkan supaya mereka menyembah-Ku. \"(QS. Adz-Dzariyat: 56) Allah memberikan kabar kepada kita hal itu melainkan agar kita bersandar kepada-Nya di setiap perkara kita, jika kita tahu bahwa Dialah sang pencipta dari ketiadaan, dan kita ditimpa penyakit kita akan bersandar kepada Allah. Karena yang telah menciptakan anda dari ketiadaan, Dia pun mampu untuk memberikan kesehatan tubuhmu, jika begitu bersandarlah kepada Rabbmu, bergantunglah kepada-Nya. Tidak mengapa anda mengonsumsi obat yang diperbolehkan bagimu, tetapi dibarengi dengan keyakinan bahwa obat ini adalah salah satu sebab yang telah Allah 'Azza Wa Jalla jadikan, dan jika anda disembuhkan karena sebab obat itu maka yang menyembuhkanmu sebenarnya adalah Allah 'Azza Wa Jalla. Allahlah yang telah menjadikan obat itu sebagai sebab kesembuhanmu., seandainya Dia menghendaki maka Dia mampu menjadikan obat tersebut sebagai penyebab kebinasaanmu, jika kita tahu bahwa Allah adalah sang pencipta maka handaknya kita bersandar kepada-Nya di segala perkara kita kepada Allah 'Azza Wa jalla, jika kita tahu bahwa Dialah yang memberikan petunjuk maka hendaknya kita meminta petunjuk kepada-Nya dengan syari'at-Mya sehingga kita dapat sampai kepada apa-apa yang telah dijanjikan Rabb kita 'Azza Wa Jalla berupa kemuliaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 3: Dan Allah lah yang sungguh Maha Mampu menentukan kadar pada setiap makhluk dan memberi petunjuk untuk mendatangkan macam-macam kadar yang telah ditentukan, serta membimbing (menuju) kemaslahatan dan upaya (makhluk) dalam kebaikan. Sebagaimana Allah berfirman : \"Tuhan kami ialah (Tuhan) yang telah memberikan kepada tiap-tiap sesuatu bentuk kejadiannya, kemudian memberinya petunjuk” {Thaha : 50}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hidayah atau petunjuk ini adalah petunjuk yang umum, yaitu bahwa Dia menunjukkan kepada semua makhluk hal yang bermaslahat bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 3",
    "description": "Dialah pula yang menentukan kadar masing-masing ciptaan-Nya dengan kadar dan ukuran yang sempurna, dan memberi petunjuk kepada makhluk hidup apa yang menjadi kebutuhan dan kemaslahatan hidupnya melalui naluri yang Allah ciptakan pada diri mereka. 4. Dan dialah pula yang menumbuhkan rerumputan dan tetumbuhan yang bisa dikonsumsi oleh manusia dan hewan melalui proses rumit yang hanya diketahui rinciannya oleh Allah."
  }
]