[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Sucikanlah nama tuhanmu yang maha tinggi dari sekutu dan kekurangan dengan penyucian yang layak dengan keagungan NYA, Yang menciptakan makhluk-makhluk dan membaguskan serta menguatkan penciptaannya. Yang menetapkan takdir segala sesuatu, lalu membimbing makhluk kepada apa yang cocok baginya, Yang menumbuhkan padang gembala hijau, Lalu sesudahnya menjadikannya mengering dan berubah menjadi hitam setelah ia berwarna hijau."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan yang mengeluarkan dari bumi rerumputan yang menjadi makanan bagi hewan ternakmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Dan Allah-lah yang menumbuhkan rumput-rumput hijau di bumi, kemudian menjadikannya kering kerontang dan kehitaman, padahal sebelumnya hijau merona."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-5 . Ini adalah perumpamaan kehidupan dunia, juga perumpamaan untuk balasan atas pembangkangan orang-orang kafir, dan untuk siapun yang tergoda dan dihinakan oleh kehidupan dunia, mereka berada dalam kebahagiaan dan kenikmatan, kemudian keadaan mereka akan berganti menjadi kegekisahan dan kehancuran di dunia dan di akhirat, sebagaimana tumbuhan diciptakan dengan kesegarannya kemudian berubah menjadi tumbuhan yang kering."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Allah-lah yang menumbuhkan tanaman, buah-buahan dan pepohonan. Allah lah yang juga merawat hewan-hewan dan binatang melata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan yang menumbuhkan rumput-rumput} rumput yang kamu gunakan untuk memelihara ternak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 4-5 Demikian juga dengan menyebutkan nikamt-nikmatNya yang bersifat dunia. Karena itu Allah berfirman, “Dan yang menumbuhkan rumput-rumputan,” maksudnya, Allah menurunkan air dari langit, dan air itu Allah menumbuhkan berbagai macam tumbuhan dan rerumputan yang dimakan oleh manusia, binatang ternak, serta seluruh binatang lain. Selanjutnya setelah masa remaja yang ditentukan Allah telah sempurna, Allah mengeringkan tanaman dan rerumputan tersebut, “lalu dijadikanNya rumput-rumputan kering kehitam-hitaman,” yakni hitam. Artinya, Allah merubahnya menjadi rerumputan yang lusuh."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tumbuh-tumbuhan, padang rumput dan pepohonan Telah Allah ﷻ keluarkan dari bawah tanah ketika kamu memperhatikan tanah yang tandus kering, kemudian Allah ﷻ menurunkan hujan dari langit, maka kamu akan mendapati tanah itu menjadi hijau dan penuh dengan tumbuhan, kamu akan melihat berbagai macam pepohonan dan buah-buahan dari segala sisi, pemandangan yang indah, kamu mengambil dari tumbuh-tumbuhan itu berbagai macam manfaat, darinya kamu menjadikannya bahan pangan untuk keluargamu dan untuk hewan ternakmu dan darinya juga kamu membuat berbagai macam obat-obatan, semua itu adalah kuasa dan keajaiban yang Allah ﷻ berikan kepada penduduk bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 4: 4-5. Allah yang menumbuhkan rumput dan memelihara apa yang tumbuh (di atas bumi) seperti tumbuh-tumbuhan hijau. Kemudian Allah jadikan setelah warna hijaunya menjadi condong kepada warna hitam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia menurunkan dari langit air untuk menumbuhkan berbagai macam tumbuhan dan rerumputan yang banyak, sehingga manusia dan hewan dapat memakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 4",
    "description": "Dan dialah pula yang menumbuhkan rerumputan dan tetumbuhan yang bisa dikonsumsi oleh manusia dan hewan melalui proses rumit yang hanya diketahui rinciannya oleh Allah. 5. Rerumputan itu tumbuh, lalu setelah sekian lama dijadikan-Nya rerumputan itu kering dan berubah warna menjadi kehitam-hitaman. Begitulah siklus kehidupan di dunia: lahir, tumbuh, berkembang, matang, kemudian mati. Semua tunduk pada aturan Allah dan tidak ada yang mampu menghindari kehendak-Nya."
  }
]