[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Sucikanlah nama tuhanmu yang maha tinggi dari sekutu dan kekurangan dengan penyucian yang layak dengan keagungan NYA, Yang menciptakan makhluk-makhluk dan membaguskan serta menguatkan penciptaannya. Yang menetapkan takdir segala sesuatu, lalu membimbing makhluk kepada apa yang cocok baginya, Yang menumbuhkan padang gembala hijau, Lalu sesudahnya menjadikannya mengering dan berubah menjadi hitam setelah ia berwarna hijau."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Lalu Dia menjadikan rerumputan itu batang kering setelah sebelumnya hijau nan segar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَجَعَلَهُۥ غُثَآءً (lalu dijadikan-Nya rumput-rumput itu kering) Yakni Allah menjadikannya kering dan hancur setelah sebelumnya hijau merona. أَحْوَىٰ( kehitam-hitaman) Yakni menjadi hitam setelah dulunya berwarna hijau. Karena semak-semak jika mengering akan berubah menjadi hitam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-5 . Ini adalah perumpamaan kehidupan dunia, juga perumpamaan untuk balasan atas pembangkangan orang-orang kafir, dan untuk siapun yang tergoda dan dihinakan oleh kehidupan dunia, mereka berada dalam kebahagiaan dan kenikmatan, kemudian keadaan mereka akan berganti menjadi kegekisahan dan kehancuran di dunia dan di akhirat, sebagaimana tumbuhan diciptakan dengan kesegarannya kemudian berubah menjadi tumbuhan yang kering."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Allah menjadikan rerumputan itu kering, kehitam-hitaman setelah menghijau"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{lalu menjadikannya kering} kering dan tandus {hitam} hitam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 4-5 Demikian juga dengan menyebutkan nikamt-nikmatNya yang bersifat dunia. Karena itu Allah berfirman, “Dan yang menumbuhkan rumput-rumputan,” maksudnya, Allah menurunkan air dari langit, dan air itu Allah menumbuhkan berbagai macam tumbuhan dan rerumputan yang dimakan oleh manusia, binatang ternak, serta seluruh binatang lain. Selanjutnya setelah masa remaja yang ditentukan Allah telah sempurna, Allah mengeringkan tanaman dan rerumputan tersebut, “lalu dijadikanNya rumput-rumputan kering kehitam-hitaman,” yakni hitam. Artinya, Allah merubahnya menjadi rerumputan yang lusuh."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Awal dari tumbuhnya pepohonan dan remputan itu menjadi pemandangan bagi siapapun yang melihatnya, itulah ciptaan Allah ﷻ, kemudian setelah berlalu masa hijaunya dan keindahannya, Allah ﷻ menjadikan tumbuhan-tumbuhan itu { غُثَاءً } mengering, setelah sebelumnya tumbuhan itu basah dan segar dan indah, ranting dan daunnya kering mudah ditiup angin, seakan-akan terilihat belum pernah ada sebelumnya. { أَحْوَىٰ } Tumbuhan-tumbuhan yang kering itupun berubah warna yang sebelumnya hijau segar menjadi hitam kering, semua itu terjadi dengan kuasa Allah ﷻ ."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 5: 4-5. Allah yang menumbuhkan rumput dan memelihara apa yang tumbuh (di atas bumi) seperti tumbuh-tumbuhan hijau. Kemudian Allah jadikan setelah warna hijaunya menjadi condong kepada warna hitam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah menghijau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 5",
    "description": "Rerumputan itu tumbuh, lalu setelah sekian lama dijadikan-Nya rerumputan itu kering dan berubah warna menjadi kehitam-hitaman. Begitulah siklus kehidupan di dunia: lahir, tumbuh, berkembang, matang, kemudian mati. Semua tunduk pada aturan Allah dan tidak ada yang mampu menghindari kehendak-Nya. 6. Wahai nabi, sebagaimana kami kuasa menciptakan makhluk dan menyempurnakan bentuknya, kami kuasa pula menjadikan Al-Qur'an melekat di hatimu. Kami akan membacakan Al-Qur'an kepadamu, aku tancapkan bacaan itu langsung ke relung hatimu, sehingga engkau tidak akan lupa. Inilah salah satu bentuk penjagaan Allah terhadap kemurnian Al-Qur'an saat turun ke bumi."
  }
]