[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Kami akan membacakan kepdamu (wahai rasul), al-qur’an ini dengan bacaan yang kamu tidak lupa, Kecuali apa yang Allah kehendaki dimana hikmah NYA menuntut melupakannya karena kemashlahatan yang dia ketahui.sesungguhnya allah swt mengetahui perkataan dan perbuatan yang ditampakkan dan yang disamarkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Akan Kami bacakan kepadamu -wahai Rasul- Al-Qur`ān dan Kami kumpulkan di dalam dadamu sehingga engkau tidak akan melupakannya. Maka janganlah engkau mendahului Jibril dalam membacanya sebagaimana yang pernah engkau lakukan karena keinginanmu yang kuat agar tidak melupakannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai Rasulullah, Kami akan menjadikanmu pembaca al-Qur’an, dengan mewahyukan kepadamu bacaan al-Qur’an melalui pengajaran dari Jibril, sehingga kamu tidak akan melupakan bacaannya. Ini merupakan janji Allah bagi Nabi-Nya untuk membantunya dalam menghafal wahyu yang dia dapatkan, dan menjauhkannya dari melupakannya, sebab Allah yang menjamin untuk menjaga wahyu ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. سَنُقْرِئُكَ (Kami akan membacakan kepadamu (Muhammad)) Yakni membacakan al-Qur’an. فَلَا تَنسَىٰٓ( maka kamu tidak akan lupa) Yakni tidak akan lupa apa yang kamu baca. Dahulu jika Jibril turun kepada Rasulullah untuk menyampaikan wahyu, Rasulullah mulai membaca awal wahyu yang disampaikan Jibril sebelum Jibril menyelesaikan pembacaan wahyunya, sebab Rasulullah khawatir akan lupa wahyu tersebut. Maka turunlah ayat: سَنُقْرِئُكَ فَلَا تَنسَىٰٓ. Dengan ini Allah telah menjauhkannya dari lupa terhadap al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Aku (Allah) akan membacakan Al-quran kepadamu wahai Nabi, melalui lisan Jibril, maka jangan lupa terhadap apa yang dibacakan Jibril. Mujahid Alkalbi berkata: Ketika Jibril datang membawa wahyu kepada Nabi SAW, Jibril tidak menyelesaikan ayatnya sampai akhir sebelum Nabi membaca awal ayatnya, karena takut Nabi lupa. Sehingga turunlah ayat “Akan Kami bacakan kepadamu, namun jangan sampai engkau lupa.” Maka telah Aku cukupkan kepadamu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami akan membacakan (Al-Qur’an) kepadamu} Al-Qur'an kepadamu dan memgumpulkannya sebelum kamu {sehingga kamu tidak akan lupa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-7 Kemudian dengan menyebut nikamt-nikmat keagamaan (din). Karena itu Allah menganugerahkan dasar dan materinya, yaitu al-Qur’an, kemudian berfirman, “Kami akan membacakan (al-Qur’an) kepadamu (Muhammad), maka kamu tidak akan lupa.” Maksudnya, Kami akan menjaga apa yang Kami wahyukan kepadamu berupa al-Qur’an, dan Kami menjaga hatimu agar tetap waspada sehingga kau tidak akan sesuatu pun darinya. Ini merupakan kabar gembira besar dari Allah untuk hamba dan RasulNya, Muhammad yaitu Allah akan mengajarkannya ilmu yang tidak akan beliau lupakan, “kecuali kalau Allah menghendaki,” sesuai tuntutan hikmahNya yang membuatmu melupakannya karena suatu kepentingan dan hikmah yang amat besar. “Sesungguhnya Dia mengetahui yang terang dan yang tersembunyi,” di antaranya Allah mengetahui apa yang terbaik untuk hambaNya. Artinya, karena itu Allah mensyariatkan dan menegaskan apa yang Dia inginkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah menyebutkan ayat diatas, Allah ﷻ kemudian berkata kepada Rasul-Nya : { سَنُقْرِئُكَ فَلَا تَنْسَىٰ } Rasulullah ﷺ yang sebelumnya belum pernah membaca dan menulis, ketika Allah ﷻ ingin berbicara dengannya Dia ﷻ mengutus Kepadanya Jibril 'alaihissalam, dan ketika itu Rasulullah sedang berada di gua hiro menyendiri, Jibril kemudian datang menghampirinya dengan wujud seorang laki-laki, dan berkata kepada Rasulullah : \" Iqro' \" bacalah, kemudian Rasulullah menjawab : Aku tidak dapat membaca, Rasulullah belum pernah belajar dan belum mengetahui bagaimana beliau membaca, kemudian Jibril benuntunya kembali dan berkata : Bacalah, kemudian beliau ﷺ menjawab kembali : Aku tidak dapat membaca, beliau ﷺ mengabarkan kepada Jibril bahwasanya beliau tidak mampu membaca, Rasulullah ﷺ saat itu belum mengetahui bahwasanya yang datang kepadnya adalah Jibril 'Alaihissalam, beliau mengira yang datang kepadanya hanya manusia biasa, maka Jibril pun menutupi badan Rasulullah ﷺ kemudian membukanya kembali dan berkata : \"bacalah\", kemudian Rasulullah ﷺ menjawab kembali : \"aku tidak dapat membaca\" , kemudian Jibril menutupi RAsulullah ﷺ yang ketiga kalinya dan berkata : { اقرأ باسم ربك الذي خلق } ( Bacalah dengan menyebut nama tuhanmu ) [ Al-'Alaq : 1 ] dan ketika itulah Rasulullah ﷺ mulai menghafalkan apa yang di bacakan Jibril kepdanya. Dan itulah wahyu yang pertama kali dibaca oleh Rasulullah ﷺ melalui perantara Malaikat Jibril 'alaihissalam, kemudian setelah itu wahyu terus diturunkan kepadanya secara berahap, dan Rasulullah ﷺ pun selalu konsentrasi ketika Jibril membacakan kepadanya wahyu dari Allah dan Rasulullah ﷺ juga menghafalkannya, dan takut jika apa yang dihafalnya itu akan hilang, maka dari itu Allah ﷻ melalui ayat ini { سَنُقْرِئُكَ فَلَا تَنْسَىٰ } menjamin bahwasanya apa yang dibacakan kepada RAsul-Nya tidak akan terlupakan, ayat ini menjadi penenang bagi Rasulullah ﷺ yang yang khawatir jika hafalan beliau akan hilang, sebagaimana yang dikatakan di ayat lain : { لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ , إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ , فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ , ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ } ( Janganlah kamu gerakkan lidahmu untuk (membaca) Al Quran karena hendak cepat-cepat (menguasai)nya , Sesungguhnya atas tanggungan Kamilah mengumpulkannya (di dadamu) dan (membuatmu pandai) membacanya , Apabila Kami telah selesai membacakannya maka ikutilah bacaannya itu , Kemudian, sesungguhnya atas tanggungan Kamilah penjelasannya ) [ Al-Qiyamah : 16 - 19 ] , Allah ﷻ telah memberi jaminan kepada Rasul-Nya bahwa dia tidak akan lupa yang telah beliau hafalkan dari wahyu Allah ﷻ . { سَنُقْرِئُكَ فَلَا تَنْسَىٰ } Inilah persiapan untuk Rasulullah, agar membawa wahyu ini dn menyampaikannya kepada ummatnya, agar mengajak ummat manusia kepada syari'at yang ditetapkan oleh wahyu ini, dan siapapun yang berjuang untuk dakwah islam harus memiliki kesiapan dan keilmuan yang mapan sebelum mengajak manusia kepada dakwah islam yang benar, begitulah yang pernah Rasulullah ﷺ lakukan ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "سَنُقْرِئُكَ فَلَا تَنْسَى (6) إِلَّا مَا شَاءَ اللَّهُ إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَى \" Kami akan membacakan (Al Qur'an) kepadamu (Muhammad) maka kamu tidak akan lupa, kecuali kalau Allah menghendaki. Sesungguhnya Dia mengetahui yang terang dan yang tersembunyi.\" Ini adalah janji dari Allah subhaanahu wa Ta'ala untuk rasul-Nya shallallaahu 'alaihi wa sallam, bahwa Allah akan membacakan al-Quran kepadanya dan tidak akan menjadikan rasulnya lupa al-Quran. Rasul shallallaahu 'alaihi wa sallam dahaulu terburu-buru ketika Jibril datang untuk menyampaikan wahyu, maka Allah berfirman kepadanya: لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ (16) إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ (17) فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ (18) ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ \" Janganlah kamu gerakkan lidahmu untuk (membaca) Al Qur'an karena hendak cepat-cepat (menguasai) nya. Sesungguhnya atas tanggungan Kami-lah mengumpulkannya (di dadamu) dan (membuatmu pandai) membacanya. Apabila Kami telah selesai membacakannya maka ikutilah bacaannya itu.. Kemudian, sesungguhnya atas tanggungan Kami-lah penjelasannya.\"(QS. Al-Qiyamah: 16-19) Maka Nabipun shallallaahu 'alaihi wa sallam diam hingga Jibril selesai dari membacakan wahyu kemudian beliau membacanya. Di sini Allah berfirman: سَنُقْرِئُكَ فَلَا تَنْسَى (6) إِلَّا مَا شَاءَ اللَّهُ \" Kami akan membacakan (Al Qur'an) kepadamu (Muhammad) maka kamu tidak akan lupa, kecuali kalau Allah menghendaki.\" Maksudnya: Kecuali yang Allah kehendaki engkau melupaknnya, karena sesungguhnya perkaranya di tangan-Nya 'Azza Wa Jalla يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ \" Allah menghapuskan apa yang Dia kehendaki dan menetapkan (apa yang Dia kehendaki),\"(QS. Ar-Ra'du: 39) مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (106) أَلَمْ تَعْلَمْ أَنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ وَلِيٍّ وَلَا نَصِيرٍ \" Ayat mana saja yang Kami nasakhkan, atau Kami jadikan (manusia) lupa kepadanya, Kami datangkan yang lebih baik daripadanya atau yang sebanding dengannya. Tiadakah kamu mengetahui bahwa sesungguhnya Allah Maha Kuasa atas segala sesuatu? Tiadakah kamu mengetahui bahwa kerajaan langit dan bumi adalah kepunyaan Allah? Dan tiada bagimu selain Allah seorang pelindung maupun seorang penolong.\"(QS. Al-Baqarah: 106-107) Bisa jadi Nabi shallallaahu 'alaihi wasallam dijadikan lupa sebuah ayat dalam kitab Allah tetapi ia begitu cepat mengingatnya kembali 'alaihissholaatu wassalaam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 6: 6-7. Kemudian Allah kabarkan bahwa Nabi Allah (Muhammad ﷺ ) akan membacakan Al Qur’an ini sampai ia hafal di dalam dadanya dan tidak lupa; Sebab Allah melindunginya dari lupa/kelupaan terhadapan ayat Al Qur’an. Dan Allah kecualikan bagi yang ingin Allah ganti (secara hukum dalam ayat) dengan mengganti ayat Al-Qur’an dengan cara menghapusnya (nasakh hukumnya) dimana Allah akan jadikan ia lupa, sebagaimana Allah berfirman : “Ayat mana saja yang Kami nasakhkan, atau Kami jadikan (manusia) lupa kepadanya, Kami datangkan yang lebih baik daripadanya atau yang sebanding dengannya. Tidakkah kamu mengetahui bahwa sesungguhnya Allah Maha Kuasa atas segala sesuatu?” {Al Baqaran : 106}. Allah mengkabarkan bahwa Ia mengetahui apa yang namapak pada seorang hamba dan setiap apa yang ia (hamba) tersebut sembunyikan dari ucapan dan perbuatan, tidak akan perna tersembunyi bagi-Nya apa yang tersembunyi di bumi dan tidak juga di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan beberapa kenikmatan dunia, maka Allah Subhaanahu wa Ta'aala menyebutkan asal dan sumber kenikmatan, yaitu Al Qur’an. Yakni Kami akan menjaga wahyu yang Kami wahyukan kepadamu dan menyimpannya dalam hatimu sehingga engkau tidak akan lupa sedikit pun darinya. Ini merupakan kabar gembira yang besar dari Allah Subhaanahu wa Ta'aala kepada hamba dan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam, bahwa Allah Subhaanahu wa Ta'aala akan mengajarkan ilmu kepadanya yang tidak akan Beliau lupakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 6",
    "description": "Wahai nabi, sebagaimana kami kuasa menciptakan makhluk dan menyempurnakan bentuknya, kami kuasa pula menjadikan Al-Qur'an melekat di hatimu. Kami akan membacakan Al-Qur'an kepadamu, aku tancapkan bacaan itu langsung ke relung hatimu, sehingga engkau tidak akan lupa. Inilah salah satu bentuk penjagaan Allah terhadap kemurnian Al-Qur'an saat turun ke bumi. 7. Allah akan terus menjaga hafalan Al-Qur'an nabi, kecuali jika Allah menghendaki untuk menghapus hafalan itu dari hatinya. Hal ini membuktikan Al-Qur'an bukan ucapan nabi, melainkan kalam Allah. Hal ini juga membuktikan bahwa hafalan Al-Qur'an nabi merupakan anugerah-Nya semata. Sungguh dia yang berbuat demikian adalah tuhan yang mengetahui yang terang dan yang tersembunyi, di antaranya hafalan dalam hati nabi."
  }
]