[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Kami akan membacakan kepdamu (wahai rasul), al-qur’an ini dengan bacaan yang kamu tidak lupa, Kecuali apa yang Allah kehendaki dimana hikmah NYA menuntut melupakannya karena kemashlahatan yang dia ketahui.sesungguhnya allah swt mengetahui perkataan dan perbuatan yang ditampakkan dan yang disamarkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Kecuali apa yang Allah untuk kamu lupakan karena suatu hikmah. Sesungguhnya Dia Yang Mahasuci mengetahui apa yang di tampakkan dan apa yang disembunyikan, tidak ada sesuatu pun yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hai Nabi, namun kamu akan melupakan apa yang Allah kehendaki untuk kamu lupakan; karena Allah akan menasakh (menghapus/mengganti) sebagian wahyu yang Dia turunkan sehingga wahyu itu tidak dibaca lagi atau tidak diterapkan hukumnya. Allah Maha Mengetahui perkataan dan perbuatan yang ditampakkan para hamba dan yang dirahasiakan. Dan termasuk yang ditampakkan adalah al-Qur’an yang dibaca Rasulullah, dan termasuk yang dirahasiakan adalah al-Qur’an yang dilupakannya karena tidak lagi dibaca."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. إِلَّا مَا شَآءَ اللَّـهُ ۚ (kecuali kalau Allah menghendaki) Yakni jika Allah menghendaki agar kamu lupa. إِنَّهُۥ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَىٰ( Sesungguhnya Dia mengetahui yang terang dan yang tersembunyi) Yakni Allah mengetahui apa yang nampak dan yang tersembunyi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Kecuali yang Allah kehendaki kepadanya untuk lupa terhadap ayat-Nya. Allah berkehendak menghapus bacaan dan hukumnya. Allah Maha Mengetahui apa yang tersembunyi dan apa yang tampak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali jika Allah menghendaki} kecuali jika Allah menghendaki agar kamu melupakannya {Sesungguhnya Dia mengetahui yang terang dan yang tersembunyi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-7 Kemudian dengan menyebut nikamt-nikmat keagamaan (din). Karena itu Allah menganugerahkan dasar dan materinya, yaitu al-Qur’an, kemudian berfirman, “Kami akan membacakan (al-Qur’an) kepadamu (Muhammad), maka kamu tidak akan lupa.” Maksudnya, Kami akan menjaga apa yang Kami wahyukan kepadamu berupa al-Qur’an, dan Kami menjaga hatimu agar tetap waspada sehingga kau tidak akan sesuatu pun darinya. Ini merupakan kabar gembira besar dari Allah untuk hamba dan RasulNya, Muhammad yaitu Allah akan mengajarkannya ilmu yang tidak akan beliau lupakan, “kecuali kalau Allah menghendaki,” sesuai tuntutan hikmahNya yang membuatmu melupakannya karena suatu kepentingan dan hikmah yang amat besar. “Sesungguhnya Dia mengetahui yang terang dan yang tersembunyi,” di antaranya Allah mengetahui apa yang terbaik untuk hambaNya. Artinya, karena itu Allah mensyariatkan dan menegaskan apa yang Dia inginkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِلَّا مَا شَاءَ اللَّهُ ۚ } Kecuali apa yang dikehendaki oleh Allah ﷻ { إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَىٰ } Karena sesungguhnya Dia mengetahui apapun yang nampak, apa saja yang kamu nampakkan dihadapan orang lain, baik itu yang mereka dengarkan ataupun yang terlihat jelas oleh mata mereka, dan Allah juga mengetahui apa yang kamu sembunyikan atau yang kamu rahasiakan, Allah ﷻ maha mengetahui apa yang kamu sembunyikan di dadamu, sebagus apapun kamu berusaha menyembunyikan sesuatu dari hadapan manusia, tetapi Allah ﷻ pasti mengetahuinya, karena segala sesuatu dihadapan Allah ﷻ adalah jelas. Manusia berusaha menyembunyikan segala sesuatu yang ia anggap rahasia pribadi dan tidak berbicara tentang hal itu kepada orang banyak, akan tetapi rahasia itu tidak akan bisa disembunyikan dari hadapan dan pengawasan Allah ﷻ, oleh karena itu setiap muslim harus memperbaiki drinya dihadapa Allah ﷻ, baik itu secara zohir maupun batin, begitupun kepada sesama hamba Allah, karena sesungguhnya Allah ﷻ maha mengetahui apa yang kamu sembunyikan dan apa yang kamu tampakkan, Allah ﷻ berfirman : { وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ } ( Dan Allah Maha Mengetahui isi hati. ) [ Ali Imran : 155 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta'ala: إِنَّهُ يَعْلَمُ الْجَهْرَ \" Sesungguhnya Dia mengetahui yang terang \" Maknanya: Bahwa Allah Ta'ala mengetahui yang terang, yang terang adalah perbuatan-perbuatan yang diperlihatkan oleh manusia dan yang diucapkan hingga terdengar, وَمَا يَخْفَى \" dan yang tersembunyi.\" Yakni yang tersembunyi tidak terlihat, maka sungguh Allah mengetahuinya sebagaimana Allah Ta'ala berfirman: وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ \" Dan sesungguhnya Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya,\"(QS. Qaf: 16) Dialah Allah 'Azza Wa Jalla yang mengetahui yang terlihat dan yang tersembunyi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 7: 6-7. Kemudian Allah kabarkan bahwa Nabi Allah (Muhammad ﷺ ) akan membacakan Al Qur’an ini sampai ia hafal di dalam dadanya dan tidak lupa; Sebab Allah melindunginya dari lupa/kelupaan terhadapan ayat Al Qur’an. Dan Allah kecualikan bagi yang ingin Allah ganti (secara hukum dalam ayat) dengan mengganti ayat Al-Qur’an dengan cara menghapusnya (nasakh hukumnya) dimana Allah akan jadikan ia lupa, sebagaimana Allah berfirman : “Ayat mana saja yang Kami nasakhkan, atau Kami jadikan (manusia) lupa kepadanya, Kami datangkan yang lebih baik daripadanya atau yang sebanding dengannya. Tidakkah kamu mengetahui bahwa sesungguhnya Allah Maha Kuasa atas segala sesuatu?” {Al Baqaran : 106}. Allah mengkabarkan bahwa Ia mengetahui apa yang namapak pada seorang hamba dan setiap apa yang ia (hamba) tersebut sembunyikan dari ucapan dan perbuatan, tidak akan perna tersembunyi bagi-Nya apa yang tersembunyi di bumi dan tidak juga di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan membuatmu melupakannya dengan dinaskh (dihapus) baik bacaan maupun hukumnya karena hikmah-Nya yang dalam. Disebutkan dalam tafsir Al Jalaalain, “Sebelumnya Nabi shallallahu 'alaihi wa sallam mengeraskan suaranya bersamaan suara Jibril karena takut lupa, seakan-akan dikatakan kepada Beliau, “Janganlah engkau terburu-buru dengannya, karena engkau tidak akan lupa. Oleh karena itu, jangan membebani dirimu dengan mengeraskan suara, karena sungguh, Dia mengetahui yang terang dan yang tersembunyi.” Baik ucapan maupun perbuatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 7",
    "description": "Allah akan terus menjaga hafalan Al-Qur'an nabi, kecuali jika Allah menghendaki untuk menghapus hafalan itu dari hatinya. Hal ini membuktikan Al-Qur'an bukan ucapan nabi, melainkan kalam Allah. Hal ini juga membuktikan bahwa hafalan Al-Qur'an nabi merupakan anugerah-Nya semata. Sungguh dia yang berbuat demikian adalah tuhan yang mengetahui yang terang dan yang tersembunyi, di antaranya hafalan dalam hati nabi. 8. Dan kami akan menuntunmu dan memudahkan bagimu ke jalan kemudahan. Kami mudahkan langkahmu menuju kemudahan, seperti menjalankan syariat islam, mengemban risalah, serta mencapai kebahagiaan dunia dan akhirat."
  }
]