[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami memudahkanmu kepada yang mudah dalam segala urusan mu, termasuk dalam hal ini adalah pemudahan tugas-tugas risalah, dan menjadikan agamamu mudah, tidak ada kesulitan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan Kami mudahkan bagimu untuk melakukan perbuatan yang diridai Allah, yang memasukkanmu ke dalam Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Setelah Allah menegaskan penjagaan-Nya bagi al-Qur’an, maka Allah menyiapkan Rasulullah untuk menegakkan syariat dan memudahkannya bagi orang yang beriman kepadanya, dan memudahkan untuk mendapatkan kebaikannya di dunia dan di akhirat. Allah memberi taufik kepada Rasulullah berupa syariat yang lurus dan mudah dilaksanakan; sebagaimana disebutkan dalam hadits bahwa Rasulullah tidaklah menghadapi dua pilihan melainkan akan memilih yang paling mudah di antara keduanya. (Diriwayatkan oleh al-Hakim dan dishahihkan dan disepakati oleh adz-Dzahabi, dalam kitab al-Mustadrak, bab Tarikh-tarikh, no. 4220, 2/670)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَنُيَسِّرُكَ لِلْيُسْرَىٰ (dan Kami akan memberi kamu taufik ke jalan yang mudah) Yakni Kami akan memudahkanmu untuk melaksanakan amalan yang mengarahkan ke surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kami memudahkan kalian dalam menjalankan perintah agama dan memudahkan urusan dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami akan melapangkan bagimu jalan kemudahan} Kami memudahkan untukmu amal penghuni surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 8 “Dan kami akan memberimu taufik kepada jalan yang mudah,” ini juga berita gembira lainnya. Allah  mempermudah RasululNya dalam berbagai urusan dan Allah  mempermudah syariat dan AgamaNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Syari'at islam telah Allah mudahkan bagi para pemeluk agama islam, semua dimudahkan oleh-Nya yang tidak ada keraguan dan kesukaran didalamnya, Allah ﷻ berfirman : { وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ } ( dan Dia sekali-kali tidak menjadikan untuk kamu dalam agama suatu kesempitan ) [ Al-Hajj : 78 ] , sekalipun kamu menemukan kesulitan dalam syari'at ini dan kamu belum mampu menjalankannya, maka ada \"Rukhsoh\" keringanan yang syaria't tetapkan dan tentungan dengan faktor yang diterima oleh syari'at itu sendiri, yaitu keringanan yang Allah ﷻ tetapkan untuk hamba-Nya sesuai keadaan yang mereka hadapi, Allah ﷻ berfirman : { لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا } ( Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. ) [ Al-Baqarah : 286 ], sesunguhnya agama ini mudah, Sebagaimana yang juga disabdakan oleh Rasulullah : (( إِنَّ الدِّينَ يُسْرٌ ، وَلَنْ يُشَادَّ الدِّينَ أَحَدٌ إِلاَّ غَلَبَهُ )) \" “Sesungguhnya agama itu mudah, dan sekali-kali tidaklah seseorang memperberat agama melainkan akan dikalahkan \" [ DIriwayatkan oleh Imam Bukhori ( 39 ) dari hadits Abu Hurairoh ] , dalam hadits lain Rasulullah ﷺ bersabda : (( مَا خُيِّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَمْرَيْنِ إِلَّا أَخَذَ أَيْسَرَهُمَا مَا لَمْ يَكُنْ إِثْمًا )) \" “Tidaklah Rasulullah –shallallahu ‘alaihi wa sallam- diberikan dua pilihan kecuali beliau memilih yang paling mudah selama tidak mengandung dosa \" [ Diriwayatkan oleh Imam Bukhori ( 3560 ) , Imam Muslim ( 2327 ) dari hadits Aisyah -Radhiyallahu'anha- , agama ini dibangun diatas segala kemudahan dan keringanan, berbeda dengan umat-umat sebelum umat Nabi Muhammad yang syari'at mereka sangat keras memberikan hukuman terhadap kekufuran yang mereka perbuat, yaitu diharamkan bagi mereka berbagai macam hal yang sebenarnya tidak haram dalam syari'at, hal itu ditetapkan sebagai hukuman bagi pelaku kekafiran, mereka membangkan dalam agama maka Allah ﷻ pun menghukum mereka dengan hukuman yang berat, Allah ﷻ mempersempit urusan mereka didunia, Allah ﷻ berfirman : { فَبِظُلْمٍ مِنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ أُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَنْ سَبِيلِ اللَّهِ كَثِيرًا , وَأَخْذِهِمُ الرِّبَا وَقَدْ نُهُوا عَنْهُ وَأَكْلِهِمْ أَمْوَالَ النَّاسِ بِالْبَاطِلِ ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ مِنْهُمْ عَذَابًا أَلِيمًا } ( Maka disebabkan kezaliman orang-orang Yahudi, kami haramkan atas (memakan makanan) yang baik-baik (yang dahulunya) dihalalkan bagi mereka, dan karena mereka banyak menghalangi (manusia) dari jalan Allah , Dan disebabkan mereka memakan riba, padahal sesungguhnya mereka telah dilarang daripadanya, dan karena mereka memakan harta benda orang dengan jalan yang batil. Kami telah menyediakan untuk orang-orang yang kafir di antara mereka itu siksa yang pedih. ) [ Al-Baqarah : 160 - 161 ] , Allah ﷻ menekankan kepada mereka dengan sangat ketat, akan tetapi dengan agama ini Allah ﷻ memberikan keringanan bagi hamba-Nya, Dia ﷻ mengangkat dari hamba-Nya berbagai macam kesukaran dan belenggu-belenggu yang menyebabkan hamba-Nya sulit dalam menjalankan ibadah, Allah ﷻ berfirman : { وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ } ( dan Dia sekali-kali tidak menjadikan untuk kamu dalam agama suatu kesempitan ) [ Al-Hajj : 78 ] , { فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ } ( Maka bertakwalah kamu kepada Allah menurut kesanggupanmu ) [ At Taghabun : 16 ] , Itulah kemudahan yang Allah berikan kepada hamba-Nya, Maha suci Allah dengan segala Rahmat-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَنُيَسِّرُكَ لِلْيُسْرَى \"\" Ini juga termasuk janji Allah Azza Wa Jalla bagi Rasul-Nya shallallaahu 'alaihi wa sallam bahwa ia akan memudahkannya untuk kemudahan, dan kemudahan di sini adalah perkara-perkaranya akan dimudahkan, terlebih dalam ketaatan kepada Allah 'Azza Wa Jalla, setelah Nabi 'alaihissholaatu wassalaam mengabarkan bahwa tidak ada seorang pun dari manusia melainkan telah ditulis tempat duduknya di surga dan tempat duduknya di neraka. Semua anak-anak adam tertulis tempat duduknya di surga jika ia termasuk penduduk surga dan tempat duduknya di neraka jika ia penduduk neraka, para shabat berkata: \" Wahai Rasulullah tidakkah kami meninggalkan amalan saja dan bersandar –maksudnya kepada yang telah tertulis- \" Rasulullah bersabda: لَا، اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ فَأَهْلُ السَّعَادَة يُيَسَّرُونَ لِعَمَلِ أَهْلِ السَّعَادَةِ وَأَهْلُ الشَّقَاوَةِ يُيَسَّرونَ لِعَمَلِ أَهْلِ الشَّقَاوَةِ \" Jangan, beramalah, semuanya dimudahkan sesuai dengan penciptaanya, orang yang berbahagia akan dimudahkan untuk mengamalkan amalan orang-orang yang bahagia, dan orang yang sengsara akan dimudahkan untuk mengamalkan amalan orang-orang yang sengsara, kemudian beliau membaca firman Allah Ta'ala: فَأَمَّا مَنْ أَعْطَى وَاتَّقَى (5) وَصَدَّقَ بِالْحُسْنَى (6) فَسَنُيَسِّرُهُ لِلْيُسْرَى \" Adapun orang yang memberikan (hartanya di jalan Allah) dan bertakwa,. dan membenarkan adanya pahala yang terbaik (surga), maka Kami kelak akan menyiapkan baginya jalan yang mudah.\"(QS. Al-Lail\" 5-7) \" Hadits ini pematah argumentasi orang yang berargumen dengan taqdir untuk membolehkan berbuat kemaksiatan-kemaksiatan kepada Allah, ia bermaksiat kepada Allah dan mengatakan: Ini telah tertulis untukku, ini bukanlah alas an (yang sah) katena Rasulullah 'alaihissholaatu wassalaam bersabda: \"Beramalah karena setiap orang akan dimudahkan sesuai dengan ciptaannya\" Apakah ada seseorang yang menghalangimu untuk beramal shaleh jika anda menginginkannya? Selamanya tidak ada. Apakah ada seorang yang memaksamu untuk bermaksiat jika anda tidak menginginkannya? Selama tidak ada, oleh karena itu jika ada orang yang memaksamu untuk berbuat kemaksiatan maka anda tidak akan mendapatkan dosa, dan anda tidak akan dikenakan sangsi seperti orang yang melakukannya berdasarkan pilihannya sendiri, walau pun itu adalah kekufuran sedangkan itu adalah dosa terbesar, Allah Ta'ala berfirman di dalamnya: مَنْ كَفَرَ بِاللَّهِ مِنْ بَعْدِ إِيمَانِهِ إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالْإِيمَانِ وَلَكِنْ مَنْ شَرَحَ بِالْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِنَ اللَّهِ وَلَهُمْ عَذَابٌ عَظِيمٌ \" Barang siapa yang kafir kepada Allah sesudah dia beriman (dia mendapat kemurkaan Allah), kecuali orang yang dipaksa kafir padahal hatinya tetap tenang dalam beriman (dia tidak berdosa), akan tetapi orang yang melapangkan dadanya untuk kekafiran, maka kemurkaan Allah menimpanya dan baginya azab yang besar.\"(QS. An-Nahl: 106) Dengan begitu, kita katakana: Beramallah wahai manusia, lakukanlah kebaikan dan jauhilah keburukan, hingga Allah memudahkanmu memperoleh kemudahan, dan menjauhkanmu dari kesulitan. Rasulullah shallallahu 'alaihi wa sallam Allah Janjikan kepadanya dimudahkan memperoleh jalan kepada kemudahan, maka perkara-perkara menjadi mudah baginya, oleh kerananya Nabi shallallaahu 'alaihi wa sallam tidak pernah mendaparkan kesulitan dan himpitan kecuali ia mendapatkan jalan keluarnya 'alaihissholaatu wassalaam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 8: Kemudian Allah kabarkan kepada Nabi-Nya (Muhammad ﷺ) bahwa Ia (Allah) akan mengokohkannya di atas (petunjuk) syariat yang diridhai, dan Allah jadikan ia sebagai penjaga wahyu yang ia bawa. Dan Allah juga akan mudahkan untuknya dalam mengajarkan (Al-Qur’an) dan menyampaikannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu syariat Islam yang merupakan syariat yang paling mudah bagi manusia dan membawa mereka kepada kebahagiaan di dunia dan akhirat. Syaikh As Sa’diy berkata, “Ini juga merupakan kabar gembira yang besar, bahwa Allah Subhaanahu wa Ta'aala akan memudahkan Rasul-Nya shallallahu 'alaihi wa sallam kepada kemudahan dalam semua urusannya, dan Dia menjadikan syariat dan agama-Nya mudah.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 8",
    "description": "Dan kami akan menuntunmu dan memudahkan bagimu ke jalan kemudahan. Kami mudahkan langkahmu menuju kemudahan, seperti menjalankan syariat islam, mengemban risalah, serta mencapai kebahagiaan dunia dan akhirat. 9. Oleh sebab itu, berikanlah kaummu peringatan dengan Al-Qur'an yang kami wahyukan dan mudahkan kepadamu, karena peringatan itu bermanfaat. Tugas nabi semata memberi peringatan, sedangkan hasilnya tergantung pada kemauan masing-masing individu yang mendengar peringatan itu untuk mengikuti atau menolak."
  }
]