[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-10. Maka nasihatilah kaummu (wahai rasul) menurut apa yang kami mudahkan kepadamu dari apa yang di wahyukan kepadamu, bimbinglah mereka kepada apa yang menjadi kebaikan kepada mereka, khususkanlah nasihat kepada orang orang yang diharapkan mau menerimanya,jangan melelahkan dirimu dengan mengingatkan orang yang mana peringatan hanya membuatnya menentang dan menjauh. Orang yang takut kepada tuhannya akan mau menerima nasihat"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Maka nasihatilah manusia dengan apa yang telah Kami wahyukan kepadamu dari Al-Qur`ān dan ingatkanlah mereka selama peringatan itu masih didengarkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah memerintahkan nabi-Nya untuk senantiasa menyampaikan risalah, dengan memberi peringatan kepada seluruh manusia. Adapun orang-orang yang akan menerima peringatan atau yang akan menolaknya adalah perkara yang hanya Allah yang mengetahui; dan akan ada orang yang tidak mendapat manfaat dari peringatan itu. Peringatan ini akan bermanfaat bagi orang beriman dan akan menjadi hujjah atas orang kafir, dan tidak akan ada suatu genarasi di bumi melainkan pasti ada di antara mereka yang masih mendengar dan mendapat manfaat dari peringatan tersebut, meskipun generasi itu sangat rusak dan keras hatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. فَذَكِّرْ إِن نَّفَعَتِ الذِّكْرَىٰ (oleh sebab itu berikanlah peringatan karena peringatan itu bermanfaat) Hai Muhammad, berilah peringatan kepada manusia dengan wahyu yang telah Kami berikan kepadamu, dan berilah mereka petunjuk kepada jalan-jalan kebaikan serta kepada syariat-syariat agama. Dan ini jika sekiranya peringatan bermanfaat bagi mereka, adapun bagi orang yang telah diperingatkan dan dijelaskan kepadanya kebenaran dengan seterang-terangnya, namun ia tetap menuruti hawa nafsunya serta terus menerus bermaksiat maka tidak perlu kamu peringatkan lagi. Hal ini berlaku pada pengulangan peringatan itu, adapun peringatan yang pertama kali disampaikan harus ditujukan kepada semua orang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1) . Berilah peringatan sekiranya itu bermanfaat, dari sini dapat disimpulkan bahwa salah satu adab dalam menyampaikan ilmu, adalah menempatkan ilmu tersebut pada proporsinya yakni sampaikanlah ilmu itu kepada mereka yang dapat memanfaatkan ilmu tersebut. 2) . { فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَىٰ } Dari ayat ini dapat difahami bahwa, ketika peringatan itu dapat berdampak pada hal-hal yang buruk, maka menyampaikan peringatan itu wajib ditinggalkan, dikarenakan keburukan yang lebih besar akan terjadi. 3) . Salah satu kesalahan yang sering terjadi adalah ketika seseorang menjadikan ayat ini sebagai alasan untuk meninggalkan kewajiban berdakwah, tanpa melihat kepada ayat lain yang menjelaskan bahwasanya peringatan bermanfaat bagi orang-orang beriman : { وَذَكِّرْ فَإِنَّ الذِّكْرَىٰ تَنْفَعُ الْمُؤْمِنِينَ } ( Dan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman. ) [ Az-Zariyat : 55 ] . Maka berdakwah itu sangatlah bermanfaat baik untuk saat ini ataupun masa yang akan datang, akan tetapi terkadang ada perkara yang menyebabkan kewajiban itu itu harus di akhirkan dan tentunya dengan hikmah yang baik, oleh karena itu ada baiknya kita menggabung antara dua ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Oleh karena itu, berikanlah peringatan dan ajarkan kepada mereka jalan yang lurus dengan Alquran wahai Nabi. Apabila peringatan itu bermanfaat, maka orang-orang itu hatinya akan terbuka untuk taat dan takut kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka sampaikanlah peringatan} berilah beringatan dengan menggunakan Al-Qur'an {jika peringatan itu} pelajaran dan peringatan itu {bermanfaat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 9-13 “Oleh sebab itu berikanlah peringatan,” akan syariat dan tanda-tanda kebesaranNya. “Karena peringatan itu bermanfaat,” yakni selama peringatan diterima, dijadikan petuah dan didengar, baik apakah seluruh maksud dari peringatan tercapai atau sebagiannya saja. Kentekstual ayat, bila peringatan tidak membawa guna, misalnya hanya menambah keburukan atau bisa mengurangi kebaikan, maka peringatan tidak diperintahkan, bahkan terlarang. Dalam peringatan, manusia terbagi menjadi dua: Orang-orang yang memanfaatkan dan orang-orang yang tidak memanfaatkan. Orang-orang yang memanfaatkan peringatan disinggung oleh Allah  dalam firmanNya, “orang yang takut (kepada Allah) akan mendapatkan pelajran,” karena takut kepada Allah  Dan mengetahui balasan-balasan yang akan diberikan Allah  atas berbagai perbuatan akan menghentikan seseorang dari apa yang dibenci Allah  serta mendorongnya untuk melakukan kebaikan. Sedangkan mereka yang tidak memanfaatkan peringatan, Allah  menyinggung mereka dengan firmanNya, “Orang-orang yang celaka (kafir) akan menjauhinya. (Yaitu) orang yang akan memasuki api yang besar (neraka),” yaitu neraka yang dinyalakan yng mrerasuk hingga ke hati. “Kemudian dia tidak mati di dalamnya dan tidak juga hidup,” yakni disiksa dengan siksaan yang pedih tanpa jeda dan istiraha hingga mereka mengharapkan bisa mati, tapi harapan mereka tidak aka ada gunanya. Hal itu semakna dengan firman Allah , “Mereka tidak dibinasakan ssehiingga mereka mati dan tidak (pula) diringankan dari mereka azabnya.” (Fatir: 36)."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَذَكِّرْ } Kemudian Allah ﷻ memerintahkan kepada Rasul-Nya untuk memberi peringatan kepada umat manusia tentang Tuhan mereka, ingatkanlah mereka tentang hari pembalasan, peringatilah mereka tentang hari akhir, peringatan tentang kematian, hari pembalasan, hari perhitungan amal, peringatilah mereka tentang wujudnya surga dan neraka, ini perintah dari sang Maha kuasa kepada Rasul-Nya untuk disampaikan kepada ummatnya. { إِنْ نَفَعَتِ الذِّكْرَىٰ } Apakah peringatan itu terkadang tidak memberi manfaat ? ataukah justru mereka yang mendapat peringatan itu tidak ingin menerima peringatan ? , dalam hal ini ulama tafsir berselisih dalam dua pendapat : Pendapat pertama mengatakan : { إِنْ نَفَعَتِ الذِّكْرَىٰ } Jika peringatan itu tidak bermanfaat maka berlepas dirilah kamu dari kewajiban itu, karena apapun yang kamu sampaikan tidak memberikan hasil apapun, dan itu jika orang-orang kuffar dan para kaum fasik berpura-pura buta atau tuli sehingga mereka merasa tidak menerima apapun dari peringatan itu, oleh karena itu bagi pemberi peringatan hanya berkewajiban menyampaikan peringatan itu jika ada manfaat dan keuntungan dari peringatannya, karena sesungguhnya mereka yang membagkang dan membantah agama ini sama sekali tidak ingin menerima dakwah dan peringatan yang disampaikan oleh Rasul, mereka menyombongkan diri dan hisab mereka akan kembali kepada Allah ﷻ . Pendapat yang kedua mengatakan : { إِنْ نَفَعَتِ الذِّكْرَىٰ } Dakwah dan itu peringatan itu tetap harus disampaikan secara meluas, walaupun banyak yang menentang akan tetapi diantara mereka masih ada yang mau menerima peringatan itu dan kembali kepada tuhannya, sebagaimana yang Allah ﷻ katakan di ayat selanjutnya : { سَيَذَّكَّرُ مَنْ يَخْشَىٰ } ( Orang yang takut (kepada Allah) akan mendapat pelajaran ) [ Al A'la : 10 ] , mereka yang takut kepada Allah akan mengambil pelajaran dari peringatan itu dan akan kembali kepada Tuhanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah memerintahnya untuk memberi peringatan, Allah berfirman: فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَى \" oleh sebab itu berikanlah peringatan jika peringatan itu bermanfaat \" Yakni: Berilah peringatan kepada manusia, berilah peringatan dengan menyebutkan ayat-ayat Allah, berilah peringatan dengan hari-hari Allah, berilah mereka nasehat إِنْ نَفَعَتِ الذِّكْرَى \" jika peringatan itu bermanfaat \" Yakni: ketika peringatan itu bermanfaat bagi mereka, dengan demikian maka إِنْ in disini adalah syarthiyah, maknanya: Jika peringatan itu bermanfaat maka berilah peringatan, dan jika tidak bermanfaat maka janganlah memberi peringatan, karena tidak ada faedah dalam memberikan peringatan kepada suatu kaum yang kita tahu bahwa mereka tidak akan mengambil manfaat darinya, inilah yang dijelaskan berkaitan dengan ayat ini. Sebagaian ulama mengatakan: Maknanya: Berilah peringatan bagaimana pun keadaannya, jika peringatan itu bermanfaat bagi mereka, sehingga syarat (dalam bahasa arab) di sini maksudnya bukan berarti meninggalkan peringatan kecuali ketika peringatan bermanfaat, tetapi maknanya: berilah peringatan jika peringatan itu bermanfaat bagi mereka. maka maknanya menurut pendapat ini adalah berilah peringatan bagaimana pun keadaan mereka, peringatan itu akan bermanfaat, bermanfaat bagi orang-orang yang beriman, bermanfaat bagi yang memberikan peringatan juga. Orang yang memberikan peringatan akan selalu mendapatkan menfaat, dan orang yang diberi peringatan jika bermanfaat baginya peringatan itu maka dia adalah mukmin dan jika tidak maka itu tidak akan mengurangi pahala orang yang memberikan peringatan, maka berilah peringatan baik peringatan itu akan bermanfaat ataupun tidak. Sebagian ulama mengatakan: Jika ia mengetahui bahwa peringatan itu akan bermanfaat maka wajib disampaikan, dan jika ia mengira bahwa peringatan itu tidak akan bermanfaat maka jika ia menghendaki, maka sampaikanlah dan jika tidak maka tidak disampaikan. Tatapi yang terpenting adalah kita katakana: Harus memberikan peringatan walau pun anda mengira itu tidak akan bermanfaat, karena itu akan memberikan manfaat kepadamu, dan agar orang-orang tahu bahwa perkara yang anda ingatkan tersebut bisa jadi itu wajib atau itu adalah haram. Jika anda diam saja, sedangkan orang-orang melakukan perkara yang diharamkan. Orang-rang akan berkata: Seandainya ini adalah perkara yang diharamkan maka pasti para ulama sudah mengingatkannya, ataua jika perkara ini wajib pasti para ulama sudah mengingatkannya. Maka memberi peringatan itu harus, menyebarkan syari'at itu haru, baik akan bermanfaat atau pun tidak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-A’la ayat 9: 9-10. Kemudian Allah perintahkan Nabi-Nya ﷺ agar terus menerus memperingatkan manusia dengan Al Qur’an ini, dan menyampaikan kerisalahan yang datang dari Rabbnya bagi semua makhluk sebagai hukum yang digunakan dan sebagai nasihat-nasihat yang baik. Lalu Allah jelaskan bahwa ia (manusia) akan mengambil (apa yang disampaikan) dari Al-Qur’an ini, bagi siapa yang takut dan takut pula dengan hukuman dari Rabbnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan syariat Allah dan ayat-ayat-Nya. Bisa juga diartikan, “Jika peringatan itu bermanfaat.” Dengan demikian, jika tampaknya tidak bermanfaat, maka tidak perlu memberikan peringatan, terlebih apabila peringatan itu malah membuatnya bertambah melakukan keburukan. Sebagian ulama berkata, “Jika diperkirakan peringatan itu bermanfaat, maka wajib memberi peringatan. Tetapi, jika diperkirakan peringatan itu tidak bermanfaat, maka ia diberi pilihan; jika ia mau; ia memberi peringatan dan jika tidak, maka ia tidak memberi peringatan.” Syaikh Ibnu ‘Utsaimin dalam Tafsir Juz ‘Amma berkata, “Akan tetapi, bagaimana pun juga kita katakan, “Harus memberi peringatan, meskipun anda mengira bahwa peringatan itu tidak bermanfaat, karena kelak akan bermanfaat bagimu, dan kelak manusia akan mengetahui bahwa sesuatu yang engkau peringatkan, bisa wajib atau haram, dan jika engkau mendiamkan manusia, sedangkan mereka mengerjakan yang haram, maka nanti orang-orang akan berkata, “Kalau hal ini memang haram, tentu ulama akan memperingatkannya,” atau, “Kalau hal ini wajib tentu ulama akan mengingatkannya.” Oleh karena itu, harus diberi peringatan dan syariat harus disebarluaskan baik bermanfaat (bagi yang mereka) atau tidak.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-A’la Ayat 9",
    "description": "Oleh sebab itu, berikanlah kaummu peringatan dengan Al-Qur'an yang kami wahyukan dan mudahkan kepadamu, karena peringatan itu bermanfaat. Tugas nabi semata memberi peringatan, sedangkan hasilnya tergantung pada kemauan masing-masing individu yang mendengar peringatan itu untuk mengikuti atau menolak. 10. Orang yang takut kepada Allah dan hari akhir akan mendapat pelajaran dari peringatan itu, ."
  }
]