[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Telah dekat waktu perhitungan manusia atas apa yang telah berlalu dari apa yang mereka perbuat di dunia, walaupun demikian orang-orang kafir masih hidup dalam keadaan lalai terhadap hakikat tersebut dan berpaling dari peringatan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Telah semakin dekat kepada manusia waktu perhitungan amalan mereka pada hari Kiamat, sedangkan mereka masih saja berada dalam keadaan lalai dan berpaling dari Akhirat, lantaran dengan perkara dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Telah dekat waktu perhitungan amal perbuatan manusia sehingga mereka akan mendapat siksaan dan pahalanya, namun mereka dalam keadaan lalai terhadap kejadiannya dan sibuk dengan kenikmatan dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. اقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ (Telah dekat kepada manusia hari menghisab segala amalan mereka) Yakni telah tekat waktu terjadinya hari kiamat, waktu yang tersisa lebih sedikit daripada yang telah berlalu. وَهُمْ فِى غَفْلَةٍ مُّعْرِضُونَ(sedang mereka berada dalam kelalaian lagi berpaling) Itu karena kesibukan mereka dengan kenikmatan kehidupan yang tidak mereka butuhkan, dengan begitu mereka sibuk dengan dunia dari akhirat, dan tidak mempersiapkan kehidupan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Bukhari meriwayatkan dari Ibnu Mas’ud berkata: “Surah Bani Israil, Al-Kahfi, Maryam, Thaha, dan Al-Anbiya’ itu termasuk surah-surah terdahulu dan hartaku yang terdahulu”, yaitu termasuk surah-surah Al-Qur’an yang lebih dahulu dihafalkan. 1. Telah dekat bagi manusia itu masa penghisaban mereka yaitu hari kiamat sedangkan mereka itu disibukkan dengan dunia dan melupakan akhirat serta tidak mau mempersiapkan diri untuk dihisab. Al-Ghaflah asalnya adalah tidak mengingat sesuatu, namun yang dimaksud di sini adalah meninggalkan sesuatu dengan mengabaikan dan melalaikannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Semakin dekat kepada manusia perhitungan (amal) mereka, dan mereka dalam keadaan lengah lagi berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ini adalah bentuk keheranan terhadap kondisi manusia. Mereka itu, tidak mempan dengan peringatan, dan tidak mau mendekat kepada pemberi peringatan. Padahal sebenarnya sudah dekat masa perhitungan amalan dan pembalasan bagi mereka atas amalan mereka yang baik ataupun buruk. Ternyata mereka berada dalam keadaan, “Kelalaian lagi berpaling (dari padanya),” maksudnya lalai dari tujuan penciptaanya, dan berpaling dari peringatan yang disampaikan kepada mereka. Seolah-olah merreka tercipta (semata-mata) untuk dunia saja, dan dilahirkan hanya untuk bersenang-senang saja. Sementara itu, Allah masih senantiasa memperbaharui peringatan dan nasihat terhadap mereka, namun mereka masih saja dalam kondisi lalai dan berpaling."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 1: Ayat ini merupakan ta'ajjub (keanehan) terhadap keadaan manusia yang tetap saja lalai dan berpaling, dan seperti inilah keadaan mayoritas manusia -kecuali orang yang mendapatkan ‘inayah (perhatian) dari Allah-, di mana peringatan dan nasehat tidak bermanfaat bagi mereka, padahal hari penghisaban dan pembalasan terhadap amal mereka telah dekat. Mereka lalai terhadap sesuatu yang karenanya mereka diciptakan (ibadah), dan berpaling dari peringatan. Seakan-akan mereka diciptakan untuk dunia, dan untuk bersenang-senanglah mereka dilahirkan ibu mereka. Namun demikian, Allah Subhaanahu wa Ta'aala senantiasa memperingatkan dan menasehati agar mereka kembali sebagaimana disebutkan dalam ayat selanjutnya, tetapi mereka senantiasa dalam kelalaian lagi berpaling. Tentang maksud ayat ini ada dua pendapat; pertama, bahwa umat ini (umat Nabi Muhammad shallallahu 'alaihi wa sallam) adalah umat terakhir dan rasulnya adalah rasul terakhir, dan kiamat tegak pada umat ini, karena telah dekat penghisabannya jika melihat kepada umat-umat sebelumnya. Rasulullah shallallahu 'alaihi wa sallam bersabda: بُعِثْتُ أَنَا وَ السَّاعَةَ كَهَاتَيْنِ “(Jarak) aku dibangkitan dengan kiamat itu seperti dua jari ini.” Beliau menghubungkan kedua jarinya, yaitu antara jari telunjuk dengan jari setelahnya.” (HR. Ahmad, Bukhari, Muslim dan Tirmidzi) Kedua, maksud dekatnya hisab adalah dekatnya maut, dan bahwa barang siapa mati, maka telah tegak kiamatnya dan telah masuk ke tempat pembalasan amal. Bisa juga maksudnya, lalai terhadap hari kiamat atau kematian. Yakni berpaling dari mempersiapkan diri untuk menghadapi hari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 1",
    "description": "Telah semakin dekat kepada manusia, yang kafir dan yang menyekutukan Allah, perhitungan amal mereka, pada hari kiamat tentang semua yang mereka kerjakan di dunia, sedang mereka dalam keadaan lalai tentang dahsyatnya hari kiamat, karena kesibukan mereka tentang dunia, mereka berpaling dari iman terhadap akhirat. 2. Ingatlah wahai manusia, pada hari ketika kamu melihatnya, goncangan dahsyat pada hari kiamat itu, semua perempuan yang menyusui anaknya akan lalai terhadap anak yang disusuinya, karena terkejut dan panik; dan setiap perempuan yang hamil akan keguguran kandungannya, karena goncangan dahsyat itu; dan kamu melihat manusia dalam keadaan mabuk, seperti orang yang tidak sadar, padahal sebenarnya mereka tidak mabuk tetapi azab Allah yang terjadi pada hari kiamat itu sangat keras dirasakan oleh orang-orang kafir."
  }
]