[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami benar-benar telah menurunkan kepada kalian al-Qur’an ini, didalamnya terdapat faktor-faktor penyebab kemenangan dan kemuliaan kalian di dunia dan akhirat, bila kalian mau mengingatnya. Apakah kalian tidak memahami martabat yang telah Aku utamakan kalian dengannya di atas manusia lainnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sungguh Kami telah menurunkan kepada kalian Al-Qur`ān yang di dalamnya terdapat kemuliaan dan kejayaan bagi kalian bila beriman kepadanya, dan mengamalkan kandungan maknanya, maka apakah kalian tidak juga mengerti tentangnya lalu beriman kepadanya dan mengamalkan kandungannya?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Hai manusia, sungguh Kami telah menurunkan al-Qur’an kepada kalian, di dalamnya terkandung kemuliaan dan kejayaan kalian jika kalian mengamalkan kandungannya; maka tidakkah kalian mau mengikuti kebenaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. لَقَدْ أَنزَلْنَآ إِلَيْكُمْ كِتٰبًا (Sesungguhnya telah Kami turunkan kepada kamu sebuah kitab) Yaitu al-Qur’an. فِيهِ ذِكْرُكُمْ ۖ( yang di dalamnya terdapat sebab-sebab kemuliaan bagimu) Yakni didalamnya terdapat kemuliaan bagi kalian. Pendapat lain mengatakan, yakni terdapat akhlak-akhlak mulia kalian dan amal-amal baik kalian. أَفَلَا تَعْقِلُونَ (Maka apakah kamu tiada memahaminya?) Apakah kalian tidak paham bahwa demikianlah sebenarnya, sehingga kalian mau beriman agar mendapat keutamaan tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Wahai orang-orang Quraisy, sungguh telah Kami turunkan kepada kalian Al-Qur’an yang mengandung peringatan bagi kalian. Apakah kalian tidak memikirkan tentang ayat yang mengandung nasehat dan pelajaran?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menurunkan kepada kalian sebuah kitab} Al-Qur’an {yang di dalamnya terdapat peringatan bagi kalian} di dalamnya terdapat kehormatan dan kemuliaan kalian, jika kalian mempercayainya dan mengamalkan apa yang ada di dalamnya {Apakah kalian tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Maksudnya, “sesungguhnya telah Kami turunkan kepada kamu,” wahai utusan yang dikirimkan kepada mereka, yaitu Muhammad bin Abdullah bin Abdul Muthalib “sebuah kitab,” yang agung dan bacaan yang jelas, “yang di dalamnya terdapat sebab-sebab kemuliaan bagimu,” yaitu kemuliaan, prestise, dan ketinggian martabat kalian. Jika kalian mengingat-ingat kabar-kabar yang otentik yang ada di dalamnya, kemudian kalian meyakini dan menaati kansungan perintah-perintahnya, dan kalian menjauhi kandungan larangan-larangannya, niscaya kemuliaan kalian akan meningkat dan kedudukan kalian akan menjadi agung. “Maka apakah kamu tiada memahaminya,” yaitu perkara-perkara yang bermanfaat bagi kalian dan membahayakan kalian. Bagaimana bisa kalian tidak mengetahui kandungannya yang mencakup ketinggian martabat dan kemuliaan kalian di dunia dan akhirat? Seandainya kalian tida berjalan di atasnya, (malah) menempuh jalan yang lain yang mengakibatkan kehinaan dan kenistaan kalian di dunia dan akhirat serta celaka di dua tempat tersebut, maka ketahuilah bahwa kalian tidak mempunyai akal sehat dan daya nalar yang matang. Ayat ini, buktinya adalah fakta yang telah terjadi. Sesungguhnya orang-orang yang beriman kepada rasul dan orang-orang yang mengingat-ingat al-Quran dari kalangan sahabat dan tabi’in telah menggapai ketinggian kedudukan, hegemoni yang mencengangkan, dan popularitas besar, serta kemuliaan di atas para raja, sebuah sejarah yang telah dimengerti oleh setiap insan. Sebagaimana telah diketahui pula, sejarah yang menimpa orang yang tidak mempedulikan al-Quran sama sekali, tidak mendapatkan petunjuk dan menyucikan diri dengannya, dia mendapatkan kemarahan, kehinaan (dari Allah) dan kotornya (jiwa), serta kesengsaraan. Tida ada akses menuju kebahagiaan dunia dan akhirat kecuali dengan mempelajari kitab ini al-Quran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 10: Di dunia dan di akhirat, jika kamu membenarkan beritanya, mengerjakan perintah-perintah di dalamnya dan menjauhi larangan. Hal ini sebagaimana yang diberikan kepada orang-orang yang beriman kepada Rasulullah shallallahu 'alaihi wa sallam, baik dari kalangan sahabat maupun generasi setelahnya, ketika mereka mempelajari Al Qur’an dan mengamalkannya, Allah memberikan kemuliaan dan ketinggian kepada mereka sebagaimana dapat kita baca dalam sejarah kaum muslimin zaman dahulu. Adapun sekarang, ketika kaum muslimin meninggalkan Al Qur’an, mereka mendapatkan kebalikannya, yaitu kehinaan dan kerendahan. Tentang hal yang memberikan manfaat bagimu dan memadharratkan kamu. Jika kamu sebagai orang yang berakal, tentu kamu akan mendatangi kitab itu dan memberikan perhatian yang dalam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 10",
    "description": "Sungguh, kami telah menurunkan kepada kalian, melalui seorang utusan Allah, sebuah kitab Al-Qur'an, agar menjadi pedoman hidup kalian, yang di dalamnya terdapat peringatan bagi kalian tentang tindakan yang menyelamatkan dan mencelakakan kalian. Maka apakah kalian tidak mengerti tujuan Allah menurunkan kitab Al-Qur'an ini'11. Dan berapa banyak penduduk negeri yang berbuat zalim seperti kaum 'ad dan samud, dengan mengingkari ajaran para rasul yang diutus kepada mereka yang telah kami binasakan dengan azab yang menimpa mereka. Dan kami jadikan generasi yang lain setelah mereka musnah sebagai pengganti."
  }
]