[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang disiksa itu mengalami kepedihan-kepedihan yang diindikasikan oleh rintihan-rintihan mereka, tarikan-tarikan nafas mereka berhembus keluar masuk di dalamnya. Dan di dalam neraka mereka tidak mendengar, dikarenakan beratnya siksaan yang mereka alami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Di dalamnya mereka mengeluarkan napas sangat keras karena kedahsyatan rasa sakit yang mereka derita. Dan di dalam Neraka itu mereka tidak dapat mendengar suara lantaran keras dan ngerinya azab yang menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. لَهُمْ فِيهَا زَفِيرٌ (Mereka merintih di dalam api neraka) Makna (الزفير) adalah suara nafas orang yang banyak masalah. Dan yang dimaksud di sini adalah suara rintihan dan tarikan nafas yang keras. وَهُمْ فِيهَا لَا يَسْمَعُونَ(dan mereka di dalamnya tidak bisa mendengar) Yakni mereka tidak mendengar rintihan orang lain karena keadaan yang sangat mengerikan ketikan itu. Pendapat lain mengatakan maknanya adalah mereka sama sekali tidak dapat mendengar apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Sungguh para penyembah berhala yang berada di neraka Jahanam itu merintih dan terengah-engah karena sangat kekeringan. Dan di dalamnya mereka tidak dapat mendengar apapun karena neraka itu sangat mendidih dan mengerikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka merintih di dalamnya} nafas yang sangat berat sehingga tulang rusuknya mengembung {dan mereka di dalamnya tidak dapat mendengar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. “Mereka merintih didalamnya,” lantaran dahsyatnya siksaan (yang menimpa mereka), “dan mereka di dalamnya tidak bisa mendengar,” mereka tuli, bisu dan buta. Atau tidak dapat mendengarkan suara-suara selain suara diri, karena kerasnya suara didihannya, dahsyatnya rintihan dan kemurkaan neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 100: Karena dahsyatnya azab. Ibnu Abi Hatim menyebutkan, bahwa Ibnu Mas’ud berkata, “Apabila sudah tinggal orang-orang yang kekal di neraka, maka mereka ditaruh ke dalam peti-peti dari api, di dalamnya ada paku-paku dari api, sehingga salah seorang di antara mereka tidak melihat ada orang selainnya yang diazab di neraka,” kemudian Ibnu Mas’ud membacakan ayat, “Mereka merintih dan menjerit di dalamnya (neraka) dan mereka di dalamnya tidak dapat mendengar.” Mereka tuli, bisu dan buta atau maksudnya mereka tidak mendengar selain suara neraka karena besarnya suara gejolaknya, rintihannya dan marahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 100",
    "description": "100. Para penghuni neraka tidak kuat berada di dalamnya. Mereka merintih dan menjerit merasakan penderitaan di dalamnya yang tiada ber-akhir. Dan mereka pun di dalamnya tidak dapat mendengar sedikit pun suara indah, lembut, dan damai yang membawa ketenangan dan kenikmatan. 101. Sungguh, merupakan ketetapan kami yang mutlak, sejak dahulu bagi orang-orang yang telah ada ketetapan yang baik dari kami, yang terpadu dengan pilihan, sikap, dan perbuatan mereka yang baik pula, mereka itu dengan seizin-Nya akan dijauhkan dari neraka."
  }
]