[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang telah ditetapkan dari Kami kebahagiaan yang indah bagi mereka berdasarkan pengetahuan Kami bahwa mereka termasuk dari penghuni surga, mereka itu dijauhkan dari neraka. Mereka tidak akan memasukinya dan tidak berada di dekatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Ketika orang-orang musyrik berkata, \"Sesungguhnya Isa dan para Malaikat yang disembah selain Allah akan masuk Neraka,\" maka Allah berfirman, \"Sesungguhnya orang-orang yang telah ada ketetapan dalam ilmu Kami bahwa mereka adalah orang-orang yang bahagia seperti Isa -'alaihissalām-, maka mereka itu dijauhkan dari Neraka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Orang-orang yang telah Kami janjikan kebaikan kepada mereka adalah orang-orang yang memiliki derajat yang tinggi, dan mereka dijauhkan dari neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. إِنَّ الَّذِينَ سَبَقَتْ لَهُم مِّنَّا الْحُسْنَىٰٓ (Bahwasanya orang-orang yang telah ada untuk mereka ketetapan yang baik dari Kami) Yakni ketetapan yang baik, yaitu kebahagiaan; sehingga mereka beramal dengan amalan penghuni surga. أُو۟لٰٓئِكَ عَنْهَا مُبْعَدُونَ (mereka itu dijauhkan dari neraka) Ketika turun ayat (إنكم وما تعبدون....الاية) Ibnu Zab’ary mendatangi Rasulullah seraya berkata: “Hai Muhammad, bukankah kamu telah mengatakan bahwa ‘Aazar adalah lelaki yang shalih, Isa adalah lelaki shalih, dan Maryam adalah wanita shalihah?” Rasulullah menjawab: “benar, aku telah mengatakan demikian.” Lalu Ibnu Zab’ary berkata: “Namun para malaikat, Isa, ‘Aazar, dan Maryam, mereka semua dijadikan sesembahan selain Allah, jadi apakah mereka juga di neraka?” Maka Allah menurunkan ayat إِنَّ الَّذِينَ سَبَقَتْ لَهُم مِّنَّا الْحُسْنَىٰ sampai akhir ayat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika kita memperhatikan firman Allah : { إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنَىٰ أُولَٰئِكَ عَنْهَا مُبْعَدُونَ } \"Bahwasanya orang-orang yang telah ada untuk mereka ketetapan yang baik dari Kami, mereka itu dijauhkan dari neraka\" lalu ditambahkan dengan ayat lain : { لَا يَسْتَوِى مِنكُم مَّنْ أَنفَقَ مِن قَبْلِ ٱلْفَتْحِ وَقَٰتَلَ ۚ أُو۟لَٰٓئِكَ أَعْظَمُ دَرَجَةً مِّنَ ٱلَّذِينَ أَنفَقُوا۟ مِنۢ بَعْدُ وَقَٰتَلُوا۟ ۚ وَكُلًّا وَعَدَ ٱللَّهُ ٱلْحُسْنَىٰ } \"Tidak sama di antara kamu orang yang menafkahkan (hartanya) dan berperang sebelum penaklukan (Mekah). Mereka lebih tingi derajatnya daripada orang-orang yang menafkahkan (hartanya) dan berperang sesudah itu. Allah menjanjikan kepada masing-masing mereka (balasan) yang lebih baik\" [ Al-Hadid : 10 ]; maka sudah jelas bahwa para sahabat Rasulullah seluruhnya adalah penghuni surga secara muthlaq; karena Allah telah menjanjikan orang-orang yang dijanjikan kebaikan kepadanya dengan dijauhkan dari api neraka, dan Allah juga mengabarkan bahwa para sahabat baik yang masuk islam sebelum penaklukan kota makkah ataupun setelahnya dijanjikan untuk mereka kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Sesungguhnya orang-orang yang telah memiliki ketetapan baik dari Kami, yaitu surga karena amal mereka sesuai dengan amal ahli surga, maka mereka itu dijauhkan dari neraka Jahanam. Mereka bahagia dengan keimanan mereka yang benar dan ketaatan mereka yang baik. Ibnu Abbas berkata: “Tatkala ayat {Innaku wa Maa ta’budun…} [98], Ibnu Zab’ari berkata:”Matahari, bulan, malaikat dan uzair telah disembah, maka mereka semua berada di neraka bersama tuhan-tuhan Kami” lalu turunlah ayat {Innalladzina sabaqat …}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang telah berlalu bagi mereka sesuatu yang baik dari Kami} sesungguhnya orang-orang mukmin yang telah Kami ketahui sejak zaman azali bahwa mereka termasuk golongan yang berbahagia dengan memasuki surga {maka mereka darinya} dari neraka {akan dijauhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101-102. Masuknya sesembahan kaum musyrikin kedalam neraka, hanyalah patung-patung yang mempuyai rupa atau manusia yang disembah dalam keadaan ridha untuk diibadahi. Adapun al-Masih, Uzair, dan para malaikat dan lainnya yang disembah dari kalangan para wali Allah, maka sesungguhnya mereka tidak akan di siksa di dalamnya (neraka). Mereka justru masuk ke dalam makna Firman Allah, “Sesungguhnya orang-orang yang telah ada (untuk mereka) ketetapan yang baik dari Kami,” maksudnya orang-orang sudah terlebih dahulu ketetapan kebahagiaannya terdapat di dalam ilmu Allah dan Lauh Mahfuzh serta dalam kemudahan yang mereka jumpai di dunia untuk melakukan usaha-usaha yang baik dan amalan-amalan shalih. “Mereka itu darinya,” yaitu dari neraka “dijauhkan,” mereka tidak memasukinya, dan tidak berada di dekatnya. Bahkan mereka ditempatkan di tempat yang sangat jauh darinya sehingga tidak mendengarkan gemuruhnya dan menyaksikan kondisinya. “Dan mereka kekal dalam menikmati apa yang diingini oleh mereka,” berupa berbagai jenis makanan, minuman, pasangan hidup, panorama indah yang tidak pernah disaksikan oleh mata penglihatan, atau di dengar oleh telinga ataupun terbetik di hati seseorang. Kenikmatan itu berlangsung kontinu untuk mereka, dan akan bertambah indah seiring perjalanan masa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 101: Yakni orang-orang yang telah dicatat tergolong orang-orang bahagia dalam ilmu Allah, dalam Al Lauhul Mahfuzh, sehingga dimudahkan-Nya mereka di dunia mengerjakan amal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 101",
    "description": "101. Sungguh, merupakan ketetapan kami yang mutlak, sejak dahulu bagi orang-orang yang telah ada ketetapan yang baik dari kami, yang terpadu dengan pilihan, sikap, dan perbuatan mereka yang baik pula, mereka itu dengan seizin-Nya akan dijauhkan dari neraka. 102. Berbeda dengan penghuni neraka yang tidak mendengar sedikit pun suara lembut yang membawa ketenangan dan kedamaian; para penghuni surga berada dalam kenikmatan. Mereka tidak mendengar bunyi desis api neraka yang menakutkan, dan mereka pun kekal dalam menikmati semua yang mereka ingini."
  }
]