[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka tidak akan mendengar suara kobaran apinya dan terbakarnya tubuh-tubuh (penghuni neraka) di dalamnya. Sesungguhnya Mereka menempati tempat tinggal mereka di surga, dan mereka berada dalam kondisi yang disukai oleh jiwa-jiwa mereka, berupa kenikmatan dan kelezatan hidup abadi di dalamnya selama-lamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Suara desis api neraka Jahanam tidaklah sampai ke telinga mereka, dan mereka kekal dalam menikmati kenikmatan dan kelezatan hidup yang diingini oleh diri mereka, kenikmatan ini tidaklah terputus dari mereka selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. لَا يَسْمَعُونَ حَسِيسَهَا ۖ (mereka tidak mendengar sedikitpun suara api neraka) Makna (الحسيس) adalah suara yang kita dengar dari sesuatu yang bergerak tidak jauh dari kita. وَهُمْ فِى مَا اشْتَهَتْ أَنفُسُهُمْ خٰلِدُونَ (dan mereka kekal dalam menikmati apa yang diingini oleh mereka) Di surga terdapat segala yang dikehendaki jiwa dan dinikmati mata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Mereka tidak bisa mendengar suara neraka dan gejolaknya. Dan mereka itu abadi atas sesuatu yang diinginkan oleh diri mereka berupa kenikmatan abadi di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak mendengar} penduduk surga tidak mendengar {desisannya} suara neraka dan gejolaknya {dan mereka kekal dalam sesuatu yang mereka inginkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101-102. Masuknya sesembahan kaum musyrikin kedalam neraka, hanyalah patung-patung yang mempuyai rupa atau manusia yang disembah dalam keadaan ridha untuk diibadahi. Adapun al-Masih, Uzair, dan para malaikat dan lainnya yang disembah dari kalangan para wali Allah, maka sesungguhnya mereka tidak akan di siksa di dalamnya (neraka). Mereka justru masuk ke dalam makna Firman Allah, “Sesungguhnya orang-orang yang telah ada (untuk mereka) ketetapan yang baik dari Kami,” maksudnya orang-orang sudah terlebih dahulu ketetapan kebahagiaannya terdapat di dalam ilmu Allah dan Lauh Mahfuzh serta dalam kemudahan yang mereka jumpai di dunia untuk melakukan usaha-usaha yang baik dan amalan-amalan shalih. “Mereka itu darinya,” yaitu dari neraka “dijauhkan,” mereka tidak memasukinya, dan tidak berada di dekatnya. Bahkan mereka ditempatkan di tempat yang sangat jauh darinya sehingga tidak mendengarkan gemuruhnya dan menyaksikan kondisinya. “Dan mereka kekal dalam menikmati apa yang diingini oleh mereka,” berupa berbagai jenis makanan, minuman, pasangan hidup, panorama indah yang tidak pernah disaksikan oleh mata penglihatan, atau di dengar oleh telinga ataupun terbetik di hati seseorang. Kenikmatan itu berlangsung kontinu untuk mereka, dan akan bertambah indah seiring perjalanan masa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 102: Karena jauhnya mereka dari neraka. Berupa makanan, minuman, perkawinan dan pemandangan, di mana mereka mendapatkan kenikmatan yang belum pernah mereka lihat, belum pernah mereka dengar dan belum pernah terlintas di hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 102",
    "description": "102. Berbeda dengan penghuni neraka yang tidak mendengar sedikit pun suara lembut yang membawa ketenangan dan kedamaian; para penghuni surga berada dalam kenikmatan. Mereka tidak mendengar bunyi desis api neraka yang menakutkan, dan mereka pun kekal dalam menikmati semua yang mereka ingini. 103. Kejutan yang dahsyat ketika bumi dan langit hancur dan ketika manusia bangkit dari alam kubur, tidak membuat mereka, para calon peng-huni surga, merasa sedih, karena mereka berada dalam kenikmatan; dan para malaikat pun akan menyambut mereka dengan ucapan yang menye-nangkan, 'inilah hari kebahagianmu yang telah dijanjikan kepadamu untuk memasuki surga, negeri penuh kedamaian. '."
  }
]