[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "103-104. Kengerian yang luarbiasa tidak menakutkan mereka pada Hari Kiamat. Bahkan malaikat memberikan kabar gembira bagi mereka (dengan berkata), “Ini adalah hari kalian yang dahulu dijanjikan untuk kalian berupa kemuliaan dan balasan baik yang melimpah dari Allah.” Hari ketika Kami melipat langit sebagaimana kertas dilipat-lipat bersama dengan tulisan yang ada padanya. Kami membangkitkan makhluk-makhluk pada hari itu dengan bentuk yang Kami ciptakan mereka pertama kali,sebagaimana ibu-ibu mereka melahirkan mereka. Itu adalah janji Allah yang tidak mengalami pengingkaran. Kami menjanjikannya dengan janji yang pasti Kami tepati. Sesungguhnya Kami selalu melaksanakan apa yang telah Kami janjikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Kengerian pemandangan Neraka tatkala ditimpakan kepada penghuninya tidak membuat mereka takut. Dan para Malaikat akan menyambut mereka dengan ucapan selamat sambil mengatakan, \"Inilah hari yang dijanjikan untuk kalian dan yang diberikan kabar gembira pada kalian -berupa kenikmatan yang bakal kalian dapatkan di dalamnya- sewaktu di dunia.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102-103. Mereka tidak mendengar suara kobaran api neraka yang menyala-nyala, dan mereka akan hidup kekal di dalam surga dan mendapat segala yang mereka inginkan. Kengerian hari kiamat tidak menjadikan mereka bersedih. Dan para malaikat menyambut mereka di pintu-pintu surga: “Ini adalah hari yang dijanjikan bagi kalian ketika di dunia agar kalian mendapat balasan.” Yang dimaksud dengan (ٱلْفَزَعُ ٱلْأَكْبَرُ) ‘kedahsyatan yang besar’ adalah ketika sangkakala ditiup, sebagaimana disebutkan dalam firman Allah: وَيَوْمَ يُنفَخُ فِى ٱلصُّورِ فَفَزِعَ مَن فِى ٱلسَّمَٰوَٰتِ وَمَن فِى ٱلْأَرْضِ إِلَّا مَن شَآءَ ٱللَّهُ Dan (ingatlah) hari (ketika) ditiup sangkakala, maka terkejutlah segala yang di langit dan segala yang di bumi, kecuali siapa yang dikehendaki Allah. (an-Naml: 87). (at-Tafsir as-Shahih 4/257)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ (Mereka tidak disusahkan oleh kedahsyatan yang besar) Yakni huru-hara pada hari kiamat. وَتَتَلَقَّىٰهُمُ الْمَلٰٓئِكَةُ (dan mereka disambut oleh para malaikat) Para malaikat di depan pintu surga memberi mereka selamat seraya berkata: “Inilah harimu yang telah dijanjikan kepadamu pada saat di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Mereka tidak dibayang-bayangi ketakutan besar yang didapatkan setelah tiupan kedua yaitu kengerian hari kiamat. Dan mereka bertemu para malaikat di pintu-pintu dengan mengucapkan salam kepada mereka dan berkata: “Ini adalah hari yang dijanjikan untuk kalian di dunia untuk menerima balasan yang baik”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketakutan yang besar} kengerian yang besar ketika neraka itu ditetapkan kepada penduduknya {tidak membuat mereka sedih} tidak membuat mereka takut {dan para malaikat akan menyambut mereka} dan para malaikat menyambut mereka di pintu-pintu surga, mempersilahkan mereka dan berkata kepada mereka {“Inilah hari kalian yang telah dijanjikan kepada kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. “Mereka tidak disusahkan leh kedahsyatan yang besar (pada Hari Kiamat),” maksudnya tidak membuat mereka tercekam saat manusia mengalami kegalauan yang sangat tinggi. Hal itu terjadi di Hari KIamat. Saat neraka yang mendekat, begitu murka terhadap orang-orang kafir dan para pelaku maksiat. Orang-orang cemas katakutan karenanya. Sementara itu, orang-orang tadi, mereka tidak dirundung oleh kesedihan karena tahu kondisi (baik) yang akan mereka jumpai. Allah telah menurunkan rasa aman kepada mereka dari hal-hal yang mereka takutkan. “Dan mereka disambut oleh para malaikat,” tatkala mereka dibangkitkan dari kubur-kubur mereka dan datang menuju tempat kemuliaan sebagai utusan untuk menyambut mereka dengan hangat seraya berkata “Inilah harimu yang telah dijanjikan kepadamu’.” Hendaknya apa yang dijanjikan Allah untuk kalian menjadi ketenangan pada kalian dan rasa senang kalian semakin besar atas kemuliaan yang ada di hadapan kalian. Hendaknya pula kegembiraan dan keceriaan kalian semakin sering lantaran Allah mengamankan kalian dari berbagai macam sumber rasa takut dan gangguan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 103: Maksudnya, kejutan pada hari kiamat tidaklah membuat mereka sedih dan gelisah. Yang demikian adalah ketika neraka didekatkan kepada manusia, maka ia menampakkan kemarahannya kepada orang-orang kafir dan pelaku maksiat. Ketika itu, manusia terkejut, sedangkan orang-orang mukmin tidak sedih dan gelisah karena mereka mengetahui apa yang akan mereka hadapi dan bahwa Allah akan mengamankan mereka dari kekhawatiran. Ketika mereka bangkit dari kubur. Oleh karena itu, bergembiralah dengan karamah (kemuliaan) yang akan diberikan kepadamu dan bersenanglah karena Allah mengamankan kamu dari hal yang dikhawatirkan dan hal yang tidak diinginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 103",
    "description": "103. Kejutan yang dahsyat ketika bumi dan langit hancur dan ketika manusia bangkit dari alam kubur, tidak membuat mereka, para calon peng-huni surga, merasa sedih, karena mereka berada dalam kenikmatan; dan para malaikat pun akan menyambut mereka dengan ucapan yang menye-nangkan, 'inilah hari kebahagianmu yang telah dijanjikan kepadamu untuk memasuki surga, negeri penuh kedamaian. '104. Oleh karena itu, manusia hendaklah mengingat hari kiamat, yaitu pada hari langit kami gulung seperti menggulung lembaran-lembaran kertas sehingga kehidupan dunia ini hancur. Keadaannya sebagaimana kami memulai penciptaan pertama, ketika kehidupan dunia ini tidak ada. Begitulah kami akan mengulanginya lagi sehingga kehidupan ini pun kembali tidak ada. Hal ini merupakan janji yang pasti kami tepati dengan tepat dan akurat; sungguh, kami akan melaksanakannya, tetapi kami tetap merahasiakan waktunya."
  }
]