[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "103-104. Kengerian yang luarbiasa tidak menakutkan mereka pada Hari Kiamat. Bahkan malaikat memberikan kabar gembira bagi mereka (dengan berkata), “Ini adalah hari kalian yang dahulu dijanjikan untuk kalian berupa kemuliaan dan balasan baik yang melimpah dari Allah.” Hari ketika Kami melipat langit sebagaimana kertas dilipat-lipat bersama dengan tulisan yang ada padanya. Kami membangkitkan makhluk-makhluk pada hari itu dengan bentuk yang Kami ciptakan mereka pertama kali,sebagaimana ibu-ibu mereka melahirkan mereka. Itu adalah janji Allah yang tidak mengalami pengingkaran. Kami menjanjikannya dengan janji yang pasti Kami tepati. Sesungguhnya Kami selalu melaksanakan apa yang telah Kami janjikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Yaitu pada hari di mana Kami menggulung langit seperti menggulung lembaran-lembaran kertas beserta apa yang ada padanya, dan Kami akan mengumpulkan semua makhluk dalam keadaan seperti mereka diciptakan pertama kali. Kami telah membuat suatu janji akan terjadinya peristiwa itu dengan janji yang tak akan diselisihi, sungguh Kami selalu menepati apa yang Kami janjikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Allah menyampaikan kebesaran kekuasaan-Nya di alam semesta dan dalam membangkitkan: Pada hari kiamat Kami akan menggulung langit seperti kertas yang digulung, kemudian Kami akan menghidupkan kembali seluruh makhluk untuk menjalani hisab. Sebagaimana Kami menciptakan mereka pertama kali di dunia dari ketidakadaan, demikianlah Kami akan menghidupkan mereka kembali pada hari kiamat. Sungguh Kami berkuasa untuk melakukan hal itu dan yang semisalnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. يَوْمَ نَطْوِى السَّمَآءَ كَطَىِّ السِّجِلِّ لِلْكُتُبِ ۚ (pada hari Kami gulung langit sebagai menggulung lembaran-lembaran kertas) Makna (السجل) yakni kitab (lembaran-lembaran kertas). Yakni Kami menggulungnya seperti menggulung kertas bersama tulisan yang tertulis di atasnya. Dan ketika al-Qur’an diturunkan pengertian tentang kitab eperti kitab dalam bentuknya sekarang belumlah dikenal, namun pada saat itu masih dalam bentuk lembaran-lembaran yang digulung. Pendapat lain mengatakan makna (السجل) adalah orang yang menulis. كَمَا بَدَأْنَآ أَوَّلَ خَلْقٍ نُّعِيدُهُۥ ۚ( Sebagaimana Kami telah memulai panciptaan pertama begitulah Kami akan mengulanginya) Yakni sebagaimana Kami dahulu mengeluarkan mereka dari perut ibu mereka dalam keadaan tidak beralas kaki, telanjang badan, dan tidak bersunat; seperti itulah Kami akan mengulangi penciptaan mereka di hari kiamat. وَعْدًا عَلَيْنَآ ۚ إِنَّا كُنَّا فٰعِلِينَ(Itulah suatu janji yang pasti Kami tepati; sesungguhnya Kamilah yang akan melaksanakannya) Janji Kami itu pasti akan Kami tepati dan laksanakan, yakni janji mengulangi penciptaan di hari kiamat; sesungguhnya Kami mampu melakukan apa yang Kami kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Ingatlah juga wahai Nabi, tentang hari dimana Kami menggulung langit layaknya menggulung lembaran atas apa yang tertulis di dalamnya. Sebagaimana memulai awal pula penciptaan semua itu dari ketiadaan di dunia, seperti itu juga Kami mengembalikan mereka pada hari kiamat. Sesungguhnya penggulungan ini pasti terjadi, tidak ada yang mustahil tentang hari kembalinya para makhluk dengan dibangkitkan menjadi makhluk baru. Kami menjanjikan hal itu kepada mereka. Kami pasti memenuhi dan menepatinya, yaitu hari pengembalian. Sesungguhnya Kami pasti melakukan apa yang Kami janjikan untuk kalian dan mampu atas apa yang Kami kehendaki."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari ketika Kami menggulung langit seperti gulungan lembaran-lembaran catatan} seperti gulungan lembaran yang ada catatanya {Sebagaimana Kami telah memulai penciptaan pertama, begitulah Kami mengulanginya lagi. Itulah janji Kami. Sesungguhnya Kami akan melaksanakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. Allah mengabarkan bahwa pada Hari Kimata, Dia akan melipat langit-langit kendatipun bentuknya besar dan begitu luas, sebagaimana seorang penulis menutup lembaran-lembaran catatan. Yakni, kertas yang dipakai untuk menulis. Maka, bintang-bintangnya akan jatuh berserakan, matahari dan bulan akan terlipat, tergelincir keluar dari tempat porosnya. “Sebagaimana Kami telah memulai penciptaan pertama begitulah Kami akan mengulanginya.” Maksudnya, pengembalian Kami dalam mencipta seperti permulaan Kami dalam mencipta mereka. Sebagaimana Kami (mampu) memulai penciptaan mereka yang sebelumnya mereka belum menjadi apapun, demikian pula Kami (mampu) mengembalikan mereka (hidup) setelah mati. “Itulah janji yang pasti Kami tepati. Sesungguhnya Kami-lah yang akan melaksanakannya.” Kami akan menjalankan janji Kami, karena kesempurnaan kekuatanNYa, dan bahwa tidak ada sesuatu pun yang mampu mencegahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 104: Allah Subhaanahu wa Ta'aala memberitahukan, bahwa pada hari kiamat Dia melipat langit yang luas dan besar ini seperti melipat atau menggulung lembaran kertas, lalu bintang-bintangnya berserakan, matahari dan bulan dilipat dan menyingkir dari tempatnya. Dari yang sebelumnya tidak ada. Yakni mengulangi kembali penciptaan seperti mengawali penciptaan. Maksudnya, akan melaksanakan janji tersebut karena sempurnanya kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 104",
    "description": "104. Oleh karena itu, manusia hendaklah mengingat hari kiamat, yaitu pada hari langit kami gulung seperti menggulung lembaran-lembaran kertas sehingga kehidupan dunia ini hancur. Keadaannya sebagaimana kami memulai penciptaan pertama, ketika kehidupan dunia ini tidak ada. Begitulah kami akan mengulanginya lagi sehingga kehidupan ini pun kembali tidak ada. Hal ini merupakan janji yang pasti kami tepati dengan tepat dan akurat; sungguh, kami akan melaksanakannya, tetapi kami tetap merahasiakan waktunya. 105. Pada ayat yang lalu Allah menerangkan keadaan orang kafir dan orang beriman di akhirat. Pada ayat ini Allah menerangkan ketetapan-Nya tentang orang-orang yang mewarisi bumi. Dan sungguh, telah kami tulis sebagai suatu ketetapan di dalam zabur, yang diturunkan kepada nabi dawud dan sulaiman, setelah tertulis di dalam az-zikr, yaitu di lauh mahfuz, bahwa bumi ini milik-ku dan akan diwarisi oleh hamba-hamba-ku yang saleh, yaitu sanggup mengelola bumi dan memakmurkannya, mengambil manfaat dari kekayaan alamnya, serta sanggup memimpin masyarakat dan membangunnya dengan mengikuti petunjuk-ku."
  }
]