[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami telah menetapkan di dalam kitab-kitab suci sebelumnya pasca ditulis di Lauhul Mahfuzh, bahwa sesungguhnya bumi itu akan diwarisi oleh hamba-hamba Allah yang shalih yang menjalankan apa yang diperintahkan kepada mereka dan menjauhi perkara yang mereka dilarang melakukannya. Mereka itu adalah umat Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Dan sungguh telah Kami tulis dalam kitab-kitab yang Kami turunkan kepada rasul-rasul setelah Kami menuliskannya dalam Lauḥ Maḥfuẓ; bahwasanya bumi ini akan diwarisi oleh hamba-hamba Allah yang saleh dan beramal ketaatan kepada-Nya, mereka itu lah umat Muhammad -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Sungguh Kami telah menulis dalam kitab-kitab dan Zabur yang Kami turunkan kepada Nabi Dawud setelah ditulis dalam lauhul mahfuhz atau setelah ditulis dalam Taurat bahwa surga akan diwarisi oleh hamba-hamba Allah yang taat yang mengerjakan amal shalih, ini adalah janji bagi mereka di akhirat; adapun bagi mereka di dunia adalah dengan kemenangan Islam di muka bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَلَقَدْ كَتَبْنَا فِى الزَّبُورِ (Dan sungguh telah Kami tulis didalam Zabur) Zabur adalah kitab nabi Daud, yaitu kitab yang berisi kumpulan Mazmur. مِنۢ بَعْدِ الذِّكْرِ (sesudah (Kami tulis dalam) az-zikr) Yakni dalam Taurat. أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِىَ الصّٰلِحُونَ (bahwasanya bumi ini dipusakai hamba-hamba-Ku yang saleh) Terdapat mendapat mengatakan yang dimaksud adalah bumi surga, dengan dalil firman Allah: وقالوا الحمد لله الذي صدقنا وعده وأورثنا الأرض “Dan mereka berkata, “Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami dan telah memberikan tempat ini kepada kami” Pendapat lain mengatakan yang dimaksud adalah negeri Baitul Maqdis. Dan pendapat lain mengatakan ayat ini merupakan kabar gembira bagi umat Nabi Muhammad dengan mewarisi tanah-tanah milik orang-orang kafir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sesungguhnya orang-orang baik yang akan menetap bukan lah mereka yang kuat. 2 ). { وَلَقَدْ كَتَبْنَا فِى ٱلزَّبُورِ مِنۢ بَعْدِ ٱلذِّكْرِ أَنَّ ٱلْأَرْضَ يَرِثُهَا عِبَادِىَ ٱلصَّٰلِحُونَ } \"Dan sungguh telah Kami tulis didalam Zabur sesudah (Kami tulis dalam) Lauh Mahfuzh, bahwasanya bumi ini dipusakai hamba-hamba-Ku yang saleh\" sudah menjadi ketetapan alam, lalu kenapa masih saja orang-orang yang membaca ayat ini selalu berkeluh kesah, bahkah sekalipun keadaan begitu mencekam? : { وَلَوْ يَشَآءُ ٱللَّهُ لَٱنتَصَرَ مِنْهُمْ وَلَٰكِن لِّيَبْلُوَا۟ بَعْضَكُم بِبَعْضٍ } \"Demikianlah apabila Allah menghendaki niscaya Allah akan membinasakan mereka tetapi Allah hendak menguji sebahagian kamu dengan sebahagian yang lain\" [ Muhammad : 4 ], jika bukan kekalahan itu maka kita tidak akan diberikan kemenangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Dan sungguh telah Kami tuliskan dalam kitab Dawud yaitu Zabur setelah (ditulis) di kitab Taurat atau di Lauhil Mahfudz bahwa bumi itu diwariskan untuk hamba-hamba yang shalih, yaitu melakukan keshalihan akhirat dengan bertakwa dan keshalihan dunia dengan memakmurkan bumi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menuliskan di dalam Zabur} kitab-kitab yang diturunkan kepada para nabi {setelah (tertulis) di dalam Lauhil Mahfuz} setelah tertulis di dalam Lauhil Mahfudz {bahwa bumi} tanah surga {akan diwarisi oleh hamba-hambaKu yang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. “Dan sesungguhnya telah Kami tulis di dalam Zabur,” yaitu kitab yang tertulis, maksudnya kitab-kitab yang diturunkan, misalnya Taurat dan lainnya, “sesudah (Kami tulis dalam) Lauh Mahfuzh,” maksudnya, Kami menuliskannnya dalam kitab-kitab yang diturunkan pasca Kami menuliskannya di kitab terdahulu, yaitu Lauh Mahfuzh dan buku induk yang sesuai dengan seluruh catatan takdir yang berlaku di akhir masa dan yang tertulis di dalamnya, “bahwasanya bumi ini,” yaitu hunian surge “dipusakai hamba-hambaKu yang shalih,” yang melaksanakan perintah-perintah dan menauhi larangan-larangan. Mereka itulah orang-orang yang mana Allah akan mewariskan surge-surga kepada mereka. Seperti perkataan para penghuni surge, \"Segala puji bagi Allah yang telah menunjuki kami kepada (surga) ini. Dan kami sekali-kali tidak akan mendapat petunjuk kalau Allah tidak memberi kami petunjuk.\". (Al-A’raf:43) \"dan telah (memberi) kepada kami tempat ini sedang kami (diperkenankan) menempati tempat dalam surga di mana saja yang kami kehendaki.\" (Az-Zumar:74). Dan mengandung kemungkinan bahwa maksudnya adalah menjadikan mereka sebagai para khalifah di bumi ini, dan bahwa Allah mendudukkan orang-orang shalih sebagai penguasa d bumi dan menetapkan mereka sebagai pemiliknya. Seperti Firman Allah \"Dan Allah telah berjanji kepada orang-orang yang beriman di antara kamu dan mengerjakan amal-amal yang saleh bahwa Dia sungguh-sungguh akan menjadikan mereka berkuasa di bumi, sebagaimana Dia telah menjadikan orang-orang yang sebelum mereka berkuasa, dan sungguh Dia akan meneguhkan bagi mereka agama yang telah diridai-Nya untuk mereka, dan Dia benar-benar akan menukar (keadaan) mereka, sesudah mereka berada dalam ketakutan menjadi aman sentosa. Mereka tetap menyembah-Ku dengan tiada mempersekutukan sesuatu apa pun dengan Aku. Dan barang siapa yang (tetap) kafir sesudah (janji) itu, maka mereka itulah orang-orang yang fasik.\" (An-Nur:55)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 105: Yang dimaksud dengan Zabur di sini adalah seluruh kitab yang diturunkan Allah kepada nabi-nabi-Nya. Sebagian ahli tafsir mengartikan dengan kitab yang diturunkan kepada Nabi Daud ‘alaihis salam, sedangkan Adz Dzikr adalah kitab Taurat. Ada pula yang menafsirkan adz dzikr dengan Lauh Mahfuzh. Ada yang menafsirkan dengan surga, dan ada pula yang menafsirkan dengan bumi yang kita tempati ini, yakni bahwa orang-orang saleh akan Allah berikan kekuasaan di muka bumi sebagaimana yang disebutkan dalam surah An Nuur: 55. Yaitu mereka yang mengerjakan perintah dan menjauhi larangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 105",
    "description": "105. Pada ayat yang lalu Allah menerangkan keadaan orang kafir dan orang beriman di akhirat. Pada ayat ini Allah menerangkan ketetapan-Nya tentang orang-orang yang mewarisi bumi. Dan sungguh, telah kami tulis sebagai suatu ketetapan di dalam zabur, yang diturunkan kepada nabi dawud dan sulaiman, setelah tertulis di dalam az-zikr, yaitu di lauh mahfuz, bahwa bumi ini milik-ku dan akan diwarisi oleh hamba-hamba-ku yang saleh, yaitu sanggup mengelola bumi dan memakmurkannya, mengambil manfaat dari kekayaan alamnya, serta sanggup memimpin masyarakat dan membangunnya dengan mengikuti petunjuk-ku. 106. Sungguh, semua kisah para nabi yang disebutkan di dalam surah ini, bahkan di dalam Al-Qur'an ini benar-benar menjadi petunjuk yang lengkap dan pelajaran yang berharga guna mencapai kebahagiaan hidup dunia akhirat bagi orang-orang yang menyembah Allah dengan pikiran, perasaan dan rohani yang bersih."
  }
]