[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dalam nasihat peringatan yang dibaca ini, benar-benar termuat pelajaran yang cukup memadai bagi orang-orang yang beribadah kepada Allah dengan ajaran yang disyariatkanNya bagi mereka dan diridhai Allah pada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Sungguh apa yang Kami turunkan berupa nasihat dan peringatan, benar-benar menjadi petunjuk yang sempurna bagi hamba-hamba yang menyembah Tuhan mereka sesuai yang Dia syariatkan, merekalah yang bisa mendapatkan manfaat dan pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Allah memuji al-Qur’an karena mengandung pelajaran dan ibrah yang cukup bagi orang-orang yang taat dan tunduk kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. إِنَّ فِى هٰذَا لَبَلٰغًا (Sesungguhnya (apa yang disebutkan) dalam (surat) ini, benar-benar menjadi peringatan) Yakni dalam pelajaran dan peringatan yang terdapat dalam surat ini. لِّقَوْمٍ عٰبِدِينَ(bagi kaum yang menyembah (Allah)) Yakni yang sibuk dan peduli dengan beribadah kepada Allah; dan puncak ibadah adalah shalat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Sesungguhnya dalam Al-Qur’an ini dan apa yang Kami sebutkan dalam surah ini terkandung kabar-kabar dan kisah-kisah nabi, serta pelajaran-pelajaran untuk memberi keterangan yang cukup jelas bagi kaum yang takut kepada Allah dan sibuk dalam beribadah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya di dalam ini} Al-Qur’an yang telah Kami turunkan kepada nabi Muhammad SAW {benar-benar terdapat pesan} manfaat yang cukup {bagi kaum yang menyembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. Allah memuji kitabNya yang agung, al-Quran dan menjelaskan kapasitasnya yang sempurna untuk memenuhi segala sesuatu, dan bahwa ia tidak dapat disepelekan begitu saja. Allah berfirman, “Sesungguhnya (apa yang disebutkan) dalam (surat) ini, benar-benar menjadi peringatan bagi kami yang menyembah Allah,” maksudnya mereka menjadikannya tangga untuk sampai kepada Rabb mereka dan menuju tempat kemuliaan milikNYa. Al-Quran mengantarkan mereka menuju cita-cita dan keinginan yang paling penting. Tidak ada tujuan lain bagi kaum abidin (orang-orang yang mengabdikan diri menyembah kepada Allah) yang merupakan makhluk termulia. Karena al-Quran telah berperan menangani hal-hal yang mengenai pengetahuan tentang Allah, nama-nama dan sifat-sifatNya, serta perbuatan-perbuatanNYa, (menangani) menyeru kepada hakikat-hakikat keimanan dan bukti-bukti keyakinan yang berfungsi menjelaskan perintah-perintah dan larangan-larangan seluruhnya, yang mengenalkan kekurangan-kekurangan jiwa dan amalan serta cara-cara yang seharusnya ditempuh dalam masalah-masalah agama yang pelik maupun yang sudah jelas, dan memperingatkan dari cara-cara tipu daya setan dan celah-celah untuk menerobos manusia. Barangsiapa yang belum tercukupi oleh al-Quran, niscaya Allah tidak akan menjadikannya merasa cukup. Dan barangsiapa yang belum tertangani oleh al-Quran, niscaya Allah tidak akan memenuhi kebutuhannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 106: Dengan petunjuk Al Qur’an mereka bisa sampai kepada Allah dan sampai ke surga-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 106",
    "description": "106. Sungguh, semua kisah para nabi yang disebutkan di dalam surah ini, bahkan di dalam Al-Qur'an ini benar-benar menjadi petunjuk yang lengkap dan pelajaran yang berharga guna mencapai kebahagiaan hidup dunia akhirat bagi orang-orang yang menyembah Allah dengan pikiran, perasaan dan rohani yang bersih. 107. Tujuan Allah mengutus nabi Muhammad membawa agama islam bukan untuk membinasakan orang-orang kafir, melainkan untuk menciptakan perdamaian. Dan kami tidak mengutus engkau Muhammad melainkan untuk menjadi rahmat bagi seluruh alam. Perlindungan, kedamaian, dan kasih sayang yang lahir dari ajaran dan pengamalan islam yang baik dan benar."
  }
]