[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidaklah mengutusmu (wahai Rasul) kecuali sebagai rahmat bagi seluruh manusia. Maka barangsiapa beriman kepadamu, niscaya dia akan berbahagia dan selamat, dan barangsiapa tidak beriman, maka dia akan gagal dan merugi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Dan Kami tidaklah mengutus engkau -wahai Muhammad- melainkan sebagai rahmat bagi semua makhluk, disebabkan mulianya sifatmu berupa rasa komitmen dan tekad untuk memberikan hidayah pada manusia dan menyelamatkan mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107-109. Hai Rasulullah, tidaklah Kami mengutusmu untuk mengemban agama ini melainkan sebagai rahmat dan pemberi hidayah bagi manusia dan jin. Katakanlah kepada para hamba: “Tuhanku telah mewahyukan kepadaku bahwa Tuhan kalian yang berhak disembah adalah Tuhan Yang Esa, maka berserah dirilah kepada-Nya dan tunduklah kepada ketaatan-Nya.” Dan jika mereka berpaling dari agama Islam maka katakanlah kepada mereka: “Aku menyampaikan kebenaran kepada kalian semuanya, dan aku tidak mengetahui apakah azab dan hari kiamat yang diancamkan kepada kalian masih lama atau sebentar lagi?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. وَمَآ أَرْسَلْنٰكَ (Dan tiadalah Kami mengutus) Yakni Hai Muhammad Kami tidak mengutusmu dengan syariat-syariat dan hukum-hukum. إِلَّا رَحْمَةً لِّلْعٰلَمِينَ (melainkan untuk (menjadi) rahmat bagi semesta alam) Yakni bagi seluruh manusia. Adapun bentuk rahmat bagi orang-orang kafir adalah mereka menjadi aman dari bencana, kutukan, dan kehancuran dengan adanya syariat-syariat dan hukum-hukum ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Dan Kami tidak mengutusmu dengan membawa syariat dan hukum, wahai Nabi kecuali sebagai rahmat dan petunjuk bagi manusia dan jin, karena kamu diutus untuk membahagiakan dan memperbaiki kehidupan dunia dan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutusmu, kecuali sebagai rahmat bagi seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. Berikutnya, Allah menyanjung RasulNya yang membawa al-Quran. Allah berfirman, “Dan tidaklah Kami mengutus kamu melainkan untuk (menjadi) rahmat bagi semesta alam.” Beliau merupakan rahmat Allah yang dianugerahkan bagi para hambaNya. Kaum Mukminin menerima bingkisan rahmat ini dan mensyukurinya serta menyikapinya dengan baik. Semmentara itu, kalangan lainnya , mereka mengingkarinya dan merubah kenikmatan Allah dengan bentuk kekufuran, enggan untuk menerima rahmat dan kenikmatanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 107: Selanjutnya, Allah memuji Rasul-Nya yang datang membawa Al Qur’an. Diutus-Nya Beliau adalah rahmat bagi alam semesta. Orang-orang mukmin menerima rahmat itu dan mensyukurinya, oleh karenanya mereka membenarkan Beliau, sedangkan selain mereka kufur terhadap nikmat itu dan menggantinya dengan kekafiran serta menolak rahmat tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 107",
    "description": "107. Tujuan Allah mengutus nabi Muhammad membawa agama islam bukan untuk membinasakan orang-orang kafir, melainkan untuk menciptakan perdamaian. Dan kami tidak mengutus engkau Muhammad melainkan untuk menjadi rahmat bagi seluruh alam. Perlindungan, kedamaian, dan kasih sayang yang lahir dari ajaran dan pengamalan islam yang baik dan benar. 108. Pada ayat sebelumnya diterangkan bahwa Allah mengutus nabi Muhammad membawa agama islam agar menjadi rahmat bagi manusia dan lingkungan hidup. Pada ayat ini Allah meminta nabi Muhammad menjelaskan ajaran dasar agama islam. Katakanlah wahai Muhammad, 'sungguh, apa yang diwahyukan kepadaku yang menjadi ajaran pokok agama yang dibawa para nabi, ialah bahwa tuhanmu Allah adalah tuhan yang esa, yang melahirkan prinsip tauhid, tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya; maka apakah kamu telah berserah diri kepada-Nya dengan beriman, beribadah dan mematuhi ajaran-Nya''."
  }
]