[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila mereka itu menolak islam, maka katakanlah kepada mereka, “Aku sampaikan kepada kalian semua, apa yang Allah wahyukan kepadaku. Aku dan kalian itu sama saja dalam ilmu ketika aku peringatkan kalian. Aku tidaklah lebih tahu (setelah itu) kapan siksaan yang dijanjikan kepada kalian akan menimpa kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Jika mereka berpaling dari apa yang engkau bawa kepada mereka, maka katakanlah kepada mereka -wahai Rasul-, \"Aku telah menyampaikan pada kalian bahwa aku dan kalian berada pada keadaan yang sama, tidak ada perbedaan, dan aku tidak tahu kapan azab Allah yang diancamkan pada kalian itu akan diturunkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. فَإِن تَوَلَّوْا۟ (Jika mereka berpaling,) Yakni berpaling dari Islam. فَقُلْ(maka katakanlah) Katakanlah kepada mereka. ءَاذَنتُكُمْ عَلَىٰ سَوَآءٍ ۖ (Aku telah menyampaikan kepada kamu sekalian hal yang sama) Yakni aku telah umumkan pada kalian bahwa antara kami dan kalian berada dalam peperangan, tidak ada perdamaian antara kita; kalian semua sama dalam pengumuman ini, aku tidak mengecualikan sebagian kalian dari sebagian yang lain, dan aku tidak menunjukkan sesuatu pada seseorang apa yang aku sembunyikan dari orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Jika mereka menolak untuk masuk Islam, maka katakanlah kepada mereka: “Aku telah memberitahu kalian apa yang diperintahkan untukku dan keadaan kalian semua sama dalam menerima hal itu. Namun aku tidak mengetahui apakah yang dijanjikan kepada kalian berupa hari kiamat itu sudah dekat atau masih jauh, karena informasi tentang itu dikembalikan kepada Allah SWT”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka jika mereka berpaling} berpaling dari Islam {katakanlah,“Aku telah menyampaikan kepada kalian hal yang sama} Aku telah memberitahu kalian bahwa kita dalam peperangan, dan tidak ada perdamaian di antara kita, sehingga kami dan kalian sama-sama mengetahuinya {Aku tidak mengetahui} Aku tidak mengetahui {apakah yang diancamkan kepada kalian itu sudah dekat atau masih jauh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109-110. Dan jika “mereka berpaling,” dari ketundukan unttuk mengabdikan diri kepadaNya, maka peringatkanlah mereka dari datangnya bencana-bencana dan turunnya hukuman. “Maka katakanlah, ‘Aku telah menyampaikan kepada kamu sekalian’,” maksudnya saya telah memberitahukan kedatangan hukuman “(ajaran) yang sama (antara kita),” maksudnya pengetahuanku dan pengetahuan kalian itu sama saja; maka jangan sekali-kali mengatakan bila siksaan melanda kalian, “Tidak ada pemberi kabar gembira dan peringatan (seorang rasul) yang datang kepada kami.” Akan tetapi, sekarang, ilmuku dan ilmu kalian sama. Karena saya telah memperingatkan dan mewanti-wanti kalian serta memberitahukan kepada kalian tentang akibat buruk dari kekufuran. Saya tidak menyembunyikan apa pun dari kalian. “Dan aku tidak mengetahui apakah yang diancamkan kepadamu itu sudah dekat atau masih jauh,”yaitu siksaan. Pasalnya, pengetahuan tentang kapan datangnya siksa , hanya di sisi Allah saja, berada di TanganNya. Saya tidak mempunyai wewenang apa pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 109: Maksudnya, tidak mau beribadah kepada Allah Ta’ala saja. Maksudnya: Oleh karena itu, janganlah kamu katakan ketika azab datang menimpamu, “Tidak datang kepada kami seorang pemberi kabar gembira dan peringatan.” Karena sekarang kita telah sama-sama mengetahui tentang tempat kembali bagi orang-orang kafir. Yakni azab atau hari kiamat. Karena yang mengetahuinya adalah Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 109",
    "description": "109. Tugas pokok rasul adalah menyampaikan ajaran Allah kepada manusia dan mengajak manusia mengikuti ajaran Allah. Maka jika mereka berpaling dari ajaran Allah, maka katakanlah, wahai Muhammad, kepada mereka, baik yahudi maupun nasrani, 'aku telah menyampaikan kepadamu ajaran agama yang sama di antara kita, yaitu tidak ada tuhan selain Allah, tidak ada ibadah kecuali kepada-Nya, dan tidak mempertuhankan manusia. Jika kamu menolak ajaran ini, kamu akan mendapat murka Allah; dan aku tidak tahu apakah yang diancamkan kepadamu itu sudah dekat atau masih jauh, karena murka Allah yang paling dahsyat itu dalam kehidupan sesudah mati. '110. Sikap kamu menolak ajaran Allah terbuka maupun tertutup dalam hati kamu bagi Allah sama saja. Sungguh, dia, mengetahui perkataan yang kamu ucapkan dengan terang-terangan, dan mengetahui pula apa yang kamu rahasiakan dalam hati kamu seperti sikap orang munafik."
  }
]