[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah mengetahui ucapan-ucapan yang kalian tampakkan dan yang kalian sembunyikan di dalam hati sanubari kalian, dan Dia akan memperhitungkan itu terhadap kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Sesungguhnya Allah mengetahui perkataan yang kalian ucapkan secara terang-terangan, dan mengetahui pula apa yang kalian ucapkan secara rahasia, semua itu tidak ada yang tersembunyi dari-Nya sedikit pun, dan Dia pasti akan memberikan balasan atas amal kalian tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110-112. Allah Maha Mengetahui perkataan yang kalian ucapkan dan yang kalian sembunyikkan dalam hati, dan kalian akan mendapat perhitungannya. Dan aku tidak mengetahui mungkin saja azab ini diakhirkan untuk menguji kalian, apakah kalian akan beriman atau akan tetap dalam kekafiran, dan agar kalian tetap menikmati kehidupan dunia hingga datangnya ajal.” Katakanlah: “Ya Tuhanku, putuskanlah ketetapan yang adil antara diriku dengan mereka. Dan Tuhan Kami Maha Pengasih kepada hamba-hamba-Nya, dan aku meminta pertolongan dari-Nya atas kedustaan, kesyirikan, dan hinaan yang kalian lakukan terhadap-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. إِنَّهُۥ يَعْلَمُ الْجَهْرَ مِنَ الْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُونَ (Sesungguhnya Dia mengetahui perkataan (yang kamu ucapkan) dengan terang-terangan dan Dia mengetahui apa yang kamu rahasiakan) Yakni apa yang kalian ucapkan secara terang-terangan seperti kekafiran dan tuduhan kalian terhadap agama Islam dan pemeluknya, serta apa yang kalian sembunyikan dan rahasiakan. Allah mengetahui yang terturup sebagaimana mengetahui yang nampak, dan keduanya sama-sama jelas di sisi Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Hubairah berkata tentang ayat ini: Sesungguhnya hanya Allah -تعالى- yang memiliki kekhususan seperti ini, karena jika suara yang terdengar nyaring dari berbagai sumber tidak akan terdengar jelas oleh manusia, dan mereka tidak bisa membedakan atara satu sama lainnya, tetapi Allah mendengarkan suara setiap hamba-Nya dengan jelas, dan tidak akan terganggu dengan suara lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Sesungguhnya Allah SWT mengetahui apa yang kalian tampakkan dan sembunyikan berupa ucapan dan perbuatan. Dia mengetahui semua itu dengan jelas. Tidak ada satupun rahasia yang luput dariNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Dia} Sesungguhnya Allah {mengetahui perkataan yang terang-terangan dan mengetahui pula apa yang kalian rahasiakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109-110. Dan jika “mereka berpaling,” dari ketundukan unttuk mengabdikan diri kepadaNya, maka peringatkanlah mereka dari datangnya bencana-bencana dan turunnya hukuman. “Maka katakanlah, ‘Aku telah menyampaikan kepada kamu sekalian’,” maksudnya saya telah memberitahukan kedatangan hukuman “(ajaran) yang sama (antara kita),” maksudnya pengetahuanku dan pengetahuan kalian itu sama saja; maka jangan sekali-kali mengatakan bila siksaan melanda kalian, “Tidak ada pemberi kabar gembira dan peringatan (seorang rasul) yang datang kepada kami.” Akan tetapi, sekarang, ilmuku dan ilmu kalian sama. Karena saya telah memperingatkan dan mewanti-wanti kalian serta memberitahukan kepada kalian tentang akibat buruk dari kekufuran. Saya tidak menyembunyikan apa pun dari kalian. “Dan aku tidak mengetahui apakah yang diancamkan kepadamu itu sudah dekat atau masih jauh,”yaitu siksaan. Pasalnya, pengetahuan tentang kapan datangnya siksa , hanya di sisi Allah saja, berada di TanganNya. Saya tidak mempunyai wewenang apa pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 110: Demikian pula perbuatan kamu dan ucapan serta perbuatan selain kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 110",
    "description": "110. Sikap kamu menolak ajaran Allah terbuka maupun tertutup dalam hati kamu bagi Allah sama saja. Sungguh, dia, mengetahui perkataan yang kamu ucapkan dengan terang-terangan, dan mengetahui pula apa yang kamu rahasiakan dalam hati kamu seperti sikap orang munafik. 111. Dan aku tidak tahu sedikit pun mengapa azab yang diancamkan kepada kamu, orang-orang kafir itu, ditunda datangnya. Boleh jadi hal itu cobaan bagi kamu sehingga kamu bertambah sombong dalam menolak ajaran Allah dan boleh jadi penundaan itu Allah memberi kesempat-an kepada kamu merasakan kesenangan yang singkat di dunia sampai waktu yang ditentukan kemudian kamu dikembalikan kepada azab yang kekal di akhirat."
  }
]