[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan aku tidak mengetahui, mungkin saja diundurnya kedatangan siksaan yang kalian meminta untuk disegerakan itu merupakan bentuk penundaan belaka dan cobaan bagi kalian, dan agar kalian bersenang-senang di dunia sampai waktu tetentu, hingga kalian bertambah kafir, kemudian siksaan yang datang menjadi amat besar untuk menghukum kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Dan aku tidak tahu, boleh jadi penundaan azab itu merupakan cobaan, istidrāj dan pemberian kenikmatan bagi kalian sampai pada waktu yang ditentukan menurut ilmu Allah, agar kalian semakin tenggelam dalam kekafiran dan kesesatan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. وَإِنْ أَدْرِى لَعَلَّهُۥ فِتْنَةٌ لَّكُمْ (Dan aku tiada mengetahui, boleh jadi hal itu cobaan bagi kamu) Yakni aku tidak tahu apakah penangguhan kalian ini adalah ujian bagi kalian agar Allah melihat bagaimana perbuatan kalian. وَمَتٰعٌ إِلَىٰ حِينٍ (dan kesenangan sampai kepada suatu waktu) Yakni dan kesenangan yang diberikan kepada kalian sampai waktu yang telah ditentukan sesuai dengan hikmah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Dan aku tidak tahu, barangkali penangguhan azab kalian itu adalah cobaan dan ujian bagi kalian, supaya perangai kalian dapat dilihat dan supaya kalian dikembalikan kepada apa yang kalian kerjakan dan merupakan kenikmatan dari hiasan dunia sampai waktu tertentu sesuai kehendak dan kebijaksanaan Allah, yaitu akhir ajal kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak mengetahui barangkali hal itu merupakan cobaan bagi kalian} barangkali penundaan azab itu dari kalian adalah ujian bagi kalian {dan kesenangan sampai waktu yang ditentukan} sampai ajal yang ditentukan dimana kehendakNya diputuskan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. “Dan aku tidak mengetahui boleh jadi hal itu cobaan dan kesenangan bagi kamu sampai kepada suatu waktu,” mungkin saja penundaan datangnya siksaan yang mana kalian meminta untuk disegerakan adalah (menjadi masalah) buruk bagi kalian, dan (aku tidak mengetahui) jika kalian diberi keleluasaan menikmati kemewahan di dunia sampai batas waktu tertentu, selanjutnya datang siksaan yang lebih berat atas kalian (dengan tiba-tiba)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 111: Maksudnya, melambatkan datangnya azab kepada kamu. Untuk menambah keburukanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 111",
    "description": "111. Dan aku tidak tahu sedikit pun mengapa azab yang diancamkan kepada kamu, orang-orang kafir itu, ditunda datangnya. Boleh jadi hal itu cobaan bagi kamu sehingga kamu bertambah sombong dalam menolak ajaran Allah dan boleh jadi penundaan itu Allah memberi kesempat-an kepada kamu merasakan kesenangan yang singkat di dunia sampai waktu yang ditentukan kemudian kamu dikembalikan kepada azab yang kekal di akhirat. 112. Selama 13 tahun di mekah rasulullah bersikap diam tanpa perla-wanan menghadapi penindasan, pengusiran, pemboikotan dan rencana pembunuhan orang-orang kafir mekah kepada beliau dan para sahabat hingga akhirnya setelah hijrah ke madinah, dia, Muhammad, berkata dalam doanya kepada Allah, 'ya tuhanku, berilah keputusan dengan adil di antara kami dan orang-orang kafir itu supaya tampak kebenaran dan kebatilan. Dan, kami yakin, tuhan kami maha pengasih, kepada hamba-hamba-Nya; Allah tempat memohon segala pertolongan dalam menghadapi semua yang kamu katakan kepada kami, orang-orang beriman, secara bodoh, keji, dan tidak berdasar tentang Allah, malaikat, Al-Qur'an, rasulullah, dan hidup sesudah mati. '."
  }
]