[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nabi Muhammad berkata, “Wahai Tuhanku, berilah keputusan antara kami dan kaum kami yang mendustakan (kami) dengan putusan yang adil. Dan kami memohon kepada Tuhan kami Yang Maha Pengasih dan juga memohon pertolongan kepadaNya terhadap apa yang kalian perbuat (wahai orang-orang kafir) berupa kesyirikan, pendustaan dan kebohongan, dan juga apa yang kalian ancamkan terhadap kami, yaitu mempercundangi dan mengalahkan (kami).”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Rasulullah -ṣallallāhu 'alaihi wa sallam- berdoa kapada Tuhannya, \"Wahai Tuhanku! Berilah keputusan antara kami dan kaum kami yang terus-menerus berada dalam kekafiran dengan keputusan yang hak dan adil, dan hanya kepada Tuhan Yang Maha Pengasih lah kami memohon pertolongan dari semua yang kalian katakan berupa kekafiran dan kedustaan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. قٰلَ رَبِّ احْكُم بِالْحَقِّ ۗ (berkata: “Ya Tuhanku, berilah keputusan dengan adil) Yakni Nabi Muhammad berkata: “Ya Tuhanku, berilah keputusan antara aku dan orang-orang yang mendustakanku sesuai kebenaran yang ada di sisi-Mu.” Rasulullah menyerahkan urusan ini kepada Allah. وَرَبُّنَا الرَّحْمٰنُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ(Dan Tuhan kami ialah Tuhan Yang Maha Pemurah lagi Yang dimohonkan pertolongan-Nya terhadap apa yang kamu katakan) Yakni kekafiran dan kedustaan yang kalian ucapkan. Kami memohon pertolongan kepada Allah atas kedustaan kalian, dan Dia-lah yang akan memenangkan kebenaran atas kebatilan dengan kuasa dan hikmah-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Hubairah berkata tentang firman Allah : { ٱحْكُم بِٱلْحَقِّ } \"berilah keputusan dengan adil\" yakni: tetaplah kamu berada diatas kebenaran dan berbuat adi lah; agar kamu dapat mengatakan \"berilah keputusan dengan adil\" karena orang yang menyalahi ucapannya sendiri tidak akan diterima jika berkata demikian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112. Setelah menyampaikan risalahnya kepada kaumnya dan didustakan oleh mereka, Nabi SAW bersabda: “Wahai Tuhanku, tentukanlah hukum antara aku dan para pendusta itu, yaitu penduduk Mekah dengan hukum yang haq dan adil di sisiMu. Dan Tuhan Kami itu Maha Pengasih bagi hamba-hambaNya, dan dimintai pertolongan atas apa yang kalian ucapkan berupa kebohongan dan kepalsuan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Rasulullah SAW berdoa kepada Allah SWT {“Ya Tuhanku, berilah keputusan dengan adil} berilah keputusan di antara kita dan kaum Kami yang berdusta dengan keputusan yang benar {Tuhan kami adalah Dzat Yang Maha Pengasih yang dimintai segala pertolongan atas semua yang kalian sebutkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112. “(Muhammad) berkata, ‘Ya Rabbku, berilah keputusan dengan adil’,” yaitu antara kita dan kaum kafirin. Lalu Allah mengabulkan permohonan doa ini. Allah menetapkan keputusan hukuman bagi mereka di dunia sebelum di akhirat, dalam bentuk siksaan yang Allah timpakan kepada kaum kafirin, seperti (kekalahan dalam) peperangan badr dan lainnya. “Dan Rabb kami ialah Rabb Yang Maha Pemurah lagi Yang dimohon pertolonganNya terhadap apa yang kamu katakana,” kami memohon ar-Rahman dan memohon pertolongan kepadaNya atas apa kalian deskripsikan, seperti ucapan kalian, “Kami akan mengalahkan kalian, agama kalian akan meredup!” Dalam masalah ini, kami tidak silau dengan kekuatan kami, dan tidak akan bergantung kepada daya dan kekuatan pribadi. Kami hanyalah memohon pertolongan kepada ar-Rahman yang ubun-ubun setiiap makhluk berada di tanganNya. Kami berharap kepadaNya agar sudi menyempurnakan suatu pertolongan yang kami mohonkan kepadaNya dari sebagian rahmatNya. Allah telah mewujudkannya. Segala puji bagiNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 112: Yaitu antara kami dengan mereka yang mendustakanku dengan diturunkan azab atau diberikan kemenangan terhadap mereka, dan Allah mengabulkannya, di mana mereka diazab pada perang Badar, dan peperangan yang lain sebelum tiba azab akhirat. Dalam hal ini kami tidak merasa ujub dengan diri kami dan bersandar kepada kemampuan kami, bahkan kami meminta pertolongan kepada Tuhan kami Ar Rahman terhadap apa yang kamu katakan. Seperti ucapan kamu bahwa Tuhan mempunyai anak, aku penyihir dan bahwa Al Qur’an adalah sya’ir. Selesai tafsir surah Al Anbiyaa’ dengan pertolongan Allah dan taufiq-Nya, wal hamdulillahi awwalan wa aakhiran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 112",
    "description": "112. Selama 13 tahun di mekah rasulullah bersikap diam tanpa perla-wanan menghadapi penindasan, pengusiran, pemboikotan dan rencana pembunuhan orang-orang kafir mekah kepada beliau dan para sahabat hingga akhirnya setelah hijrah ke madinah, dia, Muhammad, berkata dalam doanya kepada Allah, 'ya tuhanku, berilah keputusan dengan adil di antara kami dan orang-orang kafir itu supaya tampak kebenaran dan kebatilan. Dan, kami yakin, tuhan kami maha pengasih, kepada hamba-hamba-Nya; Allah tempat memohon segala pertolongan dalam menghadapi semua yang kamu katakan kepada kami, orang-orang beriman, secara bodoh, keji, dan tidak berdasar tentang Allah, malaikat, Al-Qur'an, rasulullah, dan hidup sesudah mati. '1. Ayat ini mengimbau agar manusia mawas diri serta menjaga diri-Nya dari azab Allah pada hari kiamat dengan beriman dan bertakwa. Wahai manusia! saatnya kamu menyimak pesan Allah, bertakwalah kepada tuhanmu dengan beriman dan melaksanakan perintah-Nya serta menjauhi larangan-Nya; sungguh, meskipun kamu belum meng-alami, guncangan hari kiamat itu adalah suatu kejadian yang sangat besar, menyebabkan manusia takut, panik dan tak tahu harus berbuat apa."
  }
]