[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tatkala mereka menyaksikan siksaan Kami yang pedih menimpa mereka dan mereka melihat gejala-gejala kedatangannya, tiba-tiba mereka bergegas lari dari negeri-negeri mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Maka ketika orang-orang yang dibinasakan itu menyaksikan azab Kami yang tidak menyisakan mereka sedikitpun, tiba-tiba mereka segera melarikan diri dari negeri mereka agar tidak binasa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-13. Ketika orang-orang zalim melihat azab Kami dan merasa yakin akan menimpa mereka, ternyata mereka melarikan diri; maka dikatakan kepada mereka: “Janganlah kalian lari, dan kembalilah kepada kenikmatan dan syahwat yang dahulu kalian tenggelam di dalamnya ketika di dunia, dan kepada rumah-rumah kalian yang megah agar kalian ditanya tentang kengerian yang kalian hadapi.” Ini merupakan ejekan dan olokan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. فَلَمَّآ أَحَسُّوا۟ بَأْسَنَآ (Maka tatkala mereka merasakan azab Kami) Yakni setelah mereka melihat azab Kami. إِذَا هُم مِّنْهَا يَرْكُضُونَ(tiba-tiba mereka melarikan diri dari negerinya) Makna (الركض) adalah melarikan diri dan kabur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Tatkala menyadari dan merasakan azab Kami, tiba-tiba mereka cepat-cepat melarikan diri dari negeri mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika mereka menyadari} melihat {azab Kami} azab Kami {tiba-tiba mereka melarikan diri darinya} melarikan diri dari azab dengan cepat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Sesungguhnya mereka ittu, orang-orang yang dibinasakan, (tatkala mereka merasakan siksa dan hukuman Allah dan gesekannya langsung mengenai mereka), tidak ada kemungkinan bagi mereka untuk kembali dan tidak ada cara untuk menarik diri. Mereka hanya bisa berlari-lari dengan kaki mereka di permukaan tanah sebagai bentuk ungkapan penyesalan, kegelisahan, dan sedih atas perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 12: Yakni merasa akan dibinasakan dan sudah tidak mungkin lagi kembali atau bertobat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 12",
    "description": "Maka ketika mereka, penduduk negeri yang zalim tersebut, melihat dan merasakan azab kami yang ditimpakan kepada mereka, tiba-tiba mereka berusaha melarikan diri dari negerinya itu karena ketakutan dan hendak menyelamatkan diri, tetapi mereka tetap binasa. 13. Dalam keadaan sudah binasa, lalu dikumandangkan kepada mereka, 'janganlah kamu lari tergesa-gesa meninggalkan negeri kamu. Lebih baik kembalilah kamu kepada kesenangan hidupmu di negeri kamu itu, dan nikmatilah hidup mewah di tempat-tempat kediamanmu dengan fasilitas yang lengkap, agar kamu dapat ditanya tentang segala hal mengenai asal-usul kemewahan itu. ' hal ini merupakan bentuk penghinaan dan sindiran tajam terhadap mereka."
  }
]