[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka dalam kondisi ini, mereka dipanggil dengan keras, “Janganlah kalian lari. Kembalilah kepada kenikmatan dan kesenangan di kehidupan dunia kalian yang melenakan dan tempat-tempat tinggal kalian yang kokoh. Barangkali kalian akan ditanya sesuatu tentang dunia kalian.” Ucapan ini dikatakan untuk mengolok dan mengejek mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Lalu mereka pun diseru sebagai bentuk cemoohan kepada mereka, \"Janganlah kalian tergesa-gesa melarikan diri, kembalilah kalian kepada kesenangan hidup dan tempat-tempat kediaman kalian dengan segala kenikmatannya yang dahulu kalian nikmati, semoga saja kalian dapat dimintai sesuatu dari harta dunia kalian.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. لَا تَرْكُضُوا۟ (Janganlah kamu lari tergesa-gesa) Yakni janganlah kalian melarikan diri. وَارْجِعُوٓا۟ إِلَىٰ مَآ أُتْرِفْتُمْ فِيهِ (kembalilah kamu kepada nikmat yang telah kamu rasakan) Yakni kepada kenikmatan yang menjadi sebab kesombongan dan kekafiran kalian. وَمَسٰكِنِكُمْ(dan kepada tempat-tempat kediamanmu) Yang kalian tinggali dan kalian bangga-banggakan. لَعَلَّكُمْ تُسْـَٔلُونَ (supaya kamu ditanya) Yakni agar kalian ditanya dan dimintai pendapat. Ini adalah sebagai olokan dan hinaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Janganlah lari dan kembalilah kepada tempat yang kalian diberi nikmat di dalamnya berupa kelezatan dunia dan rumah-rumah yang kalian banggakan, supaya kalian ditanya tentang sesuatu yang terjadi kepada kalian. Pertanyaan ini disampaikan dengan cara mencemooh, mengolok-olok dan mengejek mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah berlari} Janganlah berlari {Kembalilah kepada kemewahan hidup kalian} sesuatu yang kalian nikmati dan merasa nyaman {dan tempat-tempat tinggal kalian agar kalian dapat ditanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Selanjutnya, ada yang berkata kepada mereka dengan nada olokan, “Janganlah kamu lari tergesa-gesa; kembalilah kamu kepada nikmat yang telah kamu rasakan dan kepada tempat-tempat kediamanmu (yang baik), supaya kamu ditanya,” maksudnya, melarikan diri dan penyesalan tidaklah berguna. Namun, kalau kalian mampu, kembalilah kepada nikmat yang telah kalian rasakan, yang berbentuk aneka benda yang nikmat dan diminati, hunian-hunian kalian yang penuh dengan hiasan, dan dunia kalian yang telah memperdayai dan melalaikan kalian, sampai akhirnya datang ketetapan Allah. Lalu jadilah kalian orang-orang yang larut di dalamnya, memetik kenikmatannya lagi tentram dan terhormat di rumah-rumah kalian. Bisa jadi keinginan-keinginan kalian akan disambut sebagaimana dahulu kalian dikejar-kejar oleh tuntutan-tuntutan dunia seperti kondisi awal kalian. Tapi hal ini tidak mungkin terjadi!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 13: Yani tidak ada faedahnya kamu melarikan diri dan menyesal. Maksudnya, orang yang zalim itu di waktu merasakan azab Allah melarikan diri dalam keadaan menyesal, lalu orang-orang yang beriman (ada pula yang berpendapat, bahwa malaikat) mengatakan kepada mereka dengan cemooh agar mereka tetap di tempat semula dengan menikmati kelezatan-kelezatan hidup sebagaimana biasa untuk menjawab pertanyaan-pertanyaan yang akan dihadapkan kepada mereka tentang sikap mereka terhadap nikmat-nikmat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 13",
    "description": "Dalam keadaan sudah binasa, lalu dikumandangkan kepada mereka, 'janganlah kamu lari tergesa-gesa meninggalkan negeri kamu. Lebih baik kembalilah kamu kepada kesenangan hidupmu di negeri kamu itu, dan nikmatilah hidup mewah di tempat-tempat kediamanmu dengan fasilitas yang lengkap, agar kamu dapat ditanya tentang segala hal mengenai asal-usul kemewahan itu. ' hal ini merupakan bentuk penghinaan dan sindiran tajam terhadap mereka. 13. Dia, orang kafir dan orang murtad itu, menyeru dalam ritual dan doanya kepada suatu sembahan yang sebenarnya bencananya dalam persembahan itu, lebih dekat daripada manfaatnya. Sungguh, jika mereka menyadari bahwa sembahan selain Allah itu adalah seburuk-buruk penolong karena menolong kepada kebinasaan, dan sejahat-jahat kawan karena berkawan dengan yang mencelakakan. 13. Dia, orang kafir dan orang murtad itu, menyeru dalam ritual dan doanya kepada suatu sembahan yang sebenarnya bencananya dalam persembahan itu, lebih dekat daripada manfaatnya. Sungguh, jika mereka menyadari bahwa sembahan selain Allah itu adalah seburuk-buruk penolong karena menolong kepada kebinasaan, dan sejahat-jahat kawan karena berkawan dengan yang mencelakakan. 14. Tidak ada jawaban mereka selain pengakuan dengan penuh kesa-daran bahwa mereka telah ingkar kepada Allah. Mereka berkata, 'betapa celaka kami, sungguh, kami selama hidup di dunia termasuk orang-orang yang zalim dengan menolak ajaran para rasul. '."
  }
]