[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tidak ada jawaban dari mereka selain pengakuan mereka atas kejahatan sembari berkata, “Binasalah kami, sesungguhnya kami telah menzhalimi diri kami dengan berbuat kekafiran.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Orang-orang zalim itu lalu berkata dalam keadaan mengakui dosa-dosa mereka, \"Sungguh betapa celaka dan meruginya kami. Sesungguhnya kami dahulu adalah orang-orang zalim yang kafir kepada Allah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Kemudian mereka berteriak penuh penyesalan: “Aduhai inilah kebinasaan kami, dahulu kami telah menzalimi diri kami sendiri.” Mereka terus mengulang penyesalan ini hingga azab membinasakan mereka. Kami menjadikan mereka tercerai berai seperti kebun yang telah dipanen, mereka tidak dapat bergerak dan tidak memiliki kehidupan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. قَالُوا۟ يٰوَيْلَنَآ إِنَّا كُنَّا ظٰلِمِينَ (Mereka berkata: “Aduhai, celaka kami, sesungguhnya kami adalah orang-orang yang zaIim”) Mereka mengakui bahwa mereka telah melakukan kezaliman yang layak mendapatkan azab pada saat yang mengerikan tersebut; namun apalah manfaat yang mereka dapatkan dari pengakuan mereka dalam keadaan seperti itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Mereka berkata: “Celakalah kami, Sesungguhnya kami telah menzalimi diri sendiri dengan berbuat kekufuran” Ini adalah pengakuan tentang kezaliman mereka yang diumumkan pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata“Celakalah kami} Celakalah kami {Sesungguhnya kami adalah orang-orang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Bagaimana cara agar bisa mencapainya, sedangkan kesempatan sudah terlewatkan, hukuman dan kemarahan (Allah) telah melanda mereka. Kehormatan, kemuliaan, dan kekayaan dunia sudah lenyap, sementara rasa sesal dan kesedihanlah yang meliputi mereka? Oleh karenanya, Allah berfirman, “Mereka berkata, ‘Aduhai, celaka kami, sesungguhnya kami adalah orang-orang yang zhalim’.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 14: Dengan melakukan kekafiran. Allah Maha Adil, di mana Dia tidaklah membinasakan suatu negeri kecuali karena penduduknya berlaku zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 14",
    "description": "Tidak ada jawaban mereka selain pengakuan dengan penuh kesa-daran bahwa mereka telah ingkar kepada Allah. Mereka berkata, 'betapa celaka kami, sungguh, kami selama hidup di dunia termasuk orang-orang yang zalim dengan menolak ajaran para rasul. '15. Maka demikianlah keluhan mereka. Orang-orang kafir, di akhirat, menyatakan bahwa dirinya celaka dan mengaku dirinya telah berbuat zalim selama hidup di dunia. Pengakuan mereka terus berkepanjangan sehingga mereka, orang-orang yang zalim itu, kami jadikan hancur lebur seperti tanaman yang telah dituai yang tidak dapat hidup lagi seperti kehidupan di dunia."
  }
]