[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan masih tetap berlangsung ucapan itu (maksudnya ratapan atas kebinasaan terhadap diri mereka dan pengakuan mereka terhadap kedzoliman mereka) menjadi keluhan mereka yang mereka ulang-ulang sehingga Kami menjadikan mereka seperti tanaman yang telah dipanen, yang mati, tanpa ada kehidupan pada diri mereka. Maka camkanlah (wahai manusia) agar kalian tidak terus-menerus mendustakan Muhammad . Akibatnya, akan menimpa kalian siksaan yang telah menimpa umat-umat sebelum kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Maka pengakuan dan keluhan mereka itupun senantiasa mereka ulang-ulangi sampai Kami jadikan mereka seperti tanaman yang telah dituai, yang tidak dapat hidup dan bergerak lagi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَمَا زَالَت تِّلْكَ دَعْوَىٰهُمْ (Maka tetaplah demikian keluhan mereka) Yakni ucapan mereka terus mengulang-ulangi mereka “aduhai celakalah kami”. حَتَّىٰ جَعَلْنٰهُمْ حَصِيدًا(sehingga Kami jadikan mereka sebagai tanaman yang telah dituai) Seperti tanaman yang dipanen dengan sabit. خٰمِدِينَ (yang tidak dapat hidup lagi) Yakni mereka semua mati tak bergerak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Maka tetaplah seruan yang mereka ulang-ulang dengan kata-kata itu, sampai Kami jadikan mereka itu dituai menggunakan azab layaknya tanaman yang dituai dalam keadaan binasa dan mati seperti padamnya api yang dipadamkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian, (kalimat) itu selalu menjadi seruan mereka} kalimat itu, yaitu perkataan mereka “Celakalah kami, sesungguhnya kami adalah orang-orang zalim” sebagai seruan mereka dan terus mengulanginya {sehingga Kami menjadikan mereka seperti tanaman yang telah dituai} tanaman yang telah dipanen {dan (api) padam} yang mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Maka tetaplah demikian keluhan mereka,” maksudnya umpatan kesengsaraan, kebinasaan, rasa sesal, dan pengakuan (tertumpahkan ppada) diri mereka disebabkan kezhaliman, dan bahwa Allah Mahaadil berkaitan dengan hukuman yang Dia jatuhkan pada mereka, “sehingga Kami jadikan mereka sebagai tanaman yang telah dituai, yang tidak dapat hidup lagi,” yaitu laksana tumbuhan yang telah dipanen dan dibinasakan. Gerakan-gerakan mereka sudah lumpuh. Suara-suara merekka telah membisu. Hati-hatilah kalian, wahai kaum yang diajak bicara, jangan sampai meneruskan pendustaan kepada rasul yang paling mulia, hingga akan melanda kalian azab yang telah menimpa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 15: Mereka ulang terus kata-kata itu. Mereka dibunuh dengan pedang sebagaimana tanaman dituai. Oleh karena itu, berhati-hatilah dari tetap terus mendustakan rasul yang paling mulia (Nabi Muhammad shallallahu 'alaihi wa sallam), sehingga nantinya Dia akan menimpakan azab kepada kamu sebagaimana yang menimpa umat-umat sebelum kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 15",
    "description": "Maka demikianlah keluhan mereka. Orang-orang kafir, di akhirat, menyatakan bahwa dirinya celaka dan mengaku dirinya telah berbuat zalim selama hidup di dunia. Pengakuan mereka terus berkepanjangan sehingga mereka, orang-orang yang zalim itu, kami jadikan hancur lebur seperti tanaman yang telah dituai yang tidak dapat hidup lagi seperti kehidupan di dunia. 16. Dan kami, tidak menciptakan langit dan bumi sejak awal penciptaan hingga sekarang, dan segala apa yang ada di antara keduanya, termasuk hukum alam yang terjadi di langit dan di bumi dengan main-main, tanpa perencanaan, tujuan, dan pemeliharaan untuk kepentingan manusia sehingga tidak pantas manusia menghindar dari iman dan ibadah kepada Allah."
  }
]