[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya Kami menghendaki membuat sesuatu yang main-main, seperti anak dan istri, pastilah Kami mengadakannya dari sisi Kami, bukan dari kalian. Namun, Kami tidak melakukan itu,karena mustahil Kami mempunyai anak atau istri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Seandainya Kami hendak memiliki istri atau anak, maka tentulah Kami akan membuatnya dari sisi Kami. Namun Kami sama sekali tidak menghendaki yang demikian itu lantaran sucinya dan tidak pantasnya Kami dari hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. لَوْ أَرَدْنَآ أَن نَّتَّخِذَ لَهْوًا (Sekiranya Kami hendak membuat sesuatu permainan) Makna (اللهو) adalah sesuatu yang dipakai untuk bermain. Pendapat lain mengatakan, maknanya adalah istri dan anak. لَّاتَّخَذْنٰهُ مِن لَّدُنَّآ(tentulah Kami membuatnya dari sisi Kami) Yakni dari Kami dan dari kekuasaan Kami, dan bukan dari sisi kalian. Pendapat lain mengatakan ayat ini dipakai untuk membantah orang yang mengatakan bahwa patung-patung dan para malaikat adalah anak perempuan Allah. إِن كُنَّا فٰعِلِينَ (Jika Kami menghendaki berbuat demikian) Yakni seandainya Kami ingin melakukan itu niscaya Kami akan menjadikan itu dari sisi Kami, akan tetapi Kami tidak layak untuk bermain-main karena semua perbuatan Kami adalah kebenaran dan kesungguhan yang tidak ada permainan di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kalau Kami berkehendak untuk membuat sesuatu yang digunakan untuk menghibur diri seperti istri dan anak, maka sungguh Kami akan membuat hiburan itu dari sisi Kami seperti bidadari yang menyenangkan pandangan dan malaikat. Jika Kami melakukan hal itu, maksudnya Kami tidak melakukannya, melainkan Kami melakukannya lebih daripada hanya sekedar bermain-main. Dan setiap pekerjaan Kami itu benar, tidak ada kesia-siaan di dalamnya. Perbedaan antara Al-Lahwu dan Al-La’bu yaitu bahwa Al-Lahwu itu bertujuan untuk merekreasikan diri, sedangkan Al-La’bu itu tidak memiliki tujuan yang benar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya Kami hendak menjadikan sesuatu sebagai permainan} sesuatu yang digunakan sebagai hiburan yaitu pasangan dan anak {sungguh Kami akan membuatnya dari sisi Kami} sisi Kami {jika Kami benar-benar menghendaki berbuat (demikian)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Sekiranya Kami hendak membuat sesuatu permainan (istri dan anak),” sebagai anggapan dan perkiraan yang mustahil saja “tentulah Kami membuatnya dari sisi Kami,” maksudnya berasal dari sisi Kami. “Jika Kami menghendaki berbuat demikian (tentulah Kami telah melakukannya).” Dan Kami pun tidak pernah memperlhatkan kepada kalian hal-hal yang mengandung kesia-siaan dan permainan. Sebab, hal itu merupakan bentuk kekurangan dan perumpamaan yang buruk, Kami tidak ingin mempertontonkannya kepada kalian. Langit-langit dan bumi yang sudah terbiasa dalam jangkauan pandangan kalian, tida mungkin tujuan penciptaan keduanya hanyalah sia-sia dan main-main (tanpa ada hikmah yang luhur). Semua (keterangan) ini semata-mata ingin mengakomodasi akan-akal yang dangkal dan ingin memenuhi kepuasannya dari segala aspek yang dapat memuaskan. Mahasuci Dzat Yang Mahalembut, Penyayang lagi Bijaksana dalam menempatkan segala sesuatu pada tempatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 17: Yakni Kami tidak akan menampakkannya kepada kamu sesuatu yang di sana terdapat main-main dan sia-sia, karena hal itu menunjukkan kekurangan dan merupakan sifat yang buruk. Oleh karena itu, langit dan bumi yang kamu lihat tidak mungkin diciptakan dengan tujuan main-main dan bersenda gurau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 17",
    "description": "Seandainya kami, hendak membuat suatu permainan dalam kehidupan ini dengan mengambil istri dan anak, sebagaimana tuduhan orang-orang kafir, tentulah kami membuatnya dari sisi kami, dari segi cara, pilihan dan jumlah yang kami kehendaki, jika kami benar-benar menghendaki berbuat demikian, namun tindakan ini mustahil bagi Allah. 18. Sebenarnya kami, dengan mengutus nabi dan rasul, serta menurunkan wahyu, Al-Qur'an, hendak melemparkan dan melenyapkan ajaran yang batil dengan menampilkan ajaran yang hak, kebenaran di tengah-tengah manusia; lalu yang hak itu menghancurkannya, ajaran yang batil. Jika manusia beriman kepada Allah, nabi dan rasul, serta memegang teguh ajaran Allah dan mengamalkannya secara murni dan konsekuen, maka seketika itu ajaran yang batil itu akan lenyap. Dan celaka kamu, wahai orang-orang kafir, karena kamu menyifati Allah dengan sifat-sifat yang tidak pantas bagi-Nya, terutama dengan menuduh Allah memiliki istri dan anak."
  }
]