[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan Kami melontarkan kebenaran itu dan menerangkannya sehingga meluluhlantahkan kebatilan. Maka tiba-tiba kebatilan itu lenyap dan menghilang. Dan bagi kalian (wahai kaum musyrikin) mendapatkan siksaan di akhirat, dikarenakan kalian menyebut sifat-sifat yang tidak pantas bagi Tuhan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Kami melemparkan kebenaran yang diwahyukan kepada Rasul Kami kepada kebatilan, lalu kebenaran itu pun memusnahkannya, sehingga kebatilan itu langsung lenyap dan sirna. Maka bagi kalian hanyalah kebinasaan -wahai yang menyandarkan istri dan anak pada-Nya- karena kalian telah menyifatinya dengan sifat yang tidak pantas bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Allah mengabarkan bahwa Dia akan selalu membela kebenaran dan melenyapkan kebatilan. Allah akan menurunkan kebenaran, ilmu, dan penjelasan yang dapat menghancurkan kebatilan dan melenyapkannya, dan kebatilan setiap orang menjadi jelas dan ternyata kebatilan itu pasti lenyap dan musnah. Hai orang-orang kafir, bagi kalian kebinasaan akibat kedustaan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْبٰطِلِ (Sebenarya Kami melontarkan yang hak kepada yang batil) Yakni apa yang mereka katakan adalah bohong dan batil, dan Kami pasti akan menghilangkan kebatilan dengan kebenaran. فَيَدْمَغُهُۥ(lalu yang hak itu menghancurkannya) Yakni mengalahkannya. Makna (الدمغ) adalah luka di kepala yang tembus sampai ke otak, dan ini merupakan luka yang mematikan. Pendapat lain mengatakan maksud dari (الحق) adalah hujjah, dan (الباطل) adalah syubhat. فَإِذَا هُوَ زَاهِقٌ ۚ( maka dengan serta merta yang batil itu lenyap) Yakni hilang dan sirna. Atau hancur dan rusak. وَلَكُمُ الْوَيْلُ مِمَّا تَصِفُونَ(Dan kecelakaanlah bagimu disebabkan kamu mensifati) Yakni akibat sifat yang kalian berikan bagi Allah padahal Allah berlepas diri dari sifat tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Bahkan Kami lontarkan dengan kuat sesuatu yang haq, yaitu keimanan atas kebathilan atau kekufuran sehingga mengalahkan dan melampauinya, maka seketika kebathilan itu hilang. Dan bagi kalian itu azab yang sangat dahsyat di akhirat, wahai orang-orang kafir, akibat penggambaran kalian untuk Allah berupa istri, anak, dan setiap sesuatu yang tidak sesuai denganNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebaliknya, Kami melemparkan} melemparkan {kebenaran kepada yang bathil lalu (kebenaran) itu menghancurkannya} memusnahkan dan melenyapkannya {Maka seketika itu yang bathil lenyap} hilang dan lenyap {Bagi kalian kecelakaan} kehancuran {karena kalian mensifati (Allah dengan sifat-sifat yang tidak pantas bagiNya)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Allah memberitahukan bahwa Dia menjamin pengokohan al-haq dan pengagalan kebatilan. Bila kebatilan itu telah disampaikan dan menjadi bahan perdebatan, maka Allah akan menurunkan kebenaran, ilmu, dan penjelasan yang akan mematahkannya. Hingga lenyap dan menjadi jelas kebatilannya bagi setiap orang. “Maka dengan serta-merta yang batil itu lenyap,” lenyap lagi sirna. Hal ini berlaku umum pada semua permasalahan agama. Tidaklah pengemban kebatilan melancarkan syubhat aqliyah (yang berdasarkan logika) atau naqliyah (dalil dari al-Quran atau hadits) untuk meneguhkan kebatilan atau menepis kebenaran melainkan pasti dalam dalil-dalil Allah terdapat kandungan logika dan dalil kuat yang akan menyirnakan ungkapan yang batil tersebut dan membungkamnya. Tiba-tiba sisi kebatilannya menjadi terang bagi siapa saja. Proses ini melalui pengkajian seluruh permasalahan satu-persatu. Anda akan menjumpainya demikian. Kemudian Allah berfirman, “Kalian, wahai orang-orang yang memberikan sifat untuk Allah dengan sifat-sifat yang tidak pantas bagiNya, seperti mempunyai anak dan istri, tandingan-tandingan dan sekutu-sekutu, maka kalian mendapatkan bagian dan nasib celaka, penyesalan, dan kerugian. Tida ada satu pun manfaat dari apa yang kalian ucapkan. Tidak akan meghasilkan sesuatu yang kalian angan-angankan, kerjakan, dan usahakan untuk mencapainya, melainkan kebalikan dari sesuatu yang kalian inginkan. Yakni, kegagalan dan terhalang dari tujuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 18: Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia yang menjamin untuk menampakkan yang hak dan mengalahkan yang batil, dan bahwa setiap yang batil meskipun diucapkan dan dipakai berdebat, maka Allah Subhaanahu wa Ta'aala akan menurunkan yang hak, ilmu dan penjelasan, di mana dengannya yang batil menjadi kalah dan semakin jelas batilnya. Hal ini umum dalam semua masalah agama, di mana tidak ada satu pun syubhat untuk membenarkan yang batil atau menolak yang hak kecuali pada dalil-dalil Allah terdapat sesuatu yang melenyapkan syubhat yang batil itu, sehingga semakin jelas kebatilannya. Yakni kerugian dan kekecewaan bagimu, apa yang kamu inginkan tidak kamu peroleh. Seperti menyifati-Nya dengan beristri, beranak dan bersekutu. Mahasuci Allah dan Mahatinggi Dia dari penyifatan seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 18",
    "description": "Sebenarnya kami, dengan mengutus nabi dan rasul, serta menurunkan wahyu, Al-Qur'an, hendak melemparkan dan melenyapkan ajaran yang batil dengan menampilkan ajaran yang hak, kebenaran di tengah-tengah manusia; lalu yang hak itu menghancurkannya, ajaran yang batil. Jika manusia beriman kepada Allah, nabi dan rasul, serta memegang teguh ajaran Allah dan mengamalkannya secara murni dan konsekuen, maka seketika itu ajaran yang batil itu akan lenyap. Dan celaka kamu, wahai orang-orang kafir, karena kamu menyifati Allah dengan sifat-sifat yang tidak pantas bagi-Nya, terutama dengan menuduh Allah memiliki istri dan anak. 19. Dan milik-Nya, diciptakan dan tunduk kepada-Nya, semua makhluk Allah yang berada di langit seperti para malaikat, dan makhluk Allah yang berada di bumi. Dan para malaikat yang berada di sisi-Nya, tidak menyombongkan diri dengan menolak beribadah kepada-Nya dan para malaikat itu tidak pula merasa letih dalam beribadah kepada Allah."
  }
]