[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi Allah-lah segala sesuatu yang ada di langit dan di bumi. Dan para malaikat yang di sisiNya tidak enggan beribadah kepadaNya dan tidak bosan untuk melakukannya. Maka bagaimana boleh hamba dan ciptaanNya dipersekutukan denganNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan milik-Nya sendiri lah kerajaan langit dan bumi. Dan para malaikat yang berada disisi-Nya tidak memiliki rasa angkuh dalam beribadah kepada-Nya, dan mereka tidak pula merasa letih."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Milik Allah kerajaan setiap yang ada di tujuh langit dan bumi. Dan para malaikat yang ada di sisi-Nya tidak pernah enggan dan tidak pernah bosan untuk menyembah-Nya, mereka mengucapkan tasbih dan zikir siang dan malam tanpa pernah terputus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَمَنْ عِندَهُۥ (Dan malaikat-malaikat yang di sisi-Nya) Yakni para malaikat. لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِۦ(mereka tiada mempunyai rasa angkuh untuk menyembah-Nya) Yakni tidak angkuh untuk ibadah dan tunduk kepada Allah. وَلَا يَسْتَحْسِرُونَ(dan tiada (pula) merasa letih) Tanpa ada lelah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Dan milik Allah itu segala sesuatu di langit dan bumi berupa kerajaan dan hamba, serta para malaikat yang berada di sisiNya yang tidak melebih-lebihkan dan merendahkan ibadahnya. Mereka juga tidak lelah dan letih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hanya milikNya siapa saja yang ada di langit dan di bumi. serta yang ada di sisiNya tidak enggan untuk menyembahNya dan tidak pula merasa letih} dan tidak lelah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Selanjutnya, Allah memberitahukan bahwa Dia memiliki kerajaan langit dan bumi serta seisinya. Semua menjadi hamba dan milikNya. Tidak ada seorang pun yang mempunyai kerajaan atau bagian dari kerajaan tersebut, atau jalinan kerjasama padanya. Dan tidak ada yang bisa memberikan syafaat kecuali dengan izinNya. Lalu bagaimana bisa sebagian dari mereka ada yang didaulat sebagai tuhan? Apakah pantas ada yang dijadikan (dari mereka) sebagai anak Allah? Maka Mahatinggi lagi Mahasuci (Allah) Dzat Yang Maha Memiliki, lagi Mahaagung yang semua makhluk tunduk kepadaNya, setiap kesulitan menjadi sepele di hadapanNya dan para malaikat yang dekat khusyu’ terhadapNya. Mereka semua menundukkan diri kepadaNya melalui ibadah yang kontinyu lagi berkesinambungan. Oleh karenanya, Allah berfirman, “Dan siapa saja yang berada di sisiNya,” yaitu [dari] kalangan malaikat “mereka tiada mempunyai rasa angkuh untuk menyembahNya dan tiada (pula) merasa letih,” maksudnya mereka tidak mengalami kebosanan dan tidak jemu lantaran besarnya motivasi mereka, sempurnanya cinta mereka dan kuatnya fisik-fisik mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 19: Semua adalah hamba-Nya dan milik-Nya. Sebagaimana halnya bernafas, tidak sulit bagi kita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 19",
    "description": "Dan milik-Nya, diciptakan dan tunduk kepada-Nya, semua makhluk Allah yang berada di langit seperti para malaikat, dan makhluk Allah yang berada di bumi. Dan para malaikat yang berada di sisi-Nya, tidak menyombongkan diri dengan menolak beribadah kepada-Nya dan para malaikat itu tidak pula merasa letih dalam beribadah kepada Allah. 20. Mereka, para malaikat itu, senantiasa bertasbih dengan cara mereka, menyucikan Allah dengan tidak ada henti-hentinya malam dan siang, karena mereka tidak beristri dan beranak serta tidak membutuhkan makan dan minum."
  }
]