[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah turun sesuatu (ayat) dari al-Qur’an yang dibacakan kepada mereka untuk memperbarui peringatan bagi mereka, kecuali pendengaran mereka terhadapnya hanya mendengarkannya dengan main-main dan olokan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan tidaklah setiap kali ayat-ayat Al-Qur`ān yang baru dari Tuhan mereka melainkan mereka hanya mendengarkan tanpa mau memperhatikannya, bahkan mereka hanya bermain-main mendengarkannya tanpa mau menghiraukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Tidaklah datang kepada orang-orang kafir ayat al-Qur’an dari Allah yang baru diturunkan, melainkan mereka mendengarkannya dengan penuh penghinaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. مَا يَأْتِيهِم مِّن ذِكْرٍ مِّن رَّبِّهِم مُّحْدَثٍ (Tidak datang kepada mereka suatu ayat Al Quran pun yang baru (diturunkan) dari Tuhan mereka) Makna (الذكر) al-Qur’an yang baru diturunkan oleh Allah yang menurunkannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "2-3 Wahyu terus diturunkan namun mereka tetap saja tidak mendapatkan manfaat darinya dan tidak pula mereka mentadabburinya; tahukan kalian penyebabnya apa ? { يَلْعَبُونَ , لَاهِيَةً قُلُوبُهُمْ } \"sedang mereka bermain-main , (lagi) hati mereka dalam keadaan lalai\" dan barangsiapa dari kaum muslimin yang mengikut jejak mereka akan mendapatkan seperti yang didapat oleh mereka sesuai kelalaian dan keberpalingannya. Ayat ini juga memberikan isyarat bahwa diantara kunci untuk mengambil manfaat dari bacaan al-Quran adalah : ketenagan jiwa dan hati dalam mendengarkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Tidak datang sebagian ayat Al-Qur’an yang baru diturunkan sedikitpun kepada orang-orang kafir itu kecuali mereka menyimak bacaannya lalu mengolok-olok dan mempermainkannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah diturunkan kepada mereka peringatan yang baru} yang baru diturunkan {dari Tuhan, kecuali mereka mendengarkannya sambil bermain-main"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Oleh karenannya, Allah berfirman, “Tidaklah datang kepada mereka suatu ayat al-Quran pun yang baru (diturunkan) dari Rabb mereka,” yang mengingatkan mereka tentang hal-hal yang (nantinya) bermanfaat bagi mereka dan mengajak kepadanya, (serta mengingatkan mereka) dari hal-hal yang membahayakan mereka dan menakut-nakuti mereka dengannya, “melainkan mereka mendengarkannya,” dengan cara mendengar yang bisa dijadikan dasar tegaknya hujjah atas mereka “dalam keadaan bermain-main.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 2: Yang mengingatkan mereka hal yang bermanfaat bagi mereka dan yang mendorongnya, serta mengingatkan hal yang berbahaya bagi mereka dan menakut-nakutinya. Namun sebatas penegakkan hujjah bagi mereka, nasihat itu masuk ke telinga kanan dan keluar ke telinga kiri. Seperti mengolok-olokkannya, atau sibuk memenuhi kebutuhan syahwatnya dan mengerjakan perbuatan yang batil atau sia-sia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 2",
    "description": "Ingatlah wahai manusia, pada hari ketika kamu melihatnya, goncangan dahsyat pada hari kiamat itu, semua perempuan yang menyusui anaknya akan lalai terhadap anak yang disusuinya, karena terkejut dan panik; dan setiap perempuan yang hamil akan keguguran kandungannya, karena goncangan dahsyat itu; dan kamu melihat manusia dalam keadaan mabuk, seperti orang yang tidak sadar, padahal sebenarnya mereka tidak mabuk tetapi azab Allah yang terjadi pada hari kiamat itu sangat keras dirasakan oleh orang-orang kafir. 3. Hati mereka dalam keadaan lalai dari Al-Qur'an, sibuk dengan kehi-dupan dunia yang tak bermakna. Mereka tidak memikirkan pesan Al-Qur'an. Dan orang-orang yang zalim di antara pemuka quraisy itu merahasiakan pembicaraan mereka, yang menggambarkan penolakan mereka beriman kepada nabi Muhammad, 'orang ini (Muhammad) tidak lain hanyalah seorang manusia juga seperti kamu. Apakah kamu menerima sihir Muhammad itu, ayat-ayat Al-Qur'an, padahal kamu menyaksikan bahwa yang diucapkannya itu benar-benar sihir''."
  }
]