[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berdzikir (mengingat dan menyebut) Allah dan menyucikanNYa terus-menerus. Mereka tidak letih dan tidak bosan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Mereka senantiasa bertasbih memuji Allah siang dan malam, dan tidak pernah bosan dan letih darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. يُسَبِّحُونَ الَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ (Mereka selalu bertasbih malam dan siang tiada henti-hentinya) Mereka senantiasa bertasbih tanpa lelah dan tanpa bosan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam ayat Allah mengatakan : { يُسَبِّحُونَ ٱلَّيْلَ وَٱلنَّهَارَ لَا يَفْتُرُونَ } dan tidak mengatakan ( يُسَبِّحُونَ في ٱلَّيْلَ ) karena mereka bertasbih tiada henti disetiap waktu dan kesempatan, dan jika tasbih mereka hanya di beberapa waktu saja, maka konteks ayat yang tepat adalah : ( يُسَبِّحُونَ ٱلَّيْلَ وَٱلنَّهَارَ )."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Mereka mensucikan, mengagungkan dan berdzikir kepada Allah terus-menerus pada malam dan siang hari. Mereka tidak jenuh, tidak terlambat dan tidak lemah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka bertasbih pada waktu malam dan siang tanpa bosan} tidak bosan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Mereka selalu bertasbih malam dan siang tiada henti-hentinya,” maksudnya mereka larut dalam ibadah dan lantunan tasbih di seluruh waktu mereka. Tidak ada waktu-waktu mereka yang luang atau kosong dari aktivitas tersebut. Mereka semua (dengan banyaknya jumlah mereka) berada dalam kondisi demikian. Dalam keterangan ini, terdapat penjelasan keagungan dan kebesaran kerajaan Allah, dan kesempurnaan ilmu dan hikmahNya yang menuntut agar tidak ada obyek yang diibadahi kecuali Dia saja, dan tidaklah ibadah diarahkan kepada selainNya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 20",
    "description": "Mereka, para malaikat itu, senantiasa bertasbih dengan cara mereka, menyucikan Allah dengan tidak ada henti-hentinya malam dan siang, karena mereka tidak beristri dan beranak serta tidak membutuhkan makan dan minum. 21. Mengapa orang-orang kafir tidak beriman kepada Allah dan beribadah kepada-Nya dengan ikhlas' apakah mereka mengambil tuhan-tuhan dari bumi, seperti patung dan berhala yang mereka duga dapat menghidupkan orang-orang yang mati'."
  }
]