[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana dibenarkan bagi kaum musyrikin mengambil sesembahan yang lemah yang berasal dari bumi, yang tidak berkuasa menghidupkan orang-orang yang telah mati?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Maka apakah orang-orang musyrik itu mengambil tuhan-tuhan selain Allah, padahal tuhan-tuhan itu tidak bisa menghidupkan yang mati, lalu mengapa mereka menyembah sesuatu yang tidak kuasa melakukan hal tersebut?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Allah mengolok orang-orang musyrik yang menyembah berhala-berhala yang tidak mampu menghidupkan orang yang telah mati. Seandainya di langit dan bumi ada tuhan-tuhan selain Allah, niscaya sistem alam semesta akan rusak karena perbedaan pengaturan. Maha Suci Allah, Tuhan pemilik ‘arsy yang agung, dari apa kedustaan yang dibuat orang-orang musyrik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أَمِ اتَّخَذُوٓا۟ ءَالِهَةً مِّنَ الْأَرْضِ (Apakah mereka mengambil tuhan-tuhan dari bumi) Yakni apakah mereka menjadikan tuhan-tuhan dari sesuatu yang ada di bumi. هُمْ (mereka) Yakni dengan kehinaan mereka. يُنشِرُونَ (dapat menghidupkan) Yakni menghidupkan orang mati? Yakni tidaklah demikian, tuhan-tuhan yang mereka ada-adakan tidak dapat menghidupkan seorangpun dan tidak mampu mematikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Ataukah mereka (orang-orang musyrik itu) mengambil tuhan-tuhan yang ada di bumi seperti batu dan logam yang dapat menghidupkan orang-orang mati dari kuburan-kuburan mereka?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka mengambil dari bumi tuhan-tuhan yang dapat menghidupkan} menghidupkan orang-orang yang mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Tatkala Allah mmenjelaskam kesempurnaan kekuasaanNya dan keagunganNYa serta ketundukan segala sesuatu kepadaNya, maka Dia mengingkari kaum musyrikin yang telah menjadikan selainNya sebagai sesembahan dari bumi, yang berada dalam titik puncak kelemahan dan ketidakberdayaan. “Mereka dapat menghidupkan (orang-orang mati),” ini merupakan bentuk pertanyaan, tetapi bermakna penafian (peniadaan). Maksudnya, mereka tidak mampu untuk menghidupkan dan menghimpun mereka. Hal ini diterangkan oleh Firman Allah, \" Kemudian mereka mengambil tuhan-tuhan selain daripada-Nya (untuk disembah), yang tuhan-tuhan itu tidak menciptakan apa pun, bahkan mereka sendiri diciptakan dan tidak kuasa untuk (menolak) sesuatu kemudaratan dari dirinya dan tidak (pula untuk mengambil) sesuatu kemanfaatan pun dan (juga) tidak kuasa mematikan, menghidupkan dan tidak (pula) membangkitkan.\" (Al-Furqan:3) \"Mereka mengambil sembahan-sembahan selain Allah agar mereka mendapat pertolongan. Berhala-berhala itu tiada dapat menolong mereka; padahal berhala-berhala itu menjadi tentara yang disiapkan untuk menjaga mereka.\" (Yasin:74-75)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 21: Setelah Allah Subhaanahu wa Ta'aala menerangkan sempurnanya kekuasaan-Nya, kebesaran-Nya dan segala sesuatu tunduk kepada-Nya, Dia mengingkari orang-orang bmusyrik yang mengambil tuhan-tuhan dari bumi yang keadaannya sangat lemah dan tidak memiliki kemampuan. Seperti dari batu, emas, perak, dsb. Mereka tidak akan sanggup menghidupkannya. Oleh karena itu, Allah yang mampu menghidupkan sesuatu yang telah mati, Dialah yang berhak disembah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 21",
    "description": "Mengapa orang-orang kafir tidak beriman kepada Allah dan beribadah kepada-Nya dengan ikhlas' apakah mereka mengambil tuhan-tuhan dari bumi, seperti patung dan berhala yang mereka duga dapat menghidupkan orang-orang yang mati'22. Seandainya pada keduanya, langit dan bumi, ada tuhan-tuhan selain Allah, yang mengelola langit dan bumi sebagaimana dugaan orang-orang kafir, tentu keduanya telah binasa karena perselisihan pengelolaan di antara dua tuhan ini. Dengan demikian, jelaslah kepalsuan dugaan orang kafir yang meyakini ada dua tuhan atau lebih. Mahasuci Allah dengan kesucian yang mutlak, tuhan yang memiliki 'arsy, dari apa yang mereka sifatkan kepada-Nya dengan tanpa dasar."
  }
]