[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya di langit dan di bumi ada tuhan-tuhan sesembahan selain Allah yang mengatur urusan-urusan keduanya, pastilah carut-marut keadaan keduanya. Maka Allah, penguasa Arasy Mahabersih dan Maha suci dari sifat-sifat yang disematkan oleh orang-orang pengingkar lagi kafir berupa kedustaan, ucapan yang mengada-ada, dan semua kekurangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Seandainya di langit dan di bumi itu terdapat sesembahan lain selain Allah, tentu keduanya akan binasa karena para sembahan itu tentu akan berebut kekuasaan, namun nyatanya tidaklah demikian adanya. Maka sungguh Mahasuci Allah Tuhan yang memiliki Arasy dari apa yang orang-orang musyrik itu sifatkan secara dusta bahwa Dia memiliki tandingan dan sekutu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. لَوْ كَانَ فِيهِمَآ ءَالِهَةٌ إِلَّا اللهُ لَفَسَدَتَا ۚ (Sekiranya ada di langit dan di bumi tuhan-tuhan selain Allah, tentulah keduanya itu telah rusak binasa) Yakni seandainya di langit dan bumi terdapat tuhan-tuhan yang sesungguhnya selain Allah niscaya langit dan bumi akan hancur. Hal ini karena setiap tuhan mampu melakukan yang mereka inginkan, dan ini akan menyebabkan perselisihan antara mereka sehingga mengakibatkan kerusakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagaimana langit dan bumi jika di dalamnya terdapat tuhan-tuhan selain Allah -عز وجل- niscaya akan terjadi kerusakan, seperti dalam firman-Nya: { لَوْ كَانَ فِيهِمَآ ءَالِهَةٌ إِلَّا ٱللَّهُ لَفَسَدَتَا } \"Sekiranya ada di langit dan di bumi tuhan-tuhan selain Allah, tentulah keduanya itu telah rusak binasa\" maka begitu juga dengan hati yang senantiasa cendrung kepada selain Allah -عز وجل-; maka pasti akan rusak parah dan kemungkinan besar tidak kembali baik, kecuali jika kecendrungan kepada selain Allah itu keluar dari hatinya, dan Allah menjadi satu-satunya tempat ia bergantung dalam segala permasalahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Jika saja di langit dan bumi itu ada tuhan-tuhan selain Allah, maka sungguh tatanan alam akan hancur dan tidak stabil karena ksewenang-wenangan setiap tuhan dalam menentukan aturan tertentu, sehingga yang terjadi adalah perdebatan dan perselisihan. Maka sucikanlah Allah, Tuhannya ‘Arsy dari sesuatu yang direkayasa oleh orang-orang musyrik itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya pada keduanya} langit dan bumi {ada tuhan-tuhan selain Allah, sungguh keduanya telah binasa} sungguh keduanya sudah runtuh dan musnah, karena sesuatu yang ada di antara keduanya yaitu perselisihan dan perdebatan {Maha suci Allah} Maha suci dan Maha bersih Allah {Tuhan pemilik ʻArsy dari apa yang mereka sifatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Orang musyrik menyembah makhluk yang tidak bisa memberikan manfaat atau membahayakan dengan meninggalkan sikap keikhlasan kepada Allah, Dzat yang mempunyai seluruh kesempurnaan. Di TanganNYa-lah terdapat (kendalli) segala urusan, manfaat, dan bahaya. Ini (perbuatan orang musyrik itu) termasuk (cerminan) tidak adanya taufik Allah padanya, buruknya keberuntungannya, kebodohannya yang parah, dan besarnya ulah kezhalimannya. Sesungguhnya alam semesta ini tidak akan menjadi baik kecuali bila berada di bawah satu sesembahan semata. Sebagaimana tidaklah alam (ini) diadakan kecuali oleh satu pemilik (Rabb). Karenanya, Allah berfirman, “Sekiranya di dalam keduanya,” yaitu di langit dan bumi “terdapat tuhan-tuhan selain Allah, tentulah keduanya itu telah rusak binasa,” pada bentuk keduanya, dan rusak pula makhluk-makhluk yang berada di dalamnya. Penjelasannya sebagai berikut: Bumi lapisan atas dan lapisan bawah berdasarkan pemandangan yang terlihat dalam bentuk yang paling sempurna ditilik dari aspek keindahan dan keteraturan, yang tidak ada celah kekurangan, cacat, pertentangan, dan kontradiksi di dalamnya, hal ini mengindikasikan bahwa Dzat yang mengaturnya satu, Pemiliknya satu dan TUhannya satu. Andai saja, alam ini mempunyai dua pengatur dan dua pemilik atau lebih dari itu, niscaya aturan geraknya aan carut-marut, tiang-tiangnya akan roboh, keduanya-duanya akan saling bertentangan dan berlawanan. Jika salah satu dari keduanya ingin menetapkan suatu pengaturan tertentu, sementara pihak lain tidak menghendakinya, niscaya realisasi keinginan mereka berdua secara sekaligus merupakan bentuk kemustahilan. Dan terealisasinya keinginan salah satu pihak, sementara kehendak yang lain tidak terwujud, menunjukkan kelemahan dan ketidakberdayaan pihak yang lain itu. Sedangkan keserasian dua belah pihak pada satu kesepakatan bulat dalam seluruh perkara adalah tidak mungkin juga. Oleh karenanya, menjadi sebuah kepastian bahwa Dzat yang Perkasa yang kehendakNya semata yang dapat terwujudkan (sesuatu) tanpa ada penentang atau penyanggah, DIa adalah Allah Yang Mahasatu lagi Mahaperkasa. Karena ini , Allah menyebutkan sebuah bentuk dalil tamanu’ (kontradiktif) dengan FirmanNYa, \" Allah sekali-kali tidak mempunyai anak, dan sekali-kali tidak ada tuhan (yang lain) beserta-Nya, kalau ada tuhan beserta-Nya, masing-masing tuhan itu akan membawa makhluk yang diciptakannya, dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain. Maha Suci Allah dari apa yang mereka sifatkan itu,\" (Al-Mu’minun:91), senada dengan ayat di atas, penggunaan ayat berikut berdasarkan salah satu tafsirannya, \" Katakanlah: \"Jika ada tuhan-tuhan di samping-Nya, sebagaimana yang mereka katakan, niscaya tuhan-tuhan itu mencari jalan kepada Tuhan yang mempunyai Arasy\". Maha Suci dan Maha Tinggi Dia dari apa yang mereka katakan dengan ketinggian yang sebesar-besarnya.\" (Al-Isra:42-43). Karenanya, Allah berfirman, “Maka Mahasuci Allah,” Dia berlepas diri dan Suci dari segala kekurangan yang mengarah pada kesempurnaanNYa “Yang mempunyai ‘Arasy,” yang menjadi atap seluruh makhluk, tempat yang paling luas dan paling agung. Maka, rububiyah (pengaturan) Allah terhadap makhluk-makhluk lain yang lebih kecil dari Arasy adalah lebih masuk akal “dari apa yang mereka sifatkan,” yaitu orang-orang yang menentang dan mengingkari, berupa (tindakan) penisbatan anak dan istri bagi Allah, serta kepemilikan sekutu dari segala aspek."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 22: Yakni tidak akan tersusun rapi seperti yang kita saksikan, karena adanya keengganan dari pihak yang lain sebagaimana ketika ada dua penguasa yang sama-sama berkuasa dalam satu wilayah, tentu wilayah itu tidak akan teratur, di mana yang satu ingin seperti ini, sedangkan yang satu lagi ingin seperti itu. Dalam ayat lain disebutkan, “Allah sekali-kali tidak mempunyai anak, dan sekali-kali tidak ada Tuhan (yang lain) beserta-Nya, kalau ada Tuhan beserta-Nya, masing-masing Tuhan itu akan membawa makhluk yang diciptakannya, dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain. Mahasuci Allah dari apa yang mereka sifatkan itu,” (terj. Al Mu’minun: 91) Yakni orang-orang kafir. Seperti menyifati-Nya dengan memiliki anak dan istri serta memiliki sekutu. Mahasuci Allah dari sifat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 22",
    "description": "Seandainya pada keduanya, langit dan bumi, ada tuhan-tuhan selain Allah, yang mengelola langit dan bumi sebagaimana dugaan orang-orang kafir, tentu keduanya telah binasa karena perselisihan pengelolaan di antara dua tuhan ini. Dengan demikian, jelaslah kepalsuan dugaan orang kafir yang meyakini ada dua tuhan atau lebih. Mahasuci Allah dengan kesucian yang mutlak, tuhan yang memiliki 'arsy, dari apa yang mereka sifatkan kepada-Nya dengan tanpa dasar. 23. Dia, Allah, tidak ditanya atau dievaluasi dan dimintai pertanggungja-waban tentang apa yang dikerjakan-Nya terhadap makhluk, karena Allah tuhan yang maha berkuasa, yang kekuasaan-Nya mutlak. Tidak pernah salah atau keliru sedikit pun dalam semua perbuatan-Nya. Tetapi sebaliknya manusia, merekalah yang akan ditanya atau dievaluasi dan dimintai pertanggung jawaban tentang semua yang mereka kerjakan di dunia, baik karena kelemahan atau kebodohan maupun karena dorongan hawa nafsu yang tidak terkendali."
  }
]