[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya diantara bukti keesaan Allah dalam menciptakan dan ibadah, sesungguhnya Dia tidak ditanya tentang ketetapanNya terhadap makhluk-makhlukNya, sedang seluruh makhlukNya akan dimintai pertanggung jawaban atas perbuatan-perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Allah Maha Esa dalam mengurusi kerajaan, kekuasaan dan keputusan-Nya. Tidak ada yang berhak menanyakan tentang apa ditakdirkan dan diputuskan-Nya, bahkan Dia lah yang akan bertanya dan memintai pertanggungjawaban dari hamba-hamba-Nya atas amal perbuatan mereka, serta akan memberikan mereka balasan yang setimpal dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Bagian dari keagungan Allah, Dia tidak ditanya tentang apa yang telah Dia perbuat, karena Dia-lah pemilik segala sesuatu. Adapun para hamba, mereka akan ditanya karena mereka adalah milik Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. لَا يُسْـَٔلُ عَمَّا يَفْعَلُ (Dia tidak ditanya tentang apa yang diperbuat-Nya) Kerena kuatnya kekuatan-Nya dan keagungan-Nya, tidak ada yang makhluknya yang berhak menanyai-Nya tentang ketentuan dan takdir-Nya. وَهُمْ يُسْـَٔلُونَ(dan merekalah yang akan ditanyai) Namun para makhluk-Nya yang akan ditanyai tentang apa yang telah mereka kerjakan. Yakni Allah menanyai mereka karena mereka adalah para hamba-Nya, begitu pula makhluk-makhluk yang dianggap sebagai tuhan seperti Isa al-Masih dan para malaikat juga akan ditanya Allah tentang amal perbuatan mereka, oleh sebab itu mereka tidak pantas untuk menjadi tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Karena keagungan, otoritas dan pengaturanNya, Allah tidak ditanya tentang apa yang Dia kerjakan. Sedangkan para hamba itu ditanya tentang apa yang mereka kerjakan karena mereka adalah hamba yang dimiliki Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Allah) tidak ditanya tentang apa yang Dia kerjakan, tetapi merekalah yang akan ditanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Dia tidak ditanya tentang apa yang diperbuatNya,” karena kebesaran, kemuliaan, dan kesempurnaan kekuasaanNYa. Tidak ada satu makhluk pun yang sanggup melawan dan menghambatNya, baik dengan perkataan ataupun tindakan. Lantaran kesempurnaan hikmahNya dan peletakan berbagai ketetapan olehNya pada tempatnya, serta keelokan penangananNya pada bentuk yang terbaik, yang dapat dicerna oleh akal. Sehingga tidak ada pertanyaan yang tertuju padaNya. Sebab penciptaanNya tidak mengandung cacat atau kerusakan. “Dan merekalah,” yakni para makhluk “yang akan ditanyai,” tentang tindak-tanduk dan tutur kata mereka lantaran ketidakberdaayn dan kekerdilan mereka. Pasalnya, mereka adalah para hamba Allah. Perbuatan-perbuatan dan gerak gerik mereka sudah tersuratkan. Tidak ada hak kewenangan penanganan dan pengaturan yang mereka miliki atau pun yang dimiliki oleh pihak lain sekecil biji gandum sekalipun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 23: Karena keagungan-Nya, keperkasaan-Nya dan sempurnanya kekuasaan-Nya. Tidak ada seorang pun yang sanggup menghalangi-Nya atau menentang-Nya, baik dengan kata-kata maupun perbuatan. Demikian pula karena sempurnanya hikmah (kebijaksanaan)-Nya dan karena Dia telah menempatkan sesuatu pada tempatnya. Dia juga tidak ditanya, karena ciptaan-Nya tidak ada cacatnya. Tentang apa yang mereka katakan dan kerjakan, karena kelemahan mereka, butuhnya mereka, dan karena mereka adalah hamba."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 23",
    "description": "Dia, Allah, tidak ditanya atau dievaluasi dan dimintai pertanggungja-waban tentang apa yang dikerjakan-Nya terhadap makhluk, karena Allah tuhan yang maha berkuasa, yang kekuasaan-Nya mutlak. Tidak pernah salah atau keliru sedikit pun dalam semua perbuatan-Nya. Tetapi sebaliknya manusia, merekalah yang akan ditanya atau dievaluasi dan dimintai pertanggung jawaban tentang semua yang mereka kerjakan di dunia, baik karena kelemahan atau kebodohan maupun karena dorongan hawa nafsu yang tidak terkendali. 24. Atau apakah orang-orang yang menyekutukan Allah tidak mengenal hak Allah atas manusia, sehingga mereka mengambil tuhan-tuhan selain dia untuk dijadikan sembahan tanpa argumentasi yang benar dan masuk akal. Katakanlah, wahai rasulullah kepada orang-orang yang menyekutukan Allah itu, 'kemukakanlah alasan-alasanmu bahwa Allah memiliki mitra dalam kekuasaan-Nya, sehingga mitra Allah itu setara dengan Allah dan berhak juga untuk diibadati! Al-Qur'an ini adalah peringatan bagi orang-orang yang bersamaku, yakni umatku, tentang hak Allah atas manusia dan kewajiban manusia kepada Allah. Dan Al-Qur'an pun peringatan bagi orang sebelumku, umat para nabi terdahulu, tentang prinsip tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya. Tetapi kebanyakan mereka, karena kebodohan dan ketaklidannya, tidak mengetahui yang hak, yakni kebenaran, yang dibawa Al-Qur'an dan kitab-kitab sebelumnya; karena itu mereka berpaling dari iman kepada Allah."
  }
]