[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kaum musyrikin mengambil selain Allah tuhan-tuhan sesembahan yang tidak dapat memberikan manfaat dan mendatangkan mara bahaya, tidak dapat menghidupkan dan mematikan? Katakanlah (wahai Rasul) kepada mereka, “Tunjukkanlah apa yang kalian miliki berupa bukti kebenaran atas tindakan kalian menjadikan obyek itu sebagai tuhan sesembahan. Tidak ada di dalam al-Qur’an yang aku bawa dan kitab-kitab suci terdahulu satu bukti pun tentang keyakinan yang kalian peluk itu.” Dan tidaklah mereka berbuat kesyirikan kecuali karena dorongan kebodohan dan fanatisme saja. Maka mereka berpaling dari kebenaran dan mengingkarinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Akan tetapi mereka ternyata mengambil tuhan-tuhan selain Allah, maka katakanlah -wahai Rasul- kepada orang-orang musyrik itu, \"Tunjukkanlah bukti kebenaran tuhan-tuhan itu agar disembah, Kitab yang diturunkan kepadaku ini atau kitab-kitab yang diturunkan kepada rasul sebelumku sama sekali tidak menunjukkan hujah dan bukti kebenaran kalian,\" Bahkan kebanyakan kaum musyrik tidaklah berdalil dan bersandar kecuali kepada kejahilan dan taklid buta, karena itu mereka pun berpaling dari menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Allah mengulangi pengingkaran-Nya terhadap orang-orang musyrik karena begitu besarnya dosa syirik: “Apakah mereka menjadikan tuhan-tuhan lain selain Allah yang layak disembah dan diagungkan?” Hai Nabi, katakanlah kepada mereka: “Datangkanlah kepadaku hujjah dan dalil atas apa yang kalian klaim; sebab dalam al-Qur’an yang ada padaku dan kitab-kitab terdahulu tidak terdapat dalil yang membenarkan kedustaan kalian.” Kebanyakan mereka tidak mengetahui hak Allah dalam pengesaan-Nya, mereka berpaling dari kebenaran dan orang yang mengikutinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. قُلْ هَاتُوا۟ بُرْهٰنَكُمْ ۖ (takanlah: “Unjukkanlah hujjahmu!) Atas pengakuan bahwa mereka adalah tuhan-tuhan. Mereka tidak akan dapat mendatangkan hujjah baik itu sec088L,J;]=ara akal maupun secara wahyu; adapun secara akal, hal ini telah dijelaskan sebelumnya (pada ayat 22), sedangkan secara wahyu dijelaskan dalam firman-Nya: هٰذَا ذِكْرُ مَن مَّعِىَ وَذِكْرُ مَن قَبْلِى ۗ”ini adalah peringatan bagi orang-orang yang bersamaku, dan peringatan bagi orang-orang yang sebelumku.” Yakni inilah wahyu yang diturunkan kepadaku dan kitab-kitab yang diturunkan sebelumku, maka lihatlah apakah dalam salah satunya terdapat perintah Allah untuk menjadikan tuhan selain Dia? بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ الْحَقَّ ۖ( Sebenarnya kebanyakan mereka tiada mengetahui yang hak) Karena mereka tidak mengetahui kebenaran maka mereka tidak dapat membedakan antara kebenaran dan kebatilan. فَهُم مُّعْرِضُونَ (karena itu mereka berpaling) Yakni mereka enggan menerima kebenaran, senantiasa berpaling dari mengesakan Allah dan mengikuti Rasulullah, mereka tidak memperhatikan hujjah dan tidak mentadabburi bukti serta tidak memikirkan dalil yang ada."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Ataukah orang-orang musyrik itu mengambil tuhan-tuhan selain Allah yang mereka anggap bisa memberi manfaat dan kemahdharatan. Katakanlah kepada mereka wahai Nabi: “Datangkanlah bukti-bukti atas klaim kalian bahwa sembahan-sembahan kalian itu adalah tuhan. Dalil ini adalah kitab-kitab yang diturunkan (Allah). Yang pertama adalah Al-Qur’an yang menjadi kitab umatku, kemudian Taurat, Injil dan kitab selain keduanya berupa kitab-kitab Allah yang selalu diingat-ingat oleh ahli-ahli agama terdahulu.” Tidak ada satupun dari kitab tersebut yang menyebutkan bahwa ada tuhan bersama Allah sebagaimana yang mereka anggapkan. Sesungguhnya setiap kitab itu menegaskan tentang keesaan Allah. Bahkan kebanyakan mereka tidak mengetahui tentang keesaan Allah dan cara memisahkan kebenaran dari kebathilan. Mereka itu menolak kebenaran, menolak mengesakan Allah dan enggan mengikuti rasulallah karena tidak tahu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka mengambil} tetapi mereka mengambil {tuhan-tuhan selain Dia} selain Allah {Katakanlah,“Kemukakanlah alasan-alasan kalian} dalil-dalil kalian atas hal itu {Ini adalah peringatan bagi orang yang bersamaku} Al-Qur’an ini di dalamnya terdapat kabar orang yang bersamaku dalam agamaku dan orang yang mengikutiku sampai hari kiamat {dan peringatan bagi orang sebelumku} dan inilah kitab-kitab yang diturunkan kepada para nabi sebelumku {Akan tetapi kebanyakan mereka tidak mengetahui yang benar sehingga mereka berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Setelah itu, Allah kembali merendahkan penilaian terhadap kondisi orang-orang kafir saat mereka memposisikan sesembahan selain Allah. Maka, Allah berfirman untuk memburuk-burukkan dan menggertak mereka, “Apakah mereka mengambil tuhan-tuhan selainnya?” Katakanlah, ‘Tunjukkanlah hujjahmu’,” yaitu hujjah dan bukti kalian yang menunjukkan kebenaran pandangan-pandangan kalian. Mereka tidak akan menemukan satu cara pun. Justru, bukti-bukti yang pasti tegak membuktikan kebatilannya. Karenanya, Allah berfirman, “(Al-Quran) ini adalah peringatan bagi orang-orang yang bersamaku dan peringatan bagi orang-orang yang sebelumku,” maksudnya kitab-kitab dan aturan-aturan syariat ilahi telah bersesuaian mengenai keakuratan perkataan yang aku sampaikan kepada kalian tentang kebatilan syirik. Lihatlah, ini kitab Allah yang di dalamnya terdapat ketetapan segala sesuatu yang berdasarkan dalil-dalil logikan maupun naqliyah. Lihatlah, kitab-kitab (Allah) sebelum al-Quran, semuanya merupakan petunjuk dan bukti penguat apa yang aku katakana. Ketika sudah diketahui, telah tegak hujjah dan petunjuk bagi mereka yang menunjukkan kebatilan asumsi mereka, maka diketahui bahwa mereka tidak mempunyai satu bukti pun. Pasalnya, petunjuk yang tegas telah meneguhkkan tidak adanya penantang bagi Allah. Kalau tidak demikian, maka petunjuk tersebut belum kokoh. Seandainya terdapat penentangan-penentangan, itu tiada lain hanyalah lontaran-lontaran syubhat yang tidak mampu menangkis kebenaran sedikit pun. Firman Allah, “Sebenarnya kebanyakan mereka tiada mengetahuai al-haq,” maksudnya mereka tetap berkutat dengan pegangan mereka sebagai bentuk sikap taqlid kepada para pendahulu mereka. Mereka mendebat tanpa ilmu (yang benar) dan petunjuk. Ketidaktahuan mereka tentang kebenaran bukan lantaran tersembunyi atau ketidakjelasan kebenaran tersebut. Tetapi, tidak lain terdorong oleh antipati mereka terhadap kebenaran. Apabila tidak demikian, seandainya mereka menolehkan kepala ke arahnya sedikit saja, niscaya kebenaran akan menjadi jelas bagi mereka, berbeda dengan kebatilan dengan perbedaan yang sangat siginifikan. Karena itu, Allah berfirman, “Karena mereka berpaling.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 24: Selanjutnya Allah mencela kembali keadaan kaum musyrik. Yang membenarkan perbuatanmu itu (menjadikan tuhan selain-Nya). Keyakinan tauhid (keesaan Allah dan bahwa Dia saja yang berhak disembah) itu adalah salah satu di antara pokok-pokok agama yang tersebut dalam Al Quran dan kitab-kitab yang dibawa oleh rasul-rasul sebelum Nabi Muhammad shallallahu 'alaihi wa sallam, semua kitab sepakat terhadapnya. Yakni mereka melakukan perbuatan itu, tidak lain karena ikut-ikutan dengan generasi sebelum mereka, mereka membantah dengan tanpa ilmu dan petunjuk. Namun ketidaktahuan mereka terhadap kebenaran, bukanlah karena samarnya kebenaran itu dan tidak jelas, akan tetapi karena mereka berpaling darinya. Karena kalau sekiranya mereka melihatnya meskipun sebentar, niscaya akan nampak kebenaran bagi mereka. Dari memperhatikan sesuatu yang dapat menyampaikan mereka kepada tauhid."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 24",
    "description": "Atau apakah orang-orang yang menyekutukan Allah tidak mengenal hak Allah atas manusia, sehingga mereka mengambil tuhan-tuhan selain dia untuk dijadikan sembahan tanpa argumentasi yang benar dan masuk akal. Katakanlah, wahai rasulullah kepada orang-orang yang menyekutukan Allah itu, 'kemukakanlah alasan-alasanmu bahwa Allah memiliki mitra dalam kekuasaan-Nya, sehingga mitra Allah itu setara dengan Allah dan berhak juga untuk diibadati! Al-Qur'an ini adalah peringatan bagi orang-orang yang bersamaku, yakni umatku, tentang hak Allah atas manusia dan kewajiban manusia kepada Allah. Dan Al-Qur'an pun peringatan bagi orang sebelumku, umat para nabi terdahulu, tentang prinsip tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya. Tetapi kebanyakan mereka, karena kebodohan dan ketaklidannya, tidak mengetahui yang hak, yakni kebenaran, yang dibawa Al-Qur'an dan kitab-kitab sebelumnya; karena itu mereka berpaling dari iman kepada Allah. 25. Tugas para rasul sejak nabi adam hingga nabi Muhammad adalah menyampaikan wahyu kepada umat. Dan kami, tidak mengutus seorang rasul pun, baik yang disebutkan namanya di dalam Al-Qur'an maupun yang tidak disebutkan, sebelum engkau, Muhammad, melainkan kami wahyukan kepadanya ajaran tauhid yang menjadi ajaran dasar para nabi, bahwa tidak ada tuhan yang berhak disembah selain aku, maka sembahlah aku dengan mengikuti petunjuk-ku."
  }
]