[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidak mengutus sebelummu (wahai rasul) seorang rasul kecuali Kami wahyukan kepadanya bahwa sesungguhnya tidak ada sesembahan yang haq selain Allah. Maka murnikanlah ibadah kepadaNya saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan Kami tidaklah mengutus sebelum engkau -wahai Rasul- seorang Rasul pun melainkan Kami mewahyukan kepadanya bahwa tiada tuhan yang berhak disembah selain Aku, maka sembahlah Aku semata, dan jangan menyekutukan-Ku dengan sesuatu pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Hai Rasulullah, Tidaklah Kami mengutus seorang rasul sebelummu melainkan telah Kami wahyukan kepadanya bahwa tidak ada Tuhan yang berhak disembah selain Allah, maka sembahlah Allah semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَمَآ أَرْسَلْنَا مِن قَبْلِكَ مِن رَّسُولٍ إِلَّا نُوحِىٓ إِلَيْهِ أَنَّهُۥ لَآ إِلٰهَ إِلَّآ أَنَا۠ (Dan Kami tidak mengutus seorang rasulpun sebelum kamu melainkan Kami wahyukan kepadanya: “Bahwasanya tidak ada Tuhan (yang hak) melainkan Aku) Dalam ayat ini terdapat pengukuhan terhadap keesaan Allah dan itu merupakan jalan para Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Wahai Rasulallah, Kami tidak mengutus rasul terdahulu sebelummu kecuali Kami mewahyukan untuknya bahwa tiada Tuhan yang layak disembah dengan haq kecuali Aku, Allah. Maka menyembahlah hanya kepadaKu, bukan selainKu. Ini adalah ikrar tauhid."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus seorang rasul pun sebelum kamu melainkan Kami mewahyukan kepadanya bahwa tidak ada tuhan selain Aku. Maka sembahlah Aku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Ketika Allah mengalihkan pembicaraan tentang orang-orang terdahulu dan memerintahkan untuk mengaca kepada mereka dalam masalah ini, maka DIa menerangkan dengan keterangan yang sangat jelas dalam FirmanNya, “Dan tidaklah Kami mengutus seorang rasul sebelum kamu, melainkan pasti Kami wahyukan kepadanya, ‘Bahwasanya tidak ada tuhan (yang berhak disembah) melainkan Aku, maka kalian sembahlah Aku’.” Seluruh utusan Allah sebelummu yang diutus dengan dibekali itab-kitab, intisari misi dan prinsipnya ialah perintah untuk beribadah kepada Allah semata, tiada sekutu bagiNya, serta penjelasan bahwa Dia-lah Dzat Yang Mahabenar lagi disembah dan bahwa peribadahan kepada selainNya adalah batil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 25: Oleh karena itu, semua rasul dan semua kitab memerintahkan manusia menyembah hanya kepada Allah saja dan meninggalkan sesembahan selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 25",
    "description": "Tugas para rasul sejak nabi adam hingga nabi Muhammad adalah menyampaikan wahyu kepada umat. Dan kami, tidak mengutus seorang rasul pun, baik yang disebutkan namanya di dalam Al-Qur'an maupun yang tidak disebutkan, sebelum engkau, Muhammad, melainkan kami wahyukan kepadanya ajaran tauhid yang menjadi ajaran dasar para nabi, bahwa tidak ada tuhan yang berhak disembah selain aku, maka sembahlah aku dengan mengikuti petunjuk-ku. 26. Menanggapi ajaran tauhid itu, mereka, orang-orang musyrik mekah berkata tanpa argumentasi yang masuk akal, 'tuhan yang maha pengasih telah menjadikan para malaikat sebagai anak tuhan. ' Allah pun membantah pandangan sesat itu dengan menyatakan, bahwa mahasuci dia dari segala sifat yang dinisbahkan kepada Allah. Sebenarnya mereka, para malaikat itu, adalah hamba-hamba yang dimuliakan, senantiasa bertasbih, memuji Allah, mematuhi perintah-Nya, tanpa pernah membantah sedikit pun."
  }
]