[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-27. Orang-orang musyrikin berkata, “Allah yang Maha Rahman mengambil seorang anak,” sesuai dengan asumsi mereka bahwa sesungguhnya malaikat itu adalah anak-anak perempuan Allah. Mahasuci Allah dari pernyataan tersebut. Malaikat itu adalah hamba-hamba Allah, mereka dekat dan memiliki sekian banyak keutamaan. Dan mereka dalam ketaatan yang baik; tidak berbicara kecuali dengan perintah yang di perintahkan Tuhan mereka kepada mereka, dan tidak mengerjakan suatu perbuatan, kecuali setelah Allah mengizinkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan orang-orang musyrik itu berkata, \"Allah telah menjadikan para Malaikat itu sebagai anak perempuan-Nya.\" Sungguh Allah Mahasuci lagi Agung dari apa yang mereka ucapkan secara dusta, tetapi para Malaikat hanyalah hamba-hamba Allah yang mendapatkan kemuliaan dan kedekatan dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Allah mengabarkan kebodohan orang-orang musyrik yang menganggap para malaikat adalah anak-anak perempuan Allah! Maha Suci Allah dari perkataan yang sangat mungkar itu. Dan Allah menyampaikan sifat para malaikat; mereka adalah makhluk yang dimuliakan di sisi-Nya karena mereka sangat mentaati Allah, mereka tidak mengatakan sesuatu hingga Allah berkata terlebih dahulu karena kesempurnaan adab mereka, mereka selalu mentaati perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَقَالُوا۟ اتَّخَذَ الرَّحْمٰنُ وَلَدًا ۗ (Dan mereka berkata: “Tuhan Yang Maha Pemurah telah mengambil (mempunyai) anak”) Mereka adalah orang-orang dari suku Khuza’ah yang beranggapan bahwa para malaikat adalah anak-anak perempuan Allah. سُبْحٰنَهُۥ ۚ( Maha Suci Allah) Maha Suci Allah dari hal itu. بَلْ عِبَادٌ مُّكْرَمُونَ (Sebenarnya (malaikat-malaikat itu), adalah hamba-hamba yang dimuliakan) Yakni para malaikat itu tidak sebagaimana yang mereka anggap, namun mereka adalah para hamba Allah yang dimuliakan-Nya dan dekat dengan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Sebagian orang-orang musyrik Arab, yaitu sebagian mereka berkata: “Tuhan yang Maha Pengasih itu mengambil anak” Sesungguhnya mereka berkata: “para malaikat adalah puteri-puteri Allah” Maha suci Allah dari hal itu. Akan tetapi mereka adalah hamba-hamba Allah yang telah diciptakan dan dekat denganNya. Peribadatan itu sangat bertentangan (berbeda) dengan memiliki anak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Tuhan Yang Maha Pengasih telah mengangkat anak”} menjadikan para malaikat sebagai anak perempuan {Maha suci Dia. Sebaliknya, mereka adalah hamba-hamba yang dimuliakan} dimuliakan dan didekatkan di sisiNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah memberitahukan tentang kebodohan kaum musyrikin yang mendustakan Rasulullah. Mereka mengklaim bahwa –semoga Allah memperburuk keadaan mereka-, “Para malaikat adalah putri-putri Allah!” Mahatinggi Allah dari perkataan mereka. Allah telah mengabarkan tentang posisi malaikat sebagai hamba yang dimiliki dan diatur. Tidak ada hak kewenangan pengaturan alam semesta bagi mereka sedikit pun. Mereka itu (para malaikat) dimuliakan disisi Allah. Allah telah menetapkan dan menjadikan mereka dari kalangan hamba mulia dan sayangNya. Demikian ini karena keutamaan-keutamaan dan kesucian mereka dari perkara-perkara yang menghinakan yang sudah dijadikan oleh Allah sesbagai keistimewaan bagi mereka. Mereka itu berada di puncak kesopanan terhadap Allah dalam menaati perintah-perintahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 26: Ayat ini diturunkan untuk membantah tuduhan-tuduhan orang-orang musyrik yang mengatakan bahwa malaikat-malaikat itu anak Allah, mereka hanyalah hamba-hamba yang dimuliakan di sisi-Nya, dan keadaan mereka sebagai hamba yang senantiasa beribadah kepada-Nya menolak sekali anggapan sebagai anak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 26",
    "description": "Menanggapi ajaran tauhid itu, mereka, orang-orang musyrik mekah berkata tanpa argumentasi yang masuk akal, 'tuhan yang maha pengasih telah menjadikan para malaikat sebagai anak tuhan. ' Allah pun membantah pandangan sesat itu dengan menyatakan, bahwa mahasuci dia dari segala sifat yang dinisbahkan kepada Allah. Sebenarnya mereka, para malaikat itu, adalah hamba-hamba yang dimuliakan, senantiasa bertasbih, memuji Allah, mematuhi perintah-Nya, tanpa pernah membantah sedikit pun. 27. Allah juga menerangkan sifat-sifat malaikat. Mereka tidak berbicara mendahului-Nya, hanya mengucapkan kata-kata yang diperintahkan-Nya. Dan mereka mengerjakan perintah-perintah-Nya tanpa membantah sedikit pun."
  }
]