[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-27. Orang-orang musyrikin berkata, “Allah yang Maha Rahman mengambil seorang anak,” sesuai dengan asumsi mereka bahwa sesungguhnya malaikat itu adalah anak-anak perempuan Allah. Mahasuci Allah dari pernyataan tersebut. Malaikat itu adalah hamba-hamba Allah, mereka dekat dan memiliki sekian banyak keutamaan. Dan mereka dalam ketaatan yang baik; tidak berbicara kecuali dengan perintah yang di perintahkan Tuhan mereka kepada mereka, dan tidak mengerjakan suatu perbuatan, kecuali setelah Allah mengizinkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Mereka tidak lah mendahului-Nya dalam berbicara, sebab mereka tidak mengucapkan satu perkataan kecuali atas perintah-Nya, mereka senantiasa mengerjakan perintah yang diembankan-Nya, dan tidak menyelisihinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. لَا يَسْبِقُونَهُۥ بِالْقَوْلِ (mereka itu tidak mendahului-Nya dengan perkataan) Yakni para malaikat tidak mengatakan sesuatu sampai Allah yang mengakatannya atau memerintahkan mereka untuk mengatakannya. وَهُم بِأَمْرِهِۦ يَعْمَلُونَ (dan mereka mengerjakan perintah-perintah-Nya) Mereka menjalankan apa yang diperintahkan Allah kepada mereka dalam tugas-tugas mereka mengatur para makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Mereka tidak bicara sampai Tuhan memerintahkan mereka dan melaksanakan perintah-perintahNya. Dan mereka itu tidak mengetahui apapun selain perintahNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak mendahuluiNya dalam perkataab} mereka tidak mendahuluiNya dalam perkataan {dan mereka mengerjakan perintah-perintahNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Mereka tidak mendahuluiNya dengan perkataan,” maksudnya mereka tidak mengatakan sebuah ucapan yang berkaitan dengan pengaturan kerajaan alam semesta, sampai Allah menetapkan sesuatu melalui FirmanNya. Hal itu merupakan (cerminan) kesempurnaan adab mereka (di hadapan Allah) dan pengetahuan mereka mengenai kesempurnaan hikmah dan ilmu Allah. “Dan mereka mengerjakan perintah-perintahNya,” maksudnya apa pun yang Allah perintahkan kepada mereka, pasti mereka kerjakan. Mereka tidak melanggar ketentuan Allah meskipun sekajap pandangan mata saja. Tidak ada aktivitas yang mereka jalankan berdasarkan hasrat-hasrat mereka sendiri tanpa titah dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 27: Yakni mereka tidaklah mengatakan suatu ucapan yang terkait tentang pengaturan kerajaan-Nya sampai Allah berfirman karena sempurnanya adab mereka kepada Allah dan pengetahuan mereka tentang sempurnanya kebijaksanaan Allah dan ilmu-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 27",
    "description": "Allah juga menerangkan sifat-sifat malaikat. Mereka tidak berbicara mendahului-Nya, hanya mengucapkan kata-kata yang diperintahkan-Nya. Dan mereka mengerjakan perintah-perintah-Nya tanpa membantah sedikit pun. 28. Para malaikat demikian patuh dan taat kepada Allah karena mereka yakin bahwa dia, senantiasa mengetahui segala sesuatu yang di hadapan mereka, yakni apa yang sedang mereka kerjakan dan mengetahui segala sesuatu yang di belakang mereka, yakni apa yang telah mereka kerjakan; sehingga para malaikat yakin tidak ada satu pun yang luput dari pengetahuan dan pengawasan-Nya. Dan mereka para malaikat, tidak memberi syafaat kepada manusia di akhirat dengan mendoakannya, melainkan kepada orang yang diridai Allah, karena beriman dan beramal saleh; dan mereka, para malaikat itu, selalu berhati-hati karena takut kepada-Nya. Oleh karena itu, mereka senantiasa menjauhkan diri dari mendurhakai atau menyalahi perintah dan larangan-Nya."
  }
]