[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada tugas-tugas yang dikerjakan oleh para malaikat, baik tugas yang sudah berlalu atau tugas mendatang, kecuali Allah mengetahuinya dan akan menghitungnya atas mereka. Dan mereka tidak akan maju memberikan syafa’at, kecuali bagi orang yang dirdhai Allah untuk memperoleh syafa’at dari mereka. Dan mereka itu, karena takut kepada Allah, selalu waspada agar jangan sampai menyelisihi perintah dan larangan NYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dia mengetahui apa yang telah dan yang akan mereka kerjakan, mereka tidak memberikan syafaat (pertolongan) kecuali sesuai izin-Nya dan diperuntukkan kepada orang yang diridai, dan mereka selalu berhati-hati lantaran takut kepada-Nya, sehingga tidak menyelisihi-Nya baik dalam menjalankan perintah ataupun menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Allah mengetahui keadaan dan perbuatan para malaikat serta apa yang akan mereka perbuat. Pada hari kiamat ada yang mendapat syafaat kecuali orang-orang beriman yang mendapat keridhaan Allah, mereka selalu merasa takut kepada Allah. Dan barangsiapa yang berkata aku adalah tuhan selain Allah maka dia telah jauh dari rahmat Allah, dan balasan baginya adalah neraka Jahannam. Azab yang keras tersebut Kami berikan bagi orang yang zalim dan melanggar hak-hak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ (Allah mengetahui segala sesuatu yang dihadapan mereka (malaikat) dan yang di belakang mereka) Allah mengetahui apa yang telah mereka lakukan dan apa yang akan mereka kerjakan, dan mereka tidak melakukan atau mengatakan sesuatu melainkan atas sepengetahuan-Nya. وَلَا يَشْفَعُونَ إِلَّا لِمَنِ ارْتَضَىٰ( dan mereka tiada memberi syafa’at melainkan kepada orang yang diridhai Allah) Yakni yang diridhai Allah untuk memberi syafaat, dan mereka adalah para pemilik ketauhidan. وَهُم مِّنْ خَشْيَتِهِۦ مُشْفِقُونَ(dan mereka itu selalu berhati-hati karena takut kepada-Nya) Makna (الخشية) adalah rasa takut disertai pengagungan. Dan makna (الإشفاق) adalah rasa takut disertai kehati-hatian. Yakni para malaikat senantiasa takut kepada Allah dengan sebenar-benarnya karena mereka mengetahui Allah dengan baik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Barangsiapa yang merasa memiliki banyak dosa, dan ingin Allah menghapusnya tanpa ia merasa capek; hendaklah ia senantiasa menempati tempat shalatnya; untuk meminta doa para Malaikat dan permohonan ampunan mereka untuknya, dan itu sangat menjamin datangnya ijabah; sebagaimana firman Allah : { وَلَا يَشْفَعُونَ إِلَّا لِمَنِ ٱرْتَضَىٰ } \"dan mereka tiada memberi syafa'at melainkan kepada orang yang diridhai Allah\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Dan mereka itu mengetahui apa yang telah mereka kerjakan dan apa yang akan mereka kerjakan di masa mendatang. Dan mereka itu tidak memberi syafaat kecuali untuk orang yang diijinkan untuk diberi syafaat karena memuliakanNya (Allah). Dan mereka itu karena mengagungkan dan memuliakan Allah SWT, mereka menggigil ketakutan. Al-Khasyah adalah ketakutan disertai dengan pengagungan, dan Al-Isyfaq adalah ketakutan yang disertai dengan kewaspadaan dan kehati-hatian yang dahsyat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mengetahui segala sesuatu yang ada di hadapan mereka dan yang ada di belakang mereka. Mereka tidak memberi syafaat melainkan kepada orang yang Dia ridhai dan mereka selalu berhati-hati} hati-hati agar tidak menentang parintah dan laranganNya {karena takut kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Kendatipun begitu, ilmu Allah meliputi mereka semua. Dia megetahui “segala sesuatu yang di hadapan mereka (malaikat) dan yang ada di belakang mereka,” maksudnya, urusan-urusan mereka yang telah berlalu dan yang akan terjadi di kemudian hari. Mereka tidak pernah lepas dari ilmu Allah, sebagaimana mereka tidakk bisa terpisah dari ketetapan dan pengaturanNya. Dan di antara muatan makna karakteristik mereka yang lebih terperinci dari sifat “Tidak mendahului Allah dengan perkataan” adalah mereka tidak memberikan syafaat bagi siapa pun tanpa seizin dan ridhaNya. Jika Allah sudah mengizinkan mereka dan ridha terhadap orang yang akan menerima syafaat mereka, baru mereka dapat mengeluarkan syafaat. Hanya saja, Allah tidak meridhai perkataan dan tindakan kecuali yang murni hanya untuk wajahNya, dan mengikuti Rasululah dalam perkkataan dan tindakannya. Ayat ini termasuk dalil yang menunjukkan ketetapan adanya syafaat, dan bahwa para malaikat memohonkan syafaat “dan mereka itu selalu berhati-hati karena takut kepadaNYa,” maksudnya mereka itu diliputi rasa takut dan khawatir, mereka telah merendahkan diri di hadapan keagunganNya, wajah-wajah mereka telah tertunduk kepada kemuliaan dan keindahanNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 28: Yakni apa yang telah mereka kerjakan. Yang sedang mereka kerjakan. Ucapan dan amalnya, yaitu orang yang ikhlas dan mengikuti rasul-Nya shallallahu 'alaihi wa sallam. Ayat ini termasuk dalil adanya syafaat, dan bahwa para malaikat juga memberi syafaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 28",
    "description": "Para malaikat demikian patuh dan taat kepada Allah karena mereka yakin bahwa dia, senantiasa mengetahui segala sesuatu yang di hadapan mereka, yakni apa yang sedang mereka kerjakan dan mengetahui segala sesuatu yang di belakang mereka, yakni apa yang telah mereka kerjakan; sehingga para malaikat yakin tidak ada satu pun yang luput dari pengetahuan dan pengawasan-Nya. Dan mereka para malaikat, tidak memberi syafaat kepada manusia di akhirat dengan mendoakannya, melainkan kepada orang yang diridai Allah, karena beriman dan beramal saleh; dan mereka, para malaikat itu, selalu berhati-hati karena takut kepada-Nya. Oleh karena itu, mereka senantiasa menjauhkan diri dari mendurhakai atau menyalahi perintah dan larangan-Nya. 29. Allah menjamin tidak ada malaikat yang mengaku tuhan selain Allah. Dan barang siapa di antara mereka, para malaikat, berkata, 'sungguh, aku adalah tuhan selain Allah, ' maka kami akan memberi balasan kepadanya, baik malaikat maupun manusia yang mengaku tuhan, dengan jahanam. Demikianlah kami memberikan balasan kepada orang-orang yang zalim, karena mengaku dirinya tuhan, padahal sebenarnya hamba Allah. Pengakuan semacam ini merupakan kemusyrikan yang sangat besar. Selain mempersekutukan Allah, juga menyamakan derajat dirinya dengan Allah."
  }
]