[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan siapa saja yang mengklaim diri dari kalangan malaikat bahwa ia itu sesembahan bersama Allah (sebagai perumpamaan saja) maka balasan baginya adalah Neraka Jahanam. Dengan balasan seperti itu, Kami akan membalas tiap-tiap orang yang zhalim lagi berbuat syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan barangsiapa di antara Malaikat itu berkata -walaupun ini mustahil terjadi- , \"Sesungguhnya aku adalah tuhan selain Allah,\" maka sungguh Kami akan memberinya balasan karena ucapannya itu dengan azab Neraka Jahanam pada hari Kiamat kelak, ia kekal di dalamnya. Balasan seperti ini pula yang Kami akan berikan kepada mereka orang-orang zalim yang kafir dan berbuat syirik kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَمَن يَقُلْ مِنْهُمْ إِنِّىٓ إِلٰهٌ مِّن دُونِهِۦ (Dan barangsiapa di antara mereka, mengatakan: “Sesungguhnya Aku adalah tuhan selain daripada Allah”) Yakni barangsiapa diantara para malaikat mengatakan “aku adalah tuhan selain Allah.” فَذٰلِكَ نَجْزِيهِ جَهَنَّمَ ۚ (maka orang itu Kami beri balasan dengan Jahannam) Yakni malaikat yang mengatakan damikian –sebagai pengandaian semata— maka akan Kami balas dengan Jahannam akibat perkataannya itu, sebagaimana Kami membalas orang-orang berdosa lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Barangsiapa di antara para malaikat atau para makhluk berasumsi dengan berkata: “Sesungguhnya aku adalah Tuhan selain Allah,” seperti Iblis yang mengajak (orang) untuk menyembah dirinya, maka Kami akan menghukumnya di neraka Jahannam. Seperti itulah, Kami membalas orang-orang musyrik dan setiap orang yang menganggap diri sebagai Tuhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja di antara mereka} malaikat {yang berkata,“Sesungguhnya aku adalah tuhan selain Dia”} selain Allah {maka (dia) itu Kami beri balasan dengan neraka Jahanam. Demikianlah Kami memberi balasan kepada orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Setelah Allah menjelaskan bahwa mereka (para malaikat) tidak mempunyai hak uluhiyah (sebagai ilah) dan tidak berhak untuk diibadahi sedikit pun, menilik sifat-sifat yang sudah Alah sebutkan tentang mereka yang menuntut (makna bahwa) mereka tidak pantas untuk diibadahi, maka Allah menerangkan pula bahwa mereka tidak punya bagian (uluhiyah) walaupun dengan dasar klaim belaka, dan bahwa bila ada di antara mereka yang mengklaim diri sebagai sesembahan selain Allah kendatipun dalam bentuk imajinatif dan mengakomodasi pendapat lain yang keliru, “maka orang itu Kami beri balasan dengan Jahannam. Demikianlah Kami memberi balasan kepada orang-orang zhalim,” apakah ada kezhaliman yang lebih parah dari klaim seorang makhluk yang lemah lagi memmbutuhkan (bantuan) Allah dalam segala aspek kehidupannya (yang mengaku-ngaku) bersekutu dengan Allah dalam hak-hak istimewa ilahiyah dan rububiyah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 29: Setelah Allah menerangkan, bahwa mereka (malaikat) tidak berhak disembah, Dia menerangkan bahwa jika di antara mereka ada yang berani mengatakan bahwa dirinya adalah tuhan di samping Allah, maka Allah akan memberinya balasan dengan neraka Jahanam. Ada yang berpendapat, bahwa yang berkata seperti ini adalah Iblis, di mana ia mengajak manusia menyembah dirinya dan memerintahkan untuk menaatinya. Sebagaimana orang itu Kami balas dengan Jahanam. Yakni orang-orang musyrik. Mereka adalah orang-orang zalim, karena kezaliman apa lagi yang lebih besar daripada pengakuan makhluk yang lemah, fakir lagi memiliki kekurangan setara dengan Allah dalam keberhakannya diibadahi dan dalam rububiyyah (kepengaturannya) terhadap alam semesta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 29",
    "description": "Allah menjamin tidak ada malaikat yang mengaku tuhan selain Allah. Dan barang siapa di antara mereka, para malaikat, berkata, 'sungguh, aku adalah tuhan selain Allah, ' maka kami akan memberi balasan kepadanya, baik malaikat maupun manusia yang mengaku tuhan, dengan jahanam. Demikianlah kami memberikan balasan kepada orang-orang yang zalim, karena mengaku dirinya tuhan, padahal sebenarnya hamba Allah. Pengakuan semacam ini merupakan kemusyrikan yang sangat besar. Selain mempersekutukan Allah, juga menyamakan derajat dirinya dengan Allah. 30. Orang-orang kafir tidak berpikir jernih dalam mengamati fenomena alam, padahal peristiwa yang ada di alam ini merupakan bukti adanya Allah dan kekuasaan-Nya yang mutlak. Allah bertanya, \"dan apakah orang-orang kafir, kapan dan di mana saja mereka hidup, tidak memperhatikan secara mendalam bahwa langit dan bumi sebelum terjadi ledakan besar, keduanya dahulu menyatu, kemudian kami pisahkan antara kedua-Nya dengan mengangkat langit ke atas dan membiarkan bumi seperti apa adanya; dan kami jadikan segala sesuatu yang hidup berasal dari air; 'kehidupan dimulai dari air (laut), makhluk hidup berasal dari cairan sperma dan air bagian yang penting bagi makhluk hidup' maka mengapa mereka, orang-orang kafir itu tidak tergerak hatinya untuk beriman kepada Allah'\"."
  }
]