[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hati mereka lalai terhadap al-Qur’an al-Karim, disibukkan dengan kebatilan-kebatilan dan syahwat-syahwat dunia; mereka tidak memahami kandungannya. Bahkan sesungguhnya orang-orang yang dzolim dari bangsa Quraisy berkumpul untuk satu rencana rahasia; yaitu menyebarluaskan sesuatu yang dapat menghalangi manusia untuk beriman kepada Muhammad sholallohu alaihi wasallam, yaitu bahwa sesungguhnya dia adalah manusia biasa seperti mereka, tidak berbeda dari mereka dalam aspek apa pun, dan bahwa sesungguhnya apa yang dibawanya, yaitu al-Qur’an adalah sihir, maka mengapa kalian datang kepadanya dan mengikutinya, padahal kalian tahu dia hanya manusia biasa seperti kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Mereka mendengarkannya sedang hati mereka dalam keadaan lalai darinya. Dan orang-orang yang zalim dengan kekafirannya itu merahasiakan pembicaraan rahasia yang mereka rundingkan dengan mengatakan, \"Orang ini (Muhammad) yang mengklaim bahwa ia utusan Allah tidak lain hanyalah manusia biasa seperti kalian, ia tidak memiliki keistimewaan apa-apa dari kalian!? Apa yang ia bawa hanyalah sihir belaka, maka apakah kalian akan mengikutinya padahal kalian sendiri mengetahui bahwa ia hanyalah manusia sama seperti kalian, serta apa yang dibawanya hanyalah sihir?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Mereka lalai dari apa yang Nabi datangkan kepada mereka, dan mereka sangat merahasiakan permusuhan dan kedustaan mereka dengan membisikkan: “Muhammad hanyalah manusia seperti kalian, tidak ada yang istimewa darinya, maka bagaimana dia dapat menjadi nabi? Dan al-Qur’an yang dia datangkan itu hanyalah sihir, lalu mengapa kalian mengikutinya padahal kalian telah mengetahui kalau itu adalah sihir?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. لَاهِيَةً قُلُوبُهُمْ ۗ (hati mereka dalam keadaan lalai) Hati mereka tidak menengok pada urusan yang sangat penting itu. وَأَسَرُّوا۟ النَّجْوَى الَّذِينَ ظَلَمُوا۟ (Dan mereka yang zalim itu merahasiakan pembicaraan mereka) Mereka sangat merahasiakan apa yang mereka bisikkan, yaitu perkataan mereka (Orang ini tidak lain hanyalah seorang manusia seperti kalian) tidak berbeda sedikitpun dengan kalian, diia makan dan minum, mempunyai keturunan dan dapat meninggal, bagaimana dia dapat menjadi seorang Nabi? أَفَتَأْتُونَ السِّحْرَ وَأَنتُمْ تُبْصِرُونَ(maka apakah kamu menerima sihir itu, padahal kamu menyaksikannya?) Jika dia hanya seorang manusia seperti kalian dan yang dia bawa adalah sihir, bagaimana kalian mengikutinya?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "2-3 Wahyu terus diturunkan namun mereka tetap saja tidak mendapatkan manfaat darinya dan tidak pula mereka mentadabburinya; tahukan kalian penyebabnya apa ? { يَلْعَبُونَ , لَاهِيَةً قُلُوبُهُمْ } \"sedang mereka bermain-main , (lagi) hati mereka dalam keadaan lalai\" dan barangsiapa dari kaum muslimin yang mengikut jejak mereka akan mendapatkan seperti yang didapat oleh mereka sesuai kelalaian dan keberpalingannya. Ayat ini juga memberikan isyarat bahwa diantara kunci untuk mengambil manfaat dari bacaan al-Quran adalah : ketenagan jiwa dan hati dalam mendengarkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Hati mereka lalai dan terlalu sibuk sehingga tidak mau mempelajari Al-Qur’an dan memakami maknanya. Dan orang-orang musyrik yang zalim itu merahasiakan dengan sungguh-sungguh rahasia di antara mereka dengan berkata: “Apakah dia ini (yaitu Muhammad) maksudnya yaitu dia ini tidak lain hanyalah manusia biasa seperti yang lainnya, Dia tidak memiliki kelebihan atas kalian, Dia makan dan minum, lalu bagaimana bisa dia bisa menjadi nabi?! Apakah kalian akan mengikuti sihir, yaitu Al-Qur’an? Sedangkan kalian menyaksikan dan mengetahui bahwa Al-Qur’an itu sihir?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hati mereka dalam keadaan lalai} lalai {Orang-orang yang zalim itu merahasiakan pembicaraan} orang-orang yang musyrik merahasiakan pembicaraan yang rahasia di antara mereka {“Bukankah (orang) ini tidak lain hanya seorang manusia seperti kalian. Apakah kalian mengikuti} mengikuti {sihir itu} Al-Qur’an (sesuai anggapan orang-orang kafir) {padahal kalian menyaksikannya\"} mengetahui bahwa itu adalah sihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “(Lagi) hati mereka dalam keadaan lalai,” maksudnya hati mereka lalai, berpaling, dan terbuai dengan orientasi-orientasi keduniaan. Fisik-fisik mereka hanya bermain-main. Mereka larut dengan pemenuhan syahwat dan praktik kebatilan, serta perkataan-perkataan yang picisan. Padahal, seyogyanya mereka tidak bersifat demikian; misalnya hati mereka menyambut perintah dan larangan Allah, mendengarkanNYa dengan cara yang menjadikannya memahami maksudNYa. Anggota-anggota tubuhnya bergerak untuk menjalankan ibadah yang menjadi tujuan penciptaan diri mereka. Dan sepatutnya pula, mereka menempatkan Hari KIamat, perhitungan amalan dan pembalasannya di benak-benak mereka. Dengan itulah nanti, urusan merekka menjadi sempurna, kondisi mereka semakin lurus dan amalan mereka menjadi bersih. Tentang makna Firman Allah “telah dekat kepada manusia (hari) perhitungan segala amalan mereka,” terdapat dua pendapat: Pendapat pertama: Umat ini (Umat Islam) merupakan umat yang paling terakhir. RasulNYa pun rasul yang terakhr. Hari Kiamat akan terjadi pada umat beliau. (Karena itu) sungguh Hari Kiamat telah dekat dengan mereka dibandingkan dengan umat-umat sebelumnya. Berdasarkan sabda beliau \"aku diutus dan kiamat itu haya seperti ini jaraknya\" Beliau menyandingkan jari telunjuknya dengan jari yang berada di sampingnya (jari tengah). Pendapat kedua: Yang dimaksud dengan dekatnya Hari HIsab (perhitungan amalan) adalah kematian. Bahwa orang yang meninggal, maka Kiamat sudah terjadi baginnya, dan dia memasuki kampung pembalasan atas amalan-amalannya. Ayat ini merupakan ungkapan keheranan terhadap orang yang terbuai dan berpaling, dia tidak tahu, kapan kematian mengagetkannya, pagi atau siang. Demikian ini kondisi orang-orang secara keseluruhan, kecuali orang-orang yang terlimpahi perhatian ilahi, maka dia mempersiapkan diri untuk kematian dan tahapan hidup selanjutnya. Selanjutnya, Allah menceritakan tentang topic yang dibahas oleh kaum kkafir dan orang-orang yang zhalim secara sembunyi-sembunyi dalam rangka menentang dan melawan kebenaran dengan kebatiilan. Mereka itu menjalin kesepakatan di antara mereka untuk melontarkan komentar tentang rasul, “SEsungguhnya dia adalah manusia biasa layaknya kalian. Maka, apakah yang menyebabkannya lebih utama dan lebih istimewa dari pada kalian? Seandainya ada salah seorang diantarakalian mengklaim seperti pemgakuannya, niscaya ungkapannya adalah sejenis dengan ungkapan Raslullah. Namun, (dia melakukan hal itu) lantaran ingin lebih tinggi dari kalian dan memjadi pimpinan atas kalian. Oleh karenanya, janganlah kalian menaatinya dan jangan pula mempercayainya. Ia adalah tukang sihir. Dan Al-Quran yang dia bawa merupakan sihir juga. Larilah darinya, serta jauhkan orang-orang darinya.” Dan katakanlah, “Maka apakah kamu menerima sihir itu, padahal kamu menyaksikannya.” Beginilah yang mereka ucapkan, padahal mereka mengetahui bahwa dia benar-benar adalah utusan Allah, berdasarkan apa yang mereka saksikan, berupa tanda-tanda kekuasaan yang mencengangkan yang tidak disaksikan oleh orang selain mereka. Tetapi, perkara yang menyeret mereka melakukan penolakan, yaitu suratan takdir kebinasaan (pada mereka), kezhaliman, dan sifat penentangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 3: Padahal keadaan mereka seharusnya tidak seperti itu. Seharusnya hati mereka menerima perintah Allah dan telinga mereka mendengarkan dengan pendengaran yang meresap sampai ke hati, dan anggota badan mereka diarahkan untuk beribadah, di mana untuk itulah mereka diciptakan, serta memberikan perhatian terhadap hari kiamat, hisab dan pembalasan sehingga urusan mereka menjadi baik dan keadaan mereka lurus serta bersih amalnya. Sebagai bentuk pembangkangan dan sikap menolak yang hak dengan yang batil. Mereka mengadakan pembicaraan rahasia dan bersepakat untuk berkata tentang Rasulullah shallallahu 'alaihi wa sallam perkataan yang memojokkan, menyebutkan bahwa Beliau adalah manusia seperti halnya yang lain dan bertujuan untuk dilebihkan oleh manusia sehingga tidak perlu ditaati dan dibenarkan, dia adalah seorang pesihir dan bahwa apa yang dibawanya adalah sihir. Oleh karena itu, jauhilah dia dan buatlah orang-orang menjauh. Yang mereka maksud dengan sihir di sini ialah ayat-ayat Al Quran. Bahwa hal itu adalah sihir. Sebenarnya mereka mengetahui bahwa Beliau adalah utusan Allah dengan sebenarnya berdasarkan ayat-ayat yang mereka saksikan yang tidak disaksikan oleh yang lain. Akan tetapi kecelakaan, kezaliman dan pembangkanganlah yang membuat mereka berkata dan bersikap seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 3",
    "description": "Hati mereka dalam keadaan lalai dari Al-Qur'an, sibuk dengan kehi-dupan dunia yang tak bermakna. Mereka tidak memikirkan pesan Al-Qur'an. Dan orang-orang yang zalim di antara pemuka quraisy itu merahasiakan pembicaraan mereka, yang menggambarkan penolakan mereka beriman kepada nabi Muhammad, 'orang ini (Muhammad) tidak lain hanyalah seorang manusia juga seperti kamu. Apakah kamu menerima sihir Muhammad itu, ayat-ayat Al-Qur'an, padahal kamu menyaksikan bahwa yang diucapkannya itu benar-benar sihir'' 4. Dia, nabi Muhammad, berkata kepada orang-orang kafir, bahwa Allah mengetahui pembicaraan yang mereka rahasiakan. 'tuhanku mengetahui secara detail semua perkataan para malaikat di langit dan mengetahui pula semua pembicaraan manusia di bumi, meskipun me-reka merahasiakannya; dan dia maha mendengar semua pembicaraan makhluk-Nya, maha mengetahui semua peristiwa yang sudah, sedang, dan akan terjadi di jagat raya!'."
  }
]