[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang kafir itu tidak mengetahui bahwa sesungguhnya langit dan bumi itu keduanya merupakan suatu obyek yang saling menyatu, tanpa ada pemisah antara keduanya? Maka Tidak ada hujan dari langit dan tidak ada tanaman dari muka bumi. Kemudian Kami memisahkan keduanya dengan Kuasa Kami. Dan Kami turunkan hujan dari langit dan Kami keluarkan tanaman dari dalam tanah, serta Kami menjadikan segala sesuatu hidup dari air. Apakah orang-orang yang ingkar itu tidak mau beriman, lalu mengimani apa yang mereka saksikan dengan menghususkan ibadah bagi Allah saja?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Dan apakah orang-orang yang kafir kepada Allah itu belum mengetahui bahwa langit dan bumi keduanya dahulu menyatu, tidak ada celah dan ruang di antara keduanya yang bisa dilalui turunnya air hujan, kemudian Kami pisahkan antara keduanya, dan menjadikan segala makhluk berupa hewan dan tumbuhan berasal dari air yang turun dari langit ke bumi. Apakah mereka tidak mengambil pelajaran darinya, dan beriman kepada Allah semata?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Allah menegur orang-orang kafir yang tidak mengambil manfaat dari ayat-ayat kauniyah: “Tidakkah mereka mengetahui langit dan bumi dahulu adalah sesuatu yang menyatu, kemudian Kami memisahkan keduanya. Dan Kami jadikan air sebagai asal seluruh makhluk hidup dan sebab dari kehidupan; apakah mereka tidak beriman kepada ayat-ayat kauniyah ini yang menjadi petunjuk atas keesaan Allah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. أَوَلَمْ يَرَ الَّذِينَ كَفَرُوٓا۟ (Dan apakah orang-orang yang kafir tidak mengetahui) Yakni tidakkah mereka memikirkan dan mengetahui. أَنَّ السَّمٰوٰتِ وَالْأَرْضَ كَانَتَا رَتْقًا(bahwasanya langit dan bumi itu keduanya dahulu adalah suatu yang padu) Terdapat pendapat mengatakan yang dimaksud adalah bahwa dahulu langit-langit hanyalah satu kemudian dipisahkan; begitu juga bumi-bumi. Pendapat lain mengatakan bahwa dahulu langit dan bumi merupakan benda yang satu yang saling menempel. فَفَتَقْنٰهُمَا ۖ( kemudian Kami pisahkan antara keduanya) Yakni Kami pisahkan keduanya. وَجَعَلْنَا مِنَ الْمَآءِ كُلَّ شَىْءٍ حَىٍّ ۖ(Dan dari air Kami jadikan segala sesuatu yang hidup) Yakni Kami hidupkan seluruh makhluk hidup dengan air yang Kami turunkan dari langit atau dengan air yang di lautan. Hal ini meliputi hewan-hewan dan tumbuh-tumbuhan. Dan maknanya adalah air merupakan sebab kehidupan segala makhluk hidup yang ada di bumi. أَفَلَا يُؤْمِنُونَ(Maka mengapakah mereka tiada juga beriman?) Padahal tanda-tanda dari Allah telah cukup untuk menjadikan mereka beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Apakah orang-orang kafir dan musyrik yang menyekutukan Allah dengan tuhan lain tidak mengetahui bahwa sesungguhnya langit dan bumi itu merupakan dua hal yang melekat menjadi satu satuan. Kemudian Kami memisahkan keduanya dan memberi jarak satu sama lain dengan gumpalan udara. Dan Kami ciptakan setiap sesuatu berupa hewan, tumbuhan dan makhluk lain selain keduanya dari air. Apakah mereka tetap tidak membenarkan kekuasaanKu dan keesaanKu?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang-orang kafir itu tidak melihat} mengetahui {bahwa langit dan bumi, keduanya dahulu menyatu} menyatu tidak ada pemisah di antara keduanya {kemudian Kami memisahkan keduanya} Kemudian memisahkan keduanya dengan udara {dan Kami menjadikan segala sesuatu yang hidup berasal dari air. Maka apakah mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Apakah mereka (yang kafir terhadap Rabb mereka dan mengingkari pengikhlasan ibadah bagiNya) tidak menyaksikan sebuah obyek kasat mata yang akan mengantarkan mereka menuju keyakinan bahawa Allah, Dia-lah Rabb segala sesuatu, Dzat Yang Maha Terpuji, Dzat Yang Mahamulia dan Dzat yang disembah semata. Dengan menyaksikan langit dan bumi, maka mereka akan menjumpainya dalam keadaan “suatu yang padu,” bagian ini (langit) tidak terlihat adanya mendung maupun hujan. Sementara itu, bagian yang lain (bumi) terlihat diam mati, tanpa tumbuh-tumbuhan padanya. “Kemudian Kami pisahkan,” langit dengan hujan dan bumi dengan tumbuhan. Bukankah Dzat yang menciptakan mendung di langit, setelah kondisi cuaca cerah tanpa ada awan-awan tipis, dan menempatkan air yang deras di dalamnya, kemudian menghalaunya menuju daerah yang mati, yang penjuru-penjuru wilayahnya sudah penuh dengan debu dan airnya sudah semakin menipis, selanjutnya Dia menurunkan hujan di tempat itu, sehingga tanah menjadi bergoyang dan begerak serta berkembang dan menumbuhkan tanaman indah dari setiap jenisnya, yang beragam bentuk dan manfaatnya, bukankah demikian itu merupakan petunjuk bahwa Dia-lah Dzat yang Mahabenar, sedangkan selainNya merupakan sesembahan yang batil. Dia-lah Dzat Yang Menghidupkan orang-orang yang mati dan Dia-lah Dzat Yang Maha Pengasih lagi Maha Penyayang? Karena itu, Allah berfirman, “Maka mengapa mereka tiada juga beriman,” dengan keimanan yang benar, tanpa diselipi unsur keraguan dan kesyirikan. Kemudian Allah menyebutkan sejumlah dalil cakrawala seraya berfirman,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 30: Ada pula yang mengartikan dengan “melihat,” yakni apakah orang-orang kafir tidak melihat bahwa langit dan bumi keduanya sama-sama rekat (tidak terbelah), kemudian Kami belah langit sehingga menurunkan hujan, dan Kami belah bumi sehingga menumbuhkan tumbuh-tumbuhan…dst.” Bukankah yang mengadakan awan di langit yang sebelumnya bersih tanpa gumpalan dan menyimpan di dalamnya air yang banyak, lalu diarahkan ke negeri yang mati yang sebelumnya kering dan berhamburan debu, kemudian diturunkan hujan sehingga tumbuh berbagai tanaman dengan beraneka macam menunjukkan bahwa Allah adalah yang hak dan selain-Nya batil, dan bahwa Dia mampu menghidupkan orang yang telah mati, dan bahwa Dia Maha Pengasih lagi Maha Penyayang? Yakni lalu Kami jadikan langit berjumlah tujuh, dan bumi pun tujuh. Atau maksudnya, dibelah langit yang sebelumnya tidak menurunkan hujan menjadi dapat menurunkan hujan, dan dibelahnya bumi yang sebelumnya tidak dapat menumbuhkan, menjadi dapat menumbuhkan. Dengan iman yang benar tanpa ada keraguan dan kemusyrikan di dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 30",
    "description": "Orang-orang kafir tidak berpikir jernih dalam mengamati fenomena alam, padahal peristiwa yang ada di alam ini merupakan bukti adanya Allah dan kekuasaan-Nya yang mutlak. Allah bertanya, \"dan apakah orang-orang kafir, kapan dan di mana saja mereka hidup, tidak memperhatikan secara mendalam bahwa langit dan bumi sebelum terjadi ledakan besar, keduanya dahulu menyatu, kemudian kami pisahkan antara kedua-Nya dengan mengangkat langit ke atas dan membiarkan bumi seperti apa adanya; dan kami jadikan segala sesuatu yang hidup berasal dari air; 'kehidupan dimulai dari air (laut), makhluk hidup berasal dari cairan sperma dan air bagian yang penting bagi makhluk hidup' maka mengapa mereka, orang-orang kafir itu tidak tergerak hatinya untuk beriman kepada Allah'\"31. Pada ayat ini Allah mengarahkan pandangan manusia kepada gunung-gunung dan jalan-jalan, serta daratan yang luas di bumi. Dan kami telah menjadikan di bumi ini gunung-gunung yang kokoh dengan maksud agar ia, bumi dengan putarannya yang cepat sekali itu, tetap mantap, tidak terjadi guncangan bersama mereka, manusia dan makhluk hidup lainnya. Dan kami jadikan pula di bumi jalan-jalan yang luas supaya semua makhluk dapat dengan tenang menjalani kehidupan, dan pada akhirnya agar mereka mendapat petunjuk Allah, baik yang diberikan melalui wahyu maupun petunjuk Allah berupa fenomena alam yang membentang luas ini."
  }
]