[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menciptakan di muka bumi gunung-gunung untuk mengokohkannya sehingga tidak bergoncang. Dan Kami menjadikan di bumi itu jalan-jalan yang luas, supaya makhluk-makhluk dapat mendapat petunjuk menuju tempat mencari penghidupan mereka dan petunjuk untuk mengesakan Pencipta mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan Kami telah menjadikan di bumi ini gunung-gunung yang kokoh sehingga ia beserta apa yang ada diatasnya tidak mudah guncang, dan Kami jadikan pula di atasnya jalan-jalan yang luas agar dalam perjalanan mereka bisa mendapat petunjuk untuk mencapai tujuan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31-32. Dan Kami menciptakan gunung-gunung yang kokoh di bumi agar dapat mengokohkannya, dan Kami jadikan di bumi itu jalan-jalan yang luas agar mereka dapat mendapat petunjuk dalam perjalanan mereka dan sebagai kemaslahatan mereka, serta Kami jadikan langit dunia sebagai atap bagi bumi yang terjaga dari keruntuhan dan dari setan. Namun orang-orang kafir tidak pedulu dan tidak memikirkan ayat-ayat kauniyah ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَجَعَلْنَا فِى الْأَرْضِ رَوٰسِىَ (Dan telah Kami jadikan di bumi ini gunung-gunung yang kokoh) Yakni pegunungan yang kokoh. أَن تَمِيدَ بِهِمْ(supaya bumi itu (tidak) goncang bersama mereka) Yakni agar bumi tidak goncang bersama mereka. وَجَعَلْنَا فِيهَا(dan telah Kami jadikan (pula) di bumi itu) Yakni di bumi. فِجَاجًا(sesuatu yang luas) Yakni jalan-jalan. Menurut az-Zajjaj makna (الفجاج) adalah celah diantara dua gunung. سُبُلًا(berupa jalan-jalan) Yakni jalan-jalan yang terbuka. لَّعَلَّهُمْ يَهْتَدُونَ(agar mereka mendapat petunjuk) Petunjuk menuju berbagai maslahat kehidupan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Dan Kami jadikan di bumi itu gunung-gunung yang kokoh supaya tidak bergetar dan terguncang oleh mereka (manusia). Dan Kami jadikan di gunung-gunung itu jalan-jalan yang terbuka lebar supaya mereka mendapat petunjuk menuju kesejahteraan mereka dalam bepergian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menjadikan di bumi gunung-gunung yang kokoh} gunung-gunung yang kokoh {agar (tidak) bergoncang} agar tidak bergoncang {bersama mereka dan Kami menjadikan di sana jalan-jalan yang luas} jalan-jalan dan lintasan yang luas {agar mereka mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Di antara bukti kekuasaanNya dan kesempurnaan keesaan dan rahmatNya, yaitu bahwa tatkala bumi tidak dapat diam kecuali dengan keberadaan gunung-gunung, maka Allah memancangkannya, dan menempatkannya sebagai pasak padanya, agar bumi tidak bergerak-gerak, hingga manusia tidak bisa menenangkan diri padanya, tidak dapat membajak (tanah) nya dan tidak bisa menghuninya. Selanjutnya, Allah memancangkannya dengan gunung-gunung. Dengan itu, terwujudlah berbagai masalahat dan kemanfaatan yang dapat dinikmati. Ketika keberadaan gunung-gunung yang saling menyambung dengan bagian lainnya, dalam bentuk barisan yang begitu banyak sekali, bila tetap dalam bentuknya, gunung-gunung yang tinggi, puncak-puncaknya menjulang, tentulah menyebabkan kelumpuhan hubungan antara banyak wilayah. Di antara (cerminan) hikmah Allah dan rahmatNya, Allah menjadikan antara gunung-gunung tersebut “jalan-jalan yang luas,” yaitu jalan-jalan yang mudah dilalui tanpa ada kesulitan dalam menempuhnya. “Agar mereka mendapat petunjuk,” menuju negeri-negeri yang diinginkan. Semoga mereka mendapatkan petunjuk dengan itu tentang keesaan al-Mannan (Allah Dzat Yang Maha Memberi)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 31: Selanjutnya Allah menyebutkan kembali dalil-dalil yang ada di alam semesta yang menunjukkan keesaan-Nya, kekuasaan-Nya, rahmat-Nya dan keberhakan-Nya untuk diibadahi tidak selain-Nya. Sesungguhnya dataran yang kita kelilingi ini di atas perairan yang luas. Agar dataran ini tidak goyang, maka Allah Subhaanahu wa Ta'aala tancapkan gunung-gunung. Ke tempat yang mereka tuju."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 31",
    "description": "Pada ayat ini Allah mengarahkan pandangan manusia kepada gunung-gunung dan jalan-jalan, serta daratan yang luas di bumi. Dan kami telah menjadikan di bumi ini gunung-gunung yang kokoh dengan maksud agar ia, bumi dengan putarannya yang cepat sekali itu, tetap mantap, tidak terjadi guncangan bersama mereka, manusia dan makhluk hidup lainnya. Dan kami jadikan pula di bumi jalan-jalan yang luas supaya semua makhluk dapat dengan tenang menjalani kehidupan, dan pada akhirnya agar mereka mendapat petunjuk Allah, baik yang diberikan melalui wahyu maupun petunjuk Allah berupa fenomena alam yang membentang luas ini. 32. Allah mengarahkan manusia agar memperhatikan benda-benda langit yang diciptakan-Nya dengan teratur. Dan kami menjadikan langit sebagai atap yang terpelihara, tanpa tiang, tetapi tidak jatuh bergugur-an atau bertabrakan satu sama lainnya, namun mereka, orang-orang yang pikiran dan sanubarinya tertutup, tetap berpaling dari tanda-tanda kebesaran Allah itu berupa matahari, bulan, angin, awan, dan lain-lain sehingga mereka tetap tidak beriman kepada Allah."
  }
]