[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menjadikan langit itu sebagai atap bagi bumi yang tidak ditopang oleh tiang. Langit itu terpelihara, tidak akan runtuh, dan tidak ditembus oleh setan-setan. Sedang orang-orang kafir itu lalai dari mengambil pelajaran dengan tanda-tanda Kuasa Allah yang ada di langit (matahari, bulan, dan bintang-bintang) lagi melupakan untuk memikirkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan Kami menjadikan langit tanpa tiang sebagai atap yang terjaga agar tidak roboh, dan serta terjaga agar tidak ada pencurian berita langit. Akan tetapi orang-orang musyrik itu tetap berpaling dan tidak mau mengambil pelajaran dari tanda-tanda kebesaran Allah yang ada di langit seperti matahari dan bulan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَجَعَلْنَا السَّمَآءَ سَقْفًا مَّحْفُوظًا ۖ (Kami menjadikan langit itu sebagai atap yang terpelihara) Yakni terjaga agar tidak jatuh ke bumi. Menurut Imam al-Farra’, yakni langit terjaga dengan lemparan bintang-bintang kepada para setan yang hendak mencuri kabar berita dari langit. وَهُمْ عَنْ ءَايٰتِهَا مُعْرِضُونَ(sedang mereka berpaling dari segala tanda-tanda (kekuasaan Allah) yang terdapat padanya) Mereka tidak mentadabburi tanda-tanda kebesaran Allah seperti matahari, bulan, dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dan Kami jadikan langit di atas bumi itu seperti atap untuk melindunginya dari kejadian buruk dengan kekuasaanNya. Dan mereka itu menolak tanda-tanda dan dalil-dalil langit yang menunjukkan kepada keesaan, kekuasaan dan kebijaksanaan Allah seperti matahari, bulan dan lain-lain. Mereka tidak mau merenunginya dan memikirkan tentang penciptaannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjadikan langit sebagai atap} bagi bumi {yang terpelihara} agar tidak runtuh dan tidak ada pencurian pendengaran (tentang kabar langit oleh setan) {tetapi mereka tetap berpaling dari tanda-tandanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32-33. “Dan Kami jadikan langit itu sebagai atap,” bagi bumi yang kalian berada di atasnya “yang terpelihara,” dari kerobohan, \"Sesungguhnya Allah menahan langit dan bumi supaya jangan lenyap; dan sungguh jika keduanya akan lenyap tidak ada seorang pun yang dapat menahan keduanya selain Allah. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.\" (Fathir:41). Juga terlindungi dari pencurian pendengaran yang dilakukan oleh setan-setan “sedang mereka berpaling dari segala tanda-tanda (kekuasaan Allah) yang terdapat padanya,” maksudnya, lalai dan lupa diri. Ini umum sifatnya pada semua tanda-tanda kebesaran Allah yang berada di langit, berupa ketinggian, keluasan, kebesaran, dan warnanya yang elok serta keharmonisannya yang mengagumkan dan panorama-panorama lainnya. Di dalamnya, terdapat planet-planet yang statis dan yang beredar, matahari dan bulannya yang terang benderang yang mengakibatkan terjadinya malam dan siang, dan sifat keberadaannya yang senantiasa beredar di dalam porosnya. Begitu pula, bintang-bintang yang memunculkan kemanfaatan bagi umat manusia, karena berpengaruh atas kemunculan cuaca panas, dingin, dan (pergantian) musim-musim dalam setahun. (Dengan itu) mereka pun menjadii tahu mengenai perhitungan waktu-waktu ibadah dan muamalah mereka. Di malam hari, mereka beristirahat, merasakan ketenangan dan ketentraman. Di siang harainya, mereka bertebaran dan mencari penghidupan. Semua perkara ini bila direnungi oleh seseorang yang cerdas dan memandangnya dengan cermat, niscaya dia akan yakin dengan seyakin-yakinnya tanpa ada keraguan apa pun bahwasanya Allah –lah yang mengaturnya berdasarkan ketentuan-ketentuan waktu pada tempo yang sudah dicanangkan sampai batas akhir yang pasti. Pada rentang waktu itu, manusia memenuhi hajat-hajatnya, dan kemanfaatan mereka terpenuhi dengannya. Tujuannya, supaya mereka dapat bersenang-senang dan memperoleh kemaslahatan. Setelah itu, (berbagai hal tadi) akan sirna dan lenyap. Dzat yang melenyapkannya adalah Dzat yang telah menciptakannya. Dan yang akan menjadikannya diam tidak bergerak adalah Dzat yang menggerakannya. Orang-orang mukallaf akan berpindah dari tempat tinggal mereka menuju tempat lain. Di sana, mereka akan menjumpai balasan amal mereka (di dunia) secara penuh dan lengkap. Sehingga dapat diketahui bahwa kegunaan tempat ini (dunia) sesbagai lading (amalan) untuk membidik tempat hunian abadi di (akhirat), dan bahwa dunia hanya merupakan lintasan perjalanan seseorang, bukan tempat huniannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 32: Bagi bumi. Maksud yang terpelihara adalah bahwa segala yang berada di langit itu dijaga oleh Allah dengan peraturan dan hukum-hukum yang menyebabkan dapat berjalannya dengan teratur dan tertib. Bisa juga maksud terpelihara adalah terjaga dari setan-setan pencuri berita dari langit. Tidak mau memikirkannya, padahal dari sana mereka dapat mengetahui bahwa Penciptanya Mahakuasa dan Maha Agung, tidak ada sekutu bagi-Nya. Syaikh As Sa’diy berkata, “Hal ini adalah umum mencakup semua tanda-tanda (kekuasaan Allah) yang ada di langit, dengan ketinggiannya, keluasannya dan kebesarannya, warnanya yang indah, susunannya yang rapi, dan hal lainnya yang dapat disaksikan, seperti bintang-bintang yang kokoh, planet-planet, matahari dan bulan yang bercahaya, di mana dari keduanya muncul malam dan siang, dan keadaannya yang selalu beredar pada orbitnya, demikian pula bintang-bintang sehingga dengan sebab itu manusia memperoleh banyak manfaat, seperti panas, dingin, pergantian musim, dan mereka dapat mengenal perhitungan waktu ibadah dan mu’amalah mereka, mereka dapat beristirahat di malam harinya dan dapat merasakan ketenangan, demikian pula dapat bertebaran di siang harinya serta berusaha untuk hal yang menghidupi mereka. Semua ini, jika dipikirkan oleh orang yang pandai dan diselidiki secara mendalam, akan membuahkan kepastian yang tidak ada keraguan lagi, bahwa Allah membatasinya sampai waktu yang ditentukan, sampai waktu yang pasti, di mana pada waktu-waktu itu manusia dapat memenuhi kebutuhannya, manfaat untuk mereka pun tegak, dan agar mereka dapat bersenang-senang dan mengambil manfaat. Setelah itu, ia akan sirna dan hilang dan akan ditiadakan oleh Yang menciptakannya, diberhentikan oleh yang menggerakannya, dan manusia yang mendapat beban (ibadah) akan berpindah ke tempat selain tempat ini, di mana pada tempat itu mereka mendapatkan balasan terhadap amal mereka secara penuh dan sempurna, dan akan dietahui bahwa maksud dari tempat ini (dunia) adalah sebagai ladang untuk kampung yang kekal, dan bahwa dunia adalah tempat untuk melanjutkan perjalanan, bukan tempat menetap.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 32",
    "description": "Allah mengarahkan manusia agar memperhatikan benda-benda langit yang diciptakan-Nya dengan teratur. Dan kami menjadikan langit sebagai atap yang terpelihara, tanpa tiang, tetapi tidak jatuh bergugur-an atau bertabrakan satu sama lainnya, namun mereka, orang-orang yang pikiran dan sanubarinya tertutup, tetap berpaling dari tanda-tanda kebesaran Allah itu berupa matahari, bulan, angin, awan, dan lain-lain sehingga mereka tetap tidak beriman kepada Allah. 33. Allah lalu mengarahkan perhatian manusia agar memperhatikan kekuasaan-Nya dalam menciptakan waktu malam dan siang. Dan dia-lah, yang telah menciptakan malam untuk istirahat, dan siang untuk mencari penghidupan; dan Allah telah menciptakan matahari yang bersinar di waktu siang dan bulan yang bercahaya di waktu malam. Masing-masing beredar pada garis edarnya dengan setia, patuh dan tunduk kepada hukum alam ciptaan Allah."
  }
]