[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidaklah menjadikan bagi seorang manusia sebelummu (wahai Rasul) keabadian hidup di dunia. Apabila kamu meninggal, apakah mereka akan berharap hidup abadi sepeninggalmu? Ini tidak akan terjadi. Dalam ayat ini termuat satu dalil bahwa nabi Khadir telah wafat, karena dia adalah manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan Kami tidak menjadikan hidup abadi di kehidupan dunia ini bagi seorang manusia pun sebelum engkau -wahai Rasul-, maka bila datang ajalmu dan engkau wafat, apakah mereka tetap akan kekal sepeninggalmu?! Sekali-kali tidak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Hai Rasulullah, Kami tidak menciptakan seorangpun sebelummu yang hidup selamanya tanpa merasakan kematian, maka jika kamu mati apakah mereka akan hidup selamanya setelah kematianmu? Semua jiwa akan mati di dunia ini, tidak ada yang kekal kehidupannya selain Allah Yang Maha Hidup. Dan Kami menguji kalian dengan berbagai musibah dan kenikmatan, agar Kami melihat kesabaran dan rasa syukur kalian. Dan kepada Kami kalian akan kembali untuk menjalani hari perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَمَا جَعَلْنَا لِبَشَرٍ مِّن قَبْلِكَ الْخُلْدَ ۖ (Kami tidak menjadikan hidup abadi bagi seorang manusiapun sebelum kamu) Yakni kekal di dunia. أَفَإِي۟ن مِّتَّ(maka jikalau kamu mati) Pada ajal yang telah ditentukan. فَهُمُ الْخٰلِدُونَ(apakah mereka akan kekal) Yakni jika kamu mati maka mereka juga mati, oleh sebab itu tidak ada yang perlu dikhawatirkan dari kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dan Kami tidak menjadikan manusia sebelummu itu abadi di dunia, wahai Nabi. Apakah jika kamu mati, wahai rasul, sebagaimana yang mereka harapkan, maka mereka akan abadi setelahmu?! Ayat ini diturunkan ketika orang-orang kafir itu berkata: “Sesungguhnya Muhammad itu akan mati”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami tidak menjadikan keabadian} keabadian di dunia {bagi manusia sebelum kamu. Maka jika kamu wafat, apakah mereka akan kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Ketika para musuh Rasulullah mengatakan seperti yang diceritakan oleh Allah, \"Tunggulah, maka sesungguhnya aku pun termasuk orang yang menunggu (pula) bersama kamu\". (Ath-THur:30), maka Allah berfirman, “Ini merupakan jalan hidup yang dilewati (setiap orang) dan jalan setapak yang meletihkan. Kami belum pernah menetapkan keabadian bagi seorang manusia pun di dunia, wahai Muhammad. Jika engkau meninggal, maka itulah kondisi orang-orang sepertimu, dari kalangan para rasul, nabi, wali, [dan lainnya]. “Maka jikalau engkkau mati, apakah mereka itu kkekal,” maksudnya apakah bila engkau meninggal, mereka akan kekal abadi sepeninggalmu? Kalau memang demikian adanya, maka hendaknya keabadian menghalangi mereka (dari kematian). Namun, realitanya tidak demikian adanya. Bahkan setiap makhluk yang berada di atasnya (bumi) akan hancur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 34: Oleh karena musuh-musuh Rasulullah shallallahu 'alaihi wa sallam menunggu-nunggu waktu kematian Beliau shallallahu 'alaihi wa sallam, maka Allah Subhaanahu wa Ta'aala menerangkan bahwa tidak ada seorang pun yang hidup kekal di dunia dan bahwa mereka pun sama akan mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 34",
    "description": "Ayat ini menegaskan bahwa nabi Muhammad sebagai manusia sama dengan manusia lainnya, tidak akan kekal hidup di dunia. Dan kami tidak menjadikan hidup abadi sebagai suatu sunatullah bagi seorang manusia sebelum engkau Muhammad, siapa, dan bagaimana pun dia. Maka jika engkau wafat, apakah mereka, yang hidup sezaman dengan engkau atau yang hidup di zaman modern, akan kekal'35. Karena hidup manusia di dunia tidak kekal, maka ketetapan Allah berlaku bahwa setiap yang bernyawa akan merasakan mati. Allah kemudian menetapkan garis bahwa hidup adalah ujian. Kami akan menguji kamu dengan dua macam ujian, keburukan dan kebaikan, sebagai cobaan untuk mengukur kualitas iman dan kesabaran manusia. Dan kamu, seluruh manusia, akan dikembalikan hanya kepada kami untuk mempertanggungjawabkan hidup di dunia dan mendapatkan hasilnya, keridaan Allah atau murka-Nya."
  }
]