[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tiap-tiap jiwa itu akan merasakan kematian, tidak mungkin tidak, berapa tahun pun usianya diperpanjang di dunia. Dan keberadaannya di dunia ini tiada lain menjadi cobaan dengan menjalankan aturan-aturan syariat dalam bentuk perintah dan larangan, dan dengan terjadinya perubahan kondisi-kondisi, terkadang baik dan buruk. Kemudian tempat kembali dan tempat kesudahan itu adalah kepada Allah semata untuk perhitungan amal perbuatan dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Setiap jiwa, baik yang beriman atau kafir, pasti akan merasakan mati di dunia ini. Dan di dunia ini Kami mengujimu -wahai manusia- dengan berbagai kewajiban, kenikmatan dan kesengsaraan. Kemudian setelah wafat, kalian pasti akan kembali kepada Kami, bukan kepada selain Kami, lalu Kami memberikan balasan atas amalan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. كُلُّ نَفْسٍ ذَآئِقَةُ الْمَوْتِ ۗ (Tiap-tiap yang berjiwa akan merasakan mati) Yakni akan terpisah dari jasadnya, sehingga tidak ada satupun makhluk bernyawa yang akan hidup kekal. وَنَبْلُوكُم بِالشَّرِّ وَالْخَيْرِ فِتْنَةً ۖ( Kami akan menguji kamu dengan keburukan dan kebaikan sebagai cobaan) Ibnu ‘Abbas berpendapat, makna ayat ini adalah Kami akan menguji kalian dengan kesengsaraan dan kesejahteraan, sehat dan sakit, kekayaan dan kemiskinan, haram dan halal, ketaatan dan kemaksiatan, serta hidayah dan kesesatan. Yakni agar Kami melihat bagaimana rasa syukur dan sabar kalian. وَإِلَيْنَا تُرْجَعُونَ(Dan hanya kepada Kamilah kamu dikembalikan) Kemudian Kami akan membalas kalian atas amal perbuatan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَنَبْلُوكُم بِٱلشَّرِّ وَٱلْخَيْرِ فِتْنَةً ۖ} \"Kami akan menguji kamu dengan keburukan dan kebaikan sebagai cobaan (yang sebenar-benarnya)\" Hasan al-Bashri mengatakan tentang ayat ini : bahwasanya mereka satu nasib ketika nikmat itu datang. namun saat cobaan itu datang mereka pun saling mengundurkan diri!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Dan ketika keabadian untuk selain Allah itu sudah ditiadakan, maka setiap jiwa itu akan mati di dunia. Dan Kami berinteraksi dengannya dengan mengujinya menggunakan cobaan dan kenikmatan, serta kesengsaraan dan kesejahteraan supaya Kami bisa melihat apakah kalian akan bersabar saat menderita dan bersyukur saat mendapat nikmat? Dan hanya kepad Kami, kalian akan dikembalikan untuk dihisab dan dibalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap yang bernyawa akan merasakan kematian. Kami menguji kalian} Kami menguji kalian {dengan keburukan dan kebaikan sebagai cobaan} ujian agar Kami melihat bagaimana rasa syukur kalian terhadap sesuatu yang kalian cintai dan kesabaran kalian atas sesuatu yang kalian benci {kepada Kamilah kalian akan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Oleh karenanya, Allah berfirman, “Tiap-tiap yang berjiwa akan merasakan mati.” Pengertian ini mencakup segenap nyawa para makhluk. Dan bahwa ajal ibarat gelas yang harus ditenggak oleh setiap makhluk, kendatipun masa hidup seseorang hamba lama dan dikarunia umur panjang. Akan tetapi, Allah menciptakan para ahambaNya di dunia, untuk diperintah dan dikekang dengan larangan. Serta untuk menguji mereka dengan tadir yang baik ataupun buruk, dengan kekayaan dan kemiskinan, dengan kemuliaan dan kehinaan, dengan kehidupan dan kematian, sebagai bentuk ujian dari Allah, (Al-Kahfi:7), siapa orang yang akhirnya terjebak dalam lubang-lubang fitnah, dan siapa yang berhasil selamat. Selanjutnya, “hanya kepada Kami-lah kamu dikembalikan.” Kemudian Kami akan membalas mereka sesuai dengan amalan-amalan mereka. Apabila baik, maka balasannya baik pula. Jika amalannya buruk, niscaya balasannya buruk pula. Allah tidak berbuat aniaya terhadap para hambaNya. Ayat ini menunjukkan kebatilan perkataan orang yang menyatakan kelanggengan hidup Khidir, bahwasanya beliau abadi di dunia ini. Ini merupakan pernyataan yang tidak ada buktinya, bertentangan dengan dalil-dalil agama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 35: Seperti kefakiran dan kekayaan, sakit dan sehat. Yakni agar Kami melihat apakah kamu bersabar dan bersyukur atau tidak. Untuk diberikan balasan. Syaikh As Sa’diy berkata, “Ayat ini menunjukkan batilnya perkataan orang yang mengatakan bahwa Khadhir itu kekal, dan bahwa ia hidup kekal di dunia. Perkataan ini adalah perkataan yang tidak ada dalilnya dan bertentangan dengan dalil-dalil syar’i.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 35",
    "description": "Karena hidup manusia di dunia tidak kekal, maka ketetapan Allah berlaku bahwa setiap yang bernyawa akan merasakan mati. Allah kemudian menetapkan garis bahwa hidup adalah ujian. Kami akan menguji kamu dengan dua macam ujian, keburukan dan kebaikan, sebagai cobaan untuk mengukur kualitas iman dan kesabaran manusia. Dan kamu, seluruh manusia, akan dikembalikan hanya kepada kami untuk mempertanggungjawabkan hidup di dunia dan mendapatkan hasilnya, keridaan Allah atau murka-Nya. 36. Allah menerangkan sikap dan kelakuan orang-orang kafir terhadap rasulullah. Dan apabila orang-orang kafir itu melihat engkau, Muhammad, kapan dan di mana saja mereka bertemu, mereka hanya memperlakukan engkau menjadi bahan ejekan. Mereka mengatakan kepada se-samanya, 'apakah ini orang yang mencela tuhan-tuhanmu, yang dihormati dan disembah oleh leluhur kita'' mereka tidak menyadari bahwa sebenar-Nya merekalah yang selayaknya menerima ejekan, karena menyembah berhala yang tidak kuasa berbuat apa pun. Sejatinya mereka orang yang ing-kar mengingat Allah yang maha pengasih. Mereka menolak ajakan rasulullah untuk beriman kepada Allah yang menciptakan mereka dan memberi hidup dan kehidupan ini."
  }
]