[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila orang-orang kafir melihat kamu (wahai Rasul) mereka menunjuk-nunjuk kepada drimu untuk tujuan memperolok-olok dirimu, dengan cara sebagian dari mereka berkata kepada sebagian yang lain, “Apakah lelaki ini yang berani mencela tuhan-tuhan kalian?” mereka menentang (Allah) ar-Rahman (Dzat Yang Maha Pengasih) dan nikmat-nikmatNya, serta menentang apa yang diturunkanNya berupa al-Qur’an dan hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan apabila orang-orang musyrik itu melihatmu -wahai Rasul-, mereka hanya memperlakukan dirimu sebagai bahan ejekan dengan tujuan menjauhkan pengikut-pengikut mereka dari engkau, dengan mengatakan, \"Inikah orang yang mencela tuhan-tuhan yang kalian sembah?\" Padahal merekalah orang yang ingkar terhadap ayat-ayat Al-Qur`ān yang diturunkan Allah kepada mereka, dan kafir terhadap nikmat yang Dia karuniakan pada mereka; maka sungguh mereka lebih pantas mendapat cela lantaran mengumpulkan semua keburukan dalam diri mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Hai Nabi, jika orang-orang kafir melihatmu maka mereka pasti akan menjadikanmu sebagai bahan ejekan, dan mereka selalu mengingkarimu dengan berkata: “Apakah ini orang yang menghina tuhan-tuhan kalian?” Dan mereka adalah orang-orang yang mendustakan jika disebutkan kepada mereka Allah Yang Maha Pengasih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَإِذَا رَءَاكَ الَّذِينَ كَفَرُوٓا۟ (Dan apabila orang-orang kafir itu melihat kamu) Yakni orang-orang musyrik yang mengolok-olokmu. إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا(mereka hanya membuat kamu menjadi olok-olok) Yakni ejekan. أَهٰذَا الَّذِى يَذْكُرُ ءَالِهَتَكُمْ(Apakah ini orang yang mencela tuhan-tuhan-mu?) Yakni mereka berkata “inikah orang yangmencela tuhan-tuhan kalian?” وَهُم بِذِكْرِ الرَّحْمٰنِ هُمْ كٰفِرُونَ(padahal mereka adaIah orang-orang yang ingkar mengingat Allah Yang Maha Pemurah) Mereka mengolok-olok Rasulullah karena telah menyebut tuhan-tuhan mereka tidak dapat memberi mudharat dan manfaat, padahal mereka ingkar dari menyebut Allah dengan perkataan yang sesuai dengan keesaan-Nya; maka merekalah yang lebih layak mendapat celaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Ketika orang-orang kafir itu melihat kamu, mereka semua itu adalah orang-orang musyrik yang mengolok-olokmu. Mereka tidak menganggapmu kecuali hanya bahan hinaan yang diolok-olok. Mereka berkata: “Apakah ini orang yang menyalahkan tuhan-tuhan kalian?” Padahal kenyataannya mereka itu tidak mau mengingat Allah yang Maha Pemurah lagi Maha Esa dan mereka itu lebih pantas untuk diolok-olok dan disalahkan, karena dirimu adalah orang yang benar dan mereka adalah orang-orang yang bathil. Dan kata {hum kaafirun} itu untuk melebih-lebihkan kekufuran yang menutupi mereka. Ayat ini diturunkan ketika Abu Jahal mengolok-olok Nabi SAW dan berkata kepada Abu Sufyan: “Ini adalah Nabi yang menyalahkan Abdul Manaf”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila orang-orang kafir itu melihatmu, mereka hanya menjadikanmu} mereka hanya menjadikanmu {sebagai bahan ejekan} bahan ejekan {“Inikah orang yang mencela tuhan-tuhan kalian”} menghina dan mengutuk tuhan-tuhan kalian {dan mereka ingkar mengingat Dzat Yang Maha Pengasih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Ini lantaran dahsyatnya kekufuran mereka. Kaum musyrikin jika menyaksikan Rasulullah, niscaya mereka mengolok-olok beliau dengan berkata, “Apakah ini orang yang mencela tuhan-tuhanmu,” maksudnya apakah orang hina ini –menurut pandangan mereka- yang mencela tuhan-tuhan kalian, memaki dan menghinanya. Maknanya, janganlah kalian pedulikan dia, dan jangan mengerubutinya. Kejadian ini merupakan bentuk pengolokan dan penghinaan terhadap beliau dengan aspek yang menjadi kesempurnaan beliau. Beliau adalah insan yang paling sempurna dan paling utama. Di antara keutamaan dan ketinggian akhlak beliau, yaitu mengikhlaskan ibadah hanya kepada Allah, mencela segala yang disembah selain Allah dan mendiskreditkannya, serta menyebutkkan posisi Allah dan (ketinggian) kedudukanNya. Akan tetapi, justru obyek olokan dan hinaan (yang pantas) adalah (kepada) orang-orang kafir yang telah menghimpun setiap perilaku tercela. Sekiranya tidak ada pada mereka kecuali kekufuran mereka kepada Rabb dan pengingkaran terhadap para utusanNYa, maka dengan hal itu cukup sudah membuat mereka menjadi makhluk-makhluk yang paling nista dan paling hina. Kendatipun demikian, penyebutan mereka tentang ar-Rahman (yang merupakan kondisi terbaik mereka) adalah keadaan kafir mereka kepada Allah. Pasalnya tidaklah mereka menyebutkan nama ini dan tidak mengimaniNYa melainkan dalam keadaan menyekutukanNya dengan makhluk lain. Maka ucapan dzikir mereka merupakan bentuk kekufuran dan kesyirikan. Lalu bagaimana halnya dengan tindakan-tindakan lainnya? Oleh karenanya, Allah berfirman, “Padahal mereka adalah orang-orang yang ingkar mengingat Allah Yang Maha Pemurah.” Dalam penyebutan nama Allah ar-Rahman mengandung petunjuk betapa buruknya perilaku mereka. Bagaimana bisa mereka bersikap kepada arRahman –Dzat yang mencurahkan segala kenikmatan dan menyingkirkan segala malapetaka yang mana tidak ada kenikmatan pada hamba-hamba melainkan pasti berasal dariNya, dan tidak dapat menghalau kejelekan selainNYa- dengan sikap kekufuran dan kesyirikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 36: Hal ini karena kerasnya kekafiran mereka, sampai-sampai ketika melihat Rasulullah shallallahu 'alaihi wa sallam, mereka menjadikannya bahan ejekan, dan berkata, “Apakah ini orang yang mencela tuhan-tuhanmu?\" Mereka menghina dan mengolok-oloknya, padahal Beliau adalah manusia yang paling sempurna dan paling utama. Merekalah yang sesungguhnya hina karena menggabung semua akhlak terela, kalau pun tidak ada perbuatan mereka selain kafir kepada Allah Yang Maha Pengasih dan kafir kepada Rasul-Nya, hal itu pun sudah cukup menjadikan mereka sebagai makhluk yang paling hina karena yang mereka ingkari adalah Tuhan Yang Maha Pengasih, di mana tidak ada satu pun nikmat yang diperoleh hamba kecuali berasal dari-Nya dan tidak ada yang menghindarkan bahaya selain Dia. Mereka berkata, “Kami tidak mengenal Ar Rahman.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 36",
    "description": "Allah menerangkan sikap dan kelakuan orang-orang kafir terhadap rasulullah. Dan apabila orang-orang kafir itu melihat engkau, Muhammad, kapan dan di mana saja mereka bertemu, mereka hanya memperlakukan engkau menjadi bahan ejekan. Mereka mengatakan kepada se-samanya, 'apakah ini orang yang mencela tuhan-tuhanmu, yang dihormati dan disembah oleh leluhur kita'' mereka tidak menyadari bahwa sebenar-Nya merekalah yang selayaknya menerima ejekan, karena menyembah berhala yang tidak kuasa berbuat apa pun. Sejatinya mereka orang yang ing-kar mengingat Allah yang maha pengasih. Mereka menolak ajakan rasulullah untuk beriman kepada Allah yang menciptakan mereka dan memberi hidup dan kehidupan ini. 37. Allah menerangkan bahwa manusia diciptakan sebagai makhluk yang bertabiat tergesa-gesa dan terburu-buru. Allah memperingatkan kaum kafir agar mereka jangan meminta disegerakan azab yang diancamkan kepada mereka sebelum Allah memperlihatkan tanda-tanda dari azab-Nya itu. \"kelak akan aku perlihatkan kepadamu tanda-tanda kekuasaan-ku. Kami memberikan kesempatan kepada kamu untuk mempertimbangkan dengan matang ajakan rasulullah untuk beriman kepada Allah dan meyakini akhirat. Maka janganlah kamu meminta aku menyegerakannya di dunia, sebab ini menunjukkan ketidakpercayaan kamu terhadap adanya azab di akhirat, \" demikian Allah mengingatkan."
  }
]