[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir berkata (dengan niat untuk meminta disegerakan kedatangan siksaan dan memperolok-oloknya), “Kapankah akan terjadi apa yang kamu janjikan kepada kami tentang (datangnya siksaan) itu (wahai Rasul) jika kamu dan orang-orang yang mengikutimu adalah orang-orang yang berkata benar?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan orang-orang yang mengingkari hari kebangkitan berkata dengan tergesa-gesa, \"Kapankah janji yang kalian katakan berupa hari kebangkitan itu akan tiba -wahai orang-orang beriman- bila kalian memang benar dengan apa yang kalian klaim?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَيَقُولُونَ مَتَىٰ هٰذَا الْوَعْدُ إِن كُنتُمْ صٰدِقِينَ (Mereka berkata: “Kapankah janji itu akan datang, jika kamu sekaIian adalah orang-orang yang benar?) Yakni Wahai kaum muslimin, jika kalian benar dalam janji kalian kepada kami, yaitu janji yang kalian baca dalam al-Qur’an dan kalian mengatakan kepada kami itu adalah dari Allah bahwa kami akan dibangkitkan, maka kenapa itu tidak terjadi sekarang juga?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Mereka berkata: “Kapankan waktu datangnya azab itu, jika janji kalian yang terkandung di dalam Al-Qur’an itu benar, wahai orang-orang muslim?” yaitu janji yang diberikan oleh rasulalllah dan sahabatnya tentang azab dunia dan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kapankah janji ini} kebangkitan {jika kalian adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Begitu pula, orang-orang kafir mengatakan, “Bilakah (terjadinya) janji (Hari Kebangkitan) ini jika kamu adalah orang-orang yang benar.” Mereka itu melontarkan pernyataan ini lantaran terpedaya dengan kondisi mereka (yang akan selamat) karena hukuman yang belum menimpa mereka dan siksa belum turun menerjang mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 38: Yakni azab atau hari kiamat. Mereka mengucapkan kata-kata ini karena tertipu, dan karena mereka belum tertimpa azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 38",
    "description": "Karena orang-orang kafir itu tidak meyakini akhirat, maka dalam ayat ini terlihat betapa nekatnya mereka berkata kepada rasulullah dengan sikap menantang. Dan mereka berkata, wahai Muhammad, kapankah janji itu, azab neraka yang kamu sebut-sebut itu akan datang menimpa kami, jika kamu orang yang benar mengaku utusan Allah dan sanggup mendatangkan azab''39. Seandainya orang kafir itu mengetahui dengan pengetahuan yang meyakinkan bahwa azab neraka itu ada, ketika mereka melihatnya da-lam keadaan tidak mampu mengelakkan api neraka dari wajah dan punggung mereka, sedang mereka tidak mendapat pertolongan, tentulah mereka tidak akan menantang rasulullah dengan meminta azab itu disegera-kan."
  }
]