[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya orang-orang kafir itu menyadari apa yang akan mereka hadapi, tatkala mereka tidak mampu menepis api neraka dari wajah-wajah dan punggung-punggung mereka, dan mereka tidak mendapatkan penolong yang menolong mereka, dikarenakan kekafiran yang melandasi kehidupan mereka, niscaya mereka tidak akan meminta disegerakannya kedatangan siksaan pada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Seandainya orang-orang kafir yang mengingkari hari kebangkitan itu mengetahui ketika mereka itu tidak bisa lagi mengelakkan api neraka dari wajah dan punggung mereka, dan bahwasanya tidak ada satu penolong pun yang bisa membebaskan mereka dari azab itu, bila mereka mengetahui hal ini seyakin-yakinnya niscaya mereka sekali-kali tidak akan meminta disegerakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Andai saja orang-orang kafir itu mengetahui kengerian azab, ketika mereka tidak mampu melindungi wajah dan punggung mereka dari api neraka, dan mereka tidak memiliki seorang penolongpun dari azab yang telah mengepung mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. لَوْ يَعْلَمُ الَّذِينَ كَفَرُوا۟ حِينَ لَا يَكُفُّونَ عَن وُجُوهِهِمُ النَّارَ وَلَا عَن ظُهُورِهِمْ وَلَا هُمْ يُنصَرُونَ (Andaikata orang-orang kafir itu mengetahui, waktu (di mana) mereka itu tidak mampu mengelakkan api neraka dari muka mereka dan (tidak pula) dari punggung mereka, sedang mereka (tidak pula) mendapat pertolongan) Yakni jika mereka mengetahui dengan pengetahuan yang sebenarnya niscaya mereka akan menyadari bahwa hari kiamat akan datang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Jika saja orang-orang kafir yang tergesa-gesa itu mengetahui bala’ yang menunggu mereka saat diperlihatkan neraka untuk mereka, maka mereka tidak akan bisa menolaknya dan tidak dapat menemukan satu penolong pun yang bisa menyelamatkan dan melindungi mereka dari azab itu jika mereka tetap atas kekufuran mereka terhadap Tuhan dan tergesa-gesa meminta azab ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya orang-orang kafir itu mengetahui saat mereka tidak bisa mengelakkan} tidak bisa menahan {api neraka dari wajah dan punggung mereka dan saat mereka tidak mendapat pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Sekiranya “orang-orang kafir itu mengetahui,” keadaan buruk mereka “waktu (di mana) mereka tak mampu untuk mengelakkan api neraka dari muka mereka dan (tidak pula) dari punggung mereka,” pasalnya, (Pada waktu itu), neraka telah mengitari mereka dari semua sisi, dan menyelubungi mereka dari semua tempat, “sedang mereka tidak mendapat pertolongan (tentulah mereka tiada meminta di segerakan),” maksudnya tidak ada orang lain yang (dapat) menolong mereka. Mereka tidak ditolong dan tidak pula dapat menolong diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 39: Karena azab mengepung mereka dari berbagai sisi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 39",
    "description": "Seandainya orang kafir itu mengetahui dengan pengetahuan yang meyakinkan bahwa azab neraka itu ada, ketika mereka melihatnya da-lam keadaan tidak mampu mengelakkan api neraka dari wajah dan punggung mereka, sedang mereka tidak mendapat pertolongan, tentulah mereka tidak akan menantang rasulullah dengan meminta azab itu disegera-kan. 40. Tantangan orang-orang kafir agar azab itu didatangkan segera kepada mereka muncul dari kebodohan dan keingkaran, karena mereka menutup diri dari ajaran rasulullah. Sebenarnya hari kiamat itu akan datang kepada mereka secara tiba-tiba, sangat cepat dan tak terduga, lalu mereka menjadi panik menghadapinya; mereka pun tidak sanggup menolaknya, karena dahsyatnya peristiwa kiamat itu; dan tidak pula mereka diberi penangguhan waktu dan kesempatan untuk menyelamatkan diri."
  }
]