[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nabi Muhammad menyerahkan persoalan ini kepada Tuhannya; beliau berkata, “Tuhanku mengetahui semua perkataan di langit dan di bumi, dan mengetahui pembicaraan yang kalian rahasiakan. Dia Maha Mendengar ucapan-ucapan kalian dan Maha Mengetahui keadaan-keadaan kalian.” Dalam ayat ini terkandung satu peringatan keras dan ancaman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Rasulullah -ṣallallāhu 'alaihi wa sallam- berkata, \"Tuhanku mengetahui perkataan yang kalian rahasiakan. Sungguh Dia mengetahui segala perkataan yang diucapkan oleh siapapun yang ada di langit dan bumi. Dia Maha Mendengar perkataan hamba-Nya, Maha Mengetahui amal perbuatan mereka, dan pasti akan memberikan mereka balasan atas setiap amal perbuatan tersebut.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Ketika kedustaan ini sampai kepada Rasulullah, dia membantah mereka: “Tuhanku Maha Mengetahui segala perkataan yang diucapkan di langit dan di bumi, dan Dia Maha Mendengar perkataan kalian dan Maha Melihat perbuatan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. قَالَ (Berkata) Nabi Muhammad. رَبِّى يَعْلَمُ الْقَوْلَ فِى السَّمَآءِ وَالْأَرْضِ ۖ (Tuhanku mengetahui semua perkataan di langit dan di bumi) Yakni mengetahui setiap tempat aku berbicara di setiap sisi langit dan bumi, sehingga Dia mengetahui apa yang kalian bisikkan. وَهُوَ السَّمِيعُ (dan Dialah Yang Maha Mendengar) Segala suara. الْعَلِيمُ (lagi Maha Mengetahui) Segala pengetahuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Nabi SAW bersabda tentang apa yang dikisahkan Al-Qur’an: “Tuhanku mengetahui ucapan yang diucapkan di setiap tempat, di langit dan bumi. Dia itu Maha Mendengar setiap sesuatu yang didengar dan Maha Mengetahui setiap sesuatu yang diketahui.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} nabi Muhammad SAW berkata {“Tuhanku mengetahui perkataan di langit serta di bumi dan Dia Maha Mendengar lagi Maha Mengetahui”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Dengan ilmuNya, Allah telah meliputi apa yang mereka rapatkan secara sembunyi-sembunyi, dan Allah akan membalas mereka atas perbuatan merekka tersebut. Untuk itu, Allah berfirman, “Muhammad berkata (kepada mereka), ‘Rabbku mengetahui semua perkataan’,” yang lirih dan terang-terangan “di langit dan bumi,” di seluruh tempat yang masuk lingkup keduanya (langit dan bumi) “dan Dia-lah Yang Maha Mendengar,” semua suara dengan ragam bahasanya untu berbagai keperluan, “lagi Maha Mengetahui,” apa yang ada di hati sanubari dan yang disembunyikan oleh rahasia-rahasia hati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 4: Dia akan memberikan balasan terhadapnya. Terhadap semua pembicaraan mereka secara terang-terangan maupun sembunyi-sembunyi. Apa yang ada dalam hati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 4",
    "description": "Dia, nabi Muhammad, berkata kepada orang-orang kafir, bahwa Allah mengetahui pembicaraan yang mereka rahasiakan. 'tuhanku mengetahui secara detail semua perkataan para malaikat di langit dan mengetahui pula semua pembicaraan manusia di bumi, meskipun me-reka merahasiakannya; dan dia maha mendengar semua pembicaraan makhluk-Nya, maha mengetahui semua peristiwa yang sudah, sedang, dan akan terjadi di jagat raya!'5. Bahkan, mereka orang-orang kafir itu, menolak kebenaran Al-Qur'an, dengan berkata, bahwa 'Al-Qur'an itu buah mimpi-mimpi Muhammad yang kacau, atau hasil rekayasanya, atau bahkan dia bukan nabi dan rasul, melainkan hanya seorang penyair yang pandai menggubah puisi yang kacau. Jika dia ingin kita membenarkannya, cobalah dia datangkan kepada kita suatu tanda, bukti fisik yang meyakinkan, seperti halnya mukjizat rasul-rasul yang diutus terdahulu seperti unta betina nabi saleh atau mukjizat nabi musa dan isa. \""
  }
]