[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Hari Kiamat akan datang kepada mereka dengan tiba-tiba, sehingga mereka akan mengalami kepanikan pada saat itu dan mereka dilanda rasa takut yang amat besar. Dan mereka tidak kuasa menolak siksaan dari diri mereka dan mereka tidak diberi kesempatan lagi untuk dapat bertaubat dan meminta ampunan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Api neraka yang menjadi azab mereka itu tidak akan datang kepada mereka sedang mereka mengetahuinya, akan tetapi ia akan datang kepada mereka secara tiba-tiba, sehingga mereka tidak kuasa menghindarkan diri darinya, dan mereka tidak pula bisa mengudurnya sehingga mereka bertobat lalu mendapatkan rahmat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Azab akan mendatangi mereka secara tiba-tiba sehingga mereka akan terkejut, mereka tidak akan mampu mengelak darinya dan tidak mampu mengundur waktunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. بَلْ تَأْتِيهِم بَغْتَةً (Sebenarnya (azab) itu akan datang kepada mereka dengan sekonyong-konyong) Yakni dengan tiba-tiba. فَتَبْهَتُهُمْ فَلَا يَسْتَطِيعُونَ رَدَّهَا (lalu membuat mereka menjadi panik, maka mereka tidak sanggup menolaknya) Mereka tidak dapat mengelaknya dari depan maupun belakang mereka. وَلَا هُمْ يُنظَرُونَ (dan tidak (pula) mereka diberi tangguh) Mereka tidak diberi kesempatan untuk bertaubat atau meminta maaf."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Bahkan neraka atau kiamat itu mendatangi mereka dengan seketika lalu mengagetkan dan mengacaukan mereka, sehingga mereka tidak bisa melepaskan hal itu dari diri mereka. Mereka juga tidak diberi penangguhan atas taubat dan permohonan maaf mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan (janji) itu akan datang kepada mereka secara tiba-tiba} secara tiba-tiba {lalu membingungkan mereka} membuat mereka bingung {Lalu mereka tidak sanggup menolaknya} menolaknya {dan tidak pula diberi penangguhan} ditangguhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Bahkan api neraka datang kepada mereka,” dalam keadaan “dengan sekonyong-konyong,” menghenyakkan mereka karena kepanikan, kebingungan, dan lantaran rasa takut yang sangat mengerikan. “Maka mereka tidak sanggup menolaknya,” sebab mereka benar-benar hina dan lemah untuk bisa melakukannya “dan tidak (pula) mereka diberi (waktu) tangguh,” maksudnya memperoleh penundaan tempo sehingga diakhirkan siksaan mereka. Seandainya mereka mengetahui hakikat ini dengan sebenarnya, niscaya mereka tidak akan meminta penyegeraan siksaan bagi mereka dan akan benar-benar merasa sangat takut terhadapnya. Hanya saja, karena pengetahuan ini kosong dari diri mereka, akhirnya mereka mengatakan apa yang telah mereka lontarkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 40: Untuk bertobat. Kalau seandainya mereka mengetahui keadaan ini, tentu mereka tidak akan meminta disegerakan azab dan mereka akan benar-benar takut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 40",
    "description": "Tantangan orang-orang kafir agar azab itu didatangkan segera kepada mereka muncul dari kebodohan dan keingkaran, karena mereka menutup diri dari ajaran rasulullah. Sebenarnya hari kiamat itu akan datang kepada mereka secara tiba-tiba, sangat cepat dan tak terduga, lalu mereka menjadi panik menghadapinya; mereka pun tidak sanggup menolaknya, karena dahsyatnya peristiwa kiamat itu; dan tidak pula mereka diberi penangguhan waktu dan kesempatan untuk menyelamatkan diri. 41. Sikap orang-orang kafir terhadap para rasul itu sama, baik umat nabi Muhammad maupun umat terdahulu. Dan sungguh, rasul-rasul sebelum engkau, Muhammad, pun telah diperolok-olokkan oleh mereka, karena kebodohan dan keingkaran mereka. Maka, turunlah hukuman Allah kepada orang-orang yang mencemoohkan para rasul itu dengan jenis azab di dunia yang selalu mereka perolok-olokkan sehingga mereka binasa."
  }
]