[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya telah dicemooh rasul-rasul sebelummu (wahai Rasul) maka turunlah kepada orang-orang yang suka memperolok-olok tersebut siksaan yang dahulu menjadi motivasi cemoohan dan olok-olokan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. \"Seandainya kaummu mengejek dan menghinamu, maka engkau bukanlah yang pertama kali mendapatkannya, sungguh Rasul-rasul sebelum engkau -wahai Rasul- telah diperolok-olok dan dihina, lalu turunlah azab kepada orang-orang kafir yang mencemohkan mereka, di mana sebelumnya mereka memperolok-alok azab tersebut tatkala para rasul menakut-nakuti mereka sewaktu di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Allah bersumpah untuk menegaskan bahwa umat-umat terdahulu yang mendustakan telah menghina para rasul sebelummu, maka azab menimpa mereka akibat hinaan mereka terhadap para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ (Dan sungguh telah diperolok-olokkan beberapa orang rasul sebelum kamu) Yakni jika mereka menghina kamu maka umat-umat terdahulu juga telah melakukan hal itu kepada para Rasul mereka semua, padahal para rasul itu berjumlah banyak dan telah melakukan hal yang menakjubkan. فَحَاقَ بِالَّذِينَ سَخِرُوا۟ مِنْهُم(maka turunlah kepada orang yang mencemoohkan rasul-rasul itu) Yakni azab meliputi orang-orang yang menghina para rasul. مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ (azab yang selalu mereka perolok-olokkan) Yakni balasan atas olokan itu mengepung mereka sehingga mereka tidak mendapat tempat untuk melarikan diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Dan sungguh orang-orang kafir terdahulu itu mengolok-olok para rasul sebelummu, wahai Nabi. Lalu azab yang selalu diperingatkan oleh para rasul kepada mereka sebagai balasan olok-olok mereka itu menimpa dan menyelimuti mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh rasul-rasul sebelum kamu telah diperolok-olok, lalu turunlah} meliputi dan turun {kepada orang-orang yang mencemooh mereka sesuatu yang selalu mereka perolok-olok"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Dan setelah Allah menyebutkan penghinaan mereka terhadap rasulNya dengan perkataan, “apakah ini orang yang mencela tuhan-tuhanmu.” (Al-Anbiya:36), maka Allah menghibur beliau, bahwa kejadian seperti itu merupakan kebiasaan umat-umat terdahulu saat menghadapi para utusan Allah (yang diutus kepada mereka). Allah berfirman, “Dan sungguh telah diperolok-olok beberapa rasul sebelum kamu, maka turunlah kepada orang-orang yang mencemoohkan dari mereka,” menghampiri mereka, “balasan (azab) olok-olokkan mereka.” Maksudnya telah datang siksaan kepada mereka. Segala faktor untuk menolaknya pun lenyap. Hendaknya mereka berhati-hati akan turunnya bencana, hukuman yang telah melanda kaum yang mendustakan para utusan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 41: Ayat ini sebagai hiburan bagi Nabi shallallahu 'alaihi wa sallam ketika orang-orang kafir mencemoohkan Beliau shallallahu 'alaihi wa sallam, seperti yang disebutkan dalam ayat 36 di atas. Yaitu azab. Demikian pula azab itu akan menimpa kepada orang-orang yang mencemoohkan engkau (Muhammad shallallahu 'alaihi wa sallam)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 41",
    "description": "Sikap orang-orang kafir terhadap para rasul itu sama, baik umat nabi Muhammad maupun umat terdahulu. Dan sungguh, rasul-rasul sebelum engkau, Muhammad, pun telah diperolok-olokkan oleh mereka, karena kebodohan dan keingkaran mereka. Maka, turunlah hukuman Allah kepada orang-orang yang mencemoohkan para rasul itu dengan jenis azab di dunia yang selalu mereka perolok-olokkan sehingga mereka binasa. 42. Katakanlah, wahai nabi Muhammad, sebagai jawaban atas ejekan orang-orang kafir dengan pertanyaan, 'siapakah yang akan menjaga kamu pada waktu malam dan siang dari siksaan Allah yang maha pengasih di dunia'' pertanyaan ini dimaksudkan untuk menyadarkan mereka bahwa tidak seorang pun berkuasa melindungi mereka dari azab Allah; tetapi mereka enggan mengingat tuhan mereka dengan beriman dan beribadah kepada-Nya."
  }
]