[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang yang meminta disegerakan turunnya siksaan tersebut, “Tidak ada yang bisa menjaga kalian dan melindungi kalian di malam dan siang hari kalian, dalam kondisi tidur dan terjaga dari siksaan Allah ar-Rahman, bila siksaan itu turun menimpa kalian.” Bahkan mereka itu lalai dan melupakan al-Qur’an dan nasihat-nasihat Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Katakanlah -wahai Rasul- kepada orang-orang yang meminta disegerakan azab itu, \"Siapakah yang akan menjaga dan menolong kalian di waktu malam dan siang dari turunnya azab dan kebinasaan dari Tuhan Yang Maha Pengasih?\" Tetapi mereka hanya enggan dan berpaling dari mengingat peringatan dan hujah Tuhan mereka, mereka sama sekali tidak memperhatikannya lantaran jahil dan tidak berakal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Hai Rasulullah, katakanlah kepada orang-oran yang menghinamu itu: “Siapakah yang dapat menjaga kalian pada siang dan malam hari dari ketetapan Allah Yang Maha Pengasih jika ketetapan itu telah datang?” Sungguh mereka telah lalai dari al-Qur’an dan peringatan-peringatan dari Allah Yang Maha Pengasih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. قُلْ مَن يَكْلَؤُكُم بِالَّيْلِ وَالنَّهَارِ مِنَ الرَّحْمٰنِ ۗ (Katakanlah: “Siapakah yang dapat memelihara kamu di waktu malam dan siang hari dari (azab Allah) Yang Maha Pemurah?”) Yakni siapakah yang akan menjaga kalian dari siksaan dunia dan akhirat yang hendak Allah timpakan kepada kalian. بَلْ هُمْ عَن ذِكْرِ رَبِّهِم مُّعْرِضُونَ (Sebenarnya mereka adalah orang-orang yang berpaling dari mengingati Tuhan mereka) Sehingga mereka sama sekali tidak mengingat Allah dan tidak terbesit dalam pikiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Katakanlah kepada mereka wahai rasulallah: “Jika kalian mengharapkan datangnya azab itu, siapakah yang melindungi dan memelihara kalian di malam dan siang hari dari azab atau hukuman yang akan diturunkan oleh Dzat yang Maha Pengasih di dunia maupun akhirat?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Siapakah yang akan menjaga kalian} yang menjaga dan memelihara kalian {pada waktu malam dan siang dari (siksaan) Dzat Yang Maha Pengasih” Namun mereka berpaling} lalai dan lengah {dari mengingat Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah berfirman untuk memaparkan betapa lemahnya orang-orang yang menetapkan sesembahan selain Allah, dan Rabb mereka ar-Rahman (Yang Maha Penyayang) yang kasih sayangNya melliputi orang-orang baik dan jahat di malam dan siang hari. Allah berfirman, “Siapakah yang dapat memelihara kamu,” maksudnya, siapakah yang akan menjaga dan memelihara kalian, “di malam hari,” saat kalian tidur di atas ranjang-ranjang kalian, tanpa panca indera (yang berfungsi) dan tatkala di siang hari ketika kalian bertebaran (untuk mengais rezeki) dan ketika kalian lalai “selain ar-Rahman (Dzat Yang Maha Pemurah),” maksudnya, selainNya menggantikan posisiNYa. Apakah ada dzat lain yang menjaga kalian selainNYa? Jawabannya, tidak ada penjaga seslainNya. “Sebenarnya mereka adalah orang-orang yang berpaling dari mengingat Rabb mereka,” oleh karena itu, mereka menyekutukan sesuatu denganNya. Dan kalau tidak demikian, seandainya mereka mau menyambut peringatan Rabb mereka, mau menerima nasihat-nasihatNya, niscaya mereka akan mendapatkan petunjuk dan memperoleh taufik dalam setiap urusan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 42: Allah Subhaanahu wa Ta'aala berfirman menyebutkan kelemahan mereka yang mengambil tuhan-tuhan selain-Nya, dan bahwa mereka membutuhkan pertolongan Tuhan mereka yang sesungguhnya, yaitu Ar Rahman (Yang Maha Pengasih), di mana rahmat-Nya mengena kepada orang yang baik maupun yang buruk. Ketika kamu tidur dan tidak sadar. Ketika kamu sedang bertebaran di muka bumi dan sedang lalai. Yakni jika turun kepadamu. Tentu tidak ada yang mampu menjagamu. Tidak mau memikirkan. Yakni Al Qur’an. Padahal kalau mereka mau mendatangi peringatan itu dan menerima nasehatnya, tentu mereka ditunjuki kepada jalan yang lurus dan diberi taufiq dalam urusan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 42",
    "description": "Katakanlah, wahai nabi Muhammad, sebagai jawaban atas ejekan orang-orang kafir dengan pertanyaan, 'siapakah yang akan menjaga kamu pada waktu malam dan siang dari siksaan Allah yang maha pengasih di dunia'' pertanyaan ini dimaksudkan untuk menyadarkan mereka bahwa tidak seorang pun berkuasa melindungi mereka dari azab Allah; tetapi mereka enggan mengingat tuhan mereka dengan beriman dan beribadah kepada-Nya. 43. Pertanyaan kedua dimaksudkan untuk menyadarkan mereka tentang kemampuan tuhan-tuhan mereka. Ataukah mereka mempunyai tuhan-tuhan yang dapat memelihara mereka dari azab kami di dunia maupun akhirat' Allah kemudian menegaskan bahwa tuhan-tuhan mereka itu tidak sanggup menolong diri mereka sendiri apa lagi menolong orang-orang kafir yang menyembahnya; dan tidak pula mereka, baik yang disembah maupun yang menyembah tuhan-tuhan selain Allah, dilindungi dari (azab) kami di akhirat."
  }
]