[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka punya tuhan-tuhan sesembahan yang mampu menghalangi mereka dari azab Kami? Sesungguhnya tuhan-tuhan mereka itu tidak sanggup menolong diri mereka sendiri, maka bagaimana mungkin mereka itu menolong orang-orang yang menyembah mereka? Padahal, mereka juga tidak terlindungi dari azab Kami?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Atau apakah mereka memiliki tuhan-tuhan yang bisa menolong mereka dari azab Kami? Tuhan-tuhan mereka itu tidak kuasa menolong diri mereka sendiri dengan menjauhkannya dari mudarat atau mendatangkan untuknya maslahat, lalu bagaimana bisa orang yang tidak kuasa menolong dirinya sendiri mampu untuk menolong orang lain?! Dan mereka sekali-kali tidak akan dilindungi dari azab Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Apakah orang-orang yang ingin agar azab disegerakan itu mempunyai tuhan-tuhan yang dapat melindungi mereka dari azab Kami? Sungguh tuhan-tuhan itu tidak mampu menolong diri mereka sendiri, dan tidak mendapat penolong selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. أَمْ لَهُمْ ءَالِهَةٌ تَمْنَعُهُم مِّن دُونِنَا ۚ (Atau adakah mereka mempunyai tuhan-tuhan yang dapat memelihara mereka dari (azab) Kami) Yakni apakah mereka memiliki tuhan-tuhan yang dapat menghalangi azab Kami bagi mereka? لَا يَسْتَطِيعُونَ نَصْرَ أَنفُسِهِمْ(Tuhan-tuhan itu tidak sanggup menolong diri mereka sendiri) Mereka tidak mampu menolong diri mereka sendiri, lalu bagaimana mereka dapat menolong orang lain. وَلَا هُم مِّنَّا يُصْحَبُونَ(dan tidak (pula) mereka dilindungi dari (azab) Kami itu?) Dan mereka tidak dibebaskan dari azab Kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Ataukan mereka memiliki tuhan-tuhan selain Kami yang melindungi mereka dari azab Kami? Sesungguhnya tuhan-tuhan itu tidak mampu menyelamatkan dirinya sendiri, lalu bagaimana bisa mereka menolong selainnya? Mereka juga tidak mampu menyelamatkan diri dari azab Kami, sehingga tidak ada satupun yang mampu melindungi mereka dari azab Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah bagi mereka} bagi mereka {tuhan-tuhan selain Kami yang melindungi mereka padahal Tuhan-tuhan itu tidak sanggup menolong diri sendiri dan tidak pula dilindungi} dilindungi {dari (azab) Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Atau adakah mereka mempunyai tuhan-tuhan yang dapat memelihara mereka dari (azab) Kami,” maksudnya jika Kami berkehendak mendatangkan sebuah keburukan pada mereka, apakah ada sesembahan mereka yang akkan mampu mellindungi mereka dari keburukan dan kejjahatan yang melanda mereka? “Tuhan-tuhan itu tidak sanggup menolong diri mereka sendiri dan tidak pula mereka dilindungi dari (azab) Kami itu,” maksudnya, mereka tidak memperoleh pertolongan di sisi Kami. Jika mereka tidak mendapatkan pertolongan dari Allah, maka mereka merupakan orang-orang yang terlantarkan dalam (menjalankan) urusan-urusan mereka. Mereka tidak mampu mendatangkan maslahat dan menepis mara bahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 43: Maksudnya, apakah tuhan-tuhan mereka mampu menghindarkan azab yang Kami turunkan. Yakni orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 43",
    "description": "Pertanyaan kedua dimaksudkan untuk menyadarkan mereka tentang kemampuan tuhan-tuhan mereka. Ataukah mereka mempunyai tuhan-tuhan yang dapat memelihara mereka dari azab kami di dunia maupun akhirat' Allah kemudian menegaskan bahwa tuhan-tuhan mereka itu tidak sanggup menolong diri mereka sendiri apa lagi menolong orang-orang kafir yang menyembahnya; dan tidak pula mereka, baik yang disembah maupun yang menyembah tuhan-tuhan selain Allah, dilindungi dari (azab) kami di akhirat. 44. Allah memberi mereka kemewahan dan kenikmatan hidup bukan karena Allah tidak kuasa menurunkan azab. Sebenarnya kami telah memberi mereka dan nenek moyang mereka kenikmatan hidup di dunia hingga panjang usia mereka untuk menguji apa mereka beriman atau tidak. Maka apakah mereka tidak melihat bahwa kami, melalui nabi dan kaum muslim yang menyebarkan ajaran islam, mendatangi negeri yang berada di bawah kekuasaan orang kafir seperti persia dan romawi, lalu kami kurangi luasnya dari ujung-ujung negeri, karena sebagian besar penduduknya masuk islam' apakah mereka yang menang dalam menunjukkan kebenaran agama Allah'."
  }
]