[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir dan bapak-bapak mereka terperdaya dengan penundaan datangnya siksaan, lantaran keadaan yang mereka saksikan berupa limpahan harta, banyaknya anak dan umur panjang. Maka mereka pun tetap hidup di atas kekafiran mereka, tidak mau meninggalkannya. Dan mereka berasumsi bahwa sesungguhnya mereka tidak akan mengalami siksaan. Mereka lalai memperhatikan ketetapan Allah yang sudah berlaku. Allah mengurangi jarak di bumi dari sisi-sisinya melalui siksaan yang Allah timpakan kepada kaum musyrikin dalam setiap penjuru dan diakibatkan kekalahan yang mereka alami. Apakah termasuk dalam jangkauan kemampuan orang-orang kafir Makkah untuk kabur dari Kuasa Allah atau mempertahankan diri dari kematian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Bahkan sebenarnya Kami telah memberikan kesenangan kepada orang-orang kafir itu, juga nenek moyang mereka dengan melapangkan berbagai kenikmatan Kami untuk mereka, sebagai bentuk istidrāj (penangguhan agar azab mereka semakin besar) dari Kami, sehingga usia mereka pun panjang yang membuat mereka semakin tertipu dengannya, dan semakin mempertahankan kekafiran mereka. Maka apakah orang-orang yang tertipu dengan nikmat Kami dan meminta segeranya azab Kami itu tidak melihat bahwa Kami mendatangi negeri mereka lalu Kami kurangi luasnya dari ujung-ujungnya dengan mengalahkan penghuninya, lalu mereka mengambil pelajaran darinya agar mereka tidak diazab sebagaimana orang-orang selain mereka?! Mereka itu bukanlah orang-orang yang menang, tetapi hanyalah sebagai orang-orang yang dikalahkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Namun Kami sedang memberi istidraj kepada orang-orang kafir; Kami memberi kenikmatan kepada mereka dan para pendahulu mereka di kehidupan dunia sehingga mereka telah menghabiskan banyak umur dalam kenikmatan, sehingga mereka terlena. Tidakkah mereka melihat bahwa Kami mendatangi negeri mereka kemudian mengurangi setiap tepinya dengan penakhlukkan yang Allah berikan bagi nabi-Nya atau dengan gelombang laut yang menerjang negeri itu sehingga menenggelamkan wilayah mereka yang luas? Kemudian Allah mengolok mereka: “Apakah mereka yang menang?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. حَتَّىٰ طَالَ عَلَيْهِمُ الْعُمُرُ ۗ (hingga panjanglah umur mereka) Sehingga mereka tertipu dengan umur mereka yang panjang dan mereka merasa akan tetap seperti itu. أَفَلَا يَرَوْنَ(Maka apakah mereka tidak melihat) Yakni apakah mereka tidak melihat sehingga dapat menyadari. أَنَّا نَأْتِى الْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَآ ۚ( bahwasanya Kami mendatangi negeri (orang kafir), lalu Kami kurangi luasnya dari segala penjurunya) Yakni Kami mengurangi negeri-negeri orang-orang kafir dengan menakhlukkannya bagi Muhammad dan kaum muslimin, satu per satu dari negeri-negeri tersebut. أَفَهُمُ الْغٰلِبُونَ (Maka apakah mereka yang menang?) Yakni bagaimana mereka akan menang atas Kami setelah Kami mengurangi negeri-negeri mereka dari penjuru-penjurunya hingga Kami mengepung mereka kemudian Kami menakhlukkannya bagimu dan menghabisi kekuasaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Bahkan pada masa kenabian, Kami telah membuat orang-orang musyrik arab dan bapak-bapak mereka itu bisa menikmati kenikmatan yang Kami berikan di dunia, sampai panjanglah umur mereka dalam merasakan nikmat itu, sehingga mereka tertipu olehnya dan menganggap bahwa merekalah pemilik kenikmatan itu. Apakah mereka tidak melihat bahwa sesungguhnya Kami mendatangi tanah mereka, lalu mempersempitnya dengan menghancurkannya dan membinasakan penduduknya? Apakah mereka itu bisa mengalahkan Kami? Tetapi mereka itulah orang-orang yang dikalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebenarnya Kami telah memberi mereka dan nenek moyang mereka kenikmatan sehingga panjang usia mereka. Maka tidakkah mereka melihat bahwa Kami mendatangi negeri} negeri orang-orang kafir {lalu Kami mengurangi luasnya dari ujung-ujungnya} Kami menaklukkan dari sisi-sisinya untuk orang-orang muslim daerah demi daerah, dan Kami meletakkan di sana bangunan-bangunan Islam {Apakah mereka yang menang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Faktor yang menyebabkan mereka kontinu dalam kekufuran dan kesyirikan ialah, FIrman Allah, “Sebenarnya Kami telah memberi mereka dan bapak-bapak mereka kenikmatan (hidup di dunia) hingga panjanglah umur mereka,” maksudnya, Kami telah menopang kehidupan mereka dengan limpahan harta dan keturunan, dan Kami telah mengaruniakan umur panjang bagi mereka. Akhirnya, mereka menyibukkan diri untuk menikmatinya dan melupakan untuk misi apa mereka diciptakan di dunia ini. Seiring dengan perjalanan masa bersama mereka, kalbu-kalbu mereka menjadi keras, kepongahan mereka semakin menjadi-jadi serta kekufuran mereka pun semakin mengental. Andai mereka mau mengarahkan pandangan mereka kepada orang-orang yang berada di sisi bumi sebelah kanan dan kiri, niscaya mereka tidak akan menjumpai kecuali orang yang telah binasa. Tidaklah mereka mendengarkan melainkan suara-suara ratapan wanita. Dan tidaklah mereka menyadari melainkan masa-masa yang saling bergantian, berujung pada kehancuran. Kematian telah berdiri tegak di tengah jalan –untuk menyambar jiwa-jiwa- menyebarkan tali-tali jeratnya. Karena itu, Allah berfirman, “Maka apakah mereka tidak melihat bahwasanya Kami mendatangi negeri (orang kafir), lalu Kami kurangi luasnya dari segala penjurunya,” yaitu kabar tentang kematian tentang para penduduknya, dan kehancuran mereka secara perlahan-lahan sampai akhirnya Allah mewarisi bumi dan seisinya. Dia-lah sebaik-baik Dzat yang mewarisi. Jika mereka menyaksikan kejadian ini, niscaya mereka tidak akan terpedaya dan tidak akan keras kepala dengan kondisi mereka saat itu “maka apakah mereka itu menang,” yang dengan keleluasaan yang dimiliki, mereka bisa keluar dari takdir Allah dan dengan kemampuan yang dimiliki, mereka dapat menahan diri dari kematian. Apakah seperti ini keadaan mereka hingga tertipu dengan masa kehidupan mereka yang panjang (di dunia ini)? Ataukah mereka itu, bila utusan Allah (malaikat) datang untuk mencabut ruh-ruh, mereka akan patuh dan merasa hina, tidak tampak unsur penentangan dari mereka sedikit pun?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 44: Seperti harta, anak dan panjang umur. Sehingga mereka tertipu. Mereka sibuk bersenang-senang, dan lupa untuk apa mereka diciptakan, waktu yang lama berlalu bagi mereka sehingga hati mereka menjadi keras, sikap melampaui batasnya semakin menjadi, dan kekafiran mereka semakin besar. Maksudnya, tidakkah orang-orang kafir melihat ke sebelah kanan negeri mereka dan ke sebelah kirinya, di mana mereka akan melihat sebagiannya binasa, tidak terdengar lagi selain berita kematian, kematian siap datang ke segenap tempat untuk mencabut nyawa mereka sedikit demi sedikit sehingga diwarisi Allah. Bisa juga maksud, “lalu Kami kurangi luasnya dari ujung-ujung negeri” dengan diberikannya kepada Nabi shallallahu 'alaihi wa sallam dan Beliau berhasil menaklukkannya. Jika seandainya mereka memperhatikannya, niscaya mereka tidak akan tertipu dan tidak akan terus menerus di atas kekafiran. Tidak, bahkan Nabi shallallahu 'alaihi wa sallam dan para sahabatnya yang menang. Atau maksudnya, apakah mereka dapat keluar dari taqdir Allah atau lolos dari kematian?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 44",
    "description": "Allah memberi mereka kemewahan dan kenikmatan hidup bukan karena Allah tidak kuasa menurunkan azab. Sebenarnya kami telah memberi mereka dan nenek moyang mereka kenikmatan hidup di dunia hingga panjang usia mereka untuk menguji apa mereka beriman atau tidak. Maka apakah mereka tidak melihat bahwa kami, melalui nabi dan kaum muslim yang menyebarkan ajaran islam, mendatangi negeri yang berada di bawah kekuasaan orang kafir seperti persia dan romawi, lalu kami kurangi luasnya dari ujung-ujung negeri, karena sebagian besar penduduknya masuk islam' apakah mereka yang menang dalam menunjukkan kebenaran agama Allah'45. Katakanlah, wahai Muhammad, kepada orang-orang kafir dan musyrik tentang tugas pokok dan fungsi seorang utusan Allah, 'se-sungguhnya aku hanya memberimu peringatan kepada seluruh umat manusia sesuai dengan wahyu yang disampaikan Allah kepadaku. ' tetapi orang tuli pikiran, perasaan dan ruhaninya, tidak mendengar seruan yang disampaikan seorang utusan Allah, apabila mereka diberi peringatan de-ngan cara yang masuk akal, lembut, dan santun sekalipun."
  }
]