[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah olehmu (wahai Rasul) kepada umat yang kamu diutus kepada mereka, “Tidaklah aku memperingatkan kalian dengan sesuatu siksaan, kecuali melalui wahyu dari Allah, yaitu al-Qur’an.” Akan tetapi, orang-orang kafir tidak mau mendengar apa yang disampaikan kepada mereka dengan seksama, jika mereka sedang diberi peringatan. Maka mereka tidak memperoleh manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Katakanlah -wahai Rasul-, \"Sesungguhnya aku hanya memberikan peringatan kepada kalian -wahai manusia- akan azab Allah yang disampaikannya lewat wahyu yang Tuhanku turunkan kepadaku,\" Tetapi orang yang tuli dari kebenaran sama sekali tidak mendengarkan seruan kebenaran itu bila diingatkan dengan azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Hai Nabi, katakanlah kepada mereka: “Aku memperingatkan kalian dengan al-Qur’an dan wahyu yang Allah berikan kepadaku.” Akan tetapi orang-orang kafir yang telah tertutup telinganya tidak dapat mendengar peringatan yang disampaikan ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. قُلْ إِنَّمَآ أُنذِرُكُم بِالْوَحْىِ ۚ (Katakanlah (hai Muhammad): “Sesungguhnya aku hanya memberi peringatan kepada kamu sekalian dengan wahyu) Yakni aku memberi kalian peringatan dengan al-Qur’an, dan ini adalah tugas yang diutuskan Allah kepadaku. وَلَا يَسْمَعُ الصُّمُّ الدُّعَآءَ إِذَا مَا يُنذَرُونَ(dan tiadalah orang-orang yang tuli mendengar seruan, apabila mereka diberi peringatan) Yakni barangsiapa yang ditulikan Allah pendengarannya maka ia tidak akan mendengar seruan dari orang yang memperingatinya dari mara bahaya; begitu juga kaum tersebut, mereka tuli dari peringatan yang ditujukan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Katakanlah, wahai Rasulallah: “Sesungguhnya aku memberi peringatan kalian dengan Al-Qur’an yang diwahyukan Allah kepadaku untuk meredam kemarahanNya saat (kalian) berlaku maksiat kepadaNya. Dan orang yang ditulikan oleh Allah pendengarannya karena meninggalkan amal yang telah didengarnya itu tidak bisa mendengar seruan menuju kebaikan saat diberi peringatan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya aku hanya memperingatkan kalian} memperingatkan kalian {dengan wahyu} dengan Al-Qur’an {tetapi orang-orang tuli itu tidak mendengarkan seruan} seruan {jika mereka diberi peringatan} diperingatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Maksudnya, “katakanlah,” wahai Muhammad kepada seluruh manusia “Sesungguhnya aku hanya memberi peringatan kepada kamu sekalian dengan wahyu,” maksudnya saya hanyalah seorang rasul, tidak membawa sesuatu dari diriku sendiri. Saya tidak mempunyai perbendaharaan kekayaan Allah, tidak mengetahui alam ghaib, dan tidak pula mengatakan bahwa diriku seorang malaikat. Saya hanyalah bertugas memberikan peringatan kepada kalian dengan wahyu yang Allah wahyukan kepadaku. Kalau kalian menyambut hal tersebut, maka sungguh kalian telah menyambut (panggilan) Allah, dan Dia akan memberikan balasan bagi kalian atas respons tersebut. Apakah kalian berpaling dan melakukan penentangan, maka saya tidak mempunyai kewenangan sedikit pun dalam mengatur alam semesta ini. Segala urusan adalah milik Allah, dan ketetapan takdir hanya milik Allah semuanya. “Dan tidaklah orang-orang yang tuli mendengar seruan.” Maksudnya orang tuli tidak mampu lagi mendengarkan suara. Sebab, pendengarannya telah rusak dan tidak berfungsi lagi. Syarat dapat mendengarkan suara, adalah mesti ada media yang dapat menerimanya. Begitu pula wahyu, merupakan faktor kehidupan bagi hatii dan ruh serta piranti untuk memahami maksud dari Allah. Tetapi, bila hati menolak mendengarkan hidayah, maka hati tersebut saat berinteraksi dengan hidayah dan cahaya iman, layaknya orang tuli terhadap suara-suara yang ada. Orang-orang musyrik, mereka itu tuli terhadap hidayah. Oleh karena itu, janganlah dipandang dengan keheranan bila mereka tidak dapat meraih hidayah. Terlebih lagi, dalam kondisi seperti ini, di mana siksaan belum mendatangi mereka, dan rasa sakitnya siksaan belum mengenai mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 45: Dari Allah, bukan dari diriku sendiri. Mereka (orang-orang kafir dan musyrik) disebut sebagai orang yang tuli meskipun mereka mampu mendengar, karena peringatan yang disampaikan kepada mereka tidak ubahnya menyampaikan kepada orang yang tuli yang tidak mendengar peringatan dari orang lain dan tidak berpengaruh apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 45",
    "description": "Katakanlah, wahai Muhammad, kepada orang-orang kafir dan musyrik tentang tugas pokok dan fungsi seorang utusan Allah, 'se-sungguhnya aku hanya memberimu peringatan kepada seluruh umat manusia sesuai dengan wahyu yang disampaikan Allah kepadaku. ' tetapi orang tuli pikiran, perasaan dan ruhaninya, tidak mendengar seruan yang disampaikan seorang utusan Allah, apabila mereka diberi peringatan de-ngan cara yang masuk akal, lembut, dan santun sekalipun. 46. Orang-orang kafir ketika hidup di dunia bersikap sombong, keras kepala, dan menantang azab Allah, tetapi di akhirat ketika mereka sadar, mereka menyesali perbuatannya. Dan jika mereka ditimpa sedikit saja azab tuhanmu, di dalam neraka, pastilah mereka berkata, dengan sangat menyesal, 'celakalah kami, berada dalam azab yang pedih! sesungguhnya kami termasuk orang yang selalu menzalimi diri sendiri dengan tidak beriman, sombong, keras kepala, dan menantang azab Allah. '."
  }
]