[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya bagian siksaan dari Allah itu menimpa orang-orang kafir secara langsung, pastilah mereka akan menyadari kesudahan nasib mereka akibat pendustaan mereka, dan mereka akan meresponnya dengan mendoakan kebinasaan terhadap diri mereka, disebabkan oleh tindakan kezhaliman mereka terhadap diri mereka sendiri dengan menyembah tuhan-tuhan selain Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan apabila orang-orang yang meminta segera datangnya azab itu ditimpa sedikit saja dari azab Tuhanmu -wahai Rasul-, pastilah saat itu mereka berkata, \"Celaka dan merugilah kami, sesungguhnya kami termasuk orang-orang zalim dengan melakukan kesyirikan kepada Allah dan mendustakan apa yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam-.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Demi Allah, jika mereka tertimpa sedikit azab Allah, niscaya mereka akan segera mengakui dosa-dosa mereka dan terus menerus merasa tersiksa: “Duhai kebinasaan kami telah datang, sungguh kami telah menzalimi diri kami sendiri dengan mendustakan para rasul.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَلَئِن مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ (Dan sesungguhnya, jika mereka ditimpa sedikit saja dari azab Tuhan-mu) Yakni seandainya mereka tertimpa sedikit saja dari azab. لَيَقُولُنَّ يٰوَيْلَنَآ إِنَّا كُنَّا ظٰلِمِينَ(pastilah mereka berkata: “Aduhai, celakalah kami, bahwasanya kami adalah orang yang zalim) Yakni mereka pasti akan mengharapkan kebinasaan bagi diri mereka, serta mengakui kezaliman yang telah mereka lakukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَئِنْ مَسَّتْهُمْ نَفْحَةٌ مِنْ عَذَابِ رَبِّكَ } Perhatikan ancaman dan peringatan ini dituliskan dengan baya bahasa yang sangat dalam: { ُّالمَس } yakni timpaan yang ringan, dan { نَفْحَةٌ } yakni sangat sedikit, dan { مِنْ } menunjukkan sebagian dari sesuatu, dan { العَذَابُ } lebih ringan dari lafadz النَكَال . Sesungguhnya barangsiapa yang demikian nasibnya hanya dengan siksaan yang sagat sedikit ia tidak mampu menahannya, lalu bagaimana ia akan bersabar dengan siksaan yang lebih besar lagi dari sang Mahasa Kuasa?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Dan sungguh jika mereka ditimpa azab Tuhanmu yang ringan, maka mereka akan berkata: “Celakalah Kami, sesungguhnya Kami menzalimi diri sendiri dengan berbuat kekufuran dan mendustakan para rasul, salah satunya yaitu Muhammad SAW”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka ditimpa} mereka ditimpa azab {sedikit} sedikit {azab Tuhanmu, sungguh mereka berkata,“Celakalah kami! Sesungguhnya kami adalah orang yang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Seandainya sudah benar-benar mengenai mereka “sedikit saja dari azab Rabbmu,” yaitu walaupun bagian kecil dari siksaNYa, namun tidak ada istilah sedikit pada siksa Allah “pastilah mereka berkata, ‘Aduhai celakalah kami, bahwasanya kami adalah orang-orang yang menganiaya diri sendiri ‘,” maksudnya tiada perkataan yang mereka sampaikan kecuali ratapan celaka, kebinasaan, penyesalan dan pengakuan atas perbuatan aniaya dan kekufuran mereka serta pengakuan menjadi orang yang berhak tertimpa siksa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 46: Dengan berbuat syirk dan mendustakan Nabi shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 46",
    "description": "Orang-orang kafir ketika hidup di dunia bersikap sombong, keras kepala, dan menantang azab Allah, tetapi di akhirat ketika mereka sadar, mereka menyesali perbuatannya. Dan jika mereka ditimpa sedikit saja azab tuhanmu, di dalam neraka, pastilah mereka berkata, dengan sangat menyesal, 'celakalah kami, berada dalam azab yang pedih! sesungguhnya kami termasuk orang yang selalu menzalimi diri sendiri dengan tidak beriman, sombong, keras kepala, dan menantang azab Allah. '47. Dalam menilai perbuatan hamba-hamba-Nya di akhirat, Allah menjamin akan menegakkan keadilan yang sebenarnya. Dan kami akan memasang timbangan yang tepat pada hari kiamat, dengan data yang objektif dan akurat; maka tidak seorang pun dirugikan walau sedikit, sehingga tidak ada seorang hamba yang amal kebaikannya dikurangi atau kejahatannya dilebih-lebihkan, sekalipun hanya seberat biji sawi, pasti kami mendatangka pahala untuk perbuatan baik dan hukuman untuk perbu-atan jahat. Dan cukuplah kami yang membuat perhitungan terhadap perbuatan manusia dengan seadil-adilnya, objektif, tepat, dan akurat."
  }
]