[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah meletakkan timbangan yang adil untuk proses perhitungan amal perbuatan pada Hari Kiamat. Dan Dia tidak menzholimi mereka itu dan orang-orang lainnya sedikitpun. Kendatipun amal itu sebesar biji sawi sekali pun, dari kebaikan atau keburukan, akan diperhitungkan dalam perhitungan amal pelakunya. Dan cukuplah Allah sebagai penghitung perbuatan hamba-hambaNya dan pemberi balasan kepada mereka dengan setimpal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan Kami akan memasang timbangan yang adil lagi tepat untuk orang-orang yang datang pada hari Kiamat kelak agar amal perbuatan mereka ditimbang, pada hari itu tidak seorang pun dirugikan dan dizalimi dengan mengurangi pahala amalan kebaikannya atau menambah dosa amalan keburukannya, sekalipun amalan yang ditimbang itu sedikit seberat timbangan biji sawi kami pasti mendatangkannya, dan cukuplah Kami yang membuat perhitungan untuk menghitung amal perbuatan hamba-hamba Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Allah mengabarkan keadilan-Nya ketika menghisab makhluk-Nya pada hari kiamat, ketika meletakkan timbangan amal yang adil dan akurat, sehingga tidak ada seorangpun yang terzalimi atas amalannya, baik itu orang beriman maupun orang kafir, meski amalan yang dikerjakan itu seberat semut kecil dari kebaikan atau keburukan, semua itu akan mendapat balasannya. Dan cukuplah Tuhanmu yang menghitung amalan seluruh hamba."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَنَضَعُ الْمَوٰزِينَ الْقِسْطَ لِيَوْمِ الْقِيٰمَةِ (Kami akan memasang timbangan yang tepat pada hari kiamat) Yakni timbangan yang adil untuk menimbang amal perbuatan para makhluk. فَلَا تُظْلَمُ نَفْسٌ شَيْـًٔا ۖ( maka tiadalah dirugikan seseorang barang sedikitpun) Ini merupakan timbangan yang adil yang tidak mengurangi kebaikan orang yang berbuat baik dan tidak menambah keburukan orang yang berbuat buruk. وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ(Dan jika (amalan itu) hanya seberat biji sawipun) Meski amalan tersebut sangat kecil dan remeh sekecil biji sawi. أَتَيْنَا بِهَا ۗ( pasti Kami mendatangkan (pahala)nya) Yakni Kami datangkan amalan tersebut untuk Kami beri balasan. وَكَفَىٰ بِنَا حٰسِبِينَ(Dan cukuplah Kami sebagai pembuat perhitungan) Kami sangat baik dalam perhitungan sehingga tidak akan ada yang tertinggal sedikitpun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seorang laki-laki pernah menggugat salah seorang anak dari khalifah, sang khalifah kemudian mengambil tindakan terhadap anaknya atas gugatan itu, terkejut atas tindakan sang khalifah laki-laki itu pun membacakan sebuah syi'ir atas kekagumannya kepada sang khalifah, sang khalifah kemudian berterima kasih dan berkata : tidaklah aku datang ke majlis ini melainkan aku telah membaca firman Allah : { وَنَضَعُ ٱلْمَوَٰزِينَ ٱلْقِسْطَ لِيَوْمِ ٱلْقِيَٰمَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْـًٔا ۖ وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا ۗ وَكَفَىٰ بِنَا حَٰسِبِينَ } \"Kami akan memasang timbangan yang tepat pada hari kiamat, maka tiadalah dirugikan seseorang barang sedikitpun. Dan jika (amalan itu) hanya seberat biji sawipun pasti Kami mendatangkan (pahala)nya. Dan cukuplah Kami sebagai pembuat perhitungan\" seseorang yang meriwayatkan atsar ini berkata : aku tidak melihat laki-laki itu menangis sebanyak hari itu. 2 ). Dari ayat ini dapat difahami bahwa urusan muamalah seorang hamba dengan Allah dan dengan makhluk adalah perkara yang sangat besar tidak diketahui berapa besarnya kecuali oleh orang-orang yang berakal; karena hasil dari muamalah itu entah akan mendapat kemarahan dan balasan pedih dari Allah, atau Ridho dan nikmat darinya dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Dan Kami akan meletakkan timbangan yang adil untuk menimbang amal-amal para hamba pada hari kiamat, sehingga seseorang tidak dirugikan sedikitpun dengan dikurangi kebaikannya atau ditambah keburukannya. Sekalipun ukuran amal itu ringan dan kecil layaknya biji sawi, Kami akan tetap mendatangkannya agar bisa membalas amal itu. Dan cukuplah Kami yang menghitung setiap amal para hamba."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami akan meletakkan timbangan yang tepat} yang adil {pada hari Kiamat, sehingga tidak ada seorang pun dizalimi sedikit pun. Sekalipun hanya seberat biji} seberat biji {dari sawi} biji paling kecil {sungguh Kami mendatangkannya. Cukuplah Kami sebagai penghisab} penghitung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Allah mengabarkan mengenai ketetapan hukumNYa yang adil dan keputusanNya yang berimbang (tidak berat sebelah) di antara para hambaNya ketika Dia menghimpun mereka semua di Hari Kiamat. Dia memasang timbangan-timbangan yang adil bagi mereka. Dalam timbangan-timbangan itu menjadi tampak jelas beratnya biji sawi yang dengan itu kebaikan dan kejelekan akan ditimbang. “Maka tidaklah dirugikan seseorang,” baik jiwa yang Muslim ataupun yang kafir “barang sedikit pun,” dalam bentuk pengurangan dari sebagian kebaikannya atau penambahan kejelekannya. Kendatipun seberat biji sawi yang merupakan partikel terkecil dan tidak diperhitungkan, yang berasal dari kebaikan maupun kejelekan, Kami akan membawa dan menghadirkannya. Tujuannya, agar pemiliknya mendapatkan balasan dengannya. Makna ini seperti kandungan ayat, \"Barang siapa yang mengerjakan kebaikan seberat zarah pun, niscaya dia akan melihat (balasan) nya. Dan barang siapa yang mengerjakan kejahatan seberat zarah pun, niscaya dia akan melihat (balasan) nya pula.\" (Az-Zalzalah:7-8) \"dan mereka berkata: \"Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang jua pun\". (Al-Kahfi:49). “Dan cukuplah Kami sebagai Pembuat perhitungan,” maksudnya DZat Allah yang mulia sebagai pembuat perhitungan hal tersebut. Cukuplah Allah sebagai DZat yang memperhitungkan amalan-amalan. Maksudnya, mengetahui seluruh amaliah para hambaNya, memeliharanya dan menempatkannya dalam sebuah kitab catatan, mengetahui perhitungannya dan ketentuan pahala atau hukumannya serta hak-haknya untuk menyerahkan balasan bagi para pelakunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 47: Ketika manusia dikumpulkan di padang mahsyar, Allah Subhaanahu wa Ta'aala memasang timbangan yang adil, di mana dengannya kebaikan dan keburukan mereka ditimbang. Seperti dikurangi kebaikannya dan ditambah keburukannya. Yakni cukuplah Dia yang mengetahui amalan hamba, yang menjaganya, yang menetapkannya dalam kitab, yang mengetahui ukurannya, dan ukuran balasannya serta keberhakannya serta yang menyampaikan balasan kepada orang-orang yang melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 47",
    "description": "Dalam menilai perbuatan hamba-hamba-Nya di akhirat, Allah menjamin akan menegakkan keadilan yang sebenarnya. Dan kami akan memasang timbangan yang tepat pada hari kiamat, dengan data yang objektif dan akurat; maka tidak seorang pun dirugikan walau sedikit, sehingga tidak ada seorang hamba yang amal kebaikannya dikurangi atau kejahatannya dilebih-lebihkan, sekalipun hanya seberat biji sawi, pasti kami mendatangka pahala untuk perbuatan baik dan hukuman untuk perbu-atan jahat. Dan cukuplah kami yang membuat perhitungan terhadap perbuatan manusia dengan seadil-adilnya, objektif, tepat, dan akurat. 48. Allah telah menurunkan kitab taurat kepada nabi musa dan nabi harun sebagaimana Allah menurunkan Al-Qur'an kepada nabi Muhammad. Dan sungguh, kami telah memberikan kepada musa dan harun, furqan, kitab taurat yang berisi syariah (hukum-hukum) yang memisahkan salah dan benar; dan penerangan serta pelajaran bagi orang-orang yang bertakwa sehingga kita memahami tiga pokok ajaran taurat, hukum yang memisahkan salah dan benar, penerangan dan pelajaran yang menjadi pedoman hidup bagi orang-orang yang bertakwa."
  }
]