[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48-49. Dan sungguh Kami telah memberikan kepada Musa dan Harun hujjah dan pertolongan untuk menghadapi musuh mereka dan kitab (yaitu Taurat) yang dengannya kami membedakan antara kebenaran dan kebatilan, dan cahaya yang menjadi sumber petunjuk bagi orang-orang yang bertakwa. Yang takut akan siksaan Tuhan mereka, sedang mereka itu khawatir terhadap Hari perhitungan amal yang terjadi ketika datangnya Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan sungguh Kami telah berikan kepada Musa dan Harun -'alaihimassalām- Kitab Taurat sebagai pembeda antara yang hak dan yang batil, yang halal dan yang haram, juga sebagai petunjuk bagi orang yang beriman kepadanya, dan peringatan bagi orang-orang yang bertakwa kepada Tuhannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-49. Sungguh Kami telah memberikan Taurat kepada Musa dan Harun yang di dalamnya dijelaskan antara kebenaran dan kebatilan, dan di dalamnya terdapat hidayah dan pelajaran bagi orang-orang bertakwa yang takut kepada Allah ketika dalam kesendirian, meski tidak ada yang melihat mereka; dan mereka benar-benar takut dari kengerian hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَلَقَدْ ءَاتَيْنَا مُوسَىٰ وَهٰرُونَ الْفُرْقَانَ (Dan sesungguhnya telah Kami berikan kepada Musa dan Harun Kitab Taurat) Makna (الفرقان) di sini adalah kitab Taurat karena di dalamnya terdapat pembedaan antara halal dan haram. Pendapat lain mengatakan yang dimaksud adalah kemenangan atas musuh-musuhnya. وَضِيَآءً(dan penerangan) Yakni dalam Taurat terdapat petunjuk, jika mereka mengambilnya niscaya mereka akan mendapat cahaya untuk menerangi mereka dalam gelapnya kejahilan dan kesesatan. وَذِكْرًا لِّلْمُتَّقِينَ (serta pengajaran bagi orang-orang yang bertakwa) Agar mereka mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Dan sungguh Kami telah memberi Musa dan harun kitab Taurat yang memisahkan antara haq dan bathil, halal dan haram, menyimpan hidayah yang menyinari jalan, dan pelajaran yang dapat dipelajari oleh orang-orang yang bertakwa kepada Tuhannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah menganugerahkan kepada Musa dan Harun Al-Furqan} Taurat yang digunakan untuk memisahkan antara yang benar dan yang bathil {sinar} petunjuk {dan peringatan} pengingat {bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Kerapkali Allah memadukan antara dua kitab agung ini, yang mana alam semesta ini tidak pernah menujukkan kitab yang lebih utama, lebih agung penyebutannya, lebih mengandung berkah dan lebih besar muatan hidayah dan penjelasannya (bagi umat manusia) dari pada keduanya. Dua kitab tersebut yakni Taurat dan al-Quran. Allah memberitahukan bahwa Dia memberi al-Furqan (kitab yang membedakan) kepada Musa sebagai orang inti dan Harun sebagai pengikut. Yaitu Taurat yang membedakan antara kebenaran dan kebatilan, petunjuk dan kesesatan. Ia merupakan “penerangan” yaitu cahaya yang menjadi obor bagi orang-orang yang mencari hidayah, menjadi pemandu bagi orang-orang yang berjalan serta piranti untuk mengetahui hukum-hukum Allah dan alat yang membedakan antara hal-hal yang halal dan haram, menyebarkan penerangan dalam kegelapan kebodohan, bid’ah, dan kesesatan, serta berfungsi sebagai pengingat bagi orang-orang yang bertakwa. Dengan itu, mereka mengingat hal-hal yang bermanfaat dan hal-hal yang berbahaya bagi mereka, dan mengingat-ingat kebaikan dan kejelekan. Allah mengkhususkan penyebutan bagi orang-orang yang bertakwa dalam konteks ini, karena mereka itulah pihak-pihak yang meraup manfaat darinya dalam bentuk ilmu maupun amalan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 48: Syaikh As Sa’diy berkata, “Sering sekali Allah Subhaanahu wa Ta'aala menggabung dua kitab yang agung ini, di mana tidak pernah datang ke dunia kitab yang lebih utama daripada keduanya, lebih agung namanya dan lebih berkah, serta lebih agung petunjuk dan penjelasannya, yaitu Taurat dan Al Qur’an. Allah memberitahukan, bahwa Dia telah memberikan kepada Musa pada asalnya, dan Harun mengikuti, yaitu al Furqan yang membedakan antara yang hak dengan yang batil, petunjuk dan kesesatan…dst.” Furqan artinya yang membedakan antara yang hak dengan yang batil, dan antara yang halal dengan yang haram. Yakni cahaya yang dipakai petunjuk untuk menerangi jalan hidup, dan dengannya diketahui hukum-hukum, dibedakan antara yang halal dan yang haram, serta sebagai penerang di gelapnya kesesatan. Yakni nasehat. Dengannya mereka dapat mengingat hal yang bermanfaat bagi mereka dan hal yang membahayakan, dan dengannya mereka dapat mengingat kebaikan dan keburukan. Disebutkan secara khusus orang-orang yang bertakwa, karena merekalah yang dapat mengambil manfaat daripadanya, baik sebagai ilmu maupun amal. Pada ayat selanjutnya diterangkan tentang siapakah orang-orang yang bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 48",
    "description": "Allah telah menurunkan kitab taurat kepada nabi musa dan nabi harun sebagaimana Allah menurunkan Al-Qur'an kepada nabi Muhammad. Dan sungguh, kami telah memberikan kepada musa dan harun, furqan, kitab taurat yang berisi syariah (hukum-hukum) yang memisahkan salah dan benar; dan penerangan serta pelajaran bagi orang-orang yang bertakwa sehingga kita memahami tiga pokok ajaran taurat, hukum yang memisahkan salah dan benar, penerangan dan pelajaran yang menjadi pedoman hidup bagi orang-orang yang bertakwa. 49. Baik taurat maupun Al-Qur'an berfungsi sebagai pembeda (al-furq'n), penerangan dan pelajaran berharga bagi orang-orang yang bertakwa, yaitu orang-orang yang takut terhadap azab tuhannya, sekalipun mereka tidak melihat-Nya, tetapi meyakini dan meresapkan ke dalam kalbunya; dan mereka merasa takut akan tibanya hari kiamat yang berlangsung cepat dan dahsyat."
  }
]