[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48-49. Dan sungguh Kami telah memberikan kepada Musa dan Harun hujjah dan pertolongan untuk menghadapi musuh mereka dan kitab (yaitu Taurat) yang dengannya Kami membedakan antara kebenarana dan kebatilan, dan cahaya yang menjadi sumber petunjuk bagi orang-orang yang bertakwa. Yang takut akan siksaan Tuhan mereka, sedang mereka itu khawatir terhadap Hari perhitungan amal yang terjadi ketika datangnya Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Yaitu orang-orang yang takut akan azab Tuhan yang mereka imani sekalipun mereka belum pernah melihat-Nya, dan mereka merasa takut akan tibanya hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالْغَيْبِ (orang-orang yang takut akan (azab) Tuhan mereka, sedang mereka tidak melihat-Nya) Karena rasa takut ini senantiasa bersama ketakwaan. Yakni mereka takut dari azab Allah, meskipun mereka tidak melihat azab tersebut. وَهُم مِّنَ السَّاعَةِ مُشْفِقُونَ(dan mereka merasa takut akan (tibanya) hari kiamat) Yakni merasa takut dan khawatir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Yaitu orang-orang yang takut dengan azab Tuhannya dalam keadaan sembunyi dan tidak dilihat olehNya. Maksunya yaitu mereka adalah orang-orang ikhlas yang tidak pamer kepada manusia dan maereka itu takut terhadap kengerian hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang takut Tuhannya dalam keadaan sendiri} mereka takut kepada Tuhannya dalam keadaan lengang ketika dia sedang menyendiri dari orang lain {dan terhadap hari kiamat} hari kiamat {mereka takut} mereka takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Selanjutnya Allah menerangkan siapa orang-orang yang bertakwa itu. Allah berfirman, “(Yaitu) orang-orang yang takut akan (azab) Rabb mereka sedang mereka tidak melihatNya,” maksudnya, mereka takut kepada Allah saat mereka sendirian, tidak ada pandangan orang lain yang mengarah kepada mereka, sehingga pasti saat bersama orang lain, akan lebih takut kepada Allah. Mereka menahan diri (wara’) dari apa yang diharamkan oleh Allah dan melaksanakan perkara-perkara yang harus dikerjakan. “Dan mereka merasa takut akan (tibanya) Hari KIamat,” maksudnya, mereka takut lagi khawatir. Hal ini muncul karena kesempurnaan ma’rifat (pengetahuan) mereka tentang Rabb mereka. Sehingga mereka memadukan sikap untuk berbuat baik dan merasa takut kepaddaNya. Bentuk ‘athaf (kata sambung “dan”) di sini untuk menghubungkan sifat-sifat yang diperuntukkan bagi sesuatu yang (berjumlah) satu dan obyek yang satu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 49: Bisa juga diartikan, di saat manusia tidak melihatnya atau di saat sepi. Jika di saat sepi saja mereka merasa takut kepada azab Tuhan mereka, bagaimana pada saat berada di hadapan manusia? Tentu lebih takut lagi. Oleh karena itu, mereka menjaga diri dari apa yang diharamkan dan mengerjakan apa yang diwajibkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 49",
    "description": "Baik taurat maupun Al-Qur'an berfungsi sebagai pembeda (al-furq'n), penerangan dan pelajaran berharga bagi orang-orang yang bertakwa, yaitu orang-orang yang takut terhadap azab tuhannya, sekalipun mereka tidak melihat-Nya, tetapi meyakini dan meresapkan ke dalam kalbunya; dan mereka merasa takut akan tibanya hari kiamat yang berlangsung cepat dan dahsyat. 50. Bani israil, umat nabi musa dan harun, sebagian besar mengingkari taurat yang berisi pembeda, penerangan dan pelajaran bagi yang bertakwa. Dan Al-Qur'an ini bagi kamu sekalian, umat nabi Muhammad adalah suatu peringatan yang mempunyai berkah yang telah kami turunkan untuk umat akhir zaman. Maka apakah kamu mengingkarinya sebagaimana bani israil mengingkari taurat'."
  }
]