[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan orang-orang kafir mengingkari al-Qur’an. Diantara mereka ada yang berkata, “Sesungguhnya al-Qur’an itu hanya himpunan mimpi-mimpi yang carut-marut, tidak ada hakikatnya.” Yang lain mengatakan, “Sesungguhnya al-Qur’an adalah perkataan dusta dan kebohongan, bukan wahyu.” Sebagian yang lain mengatakan, “Sesungguhnya Muhammad seorang penyair. Dan kitab yang dibawanya adalah kumpulan syair-syair. Yang dia kehendaki dari kita adalah mempercayainya. Maka hendaknya dia mendatangkan kepada kita suatu mukjizat yang dapat dilihat seperti unta Shaleh, dan mukjizat-mukjizat Musa dan Isa serta mukjizat yang dibawa oleh para Rasul sebelumnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Akan tetapi mereka malah ragu dengan perkara yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam-, kadangkala mereka dengan mengatakan, \"Yang disampaikannya hanyalah mimpi-mimpi belaka yang tidak bisa ditafsirkan,\" Kadang pula mereka mengatakan, \"Bukan, akan tetapi dia sendirilah yang merekayasanya tanpa memiliki sumber mana pun,\", Kadang pula mereka berkata, \"Dia adalah penyair. Bila memang ia benar dalam klaimnya, maka cobalah ia mendatangkan kepada kami suatu mukjizat sebagaimana halnya para Rasul yang diutus sebelumnya, sungguh mereka telah datang dengan membawa berbagai mukjizat seperti tongkat Nabi Musa, dan unta betina Nabi Ṣāleḥ.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Orang-orang musyrik yang pendusta itu membuat tuduhan yang bermacam-macam terhadap apa yang Nabi datangkan, sebagian mereka mengatakan: “itu adalah bunga mimpi yang jauh dari kenyataan”, dan sebagian lain mengatakan: “Muhammad hanya membuat-buat al-Qur’an sendiri yang sama sekali tidak mengandung kebenaran”, dan sebagian lain mengatakan hal yang berbeda lagi: “Muhammad hanyalah seorang penyair, seandainya dia benar maka hendaklah dia mendatangkan mukjizat yang dapat kami saksikan sebagaimana para rasul terdahulu diutus, seperti Musa, Shalih, dan Isa.” Para penduduk negeri yang meminta mukjizat kepada para nabi mereka tidak juga beriman, namun mereka mendustakannya, sehingga Allah membinasakan mereka; maka apakah orang-orang musyrik Makkah itu akan beriman kepada mukjizat jika mereka telah menyaksikannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. بَلْ قَالُوٓا۟ أَضْغٰثُ أَحْلٰمٍۭ (Bahkan mereka berkata (pula): “(Al Quran itu adalah) mimpi-mimpi yang kalut) Yakni mereka berkata “sungguh apa yang kamu bawa hanyalah mimpi kosong.” Makna (الأضغاث) mimpi yang tidak memiliki makna. بَلِ افْتَرَىٰهُ(malah diada-adakannya) Yang dia buat sendiri tanpa ada sumbernya. بَلْ هُوَ شَاعِرٌ(bahkan dia sendiri seorang penyair) Dan yang dia datangkan adalah sebuah sihir. Ketidak konsistensian mereka ini adalah bukti bahwa mereka sama sekali tidak mengetahui apa yang sebenarnya Rasulullah bawa, mereka tidak mengetahui hakikatnya; atau mereka telah mengetahui bahwa itu benar-benar dari Allah, namun mereka hanya ingin menyesatkan para pengikut mereka. فَلْيَأْتِنَا بِـَٔايَةٍ كَمَآ أُرْسِلَ الْأَوَّلُونَ (maka hendaknya ia mendatangkan kepada kita suatu mukjizat, sebagai-mana rasul-rasul yang telah lalu diutus) Yakni sebagaimana Musa diutus dengan mukjizat tongkat dan lainnya, dan Shalih diutus dengan mukjizat unta betina."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ بَلْ قَالُوٓا۟ أَضْغَٰثُ أَحْلَٰمٍۭ بَلِ ٱفْتَرَىٰهُ بَلْ هُوَ شَاعِرٌ } \"Bahkan mereka berkata (pula): \"(Al Quran itu adalah) mimpi-mimpi yang kalut, malah diada-adakannya, bahkan dia sendiri seorang penyair\" Kalimat yang singkat ini menggambarkan bagaimana kebingungan menimpa mereka (para penyarir yang mendustakan al-Qur'an), dan memperlihatkan gambaran saksi palsu tatkala merasa ada keraguan pada dirinya : bagaimana mereka terombang-ambing ke arah kanan dan ke arah kiri, dan bagaimana jalan-jalan itu terpisah-terpisah tatkala mereka berusaha membenarkan sesuatu yang mustahil : { ٱنظُرْ كَيْفَ ضَرَبُوا۟ لَكَ ٱلْأَمْثَالَ فَضَلُّوا۟ فَلَا يَسْتَطِيعُونَ سَبِيلًا } \"Lihatlah bagaimana mereka membuat perumpamaan-perumpamaan terhadapmu; karena itu mereka menjadi sesat dan tidak dapat lagi menemukan jalan (yang benar)\" [ Al-Isra' : 48 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Bahkan sebagian mereka berkata: “Sesungguhnya apa yang ada dalam Al-Qur’an itu kebathilan, kebohongan, dan campuran-campuran mimpi yang dia lihat dalam mimpi.” Al-Adh’aatsu adalah mimpi yang tidak dapat ditafsirkan. Dan sebagian lainnya berkata: “Bahkan Al-Qur’an itu direkayasa oleh dirinya sendiri, bukan dari sisi Allah.” Mereka semua juga berkata: ”Bahkan sesungguhnya Al-Qur’an itu adalah syairnya penyair yang manis kata-katanya dan baik penjelasannya, yaitu perkataan indah yang bathil. Jika dia benar, maka sebaiknya dia menunjukkan kepada kami mukjizat yang dapat dirasakan sebagaimana para rasul sebelumnya diutus, seperti tongkat nabi Musa, unta nabi Shalih, dan mukjizat-mukjizat nabi Isa seperti menymebuhkan kebutaan dan penyakit kusta serta menghidupkan orang mati”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan, mereka berkata,“Mimpi-mimpi kosong} campuran mimpi yang dia lihat dalam mimpinya lalu dia membayangkannya bahwa itu wahyu dari Allah kepadanya {Bahkan dia mengada-adakannya} membuat-buatnya dari dirinya {Bahkan dia seorang penyair. Maka hendaklah dia mendatangkan kepada kami suatu tanda sebagaimana rasul-rasul yang diutus terdahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Allah menyebutkan kebohongan orang-orang yang mendustakan Muhammad dan al-Quran yang dibawanya. Mereka telah berbuat dusta tentangnya dan melontarkan komentar-komentar batil lagi bermacam-macam. Terkadang mengatakan, ‘(Al-Quran adalah) mimpi-mimpi kalut ibarat ocehan orang tidur yang sedang mengigau, tidak menyadari apa yang dikatakannya!’ kadang-kadang mereka menyatakan, ‘Ia telah membual, membuat-buat dan memasulkannya dari dirinya sendiri.’ Suatu waktu mereka mengatakan, ‘Ia adalah seorang penyair. Dan yang dibawanya adalah syair semata!’ padahal, orang yang mengetahui fakta walau sedikit saja tentang seluk-beluk Rasulullah dan memperhatikan al-Quran yang diembannya, niscaya akan yakin seyakin-yakinnya dengan keyakinan yang tidak bisa dirasuki oleh keragu-raguan, bahwa ia (al-Quran) merupakan perkataan yang paling agung dan paling tinggi, berasal dari Allah, tidak ada seorang pun dari kalangan manusia yang mampu mendatangkan semisalnya, walau sebagian saja. Sebagaimana Allah telah menantang para musuhNya dengan tantangan tersebut, agar mereka menghadapinya. Kendatipun banyak motivasi untuk melawan dan memusuhinya, namun mereka tidak demikian, maka tidakklah yang menyebabkan mereka berdiri dan duduk, bangun dari pembaringan-pembaringan mereka serta mengusik mulut-mulut mereka melainkan kebennaran yang tidak ada penghadangnya. Mereka melontarkan komentar-komentar tersebut tentang al-Quran dengan tidak mengimaninya, adalah untuk tujuan menjauhkan orang yang belum mengenalnya darinya. Padahal, ia Al-Quran merupakan bukti yang lestari yang menandakan kebenaran dan kelurusan risalah yang diemban oleh Rasulullah. Ia sudah mencukupi dan memadai. Siapa saja yang menuntut bukti lain selainnya, atau meminta diturunkan bukti selainnya, maka dia adalah orang bodoh lagi zhalim, persis seperti para penentang yang mendustakannya. Mereka malah meminta bukti-bukti lain yang justru akan menjelma sebagai bahaya bagi mereka, tanpa ada kebaikan pun bagi mereka dalam permintaan tersebut. Pasalnya, bila niatan mereka adalah ingin mengetahui kebenaran, jika telah jelas dalilnya, maka sungguh telah terlihat jelas apa yang mereka inginkan tanpa memerlukan pembuktian lagi. Apabila tujuan mereka berupaya mengagallkan dan menegakkan dalil bagi diri mereka (untuk tidak beriman) bila Rasul tidak mendatangkan apa yang mereka minta, maka sesungguhnya dengan kondisi seperti ini, (walaupun mereka telah dihadirkan apa yang mereka minta), pasti tidak akan mengimaninya. Kendatipun telah datang setiap bukti kebenaran, niscaya mereka tidak akan beriman sampai menyaksikan siksaan yang pedih. Oleh sebab itu, Allah berfirman tentang mereka, “Maka hendaknya dia mendatangkan kepada kita suatu mukjizat, sebagaimana rasul-rasul yang telah lalu diutus,” seperti unta Nabi Shalih, tongkat Nabi Musa, dan lain-lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 5: Seperti ucapan orang-orang yang tidur lalu mengigau, di mana ia tidak menyadari apa yang diucapkannya. Orang yang memiliki pengetahuan meskipun sedikit tentang pribadi Rasulullah shallallahu 'alaihi wa sallam dan apa yang Beliau bawa akan dapat memastikan bahwa Al Qur’an adalah ucapan yang paling agung dan paling mulia, dan bahwa ia berasal dari sisi Allah, dan bahwa seorang pun dari manusia tidak mampu mendatangkan yang semisalnya, sekalipun mereka berkumpul. Hal ini sebenarnya sudah cukup sebagai bukti kebenarannya. Mereka tidak tahu, bahwa sudah menjadi sunnatullah adalah barang siapa yang meminta bukti sesuai usulannya, lalu setelah didatangkan, namun tetap kafir, maka ia akan dibinasakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 5",
    "description": "Bahkan, mereka orang-orang kafir itu, menolak kebenaran Al-Qur'an, dengan berkata, bahwa 'Al-Qur'an itu buah mimpi-mimpi Muhammad yang kacau, atau hasil rekayasanya, atau bahkan dia bukan nabi dan rasul, melainkan hanya seorang penyair yang pandai menggubah puisi yang kacau. Jika dia ingin kita membenarkannya, cobalah dia datangkan kepada kita suatu tanda, bukti fisik yang meyakinkan, seperti halnya mukjizat rasul-rasul yang diutus terdahulu seperti unta betina nabi saleh atau mukjizat nabi musa dan isa. \" 6. Penduduk suatu negeri, seperti kaum 'ad dan samud, sebelum mereka, yakni orang-orang kafir mekah, yang telah kami binasakan, meminta mukjizat fisik kepada para nabi. Mereka itu tetap tidak beriman, padahal telah kami kirimkan bukti itu kepada mereka. Apakah mereka, kafir mekah, akan beriman jika mukjizat fisik yang diminta itu dipenuhi'."
  }
]