[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Qur’an yang diturunkan oleh Allah kepada RasulNya, Muhammad ini merupakan peringatan bagi orang yang mau mendapatkan peringatan dengannya, dan mengerjakan perintah-perintahNya dan menjauhi larangan-laranganNya, ia memiliki kebaikan yang melimpah, besar manfaatnya; maka apakah kalian mengingkarinya, padahal ia amatlah nyata dan jelas?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- ini merupakan suatu peringatan dan nasihat bagi orang yang ingin mendapatkan pelajaran darinya, memiliki banyak berkah, manfaat dan kebaikan, maka apakah kalian tetap akan mengingkarinya, tidak mengakui kandungannya serta tidak mengamalkannya?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Dan dalam al-Qur’an yang agung ini terdapat peringatan bagi orang yang mau mengingat dan kebaikan yang besar yang telah Kami turunkan kepada Muhammad, maka mengapa kalian mengingkari bahwa itu diturunkan dari Allah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَهٰذَا ذِكْرٌ مُّبَارَكٌ أَنزَلْنٰهُ ۚ (Dan Al Quran ini adalah suatu kitab (peringatan) yang mempunyai berkah yang telah Kami turunkan) Yakni al-Qur’an adalah peringatan bagi orang yang menjadikannya peringatan, nasehat bagi orang yang mengambil nasehat darinya, dan memiliki banyak kebaikan dan keberkahan. أَفَأَنتُمْ لَهُۥ مُنكِرُونَ(Maka mengapakah kamu mengingkarinya?) Ini merupakan pengingkaran atas keingkaran mereka terhadap al-Qur’an. Yakni bagaimana kalian mengingkari bahwa al-Qur’an diturunkan oleh Allah, padahal kalian mengakui Taurat diturunkan oleh-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Al-Qur’an ini merupakan pengingat, pelajaran, dan mengandung banyak kebaikan dan manfaat yang telah Kami turunkan kepada Nabi Muhammad SAW. Mengapa kalian atau bagaimana bisa kalian mengingkari bahwa turunnya Al-Qur’an itu dari Allah, wahai penduduk Mekah, sedangkan dia itu memiliki tujuan yang jelas? Istifham ini bertujuan untuk mengolok-olok."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ini} Al-Qur’an {adalah peringatan yang diberkahi} yang memiliki banyak kebaikan {yang telah Kami turunkan. Maka apakah kalian menjadi orang yang ingkar terhadapnya} orang yang menyangkal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “Dan ini,” yaitu al-Quran “adalah suatu kitab (peringatan) yang mempunyai berkah yang telah Kami turunkan.” Allah menyifatinya dengan dua sifat agung. (Pertama) sebagai pengingat, dengan itu semua tuntutan agama menjadi tidak terlupakan, seperti mengenal sifat-sifat para rasul, para wali, dan seluk-beluk tentang mereka, mengetahui hukum-hukum syariat, dalam bentuk peribadahan, muamalah dan lain sebagainya, mengetahui pula kepastian pembalasan amalan, surge dan neraka. Dengannya, (al-Quran), berbagai masalah, petunjuk-petunjuk logika, dan dalil-dalil naqli dapat diingat. Allah menamakannya sebagai dzikr (Pengingat) karena akan mengingatkan perkara-perkara yang telah Allah tanamkan pada akal-akal dan fitrah manusia berupa pembenaran terhadap berita-berita yang haq, perintah melakukan hal-hal baik, dan larangan dari perkara-perkara buruk menurut nalar manusia. (Kedua) bersifat penuh berkah. Sifat ini menuntut makna banyaknya kebaikannya dan pertumbuhan serta pertambahannya. Tidak ada sesuatu pun yang lebih besar nilai keberkahannya dari pada al-Quran ini. Sesungguhnya setiap kebaikan, kenikmatan, dan tambahan nikmat agama, duniawi ataupun ukhrawi, berasal darinya dan efek dari pengamalannya. Jika ia bersifat sebagai pemberi peringatan yang mengandung berkah, maka wajib menerimanya dengan tulus, tunduk dan penyerahan diri, serta bersyukur kepada Allah atas karunia besar ini dan mengamalkannya, menggali keberkahannya, melalui mempelajari kata-kata dan makna-maknanya. Sementara sikap menyikapinya dengan sifat-sifat yang berlawanan dengan keadaan ini, seperti berpaling darinya, mengabaikannya, mengingkarinya dan tidak mengimaninya merupakan bentuk kekufuran yang sangat besar, kebodohan dan tindakan aniaya yang sangat fatal. Oleh sebab itu, Allah mengingkari orang-orang yang mengingkari al-Quran. Allah berfirman, “Maka mengapakah kamu mengingkarinya?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 50: Dengan Al Qur’an, teringatlah semua tuntutan, seperti dapat mengenal Allah dengan nama-nama, sifat-Nya dan perbuatan-Nya, mereka dapat pula mengenal sifat-sifat para rasul, wali, dan keadaan mereka. Demikian pula, mereka dapat mengenal hukum-hukum syara’ berupa ibadah, mu’amalah, dsb. Mengenal pula hukum-hukum tentang pembalasan, surga, dan neraka. Demikian pula, dengan Al Qur’an manusia dapat mengenal berbagai masalah dan dalil-dalil yang ‘aqli (akal) maupun naqli (wahyu). Allah menamai Al Qur’an dengan dzikr, yang artinya ingat, karena ia mengingatkan apa yang Allah tanam dalam akal dan fitrah manusia berupa membenarkan berita-berita yang benar, perintah mengerjakan yang baik dan larangan mengerjakan yang buruk. Yakni banyak kebaikannya, berkembang lagi bertambah. Tidak ada sesuatu pun yang lebih besar berkahnya daripada Al Qur’an ini. Hal itu, karena setiap kebaikan dan nikmat, maka disebabkan olehnya dan pengaruh dari mengamalkannya. Oleh karena Al Qur’an merupakan peringatan yang mempunyai berkah, maka wajib diterima dan diikuti serta bersyukur kepada Allah atas nikmat ini, dijunjung, dan digali keberkahannya dengan mempelajari lafaz-lafaz dan maknanya. Adapun menyikapinya dengan berpaling atau bahkan mengingkari serta tidak beriman kepadanya, maka yang demikian termasuk kekafiran yang paling besar, kebodohan dan kezaliman yang paling besar. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Maka apakah kamu mengingkarinya?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 50",
    "description": "Bani israil, umat nabi musa dan harun, sebagian besar mengingkari taurat yang berisi pembeda, penerangan dan pelajaran bagi yang bertakwa. Dan Al-Qur'an ini bagi kamu sekalian, umat nabi Muhammad adalah suatu peringatan yang mempunyai berkah yang telah kami turunkan untuk umat akhir zaman. Maka apakah kamu mengingkarinya sebagaimana bani israil mengingkari taurat'51. Pada surah al-anbiy' ayat 48 dijelaskan bahwa Allah telah memberikan furq'n, yang membedakan hak dan batil, sebagai penerangan, dan pelajaran kepada musa dan harun. Sementara pada ayat ini, Allah menjelaskan ketokohan ibrahim, pejuang tauhid dan ayahanda para nabi dan rasul. Dan sungguh, sebelum dia, musa dan harun yang diutus menghadapi fir'aun guna membebaskan bani israil, telah kami berikan kepada ibrahim petunjuk, sejak remaja; dan kami telah mengetahui sifat, karakter, dan kegigihan dia, ibrahim, dalam menghapuskan penyem-bahan kepada patung dan berhala guna menegakkan ajaran tauhid."
  }
]