[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah memberikan Ibrahim hidayah baginya yang dia menyeru manusia untuk mengikutinya, sebelum Musa dan Harun. Dan Kami mengetahui bahwa dia pantas mendapatkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan sungguh Kami telah berikan kepada Ibrahim sejak masih kecil suatu hujah dan petunjuk untuk disampaikan kepada kaumnya dan Kami telah mengetahui hal itu. Maka Kami pun memberikannya suatu hujah yang pantas bagi dirinya -sesuai ilmu Kami- agar disampaikan kepada seluruh kaumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Sungguh Kami telah memberi hidayah kepada Ibrahim sejak dia masih kecil, dan Kami Maha Mengetahui ketika dia berkata kepada ayahnya, Azar dan kaumnya untuk mengingkari mereka: “Berhala-berhala apa ini yang senantiasa kalian sembah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَلَقَدْ ءَاتَيْنَآ إِبْرٰهِيمَ رُشْدَهُۥ (Dan sesungguhnya telah Kami anugerahkan kepada Ibrahim hidayah kebenaran) Yakni kesadaran yang sesuai dengan kedudukannya dan kedudukan para rasul sepertinya. مِن قَبْلُ (sebelumnya) Yakni sebelum Kami berikan kitab Taurat kepada Musa dan Harun. Pendapat lain mengatakan maknanya adalah Kami berikan kesadaran kepada Ibrahim sebelum ia menjadi seorang Nabi, yakni Kami berikan kepadanya taufik agar memperhatikan kejadian masuknya waktu malam lalu dia melihat bagaimana matahari, bulan, dan bintang kemudian menjadikannya dalil yang menuntunnya kepada Tuhan. وَكُنَّا بِهِۦ عٰلِمِينَ (dan adalah Kami mengetahui (keadaan)nya) Yakni mengetahui bahwa itu merupakan tempat datangnya kesararan dan petunjuk dan Ibrahim layak mendapatkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Dan sungguh Kami telah memberi Ibrahim petunjuk atau hidayah menuju kebaikan dan kebenaran agama dan dunia sebelum mendatangkan Taurat kepada Musa dan Harun. Dan Kami Mengetahui bahwa dia itu layak diberi petunjuk dan digambarkan dengan perangai yang mulia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah menganugerahkan kepada Ibrahim petunjuk} petunjuk {sebelumnya} sebelum dewasa, yaitu ketika dia masih kecil {dan Kami telah mengetahui dirinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Tatkala Allah menyebutkan kisah tentang Musa dan Muhammad serta kitab mereka berdua, maka Allah berfirman, “Dan sesungguhnya telah Kami anugerahkan kepada Ibrahim hidayah kebenaran sebelum (Musa dan Harun),” maksudnya, sebelum pendelegasian Musa dan Muhammad sebagai rasul dan (sebelum) turunnya kitab mereka berdua, maka Allah mempertontonkan kerajaan langit dan bumi kepada Ibrahim, dan menganugerahkan kesempurnaan hidayah kepadanya sehingga dia dapat menyempurnakan dirinya, serta menyeru umat manusia kepadanya, sebuah anugerah yang tidak diberikan oleh Allah kepada siapa pun dari umat manusia selain kepada Muhammad. Allah menisbatkan kesempurnaan hidayah kepada Ibarahim, karena hidayah tersebut berkait erat dengan kondisi dan ketinggian martabatnya. Kalau tidak diarahkan ke makna demikian ini, maka setiap insan Mukmin memiliki bagian hidayah sesuai dengan kadar keimanannya yang ada pada dirinya. “Dan Kami mengetahui (keadaan) nya,” maksudnya, Kami memberinya kesempurnaan hidayah, dan Kami perlakukan dia dengan istimewa sebagai rasul dan kekasih, serta Kami menjadikannya sebagai hamba pilihan di dunia dan ahirat, karena Kami mengetahui bahwa dia pantas dan patut untuk mengembannya, mengingat kkesucian jiwa dan kecerdasan akalnya. Karena itu, Allah memaparkan adu argumentasinya di hadapan kaumnya, langkah larangan beliau dari praktik syirik kepada mereka, penghancuran berhala-berhala yang dia lakukan dan pembumkaman mereka dengan hujjahnya. Allah berfirman,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 51: Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang Musa dan Muhammad shallallahu 'alaihima wa sallam serta kitab keduanya, Dia memberitahukan, bahwa sebelum diutus-Nya Musa dan Muhammad serta diturunkan kitab keduanya, Allah Subhaanahu wa Ta'aala telah memperlihatkan kepada Ibrahim tanda-tanda kerajaan-Nya di langit dan bumi (lihat Al An’aam: 75), dan memberikan petunjuk kepadanya, yang dengannya diri Ibrahim menjadi sempurna dan dia mengajak manusia kepada petunjuk itu yang tidak diberikan-Nya kepada seorang pun kecuali Nabi Muhammad shallallahu 'alaihi wa sallam, disandarkan petunjuk itu kepada-Nya karena petunjuk itu sesuai keadaan Ibrahim dan ketinggian kedudukannya. Jika tidak demikian, maka sesungguhnya setiap mukmin mendapat petunjuk sesuai iman yang ada padanya. Sebelum Ibrahim mencapa usia baligh. Yakni kelayakannya untuk memperoleh petunjuk itu karena kebersihan dirinya dan kecerdasannya. Oleh karena itu, disebutkan perdebatan Beliau dengan kaumnya, larangan Beliau terhadap perbuatan syirk, tindakannya menghancurkan patung-patung dan mengalahkan mereka dengan hujjah yang menunjukkan kelayakan dirinya memperoleh petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 51",
    "description": "Pada surah al-anbiy' ayat 48 dijelaskan bahwa Allah telah memberikan furq'n, yang membedakan hak dan batil, sebagai penerangan, dan pelajaran kepada musa dan harun. Sementara pada ayat ini, Allah menjelaskan ketokohan ibrahim, pejuang tauhid dan ayahanda para nabi dan rasul. Dan sungguh, sebelum dia, musa dan harun yang diutus menghadapi fir'aun guna membebaskan bani israil, telah kami berikan kepada ibrahim petunjuk, sejak remaja; dan kami telah mengetahui sifat, karakter, dan kegigihan dia, ibrahim, dalam menghapuskan penyem-bahan kepada patung dan berhala guna menegakkan ajaran tauhid. 52. Perjuangan nabi ibrahim dalam menegakkan ajaran tauhid dimulai sejak remaja, ketika dia berkata kepada ayahnya yang bernama azar, dan kaumnya, di kota ur, kaldea, mesopotamia timur. Wahai ayahku dan kaumku, 'patung-patung apakah ini yang kamu tekun menyembahnya, padahal patung-patung itu benda mati yang tidak bergerak dan tidak mendengar doa kamu''."
  }
]