[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika dia berkata kepada ayahnya dan kaumnya, “Patung-patung apakah ini yang kalian buat, kemudian kalian menyembahnya dan senantiasa berada di dekatnya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Tatkala beliau berkata kepada ayahnya Āzar dan kaumnya, \"Patung-patung apakah ini yang kalian buat dengan tangan kalian sendiri, lalu kalian tekun dan sungguh-sungguh beribadah menyembahnya?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. إِذْ قَالَ لِأَبِيهِ (ketika Ibrahim berkata kepada bapaknya) Bapaknya bernama Aazar. وَقَوْمِهِۦ (dan kaumnya) Yakni Namrud dan para pengikutnya. مَا هٰذِهِ التَّمَاثِيلُ (Patung-patung apakah ini) Patung adalah sesuatu yang dibuat mirip dengan suatu makhluk Allah. Ibrahim mengingkari perbuatan mereka menyembah patung-patung itu dengan ucapannya: Patung-patung apakah ini yang kalian tekun beribadat kepadanya? الَّتِىٓ أَنتُمْ لَهَا عٰكِفُونَ(yang kamu tekun beribadat kepadanya?) Yakni patung-patung apa ini yang selalu kalian sembah?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Ketika dia berkata kepada ayahnya, Azar dan kaumnya yang merupakan pengikut Namrudz: “Berhala-berhala apakah yang tetap kalian sembah ini?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia berkata kepada ayahnya dan kaumnya,“Patung-patung apakah ini} berhala-berhala yang dibuat oleh tangan-tangan mereka {yang kalian sembah dengan tekun} kalian tetap tekun menyembahnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “(Ingatlah), ketika Ibrahim berkata kepada bapaknya dan kaumnya, ‘Patung-patung apakah ini’,” yang kalian serupakan dan pahati dengan tangan-tangan kalian dalam rupa beberapa makhluk, “yang kamu tekun beribadah kepadanya.” Berdiam diri untuk melakukan ibadah kepadanya dan senantiasa berada di dekatnya. Apakah hakikat berhala-berhala itu? Apakah ia mempunyai keutamaan yang melekat padanya. Ke manakah akal sehat kalian kabur hingga kalian menghabiskan waktu-waktu kalian untuk beribadah kepadanya. Padahal, kalianlah yang membuat dan m emahatnya dengan tangan-tangan kalian. Ini salah satu bentuk keajaiban, kalian menyembah sesuatu yang kalian pahat sendiri?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 52: Yakni apa sesungguhnya patung-patung itu? Apa kelebihan dan kehebatannya sehingga pantas disembah? Dan di mana akal kamu sehingga kamu menghabiskan waktu untuk menyembahnya? Kamu yang membuatnya, sedangkan patung-patung itu lemah, tidak sanggup berbuat apa-apa, bahkan lebih lemah dari dirimu?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 52",
    "description": "Perjuangan nabi ibrahim dalam menegakkan ajaran tauhid dimulai sejak remaja, ketika dia berkata kepada ayahnya yang bernama azar, dan kaumnya, di kota ur, kaldea, mesopotamia timur. Wahai ayahku dan kaumku, 'patung-patung apakah ini yang kamu tekun menyembahnya, padahal patung-patung itu benda mati yang tidak bergerak dan tidak mendengar doa kamu''53. Mereka menjawab pertanyaan pemuda ibrahim yang logis dan masuk akal itu dengan jawaban pembelaan terhadap tradisi yang sudah mengakar, 'kami mendapati nenek moyang kami, dari generasi ke gene-rasi memproduksi dan menyembahnya. '."
  }
]