[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab, “Kami mendapati nenek moyang kami menyembahnya, dan kami menyembahnya sekedar mengikuti mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Kaumnya berkata kepadanya, \"Kami mendapati nenek moyang kami menyembahnya, maka kami pun menyembahnya dengan tujuan meneladani mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Mereka menjawab: “Kami mendapati ayah dan nenek moyang kami menyembahnya, maka kamipun mengikuti mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. قَالُوا۟ وَجَدْنَآ ءَابَآءَنَا لَهَا عٰبِدِينَ (Mereka menjawab: “Kami mendapati bapak-bapak kami menyembahnya”) Yakni kami mendapati nenek moyang kami menyembahnya, maka kami menyembahnya pula mengikuti jejak mereka. Mereka menjawabnya dengan jawaban bodoh ini sebagai pegangan bagi semua orang yang lemah, yakni berpegangan pada sekedar mengikuti nenek moyang. Begitu pula jawaban sebagian orang Islam yang mangaku dirinya sebagai orang yang berilmu, apabila ada ulama lain yang mengingkari perbuatannya yang menyelisihi al-Qur’an dan as-Sunnah mereka berkata “Ini sudah merupakan pendapat dari Imam kami” lalu mereka menolak untuk mengambil dalil yang jelas hanya demi taklid buta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Mereka berkata kepadanya: “Kami mendapati bapak-bapak Kami sebelumnya menyembahnya, lalu kami meniru mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab,“Kami mendapati nenek moyang kami menjadi para penyembahnya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Mereka menjawabnya dengan jawaban tanpa alasan kuat, sebuah jawaban orang yang lemah, yang tidak mengandung sedikit pun syubhat yang bisa dipegangi. Mereka mengatakan, “Kami mendapati bapak-bapak kami.” Beginilah mereka (orang-orang tua kami) melakukan, maka kami sekedar meneruskan budaya-budaya mereka dan mengikuti mereka dalam menyembahnya. Sudah menjadi perkara yang diketahui, bahwa perbuatan seorang manusia, selain para rasul, bukan merupakan hujjah (dasar kuat) dan tidak boleh diteladani. Terutama dalam perkara dasar-dasar agama (akidah) dan tauhid (pengesaan) Rabb semesta alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 53: Mereka menjawab tanpa ilmu dan menjawab dengan jawaban yang lemah. Yakni sehingga kami mengikuti. Padahal sudah maklum, perbuatan manusia selain rasul bukanlah hujjah dan tidak berhak diikuti terlebih dalam pokok-pokok agama. Oleh karena itu, Ibrahim menyatakan sesat semuanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 53",
    "description": "Mereka menjawab pertanyaan pemuda ibrahim yang logis dan masuk akal itu dengan jawaban pembelaan terhadap tradisi yang sudah mengakar, 'kami mendapati nenek moyang kami, dari generasi ke gene-rasi memproduksi dan menyembahnya. '54. Dia, ibrahim, menyadarkan mereka dengan berkata secara tegas dan lugas, 'sesungguhnya kamu dan nenek moyang kamu yang terus-menerus mengukir dan menyembah patung-patung itu, berada dalam kesesatan yang nyata, karena penyembahan itu tidak masuk akal dan merendahkan martabat manusia. '."
  }
]