[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, “Apakah pernyataan yang kamu bawa kepada kami ini benar dan serius, ataukah ucapanmu kepada kami itu omongan orang yang berkelakar lagi memperolok yang tidak sadar terhadap apa yang dilontarkannya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Kaumnya berkata kepadanya, \"Apakah engkau datang kepada kami dengan sikap sungguh-sungguh tatkala mengatakan apa yang engkau ucapkan itu, atau apakah engkau hanya bermain-main belaka?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Namun mereka menjawab: “Apakah yang akmu katakan itu sungguh-sungguh atau hanya gurauan orang yang bergurau?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. قَالُوٓا۟ أَجِئْتَنَا بِالْحَقِّ أَمْ أَنتَ مِنَ اللّٰعِبِينَ (Mereka menjawab: “Apakah kamu datang kepada kami dengan sungguh-sungguh ataukah kamu termasuk orang-orang yang bermain-main?”) Yakni apakah kamu sungguh-sungguh dalam perkataanmu atau kamu sedang bermain-main?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Begitulah yang dikatakan kaum Ibrahim -علي السلام- tatkala ia mengajak mereka kepada tauhid, mereka memahami bahwa agama yang haq itu tidak bercampur dengan permainan dan kebathilan; lalu bagaimana dengan sekelompok manusia yang menginginkan agama ini hidup bersatu dengan berbagai macam permainan dan kebathilan sekalipun ada sedikit kabaikan di dalamnya? { فَمَاذَا بَعْدَ ٱلْحَقِّ إِلَّا ٱلضَّلَٰلُ } \"maka tidak ada sesudah kebenaran itu, melainkan kesesatan\" [ Yunus : 32 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Mereka berkata kepadanya: “Apakah kamu sungguh-sungguh dalam ucapanmu, yaitu merupakan sesuatu yang benar-benar nyata, atau kamu hanya bersenda gurau?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Apakah kamu datang kepada kami membawa kebenaran} dengan keseriusan {atau kamu bermain-main”} main-main"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Mereka berkata,” dengan nada keheranan terhadap perkataan Ibrahim dan penuh tanda Tanya terhadap apa yang diucapkan Ibrahim, bagaimana beliau mulai membodoh-bodohkan merekka dan juga nenek moyang mereka. “Apakah kamu datang kepada kami dengan sungguh-sungguh ataukah kamu termasuk orang yang bermain-main?” maksudnya, ucapan ini yang engkau utarakan dan engkau bawakan kepada kami, apakah merupakan kebenaran yang memang ada ataukah ucapanmu kepada kami merupakan ucapan orang yang sedang bermain-main lagi memperolok kami, yang tidak sadar apa yang sedang diucapkan? Inilah yang mereka tuju. Mereka mengulang-ulang perkataan untuk mengopinikan perkataan Ibrahim sebagai ketetapan yang sudah dimaklumi bersama pada setiap orang bahwa ucapan yang disampaikan Ibrahim merupakan perkataan orang bodoh yang tidak mengerti apa yang dikatakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 55: Karena menganggap aneh perkataan Ibrahim dan menganggapnya sebagai sesuatu yang besar. Dan serius."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 55",
    "description": "Dialog ibrahim dengan kaumnya bertambah panas. Mereka pun berkata dengan mengajukan pertanyaan mendasar, wahai ibrahim, \"apa-kah engkau benar-benar datang kepada kami membawa kebenaran tentang tuhan dan ajaran kemanusiaan atau engkau hanya main-main saja''56. Menanggapi pertanyaan tersebut, dia, ibrahim, menjawab, 'sebenar-Nya tuhan kamu yang patut disembah ialah tuhan pemilik langit dan bumi, yang menjaga keseimbangan dan keteraturan keduanya. Dialah Allah yang telah menciptakannya. Dan ketahuilah bahwa aku termasuk orang yang dapat bersaksi atas itu secara rasional dan empiris bahwa Allah satu-satunya tuhan yang berhak disembah, yang mengatur langit dan bumi. '"
  }
]