[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ibrahim berkata kepada mereka, “Sesungguhnya Tuhan kalian yang aku mengajak kalian untuk menyembahNya, Dia adalah penguasa langit dan bumi yang telah menciptakannya. Dan aku termasuk orang yang bersaksi atas hal itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Ibrahim menjawab, \"Aku datang kepada kalian dengan sikap sungguh-sungguh bukan bermain-main, sebenarnya Tuhan kalian adalah Tuhan langit dan bumi yang yang telah menciptakannya pertama kali, dan aku termasuk saksi bahwa Dia lah Tuhan kalian dan Tuhan langit dan bumi, sedangkan patung-patung yang kalian sembah itu tidak memiliki andil sama sekali dalam penciptaan itu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Ibrahim menjawab mereka dengan tegas: “Tuhan kalian yang berhak disembah adalah Tuhan yang telah menciptakan tujuh langit dan bumi, dan aku bersaksi dengan bukti-bukti ini atas keesaan Allah.” Kemudian Ibrahim bersumpah dengan nama Allah bahwa dia akan membuat tipu daya terhadap berhala-berhala mereka dengan menghancurkannya ketika mereka telah pergi darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. الَّذِى فَطَرَهُنَّ (yang telah menciptakannya) Yakni yang menciptakan dan mengadakannya. وَأَنَا۠ عَلَىٰ ذٰلِكُم(dan aku atas hal itu) Yakni atas apa yang aku sebutkan pada kalian bahwa Tuhan kalian sesungguhnya adalah Tuhan yang menciptakan langit dan bumi semata. مِّنَ الشّٰهِدِينَ(termasuk orang-orang yang dapat memberikan bukti) Yakni yang memiliki pengetahuan dan bukti tentang itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Ibrahim berkata: “Sesungguhnya satu-satunya Tuhan kalian yang layak disembah adalah Dzat yang Merajai langit dan bumi, Dzat yang menciptakan keduanya tanpa ada contoh sebelumnya. Dan aku termasuk orang yang mengetahui demikian itu, menyaksikan kebenarannya dan mendatangkan bukti-buktinya,” Asy-Syahid adalah orang yang memastikan sesuatu dan memberikan hujjah terhadap hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menjawab,“Sebenarnya, Tuhan kalian adalah Tuhan langit dan bumi, Dzat yang telah menciptakannya} menciptakannya {dan aku adalah salah satu saksi atas itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Maka Ibrahim menyanggahnya dengan tajam, sembari memaparkan sisi kebodohan dan kedangkalan akal mereka. Beliau berkata, “Sesungguhnya Rabb kamu ialah Rabb langit dan bumi yang telah menciptakannya; dan aku termasuk orang-orang yang dapat memberikan bukti atas yang demikian itu,” beliau memadukan antara argumentasi logis dan argumentasi wahyu terhadap mereka. Mengenai argumentasi logis dan logika yang beliau kemukakan, maka sesungguhnya seetiap manusia mengetahui, hinga termmasuk juga orang-orang yang didebat oleh Ibrahim bahwa Allah-lah Dzat Pencipta bagi seluruh makhuk;dari kalangan bani Adam, malaikat, jin, hewan-hewan, langit dan bumi, Dzat yang mengatur mereka semua dengan beragam cara pengaturan. Sehingga setiap makhluk itu merupakan ciptaan, berada di bawah aturan dan ketetapan (Allah). Termasuk juga, segenap makhluk yang disembah selain Allah. Apakah selayaknya, orang yang mempunyai daya pipkir dan analisa, menyembah satu makhluk yang berada di bawah pengaturan (Allah), tidak mempunyai kemampuan memberikan manfaat atau mendatangkan bahaya, (tidak memiliki kemampuan) mematikan, menghidupkan, membangkitkan (dari kematian), dengan meninggalkan peribadahan kepada Allah, Sang Pencipta, Pemberi rizki dan Pengatur alam semesta ini? Adapun tentang dalil sam’I (dari wahyu), yaitu yang berasal dari para rasul, sesungguhnya risalah yang merekka bawa merupakan perkara yang ma’shum (terpelihara), tidak salah dan tidak mengabarkan perkara yang menyalahi kebenaran. Termasuk jenis ini, persaksian salah seorang dari kalangan rasul terhadap perkara tersebut. Oleh karenanya, Ibrahim berkata, “Dan aku atas yang demikian itu,” maksudnya hanya Allah—lah yang berhak disembah, dan peribadahan kepada selainNya adalah tindakan yang batil “termasuk orang-orang yang dapat memberi bukti.” Setelah persaksian dari Allah, persaksian manakah yang lebih tinggi daripada persaksian para utusan Allah, terlebih lagi persaksian para ulul ‘azmi dari kalangan para rasul, apalagi dari Khalil ar-Rahman (kekasih ar-Rahman)?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 56: Yang berhak untuk disembah. Tanpa contoh sebelumnya. Dalam perkataan ini, Beliau berdalih terhadap keberhakan Allah untuk diibadahi dengan rububiyyah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 56",
    "description": "Menanggapi pertanyaan tersebut, dia, ibrahim, menjawab, 'sebenar-Nya tuhan kamu yang patut disembah ialah tuhan pemilik langit dan bumi, yang menjaga keseimbangan dan keteraturan keduanya. Dialah Allah yang telah menciptakannya. Dan ketahuilah bahwa aku termasuk orang yang dapat bersaksi atas itu secara rasional dan empiris bahwa Allah satu-satunya tuhan yang berhak disembah, yang mengatur langit dan bumi. ' 57. Nabi ibrahim tidak hanya berkata lugas kepada ayah dan kaumnya yang terus menerus menyembah patung-patung itu dengan menyatakan, 'sesungguhnya kamu dan nenek moyang kamu berada dalam kesesatan yang nyata, ' tetapi juga bersumpah dalam hatinya bahwa beliau akan menghancurkan berhala itu, setelah mereka me-ninggalkan tempat itu. 'dan demi Allah, sungguh, aku akan melakukan tipu daya, tindakan yang membongkar kepalsuan, terhadap berhala-berhalamu dengan menghancurkannya guna menyadarkan mereka bahwa penyembahan patung-patung itu perbuatan keliru, setelah kamu pergi meninggalkannya. \"."
  }
]