[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "“Dan demi Allah, aku akan benar-benar melancarkan makar terhadap patung-patung kalian dan menghancurkannya setelah kalian berlalu meninggalkannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Lalu Ibrahim pun berkata kepada dirinya sendiri tanpa didengar oleh kaumnya, \"Demi Allah, aku akan mengatur tipu daya terhadap patung-patung kalian setelah kalian pergi meninggalkannya untuk melakukan pesta hari raya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَتَاللهِ لَأَكِيدَنَّ أَصْنٰمَكُم (Demi Allah, sesungguhnya aku akan melakukan tipu daya terhadap berhala-berhalamu) Nabi Ibrahim bersumpah kepada mereka bahwa setelah dia menyampaikan hujjah dengan lisannya dia kemudian akan melawan kemungkaran dengan perbuatannya dengan penuh kepercayaan kepada Allah dan keinginan untuk membela agamanya. Dia mengucapkan sumpah ini dalam dirinya saja. Namun pendapat lain mengatakan bahwa dia menyampaikan sumpahnya pada salah seorang dari mereka. بَعْدَ أَن تُوَلُّوا۟ مُدْبِرِينَ (sesudah kamu pergi meninggalkannya) Menuju perayaan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Dan Demi Allah, Aku akan benar-benar meruntuhkan berhala-berhala kalian setelah kalian meninggalkannya dan kembali dari peribadatan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Demi Allah, sungguh aku akan melakukan tipu daya terhadap berhala-berhala kalian} sungguh aku akan membuat tipu muslihat terhadap berhala-berhala kalian dan memberikan hal yang berbahaya terhadapnya {setelah kalian pergi meninggalkannya”} kalian pergi meninggalkannya untuk mereyakan hari raya kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Setelah Ibrahim menjelaskan bahwa patung-patung mereka tidak mempunyai kewenangan pengaturan alam semesta sedikit pun, maka beliau ingin memperlihatkan secara nyata kepada mereka tentang kelemahan dan ketidakberdayaan patung-patung itu. Dan untuk memperdayai mereka dengan cara yang akan membuat mereka mengeluarkan pengakuan tentang itu, maka beliau berkata, “Demi Allah, sesungguhnya aku akan melakukan tipu daya terhadap berhala-berhala kalian,” maksudnya saya akan memecahkannya unttuk memperdayai mereka “sesudah kamu pergi meninggalkannya,” untuk merayakan salah satu hari raya mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 57: Setelah Nabi Ibrahim ‘alaihis salam menerangkan bahwa patung-patung yang mereka sembah tidak mampu mengatur dan menguasai apa-apa, maka Beliau ingin memperlihatkan kepada mereka dengan tindakan yang menunjukkan lemahnya patung-patung itu dan tidak dapat membela dirinya sendiri. Ucapan ini menurut sebagian mufassir diucapkan Nabi Ibrahim ‘alaihis salam.dalam hatinya saja. Maksudnya, Nabi Ibrahim ‘alaihis salam akan menjalankan tipu dayanya untuk menghancurkan berhala-berhala mereka, setelah mereka meninggalkan tempat-tempat berhala itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 57",
    "description": "Nabi ibrahim tidak hanya berkata lugas kepada ayah dan kaumnya yang terus menerus menyembah patung-patung itu dengan menyatakan, 'sesungguhnya kamu dan nenek moyang kamu berada dalam kesesatan yang nyata, ' tetapi juga bersumpah dalam hatinya bahwa beliau akan menghancurkan berhala itu, setelah mereka me-ninggalkan tempat itu. 'dan demi Allah, sungguh, aku akan melakukan tipu daya, tindakan yang membongkar kepalsuan, terhadap berhala-berhalamu dengan menghancurkannya guna menyadarkan mereka bahwa penyembahan patung-patung itu perbuatan keliru, setelah kamu pergi meninggalkannya. \"58. Sumpah ibrahim tidak hanya dalam hati, tetapi benar-benar dilaksanakannya. Maka dia menghancurkan berhala-berhala itu berkeping-keping hingga patung-patung itu tidak berbentuk lagi, kecuali yang terbesar, induknya, agar mereka kembali mempertanyakan argumentasi me-reka mempertahankan penyembahan benda-benda mati itu kepadanya, yakni patung-patung itu."
  }
]