[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Ibrahim menghancurkan patung-patung dan menjadikannya pecahan-pecahan kecil, dan membiarkan patung yang terbesar, supaya kaumnya mendatangi dirinya dan bertanya kepadanya, lalu dia akan menjelaskan tentang kelemahan dan kesesatan mereka sehingga hujjah menjadi tegak terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Maka Ibrahim menghancurkan patung-patung itu hingga menjadi kepingan-kepingan kecil, dan membiarkan patung yang paling besar dengan harapan agar mereka kembali untuk bertanya padanya tentang orang yang menghancurkan semua patung-patung itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Setelah mereka meninggalkan berhala-berhala itu, Ibrahim mendatanginya untuk menghancurkan leburkannya, dan dia menyisakan berhala yang paling besar agar mereka dapat bertanya kepadanya siapa yang telah menghancurkan berhala-berhala itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. فَجَعَلَهُمْ جُذٰذًا (Maka Ibrahim membuat berhala-berhala itu hancur berpotong-potong) Dengan memecah berhala-berhala itu. إِلَّا كَبِيرًا لَّهُمْ(kecuali yang terbesar dari patung-patung yang lain) Yakni patung terbesar. لَعَلَّهُمْ إِلَيْهِ يَرْجِعُونَ(agar mereka kembali (untuk bertanya) kepadanya) Yakni agar mereka menuju patung terbesar itu untuk menanyainya tentang patung-patung yang telah hancur; dan jika mereka telah melakukan itu dan tidak mendapatkan jawaban maka ketika itu mereka akan mengetahui bahwa patung itu tidak dapat mendatangkan manfaat bagi mereka dan tidak dapat menolak mudharat serta tidak mengetahui kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Lalu dia (Ibrahim) menjadikan berhala-berhala itu potongan yang besar setelah mereka (penyembah berhala) pergi untuk menunaikan hari raya dengan menghancurkannya kecuali berhala besar, supaya mereka kembali mendatangi berhala besar ini lalu bertanya kepadanya tentang orang yang merusak (berhala-berhala lain). Dan jika dia tidak menjawabi mereka, maka mereka akan mengetahui bahwa berhala-berhala itu tidak memberikan kemahdharatan dan manfaat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia menjadikan mereka hancur berkeping-keping} hancur menjadi potongan-potongan kecil {kecuali yang terbesar milik mereka agar mereka} agar para penyembah mereka {kembali kepadanya} kembali kepada patung yang besar, dan bertanya kepadanya kerusakan yang dia lakukan, lalu dia menjelaskan kepada mereka ketidak berdayaannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Ketika orang-orang meninggalkannya, Ibrahim berjalan dengan sembunyi-sembunyi ke tempat patung-patung itu. “Maka Ibrahim membuat berhala-berhala itu hancur terpotong-potong,” yaitu pecahan-pecahan dan potongan-potongan. Patung-patung itu berada dalam sebuah rumah. Beliau merusaknya secara keseluruhan “kecuali yang terbesar,” kecuali patung yang paling besar untuk sebuah tujuan yang akan beliau jelaskan. Renungkanlah bentuk pengecualian yang mengagumkan ini. Sesungguhnya segala sesuatu yang dimurkai di sisi Allah, tidak disematkan ungkapan-ungkapan pengagungan kepadanya melainkan dengan cara menisbatkannya kepada orang-orang yang merasa memilikinya. Sebagaimana yang dikerjakan oleh Nabi Muhammad ketika menulis surat kepada para raja musyrikin. Beliau berkata, Kepada Pembesar Persia… Kepada Pembesar Romawi… dan lain-lain. Beliau tidak mengatakan, Kepada Orang yang Agung! Di sini Allah berfirman, “kecuali yang terbesar dari mereka,” tidak berfirman (yang terbesar dari patung-patung mereka). Dengan ini, sepatutnya di perhatikan dan berhati-hati dari sikap mengagungkan sesuatu yang telah Allah hinakan kecuali dengan menisbatkannya kepada orang-orang yang mengagungkannya. “agar mereka kembali (untuk) bertanya kepadanya,” maksudnya Ibrahin membiarkan patung besar tidak dipecahkan agar mereka nanti merujuk kepada Ibrahim dan meminta pemaparan hujjahnya. Dan mereka akan menghadap patung itu, tidak berpaling darinya. Karena itu, beliau berkata di akhir ucapannya “maka mereka telah kembali kepada kesadaran mereka.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 58: Ketika kaumnya pergi ke tempat perkumpulan mereka di hari raya, Ibrahim diam-diam pergi mendatangi oatung-patung yang mereka sembah, lalu Beliau menghancurkannya dengan kapak. Nabi Ibrahim ‘alaihis salam tidak menghancurkan patung yang paling besarnya karena ada maksud yang diinginkannya, yaitu agar mereka kembali (bertanya) kepada patung besar mereka itu sehingga mereka mengetahui bahwa patung itu tidak bisa memberikan jawaban apa-apa terhadap mereka. Syaikh As Sa’diy berkata, “Perhatikanlah kehati-hatian yang mengagumkan ini, semua yang dibenci Allah (seperti patung, dsb.) tidak digunakan lafaz-lafaz agung (seakan-akan ia agung dan besar) selain disebutkan pula idhafat (penyandarannya) bagi orang-orangnya (tertentu), sebagaimana Nabi shallallahu 'alaihi wa sallam ketika menulis surat kepada raja-raja negara yang musyrik, Beliau mengatakan, “Kepada Pembesar Persia”, “Kepada Pembesar Romawi”, dsb, dan tidak mengatakan, “Kepada Pembesar” (tanpa disandarkan). Di sini Alah Subhaanahu wa Ta'aala juga berfirman, “kecuali yang terbesar bagi mereka.”. Oleh karena itu, hal ini perlu diingat dan agar berhati-hati tidak mengagungkan sesuatu yang dianggap hina oleh Allah kecuali jika disandarkan kepada orang-orang yang mengagungkannya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 58",
    "description": "Sumpah ibrahim tidak hanya dalam hati, tetapi benar-benar dilaksanakannya. Maka dia menghancurkan berhala-berhala itu berkeping-keping hingga patung-patung itu tidak berbentuk lagi, kecuali yang terbesar, induknya, agar mereka kembali mempertanyakan argumentasi me-reka mempertahankan penyembahan benda-benda mati itu kepadanya, yakni patung-patung itu. 59. Melihat patung-patung mereka hancur berkeping-keping, maka mereka pun berkata dengan mengajukan pertanyaan, 'siapakah yang berani melakukan penghancuran terhadap tuhan-tuhan kami ini' sungguh, dia termasuk orang yang zalim, karena telah menghancurkan simbol kesucian agama. '."
  }
]