[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak menjadi beriman suatu penduduk negeri sebelum orang-orang kafir Makkah, setelah penduduknya meminta di datangkan mukjizat-mukjizat dari para rasul mereka dan terealisasikan. Bahkan mereka mendustakan, maka Kami membinasakan mereka. Apakah orang-orang kafir Makkah akan beriman, bila mukjizat-mukjizat yang mereka minta itu terpenuhi? Sekali-kali tidak. Mereka tidak akan beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Penduduk suatu negeri yang hidup sebelum mereka, yang meminta berbagai mukjizat untuk diturunkan kepada mereka, sama sekali tidaklah beriman tatkala mukjizat-mukjizat itu diturunkan sesuai usulan mereka, bahkan mereka mendustakannya, sehingga Kami pun membinasakan mereka. Lalu apakah mereka sendiri akan beriman bila mukjizat-mukjizat itu diturunkan?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. مَآ ءَامَنَتْ قَبْلَهُم مِّن قَرْيَةٍ أَهْلَكْنٰهَآ ۖ (Tidak ada (penduduk) suatu negeripun yang beriman yang Kami telah membinasakannya sebeIum mereka) Dalam ayat ini dijelaskan bahwa sudah menjadi sunnatullah pada umat-umat terdahulu bahwa jika orang-orang yang mengusulkan sebuah mukjizat itu benar-benar didatangkan mukjizat sebagaimana yang mereka usulkan, kemudian mereka tidak juga beriman maka pasti akan turun kepada mereka azab yang membinasakan mereka semua. Lalu untuk apa Kami mendatangkan apa yang mereka usulkan? أَفَهُمْ يُؤْمِنُونَ(maka apakah mereka akan beriman?) Jika umat-umat yang telah dibinasakan itu tidak juga beriman saat didatangkan mukjizat yang mereka usulkan, maka bagaimana mereka (umat Muhammad) akan beriman jika didatangkan mukjizat yang mereka usulkan? Seakan-akan Allah mengisyaratkan dalam ayat ini pada rahmat-Nya untuk umat ini bahwa Allah tidak ingin mengazabnya sampai benar-benar musnah; oleh sebab itu Allah tidak mendatangkan mukjizat-mukjizat yang mereka usulkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Tidak ada penduduk negeri sebelum penduduk Mekah yang Kami binasakan kecuali akibat mendustakan ayat-ayat (mukjizat) yang mereka minta, apakah mereka akan beriman jika Aku mendatangkan ayat-ayat itu? Maksudnya bahwa umat yang telah dibinasakan itu tetap tidak beriman setelah menerima ayat yang mereka minta, bagaimana mereka akan beriman jika Kami mendatangkan apa yang mereka minta? Ayat ini diturunkan saat penduduk Mekah meminta Nabi SAW supaya mengubah untuk mereka bukit Shafa menjadi emas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada satu pun (penduduk) negeri sebelum mereka} sebelum orang-orang musyrik Mekkah {yang telah Kami binasakan itu beriman, Apakah mereka akan beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Allah berfirman unttuk menjawabnya, “Tidak ada (penduduk) suatu negeri pun sebelum mereka yang beriman yang mana Kami telah membinasakannya (disebabkan pendustaan mukjizat),” maksudnya (tidak beriman) dengan bukti-bukti yang mereka usulkan sendiri. Sesungguhnya ketetapan Allah menuntut bahwa orang yang meminta bukti kebenaran (dari Nabi), kemudian telah didatangkan, tetapi dia tetap tidak beriman, niscaya akan disegerakan siksaan baginya oleh Allah. Orang-orang generasi sebelumnya, mereka tidak beriman (meski sudah dibawakan kepada mereka bukti-bukti kebenaran). Apakah mungkin mereka akan mengimaninya? Faktor apakah yang mengistimewakan merekka ketimbang generasi sebelumnya? Apakah sisi kebaikan yang ada pada mereka yang akan mengantarkan mereka kepada keimanan saat kemunculan tanda-tanda kebenaran itu? Pertanyaan ini bermakna penafian (peniadaan). Pengertiannya, hal tersebut tidak mungkin terjadi pada mereka selama-lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 6: Maksudnya adalah umat-umat yang dahulu telah meminta kepada rasul-rasulnya mukjizat sesuai usulan mereka dan Allah telah mendatangkan mukjizat itu, namun mereka tetap tidak juga beriman, lalu Allah menghancurkan mereka. Orang-orang musyrik itu jpun sama, kalau diberi mukjizat yang mereka minta itu, lalu mereka tidak beriman, maka Allah akan menyegerakan azab untuknya. Yakni apakah mereka akan beriman kepada rasul dan apa yang dibawanya jika bukti itu ditunjukkan? Pertanyaan ini maksudnya adalah nafyu (peniadaan), yakni mereka tentu tidak akan beriman juga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 6",
    "description": "Penduduk suatu negeri, seperti kaum 'ad dan samud, sebelum mereka, yakni orang-orang kafir mekah, yang telah kami binasakan, meminta mukjizat fisik kepada para nabi. Mereka itu tetap tidak beriman, padahal telah kami kirimkan bukti itu kepada mereka. Apakah mereka, kafir mekah, akan beriman jika mukjizat fisik yang diminta itu dipenuhi' 7. Dan kami, wahai Muhammad, tidak mengutus para rasul sebelum engkau, melainkan beberapa orang laki-laki dari kalangan manusia yang kami beri wahyu kepada mereka. Kami tidak mengutus para malaikat untuk menjadi rasul bagi manusia. Maka tanyakanlah, wahai kaum kafir mekah, kepada orang yang berilmu tentang kitab Allah yang diturunkan sebelum Al-Qur'an, jika kamu tidak mengetahui persoalan ini."
  }
]