[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang mendengar Ibrahim bersumpah akan melancarkan makar terhadap patung-patung mereka berkata, “Kami telah mendengar seorang pemuda menyebut-nyebut patung-patung itu dengan komentar buruk dia itu bernama ibrahim.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Sebagian mereka berkata, \"Kami mendengar ada seorang pemuda yang suka mencela dan menghina patung-patung ini, namanya Ibrahim, mungkin saja dialah orang yang menghancurkannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Sebagian mereka berkata: “Kami mendengar seorang pemuda yang menghina tuhan-tuhan kita, namanya adalah Ibrahim.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. قَالُوا۟ سَمِعْنَا فَتًى (Mereka berkata: “Kami dengar ada seorang pemuda) Sebagian mereka mengatakan ini sebagai jawaban bagi orang-orang yang bertanya tadi. يَذْكُرُهُمْ (yang mencela berhala-berhala ini) Yang mengolok berhala-berhala ini. يُقَالُ لَهُۥٓ إِبْرٰهِيمُ (yang bernama Ibrahim”) Yakni namanya adalah Ibrahim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Sebagian mereka kepada yang lainnya: “Kami dengar ada seorang pemuda yang menyalahkan dan mengutuk berhala-berhala itu. Namanya adalah Ibrahim”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} mereka berkata satu sama lain {“Kami mendengar seorang pemuda yang mencela mereka} mencela dan mengutuk mereka {Dia dipanggil Ibrahim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “Mereka berkata, “Kami dengar ada pemuda yang mencela berhala-berhala ini,” maksudnya, pemuda yang memaki dan mencela mereka. Orang yang semacam ini perilakunya, pastilah dia pelaku yang menghancurkannya. Atau sebagian dari mereka mendengar bahwa tipu daya terhadap patung-patung itu. “Yang bernama Ibrahim.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 60: Mungkin di antara mereka ada yang mendengar perkataan Ibrahim, bahwa Beliau akan melakukan tipu daya terhadapnya, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 60",
    "description": "Tindakan ibrahim menghancurkan patung-patung itu dilihat dan didengar oleh mereka. Oleh karena itu, di antara mereka ada yang berkata, 'kami mendengar dari beberapa sumber yang meyakinkan, ada seorang pemuda nekat yang mencela dan menghancurkan berhala-berhala ini, namanya ibrahim. '61. Mendengar laporan masyarakat ini, pemerintah babilonia bersikap tegas. Mereka berkata dan memerintahkan kepada penegak hukum, 'kalau demikian, bawalah dia, pemuda nekat yang bertindak subversif ini ke pusat kota dengan diperlihatkan kepada orang banyak, agar mereka melihat wajahnya dan menyaksikan hukuman yang akan dijatuhkan kepadanya. '."
  }
]