[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka para pemuka mereka berkata, “Bawalah Ibrahim kemari dengan cara yang dapat dilihat oleh khalayak manusia agar mereka menyaksikan pengakuan atas ucapannya supaya menjadi bukti atas dirinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Pemuka-pemuka kaumnya berkata, \"Kalau begitu, datangkanlah Ibrahim dihadapan orang banyak, agar mereka bisa menyaksikan pengakuannya terhadap perbuatannya ini, sehingga pengakuannya tersebut menjadi dalih bagi kalian untuk menghukum dirinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61-62. Maka pemimpin orang-orang musyrik itu berkata: “Bawalah Ibrahim ke hadapan orang-orang banyak agar mereka menyaksikannya dan menjadikannya sebagai pelajaran.” Maka mereka mendatangkannya dan menanyainya: “Hai Ibrahim, apakah kamu yang menghancurkan tuhan-tuhan kami?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. قَالُوا۟ فَأْتُوا۟ بِهِۦ عَلَىٰٓ أَعْيُنِ النَّاسِ (Mereka berkata: “(Kalau demikian) bawalah dia dengan cara yang dapat dilihat orang banyak) Agar ini menjadi alasan bagi mereka untuk dapat memperlakukan Ibrahim sesuai apa yang mereka kehendaki. لَعَلَّهُمْ يَشْهَدُونَ (agar mereka menyaksikan) Agar mereka datang menyaksikan penyiksaan terhadap Ibrahim. Atau agar mereka menjadi saksi atas Ibrahim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Mereka berdiskusi: “Datangkanlah dia di hadapan semua orang, supaya mereka bisa bersaksi terhadap apa yang dia kerjakan dan memberikan hukuman untuknya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Bawalah dia dengan diperlihatkan kepada orang banyak} tampak di penglihatan manusia {agar mereka menyaksikannya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Tatkala mereka telah memastikan pekakunya adalah Ibrahim, “mereka berkata, ‘(Kalau demikian), bawalah dia’,” yaitu Ibrahim “dengan cara yang dapat dilihat orang banyak,” maksudnya di hadapan mata dan pendengaran mereka “agar mereka menyaksikan,” maksudnya menghadiri hukuman yang ditimpakan kepada orang yang menghancurkan tuuhan-tuhan mereka. Inilah yang diinginkan dan dikehendaki Ibrahim, yaitu hasrat menjelaskan kebenaran dilakukan di hadapan orang banyak. Agar mereka dapat menyaksikan kebenaran dan terbantahkanlah alasan-alasan mereka. Sebagaimana dikatakan oleh Musa ketika mengikat perjanjian untuk bertemu Fir’aun. \"Waktu untuk pertemuan (kami dengan) kamu itu ialah di hari raya dan hendaklah dikumpulkan manusia pada waktu matahari sepenggalahan naik\". (THaha:59)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 61: Yakni bahwa Ibrahimlah pelakunya. Inilah yang diinginkan Ibrahim, yaitu dapat menerangkan yang hak dan menegakkan hujjah di hadapan banyak manusia. Hal ini seperti yang diinginkan Musa ketika mengadakan perjanjian dengan Fir’aun untuk bertemu, Beliau berkata, “Waktu untuk pertemuan (kami dengan) kamu itu ialah di hari raya dan hendaklah dikumpulkan manusia pada waktu duha.” (Terj. Thaha: 59)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 61",
    "description": "Mendengar laporan masyarakat ini, pemerintah babilonia bersikap tegas. Mereka berkata dan memerintahkan kepada penegak hukum, 'kalau demikian, bawalah dia, pemuda nekat yang bertindak subversif ini ke pusat kota dengan diperlihatkan kepada orang banyak, agar mereka melihat wajahnya dan menyaksikan hukuman yang akan dijatuhkan kepadanya. '62. Dalam pengadilan terbuka, penegak hukum mengajukan pertanyaan-pertanyaan kepada ibrahim. Mereka bertanya, 'apakah engkau, wahai anak muda, yang melakukan penghancuran ini terhadap tuhan-tuhan kami, wahai ibrahim''."
  }
]