[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Ibrahim dihadapkan, dan mereka bertanya kepadanya dengan penuh pengingkaran, “Apakah kamu yang menghancurkan tuhan-tuhan kami?” maksud mereka, patung-patung mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Mereka pun mendatangkan Ibrahim dihadapan orang banyak dan bertanya kepadanya, \"Apakah engkau yang melakukan perbuatan bejat ini terhadap patung-patung sesembahan kami wahai Ibrahim?\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Setelah mendatangkannya, mereka berkata: “Apakah kamu yang telah menghancurkan tuhan-tuhan kami, wahai Ibrahim?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah kamu yang melakukan ini terhadap tuhan-tuhan kami, wahai Ibrahim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Ketika orang-orang telah hadir dan Ibrahim dihadapkan, mereka berkata kepadanya, “Apakah kamu yang melakukan perbuatan ini,” yaitu penghancuran “terhadap tuhan-tuhan kami wahai Ibrahim,” ini merupakan bentuk Tanya taqriri (penetapan pelaku). Maksudnya, apa yang membuatmu nekat melakukannya? Dan apa yang memaksamu lancang mengerjakannya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 62: Ketika Ibrahim telah dihadapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 62",
    "description": "Dalam pengadilan terbuka, penegak hukum mengajukan pertanyaan-pertanyaan kepada ibrahim. Mereka bertanya, 'apakah engkau, wahai anak muda, yang melakukan penghancuran ini terhadap tuhan-tuhan kami, wahai ibrahim''63. Ibrahim menjawab dengan jawaban yang mengejutkan untuk memberi pelajaran kepada mereka. Beliau berpura-pura tidak mengaku dirinya yang merusak patung-patung itu. Dia menjawab, 'sebenarnya patung besar itu yang melakukannya, maka tanyakanlah kepada mereka, jika mereka dapat berbicara. ' melalui jawaban ini pemuda ibrahim menyadarkan mereka bahwa patung itu tidak patut disembah."
  }
]