[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka terwujudlah apa yang dikehendaki Ibrahim untuk menampakkan kebodohan mereka dihadapan mereka. Dia menjawab dengan pernyataan yang menerangkan kesalahan mereka dan menyindir kedunguan mereka, “Justru yang menghancurkannya adalah patung paling besar ini. Maka tanyalah tuhan-tuhan palsu kalian tentang itu, bila memang bisa berbicara atau merespon jawaban.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Ibrahim menjawab -dengan tujuan melemahkan hujah mereka dan menampakkan kelemahan patung-patung tersebut di hadapan orang banyak-, \"Saya tidaklah melakukannya, tapi patung besar itulah yang melakukannya. Maka tanyakanlah kepada patung-patung itu bila mereka dapat berbicara.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Dia menjawab dengan hujjah yang kuat: “Berhala yang besar itulah yang menghancurkannya, maka tanyakanlah kepada mereka, mengapa mereka diperlakukan seperti itu jika mereka dapat berbicara?!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. قَالَ بَلْ فَعَلَهُۥ كَبِيرُهُمْ هٰذَا (Ibrahim menjawab: “Sebenarnya patung yang besar itulah yang melakukannya) Sambil menunjuk patung yang masih tersisa tidak dihancurkan. فَسْـَٔلُوهُمْ إِن كَانُوا۟ يَنطِقُونَ(maka tanyakanlah kepada berhala itu, jika mereka dapat berbicara) Yakni jika mereka mampu berbicara dan dapat memahami ucapan yang ditujukan padanya, sebab jika mereka menjawab bahwa patung itu tidak dapat berbicara maka Ibrahim akan mengatakan kepada mereka “lalu untuk apa kalian menyembah sesuatu yang tidak mampu berbicara?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Dengan menyindir, Ibrahim berkata: “Sesungguhnya yang menghancurkan mereka adalah berhala besar ini (yaitu berhala yang tidak dihancurkan olehnya). Tanyailah dia, kenapa dia melakukan hal itu kepada mereka, jika mereka bisa berbicara?” Maksudnya adalah untuk memberi pengertian kepada mereka bahwa tidak ada manfaatnya menyembah berhala-berhala yang tidak mampu berbicara. Diriwayatkan oleh Abu Dawud dan Tirmidzi dari Abu Hurairah tentang hadits shahih yaitu bahwa Ibrahim tidak pernah berbohong kecuali dalam 3 hal dan semua itu berada di jalan Allah, yaitu pertama, ucapannya “Sesungguhnya aku sakit” padahal dia tidak sakit, kedua, ucapannya kepada Sarah “Saudariku” dan ketiga ucapannya “Sesungguhnya yang melakukan itu adalah berhala besar ini”. Dan semua itu merupakan cara yang diperbolehkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Ibrahim menjawab {“Sebenarnya yang besar ini yang melakukannya. Bertanyalah kepada mereka jika mereka dapat berbicara”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Ibrahim menjawabnya dengan disaksikan orang-orang, “Sebenarnya patung besar itulah yang melakukannya,” maksudnya, dialah yang menghancurkannya, lantaran murka kepadanya ketika masih ada sesembahan (kecil)yang disembah selainnya. Ia ingin agar ibadah kalian khusus untuk patung kalian yang paling besar. Perkataan ini muncul dari Ibrahim. Tujuannya, untutk memojokkan lawan bicara ke sesuatu yang diinginkan dan untuk menegakkan hujjah di hadapannya. Oleh karena itu, dia berkata, “Maka tanyakanlah kepada berhala itu, dia berkata, “Maka tanyakanlah kepada berhala itu, jika mereka dapat berbicara,” yang beliau maksud ialah patung-patung yang sudah berkeping-keping. Tanyalah mereka, kenapa dipecahkan berkeping-keping? Dan kepada patung yang tidak hancur, tanyakanlah kenapa ia menghancurkannya? Bila mampu bicara, pasti akan menjawab pertanyaan kalian. Namun, saya dan kalian serta setiap orang mengetahui bahwa mereka itu tidak dapat berbicara, tidak pula dapat mendatangkan malapetaka. Bahkan tidak berkutik untuk menolong dirinya sendiri dari orang yang menimpakan gangguan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 63: Yakni patung yang dirusak dan patung yang tidak dirusak tentang siapa yang melakukannya. Dalam perkataan ini, Ibrahim menyindir mereka dengan maksud menerangkan, bahwa patung itu tidak bisa berbuat apa-apa, sehingga tidak pantas disembah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 63",
    "description": "Ibrahim menjawab dengan jawaban yang mengejutkan untuk memberi pelajaran kepada mereka. Beliau berpura-pura tidak mengaku dirinya yang merusak patung-patung itu. Dia menjawab, 'sebenarnya patung besar itu yang melakukannya, maka tanyakanlah kepada mereka, jika mereka dapat berbicara. ' melalui jawaban ini pemuda ibrahim menyadarkan mereka bahwa patung itu tidak patut disembah. 64. Jawaban ibrahim menyadarkan mereka. Maka mereka, setelah mendengar jawaban tersebut, kembali kepada kesadaran mereka yang jernih sesuai akal sehat dan nurani bahwa patung-patung itu tidak layak di-sembah. Dan pemimpin mereka pun berkata, 'sesungguhnya kamu sekalianlah yang menzalimi diri sendiri, terus-menerus menyembah patung yang tidak bisa bicara, tidak bisa membela diri, apalagi menyelamatkan manusia. '."
  }
]