[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka merekapun terbungkam dan tampak jelas bagi mereka kesesatan yang ada pada mereka, bagaimana bisa mereka menyembahnya, sedangkan patung-patung itu tak kuasa menolak apapun dari duri sendiri atau mengabulkan permintaan orang yang meminta kepadanya? Mereka pun mengaku diri mereka telah berbuat kezhaliman dan syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Kemudian mereka kembali kepada kesadaran mereka dan berpikir, lalu jelaslah bagi mereka bahwa patung-patung mereka tersebut tidak dapat menolak mudarat, dan tidak pula mendatangkan manfaat, maka sungguh mereka adalah orang-orang zalim tatkala menyembahnya sabagai tuhan selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64-65. Mereka mulai berfikir dan saling berdiskusi: “Kalian sungguh telah berbuat zalim karena telah menyembah sesuatu yang tidak berhak disembah, kemudian kalian bersikap angkuh sehingga tidak mau menerima kebenaran.” Namun akhirnya mereka kembali kepada kebatilan mereka dengan berkata: “Hai Ibrahim, kamu telah mengetahui berhala-berhala itu memang tidak dapat berbicara, mengapa kamu meminta kami untuk bertanya kepada mereka?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. فَرَجَعُوٓا۟ إِلَىٰٓ أَنفُسِهِمْ (Maka mereka telah kembali kepada kesadaran) Yakni mereka sadar bahwa mereka tidak mempunyai jawaban atas hal ini, dan mereka paham bahwa sesuatu yang tidak dapat menolak mudharat dari dirinya dan tidak dapat membalas perbuatan Ibrahim kepadanya, maka ia tidak mungkin layak untuk disembah. فَقَالُوٓا۟ إِنَّكُمْ أَنتُمُ الظّٰلِمُونَ(dan lalu berkata: “Sesungguhnya kamu sekalian adalah orang-orang yang zalim) Yang menzalimi diri mereka sendiri dengan menyembah benda-benda mati ini, dan orang yang zalim bukanlah orang yang menghancurkan patung-patung yang kalian sebut sebagai tuhan-tuhan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Lalu mereka menyalahkan diri sendiri dan sadar, kemudian berkata: “Sesungguhnya kalian adalah orang yang menzalimi diri sendiri dengan menyembah benda-benda mati yang tidak memberi kemahdharatan dan manfaat ini. Dan yang merusak berhala-berhala ini bukanlah orang zalim”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka kembali kepada diri mereka sendiri lalu berkata} lalu berkata satu sama lain {“Sesungguhnya kalianlah yang berbuat zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Maka mereka telah kembali kepada kesadaran mereka,” akal-akal mereka sehat kembali, dan daya nalar mereka pun berbalik lagi. Mereka tahu bahwa mereka sedang berada dalam kesesatan saat menyembahnya. Mereka pun mengakui telah berbuat aniaya dan kesyirikan “Lalu mereka berkata, ‘Sesungguhnya kamu sekalian adalah orang-orang yang menganiaya (diri sendiri)’,” maka tercapailah tujuan yang diingikan Ibrahim. Hujjah telah mengikat mereka, dan bahwa tindakan mereka merupakan kekufuran dan kezhaliman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 64: Kesadaran mereka kembali, mereka mengetahui bahwa mereka berada dalam kesesatan, dan mereka mengakui bahwa perbuatan mereka selama ini adalah salah, ketika seperti ini hujjah tegak terhadap mereka. Akan tetapi kesadaran ini tidak berlangsung lama, bahkan mereka kembali seperti semula. Dengan menyembah sesuatu yang tidak dapat berbicara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 64",
    "description": "Jawaban ibrahim menyadarkan mereka. Maka mereka, setelah mendengar jawaban tersebut, kembali kepada kesadaran mereka yang jernih sesuai akal sehat dan nurani bahwa patung-patung itu tidak layak di-sembah. Dan pemimpin mereka pun berkata, 'sesungguhnya kamu sekalianlah yang menzalimi diri sendiri, terus-menerus menyembah patung yang tidak bisa bicara, tidak bisa membela diri, apalagi menyelamatkan manusia. '65. Mereka menyesali kesalahan dan kebodohan mereka, menyembah patung-patung yang tidak bisa berbicara. Kemudian mereka pun menundukkan kepala, merenung, dan menyesali perbuatan bodoh mereka. Setelah mendapat bisikan setan, mereka lalu mengangkat kepala dan berkata, 'mengapa engkau, ibrahim menyuruh kami bertanya kepada patung besar itu, engkau pasti tahu bahwa berhala-berhala itu tidak dapat berbicara' kami mengetahui patung-patung itu tidak dapat berbicara, tetapi kami menyembahnya karena ini keyakinan kami. \"."
  }
]