[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, tidak berapa lama, sikap penentangan mereka kembali setelah mereka terbungkam. Maka mereka kembali kepada kebatilan lagi dan mendebat Ibrahim dengan alasan yang dipergunakannya untuk menyanggah mereka. Mereka berkata, “Bagaimana kita bisa bertanya kepadanya, sedangkan kamu sendiri mengetahui berhala-berhala itu tidak bisa berbicara?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Akan tetapi kemudian mereka kembali menampakkan sikap durhaka dan ingkar, dengan berkata, \"Engkau pasti tahu wahai Ibrahim, bahwa patung-patung ini tidak dapat berbicara, lalu bagaimana bisa engkau menyuruh kami untuk bertanya kepadanya?\" Mereka menyatakan ini sebagai hujah dan dalih bagi mereka, namun ternyata ini adalah sisi kelemahan hujah mereka sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. ثُمَّ نُكِسُوا۟ عَلَىٰ رُءُوسِهِمْ (kemudian kepala mereka jadi tertunduk) Yakni kemudian mereka kembali pada kejahilan dan kedurhakaan mereka. لَقَدْ عَلِمْتَ مَا هٰٓؤُلَآءِ يَنطِقُونَ(Sesungguhnya kamu (hai Ibrahim) telah mengetahui bahwa berhala-berhala itu tidak dapat berbicara) Yakni mereka berkata kepada Ibrahim: kamu telah mengetahui bahwa patung-patung ini memang tidak dapat berbicara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Kemudian mereka kembali kepada kekufuran, kebodohan dan keangkuhan mereka, lalu berkata kepada Ibrahim: “Sungguh kamu sudah tahu bahwa berhala-berhala itu tidak bisa berbicara, bagaimana bisa kamu menyuruh kami bertanya kepada mereka?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian mereka menundukkan kepala mereka} mereka kembali kepada ketidaktahuan mereka dan keras kepala mereka {“Sungguh kamu tahu bahwa (berhala-berhala) itu tidak dapat berbicara”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Hanya saja, mereka tidak terus dalam kondisi ini. Akan tetapi, “kemudian kepala mereka jadi tertunduk,” maksudnya kondisi mereka telah berubah drastic, akal-akal mereka sudah normal lagi, daya pikir mereka telah mengalami penyimpangan. Sehingga berkata kepada Ibrahim, “Sesungguhnya engkau (hai Ibrahim) telah mengetahui bahwa berhala-berhala itu tidak dapat berbicara,” bagaimana bisa engkau menyalahkan kami dan mengolok-ngolok kami dan menyuruh kami untuk bertanya kepada patung itu sedangkan engkau tahu bahwa dia tidak bias berbicara?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 65: Maksudnya, mereka kembali membangkang setelah sadar. Sehingga mengapa engkau menyuruh kami bertanya kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 65",
    "description": "Mereka menyesali kesalahan dan kebodohan mereka, menyembah patung-patung yang tidak bisa berbicara. Kemudian mereka pun menundukkan kepala, merenung, dan menyesali perbuatan bodoh mereka. Setelah mendapat bisikan setan, mereka lalu mengangkat kepala dan berkata, 'mengapa engkau, ibrahim menyuruh kami bertanya kepada patung besar itu, engkau pasti tahu bahwa berhala-berhala itu tidak dapat berbicara' kami mengetahui patung-patung itu tidak dapat berbicara, tetapi kami menyembahnya karena ini keyakinan kami. \"66-67. Menanggapi pernyataan tersebut, dia, ibrahim, berkata di depan para pembesar kota ur, kaldea, babilonia, mesopotamia selatan, 'mengapa kamu sekalian menyembah tuhan selain Allah, menyembah sesuatu yang tidak dapat memberi manfaat sedikit pun dengan menyembahnya, dan tidak pula mendatangkan mudarat kepada kamu dengan tidak menyembahnya'\" ibrahim kemudian menegaskan tanggapannya, \"celakalah kamu dan apa yang kamu sembah selain Allah di dunia dan di akhirat! apakah kamu tidak memikirkan, apakah kamu akan terus menyembah patung-patung itu atau berhenti''."
  }
]