[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "66-67. Ibrahim berkata kepada mereka seraya merendahkan patung-patung tersebut, “Bagaimana kalian mau menyembah berhala-berhala yang tidak dapat mendatangkan manfaat bila disembah, dan tidak bisa mendatangkan madorot jika ditinggalkan? Amat buruk kalian dan tuhan-tuhan kalian itu yang kalian sembah selain Allah. Apakah kalian tidak berpikir, lalu memahami buruknya keadaan kalian itu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Ibrahim berkata untuk mengingkari perbuatan syirik mereka, \"Mengapa kalian menyembah patung-patung sebagai tuhan-tuhan selain Allah, yang tidak mendatangkan suatu manfaat dan menolak suatu mudarat apapun bagi kalian, sebab mereka sendiri tidak kuasa menolak mudarat dan mendatangkan manfaat untuk dirinya sendiri?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66-67. Maka Ibrahim membantah mereka: “Apakah kalian menyembah selain Allah yang tidak dapat memberi kalian manfaat sedikitpun, dan tidak dapat mendatangkan mudharat bagi kalian jika kalian tidak menyembahnya? Keburukan bagi kalian dan bagi berhala-berhala kalian, tidakkah kalian mengikuti kebenaran? Kata (أُفٍّ) merupakan ismu fi’lin yang mengandung makna kekesalan, kata ini diambil dari suara nafas orang yang kesal yang sesak karena kekesalannya. Sedangkan harakat tanwin pada huruf Fa’ (أُفٍّ) disebut dengan tanwin tankir yang mengandung makna pengagungan; jadi makna (أف لكم) yakni kekesalan yang besar karena kalian. Dan huruf Lam dari kata (لكم) untuk menjelaskan sebabnya; yakni sungguh sangat kesal akibat kalian dan berhala-berhala yang kalian sembah selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Ibrahim berkata kepada mereka: “Apakah kalian akan tetap menyembah sesuatu selain Allah yang tidak memberi kalian manfaat dan kemahdharatan sedikitpun jika kalian menyembahnya?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Mengapa kalian menyembah sesuatu selain Allah yang tidak dapat memberi manfaat sedikit pun dan tidak pula memberi mudarat kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Maka Ibrahim berkata untuk menjelek-jelekkan mereka dan menegaskan kesyirikan mereka di hadapan khalayak sambil memaparkan perihal tidak pantasnya sesembahan-sesembahan mereka itu untuk diibadahi, “maka mengapakah kamu menyembah selain Allah, sesuatu yang tidak dapat memberi manfaat sedikit pun dan tidak (pula) memberi mudarat kepada kamu,” tidak dapat menyuguhkan kebaikan ataupun menolak mara bahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 66: Seperti rezeki dan lainnya. Jika kamu tidak menyembahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 66",
    "description": "66-67. Menanggapi pernyataan tersebut, dia, ibrahim, berkata di depan para pembesar kota ur, kaldea, babilonia, mesopotamia selatan, 'mengapa kamu sekalian menyembah tuhan selain Allah, menyembah sesuatu yang tidak dapat memberi manfaat sedikit pun dengan menyembahnya, dan tidak pula mendatangkan mudarat kepada kamu dengan tidak menyembahnya'\" ibrahim kemudian menegaskan tanggapannya, \"celakalah kamu dan apa yang kamu sembah selain Allah di dunia dan di akhirat! apakah kamu tidak memikirkan, apakah kamu akan terus menyembah patung-patung itu atau berhenti''66-67"
  }
]