[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "66-67. Ibrahim berkata kepada mereka seraya merendahkan patung-patung tersebut, “Bagaimana kalian mau menyembah berhala-berhala yang tidak dapat mendatangkan manfaat bila disembah, dan tidak bisa mendatangkan madorot jika ditinggalkan? Amat buruk kalian dan tuhan-tuhan kalian itu yang kalian sembah selain Allah. Apakah kalian tidak berpikir, lalu memahami buruknya keadaan kalian itu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Sungguh celaka dan amat buruklah kalian dan patung-patung yang kalian sembah selain Allah, yang tidak bisa mendatangkan manfaat dan menolak mudarat, maka apakah kalian tidak juga berakal dan meninggalkan penyembahan terhadap patung-patung itu?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ اللهِ ۖ (Ah (celakalah) kamu dan apa yang kamu sembah selain Allah) Ini merupakan celaan bagi mereka dan sesembahan mereka. Makna (أف) yakni suara yang menunjukkan ketidaksukaan dan olokan. أَفَلَا تَعْقِلُونَ (Maka apakah kamu tidak memahami?) Sehingga kalian dapat mengetahui keburukan perbuatan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Celakalah kalian, tuhan-tuhan kalian, dan peribadatan kalian terhadap berhala-berhala ini yang kalian anggap sebagai tuhan selain Allah. Apakah kalian tidak berpikir betapa buruknya tiruan kalian dan bahwa berhala-berhala ini tidak layak disembah?! Huruf lam pada kata {lakum} untuk menjelaskan kejenuhannya terhadap peribadatan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah kalian} sungguh buruk dan kotor kalian {dan apa yang kalian sembah selain Allah. Apakah kalian tidak berpikir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. “Ah (celakalah) kamu dan apa yang kamu sembah selain Allah,” maksudnya alangkah sesat kalian, betapa ruginya usaha kalian, dan betapa hinanya kalian dan patung-patung yang kalian ibadahi selain Allah. Jika kalian benar-benar berpikir, niscaya kalian akan mengetahui hakikat kondisi ini. Namun, ketika kalian tidak mendayagunakan akal pikiran, berbuat kebodohan dan kesesatan dengan sadar, maka binatang-binatang ternak lebih baik daripada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 67: Yakni sungguh sesat, rugi, dan hina dirimu dan apa yang kamu sembah selain Allah. Yakni bahwa patung-patung itu tidak berhak disembah, dan bahwa yang pantas disembah adalah Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 67",
    "description": "66-67. Menanggapi pernyataan tersebut, dia, ibrahim, berkata di depan para pembesar kota ur, kaldea, babilonia, mesopotamia selatan, 'mengapa kamu sekalian menyembah tuhan selain Allah, menyembah sesuatu yang tidak dapat memberi manfaat sedikit pun dengan menyembahnya, dan tidak pula mendatangkan mudarat kepada kamu dengan tidak menyembahnya'\" ibrahim kemudian menegaskan tanggapannya, \"celakalah kamu dan apa yang kamu sembah selain Allah di dunia dan di akhirat! apakah kamu tidak memikirkan, apakah kamu akan terus menyembah patung-patung itu atau berhenti''68. Tanggapan ibrahim yang tegas dan lugas tersebut direspon oleh para pembesar kota ur, kaldea dengan sangat marah. Mereka berkata, 'bakarlah dia, ibrahim, hidup-hidup di tengah alun-alun, dan bantulah tuhan-tuhan kamu dengan menyiapkan kayu bakar yang cukup untuk membakar dia selama satu bulan, jika kamu benar-benar hendak berbuat untuk tuhan kamu. '."
  }
]