[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "68-69. Ketika argumentasi mereka terpatahkan, dan kebenaran kian tampak jelas, maka mereka berdalih mempergunakan kekuasaan mereka. Dan mereka berkata, “Bakarlah Ibrahim dengan api, sebagai ungkapan kekesalan demi membela tuhan-tuhan kalian, jika kalian mau membelanya.” Lalu mereka menyalakan api yang besar dan melemparkan Ibrahim ke dalamnya. Kemudian Allah memenangkan RasulNya. Dia berfirman kepada api, “Hai api, jadilah dingin dan keselamatan bagi Ibrahim.” Maka tidak ada rasa sakit apapun yang mengenai Ibrahim, dan tidak ada mara bahaya yang menimpanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Ketika mereka tidak mampu meladeni Ibrahim dengan berbagai hujah dan dalil, mereka pun menggunakan kekuatan dan kekuasaan, mereka berkata, \"Bakarlah Ibrahim dengan api, sebagai bentuk pembelaan terhadap tuhan-tuhan kalian yang ia robohkan dan hancurkan, jika kalian benar-benar menghukum dirinya dengan hukuman yang membuat jera.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68-69. Setelah mereka kalah dalam berdebat dengannya, mereka memutuskan untuk membakarnya. Para pemimpin mereka memerintahkan: “Bakarlah Ibrahim dengan api yang besar sebagai balas dendam dan pertolongan bagi tuhan-tuhan kalian jika kalian benar-benar ingin menolongnya.” Akan tetapi penjagaan Allah mengalahkan segala perintah orang-orang zalim. Allah berfirman: “Hai api, jadi dinginlah dan jadilah keselamatan bagi Ibrahim”. Maka sifat api itu berubah menjadi dingin dan tidak membahayakan Ibrahim, sehingga dia dapat keluar dari api dalam keadaan selamat atas izin Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. قَالُوا۟ حَرِّقُوهُ (Mereka berkata: “Bakarlah dia) Yakni bakarlah Ibrahim. Kumpulkanlah kayu dan nyalakanlah, kemudian masukkan Ibrahim ke dalam api itu agar ikut terbakar, sebagai balasan atas perbuatannya. Mereka mengatakan hal ini karena ingin menunjukkan kemenangan dengan cara apapun. وَانصُرُوٓا۟ ءَالِهَتَكُمْ إِن كُنتُمْ فٰعِلِينَ (dan bantulah tuhan-tuhan kamu, jika kamu benar-benar hendak bertindak”) Yakni tolonglah tuhan-tuhan kalian dengan membalas perbuatan yang dilakukan Ibrahim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Mereka saling berkata: “Bakarlah Ibrahim dengan api yang sangat panas, dan tolonglah tuhan-tuhan kalian dengan membalas Ibrahim, jika kalian ingin berbuat sesuatu untuknya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Bakarlah dia dan bantulah tuhan-tuhan kalian jika kalian benar-benar hendak berbuat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. Pada waktu itulah, saat Ibrahim berhasil membungkam mereka, sampai tidak dapat mengemukakan satu pembelaan pun, mereka menggunakan kekuatan fisik untuk membalasnya. Maka, “mereka berkata, ‘Bakarlah dia dan bantulah tuhan-tuhan kamu, jika kamu benar-benar hendak bertindak,” maksudnya, bunuhlah dia dengan cara yang paling sadis, dengan cara membakarnya sebagai ungkapan rasa marah kalian dan pembelaan kepada sesembahan-sesembahan kalian. Celakalah mereka, celakalah mereka, karena menyembah sesembahan yang telah mereka akui membutuhkan pertolongan mereka namun tetap mereka jadikan sebagai tuhan yang disembah!!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 68: Setelah Nabi Ibrahim ‘alaihis salam membuat mereka tidak bisa lagi menjawab, maka mereka menggunakan kekerasan. Dengan membakar Ibrahim. Yakni hendak membela tuhan-tuhan kamu. Maka mereka mengumpulkan kayu bakar yang banyak dan menyalakan api serta mengikat Nabi Ibrahim ‘alaihis salam. Mereka taruh Beliau dalam Manjenik (alat pelempar) lalu melemparnya ke dalam api."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 68",
    "description": "Tanggapan ibrahim yang tegas dan lugas tersebut direspon oleh para pembesar kota ur, kaldea dengan sangat marah. Mereka berkata, 'bakarlah dia, ibrahim, hidup-hidup di tengah alun-alun, dan bantulah tuhan-tuhan kamu dengan menyiapkan kayu bakar yang cukup untuk membakar dia selama satu bulan, jika kamu benar-benar hendak berbuat untuk tuhan kamu. '69. Orang-orang kafir di kota ur dan kaldea melemparkan ibrahim ke dalam api yang menyala, namun Allah hendak meyelamatkan ibrahim dengan mengubah sifat api. Kami, berfirman kepada api, 'wahai api! jadilah kamu dingin, ' api dikecualikan dari sifatnya yang alamiah, panas dan membakar, tetapi bukan dingin yang membahayakan. Allah melanjutkan firman-Nya kepada api, 'dan jadilah kamu penyelamat bagi ibrahim dengan menjadi sejuk!'."
  }
]