[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "68-69. Ketika argumentasi mereka terpatahkan, dan kebenaran kian tampak jelas, maka mereka berdalih mempergunakan kekuasaan mereka. Dan mereka berkata, “Bakarlah Ibrahim dengan api, sebagai ungkapan kekesalan demi membela tuhan-tuhan kalian, jika kalian mau membelanya.” Lalu mereka menyalakan api yang besar dan melemparkan Ibrahim ke dalamnya. Kemudian Allah memenangkan RasulNya. Dia berfirman kepada api, “Hai api, jadilah dingin dan keselamatan bagi Ibrahim.” Maka tidak ada rasa sakit apapun yang mengenai Ibrahim, dan tidak ada mara bahaya yang menimpanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Maka mereka menyalakan api yang besar dan melemparkan Ibrahim ke dalamnya, lalu Kami berfirman, \"Wahai api, jadilah engkau dingin dan penyelamat bagi Ibrahim,\" Maka selamatlah Ibrahim dan sama sekali tidak mendapatkan bahaya apapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. قُلْنَا يٰنَارُ كُونِى بَرْدًا وَسَلٰمًا عَلَىٰٓ إِبْرٰهِيمَ (Kami berfirman: “Hai api menjadi dinginlah, dan menjadi keselamatanlah bagi Ibrahim”) Yakni kemudian mereka menyalakan api dan melempar Ibrahim ke dalamnya, namun api itu terasa dingin dan menjadi tidak berbahaya baginya dengan ketentuan Allah Yang Maha Kuasa sehingga api itu tidak membahayakan Ibrahim sedikitpun. Imam Abu Dawud dan Tirmidzi mengeluarkan hadits dari Abu Hurairah, ia berkata: Rasulullah bersabda: “Nabi Ibrahim tidak pernah berbohong kecuali pada tiga hal, semuanya di jalan Allah; pertama adalah ucapannya “aku sakit” padahal dia tidak sakit, kedua, ucapannya tentang istrinya Sarah “ini adalah saudara perempuanku”, dan ketiga, ucapannya “Sebenarnya patung yang besar itulah yang melakukannya”.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Setelah Ibrahim dilempar ke dalam api yang besar menggunakan alat pelontar, Allah SWT berfirman: “Wahai api jadilah dingin dan penyelamat Ibrahim” Kemudian panas api itu menjadi dingin tanpa menyakitinya. Lalu seizin Allah SWT, Ibrahim keluar dari kobaran api itu dengan selamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami berfirman,“Wahai api, jadilah dingin dan menjadi keselamatan bagi Ibrahim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Berikutnya, Allah menolong kekasihNya saat dilemparkan ke dalam kobaran api. Allah berkata kepadanya “Hai api menjadi dinginlah, dan menjadi keselamatanlah bagi Ibrahim.” Api tersebut menjadi dingin dan menyelamatkannya. Tidak ada rasa kesakitan pada beliau saat berada di dalamnya, dan tidak merasakan sesuatu yang dibenci."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 69: Oleh karena itu, Nabi Ibrahim alaihis salam tidak terbakar, selain tali pengikatnya saja, panasnya hilang sedangkan cahayanya tetap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 69",
    "description": "Orang-orang kafir di kota ur dan kaldea melemparkan ibrahim ke dalam api yang menyala, namun Allah hendak meyelamatkan ibrahim dengan mengubah sifat api. Kami, berfirman kepada api, 'wahai api! jadilah kamu dingin, ' api dikecualikan dari sifatnya yang alamiah, panas dan membakar, tetapi bukan dingin yang membahayakan. Allah melanjutkan firman-Nya kepada api, 'dan jadilah kamu penyelamat bagi ibrahim dengan menjadi sejuk!'70. Raja namrud dan seluruh rakyat babilonia, mesopotamia timur, mengumpulkan kayu bakar dan membakar ibrahim hidup-hidup. Dan mereka hendak berbuat jahat terhadap ibrahim, karena keberanian ibrahim menghancurkan patung dan menyadarkan mereka bahwa menyembah patung itu sesat. Ketahuilah, maka kami, menjadikan mereka itu orang-orang yang paling rugi, baik di dunia karena tidak bisa berpikir jernih, mengikuti akal sehat dan nurani, maupun di akhirat karena mendapatkan murka Allah dan kekal di dalam neraka."
  }
]