[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidak mengutus rasul sebelummu (wahai rasul) kecuali orang-orang lelaki dari bangsa manusia. Kami wahyukan kepada mereka wahyu. Kami tidak pernah mengutus malaikat. Maka bertanyalah kalian (wahai orang-orang kafir Makkah) kepada orang-orang yang berilmu terhadap kitab-kitab terdahulu yang telah diturunkan, jika kalian memang tidak mengetahuinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan tidaklah Kami mengutus sebelum engkau -wahai Rasul- melainkan beberapa orang laki-laki dari kalangan manusia yang Kami berikan wahyu kepada mereka. Kami tidak mengutus mereka sebagai sosok Malaikat, maka tanyakanlah kepada Ahli Kitab sebelum kalian yang mengetahui hal itu bila kalian benar-benar tidak mengetahuinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Hai Rasulullah, Tidaklah Kami mengutus rasul sebelummu melainkan dia dari golongan manusia, bukan dari golongan malaikat. Hai orang-orang yang mendustakan, maka tanyakanlah orang-orang yang memiliki ilmu tentang al-Qur’an, Taurat, dan Injil jika kalian tidak mengetahui hal itu. Kami tidak menjadikan para nabi sebagai makhluk yang berbeda dengan manusia lainnya, seperti malaikat yang tidak makan dan minum; dan para nabi itu bukanlah makhluk yang kekal hidup di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَمَآ أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا نُّوحِىٓ إِلَيْهِمْ ۖ (Kami tiada mengutus rasul rasul sebelum kamu (Muhammad), melainkan beberapa orang-laki-laki yang Kami beri wahyu kepada mereka) Yakni Kami tidak mengutus orang sebelummu kepada umat-umat terdahulu melainkan laki-laki dari jenis manusia, dan Kami tidak mengirim kepada mereka para malaikat. فَسْـَٔلُوٓا۟ أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ(maka tanyakanlah olehmu kepada orang-orang yang berilmu, jika kamu tiada mengetahui) Mereka adalah para ahli kitab: orang-orang Yahudi dan Nasrani; tanyakanlah kepada mereka jika kalian tidak mengetahui bahwa para utusan Allah adalah dari golongan manusia. Begitu juga segala hal yang tidak diketahui oleh seseorang, hendaklah ia menanyakannya pada orang-orang yang memiliki pengetahuan tentang hal tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Allah menanggapi mereka dengan firmanNya: “Wahai Nabi, perlu kamu ketahui bahwa Kami tidak mengutus sebelum kamu kecuali para rasul laki-laki yang Kami wahyukan ayat-ayat Kami kepada mereka. Maka tanyakanlah kepada para ahli kitab samawi terdahulu, jika kamu tidak mengetahui bahwa seluruh nabi dan rasul itu adalah manusia biasa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus sebelum kamu melainkan beberapa laki-laki yang Kami beri wahyu kepada mereka. Maka bertanyalah kepada orang yang berilmu} orang-orang yang ahli kitab {jika kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-9. Ini merupakan sanggahan atas lontaran syubhat kalangan orang-orang yang mendustakan Rasulullah. Mereka berkomentar, “Kenapa dia (seorang rasul) bukan seorang malaikat yang tidak membutuhkan makanan dan minuman serta mondar-mandir berurusan dengan pasar-pasar! Kenapa dia tidak abadi!” bila dia tidak demikian, berarti menunjukkan dia bukan seorang utusan Allah.” Rangkaian syunhat ini, masih saja menancap di hati-hati kaum yang mendustakan para rasul. Mereka serupa dalam kekufuran, sehingga pernyataan-pernyataan mereka pun senada. Berikutnya, Allah menangkis syuhat orang-orang yang mendustakan Rasulullah, (namun) mengakui penetapan eksistensi para rasul sebelum beliau. Kalau tida ada Nabi melainkan Nabi Ibrahim saja –yang telah diakui kenabbiannya oleh seluruh golongan, yang mana kaun musyrikin melancarkan klaim berpegang teguh pada agama dan ajaran Ibrahim bahwa para rasul sebelum Muhammad semuanya dari kalangan manusia, yang makan makanan, dan berjalan-jalan di pasar-pasar, dan muncul kejadian-kejadian manusiawi yang menimpa mereka seperti kematian dan kejadian lainnya, serta bahwa Allah telah mengutuus mereka kepada kaum dan ummat mereka; lalu sebagian beriman kepada mereka, dan adapula yang mendustakan, dan bahwa Allah benar-benar akan merealisasikan bagi mereka sesuatu yang telah dijanjikan, berupa keselamatan dan kebahagiaan bagi mereka (para utusan Allah) dan para pengikut, dan akan membinasakan orang-orang yang melampaui batas, lagi mendustakan mereka-, maka mengapa banyak syubhat batil yang diarahkan kepada Muahammad dalam rangka mengingkari risalahnya, padahal realita-realita itu melekat pada para saudaranya dari kalangan para rasul yang diakui oleh para pendusta kenabian Muhammad? Ini adalah konsekuensi yang begitu jelas bagi mereka. Jika mereka mengakui kerasulan dari kalangan manusia, namun tidak mau menetapkan seorang rasul dari selain kalangan manusia, maka berarti syubhat mereka (tentang Nabi Muhammad) batil. Mereka telah mematahkannya sendiri dengan pengakuan mereka mengenai rusaknya syubhat mereka dan adanya kontradiksi di tengah (pola pikir) mereka tentang itu. Andai alangkah mereka ini diprediksi menuju pengingkaran kenabian dari kalangan manusia seutuhnya, tidak ada satu pun nabi, melainkan seorang malaikat yang abadi, tidak makan makanan, maka sungguh Allah telah menyanggah syubhat ini dengan FirmanNYa, \"Dan mereka berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) seorang malaikat?\" dan kalau Kami turunkan (kepadanya) seorang malaikat, tentu selesailah urusan itu, kemudian mereka tidak diberi tangguh (sedikit pun). Dan kalau Kami jadikan rasul itu (dari) malaikat, tentulah Kami jadikan dia berupa laki-laki dan (jika Kami jadikan dia berupa laki-Iaki), Kami pun akan jadikan mereka tetap ragu sebagaimana kini mereka ragu.\" (Al-An’am:8-9) Dan bahwa manusia tidak mempunyai kekuatan dalam menerima wahyu dari malaikat (secara langsung), \"Katakanlah: \"Kalau seandainya ada malaikat-malaikat yang berjalan-jalan sebagai penghuni di bumi, niscaya Kami turunkan dari langit kepada mereka malaikat menjadi rasul\". (Al-Isra:95). Jikalau timbul keraguan pada kalian, dan kalian tidak mengetahui selu-beluk para rasul yang sudah lewat, hendaknya mereka bertanya kepada orang-orang yang berilmu tentang kitab-kitab yang terdahulu. Misalnya, para ulama yang menguasai Taurat dan INjil. Mereka bakal memberitahukan tentang ilmu yang mereka miliki kepada kalian, dan bahwa seluruh rasul adalah manusia yang berasal dari jenis bangsa yang diberikan risalah (obyek dakwah). Ayat ini, meskipun sebabnya khusus mengenai pertanyaan tentang jatii diri para rasul yang telah berlalu kepada ahli dzikir, yaitu ulama, tapi sesungguhnya konteksnya umum, mencakup setiap permasalahan agama, perkara yang inti atau cabangnya. Jika seseorang tidak mempunyai pengetahuan tentangnya, hendaknya dia menanyakannya kepada orang yang mengetahuinya. Dalam keterangan ini terkandung pelajaran, adanya perintah untuk belajar dan bertanya kepada ulama. Tidaklah diperintahkan untuk bertanya kepada mereka (ulama) melainkan karena mereka wajib mengajarkan ilmu dan menjawab permasalahan yang mereka ketahui. Di dalam pengkhususan melontarkan pertanyaan kepada ulama, terkandung larangan bertanya kepada orang yang sudah dikenal dengan kebodohannya dan tida berilmu. Di dalamnya juga terkandung larangan bagi orang yang bodoh untuk memposisikan diri untuk menjawab. Dalllam ayat ini termuat sebuah dalil bahwa tidak ada nabi dari kalangan wanita, termasuk Maryam atau lainnya bukan nabi. Hal ini berdasarkan Firman Allah, “Melainkan beberapa orang laki-laki.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 7: Bukan malaikat, dan bukan wanita. Ayat ini merupakan bantahan terhadap syubhat orang-orang yang mendustakan rasul yang mengatakan, “Mengapa rasul itu tidak seorang malaikat saja, sehingga tidak butuh makan, minum, pergi ke pasar? Demikian pula, mengapa mereka tidak kekal?” Allah menjawab syubhat ini, bahwa para rasul sebelum Muhammad shallallahu 'alaihi wa sallam, mereka semua adalah manusia, termasuk Nabi Ibrahim yang diakui semua kalangan dan bahwa mereka (orang-orang musyrik) –menurut persangkaannya- berada di atas ajarannya, padahal tidak. Jika kamu masih ragu-ragu dan tidak memiliki pengetahuan tentang keadaan para rasul dahulu. Seperti orang-orang yang mengetahui isi Taurat dan Injil. Ayat ini meskipun sebabnya khusus, yakni untuk bertanya keadaan para rasul kepada orang yang berpengetahuan (ahli ilmu), akan tetapi ia umum, sehingga apabila seseorang tidak memiliki ilmu tentang masalah agama yang ushul (dasar) maupun yang furu’ (cabang), maka ia diperintahkan untuk bertanya kepada orang yang mengetahuinya. Dalam ayat ini tedapat perintah belajar dan bertanya kepada ahlinya. Kita tidak diperintahkan bertanya kepada ahli ilmu, kecuali karena ahli ilmu berkewajiban mengajarkan dan menjawab sesuai yang mereka ketahui. Diperintahkan bertanya kepada ahli ilmu menunjukkan dilarangnya bertanya kepada orang yang terkenal kebodohannya dan tidak berilmu, dan larangan baginya untuk maju menjawab pertanyaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 7",
    "description": "Dan kami, wahai Muhammad, tidak mengutus para rasul sebelum engkau, melainkan beberapa orang laki-laki dari kalangan manusia yang kami beri wahyu kepada mereka. Kami tidak mengutus para malaikat untuk menjadi rasul bagi manusia. Maka tanyakanlah, wahai kaum kafir mekah, kepada orang yang berilmu tentang kitab Allah yang diturunkan sebelum Al-Qur'an, jika kamu tidak mengetahui persoalan ini. -."
  }
]