[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang itu menginginkan kebinasaan Ibrahim. Akan tetapi, Allah menggugurkan makar mereka itu dan menjadikan mereka para pecundang lagi nista."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Dan kaum Ibrahim -'alaihissalām- hendak berbuat makar kepadanya dengan membakarnya hidup-hidup, namun Kami membatalkan makar mereka, dan menjadikan mereka sebagai orang-orang yang binasa lagi kalah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70-82. Mereka hendak membunuh Ibrahim dengan membakarnya, maka Kami menjadikan mereka sebagai manusia yang paling merugi di dunia dan di akhirat. Dan Kami menyelamatkan Ibrahim dan Luth, mereka berhijrah menuju Baitul Maqdis yang Kami berkahi dengan berbagai kebaikan bagi manusia dan berbagai macam buah-buahan. Dan Kami memberi Ibrahim seorang anak bernama Ishaq, dan seorang cucu bernama Ya’qub sebagai tambahan atas pengabulan doa Ibrahim; mreka semua adalah para nabi dan orang-orang yang shalih dan taat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pada kisah Ibrahim yang diceritakan dalam surah al-Anbiya' Allah berfirman : { وَأَرَادُوا۟ بِهِۦ كَيْدًا فَجَعَلْنَٰهُمُ ٱلْأَخْسَرِينَ } \"Mereka hendak berbuat makar terhadap Ibrahim, maka Kami menjadikan mereka itu orang-orang yang paling merugi\", dan dalam surah ash-Shaffat : { فَأَرَادُوا۟ بِهِۦ كَيْدًا فَجَعَلْنَٰهُمُ ٱلْأَسْفَلِينَ } \"Mereka hendak melakukan tipu muslihat kepadanya, maka Kami jadikan mereka orang-orang yang hina\" [ Ash-Shaffat : 98 ], kedua ayat ini menceritakan tentang kisah yang sama lalu apa hikmah di baliknya? maka dijawab : pada surah al-Anbiya' Allah -تعالى- mengabarkan tentang Ibrahim -عليه السلام- bahwa ia telah melakukan tipu daya terhadap berhala-berhala kaumnya { وَتَٱللَّهِ لَأَكِيدَنَّ أَصْنَٰمَكُم } \"Demi Allah, sesungguhnya aku akan melakukan tipu daya terhadap berhala-berhalamu\" [ Al-Anbiya' 57 ], dan Allah juga mengabarkan bahwa mereka pun juga bermaksud untuk berbuat tipu msulihat terhadap Ibrahim { وَأَرَادُوا۟ بِهِۦ كَيْدًا } \"Mereka hendak melakukan tipu muslihat kepadanya\" maka dua tipu daya pun bertemu, tatkala tipu daya itu kembali kepada mereka ayat kemudian mengungkapkan dengan lafadz \"khasarah\". Dan pada surah ash-Shaffat dikatakan sebelumnya: { قَالُوا۟ ٱبْنُوا۟ لَهُۥ بُنْيَٰنًا فَأَلْقُوهُ فِى ٱلْجَحِيمِ } \"Mereka berkata: \"Dirikanlah suatu bangunan untuk (membakar) Ibrahim; lalu lemparkanlah dia ke dalam api yang menyala-nyala itu\" maka ketika mereka melemparkan Ibrahim dari bangunan yang tinggi ke daratan yang rendah, Allah kemudian membalas perbuatan mereka dengan hal yang serupa dan menjadikan mereka benar-benar pada posisi yang hina, dan kedudukan Nabi Ibrahim pun berada di atas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Mereka hendak membakar dan berbuat makar terhadap Ibrahim dengan mencelakakannya. Lalu kami menjadikan mereka semua merugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka hendak berbuat jahat terhadapnya} berencana untuk berbuat jahat kepadanya {tetapi Kami menjadikan mereka itu orang-orang yang paling rugi} yang ditaklukkan dan orang yang hina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. “Mereka hendak membuat makar terhadap Ibrahim,” dengan bertekad untuk memmbakarnya, “maka Kami menjadikan mereka itu orang-orang yang paling merugi,” yaitu dunia dan akhirat. Sebagaimana Allah telah menjadikan kekasihNya dan para pengikutnya sebagai golongan orang-orang yang beruntung lagi jaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 70: Yaitu ketika mereka sepakat untuk membakarnya. Di dunia dan akhirat. Sebaliknya kekasih-Nya dan para pengikutnya, merekalah orang-orang yang beruntung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 70",
    "description": "Raja namrud dan seluruh rakyat babilonia, mesopotamia timur, mengumpulkan kayu bakar dan membakar ibrahim hidup-hidup. Dan mereka hendak berbuat jahat terhadap ibrahim, karena keberanian ibrahim menghancurkan patung dan menyadarkan mereka bahwa menyembah patung itu sesat. Ketahuilah, maka kami, menjadikan mereka itu orang-orang yang paling rugi, baik di dunia karena tidak bisa berpikir jernih, mengikuti akal sehat dan nurani, maupun di akhirat karena mendapatkan murka Allah dan kekal di dalam neraka. 71. Dan kami telah menyelamatkan dia, ibrahim, dari kejahatan warga kota ur yang membakarnya hidup-hidup. Lalu dia hijrah ke harran, kemudian ke palestina. Dan kami juga telah menyelamatkan lut dari bencana alam yang menimpa kota sodom dan gomorah. Keduanya, ibrahim dan luth, pergi ke palestina, sebuah negeri yang telah kami berkahi untuk seluruh alam. Palestina adalah tanah kelahiran para nabi, kelahiran nabi ismail yang melahirkan rasulullah dan nabi ishak yang melahirkan bani israil; dan yerusalem, kota penting di palestina, menjadi kota suci tiga agama, yahudi, nasrani dan islam; dan tempat rasulullah mikraj."
  }
]