[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menyelamatkan Ibrahim dan Luth yang telah beriman dengannya dari negeri Irak, dan Kami mengarahkan mereka berdua menuju negeri Syam yang telah Kami berkahi buminya dengan kebaikan yang melimpah, dan kebanyakan nabi pernah di utus disana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan Kami selamatkan ia (Ibrahim) dan juga menyelamatkan Lūṭ dengan mengeluarkan mereka ke negeri Syam yang kami berkahi, lantaran di negeri itulah Kami mengutus banyak para Nabi, dan menurunkan banyak rahmat serta berbagai kebaikan untuk makhluk-makhluk di negeri itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَنَجَّيْنٰهُ وَلُوطًا (Dan Kami seIamatkan Ibrahim dan Luth) Dari negeri Irak. Luth adalah keponakan Nabi Ibrahim, ketika itu ia telah beriman kepada seruan Nabi Ibrahim. إِلَى الْأَرْضِ الَّتِى بٰرَكْنَا فِيهَا لِلْعٰلَمِينَ(ke sebuah negeri yang Kami telah memberkahinya untuk sekalian manusia) Yakni negeri Baitul Maqdis, disebut dengan negeri yang diberkahi karena sangat subur dan terdapat banyak buah-buahan dan sungai-sungai serta menjadi tempat diutusnya sebagian besar Nabi-Nabi dan menjadi tempat awal tersebarnya agama dan keimanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Dan Kami selamatkan Ibrahim dan keponakannya, Luth dari negeri Babilonia yang ada di Iraq menuju tanah Baitul Maqdis yang Kami berkahi dengan memberi banyak sungai dan pohon-pohonan bagi manusia. Dan kami jadikan tempat itu sebagai tempat turunnya para nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menyelamatkannya dia dan Luth ke tanah} tanah Syam {yang telah Kami berkahi untuk seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. “Dan Kami selamatkan Ibrahim dan Luth.” Pasalnya, tidak ada yang beriman dari kalangan kaumnya kecuali Luth. Disebutkan dalam sebuah versi, bahwa Luth adalah keponakan Ibrahim. Allah menyelamatkannya dan berhijrah, “ke sebuah negeri yang Kami telah memberkahinya untuk sekalian manusia” yaitu negeri Syam. Beliau meninggalkan kaumnya di Babilonia di Irak. Dan berkatalah Ibrahim: \"Sesungguhnya aku akan berpindah ke (tempat yang diperintahkan) Tuhanku (kepadaku); sesungguhnya Dialah yang Maha Perkasa lagi Maha Bijaksana.\" (Al-Ankabut:26). Di antara keberkahan negeri Syam adalah, banyak Nabi yang berada di wilayahnya, Allah memilihnya sebagai tempat hijrah bagi kekasihNya, dan di sana terdapat salah satu dari tiga RumahNya yang suci, Baitul Maqdis."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 71: Di antara kaum Ibrahim, yang beriman kepadanya hanyalah Luth. Beliau (Luth) adalah putera saudara Ibrahim. Allah menyelamatkan Ibrahim dan Luth dari raja Babil Namrud dan kaumnya. Kemudian keduanya berhijrah ke Syam meninggalkan kaumnya di Babil, salah satu daerah di Irak. Yang dimaksud dengan negeri di sini ialah negeri Syam, termasuk di dalamnya Palestina. Allah memberkahi negeri itu artinya kebanyakan nabi berasal dari negeri itu dan tanahnya pun subur"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 71",
    "description": "Dan kami telah menyelamatkan dia, ibrahim, dari kejahatan warga kota ur yang membakarnya hidup-hidup. Lalu dia hijrah ke harran, kemudian ke palestina. Dan kami juga telah menyelamatkan lut dari bencana alam yang menimpa kota sodom dan gomorah. Keduanya, ibrahim dan luth, pergi ke palestina, sebuah negeri yang telah kami berkahi untuk seluruh alam. Palestina adalah tanah kelahiran para nabi, kelahiran nabi ismail yang melahirkan rasulullah dan nabi ishak yang melahirkan bani israil; dan yerusalem, kota penting di palestina, menjadi kota suci tiga agama, yahudi, nasrani dan islam; dan tempat rasulullah mikraj. 72. Dan kami telah menganugerahkan kepadanya, ibrahim, kenikmatan lain yang sangat berharga, yaitu kelahiran ishak pada saat usia beliau sudah lanjut, dan darinya lahir yakub, yang melahirkan bani israil. Di antaranya banyak terpilih menjadi nabi dan rasul, sebagai suatu anuge-rah yang sangat berharga. Dan masing-masing dari keturunan ishak dan yakub, kami jadikan orang-orang yang saleh, dan juga orang-orang zalim dan kufur."
  }
]