[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah telah mencurahkan berbagai nikmat kepada Ibrahim. Dia menganugerahkan baginya putranya, Ishaq ketika dia berdo’a kepadaNya. Dan Dia menganugerahkan Ya’qub baginya dari Ishaq sebagai tambahan atas nikmat sebelumnya. Dan masing-masing mereka; Ibrahim,Ishaq dan Ya’qub Kami jadikan orang shalih lagi patuh kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Dan Kami menganugerahkan kepadanya Isḥāq ketika ia berdoa kepada Tuhannya agar dikaruniai seorang anak, dan Kami juga menganugerahkan padanya Ya'qūb sebagai tambahan anugerah. Dan mereka semua; Ibrahim dan kedua anak dan cucunya tersebut, Kami jadikan sebagai orang-orang saleh lagi taat kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَوَهَبْنَا لَهُۥٓ إِسْحٰقَ وَيَعْقُوبَ نَافِلَةً ۖ (Dan Kami telah memberikan kepada-nya (Ibrahim) lshak dan Ya’qub sebagai suatu anugerah) Makna (النافلة) adalah tambahan. Dahulu Nabi Ibrahim memohon kepada Allah agar mengaruniakannya seorang anak, maka Allah mengaruniakan bagi Ibrahim Ishaq, kemudian Ishaq tanpa memohon kepada Allah, Dia mengaruniakan bagi Ishaq Ya’qub, oleh sebab itu Ya’qub disebut sebagai tambahan, yaitu tambahan atas doa yang dipanjatkan Nabi Ibrahim. وَكُلًّا جَعَلْنَا صٰلِحِينَ (Dan masing-masingnya Kami jadikan orang-orang yang saleh) Yakni masing-masing dari empat orang tersebut, yaitu Ibrahim, Luth, Ishaq, dan Ya’qub, Kami jadikan mereka orang-orang yang shalih yang menjalankan ketaatan kepada Allah dan meninggalkan kemaksiatan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Dan Kami anugerahkan kepada Ibrahim Ishaq sebagai anak dari istrinya, Sarah, dan Ya’kub sebagai cucunya untuk melimpahkan apa yang diminta oleh Ibrahim. Masing-masing dari tiga orang itu termasuk Luth yang keempat telah Kami jadikan sebagai nabi yang shalih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menganugerahkan kepadanya Ishaq dan Ya’kub sebagai tambahan} tambahan atas apa yang dia minta {Masing-masing Kami jadikan orang yang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. “Dan Kami telah memberikan kepadanya (Ibrahim),” saat memisahkan diri dari kaumnya “Ishaq dan Ya’qub,” Ya’qub adalah putra Ishaq, “sebagai sebuah anugerah (dari Kami),” setelah beliau memasuki usia tua dan istrinya dalam keadaan mandul. Kemudian malaikat mengabarkan berita gembira kepadanya berupa kelahiran Ishaq. (Hud:71). Ya’qub adalah Israil yang darinya lahir bangsa yang besar. Sedangkan Ismail bin Ibrahim, merupakan cikal bakal bangsa Arab yang utama. Di antara keturunannya, penghulu orang-orang terdahulu dan yang akan datang (Muhammad). “Dan masing-masing,” masing-masing yaitu, Ibrahim, Ishaq, dan Ya’qub “Kami jadiikan orang-orang yang shalih,” maksudnya orang-orang yang menjalankan hak-hakNya dan hak-hak manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 72: Yakni ketika Ibrahim meminta dianugerahkan seorang anak dari istrinya yang mandul, yaitu Sarah. Yakni Ya’kub sebagai tambahan dari permintaannya. Yang memenuhi hak Allah dan hak hamba-hamba-Nya. Termasuk kesalehan mereka adalah, Allah menjadikan mereka sebagai pemimpin yang menunjukkan kepada kebaikan dengan perintah-Nya. Hal ini merupakan nikmat paling besar yang Allah berikan kepada hamba-Nya, yakni dijadikan-Nya sebagai pemimpin kebaikan (a’immatul huda), di mana orang-orang mengikuti di belakangnya, yang demikian adalah karena kesabaran mereka dan yakin kepada ayat-ayat Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 72",
    "description": "Dan kami telah menganugerahkan kepadanya, ibrahim, kenikmatan lain yang sangat berharga, yaitu kelahiran ishak pada saat usia beliau sudah lanjut, dan darinya lahir yakub, yang melahirkan bani israil. Di antaranya banyak terpilih menjadi nabi dan rasul, sebagai suatu anuge-rah yang sangat berharga. Dan masing-masing dari keturunan ishak dan yakub, kami jadikan orang-orang yang saleh, dan juga orang-orang zalim dan kufur. 73. Dan kami jadikan mereka itu, para nabi dan rasul keturunan ishak dan yakub sebagai pemimpin-pemimpin yang memberi petunjuk kepada bani israil dengan perintah kami dalam kitab taurat, zabur, dan injil, dan kami wahyukan kepada mereka, para nabi dan rasul itu perintah agar mereka berbuat kebaikan, melaksanakan salat, dan menunaikan zakat, dan kami menegaskan kepada mereka bahwa hanya kepada kami mereka menyembah dan hanya kepada kami pula mereka memohon pertolongan."
  }
]