[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menjadikan Ibrahim, Ishaq dan Ya’qub sebagai teladan baik bagi sekalian manusia. Dengan izinNya, mereka menyeru manusia untuk beribadah dan taat kepadaNya. Dan Kami mewahyukan kepada mereka untuk mengerjakan kebajikan-kebajikan berupa mengamalkan ajaran-ajaran para nabi, menegakkan shalat sebagaimana mestinya, dan membayar zakat. Maka mereka melaksanakannya. Dan mereka adalah orang-orang yang patuh dan taat kepada Allah semata, tidak kepada selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Dan Kami menjadikan mereka sebagai pemimpin-pemimpin yang diikuti manusia dalam berbuat kebaikan, yang menyeru manusia untuk beribadah hanya kepada Allah sesuai perintah-Nya, dan Kami wahyukan kepada mereka agar berbuat kebaikan, mendirikan salat secara sempurna, dan menunaikan zakat, dan hanya kepada Kami lah mereka menyembah dan taat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Dan Kami jadikan Ibrahim, Ishaq, dan Ya’qub sebagai teladan bagi orang lain; mereka memberi manusia petunjuk kepada agama dengan perintah Allah. Dan Kami wahyukan kepada mereka agar mengamalkan syariat-syariat agama, mendirikan shalat, dan menunaikan zakat; dan mereka adalah orang-orang yang ikhlas dalam beribadah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَجَعَلْنٰهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا (Kami telah menjadikan mereka itu sebagai pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami) Yakni para pemimpin yang menjadi panutan dalam kebaikan dan amal ketaatan sesuai dengan wahyu yang Kami turunkan. وَأَوْحَيْنَآ إِلَيْهِمْ فِعْلَ الْخَيْرٰتِ(dan telah Kami wahyukan kepada, mereka mengerjakan kebajikan) Yakni supaya mereka mengerjakan ketaatan. وَكَانُوا۟ لَنَا عٰبِدِينَ (dan hanya kepada Kamilah mereka selalu menyembah) Yakni yang menjalankan apa yang Kami perintahkan dan menjauhi apa yang Kami larang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Dan Kami jadikan mereka sebagai pemimpin-pemimpin yang membimbing menuju kebaikan dan ketaatan. Mereka menunjukkan manusia kepada agama dan keimanan dengan seizin Allah SWT. Dan Kami perintahkan mereka untuk taat, melakukan shalat, dan menunaikan zakat. Mereka itu adalah orang-orang yang bertauhid dan ikhlas dalam beribadah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjadikan mereka itu pemimpin-pemimpin} pemimpin-pemimpin yang mengarahkan mereka kepada kebaikaan {yang memberi petunjuk atas perintah Kami} yang menyeru menuju Allah dengan seizinNya {dan Kami memberi wahyu kepada mereka perbuatan baik, menegakkan shalat, dan menunaikan zakat, serta hanya kepada Kami mereka menyembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Di antara bentuk keshalihan mereka, bahwa Allah menjadikan mereka sebagai para pemuka umat manusia yang memandu jalan sesuai dengan perintahNya. Ini termasuk nikmat besar yang Allah anugerahkan kepada hambaNYa, menjadi panutan bagi orang-orang yang mendapatkan petunjuk, dan orang-orang berjalan di belakang untuk mengikutinya. Demikian ini, merupakan buah kesabaran mereka, dan mereka yakin terhadap ayat-ayat Allah. Firman Allah, “Yang memberi petunjuk dengan perintah Kami,” maksudnya mereka menunjuki umat manusia dengan agama Kami, tidak memerintahkan atas dasar hawa nafsu pribadi mereka. Akan tetapi, atas dasar perintah Allah, agamaNya, dan untuk mengikuti keridhaanNya. Seorang hamba tidak akan menjadi imam, sampai dia telah menyeru kepada perintah-perintah Allah. “Dan Kami telah mewahyukan kepada mereka mengerjakan kebajikan.” Mereka melakukannya dan menyeru orang-orang untuk mengerjakannya. Ini mencakup seluruh jenis kebaikan, baik berkaitan dengan hak-hak Allah maupun hak-hak manusia. “Mendirikan shalat dan menunaikan zakat,” ini masuk dalam kategori (penggabungan obyek yang khusus pada ungkapan yang cakupannya umum), lantaran kemulliaan dan keutamaan dua ibadah ini. Dan juga karena, orang yang telah menyempurnakan dua ibadah ini, maka dia telah melaksanakan agamanya. Barangsiapa yang menyia-nyiakannya, maka dia lebih menyia-nyiakan ibadah lainnya. Begitu pula, karena shalat adalah amalan paling utama yang menjadi hak Allah. Sementara (pembayaran) zakat, merupakan amalan paling utama yang mengandung curahan kebaikan pada makhlukNYa. “Dan (hanya) kepada Kami-lah mereka,” bukan kepada selain Kami “selalu menyembah,” maksudnya senantiasa menjaga peribadahan hati,ucapan, dan fisik di sebagian besar waktu mereka. Mereka berhak menerima gelar seagai orang yang beribadah. Sehingga mereka mempunyai sifat yang sesuai dengan perintah Allah kepada makhlukNya, dan Dia menciptakan mereka untuk tujuan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 73: Maksudnya, dengan agama Kami, bukan memerintah berdasarkan hawa nafsu mereka, tetapi berdasarkan perintah Allah dan agama-Nya, dan seorang hamba tidaklah menjadi imam (pemimpin) sampai ia mengajak manusia kepada Allah Subhaanahu wa Ta'aala. Yakni berbuat dan memerintahkannya, baik yang terkait dengan hak Allah maupun hak manusia. Hal ini termasuk pengathafan (penyertaan) yang khusus kepada yang umum (yaitu semua kebaikan). Disebutkan kedua ibadah ini meskipun sudah termasuk ke dalam kebaikan, karena kelebihan dan keutamaannya. Hal itu, karena barang siapa yang menyempurnakan keduanya sebagaimana yang diperintahkan, maka ia telah menegakkan agamanya, dan barang siapa yang menyia-nyiakan keduanya, maka berarti dia merobohkan agamanya. Jika keduanya telah ditinggalkan, maka perintah-perintah agama yang lain tentu lebih ditinggalkan lagi. Di samping itu, shalat adalah amal yang paling utama karena di sana terdapat hak Allah, dan zakat adalah amal yang paling utama, karena di sana terdapat hak hamba. Yakni sebagian besar waktu-waktu mereka diisi dengan ibadah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 73",
    "description": "Dan kami jadikan mereka itu, para nabi dan rasul keturunan ishak dan yakub sebagai pemimpin-pemimpin yang memberi petunjuk kepada bani israil dengan perintah kami dalam kitab taurat, zabur, dan injil, dan kami wahyukan kepada mereka, para nabi dan rasul itu perintah agar mereka berbuat kebaikan, melaksanakan salat, dan menunaikan zakat, dan kami menegaskan kepada mereka bahwa hanya kepada kami mereka menyembah dan hanya kepada kami pula mereka memohon pertolongan. 74. Dan kepada lut, yang berdomisili di sodom, palestina, kami beri-kan hikmah, kearifan dalam memutuskan perkara dan menetapkan hukuman dan ilmu yang bermanfaat dalam melaksanakan kewajiban kepada Allah dan kewajiban kepada sesama manusia. Dan kami pun telah menyelamatkan dia dari azab yang menimpa penduduk kota sodom dan gomorah yang telah melakukan perbuatan keji, homoseksual dan menyamun dengan terang-terangan. Sungguh mereka, umat nabi lut yang berbuat homoseksual dan menyamun itu adalah orang-orang yang jahat kepada sesama manusia, lagi fasik, menyalahi perintah Allah."
  }
]