[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami berikan kepada Luth karunia kenabian dan keahlian menetapkan hokum di antara orang-orang yang bersilisih serta ilmu tentang perintah Allah dan agamaNya. Dan Kami menyelamatkannya dari negerinya, Sadom, yang para penduduknya mengerjakan perbuatan-perbuatan yang keji. Sesungguhnya mereka itu menjadi orang-orang yang buruk dan jelek karena perbuatan-perbuatan keji dan kemungkaran yang mereka perbuat, juga keluar dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Dan kepada Lūṭ Kami berikan kemampuan menentukan keputusan antara orang-orang yang berselisih, Kami anugerahkan padanya ilmu tentang agamanya, dan menyelamatkannya dari azab yang Kami turunkan kepada negeri Sodom yang dahulu penduduknya melakukan perbuatan keji (homoseksual dan menyamun), sungguh mereka termasuk kaum yang buruk lagi tidak mentaati Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74-75. Dan Kami telah memberi Luth kenabian dan ilmu tentang hukum-hukum agama. Dan Kami telah menyelamatkannya dari penduduk negeri yang melakukan keburukan dan kekejian; mereka adalah orang-orang yang buruk yang enggan mentaati Allah. Dan Kami telah meliputi Luth dengan rahmat Kami yang luas, karena dia termasuk orang-orang yang shalih dan mentaati Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَلُوطًا ءَاتَيْنٰهُ حُكْمًا وَعِلْمًا (dan kepada Luth, Kami telah berikan hikmah dan ilmu) Makna (الحكم) yakni kenabian, dan makna (العلم) yakni pengetahuan dalam urusan agama. Pendapat lain mengatakan makna (الحكم) kemampuan untuk menyelesaikan perselisihan dengan benar. وَنَجَّيْنٰهُ مِنَ الْقَرْيَةِ الَّتِى كَانَت تَّعْمَلُ الْخَبٰٓئِثَ ۗ( dan telah Kami selamatkan dia dari (azab yang telah menimpa penduduk) kota yang mengerjakan perbuatan keji) Yakni kota Sodom. Dan yang dimaksud dengan (الخبائث) di sini adalah perbuatan seks sesama jenis dan perbuatan suka mengeluarkan kentut saat mereka dalam suatu perkumpulan. إِنَّهُمْ كَانُوا۟ قَوْمَ سَوْءٍ فٰسِقِينَ(Sesungguhnya mereka adalah kaum yang jahat lagi fasik) Yakni kaum yang berpaling dari ketaatan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Dan Kami anugerahkan kepada Luth wahyu kenabian dan ilmu tentang hikmah-hikmah agaman. Dan Kami selamatkan dia dari kota Sodom di sebelah timur Jordania yang penduduknya melakukan perbuatan keji (perbuatan munkar) seperti homo seksual, berbuat kerusakan di majelis-majelis, saling melempar kacang dan mempermainkan burung. Sesungguhnya mereka itu adalah kaum yang tidak taat kepada Allah SWT dengan merusak pergaulan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kepada Luth, Kami menganugerahkan hikmah} keutamaan di antara musuh {serta ilmu dan Kami menyelamatkannya dari negeri} negeri Sodom {yang melakukan perbuatan keji} perbuatan buruk yang tidak pantas, seperti homo seksual, memotong jalan dan hal lainnya {Sesungguhnya mereka adalah kaum yang jahat} orang yang berbuat kerusakan dan keburakan {lagi fasik (74)} tidak mau taat kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Ini adalah sanjungan dari Allah bagi RasulNya, Luth atas kepemilikan ilmu syar’I dan kemampuan menetapkan hukum di tengah manusia dengan benar dan lurus. Dan Allah mengutusnya kepada kaumnya untuk menyeru mereka kepada ibadah kepada Allah dan melarang mereka dari kebiasaan berbuat kekejian. Beliau senantiasa menyeru mereka, tapi mereka tidak menyambutnya. Kemudian Allah membalikkan kampung-kampung mereka dan menyiksa mereka sampa penghabisan. Lantaran “mereka adalah kaum yang jahat lagi fasik,” Allah menyelamatkan Luth dan keluarganya. Allah memerintahkan beliau untuk berjalan di malam hari bersama mereka agar mereka menjauh dari kampung halaman mereka. Lalu mereka berjalan dan selamat dengan karunia Allah dan keutamaan dariNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 74: Syaikh As Sa’diy berkata, “Ayat ini merupakan pujian Allah Subhaanahu wa Ta'aala terhadap Rasul-Nya Luth ‘alaihis salam dengan diberikan ilmu syar’i, memutuskan masalah yang terjadi di tengah-tengah manusia dengan tepat dan benar, dan bahwa Allah mengutusnya kepada kaumnya mengajak mereka beribadah kepada Allah dan melarang mereka berbuat keji. Beliau tinggal di tengah-tengah kaumnya berdakwah kepada mereka, namun kaumnya tidak mau memenuhi panggilannya, maka Allah membalikkan negeri mereka dan mengazab mereka sampai yang terakhirnya karena mereka adalah orang-orang yang jahat lagi fasik, mereka mendustakan orang yang mengajak mereka, mengancam untuk mengusirnya, dan kemudian Allah menyelamatkan Luth beserta keluarganya, Dia memerintahkan Luth untuk membawa pergi keluarganya di malam hari agar mereka menjauhi negeri itu, maka mereka pun pergi di malam hari dan selamat karena karunia Allah dan nikmat-Nya kepada mereka.” Yakni kebijaksanaan dalam memutuskan perkara antara orang-orang yang berselisih. Maksudnya, homoseksual, menyamun (mengadakan perampokan) serta mengerjakan perbuatan tersebut dengan terang-terangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 74",
    "description": "Dan kepada lut, yang berdomisili di sodom, palestina, kami beri-kan hikmah, kearifan dalam memutuskan perkara dan menetapkan hukuman dan ilmu yang bermanfaat dalam melaksanakan kewajiban kepada Allah dan kewajiban kepada sesama manusia. Dan kami pun telah menyelamatkan dia dari azab yang menimpa penduduk kota sodom dan gomorah yang telah melakukan perbuatan keji, homoseksual dan menyamun dengan terang-terangan. Sungguh mereka, umat nabi lut yang berbuat homoseksual dan menyamun itu adalah orang-orang yang jahat kepada sesama manusia, lagi fasik, menyalahi perintah Allah. 75. Walaupun nabi lut hidup di tengah masyarakat homoseksual, beliau tidak terpengaruh, karena mendapat rahmat Allah. Dan kami masukkan dia ke dalam rahmat kami yang membentenginya dari pengaruh buruk. Sesungguhnya dia terlindungi dari kejahatan, karena dirinya termasuk golongan orang yang saleh, beriman, dan senantiasa menaati perintah Allah."
  }
]