[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menyempurnakan karunia bagi Luth, maka Dia memasukannya ke dalam rahmatNya dengan menyelamatkannya dari azab yang menimpa kaumnya. Sebab, sesungguhnya dia termasuk orang-orang yang mengerjakan amal ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Dan Kami masukkan dia ke dalam rahmat Kami tatkala Kami selamatkan dia dari azab yang menimpa kaumnya, sungguh ia termasuk orang saleh yang mengerjakan perintah dan menjauhi larangan Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَأَدْخَلْنٰهُ فِى رَحْمَتِنَآ ۖ (Kami masukkan dia ke dalam rahmat Kami) Dengan Kami selamatkan dia dari kaum tersebut. إِنَّهُۥ مِنَ الصّٰلِحِينَ(karena sesungguhnya dia termasuk orang-orang yang saleh) Yakni orang-orang yang telah mendapat ketetapan baik dari Kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Lalu Kami jadikan dia (Luth) termasuk orang yang mendapat rahmatKu dengan menolongnya dari kaumnya. Sesungguhnya dia termasuk orang-orang yang shalih amalnya yang Kami beri kebaikan (surga) terlebih dahulu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami memasukkannya ke dalam rahmat Kami. Sesungguhnya dia termasuk golongan orang-orang yang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. “Dan Kami masukkan dia ke dalam rahmat Kami,” yang mana barangsiapa telah memasukinya, maka dia termasuk golongan orang-orang yang aman dari segala rasa takut, yang berhasil menggapai segenap macam kebaikan, kebahagiaan, kebajikan, dan kegembiraan, serta pujian. Hal demikian ini, lantaran dia masuk dalam kalangan orang-orang shalih, yang amalan-amalan mereka telah baik, dan keadaan-keadaan jiwa mereka sudah suci, serta Allah telah memperbaiki orang yang rusak dari kalangan mereka. Keshalihan (jiwa dan amalan) itulah yang menjadi faktor penyebab masuknya seorang hamba ke dalam rahmat Allah. Sebagaimana halnya, kerusakan (jiwa dan amalan) adalah faktor terhalanginya (seorang hamba) dari rahmat dan kebaikan dariNYa. Orang yang paling besar keshalihannya, ialah para nabi. Karena itu Allah menyifati merekka dengan keshalihan. Sulaiman berkata, \"dan masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang saleh\". (An-Naml:19)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 75: Di mana orang yang masuk ke dalam rahmat-Nya akan berada dalam keamanan dari semua yang dikhawatirkan, memperoleh semua kebaikan, kebahagiaan, kebajikan, kesenangan dan pujian. Hal itu, karena dia termasuk orang-orang yang saleh, orang-orang yang baik amalnya dan bersih keadaannya. Kesalehan merupakan sebab seorang hamba masuk ke dalam rahmat Allah, sebagaimana kebalikannya (tidak saleh atau fasik) adalah sebab terhalangnya dari rahmat dan kebaikan, dan manusia yang paling saleh adalah para nabi ‘alaihimush shalaatu was salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 75",
    "description": "Walaupun nabi lut hidup di tengah masyarakat homoseksual, beliau tidak terpengaruh, karena mendapat rahmat Allah. Dan kami masukkan dia ke dalam rahmat kami yang membentenginya dari pengaruh buruk. Sesungguhnya dia terlindungi dari kejahatan, karena dirinya termasuk golongan orang yang saleh, beriman, dan senantiasa menaati perintah Allah. 76. Dan ingat serta jadikanlah pelajaran kisah nuh, sebelum ibrahim dan lut, ketika dia berdoa, 'ya tuhanku, janganlah engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi, ' (lihat surah n'h/71: 26) karena mereka menolak beriman kepada Allah. Kami mengabulkan doa-Nya, dengan menurunkan hujan dan banjir besar hingga orang-orang kafir itu tenggelam. Lalu kami menyelamatkan dia bersama pengikutnya, orang-orang beriman yang bersama beliau dalam kapal, dari bencana, banjir, yang besar, kecuali istri dan seorang anaknya."
  }
]