[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah menolongnya dari makar kaumnya yang mendustakan ayat-ayat Kami yang menunjukkan kebenarannya. Sesungguhnya mereka itu orang-orang jahat. Lalu Kami tenggelamkan mereka semua dengan banjir besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Dan kami juga menyelamatkannya dari tipu daya kaum yang mendustakan tanda-tanda kebesaran Kami yang menunjukkan kebenarannya. Sungguh mereka adalah kaum yang rusak lagi jahat, maka Kami pun membinasakan mereka semua dengan cara ditenggelamkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Dan Kami telah menolong Nuh dari tipu daya orang-orang kafir dengan menenggelamkan mereka semua pada banjir bandang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. وَنَصَرْنٰهُ مِنَ الْقَوْمِ الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَآ ۚ (Dan Kami telah menolongnya dari kaum yang telah mendustakan ayat-ayat Kami) Yakni Kami lindungi dia dari kaumnya agar mereka tidak dapat menyakitinya. إِنَّهُمْ كَانُوا۟ قَوْمَ سَوْءٍ فَأَغْرَقْنٰهُمْ أَجْمَعِينَ(Sesungguhnya mereka adalah kaum yang jahat, maka Kami tenggelamkan mereka semuanya) Kami tidak menyisakan mereka seorangpun, Kami tenggelamkan pembesar dan orang kecil dari mereka akibat kebebalan mereka dalam perbuatan dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Dan Kami jadikan dia menang atas orang-orang yang mendustakan ayat-ayat kami yang menunjukkan pada kebenaran risalahnya. Sesungguhnya mereka itu adalah kaum yang kafir dan berbuat maksiat. Dan Kami tenggelamkan mereka semua karena keteguhan mereka atas kekufuran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menolongnya dari kaum yang telah mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah kaum yang jahat, maka Kami menenggelamkan mereka semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76-77. Maksudnya, ingatlah hamba dan rasul Kami, Nuh sambil menyanjung dan memujinya, ketika Allah mengirimnya sebagai rasul kepada kaumnya. Beliau tinggal selama Sembilan ratus lima puluh tahun. Menyeru mereka agar beribadah kepada Allah dan melarang mereka dari praktik syirik denganNYa. Beliau menyampaikan nasihat kepada mereka dan mengulang-ulangnya. Mendakwahi mereka secara sembunyi-sembunyi dan terang-terangan, siang dan malam. Ketika beliau memandang nasihat tidak mempan untuk mereka, larangan tidak bermanfaat bagi mereka, maka beliau memanggil Rabbnya dengan memanjatkan, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi. Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka tidak akan melahirkan selain anak yang berbuat maksiat lagi sangat kafir.\" (Nuh:26-27). Allah mengabulkan permohonannya. Maka Allah menenggelamkan mereka tanpa menyisakan satu pun dari mereka. Allah menyelamatkan Nuh dan keluarganya serta orang-orang beriman yang bersama beliau dengan kapal yang penuh muatan. Allah menjadikan keturunan Nuh sebagai orang-orang yang menikmati kehidupan selanjutnya dan menolong beliau terhadap bahaya kaumnya yang mengolok-olok."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 77",
    "description": "Dan kami telah menolongnya, nuh dan orang-orang beriman yang setia kepada beliau, dari orang-orang kafir yang telah mendustakan ayat-ayat kami yang diwahyukan kepada nuh dan disampaikan kepada mereka. Sesungguhnya mereka dengan menolak beriman kepada Allah, menghina utusan Allah, dan mengancamnya adalah orang-orang yang berbuat jahat kepada sesama manusia, maka kami menenggelamkan me-reka semuanya termasuk istri dan anak nabi nuh. 78. Dan perhatikan kisah dawud dan sulaiman, dua orang nabi dan rasul yang juga raja di palestina, ketika keduanya memberikan keputusan mengenai kasus sebuah ladang milik seorang petani yang diajukan kepada beli-au, karena ladang itu dirusak oleh kambing-kambing milik peternak kaumnya. Nabi dawud berpendapat bahwa domba-domba itu diserahkan kepada pemilik kebun, karena harganya dinilai sama dengan tanaman yang dirusaknya sebagai ganti tanaman yang rusak. Nabi sulaiman memutuskan agar kambing-kambing itu diserahkan sementara kepada pemilik tanaman untuk diambil manfaatnya, minyak dan bulunya, dan pemilik kambing diharuskan mengganti tanaman itu dengan tanaman yang baru. Apabila tanaman yang baru telah dapat diambil hasilnya, pemilik kambing itu boleh mengambil kambingnya kembali sehingga keduanya tidak kehilangan milik mereka masing-masing. Dan kami menyaksikan keputusan yang diberikan oleh mereka itu tepat, namun keputusan sulaiman lebih memenuhi rasa keadilan."
  }
]