[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Rasul) Nabi Allah Dawud dan putranya, sulaiman, ketika mereka berdua menetapkan keputusan dalam satu permasalahan yang diajukan dua orang yang tengah bersengketa. Kambing milik salah seorang dari mereka berdua menginjak-nginjak ladang yang lain. Kambing-kambing itu menyebar di dalamnya pada malam hari sehingga merusak tanam-tanamannya. Dawud memutuskan bahwa kambing itu menjadi milik sang pemilik ladang sebagai ganti tanaman yang telah dirusak, (karena) harga keduanya sama. Dan Kami menyaksikan keputusan hokum mereka berdua, hal itu tidak samar dari Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Dan ingatlah -wahai Rasul- kisah Daud dan putranya Sulaiman ketika mereka berdua memberi keputusan yang dilimpahkan kepada mereka tentang perkara dua orang yang bertikai; salah satunya memiliki kambing yang keluar dari kandangnya pada malam hari hingga merusak kebun orang kedua, dan Kami menyaksikan keputusan mereka berdua, dan sama sekali tidak tersembunyi dari Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78-80. Dan ingatlah Nabi Dawud dan Sulaiman ketika mereka menetapkan hukum bagi dua orang yang berselisih karena kambing salah seorang di antara mereka memasuki kebun orang yang satunya pada malam hari sehingga kambing itu merusak tanaman. Kami Melihat hukum yang mereka tetapkan, dan Kami telah memberi Sulaiman pemahaman. Kami telah memberi Dawud dan Sulaiman kenabian dan ilmu yang bermanfaat dalam perkara agama. Kami tundukkan gunung-gunung dan burung untuk bertasbih bersama Dawud, dan Kami Maha Kuasa untuk melakukan hal demikian dan yang semisalnya. Dan Kami ajarkan Dawud cara membuat baju besi dengan menjadikan besi itu dapat meleleh dan lentur baginya, agar baju besi itu dapat melindungi kalian dalam peperangan dari senjata musuh kalian, maka apakah kalian akan mensyukuri nikmat-Ku wahai manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَدَاوُۥدَ وَسُلَيْمٰنَ إِذْ يَحْكُمَانِ فِى الْحَرْثِ (Dan (ingatlah kisah) Daud dan Sulaiman, di waktu keduanya memberikan keputusan mengenai tanaman) Terdapat pendapat mengatakan yang dimaksud adalah keputusan mengenai sebuah kebun. Pendapat lain mengatakan, yakni mengenai sebuah pohon anggur. إِذْ نَفَشَتْ فِيهِ غَنَمُ الْقَوْمِ(karena tanaman itu dirusak oleh kambing-kambing kepunyaan kaumnya) Makna (النفش) adalah kambing yang lepas pada malam hari tanpa pengawasan seorang penggembala, sehingga kambing itu memakan dan merusak tanaman. وَكُنَّا لِحُكْمِهِمْ شٰهِدِينَ(Dan Kami menyaksikan keputusan yang diberikan oleh mereka itu) Yakni keputusan dari hakim bagi orang-orang yang saling berselisih. Makna (الشاهدين) yakni ikut hadir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Ingatlah juga (kisah) Dawud dan Sulaiman. Ketika keduanya menentukan keputusan tentang tanaman yang dimakan oleh kambing-kambing kaumnya pada malam hari sedangkan kambing-kambing itu tidak diawasi oleh seorang penggembala. Kami hadir dalam keputusan keduanya. Tidak ada satupun yang luput dari Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dawud dan Sulaiman ketika mereka memberikan keputusan tentang ladang} tentang hak suatu tanaman {ketika dirusak oleh kambing-kambing milik kaumnya} kambing-kambing kaum lain menyebar di sana pada malam hari tanpa pengawasan sehingga menghancurkan lading itu {Kami menyaksikan keputusan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Maksudnya, ingatlah dua nabi [yang mulai] ini, Dawud dan Sulaiman unttuk menyanjung dan menghormati keduanya; saat Allah menganugerahkan kepada mereka berdua ilmu yang luas, kemampuan menetapkan hukum di tengah manusia, dengan dasar FirmanNya, “Di waktu keduanya memberikan keputusan mengenai tanaman, karena tanaman itu dirusak oleh kambing-kambing kepunyaan kaumnya,” maksudnya, ketika ada seorang pemilik tanaman meminta kepastian hukum kepada mereka berdua, mengenai seekor kambing milik seseorang yang memasuki kebun orang lain. Yakni, berkelliaran di malam hari dan memakan segala yang ada di pohon-pohonnya dan merusak tanamannya. Maka Dawud menetapkan keputusan agar kambing tersebut menjadi milik pemilik kebun, karena mempertimbangkan keteledoran pemilik kambing itu. Sehingga di hukum denngan hukuman ini. Sementara Sulaiman menetapkkan sebuah hukum yang sesuai dengan benar. Yaitu, supaya para pemilik kambing menyerahkan hewan-hewan mereka kepada pemilik kebun agar dapat memanfaatkan air susu dan bulunya. Sementara para pemilik kambing itu, mengelola lading yang dimiliki oleh pemilik kebun sampai keadaannya kembali seperti semula. Jika sudah kembali seperti semula, maka kedua belah pihak saling mengembalikan milik orang lain dan masing-masing menerima hartannya kembali. Hasil keputusan ini (cerminan) kesempurnaan daya tangkap dan kecerdasan beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 78",
    "description": "Dan perhatikan kisah dawud dan sulaiman, dua orang nabi dan rasul yang juga raja di palestina, ketika keduanya memberikan keputusan mengenai kasus sebuah ladang milik seorang petani yang diajukan kepada beli-au, karena ladang itu dirusak oleh kambing-kambing milik peternak kaumnya. Nabi dawud berpendapat bahwa domba-domba itu diserahkan kepada pemilik kebun, karena harganya dinilai sama dengan tanaman yang dirusaknya sebagai ganti tanaman yang rusak. Nabi sulaiman memutuskan agar kambing-kambing itu diserahkan sementara kepada pemilik tanaman untuk diambil manfaatnya, minyak dan bulunya, dan pemilik kambing diharuskan mengganti tanaman itu dengan tanaman yang baru. Apabila tanaman yang baru telah dapat diambil hasilnya, pemilik kambing itu boleh mengambil kambingnya kembali sehingga keduanya tidak kehilangan milik mereka masing-masing. Dan kami menyaksikan keputusan yang diberikan oleh mereka itu tepat, namun keputusan sulaiman lebih memenuhi rasa keadilan. 79. Dan kami telah memberikan pengertian yang mendalam kepada sulaiman tentang keputusan yang lebih tepat dan lebih memenuhi rasa keadilan dalam sengketa petani dan pemilik domba. Dan kepada masing-masing, dawud dan sulaiman, kami berikan hikmah, pemaham-an agama yang mendalam, dan ilmu pengetahuan tentang hidup dan kehidupan duniawi. Dan kami tundukkan gunung-gunung dan burung-burung agar mengikuti perintah dawud; semua gunung dan burung itu, senantiasa bertasbih kepada Allah bersama dawud. Dan kamilah yang melakukan semua itu sebagai rahmat kepada-Nya."
  }
]