[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami memberikan pemahaman kepada Sulaiman untuk menimbang-nimbang kemaslahatan kedua belah pihak dengan putusan yang adil. Dia menetapkan putusan terhadap pemilik kambing untuk memperbaiki tanaman yang rusak dalam jangka waktu yang dia butuhkan, seiring pemilik tanaman mendapatkan manfaat-manfaat dari kambing itu berupa susu, bulu, dan manfaat lainnya dalam masa itu. Kemudian kambing itu kembali ke pemiliknya; demikian juga tanaman itu kembali kepada pemiliknya; dikarenakan setaranya nominal harga tanaman yang rusak dengan manfaat kambing yang didapat. Dan masing-masing dari mereka berdua, Dawud dan Sulaiman, Kami berikan kepada mereka keahlian dalam hokum dan ilmu, dan Kami anugerahkan kepada Dawud dengan ditundukannya gunung-gunung yang bertasbih bersamanya, jika Dawud bertasbih. Begitu pula burung-burung pun bertasbih. Dan Kami-lah yang melakukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Maka Kami memberikan pemahaman tentang perkara tersebut kepada Sulaiman tanpa diberikan kepada ayahnya Daud. Dan kepada masing-masing mereka Kami berikan kenabian, ilmu, dan hukum-hukum syariat, dan tidak mengistimewakan Sulaiman saja. Dan Kami tundukkan gunung-gunung dan burung-burung bersama Daud, mereka bertasbih bersamanya, dan Kamilah yang memberikan mereka hal tersebut berupa pemahaman, hikmah, ilmu dan ketundukkan makhluk-makhluk tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. فَفَهَّمْنٰهَا سُلَيْمٰنَ ۚ (maka Kami telah memberikan pemahaman kepada Sulaiman) Para ahli tafsir menyebutkan: pemillik tanaman dan pemilik kambing mendatangi nabi Dawud; kemudian pemilik tanaman berkata: “kambing orang ini lepas di malam hari, lalu memakan tanamanku sampai habis.” Maka Nabi Dawud berkata: “maka kambing itu jadi milikmu.” Namun Nabi Sulaiman menyanggah: “atau dengan keputusan yang lain; pemilik tanaman boleh membawa kambing dan mengambil susu dan manfaat lainnya dari kambing, dan pemilik kambing harus mengurus tanaman sampai tanaman itu tumbuh seperti saat kambing itu lepas pada malam tersebut, kemudian pemilik tanaman mengembalikan kambingnya dan pemilik kambing mengembalikan urusan tanamannya.” Maka Nabi Dawud berkata: “keputusannya adalah sebagaimana keputusanmu.” Dan akhirnya dia memutuskan dengan keputusan Nabi Sulaiman. Adapun ketentuan dalam syari’at kita, telah disebutkan dalam hadits dari al-Barra’ bahwa Rasulullah mensyariatkan bagi umatnya bahwa pemilik hewan ternak harus menjaga ternaknya pada malam hari dan pemilik kebun harus menjaga kebunnya pada siang hari. Apabila hewan ternak merusak kebun pada malam hari maka pemilik ternak harus membayar ganti ruginya sesuai dengan tanaman yang rusak atau sesuai harganya. وَكُلًّا ءَاتَيْنَا حُكْمًا وَعِلْمًا (dan kepada masing-masing mereka telah Kami berikan hikmah dan ilmu) Yakni keduanya telah Kami berikan hikmah dan ilmu yang banyak, dan bukan hanya kepada Nabi Sulaiman saja. Hal ini agar tidak ada yang mengira rendahnya ilmu Nabi Dawud. وَسَخَّرْنَا مَعَ دَاوُۥدَ الْجِبَالَ يُسَبِّحْنَ(dan telah Kami tundukkan gunung-gunung, semua bertasbih bersama Daud) Dahulu jika Nabi Daud bertasbih maka gunung-gunung juga bertasbih bersamanya. وَالطَّيْرَ ۚ (serta burung-burung) Burung-burung yang terbang juga bertasbih bersamanya. وَكُنَّا فٰعِلِينَ (Dan kamilah yang melakukannya) Yakni Kami yang memberi mereka pemahaman dan hikmah dan Kami yang menundukkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Lalu Kami beri Sulaiman pemahaman tentang hukum untuk menjadi wakil Dawud. Dan Kami anugerahkan Sulaiman wahyu kenabian dan ilmu yang bermanfaat dalam urusan-urusan agama. Dan Kami tundukkan (rendahkan) gunung-gunung dan burung-burung bersama Dawud, supaya mereka bisa bertasbih dengannya, sehingga ketika dia bertasbih, semuanya ikut bertasbih bersamanya sesuai perintahnya. Dan Kamilah yang melakukan semua itu, yaitu pemberian pemahaman tentang hukum dan penundukkan gunung dan burung agar bertasbih bersamanya. Dan tidak ada yang bisa melakukannya selain Kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami memberi pemahaman kepada Sulaiman} Kami memberi pemahaman kepada Sulaiman tentang keputusan itu tanpa adanya Dawud {dan kepada masing-masing Kami memberi hikmah} kenabian {dan ilmu. Kami menundukkan} menundukkan {gunung-gunung dan burung-burung bertasbih bersama Dawud. Kamilah yang melakukannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Oleh karenanya, Allah berfiman, “Maka Kami telah memberikan pengertian kepada Sulaiman tentang hukum (yang lebih tepat),” maksudnya Kami menjadikannya memahami problematika tersebut. Bukan berarti Allah tidak memahamkan Dawud dalam masalah lainnya. Sebab itu, Allah menyebutkan masalah ini secara khusus. Dalilnya adalah Firman Allah, “Dan kepada masing-masing mereka,” yaitu Dawud dan Sulaiman, Kami telah menganugerahkan kepada keduanya “hikmah dan ilmu.” Hal ini menjadi dalil bahwa hakim terkadang keputusannya benar dan tepat, dan kadang-kadang mengalami kesalahan. Tetapi, dia tidak tercela saat bersikap salah dalam mengambil keputusan jika telah mengerahkan segala daya dan upaya yang dimilikinya. Berikutnya, Allah menyebutkan sisi yang menjadi keistimewaan masing-masing dari mereka beerdua. Allah berfirman, “Dan telah Kami tundukkan gunung-gunung dan burung-burung, semua bertasbih bersama Dawud.” Demikian ini, lantaran beliau termasuk orang yang paling tekun beribadah dan paling sering dalam berdzikir, bertasbih dan mengagungkan Allah. Allah telah memberinya karunia berupa suara yang bagus, lembut dan merdu yang tidak dikaruniakan kepada siapa pun. Dahulu, apabila beliau melantunkan tasbih dan pujian terhadap Allah, niscaya gunung-gunung yang bisu dan burung-burung yang tidak dapat berbicara ikut meresponnya. Ini termasuk bagian dari karunia Allah dan kebaikanNya yang tercurah kepada Dawud. Karenanya, Allah berfirman “Dan Kami-lah yang melakukannya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 79: Menurut riwayat Ibnu Abbas bahwa sekelompok kambing telah merusak tanaman di waktu malam. Maka yang punya tanaman mengadukan hal ini kepada Nabi Dawud ‘alaihis salam. Nabi Dawud kemudian memutuskan bahwa kambing-kambing itu harus diserahkan kepada yang punya tanaman sebagai ganti tanam-tanaman yang rusak. Tetapi Nabi Sulaiman ‘alaihis salam memutuskan agar kambing-kambing itu diserahkan sementara kepada yang punya tanaman untuk diambil manfaatnya. Sedangkan orang yang punya kambing diharuskan mengganti tanaman itu dengan tanam-tanaman yang baru. Apabila tanaman yang baru telah dapat diambil hasilnya atau seperti keadaan sebelumnya, mereka yang mempunyai kambing itu boleh mengambil kambingnya kembali. Keputusan Nabi Sulaiman ‘alaihis salam ini adalah keputusan yang tepat. Kalimat, “Maka Kami memberikan pengertian kepada Sulaiman tentang hukum yang tepat,” tidaklah menunjukkan bahwa Nabi Dawud tidak diberikan kepahaman pada selain masalah ini. Oleh karena itulah, Allah Subhaanahu wa Ta'aala dalam lanjutan ayat-Nya berfirman, “dan kepada masing-masing Kami berikan hikmah dan ilmu”. Ayat di atas juga menjelaskan, bahwa hakim terkadang benar dan terkadang salah, dan ia tidaklah tercela apabila salah setelah mengeluarkan kesungguhannya dalam berijtihad. Yakni kenabian. Tentang masalah-masalah agama. Dawud adalah di antara manusia yang paling banyak beribadah kepada Allah, paling banyak dzikrnya, tasbih dan tahmidnya, bahkan Allah memberikan suara yang bagus kepadanya, sehingga ketika Beliau bertasbih dan memuji Allah, maka gunung-gunung dan burung-burung ikut menjawab. Hal ini merupakan karunia Allah dan ihsan-Nya kepadanya, oleh karena itu, Dia mengatakan, “Dan Kamilah yang melakukannya.” Maksudnya, yang menundukkan keduanya untuk bertasbih bersama Dawud meskipun menurut kamu sebagai sesuatu yang aneh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 79",
    "description": "Dan kami telah memberikan pengertian yang mendalam kepada sulaiman tentang keputusan yang lebih tepat dan lebih memenuhi rasa keadilan dalam sengketa petani dan pemilik domba. Dan kepada masing-masing, dawud dan sulaiman, kami berikan hikmah, pemaham-an agama yang mendalam, dan ilmu pengetahuan tentang hidup dan kehidupan duniawi. Dan kami tundukkan gunung-gunung dan burung-burung agar mengikuti perintah dawud; semua gunung dan burung itu, senantiasa bertasbih kepada Allah bersama dawud. Dan kamilah yang melakukan semua itu sebagai rahmat kepada-Nya. 80. Pada ayat ini Allah menyebutkan karunia lain yang diberikan kepada nabi dawud. Dan kami ajarkan pula kepada dawud cara membuat baju besi untukmu dan prajurit-prajurit kamu guna melindungi kamu dan mereka dalam peperangan yang kamu pimpin. Apakah kamu dengan menerima karunia Allah yang besar ini termasuk hamba yang bersyukur kepada Allah'."
  }
]