[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidak menjadikan rasul-rasul sebelummu berbeda dari tabiat manusia, yang tidak membutuhkan makanan dan minuman. Dan mereka tidak kekal abadi yang tidak akan mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan Kami tidak menjadikan rasul-rasul yang Kami utus itu sebagai manusia yang memiliki jasad yang tidak mengkonsumsi makanan, tetapi mereka juga makan seperti manusia lainnya, serta mereka juga tidaklah hidup kekal di dunia ini tanpa mengalami kematian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَمَا جَعَلْنٰهُمْ جَسَدًا لَّا يَأْكُلُونَ الطَّعَامَ (Dan tidaklah Kami jadikan mereka tubuh-tubuh yang tiada memakan makanan) Yakni para rasul adalah teladan bagi manusia yang lain dalam menjalani tabiat mereka; para rasul tersebut makan sebagaimana orang lain butuh makan dan minum sebagaimana orang lain butuh minum; sebab tubuh setiap manusia tidak dapat terlepas dari makanan dan minuman, begitu pula para Rasul. وَمَا كَانُوا۟ خٰلِدِينَ(dan tidak (pula) mereka itu orang-orang yang kekal) Namun mereka juga mati sebagaimana orang lain mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kami tidak menjadikan mereka sebagai jasad yang bertentangan dengan watak dasar manusia dimana mereka hidup seperti malaikat yang yang tidak makan dan minum. Mereka juga tidak hidup abadi di dunia, tapi mereka mati layaknya manusia selain mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menjadikan mereka} Kami tidak menjadikan para rasul itu {sebagai jasad} orang yang berjasad {yang tidak memakan makanan. Mereka juga tidak kekal} abadi di dunia dan tidak mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-9. Ini merupakan sanggahan atas lontaran syubhat kalangan orang-orang yang mendustakan Rasulullah. Mereka berkomentar, “Kenapa dia (seorang rasul) bukan seorang malaikat yang tidak membutuhkan makanan dan minuman serta mondar-mandir berurusan dengan pasar-pasar! Kenapa dia tidak abadi!” bila dia tidak demikian, berarti menunjukkan dia bukan seorang utusan Allah.” Rangkaian syunhat ini, masih saja menancap di hati-hati kaum yang mendustakan para rasul. Mereka serupa dalam kekufuran, sehingga pernyataan-pernyataan mereka pun senada. Berikutnya, Allah menangkis syuhat orang-orang yang mendustakan Rasulullah, (namun) mengakui penetapan eksistensi para rasul sebelum beliau. Kalau tida ada Nabi melainkan Nabi Ibrahim saja –yang telah diakui kenabbiannya oleh seluruh golongan, yang mana kaun musyrikin melancarkan klaim berpegang teguh pada agama dan ajaran Ibrahim bahwa para rasul sebelum Muhammad semuanya dari kalangan manusia, yang makan makanan, dan berjalan-jalan di pasar-pasar, dan muncul kejadian-kejadian manusiawi yang menimpa mereka seperti kematian dan kejadian lainnya, serta bahwa Allah telah mengutuus mereka kepada kaum dan ummat mereka; lalu sebagian beriman kepada mereka, dan adapula yang mendustakan, dan bahwa Allah benar-benar akan merealisasikan bagi mereka sesuatu yang telah dijanjikan, berupa keselamatan dan kebahagiaan bagi mereka (para utusan Allah) dan para pengikut, dan akan membinasakan orang-orang yang melampaui batas, lagi mendustakan mereka-, maka mengapa banyak syubhat batil yang diarahkan kepada Muahammad dalam rangka mengingkari risalahnya, padahal realita-realita itu melekat pada para saudaranya dari kalangan para rasul yang diakui oleh para pendusta kenabian Muhammad? Ini adalah konsekuensi yang begitu jelas bagi mereka. Jika mereka mengakui kerasulan dari kalangan manusia, namun tidak mau menetapkan seorang rasul dari selain kalangan manusia, maka berarti syubhat mereka (tentang Nabi Muhammad) batil. Mereka telah mematahkannya sendiri dengan pengakuan mereka mengenai rusaknya syubhat mereka dan adanya kontradiksi di tengah (pola pikir) mereka tentang itu. Andai alangkah mereka ini diprediksi menuju pengingkaran kenabian dari kalangan manusia seutuhnya, tidak ada satu pun nabi, melainkan seorang malaikat yang abadi, tidak makan makanan, maka sungguh Allah telah menyanggah syubhat ini dengan FirmanNYa, \"Dan mereka berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) seorang malaikat?\" dan kalau Kami turunkan (kepadanya) seorang malaikat, tentu selesailah urusan itu, kemudian mereka tidak diberi tangguh (sedikit pun). Dan kalau Kami jadikan rasul itu (dari) malaikat, tentulah Kami jadikan dia berupa laki-laki dan (jika Kami jadikan dia berupa laki-Iaki), Kami pun akan jadikan mereka tetap ragu sebagaimana kini mereka ragu.\" (Al-An’am:8-9) Dan bahwa manusia tidak mempunyai kekuatan dalam menerima wahyu dari malaikat (secara langsung), \"Katakanlah: \"Kalau seandainya ada malaikat-malaikat yang berjalan-jalan sebagai penghuni di bumi, niscaya Kami turunkan dari langit kepada mereka malaikat menjadi rasul\". (Al-Isra:95). Jikalau timbul keraguan pada kalian, dan kalian tidak mengetahui selu-beluk para rasul yang sudah lewat, hendaknya mereka bertanya kepada orang-orang yang berilmu tentang kitab-kitab yang terdahulu. Misalnya, para ulama yang menguasai Taurat dan INjil. Mereka bakal memberitahukan tentang ilmu yang mereka miliki kepada kalian, dan bahwa seluruh rasul adalah manusia yang berasal dari jenis bangsa yang diberikan risalah (obyek dakwah). Ayat ini, meskipun sebabnya khusus mengenai pertanyaan tentang jatii diri para rasul yang telah berlalu kepada ahli dzikir, yaitu ulama, tapi sesungguhnya konteksnya umum, mencakup setiap permasalahan agama, perkara yang inti atau cabangnya. Jika seseorang tidak mempunyai pengetahuan tentangnya, hendaknya dia menanyakannya kepada orang yang mengetahuinya. Dalam keterangan ini terkandung pelajaran, adanya perintah untuk belajar dan bertanya kepada ulama. Tidaklah diperintahkan untuk bertanya kepada mereka (ulama) melainkan karena mereka wajib mengajarkan ilmu dan menjawab permasalahan yang mereka ketahui. Di dalam pengkhususan melontarkan pertanyaan kepada ulama, terkandung larangan bertanya kepada orang yang sudah dikenal dengan kebodohannya dan tida berilmu. Di dalamnya juga terkandung larangan bagi orang yang bodoh untuk memposisikan diri untuk menjawab. Dalllam ayat ini termuat sebuah dalil bahwa tidak ada nabi dari kalangan wanita, termasuk Maryam atau lainnya bukan nabi. Hal ini berdasarkan Firman Allah, “Melainkan beberapa orang laki-laki.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 8",
    "description": "-9. Kemudian kami tepati janji, yang telah kami janjikan tentang pertolongan dan keselamatan kepada mereka, para rasul dan pengikut-pengikutnya yang beriman. Maka kami selamatkan mereka dan orang-orang yang kami kehendaki di antara umat para rasul itu karena keimanannya; dan kami binasakan dengan bencana alam orang-orang yang melampaui batas, karena kekafiran mereka kepada Allah."
  }
]