[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah mengistimewakan Dawud dengan mengajarkannya cara membuat baju besi yang dia buat dalam bentuk kepingan bulat yang saling terkait satu sama lainnya yang memudahkan tubuh untuk bergerak; yang berfungsi melindungi para pasukan perang dari sabetan senjata pada tubuh mereka. Maka apakah kalian bersyukur terhadap nikmat Allah yang tercurah pada kalian ketika Dia kirimkan melalui tangan Dawud?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Dan Kami ajarkan pula kepada Daud cara membuat baju besi -tanpa mengajarkannya pada Sulaiman- untuk melindungi jasad kalian dari sabetan senjata, maka apakah kalian -wahai sekalian manusia-, mensyukuri nikmat yang Allah karuniakan kepada kalian ini?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَعَلَّمْنٰهُ صَنْعَةَ لَبُوسٍ لَّكُمْ (Dan telah Kami ajarkan kepada Daud membuat baju besi untuk kamu) Yakni baju perang. لِتُحْصِنَكُم مِّنۢ بَأْسِكُمْ ۖ( guna memelihara kamu dalam peperanganmu) Atau dari pukulan senjata yang mengarah kepada kalian. فَهَلْ أَنتُمْ شٰكِرُونَ(Maka hendaklah kamu bersyukur) Atas kenikmatan yang telah Kami berikan kepada kalian?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini pada hakikatnya menjelaskan tentang keyakinan seorang mukmin terhadap usaha dan sebab suatu kejadian, dan ia sejalan dengan pemikiran orang-orang berakal, bukan keyakinan orang-orang bodoh; karena sesungguhnya sebab kejadian telah menjadi ketentuan Allah pada ciptaan-Nya; barangsiapa yang mencelanya, maka ia telah mencela kitab-Nya dan sunnah rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Dan Kami ajarkan kepada Dawud membuat baju besi dengan melunakkan besi baginya untuk memelihara dan melindungi kalian dalam peperangan kalian melawan musuh. Apakah kalian wahai manusia dan penduduk Mekah akan bersyukur atas nikmatKu dengan mengimani rasulallah?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mengajarkan kepadanya} Kami mengajarkan kepada Dawud {cara membuat baju besi} membuat baju besi {untuk kalian agar Kami bisa melindungi kalian} melindungi kalian {dari serangan musuh kalian} serangan musuh-musuh kalian {Maka apakah kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “Dan telah kami ajarkan kepada Dawud membuat baju besi untuk kamu,” maksudnya Allah mengajari Dawud cara membuat baju besi. Beliaulah orang pertama yang menciptakan dan mengetahuinya. Hasil karyanya menyebar ke generasi selanjutnya. Allah mellunakkan besi bagi beliau dan mengajari bagaimana cara membentuknya. Manfaatnya besar. Yaitu “guna memelihara kamu dalam peperangan,” maksudnya baju-baju besi itu berfungsi sebagai pelindung di medan peperangan dan di saat pertarungan sengit. “Maka hendaklah kamu bersyukur (kepada Allah),” atas nikmat Allah yang tercurahkan kepada kalian yang Allah praktikkan melalui tangan hambaNya, Dawud! Sebagaimana Allah berfirman, \"dan Dia jadikan bagimu pakaian yang memeliharamu dari panas dan pakaian (baju besi) yang memelihara kamu dalam peperangan. Demikianlah Allah menyempurnakan nikmat-Nya atasmu agar kamu berserah diri (kepada-Nya).\" (An-Nahl:81). Mengandung kemungkinan makna bahwa Allah mengajari beliau cara pembuatan baju besi dan proses pelunakannya merupakan perkara yang di luar kebiasaan. Dan masuk dalam kategori yang disampaikan para ulama tafsir, “Sesungguhnya Allah melunakkan besi baginya sehingga dia dapat memprosesnya layaknya adonan dan tanah liat tanpa harus dilebur terlebih dahulu di atas api.” Mengandung kemungkinan makna bahwa pengajaran cara pembuatannya berjalan sewajarnya. Dan proses melunakkan besi diilakukan melalui mekanisme yang diajarkan Allah., berupa cara-cara yang sekarang diketahui untuk meleburnya. Inilah keterangan yang lebih kuat kebenarannya. Pasalnya, Allah menyebut-nyebuut [kemampuan untuk melakukannya] sebagai karunia dariNya kepada para hambaNya dan memerintahkan mereka untuk mensyukurinya. Seandainya masalah pembuatan baju besi tidak termasuk perkara yang dijadikan Allah agar dapat dikerjakan oleh manusia, niscaya Dia tidak akan menyebut-nyebutnya sebagai kenikmatan atas mereka dan tidak akan mengemmukakan kegunaannya. Sebab baju-baju besi yang dibuat oleh Dawud, menjadi perkara mustahil (bisa dibuat) bila yang dimaksud adalah dzatnya. Anugerah yang diinginkan di sini adalah jenisnya secara umum. Keterangan yang disampaikan oleh para ahli tafsir tidak mempunyai dasarnya sama sekali, kecuali Firman Allah, \"dan Kami telah melunakkan besi untuknya,\" (Saba:10) Dalam ayat ini tidak ada petunjuk bahwa pelunakan besi terjadi tanpa usaha. Wallahu a’lam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 80: Nabi Dawud ‘alaihis salam adalah orang pertama yang membuat baju besi dan mengajarkannya, di mana sebelumnya hanya sebagai lempengan-lempengan. Pengajaran Allah kepada Dawud tentang cara membuat baju besi dan pelunakannya menurut para mufassir adalah perkara yang berada di luar kebiasaan manusia karena sebagaimana dikatakan mereka, Allah melunakkan besi untuknya, sehingga Beliau mengolahnya seperti tepung dan tanah tanpa perlu dileburkan ke dalam api. Alasan mereka adalah firman Allah Ta’ala, :Wa alannaa lahul hadiid” (Dan Kami lunakkan besi untuknya), namun menurut Syaikh As Sa’diy, bahwa pelunakkan di sini tidak berarti tanpa sebab. Oleh karena itu, menurutnya, bahwa Allah mengajarkan kepada Dawud secara adat kebiasaan, yakni dengan mengajarkan sebab-sebab yang dapat meleburkannya, wallahu a’lam. Wahai penduduk Mekah. Yakni dengan membenarkan rasul-Ku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 80",
    "description": "Pada ayat ini Allah menyebutkan karunia lain yang diberikan kepada nabi dawud. Dan kami ajarkan pula kepada dawud cara membuat baju besi untukmu dan prajurit-prajurit kamu guna melindungi kamu dan mereka dalam peperangan yang kamu pimpin. Apakah kamu dengan menerima karunia Allah yang besar ini termasuk hamba yang bersyukur kepada Allah'81-82. Dan kami tundukkan untuk sulaiman sebagai anugerah dan fasilitas, angin yang sangat kencang tiupannya yang berhembus dengan perintahnya dengan hembusan yang keras dan kencang atau pun lu-nak dan lambat ke negeri yang kami beri berkah padanya sebagai moda transportasi sulaiman dari kota yang satu ke kota lainnya. Dan kami maha mengetahui segala sesuatu, baik yang tampak maupun tersembunyi. Dan kami tundukkan pula kepada sulaiman segolongan setan-setan yang menyelam ke dasar laut untuk mengambil sesuatu yang diperlukan-Nya. Dan mereka, setan-setan yang menjadi pelayan nabi sulaiman itu mengerjakan pekerjaan selain itu seperti mendirikan bangunan dan membuat kolam raksasa; dan kami yang memelihara mereka agar setan-setan itu tidak merusak dan tidak bermain-main dalam melaksanakan tugas pokok dan fungsinya."
  }
]