[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menundukkan bagi Sulaiman angin yang bertiup kencang yang dapat membawa dirinya dan orang-orang yang bersamanya, yang berhembus dengan perintahNya menuju negeri Baitul Maqdis di Syam yang Kami curahkan keberkahan padanya dengan berbagai macam kebaikan yang banyak. Dan sungguh ilmu Kami meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Dan Kami tundukkan untuk Sulaiman angin yang sangat kencang tiupannya, yang bertiup sesuai perintahnya bila ia memerintahkannya untuk bertiup ke negeri Syam yang Kami berkahi lantaran di negeri itulah Kami mengutus para Nabi, dan menurunkan banyak rahmat dan berbagai kebaikan, dan Kami Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang tersembunyi bagi Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Dan Kami tundukkan bagi Sulaiman angin yang berhembus kencang, agar angin itu berhembus sesuai perintahnya menuju negeri Syam yang telah Kami berkahi dengan berbagai sumber daya alam dan buah-buahan. Dan Kami Maha Mengetahui segala sesuatu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَلِسُلَيْمٰنَ الرِّيحَ عَاصِفَةً (Dan (telah Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya) Yakni angin yang sangat kencang. تَجْرِى بِأَمْرِهِۦٓ إِلَى الْأَرْضِ الَّتِى بٰرَكْنَا فِيهَا ۚ( yang berhembus dengan perintahnya ke negeri yang kami telah memberkatinya) Yakni negeri Syam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Dan Kami tundukkan bagi Sulaiman angin yang berhembus sangat kencang namun masih lembut yang berjalan sesuai perintahnya menuju tanah Syam yang Kami berkahi. Dan Kami Maha Mengetahui segala sesuatu. Tidak ada yang luput dari Kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan untuk Sulaiman, angin yang sangat kencang} yang sangat kencang tiupannya {yang berhembus dengan perintahnya ke negeri} negeri Syam {yang Kami beri berkahi pada negeri itu. Kami Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “Dan (telah Kami tundukkan) untuk Sulaiman angina,” maksudnya Kami menundukannya “yang sangat kencang tiupannya,” yang begitu cepat lajunya, “yang berhembus dengan perintahNya.” Di mana dia bergerak melaju untuk menaati perintahNya. Jarak perjalanan yang ditempuh di pagi hari sejauh satu bulan perjalanan (dengan unta) dari jarak perjalanan yang di tempuh di sore hari sejauh satu bulan perjalanan (dengan unta), “ke negeri yang Kami telah memberkatinya,” yaitu negeri Syam yang menjadi tempat tinggalnya. Beliau menumpangi angina menuju arah Barat dan Timur. Tempat menetap dan kembalinya adalah ke bumi yang diberkahi (Syam). “Dan Kami Maha Mengetahui segala sesuatu.” Pengetahuan Kami meliputi segala sesuatu, dan Kami mengetahui pada diri Dawud dan Sulaiman tingkat kehebatan yang mana Kami telah mengantarkan mereka berdua sampai tingkatan yang telah Kami ceritakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 81: Maksudnya, bahwa angin dapat diarahkan sesuai perintahnya. Dalam ayat lain, Allah berfirman, “Dan Kami (tundukkan) angin bagi Sulaiman, yang perjalanannya di waktu pagi sama dengan perjalanan sebulan dan perjalanannya di waktu sore sama dengan perjalanan sebulan (pula)…dst.” (Terj. Saba’: 12) Maksudnya adalah apabila Sulaiman mengadakan perjalanan dari pagi sampai tengah hari, maka jarak yang ditempuhnya sama dengan jarak perjalanan unta yang cepat dalam sebulan. Begitu pula apabila ia mengadakan perjalanan dari tengah hari sampai sore, maka kecepatannya sama dengan perjalanan sebulan. Yakni Syam, di mana di sanalah tempat Beliau menetap Di antaranya adalah, Allah Subhaanahu wa Ta'aala mengetahui bahwa pemberiannya kepada Sulaiman membuatnya semakin tunduk kepada Allah, maka Allah melakukannya sesuai ilmu-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 81",
    "description": "81-82. Dan kami tundukkan untuk sulaiman sebagai anugerah dan fasilitas, angin yang sangat kencang tiupannya yang berhembus dengan perintahnya dengan hembusan yang keras dan kencang atau pun lu-nak dan lambat ke negeri yang kami beri berkah padanya sebagai moda transportasi sulaiman dari kota yang satu ke kota lainnya. Dan kami maha mengetahui segala sesuatu, baik yang tampak maupun tersembunyi. Dan kami tundukkan pula kepada sulaiman segolongan setan-setan yang menyelam ke dasar laut untuk mengambil sesuatu yang diperlukan-Nya. Dan mereka, setan-setan yang menjadi pelayan nabi sulaiman itu mengerjakan pekerjaan selain itu seperti mendirikan bangunan dan membuat kolam raksasa; dan kami yang memelihara mereka agar setan-setan itu tidak merusak dan tidak bermain-main dalam melaksanakan tugas pokok dan fungsinya"
  }
]