[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah menundukkan bagi Sulaiman dari bangsa setan, yaitu setan-setan yang dia manfaatkan dalam pekerjaan-pekerjaan yang makhluk lain tidak mampu melakukannya. Mereka ditugasi menyelam ke dalam laut untuk mengeluarkan batu-batu mutiara dan permata-permata. Mereka juga mengerjakan pekerjaan lain, yaitu membuat apa-apa yang diinginkan Sulaiman dari mereka. Mereka tidak kuasa menolak apa-apa yang Sulaiman inginkan dari mereka. Allah melindungi mereka baginya dengan kekuatan dan keperkasaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Dan Kami tundukkan pula kepada Sulaiman segolongan setan yang menyelam ke dasar laut untuk mengeluarkan berbagai perhiasan atau lainnya untuk Sulaiman, dan mereka mengerjakan juga pekerjaan selain itu seperti pembangunan, dan Kami mengetahui jumlah dan pekerjaan mereka, tidak ada yang tersembunyi sedikit pun bagi Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Dan Kami juga menundukkan baginya sebagian jin yang menyelam ke dasar laut untuk mengeluarkan mutiara baginya, dan mengerjakan pekerjaan lainnya seperti membangun bangunan dan membuat sesuatu. Dan Kami mengawasi mereka agar mereka tidak mengerjakan selain yang dikehendaki Sulaiman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَمِنَ الشَّيٰطِينِ مَن يَغُوصُونَ لَهُۥ (Dan Kami telah tundukkan (pula kepada Sulaiman) segolongan syaitan-syaitan yang menyelam (ke dalam laut) untuknya) Dan mereka mengeluarkan dari laut itu apa yang diminta oleh Nabi Sulaiman. وَيَعْمَلُونَ عَمَلًا دُونَ ذٰلِكَ ۖ( dan mengerjakan pekerjaan selain daripada itu) Yakni mengerjakan pekerjaan di bawah air. Atau yang dimaksud adalah mengerjalan pekerjaan selain menyelam ke dalam laut, seperti membuat alat perang atau patung-patung. وَكُنَّا لَهُمْ حٰفِظِينَ (dan adalah Kami memelihara mereka itu) Yakni mengawasi pekerjaan mereka. Atau menjaga mereka agar tidak kabur atau menolak untuk bekerja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Dan Kami tundukkan bagi Sulaiman setan yang menyelam di laut untuk mengeluarkan mutiara baginya. Mereka juga mengerjakan pekerjaan-pekerjaan lain selain itu, seperti membangun tempat berdoa, kota, kastil, masjid dan bangunan-bangunan yang aneh. Dan Kami memantau pekerjaan mereka serta mencegah mereka agar tidak melarikan diri dan menolak untuk bekerja"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segolongan setan yang menyelam untuknya} menyelam ke dalam air, lalu mengeluarkan untuknya permata luar biasa dari laut {dan mengerjakan pekerjaan selain itu} selain penyelaman itu, seperti membangun kota, istana, mengerjakan gedung-gedung tinggi, patung-patung, sumur-sumur kecil, periuk-periuk yang tidak bergerak, dan hal-hal selain itu, berupa membuat karya-karya yang menakjubkan {Kamilah yang memelihara mereka itu"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 82: Hal ini termasuk keistimewaan Nabi Sulamian ‘alaihis salam, di mana Allah menundukkan setan-setan dan jin-jin ifrit serta memberikan kekuasaan kepadanya terhadap jin-jin itu. Oleh karena itu, mereka bekerja untuk Beliau, di antara mereka ada yang menyelam ke laut mengeluarkan perhiasan untuknya, ada pula yang membuatkan gedung-gedung yang tinggi dan patung-patung dan piring-piring yang (besarnya) seperti kolam dan periuk yang tetap (berada di atas tungku). Bahkan di antara mereka ada yang ditugaskan membangun Baitulmaqdis. Ketika Nabi Sulaiman wafat, mereka masih tetap bekerja untuk Sulaiman selama setahun, karena ketidaktahuan mereka bahwa Sulaiman telah wafat. Allah Subhaanahu wa Ta'aala menetapkan wafatnya Sulaiman, sedangkan ketika itu Beliau berpegangan dengan tongkatnya. Ketika itu, setan-setan yang melewati Beliau menyangka bahwa Beliau masih hidup karena terlihat bersandar di atas tongkat, tidak ada yang menunjukkan kepada mereka kematiannya itu kecuali rayap yang memakan tongkatnya. Setelah Beliau telah tersungkur. Ketika itu tahulah jin bahwa kalau sekiranya mereka mengetahui yang gaib tentulah mereka tidak akan tetap dalam siksa yang menghinakan (lihat surah Saba’: 14). Yang demikian, karena sebelumnya mereka (para setan) menipu manusia, bahwa mereka mengetahui yang gaib, maka Allah Subhaanahu wa Ta'aala tunjukkan ketidaktahuan mereka terhadap yang gaib, di mana sekiranya mereka mengetahui yang gaib tentulah mereka akan berhenti bekerja (lihat surah Saba’: 14). Seperti membuat bangunan, dan lain-lain. Sehingga setan-setan itu tidak mampu menimpakan keburukan kepada Sulaiman ‘alaihis salam. Ada pula yang berpendapat, bahwa Allah menjaga mereka (setan-setan) sehingga mereka tidak merusak pekerjaan yang telah mereka selesaikan, karena biasanya mereka setelah mengerjakan sesuatu merusak kembali sebelum malam tiba jika tidak diberikan kesibukan yang lain. Ada pula yang menafsirkan, bahwa mereka tidak sanggup menolak dan melanggar perintah Sulaiman, bahkan Allah menjaga mereka untuk Sulaiman dengan kekuatan-Nya, keperkasaan-Nya dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 82",
    "description": "81-82. Dan kami tundukkan untuk sulaiman sebagai anugerah dan fasilitas, angin yang sangat kencang tiupannya yang berhembus dengan perintahnya dengan hembusan yang keras dan kencang atau pun lu-nak dan lambat ke negeri yang kami beri berkah padanya sebagai moda transportasi sulaiman dari kota yang satu ke kota lainnya. Dan kami maha mengetahui segala sesuatu, baik yang tampak maupun tersembunyi. Dan kami tundukkan pula kepada sulaiman segolongan setan-setan yang menyelam ke dasar laut untuk mengambil sesuatu yang diperlukan-Nya. Dan mereka, setan-setan yang menjadi pelayan nabi sulaiman itu mengerjakan pekerjaan selain itu seperti mendirikan bangunan dan membuat kolam raksasa; dan kami yang memelihara mereka agar setan-setan itu tidak merusak dan tidak bermain-main dalam melaksanakan tugas pokok dan fungsinya. 83. Dan ingatlah kisah ayub, seorang nabi dan rasul yang mendapat cobaan berat dalam hidupnya, ketika dia berdoa kepada tuhannya dengan berserah dan bertawakal kepada-Nya. 'ya tuhanku, sungguh, aku telah ditimpa penyakit yang terasa sangat berat; tetapi aku yakin bahwa engkau tuhan yang maha penyayang dari semua yang penyayang, sehingga cobaan ini merupakan bentuk kasih sayang-Mu kepadaku. '."
  }
]