[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Rasul) hamba kami Ayyub, ketika Kami mengujinya dengan kondisi buruk dan penyakit parah dalam tubuhnya. Dia telah kehilangan istri, harta benda, dan anaknya. Maka dia bersabar dan mengharapkan pahala (dari Allah). Dan dia memanggil Tuhannya, “Sesungguhnya kondisi buruk telah menimpaku, sedang Engkau adalah Tuhan Yang Maha Penyayang diantara semua penyayang. Maka singkirkanlah penyakit ini dariku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Dan ingatlah -wahai Rasul- tentang kisah Ayub -'alaihissalām-, tatkala ia berdoa kepada Tuhannya saat ditimpa musibah seraya berkata, \"Wahai Tuhanku! Sungguh aku telah ditimpa suatu penyakit, dan kehilangan keluargaku, padahal Engkaulah Yang Maha Penyayang dari semua yang penyayang, maka hilangkanlah penyakit dan musibah yang menimpaku ini.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83-84. Allah mengingatkan Nabi Muhammad dan umatnya mengenai para nabi dan orang-orang shalih yang tunduk berdoa kepada Allah, kemudian Allah mengabulkan doa mereka. Di antara mereka adalah nabi dan hamba Allah, Ayyub, ketika dia berdoa: “Aku terkena penyakit di tubuhku dan aku kehilangan keluargaku, sedangkan Engkau adalah Dzat yang paling pengasih; maka kasihilah aku dengan rahmat-Mu yang luas.” Maka Kami mengabulkan doanya; Kami hilangkan penyakitnya dan Kami karuniakan kepadanya keluarga yang dua kali lebih banyak dari keluarga yang dahulu. Ini merupakan rahmat dari Kami dan pelajaran besar bagi hamba-hamba Allah agar mereka senantiasa bersabar dalam menghadapi cobaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُۥٓ أَنِّى مَسَّنِىَ الضُّرُّ (dan (ingatlah kisah) Ayub, ketika ia menyeru Tuhannya: “(Ya Tuhanku), sesungguhnya aku telah ditimpa penyakit) Yakni penyakit berat di badannya serta kematian keluarganya. وَأَنتَ أَرْحَمُ الرّٰحِمِينَ (dan Engkau adalah Tuhan Yang Maha Penyayang di antara semua penyayang”) Kemudian Allah mengabarkan pengabulan doanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Jika dikatakan : bagaimana Allah menamakan Ayyub sebagai hamba yang sabar, sedangkan ia telah menyampaikan kelahunnya dengan mengatakan : { أَنِّى مَسَّنِىَ ٱلضُّرُّ } \"(Ya Tuhanku), sesungguhnya aku telah ditimpa penyakit\", dan ia juga mengatakan : { أَنِّى مَسَّنِىَ ٱلشَّيْطَٰنُ بِنُصْبٍ وَعَذَابٍ } \"Sesungguhnya aku diganggu syaitan dengan kepayahan dan siksaan\" [ Shad : 41 ]? Maka kita katakan : semua itu bukanlah keluhan, melainkan doa Ayyub kepada tuhannya, sebagaimana yang dijelaskan oleh ayat : { فَٱسْتَجَبْنَا لَهُۥ فَكَشَفْنَا مَا بِهِۦ مِن ضُرٍّ } \"Maka Kamipun memperkenankan seruannya itu, lalu Kami lenyapkan penyakit yang ada padanya\" [ Al-Anbiya' : 84 ]. 2 ). Ayyun tidak sekalipun bersandar kepada perbuatan dan kesabarannya, melainkan ia bersandar kepada imannya yang kuat bahwa tuhannya sebaik-baik penyayang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Dan ingatlah Wahai nabi tentang kisah Ayub ketika berdoa kepada Tuhannya tentang penyakit yang menimpanya sudah sangat parah dan lama: “Wahai Tuhanku, sesungguhnya aku telah kesulitan berupa penyakit, badan kurus, dan kehilangan keluarga dan harta benda. Dan Engkau adalah Dzat yang Maha Pengasih untuk mengabulkan doa” Adh-Dhurru adalah sesuatu yang menimpa diri manusia seperti penyakit, kekurusan. Sedangkan Adh-Dharru adalah kerusakan pada setiap sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Ayyub ketika dia berdoa kepada Tuhannya,“Sesungguhnya aku telah ditimpa penyakit} telah ditimpa kemudaratan pada setiap sesuatu {padahal Engkau adalah Dzat yang paling penyayang dari semua yang penyayang”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 83: Allah Subhaanahu wa Ta'aala menguji Ayyub dan memberikan kekuasaan kepada setan terhadap jasadnya sebagai cobaan baginya, setan kemudian meniup ke dalam jasad, maka keluarlah bisul yang buruk dan menjijikan, dan Beliau menderita penyakit itu dalam waktu yang sangat lama, (ada yang mengatakan, selama 18 tahun Beliau menderita penyakit itu). Lebih dari itu anak-anaknya wafat, hartanya binasa dan manusia menjauhinya selain istrinya, maka Allah mendapatkannya dalam keadaan sabar dan ridha terhadap musibah itu, dan setelah sekian lama, ia pun berdoa seperti yang disebutkan dalam ayat di atas. Beliau bertawassul kepada Allah dengan keadaannya yang begitu parah dan dengan rahmat Allah yang luas lagi merata, maka Allah mengabulkan doanya dan berfirman kepadanya, “Hantamkanlah kakimu; inilah air yang sejuk untuk mandi dan untuk minum.” (Terj. Shaad: 42) Maka Beliau menghantamkan kakinya ke bumi, kemudian keluarlah mata air yang sejuk, lalu Ayyub mandi dan minum daripadanya, kemudian Allah menghilangkan derita yang menimpanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 83",
    "description": "Dan ingatlah kisah ayub, seorang nabi dan rasul yang mendapat cobaan berat dalam hidupnya, ketika dia berdoa kepada tuhannya dengan berserah dan bertawakal kepada-Nya. 'ya tuhanku, sungguh, aku telah ditimpa penyakit yang terasa sangat berat; tetapi aku yakin bahwa engkau tuhan yang maha penyayang dari semua yang penyayang, sehingga cobaan ini merupakan bentuk kasih sayang-Mu kepadaku. '84. Karena sikap nabi ayub yang sabar, berserah dan bertawakal kepada Allah dalam menyikapi penyakit yang menimpa dirinya, maka kami mengabulkan doa-Nya, lalu kami melenyapkan berbagai penyakit yang ada padanya sehingga penyakitnya sembuh lahir batin; dan kami pun mengembalikan keluarganya kepadanya untuk lebih menyempurnakan kebahagiaannya. Dan kami pun melipatgandakan jumlah keturunan nabi ayub sebagai suatu rahmat dari kami kepada hamba-Nya yang sabar, dan sekaligus kisah nabi ayub ini untuk menjadi peringatan bagi semua orang beriman yang menyembah kami agar bersabar, bertawakal dan berserah kepada Allah dalam menghadapi berbagai cobaan yang menimpa dirinya."
  }
]