[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami mengabulkan doanya dan melenyapkan bala darinya. Dan Kami mengembalikan apa yang sudah hilang darinya, berupa istri, anak,dan harta benda dengan jumlah yang berlipat-ganda. Kami lakukan itu sebagai rahmat dari Kami (baginya) agar dia menjadi teladan baik bagi stiap orang yang bersabar menghadapi bala, mengharap rahmat tuhannya, lagi menghambakan diri kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Maka Kami mengabulkan doanya, dan menghilangkan musibah yang menimpanya, dan Kami kembalikan keluarga dan anak-anaknya yang dahulu lenyap darinya, lalu Kami lipat gandakan jumlah mereka. Semua yang Kami lakukan itu merupakan suatu rahmat dari Kami untuknya, dan sebagai peringatan bagi orang-orang yang taat beribadah kepada Kami agar senantiasa bersabar sebagaimana sabarnya Ayub."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. فَاسْتَجَبْنَا لَهُۥ فَكَشَفْنَا مَا بِهِۦ مِن ضُرٍّ ۖ (Maka Kamipun memperkenankan seruannya itu, lalu Kami lenyapkan penyakit yang ada padanya) Yakni Allah menyembuhkan apa yang menimpanya. وَءَاتَيْنٰهُ أَهْلَهُۥ وَمِثْلَهُم مَّعَهُمْ (dan Kami kembalikan keluarganya kepadanya, dan Kami lipat gandakan bilangan mereka) Terdapat mendapat mengatakan bahwa Allah menjadikan keluarganya meninggalkannya, lalu Allah menggantinya dengan yang semisal mereka di dunia. Keluarganya telah mati semua kecuali istrinya, lalu Allah menghidupkan mereka lebih cepat dari kedipan mata. Pendapat lain mengatakan anaknya lahir dengan jumlah dua kali lipat daripada anaknya yang telah mati. رَحْمَةً مِّنْ عِندِنَا (sebagai suatu rahmat dari sisi Kami) Yakni Kami memberinya demikian karena rahmat Kami baginya. وَذِكْرَىٰ لِلْعٰبِدِينَ(dan untuk menjadi peringatan bagi semua yang menyembah Allah) Agar mereka bersabar sebagaimana kesabaran Nabi Ayyub."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Lalu Kami kabulkan doa Ayub, dan Kami angkat penyakit yang diturunkan kepadanya sebagai ujian. Dan Kami anugerahkan kepadanya sejumlah keluarga yang sama serta Kami tambahkan anak-anak lain. Kami berikan itu kepadanya sebagai rahmat Kami untuknya dan pengingat bagi para hamba agar bersabar seperti dia, sehingga mereka mendapatkan pahala seperti pahalanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami mengabulkan (doa)nya, lalu Kami mengangkat penyakit yang ada padanya, Kami mengembalikan keluarganya kepadanya, dan Kami lipat gandakan mereka sebagai suatu rahmat dari sisi Kami dan pengingat} pengingat {bagi para penyembah"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 84: Menurut Ibnu Abbas adalah dengan dihidupkan kembali dan dikembalikan hartanya kepadanya. Menurut Wahab bin Munabbih, “Allah mewahyukan kepada Ayyub (yang isinya), “Aku telah mengembalikan keluarga dan hartamu kepadamu dan melipatgandakan jumlahnya, maka mandilah dengan air ini, karena di sana terdapat penyembuh bagimu, berkurbanlah untuk sahabat-sahabatmu dan mintakanlah ampunan untuk mereka, karena mereka telah bermaksiat kepada-Ku dalam masalah kamu.” Rasulullah shallallahu 'alaihi wa sallam bersabda: « بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَاناً ،فَخَرَّ عَلَيْهِ جَرَادٌ مِنْ ذَهَبٍ ، فَجَعَلَ أَيُّوبُ يَحْتَثِى فِى ثَوْبِهِ ، فَنَادَاهُ رَبُّهُ : يَا أَيُّوبُ ، أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَى ؟ قَالَ : بَلَى وَعِزَّتِكَ وَلَكِنْ لاَ غِنَى بِى عَنْ بَرَكَتِكَ » . “Ketika Ayyub sedang mandi dalam keadaan telanjang, tiba-tiba ada seekor belalang dari emas jatuh, lalu Ayyub mengeruknya ke dalam bajunya, kemudian Tuhannya memanggilnya, “Wahai Ayyub, bukankah Aku telah mencukupkan kamu daripada apa yang kamu lihat?” Ia menjawab, “Benar, demi keperkasaan-Mu. Akan tetapi, aku tetap merasa butuh dengan keberkahan-Mu.” (HR. Bukhari) Menurut Mujahid, “Dikatakan kepada Ayyub, “Wahai Ayyub, sesungguhnya keluargamu di surga. Jika engkau mau, kami dapat mendatangkan mereka kepadamu, dan jika engkau mau, kami biarkan mereka di surga dan kami menggantikan untukmu yang serupa dengan mereka.” Ayyub menjawab, “Tidak (perlu engkau bawa kepadaku), aku biarkan mereka di surga.” Maka keluarganya yang dahulu dibiarkan di surga, dan digantikan untuknya yang serupa dengan mereka di dunia.” Yakni karena dia bersabar dan ridha, maka Allah membalasnya dengan pahala yang disegerakan sebelum pahala akhirat. Yakni pelajaran dan teladan. Agar mereka tetap bersabar sehingga memperoleh pahala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 84",
    "description": "Karena sikap nabi ayub yang sabar, berserah dan bertawakal kepada Allah dalam menyikapi penyakit yang menimpa dirinya, maka kami mengabulkan doa-Nya, lalu kami melenyapkan berbagai penyakit yang ada padanya sehingga penyakitnya sembuh lahir batin; dan kami pun mengembalikan keluarganya kepadanya untuk lebih menyempurnakan kebahagiaannya. Dan kami pun melipatgandakan jumlah keturunan nabi ayub sebagai suatu rahmat dari kami kepada hamba-Nya yang sabar, dan sekaligus kisah nabi ayub ini untuk menjadi peringatan bagi semua orang beriman yang menyembah kami agar bersabar, bertawakal dan berserah kepada Allah dalam menghadapi berbagai cobaan yang menimpa dirinya. 85-86. Dan ingatlah kisah para nabi yang berikut: ismail, idris, dan zul-kifli. Mereka semua, bukan hanya nabi ayub, termasuk orang-orang yang sabar dalam melaksanakan perintah Allah dan dalam menghadapi co-baan. Dan karena kesabaran mereka teruji dengan baik, maka kami memasukkan mereka ke dalam rahmat kami di dunia dan akhirat. Sungguh, mereka dengan kesabarannya yang mantap, termasuk orang-orang yang saleh, karena kesalehan hanya akan terwujud dengan kesabaran."
  }
]