[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah Ismail dan Idris, serta Dzulkifli. Masing-masing dari mereka itu termasuk orang-orang yang sabar dalam menjalani ketaatan kepada Allah, menjauhi maksiat kepadaNya, dan menghadapi takdir-takdirNya. Maka mereka pantas disebut dengan pujian yang baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Dan ingatlah -wahai Rasul- tentang kisah Ismail, Idris, dan ŻulKifli -'alaihimussalām-. Mereka masing-masing termasuk orang-orang yang sabar dalam menghadapi suatu bala dan musibah, dan dalam melaksanakan perintah Allah yang diembankan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85-86. Dan ingatlah Ismail, Idris, dan Dzulkifli; mereka semua adalah orang-orang yang bersabar dalam menghadapi cobaan. Kami telah meliputi mereka dengan rahmat Kami karena mereka adalah orang-orang yang baik dan shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَإِسْمٰعِيلَ وَإِدْرِيسَ وَذَا الْكِفْلِ ۖ (Dan (ingatlah kisah) Ismail, Idris dan Dzulkifli) Pendapat yang benar menyatakan bahwa Dzulkifli merupakan orang dari Bani Israil, dia adalah orang yang suka melakukan kemaksiatan, kemudian dia bertaubat dan Allah mengampuninya; dan dia bukanlah seorang Nabi. Namun pendapat lain mengatakan dia adalah seorang Nabi. كُلٌّ مِّنَ الصّٰبِرِينَ (Sesungguhnya mereka termasuk orang-orang yang sabar) Yakni mereka semua adalah orang-orang yang sabar dalam menjalankan tugas yang dibebankan Allah kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Ingatlah juga wahai rasulallah tentang kisah Ismail, Idris, dan Dzulkifli, yaitu anak Ayub, yang termasuk nabi-nabi dari kaum Bani Israil. Mereka semua adalah orang-orang sabar dalam menanggung beban dan penderitaan untuk mengharapkan keridhaan Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ismail, Idris, dan Dzulkifli. Mereka semua termasuk orang-orang sabar"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 85: Dinamakan Dzulkifli (yang siap menanggung), karena kesiapannya berpuasa di siang hari dan melakukan qiyamullail di malamnya, serta siap memutuskan perkara di tengah-tengah manusia serta tidak marah, maka Beliau mampu melaksanakan semua itu. Ada yang berpendapat, bahwa ia bukanlah seorang nabi, tetapi sebagai laki-laki yang salih, raja dan hakim yang adil, wallahu a’lam. Ibnu Jarir dan Ibnu Abi Hatim meriwayatkan dari jalan Dawud bin Abi Hind, dari Mujahid, bahwa ia berkata: Ketika usia Ilyasa’ sudah tua, ia berkata, “Wahai, sekiranya aku mengangkat seseorang untuk memimpin manusia di masa hidupku agar aku melihat tindakannya?” Maka ia mengumpulkan orang-orang dan berkata, “Siapakah yang siap menerima tiga tugas dariku, maka aku akan mengangkatnya sebagai pemimpin; berpuasa di siang hari, shalat di malam hari dan tidak marah.” Lalu ada seorang yang berdiri yang dipandang hina oleh mata manusia dan berkata, “Saya.” Beliau bertanya, “Apakah kamu (siap) berpuasa di siang hari, melakukan shalat di malam hari dan tidak marah.” Ia menjawab, “Ya.” Maka Beliau menyuruh orang-orang kembali pada hari itu, dan pada hari selanjutnya, Beliau berkata lagi seperti itu, lalu orang-orang terdiam, dan orang (yang kemarin siap) itu berdiri dan berkata, “Saya.” Maka Beliau mengangkatnya sebagai pemimpin. Kemudian Iblis berkata kepada para setan, “Kalian harus lakukan sesuatu (untuk menggoda) si fulan.” Namun ternyata orang itu membuat mereka (para setan) putus asa menghadapinya, maka Iblis berkata, “Sudah, biarkanlah aku yang menghadapinya.” Maka Iblis datang dalam bentuk orang yang sudah tua lagi miskin, dan ia datang kepadanya ketika orang ini (Dzulkifli) mendatangi tempat tidurnya untuk istirahat di siang hari, padahal ia tidak tidur di malam dan siang hari selain tidur pada waktu itu. Lalu Iblis mengetuk pintu, kemudian orang itu berkata, “Siapakah ini?” Iblis menjawab, “Orang tua yang terzalimi.” Maka orang itu bangun dan membukan pintu, lalu Iblis (dalam bentuk manusia yang sudah tua) mengisahkan masalahnya dan berkata, “Sesungguhnya antara aku dengan kaumku ada masalah. Mereka menzalimiku dan melakukan ini dan itu terhadapku.” Sehingga ia (Iblis) berbicara lama dengannya sampai tiba waktu sore dan waktu istirahat di siang hari telah habis. Ia berkata, “Jika sudah tiba waktu sore, maka aku akan memberikan hakmu.” Maka ia (Dzulkifli) pun pergi di waktu sore, dan duduk di majlisnya sambil memperhatikan apakah ia melihat orang tua yang tadi, namun ternyata tidak dilihatnya. Besoknya, ia melakukan hal yang sama, yaitu memberikan keputusan di antara manusia dan menunggu kedatangan orang tua itu, namun ternyata tidak juga dilihatnya. Saat ia hendak pergi ke tempat tidurnya untuk istirahat di siang hari, maka orang itu itu datang dan mengetuk pintu, dan berkata, “Siapakah ini?” Iblis menjawab, “Orang yang tua yang terzalimi.” Lalu ia (Dzulkifli) membuka pintunya dan berkata, “Bukankah aku sudah mengatakan kepadamu, “Apabila aku sedang duduk (memberikan keputusan), maka datanglah kepadaku?” Iblis (dalam bentuk manusia) berkata, “Sesungguhnya mereka adalah kaum yang paling buruk jika mereka tahu engkau sedang duduk (memberikan keputusan). Mereka nanti akan berkata, “Ya, kami akan berikan hakmu, namun ketika engkau pergi, maka mereka akan mengingkarinya.” Ia berkata, “Pergilah, apabila tiba sore hari, maka datanglah kepadaku.” Maka orang ini (Dzulkifli) kehilangan waktu istirahatnya di siang hari, ia pun datang di sore hari, namun tidak juga melihat orang tua itu dan ia sangat ngantuk sekali, sehingga ia berkata kepada sebagian keluarganya, “Jangan biarkan seseorang mendekati pintu ini sampai aku tidur. Sesungguhnya rasa ingin tidur mendorongku (unuk istirahat).” Maka pada saat itu, Iblis datang, lalu ada (anggota keluarganya) yang berkata, “Tetaplah di belakang, tetaplah di belakang.” Maka Iblis menjawab, “Aku telah datang kepadanya kemarin dan telah menyebutkan masalahku kepadanya.” Maka ia (anggota keluarganya) berkata, “Tidak boleh (masuk). Demi Allah, ia telah menyuruh kami untuk tidak membiarkan seorang pun mendekatinya.” Ketika ia (anggota keluarganya) membuat Iblis putus asa, maka Iblis melihat ke lubang dinding di rumah lalu ia naik darinya dan ternyata ia sudah berada di dalam rumah itu dan mengetuk pintu dari dalam, maka bangunlah orang ini dan berkata, “Wahai fulan, bukankah aku telah menyuruhmu (untuk tidak datang sekarang)?” Iblis menjawab, “Adapun dari pihakku, demi Allah, maka kamu tidak didatangi, maka lihatlah dari mana aku datang?” Maka ia bangun menuju pintu, namun ternyata dalam keadaan terkunci seperti sebelumnya, tetapi orang tua ini anehnya berada dalam rumah, maka ia (Dzulkifli) langsung mengenalinya dan berkata, “Apakah (kamu) musuh Allah?” Iblis menjawab, “Ya. Engkau telah membuatku putus asa dalam segala sesuatu, maka aku lakukan perbuatan yang engkau saksikan untuk membuatmu marah.” Maka dari sini orang ini dinamai Allah dengan Dzulkifli, karena ia siap menanggung sesuau dan memenuhinya. Sabar ada tiga macam: sabar dalam menjalankan ketaatan kepada Allah, sabar dalam menjauhi larangan Allah, dan sabar terhadap taqdir Allah yang terasa pedih. Seorang hamba tidak berhak mendapat gelar sabar secara sempurna sampai terpenuhi ketiga macam sabar ini. Para nabi, Allah sebut sebagai orang-orang yang sabar karena mereka telah memenuhi ketiganya. Selain itu, Allah menyifati mereka dengan kesalihan karena kesalehan hati mereka yang dipenuhi ma’rifatullah dan kecintaan kepada-Nya, kesalihan lisan mereka dengan basah menyebut nama-Nya, dan kesalihan anggota badannya karena sibuk mengerjakan ketaatan kepada Allah dan menjaga dirinya dari maksiat. Karena kesabaran dan kesalehan inilah, Allah masukkan dengan rahmat-Nya dan menjadikan mereka bersama sauadra-saudara mereka dari para rasul serta memberikan pahala di dunia dan akhirat. Kalau sekiranya, pahala mereka adalah dengan disebut tinggi namanya di alam semesta serta disebut baik sekali oleh orang-orang setelahnya, maka hal itu pun sudah cukup sebagai kemuliaan dan ketinggiannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 85",
    "description": "85-86. Dan ingatlah kisah para nabi yang berikut: ismail, idris, dan zul-kifli. Mereka semua, bukan hanya nabi ayub, termasuk orang-orang yang sabar dalam melaksanakan perintah Allah dan dalam menghadapi co-baan. Dan karena kesabaran mereka teruji dengan baik, maka kami memasukkan mereka ke dalam rahmat kami di dunia dan akhirat. Sungguh, mereka dengan kesabarannya yang mantap, termasuk orang-orang yang saleh, karena kesalehan hanya akan terwujud dengan kesabaran"
  }
]