[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami memasukkan mereka ke dalam rahmat Kami. Sesungguhnya mereka itu adalah orang-orang yang batin dan lahir nya baik, maka mereka menaati Allah dan mengamalkan perintahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Dan Kami masukkan mereka ke dalam rahmat Kami, menjadikan mereka sebagai Nabi, dan memasukkan mereka ke dalam Surga. Sesungguhnya mereka adalah hamba-hamba Kami yang saleh, yang senantiasa mengerjakan ketaatan terhadap Tuhan mereka dan suci dari segi lahir dan batin mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَأَدْخَلْنٰهُمْ فِى رَحْمَتِنَآ ۖ (Kami telah memasukkan mereka kedalam rahmat Kami) Yakni ke dalam surga. Atau ke dalam derajat kenabian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Mereka telah masuk ke dalam rahmat Kami di dunia dengan diberi nubuwwah dan di akhirat dengan diberi surga. Sesungguhnya mereka termasuk hamba-hamba Kami yang menjadi nabi-nabi yang shalih lagi taat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami memasukkan mereka ke dalam rahmat Kami. Sesungguhnya mereka termasuk orang-orang shalih"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 86: Berupa kenabian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 86",
    "description": "85-86. Dan ingatlah kisah para nabi yang berikut: ismail, idris, dan zul-kifli. Mereka semua, bukan hanya nabi ayub, termasuk orang-orang yang sabar dalam melaksanakan perintah Allah dan dalam menghadapi co-baan. Dan karena kesabaran mereka teruji dengan baik, maka kami memasukkan mereka ke dalam rahmat kami di dunia dan akhirat. Sungguh, mereka dengan kesabarannya yang mantap, termasuk orang-orang yang saleh, karena kesalehan hanya akan terwujud dengan kesabaran. 87. Dan ingatlah kisah zun nun (yunus), ketika dia pergi meninggalkan kaumnya dalam keadaan marah, karena mereka berpaling dari dirinya dan tidak mau menerima ajaran Allah ketika ia berdakwah kepada me-reka. Lalu dia menyangka bahwa kami tidak akan menyulitkannya karena sikapnya yang tidak sabar itu. Lalu ia naik perahu, namun beban perahu yang ditumpanginya terlalu berat sehingga harus ada seorang yang dilemparkan ke laut. Setelah diundi tiga kali, nabi yunus yang harus dilemparkan ke laut. Allah segera mendatangkan seekor ikan menelan beliau. Maka dia berdoa dalam keadaan yang sangat gelap, di dalam perut ikan, di dalam laut, dan pada malam hari dengan kesadaran, 'tidak ada tuhan selain engkau, mahasuci engkau. Sungguh, aku termasuk orang-orang yang zalim, karena aku marah meninggalkan kaum yang seharusnya dibimbing olehku. '."
  }
]