[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah kisah seorang yang ditelan ikan, yaitu Yunus bin Matta. Allah mengutusnya sebagai rasul kepada kaumnya, maka dia mendakwahi mereka, namun mereka tidak beriman. Lalu dia mengancam mereka dengan siksaan namun mereka tetap tidak mau kembali (bertaubat). Dan dia tidak dapat lebih bersabar dalam menghadapi mereka sebagaimana yang diperintahkan Allah kepada nya. Dia pun pergi dari tengah mereka dalam keadaan marah kepada mereka, merasa sempit dada lantaran penentangan mereka. Dan dia menyangka bahwa sesungguhnya Allah tidak akan menyulitkan dan menghukumnya terhadap pelanggaran atas perintah Allah ini. Maka Allah mengujinya dengan kesempitan yang dahsyat dan tertahan, dan ikan besar menelannya di dalam lautan. Lalu dia menyeru Tuhannya dalam kegelapan malam, laut dan gelapnya perut ikan dengan bertaubat dan pengakuan akan kezhalimannya karena meninggalkan kesabaran dalam menghadapi kaumnya dengan berucap, “Tidak ada sesembahan yang berhak diibadahi kecuali Engkau, MahaSuci Engkau. Sesungguhnya aku termasuk orang-orang yang berbuat kezhaliman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Dan ingatlah -wahai Rasul- tentang kisah orang yang ditelan oleh ikan besar, yaitu Yunus -'alaihissalām-, ketika ia pergi -tanpa ada perintah dari Tuhannya- dalam keadaan marah terhadap kaumnya yang terus-menerus berada dalam kemaksiatan. Dia menyangka bahwa Kami tidak akan menyulitkannya dengan menghukumnya atas kepergiannya, sehingga ia pun Kami uji dengan ujian yang sulit lagi berat tatkala ditelan oleh ikan besar dan terpenjara didalamnya. Lalu dalam kegelapan perut ikan, kegelapan laut dan malam hari ia pun berdoa sembari mengakui dosanya dan bertobat kepada Allah, ia berkata, \"Tidak ada tuhan yang berhak disembah selain-Mu, Engkau Maha Suci lagi Agung, sungguh aku termasuk orang-orang yang zalim.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87-88. Dan ingatlah kisah sahabat ikan paus, Yunus bin Matta ketika Allah mengutusnya kepada kaumnya di negeri Nainawa yang ada di kota Mushil, utara Baghdad. Dia menyeru kaumnya, namun mereka enggan untuk beriman, sehingga dia mengancam mereka dengan azab kemudian dia pergi meninggalkan mereka dengan rasa marah kepada kaumnya dan kepada Tuhannya karena dia tidak bersabar, padahal kaumnya beriman setelah dia meninggalkan mereka. Dia mengira Kami tidak akan menghukumnya atas perbuatannya itu. Saat dia meninggalkan kaumnya, dia menaiki perahu, namun menumpangnya telah melebihi kapasitas perahu itu sehingga mereka takut akan tenggelam. Maka mereka mengusulkan agar mereka membuat undian siapa yang akan dilempar ke laut; dan undian itu didapatkan Yunus, sehingga dia melompat ke laut dengan sendirinya, kemudian dia ditelan oleh ikan paus. Di dalam gelapnya perut ikan paus dan gelapnya lautan, dia berdoa dengan mengakui sikap ketidaksabarannya dan dia bertaubat kepada Allah dan mengesakan-Nya: “Tidak ada Tuhan selain Engkau, Maha Suci Engkau, sungguh aku termasuk orang yang zalim.” Maka Kami kabulkan doanya sehingga Kami menyelamatkannya dari masalah besar itu. sebagaimana Kami menyelamatkannya dari kesulitan, demikianlah Kami akan menyelamatkan orang-orang beriman dari kesulitan mereka jika mereka berdoa kepada Allah dengan penuh keikhlasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَذَا النُّونِ (Dan (ingatlah kisah) Dzun Nun) Dia adalah Yunus bin Matta, seorang Nabi yang diutus kepada penduduk Nainawa di negeri Mosul. إِذ ذَّهَبَ مُغٰضِبًا(ketika ia pergi dalam keadaan marah) Yakni pergi dalam keadaan marah kepada Tuhannya. Pendapat lain mengatakan dia marah kepada kaumnya sebab mereka tidak beriman kepada risalah Allah yang dia bawa bagi mereka, sehingga dia marah dan meninggalkan dakwahnya serta jauh meninggalkan negerinya tanpa izin dari Allah. فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ(lalu ia menyangka bahwa Kami tidak akan mempersempitnya) Terdapat pendapat mengatakan maknanya adalah dia mengira Kami tidak akan mampu menghukumnya, sangkaan ini terbesit di fikirannya yang disebut dengan bisikan hati, dan hal ini tidaklah berdosa. فَنَادَىٰ فِى الظُّلُمٰتِ(maka ia menyeru dalam keadaan yang sangat gelap) Yakni dalam gelapnya malam, gelapnya lautan, dan gelapnya perut ikan paus. Dan doanya adalah لَّآ إلٰهَ إِلَّآ أَنتَ سُبْحٰنَكَ إِنِّى كُنتُ مِنَ الظّٰلِمِينَ أَن لَّآ إلٰهَ إِلَّآ أَنتَ سُبْحٰنَكَ إِنِّى كُنتُ مِنَ الظّٰلِمِينَ (Bahwa tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim) Dia mengesakan Tuhan semesta alam dan mengakui dosanya, serta bertaubat dari kesalahannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "87-88 1 ). Perhatikan ayat ini : { وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَٰضِبًا } \"Dan (ingatlah kisah) Dzun Nun (Yunus), ketika ia pergi dalam keadaan marah\", dan ayat : { وَلَا تَكُن كَصَاحِبِ ٱلْحُوتِ إِذْ نَادَىٰ وَهُوَ مَكْظُومٌ } \"dan janganlah kamu seperti orang yang berada dalam (perut) ikan ketika ia berdoa sedang ia dalam keadaan marah (kepada kaumnya)\" [ Al-Qalam : 48 ] kita mendapati bahwa kata (ذَا) dinisbatka kepada (ٱلنُّونِ), dan kata (صَاحِبِ) dinisbatkan kepada (ٱلْحُوتِ) namun maksud keduanya adalah Yunus -عليه السلام- , dan merupakan maksud dar itu semua adalah -والله أعلم- bahwa ٱلنُّونِ merupakan nama dari paus yang besar. dan kata (ذَا) adalah kata yang kerap ditujukan kepada sesuatu yang bersifat agung. 2 ). { فَنَادَىٰ فِى ٱلظُّلُمَٰتِ أَن لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبْحَٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّٰلِمِينَ } Kalimat tahlil dan tasbih menyingkirkan segala kedukaan, dan penyelamat dari segala malapetaka dan musibah; dan merupakan kewajib atas siapa yang beriman kepada kitab Allah menjadikan kalimat ini sebagai tempat kembali baginya disetiap kesulitan menghampirinya, dan sebagai tumpangannya dalam bahagia, percaya dan yakin dengan janji Allah kepada orang-orang beriman dengan mengikutkan mereka ke dalam ayat Dzun Nun : { فَٱسْتَجَبْنَا لَهُۥ وَنَجَّيْنَٰهُ مِنَ ٱلْغَمِّ ۚ وَكَذَٰلِكَ نُۨجِى ٱلْمُؤْمِنِينَ }. 3 ). Menampakkan betapa kita membutuhkan bantuan Allah, dan mengakui kesalahan adalah merupakan diantara sebab-sebab diterimanya doa, perhatikan bagaimana Yusuf menggabungkan dua perkara ini dalam doanya: { فَنَادَىٰ فِى ٱلظُّلُمَٰتِ أَن لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبْحَٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّٰلِمِينَ } \"maka ia menyeru dalam keadaan yang sangat gelap: \"Bahwa tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim\". Oleh karena itu sayyidul istighfar adalah sebaik-baiknya doa dan dzikir karena di dalamnya terkandung makna ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Ingatlah juga wahai nabi tentang kisah Dzun Nun yaitu Yunus bin Mata yang tinggal dalam (perut) ikan paus. Allah mengutusnya kepada penduduk Ninawa di negeri seberang. Ketika dia pergi dengan keadaan marah kepada kaumnya karena tidak mau beriman, dan beranggapan bahwa Kami tidak akan menyempitkan urusannya, namun kami biarkan dia meninggalkan mereka. Lalu dia berdoa dalam 3 kegelapan yaitu kegelapan malam, kegelapan laut dan kegelapan perut paus: “Tiada tuhan selain Engkau, Maha Suci Engkau dari sesuatu yang tidak sesuai. Sesungguhnya aku termasuk orang-orang yang menzalimi diri sendiri dengan pergi tanpa seizinMu dan meninggalkan kaumku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzu Nun} dan sebutlah orang yang ditelah paus, yaitu Yunus AS bin Matta {ketika dia pergi dalam keadaan marah} marah terhadap kaumnya, karena kekufuran mereka terhadap tuhanNya {lalu dia menyangka bahwa Kami tidak akan menyulitkannya} menyulitkannya dengan suatu hukuman {Lalu dia berdoa dalam kegelapan yang berlapis} kegelapan dalam perut paus, lautan dan malam {“Tidak ada tuhan selain Engkau. Maha suci Engkau. Sesungguhnya aku termasuk orang-orang zalim”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 87: Yakni ingatlah hamba dan rasul Kami Dzunnun, yaitu Yunus bin Mata dengan menyebutkan kebaikannya dan memujinya. Allah Subhaanahu wa Ta'aala mengutusnya kepada penduduk Neinawa dan mengajak mereka beriman, namun ternyata mereka tidak beriman, maka Beliau mengancam mereka dengan azab yang akan turun setelah berlalu tiga hari. Ketika azab datang, dan mereka menyaksikannya dengan mata kepala, maka mereka keluar ke gurun membawa anak-anak dan hewan ternak mereka, lalu mereka bersama-sama berdoa kepada Allah dengan merendahkan diri kepada-Nya dan bertobat, maka Allah angkat azab itu dari mereka sebagaimana firman Allah Ta’ala, “Dan mengapa tidak ada (penduduk) suatu kota yang beriman, lalu imannya itu bermanfaat kepadanya selain kaum Yunus? Ketika mereka (kaum Yunus itu) beriman, Kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan Kami beri kesenangan kepada mereka sampai kepada waktu yang tertentu.” (Terj. Yunus: 98) dan firman-Nya, “Dan Kami utus dia kepada seratus ribu orang atau lebih.---Lalu mereka beriman, karena itu Kami anugerahkan kenikmatan hidup kepada mereka hingga waktu yang tertentu.” (Terj. Ash Shaffaat: 147-148) Kaum Yunus akhirnya beriman, akan tetapi Yunus pergi meninggalkan kaumnya karena marah kepada mereka padahal Allah belum mengizinkan, Beliau pergi bersama beberapa orang menaiki perahu dan ketika itu datang ombak yang besar, mereka pun khawatir akan tenggelam, maka mereka melakukan undian untuk melempar salah seorang di antara mereka ke laut agar beban perahu semakin ringan, ternyata hasil undian tertuju kepada Yunus, lalu mereka enggan melemparnya, maka mereka mengulangi lagi, dan ternyata tertuju kepada Yunus lagi, namun mereka tetap enggan melemparnya, maka dilakukan undian sekali lagi dan ternyata hasil undian tetap jatuh kepada Yunus, maka Yunus berdiri dan melepas pakaiannya lalu melemparkan dirinya ke laut, dan Allah telah mengirimkan ikan besar, maka ikan itu datang menelan Yunus. Allah mewahyukan kepada ikan itu agar tidak memakan dagingnya dan tidak meremukkan tulangnya karena Yunus bukanlah rezeki untuknya, perutnya hanyalah sebagai penjara baginya. Ada yang berpendapat, bahwa Beliau tinggal dalam perut ikan selama 40 hari. Ketika Beliau mendengar ucapan tasbih dari batu kerikil di tempatnya itu, maka Beliau mengucapkan, “Tidak ada tuhan yang berhak disembah selain Engkau. Mahasuci Engkau. Sungguh, aku termasuk orang-orang yang zalim.” Beliau mengakui keberhakan Allah untuk diibadahi dan menyucikan-Nya dari segala aib dan kekurangan serta mengakui kezaliman dirinya, maka Allah mengabulkan doanya. Allah Subhaanahu wa Ta'aala berfirman, “Maka kalau sekiranya dia tidak termasuk orang-orang yang banyak mengingat Allah,---Niscaya ia akan tetap tinggal di perut ikan itu sampai hari berbangkit.--- Kemudian Kami lemparkan dia ke daerah yang tandus, sedang ia dalam keadaan sakit.--- Dan Kami tumbuhkan untuknya sebatang pohon dari jenis labu.” (Terj. Ash Shaaffaat: 143-146). Kepada kaumnya. Yakni memutuskan baginya untuk ditahan dalam dalam perut ikan atau menyempitkannya. Yang dimaksud dengan keadaan yang sangat gelap ialah di dalam perut ikan, di dalam laut dan di malam hari. Karena meninggalkan kaumku tanpa izin-Mu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 87",
    "description": "Dan ingatlah kisah zun nun (yunus), ketika dia pergi meninggalkan kaumnya dalam keadaan marah, karena mereka berpaling dari dirinya dan tidak mau menerima ajaran Allah ketika ia berdakwah kepada me-reka. Lalu dia menyangka bahwa kami tidak akan menyulitkannya karena sikapnya yang tidak sabar itu. Lalu ia naik perahu, namun beban perahu yang ditumpanginya terlalu berat sehingga harus ada seorang yang dilemparkan ke laut. Setelah diundi tiga kali, nabi yunus yang harus dilemparkan ke laut. Allah segera mendatangkan seekor ikan menelan beliau. Maka dia berdoa dalam keadaan yang sangat gelap, di dalam perut ikan, di dalam laut, dan pada malam hari dengan kesadaran, 'tidak ada tuhan selain engkau, mahasuci engkau. Sungguh, aku termasuk orang-orang yang zalim, karena aku marah meninggalkan kaum yang seharusnya dibimbing olehku. '88. Karena ia berdoa dengan ikhlas serta menyadari kesalahannya, maka kami kabulkan (doa)-Nya dan kami selamatkan dia dari kedukaan dan kesedihan, karena berada dalam perut ikan besar. Dan demikianlah kami menyelamatkan orang-orang yang beriman dari segala kesulitan yang dihadapinya."
  }
]