[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Allah mengabulkan permohonannya, dan Kami lepaskan dia dari kedukaan akibat kesulitan tersebut. Dan demikianlah Kami menyelamatkan orang-orang Mukmin yang membenarkan dan menjalankan syariat Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Lalu Kami mengabulkan doanya dan menyelamatkannya dari kesulitan yang menimpanya dengan mengeluarkannya dari kegelapan, dan dari perut ikan besar itu. Sebagaimana Kami menyelamatkan Yunus dari kesulitan ini, Kami juga menyelamatkan orang-orang beriman bila ditimpa kesulitan dan berdoa kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. وَنَجَّيْنٰهُ مِنَ الْغَمِّ ۚ (dan menyelamatkannya dari pada kedukaan) Dengan mengeluarkannya dari perut ikan paus; ikan tersebut melemparkannya ke tepi pantai. وَكَذٰلِكَ نُۨجِى الْمُؤْمِنِينَ (Dan demikianlah Kami selamatkan orang-orang yang beriman) Yakni Kami bebas mereka dari kegundahan akibat perbuatan mereka sebelumnya, dan Kami siapkan rahmat bagi mereka. Lihatlah kisah Nabi Yunus secara lengkap pada surat ash-Shaffat: 138-149."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "87-88 1 ). Perhatikan ayat ini : { وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَٰضِبًا } \"Dan (ingatlah kisah) Dzun Nun (Yunus), ketika ia pergi dalam keadaan marah\", dan ayat : { وَلَا تَكُن كَصَاحِبِ ٱلْحُوتِ إِذْ نَادَىٰ وَهُوَ مَكْظُومٌ } \"dan janganlah kamu seperti orang yang berada dalam (perut) ikan ketika ia berdoa sedang ia dalam keadaan marah (kepada kaumnya)\" [ Al-Qalam : 48 ] kita mendapati bahwa kata (ذَا) dinisbatka kepada (ٱلنُّونِ), dan kata (صَاحِبِ) dinisbatkan kepada (ٱلْحُوتِ) namun maksud keduanya adalah Yunus -عليه السلام- , dan merupakan maksud dar itu semua adalah -والله أعلم- bahwa ٱلنُّونِ merupakan nama dari paus yang besar. dan kata (ذَا) adalah kata yang kerap ditujukan kepada sesuatu yang bersifat agung. 2 ). { فَنَادَىٰ فِى ٱلظُّلُمَٰتِ أَن لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبْحَٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّٰلِمِينَ } Kalimat tahlil dan tasbih menyingkirkan segala kedukaan, dan penyelamat dari segala malapetaka dan musibah; dan merupakan kewajib atas siapa yang beriman kepada kitab Allah menjadikan kalimat ini sebagai tempat kembali baginya disetiap kesulitan menghampirinya, dan sebagai tumpangannya dalam bahagia, percaya dan yakin dengan janji Allah kepada orang-orang beriman dengan mengikutkan mereka ke dalam ayat Dzun Nun : { فَٱسْتَجَبْنَا لَهُۥ وَنَجَّيْنَٰهُ مِنَ ٱلْغَمِّ ۚ وَكَذَٰلِكَ نُۨجِى ٱلْمُؤْمِنِينَ }. 3 ). Menampakkan betapa kita membutuhkan bantuan Allah, dan mengakui kesalahan adalah merupakan diantara sebab-sebab diterimanya doa, perhatikan bagaimana Yusuf menggabungkan dua perkara ini dalam doanya: { فَنَادَىٰ فِى ٱلظُّلُمَٰتِ أَن لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبْحَٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّٰلِمِينَ } \"maka ia menyeru dalam keadaan yang sangat gelap: \"Bahwa tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim\". Oleh karena itu sayyidul istighfar adalah sebaik-baiknya doa dan dzikir karena di dalamnya terkandung makna ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Lalu Kami kabulkan doanya melalui kata-kata itu dan Kami keluarkan dia dari perut paus yang melemparkannya ke tepi pantai. Seperti halnya menolong Yunus dari kesedihan dan penderitaannya, Kami juga menolong orang-orang mukmin dari kesedihannya, jika mereka meminta pertolongan kepada Kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami mengabulkan (doa)nya dan Kami menyelamatkannya} membebaskannya {dari kedukaan} penderitaan yang dahsyat {Demikianlah Kami menyelamatkan} Kami membebaskan {orang-orang mukmin"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 88: Karena kalimat yang diucapkannya itu. Yakni sebagaimana Kami telah menyelamatkan dia. Maksudnya, dari penderitaan mereka ketika mereka berdoa memohon pertolongan kepada Kami. Hal ini merupakan janji dan kabar gembira dari Allah untuk setiap mukmin yang sedang menderita, bahwa Allah akan menyelamatkannya, menghilangkan deritanya dan meringankannya karena keimanan yang ada dalam dirinya sebagaimana yang Dia lakukan terhadap Yunus ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 88",
    "description": "Karena ia berdoa dengan ikhlas serta menyadari kesalahannya, maka kami kabulkan (doa)-Nya dan kami selamatkan dia dari kedukaan dan kesedihan, karena berada dalam perut ikan besar. Dan demikianlah kami menyelamatkan orang-orang yang beriman dari segala kesulitan yang dihadapinya. 89. Dan ingatlah kisah zakaria, seorang rasul yang terus berusaha dan berdoa agar diberi keturunan, ketika dia berdoa kepada tuhannya dengan khusyuk, 'ya tuhanku, janganlah engkau biarkan aku hidup seorang diri tanpa keturunan yang akan melanjutkan tugasku membimbing umat; dan aku yakin, sekiranya engkau tidak memberikan keturunan kepadaku, engkaulah ahli waris yang terbaik yang akan memelihara agama ini setelah aku wafat."
  }
]