[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami penuhi apa yang telah Kami janjikan kepada nabi-nabi dan para pengikut mereka, berupa kemenangan dan keselamatan, dan telah Kami binasakan orang-orang yang bertindak melampaui batas terhadap diri mereka dengan kekafiran kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Kemudian Kami wujudkan janji Kami kepada para Rasul itu dengan menyelamatkan mereka dan orang-orang yang Kami kehendaki diantara orang-orang beriman dari kebinasaan, adapun orang-orang yang melampaui batas itu maka Kami binasakan mereka lantaran kekafiran mereka kepada Allah, dan kemaksiatan yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Kemudian Kami penuhi janji Kami bagi para rasul dan para pengikut mereka berupa kemenangan dan keselamatan, dan Kami binasakan orang-orang yang menzalimi diri mereka sendiri dengan kekafiran yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. ثُمَّ صَدَقْنٰهُمُ الْوَعْدَ (Kemudian Kami tepati janji (yang telah Kami janjikan) kepada mereka) Yakni dengan menyelamatkan para Rasul dan membinasakan orang yang mendustakan mereka. فَأَنجَيْنٰهُمْ وَمَن نَّشَآءُ(Maka Kami selamatkan mereka dan orang-orang yang Kami kehendaki) Yakni Kami juga menyelamatkan orang-orang beriman dari azab. وَأَهْلَكْنَا الْمُسْرِفِينَ(dan Kami binasakan orang-orang yang melampaui batas) Mereka adalah orang-orang yang melampaui batas dalam kekafiran dan kemaksiatan; yaitu orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kemudian Kami penuhi dan tepati janji bagi mereka, kemudian Kami menyelamatkan mereka dari azab bersama orang-orang mukmin, dan Kami hancurkan para pendusta yang meampaui batas kekufuran dan kemaksiatannya. Mereka itu adalah orang-orang musyrik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami menepati janji kepada mereka} Kami memenuhi janji yang telah Kami janjikan kepada para rasul Kami {Maka Kami selamatkan mereka dan orang-orang yang Kami kehendaki dan Kami binasakan orang-orang yang melampaui batas} melampaui batas dalam berbuat kekufuran dan kemaksiatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-9. Ini merupakan sanggahan atas lontaran syubhat kalangan orang-orang yang mendustakan Rasulullah. Mereka berkomentar, “Kenapa dia (seorang rasul) bukan seorang malaikat yang tidak membutuhkan makanan dan minuman serta mondar-mandir berurusan dengan pasar-pasar! Kenapa dia tidak abadi!” bila dia tidak demikian, berarti menunjukkan dia bukan seorang utusan Allah.” Rangkaian syunhat ini, masih saja menancap di hati-hati kaum yang mendustakan para rasul. Mereka serupa dalam kekufuran, sehingga pernyataan-pernyataan mereka pun senada. Berikutnya, Allah menangkis syuhat orang-orang yang mendustakan Rasulullah, (namun) mengakui penetapan eksistensi para rasul sebelum beliau. Kalau tida ada Nabi melainkan Nabi Ibrahim saja –yang telah diakui kenabbiannya oleh seluruh golongan, yang mana kaun musyrikin melancarkan klaim berpegang teguh pada agama dan ajaran Ibrahim bahwa para rasul sebelum Muhammad semuanya dari kalangan manusia, yang makan makanan, dan berjalan-jalan di pasar-pasar, dan muncul kejadian-kejadian manusiawi yang menimpa mereka seperti kematian dan kejadian lainnya, serta bahwa Allah telah mengutuus mereka kepada kaum dan ummat mereka; lalu sebagian beriman kepada mereka, dan adapula yang mendustakan, dan bahwa Allah benar-benar akan merealisasikan bagi mereka sesuatu yang telah dijanjikan, berupa keselamatan dan kebahagiaan bagi mereka (para utusan Allah) dan para pengikut, dan akan membinasakan orang-orang yang melampaui batas, lagi mendustakan mereka-, maka mengapa banyak syubhat batil yang diarahkan kepada Muahammad dalam rangka mengingkari risalahnya, padahal realita-realita itu melekat pada para saudaranya dari kalangan para rasul yang diakui oleh para pendusta kenabian Muhammad? Ini adalah konsekuensi yang begitu jelas bagi mereka. Jika mereka mengakui kerasulan dari kalangan manusia, namun tidak mau menetapkan seorang rasul dari selain kalangan manusia, maka berarti syubhat mereka (tentang Nabi Muhammad) batil. Mereka telah mematahkannya sendiri dengan pengakuan mereka mengenai rusaknya syubhat mereka dan adanya kontradiksi di tengah (pola pikir) mereka tentang itu. Andai alangkah mereka ini diprediksi menuju pengingkaran kenabian dari kalangan manusia seutuhnya, tidak ada satu pun nabi, melainkan seorang malaikat yang abadi, tidak makan makanan, maka sungguh Allah telah menyanggah syubhat ini dengan FirmanNYa, \"Dan mereka berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) seorang malaikat?\" dan kalau Kami turunkan (kepadanya) seorang malaikat, tentu selesailah urusan itu, kemudian mereka tidak diberi tangguh (sedikit pun). Dan kalau Kami jadikan rasul itu (dari) malaikat, tentulah Kami jadikan dia berupa laki-laki dan (jika Kami jadikan dia berupa laki-Iaki), Kami pun akan jadikan mereka tetap ragu sebagaimana kini mereka ragu.\" (Al-An’am:8-9) Dan bahwa manusia tidak mempunyai kekuatan dalam menerima wahyu dari malaikat (secara langsung), \"Katakanlah: \"Kalau seandainya ada malaikat-malaikat yang berjalan-jalan sebagai penghuni di bumi, niscaya Kami turunkan dari langit kepada mereka malaikat menjadi rasul\". (Al-Isra:95). Jikalau timbul keraguan pada kalian, dan kalian tidak mengetahui selu-beluk para rasul yang sudah lewat, hendaknya mereka bertanya kepada orang-orang yang berilmu tentang kitab-kitab yang terdahulu. Misalnya, para ulama yang menguasai Taurat dan INjil. Mereka bakal memberitahukan tentang ilmu yang mereka miliki kepada kalian, dan bahwa seluruh rasul adalah manusia yang berasal dari jenis bangsa yang diberikan risalah (obyek dakwah). Ayat ini, meskipun sebabnya khusus mengenai pertanyaan tentang jatii diri para rasul yang telah berlalu kepada ahli dzikir, yaitu ulama, tapi sesungguhnya konteksnya umum, mencakup setiap permasalahan agama, perkara yang inti atau cabangnya. Jika seseorang tidak mempunyai pengetahuan tentangnya, hendaknya dia menanyakannya kepada orang yang mengetahuinya. Dalam keterangan ini terkandung pelajaran, adanya perintah untuk belajar dan bertanya kepada ulama. Tidaklah diperintahkan untuk bertanya kepada mereka (ulama) melainkan karena mereka wajib mengajarkan ilmu dan menjawab permasalahan yang mereka ketahui. Di dalam pengkhususan melontarkan pertanyaan kepada ulama, terkandung larangan bertanya kepada orang yang sudah dikenal dengan kebodohannya dan tida berilmu. Di dalamnya juga terkandung larangan bagi orang yang bodoh untuk memposisikan diri untuk menjawab. Dalllam ayat ini termuat sebuah dalil bahwa tidak ada nabi dari kalangan wanita, termasuk Maryam atau lainnya bukan nabi. Hal ini berdasarkan Firman Allah, “Melainkan beberapa orang laki-laki.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 9: Yakni orang-orang yang membenarkan para rasul. Yakni orang-orang yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 9",
    "description": "Kemudian kami tepati janji, yang telah kami janjikan tentang pertolongan dan keselamatan kepada mereka, para rasul dan pengikut-pengikutnya yang beriman. Maka kami selamatkan mereka dan orang-orang yang kami kehendaki di antara umat para rasul itu karena keimanannya; dan kami binasakan dengan bencana alam orang-orang yang melampaui batas, karena kekafiran mereka kepada Allah. 10. Sungguh, kami telah menurunkan kepada kalian, melalui seorang utusan Allah, sebuah kitab Al-Qur'an, agar menjadi pedoman hidup kalian, yang di dalamnya terdapat peringatan bagi kalian tentang tindakan yang menyelamatkan dan mencelakakan kalian. Maka apakah kalian tidak mengerti tujuan Allah menurunkan kitab Al-Qur'an ini'."
  }
]