[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami mengabulkan doanya, dan Kami anugerahkan kepadanya dalam kondisi tua renta, putranya, Yahya. Dan Kami menjadikan istrinya wanita baik akhlaknya dan wanita yang normal yang dapat mengandung dan melahirkan, setelah sebelumnya dia adalah seorang wanita yang mandul. Sesungguhnya mereka itu orang-orang yang bersegera menujun kepada setiap kebajikan, dan memohon kepada kami dengan penuh mengharap kebaikan yang ada di sisi Kami, juga takut terhadap siksaan Kami. Dan mereka adalah orang-orang yang tunduk lagi rendah hati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Maka Kami kabulkan doanya. Kami karuniakan padanya seorang putra bernama Yahya, dan menjadikan istrinya dapat mengandung setelah sebelumnya merupakan wanita yang mandul. Sesungguhnya Zakariya, istrinya dan putranya dahulu selalu bersegera dalam mengerjakan kebaikan, dan mereka senantiasa berdoa kepada Kami dengan mengharapkan pahala dari sisi Kami, dan merasa cemas dari adanya hukuman Kami, dan sungguh mereka adalah orang-orang yang khusyuk lagi tunduk kepada Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. فَاسْتَجَبْنَا لَهُۥ (Maka Kami memperkenankan doanya) Yakni mengabulkan doanya. وَوَهَبْنَا لَهُۥ يَحْيَىٰ( dan Kami anugerahkan kepada nya Yahya) Telah disebutkan sebelumnya dalam surat Maryam. وَأَصْلَحْنَا لَهُۥ زَوْجَهُۥٓ ۚ( dan Kami jadikan isterinya dapat mengandung) Dahulu istrinya mandul, kemudian Allah menjadikannya dapat memberi keturunan. Pendapat lain mengatakan dahulu istrinya memiliki akhlak yang buruk, kemudian Allah menjadikannya istri yang berakhlak baik. إِنَّهُمْ كَانُوا۟ يُسٰرِعُونَ فِى الْخَيْرٰتِ(Sesungguhnya mereka adalah orang-orang yang selalu bersegera dalam (mengerjakan) perbuatan-perbuatan yang baik) Mereka senantiasa mempersembahkan amal kebaikan tanpa lelah. وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ( dan mereka berdoa kepada Kami dengan harap dan cemas) Yakni mereka bersimpuh kepada Allah dengan harapan mendapat kebaikan dan dijauhkan dari keburukan baik itu di waktu lapang maupun di waktu susah. وَكَانُوا۟ لَنَا خٰشِعِينَ(Dan mereka adalah orang-orang yang khusyu’ kepada Kami) Yakni tunduk dan merendahkan diri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah memberi nikmat kepada Zakaria dengan firman-Nya : { وَأَصْلَحْنَا لَهُۥ زَوْجَهُۥٓ ۚ} \"dan Kami jadikan isterinya dapat mengandung\" dari segi bahasa kata (إصْلَاح) berarti memperbaiki, oleh karena itu para ulama mengatakan: menjadi kewajiban setiap kaum lelaki untuk senantiasa bersungguh-bersungguh mengharap ridho Allah dengan memperbaiki kadaan istrinya. 2 ). Ayat ini merupakan manhaj yang benar dalam mengingatkan kita agar selalu memohon kebaikan kepada Allah tatkala disebutkan suatu kebaikan dari para orang-orang shalih. Abu Bakr ash-Shiddiq berkata: Inilah kitab Allah, yang tidak akan pernah sirna keajaibannya, dan tidak akan mati cahayanya, mohonlah kalian darinya penerangan hari ini untuk hari yang akan sangat gelap, dan mohonlah kalian darinya nasihat dan penjelasannya, karena sesungguhnya Allah telah memuji dan memuliakan suatu kaum dalam firman-Nya: { إِنَّهُمْ كَانُوا۟ يُسَٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ وَكَانُوا۟ لَنَا خَٰشِعِينَ } \"Sesungguhnya mereka adalah orang-orang yang selalu bersegera dalam (mengerjakan) perbuatan-perbuatan yang baik dan mereka berdoa kepada Kami dengan harap dan cemas. Dan mereka adalah orang-orang yang khusyu' kepada Kami\" 3 ). { إِنَّهُمْ كَانُوا۟ يُسَٰرِعُونَ فِى ٱلْخَيْرَٰتِ } \"Sesungguhnya mereka adalah orang-orang yang selalu bersegera dalam (mengerjakan) perbuatan-perbuatan yang baik\" ayat tidak mengatakan ( يُسَٰرِعُونَ إلى ٱلْخَيْرَٰتِ ) karena mereka benar-benar berada dalam lingkaran itu, tidak untuk sekedar mencoba. 4 ). Barangsiapa yang mengamati kisah para nabi yang diceritakan oleh Allah dalam surah al-Anbiya', dan bagaimana Ibrahim selamat dari kobaran api, dan Luth dari masyarakat kampung yang seluruhnya berbuat kekejian, dan Nuh dari pada ombak yang besar, dan juga bagaimana Allah mengajari Daud dan memahamkan kepada SUlaiman, juga bagaimana Allah membukakan kesususahan dari Ayyub, dan memberikan anak keturunan kepada Zakaria? kemudian Allah berfirman: { إِنَّهُمْ كَانُوا۟ يُسَٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ وَكَانُوا۟ لَنَا خَٰشِعِينَ } \"Sesungguhnya mereka adalah orang-orang yang selalu bersegera dalam (mengerjakan) perbuatan-perbuatan yang baik dan mereka berdoa kepada Kami dengan harap dan cemas. Dan mereka adalah orang-orang yang khusyu' kepada Kami\" niscaya ia akan memahami bagaimana doa-doa dan permintaan tu dikabulkan oleh Allah. 5 ). Diantara gambaran keluarga harmonis adalah dimana sepasang suami-istri saling berlomba-lomba dalam kebaikan... istri membantu suaminya, dan suami membantu istrinya, mereka melukiskan detik-detik keharmonisan rumah tangga nabi yang dijadikan sebagai tolak ukur kebaikan untuk setiap keluarga; maka adakah yang mengambil pelajaran dari kisah Zakaria bersama istrinya? : { إِنَّهُمْ كَانُوا۟ يُسَٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ وَكَانُوا۟ لَنَا خَٰشِعِينَ } \"Sesungguhnya mereka adalah orang-orang yang selalu bersegera dalam (mengerjakan) perbuatan-perbuatan yang baik dan mereka berdoa kepada Kami dengan harap dan cemas. Dan mereka adalah orang-orang yang khusyu' kepada Kami\" niscaya ia akan memahami bagaimana doa-doa dan permintaan itu dikabulkan oleh Allah. 6 ). { وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ} \"dan mereka berdoa kepada Kami dengan harap dan cemas\" Hasan al-Bashri berkata tentang ayat ini: ketakutan mereka terus berlanjut sampai-sampai ketakutan itu tidak bisa terlepas dari hati meraka, jika datang mereka suatu kecendrungan, mereka takut jika itu adalah istidraj dari Allah bagi mereka, dan jika datang kepada mereka rasa cemas, mereka takut jika itu adalah perintah Allah agar diambil dari mereka apa yang dimiliki. 7 ). Jika seorang mukmin mengamati ayat ini dengan seksama, niscaya akan mendapati bahwa jalan tepat bagi dirinya dalam ibadah dan kehidupannya, adalah dengan menyeimbangkan antara rasa harap dan cemas, tidak mengutamakan satu dari keduanya diatas lainnya, dan inilah yang menjadi pegangan para nabi dan orang terdahulu dari ummat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Lalu Kami kabulkan doanya dan Kami anugerahkan kepadanya anak yang bernama Yahya. Kami jadikan istrinya bisa melahirkan setelah sebelumnya mandul. Sesungguhnya Zakaria, istrinya, anaknya, Yahya, dan nabi-nabi yang telah disebutkan itu selalu bergegas untuk melakukan ketaatan dan tunduk kepada Kami seraya mengharapkan rahmat dan kebaikan dari Kami dan takut dari azab Kami dan perbuatan buruk baik dalam keadaan menderita maupun sejahtera. Dan mereka itu adalah orang-orang yang rendah hati dalam beribadah kepada Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{lalu Kami mengabulkan (doa)nya, menganugerahkan Yahya kepadanya, dan menjadikan shalihah istrinya} dan Kami menjadikan istrinya shalihah {Sesungguhnya mereka selalu bersegera} bersegera {dalam kebaikan dan berdoa kepada Kami dengan harap dan cemas} mengharap pahala dan takut pada hukuman {Mereka adalah orang-orang yang khusyuk kepada Kami} merendah dan tunduk"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 90: Setelah sebelumnya mandul berkat doa Zakaria. Inilah di antara pentingnya mencari teman hidup yang saleh agar mendapatkan pula kebaikannya. Setelah Allah Subhaanahu wa Ta'aala menyebutkan para nabi dan rasul secara sendiri-sendiri, maka Allah puji mereka secara umum. Yakni ketaatan. Mereka segera melakukannya pada waktu-waktu yang utama, menyempurnakannya dan tidak meninggalkan satu keutamaan pun yang mampu dilakukan kecuali dilakukannya serta memanfaatkan waktu sebaik-baiknya. Maksudnya, mereka meminta kepada Allah dalam hal yang yang diinginkan yang terkait dengan maslahat dunia dan akhirat, serta berlindung kepada-Nya dari sesuatu yang tidak diinginkan yang ada di dunia dan akhirat. Mereka berharap dan cemas, tidak lalai dan tidak mengulur-ulur. Menurut Ats Tsauri, maksud dengan harap dan cemas adalah, bahwa mereka mengharapkan apa (kenikmatan) yang ada di sisi-Nya dan takut terhadap azab di sisi-Nya. Dalam ibadahnya. Hal ini karena tingginya ma’rifat (pengenalan) mereka terhadap Tuhan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 90",
    "description": "Karena zakaria terus berusaha dan tekun berdoa memohon keturunan, maka kami kabulkan doa-Nya, meskipun istrinya sudah tua dan mandul. Dan kami pun menganugerahkan kepadanya yahya, seorang anak yang cerdas dan saleh; dan kami jadikan istrinya yang tua dan mandul itu dapat mengandung. Sungguh, mereka, zakaria dan istrinya, senantiasa bersegera dalam mengerjakan berbagai kebaikan yang menyebabkan doanya dikabulkan; dan mereka senantiasa berdoa kepada kami untuk mendapatkan keturunan dengan penuh harap akan dikabulkan dan cemas karena menyadari istrinya tua dan mandul. Dan mereka orang-orang yang khusyuk, dalam beribadah dan berdoa kepada kami. 91. Dan ingatlah kisah maryam, seorang perempuan salehah, yang memelihara kehormatannya dari berbuat zina, bahkan dari sentuhan laki-laki. Lalu kami tiupkan roh dari kami ke dalam rahim-Nya sehingga ia hamil; dan kami jadikan dia dan anaknya sejak lahir sebagai tanda kebesaran Allah bagi seluruh alam, karena anak itu lahir tanpa ayah, bisa berbicara sejak bayi dan menyatakan dirinya hamba Allah, serta menjadi nabi dan rasul Allah."
  }
]