[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Rasul) kisah Maryam putri Imran yang menjaga kehormatannya dari perbuatan haram, dan dia tidak melakukan perbuatan keji sepanjang hidupnya. Kemudian Allah mengutus Jibril kepadanya. Lalu dia meniup kerah baju Maryam. Tiupan itu sampai ke dalam rahimnya. Kemudian Allah menciptakan al-Masih Isa Bin Maryam melalui tiupan tersebut. Akhirnya, Maryam mengandungnya tanpa ada suami. Maka dengan keadaan demikian, dia dan putranya menjadi pertanda kuasa Allah dan pelajaran bagi semua makhluk hingga terjadinya Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Dan ingatlah -wahai Rasul- tentang kisah Maryam -'alaihassalām- yang menjaga kehormatan dirinya dari perbuatan zina, lalu Allah mengutus padanya Jibril -'alaihissalām-. Lalu Jibril meniupkan ruh ke dalam tubuhnya hingga iapun mengandung Isa -'alaihissalām-. Dia dan anaknya Isa termasuk tanda-tanda kekuasaan Allah bagi manusia, dan bahwasanya tidak ada sesuatu pun yang tidak sanggup dilakukan-Nya, di mana Dia menciptakan manusia tanpa ayah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Dan ingatlah kisah wanita yang benar, Maryam binti Imran, yang Kami jaga kemaluannya dari hal yang haram. Kemudian Kami utus malaikat Jibril, lalu dia meniup lubang bajunya, maka Maryam menjadi mengandung Isa. Dan Kami menjadikan Maryam dan anaknya sebagai tanda kekuasaan Allah bagi jin dan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. وَالَّتِىٓ أَحْصَنَتْ فَرْجَهَا (Dan Maryam yang telah memelihara kehormatannya) Yakni ingatlah kisah Maryam; dia telah menjaga kehormatannya dan tidak pernah disentuh seorang laki-laki pun. فَنَفَخْنَا فِيهَا مِن رُّوحِنَا(lalu Kami tiupkan ke dalam (tubuh)nya ruh dari Kami) Yakni ruh nabi Isa. وَجَعَلْنٰهَا وَابْنَهَآ ءَايَةً لِّلْعٰلَمِينَ(dan Kami jadikan dia dan anaknya tanda (kekuasaan Allah) yang besar bagi semesta alam) Tanda kekuasaan Allah dari keduanya, sebab Maryam melahirkannya tanpa ayah serta mukjizat-mukjizat yang ditunjukkan Allah lewat tangan Nabi Isa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Ingatlah juga wahai Nabi, tentang kisah Maryam binti Imran menjaga farjinya dari yang halal dan haram, serta masih suci. Lalu Kami letakkan salah satu rahasia Kami di dalam perutnya untuk menciptakan Isa dan menghidupkannya. Dan Kami jadikan dia dan puteranya sebagai tanda bagi alam manusia, jin dan malaikat yang mana dia melahirkan Isa tanpa melalui anak dan sebagai petunjuk bagi mereka atas kekuasaan Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan yang memelihara kehormatannya} dan sebutkanlah tentang Maryam binti Imran yang menjaga kehormatannya dari sesuatu yang haram {lalu Kami meniupkan ke dalamnya ruh (dari) Kami} lalu Kami memerintahkan Jibril untuk meniupkan ruh ke dalam lengan bajunya, sehingga dia mengandung Isa dalam perutnya {Kami menjadikan dia dan anaknya sebagai tanda} tanda atas kesempurnaan kuasa Kami {bagi seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. Dan ingatlah Maryam untuk menyanjung dan menceritakan kedudukan tingginya, serta menyebarluaskan tentang kemuliaannya, “yang telah memelihara kehormatannya,” memeliharanya dari perbuatan haram dan (dari) mendekatinya, bahkan dari hal-hal yang diharamkan sekalipun. Ia belum menikah karena menyibukkan diri dengan ibadah dan menghabiskan waktunya untuk mengabdikan diri kepada Rabbnya. Ketika Jibril mendatanginya dalam rupa seorang lelaki yang normal, dengan fisik dan ketampanan yang sempurna, \"Maryam berkata: \"Sesungguhnya aku berlindung dari padamu kepada Tuhan Yang Maha Pemurah, jika kamu seorang yang bertakwa\". (Maryam:18). Maka Allah membalasinya dengan balasan yang sesuuai dengan amalannya, dan memberinya keturunan tanpa keberadaan suami. Akan tetapi (dengan cara) jibril meniupkan padanya ruh sehingga hamil dengan izin Allah, “dan Kami jadikan dia dan anaknya tanda (kekuasaan Allah) yang besar bagi semesta alam,” di mana beliau mengandung (tanpa suami) dan melahirkannya tanpa bantuan penanganan dari orang lain. Lalu si jabang bayi berbicara ketika masih di gendongan, dan Allah merehabilitasi namanya dari tuduhan orang-orang yang menuduhnya dengan tuduhan yang tidak baik. Lalu Allah memberitahukan tentang dirinya dalam kondisi itu. Selanjutnya , Allah mempraktikan (melaluinya) berbagai macam keajaiban dan mukjizat yang sudah diketahui bersama. Maka, Maryam dan putranya menjadi tanda kebesaran Allah bagi sekalian alam. Generasi-generasi bergantian membicarakannya dan orang-orang pun memetik pelajaran darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 91: Jibril datang kepadanya dalam wujud seorang laki-laki yang sempurna, lalu karena ketinggian ‘iffah (kesucian) diri Maryam, ia berkata, “Aku berlindung kepada Tuhan yang Maha Pengasih dari kamu, jika kamu seorang yang bertakwa,” maka Allah memberikan balasan terhadap amalnya yang salih dan mengaruniakan anak tanpa bapak, bahkan dengan tiupan Jibril yang meniup ke dalam leher baju Maryam, lalu Maryam mengandung Isa ‘alaihis salam dengan izin Allah. Karena dia lahir tanpa ada bapak, dan yang demikian adalah mudah bagi Allah, sebagaimana Dia menciptakan Adam tanpa ibu dan bapak dan menciptakan Hawa’ dari tulang rusuk Adam. Demikian pula terdapat tanda kekuasaan Allah, yaitu ketika anak Maryam Isa ‘alaihis salam dapat berbicara di masa buaian, dibersihkan-Nya Maryam dari tuduhan zina yang ditujukan kepadanya, dan diberikan mukjizat kepada anaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 91",
    "description": "Dan ingatlah kisah maryam, seorang perempuan salehah, yang memelihara kehormatannya dari berbuat zina, bahkan dari sentuhan laki-laki. Lalu kami tiupkan roh dari kami ke dalam rahim-Nya sehingga ia hamil; dan kami jadikan dia dan anaknya sejak lahir sebagai tanda kebesaran Allah bagi seluruh alam, karena anak itu lahir tanpa ayah, bisa berbicara sejak bayi dan menyatakan dirinya hamba Allah, serta menjadi nabi dan rasul Allah. 92. Pada ayat sebelumnya dijelaskan kisah para nabi seperti nabi ibrahim, lut, ishak, yakub, nuh, dawud, sulaiman, ayub, ismail, idris, zulkifli, yunus, zakaria, dan yahya. Mereka mengajarkan prinsip tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya. Sungguh, agama tauhid yang diajarkan oleh para nabi inilah agama kamu, agama yang sama dengan yang diajarkan rasulullah berdasarkan Al-Qur'an, yaitu agama yang satu untuk seluruh umat, agama penyerahan diri kepada Allah. Dan aku, Allah, adalah tuhanmu, yang menciptakan langit dan bumi; maka sembahlah aku sepanjang hayat kamu, tuhan yang menghidupkan dan mematikan kamu."
  }
]