[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nabi-nabi tersebut seluruhnya, agama mereka satu, Islam, yaitu berserah diri kepada Allah dengan taat dan mengesakanNya dengan ibadah. Dan Allah, Penguasa seluruh makhluk , sembahlah Dia (wahai sekalian manusia) semata dan tiada sekutu bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Sesungguhnya inilah agama kalian semua -wahai manusia-, suatu agama yang satu, yaitu agama tauhid yang merupakan agama Islam, dan Aku adalah Tuhan kalian, maka murnikanlah ibadah hanya kepada-Ku semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Hai para hamba, agama kalian yang dibawa oleh para rasul ini adalah agama Islam, dan Aku adalah Tuhan kalian, tidak ada Tuhan selain Aku, maka sembahlah Aku Semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. إِنَّ هٰذِهِۦٓ أُمَّتُكُمْ أُمَّةً وٰحِدَةً (Sesungguhnya (agama Tauhid) ini adalah agama kamu semua; agama yang satu) Yakni agama kalian ini adalah agama yang satu, tidak ada perbedaan antara umar-umat yang lain dalam hal tauhid; agama ini adalah agama Islam. وَأَنَا۠ رَبُّكُمْ فَاعْبُدُونِ(dan Aku adalah Tuhanmu, maka sembahlah Aku) Janganlah kalian menyembah selain Aku, apapun itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Umat islam jika mereka lupa bahwa mereka bersatu, dan fanatisme jahilia memisahkan mereka; sesungguhnya matahari arafah mengingatkan mereka tentang persatuan itu, dan mengembalikan mereka kepadanya, dan setiap ibadah dan amalan-amalan haji mengingatkan tentang perkara yang besar itu { إِنَّ هَٰذِهِۦٓ أُمَّتُكُمْ أُمَّةً وَٰحِدَةً وَأَنَا۠ رَبُّكُمْ فَٱعْبُدُونِ } \"Sesungguhnya (agama Tauhid) ini adalah agama kamu semua; agama yang satu dan Aku adalah Tuhanmu, maka sembahlah Aku\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Sesungguhnya ini adalah agama kalian, satu agama yang tidak ada penyimpangan di dalamnya terkait ketauhidan, yaitu agama Islam. Dan Aku adalah Tuhan kalian, Allah, Tiada Tuhan selain Aku. Maka esakanlah Aku dan sembahlah Aku dengan ikhlas tanpa ada niatan lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ini adalah agama kalian, agama yang satu} agama kalian agama yang satu, yaitu agama Islam {dan Aku adalah Tuhan kalian. Maka sembahlah Aku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. Saat Allah mengisahkan tentang para nabi, Dia mengajak komunikasi kepada manusia, “SEsungguhnya (agama tauhid) ini adalah agama kamu semua, agama yang satu,” para rasul yang telah disebutkan itu, mereka juga bangsa kalian dan tokoh-tokoh panutan kalian yang kalian ikut berjalan di belakang mereka dan menelusuri petunjuk mereka. Mereka semua berpegang teguh pada agama yang satu dan jalan yang satu, juga mempunyai satu Rabb. Karenanya, Allah berfirman, “Dan Aku adalah Rabbmu.” Aku-lah yang menciptakan kalian dan merawat kalian dengan nikmatKu yang berkaitan dengan agama ataupun kehidupan duniawi. jika Rabb kalian satu, dan nabi (kalian) satu, agama (kalian) satu, yaitu penyembahan kepada Allah semata, tidak ada sekutu bagiNya dalam seluruh ragam ibadah, maka tugas dan kewajiban yang mesti kalian tunaikan adalah melaksanakan tugas itu (beribadah kepada Allah semata). Oleh sebab itu, Allah berfirman, “Maka sembahlah Aku.” Allah menempatkan urutan perintah beribadah kepadaNya berdasarkan keterangan sebelumnya dengan huruf fa’, yaitu mengurutkan sebuah sebab masalah berdasarkan faktor penyebabnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 92: Setelah Allah menyebutkan semua para nabi, Dia berfirman kepada semua manusia. Yani para rasul yang telah disebutkan adalah satu umat dengan kamu dan pemimpin kamu yang harus kamu ikuti dan kamu pakai petunjuknya, dan bahwa mereka berada di atas agama yang satu, yaitu agama tauhid atau Islam, di mana mereka semua sama-sama menyeru kepada tauhid (mengesakan Allah). Semua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 92",
    "description": "Pada ayat sebelumnya dijelaskan kisah para nabi seperti nabi ibrahim, lut, ishak, yakub, nuh, dawud, sulaiman, ayub, ismail, idris, zulkifli, yunus, zakaria, dan yahya. Mereka mengajarkan prinsip tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya. Sungguh, agama tauhid yang diajarkan oleh para nabi inilah agama kamu, agama yang sama dengan yang diajarkan rasulullah berdasarkan Al-Qur'an, yaitu agama yang satu untuk seluruh umat, agama penyerahan diri kepada Allah. Dan aku, Allah, adalah tuhanmu, yang menciptakan langit dan bumi; maka sembahlah aku sepanjang hayat kamu, tuhan yang menghidupkan dan mematikan kamu. 93. Meskipun misi para nabi itu mengajarkan satu agama kepada manusia, yaitu agama tauhid, tetapi mereka terpecah belah dalam urusan agama mereka di antara mereka ke dalam berbagai agama. Ada yang lurus memegang prinsip tauhid dan ada pula yang menyimpang. Masing-masing golongan itu semua akan kembali kepada kami di akhirat untuk mempertanggungjawabkan perbuatan mereka selama hidup di dunia."
  }
]