[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi manusia malah berselisih (sikap) terhadap rasul-rasul mereka, dan terpecah kebanyakan pengikut mereka dalam agama menjadi berkelompok-kelompok dan bergolongan –golongan. Mereka menyembah sesama makhluk dan hawa nafsu. Dan mereka semua akan kembali kepada Kami, dan menghadapi perhitungan atas apa yang mereka perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Akan tetapi manusia berpecah belah, sehingga di antara mereka ada yang bertauhid, musyrik, kafir dan mukmin. Semua orang yang berpecah belah tersebut masing-masing akan kembali kepada Kami saja pada hari Kiamat kelak, dan akan Kami berikan mereka balasan atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Akan tetapi para hamba saling berselisih dan terpecah menjadi banyak golongan; sebagian mereka beriman kepada Allah dan sebagian lain ingkar dan berpaling. Mereka semua akan kembali kepada Kami pada hari kiamat untuk mendapat balasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَتَقَطَّعُوٓا۟ أَمْرَهُم بَيْنَهُمْ ۖ (Dan mereka telah memotong-motong urusan (agama) mereka di antara mereka) Yakni terpecah belah dalam agama menjadi beberapa golongan sehingga menjadi seperti potongan-potongan yang tercerai berai; yang ini orang yang mengesakan Allah dan orang ini Yahudi, dan yang lain Nasrani; padahal kewajiban mereka adalah berada dalam agama Islam; satu Tuhan dan satu agama untuk seluruh umat. كُلٌّ إِلَيْنَا رٰجِعُونَ(Kepada Kamilah masing-masing golongan itu akan kembali) Yakni setiap golongan tersebut akan kembali kepada Kami pada hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Manusia terpecah dalam beberapa golongan terkait permasalahn agama, sedangkan pada dasarnya agama itu hanya satu. Di antara mereka ada yang beriman dan bertauhid, ada yang kufur dan syirik, ada juga yang berinterpretasi dan terjerumus dalam kesyirikan seperti orang Yahudi dan Nasrani. Masing-masing kelompok ini akan kembali kepada Kami pada hari kiamat untuk dibalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan mereka terpecah-belah dalam urusan di antara mereka} manusia terpecah belah dalam urusan agama mereka yang diperintahkan oleh Allah, sehingga mereka dalam hal itu menjadi kelompok-kelompok dan golongan-golongan {Masing-masing akan kembali kepada Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. Idealnya, bersatu padu pada perkara ini, dan tidak berpecah-belah di dalamnya. Akan tetapi, “(dorongan) bertindak zhalim dan melampaui batas” menolak persatuan, dan hanya menerima keadaan terpecah-belah dan terpisah-pisah. Karena itu, Allah berfirman, “Dan mereka telah memotong-motong urusan (agama) mereka di antara mereka,” maksudnya golongan-golongan yang mengaku mengikuti para pengikut nabi terpecah-belah dan bercerai-berai. Setiap pihak mengklaim berada di atas kebenaran, sementara kebatilan bersama dengan pihak lainnya. Setiap golongan bangga dengan apa yang mereka miliki. Padahal sudah dimaklumi bersama, pihak yang benar dari kalangan mereka, yaitu yang meniti pada agama yang lurus dan jalan yang lempeng, dengan mengikuti para nabi. Kenyataan ini akan terlihat, bila tabir (kebenaran) sudah tersibak, kegelapan sudah pergi dan Allah mengumpulkan umat manusi untuk mengadili mereka. Saat itulah, orang yang benar akan jelas berbeda dari orang yang berdusta. Karena itu, Allah berfirman, “Masing-masing golongan itu,” dari setiap kelompok yang bercerai-berai dan selain mereka “akan kembali kepada Kami,” maka Kami membalasi mereka dengan balasan yang sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 93: Oleh karena Tuhan mereka hanya satu, agama yang diturunkan Allah itu adalah satu, yaitu agama tauhid (agama Islam), seruan para nabi adalah sama, maka seharusnya mereka berkumpul di atas agama yang satu itu (Islam) dan tidak berpecah belah. Akan tetapi kedengkian dan permusuhan menghendaki mereka berpecah belah. Masing-masing mereka menyangka bahwa merekalah yang benar sedangkan yang lain salah dan masing-masing bangga dengan kelompoknya. Padahal sudah maklum, bahwa yang benar di antara mereka adalah orang yang menempuh jalan yang lurus mengikuti para nabi, tidak sekedar pengakuan di lisan, dan kebenarannya akan nyata ketika yang tersembunyi menjadi nampak, yaitu ketika Allah mengumpulkan semua makhluk untuk diberikan keputusan. Ketika itulah, nampak siapa yang benar dan siapa yang dusta. Untuk diberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 93",
    "description": "Meskipun misi para nabi itu mengajarkan satu agama kepada manusia, yaitu agama tauhid, tetapi mereka terpecah belah dalam urusan agama mereka di antara mereka ke dalam berbagai agama. Ada yang lurus memegang prinsip tauhid dan ada pula yang menyimpang. Masing-masing golongan itu semua akan kembali kepada kami di akhirat untuk mempertanggungjawabkan perbuatan mereka selama hidup di dunia. 94. Manusia dalam mempertanggungjawabkan perbuatannya di hadap-an Allah sangat tergantung kepada pilihan hidupnya di dunia. Barang siapa mengerjakan kebajikan kepada Allah, sesama manusia, dan alam, dan dia melakukan kebajikan itu sebagai orang beriman, atas dasar ke-imanannya yang mantap, maka usahanya sekecil apa pun juga dalam mewujudkan kebajikan itu tidak akan diingkari, disia-siakan hingga ter-buang percuma, tetapi akan tetap tersimpan; dan sungguh, kamilah yang mencatat perbuatan baik itu untuknya. Demikian juga, perbuatan buruk sekecil apa pun tercatat dengan akurat dan akan diperlihatkan kepada tiap-tiap manusia dengan objektif."
  }
]