[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa berpegang teguh dengan keimanan kepada Allah dan rasul-rasulNya, dan dia mengerjakan apa yang dia mampu dari amal-amal shalih, karena taat kepada Allah dalam rangka beribadah kepadaNya, maka Allah tidak akan menyia-nyiakan amalnya dan tidak akan menghapusnya, bahkan Dia akan melipatgandakannya semuanya dengan kelipatan yang banyak, dan orang itu akan mendapatkan apa yang telah dia kerjakan di dalam kitab (catatan amal) nya pada hari dia dibangkitkan setelah matinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Barangsiapa di antara mereka yang mengerjakan amal saleh sedang ia beriman kepada Allah, para Rasul, dan hari Kiamat, maka amal salehnya tersebut tidak akan diingkari dan disia-siakan, bahkan Allah akan memberikan pahala baginya dan melipat gandakan pahala tersebut, dan ia pasti akan mendapatkannya dalam buku catatan amalnya di Hari Kebangkitan kelak, sehingga ia pun bisa bergembira karenanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Barangsiapa yang mengerjakan suatu ketaatan sedangkan dia adalah orang yang beriman maka pahalanya tidak akan dilalaikan, dan Kami akan mengawasi perbuatannya dan mencatatnya dalam kitab amalannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. فَمَن يَعْمَلْ مِنَ الصّٰلِحٰتِ (Maka barang siapa yang mengerjakan amal saleh) Sebagian amalan-amalan keshalehan. وَهُوَ مُؤْمِنٌ(sedang ia beriman) Beriman kepada Allah, para Rasul, dan hari akhir. فَلَا كُفْرَانَ لِسَعْيِهِۦ (maka tidak ada pengingkaran terhadap amalannya itu) Yakni amalannya tidak akan diingkari dan tidak akan disia-siakan balasannya. وَإِنَّا لَهُۥ كٰتِبُونَ (dan sesungguhnya Kami menuliskan amalannya itu untuknya) Yakni menjaganya dengan menulis amalan baik mereka di kitab catatan amal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Dan barangsiapa mengerjakan amal shalih yang yang diperintahkan Allah, yaitu beriman kepada Allah, rasulallah dan hari akhir, maka tidak ada penolakan dan pengingkaran dalam amal, pahala dan balasan baiknya. Dan sesungguhnya Kami mengamati usahanya dan mencatat catatan amalnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang mengerjakan amal shalih dan dia beriman, maka tidak akan diingkari usahanya} maka amalnya tidak disangkal, bahkan disyukuri dan diberi imbalan {Sesungguhnya Kami adalah yang mencatat untuknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Sesudah itu, Allah membeberkan balasanNYa bagi mereka, secara eksplisit maupun implisit. Allah berfirman, “Maka barangsiapa yang mengerjakan amal shalih,” yaitu amalan-amalan yang telah disyariatkan oleh para rasul dan dianjurkan oleh kitab-kitab Allah “sedang dia beriman,” kepada Allah dan para RasulNya serta risalah yang mereka emban, “maka tidak ada pengingkaran terhadap amalan itu,” maksudnya Kami tidak akan menyia-nyiakan dan mengugurkan usahanya. Bahkan Kami akan melipatgandakannya berllipat-lipat. “Dan sesungguhnya Kami menuliskan amalannya itu untuknya,” maksudnya Kami menetapkannya di Lauh Mahfuzh dan di lembaran-lembaran amalan yang bersama para malaikat penjaga amalan. Maksudnya, (secara eksplisit) siapa saja yang tidak beramal shalih, atau mengamalkannya tanpa beriman kepada Allah, maka sesungguhnya dia terhalangi (dari pahala kebaikan), merugi dalam agama dan dunianya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 94: Amal yang diperintahkan para rasul dan didorong oleh semua kitab. Kepada rukun iman yang enam. Bahkan Allah akan melipatgandakannya. Sebaliknya, barang siapa yang tidak beramal saleh atau beramal saleh namun tidak beriman, maka ia terhalang mendapatkan pahala dan rugi pada agama dan akhiratnya. Yakni dengan memerintahkan para malaikat hafazhah (penjaga manusia) untuk mencatatnya untuk diberikan balasan, di samping telah dicatat dalam Al Lauhul Mahfuzh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 94",
    "description": "Manusia dalam mempertanggungjawabkan perbuatannya di hadap-an Allah sangat tergantung kepada pilihan hidupnya di dunia. Barang siapa mengerjakan kebajikan kepada Allah, sesama manusia, dan alam, dan dia melakukan kebajikan itu sebagai orang beriman, atas dasar ke-imanannya yang mantap, maka usahanya sekecil apa pun juga dalam mewujudkan kebajikan itu tidak akan diingkari, disia-siakan hingga ter-buang percuma, tetapi akan tetap tersimpan; dan sungguh, kamilah yang mencatat perbuatan baik itu untuknya. Demikian juga, perbuatan buruk sekecil apa pun tercatat dengan akurat dan akan diperlihatkan kepada tiap-tiap manusia dengan objektif. 95. Di antara umat manusia ada yang dibinasakan sebagai hukuman atas kekufurannya, dan ada juga yang dibiarkan. Dan tidak mungkin bagi penduduk suatu negeri yang telah kami binasakan, baik di masa silam, sekarang, maupun di masa depan, bahwa mereka tidak akan kembali kepada kami guna mempertanggungjawabkan perbuatannya selama hidup di dunia."
  }
]