[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mustahil bagi penduduk negeri yang telah Kami binasakan dikarenakan kekafiran dan perbuatan zhalim mereka, untuk kembali ke dunia sebelum Hari Kiamat, untuk mengejar kekurangan dalam amalan yang mereka tinggalkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Dan mustahil bagi penduduk suatu negeri yang telah Kami binasakan lantaran kekafiran mereka, untuk kembali lagi ke dunia agar bertobat dan tobat mereka tersebut diterima."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95-97. Allah telah menetapkan bahwa setiap penduduk negeri yang telah dibinasakan tidak akan dapat kembali ke dunia. Hingga saat mendekati terjadinya hari kiamat, ketika benteng penghalang Ya’juj dan Ma’juj dibuka -keduanya adalah kabilah besar dari golongan manusia- mereka akan turun dari tempat yang tinggi dengan cepat, dan hari kiamat sudah dekat, maka orang-orang kafir akan terbelalak matanya karena menyaksikan kengerian hari itu, mereka akan berkata dengan penuh penyesalan: “Duhai celakalah kami, ketika di dunia kami telah lalai dari hari yang sulit ini, dan kami adalah orang-orang yang menzilimi diri sendiri karena telah mendustakan para rasul.” Dari Abu Sa’id al-Khudri, Rasulullah bersabda: \"Ya'juj dan Ma'juj akan dibukakan (jalan keluarnya), lantas mereka keluar sebagaimana yang difirmankan oleh Allah: '(Hingga apabila dibukakan (tembok) Ya'juj dan Ma'juj, dan mereka turun dengan cepat dari seluruh tempat yang tinggi) ' (Qs. Al Anbiyaa; 96). Kemudian mereka menguasai bumi seluruhnya dan sebagian kaum Muslimin berpihak ke golongan mereka, sedangkan sisanya berada di kota-kota dan benteng-benteng beserta hewan ternak mereka. Ketika mereka melintasi sungai, mereka meminumnya hingga tidak menyisakan sedikitpun air di dalamnya. Lalu ketika kelompok yang terakhir dari mereka melintas, salah seorang dari kelompok tersebut berkata: 'Sungguh, dahulu tempat ini mengalirkan banyak air!' Kemudian mereka muncul ke permukaan tanah, dan salah seorang di antara mereka berkata: 'Mereka semua adalah penduduk bumi, dan kami telah selesai (mengalahkan) mereka, dan sungguh kami akan menantang penduduk langit.' Sehingga seorang dari mereka melemparkan tombaknya ke langit, maka tombak tersebut kembali dengan lumuran darah. Lalu mereka berkata: 'Kita telah membunuh penghuni langit.' Ketika mereka dalam keadaan seperti ini, Allah mengutus sekawanan binatang seperti ulat (belatung) pada belalang, lalu menyerang leher-leher mereka sehingga mereka mati bergelimpangan seperti matinya belalang, dan mereka saling bertumpukan. Pada pagi harinya, kaum muslimin tidak mendengar suara mereka, maka mereka bertanya: 'Siapakah kiranya seorang yang siap mengorbankan dirinya dan melihat apa yang mereka perbuat?' Maka turunlah seorang laki-laki dari mereka yang telah menyiapkan dirinya untuk terbunuh, namun laki-laki itu mendapati Ya’juj dan Ma’juj telah mati semua, maka ia pun berseru kepada mereka (kaum Muslimin), 'Bergembiralah, musuh kalian telah binasa!' Maka orang-orang pun keluar dan melepaskan ternak-ternak mereka, dan mereka tidak mendapati makanan bagi hewan-hewan ternak itu melainkan dari daging-daging Ya’juj dan Ma’juj, sehingga hewan ternak mereka menjadi sangat gemuk melebihi gemuknya ketika memakan tumbuh-tumbuhan.” (Diriwayatkan oleh Ibnu Majah dalam sunan – fitnah-fitnah, bab fitnah dajjal dan keluarnya Isa bin Maryam serta keluarnya Ya’juj dan Ma’juj, 2/1363 no. 4079. dishahihkan oleh al-Bushiri dalam kitab Mishbah al-Zujajah 2/311. Al-Albani berkata: ini adalah hadits hasan (shahih ibnu Majah 2/388). Ibnu Katsir juga menyebutkan hadits ini, 5/367)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. وَحَرٰمٌ عَلَىٰ قَرْيَةٍ أَهْلَكْنٰهَآ أَنَّهُمْ لَا يَرْجِعُونَ (Sungguh tidak mungkin atas (penduduk) suatu negeri yang telah Kami binasakan, bahwa mereka tidak akan kembali (kepada Kami) Yakni tidak mungkin bagi penduduk setiap negeri yang Kami takdirkan untuk Kami binasakan dapat kembali ke dunia setelah mereka binasa. Pendapat lain mengatakan maknanya adalah mereka tidak mungkin tidak dikembalikan kepada Kami untuk pembalasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Tidak mungkin bagi penduduk negeri yang telah Kami binasakan akibat dosa-dosanya itu akan kembali ke dunia atau bertaubat setelah dibinasakan itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mustahil bagi suatu negeri} tidak mungkin bagi penduduk suatu negeri {yang telah Kami binasakan tidak kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Maksudnya menjadi perkara mustahil, perkampungan-perkampungan yang telah dibinasakan, yang dihujani siksaan (dari Allah) kembali lagi ke dunia untuk memperbaiki keteledoran mereka. Tidak ada jalan untuk kembali bagi orang yang sudah dibinasakan dan ditimpa siksa. Hendaknya, orang-orang (yang sedang diajak bicara oleh ayat ini) berhati-hati agar tidak meneruskan perkara-perkara yang akan mendatangkan kehancuran hingga nanti benar-benar terjadi sehingga akhirnya tidak dapat ditolak. Tinggalkanlah (itu semua) di waktu yang masih memungkinkan dan kesempatan (untuk memperbaiki diri)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 95: Ada pula yang mengartikan, bahwa mustahil bagi mereka kembali ke dunia setelah mereka mati. Yakni negeri-negeri yang telah dibinasakan tidak mungkin kembali ke dunia untuk mengerjakan perbuatan yang telah mereka lalaikan. Oleh karena itu, hendaknya manusia berhati-hati terhadap sebab yang dapat membinasakan mereka, di mana ketika tiba azab itu, mereka tidak mungkin menolaknya dan tidak mungkin mengerjakan amal saleh yang telah mereka tinggalkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 95",
    "description": "Di antara umat manusia ada yang dibinasakan sebagai hukuman atas kekufurannya, dan ada juga yang dibiarkan. Dan tidak mungkin bagi penduduk suatu negeri yang telah kami binasakan, baik di masa silam, sekarang, maupun di masa depan, bahwa mereka tidak akan kembali kepada kami guna mempertanggungjawabkan perbuatannya selama hidup di dunia. 96. Kebinasaan suatu negeri bisa jadi karena serangan bangsa biadab seperti yakjuj dan makjuj, tartar dan mongol, yang membuat keru-sakan di bumi. Lalu zulkarnain, seorang raja yang kuat, membuat benteng kokoh dari besi dan tembaga guna melindungi bangsa yang lemah dari keganasan yakjuj dan makjuj. Hingga apabila benteng yang menghalangi yakjuj dan makjuj dibukakan seperti yang terjadi pada serangan jengis khan dan hulagu khan, keturunan bangsa tartar dan mongol, maka terjadilah kehancuran sejak asia tengah hingga bagdad tahun 1258. Dan mereka, yakjuj dan makjuj, turun dengan cepat dari seluruh tempat yang tinggi melakukan kerusakan di bumi dengan membunuh, merampas, dan melakukan segala macam keganasan. (lihat surah al-kahf/18: 94-99)."
  }
]