[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "96-97. Apabila tembok penutup Ya’juj dan Ma’juj dibuka, dan mereka merangsek segera dari dataran-dataran yang tinggi, dan mereka kemudian menyebar di sisi-sisinya dengan tepat. Dan telah dekatlah Hari Kiamat, dan tampaklah kengerian-kengeriannya. Tiba-tiba pandangan-pandangan orang-orang kafir terbelalak terbuka tidak bisa berkedip dikarenakan dahsyatnya rasa takut mereka. Mereka memekikkan kecelakaan bagi diri mereka dalam penyesalan dengan berkata, “Celaka kami, kami telah bermain-main lagi lalai terhadap hari ini dan untuk mempersiapkan diri untuk menyongsongnya. Dan kami dengan sikap itu telah menzhalimi diri sendiri.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Mereka sama sekali tidak akan pernah kembali ke dunia. Hingga jika tembok Yakjuj dan Makjuj dibukakan, dan pada hari itu mereka keluar dengan cepat dari setiap tempat yang tinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. حَتَّىٰٓ إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ (Hingga apabila dibukakan (tembok) Ya’juj dan Ma’juj) Yakni orang-orang yang disebutkan tadi akan tetap pada perbuatan mereka sampai datang tanda-tanda kedatangan hari kiamat yang diantaranya adalah terbukanya tembok yang mengurung Ya’juj dan Ma’juj. وَهُم مِّن كُلِّ حَدَبٍ يَنسِلُونَ(dan mereka turun dengan cepat dari seluruh tempat yang tingg) Yakni Ya’juj dan Ma’juj ketika itu akan keluar dari setiap dataran tinggi di bumi yang bergerak dengan cepat menuju tempat yang telah ditakdirkan bagi mereka. Dan keluarnya mereka adalah bagian dari tanda-tanda kedatangan hari kiamat telah dekat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Mereka tidak bisa kembali sampai terjadinya hari kiamat dan munculnya tanda-tanda kiamat di antaranya yaitu terbukanya penghalang bagi Ya’juj dan Ma’juj yaitu suku yang kejam. Dari setiap tempat tinggi di bumi mereka keluar dengan cepat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sehingga apabila Ya’juj dan Ma’juj dibuka} dibuka penghalang Ya’juj dan Ma’juj {dan mereka berjalan dengan cepat} bergegas dalam berjalan {dari seluruh tempat yang tinggi} tempat yang tinggi di bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. INi sebuah peringatan dari Allah bagi sekalian manusia agar mereka tidak selalu berada di atas kekufuran dan kubangan maksiat, serta bahwa sudah dekat masa keluarnya Ya’juj dan Ma’juj. Mereka adalah dua suku besar dari kalangan Bani Adam. Dzul Qarnain telah menutup gerbang keluar bagi mereka tatkala sampai kepada beliau (keluhan orang-orang) mengenai sepak terjang perusakan yang mereka perbuat di bumi. Di akhir zaman nanti, pintu akan terbuka. Mereka pun bertebaran menuju orang-orang. Padahal kondisi ini, gambaran yang disebutkan Allah adalah (mereka) berasal dari tempat yang tinggi, yakni hadb “mereka turun dengan cepat,” dengan bergegas. Pada ayat ini terkandung pertanda besarnya jumlah mereka yang banyak lagi fantastis, dan kecepatan pergerakan mereka di bumi, baik dengan kemampuan mereka sendiri atau melalui cara-cara yang Allah ciptakan bagi mereka berupa sebab-sebab yang dapat mendekatkan jarak tempuh yang jauh, mempermudah perjalanan yang sulit. Mereka itu menundukkan orang-orang dan menguasai mereka di dunia. Tidak ada seorang pun yang berdaya unttuk memerangi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 96: Ayat ini merupakan tahdzir (peringatan) dari Allah kepada manusia agar mereka berhenti dari kekafiran dan kemaksiatan, dan bahwa sesungguhnya telah dekat waktu keluarnya Ya’juj dan Ma’juj; kedua kabilah besar dari keturunan Adam yang telah dibuat dinding besar oleh Dzulqarnain ketika manusia pada waktu itu mengeluhkan kepadanya tentang pengrusakan mereka di muka bumi. Keluarnya Ya’juj dan Ma’juj merupakan tanda besar hari kiamat yang menunjukkan sudah sangat dekatnya hari kiamat. Mereka akan keluar dari tempat-tempat tinggi dengan bersegera dan mengadakan kerusakan di muka bumi, mengalahkan manusia dan tidak ada yang sanggup memerangi mereka. Oleh karena itulah Nabi Isa ‘alaihis salam beserta pengikutnya berlindung di balik gunung, hingga kemudian Beliau berdoa kepada Allah agar mereka dibinasakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 96",
    "description": "Kebinasaan suatu negeri bisa jadi karena serangan bangsa biadab seperti yakjuj dan makjuj, tartar dan mongol, yang membuat keru-sakan di bumi. Lalu zulkarnain, seorang raja yang kuat, membuat benteng kokoh dari besi dan tembaga guna melindungi bangsa yang lemah dari keganasan yakjuj dan makjuj. Hingga apabila benteng yang menghalangi yakjuj dan makjuj dibukakan seperti yang terjadi pada serangan jengis khan dan hulagu khan, keturunan bangsa tartar dan mongol, maka terjadilah kehancuran sejak asia tengah hingga bagdad tahun 1258. Dan mereka, yakjuj dan makjuj, turun dengan cepat dari seluruh tempat yang tinggi melakukan kerusakan di bumi dengan membunuh, merampas, dan melakukan segala macam keganasan. (lihat surah al-kahf/18: 94-99)97. Allah menjanjikan bahwa kehidupan dunia ini akan binasa dengan terjadinya kiamat. Dan apabila janji yang benar, kiamat itu telah dekat, maka tiba-tiba mata orang-orang yang kafir terbelalak karena panik, terkejut, dan bingung apa yang harus dilakukan. Mereka berkata dengan jujur, 'alangkah celakanya kami! kami benar-benar lengah tentang ini, tidak percaya akan terjadi kiamat dan tidak mempersiapkan diri dengan beriman dan beramal saleh, bahkan kami benar-benar orang yang zalim, karena kami mendustakan kiamat dan terus berbuat maksiat. '."
  }
]