[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "96-97. Apabila tembok penutup Ya’juj dan Ma’juj dibuka, dan mereka merangsek segera dari dataran-dataran yang tinggi, dan mereka kemudian menyebar di sisi-sisinya dengan tepat. Dan telah dekatlah Hari Kiamat, dan tampaklah kengerian-kengeriannya. Tiba-tiba pandangan-pandangan orang-orang kafir terbelalak terbuka tidak bisa berkedip dikarenakan dahsyatnya rasa takut mereka. Mereka memekikkan kecelakaan bagi diri mereka dalam penyesalan dengan berkata, “Celaka kami, kami telah bermain-main lagi lalai terhadap hari ini dan untuk mempersiapkan diri untuk menyongsongnya. Dan kami dengan sikap itu telah menzhalimi diri sendiri.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Dan dengan keluarnya mereka, hari Kiamat pun telah dekat, kondisi mengerikan dan kesengsaraan hari itu pun telah mulai nampak. Tiba-tiba pandangan orang-orang kafir terbelalak lantaran kengerian hari itu seraya berkata, \"Alangkah celakanya kami! Sungguh dahulu kami di dunia hanya berada dalam kesia-siaan dan tidak bersiap untuk mengahadapi hari yang besar ini, bahkan dahulu kami hanyalah orang-orang zalim dengan berbuat kafir dan mengerjakan maksiat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. وَاقْتَرَبَ الْوَعْدُ الْحَقُّ (Dan telah dekatlah kedatangan janji yang benar) Yakni sampai apabila Ya’juj dan Ma’juj telah keluar maka janji yang benar ini telah dekat kedatangannya, yakni hari kiamat, sebab keluarnya mereka adalah bagian dari tanda-tanda kedatangan hari kiamat telah dekat. فَإِذَا هِىَ شٰخِصَةٌ أَبْصٰرُ الَّذِينَ كَفَرُوا۟( maka tiba-tiba terbelalaklah mata orang-orang yang kafir) Karena besarnya kengerian yang mendatangi mereka maka mereka membelalakkan mata mereka pada sesuatu yang telah mengagetkan mereka itu sambil berkata: يٰوَيْلَنَا قَدْ كُنَّا فِى غَفْلَةٍ مِّنْ هٰذَا”Aduhai, celakalah kami, sesungguhnya kami adalah dalam kelalaian tentang ini.” Yakni tentang hari kebangkitan dan perhitungan, sehingga kami tidak mempersiapkannya. بَلْ كُنَّا ظٰلِمِينَ (bahkan kami adalah orang-orang yang zalim) Mereka menyebut diri mereka sendiri bahwa mereka lalai dan mereka mengakui bahwa mereka adalah orang-orang yang zalim akibat kekafiran dan kemaksiatan mereka terhadap perintah Tuhan mereka dan petunjuk para nabi mereka. Yakni kami tidak hanya lalai tapi kami juga adalah orang-orang yang zalim karena kami mendustakan dan tidak mentaati Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Dengan keluarnya mereka, maka telah dekatlah janji yang haq itu, yaitu hari kiamat. Demikian itu termasuk tanda-tanda kiamat. Ketika itu, kelopak-kelopak mata terbelalak akibat serangan mereka (Ya’juj dan Ma’juj), yaitu tatapan orang kafir hampir termangu karena sangat ketakutan, atau pandangan mereka berhenti bergerak. Celakalah kami, sungguh kami adalah orang-orang yang melupakan hari ini di dunia. Kami tidak mempersiapkan diri untuk menyongsongnya, bahkan kami menzalimi diri sendiri dengan mendustakan rasul, mengingkari hari kebangkitan dan penghisaban, dan tidak melakukan ketaatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan janji yang benar} hari Kiamat {telah semakin dekat, maka tiba-tiba terbelalak} tebelalak hampir keluar {mata orang-orang kafir itu “Celakaklah kami, sungguh kami benar-benar lengah tentang ini, bahkan kami adalah orang-orang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. “Dan telah dekatlah kedatangan janji yang benar (Hari Kebangkitan),” yaitu Hari Kiamat yang sudah Allah janjikan kedatanganNya. Janji Allah sungguh-sungguh akan terwujud dan benar. Pada hari itu, engkau akan menyaksikan pandangan orang-orang kafir terbelalak karena dahsyatnya kekagetan mereka, prahara-prahara yang memiriskan hati dan kegaduhan yang mencekam. Mereka tidak menyadari kejahatan dan dosa-dosa mereka. Mereka meneriakkan kecelakaan, kebinasaan, dan penyesalan, serta kesedihan atas kesempatan yang telah terlewatkan. Mereka bekata, “Sesungguhnya kami dahulu dalam kelalaian tentang ini,” tentang hari yang agung ini. Kami di dunia terlenakan, asyik dalam permainan dunia sampai saat datangnya keyakinan (ajal), dan kami memasuki Hari Kiamat. Seandainya ada orang yang bisa meninggal gara-gara penyesalan dan kesedihan, niscaya mereka akan mati (karenanya). “Bahkan kami dahulu adalah orang-orang yang zhalim,” mereka mengakui tindak aniaya yang mereka perbuat dan keadilan Allah mengenai mereka. Pada hari itu, diperintahkan agar mereka dan sesembahan-sesembahan mereka dicampakkan ke dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 97: Yaitu hari kiamat. Karena dahsyatnya. Yakni tentang hari kiamat sehingga mereka tidak beramal saleh dan mengisi hidup mereka dengan bersenang-senang. Karena mendustakan para rasul. Ketika hari kiamat itulah, mereka dan apa yang mereka sembah selain Allah dihadapkan ke neraka dan siap menjadi bahan bakarnya, nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 97",
    "description": "Allah menjanjikan bahwa kehidupan dunia ini akan binasa dengan terjadinya kiamat. Dan apabila janji yang benar, kiamat itu telah dekat, maka tiba-tiba mata orang-orang yang kafir terbelalak karena panik, terkejut, dan bingung apa yang harus dilakukan. Mereka berkata dengan jujur, 'alangkah celakanya kami! kami benar-benar lengah tentang ini, tidak percaya akan terjadi kiamat dan tidak mempersiapkan diri dengan beriman dan beramal saleh, bahkan kami benar-benar orang yang zalim, karena kami mendustakan kiamat dan terus berbuat maksiat. '98. Ayat sebelumnya menggambarkan keadaan orang kafir yang terbe-lalak, panik, terkejut, dan bingung menyaksikan kiamat. Ayat ini men-jelaskan keadaan orang yang menyekutukan Allah. Sungguh, kamu'orang yang menyekutukan Allah'dan apa yang kamu sembah selain Allah, baik berupa manusia, patung, setan, jin maupun roh leluhur adalah bahan bakar jahanam yang menyebabkan api jahanam terus me-Nyala. Kamu, karena menyekutukan Allah, pasti akan masuk ke dalamnya dan menjadi bahan bakarnya."
  }
]