[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kalian itu (wahai orang-orang kafir) dan apa yang kalian sembah selain Allah berupa berhala-berhala,serta orang-orang yang setuju dengan penyembahan kalian kepada mereka, dari bangsa jin dan manusia, akan menjadi bahan bakar Neraka Jahannam dan kayu bakarnya; kalian dan mereka akan memasukinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Sungguh kalian -wahai orang-orang musyrik- dan yang kalian sembah selain Allah baik berupa patung-patung ataupun orang yang rida disembah selain Allah dari kalangan manusia dan jin; akan menjadi bahan bakar Neraka Jahanam, kalian dan tuhan-tuhan yang kalian sembah pasti akan memasukinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98-100. Hai orang-orang musyrik, kalian dan berhala-berhala yang kalian sembah adalah bahan bakar api neraka, kalian akan kekal di dalamnya. Seandainya berhala-berhala yang kalian sembah itu adalah tuhan niscaya mereka tidak akan masuk neraka Jahannam. Kalian akan kekal di dalam neraka selama-lamanya. Orang-orang kafir itu mengerang karena azab yang sangat keras dan karena kesedihan mereka. Di dalam neraka mereka sama sekali tidak mendengar sesuatu yang dapat menenangkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. إِنَّكُمْ وَمَا تَعْبُدُونَ مِن دُونِ اللهِ (Sesungguhnya kamu dan apa yang kamu sembah selain Allah) Yakni berupa berhala-berhala. حَصَبُ جَهَنَّمَ (adalah umpan Jahannam) Yakni bahan bakar neraka. أَنتُمْ لَهَا وٰرِدُونَ(kamu pasti masuk ke dalamnya) Nabi Isa dan para malaikat tidak termasuk yang dimaksud dalam ayat ini, sebab kata (ما) digunakan bagi benda yang tidak berakal, dan juga ayat ini ditujukan kepada orang-orang musyrik dari penduduk Makkah, dan bukan kepada yang lainnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Hikmah dari masuknya patung-patung sembahan mereka ke dalam neraka, padahal ia adalah benda mati yang tidak berakal, dan ia pun tidak memilki dosa sedikit pun; adalah sebagai menjelas akan kebohongan dan kedustaan orang-orang yang menjadikannya tuhan, dan agar siksaan mereka ditambah; oleh karena itu Allah berfirman pada ayat selanjutnya : { لَوْ كَانَ هَٰؤُلَاءِ آلِهَةً مَا وَرَدُوهَا } \"Andaikata berhala-berhala itu Tuhan, tentulah mereka tidak masuk neraka\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Sesungguhnya kalian wahai orang kafir, orang musyrik dan apa yang kalian sembah selain Allah berupa berhala dan setan adalah bahan bakar dan kayu pembakaran di neraka Jahanam. Kalian adalah orang-orang yang dimasukkan di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kalian dan apa yang kalian sembah selain Allah adalah bahan bakar neraka Jahanam} bahan bakar neraka Jahanam {Kalian adalah orang-orang yang masuk} orang-orang yang masuk {ke dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Maksudnya, sesungguhnya kalian wahai orang-orang yang menyembah sesembahan lain selain Allah “adalah umpan Jahanam,” maksudnya menjadi bahan bakar dan kayu bakarnya “kamu pasti masuk ke dalamnya,” dan berhala-berhala kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 98: Imam Thahawi meriwayatkan dalam Musykilul Atsar dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma, ia berkata, “Ada ayat dalam kitabullah yang tidak ditanyakan kepadaku oleh orang-orang dan aku tidak mengetahui, apakah mereka sudah mengetahui maksudnya sehingga tidak bertanya.” Lalu dikatakan, “Ayat apa itu?” Ia menjawab, “Yaitu ketika turun ayat, “Sungguh, kamu (orang kafir) dan apa yang kamu sembah selain Allah, adalah bahan bakar Jahannam. Kamu (pasti) masuk ke dalamnya.” Ayat ini terasa berat bagi penduduk Mekah. Mereka berkata, “Muhammad telah mencaci-maki tuhan-tuhan kita.” Lalu Ibnuz Zab’ariy bangkit dan berkata, “Ada apa dengan kamu?” Mereka menjawab, “Muhammad telah mencaci-maki tuhan-tuhan kita.” Ibnuz Zab’ariy berkata, “Apa yang ia ucapkan.” Mereka menjawab, “Dia (Muhammad) berkata, ““Sungguh, kamu (orang kafir) dan apa yang kamu sembah selain Allah, adalah bahan bakar Jahannam. Kamu (pasti) masuk ke dalamnya.” Ia (Ibnuz Zab’ariy) berkata, “Panggillah dia kepadaku.” Maka dipanggilah Nabi Muhammad shallallahu 'alaihi wa sallam, lalu Ibnuz Zab’ariy berkata, “Wahai Muhammad, apakah (ayat) ini ditujukan kepada tuhan-tuhan kami saja atau untuk semua yang disembah selain Allah?” Beliau menjawab, “Bahkan untuk semua yang disembah selain Allah ‘Azza wa Jalla.” Ibnuz Zab’ariy berkata, “Kami akan pertentangkan hal itu, demi Tuhan pemilik bangunan ini. Wahai Muhammad, bukankah engkau mengatakan bahwa Isa adalah hamba yang saleh dan ‘Uzair adalah hamba yang salih, demikian pula para malaikat adalah hamba yang saleh?”Beliau menjawab, “Ya.” Ibnuz Zab’ariy berkata, “(Bukankah) Orang-orang Nasrani menyembah Isa, orang-orang Yahudi menyembah ‘Uzair, dan Bani Mulaih ini menyembah malaikat?” Penduduk Mekah pun bersorak karenanya, maka turunlah ayat, “Sungguh, sejak dahulu bagi orang-orang yang telah ada (ketetapan) yang baik dari Kami, mereka itu akan dijauhkan (dari neraka.” (Terj. Al Anbiyaa’: 101) Demikian pula turun ayat, “Dan ketika putra Maryam (Isa) dijadikan perumpamaan tiba-tiba kaummu (Quraisy) bersorak karenanya.” (Terj. Az Zukhruf: 57). Hadits ini menurut Syaikh Muqbil adalah shahih lighairih. Sesembahan orang musyrik yang masuk ke dalam neraka adalah patung, berhala dan orang yang disembah sedang dirinya ridha. Adapun Nabi Isa ‘alaihis salam yang disembah orang-orang Nasrani, ‘Uzair yang disembah orang-orang Yahudi dan para malaikat yang disembah oleh sebagian musyrikin, maka mereka tidak masuk neraka, karena mereka tidak ridha disembah dan mereka tergolong ke dalam ayat 101 di surah ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 98",
    "description": "Ayat sebelumnya menggambarkan keadaan orang kafir yang terbe-lalak, panik, terkejut, dan bingung menyaksikan kiamat. Ayat ini men-jelaskan keadaan orang yang menyekutukan Allah. Sungguh, kamu'orang yang menyekutukan Allah'dan apa yang kamu sembah selain Allah, baik berupa manusia, patung, setan, jin maupun roh leluhur adalah bahan bakar jahanam yang menyebabkan api jahanam terus me-Nyala. Kamu, karena menyekutukan Allah, pasti akan masuk ke dalamnya dan menjadi bahan bakarnya. 99. Seandainya benar keyakinan mereka bahwa berhala-berhala yang disembah itu tuhan, mereka berhala-berhala itu, tidak akan memasuki ne-raka; tetapi karena keyakinan mereka sesat, semuanya, baik yang me-nyembah maupun yang disembah akan kekal di dalamnya, karena Allah mengekalkannya."
  }
]