[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya obyek-obyek yang kalian sembah selain Allah itu benar-benar tuhan-tuhan yang berhak untuk disembah, pastilah mereka tidak masuk Neraka Jahanam bersama kalian, wahai orang-orang musyrik. Sesungguhnya masing-masing dari para penyembah dan yang disembah akan kekal di dalam Neraka Jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Seandainya tuhan-tuhan yang kalian sembah ini adalah tuhan-tuhan yang disembah secara hak, maka mereka dan orang-orang yang menyembah mereka tidak akan masuk neraka. Tetapi semua para penyembah dan yang disembah akan masuk ke dalam Neraka, mereka semua kekal di dalamnya, dan tidak akan pernah keluar darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. لَوْ كَانَ هٰٓؤُلَآءِ ءَالِهَةً مَّا وَرَدُوهَا ۖ (Andaikata berhala-berhala itu Tuhan, tentulah mereka tidak masuk neraka) Yakni seandainya berhala-berhala ini adalah tuhan-tuhan sebagaimana yang kalian katakan, maka mereka tidak mungkin akan masuk neraka, akan tetapi mereka masuk neraka, oleh sebab itu mereka bukanlah tuhan-tuhan. وَكُلٌّ فِيهَا خٰلِدُونَ(Dan semuanya akan kekal di dalamnya) Yakni semua penyembah dan yang disembah berada di neraka, mereka kekal di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Jika saja sesembahan-sesembahan berupa berhala dan benda lainnya itu adalah Tuhan sebagaimana yang kalian asumsikan, tentu mereka tidak akan masuk neraka karena yang disiksa itu bukanlah Tuhan. Semua yang menyembah dan yang disembah itu abadi dan kekal di dalam neraka Jahanam, sehingga mereka bukanlah Tuhan. Penyebab sesembahan-sesembahan berupa berhala dan setan itu masuk neraka yaitu agar para penyembahnya bertambah sedih dan merugi. Kecuali atau tidak termasuk di dalamnya yaitu Uzair, Isa, dan para malaikat, sesuai firman Allah SWT berikut: {Sesungguhnya orang-orang yang telah memiliki ketetapan baik dari kami, maka mereka itu dijauhkan dari neraka} [QS. Al-Anbiya’ 21/101] dan karena kata {Ma} tidak mencakup mereka yang berakal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya berhala-berhala itu adalah tuhan, maka mereka tidak akan memasukinya} mereka tidak memasuki neraka {Semuanya akan kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Hikmah masuknya berhala-berhala itu ke dalam neraka, padahal merupakan benda-benda mati yang tidak bisa berpikir, tidak punya dosa, adalah unttuk menjelaskan kedustaan orang-orang yang mendaulatnya sebagai sesembahan dan agar siksaan mereka semakin berat. Oleh karena itu, Allah berfirman, “Andaikata berhala-berhala itu tuhan-tuhan, tentulah mereka tidak masuk neraka,” firman ini semakna dengan Firman Allah, \"agar Allah menjelaskan kepada mereka apa yang mereka perselisihkan itu, dan agar orang-orang kafir itu mengetahui bahwasanya mereka adalah orang-orang yang berdusta.\" (An-Nahl:39). Masing-masing dari pihak yang menyembah dan obyek yang disembah akan kekal abadi di dalamnya, tidak akan pernah keluar darinya dan tidak akan berpindah darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anbiya ayat 99: Sebagaimana yang kamu sangka. Inilah hikmah mengapa sesembahan mereka dimasukkan pula ke dalam neraka, agar jelas bagi mereka bahwa semua itu tidak pantas disembah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anbiya Ayat 99",
    "description": "Seandainya benar keyakinan mereka bahwa berhala-berhala yang disembah itu tuhan, mereka berhala-berhala itu, tidak akan memasuki ne-raka; tetapi karena keyakinan mereka sesat, semuanya, baik yang me-nyembah maupun yang disembah akan kekal di dalamnya, karena Allah mengekalkannya. 100. Para penghuni neraka tidak kuat berada di dalamnya. Mereka merintih dan menjerit merasakan penderitaan di dalamnya yang tiada ber-akhir. Dan mereka pun di dalamnya tidak dapat mendengar sedikit pun suara indah, lembut, dan damai yang membawa ketenangan dan kenikmatan."
  }
]