[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Mereka saling melihat dan saling mengenal, tetapi tidak ada yang bisa memberi manfaat kepada orang lain, orang kafir berharap seandainya dia bisa menebus dirinya dari azab Hari Kiamat denagn anak-anaknya, istrinya, saudaranya dan keluarganya yang menaunginya dan kepada mereka dia menisbatkan dirinya, serta dengan seluruh manusia di bumi dan lainnya, kemudian selamat dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Setiap orang menyaksikan kawan karibnya, tidak ada yang tersembunyi olehnya, namun meski demikian masing-masing tidak saling bertanya dikarenakan dahsyatnya kondisi saat itu. Orang yang dipastikan masuk Neraka berkeinginan agar dia bisa menebus siksa yang menimpanya pada hari itu dengan anak-anaknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-14. Meskipun pada hari kiamat seseorang melihat orang-orang yang dia kenal ketika di dunia, seperti anak-anak, saudara-saudara, dan pada temannya; namun dia enggan berbicara dengan mereka karena telah sibuk dengan urusannya sendiri. Dan orang kafir pada hari itu sangat ingin agar anak-anak, istri, saudara, dan anggota keluarga besarnya dapat menggantikannya menjalani hisab, -karena dia mengetahui tempat kesudahannya adalah azab yang menghinakan-, bahkan menginginkan seluruh penghuni bumi dapat menggantikannya agar dia sendiri dapat selamat dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11-12. يُبَصَّرُونَهُمْ ۚ (sedang mereka saling memandang) Yakni setiap orang melihat teman sejatinya yang ia kenal namun mereka tidak saling bicara atau menanyakan keadaanya, sebab setiap mereka sibuk dengan dirinya masing-masing. يَوَدُّ الْمُجْرِمُ(Orang kafir ingin) Yakni orang yang berdosa yang layak mendapatkan siksa neraka. لَوْ يَفْتَدِى مِنْ عَذَابِ يَوْمِئِذٍۭ( kalau sekiranya dia dapat menebus (dirinya) dari azab hari itu) Yakni dari azab pada hari kiamat yang akan menimpa mereka. بِبَنِيهِ وَصٰحِبَتِهِۦ (dengan anak-anaknya dan isterinya) Yakni istrinya. وَأَخِيهِ(dan saudaranya) Padahal mereka adalah orang-orang yang paling ia cintai. Namun seandainya tebusan dapat diterima niscaya ia akan menebus dirinya dengan mereka sehingga dapat selamat dari azab yang akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Setiap teman dihadapkan kepada teman dekatnya. Mereka tidak berani berpaling dari Allah SWT. Mereka tidak berani memalingkan pandangannya karena keadaan yang sangat mengerikan. Orang kafir ingin dan berandai-andai untuk menebus dirinya dari azab kiamat yang ditimpakan kepadanya menggunakan anak-anaknya. Law adalah huruf yang menjadikan fiil setelahnya menjadi mashdar, sehingga menjadi “iftida’ nafsahu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan mereka saling melihat} mereka melihat dan mengenalnya {Orang yang durhaka itu menginginkan} mengharapkan {sekiranya dia dapat menebus dari azab hari itu dengan anak-anaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-14. Bila huru-hara dan kondisi genting ini dialami oleh makhluk besar dan kuat, lantas bagaimana engkau membayangkannya terhadap manusia lemah yang punggungnya diperberat oleh berbagai kesalahan dan dosa? Bukankah hatinya akan terlepas dan akalnya akan tergoncang dan tidak akan sempat memikirkan orang lain? Karena itu Allah berfirman, “Dan tidak ada seorang teman akrab pun menanyakan temannya, padahal mereka saling melihat,” yakni teman akrab melihat temannya tapi hatinya tidak memungkinkannya untuk bertanya tentang kondisinya dan segala sesuatu yang berkaitan dengan keluarga dan rasa cinta mereka; yang ada dalam benaknya hanyalah diri pribadi. “Orang kafir ingin,” yakni orang kafir yang berhak mendapatkan azab, “kalau sekiranya dia dapat menebus (dirinya) dari azab hari itu dengan anak-anaknya, dan istrinya dan saudaranya, dan kaum familinya,” yakni kerabatnya, “yang melindunginya ( di dunia),” yakni seperti biasa terjadi di dunia untuk saling menolong dan membantu satu sama lain. Pada Hari Kiamat, tidak seorang pun yang bisa menolong lainnya dan tidak ada seorang pun yang bisa memberi syafaat kecuali atas izin Allah. Bahkan jika pun orang berdosa yang berhak mendapatkan siksa menebus siksaan dengan seluruh yang ada di bumi agar bisa selamat dari siksaan tersebut, hal itu tidak berguna baginya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 11: 11-14. Allah mengabarkan bahwa sebagian dari keadaan hari kiamat adalah setiap orang melihat atas sebagian yang lain; Akan tetapi tidak bertanya dan tidak berbica (satu sama lain), karena sebab tersibukkannya masing-masing dengan dirinya sendiri. Dan pada hari kiamat (manusia) merasakan kesulitan sehingga orang kafir yang mendustakan Allah, ayat-ayat-Nya dan Rasul-Nya berandai-andai, seandainya dirinya dapat lolos dari adzab Allah dengan bantuan manusia lainnya seperti anak-anak (mereka), istri, saudara dan kaumnya yang memiliki hubungan dengannya; Bahkan siapa saja di bumi (yang ia kenal), kemudian harapannya bisa berhasil lolos dari adzab Allah. Akan tetapi semua itu jauh dan jauh, karena saat itu adalah hari pembalasan. Dalam ayat ini tidak disebutkan kedua orang tuanya, karena dengan itu (jika ia menyebutkannya) maka akan menambah kemarahan Allah, dimana Allah berwasiat untuk berbuat baik kepada kedua orang tua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Namun tidak bercakap-cakap. Yaitu orang yang berhak mendapatkan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 11",
    "description": "10-13. Dan ketika itu tidak ada seorang teman karib pun menanyakan keadaan temannya, karena mencekamnya situasi dan kesibukan masing-masing dengan urusannya. Sedang mereka saling melihat, mereka semua sadar bahwa ketika itu, tidak berguna lagi bantuan teman dan kerabat. Pada hari itu, orang yang berdosa ingin sekiranya dia dapat menebus dirinya dari azab dengan menyerahkan anak-anaknya, dan istri yang selalu menemaninya dan saudaranya yang merupakan darah dagingnya, dan bukan hanya itu bahkan keluarga seperti ayah ibu yang selalu melindunginya di dunia"
  }
]