[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-18. Perkaranya tidak seperti yang kamu harapkan wahai orang kafir, kamu tidak bisa menebus dirimu. Sesungguhnya ia adalah Jahanam yang apinya menyala-nyala dan membakar, panasnya yang luar biasa mengelupaskan kulit kepala dan seluruh bagian tubuh, ia memanggil siapa yang berpaling dari kebenaran di dunia, tidak menaati Allah dan RasulNya, mengumpulkan hartanya lalu menyimpannya di gudangnya dan tidak menunaikan hak Allah padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Perkaranya bukan sebagaimana yang diinginkan oleh pendosa ini, sesungguhnya Neraka itu adalah api Akhirat yang membara dan menyala-nyala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-18. Namun penggantian yang diharapkan orang kafir ini tidak akan terjadi. Dan di dalam neraka Jahannam yang apinya berkobar-kobar terdapat berbagai bentuk siksaan; di antaranya pencabutan kulit kepala dan gigi dari tempatnya, dan para penghuninya yang ingin berlari dari azab akan ditangkap. Dahulu mereka di dunia mengumpulkan harta dan sangat kikir, enggan menunaikan hak Allah yang ada pada harta tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15.إِنَّهَا لَظَىٰ (sesungguhnya neraka itu adalah api yang bergolak) Kata (لظى) adalah salah satu nama dari neraka Jahannam, yang berasal dari kata (التلظي) yakni berarti api yang bergejolak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15-16. {Tidak mungkin}, sebagai bentuk pencegahan untuk orang yang melakukan kriminal dan sesuatu yang sebelumnya. Tidak ada satupun yang dapat menyelematkannya dari siksa. Sesungguhnya neraka Jahanam itu menyala-nyala untuk orang-orang kafir. Kulit kepalanya dicabut dengan keras, kemudian kulit itu kembali seperti semula."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak} Hal itu tidak sesuai harapan orang yang durhaka ini {Sesungguhnya (neraka) itu adalah api yang bergejolak} api yang bergejolak dan membakar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-18. “Sekali-kali tidak,” yakni, tidak ada cara dan tempat berlari bagi mereka, kalimat Rabbmu telah berlaku bagi mereka. Bantuan kerabat dan teman sudah tidak ada. “Sesungguhnya neraka itu adalah api yang bergejolak, yang mengelupaskan kulit kepala,” yakni api yang bergejolak karena begitu dahsyatnya hingga mengelupas bagian tubuh yang nampak dan yang tidak, “yang memanggil,” menuju dirinya, “orang yang membelakangi dan yang berpaling (dari agama), serta mengumpulkan (harta benda) lalu menyimpannya,” yakni orang yang berpaling untuk mengikuti kebenaran dan tidak memiliki keinginan untuk kesana. Mereka saling mengumpulkan harta satu sama lain, dikumpulkan dan tidak diinfakkan yang seharusnya bisa bermanfaat bagi dirinya dan melindunginya dari siksa neraka. Neraka menyeru orang-orang seperti itu kepada dirinya serta siap untuk membakar mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 15: Tidak, wahai orang-orang kafir. Tidaklah uusannya sebagaimana kalian angan-angankan, dan sungguh jahannam adalah tempat yang menunggu kalian. Karena sebab kekafiran dan penolakan kalian. Dan Ladzhaa adalah nama di antara nama-nama neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai penolakan terhadap harapan dan keinginannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 15",
    "description": "15-18. Keinginan para pendurhaka untuk menebus dirinya dengan segala sesuatu direspons oleh ayat ini: sama sekali tidak bisa dan tidak akan ada tebusan! sungguh, neraka itu api yang bergejolak, yang mengelupaskan kulit kepala bahkan semua kulit tubuh. Yang selalu memanggil orang yang membelakangi iman dan kebenaran dan yang berpaling dari petunjuk agama, dan orang yang mengumpulkan harta benda tanpa menghiraukan hukum dan ketentuan Allah lalu menyimpannya, yakni harta yang dikumpulkannya itu, enggan menafkahkan di jalan Allah"
  }
]