[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-30. Sesungguhnya manusia diciptakan bertabiat suka berkeluh kesah dan rakus. Bila ditimpa keburukan dan kesulitan, dia banyak berkeluh kesah dan bersedih. Bila mendapatkan kebaikan dan kemudahan, dia banyak menahan dan menolak memberi, kecuali orang-orang yang mendirikan shalat yang menjaganya pada setiap waktunya, tidak disibukkan oleh sesuatu, orang-orang yang pada harta mereka terdapat bagian tertentu yang Allah wajibkan atas mereka, yaitu zakat bagi siapa yang meminta bantuan kepada mereka dan bagi siapa yang menahan diri dengan tidak meminta-minta, oramng-orang yang beriman kepada hari perhitungan amal dan pembalasan, lalu mereka menyiapkan diri dengan iman dan amal shalih, orang-orang yang takut kepada azab Allah, sesungguhnya azab Tuhan mereka, tidak patut bagi seorang pun merasa aman darinya, orang-orang yang menjaga kehormatan mereka dari segala apa yang Allah haramkan atas mereka, kecuali pada istri-istri mereka dan hamba sahaya mereka, maka sesungguhnya mereka tidak akan dihukum."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Jika tertimpa musibah seperti sakit atau kefakiran ia banyak berkeluh kesah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20-21. إِذَا مَسَّهُ الشَّرُّ جَزُوعًا وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا (Apabila ia ditimpa kesusahan ia berkeluh kesah dan apabila ia mendapat kebaikan ia amat kikir) Yakni jika ia ditimpa kemiskinan, penyakit, dan lain sebagainya maka ia banyak mengeluh; dan jika ia mendapat kebaikan berupa kekayaan, kesejahteraan, kelapangan, dan lain sebagainya maka ia akan berbuat kikir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Saat kemiskinan, penyakit dan hal lain dari sesuatu yang menyakitkan, mereka tidak mau sabar dan tidak menghitung pahalanya di sisi Tuhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila ditimpa keburukan, dia berkeluh kesah} dia banyak mengeluh karena memiliki sedikit kesabaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-21. Ini adalah sifat manusia yang esensial. Allah menggambarkan karakter asli manusia dengan sifat berkeluh kesah. Sifat keluh kesah dijelaskan oleh FirmanNya, “Apabila ia ditimpa kesusahan, ia berkeluh kesah,” manusia berkeluh kesah manakala ditimpa kemiskinan, penyakit, atau hilangnya benda-benda yang dicintai, seperti hilangnya harta, meninggalnya keluarga atau anak, tidak bersabar dan merelakan takdir Allah. “Dan apabila ia mendapat kebaikan, ia amat kikir,” tidak menginfakkan sebagian yang diberikan Allah, tidak bersyukur kepada Allah atas nikmat dan kebaikanNya sehingga manusia bersikap keluh kesah dalam kesusahan dan bersifat kikir ketika berbahagia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 20: 19-21. Allah menyebutkan bahwa sebagian dari tabiat manusia adalah banyak panik dan gampang mengeluh. Maka jika ditimpakan keburukan (kepada mereka) dari sakit, miskin atau musibah dan selainnya; Maka mereka mengeluh dan komplain, dan tidak ridha dengan apa yang Allah berikan dan takdirkan. Dan jika diberikan kebaikan sepeti kekayaan, panjang umur dan selainnya, maka jadilah mereka bakhil dan banyak menahan hartanya; Mereka tidak menginfaqkannya dari apa yang telah Allah berikan kepada mereka, dan juga tidak mengakui (nikmat) pemberian Allah dari karunianya, mereka malah berkata : Sesungguhnya ini semua aku dapatkan atas jerih payahku dan pengetahuanku melalui jalan berdagang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia berkeluh kesah ketika mendapatkan musibah seperti kemiskinan, sakit, hilangnya yang dicintai baik harta, istri maupun anak dan tidak menyikapinya dengan sikap sabar dan ridha kepada taqdir Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 20",
    "description": "19-22. Setelah diuraikan tentang orang-orang yang durhaka, kini diuraikan sebab-sebab kedurhakaan mereka, yaitu adanya sifat buruk pada manusia: sungguh, manusia diciptakan bersifat suka mengeluh lagi kikir. Apabila dia ditimpa sedikit kesusahan atau musibah, dia berkeluh kesah, dan apabila mendapat kebaikan harta yaitu keluasan rezeki, dia menjadi sangat kikir, kecuali orang-orang yang melaksanakan salat dengan baik dan benar, sehingga dapat mengalahkan sifat negatif tersebut"
  }
]