[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-30. Sesungguhnya manusia diciptakan bertabiat suka berkeluh kesah dan rakus. Bila ditimpa keburukan dan kesulitan, dia banyak berkeluh kesah dan bersedih. Bila mendapatkan kebaikan dan kemudahan, dia banyak menahan dan menolak memberi, kecuali orang-orang yang mendirikan shalat yang menjaganya pada setiap waktunya, tidak disibukkan oleh sesuatu, orang-orang yang pada harta mereka terdapat bagian tertentu yang Allah wajibkan atas mereka, yaitu zakat bagi siapa yang meminta bantuan kepada mereka dan bagi siapa yang menahan diri dengan tidak meminta-minta, oramng-orang yang beriman kepada hari perhitungan amal dan pembalasan, lalu mereka menyiapkan diri dengan iman dan amal shalih, orang-orang yang takut kepada azab Allah, sesungguhnya azab Tuhan mereka, tidak patut bagi seorang pun merasa aman darinya, orang-orang yang menjaga kehormatan mereka dari segala apa yang Allah haramkan atas mereka, kecuali pada istri-istri mereka dan hamba sahaya mereka, maka sesungguhnya mereka tidak akan dihukum."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Yaitu orang-orang yang selalu mengerjakan salat, tidak lalai darinya serta mendirikannya tepat pada waktu yang telah ditentukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. الَّذِينَ هُمْ عَلَىٰ صَلَاتِهِمْ دَآئِمُونَ (yang mereka itu tetap mengerjakan shalatnya) Tidak ada yang melalaikan mereka dari shalat, mereka menegakkan shalat lima waktu pada waktunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Mereka adalah orang-orang yang gigih karena tidak pernah melalaikannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang selalu setia mengerjakan shalatnya} mereka rajin menunaikan shalat pada waktunya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. “Kecuali orang-orang yang mengerjakan shalat,” yakni mereka yang disifati dengan sifat-sifat tersebut, dimana bila mereka diberi kebaikan, mereka bersyukur kepada Allah dan menginfakkan sebagian pemberian Allah, (sebaliknya) bila mereka tertimpa kesusahan, mereka bersabar dan mengharapkan pahala dari Allah. Allah berfirman tentang sifat-sifat mereka, “Yang mereka itu tetap mengerjakan shalatnya,” yaitu menjalankan secara kontinu pada waktunya dengan syarat-syarat serta (sunnah-sunnah) yang menyempurnakannya. Tidak seperti orang-orang yang tidak mengerjakannya atau hanya mengerjakan sebagian waktu saja maupun dilakukan secara tidak sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 23: 22-23. Allah kecualikan dari sifat-sifat yang disebutkan pada ayat yang lalu yaitu secara umum adalah orang-orang yang shalat dan memiliki iman, Allah berkata : Kecuali orang-orang yang shalat, maka mereka bukanlah termasuk orang-orang yang gampang mengeluh, panik dan bakhil. Kemudian Allah menjelaskan sifat mereka yang shalat : Mereka adalah orang-orang yang menegakkan shalat, yang tekun mengerjakannya tepat pada waktunya, dan tidak tersibukkan dari dunia yang menyibukkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka senantiasa melakukan shalat pada waktunya dengan memenuhi syarat dan penyempurnanya. Mereka bukanlah orang yang tidak melaksanakannya dan bukan pula orang yang mengerjakannya jarang-jarang atau melakukannya secara kurang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 23",
    "description": "23-25. Mereka yang tetap setia melaksanakan salatnya secara istikamah, dan orang-orang yang dalam hartanya yang diraihnya secara halal disiapkan bagian tertentu, untuk diserahkan bagi orang miskin yang meminta dan orang miskin yang tidak meminta karena menjaga kehormatannya"
  }
]