[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-30. Sesungguhnya manusia diciptakan bertabiat suka berkeluh kesah dan rakus. Bila ditimpa keburukan dan kesulitan, dia banyak berkeluh kesah dan bersedih. Bila mendapatkan kebaikan dan kemudahan, dia banyak menahan dan menolak memberi, kecuali orang-orang yang mendirikan shalat yang menjaganya pada setiap waktunya, tidak disibukkan oleh sesuatu, orang-orang yang pada harta mereka terdapat bagian tertentu yang Allah wajibkan atas mereka, yaitu zakat bagi siapa yang meminta bantuan kepada mereka dan bagi siapa yang menahan diri dengan tidak meminta-minta, oramng-orang yang beriman kepada hari perhitungan amal dan pembalasan, lalu mereka menyiapkan diri dengan iman dan amal shalih, orang-orang yang takut kepada azab Allah, sesungguhnya azab Tuhan mereka, tidak patut bagi seorang pun merasa aman darinya, orang-orang yang menjaga kehormatan mereka dari segala apa yang Allah haramkan atas mereka, kecuali pada istri-istri mereka dan hamba sahaya mereka, maka sesungguhnya mereka tidak akan dihukum."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Mereka memberikannya kepada orang yang memintanya dan kepada orang yang tidak memintanya dari kalangan orang-orang yang terhalang dari rezekinya karena berbagai sebab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. لِّلسَّآئِلِ وَالْمَحْرُومِ (bagi orang (miskin) yang meminta dan orang yang tidak mempunyai apa-apa (yang tidak mau meminta)) Telah disebutkan penjelasan tentang kata (السائل) dan (المحروم) pada surat ad-Dzariyat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. (Dia memberikan zakat) kepada orang fakir yang meminta-minta dan orang fakir yang tidak mau meminta karena dia menganggap bahwa dirinya sudah kaya, maka dia dimuliakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{untuk orang yang meminta-minta} orang fakir yang menampakkan kefakirannya dengan meminta-minta kepada manusia {dan orang yang tidak mempunyai apapun} orang fakir yang tidak diberi sedekah karena anggapan orang lain bahwa mereka tidak membutuhkannya karena di tidak mau menampakkan kefakirannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24-25. “Dan orang-orang yang dalam hartanya tersedia bagian tertentu,” berupa zakat sedekah, “bagi orang miskin, yang meminta,” yaitu orang yang terdorong untuk meminta-minta, “dan orang yang tidak mempunyai apa-apa (yang tidak mau meminta),” yakni orang miskin yang tidak meminta-minta pada orang dan tidak disadari oleh orang lain bahwa dia adalah orang miskin, hendaklah orang seperti ini diberi sedekah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 25: 24-25. Sebagian dari sifat mereka adalah : Mereka menjadikan harta-harta mereka untuk dibagikan secara tertentu, maka Allah ridha atas mereka. Mereka bagikan seperti untuk zakat dan kewajiban-kewajiban lain. Pembagian harta (mereka) ini diberikan kepada orang yang faqir yang mereka berhak menerimanya karena butuh bantuan dan mereka yang tidak merasa butuh bantuan, yang mereka tidak meminta, akan tetapi nampak dari tanda-tanda mereka yang butuh (harta)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 25",
    "description": "23-25. Mereka yang tetap setia melaksanakan salatnya secara istikamah, dan orang-orang yang dalam hartanya yang diraihnya secara halal disiapkan bagian tertentu, untuk diserahkan bagi orang miskin yang meminta dan orang miskin yang tidak meminta karena menjaga kehormatannya. 26-28. Dan orang-orang yang mempercayai hari pembalasan, mereka mengimaninya dengan hati dan perbuatan, sehingga mempersiapkan bekal menghadapinya, dan orang-orang yang takut terhadap azab tuhannya, sehingga selalu berusaha melaksanakan perintah dan menjauhi larangan-Nya. Karena sesungguhnya terhadap azab tuhan mereka, tidak ada seseorang yang merasa aman dari kedatangannya, sebab azab tersebut pasti datang."
  }
]