[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Salah seorang dari kalangan orang-orang musyrik berdoa meminta keburukan atas dirinya dan kaumnya agar diturunkan azab atas mereka, dan azab tersebut pasti menimpa mereka pada Hari Kiamat, tidak ada yang dapat menolaknya, (yaitu azab) dari Allah, Pemilik ketinggian dan keagungan. Para malaikat dan malaikat Jibril naik kepadaNya pada hari yang kadarnya 50 ribu tahun dari tahun-tahun dunia, dan itu bagi seorang Muslim adalah seperti shalat fardhu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dari Allah yang mempunyai tempat yang tinggi, berbagai derajat, beragam keutamaan dan kenikmatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Azab yang akan menimpa orang-orang kafir itu merupakan azab dari Allah Yang Maha Tinggi, malaikat Jibril dan malaikat lainnya naik kepada-Nya pada hari kiamat; hari yang panjangnya seperti 50.000 tahun dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. مِّنَ اللَّـهِ ذِى الْمَعَارِجِ ((yang datang) dari Allah, Yang mempunyai tempat-tempat naik) Yakni memiliki tempat-tempat naik untuk para malaikat agar dapat naik ke langit. Pendapat lain mengatakan yang dimaksud adalah Allah memiliki keagungan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Azab itu pasti datang dari Allah, yaitu Dzat yang memiliki kedudukan tinggi. Maknanya adalah kedudukan tinggi yang dijunjung oleh para malaikat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dari Allah, Pemilik tempat-tempat naik} Pemilik keluhuran, derajat, karunia dan kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Allah berfirman menjelaskan kebodohan para penentang dan permintaan mereka untuk disegerakan azab Allah kepada mereka seraya memperolok-olok, membangkang dan memperlemah, “Seorang peminta telah meminta kedatangan azab yang bakal terjadi,” yakni seorang telah meminta dan meminta dibuka, “untuk orang-orang kafir,” karena mereka berhak mendapatkannya lantaran kekufuran, “yang tidak seorang pun dapat menolaknya, (yang datang) dari Allah,” artinya, tidak seorang pun yang bisa menolak datangnya azab yang diminta segera oleh para pembangkang kaum musyrikin sebelum waktunya tiba atau tidak seorang pun yang bisa melenyapkannya ketika azab menimpa. Hal ini terjadi pada saat al-Nadhr bin Harits al-Quraisy atau para dedengkot lainnya yang mendustakan memintanya seraya berkata, “Ya Allah, jika betul (Al Quran) ini, dialah yang benar dari sisi Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih”. -Al-anfal:32- Azab dari Allah pasti menimpa mereka, bisa disegerakan untuk mereka di dunia atau disimpan di akhirat kelak untuk mereka. Andai saja mereka mengenal Allah dan mengenal keagunganNya serta luasnya kuasa, sempurnanya nama-nama dan sifatNya, niscaya mereka tidak meminta untuk disegerakannya azab dan niscaya mereka memiliki sopan santun. Karena itu Allah menyebutkan salah satu keagunganNya yang bertentangan dengan perkataan buruk mereka, “Mempunyai tempat-tempat naik. Malaikat-malaikat dan ruh-ruh naik (menghadap) kepada Rabb,” yakni pemilik keluhuran, keagungan, kemuliaan, dan hak mengatur seluruh makhluk, kepadaNya para malaikat naik dengan tugas yang diberikan pada mereka, ruh naik padanya. Ruh adalah isim jenis yang mencakup seluruh ruh, yang baik maupun yang buruk. Hal ini terjadi pada saat kematian. Ruh orang-orang suci naik kepada Allah, mereka diberi izin dari satu langit ke langit lain hingga berhenti di langit di mana Allah berada. Menyampaikan ucapan penghormatan kepada Allah dan mengucapkan salam serta mendekat ke arahnya. Mereka senang berada di dekat Allah dan mendapatkan pujian, penghormatan, perlakuan baik dan pengagungan dari Allah. Sedangkan ruh para pendosa, ketika naik ke langit dan meminta izin, mereka tidak diberi izin dan dikembalikan lagi ke bumi. Selanjutnya Allah menyebutkan jarak yang ditempuh oleh para malaikat dan ruh menuju Allah. Para malaikat dan ruh naik dalam sehari dengan sebab-sebab yang Allah mudahkan baginya serta pertolongan Allah berupa kemudahan, keringanan dan cepatnya perjalanan, padahal jarak tersebut sejauh jarak lima puluh ribu tahun perjalanan normal, mulai dari saat naik hingga sampai yang telah ditentukan hingga sampai pada golongan malaikat tertinggi. Kerajaan yang amat besar ini dan alam yang agung ini, baik yang berada di atas maupun bawah, seluruhnya diciptakan dan diatur oleh Allah Yang Mahaluhur lagi Tinggi. Allah mengetahui kondisi-kondisi mereka, baik yang lahir maupun yang batin. Allah mengetahui apa yang ada dan apa yang tersimpan. Allah memberikan rahmat dan kebaikanNya pada seluruh makhluk. Allah memberlakukan hukumNya, baik yang bersifat takdir ataupun syariat pada mereka, serta memberlakukan hukum pembalasanNya. Celakalah bagi kaum yang tidak mengerti keagungan Allah dan tidak memuliakan Allah dengan sebenarnya. Mereka meminta agar segera diturunkan azab sebagai pengujian dan anggapan memperlemah. Mahasuci Allah Yang Maha Penyabar yang memberi mereka tempo, tapi tidak lalai terhadap mereka. Mereka menyakiti Allah tapi Allah bersabar terhadap mereka, memberi keselamatan dan rizki pada mereka. Inilah salah satu kemungkinan penafsiran ayat tersebut. Sehingga yang dimaksud dengan naik dalam ayat ini adalah naik di dunia, sebab kontekstual pertama menunjukkan hal tersebut. Kemungkinan juga hal ini berlaku pada hari Kiamat dan Allah memberitahukan keagungan, keluhuran, dan kebesaranNya pada semua hambaNya. Tidak ada bukti yang lebih besar yang dapat mereka saksikan untuk dapat mengenal Allah selain peristiwa naiknya para malaikat dan ruh. Mereka naik dan turun berdasar pengaturan Allah serta urusan rabbani pada hari itu yang berjarak lima puluh ribu tahun karena panjang dan beratnya perjalanan. Tapi Allah meringankan perjalanan tersebut bagi orang yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 3: 1-3. Allah mengabarkan tentang salah seorang dari kaum musyrikin yang mengingkari hari kebangkitan dan hisab. Ia menyeru kepada dirinya dan kaumnya agar Allah menurunkan adzab kepada mereka, dimana telah Allah janjikan sebelumnya kepada mereka orang-orang kafir yang tetap terhadap kekafiran mereka dan penolakan mereka. Berkata Ibnu Abbas : Orang yang bertanya tersebut adalah An Nadhar bin Al Harits, maka Allah membantah pendosa ini bahwasanya adzab adalah kebenaran yang akan ditimpakan kepada orang-orang kafir yang tak diragukan lagi atasnya; Entah ia memintanya atau tidak, dan adzab ini tak seorangpun mampu menghalanginya, sebab Allah Yang Maha Tinggi, Mulia dan Agung (yang menurunkannya). Dan telah tertimpa adzab bagi orang-orang kafir di dunia, seperti binasanya petarung Quraisy di medan peperangan Badr. Akan tetapi adzab yang sempurna adalah di hari kiamat yang mereka dimasukkan ke dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tempat para malaikat naik, yaitu langit-langit. Ada pula yang menafsirkan dengan yang mempunyai ketinggian kebesaran dan keagungan serta kepengurusan terhadap semua makhluk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 3",
    "description": "1-3. Surah al-h'qqah menjelaskan sangat jelas tentang peristiwa kiamat, pada awal surah ini dikemukakan adanya seseorang yang bertanya dengan tujuan untuk mengejek tentang kiamat. Seseorang bertanya tentang tentang azab yang pasti terjadi, siksa yang pasti akan dijatuhkan Allah bagi orang-orang kafir, yang tidak seorang pun dapat menolaknya, azab itu datangnya dari Allah, yang memiliki tempat-tempat naik yaitu tempat naiknya para malaikat atau amal-amal manusia4. Para malaikat dan jibril naik menghadap kepada tuhan, dalam sehari yang kadarnya setara dengan lima puluh ribu tahun dari tahun-tahun di dunia, hal ini menunjukkan betapa dahsyatnya azab yang akan dialami oleh kaum kafir, karena terasa amat panjang."
  }
]