[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-35. Barangsiapa menunaikan hajat biologisnya bukan pada istri atau hamba sahaya, maka mereka adalah orang-orang yang melampaui batas yang halal kepada yang haram. Dan juga orang-orang yang menjaga amanat Allah dan amanat hamba-hamba. Juga orang-orang yang menjaga janji-janji mereka dengan Allah dan dengan manusia. Juga orang-orang yang menunaikan kesaksian mereka dengan benar tanpa merubah atau menyembunyikan. Juga orang-orang yang menjaga shalat dan tidak menyepelekan kewajibannya. Orang-orang dengan sifat-sifat mulia di atas tinggal di dalam surga yang penuh kenikmatan, di dalamnya mereka dimuliakan dengan berbagai bentuk pemuliaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dan orang-orang yang menegakkan kesaksian sebagaimana mestinya, tidak terpengaruh dengan kedekatan atau permusuhan dalam bersaksi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَالَّذِينَ هُم بِشَهٰدٰتِهِمْ قَآئِمُونَ (Dan orang-orang yang memberikan kesaksiannya) Yakni mereka menyampaikan kesaksiannya sebagaimana mestinya tanpa terpengaruh oleh orang yang dipersaksikan baik itu orang dekat atau jauh, berkedudukan atau biasa; dan mereka tidak menyembunyikan atau merubah kesaksiannya itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Mereka adalah orang yang bersyahadat dan mengimplementasikannya dengan sempurna tanpa ditambah dan dikurangi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang terhadap kesaksiannya mereka menunaikannya} menunaikannya dengan benar tanpa mengubah atau menyembunyikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. “Dan orang-orang yang memberikan kesaksiannya,” yaitu mereka hanya bersaksi atas apa yang diketahui tanpa ditambahi, dikurangi dan disembunyikan. Tidak membela kerabat, teman atau lainnya. Dan maksud dari kesaksian yang diberikan adalah keridhaan Allah. Allah berfirman, Wahai orang-orang yang beriman, jadilah kamu orang yang benar-benar penegak keadilan, menjadi saksi karena Allah biarpun terhadap dirimu sendiri atau ibu bapa dan kaum kerabatmu. Jika ia kaya ataupun miskin, maka Allah lebih tahu kemaslahatannya. Maka janganlah kamu mengikuti hawa nafsu karena ingin menyimpang dari kebenaran. Dan jika kamu memutar balikkan (kata-kata) atau enggan menjadi saksi, maka sesungguhnya Allah adalah Maha Mengetahui segala apa yang kamu kerjakan. -Annisa:135-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 33: 32-34. Sebagian dari sifat mereka : Menjaga terhadap amanah dan memenuhi amanah tersebut. Meskipun amanah itu datang dari beban syariat atau dari hak-hak kemanusian. Kemudian diantara sifatnya : Mereka (berani) memberikan persaksian sebagaimana mestinya, dan tidak disembunyikan. Mereka tidak menambah maupun mengurangi dari persaksian mereka. Kemudian diantara sifatnya adalah : Mereka menjaga shalat-shalat wajib mereka dan terus menerus mengerjakannya secara sempurna dengan sesempurna mungkin atas (kaifiyyat, dll.) dalam shalatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka bersaksi sesuai yang mereka ketahui tanpa menambah, mengurangi atau menyembunyikan, tidak memihak kepada kerabat, teman dan lainnya, tetapi dia lakukan karena mencari keridhaan Allah Subhaanahu wa Ta'aala sebagaimana firman-Nya, “Wa aqiimusy syahaadata lillah.” (artinya: tegakkanlah persaksian karena Allah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 33",
    "description": "32-35. Setelah mengecam siapa yang melampaui batas, kini diteruskan dengan memuji orang yang akan meraih surg. Dan orang-orang yang memelihara amanat yang dipikulkan atas mereka oleh Allah atau oleh manusia, dan yang memenuhi janjinya, dan mereka juga orang-orang yang berpegang teguh dengan sungguh-sungguh pada kesaksiannya, tanpa dipengaruhi oleh kepentingan diri, keluarga atau kelompok, dan juga orang-orang yang memelihara salatnya, baik menyangkut waktu pelaksanannya, syarat, rukun dan wajibnya serta sunah-sunahnya. Mereka yang melaksanakan amal-amal itu dimuliakan di dalam surga dan mereka kekal di dalamnya"
  }
]