[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-35. Barangsiapa menunaikan hajat biologisnya bukan pada istri atau hamba sahaya, maka mereka adalah orang-orang yang melampaui batas yang halal kepada yang haram. Dan juga orang-orang yang menjaga amanat Allah dan amanat hamba-hamba. Juga orang-orang yang menjaga janji-janji mereka dengan Allah dan dengan manusia. Juga orang-orang yang menunaikan kesaksian mereka dengan benar tanpa merubah atau menyembunyikan. Juga orang-orang yang menjaga shalat dan tidak menyepelekan kewajibannya. Orang-orang dengan sifat-sifat mulia di atas tinggal di dalam surga yang penuh kenikmatan, di dalamnya mereka dimuliakan dengan berbagai bentuk pemuliaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan orang-orang yang memelihara salat mereka, dengan mendirikannya tepat pada waktunya, melaksanakannya dengan taharah dan tumakninah, tidak ada sesuatu yang melalaikannya dalam salat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَالَّذِينَ هُمْ عَلَىٰ صَلَاتِهِمْ يُحَافِظُونَ (Dan orang-orang yang memelihara shalatnya) Mereka tidak melalaikannya karena suatu kesibukan, dan tidak melakukan perbuatan yang dapat menghilangkan pahalanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35. Mereka adalah orang-orang yang menjaga shalatnya sesuai waktu, rukun dan syaratnya, tanpa mengeluh. Mereka mengulang-ulang dzikir setelah shalat sebagai bentuk penegasan dan untuk menunjukkan keutamaannya. Mereka adalah orang-orang yang diingat di surga. Mereka dimuliakan dengan pahala Allah SWT dan ditempatkan di sana."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan terhadap shalatnya mereka memelihara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Dan orang-orang yang memeliharanya shalatnya,” dengan kontinu mengerjakan shalat secara sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 34: 32-34. Sebagian dari sifat mereka : Menjaga terhadap amanah dan memenuhi amanah tersebut. Meskipun amanah itu datang dari beban syariat atau dari hak-hak kemanusian. Kemudian diantara sifatnya : Mereka (berani) memberikan persaksian sebagaimana mestinya, dan tidak disembunyikan. Mereka tidak menambah maupun mengurangi dari persaksian mereka. Kemudian diantara sifatnya adalah : Mereka menjaga shalat-shalat wajib mereka dan terus menerus mengerjakannya secara sempurna dengan sesempurna mungkin atas (kaifiyyat, dll.) dalam shalatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan melaksanakannya pada waktunya, terpenuhi rukun dan syaratnya dan mengerjakan yang wajib dan sunnahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 34",
    "description": "32-35. Setelah mengecam siapa yang melampaui batas, kini diteruskan dengan memuji orang yang akan meraih surg. Dan orang-orang yang memelihara amanat yang dipikulkan atas mereka oleh Allah atau oleh manusia, dan yang memenuhi janjinya, dan mereka juga orang-orang yang berpegang teguh dengan sungguh-sungguh pada kesaksiannya, tanpa dipengaruhi oleh kepentingan diri, keluarga atau kelompok, dan juga orang-orang yang memelihara salatnya, baik menyangkut waktu pelaksanannya, syarat, rukun dan wajibnya serta sunah-sunahnya. Mereka yang melaksanakan amal-amal itu dimuliakan di dalam surga dan mereka kekal di dalamnya"
  }
]