[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-39. Apa yang mendorong orang-orang kafir itu berjalan kepadamu wahai Rasul, dan mereka menjulurkan leher-leher mereka kepadamu dan mengarahkan pandangan mereka kepadamu, berkumpul di sisi kanan dan kirimu membentuk lingkaran dan menyusun kelompok-kelompok, sambil berbincang penuh takjub? Apakah setiap orang dari orang-orang kafir itu berharap Allah memasukannya ke dalam surga yang penuh dengan kenikmatan abadi? Perkaranya tidak seperti yang mereka harapkan, mereka tidak akan memasukinnya selamanya. Sesungguhnya Kami menciptakan mereka dari apa yang mereka ketahui, yaitu dari air yang hina sebagaimana halnya orang selain mereka, maka mereka tidak beriman,lalu dari mana mereka bisa berharap masuk surga yang penuh kenikamatan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Mereka mengelilingimu dari sisi kanan dan kirimu secara berkelompok-kelompok."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ عِزِينَ (dari kanan dan dari kiri dengan berkelompok-kelompok) Yakni dari kanan dan kiri Nabi Muhammad dengan bergerombol-gerombol."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37-38. Dari sisi kananmu dan kirimu terdapat kelompok-kelompok yang terpisah-pisah. Apakah setiap orang dari golongan orang-orang kafir masuk jannatu na’im layaknya kaum muslim? Orang-orang musyrik itu berkata: “Jika orang-orang muslim itu masuk surga, maka sungguh kami akan masuk surga sebelum mereka.” Kemudian Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dari kanan dan dari kiri dengan berkelompok-kelompok} kelompok demi kelompok"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-39. Allah berfirman menjelaskan orang-orang kafir yang tertipu, “Mengapakah orang-orang kafir itu bersegera datang ke arahmu,” yakni datang cepat-cepat, “dari kanan dan kiri dengan berkelompok-kelompok,” yakni kelompok-kelompok yang beragam dan jamaah-jamaah yang berlainan, masing-masing dari mereka bangga dengan apa yang ada pada mereka; “adakah setiap orang dari orang-orang kafir itu ingin masuk ke dalam surga yang penuh kenikmatan?” apa gerangan yang akan membuat mereka ambisi sedangkan mereka hanya melakukan kekufuran dan pembangkangan terhadap Rabb semesta alam. Karena itu Allah berfirman, “Sekali-kali tidak,” yakni masalahnya tidak seperti yang mereka bayangkan dan kekuatan mereka tidak akan mampu mencapai apa yang mereka inginkan. “Sesungguhnya Kami ciptakan mereka dari apa yang mereka ketahui(air mani) ,” yaitu dari air yang memancar yang keluar dari tulang punggung (sulbi) dan tulang dada. Mereka adalah makhluk lemah yang tidak bisa memberi guna maupun bahaya pada diri sendiri serta tidak berkuasa atas kematian, kehidupan, dan kebangkitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 37: 36-39. Kemudian Allah mengingkari orang-orang kafir yang mereka hidup pada zaman Nabi ﷺ, sebab mereka menyaksikan mukjizat yang Allah tampakkan pada mereka dan mukjizat yang terbesar adalah Al Qur’an Al Karim, tapi dengan itu juga mereka tidak mau beriman. Allah berkata kepada Nabi-Nya ﷺ : Lantas dengan apalagi mereka akan terjaga (terlindungi) bagi mereka orang-orang kafir, meskipun mereka mendatanginmu wahai Nabi. Kemudian mereka orang-orang kafir duduk di sebalah kanan dan kiri Nabi dengan begerombol di sana-sini. Apakah mereka berharap agar Allah masukkan mereka ke dalam surga ? Padahal mereka tidak beriman kepada Allah dan Rasul-Nya ﷺ, dan sungguh mereka dengan sebab kesewenang-wenangan mereka, mereka menyangka bahwa sembahan-sembahan mereka dan patung-patung merekaa akan memasukkan mereka ke dalam surga, jika memang mereka punya surga. Tidak (kata Allah), tidaklah urusannya sebgaimana mereka angan-angankan, mereka tidak akan masuk ke dalam surga selamanya, selama mereka tidak beriman. Kemudian mereka juga mengetahui bahwa Allah Pencipta mereka, sebagaimana Allah menciptakan selainnya dari air mani. Akan tetapi mereka tidak mau mengimani, lalu bagaimana mereka bisa berangan-angan untuk masuk surga ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan merasa bangga terhadap apa yang ada pada mereka. Menurut keterangan sebagian ahli tafsir, ayat ini berhubungan dengan peristiwa ketika Rasulullah shallallahu 'alaihi wa sallam shalat dan membaca Al Quran di dekat ka'bah lalu orang-orang musyrik berkumpul berkelompok-kelompok di hadapannya sambil mengejek dan mengatakan, “Jika orang-orang mukmin benar-benar akan masuk surga sebagaimana kata Muhammad shallallahu 'alaihi wa sallam, tentu kita yang akan masuk lebih dahulu.” Maka turunlah ayat 38."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 37",
    "description": "36-38. Penjelasan telah disampaikan ayat-ayat telah dibacakan, tetapi kaum kafir tetap durhaka. Kelompok ayat ini mengecam sikap keras kepala mereka. Maka mengapa orang-orang kafir itu datang bergegas ke hadapanmu, wahai Muhammad, sambil terus menerus memandangmu dari arah kanan dan dari kiri dengan berkelompok-kelompok' apakah setiap orang dari orang-orang kafir itu ingin masuk surga yang penuh kenikmatan seperti kaum mukmin' semestinya yang datang kepada nabi Muhammad itu yang bersedia mengikuti ajarannya, 36-38"
  }
]