[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-39. Apa yang mendorong orang-orang kafir itu berjalan kepadamu wahai Rasul, dan mereka menjulurkan leher-leher mereka kepadamu dan mengarahkan pandangan mereka kepadamu, berkumpul di sisi kanan dan kirimu membentuk lingkaran dan menyusun kelompok-kelompok, sambil berbincang penuh takjub? Apakah setiap orang dari orang-orang kafir itu berharap Allah memasukannya ke dalam surga yang penuh dengan kenikmatan abadi? Perkaranya tidak seperti yang mereka harapkan, mereka tidak akan memasukinnya selamanya. Sesungguhnya Kami menciptakan mereka dari apa yang mereka ketahui, yaitu dari air yang hina sebagaimana halnya orang selain mereka, maka mereka tidak beriman,lalu dari mana mereka bisa berharap masuk surga yang penuh kenikamatan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Perkaranya bukan sebagaimana yang mereka bayangkan. Sesungguhnya Kami menciptakan mereka dari apa yang mereka ketahui, Kami menciptakan mereka dari air yang hina. Mereka itu lemah, tidak kuasa memberikan manfaat atau menolak mudarat dari diri mereka, maka bagaimana mereka berlaku sombong?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. كَلَّآ ۖ إِنَّا خَلَقْنٰهُم مِّمَّا يَعْلَمُونَ (sekali-kali tidak! Sesungguhnya Kami ciptakan mereka dari apa yang mereka ketahui) Yakni dari air mani yang hina sebagaimana yang kalian ketahui, maka tidak ada layak bagi mereka untuk menyombongkan diri. Imam Ahmad, Ibnu Majah, dan Ibnmu Sa’d meriwayatkan bahwa Rasulullah membaca ayat: فَمَالِ الَّذِينَ كَفَرُوا۟ قِبَلَكَ مُهْطِعِين......... كَلَّآ ۖ إِنَّا خَلَقْنٰهُم مِّمَّا يَعْلَمُونَ Setelah itu Rasulullah meludah ke telapak tangannya kemudian meletakkan jarinya di atasnya seraya bersabda: Allah berfirman: “Hai anak Adam, bagaimana kalian dapat mengalahkan-Ku, sedangkan Aku menciptakanmu dari sesuatu seperti ini.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. {Tidak}: untuk mencegah para kriminal itu masuk surga. Sesungguhnya kami telah menjadikan mereka dari sesuatu yang telah mereka ketahui yaitu air mani yang hina. Maka selayaknya mereka tidak sombong."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak. Sesungguhnya Kami menciptakan mereka dari sesuatu yang mereka ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-39. Allah berfirman menjelaskan orang-orang kafir yang tertipu, “Mengapakah orang-orang kafir itu bersegera datang ke arahmu,” yakni datang cepat-cepat, “dari kanan dan kiri dengan berkelompok-kelompok,” yakni kelompok-kelompok yang beragam dan jamaah-jamaah yang berlainan, masing-masing dari mereka bangga dengan apa yang ada pada mereka; “adakah setiap orang dari orang-orang kafir itu ingin masuk ke dalam surga yang penuh kenikmatan?” apa gerangan yang akan membuat mereka ambisi sedangkan mereka hanya melakukan kekufuran dan pembangkangan terhadap Rabb semesta alam. Karena itu Allah berfirman, “Sekali-kali tidak,” yakni masalahnya tidak seperti yang mereka bayangkan dan kekuatan mereka tidak akan mampu mencapai apa yang mereka inginkan. “Sesungguhnya Kami ciptakan mereka dari apa yang mereka ketahui(air mani) ,” yaitu dari air yang memancar yang keluar dari tulang punggung (sulbi) dan tulang dada. Mereka adalah makhluk lemah yang tidak bisa memberi guna maupun bahaya pada diri sendiri serta tidak berkuasa atas kematian, kehidupan, dan kebangkitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 39: 36-39. Kemudian Allah mengingkari orang-orang kafir yang mereka hidup pada zaman Nabi ﷺ, sebab mereka menyaksikan mukjizat yang Allah tampakkan pada mereka dan mukjizat yang terbesar adalah Al Qur’an Al Karim, tapi dengan itu juga mereka tidak mau beriman. Allah berkata kepada Nabi-Nya ﷺ : Lantas dengan apalagi mereka akan terjaga (terlindungi) bagi mereka orang-orang kafir, meskipun mereka mendatanginmu wahai Nabi. Kemudian mereka orang-orang kafir duduk di sebalah kanan dan kiri Nabi dengan begerombol di sana-sini. Apakah mereka berharap agar Allah masukkan mereka ke dalam surga ? Padahal mereka tidak beriman kepada Allah dan Rasul-Nya ﷺ, dan sungguh mereka dengan sebab kesewenang-wenangan mereka, mereka menyangka bahwa sembahan-sembahan mereka dan patung-patung merekaa akan memasukkan mereka ke dalam surga, jika memang mereka punya surga. Tidak (kata Allah), tidaklah urusannya sebgaimana mereka angan-angankan, mereka tidak akan masuk ke dalam surga selamanya, selama mereka tidak beriman. Kemudian mereka juga mengetahui bahwa Allah Pencipta mereka, sebagaimana Allah menciptakan selainnya dari air mani. Akan tetapi mereka tidak mau mengimani, lalu bagaimana mereka bisa berangan-angan untuk masuk surga ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keadaannya tidaklah sesuai dengan harapan mereka dan mereka tidak akan mendapatkan apa yang mereka inginkan meskipun mereka kerahkan kemampuan mereka. Yang dimaksud dengan ayat ini ialah, bahwa mereka (orang-orang kafir) diciptakan Allah dari air mani untuk beriman dan bertakwa kepada-Nya, sebagaimana yang telah disampaikan Rasul. Jika mereka tidak beriman dan bertakwa, maka mereka tidak berhak masuk surga. Atau maksudnya, karena mereka diciptakan dari air mani sehingga mereka lemah tidak berkuasa apa-apa untuk memberikan manfaat kepada diri mereka dan menghindarkan bahaya, tidak berkuasa mematikan, menghidupkan dan membangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 39",
    "description": "Tidak mungkin, sekali-kali tidak akan masuk surga mereka itu! sesungguhnya kami menciptakan mereka dari apa yang mereka ketahui yaitu dari setetes mani yang mereka jijik melihatnya. Faktor lahiriah tersebut tidak mungkin mengantar mereka masuk surga, tetapi keimananlah yang dapat mengantarkan mereka masuk surga. 40-41. Ayat ini untuk menegaskan kemahakuasaan Allah. Maka aku bersumpah demi tuhan yang mengatur tempat-tempat terbit dan terbenamnya matahari, bulan dan bintang, sungguh kami benar-benar mahakuasa atas segala sesuatu, dan kami pasti mampu untuk mengganti mereka yang kafir itu dengan kaum yang lebih baik dari mereka, dan kami sekali-kali tidak dapat dikalahkan oleh siapa pun."
  }
]