[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40. Allah bersumpah dengan diriNya, Dia adalah Tuhan yang mengatur tempat-tempat terbit dan terbenamnya matahari, rembulan serta planet-planet lainnya, karena ia mengandung tanda-tanda menggagumkan yang menunjukkan adanya kebangkitan. Sesungguhnya Kami memiliki kemampuan yang sempurna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Allah bersumpah dengan Rabb terbitnya matahari dan bulan, \"Sesungguhnya Kami benar-benar Mahakuasa,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40-41. Ini merupkan sumpah dengan tempat-tempat terbit matahari dan tempat-tempat terbenamnya; atau dengan tempat-tempat terbit matahari, bulan, bintang-bintang dan tempat-tempat tenggelamnya. Dan isi dari sumpah ini bahwa Allah Maha Kuasa untuk membinasakan orang-orang musyrik, dan mengganti mereka dengan kaum lain yang lebih baik yang mentaati perintah Allah dan tidak menentang-Nya. Hal itu tidaklah sulit bagi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. فَلَآ أُقْسِمُ (Maka aku bersumpah) Yakni aku bersumpah. بِرَبِّ الْمَشٰرِقِ وَالْمَغٰرِبِ(dengan Tuhan Yang memiliki timur dan barat) Yakni tempat terbit dan tenggelamnya matahari setiap harinya di sepanjang tahun. إِنَّا لَقٰدِرُونَ(sesungguhnya Kami benar-benar Maha Kuasa)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Aku bersumpah demi Tuhan yang memiliki Timur dan Barat untuk (digunakan sebagai tempat terbit dan terbenamnya) matahari, bulan, dan bintang. Sesungguhnya kami Maha Kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Aku bersumpah} Aku bersumpah, huruf \"Laa\" untuk menegaskan sumpah {dengan Tuhan arah timur dan arah barat sesungguhnya Kami benar-benar Maha kuasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41. Ini adalah sumpah Allah dengan arah timur (tempat terbit) dan barat (tempat terbenam) bagi matahari, bulan dan bintang, karena padanya terdapat tanda-tanda nyata atas pastinya Hari Kebangkitan serta kekuasaan Allah untuk mengganti orang-orang seperti mereka, padahal mereka menyaksikan sendiri, sebagaimana yang disebutkan dalam Firman Allah, dan menciptakan kamu kelak (di akhirat) dalam keadaan yang tidak kamu ketahui. -Alwaqiah:61- “Dan Kami sekali-kali tidak dapat dikalahkan,” yakni tidak ada seorang pun yang mengalahkan Kmai dan melemahkan Kami jika Kami ingin mengembalikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 40: Allah bersumpah dengan diri-Nya yang menguasai timur dan barat, yang Ia mampu atas segalanya. Tidak ada sesuatupun yang melemahkan-Nya di bumi dan di langit. Dan Allah menjadikan bentuk jamak dalam Al Masyaariq karena matahari setiap harinya terbit dari tempat munculnya (di timur), begitu juga Al Maghaarib (tempat terbenamnya di barat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan sumpah Allah Subhaanahu wa Ta'aala dengan tempat-tempat terbit dan terbenamnya matahari, bulan dan bintang, karena di sana terdapat tanda-tanda kekuasaan Allah yang menunjukkan bahwa Dia berkuasa membangkitkan dan berkuasa mengganti mereka dengan kaum yang lebih baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 40",
    "description": "40-41. Ayat ini untuk menegaskan kemahakuasaan Allah. Maka aku bersumpah demi tuhan yang mengatur tempat-tempat terbit dan terbenamnya matahari, bulan dan bintang, sungguh kami benar-benar mahakuasa atas segala sesuatu, dan kami pasti mampu untuk mengganti mereka yang kafir itu dengan kaum yang lebih baik dari mereka, dan kami sekali-kali tidak dapat dikalahkan oleh siapa pun"
  }
]