[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41. Kami bisa mengganti mereka dengan suatu kaum yang lebih baik dari mereka dan lebih patuh kepada Allah. Tidak ada seorang pun yang mendahului Kami, luput dari Kami, dan melemahkan Kami manakala Kami hendak mendatangkan kaum lain yang lebih baik dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Untuk menggantikan mereka dengan orang-orang selain mereka yang taat kepada Allah dan membinasakan mereka. Kami tidak lemah untuk melakukan hal itu, dan Kami tidak kalah kapan saja Kami berkehendak untuk membinasakan mereka dan mengganti mereka dengan selain mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. عَلَىٰٓ أَن نُّبَدِّلَ خَيْرًا مِّنْهُمْ (Untuk mengganti (mereka) dengan kaum yang lebih baik dari mereka) Yakni yang paling taat kepada Allah diantara orang-orang yang bermaksiat, kemudian Kami membinasakan mereka. وَمَا نَحْنُ بِمَسْبُوقِينَ(dan Kami sekali-kali tidak dapat dikalahkan) Yakni tidak dapat dihalangi jika Kami menginginkan hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Kami Maha berkuasa untuk menghancurkan mereka, mendatangkan ciptaan yang serupa dengan mereka, dan mengganti mereka dengan ciptaan yang lebih taat kepada Allah. Kami tidaklah kalah atau lemah untuk melakukan hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Untuk mengganti dengan yang lebih baik daripada mereka. Kami sekali-kali tidak dapat dikalahkan} tidak bisa dicegah jika Kami menghendaki hal itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41. Ini adalah sumpah Allah dengan arah timur (tempat terbit) dan barat (tempat terbenam) bagi matahari, bulan dan bintang, karena padanya terdapat tanda-tanda nyata atas pastinya Hari Kebangkitan serta kekuasaan Allah untuk mengganti orang-orang seperti mereka, padahal mereka menyaksikan sendiri, sebagaimana yang disebutkan dalam Firman Allah, dan menciptakan kamu kelak (di akhirat) dalam keadaan yang tidak kamu ketahui. -Alwaqiah:61- “Dan Kami sekali-kali tidak dapat dikalahkan,” yakni tidak ada seorang pun yang mengalahkan Kmai dan melemahkan Kami jika Kami ingin mengembalikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 41: Dan Allah Maha Kuasa untuk membinasakan mereka orang-orang kafir, dan menggantikan mereka dengan ciptaan-Nya yang lain, yang lebih taat dan utama dibandingan mereka. Dan Allah lemah akan hal demikian, bahkan tidak ada seorangpun yang menghalang-halangi Allah. Akan tetapi atas kehendak Allah, Allah mengakhirkan adzab bagi mereka sampai datang hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 41",
    "description": "40-41. Ayat ini untuk menegaskan kemahakuasaan Allah. Maka aku bersumpah demi tuhan yang mengatur tempat-tempat terbit dan terbenamnya matahari, bulan dan bintang, sungguh kami benar-benar mahakuasa atas segala sesuatu, dan kami pasti mampu untuk mengganti mereka yang kafir itu dengan kaum yang lebih baik dari mereka, dan kami sekali-kali tidak dapat dikalahkan oleh siapa pun. 42. Maka, wahai nabi Muhammad, biarkanlah mereka tenggelam dan bermain-main dalam kesesatan dengan menghabiskan waktu melakukan aktifitas yang tidak bermanfaat sampai mereka menjumpai hari yang diancamkan kepada mereka."
  }
]