[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-44. Tetapi telah ditetapkan dalam ilmu dan kehendak Kami penundaan hukuman terhadap orang-orang kafir dan tidak digantikannya mereka dengan kaum lainnya. Maka biarkanlah mereka tenggelam dalam kebatilan mereka, dan bermain-main di dunia mereka hingga mereka mendapati Hari Kiamat yang azabnya diancamkan kepada mereka, hari itu mereka keluar dari kubur dengan bergegas, sebagaimana di dunia mereka pergi bergegas ke tuhan-tuhan mereka yang mereka rekayasa untuk mereka sembah selain Allah, mereka berjalan dengan cepat, pandangan mata mereka tertunduk ke bawah, kehinaan dan kerendahan membekap mereka. Itulah hari yang diancamkan kepada mereka di dunia, yang dulu mereka menghina dan mendustakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Maka tinggalkanlah mereka -wahai Rasul- tenggelam dalam kebatilan dan kesesatan yang mereka lakukan dan bermain-main dengan kehidupan dunia mereka hingga mereka menemui hari Kiamat yang telah dijanjikan kepada mereka di dalam Al-Qur`ān."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42-44. Hai Nabi yang mulia, tinggalkanlah orang-orang musyrik itu dalam senda gurau dan kebatilan hingga datang azab kepada mereka pada hari kiamat yang mereka dustakan itu. Pada hari itu mereka akan keluar dari kubur untuk segera menuju padang mahsyar sebagaimana mereka bersegera menuju sesembahan mereka ketika di dunia. Akan tetapi mereka saat hari kiamat yang mereka dustakan kedatangannya itu memiliki pandangan yang sendu dan hina, mereka terselimuti kehinaan dan kerendahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. فَذَرْهُمْ يَخُوضُوا۟ (Maka biarkanlah mereka tenggelam) Dalam kebatilan mereka. وَيَلْعَبُوا۟( dan bermain-main) Dengan dunia mereka. Dan tetaplah kamu menyibukkan diri dengan apa yang diperintahkan kepadamu, dan janganlah kamu merasa berat atas apa yang mereka lakukan, sebab tugasmu hanyalah menyampaikan risalah. حَتَّىٰ يُلٰقُوا۟ يَوْمَهُمُ الَّذِى يُوعَدُونَ(sampai mereka menjumpai hari yang diancamkan kepada mereka) Yakni pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Maka biarkanlah orang-orang musyrik itu berbicara tentang kebatilan mereka dan bermain-main dengan dunia mereka sampai mereka dipertemukan dengan hari yang telah janjikan suatu azab di dalamnya untuk mereka. Hari itu adalah hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka biarkanlah mereka} biarkanlah mereka {tenggelam dan bermain-main sampai mereka menjumpai hari yang dijanjikan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Bila Hari Kebangkitan dan pembalasan telah tegas tapi mereka tetap mendustakan dan tidak tunduk pada tanda-tanda kebesaran Allah, “maka biarkanlah mereka tenggelam (dalam kebatilan) dan bermain-main,” yaitu tenggelam dalam perkataan batil dan keyakinan-keyakinan rusak, bermain-main dengan dunia mereka; makan, minum, serta bersenang-senang, “sampai mereka menjumpai hari yang diancamkan kepada mereka,” Allah telah menyediakan siksa bagi mereka, yang merupakan akibat dari tenggelamnya mereka dalam kesenangan serta sikap main-main mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 42: 42-44. Allah memerintahkan Nabi-Nya Muhammad ﷺ agar meninggalkan mereka yang sudah larut dengan kebathilan dan permainan dengan dunia mereka; Sampai tiba hari kiamat yang mereka dijanjikan dengan adzab. Yaitu hari dimana mereka dikeluarkan dari kubur-kubur mereka dengan cepat menuju ke tempat persaksian di hari kiamat dan hari pembalasan; Seolah-olah mereka datang menuju tempat persaksian dengan berlomba satu sama lain, sebagaimana mereka di dunia, mereka saling berlomba menuju sesembahan-sesembahannya, yang mereka merendahkan diri kepadanya untuk beribadah kepada selain Allah. Kondisi mereka keluar dari kuburan-kuburan mereka berlalu dengan begitu cepat dengan sekejap, sambil mata-mata mereka memandang dengan kehinaan, tertunduk dan tak berdaya. Kemudian Allah menjelaskan bahwa pada hari itu dan kondisi yang ada di dalamnya, telah diperingatkan kepada mereka di dunia yang mereka sungguh akan berjumpa (dengan hari kiamat). Akan tetapi mereka justru mendustakannya. Pada ayat ini terdapat penetapan hari kiamat, sebagaimana Nabi ﷺ menghimbau dengan berulang kali ketika berdakwah dan agar (manusia) tersibukkan (memiliki perhatian) dengan apa yang diperintahkannya dan agar mereka (orang-orang kafir) tidak mengabaikan ucapannya. Karena Nabi ﷺ adalah utusan (penyampai) kerisalahan dari Rabbnya dan membawa kabar baik bagi orang-orang yang beriman, serta membawa kabar untuk peringatan kepada orang-orang kafir. Adapun hidayah hanya ada di tangan Rabbul Alamin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika telah tetap kebangkitan dan pembalasan, namun mereka masih tetap mendustakan juga dan tidak mau tunduk kepada ayat-ayat Allah, maka biarkanlah mereka tenggelam dan bermain-main dalam kesesatan. Karena Allah Subhaanahu wa Ta'aala telah menyediakan untuk mereka pada hari itu siksaan dan bencana akibat sikap mereka itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 42",
    "description": "Maka, wahai nabi Muhammad, biarkanlah mereka tenggelam dan bermain-main dalam kesesatan dengan menghabiskan waktu melakukan aktifitas yang tidak bermanfaat sampai mereka menjumpai hari yang diancamkan kepada mereka. 43. Hari yang diancamkan kepada mereka itu yaitu pada hari ketika mereka, orang-orang kafir yang meminta disegerakan azab, keluar dari kubur menyambut panggilan malaikat yang ditugaskan Allah dengan cepat seakan-akan mereka pergi dengan segera kepada berhala-berhala yang mereka sembah sewaktu di dunia, ."
  }
]