[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-44. Tetapi telah ditetapkan dalam ilmu dan kehendak Kami penundaan hukuman terhadap orang-orang kafir dan tidak digantikannya mereka dengan kaum lainnya. Maka biarkanlah mereka tenggelam dalam kebatilan mereka, dan bermain-main di dunia mereka hingga mereka mendapati Hari Kiamat yang azabnya diancamkan kepada mereka, hari itu mereka keluar dari kubur dengan bergegas, sebagaimana di dunia mereka pergi bergegas ke tuhan-tuhan mereka yang mereka rekayasa untuk mereka sembah selain Allah, mereka berjalan dengan cepat, pandangan mata mereka tertunduk ke bawah, kehinaan dan kerendahan membekap mereka. Itulah hari yang diancamkan kepada mereka di dunia, yang dulu mereka menghina dan mendustakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Yaitu pada hari mereka keluar dari dalam kubur dengan cepat seakan-akan mereka berlomba-lomba menuju berhala mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. يَوْمَ يَخْرُجُونَ مِنَ الْأَجْدَاثِ((yaitu) pada hari mereka keluar dari kubur) Yakni keluar dari kubur mereka. سِرَاعًا(dengan cepat) Dengan bergegas. كَأَنَّهُمْ إِلَىٰ نُصُبٍ(seakan-akan kepada berhala-berhala) Yakni seakan-akan mereka menuju suatu tanda atau bendera yang ditancapkan. يُوفِضُونَ(mereka pergi dengan segera) Yakni saling berlomba menuju benda itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Hari dimana mereka keluar dari kubur dan bergegas menuju padang mahsyar. Seakan-akan mereka bergegas dan berlomba-lomba menuju sesuatu yang telah diketahui (sesuatu yang telah diketahui atau telah dilihat). Seperti lari dari jalan kegelapan ketika telah melihat suatu tanda yang dapat menunjukkan mereka (pada kebenaran)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika mereka keluar dari kubur} kubur {dengan cepat seperti ketika mereka pergi dengan segera} dengan bergegas {menuju berhala-berhala} menuju bendera"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-44. Kemudian Allah menyebutkan kondisi manusia ketika mereka bertemu dengan hari yang dijanjikan, “(Yaitu) pada hari mereka keluar dari kubur dengan cepat,” yakni dari dalam kubur-kubur dengan bersegera memenuhi panggilan penyeru, “seakan-akan mereka pergi dengan segera kepada berhala-berhala (sewaktu di dunia),” yakni seolah-olah mereka pergi menuju tanda yang menggiring mereka, mereka tidak kuasa membangkang penyeru dan menyimpang dari ajakan penyeru, mereka tunduk dan dipaksa untuk berdiri di hadapan Rabb semesta alam, “dalam keadaan mereka menekurkan pandangannya (serta) diliputi kehinaan,” karena kehinaan dan keresahan telah menguasai hati mereka dan bersemayam dalam benak mereka. Pandangan merasa takut dan tidak ada gerakan, serta terputuslah suara. Inilah kondisi dan akibat yang merupakan hari mereka itu nanti, “yang dahulunya diancamkan kepada mereka,” dan janji Allah pasti akan dipenuhi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 43: 42-44. Allah memerintahkan Nabi-Nya Muhammad ﷺ agar meninggalkan mereka yang sudah larut dengan kebathilan dan permainan dengan dunia mereka; Sampai tiba hari kiamat yang mereka dijanjikan dengan adzab. Yaitu hari dimana mereka dikeluarkan dari kubur-kubur mereka dengan cepat menuju ke tempat persaksian di hari kiamat dan hari pembalasan; Seolah-olah mereka datang menuju tempat persaksian dengan berlomba satu sama lain, sebagaimana mereka di dunia, mereka saling berlomba menuju sesembahan-sesembahannya, yang mereka merendahkan diri kepadanya untuk beribadah kepada selain Allah. Kondisi mereka keluar dari kuburan-kuburan mereka berlalu dengan begitu cepat dengan sekejap, sambil mata-mata mereka memandang dengan kehinaan, tertunduk dan tak berdaya. Kemudian Allah menjelaskan bahwa pada hari itu dan kondisi yang ada di dalamnya, telah diperingatkan kepada mereka di dunia yang mereka sungguh akan berjumpa (dengan hari kiamat). Akan tetapi mereka justru mendustakannya. Pada ayat ini terdapat penetapan hari kiamat, sebagaimana Nabi ﷺ menghimbau dengan berulang kali ketika berdakwah dan agar (manusia) tersibukkan (memiliki perhatian) dengan apa yang diperintahkannya dan agar mereka (orang-orang kafir) tidak mengabaikan ucapannya. Karena Nabi ﷺ adalah utusan (penyampai) kerisalahan dari Rabbnya dan membawa kabar baik bagi orang-orang yang beriman, serta membawa kabar untuk peringatan kepada orang-orang kafir. Adapun hidayah hanya ada di tangan Rabbul Alamin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan keadaan manusia ketika mereka menjumpai hari yang diancamkan kepada mereka. Ada pula yang menafsirkan ‘nushub’ dengan ‘bendera’, yakni mereka seakan-akan pergi dengan segera kepadanya. Mereka pergi untuk berdiri di hadapan Allah Rabbul ‘aalamiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 43",
    "description": "Hari yang diancamkan kepada mereka itu yaitu pada hari ketika mereka, orang-orang kafir yang meminta disegerakan azab, keluar dari kubur menyambut panggilan malaikat yang ditugaskan Allah dengan cepat seakan-akan mereka pergi dengan segera kepada berhala-berhala yang mereka sembah sewaktu di dunia, 44. Mereka bergegas dan pandangan mereka tertunduk ke bawah diliputi kehinaan. Itulah hari yang diancamkan kepada mereka yang dahulu ketika di dunia selalu mereka olok-olokkan bahkan mereka meminta disege-rakan."
  }
]