[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-44. Tetapi telah ditetapkan dalam ilmu dan kehendak Kami penundaan hukuman terhadap orang-orang kafir dan tidak digantikannya mereka dengan kaum lainnya. Maka biarkanlah mereka tenggelam dalam kebatilan mereka, dan bermain-main di dunia mereka hingga mereka mendapati Hari Kiamat yang azabnya diancamkan kepada mereka, hari itu mereka keluar dari kubur dengan bergegas, sebagaimana di dunia mereka pergi bergegas ke tuhan-tuhan mereka yang mereka rekayasa untuk mereka sembah selain Allah, mereka berjalan dengan cepat, pandangan mata mereka tertunduk ke bawah, kehinaan dan kerendahan membekap mereka. Itulah hari yang diancamkan kepada mereka di dunia, yang dulu mereka menghina dan mendustakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Dalam keadaan mereka menekurkan pandangan yang diliputi oleh kehinaan. Itulah hari yang dulu pernah dijanjikan kepada mereka di dunia sedang mereka tidak mempedulikannya kala itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. خٰشِعَةً أَبْصٰرُهُمْ (dalam keadaan mereka menekurkan pandangannya) Mereka tidak mengangkat pandangan mereka karena telah mengira azab yang akan menimpa mereka. تَرْهَقُهُمْ ذِلَّةٌ ۚ ((serta) diliputi kehinaan) Yakni diliputi oleh kehinaan yang sangat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Pandangan mereka tertunduk melihat posisi mereka yang akan menerima azab. Kehinaan yang amat rendah meliputi mereka. Itulah hari kiamat yang dijanjikan untuk mereka ketika di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(berhala mereka) {Pandangan mereka tertunduk} tunduk dan takluk {mereka diliputi} diselimuti {kehinaan} kehinaan {Itulah hari yang diancamkan kepada mereka}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-44. Kemudian Allah menyebutkan kondisi manusia ketika mereka bertemu dengan hari yang dijanjikan, “(Yaitu) pada hari mereka keluar dari kubur dengan cepat,” yakni dari dalam kubur-kubur dengan bersegera memenuhi panggilan penyeru, “seakan-akan mereka pergi dengan segera kepada berhala-berhala (sewaktu di dunia),” yakni seolah-olah mereka pergi menuju tanda yang menggiring mereka, mereka tidak kuasa membangkang penyeru dan menyimpang dari ajakan penyeru, mereka tunduk dan dipaksa untuk berdiri di hadapan Rabb semesta alam, “dalam keadaan mereka menekurkan pandangannya (serta) diliputi kehinaan,” karena kehinaan dan keresahan telah menguasai hati mereka dan bersemayam dalam benak mereka. Pandangan merasa takut dan tidak ada gerakan, serta terputuslah suara. Inilah kondisi dan akibat yang merupakan hari mereka itu nanti, “yang dahulunya diancamkan kepada mereka,” dan janji Allah pasti akan dipenuhi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 44: 42-44. Allah memerintahkan Nabi-Nya Muhammad ﷺ agar meninggalkan mereka yang sudah larut dengan kebathilan dan permainan dengan dunia mereka; Sampai tiba hari kiamat yang mereka dijanjikan dengan adzab. Yaitu hari dimana mereka dikeluarkan dari kubur-kubur mereka dengan cepat menuju ke tempat persaksian di hari kiamat dan hari pembalasan; Seolah-olah mereka datang menuju tempat persaksian dengan berlomba satu sama lain, sebagaimana mereka di dunia, mereka saling berlomba menuju sesembahan-sesembahannya, yang mereka merendahkan diri kepadanya untuk beribadah kepada selain Allah. Kondisi mereka keluar dari kuburan-kuburan mereka berlalu dengan begitu cepat dengan sekejap, sambil mata-mata mereka memandang dengan kehinaan, tertunduk dan tak berdaya. Kemudian Allah menjelaskan bahwa pada hari itu dan kondisi yang ada di dalamnya, telah diperingatkan kepada mereka di dunia yang mereka sungguh akan berjumpa (dengan hari kiamat). Akan tetapi mereka justru mendustakannya. Pada ayat ini terdapat penetapan hari kiamat, sebagaimana Nabi ﷺ menghimbau dengan berulang kali ketika berdakwah dan agar (manusia) tersibukkan (memiliki perhatian) dengan apa yang diperintahkannya dan agar mereka (orang-orang kafir) tidak mengabaikan ucapannya. Karena Nabi ﷺ adalah utusan (penyampai) kerisalahan dari Rabbnya dan membawa kabar baik bagi orang-orang yang beriman, serta membawa kabar untuk peringatan kepada orang-orang kafir. Adapun hidayah hanya ada di tangan Rabbul Alamin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena kehinaan dan kecemasan menguasai hati mereka sehingga penglihatan mereka pun ikut tertunduk, gerakan pun berhenti dan suara pun terdiam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 44",
    "description": "Mereka bergegas dan pandangan mereka tertunduk ke bawah diliputi kehinaan. Itulah hari yang diancamkan kepada mereka yang dahulu ketika di dunia selalu mereka olok-olokkan bahkan mereka meminta disege-rakan. 1. Pada penutup surah sebelumnya diuraikan tentang ancaman siksa yang akan diterima kaum yang durhaka. Di awal surah ini diuraikan kisah nabi nuh dan kaumnya sebagai peringatan bagi siapa saja termasuk kaum musyrik mekah, apabila durhaka maka bagi Allah mudah untuk mengazabnya. Sesungguhnya kami telah mengutus nuh kepada kaumnya dengan perintah, 'berilah kaummu peringatan sebelum datang kepadanya azab yang pedih. '."
  }
]