[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Sesungguhnya orang-orang kafir itu memandang azab itu jauh, bagi mereka itu tidak akan terjadi, sedangkan Kami melihatnya dekat, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sementara kami melihatnya dekat dan pasti terjadi, tidak disangsikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Sesungguhnya orang-orang musyrik itu beranggapan bahwa hari itu mustahil terjadi. Sedangkan kami melihatnya sudah dekat kejadiannya, karena setiap hal yang diciptakan itu sangat dekat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Kami memandangnya dekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-7. Allah berfirman, “Maka bersabarlah kamu dengan sabar yang baik,” yakni bersabarlah atas seruan dakwahmu untuk kaummu dengan sabar yang baik, jangan malas dan enggan, tapi teruslah berjalan di atas perintah Allah. Serulah para hambaNYa kepada tauhid. Jangan sampai ketidaktaatan dan ketidaktertarikan mereka yang kau saksikan menghalangimu. Karena bersabar atas hal tersebut merupakan kebaikan yang banyak. “Sesungguhnya mereka memandang siksaan itu jauh (mustahil). Sedangkan Kami memandangnya dekat (pasti terjadi),” kata ganti kembali kepada Hari Kebangkitan yang di dalamnya terdapat azab bagi mereka yang memintanya. Yaitu, kondisi mereka adalah kondisi orang yang memungkiri azab dan orang yang dikalahkan oleh kesengsaraan serta hilang akal hingga menganggap mustahil Hari Kebangkitan yang ada dihadapannya. Allah memandangnya dekat karena Dia Mahalembut dan Sabar yang tidak menyegerakan. Allah mengetahui azab itu pasti terjadi. Semua yang akan terjadi berarti dekat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 7: 6-7. Allah menjelaskan bahwa mereka orang-orang musyrik dengan sebab pengingkaran mereka atas hari kebangkitan dan hisab akan menjauhkan dari ditimpanya adzab dan turunnya (adzab) kepada mereka. Dan mereka memandang perkara ini jauh dan mustahil, akan tetapi Allah memandangnya dekat dan pasti bagi mereka (tidak mustahil)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 7",
    "description": "6-7. Mereka kaum kafir itu memandang azab itu jauh yaitu mustahil terjadi. Sedangkan kami memandangnya dekat yaitu pasti terjadi dan mudah bagi kami. 8-9. Ingatlah siksa yang akan dialami oleh kaum kafir itu akan terjadi pada hari ketika langit yang sehari-harinya terlihat kokoh menjadi bagaikan cairan tembaga, dan gunung-gunung yang demikian berat menancap di bumi bagaikan bulu yang beterbangan."
  }
]