[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Hari itu langit mencair seperti lelehan minyak, dan gunung-gunung seperti wol yang terbang ringan tertiup angin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan gunung-gunung menjadi seperti bulu karena ringannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Dan gunung-gunung akan tercabut dari tempatnya, sehingga seperti bulu wol yang berterbangan dengan warna-warna pegunungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَتَكُونُ الْجِبَالُ كَالْعِهْنِ (dan gunung-gunung menjadi seperti bulu (yang berterbangan)) Yakni seperti wol berwarna yang berterbangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Dan gunung-gunung seperti bulu-bulu wol yang dihambur-hamburkan. Seorang kerabat tidak akan bertanya tentang keadaan temannya karena masing-masing sibuk dengan keadaannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{gunung-gunung menjadi seperti bulu} seperti bulu yang ringan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. “Pada hari,” Kiamat, terjadilah peristiwa-peristiwa besar ini, “ketika langit menjadi seperti luluhan perak,” yakni seperti perak meleleh karena terbelah dan begitu gentingnya, “dan gunung-gunung menjadi seperti bulu (yang beterbangan),” yakni seperti bulu yang beterbangan kemudian setelah itu menjadi debu yang beterbangan dan lenyap."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ma’arij ayat 9: 8-10. Kemudian Allah mensifatkan hari kiamat dan mengabarkan bahwasanya langit mencair seperti luluhan perak, dan dikatakan seperti minyak mendidih. Dan gunung berterbangan seperti bulu yang berhamburan jika terkena angin. Pada hari itu tidak seorangpun bertanya akan kondisi keluarganya dan kondisi teman dekatnya; Semuanya sibuk dengan dirinya sendiri karena sebab dahsyatnya hari itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya menjadi debu yang berterbangan. Jika kecemasan menimpa benda-benda langit yang besar dan kuat, lalu bagaimana dengan manusia yang lemah yang punggungnya dibebani oleh dosa-dosa? Apa tidak membuat jantungnya berdebar-debar dan membuatnya lupa kepada setiap orang? Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Dan tidak ada seorang teman karib pun menanyakan temannya.” Meskipun ia melihat temannya, sehingga dalam hatinya tidak terpikir untuk bertanya kepada temannya dan tidak ada yang dipikirkannya selain dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’arij Ayat 9",
    "description": "8-9. Ingatlah siksa yang akan dialami oleh kaum kafir itu akan terjadi pada hari ketika langit yang sehari-harinya terlihat kokoh menjadi bagaikan cairan tembaga, dan gunung-gunung yang demikian berat menancap di bumi bagaikan bulu yang beterbangan. 10-13. Dan ketika itu tidak ada seorang teman karib pun menanyakan keadaan temannya, karena mencekamnya situasi dan kesibukan masing-masing dengan urusannya. Sedang mereka saling melihat, mereka semua sadar bahwa ketika itu, tidak berguna lagi bantuan teman dan kerabat. Pada hari itu, orang yang berdosa ingin sekiranya dia dapat menebus dirinya dari azab dengan menyerahkan anak-anaknya, dan istri yang selalu menemaninya dan saudaranya yang merupakan darah dagingnya, dan bukan hanya itu bahkan keluarga seperti ayah ibu yang selalu melindunginya di dunia."
  }
]