[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Alif lam Mim). Pembicaraan tentang huruf-huruf yang terputus-putus (di awal surat seperti ini) telah hadir di awal surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Mīm. Pembahasan tentang huruf-huruf seperti ini sudah disebutkan di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Manfaat: Diriwayatkan di dalam Bukhari dan Muslim, dari Abu Hurairah radliyallahu ‘anhu berkata: “Nabi membaca alif laam miim tanzilun pada pagi hari Jumat, dan hal ata ‘alal insan. 1. Alif, laam, miim adalah huruf hijaiyah, penjelasan sebagaimana surat sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Mīm"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 1: Telah berlalu pembahasan huruf muqatha’ah pada surah Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 1",
    "description": "1-2. Alif l'm m'm. Hanya Allah yang mengetahui hakikat maknanya. Allah-lah yang menurunkan Al-Qur'an, suatu mukjizat yang tidak dapat ditandingi. Turunnya Al-Qur'an itu tidak ada keraguan padanya, yaitu dari tuhan yang menguasai, mengatur, dan merawat seluruh alam. Al-qur'an bukan ciptaan manusia, tidak terkecuali nabi Muhammad. Al-qur'an juga bukan syair, apalagi sihir"
  }
]