[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang menyekutukan Allah yang mendustakan kebangkitan berkata, “Apakah bila daging dan tulang kita sudah menjadi tanah di dalam perut bumi, kita akan dibangkitkan sebagai makhluk yang baru?” mereka merasa hal itu mustahil tanpa berusaha mencari jalan kepada kebenaran, sebaliknya itu hanyalah kezhaliman dan pengingkaran dari mereka, karena mereka telah ingkar kepada perjumpaan dengan Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan orang-orang kafir yang mengingkari adanya hari Kebangkitan berkata, “Jika kami telah mati dan hilang dari muka bumi serta tubuh kami telah menjadi debu, apakah mungkin kami akan dibangkitkan lagi dalam keadaan hidup? Hal itu tidak masuk akal.” Memang dalam kenyataannya mereka itu kafir terhadap kebangkitan, tidak mengimaninya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Allah menyebutkan olokan orang-orang yang mengingkari hari kebangkitan: “Jika kami telah mati kemudian tulang dan daging kami telah bercampur dengan tanah, apakah kami akan dihidupkan kembali?” Mereka tidak hanya mengolok, namun mereka juga mendustakan perjumpaan dengan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَقَالُوٓا۟ أَءِذَا ضَلَلْنَا فِى الْأَرْضِ (Dan mereka berkata: “Apakah bila kami telah lenyap (hancur) dalam tanah) Yakni jika kami telah hancur dan berubah menjadi tanah serta tidak dapat dikenali dengan mata lagi أَءِنَّا لَفِى خَلْقٍ جَدِيدٍۭ ۚ( kami benar-benar akan berada dalam ciptaan yang baru?”) Yakni apakah kami akan dibangkitkan dan kembali hidup? بَلْ هُم بِلِقَآءِ رَبِّهِمْ كٰفِرُونَ(Bahkan mereka ingkar akan menemui Tuhannya) Yakni mengingkarinya kerena kesombongan dan kecongkakan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Orang-orang yang mengingkari hari kebangkitan berkata: Apakah jika kami telah lenyap dan lebur bersama debu di dalam tanah, lalu kami akan benar-benar diciptakan dengan bentuk ciptaan yang baru? Sebenarnya mereka pun sudah mengingkari hari akhirat dan hari perhitungan di depan Tuhan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah apabila kami telah lenyap di dalam tanah} Kami lenyap di dalam tanah dan menjadi tanah {kami akan menjadi ciptaan yang baru” Bahkan terhadap pertemuan dengan Tuhannya mereka ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Maksudnya, orang-orang yang mendustakan kebangkitan berkata dengan nada mengingkari, “Apakah bila kami telah lenyap di dalam tanah,” maksudnya, kami telah hancur, tercabik-cabik dan tercerai-berai di beberapa tempat yang tidak diketahui, “apakah kami benar-benar akan berada dalam ciptaan yang baru?” maksudnya, Kami benar-benar dibangkitkan kembali dalam kehidupan baru? Menurut anggapan mereka hal ini merupakan suatu yang sangat tidak mungkin! Hal itu karena mereka menganalogikan kekuasaan Sang Pencipta dengan kekuasaan mereka. Perkataan mereka ini sebenarnya hanyalah (sebuah) kezhaliman, sikap keras kepala, ingkar dan kekafiran terhadap perjumpaan dengan Allah, maka dari itu Allah berfirman, “Bahkan mereka terhadap pertemuan dengan Rabbnya mengingkari.” Jadi, perkataan mereka diketahui darimana sumbernya dan tujuannya. Dan jika tidak demikian, maka kalau sekiranya Dia menjelaskan kepada mereka berbagai dalil yang akurat (pasti) yang menujukkan bahwa semua itu benar, hal yang menjadikannya dapat disaksikan oleh mata hati, tak ubahnya seperti matahari bagi pandangan ; dan sudah cukup bagi mereka bahwa sesungguhnya mereka sudah tahu bahwa mereka telah diadakan pada awalnya dari ketiadaan. Maka “mengulangi (penciptaan)” itu lebih mudah daripada “memulai”. Dan demikian pula tanah yang mati (tandus), Allah menurunkan hujan di atasnya, lalu tanah itu pun menjadi hidup (subur) setelah (sebelumnya) ia mati, dan dengannya Allah menumbuhkan berbagai macam biji-bijian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 10: Berkata orang-orang musyrik dengan pengingkaran akan hari kiamat : Apakah jika bercerai berai jasad-jasad kami dan menjadi tanah kemudian bercampur dengan bumi; Apakah kami akan dibangkitkan dengan ciptaan yang baru?. Mereka berkata dengan pengingkaran dan kufur karena asal dari mereka adalah mengingkari hari kebangkitan; Oleh karena itu mereka adalah orang-orang kafir dalam perjumpaan kepada Allah pada hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengingkari kebangkitan karena menganggapnya mustahil. Maksudnya dihidupkan kembali untuk menerima balasan Allah pada hari kiamat. Yang demikian, karena mereka mengqiyaskan kekuatan Allah dengan kekuatan mereka. Perkataan mereka tersebut sebenarnya bukan mencari yang hak, tetapi karena zalim dan sikap membangkang, dan ingkar kepada pertemuan dengan Tuhannya. Dari sini dapat diketahui, awal dan akhir ucapan mereka. Kalau seandainya niat mereka mencari yang benar, tentu dalil-dalil yang ada cukup membuat mereka beriman, di mana dalil-dalil itu seperti matahari bagi penglihatan. Cukuplah bagi mereka, bahwa mereka diawali dari ketidakadaan, dan karena mengulangi lebih mudah daripada memulai, demikian pula dengan tumbuh suburnyat tanah yang sebelumnya mati saat Allah menurunkan hujan, dan lagi langit dan bumi lebih besar dari mereka, namun Dia mampu menciptakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 10",
    "description": "Allah mampu menciptakan manusia dari tidak ada dan mampu pula membangkitkannya kembali. Namun, orang kafir tetap pada pendiriannya dalam mengingkari hari kebangkitan. Dan dengan nada mengejek mereka berkata, 'apakah apabila kami telah mati, hancur, dan lenyap di dalam tanah, kami akan dibangkitkan kembali dan berada dalam ciptaan yang baru, lalu kami dimintai pertanggungjawaban atas perbuatan kami' jika demikian, alangkah rugi kami. ' mereka tidak mampu memahami keniscayaan hari kebangkitan karena menggunakan tolok ukur kekuatan manusia, bukan kemahakuasaan Allah yang telah menciptakan mereka dari tidak ada. Tidak hanya mengingkari kuasa-Nya, bahkan mereka pun mengingkari hari pertemuan mereka dengan tuhannya untuk menjalani hisab dan menerima balasan. 11. Baik yang mengimani maupun yang mengingkari hari kebangkitan sama-sama belum bisa membuktikannya secara langsung sebelum mati. Karena itu, wahai nabi Muhammad dan kaum mukmin, katakanlah kepada orang-orang musyrik bahwa malaikat maut yang diserahi untuk mencabut nyawa-Mu pasti akan mematikan kamu saat ajalmu tiba, kemudian kepada tuhanmu kamu akan dikembalikan. Itulah hari hisab, ketika semua manusia akan mempertanggungjawabkan perbuatannya di dunia. '."
  }
]