[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang musrik itu, “Malaikat maut yang ditugaskan pada kalian akan mewafatkan kalian. Bila ajal kalian habis, malaikat tersebut akan mencabut arwah kalian, tidak tertunda sesaat pun. Kemudian kalian dipulangkan kepada Tuhan kalian, lalu Dia akan membalas kalian atas seluruh amal perbuatan kalian, bila baik, dengan balasan baik, dan bila buruk, maka dengan balasan buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Katakan -wahai Rasul- kepada orang-orang musyrik yang mendustakan adanya hari Kebangkitan, “Malaikat maut yang ditugaskan untuk mencabut ruh kalian, mewafatkan kalian kemudian hanya kepada Kami semata pada Hari Kiamat kalian dikembalikan untuk perhitungan amal dan pembalasannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Maka Allah membantah mereka, Hai Rasulullah katakanlah: “Malaikat maut yang bertugas mencabut nyawa akan mematikan kalian, kemudian kalian akan kembali kepada Tuhan kalian agar Dia memberi siksaan atas kekafiran kalian.” Syeikh as-Syinqithi berkata, secara dzahir ayat ini menjelaskan malaikat yang bertugas mencabut nyawa adalah satu malaikat tertentu, akan tetapi Allah menjelaskan dalam beberapa ayat yang lain bahwa manusia akan dicabut nyawa mereka oleh banyak malaikat, bukan oleh satu malaikat saja, seperti dijelaskan dalam firman Allah: إِنَّ ٱلَّذِينَ تَوَفَّىٰهُمُ ٱلْمَلَٰٓئِكَةُ ظَالِمِىٓ أَنفُسِهِمْ قَالُوا۟ فِيمَ كُنتُمْ ۖ قَالُوا۟ كُنَّا مُسْتَضْعَفِينَ فِى ٱلْأَرْضِ ۚ قَالُوٓا۟ أَلَمْ تَكُنْ أَرْضُ ٱللَّهِ وَٰسِعَةً فَتُهَاجِرُوا۟ فِيهَا ۚ فَأُو۟لَٰٓئِكَ مَأْوَىٰهُمْ جَهَنَّمُ ۖ وَسَآءَتْ مَصِيرًا Sesungguhnya orang-orang yang diwafatkan malaikat dalam keadaan menganiaya diri sendiri, (kepada mereka) malaikat bertanya: \"Dalam keadaan bagaimana kamu ini?\". Mereka menjawab: \"Adalah kami orang-orang yang tertindas di negeri (Mekah)\". Para malaikat berkata: \"Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah di bumi itu?\". Orang-orang itu tempatnya neraka Jahannam, dan Jahannam itu seburuk-buruk tempat kembali, (an-Nisa: 97). Dan dalam firman Allah: فَكَيْفَ إِذَا تَوَفَّتْهُمُ ٱلْمَلَٰٓئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَٰرَهُمْ Bagaimanakah (keadaan mereka) apabila malaikat mencabut nyawa mereka seraya memukul-mukul muka mereka dan punggung mereka? (Muhammad: 27)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. قُلْ يَتَوَفَّىٰكُم مَّلَكُ الْمَوْتِ (Katakanlah: “Malaikat maut akan mematikanmu) Terdapat mendapat mengatakan bahwa nama malaikat itu adalah Izra’il. الَّذِى وُكِّلَ بِكُمْ(yang diserahi untuk (mencabut nyawa)mu) Yakni ditugaskan untuk mencabut nyawa kalian saat ajal kalian telah datang. ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ(kemudian hanya kepada Tuhanmulah kamu akan dikembalikan) Yakni kalian dikembalikan kepada-Nya dalam keadaan hidup, kemudian Allah akan membalas amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Katakanlah wahai Nabi: Malaikat maut akan benar-benar mencabut nyawa kalian. Dia adalah malaikat Izrail yang diberi tugas untuk mencabut arwah kalian ketika ajal kalian telah tiba. Kemudian mengembalikannya kepada Sang Pencipta"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Malaikat maut yang ditugaskan untuk (mencabut nyawa) kalian} yang ditugaskan oleh Allah untuk mencabut nyawa kalian {akan mematikan kalian} mencabut nyawa kalian {kemudian kepada Tuhan kalianlah akan dikembalikan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Kataknalah, ‘Malakul maut yang diserahi untuk mencabut nyawamu akan mematikanj kamu’.” Maksudnya, malaikat yang telah ditugaskan oleh Allah untuk mencabut ruh, dan ia mempunyai banyak malaikat pembantu, “kemudian hanya kepada Rabbmulah kamu akan dikembalikan.” Lalu Allah memberikan balasan kepada kalian sesuai dengan amal perbuatan kalian; dan kalian telah mengingkari kebangkitan, maka tunggulah apa yang dilakukan Allah terhadap kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 11: Katakanlah wahai Nabi Allah kepada orang-orang musyrik : Akan datang malaikat maut mengurusi (menggenggam) ruh-ruh kalian; Di mana Allah membebani urusan malaikat maut dengan urusan yang penting ini, kemudian Allah bangkitkan pada hari kiamat untuk dihisab dan dibalas atas seluruh amalan dengan apa yang pantas dari kebaikan atau keburukan. Berkata Syaikh kami Muhammad Al Amin Asy Syinqithi : Sesungguhnya penyandaran urusan akhir kepada malaikat maut pada ayat ini, Karena malaikat maut diperintahkan untuk menggenggam ruh, dan penyandarannya pada firman Allah dalam surat Muhammad : 27."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lalu Dia membalas amalmu. Oleh karena kamu telah mengingkari kebangkitan, maka lihatlah apa yang Allah lakukan terhadap kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 11",
    "description": "Baik yang mengimani maupun yang mengingkari hari kebangkitan sama-sama belum bisa membuktikannya secara langsung sebelum mati. Karena itu, wahai nabi Muhammad dan kaum mukmin, katakanlah kepada orang-orang musyrik bahwa malaikat maut yang diserahi untuk mencabut nyawa-Mu pasti akan mematikan kamu saat ajalmu tiba, kemudian kepada tuhanmu kamu akan dikembalikan. Itulah hari hisab, ketika semua manusia akan mempertanggungjawabkan perbuatannya di dunia. '12. Saat hari hisab itu tiba, kamu akan melihat orang kafir tampak seperti pesakitan yang menunggu putusan. Dan alangkah ngerinya jika sekiranya engkau melihat orang-orang yang berdosa itu menundukkan kepalanya di hadapan pengadilan tuhannya di hari kiamat kelak, padahal dulunya mereka begitu angkuh kepada tuhan. Di sana mereka merengek, 'ya tuhan kami, kami sekarang benar-benar taat dan patuh kepada-Mu. Kami telah melihat dengan mata kepala kami hari kebangkitan dan mendengar betapa ajaran para rasul-Mu adalah benar, maka dengan kuasa dan rahmat-Mu kembalikanlah kami ke dunia sekali saja, niscaya kami akan mengerjakan kebajikan yang engkau ridai, tidak seperti yang kami lakukan dulu. Sungguh, saat ini kami adalah orang-orang yang yakin dengan sepenuhnya. ' Allah tidak akan mengabulkan permintaan itu karena dia tahu benar karakter mereka. Mereka tidak akan menjadi orang baik walaupun sekiranya diberi kesempatan kembali ke dunia (lihat: surah al-an''m/6: 27'28)."
  }
]