[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya kamu melihat (wahai manusia) saat orang-orang yang gemar berbuat dosa yang mengingkari kebangkitan, menundukkan kepala mereka di hadapan Tuhan mereka dengan penuh rasa malu dan kehinaan. Mereka berkata “Wahai Tuhan kami, kami melihat keburukan-keburukan kami, kami mendengar dariMu pembenaran apa yang diperintahkan kepada oleh utusan-utusanMu di dunia, dan sungguh kami bertaubat kepadaMu, kembalikanlah kami ke dunia supaya kami bisa beramal menaatiMu, sekarang kami meyakini apa yang dulu kami ingkari di dunia, yaitu keesaanMu dan bahwa Engkau membangkitkan manusia dari kubur mereka.” Bila kamu melihat (wahai manusia) semua itu, niscaya kamu melihat suatu perkara yang besar dan musibah yang agung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Orang-orang berdosa pasti akan muncul pada hari Kiamat dalam keadaan hina. Mereka menundukkan kepala mereka karena kekufuran mereka terhadap hari Kebangkitan. Mereka merasa sedih dan berkata, “Wahai Rabb kami! Kami telah melihat kebangkitan yang pernah kami dustakan dan kami telah mendengar kebenaran risalah yang dibawa oleh para rasul dari sisi-Mu, maka kembalikan kami ke kehidupan dunia, niscaya kami akan melakukan amal saleh yang menjadikan-Mu rida terhadap kami. Sesungguhnya kami sekarang percaya dengan adanya kebangkitan dan kebenaran yang dibawa oleh para rasul.” Jika engkau melihat orang-orang yang berdosa itu dalam keadaan demikian, sungguh engkau melihat perkara yang agung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Kemudian Allah menjelaskan keadaan mereka pada hari kiamat saat mereka berdiri di dekat neraka dengan menundukkan kepada karena kehinaan yang mereka alami, mereka memohon pertolongan: “Ya Tuhan kami, kami telah menyaksikan kesalahan kami dan kami telah mendengar dan mengetahui kebenaran, maka kembalikanlah kami ke dunia agar kami dapat menjalankan ketaatan kepada-Mu, sungguh kami benar-benar beriman kepada keesaan-Mu.” Allah telah menjelaskan dalam ayat lain bahwa jika Dia mengembalikan mereka ke dunia sebagaimana yang mereka minta, niscaya mereka akan kembali mendustakan, sebagaimana disebutkan dalam firman Allah: وَلَوْ تَرَىٰٓ إِذْ وُقِفُوا۟ عَلَى ٱلنَّارِ فَقَالُوا۟ يَٰلَيْتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِـَٔايَٰتِ رَبِّنَا وَنَكُونَ مِنَ ٱلْمُؤْمِنِين بَلْ بَدَا لَهُم مَّا كَانُوا۟ يُخْفُونَ مِن قَبْلُ ۖ وَلَوْ رُدُّوا۟ لَعَادُوا۟ لِمَا نُهُوا۟ عَنْهُ وَإِنَّهُمْ لَكَٰذِبُونَ Dan jika kamu (Muhammad) melihat ketika mereka dihadapkan ke neraka, lalu mereka berkata: \"Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman\", (tentulah kamu melihat suatu peristiwa yang mengharukan). Tetapi (sebenarnya) telah nyata bagi mereka kejahatan yang mereka dahulu selalu menyembunyikannya. Sekiranya mereka dikembalikan ke dunia, tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya. Dan sesungguhnya mereka itu adalah pendusta belaka. (al-An’am: 27-28)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَلَوْ تَرَىٰٓ إِذِ الْمُجْرِمُونَ (Dan, jika sekiranya kamu melihat mereka ketika orang-orang yang berdosa itu) Merka adalah orang-orang yang mengatakan “apakah kami jika telah hancur di dalam tanah….” نَاكِسُوا۟ رُءُوسِهِمْ(menundukkan kepalanya) Yakni menundukkan kepada mereka karena rasa malu dan menyesal atas kemusyrikan dan kemaksiatan yang telah mereka kalukan di dunia. عِندَ رَبِّهِمْ(di hadapan Tuhannya) Ketika Allah menghisab mereka; maka kamu akan menyaksikan keanehan. رَبَّنَآ أَبْصَرْنَا((mereka berkata): “Ya Tuhan kami, kami telah melihat) kini kami telah menyaksikan apa yang telah kami dustakan dahulu. وَسَمِعْنَا(dan mendengar) Yakni mendengar apa telah yang kami ingkari. Pendapat lain mengatakan maknanya adalah kami telah menyaksikan kebenaran ancaman-Mu, dan kami telah mendengar kebenaran rasul-Mu. Namun mereka melihat itu ketika penglihatan tidak ada gunanya lagi dan mereka mendengar ketika pendengaran tidak bermanfaat lagi. فَارْجِعْنَا(maka kembalikanlah kami) Ke dunia. نَعْمَلْ(kami akan mengerjakan) Amalan. صٰلِحًا(yang saleh) Sebagaimana yang Engkau perintahkan. إِنَّا مُوقِنُونَ (sesungguhnya kami adalah orang-orang yang yakin) Yakni percaya terhadap apa yang dibawa oleh Muhammad. Mereka menyebut diri mereka yakin ketika itu dengan harapan dapat benar-benar dikembalikan ke dunia; namun atas dasar apa mereka mengatakan ini? Seandainya mereka dikembalikan ke dunia niscaya mereka akan kembali melakukan apa yang dilarang bagi mereka, dan mereka benar-benar para pendusta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Alangkah mengerikan jika kamu wahai Nabi, melihat ketika orang-orang musyrik yang mengingkari hari kebangkitan itu dihadapkan pada Tuhan mereka. Mereka membungkuk dan menundukkan kepala mereka dengan malu dan menyesal atas perhitungan amal mereka. Engkau akan melihat mereka berkata: Wahai Tuhan kami, kami telah melihat apa yang dulu kami dustakan, juga kami telah melihat hari kebangkitan yang dulu Engkau janjikan. Kami telah mendengar janji dan pembenaran terhadap rasul yang dulu kami dustakan. Maka dari itu, kembalikan lagi kami ke dunia, kami akan mengerjakan amal kebaikan sesuai perintah-Mu. Sesungguhnya kami adalah orang-orang yang mempercayai ajaran yang dibawa Rasul SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu melihat orang-orang yang berdosa itu menundukkan kepala mereka} menundukkan kepala mereka karena merasa hina dan rendah {di hadapan Tuhan mereka,“Ya Tuhan kami, kami telah melihat dan mendengar. Maka kembalikanlah kami} Kembalikanlah kami ke dunia {niscaya kami akan beramal shalih. Sesungguhnya kami adalah orang-orang yang yakin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Setelah Allah menjelaskan kepulangan mereka kepadaNya pada Hari Kiamat nanti, Dia menjelaskan kondisi mereka di saat menghadap di hadapanNYa, seraya berfirman, “Dan (alangkah ngerinya) jika sekiranya kamu melihat ketika orang-orang yang berdosa itu,” maksudnya, orang-orang yang terus melakukan dosa-dosa besar itu, “menundukkan kepalanya di hadapan Rabbnya” dengan tunduk, patuh dan hina, sambil mengakui dosa-dosa mereka lagi memohon agar dikembalikan ke dunia, seraya mengatakan, “Ya Rabb kami, kami telah melihat dan mendengar.” Maksudnya, permasalahan sudah jelas sekarang bagi kami, dan kami pun telah melihatnya dengan mata kepala kami, hingga menjadi pandangan yang sangat meyakinkan, “maka kembalikanlah kami, niscaya kami akan mengerjakan amal shalih, sesungguhnya kami adalah orang-orang yang yakin.” Maksudnya, kami sekarang sudah mempunyai keyakinan dengan sesuatu yang dahulu kami npernah dustakan. Maksudnya, niscaya kamu nmelihat suatu perkara yang sangat mengerikan dan kondisi yang sangat menakutkan, orang-orang yang merugi dan permohonan yang tidak pernah dikabulkan, karena waktu penagguhan sudah berlalu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 12: Seandainya engkau melihat wahai Nabi Allah, keadaan orang-orang yang berdosa, yang mendustakan hari kebangkitan pada hari kiamat, di mana Allah tampakkan (hari tersebut) kepada mereka, dan mereka dalam keadaan terhina dan malu, sungguh mereka terkejut, menyesal dan meratap (penuh penyesalan). Mereka semua datang dalam keadaan kepala-kepala mereka tertunduk dan terhina seraya ada yang berkata : Wahai Tuhan kami, sungguh kami telah melihatnya secara nyata dengan mata-mata kami, dan kami telah mendengar dengan telinga-telinga kami, atas apa yang telah kami ingkari dan dustakan, maka kembalikan kami wahai Tuhan kami di dunia, kami akan beramal dengan amalan shalih, sungguh kami akan menjadi orang-orang yang yakin, membenarkan hari kebangkitan dan balasan dengan sebenar-benarnya secara pasti tanpa keraguan padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan kembalinya mereka kepada-Nya pada hari Kiamat, Dia menyebutkan keadaan mereka saat berdiri di hadapan-Nya. Yakni orang-orang kafir atau yang senantiasa mengerjakan dosa-dosa besar. Karena malu, dan mereka mengakui dosa-dosa mereka, sambil meminta kembali ke dunia. Apa yang kami ingkari, yaitu kebangkitan. Ketika itu, kamu akan melihat peristiwa yang mengerikan, keadaan yang menegangkan, orang-orang yang rugi, pertanyaan yang tidak dijawab, dsb. dan pada saat itu, bukanlah kesempatan lagi untuk beramal sehingga permintaan mereka untuk kembali ke dunia tidak dikabulkan. Ini semua adalah dengan qadha dan qadar Allah, karena Dia sudah membiarkan mereka di atas kekafiran dan kemaksiatan, nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 12",
    "description": "Saat hari hisab itu tiba, kamu akan melihat orang kafir tampak seperti pesakitan yang menunggu putusan. Dan alangkah ngerinya jika sekiranya engkau melihat orang-orang yang berdosa itu menundukkan kepalanya di hadapan pengadilan tuhannya di hari kiamat kelak, padahal dulunya mereka begitu angkuh kepada tuhan. Di sana mereka merengek, 'ya tuhan kami, kami sekarang benar-benar taat dan patuh kepada-Mu. Kami telah melihat dengan mata kepala kami hari kebangkitan dan mendengar betapa ajaran para rasul-Mu adalah benar, maka dengan kuasa dan rahmat-Mu kembalikanlah kami ke dunia sekali saja, niscaya kami akan mengerjakan kebajikan yang engkau ridai, tidak seperti yang kami lakukan dulu. Sungguh, saat ini kami adalah orang-orang yang yakin dengan sepenuhnya. ' Allah tidak akan mengabulkan permintaan itu karena dia tahu benar karakter mereka. Mereka tidak akan menjadi orang baik walaupun sekiranya diberi kesempatan kembali ke dunia (lihat: surah al-an''m/6: 27'28). 13. Sebetulnya Allah mampu memaksa setiap manusia untuk beriman, namun hal tersebut justru akan merendahkan martabat mereka menjadi setara dengan matahari, bumi, langit, dan sebagainya yang tidak punya pilihan lain kecuali tunduk. Itulah mengapa Allah memberi setiap manusia pilihan, bukan paksaan, untuk beriman atau tidak. Dan jika kami menghendaki memberi petunjuk niscaya kami berikan kepada setiap jiwa petunjuk bagi-Nya, tetapi telah ditetapkan perkataan dan ketetapan dari-ku bahwa pasti akan aku penuhi neraka jahanam dengan jin dan manusia bersama-sama. Yang demikian itu karena kami tahu bahwa kebanyakan mereka lebih memilih jalan kesesatan daripada hidayah."
  }
]