[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan jika Kami berkehendak, niscaya Kami memberikan petunjuk kepada orang-orang yang menyekutukan Allah itu dan membimbing mereka kepada iman, akan tetapi keputusanKu telah bulat dan tetap atas mereka. Aku benar-benar akan memenuhi Jahanam dengan orang-orang yang kafir dan para pelaku kemaksiatan, baik dari kalangan jin maupun manusia seluruhnya. Hal itu karena mereka memilih kesesatan di atas petunjuk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan jika Kami berkehendak untuk memberikan petunjuk dan taufik kepada setiap jiwa niscaya Kami akan melakukannya, akan tetapi telah tetap perkataan dari-Ku sebagai bentuk kebijaksanaan dan keadilan, sungguh Kami akan isi neraka Jahanam pada hari Kiamat dari dua golongan orang kafir; jin dan manusia, karena mereka memilih jalan kekufuran dan kesesatan daripada jalan keimanan dan istikamah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Seandainya Kami hendak memberi hidayah kepada seluruh hamba, niscaya Kami akan melakukannya, akan tetapi telah ditetapkan bahwa Aku pasti akan mengisi neraka Jahannam dengan orang-orang yang bermaksiat dari golongan jin dan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَلَوْ شِئْنَا لَاٰتَيْنَا كُلَّ نَفْسٍ هُدَىٰهَا (Dan kalau Kami menghendaki niscaya Kami akan berikan kepada tiap-tiap jiwa petunjuk) Sehingga Kami beri hidayah semua manusia, hingga tidak ada seorangpun yang kafir. وَلٰكِنْ حَقَّ الْقَوْلُ مِنِّى(akan tetapi telah tetaplah perkataan dari pada-Ku) Yakni telah ditentukan kalimat-Ku dan ditetapkan ketetapan-Ku. لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ(“Sesungguhnya akan Aku penuhi neraka jahannam itu dengan jin dan manusia bersama-sama”) Ini merupakan firman Allah yang Dia wajibkan atas diri-Nya terhadap hamba-hamba-Nya, sebab Allah telah mengetahui bahwa mereka adalah orang-orang yang akan menjadi penghuni neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Jika sekiranya Kami menghendaki untuk memberi petunjuk kepada semua manusia, maka Kami akan benar-benar memberi petunjuk kepada setiap jiwa. Namun ketetapanku telah terjadi dan mendahului. Neraka Jahannam akan dipenuhi oleh jin dan manusia sebab kesesatan yang telah mereka lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya Kami berhendak, niscaya Kami menganugerahkan} Kami akan memberi {kepada setiap jiwa petunjuk baginya} bimbingan dan tuntunan kepada keimanan {tetapi telah berlaku} wajib berlaku {ketetapan dariKu sungguh Aku pasti akan memenuhi neraka Jahanam dengan jin} golongan jin {dan manusia bersama-sama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Semua ini terjadi berdasarkan keputusan Allah dan takdirNya, yang mana Dia telah membiarkan mereka melakukan kakafiran dan berbnagai maksiat. Maka dari itu, Dia berfirman “Dan kalau Kami menghendaki, niscaya Kami akan berikan kepada tiap-tiap jiwa petunjuknya.” Maksudnya, niscaya Kami memberi petunjuk kepada manusia semuanya, dan Kami himpun mereka berpegang teguh kepada petunjuk, sebab kehendak (masyi’ah) Kami layak untuk itu, akan tetapi hikmah (kebijaksanaan) itu tidak menghendaki kalau mereka semua berpegang teguh pada petunjuk (hidayah). Maka dari itu Allah berfirman, “Akan tetapi telah tetaplah perkataan dariKu” maksudnya, telah menjadi wajib pasti dengan kepastian yang btidak aka nada perubahan padanya, “Sesungguhnya akan Aku penuhi Neraka Jahanam itu dengan jin dan manusia bersama-sama.” Ini adalah ancaman yang pasti, dan tidak akan bisa lari darinya, maka harus ditegaskan penyebabnya, yaitu kekafiran dan maksiat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 13: Allah mengabarkan bahwasannya seandainya Dia menghendaki dengan menyetujui seluruh jiwa dan menunjuki kepada keimanan; Maka Allah kuasa akan hak tersebut, yaitu menjadikan manusia di atas petunjuk, Allah bias saja jadikan mereka seperti malaikat, akan tetapi telah berlaku hikmah Allah untuk menjadikan manusia memiliki pilihan, kemudian Allah penuhi jahannam bagi mereka yang memilih jalan kekafiran dan dosa serta maksiat, Allah juga penuhi surge bagi mereka yang mengikuti para rasul dan memilih jalan petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tentu Dia akan menunjuki manusia semuanya dan mengumpulkan mereka di atasnya. Kehendak-Nya cocok untuk itu, akan tetapi hikmah tidak menghendaki mereka di atas petunjuk. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Tetapi telah ditetapkan perkataan (ketetapan) dari-Ku,” \"Pasti akan Aku penuhi neraka Jahannam dengan jin dan manusia bersama-sama.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 13",
    "description": "Sebetulnya Allah mampu memaksa setiap manusia untuk beriman, namun hal tersebut justru akan merendahkan martabat mereka menjadi setara dengan matahari, bumi, langit, dan sebagainya yang tidak punya pilihan lain kecuali tunduk. Itulah mengapa Allah memberi setiap manusia pilihan, bukan paksaan, untuk beriman atau tidak. Dan jika kami menghendaki memberi petunjuk niscaya kami berikan kepada setiap jiwa petunjuk bagi-Nya, tetapi telah ditetapkan perkataan dan ketetapan dari-ku bahwa pasti akan aku penuhi neraka jahanam dengan jin dan manusia bersama-sama. Yang demikian itu karena kami tahu bahwa kebanyakan mereka lebih memilih jalan kesesatan daripada hidayah. 14. Wahai manusia yang kafir, kamu layak mendapat kehinaan itu, maka rasakanlah olehmu azab ini disebabkan kamu telah mendustakan dan melalaikan pertemuan dengan harimu ini, yakni hari kiamat. Karena kamu melalaikan pertemuan ini dan tidak mempersipkan diri dengan iman dan amal saleh, sesungguhnya kami pun melalaikan kamu dan tidak memberi kamu naungan di hari yang tidak akan kamu temukan naungan selain dari-ku, dan rasakanlah azab yang kekal sebagai balasan atas apa yang telah kamu kerjakan di dunia. '."
  }
]