[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikatakan kepada orang-orang musyrik itu Pada saat mereka dimasukkan ke dalam nereka,sebagai celaan, “Rasakanlah siksa disebabkan kelalaian kalian terhadap kehidupan akhirat dan tenggelamnya kalian dalam kenikmatan dunia. Hari ini Kami membiarkan kalian dalam azab, rasakanlah azab Jahanam yang tidak terputus akibat dari perbuatan kalian di dunia berupa kekafiran kepada Allah dan kemaksiatan kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan dikatakan kepada mereka pada hari Kiamat sebagai bentuk penghinaan dan merendahkan mereka, “Rasakanlah siksa disebabkan karena kelalaian kalian di kehidupan dunia terhadap pertemuan dengan Allah pada Hari Kiamat untuk memperhitungkan amal kalian. Kami meninggalkan kalian di dalam siksa tanpa peduli dengan rasa sakit yang kalian rasakan, dan rasakanlah siksa Neraka yang kekal, yang tidak terputus dikarenakan kemaksiatan yang kalian lakukan di dunia.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Allah mengolok orang-orang musyrik yang disiksa di neraka: “Rasakanlah azab neraka akibat kelalaian kalian terhadap perjumpaan dengan Allah di hari ini. Pada hari ini Kami membiarkan kalian di dalam neraka selama-lamanya akibat dosa-dosa yang telah kalian lakukan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فَذُوقُوا۟ بِمَا نَسِيتُمْ لِقَآءَ يَوْمِكُمْ هٰذَآ (Maka rasailah olehmu (siksa ini) disebabkan kamu melupakan akan pertemuan dengan harimu ini) Yakni rasakanlah azab pada pertemuan dengan hari kalian ini akibat kalian enggan untuk menjalankan apa yang diperintahkan kepada kalian. وَذُوقُوا۟ عَذَابَ الْخُلْدِ بِمَا كُنتُمْ تَعْمَلُونَ (dan rasakanlah siksa yang kekal, disebabkan apa yang selalu kamu kerjakan) Yakni rasakanlah azab yang tidak akan pernah berhenti ini akibat kekafiran dan kemaksiatan yang kalian lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Maka rasakanlah azab ini sebab ketidakpedulian dan keengganan kalian untuk menjalankan perintah. Kalian juga tidak mempersiapkan diri untuk menghadapi hari kiamat. Maka rasakanlah azab Jahannam ini selamanya, sebab perbuatan kufur dan dusta kalian terhadap rasul serta maksiat kalian ketika di dunia. Ancaman atas azab tersebut diulangi sebagai penekanan. Sebab mereka menerima azab adalah karena dua hal yaitu dusta dan maksiat, untuk menunjukkan bahwa kedua perbuatan itu mengundang siksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Rasakanlah itu, karena kalian melalaikan pertemuan dengan hari kalian ini. Sesungguhnya Kami pun melalaikan kalian} Kami membiarkan kalian menerima azab {Rasakanlah azab yang kekal} neraka abadi yang tidak ada hentinya {karena apa yang selalu kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Maka kalian rasakanlah disebabkan kalian melupakan akan pertemuan dengan harimu ini.” Maksudnya, akan dikatakan kepada para pelaku dosa yang telah diselimuti oleh rasa hina dan memohon supaya dikembalikan lagi ke dunia untuk mendapatkan apa yang telah terlewatkan, “Sesungguhnya waktu kembali sudah lewat, tidak ada lagi yang tersisa kecuali azab. Maka rasakanlah azab yang sangat perih disebabkan kalian melupakan pertemuan dengan hari ini.” Lupa di sini adalah lupa dalam arti mengabaikan. Maksudnya, disebabkan sesuatu yang kalian berpaling darinya, dan kalian tidak bermala untuknya, dan seakan-akan menjumpainya. “Sesungguhnya Kami telah melupakan kamun pula,” maksudnya, Kami tinggalkan kalian dengan siksaan sebagai balasan atas perbuatan kalian. Maka karena kalian melupakan, Kami pun melupakan kalian, “dan rasakanlah siksa yang kekal,” yaitu siksaan yang tiada hentinya. Sebab, suatu siksaan, kalau mempunyai batas waktu dan akhirannya, maka di situ terdapat sedikit waktu untuk bernapas dan keringanan. Adapun siksa Neraka Jahanam, -semoga Allah melindungi kita darinya-, maka tidak ada sedikit waktu pun untuk beristirahat dan tidak akan pernah ada hentinya bagi siksaan mereka di dalamnya; “Disebabkan amal yang selalu kamu kerjakan,” yaitu kekafiran, kefasikan, dan berbagai maksiat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 14: Dikatakan kepada mereka para pendosa pada hari kiamat ketika mereka dimasukkan ke dalam neraka : Rasakan oleh kalian wahai para pendosa, adzab neraka ini; Dengan sebab jauhnya dan penolakan kalian dari petunjuk dan iman akan hari akhirat dan apa yang padanya terdapat hisab. Sungguh Kami abaikan kalian pada hari kiamat karena sebab terdapat kekafiran tersembunyi, penolakan dan kesesatan pada diri kalian, maka rasakanlah adzab yang kekal dengan sebab apa yang kalian beramal di dunia dari kekufuran dan maksiat. Firman Allah : Kami lupakan kalian, maksudnya adalah kami tinggalkan kalian di dalam neraka dengan abai kepada kalian, kata Nasiynakum datang menggantikan Nasiynahum, dan Allah disucikan dari ketidaktahuan atas apa yang ghaib; Dia suci dari segala apa yang kurang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Akan dikatakan kepada orang-orang yang berdosa yang telah dikuasai oleh kehinaan, yang meminta kembali ke dunia untuk mengejar hal yang telah luput dari mereka, padahal tidak mungkin lagi kembali ke dunia, sedangkan yang ada pada saat itu adalah azab. Yakni karena kamu berpaling darinya, tidak beriman dan beramal saleh untuk menghadapinya, seakan-akan kamu tidak akan menghadap dan menemui-Nya. Yakni membiarkan kamu dalam azab. Yakni azab yang tidak akan berhenti. Demikianlah azab Jahannam –semoga Allah melindungi kita darinya-, tidak ada kesempatan untuk beristirahat. Berupa kekafiran, pendustaan, kefasikan dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 14",
    "description": "Wahai manusia yang kafir, kamu layak mendapat kehinaan itu, maka rasakanlah olehmu azab ini disebabkan kamu telah mendustakan dan melalaikan pertemuan dengan harimu ini, yakni hari kiamat. Karena kamu melalaikan pertemuan ini dan tidak mempersipkan diri dengan iman dan amal saleh, sesungguhnya kami pun melalaikan kamu dan tidak memberi kamu naungan di hari yang tidak akan kamu temukan naungan selain dari-ku, dan rasakanlah azab yang kekal sebagai balasan atas apa yang telah kamu kerjakan di dunia. '15. Setelah menjelaskan sikap dan balasan bagi orang kafir, Allah beralih menjelaskan sifat dan balasan bagi orang mukmin. Hanyalah yang beriman dengan ayat-ayat kami, baik yang tersurat dalam Al-Qur'an maupun yang tersebar di alam raya, itulah orang-orang yang apabila menyimak ayat-ayat kami dan diperingatkan dengannya mereka langsung menyungkur sujud, tunduk, dan patuh kepada Allah dengan khusyuk, dan dalam sujud mereka bertasbih menyucikan Allah dari hal-hal yang tidak patut dengan keagungan-Nya serta memuji tuhannya atas nikmat-Nya, dan mereka tidak menyombongkan diri dari menghamba dan menaati-Nya sebagaimana orang-orang kafir."
  }
]