[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya yang membenarkan dan mengamalkan ayat-ayat al-Qur’an hanyalah orang-orang yang bila dinasehati dengan al-Qur’an dan dibacakan al-Qur’an kepada mereka, maka mereka bersujud kepada Tuhan mereka dengan khusyu’ dan tunduk. Mereka menyucikan Allah dalam sujud mereka dengan memujiNya, mereka tidak menyombongkan diri dari bersujud dan bertsabih kepada Allah, serta beribadah hanya kepada Allah semata tidak ada sekutu baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya orang yang percaya dengan ayat-ayat Kami yang diturunkan kepada Rasul Kami adalah orang-orang yang apabila diingatkan dengan ayat tersebut maka mereka bersujud kepada Allah dengan bertasbih memuji Rabbnya, mereka tidak sombong untuk menyembah Allah dan juga untuk sujud kepada-Nya dalam keadaan apapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Yang beriman kepada ayat-ayat al-Qur’an hanyalah orang-orang yang jika diperingatkan dengannya maka mereka akan menerimanya kemudian bersujud kepada Allah semata seraya bertasbih kepada-Nya untuk memuji-Nya, mereka tidak segan mentaati Allah. Tubuh mereka jauh dari tempat tidur untuk melakukan shalat tahajjud di waktu malam, mereka berdoa kepada Tuhan mereka karena takut dari azab-Nya dan mengharap pahala-Nya. Dan mereka menginfakkan rezeki yang telah Kami berikan di jalan kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِنَّمَا يُؤْمِنُ بِـَٔايٰتِنَا (Sesungguhnya orang yang benar-benar percaya kepada ayat-ayat Kami) Yakni yang percaya dan mendapat manfaat dari ayat-ayat itu. الَّذِينَ إِذَا ذُكِّرُوا۟ بِهَا خَرُّوا۟ سُجَّدًا(adalah mereka yang apabila diperingatkan dengan ayat-ayat itu mereka segera bersujud) Yakni mereka menjadi takut kepada Allah sehingga mereka berdiri untuk menjalankan sholat, yakni sholat lima waktu –pendapat lain mengatakan, sholat-sholat sunnah— untuk memuliakan ayat-ayat Allah dan karena ketakutan mereka dari azab-Nya. وَسَبَّحُوا۟ بِحَمْدِ رَبِّهِمْ(seraya bertasbih dan memuji Rabbnya) Yakni mereka menyucikan Allah dari segala yang tidak layak bagi-Nya serta memuji-Nya atas segala kenikmatan dan yang paling utama adalah nikmat petunjuk kepada keimanan. Makna ayat ini adalah mereka berucap dalam sujud mereka ‘subhanallah wa bihamdihi’ atau ‘subhanarabbi al-a’la wa bihamdihi’ وَهُمْ لَا يَسْتَكْبِرُونَ(dan lagi pula mereka tidaklah sombong) Mereka tunduk dan merendahkan diri di hadapan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Adapun orang-orang yang mengimani ayat-ayat Alquran yang Kami turunkan hanyalah orang-orang yang mau mengambil pelajaran darinya kemudian bersujud kepada Allah dengan khusyuk. Mereka mensucikan nama Allah dari segala yang tidak patut. Mereka memuji dan bersyukur kepada Allah atas segala nikmat yang Allah berikan dan nikmat paling agung adalah nikmat iman. Mereka tidak sombong atas ketaatan yang telah mereka lakukan, mereka merendahkan diri karena Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman dengan ayat-ayat Kami, hanyalah orang-orang yang apabila diperingatkan dengannya} diberi pelajaran dengan ayat-ayat itu {mereka tersungkur (dalam keadaan) sujud dan bertasbih serta memuji Tuhannya dan mereka tidak menyombongkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Ketika Allah menjelaskan (keadaan) orang-orang kafir terhadap ayat-ayatNya dan azab yang telah Dia siapkan untuk mereka, maka Dia menjelaskan tentang orang-orang yang beriman kepadanya, ciri mereka, dan pahala yang telah disediakan untuk mereka, searaya berfirman, “Sesungguhnya orang-orang yang beriman dengan ayat-ayat Kami,” yakni dengan iman yang hakiki, yaitu orang yang mempunyai tanda-tanda keimanan, dan mereka adalah “orang-orang yang apabila diperingatkan,” dengan ayat-ayat Rabb (Allah), lalu dibacakan kepada mereka ayat-ayat al-Quran, dan mereka dihadapkan kepada nasihat-nasihat para utusan Allah serta diajak untuk menghayatinya, maka mereka menyimaknya lalu menerimanya dan mereka tunduk, serta “mereka menyungkur sujud,” maksudnya, patuh kepadanya dengan tunduk mengingat Allah dan gembira karena bisa mengenalNya. “Dan bertasbih serta memuji Rabbnya, sedang mereka tidak menyombongkan diri,” tidak dengan hati mereka dan tidak pula dengan jasad mereka lalu enggan untuk terhadapnya, dan mereka menghadapinya dengan menerimanya, berserah diri dan meresponnya dengan lapang hati dan berserah diri. Mereka berupaya dengannya untuk meraih keridhaan Allah, Rabb yang Maha Penyayang, dan mereka menjadikannya sebagai pedoman menuju jalan yang lurus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 15: Allah mengabarkan bahwa mereka yang beriman dengan ayat Allah dengan iman secara hakiki dan membenarkannya secara pasti; Mereka adalah yang jika disebutkan ayat-ayat Tuhan mereka, mereka diam, khusyuk dan mengambil pelajaran. Mereka tersungkur untuk sujud kepada Allah sebagi manusia yang hina. Mereka memulai dengan sujud kepada Allah, memuji Allah, mensucikan Allah dari apa yang tidak pantas bagi kemulian dan keagungan-Nya. Mereka orang-orang yang beriman tidaklah sombong dari merendahkan diri dan menghinakan diri untuk sujud kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang orang-orang yang kafir kepada ayat-ayat-Nya dan azab yang telah Dia siapkan untuk mereka, maka Allah Subhaanahu wa Ta'aala menyebutkan tentang orang-orang yang beriman kepada ayat-ayat-Nya dan menyifati keadaan mereka, serta pahala yang Dia siapkan untuk mereka. Yang hakiki. Yakni dibacakan kepada mereka ayat-ayat Al Qur’an, disampaikan nasihat oleh para rasul Allah, diajak berpikir dan merenungi, mereka mau mendengarnya, sehingga mereka menerima dan mengikutinya. Maksudnya mereka sujud kepada Allah serta khusyuk dan tunduk merendahkan diri. Disunahkan mengerjakan sujud tilawah apabila membaca atau mendengar ayat-ayat sajdah yang seperti ini. Yakni mengucapkan “Subhaanallahi wa bihamdih.” Baik dengan hati maupun dengan badan. Oleh karena itu, mereka tawadhu’ kepadanya, menerimanya, dan menghadapinya dengan sikap lapang dada dan menerima, dan dengannya mereka dapat mencapai keridhaan Allah dan terbimbing ke jalan yang lurus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 15",
    "description": "Setelah menjelaskan sikap dan balasan bagi orang kafir, Allah beralih menjelaskan sifat dan balasan bagi orang mukmin. Hanyalah yang beriman dengan ayat-ayat kami, baik yang tersurat dalam Al-Qur'an maupun yang tersebar di alam raya, itulah orang-orang yang apabila menyimak ayat-ayat kami dan diperingatkan dengannya mereka langsung menyungkur sujud, tunduk, dan patuh kepada Allah dengan khusyuk, dan dalam sujud mereka bertasbih menyucikan Allah dari hal-hal yang tidak patut dengan keagungan-Nya serta memuji tuhannya atas nikmat-Nya, dan mereka tidak menyombongkan diri dari menghamba dan menaati-Nya sebagaimana orang-orang kafir. 16. Orang yang beriman itu terbiasa bangun pada malam hari untuk salat malam, membuat lambung mereka jauh dari tempat tidurnya. Usai salat malam mereka berdoa kepada tuhannya dengan penuh rasa takut terhadap azab Allah dan penuh harap atas rahmat-Nya, dan mereka senantiasa menginfakkan sebagian dari rezeki yang kami berikan kepada mereka, terutama kepada yang membutuhkan."
  }
]