[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "terangkatlah lambung orang-orang yang beriman kepada ayat-ayat Allah tersebut dari kasur tempat tidur mereka, mereka bertahajud kepada Tuhan mereka dalam shalat malam, berdoa kepada tuhan mereka dengan perasaan takut terhadap siksa dan berharap pahala, dan mereka berkenan berinfak dari sebagian harta yang Allah berikan kepada mereka, dalam ketaatan kepadaNya dan dijalanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Lambung-lambung mereka jauh dari tempat tidur yang biasa mereka gunakan untuk tidur, mereka meninggalkannya dan menghadap kepada Allah, berdoa kepada Allah dalam salat mereka maupun selain salat karena rasa takut terhadap siksa-Nya dan karena mangharap rahmat-Nya. Mereka menafkahkan harta yang telah Kami berikan kepada mereka di jalan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. تَتَجَافَىٰ جُنُوبُهُمْ عَنِ الْمَضَاجِعِ (Lambung mereka jauh dari tempat tidurnya) Terdapat pendapat mengatakan maknanya adalah mereka tidak tidur sebelum menjalankan shalat isya. Dan pendapat lain mengatakan maknanya adalah mereka orang-orang yang bangun dari tempat tidurnya pada malam hari untuk menjalankan shalat tahajjud. يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا(dan mereka selalu berdoa kepada Rabbnya dengan penuh rasa takut dan harap) Yakni mereka bermunajat kepada Tuhan mereka karena takut dari azab-Nya dan mengharap rahmat-Nya. وَمِمَّا رَزَقْنٰهُمْ يُنفِقُونَ(serta mereka menafkahkan apa apa rezeki yang Kami berikan) Yang dimaksud adalah sedekah wajib (zakat). Dan pendapat lain mengatakan yang dimaksud adalah sedekah sunnah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Mereka menjaukan dan meninggalkan perut mereka dari tempat tidur, mereka senantiasa bermunajat kepada Tuhan mereka dengan perasaan takut atas murka dan hukuman Allah, serta dengan mengarap-harap rahmat dan surga-Nya. Mereka membelanjakan sebagian rizki mereka pada yang diwajibkan kepada mereka, yaitu zakat. Jiwa mereka adalah jiwa dermawan alam bersedekah. Ayat ini turun untuk kumpulan sahabat yang menjalankan shalat dari waktu maghrib hingga isya. Muadz berkata itu adalah qiyamul lail pada permulaan malam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lambung mereka jauh} terangkat dan jauh {dari tempat tidur} tempat untuk berbaring {seraya berdoa kepada Tuhan mereka dengan rasa takut dan harapan, dan dari sebagian rezeki yang Kami anugerahkan, mereka menginfakkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Lambung mereka jauh dari tempat tidurnya,” maksudnya, punggung mereka jauh dan tidak betah dari tempat tidurnya yang empuk, beralih kepada sesuatu yang lebih lezat darinya dan lebih mereka cintai, yaitu shalat di keheningan malam dan bermunajat kepada Allah. Maka dari itu Dia berfirman, “Sedang mereka berdoa kepada Rabbnya,” maksudnya, dalam mencari kebaikan agama dan dunia mereka, dan dalam menolak segala sesuatu yang bisa membahayakan keduanya, “dengan rasa takut dan harap.” Maksudnya, dengan memadukan antara dua sifat (rasa); takut akan azab Allah dan sangat mengharapkan pahalaNya, “dan dari sebagian apa yang Kami berikan kepada mereka,” yaitu rizki yang sedikit atau banyak, “mereka menafkahkan.” Di sini tidak disebutkan batasan nafkahnya dan tidak pula orang yang dinafkahi agar menunjukkan kepada makna umum (luas). Jadi masuk di dalamnya nafkah wajib, seperti zakat, membayar kaffarat, nafkah untuk istri dan kerabat dekat, dan nafkah yang dianjurkan dalam jalan-jalan kebaikan. Nafkah dan ihsan dalam bentuk harta itu baik secara mutlak, sama saja apakah jatuh kepada orang fakir atau orang kaya, kepada kerabat dekat atau kerabat jauh. Akan tetapi pahalanya tentu berbeda-beda sesuai dengan perbedaan kegunaannya. Inilah perbuatan (amal) mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 16: Mereka orang-orang yang beriman, lambung-lambung (perut) mereka jauh dari pembaringan untuk tidur, istirahat dan menolak (untuk tidur) di kebanyakan waktu malam, karena sebab mereka sibuk dari shalat tahajjud, berdoa (bermunajat) kepada Allah Tuhan semesta alam, mereka menyeru kepada Allah dengan membawa dua sifat, yaitu harap dan takut, mereka menyeru kepada Allah sedangkan mereka dalam keadaan takut dari adzab-Nya, dari ditolak amalan-amalan mereka dan tidak diterima Allah, mereka juga berharap pahala di sisi Allah, berharap ridha dan dimasukkan ke dalam surge, mereka juga mendermakan harta mereka, dan meyakini akan bertambahnya harta mereka (setelah didermakan)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada Anas bin Malik, bahwa ayat ini, ”Lambung mereka jauh dari tempat tidurnya,” turun berkenaan dengan penantian mereka terhadap shalat yang biasa disebut ‘atamah (shalat Isya).” Tirmidzi berkata, “Hadits ini hasan shahih gharib, kami tidak mengetahui kecuali dari jalan ini.” Ibnu Jarir juga menyebutkannya di juz 12 hal. 100, Ibnu Katsir dalam tafsirnya berkata, “Sanadnya jayyid.” Maksudnya mereka tidak tidur di waktu biasanya orang tidur, untuk mengerjakan shalat Isya atau shalat malam (tahajjud) bermunajat kepada Allah, yang sesungguhnya lebih nikmat dan lebih dicintai mereka. Untuk meraih maslahat agama maupun dunia, dan terhindar dari bahaya. Mereka menggabung kedua sifat itu, mereka takut amal mereka tidak diterima, dan berharap sekali agar diterima, mereka takut kepada azab Allah dan berharap sekali pahala-Nya. Tidak disebukan batasan infak dan orang yang diberi infak untuk menunjukkan keumuman, oleh karenanya masuk ke dalamnya infak yang wajib seperti zakat, kaffarat, menafkahi istri dan kerabat dan berinfak pada jalur-jalur kebaikan. Berinfak dan berbuat ihsan dengan harta adalah baik secara mutlak, akan tetapi pahala tergantung niat dan manfaat yang dihasilkan. Inilah amal orang-orang yang beriman. Adapun balasannya adalah seperti yang disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 16",
    "description": "Orang yang beriman itu terbiasa bangun pada malam hari untuk salat malam, membuat lambung mereka jauh dari tempat tidurnya. Usai salat malam mereka berdoa kepada tuhannya dengan penuh rasa takut terhadap azab Allah dan penuh harap atas rahmat-Nya, dan mereka senantiasa menginfakkan sebagian dari rezeki yang kami berikan kepada mereka, terutama kepada yang membutuhkan. 17. Maka atas ibadah itu kelak di hari kiamat mereka berhak memperoleh surga yang tidak seorang pun mengetahui apa yang disembunyikan untuk mereka, yaitu bermacam nikmat yang menyenangkan hati, sebagai balasan terhadap apa yang mereka kerjakan di dunia berupa amal saleh."
  }
]