[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jiwa manusia tidak mengetahui apa yang disediakan oleh Allah untuk orang-orang beriman itu, yang menenangkan mereka dan melapangkan dada mereka, sebagai balasan atas amal perbuatan mereka yang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Tidak seorang pun yang mengetahui apa yang telah Allah siapkan bagi mereka hal yang menyejukkan pandangan mata, sebagai balasan dari-Nya bagi mereka atas amal saleh yang telah mereka lakukan di dunia, yaitu balasan yang tidak ada yang mengetahuinya kecuali Allah, karena agungnya balasan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Tidak ada seorang makhlukpun yang mengetahui kenikmatan yang akan Allah berikan kepada mereka yang berupa kenikmatan yang; itu adalah balasan atas amal-amal shalih yang telah mereka kerjakan. Abu Hurairah meriwayatkan dari Rasulullah, beliau bersabda, Allah berfirman: “Aku menyiapkan bagi hamba-hamba-Ku yang shalih apa yang tidak pernah dilihat mata, didengar telinga, dan terbesit oleh hati manusia.” Abu Hurairah melanjutkan: Jika kalian menghendaki maka bacalah firman Allah: “Tak seorangpun mengetahui berbagai nikmat yang menanti, yang indah dipandang” (as-Sajdah: 17). (Shahih al-Bukhari 8/375, kitab tafsir surat as-Sajdah, dalam bab ayat ini, no. 4779. Shahih Muslim 4/2174, no. 2824, kitab surga dan ciri kenikmatan dan penghuninya)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. فَلَا تَعْلَمُ نَفْسٌ مَّآ أُخْفِىَ لَهُم مِّن قُرَّةِ أَعْيُنٍ (Tak seorangpun mengetahui berbagai nikmat yang menanti, yang indah dipandang) Tidak ada seorangpun siapapun itu yang mengetahui apa yang disiapkan Allah bagi orang-orang tersebut berupa sesuatu yang akan membuat mereka puas dan ridha. Imam Bukhari dan Muslim mengeluarkan hadits dari Abu Hurairah, dari Rasulullah ia bersabda, Allah berfirman: “Aku telah siapkan bagi hamba-hamba-Ku yang shalih apa yang tidak pernah dilihat mata, tidak pernah didengar telinga, dan tidak pernah terbesit dalam hati manusia.” Kemudian Abu Hurairah berkata: “jika kalian mau, bacalah firman-Nya: فَلَا تَعْلَمُ نَفْسٌ مَّآ أُخْفِىَ لَهُم مِّن قُرَّةِ أَعْيُن"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Tidak akan ada seorang pun yang tahu tentang rahasia balasan dan pahala yang sedang menanti dan akan indah dipandang oleh mata mereka. Mereka akan dibalas sesuai dengan amal perbuatan saleh mereka ketika di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada seorang pun yang mengetahui apa yang disembunyikan} apa yang dijanjikan {untuk mereka berupa sesuatu yang menyenangkan hati} sesuatu yang menyejukkan mata {sebagai balasan terhadap apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Adapun balasan untuk mereka, Allah berfirman, “Tidak satu jiwa pun mengetahui,” termasuk di dalamnya seluruh jiwa manusia, karena bentuk kata (nafs) di sini “nakirah” dalam kontek negative (nafi). Maksudnya, maka tidak seorang pun yang tahu “apa yang disembunyikan untuk mereka yaitu yang menyedapkan pandangan mata,” berupa kebaikan yang berlimpah, kenikmatan yang tercurah, kenahagiaan, kesenangan, kelezatan dan kesukaan. Sebagaimana firman Allah melalui lisan rosulululloh : \"aku telah menyiapkan untuk hambaku yang sholeh sesuatu yang tidak bisa dilihat mata, di dengar telinga, dan tidak bisa dibayangkan oleh hati manusia\". Sebagaimana mereka shalat di keheningan malam dalam berdoa, dan mereka menyembunyikan amal, maka Allah membalas mereka dengann balasan dari jenis amal mereka, dan Dia menyembunyikan pula pahala untuk mereka. Maka dari itu Dia berfirman, “sebagai balasan terhadap amal yang telah mereka kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 17: Allah mengabarkan bahwasanya satupun tidak ada yang mengetahui apa yang Allah akan siapkan bagi mereka yang beriman dari pahala yang besar, kenikmatan yang terus menerus, Allah balas bagi mereka karena sebab amalan-amalan mereka yang shalih di dunia, telah datang pada hadits qudsi : Aku siapkan bagi hamba-Ku yang shalih apa yang mereka tidak pernah lihat dengan mata, tidak juga mendengar dengan telinga, dan tidak juga terbesit di dalam hati manusia. Ya Allah jadikan kami sebagai hamba-Mu yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa kebaikan yang banyak, kenikmatan yang sempurna, kegembiraan, kelezatan sebagaimana firman Allah Subhaanahu wa Ta'aala dalam hadits Qudsi: أَعْدَدْتُ لِعِبَادِى الصَّالِحِينَ مَا لاَ عَيْنٌ رَأَتْ ، وَلاَ أُذُنٌ سَمِعَتْ ، وَلاَ خَطَرَ عَلَى قَلْبِ بَشَرٍ “Aku siapkan untuk hamba-hamba-Ku yang saleh sesuatu yang tidak pernah terlihat oleh mata, terdengar oleh telinga dan terlintas di hati manusia.” (HR. Bukhari dan Muslim) Sebagaimana mereka shalat di malam hari dan berdoa, serta menyembunyikan amal, maka Allah membalas mereka dengan pahala besar yang disembunyikan sebagai balasan terhadap amal yang mereka kerjakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 17",
    "description": "Maka atas ibadah itu kelak di hari kiamat mereka berhak memperoleh surga yang tidak seorang pun mengetahui apa yang disembunyikan untuk mereka, yaitu bermacam nikmat yang menyenangkan hati, sebagai balasan terhadap apa yang mereka kerjakan di dunia berupa amal saleh. 18. Jika orang kafir dijerumuskan ke jahanam dan orang yang beriman berbahagia dalam surga, maka apakah keadaan orang yang beriman itu di akhirat kelak sama halnya seperti orang yang fasik dan kafir' tentu mereka tidak sama."
  }
]