[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang taat kepada Allah dan RasulNya, membenarkan janji dan ancamanNYa seperti orang yang kafir kepada Allah dan utusan-utusanNya dan mendustakan Hari Kiamat? Mereka tidak sama di sisi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Barangsiapa beriman kepada Allah, melaksanakan segala perintah-perintah-Nya, meninggalkan larangan-larangan-Nya, tidak seperti orang-orang yang keluar dari ketaatan terhadap-Nya dua balasan kelompok ini tidak sama di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Apakah orang yang beriman dan mentaati Allah ketika di dunia seperti orang yang berpaling dari ketaatan-Nya? Tentu mereka tidak sama dalam hal pahala dan siksaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. أَفَمَن كَانَ مُؤْمِنًا كَمَن كَانَ فَاسِقًا ۚ (Apakah orang-orang beriman itu sama dengan orang-orang yang fasik?) Yakni orang beriman tidaklah sama dengan orang fasik, sangat jelas perbedaan di antara mereka berdua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Apakah orang yang beriman kepada Allah dan rasul-Nya itu sama seperti orang yang keluar dari keimanan dan ketaatan? Tidak, mereka tidak sama di sisi Allah pada hari kiamat. Maksudnya bahwa orang yang beriman tidak sama dengan orang fasik, keduanya adalah hal yang saling bertolak belakang. Diriwayatkan dari Walid bin Uqbah yang membanggakan diri ketika perang Badr, maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang mukmin sama dengan orang fasik} yang tidak taat kepada Allah {Mereka tidak sama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Allah mengingatkan kepada akal atas sesuatu yang telah dipastikannya, yaitu tidak ada kesamaan (antara) dua orang yang berbeda lagi bertentangan, dan bahwa sesungguhnya kebijaksanaanNya mengharuskan ketidaksamaan keduanya, seraya berfirman, “Maka apakah orang yang beriman,” yang telah menghidupkan hatinya dengan iman, dan seluruh anggota tubuhnya tunduk kepada syariat-syariatNya dan imannya menuntut jejak-jejaknya dan faktor yang mewajibkannya, yaitu meninggalkan segala hal yang dimurkai Allah, yang eksistensinya membahayakan imannya, “sama seperti orang yang fasik,” yang hatinya rusak dan kosong dari iman, tidak ada kecenderungan agama di dalamnya, sehingga seluruh anggota tubuhnya mudah mewajibkan kebodohan dan kezhaliman pada setiap dosa dan maksiat, dank arena kefasikannyaia keluar dari ketaatan kepada Rabbnya. Apakah sama dua sosok manusia ini? “Mereka tidak sama,” menurut akal maupun menurut agama, seperti tidak samanya malam dan siang, cahaya dengan kegelapan, demikian pula tidak sama balasan untuk keduanya di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 18: Allah mengabarkan akan keadilan dan kemulian-Nya yang bahwasanya tidaklah sama dalam hukuman Allah di hari kiamat barangsiapa yang beriman kepada Allah dengan jujur kepada utusan Allah ﷺ dan beramal shalih, dan barangsiapa yang keluar dari ketaatan kepada Allah dan mendustakan Rasulullah ﷺ akan hari kebangkitan serta hari akhir dan apa yang padanya terdapat hisab ?! Apakah sama yang beriman dan yang kafir ?! Jawabannya tentu mereka tidaklah sama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan kepada akal apa yang terpendam di dalamnya, yaitu berbedanya orang mukmin dengan orang kafir. Yang mengisi hatinya dengan keimanan, anggota badannya tunduk kepada syariatnya, imannya menghendaki adanya pengaruh dan konsekwensi, yaitu meninggalkan kemurkaan Allah yang keberadaannya merugikan keimanan. Yang mengosongkan hatinya dari keimanan, di dalamnya tidak terdapat pendorong dari sisi agama, sehingga anggota badannya segera mengerjakan kebodohan dan kezaliman, seperti dosa dan maksiat, dan keluar dengan kefasikannya dari ketaatan kepada Allah Subhaanahu wa Ta'aala. Apakah orang ini sama dengan orang mukmin? Baik secara akal maupun syara’, sebagaimana tidak sama antara malam dengan siang, cahaya dengan kegelapan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 18",
    "description": "Jika orang kafir dijerumuskan ke jahanam dan orang yang beriman berbahagia dalam surga, maka apakah keadaan orang yang beriman itu di akhirat kelak sama halnya seperti orang yang fasik dan kafir' tentu mereka tidak sama. 19. Adapun orang-orang yang beriman dan mengerjakan kebajikan, maka sebagai balasannya mereka akan mendapat surga-surga tempat kediaman. Di sana mereka menetap dan bersenang-senang selamanya sebagai pahala atas apa yang telah mereka kerjakan."
  }
]