[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun orang-orang yang beriman dan melaksanakan apa yang diperintahkan kepada mereka, balasan mereka adalah surga-surga sebagai tempat tinggal mereka, mereka menempatinya dengan penuh kenikmatan sebagai bentuk perjamuan bagi mereka, sebagai balasan bagi mereka atas ketaatan yang mereka berikan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Adapun orang-orang yang beriman kepada Allah dan melakukan amal saleh maka balasan yang disediakan bagi mereka adalah Surga-surga, mereka berdiam di dalamnya sebagai bentuk penghormatan dari Allah kepada mereka, sebagai balasan atas amal saleh yang telah mereka kerjakan ketika di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Adapun orang-orang yang beriman kepada Allah dan beramal shalih, maka balasan bagi mereka adalah surga yang tinggi yang terletak di Sidratul Muntaha, surga itu memiliki buah dan daun yang lebat, mereka tinggal di dalamnya sebagai karunia yang kekal atas amal kebaikan yang telah mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. أَمَّا الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ فَلَهُمْ جَنّٰتُ الْمَأْوَى (Adapun orang-orang yang beriman dan mengerjakan amal saleh, maka bagi mereka jannah tempat kediaman) Makna (المأوى) yakni tempat yang mereka tinggali. Dan surga merupakan tempat tinggal yang sesungguhnya. نُزُلًۢا(sebagai pahala) Yakni hidangan yang telah disiapkan bagi mereka saat mereka memasukinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Adapun orang-orang yang beriman kepada Allah dan rasul-Nya, serta beramal saleh sesuai apa yang diperintahkan. Mereka mendapatkan balasan surga sebagai tempat tinggal, mereka tinggal di dalamnya agar mereka terjaga dari apa yang mereka tidak senangi. Tempat tinggal tersebut adalah tempat hakiki sebab sifat kekalnya. Sebagai sajian dan kehormatan, seperti penghormatan terhadap tamu yang mulia sebab amal kebaikan dan ketaatan yang telah mereka kerjakan di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang beriman dan beramal shalih, bagi mereka itu surga-surga (untuk) tempat tinggal sebagai pahala} penjamuan dan penghormatan {atas apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Adapun orang-orang yang beriman dan mengerjakan amal-amal shalih,” yang fardhu dan yang sunnah, “maka bagi mereka surge-surga yang merupakan tempat segala kelezatan, dan tempat tinggal segala kebaikan, tempat segala kegembiraan, kenikmatan hati, jiwa dan ruh, tempat keabadian, tempat bertetangga dengan Maharaja Yang Berhak disembah, dan kenikmatan dekat dariNya, melihat wajahNya dan mendengarkan sapaanNya, “sebagai pahala” untuk mereka. Maksudnya, sebagai jamuan dan hidangan tamu, “terhadap amal yang telah mereka kerjakan.” Amal perbuatan mereka (yang telah Allah karuniakan kepada mereka) itulah yang telah mengantar mereka kepada derajat-derajat yang sangat berharga dan tinggi itu, yang tidak mungkin dicapai dengan mengorbankan harta, maupun dengan bala tentara, para pembantu dan tidak pula dengan anak-anak, dan bahkan tidak pula dengan jiwa dan ruh, serta tidak pula bisa mendekat kepadanya dengan sesuatu apa pun selain dengan iman dan amal shalih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 19: Allah menjelaskan bahwasanya mereka yang beriman kepada Allah dan mengikuti Rasul ﷺ dan beramal dengan amalan yang shalih maka mereka akan masuk ke dalam surge, mereka bersiap untuknya, dan ditempatkan di dalamnya. Allah telah siapkan dan sediakan bagi mereka balasan atas amalan shalih yang telah mereka kerjakan, karena mereka ketika di dunia mengejar keridhaan Allah dengan mendekatkan diri kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang wajib maupun yang sunat. Yakni surga-surga yang merupakan tempat kelezatan, ladang kebaikan, tempat kesenangan, menyenangkan hati, jiwa maupun ruh, tempat yang kekal, berada di dekat Tuhan Yang Maha Penguasa, bersenang-senang karena dekat dengan-Nya, karena melihat wajah-Nya dan mendengarkan ucapan-Nya. Amal yang Allah karuniakan kepada mereka, itulah yang membuat mereka sampai ke tempat-tempat yang tinggi dan indah itu, yang tidak mungkin diraih dengan pengorbanan harta, pembantu dan anak, bahkan tidak juga dengan jiwa dan ruh, selain dengan iman dan amal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 19",
    "description": "Adapun orang-orang yang beriman dan mengerjakan kebajikan, maka sebagai balasannya mereka akan mendapat surga-surga tempat kediaman. Di sana mereka menetap dan bersenang-senang selamanya sebagai pahala atas apa yang telah mereka kerjakan. 20. Dan adapun orang-orang yang fasik, kafir, dan melenceng dari ketaatan kepada Allah, maka tempat kediaman mereka adalah neraka. Di sana mereka merasakan siksaan setiap saat, sehingga setiap kali mereka hendak keluar darinya, mereka dikembalikan lagi ke dalamnya dan dikatakan kepada mereka dengan nada hinaan dan ejekan, 'rasakanlah azab neraka yang di dunia dahulu kamu dustakan. ' inilah balasan setimpal bagi orang zalim dan fasik."
  }
]