[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Qur’an yang dibawa oleh Muhammad ini, tidak ada keraguan bahwa ia diturunkan dari sisi Allah, Tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Al-Qur`ān yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam- ini diturunkan kepadanya dari Rabb semesta ,alam tidak ada keraguan di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Al-Qur’an al-Adzim ini turun dengan beransur-ansur dari Tuhan seluruh makhluk dengan sebenar-benarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. لَا رَيْبَ فِيهِ (tidak ada keraguan di dalamnya) Yakni tidak diragukan bahwa al-Qur’an diturunkan oleh Tuhan semesta alam, dan ia bukanlah kedustaan, sihir, perdukunan, atau dongeng-dongeng orang terdahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Tidak ada keraguan dalam penurunan Al-quran, Al-quran diturunkan dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Turunnya kitab yang tidak ada keraguan di dalamnya} tidak ada keraguan di dalamnya {berasal dari Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah mengabarkan bahwa sesungguhnya kitab suci al-Quran ini adalah diturunkan dari Rabb semesta alam, yang telah mengatur (dan membimbing) mereka dengan nikmat-nikmatNya. Dan di antara nikmat yang terbesar yang dengannya Dia membimbing mereka adalah kitab suci al-Quran ini, yang di dalamnya terdapat segala yang dapat memperbaiki keadaan (dan kondisi) mereka dan menyempurnakan akhlak mereka, dan bahwa sesungguhnya tiada keraguan sedikit pun di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 2: Allah mengabarkan bahwa Al Qur’an yang datang kepada Muhammad ﷺ ini tidak ada keraguan dan kerancuan di dalamnya, ia turun dari sisi Allah, Tuhan seluruh alam, tidak sebagaimana yang dikatakan orang-orang musyrik bahwa Al Qur’an adalah sihir, dukun atau cerita orang-orang terdahulu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa kitab yang mulia ini turun dari-Nya Tuhan seluruh alam, yang mengurus mereka dengan nikmat-nikmat-Nya, dan di antara pengurusan-Nya kepada mereka adalah dengan menurunkan kitab Al Qur’an ini, di mana di dalamnya terdapat sesuatu yang memperbaiki keadaan mereka, menyempurnakan akhlak mereka, dan bahwa tidak ada keraguan di dalamnya. Meskipun begitu, orang-orang yang mendustakan Rasul lagi berlaku zalim malah berkata, bahwa Muhammad shallallahu 'alaihi wa sallam mengada-ada dari dirinya sendiri. Ini merupakan keberanian yang besar dalam mengingkari firman Allah, dan menuduh Beliau dengan tuduhan yang paling dusta. Oleh karena itu, pernyataan mereka dibantah oleh Allah sebagaimana pada ayat ketiga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 2",
    "description": "1-2. Alif l'm m'm. Hanya Allah yang mengetahui hakikat maknanya. Allah-lah yang menurunkan Al-Qur'an, suatu mukjizat yang tidak dapat ditandingi. Turunnya Al-Qur'an itu tidak ada keraguan padanya, yaitu dari tuhan yang menguasai, mengatur, dan merawat seluruh alam. Al-qur'an bukan ciptaan manusia, tidak terkecuali nabi Muhammad. Al-qur'an juga bukan syair, apalagi sihir. 3. Terbukti dengan nyata bahwa Al-Qur'an bukanlah ciptaan manusia, tetapi mengapa mereka, orang kafir, tanpa bukti-bukti yang kuat mengatakan, 'dia, Muhammad, telah mengada-adakannya. Lupa-kah mereka bahwa secara logis maupun realitas sejarah mustahil rasulullah mengarang Al-Qur'an' karena itu Allah menjawab, 'tidak, Al-Qur'an itu kebenaran yang datang dari tuhanmu, agar engkau, wahai nabi Muhammad, memberi peringatan kepada kaum yang belum pernah didatangi orang yang memberi peringatan sebelum engkau bahwa azab Allah akan menimpa siapa saja yang kafir dan mendurhakai-Nya; dan agar melalui Al-Qur'an pula mereka mendapat petunjuk."
  }
]