[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun orang-orang yang keluar dari ketaatan kepada Allah dan menjalankan kemaksiatan kepadaNya, tempat tinggal mereka adalah Jahanam, setiap kali mereka ingin keluar darinya, mereka langsung dikembalikan ke dalamnya. Dikatakan kepada mereka sebagai penghinaan dan perendahan, “Rasakanlah siksa neraka yang dulu kalian dustakan di dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Adapun orang-orang yang keluar dari ketaatan terhadap Allah dengan melakukan kekufuran dan kemaksiatan, maka tempat tinggal mereka yang telah disiapkan bagi mereka pada Hari Kiamat adalah Neraka, mereka menetap di dalamnya selama-lamanya, setiap kali mereka menginginkan untuk keluar darinya, mereka dikembalikan ke dalamnya, dan dikatakan kepada mereka sebagai bentuk celaan, “Rasakanlah siksa Neraka yang dulu kalian dustakan di dunia ketika Rasul kalian menakuti kalian dengannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Adapun orang-orang yang menentang perintah Allah maka tempat kesudahan mereka adalah neraka Jahannam. Setiap kali mereka berusaha melarikan diri darinya maka mereka akan diseret kembali kepadanya. Dan akan dikatakan kepada mereka sebagai hinaan dan olokan: “Rasakahlah azab neraka yang dahulu kalian dustakan dan kalian hina.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَأَمَّا الَّذِينَ فَسَقُوا۟ (Dan adapun orang-orang yang fasik) Yakni berbuat fasik terhadap ketaatan kepada Allah serta durhaka kepada-Nya dan kepada rasul-rasul-Nya. فَمَأْوَىٰهُمُ النَّارُ ۖ( maka tempat mereka adalah jahannam) Yakni tempat tinggal yang akan mereka tinggali adalah neraka. وَقِيلَ لَهُمْ ذُوقُوا۟ عَذَابَ النَّارِ الَّذِى كُنتُم بِهِۦ تُكَذِّبُونَ (dan dikatakan kepada mereka: “Rasakanlah siksa neraka yang dahulu kamu mendustakannya”) Yang mengatakan ini kepada mereka adalah para malaikat penjaga neraka, atau Allah ta’ala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Adapun orang-orang yang mendustkan Allah dan rasul-Nya, maka tempat tinggal mereka adalah neraka. Mereka akan dihina dan direndahkan dengan perkataan: “Rasakanlah azab neraka yang dulu kalian dustakan di dunia.” Neraka dinamakan tempat penghinaan terhadap mereka, sebagaimana orang kafir itu digambarkan dalam neraka oleh Dzat yang Maha Perkasa lagi Maha Mulia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang fasik} yang tidak taat kepada Allah {maka tempat kediaman mereka adalah neraka. Setiap kali mereka hendak keluar dari sana, mereka dikembalikan ke dalamnya dan dikatakan kepada mereka,“Rasakanlah azab neraka yang dahulu selalu kalian dustakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Dan adapun orang-orang yang fasik, maka tempat mereka adalah neraka,” maksudnya, tempat tinggal mereka dan tempat keabadian mereka adalah neraka, yang mencakup segala bentuk azab dan kesengsaraan, bahkan siksaan tidak dihentikan di dalamnya sesaat pun, “setiap kali mereka hendak keluar darinya, mereka dikembalikan lagi ke dalamnya.” Setiap kali kehendak mereka berbisik kepada mereka untuk keluar karena azab yang menimpa telah benar-benar mencapai puncaknya, maka mereka dikembalikan lagi kepadanya. Maka hilanglah dari mereka ruh keselamatan itu dan makin dahsyatlah kesengsaraan menima mereka, “dan dikatakan kepada mereka, ‘Rasakanlah siksa neraka yang dahulu kamu mendustkannya’.” Demikianlah siksa neraka yang menjadi temat tinggal dan kediaman mereka. Sedangkan azab yang terjadi sebelum itu dan sebagai pengantar (muqaddimahnya) adalah azab di alam barzakh. Azab ini disebutkan dalam FirmanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 20: Allah menjelaskan mereka yang keluar dari ketaatan kepada Allah, berpaling dari perintah-perintah-Nya dan sombong atas perintah Allah, maka tempat tinggal mereka adalah di neraka jahannam, ketika mereka mencoba keluar darinya, para malaikat adzab akan menyeret mereka kembali. Dikatakan kepada mereka dengan buruk : Rasakann adzab nerka di mana kalian di dunia mendustakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dalamnya terdapat kesengsaraan dan siksa, dan tidak akan diringankan meskipun sesaat siksa yang menimpa mereka. Karena azabnya yang begitu dahsyat. Inilah azab yang lebih besar yang akan mereka hadapi setelah sebelumnya menerima azab yang dekat (di dunia), seperti dibunuh, ditawan, dan sebagainya, dan ketika mati, di mana para malaikat mencabut nyawa mereka dengan keras, serta disempurnakan azab yang dekat ini di alam barzakh, nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 20",
    "description": "Dan adapun orang-orang yang fasik, kafir, dan melenceng dari ketaatan kepada Allah, maka tempat kediaman mereka adalah neraka. Di sana mereka merasakan siksaan setiap saat, sehingga setiap kali mereka hendak keluar darinya, mereka dikembalikan lagi ke dalamnya dan dikatakan kepada mereka dengan nada hinaan dan ejekan, 'rasakanlah azab neraka yang di dunia dahulu kamu dustakan. ' inilah balasan setimpal bagi orang zalim dan fasik. 21. Sebelum mendapat azab di akhirat, orang-orang kafir itu sebenarnya sudah tertimpa azab di dunia. Dan pasti kami timpakan kepada mereka sebagian siksa yang dekat, yakni di dunia, berupa bermacam musibah sebelum azab yang lebih besar di akhirat nanti. Itu semua Allah timpakan agar mereka kembali ke jalan yang benar. Inilah bentuk kasih sayang Allah kepada manusia, bahkan yang durhaka. Allah sudah memberi peringatan tetapi mereka tidak menyadari."
  }
]