[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami pastikan akan menimpakan kepada orang-orang fasik yang mendustakan itu siksa-siksa dunia berupa ujian, cobaan dan musibah sebelum siksa besar di Hari Kiamat nanti, di mana di sana mereka akan disiksa di Neraka Jahanam, dengan harapan mereka akan kembali dan bertaubat dari dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan sungguh kami akan merasakan kepada orang-orang yang mendustakan dan keluar dari ketaatan terhadap Rabb mereka sebagian dari cobaan dan musibah di dunia sebelum mereka merasakan siksa besar yang telah disiapkan bagi mereka di Akhirat apabila mereka tidak bertobat, mudah-mudahan dengan cobaan-cobaan itu mereka bertobat kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Sungguh Kami akan menimpakan azab yang dekat di dunia kepada mereka berupa berbagai musibah, sebelum Kami menimpakan azab yang besar di hari kiamat, agar mereka berhenti dari kekafiran dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَلَنُذِيقَنَّهُم مِّنَ الْعَذَابِ الْأَدْنَىٰ (Dan Sesungguhnya Kami merasakan kepada mereka sebahagian azab yang dekat (di dunia)) Azab dunia berupa musibah-musibah dan wabah penyakit yang ada di dunia. Pendapat lain mengatakan yang dimaksud dengan azab dunia di sini adalah terbunuhnya mereka dengan pedang pada perang Badar. دُونَ الْعَذَابِ الْأَكْبَرِ(sebelum azab yang lebih besar (di akhirat)) Yakni sebelum azab di akhirat. لَعَلَّهُمْ يَرْجِعُونَ(mudah-mudahan mereka kembali (ke jalan yang benar)) Yakni agar mereka kembali dan bertaubat dari kesyirikan dan kemaksiatan yang mereka lakukan berkat azab yang menimpa mereka, menuju keimanan dan ketaatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dan kami benar-benar menurunkan adzab kepada mereka, minimal adzab berupa: siksaan di dunia berupa kegelisahan, ketakutan, kehinaan, bala’, sakit, bencana dan lain sebagainya. Sebelum adzab di akhirat, agar mereka kembali pada jalan ketaatan dan keimanan, dan bertaubat dari syirik dan maksiat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar akan menimpakan kepada mereka sebagian azab yang dekat} azab dunia, seperti kelaparan, penawanan, dan kematian {selain azab yang lebih besar} sebelum azab akhirat {agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Maksudnya, dan sungguh Kami akan merasakan kepada orang-orang fasik yang mendustakan itu satu contoh dari azab yag ringan, yaitu azab di alam barzakh. Kami akan membuat mereka merasakan sebagian darinya sebelum mereka mati, baik dalam bentuk azab berupa pembunuhan dan yang serua dengannya, sebagaimana terjadi kepada kaum musyrikin dalam perang Badar, ataupun di saat mereka mati, seperti yang disebutkan dalam FirmanNya, \"Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zalim (berada) dalam tekanan-tekanan sakratulmaut, sedang para malaikat memukul dengan tangannya, (sambil berkata): \"Keluarkanlah nyawamu\". Di hari ini kamu dibalas dengan siksaan yang sangat menghinakan, karena kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayat-Nya.\" (Al-Anam: 93). Lalu azab yang ringan itu disempurnakan bagi mereka di alam barzakh. Ayat ini termasuk dalil yang menetapkan adanya siksa kubur, dan penunjukannya sangat jelas, karena Allah berfirman, “Dan sungguh Kami merasakan kepada mereka sebagian azab yang ringan.” Maksudnya, sebagian darinya. Hal ini menunjukkan bahwa di sana ada azab yang ringan sebelum azab yang lebih besar, yaitu azab neraka. Oleh karena penimpaan azab yang ringan di dunia kadangkadang tidak berhubungan dengan kematian, maka Allah mengabarkan bahwasanya Dia akan merasakannya kepada mereka, barangkali dengannya mereka mau kembali kepadaNya dan bertaubat dari dosa-dosa mereka, sebagaimana Allah berfirman, \"Telah nampak kerusakan di darat dan di laut disebabkan karena perbuatan tangan manusia, supaya Allah merasakan kepada mereka sebahagian dari (akibat) perbuatan mereka, agar mereka kembali (ke jalan yang benar).\" (Ar-Rum:41)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 21: Allah mengabarkan bahwa mereka orang-orang fasik yang keluar dari ketaatan kepada Allah, akan merasakan dari adzab di dunia dengan ditimpakan musibah-musibah dan ujian sebelum adzab akhirat; Agar mereka kembali dari kekufuran menuju keimanan, dari kefasikan dan penentangan menuju ketaatan dan ketundukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti dibunuh atau ditawan, kemarau panjang atau penyakit, saat dicabut nyawa dan ketika di alam barzakh. Ayat ini di antara dalil adanya azab kubur Yang masih hidup di antara mereka. Dengan beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 21",
    "description": "Sebelum mendapat azab di akhirat, orang-orang kafir itu sebenarnya sudah tertimpa azab di dunia. Dan pasti kami timpakan kepada mereka sebagian siksa yang dekat, yakni di dunia, berupa bermacam musibah sebelum azab yang lebih besar di akhirat nanti. Itu semua Allah timpakan agar mereka kembali ke jalan yang benar. Inilah bentuk kasih sayang Allah kepada manusia, bahkan yang durhaka. Allah sudah memberi peringatan tetapi mereka tidak menyadari. 22. Orang-orang kafir itu tidak mampu mengambil pelajaran dari musibah yang menimpa akibat kezaliman telah menutup hati mereka. Pada ayat ini Allah menjelaskan penyebab mereka layak disiksa. Dan siapakah yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat tuhannya, kemudian dia berpaling darinya dan bahkan mendustakannya' tidak ada. Sungguh, telah menjadi ketetapan bahwa kami akan memberikan balasan setimpal kepada orang-orang yang berdosa sesuai kadar dosanya."
  }
]