[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada yang lebih besar kezhalimannya kepada dirinya sendiri daripada orang yang dinasehati dengan dalil-dalil dari Allah, kemudian dia berpaling darinya, dia tidak mengindahkan nasihat-nasihatNya, sebaliknya Dia justru menyombongkan diri. Sesungguhnya Kami akan membalas orang-orang yang berpaling dari ayat-ayat Allah, mengingkarinya dan mereka tidak mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Tidak ada seorang pun yang lebih zalim daripada orang yang dinasihati dengan ayat-ayat Allah namun ia tidak menerima nasihat itu dan berpaling darinya serta tidak mempedulikannya. Sesungguhnya Kami tidak disangsikan akan membalas orang-orang yang berdosa dengan melakukan kekufuran dan kemaksiatan, yang berpaling dari ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Tidak ada orang yang lebih menzalimi diri sendiri daripada orang yang diperingatkan dengan ayat-ayat qur’aniyah dan kauniyah namun dia tidak beriman. Sungguh Kami akan membalas orang-orang yang mengingkari ayat-ayat itu dengan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِـَٔايٰتِ رَبِّهِۦ ثُمَّ أَعْرَضَ عَنْهَآ ۚ (Dan siapakah yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, kemudian ia berpaling daripadanya?) Yakni tidak ada yang lebih zalim darinya, sebab ia telah mendengar ayat-ayat Allah yang mengharuskan mereka untuk menyambut keimanan dan ketaatan, namun mereka malah berpaling darinya. إِنَّا مِنَ الْمُجْرِمِينَ مُنتَقِمُونَ(Sesungguhnya Kami akan memberikan pembalasan kepada orang-orang yang berdosa) Dan termasuk diantaranya adalah orang yang berpaling dari ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Tidak ada seorangpun yang lebih mendzalimi dirinya daripada orang yang diberikan nasehat baik dengan ayat-ayat al-Qur’an dan ayat-ayat kauniyah, lantas ia berpaling darinya, kemudian ia tidak berfikira dan tidak memperoleh nasehat baik darinya, sesungguhnya orang-orang musyrik disiksa dengan adzab yang kekal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah yang lebih zalim daripada orang yang telah diperingatkan} diperingatkan {dengan ayat-ayat Tuhannya, kemudian dia berpaling darinya. Sesungguhnya Kami akan memberikan balasan kepada para pendosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Maksudnya, tidak seorang pun yang lebih zhalim dan lebih melampaui batas daripada orang yang telah diperingatkan dengan ayat-ayat Rabbnya, yang disampaikan kepadanya oleh Rabbnya, yang hendak membimbingnya dan menyempurnakan nikmatNya kepadanya melalui para RasulNya. mereka memerintahnya dan mengingatkannya akan kemaslahatan-kemaslahatan agama dan dunianya, dan mencegahnya dari segala sesuatu yang bisa membahayakan agama dan dunianya, yang semestinya harus disambutnya dengan iman dan sikap pasrah, tunduk dan bersyukur. Namun, si zhalim ini meresponnya dengan kebalikan yang sepantasnya. Ia tidak beriman kepadanya dan tidak pula mengikutinya, bahkan dia berpaling darinya dan meninggalkannya di belakang punggungnya. Ini merupakan bagian dari orang yang paling berdosa yang berhak menerima dahsyatnya pembalasan. Maka dari itu, Allah berfirman, “Sesungguhnya Kami akan memberikan pembalasan kepada orang-orang yang berdosa.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 22: Ketahuilah wahai manusia, tidak seorangpun lebih kuat dan besar kejahatannya dan kedzalimannya, bagi siapa yang mendengar wejangan dan nasihat dari ayat-ayat Allah, maka dia (pura-pura) tuli telinganya kemudian berpaling dari ayat-ayat tersebut dengan penolakan dan kufur padanya. Karena sebab ayat Allah, keseluruhannya adalah ayat-ayat yang memiliki hikmah dan petunjuk, padanya terdapat kebahagiaan di dunia dan di akhirat. Allah akan menghukum kepada ahli maksiat dan yang menolak ayat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang lebih zalim daripada orang yang telah diperingatkan dengan ayat Tuhannya, yang telah disampaikan kepadanya oleh Tuhannya, padahal Tuhannya ingin mendidiknya, menyempurnakan nikmat-Nya kepadanya melalui tangan rasul-Nya. Ayat-ayat-Nya memerintahkan dan mengingatkannya terhadap hal yang bermaslahat baginya baik bagi agamanya maupun dunianya, melarangnya terhadap hal yang merugikan agama dan dunianya yang seharusnya disikapi dengan beriman dan menerima, tunduk dan bersyukur, namun orang ini malah membalasnya dengan sikap yang sebaliknya, ia tidak beriman dan tidak mengikutinya, bahkan berpaling dan membelakangi. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Sungguh, Kami akan memberikan balasan kepada orang-orang yang berdosa.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 22",
    "description": "Orang-orang kafir itu tidak mampu mengambil pelajaran dari musibah yang menimpa akibat kezaliman telah menutup hati mereka. Pada ayat ini Allah menjelaskan penyebab mereka layak disiksa. Dan siapakah yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat tuhannya, kemudian dia berpaling darinya dan bahkan mendustakannya' tidak ada. Sungguh, telah menjadi ketetapan bahwa kami akan memberikan balasan setimpal kepada orang-orang yang berdosa sesuai kadar dosanya. 23. Untuk menguatkan jiwa rasulullah dalam mengajarkan Al-Qur'an dan menghadapi pengingkaran kaumnya, Allah berfirman bahwa sungguh, telah kami sampaikan kepada bani israil bahwa kami telah meng-anugerahkan kitab taurat kepada musa, maka janganlah engkau, wahai nabi Muhammad, ragu-ragu menerimanya, yakni Al-Qur'an; dan kami jadikan kitab taurat itu petunjuk bagi bani israil sebagaimana kami jadikan Al-Qur'an sebagai petunjuk bagi umatmu."
  }
]