[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami tidak memberikan Taurat kepada Musa, sebagaimana Kami memberimu al-Qur’an (wahai Rasul). Jangan meragukan perjumpaan dengan Musa di malam Isra’ dan MI’raj. Kami menjadikan Taurat sebagai petunjuk bagi Bani Israil yang menyeru mereka kepada kebenaran dan ke jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan sungguh Kami telah memberi Musa kitab Taurat, maka janganlah kamu -wahai Rasul- ragu terhadap pertemuanmu dengannya pada malam isra` mi'raj, dan Kami jadikan kitab yang diturunkan kepada Musa petunjuk bagi Bani Israil dari kesesatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Sungguh Kami telah memberi Musa kitab Taurat, maka janganlah kamu -wahai Rasulullah- ragu terhadap pertemuanmu dengan Musa pada malam isra’ mi’raj. Kami menjadikan Musa sebagai pemberi petunjuk dengan Taurat bagi keturunan Nabi Ya’qub agar mereka mengikuti kebenaran, dan sebagian mereka Kami jadikan sebagai pemimpin dan panutan dalam kebaikan, yang menyeru manusia untuk menyembah Allah semata. Mereka dapat meraih kedudukan ini ketika mereka bersabar dalam melakukan ketaatan dan menghadapi musibah, dan mereka beriman kepada ayat-ayat Kami dengan keimanan yang teguh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَلَقَدْ ءَاتَيْنَا مُوسَى الْكِتٰبَ (Dan Sesungguhnya Kami telah berikan kepada Musa Al-Kitab) Yakni kitab Taurat. فَلَا تَكُن(maka janganlah kamu) Hai Muhammad. فِى مِرْيَةٍ(dalam keraguan) Yakni dalam kebimbangan dan keraguan. مِّن لِّقَآئِهِۦ ۖ(saat menemuinya) Ini merupakan janji Allah bagi Rasulullah bahwa ia akan bertemu dengan Musa sebelum Beliau meninggal; dan Rasulullah bertemu dengannya di langit atau di Baitul Maqdis pada saat malam Isra’ Mi’raj. Pendapat lain mengatakan maknanya adalah janganlah kamu ragu tentang pertemuanmu dengan Musa di hari kiamat, kamu pasti akan menemuinya di sana. وَجَعَلْنٰهُ هُدًى لِّبَنِىٓ إِسْرٰٓءِيلَ(dan Kami jadikan Al-Kitab (Taurat) itu petunjuk bagi Bani Israil) Yakni Kami jadikan Taurat sebagai petunjuk bagi Bani Israil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Kami benar-benar telah menurunkan Taurat kepada Musa, maka janganlah kamu ragu untuk menyampaikan ajaran dalam kitab tersebut wahai Rasul, atau telah memberikan kitab pada Musa, dan Kami telah menjadikan Taurat sebagai petunjuk dan isyarat kepada Bani Israil untuk menuju jalan yang benar dan istiqomah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan kitab} Taurat {kepada Musa. Maka janganlah kamu dalam keragu-raguan} keraguan {untuk menemuinya} untuk menemui Musa AS pada malam Isra’ Mi’raj {dan Kami menjadikannya} dan Kami menjadikan Taurat itu {sebagai petunjuk bagi Bani Israil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Ketika Allah menjelaskan ayat-ayatNya yang dengannya Dia mengingatkan hamba-hambaNYa, yaitu alQuran yang diturunkan kepada Nabi Muhammad, maka dia menjelaskan bahwa alQuran ini bukan sesuatu yang baru dari kitab-kitab suci, dan tidak pula Rasul yang membawanya adalah asing dari kalangan para rasul, karena sesungguhnya Allah telah memberikan “kepada Musa al-Kitab,” yaitu Taurat yang membenarkan alQuran, yang juga telah dibenarkan oleh alQuran. Maka kebenaran keduanya pun sejalan (sama) dan bukti keduanya pun telah terbukti. “Maka janganlah kamu ragu-ragu menerimanya,” karena sesungguhnya dalil-dalil kebenaran dan bukti-buktinya sudah sangat banyak (mutawatir) sehingga tidak ada tempat bagi keraguan dan kebimbangan, “dan Kami menjadikannya,” maksudnya, menjadikan al- Kitab yang Kami berikan kepada Musa “sebagai petunjuk bagi Bani Israil,” yang mereka berpedoman kepadanya dalam prinsip-prinsip agama mereka dan cabang-cabangnya, dan syariat-syariatnya sejalan dengan zaman kala itu pada Bani Israil. Adapun alQuran Suci ini maka ia dijadikan oleh Allah sebagai pedoman bagi manusia seluruhnya, sebab ia adalah hidayah (pedoman) bagi segenap manusia dalam masalah agama dan dunia mereka hingga Hari Kiamat kelak. Hal ini karena kesempurnaan dan ketiinggiannya. \"Dan sesungguhnya Al Qur'an itu dalam induk Al Kitab (Lohmahfuz) di sisi Kami, adalah benar-benar tinggi (nilainya) dan amat banyak mengandung hikmah.\" (Az-Zukhruf`:4 )."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 23: Allah mengabarkan bahwasanya Musa datang membawa taurat sebelummu, maka turunnya Al Qur’an bukanlah termasuk hal yang baru bagi kalian. Oleh karenanya janganlah ragu dari pertemuan engkau dengan Musa pada hari Isra dan Mi’raj. Sungguh Kami jadikan taurat ini sebagai petunjuk bagi bani israil untuk petunjuk yang menunjuki menuju jalan yang lurus, dan menuju agama yang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan ayat-ayat-Nya, yaitu Al Qur’an untuk memperingatkan hamba-hamba-Nya, Dia menyebutkan, bahwa peringatan dengan kitab dan dengan pengiriman rasul bukanlah hal yang baru, karena Allah Subhaanahu wa Ta'aala juga telah menurunkan kitab dan mengirim rasul, seperti yang Dia turunkan kepada Musa, yaitu kitab Taurat yang membenarkan Al Qur’an dan dibenarkan oleh Al Qur’an (saling membenarkan), sehingga hak keduanya sama dan kuat buktinya. Oleh karena itu, Dia memerintahkan kita agar tidak ragu menerima Al Qur’an, karena telah datang dalil-dalil dan bukti-buktinya yang tidak menyisakan lagi keraguan. Ada yang mengatakan, maksudnya adalah, sebagaimana telah diberikan kepada Nabi Musa ‘alaihis salam kitab Taurat, begitu juga diberikan kepada Nabi Muhammad shallallahu 'alaihi wa sallam kitab Al-Quran. Sebagaimana Taurat dijadikan petunjuk bagi Bani Israil, maka Al Quran juga dijadikan petunjuk bagi ummat Nabi Muhammad shallallahu 'alaihi wa sallam. Mereka mengambil petunjuk darinya dalam masalah dasar maupun furu’ (cabang). Syariat-syariat dalam kitab Taurat sesuai pada zaman itu bagi Bani Israil. Adapun Al Qur’an ini, maka Allah jadikan sebagai petunjuk untuk semua manusia baik untuk urusan agama mereka maupun dunia dan tetap sesuai dan relevan sampai hari Kiamat karena kesempurnaan dan ketinggiannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 23",
    "description": "Untuk menguatkan jiwa rasulullah dalam mengajarkan Al-Qur'an dan menghadapi pengingkaran kaumnya, Allah berfirman bahwa sungguh, telah kami sampaikan kepada bani israil bahwa kami telah meng-anugerahkan kitab taurat kepada musa, maka janganlah engkau, wahai nabi Muhammad, ragu-ragu menerimanya, yakni Al-Qur'an; dan kami jadikan kitab taurat itu petunjuk bagi bani israil sebagaimana kami jadikan Al-Qur'an sebagai petunjuk bagi umatmu. 24. Dan tidak hanya menurunkan taurat kepada bani israil, kami juga jadikan di antara mereka itu pemimpin-pemimpin dan ulama-ulama yang memberi petunjuk dengan perintah dan pertolongan kami selama mereka sabar dalam menegakkan kebenaran. Mereka senantiasa meyakini ayat-ayat kami. Ayat ini dimaksudkan untuk menghibur hati rasulullah. Bila umat beliau menentang dakwahnya, sesungguhnya bani israil dulu tidak saja menentang nabi musa melainkan juga mengajukan permintaan yang mengherankan (lihat pula: an-nis'/4: 153 dan al-m'idah/5: 24)."
  }
]