[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami mengangkat di kalangan Bani Israil para pembimbing dan para penyeru kepada kebaikan yang diteladani oleh manusia. Dan mereka mengajak manusia kepada tauhid, menyembah kepada Alah semata dan menaatiNya. Mereka mendapatkan derajat yang tinggi ini saat mereka bersabar atas perintah-perintah Allah dan meninggalkan larangan-laranganNya, berdakwah kepada Allah dan teguh menghadapi gangguan di jalanNya, disamping mereka juga membenarkan dengan penuh keyakinan kepada ayat-ayat dan hujjah-hujjah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan Kami jadikan dari Bani Israil para pemimpin-pemimpin yang diikuti oleh manusia dalam hal kebenaran, mereka menunjukkan pada kebenaran ketika mereka bersabar dalam menaati segala perintah-Nya dan menghindari segala larangan-Nya, dan bersabar ketika menjalani cobaan di jalan dakwah, dan mereka beriman kepada ayat-ayat Allah yang diturunkan kepada rasul-rasul mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا (Dan Kami jadikan di antara mereka itu pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami) Yakni sebagai pemimpin-pemimpin dalam kebaikan yang menyeru kepada petunjuk dengan seruan yang mereka sampaikan dari hukum-hukum yang ada dalam Taurat. لَمَّا صَبَرُوا۟ ۖ( ketika mereka sabar) Yakni Kami jadikan mereka pemimpin-pemimpin berkat kesabaran mereka dalam menjalankan kewajiban dan dalam menyeru orang lain kepada petunjuk. Atau berkat kesabaran mereka terhadap kenikmatan dunia. وَكَانُوا۟ بِـَٔايٰتِنَا(Dan adalah mereka terhadap ayat-ayat Kami) Yakni ayat-ayat yang Allah turunkan. يُوقِنُونَ(merupakan orang-orang yang meyakini) Yakni mereka mempercayai ayat-ayat Allah dan mengetahui bahwa ayat-ayat itu benar dan berasal dari Allah, sebab mereka selalu menghayatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dan Kami telah menjadikan Bani Israil sebagai contoh dalam urusan agama, mereka adalah para Nabi yang memberikan petunjuk pada manusia, mengajak mereka pada Tauhid, menyembah Allah dan menjalankan syari’at dan hukum-hukum Allah, untuk menjalankan perintah Kami, agar mereka sabar atas beban kewajiban dan siksa dunia, dan mereka membenarkan ayat-ayat yang telah diturunkan dengan penuh keyakinan, dank arena kecermatan mereka dalam melihatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjadikan di antara mereka itu} di antara Bani Israil {pemimpin-pemimpin} pemimpin dan teladan dalam kebaikan {yang memberi petunjuk dengan perintah Kami selama mereka bersabar} selama mereka bersabar atas agama kami dan siksaan musuh mereka {Mereka selalu meyakini ayat-ayat Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Dan Kami jadikan dari mereka itu,” maksudnya, di antara Bani Israil itu, “pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami,” maksudnya, ulama-ulama yang menguasai ilmu syariat dan cara-cara memberi hidayah, mereka mendapat petunjuk pada diri mereka sendiri lalu memberi petunjuk kepada selain mereka dengan petunjuk itu. Al-Kitab yang diturunkan kepada mereka adalah petunjuk orang-orang yang beriman kepadanya, dan mereka terbagi menjadi dua: - para pemimpin yang memberi petunjuk dengan perintah Allah, - dan para pengikut yang berpedoman kepada mereka. Golongan yang pertama tentu lebih tinggi derajatnya, setelah derajat kenabian dan kerasulan. Ia adalah derajat orang-orang shiddiqin. Sebenarnya mereka meraih derajat tersebut adalah “ketika mereka sabar” dalam belajar dan mengajar, dalam berdakwah kepada Allah dan terhadap cobaan di jalanNya. Dan mereka menahan nafsu (diri) mereka dari rongrongannya untuk berbuat maksiat dan kecenderungannya kepada kesenangan-kesenangan nafsu, “dan mereka meyakini ayat-ayat Kami,” maksudnya, mereka dalam keimanan telah mencapai (dengan ayat-ayat Allah), kepada derajat yakin, yaitu ilmu yang sempurna yang membuahkan amal. Sesungguhnya mereka bisa mencapai derajat yakin adalah karena mereka belajar secara benar-benar dan mereka mengambil permasalahan-permasalahan dari dalil-dalilnya yang menghasilkan keyakinan. Mereka pun terus mempelajari permasalahan-permasalahan dan mereka berargumen untutknya dengan banyak dalil hingga mereka mencapai kepadanya. Maka dengan sabar dan yakin akhirnya mereka meraih kepemimpinan dalam agama."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 24: Allah mengabarkan dengan apa yang telah Allah karuniakan kepada bani israil dengan menjadikan (di antara) mereka para imam, dai dan ulama yang menunjukkan kepada mereka menuju kebenaran, dan juga menyeru mereka kepada tauhid dan iman, sungguh mereka telah mendapatkan posisi tinggi ini dengan kesabaran mereka atas mengajar dan belajar, dengan dakwah, dan membuang keburukan pada mereka, dan mereka atas ayat-ayat Allah menetapkan dengan penetapan yang kokoh di atas ilmu yang sempurna darinya, mereka menjaga(keimanan) mereka dengan amal dan dakwah, dengan sabar, yakin dan amal sehingga mencapai kepemimpinan dalam agama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni para ulama yang diikuti umat. Diri mereka memperoleh hidayah (petunjuk) dan menunjukkan orang lain dengan hidayah itu. Kitab yang diurunkan kepada mereka adalah hidayah, dan orang-orang yang beriman kepadanya ada dua golongan; golongan yang menjadi pemimpin yang membimbing umat dengan perintah Allah, dan golongan yang mengikuti yang sama mendapatkan petunjuk. Golongan pertama ini derajatnya sangat tinggi, menduduki posisi di bawah kenabian dan kerasulan. Derajat yang mereka tempati adalah derajat shiddiqin. Mereka memperoleh derajat itu karena sabar dalam beramal, belajar dan berdakwah serta bersabar dalam memikul derita di jalan-Nya. Mereka pun menahan diri mereka dari terjun ke dalam maksiat dan terbawa syahwat. Iman mereka kepada ayat-ayat Allah Ta’ala mencapai derajat yakin, yang merupakan pengetahuan sempurna yang menghendaki untuk beramal. Mereka memperoleh derajat yakin, karena mereka belajar dengan benar dan mengambil masalah dari dalil-dalilnya yang membuahkan keyakinan. Dengan kesabaran dan keyakinan itulah mereka memperoleh kedudukan imamah fiddin (pemimpin agama)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 24",
    "description": "Dan tidak hanya menurunkan taurat kepada bani israil, kami juga jadikan di antara mereka itu pemimpin-pemimpin dan ulama-ulama yang memberi petunjuk dengan perintah dan pertolongan kami selama mereka sabar dalam menegakkan kebenaran. Mereka senantiasa meyakini ayat-ayat kami. Ayat ini dimaksudkan untuk menghibur hati rasulullah. Bila umat beliau menentang dakwahnya, sesungguhnya bani israil dulu tidak saja menentang nabi musa melainkan juga mengajukan permintaan yang mengherankan (lihat pula: an-nis'/4: 153 dan al-m'idah/5: 24). 25. Karena itu, wahai nabi Muhammad, jangan ragu menyampaikan kebenaran Al-Qur'an, meski mereka menentangmu. Sungguh tuhanmu, dia-lah yang akan memberikan keputusan dengan benar dan adil di antara mereka, yakni para hamba-Nya, pada hari kiamat tentang apa yang dahulu mereka perselisihkan padanya, seperti hari kebangkitan, hari perhitungan, dan balasan di surga dan neraka."
  }
]