[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Tuhanmu (wahai rasul) memutuskan di antara orang-orang Mukmin dengan orang-orang kafir di kalangan Bani Israil dan lainnya di Hari Kiamat dengan keadilan dalam perkara yang mereka perselisihkan terkait masalah-masalah agama, dan Dia akan memberikan balasan kepada masing-masing orang sesuai dengan amal perbuatannya, yaitu dengan memasukkan penghuni surga ke dalam surga dan penduduk neraka ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Sesungguhnya Rabbmu -wahai Rasul- Dia lah yang memberikan keputusan di antara hamba pada hari Kiamat dalam perkara yang mereka perselisihkan di dunia, Dia menerangkan siapa yang benar dan siapa yang salah dan membalas masing-masing sesuai dengan haknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Hai Rasulullah, Tuhanmu akan memberi keputusan antara orang-orang beriman dan orang-orang kafir pada hari kiamat tentang perkara agama yang mereka perselisihkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ (Sesungguhnya Tuhanmu Dialah yang memberikan keputusan di antara mereka) Yakni Allah-lah yang memberi keputusan antara orang-orang beriman dan orang-orang kafir. يَوْمَ الْقِيٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ(pada hari kiamat tentang apa yang selalu mereka perselisihkan padanya) Dan pendapat lain mengatakan yang dimaksud adalah Allah memberi keputusan antara para nabi dan umat-umat mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Wahai rasul sesungguhnya Tuhanmu telah membedakan antara yang mukmin dan yang kafir pada hari kiamat atas apa yang telah mereka sengketakan dalam agama dan membagi setiap pembagian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu, Dialah Dzat yang memutuskan} menentukan {di antara mereka pada hari kiamat apa yang dahulu selalu mereka perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Kemudian di sana ada beberapa masalah yang diperselisihkan oleh Bani Israil, di antara mereka ada yang memperoleh yang benar dan diantara mereka ada yang salah karena kesalahan atau kesengajaan, dan Allah telah berfirman \"Dialah yang memberikan keputusan di antara mereka pada hari kiamat tentang apa yang selalu mereka perselisihkan padanya.\" Dan Al-quran ini telah menceritakan kepada Bani Israil sebagian dari permasalahan yang telah mereka perselisihkan. Setiap perselisihan yang terjadi di antara mereka sementara di dalam alQuran terdapat pembenarannya untuk salah satu dari dua pendapat, maka itulah yang benar, sedangkan yang lain yang menyelisihinya, itulah yang batil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 25: Ketahuilah wahai Nabi Allah, bahwasanya Tuhan kalian telah memisahkan antara yang beriman dan yang kafir, antara para utusan Allah dan yang mengikuti mereka, dan antara orang yang musyrik dan para kekasih Allah pada hari kiamat dengan adil atas apa yang telah mereka perselisihkan dan perdebatkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Namun di sana terdapat berbagai permasalahan yang diperselisihkan Bani Israil, di antara mereka ada yang memperoleh kebenaran, dan di antara mereka ada yang keliru sengaja atau tidak. Pada hari Kiamat, Allah Subhaanahu wa Ta'aala akan memutuskan permasalahan yang mereka perselisihkan. Dan Al Qur’an ini juga menerangkan perkara yang benar dalam masalah yang mereka perselisihkan, oleh karenanya setiap perselisihan yang terjadi di antara mereka, maka akan ditemukan dalam Al Qur’an jawabannya yang benar. Apa yang disebutkan dalam Al Qur’an adalah kebenaran, dan yang menyelisihinya adalah kebatilan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 25",
    "description": "Karena itu, wahai nabi Muhammad, jangan ragu menyampaikan kebenaran Al-Qur'an, meski mereka menentangmu. Sungguh tuhanmu, dia-lah yang akan memberikan keputusan dengan benar dan adil di antara mereka, yakni para hamba-Nya, pada hari kiamat tentang apa yang dahulu mereka perselisihkan padanya, seperti hari kebangkitan, hari perhitungan, dan balasan di surga dan neraka. 26. Pada ayat-ayat ini Allah menguatkan tiga pokok ajaran agama, yaitu tauhid, hari kebangkitan, dan risalah. Dan tidakkah menjadi petunjuk bagi mereka, yaitu para pendusta risalah, betapa banyak umat-umat sebelum mereka yang telah kami binasakan akibat pendustaan dan penentangan mereka terhadap para rasul, sedangkan mereka sendiri seringkali berjalan di tempat-tempat kediaman mereka yang dibinasakan itu sehingga mereka melihat bekas-bekas kehancurannya' kaum-kaum itu hancur karena kekafiran mereka. Sungguh, pada yang demikian itu terdapat tanda-tanda kekuasaan Allah. Apakah mereka tidak mendengarkan dan memperhatikan'."
  }
]