[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tidak jelas bagi orang-orang yang mendustakan Rasul itu berapa banyak umat-umat sebelum mereka yang telah Kami binasakan, mereka berjalan melewati negeri mereka lalu menyaksikan dengan mata kepala mereka, seperti kaum Hud, Shaleh dan Luth? Sesungguhnya dalam hal itu terkandung tanda-tanda dan nasihat-nasihat yang menunjukan kepada kebenaran para utusan Allah yang datang kepada mereka dan kebatilan syirik yang mereka perbuat. Apakah orang-orang yang mendustakan para Rasul itu tidak mendengarkan nasihat-nasihat dan hujjah-hujjah Allah lalu mengambil manfaat darinya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Apakah mereka buta sehingga tidak mengerti berapa banyak umat-umat sebelum mereka yang telah Kami musnahkan? Lalu mereka, orang-orang kafir dari kaummu berjalan di daerah yang ditempati oleh umat-umat tersebut sebelum mereka dihancurkan, namun orang-orang kafir dari kaummu tidak mengambil pelajaran dari keadaan mereka. Sesungguhnya di dalam peristiwa kehancuran yang terjadi pada umat-umat terdahulu karena kekufuran dan kemaksiatan itu terdapat pelajaran yang menjadi bukti atas kebenaran para rasul yang datang kepada mereka dari sisi Allah. Tidakkah orang-orang yang mendustakan ayat-ayat Allah itu mendengar dengan pendengaran yang menerima dan mengambil pelajaran?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Allah mengolok orang-orang musyrik: “Belum jelaskah bagi mereka betapa banyaknya umat-umat terdahulu yang Kami binasakan karena mendustakan para rasul? Mereka telah melewati tempat tinggal umat-umat itu sehingga dapat menyaksikan apa yang telah menimpa mereka. Sungguh kehancuran yang terjadi dan sisa-sisa dari kehancuran itu merupakan tanda-tanda yang menunjukkan keesaan Allah dan kebesaran kuasa-Nya, apakah mereka tidak mendengarkan kebenaran ini? Tidakkah mereka mengetahui bahwa Kami -dengan kuasa Kami- mengarahkan air menuju tempat yang tandus yang tidak dituruni hujan, kemudian dengan air itu Kami menumbuhkan berbagai tanaman; daun dan rumputnya sebagai makanan hewan ternak, dan buah-buahan dan biji-bijian untuk mereka makan? Tidakkah mereka melihat bahwa rezeki itu datang dari Allah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. أَوَلَمْ يَهْدِ لَهُمْ (Dan apakah tidak menjadi petunjuk bagi mereka) Yakni apakah belum dijelaskan bagi mereka. كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّنَ الْقُرُونِ(berapa banyak umat sebelum mereka yang telah Kami binasakan) Seperti kaum ‘Aad, Tsamud, dan lain sebagainya. يَمْشُونَ فِى مَسٰكِنِهِمْ ۚ( sedangkan mereka sendiri berjalan di tempat-tempat kediaman mereka itu) Dan mereka menyaksikannya dan melihat pelajaran-pelajaran dan bekas-bekas azab yang ada di sana. Namun mereka tidak mau mengambil pelajaran. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pada hal-hal yang disebutkan itu. لَاٰيٰتٍ ۖ( terdapat tanda-tanda (kekuasaan Allah)) Yang sangat agung. أَفَلَا يَسْمَعُونَ(Maka apakah mereka tidak mendengarkan?) Dan mengambil darinya pelajaran dan ibrah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Bukankah sudah jelas bagi kaum kafir makkah, banyak dari mereka yang Kami binasakan dari golongan umat terdahulu yang dzalim sebab kekufuran mereka. Seperti kaum ‘Ad, kaum Tsamud, kaum Mekah menyebar dalam semua perjalanan mereka di desa-desa mereka. Lalu mereka menyaksikan siksaan, sesungguhnya yang demikian itu adalah bukti atas kekuasaan Kami, tidakkah mereka mendengar dan merenungkan bagaimana kemudian mereka beriman? (berapa) Konten maknanya banyak. Dekade peradaban manusia: sebuah golongan dipersatukan dalam satu zaman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah tidak memberi petunjuk bagi mereka} Apakah tidak jelas bagi para pendusta itu {betapa banyak umat} umat-umat {sebelum mereka yang telah Kami binasakan, sedangkan mereka berjalan di tempat-tempat kediaman mereka itu. Sesungguhnya pada yang demikian itu terdapat tanda-tanda. Apakah mereka tidak mendengarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Maksudnya, apakah belum menjad jelas bagi mereka yang mendustakan rasul dan menjadi petunjuk bagi mereka kepada yang benar, berapa banyak sudah Kami binasakan sebelum mereka umat-umat yang telah menemuh jalan mereka, “sedangkan mereka sendiri berjalan di tempat-tempat kediaman mereka itu” lalu mereka menyaksikannya dengan pandangan mata kepala mereka, seperti kaum Nabi HUd, Shaleh, dan kaum nabi Luth. “Sesungguhnya ada yang demikian itu terdapat tanda-tanda,” yang data dijadikan dalil atas kebenaran para rasul yang telah datang kepada mereka, dan atas kebatilan ajaran yang mereka anut, yaitu syirik dan keburukan, serta dalil atas (hukum balasan) bahwa siapa saja yang melakukan seperti perbuatan mereka maka akan diperlakukan sama seperti perlakuan terhada orang-orang sebelumnya, dan dalil atas (janji Allah) bahwa Allah pasti memberikan balasan kepada hamba-hambaNya dan pasti menghidupkan mereka kembali untuk dihimpun dan diberi pembalasan. “Maka apakah mereka tidak mendengarkan,” ayat-ayat Allah, sehingga mereka menyadarinya lalu mengambil pelajaran darinya kalau saja mereka mempunyai pendengaran yang benar dan akal yang sehat, tentu mereka tidak akan tetap pada kondisi yang memastikan mereka binasa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 26: Tidakkah telah dijelaskan kepada mereka orang-orang yang mendustakan Rasul ﷺ dengan sombong yang telah Kami binasa dari umat sebelum mereka ?! Mereka menyaksikan tempat tinggal mereka dan berjalan padanya! Sungguh pada hal itu terdapat tanda yang nyata, tidakkah mereka mendengar nasihat ini sehingga menggerakkan hatinya dan beriman serta membenarkan ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang mendustakan Rasul. Yang menempuh jalan seperti yang mereka sekarang ini tempuh. Yaitu ketika mereka bepergian ke Syam atau lainnya, yang seharusnya mereka mengambil pelajaran darinya. Yang menunjukkan kebenaran para rasul yang datang kepada mereka, yang menunjukkan batilnya apa yang mereka pegang selama ini, seperti kemusyrikan dan kebiasaan buruk (adat-istiadat yang bertentangan dengan syariat), dan bahwa siapa saja yang berbuat seperti mereka, akan diberlakukan hukuman yang sama. Demikian juga menunjukkan bahwa Allah Subhaanahu wa Ta'aala akan membangkitkan mereka dan memberikan balasan kepada mereka. Ayat-ayat Allah, lalu mereka dapat mengambil manfaat darinya. Jika mereka memiliki pendengaran yang baik dan akal yang cerdas, tentu mereka tidak akan tetap seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 26",
    "description": "Pada ayat-ayat ini Allah menguatkan tiga pokok ajaran agama, yaitu tauhid, hari kebangkitan, dan risalah. Dan tidakkah menjadi petunjuk bagi mereka, yaitu para pendusta risalah, betapa banyak umat-umat sebelum mereka yang telah kami binasakan akibat pendustaan dan penentangan mereka terhadap para rasul, sedangkan mereka sendiri seringkali berjalan di tempat-tempat kediaman mereka yang dibinasakan itu sehingga mereka melihat bekas-bekas kehancurannya' kaum-kaum itu hancur karena kekafiran mereka. Sungguh, pada yang demikian itu terdapat tanda-tanda kekuasaan Allah. Apakah mereka tidak mendengarkan dan memperhatikan'27. Allah kuasa membinasakan dan menghidupkan mereka kem-bali. Dan tidakkah mereka, yakni para pendusta hari kebangkitan, memperhatikan bahwa kami mampu menghidupkan orang yang sudah mati sebagaimana kami mampu mengarahkan awan yang mengandung air ke bumi yang tandus, lalu dengan air hujan itu kami tumbuhkan tanam-tanaman sehingga hewan-hewan ternak mereka dan juga mereka sendiri dapat makan darinya sehingga tubuh mereka sehat dan kuat' maka, mengapa mereka tidak memperhatikan hal tersebut sebagai bukti kemampuan kami membangkitkan manusia pada hari kebangkitan'."
  }
]