[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang mendustakan kebangkitan setelah kematian itu tidak melihat bahwa Kami menggiring air ke bumi yang kering lagi keras yang tidak ada tanaman diatasnya, lalu Kami menumbuhkan tanaman dengan berbagai macam warna yang dimakan oleh ternak-ternak mereka dan mereka juga ikut memakannya sehingga mereka bisa hidup? Apakah mereka tidak melihat nikmat-nikmat ini dengan mata mereka lalu merekapun akan mengetahui bahwa Allah yang melakukan hal itu mampu untuk menghidupkan manusia yang mati dan membangkitkan mereka dari alam kubur mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Tidakkah orang-orang yang mendustakan adanya kebangkitan itu melihat bahwa Kami mengirimkan air hujan ke bumi yang kering, yang tidak ditumbuhi tumbuh-tumbuhan, lalu dengan air itu Kami mengeluarkan tanaman, yang dimakan unta-unta, sapi-sapi dan kambing-kambing mereka dan mereka pun makan darinya? Apakah mereka tidak melihat hal itu dan memahami bahwa Żat yang menumbuhkan bumi yang gersang mampu untuk menghidupkan yang mati?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. أَوَلَمْ يَرَوْا۟ أَنَّا نَسُوقُ الْمَآءَ إِلَى الْأَرْضِ الْجُرُزِ (Dan apakah mereka tidak memperhatikan, bahwasanya Kami menghalau (awan yang mengandung) air ke bumi yang tandus) Yakni tanah yang tidak dapat menumbuhkan tanaman kecuali dengan air hujan yang diturunkan kepadanya. فَنُخْرِجُ بِهِۦ(lalu Kami tumbuhkan dengan air hujan itu) Yakni dengan air hujan itu. زَرْعًا تَأْكُلُ مِنْهُ أَنْعٰمُهُمْ (tanaman yang daripadanya makan hewan ternak mereka) Yakni tanaman seperti gabah, biji-bijian, daun-daunan, dan lain sebagainya yang tidak dimakan oleh manusia. وَأَنفُسُهُمْ ۖ (dan mereka sendiri) Yakni mereka memakan biji-bijian yang dihasilkan oleh tanaman sebagai makanan pokok mereka. أَفَلَا يُبْصِرُونَ (Maka apakah mereka tidak memperhatikan?) Yakni tidakkah mereka memperhatikan nikmat-nikmat ini dan mensyukuri serta mengesakan Sang Pemberi nikmat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Tidakkah mereka tahu, bahwa kemunkaran dan kebangkitan dari Kuasa Kami yang mengalirkan air dan membasahi bumi yang gersang yang tidak tumbuh tanaman, Kami tumbuhkan berbagai macam tanaman darinya, yang ternak-ternak mereka makan darinya berupa remukan jerami, biji-bijian dan dedaunan. Diri mereka juga memakan biji-bijian dan buah-buahan, tidakkah mereka melihat ini, sehingga mereka tahu kekuasaan Allah atas kehidupan setelah kematian mereka?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan bahwa Kami mengarahkan} Kami mengarahkan {air ke bumi yang tandus} kering yang tidak ada tanaman di dalamnya {lalu Kami menumbuhkan dengan air itu tanaman, sehingga hewan-hewan ternak mereka dan diri mereka makan darinya. Apakah mereka tidak memperhatikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Dan apakah mereka tidak memperhatikan” dengan pandangan mata mereka nikmat dan kesempurnaan hikmah Kami, “bahwasanya Kami menghalau air ke bumi yang tandus” yang sama sekali tidak ada tumbuh-tumbuhannya. Lalu Allah menghalau hujan yang sebelumnya tidak ada padanya, lalu Dia menumpahkannya padanya dari awan atau dari sungai-sungai, “lalu Kami tumbuhkan dengan air hujan itu tanam-tanaman,” yakni, tumbuh-tumbuhan yang beraneka macam, “yang darinya binatang-binatang ternak mereka makan,” yaitu, tumbuh-tumbuhan, makanan, binatang ternak, “dan makanan mereka sendiri,” yaitu yang menjadi makanan manusia, “Maka apakah mereka tidak memperhatikan,” nikmat tersebut yang dengannya Allah menghidupkan negeri dan manusia. Lalu mereka mengambil pelajaran dan dengan pandangan dan pikiran yang mendalam itu mereka mengambil petunjuk kepada jalan yang lurus? Akan tetapi kebutaan telah menguasai mereka dan kelalaian telah menutupi mereka, sehingga mereka tidak dapat melihat padanya dengan pandangan oran-orang lelaki. Mereka hanya melihat kepadanya dengan penglihatan kelalaian dan hanya sekedar kebiasaan, maka dari itu mereka tidak mendapat bimbingan kepada kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 27: Apakah mereka tidak melihat (yaitu mereka yang sombong), bahwasanya Allah menurunkan hujan ke bumi yang kering yang tidak ada tumbuhan padanya, sehingga keluarlah air untuk bercocok tanam, untuk diambil dari air tersebut dan sebagai keberlangsungan kehidupan mereka, maka mereka bisa makan dari hasil pertanian ini apa yang Allah karuniakan. Apakah mereka tidak melihat atas kenikmatan ini sehingga memberi petunjuk kepada mereka menuju jalan yang lurus dan tauhid kepada Rabbul Alamin!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni nikmat-nikmat Kami dan sempurnanya kebijaksanaan Kami. Nikmat itu, di mana Allah Subhaanahu wa Ta'aala menghidupkan dengan air itu bumi setelah matinya. Dari sana pun mereka dapat mengetahui bahwa Allah Subhaanahu wa Ta'aala mampu menghidupkan kembali orang-orang yang telah mati. Akan tetapi, kebutaan dan kelalaian menguasai mereka, mereka memperhatikan dengan perhatian yang lalai, tidak meresapi dan tidak mengambil pelajaran darinya, sehingga mereka tidak diberi taufik kepada kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 27",
    "description": "Allah kuasa membinasakan dan menghidupkan mereka kem-bali. Dan tidakkah mereka, yakni para pendusta hari kebangkitan, memperhatikan bahwa kami mampu menghidupkan orang yang sudah mati sebagaimana kami mampu mengarahkan awan yang mengandung air ke bumi yang tandus, lalu dengan air hujan itu kami tumbuhkan tanam-tanaman sehingga hewan-hewan ternak mereka dan juga mereka sendiri dapat makan darinya sehingga tubuh mereka sehat dan kuat' maka, mengapa mereka tidak memperhatikan hal tersebut sebagai bukti kemampuan kami membangkitkan manusia pada hari kebangkitan'28. Enggan memperhatikan bukti kuasa Allah membangkitkan manusia yang telah mati, kaum kafir justru menantang nabi Muhammad. Dan dengan maksud mengejek mereka bertanya, 'kapankah kemenangan atas kami itu datang kepadamu dan kapan pula azab yang engkau ancam kami dengannya itu akan datang, jika engkau memang orang yang benar dalam pengakuanmu sebagai rasul''."
  }
]