[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang menyekutukan Allah itu meminta disegerakannya azab. Mereka berkata, “Kapan keputusan yang menetapkan di antara kalian dengan kami untuk menyiksa kami menurut klaim kalian akan datang bila kalian adalah orang-orang yang benar dalam klaim kalian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Orang-orang yang mendustakan adanya hari Kebangkitan berkata untuk minta disegerakan siksa, “Kapankah terjadinya putusan yang kalian yakini bahwa itu akan menjadi pemutus perkara antara kami dan kalian pada hari Kiamat, lalu tempat kembali kami adalah ke Neraka sementara kalian ke Surga?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-30. Orang-orang musyrik bertanya dengan nada menghina: “Kapan azab bagi kami akan terjadi jika ancaman kalian itu benar?” Maka Allah menjawab: “Hai Rasulullah, katakanlah kepada mereka, pada hari turunnya azab tidak berguna lagi keimanan orang-orang kafir dan mereka tidak mendapat kesempatan untuk bertaubat. Berpalinglah dari mereka, dan tunggulah azab yang akan menimpa mereka. Dan mereka juga menunggu agar musibah menimpa kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَيَقُولُونَ مَتَىٰ هٰذَا الْفَتْحُ إِن كُنتُمْ صٰدِقِينَ (Dan mereka bertanya: “Bilakah kemenangan itu (datang) jika kamu memang orang-orang yang benar?”) Yakni kapankah kemenangan yang kalian janjikan kepada kami. Yang dimaksud adalah hari kebangkitan yang Allah jadikan untuk memberi keputusan diantara para hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Para orang-orang musyrik bertanya pada kaum mukmin: kapan datangnya hari kebangkitan yang telah kalian tunjukkan pada kami, dan telah kamu janjikan pada kami, jika kalian benar-benar membenarkan janji itu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kapankah kemenangan itu, jika kalian adalah orang-orang yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Maksudnya, orang-orang yang berdosa itu meminta supaya azab yang dijanjikan (karena pendustaan mereka) disegerakan menimpa mereka, sebagai sikap bodoh dan sikap melawan. “Dan mereka bertanya, ‘Bilakah kemenangan,” yang memenangkan di antara kami dengan kalian, yaitu dengan mengazab kami, seperti yang diklaim kalian. “JIka kamu” wahai para rasul “memang orang-orang yang benar,” dalam dakwaan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 28: Ketika orang-orang muslim berkata kepada orang-orang kafir : Ketahuilah, bahwa bagi kami terdapat hari yang Allah akan tegakkan padanya urusan antara kami dan kalian. Maka berkatalah orang-orang kafir dengan ejekan : Kapan hari itu akan datang jika memang kalian adalah orang-orang yang benar dan ucapan kalian?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang berdosa itu. Kepada orang-orang mukmin tentang azab yang diancamkan kepada mereka itu karena pendustaan mereka, kebodohan dan sikap membangkang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 28",
    "description": "Enggan memperhatikan bukti kuasa Allah membangkitkan manusia yang telah mati, kaum kafir justru menantang nabi Muhammad. Dan dengan maksud mengejek mereka bertanya, 'kapankah kemenangan atas kami itu datang kepadamu dan kapan pula azab yang engkau ancam kami dengannya itu akan datang, jika engkau memang orang yang benar dalam pengakuanmu sebagai rasul''29-30. Allah memberi petunjuk kepada nabi Muhammad untuk menanggapi pertanyaan kaum kafir itu. Katakanlah, 'ketahuilah, pada hari kemenangan itu, yaitu hari kiamat ketika setiap manusia akan memperoleh putusan dan balasan dengan adil, tidak berguna lagi bagi orang-orang kafir itu keimanan mereka dan mereka tidak diberi penangguhan untuk dikembalikan ke dunia supaya bertobat, beriman, dan beramal saleh. ' maka, wahai nabi Muhammad, berpalinglah engkau dari mereka. Abaikanlah pendustaan mereka dan tunggulah masa ketika Allah mendatangkan janji-Nya dengan memenangkan orang beriman atas orang kafir, sesungguhnya mereka juga menunggu kapan kalian mati atau terbunuh dalam perang. []."
  }
]