[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada mereka, “Di hari keputusan dimana saat itu hukuman terhadap kalian akan menimpa kalian, dan saat itu kalian menyaksikan kematian, iman orang-orang kafir tidak berguna bagi mereka, mereka juga tidak diberi kesempatan untuk bertaubat dan kembali (ke dunia)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Katakan -wahai Rasul- kepada mereka, “Janji ini terjadi pada hari Kiamat. Hari Kiamat adalah hari Penentuan di antara para hamba, tatkala keimanan orang-orang kafir kepada Allah di dunia tidak lagi bermanfaat setelah melihat hari Kiamat, mereka pun tidak diberi waktu tenggang untuk bertobat kepada Rabb mereka dan kembali kepada-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. قُلْ يَوْمَ الْفَتْحِ لَا يَنفَعُ الَّذِينَ كَفَرُوٓا۟ إِيمٰنُهُمْ (Katakanlah: “Pada hari kemenangan itu tidak berguna bagi orang-orang kafir, iman mereka) Jika mereka beriman saat itu. وَلَا هُمْ يُنظَرُونَ(dan tidak pula mereka diberi tangguh”) Yakni tidak diberi lagi kesempatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Maka katakanlah kepada mereka wahai Rasul: hari dimana diturunkannya adzab kepada mereka pada hari kiamat, dimana keimanan orang kafir tidak berguna, apabila mereka percaya, maka mereka tidak akan menunda-nunda untuk bertaubat. Abu Qatadah berkata: Para Sahabat bertanya: Kami memiliki hari yang kami ragukan apakah kami beristirahat dan kami diberi nikmat. Orang-orang musyrik menjawab: Kapan hidayah ini akan turun jika kalian, maka ayat ini turun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Pada hari kemenangan itu} keputusan di antara para hamba {tidak berguna lagi bagi orang-orang kafir keimanan mereka dan mereka tidak diberi penangguhan”} dan mereka tidak ditangguhkan sehingga mereka bisa bertaubat dan menyampaikan alasan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Katakanlah, ‘Pada hari kemenangan itu’,” yang ketika itu azab kalian menimpa, kalian sama sekali tidak dapat mengambil manfaat apa pun. Kalau azab itu terjadi, sementara penangguhan kalian telah terjadi di mana kalian bisa mengejar ketinggalan kalian di saat perkaranya sudah menjadi keyakinan bagi kalian maka tentu hal itu masih ada gunanya. Akan tetapi apabila hari kemenangan itu datang niscaya permasalahan sudah selesai dan sudah tidak ada lagi tempat bagi cobaan dan ujian, maka “tidak berguna bagi orang-orang kafir iman mereka,” karena pada saat itu berarti menjadi iman terpaksa “dan tidak pula mereka diberi tangguh,” maksudnya, tidak diberi waktu, sehingga azab bisa ditunda dari mereka, lalu dengannya mereka dapat mengejar permasalahan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 29: Allah memerintahkan kepada Nabi-Nya Muhammad ﷺ agar berkata kepada mereka orang-orang kafir : Ketahuilah bahwa hari pembalasan dan hisab antara kami dan kalian dekat, dan tidaklah bermanfaat bagi kalian keimanan kalian dan adanya udzur bagi kalian pada hari itu, Allah tidaklah mengakhirkan adzab bagi kalian; Bahkan Allah akan memberikan adzab bagi kalian dengan adzab yang cepat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hari kemenangan ialah hari Kiamat, atau kemenangan dalam perang Badar, atau penaklukan kota Makkah, di mana ketika itu mereka merasa terpukul dan tertimpa azab. Karena beriman ketika itu karena terpaksa. Untuk bertobat dan mengejar hal yang telah mereka tinggalkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 29",
    "description": "29-30. Allah memberi petunjuk kepada nabi Muhammad untuk menanggapi pertanyaan kaum kafir itu. Katakanlah, 'ketahuilah, pada hari kemenangan itu, yaitu hari kiamat ketika setiap manusia akan memperoleh putusan dan balasan dengan adil, tidak berguna lagi bagi orang-orang kafir itu keimanan mereka dan mereka tidak diberi penangguhan untuk dikembalikan ke dunia supaya bertobat, beriman, dan beramal saleh. ' maka, wahai nabi Muhammad, berpalinglah engkau dari mereka. Abaikanlah pendustaan mereka dan tunggulah masa ketika Allah mendatangkan janji-Nya dengan memenangkan orang beriman atas orang kafir, sesungguhnya mereka juga menunggu kapan kalian mati atau terbunuh dalam perang. []29-30"
  }
]