[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Namun orang-orang musyrik justru berkata, “Muhammad telah membuat al-Qur’an.” Mereka dusta, karena al-Qur’an adalah haq yang pasti yang diturunkan kepadamu (wahai Rasul) dari Tuhanmu agar dengan al-Qur’an itu kamu memberikan peringatan kepada orang-orang yang belum didatangi pembawa peringatan sebelummu, semoga mereka mau mengikuti petunjuk, lalu kemudian mereka mengetahui yang haq dan beriman kepadanya serta mendahulukannya, di samping itu mereka pun beriman kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya orang-orang kafir mengatakan, “Sesungguhnya Muhammad mengarang-ngarangnya atas nama Rabbnya.” Kenyataannya tidaklah seperti yang mereka katakan, tetapi Al-Qur`ān itu adalah kebenaran yang tidak ada keraguan di dalamnya, diturunkan dari Rabbmu -wahai Rasul- kepadamu agar kamu menakut-nakuti kaum yang belum didatangi oleh seorang rasulpun sebelummu yang menakut-nakuti mereka dengan siksa Allah, agar mereka mendapat petunjuk kepada kebenaran lalu mereka mengikutinya dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Apakah orang-orang musyrik berkata: “Muhammad membuat sendiri al-Qur’an”? Sungguh mereka telah berdusta, padahal al-Qur’an adalah perkataan yang benar yang diturunkan dari Tuhanmu, agar kamu menjadikannya peringatan bagi kaummu yang belum ada seorang rasulpun yang diutus kepada mereka sebelummu sehingga mereka mendapat petunjuk untuk mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. أَمْ يَقُولُونَ افْتَرَىٰهُ ۚ (Tetapi mengapa mereka (orang kafir) mengatakan: “Dia Muhammad mengada-adakannya”) Yakni Muhammad membuat-buatnya sendiri. بَلْ هُوَ الْحَقُّ مِن رَّبِّكَ(Sebenarnya Al-Quran itu adalah kebenaran dari Rabbmu) Allah membantah tuduhan mereka bahwa al-Qur’an itu dibuat-buat. لِتُنذِرَ قَوْمًا مَّآ أَتَىٰهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ(agar kamu memberi peringatan kepada kaum yang belum datang kepada mereka orang yang memberi peringatan sebelum kamu) Mereka adalah penduduk Makkah, mereka tidak mengetahui baca tulis, dan belum ada rasul yang diutus kepada mereka. لَعَلَّهُمْ يَهْتَدُونَ(mudah-mudahan mereka mendapat petunjuk) Yakni agar mereka mendapat petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Tetapi mengapa orang-orang musyrik berkata: “Muhammad hanya mengada-adakan Al-quran dengan dirinya sendiri, bukan dari Allah.” Tetapi Al-quran adalah benar-benar haq yang diturunkan dari sisi Allah. Al-quran diturunkan sebagai peringatan kepada orang-orang belum pernah mendapat peringatan, yaitu peringatan tentang azab Allah jika mereka menyekutukan Allah dan durhaka kepada-Nya. Mereka adalah orang-orang Arab dan orang-orang selain Arab. Mereka semua diberi seruan kepada agama Islam sebagaimana telah dijelaskan pada ayat lain. Agar mereka mendapat petunjuk kepada jalan kebenaran dan keimanan dengan peringatanmu, sehingga mereka bisa hidup bahagia. Fungsi huruf am adalah sebagai tanda perpindahan kalimat pertama, untuk mengingkari klaim atau anggapan mereka bahwa Al-quran itu palsu. Adapun huruf bal berfungsi menekan atau memukul perkataan mereka, dan menetapkan bahwa Al-quran itu benar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tetapi mengapa mereka berkata} tetapi kenapa orang-orang musyrik berkata {“Dia telah mengada-adakannya”} Muhammad telah membuat-buat Al-Qur’an itu dari dirinya sendiri {Sebaliknya, Al-Qur’an itulah kebenaran dari Tuhanmu agar kamu memberi peringatan kepada kaum yang sama sekali belum pernah didatangi seorang pemberi peringatan sebelum kamu, agar mereka mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Sekalipun demikian, orang-orang yang mendustakan Rasulullah dan mereka zhalim dalam hal ini berkata, “Ia dibuat-buat oleh Muhammad dan diada-adakannya dari dirinya sendiri!” ini tentu merupakan kelancangan terbesar untuk mengingkari kalamullah dan menuduh Muhammad dengan kedustaan yang paling besar (serta menganggap) makhluk mempunyai kemampuan mengeluarkan kalam sebagaimana kalam dari Sang Pencipta. Masing-masing dari salah satu perbuatan ini termasuk perkara yang sangat besar. Allah berfirman seraya membantah orang yang mengatakan, “Dia telah membuat-buatnya,” “Sebenarnya al-Quran itu adalah kebenaran,” yang tidak akan dihampiri oleh kebatilan dari depan ataupun dari belakangnya. Ia diturunkan dari Dzat Yang Mahabijaksana lagi Maha Terpuji. “Dari Rabbmu,” Dia menurunkannya sebagai rahmat bagi hamba-hambaNya, “agar kamu memberi peringatan kepada kaum yang belum datang kepada mereka orang yang memberi peringatan sebelum kamu.” Maksudnya, mereka sedang dalam kondisi sangat membutuhkan diutusnya seorang rasul dan diturunkannya kitab suci, karena tidak adanya orang yang memberikan peringatan, bahkan mereka terombang-ambing di dalam kebodohan mereka, dan bimbang di dalam gelap kesesatan, maka dari itu Kami menurunkan kitab ini kepadamu, “mudah-mudahan mereka mendapat petunjuk,” dari kesesatan mereka, sehingga mereka mengetahui yang benar dan mengutamakannya. Semua hal yang disebutkan oleh Allah di atas, semuanya berlawanan dengan pendustaan mereka terhadapnya, dan sesungguhnya ia menuntut mereka beriman dan membenarkan sepenuhnya padanya, yaitu keberadaannya berasal dari Rabb semesta alam, dan bahwa sesungguhnya ia benar, dan yang benar itu diterima bagaimanapun keadaannya, dan bahwa sesungguhnya ia sama sekali tidak mengandung keraguan dari sisi manapun, karena tidak ada di dalamnya yang mengharuskan keraguan, baik karena berita (informasi) yang tidak sesuai dengan realita ataupun karena kekeringan dan kesamaran makna-maknanya; dan bahwa mereka sedang berada dalam kondisi sangat memerlukan dan membutuhkan kepada risalah (kerasulan) dan bahwa di dalamnya terdapat hidayah (petunjuk) bagi setiap kebaikan dan perbuatan baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 3: Apakah mereka orang-orang musyrik berkata : Sungguh engkau wahai Nabi Allah membuat-buat Al Qur’an ini dari dirimu sendiri ? , sungguh telah dusta mereka; Akan tetapi Al Qur’an adalah kebenaran, benar diturunkan kepada engkau dari sisi Tuhanmu; Sebagai peringatan bagi umatmu yang buta huruf, yang tidak ada pemberi peringatan sebelum engkau, semoga mereka mendapatkan petunjuk munuju kebenaran dan tauhid serta ikhlas beribadah kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang tidak dimasuki kebatilan, baik dari depan maupun dari belakang. Sebagai rahmat-Nya kepada manusia. Mereka berada dalam keadaan yang sangat cocok untuk diutusnya rasul dan diturunkan kitab karena tidak ada yang memberi peringatan, bahkan mereka terombang-ambing dalam kesesatan dan kebodohan, maka Allah Subhaanahu wa Ta'aala menurunkan Al Qur’an agar mereka mendapatkan perunjuk, mereka dapat mengenal yang hak sehingga mengutamakannya. Semua yang ada di ayat ini membantah pendustaan mereka kepada Beliau, dan bahwa apa yang disebutkan di dalamnya menghendaki mereka beriman dan membenarkan secara sempurna, yaitu karena ia turun dari Rabbul ‘alamin, karena ia adalah kebenaran dan tidak ada keraguan di dalamnya dari berbagai sisi. Oleh karena itu, di dalamnya tidak terdapat sesuatu yang menjadikan mereka ragu, tidak ada berita yang bertentangan dengan kenyataan, tidak ada kesamaran dalam maknanya, dan bahwa mereka berada dalam kebutuhan kepada risalah, dan bahwa di dalam kitab Al Qur’an terdapat petunjuk kepada semua kebaikan dan ihsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 3",
    "description": "Terbukti dengan nyata bahwa Al-Qur'an bukanlah ciptaan manusia, tetapi mengapa mereka, orang kafir, tanpa bukti-bukti yang kuat mengatakan, 'dia, Muhammad, telah mengada-adakannya. Lupa-kah mereka bahwa secara logis maupun realitas sejarah mustahil rasulullah mengarang Al-Qur'an' karena itu Allah menjawab, 'tidak, Al-Qur'an itu kebenaran yang datang dari tuhanmu, agar engkau, wahai nabi Muhammad, memberi peringatan kepada kaum yang belum pernah didatangi orang yang memberi peringatan sebelum engkau bahwa azab Allah akan menimpa siapa saja yang kafir dan mendurhakai-Nya; dan agar melalui Al-Qur'an pula mereka mendapat petunjuk. 4. Nabi Muhammad diutus untuk mendakwahkan ajaran tauhid dan dibekali dengan bukti-bukti nyata tentang hal itu. Allah yang menciptakan langit dan bumi dan apa yang ada di antara keduanya tanpa contoh dan tidak pernah ada sebelumnya, dalam enam masa, meski sesungguhnya dia mampu menciptakannya dalam waktu sekejap. Hal ini bermaksud mendidik manusia bersabar dalam menangani semua urusan. Kemudian dia bersemayam di atas 'arsy yang tidak diketahui hakikatnya oleh selain Allah, namun wajib kita imani sesuai dengan kebesaran dan kesucian-Nya. Bagimu tidak ada seorang pun penolong maupun pemberi syafaat selain dia. Tanpa izin Allah, tidak ada yang mampu menolongmu, baik itu para rasul maupun orang-orang tertentu, meringankan azab atau bebanmu di akhirat. Maka, apakah kamu tidak memperhatikan dan mengambil pelajaran dari hal ini sehingga kamu beriman dan mengeesakan-Nya'."
  }
]