[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berpalinglah (wahai Rasul) dari orang-orang musyrik itu. Tidak usah mempedulikan pendustaan mereka. Dan tunggulah apa yang akan Allah lakukan terhadap mereka. Sesungguhnya mereka menunggu dan menanti akhir yang buruk menimpa kalian. Allah akan merendahkan dan menghinakan mereka serta menenangkanmu atas mereka, dan Allah telah melakukan hal itu, segala puji bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Maka berpalinglah -wahai Rasul- dari mereka setelah mereka terus menerus berada dalam kesesatan mereka dan tunggulah siksa Allah yang akan menimpa mereka. Sesungguhnya mereka itu menunggu siksa yang kamu janjikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. فَأَعْرِضْ عَنْهُمْ(Maka berpalinglah kamu dari mereka) Yakni dari kejahilan dan pendustaan mereka. Dan janganlah kamu tanggapi mereka melainkan dengan apa yang telah diperintahkan kepadamu. وَانتَظِرْ إِنَّهُم مُّنتَظِرُونَ(dan tunggulah, sesungguhnya mereka (juga) menunggu) Yakni tunggulah hari kemenangan, yaitu hari kiamat. Sebab mereka juga menunggu-nunggu musibah bagimu seperti kematian atau kekalahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Kemudian rasul berpaling dari kaum musyrik. Dan tidak menghiraukan kedustaan mereka, dan tunggulah hidayah datang dan wujud janji sebab kerusakan yang telah mereka lakukan yaitu pada hari kiamat. Sesungguhnya mereka menunggu khabar darimu berupa khabar kematian, pembunuhan atau yang menimpamu. Dan ini sebelum adanya perintah membunuh/memerangi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka berpalinglah dari mereka dan tunggulah. Sesungguhnya mereka juga menunggu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Maka berpalinglah kamu dari mereka,” setelah perkataan mereka kepadamu dan kezhaliman mereka telah sampai pada tingkat kejahilan dan setelah permintaan agar azab disegerakan. “Dan tunggulah,” perkaranya yang akan menimpa mereka, akan tetapi ia memunyai waktu batas akhir, yang apabila datang, maka tidak akan diakhirkan lagi, “sesungguhnya mereka juga menunggu,” yakni menunggumu celaka, dan mereka menanti-nanti kesempatan buruk terhadap kalian. Dan keselamatan itu adalah untuk ketakwaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 30: Allah mengakhir surat ini dengan memerintahkan kepada Nabi ﷺ agar berpaling dari orang-orang yang kafir, dan tidak menghiraukan pengingkaran mereka, dan agar Nabi menunggu sampai datangnya pertolongan Allah, karena sesungguhnya mereka orang-orang kafir juga menunggu apa yang akan engkau inginkan dan akan terus mencoba mengotak-atik urusanmu, akan tetapi engkau akan mendapatkan balasan yang baik (dan juga) bagi mereka yang bertakwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika percakapan mereka menjadi kebodohan dan meminta disegerakan azab. Peristiwa dahsyat yang akan menimpa mereka. Karena azab itu sudah harus menimpa mereka, akan tetapi ada waktunya yang jika datang tidak dapat dimajukan dan tidak dapat ditunda. Mereka pun sama menunggu musibah yang menimpa Beliau, seperti kematian atau terbunuh. Padahal kesudahan yang baik akan diberikan kepada orang-orang yang bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 30",
    "description": "29-30. Allah memberi petunjuk kepada nabi Muhammad untuk menanggapi pertanyaan kaum kafir itu. Katakanlah, 'ketahuilah, pada hari kemenangan itu, yaitu hari kiamat ketika setiap manusia akan memperoleh putusan dan balasan dengan adil, tidak berguna lagi bagi orang-orang kafir itu keimanan mereka dan mereka tidak diberi penangguhan untuk dikembalikan ke dunia supaya bertobat, beriman, dan beramal saleh. ' maka, wahai nabi Muhammad, berpalinglah engkau dari mereka. Abaikanlah pendustaan mereka dan tunggulah masa ketika Allah mendatangkan janji-Nya dengan memenangkan orang beriman atas orang kafir, sesungguhnya mereka juga menunggu kapan kalian mati atau terbunuh dalam perang. []1. Wahai nabi! bertakwalah kepada Allah dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya; dan karenanya janganlah engkau menuruti keinginan orang-orang kafir agar engkau berpaling dari ketaatan kepada Allah, dan janganlah engkau menuruti kehendak orang-orang munafik agar engkau duduk bersama mereka dan menjauhi kaum duafa. Sesungguhnya Allah maha mengetahui akibatnya, mahabijaksana dalam segala firman dan aturan-Nya."
  }
]