[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah Yang meciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam hari untuk suatu hikmah yang Dia ketahui, padahal Dia kuasa untuk menciptakan dengan kalimat, “Kun” maka ia pun jadi. Kemudian Allah bersemayam (yakni naik dan tinggi) di atas Arasy sesuai dengan keagunganNYa; tidak ditentukan bentuk dan caranya dan tidak disamakan dengan makhluk. Tidak ada untuk kalian (wahai manusia) yang mengurusi perkara kalian, ata seorang pemberi syafaat yang akan memberikan syafaat kepada kalian di sisi Allah untuk menyelamatkan kalian dari siksa Allah, tidakkah kalian mengambil pelajaran dan memikirkannya (wahai manusia) lalu kemudia kalian mengesakan Allah dalam uluhiyahNya dan mengikhlaskan ibadah hanya kepadaNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Allah-lah yang menciptakan langit dan menciptakan bumi serta menciptakan apa-apa yang ada di antara keduanya dalam waktu enam hari, dan Dia Mahakuasa untuk menciptakannya lebih cepat dari kedipan mata, kemudian Dia bersemayam di atas Arsy dengan cara bersemayam yang sesuai dengan keagungan-Nya. Tidak ada bagi kalian -wahai manusia- suatu penolong pun selain Allah yang mengurusi urusan kalian, atau pemberi syafaat yang memberikan syafaat di sisi Rabb kalian, tidakkah kalian berfikir dan menyembah Allah yang telah menciptakan kalian, dan tidak menyembah selain-Nya bersama-Nya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Allah mengabarkan kesempurnaan kuasa-Nya dalam menciptakan tujuh langit dan bumi selama enam hari. Kemudian Dia bersemayam di atas ‘arsy yang merupakan makhluk yang paling besar dan paling tinggi, Dia bersemayam sesuai dengan keagungan-Nya. Wahai para hamba, kalian tidak memiliki penolong selai Allah, dan tidak ada yang dapat memberi syafaat di sisi Allah kecuali dengan izin-Nya. Apakah mereka tidak berfikir untuk mengikuti kebenaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. اللهُ الَّذِى خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِى سِتَّةِ أَيَّامٍ (Allah lah yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam masa) Allah-lah yang lebih mengetahui hakikat dan panjangnya masa itu. ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ( kemudian Dia bersemayam di atas ‘Arsy) Tafsir dari kalimat ini telah dijelaskan dengan lengkap. مَا لَكُم مِّن دُونِهِۦ مِن وَلِىٍّ وَلَا شَفِيعٍ ۚ( Tidak ada bagi kamu selain dari pada-Nya seorang penolongpun dan tidak (pula) seorang pemberi syafa’at) Yakni kalian tidak memiliki penolong dari Allah atau dari azab-Nya, dan kalian tidak memiliki pemberi syafaat di sisi-Nya. أَفَلَا تَتَذَكَّرُونَ(Maka apakah kamu tidak memperhatikan?) Yakni memperhatikan, menghayati, memikirkan, dan mendengar peringatan-peringatan ini sebagaimana pendengaran orang yang memahami dan memikirkan agar kalian dapat mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Allah lah Yang telah menciptakan langit dan bumi, serta segala sesuatu yang ada di antara keduanya selama 6 hari. Allah lah Yang mengetahui kadar atau ukurannya, kemudian Allah bersemayam di atas ‘Arsy, yaitu salah satu ciptaan agung sebagai makhluk yang menjadi tempat bersemayam Dzat Yang Agung. Tanpa batas atau arah tertentu. Tidak ada yang dapat menolongmu kecuali Allah, juga tidak ada siapapun yang dapat menyelamatkanmu dari azab kecuali Allah.. Dengan begitu, apakah kalian tetap tidak mengambil pelajaran sehingga kalian dapat beriman?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah adalah Dzat yang menciptakan langit dan bumi serta apa yang ada di antara keduanya dalam enam hari, kemudian Dia bersemayam di atas ‘Arsy} meninggi dan naik di atas Arsy, persemayaman yang sesuai dengan kemuliaan dan keagunganNya {Tidak ada seorang pun pelindung dan pemberi syafaat bagi kalian selain Dia. Apakah kalian tidak mengerti} apakah kalian tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah memberitakan tentang kesempurnaan kekuasaanNya dengan menciptakan langit dan bumi dalam enam hari. Awal mulanya adalah Hari Ahad dan terakhir adalah Hari Jum’at, sekalipun sebenarnya Dia mampu menciptakannya hanya dalam sekejap waktu, akan tetapi Allah Maha Pengasih lagi Maha bijaksana. “Kemudian Dia bersemayam di atas Arasy,” yang merupakan atap seluruh makhluk, sebagai suatu tindakan bersemayam yang sesuai dengan keagunganNYa. “Tidak ada bagi kamu selain dariNya seorang penolong pun” yang menolong kalian dalam segala urusan kalian, kemudian Dia memberikan kepada kalian manfaat. “Dan tidak pula seorang pemberi syafa’at,” yang bisa memberikan syafaat kepada kalian jika siksaan diarahkan kepada kalian. “Maka apakah kamu tidak memperhatikan?” lalu kalian mengetahui bahwa sesungguhnya Pencipta bumi dan langit, yang bersemayam di atas Arasy yang agung, yang hanya Dia semata yang mengurusi kalian dan melindungi kalian, dan hanya bmilikNYa-lah semua syafaat, DIa-lah yang berhak mendapatkan segala macam bentuk ibadah!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 4: Allah mengabarkan bahwasanya Dia yang menciptakan langit dan bumi, dan juga menciptakan apa yang di antara keduanya dari angin dan selainnya pada enam masa, Dia yang maha kuasa menciptakan makhluk-Nya dalam sekejap waktu dan dengan itulah sebagai suatu hokum yang hanya Allah sajalah yang tahu, dari situ terdapat pengajaran dalam hal tidak tergesa-gesa dalam beribadah dan runut (berurutan), kemudian Allah beristiwa, yaitu tinggi di atas arsy, beristiwa sebagaimana yang Allah kehendaki; Dengan tanpa penyerupaan dan penafian. Ketahuilah wahai manusia, jika kalian menyelisihi perintah-perintah Allah dan larangan-larangan-Nya, maka tidak ada bagi kalian pelindung dari segala urusan kalian, tidak ada yang memberi syafa’at untuk terbebas dari adzab-Nya. Apakah kalian tidak mengambil pelajaran, kemudian membawa diri kalian untuk bertauhid kepada Allah dan ikhlas ibadah kepada-Nya saja ?."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Awalnya hari Ahad, dan akhirnya hari Jum’at. Allah Subhaanahu wa Ta'aala sesungguhnya mampu menciptakan dalam sekejap, akan tetapi Dia Mahalembut lagi Mahabijaksana. Bersemayam di atas 'Arsy adalah satu sifat Allah yang wajib kita imani, sesuai dengan kebesaran Allah dan keagungan-Nya. Yang mengurusi semua urusanmu, sehingga dia memberimu manfaat. Untuk menghindarkan azab-Nya ketika datang. Sehingga kamu mengetahui, bahwa yang menciptakan langit dan bumi, yang bersemayam di atas ‘arsy, yang sendiri mengatur dan mengurusmu dan yang memiliki semua syafaat, Dialah yang berhak diibadahi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 4",
    "description": "Nabi Muhammad diutus untuk mendakwahkan ajaran tauhid dan dibekali dengan bukti-bukti nyata tentang hal itu. Allah yang menciptakan langit dan bumi dan apa yang ada di antara keduanya tanpa contoh dan tidak pernah ada sebelumnya, dalam enam masa, meski sesungguhnya dia mampu menciptakannya dalam waktu sekejap. Hal ini bermaksud mendidik manusia bersabar dalam menangani semua urusan. Kemudian dia bersemayam di atas 'arsy yang tidak diketahui hakikatnya oleh selain Allah, namun wajib kita imani sesuai dengan kebesaran dan kesucian-Nya. Bagimu tidak ada seorang pun penolong maupun pemberi syafaat selain dia. Tanpa izin Allah, tidak ada yang mampu menolongmu, baik itu para rasul maupun orang-orang tertentu, meringankan azab atau bebanmu di akhirat. Maka, apakah kamu tidak memperhatikan dan mengambil pelajaran dari hal ini sehingga kamu beriman dan mengeesakan-Nya'5-6. Keteraturan alam membuktikan kekuasaan dan keesaan-Nya. Dia mengatur segala urusan makhluk-Nya dari langit, yakni alam malakut, ke bumi, yakni alam bumi, kemudian urusan itu dibawa naik oleh malaikat kepada-Nya dalam satu hari yang kadar atau lama-Nya adalah seribu tahun menurut perhitunganmu. Yang mengatur urusan demikian itu adalah tuhan yang mengetahui segala yang gaib dan yang nyata, yang mahaperkasa untuk mengazab siapa saja yang mengingkari dan mendustakan rasul-Nya, maha penyayang kepada hamba yang menaati-Nya."
  }
]