[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengatur urusan seluruh makhluk dari langit ke bumi, kemudian urusan dan pengaturan tersebut naik kepada Allah dari bumi ke langit pada hari yang kadarnya seribu tahun dari hari dunia yang dihitung manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Allah -Subḥānahu wa Ta'ālā- mengurusi segala urusan makhluk-Nya di langit dan di bumi, kemudian urusan itu naik kepada-Nya dalam satu hari yang ukuran lamanya sama dengan seribu tahun dalam perhitungan kalian -wahai manusia- di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah mengatur urusan seluruh makhluk dari langit ke bumi, kemudian amal perbuatan hamba-hamba-Nya diangkat kepadanya dalam satu hari. Naik dan turun ke bumi dalam satu hari ini setara dengan seribu tahun dalam perhitungan waktu kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. يُدَبِّرُ الْأَمْرَ مِنَ السَّمَآءِ إِلَى الْأَرْضِ (Dia mengatur urusan dari langit ke bumi) Yakni Allah mengatur urusan dengan ketetapan dan takdirnya dari langit ke bumi. Pendapat lain mengatakan maknanya adalah Allah mengatur urusan bumi dengan perantara langit, berupa para malaikat dan lainnya yang menurunkan ketetapan-ketetapannya ke bumi. ثُمَّ يَعْرُجُ إِلَيْهِ فِى يَوْمٍ كَانَ مِقْدَارُهُۥٓ أَلْفَ سَنَةٍ مِّمَّا تَعُدُّونَ(kemudian (urusan) itu naik kepada-Nya dalam satu hari yang kadarnya adalah seribu tahun menurut perhitunganmu) Yakni kemudian urusan itu naik kembali kepada Allah dalam satu hari yang masanya sama dengan seribu tahun. Pendapat lain mengatakan yakni Allah mengatur kejadian yang terjadi setiap harinya dengan mencantumkannya di Lauhul Mahfudh, kemudian para malaikat menurunkan ketetapan itu dan kembali kepada-Nya dalam masa yang setara dengan seribu tahun dalam hitungan dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Allah mengatur segala urusan hamba-Nya dari langit sampai bumi. Allah mengatur segala daur, kejadian, dan segala hal yang terjadi. Kemudian, pada hari kiamat Allah akan mengembalikan semua itu kepada-Nya. Semua itu adalah suatu ketetapan dan kepastian dalam Kemahatuan-Nya. Bilangan sehari di alam akhirat/hari kiamat seperti seribu tahun di dunia. Maksud dari bilangan hari di sini adalah lama waktu yang hanya Allah lah Yang Maha Tahu, satu hari di sisi Allah adalah seperti seribu tahun menurut orang-orang yang menghadapi hari akhirat/kiamat itu. Adapun hari di akhirat setara dengan lima ribu tahun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia mengatur segala urusan dari langit ke bumi, kemudian (urusan) itu naik kepadaNya} kemudian urusan itu naik kepadaNya {pada hari yang lamanya adalah seribu tahun menurut perhitungan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dia mengatur urusan” yang bersifat taqdiri dan urusan yang bersifat syar’I, semuanya Dia-lah semata yang Esa mengaturnya, pengaturan-pengaturan semua itu turun dari sisi DZat Yang Maharaja lagi Mahakuasa, “dari langit ke bumi,” lalu dengannya Dia membahagiakan dan menyengsarakan, menjadikan kaya dan menjadikan fakir, memuliakan dan menghinakan, menjadikan terhormat dan menjadikan terhina, mengangkat derajat suatu kaum dan mengugurkan martabat yang lain, dan Dia menurunkan rizki, “kemudian ia (urusan itu) naik kepadaNya” maksudnya, perintah (urusan) turun dari sisiNya dan naik kepadaNya, “dalam satu hari yang kadar lamanya adalah seribu tahun menurut perhitunganmu,” ia naik kepadaNya dan sampai kepadaNya dalam sesaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 5: Di antara sifat Allah adalah mengurusi urusan makhluk di langit dan di bumi dan menentukan aturannya hingga datangnya hari kiamat, kemudian para malaikat naik mengatur (urusan yang telah ditetapkan Allah), pada hari yang sehari seperti 1000 tahun dari hari-hari di dunia. Berkata Ustadz kami Syaikh Muhammad Al Amin Asy Syinqithi penulis tafsir Adhwaul Bayan yang pernah mengajar kami di kuliah syariah pelajaran tafsir : Enam masa di sini adalah sehari, yang dalam hitungan biasa kita adalah 1000 tahun, dan 1000 hari ini disebutkan dalam firman Allah dalam surat Al Haj : 47. Ia adalah satu hari yang sama dengan enam masa yang Allah ciptakan padanya langit dan bumi. Adapun 50 ribu tahun yang disebutkan dalam surat Al Ma’arij : 3, ia adalah hari kiamat yang berhubungan dengan orang-orang kafir, sebagaimana Allah berfirman dalam surat Al Furqan : 26. Dan terdapat pendapat lain yang mengatakan bahwa seluruh hari sama dengan ukuran hari pada hari kiamat, dengan menisbatkan pada jumlah yang tepat dan nisbat kepada orang-orang kafir sebagaimana dalam firman Allah dalam surat Al Mudatstsir : 9-10."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik qadari (taqdir) maupun syar’i (syariat-Nya), semuanya Dia yang mengaturnya. Pengaturan tersebut turun dari Allah Yang Maha Memiliki lagi Mahakuasa. Lalu dengan pengaturan-Nya Dia membahagiakan dan mencelakan, mengkayakan dan membuat fakir, memuliakan dan menghinakan, mengangkat suatu kaum dan merendahkannya, dan menurunkan rezeki. Para malaikat turun dengan membawa perintah Allah ke bumi, lalu naik dengan perintah-Nya. Dalam ayat ini terdapat dalil yang menunjukkan ketinggian Allah Subhaanahu wa Ta'aala di atas makhluk-Nya. Ibnu Jarir Ath Thabari berkata, “Perkataaan yang lebih dekat dengan kebenaran tentang hal itu menurutku adalah, pendapat orang yang mengatakan, bahwa maknanya adalah Dia mengatur urusan dari langit ke bumi, lalu naik kepada-Nya dalam sehari yang lamanya tentang naiknya urusan itu kepada-Nya dan turunnya ke bumi adalah seribu tahun menurut perhitunganmu dari hari-harimu; 500 tahun ketika turun dan 500 tahun ketika naik, karena hal itu makna yang paling tampak dan paling mirip dengan zahir ayat.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 5",
    "description": "5-6. Keteraturan alam membuktikan kekuasaan dan keesaan-Nya. Dia mengatur segala urusan makhluk-Nya dari langit, yakni alam malakut, ke bumi, yakni alam bumi, kemudian urusan itu dibawa naik oleh malaikat kepada-Nya dalam satu hari yang kadar atau lama-Nya adalah seribu tahun menurut perhitunganmu. Yang mengatur urusan demikian itu adalah tuhan yang mengetahui segala yang gaib dan yang nyata, yang mahaperkasa untuk mengazab siapa saja yang mengingkari dan mendustakan rasul-Nya, maha penyayang kepada hamba yang menaati-Nya"
  }
]