[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itulah Allah Yang Maha mencipta dan mengatur segala urusan alam semesta, yang mengetahui apa yang ghaib dari pandangan mata dan apa yang disimpan oleh dada dan disembunyikan dalam hati. Dia mengetahui apa yang disaksikan oleh mata, Dia Mahakuat lagi Mahaperkasa yang tidak dikalahkan, juga Maha Penyayang kepada hamba-hambaNYa yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Yang mengurusi semuanya itu adalah Żat Yang Maha Mengetahui yang gaib maupun yang nyata, tidak ada sesuatu pun dari keduanya yang luput dari-Nya, Maha Perkasa yang tidak ada seorang pun yang mampu mengalahkan-Nya, Yang membalas para musuh-musuh-Nya, dan Maha Penyayang terhadap hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-9. Sang Pencipta Yang Maha Agung ini Maha Mengetahui segala yang tidak diketahui makhluk dan tidak terlihat oleh mata. Dia Maha Perkasa dalam kerajaan-Nya dan Maha Pengasih terhadap makhluk-makhluk-Nya. Dia menciptakan setiap makhluk dengan sebaik-baik penciptaan; kemudian Dia menyempurnakan penciptaan manusia dan meniupkan ruh-Nya kepadanya setelah berlalu empat bulan dalam kandungan dengan mengutus malaikat yang bertugas meniupkan ruh tersebut. Hai manusia, Allah menciptakan pendengaran bagi kalian agar dapat mendengarkan suara, menciptakan penglihatan agar dapat melihat, dan menciptakan hati agar kalian dapat berfikir. Meskipun kalian mendapat berbagai kenikmatan ini namun rasa syukur kalian kepada Allah dengan perkataan dan perbuatan sangatlah sedikit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Yang demikian itu ialah Tuhan Yang Maha Mengatur, Yang Maha Tahu atas segala yang gaib, Maha Tahu atas segala yang tampak. Yang Maha Perkasa dan Maha Mengalahkan dan Tidak Terkalahkan. Maha Luas Rahmat-Nya kepada makhluk-makhluk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu adalah Tuhan yang mengetahui yang gaib dan yang nyata, Yang Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Yang demikian itu” yang telah menciptakan makhluk-makhluk yang sangat agung itu, yang bersemayam di atas Arasy yang agung dan sendirian mengatur dan mengurus segala urusan dalam kerajaanNYa, “ialah Yang mengetahui yang ghaib dan yang nyata, Dzat Yang Mahaperkasa lagi Maha Penyayang,” maka dengan keluasan ilmuNYa, kesempurnaan keperkasaanNya, keuniversalan rahmatNya, Dia mengadakannya dan meletakkan padanya berbagai manfaat sebanyak-banyaknya, dan sama sekali tidak sulit bagiNya mengurusinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 6: Ketahuilah wahai manusia, bahwa yang menciptakan seluruh makhluk ini adalah mulia, beristiwa di atas arsy, menyendiri dalam menjaga urusan alam semesta, Dia adalah Allah yang maha mengetahui setiap yang tersembunyi dari mata, dari kesaksian apa yang hamba-Nya amalkan, yang maha kuat dan mengalahkan, yang kuasa atas segala sesuatu dan menaklukkan segalanya, yang maha kasih sayang, luas kasih sayang-Nya kepada segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang menciptakan dan yang mengatur itu. Dengan keluasan ilmu-Nya, sempurnanya keperkasaan-Nya dan meratanya rahmat-Nya, Dia mewujudkan makhluk-Nya yang besar, menyimpan berbagai manfaat di dalamnya dan tidak sulit bagi-Nya mengaturnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 6",
    "description": "5-6. Keteraturan alam membuktikan kekuasaan dan keesaan-Nya. Dia mengatur segala urusan makhluk-Nya dari langit, yakni alam malakut, ke bumi, yakni alam bumi, kemudian urusan itu dibawa naik oleh malaikat kepada-Nya dalam satu hari yang kadar atau lama-Nya adalah seribu tahun menurut perhitunganmu. Yang mengatur urusan demikian itu adalah tuhan yang mengetahui segala yang gaib dan yang nyata, yang mahaperkasa untuk mengazab siapa saja yang mengingkari dan mendustakan rasul-Nya, maha penyayang kepada hamba yang menaati-Nya. 7. Pengatur urusan makhluk, yang maha mengetahui, mahaperkasa, dan maha penyayang itulah tuhan yang memperindah segala sesuatu yang dia ciptakan dengan sangat teliti dan yang memulai penciptaan nenek moyang manusia, yakni adam, dari tanah."
  }
]