[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah Allah yang menciptakan segala sesuatu dengan sebaik-baiknya dan Dia mengawali penciptaan manusia, yaitu Adam, dari tanah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Yang menyempurnakan penciptaan segala sesuatu, dan memulai penciptaan manusia dari tanah tanpa ada contoh sebelumnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. الَّذِىٓ أَحْسَنَ كُلَّ شَىْءٍ خَلَقَهُۥ ۖ (Yang membuat segala sesuatu yang Dia ciptakan sebaik-baiknya) Yakni Allah mencipatakan makhluk-makhluk-Nya dengan penuh ketelitian dan kesempurnaan, meski sebagian makhluk bentuk dan rupanya tidak begitu bagus, namun ia tercipta dengan penuh ketelitian dan kesempurnaan. وَبَدَأَ خَلْقَ الْإِنسٰنِ مِن طِينٍ (dan Yang memulai penciptaan manusia dari tanah) Yakni Allah menciptakan Adam dari tanah dengan bentuk yang baik dan indah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Yang Memperindah dan Menyempurnakan serta Menciptakan segala makhluk-Nya. Yang telah menciptakan Adam sebagai bapak manusia dari tanah, atau debu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang memperindah} yang menyempurnakan {segala sesuatu yang Dia ciptakan dan memulai penciptaan manusia} Adam {dari tanah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Yang membuat segala sesuatu yang Dia ciptakan sebaik-baiknya.” Maksudnya, setiap makhluk diciptakan oleh Allah, maka sesungguhnya Allah menciptakannya sebaik-baiknya, dan Dia menciptakannya dengan penciptaan yang sesuai dengannya dan serasi dengannya. Ini berlaku secara umum. Kemudian DIa menyebutkan secara khusus (penciptaan) manusia karena kemuliaan dan kelebihannya, seraya berfirman, “Dan Yang memulai penciptaan manusia dari tanah,” yaitu dengan menciptakan Adam, bapak seluruh umat manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 7: 7-9. Allah mengabarkan, bahwa Dia menetapkan penciptaan bagi makhluk seluruhnya, Allah juga mengabarkan bahwa Dialah yang mengawali penciptaan manusia, dengan menciptakan bapak kita yaitu Adam dari tanah. Kemudian Allah jadikan keberlangsungan para keturuan Adam itu dengan air yang lemah yang hina. Kemudian Allah sempurnakan ciptaannya dengan sebaik-baik bentuk, kemudian ditiupkan ruh, dan Allah jadikan bagi kalian nikmat penglihatan dan pendengaran untuk membedakan di antara suara-suara dan mengelan perseorangan dan melihat warna. Dan nikmat akal untuk membedakan antara kebaikan dan keburukan, dan beriringan dengan kenikmatan ini, maka sedikit manusiayang bersyukur atas nikmat pemberian-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga sesuai dan cocok. Disebutkan secara khusus manusia karena keutamaannya. Yaitu dengan menciptakan Adam ‘alaihis salam, bapak manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 7",
    "description": "Pengatur urusan makhluk, yang maha mengetahui, mahaperkasa, dan maha penyayang itulah tuhan yang memperindah segala sesuatu yang dia ciptakan dengan sangat teliti dan yang memulai penciptaan nenek moyang manusia, yakni adam, dari tanah. 8. Allah menciptakan adam dari tanah, kemudian dia menjadikan keturunannya dari sari pati air yang hina, yakni air mani."
  }
]