[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Dia menjadikan anak-anak keturunannya berkembang dari sperma yang lemah, encer, dan hina."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Kemudian menjadikan anak keturunannya setelahnya dari air yang lemah, yaitu mani."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. ثُمَّ جَعَلَ نَسْلَهُۥ (Kemudian Dia menjadikan keturunannya) Yakni anak cucunya. مِن سُلٰلَةٍ (dari saripati) Keturunan disebut dengan (الذرية) karena ia terpisah dari asalnya. مِّن مَّآءٍ مَّهِينٍ (air yang hina) Yakni dari air yang hina, yaitu air mani."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kemudian Yang Menciptakan anak cucunya dari susunan air mani yang dikeluarkan dari manusia, yaitu air yang hina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Dia menjadikan keturunannya} keturunannya {dari sari pati} dari air mani yang dilepaskan dari manusia {air yang hina} yang lemah lagi hina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Kemudian Dia menjadiakn keturunannya ,” anak keturunan Adam yang tumbuh berkembang “dari saripati air yang hina” yaitu mani yang menjijikkan lagi sangat lemah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 8: 7-9. Allah mengabarkan, bahwa Dia menetapkan penciptaan bagi makhluk seluruhnya, Allah juga mengabarkan bahwa Dialah yang mengawali penciptaan manusia, dengan menciptakan bapak kita yaitu Adam dari tanah. Kemudian Allah jadikan keberlangsungan para keturuan Adam itu dengan air yang lemah yang hina. Kemudian Allah sempurnakan ciptaannya dengan sebaik-baik bentuk, kemudian ditiupkan ruh, dan Allah jadikan bagi kalian nikmat penglihatan dan pendengaran untuk membedakan di antara suara-suara dan mengelan perseorangan dan melihat warna. Dan nikmat akal untuk membedakan antara kebaikan dan keburukan, dan beriringan dengan kenikmatan ini, maka sedikit manusiayang bersyukur atas nikmat pemberian-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 8",
    "description": "Allah menciptakan adam dari tanah, kemudian dia menjadikan keturunannya dari sari pati air yang hina, yakni air mani. 9. Setelah menciptakan adam dari tanah, kemudian dia menyempurnakan ciptaan-Nya secara fisik dan setelah itu meniupkan roh ciptaan-Nya ke dalam tubuh-Nya dan jadilah ia ciptaan Allah yang terbaik. Dia juga melengkapi ciptaannya dengan menjadikan pendengaran, penglihatan, dan hati atau akal bagimu supaya kamu dapat mendengar nasihat agama, melihat tanda kebesaran Allah, dan merenungkan ciptaan-Nya, yang dengan itu semua kamu beriman dan mengesakan-Nya. Namun, sedikit sekali di antara kamu yang mau bersyukur."
  }
]