[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Allah menyempurnakan penciptaan manusia dan membaguskannya, serta Dia meniupkan ruh (ciptaan) Nya kepadanya dengan mengutus malaikat yang meniupkan ruh kepadanya, Dia menciptakan untuk kalian (wahai manusia) pendengaran dan penglihatan yang dengannya kalian membedakan suara-suara, warna-warna, dzat-dzat dan orang-orang, dan nikmat akal yang dengannya kalian membedakan antara yang baik dan yang buruk, yang berguna dan yang berbahaya, namun kalian tidak banyak bersyukur kepada Tuhan kalian atas nikmat-nikmatNya kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Kemudian Dia menyempurnakan penciptaannya dan meniupkan kepadanya dari ruh-Nya dengan memerintahkan kepada Malaikat yang diwakilkan untuk meniupkan ruh, kemudian menjadikan bagi kalian -wahai manusia- pendengaran yang kalian gunakan mendengar, penglihatan yang kalian gunakan melihat dan hati yang kalian gunakan berfikir. Sedikit sekali dari kenikmatan yang diberikan oleh Allah kepada kalian ini yang kalian syukuri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. ثُمَّ سَوَّىٰهُ (Kemudian Dia menyempurnakan) Yakni menyempurnakan manusia yang Dia ciptakan dari tanah, yaitu Adam, kemudian menyerasikan bentuknya dan menyesuaikan anggota tubuhnya. وَنَفَخَ فِيهِ مِن رُّوحِهِۦ ۖ( dan meniupkan ke dalamnya roh (ciptaan)-Nya) Allah menisbatkan ruh ini kepada diri-Nya sebagai bentuk pemuliaan bagi ruh ini. وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصٰرَ وَالْأَفْـِٔدَةَ ۚ( dan Dia menjadikan bagi kamu pendengaran, penglihatan dan hati) Sebagai penyempurna kenikmatan bagi kalian dan pelengkap penciptaan kalian, sehingga terkumpul bagi kalian berbagai kenikmatan, sehingga kalian dapat mendengar, melihat, berfikir, dan memahami. قَلِيلًا مَّا تَشْكُرُونَ ((tetapi) kamu sedikit sekali bersyukur) Ini adalah penjelasan tentang keingkaran mereka terhadap kenikmatan Allah, dan keengganan mereka untuk mensyukurinya kecuali pada beberapa kesempatan saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kemudian Allah menyusun dan menguatkannya sehingga menjadi manusia yang sempurna, dan meniupkan ruh kepadanya. Allah meniupkan ruh itu sebagai pemuliaan. Allah juga menciptakan pendengaran dan penglihatan,serta hati agar manusia bisa mendengar, melihat dan berfikir. Namun kalian hanya sedikit sekali dalam menyukuri berbagai nikmat Allah itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Dia menyempurnakannya} menyempurnakan penciptaan manusia menjadi utuh {dan meniupkan ke dalamnya ruh (ciptaan)Nya. Dia menjadikan pendengaran, penglihatan, dan hati nurani untuk kalian. Sedikit sekali kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Kemudian Dia menyempurnakannya,” dengan dagingnya, anggota-anggota tubuhnya, otot-ototnya, pembuluh-pembuluh darahnya, memperindah ciptaannya, dan menempatkan setiap anggota badan darinya pada tempat yang tidak layak untuk selain itu, “dan meniupkan ke dalamnya dari ruhNYa” dengan cara mengutus seorang malaikat, lalu dia meniupkan ruh padanya, maka dia pun menjadi hewan (Makhluk hidup) dengan izin Allah, setelah sebelumnya merupakan benda mati, “dan Dia menjadikan bagi kamu pendengaran, penglihatan,” maksudnya, Dia terus menganugerahkan kepada kalian berbagai hal yang berguna sedikit demi sedikit hingga menganugerahkan kalian pendengaran dan penglihatan, “dan hati, tetapi kamu sedikit sekali bersyukur” kepada yang telah menciptakan kalian dan memberi rupa kepada kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Sajdah ayat 9: 7-9. Allah mengabarkan, bahwa Dia menetapkan penciptaan bagi makhluk seluruhnya, Allah juga mengabarkan bahwa Dialah yang mengawali penciptaan manusia, dengan menciptakan bapak kita yaitu Adam dari tanah. Kemudian Allah jadikan keberlangsungan para keturuan Adam itu dengan air yang lemah yang hina. Kemudian Allah sempurnakan ciptaannya dengan sebaik-baik bentuk, kemudian ditiupkan ruh, dan Allah jadikan bagi kalian nikmat penglihatan dan pendengaran untuk membedakan di antara suara-suara dan mengelan perseorangan dan melihat warna. Dan nikmat akal untuk membedakan antara kebaikan dan keburukan, dan beriringan dengan kenikmatan ini, maka sedikit manusiayang bersyukur atas nikmat pemberian-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menjadikannya segumpal darah, lalu menjadi segumpal daging, lalu Dia meniupkan ruh ke dalamnya. Yaitu dengan mengirimkan seorang malaikat, lalu meniupkan ruh ke dalamnya yang sebelumnya sebagai benda mati, sehingga dengan izin Allah, jadilah ia makhluk hidup. Yakni Dia senantiasa memberikan kepadamu berbagai manfaat dengan proses, sehingga Dia memberikan pendengaran, penglihatan dan hati. Kepada Allah yang telah menciptakan kamu dan membentukmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Sajdah Ayat 9",
    "description": "Setelah menciptakan adam dari tanah, kemudian dia menyempurnakan ciptaan-Nya secara fisik dan setelah itu meniupkan roh ciptaan-Nya ke dalam tubuh-Nya dan jadilah ia ciptaan Allah yang terbaik. Dia juga melengkapi ciptaannya dengan menjadikan pendengaran, penglihatan, dan hati atau akal bagimu supaya kamu dapat mendengar nasihat agama, melihat tanda kebesaran Allah, dan merenungkan ciptaan-Nya, yang dengan itu semua kamu beriman dan mengesakan-Nya. Namun, sedikit sekali di antara kamu yang mau bersyukur. 10. Allah mampu menciptakan manusia dari tidak ada dan mampu pula membangkitkannya kembali. Namun, orang kafir tetap pada pendiriannya dalam mengingkari hari kebangkitan. Dan dengan nada mengejek mereka berkata, 'apakah apabila kami telah mati, hancur, dan lenyap di dalam tanah, kami akan dibangkitkan kembali dan berada dalam ciptaan yang baru, lalu kami dimintai pertanggungjawaban atas perbuatan kami' jika demikian, alangkah rugi kami. ' mereka tidak mampu memahami keniscayaan hari kebangkitan karena menggunakan tolok ukur kekuatan manusia, bukan kemahakuasaan Allah yang telah menciptakan mereka dari tidak ada. Tidak hanya mengingkari kuasa-Nya, bahkan mereka pun mengingkari hari pertemuan mereka dengan tuhannya untuk menjalani hisab dan menerima balasan."
  }
]