[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Terkutuklah orang-orang yang berdusta yang menyangka dengan sangkaan yang tidak benar, yaitu orang-orang yang lalai dan berkubang dalam gelombang kekafiran dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Terlaknatlah para pendusta yang berbicara tentang Al-Qur`ān dan tentang Nabi mereka sebagaimana yang telah mereka katakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-14. Terlaknatlah orang-orang yang berdusta terhadap Allah yang berada dalam kesesatan yang paling dalam, tenggelam dalam kelalaian dan kebimbangan; ketika mereka berkata dengan nada menghina: “Kapan akan terjadi hari pembalasan?” Pada hari pembalasan mereka akan masuk ke dalam neraka Jahannam, dan akan dibakar di dalamnya. Akan dikatakan kepada mereka: “Rasakanlah azab neraka yang dahulu di dunia ingin segera kalian dapatkan untuk mengolok dan menghinanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. قُتِلَ الْخَرّٰصُونَ (Terkutuklah orang-orang yang banyak berdusta) Yakni terlaknatlah orang-orang yang ragu terhadap janji ada ancaman Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Terkutuklah para pendusta, yaitu orang-orang yang ucapannya berubah-ubah dan meragukan janji-janji Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Terkutuklah orang-orang yang banyak berdusta} terlaknatlah orang-orang yang banyak berdusta"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 10: 10-11. Allah melaknat orang-orang yang mendustakan yang ragu-ragu dalam janji Allah dan ancaman-Nya bagi pemiliki ucapan yang berselisih; Yang mereka dalam kelalaian dan buta serta bodoh dari urusan akhirat, dan mereka lalai dari sesuatu yang sia-sia, yang memalingkan mereka dari ditimpakan adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang berbeda-beda pendapat itu. Atau mereka yang berdusta terhadap Allah, mengingkari ayat-ayat-Nya, menyibukkan dengan hal yang batil untuk menolak kebenaran dan berkata terhadap Allah apa yang mereka tidak ketahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 10",
    "description": "10-11. Binasa dan terkutuklah orang-orang yang banyak berdusta dan sering berbicara dengan tanpa dasar sehingga menyesatkan orang, mereka yang berperilaku demikian yaitu orang-orang yang terbenam dalam ke-sesatan, kebodohan dan sering kali berada dalam kelalaian, sehingga tidak memperhatikan bukti-bukti tentang kekuasaan Allah dan petunjuk-petunjuk-Nya"
  }
]