[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Terkutuklah orang-orang yang berdusta yang menyangka dengan sangkaan yang tidak benar, yaitu orang-orang yang lalai dan berkubang dalam gelombang kekafiran dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Yaitu orang-orang yang berada dalam kebodohan, lalai dari alam akhirat, tidak peduli dengannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. الَّذِينَ هُمْ فِى غَمْرَةٍ سَاهُونَ ((yaitu) orang-orang yang terbenam dalam kebodohan yang lalai) Yakni mereka dalam keingkaran dan keraguan serta lalai dari apa yang akan mendatangi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Mereka itu berada dalam kebodohan yang mengacaukan mereka. Tidak akan ada kemudahan dalam apa yang diperintahkan untuk mereka dan apa menunggu mereka di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang terbenam} dalam kebodohan {lagi lalai} lalai dari perkara akhirat"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 11: 10-11. Allah melaknat orang-orang yang mendustakan yang ragu-ragu dalam janji Allah dan ancaman-Nya bagi pemiliki ucapan yang berselisih; Yang mereka dalam kelalaian dan buta serta bodoh dari urusan akhirat, dan mereka lalai dari sesuatu yang sia-sia, yang memalingkan mereka dari ditimpakan adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 11",
    "description": "10-11. Binasa dan terkutuklah orang-orang yang banyak berdusta dan sering berbicara dengan tanpa dasar sehingga menyesatkan orang, mereka yang berperilaku demikian yaitu orang-orang yang terbenam dalam ke-sesatan, kebodohan dan sering kali berada dalam kelalaian, sehingga tidak memperhatikan bukti-bukti tentang kekuasaan Allah dan petunjuk-petunjuk-Nya. 12. Para pembohong yang lalai sehingga mereka dikutuk itu memperolok-olokkan dakwah rasulullah dan cenderung mengingkarinya. Oleh karena itu mereka bertanya yang tujuannya adalah untuk mengejek dan bukan karena tidak tahu. Mereka berkata, 'kapankah datangnya hari pembalasan yang selalu engkau ungkapkan itu''."
  }
]