[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang berdusta itu bertanya dengan nada pengingkaran dan pendustaan, “Kapan hari hisab dan pembalasan terjadi.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Mereka bertanya, “Kapankah hari pembalasan itu?” Sementara mereka tidak mempersiapkan untuk hari itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يَسْـَٔلُونَ أَيَّانَ يَوْمُ الدِّينِ (mereka bertanya: “Bilakah hari pembalasan itu?”) Sebagai pengingkaran dan olokan dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Mereka bertanya kepada Nabi dengan pertanyaan yang berisi ejekan dan sangkalan: “Kapankah hari kiamat itu?” {Ayyaana} adalah isim istifham untuk menanyakan waktu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka bertanya,“Kapankah hari pembalasan itu”} kapankan hari pembalasan dan perhitungan itu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 12: 12-14. Allah mengabarkan bahwa mereka orang-orang yang mendustakan, mereka bertanya dengan pertanyaan yang jauh panggang dan pendustaan dengan berkata : Kapan datang hati pembalasan yang kami akan mendapatkannya wahai Muhammad ﷺ ?, Maka Allah menjawabkan untuk Nabi-Nya ﷺ: Sungguh hari pembalasan adalah hari dimana mereka dimasukkan ke dalam jahannam dan mereka dibakar dan diadzab di dalamnya. Kemudian Allah berkata kepada mereka para pendusta : Rasakanlah adzab ini yang kalian terburu-buru untuk mencela dan sombong dan menyangkan bahwa hari itu tidak mungkin datang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Secara ragu-ragu dan mendustakan dan menganggap bahwa hal itu mustahil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 12",
    "description": "Para pembohong yang lalai sehingga mereka dikutuk itu memperolok-olokkan dakwah rasulullah dan cenderung mengingkarinya. Oleh karena itu mereka bertanya yang tujuannya adalah untuk mengejek dan bukan karena tidak tahu. Mereka berkata, 'kapankah datangnya hari pembalasan yang selalu engkau ungkapkan itu''13. Dalam rangka merespon olok-olok mereka, maka Allah berkata kepada nabi Muhammad untuk menjawab bahwa hari pembalasan itu akan terjadi pada hari ketika mereka diazab di dalam api neraka sebagai hukuman dari keingkaran mereka terhadap ajaran-Nya."
  }
]