[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Di hari pembalasan, yaitu hari di mana mereka akan diazab dengan dibakar di dalam api neraka, kepada mereka dikatakan, “Rasakanlah azab yang kalian minta disegerakan di dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dikatakan kepada mereka, “Rasakanlah siksa kalian! Inilah hal yang pernah kalian minta untuk disegerakan ketika kalian diperingatkan tentangnya dengan mengolok-oloknya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. ذُوقُوا۟ فِتْنَتَكُمْ (“Rasakanlah azabmu itu) Yakni akan dikatakan kepada mereka “Rasakanlah azab kalian.” هٰذَا الَّذِى كُنتُم بِهِۦ تَسْتَعْجِلُونَ (Inilah azab yang dulu kamu minta untuk disegerakan”) Yakni inilah yang kalian minta untuk disegerakan sebagai bentuk olokan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dikatakan kepada mereka: “Nikmatilah azab kalian. Inilah yang kalian tunggu-tunggu kejadiannya saat berada di dunia dengan mengejek (nabi)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Rasakanlah azab kalian} azab kalian {Inilah azab yang dahulu kalian minta agar disegerakan”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 14: 12-14. Allah mengabarkan bahwa mereka orang-orang yang mendustakan, mereka bertanya dengan pertanyaan yang jauh panggang dan pendustaan dengan berkata : Kapan datang hati pembalasan yang kami akan mendapatkannya wahai Muhammad ﷺ ?, Maka Allah menjawabkan untuk Nabi-Nya ﷺ: Sungguh hari pembalasan adalah hari dimana mereka dimasukkan ke dalam jahannam dan mereka dibakar dan diadzab di dalamnya. Kemudian Allah berkata kepada mereka para pendusta : Rasakanlah adzab ini yang kalian terburu-buru untuk mencela dan sombong dan menyangkan bahwa hari itu tidak mungkin datang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka meminta disegerakan sebagai olok-olokkan terhadapnya. Maka pada hari itu, mereka bersenang-senang dengan berbagai macam azab dan siksaan, dengan belenggu dan rantai, dengan kemurkaan dan bencana wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 14",
    "description": "Setelah para pembohong mendapatkan hukumannya, maka kemudian dikatakan kepada mereka, 'rasakanlah azabmu yang ditimpakan kepada kamu ini. Inilah azab yang dahulu ketika hidup di dunia tidak kamu percayai dan minta agar disegerakan datangnya. '15. Pada ayat yang lalu dijelaskan tentang balasan bagi orang-orang yang durhaka, maka pada ayat-ayat berikut ini diterangkan tentang ganjaran bagi mereka yang bertakwa. 'sesungguhnya orang-orang yang bertakwa dan selalu melaksanakan perintah-Nya dan menjauhi larang-an-Nya akan diberi ganjaran yang baik dan berada di dalam taman-taman, yaitu surga yang indah, menyenangkan, dan selain itu mereka juga berada di mata air yang jernih lagi sejuk menyegarkan."
  }
]