[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Sesungguhnya orang-orang yang bertakwa kepada Allah berada di dalam surga-surga yang besar, dan mata-mata air yang mengalir. Allah memberi mereka segala keinginan mereka dari berbagai macam kenikmatan. Mereka menerimanya dengan penuh kerelaan, jiwa mereka berbahagia. Sesungguhnya mereka sebelum mendapatkan nikmat ini adalah orang-orang berbuat baik di dunia dengan amal-amal shalih mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya orang-orang yang bertakwa kepada Rabb mereka dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya pada hari Kiamat nanti mereka berada di taman-taman Surga dan mata air yang mengalir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-19. Orang-orang yang takut kepada Allah dengan menjalankan hukum-hukum-Nya maka mereka akan berada dalam surga-surga yang hijau dan mata air, mereka mendapat kedudukan yang mulia dari Allah. Ketika di dunia mereka adalah orang-orang yang baik dalam perkataan dan perbuatannya; di antaranya mereka hanya tidur di malam hari sebentar saja, beristighfar kepada Allah sebelum subuh, dan memberi infak bagi orang-orang yang membutuhkan baik itu bagi mereka yang meminta-minta atau yang menjaga kehormatan dengan tidak meminta-minta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya orang-orang yang menaati perintah Allah dan menjauhi kemaksiatan berada di taman-taman yang di dalamnya ada banyak mata air yang mengalir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang bertakwa itu berada dalam taman-taman} taman-taman {dan mata air"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 15: 15-16. Ketika Allah menyebutkan kondisi penghuni nereka, maka Allah juga sebutkan kondisi penghuni surga; Allah mengabarkan bahwa mereka yang bertakwa kepada Allah dari makhluknya, berada di kebun-kebun yang di dalamnya ada mata air yang mengalir yang tidak pernah mungkin habis. Allah menjelaskan bahwa mereka adalah orang-orang yang ridha atas apa yang diberikan oleh Rabbnya dari kemulian dan kenikmatan, karena mereka di dunia sebelum masuk ke dalam suga adalah orang-orang yang ikhlas dalam keimanan dan ketaatan mereka kepada Tuhan mereka. Dan mereka adalah orang-orang yang banyak beramal shalih dan ikhlas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menyebutkan pahala orang-orang yang bertakwa dan menyebutkan amal mereka sehingga membawa mereka ke tempat yang menyenangkan itu. Yaitu orang-orang yang takwa menjadi syiarnya dan taat kepada Allah menjadi selimutnya. Yang dipenuhi dengan berbagai macam pohon dan buah-buahan baik yang ada persamaannya dengan di dunia maupun yang tidak ada, dimana mata belum pernah melihatnya, telinga mereka belum pernah mendengarnya dan belum pernah terlintas di hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 15",
    "description": "Pada ayat yang lalu dijelaskan tentang balasan bagi orang-orang yang durhaka, maka pada ayat-ayat berikut ini diterangkan tentang ganjaran bagi mereka yang bertakwa. 'sesungguhnya orang-orang yang bertakwa dan selalu melaksanakan perintah-Nya dan menjauhi larang-an-Nya akan diberi ganjaran yang baik dan berada di dalam taman-taman, yaitu surga yang indah, menyenangkan, dan selain itu mereka juga berada di mata air yang jernih lagi sejuk menyegarkan. 16. Mereka sangat menikmati ganjaran ini dan mengambil apa yang diberikan tuhan kepada mereka. Orang-orang yang bertakwa itu mendapat anugerah yang membahagiakan ini karena sesungguhnya mereka sebelum itu, yakni saat kehidupannya di dunia adalah orang-orang yang selalu tekun beribadah dan berbuat baik kepada sesama dengan tujuan untuk mendapatkan rida-Nya."
  }
]