[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Sesungguhnya orang-orang yang bertakwa kepada Allah berada di dalam surga-surga yang besar, dan mata-mata air yang mengalir. Allah memberi mereka segala keinginan mereka dari berbagai macam kenikmatan. Mereka menerimanya dengan penuh kerelaan, jiwa mereka berbahagia. Sesungguhnya mereka sebelum mendapatkan nikmat ini adalah orang-orang berbuat baik di dunia dengan amal-amal shalih mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Sambil mengambil balasan indah yang diberikan kepada mereka oleh Rabb mereka. Sesungguhnya sebelum pembalasan yang indah ini mereka adalah orang-orang yang berbuat baik di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. ءَاخِذِينَ مَآ ءَاتَىٰهُمْ رَبُّهُمْ ۚ (sambil menerima segala pemberian Rabb mereka) Berupa kebaikan dan kemuliaan. إِنَّهُمْ كَانُوا۟ قَبْلَ ذٰلِكَ مُحْسِنِينَ(Sesungguhnya mereka sebelum itu di dunia adalah orang-orang yang berbuat kebaikan) Yakni sebab mereka ketika di dunia adalah orang-orang yang membaikkan amalan mereka dan senantiasa merasa diawasi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Mereka menerima dan meridhai apa yang diberikan oleh Tuhan mereka berupa pahala, kebaikan, dan kemuliaan, Karena sesungguhnya mereka saat di dunia adalah orang-orang yang memperbaiki amal ibadah mereka. { Innahum} bermakna Li annahum, Sebagai alasan bahwa mereka pantas menerima hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka dapat mengambil apa saja yang dianugerahkan Tuhan kepada mereka} apa yang diberikan kepada mereka {Sesungguhnya mereka sebelum itu adalah orang-orang yang berbuat kebaikan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 16: 15-16. Ketika Allah menyebutkan kondisi penghuni nereka, maka Allah juga sebutkan kondisi penghuni surga; Allah mengabarkan bahwa mereka yang bertakwa kepada Allah dari makhluknya, berada di kebun-kebun yang di dalamnya ada mata air yang mengalir yang tidak pernah mungkin habis. Allah menjelaskan bahwa mereka adalah orang-orang yang ridha atas apa yang diberikan oleh Rabbnya dari kemulian dan kenikmatan, karena mereka di dunia sebelum masuk ke dalam suga adalah orang-orang yang ikhlas dalam keimanan dan ketaatan mereka kepada Tuhan mereka. Dan mereka adalah orang-orang yang banyak beramal shalih dan ikhlas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa maksudnya, bahwa penghuni surga telah diberikan oleh Allah Subhaanahu wa Ta'aala semua yang mereka inginkan berupa aneka macam kenikmatan, lalu mereka mengambilnya dengan ridha, sejuk mata mereka, dan jiwa mereka bergembira. Mereka tidak meminta lagi gantinya dan tidak ingin pindah darinya. Bisa juga maksudnya, bahwa itulah sifat orang-orang yang bertakwa di dunia, yaitu mereka mengambil apa yang diberikan Tuhan mereka berupa perintah dan larangan; mereka menerimanya dengan lapang dada dan senang sambil tunduk kepada perintah Allah dengan melaksanakannya secara sempurna dan menjauhi larangan-Nya secara sempurna. Beban perintah dan larangan adalah pemberian yang paling utama yang haknya adalah diterima dengan disyukuri dan ditaati. Namun maksud pertama lebih dekat dengan susunan kalimatnya. Yakni sebelum masuk ke surga. Mereka berbuat ihsan, baik dalam beribadah kepada Allah, maupun dalam bergaul dengan hamba-hamba Allah. Contoh berbuat ihsan dalam beribadah adalah mengerjakan ibadah itu baik shalat, puasa, hajji maupun ibadah-ibadah lainnya dengan benar yakni dengan menyempurnakan syarat dan rukunnya, kemudian memperhatikan sunnah-sunnah dan adabnya, dan hal ini tidak akan sempurna kecuali apabila seorang hamba memiliki rasa muraqabah (merasa diawasi Allah) yang tinggi sampai seakan-akan ia melihat-Nya atau minimal merasakan bahwa dirinya sedang diperhatikan Allah. Dengan cara inilah akan tercapai ihsan dalam beribadah. Sedangkan contoh ihsan dalam bergaul dengan hamba-hamba Allah adalah: a. Kepada kedua orang tuanya, yaitu dengan berbakti sebaik mungkin kepada keduanya. b. Kepada kerabat (saudara dekat), yaitu dengan berbuat baik dan bersikap sayang kepada mereka, berbuat yang menyenangkan mereka dan menghindarkan diri dari menyakiti mereka. c. Kepada anak yatim, yaitu dengan menjaga harta mereka, menjaga hak-hak mereka, mendidik mereka, tidak menyakiti mereka, ceria di hadapan mereka dan mengusap kepala mereka. d. Kepada orang miskin, yaitu dengan memenuhi kebutuhan mereka, menutupkan aurat mereka, mendorong orang lain memberi makan mereka, tidak mencela kehormatan mereka, tidak menghina dan tidak menimpakan hal yang buruk atau hal yang tidak disukai mereka. e. Kepada pelayan, yaitu dengan tidak memaksanya dan tidak membebaninya dengan beban yang tidak disanggupinya, mengupahnya dsb. Jika sebagai pembantu rumah tangga, maka dengan memberinya makanan seperti yang dimakannya dan memberinya pakaian seperti yang dipakainya. f. Kepada semua orang, yaitu dengan berkata-kata yang lembut, bergaul yang baik tentunya dengan diiringi amr ma’ruf dan nahy mungkar, membimbing yang tersesat, mengajarkan orang yang tidak tahu, mengakui hak mereka dan menjaga diri dari mengerjakan yang bisa menyakiti dan mengganggu mereka. g. Kepada amalan kita, yaitu dengan memperbagus amalan, mengosongkannya dari sifat ghisy (keinginan untuk menipu orang lain) dsb. Di antara ihsan dalam beribadah kepada Allah, yang paling utama adalah shalat malam, dimana hal ini menunjukkan keikhlasan dan sejalannya antara hati dengan lisan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 16",
    "description": "Mereka sangat menikmati ganjaran ini dan mengambil apa yang diberikan tuhan kepada mereka. Orang-orang yang bertakwa itu mendapat anugerah yang membahagiakan ini karena sesungguhnya mereka sebelum itu, yakni saat kehidupannya di dunia adalah orang-orang yang selalu tekun beribadah dan berbuat baik kepada sesama dengan tujuan untuk mendapatkan rida-Nya. 17-18. Mereka, orang-orang yang bertakwa itu, sedikit sekali tidur pada waktu malam, sebagian waktunya dipergunakan untuk melakukan kebaikan dan ibadah kepada tuhannya, dan pada akhir malam, setelah melaksanakan salat tahajud mereka melanjutkan dengan zikir dan memohon ampunan kepada Allah yang maha pengampun kepada semua makhluk-Nya yang bertobat."
  }
]