[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Orang-orang yang berbuat baik itu, dulu saat di dunia mereka hanya sedikit tidur di malam hari, mereka shalat beribadah kepada Tuhan mereka, dan di akhir malam menjelang shubuh, mereka meminta ampunan kepada Allah dari dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan pada waktu sahur mereka meminta ampunan kepada Allah dari dosa-dosa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ (Dan selalu memohonkan ampunan diwaktu pagi sebelum fajar) Al-Hasan berkata: yakni mereka mendirikan shalat sampai waktu sahur, kemudian mereka mengisi waktu sahur dengan beristighfar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17-18. Mereka hanya tidur sedikit dan banyak shalat malam. Dan di akhir malam sebelum fajar, mereka meminta ampunan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan pada akhir malam} akhir malam {mereka memohon ampunan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 18: 17-19. Allah kemudian menjelaskan sesuatu yang nampak dari kebaikan mereka, Allah mengabarkan bahwa mereka sedikit tidur di malam hari untuk tahajjud, mereka juga memperbanyak berdzikir, doa dan momohon ampun ketika mereka sahur, dan mereka juga mewajibkan atas diri-diri mereka untuk bersedekah kepada orang-orang yang membutuhkan, yang meminta-minta kepada manusia, dan bagi mereka yang malu untuk meminta. Mereka melakukan ini semua karena ingin mendekatkan diri kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pada waktu sahur; menjelang fajar. Mereka memanjangkan shalatnya sampai waktu sahur, lalu mereka duduk di akhir shalat malam mereka dengan meminta ampunan kepada Allah Ta’ala atas dosa-dosanya. Meminta ampunan kepada Allah Subhaanahu wa Ta'aala di waktu sahur memiliki keutamaan daripada waktu selainnya sebagaimana Allah Subhaanahu wa Ta'aala menyifati orang-orang yang beriman dan bertakwa itu dengan melakukan permohonan ampun di waktu sahur (lihat surah Ali Imran: 15-17)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 18",
    "description": "17-18. Mereka, orang-orang yang bertakwa itu, sedikit sekali tidur pada waktu malam, sebagian waktunya dipergunakan untuk melakukan kebaikan dan ibadah kepada tuhannya, dan pada akhir malam, setelah melaksanakan salat tahajud mereka melanjutkan dengan zikir dan memohon ampunan kepada Allah yang maha pengampun kepada semua makhluk-Nya yang bertobat. 19. Orang-orang yang bertakwa itu selalu taat dalam melaksanakan ajaran Allah, dan mereka juga menyadari bahwa pada harta benda yang mereka miliki sesungguhnya ada hak yang mesti dikeluarkan, baik berupa zakat maupun sedekah, untuk orang miskin yang meminta bantuan dan orang miskin yang tidak mengulurkan tangan untuk meminta kepada orang lain."
  }
]