[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada harta mereka terdapat hak wajhib dan sunnah untuk orang-orang yang membutuhkan yang meminta kepada orang-orang dan orang-orang yang membutuhkan tetapi tidak meminta-minta karena malu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan di dalam harta mereka terdapat hak (jatah) -mereka berderma dengannya- bagi orang yang meminta dan bagi orang yang tidak meminta dari siapa saja yang terhalang rezekinya karena sebab apa pun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَفِىٓ أَمْوٰلِهِمْ حَقٌّ لِّلسَّآئِلِ وَالْمَحْرُومِ (Dan pada harta-harta mereka ada hak untuk orang miskin yang meminta dan orang miskin yang tidak mendapat bagian) Makna (السائل) yakni orang fakir yang tidak memiliki apapun, kemudian meminta bantuan dari orang lain. Sedangkan (المحروم) yakni orang yang tidak mampu bekerja, namun dia menolak untuk meminta-minta, sehingga dianggap orang lain sebagai orang yang tidak butuh bantuan, sehingga tidak ada orang yang bersedekah kepadanya. Pendapat lain mengatakan ia adalah orang yang tertimpa musibah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Di dalam harta mereka ada bagian untuk orang fakir yang tidak memiliki apapun dan orang lemah yang tidak mampu melakukan usaha apapun atau orang fakir yang lemah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada harta benda mereka ada hak} bagian yang pasti {bagi orang yang meminta} orang fakir yang menampakkan kefakirannya dengan meminta {dan yang tidak meminta} orang fakir yang dilarang untuk diberi sedekah karena anggapan orang-orang bahwa dia tidak membutuhkan karena dia tidak mau menampakkan kefakirannya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 19: 17-19. Allah kemudian menjelaskan sesuatu yang nampak dari kebaikan mereka, Allah mengabarkan bahwa mereka sedikit tidur di malam hari untuk tahajjud, mereka juga memperbanyak berdzikir, doa dan momohon ampun ketika mereka sahur, dan mereka juga mewajibkan atas diri-diri mereka untuk bersedekah kepada orang-orang yang membutuhkan, yang meminta-minta kepada manusia, dan bagi mereka yang malu untuk meminta. Mereka melakukan ini semua karena ingin mendekatkan diri kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang wajib maupun yang sunat. Karena menjaga diri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 19",
    "description": "Orang-orang yang bertakwa itu selalu taat dalam melaksanakan ajaran Allah, dan mereka juga menyadari bahwa pada harta benda yang mereka miliki sesungguhnya ada hak yang mesti dikeluarkan, baik berupa zakat maupun sedekah, untuk orang miskin yang meminta bantuan dan orang miskin yang tidak mengulurkan tangan untuk meminta kepada orang lain. 20-21. Allah adalah pencipta alam semesta. Tanda-tanda kekuasaan dan kebesaran-Nya terdapat di seluruh penjuru langit, dan selain itu di bumi juga terdapat tanda-tanda kebesaran-Nya. Namun semuanya itu hanya dapat dipahami bagi orang-orang yang yakin, dan di samping itu, sesungguhnya keagungan Allah juga banyak ditemukan pada dirimu sendiri. Sesudah dipahami semua tanda-tanda itu, maka apakah kamu tetap lalai dan tidak memperhatikan semua yang dapat disaksikan itu'."
  }
]