[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dalam penciptaan diri kalian juga terkandung bukti atas Kuasa Allah dan pelajaran yang mengisyaratkan kepada keesaan Pencipta kalian, dan bahwa tidak ada tuhan bagi kalian yang berhak disembah selainNya. Apakah kalian lalai darinya, sehingga kalian tidak melihatnya, lalu mengambil pelajaran darinya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan pada diri kalian -wahai manusia- terdapat bukti-bukti kekuasaan Allah, apakah kalian tidak memperhatikan untuk mengambil pelajaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَفِىٓ أَنفُسِكُمْ ۚ (dan (juga) pada dirimu sendiri) Yakni pada diri kalian sendiri juga terdapat tanda-tanda yang menunjukkan keesaan Allah dan kebenaran apa yang didatangkan oleh rasulullah. Allah menciptakan mereka dengan bentuk yang begitu menakjubkan, yang terdiri dari daging, darah, tulang, anggota badan, panca indra, pembuluh darah, dan pernafasan. أَفَلَا تُبْصِرُونَ(Maka apakah kamu tidak memperhatikan?) Dengan mata hati, sehingga kalian dapat menjadikannya petunjuk kepada Sang Pencipta yang Maha Pemberi Rezeki dan Maha Esa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Qatadah mengatakan mengenai ayat ini: siapa yang bertafakkur tentang penciptaan dirinya, ia akan menyadari bahwa sendi-sendi tubuhnya tidaklah ia dilunakkan melainkan untuk beribadah. 2 ). Perhatikanlah bagaimana kepala diciptakan, berapa jumlah susunan tulang yang ada bagian ini, dikatakan bahwasanya ada lima puluh lima susunan tulang yang ada di bagian kepala, dengan berbagai perbedaan bentuk, ukuran dan manfaatnya, dan bagaimana Allah menyusunnya di bagian atas dari tubuh, menjadikannya seperti seorang pengendara di atas kendaraannya? kemudian bacalah ayat ini : { وَفِىٓ أَنفُسِكُمْ ۚ أَفَلَا تُبْصِرُونَ } \"Dan (juga) pada dirimu sendiri. Maka apakah kamu tidak memperhatikan?\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dalam susunan diri dan penciptaan kalian itu terdapat tanda-tanda yang menunjukkan keesaan dan kuasa Allah. Apakah kamu tidak melihat dengan berangan-angan dan berpikir?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan pada diri kalian} dan pada penciptaan diri kalian terdapat dalil-dalil atas kekuasaan Allah {Apakah kalian tidak memperhatikan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 21: 20-22. Ketahuilah wahai manusia bahwa di bumi terdapat tanda-tanda yang nyata, yang menunjukkan atas ke-Maha Esaan Allah dan kesempurnaan kekuasaan-Nya. Dan tanda-tanda ini berguna bagi orang-orang yang yakin, yang mereka memiliki ilmu, pengetahuan serta pandangan dalam keagungan ciptaan Allah. Dan juga dalam mewujudkan diri-diri mereka dari yang tidak ada menjadi ada tanpa ada yang mendahului-Nya. Dan itulah tanda-tanda penciptaan dan keselarasan yang menujukkan atas keesaan Allah dan kesempurnaan akan kekuasaan-Nya, tidakkah kalian melihatnya dan menjadikan ketauhidan dan keimanan kepada Allah ?!. Ketahuilah, apa yang ada di langit menjadi sebab rezeki dan kehidupan kalian yaitu hujan, ayang dengannya hidup suatu negeri dan hamba, dan di langit juga terdapat balasan yang dijanjikan dan adzab serta surga dan neraka; Maka sungguh balasan amalan-amalan tertulis di langit dan takdir juga turun dari langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari awal penciptaan kamu sampai akhirnya, serta pada susunan tubuhmu yang menakjubkan. Di sana terdapat pelajaran, hikmah, dan rahmat yang menunjukkan bahwa Allah Subhaanahu wa Ta'aala Mahaesa, Tuhan yang bergantung kepada-Nya segala sesuatu, dan bahwa Dia tidak menciptakan makhluk secara percuma."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 21",
    "description": "20-21. Allah adalah pencipta alam semesta. Tanda-tanda kekuasaan dan kebesaran-Nya terdapat di seluruh penjuru langit, dan selain itu di bumi juga terdapat tanda-tanda kebesaran-Nya. Namun semuanya itu hanya dapat dipahami bagi orang-orang yang yakin, dan di samping itu, sesungguhnya keagungan Allah juga banyak ditemukan pada dirimu sendiri. Sesudah dipahami semua tanda-tanda itu, maka apakah kamu tetap lalai dan tidak memperhatikan semua yang dapat disaksikan itu'22. Setelah menerangkan tantang keberadaan tanda-tanda kekuasaan Allah di bumi dan pada diri manusia, maka selanjutnya dia menerangkan bahwa di alam semesta dan di langit yang sangat luas itu terdapat pula sebab-sebab datangnya rezekimu seperti cahaya matahari yang menerangi jagat, hujan yang menyuburkan tanah, angin yang bertiup sepoi-sepoi dan selain itu terdapat pula apa yang telah dijanjikan Allah melalui rasul-Nya kepadamu."
  }
]