[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di langit ada rizki kalian dan apa yang dijanjikan kepada kalian, yaitu kebaikan dan keburukan, pahala dan hukuman, dan selainnya yang semuanya tertulis lagi ditakdirkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan di langit terdapat rezeki dunia dan rezeki agama bagi kalian dan padanya terdapat pahala yang dijanjikan kepada kalian di dunia dan di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَفِى السَّمَآءِ رِزْقُكُمْ وَمَا تُوعَدُونَ (Dan di langit terdapat (sebab-sebab) rezekimu dan terdapat (pula) apa yang dijanjikan kepadamu) Berupa surga dan neraka serta pahala dan siksa yang telah tertulis di langit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Di sudut langit ada sebab-sebab turunnya rejeki, yaitu hujan dan apa yang dijanjikan untuk kalian berupa pahala dan hukuman yang telah tercatat di Lauhil Mahfudz."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada langit terdapat pula rezeki kalian dan apa yang dijanjikan kepada kalian"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 22: 20-22. Ketahuilah wahai manusia bahwa di bumi terdapat tanda-tanda yang nyata, yang menunjukkan atas ke-Maha Esaan Allah dan kesempurnaan kekuasaan-Nya. Dan tanda-tanda ini berguna bagi orang-orang yang yakin, yang mereka memiliki ilmu, pengetahuan serta pandangan dalam keagungan ciptaan Allah. Dan juga dalam mewujudkan diri-diri mereka dari yang tidak ada menjadi ada tanpa ada yang mendahului-Nya. Dan itulah tanda-tanda penciptaan dan keselarasan yang menujukkan atas keesaan Allah dan kesempurnaan akan kekuasaan-Nya, tidakkah kalian melihatnya dan menjadikan ketauhidan dan keimanan kepada Allah ?!. Ketahuilah, apa yang ada di langit menjadi sebab rezeki dan kehidupan kalian yaitu hujan, ayang dengannya hidup suatu negeri dan hamba, dan di langit juga terdapat balasan yang dijanjikan dan adzab serta surga dan neraka; Maka sungguh balasan amalan-amalan tertulis di langit dan takdir juga turun dari langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, hujan yang dapat menyuburkan tanaman. Yang dimaksud dengan apa yang dijanjikan kepadamu ialah takdir Allah terhadap setiap manusia yang telah ditulis di Lauhul Mahfuzh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 22",
    "description": "Setelah menerangkan tantang keberadaan tanda-tanda kekuasaan Allah di bumi dan pada diri manusia, maka selanjutnya dia menerangkan bahwa di alam semesta dan di langit yang sangat luas itu terdapat pula sebab-sebab datangnya rezekimu seperti cahaya matahari yang menerangi jagat, hujan yang menyuburkan tanah, angin yang bertiup sepoi-sepoi dan selain itu terdapat pula apa yang telah dijanjikan Allah melalui rasul-Nya kepadamu. 23. Setelah menyadari semua kenikmatan itu, maka demi tuhan pencipta langit dan bumi, sungguh, apa yang dijanjikan dan yang sering kamu ingkari itu, seperti keniscayaan kiamat, hari perhitungan, balasan surga, dan azab neraka pasti benar-benar terjadi seperti apa yang telah kamu ucapkan memang benar terjadi dan tidak seorang pun mengingkarinya."
  }
]