[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah bersumpah dengan DiriNya Yang Mulia bahwa apa yang Dia janjikan adalah Haq, maka jangan meragukannya sebagaimana kalian tidak meragukan ucapan kalian sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Maka demi Rabb langit dan Rabb bumi, sesungguhnya hari kebangkitan itu benar adanya, tidak ada keraguan padanya sebagaimana tidak ada keraguan pada ucapan kalian saat kalian mengucapkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Demi Tuhan Pemilik langit dan bumi, sungguh rezeki dan kebangkitan setelah kematian yang dijanjikan kepada kalian adalah hal yang benar dan pasti akan terjadi, sebagaimana kemampuan kalian untuk berbicara yang tidak kalian ragukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. فَوَرَبِّ السَّمَآءِ وَالْأَرْضِ إِنَّهُۥ لَحَقٌّ (Maka demi Tuhan langit dan bumi, sesungguhnya yang dijanjikan itu adalah benar-benar (akan terjadi)) Yakni apa yang aku kabarkan pada ayat-ayat ini merupakan sesuatu yang benar. مِّثْلَ مَآ أَنَّكُمْ تَنطِقُونَ(seperti perkataan yang kamu ucapkan) Yakni sebagaimana kalian berbicara. Yakni hal ini adalah sesuatu yang benar sebagaimana kebenaran bahwa kalian dapat berbicara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Maka Demi Allah, Tuhan langit dan bumi, sesungguhnya apa yang dijanjikan untuk kalian berupa hari kebangkitan, pembalasan dan jaminan rejeki itu pasti benar dan tidak diragukan, serupa dengan ucapan kalian. Maknanya bahwa hal itu pasti benar sebagaimana kalian merasa mampu untuk berucap. Dan apa yang dijanjikan Allah kepada kalian itu tidak dapat diragukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka demi Tuhan langit dan bumi, sesungguhnya pasti akan nyata} sesungguhnya kebangkitan itu pasti, tidak ada keraguan padanya {seperti yang kalian ucapkan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 23: Allah menutup ayat ini dengan sumpah; Allah mengabarkan bahwa dikabarkan pada ayat-ayat dalam surat ini yang dijanjikan kepada kalian dengannya secara benar dan jujur, maka tidak semestinya bagi kalian meragukan ayat-ayat Allah, sebagaimana kalian tidak meragukan kemampuan kalian dalam berucap dan berkata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan ayat-ayat-Nya dan mengingatkannya, dimana dengan ayat-ayat itu orang yang cerdas dan berakal akan sadar, maka Allah Subhaanahu wa Ta'aala berfirman, bahwa janji-Nya dan balasan-Nya adalah hak (benar). Yakni sebagaimana kamu tidak ragu tentang ucapanmu, maka demikian pula tidak patut ragu-ragu terhadap kebangkitan setelah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 23",
    "description": "Setelah menyadari semua kenikmatan itu, maka demi tuhan pencipta langit dan bumi, sungguh, apa yang dijanjikan dan yang sering kamu ingkari itu, seperti keniscayaan kiamat, hari perhitungan, balasan surga, dan azab neraka pasti benar-benar terjadi seperti apa yang telah kamu ucapkan memang benar terjadi dan tidak seorang pun mengingkarinya. 24. Pada ayat-ayat yang lalu dijelaskan tentang keingkaran orang-orang musyrik dan ancaman Allah terhadap mereka yang pasti akan terjadi. Sedang pada ayat-ayat berikut diterangkan tentang perlakuan Allah terhadap utusan-Nya yang terpilih, yaitu nabi ibrahim dengan cara yang berbeda dari kebiasaan pada umumnya. Ayat-ayat ini diawali dengan pertanyaan untuk menarik minat mitra bicara dalam dialognya. \"sudahkah sampai kepadamu wahai nabi Muhammad cerita tamu terhormat dari nabi ibrahim yang sesungguhnya merupakan malaikat-malaikat yang dimuliakan Allah'."
  }
]