[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Apakah telah datang kepadamu (wahai Rasul) kisah tentang tamu Ibrahim yang dia muliakan? (Mereka adalah para malaikat yang mulia). Saat mereka masuk ke rumahnya, lalu mereka mengucapkan salam kepada Ibrahim dengan berkata, “Salam untukmu.” Ibrahim menjawab, “Salam juga bagi kalian. Kalian adalah orang-orang asing, kami tidak mengenal kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Sudahkah datang kepadamu -wahai Rasul- berita tentang tamu-tamu Ibrahim dari kalangan malaikat yang dimuliakan oleh Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Hai Rasulullah, apakah telah sampai kepadamu kisah tentang para malaikat yang menjadi tamu Nabi Ibrahim? Ketika mereka memasuki rumahnya dengan mengucapkan salam; maka Ibrahim menjawab: “Salamun ‘alaikum, kalian adalah orang asing yang tidak kami kenal.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Apakah kamu mengerti wahai nabi tentang kisah tamu-tamu Ibrahim dari golongan malaikat yang dimuliakan di sisi Allah SWT? Kata Adh-Dhaif digunakan untuk seseorang atau orang banyak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah sudah sampai kepadamu cerita tentang tamu Ibrahim yang dimuliakan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 24: 24-25. Apakah telah sampai kepadamu wahai Nabi, kabar tentang Ibrahim dan para tamunya dari golongan malaikat yang mulia; Dimana Allah memerintahkan mereka untuk mengunjungi Ibrahim dan mengabarkan dengan kabar seorang anak, kemudian mereka semua (Ibrahim dan para malaikat) pergi menuju kaumnya Luth. Maka ketika telah sampai kepadanya mereka memberi salam kepada Ibrahim, maka Ibrahim menjawab salam mereka dengan berkata : Salamun Alaikum, kalian adalah kaum yang asing, kami tidak mengenal kalian, siapa kalian ? Dan mereka para malaikat Allah perintahkan untuk mengadzab kaum Luth dan dijungkir balikkan negeri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Serta berita mereka yang asing dan menakjubkan. Mereka adalah para malaikat yang diutus Allah untuk membinasakan kaum Luth, Allah memerintahkan mereka melewati Nabi Ibrahim lebih dahulu dan mereka datang kepada Beliau sebagai para tamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 24",
    "description": "Pada ayat-ayat yang lalu dijelaskan tentang keingkaran orang-orang musyrik dan ancaman Allah terhadap mereka yang pasti akan terjadi. Sedang pada ayat-ayat berikut diterangkan tentang perlakuan Allah terhadap utusan-Nya yang terpilih, yaitu nabi ibrahim dengan cara yang berbeda dari kebiasaan pada umumnya. Ayat-ayat ini diawali dengan pertanyaan untuk menarik minat mitra bicara dalam dialognya. \"sudahkah sampai kepadamu wahai nabi Muhammad cerita tamu terhormat dari nabi ibrahim yang sesungguhnya merupakan malaikat-malaikat yang dimuliakan Allah'25. Sesudah mengemukakan pertanyaan tersebut Allah mengawali kisah ini dengan firman-Nya: ingatlah, wahai nabi Muhammad, ketika mereka, yaitu para malaikat itu masuk ke tempatnya, yaitu ke rumah nabi ibrahim lalu mengucapkan, 'sal'man', yang maksudnya untuk menyatakan bahwa mereka datang dengan membawa kedamaian dan bukan untuk mengganggu ketenangannya. Ibrahim segera menjawab, 'sal'mun', yang merupakan doa agar kedamaian dan keselamatan selalu tercurah kepada semuanya. Saat menyambut tamunya, nabi ibrahim berkata dalam hatinya bahwa mereka itu adalah orang-orang yang belum dikenalnya."
  }
]