[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Apakah telah datang kepadamu (wahai Rasul) kisah tentang tamu Ibrahim yang dia muliakan? (Mereka adalah para malaikat yang mulia). Saat mereka masuk ke rumahnya, lalu mereka mengucapkan salam kepada Ibrahim dengan berkata, “Salam untukmu.” Ibrahim menjawab, “Salam juga bagi kalian. Kalian adalah orang-orang asing, kami tidak mengenal kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Ketika mereka akan masuk ke tempatnya maka mereka berkata kepadanya, “Salam.” Ibrahim membalas mereka dengan berkata, “Salam.” Sambil berkata dalam hatinya, “Mereka adalah orang-orang yang tidak kami kenal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِذْ دَخَلُوا۟ عَلَيْهِ فَقَالُوا۟ سَلٰمًا ۖ (ketika mereka masuk ke tempatnya lalu mengucapkan: “Salaam) Yakni kami memberimu ucapan salam. قَالَ سَلٰمٌ (Ibrahim menjawab: “Salaamun) Yakni Ibrahim menjawab salam itu: “salam” قَوْمٌ مُّنكَرُونَ ((kamu) adalah orang-orang yang tidak dikenal) Yakni kalian adalah orang-orang asing yang belum aku kenal sebelumnya. Siapakah kalian?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Saat bertamu kepada Ibrahim, mereka berkata: “Kami memberi salam kepadamu.” Kemudian Dia menjawab: “Aku berikan salam juga untuk kalian. Kalian adalah orang yang belum pernah aku ketahui”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka masuk kepadanya, lalu mengucapkan,“Salam”, Dia menjawab} Ibrahim menjawab {“Salam” (kalian) adalah orang-orang yang belum dikenal} orang asing yang tidak kami kenal"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 25: 24-25. Apakah telah sampai kepadamu wahai Nabi, kabar tentang Ibrahim dan para tamunya dari golongan malaikat yang mulia; Dimana Allah memerintahkan mereka untuk mengunjungi Ibrahim dan mengabarkan dengan kabar seorang anak, kemudian mereka semua (Ibrahim dan para malaikat) pergi menuju kaumnya Luth. Maka ketika telah sampai kepadanya mereka memberi salam kepada Ibrahim, maka Ibrahim menjawab salam mereka dengan berkata : Salamun Alaikum, kalian adalah kaum yang asing, kami tidak mengenal kalian, siapa kalian ? Dan mereka para malaikat Allah perintahkan untuk mengadzab kaum Luth dan dijungkir balikkan negeri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut penyusun tafsir Al Jalaalain, kata-kata ini diucapkan dalam hati Nabi Ibrahim ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 25",
    "description": "Sesudah mengemukakan pertanyaan tersebut Allah mengawali kisah ini dengan firman-Nya: ingatlah, wahai nabi Muhammad, ketika mereka, yaitu para malaikat itu masuk ke tempatnya, yaitu ke rumah nabi ibrahim lalu mengucapkan, 'sal'man', yang maksudnya untuk menyatakan bahwa mereka datang dengan membawa kedamaian dan bukan untuk mengganggu ketenangannya. Ibrahim segera menjawab, 'sal'mun', yang merupakan doa agar kedamaian dan keselamatan selalu tercurah kepada semuanya. Saat menyambut tamunya, nabi ibrahim berkata dalam hatinya bahwa mereka itu adalah orang-orang yang belum dikenalnya. 26-27. Sesudah nabi ibrahim mempersilakan tamunya, maka kemudian dengan diam-diam dia pergi menemui keluarganya, yaitu istrinya untuk menyiapkan jamuan untuk mereka. Kemudian dibawanya daging anak sapi gemuk yang sudah dibakar, lalu dihidangkannya hidangan itu kepada mereka, tetapi ternyata mereka tidak mau makan jamuan itu. Segera saja nabi ibrahim berkata, 'mengapa tidak kamu makan hidangan ini'."
  }
]