[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-28. Ibrahim meninggalkan mereka dan masuk menemui keluarganya, dia sengaja menyembelih sekor anak sapi yang gemuk, memanggangnya dengan api, kemudian menyuguhkannya di hadapan mereka. Dia mempersilakan mereka makan dengan sopan, “Tidakkah kalian makan?” maka ketika Ibrahim melihat mereka tidak makan, rasa takut muncul dalam hatinya. Mereka berkata kepada Ibrahim, “Jangan takut, sesungguhnya kami ini adalah utusan-utusan Allah.” dan mereka menyampaikan kabar kepada Ibrahim bahwa istrinya (Sarah) akan melahirkan anak lelaki yang akan menjadi ahli ilmu tentang Allah dan agamaNYa, yaitu Ishaq."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Lalu Ibrahim masuk menemui keluarganya dengan diam-diam, kemudian beliau (kembali dengan) membawa daging anak sapi yang gemuk, karena beliau mengira bahwa tamunya adalah manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-30. Kemudian Ibrahim pergi ke keluarganya dengan segera, dan menyembelih anak sapi yang gemuk untuk dipanggang. Lalu dia menghidangkannya bagi para tamunya dan mempersilahkan mereka dengan halus: “Tidakkah kalian memakannya?” Saat mereka enggan memakannya, Ibrahim merasa takut; dan hal ini mereka ketahui, sehingga mereka berkata: “Janganlah kamu takut dari kami, karena kami adalah para utusan dari Allah.” Kemudian mereka menyampaikan bahwa dia akan dikaruniai seorang anak yang berilmu, sehingga istri Nabi Ibrahim datang dan berteriak karena terheran tidak percaya, hingga dia memukul-mukul wajahnya seraya berkata: “Bagaimana aku akan melahirkan seorang anak, sedangkan aku telah menjadi wanita tua yang mandul?” Maka para malaikat itu menjawab: “Demikianlah firman Tuhanmu yang disampaikan kepada kami. Dia Maha Bijaksana dalam mengatur urusan hamba-hamba-Nya, dan Maha Mengetahui kemaslahatan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَرَاغَ إِلَىٰٓ أَهْلِهِۦ (Maka dia pergi dengan diam-diam menemui keluarganya) Yakni pergi menuju keluarganya. Terdapat pendapat mengatakan bahwa ia pergi ke keluarganya tanpa sepengetahuan para tamunya. فَجَآءَ بِعِجْلٍ سَمِينٍ(kemudian dibawanya daging anak sapi gemuk) Yakni dia datang kepada tamunya dengan membawa daging anak sapi panggang, sebagaimana dikisahkan pada surat Hud yang menyatakan “Datang membawa daging anak sapi panggang.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Maka dengan diam-diam dia menemui keluarganya dan membawakan dengan cepat sepotong daging yang sudah dimasak. Dalam surah Hud ayat 69 disebutkan {Bi ‘ajlin haniidzin} yaitu dimasak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian, dia pergi diam-diam} dia pergi diam-diam {menemui keluarganya, lalu datang membawa (daging) anak sapi gemuk"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 26: 26-28. Kemudian Ibrahim pergi menuju kepada keluarganya secara diam-diam dan sembunyi-sembunyi dari para tamunya. Kemudian dengan cepat menemui tamunya dengan membawa masakan daging (sapi) panggang yang gemuk. Kemudian diberikan kepada tamunya, dan berkata kepada mereka : Silahkan wahai para tamu untuk menikmati hidangan ini. Akan tetapi meeka menolak dan tidak memakannya, maka Ibrahim heran dengan mereka, Ibrahim berkata kepada mereka : Kenapa tidak kalian makan ? Maka hening dengan keheningan yang sebentar, maka ketika Ibrahim melihat mereka enggan makan, Ibrahim merasa takut kepada mereka, Ibrahim menyangka mereka enggan makan karena mereka menginginkan kejahatan. Mereka kemudian berkata : Jangan engkau takut, sungguh kami hanyalah diutus oleh Tuhanmu; Kemudian mereka mengabarkan bahwa istrinya Ibrahim yang bernama Sarah akan melahirkan seorang anak yang sangat cerdas, ketika menjadi seorang penyampai berita (berdakwah) kepada manusia, dan anak itu bernama Ishaq."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 26",
    "description": "26-27. Sesudah nabi ibrahim mempersilakan tamunya, maka kemudian dengan diam-diam dia pergi menemui keluarganya, yaitu istrinya untuk menyiapkan jamuan untuk mereka. Kemudian dibawanya daging anak sapi gemuk yang sudah dibakar, lalu dihidangkannya hidangan itu kepada mereka, tetapi ternyata mereka tidak mau makan jamuan itu. Segera saja nabi ibrahim berkata, 'mengapa tidak kamu makan hidangan ini'"
  }
]