[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-28. Ibrahim meninggalkan mereka dan masuk menemui keluarganya, dia sengaja menyembelih sekor anak sapi yang gemuk, memanggangnya dengan api, kemudian menyuguhkannya di hadapan mereka. Dia mempersilakan mereka makan dengan sopan, “Tidakkah kalian makan?” maka ketika Ibrahim melihat mereka tidak makan, rasa takut muncul dalam hatinya. Mereka berkata kepada Ibrahim, “Jangan takut, sesungguhnya kami ini adalah utusan-utusan Allah.” dan mereka menyampaikan kabar kepada Ibrahim bahwa istrinya (Sarah) akan melahirkan anak lelaki yang akan menjadi ahli ilmu tentang Allah dan agamaNYa, yaitu Ishaq."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Lalu ia menghidangkannya kepada tamunya sambil menyeru dengan lembut kepada mereka, “Silahkan menikmati makanan yang disuguhkan kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kemudian meletakkannya di depan mereka dan berkata: “Apakah kalian tidak memakannya?” Namun mereka tidak menjawab. {Alaa} adalah huruf yang digunakan untuk menunjukkan keinginan terhadap kalimat setelahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu dia menghidangkannya kepada mereka, Ibrahim berkata,“Mengapa kalian tidak makan”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 27: 26-28. Kemudian Ibrahim pergi menuju kepada keluarganya secara diam-diam dan sembunyi-sembunyi dari para tamunya. Kemudian dengan cepat menemui tamunya dengan membawa masakan daging (sapi) panggang yang gemuk. Kemudian diberikan kepada tamunya, dan berkata kepada mereka : Silahkan wahai para tamu untuk menikmati hidangan ini. Akan tetapi meeka menolak dan tidak memakannya, maka Ibrahim heran dengan mereka, Ibrahim berkata kepada mereka : Kenapa tidak kalian makan ? Maka hening dengan keheningan yang sebentar, maka ketika Ibrahim melihat mereka enggan makan, Ibrahim merasa takut kepada mereka, Ibrahim menyangka mereka enggan makan karena mereka menginginkan kejahatan. Mereka kemudian berkata : Jangan engkau takut, sungguh kami hanyalah diutus oleh Tuhanmu; Kemudian mereka mengabarkan bahwa istrinya Ibrahim yang bernama Sarah akan melahirkan seorang anak yang sangat cerdas, ketika menjadi seorang penyampai berita (berdakwah) kepada manusia, dan anak itu bernama Ishaq."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 27",
    "description": "26-27. Sesudah nabi ibrahim mempersilakan tamunya, maka kemudian dengan diam-diam dia pergi menemui keluarganya, yaitu istrinya untuk menyiapkan jamuan untuk mereka. Kemudian dibawanya daging anak sapi gemuk yang sudah dibakar, lalu dihidangkannya hidangan itu kepada mereka, tetapi ternyata mereka tidak mau makan jamuan itu. Segera saja nabi ibrahim berkata, 'mengapa tidak kamu makan hidangan ini'. 28. Ketika nabi ibrahim melihat tamunya tidak mau menyentuh makanan yang dihidangkan, maka dia kemudian merasa takut terhadap mereka. Melihat ketakutannya, mereka, yaitu para tamu itu berkata, 'janganlah kamu takut wahai nabi ibrahim, ' dan, selanjutnya mereka memberi kabar gembira kepadanya, yaitu dengan akan lahirnya seorang anak yang cerdas dan kelak akan menjadi seorang yang alim yang mendalam pengetahuannya yaitu ishak."
  }
]