[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-28. Ibrahim meninggalkan mereka dan masuk menemui keluarganya, dia sengaja menyembelih sekor anak sapi yang gemuk, memanggangnya dengan api, kemudian menyuguhkannya di hadapan mereka. Dia mempersilakan mereka makan dengan sopan, “Tidakkah kalian makan?” maka ketika Ibrahim melihat mereka tidak makan, rasa takut muncul dalam hatinya. Mereka berkata kepada Ibrahim, “Jangan takut, sesungguhnya kami ini adalah utusan-utusan Allah.” dan mereka menyampaikan kabar kepada Ibrahim bahwa istrinya (Sarah) akan melahirkan anak lelaki yang akan menjadi ahli ilmu tentang Allah dan agamaNYa, yaitu Ishaq."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Ketika mereka tidak memakannya, Ibrahim menyembunyikan rasa takut kepada mereka di dalam hati, tapi mereka mengetahuinya dan berkata kepadanya untuk menenangkannya, “Janganlah takut! Kami adalah utusan dari sisi Allah.” Lalu mereka memberi kabar tentang sesuatu yang menggembirakannya bahwa ia akan dianugerahi anak yang sangat pandai, dan anak itu adalah Isḥāq -'alaihissalām-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. فَأَوْجَسَ مِنْهُمْ خِيفَةً ۖ ((Tetapi mereka tidak mau makan), karena itu Ibrahim merasa takut terhadap mereka) Yakni Ibrahim merasakan takut pada dirinya ketika mereka tidak memakan makanan yang dia hidangkan. قَالُوا۟ لَا تَخَفْ ۖ( Mereka berkata: “Janganlah kamu takut”) Kemudian mereka memberitahukannya bahwa mereka adalah malaikat. وَبَشَّرُوهُ بِغُلٰمٍ عَلِيمٍ(mereka memberi kabar gembira kepadanya dengan (kelahiran) seorang anak yang alim) Yakni akan dikaruniakan kepadanya anak yang memiliki ilmu yang luas ketika telah mencapai umur dewasa, yang bernama Ishaq."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Saat mereka tidak mau makan, Ibrahim merasa takut dengan mereka karena diam. Kemudian dia menjerit, lalu mereka berkata: “Jangan takut kepada kami. Sesungguhnya kami adalah utusan-utusan Allah” Mereka memberi kabar kepadanya tentang anak yang memiliki banyak ilmu, yaitu Ishaq AS, sebagaimana yang disebutkan dalam surah Hud."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menyimpan rasa takut terhadap mereka} Dia menyembunyikan rasa takut dalam dirinya terhadap mereka {Mereka berkata,“Janganlah takut” Mereka memberi kabar gembira kepadanya dengan seorang anak yang sangat berilmu} anak yang memiliki banyak ilmu, yaitu Ishaq AS"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 28: 26-28. Kemudian Ibrahim pergi menuju kepada keluarganya secara diam-diam dan sembunyi-sembunyi dari para tamunya. Kemudian dengan cepat menemui tamunya dengan membawa masakan daging (sapi) panggang yang gemuk. Kemudian diberikan kepada tamunya, dan berkata kepada mereka : Silahkan wahai para tamu untuk menikmati hidangan ini. Akan tetapi meeka menolak dan tidak memakannya, maka Ibrahim heran dengan mereka, Ibrahim berkata kepada mereka : Kenapa tidak kalian makan ? Maka hening dengan keheningan yang sebentar, maka ketika Ibrahim melihat mereka enggan makan, Ibrahim merasa takut kepada mereka, Ibrahim menyangka mereka enggan makan karena mereka menginginkan kejahatan. Mereka kemudian berkata : Jangan engkau takut, sungguh kami hanyalah diutus oleh Tuhanmu; Kemudian mereka mengabarkan bahwa istrinya Ibrahim yang bernama Sarah akan melahirkan seorang anak yang sangat cerdas, ketika menjadi seorang penyampai berita (berdakwah) kepada manusia, dan anak itu bernama Ishaq."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Beliau melihat tangan mereka tidak menjamah makanan itu. Yakni kami adalah para utusan Tuhanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 28",
    "description": "Ketika nabi ibrahim melihat tamunya tidak mau menyentuh makanan yang dihidangkan, maka dia kemudian merasa takut terhadap mereka. Melihat ketakutannya, mereka, yaitu para tamu itu berkata, 'janganlah kamu takut wahai nabi ibrahim, ' dan, selanjutnya mereka memberi kabar gembira kepadanya, yaitu dengan akan lahirnya seorang anak yang cerdas dan kelak akan menjadi seorang yang alim yang mendalam pengetahuannya yaitu ishak. 29. Ketika mendengar berita yang disampaikan para tamu itu tentang akan lahirnya seorang anak yang alim, maka kemudian istrinya, yaitu sarah datang memekik dengan tercengang karena heran dan gembira. Namun setelah menyadari keadaan dirinya, ia lalu menepuk wajah-Nya sendiri seraya berkata, 'aku ini seorang perempuan tua yang mandul, bagaimana mungkin aku bisa melahirkan anak'."
  }
]