[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Maka ketika istri Ibrahim mendengar ucapan para malaikat tersebut, dia datang kepada mereka dengan berteriak, dia menampar wajahnya karena takjub kepada perkara ini. Dia berkata, “Bagaimana aku melahirkan sementara aku adalah wanita tua yang mandul?” malaikat-malaikat Allah itu menjawab, “Demikianlah, Tuhanmu berfirman sebagaimana yang kami kabarkan kepadamu. Dia MahaKuasa atas itu, tidak ada yang aneh dalam KuasaNya. Sesungguhnya Allah MahaBijaksana yang meletakkan sesuatu pada tempatnya, juga Maha Mengetahui kemaslahatan hamba-hambaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Ketika istrinya mendengar berita gembira itu, mulailah ia menjerit karena gembira, sambil menepuk wajahnya ia berkata dengan keheranan, “Apakah orang yang sudah tua bisa melahirkan? Dan dia pada dasarnya adalah seorang yang mandul!\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَأَقْبَلَتِ امْرَأَتُهُۥ فِى صَرَّةٍ (Kemudian isterinya datang memekik) Makna (الصرة) yakni berteriak. فَصَكَّتْ وَجْهَهَا (lalu menepuk mukanya sendiri) Yakni ia menepuk mukanya sebagaimana kebiasaan kaum wanita ketika merasa takjub. وَقَالَتْ عَجُوزٌ عَقِيمٌ (berkata: “(Aku adalah) seorang perempuan tua yang mandul”) Yakni bagaimana aku akan melahirkan sedangkan aku adalah perempuan tua yang mandul? Ia merasa itu adalah hal mustahil karena umurnya telah tua, terlebih lagi ia adalah orang mandul; bahkan ketika ia masih muda, iapun tidak dapat memberikan Ibrahim keturunan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Kemudian Istrinya (Sarah) mendekat dengan menjerit dan berteriak. Dia menampar-nampar wajahnya menggunakan jari-jarinya karena terkejut dan malu. Dia berkata: “Bagaimana bisa aku melahikan, sedangkan aku adalah perempuan tua berusia lanjut yang mandul dan tidak bisa melahirkan siapapun?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Istrinya datang sambil berteriak} berteriak dan gaduh {lalu menepuk-nepuk wajahnya} menampar wajahnya dengan tangannya karena kaget {dan berkata,“Seorang perempuan tua yang mandul”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 29: 29-30. Maka ketika Sarah mendengar apa yang dikabarkan oleh malaikat terkejut, kemudian Sarah mendatangi para malaikat, dan ia menangis dan menampar mukanya sendiri karena kagum dengan ucapan mereka para malaikat, dan Sarah berkata : Bagaimana aku dapat melahirkan sedangkan aku sudah tua dan mandul ? Maka malaikat berkata kepadanya : Kami mengabarkan kepadamu, dan kami mengatakan sesuai apa yang dikatakan oleh Tuhanmu, dan sungguh Allah Maha Kuasa atas segala sesuatunya, Dialah yang Maha Bijaksana dalam menjaga dan merubah-ubah urusan hamba-Nya, Yang Maha Mengetahui atas kondisi dari para hamba-Nya dan yang baik untuk hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Sarah. Inilah perkataan atau perbuatan yang biasa terjadi pada wanita ketika senang. Yakni bagaimana aku punya anak, sedangkan aku seorang wanita yang mandul dan sudah lanjut usia, dimana pada usia tersebut biasanya wanita tidak melahirkan. Di samping itu, suaminya (Nabi Ibrahim ‘alaihis salam) adalah seorang yang sudah tua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 29",
    "description": "Ketika mendengar berita yang disampaikan para tamu itu tentang akan lahirnya seorang anak yang alim, maka kemudian istrinya, yaitu sarah datang memekik dengan tercengang karena heran dan gembira. Namun setelah menyadari keadaan dirinya, ia lalu menepuk wajah-Nya sendiri seraya berkata, 'aku ini seorang perempuan tua yang mandul, bagaimana mungkin aku bisa melahirkan anak'. 30. Ketika para tamu itu mengetahui keraguan sarah, maka mereka berkata, 'demikianlah, yaitu seperti yang kami sampaikan tuhanmu berfirman, dan ketetapan-Nya itu yang kami kabarkan. Sungguh, dialah sendiri yang mahabijaksana dengan menempatkan segala sesuatu pada posisinya dan dalam waktu yang paling tepat, lagi maha mengetahui terhadap apa saja yang akan terjadi'."
  }
]