[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan angin yang menerbangkan debu, lalu dengan awan yang membawa beban berat air, lalu dengan kapal-kapal yang berlayar di lautan dengan mudah dan lancar, lalu dengan malaikat yang membagikan rahmat Allah kepada makhlukNya, sesungguhnya apa yang dijanjikan kepada kalian (wahai manusia), yaitu kebangkitan dan hisab, pasti terjadi dengan yakin, dan sesungguhnya hisab dan pahala dari amal perbuatan benar-benar akan terwujud, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan dengan kapal-kapal yang berlayar di laut dengan mudah dan gampang,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. فَالْجٰرِيٰتِ يُسْرًا (dan kapal-kapal yang berlayar dengan mudah) Yakni awan yang bergerak membawa air yang bergitu banyak dengan gerakan yang lambat menuju tempat yang dikehendaki Allah untuk mendapat hujan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. dan demi perahu-perahu yang berlayar di atas permukaan air dengan tenang dan lancar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi (kapal-kapal) yang melaju dengan mudah} dan Aku bersumpah demi bahtera yang berlayar di lautan dengan mudah dan gampang"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 3: Allah bersumpah dengan kapal yang membawa beban yang berat, dan melaju di atas laut dengan kesulitan dan kemudahannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara mufassir ada yang menafsirkan Al Jaariyat di ayat ini dengan bintang-bintang yang beredar secara mudah, menghiasi langit dan dipakai petunjuk di kegelapan baik di darat maupun di laut dan dapat diambil pelajaran daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 3",
    "description": "1'4. Surah yang lalu diakhiri dengan penjelasan tentang hari kebangkitan yang pada saat itu akan terbukti ancaman-ancaman Allah yang telah diungkapkan sebelumnya. Oleh karena itu sangat tepat ketika surah ini dimulai dengan kalimat-kalimat yang mengukuhkan ancaman tersebut. Pengukuhan itu diungkapkan dengan sumpah-Nya bahwa semua yang diperingatkan itu pasti akan terbukti. :'demi angin kencang yang menerbangkan debu dengan tiupannya yang sangat kuat dan dahsyat, dan demi awan yang gumpalannya mengandung banyak air hujan yang menyuburkan tanah, dan demi kapal-kapal yang berlayar dengan membawa segala keperluan ke seluruh penjuru dengan mu-dah karena tiupan angin yang kuat, dan demi malaikat-malaikat yang membagi-bagi urusan yang diamanahkan kepada mereka, seperti menurunkan hujan, membagi rezeki, dan lainnya"
  }
]