[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Maka ketika istri Ibrahim mendengar ucapan para malaikat tersebut, dia datang kepada mereka dengan berteriak, dia menampar wajahnya karena takjub kepada perkara ini. Dia berkata, “Bagaimana aku melahirkan sementara aku adalah wanita tua yang mandul?” malaikat-malaikat Allah itu menjawab, “Demikianlah, Tuhanmu berfirman sebagaimana yang kami kabarkan kepadamu. Dia MahaKuasa atas itu, tidak ada yang aneh dalam KuasaNya. Sesungguhnya Allah MahaBijaksana yang meletakkan sesuatu pada tempatnya, juga Maha Mengetahui kemaslahatan hamba-hambaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Malaikat berkata kepadanya, “Apa yang kami kabarkan ini telah difirmankan oleh Rabbmu, dan apa yang telah difirmankan tidak ada yang bisa menolaknya, sesungguhnya Dia Maha Bijaksana dalam penciptaan-Nya dan takdir-Nya, Maha Mengetahui tentang makhluk-Nya dan apa yang menjadi maslahat baginya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قَالُوا۟ كَذٰلِكِ قَالَ رَبُّكِ ۖ (Mereka berkata: “Demikianlah Tuhanmu memfirmankan”) Yakni sebagaimana kami katakan kepadamu bahwa itu adalah firman Tuhanmu, maka janganlah kamu mengeluhkan itu dan menganggap itu mustahil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Mereka berkata kepadanya: “Inilah yang difirmankan Tuhanmu. Janganlah kau ragukan apa yang kami kabarkan kepadamu. Sesungguhnya Allah itu Maha Bijaksana kepada ciptaanNya dan Maha luas ilmuNya tentang keadaan-keadaan ciptaanNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Demikianlah} Demikianlah Kami berkata kepadamu dan memberitahukan kepadamu {Tuhanmu berfirman. Sesungguhnya Dialah Yang Maha bijaksana lagi Maha Mengetahui”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 30: 29-30. Maka ketika Sarah mendengar apa yang dikabarkan oleh malaikat terkejut, kemudian Sarah mendatangi para malaikat, dan ia menangis dan menampar mukanya sendiri karena terkejut dengan ucapan mereka para malaikat, dan Sarah berkata : Bagaimana aku dapat melahirkan sedangkan aku sudah tua dan mandul ? Maka malaikat berkata kepadanya : Kami mengabarkan kepadamu, dan kami mengatakan sesuai apa yang dikatakan oleh Tuhanmu, dan sungguh Allah Maha Kuasa atas segala sesuatunya, Dialah yang Maha Bijaksana dalam menjaga dan merubah-ubah urusan hamba-Nya, Yang Maha Mengetahui atas kondisi dari para hamba-Nya dan yang baik untuk hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Allah Subhaanahu wa Ta'aala yang menentukan hal itu dan memberlakukannya, sehingga tidak perlu heran terhadap kekuasaan Allah Subhaanahu wa Ta'aala. Dia meletakkan segala sesuatu pada tempatnya dan segala sesuatu telah diketahui-Nya. Oleh karena itu, terimalah keputusan-Nya dan bersyukurlah kepada Allah atas nikmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 30",
    "description": "Ketika para tamu itu mengetahui keraguan sarah, maka mereka berkata, 'demikianlah, yaitu seperti yang kami sampaikan tuhanmu berfirman, dan ketetapan-Nya itu yang kami kabarkan. Sungguh, dialah sendiri yang mahabijaksana dengan menempatkan segala sesuatu pada posisinya dan dalam waktu yang paling tepat, lagi maha mengetahui terhadap apa saja yang akan terjadi'. 31. Usai menjelaskan kedatangan para malaikat pemberi kabar gembira kepada nabi ibrahim tentang akan lahirnya seorang anak yang alim, pada ayat berikut Allah menerangkan bahwa dengan pengetahuannya sebagai seorang rasul, nabi ibrahim menduga para malaikat itu datang dengan tujuan lain. Dia berkata, 'apakah urusanmu yang penting, yang dengannya Allah menugaskanmu untuk datang ke wilayah ini, wahai para utusan yang mulia''."
  }
]