[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-34. Ibrahim berkata kepada para malaikat Allah, “Apa urusan kalian dana pa tugas yang kalian bawa?” mereka menjawab, “Sesungguhnya Allah mengutus kami kepada suatu kaum yang berbuat jahat dengan kekafiran mereka kepada Allah. kami akan menghancurkan mereka dengan tanah liat yang membatu yang ditandai dari Tuhanmu untuk orang-orang yang melebihi batas dalam kedurjanaan dan kedurhakaan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Ibrahim berkata kepada Malaikat, “Apa urusan kalian? Apa yang menjadi tujuan kalian ?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31-37. Ibrahim berkata kepada para malaikat: “Apa tujuan kalian datang ke sini wahai para utusan?” Mereka menjawab: “Allah mengutus kami menuju kaum yang melakukan dosa besar, agar kami menghancurkan mereka dengan batu yang berasal dari tanah yang mengeras; batu-batu itu telah diberi tanda atas orang-orang yang selalu berbuat dosa keji. Dan kami akan mengeluarkan dari negeri itu orang-orang yang beriman kepada Nabi Luth. Kami tidak menemukan rumah orang yang berserah diri kepada Allah yang ada di dalam negeri itu selain rumah Nabi Luth. Kemudian kami hancurkan negeri itu dan kami sisakan bekas-bekas kehancurannya sebagai pelajaran bagi orang-orang yang takut terhadap azab yang pedih.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Ibrahim bertanya kepada para malaikat: “Apa ada sesuatu yang penting wahai para malaikat yang diutus? perkara apa yang hendak kalian sampaikan?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Apa urusan kalian} apa urusan kalian {wahai para utusan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. “Ibrahim bertanya, ‘Apakah urusanmu hai para utusan’.” Yakni Nabi Ibrahim bertanya kepada mereka, “Apa keperluan kalian wahai para utusan, dan apa yang kalian inginkan?” karena Nabi Ibrahim merasa bahwa para tamunya itu adalah utusan yang di utus oleh Allah untuk suatu keperluan penting."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 31: Akan tetapi Ibrahim dengan banykanya malaikat yang berkunjung, ia merasakan bahwa mereka para malaikat dibebankan dengan urusan yang besar dengan membawa kabar baik ini. Maka Ibrahim bertanya kepada mereka setelah disampaikannya kabar gembira ini dengan berkata : Kabar apa yang kalian bawa wahai para malaikat, dan apa urusan yang kalian bawa, serta kepada siapa kalian diutus ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apa urusan dan tujuan kamu? Hal itu, karena Beliau merasaan bahwa mereka (para tamu) itu adalah utusan Allah, dimana Allah Subhaanahu wa Ta'aala mengutus mereka untuk urusan penting."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 31",
    "description": "Usai menjelaskan kedatangan para malaikat pemberi kabar gembira kepada nabi ibrahim tentang akan lahirnya seorang anak yang alim, pada ayat berikut Allah menerangkan bahwa dengan pengetahuannya sebagai seorang rasul, nabi ibrahim menduga para malaikat itu datang dengan tujuan lain. Dia berkata, 'apakah urusanmu yang penting, yang dengannya Allah menugaskanmu untuk datang ke wilayah ini, wahai para utusan yang mulia''32-34. Mendapat pertanyaan dari nabi ibrahim, mereka menjawab, 'sesungguhnya kami diutus kepada kaum nabi lut yang sebagian anggotanya adalah orang yang berdosa dan terang-terangan tanpa malu berbuat homoseksual. Kami datang agar kami menimpa mereka yang berdosa dengan batu-batu dari tanah yang keras, yang sudah ditandai dari tuhanmu yang dipersiapkan untuk membinasakan orang-orang yang melampaui batas ajaran-ajaran Allah. '."
  }
]