[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-34. Ibrahim berkata kepada para malaikat Allah, “Apa urusan kalian dana pa tugas yang kalian bawa?” mereka menjawab, “Sesungguhnya Allah mengutus kami kepada suatu kaum yang berbuat jahat dengan kekafiran mereka kepada Allah. kami akan menghancurkan mereka dengan tanah liat yang membatu yang ditandai dari Tuhanmu untuk orang-orang yang melebihi batas dalam kedurjanaan dan kedurhakaan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Yang telah ditandai di sisi Rabbmu -wahai Ibrahim- dikirimkan kepada orang-orang yang melanggar hukum-hukum Allah dan yang melampaui batas dalam kekafiran dan perbuatan maksiat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. مُّسَوَّمَةً (yang ditandai) Yakni ditandai dengan tanda-tanda yang dikenal. Terdapat pendapat mengatakan bahwa mereka diberi garis hitam dan merah. عِندَ رَبِّكَ لِلْمُسْرِفِينَ (di sisi Tuhanmu untuk membinasakan orang-orang yang melampaui batas) Yakni terus menerus dalam kesesatan dan keterlaluan dalam melakukan perbuatan keji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Diberi tanda di sisi Tuhanmu dengan tanda-tanda yang mengindikasikan azab itu. Tanda yang dikhususkan untuk orang-orang yang perbuatan kejinya melampaui batas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang ditandai} yang ditandai {oleh Tuhanmu bagi orang-orang yang melampaui batas”} orang-orang yang melampaui batas dalam kekufuran dan kemaksiatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. “Agar kami timpakan kepada mereka batu-batu dari tanah (yang keras), yang ditandai di sisi Rabbmu untuk (membinasakan) orang-orang yang melampaui batas,” yakni, masing-masing batu diberi tanda berupa nama orang yang ditimpakan padanya, karena mereka telah berlebih-lebihan dan melampaui batas, kemudian Ibrahim mendebat tamunya tentang kaum tentang kaum Nabi Luth agar Allah menolak azab mereka, dikatakan kepadanya, “Hai Ibrahim, tinggalkanlah soal jawab ini, sesungguhnya telah datang ketetapan Tuhanmu, dan sesungguhnya mereka itu akan didatangi azab yang tidak dapat ditolak.” -Hud:76-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 34: 33-34. Kemudian para malaikat berkata : Kepentingan kami adalah diutus karena kebodohan mereka dan menimpakan kepada mereka kebinasaan dengan merajam (melampari) batu-batuan dari tanah. Batu ini adalah sebagai pelajaran agar mereka mengenal tanda-tanda kebinasaan mereka, karena sebab kesyirikan dan melanggar ketetapan Allah dengan mengerjakan sesuatu yang menjijikkan, maksiat dan dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Batu-batu itu diberi tanda dengan nama orang yang akan dibinasakan. Maka Ibrahim ‘alaihis salam berbicara dengan mereka (para tamu itu) tentang kaum Luth, semoga saja Allah Subhaanahu wa Ta'aala mengangkat azab dari mereka, lalu mereka meminta Ibrahim ‘alaihis salam agar tidak melanjutkan pembicaraan tentang itu karena keputusan Allah telah datang, dan bahwa mereka akan ditimpa azab yang tidak dapat ditolak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 34",
    "description": "32-34. Mendapat pertanyaan dari nabi ibrahim, mereka menjawab, 'sesungguhnya kami diutus kepada kaum nabi lut yang sebagian anggotanya adalah orang yang berdosa dan terang-terangan tanpa malu berbuat homoseksual. Kami datang agar kami menimpa mereka yang berdosa dengan batu-batu dari tanah yang keras, yang sudah ditandai dari tuhanmu yang dipersiapkan untuk membinasakan orang-orang yang melampaui batas ajaran-ajaran Allah. '35-36. Allah mengkhususkan azabnya kepada mereka yang melampaui batas, sehingga orang-orang yang telah beriman tidak akan merasakan azab tersebut. Sebelum azab Allah datang, para malaikat memperingatkan mereka, lalu kami, yakni Allah dan subjek lain yang berperan dalam penyelamatan ini, keluarkan orang-orang yang beriman yang berada di dalamnya, yakni di negeri kaum lut, itu agar mereka selamat dari bencana yang segera tiba. Maka para malaikat yang kami utus tidak mendapati di dalamnya, yaitu di negeri tersebut, kecuali sebuah rumah saja dari orang-orang muslim yang beriman dan mengikuti ajaran nabi lut."
  }
]