[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami tidak melihat di perkampungan tersebut selain satu rumah dari kaum Muslimin, yaitu rumah Luth."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Ternyata tidak Kami dapati di kampung mereka ini selain satu rumah dari orang-orang yang berserah diri, yaitu keluarga Lūṭ -'alaihissalām-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِّنَ الْمُسْلِمِينَ (Dan Kami tidak mendapati negeri itu, kecuali sebuah rumah dari orang yang berserah diri) Yakni kecuali satu keluarga dari mereka, yaitu keluarga Nabi Luth."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Kami tidak menemukan satupun orang muslim selain Ahlu Bait dalam negeri itu. Ahli bait itu adalah Ahlu bait Luth kecuali istrinya. Iman adalah Akidah (keyakinan) dan Islam adalah mengerjakan segala sesuatu yang diwajibkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mendapati di dalamnya, kecuali sebuah rumah} penghuni rumah Luth AS {dari orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36. “Lalu Kami keluarkan orang-orang yang beriman yang berada di negeri kaum Luth itu. Dan Kami tidak mendapati di negeri itu, kecuali sebuah rumah dari orang-orang yang berserah diri,” yakni rumah keluarga Nabi Luth kecuali istrinya karena termasuk orang-orang yang akan dibinasakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 36: Allah menjelaskan bahwa tidak ada dari penghuni negeri tersebut selain satu rumah yang terdapat di dalamnya orang-orang muslim, rumah tersebut adalah yang di dalamnya terdapat keluarga Luth, (tidak ada selainnya) di antara seluruh penghuninya yang berlumur dosa dan fasik dalam negeri tesebut. Allah berfirman : غَيْرَ بَيْتٍۢ مِّنَ ٱلْمُسْلِمِينَ, dan pada ayat sebelumnya Allah berfirman : فَأَخْرَجْنَا مَن كَانَ فِيهَا مِنَ ٱلْمُؤْمِنِينَ. Karena sebab rumah Luth tidak semua yang di dalamnya adalah termasuk orang-orang yang beriman, istrinya Luth termasuk orang-orang yang berserah diri, akan tetapi tidak ikut diselamatkan (dari adzab); Karena ia termasuk orang-orang yang munafik dan khianat; Dimana dia berada di atas keyakinan agama kaum Luth, dan berkhianat, yang mengabarkan kepada orang-orang fasik akan kedatangan para tamu Luth (suaminya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Rumah Nabi Luth ‘alaihis salam dan keluarganya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 36",
    "description": "35-36. Allah mengkhususkan azabnya kepada mereka yang melampaui batas, sehingga orang-orang yang telah beriman tidak akan merasakan azab tersebut. Sebelum azab Allah datang, para malaikat memperingatkan mereka, lalu kami, yakni Allah dan subjek lain yang berperan dalam penyelamatan ini, keluarkan orang-orang yang beriman yang berada di dalamnya, yakni di negeri kaum lut, itu agar mereka selamat dari bencana yang segera tiba. Maka para malaikat yang kami utus tidak mendapati di dalamnya, yaitu di negeri tersebut, kecuali sebuah rumah saja dari orang-orang muslim yang beriman dan mengikuti ajaran nabi lut. 37. Kami turunkan azab sebagai peringatan bagi mereka yang ingkar, dan kami telah tinggalkan pula padanya, yaitu negeri nabi lut, suatu tanda yang sangat jelas tentang kebesaran dan kekuasaan kami. Kami menjadikannya pelajaran bagi orang-orang yang takut kepada azab yang pedih."
  }
]