[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "kami meninggalkan pada perkampungan tersebut bekas azab sebagai bukti atas Kuasa Allah dan pembalasanNya terhadap orang-orang kafir. Itu merupakan pelajaran bagi siapa yang takut kepada azab Allah yang pedih dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan Kami tinggalkan di kampung kaum Nabi Lūṭ bekas-bekas terjadinya siksa yang menunjukkan pernah turun siksa atas mereka agar orang-orang yang takut dengan siksa menyakitkan yang menimpa mereka mengambil pelajaran dengannya, dan tidak melakukan perbuatan sebagaimana perbuatan mereka sehingga selamat dari siksa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَتَرَكْنَا فِيهَآ ءَايَةً لِّلَّذِينَ يَخَافُونَ الْعَذَابَ الْأَلِيمَ (Dan Kami tinggalkan pada negeri itu suatu tanda bagi orang-orang yang takut kepada siksa yang pedih) Tanda itu yakni bekas-bekas azab yang ada di negeri tersebut yang masih jelas terlihat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Kami tinggalkan dalam negeri itu tanda-tanda dan dalil-dalil tentang kehancuran bagi orang-orang yang takut dengan azab yang pedih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami meninggalkan} Kami meninggalkan {padanya} pada negeri kaum Luth itu {suatu tanda} bekas azab dan reruntuhan {bagi orang-orang yang takut pada azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Dan Kami tinggalkan pada negeri itu satu tanda bagi orang-orang yang takut pada siksa yang pedih,” agar mereka dapat mengambil pelajaran dan mengetahui bahwa siksaan Allah, sangat dahsyat dan sesungguhnya semua rasulNya adalah orang-orang yang benar lagi dibenarkan. PASAL Di dalam kisah ini terdapat beberapa hikmah dan hukum: Pertama, di antara hikmah kisah yang dituturkan Allah kepada para hambaNya tentang orang-orang baik dan orang-orang keji, adalah agar para hamba bisa mengambil pelajaran dari mereka dan sampai di manakah kondisi mereka. Kedua, keutamaan Nabi Ibrahim, kekasih Allah, di mana Allah memulai kisah kaum Nabi Luth dengan kisah Nabi Ibrahim, yang menunjukkan perhatian Allah terhadap kondisinya. Ketiga, anjuran menjamu tamu. Menjamu tamu termasuk salah satu sunnah Nabi Ibrahim, kekasih Allah, di mana Allah memerintahkan Nabi Muhammad dan ummatnya untuk mengikuti Agama Ibrahim. Kisah yang disebutkan Allah dalam topik ini adalah sebagai pujian dan sanjungan untuk Nabi Ibrahim. Keempat, tamu harus dihormati dengan berbagai macam penghormatan, baik dengan perkataan maupun perbuatan, sebab Allah menggambarkan tamu-tamu Ibrahim sebagai orang-orang yang dimuliakan. Artinya, mereka dimuliakan oleh Ibrahim. Allah menggambarkan bagaimana jamuan yang dilakukan Nabi Ibrahim, baik berupa perkataan maupun perbuatan. Dan para tamu Nabi Ibrahim juga dimuliakan di sisi Allah. Kelima, rumah Nabi Ibrahim menjadi tempat persinggahan tamu yang datang di malam hari, sebab para tamu Ibrahim itu langsung masuk tanpa izin, namun menempuh cara beradab dengan memulai salam, kemudian Nabi Ibrahim membalas salam mereka secara lengkap dan sempurna. Balasan salam yang disebutkan Ibrahim berbentuk jumlah ismiyyah yang menunjukkan keteguhan dan ketetapan. Keenam, anjuran untuk mengenal orang yang datang atau ketika terjadi semacam interaksi dengan seseorang, karena hal itu memiliki banyak manfaat. Ketujuh, sopan santun Nabi Ibrahim dan kelembutannya ketika berbicara, karena beliau berkata, “Kaum yang tidak dikenal,” tidak berkata, “Aku tidak mengenal kalian,” terdapat perbedaan jelas antara kedua kata tersebut. Kedelapan, bersegera dalam menjamu tamu, sebab kebaikan yang paling utama adalah yang segera. Karena itulah Ibrahim segera menghidangkan jamuan makanan untuk para tamunya. Kesembilan, hewan sembelihan yang sudah ada yang telah disiapkan untuk selain tamu sebelum datang tamu lalu disuguhkan untuk tamu bukan suatu penghinaan sama sekali, namun hal itu sebagai salah satu bentuk memuliakan tamu sebagaimana dilakukan oleh Nabi Ibrahim. Allah sendiri memberitahukan bahwa para tamunya adalah terhormat. Kesepuluh, Ibrahim adalah orang yang menjamu tamunya meski dia kekasih Allah Yang Maha Pengasih dan pemimpin para orang yang menjamu tamu. Kesebelas, Ibrahim menyuguhkan makanan di tempat yang dekat dengan para tamu, tidak diletakkan di tempat yang agak jauh dan mengatakan, “Silahkan,” atau “Datangilah,” karena hal itu lebih mudah dan lebih baik. Kedua belas, melayani tamu dengan perkataan yang lembut khususnya ketika menghidangkan makanan, seperti yang dilakukan Ibrahim yang menyuguhkan makanan dengan tutur kata, “Makanlah,” dan tutur kata lain yang lebih baik lagi, boleh menggunakan etika menawarkan makanan untuk tamu dengan kata, “Apakah kalian tidak makan?” “ apakah kalian tidak mempersilahkan diri kalian?” “Kami mendapatkan kemuliaan dan kalian berbuat baik terhadap kami…” atau kata-kata yang lain. Ketiga belas, orang yang merasa takut pada seseorang karena adanya suatu sebab, maka yang ditakuti itu harus menghilangkan perasaan takutnya dengan menyebutkan sesuatu yang bisa memberinya rasa aman dari rasa takut dan menentramkan kegelisahannya, sebagaimana yang dikatakan oleh para malaikat itu kepada Nabi Ibrahim ketika Nabi Ibrahim takut terhadap mereka, “Jangan takut,” keemudian mereka memberitahukan kabar gembira yang menyenangkan setelah sebelumnya Nabi Ibrahim ketakutan. Keempat belas, Sarah, istri Nabi Ibrahim, begitu gembira sehingga terjadilah apa yang terjadi, dengan memukul-mukul mukanya serta tingkah lakunya yang tidak seperti biasa. Kelima belas, kemuliaan yang diberikan Allah kepada Nabi Ibrahim dan istri beliau berupa berita gembira akan lahirnya seorang putra yang alim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 37: Setelah Allah membinasakan kaum Luth, Allah mengabarkan bahwa Dia meninggalkan tanda-tanda yang jelas pada negerinya akan kebinasaan kaumnya. Agar menjadi pelajaran dan nasihat bagi mereka yang takut dengan adzab yang pedih dan menyakitkan di akhirat. Pada adzab ini terdapat bukti akan kuasa Allah dan balasan bagi orang-orang yang kafir yang mengingkari, yang mereka juga berbuat sesuatu yang menjijikkan dan munkar, serta tidak beriman kepada Allah dan ayat-ayat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah membinasakan orang-orang kafir. Tanda di sini ialah batu yang bertumpuk-tumpuk yang dipergunakan untuk membinasakan kaum Luth. Ada pula yang mengatakan sebuah telaga yang airnya hitam dan busuk baunya. Tanda tersebut adalah tanda yang menunjukkan kebinasaan mereka. Sehingga mereka tidak melakukan seperti yang dilakukan mereka (Kaum Luth), dan mereka dapat mengambil pelajaran darinya serta mengetahui bahwa Allah Subhaanahu wa Ta'aala sangat keras siksa-Nya dan bahwa para rasul-Nya adalah benar. Di antara sebagian hikmah dan hukum yang dapat diambil dari kisah ini adalah: - Termasuk hikmah, Allah Subhaanahu wa Ta'aala menceritakan kepada hamba-hamba-Nya berita orang-orang yang baik dan orang-orang yang buruk agar mereka dapat mengambil pelajaran dari keadaan mereka. - Keutamaan Nabi Ibrahim ‘alaihis salam, dimana Allah Subhaanahu wa Ta'aala memulai dengan kisahnya yang menunjukkan untuk diperhatikan. - Disyariatkan menjamu tamu dan bahwa hal itu termasuk sunnah Nabi Ibrahim ‘alaihis salam, dimana Allah Subhaanahu wa Ta'aala memerintahkan Nabi Muhammad shallallahu 'alaihi wa sallam dan umatnya mengikuti ajaran Nabi Ibrahim. Dan lagi, Allah Subhaanahu wa Ta'aala menyebutkan kisah Nabi Ibrahim menjamu tamu dengan cara memujinya dan menyanjungnya. - Tamu hendaknya dimuliakan dengan berbagai bentuk pemuliaan baik dengan ucapan maupun perbuatan. Hal itu, karena Allah Subhaanahu wa Ta'aala menyifati para tamu Nabi Ibrahim ‘alaihis salam bahwa mereka dimuliakan, yakni Nabi Ibrahim memuliakan mereka baik dengan ucapan maupun perbuatan, dan mereka juga dimuliakan di sisi Allah Subhaanahu wa Ta'aala. - Disyariatkan mengenali orang yang datang kepadanya, karena di sana terdapat banyak faedah. Pepatah mengatakan, “Tidak kenal maka tidak sayang.” - Beradabnya Nabi Ibrahim ‘alaihis salam dan lembutnya Beliau dalam berbicara. - Bersegera menjamu tamu, karena sebaik-baik kebaikan adalah yang dilakukan segera. - Makanan yang baru disiapkan untuk tamu yang sebelumnya tidak ada termasuk memuliakan tamu. - Nabi Ibrahim ‘alaihis salam yang langsung menjamu tamunya. - Nabi Ibrahim ‘alaihis salam membawakan makanan itu ke hadapan tamu, tidak meletakkan makanan ke tempat yang lain dan menyuruh tamu mendatanginya. - Hendaknya seseorang menggunakan kata-kata yang baik dan sesuai dengan kondisi ketika itu, sebagaimana Nabi Ibrahim ‘alaihis salam mengatakan kepada para tamunya, “Mengapa tidak kamu makan?\". - Orang yang membuat orang lain takut, hendaknya menghilangkan rasa takut itu serta menyebutkan sesuatu yang dapat menenangkan rasa takut saudaranya dan menenangkan jiwanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 37",
    "description": "Kami turunkan azab sebagai peringatan bagi mereka yang ingkar, dan kami telah tinggalkan pula padanya, yaitu negeri nabi lut, suatu tanda yang sangat jelas tentang kebesaran dan kekuasaan kami. Kami menjadikannya pelajaran bagi orang-orang yang takut kepada azab yang pedih. 38. Usai menceritakan azab yang Allah timpakan kepada kaum nabi lut yang ingkar, pada ayat-ayat berikut Allah menyebut kisah umat masa lalu yang mengingkari nabinya. Kisah-kisah itu menunjukkan betapa Allah mahakuasa, dan pada kisah nabi musa juga terdapat tanda-tanda kekuasaan Allah. Bukti-bukti itu antara lain terlihat ketika kami mengutusnya kepada fira'un, yaitu penguasa mesir kuno, dengan membawa tanda kekuasaan kami, yaitu mukjizat yang nyata dan tidak terbantahkan."
  }
]