[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Dan pada pengutusan Kami terhadap Musa kepada Fir’aun dan tokoh kaumnya dengan membawa tanda-tanda dan mukjizat-mukijizat yang nyata, juga terkandung pelajaran bagi orang-orang yang takut kepada Azab Allah yang menyakitkan. Fir’aun berpaling karena tertipu oleh kekuatan dan kekuasaannya. Dia berkata tentang Musa, “Dia tukang sihir atau orang gila.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan pada diri Musa tatkala Kami mengutusnya kepada Fir'aun dengan mukjizat-mukjizat dan hujah-hujah yang jelas, terdapat tanda bagi orang yang takut terhadap siksa yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-40. Dan Kami jadikan kisah Musa sebagai pelajaran, ketika Kami mengutusnya kepada Fir’aun dengan hujjah-hujjah yang kuat dan mukjizat-mukjizat yang luar biasa. Akan tetapi Fir’aun menyombongkan diri dan terlena dengan kekuatannya. Kemudian dia menyebarkan kebohongan bahwa Musa adalah seorang penyihir yang mahir atau orang gila. Maka Kami giring Fir’aun dan bala tentaranya menuju lautan dan Kami tenggelamkan mereka di dalamnya, dalam keadaan melakukan perbuatan tercela berupa kesombongan dan kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَفِى مُوسَىٰٓ (Dan juga pada Musa) Yakni dan Kami jadikan tanda-tanda pada Nabi Musa. إِذْ أَرْسَلْنٰهُ إِلَىٰ فِرْعَوْنَ بِسُلْطٰنٍ مُّبِينٍ (ketika Kami mengutusnya kepada Fir’aun dengan membawa mukjizat yang nyata) Yakni hujjah yang jelas, yaitu tongkat dan mukjizat-mukjizat lain yang dia datangkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Kami menjadikan kisah Musa saat kami mengutusnya kepada Fir’aun dengan hujjah yang sangat jelas sebagai tanda-tanda dan pelajaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan pada Musa ketika Kami mengutusnya kepada Fir‘aun dengan membawa mukjizat yang nyata} dalil yang tampak nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. “Dan juga Musa (terdaat tanda-tanda kekuasaan Allah),” dan apa yang dititahkan Allah ketika mengutusnya kepada Firaun dan kaumnya, berupa ayat-ayat yang jelas serta mukjizat-mukjizat yang nyata, merupakan tanda kekuasaan Allah bagi mereka yang takut akan siksaan yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 38: 38-40. Ketahuilah wahai manusia bahwa dalam kisah Musa terdapat bukti yang agung bagi mereka yang takut akan adzab Allah yang pedih; Dimana Allah mengutus Musa kepada fir’aun dengan ayat dan mukjizat yang nampak dengan jelas yang menujukkan bahwa Musa adalah Rasul yang diutus oleh Allah. Akan tetapi fir’aun dan kaumnya menolak untuk mengikuti Musa, mereka mengatakan bahwa Musa : Adalah seorang penyihir atau orang gila, itulah kesalahan mereka dan keraguan mereka; Padahal mereka tahu bahwa Musa adalah orang yang benar, Allah berfirman : وَجَحَدُوا۟ بِهَا وَٱسْتَيْقَنَتْهَآ أَنفُسُهُمْ ظُلْمًۭا وَعُلُوًّۭا , artinya : Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya. {An Naml : 14}. Dan karena sebab kesombongan fir’aun, kekufurannya, pengingkarannya, serta ke-thaghutannya, Allah menimpakan dia dan tentaranya serta pelayannya kedalam lautan dan Allah binasakan mereka dengan cara ditenggelamkan. Allah membinasakan fir’aun karena sebab dosannya yang menyebabkan celaan; Dan diantara dosanya adalah fir’aun menyeru kepada dirinya sendiri bahwa dia adalah tuhan, dan mendustakan Musa dan bersikap melampaui batas di bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 38",
    "description": "Usai menceritakan azab yang Allah timpakan kepada kaum nabi lut yang ingkar, pada ayat-ayat berikut Allah menyebut kisah umat masa lalu yang mengingkari nabinya. Kisah-kisah itu menunjukkan betapa Allah mahakuasa, dan pada kisah nabi musa juga terdapat tanda-tanda kekuasaan Allah. Bukti-bukti itu antara lain terlihat ketika kami mengutusnya kepada fira'un, yaitu penguasa mesir kuno, dengan membawa tanda kekuasaan kami, yaitu mukjizat yang nyata dan tidak terbantahkan. 39. Fira'un melihat mukjizat itu, tetapi dia bersama bala tentaranya berpaling dan dengan angkuh menolak ajakan nabi musa karena merasa dirinya berkuasa dan memiliki harta berlimpah. Dia berpaling dan berkata, 'dia, yaitu nabi musa, adalah seorang pesihir yang tidak mengenal kemampuan orang lain atau orang gila yang berbuat sesuatu tanpa berpikir terlebih dahulu. '"
  }
]