[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Dan pada pengutusan Kami terhadap Musa kepada Fir’aun dan tokoh kaumnya dengan membawa tanda-tanda dan mukjizat-mukijizat yang nyata, juga terkandung pelajaran bagi orang-orang yang takut kepada Azab Allah yang menyakitkan. Fir’aun berpaling karena tertipu oleh kekuatan dan kekuasaannya. Dia berkata tentang Musa, “Dia tukang sihir atau orang gila.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Namun Fir'aun berpaling dari kebenaran dan berkata tentang Musa -'alaihissalām- bahwa ia adalah seorang penyihir yang menyihir manusia, atau orang gila yang berbicara apa yang tidak dipahaminya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. فَتَوَلَّىٰ بِرُكْنِهِۦ (Maka dia (Fir’aun) berpaling bersama tentaranya) Yakni dia dan kaumnya berpaling dari ayat-ayat Kami. Mujahid mengatakan makna (الركن) yakni kelompok dan bala tentara yang menguatkannya. وَقَالَ سٰحِرٌ أَوْ مَجْنُونٌ (dan berkata: “Dia adalah seorang tukang sihir atau seorang gila”) Yakni Fir’aun berkata tentang Musa bahwa dia hanyalah tukang sihir atau orang gila; ia mengatakan ini hanya untuk memperdaya kaumnya, sebab ia mengetahui bahwa mukjizat-mukjizat yang ia lihat darinya tidak akan mampu dilakukan oleh seorang penyihir atau orang gila."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Di sisi lain, Fir’aun dengan sombongnya menolak untuk beriman kepada risalah Musa dan berkata bahwa Musa adalah penyihir atau orang gila"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia bersama bala tentaranya berpaling} lalu Fir’aun berpaling seraya membuat tipu daya dengan kekuatan dan bala tentaranya {dan berkata,“seorang penyihir atau orang gila”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. ketika Musa mendatangi Firaun dengan segala bukti yang nyata itu, Firaun berpaling “bersama tentaranya,” yaitu berpaling dengan sisinya dari kebenaran tanpa mau menengoknya serta mencelanya dengan keras, mereka berkata, “Dia adalah seorang tukang sihir atau orang gila,” artinya, Musa itu datang membawa sihir atau sulap, bukan datang membawa kebenaran sama sekali, atau Musa itu orang gila yang perkataannya tidak bisa dipegang karena tidak berakal. Meski demikian, mereka –khususnya Firaun- mengetahui bahwa Nabi Musa itu benar sebagaimana yang disebutkan dalam Firman Allah, “Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya” -An-Naml:14 Nabi Musa berkata kepada Firaun: ““Sesungguhnya kamu telah mengetahui, bahwa tiada yang menurunkan mukjizat-mukjizat itu kecuali Tuhan Yang memelihara langit dan bumi sebagai bukti-bukti yang nyata”-Al-Isra:102-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 39: 38-40. Ketahuilah wahai manusia bahwa dalam kisah Musa terdapat bukti yang agung bagi mereka yang takut akan adzab Allah yang pedih; Dimana Allah mengutus Musa kepada fir’aun dengan ayat dan mukjizat yang nampak dengan jelas yang menujukkan bahwa Musa adalah Rasul yang diutus oleh Allah. Akan tetapi fir’aun dan kaumnya menolak untuk mengikuti Musa, mereka mengatakan bahwa Musa : Adalah seorang penyihir atau orang gila, itulah kesalahan mereka dan keraguan mereka; Padahal mereka tahu bahwa Musa adalah orang yang benar, Allah berfirman : وَجَحَدُوا۟ بِهَا وَٱسْتَيْقَنَتْهَآ أَنفُسُهُمْ ظُلْمًۭا وَعُلُوًّۭا , artinya : Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya. {An Naml : 14}. Dan karena sebab kesombongan fir’aun, kekufurannya, pengingkarannya, serta ke-thaghutannya, Allah menimpakan dia dan tentaranya serta pelayannya kedalam lautan dan Allah binasakan mereka dengan cara ditenggelamkan. Allah membinasakan fir’aun karena sebab dosannya yang menyebabkan celaan; Dan diantara dosanya adalah fir’aun menyeru kepada dirinya sendiri bahwa dia adalah tuhan, dan mendustakan Musa dan bersikap melampaui batas di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka tidak sekedar berpaling saja, bahkan mereka mencela kebenaran dan berkata seperti yang disebutkan dalam ayat di atas. Padahal Fir’aun dan kaumnya mengetahui bahwa Musa ‘alaihis salam adalah benar. Allah Subhaanahu wa Ta'aala berfirman, “Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya. Maka perhatikanlah betapa kesudahan orang-orang yang berbuat kebinasaan.” (Terj. An Naml: 14) Nabi Musa ‘alaihis salam juga berkata kepada Fir’aun, “Sesungguhnya kamu telah mengetahui, bahwa tidak ada yang menurunkan mukjizat-mukjizat itu kecuali Tuhan yang memelihara langit dan bumi sebagai bukti-bukti yang nyata; dan sesungguhnya aku mengira kamu, wahai Fir'aun, seorang yang akan binasa.” (Terj. Al Israa’: 102)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 39",
    "description": "Fira'un melihat mukjizat itu, tetapi dia bersama bala tentaranya berpaling dan dengan angkuh menolak ajakan nabi musa karena merasa dirinya berkuasa dan memiliki harta berlimpah. Dia berpaling dan berkata, 'dia, yaitu nabi musa, adalah seorang pesihir yang tidak mengenal kemampuan orang lain atau orang gila yang berbuat sesuatu tanpa berpikir terlebih dahulu. ' 40. Akibat keangkuhan dan penolakan fira'un terhadap dakwah nabi musa, maka kami siksa dia beserta bala tentaranya dengan berbagai musibah yang mengerikan, lalu kami lemparkan mereka ke dalam laut bagai barang yang tidak berguna. Kami menenggelamkannya hingga mati dalam keadaan tercela."
  }
]