[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami mengazab Fir’aun dan bala tentaranya. Kami menenggelamkan mereka di lautan. Dia melakukan sesuatu yang salah, disebabkan oleh kekafirannya, pengingkarannya dan kedurjanaannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Maka Kami siksa dia bersama bala tentaranya semua dan Kami lemparkan mereka ke lautan lalu mereka tenggelam dan binasa. Dan Fir'aun membawa kedustaan yang tercela bersamanya dan klaim bahwa ia adalah tuhan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. فَأَخَذْنٰهُ وَجُنُودَهُۥ فَنَبَذْنٰهُمْ فِى الْيَمِّ (Maka Kami siksa dia dan tentaranya lalu Kami lemparkan mereka ke dalam laut) Yakni Kami lemparkan mereka ke lautan. وَهُوَ مُلِيمٌ(sedang dia melakukan pekerjaan yang tercela) Yakni dia melakukan perbuatan yang tercela karena telah mengaku sebagai tuhan dan ingkar kepada Allah serta keterlaluan dalam kemaksiatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Maka kami arahkan Fir’aun serta pasukannya untuk mengepung Musa, lalu kami hempaskan mereka ke dalam lautan. Fir’aun mendatangi akibat dari sesuatu yang dia cela dengan kekufuran dan kezalimannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami menghukumnya beserta bala tentaranya, lalu Kami menenggelamkan mereka ke dalam laut} lalu Kami melemparkan mereka ke dalam laut {dalam keadaan melakukan perbuatan yang tercela} dan dia sedang melakukan perbuatan yang tercela berupa mengaku sebagai tuhan dan mendustakan rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Maka Kami siksa dia dan tentaranya lalu Kami lemparkan mereka ke dalam laut, sedang dia melakukan pekerjaan yang tercela,” yakni pendosa, melampaui batas, dan menentang Allah sehingga Allah menyiksanya dengan siksaan Tuhan Yang Mahaperkasa lagi Mahakuat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 40: 38-40. Ketahuilah wahai manusia bahwa dalam kisah Musa terdapat bukti yang agung bagi mereka yang takut akan adzab Allah yang pedih; Dimana Allah mengutus Musa kepada fir’aun dengan ayat dan mukjizat yang nampak dengan jelas yang menujukkan bahwa Musa adalah Rasul yang diutus oleh Allah. Akan tetapi fir’aun dan kaumnya menolak untuk mengikuti Musa, mereka mengatakan bahwa Musa : Adalah seorang penyihir atau orang gila, itulah kesalahan mereka dan keraguan mereka; Padahal mereka tahu bahwa Musa adalah orang yang benar, Allah berfirman : وَجَحَدُوا۟ بِهَا وَٱسْتَيْقَنَتْهَآ أَنفُسُهُمْ ظُلْمًۭا وَعُلُوًّۭا , artinya : Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya. {An Naml : 14}. Dan karena sebab kesombongan fir’aun, kekufurannya, pengingkarannya, serta ke-thaghutannya, Allah menimpakan dia dan tentaranya serta pelayannya kedalam lautan dan Allah binasakan mereka dengan cara ditenggelamkan. Allah membinasakan fir’aun karena sebab dosannya yang menyebabkan celaan; Dan diantara dosanya adalah fir’aun menyeru kepada dirinya sendiri bahwa dia adalah tuhan, dan mendustakan Musa dan bersikap melampaui batas di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka tenggelam. Karena mendustakan Nabi Musa ‘alaihis salam dan mengaku sebagai tuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 40",
    "description": "Akibat keangkuhan dan penolakan fira'un terhadap dakwah nabi musa, maka kami siksa dia beserta bala tentaranya dengan berbagai musibah yang mengerikan, lalu kami lemparkan mereka ke dalam laut bagai barang yang tidak berguna. Kami menenggelamkannya hingga mati dalam keadaan tercela. 41-42. Dan perhatikanlah pula tanda-tanda kekuasaan kami pada kisah kaum 'ad. Ingatlah ketika kami kirimkan kepada mereka angin beku atau angin panas yang membinasakan mereka. Saat bertiup, angin itu tidak membiarkan suatu apa pun yang dilandanya tetap seperti kondisinya semula, sesuai dengan ketetapan Allah. Bahkan, apa saja yang diterjang dijadikannya seperti serbuk halus yang diterbangkan angin."
  }
]