[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Dalam urusan dan pembinasaan kaum Ad juga terkandung bukti dan pelajaran bagi siapa yang merenungkan, manakala Kami mengirim kepada mereka angin yang tidak mengandung keberkahan dan tidak membawa kebaikan, yaitu angina yang tidak menerpa sesuatu kecuali ia menjadikannya seperti sesuatu yang using."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Dan pada kaum 'Ād, kaumnya Nabi Hūd terdapat tanda bagi orang yang takut terhadap siksa yang menyakitkan saat Kami kirimkan kepada mereka angin yang tidak membawa hujan dan tidak pula membuahi pepohonan serta tidak ada berkah padanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Dan pelajaran ketiga pada kisah kaum ‘Ad dan pendustaan mereka terhadap Nabi Hud, ketika Kami mengirim kepada mereka angin kencang yang menghancurkan segala yang dilewatinya, sehingga tidak menyisakan melainkan orang yang binasa yang berserakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَفِى عَادٍ (Dan juga pada (kisah) Aad) Yakni dan Kami jadikan sebuah tanda pada kisah kaum ‘Aad. إِذْ أَرْسَلْنَا عَلَيْهِمُ الرِّيحَ الْعَقِيمَ(ketika Kami kirimkan kepada mereka angin yang membinasakan) Yakni angin yang tidak membawa kebaikan ataupun keberkahan, tidak dapat membantu pembuahan tanaman dan tidak pula mengandung hujan. Itu hanyalah angin yang membawa kebinasaan dan azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Kami juga menjadikan kisah kaum ‘Ad (kaum Hud) sebagai pelajaran dan nasehat saat kami mengirimkan kepada mereka angin yang tidak membawa kebaikan, manfaat, dan air sama sekali, tidak pula memberikan kebaikan bagi pepohonan, melainkan itu adalah angin yang menghancurkan dan mengazab (mereka)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan pada kaum ‘Ad,} dan pada pembinasaan kaum ‘Ad terdapat tanda {ketika Kami mengirimkan kepada mereka angin yang membinasakan} yang tidak mengandung kebaikan dan keberkahan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Dan,” terdapat tanda kekuasaan Allah untuk mereka “pada (kisah) ‘Ad,” yaitu suatu kabilah yang terkenal, “ketika Kami kirimkan kepada mereka angin yang membinasakan,” yakni yang tidak membawa kebaikan, ketika mereka mendustakan nabi mereka, Nabi Hud."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 41: 41-42. Ketahuilah juga bahwa pada kisah yang mereka telah binasa terdapat bukti yang besar bagi mereka yang takut dengan adzab yang pedih; Dimana mereka mendustakan Rasul mereka yaitu Hud, maka Allah utus angin yang kencang kepada mereka yang tidak ada kebaikan padanya dan juga keberkahan. Dan di antara kedahsyatan angin tersebut adalah, tidaklah angin itu melewati sesuatu kecuali pasti hancur dan binasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kaum Nabi Huud ‘alaihis salam. Yaitu angin yang tidak ada kebaikannya, karena tidak membawa air hujan dan tidak mengawinkan pohon-pohon."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 41",
    "description": "41-42. Dan perhatikanlah pula tanda-tanda kekuasaan kami pada kisah kaum 'ad. Ingatlah ketika kami kirimkan kepada mereka angin beku atau angin panas yang membinasakan mereka. Saat bertiup, angin itu tidak membiarkan suatu apa pun yang dilandanya tetap seperti kondisinya semula, sesuai dengan ketetapan Allah. Bahkan, apa saja yang diterjang dijadikannya seperti serbuk halus yang diterbangkan angin"
  }
]