[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Dalam pembinasaan kaum Tsamud juga terkandung bukti dan pelajaran, manakala Nabi mereka, Shaleh berkata kepada mereka, “Silakan kalian bersenang-senang di negeri kalian selama 3 hari hingga ajal kalian habis.” Tetapi mereka mendurhakai perintah Tuhan mereka, maka halilintar azab menghancurkan mereka dan mereka menyaksikan azab tersebut dengan mata kepala mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dan pada Ṡamūd kaumnya Nabi Ṣāleḥ terdapat tanda bagi orang yang takut terhadap siksa yang menyakitkan saat dikatakan kepada mereka, “Bersenang-senanglah dengan kehidupan kalian sebelum ajal kalian habis.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43-45. Dan pelajaran keempat pada kisah kaum Tsamud dan pendustaan mereka terhadap Nabi Shalih, ketika dia memperingatkan mereka agar mereka menikmati kehidupan mereka hingga ajal tiba. Namun mereka menyelisihi perintah Allah dan menyembelih unta betina; sehingga mereka tertimpa petir yang menghancurkan, mereka melihat petir itu namun tidak dapat menghindar dari azab tersebut dan tidak dapat menyelamatkan diri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَفِى ثَمُودَ إِذْ قِيلَ لَهُمْ تَمَتَّعُوا۟ حَتَّىٰ حِينٍ (Dan pada (kisah) kaum Tsamud ketika dikatakan kepada mereka: “Bersenang-senanglah kalian sampai suatu waktu”) Yakni dan Kami jadikan sebuah tanda pada kisah kaum Tsamud, ketika Kami firmankan kepada mereka: “Hiduplah kalian dalam kenikmatan di dunia, hingga saat kalian dibinasakan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Kami juga memberikan kisah kaum Tsamud, yaitu kaum nabi Shalih sebagai pelajaran dan petunjuk saat dikatakan kepada mereka usai membantai unta: “Nikmatilah kehidupan kalian sampai akhir ajal kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan pada kaum Tsamud, ketika dikatakan kepada mereka,“Bersenang-senanglah sampai waktu tertentu”} bersenang-senanglah dengan kehidupan kalian sampai waktu selesainya ajal kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Dan pada (kisah) kaum Tsamud,” terdapat tanda-tanda kekuasaan Allah yang besar ketika Allah mengutus Nabi Shaleh kepada mereka, lalu mereka mendustakan serta menentangnya. Allah mengirimkan untuk menegaskan kerasulan beliau berupa unta sebagai tanda-tanda kebesaran Allah yang jelas, namun hal itu hanya semakin menambah mereka tinggi hati dan lari, “ketika dikatakan kepada mereka, ‘Bersenang-senanglah kamu sampai suatu waktu’.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 43: 43-45. Ketahuilah juga pada kisah Tsamud dan kebinasaan mereka terdapat bukti yang besar bagi mereka yang takut akan adzab yang pedih; Dimana mereka mendustakan Rasul mereka, yaitu Shalih yang berkata kepada mereka : Tahanlah diri-diri kalian di rumah-rumah kalian selama tiga hari lamanya, dan tahanlah diri-diri kalian dari dunia yang fana dimana akan datang waktu kebinasaan bagi kalian. Akan tetapi mereka mendustakan Rasul mereka, dan sombong atas perintah yang diperintahkan kepada mereka; Maka Allah membinasakan mereka dengan suara yang memekikkan telinga, dan mereka melihat adzab dengan mata-mata mereka sendiri, mereka tidak akan bisa apa-apa ketika adzab menimpa mereka, mereka tidak dapat lolos dan lari serta selamat. Dan tidak ada seorangpun yang dapat menolong mereka, dan tidak ada yang dapat menahan dari adzab Allah selain dari Allah sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terdapat tanda yang besar terhadap kekuasaan Allah. Ketika Allah Subhaanahu wa Ta'aala mengutus Nabi Shalih kepada mereka, lalu mereka mendustakannya dan membangkangnya, maka Allah mengirimkan unta kepada Nabi Shalih sebagai mukjizat baginya, tetapi mukjizat itu tidak membuat mereka beriman, bahkan semakin ingkar. Lebih dari itu, mereka sampai membunuh unta tersebut. Setelah mereka membunuh unta sebagai mukjizat Nabi Shalih ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 43",
    "description": "43-44. Dan perhatikanlah pula tanda-tanda kekuasaan kami pada ki-sah kaum samud. Ingatlah ketika dikatakan kepada mereka oleh nabi saleh, 'bersenang-senanglah kamu sampai waktu yang telah ditentukan oleh Allah'. Lalu mereka berlaku angkuh dan ingkar terhadap perintah tuhannya. Mereka bahkan menyembelih unta betina mukjizat nabi saleh. Akibat kedurhakaan ini maka mereka disambar oleh petir yang datang dari arah awan hitam. Mereka binasa karenanya, sedang mereka saat itu melihatnya sendiri saat azab itu menimpa"
  }
]