[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Dalam pembinasaan kaum Tsamud juga terkandung bukti dan pelajaran, manakala Nabi mereka, Shaleh berkata kepada mereka, “Silakan kalian bersenang-senang di negeri kalian selama 3 hari hingga ajal kalian habis.” Tetapi mereka mendurhakai perintah Tuhan mereka, maka halilintar azab menghancurkan mereka dan mereka menyaksikan azab tersebut dengan mata kepala mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Lalu mereka berlaku sombong terhadap perintah Rabb mereka, merasa tinggi dan takabur tidak mau beriman dan taat, maka mereka disambar petir sementara mereka melihat datangnya petir itu, karena mereka telah diancam dengan siksa tiga hari sebelum kedatangannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. فَعَتَوْا۟ عَنْ أَمْرِ رَبِّهِمْ(Maka mereka berlaku angkuh terhadap perintah Tuhannya) Yakni mereka enggan melaksanakan perintah Allah karena kesombongan mereka. فَأَخَذَتْهُمُ الصّٰعِقَةُ(lalu mereka disambar petir) Yakni mereka ditimpa segala azab yang membinasakan. وَهُمْ يَنظُرُونَ(dan mereka melihatnya) Yakni mereka melihatnya secara langsung. Pendapat lain mengatakan yakni mereka menunggu azab yang diancamkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Mereka enggan melaksanakan perintah Allah, melampaui batas dalam kezalimannya dan membantai unta itu. Maka halilintar membantai mereka. Itulah azab yang (siap) menghancurkan (mereka). Mereka melihat azab itu saat siang hari."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu mereka bersikap angkuh} lalu mereka menyombongkan diri {terhadap perintah Tuhan mereka. Lalu mereka disambar petir} suara yang membinasakan {dan mereka menyaksikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Maka mereka berlaku angkuh terhadap perintah Rabbnya, lalu mereka disambar petir,” yaitu petir yang besar dan membinasakan, “Sedang mereka melihatnya,” yakni, melihat hukuman mereka dengan mata kepala mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 44: 43-45. Ketahuilah juga pada kisah Tsamud dan kebinasaan mereka terdapat bukti yang besar bagi mereka yang takut akan adzab yang pedih; Dimana mereka mendustakan Rasul mereka, yaitu Shalih yang berkata kepada mereka : Tahanlah diri-diri kalian di rumah-rumah kalian selama tiga hari lamanya, dan tahanlah diri-diri kalian dari dunia yang fana dimana akan datang waktu kebinasaan bagi kalian. Akan tetapi mereka mendustakan Rasul mereka, dan sombong atas perintah yang diperintahkan kepada mereka; Maka Allah membinasakan mereka dengan suara yang memekikkan telinga, dan mereka melihat adzab dengan mata-mata mereka sendiri, mereka tidak akan bisa apa-apa ketika adzab menimpa mereka, mereka tidak dapat lolos dan lari serta selamat. Dan tidak ada seorangpun yang dapat menolong mereka, dan tidak ada yang dapat menahan dari adzab Allah selain dari Allah sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah berlalu tiga hari. Yakni melihat azab yang menimpa mereka itu dengan mata kepala mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 44",
    "description": "43-44. Dan perhatikanlah pula tanda-tanda kekuasaan kami pada ki-sah kaum samud. Ingatlah ketika dikatakan kepada mereka oleh nabi saleh, 'bersenang-senanglah kamu sampai waktu yang telah ditentukan oleh Allah'. Lalu mereka berlaku angkuh dan ingkar terhadap perintah tuhannya. Mereka bahkan menyembelih unta betina mukjizat nabi saleh. Akibat kedurhakaan ini maka mereka disambar oleh petir yang datang dari arah awan hitam. Mereka binasa karenanya, sedang mereka saat itu melihatnya sendiri saat azab itu menimpa. 45-46. Petir itu menyambar dengan dahsyat, maka mereka tidak mampu bangun untuk menyelamatkan diri dan juga tidak mendapat pertolongan dari siapa pun. Itulah kisah umat terdahulu yang durhaka kepada para nabinya, dan sesungguhnya sebelum itu telah kami binasakan pula kaum nuh karena keingkaran mereka. Sungguh, mereka semua adalah kaum yang fasik, durhaka, dan enggan beriman."
  }
]