[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka tidak bisa berlari dan bangkit dari azab yang menimpa mereka, mereka juga tidak bisa menolong diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Mereka tidak bisa menolak siksa yang turun kepada mereka dan mereka tidak pula mempunyai kekuatan untuk menahannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَمَا اسْتَطٰعُوا۟ مِن قِيَامٍ (Maka mereka sekali-kali tidak dapat bangun) Yakni mereka tidak mampu berdiri dari kebinasaan itu, apalagi untuk lari. Namun mereka mati bergelimpangan di rumah mereka. وَمَا كَانُوا۟ مُنتَصِرِينَ (dan tidak pula mendapat pertolongan) Yakni tidak dapat menolak azab Allah dengan bantuan orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Mereka tidak bisa bangkit ataupun lari. Mereka juga tidak terlindungi dari azab itu dengan pertolongan orang lain untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka sama sekali tidak mampu bangun} bangkit dan menolaknya {dan tidak pula mendapat pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “Maka mereka sekali-kali tidak dapat bangun,” untuk menyelamatkan diri mereka dari azab, “dan tidak pula mendapat pertolongan,” untuk diri mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 45: 43-45. Ketahuilah juga pada kisah Tsamud dan kebinasaan mereka terdapat bukti yang besar bagi mereka yang takut akan adzab yang pedih; Dimana mereka mendustakan Rasul mereka, yaitu Shalih yang berkata kepada mereka : Tahanlah diri-diri kalian di rumah-rumah kalian selama tiga hari lamanya, dan tahanlah diri-diri kalian dari dunia yang fana dimana akan datang waktu kebinasaan bagi kalian. Akan tetapi mereka mendustakan Rasul mereka, dan sombong atas perintah yang diperintahkan kepada mereka; Maka Allah membinasakan mereka dengan suara yang memekikkan telinga, dan mereka melihat adzab dengan mata-mata mereka sendiri, mereka tidak akan bisa apa-apa ketika adzab menimpa mereka, mereka tidak dapat lolos dan lari serta selamat. Dan tidak ada seorangpun yang dapat menolong mereka, dan tidak ada yang dapat menahan dari adzab Allah selain dari Allah sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menyelamatkan diri ketika azab turun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 45",
    "description": "45-46. Petir itu menyambar dengan dahsyat, maka mereka tidak mampu bangun untuk menyelamatkan diri dan juga tidak mendapat pertolongan dari siapa pun. Itulah kisah umat terdahulu yang durhaka kepada para nabinya, dan sesungguhnya sebelum itu telah kami binasakan pula kaum nuh karena keingkaran mereka. Sungguh, mereka semua adalah kaum yang fasik, durhaka, dan enggan beriman"
  }
]