[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami juga telah membinasakan kaum Nuh Sebelum mereka itu, karena mereka adalah kaum yang menyelisihi perintah Allah, menyimpang dari ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan telah Kami hancurkan kaum Nabi Nuh dengan cara tenggelam sebelum mereka yang telah disebutkan, sesungguhnya mereka adalah kaum yang keluar dari ketaatan kepada Allah maka mereka pantas untuk mendapat siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Dan Kami telah membinasakan kaum Nuh sebelum kaum-kaum itu, Kami menenggelamkan mereka dalam banjir. Mereka adalah orang-orang yang berpaling dari ketaatan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Kami juga membinasakan kaum Nuh sebelum membinasakan kaum-kaum yang telah disebutkan tersebut. Sesungguhnya mereka adalah kaum yang tidak taat kepada Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan pada kaum Nuh sebelum itu. Sesungguhnya mereka adalah kaum fasik} tidak mau taat kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Dan seperti itu juga tindakan yang dilakukan Allah terhadap kaum Nabi Nuh ketika mereka mendustakan Nuh serta menyimpang dari perintah Allah, Allah mengutus air bah dari langit dan bumi kepada mereka sehingga menenggelamkan mereka semua hingga tidak tersisa seorang kafir pun di muka bumi. Ini merupakan kebiasaan Allah serta sunnahNya terhadap orang-orang yang mendurhakaiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 46: Allah mengabarkan kebinasaan kaum Nuh, dari kaum-kaum yang sebelumnya; Dimana Allah binasakan dengan banjir bandang; Karena mereka telah mendustakan Rasul yang datang kepada mereka; Mereka adalah kaum yang keluar dari ketaatan kepada Allah dan ketauhidan kepada-Nya, mendustakan Rasul dan sombong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni demikian pula apa yang Allah lakukan terhadap kaum Nuh ‘alaihis salam ketika mereka mendustakan Nuh ‘alaihis salam dan melanggar perintah Allah, maka Allah kirimkan kepada mereka air yang melimpah dari langit dan bumi, lalu Allah tenggelamkan mereka dengannya. Inilah sunnah atau kebiasaan Allah terhadap orang-orang yang mendurhakai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 46",
    "description": "45-46. Petir itu menyambar dengan dahsyat, maka mereka tidak mampu bangun untuk menyelamatkan diri dan juga tidak mendapat pertolongan dari siapa pun. Itulah kisah umat terdahulu yang durhaka kepada para nabinya, dan sesungguhnya sebelum itu telah kami binasakan pula kaum nuh karena keingkaran mereka. Sungguh, mereka semua adalah kaum yang fasik, durhaka, dan enggan beriman. 47. Tidak hanya berkuasa mengazab umat yang durhaka dan ingkar pada ajaran nabi, Allah juga kuasa menciptakan langit dan alam semesta. Dan langit yang terhampar luas di atas kepalamu itu kami bangun dengan kekuasaan kami yang mahadahsyat dan mahasempurna, dan kami benar-benar memiliki kekuasaan yang tidak terbatas sehingga tidak ada yang dapat menghalangi kami untuk meluaskannya."
  }
]