[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami juga menciptakan langit dengan sangat bagus. Kami menjadikan langit sebagai atap bagi bumi dengan kekuatan dan kuasa besar. Sesungguhnya Kami melapangkan penjuru-penjuru dan sisi-sisinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan langit itu Kami bangun dan Kami kokohkan pembangunannya dengan kekuatan. Dan sesungguhnya Kami menguasai ujung-ujungnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-49. Allah mengabarkan kekuasaan-Nya yang besar dan kenikmatannya yang melimpah: Dan Kami menciptakan langit dengan kekuatan dan kekuasaan Kami Yang Maha Besar, dan Kami yang meluaskan penjuru-penjurunya. Dan Kami menjadikan bumi luas terbentang bagi para makhluk. Kami adalah sebaik-baik pencipta; Kami menciptakan setiap makhluk dengan dua jenis yang berbeda, agar kalian mengingat kuasa dan keagungan Allah dalam menciptakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَالسَّمَآءَ بَنَيْنٰهَا بِأَيْي۟دٍ (Dan langit itu Kami bangun dengan kekuasaan (Kami)) Yakni dengan kekuatan dan kekuasaan Kami. وَإِنَّا لَمُوسِعُونَ(dan sesungguhnya Kami benar-benar berkuasa) Yakni Kami telah meluaskan langit itu dengan seluas-luasnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Langit itu, Kami telah membangunnya dengan kekuatan dan kuasa Kami. Sesungguhnya Kami mampu menciptakannya dan sesuatu yang serupa dengannya. Kami melakukan segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Langit Kami bangun dengan tangan} kekuatan {dan sesungguhnya Kami benar-benar meluaskan} segala penjurunya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Allah berfirman menjelaskan KuasaNya yang agung, “Dan langit itu Kami bangun,” artinya, Kami ciptakan, Kami sempurnakan dan Kami jadikan atap untuk bumi dan apa pun yang berada di atas bumi, “dengan tangan-tangan (Kami),” yakni, dengan kekuatan KUasa yang besar, “dan sesungguhnya Kami benar meluaskannya,” sisi-sisi dan arah-arahnya, dan sesungguhnya Kami juga meluaskan untuk hamba-hamba Kami dengan rizki yang mana Allah tidak meninggalkan satu binatang pun di dalam sarangnya, binatang yang berada di gelombang samudra dan yang berada di seluruh kawasan bumi, baik di daratan tinggi maupun rendah, melainkan rizki yang mencukupinya pasti sampai padanya, kebaikan Allah yang mencukupinya sampai padanya. Mahasuci Dzat yang kemuliaanNya mencakup seluruh makhluk, Mahasuci Dzat yang rahmatNya meliputi seluruh manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 47: 47-48. Alla mengabarkan bahwa Dialah yang mengokohkan langit dengan kuasa dan kemampuan-Nya, dan meluaskan dengan sangat luas, dan Allah mampu meluaskan yang lebih dari itu. Allahlah yang menghamparkan bumi dan meratakannya, dan menjadikannya seperti tempat tidur atau ranjang agar manusia dapat mengambil manfaat dalam kehidupannya dan untuk tempat tinggal bagi mereka. Kemudian Allah memuji atas diri-Nya dengan berkata : Sebaik-baik yang menghamparkan adalah Kami. Maka sungguh benar Alla; Dialah yang melakukan sesuatu yang Dia kehendaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan kekuasaan Allah yang besar. Yakni meluaskan penjuru-penjuru dan ujung-ujungnya serta meluaskan rezeki kepada hamba-hamba-Nya sehingga tidak ada satu makhluk hidup pun yang tinggal di bumi dan di laut serta di penjuru alam kecuali Allah Subhaanahu wa Ta'aala menyampaikan rezeki-Nya yang cukup buatnya serta memberikan ihsan-Nya yang mencukupkannya. Maka Mahasuci Allah yang meratakan kemurahan-Nya ke segenap makhluk-Nya dan Maha banyak berkah Tuhan yang rahmat-Nya mengena kepada segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 47",
    "description": "Tidak hanya berkuasa mengazab umat yang durhaka dan ingkar pada ajaran nabi, Allah juga kuasa menciptakan langit dan alam semesta. Dan langit yang terhampar luas di atas kepalamu itu kami bangun dengan kekuasaan kami yang mahadahsyat dan mahasempurna, dan kami benar-benar memiliki kekuasaan yang tidak terbatas sehingga tidak ada yang dapat menghalangi kami untuk meluaskannya. 48. Dan bumi kami hamparkan seluas-luasnya untuk menjadi tempat tinggal manusia dan makhluk lain; maka dengan bukti-bukti itu nyatalah bahwa kami adalah sebaik-baik yang telah menghamparkan."
  }
]