[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami juga menjadikan bumi terbentang untuk manusia tinggal di atasnya. Sebaik-baik penghampar adalah Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan bumi itu Kami jadikan terhampar untuk orang-orang yang tinggal di atasnya seperti kasur bagi mereka, maka sebaik-baik yang menghamparkan adalah Kami, saat kami menghamparkannya untuk mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَالْأَرْضَ فَرَشْنٰهَا (Dan bumi itu Kami hamparkan) Yakni Kami hamparkan seperti tikar agar menjadi tempat tinggal manusia. فَنِعْمَ الْمٰهِدُونَ (maka sebaik-baik yang menghamparkan (adalah Kami)) Yakni Kami adalah sebaik-baik yang menghamparkan. Dikatakan (مهد الفراش) jika ia dihamparkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Bumi itu, Kami bentangkan dan kami susun sebagai hamparan untuk tempat tinggal, tempat istirahat dan hidup di atas permukaannya. Sebaik-baik yang memberikan hamparan (bagi kalian) adalah kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Bumi Kami hamparkan} Kami bentangkan dan Kami hamparkan {(Kamilah) sebaik-baik Dzat yang menghamparkan} Kamilah sebaik-baik yang menghaamparkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “Dan bumi itu Kami hamparkan,” artinya Kami menjadikan bumi sebagai hamparan bagi makhluk yang memungkinkan bagi mereka hidup di bumi dengan berbagai hal yang berkaitan dengan kepentingan mereka seperti tempat tinggal, tanaman, buah-buahan, tempat duduk, serta berbagai cara yang menghantarkan mereka pada maksud dan tujuan mereka. Karena hamparan itu bisa dimanfaatkan dari berbagai segi, bisa juga dimanfaatkan untuk satu sisi saja. Allah memberitahukan bahwa Dia menghamparkan bumi dengan sebaik-baiknya dan secara sempurna, Dia juga memuji diriNya sendiri karena hal itu seraya berkata, “Maka sebaik-baik yang menghamparkan,” yang menghamparkan untuk para hambaNYa sesuai keputusan hikmah dan rahmatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 48: 47-48. Alla mengabarkan bahwa Dialah yang mengokohkan langit dengan kuasa dan kemampuan-Nya, dan meluaskan dengan sangat luas, dan Allah mampu meluaskan yang lebih dari itu. Allahlah yang menghamparkan bumi dan meratakannya, dan menjadikannya seperti tempat tidur atau ranjang agar manusia dapat mengambil manfaat dalam kehidupannya dan untuk tempat tinggal bagi mereka. Kemudian Allah memuji atas diri-Nya dengan berkata : Sebaik-baik yang menghamparkan adalah Kami. Maka sungguh benar Alla; Dialah yang melakukan sesuatu yang Dia kehendaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami jadikan bumi sebagai hamparan bagi makhluk, dimana mereka dapat melakukan segala yang mereka perlukan untuk maslahat mereka, seperti membuat rumah, menanam pepohonan, menempuh jalan untuk menuju tempat yang mereka tuju, dsb. Oleh karena hamparan terkadang bisa dimanfaatkan dari segala sisi dan terkadang hanya bisa dimanfaatkan dari sisi tertentu, maka Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia telah menghamparkannya dengan sebaik-baiknya dan Dia memuji diri-Nya terhadap hal itu, firman-Nya, “Maka (Kami) sebaik-baik yang menghamparkan.” Dia menyiapkan untuk hamba-hamba-Nya yang sesuai dengan kebijaksanaan-Nya, rahmat-Nya dan ihsan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 48",
    "description": "Dan bumi kami hamparkan seluas-luasnya untuk menjadi tempat tinggal manusia dan makhluk lain; maka dengan bukti-bukti itu nyatalah bahwa kami adalah sebaik-baik yang telah menghamparkan. 49. Dan segala sesuatu di alam semesta telah kami ciptakan secara berpasang-pasangan untuk saling melengkapi. Yang demikian ini agar kamu selalu mengingat kekuasaan dan kebesaran Allah."
  }
]