[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan angin yang menerbangkan debu, lalu dengan awan yang membawa beban berat air, lalu dengan kapal-kapal yang berlayar di lautan dengan mudah dan lancar, lalu dengan malaikat yang membagikan rahmat Allah kepada makhlukNya, sesungguhnya apa yang dijanjikan kepada kalian (wahai manusia), yaitu kebangkitan dan hisab, pasti terjadi dengan yakin, dan sesungguhnya hisab dan pahala dari amal perbuatan benar-benar akan terwujud, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sesunguhnya hari perhitungan dan pembalasan yang dijanjikan Rabb kalian kepada kalian adalah benar adanya, tidak ada keraguan sama sekali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya yang dijanjikan untuk kalian berupa hari kebangkitan, yaumul mahsyar, pahala, dan hukuman itu adalah janji yang pasti terjadi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya apa yang dijanjikan kepada kalian pasti benar} pasti benar tidak ada keraguan tentangnya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 5: Kemudian datang jawaban bagi sumpah tersebut, Allah berkata : Sungguh apa yang dijanjikan kepada kalian wahai manusia, dari hari kebangkitan dan hisab atas amalan-amalan kalian, kemudian juga surga dan neraka sungguh akan terjadi dan benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 5",
    "description": "5-6. Sungguh, apa saja yang telah dijanjikan kepadamu, seperti kebangkitan manusia setelah kematiannya, perhitungan di akhirat nanti pasti benar adanya, dan sungguh, hari pembalasan seperti yang telah diingatkan oleh-Nya melalui para rasul pasti terjadi, dan tidak satu pun di antara manusia yang dapat menghindarinya"
  }
]