[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Larilah kalian (wahai manusia) dari azab Allah kepada rahmatNya dengan beriman kepada Allah dan RasulNya, mengikuti perintahNya dan menaatiNya. Sesungguhnya Aku adalah pemberi peringatan yang nyata bagi kalian. Dan Rasulullah apabila tertekan oleh suatu perkara, beliau mendirikan shalat. Dan ini adalah bentuk melarikan diri kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Maka larilah kalian dari siksa Allah menuju pahala-Nya dengan cara menaati-Nya dan tidak melakukan kemaksiatan terhadap-Nya. Sesungguhnya aku -wahai manusia- seorang pemberi peringatan kepada kalian dari siksa Allah dengan peringatan yang jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50-51. Hai Rasulullah, katakanlah kepada para hamba: “Menghadaplah kepada Allah dengan ibadah dan shalat, aku adalah pemberi peringatan kalian dari-Nya dengan penjelasan yang jelas. Dan janganlah kalian menyekutukan Allah dengan menyembah selain-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. فَفِرُّوٓا۟ إِلَى اللهِ ۖ (Maka segeralah kembali kepada (mentaati) Allah) Dengan bertaubat dari dosa-dosa kalian. إِنِّى لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ (Sesungguhnya aku seorang pemberi peringatan yang nyata dari Allah untukmu) Yakni pemberi peringatan dengan peringatan yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Katakanlah kepada mereka wahai Rasul: “Menjauhlah dari hukuman Allah, dari kemaksiatan menuju pahala dan ridhaNya dengan bertaubat, beriman dan taat (kepadaNya). Sesungguhnya aku bagi kalian hanyalah pemberi peringatan yang jelas dan ingin terlepas dari azab Allah yang disiapkan bagi setiap orang yang syirik dan berbuat maksiat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Bersegeralah kembali kepada Allah} Maka larilah dari azab Allah dengan bertaubat kepadaNya dengan beriman dan taat {Sesungguhnya aku bagi kalian adalah seorang pemberi peringatan yang jelas dariNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Tatkala Allah menyeru para hamba untuk melihat tanda-tanda kekuasaanNya yang mengharuskan mereka takut dan kembali padaNya, selanjutnya Allah memerintahkan sesuatu yang menjadi tujuan dari seruan itu, yaitu lari (mendekat) kepadaNya, maksudnya lari dan menjauh dari semua yang dibenci Allah secara lahir dan batin menuju yang dicintai Allah secara lahir dan batin, lari dari kebodohan menuju ilmu, lari dari kekufuran menuju keimanan, lari dari kemaksiatan menuju ketaatan, lari dari kelalaian menuju kewasapadaan. Siapa pun yang memenuhi semua hal tersebut, maka dia telah menyempurnakan agama secara keseluruhan, semua yang ditakuti akan lenyap darinya dan akan memperoleh tujuan yang diinginkan. Allah menyebut kembali kepadaNya sebagai lari, sebab kembali pada selain Allah terdapat berbagai hal yang ditakuti dan tidak diinginkan sedangkan kembali kepada Allah terdapat berbagai hal yang disenangi, keamanan, kesenangan, kebahagiaan dan keberuntungan. Manusia lari dari Qadha dan Qadar menuju Qadha dan Qadar. Semua orang yang engkau takuti hendaklah engkau jauhi kecuali Allah, karena hanya sekedar takut saja, maka itu berarti engkau telah berlari menuju kepadaNya. “Sesungguhnya aku seorang pemberi peringatan yang nyata dari Allah untukmu,” yakni pemberi peringatan untuk kalian akan azab Allah serta agar kalian takut dengan peringatan yang jelas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 50: 49-51. Allah mengabarkan bahwa Dialah yang menciptakan setiap sesuatunya berpasang-pasangan, bermacam-macam dan beraneka ragam. Bagi mereka ada pasangan bagi yang lain; Misalnya : Allah menciptakan kebahagiaan dan kegundahan, petunjuk dan kesesatan, malam dan siang, langit dan bumi, begitulah agar kalian berpikir akan kekuasaan Allah dan menjadikan bukti untuk mentauhidkan Allah dan membernarkan janji dan ancaman-Nya. Dan selama urusannya demikian, maka bersegeralah wahai manusia menuju Allah dengan ketauhidan dan keimanan pada-Nya, dengan taubat dan kembali kejalan-Nya, sungguh bagi kalian ada peringatan yang dijelaskan oleh pembawa peringatan akan adzab Allah dan hukuman-Nya. Kemudian Allah menegaskan akan peringatan ini, dan memerintahkan hamba-Nya untuk ikhlas beribadah kepada-Nya dengan tauhid, dan agar tidak beribadah kepada siapapun bersama dengan Allah, sungguh bagi kalian telah ada peringatan yang dibawa oleh pembawa peringatan akan adzab Allah dan hukuman dari-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Dia mengajak hamba-hamba-Nya agar memperhatikan ayat-ayat-Nya yang membuat eseorang takut dan kembali kepada-Nya, maka Dia memerintahkan yang menjadi maksud daripadanya, yaitu kembali kepada Allah, yakni meninggalkan apa yang dibenci Allah baik yang tampak maupun tersembunyi kepada yang dicintai-Nya baik yang tampak maupun yang tersembunyi, pergi kepada-Nya dari kebodohan kepada ilmu, dari kekafiran kepada keimanan, dari maksiat kepada taat, dan dari kelalaian kepada dzikrullah (mengingat Allah). Barang siapa yang telah sempurna semua perkara ini, maka telah sempurnalah agamanya dan telah hilang sesuatu yang tidak disukainya dan ia akan mendapatkan tujuan akhirnya atau cita-citanya. Allah Subhaanahu wa Ta'aala menyebut kembali kepada-Nya dengan firar (berlari kepada-Nya) karena ketika kembali kepada selain-Nya terdapat berbagai macam rasa takut dan hal yang tidak disukai, sedangkan kembali kepada-Nya terdapat berbagai hal yang disenangi, keamanan, kegembiraan, kebahagiaan dan keberuntungan, sehingga seorang hamba lari dari qadha’ dan qadar-Nya menuju kepada qadha dan qadar-Nya pula. Semua yang kita takuti biasanya kita menjauh darinya, akan tetapi jika kepada Allah, maka jalan keluarnya adalah dengan berlari kepada-Nya. Yaitu dengan menaati-Nya dan tidak mendurhakai-Nya. Terhadap azab Allah, agar kamu menjauhinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 50",
    "description": "Wahai manusia, demikian besar kekuasaan Allah, maka segeralah kembali kepada Allah dengan menaati ajaran-Nya dan menunaikan perintah-Nya. Sungguh, aku adalah seorang pemberi peringatan yang jelas dari Allah untuk kepentingan dan kebahagiaanmu. 51. Dan untuk kembali kepada-Nya janganlah kamu mengadakan tuhan yang lain untuk disembah selain Allah. Sungguh, aku merupakan seorang pemberi peringatan yang jelas dari Allah untuk kebaikan dan kesejahteraanmu."
  }
]