[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jangan mengangkat tuhan lain bersama Allah, sesungguhnya aku sangat memperingatkan kalian darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan janganlah membuat sesembahan lain bersama Allah yang kalian sembah di samping menyembah Allah. Sesungguhnya aku adalah seorang pemberi peringatan kepada kalian dari siksa Allah dengan peringatan yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Jangan kalian hadirkan tuhan lain dalam peribadatan kalian terhadap Allah. Sesungguhnya aku bagi kalian adalah orang yang mengkhawatirkan tentang azab Allah dan pemberi peringatan tentangnya. Kalimat tersebut diulang-ulang sebagai penegas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menjadikan tuhan lain bersama Allah. Sesungguhnya aku bagi kalian adalah seorang pemberi peringatan yang jelas dariNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Dan janganlah kamu mengadakan sesembahan yang lain di samping Allah.” Ini adalah termasuk salah satu bentuk berlari menuju Allah, bahkan inilah asal mula maksud berlari menuju Allah, lari dari menjadikan sesembahan selain Allah berupa patung, sekutu, kubur dan lainnya yang disembah selain Allah untuk kemudian mengikhlaskan ibadah, takut, pengharapan, doa, dan kembali hanya kepada Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 51: 49-51. Allah mengabarkan bahwa Dialah yang menciptakan setiap sesuatunya berpasang-pasangan, bermacam-macam dan beraneka ragam. Bagi mereka ada pasangan bagi yang lain; Misalnya : Allah menciptakan kebahagiaan dan kegundahan, petunjuk dan kesesatan, malam dan siang, langit dan bumi, begitulah agar kalian berpikir akan kekuasaan Allah dan menjadikan bukti untuk mentauhidkan Allah dan membernarkan janji dan ancaman-Nya. Dan selama urusannya demikian, maka bersegeralah wahai manusia menuju Allah dengan ketauhidan dan keimanan pada-Nya, dengan taubat dan kembali kejalan-Nya, sungguh bagi kalian ada peringatan yang dijelaskan oleh pembawa peringatan akan adzab Allah dan hukuman-Nya. Kemudian Allah menegaskan akan peringatan ini, dan memerintahkan hamba-Nya untuk ikhlas beribadah kepada-Nya dengan tauhid, dan agar tidak beribadah kepada siapapun bersama dengan Allah, sungguh bagi kalian telah ada peringatan yang dibawa oleh pembawa peringatan akan adzab Allah dan hukuman dari-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini temasuk lari kepada Allah, bahkan menjadi pokoknya, yaitu seorang hamba pergi dari menjadikan selain Allah sebagai tuhan menuju beribadah atau menyembah hanya kepada-Nya dan mengarahkan berbagai macam ibadah kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 51",
    "description": "Dan untuk kembali kepada-Nya janganlah kamu mengadakan tuhan yang lain untuk disembah selain Allah. Sungguh, aku merupakan seorang pemberi peringatan yang jelas dari Allah untuk kebaikan dan kesejahteraanmu. 52. Tidak hanya nabi Muhammad yang didustakan oleh kaumnya yang ingkar, para rasul terdahulu pun menghadapi tentangan kaumnya yang durhaka. Demikianlah sikap orang kafir mekah; mereka menentang dakwah nabi Muhammad dan mengatainya sebagai pendusta. Hal yang sama juga terjadi pada masa lalu; setiap kali seorang rasul yang datang untuk memberi peringatan kepada orang-orang yang sebelum mereka, mereka yang ingkar pasti menolak dan mengingkarinya serta mengatakan, 'dia itu pasti seorang pesihir atau orang gila. '."
  }
]