[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa orang-orang yang datang lebih dulu dan orang-orang yang datang kemudian saling berwasiat agar mendustakan Rasul manakala mereka sepakat berkata demikian? Mereka adalah kaum yang melampaui batas, hati dan amal mereka mirip, mereka berada di atas kekafiran dan penentangan, maka orang-orang yang datang kemudian mengucapkan apa yang diucapkan oleh orang-orang yang sebelum mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Apakah orang-orang kafir terdahulu dan orang-orang kafir yang terakhir saling berwasiat untuk mendustakan Rasul? Tidak, akan tetapi sikap melampaui batas mereka itu yang menjadikan mereka sama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. أَتَوَاصَوْا۟ بِهِۦ ۚ (Apakah mereka saling berpesan) Ini merupakan kalimat yang menunjukkan keheranan dari apa yang mereka lakukan. Yakni seakan-akan mereka mewasiatkan kepada generasi mereka selanjutnya untuk mendustakan Allah. بَلْ هُمْ قَوْمٌ طَاغُونَ(Sebenarnya mereka adalah kaum yang melampaui batas) Yakni mereka tidak mewasiatkan hal itu. namun yang menjadikan mereka berada pada jalan yang sama adalah kezaliman mereka, yaitu kekafiran mereka yang sangat keterlaluan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Apakah manusia-manusia terdahulu mewasiatkan kepada anak-cucunya untuk mendustakan para nabi? Tidak, bahkan dalam kenyataannya, mereka tidak memberikan wasiat, namun mereka hanya kaum yang zalim. Dalam kekufurannya, mereka telah melampaui batas. {Atawaashau} Hamzah pada kata tersebut adalah istifham ta’ajubi. Kaget, seakan-akan mereka saling memberikan wasiat untuk mendustakan (rasul). {Bal} sebagai jeda untuk berpindah dari satu kalimat ke kalimat lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka saling menasihati tentang itu} apakan orang tang terdahulu dari mereka menasehati orang yang akan datang untuk mendustakan para rasul, Tidak, mereka tidak saling menasehati tentang itu {Sebaliknya, mereka adalah kaum yang melampaui batas} melampaui batas dalam berbuat kekufuran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Allah berfirman bahwa perkataan-perkataan yang mereka ungkapkan, baik orang-orang yang terdahulu maupun yang datang kemudian, tidak lain merupakan perkataan yang saling mereka wasiatkan, mereka mentransformasikannya satu sama lain, maka tidak perlu heran kalau perkataan mereka itu sama, atau bahkan “sebenarnya mereka adalah kaum yang melampaui batas,” hati dan perbuatan mereka serupa dengan kekufuran dan melampaui batas sehingga perkataan mereka yang sama itu muncul dari perbuatan mereka yang melampaui batas. Dan inilah nyatanya sebagaimana yang disebutkan dalam Firman Allah, Dan orang-orang yang tidak mengetahui berkata: “Mengapa Allah tidak (langsung) berbicara dengan kami atau datang tanda-tanda kekuasaan-Nya kepada kami?” Demikian pula orang-orang yang sebelum mereka telah mengatakan seperti ucapan mereka itu; hati mereka serupa -Al-Baqarah:118 Begitu juga halnya dengan orang-orang yang beriman tatkala hati mereka serupa dalam ketundukan terhadap kebenaran serta mencari dan mengusahakannya, mereka pun bergegas menuju keimanan bersama dengan para rasul mereka, mereka mengagungkan dan menghormati rasul mereka dan berbicara dengan tutur kata yang layak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 53: 52-53. Allah menghibur Nabi-Nya ﷺ dengan berkata : Sebagaimana engkau telah didustakan oleh kaummu wahai Nabi Allah dan mereka menuduhmu dengan penyihir dan orang gila; Begitu juga yang demikian diperbuat oleh umat-umat yang telah lalu dengan para Nabi mereka. Apakah engkau melihat pesan mereka orang-orang kafir kepada para Nabi mereka ? Mereka mengatakan : Engkau adalah tukang sihir dan orang yang gila. Hakikatnya para Nabi tidaklah mengajarkan demikian; Akan tetapi mereka yang membawa pesan ini adalah orang-orang yang kafir dan melampaui batas serta orang-orang yang mendustakan dan mereka adalah orang yang berusaha merubah apa yang Nabi mereka bawa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Apakah ucapan mereka ini –baik generasi terdahulu maupun kemudian- adalah ucapan yang mereka pesankan dan mereka ajarkan kepada sesama mereka? Hal ini tidak perlu dianggap heran, karena mereka sama-sama kaum yang melampaui batas, dimana hati mereka sama sehingga ucapan dan perbuatan mereka juga sama. Sebaliknya, kaum mukmin karena hati mereka sama tunduk kepada kebenaran, mencarinya dan berusaha kepadanya, maka mereka segera beriman kepada para rasul, memuliakannya, serta berkata dengan perkataan yang layak dengan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 53",
    "description": "Sikap kaum kafir mekah dan umat terdahulu identik, maka muncul pertanyaan apakah mereka pernah saling berpesan melalui kakek moyang tentang apa yang dikatakan itu' tentu tidak. Mereka tidak saling berpesan, tetapi sebenarnya mereka adalah kaum yang melampaui batas dan be-nar-benar tidak mau beriman pada dakwah para rasul. 54. Wahai nabi Muhammad, mereka tidak akan berhenti mengingkarimu, maka berpalinglah engkau dari mereka. Biarkan mereka mencercamu, tetapi teruskan perjuanganmu mengajak mereka ke jalan Allah. Dan berkat keteguhan sikapmu dalam berdakwah, engkau sama sekali tidak keliru dan tidak pula tercela karena penolakan dan keingkaran mereka."
  }
]