[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Karena itu, berpalinglah (wahai Rasul) dari orang-orang musyrik itu hingga datang kepadamu keputusan Allah tentang mereka. Kamu tidak disalahkan oleh siapapun, karena kamu sudah menunaikan tugas risalah yang diembankan kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka berpalinglah -wahai Rasul- dari orang-orang yang mendustakan tersebut. Engkau tidak tercela karena telah menyampaikan apa yang engkau diutus untuk menyampaikannya kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-55. Hai Rasulullah, berpalinglah dari mereka dan janganlah kamu mencela dan menyalahkan dirimu sendiri. Tetaplah memberi peringatan dengan al-Qur’an, karena peringatan itu akan bermanfaat bagi orang-orang yang beriman kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Maka jauhilah mereka wahai Nabi, jangan berdebat dan berkelahi dengan mereka. Kamu tidak akan dicela jika menjauh dari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Berpalinglah} berpalinglah {dari mereka, maka kamu bukan orang yang tercela"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Allah berfirman seraya memerintahkan RasulNya agar menjauh dari orang-orang yang berpaling serta mendustakan, “Maka berpalinglah kamu dari mereka.” Artinya, jangan pedulikan mereka dan fokuslah, perhatikan urusanmu karena engkau tidak akan dicela karena dosa mereka, karena tugasmu hanyalahsebagai penyampai, engkau telah menunaikan kewajibanmu dan telah menyampaikan apa yang diutuskan padamu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 54: 54-55. Allah memerintahkan Nabi-Nya ﷺ agar mengabaikan mereka orang-orang yang mendustakan dan keras kepala dan jangan menghiraukan mereka, karena ia adalah musuh bagi urusan mereka sendiri; Dimana telah sampai kerisalahan dan tertunaikan amanh dan telah datang penasihat bagi umat, oleh karena janganlah engkau kecam seorangpun. Kemudian Allah memerintahkan untuk menasihatkan dengan Al Qur’an ini bagi siapa yang beriman dan mengikutinya, karena sebab hati mereka luluh dengan Al Qur’an ini. Maka dengan peringatan dan nasihat bermanfaat bagi ahli iman, dan barangsiapa yang Allah menginginkan kebaikan, Allah akan berikan petunjuk dan memberbaiki hatinya dan menunjuki agar mengikuti Al Qur’an yang agung ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam untuk berpaling dari orang-orang yang mendustakan. Yakni jangan pedulikan mereka, jangan hukum mereka dan kerjakanlah urusanmu. Karena engkau telah menyampaikan risalah kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 54",
    "description": "Wahai nabi Muhammad, mereka tidak akan berhenti mengingkarimu, maka berpalinglah engkau dari mereka. Biarkan mereka mencercamu, tetapi teruskan perjuanganmu mengajak mereka ke jalan Allah. Dan berkat keteguhan sikapmu dalam berdakwah, engkau sama sekali tidak keliru dan tidak pula tercela karena penolakan dan keingkaran mereka. 55. Wahai nabi Muhammad, dengan anugerah Allah, istikamahlah dalam dakwahmu dan tetaplah memberi peringatan kepada umatmu. Kalau orang-orang kafir itu tidak memperoleh faedah dari dakwahmu akibat penolakan mereka, jangan berputus asa karena sesungguhnya peringatan itu bermanfaat bagi orang-orang mukmin dan hal itu akan selalu menambah keyakinan mereka."
  }
]