[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Disamping kamu (wahai rosul) berpaling dari mereka dan tidak menghiraukan tercampaknya mereka, teruslah berdakwah kepada Allah dan menasihati orang-orang yang kamu diutus kepada mereka, karena nasihat dan peringatan tetap bermanfaat bagi orang-orang yang memiliki hati yang beriman, serta peringatan dan nasihat menegakkan hujjah atas orang-orang yang berpaling."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan janganlah berpalingmu dari mereka menghalangimu untuk menasihati dan memperingatkan mereka. Nasihatilah dan ingatkan mereka, karena mengingatkan itu akan membawa manfaat bagi orang yang beriman kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَذَكِّرْ فَإِنَّ الذِّكْرَىٰ تَنفَعُ الْمُؤْمِنِينَ (Dan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman) Berilah peringatan kaummu yang beriman dengan al-Qur’an dan pelajaran yang baik karena peringatan itu akan bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Tetaplah berdzikir dan memberi nasehat dengan Al-Qur’an, karena sesungguhnya berdzikir memberi manfaat bagi orang yang beriman, begitu pula mereka mengambil manfaat dari hal itu. Saat ayat {Fatawalla ‘Anhum} [54] diturunkan, tidak ada satupun dari kami yang berpikiran lain kecuali meyakini tentang kehancuran. Saai tu nabi SAW diperintahkan untuk berpaling dari mereka, lalu turunlah ayat {Fadzkur, Fainnadz dzikra ..} maka tenanglah diri kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Teruslah memberi peringatan karena sesungguhnya peringatan itu} peringatan dan pelajaran itu {bermanfaat bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Dan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman.” Memberi peringatan terbagi menjadi dua macam; peringatan yang perinciannya tidak diketahui namun secara garis besarnya dapat diketahui oleh fitrah dan akal sehat, karena Allah telah membentuk akal dengan fitrah yang menyukai kebaikan serta mengedepankan kebaikan dan juga membenci keburukan serta meninggalkannya. Dan syariat Allah sesuai dengan hal itu. Maka semua perintah dan larangan syariat merupakan peringatan. Peringatan yang sempurna adalah peringatan yang di dalamnya disebutkan kebaikan, keindahan dan kemaslahatan yang terdapat pada apa yang diperintahkan serta disebutkannya mudarat dari apa yang dilarang disebutkan. Kedua adalah peringatan yang diketahui oleh orang-orang yang beriman, hanya saja dilalaikan sehingga perlu diulang-ulang agar mereka ingat kembali, agar mengakar di dalam otak mereka, dan agar waspada sehingga mereka mengetahui peringatan yang disampaikan, menimbulkan semangat dan tekad tinggi yang menyebabkan mereka memanfaatkan peringatan tersebut hingga derajat mereka bisa terangkat. Allah mengabarkan bahwa peringatan itu berguna bagi orang-orang yang beriman sebab keimanan yang mereka miliki dan juga rasa takut, kembali kepada Allah, serta meniti keridhaanNya mengharuskan mereka terpengaruh oleh peringatan dan nasihat pun mengena pada tempatnya sebagaimana yang disebutkan dalam Firman Allah, “oleh sebab itu berikanlah peringatan karena peringatan itu bermanfaat, orang yang takut (kepada Allah) akan mendapat pelajaran, dan orang-orang yang celaka (kafir) akan menjauhinya.” -Al-A’la:9-11 Adapun orang yang tidak memiliki keimanan serta tidak memiliki kesiapan untuk menerima peringatan, maka peringatan sama sekali tidak berguna baginya, sama seperti tanah lembab dan asin yang tidak bisa memanfaatkan air hujan sama sekali. Orang-orang seperti ini andai seluruh ayat datang kepada mereka, tentu mereka tidak beriman hingga mereka melihat azab yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 55: 54-55. Allah memerintahkan Nabi-Nya ﷺ agar mengabaikan mereka orang-orang yang mendustakan dan keras kepala dan jangan menghiraukan mereka, karena ia adalah musuh bagi urusan mereka sendiri; Dimana telah sampai kerisalahan dan tertunaikan amanh dan telah datang penasihat bagi umat, oleh karena janganlah engkau kecam seorangpun. Kemudian Allah memerintahkan untuk menasihatkan dengan Al Qur’an ini bagi siapa yang beriman dan mengikutinya, karena sebab hati mereka luluh dengan Al Qur’an ini. Maka dengan peringatan dan nasihat bermanfaat bagi ahli iman, dan barangsiapa yang Allah menginginkan kebaikan, Allah akan berikan petunjuk dan memberbaiki hatinya dan menunjuki agar mengikuti Al Qur’an yang agung ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Memberikan peringatan terbagi dua: - Mengingatkan sesuatu yang tidak diketahui tafshil(rincian)nya, namun yang mujmal(garis besar)nya sudah diketahui berdasarkan fitrah dan akal, karena Allah telah menciptakan hati untuk mencintai kebaikan dan mengutamakannya, benci kepada keburukan dan tidak suka kepadanya, dan syariat-Nya juga sesuai dengan hal itu. Oleh karena itu, apa yang diperintahkan syariat dan yang dilarangnya, maka termasuk tadzkir (mengingatkan hal yang terpendam dalam diri manusia); tadzkir menjadi sempurna ketika disebutkan apa yang diperintahkan berupa kebaikan, keindahan dan maslahat, dan disebutkan apa yang dilarang berupa madharrat. - Mengingatkan sesuatu yang sudah diketahui kaum mukmin, akan tetapi terhempas oleh sikap lalai dan lupa, maka mereka diperingatkan, diulangi apa yang telah mereka ketahui namun mereka lalai, sekaligus untuk memunculkan rasa semangat yang menjadikan mereka dapat mengambil manfaat dan menjadi lebih baik. Allah Subhaanahu wa Ta'aala juga menerangkan, bahwa peringatan hanyalah bermanfaat bagi kaum mukmin, karena iman, rasa takut, sikap kembali dan mengikuti keridhaan Allah menjadikan peringatan bermanfaat bagi mereka dan nasihat membekas dalam hati mereka. Hal ini sebagaimana firman Allah Ta’ala, “Oleh sebab itu berikanlah peringatan karena peringatan itu bermanfaat,---Orang yang takut (kepada Allah) akan mendapat pelajaran,---Dan orang-orang yang celaka (kafir) akan menjauhinya.” (Terj. Al A’laa: 9-11) Adapun orang yang tidak memiliki iman dan kesiapan untuk menerima peringatan, maka orang ini tidaklah bermanfaat peringatan baginya seperti halnya tanah yang lembab yang tidak dapat menumbuhkan apa-apa meskipun disirami air hujan. Orang yang seperti ini meskipun semua ayat didatangkan kepada mereka, maka mereka tidak akan beriman sampai mereka melihat azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 55",
    "description": "Wahai nabi Muhammad, dengan anugerah Allah, istikamahlah dalam dakwahmu dan tetaplah memberi peringatan kepada umatmu. Kalau orang-orang kafir itu tidak memperoleh faedah dari dakwahmu akibat penolakan mereka, jangan berputus asa karena sesungguhnya peringatan itu bermanfaat bagi orang-orang mukmin dan hal itu akan selalu menambah keyakinan mereka. 56. Allah memerintah nabi Muhammad beristikamah dalam mengajak umatnya mengesakan Allah karena sesunguhnya itulah tujuan penciptaan. Aku tidak menciptakan jin dan manusia untuk kebaikan-ku sendiri. Aku tidak menciptakan mereka melainkan agar tujuan hidup mereka adalah beribadah kepada-ku karena ibadah itu pasti bermanfaat bagi mereka."
  }
]