[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku tidak menginginkan rizki dari mereka dan Aku tidak berharap mereka memberiKu makan, karena Aku adalah Pemberi rizki dan pemberi (segala sesuatu). Allah tidak membutuhkan makhlukNya, sebaliknya mereka yang membutuhkanNYa. Allah adalah pencipta mereka, Pemberi mereka rizki dan tidak membutuhkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Aku tidak menginginkan rezeki dari mereka dan Aku tidak menginginkan mereka untuk memberi-Ku makan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. مَآ أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَآ أُرِيدُ أَن يُطْعِمُونِ (Aku tidak menghendaki rezeki sedikitpun dari mereka dan Aku tidak menghendaki supaya mereka memberi-Ku makan) Yakni Allah menciptakan mereka bukan untuk mendapat suatu manfaat dari mereka sebagaimana seorang tuan yang memanfaatkan budaknya, namun Dia Maha Kaya dan Maha Pemberi Rezeki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Aku tidak menghendaki pemberian dari hamba-hambaKu, Aku juga tidak butuh makanan mereka, karena sesungguhnya Aku adalah Dzat yang Maha Kaya, Dzat yang memiliki kekayaan mutlak dan Dzat yang memberikan rejeki dan makanan, bukan yang diberi makan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak menghendaki rezeki sedikit pun dari mereka dan tidak menghendaki agar mereka memberi makan kepadaKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Allah tidak menginginkan “rizki sedikit pun dari mereka,” dan tidak pula “supaya memberi Aku makan.” Mahatinggi Allah Yang Mahakaya yang tidak memerlukan kepada siapa pun bagaimana pun juga, sebaliknya seluruh makhluk memerlukanNya dalam berbagai keperluan, kebutuhan pokok, dan lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 57: 57-58. Allah menjelaskan bahwa diri-Nya tidak menginginkan rezeki dari makhluk-Nya, bahkan tidak menginginkan diri-diri mereka (makhluk) untuk memberikan rezeki kepada-Nya, dan tidak juga menginginkan diberikan makan. Karena Allah lah yang Maha Pemberi Rezeki, yang mencukupi rezeki seluruh makhluk-Nya; Pemilik kekuatan dan kokoh, yang Dia memiliki kekuatan dan kekuasaan atas segalanya, yang tidak adal sesuatupun yang melemahkan-Nya di bumi maupun di langit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 57",
    "description": "Aku menciptakan manusia dan jin hanya agar mereka beribadah, bukan agar mereka memberi balasan apa pun kepada-ku. Aku tidak menghendaki rezeki atau balasan sedikit pun dari mereka dan aku tidak menghendaki agar mereka memberi makan kepada-ku, seperti halnya mereka memberi sesajian kepada dewa atau tuhan yang mereka sembah. 58. Sungguh, Allah mahakuasa dan tidak memerlukan sesuatu dari makhluknya karena dialah pemberi rezeki kepada makhluk-Nya, dan dia juga yang mempunyai kekuatan yang sangat besar lagi sangat kukuh."
  }
]