[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya hanya Allah semata Yang Maha Memberi rizki makhlukNya, Yang menjamin makanan mereka, Pemilik kekuatan yang kokoh, tidak ditundukkan dan tidak dikalahkan, karena Dia memiliki kuasa dan kekuatan sempurna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Sesungguhnya Allah lah yang memberi rezeki kepada hamba-hamba-Nya, semuanya butuh kepada rezeki-Nya. Allah mempunyai kekuatan dan Mahakokoh yang tidak ada sesuatu pun yang mengalahkan-Nya. Semua jin dan manusia tunduk pada kekuatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. إِنَّ اللهَ هُوَ الرَّزَّاقُ (Sesungguhnya Allah Dialah Maha Pemberi rezeki) Yakni Dia yang memberi rezeki kepada seluruh makhluk dan mengatur urusan mereka. Dia tidak menciptakan mereka untuk mendapat suatu manfaat bagi-Nya. Maka dari itu hendaklah mereka menjalankan ibadah yang menjadi tujuan penciptaan mereka. ذُو الْقُوَّةِ الْمَتِينُ (Yang mempunyai Kekuatan lagi Sangat Kokoh) Yakni memiliki kekuatan yang sangat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Sesungguhnya hanya Allah yang memberi rejeki setiap yang membutuhkan dan Dzat yang Maha Kuat. {Al-Matiin} sebagai penegas kata sebelumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allahlah Dzat yang Maha Pemberi Rezeki yang mempunyai kekuatan lagi sangat kokoh} yang sangat sempurna kekuataanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Karena itulah Allah berfirman, “SEsungguhnya Allah, Dia-lah Maha Pemberi rizki,” artinya, banyak rizkiNya yang tidak ada satu pun binatang di muka bumi dan tidak pula yang ada di langit kecuali rizkinya menjadi tanggungan Allah. Dia-lah yang memberi rizki serta mengetahui tempat diamnya dan tempat penyimpanannya, “Yang Mempunyai Kekuatan lagi sangat kokoh.” Artinya, Dia-lah Pemilik kekuatan dan kemampuan secara keseluruhan, yang dengannya Allah menciptakan planet-planet besar, baik yang ada di bawah maupun yang ada di atas. Dengan kekuatan dan kemampuanNYa Allah mengatur semua hal, baik yang lahir maupun yang batin. kehendakNya berlaku pada seluruh manusia. Apa saja yang dikehendaki Allah, pasti terjadi dan yang tidak dikehendaki, tidak akan terjadi. Orang yang lari dariNya tidak akan melemahkanNya. Tidak ada yang bisa keluar dari kekuasaanNya. Dan di antara kekuatanNya, Allah menyampaikan rizki kepada seluruh alam, dan di antara KuasaNYa, Allah mampu membangkitkan orang-orang yang sudah mati yang sudah hancur lebur, meski telah dihempaskan oleh angin, ditelan oleh burung-burung dan binatang buas lain, meski telah tercerai berai dan terkoyak-koyak pada kedalaman bumi dan gelombang laut. Tidak seorang pun yang bisa luput dari Allah, Allah mengetahui bagian manusia yang ditelan bumi. Mahasuci Allah Yang Mahakuat dan Mahakokoh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 58: 57-58. Allah menjelaskan bahwa diri-Nya tidak menginginkan rezeki dari makhluk-Nya, bahkan tidak menginginkan diri-diri mereka (makhluk) untuk memberikan rezeki kepada-Nya, dan tidak juga menginginkan diberikan makan. Karena Allah lah yang Maha Pemberi Rezeki, yang mencukupi rezeki seluruh makhluk-Nya; Pemilik kekuatan dan kokoh, yang Dia memiliki kekuatan dan kekuasaan atas segalanya, yang tidak adal sesuatupun yang melemahkan-Nya di bumi maupun di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada satu makhluk hidup pun baik di langit maupun di bumi kecuali atas tanggungan Allah-lah rezekinya. Dia mempunyai kekuatan dan kekuasaan seluruhnya, dimana dengannya Dia mengadakan makhluk-makhluk yang besar; baik di alam bagian bawah maupun alam bagian atas, dengannya Dia bertindak pada sesuatu yang tampak maupun yang tersembunyi; kehendak-Nya berlaku pada semua makhluk. Oleh karena itu, apa yang Allah kehendaki pasti terjadi dan apa yang tidak Dia kehendaki tidak akan terjadi, tidak akan dapat meloloskan diri dari azab-Nya ketika berlari menjauhi-Nya dan tidak ada yang keluar dari kekuasaan-Nya. Termasuk kekuatan-Nya adalah Dia mengirimkan rezeki-Nya kepada seluruh alam. Termasuk kemampuan dan kekuatan-Nya juga adalah Dia membangkitkan orang-orang yang telah mati setelah jasad mereka hancur di mana pun mereka berada, sehingga tidak ada seorang pun yang dapat lolos dari-Nya, maka Mahasuci Allah Yang Mahakuat lagi Mahakokoh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 58",
    "description": "Sungguh, Allah mahakuasa dan tidak memerlukan sesuatu dari makhluknya karena dialah pemberi rezeki kepada makhluk-Nya, dan dia juga yang mempunyai kekuatan yang sangat besar lagi sangat kukuh. 59. Dengan ajaran yang disampaikan para rasul, Allah menegaskan bahwa siapa saja yang ingkar kepada-Nya maka sungguh mereka diancam dengan azab yang pedih. Karena itu, untuk orang-orang yang zalim dan tidak taat pada tuntunan-Nya pasti akan ada bagian azab seperti bagian teman-teman mereka dari generasi terdahulu yang selalu ingkar; maka janganlah mereka yang durhaka itu meminta kepada-ku untuk menyegerakan azab yang merupakan hukuman-Nya."
  }
]