[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang berbuat zhalim dengan pendustaan mereka terhadap rasulullah Muhammad akan mendapatkan bagian dari azab Allah yang akan turun kepada mereka seperti bagian orang-orang yang seperti mereka yang telah mendahului mereka, maka mereka jangan meminta disegerakan azab, sebab ia pasti datang kepada mereka, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Sesungguhnya orang-orang yang menganiaya diri mereka sendiri dengan mendustakanmu -wahai Rasul- akan mendapatkan bagian dari siksa sebagaimana bagian yang diterima oleh kawan-kawan mereka terdahulu. Siksa itu mempunyai waktu yang sudah ditentukan, maka janganlah mereka meminta kepada-Ku agar siksa mereka disegerakan sebelum masanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59-60. Allah mengancam orang-orang kafir: “Orang-orang yang menzalimi diri sendiri dengan melakukan kekafiran akan mendapat bagian azabnya; seperti bagian azab bagi orang-orang kafir seperti mereka sebelumnya; maka hendaklah mereka tidak mengharap azab itu dipercepat kedatangannya, karena cepat atau lambat azab itu pasti akan menimpa mereka. Celakalah orang-orang yang mendustakan Allah pada hari kiamat yang menjadi waktu azab yang diancamkan kepada mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. فَإِنَّ لِلَّذِينَ ظَلَمُوا۟ ذَنُوبًا مِّثْلَ ذَنُوبِ أَصْحٰبِهِمْ (Maka sesungguhnya untuk orang-orang zalim ada bagian (siksa) seperti bahagian teman mereka (dahulu)) Yakni bagian azab seperti bagian orang-orang kafir terdahulu. Makna (الذنوب) secara bahasa yakni ember yang besar. فَلَا يَسْتَعْجِلُونِ(maka janganlah mereka meminta kepada-Ku untuk menyegerakannya) Yakni janganlah mereka meminta-Ku untuk menyegerakan azab bagi mereka, sebab bagian azab mereka pasti mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Sesungguhnya bagi orang-orang yang menzalimi diri mereka sendiri dengan kekufuran dan kemaksiatan dari golongan penduduk Mekah dan lainnya itu suatu azab, sebagaimana nasib yang diterima kawan-kawan mereka, yaitu umat-umat terdahulu yang telah dihancurkan sebelumnya. Mereka tidak segera ditimpa azab sebagai bentuk ejekan bahwa sesunggunya azab itu akan diberikan di akhir. Sesungguhnya azab itu pasti datang dan bukan sesuatu yang mustahil."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya bagi orang-orang zalim itu bagianseperti bagian teman-teman mereka} bagian dari azab seperti bagian orang-orang yang serupa dari golongan orang-orang kafir sebelumnya {Maka janganlah mereka meminta kepadaKu untuk menyegerakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. “Maka sesungguhnya untuk orang-orang zhalim,” karena mendustakan Nabi Muhammad, mendustakan azab dan siksaan, “ada bagian,” yakni bagian dan andil seperti yang dilakukan oleh teman-teman mereka dari kalangan orang-orang zhalim dan pendusta itu, “maka janganlah mereka meminta kepadaKu menyegerakannya.” Yakni, segera meminta diturunkannya azab, karena sunnatullah terhadap seluruh umat itu sama. Semua orang yang mendustakan dan terus menerus mendustakan tanpa bertaubat dan kembali kepada Allah, maka pasti akan tertimpa azab meski azab itu ditunda sementara waktu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 59: Ketahuilah wahai manusia bahwa mereka yang dzalim pada diri-diri mereka sendiri dengan berbuat kesyirikan dan maksiat, dan mendustakan Muhammad ﷺ akan ditimpakan adzab dari adzab yang ditimpakan kaum sebelum mereka yang kafir. Tidaklah terburu-buru ditimpakan adzab kepada mereka, karena adzab itu akan datang tanpa keraguaan akan hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dan mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam. Dari kalangan orang-orang yang zalim dan mendustakan. Yakni karena sunnatullah yang berlaku pada semua umat adalah sama, yaitu bahwa setiap orang yang mendustakan dan tetap terus di atasnya tanpa bertobat dan kembali kepada-Nya, maka ia akan ditimpa azab meskipun ditunda sampai waktu tertentu. Oleh karena itulah, pada ayat selanjutnya Allah Subhaanahu wa Ta'aala mengancam mereka dengan hari Kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 59",
    "description": "Dengan ajaran yang disampaikan para rasul, Allah menegaskan bahwa siapa saja yang ingkar kepada-Nya maka sungguh mereka diancam dengan azab yang pedih. Karena itu, untuk orang-orang yang zalim dan tidak taat pada tuntunan-Nya pasti akan ada bagian azab seperti bagian teman-teman mereka dari generasi terdahulu yang selalu ingkar; maka janganlah mereka yang durhaka itu meminta kepada-ku untuk menyegerakan azab yang merupakan hukuman-Nya. 60. Bila azab Allah datang, maka celakalah orang-orang yang kafir dan mendurhakai-Nya pada hari pembalasan yang telah dijanjikan kepada mereka. Pada saat itu tidak seorang pun dapat menghindarkan diri dari balasan perbuatannya dan tidak ada pula yang dapat menyelamatkannya dari azab tersebut."
  }
]