[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan angin yang menerbangkan debu, lalu dengan awan yang membawa beban berat air, lalu dengan kapal-kapal yang berlayar di lautan dengan mudah dan lancar, lalu dengan malaikat yang membagikan rahmat Allah kepada makhlukNya, sesungguhnya apa yang dijanjikan kepada kalian (wahai manusia), yaitu kebangkitan dan hisab, pasti terjadi dengan yakin, dan sesungguhnya hisab dan pahala dari amal perbuatan benar-benar akan terwujud, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya perhitungan amal para hamba pasti terjadi pada hari Kiamat, tidak disangsikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَإِنَّ الدِّينَ لَوٰقِعٌ (sesungguhnya apa yang dijanjikan kepadamu pasti benar) Yakni janji berupa pahala dan siksaan yang pasti akan terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya balasan dan hisab itu adalah sesuatu yang pasti terjadi, bukan mustahil."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan sesungguhnya pembalasan} perhitungan dan pembalasan {pasti terjadi"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 6: Allah menegaskan kembali sumpah-Nya dengan berkata : Ketahuilah bahwa balasan dan ganjaran atas amalan-amalan di dunia dan di akhirat adalah nyata akan terjadi tanpa keraguan pada waktu yang Allah telah tentukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pembalasan setelah hisab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 6",
    "description": "5-6. Sungguh, apa saja yang telah dijanjikan kepadamu, seperti kebangkitan manusia setelah kematiannya, perhitungan di akhirat nanti pasti benar adanya, dan sungguh, hari pembalasan seperti yang telah diingatkan oleh-Nya melalui para rasul pasti terjadi, dan tidak satu pun di antara manusia yang dapat menghindarinya. 7. Melanjutkan sumpah-Nya, 'demi langit yang mempunyai jalan-jalan yang merupakan garis edar atau orbit yang teratur sebagai arah dari pergerakan semua benda langit, seperti bumi, bintang-bintang, planet-planet, dan galaksi-galaksi."
  }
]