[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kebinasaan dan kecelakaan bagi orang-orang yang kafir kepada Allah dan RasulNya pada sebuah hari yang telah diancamkan kepada mereka dengan turunnya azab saat itu, yaitu Hari Kiamat"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Maka kehancuran dan kerugian bagi orang-orang yang kafir terhadap Allah dan mendustakan Rasul mereka pada hari Kiamat yang dijanjikan kepada mereka dengan diturunkannya siksa atas mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. فَوَيْلٌ لِّلَّذِينَ كَفَرُوا۟ مِن يَوْمِهِمُ الَّذِى يُوعَدُونَ (Maka kecelakaanlah bagi orang-orang yang kafir pada hari yang diancamkan kepada mereka) Yaitu pada hari kiamat. Pendapat lain mengatakan, pada hari terjadinya perang Badar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Maka kehancuranlah bagi orang-orang kafir, juga azab yang amat sangat pedih pada hari yang telah disiapkan oleh Allah untuk memberi azab kepada mereka, yaitu hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah} Binasa dan merugilah {orang-orang kafir pada hari yang telah dijanjikan kepada mereka}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Karena itulah Allah mengancam mereka dengan adanya Hari Kiamat seraya berfirman, “Maka kecelakaanlah bagi orang-orang yang kafir pada hari yang diancamkan kepada mereka,” yaitu Hari KIamat yang diancamkan kepada mereka dengan berbagai jenis azab dan siksaan berupa rantai dan belenggu. Dan tidak ada yang bisa menolong dan menyelamatkan mereka dari azab Allah. Semoga Allah melindungi kita dari hal itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 60: Allah mengabarkan menutup surat ini dengan kebinasaan dan kerugiaan seorang hamba yang Allah lihat mereka kufur kepada Allah dan mendustakan Rasul-Nya ﷺ pada hari kimat; Itulah hari yang dijanjikan Allah yang di dalamnya terdapat adzab, hukuman, penghinaan dan kebinasaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, hari perang Badar atau hari kiamat. Pada hari Kiamat, mereka dijanjikan dengan berbagai macam azab dan siksaan, belenggu dan rantai. Ketika itu tidak ada yang menyelamatkan mereka dari azab Allah, na’uudzu billah minhu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 60",
    "description": "Bila azab Allah datang, maka celakalah orang-orang yang kafir dan mendurhakai-Nya pada hari pembalasan yang telah dijanjikan kepada mereka. Pada saat itu tidak seorang pun dapat menghindarkan diri dari balasan perbuatannya dan tidak ada pula yang dapat menyelamatkannya dari azab tersebut. 1-6. Surah a'-''riy't ditutup dengan penegasan jatuhnya ancaman Allah bagi mereka yang kafir. Surah at-t'r diawali dengan kepastian jatuhnya azab bagi mereka yang mengingkari ayat-ayat Allah. Penegasan tentang kepastian azab ini diawali dengan sumpah-sumpah Allah. Demi gunung sinai yang menjadi lokasi nabi musa menerima taurat, dan demi kitab Allah yang diwahyukan-Nya dan yang ditulis pada lembaran yang terbuka sehingga mudah dibaca dan dipahami maknanya, dan demi baitulma'mur, yaitu kakbah atau tempat yang menjadi lokasi para malaikat rukuk, sujud, dan tawaf, dan demi atap, yaitu langit, yang ditinggikan dan kukuh tanpa tiang penyangga, dan demi lautan yang penuh gelombang yang di dalam tanahnya terdapat api."
  }
]