[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Allah juga bersumpah dengan langit yang Dia ciptakan dengan baik, sesungguhnya kalian (wahai orang-orang yang mendustakan) benar-benar dalam perkataan yang tidak jelas tentang al-Quran ini dan juga tentang Rasul. Akan dipalingkan dari al-Quran dan dan Rasul ini, orang yang dipalingkan dari iman kepada keduanya, karena dia berpaling dari dalil-dalil Allah dan bukti-buktiNya yang meyakinkan, sehingga tidak diberi taufik kepada kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan Allah bersumpah dengan langit yang mempunyai jalan-jalan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Demi langit yang memiliki hiasan dan penciptaan yang indah, sungguh kalian -hai orang-orang musyrik- dalam perkataan yang bertentangan tentang al-Qur’an dan Rasulullah. Akan berpaling dari keimanan kepada al-Qur’an dan Rasulullah, orang yang dipalingkan oleh setan darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَالسَّمَآءِ ذَاتِ الْحُبُكِ (Demi langit yang mempunyai jalan-jalan) Yakni yang mempunyai penciptaan yang indah. Dan pendapat lain mengatakan maknanya adalah memiliki garis-garis dan jalan-jalan yang ada di permukaan jalan yang rata, seperti permukaan laut yang tenang jika terkena hembusan angin yang lembut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Aku bersumpah demi langit yang memiliki banyak rute untuk lintasan planet-planet."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi langit yang mempunyai jalan-jalan yang kokoh} Aku bersumpah demi langit yang memiliki jalan-jalan yang tersusun"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 7: 7-9. Allah kembali bersumpah dengan sumpah yang lain, Allah berkata : Aku bersumpah dengan langit sebagai makhluk yang indah dan elok serta tinggi, yang Allah jadikan indah dengan bintang yang berkilau, Allah juga jadikan padanya galaxy yang menjulang tinggi. Sungguh bagimu wahai orang-orang musyrik yang mendustakan, akan mempunyai ucapan yang berbeda dan berselisih satu sama lain akan Al Qur’an dan Muhammad ﷺ; Dan ketahuilah wahai orang-orang musyrik, perselisihan kalian akan Al Qur’an tidaklah sama, tidak juga dapat disatukan dan tidak juga kemana-mana kecuali (intinya) hanya kesesatan bagi diri kalian masing-masing, karena ucapan kalian bathil. Kemudian Allah menjelaskan bahwa Al Qur’an ini memalingkan dari keimanan bagi siapa yang mendustakannya dan mendustakan Rasulullah ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya adalah orbit bintang-bintang dan planet-planet."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 7",
    "description": "Melanjutkan sumpah-Nya, 'demi langit yang mempunyai jalan-jalan yang merupakan garis edar atau orbit yang teratur sebagai arah dari pergerakan semua benda langit, seperti bumi, bintang-bintang, planet-planet, dan galaksi-galaksi. 8. 'sungguh, wahai orang-orang musyrik kamu benar-benar dalam keadaan berbeda-beda pendapat, tentang nabi Muhammad dan Al-Qur'an. \" di antara mereka ada yang menganggap beliau sebagai tukang sihir, ada yang mengatakan bahwa ia adalah ahli syair, dan ada pula yang meng-anggapnya gila. Sedang mengenai Al-Qur'an, ada yang menyebutnya sebagai dongeng tentang kisah masa lalu, ada yang menilainya sebagai kitab syair, dan ada pula yang menganggapnya sebagai mantra sihir."
  }
]