[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-9. Allah juga bersumpah dengan langit yang Dia ciptakan dengan baik, sesungguhnya kalian (wahai orang-orang yang mendustakan) benar-benar dalam perkataan yang tidak jelas tentang al-Quran ini dan juga tentang Rasul. Akan dipalingkan dari al-Quran dan dan Rasul ini, orang yang dipalingkan dari iman kepada keduanya, karena dia berpaling dari dalil-dalil Allah dan bukti-buktiNya yang meyakinkan, sehingga tidak diberi taufik kepada kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dipalingkan dari iman kepada Al-Qur`ān dan kepada Nabi -ṣallallāhu 'alaihi wa sallam- orang yang telah dipalingkan darinya dalam pengetahuan Allah, karena berdasarkan ilmu-Nya, dia bukan orang yang beriman, maka ia tidak diberi taufik kepada hidayah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يُؤْفَكُ عَنْهُ مَنْ أُفِكَ (dipalingkan daripadanya (Rasul dan Al-Quran) orang yang dipalingkan) Yakni akan dipalingkan dari keimanan kepada al-Qur’an orang yang layak dipalingkan dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dia dipalingkan dari Al-Qur’an dan Rasul ini serta keimanan terhadap keduanya. Dia dipalingkan dari petunjuk oleh setan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Telah dijauhkan darinya} Dijaukan dari keimanan dengan Al-Qur’an dan nabi Muhammad SAW {orang yang dipalingkan} orang yang dipalingkan dari petunjuk sebelumnya dalam ilmu Allah"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zariyat ayat 9: 7-9. Allah kembali bersumpah dengan sumpah yang lain, Allah berkata : Aku bersumpah dengan langit sebagai makhluk yang indah dan elok serta tinggi, yang Allah jadikan indah dengan bintang yang berkilau, Allah juga jadikan padanya galaxy yang menjulang tinggi. Sungguh bagimu wahai orang-orang musyrik yang mendustakan, akan mempunyai ucapan yang berbeda dan berselisih satu sama lain akan Al Qur’an dan Muhammad ﷺ; Dan ketahuilah wahai orang-orang musyrik, perselisihan kalian akan Al Qur’an tidaklah sama, tidak juga dapat disatukan dan tidak juga kemana-mana kecuali (intinya) hanya kesesatan bagi diri kalian masing-masing, karena ucapan kalian bathil. Kemudian Allah menjelaskan bahwa Al Qur’an ini memalingkan dari keimanan bagi siapa yang mendustakannya dan mendustakan Rasulullah ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari hidayah atau dari beriman dalam ilmu Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zariyat Ayat 9",
    "description": "Dengan sifat dan sikap yang ingkar dari orang-orang musyrik tersebut, mereka semakin dipalingkan darinya, yaitu dari Al-Qur'an dan rasul, sehingga mereka semakin jauh dan benar-benar sebagai orang yang dipalingkan dari jalan yang lurus karena keingkaran hatinya sehingga lebih mengedepankan bisikan nafsunya ketimbang tuntunan Allah dan rasul-Nya. 10-11. Binasa dan terkutuklah orang-orang yang banyak berdusta dan sering berbicara dengan tanpa dasar sehingga menyesatkan orang, mereka yang berperilaku demikian yaitu orang-orang yang terbenam dalam ke-sesatan, kebodohan dan sering kali berada dalam kelalaian, sehingga tidak memperhatikan bukti-bukti tentang kekuasaan Allah dan petunjuk-petunjuk-Nya."
  }
]