[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Alif Lam Mim). Pembicaraan tentang huruf-huruf terputus (di awal surat seperti ini) telah berlalu di awal Surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Mīm. Pembahasan tentang huruf-huruf seperti ini telah disebutkan di permulaan surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an. Ibnu Abbas berkata tentang firman Allah () yakni, Romawi akan kalah, kemudian meraih kemenagan. Orang-orang musyrik menginginkan Persia dapat mengalahkan Romawi karena sama-sama penyembah berhala, sedangkan orang-orang beriman menginginkan Romawi dapat mengalahkan Persia karena mereka adalah Ahli kitab. Orang-orang musyrik menyampaikan ini kepada Abu Bakar, kemudian dia menyampaikannya kepada Rasulullah. Maka Rasulullah berkata: “Persia akan meraih kemenangan”. Lalu Abu Bakar menyampaikan ini kepada orang-orang musyrik Makkah. Mereka berkata: “Tentukanlah waktu tertentu, jika dalam masa itu Persia menang maka kami dapat mengambil sejumlah harta darimu, namun jika Romawi menang maka kalian dapat mengambil sejumlah harta dari kami”. Maka Abu Bakar menentukan waktu selama lima tahun kedepan; akan tetapi Romawi tidak juga mendapat kemenangan, sehingga Abu Bakar menyampaikan hal ini kepada Rasulullah. Maka Rasulullah bersabda: “Mengapa kamu tidak menetapkan sedikit di bawah (sepuluh tahun)?” Abu Bakar berkata: “Aku rasa yang dimaksud adalah (sedikit di bawah) sepuluh tahun. Abu Sa’id berkata: (البضع) [dari ayat (في بضع سنين)] adalah kurang dari sepuluh. Kemudian Romawi meraih kemenangan setelah itu. itulah maksud dari firman Allah: (Alif laam Miim. Telah dikalahkan bangsa Rumawi) hingga firman-Nya: (Karena pertolongan Allah. Dia menolong siapa yang dikehendaki-Nya.) [Ar-Ruum: 1-5] Sufyan berkata: “Aku mendengar mereka (Romawi) mengalahkan Persia saat terjadi perang Badar.” (Diriwayatkan oleh Imam at-Tirmidzi dalam as-Sunan 5/343-345, kitab tafsir, bab surat ar-Rum, no. 3193. Dishahihkan oleh al-Albani dalam Shahih sunan at-Tirmidzi no. 2551; dan dishahihkan Imam al-Hakim dalam al-Mustadrak 2/410, dan di sepakati oleh Imam ad-Dzahabi)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Alif, Lam, Mim. Huruf-huruf ini untuk memberi perhatian dan memotivasi pendengar agar menerima Al-Qur’an dan menantang bangsa Arab yang menolak Al-Qur’an yang kata-kata dan kalimatnya tersusun dari huruf-huruf ini dan huruf lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Mīm"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. bangsa Persia dan bangsa romawi pada saat itu merupakan dua negara super power yang ada di muka bumi ini; dan selalu terjadi peperangan diantara dua bangsa ini sebagaimana biasa terjadi pada bangsa-bangsa yang selevel. Bangsa Persia adalah penyembah api, sedangkan bangsa romawi adalah ahli kitab yang berafilasi kepada Taurat dan injil, dan mereka lebih dekat kepada kaum muslimin daripada bangsa Persia. {orang-orang mukmin] sangat senang kalau bangsa romawi menang dan dapat mengalahkan bangsa Persia berada dalam kesyirikan, maka mereka senang kalau bangsa Persia menang atas bangsa romawi. Lalu ternyata bangsa Persia dapat menang atas bangsa romawi, dan mereka dapat mengalahkan bangsa romawi, namun tidak sampai menguasai kerajaan mereka, bahkan sedikitpun dari daerah kekuasaan romawi. Maka kaum musyrikin Arab pun sangat bergembira dengannya, sedangkan kaum Muslimin bersedih. Maka dari itu Allah mengabarkan kepada mereka dan menjanjikkan bahkan bangsa romawi akan mengalahkan bangsa Persia. “dalam beberapa tahun lagi,” Sembilan atau delapan tahun lagi, atau semisal hal itu, tidak lebih dari sepuluh tahun lagi dan tidak pula kurang dari tiga tahun; dan sesungguhnya kemenangan bangsa Persia terhadap bangsa romawi, lalu kemenangan bangsa romawi terhadap bangsa Persia semuanya terjadi atas kehendak dan kekuasaanNya. Dari itu Allah berfirman, ”milik Allah-lah urusan sebelum dan sesudahnya,” jadi kemenangan dan pertolongan itu tidak hanya sekedar disebabkan terwujudnya sebab kausalitas (fasilitas dan perlengkapan), melainkan pasti diiringi oleh qadha dan qadar. “dan di hari,” maksudnya, pada hari bangsa romawi dapat memenangkan bangsa Persia dan mengalahkan mereka, “bergembiralah orang-orang yang beriman, karena pertolongan Allah. Dia menolong siapa yang dikehendakiNya,” maksudnya, mereka bergembira dengan kemenangan bangsa romawi atas bangsa Persia, sekalipun semuanya adalah orang-orang kafir, akan tetapi sebagian keburukan (suatu kaum) itu lebih ringan daripada (keburukan dari kaum) yang lain. Dan pada saat itu pula kaum musyrikin berduka cita. “dan Dia-lah Yang Mahaperkasa,” yang memilki keperkasaan yang dengannya Dia menaklukkan seluruh makhluk; Dia memberikan kekuasaan dari siapa yang Dia kehendaki, Dia memuliakan siapa saja yang Dia kehendaki dan menghinakan siapa saja yang Dia kehendaki. “lagi Mahapenyayang,” terhadap hamba-hambaNYa yang beriman, yang mana Dia menyediakan segala sebab kausalitas yang dapat membuat mereka bahagia, dan menolong mereka yang sama sekali di luar perhitungan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 1: Telah lalu penjelasan tentang huruf muqatha’ah di awal surat Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 1",
    "description": "Alif lam mim. 2. Ayat ini berisi prediksi Al-Qur'an terhadap kejadian yang akan datang. Bangsa romawi timur yang berpusat di konstantinopel pada awalnya telah dikalahkan oleh bangsa persia pemeluk majusi."
  }
]