[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian akibat yang diterima para pelaku keburukan dari kalangan orang-orang yang melampaui batas dan orang-orang kafir adalah akibat yang paling buruk dan paling jelek, karena mereka mendustakan Allah dan menghina ayat-ayatNya yang Dia turunkan kepada para rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Kemudian bagaimana kesudahan orang-orang yang telah berbuat keburukan dengan melakukan kesyirikan terhadap Allah dan mengerjakan perbuatan yang buruk. Kesudahan yang sampai pada batas paling buruk, karena mereka mendustakan ayat-ayat Allah dan mengolok-oloknya serta menghinanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Dan balasan bagi orang-orang yang senantiasa berbuat dosa itu adalah balasan yang paling buruk dan berat, sebab mereka mendustakan dan menghina ayat-ayat Allah yang diturunkan kepada para rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. ثُمَّ كَانَ عٰقِبَةَ الَّذِينَ أَسٰٓـُٔوا۟ السُّوٓأَىٰٓ (Kemudian, akibat orang-orang yang mengerjakan kejahatan adalah (azab) yang lebih buruk) Yakni kesudahan mereka adalah kesudahan yang paling buruk. Pendapat lain mengatakan (السوأى) adalah salah satu nama dari Jahannam, sebagaimana (الحسنى) adalah salah satu nama dari surga. أَن كَذَّبُوا۟ بِـَٔايٰتِ اللهِ (karena mereka mendustakan ayat-ayat Allah) Yakni akibat mereka mendustakan ayat-ayat Allah yang Allah turunkan kepada para Rasul-Nya. Pendapat lain mengatakan makna ayat ini adalah, kemudian kesudahan dari orang yang berbuat amal yang paling buruk berupa menyekutukan Allah adalah pendustaan dan olok-olok."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kemudian akibat dari orang-orang jahat yang mengingkari Allah dan bermaksiat terhadap perintah-perintahNya adalah seburuk-buruk akibat di akhirat, karena mereka mendustakan ayat-ayat Allah yang diturunkan untuk para rasul dan mengolok-oloknya. As-Suwa adalah bentuk muannats dari Al-Aswa’"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian kesudahan orang-orang yang berbuat jahat} orang-orang yang berbuat jahat berupa kemusyrikan dan kemaksiatan {adalah yang paling buruk} kesudahan yang berakhir pada sesuatu yang buruk, yaitu neraka {karena mereka mendustakan} karena mereka mendusrakan {ayat-ayat Allah dan selalu memperolok-olokkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “kemudian, akibat orang-orang yang mengerjakan kejahatan,” maksudnya, orang-orang yang berbuat kejahatan, “adalah yang lebih buruk,” yakni keadaan yang buruk lagi sangat keji, dan hal itu mendorong mereka untuk “mendustakan ayat-ayat Allah dan mereka selalu memperolok-oloknya,” ini adalah hukuman terhadap kejahatan dan dosa-dosa mereka. Kemudian perolok-olokan dan pendustaan itu menjadi sebab bagi munculnya siksaan yang lebih besar dan lebih mengenaskan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 10: Kemudian kembalinya serta balasan dengan keburukan adalah hukuman bagi pelaku keburukan, kufur dan yang mendustakan; Karena sebab mereka menolak ayat-ayat Allah dan tidak beriman dengannya, tidak juga mengikuti para utusan Allah, karena mereka adalah orang-orang yang sombong, tukang olok-olok yang mengikuti hawa nafsu mereka akan ayat-ayat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu neraka Jahanam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 10",
    "description": "Apabila mereka tetap berperilaku buruk maka keburukan pula yang akan mereka terima. Kemudian azab yang lebih buruk di akhirat kelak merupakan kesudahan bagi orang-orang yang mengerjakan kejahatan'mereka kekal di neraka. Yang demikian ini karena mereka telah mendustakan ayat-ayat Allah yang membuktikan keesaan-Nya dan mereka pun selalu memperolok-olokkannya. 11. Tempat kembali orang berdosa adalah neraka, yaitu setelah mereka dibangkitkan dari kematian mereka di akhirat kelak. Ayat ini menunjukkan keniscayaan hari kebangkitan itu. Allah sang mahakuasalah yang memulai penciptaan makhluk, kemudian dia pula yang mengulanginya kembali, yakni membangkitkannya kembali, dan hal itu semestinya lebih mudah bagi-Nya; kemudian kepada-Nya kamu dikembalikan untuk memperoleh balasan yang setimpal atas amal perbuatanmu."
  }
]