[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya Allah semata yang menciptakan makhluk-makhluk seluruhnya. Dan hanya Dia yang Mahakuasa untuk mengembalikan mereka sekali lagi. Kemudian seluruh mahkluk akan kembali kepadaNya, lalu Dia membalas orang yang berbuat baik dengan kebaikannya dan orang yang berbuat buruk dengan keburukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Allah telah menciptakan makhluk tanpa ada permisalan sebelumnya kemudian Dia mematikannya, lalu mengembalikannya, lalu hanya kepada-Nya lah kalian dikembalikan untuk menghadapi perhitungan dan pembalasan pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-13. Allah menyampaikan bahwa hanya Dia yang memulai penciptaan seluruh makhluk, dan hanya Dia yang mampu mengulangi menciptaan mereka kembali setelah kematian. Seluruh makhluk akan kembali kepada-Nya pada hari kiamat untuk menjalankan hisab; pada hari itu orang-orang kafir akan merana dan merasa yakin tidak akan selamat dari azab. Mereka tidak memiliki alasan untuk membela diri, dan berhala-berhala yang mereka sembah tidak dapat memberi syafaat untuk menyelamatkan mereka dari azab, ketika itu mereka akan kafir dari tuhan-tuhan mereka yang tidak mampu menolong mereka dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. اللهُ يَبْدَؤُا۟ الْخَلْقَ ثُمَّ يُعِيدُهُۥ (Allah menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali) Yakni pertama-tama Allah menciptakan mereka, kemudian Dia menghidupkan mereka kembali setelah kematian sebagaimana mereka dahulu hidup. ثُمَّ إِلَيْهِ تُرْجَعُونَ(kemudian kepada-Nya-lah kamu dikembalikan) Dikembalikan ke tempat perhitungan, agar Allah membalas kebaikan orang yang berbuat baik dan keburukan orang yang berbuat buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Hanya Allah SWT yang memulai penciptaan makhluk, kemudian mengembalikan makluk(Nya) sekali lagi, lalu mereka dikembalikan kepadaNya untuk dihisab dan dibalas, supaya orang baik bisa diberi penghargaan dan orang buruk disiksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah memulai penciptaan, kemudian mengembalikannya lagi. Lalu hanya kepadaNyalah kalian dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-13. Allah mengabarkan bahwasannya hanya Dia-lah yang memulai penciptaan seluruh makhluk, kemudian Dia akan mengembalikan mereka, kemudian kepadaNya mereka akan dikembalikan sesudah mereka dihidupkan kembali untuk memberi balasan untuk para pelaku kejahatan (keburukan) dan kemudian balasan bagi para pelaku kebajikan, seraya berfirman, ”dan pada hari terjadinya kiamat” yaitu hari bangkitnya manusia kepada Allah Rabb semesta alam (dan mereka melihat) kiamat dengan mata kepala, pada hari itu, “orang-orang yang berdosa terdiam berputus asa,” maksudnya, mereka berputus asa dari segala kebaikan. Hal itu karena mereka tidak mempersiapkan untuk hari itu, kecuali perbuatan jahat, yaitu dosa-dosa berupa kekafiran, syirik dan berbagai maksiat. Maka tatkala mereka telah melakukan segala sebab siksaan dan mereka belum pernah mencampurinya dengan sebab-sebab pahala sedikitpun, maka mereka berputus asa, berputus harapan, merasa sangat rugi, dan semua yang mereka ada-adakan, seperti manfaat para sekutu dan para sekutu diyakini bisa memberikan syafaat sudah menjadi sia-sia. Maka dari itu Allah berfirman, ”dan sekali-kali tidak ada (sekutu) berhala bagi mereka,” yang telah mereka sembah bersama penyembahan Allah, ”yang memberi syafaat ; dan mereka mengingkari berhala mereka itu,” orang-orang musyrik berlepas diri dari sembahan-sembahan yang mereka persekutukan kepada Allah, dan para sesembahan itu pun berlepas diri, dan mereka berkata, ”kami berlepas diri kepadaMu, dan bukan kepada kami mereka dahulu menyembah (beribadah).” Mereka mengutuk dan menjauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 11: Ketahuilah wahai manusia, bahwasanya Allah Dia sajalah yang memulai penciptaan dengan mewujudkan dari ketiadaan, kemudian Allah lenyapkan dan kembalikan pada kali yang lain untuk dibalas dan dihisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia sendiri yang memulai penciptaan dan mengulangi kembali, kemudian kepada-Nya mereka dikembalikan untuk diberikan balasan. Oleh karena itulah pada ayat selanjutnya disebutkan balasan orang-orang yang berbuat kebaikan dan balasan orang-orang yang berbuat keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 11",
    "description": "Tempat kembali orang berdosa adalah neraka, yaitu setelah mereka dibangkitkan dari kematian mereka di akhirat kelak. Ayat ini menunjukkan keniscayaan hari kebangkitan itu. Allah sang mahakuasalah yang memulai penciptaan makhluk, kemudian dia pula yang mengulanginya kembali, yakni membangkitkannya kembali, dan hal itu semestinya lebih mudah bagi-Nya; kemudian kepada-Nya kamu dikembalikan untuk memperoleh balasan yang setimpal atas amal perbuatanmu. 12. Dan pada hari ketika terjadi kiamat, di mana tiap orang akan dipisah sesuai amal masing-masing, orang-orang yang berdosa, yakni kaum musyrik, hanya terdiam membisu dan tidak mampu beralasan lagi. Mereka berputus asa karena tidak bisa menyelamatkan diri dari azab Allah. Mereka bahkan berandai-andai jika dahulunya hanya seonggok tanah."
  }
]