[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan pada Hari terjadinya Kiamat orang-orang yang gemar berbuat dosa berputus asa untuk bisa selamat dari azab, mereka ditimpa kebingungan sehingga terputuslah semua hujjah (alasan)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Pada hari Kiamat, orang-orang yang berbuat dosa putus asa dari rahmat Allah, harapan mereka terputus dikarenakan terputusnya alasan mereka melakukan kekufuran terhadap Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَيَوْمَ تَقُومُ السَّاعَةُ يُبْلِسُ الْمُجْرِمُونَ (Dan pada hari terjadinya kiamat, orang-orang yang berdosa terdiam berputus asa) Yakni orang-orang musyrik berputus asa dari segala kebaikan ketika mereka melihat azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Pada hari terjadinya kiamat, orang-orang musyrik itu jauh dari keselamatan. Mereka terdiam dan bingung karena hujjah mereka terputus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) terjadi kiamat, para pendurhaka berputus asa} orang-orang yang durhaka putus asa dari setiap kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-13. Allah mengabarkan bahwasannya hanya Dia-lah yang memulai penciptaan seluruh makhluk, kemudian Dia akan mengembalikan mereka, kemudian kepadaNya mereka akan dikembalikan sesudah mereka dihidupkan kembali untuk memberi balasan untuk para pelaku kejahatan (keburukan) dan kemudian balasan bagi para pelaku kebajikan, seraya berfirman, ”dan pada hari terjadinya kiamat” yaitu hari bangkitnya manusia kepada Allah Rabb semesta alam (dan mereka melihat) kiamat dengan mata kepala, pada hari itu, “orang-orang yang berdosa terdiam berputus asa,” maksudnya, mereka berputus asa dari segala kebaikan. Hal itu karena mereka tidak mempersiapkan untuk hari itu, kecuali perbuatan jahat, yaitu dosa-dosa berupa kekafiran, syirik dan berbagai maksiat. Maka tatkala mereka telah melakukan segala sebab siksaan dan mereka belum pernah mencampurinya dengan sebab-sebab pahala sedikitpun, maka mereka berputus asa, berputus harapan, merasa sangat rugi, dan semua yang mereka ada-adakan, seperti manfaat para sekutu dan para sekutu diyakini bisa memberikan syafaat sudah menjadi sia-sia. Maka dari itu Allah berfirman, ”dan sekali-kali tidak ada (sekutu) berhala bagi mereka,” yang telah mereka sembah bersama penyembahan Allah, ”yang memberi syafaat ; dan mereka mengingkari berhala mereka itu,” orang-orang musyrik berlepas diri dari sembahan-sembahan yang mereka persekutukan kepada Allah, dan para sesembahan itu pun berlepas diri, dan mereka berkata, ”kami berlepas diri kepadaMu, dan bukan kepada kami mereka dahulu menyembah (beribadah).” Mereka mengutuk dan menjauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 12: Ketahuilah juga hari akhir yang ditegakkan kepada orang-orang musyrik pendosa dan mereka akan berputus asa dari segala kebaikan dan keselamatan. Al Iblaasu adalah keterputusan, yaitu mereka diam karena tidak memiliki hujjah lagi bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika manusia bangkit menghadap Rabbul ‘alamin dan menyaksikan peristiwa yang terjadi di alam akhirat, maka orang-orang yang berdosa berputus asa dari semua kebaikan, karena tidak ada yang mereka siapkan selain dosa, berupa syirk, kekafiran dan kemaksiatan. Karena hujjah mereka telah terputus, dan karena tidak ada yang mereka siapkan untuk menghadapi hari itu selain sebab-sebab untuk disiksa. Saat itu pula, hilanglah semua yang mereka ada-adakan selama ini, berupa anggapan bahwa sesembahan-sesembahan mereka selain Allah akan memberikan syafaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 12",
    "description": "Dan pada hari ketika terjadi kiamat, di mana tiap orang akan dipisah sesuai amal masing-masing, orang-orang yang berdosa, yakni kaum musyrik, hanya terdiam membisu dan tidak mampu beralasan lagi. Mereka berputus asa karena tidak bisa menyelamatkan diri dari azab Allah. Mereka bahkan berandai-andai jika dahulunya hanya seonggok tanah. 13. Dan pada hari itu juga tidak mungkin ada pemberi syafaat dan pertolongan bagi mereka dari berhala-berhala yang di dunia dulu mereka sembah dan harap pertolongannya. Melihat hal ini, mereka mengingkari berhala-berhala mereka itu dan berlepas diri dari mereka karena ternyata berhala-berhala itu tidak mampu membantu mereka justru pada saat dibutuhkan. Mereka bahkan menegaskan seandainya dikembalikan ke dunia, mereka bersumpah tidak akan menyembah berhala-berhala itu lagi. (lihat pula: al-baqarah/2: 166'167)."
  }
]