[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik di hari itu tidak bisa mengaharapkan syafa’at (bantuan) dari tuhan-tuhan sembahan mereka yang mereka sembah selain Allah, karena tuhan-tuhan tersebut berlepas diri dari mereka dan mereka juga berlepas diri dari tuhan-tuhan tersebut. Syafa’at itu hanya milik Allah semata, ia tidak diminta dari selainNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan para sekutu mereka -yang pernah mereka sembah selama di dunia- tidak ada yang memberikan syafaat dengan menyelamatkan mereka dari siksa, dan saat itu mereka mengingkari sekutu-sekutu mereka, yang telah menghinakan mereka tatkala mereka membutuhkannya (tidak bisa mengabulkan permintaan mereka), karena mereka semua itu sama-sama dalam kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَلَمْ يَكُن لَّهُم مِّن شُرَكَآئِهِمْ شُفَعٰٓؤُا۟ (Dan sekali-kali tidak ada pemberi syafa’at bagi mereka dari berhala-berhala mereka) Yakni para pemberi syafaat yang dapat menyelamatkan mereka dari azab Allah. وَكَانُوا۟(dan mereka) Ketika itu. بِشُرَكَآئِهِمْ(terhadap berhala-berhala itu) Yakni terhadap tuhan-tuhan yang mereka jadikan sebagai sekutu-sekutu Allah. كٰفِرِينَ(adalah orang-orang yang mengingkarinya) Yakni mengingkari ketuhanan mereka, sebab mereka ketika itu mengetahui sekutu-sekutu itu tidak dapat memberi mereka manfaat atau mudharat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Orang-orang musyrik itu tidak memiliki penolong-penolong dari sekutu-sekutu yang mereka sembah selain Allah dan mereka jadikan sekutu Allah yang menolong mereka dari azab. Ketika itu, mereka mengingkari tuhan-tuhan yang mereka jadikan sekutu-sekutu Allah dan berlepas diri dari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada bagi mereka pemberi syafaat dari sekutu-sekutu mereka, bahkan mereka mengingkari sekutu-sekutu mereka itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-13. Allah mengabarkan bahwasannya hanya Dia-lah yang memulai penciptaan seluruh makhluk, kemudian Dia akan mengembalikan mereka, kemudian kepadaNya mereka akan dikembalikan sesudah mereka dihidupkan kembali untuk memberi balasan untuk para pelaku kejahatan (keburukan) dan kemudian balasan bagi para pelaku kebajikan, seraya berfirman, ”dan pada hari terjadinya kiamat” yaitu hari bangkitnya manusia kepada Allah Rabb semesta alam (dan mereka melihat) kiamat dengan mata kepala, pada hari itu, “orang-orang yang berdosa terdiam berputus asa,” maksudnya, mereka berputus asa dari segala kebaikan. Hal itu karena mereka tidak mempersiapkan untuk hari itu, kecuali perbuatan jahat, yaitu dosa-dosa berupa kekafiran, syirik dan berbagai maksiat. Maka tatkala mereka telah melakukan segala sebab siksaan dan mereka belum pernah mencampurinya dengan sebab-sebab pahala sedikitpun, maka mereka berputus asa, berputus harapan, merasa sangat rugi, dan semua yang mereka ada-adakan, seperti manfaat para sekutu dan para sekutu diyakini bisa memberikan syafaat sudah menjadi sia-sia. Maka dari itu Allah berfirman, ”dan sekali-kali tidak ada (sekutu) berhala bagi mereka,” yang telah mereka sembah bersama penyembahan Allah, ”yang memberi syafaat ; dan mereka mengingkari berhala mereka itu,” orang-orang musyrik berlepas diri dari sembahan-sembahan yang mereka persekutukan kepada Allah, dan para sesembahan itu pun berlepas diri, dan mereka berkata, ”kami berlepas diri kepadaMu, dan bukan kepada kami mereka dahulu menyembah (beribadah).” Mereka mengutuk dan menjauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 13: Ketahuilah juga bahwasanya orang-orang musyrik pendosa pada hari kiamat tidak memiliki syafaat yang memberikan syafaat kepada mereka untuk menyelamatkan mereka dari adzab; Bahkan mereka saling menyalahkan antara yang di ikuti dan yang mengikuti dan juga sebaliknya serta sesembahan mereka saling menolak satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syafa'at: usaha perantaraan dalam memberikan sesuatu manfaat bagi orang lain atau menghindarkan sesuatu mudharat bagi orang lain. Ketika itu, orang-orang musyrik berlepas diri dari sesembahannnya, dan sesembahan mereka pun berlepas diri pula dari para penyembahnya. Menurut sebagian ahli tafsir, ayat ini diartikan, “Sedangkan mereka menjadi kafir disebabkan berhala-berhala itu.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 13",
    "description": "Dan pada hari itu juga tidak mungkin ada pemberi syafaat dan pertolongan bagi mereka dari berhala-berhala yang di dunia dulu mereka sembah dan harap pertolongannya. Melihat hal ini, mereka mengingkari berhala-berhala mereka itu dan berlepas diri dari mereka karena ternyata berhala-berhala itu tidak mampu membantu mereka justru pada saat dibutuhkan. Mereka bahkan menegaskan seandainya dikembalikan ke dunia, mereka bersumpah tidak akan menyembah berhala-berhala itu lagi. (lihat pula: al-baqarah/2: 166'167)14. Dan pada hari ketika terjadi kiamat, pada hari itu manusia terpecah-pecah menjadi beberapa kelompok. Orang yang beriman akan dimasukkan ke surga dan orang kafir serta pendurhaka akan dimasukkan ke neraka."
  }
]