[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Di Hari Kiamat, para pengikut iman dan penganut kekafiran akan berpisah. Adapun orang-orang yang beriman kepada Allah dan RasulNya dan beramal Shalih, mereka di surga, mereka dimuliakan, berbahagia dan mengenyam kenikmatan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan ketika hari Kiamat, pada saat itu manusia terbagi berdasarkan amalannya di dunia untuk mendapatkan balasannya, dari mulai yang terangkat sampai ke tempat yang tertinggi hingga yang terjerumus hingga tempat yang paling rendah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Pada hari kiamat orang-orang beriman akan terpisah dari orang-orang kafir. Orang-orang beriman yang mengerjakan amal shalih akan mendapatkan surga, di dalamnya mereka akan dimuliakan dan merasakan kebahagiaan selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَتَفَرَّقُونَ (Dan pada hari terjadinya kiamat, di hari itu mereka (manusia) bergolong-golongan) Yakni menjadi dua golongan; golongan orang-orang beriman yang menuju surga dan golongan orang-orang kafir yang menuju neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Pada hari terjadinya kiamat dan sempurnanya penghisaban, maka orang-orang mukmin dan kafir akan terpisah. Maka golongan pertama akan menuju surga dan yang lainnya akan menuju neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) terjadi kiamat, pada hari itu, manusia terpecah-belah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-16. pada hari itu, terpisahlah para pelaku kebajikan dari para pelaku keburukan, sebagaimana telah terpisah amal perbuatan mereka di dunia. “adapun orang-orang yang beriman dan mengerjakan aml shalih,” maksudnya, mereka beriman dengan sepenuh hati mereka dan membenarkannya dengan amal-amal shalih “maka mereka di dalam taman,” yang penuh dengan berbagai aneka tumbuh-tumbuhan dan berbagai hal yang digandrungi jiwa “bergembira,” maksudnya, merasa senang dan menikmati berbagai makan lezat, berbagai minuman, bidadari-bidadari cantik jelita, para pelayan, anak-anak, suara merdu, pendengaran yang mengasyikan, pemandangan-pemandangan yang sangat memukau, aroma-aroma wangi yang sedap, kegembiraan, kesenangan, kelezatan dan kesukaan, dari hal-hal yang tidak mungkin dapat diungkapkan oleh seseorang. “adapun orang-orang yang kafir,” yang mengingkari nikmatNya, dan membalasnya dengan keingkaran, “dan mendustakan ayat-ayat Kami,”yang dibawa oleh para utusan Kami, “maka mereka tetap dihadirkan di dalam siksaan,” berada di dalamnya. Mereka telah dikepung oleh jahanam dari segala penjuru, dan azab yang sangat pedih pun menusuk kedalam jantung mereka, dan bara api panas menghanguskan wajah mereka dan memotong-motong lambung dan usus mereka. Mana persamaan antara orang-orang yang mendapat kenikmatan dan orang-orang yang disiksa?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 14: Ketahuilah juga bahwasanya manusia pada hari kiamat akan terbagi menjadi beberapa kelompok (mukmin dan kafir)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada orang mukmin dan ada orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 14",
    "description": "Dan pada hari ketika terjadi kiamat, pada hari itu manusia terpecah-pecah menjadi beberapa kelompok. Orang yang beriman akan dimasukkan ke surga dan orang kafir serta pendurhaka akan dimasukkan ke neraka. 15. Masing-masing individu akan memperoleh balasan yang tingkatan dan bentuknya berbeda-beda. Maka adapun orang-orang yang beriman dan dibarengi dengan mengerjakan kebajikan, yaitu melaksanakan perintah Allah dan menjauhi larangan-Nya semata mengharap rida Allah, maka balasan mereka adalah kekal di dalam taman surga dengan bergembira."
  }
]