[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Di Hari Kiamat, para pengikut iman dan penganut kekafiran akan berpisah. Adapun orang-orang yang beriman kepada Allah dan RasulNya dan beramal Shalih, mereka di surga, mereka dimuliakan, berbahagia dan mengenyam kenikmatan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Adapun orang-orang yang beriman kepada Allah dan mengerjakan amal saleh yang diridai di sisi-Nya, maka mereka berada di dalam Surga, bergembira dengan apa yang mereka peroleh di dalamnya berupa kenikmatan abadi yang tidak pernah terputus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَأَمَّا الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ فَهُمْ فِى رَوْضَةٍ يُحْبَرُونَ (Adapun orang-orang yang beriman dan mengerjakan amal saleh, maka mereka di dalam taman (surga) bergembira) Yakni mereka di taman-taman surga penuh dengan kebahagiaan dan kesenangan, mereka di sana mendapat kenikmatan dan kemuliaan. Pendapat lain mengatakan makna يحبرون adalah mendengarkan. Yakni mereka di dalam surga mendengarkan nyanyian-nyanyian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Adapun orang-orang yang beriman kepada Allah dan rasulNya serta mengerjakan amal shalih yang diperintahkan, maka mereka itu berada di salah satu taman surga. Mereka bergembira dan dimuliakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang beriman dan beramal shalih, mereka di dalam taman} surga {bergembira} mereka bergembira"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-16. pada hari itu, terpisahlah para pelaku kebajikan dari para pelaku keburukan, sebagaimana telah terpisah amal perbuatan mereka di dunia. “adapun orang-orang yang beriman dan mengerjakan aml shalih,” maksudnya, mereka beriman dengan sepenuh hati mereka dan membenarkannya dengan amal-amal shalih “maka mereka di dalam taman,” yang penuh dengan berbagai aneka tumbuh-tumbuhan dan berbagai hal yang digandrungi jiwa “bergembira,” maksudnya, merasa senang dan menikmati berbagai makan lezat, berbagai minuman, bidadari-bidadari cantik jelita, para pelayan, anak-anak, suara merdu, pendengaran yang mengasyikan, pemandangan-pemandangan yang sangat memukau, aroma-aroma wangi yang sedap, kegembiraan, kesenangan, kelezatan dan kesukaan, dari hal-hal yang tidak mungkin dapat diungkapkan oleh seseorang. “adapun orang-orang yang kafir,” yang mengingkari nikmatNya, dan membalasnya dengan keingkaran, “dan mendustakan ayat-ayat Kami,”yang dibawa oleh para utusan Kami, “maka mereka tetap dihadirkan di dalam siksaan,” berada di dalamnya. Mereka telah dikepung oleh jahanam dari segala penjuru, dan azab yang sangat pedih pun menusuk kedalam jantung mereka, dan bara api panas menghanguskan wajah mereka dan memotong-motong lambung dan usus mereka. Mana persamaan antara orang-orang yang mendapat kenikmatan dan orang-orang yang disiksa?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 15: Allah menjelaskan bahwa mereka yang beriman kepada Allah dan membenarkan para utusan-Nya serta membuktikan keimanan mereka dengan amal shalih di sisi mereka, mereka akan berada di taman-taman surga yang bersenandung kegembiraan pada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan hati mereka dan mereka benarkan dengan amal. Di dalamnya terdapat berbagai pepohonan dan berbagai kesenangan. Mereka menikmati makanan dan minuman yang lezat di sana, memperoleh bidadari yang bermata jeli, memiliki para pelayan, mendengarkan suara yang merdu, melihat pemandangan yang indah, mencium wewangin yang semerbak, dan kenikmatan lainnya yang sulit disifatkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 15",
    "description": "Masing-masing individu akan memperoleh balasan yang tingkatan dan bentuknya berbeda-beda. Maka adapun orang-orang yang beriman dan dibarengi dengan mengerjakan kebajikan, yaitu melaksanakan perintah Allah dan menjauhi larangan-Nya semata mengharap rida Allah, maka balasan mereka adalah kekal di dalam taman surga dengan bergembira. 16. Dan adapun kelompok orang-orang yang kafir dan mendustakan ayat-ayat kami serta mengingkari pertemuan akhirat sebagai hari kebangkitan setelah kematian mereka dan hari perhitungan dari seluruh amal perbuatan mereka, maka mereka tetap berada di dalam azab neraka dan tidak akan pernah tertinggal."
  }
]