[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sedangkan orang-orang yang kafir kepada Allah, mendustakan apa yang dibawa oleh para RasulNya, dan mengingkari kebangkitan sesudah kematian, mereka tinggal di dalam azab, sebagai balasan dari pendustaan mereka terhadapnya di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Adapun orang-orang yang kafir terhadap Allah dan mendustakan ayat-ayat Kami yang diturunkan kepada para Rasul Kami serta mendustakan tentang hari Kebangkitan dan Perhitungan, maka mereka itu menetap di dalam siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Adapun orang-orang kafir yang mendustakan apa yang diturunkan Allah kepada para rasul-Nya, dan mengingkari hari kebangkitan; maka orang-orang yang jauh dari rahmat Allah itu akan kekal dalam azab, mereka tidak akan dapat keluar darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَأَمَّا الَّذِينَ كَفَرُوا۟ (Adapun orang-orang yang kafir) Yakni kafir terhadap Allah. وَكَذَّبُوا۟ بِـَٔايٰتِنَا(dan mendustakan ayat-ayat Kami) Yakni mendustakan al-Qur’an. وَلِقَآئِ الْاٰخِرَةِ (serta (mendustakan) menemui hari akhirat) Yakni mendustakan hari kebangkitan, surga, dan neraka. فَأُو۟لٰٓئِكَ فِى الْعَذَابِ مُحْضَرُونَ (maka mereka tetap berada di dalam siksaan (neraka)) Yakni mereka akan terus menerus dalam siksaan itu. Pendapat lain mengatakan maknanya adalah mereka pasti akan didatangkan dan dikupulkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Adapun orang-orang yang mengingkari Allah dan rasulNya serta mendustakan ayat-ayat Kami yang terkandung dalam Al-Qur’an dan mendustakan hari kebangkitan dan hal-hal yang berhubungan dengannya seperti surga dan neraka, maka mereka itu akan berada dalam siksa. Para malaikat akan datang untuk menyiksa mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang-orang yang ingkar dan mendustakan ayat-ayat Kami serta pertemuan di akhirat, mereka itu tetap dibawa ke dalam azab} mereka menetap di dalamnya dan tidak bisa pergi darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-16. pada hari itu, terpisahlah para pelaku kebajikan dari para pelaku keburukan, sebagaimana telah terpisah amal perbuatan mereka di dunia. “adapun orang-orang yang beriman dan mengerjakan aml shalih,” maksudnya, mereka beriman dengan sepenuh hati mereka dan membenarkannya dengan amal-amal shalih “maka mereka di dalam taman,” yang penuh dengan berbagai aneka tumbuh-tumbuhan dan berbagai hal yang digandrungi jiwa “bergembira,” maksudnya, merasa senang dan menikmati berbagai makan lezat, berbagai minuman, bidadari-bidadari cantik jelita, para pelayan, anak-anak, suara merdu, pendengaran yang mengasyikan, pemandangan-pemandangan yang sangat memukau, aroma-aroma wangi yang sedap, kegembiraan, kesenangan, kelezatan dan kesukaan, dari hal-hal yang tidak mungkin dapat diungkapkan oleh seseorang. “adapun orang-orang yang kafir,” yang mengingkari nikmatNya, dan membalasnya dengan keingkaran, “dan mendustakan ayat-ayat Kami,”yang dibawa oleh para utusan Kami, “maka mereka tetap dihadirkan di dalam siksaan,” berada di dalamnya. Mereka telah dikepung oleh jahanam dari segala penjuru, dan azab yang sangat pedih pun menusuk kedalam jantung mereka, dan bara api panas menghanguskan wajah mereka dan memotong-motong lambung dan usus mereka. Mana persamaan antara orang-orang yang mendapat kenikmatan dan orang-orang yang disiksa?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 16: Allah menjelaskan bahwa mereka yang kafir dan ingkar dengan ayat Allah serta mendustakannya dan mendustakan perjumpaan dengan Allah, hari akhir, dan hari kebangkitan; Maka mereka akan merasakan adzab jahannam yang mereka akan menempati di dalam jahannam selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengingkari nikmat itu dan menyikapinya dengan kufur; tidak bersyukur. Yakni yang dibawa para rasul Kami. Neraka Jahanam mengepung mereka dan azabnya membakar sampai naik ke hati, airnya yang panas membuat cacat muka dan memutuskan usus-usus mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 16",
    "description": "Dan adapun kelompok orang-orang yang kafir dan mendustakan ayat-ayat kami serta mengingkari pertemuan akhirat sebagai hari kebangkitan setelah kematian mereka dan hari perhitungan dari seluruh amal perbuatan mereka, maka mereka tetap berada di dalam azab neraka dan tidak akan pernah tertinggal. 17. Demikianlah Allah menjelaskan kebesaran dan keagungan-Nya dalam penciptaan langit dan bumi serta pemisahan manusia menjadi beberapa kelompok pada hari kiamat. Maka, bertasbihlah kepada Allah dan sucikanlah dia dari hal-hal yang tidak patut dengan keagungan dan kemuliaan-Nya. Ingat dan pujilah dia serta peliharalah waktu-waktu salat dengan sungguh-sungguh, pada petang hari dan pada pagi hari."
  }
]