[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Wahai orang-orang Mukmin, bertasbih dan sucikanlah Allah dari sekutu, istri dan anak. Sifatilah Dia dengan sifat-sifat kesempurnaan dengan lisan kalian. Wujudkanlah hal itu dengan anggota badan kalian seluruhnya saat kalian mendapatkan waktu petang dan waktu pagi, di waktu malam dan siang hari. BagiNya sanjungan dan pujian di langit dan di bumi, siang dan malam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Maka sucikanlah nama Allah ketika kalian memasuki waktu sore, yaitu waktu untuk melaksanakan dua salat malam; maghrib dan isya', dan sucikanlah Dia ketika kalian memasuki waktu pagi, yaitu waktu untuk melaksanakan salat subuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Hai para hamba, bertasbihlah kepada Allah, sucikanlah Dia dari segala yang tidak layak bagi-Nya, dan pujilah Dia pada waktu maghrib, isya, subuh, ashar, dan dhuhur atas kenikmatan yang Dia berikan. Segala puji bagi-Nya di tujuh langit dan bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. فَسُبْحٰنَ اللهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ (Maka bertasbihlah kepada Allah di waktu kamu berada di petang hari dan waktu kamu berada di waktu subuh) Yakni jika kalian telah mengetahui hal itu maka bertasbihlah kepada Allah. Yakni sucikanlah Dia dari apa yang tidak pantas bagi-Nya, dengan mengatakan ‘Subhanallah’ pada waktu pagi dan sore hari, pada waktu malam dan siang hari. Pendapat lain mengatakan yang dimaksud dengan tasbih di sini adalah shalat lima waktu; firman-Nya: “ketika petang hari” yakni shalat maghrib dan isya, dan firman-Nya: “ketika pagi hari” yakni shalat subuh, firman-Nya: “dan pada sore hari” yakni shalat ashar, serta firman-Nya “dan pada siang hari” yakni shalat dhuhur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Maha Suci Allah dari setiap kekurangan, maka sucikanlah Dia dan shalatlah kepadaNya di waktu pagi dan petang. Di waktu pagi adalah shalat fajar (subuh) dan di waktu petang adalah shalat maghrib dan isya’. Khususkanlah dua waktu ini dengan berdzikir supaya jelas pengaruh kekuasaan dan keagungan Tuhan di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bertasbihlah kepada Allah} shalatlah kepada Allah {ketika kamu berada pada waktu senja} ketika kalian di waktu petang, yaitu shalat maghrib dan shalat isya’ {dan waktu pagi} ketika kalian memasuki waktu pagi yaitu shalat subuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. ini adalah informasi tentang kesucian Allah dari keburukan dan kekurangan, kesucianNya dari keserupaan seseorang dari makhluk denganNya; dan suatu perintah kepada hamba-hambaNya agar bertasbih (menyucikanNya) di saat mereka berada di waktu petang dan disaat mereka berada diwaktu shubuh, waktu senja dan siang hari. Inilah lima waktu yang merupakan waktu-waktu shalat lima waktu. Allah memerintahkan kepada hamba-hambaNya untuk bertasbih dan memujiNya pada waktu-waktu tersebut dan termasuk dalam hal ini adalah yang wajib darinya, seperti yang tercakup dalam shalat lima waktu, dan yang disunnahkan seperti dzikir pagi dan sore hari, dzikir sesuai shalat wajib dan shalat-shalat Sunnah yang menyertainya. Karena sesungguhnya waktu-waktu tersebut adalah yang telah dipilih oleh Allah untuk waktu-waktu (shalat) wajib, ia merupakan waktu yang paling utama. Maka bertasbih dan bertahmid dalam waktu itu serta beribadah padanya lebih utama daripada waktu-waktu yang lain. Bahkan ibadah, sekalipun tidak mencakup bacaan “subhanallah” maka sesungguhnya keikhlasan di dalam ibadah tersebut merupakan penyucian Allah dengan perbuatan (dari) keberadaanNya mempunyai sekutu dalam ibadah, atau (dari) keberhakan seorang di antara makhluk untuk mendapatkan apa yang berhak untukNya, seperti ikhlas dan inabah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 17: Ini adalah petunjuk dari Allah kepada hamba-Nya yang beriman agar bertasbih dan mensucikan-Nya dari kesyirikan, dari memiliki sekutu dan anak. Dan agar mensifati-Nya dengan sifat yang sempurna dan juga memberikan hak-hak-Nya dari sisi seorang hamba kepada-Nya seluruhnya, ketika datang waktu sore dan pagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa’diy berkata, “Ini merupakan pemberitaan tentang kesucian-Nya dari keburukan dan kekurangan, dan kesucian-Nya dari kesamaan dengan salah satu di antara makhluk-Nya, demikian pula memerintahkan hamba untuk menyucikan-Nya di waktu sore dan pagi hari, serta di waktu malam dan siang hari. Ini adalah lima waktu; waktu-waktu shalat yang lima, di mana Allah memerintahkan hamba-hamba-Nya untuk bertasbih di sana dan memuji-Nya. Termasuk di dalamnya, yang wajib daripadanya seperti yang dikandung dalam shalat yang lima waktu, yang sunat seperti dzikr pagi dan petang serta setelah shalat, demikian pula yang bergandengan dengannya berupa perkara-perkara sunat, karena waktu-waktu tersebut adalah waktu yang dipilih Allah untuk waktu ibadah yang wajib (shalat), di mana waktu tersebut lebih utama daripada selainnya. Bertasbih, bertahmid dan beribadah di waktu itu lebih utama daripada selainnya. Bahkan beribadah meskipun tidak ada ucapan “subhaanallah”, tetapi ketika seseorang ikhlas melakukannya merupakan bentuk penyucian Allah dengan perbuatan, yakni menyucikan-Nya dari memiliki sekutu dalam ibadah, atau adanya yang merasa berhak seperti berhaknya Dia untuk diberikan keikhlasan dan sikap kembali.” Ada yang menafsirkan, “Shalatlah.” Yakni perintah untuk mendirikan shalat yang lima waktu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 17",
    "description": "Demikianlah Allah menjelaskan kebesaran dan keagungan-Nya dalam penciptaan langit dan bumi serta pemisahan manusia menjadi beberapa kelompok pada hari kiamat. Maka, bertasbihlah kepada Allah dan sucikanlah dia dari hal-hal yang tidak patut dengan keagungan dan kemuliaan-Nya. Ingat dan pujilah dia serta peliharalah waktu-waktu salat dengan sungguh-sungguh, pada petang hari dan pada pagi hari. 18. Dan hanya bagi-Nya segala bentuk pujian dan syukur, baik di langit yang berasal dari para malaikat maupun di bumi yang berasal dari manusia dan jin, pada malam hari dan pada waktu zuhur atau tengah hari."
  }
]