[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengeluarkan yang hidup dari yang mati, seperti manusia dari setetes air dan burung dari telur. Allah mengeluarkan yang mati dan yang hidup, seperti setetes air mani dari manusia dan telur dari burung. Dia menghidupkan bumi dengan tumbuhan setelah sebelumnya ia kering kerontang. Seperti penghidupan ini, kalian (wahai manusia) akan dikeluarkan dari kubur kalian dalam keadaan hidup untuk menghadapi hisab dan balasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dia mengeluarkan yang hidup dari yang mati sebagaimana Dia mengeluarkan manusia dari air mani, anak burung dari telur. Dan Dia mengeluarkan yang mati dari yang hidup sebagaimana Dia mengeluarkan mani dari manusia dan mengeluarkan telur dari ayam. Dan Dia menghidupkan bumi setelah kekeringannya dengan menurunkan hujan dan menumbuhinya. Dan sebagaimana kebangkitan bumi dengan ditumbuhinya dengan tumbuh-tumbuhan demikian pula kalian keluar dari kuburan kalian untuk mendapatkan perhitungan dan pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Dalam sembilan ayat berikut ini Allah mengingatkan tanda-tanda kebesaran-Nya yang ada dalam ciptaan-Nya dan kesempurnaan kuasa-Nya dalam mengatur hamba-hamba-Nya: “Hanya Allah yang mengeluarkan makhluk hidup dari sesuatu yang mati, seperti mengeluarkan tumbuhan hijau dari biji kering dan mengeluarkan biji kering dari tumbuhan hijau; dan Allah menghidupkan bumi dengan menumbuhkan tanaman yang sebelumnya tandus. Sebagaimana tumbuhan keluar dari tanah demikianlah kalian akan keluar dari kubur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. يُخْرِجُ الْحَىَّ مِنَ الْمَيِّتِ (Dia mengeluarkan yang hidup dari yang mati) Sebagaimana mengeluarkan manusia dari air mani, burung dari telur, dan pohon dari biji. وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَىِّ(dan mengeluarkan yang mati dari yang hidup) Sebagaimana mengeluarkan air mani dan telur dari hewan, dan biji dari pohon. وَيُحْىِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ( dan menghidupkan bumi sesudah matinya) Yakni menghidupkan bumi dengan tumbuh-tumbuhan yang sebelumnya mati kering. وَكَذٰلِكَ تُخْرَجُونَ(Dan seperti itulah kamu akan dikeluarkan) Dikeluarkan dari kubur kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Allah mengeluarkan yang hidup dari yang mati layaknya manusia (yang tercipta) dari air mani dan burung dari telur. Allah juga mengeluarkan yang mati dari yang hidup seperti air mani dan telur dari manusia. Dia menghidupkan bumi dengan tanam-tanaman setelah mati dengan kegersangan. Seperti proses pengeluaran itulah kalian akan dikeluarkan dari kubur. Maknanya mengawali dan mengulangi (penciptaan) itu adalah hal yang sama dalam kekuasaan Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup, dan menghidupkan bumi setelah mati} kekeringannya {Seperti itulah kalian akan dikeluarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “dia mengeluarkan yang hidup dari yang mati,” sebagaimana mengeluarkan tumbuh-tumbuhan dari tanah yang gersang, dan tunas dari biji, pohon dari benih, anak burung dari telur, orang Mukmin dari orang kafir, dan seterusnya, “dan mengeluarkan yang mati dari yang hidup,” kebalikan dari hal-hal tersebut,”dan menghidupkan bumi sesudah matinya,” dengan menurunkan hujan padanya ketika tanah itu kering kerontang. Lalu setelah air tirin diatasnya, hidup dan suburlah tanah itu dan menumbuhkan berbagai macam tumbuhan yang indah. “dan seperti itulah kamu akan dikeluarkan” dari kuburan kalian. Ini adalah dalil (bukti) yang pasti dan argument yang sangat telak dan menunjukkan bahwa Dzat yang telah mampu menghidupkan bumi setelah kesengsaraannya, maka (pasti) kuasa menghidupkan kembali orang-orang yang sudah mati. Maka tidak ada bedanya dalam pandangan akal yang sehat antara dua perkara tersebut, dan tidak ada alasan untuk memungkiri salah satunya dengan keberadaan yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 19: Ini adalah pengkabaran yang bahwasanya Allah menyendiri ketika mengeluarkan yang hidup dari yang mati, sebagaimana menjadikan manusia dari mani, dan tumbuhan yang mati di bumi, Dialah Allah yang bersendirian menjadikan yang mati menjadi hidup; Sebagaimana mengeluarkan mani dari manusia, telur dari burung, Dialah Allah yang menurunkan hujan dari langit dan menghidupkan tanah setelah mati dan kering. Dengan menghidupkan yang demikian wahai manusia, kalian juga akan dibangkitkan dari kubur-kubur kalian untuk dihisab dan dibalas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti manusia dari mani, burung dari telur, tumbuhan dari tanah yang mati, pohon dari sebuah biji, dsb. Seperti keluarnya mani dan telur dari makhluk hidup. Dia menurunkan hujan ke bumi, lalu hiduplah bumi itu dan menjadi subur serta menumbuhkan berbagai jenis pasangan tumbuhan yang indah. Ia merupakan dalil yang pasti, bahwa yang menghidupkan bumi setelah matinya mampu menghidupkan orang-orang yang telah mati. Menurut akal yang sehat, kedua hal itu tidaklah berbeda, dan tidak ada anggapan mustahil sedangkan kita menyaksikan keadaannya yang sama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 19",
    "description": "Hanya dia yang berhak atas segala bentuk pujian karena dia yang mengeluarkan yang hidup dari yang mati, yakni menghidupkan manusia dari tiada, dan mengeluarkan yang mati dari yang hidup, yakni mematikan manusia setelah ia hidup; dan dia pula yang menghidupkan bumi dengan berbagai macam tetumbuhan dan pepohonan setelah mati dan mengering. Dan seperti itulah kamu akan dikeluarkan dan dibangkitkan dari kubur. 20. Bila ayat-ayat sebelumnya menjelaskan kesucian dan keterpujian Allah serta kesempurnaan kuasa-Nya, rangkaian ayat-ayat ini memaparkan beberapa bukti atas hal tersebut. Dan di antara tanda-tanda kebesaran-Nya ialah dia menciptakan kamu dari tanah, kemudian tiba-tiba kamu menjadi manusia yang berkembang biak di muka bumi dengan aktivitas yang amat beragam."
  }
]