[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara ayat-ayat Allah yang menujukkan kebesaran Allah dan kesempurnaan KuasaNya adalah bahwa Dia menciptakan bapak kalian, Adam dari tanah, kemudian kalian menjadi manusia yang beranak pinak dan menyebar di muka bumi untuk mencari karunia Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan di antara tanda-tanda (kekuasaan) Allah yang agung yang menunjukkan kekuasaan-Nya dan keesaan-Nya, adalah penciptaan kalian -wahai manusia- dari tanah, yaitu saat menciptakan bapak kalian dari tanah. Kemudian tiba-tiba kalian menjadi manusia yang berkembang biak dengan turun-temurun dan menyebar di bumi bagian timur maupun bagian barat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Salah satu tanda keesaan-Nya, Allah menciptakan Adam dari tanah, kemudian kalian menjadi banyak dengan berkembang biak, kalian tersebari di berbagai penjuru bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَمِنْ ءَايٰتِهِۦٓ (Dan di antara tanda-tanda kekuasaan-Nya) Yakni ayat yang menunjukkan kekuasaan-Nya untuk membangkitkan makhluk-Nya. أَنْ خَلَقَكُم(ialah Dia menciptakan kamu) Yakni menciptakan bapak kalian Adam. مِّن تُرَابٍ(dari tanah) Dan menciptakan kalian dalam lingkup penciptaan Adam. ثُمَّ إِذَآ أَنتُم بَشَرٌ تَنتَشِرُونَ(kemudian tiba-tiba kamu (menjadi) manusia yang berkembang biak) Yakni kemudian kalian berbembang-biak dari Adam dengan cara yang telah Allah tetapkan, sehingga kalian tersebar ke seluruh pelosok bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Di antara ayat-ayat Allah SWT yang menunjukkan kekuasaanNya atas kebangkitan adalah Dia menciptakan asal-mula kalian, yaitu Adam dari tanah, kemudian setelah Adam berketurunan dan membentuk manusia yang terbuat dari darah dan daging, kalian tersebar di bumi dan mencari keutamaan Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara tanda-tandaNya adalah bahwa Dia menciptakan kalian} menciptakan Adam {dari tanah, kemudian tiba-tiba kalian menjadi manusia yang bertebaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. ini adalah permulaan dalam menghitung tanda-tandaNya yang membuktikan keesaanNya dalam ilahiyah, keparipurnaan keagunganNya, berlakunya masyiah (kehendak)Nya, kehebatan kekuasaanNya, keindahan ciptaanNya, keluasan rahmat dan karuniaNya, seraya berfirman, ”dan di antara tanda-tanda kekuasaanNya ialah Dia menciptakan kamu dari tanah,” yaitu dengan menciptakan asal-usul keturunan, yaitu Adam “kemudian tiba-tiba kamu (menjadi) manusia yang berkembang biak,” maksudnya, yang telah menciptakan kalian dari satu sumber asal dan satu materi dan mengembangbiakan kalian di berbagai penjuru dan sudut bumi. Dalam hal seperti itu terdapat tanda-tanda yang menunjukkan kepada kalian bahwa yang telah menciptakan kalian dari asal-usul tersebut dan menyebarluaskan kalian di berbagai bumi adalah Rabb sembahan (yang haq), yang Maharaja, yang Maha Terpuji, Yang Maha penyayang lagi Maha pemurah, yang akan mengulangi penciptaan kalian dengan kebangkitan setelah kematian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 20: Allah mengabarkan bahwa adanya para malaikat adalah petunjuk akan kemaha esaan-Nya dan wajib untuk mentauhidkan-Nya dan mengibadahi-Nya saja tanpa selain-Nya : Sesungguhnya Dia menjadikan kalian wahai manusia, dan menjadikan asal dari kalian adalah dari tanah, kemudian kalian menjadi banyak dan menyebar di belahan bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dan selanjutnya mulai menyebutkan ayat-ayat yang menunjukkan keberhakan Allah untuk diibadahi dan hanya Dia yang berhak untuk itu, demikian pula menunjukkan sempurnanya keagungan-Nya, berlakunya kehendak-Nya, kuatnya kemampuan-Nya, indahnya ciptaan-Nya, luasnya rahmat-Nya dan ihsan-Nya. Yakni nenek moyang kamu, yaitu Adam dari tanah. Hal ini menunjukkan bahwa yang menciptakan kamu dari asal yang satu dan mengembangbiakkan ke berbagai penjuru bumi adalah Tuhan yang berhak disembah, Raja yang berhak dipuji, Maha Penyayang lagi Mahakasih, yang akan mengembalikan kamu setelah mati dengan adanya kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 20",
    "description": "Bila ayat-ayat sebelumnya menjelaskan kesucian dan keterpujian Allah serta kesempurnaan kuasa-Nya, rangkaian ayat-ayat ini memaparkan beberapa bukti atas hal tersebut. Dan di antara tanda-tanda kebesaran-Nya ialah dia menciptakan kamu dari tanah, kemudian tiba-tiba kamu menjadi manusia yang berkembang biak di muka bumi dengan aktivitas yang amat beragam. 21. Dan di antara tanda-tanda kebesaran-Nya ialah bahwa dia telah menciptakan pasangan-pasangan untukmu, laki-laki dengan perempuan dan sebaliknya, dari jenismu sendiri agar kamu cenderung dan mempunyai rasa cinta kepadanya dan merasa tenteram bersamanya setelah disatukan dalam ikatan pernikahan; dan sebagai wujud rahmat-Nya. Dia menjadikan di antaramu potensi untuk memiliki rasa kasih dan sayang kepada pasangannya sehingga keduanya harus saling membantu untuk mewujudkannya demi terbentuknya bangunan rumah tangga yang kukuh. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kebe-saran Allah bagi kaum yang berpikir bahwa tumbuhnya rasa cinta adalah anugerah Allah yang harus dijaga dan ditujukan ke arah yang benar dan melalui cara-cara yang benar pula."
  }
]