[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara ayat-ayat Allah yang menunjukkan kebesaran Allah dan kesempurnaan KuasaNya adalah bahwa Dia menciptakan para istri untuk kalian (wahai kaum laki-laki) dari jenis kalian sendiri, agar jiwa kalian menjadi tenang dan damai kepadanya, dan Dia menjadikan kecintaan dan kasih sayang antara suami dan istri. Sesungguhnya dalam penciptaan Allah terhadap semua itu terkandung petunjuk atas Kuasa Allah dan keesaanNya bagi kaum yang berpikir dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan di antara tanda-tanda-Nya yang agung sekaligus menunjukkan kekuasaan-Nya dan keesaan-Nya, bahwa Dia menciptakan untuk kalian -wahai orang laki-laki- dari jenismu pasangan-pasangan agar jiwa kalian merasa cenderung dan tenang kepadanya karena ada kesamaan di antara kalian. Dan Dia menjadikan rasa cinta di antara kalian dan mereka. Sesungguhnya di dalam hal itu sungguh terdapat bukti-bukti dan tanda-tanda yang jelas bagi orang-orang yang berfikir, karena hanya orang-orang yang berfikir sajalah yang bisa mendapatkan faedah dari pemikiran akal mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Dan termasuk tanda keesaan Allah juga, Dia menciptakan istri-istri bagi kalian -hai para lelaki- dari golongan kalian sendiri, agar kalian merasa tentram dengan mereka. Dan Allah menjadikan rasa cinta dan kasih sayang di antara kalian. Sungguh pada pengaturan yang bijaksana itu merupakan tanda-tanda keesaan dan kekuasaan Allah bagi orang-orang yang memikirkan kekuasaan dan kebesaran-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَمِنْ ءَايٰتِهِۦٓ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوٰجًا (Dan di antara tanda-tanda kekuasaan-Nya ialah Dia menciptakan untukmu isteri-isteri dari jenismu sendiri) Yakni diantara tanda-tanda kekuasaan-Nya untuk membangkitkan makhluk-Nya adalah Dia menciptakan bagi kalian wanita-wanita dari jenis manusia yang kalian nikahi. لِّتَسْكُنُوٓا۟ إِلَيْهَا(supaya kamu cenderung dan merasa tenteram kepadanya) Yakni agar kalian condong kepada mereka. Dan menetapkan bahwa dari diri mereka terdapat ketentraman dan ketenangan bagi jiwa kalian. وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً ۚ( dan dijadikan-Nya diantaramu rasa kasih dan sayang) Yakni rasa kasih sayang dan cinta antara suami dan istrinya di dalam ikatan pernikahan. Mereka saling berlemah lembut padahal sebelumnya mereka berdua tidak saling mengenal dan tidak saling mencintai. Imam Mujahid berpendapat yang dimaksud dengan (المودة) adalah berjima’ dan (الرحمة) adalah keturunan. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni hal yang telah disebutkan itu. لَاٰيٰتٍ(benar-benar terdapat tanda-tanda) Yakni tanda-tanda yang sangat menakjubkan dan sangat jelas dalam menunjukkan kekuasaan dan hikmah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Di antara ayat-ayat Allah SWT juga yang menunjukkan kepada kebangkitan adalah Dia menciptakan untuk kalian pasangan-pasangan dari golongan manusia agar kalian dapat mewujudkan ketenangan dan kesenangan. Dia juga menumbuhkan cinta dan kasih antara suami-istri. Sesungguhnya dalam hal itu ada ayat-ayat yang menunjukkan kekuasaan Allah SWT bagi kaum yang mau memikirkan ciptaan Allah SWT, pengaturanNya, kekuasaanNya, dan kebijaksanaanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara tanda-tandaNya ialah bahwa Dia menciptakan untuk kalian pasangan-pasangan dari diri kalian} dari jenis kalian {agar kalian tenteram dengannya} agar kalian bersatu dan tenang dengannya {Dia menjadikan di antara kalian rasa cinta dan kasih sayang} rasa cinta dan kasih sayang {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “dan di antara tanda-tandaNya” yang membuktikan rahmatNya terhadap hamba-hambaNya, kebijaksanaanNya yang agung dan ilmuNya yang mencakup segala sesuatu, ”ialah Dia menciptakan untukmu istri-istri dari jenismu sendiri,” mereka yang serasi dengan kalian, dan kalian serasi dengan mereka, mereka serupa dengan kalian, dan kalian serupa dengan mereka, “supaya kamu cenderung dan merasa tentram kepadanya dan dijadikanNya diantaramu rasa kasih sayang,” dengan memberikan pada pernikahan itu berbagai sebab yang dapat mendatangkan rasa kasih sayang, sehingga dengan adanya istri dapat merasakan kenikmatan, kelezatan dan manfaat dengan adanya anak-anak, mengasuh mereka dan dapat merasakan kedamaian padanya. Anda biasanya tidak akan menjumpai pada seseorang rasa kasih dan sayang seperti yang dapat dirasakan oleh kedua suami istri “sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang berfikir,” yaitu mereka yang mengaktifkan akal pikiran mereka, merenungkan ayat-ayat Allah dan berpindah (dalam merenung) dari sesuatu ke suatu yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 21: Sebagian dari tanda akan kemaha-esaan dan kasih sayang Allah kepada makhluk-Nya adalah bahwasanya Allah menciptakan kalian dari jenis kalian berupa perempuan sebagai istri, yang tinggal dengan kalian karena pernikahan, yang kalian lembut kepada istri-istri kalian dan condong kepadanya. Allah jadikan di antara kalian kecintaan, simpati dan kasih sayang, sungguh itu semua adalah tanda yang jelas akan kemaha esaaan Allah dan kasih sayang-Nya kepada makhluk-Nya bagi kaum yang menjalankan akal mereka dan memikirkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang menunjukkan kasih sayang-Nya, perhatian-Nya kepada hamba-hamba-Nya, kebijaksanaan-Nya yang besar, dan ilmu-Nya yang meliputi. Maksudnya, yang sesuai dan seperti kamu.. Dengan adanya pasangan, kedua belah pihak dapat bersenang-senang, tidak kesepian, memperoleh manfaat adanya anak, serta mendidik mereka dan cenderung kepada pasangannya. Oleh karena itu, kita hampir tidak menemukan rasa cinta dan sayang lebih dalam seperti yang terdapat dalam pernikahan. Yakni yang menjalankan akal pikirannya, mentadabburi ayat-ayat Allah, dan berpindah dari satu keadaan kepada keadaan yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 21",
    "description": "Dan di antara tanda-tanda kebesaran-Nya ialah bahwa dia telah menciptakan pasangan-pasangan untukmu, laki-laki dengan perempuan dan sebaliknya, dari jenismu sendiri agar kamu cenderung dan mempunyai rasa cinta kepadanya dan merasa tenteram bersamanya setelah disatukan dalam ikatan pernikahan; dan sebagai wujud rahmat-Nya. Dia menjadikan di antaramu potensi untuk memiliki rasa kasih dan sayang kepada pasangannya sehingga keduanya harus saling membantu untuk mewujudkannya demi terbentuknya bangunan rumah tangga yang kukuh. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kebe-saran Allah bagi kaum yang berpikir bahwa tumbuhnya rasa cinta adalah anugerah Allah yang harus dijaga dan ditujukan ke arah yang benar dan melalui cara-cara yang benar pula. 22. Dan di antara tanda-tanda kebesaran-Nya ialah penciptaan langit tanpa penyangga dan bumi yang terhampar, demikian pula perbedaan bahasamu yang diucapkan dengan mulut yang terdiri atas unsur yang sama: bibir, gigi, dan lidah; dan perbedaan warna kulitmu meski kamu berasal dari sumber yang satu. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda eksistensi dan keesaan-Nya bagi orang-orang yang mengetahui atau berilmu."
  }
]