[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bukti-bukti Kuasa Tuhan adalah penciptaan langit dan ketinggiannya tanpa tiang, penciptaan bumi dengan keluasannya dan kelebarannya, perbedaan bahasa kalian dan warna kulit kalian. Sesungguhnya hal itu mengandung pelajaran bagi siapa yang memiliki ilmu dan bashirah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Di antara tanda-tanda-Nya yang agung yang menunjukkan kekuasaan-Nya dan keesaan-Nya, yaitu penciptaan langit dan bumi, juga perbedaan bahasa dan kulit kalian. Sesungguhnya di dalam hal itu benar-benar terdapat bukti-bukti bagi orang yang berilmu dan mempunyai mata hati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Dan termasuk tanda besarnya kekuasaan Allah, Dia menciptakan tujuh langit tanpa tiang, dan menciptakan bumi dengan tujuh lapis beserta kandungannya, serta menciptakan berbagai macam bahasa untuk saling berkomunikasi dan berbagai warna kulit agar kalian saling mengenal. Sungguh perkara yang agung dalam penciptaan dan perbedaan itu merupakan tanda-tanda kebesaran Allah yang bermanfaat bagi orang-orang yang berilmu untuk bertadabbur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمِنْ ءَايٰتِهِۦ خَلْقُ السَّمٰوٰتِ وَالْأَرْضِ (Dan di antara tanda-tanda kekuasaan-Nya ialah menciptakan langit dan bumi) Karena yang meciptakan makhluk-makhluk yang sangat besar ini, dan menciptakan berbagai makhluk yang menakjubkan sebagai pelajaran bagi orang yang mau mengambil pelajaran, Mampu menciptakan kalian setelah kematian kalian dan membangkitkan kalian dari alam kubur. وَاخْتِلٰفُ أَلْسِنَتِكُمْ(dan berlain-lainan bahasamu) Yakni bahasa Arab, Persia, India, Romawi, dan bahasa-bahasa lainnya. وَأَلْوٰنِكُمْ ۚ( dan warna kulitmu) Yaitu kulit yang putih, hitam, merah, kuning, dan kehijauan, padahal kalian merupakan keturunan dari satu bapak dan satu ibu yang sama, dan kalian merupakan jenis yang sama yaitu jenis manusia; bahkan setiap diri kalian memiliki perbedaan dari orang lain. إِنَّ فِى ذٰلِكَ لَاٰيٰتٍ لِّلْعٰلِمِينَ (Sesungguhnya pada yang demikan itu benar-benar terdapat tanda-tanda bagi orang-orang yang mengetahui) Yakni bagi orang-orang yang memiliki ilmu dan penglihatan yang tajam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Di antara dalil-dalil kekuasaanNya adalah penciptaan langit, bumi, perbedaan bahasa dan dialek kalian serta perbedaan warna kalian seperti hitam dan putih. Sesungguhnya dalam hal itu ada tanda-tanda atas kekuasaan Allah bagi orang-orang yang memiliki ilmu dan pengetahuan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara tanda-tandaNya ialah penciptaan langit dan bumi, perbedaan bahasa kalian} bahasa kalian {dan warna kulit kalian. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi orang-orang yang berilmu} bagi orang-orang yang memiliki ilmu dan penglihatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. orang-orang yang mengetahui (orang alim) adalah para ahli ilmu yang memahami pelajaran-pelajaran dan merenungkan ayat-ayat. Ayat-ayat dalam masalah ini banyak diantara ayat-ayat (Nya) adalah penciptaan “langit dan bumi,” dan segala apa yang ada di dalamnya, bahwasannya semua itu membuktikan pada keagungan kekuasaan Allah dan kesempurnaan keperkasaanNya, yang telah menciptakan makhluk (ciptaan) yang agung ini, dan kesempurnaan hikmahNya karena ketelitian yang terkandung dalam ciptaan tersebut, serta kehalusan ilmuNYa. Sebab, sang pencipta pasti mengetahui makhluk yang diciptakanNya. “ketahuilah, Yang menciptakan itu mengetahui,” (al-mulk:14) Juga (tanda bukti) liputan rahmat dan karuniaNya, karena di dalam semua itu terdapat manfaat yang sangat besar, dan bahwasannya Dia yang berkehendak yang memilih apa saja yang Dia kehendaki, karena pada rahmat dan karuniaNya terdapat berbagai keunggulan dan keistimewaan; dan bahwa Dia semata yang berhak disembah dan diesakan, sebab hanya Dia Yang Maha Esa yang menciptakan, maka dari itu wajib diesakan dengan ibadah. Semua itu adalah dalil-dalil rasional yang diingatkan oleh Allah kepada akal, diperintahkan olehNya untuk direnungkan dan diambil pelajarannya “dan” demikian pula pada, “berlain-lainannya bahasamu dan warna kulitmu,” berdasarkan banyaknya jumlah kalian dan berbeda-bedanya kalian, padahal asal usulnya satu (sama), dan tempat keluarnya huruf pun sama. Sekalipun demikian adanya, namun anda tidak akan menjumpai dua suara (manusia) sama dari segala sisi, melainkan anda pasti menemukan perbedaan di antara itu yang dengannya bisa dibedakan. Ini semua menunjukkan kemahasempurnaan kekuasaanNya, kehebatan masyi’ahNya, perhatianNya kepada hamba-hambaNya dan rahmat (kasih sayang)Nya kepada mereka. Dia menetapkan perbedaan tersebut agar tidak terjadi kesamaran, karena akan berakibat fatal (kekacauan) dan akan banyak tujuan-tujuan mulia dan kebutuhan yang akan terabaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 22: Di antara tanda atas kuasa Allah dan kemaha-esaan-Nya : Adanya langit yang tujuh dan apa yang di dalamnya; Dengan tanpa tiang dan juga adanya bumi. Begitu juga perbedaan bahasa kalian dan logatnya, perbedaan warna kulit, semua ini adalah tanda bagi manusia yang memiliki akal dan ilmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Padahal asalnya hanya satu, dan tempat keluarnya huruf juga satu. Meskipun demikian, kita akan menemukan sedikit atau banyak perbedaan antara suara dan warna kulit yang membedakan antara yang satu dengan yang lain. Hal ini menunjukkan sempurnanya kekuasaan-Nya, dan berlakunya kehendak-Nya. Termasuk perhatian dan rahmat-Nya kepada hamba-hamba-Nya adalah Dia menetapkan adanya perbedaan itu agar tidak terjadi kesamaran sehingga terjadi kekacauan dan hilang maksud dan tujuan. Mereka adalah ahli ilmu; yang memahami pelajaran, dan mentadabburi ayat-ayat Allah. Dari penciptaan langit dan bumi, mereka dapat mengetahui besarnya kerajaan Allah dan sempurnya kekuasaan-Nya sehingga mampu mengadakan makhluk yang besar ini. Dari sana pula mereka dapat mengetahui kebijaksanaan Allah karena kerapian ciptaannya serta mengetahui luasnya ilmu-Nya, karena yang menciptakan pasti mengetahui makhluk yang diciptakan-Nya. Dari sana pun mereka mengetahui meratanya rahmat-Nya dan karunia-Nya karena di dalamnya terdapat manfaat yang besar, dan bahwa Dia memang menginginkan, di mana Dia memilih apa yang Dia kehendaki karena di dalamnya terdapat kelebihan dan keistimewaan, dan bahwa hanya Dia yang berhak disembah dan diesakan, karena Dia yang sendiri menciptakan maka Dia yang wajib disembah saja. Semua ini merupakan dalil akal yang Allah ingatkan, agar akal mau memikirkannya dan mengambil pelajaran daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 22",
    "description": "Dan di antara tanda-tanda kebesaran-Nya ialah penciptaan langit tanpa penyangga dan bumi yang terhampar, demikian pula perbedaan bahasamu yang diucapkan dengan mulut yang terdiri atas unsur yang sama: bibir, gigi, dan lidah; dan perbedaan warna kulitmu meski kamu berasal dari sumber yang satu. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda eksistensi dan keesaan-Nya bagi orang-orang yang mengetahui atau berilmu. 23. Allah menciptakan pergantian siang dan malam sebagai bukti kekuasaan dan rahmat-Nya. Dan di antara tanda-tanda kebesaran-Nya yang lain ialah tidurmu untuk istirahat pada waktu malam setelah kamu beraktivitas pada siang hari, dan pada siang hari kamu beraktivitas kembali, dan usahamu mencari sebagian dari karunia-Nya berupa rezeki yang telah diatur oleh-Nya. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kebesaran dan keesaan-Nya bagi kaum yang mendengarkan dengan saksama agar dapat menumbuhkan sifat kanaah (menerima dengan ikhlas segala karunia-Nya) dan kemantapan jiwa serta kesadaran penuh atas kemahakuasaan-Nya."
  }
]