[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bukti-bukti Kuasa Allah adalah bahwa Dia memperlihatkan kilat, sehingga kalian takut kepada halilintar namun berharap hujan. Dan Allah menurunkan hujan dari awan, dengannya Dia menghidupkan bumi setelah kematian dan kekeringannya. Sesungguhnya yang demikian itu mengandung dalil atas kesempurnaan kuasa Allah dan besarnya hikmah serta kebaikanNya bagi siapa yang memilki akal yang digunakannya untuk mendapat peunjuk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Di antara tanda-tanda-Nya yang agung yang menunjukkan kekuasaan-Nya dan keesaan-Nya, bahwa Dia menampakkan kepada kalian kilat di langit dan mengumpulkan bagi kalian di dalam kilat itu perasaan takut terhadap halilintar dan harapan akan turunnya hujan. Dan Dia menurunkan air hujan bagi kalian dari langit, dan Dia hidupkan bumi setelah kering dengan tumbuhnya tumbuh-tumbuhan di bumi. Sesungguhnya di dalam hal itu terdapat bukti-bukti dan tanda-tanda yang jelas bagi kaum yang berakal. Mereka menjadikannya dalil atas keberadaan kebangkitan setelah kematian untuk perhitungan dan pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Dan termasuk dari tanda-tanda kekuasaan-Nya, Dia memperlihatkan kepada kalian cahaya kilat sehingga kalian takut tertimpa bahaya darinya, namun kalian juga berharap keberkahannya berupa hujan yang Allah turunkan dari awan agar dapat menumbuhkan tanah yang tandus. Sungguh karunia yang besar itu merupakan tanda-tanda yang dapat disaksikan oleh orang yang memahami keagungan Allah Yang Maha Memberi Rezeki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَمِنْ ءَايٰتِهِۦ يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا (Dan di antara tanda-tanda kekuasaan-Nya, Dia memperlihatkan kepadamu kilat untuk (menimbulkan) ketakutan dan harapan) Yakni ketakutan dari petir dan harapan turunnya hujan, serta takut dari hawa dingin yang merusak tanaman dan berharap turunnya hujan yang menumbuhkan tanaman. وَيُنَزِّلُ مِنَ السَّمَآءِ مَآءً فَيُحْىِۦ بِهِ الْأَرْضَ بَعْدَ مَوْتِهَآ ۚ( dan Dia menurunkan hujan dari langit, lalu menghidupkan bumi dengan air itu sesudah matinya) Yakni menghidupkan bumi dengan tanaman yang tumbuh setelah kematiannya dengan matinya tanaman. إِنَّ فِى ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَعْقِلُونَ(Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang mempergunakan akalnya) Untuk menjadikan tanda-tanda ini sebagai hal yang menunjukkan kekuasaan Allah yang amat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dan di antara kekuasaanNya yaitu bahwa Allah SWT memperlihatkan kilat kepada kalian (percikan listrik akibat gesekan awan) yang menimbulkan ketakutan atas petir dan harapan terhadap hujan. Lalu Dia menurunkan hujan dari langit melalui awan, kemudian Dia menghidupkan bumi setelah kegersangannya. Sesungguhnya dalam hal itu adalah petunjuk atas kekuasaan Allah SWT bagi kaum yang mau berpikir tentang dalil-dalil atas kekuasaanNya yang sangat luar biasa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara tanda-tandaNya ialah bahwa Dia memperlihatkan kilat kepadalian untuk (membuat) ketakutan dan harapan} ketakutan terhadap petir dan harapan terhadap hujan {Dia menurunkan air dari langit, lalu dengannya} dengan hujan {Dia menghidupkan bumi setelah mati. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. maksudnya, dan diantara tanda-tandaNya adalah Dia menurunkan hujan kepada kalian, yang dengannya negeri dan manusia menjadi hidup. Dan Dia memperlihatkan kepada kalian mukadimah-mukadimahnya (tanda-tanda awal) berupa petir dan kilat yang ditakuti (oleh malaikat), namun diharapkan. “sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda” yang menunjukkan betapa meratanya karuniaNya, betapa luasnya ilmuNya, betapa sempurnanya kecermatanNya dan keagungan hikmahNya; dan bahwa Dia dapat menghidupkan kembali orang-orang yang sudah mati, sebagaimana Dia kuasa menghidupkan kembali tanah setelah sebelumnya kering kerontang (tandus, mati), “bagi kaum yang mempergunakan akalnya,” maksudnya, bagi orang-orang yang mempunyai akal dan pikiran yang dengannya mereka dapat memahami apa yang didengarnya, dilihatnya dan dihafalnya, dan dengannya akal itu dapat membuktikan terhadap sesuatu yang telah menjadi dalilnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 24: Di antara tanda yang menunjukkan atas kuasa dan keagungan Allah bahwasanya petir menunjukkan kepada kalian akan sebuah ketakutan yang menimpa kalian dengan kilatan yang mengerikan, dan hujan yang menjadikan ketenangan kalian sehingga dapat menjadi manfaat bagi kalian, dengan turunnya hujan tersebut bumi menjadi hidup setelah kering dan gersang serta menumbuhkan pertaniaan. Sungguh semua itu adalah tanda yang menunjukkan atas kuasa Allah dan keagungan-Nya; Bagi kaum yang menggunakan akal mereka dan memikirkan atas segala tanda itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni termasuk tanda-tanda yang menunjukkan merata ihsan-Nya, luas ilmu-Nya, sempurna kerapian-Nya, besarnya hikmah-Nya adalah apa yang disebutkan pada ayat di atas. Bagi musafir karena takut kepada halilintar. Bagi yang mukim karena ingin hujan turun. Yakni mengerti apa yang didengar dan dilihatnya, dan dari sana mereka dapat mengetahui sesuatu yang ditunjukkan olehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 24",
    "description": "Dan di antara tanda-tanda kebesaran dan rahmat-Nya adalah bahwa dia memperlihatkan kilat kepadamu untuk menimbulkan ketakutan khususnya di saat kamu dalam perjalanan dan di sisi lain ia menjadi harapan akan turunnya hujan bagi kamu yang dilanda kekeringan. Dan dia menurunkan air hujan dari langit, yakni arah atas, lalu dengan air itu dihidupkan-Nya bumi setelah mati dan kering. Hujan itu juga menjadi bukti karunia-Nya kepada manusia dan binatang. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kekuasaan-Nya bagi kaum yang mengerti atau mau berpikir bahwa hari kebangkitan itu niscaya adanya. 25. Dan di antara tanda-tanda kebesaran-Nya ialah berdirinya langit tanpa penyangga dan bumi yang terhampar dengan kehendak-Nya. Kemudian, apabila kamu wafat dan dia memanggil kamu sekali panggil dari bumi pada hari kiamat, seketika itu kamu keluar dari kubur untuk menghadap Allah guna menjalani proses hisab dengan seadil-adilnya."
  }
]