[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara tanda-tanda yang menunjukkan kebesaran Allah dan kesempurnaan KuasaNya adalah tegaknya langit dan bumi, ketenangan dan kekokohan keduanya dengan perintahNya, keduanya tidak goncang dan langit tidak runtuh menimpa bumi. Kemudian saat Allah memanggil kalian untuk hari kebangkitan pada Hari Kiamat, maka kalian akan keluar dari kubur dengan cepat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Di antara tanda-tanda-Nya yang agung yang menunjukkan kekuasaan-Nya dan keesaan-Nya, adalah berdirinya langit tanpa terjatuh dan bumi tanpa keruntuhan dengan perintah-Nya. Kemudian jika Dia memanggil kalian dengan seruan dari tanah dengan ditiupnya sangkakala oleh Malaikat, tiba-tiba kalian keluar dari kubur kalian untuk mendapatkan perhitungan dan pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Dan termasuk dari tanda-tanda kekuasaan-Nya adalah langit yang tetap kokoh tanpa tiang dan bumi yang teguh tidak bergoncang, dan langit tidak runtuh menimpa bumi. Kemudian ketika Allah menyeru kalian untuk bangkit dari bumi, maka kalian akan keluar dari kubur masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَمِنْ ءَايٰتِهِۦٓ أَن تَقُومَ السَّمَآءُ وَالْأَرْضُ بِأَمْرِهِۦ ۚ (Dan di antara tanda-tanda kekuasaan-Nya ialah berdirinya langit dan bumi dengan kehendak-Nya) Yakni tegak dan kokohnya langit dan bumi dengan kehendak dan kuasa Allah yang tegak dan kokoh tanpa tiang yang menyanggah keduanya dan tanpa asas yang mengokohkan keduanya. ثُمَّ إِذَا دَعَاكُمْ دَعْوَةً مِّنَ الْأَرْضِ إِذَآ أَنتُمْ تَخْرُجُونَ(Kemudian apabila Dia memanggil kamu sekali panggil dari bumi, seketika itu (juga) kamu keluar (dari kubur)) Keluar tanpa menunggu atau berhenti, sebagaimana orang yang dipanggil oleh orang yang saat ditaati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Dan di antara dalil-dalil kekuasaanNya adalah berdirinya langit dan bumi di tempatnya masing-masing ruang angkasa sesuai iradat dan kekuasaan Allah tanpa menggunakan pilar dan penyangga. Lalu ketika Allah SWT memanggil kalian dari bumi dengan satu kebangkitan dan tiupan sangkakala, seketika kalian akan keluar dalam keadaan hidup dengan cepat. Qiyamuhuma maknanya adalah bahwa keduanya (langit dan bumi) tetap berdiri kokoh dengan kondisi seperti itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara tanda-tanda Nya adalah berdirinya langit dan bumi} tegaknya langit dan bumi tanpa pilar {sesuai dengan perintahNya. Kemudian apabila Dia memanggil kalian dengan sekali panggilan dari bumi} kubur {seketika itu kalian keluar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. maksudnya, di antara tanda-tandaNya yang sangat besar adalah bahwa langit dan bumi ini tegak, terpancang dan kokoh karena perintahNya, hingga keduanya tidak goyah, dan langit tidak jatuh menimpa bumi. Jadi kekuasaanNYa sangat besar yang denganNya Dia menahan langit dan bumi sehingga tidak binasa, dan dengannya pula Dia kuasa apabila Dia menyeru manusia dengan satu seruan dari bumi, maka dengan seketika mereka keluar. “sesungguhnya penciptaan langit dan bumi lebih besar daripada penciptaan manusia, akan tetapi kebanyakan manusia tidak mengetahui,” (ghafir:57)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 25: Allah mengabarkan bahwa pada ayat yang mulia ini terdapat ketetapan dan keberadaan langit dan bumi dengan keadaan yang demikian agar tetapnya alam, dan juga menjadi baik segala urusan makhluk-Nya. Langit tidaklah menindih bumi, begitu juga bumi tidaklah berguncang kecuali dengan izin-Nya, semua itu adalah karena karunia dari Allah dan kasih sayang dari-Nya. Kemudian jika kalian diseru pada hari pembalasan dan hisab, maka kalian akan bersegera, bergegas dengan cepat menjawab seruan tersebut (kalian tidak dapat berbuat selainnya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga tidak terjadi kegoncangan, dan langit tidak menimpa bumi. Kekuasaan-Nya yang besar mampu menahan langit dan bumi agar tidak lenyap. Yaitu dengan tiupan sangkakala kedua oleh malaikat Israfil untuk bangkit dari kubur. Hal itu adalah mudah bagi Allah, karena Dia mampu menciptakan langit dan bumi yang lebih besar daripada manusia. Dalam keadaan hidup. Itu pun termasuk tanda-tanda kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 25",
    "description": "Dan di antara tanda-tanda kebesaran-Nya ialah berdirinya langit tanpa penyangga dan bumi yang terhampar dengan kehendak-Nya. Kemudian, apabila kamu wafat dan dia memanggil kamu sekali panggil dari bumi pada hari kiamat, seketika itu kamu keluar dari kubur untuk menghadap Allah guna menjalani proses hisab dengan seadil-adilnya. 26. Mahasuci dan terpujilah Allah karena hanya milik-Nya apa yang ada di langit dan di bumi. Semuanya hanya kepada-Nya tunduk, patuh dan siap sedia melaksanakan perintah-Nya."
  }
]