[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milik Allah semata semua yang ada di langit dan di bumi, mencakup malaikat, manusia, jin, binatang, tumbuh-tumbuhan dan benda mati. Semua itu tunduk kepada perintah Allah dan patuh kepada kesempurnaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan hanya bagi Allah semata apa yang ada di langit, dan hanya bagi Allah semata apa yang ada di bumi, baik secara kepemilikannya, penciptaannya dan penentuannya. Setiap yang ada di langit dan setiap yang ada di bumi dari para makhluk-makhluk-Nya tunduk kepada-Nya dan pasrah kepada perintah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Milik Allah semata segala makhluk yang ada di tujuh langit dan bumi, semuanya tunduk kepada ketetapan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَلَهُۥ مَن فِى السَّمٰوٰتِ وَالْأَرْضِ ۖ (Dan kepunyaan-Nya-lah siapa saja yang ada di langit dan di bumi) Dari seluruh makhluk yang ada. Dia-lah yang memiliki yang mengatur dan yang menciptakan semua itu, tanpa campur tangan selain-Nya. كُلٌّ لَّهُۥ قٰنِتُونَ (Semuanya hanya kepada-Nya tunduk) Yakni penuh ketaatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Dan milik Allah itu segala sesuatu di langit dan bumi baik kerajaan, makhluk, dan hamba. Semuanya taat kepadaNya dan tunduk atas kehendakNya di langit dan bumi berupa kehidupan dan kematian, kesehatan dan sakit, serta kebangkitan, penghisaban dan lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah siapa saja yang ada di langit dan di bumi. Semuanya tunduk kepadaNya} tunduk dan patuh terhadap perintahNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “dan kepunyaanNya-lah siapa saja yang ada di langit dan bumi,” semuanya adalah ciptaanNya, dan hamba-hambaNya. Dia-lah yang berwenang mengendalikan mereka tanpa ada pesaing, penolong ataupun penentang; semua mereka tunduk kepada keagunganNya, patuh kepada kesempurnaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 26: Ketahuilah wahai manusia bahwasanya Allah sajalah yang memberi karunia apa yang ada di langit dan di bumi dari para malaikat, manusia, jin dan selainnya dari makhluk ciptaan-Nya. Dialah pencipta, raja, dan penguasa. Setiap dari makhluk tersebut diperintahkan untuk beribadah dan taat (baik ketaatan atas kuasa-Nya, maupun ketaatan atas kehendak-Nya). Maka semua yang tunduk dengan apa yang Allah inginkan dari kehidupan, mati, kebangkitan, sehat, sakit, kaya, miskin, mulia, terhina, maka seorang mukmin memiliki perbedaan dalam ketaatan hati, bukan hanya ketaatan atas kuasa Allah saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni milik-Nya, ciptaan-Nya, dan hamba-Nya. Dia pula yang mengatur tanpa ada yang menentang, dan tanpa pembantu. Semuanya tunduk kepada keagungan dan kesempurnaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 26",
    "description": "Mahasuci dan terpujilah Allah karena hanya milik-Nya apa yang ada di langit dan di bumi. Semuanya hanya kepada-Nya tunduk, patuh dan siap sedia melaksanakan perintah-Nya. 27. Hari kebangkitan bukanlah sesuatu yang mustahil bagi Allah, sebab dialah yang memulai penciptaan manusia dari tidak ada kemudian mengulanginya dengan membangkitkan kembali menjadi makhluk yang baru, dan yang demikian itu menurut akalmu, wahai orang-orang kafir, mestinya lebih mudah bagi-Nya. Hanya bagi-Nya sifat yang mahatinggi di langit dan di bumi sebagai tuhan yang maha esa, tidak ada yang serupa dengan-Nya, dan penyandang segala kesempurnaan. Dan dia yang mahaperkasa tanpa tandingan, mahabijaksana dalam penciptaan dan pengurusan-Nya."
  }
]