[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya Allah semata yang mulai menciptakan makhluk dari ketiadaan kemudian mengembalikannya hidup setelah mati. Mengembalikan makhluk dalam keadaan hidup setelah mati lebih mudah bagi Allah daripada menciptakannya pertama kali. Dan keduanya sama-sama mudah bagi Allah. hanya milikNya sifat-sifat ketinggian dalam segala apa yang Allah disifati dengannya, tiada sesuatu pun yang serupa dengannya, dan Dia Maha mendengar lagi Maha melihat, Dia Maha perkasa tidak ada yang mempu mengalahkan, Mahabijaksana dalam perkataan dan perbuatanNya, serta pengaturanNya terhadap segala urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan Dia lah Yang Mahasuci, yang memulai penciptaan tanpa ada contoh sebelumnya, kemudian mengembalikan setelah kematiannya, dan mengembalikan itu lebih mudah daripada penciptaan dari awal, dan keduanya mudah bagi Allah, karena jika Dia menghendaki sesuatu, Dia berfirman kepadanya, “Jadilah!” Maka jadilah ia. Dan bagi-Nya sifat-sifat yang tinggi dalam setiap yang disebut mempunyai sifat keagungan dan kesempurnaan. Dia Maha Perkasa, tidak ada yang mengalahkan-Nya dan Maha Bijaksana dalam penciptaan-Nya dan kepengurusan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Allah yang mengawali penciptaan makhluk dari ketidakadaan, kemudian menghidupkannya kembali setelah kematian untuk menjalani hisab. Mengulangi penciptaannya lebih mudah bagi-Nya daripada menciptakannya pertama kali, dan keduanya mudah bagi Allah. Milik Allah sifat yang Maha Tinggi di langit dan di bumi; tidak ada Tuhan selain Dia, dan tidak ada yang serupa dengan-Nya. Dia Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَهُوَ الَّذِى يَبْدَؤُا۟ الْخَلْقَ ثُمَّ يُعِيدُهُۥ (Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali) Yakni mengulangi penciptaannya kembali setelah kematian, dan menghidupkannya dengan kehidupan yang kekal. وَهُوَ أَهْوَنُ عَلَيْهِ ۚ( dan menghidupkan kembali itu adalah lebih mudah bagi-Nya) Mujahid berkata: yang dimaksud adalah mengulangi penciptaan mereka lebih mudah bagi Allah daripada penciptaan yang pertama, meskipun semuanya mudah bagi-Nya. Pendapat lain mengatakan yang dimaksud adalah kebangkitan lebih mudah bagi makhluk daripada penciptaan yang pertama. وَلَهُ الْمَثَلُ الْأَعْلَىٰ( Dan bagi-Nya-lah sifat yang Maha Tinggi) Yakni sifat yang paling tinggi. فِى السَّمٰوٰتِ وَالْأَرْضِ ۚ( di langit dan di bumi) Yakni firman Allah “dan menghidupkan kembali itu adalah lebih mudah bagi-Nya” merupakan perumpamaan yang dibuat Allah dalam hal yang susah atau yang mudah. Dan tidak ada sesuatu yang serupa dengan Allah. وَهُوَ الْعَزِيزُ(dan Dialah Yang Maha Perkasa) Maha Perkasa yang tidak terkalahkan. الْحَكِيمُ(lagi Maha Bijaksana) Dalam segala firman dan perbuatan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Allah SWT adalah Dzat yang memulai penciptaan makhluk sebelum ada apa-apa, kemudian mengembalikan dalam keadaan hidup setelah mati untuk dihisab dan dibalas. BagiNya, proses mengembalikan hidup itu lebih mudah daripada proses penciptaan awal sesuai penggambaran manusia yang berakal. Adapun di sisi Allah SWT, keduanya itu sama. Baginya itu sifat yang luar biasa tingginya yang tidak mungkin bisa disamai oleh siapapun, seperti kekuasaanNya yang menakjubkan dan hikmahNya yang berlaku di langit dan bumi. Dia Dzat yang Maha kuat, Maha Perkasa, Maha Kuasa dan Maha Bijaksana dalam firman, tindakan dan pengaturanNya terhadap makhlukNya. Ikrimah berkata: “Orang-orang kafir heran dengan proses penghidupan Allah terhadap orang-orang mati, kemudian turunlah ayat ini.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Dzat yang memulai penciptaan, kemudian mengembalikannya lagi. Itu lebih mudah} mudah bagiNya. MilikNyalah sifat yang tertinggi} bagi Allah SWT sifat tertinggi dari segala yang disifatkan kepadaNya berupa sifat-sifat yang mulia dan sempurna {di langit dan di bumi. Dialah Dzat Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “dan Dia-lah yang menciptakann manusia dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan ia,” maksudnya, dan Dia menghidupkannya kembali sesudah kematian mereka “adalah lebih mudah bagiNya,” daripada memulai penciptaan mereka. Ini bila dilihat dari kacamata akal dan pikiran. Maka apabila Dia kuasa memulai penciptaan yang kalian akui itu, maka kekuasaanNya untuk mengulangi (menghidupkan kembali) yang lebih mudah itu adalah tentu lebih mudah dan lebih mudah lagi! Setelah Allah menjelaskan tanda-tandaNYa yang sangat luar biasa yang bisa diambil pelajarannya oleh orang-orang yang mengambil pelajaran, diingat oleh orang-orang Mukmin dan diambil analisa oleh orang-orang yang mendapat petunjuk, maka Allah menjelaskan perkara yang sangat besar dan tuntutan yang sangat agung, seraya berfirman, ”dan bagiNyalah sifat yang Mahatinggi di langit dan bumi,” maksudnya, al-matsal al-A’la adalah segala sifat kesempurnaan, dan kesempurnaan (secara maksimal) dari sifat tersebut, kecintaan dan inabah yang penuh lagi sempurna di dalam hati hamba-hambaNya yang tulus, dzikir yang mulia dan ibadah dari mereka. Jadi, al-matsal ala’la adalah sifatNya yang tertinggi dan apa yang menjadi konsekuensinya. Maka dari itu para ahli ilmu menggunakan qiyasul-aula (analogi lebih berhak) dalam hak Allah sang pencipta, maka mereka mengatakan ”semua sifat kesempurnaan yang ada pada makhluk, maka penciptanya lebih berhak memiliki sifat tersebut dengan catatan: tidak adan seorangpun yang menyekutuiNya. Dan setiap sifat kelemahan (kekurangan) yang ada pada makhluk, maka Allah suci darinya” karena kesucian Sang Khaliq dari sifat lemah tersebut adalah lebih utama dan lebih pantas. “dan Dia-lah Yang Mahaperkasa lagi Mahabijaksana,” maksudnya, kepunyaanNyalah keperkasaan yang sempurna, kebijaksanaan yang Mahaluas. Dia menampakkan apa saja yang diperintahkanNya, dan dengan hikmahNya Dia menciptakan dengan rapi, teliti dan sempurna apa yang diciptakanNya, dan benar-benar sangat baik apa yang disyariatkanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 27: Ketahuilah wahai manusia, bahwasanya Allah sajalah yang menciptakan makhluk-Nya dari ketiadaan, kemudian setelah Allah ciptakan Allah matikan, kemudian Allah hidupkan setelah mati, dan mengembalikan makhluk dari kematian adalah lebih mudah dibandingkan awal penciptaan. Maka jika kalian menetapkan penciptaan yang awal makan kalian wajib pula menetapkan kebangkitan. Maka Yang Maha Mampu menciptakan permulaan makhluk dari ketiadaan, Sang Pencipta pun lebih-lebih mampu dalam mengembalikan. Kemudian Allah menjelaskan bahwasanya Dia memiliki nama-nama yang baik dan sifat yang agung, Dialah yang maha kuat yang menguasai dan menaklukkan segala sesuatu, yang maha bijaksana, yang memiliki hikmah yang luas, yang mencukupi dengan baik makhluk-Nya, maha suci dan Dialah yang tiada sesuatupun yang melemahkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni daripada memulai penciptaan. Hal ini jika dihubungkan dengan alam pikiran manusia, yaitu bahwa mengulangi kembali lebih mudah daripada memulai penciptaan, karena mengulangi kembali sebagiannya sudah ada, sedangkan memulai sama sekali tidak ada. Meskipun demikian, keduanya (memulai penciptaan dan mengulangi kembali) sama-sama mudah bagi Allah Subhaanahu wa Ta'aala; tidak sulit sama sekali. Setelah sebelumnya Allah Subhaanahu wa Ta'aala menyebutkan ayat-ayat-Nya yang agung yang terdapat pelajaran bagi orang-orang yang mau mengambil pelajaran, membuat orang-orang mukmin ingat dan menjadikan orang yang berpandangan tajam mendapatkan hidayah, maka Allah Subhaanahu wa Ta'aala menyebutkan perkara yang besar dan tuntutan yang besar. Allah Subhaanahu wa Ta'aala memiliki semua sifat sempurna, dan yang sempurna dari sifat itu. Hati hamba-hamba-Nya yang ikhlas dipenuhi rasa cinta dan kembali secara sempurna kepada-Nya, nama-Nya disebut-sebut oleh mereka dan ditujukan ibadah oleh mereka. Matsalul A’laa artinya sifat-Nya yang Mahatinggi serta hasil daripadanya. Oleh karena itulah, ahli ilmu menggunakan Qiyasul Awlaa untuk Allah Subhaanahu wa Ta'aala. Mereka mengatakan, “Setiap sifat sempurna yang ada pada makhluk, maka Penciptanya lebih berhak memilikinya namun tidak ada yang menyamai dalam sifat itu, dan setiap sifat kekurangan yang makhluk bersih darinya, maka Penciptanya lebih bersih lagi darinya.” Allah Subhaanahu wa Ta'aala memiliki keperkasaan yang sempurna dan hikmah yang besar. Dengan keperkasaan-Nya, Dia mengadakan makhluk dan menampakkan perintah-Nya, dan dengan kebijaksanaan-Nya, Dia merapikan ciptaan-Nya dan merapikan syari’at-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 27",
    "description": "Hari kebangkitan bukanlah sesuatu yang mustahil bagi Allah, sebab dialah yang memulai penciptaan manusia dari tidak ada kemudian mengulanginya dengan membangkitkan kembali menjadi makhluk yang baru, dan yang demikian itu menurut akalmu, wahai orang-orang kafir, mestinya lebih mudah bagi-Nya. Hanya bagi-Nya sifat yang mahatinggi di langit dan di bumi sebagai tuhan yang maha esa, tidak ada yang serupa dengan-Nya, dan penyandang segala kesempurnaan. Dan dia yang mahaperkasa tanpa tandingan, mahabijaksana dalam penciptaan dan pengurusan-Nya. 28. Usai menjelaskan keesaan dan kekuasaan-Nya melalui bukti-bukti nyata yang bisa dilihat oleh mata manusia, kemudian pada ayat ini Allah menguatkan bukti-bukti itu dengan menampilkan contoh konkret yang menyentuh logika manusia. Dia membuat perumpamaan bagimu dari dirimu sendiri agar kamu hanya mengabdi kepada-Nya dan tidak menyekutukan-Nya. Apakah kamu rela jika ada di antara hamba sahaya yang kamu miliki menjadi sekutu bagimu dalam memiliki rezeki yang telah kami berikan kepadamu, sehingga kamu menjadi setara dengan mereka dalam hal kepemilikan ini, padahal sejatinya posisi hamba sahaya itu bagimu sama dengan harta lain yang kamu miliki, lalu kamu takut kepada mereka sebagaimana kamu takut kepada sesamamu' tentu tidak. Adalah tidak tepat menyamakan dua hal yang sejatinya sangat berbeda, yaitu antara budak dengan orang merdeka, apalagi antara Allah dengan hamba-Nya. Demikianlah kami jelaskan ayat-ayat itu bagi kaum yang mengerti, yaitu mereka yang mau menggunakan akalnya untuk berpikir."
  }
]