[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah membuat perumpamaan bagi kalian (Wahai orang-orang musyrik) dari diri kalian sendiri. Adakah diantara hamba-hamba sahaya kalian, yang laki-laki dan yang perempuan, bersekutu dengan kalian dalam urusan rezeki, dan kalian melihat bahwa diri kalian dengan mereka adalah sama padanya, kalian takut pada mereka sebagaimana orang-orang yang merdeka yang bersekutu takut untuk berbagi harta mereka? Sesungguhnya kalian tidak akan meridoi hal itu. Lalu bagaimana kalian akan meridhainya untuk Allah dengan menjadikan sekutu bagiNya dari makhlukNya? Dengan penjelasan seperti ini, Kami menjelaskan bukti-bukti dan hujjah-hujjah dengan sejelas-jelasnya bagi orang-orang yang berakal lurus yang bisa mengambil manfaat dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Allah telah membuat permisalan bagi kalian -wahai orang-orang musyrik- yang diambil dari diri kalian, “Adakah kalian mempunyai sekutu dari budak-budak kalian dan hamba sahaya kalian yang bersekutu dengan kalian dalam kepemilikan harta-harta kalian dengan sama rata, Engkau takut kepada mereka sebagaimana sebagian dari kalian takut kepada sebagian yang lain? Apakah kalian rela untuk diri kalian dari budak-budak kalian seperti ini? Tidak dipungkiri bahwa kalian tidak akan rela dengan hal itu, maka Allah lebih utama untuk tidak mempunyai sekutu di dalam kerajaan-Nya dari para makhluk-Nya dan hamba-hamba-Nya. Dengan permisalan seperti ini dan dengan cara lain Kami menerangkan hujah-hujah dan bukti-bukti yang bermacam-macam untuk kaum yang berakal, karena orang-orang yang berakallah yang bisa mengambil manfaat dari bukti-bukti itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Hai orang-orang musyrik, Allah menjelaskan kepada kalian perumpamaan dari diri kalian sendiri. Apakah salah seorang budak kalian ikut berserikat dalam harta yang Kami berikan kepada kalian? Kalian takut harus berbagi harta dengan budak kalian sebagaimana ketakutan kalian untuk berbagi harta dengan orang yang merdeka. Maka mengapa kalian rela menjadikan sekutu bagi Allah dari makhluk-Nya, padahal kalian tidak rela disamakan dengan budak kalian dalam perkara harta? Demikianlah Kami menjelaskan ayat dan bukti-bukti bagi kaum yang mau mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. ضَرَبَ لَكُم مَّثَلًا مِّنْ أَنفُسِكُمْ ۖ (Dia membuat perumpamaan untuk kamu dari dirimu sendiri) Yakni perumpamaan yang diambil dari diri kalian yang merupakan hal yang paling dekat dengan kalian yang menunjukkan kebatilan perbuatan syirik. فَأَنتُمْ فِيهِ سَوَآءٌ (maka kamu sama dengan mereka) Yakni apakah kalian rela –padahal budak laki-laki dan perempuan adalah manusia seperti kalian— untuk disamakan dengan kalian dalam penguasaan terhadap harta yang Kami berikan kepada kalian tanpa ada perbedaan sama sekali. تَخَافُونَهُمْ كَخِيفَتِكُمْ أَنفُسَكُمْ ۚ( kamu takut kepada mereka sebagaimana kamu takut kepada dirimu sendiri?) Yakni sebagaimana kalian takut terhadap persamaan dalam harta dengan orang yang merdeka? Mereka pasti akan mengatakan: “kami tidak akan rela.” Oleh sebab itu, jika persekutuan antara budak dengan tuannya dalam harta tertolak, maka persekutuan antara Allah dengan salah satu makhluk-Nya juga tertolak, sebab seluruh makhluk adalah hamba Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Wahai orang-orang musyrik, Allah menciptakan untuk kalian perumpamaan yang diambil dari diri kalian. Kalian akan mendapatkan pelajaran darinya karena sia-sianya perbuatan syirik. Apakah kalian memiliki sekutu dalam hal yang kalian miliki berupa hamba sahaya, harta dan lain-lain? Kalian dan sekutu kalian sama-sama takut dalam mempergunakannya. Kalian takut untuk melepaskan (rejeki itu) dengan membiarkannya, seperti kalian takut terhadap orang-orang yang telah bebas seperti kalian? Maknanya jika kalian tidak mau memiliki sekutu selain kalian untuk memiliki rejeki kalian, lalu bagaimana bisa kalian mau menyekutukan Allah sang Maha Pencipta? Seperti itulah Kami jelaskan ayat-ayat dan bukti-bukti dengan perumpamaan yang jelas bagi kaum yang mau berpikir dan mengambil pelajaran. {Hal} adalah huruf istifham yang berfungsi untuk mengolok-olok. Ibnu Abbas berkata: “Suatu saat orang-orang musyrik membaca talbiyyah: “Kami memenuhi panggilanMu, ya Allah Kami penuhi panggilanMu, tidak ada sekutu bagiMu kecuali sekutu yang Engkau miliki dan kuasai” Kemudian turunlah ayat ini“"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia membuat perumpamaan bagi kalian dari diri kalian sendiri. Apakah ada di antara hamba sahaya yang kalian miliki menjadi sekutu bagi kalian dalam hal rezeki yang telah Kami anugerahkan kepada kalian, sehingga kalian menjadi setara dengan mereka di dalamnya} sehingga kalian dan mereka sama dalam berperilaku dalam hal yang telah disebutkan tanpa adanya perbedaan {Kalian takut kepada mereka sebagaimana kalian takut kepada sesama kalian} kalian takut bahwa mereka akan membagi harta dengan mereka sebagaimaka orang yang merdeka takut menggabungkan harta dengan orang yang merdeka lainnya {Seperti itulah Kami menjelaskan} menjelaskan {tanda-tanda itu bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. ini adalah sebuah perumpamaan yang disampaikan oleh Allah tentang betapa buruk dan kejinya perbuatan syirik; sebuah perumpamaan dari diri kalian sendiri, tidak memerlukan pemecahan (masalah), perjalanan jauh atau memperkerjakan unta, “apakah ada di antara hamba-sahaya yang kamu milki, sekutu bagimu dalam rizki yang telah Kami berikan kepadamu,” maksudnya, apakah ada seseorang di antara budak-budak sahaya kalian yang laki-laki atau perempuan yang bersekutu dengan kalian dalam kepemilikan rizki (harta kekayaan) kalian, dan kalian memandang diri kalian sama dengan mereka dalam hal itu; “kamu takut kepada mereka sebagaimana kamu takut kepada dirimu sendiri?” maksudnya, sebagaimana orang-orang merdeka yang bersekutu dengan sebenarnya, yaitu orang-orang dikhawatirkan akan mendapatkan bagian dan menguasai segala sesuatunya? Halnya tidak demikan! Sebab sesungguhnya tidak seorangpun dari budak sahaya yang kalian miliki yang menjadi sekutu kalian dalam kepemilkan rizki yang telah Kami anugerahkan kepada kalian. Dan juga bukan kalian yang telah mencipatakan mereka dan yang memberi mereka rizki. Mereka juga adalah hamba-hamba seperti kalian. Maka bagaimana mungkin kalian rela menjadikan sekutu bagi Allah dari makhluk ciptaanNya, dan kalian menjadikannya sekutu dengan Allah dan sebagai tandingan bagiNya dalam ibadah, padahal kalian sendiri tidak rela kalau kalian disamakan dengan budak-budak sahaya kalian? Ini merupakan hal yang paling mengherankan dan merupakan sesuatu yang paling membuktikan betapa piciknya orang yang mengangkat sekutu bagi Allah, dan bahwa sekutu yang diangkatnya itu palsu lagi sirna, sama sekali tidak setara dengan Allah dan tidak berhak diibadahi sedikitpun. “demikianlah Kami jelaskan ayat-ayat itu,” menjelaskannya lengkap dengan perumpamaannya,”bagi kaum yang mengerti” hakikat sesuatu, dan mereka mengetahuinya. Adapun orang yang tidak berakal (tidak paham), sekalipun ayat-ayat telah dijelaskan dan dibuktikan oleh berbagai bukti, maka ia tidak mempunyai akal untuk mengetahui sesuatu yang telah menjadi jelas, dan tidak pula mempunyai hati nurani yang dengannya ia bisa mengerti sesuatu yang sudah menjadi nyata. Jadi, orang-orang yang berakal dan bercendekia adalah orang yang menjadi sasaran tujuan konteks pembicaraan dan pembahasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 28: Allah memberikan permisalan yang dekat dari kalian dan yang ada pada diri-diri kalian, permisalan ini tidaklah diambil dari budak-budak dan urusan yang berhubungan dengan harta-harta kalian. Karena tidaklah permisalan yang Allah ambil dari hal itu selama-lamanya, tidak juga ditetapkan dengan sangkut-paut akan hal tersebut, tidak semestinya juga kalian takut akan penguasaan kalian akan harta-harta kalian serta infak kalian. Karena Allah juga tidak ingin disekutukan dalam peribadatan baik dengan Nabi maupun raja. Dengan permisalan ini Allah memperjelas hakikat-hakikat dan bermacam-macam hal yang penting gaya bahasa, contoh permisalan bagi kaum yang menjalankan akal-akal mereka, dan berinteraksi dengan apa yang dikatakan kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan perumpamaan yang Allah Subhaanahu wa Ta'aala buat untuk menerangkan buruknya syirk, dan perumpamaannya adalah diri kita. Wahai kaum musyrik! Kalimat istifham (pertanyaan) pada ayat di atas maksudnya adalah untuk menafikan, yakni bahwa hamba sahayamu tidaklah menjadi sekutumu dalam hal harta maupun lainnya sehingga mereka setara denganmu, dan tentu kamu tidak rela. Jika demikian mengapa kamu rela menjadikan sebagian milik Allah sebagai sekutu bagi-Nya? Yakni seakan-akan hamba sahayamu adalah orang-orang merdeka yang menjadi sekutumu. Yaitu memperjelasnya melalui perumpamaan-perumpamaan. Maksudnya, mengerti hakikat yang sebenarnya. Adapun orang yang tidak mengerti, jika diperjelas ayat-ayat kepadanya, maka tetap saja tidak mengerti. Kepada orang-orang yang mengerti atau berakal itulah ditujukan pembicaraan. Dari perumpamaan tersebut dapat diketahui, bahwa barang siapa yang mengambil sekutu selain Allah, di mana dia beribadah dan bertawakkal kepadanya dalam semua urusannya, maka sesungguhnya dia beribadah dan bertawakkal kepada sesuatu yang tidak memiliki hak apa-apa. Tetapi mengapa mereka masih saja melakukan perkara yang batil itu? Yang jelas sekali kebatilannya dan jelas buktinya. Sudah pasti, tidak ada yang mereka ikuti selain hawa nafsu semata sebagaimana diterangkan pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 28",
    "description": "Usai menjelaskan keesaan dan kekuasaan-Nya melalui bukti-bukti nyata yang bisa dilihat oleh mata manusia, kemudian pada ayat ini Allah menguatkan bukti-bukti itu dengan menampilkan contoh konkret yang menyentuh logika manusia. Dia membuat perumpamaan bagimu dari dirimu sendiri agar kamu hanya mengabdi kepada-Nya dan tidak menyekutukan-Nya. Apakah kamu rela jika ada di antara hamba sahaya yang kamu miliki menjadi sekutu bagimu dalam memiliki rezeki yang telah kami berikan kepadamu, sehingga kamu menjadi setara dengan mereka dalam hal kepemilikan ini, padahal sejatinya posisi hamba sahaya itu bagimu sama dengan harta lain yang kamu miliki, lalu kamu takut kepada mereka sebagaimana kamu takut kepada sesamamu' tentu tidak. Adalah tidak tepat menyamakan dua hal yang sejatinya sangat berbeda, yaitu antara budak dengan orang merdeka, apalagi antara Allah dengan hamba-Nya. Demikianlah kami jelaskan ayat-ayat itu bagi kaum yang mengerti, yaitu mereka yang mau menggunakan akalnya untuk berpikir. 29. Tanda-tanda eksistensi, keesaan, dan kekuasaan Allah sudah begitu jelas, tetapi karena pada dasarnya ingin menolak hal tersebut maka orang-orang yang zalim itu hanya mengikuti keinginannya tanpa ilmu pengetahuan yang benar dan logis. Ia secara sadar memilih jalan kesesatan, maka siapakah yang dapat memberi petunjuk menuju jalan kebenaran kepada orang yang telah disesatkan oleh Allah akibat pilihan sikapnya yang sesat itu' tentu tidak ada. Dan tidak ada seorang penolong pun bagi mereka di akhirat kelak."
  }
]