[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-5. Kerajaan Persia mengalahkan kerajaan Romawi di bagian negeri Syam yang terdekat kepada negeri Persia, namun orang-orang Romawi akan mengalahkan orang-orang Persia dalam beberapa waktu, tidak lebih dari sepuluh tahun dan tidak kurang dari tiga tahun. Hanya milik Allah segala urusan sebelum kemenangan orang-orang Romawi dan sesudahnya. Di hari orang-orang Romawi mengalahkan orang-orang Persia, orang-orang Mukmin berbahagia dengan kemenangan yang diberikan Allah kepada orang-orang Romawi atas orang-orang Persia. Allah memberikan kemenangan kepada siapa yang Dia kehendaki dan mengalahkan siapa yang Dia Kehendaki. Dia Maha perkasa yang tidak dikalahkan dan Maha Penyayang kepada siapa yang Dia kehendaki dari makhlukNya. Hal ini benar-benar terjadi, di mana orang-orang Romawi mengalahkan orang-orang Persia setelah tujuh tahun dan kaum muslimin berbahagia karena itu, sebab orang-orang Romawi adalah Ahli Kitab sekalipun mereka telah menyelewengkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Di negeri Syam paling dekat dengan negeri Persia. Dan setelah dikalahkan oleh Persia, Romawi akan kembali menang atas Persia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. فِىٓ أَدْنَى الْأَرْضِ (di negeri yang terdekat) Yakni di negeri mereka yang paling dekat dengan negeri Arab. Pendapat lain mengatakan yakni di negeri Jazirah. Dan pendapat lain mengatakan yakni di kota Dar’a. وَهُم مِّنۢ بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ(dan mereka sesudah dikalahkan itu akan menang) Yakni bangsa Ramawi setelah kekalahannya dari Bangsa Persia, akan berbalik mengalahkan bangsa Persia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Di negeri yang terdekat dengan tanah Romawi sampai tanah Persia serta tanah Arab di sebelah utara yang terhubung dengan semenanjung. Setelah kekalahan mereka, Romawi akan menang atas Persia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Persia telah mengalahkan Romawi {di negeri terdekat} bagian negeri Syam yang terdekat dari Persia {dan mereka setelah kekalahannya} setelah ditaklukkan oleh Persia {akan menang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. bangsa Persia dan bangsa romawi pada saat itu merupakan dua negara super power yang ada di muka bumi ini; dan selalu terjadi peperangan diantara dua bangsa ini sebagaimana biasa terjadi pada bangsa-bangsa yang selevel. Bangsa Persia adalah penyembah api, sedangkan bangsa romawi adalah ahli kitab yang berafilasi kepada Taurat dan injil, dan mereka lebih dekat kepada kaum muslimin daripada bangsa Persia. {orang-orang mukmin] sangat senang kalau bangsa romawi menang dan dapat mengalahkan bangsa Persia berada dalam kesyirikan, maka mereka senang kalau bangsa Persia menang atas bangsa romawi. Lalu ternyata bangsa Persia dapat menang atas bangsa romawi, dan mereka dapat mengalahkan bangsa romawi, namun tidak sampai menguasai kerajaan mereka, bahkan sedikitpun dari daerah kekuasaan romawi. Maka kaum musyrikin Arab pun sangat bergembira dengannya, sedangkan kaum Muslimin bersedih. Maka dari itu Allah mengabarkan kepada mereka dan menjanjikkan bahkan bangsa romawi akan mengalahkan bangsa Persia. “dalam beberapa tahun lagi,” Sembilan atau delapan tahun lagi, atau semisal hal itu, tidak lebih dari sepuluh tahun lagi dan tidak pula kurang dari tiga tahun; dan sesungguhnya kemenangan bangsa Persia terhadap bangsa romawi, lalu kemenangan bangsa romawi terhadap bangsa Persia semuanya terjadi atas kehendak dan kekuasaanNya. Dari itu Allah berfirman, ”milik Allah-lah urusan sebelum dan sesudahnya,” jadi kemenangan dan pertolongan itu tidak hanya sekedar disebabkan terwujudnya sebab kausalitas (fasilitas dan perlengkapan), melainkan pasti diiringi oleh qadha dan qadar. “dan di hari,” maksudnya, pada hari bangsa romawi dapat memenangkan bangsa Persia dan mengalahkan mereka, “bergembiralah orang-orang yang beriman, karena pertolongan Allah. Dia menolong siapa yang dikehendakiNya,” maksudnya, mereka bergembira dengan kemenangan bangsa romawi atas bangsa Persia, sekalipun semuanya adalah orang-orang kafir, akan tetapi sebagian keburukan (suatu kaum) itu lebih ringan daripada (keburukan dari kaum) yang lain. Dan pada saat itu pula kaum musyrikin berduka cita. “dan Dia-lah Yang Mahaperkasa,” yang memilki keperkasaan yang dengannya Dia menaklukkan seluruh makhluk; Dia memberikan kekuasaan dari siapa yang Dia kehendaki, Dia memuliakan siapa saja yang Dia kehendaki dan menghinakan siapa saja yang Dia kehendaki. “lagi Mahapenyayang,” terhadap hamba-hambaNYa yang beriman, yang mana Dia menyediakan segala sebab kausalitas yang dapat membuat mereka bahagia, dan menolong mereka yang sama sekali di luar perhitungan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 3: 2-5. Allah mengabarkan bahwa Persia menaklukkan Romawi di dekat bumi Syam arah menuju negeri Persia. Dan romawi akan kembali untuk mengalahkan Persia kurang dari sepuluh tahun mendatang, karena sesungguhnya seluruh urusannya adalah di tangan Allah setelah persia mengalahkan romawi. Bahwasanya semua itu adalah di bawah kehendak ilmu Allah dan penjagaan-Nya. Dan pada hari dikalahkannya persia oleh romawi, menjadikan gembira bagi orang-orang yang beriman dari para sahabat Nabi ﷺ dengan penaklukkan ini; Karena sebab Allah menolong Ahlul Kitab pengikut Musa dan Isa atas orang-orang majusi (persia) yang menghambakan diri kepada api, Allah juga menolong orang-orang yang beriman dari orang-orang musyrik di Badr, dan Allah menolong bagi siapa yang dikehendaki dan menaklukkan bagi siapa yang dikehendaki-Nya dari para hamba-Nya. Dialah yang maha kuat yang tidak ada yang dapat menaklukkan-Nya, yang maha penyayang yang maha luas kasih sayang-Nya atas segala sesuatu. Dan benar, bahwasanya romawi telah mengalahkan persia setelah tujuh tahun lamanya dengan serangan langsung kepada persia. Bergembiralah orang-orang muslim akan hal ini; Karena sebab romawi adalah Ahlul Kitab meskipun menyimpang, dan mereka lebih dekat kepada orang-orang yang beriman dibandingkan hamba yang beribadah kepada api."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, terdekat ke negeri Arab yaitu Syria dan Palestina sewaktu menjadi jajahan kerajaan Romawi Timur. Bangsa Romawi adalah satu bangsa yang beragama Nasrani yang mempunyai kitab suci, sedangkan bangsa Persia beragama Majusi, menyembah api dan berhala (musyrik). Keduanya adalah bangsa yang besar di dunia ketika itu, dan keduanya saling berperang. Ketika tersiar berita kekalahan bangsa Romawi oleh bangsa Persia, maka kaum musyrik Mekah menyambutnya dengan gembira karena berpihak kepada orang-orang musyrik Persia. Sedangkan kaum muslimin berduka cita karenanya. Disebutkan, bahwa orang-orang musyrik Mekah sampai berkata kepada kaum muslimin, “Kami akan mengalahkan kamu sebagaimana bangsa Persia mengalahkan bangsa Romawi.” Kemudian turunlah ayat ini dan ayat yang berikutnya menerangkan bahwa bangsa Romawi setelah kalah itu akan mendapat kemenangan dalam masa beberapa tahun saja. Hal itu benar-benar terjadi. Beberapa tahun setelah itu menanglah bangsa Romawi dan kalahlah bangsa Persia. Dengan kejadian itu jelaslah kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam sebagai Nabi dan Rasul dan kebenaran Al Quran sebagai firman Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 3",
    "description": "Kekalahan bangsa romawi itu terjadi di negeri yang terdekat ke negeri arab, yaitu suriah dan palestina sewaktu menjadi jajahan bangsa romawi timur, dan mereka, yakni bangsa romawi, setelah kekalahannya itu akan menang kembali atas bangsa persia yang beragama majusi (musyrik). 4. Kemenangan kembali bangsa romawi itu terjadi dalam beberapa tahun lagi, antara tiga hingga sembilan tahun. Milik Allah-lah urusan sebelum dan setelah kekalahan bangsa persia dan kemenangan bangsa romawi. Dan pada hari kemenangan bangsa romawi itu bergembiralah orang-orang yang beriman. Kegembiraan ini bukan semata karena kemenangan bangsa romawi yang percaya tuhan atas bangsa persia yang musyrik, tetapi lebih karena terbuktinya janji Allah yang diinformasikan pada ayat-ayat ini."
  }
]