[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tegakkanlah wajahmu (wahai Rasul dan orang-orang yang mengikutimu) dan berjalanlah terus di atas agama yang Allah syariatkan untukmu, yaitu Islam dimana Allah telah memfitrahkan manusia di atasnya. Keberadaan kalian di atasnya dan berpegangnya kalian kepadanya adalah berpegang kepada fitrah Allah dalam bentuk iman hanya kepadaNya semata, tiada pergantian bagi ciptaan dan agama Allah. Inilah jalan lurus yang menyampaikan kepada ridha Allah, Tuhan semesta alam dan surgaNya. Akan tetapi kebanyakan manusia tidak mengetahui bahwa apa yang diperintahkan kepadamu (wahai rasul) adalah agama yang haq, bukan selainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Maka tegakkanlah -wahai Rasul- wajahmu dan orang-orang yang bersamamu, dan hadapkanlah kepada agama yang telah dihadapkan oleh Allah kepadamu -dengan meninggalkan seluruh agama lainnya- yaitu agama Islam yang mana Allah menciptakan manusia menurut fitrah itu, tidak ada perubahan pada ciptaan Allah. Itulah agama lurus yang tidak bengkok, akan tetapi kebanyakan manusia tidak tahu bahwa agama yang benar adalah agama ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Allah memerintahkan Rasulullah dan umatnya untuk menghadapkan wajah kepada Allah dengan berpegang teguh di atas agama-Nya. Allah mengkhususkan wajah karena penghadapan wajah merupakan hasil dari penghadapan hati, dan keduanya membutuhkan usaha dari badan. Dan teguhlah di atas agama Islam, ia merupakan agama Allah yang manusia diciptakan Allah dengan agama Islam sejak kelahiran mereka, maka janganlah merubah fitrah yang telah Allah tetapkan bagi hamba-Nya itu. Namun teguhlah di atas agama yang agung dan jalan yang dapat mengantarkan kepada keridhaan Allah. Akan tetapi mayoritas hamba tidak mengetahui keagungan agama yang benar ini. Abu Hurairah berkata, Rasulullah bersabda: “Setiap anak dilahirkan di atas fitrah. Namun kedua orangtuanya-lah yang menjadikannya Yahudi, Nasrani, atau Majusi. Sebagaimana hewan yang dilahirkan oleh hewan yang terpotong telinganya, apakah kalian melihat pada anaknya itu ada yang terpotong telinganya?” Kemudian Rasulullah membaca: (فِطْرَتَ ٱللَّهِ ٱلَّتِى فَطَرَ ٱلنَّاسَ عَلَيْهَا لَا تَبْدِيلَ لِخَلْقِ ٱللَّه). (Diriwayatkan oleh Imam al-Bukhari dan Muslim. Dalam shahih al-Bukhari 8/372 no. 4775, kitab tafsir surat ar-Rum, bab [لَا تَبْدِيلَ لِخَلْقِ ٱللَّه]. Dan dalam Shahih Muslim 4/2047, kitab qadar, bab makna “Setiap anak dilahirkan di atas fitrah…)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ (Maka hadapkanlah wajahmu dengan lurus kepada agama Allah) Yakni lurus dan istiqamah kepada agama itu, tanpa menengok sedikitpun kepada agama-agama lain yang batil. فِطْرَتَ اللهِ الَّتِى فَطَرَ النَّاسَ عَلَيْهَا ۚ( (tetaplah atas) fitrah Allah yang telah menciptakan manusia menurut fitrah itu) Allah menjadikan fitrah mereka di atas keislaman; kalaulah bukan karena halangan yang menghalanginya sehingga mereka tetap dalam kekafirannya. Hal ini selaras dengan hadits Abu Hurairah dalam kitab shahih Muslim, ia berkata, Rasulullah bersabda: “tidak ada anak yang dilahirkan melainkan ia terlahir dalam keadaan fitrah, namun kedua orangtuanya menjadikannya Yahudi, Nasrani, atau Majusi.” Dan hadits dalam Musnad dari ‘Iyadh bahwa Rasulullah berkhutbah pada suatu hari dengan mengatakan dalam khutbahnya, menghikayatkan dari Allah: “Sungguh Aku menciptakan hamba-hamba-Ku semua di atas jalan yang lurus, namun setan-setan mendatangi mereka dan menyesatkan mereka dari agama mereka, dan Aku haramkan atas mereka apa yang telah Aku halalkan bagi mereka.” لَا تَبْدِيلَ لِخَلْقِ اللهِ ۚ( Tidak ada perubahan pada fitrah Allah) Yakni janganlah kalian ubah ciptaan Allah dengan menyembah selain-Nya, namun tetaplah kalian di atas fitrah keislaman dan tauhid. ذٰلِكَ الدِّينُ الْقَيِّمُ((Itulah) agama yang lurus) Yakni tetap di atas fitrah merupakan agama yang lurus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Tetaplah berpegang teguh wahai nabi dan orang yang mengikutimu kepada agama Islam. Murnikanlah pandangan dan tujuanmu hanya kepadaNya seraya berpaling dari setiap agama lain dan menuju jalan lurus serta mengikuti fitrah yaitu suatu keadaan yang mana Allah menciptakan manusia sesuai keadaan itu yaitu tunduk kepada Tuhan yang Maha Kuasa, Maha Bijaksana dan Maha Esa yang mana tidak ada sekutu bagiNya. Tidak ada satupun yang mampu mengubah fitrah ketuhanan, yaitu dari fitrah bertauhid menjadi fitrah untuk syirik. Kelaziman fitrah itu adalah agama yang lurus yang tidak ada penyimpangan di dalamnya. Akan tetapi kebanyakan manusia seperti orang-orang kafir Mekah tidak mengetahui kebenaran dan ilmu Tauhid karena mereka tidak mau berpikir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka hadapkanlah wajahmu kepada agama (Islam) dengan lurus} berpaling dari semua agama {fitrah (dari) Allah} tetaplah pada agama dan fitrah dari Allah {yang telah menciptakan manusia menurut (fitrah) itu. Tidak ada perubahan} tidak ada perubahan {pada ciptaan Allah. Itulah agama yang lurus} yang lurus yang tidak ada bengkok di dalamnya {tetapi kebanyakan manusia tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Allah memerintahkan untuk ikhlas kepadaNya dalam seluruh keadaan dan menegakkan agamaNya, seraya berfirman, ”maka hadapkanlah wajahmu,” maksudnya, pusatkan dan hadapkanlah ia, “kepada agama,” yaitu islam, iman dan ihsan, dengan cara menghadap dengan hati, niat dan jasadmu untuk menegakkan ajaran-ajaran agama yang nampak, seperti shalat, zakat, puasa, haji dan yang serupa dengannya, dan ajaran-ajarannya yang batin (tidak tampak) seperti cinta, rasa takut, berharap, berinabah; dan bersikap ihsan dalam seluruh ajaran yang lahir dan yang batin, yaitu dengan cara beribadah kepada Allah hingga seakan-akan anda melihatnya; dan jika anda tidak bisa melihatNya, maka (dengan keyakinan) bahwa Dia melihatmu. Allah mengkhususkan penegakan wajah, sebab menghadapnya wajah itu mengikuti konsentrasinya hati, dan usaha badan yang melahirkan dua hal tersebut. Maka dari itu Dia berfirman, “dengan lurus,” maksudnya, menghadap sepenuhnya kepada Allah dalam hal itu dalam keadaan berpaling drai selainNya. Perkara yang diperintahkan kepada kita ini adalah, “fitrah Allah yang telah menciptakan manusia menurut fitrah itu,” dan Allah telah menempatkan keindahan ajaran-ajaran agama tersebut di dalam akal mereka, dan pandangan buruk kepada yang lain. Karena sesungguhnya seluruh hukum syariat yang lahir dan yang batin, telah ditempatkan oleh Allah kecenderungan padanya di dalam hati seluruh manusia. Allah meletakkan di dalam hati mereka kecintaan kepada yang benar dan sikap mengutamakan yang benar. Inilah hakikat fitrah. Siapa saja yang keluar dari prinsip ini, maka sungguh dia menentang sesuatu yang menimpa fitrahnya, kemudian yang membuatnya rusak, seperti yang disabdakan oleh nabi, “setiap anak yang dilahirkan itu dilahirkan atas fitrah, maka kedua orang tuanyalah yang menjadikannya yahudi, atau menjadikannya nasrani, atau menjadikannya majusi,” “tidak ada perubahan pada fitrah Allah,” maksudnya, tidak seorangpun dapat merubah ciptaan Allah sehingga menjadikan makhluk tidak pada tempat (keadaan) yang telah ditetapkan oleh Allah. “itulah” yang kami perintahkan kepadamu, “agama yang lurus,” maksudnya, jalan yang lurus yang dapat mengantar kepada Allah dan kepada kemuliaanNya. Maka sesungguhnya siapa saja yang menegakkan wajahnya kepada agama dengan tulus, maka sesungguhnya dia adalah orang yang berjalan di atas jalan yang lurus dalam seluruh syariat-syariatNya dalan jalan-jalanNya, “tetapi kebanyakan manusia tidak mengetahui,” maka mereka tidak mau mengenal agama yang lurus ini, dan jikapun mereka mengetahuinya, maka mereka tidak akan menelusurinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 30: Allah memerintahkan Nabi-Nya Muhammad ﷺ dan yang mengikutinya agar menerima agama islam dan istiqamah di atasnya, dan agar juga bersungguh-sungguh dalam ibadah kepada Allah serta taat kepada-Nya, serta agar jangan berpaling dari agama-agama dan golongan-golongan yang lain. Al Wajhu di sini adalah anggota badan yang telah dikenal yang membedakan manusia antara satu dengan yang lainnya dari beraneka macam jenis manusia, dan Al Wajhu diungkapkan juga di sini sebagai dzat sebagaiman firman Allah dalam surat Luqman : 22 dan Al Qashash : 88. Ketahuilah wahai Nabi Allah bahwsanya agama islam adalah fitrah dari Allah, maka tetaplah di atasnya. Bagi kalian wahai manusia wajib untuk tetap berada di atas agama ini dan yang telah Allah berikan fitrah bagi manusia atasnya; Karena sebab Allah menciptakan manusia berada di atas tauhid sebagaimana dalam hadits yang dikeluarkan oleh Muslim dari Iyadh : “Sesungguhnya Aku menciptakan manusia sebagai hamba-Ku dengan lurus seluruhnya, maka para setanlah yang memalingkan mereka”. Ketahuilah bahwasanya agama ini (Islam) adalah agama yang Allah ridhai bagi kalian, tidak akan pernah tergantikan, tidak juga berubah jika kalian masih berada di atas fitrah-Nya. Agama ini adalah jalan yang lurus yang mengantarkan menuju kepada ridha Allah, akan tetapi manusia tidak mengetahui akan hal itu, karena sebab mereka mengikuti setan dan hawa nafsu mereka serta bertaklid dengan taklid buta yang rusak dan meninggalkan ketauhidan kepada Allah dengan ibadah dan yang mereka diperintahkan atasnya serta apa yang diperintahkan oleh Rasulullah kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini Alah Subhaanahu wa Ta'aala memerintahkan untuk mengikhlaskan ibadah kepada Allah dan karena-Nya dalam semua keadaan, dan memerintahkan untuk menegakkan agama-Nya. Yakni hati, niat dan badanmu. Allah sebut “wajah” secara khusus, karena dengan menghadapnya wajah, maka yang lain ikut pula menghadap (seperti hati dan anggota badan). Yakni menghadap kepada Allah dan berpaling dari selain-Nya. Yang di dalamnya terdapat Islam, iman dan ihsan. Yaitu dengan mengarahkan hati, niat dan badan kita untuk menegakkan syari’at Islam yang tampak, seperti shalat, zakat, puasa, haji, dsb. Demikian pula untuk menegakkan syari’at Islam yang tersembunyi, seperti cinta, takut, berharap, kembali dan berbuat ihsan dalam mengerjakan semua syariat yang tampak itu dan yang tersembunyi, yaitu dengan beribadah kepada Allah seakan-akan melihat-Nya, dan jika tidak merasakan begitu, maka sesungguhnya Dia melihat kita. Maksudnya, yang diperintahkan itu adalah fitrah Allah. Allah Subhaanahu wa Ta'aala telah menetapkan indahnya semua syariat Allah, seperti tauhid, mendirikan shalat, berbuat baik, dsb. dalam pandangan manusia dan buruknya selain itu. Karena semua hukum-hukum syariat yang tampak maupun tersembunyi telah Allah tanamkan dalam hati semua makhluk, cenderung kepadanya, sehingga dalam hati mereka ada kecintaan kepada kebenaran dan mengutamakan yang hak. Ini adalah hakikat fitrah. Oleh karena itu, barang siapa yang keluar dari fitrah ini, maka disebabkan pengaruh luar yang datang kepada fitrah itu sehingga merusaknya, sebagaimana sabda Nabi shallallahu 'alaihi wa sallam: مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ ، فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ “Tidak ada seorang anak pun yang lahir, kecuali di atas dasar fitrah (Islam). Kedua orang tuanyalah yang menjadikannya Yahudi, Nasrani atau Majusi.” (HR. Bukhari dan Muslim) Dengan demikian, Manusia diciptakan Allah mempunyai naluri beragama yaitu agama tauhid (Islam). Jika ada manusia tidak bertauhid, maka hal itu tidak wajar. Mereka tidak bertauhid itu hanyalah karena pengaruh lingkungan. Yakni agama-Nya. Atau maksudnya, tidak ada seorang pun yang dapat merubah ciptaan Allah, seperti menjadikan makhluk di atas selain fitrah itu. Yakni yang menyampaikan kepada Allah dan kepada pemberian-Nya yang istimewa (surga-Nya), karena barang siapa yang menghadapkan wajahnya dengan lurus kepada agama Islam ini, maka dia telah menempuh jalan yang lurus yang menyampaikan kepada Allah dan surga-Nya. Kebanyakan mereka tidak mengetahui agama yang lurus, dan kalau pun mengetahui, namun mereka tidak mau menempuhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 30",
    "description": "Setelah memaparkan bukti-bukti keesaan dan kekuasaan Allah serta meminta rasul dan umatnya bersabar dalam berdakwah, melalui ayat berikut Allah meminta mereka agar selalu mengikuti agama islam, agama yang sesuai fitrah. Maka hadapkanlah wajahmu, yakni jiwa dan ragamu, dengan lurus kepada agama islam. Itulah fitrah Allah yang dia telah menciptakan manusia menurut fitrah itu. Manusia diciptakan oleh Allah dengan bekal fitrah berupa kecenderungan mengikuti agama yang lurus, agama tauhid. Inilah asal penciptaan manusia dan tidak boleh ada seorang pun yang melakukan perubahan pada ciptaan Allah tersebut. Itulah agama yang lurus, agama tauhid, tetapi kebanyakan manusia tidak mengetahui dan menyadari bahwa mengikuti agama islam merupakan fitrahnya. 31. Berpegangteguhlah pada agama yang lurus itu dengan mendekat dan kembali bertobat kepada-Nya dengan sepenuh hati, dan bertakwalah kepada-Nya dengan melaksanakan segala perintah-Nya dan menjauhi segala larangan-Nya, serta laksanakanlah salat secara konsisten dan sempurna, dan janganlah kamu termasuk orang-orang yang mempersekutukan Allah dalam beribadah atau mempersekutukan-Nya dengan mengikuti agama yang menyimpang."
  }
]