[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Janganlah kalian termasuk orang-orang yang mempersekutukan Allah, pengikut hawa nafsu dan bid’ah dalam agama yang mengganti agama dan merubahnya, yang mana mereka mengambil sebagian dan meninggalkan sebagian yang lain, hanya untuk mengikuti hawa nafsu mereka, sehingga mereka terbelah menjadi aliran-aliran dan kelompok-kelompok, mereka menginduk kepada tokoh-tokoh mereka, aliran-aliran dan pendapat-pendapat mereka, sebagian membantu sebagian yang lain di atas kebatilan, masing-masing aliran berbahagia dan berbangga dengan apa yang dimilikinya. Mereka menetapkan diri mereka di atas kebenaran, sedangkan selain mereka di atas kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan janganlah kalian menjadi bagian dari orang-orang musyrik yang merubah agama mereka, beriman dengan sebagian darinya dan mengingkari sebagian lainnya, mereka terpecah belah dalam berbagai kelompok-kelompok dan golongan-golongan, setiap golongan dari mereka merasa bangga dengan kebatilan yang ada pada mereka, mereka merasa bahwa hanya mereka yang benar sementara yang lainnya berada dalam kebatilan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. مِنَ الَّذِينَ فَرَّقُوا۟ دِينَهُمْ وَكَانُوا۟ شِيَعًا ۖ (yaitu orang-orang yang memecah-belah agama mereka dan mereka menjadi beberapa golongan) Yakni terpecah belah menjadi firqah-firqah dalam beragama yang saling bantu membantu, yaitu para ahli bid’ah dan pengikut hawa nafsu, orang-orang Yahudi, orang-orang dan Nasrani. كُلُّ حِزْبٍۭ بِمَا لَدَيْهِمْ فَرِحُونَ(Tiap-tiap golongan merasa bangga dengan apa yang ada pada golongan mereka) Yakni setiap golongan merasa senang dan bangga dengan agama mereka yang terbangun di atas ketidakbenaran, karena mereka mengira berada di atas kebenaran padahal mereka benar-benar jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Yaitu orang-orang musyrik yang menyimpang dalam beribadah dengan mengikuti hawa nafsunya. Mereka (terbagi) menjadi kelompok-kelompok dan golongan-golongan. Mereka saling mendukung satu sama lain. Setiap kelompok senang dengan agama yang mereka ciptakan, dan dengan itu mereka beranggapan bahwa mereka berada dalam kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang memecah-belah agama mereka} mengubah agama mereka, sehingga mereka beriman kepada sebagian dan mengingkari sebagian lain {sehingga menjadi beberapa golongan} beberapa golongan dan kelompok yang berbeda {Setiap golongan} golongan {merasa bangga} bahagia {dengan apa yang ada pada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. kemudian Allah menjelaskan kondisi orang-orang musyrikin dengan nada mencela dan memburuk-burukkannya, seraya berfirman,”yaitu orang-orang yang memecah belah agama mereka,” padahal agama itu hanya satu, yaitu ketulusan ibadah hanya kepada Allah saja; sedangkan mereka, kaum musyrikin memecah belahnya. Diantara mereka ada yang menyembah patung dan berhala, dan ada pula yang menyembah matahari dan bulan, dan ada juga di antara mereka yang menyembah para wali dan orang-orang shalih, dan di antara mereka adalah orang-orang yahudi, dan ada pula orang-orang nasrani. Maka dari itu Allah berfirman, ”dan mereka menjadi beberapa golongan,” maksudnya, setiap kelompok dari kelompok-kelompok kesyirikan itu tersesat dan fanatic untuk membela kebatilan yang mereka anut, menentang dan memerangi selain mereka, “tiap-tiap golongan, dengan apa yang ada pada mereka,” berupa ilmu yang menyalahi ilmu para rasul, “mereka bangga” dengannya. Mereka mengklaim bahwa apa yang mereka anut itulah yang haq (benar), dan bahwa orang-orang selain mereka berada di atas kebatilan. Dalam uraian diatas terdapat peringatan untuk kaum Muslimin agar tidak tercerai berai dan terpecah belah menjadi bergolong-golongan seperti mereka; setiap golongan fanatic dengan kebenaran dan kebatilan yang mereka miliki. Kalau demikian maka mereka (kaum Muslimin) menjadi serupa dengan kaum musyrikin dalam berpecah belah. Sesungguhnya agama itu satu, rasul pun satu, sembahan (ilah) juga satu, dan kebanyakan permasalahan agama telah menjadi ijma’ diantara para ahli ijtihad dan para pemuka agama, sedangkan ukhuwah imaniyah telah diikat kuat oleh Allah dengan sekuat-kuat ikatan, lalu bagaiamana bisa semua itu dibatalkan, kemudian dibangun perpecahan dan pertikaian di antara kaum muslimin dikarenakan beberapa permasalahan yang rumit atau masalah furu’ khilafiyah yang karenanya sebagian memvonis sesat sebagian yang lain, dan sebagian membedakan diri dengannya dari kelompok lain? Tidakkah semua ini merupakan adu domba terbesar setan dan angan-angannya yang paling besar yang dengannya ia memperdaya kaum muslimin? Tidakkah mengupayakan persatuan kalimat (kesatuan) mereka dan memberantas pertikaian yang ada pada mereka, (pertikaian) yang dibangun di atas prinsip yang palsu itu merupakan jihad yang paling utama fisabilillah dan merupakan amal yang paling afdhal yang dapat mendekatkan diri kepada Allah? Setelah Allah memerintahkan berinabah kepadaNya, sedangkan yang diperintahkan darinya adalah inabah yang bersifat suka rela, yaitu yang terjadi dalam kondisi sulit dan mudah, kondisi lapang dan sempit, maka Dia menjelaskan inabah yang bersifat terpaksa, yaitu yang tidak akan ada bersama manusia kecuali pada saat kesempitan dan kesulitan. Lalu, apabila kesempitan itu sudah tidak ada padanya, maka dia membuang inabah itu ke belakang punggungnya. Dan hal seperti ini tidak berguna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Rum ayat 32: Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan keadaan kaum musyrik sambil menerangkan buruknya keadaan mereka. Dalam sebuah qira’aat, dibaca “Faaraquu” (meninggalkan). Maksudnya, meninggalkan agama tauhid (Islam) dan menganut berbagai kepercayaan menurut hawa nafsu mereka. Di antara mereka ada yang menyembah patung dan berhala, ada pula yang menyembah api, ada pula yang menyembah matahari, ada yang menyembah wali dan orang-orang saleh, dsb. Para pengikut golongan tersebut bersikap fanatik kepada golongannya dan membela kebatilan yang ada pada golongan tersebut, serta menentang orang yang berada di luar golongannya dan memeranginya. Berupa ilmu yang menyelisihi ilmu para rasul. Mereka bangga dengannya, sehingga mereka memutuskan bahwa yang ada pada mereka adalah yang hak, sedangkan selain mereka adalah batil. Dalam ayat ini terdapat peringatan kepada kaum muslimin agar tidak terpecah-pecah ke dalam beberapa kelompok, di mana masing-masing bersikap fanatik kepada apa yang ada bersama mereka, hak atau batil, sehingga mereka mirip dengan kaum musyrik dalam perpecahan, padahal agamanya satu, rasul mereka satu, dan Tuhan yang disembah hanya satu. Kebanyakan masalah-masalah agama (seperti masalah ushuluddin) telah terjadi kesepakatan di kalangan para ulama dan para imam, dan persaudaraan seiman pun telah Allah ikat dengan kuat, maka mengapa semua itu tidak dianggap dan perpecahan di antara kaum muslimin malah dibangun di atas masalah-masalah yang samar, masalah furu’ yang di sana terjadi khilaf, sampai-sampai yang satu menyesatkan yang lain, dan sebagian mereka memisahkan diri dari yang lain. Ini tidak lain karena godaan setan yang ditimpakan kepada kaum muslimin. Oleh karena itu, usaha untuk menyatukan kesatuan mereka, menghilangkan pertengkaran yang terjadi yang didasari atas asas yang batil termasuk jihad fii sabilillah dan amal utama yang mendekatkan diri kepada Allah?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 32",
    "description": "Janganlah kamu termasuk kaum musyrik, yaitu orang-orang yang memecah belah agama mereka dengan cara meninggalkan agama tauhid dan menganut berbagai kepercayaan menurut hawa nafsu mereka, dan mereka menjadi beberapa golongan dengan agama dan kepercayaan yang berbeda-beda. Setiap golongan merasa bangga dengan apa yang ada pada golongan mereka, meskipun itu menyimpang dari agama yang benar. 33. Usai menguraikan dalil-dalil tauhid, pada rangkaian ayat berikut ini Allah beralih menerangkan sifat buruk orang-orang musyrik dan kafir. Dan apabila manusia, yakni orang musyrik atau kafir, ditimpa oleh suatu bahaya atau musibah, mereka menyeru tuhannya dengan berdoa dan kembali bertobat kepada-Nya, kemudian apabila dia memberikan sedikit rahmat-Nya kepada mereka dengan membebaskan mereka dari bahaya atau musibah, tiba-tiba sebagian mereka mempersekutukan Allah kembali, sedangkan yang lain benar-benar bertobat."
  }
]