[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila manusia ditimpa ujian yang berat, mereka memohon kepada Tuhan mereka dengan ikhlas kepadaNya agar Allah mengangkat kemudaratan dari mereka, namun bila Allah merahmati mereka dan mengangkat kesulitan mereka, ternyata sebagian dari mereka mengulang kesyirikan lagi, lalu mereka menyembah sesuatu yang lain bersama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Apabila orang-orang musyrik tertimpa kesusahan berupa sakit, kefakiran dan kelaparan, mereka berdoa hanya kepada Rabb mereka Yang Mahasuci semata, kembali kepada-Nya dengan tunduk dan pasrah dengan harapan agar Allah meghindarkan mereka dari musibah yang sedang menimpa mereka. Kemudian jika Allah telah merahmati mereka dengan menghilangkan musibah yang menimpa mereka, tiba-tiba segolongan dari mereka kembali kepada menyekutukan Allah dengan selain-Nya dalam berdoa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Jika manusia tertimpa musibah dan kesulitan maka mereka akan mengesakan Allah, memohon pertolongan dari-Nya, dan bertaubat kepada-Nya agar Allah mengangkat musibah mereka. Akan tetapi jika Allah mengabulkan permohonan mereka dengan rahmat-Nya, sebagian dari mereka tiba-tiba menyekutukan Allah dan kesudahan mereka adalah mengingkari rahmat-Nya. Kemudian Allah mengancam mereka: “Hai orang-orang kafir, bersenang-senanglah, namun kalian akan mengetahui tempat kesudahan kalian akibat dari keingkaran itu adalah neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَإِذَا مَسَّ النَّاسَ ضُرٌّ (Dan apabila manusia disentuh oleh suatu bahaya) Yakni berupa kekeringan dan kesengsaraan. دَعَوْا۟ رَبَّهُم(mereka menyeru Tuhannya) Mengharap dan meminta tolong agar Dia mengangkat musibah itu. مُّنِيبِينَ إِلَيْهِ(dengan kembali bertaubat kepada-Nya) Yakni kembali kepada-Nya tanpa bersandar kepada selain-Nya. ثُمَّ إِذَآ أَذَاقَهُم مِّنْهُ رَحْمَةً(kemudian apabila Tuhan merasakan kepada mereka barang sedikit rahmat daripada-Nya) Dengan mengabulkan permohonan mereka dan mengangkat musibah itu. إِذَا فَرِيقٌ مِّنْهُم بِرَبِّهِمْ يُشْرِكُونَ (tiba-tiba sebagian dari mereka mempersekutukan Tuhannya) Yakni kembali menyembah selain Allah, padahal mereka mengetahui bahwa tidak ada yang mampu mengangkat dari mereka musibah itu kecuali Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Jika manusia seperti orang-orang kafir Mekah tertimpa sesuatu yang membahayakan mereka yang dapat menyebabkan penderitaan dan musibah. Mereka berdoa kepada Tuhan mereka untuk mengangkat bahaya tersebut dari mereka seraya hanya kembali kepadaNya bukan selainNya dan berdoa dengan hati yang khusyu’. Kemudian Dia (Allah) mengasihi mereka dan membebaskan mereka dari bahaya dan penderitaan itu. Kemudian suatu kelompok dari mereka menyekutukan Tuhan dan kembali kepada kesyirikan mereka sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika manusia ditimpa suatu bahaya} penderitaan {mereka menyeru Tuhan mereka dengan keadaan kembali kepadaNya. Kemudian apabila Dia memberikan sedikit rahmatNya kepada mereka, tiba-tiba sebagian mereka menyekutukan Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. “dan apabila manusia disentuh oleh suatu bahaya,” (berupa) sakit atau rasa takut dari kematian atau lainnya, niscaya “mereka menyeru Rabbnya dengan kembali bertaubat kepadaNya,” mereka melupakan apa yang mereka persekutukan denganNya dalam kondisi itu, karena mereka tahu bahwa tidak ada yang dapat menyingkap bahya itu kecuali Allah, maka “apabila Dia merasakan kepada mereka barang sedikit rahmat dariNya,” Dia menyembuhkan mereka dari sakitnya dan mengamankan mereka dari rasa takut, “tiba-tiba sebagian dari mereka,” merusak inabah yang mereka lakukan itu dan mereka mempersekutukanNya dengan sesuatu yang sama sekali tidak dapat membela mereka, tidak pula dapat membuat mereka kaya atau membuat mereka fakir. Semua itu adalah keingkaran terhadap apa yang Allah karuniakan dan anugerahkan kepada mereka, yang mana Dia telah menyelamatkan dan membebaskan mereka drai kesengsaraan dan melepaskan mereka drai kesempitan. Mengapa mereka tidak membalas nikmat mulia dengan bersyukur dan tulus ikhlas (bertauhid) kepadaNya dalam seluruh kondisi?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 33: Allah menjelaskan jika manusia tertimpa kemudharatan berupa sakit atau paceklik atau kesulitan, mereka takut binasa; Mereka meminta kepada Allah dengan penuh keikhlasan, yakin, mengesakan-Nya, memohon dan berharap kepada Allah serta meninggalkan kesyirikan kepada-Nya, dan jika Allah telah hilangkan kemudharatan bagi mereka serta diberikan kesuksesan dan pertolongan dari kemudharatan yang menimpa mereka; Mereka kembali beribadah kepada selain Allah kemudian mereka menisbatkan pertolongan mereka dari sakit karena sebab kemahiran tabib (dokter), dan keberhasilan mereka mengarungi lautan atau daratan karena sebab pemimpin atau kapal mereka; Bahkan ketika terjadi gempa atau gunung meletus mereka berkata : “Ini adalah fenomena alam yang alami, ini hanyalah tsunami, ini hanyalah begini dan begitu”. Mereka melupakan dari sebab dari peristiwa tersebut, dan semua itu karena sebab dosa-dosa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memerintahkan kembali kepada-Nya, dan kembali tersebut adalah perkara ikhtiyari (pilihan), yang bisa dilakukan ketika keadaan susah maupun lapang, luas maupun sempit, maka Allah Subhaanahu wa Ta'aala menyebutkan kembali yang sifatnya mendesak, di mana keadaan ini biasanya dilakukan semua manusia ketika kondisi dalam bahaya, namun sayangnya, biasanya ketika bahaya itu hilang, ternyata mereka malah membuang sikap kembali itu ke belakang punggungnya, dan kembali seperti sebelumnya. Sikap kembali seperti ini tidaklah bermanfaat apa-apa bagi pelakunya. Seperti sakit atau khawatir akan binasa. Mereka melupakan semua yang mereka sekutukan dengan Allah saat kondisi seperti itu, karena mereka mengetahui, bahwa tidak ada yang dapat menghilangkannya selain Allah Subhaanahu wa Ta'aala. Yang dimaksudkan dengan rahmat disini ialah lepas dari bahaya itu atau dari sakit yang dideritanya. Mereka membatalkan sikap kembali itu yang timbul dari diri mereka, lalu menyekutukan Allah kembali dengan sesuatu yang tidak dapat menghilangkan bahaya dan memberikan manfaat. Ini semua merupakan sikap kufur terhadap nikmat Allah, di mana Dia telah menyelamatkan mereka dari kesulitan. Maka mengapa mereka tidak menyikapi nikmat itu dengan sikap syukur dan senantiasa ikhlas dalam semua keadaan?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 33",
    "description": "Usai menguraikan dalil-dalil tauhid, pada rangkaian ayat berikut ini Allah beralih menerangkan sifat buruk orang-orang musyrik dan kafir. Dan apabila manusia, yakni orang musyrik atau kafir, ditimpa oleh suatu bahaya atau musibah, mereka menyeru tuhannya dengan berdoa dan kembali bertobat kepada-Nya, kemudian apabila dia memberikan sedikit rahmat-Nya kepada mereka dengan membebaskan mereka dari bahaya atau musibah, tiba-tiba sebagian mereka mempersekutukan Allah kembali, sedangkan yang lain benar-benar bertobat. 34. Kemusyrikan dan kekafiran itu hanya akan merugikan diri mereka. Karena itu, biarkan mereka mengingkari rahmat yang telah kami berikan. Dan bersenang-senanglah kamu, wahai orang-orang musyrik, maka di akhirat kelak kamu akan mengetahui akibat perbuatanmu."
  }
]