[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah Kami telah menrunkan kepada orang-orang musyrik itu sebuah bukti yang nyata dan sebuah kitab yang jelas yang membuktikan kebenaran kesyirikan dan kekafiran mereka kepada Allah dan ayat-ayatNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Apa yang mendorong mereka kembali berbuat syirik terhadap Allah padahal mereka tidak punya hujah? Dan tidaklah Kami menurunkan hujah bagi mereka dari kitab yang bisa mereka gunakan untuk membenarkan kesyirikan mereka terhadap Allah, dan mereka pun tidak mempunyai kitab yang menyebutkan kesyirikan mereka dan mengakui kebenaran kekafiran yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Allah mengingkari orang-orang yang ingkar itu: “Apakah Kami telah menurunkan kepada mereka hujjah yang jelas bagi kesyirikan mereka atau kitab yang menyatakan kebenaran kesyirikan itu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. أَمْ أَنزَلْنَا عَلَيْهِمْ سُلْطٰنًا (Atau pernahkah Kami menurunkan kepada mereka keterangan) Maknanya adalah, tetapi apakah Kami telah menurunkan kepada mereka bukti yang jelas. فَهُوَ يَتَكَلَّمُ بِمَا كَانُوا۟ بِهِۦ يُشْرِكُونَ(lalu keterangan itu menunjukkan (kebenaran) apa yang mereka selalu mempersekutukan dengan Tuhan?) Yakni bukti itu berucap tentang menyekutukan Allah. Yakni yang menunjukkan bahwa kesyirikan mereka adalah benar?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Ataukah Kami pernah menurunkan kepada mereka keterangan dan kitab yang jelas yang menjadi hujjah bagi mereka, lalu hujjah itu menyebutkan dan memperbolehkan tindakan mereka untuk menyekutukan Allah SWT? Ungkapan ini adalah bentuk pengingkaran. Maknanya mereka tidak memiliki hujjah untuk melakukan sesuatu yang mengkhawatirkan berupa kesyirikan dan kesesatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau pernahkah Kami menurunkan kepada mereka dalil} dalil dan kitab dari langit {yang menjelaskan apa yang selalu mereka sekutukan denganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “atau pernahkah kami menurunkan kepada mereka keterangan,” maksudnya, hujjah nyata, “lalu ia” maksudnya, hujjah yang nyata itu, ”menunjukkan (kebenaran) apa yang selalu mereka persekutukan denganNya,” dan mengatakan kepada mereka,”tetaplah kalian pada kesyirikan kalian itu dan teruslah kalian dalam keraguan, karena sesungguhnya apa yang kalian anut itulah yang benar, sedangkan apa yang diserukan oleh para rasul kepada kalian itulah yang batil” lalu apakah hujjah yang nyata itu ada disisi mereka hingga mengharuskan mereka sangat berpegang teguh kepada kesyirikan? Ataukah dalil-dalil rasional dan syar’I, kitab-kitab samawi, para rasul yang mulia dan para penghulu manusia telah melarang dengan sekeras-kerasnya dari semua itu, dan mereka telah memperingatkan dari mengikuti jalan-jalannya yang dapat mengantarkan kepadanya, dan mereka telah memvonis kerusakan akal dan agama siapa saja yang melakukannya? Jadi kesyirikan mereka itu tanpa hujjah (argument yang jelas) dan keterangan yang nyata. Ia sebenarnya hanyalah hawa nafsu dan bujukan-bujukan setan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 35: Allah kemudian berkata : Apakah Allah telah menurunkan hujjah bagi mereka orang-orang musyrik yang nampak agar mereka kokoh di atas kesyirikan mereka ?! Jawabannya adalah : Tidak turun apapun atas para Nabi kecuali tauhid dan ibadah kepada-Nya saja serta meninggalkan persekutuan selain Allah. Allah menyeru para Nabi, memerintahkan agar manusia menyeru kepada tauhid dan kepada ibadah kepada-Nya saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apakah ada keterangan yang turun kepada mereka; yang mengatakan, “Tetaplah kamu berbuat syirk, karena yang kamu pegang selama ini adalah hak dan yang diserukan para rasul adalah batil.” Adakah keterangan itu sehingga mengharuskan mereka berpegang dengan syirk? Bahkan yang ada dari wahyu dan akal sehat, dari kitab-kitab samawi (yang turun dari langit), dan dari para rasul serta panutan manusia, adalah melarang mereka berbuat syirk, melarang mereka menempuh jalan-jalan yang mengarah kepada syirk serta menghukumi rusaknya akal dan agama orang yang melakukan syirk. Dengan demikian, syirk yang mereka lakukan itu tidak didasari hujjah dan dalil, tetapi sekedar hawa nafsu dan bisikan setan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 35",
    "description": "Allah mempertanyakan alasan mengapa orang-orang musyrik itu bersikap demikian. Atau pernahkah kami menurunkan kepada mereka keterangan atau bukti yang menjelaskan dan membenarkan apa yang selalu mereka persekutukan dengan tuhan' tentu tidak. Itu hanyalah ke-bohongan yang mereka buat-buat. 36. Dan di antara sifat buruk orang-orang musyrik itu adalah bahwa apabila kami berikan sesuatu rahmat kepada manusia, yakni kaum musy-rik, misalnya terbebas dari bencana atau musibah, niscaya mereka gembira dengan rahmat itu, bahkan dengan congkak mereka menganggapnya sebagai hasil usaha mereka sendiri. Akan tetapi, apabila suatu saat mereka ditimpa sesuatu musibah karena kesalahan atau kemaksiatan mereka sendiri, seketika itu mereka berputus asa dari rahmat Allah."
  }
]