[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila Kami melimpahkan kenikmatan kepada manusia dari Kami berupa kesehatan, keselamatan, dan kesenangan, mereka berbahagia karena itu dengan kebahagiaan yang mengandung keangkuhan dan kesombongan, bukan kebahagiaan yang mengandung syukur. Namun bila mereka ditimpa penyakit, kemiskinan, ketakutan, dan kesempitan hidup disebabkan oleh dosa-dosa dan kemaksiatan-kemaksiatan mereka, ternyata mereka berputus asa dari lenyapnya semua itu. Ini adalah tabiat kebanyakan manusia dalam keadaan senang dan susah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan jika Kami memberikan suatu nikmat dari kenikmatan-kenikmatan Kami seperti nikmat kesehatan dan kekayaan, mereka bergembira karenanya dengan kegembiraan yang dipenuhi kesombongan dan takabur. Dan jika mereka mendapatkan musibah yang tidak mereka suka seperti penyakit dan kemiskinan karena kemaksiatan yang mereka lakukan dengan tangan-tangan mereka sendiri, tiba-tiba mereka merasa putus asa dari rahmat Allah dan pesimis akan perginya musibah yang tidak mereka sukai itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Jika Kami memberi kebaikan kepada manusia maka mereka akan merasa senang, namun jika mereka tertimpa musibah akibat kemaksiatan yang mereka lakukan maka mereka segera berputus asa dari rahmat Allah. Tidakkah mereka mengetahui bahwa Allah meluaskan atau menyempitkan rezeki bagi hamba-Nya yang Dia inginkan? Sungguh dalam pengaturan yang bijaksana itu terdapat tanda-tanda yang menunjukkan keesaan Allah bagi orang-orang yang beriman kepada Allah dan para rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَإِذَآ أَذَقْنَا النَّاسَ رَحْمَةً (Dan apabila Kami rasakan sesuatu rahmat kepada manusia) Yakni berupa kemudahan, kenikmatan, kelapangan, dan kesehatan. فَرِحُوا۟ بِهَا ۖ (niscaya mereka gembira dengan rahmat itu) Yakni kegembiraan yang dibarengi dengan keangkuhan, bukan kegembiraan yang menunjukkan rasa syukur atas rahmat itu. وَإِن تُصِبْهُمْ سَيِّئَةٌۢ (Dan apabila mereka ditimpa suatu musibah) Yakni kesulitan dalam bentuk apapun. بِمَا قَدَّمَتْ أَيْدِيهِمْ(disebabkan kesalahan yang telah dikerjakan oleh tangan mereka sendiri) Yakni akibat dosa-dosa mereka. إِذَا هُمْ يَقْنَطُونَ (tiba-tiba mereka itu berputus asa) Yakni berputus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Ketika kami membuat manusia merasakan kenikmatan dari Kami seperti kesejahteraan dan kesehatan maka mereka akan bangga dan angkuh karena itu. Dan jika musibah dan penderitaan menimpa mereka akibat perbuatan buruk mereka, seketika mereka akan menyerah dari rahmat Tuhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila Kami membuat manusia merasakan rahmat} nikmat berupa kesehatan dan kelapangan {mereka gembira karenanya} gembira dan bangga tanpa ada rasa syukur di dalamnya {Apabila mereka ditimpa suatu musibah} cobaan berupa sakit dan kesempitan {karena apa yang diperbuat tangan mereka, seketika itu mereka berputus asa} mereka putus asa dari rahmat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37 Allah mengabarkan tentang tabi’at kebanyakan manusia di dalam kondisi lapang dan sempit, yaitu bahwasannya apabila Allah membuat mereka merasakan suatu rahmat, berupa kesehatan, kekayaan, pertolongan dan lain-lainnya, mereka sangat bergembira dengan penuh kebanggaan dan kesombongan dengan niikmat Allah, bukan dengan penuh rasa syukur. “dan apabila mereka ditimpa suatu keburukan,” maksudnya, kondisi yang menyengsarakan mereka, dan itu, “disebabkan apa yang telah dikerjakan oleh tangan mereka sendiri,” dari berbagai maksiat, “tiba-tiba mereka itu berputus asa,” mereka berputus asa dari terangkatnya kefakiran, penyakit dan yang serupa dengannya. Ini adalah suatu kebodohan mereka dan tidak adanya pengetahuan. “dan apakah mereka tidak memperhatikan bahwa sesungguhnya Allah melapangkan rizki bagi siapa yang dikehendakiNya, dan Dia pula yang menyempitkan,” jadi putus asa setelah mengetahui bahwa kebaikan dan keburukan adalah dari Allah, rizki, kelapangan dan kesempitannya adalah berasal dari takdirNya itu menjadi sia-sia, tidak mempunyai tempat. Maka jangan hanya sekedar memperhatikan sebab kausalitas, wahai orang-orang yang berakal. Akan tetapi jadikanlah penglihatan (perhatian) mu kepada yang menciptakan sebabnya (yaitu Allah) maka drai itu Dia berfirman, ”sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang beriman,” merekalah orang-orang yang mengambil ibrah (pelajaran) dengan kelapangan Allah untuk memmberi kelapangan rizki) kepada siapa Dia dikendaki, dan menahannya; dan dengan itu mereka mengetahui hikmah (kebijaksanaan) Allah. Rahmat dan kemuraahanNya serta menarik hati untuk memohon hati untuk memohon kepadaNya dalam seluruh tuntunan rizki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 36: Maka ketika manusia betul-betul dalam kondisi penuh rahmah dan sehat, kaya dan penuh kecukupan; Mereka bergembira atas hal itu melampaui batas dan angkuh. Dan jika mereka ditimpa musibah keburukan karena sebab dosa-dosa mereka dan maksiat; Mereka berputus asa dari rahmah Allah dan dari hilangnya keburukan yang menimpa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tabiat kebanyakan manusia ketika menghadapi kesenangan dan kesulitan, yaitu bahwa mereka ketika diberi Allah rahmat, seperti kesehatan, kekayaan, pertolongan, dsb. Mereka bergembira ria dengan sikap sombong, bukan bergembira dengan rasa syukur terhadap nikmat Allah. Tetapi ketika mereka mendapatkan musibah disebabkan kemaksiatan yang mereka lakukan, tiba-tiba mereka berputus asa dari harapan hilangnya sakit itu atau kefakiran itu. Hal ini merupakan kebodohan mereka dan tidak mengetahui. Berbeda dengan orang mukmin, saat mendapatkan nikmat, ia bersyukur, dan saat mendapatkan musibah dia bersabar dan tidak berputus asa, bahkan tetap berharap kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 36",
    "description": "Dan di antara sifat buruk orang-orang musyrik itu adalah bahwa apabila kami berikan sesuatu rahmat kepada manusia, yakni kaum musy-rik, misalnya terbebas dari bencana atau musibah, niscaya mereka gembira dengan rahmat itu, bahkan dengan congkak mereka menganggapnya sebagai hasil usaha mereka sendiri. Akan tetapi, apabila suatu saat mereka ditimpa sesuatu musibah karena kesalahan atau kemaksiatan mereka sendiri, seketika itu mereka berputus asa dari rahmat Allah. 37. Allah memperingatkan mereka atas keputusasaan itu. Dan tidakkah mereka melihat dengan mata kepala beberapa fenomena yang terjadi, tidak terkecuali pada diri mereka sendiri, bahwa Allah yang melapangkan rezeki bagi siapa yang dia kehendaki, bukan semata hasil usaha mereka, dan dia pula yang membatasi rezeki bagi siapa yang dia kehendaki, meski ia telah berusaha keras untuk meraih rezeki sebanyak-banyaknya' sungguh, pada yang demikian itu, yakni lapang dan sempitnya rezeki, benar-benar terdapat tanda-tanda kebesaran Allah bagi kaum yang beriman yang meyakini keesaan dan kekuasaan-Nya yang sempurna sehingga mereka menyerahkan segala urusan kepada-Nya."
  }
]