[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka tidak mengetahui bahwa Allah melapangkan rizki bagi siapa yang Dia kehendaki sebagai ujian, apakah dia bersyukur atau kafir, dan Dia juga menyempitkan rizki atas siapa yang Dia kehendaki sebagai ujian, apakah dia bersabar atau meratap? Sesungguhnya dilapangkan dan disempitkannya harta merupakan tanda-tanda bagi kaum yang beriman kepada Allah dan mengetahui hikmah dan rahmat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan apakah mereka tidak melihat bahwa Allah melapangkan rezeki bagi yang dikehendaki-Nya dari hamba-hamba-Nya sebagai bentuk ujian baginya, apakah ia akan bersyukur atau kufur? Dan Dia menyempitkan rezeki bagi yang dikehendaki-Nya dari hamba-hamba-Nya sebagai bentuk cobaan baginya apakah ia akan bersabar atau murka? Sesungguhnya di dalam perluasan rezeki untuk sebagian dan penyempitan rezeki untuk sebagian yang lain terdapat petunjuk-petunjuk bagi orang-orang yang beriman atas kelemahlembutan Allah dan rahmat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. أَوَلَمْ يَرَوْا۟ أَنَّ اللهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ (Dan apakah mereka tidak memperhatikan bahwa Sesungguhnya Allah melapangkan rezeki bagi siapa yang dikehendaki-Nya) Yakni melapangkan rezeki bagi hamba-Nya yang Dia kehendaki. وَيَقْدِرُ ۚ( dan Dia (pula) yang menyempitkan (rezeki itu)) Yakni menyempitkan rezeki hamba-Nya yang Dia kehendaki. إِنَّ فِى ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يُؤْمِنُونَ (Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang beriman) Hal ini mereka jadikan sebagai dalil menuju kebenaran karena ini menunjukkan kesempurnaan kuasa Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Apakah mereka tidak mengetahui bahwa Allah membentangkan rejeki bagi hambaNya yang dikehendaki dan menyempitkannya bagi hamba yang dikehendaki sesuai kebijaksanaanNya sebagai ujian dan cobaan. Sesungguhnya dalam hal itu ada kecukupan dan keterbatasan untuk menunjukkan kekuasaan dan kebijaksanaan Allah kepada kaum yang beriman kepada Tuhannya. Dengan hal itu, mereka akan diberi petunjuk tentang kesempurnaan Kuasa Allah dan hikmahNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak memperhatikan bahwa sesungguhnya Allah melapangkan} melapangkan {rezeki bagi siapa saja yang Dia kehendaki dan menyempitkannya} menyempitkan atas siapa saja yang Dia kehendaki {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37 Allah mengabarkan tentang tabi’at kebanyakan manusia di dalam kondisi lapang dan sempit, yaitu bahwasannya apabila Allah membuat mereka merasakan suatu rahmat, berupa kesehatan, kekayaan, pertolongan dan lain-lainnya, mereka sangat bergembira dengan penuh kebanggaan dan kesombongan dengan niikmat Allah, bukan dengan penuh rasa syukur. “dan apabila mereka ditimpa suatu keburukan,” maksudnya, kondisi yang menyengsarakan mereka, dan itu, “disebabkan apa yang telah dikerjakan oleh tangan mereka sendiri,” dari berbagai maksiat, “tiba-tiba mereka itu berputus asa,” mereka berputus asa dari terangkatnya kefakiran, penyakit dan yang serupa dengannya. Ini adalah suatu kebodohan mereka dan tidak adanya pengetahuan. “dan apakah mereka tidak memperhatikan bahwa sesungguhnya Allah melapangkan rizki bagi siapa yang dikehendakiNya, dan Dia pula yang menyempitkan,” jadi putus asa setelah mengetahui bahwa kebaikan dan keburukan adalah dari Allah, rizki, kelapangan dan kesempitannya adalah berasal dari takdirNya itu menjadi sia-sia, tidak mempunyai tempat. Maka jangan hanya sekedar memperhatikan sebab kausalitas, wahai orang-orang yang berakal. Akan tetapi jadikanlah penglihatan (perhatian) mu kepada yang menciptakan sebabnya (yaitu Allah) maka drai itu Dia berfirman, ”sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang beriman,” merekalah orang-orang yang mengambil ibrah (pelajaran) dengan kelapangan Allah untuk memmberi kelapangan rizki) kepada siapa Dia dikendaki, dan menahannya; dan dengan itu mereka mengetahui hikmah (kebijaksanaan) Allah. Rahmat dan kemuraahanNya serta menarik hati untuk memohon hati untuk memohon kepadaNya dalam seluruh tuntunan rizki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 37: Allah berkata : Apakah mereka tidak mengetahui yaitu orang-orang musyrik, bahwasanya Allah Dialah yang meluaskan rezeki bagi siapa yang dikehendaki dengan ujian dan cobaan, dan menyempitkan bagi siapa yang dikehendaki dengan ujiaan dan cobaan ?! Ketahuilah wahai manusia bahwa semuanya itu adalah tanggung jawab Allah dan Allah membagi-bagi rezeki sebagai tanda (ibrah) bagi orang yang beriman yang menunjukkan akan kasih sayang Allah dan hikmah dari-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai ujian. Oleh karena itu, setelah mengetahui bahwa kebaikan dan keburukan ditetapkan oleh Allah, demikian pula rezeki, lapang dan sempitnya termasuk taqdir-Nya, maka berputus asa adalah hal sia-sia yang tidak ada kamusnya. Oleh karena itu, janganlah kamu wahai orang yang berakal melihat sebab saja, bahkan lihatlah siapa yang mengadakan sebab itu. Mereka dapat mengambil pelajaran dari pelapangan rezeki yang diberikan Allah dan penyempitan-Nya, dan dengan begitu mereka dapat pula mengetahui kebijaksanaan Allah, rahmat-Nya, dan kepemurahan-Nya, sehingga menarik hati mereka untuk selalu meminta kepada-Nya dalam semua kebutuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 37",
    "description": "Allah memperingatkan mereka atas keputusasaan itu. Dan tidakkah mereka melihat dengan mata kepala beberapa fenomena yang terjadi, tidak terkecuali pada diri mereka sendiri, bahwa Allah yang melapangkan rezeki bagi siapa yang dia kehendaki, bukan semata hasil usaha mereka, dan dia pula yang membatasi rezeki bagi siapa yang dia kehendaki, meski ia telah berusaha keras untuk meraih rezeki sebanyak-banyaknya' sungguh, pada yang demikian itu, yakni lapang dan sempitnya rezeki, benar-benar terdapat tanda-tanda kebesaran Allah bagi kaum yang beriman yang meyakini keesaan dan kekuasaan-Nya yang sempurna sehingga mereka menyerahkan segala urusan kepada-Nya. 38. Usai menjelaskan bahwa lapang-sempitnya rezeki merupakan ketentuan Allah dan sarana untuk menguji keimanan hamba-Nya, kemudian pada ayat ini Allah meminta orang mukmin tidak hanya berinfak dan bersedekah, melainkan juga melakukan kebaikan apa pun bentuknya kepada siapa saja, khususnya kaum kerabat. Maka berikanlah haknya kepada kerabat dekat dengan menjaga hubungan silaturahmi, berbuat kebajikan, dan berkorban untuknya, juga kepada orang miskin dengan meringankan beban hidupnya dan orang-orang yang kehabisan bekal dalam perjalanan. Itulah yang lebih baik bagi orang-orang yang mencari keridaan Allah melalui usaha-usaha baiknya. Dan mereka itulah orang-orang yang beruntung. Melalui pemberian dan pengorbanan, dalam lingkup terbatas, kerabat akan tercukupi kebutuhannya, dan dalam lingkup yang lebih luas, perbuatan itu akan melahirkan sikap tolong-menolong di antara sesama muslim."
  }
]