[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka berikanlah (wahai orang-orang Mukimin) kerabatmu haknya berupa silaturahim, sedekah dan kebaikan-kebaikan lainnya. Berikanlah kepada orang fakir yang tidak memiliki apa yang mencukupi dan menutupi hajatnya dan orang yang membutuhkan yang kehabisan bekal dalam perjalanannya dari zakat dan sedekah. Pemberian tersebut adalah lebih baik bagi orang-orang yang mengharapkan Wajah Allah dari amal perbuatannya. Dan orang-orang yang melakukan amal-amal kebaikan ini dan lainnya, mereka adalah orang-orang yang beruntung mendapatkan pahala dari Allah dan selamat dari hukumanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Maka berikanlah -wahai orang Islam- kepada kerabat yang terdekat hak-hak mereka berupa kebaikan dan silaturrahmi. Berikanlah kepada orang-orang yang membutuhkan apa yang bisa digunakan untuk menutup kebutuhan mereka. Berilah orang asing yang sedang kehabisan bekal dan tidak bisa kembali pulang ke negerinya. Pemberian di jalur-jalur tersebut adalah baik bagi orang-orang yang menginginkan wajah Allah. Orang-orang yang memberikan pertolongan dan hak-hak ini, mereka adalah orang-orang yang beruntung dengan mendapatkan Surga yang mereka inginkan dan terhindar dari siksa yang mereka takutkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Hai orang yang beriman, Berikanlah kepada kerabatmu haknya dalam hal silaturrahim dan kebaikan, dan kepada orang fakir dan musafir yang membutuhkan yang jauh dari negeri dan hartanya dengan zakat dan sedekah. Sungguh pemberian itu lebih baik bagi orang-orang yang mengharapkan keridhaan Allah dengan amalan mereka. Orang-orang yang memiliki derajat yang tinggi itu merupakan orang-orang yang mendapatkan kehidupan yang baik di dunia dan surga yang tinggi di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. فَـَٔاتِ ذَا الْقُرْبَىٰ حَقَّهُۥ (Maka berikanlah kepada kerabat yang terdekat akan haknya) Dengan berbuat baik kepada mereka dengan sedekah, silaturrahim, dan berbakti. وَالْمِسْكِينَ وَابْنَ السَّبِيلِ ۚ (demikian (pula) kepada fakir miskin dan orang-orang yang dalam perjalanan) Yakni dan berilah kepada orang miskin dan orang yang dalam perjalanan hak mereka berdua; hak orang miskin adalah bersedekah kepadanya dan menolongnya, sedangkan hak orang yang dalam perjalanan adalah menjamu dan membantunya. ذٰلِكَ خَيْرٌ لِّلَّذِينَ يُرِيدُونَ وَجْهَ اللهِ ۖ( Itulah yang lebih baik bagi orang-orang yang mencari keridhaan Allah) Yakni pemberian itu lebih baik daripada berbuat kikir bagi orang yang ingin mendekatkan diri kepada Allah. وَأُو۟لٰٓئِكَ هُمُ الْمُفْلِحُونَ (dan mereka itulah orang-orang beruntung) Yakni orang-orang yang akan meraih apa yang mereka inginkan, sebab mereka telah berinfak untuk meraih ridha Allah dengan mentaati perintah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Maka berilah kerabat(mu) haknya berupa silaturahmi dan perbuatan baik. Berilkanlah juga zakat dan sedekah untuk orang miskin yang membutuhkan dan musafir yang terpisah dari negerinya dan membutuhkan harta. Pemberian itu lebih baik daripada memberikan sesuatu kepada orang yang mengharapkan upah atas pekerjaannya. Dan itu dilakukan dengan niat ikhlas karena Tuhannya dan untuk mendekatkan diri kepadaNya. Mereka itu adalah orang-orang yang memenangkan surga dan ridha (Allah)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berilah} maka berilah {kerabat dekat haknya, juga orang miskin, dan orang yang dalam perjalanan} seorang musafir yang terpisah dari keluarganya yang membutuhkan {Itulah yang lebih baik bagi orang-orang yang mencari} mencari {keridhaan Allah. Mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. maksudnya, maka berilah orang yang dekat darimu –berdasarkan kekerabatan dan kebutuhannya- akan haknya yang diwajibkan oleh agama, atau dianjurkan oleh Allah kepadanya berupa nafkah wajib, sedekah, hadiah, kebaikan, salam, memuliakan, memaafkan kesalahannya, mengampuni kekeliruannya. Dan demikian pula, berilah orang miskin –yang dibuat hina oleh kefakiran dan kebutuhan –sesuatu yang dapat menutup kebutuhannya dan yang dapat memenuhi keperluannya, seperti memberinya makanan, minuman, dan pakaian, “dan orang-orang yang dalam perjalanan” yaitu orang asing yang terlantar yang ada diluar negerinya, yang diduga sangat membutuhkan bantuan, sedangkan ia tidak mempunyai harta (bekal) dan tidak mempunyai pekerjaan, yang dapat mengatur dirinya dengannya didalam perjalanannya. Beda dengan orang yang berada dikampung halamannya, sekalipun dia tidak mempunyai harta (uang) namun biasanya dia pasti bekerja atau menekuni kegiatan industri dan lain-lain yang dapat memenuhi kebutuhannya. Maka dari itu Allah menentukan bagian zakat untuk orang miskin dan orang musafir. “itu” maksudnya, memberi kerabat terdekat, orang miskin dan ibnu sabil, (musafir) “lebih baik bagi orang-orang yang mencari,” melalui amal itu “wajah Allah,” maksudnya, kebaikan yang berharga dan dapat pahala yang besar, sebab ia termasuk amal shalih yang utama dan manfaat yang menular yang sejalan keaadaannya dengan penetapan keikhlasan. Maka jika tidak berharap dengannya wajah Allah maka menjadi tidak baik bagi pemberi walaupun dirasakan baik dan bermanfaat oleh penerima, sebagaimana firman Allah: \"Tidak ada kebaikan pada kebanyakan bisikan bisikan mereka, kecuali bisikan-bisikan dari orang yang menyuruh (manusia) memberi sedekah, atau berbuat makruf, atau mengadakan perdamaian di antara manusia. Dan barang siapa yang berbuat demikian karena mencari keridaan Allah, maka kelak Kami memberi kepadanya pahala yang besar\". (an-nisa:114) Pengertiannya adalah bahwa hal-hal yang dikecualikan ini baik karena manfaatnya yang bersifat menular. Akan tetapi siapa yang menemukan keridoan Allah niscaya kami memberinya pahala ynag sangat panas. Dan firmannya “dan mereka akan melakukan amal-amal kebajikan ini dan yang lainnya untuk kerena Wajah Allah “adalah orang-orang yang beruntung\" yang meraih pahala dari Allah. Dan selamat dari siksaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 38: Allah memerintahkan manusia agar memberikan kepada keluarga terdekatnya nafkah, sedekah, hadiah, hubungan yang baik dan segala kebaikan. Begitu juga memberikan kepada orang-orang miskin yang membutuhkan berupa hak mereka dari sedekah. Begitu juga musafir yang singgah berupa hak mereka dari sedekah. Kemudian Allah menjelaskan bahwa pemberian dan sedekah ini adalah kebaikan yang banyak dan balasan yang besar bagi mereka yang mengharap amalan-amalan mereka ikhlas mengharap wajah Allah dan mengharap akhirat, dan merekalah orang-orang yang menang dengan kemengan yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti diberikan kebaikan (nafkah, sedekah, hadiah, penghormatan, dan pemaafan terhadap ketergelincirannya) dan disambung silaturrahminya. Agar kebutuhan pokoknya dapat terpenuhi, seperti diberikan makan, minum dan pakaian. Yakni musafir yang kehabisan bekal. Karena manfaatnya untuk orang lain, terlebih ketika disertai dengan niat ikhlas mencari keridhaan Allah, maka Allah memberikan kepadanya pahala yang besar. Yakni yang mengerjakan amal itu dan amal lainnya karena mencari keridhaan Allah. Karena akan memperoleh pahala Allah dan akan selamat dari siksa-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 38",
    "description": "Usai menjelaskan bahwa lapang-sempitnya rezeki merupakan ketentuan Allah dan sarana untuk menguji keimanan hamba-Nya, kemudian pada ayat ini Allah meminta orang mukmin tidak hanya berinfak dan bersedekah, melainkan juga melakukan kebaikan apa pun bentuknya kepada siapa saja, khususnya kaum kerabat. Maka berikanlah haknya kepada kerabat dekat dengan menjaga hubungan silaturahmi, berbuat kebajikan, dan berkorban untuknya, juga kepada orang miskin dengan meringankan beban hidupnya dan orang-orang yang kehabisan bekal dalam perjalanan. Itulah yang lebih baik bagi orang-orang yang mencari keridaan Allah melalui usaha-usaha baiknya. Dan mereka itulah orang-orang yang beruntung. Melalui pemberian dan pengorbanan, dalam lingkup terbatas, kerabat akan tercukupi kebutuhannya, dan dalam lingkup yang lebih luas, perbuatan itu akan melahirkan sikap tolong-menolong di antara sesama muslim. 39. Setelah menginformasikan cara membantu orang lain dengan benar melalui zakat, infak, dan sedekah yang dilandasi keikhlasan, melalui ayat ini Allah memperingatkan para pemakan riba dan orang yang menyembunyikan tujuan buruk di balik bantuannya. Dan sesuatu riba yang kamu berikan kepada orang yang terbiasa memakan riba agar harta manusia yang diberi itu semakin bertambah, maka sesungguhnya harta tersebut tidak bertambah dalam pandangan Allah dan tidak pula diberkahi. Dan apa yang kamu berikan kepada orang lain berupa zakat, infak, dan sedekah yang kamu maksudkan untuk memperoleh keridaan Allah, maka itulah orang-orang yang melipatgandakan pahalanya dengan cara yang benar dan bermartabat."
  }
]