[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Harta yang kalian berikan sebagai hutang dengan tujuan mendapatkan riba dan mencari tambahan dari hutang tersebut, agar ia tumbuh dan menjadi banyak pada harta-hara manusia, sebenarnya di sisi Allah ia tidak bertambah, karena Allah justru menghancurkannya dan membatalkannya. Sementara apa yang kalian berikan dalam bentuk zakat dan sedekah kepada orang-orang yang berhak menerimanya demi mencari keridhaan dari Allah dan pahala dariNya, maka inilah yang diterima dan dilipatgandakan oleh Allah dengan pelipatgandaan yang banyak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan harta apa saja yang kalian berikan kepada salah satu dari manusia dengan maksud agar dia mengembalikan kepada kalian dengan tambahan, maka pahalanya tidak berkembang di sisi Allah. Dan harta apa saja yang kalian berikan kepada orang yang membutuhkan yang kalian gunakan untuk mengharap wajah Allah, bukan karena menginginkan kedudukan atau balasan dari manusia, maka mereka inilah yang pahalanya akan digandakan di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Barangsiapa yang memberi pemberian atau hadiah dengan harapan orang yang diberi akan membalasnya dengan yang lebih banyak daripada yang telah dia berikan, maka tidak ada pahala baginya di sisi Allah. Sedangkan zakat dan sedekah yang kalian berikan kepada orang yang berhak menerimanya demi mengharap pahala dari Allah, maka mereka yang memiliki derajat yang tinggi itu adalah orang-orang yang dilipat-gandakan pahalanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَمَآ ءَاتَيْتُم مِّن رِّبًا (Dan sesuatu riba (tambahan) yang kamu berikan) Yakni mengharap tambahan harta tanpa pertukaran. لِّيَرْبُوَا۟ فِىٓ أَمْوٰلِ النَّاسِ(agar dia bertambah pada harta manusia) Yakni agar hartanya bertambah. فَلَا يَرْبُوا۟ عِندَ اللهِ ۖ( maka riba itu tidak menambah pada sisi Allah) Yakni Allah tidak akan memberkahi harta tersebut. Pendapat lain mengatakan tafsir ayat ini tidak demikian, namun mayoritas ahli tafsir mengatakan bahwa makna riba pada ayat ini adalah hadiah yang diberikan oleh sebagian orang bagi orang lain dengan harapan ia mendapat balasan darinya; hal seperti ini tidak akan bertambah di sisi Allah, ia tidak mendapat pahala dan tidak pula mendapat dosa dari hadiah itu. Yakni seseorang memberi orang lain sesuatu agar diganti dengan sesuatu yang lebih banyak, dan membantu orang lain agar mendapat manfaat di dunia, maka manfaat dari bantuan itu tidak bertambah di sisi Allah. Dan hal ini diharamkan atas Nabi saja, sebagaimana firman Allah: ولا تمنن تستكثر “dan janganlah kamu memberi (dengan maksud) memperoleh (balasan) yang lebih banyak.” (Al-Muddassir:6) Ikrimah berkata: riba ada dua macam; riba halal dan riba haram. Riba halal adalah dengan memberi hadiah dengan harapan mendapat balasan yang lebih baik. Sebagaimana yang dimaksud dalam ayat ini. وَمَآ ءَاتَيْتُم مِّن زَكَوٰةٍ تُرِيدُونَ وَجْهَ اللهِ(Dan apa yang kamu berikan berupa zakat yang kamu maksudkan untuk mencapai keridhaan Allah) Yakni sedekah yang kalian berikan yang tidak kalian harapkan balasannya melainkan mengharapkan apa yang ada di sisi Allah. فَأُو۟لٰٓئِكَ هُمُ الْمُضْعِفُونَ(maka (yang berbuat demikian) itulah orang-orang yang melipat gandakan (pahalanya)) Yakni mereka diberi pada setiap kebaikannya sepuluh kali lipat sampai tujuh ratus kali lipat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Dan pinjaman harta yang kamu berikan dengan maksud riba dan mencari tambahan dari ganti orang yang dipinjami supaya bertambah dan berkembang sesuai perhitungan harta manusia, maka itu tidak akan bertambah di sisi Allah, melainkan akan dihapus olehNya. Sedangkan zakat yang kalian berikan kepada orang-orang yang layak menerimanya karena untuk mencari ridha Allah. Maka mereka itu adalah orang-orang yang dilipatgandakan pahalanya sesuai keinginan mereka. Mereka adalah memiliki pahala yang berlipat-lipat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang kalian berikan} apa yang kalian berikan {berupa riba} pinjaman dengan maksud riba dan mendapat tambahan {agar berkembang} agar bertambah dan berkembang {pada harta orang lain, maka tidaklah berkembang} maka tidaklah bertambah dan berkembang {di sisi Allah. Adapun zakat yang kalian berikan dengan maksud memperoleh keridhaan Allah, maka merekalah orang-orang yang melipatgandakan} orang-orang yang dilipatgandakan oleh Allah pahalanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. setelah Allah menyebutkan amal yang diniatkan untuk mencari wajahNya, berupa pembelanjaan harta, maka disini Dia menyebutkan amal yang diniatkan untuk tujuan duniawi, seraya berfirman, ”dan suatu riba (tambahan) yang kamu berikan agar dia menambah pada harta manusia,” maksudnya, apapun yang kalian berikan berupa harta lebihan dari kebutuhan kalian sedangkan niat kalian adalah supaya ia bertambah. Maksudnya, agar menambah banyak harta kalian, seperti memberikannya kepada orang yang kalian beri makan dengan maksud agar dia memberikan ganti kepada kalian dengan yang lebih banyak darinya. Karena ketiadan syaratnya yaitu ikhlas. Contohnya adalah, amal yang dimaksudkan agar tambah di hormati dan riya dalam pandangan manusia. Itu semua tidak akan berkembang di sisi Allah. “dan apa yang kamu berikan berupa zakat,” maksudnya, harta yang membersihkan kalian dari akhlak yang tercela dan menyucikan harta kalian dari sifat bakhil dengannya, dan bertambah dalam menutupi kebutuhan orang yang menerima, “yang kamu maksudkan,” dengan zakat tersebut, ”untuk mencari wajah Allah, maka merekalah orang-orang yang melipatgandakan.” Maksudnya, orang-orang yang pahala mereka dilipatgandakan, yaitu orang-orang yang pembelanjaan mereka bertambah di sisi Allah, dan ditambah oleh Allah untuk mereka sehingga menjadi sangat banyak. firmanNya, “dan apa yang kamu berikan berupa zakat,” menunjukan bahwa sedekah yang disertai dengan keterpaksaan dari orang yang masih tergantung kepada harta yang dipaksakan dari orang yang masih tergantung kepada harta yang dibelanjakan, atau tergantung kepada harta , atau tergantung dengan utang yang belum ia lunasi dan lebih mengutamakan sedekah atasnya, bahwa yang demikian ini bukan zakat yang karenanya seseorang diberi pahala, dan perbuatannya ini ditolak secara syari, sebagaimana Allah berfirman, ”yang menafkahkan hartanya (dijalan Allah) untuk membersihkannya,” (al-lail:18) jadi, tidak semua memberikan harta itu kebaikan, sehingga pemberian itu dilakukan dengan tujuan di atas, yaitu dengan maksud agar si pemberi menjadi bersih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 39: Ketahuilah bahwasanya Allah memberikan kepada kalian dari harta yang bertambah terdapat kewajiban yang jika kalian keluarkan akan kembali kepada diri kalian sendiri dengan yang lebih besar, Allah akan tambah harta kalian seiring dengan pemberian kalian kepada manusia; Inilah harta yang jika tidak dikeluarkan akan sepi dari balasan dan tidak Allah berikan keberkahan; Bahkan ini adalah harta yang membinasakan dan hilang keberkahannya, adapun apa yang telah kalian keluarkan dari zakat, sedekah akan bertambah seiring dengan niat karena Allah, maka pemilik keutamaan ini adalah mereka yang terpuji di mana Allah terima amalan mereka dan dilipat gandakan bagi mereka ganjaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menyebutkan amal yang maksudnya mencari keridhaan Allah, seperti infak, maka Allah Subhaanahu wa Ta'aala menyebutkan amal yang maksudnya adalah untuk memperoleh keuntungan duniawi. Yakni ketika kamu memberikan harta dengan maksud agar orang yang kamu beri harta itu menggantikan dengan yang lebih banyak dari yang kamu berikan, maka balasannya tidaklah berkembang di sisi Allah, karena hilangnya syarat untuk diterima, yaitu ikhlas. Amal yang maksudnya memperoleh keuntungan duniawi, seperti agar kedudukannya tinggi, atau karena riya’ kepada manusia, maka semua itu tidaklah bertambah di hadapan Allah. Atau sedekah. Pahala mereka dilipatgandakan, infak mereka bertambah di sisi Allah, dan Allah akan mengembangkannya untuk mereka sehingga menjadi jumlah yang sangat banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 39",
    "description": "Setelah menginformasikan cara membantu orang lain dengan benar melalui zakat, infak, dan sedekah yang dilandasi keikhlasan, melalui ayat ini Allah memperingatkan para pemakan riba dan orang yang menyembunyikan tujuan buruk di balik bantuannya. Dan sesuatu riba yang kamu berikan kepada orang yang terbiasa memakan riba agar harta manusia yang diberi itu semakin bertambah, maka sesungguhnya harta tersebut tidak bertambah dalam pandangan Allah dan tidak pula diberkahi. Dan apa yang kamu berikan kepada orang lain berupa zakat, infak, dan sedekah yang kamu maksudkan untuk memperoleh keridaan Allah, maka itulah orang-orang yang melipatgandakan pahalanya dengan cara yang benar dan bermartabat. 40. Jika pemberian yang baik harus dilandasi keikhlasan, sudah seha-rusnya setiap muslim mengembalikan balasan pemberian itu kepada Allah, karena dia-lah yang menciptakan kamu dari tiada, kemudian memberimu rezeki sesuai ketentuan dan kebijaksanaan-Nya, bukan semata berkat usahamu, lalu mematikanmu setelah sampai ajalmu, kemudian menghidupkanmu kembali setelah kematianmu. Adakah di antara mereka, yakni berhala-berhala atau apa pun yang kamu sekutukan dengan Allah itu yang dapat berbuat sesuatu yang demikian itu, yaitu memberi rezeki, menghidupkan, dan mematikan' mahasuci dia dan mahatinggi dari apa yang mereka persekutukan."
  }
]