[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya Allah semata yang menciptakan kalian (wahai manusia) kemudian memberi rizki kepada kalian dalam kehidupan ini, kemudian mematikan kalian saat ajal kalian telah habis, kemudian membangkitkan kalian dari kubur dalam keadaan hidup untuk menghadapi perhitungan amal dan pembalasan. Adakah diantara sekutu-sekutu kalian yang melakukan sedikit saja dari semua itu? Mahasuci dan Mahabersih Allah dari kesyirikan yang mereka perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Hanya Allah semata yang telah menciptakan kalian kemudian memberi rezeki kepada kalian, lalu mematikan kalian dan menghidupkan kalian untuk dibangkitkan. Maka adakah dari berhala-berhala yang kalian sembah selain Allah yang melakukan sebagian dari hal itu? Allah Yang Mahasuci terhindar dan bersih dari apa yang diyakini oleh orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Allah menyampaikan bahwa hanya Dia semata yang menciptakan makhluk, memberi rezeki, mematikan, dan membangkitkan dari kubur; tidak ada satupun dari yang orang-orang musyrik anggap sebagai sekutu Allah itu yang ikut melakukan hal-hal tersebut. Maka mengapa mereka menyekutukan Dzat Yang Esa dalam melakukan hal-hal yang besar itu dengan makhluk yang tidak dapat melakukan apapun? Maha Suci Allah dari kesyirikan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. هَلْ مِن شُرَكَآئِكُم مَّن يَفْعَلُ مِن ذٰلِكُم مِّن شَىْءٍ ۚ (Adakah di antara yang kamu sekutukan dengan Allah itu yang dapat berbuat sesuatu dari yang demikian itu?) Dan telah diketahui bahwa mereka mengatakan kalau sekutu-sekutu itu tidak mampu melakukan hal itu. Sehingga ini menjadi hujjah atas mereka. سُبْحٰنَهُۥ وَتَعٰلَىٰ عَمَّا يُشْرِكُونَ(Maha Sucilah Dia dan Maha Tinggi dari apa yang mereka persekutukan) Yakni sucikanlah Dia dari kesyirikan yang dilakukan oleh orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Wahai orang-orang mukmin dan orang-orang musyrik, Allah adalah Dzat yang menciptakan kalian, kemudian memberi kalian rejeki dari lahir sampai wafat, lalu mematikan kalian di akhir umur kalian, kemudian membangkitkan kalian di akhirat dalam keadaan hidup untuk dihisab dan dibalas. Adakah (Hal disini adalah huruf istifham yang dimaksudkan untuk mengolok-olok) di antara sekutu-sekutu kalian itu yang bisa melakukan hal ini. Maha Suci dan Maha Agung Allah dari kesyirikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allahlah Dzat yang menciptakan kalian, menganugerahkan rezeki kepada kalian, lalu mematikan kalian, kemudian menghidupkan kalian. Apakah di antara di antara sekutu-sekutu kalian} berhala-berhala kalian {ada yang dapat berbuat sesuatu yang demikian itu. Maha suci dan Maha tinggi Dia dari apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah mengabarkan bahwasannya hanya Dia semata yang menciptakan kalian, memberi rizki kalian, mematikan kalian dan menghidupkan kembali kalian; dan bahwa sesungguhnya tidak seorang pun dari para sekutu yang disembah oleh kaum musyrikn itu yang bersekutu dengan Allah dalam melakukan satu pun dari hal-hal tersebut. Maka bagaimana mereka mempersekutukan orang (berhala) yang sama sekali tidak bisa melakukn apa-apa dengan tuhan yang hanya Dia sendiri yang bisa melakukan hal-hal itu? Maka Mahasuci Allah lagi Mahatinggi dari kesyirikan mereka. Semua itu tidak akan membahayakanNya, dan sesungguhnya akibat buruknya hanya akan menimpa diri mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 40: Ketahuilah wahai manusia bahwasanya Allah sajalah Dia yang menciptakan kalian dan mengadakan kalian dari ketiadaan, Dia sajalah yang memberikan rezeki kepada kalian, Dia sajalah yang mematikan kalian sampai ajal menjemput kalian, Dia sajalah yang membangkitkan kalian dengan balasan dan perhitungan pada kali yang lain, apakah ada di antara kalian sekutu selain Allah yang kalian ibadahi yaitu yang mereka mampu melakukan hal ini ?! Maha Suci Allah dari penyekutuan mereka orang-orang musyrik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia sendiri yang menciptakan, memberi rezeki, mematikan dan menghidupkan, dan tidak ada satu pun sesembahan kaum musyrik (seperti patung dan berhala) yang ikut serta dalam hal itu. Oleh karena itu, mengapa mereka menyekutukan sesuatu yang tidak berkuasa apa-apa dengan Allah yang mengurus semua itu (mencipta, memberi rezeki, menghidupkan dan mematikan) sendiri. Maka Mahasuci Allah dan Mahatinggi Dia dari syrik mereka, dan hal itu tidaklah merugikan-Nya, Karena akibat perbuatan mereka itu kembalinya kepada mereka. Jelas tidak ada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 40",
    "description": "Jika pemberian yang baik harus dilandasi keikhlasan, sudah seha-rusnya setiap muslim mengembalikan balasan pemberian itu kepada Allah, karena dia-lah yang menciptakan kamu dari tiada, kemudian memberimu rezeki sesuai ketentuan dan kebijaksanaan-Nya, bukan semata berkat usahamu, lalu mematikanmu setelah sampai ajalmu, kemudian menghidupkanmu kembali setelah kematianmu. Adakah di antara mereka, yakni berhala-berhala atau apa pun yang kamu sekutukan dengan Allah itu yang dapat berbuat sesuatu yang demikian itu, yaitu memberi rezeki, menghidupkan, dan mematikan' mahasuci dia dan mahatinggi dari apa yang mereka persekutukan. 41. Bila pada ayat-ayat sebelumnya Allah menjelaskan sifat buruk orang musyrik mekah yang menuhankan hawa nafsu, melalui ayat ini Allah menegaskan bahwa kerusakan di bumi adalah akibat mempertuhankan hawa nafsu. Telah tampak kerusakan di darat dan di laut, baik kota maupun desa, disebabkan karena perbuatan tangan manusia yang dikendalikan oleh hawa nafsu dan jauh dari tuntunan fitrah. Allah menghendaki agar mereka merasakan sebagian dari akibat perbuatan buruk mereka agar mereka kembali ke jalan yang benar dengan menjaga kesesuaian perilakunya dengan fitrahnya."
  }
]