[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Telah terlihat kerusakan di daratan dan di lautan seperti kekeringan, minimnya hujan, banyaknya penyakit dan wabah, yang semua itu disebabkan kemaksiatan-kemaksiaan yang dilakukan oleh manusia, agar mereka mendapatkan hukuman dari sebagian perbuatan mereka di dunia, supaya mereka bertaubat kepada Allah dan kembali kepadaNya dengan meninggalkan kemaksiatan, selanjutnya keadaan mereka akan membaik dan urusan mereka menjadi lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Telah nampak kerusakan di daratan maupun di lautan dalam kehidupan manusia dengan berkurangnya penghasilan dan di dalam diri mereka dengan timbulnya berbagai penyakit dan wabah, disebabkan karena kemaksiatan yang mereka lakukan. Hal itu timbul agar Allah merasakan kepada mereka balasan dari perbuatan buruk mereka di kehidupan dunia dengan harapan agar mereka kembali kepada-Nya dengan bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Kemaksiatan dan kesesatan telah muncul di daratan dan di lautan, maka turunlah berbagai macam siksaan seperti kekeringan, banjir, dan lain sebagainya akibat dosa-dosa yang telah dilakukan manusia; agar mereka terkena akibat dari sebagian dari perbuatan mereka agar mereka bertaubat kepada Allah. Hal ini terjadi sebelum Nabi Muhammad diutus, namun setelah beliau diutus, manusia berbondong-bondong masuk ke dalam agama Allah sehingga merek selamat dari siksaan dan mendapat kebaikan yang banyak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. ظَهَرَ الْفَسَادُ فِى الْبَرِّ وَالْبَحْرِ (Telah nampak kerusakan di darat dan di laut) Yakni dimaksud dengan (البحر) adalah perkotaan dan pedesaan yang berada di atas laut atau sungai. Sedangkan (البر) adalah perkotaan dan pedesaan yang tidak berada di atas laut atau sungai. بِمَا كَسَبَتْ أَيْدِى النَّاسِ(disebabkan karena perbuatan tangan manusia) Allah menjelaskan bahwa kemusyrikan dan kemaksiatan adalah sebab timbulnya kerusakan di alam semesta. Kerusakan ini dapat berupa kekeringan, paceklik, ketakutan yang merajalela, barang-barang yang tidak laku, sulitnya mencari penghidupan, maraknya perampokan dan kezaliman, dan lain sebagainya. لِيُذِيقَهُم بَعْضَ الَّذِى عَمِلُوا۟( supaya Allah merasakan kepada mereka sebahagian dari (akibat) perbuatan mereka) Yakni agar mereka merasakan akibat dari sebagian perbuatan mereka. لَعَلَّهُمْ يَرْجِعُونَ(agar mereka kembali (ke jalan yang benar)) Yakni menjauhi kemaksiatan mereka dan bertaubat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Telah tampak kerusakan di berbagai hal seperti kegersangan, kekeringan, kebakaran, banjir, penyakit, kegelisahan dan ditawan oleh musuh akibat kemaksiatan dan dosa manusia. Supaya Allah membuat mereka merasakan balasan dari sebagian perbuatan mereka di dunia sebelum dihukum di akhirat dan supaya mereka bisa kembali dari kemaksiatan mereka dan bertaubat atas dosa-dosa (mereka)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Telah tampak kerusakan} banyak kemudharatan dan keadaan buruk {di darat dan di laut karena perbuatan tangan manusia. Dia akan membuat mereka merasakan sebagian dari perbuatan mereka agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. maksudnya, menjadi jelas “kerusakan di darat dan laut,” yaitu, rusaknya kehidupan mereka, berkurang dan terjadinya berbagai wabah penyakit padanya, dan juga pada diri mereka, berupa penyakit, wabah dan lain-lain. Itu semua disebabkan apa yang telah dilakukan oleh tangan mereka berupa pekerjaan-pekerjaan yang rusak dan merusak. Yang disebutkan ini “supaya Allah merasakan kepada mereka sebagian dari akibat perbuatan mereka,” maksudnya, agar mereka tahu bahwasannya Allah memberikan balasan atas amal perbuatan. Jadi, Allah menyegerakan contoh (terlebih dahulu) dari balasan amal perbuatan mereka di dunia, “agar mereka kembali,” dari perbuatan mereka yang telah menimbulkan kerusakan bagi mereka sendiri, sehingga keadaan mereka menjadi baik, urusan mereka menjadi bersinar. Maka Mahasuci tuhan yang telah memberikan nikmat dan cobaanNya dan memberikan karunia dengan hukumNya. Sebab, jika tidak maka kalau dia merasakan kepada mereka seluruh balasan (amal) yang mereka lakukan, tentu DIa akan menyisakan satu binatang melata (pun) manusia di muka bumi"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 41: Ketahuilah wahai manusia bahwasanya menyebarnya keburukan dari segala keburukan serta diangkatnya keberkahan dan berkurangnya keturunan, peperangan dan selainnya; Semuanya karena sebab apa yang telah kalian lakukan dari dosa dan maksiat, serta meninggalkan perintah Allah dan mengerjakan larangan-larangan-Nya; Semua itu adalah sebagai hukuman bagi kalian atas amalan-amalan kalian yang buruk. Kemudian Allah menyebutkan hikmah akan hal itu yaitu ke Maha Lembutan Allah bagi hamba-Nya dan kasih sayang-Nya bagi mereka agar mereka bertaubat kepada Allah dan memohon ampunan, mengikhlaskan ibadah kepada-Nya, dan agar muamalah mereka mengikuti tuntunan syariat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni telah tampak kerusakan di darat dan lautan, seperti rusaknya penghidupan mereka, turunnya musibah, dan turunnya penyakit yang menimpa diri mereka, dan lain-lain disebabkan perbuatan buruk (maksiat) yang mereka lakukan. Yakni agar mereka mengetahui bahwa Allah memberikan balasan terhadap amal, Dia menyegerakan sebagiannya sebagai contoh pembalan terhadap amal. Maka Mahasuci Allah yang mengaruniakan nikmat dengan musibah dan memberikan sebagian hukuman agar manusia kembali sadar, sekiranya Allah menimpakan hukuman kepada mereka terhadap semua perbuatan buruk mereka, niscaya tidak ada satu pun makhluk yang tinggal di bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 41",
    "description": "Bila pada ayat-ayat sebelumnya Allah menjelaskan sifat buruk orang musyrik mekah yang menuhankan hawa nafsu, melalui ayat ini Allah menegaskan bahwa kerusakan di bumi adalah akibat mempertuhankan hawa nafsu. Telah tampak kerusakan di darat dan di laut, baik kota maupun desa, disebabkan karena perbuatan tangan manusia yang dikendalikan oleh hawa nafsu dan jauh dari tuntunan fitrah. Allah menghendaki agar mereka merasakan sebagian dari akibat perbuatan buruk mereka agar mereka kembali ke jalan yang benar dengan menjaga kesesuaian perilakunya dengan fitrahnya. 42. Perbuatan buruk manusia akan mendatangkan azab sebagaimana azab yang telah menimpa umat-umat terdahulu. Azab itu juga akan datang kepada umat-umat di masa sekarang maupun yang akan datang sebagai sunatullah jika mereka memiliki karakter yang sama. Karena itu, katakanlah, wahai nabi Muhammad, kepada siapa saja yang meragukan hakikat ini, 'bepergianlah di muka bumi, di mana saja yang bisa kamu jangkau, lalu lihatlah bagaimana kesudahan orang-orang dahulu yang dihancurkan akibat perilaku buruk mereka. Itu semua karena kebanyakan dari mereka adalah orang-orang yang mempersekutukan Allah dan menuhankan hawa nafsu. '."
  }
]