[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang yang mendustakan apa yang kamu bawa, “Berjalanlah di penjuru bumi untuk merenungkan dan mengambil pelajaran, lalu lihatlah bagaimana kesudahan umat-umat terdahulu yang mendustakan seperti kaum Nuh, Ad dan Tsamud. Kalian akan melihat akibat mereka adalah akibat terburuk dan angan-angan mereka adalah angan-angan yang terjelek. Kebanyakan dari mereka adalah orang-orang yang mempersekutukan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Katakan -wahai Rasul- kepada orang-orang musyrik, \"Berjalanlah kalian di muka bumi dan perhatikanlah bagaimana kesudahan umat-umat yang mendustakan sebelum kalian?\" Kesudahan mereka adalah kesudahan yang buruk. Kebanyakan dari mereka menyekutukan Allah dengan menyembah selain Allah bergandeng dengan menyembah Allah. Maka mereka dibinasakan karena kesyirikan mereka tehadap Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Hai Rasulullah, katakanlah kepada orang-orang yang mendustakan risalahmu: “Berjalanlah di berbagai negeri dan lihatlah bagaimana kesudahan umat-umat terdahulu yang telah Kami binasakan karena mereka menyekutukan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. قُلْ سِيرُوا۟ فِى الْأَرْضِ فَانظُرُوا۟ كَيْفَ كَانَ عٰقِبَةُ الَّذِينَ مِن قَبْلُ ۚ (Katakanlah: “Adakanlah perjalanan di muka bumi dan perhatikanlah bagaimana kesudahan orang-orang yang terdahulu) Allah memerintahkan mereka untuk berjalan di muka bumi agar mereka melihat sisa-sisa peninggalan umat terdahulu dan menyaksikan bagaimana kesudahan hidup mereka, rumah-rumah mereka menjadi hancur, tanah mereka terbengkalai, seperti yang terjadi pada kaum ‘Aad, Tsamud, dan kaum kafir lainnya. كَانَ أَكْثَرُهُم مُّشْرِكِينَ(Kebanyakan dari mereka itu adalah orang-orang yang mempersekutukan (Allah)”) Ini merupakan penjelasan tentang sebab mengapa kesudahan mereka sedemikian rupa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Wahai rasulallah, katakanlah kepada orang-orang yang mendustakan risalahmu, “Berjalanlah ke penjuru bumi dan renungkanlah tentang apa yang terjadi di sana, supaya kalian bisa memastikan kebenaran janji Kami dan lihatlah takdir umat-umat terdahulu yang Kami hancurkan, karena kebanyakan mereka menyekutukan Allah dengan tuhan lain”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Berjalanlah di bumi, lalu lihatlah bagaimana kesudahan orang-orang sebelumnya. Kebanyakan mereka adalah orang-orang musyrik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. perintah berjalan di bumi itu mencakup juga (perintah) berjalan dengan fisik dan berjalan dam hati untk memperhatikan dan merenungkan kesudahan-kesudahan orang-orang terdahulu (bahwa) “kebanyakan dari mereka itu adalah orang-orang musyrik,” kalian menjumpai kesudahan mereka adalah seburuk-buruk kesudahan, akhir hidup mereka adalah seburuk-buruk akhir kehidupan, yaitu azab (yang telah membinasakan mereka semua), celaan, kutukan dari makhluk Allah yang mengikuti mereka, dan kehinaan yang berlanjut. Maka waspadalah untuk tidak melakukan seperti perbuatan mereka, agar kalian tidak diperlakukan sama dengan mereka. Karena sesungguhnya keadilan Allah dan kebijaksanaanNya selalu ada pada setiap waktu dan setiap tempat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 42: Katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik yang mendustakan : Berjalanlah di muka bumi dengan jasad-jasad kalian dan hati-hati kalian, berjalanlah dengan memandang dan teliti serta bertafakkur akan akhir kehidupan dan kebinasaan umat-umat sebelum kalian yang mereka mendustakan para Rasul mereka, dan sungguh mereka adalah umat-umat yang lebih berkembang dibandingkan kaum musyrikin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan badan dan hatimu untuk memperhatikan akibat yang menimpa orang-orang terdahulu, engkau akan mendapati mereka memperoleh kesudahan yang paling buruk dan tempat kembali mereka adalah tempat yang paling buruk. Mereka dibinasakan oleh azab yang menghabiskan mereka, mendapatkan celaan, dan laknat dari makhluk Allah, serta memperoleh kehinaan yang terus-menerus. Oleh karena itu, berhati-hatilah jangan sampai melakukan perbuatan yang sama dengan mereka, sehingga kamu ditimpa azab seperti mereka, karena keadilan Allah dan hikmah-Nya berlaku di setiap zaman dan setiap tempat. Mereka dibinasakan karena perbuatan syirknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 42",
    "description": "Perbuatan buruk manusia akan mendatangkan azab sebagaimana azab yang telah menimpa umat-umat terdahulu. Azab itu juga akan datang kepada umat-umat di masa sekarang maupun yang akan datang sebagai sunatullah jika mereka memiliki karakter yang sama. Karena itu, katakanlah, wahai nabi Muhammad, kepada siapa saja yang meragukan hakikat ini, 'bepergianlah di muka bumi, di mana saja yang bisa kamu jangkau, lalu lihatlah bagaimana kesudahan orang-orang dahulu yang dihancurkan akibat perilaku buruk mereka. Itu semua karena kebanyakan dari mereka adalah orang-orang yang mempersekutukan Allah dan menuhankan hawa nafsu. '43. Setiap perbuatan buruk pasti berdampak negatif. Oleh karena itu, wahai nabi Muhammad dan siapa saja yang ingin terhindar dari azab Allah, hadapkanlah wajahmu kepada agama yang lurus, yakni islam, sebelum datang dari Allah suatu hari yang tidak dapat ditolak, baik itu berupa kematian maupun hari kiamat. Maka pada hari itu mereka terpisah-pisah, sebagian mereka berada di surga dan sebagian lagi di neraka."
  }
]