[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "barangsiapa kafir, maka dia memikul hukuman atas kekafirannya, yaitu dia dikekalkan di dalam api neraka. Tetapi barangsiapa beriman dan beramal shalih, maka itu adalah untuk diri mereka sendiri, Allah menyiapkan tempat-tempat tinggal di surga untuk mereka, disebabkan keteguhan mereka dalam menjalankan ketaatan kepada tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Barangsiapa kafir kepada Allah, maka bahaya kekafirannya -yaitu kekal di Neraka- kembali kepada dirinya sendiri, dan barangsiapa mengerjakan amal saleh demi mengharapkan wajah Allah, maka manfaatnya kembali kepada diri mereka sendiri, mereka mempersiapkan diri untuk masuk ke Surga dan mendapat kenikmatan yang ada di dalamnya, kekal di dalamnya selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44-45. Barangsiapa yang mendustakan Allah dan para rasul-Nya maka dia sendiri yang akan menanggung dosa kekafirannya. Dan barangsiapa yang melakukan kebaikan dan mentaati Allah, maka pahala perbuatan itu bagi dirinya sendiri, karena dialah yang menyiapkan kedudukannya sendiri di surga. Hal ini agar Allah membalas orang-orang beriman yang mengerjakan amal shalih dengan pahala yang besar dari karunia-Nya. Allah tidak menyukai orang-orang yang mengingkari kenikmatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. مَن كَفَرَ فَعَلَيْهِ كُفْرُهُۥ ۖ (Barangsiapa yang kafir maka dia sendirilah yang menanggung (akibat) kekafirannya itu) Yakni balasan atas kekafirannya berupa neraka. وَمَنْ عَمِلَ صٰلِحًا فَلِأَنفُسِهِمْ يَمْهَدُونَ(dan barangsiapa yang beramal saleh maka untuk diri mereka sendirilah mereka menyiapkan) Yakni mereka menyiapkan bagi diri mereka sendiri tempat tinggal di surga dengan amalan keshalihan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Barangsiapa mengingkari Allah, maka baginya itu malapetaka atas kekufurannya, yaitu neraka yang abadi. Dan barangsiapa beriman dan beramal shalih untuk menaati apa yang diperintahkan Allah, maka bagi diri mereka itu dihamparkan atau disiapkan tempat tinggal di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Terpecah belah, satu kelompok di surge dan satu kelompok di neraka {Siapa saja yang ingkar, maka kekufuran itu atas dirinya. Siapa saja yang beramal shalih, maka mereka menyiapkan untuk diri mereka sendiri} menyiapkan tempat mereka di surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-45. maka “barangsiapa yang kafir,” di antara mereka “maka dia sendirilah yang menanggung akibat kekafirannya,” dialah yang akan disiksa disebabkan dirinya sendiri, setiap diri yang berdosa tidak menanggung dosa orang lain. “dan barangsiapa yang beramal shalih,” berupa (menunaikan) hak-hak Allah dan hak-hak manusia yang wajib dan yang dianjurkan, “maka untuk diri mereka sendiri,” bukan untuk orang lain “mereka menyiapkan,” maksudnya, mereka mempersiapkan, dan untuk diri mereka sendiri, mereka memakmurkan akhiratnya, mereka bersiap-siap untuk meraih tempat-tempat tinggal dan bilik-biliknya. Walau demikian, balasan untuk mereka tidak terbatas pada amal perbuatan mereka. Bahkan Allah memberi mereka balasan dari karuniaNya yang berlimpah dan kemurahanNya yang tidak terbatas yang sama sekali tidak bisa dicapai dengan amal mereka. Yang demikian itu adalah karena Allah mencintai mereka. Apabila Allah telah mencintai seorang hamba, maka Allah mencurahkan karuniaNya padanya sebanyak-banyaknya, dan melipat gandakan pemberianNya yang sangat mewah, menganugerahkan kepadanya berbagai nikmat lahir dan batin. Ini berbeda dengan orang-orang kafir. Sesungguhnya Allah, tatkala membenci dan murka terhadap mereka, maka Dia menyiksa dan menghukumnya, dan tidak menambah sebagaimana Dia menambah kepada orang-orang sebelumnya (yang beriman). Maka dari itu Dia berfirman, ”sesungguhnya Dia tidak menyukai orang-orang yang ingkar,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 44: Allah mengabarkan barangsiapa yang kufur dan menolak ayat-ayat Tuhannya, maka baginya akan menerima akibat dari perbuatannya itu, yaitu kekal di dalam neraka jahannam selamanya. Adapun bagi siapa yang mentauhidkan Allah dan beriman kepada-Nya serta mengikuti para Rasul-Nya; Mereka akan mendapatkan kebahagiaan dan kemenangan dengan ridha Allah dan kenikmatan di dalam surga-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik terkait dengan hak Allah maupun hak hamba, demikian pula yang wajib maupun yang sunat. Di samping itu, mereka tidak diberi balasan hanya sebatas yang mereka kerjakan, bahkan Allah akan menambahkan lagi dari karunia-Nya dan kepemurahan-Nya yang tidak dicapai oleh amal mereka. Hal itu, karena Allah mencintai mereka, dan apabila Dia mencintai seorang hamba, maka Dia melimpahkan ihsan dan pemberian yang membanggakan, serta memberikan nikmat yang banyak, baik nikmat zahir (lahir) maupun batin. Berbeda dengan orang kafir, maka Allah membenci dan murka kepada mereka, Dia akan menghukum dan mengazab mereka. Oleh karena itu pada lanjutan ayatnya, Allah berfirman, “Sungguh, Dia tidak menyukai orang-orang yang ingkar (kafir).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 44",
    "description": "Di akhirat nanti setiap manusia akan memperoleh balasan perbuatannya dengan adil. Barang siapa kafir maka dia sendirilah yang menanggung akibat kekafirannya itu, dan barang siapa mengerjakan kebajikan dengan penuh keimanan maka pada dasarnya mereka telah menyiapkan untuk diri mereka sendiri tempat yang menyenangkan di surga sebagai tempat kebahagiaan abadi. 45. Allah memasukkan mereka ke surga agar Allah memberi balasan pahala kepada orang-orang yang beriman dan diwujudkan dengan mengerjakan kebajikan dari sebab karunia-Nya, bukan semata-mata keimanan dan amal salehnya. Sungguh, kenikmatan surga bagi orang mukmin sebagai wujud rahmat-Nya dan azab neraka bagi orang-orang kafir sebagai benuk keadilan-Nya, karena sesungguhnya dia tidak menyukai orang-orang yang kafir."
  }
]