[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah hendak membalas orang-orang yang beriman kepadaNya dan kepada RasulNya serta beramal shalih dari karunia dan kebaikanNya. Sesungguhnya Allah tidak menyukai orang-orang kafir karena Dia memurkai dan memarahi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Allah akan membalas orang-orang yang beriman kepada-Nya dan mengerjakan amal saleh yang menjadikan Rabb mereka meridainya. Sesungguhnya Allah Yang Mahasuci tidak menyukai orang-orang kafir, bahkan memurkai mereka dengan kemurkaan yang besar serta akan menyiksa mereka pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. لِيَجْزِىَ الَّذِينَ ءَامَنُوا۟ (agar Allah memberi pahala kepada orang-orang yang beriman) Yakni manusia terpisah-pisah agar Allah membalas orang-orang bariman sesuai dengan hak mereka. مِن فَضْلِهِۦٓ ۚ (dari karunia-Nya) Yakni lebih dari balasan mereka yang seharusnya berkali-kali lipat, tidak ada yang mampu menghitungnya kecuali Allah. إِنَّهُۥ لَا يُحِبُّ الْكٰفِرِينَ (Sesungguhnya Dia tidak menyukai orang-orang yang ingkar) Ketidaksukaan Allah pada orang-orang kafir adalah tanda kemurkaan Allah pada mereka, dan kemurkaan Allah akan berakhir dengan siksaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Agar Allah membalas orang-orang yang beriman dan mengerjakan perintah Allah dengan pahala dari keutamaan dan kebaikanNya, sehingga pahala itu pasti ditambah. Sesungguhnya Allah menghukum orang-orang kafir dan membenci mereka, sehingga kemarahan itu mengharuskan suatu hukuman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Allah memberi balasan kepada orang-orang yang beriman dan beramal shalih dari karuniaNya. Sesungguhnya Dia tidak menyukai orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-45. maka “barangsiapa yang kafir,” di antara mereka “maka dia sendirilah yang menanggung akibat kekafirannya,” dialah yang akan disiksa disebabkan dirinya sendiri, setiap diri yang berdosa tidak menanggung dosa orang lain. “dan barangsiapa yang beramal shalih,” berupa (menunaikan) hak-hak Allah dan hak-hak manusia yang wajib dan yang dianjurkan, “maka untuk diri mereka sendiri,” bukan untuk orang lain “mereka menyiapkan,” maksudnya, mereka mempersiapkan, dan untuk diri mereka sendiri, mereka memakmurkan akhiratnya, mereka bersiap-siap untuk meraih tempat-tempat tinggal dan bilik-biliknya. Walau demikian, balasan untuk mereka tidak terbatas pada amal perbuatan mereka. Bahkan Allah memberi mereka balasan dari karuniaNya yang berlimpah dan kemurahanNya yang tidak terbatas yang sama sekali tidak bisa dicapai dengan amal mereka. Yang demikian itu adalah karena Allah mencintai mereka. Apabila Allah telah mencintai seorang hamba, maka Allah mencurahkan karuniaNya padanya sebanyak-banyaknya, dan melipat gandakan pemberianNya yang sangat mewah, menganugerahkan kepadanya berbagai nikmat lahir dan batin. Ini berbeda dengan orang-orang kafir. Sesungguhnya Allah, tatkala membenci dan murka terhadap mereka, maka Dia menyiksa dan menghukumnya, dan tidak menambah sebagaimana Dia menambah kepada orang-orang sebelumnya (yang beriman). Maka dari itu Dia berfirman, ”sesungguhnya Dia tidak menyukai orang-orang yang ingkar,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 45: Sungguh Allah akan menyempurnakan bagi mereka yang bertauhid dan mengikuti para Rasul dengan karunia-Nya dan akan Allah penuhi dengan kemuliaan dan kebaikan, sungguh Allah tidak mencintai orang-orang yang kafir; Bahkan membenci dan memusuhi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 45",
    "description": "Allah memasukkan mereka ke surga agar Allah memberi balasan pahala kepada orang-orang yang beriman dan diwujudkan dengan mengerjakan kebajikan dari sebab karunia-Nya, bukan semata-mata keimanan dan amal salehnya. Sungguh, kenikmatan surga bagi orang mukmin sebagai wujud rahmat-Nya dan azab neraka bagi orang-orang kafir sebagai benuk keadilan-Nya, karena sesungguhnya dia tidak menyukai orang-orang yang kafir. 46. Allah menunjukkan bukti-bukti kekuasaan dan keesaan-Nya, baik melalui ayat-ayat Al-Qur'an maupun ayat-ayat yang tersebar di alam raya dan fenomena-fenomena alam. Dan di antara tanda-tanda kebesaran-Nya adalah bahwa dia mengirimkan angin sebagai pembawa berita gembira, sebab angin meniup awan yang tebal lalu hujan pun turun; dan agar kamu merasakan sebagian dari rahmat-Nya dengan tumbuhnya biji-bijian yang telah disemaikan dan menghijaunya tanam-tanaman serta berbuahnya tetumbuhan dan sebagainya; dan agar kapal dapat berlayar dengan perintah-Nya melalui hukum alam yang telah ditetapkan; dan agar kamu dapat mencari sebagian dari karunia-Nya dengan berdagang, berlayar, mencari ilmu, dan lain-lain; dan agar kamu bersyukur atas karunia tersebut dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya."
  }
]