[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bukti-bukti kekuasaan Allah yang menunjukkan bahwa Dia adalah satu-satunya Tuhan Yang Haq, tiada sekutu bagiNya, dan besarnya KuasaNya adalah bahwa Dia mengirimkan angin sebelum hujan sebagai berita gembira, karena angina tersebut menggiring awan, jiwa manusia bergembira menyambutnya, Dia hendak membuat mereka merasakan rahmatNya dengan menurunkan hujan yang menghidupkan negeri dan para hamba, agar perahu-perahu bisa berjalan di laut dengan perintah Allah, agar kalian bisa mencari sebagian dari karuniaNya melalui perniagaan dan lainnya. Allah melakukan semua itu agar kalian mensyukuri nikmat-nikmatNya dan menyembahNya semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan di antara tanda-tanda-Nya yang agung, yang menunjukkan kekuasaan-Nya dan keesaan-Nya, bahwa Dia mengirimkan angin untuk memberi kabar gembira kepada hamba-hamba-Nya akan datangnya hujan, agar merasakan kepada kalian -wahai manusia- sebagian dari rahmat-Nya dengan kesuburan dan kegembiraan yang muncul setelah hujan, agar kapal-kapal bisa berlayar di lautan dengan kehendak-Nya, agar kalian mencari dari karunia Allah dengan berniaga di lautan serta agar kalian mensyukuri nikmat-nikmat Allah atas kalian sehingga Allah menambahkan kepada kalian dari nikmat-nikmat itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Dan termasuk tanda-tanda kekuasaan Allah yang menunjukkan keesaan-Nya, Dia mengirimkan angin sebagai pembawa kabar gembira dan pendatang hujan, rezeki, dan buah-buahan. Agar Allah memberi kalian rahmat-Nya dengan turunnya hujan yang dapat menumbuhan tanaman, agar perahu-perahu dapat berlayar di lautan ketika angin berhembus dengan perintah Allah sehingga kalian dapat mencari rezeki dengan berdagang dan lain sebagainya, agar kalian bersyukur kepada Allah dengan perkataan dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَمِنْ ءَايٰتِهِۦٓ أَن يُرْسِلَ الرِّيَاحَ مُبَشِّرٰتٍ (Dan di antara tanda-tanda kekuasan-Nya adalah bahwa Dia mengirimkan angin sebagai pembawa berita gembira) Yakni pembawa kabar gembira dengan hujan yang akan turun, sebab angin ini mendahului turunnya hujan. وَلِيُذِيقَكُم مِّن رَّحْمَتِهِۦ(dan untuk merasakan kepadamu sebagian dari rahmat-Nya) Yakni rahmat berupa hujan dan kesuburan. وَلِتَجْرِىَ الْفُلْكُ بِأَمْرِهِۦ(dan supaya kapal dapat berlayar dengan perintah-Nya) Berlayar di lautan ketika angin itu berhembus. وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ(dan (juga) supaya kamu dapat mencari karunia-Nya) Yakni mencari rezeki dengan barang dagangan yang diangkut oleh kapal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Dan di antara dalil-dalil kekuasaan dan keesaan Allah SWT yaitu bahwa Allah mengutus angin, yaitu angin kebaikan dan angin rahmat yang membawa kabar gembira dengan membawa hujan supaya kalian bisa merasakan rahmatNya berupa hujan, kesuburan dan kebaikan, menjalankan perahu-perahu di lautan dengan ijin dan kehendakNya, supaya kalian bisa mencari rejeki dari sebagian keutamaan Allah dengan berdagang di lautan dan daratan, dan supaya kalian bisa bersyukur atas nikmat Allah yang ada di dalamnya, Maka dari itu, esakanlah Dia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara tanda-tandaNya adalah bahwa Dia mengirimkan angin sebagai pembawa berita gembira} membawa kabar gembira dengan hujan {agar kalian merasakan sebagian dari rahmatNya, agar kapal} bahtera {dapat berlayar dengan perintahNya} dengan kehendak Allah dan keinginanNya {agar kalian dapat mencari} mencari {sebagian dari karuniaNya, dan agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. maksudnya, diantara bukti-bukti yang menunjukkan atas rahmatNya dan (bahwa) Dia (mampu) membangkitkan orang-orang yang sudah mati, serta bahwa Dia-lah sembahan, maharaja yang terpuji, adalah Dia mengirimkan “angin,” di depan hujan “sebagai pembawa berita gembira,” dengan menggerakkan awan, lalu menghimpunnya, sehingga hati manusia sebelum turun hujan itu merasa gembira, “dan untuk merasakan kepadamu sebagian dari rahmatNya,” lalu Dia menurunkan atas kalian hujan yang dengannya negeri manusia bisa hidup, dan kalian merasakan sebagian dari rahmatNya, yang kalian ketahui bahwa rahmatNya-lah yang menyelamatkan manusia, yang membawa rizki mereka, sehingga dengan begitu kalian rindu untuk beramal shalih yang membuka pintu-pintu perbendaharan rahmatNya, “dan supaya kapal dapat berlayar,” di lautan “dengan perintahNya” yang bersifat qadari, “dan juga supaya kamu dapat mencari sebagian karuniaNYa,” dengan bisa bekerja dalam penghidupan dan berbagai mashlahat kalian. “mudah-mudahan kamu bersyukur,” kepada Dzat yang telah menundukkan berbagai hal untuk kalian. Inilah maksud dari berbagai nikmat, yaitu (agar kalian) membalasnya dengan bersyukur kepada Allah agar Dia menambahnya untuk kalian dan menyisakannya untuk kalian. Adapun membalas kenikmatan dengan kekafiran dan maksiat, maka yang demikian ini adalah tabiat orang yang mengganti nikmat Allah dengan keingkaran dan nikmatNya sebagai bencana. Dan dia menawarkan kesirnaan nikmat dan berpindah dari nikmat kepada yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 46: Allah mengabarkan di antara tanda-tanda yang menunjukkan atas rahmat-Nya dan kuasa-Nya serta menghidupkan, mematikan dan membangkitkan mereka adalah : Allah mengirimkan angin yang membawa serbuk tanaman sebelum turunnya hujan, kemudian barulah turun hujan, sehingga ketika manusia melihat angin tersebut, mereka memberikan kabar gembira (kepada yang lainnya) dan penuh kebahagiaan karenanya dan mereka menunggu untuk turun hujan, dan kemudian barulah turun hujan sehingga membasahi manusia dengan rahmat Allah; Dan di antar tanda-tanda yang menunjukkan rahmat-Nya adalah : Allah jalankan kapal-kapal di lautan dengan perintah dan izin Allah. Kemudian manusia mencari rezeki dari Allah dan karunia dari-Nya dengan berdagang dan selainnya, semua itu agar manusia bersyukur kepada Allah atas kenikamtan-kenikmatan ini dan mentauhidkan-Nya dalam peribadatan serta mentaati-Nya dan tidak menyekutukan-Nya dengan apapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni di antara tanda yang menunjukkan rahmat-Nya dan bahwa Dia akan membangkitkan manusia yang telah mati, demikian pula menunjukkan bahwa Dia yang berhak disembah dan Penguasa Yang Maha terpuji adalah apa yang disebutkan di atas. Sebelum turunnya hujan. Pembawa berita gembira akan turunnya hujan, di mana angin itu menggerakkan awan, lalu mengumpulkannya sehingga jiwa manusia merasa gembira sebelum turunnya. Dari hujan itu tumbuhlah biji-biji yang telah disemaikan dan menghijaulah tanaman-tanaman serta berbuahlah pohon-pohonan dan sebagainya sehingga jiwa manusia bergembira. Yaitu hujan dan kesuburan. Sehingga kamu merasakan bahwa rahmat Allah itulah yang menyelamatkan hamba dan mendatangkan rezeki, dengan begitu kamu ingin beramal saleh yang sesungguhnya membuka perbendaharaan rahmat. Yaitu dengan seizin Allah atau perintah-Nya yang qadari (menjadi taqdir-Nya) terhadap alam semesta. Seperti dapat mengimpor dan mengekspor barang untuk diperdagangkan, sehingga memperoleh keuntungan. Terhadap nikmat-nikmat-Nya sehingga kamu mentauhidkan-Nya, karena Dia telah menundukkan semua sebab untuk manusia, menjalankan semua urusan untuk mereka. Inilah maksud dari nikmat yang diberikan, yakni agar disikapi dengan bersyukur kepada Allah Subhaanahu wa Ta'aala, agar Dia menambah dan mengekalkan nikmat itu kepada kita. Adapun menyikapi nikmat-Nya dengan kufur dan berbuat maksiat, maka ini adalah keadaan orang yang merubah nikmat Allah dengan kekafiran dan merubah nikmat-Nya menjadi cobaan, sehingga siap untuk hilangnya nikmat itu dan berpindah kepada yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 46",
    "description": "Allah menunjukkan bukti-bukti kekuasaan dan keesaan-Nya, baik melalui ayat-ayat Al-Qur'an maupun ayat-ayat yang tersebar di alam raya dan fenomena-fenomena alam. Dan di antara tanda-tanda kebesaran-Nya adalah bahwa dia mengirimkan angin sebagai pembawa berita gembira, sebab angin meniup awan yang tebal lalu hujan pun turun; dan agar kamu merasakan sebagian dari rahmat-Nya dengan tumbuhnya biji-bijian yang telah disemaikan dan menghijaunya tanam-tanaman serta berbuahnya tetumbuhan dan sebagainya; dan agar kapal dapat berlayar dengan perintah-Nya melalui hukum alam yang telah ditetapkan; dan agar kamu dapat mencari sebagian dari karunia-Nya dengan berdagang, berlayar, mencari ilmu, dan lain-lain; dan agar kamu bersyukur atas karunia tersebut dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya. 47. Kaum musyrik mekah tetap mengingkari ajaran tauhid nabi Muhammad meski mereka nyata-Nyata melihat tanda-tanda keesa-an Allah. Allah menurunkan ayat ini untuk menghibur hati nabi Muhammad, menegaskan bahwa para rasul sebelumnya juga didustakan oleh kaumnya. Dan sungguh, kami telah mengutus sebelum engkau beberapa orang rasul kepada kaumnya. Mereka datang kepadanya dengan membawa keterangan-keterangan yang cukup seperti halnya dirimu, lalu kami melakukan pembalasan dan menurunkan azab terhadap orang-orang yang berdosa tersebut karena mereka telah menyakiti para pembawa kebenaran. Dan merupakan hak kami untuk menolong orang-orang yang beriman yang meyakini dengan sepenuh hati wujud dan keesaan Allah."
  }
]