[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah mengutus sebelummu (wahai Rasul) para rasul kepada kaum mereka untuk menyampaikan berita gembira dan memberikan peringatan, mengajak mereka kepada tauhid dan memperingatkan mereka dari syirik, lalu para rasul itu datang kepada umat-umat mereka dengan membawa mukjizat-mukjizat dan bukti-bukti yang kuat, namun kebanyakan dari mereka tidak beriman, maka Kami menghukum orang-orang yang berbuat buruk dari mereka dan membinasakan mereka, dan Kami menolong orang-orang beriman yang merupakan para pengikut rasul-rasul. Demikianlah Kami berbuat terhadap orang-orang yang mendustakanmu bila mereka terus-menerus mendustakanmu dan tidak mau beriman kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan telah Kami utus sebelummu -wahai Rasul- para rasul kepada umat-umat mereka, dengan membawa mukjizat-mukjizat yang menunjukkan kebenaran mereka, akan tetapi umat-umat itu mendustakan apa yang dibawa oleh para rasul mereka, maka Kami balas orang-orang yang melakukan keburukan tersebut; Kami binasakan mereka dengan siksa Kami dan Kami selamatkan para rasul bersama orang-orang yang beriman dari kebinasaan. Penyelamatan orang-orang yang beriman dan pertolongan kepada mereka merupakan kepastian dari Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Hai Rasulullah, sungguh Kami telah mengutus para rasul sebelummu kepada kaum mereka untuk memberi petunjuk kepada kebenaran. Para rasul itu mendatangkan berbagai mukjizat yang besar kepada mereka, akan tetapi mayoritas dari mereka mengingkari mukjizat tersebut, sehingga Allah membinasakan mereka sebagai balasan atas pendustaan mereka. Dan kebenaran yang pasti yang Kami wajibkan pada diri Kami bagi orang-orang beriman untuk menolong mereka dalam menghadapi musuh-musuh mereka sebagai bentuk karunia dari Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ رُسُلًا إِلَىٰ قَوْمِهِمْ (Dan Sesungguhnya Kami telah mengutus sebelum kamu beberapa orang rasul kepada kaumnya) Sebagaimana Kami mengutusmu kepada kaummu. فَجَآءُوهُم بِالْبَيِّنٰتِ(mereka datang kepadanya dengan membawa keterangan-keterangan) Yakni dengan keterangan yang jelas. Namun mereka mengingkarinya. فَانتَقَمْنَا مِنَ الَّذِينَ أَجْرَمُوا۟ ۖ( lalu Kami melakukan pembalasan terhadap orang-orang yang berdosa) Yakni orang-orang yang berbuat bayak dosa. وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ(Dan Kami selalu berkewajiban menolong orang-orang yang beriman) Dan Allah benar dalam janji-Nya, tidak akan menyalahinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Wahai Rasulallah, sungguh Kami telah mengutus para rasul sebelum kamu kepada kaum mereka. Mereka menyeru kaumnya untuk mengesakan Allah. Mereka mendatangi kaumnya dengan mukjizat atau dengan hujjah yang menerangkan kebenaran risalah mereka kepada kaumnya. Kemudian Kami membalas orang-orang yang melakukan keburukan dan mendustakan para rasul dengan membinasakan dan menghancurkan (mereka). Dan Kami pasti wajib menolong orang-orang mukmin atas orang orang kafir dengan menghancurkan mereka dan menyelamatkan orang-orang mukmin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah mengutus sebelummu beberapa rasul kepada kaumnya. Mereka datang kepada kaumnya dengan membawa keterangan-keterangan} dalil-dalil yang jelas {lalu Kami melakukan pembalasan terhadap orang-orang yang durhaka. Merupakan tanggung jawab Kami menolong orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “dan sesungguhnya kami telah mengutus sebelum kamu,” pada umat-umat terdahulu “beberapa orang rasul kepada kaumnya,” saat mereka mengingkari tauhid kepada Allah dan mendustakan yang benar, lalu para rasul itu datang mengajak mereka kepada tauhid, ikhlas dan membenarkan yang haq dan menyatakan rusak pada kebatilan ajaran yang mereka anut, yaitu kekafiran dan kesesatan. Para rasul itu datang kepada mereka dengan mukjizat-mukjizat dan dalil-dalil yang menunjukkan kepada semua itu, namun mereka tidak beriman dan tidak berpindah dari kesesatan mereka. “lalu kami melakukan pembalasan terhadap orang-orang yang berdosa” dan kami berikan pertolongan kepada orang-orang yang beriman, yaitu para pengikut para rasul. ”dan adalah kewajiban kami menolong orang-orang yang beriman,” maksudnya, kami telah mewajibkan hal itu atas diri kami, dan kami menjadikannya dalam sejumlah hak-hak yang telah ditentukan, dan kami telah menjanjikannya kepada mereka, maka pasti terjadi. Maka kalian, wahai orang-orang yang mendustakan Muhammad, jika kalian tetap pada sikap mendustakan, pasti kalian akan ditimpa siksaan, dan kami pasti menolongnya atas kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 47: Allah mengabarkan bahwasanya telah diutus sebelum Nabi Muhammad ﷺ para utusan kepada kaum-kaum mereka, mereka memerintahkan untuk beribadah kepada Allah saja dan meninggalkan sesembahan selain-Nya. Telah datang tanda-tanda yang nyata yang menunjukkan bahwasanya mereka adalah para utusan Allah; Dan tidak (kaum mereka) kebanyakannya kecuali mendustakan para Rasul, tidak beriman kepada mereka. Itulah sebabnya mereka ditimpakan adzab dan kebinasaan oleh Allah. Allah kemudian mengabarkan bahwasanya Dia memenangkan para Rasul dan pengikut mereka yang beriman kepada Allah dan menjalankan apa yang mereka diperintahkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika mereka tidak mentauhidkan Allah dan mendustakan yang hak, maka rasul-rasul mereka datang mengajak mereka kepada tauhid dan ikhlas, membenarkan yang hak, membatalkan kekafiran dan kesesatan yang ada pada mereka, rasul-rasul tersebut juga membawa bukti-bukti yang menunjukkan kebenaran mereka (mukjizat), namun mereka tetap saja tidak beriman dan tidak berhenti dari kesesatannya. Yang membuktikan kebenaran mereka. Dengan menyiksa orang yang berdosa dan menolong orang-orang mukmin para pengikut rasul. Oleh karena itu, kalian wahai orang-orang yang mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam, jika tetap di atas sikap itu, maka kamu akan mendapatkan hukuman-Nya dan Allah akan menolong Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 47",
    "description": "Kaum musyrik mekah tetap mengingkari ajaran tauhid nabi Muhammad meski mereka nyata-Nyata melihat tanda-tanda keesa-an Allah. Allah menurunkan ayat ini untuk menghibur hati nabi Muhammad, menegaskan bahwa para rasul sebelumnya juga didustakan oleh kaumnya. Dan sungguh, kami telah mengutus sebelum engkau beberapa orang rasul kepada kaumnya. Mereka datang kepadanya dengan membawa keterangan-keterangan yang cukup seperti halnya dirimu, lalu kami melakukan pembalasan dan menurunkan azab terhadap orang-orang yang berdosa tersebut karena mereka telah menyakiti para pembawa kebenaran. Dan merupakan hak kami untuk menolong orang-orang yang beriman yang meyakini dengan sepenuh hati wujud dan keesaan Allah. 48. Ayat ini menjelaskan cara kerja angin sehingga bisa mendatangkan hujan yang itu merupakan rekayasa ilahi. Allah-lah yang mengirimkan angin sesuai hukum alam yang telah ditetapkan-Nya lalu angin itu menggerakkan awan yang sebelumnya diam ke arah dan lokasi yang dikehendaki-Nya, dan Allah terkadang membentangkannya di langit menurut yang dia kehendaki, dan di saat lain dia menjadikannya bergumpal-gumpal, lalu engkau lihat hujan keluar dari celah-celahnya. Maka, apabila dia menurunkannya, yakni hujan, kepada hamba-hamba-Nya yang dia kehendaki tiba-tiba atau bersamaan dengan turunnya hujan itu mereka bergembira."
  }
]