[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah, Dia-lah yang mengirimkan angin yang menggerakan awan yang berat karena mengandung air, lalu Allah menyebarkannya di langit sebagaimana Dia kehendaki, Dia menjadikan awan-awan itu potongan-potongan, maka kamu melihat hujan keluar dari celah-celah awan, bila Allah mengirimkan hujan itu kepada hamba-hambaNya, mereka pun berbahagia dan bersuka cita karena Allah telah memberikan hujan tersebut kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Allah Yang Mahasuci yang mengendalikan angin dan menggerakkannya, lalu angin itu menggerakkan awan dan Dia membentangkannya di langit dengan sekehendak-Nya baik sedikit maupun banyak dan menjadikannya gumpalan-gumpalan, maka engkau lihat -wahai orang yang melihat- hujan turun dari sela-selanya. Maka jika hujan telah turun atas hamba-hamba-Nya yang dikehendaki-Nya, tiba-tiba mereka menjadi gembira karena rahmat Allah kepada mereka dengan diturunkannya hujan yang menumbuhkan tumbuhan di bumi yang dibutuhkan oleh diri mereka dan hewan ternak mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-49. Allah menyampaikan kepada manusia bagaimana Dia menurunkan hujan kepada mereka. Allah mengirim angin yang berhembus membawa awan yang mengandung air, angin itu mengumpulkan awan-awan itu udara yang tinggi dan menjadikannya saling terpencar atau bersambung. Maka kamu dapat melihat air hujan keluar di sela-sela awan itu. Setelah Allah menurunkan hujan itu kepada hamba-hamba-Nya yang Dia kehendaki, mereka menjadi gembira, padahal sebelumnya mereka merasa putus asa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. اللهُ الَّذِى يُرْسِلُ الرِّيٰحَ فَتُثِيرُ سَحَابًا (Allah, Dialah yang mengirim angin, lalu angin itu menggerakkan awan) Yakni angin itu mengangkat awan yang terbentuk dari uap air lautan. فَيَبْسُطُهُۥ فِى السَّمَآءِ كَيْفَ يَشَآءُ(dan Allah membentangkannya di langit menurut yang dikehendaki-Nya) Terkadang awan itu bergerak dan terkadang berhenti, terkadang bergulung-gulung dan terkadang tidak demikian, terkadang berjalan ke tempat yang jauh dan terkadang ke tempat yang dekat. وَيَجْعَلُهُۥ كِسَفًا(dan menjadikannya bergumpal-gumpal) Yakni potongan-potongan yang terpisah-pisah. فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلٰلِهِۦ ۖ( lalu kamu lihat hujan keluar dari celah-celahnya) Makna (الودق) adalah hujan. Dan (خلاله) adalah tengah-tengahnya. فَإِذَآ أَصَابَ بِهِۦ(maka apabila hujan itu turun) Yakni hujan itu. مَن يَشَآءُ مِنْ عِبَادِهِۦٓ( mengenai hamba-hamba-Nya yang dikehendaki-Nya) Yakni negeri dan tanah mereka. إِذَا هُمْ يَسْتَبْشِرُونَ(tiba-tiba mereka menjadi gembira) Makna (الاستبشار) adalah merasa gembira."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Allah adalah Dzat yang menggerakkan angin dan mengarahkannya pada suatu tujuan sehingga bisa menggerakkan awan dan menyebarkannya dalam keadaan terpisah-pisah satu sama lain di langit sesuai kehendakNya baik sedikit maupun banyak dan terkadang menjadikannya satu potongan yang terpisah, lalu kamu bisa melihat hujan keluar dari tengah-tengahnya. Ketika hujan itu mengenai hamba-hambaNya yang dikehendaki, maka mereka akan memberi kabar gembira satu sama lain tentang kebaikan dan kesuburan melalui hujan yang menjadi tanda-tandanya. Idza (pada ayat ini) adalah huruf yang menunjukkan hasil dari sesuatu setelahnya yang diakibatkan oleh sesuatu sebelumnya dengan seketika"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allahlah Dzat yang mengirim angin, lalu angina itu menggerakkan} menggerakkan dan menyebarkan {awan, kemudian Dia membentangkannya} menyebarkan dan membentangkannya {di langit sesuai yang Dia kehendaki dan Dia menjadikannya gumpalan-gumpalan} potongan-potongan yang terpisah {lalu kamu melihat hujan} hujan {keluar dari celah-celahnya} di antara awan {Maka apabila Dia menimpakan itu} hujan itu {kepada hamba-hambaNya yang Dia kehendaki, seketika itu mereka bergembira"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. Allah mengabarkan tentang kesempurnaan-kesempurnaanNya dan kelengkapan nikmatNya, yaitu banhwasannya Dia, ”mengirim angin, lalu angin itu menggerakan awan,” dari bumi, “dan membentangkannya di langit,” yakni, membentangkan dan menjadikannya luas, “menurut yang dikehendakiNya,” menurut keadaan yang Dia kehendaki darinya, “kemudian menjadikannya,” maksudnya, menjadikan awan yang terbentang luas itu “bergumpal-gumpal.” Maksudnya, awan yang tebal, sebagianya menggumpali sebagian yang lain, “ lalu kamu lihat hujan keluar dari celah-celahnya,” maksudnya, dari celah-celah awan itu, sebagai tetesan-tetesan kecil yang bertebaran, ia tidak turun semuanya (sekaligus) karena akan membuat rusak apa yang ditimpanya “maka apabila dia mengenai,” maksudnya, dengan hujan itu,orang “yang dikendakiNya dari hamba-hambaNya tiba-tiba mereka menjadi gembira,” sebagian menyampaikan berita gembira pada sebagain yang sangat butuh dan sangat perlunya mereka kepadanya. Maka dari itu Allah berfirman,”dan sesungguhnya sebelum hujan diturunkan kepada mereka, mereka benar-benar telah berputus asa.” Maksudnya, berputus harapan karena keterlambatan waktu turunnya. Maksudnya, setelah hujan itu turun dalam kondisi seperti itu, maka hujan benar-benar menjadi sangat berharga bagi mereka, dan menjadi kebahagiaan, dan kegembiraan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 48: Ketahuilah bahwasanya Allah sajalah yang mengutus angina dengan membawa awan yang kemudian terhampar dan meluas di ufuk langit dengan keadaan yang sebagaimana Allah inginkan. Kemudian Allah menjadikan awan itu menjadi awan yang tebal dan padat yang satu sama lain saling mendindih, kemudian engkau akan melihat hujan yang keluar setelahnya dari awan tersebut; Maka jika telah turun hujan dengan kehendak Allah agar turun kepada mereka hamba-hamba Allah; Maka mereka akan bergembira dengan memberi kabar kepada sebagaian orang yang lain; Karena sebab hujan ini padanya terdapat kehidupan bagi mereka serta hewan-hewan mereka dan lading-ladang mereka, mereka sangatlah membutuhkannya, khususnya penduduk desa dan perkotaan yang jauh dari sungai-sungai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya kekuasaan-Nya dan sempurnanya nikmat-Nya, bahwa Dia mengirimkan angin, lalu angin itu menggerakkan awan, kemudian membentangkan dan melebarkannya menurut yang Dia kehendaki, lalu Dia jadikan awan yang lebar itu tebal bergumpal-gumpal. Yakni tidak turun sekaligus sehingga menghasilkan maslahat bagi manusia. Sebagian mereka memberikan kabar gembira kepada yang lain tentang turunnya, kebutuhan mereka menjadi terpenuhi sehingga mereka bergembira dan senang, padahal sebelumnya mereka telah berputus asa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 48",
    "description": "Ayat ini menjelaskan cara kerja angin sehingga bisa mendatangkan hujan yang itu merupakan rekayasa ilahi. Allah-lah yang mengirimkan angin sesuai hukum alam yang telah ditetapkan-Nya lalu angin itu menggerakkan awan yang sebelumnya diam ke arah dan lokasi yang dikehendaki-Nya, dan Allah terkadang membentangkannya di langit menurut yang dia kehendaki, dan di saat lain dia menjadikannya bergumpal-gumpal, lalu engkau lihat hujan keluar dari celah-celahnya. Maka, apabila dia menurunkannya, yakni hujan, kepada hamba-hamba-Nya yang dia kehendaki tiba-tiba atau bersamaan dengan turunnya hujan itu mereka bergembira. 49. Padahal, sebelum hujan diturunkan kepada mereka, mereka benar-benar telah berputus asa dan tidak tahu harus berbuat apa."
  }
]