[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan keadaan mereka sebelum hujan itu turun sungguh berada dalam keadaan berputus asa dan tidak ada harapan, disebabkan tertahannya hujan terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan sebelum Allah menurunkan hujan atas mereka, mereka benar-benar telah putus asa dari turunnya hujan itu atas mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَإِن كَانُوا۟ مِن قَبْلِ أَن يُنَزَّلَ عَلَيْهِم مِّن قَبْلِهِۦ لَمُبْلِسِينَ (Dan Sesungguhnya sebelum hujan diturunkan kepada mereka, mereka benar-benar telah berputus asa) Yakni mereka sebelum turunnya hujan kepada mereka, atau sebelum musim tanam dan hujan, mereka sangat berputus asa akan kedatangannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "48-49. Allah mengabarkan tentang kesempurnaan-kesempurnaanNya dan kelengkapan nikmatNya, yaitu banhwasannya Dia, ”mengirim angin, lalu angin itu menggerakan awan,” dari bumi, “dan membentangkannya di langit,” yakni, membentangkan dan menjadikannya luas, “menurut yang dikehendakiNya,” menurut keadaan yang Dia kehendaki darinya, “kemudian menjadikannya,” maksudnya, menjadikan awan yang terbentang luas itu “bergumpal-gumpal.” Maksudnya, awan yang tebal, sebagianya menggumpali sebagian yang lain, “ lalu kamu lihat hujan keluar dari celah-celahnya,” maksudnya, dari celah-celah awan itu, sebagai tetesan-tetesan kecil yang bertebaran, ia tidak turun semuanya (sekaligus) karena akan membuat rusak apa yang ditimpanya “maka apabila dia mengenai,” maksudnya, dengan hujan itu,orang “yang dikendakiNya dari hamba-hambaNya tiba-tiba mereka menjadi gembira,” sebagian menyampaikan berita gembira pada sebagain yang sangat butuh dan sangat perlunya mereka kepadanya. Maka dari itu Allah berfirman,”dan sesungguhnya sebelum hujan diturunkan kepada mereka, mereka benar-benar telah berputus asa.” Maksudnya, berputus harapan karena keterlambatan waktu turunnya. Maksudnya, setelah hujan itu turun dalam kondisi seperti itu, maka hujan benar-benar menjadi sangat berharga bagi mereka, dan menjadi kebahagiaan, dan kegembiraan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Sebelum turun hujan, sesungguhnya mereka adalah orang-orang yang putus asa dengan turunnya hujan. Firman Allah {Min Qablihi} untuk menjelaskan seberapa cepatnya perubahan mereka dari putus asa menjadi gembira. Ini adalah perkara orang-orang yang sembrono dan gegabah, adapun orang mukmin itu bersabar dan tidak tergesa-gesa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebelum hujan diturunkan kepada mereka, mereka benar-benar telah berputus asa} benar-benar berputus asa dengan turunnya hujan itu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 49: Setelah Allah menjelaskan keadaan mereka setelah turunnya hujan dengan memberi kabar gembira dan menyebarkan kabar tersebut; Mereka berkisah akan keadaan mereka sebelum turunnya hujan dengan keadaan kekeringan dan jauh dari rahmat Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 49",
    "description": "Padahal, sebelum hujan diturunkan kepada mereka, mereka benar-benar telah berputus asa dan tidak tahu harus berbuat apa. 50. Demikianlah cara Allah menurunkan hujan. Maka, perhatikanlah bekas-bekas rahmat Allah, berupa hujan, bagaimana Allah melalui air hujan itu menghidupkan bumi setelah mati atau kering. Sungguh, jika Allah mampu menghidupkan bumi yang sudah kering dengan air hujan, itu berarti dia pasti berkuasa juga untuk menghidupkan manusia yang telah mati. Dan dia mahakuasa atas segala sesuatu."
  }
]