[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-5. Kerajaan Persia mengalahkan kerajaan Romawi di bagian negeri Syam yang terdekat kepada negeri Persia, namun orang-orang Romawi akan mengalahkan orang-orang Persia dalam beberapa waktu, tidak lebih dari sepuluh tahun dan tidak kurang dari tiga tahun. Hanya milik Allah segala urusan sebelum kemenangan orang-orang Romawi dan sesudahnya. Di hari orang-orang Romawi mengalahkan orang-orang Persia, orang-orang Mukmin berbahagia dengan kemenangan yang diberikan Allah kepada orang-orang Romawi atas orang-orang Persia. Allah memberikan kemenangan kepada siapa yang Dia kehendaki dan mengalahkan siapa yang Dia Kehendaki. Dia Maha perkasa yang tidak dikalahkan dan Maha Penyayang kepada siapa yang Dia kehendaki dari makhlukNya. Hal ini benar-benar terjadi, di mana orang-orang Romawi mengalahkan orang-orang Persia setelah tujuh tahun dan kaum muslimin berbahagia karena itu, sebab orang-orang Romawi adalah Ahli Kitab sekalipun mereka telah menyelewengkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Mereka gembira dengan kemenangan Romawi atas Persia karena mereka adalah Ahli Kitab. Allah menolong orang yang dikehendaki-Nya atas orang yang dikehendaki-Nya, dan Dia Maha Perkasa yang tidak mungkin dikalahkan, Maha Penyayang kepada para hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. بِنَصْرِ اللهِ ۚ (Karena pertolongan Allah) Yakni di hari bangsa Ramawi mengalahkan bansa Persia setelah beberapa tahun orang-orang beriman bergembira atas pertolongan Allah bagi bangsa Ramawi, sebab mereka adalah Ahli Kitab. Ayat ini merupakan salah satu mukjizat Nabi Muhammad, karena mengandung kabar apa yang akan terjadi pada beberapa tahun ke depan. Dan kemenangan bansa Ramawi benar-benar setelah beberapa tahun. Dan ayat ini adalah kabar tentang apa yang akan terjadi. يَنصُرُ مَن يَشَآءُ ۖ( Dia menolong siapa yang dikehendaki-Nya) Allah menolong bagi siapa yang Dia kehendaki untuk Dia tolong. وَهُوَ الْعَزِيزُ(Dan Dialah Maha Perkasa) Maha Kuasa dan Maha perkasa. الرَّحِيمُ (lagi Maha Penyayang) Maha Penyayang bagi hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Mereka senang dengan pertolongan Allah untuk Romawi yang merupakan para ahli kitab atas Persia yang merupakan para penyembah berhala. Allah menolong hambaNya yang dikehendaki untuk ditolong. Dialah yang Maha Kuat, Maha Perkasa, dan Maha Membalas musuh-musuh Nya, serta Maha Penyayang bagi orang-orang yang mau bertaubat dan beriman. Ayat-ayat itu termasuh dalil-dalil kenabian karena menginformasikan keghaiban"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Karena pertolongan Allah. Dia menolong siapa saja yang Dia kehendaki. Dia Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. bangsa Persia dan bangsa romawi pada saat itu merupakan dua negara super power yang ada di muka bumi ini; dan selalu terjadi peperangan diantara dua bangsa ini sebagaimana biasa terjadi pada bangsa-bangsa yang selevel. Bangsa Persia adalah penyembah api, sedangkan bangsa romawi adalah ahli kitab yang berafilasi kepada Taurat dan injil, dan mereka lebih dekat kepada kaum muslimin daripada bangsa Persia. {orang-orang mukmin] sangat senang kalau bangsa romawi menang dan dapat mengalahkan bangsa Persia berada dalam kesyirikan, maka mereka senang kalau bangsa Persia menang atas bangsa romawi. Lalu ternyata bangsa Persia dapat menang atas bangsa romawi, dan mereka dapat mengalahkan bangsa romawi, namun tidak sampai menguasai kerajaan mereka, bahkan sedikitpun dari daerah kekuasaan romawi. Maka kaum musyrikin Arab pun sangat bergembira dengannya, sedangkan kaum Muslimin bersedih. Maka dari itu Allah mengabarkan kepada mereka dan menjanjikkan bahkan bangsa romawi akan mengalahkan bangsa Persia. “dalam beberapa tahun lagi,” Sembilan atau delapan tahun lagi, atau semisal hal itu, tidak lebih dari sepuluh tahun lagi dan tidak pula kurang dari tiga tahun; dan sesungguhnya kemenangan bangsa Persia terhadap bangsa romawi, lalu kemenangan bangsa romawi terhadap bangsa Persia semuanya terjadi atas kehendak dan kekuasaanNya. Dari itu Allah berfirman, ”milik Allah-lah urusan sebelum dan sesudahnya,” jadi kemenangan dan pertolongan itu tidak hanya sekedar disebabkan terwujudnya sebab kausalitas (fasilitas dan perlengkapan), melainkan pasti diiringi oleh qadha dan qadar. “dan di hari,” maksudnya, pada hari bangsa romawi dapat memenangkan bangsa Persia dan mengalahkan mereka, “bergembiralah orang-orang yang beriman, karena pertolongan Allah. Dia menolong siapa yang dikehendakiNya,” maksudnya, mereka bergembira dengan kemenangan bangsa romawi atas bangsa Persia, sekalipun semuanya adalah orang-orang kafir, akan tetapi sebagian keburukan (suatu kaum) itu lebih ringan daripada (keburukan dari kaum) yang lain. Dan pada saat itu pula kaum musyrikin berduka cita. “dan Dia-lah Yang Mahaperkasa,” yang memilki keperkasaan yang dengannya Dia menaklukkan seluruh makhluk; Dia memberikan kekuasaan dari siapa yang Dia kehendaki, Dia memuliakan siapa saja yang Dia kehendaki dan menghinakan siapa saja yang Dia kehendaki. “lagi Mahapenyayang,” terhadap hamba-hambaNYa yang beriman, yang mana Dia menyediakan segala sebab kausalitas yang dapat membuat mereka bahagia, dan menolong mereka yang sama sekali di luar perhitungan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 5: 2-5. Allah mengabarkan bahwa Persia menaklukkan Romawi di dekat bumi Syam arah menuju negeri Persia. Dan romawi akan kembali untuk mengalahkan Persia kurang dari sepuluh tahun mendatang, karena sesungguhnya seluruh urusannya adalah di tangan Allah setelah persia mengalahkan romawi. Bahwasanya semua itu adalah di bawah kehendak ilmu Allah dan penjagaan-Nya. Dan pada hari dikalahkannya persia oleh romawi, menjadikan gembira bagi orang-orang yang beriman dari para sahabat Nabi ﷺ dengan penaklukkan ini; Karena sebab Allah menolong Ahlul Kitab pengikut Musa dan Isa atas orang-orang majusi (persia) yang menghambakan diri kepada api, Allah juga menolong orang-orang yang beriman dari orang-orang musyrik di Badr, dan Allah menolong bagi siapa yang dikehendaki dan menaklukkan bagi siapa yang dikehendaki-Nya dari para hamba-Nya. Dialah yang maha kuat yang tidak ada yang dapat menaklukkan-Nya, yang maha penyayang yang maha luas kasih sayang-Nya atas segala sesuatu. Dan benar, bahwasanya romawi telah mengalahkan persia setelah tujuh tahun lamanya dengan serangan langsung kepada persia. Bergembiralah orang-orang muslim akan hal ini; Karena sebab romawi adalah Ahlul Kitab meskipun menyimpang, dan mereka lebih dekat kepada orang-orang yang beriman dibandingkan hamba yang beribadah kepada api."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan keperkasaan-Nya Dia tundukkan semua makhluk, Dia memberikan kerajaan kepada siapa yang Dia kehendaki dan mencabut kerajaan dari siapa yang Dia kehendaki, Dia memuliakan siapa yang Dia kehendaki dan menghinakan siapa yang Dia kehendaki. Kepada hamba-hamba-Nya yang mukmin, di mana Dia telah menetapkan segala sebab yang membahagiakan mereka dan memenangkan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 5",
    "description": "Orang-orang mukmin bergembira sebab kemenangan bangsa romawi tersebut terjadi karena pertolongan Allah. Dia akan menolong siapa yang dia kehendaki setelah syarat-syarat kemenangan terpenuhi dan hikmah serta kebijaksanaan-Nya menghendaki hal tersebut. Dia mahaperkasa, tidak satu pun makhluk mampu mengalahkan-Nya, maha penyayang kepada hamba-hamba-Nya yang taat. 6. Itulah janji Allah kepada kaum mukmin. Janji Allah pasti benar sebab Allah tidak akan menyalahi janji-Nya, tetapi kebanyakan manusia, khususnya orang kafir, tidak mengetahui dan memahami bahwa ketentuan dan perbuatan Allah kepada hamba-Nya didasarkan pada keadilan dan kebijaksanaan-Nya."
  }
]