[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka lihatlah (wahai orang yang menyaksikan) dengan penuh perhatian dan perenungan kepada apa yang diakibatkan oleh hujan, yaitu tumbuhnya pohon-pohon, tanam-tanaman dan buah-buahan; bagaimana Allah menghidupkan bumi setelah ia mati dengan hujan itu, Dia menumbuhkannya dan ia pun hidup menghijau? Sesungguhnya Allah Yang kuasa menghidupkan bumi yang mati, benar-benar kuasa menghidupkan orang-orang yang sudah mati. Dia Mahakuasa atas segala sesuatu, tidak ada yang melemahkanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Maka lihatlah -wahai Rasul- kepada pengaruh hujan yang Allah turunkan kepada hamba-hamba-Nya itu, bagaimana dengannya Allah menghidupkan bumi dengan menumbuhkan di atasnya berbagai jenis tanaman yang sebelumnya kering dan gersang. Sesungguhnya Żat yang menghidupkan bumi yang kering itu benar-benar akan membangkitkan orang-orang yang mati kembali hidup dan Dia Mahakuasa atas segala sesuatu, tidak ada yang dapat melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Hai hamba-Ku, lihatlah hasil dari hujan yang berupa buah-buahan dan rezeki yang lain; bagaimana Allah menjadikan tanah yang subur padahal sebelumnya tandus? Allah Yang Maha Besar yang mampu menghidupkan tanah itu juga mampu untuk menghidupkan orang yang telah mati. Dia Maha Kuasa melakukan segala sesuatu, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. فَانظُرْ إِلَىٰٓ ءَاثٰرِ رَحْمَتِ اللهِ (Maka perhatikanlah bekas-bekas rahmat Allah) Yang timbul dari turunnya hujan, seperti tanaman, buah-buahan, dan perkebunan yang menjadi sebab kesejahteraan dan kelapangan hidup. Perhatikanlah hal ini agar menjadi tanda keesaan Allah dalam penciptaan yang menakjubkan ini. كَيْفَ يُحْىِ الْأَرْضَ بَعْدَ مَوْتِهَآ ۚ( bagaimana Allah menghidupkan bumi yang sudah mati) Yakni perhatikanlah bagaimana penghidupan bumi yang sangat luar biasa ini. إِنَّ ذٰلِكَ(Sesungguhnya yang demikian itu) Yakni sungguh pencita hal-hal yang disebutkan itu. لَمُحْىِ الْمَوْتَىٰ ۖ( benar-benar (berkuasa) menghidupkan orang-orang yang telah mati) Yakni berkuasa untuk menghidupkan mereka di akhirat, membangkitkan dan membalas perbuatan mereka, sebagaimana Dia menghidupkan bumi yang mati dengan hujan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Wahai orang yang diajak bicara, perhatikanlah pengaruh hujan itu terhadap tanaman, tumbuhan, pepohonan, dan buah-buahan, bagaimana Allah menghidupkan bumi dengan tanaman setelah kekeringan dan kegersangan. Sesungguhnya Dzat yang menghidupkan bumi dengan kuasaNya adalah Dzat yang menghidupkan orang-orang mati pada hari kiamat untuk dihisab dan dibalas. Dan Allah itu berkuasa atas segala sesuatu dan memiliki banyak kuasa sehingga tidak ada apapun yang bisa melemahkanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Perhatikanlah jejak-jejak rahmat Allah} hujan {bagaimana Dia menghidupkan bumi setelah mati. Sesungguhnya demikian itu pasti menghidupkan orang yang telah mati. Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “maka perhatikanlah bekas-bekas rahmat Allah, bagaimana Dia menghidupkan bumi yang sudah mati,” maka iapun hidup dan subur, serta menumbuhkan berbagai macam tumbuh-tumbuhan yang indah. “sesungguhnya yang demikian itu,” yang telah menghidupkan tanah sesudah kegersangannya “benar-benar akan menghidupkan orang-orang yang telah mati. Dan Dia mahakuasa atas segala sesuatu.” Jadi, kekuasaanNya membuat segala sesuatu tidak ada yang sulit bagiNya, sekalipun disarasa sangat sulit (tidak mungkin) menurut perkiraan makhlukNYa, dan sangat rumit dari pemahaman mereka serta akal pikiran mereka menjadi bingung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 50: Kemudian Allah menyampaikan agar manusia melihat dampak-dampak dari rahmat Allah dengan turunnya hujan, bagaimana Allah menghidupkan tanah ini setelah kematiannya dan kekeringan, di mana diturunkan hujan yang kemudian basah dan tumbuh dari bibit tanaman yang mulia. Ketahuilah wahai manusia bahwasanya yang menghidupkan tanah ini setelah kematiannya sebagaimana kalian lihat, Allah lebih mampu lagi membangkitkan kalian setelah kematian kalian, kemudian dibangkitkan kalian pada hari pembalasan dan hisab (perhitungan), Allah berkuasa atas segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kekuasaan-Nya tidak dapat ditolak oleh sesuatu meskipun sulit dipikirkan mereka dan akal mereka tidak dapat membayangkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 50",
    "description": "Demikianlah cara Allah menurunkan hujan. Maka, perhatikanlah bekas-bekas rahmat Allah, berupa hujan, bagaimana Allah melalui air hujan itu menghidupkan bumi setelah mati atau kering. Sungguh, jika Allah mampu menghidupkan bumi yang sudah kering dengan air hujan, itu berarti dia pasti berkuasa juga untuk menghidupkan manusia yang telah mati. Dan dia mahakuasa atas segala sesuatu. 51. Usai menjelaskan rahmat-Nya yang berupa hujan Allah bersumpah, 'sungguh jika kami mengirimkan angin panas yang memicu bencana lalu sawah ladang mereka terbakar karenanya sehingga mereka melihat tumbuh-tumbuhan dan buah-buahan di kebun itu yang semula segar berubah menjadi kuning, kering, dan layu, pasti setelah itu mereka tetap dan terus ingkar kepada Allah. Inilah gambaran orang yang meletakkan ukuran kebahagiaannya pada hal-hal yang bersifat materi sehingga jiwanya terombang-ambing oleh keadaan yang menimpanya."
  }
]