[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika Kami mengirimkan angin yang merusak kepada tanaman dan pohon-pohon mereka, mereka melihat tanaman mereka telah rusak akibat angin tersebut, maka jadilah tumbuhan itu menguning setelah sebelumnya hijau, setelah mereka melihatnya, mereka termenung dalam keadaan kafir dan ingkar kepada nikmat-nikmat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan jika Kami kirimkan kepada ladang dan tumbuh-tumbuhan mereka angin yang menghancurkannya, lalu mereka melihat ladang mereka berwarna kekuningan padahal sebelumnya berwarna kehijauan, maka setelah menyaksikan hal itu pastilah mereka akan tetap mengingkari nikmat-nikmat Allah yang telah lalu meski banyak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Sungguh jika Kami mengirim angin kencang yang dapat merusak tanaman mereka sehingga menjadi kuning dan mengering karena begitu kencangnya angin itu, maka mereka pasti akan tetap mengingkari nikmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَلَئِنْ أَرْسَلْنَا رِيحًا فَرَأَوْهُ (Dan sungguh, jika Kami mengirimkan angin (kepada tumbuh-tumbuhan) lalu mereka melihat (tumbuh-tumbuhan itu)) Yakni melihat kebun dan tanaman mereka. مُصْفَرًّا(menjadi kuning (kering)) Akibat suhu dingin yang ditimbulkan oleh angin yang dikirim Allah. لَّظَلُّوا۟ مِنۢ بَعْدِهِۦ يَكْفُرُونَ(benar-benar tetaplah mereka sesudah itu menjadi orang yang ingkar) Yakni ingkar kepada Allah dan nikmat-Nya. Ini merupakan bukti cepatnya kegoyahan mereka dan ketidaksabaran mereka serta lemahnya hati mereka, dan ini bukanlah sifat orang yang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Dan jika Kami mengutus angin yang berbahaya bagi tumbuhan dan tanaman mereka, maka mereka akan melihat tumbuhan atau tanaman mereka berwarna pucat dan rusak karena angin yang sangat kencang. Setelah hal itu, mereka akan selalu mengingkari Allah dan menyangkal nikmat-nikmatNya. Maknanya adalah peringatan itu tidak berguna kepada mereka karena hati mereka keras."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh jika Kami mengirimkan angin, lalu mereka melihat (tanaman) itu menguning} lalu mereka melihat tanaman menguning setelah berwarna hijau {niscaya setelah itu} setelah menguningnya tanaman itu {mereka tetap} mereka masih tetap {berbuat ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Allah menginformasikan tentang keadaan manusia, dan bahwa mereka beserta limpahan berbagai nikmat kepada mereka berupa disuburkannya tanah setelah kegersangannya dan setelah disebarluasakannya rahmat Allah, kalau seandainya kami tiupkan terhadap tanaman-tanaman mereka yang membahayakan lagi membinasakan atau merusak “lalu mereka melihatnya menjadi kuning,” telah menandakan akan kematiannya, “benar-benar tetaplah mereka sesudah itu ingkar,” mereka lupa terhadap nikmat-nikmat terdahulu, dan mereka segera menjadi ingkar. Orang-orang seperti itu, tidak ada gunanya nasihat atau peringatan bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 51: Setelah Allah menjelaskan keadaan-keadaan manusia ketika mereka melihat angin yang menggiring awan yang mengandung hujan dan mereka bergembira atasnya serta menyiarkan kabar gembira tersebut, maka kemudian Allah menjelaskan angin yang membawa kerikil dan pasir yang merusak dan menghancurkan ladang-ladang. Karena sebab mereka adalah orang-orang yang menyambut kekufuran dan menolak kenikmatan yang telah Allah berikan kepada mereka dan mereka berakta : Ini adalah fenomena alam dan kejadiaan alam yang wajar, inilah yang dinamakan tsunami. Mereka lupa akan yang menjadikan sebab akan hal itu dan lalai dari akibat akan dosa-dosa mereka yang menjadikan demikian, dan tidaklah mereka mengatakan demikian kecuali karena sebab kerasnya hati kebanyakan dari mereka, serta jauhnya mereka dari Allah dan syariat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan keadaan makhluk-Nya, bahwa mereka di samping memperoleh nikmat yang banyak itu, jika sekiranya Allah mengirimkan angin besar yang menimpa tumbuhan-tumbuhan mereka yang baru tumbuh hasil siraman hujan itu, lalu mereka melihatnya menjadi kuning. Mereka akan lupa terhadap nikmat-nikmat yang lalu dan segera kufur kepada nikmat-Nya. Mereka itu, sebagaimana diterangkan dalam ayat selanjutnya, tidak berguna lagi nasehat dan larangan seperti orang-orang yang mati yang tidak mungkin mendengarkan pelajaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 51",
    "description": "Usai menjelaskan rahmat-Nya yang berupa hujan Allah bersumpah, 'sungguh jika kami mengirimkan angin panas yang memicu bencana lalu sawah ladang mereka terbakar karenanya sehingga mereka melihat tumbuh-tumbuhan dan buah-buahan di kebun itu yang semula segar berubah menjadi kuning, kering, dan layu, pasti setelah itu mereka tetap dan terus ingkar kepada Allah. Inilah gambaran orang yang meletakkan ukuran kebahagiaannya pada hal-hal yang bersifat materi sehingga jiwanya terombang-ambing oleh keadaan yang menimpanya. 52. Wahai nabi Muhammad, demikianlah perilaku orang kafir, maka janganlah engkau bersedih karena sungguh, engkau tidak akan sanggup menjadikan mereka bisa mendengar ajaran agama, layaknya orang-orang yang mati itu juga tidak dapat mendengar, dan engkau juga tidak mampu menjadikan orang kafir yang serupa orang-orang yang tuli dapat mendengar seruan kebenaran, apabila mereka berpaling ke belakang meninggalkanmu. Padahal, orang tuli sekalipun bisa memahami penjelasan orang lain melalui gerakan mulut jika ia mau menghadap ke arahnya."
  }
]