[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kamu (wahai Rasul), tidak bisa memperdengarkan orang yang mati hatinya atau tertutup telinganya sehingga dia tidak bisa mendengar kebenaran. Jangan berduka dan jangan bersedih manakala orang-orang musyrik tersebut idak beriman, karena mereka itu seperti orang-orang yang tuli dan orang-orang yang mati yang tidak bisa mendengar dan tidak merasa sekalipun mereka ada, lalu bagaimana bila mereka tidak hadir di sisimu dan berpaling darimu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan sebagaimana kamu tidak bisa menjadikan orang-orang yang sudah meninggal itu mendengar, kamu tidak bisa menjadikan orang tuli mendengar, bahkan mereka menjauh darimu untuk memastikan bahwa mereka memang tidak bisa mendengar; demikian pula engkau tidak bisa memberi petunjuk kepada orang-orang yang semisal mereka, karena mereka menghindar dan tidak mengambil manfaat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52-53. Hai Rasulullah, kamu tidak akan mampu menjadikan orang yang mati hatinya dapat mendengar dengan penuh penghayatan, dan tidak dapat menjadikan orang yang tuli dapat mendengar ajakanmu menuju kebenaran jika mereka berpaling dari mendengar dan memahaminya. Dan kamu tidak akan mampu memberi hidayah dari kesesatan kepada orang yang buta hatinya dan kamu tidak akan mampu menjadikan orang lain mendengar dengan seksama melainkan bagi orang-orang yang beriman kepada ayat-ayat yang Kami turunkan dan mukjizat-mukizat yang dapat disaksikan, merekalah orang-orang yang mentaati perintah Kami. Ibnu Umar berkata, Rasulullah pernah berdiri di atas sumur Badar seraya bersabda: “Apakah kalian mendapati janji Allah itu benar?” Lalu beliau melanjutkan: “Sungguh saat ini mereka mendengar apa yang aku katakan.” Kemudian hal ini disampaikan kepada ‘Aisyah, maka ia berkata, Sesungguhnya yang Rasulullah katakan adalah: “Sungguh mereka saat ini mengetahui apa yang aku katakan dahulu adalah benar.” Lalu ‘Aisyah membaca ayat (فإنك لا تسمع الموتى...) hingga akhir ayat. (Shahih al-Bukhari 351 no. 3980, 3981 -kitab al-Maghazi, bab terbunuhnya Abu Jahal)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. فَإِنَّكَ لَا تُسْمِعُ الْمَوْتَىٰ (Maka Sesungguhnya kamu tidak akan sanggup menjadikan orang-orang yang mati itu dapat mendengar) Jika kamu memanggil mereka. Demikian juga dengan mereka, akibat ketidaktahuan mereka terhadap kebenaran. وَلَا تُسْمِعُ الصُّمَّ الدُّعَآءَ(dan menjadikan orang-orang yang tuli dapat mendengar seruan) Jika kamu menyeru mereka kepada kebenaran dan memperingati mereka dengan peringatan dari Allah. إِذَا وَلَّوْا۟ مُدْبِرِينَ(apabila mereka itu berpaling membelakang) Yakni berpaling dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Wahai Nabi, sesungguhnya kamu tidak akan bisa menjadikan orang-orang yang mati hatinya itu mendengar dengan merenung dan mengambil pelajaran. Kamu juga tidak akan bisa menjadikan orang tuli itu mendengar dakwahmu menuju kebenaran. Dengan seketika, mereka bertebaran menolak untuk mendengar dan memahami (dakwahmu). Maksudnya orang-orang kafir itu sudah seperti orang mati dan orang tuli"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kamu tidak bisa menjadikan orang-orang yang mati dan orang-orang yang tuli dapat mendengar seruan apabila mereka berpaling ke belakang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “maka sesungguhnya kamu tidak akan sanggup menjadikan orang-orang yang mati itu mendengar, dan menjadikan orang-orang yang tuli dapat mendengar seruan,” terutama, “apabila mereka itu berpaling membelakang,” sebab sesungguhnya penghalang-penghalang untuk tunduk dan mendengar dengan baik sudah sangat banyak pada mereka, seperti lengkapnya penghalang-penghalang yang tersebut di atas dari mendengar suara yang indarawi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 52: Ketahuilah wahai Nabi Allah, sungguh engkau tidak akan mampu menjadikan mereka menjawab ketika engkau menyeru kepada mereka, karena orang-orang musyrik seperti mayit, maka janganlah bersedih akan hal itu, engkau juga tidak akan dapat membuat mereka mendengar meskipun seandainya engkau meladeni mereka, karena sebab mereka orang-orang musyrik adalah tuli yang tidak mendengar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang-orang kafir itu disamakan Allah dengan orang-orang mati yang tidak mungkin lagi mendengarkan pelajaran-pelajaran. Demikian pula disamakan dengan orang-orang tuli yang tidak bisa mendengar panggilan sama sekali, terlebih apabila mereka sedang membelakangi kita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 52",
    "description": "Wahai nabi Muhammad, demikianlah perilaku orang kafir, maka janganlah engkau bersedih karena sungguh, engkau tidak akan sanggup menjadikan mereka bisa mendengar ajaran agama, layaknya orang-orang yang mati itu juga tidak dapat mendengar, dan engkau juga tidak mampu menjadikan orang kafir yang serupa orang-orang yang tuli dapat mendengar seruan kebenaran, apabila mereka berpaling ke belakang meninggalkanmu. Padahal, orang tuli sekalipun bisa memahami penjelasan orang lain melalui gerakan mulut jika ia mau menghadap ke arahnya. 53. Dan begitupun engkau tidak akan dapat memberi petunjuk kepada orang-orang yang buta mata hatinya dari kesesatannya karena hidayah yang disertai taufik itu hanya milik Allah. Karena itu, wahai nabi Muhammad, engkau tidak dapat memperdengarkan petunjuk tuhan kepada mereka, kecuali kepada orang-orang yang beriman dengan ayat-ayat kami, maka mereka itulah orang-orang yang senantiasa berserah diri dengan senantiasa tunduk dan patuh pada perintah dan larangan kami."
  }
]