[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah Kamu (wahai Rasul) bisa membimbing orang yang Allah butakan dari jalan hidayah, dan kamu tidak bisa memperdengarkan dengan pendengaran untuk mengambil manfaat, kecuali orang yang beriman kepada ayat-ayat Kami, karena mereka adalah orang-orang yang tunduk dan melaksanakan perintah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan engkau bukanlah orang yang mampu memberi petunjuk kepada orang yang sesat dari jalan yang lurus agar melangkah pada jalan yang benar, engkau tidak mampu menjadikan mereka mendengar sesuatu yang bermanfaat bagi mereka kecuali orang-orang yang beriman kepada ayat-ayat Kami, karena merekalah yang bisa mengambil manfaat dari apa yang engkau ucapkan, dan mereka itu patuh kepada perintah Kami serta tunduk padanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَمَآ أَنتَ بِهٰدِ الْعُمْىِ عَن ضَلٰلَتِهِمْ ۖ (Dan kamu sekali-kali tidak akan dapat memberi petunjuk kepada orang-orang yang buta (mata hatinya) dari kesesatannya) Sebab mereka tidak memanfaatkan penglihatan mereka sebagaimana seharusnya, atau tidak menggunakan mata hati mereka. إِن تُسْمِعُ إِلَّا مَن يُؤْمِنُ بِـَٔايٰتِنَا(Dan kamu tidak dapat memperdengarkan (petunjuk Tuhan) melainkan kepada orang-orang yang beriman dengan ayat-ayat Kami) Sebab mereka adalah orang-orang yang mau memikirkan dan memperhatikan suatu penciptaan yang menunjukkan pada Penciptanya. فَهُم مُّسْلِمُونَ(mereka itulah orang-orang yang berserah diri (kepada Kami)) Yakni mentaati dan mengikuti kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Kamu juga bukan pemberi petunjuk orang buta dan pencegah mereka dari kesesatan. Mereka disebut buta karena mereka kehilangan tujuan hakiki dari penglihatan. Kamu tidak bisa menjadikan orang untuk menyimak dan menerima ayat-ayat Al-Qur’an Kami kecuali orang-orang mukmin. Mereka adalah orang yang patuh dan tunduk kepada perintah Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu bukanlah pemberi petunjuk bagi orang-orang yang buta dari kesesatannya. Kamu tidak dapat menjadikan mendengar, kecuali orang yang beriman pada ayat-ayat Kami dan mereka berserah diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53 “dan kamu sekali-kali tidak akan dapat memberi petunjuk kepada orang-orang yang buta dari kesesatannya,” karena mereka tidak menerima pencerahan disebabkan kebutaan mereka. Jadi tidak ada celah untuk menerima petunjuk itu, ”dan kamu tidak dapat memperdengarkan melainkan kepada orang-orang yang beriman kepada ayat-ayat kami, mereka itulah orang-orang yang berserah diri.” Merekalah orang-orang yang mana (tindakan) memperdengarkan petunjuk itu berguna bagi mereka, yaitu orang-orang yang beriman dengan hati mereka kepada ayat-ayat kami, yang tunduk kepada perintah-perintah kami, yang berserah diri kepada kami. Sebab, pada mereka terdapat potensi yang kuat untuk menerima nasihat dan arahan; yaitu kesiapan mereka untuk beriman kepada setiap ayat dari ayat-ayat Allah, dan kesiapan mereka untuk melaksanakan apa yang mampu mereka lakukan berupa perintah-perintah Allah dan larangan-laranganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 53: Kemudian Allah mengarahkan pembicaraan-Nya kepada Nabi ﷺ untuk menghiburnya dan berkata : Ketahuilah wahai Nabi Allah sungguh engkau tidak akan mampu akan urusan hidayah dan memberi petunjuk kepada orang yang buta dari kesesatan mereka; Karena sebab mereka tidak menerima kebenaran ilmu, karena sebab hati mereka terkunci, inilah Al Qur’an yang diturunkan oleh Allah tidak akan dapat mereka mendengarkannya dengan pendengaran yang menjadikan manfaat dan hidayah kecuali bagi orang yang beriman dan membenarkan ayat-ayat Allah, karena sebab mereka adalah orang-orang yang berserah diri dan melaksanakan perintah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebabkan kebutaan mata hatinya itu. Kepada merekalah bermanfaat memperdengarkan petunjuk, mereka mengimani ayat-ayat Allah dengan hati mereka, tunduk mengerjakan perintah-Nya lagi berserah diri kepada-Nya. Hal itu, karena pada mereka terdapat pendorong yang kuat untuk menerima nasehat dan pelajaran, yaitu kesiapan mereka beriman kepada setiap ayat Allah dan kesiapan mereka untuk melaksanakan perintah Allah yang mampu mereka lakukan. Dengan mentauhidkan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 53",
    "description": "Dan begitupun engkau tidak akan dapat memberi petunjuk kepada orang-orang yang buta mata hatinya dari kesesatannya karena hidayah yang disertai taufik itu hanya milik Allah. Karena itu, wahai nabi Muhammad, engkau tidak dapat memperdengarkan petunjuk tuhan kepada mereka, kecuali kepada orang-orang yang beriman dengan ayat-ayat kami, maka mereka itulah orang-orang yang senantiasa berserah diri dengan senantiasa tunduk dan patuh pada perintah dan larangan kami. 54. Ayat ini menjelaskan bahwa manusia itu saat masih bayi berada dalam kondisi lemah, bahkan sebelum itu mereka dalam ketiadaan. Allah-lah yang menciptakan kamu dari keadaan lemah, yakni pada masa bayi. Kemudian dia menjadikan kamu setelah keadaan lemah itu menjadi kuat dan berdaya, yakni pada masa dewasa, sehingga kamu dapat melakukan banyak hal, kemudian dia menjadikan kamu setelah kuat dan berdaya itu lemah kembali dan beruban, yakni masa tua. Demikianlah, dia akan terus menciptakan apa yang dia kehendaki, antara lain menciptakanmu dari lemah menjadi kuat dan sebaliknya. Dan dia maha mengetahui atas segala pengaturan ciptaan-Nya, mahakuasa atas segala sesuatu yang dia kehendaki, termasuk membangkitkanmu kembali dari kematian."
  }
]