[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah Yang menciptakan kalian dari air yang lemah lagi hina dina, yaitu sperma, kemudian setelah sebelumnya kalian lemah sebagai anak-anak, Dia memberi kalian kekuatan lelaki, kemudian setelah kekuatan ini hadirlah kelemahan masa tua dan senja. Allah menciptakan apa yang Dia kehendaki berupa kelemahan dan kekuatan. Dia-lah yang Maha Mengetahui makhlukNya, yang juga Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Allah lah yang menciptakan kalian -wahai manusia- dari air yang hina, kemudian Dia merubah masa kecil kalian yang lemah menjadi orang dewasa yang kuat, lalu mengembalikan masa dewasa kalian yang kuat itu menjadi masa tua yang lemah. Allah menciptakan lemah dan kuat sekehendak-Nya dan Dia Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari-Nya dan Dia Mahakuasa, tidak ada sesuatu pun yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Hai manusia, Allah menciptakan kalian dari air mani, kemudian menjadikan kekuatan masa muda setelah kelemahan masa kanak-kanak, lalu menjadikan kelemahan masa tua dan beruban setelah kekuatan masa muda. Allah menciptakan kelemahan dan kekuatan sesuai kehendak-Nya, Dia Maha Mengetahui hamba-hamba-Nya dan Maha Kuasa melakukan apa yang Dia kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. اللهُ الَّذِى خَلَقَكُم مِّن ضَعْفٍ (Allah, Dialah yang menciptakan kamu dari keadaan lemah) Ini merupakan perumpamaan lainnya yang dibuat Allah sebagai tanda atas kesempurnaan kuasa Allah, yaitu penciptaan manusia itu sendiri dengan tahap-tahap yang berbeda. Dan makna ‘dari keadaan lemah’ yakni dari bentuk air mani. Dan pendapat lain mengatakan maknanya adalah masa bayi dan kecil. ثُمَّ جَعَلَ مِنۢ بَعْدِ قُوَّةٍ ضَعْفًا (kemudian Dia menjadikan (kamu) sesudah kuat itu lemah) Yakni saat telah mencapai lanjut usia. وَشَيْبَةً ۚ( dan beruban) Makna (الشيبة) yakni benar-benar lemah. يَخْلُقُ مَا يَشَآءُ ۖ( Dia menciptakan apa yang dikehendaki-Nya) Dari segala sesuatu, termasuk keadaan kuat dan lemah pada manusia. وَهُوَ الْعَلِيمُ (dan Dialah Yang Maha Mengetahui) Dalam pengaturan-Nya. الْقَدِيرُ (lagi Maha Kuasa) Dalam menciptakan apa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Allah adalah Dzat yang menjadikan kalian orang-orang lemah (dan berfirman: “Dari kelemahan, sehingga kelemahan itu menjadi dasar penciptaan kalian”). Karena kelemahan itu adalah awal mula penciptaan(mu) dari sperma kemudian menjadikan(mu) sebagai remaja yang kuat setelah lemahnya masa kanak-kanak, lalu menjadikanmu orang tua yang lemah dan beruban setelah kuat. Allah menciptakan sesuatu yang dikehendaki berupa kelemahan, kekuatan, masa muda dan masa tua. Dialah Dzat yang Maha Mengetahui makhluknya dan Maha Kuasa atas sesuatu yang dikehendaki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah adalah Dzat yang menciptakan kalian dari keadaan lemah} air mani yang hina {kemudian Dia menjadikan kuat setelah keadaan lemah itu} setelah lemah di masa anak-anak menjadi kuat di masa dewasa {Lalu Dia menjadikan setelah keadaan kuat itu menjadi lemah dan beruban} lemah di masa tua dan beruan ketuaan {Dia menciptakan apa yang Dia kehendaki. Dia Maha Mengetahui lagi Maha kuasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Allah menginformasikan tentang keluasan ilmuNya, keagungan kekuasaanNya, dan kesempurnaan hikmahNya, dan bahwa sesungguhnya Dia telah memulai penciptaan manusia dari keadaan lemah, yaitu fase-fase pertama dari penciptannya dari sperma menjadi segumpal darah, lalu menjadi segumpal daging hingga menjadi hewan hidup di dalam Rahim, lalu hingga dilahirkan sedangkan dia berada pada usia anak-anak. Dan dia pada saat itu berada dalam puncak kelemahan, tidak memilki kekuatan dan kemampuan. Kemudian Allah terus menambahnya makin kuat sedikit demi sedikit hingga mencapai usia remaja dan kekuatannya pun menjadi sempurna, kekuatan lahir dan batinnya menjadi sempurna pula. Kemudian dia berpindah dari fase ini dan kembali kepada kelemahan, masa beruban dan tua renta. “Dia menciptakan apa yang dikehendakiNya,” sesuai hikmahNya. Dan diantara hikmahNya adalah Dia memperlihatkan kepada manusia kelemahannnya, dan sesunguhnya kekuatannya diliputi dengan dua kelemahan, dan bahwa sesungguhnya dia tidak memilki dari dirinya kecuali kekurangan. Kalau saja bukan karena Allah menjadikannya kuat, tentu dia tidak akan pernah mencapai pada suatu kekuatan dan kemampuan. Dan kalau seandainya kekuatannya terus bertambah, niscaya dia congkak, sombong dan melampaui batas. Dan hendaknya manusia mengetahui kesempurnaan kekuasaan Allah yang terus-menerus bertambah, dengannya Dia menciptakan segala sesuatu dan dengannya Dia mengatur segala urusan. kekuatanNya tidak pernah ditimpa ketidakberdayaan, kelemahan ataupun kekurangan dari segala sisinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 54: Kemudian Allah memberikan permisalan tahapan penciptaan manusia seperti tnda-tanda yang menunjukkan atas keagungan kuasa Allah; Maka Allah menjelaskan bahwasanya Dia menciptakan manusia pertama kalinya dari mani yang hina, kemudian keluar dari Rahim ibunya dengan keadaan lemah, kemudianmenjadi anak kecil, lalu menjadi pemuda yang kuat dan dapat berkerja untuk menafkahi dirinya sendiri beserta yang ia tanggung (nafkahnya), kemudian menjadi seorang syaikh (sepuh) yang lemah sampai akhir umurnya, dia menjadi lemah sebagaimana anak-anak dari banyaknya segala kuasanya (ketika masih muda). Kemudian Allah menjelaskan bahwasanya Dialah yang menciptakan sesuai kehendak-Nya dari urusan lemah dan kuatnya manusia, semua itu dengan ilmu dan kuasa Allah serta penjagaan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang luasnya ilmu-Nya, besarnya kemampuan-Nya dan sempurnanya hikmah-Nya, di mana Dia menciptakan manusia dari keadaan yang lemah, yakni tahapan pertama penciptaannya, yaitu mani yang selanjutnya berubah menjadi segumpal darah dan berubah menjadi segumpal daging sampai menjadi makhluk hidup dalam rahim, selanjutnya ia dilahirkan dan menjadi kanak-kanak. Setelah itu, kekuatannya semakin bertambah hingga tiba usia muda, dewasa, dan usia seorang bapak di mana keadaan lahir dan batinnya telah sempurna. Setelah tahapan ini dilalui, maka ia sedikit demi sedikit menjadi lemah kembali; tua, beruban dan pikun. Yaitu air mani yang hina. Yakni masa kanak-kanak. Pemuda. Karena sudah tua. Sesuai kebijaksanaan-Nya. Termasuk kebijaksanaan-Nya adalah Dia memperlihatkan kepada hamba-hamba-Nya kekuatan mereka yang diliputi oleh dua kelemahan; ketika kecil dan ketika sudah tua, di mana hal ini menunjukkan kekurangannya. Jika bukan karena penguatan dari Allah Subhaanahu wa Ta'aala, tentu dia tidak akan sampai pada usia kuat dan memiliki kemampuan. Di samping itu, jika kekuatannya semakin bertambah, tentu dia akan bersikap sombong dan melampuai batas serta berbuat yang semena-mena. Selain itu, agar manusia mengetahui sempurnanya kemampuan Allah Subhaanahu wa Ta'aala yang senantiasa kekal, di mana dengan kemampuan-Nya Dia menciptakan segala sesuatu, mengatur segala urusan tanpa merasakan kelemahan dan kelelahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 54",
    "description": "Ayat ini menjelaskan bahwa manusia itu saat masih bayi berada dalam kondisi lemah, bahkan sebelum itu mereka dalam ketiadaan. Allah-lah yang menciptakan kamu dari keadaan lemah, yakni pada masa bayi. Kemudian dia menjadikan kamu setelah keadaan lemah itu menjadi kuat dan berdaya, yakni pada masa dewasa, sehingga kamu dapat melakukan banyak hal, kemudian dia menjadikan kamu setelah kuat dan berdaya itu lemah kembali dan beruban, yakni masa tua. Demikianlah, dia akan terus menciptakan apa yang dia kehendaki, antara lain menciptakanmu dari lemah menjadi kuat dan sebaliknya. Dan dia maha mengetahui atas segala pengaturan ciptaan-Nya, mahakuasa atas segala sesuatu yang dia kehendaki, termasuk membangkitkanmu kembali dari kematian. 55. Pada hari kebangkitan orang yang dahulu banyak berbuat dosa bersumpah dengan sungguh-sungguh, meski sejatinya hanya sumpah palsu. Dan pada hari ketika terjadinya kiamat, orang-orang yang berdosa bersumpah dengan penuh kesungguhan bahwa mereka berdiam dalam kubur hanya sesaat saja. Begitulah dahulu ketika di dunia mereka dipalingkan dari kebenaran karena kebiasaan mereka berbohong."
  }
]