[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saat Hari Kiamat tiba, Allah membangkitkan makhluk-makhluk dari kubur mereka. Saat itu orang-orang musyrik bersumpah bahwa mereka tidak tinggal di bumi kecuali dalam waktu yang pendek. Mereka berdusta dalam sumpah mereka sebagaimana mereka juga telah berdusta di dunia dan mereka mengingkari kebenaran yang dibawa para rasul kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan pada saat terjadinya hari Kiamat, para pendosa itu bersumpah bahwa mereka tidaklah tinggal di dalam kuburan mereka kecuali hanya sesaat saja. Sebagaimana mereka dipalingkan dari pengetahuan tentang berapa lama mereka tinggal di alam kubur, demikian pula mereka dipalingkan dari kebenaran saat di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Allah mengabarkan keadaan orang-orang yang senantiasa melakukan dosa di hari kiamat, bahwa mereka bersumpah tidak hidup di dunia melainkan sebentar saja. Dengan sumpah dusta seperti itulah mereka dahulu bersumpah di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَيَوْمَ تَقُومُ السَّاعَةُ (Dan pada hari terjadinya kiamat) Terdapat pendapat mengatakan bahwa hari kiamat disebut dengan الساعة (waktu) sebab hari kiamat terjadi pada waktu yang paling akhir yang ada di dunia. يُقْسِمُ الْمُجْرِمُونَ مَا لَبِثُوا۟ غَيْرَ سَاعَةٍ ۚ( bersumpahlah orang-orang yang berdosa; “mereka tidak berdiam (dalam kubur) melainkan sesaat (saja)”) Yakni mereka bersumpah bahwa mereka tidak tinggal di dunia atau di alam kubur lebih dari sesaat saja. Mereka menganggap masa tinggal mereka sangat cepat dan itulah yang tertanam dalam fikiran mereka sehingga mereka bersumpah atas hal itu. Pendapat lain mengatakan bahwa mereka berdusta dalam pengakuan mereka tentang masa tinggal mereka, sebagaimana mereka telah banyak berdusta sebelumnya. كَذٰلِكَ كَانُوا۟ يُؤْفَكُونَ (Seperti demikianlah mereka selalu dipalingkan (dari kebenaran)) Yakni seperti perpalingan ini mereka dahulu berpaling dari kebenaran. Dan ini merupakan dalil bahwa sumpah mereka itu dusta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Pada hari terjadinya kiamat, orang-orang jahat itu bersumpah bahwa mereka tidak berdiam di dunia kecuali hanya dalam jangka waktu sebentar atau sesaat. Demikianlah mereka enggan mengetahui masa tinggal mereka. Di dunia, mereka menolak kebenaran, yaitu hari kebangkitan dan hal lain seperti membicarakan kebenaran dan kejujuran. Penolakan mereka terhadap kebenaran itu layaknya setan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) terjadi kiamat} kiamat {orang-orang yang durhaka bersumpah} bersumpah {bahwa mereka tidak berdiam} tidak tinggal dalam kubur mereka {kecuali hanya sesaat} kecuali hanya sesaat {Begitulah mereka dipalingkan} mereka dipalingkan dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Allah mengabarkan tentang hari kiamat dan cepatnya (masa) kedatangannya, dan sesungguhnya kiamat itu kalau sudah terjadi, maka bersumpahlah “orang-orang yang berdosa,” dengan nama Allah bahwasannya “mereka tidak berdiam,” di dunia “melainkan sesaat saja,” itu adalah suatu alasan dari mereka, barangkali udzur itu bisa berguna bagi mereka, dan perasaan sangat singkatnya masa tinggal di dunia. Tatkala perkataan mereka adalah dusta, tidak ada benarnya, maka Allah berfirman, ”seperti demikianlah mereka selalu dipalingkan,” maksudnya, saat berada di dunia mereka terus menerus berpaling dari kebenaran dan kenyataan dan selalu berbuat dusta. Di dunia mereka mendustakan kebenaran yang dibawa oleh para rasul, dan di akhirat mereka mengingkari perkara yang indrawi, yaitu berdiam cukup lama di dunia. Inilah karakter busuk mereka. Jadi, seorang itu akan dibangkitkan kembali sesuai dengan (kondisi) dia mati dahulu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 55: Pada hari kiamat yang akan segera mendatangi orang-orang musyrik dengan cepat datangnya kemudian mereka bersumpah tidaklah datang hari kiamat kepada mereka di dunia, tujuan mereka adalah agar mendapatkan udzur dan agar menjadikan udzur tersebut bermanfaat bagi mereka. Sungguh mereka telah berbohong akan hal itu, karena mereka masih dalam keadaan tetap tersesat dan mereka berdusta sebagaimana ketika di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang kafir. Ini adalah pengajuan uzur mereka dengan maksud agar permohonan maaf mereka diterima. Maksudnya, sebagaimana mereka di dunia dipalingkan dari kebenaran dan malah berkata dusta, mereka mendustakan yang hak yang dibawa para rasul, sehingga di akhirat mereka juga dipalingkan dari perkataan yang hak (benar) tentang lama tinggal mereka di kubur, mereka mengingkari perkara yang dapat dirasakan, yaitu lamanya tingga di dunia, dan seorang hamba nanti akan dibangkitkan sesuai keadaan yang dia pegang sampai matinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 55",
    "description": "Pada hari kebangkitan orang yang dahulu banyak berbuat dosa bersumpah dengan sungguh-sungguh, meski sejatinya hanya sumpah palsu. Dan pada hari ketika terjadinya kiamat, orang-orang yang berdosa bersumpah dengan penuh kesungguhan bahwa mereka berdiam dalam kubur hanya sesaat saja. Begitulah dahulu ketika di dunia mereka dipalingkan dari kebenaran karena kebiasaan mereka berbohong. 56. Dan orang-orang yang diberi ilmu dan keimanan berkata kepada orang kafir dalam rangka menanggapi sumpah mereka itu, 'sungguh, kamu telah berdiam dalam kubur menurut ketetapan Allah sampai hari kebangkitan. Maka inilah saatnya hari kebangkitan itu, tetapi dahulu kamu tidak pernah mau meyakini-Nya. '."
  }
]