[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang berilmu dan beriman kepada Allah, dari kalangan malaikat-malaikat, para nabi dan orang-orang yang beriman berkata, “Sungguh kalian telah tinggal sesuai dengan apa yang ditulis oleh Allah berdasarkan ilmuNya yang terdahulu sejak hari di mana kalian diciptakan sampai kalian dibangkitkan, maka inilah hari kebangkitan itu, akan tetapi kalian tidak mengetahui, sehingga kalian mengingkarinya di dunia dan mendustakannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan di antara para Nabi dan Malaikat yang telah diberi ilmu oleh Allah berkata, “Dan sungguh kalian telah tinggal (di alam kubur) selama masa yang telah ditentukan oleh Allah dalam ilmu-Nya yang telah ada sebelumnya, dari mulai penciptaan kalian hingga kebangkitan kalian yang telah kalian ingkari, akan tetapi kalian tidak mengetahui bahwa kebangkitan itu benar-benar terjadi, sehingga kalian mengingkarinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Maka orang-orang beriman yang berilmu membantah mereka: “Sungguh kalian telah tinggal sesuai apa yang tercantum dalam Lauhul mahfudz hingga hari kebangkitan kalian dari kubur. Dan inilah hari kebangkitan yang dahulu kalian dustakan dan dahulu kalian tidak mengetahui bahwa itu adalah kebenaran yang pasti terjadi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَقَالَ الَّذِينَ أُوتُوا۟ الْعِلْمَ وَالْإِيمٰنَ (Dan berkata orang-orang yang diberi ilmu pengetahuan dan keimanan) Terdapat pendapat mengatakan bahwa mereka yang mengatakan ini adalah para malaikat. Pendapat lain mengatakan mereka adalah para nabi. Dan pendapat lain mengatakan bahwa mereka adalah para ulama dari setiap umat dan orang-orang yang beriman dari mereka. لَقَدْ لَبِثْتُمْ(Sesungguhnya kamu telah berdiam (dalam kubur)) Dalam kehidupan kalian dan dalam kubur kalian. فِى كِتٰبِ اللهِ(menurut ketetapan Allah) Yakni dalam ilmu Allah yang tercantum dalam Lauhul Mahfudh. إِلَىٰ يَوْمِ الْبَعْثِ ۖ فَهٰذَا (sampai hari berbangkit; maka inilah) Yakni inilah waktu yang kalian hadapi ini adalah. يَوْمُ الْبَعْثِ وَلٰكِنَّكُمْ كُنتُمْ لَا تَعْلَمُونَ (hari berbangkit itu akan tetapi kamu selalu tidak meyakini(nya)”) Tidak meyakini bahwa ini adalah benar. Dan kalian dahulu selalu ingin menyegerakannya karena mengingkarinya dan untuk mengejeknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Orang yang berilmu dan beriman, yaitu para malaikat dan para nabi berkata: “Sungguh kalian tinggal di tempat sesuai ketetapan Allah yang sebelumnya telah tertulis di lauhil mahfudz sampai hari kebangkitan dari kubur dan ini adalah hari kebangkitan. Akan tetapi kalian tidak mengetahui bahwa itu adalah kebenaran yang terjadi karena kalian memalingkan pandangan”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang diberi ilmu dan iman berkata ,“Sungguh kamu benar-benar telah berdiam sesuai ketetapan Allah} ilmu Allah yang ditetapkan di Lauhil Mahfudz {sampai hari kebangkitan. Maka inilah hari kebangkitan itu, tetapi dahulu kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. “dan berkatalah orang-orang yang diberi ilmu pengetahuan dan keimanan.” Maksudnya, orang-orang dikaruniai dua hal itu menjadi sifat mereka. Yaitu ilmu pengetahuan tentang yang benar dan iman yang membuahkan sikap lebih mengutamakan yang benar. Dan apabila mereka adalah orang-orang yang mengetahui yang benar dan mengutamakannya, maka pasti perkataan mereka sesuai dengan realita, sejalan dengan keadaan mereka. Maka dari itu mereka mengatakan yang haq (yang benar), “sesungguhnya kamu telah berdiam menurut kepada Allah,” maksudnya, menurut qadha dan takdir Allah yang telah dicatatNya atas kalian dan di dalam keputusanNya, kalian telah diberi usia yang mana orang yang mau memikirkannya, dan orang yang mau mengambil pelajaran dapat mengambil pelajaran hingga terjadilah kebangkitan, dan kalianpun telah mencapai kepada keadaan ini. “maka inilah hari berbangkit itu, akan tetapi kamu selalu mengetahui” maka dari itu kalian mengingkarinya di dunia, dan kalian mengingkari kalau kalian telah tinggal di dunia dalam waktu yang cukup bagi kalian untuk berinabah dan bertaubat. Namun kebodohan terus menjadi slogan kalian, dan akibatnya pendustaan dan kerugian menjadi selimut kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 56: Allah mengabarkan siapa yang telah Allah beri karunia bagi mereka dengan ilmu dan iman kepada Allah, mereka orang-orang yang berilmu berkata kepada orang-orang yang mendustakan : Sungguh kalian telah tinggal di kehidupan dunia dan di kubur kalian dalam tempo yang telah Allah tetapkan (di lauhul mahfudz) sampai hari kebangkitan, yaitu waktu yang telah kalian lalui adalah cukup jika saja kalian mengetahui (sebagaiaman Allah berakata dalam surat Al Fathir : 37). Kemudian Allah berkata : Inilah hari kebangkitan yang kalian saksikan sekarang dengan mata-mata kalian wahai para pengingkar, akan tetapi kalian tidak membenarkan bahwa kebangkitan adalah sebuah kebenaran; Bahkan kalian telah mendustakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah mengaruniakan kepada mereka ilmu dan keimanan, sehingga mereka disifati sebagai orang yang berilmu dan beriman, mereka tahu yang hak dan mengutamakannya karena keimanan mereka. Oleh karena mereka tahu yang hak dan mengutamakannya, maka ucapan mereka pun sesuai dengan kenyataan dan sejalan dengan keadaan mereka. Karenanya, mereka berkata yang benar, seperti yang disebutkan dalam ayat di atas. Yakni qadha’ dan qadar-Nya yang ditetapkan-Nya untuk kamu. Maksudnya sampai waktu di mana biasanya manusia sadar dan berpikir serta bersikap bijaksana, dan seterusnya sampai tiba hari berbangkit. Yang kamu ingkari. Oleh karena ketidaktahuan kamu itu, kamu mengingkarinya di dunia, kamu mengingkari waktu kamu tinggal di dunia, padahal pada waktu tersebut kamu bisa kembali dan bertobat, tetapi ketidaktahuan menjadi ciri khasmu, di mana pengaruhnya adalah membuat kamu mendustakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 56",
    "description": "Dan orang-orang yang diberi ilmu dan keimanan berkata kepada orang kafir dalam rangka menanggapi sumpah mereka itu, 'sungguh, kamu telah berdiam dalam kubur menurut ketetapan Allah sampai hari kebangkitan. Maka inilah saatnya hari kebangkitan itu, tetapi dahulu kamu tidak pernah mau meyakini-Nya. '57. Apabila hari kebangkitan itu datang maka pada hari itu tidak bermanfaat lagi permintaan maaf orang-orang yang zalim agar mereka terbebas dari balasan kezaliman mereka, dan mereka tidak pula diberi kesempatan bertobat lagi dari dosa yang mereka lakukan meski mereka merengek kepada Allah agar diberi kesempatan sekali lagi (lihat pula: f''ir/35: 37)."
  }
]