[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di Hari Kiamat, alasan-alasan yang diberikan oleh orang-orang zhalim tidak berguna bagi mereka, mereka tidak lagi dituntut untuk taat dan bertaubat guna meraih ridha Allah, sebaliknya mereka dihukum karena perbuatan-perbuatan buruk dan kemaksiatan-kemaksiatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan pada hari di saat Allah membangkitkan para makhluk untuk perhitungan amal dan pembalasan, alasan-alasan yang dibuat-buat oleh orang-orang zalim tidak lagi bermanfaat bagi mereka, dan mereka tidak lagi dituntut untuk mencari keridaan Allah dengan cara bertobat dan kembali kepada-Nya, karena kesempatan untuk bertobat dan kembali kepada-Nya sudah habis."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Pada hari kiamat alasan orang-orang zalim tidak bermanfaat lagi bagi mereka, dan tidak akan dikatakan kepada mereka ‘Carilah keridhaan Tuhan kalian dengan bertaubat’."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. فَيَوْمَئِذٍ لَّا يَنفَعُ الَّذِينَ ظَلَمُوا۟ مَعْذِرَتُهُمْ (Maka pada hari itu tidak bermanfaat (lagi) bagi orang-orang yang zalim permintaan uzur mereka) Yakni permintaan uzut tidak bermanfaat lagi bagi mereka pada hari itu, dan keyakinan mereka tentang hari kiamat tidak lagi memberi mereka faedah. وَلَا هُمْ يُسْتَعْتَبُونَ(dan tidak pula mereka diberi kesempatan bertaubat lagi) Yakni mereka tidak diberikan kesempatan untuk menghilangkan kesalahan mereka dengan pertaubatan atau ketaatan, tidak seperti ketika mereka di dunia. Makna (الاستعتاب) yakni permintaan ridha dan kesepakatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Pada hari kiamat itu, tidak berguna lagi bagi orang-orang yang menzalimi diri mereka dengan berbuat kufur, permintaan uzur atas pengingkaran mereka terhadap hari kiamat. Dan tidak diharapkan dari mereka itu jalan kembali menuju hal yang diridhai Allah SWT berupa iman dan taubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari itu tidak berguna dalih orang-orang yang zalim} uzur mereka {dan mereka tidak pula diberi kesempatan untuk bertaubat lagi} mereka tidak dituntut untuk mencari ridha Allah dengan taat dan taubat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “maka hari itu tidak bermanfaat lagi orang-orang yang zhalim permintaan udzur mereka,” maka jika mereka telah mendustakan dan mereka mengklaim bahwa hujjah (penjelasan dan dalil yang jelas) belum ditegakkan terhadap mereka, atau mereka belum sempat beriman, maka kedustaan mereka terungkap dengan kesaksian para ahli ilmu dan iman, dan kesaksian kulit tubuh, kedua tangan kedua kaki mereka. Dan sekalipun mereka meminta udzur dan mereka dikembalikan dan mereka (berjanji) tidak akan kembali kepada apa yang dilarang, maka mereka tidak akan diberi kesempatan. Karena waktu mengajukan udzur telah berlalu, maka permohonan udzur mereka ditolak, “dan tidak pula mereka diberi kesempatan bertaubat lagi.” Maksudnya, permintaan kerelaan dan permohonan udzur dari mereka dihilangkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 57: Ketahuilah wahai orang-orang musyrik bahwasanya di hari kiamat tidak akan selamat orang yang mereka dzalim terhadap diri-diri mereka dengan kesyirikan dan melanggar batasan-batasan Allah dengan pengingkaran dan penolakan; Tidak ada pula udzur bagi mereka, tidak pula diterima taubat mereka, tidak juga mereka dituntut untuk rela dan kembali kepada Allah, karena telah usai zamannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, jika mereka mengatakan, bahwa hujjah belum tegak kepada mereka atau mereka tidak memungkinkan untuk beriman, maka jelas sekali kedustaan mereka berdasarkan persaksian ahli ilmu dan iman, demikian pula berdasarkan persaksian kulit, tangan dan kaki mereka nanti di akhirat. Jika mereka meminta kembali ke dunia, maka mereka tidak akan dikembalikan, karena waktu untuk meminta maaf telah hilang, sehingga permohonan maaf mereka tidak diterima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 57",
    "description": "Apabila hari kebangkitan itu datang maka pada hari itu tidak bermanfaat lagi permintaan maaf orang-orang yang zalim agar mereka terbebas dari balasan kezaliman mereka, dan mereka tidak pula diberi kesempatan bertobat lagi dari dosa yang mereka lakukan meski mereka merengek kepada Allah agar diberi kesempatan sekali lagi (lihat pula: f''ir/35: 37). 58-59. Beralih dari pemaparan mengenai bukti keesaan-Nya dan kebenaran risalah nabi Muhammad, pada ayat ini Allah menjelaskan sikap orang kafir. Dan sesungguhnya telah kami jelaskan kepada manusia segala macam perumpamaan dalam Al-Qur'an ini perihal bukti keesaan-ku, keniscayaan hari kebangkitan, dan kebenaran risalah nabi Muhammad. Meski begitu, jika engkau membawa suatu ayat yang lain kepada mereka, pastilah orang-orang kafir itu akan tetap berkata, 'kamu hanyalah orang-orang yang membuat kepalsuan belaka. Apa yang engkau bawa adalah sihir semata. ' demikianlah Allah mengunci hati orang-orang yang tidak mau memahami ayat Al-Qur'an yang dengan sangat jelas membuktikan keesaan-Nya dan keniscayaan hari kebangkitan."
  }
]