[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah menjelaskan kepada manusia segala perumpamaan di dalam al-Qur’an ini untuk menegakkan hujjah atas mereka dan menetapkan keesaan Allah. Bila kamu (wahai Rasul) datang kepada mereka dengan membawa hujjah apa pun yang membuktikan kebenaranmu, niscaya orang-orang yang kafir kepadamu akan berkata, “ tidaklah kalian (wahai Rasul dan orang-orang yang mengikutimu) kecuali hanyalah orang-orang pembawa kebatilan dalam perkara yang kalian bawa kepada kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan Kami telah memberi berbagai permisalan untuk manusia di dalam Al-Qur`ān ini -sebagai bentuk perhatian atas mereka- agar jelas bagi mereka kebenaran daripada kebatilan. Jika engkau -wahai Rasul- mendatangi mereka dengan bukti-bukti atas kebenaranmu, niscaya orang-orang yang ingkar terhadap Allah akan berkata, “Engkau tidak lain hanyalah seorang yang membuat kepalsuan belaka dengan apa yang engkau bawa itu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Sungguh Kami telah menjelaskan kebenaran kepada para hamba dalam al-Qur’an dan Kami telah menjelaskannya dengan berbagai perumpamaan, agar kebenaran menjadi jelas sehingga mereka dapat mengikutinya. Hai Rasulullah, sungguh jika kamu mendatangkan mukjizat yang membuktikan kebenaranmu kepada orang-orang kafir, niscaya mereka akan berkata: “Kalian hanya orang-orang yang berdusta dalam berkata.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِى هٰذَا الْقُرْءَانِ مِن كُلِّ مَثَلٍ ۚ (Dan Sesungguhnya telah Kami buat dalam Al Quran ini segala macam perumpamaan untuk manusia) Perumpamaan yang menunjukkan keesaan Allah dan kebenaran rasul-Nya. Dan Kami telah menegakkan hujjah atas mereka yang menunjukkan kebatilan perbuatan syirik mereka, sebagaimana yang Allah sebutkan dalam surat ini dengan berbagai macam bentuk dan cara, dan dengan dalil dan perumpamaan yang berbeda-beda. وَلَئِن جِئْتَهُم بِـَٔايَةٍ(Dan Sesungguhnya jika kamu membawa kepada mereka suatu ayat) Dari ayat-ayat al-Qur’an yang menunjukkan hal itu. لَّيَقُولَنَّ الَّذِينَ كَفَرُوٓا۟ إِنْ أَنتُمْ إِلَّا مُبْطِلُونَ(pastilah orang-orang yang kafir itu akan berkata: “Kamu tidak lain hanyalah orang-orang yang membuat kepalsuan belaka”) Yakni, hai Muhammad, kamu dan para sahabatmu tidak lain hanyalah pembuat kedustaan belaka yang mengikuti sihir dan yang semisalnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Sungguh dalam Al-Qur’an ini Kami telah jelaskan kepada manusia tentang banyak perumpamaan yang membimbing supaya (mereka) mengesakan dan mengimani Allah, Rasulallah, dan hari akhir. Wahai Nabi, jika kamu mendatangi orang-orang kafir dengan membawa mukjizat, maka sungguh karena sangat keras kepala dan keras hati, mereka akan berkata: “Wahai orang-orang mukmin, kalian tidak lain hanyalah orang-orang bathil, kalian mengikuti sihir dan hal semacamnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menjelaskan dalam Al-Qur’an ini segala macam perumpamaan kepada manusia. Sungguh jika kamu membawa suatu ayat} dalil yang jelas atas kebenaranmu {kepada mereka, sungguh orang-orang kafir itu akan berkata,“Kalian tidak lain kecuali hanya orang-orang yang berbuat bathil} kalian tidak lain kecuali orang-orang yang berbuat bathil yang diikuti oleh sihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58-59. “dan sesungguhnya telah kami buat perumpamaan,” karena perhatian, rahmat, kelembutan, dan kebaikan pengajaran kami “dalam al-qur’an ini segala macam perumpamaan untuk manusia,” dengannya berbagai pengetahuan (kebenaran) menjadi jelas, berbagai perkara dapat diketahui dan dengannya hujjah menjadi terputus. Ini umum dalam sebuah perumpamaan yang dibuat oleh Allah dalam rangka mempermudah persoalan yang logis dan yang empiric (nyata), dan di dalam menginformasikan tentang apa yang akan terjadi dan menjelaskan hakikatnya hingga seakan-akan ia telah terjadi. Di antaranya yang ada disini adalah penjelasan Allah tentang apa yang akan terjadi dihari kiamat dan keadaan orang-orang yang berdosa pada saat itu serta betapa dahsyatnya penyesalan mereka, dan bahwa sesungguhnya tidak ada udzur dan cercaan yang diterima dari mereka. Akan tetapi orang-orang kafir nan zhalim tidak mau kecuali sikap menentang kebenaran yang sangat jelas itu. Maka Allah berfirman,”dan sesungguhnya jika kamu membawa kepada mereka suatu ayat,” ayat apa saja yang membuktikan kebenaran ajaran yang engkau bawa, “pastilah orang-orang yang kafir itu berkata, ’kamu tidak lain hanyalah orang-orang yang membuat kepalsuan belaka’,” maksudnya, mereka mengatakan kepada kebenaran itu, “itu adalah kepalsuan,” ini semua karena kekafiran dan kelancangan mereka serta karena Allah telah mengunci rapat hati mereka dan kebodohan mereka yang berlebihan. Maka dari itu, Allah berfirman, ”demikianlah Allah mengunci hati orang-orang yang tidak mau mengetahui,” maka ia tidak bisa dimasuki oleh kebaikan, dan iapun tidak dapat mengetahui sesuatu sebagaimana adanya, malah melihat yang haq sebagai kepalsuan, dan yang palsu menjadi haq."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 58: Sungguh Allah menjelaskan kepada manusia pada Al Qur’an ini dengan setiap permisalan agar menjadi hujjah bagi mereka dan ke maha tunggalan Allah. Kemudian Allah menjelaskan akan orang-orang kafir kepada engkau wahai Nabi, yang mereka adalah orang yang sombong dan mereka sebagaimana yang telah datang kepada engkau wahai Nabi dari ayat-ayat atau mukjizat yang menunjukkan akan kejujuranmu maka mereka akan melemparkan kepadamu dan oengikutmu dengan kebathilan, yaitu engkau dituduh dengan segala kebathilann, sebagaimana yang dikatakan oleh kaumnya fir’aun sebagaiaman dalam surat Al A’raf : 132."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena perhatian-Nya kepada mereka, rahmat-Nya dan kelembutan-Nya kepada mereka, serta bagusnya pengajaran-Nya. Dengan perumpamaan itu semakin jelaslah hakikat, perkara dapat diketahui dengan jelas, dan hujjah menjadi tegak. Ayat ini umum kepada semua perumpamaan yang Allah buat untuk mendekatkan perkara yang masih dalam bayangan akal dengan perkara yang nyata. Demikian pula pada berita tentang yang akan terjadi dan jelasnya hakikatnya sehingga seakan-akan terjadi. Allah juga menyebutkan hal yang akan terjadi pada hari Kiamat dan keadaan orang-orang yang berdosa serta penyesalan mendalam dari mereka, di mana Dia tidak menerima lagi tobat mereka, akan tetapi orang-orang zalim lagi kafir tidak menghendaki selain membantah yang hak. Oleh karena itulah, Allah berfirman, “Dan jika engkau membawa suatu ayat kepada mereka, pastilah orang-orang yang kafir itu akan berkata, \"Kamu hanyalah orang-orang yang membuat kepalsuan belaka.\" Yang membuktikan kebenaran yang engkau bawa. Yakni Nabi Muhammad shallallahu 'alaihi wa sallam dan para sahabatnya. Yang demikian adalah akibat kekafiran mereka dan beraninya mereka kepada Allah, dan karena kebodohan mereka yang sangat, sehingga Allah mengunci hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 58",
    "description": "58-59. Beralih dari pemaparan mengenai bukti keesaan-Nya dan kebenaran risalah nabi Muhammad, pada ayat ini Allah menjelaskan sikap orang kafir. Dan sesungguhnya telah kami jelaskan kepada manusia segala macam perumpamaan dalam Al-Qur'an ini perihal bukti keesaan-ku, keniscayaan hari kebangkitan, dan kebenaran risalah nabi Muhammad. Meski begitu, jika engkau membawa suatu ayat yang lain kepada mereka, pastilah orang-orang kafir itu akan tetap berkata, 'kamu hanyalah orang-orang yang membuat kepalsuan belaka. Apa yang engkau bawa adalah sihir semata. ' demikianlah Allah mengunci hati orang-orang yang tidak mau memahami ayat Al-Qur'an yang dengan sangat jelas membuktikan keesaan-Nya dan keniscayaan hari kebangkitan"
  }
]