[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dengan penutupan seperti inilah, Allah menutup hati orang-orang yang tidak mengetahui hakikat pelajaran-pelajaran dan ayat-ayat yang jelas yang kamu bawa (wahai Rasul) dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Sebagaimana terkuncinya hati orang-orang yang tidak mengimaninya apabila engkau membawa ayat kepada mereka, maka demikian juga Allah mengunci hati orang-orang yang tidak mengetahui bahwa apa yang engkau bawa itu adalah kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Demikianlah Allah menutup hati orang-orang yang menjauhkan diri mereka dari ilmu yang bermanfaat sehingga tidak memahami kebenaran sebagaimana tertutupnya hati orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. كَذٰلِكَ (Demikianlah) Yakni tuduhan mereka yang mengatakan bahwa perkataanmu dan ayat-ayat yang kamu bawa adalah kebatilan merupakan bentuk pendustaan mereka yang berasal dari hati mereka yang telah dikunci oleh Allah, sehingga mereka melawan dan mendurhakai kebenaran dan tidak mentaatinya. يَطْبَعُ اللهُ عَلَىٰ قُلُوبِ الَّذِينَ لَا يَعْلَمُونَ (Allah mengunci mati hati orang-orang yang tidak (mau) memahami) Yakni orang-orang yang tidak memiliki ilmu yang bermanfaat yang mampu menunjukkan mereka kepada kebenaran dan menyelamatkan mereka dari kebatilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Seperti itulah kunican (Allah) atas hati orang-orang bodoh karena melawan dan menentang kebenaran. Allah mengunci hati orang-orang kafir yang tidak memiliki ilmu bermanfaat yang membimbing menuju kebenaran menjauhkan dari kebathilan. Maknanya yaitu Allah mengunci hati orang-orang yang bersikeras untuk mengabaikan, mengingkari dan mendustakan ayat-ayat Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah Allah mengunci} mengunci {hati orang-orang yang tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58-59. “dan sesungguhnya telah kami buat perumpamaan,” karena perhatian, rahmat, kelembutan, dan kebaikan pengajaran kami “dalam al-qur’an ini segala macam perumpamaan untuk manusia,” dengannya berbagai pengetahuan (kebenaran) menjadi jelas, berbagai perkara dapat diketahui dan dengannya hujjah menjadi terputus. Ini umum dalam sebuah perumpamaan yang dibuat oleh Allah dalam rangka mempermudah persoalan yang logis dan yang empiric (nyata), dan di dalam menginformasikan tentang apa yang akan terjadi dan menjelaskan hakikatnya hingga seakan-akan ia telah terjadi. Di antaranya yang ada disini adalah penjelasan Allah tentang apa yang akan terjadi dihari kiamat dan keadaan orang-orang yang berdosa pada saat itu serta betapa dahsyatnya penyesalan mereka, dan bahwa sesungguhnya tidak ada udzur dan cercaan yang diterima dari mereka. Akan tetapi orang-orang kafir nan zhalim tidak mau kecuali sikap menentang kebenaran yang sangat jelas itu. Maka Allah berfirman,”dan sesungguhnya jika kamu membawa kepada mereka suatu ayat,” ayat apa saja yang membuktikan kebenaran ajaran yang engkau bawa, “pastilah orang-orang yang kafir itu berkata, ’kamu tidak lain hanyalah orang-orang yang membuat kepalsuan belaka’,” maksudnya, mereka mengatakan kepada kebenaran itu, “itu adalah kepalsuan,” ini semua karena kekafiran dan kelancangan mereka serta karena Allah telah mengunci rapat hati mereka dan kebodohan mereka yang berlebihan. Maka dari itu, Allah berfirman, ”demikianlah Allah mengunci hati orang-orang yang tidak mau mengetahui,” maka ia tidak bisa dimasuki oleh kebaikan, dan iapun tidak dapat mengetahui sesuatu sebagaimana adanya, malah melihat yang haq sebagai kepalsuan, dan yang palsu menjadi haq."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 59: Allah menejelaskan dengan permisalan tabiat mereka, Allah jadikan hati mereka terkunci bagi mereka orang-orang yang bodoh, pendusta dan sombong, di mana pada mereka tidak akan masuk kebaikan, tidak juga bermanfaat sebuah petunjuk, dan tabiat dan terkuncinya hati mereka adalah sebagai balasan bagi kekufuran yang mereka sembunyikan dan tidaklah sebagai tabiat permulaan; Karena sebab Allah tidaklah mendzalimi siapapun selamanya, Allah berfirman : Tidaklah Tuhan kalian mendzalimi seorang hamba. (Fushshilat : 46)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, hati mereka tidak dapat dimasuki kebaikan, tidak dapat mengenal hakikat segala sesuatu, bahkan melihat yang hak sebagai batil dan yang batil sebagai yang hak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 59",
    "description": "58-59. Beralih dari pemaparan mengenai bukti keesaan-Nya dan kebenaran risalah nabi Muhammad, pada ayat ini Allah menjelaskan sikap orang kafir. Dan sesungguhnya telah kami jelaskan kepada manusia segala macam perumpamaan dalam Al-Qur'an ini perihal bukti keesaan-ku, keniscayaan hari kebangkitan, dan kebenaran risalah nabi Muhammad. Meski begitu, jika engkau membawa suatu ayat yang lain kepada mereka, pastilah orang-orang kafir itu akan tetap berkata, 'kamu hanyalah orang-orang yang membuat kepalsuan belaka. Apa yang engkau bawa adalah sihir semata. ' demikianlah Allah mengunci hati orang-orang yang tidak mau memahami ayat Al-Qur'an yang dengan sangat jelas membuktikan keesaan-Nya dan keniscayaan hari kebangkitan. 60. Maka bersabarlah engkau, wahai nabi Muhammad atas penentangan orang kafir terhadap dakwahmu. Sungguh, janji Allah tentang kemenangan dirimu dan orang-orang yang konsisten membela dan menegakkan ayat-ayat Allah itu benar adanya, dan sekali-kali jangan sampai orang-orang yang tidak meyakini kebenaran ayat-ayat Allah itu menggelisahkan dan merisaukan engkau. []."
  }
]