[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Allah menjanjikan kepada orang-orang beriman dengan janji yang pasti yang tidak diselisihi dengan memberi orang-orang Romawi yang beragama Nasrani kemenangan atas orang-orang Persia yang menyembah berhala, akan tetapi kebanyakan orang-orang kafir Makkah tidak mengetahui bahwa apa yang Allah janjikan adalah haq, karena mereka hanya mengetahui apa yang lahir dari dunia dan perhiasannya, sementara perkara akhirat dan hal-hal yang bermanfaat bagi mereka di sana, mereka melalaikannya, bahkan sama sekali tidak memikirkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Pertolongan ini merupakan janji dari Allah -Ta'ālā-, dan dengan terbuktinya hal tersebut menjadikan orang-orang yang beriman semakin bertambah yakin dengan janji Allah untuk mendapat kemenangan. Adapun kebanyakan manusia tidak memahami hal ini karena kekufuran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Kemenangan Romawi terjadi pada tahun ke-8 setelah diutusnya Nabi Muhammad; itu merupakan janji Allah yang tidak akan diingkari, akan tetapi kebanyakan manusia tidak mengetahui bahwa janji Allah benar. Mereka hanya mengetahui urusan dunia mereka, akan tetapi mereka hanya mengetahui secara zahir saja, namun mereka lalai dalam menghayati hakikat dunia, penciptaannya, dan tanda-tanda keesaan Allah yang ada di dalamnya; dan mereka tidak memikirkan perkara akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَعْدَ اللهِ ۖ لَا يُخْلِفُ اللهُ وَعْدَهُۥ ((Sebagai) janji yang sebenarnya dari Allah. Allah tidak akan menyalahi janji-Nya) Yakni ini merupakan janjidari Allah yang ditekankan bahwa janji ini tidak akan diingkari. Yakni janji kemenangan bagi bangsa Ramawi atas bangsa Persia. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ(tetapi kebanyakan manusia tidak mengetahui) Yakni orang-orang kafir tidak mengetahui bahwa Allah tidak mengingkari janji-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Allah memberikan orang-orang mukmin janji yang baik dengan memberikan pertolongan (Pertolongan terhadap Romawi atas Persia yang merupakan penyembah berhala). Allah tidak akan mengingkari janjiNya dalam segala sesuatu, namun kebanyakan manusia, di antaranya orang-orang kafir Mekah tidak mengetahui janji Allah SWT dengan menolong mereka, karena tidak mengenal Allah dan tidak mau berpikir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Itulah) janji Allah} Allah memberikan janji kepada orag-orang mukmin dengan pertolongan {Allah tidak akan menyalahi janjiNya, tetapi kebanyakan manusia tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “sebagai janji yang sebenar-benarnya dari Allah. Allah tidak akan menyalahi janjiNya,” maka dari itu yakinilah hal itu dan pastikanlah; dan ketahuilah bahwasannya yang demikian itu pasti terjadi. Setelah ayat-ayat ini diturunkan, yang di dalamnya terdapat janji ini, maka kaum Muslimin pun langsung membenarkannya, sedangkan orang-orang kafir mendustakannya hingga sebagian kaum muslimin dan sebagian kaum musyrikin melakukan taruhan dalam waktu beberapa tahun yang telah mereka tentukan. Maka setelah masa yang telah ditetapkan oleh Allah tiba, bangsa romawi memperoleh kemenangan atas bangsa Persia, dan romawi berhasil mengusir mereka dari daerah-daerah mereka yang sebelumnya diduduki oleh bangsa Persia, dan dengan demikian terbuktilah apa yang Allah janjikan. Ini termasuk perkara ghaib yang diberitakan Allah sebelum perisiwa ini terjadi, dan ada pada zaman orang-orang yang mana Allah memberitakannya kepada kaum Muslimin dan kaum musyrikin. “tetapi kebanyakan manusia tidak mengetahui,” bahwa apa yang dijanjikan Allah itu benar. Maka dari itu terdapat sekelompok manusia di antara mereka yang mendustakan janjiNya dan mendustakan ayat-ayatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 6: Allah mengabarkan bahwa penaklukkan romawi kepada persia adalah janji Allah, tiada keraguan akan janji Allah, di mana Allah tidak akan menyelisihinya selamanya. Maka sudah pasti akan terjadi, akan tetapi kebanyakan orang-orang kafir tidak mengetahui bahwa janji Allah adalah benar yang tidak mungkin Allah menyelisihinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maka kaum muslimin yakin dan memastikan kemenangan itu. Ketika turun ayat ini, kaum muslimin membenarkannya, sedangkan kaum musyrik mengingkarinya. Saking yakinnya dengan janji itu, sampai di antara kaum muslimin ada yang melakukan taruhan dengan kaum musyrikin terhadap hal itu. Ketika tiba waktu yang Allah tetapkan, maka menanglah bangsa Romawi terhadap bangsa Persia, dan mereka diusir dari negeri-negeri yang sebelumnya mereka rebut dari bangsa Romawi dan terwujudlah janji Allah itu. Bahwa janji Allah adalah hak (benar). Oleh karena itulah ada sebagian yang mendustakan janji Allah dan mendustakan ayat-ayat-Nya. Mereka itu tidak mengetahui hakikat segala sesuatu dan kesudahannya. Bahkan yang mereka ketahui sebagaimana yang disebutkan pada ayat selanjutnya adalah perkara yang lahir (tampak) dari kehidupan dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 6",
    "description": "Itulah janji Allah kepada kaum mukmin. Janji Allah pasti benar sebab Allah tidak akan menyalahi janji-Nya, tetapi kebanyakan manusia, khususnya orang kafir, tidak mengetahui dan memahami bahwa ketentuan dan perbuatan Allah kepada hamba-Nya didasarkan pada keadilan dan kebijaksanaan-Nya. 7. Mereka tidak memiliki pengetahuan tentang hakikat keagamaan. Mereka hanya mengetahui yang lahir atau tampak dari kehidupan dunia, sedangkan terhadap kehidupan akhirat mereka benar-benar lalai."
  }
]