[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bersabarlah (wahai Rasul) atas apa yang menimpamu, berupa gangguan dan pendustaan dari kaummu kepadamu. Sesungguhnya apa yang Allah janjikan kepadamu berupa kemenangan, kekuasaan dan pahala adalah haq, tiada keraguan padanya. Dan jangan sampai memalingkanmu dari agamamu oleh orang-orang yang tidak meyakini kebangkitan dan tidak membenarkan pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Maka bersabarlah- wahai Rasul- atas pengingkaran kaummu terhadapmu, sesungguhnya janji Allah kepadamu untuk menolongmu dan membuatmu jaya adalah suatu hal yang pasti, tidak ada keraguan padanya. Dan janganlah perilaku orang-orang yang tidak percaya bahwa mereka itu akan dibangkitkan mendorongmu untuk tergesa-gesa dan meninggalkan kesabaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Hai Rasulullah, bersabarlah dalam menjalankan apa yang diperintahkan kepadamu dan dalam menyampaikan dakwah kepada mereka serta dalam menghadapi gangguan mereka. Sungguh janji Allah untuk menolongmu pasti terlaksana, dan janganlah perbuatan orang-orang kafir yang mendustakan para rasul itu membuatmu bimbang dan gelisah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. فَاصْبِرْ(Dan bersabarlah kamu) Atas gangguan yang kamu dengar dari mereka dan perbuatan kafir mereka yang kamu lihat. إِنَّ وَعْدَ اللهِ حَقٌّ ۖ( sesungguhnya janji Allah adalah benar) Yakni Allah telah menjanjikan kepadamu kemenangan atas mereka, meninggikan hujjahmu, dan menampakkan dakwahmu; dan janji-Nya benar, tidak akan diingkari. وَلَا يَسْتَخِفَّنَّكَ(dan sekali-kali janganlah menggelisahkan kamu) Yakni janganlah itu membuatmu gelisah, dan menjauhkanmu dari agamamu. الَّذِينَ لَا يُوقِنُونَ (orang-orang yang tidak meyakini itu) Yakni tidak meyakini Allah dan tidak mempercayai nabi-nabi-Nya serta tidak beriman kepada kitab-kitab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Maka bersabarlah wahai nabi atas siksaan bagi kaummu dan dalam dakwahmu. Sungguh Allah telah menjajikanmu dengan pertolongan. Sesungguhnya janji Allah untuk menolongmu atas mereka dan menampakkan agamu itu kebenaran yang pasti. Dan jangan sampai orang-orang yang tidak meyakini Allah dan tidak mengimani para nabiNya itu memberimu kegelisahan dan kesembronoan. Mereka adalah kaum yang tersesat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bersabarlah. Sesungguhnya janji Allah itu benar. Jangan sampai meremehkanmu} jangan sampai membuatmu sembrono dan tidak bersabar {orang-orang yang tidak meyakini itu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “maka bersabarlah kamu” atas sesuatu yang diperintahkan kepadamu dan dalam mengajak mereka kepada Allah sekalipun kamu menjumpai dari mereka sikap berpaling (menolak); maka hal itu jangan sekali-kali menjadi penghalangmu.”sesungguhnya janji Allah itu benar.” Maksudnya, tidak diragukan lagi. Ungkapan ini termasuk yang memperteguh kesabaran. Sebab, sesungguhnya seseorang, apabila mengetahui bahwa amalnya tidak sia-sia, bahkan pasti ia menemukannya secara sempurna, maka segala rintangan yang dihadapinya akan terasa ringan, dan segala yang sulit akan menjadi mudah baginya, dan semua pekerjaan yang banyak terasa sedikit. “dan sekali-kali janganlah orang-orang yang tidak meyakini itu menggelisahkan kamu.” Maksudnya, sesungguhnya iman mereka telah lemah, keyakinan mereka telah berkurang, sehingga pikiran-pikiran mereka sangat rendah dan kesabaran mereka berkurang. Maka jangan sekali-kali mereka itu membuta mu gelisah. Sebab, sesungguhnya jika kamu tidak mengindahkan mereka dan kamu tidak waspada terhadap mereka, dan jika tidak (bersikap) demikian niscaya mereka bisa menggelisahkanmu dan membuatmu tidak berpendirian teguh diatas perintah dan larangan, sedangkan nafsu itu membantu mereka dalam hal ini dan menuntut agar bersikap menyerupai dan menyetujui (pengingkaran kebenaran). Ini menunjukkan bahwa setiap orang Mukmin yang berkeyakinan lagi matang akalnya akan mudah bersikap bersabar, dan setiap orang yang lemah keyakinannya adalah lemah akalnya. Yang pertama laksana isi, sedangkan yang kedua laksana kulit. Maka hanya kepada Allah-lah tempat meminta pertolongan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 60: Bersabarlah wahai Nabi Allah dalam dakwahmu atas apa yang engkau dengar dari pengingkaran, dan atas apa yang menimpa engkau dari celaan. Dan ketahuilah bahwasanya janji Allah dengan pertolongan dan kemenangan serta tampilnya (islam) dan kebenaran yang mengalahkan kebathilan, tidaklah diragukan lagi, janganlah engkau juga bersedih hati atas mereka yang tidak yakin kepada Allah dan juga tidak membenarkan para Nabi Allah serta tidak beriman kepada-Nya, tidak juga pada hari akhir (kiamat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di atas perintah-Nya dan berdakwah kepada mereka meskipun engkau melihat mereka berpaling. Janganlah hal itu menghalangimu dari menjalankan tugasmu. Yakni pertolongan-Nya. Hal ini dapat membantu seseorang untuk bersabar, karena seorang hamba apabila mengetahui bahwa amalnya tidak akan sia-sia, bahkan ia akan memperolehnya secara sempurna, maka akan ringan segala derita yang akan dihadapinya dan semua yang susah pun menjadi mudah, dan amal yang banyak pun menjadi sedikit. Iman dan keyakinan mereka lemah sehingga akalnya pun lemah dan kesabarannya pun ikut lemah. Oleh karena itu, janganlah kamu digelisahkan oleh mereka yang lemah iman itu. Ayat ini menunjukkan bahwa orang yang kuat iman dan keyakinan, maka akalnya kuat, mudah bersabar, sedangkan orang yang lemah iman dan keyakinan, maka akalnya ikut lemah dan tidak bersabar. Orang yang kuat itu ibarat inti dalam buah, sedangkan yang lemah itu ibarat kulit buah, wallahul mustaa’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 60",
    "description": "Maka bersabarlah engkau, wahai nabi Muhammad atas penentangan orang kafir terhadap dakwahmu. Sungguh, janji Allah tentang kemenangan dirimu dan orang-orang yang konsisten membela dan menegakkan ayat-ayat Allah itu benar adanya, dan sekali-kali jangan sampai orang-orang yang tidak meyakini kebenaran ayat-ayat Allah itu menggelisahkan dan merisaukan engkau. []1-3. Alif l'm m'm. Inilah ayat-ayat Al-Qur'an yang meski tersusun dari huruf-huruf yang dikenal oleh masyarakat arab namun mereka tidak mampu membuat tandingannya. Inilah ayat-ayat yang mengandung hikmah dan pelajaran yang tidak bertentangan antara satu ayat dengan lainnya. Kami turunkan Al-Qur'an ini sebagai petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan, yaitu mereka yang senantiasa beramal saleh dengan ikhlas."
  }
]