[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Allah menjanjikan kepada orang-orang beriman dengan janji yang pasti yang tidak diselisihi dengan memberi orang-orang Romawi yang beragama Nasrani kemenangan atas orang-orang Persia yang menyembah berhala, akan tetapi kebanyakan orang-orang kafir Makkah tidak mengetahui bahwa apa yang Allah janjikan adalah haq, karena mereka hanya mengetahui apa yang lahir dari dunia dan perhiasannya, sementara perkara akhirat dan hal-hal yang bermanfaat bagi mereka di sana, mereka melalaikannya, bahkan sama sekali tidak memikirkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Mereka tidak mengetahui iman dan hukum-hukum syariah, yang mereka ketahui hanyalah perkara yang tampak dari kehidupan dunia yang berhubungan dengan pekerjaan untuk kehidupan mereka, sementara mereka berpaling dari negeri Akhirat yang merupakan kehidupan yang sesungguhnya, mereka tidak menoleh kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. يَعْلَمُونَ ظٰهِرًا مِّنَ الْحَيَوٰةِ الدُّنْيَا (Mereka hanya mengetahui yang lahir (saja) dari kehidupan dunia) Yakni mereka mengatahui apa yang nampak dari perhiasan dunia dan kenikmatannya, dan urusan penghidupan mereka serta cara-cara mendapatkan berbagai manfaat duniawi. وَهُمْ عَنِ الْاٰخِرَةِ(sedang mereka tentang (kehidupan) akhirat) Yang berupa kenikmatan yang kekal dan kelezatan yang murni. هُمْ غٰفِلُونَ (mereka lalai) Yakni mereka tidak mempedulikannya dan tidak menyiapkan apa yang dibutuhkan untuk mendapatkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Mereka mengetahui perkara-perkara yang tampak yang dapat mereka saksikan, berupa hiasan-hiasan dunia dan keuntungan hidup. Mereka menikmati hal itu dan lupa dengan nikmat akhirat yang abadi. Mereka tidak mempersiapkannya dan tidak pernah terpikirkan dalam benak mereka tentang akhir dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka mengetahui yang tampak dari kehidupan dunia, sedangkan terhadap akhirat mereka lalai} mereka lalai dan tidak tahu tentangnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. dan mereka orang-orang yang tidak mengetahui. Maksudnya, mereka yang tidak mengetahui esensi sesuatu dan akibat-akibatnya, sebenarnya “hanya mengetahui yang lahir saja dari kehidupan dunia,” lalu mereka melihat kepada sebab-musabab keberadaannya; dan mereka meyakini ketidakterjadinya suatu perkara yang mana mereka sama sekali belum melihat keberadaan sebab-sebab yang bisa menimbulkan kejadiannya. Jadi, mereka sangat tergantung kepada sebab-sebab, tanpa melihat kepada (Allah) yang menurunkan sebab-sebabnya, yang bertindak padanya, “sedang mereka tentang (kehidupan) akhirat adlah lalai.” Hati mereka, hawa nafsu mereka dan kemauan mereka sudah terfokus pada dunia, kesennagan dan gemerlapnya, lalu berbuat hanya untuk itu, berupaya dan menuju kepadanya, berpaling dan lupa terhadap kehidupan akhirat. Ia sama sekali tidak merindukan surga, tidak pula takut akan api neraka, tidak juga berdiri di hadapan Allah dan berjumpa denganNya membuatnya takut dan membuatnya ngeri. Ini adalah tanda kesengsaraan, dan cirinya adalah lalai akan kehidupan akhirat. Yang mengherankan adalah bahwa sesungguhnya kelompok manusia yang satu ini sudah mencapai pada kecerdasan dan kepintaran yang sangat tinggi terhadap lahiriah kehidupan dunia hingga sampai pada tingkat mencengangkan akal dan menakjubkan hati. Mereka bisa memperlihatkan berbagai keajaiban nuklir dan listrik, peralatan transportasi darat, laut dan udara yang denganya mereka menjad unggul. Mereka berhasil menampakkan dan membanggakan akal mereka, dan mereka memandang bangsa-bangsa lain tidak mampu melakukan apa yang telah ditakdirkan Allah agar mampu mereka lakukan. Maka mereka memandang bangsa lain dengan pandangan hina dan rendah, sedangkan dalam masalah agama mereka merupakan manusia yang paling bodoh dan paling lalai terhadap kehidupan akhirat, serta paling dangkal pengetahuannya terhadap akibat-akibat perbuatan mereka. Mereka telah dilihat oleh orang-orang yang berakal dan berpandangan tajam sedang terombang-ambing dalam kejahilan, tergelimang dalam kesesatan, terbuai dalam kebatilan. Mereka telah melupakan Allah, maka Allah menjadikan mereka lupa terhadap diri mereka sendiri. Mereka itulah orang-orang fasik. Lalu para ahli pikir itu melihat kepada apa yang dikaruniakan Allah dan kemampuan yang Allah anugerahkan kepada mereka (sekelompok manusia itu). Berupa pemikiran-pemikiran yang sangat canggih dalam permasalahan dunia dan lahirnya, sedangkan mereka tidak dikaruniai akal yang sangat jenius. Maka para ahli pemikiran yang mendalam (tajam) itu mengetahui bahwasannya segala perkara adalah wewenang Allah dan keputusan terhadap manusia adalah milikNya. Ia tiada lain melainkan taufikNya atau pengabaianNya. Maka dari itu mereka (para ahli pemikiran yang mendalam) takut kepada Allah, Rabb mereka, dan mereka memohon kepadaNya semoga Dia berkenan melengkapi cahaya akal dan iman yang telah dianugerahkanNya kepada mereka hingga mereka bisa sampai kepadaNya dan menempati haribanNya. Semua perkara di atas, kalau saja disertai iman dan dibangun di atasnya, tentu ia akan membuahkan kemajuan yang sangat tinggi dan kehidupan yang baik. Akan tetapi, karena kebanyakannya dibangun di atas landasan ilhad (kekafiran), maka ia tidak membuahkan sesuatu kecuali dekedensi moral dan segala sebab kebinasaan dan kehancuran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 7: Allah menjelaskan bahwa mereka orang-orang kafir mengetahui secara dzahir dari kehidupan dunia dari isi dan perhiasannya yang fana, akan tetapi mereka dalam kondisi lalai dengan kelalaian yang sempurna akan kehidupan akhirat, dan dari apa yang akan mereka lihat dari balasan dan hisab akan urusan dunia, dan juga mereka lalai dari urusan setelah hisab dan balasan yang sesungguhnya berupa kenikmatan yang akan didapatkan orang-orang yang beriman di surga, dan balasan adzab dengan neraka bagi orang-orang yang pendosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka hanya melihat kepada sebab dan memastikan perkara karena ada sebab-sebabnya, dan mereka meyakini tidak akan terjadi perkara apa pun tanpa ada sebab-sebabnya. Mereka hanya berdiri bersama sebab, dan tidak melihat kepada yang mengadakan sebab itu. Hati mereka, hawa nafsu mereka, dan keinginan mereka tertuju kepada dunia dan perhiasannya. Oleh karena itu, mereka lakukan sesuatu untuknya dan berusaha keras kepadanya dan lalai dari akhirat. Mereka berbuat bukan karena rindu kepada surga dan takut kepada neraka serta takut berhadapan dengan Allah nanti pada hari Kiamat. Ini merupakan tanda kecelakaan seseorang. Namun sangat mengherangkan sekali, orang yang seperti ini adalah orang yang pandai dan cerdas dalam urusan dunia sampai membuat manusia terkagum kepadanya. Mereka membuat kendaraan darat, laut dan udara, serta merasa ujub (kagum) dengan akal mereka dan mereka melihat selain mereka lemah dari kemampuan itu yang sesungguhnya Allah yang memberikan kepada mereka kemampuan itu, sehingga mereka merendahkan orang lain, padahal mereka adalah orang yang paling bodoh dalam urusan agama, paling lalai terhadap akhirat, dan paling kurang melihat akibat (kesudahan dari segala sesuatu). Selanjutnya mereka melihat kepada kemampuan yang diberikan Allah berupa berpikir secara teliti tentang dunia dan hal yang tampak daripadanya, namun mereka dihalangi dari berpikir tinggi, yaitu mengetahui bahwa semua perkara milik Allah, hukum (keputusan) hak-Nya, memiliki rasa takut kepada-Nya dan meminta kepada-Nya agar Dia menyempurnakan pemberian-Nya kepada mereka berupa cahaya akal dan iman. Semua perkara itu jika diikat dengan iman dan menjadikannya sebagai dasar pijakan tentu akan membuahkan kemajuan, kehidupan yang tinggi, akan tetapi karena dibangun di atas sikap ilhad (ingkar Tuhan), maka tidak membuahkan selain turunnya akhlak, menjadi sebab kebinasaan dan kehancuran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 7",
    "description": "Mereka tidak memiliki pengetahuan tentang hakikat keagamaan. Mereka hanya mengetahui yang lahir atau tampak dari kehidupan dunia, sedangkan terhadap kehidupan akhirat mereka benar-benar lalai. -."
  }
]