[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang mendustakan para Rasul Allah dan perjumpaan dengan Allah tidak merenungkan penciptaan diri mereka oleh Allah dan bahwa Dia yang menciptakan mereka setelah sebelumnya mereka bukanlah sesuatu? Allah tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya kecuali untuk menegakkan keadilan, menetapkan pahala dan hukuman, sebagai petunjuk kepada tauhid dan kuasaNya dan ajal yang ditetapkan sebagai akhir hidup dunia, yaitu Hari Kiamat. Sesungguhnya kebanyakan manusia mengingkari dan tidak mempercayai perjumpaan dengan Tuhannya, karena mereka tidak mengetahui bahwa tempat kembali mereka adalah Allah setelah mereka mati, di samping mereka lalai dari kehidupan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Tidakkah orang-orang musyrik yang mendustakan itu berfikir tentang diri mereka sendiri bagaimana Allah telah menciptakannya dan menegakkannya? Tidaklah Allah menciptakan langit dan tidaklah Dia menciptakan bumi melainkan dengan tujuan yang benar, Dia tidak menciptakannya dengan sia-sia, dan Dia menentukan batas waktu tertentu untuk keberadaannya di dunia. Dan sesungguhnya sebagian besar manusia benar-benar ingkar terhadap pertemuan dengan Rabb mereka pada hari Kiamat. Karena itulah mereka tidak mempersiapkan diri untuk menghadapi kebangkitan dengan mengerjakan amal saleh yang diridai Rabb mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Allah mencela orang-orang yang mendustakan para rasul-Nya dan hari perjumpaan dengan-Nya: “Tidakkah mereka bersungguh-sungguh dalam berfikir tentang penciptaan diri mereka dan tanda-tanda kekuasaan Allah yang lain? Allah telah menciptakan mereka yang sebelumnya tidak ada. Tidaklah Allah menciptakan tujuh langit dan bumi dan yang ada di antaranya melainkan dengan keadilan, kebenaran, dan waktu ditetapkannya kehancuran dunia. Sungguh kebanyakan hamba mendustakan hari kebangkitan dan perjumpaan dengan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَوَلَمْ يَتَفَكَّرُوا۟ فِىٓ أَنفُسِهِم ۗ (Dan mengapa mereka tidak memikirkan tentang (kejadian) diri mereka?) Yakni sebab-sebab untuk berfikir telah mereka dapatkan yaitu diri mereka sendiri, maka seandainya mereka memikirkan ciptaan Allah bagi mereka dengan sebenar-benarnya niscaya mereka akan mengetahui bahwa hanya Allah yang layak untuk disembah, tidak ada sekutu bagi-Nya. Pendapat lain mengatakan maknanya adalah hendaklah seorang manusia merenung dengan dirinya tentang penciptaan langit dan bumi dan makhluk-makhluk yang tinggal di keduanya. Dan tidakkah mereka memikirkan penciptaan diri mereka padahal sebelumnya mereka tidak ada sama sekali. مَّا خَلَقَ اللهُ السَّمٰوٰتِ وَالْأَرْضَ وَمَا بَيْنَهُمَآ إِلَّا بِالْحَقِّ(Allah tidak menjadikan langit dan bumi dan apa yang ada diantara keduanya melainkan dengan (tujuan) yang benar) Yakni dengan adil. Dan pendapat lain mengatakan, yakni dengan hikmah. وَأَجَلٍ مُّسَمًّى ۗ( dan waktu yang ditentukan) Yakni dan dengan waktu yang telah ditentukan untuk kehancuran langit dan bumi serta apa yang ada diantara keduanya, yaitu pada hari kiamat. وَإِنَّ كَثِيرًا مِّنَ النَّاسِ بِلِقَآئِ رَبِّهِمْ لَكٰفِرُونَ(Dan sesungguhnya kebanyakan di antara manusia benar-benar ingkar akan pertemuan dengan Tuhannya) Yakni ingkar terhadap hari kebangkitan setelah kematian mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kenapa orang-orang yang melupakan akhirat itu tidak berpikir tentang bagaimana Allah menciptakan mereka, sehingga bisa kembali dari kelupaan mereka? Allah tidak menciptakan langit, bumi dan makhluk-makhluk di antara keduanya kecuali dengan adil dan untuk tujuan keadilan, penentuan hukum yang tinggi yang tidak mengandung kesia-siaan dan permainan, dan untuk waktu yang telah ditentukan akhirnya, yaitu hari kiamat. Sesungguhnya kebanyakan manusia seperti orang-orang kafir Mekah itu mengingkari kebangkitan setelah kematian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak berpikir tentang diri mereka. Allah tidak menciptakan langit, bumi, dan apa yang ada di antara keduanya, kecuali dengan benar dan waktu yang ditentukan} waktu yang ditentukan selesainya, yaitu hari kiamat {Sesungguhnya banyak di antara manusia benar-benar mengingkari pertemuan dengan Tuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. maksudnya, mengapa orang-orang yang mendustakan para utusan Allah dan perjumpaan denganNya tidak merenungkan “tentang diri mereka,?” karena sesungguhnya pada diri mereka terdapat tanda-tanda yang dengannya mereka dapat mengetahui bahwa yang telah mengadakan (menciptakan) mereka dari ketiadaan akan menghidupkan mereka kembali sesudah itu; dan bahwa (tuhan) yang telah memindahkan mereka dari satu fase ke fase lain, dari sperma menjadi segumpal darah, lalu menjadi segumpal daging, lalu menjadi sesosok manusia, lalu Dia telah meniupkan ruh padanya, lalu menjadikannya bayi, lalu berubah menjadi remaja, lalu menjadi orang dewasa, lalu menjadi tua renta, sangat tidak laik kalau membiarkan mereka terlantar begitu saja, mereka tidak dilarang, tidak diperintah, tidak diberi pahala dan tidak disiksa. “Allah tidak menjadikan langit dan bumi dan apa yang ada diantara keduanya melainkan dengan (tujuan) yang benar,” yaitu untuk menguji kalian, siapa diantara kalian yang terbaik amalnya, “dan waktu yang ditentukan.” Maksudnya, waktu menetapnya dibatasi dengan waktu yang dengannya dunia akan sirna dan datang kemudian kiamat (kebangkitan), bumi diganti dengan bumi lain dan demikian juga langit. “dan sesungguhnya kebanyakan diantara manusia-manusia benar-benar ingkar akan pertemuan dengan Rabbnya.” Maka dari itu mereka tidak bersiap-siap untuk perjumpaan denganNYa dan tidak membenarkan para RasulNya yang memberitakan tentang pertemuan denganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rum ayat 8: Apakah mereka tidak memikirkan yaitu diri-diri mereka orang-orang yang sombong dan mendustakan, akan penciptaan Allah atas diri mereka, dari yang mereka tidak ada menjadi ada ?! Sungguh Allah tidaklah menciptakan langit dan bumi dengan tanpa tujuan (sia-sia); Bahkan Allah ciptakan keduanya dengan kebenaran dan keadilan serta hikmah bagi manusia yang mengambil pelajaran, siapa di antara mereka yang terbaik dalam amalannya. Allah telah menentukan bagi langit dan bumi kehancuran dan perjanjian; Kemudian Allah tepati waktu tersebut dengan melenyapkan keduanya dan mendatangkan hari kiamat, maka tergantikanlah bumi dengan selain bumi dan langit yang sekarang, maka sungguh kebanyakan manusia mengingkari perjumpaan dengan Allah, dan mendustakan hari kebangkitan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka yang mendustakan para rasul Allah dan pertemuan dengan-Nya. Sesungguhnya dalam diri mereka terdapat ayat-ayat yang menunjukkan bahwa yang mengadakan mereka dari yang sebelumnya tidak ada akan mengulangi penciptaan lagi, dan bahwa yang mengubah mereka dari satu keadaan kepada keadaan yang lain; dari mani menjadi segumpal darah, lalu menjadi segumpal daging dan selanjutnya menjadi manusia yang memiliki ruh, dari anak kecil menjadi anak muda, lalu menjadi orang tua hingga menjadi kakek-kakek, tidak mungkin yang menjadikan seperti itu membiarkan mereka begitu saja, tidak diperintah dan tidak dilarang, tidak diberi pahala dan tidak disiksa. Ini tidak mungkin. Yakni untuk menguji manusia siapakah yang paling baik amalnya; paling ikhlas dan sesuai sunnah Rasul-Nya shallallahu 'alaihi wa sallam. Maksudnya, keutuhan langit dan bumi telah ditentukan sampai waktu tertentu, di mana ketika itu bumi dan langit diganti dengan bumi dan langit yang baru. Oleh karena itu, mereka tidak mempersiapkan diri untuk menghadapi pertemuan dengan-Nya, tidak membenarkan para rasul yang memberitakannya, dan kekafiran ini merupakan kekafiran yang tidak didasari dalil. Bahkan dalil-dalil yang ada memastikan adanya kebangkitan dan pembalasan. Oleh karena itulah, di ayat selanjutnya Allah mengingatkan mereka untuk melakukan perjalanan di bumi dan melihat kesudahan yang menimpa orang-orang mendustakan para rasul dan menyelisihi perintahnya yang keadaannya lebih kuat dan lebih banyak peninggalannya di bumi, seperti sisa-sisa istana dan benteng-benteng, pepohonan yang mereka tanam, sungai yang mereka gali, tetapi kenyataannya kekuatan itu tidak berguna bagi mereka, dan peninggalan mereka tidak bermanfaat apa-apa saat mereka mendustakan rasul-rasul mereka yang datang membawa keterangan yang nyata yang menunjukkan kebenaran mereka dan kebenaran yang mereka bawa. Karena ketika melihat bekas peninggalan mereka, maka kita tidak menemukan selain sebagai umat-umat yang binasa, tempat tinggalnya pun sepi dijauhi manusia dan celaan dari manusia pun bertubi-tubi. Ini merupakan balasan yang disegerakan sekaligus sebagai contoh untuk balasan di akhirat dan awal baginya. Semua umat itu telah binasa, Allah tidak menzalimi mereka, akan tetapi mereka yang menzalimi diri mereka dan menyebabkan binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rum Ayat 8",
    "description": "-9. Allah pun mengecam orang musyrik yang enggan mengambil pelajaran dari umat-umat terdahulu yang menentang para rasul. Dan tidakkah mereka sempat bepergian di beberapa tempat di bumi ini lalu melihat dan memperhatikan bagaimana kesudahan orang-orang sebelum mereka yang mendustakan para rasul' mereka dibinasakan dengan cara mengenaskan dan mengerikan, padahal orang-orang itu lebih kuat secara fisik, jumlah, maupun kekayaan dari mereka sendiri dan mereka juga telah mengolah bumi serta memakmurkannya dengan bercocok tanam, menambang, dan sebagainya melebihi apa yang telah mereka, yakni kaum musyrik mekah, makmurkan. Dan telah datang kepada mereka rasul-rasul mereka dengan membawa bukti-bukti yang jelas atas eksistensi dan keesaan Allah, namun mereka mendustakan dan mengingkarinya, maka Allah menurunkan azab akibat dosa-dosa mereka sendiri. Allah sama sekali tidak berlaku zalim kepada mereka dengan menurunkan azab tanpa sebab dan peringatan terlebih dahulu, tetapi merekalah yang berlaku zalim kepada diri mereka sendiri dengan mengingkari peringatan Allah, bahkan mereka menentang dan menyakiti para rasul."
  }
]