[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh beruntunglah orang-orang yang beriman kepada Allah dan RasulNya, serta melaksanakan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sungguh orang-orang yang beriman kepada Allah, yang mengamalkan ajaran syariat-Nya telah beruntung dengan meraih balasan yang mereka cita-citakan, dan selamat dari perkara yang mereka takuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-4. Allah memberi kabar gembira kepada orang-orang beriman dengan janji-Nya bahwa mereka akan mendapat surga firdaus, yaitu bagi orang-orang yang mengakui keesaan Allah dan risalah Rasulullah, orang-orang yang mendirikan shalat dengan penuh ketundukan kepada Allah, dan menjauhkan diri dari segala hal yang tidak baik, serta orang-orang yang senantiasa menunaikan zakat bagi orang-orang yang berhak menerimanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. قَدْ أَفْلَحَ الْمُؤْمِنُونَ (Sesungguhnya beruntunglah orang-orang yang beriman) Yakni orang-orang beriman yang memiliki sifat-sifat yang akan disebutkan akan memperoleh kemenangan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Surat al-Mu'minun diawali dengan kalimat { قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ } \"Sesungguhnya beruntunglah orang-orang yang beriman\" dan diakhiri dengan { إِنَّهُ لَا يُفْلِحُ الكفرُوْنَ } \"Sesungguhnya orang-orang Kafir itu tiada beruntung\" [117] perbedaan yang sangat jauh antara pembuka dan penutup. 2 ). { قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ } Sungguh mereka menang secara mutlak, pada segala hal. Ayat ini tidak dikatkan dengan waktu dan tempat, orang-orang beriman akan senantiasa berada pada kemenangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Imam Ahmad dan lainnya: bahwa Nabi SAW bersabda: Benar-benar telah turun kepadaku sepuluh ayat, barangsiapa melaksanakan/mendirikannya – tidak mengingkari isi kandungannya – maka akan masuk surga, kemudian membaca membaca qad aflahal mu’minun ayat 1 hingga ayat 10. Sesungguhnya beruntunglah orang-orang yang beriman kenikmatan yang kekal selamanya. Diriwayatkan dari Annasai bahwa sayyidah ‘Aisyah radliyallahu ‘anha pernah ditanya tentang akhlak Rasulullah SAW, beliau menjawab: “Akhlak Rasul adalah Alquran.”, kemudian beliau membaca qad aflahal mu’minun hingga walladzina hum lifurujihim hafidhun yaitu ayat 5. Kemudian beliau berucap: “Seperti inilah akhlak Rasul SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh beruntunglah} sungguh telah memenangkan dan memperoleh kebaikan dunia dan akhirat {orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Firman Allah “sungguh beruntunglah orang-orang yang beriman itu,” maksudnya mereka telah memperoleh kemenangan, kebahagiaan dan keberuntungan serta telah berhasil menggapai apa yang dicita-citakan. Mereka adalah kaum Mukminin yang telah beriman kepada Allah dan membenarkan para utusan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 1: Ayat ini merupakan peninggian dari Allah terhadap hamba-hamba-Nya yang mukmin, menyebutkan keberuntungan dan kebahagiaan mereka, dan menyebutkan sesuatu yang dapat menyampaikan mereka kepada keberuntungan, sekaligus mendorong manusia agar memiliki sifat-sifat itu. Oleh karena itu, hendaknya seorang hamba menimbang dirinya dengan ayat ini dan setelahnya, di mana dengannya mereka dapat mengetahui sejauh mana keimanan mereka, bertambah atau kurang, banyak atau sedikit. Yakni berbahagia, sukses dan berhasil mendapatkan apa yang diinginkan. Kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 1",
    "description": "1-2. Sungguh, pasti beruntung orang-orang mukmin yang telah mantap imannya dan terbukti dengan mengerjakan amal-amal saleh. Orang yang demikian itu ialah orang yang khusyuk dalam salatnya, yakni tumakninah, rendah hati, fokus, serta menyadari dengan sepenuuhnya bahwa dia sedang menghadap sang penciptanya (lihat juga: al-baqarah/2: 45'46)"
  }
]