[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Agar aku dapat mengejar apa yang telah aku sia-siakan, yaitu beriman dan taat.” (padahal) dia tidak punya hak untuk itu, sehingga apa yang dia minta tidak akan dikabulkan dan tidak akan diberi tangguh baginya. Akan tetapi, itu hanya perkataan yang memang dia yang mengatakannya, tetapi tidak ada gunanya baginya, dan bersama itu dia juga tidak jujur dengan perkataan itu; karena kalau seandainya dia dikembalikan ke dunia, niscaya dia akan kembali melanggar apa-apa yang dilarang untuk dia kerjakan. Dan orang-orang yang telah meninggal dunia, akan tetap berada di perbatasan dan alam barzakh itu, yaitu antara dunia dan akhirat, hingga tibanya hari kebangkitan kembali dan di kumpulkan (untuk menghadap Tuhan)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Agar aku dapat mengerjakan amal saleh bila telah kembali ke sana.\" Sekali-kali tidak, permintaanmu tak akan pernah terjadi, sebab sungguh itu hanyalah dalih yang diucapkannya saja. Sebab bila ia dikembalikan ke dunia, ia pasti tidak akan memenuhi janji yang ia tuturkan. Dan mereka yang dimatikan itu akan terus berada di alam antara dunia dan Akhirat sampai pada Hari Kebangkitan, sehingga mereka tidak mungkin lagi kembali ke dunia untuk mengerjakan amal saleh yang dahulu mereka lalaikan, maupun untuk memperbaiki perbuatan buruk mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. لَعَلِّىٓ أَعْمَلُ صٰلِحًا (agar aku berbuat amal yang saleh) Yakni di dunia, jika mereka telah kembali ke sana, dengan beriman dan menjalankan amalan-amalan kebaikan. كَلَّآ ۚ إِنَّهَا كَلِمَةٌ هُوَ قَآئِلُهَا ۖ (Sekali-kali tidak. Sesungguhnya itu adalah perkataan yang diucapkannya saja) Yakni hanyalah omongan belaka, andai saja keinginan mereka dikabulkan niscaya mereka tidak akan menjalankannya. وَمِن وَرَآئِهِم(Dan di hadapan mereka) Yakni dari depan dan belakang mereka. بَرْزَخٌ(ada dinding) Yakni pemisah antara kematian dan kebangkitan. إِلَىٰ يَوْمِ يُبْعَثُونَ(sampal hari mereka dibangkitkan) Yakni hari kiamat. Mereka di waktu tersebut akan dikembalikan di kubur mereka atas keputusan Allah, mereka tidak dapat meraih kembali amalan yang telah mereka lewatkan dan tidak dapat memperbaiki amal buruk yang telah mereka lakukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "99-100 1 ). Adakah kamu merasakan nikmatnya ramadhan? Cukup mengingat kata yang akan diucapkan oleh orang-orang yang membangkan kepada Allah: { رَبِّ ٱرْجِعُونِ , لَعَلِّىٓ أَعْمَلُ صَٰلِحًا فِيمَا تَرَكْتُ } \"Ya Tuhanku kembalikanlah aku (ke dunia) , Agar aku berbuat amal yang saleh terhadap yang telah aku tinggalkan\" dan ingat teriakan penghuni neraka: { رَبَّنَآ أَخْرِجْنَا نَعْمَلْ صَٰلِحًا } \"Ya Tuhan kami, keluarkanlah kami niscaya kami akan mengerjakan amal yang saleh\" [Fathir: 37] .. wahai kalian berita gembira bagimu yang mendapati musim-musim kebaikan itu, dan mengerjakan amalan shalih di dalamnya. 2 ). { لَعَلِّىٓ أَعْمَلُ صَٰلِحًا فِيمَا تَرَكْتُ } Mereka meminta untuk dikembalikan demi berbuat shalih, bukan untuk mengumpulkan kekayaan dunia, dan memuaskan syahwat. Maka beruntunglah seseorang yang dikaruniai oleh Allah kesempatan untuk mengerjakan hal-hal yang didambakan oleh orang-orang kafir pada hari kiamat tatkala mereka melihat azab dihadapan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Agar aku bisa berbuat amal saleh dengan mengesakan Allah atas waktu yang telah aku sia-siakan. Sekali-kali tidak. Tidak ada pengembalian. Sesungguhnya perkataan dia itu adalah perkataan yang tidak ada gunanya. Di hadapan mereka ada dinding sampal hari mereka dibangkitkan. Barangsiapa dihadapkan pada kematian maka dia tidak akan pernah bisa kembali ke dunia sampai hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar aku dapat beramal shalih yang telah aku tinggalkan”} yang telah aku lewatkan {Sekali-kali tidak, Sesungguhnya itu adalah alasan yang diucapkan saja. Dan di hadapan mereka} di hadapan mereka {ada (alam) barzakh} pembatas antara dunia dan akhirat {sampai pada hari mereka dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99-100 Allah memberitahukan tentang kondisi orang-orang yang kedatangan ajalnya, dari kalangan orang-orang yang melalaikan kewajiban-kewajibannya (didunia ini) lagi berbuat aniaya, bahwa dia merasa menyesal, saat menyaksikan tempat kesudahannya, melihat keburukan amalan-amalannya, hingga dia pun meminta untuk balik kembali ke dunia. Tujuannya bukan untuk menikmati kenikmatannya dan memenuhi nafsu-nafsu keinginannya, akan tetapi, dia mengatakan, “Ya Rabbku kembalikanlah aku (kedunia), agar aku berbuat amal yang shalih terhadap yang telah aku tinggalkan,” yaitu amalan-amalan shalih yang kusepelekan di sisi Allah. “sekali-kali tidak,” tidak ada kesempatan untuk balik kembali dan tiada penundaan waktu (lagi). Allah sudah memutuskan bahwa mereka tidak akan kembali lagi kedunia. “sesungguhnya itu,” maksudnya ucapan yang berisi harapannya untuk kembali ke alam dunia “adalah perkataan yang diucapkan saja,” hanya sekedar lontaran dengan mulut saja, tidak memberikan manfaat bagi pengucapannya kecuali kesedihan dan penyeselan. Begitu pula, dia sendiri sebenarnya tidak percaya pada pernyataannya. Sungguh, bila dia dikembalikan lagi ke kehidupan duniawi, niscaya dia pun kembali melanggar laranganNya. “Dan dihadapan mereka ada dinding sampai hari mereka dibangkitkan.” Maksudnya, di depan dan di hadapan mereka terdapat barzakh yaitu dinding penghalang untuk dua kehidupan; kehidupan dunia dan akhirat. Di barzakh ini (alam kubur), orang-orang yang taat (kepada Allah) akan menikmati keadaan yang nikmat. Sedangkan orang-orang yang bermaksiat akan didera siksa sejak kematian mereka sampai hari mereka dibangkitkan. Maksudnya, hendaklah mereka mempersiapkan bekal dan mencari persiapan untuknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 100: Seperti beriman (masuk Islam) dan beramal saleh. Yakni ia tidak mungkin kembali dan diberi penangguhan. Maksudnya, hanya sebatas di lisan dan tidak ada faedahnya selain kerugian dan penyesalan, dan kalimat itu pun tidak jujur. Karena jika ia dikembalikan ke dunia, ia akan melakukan hal yang sama. Yang menghalangi mereka kembali ke dunia. Barzakh (alam kubur) merupakan penghalang antara dunia dan akhirat. Di barzakh ini, orang-orang yang taat merasakan kenikmatan, sedangkan orang-orang yang bermaksiat merasakan penderitaan dan azab dari sejak mereka mati sampai mereka dibangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 100",
    "description": "99-100. Orang-orang kafir itu akan terus membangkang, hingga apabila datang kematian kepada seseorang dari mereka untuk mengakhiri kehi-dupannya di dunia dan menghentikan kenikmatan yang dirasakannya, hingga pada akhirnya ia melihat siksa yang akan diterimanya, dia berkata, 'ya tuhanku, kembalikanlah aku ke dunia agar aku dapat berbuat kebajikan yang telah aku tinggalkan. ' sekali-kali tidak! Allah tidak akan memenuhi permohonan mereka karena Allah tahu bahwa mereka tidak akan menepati janji. Sesungguhnya itu adalah dalih yang diucapkannya saja. Dan di hadapan serta di belakang mereka ada barzakh, yaitu dinding pemisah antara kehidupan dunia dan akhirat, yang menghalangi mereka kembali ke dunia sampai pada hari mereka dibangkitkan. 101. Usai menjelaskan alam barzakh hingga hari kebangkitan, Allah lalu memberi uraian tentang peristiwa hari kebangkitan itu. Apabila sangkakala ditiup dengan tiupan pertama maka semua yang bernyawa segera mati, dan dalam tiupan kedua semua dibangkitkan, maka setiap orang akan menghadap tuhan secara sendiri-sendiri (lihat juga: surah maryam/19: 95); tidak ada lagi pertalian keluarga di antara mereka pada hari itu, dan tidak pula mereka saling bertanya. Mereka sibuk dengan urusan masing-masing dan diliputi ketakutan yang begitu mencekam."
  }
]