[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saat Hari Kiamat tiba, malaikat yang ditugasi meniup sangkakala telah meniupnya, dan manusia dibangkitkan, maka tidak ada kebanggaan dengan pertalian nasab pada hari itu sebagaimana mereka berbangga-bangga diri dengannya di dunia, dan tidak seorang pun yang bertanya kepada orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Apabila Malaikat yang bertugas meniup sangkakala telah meniupkan sangkakala untuk kedua kalinya yang mengumumkan terjadinya hari Kiamat, maka tidak ada lagi pertalian nasab dan keluarga yang mereka banggakan di antara mereka, karena masing-masing disibukkan dengan dahsyatnya kondisi hari Kiamat, dan tidak pula mereka saling bertanya satu sama lain karena sibuk dengan dirinya masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. فَإِذَا نُفِخَ فِى الصُّورِ (Apabila sangkakala ditiup) Yakni pada tiupan yang kedua. Makna (الصور) adalah tanduk yang ditiup pada hari kiamat. فَلَآ أَنسَابَ بَيْنَهُمْ يَوْمَئِذٍ(maka tidaklah ada lagi pertalian nasab di antara mereka pada hari itu) Yakni mereka tidak lagi berbangga-bangga dengan nasab, dan nasab tidak akan bermanfaat bagi mereka di hari itu. وَلَا يَتَسَآءَلُونَ(dan tidak ada pula mereka saling bertanya) Sebab ketika itu masing-masing dari mereka memiliki kesibukan sendiri-sendiri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seseorang bertanya kepada Zuhair bin Nu'aim: dari siapakah kamu wahai Abu Abdirrahman? beliau menjawab: dari hamba yang diberi nikmat islam oleh Allah; orang itu kembali berkata: maksud saya adalah asal dari nasab, Zuhair menjawab: { فَإِذَا نُفِخَ فِى ٱلصُّورِ فَلَآ أَنسَابَ بَيْنَهُمْ يَوْمَئِذٍ وَلَا يَتَسَآءَلُونَ } \"Apabila sangkakala ditiup maka tidaklah ada lagi pertalian nasab di antara mereka pada hari itu, dan tidak ada pula mereka saling bertanya.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Apabila sangkakala ditiup pada tiupan kedua maka tidak akan ada lagi pertalian nasab di antara mereka pada hari itu, dan tidak ada pula mereka saling bertanya karena kesibukan mereka pada hari itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apabila sangkakala ditiup, pada hari itu tidak ada lagi hubungan keluarga di antara mereka} maka tidak berguna hubungan kekeluargaan mereka pada hari itu, dan tidak bisa menyombongkan diri dengan itu, berupa membanggakan kedudukan {dan mereka tidak saling bertanya} dan mereka tidak bertanya satu sama lain, karena kesibukan masing-masing mereka terhadap diri sendiri {maka siapa yang berat timbangannya} lebih berat timbangan kebaikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101 Allah mengabarkan mengenai kengerian Hari kiamat, dan kejadian-kejadian yang memekakan telingan dan mendebarkan hati [dihari itu], dan bahwa bila sudah ditiup sangkakala untuk tiupan kebangkitan, lalu orang-orang dihimpun secara keselurhan untuk pertemuan pada hari yang sudah ditentukan, maka Allah akan menimpakan kepada mereka rasa takut yang menyebabkan mereka melupakan pertalian nasab (yang merupakan faktor perekat hubungan yang paling kokoh), apalagi bentuk hubungan lainnya. Sungguh, tidak ada orang yang menanyakan kondisi orang lain lantaran kesibukan pribadinya, karena tidak tahu apakah ia akan selamat tanpa ada kesengsaraan setelahnya, atau akan menjadi orang yang celaka tanpa ada unsur kebahagiaan sesudahnya. Allah berfirman, “Dan apabila datang suara yang memekakan (tiupan sangkakala yang kedua), pada hari ketika manusia lari dari saudaranya; dari ibu dan bapaknya, dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukannya.” (Abasa:33-37)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 101: Tiupan yang pertama atau yang kedua. Maksudnya, pada hari kiamat itu, manusia tidak dapat saling tolong menolong meskipun di kalangan keluarga. Berbeda dengan keadaan ketika di dunia. Hal itu, karena dahsyatnya sebagian keadaan ketika itu dan masing-masing sibuk dengan dirinya sendiri, sedangkan pada sebagian keadaan lagi mereka bisa sadar dan saling bertanya-tanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 101",
    "description": "101. Usai menjelaskan alam barzakh hingga hari kebangkitan, Allah lalu memberi uraian tentang peristiwa hari kebangkitan itu. Apabila sangkakala ditiup dengan tiupan pertama maka semua yang bernyawa segera mati, dan dalam tiupan kedua semua dibangkitkan, maka setiap orang akan menghadap tuhan secara sendiri-sendiri (lihat juga: surah maryam/19: 95); tidak ada lagi pertalian keluarga di antara mereka pada hari itu, dan tidak pula mereka saling bertanya. Mereka sibuk dengan urusan masing-masing dan diliputi ketakutan yang begitu mencekam. 102-104. Di hadapan Allah setiap individu akan diperiksa dan ditimbang amalnya, maka barangsiapa berat timbangan kebaikan-Nya, mereka itulah orang-orang yang beruntung. Dan sebaliknya, barang siapa ringan timbangan kebaikan-Nya, maka mereka itulah orang-orang yang merugikan dirinya sendiri karena gagal meraih keberuntungan dan membuat mereka kekal di dalam neraka jahanam. Wajah mereka, demikian juga anggota tubuh yang lain, dibakar api neraka, dan mereka di neraka dalam keadaan muram dengan bibir yang cacat sehingga kondisi mereka amat miris."
  }
]