[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka siapa saja yang kebajikannya banyak dan timbangan amal perbuatannya menjadi berat dengannya dalam perhitungan amal, mereka itulah orang-orang yang beruntung memperoleh surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Maka barangsiapa yang berat timbangan amalan kebaikannya sehingga mengalahkan timbangan amalan keburukannya, mereka itulah orang-orang yang beruntung dengan meraih apa yang mereka cita-citakan, dan terjauhkan dari apa yang mereka takuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102-104. Barangsiapa yang timbangan amal kebaikannya lebih berat dari pada amal keburukannya, maka mereka adalah orang-orang yang mendapat derajat yang tinggi, mereka akan meraih surga. Dan barangsiapa yang amal keburukannya lebih banyak daripada amal kebaikannya, maka mereka telah menyia-nyiakan diri mereka ke dalam neraka Jahannam akibat kesesatan mereka; mereka akan kekal di dalamnya, api neraka akan membakar wajah mereka, sehingga mereka memiliki wajah yang muram dan cacat. Syeikh as-Syinqithi berkata: “Apa yang Allah sebutkan dalam ayat ini bahwa wajah orang-orang kafir akan tertimpa api neraka, yakni akan terbakar olehnya. Dalam ayat lain dijelaskan: يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِى ٱلنَّارِ Pada hari ketika muka mereka dibolak-balikan dalam neraka. (al-Ahzab: 66). Dan firman Allah: وَمَن جَآءَ بِٱلسَّيِّئَةِ فَكُبَّتْ وُجُوهُهُمْ فِى ٱلنَّارِ Dan barang siapa yang membawa kejahatan, maka disungkurkanlah muka mereka ke dalam neraka. (an-Naml: 90)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. فَمَن ثَقُلَتْ مَوٰزِينُهُۥ (Barangsiapa yang berat timbangannya) Yakni timbangan dari amal-amal kebaikannya. فَأُو۟لٰٓئِكَ هُمُ الْمُفْلِحُونَ(maka mereka itulah orang-orang yang dapat keberuntungan) Yakni orang-orang yang meraih harapan mereka dan selamat dari hal-hal yang mereka takuti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Barangsiapa yang berat timbangan kebaikannya, maka mereka itulah orang-orang yang dapat keberuntungan berupa surga dan selamat dari siksa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{maka siapa yang berat timbangannya} lebih berat timbangan kebaikannya {maka mereka itulah orang-orang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102 Pada hari kiamat, terdapat momen-momen yang kesengsaraannya begitu dahsyat dan pengaruhnya sangat berat dirasakan. Misalnya, mizan (alat timbangan) yang diperuntukan untuk membedakan amalan-amalan seorang hamba, dan berdasarkan asas keadilan, dimonitorilah amalannya yang akan membantunya dan merugikannya, serta akan menjadi jelas timbangan kebaikan dan keburukan seberat biji sawi sekalipun. “barangsiapa yang berat timbangan (kebaikannya),” maksudnya, kebaikan-kebaikannya lebih dominan daripada amalan-amalan buruknya, “maka mereka itulah orang-orang yang mendapat keberuntungan,” lantaran mereka selamat dari api neraka, dan berhak mendapatkan surga, serta mengengam kemenangan dengan mendapat pujian yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 102: Pada hari kiamat ada beberapa tempat, di mana sebagiannya ada yang dahsyat dan sebagian lagi ada yang agak ringan. Di antara tempat yang dahsyat adalah pada saat disiapkan timbangan amal yang menujukkan keadilan Allah. Ketika itu, amal manusia baik atau buruk akan ditimbang. Mereka ini adalah orang-orang mukmin yang beramal saleh. Karena selamatnya mereka dari neraka dan berhaknya mereka masuk ke surga serta memperoleh pujian yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 102",
    "description": "102-104. Di hadapan Allah setiap individu akan diperiksa dan ditimbang amalnya, maka barangsiapa berat timbangan kebaikan-Nya, mereka itulah orang-orang yang beruntung. Dan sebaliknya, barang siapa ringan timbangan kebaikan-Nya, maka mereka itulah orang-orang yang merugikan dirinya sendiri karena gagal meraih keberuntungan dan membuat mereka kekal di dalam neraka jahanam. Wajah mereka, demikian juga anggota tubuh yang lain, dibakar api neraka, dan mereka di neraka dalam keadaan muram dengan bibir yang cacat sehingga kondisi mereka amat miris"
  }
]