[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa yang amal kebajikannya sedikit pada timbangan dan keburukan-keburukannya lebih berat, dan keburukannya yang paling parah ialah kesyirikan, mereka itulah orang-orang yang gagal lagi merugi di Neraka Jahanam dalam keadaan kekal abadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Dan barangsiapa yang ringan timbangan amalan kebaikannya sehingga dikalahkan oleh timbangan amal buruknya, mereka itulah yang merugikan diri mereka sendiri karena telah melakukan amalan yang memberi mudarat pada diri mereka dan meninggalkan amalan yang bermanfaat pada diri mereka berupa iman, dan amal saleh, tempat tinggal mereka adalah Neraka Jahanam, dan tidak akan pernah keluar darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. وَمَنْ خَفَّتْ مَوٰزِينُهُۥ (Dan barangsiapa yang ringan timbangannya) Yakni ringan timbangan amal kebaikannya dibandingkan dengan amal keburukannya. فَأُو۟لٰٓئِكَ الَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ(maka mereka itulah orang-orang yang merugikan dirinya sendiri) Yakni mereka melalaikan diri mereka sendiri dan meninggalkan apa yang bermanfaat bagi diri mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Namun barangsiapa yang ringan timbangan amal baiknya, maka mereka itulah orang-orang yang merugi terhadap dirinya sendiri dan tidak bermanfaat apapun, mereka kekal di dalam neraka Jahannam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang ringan timbangannya} yang lebih ringan timbangan kebaikannya {maka mereka itulah orang-orang yang merugikan dirinya sendiri} memboroskan diri mereka sendiri {Mereka kekal di dalam neraka Jahanam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103 “ Dan barangsiapa yang ringan timbangannya,” maksudnya timbangan amalan-amalan buruknya lebih berat dari kebaikan-kebaikannya dan kesalahan-kesalahannya melingkupinya, “maka mereka itulah orang-orang yang merugikan dirinya sendiri,” segala kerugian selain kerugian ini adalah sepele, bila dibandingkan dengan kerugian itu. Akan tetapi kerugian itu benar-benar berat. Akibat buruknya tidak bisa ditanggulangi dan kebaikan yang lenyap tidak bisa dikejar lagi, sebuah kerugian yang abadi, dan kesengsaraan selama-lamanya. Sungguh dia telah merugikan jiwanya yang mulia yang seharusnya dia bisa meraih kebahagiaan yang abadi dengannya. Namun dia melewatkan kenikmatan yang abadi ini bagi dirinya di sisi Rabb yang Mahamulia. “Mereka kekal di dalam neraka jahanam,” mereka tidak bisa beranjak keluar darinya selamanya. Ancaman ini, -seperti yang sudah kami terangkan- hanyalah tertuju kepada orang-orang yang dosa-dosanya telah meliputi segala kebaikannya, dan hal itu tidak terjadi kecuali pada orang kafir. Atas dasar ini, mereka tidak menjalani perhitungan amalan sebagaimana orang-orang (pada umumnya) yang kebaikan dan kejelekannya ditimbang. Sebab, sungguh tidak ada kebaikanpun bagi mereka. Akan tetapi, amalan mereka diperhitungkan dan dibilang, lalu mereka ditempatkan dihadapannya, tujuannya untuk dimintai pengakuan dan dihinakan dengannya. Adapun orang-orang yang masih mempunyai dasar keimanan, namun amalan-amalan buruknya begitu banyak, hingga mengalahkan timbangan amalan kebaikannya, maka dia meskipun masuk kedalam neraka, tidak akan kekal didalamnya, sebagaimana ditunjukkan oleh dalil-dalil al-kitab dan as-sunnah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 103: Mereka ini adalah orang-orang kafir, karena kepercayaan dan amal mereka tidak dinilai oleh Allah di hari kiamat. Lihat pula surah Al Kahfi ayat 105. Orang yang kekal di neraka Jahanam adalah orang yang keburukannya meliputi dirinya, dan tidak ada yang seperti itu kecuali orang-orang kafir. Menurut Syaikh As Sa’diy, ia tidaklah dihisab seperti dihisabnya orang yang ditimbang kebaikan dan keburukannya, karena mereka tidak memiliki kebaikan, akan tetapi amal mereka dihitung dan dijumlahkan, lalu mereka dihadapkan kepadanya dan mengakuinya serta dipermalukan dengannya. Adapun orang yang memiliki asal keimanan, namun keburukannya lebih besar sehingga mengalahkan kebaikannya, maka ia meskipun masuk neraka, tetapi tidak kekal di sana sebagaimana ditunjukkan oleh nash-nash Al Qur’an dan As Sunnah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 103",
    "description": "102-104. Di hadapan Allah setiap individu akan diperiksa dan ditimbang amalnya, maka barangsiapa berat timbangan kebaikan-Nya, mereka itulah orang-orang yang beruntung. Dan sebaliknya, barang siapa ringan timbangan kebaikan-Nya, maka mereka itulah orang-orang yang merugikan dirinya sendiri karena gagal meraih keberuntungan dan membuat mereka kekal di dalam neraka jahanam. Wajah mereka, demikian juga anggota tubuh yang lain, dibakar api neraka, dan mereka di neraka dalam keadaan muram dengan bibir yang cacat sehingga kondisi mereka amat miris"
  }
]