[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikatakanlah kepada mereka, “Bukankah ayat-ayat al-Qur’an sudah dibacakan kepada kalian di dunia, lalu mengapa kalian mendustakannya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Lalu dikatakan kepada mereka sebagai bentuk celaan, \"Bukankah ayat-ayat Al-Qur`ān telah dibacakan pada kalian tatkala di dunia, akan tetapi kalian malah mendustakannya?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Akan dikatakan kepada mereka sebagai pengingkaran bagi mereka: “Bukankah ayat-ayat al-Qur’an telah dibacakan kepada kalian ketika di dunia, namun kalian tidak mengimaninya?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Bukankah ayat-ayat-Ku telah dibacakan kepadamu sekalian, tetapi kamu selalu mendustakannya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bukankah ayat-ayatKu telah dibacakan kepada kalian, tetapi kalian selalu mendustakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105 maka dilontarkan kepada mereka pertanyaan untuk memburukkan dan mencela mereka, “bukankah ayat-ayatKu telah dibacakan kepadamu sekalian,” kalian diseru dengannya, supaya beriman dan ditawarkan kepada kalian agar kalin mau mencermatinya, “tetapi kamu selalu mendustakannya,” karena sikap aniaya dan penentanganmu. Padahal itu merupakan ayat-ayat yang nyata, yang menunjukkan kepada kebenaran dan kebatilan, menerangkan perkara-perkara yang lurus dan yang batil?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 105: Yakni Al Qur’an. Di mana kamu telah diajak beriman dan telah ditakut-takuti dengan neraka jika tidak beriman. Karena kezaliman dan sikap membangkang, padahal ayat-ayat itu demikian jelasnya menunjukkan kebenaran, menerangkan mana yang hak dan mana yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 105",
    "description": "105. Seiring dengan siksa lahiriah itu, mereka juga mendapat kecaman dari Allah yang membuat batin mereka merana. Kepada mereka dikatakan, 'bukankah ayat-ayat-ku telah dibacakan kepadamu, tetapi kamu selalu mendustakannya''106-107. Menjawab pertanyaan itu, mereka berkata dengan penuh penyesalan, 'ya tuhan kami, kami telah dikuasai oleh kejahatan kami. Hawa nafsu telah menjerumuskan kami ke dalam kedurhakaan sehingga membuat kami menderita, dan kami di dunia dulu adalah orang-orang yang sesat. ' dengan pengakuan dan penyesalan itu mereka berharap ampunan dan keringanan siksa. Mereka pun memohon, 'ya tuhan kami, keluarkanlah kami darinya, yaitu dari siksa neraka dan kesengsaraan ini, kembalikanlah kami ke dunia. Jika engkau memperkenankan permohonan kami ini lalu setelah itu kami masih juga kembali kepada kekafiran dan kedurhakaan maka sungguh, kami adalah orang-orang yang zalim. '."
  }
]