[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika rasul-rasul menyampaikan risalah kepada mereka dan memperingatkan mereka, pada Hari KIamat mereka berkata, “Wahai Tuhan kami, sungguh telah melumpuhkan kami kesenangan-kesenangan kami dan hawa nafsu kami yang telah ditakdirkan pada diri kami dalam IlmuMu yang pasti sebelumnya. Dan kami dalam tindakan kami ini telah sesat dari petunjuk yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Mereka menjawab, \"Wahai Tuhan kami! Kami telah dikuasai oleh kejahatan kami sendiri yang telah Engkau tetapkan dalam ilmu-Mu, dan kami adalah orang-orang yang tersesat dari jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106-107. Mereka mengakui saat mereka telah masuk neraka: “Ya Tuhan kami, kami melakukan banyak kemaksiatan akibat hawa nafsu kami, dan kami dahulu jauh dari hidayah. Ya Tuhan kami, keluarkanlah kami dari azab neraka menuju dunia, dan jika kami kembali kepada kekafiran maka kami benar-benar telah menzalimi diri kami sendiri.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. قَالُوا۟ رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا (Mereka berkata: “Ya Tuhan kami, kami telah dikuasai oleh kejahatan kami) Yakni kami dikalahkan oleh kenikmatan dan syahwat kami. Disebut sebagai (الشقوة) karena mengantarkan kepada kesengsaraan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Mereka orang-orang yang bernasib buruk itu berkata: \"Ya Tuhan kami, kami telah dikuasai oleh kejahatan kami, atau akibat buruk yaitu kesedihan. Kami adalah orang-orang yang sesat dadri petunjuk dan kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Ya Tuhan kami, kedurhakaan kami telah menguasai kami} kedurhakaan yang telah ditetapkan untuk kami {dan kami adalah orang-orang yang sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106 Saat itulah mereka menyampaikan pengakuan atas tindakan aniaya, yang mana pengakuan itu sudah lagi tidak berguna “mereka berkata, ’Ya Rabb kami, kami telah dikuasai oleh kejahatan kami’.” Maksudnya, kejahatan yang muncul dari ulah aniaya dan berpaling dari kebenaran dan menyambut yang berbahaya dan meninggalkan perkara yang bermanfaat, (sikap ini) telah mendominasi kami “dan dahulu kami orang-orang yang tersesat,” dalam amalan mereka. Walaupun mereka telah mengetahui bahwa diri mereka berbuat zhalim. Artinya, kami mengerjakan perbuatan perbuatan di dunia sebagaimana tindakan orang yang salah jalan, sesat lagi bodoh, sebagaiamana yang mereka nyatakan dalam ayat lain, “Dan mereka berkata, ‘sekiranya kami mendengarkan atau memikirkan (peringatan itu), niscaya tidaklah kami termasuk penghini-penghuni neraka yang menyala-nyala’.” (al-mulk:10)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 106: Ketika itu, mereka pun mengakui kezalimannya, namun tidak bermanfaat lagi pengakuannya. Yang lahir dari kezaliman, berpaling dari yang hak, mendatangi sesuatu yang membahayakan dan meninggalkan sesuatu yang bermanfaat. Dalam amalnya, meskipun mereka adalah orang-orang yang tahu dan menyadari bahwa mereka adalah orang-orang zalim. Mereka akan berkata, “Sekiranya Kami mendengarkan atau memikirkan (peringatan itu) niscaya kami tidak termasuk penghuni-penghuni neraka yang menyala-nyala\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 106",
    "description": "106-107. Menjawab pertanyaan itu, mereka berkata dengan penuh penyesalan, 'ya tuhan kami, kami telah dikuasai oleh kejahatan kami. Hawa nafsu telah menjerumuskan kami ke dalam kedurhakaan sehingga membuat kami menderita, dan kami di dunia dulu adalah orang-orang yang sesat. ' dengan pengakuan dan penyesalan itu mereka berharap ampunan dan keringanan siksa. Mereka pun memohon, 'ya tuhan kami, keluarkanlah kami darinya, yaitu dari siksa neraka dan kesengsaraan ini, kembalikanlah kami ke dunia. Jika engkau memperkenankan permohonan kami ini lalu setelah itu kami masih juga kembali kepada kekafiran dan kedurhakaan maka sungguh, kami adalah orang-orang yang zalim. '106-107"
  }
]