[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada mereka, “Tinggallah kalian di dalam neraka dalam keadaan hina dina. Dan janganlah kalian berbicara kepadaKu.” Maka terputuslah saat itu permohonan dan harapan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Allah berfirman, \"Tinggallah kalian di dalam Neraka dengan penuh kehinaan dan tercela, dan janganlah kalian berbicara dengan Aku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. mereka dijawab dengan penuh penghinaan: “Diamlah kalian yang hina, dan jangan sekali-kali berbicara dengan-Ku lagi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. قَالَ اخْسَـُٔوا۟ فِيهَا (Allah berfirman: “Tinggallah dengan hina di dalamnya) Yakni menjauhlah kalian karena kalian dibenci, seperti ucapan yang dikatakan kepada anjing jika mendekati sesuatu yang suci “menjauhlah”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Allah berfirman: \"Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman,“Tinggallah dengan hina} Tinggallah dengan hina dan rendah {di sana dan janganlah berbicara denganKu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108 Allah berfirman untuk menjawab permintaan mereka, “tinggalah dengan hina di dalamnya, dan janganlah kamu berbiacara dengan Aku.” Ucapan ini – semoga Allah memberikan kita sekalian keselamatan dari neraka- merupakan perkataan yang paling berat secara mutlak yang didengar oleh orang-orang yang berbuat jahat untuk meluluhlantakkan harapan dan memburuk-burukan mereka, menghinakan dan membuat rugi dan memuttuskan asa mereka dari setiap kebaikan, dan merupakan kabar gembira datangnya setiap kejelekan. Perkataan dan kemarahan dari Rabb Yang Maha Penyayang menjadi perkataan yang paling berat bagi mereka dan paling membekas untuk menyiksa mereka di azab Neraka Jahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 108: Ucapan ini merupakan ucapan yang paling keras kepada mereka sehingga harapan mereka pun hilang dan mereka pun berputus asa. Selanjutnya Allah Subhaanahu wa Ta'aala menerangkan sebab yang membuat mereka disiksa sedemikian rupa dan sampai tidak diberi keringanan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 108",
    "description": "108-109. Mendengar permohonan para pendurhaka, dia berfirman, 'tinggAllah dengan hina di dalamnya, yakni neraka, dan janganlah kamu berbicara dengan aku karena tidak ada lagi kesempatan untuk tawar-menawar. Kalian, wahai para pendurhaka, tidak pula akan memperoleh kehormatan untuk berdialog dengan-ku. ' mengingatkan kembali salah satu kedurhakaan mereka, Allah berfirman, 'sesungguhnya ada segolongan dari hamba-hamba-ku berdoa, 'ya tuhan kami, kami telah ber-iman, maka ampunilah kami dan berilah kami rahmat, engkau adalah pemberi rahmat yang terbaik. '108-109"
  }
]