[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dahulu ada segolongan dari hamba-hambaKu, (yaitu kaum Mukminin) yang berdoa memohon, “Wahai Tuhan kami, kami telah beriman, maka tutuplah dosa-dosa kami, dan rahmatilah kami. Dan Engkau adalah sebaik-baik yang mengasihi.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Sungguh dahulu ada golongan dari hamba-hamba yang beriman kepada-Ku yang selalu berdoa, \"Wahai Tuhan kami! Kami telah beriman kepada-Mu, maka ampunilah dosa-dosa kami, dan curahkan rahmat-Mu pada kami, sesungguhnya Engkau adalah sebaik-baik pemberi rahmat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Dahulu terdapat segolongan hamba-hamba-Ku yang beriman berkata: “Ya Tuhan kami, kami beriman kepada-Mu dan kepada para rasul-Mu, maka ampunilah dosa-dosa kami, rahmatilah kami, dan janganlah Engkau mengazab kami, Engkau adalah sebaik-baik pemberi rahmat.” Akan tetapi kalian selalu menghina mereka sehingga menyibukkan kalian dari mentaati dan menyembah-Ku. Dahulu kalian menertawakan mereka untuk menghina mereka. Dan kini Aku membalas kesabaran mereka dalam menghadapi gangguan dari kalian dengan balasan yang terbaik, yaitu dengan surga. Syeikh as-Syinqithi berkata: Dalam kaidah tentang penggunaan isyarat disebutkan bahwa (إن) berfungsi untuk menunjukkan sebab akibat, seperti dalam kalimat \"عاقبته إنه مسيء\" (aku menghukumnya karena dia berbuat buruk), yakni akibat keburukannya. Dan dalam ayat ini menunjukkan bahwa lafadz (إن) bermakna bahwa sebab yang menjadikan mereka masuk neraka adalah karena mereka menghina orang-orang beriman yang berkata: “Ya Tuhan kami, kami beriman kepada-Mu dan kepada para rasul-Mu, maka ampunilah dosa-dosa kami, rahmatilah kami, dan janganlah Engkau mengazab kami, Engkau adalah sebaik-baik pemberi rahmat.” Orang-orang kafir itu ketika di dunia menghina orang-orang beriman yang lemah, sehingga itu melalaikan mereka dari mengingat dan beriman kepada Allah, sehingga itu menjadikan mereka masuk neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. إِنَّهُۥ كَانَ فَرِيقٌ مِّنْ عِبَادِى (Sesungguhnya, ada segolongan dari hamba-hamba-Ku) Mereka adalah orang-orang beriman yang meminta rahmat dan ampunan kepda Allah dan mengakui sifat-sifat-Nya yang Maha Tinggi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Fenomena buruk mulai muncul tatkala bebarapa pemuda masih memelihara kejengkelan mereka yang berlebihan terhadap orang-orang yang menjaga agamanya, sampai-sampai mereka terlibat dalam suatu perkataan yang berbunyi menghina kepada wahyu Allah, namun semua itu hanya sebatas kejengkelan dan kemarahan saja, bahkan dari jauh dapat dipandang bahwa tingkah mereka seakan-akan hanya sebatas kegemaran yang baru, namun hakikatnya Ayat telah menyinggung sifat buruk ini: { إِنَّهُ كَانَ فَرِيقٌ مِنْ عِبَادِي يَقُولُونَ رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ , فَاتَّخَذْتُمُوهُمْ سِخْرِيًّا حَتَّىٰ أَنْسَوْكُمْ ذِكْرِي وَكُنْتُمْ مِنْهُمْ تَضْحَكُونَ } \"Sesungguhnya, ada segolongan dari hamba-hamba-Ku berdoa (di dunia): “Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat dan Engkau adalah Pemberi rahmat Yang Paling Baik , Lalu kamu menjadikan mereka buah ejekan, sehingga (kesibukan) kamu mengejek mereka, menjadikan kamu lupa mengingat Aku, dan adalah kamu selalu mentertawakan mereka.\" 2 ). Inilah yang menyebabkan mereka lupa untuk mengingat Allah: kesibukannya memperolok kaum mukminin, sebagaimana lupanya mereka dari mengingat Allah menjadikan mereka senang untuk memperolok kaum mukminin, kedua hal ini saling bergantung satu sama lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. “Sesungguhnya, ada segolongan dari hamba-hamba-Ku yang beriman, mereka berdoa di dunia: \"Ya Tuhan kami, kami telah beriman kepad-Mu dan rasul-Mu, maka ampunilah kami dan berilah kami rahmat janganlah engkau azab kami, dan Engkau adalah Pemberi rahmat Yang Paling Baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya segolongan dari hamba-hambaKu berdoa,“Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan rahmatilah kami. Engkaulah sebaik-baik pemberi rahmat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109 Selanjutnya, Allah menceritakan kondisi yang menyeret mereka kepada siksa dan menghentikan curahan rahmat Allah dari mereka. Allah berfirman, ”sesungguhnya ada segolongan dari hamba-hambaKu berdoa (di dunia),’ Ya Rabb kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat, dan Engkau adalah pemberi rahmat yang paling baik’.” Orang-orang itu telah menggabungkan antara keimanan yang menuntut amalan-amalan baik dan pemanjatan doa kepada Rabb mereka untuk mendapatkan ampunan, rahmat dan perantaraan (tawasul) kepadaNya melalui keyakinan terhadap rububiyyah Allah dan anugerahNya bagi mereka berupa iman serta pemberitahuan betap luasnya rahmat dan meratanya curahan kebaikanNya. Dalam ucapan mereka ini terkandung penjelasan yang menunjukkan ketundukan, kekhusyuan, ketidakberdayaan mereka dan rasa takut serta harapan mereka kepada Rabb mereka. Mereka itu adalah para pembesar dan tokoh-tokoh dari kalangan manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 109: Mereka adalah kaum muhajirin atau kaum mukmin yang lemah. Mereka menggabung antara iman yang menghendaki untuk beramal saleh, berdoa meminta ampunan dan rahmat kepada Allah, bertawassul (menggunakan sarana) dengan rububiyyah-Nya, nikmat iman yang diberikan-Nya, dan dengan memberitahukan rahmat-Nya yang luas, dan ihsan-Nya yang merata. Kalimat ini menunjukkan ketundukan, kekhusyu’an, perebahan diri mereka di hadapan Allah, rasa takut dan harap kepada-Nya. Mereka adalah manusia-manusia utama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 109",
    "description": "108-109. Mendengar permohonan para pendurhaka, dia berfirman, 'tinggAllah dengan hina di dalamnya, yakni neraka, dan janganlah kamu berbicara dengan aku karena tidak ada lagi kesempatan untuk tawar-menawar. Kalian, wahai para pendurhaka, tidak pula akan memperoleh kehormatan untuk berdialog dengan-ku. ' mengingatkan kembali salah satu kedurhakaan mereka, Allah berfirman, 'sesungguhnya ada segolongan dari hamba-hamba-ku berdoa, 'ya tuhan kami, kami telah ber-iman, maka ampunilah kami dan berilah kami rahmat, engkau adalah pemberi rahmat yang terbaik. '110. Kamu, wahai para pendurhaka, mendengar orang-orang mukmin tulus berdoa demikian, lalu kamu jadikan mereka buah ejekan. Begitu sibuk kamu mengejek mereka sehingga kamu lupa mengingat aku, dan kamu pun selalu menghina dan menertawakan mereka."
  }
]