[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "yaitu orang-orang yang mewarisi tempat yang paling tinggi dan paling tengah di surga, dan ini adalah tempat yang paling utama di surga. Mereka kekal abadi di dalamnya,kenikmatan mereka tidak berhenti dan tidak sirna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Yakni mereka akan mewarisi derajat Surga tertinggi. Mereka akan menetap kekal di dalamnya. Kenikmatan yang mereka raih tak akan pernah terputus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ ((yakni) yang akan mewarisi surga Firdaus) Yakni surga yang paling tengah dan paling tinggi. Terdapat pendapat mengatakan bahwa mereka mewarisi tempat tinggal di surga dari orang-orang kafir, sebab Allah menciptakan tempat tinggal di surga dan tempat tinggal di neraka bagi seluruh manusia. Wallahu a’lam. هُمْ فِيهَا خٰلِدُونَ (Mereka kekal di dalamnya) Mereka terus-menerus di dalamnya, tidak akan keluar dantidak akan mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Yaitu orang-orang yang akan mewarisi surga Firdaus. Mereka kekal di dalamnya, dan tidak akan keluar darinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang akan mewarisi surga Firdaus} surga yang paling tinggal, paling tengah, paling utama dan paling mulia {Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11 “(yakni) orang¬-orang yang akan mewarisi surga Firdaus,” yang merupakan tingkatan surga paling tinggi, berada di tengah dan paling utama. Lantaran mereka terhiasi oleh sifat-sifat kebaikan pada tingkat paling tinggi. Atau maksudnya adalah seluruh surga, agar kaum Muslimin pada umumnya dapat memasuki surga sesuai dengan tingakatan (amalan) mereka. Masing-masing tergantung kondisinya. Mereka kekal didalanya,” mereka tidak beranjak pindah darinya dan tidak berminat mencari tempat ganti, lantaran berisi kenikmatan yang paling sempurna dan terbaik lagi terlengkap, tanpa ada yang menodai dan membuat susah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 11: Yaitu surga yang paling tinggi, tengahnya dan yang paling utama. Bisa juga tertuju kepada semua surga sehingga mengena kepada semua kaum mukmin sesuai derajat dan martabat mereka. Mereka tidak ingin pindah daripadanya karena di dalamnya kebutuhan mereka terpenuhi dan mendapatkan semua kesenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 11",
    "description": "10-11. Demikianlah sifat-sifat orang mukmin yang akan meraih keberuntungan. Sebagai ganjarannya, mereka itulah orang yang akan mewarisi, yakni mewarisi dan memperoleh surga firdaus. Mereka akan kekal di dalam kenikmatan dan kebahagiaan-Nya. 12-13. Usai menguraikan keberuntungan orang mukmin beserta sifat mereka, Allah lalu menyusulinya dengan uraian tentang proses kejadian manusia yang amat mengagumkan; suatu proses yang semestinya mendorong setiap manusia untuk beriman. Dan sungguh, kami telah menciptakan manusia bermula dari suatu saripati yang berasal dari tanah. Kemudian kami menjadikannya, yaitu saripati itu, air mani yang disimpan dalam tempat yang kokoh, yakni rahim."
  }
]