[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Aku memberi balasan kepada golongan dari hamba-hambaKu, kaum Mukminin ini, dengan keberuntungan memperoleh surga, dikarenakan kesabaran mereka menghadapi gangguan dalam ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Sesungguhnya Aku memberi orang-orang beriman itu balasan berupa Surga pada hari Kiamat kelak, karena kesabaran mereka di atas ketaatan kepada Allah, dan kesabaran mereka atas celaan dan penderitaan yang kalian tujukan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. إِنِّى جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوٓا۟ أَنَّهُمْ هُمُ الْفَآئِزُونَ (Sesungguhnya Aku memberi balasan kepada mereka di hari ini, karena kesabaran mereka; sesungguhnya mereka itulah orang-orang yang menang”) Yakni Aku balas mereka dengan kemenangan pada hari ini berkat kesabaran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Sesungguhnya pada hari ini Aku memberi balasan kepada mereka, sebab kesabaran yang telah mereka atas perlakuan kalian. Balasan berupa keberuntungan dan derajat yang tinggi di surga \""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Aku memberi balasan kepada mereka pada hari itu karena kesabaran mereka. Sesungguhnya mereka itulah orang-orang yang menang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111 “sesungguhnya aku memberikan balasan kepada mereka di hari ini karena kesabaran mereka,” atas ketaatan kepadaku dan ganguan yang kalian lancarkan (kepada mereka) hingga mereka berhasil sampai kepadaKu. “sesungguhnya mereka itulah orang-orang yang menang,” berhasil meraih kenikmatan yang lestari dan keselamatan dari Neraka Jahim. Sebagaimana Allah berfirman dalam ayat lain, “maka pada hari ini, orang-orang yang beriman menertawakan orang-orang kafir.” (al-muthafifin:34)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 111: Yakni, terhadap ejekan dan gangguan kamu dan tetapnya mereka menaati-Ku. Dengan memperoleh kenikmatan yang kekal (surga) dan selamat dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 111",
    "description": "111. Untuk membangkitkan penyesalan yang lebih dalam di hati para pendurhaka itu, Allah berfirman, 'sesungguhnya pada hari ini aku memberi balasan yang sempurna dan menyenangkan kepada mereka, yakni kaum mukmin yang kamu ejek itu, karena kesabaran mereka dalam melaksanakan ajaran-ku dan menghadapi gangguan kamu; sesungguhnya mereka itulah orang-orang yang memperoleh kemenangan sejati, yaitu derajat yang tinggi di surga. 112-114. Melanjutkan pertanyaan bernada kecaman yang Allah tujukan kepada para pendurhaka, dia berfirman, 'berapa tahunkah lamanya kamu tinggal di bumi'' mereka menjawab, 'kami tinggal di bumi hanya sehari atau setengah hari, kami tidak tahu persis. \" Allah melanjutkan, 'maka tanyakanlah kepada mereka, yaitu para malaikat, yang menghitung dan mencatat umur manusia, atau tanyakan kepada manusia yang memahami perhitungan untuk membuktikan kebenaran kami. ' dia berfirman, 'kamu tidak tinggal di bumi melainkan hanya sebentar saja, jika kamu benar-benar mengetahui. '"
  }
]