[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang celaka di neraka akan ditanya, “Berapa lama kalian berada di dunia dalam hitungan tahun? Dan berapa lama kalian menyia-nyiakan ketaatan kepada Allah di dalamnya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Dia berfirman, \"Berapa tahunkah kalian menetap di bumi? Dan berapa lama kalian melalaikan waktu kehidupan kalian di dalamnya?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112-114. Allah berfirman sebagai bentuk pengolokan: “Berapa lama kalian hidup di dunia?” Mereka menjawab: “Kami hanya hidup sehari atau kurang dari itu, maka tanyalah orang yang menghitung berapa lama.” Allah berfirman: “kalian hanya hidup di dunia sebentar saja, seandainya kalian mengerti hal ini niscaya kalian akan mengetahui kehinaan dunia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. قٰلَ كَمْ لَبِثْتُمْ فِى الْأَرْضِ عَدَدَ سِنِينَ (Allah bertanya: “Berapa tahunkah lamanya kamu tinggal di bumi?”) Ketika mereka meminta kembali ke dunia, Allah bertanya kepada mereka dengan pertanyaan ini untuk menjelaskan kepada mereka bahwa mereka telah dihidupkan di dunia sebagaimana yang orang ingat, meskipun itu hanya sebentar jika dibandingkan dengan kehidupan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112. Allah bertanya kepada orang-orang kafir: \"Berapa tahunkah lamanya kalian tinggal di dunia dan mati di dalam kubur? Juga berapa lama kalian merasakan nikmat dunia kalian?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman} Allah SWT berfirman {“Berapa tahun lamanya kalian tinggal di bumi”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112-114 “Allah bertanya” dalam rangka untuk mencela dan menetapkan bahwasaannya mereka itu orang-orang yang dungu, dalam waktu yang sejenak saja mereka sudah membukukan setiap kejelekan yang mendorong mereka menuju kemurkaan dan hukumanNYa. Mereka tidak menghasilkan kebaikan yang diperoleh oleh kaum Mukminin yang mengantarkan mereka menuju kebahagiaan abadi dan keridhaan Rabb mereka, “berapa tahunkah lamanya kamu tinggal di bumi?” mereka menjawab,”kami tinggal di bumi sehari atau setengah hari.” Jawaban mereka ini berlandaskan pada anggapan mereka begitu pendeknya masa tinggal mereka di dunia. Pernyataan ini, sudah memperlihatkan sebuah manfaat. Akan tetapi, tidak menunjukkan kadar sebenarnya dan tidak menentukannya. Karena itu, mereka berkata, “maka tanyakanlah kepada orang-orang yang menghitung,” yaitu orang-orang yang benar-benar menguasai hitungannya. Adapun mereka, berada dalam kesibukan yang sangat merepotkan dan siksa yang melupakan tentang hitungannya. Maka Allah berkata kepada mereka, “kamu tidak tinggal (dibumi) melainkan sebentar saja,” baik kalian telah menetapkan jangkanya atau tidak “kalau kamu mengetahui”."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 112: Untuk mencela dan membuktikan bahwa mereka adalah orang-orang yang kurang akal, karena mereka mengisi waktu yang singkat dengan keburukan yang sesungguhnya membawa mereka kepada kemurkaan Allah dan siksaan-Nya, serta tidak mengisi waktunya dengan kebaikan seperti yang dilakukan kaum mukmin, sehingga memperoleh kebahagiaan yang kekal dan keridhaan Tuhan mereka. Di dunia dan di kubur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 112",
    "description": "112-114. Melanjutkan pertanyaan bernada kecaman yang Allah tujukan kepada para pendurhaka, dia berfirman, 'berapa tahunkah lamanya kamu tinggal di bumi'' mereka menjawab, 'kami tinggal di bumi hanya sehari atau setengah hari, kami tidak tahu persis. \" Allah melanjutkan, 'maka tanyakanlah kepada mereka, yaitu para malaikat, yang menghitung dan mencatat umur manusia, atau tanyakan kepada manusia yang memahami perhitungan untuk membuktikan kebenaran kami. ' dia berfirman, 'kamu tidak tinggal di bumi melainkan hanya sebentar saja, jika kamu benar-benar mengetahui"
  }
]