[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab lantaran beratnya situasi dan dahsyatnya siksaan, “Kami (hanya) tinggal di sana selama sehari saja, atau setengah hari saja. Maka tanyalah para penghitung yang menghitung jumlah bulan dan jumlah hari.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Mereka menjawab, \"Kami tinggal di bumi sehari atau setengah hari saja. Maka tanyakan lah kepada orang-orang yang memiliki ilmu hisab/perhitungan hari dan bulan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. قَالُوا۟ لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ (Mereka menjawab: “Kami tinggal (di bumi) sehari atau setengah hari) Mereka menganggap kehidupan mereka di dunia sangat pendek karena mereka sedang menjalani azab yang sangat berat. فَسْـَٔلِ الْعَآدِّينَ (maka tanyakanlah kepada orang-orang yang menghitung”) Yakni orang-orang yang pandai menghitung. Mereka lupa berapa tahun mereka hidup di dunia karena kengerian yang mereka hadapi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113. Mereka menjawab: \"Kami tinggal di dunia hanya sehari saja atau bahkan hanya setengah hari.” Maka tanyakanlah kepada para malaikat yang menghitung umur manusia atau orang-orang yang ahli dalam bidang perhitungan mereka akan menunjukkan kebenaran perkataan Kami.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Kami tinggal sehari atau setengah hari. Jadi tanyalah kepada mereka yang menghitung”} para penghitung yang menghitung bulan-bulan dan hari-hari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112-114 “Allah bertanya” dalam rangka untuk mencela dan menetapkan bahwasaannya mereka itu orang-orang yang dungu, dalam waktu yang sejenak saja mereka sudah membukukan setiap kejelekan yang mendorong mereka menuju kemurkaan dan hukumanNYa. Mereka tidak menghasilkan kebaikan yang diperoleh oleh kaum Mukminin yang mengantarkan mereka menuju kebahagiaan abadi dan keridhaan Rabb mereka, “berapa tahunkah lamanya kamu tinggal di bumi?” mereka menjawab,”kami tinggal di bumi sehari atau setengah hari.” Jawaban mereka ini berlandaskan pada anggapan mereka begitu pendeknya masa tinggal mereka di dunia. Pernyataan ini, sudah memperlihatkan sebuah manfaat. Akan tetapi, tidak menunjukkan kadar sebenarnya dan tidak menentukannya. Karena itu, mereka berkata, “maka tanyakanlah kepada orang-orang yang menghitung,” yaitu orang-orang yang benar-benar menguasai hitungannya. Adapun mereka, berada dalam kesibukan yang sangat merepotkan dan siksa yang melupakan tentang hitungannya. Maka Allah berkata kepada mereka, “kamu tidak tinggal (dibumi) melainkan sebentar saja,” baik kalian telah menetapkan jangkanya atau tidak “kalau kamu mengetahui”."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 113: Mereka meragukannya dan menganggap sebentar sekali karena dahsyatnya azab ketika itu. Yaitu para malaikat yang menjumlahkan amal manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 113",
    "description": "112-114. Melanjutkan pertanyaan bernada kecaman yang Allah tujukan kepada para pendurhaka, dia berfirman, 'berapa tahunkah lamanya kamu tinggal di bumi'' mereka menjawab, 'kami tinggal di bumi hanya sehari atau setengah hari, kami tidak tahu persis. \" Allah melanjutkan, 'maka tanyakanlah kepada mereka, yaitu para malaikat, yang menghitung dan mencatat umur manusia, atau tanyakan kepada manusia yang memahami perhitungan untuk membuktikan kebenaran kami. ' dia berfirman, 'kamu tidak tinggal di bumi melainkan hanya sebentar saja, jika kamu benar-benar mengetahui. ' 112-114"
  }
]