[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka,”Tidaklah kalian tinggal kecuali sebentar saja. Seandainya kalian mau bersabar untuk taat kepada Allah, pastilah kalian beruntung memperoleh surga, sekiranya kalian memiliki ilmu tentang itu.” Demikian ini lantaran masa tinggal mereka di dunia amat sebentar dibandingkan dengan lamanya masa tinggal mereka di neraka yang kekal abadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Dia berfirman, \"Kalian tidaklah tinggal di dunia kecuali hanya sebentar. Sungguh, bila kalian mengetahui sebentarnya masa kehidupan kalian di dunia, niscaya kalian akan mudah bersabar di atas ketaatan-Ku.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. قٰلَ إِن لَّبِثْتُمْ إِلَّا قَلِيلًا ۖ (Allah berfirman: “Kamu tidak tinggal (di bumi) melainkan sebentar saja) Yakni kalian tidak tinggal di bumi kecuali sebentar saja. لَّوْ أَنَّكُمْ كُنتُمْ تَعْلَمُونَ(kalau kamu sesungguhnya mengetahui”) Yakni jika kalian memiliki sedikit pengetahuan niscaya kalian sekarang akan mengetahui betapa sebentarnya kalian tinggal di bumi dan niscaya kalian akan menyibukkan diri kalian dengan ketaatan kepada Allah untuk persiapan menghadapi hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Allah berfirman: \"Kalian tidak tinggal di dunia melainkan hanya sebentar saja, kalau kalian mengetahui lamanya kalian di dunia jika dibandingkan dengan lamanya kalian dibakar di neraka.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berfirman} Allah SWT berfirman kepada mereka {“Kalian tidak tinggal} kalian tidak tinggal di dunia {kecuali hanya sebentar jika kalian benar-benar mengetahui ”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112-114 “Allah bertanya” dalam rangka untuk mencela dan menetapkan bahwasaannya mereka itu orang-orang yang dungu, dalam waktu yang sejenak saja mereka sudah membukukan setiap kejelekan yang mendorong mereka menuju kemurkaan dan hukumanNYa. Mereka tidak menghasilkan kebaikan yang diperoleh oleh kaum Mukminin yang mengantarkan mereka menuju kebahagiaan abadi dan keridhaan Rabb mereka, “berapa tahunkah lamanya kamu tinggal di bumi?” mereka menjawab,”kami tinggal di bumi sehari atau setengah hari.” Jawaban mereka ini berlandaskan pada anggapan mereka begitu pendeknya masa tinggal mereka di dunia. Pernyataan ini, sudah memperlihatkan sebuah manfaat. Akan tetapi, tidak menunjukkan kadar sebenarnya dan tidak menentukannya. Karena itu, mereka berkata, “maka tanyakanlah kepada orang-orang yang menghitung,” yaitu orang-orang yang benar-benar menguasai hitungannya. Adapun mereka, berada dalam kesibukan yang sangat merepotkan dan siksa yang melupakan tentang hitungannya. Maka Allah berkata kepada mereka, “kamu tidak tinggal (dibumi) melainkan sebentar saja,” baik kalian telah menetapkan jangkanya atau tidak “kalau kamu mengetahui”."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 114: Baik kamu menjumlahkan waktunya maupun tidak. Maksudnya, mereka hendaknya mengetahui bahwa hidup di dunia itu hanya sebentar saja, jika dibandingkan dengan menetap di neraka. Oleh sebab itu, seharusnya mereka tidak hanya mencurahkan perhatian kepada urusan dunia saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 114",
    "description": "112-114. Melanjutkan pertanyaan bernada kecaman yang Allah tujukan kepada para pendurhaka, dia berfirman, 'berapa tahunkah lamanya kamu tinggal di bumi'' mereka menjawab, 'kami tinggal di bumi hanya sehari atau setengah hari, kami tidak tahu persis. \" Allah melanjutkan, 'maka tanyakanlah kepada mereka, yaitu para malaikat, yang menghitung dan mencatat umur manusia, atau tanyakan kepada manusia yang memahami perhitungan untuk membuktikan kebenaran kami. ' dia berfirman, 'kamu tidak tinggal di bumi melainkan hanya sebentar saja, jika kamu benar-benar mengetahui. '115-116. Mengingatkan para pendurhaka terkait kelengahan mereka, Allah berfirman, 'maka apakah kamu mengira bahwa kami menciptakan kamu main-main, yakni tanpa tujuan yang jelas; dan apakah kamu juga mengira bahwa kamu tidak akan dikembalikan kepada kami untuk mempertanggungjawabkan perbuatan kamu' adalah keliru bila kamu me-ngira demikan. ' maka mahatinggi Allah, raja yang sebenarnya; tidak ada tuhan yang berhak disembah selain dia, tuhan yang memiliki 'arsy yang mulia."
  }
]