[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian menyangka (wahai sekalian makhluk), bahwa Kami menciptakan kalian dengan membiarkan kalian begitu saja, tanpa ada perintah dan larangan, tidak ada pahala dan siksaan, dan sesungguhnya kalian tidak dikembalikan kepada Kami di akhirat kelak untuk menghadapi perhitungan amal dan pembalasannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Maka apakah kalian mengira -wahai manusia- bahwasanya Kami menciptakan kalian secara main-main saja tanpa adanya hikmah dan maksud di balik itu, juga tanpa adanya pahala, dan azab seperti halnya binatang ternak, dan bahwasanya kalian tidak akan dikembalikan kepada Kami pada hari Kiamat kelak untuk dihisab dan diberikan balasan?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "115-116. Hai para hamba, apakah kalian mengira Kami menciptakan kalian untuk hal yang sia-sia dan kebatilan tanpa memberi pahala dan siksa, dan mengira kalian tidak akan kembali kepada Kami untuk dihisab? Kenyataannya bukan seperti yang kalian kira. Maha Suci Allah, Raja yang sebenarnya dari menciptakan makhluk untuk hal yang sia-sia. Tidak ada Tuhan selain Dia, Tuhan ‘arsy yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنٰكُمْ عَبَثًا (Maka apakah kamu mengira, bahwa sesungguhnya Kami menciptakan kamu secara main-main?) Yakni lalu Kami melalaikan kalian? Sebagaimana penciptaan hewan ternak, tanpa memberi pahala atau siksaan? وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ(dan bahwa kamu tidak akan dikembalikan kepada Kami?) Dengan membangkitkan dan mengumpulkan kalian kemudian Kami membalas amalan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Maka apakah kalian mengira, bahwa sesungguhnya Kami menciptakan kalian ini hanya main-main saja. Juga kalian kira tidak akan dikembalikan kepada Kami pada hari kebangkitan, kemudian hari perhitungan dan pembalasan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian mengira} apakah kalian mengira {bahwa Kami menciptakan kalian main-main} main-main dan sia-sia, tidak ada hikmah{dan kalian tidak akan dikembalikan kepada Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115 Maksudnya, “maka apakah kamu mengira,” wahai makhluk, “bahwa sesungguhnya kami menciptakan kamu secara main-main (saja),” yaitu sia-sia dan batil, kalian makan dan minum, berjalan dan menikmati kelezatan dunia, sementara kami membiarkan kalian tanpa memerintah dan melarang, tanpa memberi pahala dan hukuman. Oleh karena itu, Dia berfirman, ”dan bahwa kamu tidak akan dikembalikan kepada Kami,” hal ini tidak terbetik di dalam hatimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 115: Wahai manusia. Yakni sekedar main-main, untuk makan, minum, bersenang-senang dan menikmati kenikmatan dunia, tidak diperintah dan tidak dilarang. Yang demikian jelas bertentangan dengan hikmah (kebijaksanaan) Allah. Manusia diciptakan Allah untuk beribadah kepada-Nya, dibebankan perintah dan larangan agar dijaga dan setelah itu mereka akan diberi balasan terhadap perbuatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 115",
    "description": "115-116. Mengingatkan para pendurhaka terkait kelengahan mereka, Allah berfirman, 'maka apakah kamu mengira bahwa kami menciptakan kamu main-main, yakni tanpa tujuan yang jelas; dan apakah kamu juga mengira bahwa kamu tidak akan dikembalikan kepada kami untuk mempertanggungjawabkan perbuatan kamu' adalah keliru bila kamu me-ngira demikan. ' maka mahatinggi Allah, raja yang sebenarnya; tidak ada tuhan yang berhak disembah selain dia, tuhan yang memiliki 'arsy yang mulia"
  }
]