[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Mahatinggi Allah, Maha Raja Yang bertindak terhadap segala sesuatu, Yang Maha Haq, janjinya Haq, ancamanNya juga haq dan segala sesuatu dariNya adalah haq. Mahasuci Dia dari menciptakan sesuatu dengan main-main dan tanpa tujuan. Tidak ada Tuhan yang berhak disembah kecuali Dia, Tuhan Arasy yang mulia yang merupakan makhluk yang paling besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Mahasuci Allah, Raja Yang Mengatur seluruh makhluk sekehendak-Nya, Dia lah Żat yang benar, janji-Nya benar, firman-Nya benar, tiada tuhan yang berhak disembah melainkan Dia, Tuhan pemilik Arasy yang merupakan makhluk terbesar, dan siapa yang menjadi Tuhan pemilik makhluk terbesar maka Dia lah yang berhak menjadi Tuhan dan pemilik seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. فَتَعٰلَى اللهُ (Maka Maha Tinggi Allah) Maha Suci Allah dari menciptakan sesuatu dengan sia-sia. الْمَلِكُ(Raja) Satu-satunya yang berhak memiliki seluruh kerajaan. الْحَقُّ ۖ (Yang Sebenarnya) Dan kerajaan milik selain-Nya akan sirna. لَآ إِلٰهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْكَرِيمِ (tidak ada Tuhan selain Dia, Tuhan (Yang mempunyai) ‘Arsy yang mulia) Maka bagaimana Dia bukan Tuhan dan Rabb bagi makhluk-makhluk yang berada di bawah ‘Arsy yang mulia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116. Maha Tinggi dan Maha Suci Allah dari sifat memiliki anak dan dari tuhan lain atau segala yang tidak sesuai dengan kemahasucian-Nya. Raja Yang Sebenarnya; Yang Maha Tetap tidak akan binasa tidak ada Tuhan selain Dia, Tuhan Yang mempunyai ´Arsy yang mulia atau kursi yang mulia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maha tinggi} Maha agung dan Maha suci {Allah, Raja yang sebenarnya. Tidak ada tuhan selain Dia, tuhan ‘Arsy yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116 “Maka MahaTinggi Allah,” maksudnya, Mahaagung dan Mahatinggi dari dugaan batil ini yang (berujung) kembali pada celaan di dalam hikmahNya.”raja yang sebenarnya; tidak ada tuhan (yang berhak disembah) kecuali Dia, Rabb (yang mempunyai) Arasy yang mulia.” Kedudukannya sebagai Raja bagi seluruh makhluk, yang benar di dalam kejujuran, janji, [dan] ancamanNYa, sebagai Rabb dari Arasy yang mulia dan segala sesuatu yang dibawahnya, termasuk bab yang paling utama, yaitu tercegah menciptakanmu dalam keadaan sia-sia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 116: Ibnu Katsir rahimahullah menyebutkan dalam tafsirnya, bahwa akhir khutbah Umar bin ‘Abdul ‘Aziz setelah Beliau memuji Allah dan menyanjung-Nya, Beliau berkata, “Amma ba’du. Wahai manusia! Sesungguhnya kamu tidak diciptakan untuk main-main dan tidak ditinggalkan begitu saja. Kamu mempunyai tempat kembali yang di sana Allah turun untuk menetapkan hukum dan keputusan-Nya di antara kamu. Maka sungguh, kecewa, rugi dan celaka seorang hamba yang dikeluarkan Allah dari rahmat-Nya dan diharamkan mendapatkan surga-Nya yang luasnya seluas langit dan bumi. Tidakkah kamu mengetahui, bahwa tidak ada yang diberikan keamanan dari azab Allah kecuali orang yang berhati-hati dan takut di hari ini, yang menjual sesuatu yang fana dengan yang kekal, yang sedikit dengan yang banyak, dan yang menjual rasa takut dengan keamanan. Tidakkah kamu mengetahui, bahwa kamu adalah keturunan generasi yang telah binasa, dan setelahmu masih ada lagi pengganti sehingga kamu dating menghadap kepada Pewaris yang sebaik-baiknya? Kamu pun setiap hari mengiringi orang yang pulang pagi atau sore menghadap kepada Allah ‘Azza wa Jalla karena telah menuntaskan umurnya dan habis ajalnya, lalu kamu menurunkannya ke dalam belahan bumi, yang tidak diberi tikar dan bantal, yang telah berpisah dengan para kekasih, menyatu dengan tanah dan akan mendatangi hisab, lagi tergadai oleh amalnya, tidak butuh kepada apa yang ditinggalkannya, butuh kepada amalnya. Maka bertakwalah kepada Allah wahai hamba-hamba Allah, sebelum selesai perjanjian-Nya dan maut datang menjemputmu.” Ketika itu Umar bin ‘Abdul ‘Aziz mengambil ujung selendangnya dan menaruhnya ke muka, ia pun menangis dan menangis pula orang-orang yang berada di sekitarnya. (Diriwayatkan oleh Ibnu Abi Hatim dari salah seorang keluarga Sa’id bin Al ‘Aaash). Dari menciptakan kamu untuk main-main dan berbuat yang tidak layak bagi-Nya ‘Arsy disebut karim (mulia) karena indah dipandang dan indah bentuknya. Ia merupakan atap seluruh makhluk. Jika ‘arsy yang begitu besar diciptakan dan diatur-Nya, maka yang di bawahnya apalagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 116",
    "description": "115-116. Mengingatkan para pendurhaka terkait kelengahan mereka, Allah berfirman, 'maka apakah kamu mengira bahwa kami menciptakan kamu main-main, yakni tanpa tujuan yang jelas; dan apakah kamu juga mengira bahwa kamu tidak akan dikembalikan kepada kami untuk mempertanggungjawabkan perbuatan kamu' adalah keliru bila kamu me-ngira demikan. ' maka mahatinggi Allah, raja yang sebenarnya; tidak ada tuhan yang berhak disembah selain dia, tuhan yang memiliki 'arsy yang mulia. 117. Dan barang siapa menyembah tuhan yang lain selain Allah, padahal tidak ada suatu bukti pun baginya tentang kebenaran penyembahan itu, maka perhitungannya, yaitu balasannya, hanya pada tuhannya. Sesungguhnya orang-orang kafir itu tidak akan beruntung. Melalui ayat ini Allah secara tersirat mengingatkan bahwa orang yang menyembah-Nya dengan tulus ikhlas akan memperoleh keberuntungan."
  }
]