[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa menyembah tuhan sesembahan yang lain bersama Allah, Dzat Yang Maha Esa, tanpa ada alasan baginya tentang kepantasannya untuk disembah, maka sesungguhnya balasannya atas tindakannya yang buruk itu di sisi Allah di akhirat. Sesungguhnya tidak ada keberuntungan baginya dan tidak ada keselamatan bagi orang-orang kafir pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Dan barangsiapa yang menyembah tuhan lain selain Allah tanpa memiliki hujah atas bukti dan hak penyembahannya (dan semua yang disembah selain Allah sama sekali tidak memiliki hujah), maka balasan amal buruknya ini ada di sisi Allah, Dia lah yang akan memberikannya balasan berupa azab atas amal buruknya tersebut, sesungguhnya orang-orang kafir itu tidak akan beruntung dengan tidak meraih apa yang mereka cita-citakan (Surga) dan rida Allah, dan tidak pula selamat dari apa yang mereka takuti (Neraka)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117. Dan barangsiapa yang menyembah tuhan selain Allah tanpa memiliki hujjah -karena tidak ada Tuhan yang berhak disembah selain Allah-, maka siksaan baginya di sisi Allah pada hari kiamat. Sungguh orang-orang yang ingkar tidak akan beruntung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. لَا بُرْهٰنَ لَهُۥ بِهِۦ (padahal tidak ada suatu dalilpun baginya tentang itu) Makna (البرهان) adalah hujjah dan bukti yang jelas. Tidak ada tuhan selain Allah yang memiliki bukti yang jelas yang menyatakan bahwa ia benar-benar tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Barangsiapa menyembah tuhan yang lain selain Allah, padahal tidak ada suatu dalilpun baginya tentang itu. Maka sesungguhnya perhitungan tentang perbuatannya itu berada di tangan Tuhannya. Sesungguhnya orang-orang yang kafir itu tidak akan beruntung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang menyembah tuhan yang lain bersama Allah, padahal tidak ada suatu bukti baginya tentang itu} tidak ada bukti baginya atas hal itu {maka perhitungannya ada di sisi Tuhannya. Sesungguhnya orang-orang kafir itu tidak akan beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117. Maksudnya, dan barangsiapa yang menyembah tuhan lain bersama Allah tanpa ada bukti dari perintahNya dan tanpa ada petunjuk atas hal tersebut, maka ini menunjukkan atas sikap (syirik) yang mana dia berpegang teguh padanya. Ini adalah aturan yang melazimkan (syirik). Maka setiap orang yang menyembah tuhan selain Allah, lalau dia tidak mendapatkan petunjuk atas hal tersebut, bahkan bukti petunjuk itu, menunjukan pada kebatilan sikap (syirik) yang dia pegang teguh, lalu dia berpaling darinya karena zhalim dan keras kepala, maka orang ini akan menghadap Rabbnya, lalu Dia memberikan balasan atas perbuatannya. Dia tidak akan memberikan kepadanya keberuntungan sedikitpun, karena dia telah kafir. “sesungguhnya orang-orang kafir itu tiada beruntung.” Kekafiran itu mencegah mereka dari keberuntungan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 117: Bahkan dalil yang ada malah menunjukkan batilnya menyembah selain Allah, namun ia malah berpaling dan membangkang darinya, maka orang ini akan menghadap Allah, dan Dia akan memberikan balasan terhadapnya serta tidak akan menyampaikannya kepada keberuntungan sedikit pun, karena dia kafir, dan kekafiran menghalangi seseorang beruntung. Yakni balasannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 117",
    "description": "117. Dan barang siapa menyembah tuhan yang lain selain Allah, padahal tidak ada suatu bukti pun baginya tentang kebenaran penyembahan itu, maka perhitungannya, yaitu balasannya, hanya pada tuhannya. Sesungguhnya orang-orang kafir itu tidak akan beruntung. Melalui ayat ini Allah secara tersirat mengingatkan bahwa orang yang menyembah-Nya dengan tulus ikhlas akan memperoleh keberuntungan. 118. Dan katakanlah, wahai nabi Muhammad, 'ya tuhanku, berilah ampunan kepadaku dan umatku, dan berilah rahmat kepada kami semua. Engkau adalah maha pengampun dan engkaulah pemberi rahmat yang terbaik. '[]."
  }
]