[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah wahai Nabi, “Wahai Tuhanku, maafkanlah dosa-dosa dan berilah rahmat. Sesungguhnya Engkau adalah sebaik-baik Dzat yang merahmati orang yang memiliki dosa dan tidak menyiksanya karena dosanya, maka terimalah taubatnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Dan katakanlah -wahai Rasul-, \"Wahai Tuhanku! Ampunilah dosa-dosaku, dan curahkanlah kepadaku rahmat-Mu, sebab Engkaulah sebaik-baik pemberi rahmat pada orang yang berdosa, lalu menerima tobatnya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Hai Rasulullah, katakanlah: “Ya Allah, ampunilah aku dan orang-orang beriman, dan rahmatilah kami dengan rahmat-Mu yang luas, Engkau adalah sebaik-baik pemberi rahmat dan rahmat-Mu meliputi segalanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. وَقُل رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرّٰحِمِينَ (Dan katakanlah: “Ya Tuhanku berilah ampun dan berilah rahmat, dan Engkau adalah Pemberi rahmat Yang Paling baik”) Allah memerintahkan Rasulullah untuk beristighfar agar umatnya meneladaninya dalam mengerjakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118. Katakanlah wahai Nabi: \"Ya Tuhanku, ampunilah aku beserta orang-orang mukmin. Rahmati dan kasihanilah hamba-hamba-Mu dengan rahmat yang luas baik hamba-Mu yang berbuat baik atau berbuat buruk. Engkau adalah Pemberi rahmat Yang Paling baik\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Ya Tuhanku, berilah ampunan dan rahmat. Engkaulah sebaik-baik pemberi rahmat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118 “dan katakanlah” untuk menyembah Rabbmu dengan ikhlas kepada agama islam, “Ya Rabbku, berilah ampun” untuk kami hingga engkau menyelamatkan kami dari (neraka) yang dibenci, dan berilah kami rahmat agar Engkau menyampaikan kami kepada segala kebaikan dengan rahmatMu. “ dan Engkau adalah pemberi rahmat Yang paling baik,” sehingga segala pemberi bagi hamba, maka Allah-lah yang yang lebih baik darinya untuk hamba, lebih memberi rahmat terhadap hambaNya daripada seorang ibu kepada anaknya, serta lebih memberi rahmat kepada dirinya daripada dirinya sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 118: Seraya berdoa kepada Tuhanmu dengan mengikhlaskan ibadah kepada-Nya. Agar kami selamat dari semua yang tidak diinginkan. Agar dengan rahmat-Mu kami dapat mencapai semua kebaikan. Setiap yang memiliki rasa kasihan kepada seorang hamba, maka Allah lebih baik lagi daripadanya. Dia lebih sayang kepada hamba-Nya daripada seorang ibu terhadap anaknya dan daripada rasa sayang seseorang terhadap dirinya. Selesai tafsir surah Al Mu’minun dengan pertolongan Allah dan taufiq-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 118",
    "description": "118. Dan katakanlah, wahai nabi Muhammad, 'ya tuhanku, berilah ampunan kepadaku dan umatku, dan berilah rahmat kepada kami semua. Engkau adalah maha pengampun dan engkaulah pemberi rahmat yang terbaik. '[]1. Surah ini dibuka dengan penegasan bahwa ketentuan hukum Allah wajib dilaksanakan. 'inilah suatu surah yang kami turunkan dan kami wajibkan bagi kamu untuk menjalankan hukum-hukum di dalam-Nya, dan kami turunkan di dalamnya tanda-tanda yang jelas tentang kekuasaan dan keesaan kami agar kamu selalu ingat dan mengambil pelajaran darinya."
  }
]