[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menciptakan Adam dari tanah yang diambil dari seluruh tempat di muka bumi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan sungguh Kami telah ciptakan ayah dari seluruh manusia, Adam, dari tanah. Tanah penciptaannya berasal dari saripati hasil campuran air dengan tanah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-13. Allah menjelaskan dengan terperinci tahap-tahap penciptaan manusia dan sumber kehidupan yang Allah siapkan bagi manusia berupa hewan-hewan dan tumbuh-tumbuhan. Hal ini untuk menjelaskan besarnya kekuasaan dan luasnya rahmat Allah, dan ini sebagaimana yang Allah sebutkan dalam sebelas ayat ini: Sungguh Kami telah menciptakan Adam dari segumpal tanah, dan Kami ciptakan keturunan Adam dari air mani yang dipancarkan laki-laki ke dalam rahim perempuan, sehingga air mani itu menetap di dalam rahim yang kokoh itu dan terjadi pembuahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. مِن سُلٰلَةٍ مِّن طِينٍ (dari suatu saripati (berasal) dari tanah) Yakni dari air mani yang dikeluarkan oleh manusia yang berasal dari tanah yang digunakan untuk menciptakan Nabi Adam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sesungguhnya Kami telah menciptakan manusia dari suatu saripati air yang berasal dari tanah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menciptakan manusia} Adam {dari sari pati tanah} sari pati tanah yang diambil dari seluruh bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah menyebutkan awal penciptaan moyang manusia, Adam, bahwa beliau berasal “dari suatu saripati dari tanah,” maksudnya dihasilkan dan diambil dari seluruh jenis tanah. Oleh karena itu, keturunannya lahir dalam warna seperti warna tanah. Ada yang baik, buruk dan sedang-sedang saja, ada yang mudah, sulit dan yang bersifat antara keduanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 12: Di ayat ini Allah Subhaanahu wa Ta'aala menyebutkan proses perkembangan manusia dari awal penciptaannya sampai akhir hidupnya. Maksudnya, Adam ‘alaihis salam. Yakni diambil dari tanah. Oleh karena itulah, keadaan keturunan Adam seperti keadaan tanah, ada yang baik dan ada yang buruk, ada yang mudah dikelola (diarahkan) dan ada yang keras sebagaimana tanah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 12",
    "description": "12-13. Usai menguraikan keberuntungan orang mukmin beserta sifat mereka, Allah lalu menyusulinya dengan uraian tentang proses kejadian manusia yang amat mengagumkan; suatu proses yang semestinya mendorong setiap manusia untuk beriman. Dan sungguh, kami telah menciptakan manusia bermula dari suatu saripati yang berasal dari tanah. Kemudian kami menjadikannya, yaitu saripati itu, air mani yang disimpan dalam tempat yang kokoh, yakni rahim"
  }
]