[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kemudian Kami menciptakan anak keturunannya secara turun-temurun dari setetes air nuthfah, yaitu air mani lelaki yang keluar dari tulang sulbi mereka, lalu menetap dalam Rahim-rahim kaum wanita."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Lalu Kami menciptakan anak keturunannya berkembang biak dari air mani yang tersimpan kokoh dalam rahim hingga waktu kelahirannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. ثُمَّ جَعَلْنٰهُ (Kemudian Kami jadikan saripati itu) Dilihat dari sisi diri mereka yang merupakan keturunan Nabi Adam. نُطْفَةً فِى قَرَارٍ مَّكِينٍ(air mani (yang disimpan) dalam tempat yang kokoh) Yakni dalam rahim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Kemudian Kami jadikan saripati itu air mani yang disimpan dalam tempat yang kokoh yaitu rahim dalam perut perempuan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami menjadikannya air mani} air mani {di dalam tempat yang kukuh (13)} tempat tinggal yang teguh yaitu rahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “Kemudian Kami jadikan saripati itu,” yaitu (saripati) bangsa manusia “air mani,” yang keluar dari tulang sulbi dan tulang dada lalu selanjutnya menetap “di tempat yang kokoh,” yaitu Rahim wanita, terjaga dari kerusakan, bau dan lain sebagainya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 13: Maksudnya, keturunan Adam. Terpelihara dari kerusakan, angin, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 13",
    "description": "12-13. Usai menguraikan keberuntungan orang mukmin beserta sifat mereka, Allah lalu menyusulinya dengan uraian tentang proses kejadian manusia yang amat mengagumkan; suatu proses yang semestinya mendorong setiap manusia untuk beriman. Dan sungguh, kami telah menciptakan manusia bermula dari suatu saripati yang berasal dari tanah. Kemudian kami menjadikannya, yaitu saripati itu, air mani yang disimpan dalam tempat yang kokoh, yakni rahim. 14. Setelah berada di rahim, kemudian air mani itu kami jadikan sesuatu yang melekat, yang bergantung di dinding rahim, lalu sesuatu yang melekat itu kami jadikan segumpal daging, dan segumpal daging itu kami jadikan tulang belulang, lalu tulang belulang itu kami bungkus dengan daging. Kemudian, setelah kami tiupkan roh kepadanya, kami menjadikannya makhluk yang berbentuk lain yang sepenuhnya berbeda dari unsur-unsur kejadiannya di atas, bahkan berbeda dari makhluk-mahluk lain. Mahasuci Allah, pencipta yang paling baik."
  }
]