[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami menciptakan nuthfah itu menjadi alaqah, yaitu gumpalan darah merah. Lalu selepas empat puluh hari, Kami ciptakan alaqah itu menjadi mudhghah, yaitu gumpalan daging sebesar satu suapan yang dikunyah. Kemudian Kami menciptakan gumpalan daging yang lunak itu menjadi tulang-tulang, lalu Kami membungkus tulang-tulang itu dengan daging, dan setelah itu Kami ciptakan dia menjadi makhluk (dalam bentuk) yang berbeda dengan meniupkan ruh padanya. Mahaberkah Allah yang memperindah ciptaan untuk segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Maka air mani yang tersimpan kokoh dalam rahim tersebut Kami jadikan segumpal darah yang melekat berwarna merah, lalu gumpalan darah merah tersebut Kami jadikan laksana segumpal daging yang telah dikunyah, lalu gumpalan daging tersebut Kami jadikan tulang-belulang mengeras, lalu tulang-belulang tersebut Kami bungkus dengan daging, lalu Kami menjadikannya sebagai makhluk berbeda dengan meniupkan kepadanya ruh, dan mengeluarkannya ke kehidupan dunia. Sungguh Maha Suci Allah, Pencipta yang paling baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Kemudian Kami jadikan air mani itu menjadi segumpal daging yang lembek, seperti daging yang dikunyah oleh manusia. Lalu daging yang lembek itu Kami jadikan tulang belulang, kemudian tulang-tulang itu Kami bungkus dengan daging, dengan menumbuhkan daging di antara setiap tulang sesuai dengan ukurannya. Kemudian Kami menjadikannya janin, sebagai makhluk yang baru dengan meniupkan ruh kepadanya setelah berlalu empat bulan dalam rahim ibunya. Sungguh besar kebaikan Allah, dan sungguh mulia kekuasaan dan perhatian-Nya, yang telah menyempurnakan setiap ciptaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً (Kemudian air mani itu Kami jadikan segumpal darah) Yakni Allah merubah air mani yang putih menjadi segumpal darah yang merah. فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً(lalu segumpal darah itu Kami jadikan segumpal daging) Yakni segumpal daging yang belum terbentuk, kemudian menjadi segumpal daging yang terbentuk pada fase selanjutnya. فَخَلَقْنَا الْمُضْغَةَ عِظٰمًا(dan segumpal daging itu Kami jadikan tulang belulang) Yakni tulang yang mengeras agar menjadi penopang badan dengan bentuk-bentuk yang tersendiri. فَكَسَوْنَا الْعِظٰمَ لَحْمًا(lalu tulang belulang itu Kami bungkus dengan daging) Yakni Allah menumbuhkan daging pada setiap tulang sesuai dengan ukuran yang sesuai. ثم أنشأناه خلقا آخر (Kemudian Kami jadikan dia makhluk yang (berbentuk) lain) Yakni Kami tiupkan ruh kepadanya yang sebelumnya hanyalah benda mati, kemudia Allah mengeluarkannya ke dunia disertai dengan kemampuan yang telah diciptakan baginya. فَتَبَارَكَ اللهُ أَحْسَنُ الْخٰلِقِينَ (Maka Maha sucilah Allah, Pencipta Yang Paling Baik)"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah menciptakan kerongkongan dengan berbagai macam bentuknya: ada yang kecil, besar, keras, lembut, panjang, pendek; dengan perbedaan ini suara yang dkeluarkan olehnya juga sangat berbeda jauh, sekalipun ada yang mirip namun sangat jarang { فَتَبَارَكَ ٱللَّهُ أَحْسَنُ ٱلْخَٰلِقِينَ } \"Maka Maha sucilah Allah, Pencipta Yang Paling Baik.\" 2 ). { فَتَبَارَكَ ٱللَّهُ أَحْسَنُ ٱلْخَٰلِقِينَ } Lafaz تبارك disebutkan beberapa kali dalam al-Qur'an, dan semuanya disandarkan kepada Allah, dan tidak sekali pun disandarkan kepada makhluk, karena makhluk tidak memiliki daya untuk melakukan hal itu"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Kemudian air mani itu Kami jadikan segumpal darah, lalu segumpal darah itu Kami jadikan segumpal daging, dan segumpal daging itu Kami jadikan tulang belulang, lalu tulang belulang itu Kami bungkus dengan daging. Kemudian Kami jadikan dia janin yang berbentuk sempurna yaitu berupa makhluk dengan bentuk lain. Kemudian Kami tiuapkan ruh ke dalamnya sehingga lahir dalam keadaan hidup. Maka Agung dan Maha Suci Allah dalam kekuasaan dan hikmah-Nya. Pencipta dan Penguasa Yang paling baik. Alkhalq adalah berubungan dengan pengadaan dan pentakdiran, yang dimaksud di sini adalah makna kedua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami menjadikan air mani itu sesuatu yang menggantung} gumpalan darah yang kaku {Lalu Kami menjadikan sesuatu yang menggantung itu segumpal daging} potongan daging sebesar sesuatu yang bisa dikunyah {Lalu Kami menjadikan segumpal daging itu tulang belulang. Lalu tulang belulang itu Kami bungkus} Kami bungkus {dengan daging. Kemudian Kami menjadikannya makhluk yang lain} Kemudian Kami meniupkan ke dalamnya ruh kemudian dia menjadi makhluk yang berbeda dengan ciptaan yang pertama {Maha suci Allah sebaik-baik pencipta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Kemudian kami jadikan air mani itu,” yang telah menetap sebelumnya menjadi ”segumpal darah,” yaitu darah merah setelah melewati empat puluh hari sejak menjadi nutfah. Kemudian “kami jadikan segumpal darah itu,” sesudah empat puluh hari berikutnya ”segumpal daging,” yaitu sepotong daging kecil sebesar satu kali kunyahan, karena bentuknya yang kecil. “kemudian kami jadikan segumpal daging itu,” yang lunak sebagai “tulang belulang,” yang keras yang mana daging sudah mengisi celah-celahnya sesuai dengan kebutuhan badan terhadapnya. “lalu tulang belulang itu kami bungkus dengan daging,” maksudnya, Kami menjadikan daging sebagai pembungkus tulang-belulang itu, sebagaimana kami menjadikan tulang-belulang sebagai penyangga daging. Proses ini terjadi pada usia empat puluh hari yang ketiga. “kemudian dia kami jadikan makhluk yang (berbentuk) lain,” ditiupkan padanya ruh, hingga beralih dari kondisi benda mati ke benda hidup. “Maka Mahasuci Allah,” Maha tinggi, Mahabesar dan banyak curahan kebaikanNya, dan Dia adalah “ pencipta yang paling baik,” Jadi, semua penciptaanNya baik. Manusia termasuk makhluk ciptaan Allah yang terbaik, bahkan merupakan makhluk terbaik secara mutlak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 14: Yakni darah yang beku setelah berlalu 40 hari. Setelah berlalu 40 hari. Dengan meniupkan ruh ke dalamnya, sehingga yang sebelumnya makhluk mati menjadi makhluk hidup. Semua ciptaan-Nya baik, namun manusia adalah yang terbaiknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 14",
    "description": "Setelah berada di rahim, kemudian air mani itu kami jadikan sesuatu yang melekat, yang bergantung di dinding rahim, lalu sesuatu yang melekat itu kami jadikan segumpal daging, dan segumpal daging itu kami jadikan tulang belulang, lalu tulang belulang itu kami bungkus dengan daging. Kemudian, setelah kami tiupkan roh kepadanya, kami menjadikannya makhluk yang berbentuk lain yang sepenuhnya berbeda dari unsur-unsur kejadiannya di atas, bahkan berbeda dari makhluk-mahluk lain. Mahasuci Allah, pencipta yang paling baik. 15-16. Setelah manusia lahir dan mengalami pertumbuhan, kemudian setelah itu, yakni setelah melalui proses kehidupan di dunia, sesungguhnya kamu, wahai manusia, pasti mati. Kemudian, setelah kamu mati dan dikuburkan, sesungguhnya kamu akan dibangkitkan dari kuburmu pada hari kiamat untuk mempertanggungjawabkan segala perbuatanmu di dunia."
  }
]