[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian sesungguhnya kalian itu, wahai sekalian manusia, setelah berlalunya fase-fase kehidupan dan habisnya usia, benar-benar akan meninggal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Kemudian setelah kalian -wahai manusia- melewati fase-fase penciptaan dan kehidupan itu, sungguh kalian akan mati tatkala ajal kalian telah tiba."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Hai Manusia, kemudian kalian setelah lahir dan hidup sesuai dengan ajal yang telah ditentukan, kalian akan meninggal; dan setelah kematian dan selesai masa dunia, maka kalian akan dibangkitkan pada hari kiamat dari kubur kalian dalam keadaan hidup untuk menjalani hisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. ثُمَّ إِنَّكُم بَعْدَ ذٰلِكَ لَمَيِّتُونَ (Kemudian, sesudah itu, sesungguhnya kamu sekalian benar-benar akan mati) Yakni setelah fase-fase tersebut maka manusia akan mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Kemudian, sesudah itu, sesungguhnya kamu sekalian wahai manusia benar-benar akan mati ketika ajal kalian sudah tiba"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian, sesungguhnya kalian setelah itu benar-benar akan mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “ kemudian, sesungguhnya kamu sesudah itu,” yaitu (sesudah) penciptaan dan tiupan ruh,” benar-benar akan mati,” disalah satu fase pertumbuhan dan perkembangan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 15: Setelah berwujud manusia dan ditiupkan ruh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 15",
    "description": "15-16. Setelah manusia lahir dan mengalami pertumbuhan, kemudian setelah itu, yakni setelah melalui proses kehidupan di dunia, sesungguhnya kamu, wahai manusia, pasti mati. Kemudian, setelah kamu mati dan dikuburkan, sesungguhnya kamu akan dibangkitkan dari kuburmu pada hari kiamat untuk mempertanggungjawabkan segala perbuatanmu di dunia"
  }
]