[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian sesungguhnya kalian, pasca kematian dan lenyapnya dunia, akan dibangkitkan pada Hari Kiamat dari kubur-kubur kalian untuk menghadapi perhitungan amal dan pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Kemudian setelah kematian itu, kalian akan dibangkitkan dari kubur pada hari Kiamat kelak, agar amal perbuatan yang kalian lakukan segera dihisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. ثُمَّ إِنَّكُمْ يَوْمَ الْقِيٰمَةِ تُبْعَثُونَ (Kemudian, sesungguhnya kamu sekalian akan dibangkitkan di hari kiamat) Dibangkitkan dari kubur menuju padang Mahsyar untuk perhitungan dan hukuman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Kemudian, sesungguhnya kamu sekalian akan dibangkitkan dari kubur di hari kiamat untuk penghitungan amal dan pembalasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian, sesungguhnya kalian pada hari Kiamat akan dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “ kemudian, sesungguhnya kamu sekalian akan dibangkitkan (dari kuburmu) di hari Kiamat,” maka kalian akan menerima balasan amalan kalian, yang baik dan yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 16: Untuk dihisab dan diberikan pembalasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 16",
    "description": "15-16. Setelah manusia lahir dan mengalami pertumbuhan, kemudian setelah itu, yakni setelah melalui proses kehidupan di dunia, sesungguhnya kamu, wahai manusia, pasti mati. Kemudian, setelah kamu mati dan dikuburkan, sesungguhnya kamu akan dibangkitkan dari kuburmu pada hari kiamat untuk mempertanggungjawabkan segala perbuatanmu di dunia. 17. Demikianlah kuasa Allah untuk menciptakan manusia melalui tahapan-tahapan yang sangat mengagumkan. Begitu besar nikmat yang Allah karuniakan kepada manusia. Dan di antara nikmat itu adalah bahwa sungguh, kami telah menciptakan tujuh lapis langit di atas kamu, dan kami tidaklah lengah terhadap ciptaan kami. Kami akan selalu menjaganya untuk kebaikan manusia dan makhluk hidup lainnya."
  }
]