[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menciptakan di atas kalian tujuh lapis langit, sebagian berada di atas sebagian lainnya. Dan Kami tidaklah lalai terhadap makhluk-makhuk. Kami tidak melalaikan suatu makhluk pun dan tidak pula melupakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan sungguh, Kami telah ciptakan di atas kalian -wahai manusia- tujuh langit yang berlapis-lapis. Kami tidaklah lengah terhadap ciptaan Kami, dan tidak pula melupakan dan melalaikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Hai para hamba, Sungguh Kami telah menciptakan di atas kalian tujuh langit yang bertingkat, dan di setiap langit memiliki jalan dan pintu untuk menuju langit di atasnya, sebagaimana yang disebutkan dalam hadits shahih tentang isra mi’raj. Dan Kami sama sekali tidak pernah lalai dari menjaga makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَلَقَدْ خَلَقْنَا فَوْقَكُمْ سَبْعَ طَرَآئِقَ (Dan sesungguhnya Kami telah menciptakan di atas kamu tujuh buah jalan) Yakni langit-langit merupakan jalan-jalan yang sebagiannya di atas sebagian lainnya. وَمَا كُنَّا عَنِ الْخَلْقِ غٰفِلِينَ(dan Kami tidaklah lengah terhadap ciptaan (Kami)) Yakni Kami tidak lalai dalam menjaga tujuh langit tersebut, dan Kami menjaga penghuni bumi dengan tidak menjatuhkan langit pada mereka sehingga mereka semua binasa, atau mereka diguncangkan di bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Sesungguhnya Kami telah menciptakan tujuh lapis/buah langit di atas kalian. Berlapis-lapis, dan tersusun. Kami tidak pernah lalai/lengah untuk menjaga ciptaan Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menciptakan tujuh langit} langit yang bertingkat-tingkar {di atas kalian dan Kami tidaklah lengah terhadap makhluk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Ketika Allah menyebutkan penciptaan anak Adam, maka Dia menyebutkan tempat tinggalnya, serta melimpahnya kenikmatan yang tercurahkan padanya dari segala sisi, Allah berfirman ”Dan sesungguhnya kami telah menciptakan diatasmu,” atap bagi bumi dan kebaikan bagi umat manusia. “tujuh buah jalan (tujuh buah langit),” maksudnya, maksudnya tujuh langit yang bertingkat-tingkat. Setiap tingkatan berada diatas tingkatan lainnya. Langit itu telah dihiasi oleh bintang-bintang, matahari dan bulan dan Allah meletakkan kemaslahatan-kemaslahatan di dalamnya. “Dan kami tidaklah lengah terhadap ciptaan (kami),” Sebagiamana penciptaan kami mencakup seluruh makhluk, begitu pula ilmu kami meliputi segala yang kami ciptakan. Kami tidak melalaikan seorang makhluk pun, dan tidak pula melupakannya. Kami tidaklah mencptakan suatu ciptaan, lantas kami menjadikannya terbengkalai. Kami tidak melupakan langit, hingga ia berakibat roboh ke bumi. Kami tidak melupakan partikel kecil yang berada di gulungan ombak lautan dan permukaan padang yang tandus, dan tidak (pula) binatang melata, melainkan (pasti) kami menganugerahkan rizki baginya, ”Dan tidak ada suatu binatang melata pun di bumi melainkan Allah lah yang memberi rizkinya, dan Dia mengetahui tempat berdiamnya binatang itu dan tempat penyimpananya.” Kerap kali Allah memadukan antara sifat penciptaan dengan ilmuNya. Misalnya Firman Allah “apakah Allah yang menciptakan itu tidak mengetahui (yang kamu tampakan dan rahasiakan). Dan Dia Mahaluas dan MahaMengetahui.” “Benar, Diaberkuasa. Dan Dia-lah Maha pencipta lagi Maha Mengetahui.” Kerana penciptaan makhluk merupakan dalil yang paling kuat menurut akal atas ilmu penciptanya dan hikmahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 17: Setelah Allah menyebutkan tentang penciptaan manusia, Dia menyebutkan tentang tempat tinggalnya dan menyebutkan berbagai nikmat yang dilimpahkan-Nya kepada mereka dari berbagai sisi. Sebagai atap bagi bumi dan untuk maslahat kamu. Masng-masing lapisan di atas yang lain, dan telah dihias dengan bintang, matahari dan bulan serta menyimpankan di dalamnya berbagai maslahat bagi makhluk. Yang di bawah langit itu. Maksudnya, Kami tidak lalai terhadap makhluk Kami dan tidak membiarkannya, Kami tidak lengah terhadap langit, oleh karena itu Kami tahan langit agar tidak menimpa bumi, dan Kami tidak lengah terhadap makhluk sekecil biji sawi pun baik di dasar lautan maupun di tengah padang sahara, kecuali Kami berikan rezekinya. Dalam Al Qur’an, Allah Subhaanahu wa Ta'aala sering menggabung antara penciptaan dan ilmu-Nya, yakni Dia Maha Pencipta lagi Maha Mengetahui. Hal itu, karena penciptaan makhluk terdapat dail yang kuat terhadap pengetahuan dan kebijaksanaan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 17",
    "description": "Demikianlah kuasa Allah untuk menciptakan manusia melalui tahapan-tahapan yang sangat mengagumkan. Begitu besar nikmat yang Allah karuniakan kepada manusia. Dan di antara nikmat itu adalah bahwa sungguh, kami telah menciptakan tujuh lapis langit di atas kamu, dan kami tidaklah lengah terhadap ciptaan kami. Kami akan selalu menjaganya untuk kebaikan manusia dan makhluk hidup lainnya. 18. Dan di antara bentuk pemeliharaan kami adalah bahwa kami turunkan air tawar dalam berbagai bentuk, dari yang cair hingga butir-an es, dari langit dengan suatu ukuran bagi makhluk ciptaan kami; lalu untuk memudahkan pemanfaatannya kami jadikan air itu menetap dan tersimpan di bumi, dan pasti kami berkuasa pula untuk melenyapkannya, namun kami tidak melakukannya karena rahmat kami kepada para makhluk."
  }
]