[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menurunkan dari langit air sesuai dengan kebutuhan makhluk-makhluk dan Kami jadikan bumi tempat menetap bagi air tersebut, dan sesungguhnya Kami benar-benar kuasa untuk melenyapkan air itu. Di sini terkandung peringatan keras dan ancaman bagi orang-orang yang berbuat zhalim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan Kami turunkan air hujan dari langit sesuai kadar kebutuhan makhluk, tidak terlalu banyak hingga merusak, dan tidak pula sedikit hingga tidak mencukupi. Lalu Kami jadikan air hujan itu menetap dibumi agar manusia dan seluruh hewan bisa memanfaatkannya. Sungguh Kami pasti kuasa untuk melenyapkannya sehingga kalian tidak mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Dan Kami menurunkan hujan dari awan sesuai dengan kebutuhan makhluk, kemudian Kami menyimpannya di permukaan bumi, yaitu di sungai-sungai dan parit, dan di dalam tanah seperti di mata air. Dan sungguh Kami berkuasa untuk melenyapkan air itu, sehingga kalian dan hewan ternak kalian akan mati kehausan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَأَنزَلْنَا مِنَ السَّمَآءِ مَآءًۢ (Dan Kami turunkan air dari langit) Yakni air hujan; sebab air hujan adalah asas kehidupan bumi dan binatang-binatang yang ada di atasnya. بِقَدَرٍ(menurut suatu ukuran) Yakni dengan perkiraan Kami, yaitu ukuran yang sesuai untuk kebaikan tumbuh-tumbuhan dan buah-buahan, sebab jika air hujan terlalu banyak tentu akan menjadi sebab kebinasaan. فَأَسْكَنّٰهُ فِى الْأَرْضِ ۖ( lalu Kami jadikan air itu menetap di bumi) Agar manusia dapat memanfaatkannya ketika membutuhkan, seperti air yang menetap pada sumber-sumber mata air, air tanah, sungai-sungai, dan lain sebagainya. وَإِنَّا عَلَىٰ ذَهَابٍۭ بِهِۦ لَقٰدِرُونَ (dan sesungguhnya Kami benar-benar berkuasa menghilangkannya) Yakni sebagaimana Kami mampu untuk menurunkan air itu, maka Kami juga mampu untuk menghilangkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Kami turunkan hujan dari atas awan menurut suatu ukuran yang cukup, sehingga tidak akan sampai menyebabkan kerusakan. Lalu Kami jadikan air hujan itu menetap/tersimpan di bumi. Sehingga menjadi sumber air dan mengaliri sungai. Sebagaimana Kami kuasa menurunkan hujan sesungguhnya Kami juga benar-benar berkuasa untuk menghilangkannya. Sehingga menyebabkan kematian karena kehausan, dan rusaknya tanaman dan makhluk lainnya sebab kekeringan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menurunkan air dari langit sesuai ukuran} sesuai ukuran kebutuhan makhluk {Lalu Kami menjadikan air itu menetap di bumi dan sesungguhnya Kami Maha kuasa melenyapkannya} air itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “ Dan kami turunkan air dari langit,” yang menjadi sumber rizki bagi kalian dan binatang-binatang piaraan kalian sesuai dengan ukuran yang memadai kalian. Dia tidak menguranginya [di mana tidak mencukupi bagi tanah dan pepohonan. Akibatnya, tujuan tidak terwujud, dan tidak pula menambahi dengan kadar yang tidak bisa tertampung], sampai meluluhlantahkan pemukiman, lalu tumbuh-tumbuhan dan pepohonan pun tidak bisa hidup. Bahkan Allah menurunkannya di permukaan bumi, lalu air itu diam dan menetap, mengeluarkan berbagai pasangan tanaman dengan kekuasaan Dzat yang menurunkannya. Allah juga mendiamkannya untuk dipersiapkan menjadi simpanan air tanah, tidak menggelontor ke bawah hingga tidak bisa di capai dan tidak bisa dijangkau dasarnya. “Dan sesungguhnya kami benar-benar berkuasa menghilangkannya,” baik dengan cara kami tidak menurunkannya atau menurunkannya kemudian langsung lenyap ke tempat yang tidak bisa dicapai, maupun tidak terwujud tujuan penurunannyya. Ini merupakan peringatan draiNya kepada para hambaNYa, supaya mereka bersyukur atas nikmat-nikmatNya dan membayangkan musibah apa yang terjadi bila tidak ada, sebagaimana firman-Nya : Katakanlah: \"Terangkanlah kepadaku jika sumber air kamu menjadi kering; maka siapakah yang akan mendatangkan air yang mengalir bagimu?\"."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 18: Yakni sebagai rezeki bagimu dan bagi hewan ternakmu seukuran yang cukup bagimu. Dia tidak mengurangi air sehingga tidak tercapai maksudnya (seperti sampai tidak menumbuhkan tanaman-tanaman) dan tidak menurunkannya secara melimpah yang malah mengakibatkan kebinasaan (seperti banjir) kecuali sebagai peringatan. Allah menurunkannya saat dibutuhkan, kemudian mengalihkannya setelah cukup dan ketika dapat menimpakan madharrat jika tidak dihentikan. Allah menyimpannya di bumi sehingga manusia dapat menggalinya dari dalam tanah. Sehingga mereka dan hewan ternak mereka mati kehausan. Allah berkuasa melenyapkannya, bisa dengan tidak menurunkannya, atau menurunkannya tetapi kemudian lenyap atau tidak menghasilkan maksud yang diinginkan. Hal ini merupakan peringatan kepada hamba-hamba-Nya agar mereka bersyukur kepada nikmat-nikmat-Nya serta memikirkan bagaimana jika air itu tidak ada sama sekali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 18",
    "description": "Dan di antara bentuk pemeliharaan kami adalah bahwa kami turunkan air tawar dalam berbagai bentuk, dari yang cair hingga butir-an es, dari langit dengan suatu ukuran bagi makhluk ciptaan kami; lalu untuk memudahkan pemanfaatannya kami jadikan air itu menetap dan tersimpan di bumi, dan pasti kami berkuasa pula untuk melenyapkannya, namun kami tidak melakukannya karena rahmat kami kepada para makhluk. 19. Kami jadikan air itu tersimpan di bumi, lalu dengan air itu kami tumbuhkan untukmu kebun-kebun kurma dan anggur serta kebun-kebun yang lain; di sana, yakni dalam kebun-kebun tersebut, kamu memperoleh buah-buahan yang banyak dan sebagian dari buah-buahan itu kamu makan, dan menjadi salah satu jenis makanan yang baik dan menyehatkan."
  }
]