[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami mengadakan dengan air ini kebun-kebun kurma dan kebun-kebun anggur bagi kalian, di dalamnya kalian memperoleh buah-buahan yang banyak dengan berbagai jenis dan bentuk, dan sebagian darinya kalian makan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Lalu dengan air itu Kami jadikan bagi kalian kebun-kebun kurma, dan anggur. Di sana kalian memperoleh buah-buahan yang beragam bentuk dan warnanya, seperti buah tin, delima, dan apel, dan sebagian darinya kalian makan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَأَنشَأْنَا لَكُم بِهِۦ جَنّٰتٍ (Lalu dengan air itu, Kami tumbuhkan untuk kamu kebun-kebun) Yakni kebun-kebun yang diliputi oleh pepohonan yang sangat rimbun sehingga menutupi tanahnya. لَّكُمْ فِيهَا فَوٰكِهُ كَثِيرَةٌ (di dalam kebun-kebun itu kamu peroleh buah-buahan yang banyak) Seperti buah delima, tin, apel, dan buah lainnya yang bukan merupakan makanan pokok atau lauk bagi manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Lalu dengan air itu, Kami tumbuhkan kebun-kebun kurma dan anggur (dua buah Arab) untuk kalian. Di dalam kebun-kebun itu kalian dapatkan buah-buahan yang banyak, bermacam warna dan jenis. Buah-buahan itu kalian jadikan makanan dan minuman, baik basah maupun kering, musim panas maupun dingin. Maksud dari al-aklu di sini adalah diambil manfaat dan rejeki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dengan air itu Kami menumbuhkan untuk kalian kebun-kebun} kebun-kebun {kurma dan anggur. Bagi kalian di sana ada buah-buahan yang banyak dan dari sebagian buah itu kalian makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “ lalu dengannya, kami tumbuhkan untuk kamu,” yakni dengan air itu “kebun-kebun,” maksudnya perkebunan “kurma dan anggur,” Allah menyebut dua jenis tanaman ini secara khusus, padahal air itu menumbuhkan pohon-pohon selain dua pohon itu lantaran keunggulan dan manfaat-manfaat keduanya (yang banyak) yang mengalahkan tanaman-tanaman lainnya. Karena itu, Allah menyebutkan lafazh umum dalam FirmanNya, ”untuk kamu,” maksudnya di dalam kebun-kebun itu terdapat berbagai macam buah. Sebagiannya kalian makan, seperti buah tin, utruj, delima, apel dan lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 19: Keduanya adalah pohon yang paling banyak di Arab. Yakni pada kebun itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 19",
    "description": "Kami jadikan air itu tersimpan di bumi, lalu dengan air itu kami tumbuhkan untukmu kebun-kebun kurma dan anggur serta kebun-kebun yang lain; di sana, yakni dalam kebun-kebun tersebut, kamu memperoleh buah-buahan yang banyak dan sebagian dari buah-buahan itu kamu makan, dan menjadi salah satu jenis makanan yang baik dan menyehatkan. 20. Dan atas rahmat kami pula kami tumbuhkan pohon zaitun yang tumbuh pertama kali dari gunung sinai dengan berbagai manfaatnya; buah yang menghasilkan minyak dan menjadi bahan pembangkit selera bagi orang-orang yang makan."
  }
]