[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang di antara sifat mereka adalah bahwasanya mereka itu orang-orang yang khusyu’ dalam shalat mereka, hati mereka focus untuknya dan anggota tubuh mereka tenang di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Mereka adalah orang-orang yang tunduk dalam salatnya, anggota tubuh mereka senantiasa tenang ketika salat, dan hati mereka kosong dari berbagai kesibukan dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. الَّذِينَ هُمْ فِى صَلَاتِهِمْ خٰشِعُونَ ((yaitu) orang-orang yang khusyu’ dalam shalatnya) Makna khusyu’ dalam shalat adalah merendahkan diri dan tunduk di hadapan Allah. Dan pendapat lain mengatakan maknanya adalah tenang dan tidak melakukan hal yang tidak berhubungan dengan shalat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "2-3 Diantara pengahalang kekhusyuan dalam shalat adalah: banyak canda dan berkata hal yang tidak bermanfaat; oleh karena itu disebutkan setelah ayat khusyuk diantara sifat orang beriman adalah berpalingnya mereka dari banyak canda."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Yaitu orang-orang yang khusyu´ dalam shalatnya, pasrah dan berserah diri, merendahkan diri di hadapan Allah disertai dengan rasa takut dan kedamaian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Yaitu) orang-orang yang dalam shalatnya khusyu’} tunduk dan merendahkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Orang-orang yang sebagian kesempurnaan sifat mereka, adalah bahwa mereka “(yaitu) orang-orang yang khusu’ dalam shalatnya.” Khusu’ dalam shalat, hakikatnya ialah hadirnya hati dihadapan Allah, berusaha hadir untuk mendekatiNya sehingga dengan itu, hati menjadi tenang, jiwanya merengkuh ketentraman, gerakan-gerakannya menjadi tenang serta keberpalingannya berkurang,untuk menjaga kesopanan di hadapan Rabbnya dan menghayati setiap ucapan dan gerakan shalatnya, dari awal sampai selesai. Berkat itu, bisikan-bisikan setan dan pikiran-pikiran yang hina lenyap. Inilah ruh (substansi) shalat yang menjadi tujuan pelaksanaannya. Itulah yang diwajibkan untuk hamba. Shalat yang tidak memuat unsur kekhusuan sama sekali, dan tanpa penghayatan hati, kendatipun sudah cukup mengugurkan kewajiban dan mendatangkan pahala, namun sungguh besar-kecilnya pahala tergantung dengan sejauh mana hati menghayati shalatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 2: Khusyu’ artinya hadirnya hati dan diamnya anggota badan. Khusyu’ merupakan ruhnya shalat, semakin besar kekhusyu’an seseorang, maka semakin besar pahalanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 2",
    "description": "1-2. Sungguh, pasti beruntung orang-orang mukmin yang telah mantap imannya dan terbukti dengan mengerjakan amal-amal saleh. Orang yang demikian itu ialah orang yang khusyuk dalam salatnya, yakni tumakninah, rendah hati, fokus, serta menyadari dengan sepenuuhnya bahwa dia sedang menghadap sang penciptanya (lihat juga: al-baqarah/2: 45'46). 3. Dan di antara mereka yang akan memperoleh keberuntungan adalah orang yang menjauhkan diri, atau tidak memberi perhatian secara lahir dan batin, dari perbuatan dan perkataan yang tidak berguna, yaitu se-suatu yang sebenarnya di satu sisi tidak dilarang, namun di sisi lain tidak ada mendatangkan manfaat."
  }
]