[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menumbuhkan dengannya pohon zaitun yang tumbuh di sekitar Thursina, untuk diperas sehingga menghasilkan minyak, lalu dijadikan minyak oles dan campuran makanan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan Kami tumbuhkan bagi kalian pohon zaitun yang tumbuh dari wilayah Gunung Sinai, buahnya menghasilkan minyak dan bahan pembangkit selera bagi orang-orang yang makan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. dan dengan air ini, Kami tumbuhkan bagi kalian pohon zaitun yang tumbuh di sekitar gunung Thursina, darinya kalian dapat memeras minyaknya dan untuk tambahan lauk bagi orang yang makan. Ia adalah pohon yang diberkati sebagaimana disebutkan dalam hadits shahih: “Makanlah dengan minyak zaitun, dan pakailah untuk mengolesi, karena ia berasal dari pohon yang diberkati.” (Diriwayatkan oleh al-Hakim, dan dishahihkan dan disepakati oleh ad-Dzahabi dalam al-Mustadrak 2/397. Dan diriwayatkan oleh ad-Dhiya’ dalam al-Mukhtarah 1/172 no. 8398. Dan dishahihkan oleh al-Albani dalam as-Silsilah as-Shahihah no. 379)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَشَجَرَةً تَخْرُجُ مِن طُورِ سَيْنَآءَ تَنۢبُتُ بِالدُّهْنِ (dan pohon kayu keluar dari Thursina, yang menghasilkan minyak) Yakni menghasilkan buah-buahan yang dapat mengeluarkan minyak, yaitu minyak zaitun. وَصِبْغٍ لِّلْاٰكِلِينَ (dan lauk makanan bagi orang-orang yang makan) Yaitu minyak zaitun itu sendiri karena minyak ini juga digunakan untuk lauk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Juga Kami tumbuhkan pohon kayu yang penuh keberkahan, yaitu pohon Zaitun dari Thursina ketika Musa sedang bermunajat. Pohon yang menghasilkan minyak untuk dimanfaatkan untuk keperluan makanan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan pohon} dan Kami menumbuhkan bagi kalian pohin zaitun {yang tumbuh di gunung} gunung {Sinai yang menghasilkan minyak} minyak {dan celupan} selai yang dimasukkan ke dalam roti {bagi orang-orang yang makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “ dan pohon kayu yang keluar dari Thursina,” yaitu pohon zaitun. Maksudnya yaitu jenis tumbuhan ini. Pohon ini disinggung secara khusus karena hanya tumbuh di wilayah syam, dan lantaran kegunaan-kegunaannya yang sebagiannya tertuang pada Firman Allah, “yang menghasilkan minyak, dan menjadi kuah bagi orang-orang yang makan,” maksudnya di dalamnya terdapat az-zait yang artinya minyak, dipakai untuk penerangan dan campuran bagi orang-orang yang makan. Maksudnya menjadi lauk bagi orang-orang yang makan dan kegunaan-kegunaan lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 20: Disebutkan pohon Zaitun secara khusus karena tempatnya hanya khusus di negeri Syam dan karena manfaat-manfaat yang dihasilkannya. Yakni sebagai tambahan lauk pauk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 20",
    "description": "Dan atas rahmat kami pula kami tumbuhkan pohon zaitun yang tumbuh pertama kali dari gunung sinai dengan berbagai manfaatnya; buah yang menghasilkan minyak dan menjadi bahan pembangkit selera bagi orang-orang yang makan. 21-22. Dan di samping air serta kebun-kebun yang tumbuh dengannya, sesungguhnya pada hewan-hewan ternak terdapat suatu pelajaran bagimu. Kami juga memberi minum kamu dari air susu yang penuh nutrisi yang ada dalam perutnya, dan padanya, yakni pada binatang-binatang ternak itu, juga terdapat banyak manfaat untukmu, seperti daging, kulit, bulu, dan tenaganya. Semua itu dapat dimanfaatkan untuk berbagai tujuan. Dan sebagian darinya kamu makan sebagai makanan yang lezat dan bergizi. Dan di atasnya, yakni hewan-hewan ternak itu, dan juga di atas kapal-kapal kamu diangkut atas izin Allah menuju tempat-tempat yang dituju."
  }
]