[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya bagi kalian (wahai sekalian manusia) benar-benar ada pelajaran baik dalam unta, sapi dan kambing yang dapat kalian petik melalui penciptaanya. Kami memberikan minum kepada kalian dari cairan susu yang ada dalam perutnya. Dan kalian pun memperoleh manfaat-manfaat yang lain darinya berupa bulu domba,kulit dan lain-lain, dan sebagian darinya kalian makan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan sungguh bagi kalian -wahai manusia- pada binatang ternak (unta, sapi dan kambing) terdapat pelajaran dan petunjuk yang menunjukkan bagi kalian kekuasaan dan kelembutan Allah. Kami juga memberi kalian minuman susu murni yang berasal dari perut binatang ternak. Dan padanya juga terdapat banyak manfaat bagi kalian seperti untuk kendaraan atau menggunakan kulit dan bulunya, serta kalian makan dagingnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Hai para hamba, dan bagi kalian hewan-hewan ternak berupa unta, sapi, domba, dan kambing, agar kalian dapat mengambil ibrah darinya dan agar kalian dapat mengetahui kekuasaan Allah dan rahmat-Nya. Kami memberi kalian minuman dari perutnya berupa susu yang lezat, dan bagi kalian berbagai manfaat dari bulu dan rambutnya sebagai berbagai alat kebutuhan dan karpet; dan kalian dapat memanfaatkan dagingnya sebagai makanan yang lezat dan halal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَإِنَّ لَكُمْ فِى الْأَنْعٰمِ لَعِبْرَةً ۖ (Dan sesungguhnya pada binatang-binatang ternak, benar-benar terdapat pelajaran bagi kamu) Penciptaan dan prilakunya dapat digunakan sebagai tanda atas keagungan kuasa Allah. نُّسْقِيكُم مِّمَّا فِى بُطُونِهَا(Kami memberi minum kamu dari apa yang ada dalam perutnya) Yakni berupa air susunya. وَلَكُمْ فِيهَا مَنٰفِعُ كَثِيرَةٌ(dan (juga) pada binatang-binatang ternak itu terdapat faedah yang banyak untuk kamu) Seperti untuk tunggangan, untuk diternakkan, dan untuk diambil bulu dan rambutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Sesungguhnya pada binatang-binatang ternak, benar-benar terdapat pelajaran yang penting bagi kalian tentang kekuasaan Tuhan. Kami memberi minum kalian dari air susu yang ada dalam perutnya, juga pada binatang-binatang ternak itu terdapat manfaat yang banyak untuk kamu, baik dari kulit, bulu, rambut dan sebagainya. Juga daging dan minyak (gajih)nya bisa kamu makan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada hewan-hewan ternak benar-benar terdapat pelajaran bagi kalian} terdapat tanda yang bisa kalian gunakan sebagai petunjuk atas keagungan kuasa Allah {Kami memberi minum kalian dari sebagian yang ada dalam perutnya, padanya terdapat banyak manfaat untuk kalian, dan sebagian darinya kalian makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Diantara kenimatanNya bagi kalian adalah, Dia mengerahkan binatang-binatang ternak bagi kalian; unta, sapi dan kambing. Padanya terdapat pelajaran bagi orang yang mau memetic pelajaran dan kegunaan-kegunaan bagi orang yang ingin memanfaatkannya. “kami memberi minum kamu dari air susu yang ada dalam perutnya,” berupa air susu yang keluar dari tempat antara kotoran dan darah murni, yang menyegarkan bagi orang-orang yang meminumnya “dan (juga) pada binatang-binantang ternak tersebut.Dan Dia menjadikan dari kulit-kulit binatang ternak itu bagi kamu rumah-rumah (kemah-kemah) yang kalian merasa ringan (untuk membawa) nya diwaktu kalian dalam perjalanan dan waktu kalian bermukim “dan sebagian darinya kamu makan,” makanan terbaik, berupa daging dan lemak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 21: Yaitu unta, sapi dan kambing. Yakni terdapat pelajaran dan manfaat. Yang keluar antara kotoran dan darah. Seperti bulunya, kulitnya, rambutnya, dan lain-lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 21",
    "description": "21-22. Dan di samping air serta kebun-kebun yang tumbuh dengannya, sesungguhnya pada hewan-hewan ternak terdapat suatu pelajaran bagimu. Kami juga memberi minum kamu dari air susu yang penuh nutrisi yang ada dalam perutnya, dan padanya, yakni pada binatang-binatang ternak itu, juga terdapat banyak manfaat untukmu, seperti daging, kulit, bulu, dan tenaganya. Semua itu dapat dimanfaatkan untuk berbagai tujuan. Dan sebagian darinya kamu makan sebagai makanan yang lezat dan bergizi. Dan di atasnya, yakni hewan-hewan ternak itu, dan juga di atas kapal-kapal kamu diangkut atas izin Allah menuju tempat-tempat yang dituju"
  }
]