[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di atas unta, dan kapal-kapal; di daratan dan laut, kalian diangkut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan kalian dibawa di atas unta diperjalanan darat, dan di atas kapal-kapal diperjalanan laut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Dan kalian menunggangi unta di daratan dan kalian dapat menggunakan kapal sebagai kendaraan dan angkutan barang-barang kalian di lautan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَعَلَيْهَا (dan di atas punggung binatang-binatang ternak itu) Yang dimaksud adalah unta saja tanpa hewan ternak yang lain seperti sapi dan kambing, sebab unta adalah hewan yang paling banyak digunakan untuk tunggangan di daratan pada zaman diturunkannya al-Qur’an. وَعَلَى الْفُلْكِ(dan (juga) di atas perahu-perahu) Yakni kapal-kapal. تُحْمَلُونَ (kamu diangkut) Sebagai penyempurna kenikamatan bagi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Di atas punggung binatang-binatang ternak khususnya dan juga di atas perahu-perahu yang kamu tumpangi dalam perjalanan untuk menyempurnakan nikmat. Hewan yang sering menjadi tunggangan adalah unta, bukan sapi atau kambing."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di atasnya dan di atas kapal-kapal kalian diangkut} diatas unta ketika di daratan dan di atas bahtera ketika di lautan kalian diangkut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Dan diatas punggung binatang-binatang ternak itu dan (juga) di atas perahu-perahu kamu diangkut,’ maksudnya Dia menjadikannya tunggangan di daratan. Kalian meletakkan barang-barang berat kalian di atasnya ke negeri yang tidak dapat kalian tempuh kecuali dengan kepayahan, sebagaimana Allah menjadikan kapal-kapal bagi kalian di laut, yang membawa kalian dan barang-barang perbekalan kalian, sedikit atau banyak. Dzat yang memberikan kenikmatan-kenikmatan ini dan memvariasikan bentuk-bentuk kebaikanNya serta yang mencurahkan kebaikan yang melimpah, Dia-lah Dzat yang berhak atas kesempurnaan rasa syukur, sanjungan dan ketekunan dalam menghambakan diri kepadaNya, serta tidak boleh menjadikan kenikmatanNya untuk mendukung maksiat kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 22: Yaitu unta. Kamu dan barang-barang kamu dapat dipindahkan ke tempat yang jauh yang kamu inginkan. Yang mengaruniakan nikmat nikmat yang banyak ini dan memberikan ihsan-Nya berhak untuk disyukuri, dipuji dan diibadahi dengan sungguh-sungguh serta tidak menggunakan nikmat-nikmat tersebut untuk maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 22",
    "description": "21-22. Dan di samping air serta kebun-kebun yang tumbuh dengannya, sesungguhnya pada hewan-hewan ternak terdapat suatu pelajaran bagimu. Kami juga memberi minum kamu dari air susu yang penuh nutrisi yang ada dalam perutnya, dan padanya, yakni pada binatang-binatang ternak itu, juga terdapat banyak manfaat untukmu, seperti daging, kulit, bulu, dan tenaganya. Semua itu dapat dimanfaatkan untuk berbagai tujuan. Dan sebagian darinya kamu makan sebagai makanan yang lezat dan bergizi. Dan di atasnya, yakni hewan-hewan ternak itu, dan juga di atas kapal-kapal kamu diangkut atas izin Allah menuju tempat-tempat yang dituju. 23. Penyebutan kapal pada akhir ayat sebelumnya disambungkan de-ngan uraian tentang kisah nabi nuh. Dan sungguh ada pelajaran pen-ting yang dapat kamu petik dari kisah para nabi. Kami telah mengutus nabi nuh kepada kaumnya, lalu dia berkata, 'wahai kaumku! sembahlah Allah, karena tidak ada tuhan yang berhak disembah bagimu selain dia. Maka, mengapa kamu tidak bertakwa kepada-Nya, yakni menghindarkan diri dari siksa-Nya dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya yang kusampaikan kepadamu''."
  }
]