[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah mengutus Nuh kepada kaumnya dengan mengemban dakwah tauhid. Dia berkata kepada mereka, “Beribadahlah kepada Allah semata; kalian sekali-kali tidak memiliki tuhan yang berhak disembah selainNya, maka murnikanlah peribadahan kepadaNya. Apakah kalian tidak takut siksaanNya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan sungguh Kami telah mengutus Nuh -'alaihissalām- kepada kaumnya agar dia menyeru mereka kepada agama Allah, dia berkata, \"Wahai kaumku! Sembahlah Allah semata, sebab tidak ada tuhan sesembahan yang berhak kalian sembah selain-Nya, maka apakah kalian tidak bertakwa kepada-Nya dengan mengerjakan perintah dan menjauhi larangan-Nya ?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Sungguh Kami telah mengutus Nuh kepada kaumnya untuk menyeru mereka agar menyembah Allah, dia berseru kepada mereka: “Hai kaumku, sembahlah Allah semata, karena tidak ada Tuhan selain Dia; tidak takutkah kalian terhadap azab-Nya?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sesungguhnya Kami telah mengutus Nuh kepada kaumnya para penyembah berhala, agar menyeru mereka untuk mengesakan dan menyembah Allah. Lalu Nuh berkata: \"Hai kaumku, sembahlah Allah, karena sekali-kali tidak ada Tuhan bagimu selain Dia. Maka mengapa kamu tidak takut kepada azab-Nya?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah mengutus Nuh kepada kaumnya. Lalu dia berkata,“Wahai kaumku, sembahlah Allah, tidak ada Tuhan bagi kalian selain Dia. Apakah kalian tidak bertakwa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah mengisahkan risalah (misi) hamba dan RasulNya Nuh, rasul yang pertama kali diutus kependuduk dunia. Allah mengirim beliau kepada kaumnya yang menyembah berhala-berhala. Beliau memerintahkan mereka untuk menyembah Allah semata. Allah berfirman, ”hai kaumku, sembahlah Allah,” maksudnya, murnikanlah ibadah (hanya) kepadaNya. Karena ibadah tidak sah kecuali dengan memurnikannya (kepada Allah), “(karena) sekali-kali tidak ada tuhan (yang haq) bagimu selain Dia.” Dalam ayat ini terdapat pengguguran ketuhanan selain Allah dan penetapannya hanya bagi Allah. Karena Allah adalah Dzat yang menciptakan, pemberi rizki, yang memiliki segala kesempurnaan. Sesembahan selainNya berbeda dengan itu. “Maka mengapa kamu tidak bertakwa (kepadaNya)?” maksudnya (tidak takut) atas tindakan kalian beribadah kepada berhala-berhala dan patung-patung yang dipahat mirip rupa orang-orang yang shalih, lalu mereka menyembahnya bersama penyembahan kepada Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 23: Allah Subhaanahu wa Ta'aala menyebutkan risalah hamba dan Rasul-Nya Nuh ‘alaihis salam, di mana Beliau adalah rasul pertama yang diutus kepada manusia. Allah mengutusnya ketika mereka menyembah patung-patung. Beliau memerintahkan mereka menyembah Allah saja dan tidak menyembah kepada selain-Nya. Dalam kalimat ini terdapat pembatalan ketuhanan selain Allah dan menetapkan bahwa Allah yang berhak diibadhi, karena Dia adalah Pencipta dan Pemberi rezeki yang memiliki segala kesempurnaan, sedangkan selain-Nya idak demikian. Bisa juga diartikan, “Maka mengapa kamu tidak takut hukuman-Nya karena beribadah kepada selain-Nya?” Namun nasehat Beliau tidak berpengaruh apa-apa bagi mereka, bahkan mereka tetap saja menyembah selain Allah, meskipun demikian Beliau tetap bersabar mengajak mereka di malam dan siang hari, secara sembunyi atau terang-terangan dalam waktu yang cukup lama, yaitu 950 tahun. Tetapi kaumnya tetap saja tidak mau mengikuti ajakannya, bahkan malah semakin menjauh dan melampaui batas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 23",
    "description": "Penyebutan kapal pada akhir ayat sebelumnya disambungkan de-ngan uraian tentang kisah nabi nuh. Dan sungguh ada pelajaran pen-ting yang dapat kamu petik dari kisah para nabi. Kami telah mengutus nabi nuh kepada kaumnya, lalu dia berkata, 'wahai kaumku! sembahlah Allah, karena tidak ada tuhan yang berhak disembah bagimu selain dia. Maka, mengapa kamu tidak bertakwa kepada-Nya, yakni menghindarkan diri dari siksa-Nya dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya yang kusampaikan kepadamu''24. Maka tanpa berpikir panjang, berkatalah para pemuka orang kafir dari kaumnya kepada para pengikut mereka sebagai respons atas ajakan nabi nuh, 'orang ini tidak lain hanyalah manusia seperti kamu. Dia tidak punya keistimewaan apa pun untuk menjadi utusan tuhan. Dia hanyalah orang yang ingin menjadi lebih mulia daripada kamu dengan mencitrakan diri agar dapat menjadi pemimpin kamu dengan mengaku sebagai utusan tuhan. Dan seandainya Allah menghendaki mengutus seorang rasul, tentu dia mengutus malaikat, bukan manusia seperti nuh. Belum pernah kami mendengar seruan seperti ini pada masa nenek moyang kami dahulu. '."
  }
]