[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Kemudian para tokoh kaumnya mendustakannya, dan berkata kepada masyarakat umum mereka, “Sesungguhnya dia hanya seorang manusia biasa seperti kalian, tidak memiliki kelebihan apa pun atas kalian. Dan dia tidak menginginkan dengan ajakannya, kecuali kekuasaan dan keunggulan di atas kalian. Dan sekiranya Allah menghendaki untuk mengutus kepada kita seorang rasul, pastilah akan mengutus utusan dari kalangan malaikat. Kami tidak pernah mendengar ini pada orang-orang yang mendahului kami, dari bapak-bapak dan kakek-kakek kami. Dan tidaklah Nuh kecuali seorang lelaki yang telah terkena penyakit gila, maka tunggulah sampai dia sadar kembali, lalu dia akan meninggalkan dakwahnya itu, atau dia mati sehingga kalian akan bebas dari (pengaruh) nya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka para pemuka dan pemimpin yang kafir terhadap Allah dari kaumnya berkata kepada para pengikut dan seluruh rakyat mereka, \"Orang yang mengaku bahwa dirinya seorang rasul ini tidak lain adalah manusia seperti kalian, ia hanya menginginkan kekuasaan dan kepemimpinan atas kalian. Dan seandainya Allah berkehendak mengutus kapada kita semua seorang rasul, niscaya Dia akan mengutusnya dari kalangan Malaikat, bukan seorang manusia. Belum pernah kami mendengar apa yang diklaim orang ini dari para pendahulu-pendahulu kita sebelumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Namun para pemuka kaumnya yang jahil berkata dengan angkuh: “Nuh tidak lain hanyalah manusia biasa seperti kalian, dia hanya ingin memiliki kekuasaan dan kenabian. Seandainya Allah hendak mengutus utusan untuk memberi hidayah niscaya Dia akan mengutus para malaikat. Kami tidak pernah mendengar seperti ajakan Nuh untuk menyembah Allah semata pada umat-umat terdahulu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَقَالَ الْمَلَؤُا۟ الَّذِينَ كَفَرُوا۟ مِن قَوْمِهِۦ (Maka pemuka-pemuka orang yang kafir di antara kaumnya menjawab) Yakni para pembesar kaumnya yang kafir mengatakan. مَا هٰذَآ إِلَّا بَشَرٌ مِّثْلُكُمْ(Orang ini tidak lain hanyalah manusia seperti kamu) Yakni sama jenisnya sebagai manusia seperti kalian, tidak ada perbedaan antara kalian dengan dirinya. يُرِيدُ أَن يَتَفَضَّلَ عَلَيْكُمْ(yang bermaksud hendak menjadi seorang yang lebih tinggi dari kamu) Dengan mengakui kenabian bagi dirinya. وَلَوْ شَآءَ اللهُ لَأَنزَلَ مَلٰٓئِكَةً(Dan kalau Allah menghendaki, tentu Dia mengutus beberapa orang malaikat) Yakni seandainya Allah hendak mengutus seorang utusan tentu Dia akan mengutus para malaikat. مَّا سَمِعْنَا بِهٰذَا فِىٓ ءَابَآئِنَا الْأَوَّلِينَ(Belum pernah kami mendengar (seruan yang seperti) ini pada masa nenek moyang kami yang dahulu) Yakni belum pernah mendengar pengakuan seperti orang yang mengaku sebagai nabi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "24-25 Wahai para pembawa perbaikan: Inilah perilaku para musuh-musuh orang yang membuat perbaikan yang terjadi pada setiap Rasul: mereka menantangnya { مَا هَٰذَآ إِلَّا بَشَرٌ } \"Orang ini tidak lain hanyalah manusia seperti kamu\", dan menyerang mereka dengan niat-niat kejinya: { يُرِيدُ أَن يَتَفَضَّلَ عَلَيْكُمْ } \"yang bermaksud hendak menjadi seorang yang lebih tinggi dari kamu\", dan menyerang pada akalnya: { إِنْ هُوَ إِلَّا رَجُلٌ بِهِ جِنَّةٌ } \"Ia tidak lain hanyalah seorang laki-laki yang berpenyakit gila\" bahkan mereka selalu mengintainya: { فَتَرَبَّصُوا بِهِ حَتَّىٰ حِينٍ } \"maka tunggulah (sabarlah) terhadapnya sampai suatu waktu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Kemudian pemuka-pemuka orang yang kafir dari kaumnya menjawab: \"Orang ini tidak lain hanyalah manusia seperti kamu, yang bermaksud hendak menjadi seorang yang lebih tinggi dari kamu. Dan kalau Allah menghendaki, tentu Dia mengutus beberapa orang malaikat. Belum pernah kami mendengar seruan untuk mengesakan Tuhan yang seperti ini pada masa nenek moyang kami yang dahulu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu para pemuka} para pemuka dan pemimpin {orang-orang kafir dari kaumnya berkata,“Orang ini tidak lain hanyalah manusia seperti kalian. Dia ingin menjadi lebih mulia} lebih mulia dan menjadi pemimpin {atas kalian. Seandainya Allah berkehendak, tentu Dia akan mengutus malaikat. Kami tidak mendengar ini pada (masa) nenek moyang kami dahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Beliau tetap melangsungkan dakwah, menyeru mereka dengan sembunyi-sembuni dan terang-terangan, di malam dan siang hari selama seribu tahun kurang lima puluh tahun lamanya (Sembilan ratus lima puluh tahun lamanya). Mereka tidaklah bertambah kecuali kesombongan dan antipati saja. “maka pemuka-pemuka orang yang kafir dari kaumnya menjawab,” yaitu dari kalangan pembesar danh para pimpinanya yang menjadi panutan untuk melawan Nabi mereka Nuh dan memperingatkan (para pengikut mereka) darinya, “orang ini tidak lain hanyalah manusia seperti kamu, yang hendak bermaksud menjadi seorang yang lebih tinggi dari kamu,” maksudnya tidaklah dia melainkan manusia (biasa) seperti kalian juga. Obsesinya saat dia mengkliam sebagai seorang nabi adalah untuk menambah keutamaannya atas diri kalian supaya menjadi orang yang diikuti. Kalau tidak demikian maksudnya, lalu apakah yang menguggulkannya diatas kalian padahal dia berasal dari komunitas kalian?! Penolakan semacam ini senantiasa melekat pada orang-orang yang mendustakan para rasul. Allah telah menyanggah komentar itu dengan sanggahan yang tuntas melalui lisan para rasul. Sebagaimana firman-Nya : Mereka berkata: \"Kamu tidak lain hanyalah manusia seperti kami juga. Kamu menghendaki untuk menghalang-halangi (membelokkan) kami dari apa yang selalu disembah nenek moyang kami, karena itu datangkanlah kepada kami bukti yang nyata. Rasul-rasul mereka berkata kepada mereka: \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya. (QS. Ibrahim :10-11) Maka, mereka (para rasul) memberitahukan bahwa risalah itu merupakan kemurahan dan karunia Allah. Kalian tidak berhak untuk membatasi dan menghalangiNya untuk mencurahkan keutamaanNya kepada kami. Mereka juga berkomentar, ”Dan kalau Allah menghendaki, tentu Dia mengutus beberapa orang malaikat.” Ini juga bentuk penolakan yang batil terhadap kehendak Allah. Sekiranya Allah berkehendak, niscaya Allah mengutus beberapa malaikat. Sesungguhnya Dia MahaBijak lagi Mha Penyayang. Sifat hikmah dan rahmatNya (kepada manusia) menuntut supaya seorang rasul berasal dari jenis manusia. Karena (bila rasul berbentuk) malaikat, orang-orang itu tidak akan mampu menjalin komunikasi dengan mereka. Dan tidak mungkin berhasil kecuali dalam rupa manusia. Kemudian kekaburan kembali menyelimuti mereka sebagaimana semula. Mereka berkata,” belum pernah kami mendengar (seruan seperti) ini,” yaitu pengutusan seorang rasul “pada masa nenek moyang kami yang dahulu,” model alasan apakah ini (yang mendasarkan pada pengakuan mereka) tidak pernah mendengar pengiriman seorang rasul kepada nenek moyang mereka?! Karena pengetahuan mereka itu tidak meliputi seluruh kejadian lampau. Maka, janganlah ketidaktahuan mereka dijadikan sebagai alasan pembelaan diri! Anggap saja, Allah belum pernah mengutus seorang rasul dari kalangan mereka. Kondisi mereka tidak lepas dari dua opsi; pertama, berada di atas petunjuk sehingga tidak membutuhkan pengutusan seorang rasul saat itu,. Kedua, mereka tidak berada di atas petunjuk, maka hendaklah mereka memuji dan mensyukuri Allah, lantaran telah mengistimewakan mereka dengan kenikmatan yang tidak datang kepada nenek moyang mereka, dan mereka tidak merasakannya. Dan janganlah mereka menjadikan sikap tidak baik mereka kepada orang lain sebagai penyebab pengingkaran mereka terhadap curahan kebaikan yang tertuju pada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 24: Untuk menentang Nabi Nuh ‘alaihis salam dan memperingatkan kaumnya agar tidak mengikutinya. Yakni, maksudnya mengaku nabi adalah agar dia berada di atas kamu dan kamu sebagai pengikutnya. Jika tidak demikian, apa yang melebihkannya di atas kamu sedangkan dia manusia seperti kamu? Penentangan seperti ini senantiasa ada dalam diri orang-orang yang mendustakan para rasul. Namun Alah Subhaanahu wa Ta'aala telah menjawabnya dengan jawaban yang cukup melalui lisan para rasul-Nya sebagaimana dalam ayat berikut: Mereka berkata, \"Kamu tidak lain hanyalah manusia seperti Kami juga. Kamu menghendaki untuk menghalang-halangi (membelokkan) Kami dari apa yang selalu disembah nenek moyang Kami, karena itu datangkanlah kepada Kami, bukti yang nyata.”-- Rasul-rasul mereka berkata kepada mereka, \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya…dst. “ (Terj. Ibrahim: 10-11) Mereka (para rasul) memberitahukan, bahwa yang demikian adalah karunia Allah dan nikmat-Nya yang diberikan kepada siapa saja di antara hamba-Nya, kamu tidak dapat menghalangi Allah ketika Dia memberikan karunia-Nya. Penentangan dengan menyebutkan masyii’ah (jika Allah menghendaki) ini pun batil, karena jika Allah menghendaki, Dia akan menurunkan malaikat. Akan tetapi Dia Mahabijaksana lagi Maha Penyayang. Hikmah dan rahmat-Nya menghendaki Rasul itu dari kalangan manusia, karena malaikat tidak bisa berbicara dengan manusia kecuali jika ia menjelma menjadi manusia. Ada pula yang menafsirkan, “Kami belum pernah mendengar tentang pengutusan rasul.” Hal itu, karena pengetahuan mereka terbatas, mereka tidak mengetahui tentang masa lalu. Ketidaktahuan mereka ini tidak bisa menjadi alasan bagi mereka. Kalau pun sebelumnya tidak diutus rasul, maka kemungkinan sebelum mereka berada di atas petunjuk sehingga tidak perlu diutus rasul, dan jika tidak demikian, maka hendaknya mereka memuji Tuhan mereka dan bersyukur kepada-Nya dengan beriman kepada Rasul-Nya, karena Dia mengaruniakan nikmat yang besar (dengan diutusnya rasul) yang belum diberikan kepada nenek moyang mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 24",
    "description": "Maka tanpa berpikir panjang, berkatalah para pemuka orang kafir dari kaumnya kepada para pengikut mereka sebagai respons atas ajakan nabi nuh, 'orang ini tidak lain hanyalah manusia seperti kamu. Dia tidak punya keistimewaan apa pun untuk menjadi utusan tuhan. Dia hanyalah orang yang ingin menjadi lebih mulia daripada kamu dengan mencitrakan diri agar dapat menjadi pemimpin kamu dengan mengaku sebagai utusan tuhan. Dan seandainya Allah menghendaki mengutus seorang rasul, tentu dia mengutus malaikat, bukan manusia seperti nuh. Belum pernah kami mendengar seruan seperti ini pada masa nenek moyang kami dahulu. '25. Para pemuka orang kafir itu melanjutkan, 'dia, yakni nuh, ha-Nyalah seorang laki-laki yang gila sehingga dia ingin menonjolkan diri, maka tunggulah terhadapnya, yakni bersabarlah kamu, sampai waktu yang ditentukan di mana dia sembuh atau meninggal dunia. '."
  }
]