[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Kemudian para tokoh kaumnya mendustakannya, dan berkata kepada masyarakat umum mereka, “Sesungguhnya dia hanya seorang manusia biasa seperti kalian, tidak memiliki kelebihan apa pun atas kalian. Dan dia tidak menginginkan dengan ajakannya, kecuali kekuasaan dan keunggulan di atas kalian. Dan sekiranya Allah menghendaki untuk mengutus kepada kita seorang rasul, pastilah akan mengutus utusan dari kalangan malaikat. Kami tidak pernah mendengar ini pada orang-orang yang mendahului kami, dari bapak-bapak dan kakek-kakek kami. Dan tidaklah Nuh kecuali seorang lelaki yang telah terkena penyakit gila, maka tunggulah sampai dia sadar kembali, lalu dia akan meninggalkan dakwahnya itu, atau dia mati sehingga kalian akan bebas dari (pengaruh) nya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dia hanyalah seorang laki-laki yang gila, tidak menyadari apa yang dia katakan, maka tunggu dan bersabarlah terhadapnya sampai kedoknya tersingkap di hadapan orang banyak.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Dan Nuh hanya orang gila, maka tunggu saja sampai dia sembuh dari penyakitnya itu atau hingga dia meniggal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِنْ هُوَ إِلَّا رَجُلٌۢ بِهِۦ جِنَّةٌ (la tidak lain hanyalah seorang laki-laki yang berpenyakit gila) Yakni orang yang gila yang tidak mengerti apa yang ia ucapkan. فَتَرَبَّصُوا۟ بِهِۦ حَتَّىٰ حِينٍ(maka tunggulah (sabarlah) terhadapnya sampai suatu waktu) Yakni tunggulah sampai jelas keadaan orang ini, apakah ia akan sadar dari kegilaannya sehingga meninggalkan pengakuannya, atau sampai ia mati sehingga kalian dapat tenang dari gangguannya. Setelah Nabi Nuh mendengar ucapan kaumnya, ia kemudian menyadari kebebalan mereka dalam kakafiran, sehingga ia memohon kepada Allah agar membinasakan mereka; selain itu Allah juga telah mewahyukan kepadanya bahwa kaumnya tidak akan ada yang mau beriman lagi kecuali mereka yang telah beriman, oleh sebab itu ia memohon agar mereka dibinasakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "24-25 Wahai para pembawa perbaikan: Inilah perilaku para musuh-musuh orang yang membuat perbaikan yang terjadi pada setiap Rasul: mereka menantangnya { مَا هَٰذَآ إِلَّا بَشَرٌ } \"Orang ini tidak lain hanyalah manusia seperti kamu\", dan menyerang mereka dengan niat-niat kejinya: { يُرِيدُ أَن يَتَفَضَّلَ عَلَيْكُمْ } \"yang bermaksud hendak menjadi seorang yang lebih tinggi dari kamu\", dan menyerang pada akalnya: { إِنْ هُوَ إِلَّا رَجُلٌ بِهِ جِنَّةٌ } \"Ia tidak lain hanyalah seorang laki-laki yang berpenyakit gila\" bahkan mereka selalu mengintainya: { فَتَرَبَّصُوا بِهِ حَتَّىٰ حِينٍ } \"maka tunggulah (sabarlah) terhadapnya sampai suatu waktu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. la tidak lain hanyalah seorang laki-laki yang berpenyakit gila, yang terganggu akal dan cara bicaranya. Maka tunggu dan sabarlah terhadap dia sampai suatu waktu, barang kali dia sembuh atau justru mati\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia hanyalah seorang laki-laki yang gila} yang gila {Tunggulah} tunggulah {dia sampai waktu yang ditentukan”} sampai menjadi jelas kegilaannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25 “ia tidak lain hanyalah seorang laki-laki yang berpenyakit gila,” maksudnya, yang terkenal penyakit gila “maka tunggulah (sabarlah) terhadapnya,” tunggulah “sampai suatu waktu,” sampai kematian menghampirinya. Syubhat-syubhat ini [yang] mereka kemukakan untuk menolak kenabian Nabi mereka menunjukkan dahsyatnya kekufuran dan penentangan mereka, dan (juga menandakan) bahwa mereka berada di puncak kebodohan dan kesesatan. Sesungguhnya lontaran-lontaran itu tidak dapat dipergunakan sebagai perlawanan dari segi apapun, seperti yang sudah kami jelaskan, bahkan mengandung sisi yang saling bertolak-belakang dan kontradiktif. Perkataan mereka, “orang ini tidak lain hanyalah manusia seperti kamu, yang bermaksud hendak menjadi seorang yang lebih tinggi dari kamu,” maksudnya mereka mengakui keberadaan akal pada beliau untuk memperdayai mereka, guna menguasai dan memimpin mereka. Bersama dengan ini mesti diwaspadai agar tidak tertipu dengannya. Lalu bagaimana bisa omongan ini selaras dengan ucapan mereka,”ia tidakm lain hanyalah seorang laki-laki yang berpenyakit gila.” Bukankah ucapan ini tidak lain muncul dari penyerupa yang sesat, yang cara pandangnya terbalik, nalurinya ingin menolak dengan cara apa pun yang sesuai dengan kata hatinya, tidak memahami apa yang diucapkannya. Allah enggan (menerimanya) kecuali untuk memperlihatkan kehinaan orang-orang yang memusuhi beliau dan para RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 25: Yakni waktu kematiannya. Syubhat-syubhat yang dilemparkan orang-orang kafir itu untuk menentang nabi menunjukkan besarnya kekafiran mereka dan bahwa mereka berada dalam kebodohan dan kesesatan, kaena alasan atau syubhat itu sama sekali tidak tepat dari berbagai sisi, bahkan saling bertentangan dan berbenturan. Perkataan mereka, “\"Orang ini tidak lain hanyalah manusia seperti kamu, yang ingin menjadi orang yang lebih mulia daripada kamu,” pada hakikat menetapkan bahwa Beliau berakal dan mencari cara agar Beliau berada di atas mereka, namun pada waktu yang lain mereka juga mengatakan, “Ia hanyalah seorang laki-laki yang gila,” Bukankah perkataan ini dengan perkataan sebelumnya bertentangan, dan menunjukkan bahwa maksudnya adalah menolaknya dengan berbagai cara tanpa memikirkan perkataan apa yang perlu dilontarkannya untuknya? Namun demikian, Allah tidak menghendaki selain menampakkan kehinaan orang yang memusuhi-Nya dan memusuhi Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 25",
    "description": "Para pemuka orang kafir itu melanjutkan, 'dia, yakni nuh, ha-Nyalah seorang laki-laki yang gila sehingga dia ingin menonjolkan diri, maka tunggulah terhadapnya, yakni bersabarlah kamu, sampai waktu yang ditentukan di mana dia sembuh atau meninggal dunia. '26. Setelah sekian kali mendengar pemuka kaumnya yang kafir berkata demikian, dan terbukti bahwa mereka menolak dakwahnya, dia, yakni nabi nuh, berdoa, 'ya tuhanku, penolong dan pembimbingku, tolonglah aku karena mereka telah sekian kali mendustakan aku. '."
  }
]