[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nuh berkata, “wahai Tuhanku,tolonglah aku menghadapi kaumku, disebabkan pendustaan mereka terhadapku dalam perkara yang aku sampaikan kepada mereka dari risalahMu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Nuh -'alaihissalām- berkata, \"Ya Tuhanku! Tolonglah aku dengan memberikan mereka azab karena mereka hanya mendustakan ku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Maka Nuh tunduk memohon pertolongan dari Tuhannya dalam menghadapi kaumnya yang mendustakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قَالَ رَبِّ انصُرْنِى (Nuh berdoa: “Ya Tuhanku, tolonglah aku) Yakni tolonglah aku atas mereka. Maka Allah menyiksa mereka dengan apa yang Dia kehendaki dan dengan cara yang Dia kehendaki pula. بِمَا كَذَّبُونِ(karena mereka mendustakan aku) Yakni disebabkan kedustaan mereka terhadapku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Nuh berdoa: \"Ya Tuhanku, tolonglah aku, karena mereka mendustakan aku. Binasakanlah mereka.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berdoa,“Ya Tuhanku, tolonglah aku karena mereka telah mendustakanku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Ketika Nuh menyaksikan bahwa dakwahnya tidaklah memberikan manfaat bagi mereka kecuali (menambah mereka) lari, “Nuh berdoa,’ya Rabbku, tolonglah aku karena mereka mendustakanku’.” Lalu beliau memohon pertolongan kepada Rabbnya atas bahaya mereka, dalam rangka marah karena Allah. Sebab mereka telah menyia-nyiakan perintahNya dan mendustakan para RasulNya. Allah berfirman, “ sungguh Nuh telah menyeru kami , sungguh maka sebaik-baik yang memperkenankan (seruan adalah kami),”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 26: Ketika Nuh merasa bahwa seruannya tidak bermanfaat apa-apa bagi mereka selain menambah mereka lari, Nuh berdoa sebagaimana yang disebutkan dalam ayat di atas. Pertolongan yang dipermohonkan oleh Nuh kepada Allah ialah membinasakan kaumnya. Lihat selanjutnya surat Nuh ayat 26. Beliau marah karena Allah, karena mereka menyia-nyiakan perintah-Nya dan mendustakan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 26",
    "description": "Setelah sekian kali mendengar pemuka kaumnya yang kafir berkata demikian, dan terbukti bahwa mereka menolak dakwahnya, dia, yakni nabi nuh, berdoa, 'ya tuhanku, penolong dan pembimbingku, tolonglah aku karena mereka telah sekian kali mendustakan aku. '27. Allah memperkenankan doa nabi nuh tersebut. Lalu kami wahyukan kepadanya, 'buatlah kapal untuk menyelamatkan dirimu dan para pengikutmu, yang prosesnya di bawah pengawasan dan petunjuk kami. Maka apabila perintah dan siksa yang kami siapkan untuk kaummu yang kafir datang, engkau pun telah menyelesaikan perahu itu, dan tanur yakni dapur telah memancarkan air, maka masukanlah ke dalam kapal itu sepasang-sepasang, yakni jantan dan betina, dari setiap jenis hewan, dan naikkan juga keluargamu, kecuali orang yang lebih dahulu ditetapkan sebagai penerima siksa kami di antara mereka. Dan janganlah engkau bicarakan dengan-ku tentang orang-orang yang zalim. Jangan kaumohon agar mereka diselamatkan, karena sesungguhnya mereka itu akan ditenggelamkan, dan tidak ada yang dapat mengubah ketetapan-ku."
  }
]