[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami mewahyukan kepadanya, “Buatlah sebuah kapal dengan pengawasan pandangan Mata Kami dan perintah Kami serta pertolongan dari Kami, dan kamu dalam pelindungan dan jaminan Kami. Ketika telah datang keputusan Kami untuk menyiksa kaummu dengan hanyut di dalam air, dan banjir bandang mulai menerjang, serta air memancar dari dapur api (yaitu tempat yang dipakai memanggang roti) sebagai tanda datangnya siksaan, maka masukkanlah ke dalam kapal semua yang hidup,lelaki, dan perempuan, agar kelangsungan keturunan akan tetap terjaga. Dan masukanlah keluargamu, kecuali yang berhak mengalami siksaan karena kekufurannya, seperti istrimu dan anak lelakimu. Dan janganlah kamu meminta kepadaKu agar kaummu yang zhalim itu diselamatkan, sebab sesungguhnya mereka akan ditenggelamkan, dan itu pasti.” Di dalam ayat ini terkandung penetapan sifat “Mata” bagi Allah sesuai dengan yang layak bagiNya, tanpa menyerupakanNya dengan makhluk dan tanpa menentukan bentuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Maka Kami pun mewahyukan kepadanya, \"Buatlah kapal di bawah pengawasan dan pengajaran Kami agar kalian tahu cara membuatnya, lalu apabila perintah Kami untuk membinasakan mereka telah tiba, dan dapur tempat pembuatan roti telah memancarkan air secara deras, maka masukkanlah ke dalam kapal itu sepasang-sepasang makhluk hidup agar keturunan mereka tetap berlangsung, dan masukkan pula keluargamu kecuali orang yang lebih dahulu ditetapkan akan ditimpa siksaan seperti istri dan anakmu. Dan janganlah engkau bicarakan denganku tentang orang-orang zalim dengan kekafiran agar mereka diselamatkan dan tidak di adzab, sebab sesungguhnya mereka itu sudah pasti dibinasakan dengan ditenggelamkan dalam banjir bandang itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Kemudian Allah mengabulkan doa Nabi Nuh, dan memerintahkannya: “Buatlah kapal dengan perlindungan, pengawasan, dan pengajaran Kami.” Hingga ketika ketetapan Kami untuk membinasakan mereka telah datang, dan air telah memancar dari permukaan tanah dan dari tungku api tempat pembuatan roti -yang merupakan tanda telah datangnya azab-, maka Kami berfirman: “Angkutlah ke atas kapal itu setiap jenis hewan satu pasang, dan angkutlah pula keluargamu kecuali yang telah Allah tetapkan untuk dibinasakan; dan janganlah kamu meminta syafaat bagi orang-orang kafir, sebab mereka semua akan ditenggelamkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. فَأَوْحَيْنَآ إِلَيْهِ أَنِ اصْنَعِ الْفُلْكَ (Lalu Kami wahyukan kepadanya: “Buatlah bahtera) Yakni kapal. بِأَعْيُنِنَا(di bawah pengawasan) Yakni dengan penjagaan Kami. وَوَحْيِنَا(dan petunjuk Kami) Yakni Kami akan menunjukkan kepadamu bagamana membut perahu. فَإِذَا جَآءَ أَمْرُنَا(maka apabila perintah Kami telah datang) Untuk mengazab mereka. وَفَارَ التَّنُّورُ ۙ( dan tanur telah memancarkan air) Makna (التنور) adalah tungku yang dipakai untuk memasak roti. Allah menjadikan air yang memancar darinya sebagai tanda dimulainya banjir bandang. Yakni jika sudah terjadi hal ini maka naikkanlah ke atas perahu tiap pasang hewan. فَاسْلُكْ فِيهَا مِن كُلٍّ زَوْجَيْنِ اثْنَيْنِ(maka masukkanlah ke dalam bahtera itu sepasang dari tiap-tiap (jenis)) Yakni masukkanlah ke dalam perahu sepasang dari tiap jenis hewan. Nabi Nuh diperintah untuk melakukan hal ini agar kehidupan tetap berjalan di muka bumi, dan hewan-hewan dapat berkembang biak lagi setelah yang lainnya tenggelam dalam banjir bandang. وَأَهْلَكَ(dan (juga) keluargamu) Yakni dan naikkanlah juga keluargamu. إِلَّا مَن سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْ ۖ( kecuali orang yang telah lebih dahulu ditetapkan (akan ditimpa azab) di antara mereka) Yakni ketetapan dari Allah tentang siapa yang akan dibinasakan diantara mereka. وَلَا تُخٰطِبْنِى فِى الَّذِينَ ظَلَمُوٓا۟ ۖ( Dan janganlah kamu bicarakan dengan Aku tentang orang-orang yang zalim) Yakni dengan doa bagi mereka agar diselamatkan. إِنَّهُم مُّغْرَقُونَ(karena sesungguhnya mereka itu akan ditenggelamkan) Yakni mereka telah ditetapkan untuk ditenggelamkan karena kezaliman mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kemudian Kami wahyukan kepada Nuh: \"Buatlah bahtera/perahu besar sesuai petunjuk Kami, maka apabila perintah Kami telah datang akan datangnya azab untuk mereka dan Tanur/ Hubzul hubaz yaitu tempat api telah memancarkan air, maka masukkanlah ke dalam bahtera itu sepasang dari tiap-tiap jenis, beserta keluargamu. Kecuali orang yang telah lebih dahulu ditetapkan bahwa mereka akan ditimpa azab sebab kekufuran mereka. Janganlah kamu bicarakan/berikan pertolongan kepada orang-orang kafir, karena sesungguhnya mereka itu akan ditenggelamkan sebab kedhaliman mereka dalam kesyirikan dan maksiat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami wahyukan kepadanya,“Buatlah kapal dengan pengawasan Kami} pengawasan dari Kami {dan wahyu Kami} petunjuk Kami kepadamu {Apabila perintah Kami telah datang} azab Kami dengan mendatangkan banjir bandang {dan tungku telah memancarkan air} air memancar dengaan deras dari tungku yang digunakan untuk memanggang {masukkanlah ke dalamnya} masukkanlah ke dalam kapal {sepasang-sepasang dari setiap jenis, dan keluargamu, kecuali orang yang lebih dahulu ditetapkan untuknya di antara mereka} orang yang telah berlaku ketetapan Allah atas dirinya bahwa dia termasuk orang-orang yang ditenggelamkan karena kekufurannya {Janganlah berbicara denganKu} janganlah meminta meninjau ulang kepadaKu {tentang orang-orang yang zalim. Sesungguhnya mereka itu akan ditenggelamkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27 “ lalu kami wahyukan kepadanya,” ketika kami telah mengabulkan doanya sebagai faktor penyebab dan sarana untuk keselamatan sebelum timbul gejala-gejalanya, “buatlah bahtera,” yaitu kapal laut “di bawah penilikan dan petunjuk kami,” maksudnya, dengan perintah dan pertolongan kami, sementara engkau tetap berada dalam pemeliharaan dan perlindungan kami, yang mana kami melihat dan mendengarmu. “maka apabila perintah kami telah datang,” dengan mengirimkan angin topan yang menjadi siksaan bagi mereka “dan tannur telah memancarkan air,” maksudnya bumi memancarkan air dan mengucurlah mata air-mata air bahkan di tempat penyulutan api, yang tidak biasa terjadi kecuali ketika berada di tempat jauh dari air, “maka masukkanlah ke dalam bahtera itu sepasang dari tiap-tiap (jenis),” maksudnya maksukkanlah ke dalam kapal dari setiap jenis binatang jantan dan betinya, supaya menjadi sumber keberlangsungan keturunan bagi seluruh hewan yang dituntut oleh hikmah Allah harus ada di permukaan bumi “dan (juga) keluargamu,” maksudnya masukkanlah mereka “kecuali orang yang telah lebih dahulu ditetapkan (akan ditimpa azab) diantara mereka,” seperti anaknya. “dan janganlah kamu bicarakan dengan Aku tentang orang-orang yang zhalim,” maksudnya janganlah engkau memohon kepadaku untuk menyelamatkan mereka. Sesungguhnya keputusan dan takdir telah ditetapkan. “Sesungguhnya mereka itu kan ditenggelamkan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 27: Sebagai sebab dan sarana untuk selamat ketika tiba perintah-Nya. Mengirimkan banjir besar untuk menenggelamkan mereka. Yang dimaksud dengan tanur ialah semacam alat pemasak roti yang diletakkan di dalam tanah terbuat dari tanah liat, biasanya tidak ada air di dalamnya. Terpancarnya air di dalam tanur itu menjadi suatu tanda bahwa banjir besar akan tiba. Jantan dan betina. Istri dan anak-anakmu. Yaitu istrinya dan anaknya Kan’an (atau dinamai pula dengan Yaam). Adapun ketiga istrinya yang lain dan anak-anaknya yang lain (Haam, Saam, dan Yaafits) maka mereka ikut bersama Nabi Nuh ‘alaihis salam. Para ulama berbeda pendapat tentang jumlah orang yang ikut menaiki kapal Nabi Nuh ‘alaihis salam. Menurut Ibnu ‘Abbas, bahwa jumlah mereka 80 orang dengan wanitanya. Menurut Ka’ab Al Ahbar, bahwa jumlah mereka 72 orang. Ada pula yang berpendapat, bahwa jumlah mereka sepuluh orang, wallahu a’lam (lihat Qashasul Anbiyaa’ karya Ibnu Katsir). Maksudnya adalah, jangan engkau berdoa kepada-Ku untuk menyelamatkan mereka. Jamaah para mufassir berkata, \"Air naik setinggi 15 hasta di atas puncak gunung tertinggi di muka bumi. Inilah yang disebutkan oleh Ahli Kitab. Ada pula yang berpendapat, 80 hasta, dan air itu merata ke seluruh penjuru bumi tinggi dan lebarnya, baik bagian bumi yang lunak maupun kasarnya, gunung-gunung maupun datarannya serta daratan berpasir, dan tidak ada lagi mata yang berkedip dari orang-orang yang hidup di muka bumi sebelumnya, anak-anak maupun orang dewasa (semuanya tenggelam).” lihat Qashasul Anbiyaa’ karya Ibnu Katsir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 27",
    "description": "Allah memperkenankan doa nabi nuh tersebut. Lalu kami wahyukan kepadanya, 'buatlah kapal untuk menyelamatkan dirimu dan para pengikutmu, yang prosesnya di bawah pengawasan dan petunjuk kami. Maka apabila perintah dan siksa yang kami siapkan untuk kaummu yang kafir datang, engkau pun telah menyelesaikan perahu itu, dan tanur yakni dapur telah memancarkan air, maka masukanlah ke dalam kapal itu sepasang-sepasang, yakni jantan dan betina, dari setiap jenis hewan, dan naikkan juga keluargamu, kecuali orang yang lebih dahulu ditetapkan sebagai penerima siksa kami di antara mereka. Dan janganlah engkau bicarakan dengan-ku tentang orang-orang yang zalim. Jangan kaumohon agar mereka diselamatkan, karena sesungguhnya mereka itu akan ditenggelamkan, dan tidak ada yang dapat mengubah ketetapan-ku. 28-29. Melanjutkan arahan-Nya kepada nabi nuh, Allah berfirman, 'dan apabila engkau dan orang-orang yang bersamamu telah berada di atas kapal, maka ucapkanlah, 'segala puji bagi Allah yang telah menyelamatkan kami dari kejahatan dan gangguan orang-orang kafir yang zalim. ' dan berdoalah pula terutama ketika engkau turun dari bahtera itu, 'ya tuhanku, tempatkanlah aku di kapal ini atau di mana pun yang engkau kehendaki pada tempat yang diberkahi, dan engkau adalah sebaik-baik pemberi tempat dan pemberi kemuliaan bagi hamba-Mu. '."
  }
]