[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika kamu telah berada di atas kapal dengan tenang, kamu dan orang-orang yang bersamamu dalam keadaan aman dari ancaman tenggelam, maka ucapkanlah, “Segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang kafir.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Maka apabila engkau dan orang-orang mukmin yang selamat bersamamu telah berada di atas kapal, katakanlah, \"Segala puji bagi Allah yang telah menyelamatkan kami dari kezaliman kaum yang kafir lalu dia membinasakan mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Dan jika kamu telah naik ke kapal bersama orang-orang yang menyertaimu, maka katakanlah: “Segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang kafir.” Dan katakanlah: “Ya Tuhanku, turunkanlah kami di tempat yang diberkahi, Engkau adalah sebaik-baik yang menurunkan hamba-Nya ditempat yang diberkahi.” Allah mengabulkan doa ini sebagaimana disebutkan dalam firman-Nya: قِيلَ يَٰنُوحُ ٱهْبِطْ بِسَلَٰمٍ مِّنَّا وَبَرَكَٰتٍ عَلَيْكَ وَعَلَىٰٓ أُمَمٍ مِّمَّن مَّعَكَ ۚ وَأُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُم مِّنَّا عَذَابٌ أَلِيمٌ \"Hai Nuh, turunlah dengan selamat sejahtera dan penuh keberkatan dari Kami atasmu dan atas umat-umat (yang mukmin) dari orang-orang yang bersamamu. Dan ada (pula) umat-umat yang Kami beri kesenangan pada mereka (dalam kehidupan dunia), kemudian mereka akan ditimpa azab yang pedih dari Kami\". (Hud: 48)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. فَإِذَا اسْتَوَيْتَ (Apabila kamu telah naik) Yakni telah menaiki perahu. أَنتَ وَمَن مَّعَكَ(kamu dan orang-orang yang bersamamu) Yakni keluargamu dan para pengikutmu. عَلَى الْفُلْكِ(di atas bahtera itu) Mengendarai perahu itu. فَقُلِ الْحَمْدُ لِلّٰهِ الَّذِى نَجَّىٰنَا مِنَ الْقَوْمِ الظّٰلِمِينَ (maka ucapkanlah: “Segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang yang zalim”) Yakni memisahkan kami dari mereka, dan menyelamatkan kami dari kezaliman dan kejahatan mereka. Maka Allah membinasakan mereka dengan kuasa dan kemampuan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Apabila kamu dan orang-orang yang bersamamu telah berada di atas bahtera itu, maka ucapkanlah: \"Segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang yang zalim\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kamu telah naik} naik {dengan orang yang bersamamu di atas kapal, maka ucapkanlah,”Segala puji bagi Allah yang telah menyelamatkan kami dari kaum yang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28 “dan apabila kamu dan orang-orang yang bersamamu telah berada di atas bahtera itu,” maksudnya, kalian telah berada di atasnya dan (kapal itu) telah tenang bersama kalian dalam arus gelombang air dan ombak lautan, maka pujilah Allah atas kebebasan dan keselamatan. Dan katakanlah, ”segala puji bagi Allah yang telah menyelamatkan kami dari orang-orang yang zhalim.” Ini merupakan pengajaran dari Allah bagi beliau dan orang-orang yang beserta beliau, agar mereka mengucapkannya sebagai wujud syukur dan pujian bagiNya atas keselamatan mereka dari kaum yang berbuat aniaya dalam tindakan dan siksa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 28: Yakni orang-orang kafir dan pembinasaan yang menimpa mereka. Firman-Nya ini merupakan pengajaran dari Allah untuk Beliau dan orang-orang yang bersama Beliau untuk memuji Allah sebagai tanda syukur kepada-Nya. Allah juga mengajarkan Nabi Nuh ‘alaihis salam untuk berdoa kepada-Nya agar dimudahkan Allah untuk menempati tempat yang diberkahi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 28",
    "description": "28-29. Melanjutkan arahan-Nya kepada nabi nuh, Allah berfirman, 'dan apabila engkau dan orang-orang yang bersamamu telah berada di atas kapal, maka ucapkanlah, 'segala puji bagi Allah yang telah menyelamatkan kami dari kejahatan dan gangguan orang-orang kafir yang zalim. ' dan berdoalah pula terutama ketika engkau turun dari bahtera itu, 'ya tuhanku, tempatkanlah aku di kapal ini atau di mana pun yang engkau kehendaki pada tempat yang diberkahi, dan engkau adalah sebaik-baik pemberi tempat dan pemberi kemuliaan bagi hamba-Mu. '28-29"
  }
]