[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang meninggalkan segala sesuatu yang tidak ada kebaikan padanya dari ucapan-ucapan dan perbuatan-perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan orang-orang yang berpaling dan menjauhkan diri dari kebatilan, kesia-siaan, dan perbuatan atau perkataan yang mengandung maksiat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَالَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ (dan orang-orang yang menjauhkan diri dari (perbuatan dan perkataan) yang tiada berguna) Makna (اللغو) adalah segala perkataan dan perbuatan sia-sia, senda gurau, maksiat, dan tidak baik. Dan berpaling dari perkataan dan perbuatan ini adalah dengan menjauhinya dan tidak menengok kepadanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "2-3 Diantara pengahalang kekhusyuan dalam shalat adalah: banyak canda dan berkata hal yang tidak bermanfaat; oleh karena itu disebutkan setelah ayat khusyuk diantara sifat orang beriman adalah berpalingnya mereka dari banyak canda."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Serta orang-orang yang menjauhkan diri dari perbuatan dan perkataan yang tidak berguna,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan orang-orang yang menghindar dari perkataan tidak berguna} perkataaan yang sia-sia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan orang-orang yang dari (perbuatan dan perkataan) yang tiada berguna,” yaitu perbincangan yang tidak ada muatan kebaikan dan kegunaannya sama sekali, “mereka menjauhkan diri,” karena kebencian dan ingin menjaga diri serta keengganan. Bila mendapati tindakan sia-sia, mereka sekedar melewatinya dengan menjaga kehormatan diri. Jika mereka berpaling dari tindakan yang sia-sia, maka sudah semestinya mereka lebih menjauhi dari perkara-perkara yang diharamkan. Kalau seorang hamba mampu menguasai lisannya dan menyimpannya kecuali dalam kebaikan, maka dia akan berhasil mengendalikan perkara (agamanya). Seperti kandungan hadits yang disampaikan oleh Rasulullah kepada sahabat Mu’adz bin jabal manakala beliau berpesan kepada sahabat itu dengan beberapa wasiat. “Tidakkah kamu mau aku mengabarimu dengan pengendalian perkara itu semuanya?” Aku menjawab,” Sudah tentu wahai Rasulullah.” Maka beliau memegang lisan sendiri seraya berkata,” Kamu tahanlah ini.” (hR. Ahmad dan at-tirmidzi). Kaum Mukminin, sebagian dari ciri mereka yang terpuji, adalah mengekang lisan-lisan mereka dari ucapan sia-sia dan omongan haram."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 3: Yakni yang tidak ada kebaikan dan faedahnya. Jika perbuatan yang tidak berguna mereka jauhi, maka perbuatan yang haram lebih mereka jauhi lagi. Oleh karena itulah, apabila seseorang mampu mengendalikan anggota badan yang paling ringan digerakkan (lisan), maka sudah tentu dia dapat mengendalikan anggota badan yang lain, sebagaimana sabda Nabi shallallahu 'alaihi wa sallam kepada Mu’adz bin Jabal, “Maukah kamu aku beritahukan penopang semua itu?” Mu’adz berkata, “Ya, wahai Rasulullah.” Beliau bersabda, “Jagalah ini.” Yakni lisanmu. Nah, orang-orang mukmin, karena sifat mereka yang terpuji, mereka jaga lisan mereka dari perkataan sia-sia dan hal-hal haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 3",
    "description": "Dan di antara mereka yang akan memperoleh keberuntungan adalah orang yang menjauhkan diri, atau tidak memberi perhatian secara lahir dan batin, dari perbuatan dan perkataan yang tidak berguna, yaitu se-suatu yang sebenarnya di satu sisi tidak dilarang, namun di sisi lain tidak ada mendatangkan manfaat. 4. Dan orang yang juga akan beruntung dan berbahagia adalah orang yang menunaikan zakat secara sempurna dan tulus ikhlas."
  }
]