[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dalam peristiwa diselamatkannya kaum Mukminin dan dibinasakannya orang-orang kafir benar-benar terdapat petunjuk-petunjuk nyata tentang kebenaran rasul-rasul Allah dalam risalah yang mereka bawa dari Allah. Dan sungguh Kami menguji umat-umat manusia dengan mengutus rasul-rasul kepada mereka, sebelum datangnya siksaan pada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Sungguh pada peristiwa keselamatan Nuh beserta orang-orang mukmin yang bersamannya dan kebinasaan orang-orang kafir benar-benar terdapat tanda-tanda yang nyata tentang kebesaran dan kekuasaan Kami untuk menolong para rasul Kami dan membinasakan orang-orang yang mendustakan mereka. Kami sebelumnya telah menguji kaum Nuh dengan mengutus Nuh kepada mereka, agar jelas antara yang mukmin dan yang kafir, serta yang taat dan durhaka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Sungguh pada kejadian besar antara Nuh dan kaumnya yang membangkang itu terdapat pelajaran dan ibrah bagi hamba-hamba yang lain. Sungguh Kami sedang menguji hamba-hamba Kami dengan ayat-ayat yang dibawa oleh para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. إِنَّ فِى ذٰلِكَ (Sesungguhnya pada (kejadian) itu) Yakni pada kisah Nabi Nuh yang diceritakan Allah. لَاٰيٰتٍ(benar-benar terdapat beberapa tanda) Yakni tanda yang menunjukkan sempurnanya kuasa Allah. وَإِن كُنَّا لَمُبْتَلِينَ(dan sesungguhnya Kami menimpakan azab) Yakni sungguh Kami menguji mereka dengan mengutus para Rasul kepada mereka agar jelas siapa yang akan mentaati dan siapa yang tetap bermaksiat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Sesungguhnya pada kisah dan kejadian itu benar-benar terdapat beberapa tanda kebesaran dan kesempurnaan kekuasaan Allah. Serta terdapat pelajaran dan nasehat. Sesungguhnya Kami benar-benar akan menguji hamba Kami, diantaranya adalah dengan menunjukkan ayat-ayat Kami dan mengutus utusan. Kami menguji mereka untuk mengetahui mana yang taat di antara orang-orang yang bermaksiat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada (kejadian) itu benar-benar terdapat tanda-tanda} petunjuk-petunjuk yang jelas atas kesempurnaan kuasa Allah SWT {Sesungguhnya Kami benar-benar menimpakan cobaan} benar-benar menguji mereka dengan mengutus seorang rasul, agar tampak orang yang taat daripada orang-orang yang bermaksiat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30 “sesungguhnya pada kejadian itu,” yaitu dalam kisah ini ”benar-benar terdapat beberapa tanda (kebesaran Allah),” yang menunjukan bahwa Allah satu-satuNya Dzat yang berhak disembah, dan bahwa utusanNya, Nuh adalah orang yang jujur, sedangkan kaumnya itulah pihak yang berbohong, dan menunjukkan bahwa curahan rahmat Allah bagi para hambaNYa, yaitu Allah telah mengangkut mereka di dalam tulang sulbi Nabi Nuh didalam kapal, ketika semua penduduk dunia tenggelam. Begitulah kapal itu juga merupakan tanda kebesaran Allah. “dan sungguh telah kami jadikan kapal itu sebagai pelajaran, maka adakah orang yang mau mengambil pelajaran?” oleh karena itu, Allah menyatukan kisah ini disini, lantaran membuktikan beberapa tanda kebesaran Allah dan beberapa orientasi. “dan sesungguhnya kami menimpakan azab (kepada kaum Nuh itu).”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 30: Pada kisah Nuh ‘alaihis salam terdapat tanda-tanda yang menunjukkan bahwa Allah yang berhak disembah saja, dan bahwa Rasul-Nya Nuh ‘alaihis salam adalah benar, sedangkan kaumnya dusta. Demikian pula menunjukkan rahmat Allah kepada hamba-hamba-Nya karena telah mengangkutkan mereka ke kapal Nabi Nuh ketika penduduk bumi tenggelam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 30",
    "description": "Sungguh, pada kisah nabi nuh itu benar-benar terdapat tanda-tanda kebesaran Allah dan kesempurnaan kekuasaan-Nya; dan sesungguhnya kami benar-benar menguji hamba-hamba kami dengan menimpakan siksaan kepada yang ingkar, di antaranya kaum nabi nuh yang mendustakan risalahnya. 31-32. Azab atas orang-orang yang membangkang terhadap dakwah nabi nuh bukanlah suatu kebetulan, melainkan ketetapan dari Allah. Allah berfirman, 'kemudian setelah mereka binasa, kami ciptakan umat yang lain, yaitu kaum 'ad. Lalu kami utus kepada mereka seorang rasul dari kalangan mereka sendiri, yaitu nabi hud. Dia menyeru kaumnya, 'sembahlah Allah! tidak ada tuhan yang berhak disembah bagimu selain dia. Maka, mengapa kamu tidak bertakwa kepada-Nya, yakni menjauhkan diri dari siksa-Nya dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya'''."
  }
]