[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami mengutus ditengah mereka seorang rasul dari kalangan mereka sendiri, yaitu Hud. Dia berkata kepada mereka, “Beribadahlah hanya kepada Allah. Sekali-kali kalian tidak mempunyai sesembahan yang haq selainNya. Apakah kalian tidak takut akan siksaNya, bila kalian menyembah selainNYa?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Lalu Kami utus kepada mereka seorang rasul dari kalangan mereka sendiri untuk menyeru mereka ke jalan Allah. Dia berkata kepada mereka, \"Sembahlah Allah semata, tiada tuhan yang berhak kalian sembah selain Dia, maka apakah kalian tidak bertakwa kepada Allah dengan mengerjakan perintah dan menjauhi larangan-Nya?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. فَأَرْسَلْنَا فِيهِمْ رَسُولًا مِّنْهُمْ (Lalu Kami utus kepada mereka, seorang rasul dari kalangan mereka sendiri) Yakni yang hidup dan tumbuh di antara mereka agar mereka lebih mendengar perkataannya jika dibandingkan dengan perkataan orang yang datang dari tempat lain. أَنِ اعْبُدُوا۟ اللهَ مَا لَكُم مِّنْ إِلٰهٍ غَيْرُهُۥٓ ۖ( Sembahlah Allah oleh kamu sekalian, sekali-kali tidak ada Tuhan selain daripada-Nya) Yakni ia menyeru kepada asas dari apa yang diserukan oleh para Rasul kepada kaum mereka, yaitu menyembah dan mengesakan Allah serta ikhlas dalam beribadah kepada-Nya. أَفَلَا تَتَّقُونَ (Maka mengapa kamu tidak bertakwa) Yakni apakah kalian tidak takut kepada Allah sehingga kalian tidak menyembah selain Allah dan menyekutukan-Nya sehingga menjadikan kalian mendapat azab dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Lalu Kami utus kepada mereka, seorang rasul dari kalangan mereka sendiri yang berkata: \"Duhai kamu sekalian, sembahlah Allah, sekali-kali tidak ada Tuhan selain Dia. Maka mengapa kamu tidak takut kepada azab-Nya, sehingga kalian meninggalkan penyembahan tuhan selain Dia, meninggalkan kesyirikan. Mengapa kalian tidak takut akan azab-Nya, sehingga kalian menjadi beriman?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami mengutus kepada mereka seorang rasul dari (kalangan) mereka. “Sembahlah Allah, tidak ada Tuhan bagi kalian selain Dia. Apakah kalian tidak bertakwa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32 “lalu kami utus kepada mereka, seorang rasul dari kalangan mereka sendiri,” yang bersal dari bangsa mereka. Mereka mengetahui silsilah nasab, kedudukan social, dan kejujurannya agar mereka lebih segera patuh lantaran berasal dari orang-orang kalangan mereka sendiri dan lebih menghilangkan antipasti mereka. Beliau menyerukan kepada sasaran seperti (inti sari) dakwah yang diserukan oleh para rasul kepada para umat mereka, “sembahlah Allah oleh kamu sekalian, sekali-kali tidak ada tuhan (yang haq) selain dariNya.” Mereka semua telah bersepakat tentang dakwah (tauhid) ini. Ini adalah dakwah yang pertama kali mereka serukan kepada para umat mereka; (yaitu) perintah untuk beribadah kepada Allah saja dan pemberitahuan bahwa Dia adalah Dzat yang paling berhak diibadahi serta larangan dari menyembah selainNya, dan pemberitahuan kebatilan dan kerusakan peribadahan kepada selainNya. Oleh sebab itu, Allah berfirman, “maka mengapa kamu tidak bertakwa (kepadaNya),” yaitu kepada Rabb kalian, sehingga meninggalkan berhala-berhala dan patung-patung itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 32: Mereka mengenali nasab Beliau, kehormatannya dan kejujurannya, di mana ini semua seharusnya membuat mereka segera mengikuti. Seruan para rasul adalah sama, yaitu Tauhid. Bisa juga diartikan, “Maka mengapa kamu tidak takut kepada Tuhanmu sehingga kamu beriman.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 32",
    "description": "31-32. Azab atas orang-orang yang membangkang terhadap dakwah nabi nuh bukanlah suatu kebetulan, melainkan ketetapan dari Allah. Allah berfirman, 'kemudian setelah mereka binasa, kami ciptakan umat yang lain, yaitu kaum 'ad. Lalu kami utus kepada mereka seorang rasul dari kalangan mereka sendiri, yaitu nabi hud. Dia menyeru kaumnya, 'sembahlah Allah! tidak ada tuhan yang berhak disembah bagimu selain dia. Maka, mengapa kamu tidak bertakwa kepada-Nya, yakni menjauhkan diri dari siksa-Nya dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya'''33. Kaum 'ad menolak dakwah nabi hud. Dan berkatalah para pemuka orang kafir dari kaumnya, yaitu tidak beriman kepada Allah dan rasul-Nya, dan yang mendustakan pertemuan hari akhirat di mana mereka akan mendapat balasan atas segala amal perbuatan mereka, serta mereka yang telah kami beri kemewahan dan kesenangan dalam kehidupan di dunia berupa harta yang melimpah, keturunan yang banyak, 'orang ini, yakni nabi hud, tidak lain hanyalah manusia seperti kamu, dia makan apa yang kamu makan, dan dia minum apa yang kamu minum. Tidak ada keistimewaan pada dirinya yang memantaskan dia menjadi utusan tuhan. '."
  }
]