[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka para pembesar dan pemuka-pemuka dari kaumnya yang kafir kepada Allah dan mengingkari kehidupan akhirat, yaitu orang-orang yang kemewahan hidup dunia telah menyebabkan mereka bertindak melampaui batas berkata, “Tidaklah orang yang menyeru kalian kepada pengesaan Allah dalam ibadah ini, melainkan manusia biasa seperti kalian, dia makan dari jenis makanan kalian dan minum dari jenis minuman yang sama dengan minuman kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Para pemuka dan pemimpin dari kaumnya yang kafir kepada Allah, yang mendustakan hari Akhirat beserta pahala dan siksa yang ada di dalamnya, serta telah dibutakan dan ditipu oleh berbagai nikmat yang Kami lapangkan bagi mereka di kehidupan dunia ini, mereka berkata kepada para pengikut dan seluruh kaum mereka, \"Orang ini tidak lain hanyalah manusia biasa seperti kalian, ia makan dari apa yang kalian makan, dan minum dari apa yang kalian minum, sungguh ia tidak memiliki keistimewaan sama sekali sehingga harus diutus sebagai rasul bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Para pemuka kaumnya yang kafir dan mengingkari hari kebangkitan, serta hidup dalam kemewahan berkata: “Hud hanyalah manusia biasa seperti kalian, dia makan seperti apa yang kalian makan dan minum seperti apa yang kalian minum. Sungguh jika kalian mengikuti manusia biasa seperti kalian niscaya kalian telah merugi karena telah berpaling dari berhala-berhala kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَقَالَ الْمَلَأُ مِن قَوْمِهِ (Dan berkatalah pemuka-pemuka yang kafir di antara kaumnya) Yakni para pembesar dan pemimpin mereka. الَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِلِقَآءِ الْاٰخِرَةِ (yang mendustakan akan menemui hari akhirat) Yakni kejadian yang ada di akhirat seperti hisab dan pembalasan. وَأَتْرَفْنٰهُمْ (dan yang telah Kami mewahkan mereka) Yakni Kami luaskan kenikmatan dunia bagi mereka sehingga mereka menjadi angkuh. فِى الْحَيَوٰةِ الدُّنْيَا (dalam kehidupan di dunia) Karena harta mereka yang banyak dan kehidupan mereka yang mewah. يَأْكُلُ مِمَّا تَأْكُلُونَ مِنْهُ (dia makan dari apa yang kamu makan) Dan bagi mereka itu menjadikannya tidak memiliki suatu kelebihan dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Berkatalah para pemuka kafir di antara kaumnya yang mengingkari Allah dan rasul-Nya serta mendustakan hari akhirat beserta siksa dan pahalanya. Kami mewahkan mereka dalam kehidupan di dunia dengan berbagai keluasan rizki dan anak, sehingga mereka berkata: \"Orang ini (yaitu nabi Hud) tidak lain hanyalah manusia seperti kamu, dia makan dari apa yang kamu makan, dan meminum juga dari apa yang kamu minum. Kalau memang Allah mengutusnya sebagai rasul, pasti Allah telah menjadikannya sebagai malaikat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para pemuka kaumnya yang ingkar, mendustakan pertemuan di akhirat, dan mereka yang telah Kami beri kemewahan} Kami telah memberi nikmat dan keluasan {di kehidupan di dunia berkata,“Orang ini tidak lain hanyalah manusia seperti kalian. Dia makan apa yang kalian makan dan minum apa yang kalian minum"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33 Kemudian berkatalah, “pemuka-pemuka yang kafir dari kaumnya dan yang mendustakan akan menemui Hari Akhirat (kelak) dan yang telah kami mewahkan mereka dalam kehidupan di dunia,” maksudnya para pembesar yang telah menggabungkan antara kekufuran, permusuhan dan pengingkaran terhadap hari kebangkitan dan pembalasan, serta kehidupan mewah di dunia telah menyebabkan mereka melampaui batas sebagai perlawanan terahadap nabi mereka dan pendustaan serta peringatan (kepada manusia) darinya berkata,” (orang) ini tidak lain hanyalah manusia seperti kamu,” maksudnya dari komunitas kalian, “dia makan dari apa yang kamu makan dan meminum dari apa yang kmau minum,” lalu sisi apakah yang melebihkan dia di atas kalian? Kenapa ia tidak berupa malaikat yang tidak makan makanan dan tidak minum minuman?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 33: Yakni di mana kelebihannya di atas kamu?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 33",
    "description": "Kaum 'ad menolak dakwah nabi hud. Dan berkatalah para pemuka orang kafir dari kaumnya, yaitu tidak beriman kepada Allah dan rasul-Nya, dan yang mendustakan pertemuan hari akhirat di mana mereka akan mendapat balasan atas segala amal perbuatan mereka, serta mereka yang telah kami beri kemewahan dan kesenangan dalam kehidupan di dunia berupa harta yang melimpah, keturunan yang banyak, 'orang ini, yakni nabi hud, tidak lain hanyalah manusia seperti kamu, dia makan apa yang kamu makan, dan dia minum apa yang kamu minum. Tidak ada keistimewaan pada dirinya yang memantaskan dia menjadi utusan tuhan. '34-35. Melanjutkan ucapan tersebut, para pemuka kaum 'ad yang kafir itu berkata, 'dan sungguh demi tuhan kita, jika kamu menaati manusia seperti kamu dalam apa yang ia perintahkan dan ia larang, dan kamu meninggalkan tuhan-tuhan kalian, niscaya kamu pasti akan rugi. Adakah dia menjanjikan kepada kamu bahwa apabila kamu telah mati dan dikubur, kemudian sebagian menjadi tanah dan/atau tulang belulang, lalu sesungguhnya kamu akan dikeluarkan dari kubur kamu untuk menerima balasan''."
  }
]