[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian mengikuti seseorang yang seperti kalian, sesungguhnya kalian kalau begitu menjadi orang-orang yang benar-benar merugi, dengan meninggalkan tuhan-tuhan sesembahan kalian dan mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan sungguh, jika kalian menaati manusia yang seperti diri kalian, niscaya kalian akan merugi karena kalian tidak akan mendapatkan manfaat apapun dalam menaatinya lantaran telah meninggalkan tuhan-tuhan kalian, dan juga karena kalian telah mengikuti orang yang sama sekali tidak memiliki kebaikan atas kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَئِنْ أَطَعْتُم بَشَرًا مِّثْلَكُمْ (Dan sesungguhnya jika kamu sekalian mentaati manusia yang seperti kamu) Yakni manusia yang memiliki sifat-sifat yang telah disebutkan itu. إِنَّكُمْ إِذًا لَّخٰسِرُونَ(kamu benar-benar (menjadi) orang-orang yang merugi) Yakni orang-orang yang tertipu akibat meninggalkan tuhan-tuhan kalian dan mengikuti dirinya yang tidak memiliki kelebihan atas kalian. Mereka tidak mengerti bahwa mungkin seorang Rasul yang diutus kepada mereka adalah manusia seperti mereka, dan inilah kesesatan mereka. Andai saja mereka bertanya kepada diri mereka sendiri, apa yang menghalangi jika rasul berasal dari golongan manusia? Niscaya mereka tidak akan mampu menjawabnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara kelemahan hujjah mereka yang menyesatkan itu adalah perkataannya kepada kaumnya (sebagai pendustaan terhadap Rasul): { وَلَئِنْ أَطَعْتُمْ بَشَرًا مِثْلَكُمْ } \"Dan sesungguhnya jika kamu sekalian mentaati manusia yang seperti kamu\" ; maka dkatakan kepada mereka: jika kaum kalian mengikuti dan mematuhi peringatan kalian ini; apakah mereka akan berhenti dari mengikuti manusia seperti mereka?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dan sesungguhnya jika kamu sekalian mentaati manusia yang seperti kamu baik perintah atau larangan mereka. Juga kalian meninggalkan sesembahan kalian. Jika kalian benar-benar mentaati mereka maka pendapat kalian itu benar-benar salah. Niscaya bila demikian, kamu benar-benar memperdayai dirimu sendiri dengan orang-orang seperti kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh jika kalian menaati manusia seperti kalian, sesungguhnya kalian benar-benar akan merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 “dan sesungguhnya jika kamu sekalian menaati manusia yang seperti kamu, niscaya bila demikian, kamu benar-benar (menjadi) orang-orang yang merugi,” maksudnya, jika kalian mengikutinya dan mendaulatnya sebagai pemimpinan kalian, padahal dia serupa dengan kalian, maka kalian benar-benar sudah kehilangan akal-akal kalian dan akan menyesal atas tindakan kalian! Ini termasuk perkara aneh. Sungguh, kerugian dan penyesalan yang sebenarnya terjadi pada orang yang tidak mengikuti dan patuh kepadanya. Kebodohan dan ketololan yang besar diarahkan bagi orang-orang yang menyombongkan diri untuk patuh kepada sesosok orang yang telah Allah istimewakan dengan wahyu (dariNya), mengutamakannya dengan risalah dan diuji dengan fenomena peribadahan terhadap pohon-pohon dan bebatuan. Inilah makna firman Allah : Maka mereka berkata: \"Bagaimana kita akan mengikuti saja seorang manusia (biasa) di antara kita? Sesungguhnya kalau kita begitu benar-benar berada dalam keadaan sesat dan gila\",Apakah wahyu itu diturunkan kepadanya di antara kita? Sebenarnya dia adalah seorang yang amat pendusta lagi sombong\". (QS. Al-Qomar : 24-25)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 34: Sungguh mengherankan, padahal sebenarnya kerugian dan penyesalan hanyalah bagi orang yang tidak mengikuti manusia yang diberi Allah wahyu dan diangkat-Nya sebagai rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 34",
    "description": "34-35. Melanjutkan ucapan tersebut, para pemuka kaum 'ad yang kafir itu berkata, 'dan sungguh demi tuhan kita, jika kamu menaati manusia seperti kamu dalam apa yang ia perintahkan dan ia larang, dan kamu meninggalkan tuhan-tuhan kalian, niscaya kamu pasti akan rugi. Adakah dia menjanjikan kepada kamu bahwa apabila kamu telah mati dan dikubur, kemudian sebagian menjadi tanah dan/atau tulang belulang, lalu sesungguhnya kamu akan dikeluarkan dari kubur kamu untuk menerima balasan''34-35"
  }
]