[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana kalian mau membenarkan peringatan yang dia sampaikan kepada kaliani bahwa bila kalian mati, kemudian kalian menjadi tanah dan tulang belulang, kalian akan dibangkitkan kembali dari kubur-kubur kalian dalam keadaan hidup?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Apakah orang yang mengklaim sebagai rasul ini menjanjikan kepada kalian bahwa bila kalian mati dan telah menjadi tanah serta tulang belulang yang hancur, kalian pasti akan dikeluarkan dari kubur dalam keadaan hidup kembali? Apakah ini masuk akal?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35-38. Kemudian mereka mengingkari hari kebangkitan dengan berbagai macam cara sebagaimana yang dijelaskan dalam empat ayat yang akan disebutkan ini: “Apakah Hud mengancam bahwa kalian akan dibangkitkan setelah kematian ketika kalian telah menjadi tanah dan tulang belulang yang berserakan? Sungguh sangat tidak mungkin kalian dibangkitkan dari kubur; kami tidak percaya adanya kehidupan melainkan kehidupan di dunia ini. Kita dilahirkan, namun kita tidak akan dibangkitkan setelah kematian. Hud hanyalah orang yang membuat kedustaan terhadap Allah, dan kami tidak akan mempercayainya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. أَنَّكُم مُّخْرَجُونَ (kamu sesungguhnya akan dikeluarkan (dari kuburmu)) Yakni kalian akan keluar dari kabur dalam keadaan hidup, padahal sebelumnya sebagian anggota tubuh kalian telah menjadi tanah, dan sebagian lainnya telah menjadi tulang belulang yang tidak lagi terbungkus daging atau urat-urat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Apakah Hud menjanjikan kepada kamu sekalian, bahwa bila kamu telah mati dan telah menjadi tanah dan tulang belulang, kamu sesungguhnya akan dibangkitkan dari kuburmu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah dia menjanjikan kepada kalian bahwa apabila kalian telah mati serta menjadi tanah dan tulang belulang, kalian benar-benar akan dikeluarkan} dibangkitkan dari kubur kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36 ketika mereka mengingkari dan menampik risalah beliau, mereka(juga) mengingkari keterangan yang beliau sampaikan, yaitu tentang kebangkitan setelah kematian dan pembalasan amalan-amalan. Mereka berkata,”apakah dia menjanjikan kepada kamu sekalian, bahwa bila kamu telah mati dan telah menjadi tanah dan tulang belulang bahwa kamu sungguh akan dikeluarkan (dari kuburmu). Jauh, jauh sekali (dari kebenaran) apa yang diancamkan kepada kamu itu,” maksudnya begitu jauh, begitu jauh apa yang dia janjikan kepada kalian, berupa kebangkitan sesudah kalian terkoyak-koyak dalam keadaan menjadi tanah dan tulang-belulang. Mereka memandang dengan perspektif yang kerdil dan melihatnya dari sudut kemampuan mereka sebagai perkara yang tidak `mungkin terjadi. Mereka membandingkan kekuasaan al-khalq Allah dengan kemampuan-kemampuan mereka. MahaTinggi Allah (dari ucapan mereka). Akhirnya, mereka mengingkari kekuasaan Allah untuk menghidupkan orang-orang yang sudah mati dan benar-benar menyatakanNya lemah. Mereka lupa terhadap proses penciptaan mereka pertama kali, dan Dzat yang menciptakan mereka dari barang yang tak berwujud, maka untuk mengembalikan wujud mereka setelah hancur akan lebih ringan bagiNya. Dua kejadian itu mudah bagiNya. Kenapa mereka tidak mengingkari saja awal mula penciptaan mereka dan menyikapi realita-realita yang konkret sembari mengatakan,”sesungguhnya kami senantiasa ada,” agar pengingkaran mereka terhadap kebangkitan tidak dipertanyakan lagi, sehingga kemudian argumentasinya dialihkan ke masalah penetapan wujud Dzat yang Menciptakan lagi MahaAgung? Disini masih ada dalil lain (untuk membukam mereka), yaitu, Dzat yang menghidupkan bumi setelah kematiannya, Dia adalah Dzat yang benar-benar berkuasa untuk menghidupkan orang-orang yang telah mati dan Dia Mahakuasa atas segala sesuatu. Masih ada bukti lain, yakni jawaban yang disampaikan oleh Allah kepada orang-orang yang mengingkari kebangkitanNya. Dalam firman-Nya : \"(Mereka tidak menerimanya) bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri, maka berkatalah orang-orang kafir: \"Ini adalah suatu yang amat ajaib\".Apakah kami setelah mati dan setelah menjadi tanah (kami akan kembali lagi)?, itu adalah suatu pengembalian yang tidak mungkin. Sesungguhnya Kami telah mengetahui apa yang dihancurkan oleh bumi dari (tubuh-tubuh) mereka, dan pada sisi Kami pun ada kitab yang memelihara (mencatat).\" (QS. Qof : 2-4)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 35: Oleh karena mereka mengingkari kerasulannya, mereka juga mengingkari apa yang Beliau beritakan, yaitu adanya kebangkitan setelah mati dan pembalasan terhadap amal. Maksudnya, dikeluarkan dalam keadaan hidup sebagaimana ketika di dunia. Mereka memandang dengan pandangan yang sempit dan mengukur dengan kemampuan mereka yang memang tidak mungkin, mereka samakan kemampuan Al Khaliq (Maha Pencipta) dengan kemampuan mereka sebagai makhluk yang dicipta, maka Mahasuci Allah. Mereka mengingkari kemampuan Allah menghidupkan orang yang telah mati dan lupa penciptaan mereka dahulu, dan bahwa yang mengadakan mereka pertama kali dari yang sebelumnya tidak ada tentu mampu menciptakan mereka kembali setelah mereka binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 35",
    "description": "34-35. Melanjutkan ucapan tersebut, para pemuka kaum 'ad yang kafir itu berkata, 'dan sungguh demi tuhan kita, jika kamu menaati manusia seperti kamu dalam apa yang ia perintahkan dan ia larang, dan kamu meninggalkan tuhan-tuhan kalian, niscaya kamu pasti akan rugi. Adakah dia menjanjikan kepada kamu bahwa apabila kamu telah mati dan dikubur, kemudian sebagian menjadi tanah dan/atau tulang belulang, lalu sesungguhnya kamu akan dikeluarkan dari kubur kamu untuk menerima balasan''36-38. Para pemuka yang kafir itu berkata dengan sinis sambil menggelengkan kepala, 'jauh! jauh sekali apa yang diancamkan kepada kamu. Hal itu hanya omong kosong belaka. Ancaman itu tidak akan pernah terlaksanan. Kehidupan yang ada tidak lain hanyalah kehidupan kita di dunia ini. Di sinilah kita menyaksikan sebagian dari kita mati dan sebagiannya lagi dilahirkan untuk hidup, dan sekali-kali kita tidak akan dibangkitkan lagi setelah mati. ' tidak cukup dengan mendurhakai dan menolak dakwah nabi hud, para pemuka kafir itu bahkan berbuat lebih jahat lagi dengan berkata, 'dia, hud, tidak lain hanyalah seorang laki-laki yang mengada-adakan kebohongan terhadap Allah, dan sudah semestinya kita tidak akan pernah memercayainya atas segala yang dikatakannya."
  }
]