[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah kehidupan kita ini, kecuali di dunia itu saja. Bapak-bapak kita meninggal,lalu lahirlah anak-anak. Dan kita tidak akan dibangkitkan (dari kubur) dalam keaadan hidup lagi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Kehidupan yang hakiki itu hanyalah kehidupan dunia, tidak ada kehidupan Akhirat. Orang-orang yang hidup di antara kita akan mati dam tidak akan hidup lagi. Lalu yang lainnya terlahir dan hidup. Sungguh kita semua tidak akan dikeluarkan dari kuburan setelah kematian untuk dihisab pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. إِنْ هِىَ إِلَّا حَيَاتُنَا الدُّنْيَا (kehidupan itu tidak lain hanyalah kehidupan kita di dunia ini) Yakni tidak ada kehidupan kecuali kehidupan dunia, tidak ada kehidupan akhirat yang diancamkan kepada kalian. نَمُوتُ وَنَحْيَا(kita mati dan kita hidup) Yakni di dunia saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Tidak ada kehidupan lain selain kehidupan kita di dunia ini. Kita mati dan kita terlahir dan sekali-kali tidak akan dibangkitkan lagi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya itu tidak lain hanyalah kehidupan kita di dunia ini. Kita mati, hidup, dan tidak akan dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37 “kehidupan itu tidak lain hanyalah kehidupan kita di dunia ini, kita mati dan kita hidup,”maksudnya ada orang yang mati dan ada orang yang terlahirkan lagi “dan seklai-kali kita tidak akan dibangkitkan lagi.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 37: Maksudnya, di samping sebagian dari manusia meninggal dunia, maka ada pula manusia yang dilahirkan. Mereka mengira bahwa hidup itu sebatas di dunia setelah itu selesai, tidak dibangkitkan dan tidak dimintai pertanggungjawaban terhadap amal yang dikerjakan. Hal ini jelas bertentangan dengan kebijaksanaan Allah. Allah Subhaanahu wa Ta'aala berfirman, “Maka apakah kamu mengira, bahwa sesungguhnya Kami menciptakan kamu secara main-main (saja), dan bahwa kamu tidak akan dikembalikan kepada kami?-- Maka Maha Tinggi Allah, Raja yang sebenarnya; tidak ada tuhan yang berhak disembah selain Dia, Tuhan (yang mempunyai) 'Arsy yang mulia.” (Terj. Al Mu’minuun: 115-116)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 37",
    "description": "36-38. Para pemuka yang kafir itu berkata dengan sinis sambil menggelengkan kepala, 'jauh! jauh sekali apa yang diancamkan kepada kamu. Hal itu hanya omong kosong belaka. Ancaman itu tidak akan pernah terlaksanan. Kehidupan yang ada tidak lain hanyalah kehidupan kita di dunia ini. Di sinilah kita menyaksikan sebagian dari kita mati dan sebagiannya lagi dilahirkan untuk hidup, dan sekali-kali kita tidak akan dibangkitkan lagi setelah mati. ' tidak cukup dengan mendurhakai dan menolak dakwah nabi hud, para pemuka kafir itu bahkan berbuat lebih jahat lagi dengan berkata, 'dia, hud, tidak lain hanyalah seorang laki-laki yang mengada-adakan kebohongan terhadap Allah, dan sudah semestinya kita tidak akan pernah memercayainya atas segala yang dikatakannya"
  }
]