[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Rasul mereka memohon kepada Tuhannya sembari berkata, “Wahai Tuhanku, tolonglah aku menghadapi mereka, dikarenakan mereka mendustakan aku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Rasul (Hūd) berkata, \"Ya Tuhanku! Tolonglah aku dari mereka dengan mengazab mereka karena telah mendustakanku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39-42. Kemudian Hud tunduk memohon pertolongan kepada Tuhannya dalam menghadapi kaumnya; maka Allah mengabulkan doanya dengan menegaskan: “Sebentar lagi mereka akan menyesali kekafiran mereka, karena mereka akan ditimpa suara yang sangat keras secara tiba-tiba; sehingga Kami menjadikan mereka seperti busa yang terapung di atas air. Mereka sangat jauh dari rahmat Allah, dan kebinasaan bagi kaum yang menzalimi para rasul.” Lalu Kami ciptakan setelah mereka umat-umat lain, seperti kaum Luth, kaum Syuaib, dan lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. قَالَ رَبِّ انصُرْنِى بِمَا كَذَّبُونِ (Rasul itu berdoa: “Ya Tuhanku, tolonglah aku karena mereka mendustakanku”) Yakni Rasul mereka berdoa setelah mengetahui mereka sama sekali tidak mempercayainya: “Ya Tuhanku, tolonglah aku atas mereka dan siksalah mereka karena telah mendustakan aku.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Hud berdoa: \"Ya Tuhanku, tolonglah aku karena mereka mendustakanku\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berdoa,“Ya Tuhanku, tolonglah aku karena mereka telah mendustakanku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39 oleh karena itu, ketika kekufuran mereka semakin menggila, sementara pemberian peringatan tidak berguna bagi mereka, maka beliau memanjatkan doa keburukan bagi mereka. Beliau berkata, ”ya Rabbku, tolonglah aku, karena mereka mendustakanku,” yaitu dengan cara menghabisi mereka dan menghinakan mereka di dunia sebelum di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 39: Yakni dengan membinasakan dan menghinakan mereka di dunia sebelum di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 39",
    "description": "Mendengar pendustaan dan pengingkaran kaumnya yang sungguh terlalu, dia, yaitu nabi hud, berdoa, 'ya tuhanku, tolonglah aku untuk mengalahkan mereka, karena mereka telah mendustakan aku. '40-41. Allah mengabulkan doa nabi hud. Dia berfirman, 'bersabarlah, wahai nabi hud. Tidak lama lagi mereka pasti akan menyesal. ' lalu setelah tiba waktunya, mereka benar-benar dimusnahkan oleh suara yang mengguntur. Mereka pantas mendapat azab itu sehingga kedatangan azab itu hak adanya. Dan kami jadikan mereka seperti sampah yang dibawa banjir akibat kezaliman mereka sendiri. Maka, binasalah bagi orang-orang yang zalim."
  }
]