[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang membersihkan jiwa dan harta mereka dengan membayarkan zakat harta mereka yang berbeda-beda jenis bentuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan orang-orang yang mensucikan diri mereka dari berbagai sifat buruk, dan mensucikan harta mereka dari yang haram dengan menunaikan zakat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَالَّذِينَ هُمْ لِلزَّكَوٰةِ فٰعِلُونَ (dan orang-orang yang menunaikan zakat) Yang dimaksud dengan zakat di sini adalah sedekah dan segala manfaat yang diberikan kepada seorang muslim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Serta orang-orang yang menunaikan kewajiban (zakat) dengan mengharap-harap kebaikan dan penyucian jiwa. Yaitu melakukan kewajiban yang telah diperintahkan Allah, bukan berarti bahwa makna zakat adalah berupa uang. Sebab tidak ada redaksi bahwa Fulan telah mengeluarkan uang. Namun Fulan telah melakukan kebaikan dan atau keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menunaikan} melaksanakan {zakat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan orang-orang yang menunaikan zakat,” melaksanakan pembayaran zakat harta mereka, sesuai jenis harta mereka, guna menyucikan jiwa-jiwa mereka dari noda-noda yang berasal dari tingkah laku dan keburukan-keburukan amal perbuatan, yang jiwa seseorang akan menjadi bersih dengan meninggalkan dan menjauhinya. Maka, perbaikilah ibadah kalian kepada pencipta kalian dengan khusu’ di dalam shalat, dan berbuat baiklah kepada para hambaNya dengan menunaikan zakat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 4: Mereka berbuat ihsan dalam beribadah kepada Allah, yaitu dengan berbuat khusyu’ dan berbuat ihsan kepada manusia dengan membayar zakat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 4",
    "description": "Dan orang yang juga akan beruntung dan berbahagia adalah orang yang menunaikan zakat secara sempurna dan tulus ikhlas. 5-7. Dan selain orang-orang yang disebut pada ayat-ayat sebelumnya, berbahagialah orang yang memelihara kemaluannya dan tidak menya-lurkan kebutuhan biologisnya melalui hal dan cara yang tidak dibe-narkan, kecuali terbatas dalam melakukannya terhadap pasangan-pasangan mereka atau hamba sahaya yang mereka miliki; maka sesungguhnya mereka dalam menyalurkan kebutuhan biologis terhadap pasangan dan budak mereka itu tidak tercela, selama mereka tidak melanggar ketentuan yang ditetapkan oleh agama. Tetapi, barang siapa mencari pelampiasan hawa nafsu di balik itu, di antaranya dengan berbuat zina, maka mereka itulah orang-orang yang melampaui batas ajaran agama dan moral, sehingga pantas menerima celaan atau siksa."
  }
]