[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah berfirman untuk mengabulkan permohonannya, “Sebentar lagi, mereka benar-benar akan menjadi orang-orang yang menyesal.” Artinya, tidak berapa lama lagi, orang-orang yang mendustakan akan penuh penyesalan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Allah pun mengabulkannya dengan berfirman, \"Beberapa saat lagi orang-orang yang mendustakan apa yang engkau bawa itu akan menyesali perbuatan dusta mereka.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. قَالَ عَمَّا قَلِيلٍ (Allah berfirman: “Dalam sedikit waktu lagi) Yakni sebentar lagi. لَّيُصْبِحُنَّ نٰدِمِينَ (pasti mereka akan menjadi orang-orang yang menyesal”) Atas pendustaan, kedurhakaan, dan kebebalan mereka di atas kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Allah berfirman: \"Sebentar lagi pasti mereka akan menjadi orang-orang yang menyesal atas kekufuran dan pendustaan mereka ketika azab telah menimpa mereka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman,“Sebentar lagi} sebentar lagi {mereka benar-benar akan menyesal”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41 Allah berfirman untuk mengabulkan doanya, ”dalam sedikit waktu lagi, pasti mereka akan menjadi orang-orang yang menyesal. Maka dimusnahkanlah mereka oleh suara yang mengguntur dengan (dasar) hak,” bukan atas dasar aniaya dan kecurangan (dari Allah). Akan tetapi, berdasarkan keadilan dan ulah kezhaliman mereka. Suara yang mengguntur memusnahkan mereka dan membinasakan mereka sampai tuntas. “dan kami jadikan mereka (sebagai) sampah banjir,” yaitu rumput yang kering ibarat buih di lautan yang terlempar kecelah-celah lembah. “maka kebinasaanlah bagi orang-orang yang zhalim itu,” maksudnya selain siksaan yang menimpa mereka, maka disertai pula dengan pengusiran dan kutukan serta celaan dari makhluk semesta alam. \"Maka langit dan bumi tidak menangisi mereka dan mereka pun tidak diberi tangguh.\" (QS. Ad-Dukhon : 29)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 40: Terhadap kekafiran dan pendustaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 40",
    "description": "40-41. Allah mengabulkan doa nabi hud. Dia berfirman, 'bersabarlah, wahai nabi hud. Tidak lama lagi mereka pasti akan menyesal. ' lalu setelah tiba waktunya, mereka benar-benar dimusnahkan oleh suara yang mengguntur. Mereka pantas mendapat azab itu sehingga kedatangan azab itu hak adanya. Dan kami jadikan mereka seperti sampah yang dibawa banjir akibat kezaliman mereka sendiri. Maka, binasalah bagi orang-orang yang zalim"
  }
]