[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak menunggu lama, datang lah kepada mereka suara menggelegar dahsyat yang disertai angin, yang dengannya Allah membinasakan mereka. Mereka pun mati semuanya, dan menjelma layaknya buih-buih air yang mengambang di permukaan air. Maka kebinasaanlah bagi orang-orang yang berbuat zhalim itu, dan mereka jauh dari rahmat Allah. Karenanya, hendaknya orang-orang yang mendengar (berita itu) waspada dari mendustakan Rasul mereka, akibatnya akan menimpa mereka siksaan yang menimpa orang-orang yang mendahului mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Maka mereka pun di azab dengan suara yang mengguntur lagi membinasakan karena mereka berhak mendapatkan itu lantaran kedurhakaan dan pembangkangan mereka. Lalu Kami jadikan mereka hancur seperti buih yang dibawa banjir, maka sungguh binasalah kaum yang zalim itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. فَأَخَذَتْهُمُ الصَّيْحَةُ (Maka dimusnahkanlah mereka oleh suara yang mengguntur) Yakni malaikat Jibril berteriak kepada mereka dengan sekali teriakan yang disertai angin kencang, sehingga mereka semua binasa. فَجَعَلْنٰهُمْ غُثَآءً ۚ (dan Kami jadikan mereka seperti buih-buih) Yakni buih yang tampak dipermukaan air yang terbawa oleh arus air. Allah menjadikan mereka binasa sehingga mereka menjadi kering seperti buih yang mengering. فَبُعْدًا لِّلْقَوْمِ الظّٰلِمِينَ (maka kebinasaanlah bagi orang-orang yang zalim itu) Yakni kebinasaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Maka mereka dimusnahkan oleh suara yang mengguntur dengan sangat keras dan membinasakan. Itu adalah azab yang pantas mereka terima atas kekufuran mereka. Kami jadikan mereka sebagai sampah banjir, maka kebinasaanlah bagi orang-orang yang kafir dan pendusta itu, serta akan dijauhkan dari rahmat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka dimusnahkan oleh suara yang menggelegar} suara yang dahsyat lagi membinasakan {dengan sebenarnya dan Kami menjadikan mereka sampah banjir} mati bergelimpangan lagi binasa seperti sampah yang hanyut terapung di atas air {Maka kebinasaanlah} maka celakalah {bagi kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41 Allah berfirman untuk mengabulkan doanya, ”dalam sedikit waktu lagi, pasti mereka akan menjadi orang-orang yang menyesal. Maka dimusnahkanlah mereka oleh suara yang mengguntur dengan (dasar) hak,” bukan atas dasar aniaya dan kecurangan (dari Allah). Akan tetapi, berdasarkan keadilan dan ulah kezhaliman mereka. Suara yang mengguntur memusnahkan mereka dan membinasakan mereka sampai tuntas. “dan kami jadikan mereka (sebagai) sampah banjir,” yaitu rumput yang kering ibarat buih di lautan yang terlempar kecelah-celah lembah. “maka kebinasaanlah bagi orang-orang yang zhalim itu,” maksudnya selain siksaan yang menimpa mereka, maka disertai pula dengan pengusiran dan kutukan serta celaan dari makhluk semesta alam. \"Maka langit dan bumi tidak menangisi mereka dan mereka pun tidak diberi tangguh.\" (QS. Ad-Dukhon : 29)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 41: Menurut Ibnu Katsir, zhahirnya bahwa mereka ditimpa suara yang mengguntur dengan angin topan yang sangat dingin yang menghancurkan segala sesuatu dengan perintah Tuhannya. Maksudnya, tidak dengan kezaliman, bahkan dengan keadilan. Maksudnya, demikian buruknya akibat mereka, sampai mereka tidak berdaya sedikit pun, tidak ubahnya seperti sampah yang dihanyutkan banjir, padahal tadinya mereka bertubuh besar-besar dan kuat-kuat. Ada pula yang menafsirkan “ghutsaa’” dengan tumbuhan yang kering karena sudah mati. Di samping azab menimpa mereka, mereka diikuti pula oleh laknat dan celaan dari alam semesta. Oleh karena itulah, langit dan bumi tidak menangis terhadap kematian mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 41",
    "description": "40-41. Allah mengabulkan doa nabi hud. Dia berfirman, 'bersabarlah, wahai nabi hud. Tidak lama lagi mereka pasti akan menyesal. ' lalu setelah tiba waktunya, mereka benar-benar dimusnahkan oleh suara yang mengguntur. Mereka pantas mendapat azab itu sehingga kedatangan azab itu hak adanya. Dan kami jadikan mereka seperti sampah yang dibawa banjir akibat kezaliman mereka sendiri. Maka, binasalah bagi orang-orang yang zalim. 42. Habis sudah para pendurhaka dari kaum nabi hud. Kemudian kami ciptakan lagi sesudah mereka yang binasa itu umat-umat yang lain, di antaranya kaum nabi salih, lut, dan syu'aib."
  }
]