[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami adakan setelah orang-orang yang mendustakan itu umat-umat dan manusia-manusia lain, seperti kaum Luth, kaum Syu’aib, kaum Ayyub, dan kaum Yunus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Kemudian setelah mereka binasa, Kami ciptakan kaum dan umat-umat yang lain seperti kaum Lūṭ, Syu'aib dan Yunus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. ثُمَّ أَنشَأْنَا مِنۢ بَعْدِهِمْ (Kemudian Kami ciptakan sesudah mereka) Yakni sesudah kebinasaan mereka. قُرُونًا ءَاخَرِينَ(umat-umat yang lain) Terdapat pendapat mengatakan yang dimaksud adalah kaum Nabi Shalih, Luth, dan Syuaib. Pendapat lain mengatakan mereka adalah Bani Israil. Dan ada juga kemungkinan mereka adalah kaum yang belum dikisahkan Allah kepada kita, sebagaimana firman Allah dalam surat Ibrahim ayat 9 setelah Allah menyebutkan dalam ayat tersebut kaum Nabi Nuh, ‘Aad, dan Tsamud kemudian Allah berfirman: “dan orang-orang sesudah mereka, tidak ada yang mengetahui mereka selain Allah”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Kemudian sesudah mereka binasa, Kami ciptakan umat-umat yang lain. Mereka adalah kaum nabi Shalih, nabi Luth, dan nabi Syu’aib dan lain-lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami menciptakan setelah mereka umat-umat} kaum-kaum {yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42-43 Maksudnya, kemudian setelah (kehancuran) orang-orang yang mendustakan lagi menentang, Allah menciptakan “umat-umat yang lain,” setiap umat berada dimasa yang sudah ditentukan dan jangka waktu yang dibatasi, tidak maju maupun mundur darinya. Kami mengirimkan rasul secara bergantian, dengan harapan mereka mau beriman dan bertaubat. Namun, kekufuran dan pendustaan menjadi budaya umat-umat yang durhaka, ingkar lagi melampaui batas. “setiap kali seorang rasul datang kepada umatnya, umat itu mendustakannya,” padahal setiap rasul itu membawa sejumlah ayat (bukti-bukti kebesarn Allah) yang bisa membuat orang-orang menjadi beriman dengan bukti semacam itu. Bahkan dakwah para rasul dan aturan syariat agama mereka saja sudah cukup menunjukkan kebenaran risalah yang mereka bawa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 42: Maksudnya, kaum Nabi saleh, kaum Nabi Luth, dan kaum Nabi Syu'aib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 42",
    "description": "Habis sudah para pendurhaka dari kaum nabi hud. Kemudian kami ciptakan lagi sesudah mereka yang binasa itu umat-umat yang lain, di antaranya kaum nabi salih, lut, dan syu'aib. 43. Allah memberi batas waktu bagi kehidupan, kematian, atau kebinasaan umat para nabi tersebut. Tidak ada satu umat pun yang dapat menyegerakan atau mendahuli ajalnya, yaitu batas waktu kematian atau kebinasaan yang telah Allah tetapkan berdasar sunatullah yang berlaku umum, dan tidak dapat pula mereka menangguhkannya."
  }
]