[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah akan mendahului Suatu umat dari umat-umat yang mendustakan itu waktu yang telah ditentukan bagi kehancurannya, dan tidak akan mundur darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Tidak ada di antara umat-umat yang mendustakan tersebut yang bisa menyegerakan waktu kedatangan azab yang telah ditentukan untuk mereka, dan mereka tidak dapat pula menangguhkannya, meskipun dengan melakukan berbagai usaha."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Setiap kaum yang zalim telah Allah tetapkan waktu kehancurannya, waktu itu tidak akan dapat diakhirkan atau dipercepat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. مَا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَـْٔخِرُونَ (Tidak (dapat) sesuatu umatpun mendahului ajalnya, dan tidak (dapat pula) mereka terlambat) Yakni setiap umat tidak akan binasa sebelum ajal yang telah tertulis baginya dan tidak pula melewati ajalnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Tidak ada satu umatpun yang bisa mendahului ataupun menunda ajal kehancurannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada satu umat pun yang dapat menyegerakan} yang menyegerakan {ajalnya} waktu kehancuran mereka yang telah ditentukan {dan tidak pula menangguhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42-43 Maksudnya, kemudian setelah (kehancuran) orang-orang yang mendustakan lagi menentang, Allah menciptakan “umat-umat yang lain,” setiap umat berada dimasa yang sudah ditentukan dan jangka waktu yang dibatasi, tidak maju maupun mundur darinya. Kami mengirimkan rasul secara bergantian, dengan harapan mereka mau beriman dan bertaubat. Namun, kekufuran dan pendustaan menjadi budaya umat-umat yang durhaka, ingkar lagi melampaui batas. “setiap kali seorang rasul datang kepada umatnya, umat itu mendustakannya,” padahal setiap rasul itu membawa sejumlah ayat (bukti-bukti kebesarn Allah) yang bisa membuat orang-orang menjadi beriman dengan bukti semacam itu. Bahkan dakwah para rasul dan aturan syariat agama mereka saja sudah cukup menunjukkan kebenaran risalah yang mereka bawa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 43: Dengan binasa terlebih dahulu sebelum ajalnya tiba. Masing-masing umat telah ditetapkan ajalnya, tidak maju dan tidak mundur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 43",
    "description": "Allah memberi batas waktu bagi kehidupan, kematian, atau kebinasaan umat para nabi tersebut. Tidak ada satu umat pun yang dapat menyegerakan atau mendahuli ajalnya, yaitu batas waktu kematian atau kebinasaan yang telah Allah tetapkan berdasar sunatullah yang berlaku umum, dan tidak dapat pula mereka menangguhkannya. 44. Kemudian, kami utus kepada kaum-kaum itu rasul-rasul kami secara berturut-turut. Setiap kali seorang rasul datang kepada suatu umat untuk mengajak mereka menghamba dan bertauhid kepada Allah, mereka mendustakannya, maka kami silihgantikan sebagian mereka dengan sebagian yang lain, yakni kami musnahkan mereka secara silih berganti. Dan kami jadikan mereka bahan cerita bagi kaum sesudahnya. Maka, kebinasaanlah bagi kaum yang tidak beriman kepada risalah para rasul."
  }
]