[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami utus rasul-rasul Kami kepada umat-umat tersebut, sebagian menggantikan sebagian yang lain secara berturut-turut. Setiapkali seorang rasul datang menyeru kepada umatnya, lalu mereka mendustakannnya, Kami timpakan kebinasaan dan kehancuran pada mereka itu secara bergantian, dan tidak ada yang tersisa selain berita-berita tentang kebinasaan mereka saja. Dan Kami menjadikan mereka sebagai bahan buah bibir bagi orang-orang setelah mereka untuk mereka jadikan sebagai pelajaran. Maka kebinasaan dan kutukan bagi orang-orang yang tidak beriman kepada rasul-rasul dan tidak menaati mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Kemudian Kami utus para rasul Kami secara berturut-turut. Setiap kali rasul mendatangi salah satu di antara umat-umat itu, mereka mendustakannya. Maka Kami hancurkan mereka silih berganti sehingga sampai binasa dan mereka hanya tinggal menjadi bahan cerita bagi manusia. Maka sungguh kebinasaan lah bagi kaum yang tidak beriman pada ajaran yang dibawa oleh para rasul dari sisi Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Kemudian Kami mengutus para rasul kepada umat-umat dengan silih berganti, dan Kami juga binasakan mereka dengan silih berganti, dan Kami menjadikan mereka kisah yang diceritakan turun temurun untuk dijadikan sebagai pelajaran. Sungguh mereka jauh dari rahmat Allah. Dan kehancuran bagi kaum yang tidak mengimani dakwah para rasul mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. ثُمَّ أَرْسَلْنَا رُسُلَنَا تَتْرَا ۖ (Kemudian Kami utus (kepada umat-umat itu) rasul-rasul Kami berturut-turut) Yakni para rasul datang kepada umat-umat itu satu persatu, sebagian Rasul akan diikuti dengan sebagian lainnya. فَأَتْبَعْنَا بَعْضَهُم بَعْضًا (maka Kami perikutkan sebagian mereka dengan sebagian yang lain) Yakni dalam hal azab yang diturunkan kepada mereka. وَجَعَلْنٰهُمْ أَحَادِيثَ ۚ( Dan Kami jadikan mereka buah tutur) Yakni sebagai bahan pembicaraan manusia; tidak ada yang tersisa dari mereka kecuali cerita-cerita tentang mereka. فَبُعْدًا لِّقَوْمٍ لَّا يُؤْمِنُونَ(maka kebinasaanlah bagi orang-orang yang tidak beriman) Yakni kebinasaan bagi mereka yang tak akan berhenti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Kemudian Kami utus rasul-rasul Kami kepada setiap umat yang ada itu berturut-turut. Tiap-tiap rasul datang kepada umat itu, mereka selalu mendustakannya. Maka Kami ikutkan sebagian mereka dengan sebagian yang lain dalam kehancuran. Kami jadikan mereka buah bibir manusia sebagai pembelajaran. Yaitu pembelajaran tentang keanehan mereka, sehingga mereka jauh dari rahmat Allah. Maka kebinasaanlah bagi orang-orang yang tidak beriman kepada risalah para rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami mengutus rasul-rasul Kami secara berturut-turut} secara berturut-turut satu per satu {Setiap kali datang kepada suatu umat rasulnya, maka mereka mendustakannya. Maka Kami ikutkan sebagian mereka dengan sebagian yang lain} Lalu Kami membinasakan umat-umat itu sebagian sebagai jejak untuk sebagian lain {Kami menjadikan mereka bahan pembicaraan} berita dan kisah orang setelah mereka {Maka kebinasaanlah bagi kaum yang tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44 “maka kami memperikutkan sebagian mereka dengan yang lain,” dengan kemusnahan, hingga tidak ada satupun yang tersisa. Rumah-rumah hunian mereka pun tidak berfungsi lagi setelah itu. “Dan kami jadikan mereka buah tutur (manusia).” Orang-orang sesudah mereka membicarakan tentang mereka. Dan mereka menjadi bahan pelajaran bagi orang-orang yang bertakwa dan siksa bagi orang-orang yang mendustakan, serta penghinaan bagi mereka yang disertai dengan siksaan terhadap mereka “maka kebinasaanlah bagi orang-orang yang tidak beriman.” Alangkah celakanya mereka! Kesengsaraan bagi mereka! Betapa ruginya usaha mereka!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 44: Agar mereka beriman dan kembali kepada Allah. Padahal rasul-rasul tersebut datang dengan membawa mukjizat yang semisalnya biasanya diimani manusia, meskipun seruan rasul dan ajaran mereka sesungguhnya sudah cukup menunjukkan kebenaran yang mereka bawa. Maksudnya, oleh karena masing-masing umat itu mendustakan Rasul-Nya, maka Allah membinasakan mereka dengan berturut-turut. Mereka menjadi buah bibir dan pelajaran generasi setelahnya sebagai hukuman bagi orang-orang yang mendustakan. Yakni alangkah celaka dan ruginya mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 44",
    "description": "Kemudian, kami utus kepada kaum-kaum itu rasul-rasul kami secara berturut-turut. Setiap kali seorang rasul datang kepada suatu umat untuk mengajak mereka menghamba dan bertauhid kepada Allah, mereka mendustakannya, maka kami silihgantikan sebagian mereka dengan sebagian yang lain, yakni kami musnahkan mereka secara silih berganti. Dan kami jadikan mereka bahan cerita bagi kaum sesudahnya. Maka, kebinasaanlah bagi kaum yang tidak beriman kepada risalah para rasul. 45-46. Generasi demi generasi telah dibinasakan akibat kedurhakaan mereka, kemudian setelah itu kami utus nabi musa dan saudaranya, harun, dengan membawa tanda-tanda kebesaran kami dan bukti yang nyata berupa argumentasi kebenaran yang tidak terbantahkan. Mereka membawanya kepada fir'aun dan para pemuka kaum-Nya, tetapi tanpa berpikir panjang mereka angkuh sehingga enggan menyambut ajakan kedua rasul tersebut, dan mereka sejak dahulu memang kaum yang sombong, melecehkan kebenaran, dan memandang rendah orang lain."
  }
]