[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-46. Kemudian Kami utus Musa dan saudara lelakinya, Harun dengan membawa ayat-ayat (mukjizat-mukjizat) Kami yang berjumlah Sembilan: tongkat, tangan (yang bercahaya), belalang, kutu, katak, darah, banjir bandang, musim kemarau yang amat panjang dan kekurangan buah-buahan, sebagai hujjah nyata yang melunakkan hati, sehingga hati kaum Mukminin tunduk patuh kepadanya,dan hujjah menjadi jelas tegak di hadapan orang-orang penentang. Kami mengutus mereka berdua kepada Fir’aun, sang penguasa Mesir dan para pemuka kaumnya. Lalu mereka menyombongkan diri untuk beriman kepada Musa dan saudaranya. Dan mereka adalah kaum yang congkak terhadap manusia, lagi menindas mereka dengan tindak kezhaliman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Kemudian Kami utus Musa dan sudaranya Harun dengan sembilan mukjizat: (tongkat, tangan, belalang, kutu, katak, darah, angin topan, tahun-tahun yang kering, dan kekurangan buah-buahan), dan juga dengan bukti yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Kemudian Kami mengutus Musa dan Harun dengan membawa sembilan mukjizat dan hujjah yang jelas kepada Fi’aun dan para pengikutnya yang hidup dalam kemewahan. Namun mereka enggan beriman kepada Musa dan Harun, mereka adalah kaum yang selalu menindas orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. بِـَٔايٰتِنَا (dengan membawa tanda-tanda (Kebesaran) Kami) Yakni sembilan mukjizat yang telah disebutkan sebelumnya beberapa kali. Makna (السلطان المبين) adalah hujjah yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Kemudian Kami utus Musa dan saudaranya Harun dengan membawa sembilan mukjizat yang disebutkan dalam surat Al a’raf ayat 133. Yaitu belalang, darah (air minum berubah menjadi darah), kekurangan buah, topan, kutu, katak, menghilangkan harta, memurnikan hati sebagai tanda-tanda kebesaran Kami. Kami kirimkan juga kepada mereka bukti yang jelas dan nyata sebagai bukti keesaan Allah. Assulthan adalah sifat bagi bukti-bukti yang ditunjukkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami mengutus Musa dan saudaranya, Harun, dengan membawa ayat-ayat Kami dan bukti yang nyata} bukti yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45 FirmanNya, “kemudian kami utus Musa” putra Imran, Kalimurrahman, “dan saudaranya harun” ketika beliau memohon kepada Allah agar mengikut sertakan saudaranya itu (harun) dalam misinya. Allah menyambut permohonannya ini, ”dengan membawa tanda-tanda kebesaran kami” yang menunjukan kebenaran mereka berdua dan (kebenaran) risalah yang mereka emban, “dan bukti yang nyata,” maksudnya hujjah yang nyata, lantaran besarnya kekuatan yang mampu memaksa hati-hati dan menguasainya karena kekuatannya. Maka, hati-hati kaum Mukminin pun menjadi tunduk dan tegaklah hujjah di hadapan orang-orang yang melakukan penentangan. “Dan sungguh kami telah memberikan kepada Musa Sembilan buah ayat yang nyata,” Oleh karena itu, pimpinan para penentang telah mengetahui kebenaran namun tetap berkeras kepala menentang. “maka tanyakanlah kepada bani israil, tatkala Musa datang kepada mereka,” dengan membawa ayat-ayat yang nyata tersebut. Maka [fir’aun] berkata kepada beliau, “ sesungguhnya aku menyangkamu, hai Musa, seorang yang terkenal sihir.” Lalu Musa menyanggah,” Sungguh kamu telah mengetahui, bahwa tidaklah yang menurunkan mukjizat-mukjizat itu kecuali Rabb yang memelihara langit dan bumi sebagai bukti-bukti nyata, dan sesungguhnya aku mengiramu, hai Fir’aun, seorang yang akan binasa,” Allah juga berfirman, ”Dan mereka mengingkarinya karena kezhaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 45: Sebagian ulama menjelaskan, bahwa setelah diutus-Nya Musa dan diturunkan Taurat, Allah mengangkat azab terhadap umat-umat, yakni azab dalam arti membinasaan sehabis-habisnya, dan Allah mensyariatkan jihad terhadap orang-orang yang mendustakan. Syaikh As Sa’diy berkata, “Namun saya tidak mengetahui dari mana perkataan ini diambil? Tetapi setelah saya mentadabburi beberapa ayat ini dengan beberapa ayat yang disebutkan dalam surah Al Qashas, maka nampaklah bagiku alasannya. Adapun dalam beberapa ayat ini, Allah telah menyebutkan umat-umat yang dibinasakan secara berturut-turut. Setelah itu, Dia memberitahukan bahwa setelah mereka, Dia mengutus Musa, dan menurunkan kitab Taurat kepadanya sebagai petunjuk bagi manusia, dan hal ini tidaklah bertentangan dengan dibinasakannya Fir’aun, karena kebinasaannya sebelum turun Taurat. Adapun dalam beberapa ayat di surah Al Qashas, maka jelas sekali di sana, bahwa setelah disebutkan kebinasaan Fir’aun, Dia berfirman, “Dan sesungguhnya telah Kami berikan kepada Musa Al-Kitab (Taurat) setelah Kami binasakan generasi-generasi yang terdahulu, untuk menjadi pelita bagi manusia, petunjuk dan rahmat, agar mereka ingat.” (Terj. Al Qashash: 43) Ayat ini jelas, bahwa Allah memberikan kitab Taurat kepada Musa setelah binasanya uamt-umat yang melampaui batas, dan Allah memberitahukan bahwa Dia menurunkan kitab itu sebagai pelita bagi manusia, petunjuk dan rahmat…dst.” Ketika Musa meminta kepada Tuhannya agar Dia mengikutsertakan Harun dalam tugasnya. Yang dimaksud tanda-tanda kebesaran Allah dan bukti yang nyata dalam ayat ini ialah mukjizat Nabi Musa yang sembilan buah. Mukjizat yang sembilan itu ialah: tongkat, tangan, belalang, kutu, katak, darah, taupan (banjir besar), laut, dan bukit Thur. Ada pula yang menafsirkan “tanda-tanda (kebesaran) Kami” maksudnya yang menunjukkan kebenaran keduanya (Musa dan Harun) dan apa yang mereka berdua bawa. Sedangkan maksud “bukti yang nyata” adalah hujjah yang jelas, di mana karena jelasnya dapat menundukkan hati dan menjadi hujjah bagi orang-orang yang keras kepala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 45",
    "description": "45-46. Generasi demi generasi telah dibinasakan akibat kedurhakaan mereka, kemudian setelah itu kami utus nabi musa dan saudaranya, harun, dengan membawa tanda-tanda kebesaran kami dan bukti yang nyata berupa argumentasi kebenaran yang tidak terbantahkan. Mereka membawanya kepada fir'aun dan para pemuka kaum-Nya, tetapi tanpa berpikir panjang mereka angkuh sehingga enggan menyambut ajakan kedua rasul tersebut, dan mereka sejak dahulu memang kaum yang sombong, melecehkan kebenaran, dan memandang rendah orang lain"
  }
]