[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-46. Kemudian Kami utus Musa dan saudara lelakinya, Harun dengan membawa ayat-ayat (mukjizat-mukjizat) Kami yang berjumlah Sembilan: tongkat, tangan (yang bercahaya), belalang, kutu, katak, darah, banjir bandang, musim kemarau yang amat panjang dan kekurangan buah-buahan, sebagai hujjah nyata yang melunakkan hati, sehingga hati kaum Mukminin tunduk patuh kepadanya,dan hujjah menjadi jelas tegak di hadapan orang-orang penentang. Kami mengutus mereka berdua kepada Fir’aun, sang penguasa Mesir dan para pemuka kaumnya. Lalu mereka menyombongkan diri untuk beriman kepada Musa dan saudaranya. Dan mereka adalah kaum yang congkak terhadap manusia, lagi menindas mereka dengan tindak kezhaliman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan Kami mengutus mereka berdua kepada Fir'aun dan para pemuka kaumnya, namun mereka menyombongkan diri dan tidak mau beriman kepada keduanya. Sungguh mereka benar-benar kaum yang angkuh terhadap manusia dengan kekuasaan dan kezaliman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. إِلَىٰ فِرْعَوْنَ وَمَلَإِي۟هِۦ (kepada Fir’aun dan pembesar-pembesar kaumnya) Yakni para pemuka kaumnya. فَاسْتَكْبَرُوا۟ (maka mereka ini takabbur) Yakni serasa sombong sehingga tidak mau menerima kebenaran. وَكَانُوا۟ قَوْمًا عَالِينَ(dan mereka adalah orang-orang yang sombong) Yakni orang-orang yang menindas manusia dengan kezaliman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Kami utus keduanya kepada Fir´aun dan pembesar-pembesar kaumnya. Namun mereka menyombongkan diri dan tidak beriman. Mereka adalah kaum yang sombong dan zalim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kepada Fir‘aun dan para pemuka kaumnya. Lalu mereka angkuh dan mereka adalah kaum yang sombong} merasa sombong di atas manusia dengan berbuat dengki dan zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46 Disini, Allah berfirman, ”Kemudian kami utus Musa dan saudaranya Harun, dengan membawa tanda-tanda (kebesaran) kami, dan bukti yang nyata kepada fir’aun dan pembesar-pembesar kaumnya,” seperti sosok Haman dan tokoh lainnya yang berasal dari pembesar-pembesar mereka. “maka mereka ini takabur,” maksudnya mereka bersikap sombong untuk beriman kepada Allah dan congkak terhadap para nabiNya.” Dan mereka adalah orang-orang yang sombong,” maksudnya, adalah karakter mereka merasa lebih tinggi, sok berkuasa dan suka melakukan kerusakan di muka bumi. Oleh sebab itu, meluncur sikap kesombongan dari mereka, dan itu tidak aneh terjadi dari mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 46: Seperti Haman dan para memuka lainnya. Tidak mau beriman kepada ayat-ayat dan bukti yang nyata itu. Bisa juga diartikan, “dan memang mereka kaum yang berkuasa” yakni terhadap Bani Israil sehingga menindas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 46",
    "description": "45-46. Generasi demi generasi telah dibinasakan akibat kedurhakaan mereka, kemudian setelah itu kami utus nabi musa dan saudaranya, harun, dengan membawa tanda-tanda kebesaran kami dan bukti yang nyata berupa argumentasi kebenaran yang tidak terbantahkan. Mereka membawanya kepada fir'aun dan para pemuka kaum-Nya, tetapi tanpa berpikir panjang mereka angkuh sehingga enggan menyambut ajakan kedua rasul tersebut, dan mereka sejak dahulu memang kaum yang sombong, melecehkan kebenaran, dan memandang rendah orang lain. 47. Maka dengan angkuh mereka berkata, 'apakah pantas kita percaya kepada Allah yang maha esa dengan membenarkan ucapan dua orang manusia seperti kita, padahal kaum mereka, yaitu bani israil, adalah orang-orang yang menghambakan diri secara hina kepada kita, orang mesir' sungguh tidak pantas!'."
  }
]