[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, “Apakah kita pantas mempercayai dua orang yang sama (manusia) seperti kita, sedang kaumnya, yaitu Bani Israil, berada di bawah kekuasaan kita, taat lagi tunduk kepada kita?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Mereka berkata, \"Apakah kita akan beriman kepada dua orang manusia seperti kita, yang tidak memiliki keistimewaan apa-apa dibanding kita, padahal kaum mereka berdua (Bani Israil) adalah kaum yang tunduk dan menghambakan diri kepada kita?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Fir’aun dan para pengikutnya berkata: “Apakah kita akan beriman kepada dua orang yang seperti kita, padahal kaum mereka yaitu Bani Israil telah tunduk kepada kita sebagai budak?!” Mereka mendustakan Musa dan Harun, sehingga itu menjadi sebab mereka ditenggelamkan di laut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. فَقَالُوٓا۟ أَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا (n mereka berkata: “Apakah (patut) kita percaya kepada dua orang manusia seperti kita) Yakni apakah kami harus percaya dengan omongan dua orang ini dan mengikutinya? وَقَوْمُهُمَا لَنَا عٰبِدُونَ (padahal kaum mereka (Bani Israil) adalah orang-orang yang menghambakan diri kepada kita) Fir’aun menjadikan Bani Israil sebagai budak-budak bagi orang-orang Mesir. Terdapat pendapat mengatakan, bisa jadi Fir’aun mengakatakan ini ketika ia mengaku sebagai Tuhan, dan menyeru Bani Israil untuk menyembahnya dan merekapun mentaatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Fir’aun dan kaumnya berkata: \"Apakah patut kita percaya kepada dua orang manusia biasa seperti kita juga. Bukankah mereka adalah kaum Bani Israil yang menghambakan diri mereka kepada kita?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Apakah kita percaya kepada dua orang manusia seperti kita, padahal kaum mereka adalah orang-orang yang mengabdikan diri”} taat dan tunduk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47 “dan mereka berkata,” dalam kesombongan lagi kecongkakan untuk memperingatkan orang-orang yang lemah akal sehatnya dan mengelabuhin mereka, apakah (patut) kita percaya pada dua orang manusia seperti kita (juga).” Komentar ini senada dengan orang-orang sebelum mereka, persis omongan dan ulah merekapun mengalami kemiripan. Mereka mengingkari anugerah Allah yang tercurahkan kepada mereka berdua berupa risalah (menjadi seorang rasul). “padahal kaum mereka berdua,” yaitu bani israil ”adalah orang yang menghambakan kepada diri kita,” diperbudak dengan kerja-kerja dan kesibukan yang berat. Bagaimana mungkin kami menjadi pengikut (mereka), padahal sebelumnya kami adalah pemimpin yang diikuti. Bagaimana mereka bisa menjadi orang yang memimpin kami? Perkataan mereka serupa dengan ucapan kaum nabi NUh, “apakah kami akan beriman kepadamu, padahal yang mengikuti kamu adalah orang-orang hina?” “dan kami tidak melihat orang-orang yang mengikutimu, melainkan orang-orang yang hina-dina dianatara kami yang lekas percaya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 47: Dengan sombong sambil memperingatkan kaumnya. Ucapan ini sama dengan ucapan generasi sebelumnya, hati mereka sama, maka ucapan dan perbuatan yang keluar pun sama. Mereka mengingkari nikmat risalah yang diberikan Allah kepada Musa dan Harun ‘alaihimas salam. Yakni taat dan tunduk serta diperbudak dengan kerja paksa. Maksudnya, bagaimana kita akan menjadi pengikut setelah sebelumnya kita sebagai pemimpin? Dan bagaimana mungkin mereka menjadi pemimpin? Ucapan mereka ini sama dengan ucapan kaum Nuh, “Apakah kami akan percaya kepada kamu, padahal yang mengikutimu adalah orang-orang yang rendah?” dsb. Jelas sekali, hal ini tidak bisa dipakai alasan untuk menolak yang hak, dan bahwa yang demikian merupakan pendustaan dan penentangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 47",
    "description": "Maka dengan angkuh mereka berkata, 'apakah pantas kita percaya kepada Allah yang maha esa dengan membenarkan ucapan dua orang manusia seperti kita, padahal kaum mereka, yaitu bani israil, adalah orang-orang yang menghambakan diri secara hina kepada kita, orang mesir' sungguh tidak pantas!'48. Maka mereka mendustakan keduanya, yaitu nabi musa dan harun, sehingga karenanya mereka termasuk orang yang dibinasakan dengan ditenggelamkan di laut merah."
  }
]