[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kami telah memberikan kitab Taurat kepada musa, supaya kaumnya mendapatkan petunjuk dengannya menuju kepada jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan sungguh Kami telah anugrahkan kepada Musa kitab Taurat, dengan harapan agar kaumnya mendapatkan petunjuk kepada kebenaran, dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Sungguh Kami telah memberi Musa kitab Taurat sebagai hidayah bagi Bani Israil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَلَقَدْ ءَاتَيْنَا مُوسَى الْكِتٰبَ (Dan sesungguhnya telah Kami berikan Al Kitab kepada Musa) Yakni kitab Taurat. لَعَلَّهُمْ يَهْتَدُونَ(agar mereka (Bani Israil) mendapat petunjuk) Yakni agar kaum Nabi Musa dapat menjadikannya petunjuk menuju kebenaran dan menjalankan syariat-syariat yang terkandung di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Sesungguhnya telah Kami berikan Kitab Taurat kepada Musa, agar mereka kaum Bani Israil mendapat petunjuk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan kitab} Taurat {kepada Musa agar mereka mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49 “Dan sesungguhnya telah kami berikan al-kitab (taurat) kepada Musa,” usai Allah membinasakan fir’aun dan menyelamatkan bangsa israil bersama Musa dan berhasil menegakkan perintah Allah dan menampakkan symbol-simbol (agama)Nya, Allah menyampaikan janji kepadanya untuk menurunkan Taurat kepadanya dalam jangka empat puluh malam, maka beliau pergi untuk menepati waktu pertemuan dengan Rabbnya. “dan telah kami tuliskan untuk Musa pada kepingan-kepingan (untuk menulis Taurat) segala sesuatu, sebagai pelajaran dan penjelasan bagi segala sesuatu,” karena itu, disini Allah mengatakan “Agar mereka (bani israil) mendapat petunjuk,” dengan mengetahui rincian perintah-perintah dan larangan-larangan, pahala dan hukuman ndan mengenal Rabb mereka melalui nama-nama dan sifat-sifatNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 49: Setelah Allah membinasakan Fir’aun dan menyelamatkan Bani Israil bersama Musa, dan ketika itu perintah Allah dapat ditegakkan dan dapat ditampakkan syi’ar-syi'ar-Nya, maka Allah menjanjikan kepada Musa (memberikan Taurat) setelah berlalu waktu empat puluh malam. Musa kemudian pergi untuk bermunajat dengan Allah pada waktu yang telah ditentukan. Yakni agar mereka mengetahui secara rinci perintah dan larangan, pahala dan siksa, serta kenal dengan Tuhan mereka dengan nama dan sifat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 49",
    "description": "Usai menceritakan dakwah nabi musa kepada fir'aun, Allah lalu menyusulinya dengan paparan tentang dakwah nabi musa kepada bani israil. Dan sungguh, kami telah menganugerahkan kepada musa kitab taurat, agar mereka, yakni bani israil, mendapat petunjuk ke jalan yang benar dan sungguh-sungguh menjalankannya. 50. Dan telah kami jadikan dengan kuasa kami isa putra maryam bersama ibunya sebagai suatu bukti yang nyata bagi kekuasaan dan kebesaran kami, dan kami melindungi mereka dari berbagai keadaan yang meresahkan di sebuah dataran tinggi, tempat yang tenang, rindang, dan ba-Nyak buah-buahan untuk dimakan, dan di sana juga tersedia mata air yang mengalir untuk diminum."
  }
]