[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang menjaga kemaluan mereka dari perkara yang diharamkan oleh Allah, seperti perbuatan zina, homoseks, dan seluruh perbuatan keji lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan orang-orang yang memelihara kemaluannya dengan menjauhkan diri dari perbuatan zina, homoseksual, dan perbuatan keji lainnya. Mereka adalah orang-orang yang menjaga diri dari maksiat lagi suci."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-7. Dan orang-orang yang menjaga kemaluan mereka dari hal yang haram; kecuali terhadap istri dan budak wanita yang mereka miliki, maka mereka tidak berdosa untuk menggauli mereka. Dan barangsiapa yang menggaulli selain istri dan budak perempuannya maka mereka telah jauh dari kebenaran dan telah melanggar hukum Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حٰفِظُونَ (dan orang-orang yang menjaga kemaluannya) Yakni menahan diri dari apa yang tidak halal bagi mereka untuk menjaga kehormatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Serta orang-orang yang menjaga kemaluannya dari keharaman, dengan menjaga diri dari keharaman dan menahan diri dari perbuatan kemunkaran/keharaman. Alfarju aurat/kemaluan laki-laki dan perempuan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang menjaga kemaluannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dan orang-orang yang menjaga kemaluanya,” dari praktik pezinaan. Termasuk bagian kesempurnaan pemeliharaan kemaluan adalah menjauhi perkara-perkara yang menuntun kepada perzinaan. Misalnya, memandang dan menyentuh (yang bukan mahramnya) dan tindakan lain yang serupa. Maka, mereka telah memelihara kemaluan mereka dari setiap orang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 5: Dari yang haram, seperti zina, homoseksual, dsb. Menjaga kemaluan dapat menjadi sempurna ketika seseorang menjauhi semua yang dapat mendorong kepada zina, seperti memandang wanita, menyentuhnya, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 5",
    "description": "5-7. Dan selain orang-orang yang disebut pada ayat-ayat sebelumnya, berbahagialah orang yang memelihara kemaluannya dan tidak menya-lurkan kebutuhan biologisnya melalui hal dan cara yang tidak dibe-narkan, kecuali terbatas dalam melakukannya terhadap pasangan-pasangan mereka atau hamba sahaya yang mereka miliki; maka sesungguhnya mereka dalam menyalurkan kebutuhan biologis terhadap pasangan dan budak mereka itu tidak tercela, selama mereka tidak melanggar ketentuan yang ditetapkan oleh agama. Tetapi, barang siapa mencari pelampiasan hawa nafsu di balik itu, di antaranya dengan berbuat zina, maka mereka itulah orang-orang yang melampaui batas ajaran agama dan moral, sehingga pantas menerima celaan atau siksa"
  }
]