[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian Rasul, makanlah dari rizki halal lagi baik-baik dan kerjakanlah amal-amal shalih, sesungguhnya Aku maha Mengetahui apa yang kalian perbuat, tidak ada sesuatu pun dari perbuatan-perbuatan kalian yang tersembunyi bagiKu. Arah pembicaraan ayat ini bersifat umum bagi seluruh rasul dan para pengikut mereka. Pada ayat ini terkandung dalil bahwa memakan makanan halal menjadi faktor pendukung beramal shalih, dan sesungguhnya dampak dari makanan haram sangat buruk, di anataranya adalah tertolaknya doa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Wahai para Rasul! Makanlah dari makanan yang Aku halalkan lagi baik bagi kalian, dan kerjakanlah amal saleh yang sesuai ajaran syariat. Sesungguhnya Aku Maha Mengetahui setiap amalan kalian, dan tidak ada satu pun amal kalian yang tersembunyi dari-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Hai para rasul, makanlah berbagai jenis makanan yang halal dan baik, dan bersyukurlah kepada Allah dengan mengerjakan amal shalih; sungguh Aku Maha Mengetahui segala amal kebaikan yang kalian lakukan. Dan agama Islam adalah agama kalian, sedangkan Aku adalah Tuhan kalian, maka bertakwalah kepada-Ku dengan mematuhi perintah-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. يٰٓأَيُّهَا الرُّسُلُ كُلُوا۟ مِنَ الطَّيِّبٰتِ (Hai rasul-rasul, makanlah dari makanan yang baik-baik) Yakni Kami juga firmankan “Hai para Rasul” Makna (الطيبات) adalah makanan halal yang baik dan lezat. وَاعْمَلُوا۟ صٰلِحًا ۖ( dan kerjakanlah amal yang saleh) Yakni amal yang sesuai dengan syariat. إِنِّى بِمَا تَعْمَلُونَ عَلِيمٌ(Sesungguhnya Aku Maha Mengetahui apa yang kamu kerjakan) Amal-amal itu tidak ada yang terlewat dari-Ku dan Aku akan membalas kalian sesuai dengan amalan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sufyan tsauri pernah berwasiat kepada seseorang, beliau berkata: jauhilah oleh kamu banyak berangan-angan sehingga membuatmu berani dalam kemaksiatan, karena sesungguhnya Allah pun tidak ridho kepada nabi-Nya terjerumus dalam kemaksiatan, keharaman, dan kezhaliman, Allah berfirman: { يَٰٓأَيُّهَا ٱلرُّسُلُ كُلُوا۟ مِنَ ٱلطَّيِّبَٰتِ وَٱعْمَلُوا۟ صَٰلِحًا } \"Hai rasul-rasul, makanlah dari makanan yang baik-baik, dan kerjakanlah amal yang saleh\", dan Allah berwasiat kepada orang-orangberiman: { يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِن طَيِّبَٰتِ مَا كَسَبْتُمْ } \"Hai orang-orang yang beriman, nafkahkanlah (di jalan allah) sebagian dari hasil usahamu yang baik-baik\" [Al-Baqarah: 267], dan lebih umumnya lagi: { يَٰٓأَيُّهَا ٱلنَّاسُ كُلُوا۟ مِمَّا فِى ٱلْأَرْضِ حَلَٰلًا طَيِّبًا وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَٰنِ ۚ إِنَّهُۥ لَكُمْ عَدُوٌّ مُّبِينٌ } \"Hai sekalian manusia, makanlah yang halal lagi baik dari apa yang terdapat di bumi, dan janganlah kamu mengikuti langkah-langkah syaitan; karena sesungguhnya syaitan itu adalah musuh yang nyata bagimu\" [168]. 2 ). { يَٰٓأَيُّهَا ٱلرُّسُلُ كُلُوا۟ مِنَ ٱلطَّيِّبَٰتِ } Perintah Allah kepada para rasul untuk memakan makanan yang halal dan baik, dari ayat ini ada bantahan bagi mereka yang enggan mengikuti cara ini. 3 ). Perintah melakukan amalan yang shalih dan mengkonsumsi makanan yang baik ada bantahan bagi tiga macam manusia: - Orang yang nikmat dalam makanannya tapi lupa berssyukur, karena syukur adalah amalan yang diridhoi Allah. - Orang yang beramal tapi tidak ikhlas, yaitu mereka yang mencari-cari pandangan orng lain. - Orang yang melakukan kebaikan, tapi tidak diatas sunnah. 4 ). Perhatikan bagamana Allah menyandingkan antara perintah memakan makanan yang baik dan perintah beramal shalih. Makanan yang halal dan baik akan membantu seseorang dalam beramal shalih, sebagaimana makanan yang haram dan rusak akan memberatkan seorang hamba dalam beramal shalih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Kami katakan: Hai para rasul, makanlah makanan yang baik-baik, dan kerjakanlah amal yang saleh baik yang wajib maupun sunnah sesuai tuntunan syariat . Sesungguhnya Aku Maha Mengetahui apa yang kamu kerjakan, tidak ada yang dapat tersembunyi dari pengawasan-Ku."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai para rasul, makanlah dari yang baik-baik dan beramal shalihlah. Sesungguhnya Aku Maha Mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51 ini adalah perintah Allah yang ditunjukkan kepada para utusanNya, agar mereka mengkonsumsi sesuatu yang baik, yaitu rizki dan sesuatu yang baik lagi halal, (perintah untuk) bersyukur kepada Allah dengan mengamalkan amlan shalih yang akn memperbaiki hati, tubuh, dan dunia, serta akhirat. Dia memberitahukan kepada mereka, bahwa Dia Maha Mengetahui apa yang mereka kerjakan. Setiap amalan yang mereka perbuat dan usaha yang mereka tempuh, maka sesungguhnya Allah mengetahuinya, dan Dia akan memberikan balasan kepada mereka atas dasar amalan tersebut dengan balasan yang paling sempurna dan terbaik. Fakta ini menunjukkan bahwa para rasul, semuanya bersepakat mengenai halalnya barang-barang yang baik, yang berupa bermacam-macam makanan dan haramnya makanan-makanan yang keji. Mereka telah bersepakat mengenai amalan sholih, Waupun terjadi perbedaan pada beberapa jenis perintah dan aturan syariatnya. Semua itu merupakan amalan shalih, akan tetapi, mengalami perbedaan sesuai dengan perbedaan masa. Karena itu, amalan-amalan shalih yang baik pada setiap masa, telah disepakati oleh para nabi dan seluruh ajaran syariat-syariat. Misalnya, perintah untuk mengesakan Allah dan memurnikan ibadah untukNya, mencintaiNya, takut kepadaNya, berharap kepadaNya, beramal kebajikan, jujur, menepati janji, menyambung tali silaturahim, berbakti kepada orangtua, berbuat baik kepada sesama makhluk dan amalan-amalan shalih lainnya. Karena itu, para ulama dan pakar kitab-kitab terdahulu serta para cendekiawan ketika Allah mengutus Muhammad, mereka membuktikan kebenaran kenabian dan larangan yang ditetapkan. Sebagaimana yang terjadi pada Heraklius lainnya. Bila beliau memerintahkan perkara yang diperintahkan juga oleh para nabi yang telah berlalu sebelumnya, dan melarang apa yang mereka larang pula, maka ini menandakan bahwa beliau berasal dari kalangan mereka (para nabi). Berbeda dengan para pembohong (nabi palsu), maka dia mesti memerintahkan perkara buruk dan melarang kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 51: Ayat ini merupakan perintah dari Allah Ta’ala kepada para rasul-Nya untuk memakan makanan yang baik-baik, yakni rezeki yang baik lagi halal, dan bersyukur kepada Allah dengan beramal salrh, di mana dengannya hati dan badannya menjadi baik, demikian pula dunia dan akhiratnya. Dia juga memberitahukan, bahwa Dia mengetahui amal yang mereka kerjakan. Oleh karena itu, setiap amalan dan pekerjaan yang mereka kerjakan, maka Allah mengetahuinya serta akan memberikan balasan terhadapnya secara sempurna. Hal ini menunjukkan, bahwa mereka semua sepakat dalam membolehkan makanan yang baik-baik dan mengharamkan makanan yang buruk, dan bahwa mereka juga sepakat dalam mengerjakan amal saleh meskipun berbeda-beda syariatnya, namun semua itu adalah amal saleh. Oleh karena itulah, semua amal saleh yang tetap cocok di setiap zaman telah disepakati oleh para nabi dan semua syariat, seperti perintah mengesakan Allah, beribadah dengan ikhlas kepada-Nya, mencintai-Nya, takut kepada-Nya, berharap kepada-Nya, berbakti kepada orang tua, jujur, menepati janji, silaturrahim, berbuat baik kepada kaum dhu’afa, orang miskin dan anak yatim, bersikap sayang kepada semua manusia, dan perbuatan lainnya yang termasuk amal saleh. Dari sinilah, mengapa orang-orang yang yang berilmu melihat isi perintah dan larangannya untuk membuktikan kebenaran kenabian seseorang. Yang wajib maupun yang sunat. Oleh karenanya, Dia akan memberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 51",
    "description": "Usai menguraikan kisah para rasul, Allah lalu berbicara tentang para rasul secara umum. 'wahai para rasul! makanlah dari makanan yang baik-baik, dan kerjakanlah kebajikan sesuai dengan syariat, baik amalan wajib maupun sunah. Sungguh, aku maha mengetahui apa yang kamu kerjakan, karena tidak ada satu pun yang tersembunyi dari-ku. '52. Allah melanjutkan firman-Nya kepada para rasul, 'dan sungguh, agama tauhid yaitu islam, inilah agama kamu, agama yang satu; dan aku adalah tuhanmu, maka bertakwalah kepada-ku dengan melaksanakan perintah-ku dan menjauhi larangan-ku. '."
  }
]