[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya agama kalian (wahai sekalian nabi) adalah agama yang satu, yaitu Islam, dan Aku adalah Tuhan kalian, maka bertakwalah kepadaKu, dengan menjalankan perintah-perintahKu dan menjauhi larangan-laranganKu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan sungguh agama kalian -wahai para Rasul- adalah agama yang satu yaitu Islam, dan Aku lah Tuhan kalian, tidak ada tuhan lain bagi kalian yang berhak disembah selain-Ku, maka bertakwalah kepada-Ku dengan mengerjakan perintah dan menjauhi larangan-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَإِنَّ هٰذِهِۦٓ أُمَّتُكُمْ أُمَّةً وٰحِدَةً (Sesungguhnya (agama tauhid) ini, adalah agama kamu semua, agama yang satu) Yakni Hai para Rasul, sesungguhnya agama kalian adalah satu. Yaitu seruan seluruh nabi kepada peribadatan kepada Allah semata, maka berpegang teguhlah kalian diatasnya. فَاتَّقُونِ (maka bertakwalah kepada-Ku) Yakni janganlah kalian berbuat sesuatu yang menjadikan kalian Aku siksa, yaitu dengan menyekutukan diri-Ku dengan yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Sesungguhnya agama tauhid ini adalah agama dan syariat kamu semua, agama yang satu. Yaitu agama yang mengesakan Allah. Maka bertakwalah kepada-Ku dan takutlah akan azab-Ku jika kalian menyekutukan-Ku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ini adalah agama kalian} agama kalian wahai para nabi {agama yang satu} agama yang satu yaitu agama Islam {dan Akulah Tuhan kalian. Maka bertakwalah kepadaKu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52 oleh karena itu, Allah berfirman kepada para rasul,”sesungguhnya (agama tauhid) ini, adalah agama kamu semua,” yaitu (agama) kelompok kalian, wahai para rasul, yaitu “agama yang satu” yang sepakat bulat dalam satu agama dan Rabb yang satu. “maka bertakwalah kepadaKu,” dengan melaksanakan perintah-perintahKu dan menjauhi larangan-laranganKu. Sungguh, Allah telah memerintahkan kaum Mukminin dengan perintah yang telah ditunjukan kepada para rasul. Karena mereka mengikuti jalan para rasul dan menapaki jalan di belakang mereka. Allah berfirman ”Hai orang-orang yang beriman, makanlah diantara rizki yang baik-baik yang kami berikan kepadamu dan bersyukurlah kepada Allah, jika benar-benar hanya kepadaNya kamu menyembah.” Maka kewajiban orang-orang yang mengikuti jejak para nabi dan (orang-orang baik) lainnya, agar menaati dan mengamalkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 52: Yakni ketahuilah. Maksudnya, kamu semua harus berada di atasnya. Lihat surat Al Anbiya ayat 92. Yakni dengan melaksanakan perintah-Ku dan menjauhi larangan-Ku. Allah Subhaanahu wa Ta'aala juga memerintahkan kaum mumkin seperti yang diperintahkan-Nya kepada para rasul, karena mereka mengikuti dan berjalan di belakang para rasul. Allah Subhaanahu wa Ta'aala berfirman, “Wahai orang-orang yang beriman! Makanlah di antara rezki yang baik-baik yang Kami berikan kepadamu dan bersyukurlah kepada Allah, jika benar-benar kepada-Nya kamu menyembah.” (Terj. Al Baqarah: 172) oleh karena itu, bagi mereka yang mengaku mengikuti para nabi harus melakukan demikian, akan tetapi orang-orang yang zalim tidak menghendaki selain durhaka sebagaimana yang diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 52",
    "description": "Allah melanjutkan firman-Nya kepada para rasul, 'dan sungguh, agama tauhid yaitu islam, inilah agama kamu, agama yang satu; dan aku adalah tuhanmu, maka bertakwalah kepada-ku dengan melaksanakan perintah-ku dan menjauhi larangan-ku. '53. Kemudian setelah sekian lama mereka, yakni pengikut para rasul, menjadikan agama mereka terpecah belah menjadi beberapa golongan yang berbeda dan saling bermusuhan. Setiap golongan dari mereka bangga dengan apa yang ada pada golongan mereka sendiri. Demikianlah manusia, suka menonjolkan egonya."
  }
]