[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian para pemeluk agama bercerai-berai menjadi beberapa golongan dan beberapa sekte. Mereka menjadikan agama mereka (yang satu) dalam bentuk ideology-ideologi yang banyak, setelah sebelumnya diperintahkan untuk bersatu padu. Tiap-tiap golongan merasa bangga dengan pendapatnya, mereka menyangka bahwa kelompoknya berada di atas kebenaran, sedang kelompok lainnya berada di atas kebatilan. Di sini, terkandung peringatan dari bergolong-golongan dan berpecah belah dalam agama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Sepeninggal mereka, pengikut-pengikut mereka terpecah belah dalam urusan agama, sehingga menjadi bergolong-golongan dan berkelompok-kelompok. Setiap golongan merasa bangga bahwa ajaran kelompoknya lah yang paling diridai Allah, dan sama sekali tidak mau mengakui kebenaran kelompok lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53-54. Umat-umat terpecah belah dalam perkara agama mereka menjadi banyak golongan. Hai Rasulullah, maka biarkanlah orang-orang musyrik itu di dalam kesesatan mereka sampai datangnya waktu azab atau kematian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. فَتَقَطَّعُوٓا۟ أَمْرَهُم بَيْنَهُمْ زُبُرًا ۖ (Kemudian mereka (pengikut-pengikut rasul itu) menjadikan agama mereka terpecah belah menjadi beberapa pecahan) Yakni para pengikut Nabi-Nabi menjadikan agama mereka terpecah-pecah padahal agama itu satu, sehingga menjadi beberapa kelompok; sebagian mengikuti Taurat, dan sebagian mengikuti Zabur, dan sebagian lain mengikuti Injil. Serta pada setiap agama terpecah menjadi golongan-golongan, setiap golongan memiliki kitab yang khusus bagi mereka. كُلُّ حِزْبٍۭ بِمَا لَدَيْهِمْ فَرِحُونَ (-tiap golongan merasa bangga dengan apa yang ada pada sisi mereka) Padahal kewajiban mereka adalah mengikuti Nabi yang terakhir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Kemudian mereka para pengikut rasul itu menjadikan agama mereka terpecah belah menjadi beberapa golongan. Tiap-tiap golongan merasa bangga dengan keyakinan mereka masing-masing"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka terpecah belah dalam urusan di antara mereka} lalu para pemeluk agama itu terpisah dalam urusan agama mereka {menjadi beberapa golongan} menjadi beberapa kelompok dan golongan {Setiap golongan bangga dengan apa yang ada pada mereka} bangga dengan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53 Akan tetapi, orang-orang zhalim lagi para pecundang enggan menyambut kecuali berbuat pelanggaran saja. Karenanya, Allah berfirman, “kemudian mereka (pengikut-pengikut rasul itu) menjadikan agama mereka terpecah belah menjadi beberapa pecahan,” maksudnya terputuslah (ikatan) orang-orang yang mengaku pengikut para nabi. “urusan mereka,” yaitu urusan agama mereka ”terpecah belah menjadi beberapa pecahan pada mereka,” beberapa kelompok. “tiap-tiap golongan dengan apa yang ada pada sisi mereka (masing-masing),” yaitu dengan ilmu dan agama yang mereka miliki, ”merasa bangga” mereka menyangka diri mereka berada diatas rel kebenaran, sementara orang lain tidak berada digaris yang lurus. Padahal orang yang berada diatas kebenaran mereka, ialah orang-orang yang berjalan mengikuti para rasul, dengan cara memakan makanan yang baik-baik dan beramal shalih. Selain mereka, berada dalam kubangan kebatilan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 53: Seperti Yahudi, Nasrani, dan lain-lain. Berupa pengetahuan dan agama. Masing-masing mereka bangga dengannya, dan menyangka bahwa merekalah yang benar sedangkan selainnya salah, padahal yang benar di antara mereka adalah yang tetap di atas agama para rasul, yaitu Islam dan mengikuti jejak mereka, yaitu memakan yang baik-baik dan beramal saleh, selainnya adalah batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 53",
    "description": "Kemudian setelah sekian lama mereka, yakni pengikut para rasul, menjadikan agama mereka terpecah belah menjadi beberapa golongan yang berbeda dan saling bermusuhan. Setiap golongan dari mereka bangga dengan apa yang ada pada golongan mereka sendiri. Demikianlah manusia, suka menonjolkan egonya. 54. Maka atas perpecahan mereka dan pembangkangan mereka terhadap dakwah dan peringatan kamu, wahai para rasul, biarkanlah mereka dalam kesesatannya sampai waktu yang ditentukan, yaitu saat kemusnah-an mereka atau jatuhnya siksa neraka atas mereka."
  }
]