[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "55-56. Apakah orang-orang kafir itu menyangka bahwa sesungguhnya Kami melimpahkan pada mereka harta benda dan anak-anak di dunia ini, merupakan penyegeraan kebaikan bagi mereka yang pantas mereka terima? Sesungguhnya Kami menyegerakan kebaikan bagi mereka sebagai sumber fitnah bagi mereka dan penangguhan waktu semata. Namun, mereka tidak menyadarinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55-56. Apakah golongan-golongan yang merasa bangga dengan golongannya itu mengira bahwa apa yang Kami karuniakan pada mereka, berupa harta dan anak-anak di kehidupan dunia ini, merupakan kebaikan yang disegerakan lagi berhak mereka terima?! Nyatanya, tidaklah seperti yang mereka sangka, sebab Kami karuniakan semua itu sebagai bentuk istidrāj, akan tetapi mereka tidak menyadarinya sedikit pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-56. Apakah orang-orang musyrik itu meyakini bahwa harta dan keturunan yang Kami berikan kepada mereka berarti kebaikan yang bertambah bagi mereka? Sesungguhnya itu adalah istidraj bagi mereka agar dosa-dosa mereka semakin menumpuk sehingga azab bagi mereka semakin berat, akan tetapi mereka tidak menyadarinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. أَيَحْسَبُونَ أَنَّمَا نُمِدُّهُم بِهِۦ مِن مَّالٍ وَبَنِينَ (Apakah mereka mengira bahwa harta dan anak-anak yang Kami berikan kepada mereka itu) Yakni apakah mereka mengira harta dan keturunan yang Kami berikan kepada mereka di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Apakah mereka mengira bahwa harta dan anak-anak yang Kami berikan kepada mereka itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka mengira} apakah mereka mengira {bahwa apa yang Kami berikan kepada mereka} sesungguhnya apa yang Kami beri kepada mereka dan menjadikannya penopang bagi mereka {berupa harta dan anak-anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55-56 “apakah mereka mengira bahwa harta dan anak-anak yang kami berikan kepada mereka itu (berarti bahwa) kami bersegera memberikan kebaikan-kebaikan kepada mereka,” maksudnya apakah mereka mengira bahwa tambahan yang kami berikan kepada mereka berupa harta dan anak merupakan tanda jika mereka termasuk dari kalangan orang-orang yang baik dan (akan berhasil merengkuh) kebahagiaan, dan bagi mereka kebahagiaan dunia dan akhirat yang diberikan kepada mereka? \"sedangkan mereka tidak menyadari\" bahwasanya Kami memberi ulur waktu dan menunda kesempatan bagi mereka serta menambah untuk mereka dengan kenikmatan-kenikmatan, agar mereka semakin bergelimang dalam dosa, dan hukuman merekapun semakin bertambah di akhirat. Tujuannya, supaya mereka terlena dengan apa yang mereka raih, sampai pada suatu masa ketika mereka menikmati kegembiraan dengan apa yang mereka dapatkan, tiba-tiba Allah menghukum mereka dengan seketika."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 55",
    "description": "55-56. Di antara kaum yang durhaka itu ada yang diberi kehidupan mewah. Ini menjadikan mereka menduga bahwa Allah menyayangi mereka sehingga mereka tidak akan diazab. Allah menampik dugaan tersebut dengan pertanyaan bernada kecaman, 'apakah mereka mengira bahwa kami memberikan harta dan anak-anak kepada mereka itu berarti kami segera memberikan kebaikan-kebaikan kepada mereka' tidak! kami tidak melakukan hal itu dengan maksud demikian, tetapi kami biarkan mereka hanyut dalam kesenangan semu supaya mereka makin banyak berbuat dosa, sedang mereka tidak menyadarinya"
  }
]