[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "55-56. Apakah orang-orang kafir itu menyangka bahwa sesungguhnya Kami melimpahkan pada mereka harta benda dan anak-anak di dunia ini, merupakan penyegeraan kebaikan bagi mereka yang pantas mereka terima? Sesungguhnya Kami menyegerakan kebaikan bagi mereka sebagai sumber fitnah bagi mereka dan penangguhan waktu semata. Namun, mereka tidak menyadarinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55-56. Apakah golongan-golongan yang merasa bangga dengan golongannya itu mengira bahwa apa yang Kami karuniakan pada mereka, berupa harta dan anak-anak di kehidupan dunia ini, merupakan kebaikan yang disegerakan lagi berhak mereka terima?! Nyatanya, tidaklah seperti yang mereka sangka, sebab Kami karuniakan semua itu sebagai bentuk istidrāj, akan tetapi mereka tidak menyadarinya sedikit pun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. نُسَارِعُ (Kami bersegera) Dengan harta dan keturunan itu. لَهُمْ فِى الْخَيْرٰتِ ۚ( memberikan kebaikan-kebaikan kepada mereka?) Yakni memberikan mereka suatu kebaikan atau memuliakan mereka? بل لا يشعرون (Tidak, sebenarnya mereka tidak sadar) Yakni tidaklah demikian, Kami tidak melakukan hal itu, namun itu merupakan istidraj bagi mereka akan mereka semakin berbuat dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Berarti bahwa Kami bersegera memberikan kebaikan-kebaikan kepada mereka? Tidak, Kami tidak melakukan itu. Sebenarnya Kami hanya meng-elu-elu mereka supaya dosa mereka bertambah, namun mereka tidak menyadarinya. Maksudnya adalah, apakah mereka mengira bahwa segala kelebihan yang telah Kami berikan kepada mereka itu sebagai bukti bahwa Kami memuliakan mereka? Tidak, justru kebalikan dari itu bahwa Kami tidak menempatkan mereka dalam kebaikan. Bahkan Kami hanya memberikan istidraj kepada mereka agar dosa dan siksa yang akan mereka terima semakin bertambah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami bersegera} Kami bersegera {memberikan kebaikan kepada mereka, namun mereka tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55-56 “apakah mereka mengira bahwa harta dan anak-anak yang kami berikan kepada mereka itu (berarti bahwa) kami bersegera memberikan kebaikan-kebaikan kepada mereka,” maksudnya apakah mereka mengira bahwa tambahan yang kami berikan kepada mereka berupa harta dan anak merupakan tanda jika mereka termasuk dari kalangan orang-orang yang baik dan (akan berhasil merengkuh) kebahagiaan, dan bagi mereka kebahagiaan dunia dan akhirat yang diberikan kepada mereka? \"sedangkan mereka tidak menyadari\" bahwasanya Kami memberi ulur waktu dan menunda kesempatan bagi mereka serta menambah untuk mereka dengan kenikmatan-kenikmatan, agar mereka semakin bergelimang dalam dosa, dan hukuman merekapun semakin bertambah di akhirat. Tujuannya, supaya mereka terlena dengan apa yang mereka raih, sampai pada suatu masa ketika mereka menikmati kegembiraan dengan apa yang mereka dapatkan, tiba-tiba Allah menghukum mereka dengan seketika."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 56: Yakni apakah mereka menyangka bahwa pemberian-Nya kepada mereka berupa harta dan anak menunjukkan bahwa mereka adalah orang-orang yang berbahagia, dan bahwa mereka akan mendapatkan kebaikan di dunia dan akhirat? Bahwa hal itu sesungguhnya istidraj (persiapan untuk diazab). Diberikan nikmat kepada mereka, tidak lain agar bertambah dosa mereka, sehingga hukuman disempurnakan untuk mereka pada hari kiamat. Lihat pula surah At Taubah ayat 55, surah Al An’aam ayat 44 dan surah Ali Imran ayat 178."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 56",
    "description": "55-56. Di antara kaum yang durhaka itu ada yang diberi kehidupan mewah. Ini menjadikan mereka menduga bahwa Allah menyayangi mereka sehingga mereka tidak akan diazab. Allah menampik dugaan tersebut dengan pertanyaan bernada kecaman, 'apakah mereka mengira bahwa kami memberikan harta dan anak-anak kepada mereka itu berarti kami segera memberikan kebaikan-kebaikan kepada mereka' tidak! kami tidak melakukan hal itu dengan maksud demikian, tetapi kami biarkan mereka hanyut dalam kesenangan semu supaya mereka makin banyak berbuat dosa, sedang mereka tidak menyadarinya. 57-61. Setelah menjelaskan sifat-sifat orang yang lengah dan larut dalam durhaka, Allah lalu menguraikan sifat orang-orang yang menjaga hati untuk taat kepada Allah. Sungguh, orang-orang yang karena takut akan azab tuhannya, mereka sangat berhati-hati agar tidak melanggar perintah-Nya, dan mereka yang beriman dengan tanda-tanda kekuasaan tuhannya, baik yang tersurat dalam Al-Qur'an maupun yang terhampar di alam semesta, dan mereka yang tidak mempersekutukan tuhannya dengan apa pun dan kapan pun, baik syirik kecil seperti ria maupun syirik besar, dan mereka yang memberikan apa yang mereka berikan seperti sedekah, zakat, dan lainnya, dengan hati penuh rasa takut jika pemberian itu tidak diterima oleh Allah karena mereka tahu bahwa sesungguhnya mereka akan kembali kepada tuhannya untuk mempertanggungjawabkan perbuatan mereka; mereka itu, yaitu orang-orang dengan sifat-sifatnya demikian, bersegera dalam kebaikan-kebaikan dan bersemangat dalam menjalankan ibadah, dan merekalah orang-orang yang lebih dahulu memperolehnya, yaitu surga, sebagai ganjaran atas amal kebaikannya."
  }
]