[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang lantaran rasa takut mereka kepada Tuhan mereka, mereka menjadi ngeri lagi khawatir terhadap peringatan yang Allah sampaikan kepada mereka,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Sesungguhnya orang-orang yang karena keimanan dan kebaikan, mereka takut kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57-58. Allah memuji orang-orang beriman yang bersegera dalam mengerjakan kebaikan, dan Dia menjelaskan sifat-sifat mereka: Orang-orang yang takut kepada Tuhan mereka selalu berusaha meraih keridhaan-Nya, dan mereka beriman kepada ayat-ayat qur’aniyah dan kauniyah yang diturunkan Tuhan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. إِنَّ الَّذِينَ هُم مِّنْ خَشْيَةِ رَبِّهِم مُّشْفِقُونَ (Sesungguhnya orang-orang yang berhati-hati karena takut akan (azab) Tuhan mereka) Yakni karena mereka sangat takut kepada Allah selalu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Sesungguhnya orang-orang yang berhati-hati karena takut akan azab Tuhan mereka, tidak akan berbuat sesuatu yang memancing amarah Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang sangat berhati-hati} khawatir dan berhati-hati {karena takut Tuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57 “sesungguhnya orang-orang yang berhati-hati karena takut akan (azab) Rabb mereka,” maksudnya merasa was-was, hati mereka khawatir. Itu semua bersumberkan dari sifat ketakutan mereka kepada Rabb mereka, lantaran kekhawatiran bahwa Allah akan memutuskan sifat keadilanNya pada mereka, hingga tidak menyisakan kebaikan untuk mereka dan prasangka buruk terhadap diri mereka sendiri sekiranya belum melaksanakan hak Allah (dengan sepenuhnya), dan karena kekhawatiran terhadap keimanan mereka yang akan lenyap, karena pengetahuan mereka tentang Rabb mereka dan keagungan serta penghormatan yang berhak Allah dapatkan (dari hambaNya). Rasa takut dan khawatir mereka berkonsekuensi pada mereka untuk mengekang diri dari dampak perkara yang menakutkan, berupa dosa dan peremehan dalam menjalankan kewajiban-kewajiban."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 57: Setelah Allah Subhaanahu wa Ta'aala menyebutkan orang-orang yang menggabung antara sikap buruk dengan merasa aman, yaitu orang-orang yang menyangka pemberian Allah kepada mereka di dunia menunjukkan bahwa mereka di atas kebaikan dan keutamaan, maka Allah menyebutkan orang-orang yang berbuat ihsan dan memiliki rasa takut kepada Allah ‘Azza wa Jalla. Mreka takut jika Allah meletakan keadilan-Nya kepada mereka, sehingga tidak tersisa lagi kebaikan bagi mereka, dan mereka menyangka bahwa mereka belum memenuhi hak Allah Ta’ala, mereka pun takut jika iman mereka hilang. Karena mereka kenal Tuhan mereka, dan keberhakan-Nya dimuliakan dan diagungkan serta takut kepada-Nya, maka yang demikian membuat mereka menahan diri dari dosa dan meremehkan kewajiban."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 57",
    "description": "57-61. Setelah menjelaskan sifat-sifat orang yang lengah dan larut dalam durhaka, Allah lalu menguraikan sifat orang-orang yang menjaga hati untuk taat kepada Allah. Sungguh, orang-orang yang karena takut akan azab tuhannya, mereka sangat berhati-hati agar tidak melanggar perintah-Nya, dan mereka yang beriman dengan tanda-tanda kekuasaan tuhannya, baik yang tersurat dalam Al-Qur'an maupun yang terhampar di alam semesta, dan mereka yang tidak mempersekutukan tuhannya dengan apa pun dan kapan pun, baik syirik kecil seperti ria maupun syirik besar, dan mereka yang memberikan apa yang mereka berikan seperti sedekah, zakat, dan lainnya, dengan hati penuh rasa takut jika pemberian itu tidak diterima oleh Allah karena mereka tahu bahwa sesungguhnya mereka akan kembali kepada tuhannya untuk mempertanggungjawabkan perbuatan mereka; mereka itu, yaitu orang-orang dengan sifat-sifatnya demikian, bersegera dalam kebaikan-kebaikan dan bersemangat dalam menjalankan ibadah, dan merekalah orang-orang yang lebih dahulu memperolehnya, yaitu surga, sebagai ganjaran atas amal kebaikannya"
  }
]