[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan orang-orang yang mengikhlaskan ibadah bagi Allah semata, tidak mempersekutukan apa pun denganNya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Dan orang-orang yang mentauhidkan Tuhan mereka tanpa menyekutukan-Nya dengan sesuatu apa pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59-62. Dan mereka hanya menyembah Allah semata, tanpa menyekutukannya dengan yang lain; mereka menunaikan zakat harta mereka dan senantiasa mendirikan shalat dengan penuh rasa takut ibadah itu tidak diterima saat mereka telah dibangkitkan pada hari kiamat menghadap Allah untuk menjalani hisab. Mereka adalah orang-orang yang meraih derajat yang tinggi, yang senantiasa bersegera menjalankan amal shalih dan saling berlomba-lomba menjalankannya sesuai kemampuan mereka, sebab Kami tidak membebankan kepada seseorang melainkan sesuai dengan kemampuannya. Dan di sisi Kami buku catatan amal setiap hamba yang mencatat dengan tepat setiap kebaikan atau keburukan yang telah mereka lakukan, dan mereka sama sekali tidak terzalimi dengan berkurangnya pahala atau dengan diazab tanpa sebab. ‘Aisyah berkata, aku pernah bertanya: Wahai Rasulullah, dalam ayat: ‘Dan orang-orang yang memberikan apa yang telah mereka berikan, dengan hati yang takut’, apakah dia adalah seorang perzina, pencuri, dan peminum khamr? Beliau menjawab: “Bukan wahai putri Abu Bakar, namun dia adalah orang yang senantiasa berpuasa, bersedekah, dan shalat, namun dia takut amalannya itu tidak diterima Allah.” (Diriwayatkan Ibnu Majah dalam kitab as-Sunan 2/1404, kitab zuhud, bab takut saat beramal no. 4198. Dan diriwayatkan at-Tirmidzi dlam kitab al-Jami’ as-Shahih, tafsir surat al-Mu’minun no. 3175. Dan diriwayatkan Imam Ahmad dalam al-Musnad 6/159; dan Imam al-Hakim dalam al-Mustadrak 2/393-394. Dishahihkan dan disepakati oleh Imam ad-Dzahabi, dan dihasankan oleh al-Albani dalam shahih Ibnu Majah 2/409)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Serta orang-orang yang tidak mempersekutukan Tuhan mereka dengan sesuatu apapun, setelah datang risalah keimanan kepada mereka. Karena syirik bisa bercampur dalam keimanan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang tidak menyekutukan Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59 “Dan orang-orang yang tidak mempersekutukan dengan Rabb mereka (sesuatu apapun),” maksudnya syirik yang sangat jelas, semisal menjadikan selain Allah sebagai sesembahan, yang dia seru dan harapkan (pertolongannya); dan tidak melakukan syirik yang tersembunyi, seperti riya dan lainnya. Bahkan, mereka beribadah dengan ikhlas karena Allah dalam ucapan-ucapan, tindakan-tindakan, dan seluruh kondisi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 59: Baik syirk besar, seperti menyembah selain Allah, maupun syirk kecil seperti riya’, dsb. Bahkan mereka ikhlas dalam ibadahnya karena Allah, baik dalam perkataan mereka, perbuatan maupun semua keadaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 59",
    "description": "57-61. Setelah menjelaskan sifat-sifat orang yang lengah dan larut dalam durhaka, Allah lalu menguraikan sifat orang-orang yang menjaga hati untuk taat kepada Allah. Sungguh, orang-orang yang karena takut akan azab tuhannya, mereka sangat berhati-hati agar tidak melanggar perintah-Nya, dan mereka yang beriman dengan tanda-tanda kekuasaan tuhannya, baik yang tersurat dalam Al-Qur'an maupun yang terhampar di alam semesta, dan mereka yang tidak mempersekutukan tuhannya dengan apa pun dan kapan pun, baik syirik kecil seperti ria maupun syirik besar, dan mereka yang memberikan apa yang mereka berikan seperti sedekah, zakat, dan lainnya, dengan hati penuh rasa takut jika pemberian itu tidak diterima oleh Allah karena mereka tahu bahwa sesungguhnya mereka akan kembali kepada tuhannya untuk mempertanggungjawabkan perbuatan mereka; mereka itu, yaitu orang-orang dengan sifat-sifatnya demikian, bersegera dalam kebaikan-kebaikan dan bersemangat dalam menjalankan ibadah, dan merekalah orang-orang yang lebih dahulu memperolehnya, yaitu surga, sebagai ganjaran atas amal kebaikannya"
  }
]