[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali terhadap istri-istri mereka atau budak-budak perempuan yang mereka miliki. Maka tidak ada celaan dan tidak ada dosa atas mereka untuk menggauli wanita-wanita itu dan bersenang-senang dengan mereka; sebab sesungguhnya Allah telah menghalalkan wanita-wanita itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Kecuali terhadap istri-istri mereka atau hamba sahaya wanita yang mereka miliki, sebab mereka tidak tercela bila berhubungan badan atau bercumbu dengan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِلَّا عَلَىٰٓ أَزْوٰجِهِمْ (kecuali terhadap isteri-isteri mereka) Yakni mereka akan tercela jika melakukan apa yang dilarang bagi mereka, dan mereka diperintah untuk menjauhinya kecuali pada istri-istri mereka maka mereka tidak harus menjaga kemaluan mereka, dan mereka tidak akan tercela jika melakukannya dengan istri-istri mereka. أَوْ مَا مَلَكَتْ أَيْمٰنُهُمْ (atau budak yang mereka miliki) Yakni budak-budak wanita yang hanya milik mereka, maka mereka boleh berhubungan dengan mereka selama tidak ada larangan syari’at yang melarang itu seperti jika budak perempuan itu adalah saudara perempuannya sesusuan. فَإِنَّهُمْ غَيْرُ مَلُومِينَ(maka sesungguhnya mereka dalam hal ini tiada tercela) Yakni dalam hal tidak menjaga kemaluan mereka terhadap istri-istri dan budak-budak wanita mereka, namun mereka akan tercela jika melakukannya terhadap mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Kecuali terhadap isteri-isteri mereka setelah melakukan akad sesuai syariat. Atau juga budak yang mereka miliki; yaitu budak perempuan, sebab pada zaman dahulu perbudakan adalah suatu yang umum. Sumber/asal muasal perbudakan adalah peperangan sehingga pemimpin menjadikan perempuan sebagai budak dengan perlakuan layaknya hubungan suami isteri. Maka sesungguhnya mereka dalam hal ini tiada tercela, yaitu menyetubuhi. Sebab diperbolehkannya menyetubuhi isteri adalah adanya akad, namun jika budak perempuan sang majikan berhak mengambil manfaat, mengawasi, maupun menyetubuhi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali terhadap} dari {istri-istri mereka atau hamba sahaya yang mereka miliki} hamba sahaya yang kalian miliki dari ibu yang seorang hamba sahaya {Sesungguhnya mereka tidak tercela"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Kecuali terhadap istri-istri mereka atau budak yang mereka miliki,” berupa budak-budaknya yang ia miliki. “Maka sesungguhnya mereka dalam hal ini tiada tercela,” saat mendekati keduanya. Karena Allah menghalalkan keduanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 6: Maksudnya, budak-budak belian yang didapat dalam peperangan dengan orang kafir, bukan budak belian yang didapat di luar peperangan. Dalam peperangan dengan orang-orang kafir itu, wanita-wanita yang ditawan biasanya dibagi-bagikan kepada kaum muslimin yang ikut dalam peperangan itu, dan kebiasan ini bukanlah suatu yang diwajibkan. Imam boleh melarang kebiasaan ini. Kata-kata, “Hamba sahaya yang mereka miliki” menunjukkan, bahwa untuk halalnya budak wanita harus dimiliki semua jasadnya. Oleh karena itu, jika ia hanya memiliki sebagiannya, maka belum halal, karena budak itu miliknya dan milik yang lain. Sebagaimana tidak boleh dua orang laki-laki berserikat (bersama-sama) menikahi seorang wanita, maka tidak boleh pula dua orang majikan berserikat (bersama-sama) terhadap seorang budak wanita. Karena Allah telah menghalalkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 6",
    "description": "5-7. Dan selain orang-orang yang disebut pada ayat-ayat sebelumnya, berbahagialah orang yang memelihara kemaluannya dan tidak menya-lurkan kebutuhan biologisnya melalui hal dan cara yang tidak dibe-narkan, kecuali terbatas dalam melakukannya terhadap pasangan-pasangan mereka atau hamba sahaya yang mereka miliki; maka sesungguhnya mereka dalam menyalurkan kebutuhan biologis terhadap pasangan dan budak mereka itu tidak tercela, selama mereka tidak melanggar ketentuan yang ditetapkan oleh agama. Tetapi, barang siapa mencari pelampiasan hawa nafsu di balik itu, di antaranya dengan berbuat zina, maka mereka itulah orang-orang yang melampaui batas ajaran agama dan moral, sehingga pantas menerima celaan atau siksa"
  }
]