[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang bersungguh-sungguh dalam berbuat amal-amal shalih dan kebajikan, sedang hati mereka takut lantaran khawatir tidak diterima amal perbuatan mereka dan tidak dapat menyelamatkan mereka dari siksaan Tuhan mereka, bila mereka kembali kepadaNya untuk menghadapi perhitungan amal;"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan orang-orang yang bersungguh-sungguh mengerjakan kebajikan dan mendekatkan diri kepada Allah dengan amal-amal saleh, dengan penuh rasa takut jangan sampai Allah tidak menerima infak dan amal saleh mereka bila mereka kembali kepada-Nya pada hari Kiamat kelak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَالَّذِينَ يُؤْتُونَ مَآ ءَاتَوا۟ وَّقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَىٰ رَبِّهِمْ رٰجِعُونَ (Dan orang-orang yang memberikan apa yang telah mereka berikan, dengan hati yang takut, (karena mereka tahu bahwa) sesungguhnya mereka akan kembali kepada Tuhan mereka) Yakni meraka bersedekah dengan hati yang takut bahwa sedekah itu belum bisa menyelamatkannya dari azab Allah sebab mereka yakin akan kembali kepada Tuhan mereka. Sebab ketakutan mereka karena mereka takut ibadah mereka tidak diterima sebagaimana yang seharusnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah mengatakan dalam ayat-Nya: { وَجِلَةٌ } yakni خائفة \"takut\", al-Hasan al-Bashri berkata: mereka melakukan perbuatan baik, dan mereka takut jika amalan itu tidak menyelamatkan mereka dari siksa tuhannya, sesunguhnya orang beriman mengumpulkan banyak kebaikan dan mereka takut kepada tuhannya, sedangkan orang munafiq mengumpulkan keburukan dan mereka merasa aman denga keburukan itu. 2 ). Sahl bin Abdullah pernah berkata: takutnya orang-orang yang benar (siddiqun) kepada su'ul khatimah disetiap saat dan gerakan mereka, dan mereka itulah yang Allah kepada mereka dalam ayat ini. 3 ). Ibnu Rajab pernah berkata: Tidklah dianjurkannya meminta ampunan pada malam lailatul qadr, setelah usaha dan kerja keras melakukan amala shalih pada malam-malam akhir dari ramadhan; adalah karena mereka yang mengetahui keadaan dirinya sekalipun telah beramal yang banyak, tapi mereka seakan-akan tidak melihat apapun dari amalannya itu, sehingga mereka kembali kepada tuhannya dengan memohon ampunan bagaikan orang yang berlumuran dosa. 4 ) Jika ditelaah ayat ini dengan baik, setidaknya akan diketahui bahwa orang-orang shalih tidak takut pada sesuatu apapun melainkan pada dua hal ini: - Takut jika amalan tidak diterima { وَٱلَّذِينَ يُؤْتُونَ مَآ ءَاتَوا۟ وَّقُلُوبُهُمْ وَجِلَةٌ } - Takut jika hati kembali rusak setelah datangnya hidayah { رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا } \"(Mereka berdoa): \"Ya Tuhan kami, janganlah Engkau jadikan hati kami condong kepada kesesatan sesudah Engkau beri petunjuk kepada kami\" [Ali Imran:8]. 5 ). Al-Qur'an mengarjakan kepada kita agar tidak merasa cukup dengan banyaknya puasa dan zakat yang sudah kita kerjakan dan tunaikan, melainkan senantiasa takut kepada Allah dan terus menambah ketaatan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Orang-orang yang memberikan sedekah dan zakat mereka, dengan hati yang takut, karena mereka tahu bahwa sesungguhnya mereka akan kembali kepada Tuhan mereka, maka mereka akan diberi balasan atas apa yang telah mereka lakukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang memberikan sesuatu yang telah mereka berikan} mereka memberikan sesuatu yang sudah pernah mereka berikan berupa zakat dan sedekah {dan hati mereka takut} takut bahwa hal itu tidak diterima dari mereka {bahwa sesungguhnya mereka akan kembali kepada Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60 “dan orang-orang yang memberikan apa yang telah mereka berikan,” maksudnya mereka memberikan dari diri mereka (dengan suka rela) sesuatu yang mereka perintahkan untuk menjalankannya yaitu sesuatu yang telah mereka berikan, berupa amalan-amalan yang mereka mampu mengerjakannya, seperti shalat, (membayar) zakat, haji, sedekah dan lain sebagainya. “dengan hati yang takut,” merasa takut “(karena mereka tahu bahwa) sesungguhnya mereka akan kembali kepada Rabb mereka,” maksudnya mereka merasa takut saat amalan-amalan mereka ditampilkan kepada Allah dan berdiri dihadapanNya, sekiranya amalan mereka tidak bisa menyelamatkan mereka dari siksa Allah. Hal ini merupakan wujud pengetahuan mereka tentang Allah dan hal-hal yang menjadi hak Allah, seperti berbagai macam ibadah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 60: Ayat di atas dapat diartikan, “Dan mereka yang mengerjakan apa yang mereka kerjakan” sehingga termasuk pula amal saleh di samping sedekah, seperti shalat, zakat, haji, dan lainnya. Jika tidak diterima amal mereka. Maksudnya, karena mereka tahu bahwa mereka akan kembali kepada Tuhan mereka untuk dihisab, maka mereka khawatir kalau pemberian (sedekah) dan amal mereka tidak diterima Allah Subhaanahu wa Ta'aala dan tidak menyelamatkan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 60",
    "description": "57-61. Setelah menjelaskan sifat-sifat orang yang lengah dan larut dalam durhaka, Allah lalu menguraikan sifat orang-orang yang menjaga hati untuk taat kepada Allah. Sungguh, orang-orang yang karena takut akan azab tuhannya, mereka sangat berhati-hati agar tidak melanggar perintah-Nya, dan mereka yang beriman dengan tanda-tanda kekuasaan tuhannya, baik yang tersurat dalam Al-Qur'an maupun yang terhampar di alam semesta, dan mereka yang tidak mempersekutukan tuhannya dengan apa pun dan kapan pun, baik syirik kecil seperti ria maupun syirik besar, dan mereka yang memberikan apa yang mereka berikan seperti sedekah, zakat, dan lainnya, dengan hati penuh rasa takut jika pemberian itu tidak diterima oleh Allah karena mereka tahu bahwa sesungguhnya mereka akan kembali kepada tuhannya untuk mempertanggungjawabkan perbuatan mereka; mereka itu, yaitu orang-orang dengan sifat-sifatnya demikian, bersegera dalam kebaikan-kebaikan dan bersemangat dalam menjalankan ibadah, dan merekalah orang-orang yang lebih dahulu memperolehnya, yaitu surga, sebagai ganjaran atas amal kebaikannya"
  }
]