[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "mereka yang sungguh-sungguh dalam ketaatan (kepada Allah) itu, kebiasaan mereka bersegera melakukan setiap amal kebaikan, dan mereka berlomba dalam kebaikan-kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Mereka yang memiliki sifat-sifat yang agung ini bersegera dalam mengerjakan amal saleh, dan mereka lah orang-orang yang terlebih dahulu memperolehnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini sebagai dalil bahwa bergegas untuk mengerjakan amalan shalih, sperti menunaikan shalat di awal waktu dan ibadah-ibadah lainnya adalah suatu keutamaan dalam mengerjakan amalan shalih tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Mereka itu bersegera untuk mendapat kebaikan-kebaikan, serta mencintai ketaatan dengan sepenuh hati. Merekalah orang-orang yang menyegerakan dalam melakukan kebaikan dan juga segera memasuki surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itu bersegera} bergegas {dalam (melakukan) kebaikan dan mereka itu terhadap kebaikan itu} terhadap kebaikan itu {adalah orang-orang yang lebih dahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61 “mereka itu bersegera untuk mendapat kebaikan-kebaikan,” yaitu dalam kancah perlombaan amalan kebaikan. Obsesi mereka adalah segala yang mendekatkan diri mereka kepada Allah. Minat mereka terforsikan pada urusan-urusan yang menyelamatkan mereka dari siksaanNya. Setiap kebaikan yang telah mereka dengar, dan muncul kesempatan bagi mereka untuk [menyusulnya], niscaya mereka memanfaatkannya dan bersegera mengerjakannya. Sungguh, mereka telah memandang para wali Allah dan para kekasihNya di depan mereka di sisi kanan dan sisi kiri (dan ingin menyerupai mereka). Mereka sigap kepada setiap kebaikan, berkompetisi meraih kedekatan di sisi Rabb mereka. Mereka (berusaha) mendahului mereka (para wali kekasih Allah). Ketika ada orang yang berhasil mendahului dan lebih cepat daripada yang lain, karena ketekunan dan kesungguhannya, atau kadang tidak dapat mengalahkan (orang lain) lantaran sikap penyepelean yang muncul darinya, maka Allah mengabarkan bahwa mereka itu masuk dalam golongan orang-orang yang berlomba. Allah berfirman, ”dan merekalah kepadanya,” kepada kebaikan-kebaikan “bersegera memperolehnya,” sungguh mereka telah mencapai titik puncaknya dan saling berlomba dengan generasi awal. Kendatipun demikian, telah berlalu ketetapan kebahagiaan dari Allah bagi mereka, bahwa mereka adalah orang-orang sabiqun (yang bersegera dalam berbuat baik)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 61: Perhatian mereka tertuju kepada sesuatu yang mendekatkan diri mereka kepada Allah, dan keinginan mereka tertuju kepada sesuatu yang menyelamatkan mereka dari azab-Nya. Oleh karena itu, semua kebaikan yang mereka dengar dan ada kesempatan bagi mereka melakukannya, maka mereka segera melakukannya. Mereka melihat wali-wali Allah dan orang-orang pilihan-Nya di hadapan mereka, di mana mereka bersegera kepada kebaikan dan berlomba-lomba untuk mendekatkan diri kepada Allah, maka mereka pun ikut berlomba-lomba. Oleh karena peserta lomba biasanya ada yang menang dan ada yang kalah, maka Allah jelaskan di ayat tersebut bahwa mereka semua menang. Maksudnya orang-orang yang mempunyai sifat-sifat yang disebutkan dalam ayat 57, 58, 59, dan 60 itu adalah orang yang bersegera mendapatkan kebaikan-kebaikan, dan kebaikan-kebaikan itu akan diberikan kepada mereka dengan segera sejak di dunia ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 61",
    "description": "57-61. Setelah menjelaskan sifat-sifat orang yang lengah dan larut dalam durhaka, Allah lalu menguraikan sifat orang-orang yang menjaga hati untuk taat kepada Allah. Sungguh, orang-orang yang karena takut akan azab tuhannya, mereka sangat berhati-hati agar tidak melanggar perintah-Nya, dan mereka yang beriman dengan tanda-tanda kekuasaan tuhannya, baik yang tersurat dalam Al-Qur'an maupun yang terhampar di alam semesta, dan mereka yang tidak mempersekutukan tuhannya dengan apa pun dan kapan pun, baik syirik kecil seperti ria maupun syirik besar, dan mereka yang memberikan apa yang mereka berikan seperti sedekah, zakat, dan lainnya, dengan hati penuh rasa takut jika pemberian itu tidak diterima oleh Allah karena mereka tahu bahwa sesungguhnya mereka akan kembali kepada tuhannya untuk mempertanggungjawabkan perbuatan mereka; mereka itu, yaitu orang-orang dengan sifat-sifatnya demikian, bersegera dalam kebaikan-kebaikan dan bersemangat dalam menjalankan ibadah, dan merekalah orang-orang yang lebih dahulu memperolehnya, yaitu surga, sebagai ganjaran atas amal kebaikannya. 62. Para pendurhaka yang disebut pada ayat sebelumnya boleh jadi menganggap bahwa ajaran agama sangat memberatkan. Menyanggah anggapan ini Allah berfirman, 'dan kami tidak membebani seseorang dengan amalan-amalan ibadah melainkan menurut kesanggupannya, maka tidak sewajarnya bila seseorang merasa tidak mampu; dan pada kami ada suatu catatan yang menuturkan dengan sebenarnya apa saja yang dilakukan oleh manusia, dan mereka tidak dizalimi atau dirugikan dengan bertambahnya dosa atau berkurangnya pahala. Allah tidak akan pernah berbuat zalim kepada manusia, tetapi manusialah yang menzalimi diri sendiri (lihat juga: surah y'nus/10: 44)."
  }
]