[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidaklah membebani seseorang dari hamba-hamba Kecuali amal perbuatan yang mampu dia perbuat. Dan perbuatan-perbuatan mereka tertulis di sisi Kami di dalam buku catatan perhitungan amal-amal yang akan dibawa ke atas oleh malaikat. Buku itu akan berbicara dengan benar tentang mereka, dan tidak ada seorang pun dari mereka yang dizhalimi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Dan Kami tidak membebani seseorang kecuali sesuai kadar kesanggupannya dalam beramal. Dan pada Kami memiliki suatu kitab yang memuat seluruh amalan orang yang beramal. Kitab tersebut menuturkan kebenaran yang tidak ada keraguan padanya. Dan mereka tidak dizalimi dengan dikurangi pahala kebaikan mereka ataupun ditambah dosa keburukan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَلَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا ۖ (Kami tiada membebani seseorang melainkan menurut kesanggupannya) Maka barangsiapa yang tidak mampu melakukan gerakan sujud pada shalat maka boleh baginya dengan menggunakan isyarat; barangsiapa yang tidak mampu menjalankan puasa maka boleh baginya berbuka. Ini merupakan dorongan untuk melakukan ketaatan yang dapat mengantarkan pada kemuliaan sebagaimana yang disebutkan oleh para pendahulu, dengan menjelaskan kemudahan agama Islam yang tidak keluar dari kemampuan manusia untuk menjalankannya. وَلَدَيْنَا كِتٰبٌ(dan pada sisi Kami ada suatu kitab) Yang mencatat segala amal perbuatan setiap orang dengan sebenar-benarnya. يَنطِقُ بِالْحَقِّ ۚ( yang membicarakan kebenaran) Yakni yang menunjukkan kebenaran sesuai dengan kenyataan, tanpa penambahan atau pengurangan. وَهُمْ لَا يُظْلَمُونَ(dan mereka tidak dianiaya) Dengan pengurangan pahala atau penambahan siksa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Kami tiada membebani seseorang untuk melakukan ketaatan melainkan menurut kesanggupannya tanpa mempersulit. Seperti diperbolehkan melaksakan shalat dengan duduk atau berbaring bagi yang sakit, atau juga diperbolehkan bagi musafir untuk berbuka pada bulan Ramadan. Pada sisi Kami ada suatu kitab yang mencatat amal semua makhluk, mereka sama sekali tidak terdholimi, juga tidak dikurangi pahala ataupun ditambah siksa kecuali apa yang menjadi haknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak membebani seseorang kecuali menurut kesanggupannya} sesuai kemampuannya {dan pada Kami ada suatu catatan yang menuturkan dengan sebenarnya} yang menjelaskan dengan benar {dan mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62 sesudah menyebutkan semangat berlomba dan kecepatan mereka menuju kebaikan, mungkin ada orang berpraduga salah bahwa perkara yang dituntut pada mereka dan orang lain merupakan perkara yang diluar kemampuan atau sulit, maka Allah memberitahukan bahwa, “kami tiada membebani seseorang melainkan menurut kesanggupannya,” maksudnya sesuai dengan kemampuan yang bisa dia perbuat, dengan tetap menyisakan kekuatannya, tidak menghabiskan seluruh kekuatannya sebagai (ceminan) rahmat dan hikmahNya untuk memudahkan jalan kepadaNya, dan supaya jalan lurus yang biasa ditempuh para peniti (tetap) ramai disetiap waktu. “dan disisi kami ada suatu kitab yang membicarakan kebenaran,” yaitu kitab yang pertazma yang memuat segala sesuatu, selaras dengan setiap fakta yang akan terjadi. Oleh karena itu, ia merupakan kebenaran. “dan mereka tidak dianiaya,” dengan mengurangi kebaikan mereka atau menambah hukuman dan pelanggaran mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 62: Setelah Allah menyebutkan kesegeraan mereka terhadap kebaikan, mungkin ada yang mengira bahwa apa yang diminta dari mereka dan dari selain mereka adalah perkara yang tidak disanggupi atau perkara berat, maka Allah menerangkan dalam ayat di atas, bahwa Dia tidak membebani seseorang kecuali sesuai dengan kemampuannya. Yakni sesuai kemampuannya dan tidak menghabiskan semua kekuatannya karena rahmat dan hikmah-Nya agar manusia semua dapat melakukannya. Contoh dalam hal ini adalah dalam masalah shalat, apabila seseorang tidak sanggup shalat sambil berdiri, maka ia boleh shalat sambil duduk, dan apabila sesorang tidak sanggup berpuasa, ia boleh berbuka. Maksudnya, kitab tempat malaikat-malaikat menuliskan perbuatan-perbuatan seseorang, baik atau buruk, yang akan dibacakan pada hari kiamat (lihat surat Al-Jatsiyah ayat 29). Oleh karena itu pahala kebaikan mereka tidak dikurangi dan keburukannya tidak ditambah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 62",
    "description": "Para pendurhaka yang disebut pada ayat sebelumnya boleh jadi menganggap bahwa ajaran agama sangat memberatkan. Menyanggah anggapan ini Allah berfirman, 'dan kami tidak membebani seseorang dengan amalan-amalan ibadah melainkan menurut kesanggupannya, maka tidak sewajarnya bila seseorang merasa tidak mampu; dan pada kami ada suatu catatan yang menuturkan dengan sebenarnya apa saja yang dilakukan oleh manusia, dan mereka tidak dizalimi atau dirugikan dengan bertambahnya dosa atau berkurangnya pahala. Allah tidak akan pernah berbuat zalim kepada manusia, tetapi manusialah yang menzalimi diri sendiri (lihat juga: surah y'nus/10: 44). 63. Tetapi meski ajaran Allah demikian jelas dan mudah, orang-orang kafir itu tetap durhaka sehingga hati mereka itu dalam kesesatan terkait hakikat yang kami sampaikan ini, dan mereka mempunyai kebiasaan melakukan perbuatan-perbuatan lain yang buruk yang terus mereka ker-jakan. Mereka melampaui batas dalam melakukannya sehingga mereka pantas menerima siksa."
  }
]