[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, hati orang-orang kafir berada di dalam kekafiran amat pekat terhadap al-Qur’an ini dan kandungan yang ada di dalamnya. Dan selain kesyirikan, mereka memiliki perbuatan-perbuatan buruk. Allah menangguhkan waktu bagi mereka agar mereka melakukan keburukan-keburukan itu, sehingga mereka mendapatkan murka dan hukuman Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Akan tetapi hati orang-orang kafir senantiasa lalai dari memahami kitab yang menuturkan kebenaran ini, dan lalai dari kitab yang diturunkan kepada mereka. Dan mereka juga memiliki amal perbuatan lain selain amal kekafiran yang terus mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-65. Allah mengancam orang-orang kafir karena keburukan amal mereka: Orang-orang kafir dalam kelalaian dan kebutaan terhadap al-Qur’an, dan mereka memiliki berbagai amalan buruk -selain kekafiran mereka- yang mereka kerjakan, mereka akan mendapat azab atas perbuatan tersebut. Dan ketika Kami mengazab orang-orang yang dahulu hidup mewah di antara mereka dengan azab akhirat, mereka berteriak meminta pertolongan dari api neraka. Dan akan dikatakan kepada mereka: “Janganlah kalian meminta pertolongan, sebab kalian tidaka akan mendapat pertolongan dari azab Kami, tidak ada seorangpun yang mempu menyelamatkan kalian. Kata (تنصرون) mengandung makna keselamatan, sehingga fi’il ini memakai kata (من), yakni kalian tidak akan selamat dari azab Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. بَلْ قُلُوبُهُمْ فِى غَمْرَةٍ مِّنْ هٰذَا (Tetapi hati orang-orang kafir itu dalam kesesatan dari hal ini) Yakni akan tetapi hati orang-orang kafir lalai terhadap kitab yang memperlihatkan kebenaran ini, atau lalai terhadap urusan orang-orang beriman. وَلَهُمْ أَعْمٰلٌ مِّن دُونِ ذٰلِكَ هُمْ لَهَا عٰمِلُونَ (dan mereka banyak mengerjakan perbuatan-perbuatan (buruk) selain daripada itu, mereka tetap mengerjakannya) Yakni mereka memiliki berbagai amalan buruk yang belum mereka kerjakan namun pasti akan mereka kerjakan, sehingga amalan itu memasukkan mereka ke neraka; hal ini disebabkan keburukan yang telah tertulis bagi mereka yang tidak mungkin mereka hindari."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tanah hati jika dihamparkan di atasnya bibit-bibit keimanan, rasa takut dan cinta kepada Allah, pembenaran kepada janji-Nya, pengaharapan kepada pahala, dan terus senantiasa disirami, pemiliknya senantiasa menjaga batasan-batasan Allah, mendirikan segala perintah, dan menjauhi segala larangan; maka akan berbuah darinya semua amalan-amalan yang indah, dan akan dipenuhi hatinya dengan berbagai kebaikan; anggota badannya akan terus digunakan dalam ketaatan kepada Allah. Maka berhati-hatilah kamu jika termasuk dalam ayat: { بَلْ قُلُوبُهُمْ فِي غَمْرَةٍ مِنْ هَٰذَا وَلَهُمْ أَعْمَالٌ مِنْ دُونِ ذَٰلِكَ هُمْ لَهَا عَامِلُونَ } \"Tetapi hati orang-orang kafir itu dalam kesesatan dari (memahami kenyataan) ini, dan mereka banyak mengerjakan perbuatan-perbuatan (buruk) selain daripada itu, mereka tetap mengerjakannya.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Tetapi hati orang-orang kafir itu dalam kesesatan dari memahami kitab yang menyatakan kebenaran ini, yaitu lembaran amal atau juga Alquran. Mereka banyak mengerjakan perbuatan-perbuatan buruk selain daripada kekufuran itu sendiri, mereka tetap mengerjakannya dan mereka akan diazab atas perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Akan tetapi hati mereka itu dalam kesesatan dari hal ini} lalai dan buta dari Al-Qur’an ini {dan mereka mempunyai perbuatan-perbuatan selain itu} dan orang-orang kafir itu memiliki perbuatan-perbuatan yang keji berupa perbuatan-perbuatan maksiat selain syirik {dan mereka terus mengerjakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63 Allah mengabarkan bahwa hati-hati (kaum kafir) yang mendustakan berada dalam kesesatan terhadap hal ini (memahami kenyataan). Maksudnya, berada di tengah kegelapan kebodohan, kezhaliman, kelalaian dan keberpalingan, yang menghalangi untuk sanggup menggapai al-qur’an. Mereka tidak dapat petunjuk dengannya. Tidak ada satu unsur pun dari al-qur’an yang sampai kepada mereka. \"Dan apabila kamu membaca Al Qur'an niscaya Kami adakan antara kamu dan orang-orang yang tidak beriman kepada kehidupan akhirat, suatu dinding yang tertutup. dan Kami adakan tutupan di atas hati mereka dan sumbatan di telinga mereka, agar mereka tidak dapat memahaminya.\" (QS. Al-Isro :45-46) Ketika hati-hati mereka berada di dalam kesesatan (untuk memahaminya), maka mereka mengerjakan amalan yang sesuai dengan kondisi mereka, berupa amalan-amalan yang kufur dan penentangan kepada aturan syariat, yang mengharuskan datangnya hukuman bagi mereka. Akan tetapi “ mereka banyak mengerjakan perbuatan-perbuatan (buruk) selain dari itu,”,maksudnya selain dari tindakan-tindakan ini “mereka tetap mengerjakan(nya),” maka janganlah mereka memandang aneh atas tidak turunnya siksa pada diri mereka. Sesungguhnya Allah sedang memberikan kesempatan bagi mereka, agar mereka melakukan amalan-amalan yang masih tersisia, yang sudah menjadi ketentuan takdir mereka. Maka, apabila mereka telah mengerjakan dan menuntaskannya, niscaya mereka akan beralih dari kondisi yang terjelek menuju kemurkaan dan siksa Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 63: Allah Subhaanahu wa Ta'aala memberitahukan bahwa hati orang-orang kafir berada dalam kebodohan dan kezaliman, kelalaian dan berpaling yang menghalangi mereka dari sampai kepada Al Quran, sehingga mereka tidak mengambil petunjuk darinya, dan sedikit pun dari Al Qur’an tidak sampai ke hati mereka, sebagaimana firman Allah Ta’ala, “Dan apabila kamu membaca Al Quran niscaya Kami adakan antara kamu dan orang-orang yang tidak beriman kepada kehidupan akhirat, suatu dinding yang tertutup,-- Dan Kami adakan tutupan di atas hati mereka dan sumbatan di telinga mereka, agar mereka tidak dapat memahaminya. dan apabila kamu menyebut Tuhanmu saja dalam Al Quran, niscaya mereka berpaling ke belakang karena bencinya,” (Terj. Al Israa’: 45-46) Oleh karena hati mereka berada dalam kebodohan terhadap Al Qur’an, sehingga mereka mengerjakan perbuatan-perbuatan kufur dan menentang syara’ yang mengharuskan mereka diazab. Oleh karena itu, janganlah mereka mengira bahwa azab tidak akan menimpa mereka, karena Allah memberi tangguh mereka agar bertambah dosa mereka sehingga mereka mendapatkan balasan yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 63",
    "description": "Tetapi meski ajaran Allah demikian jelas dan mudah, orang-orang kafir itu tetap durhaka sehingga hati mereka itu dalam kesesatan terkait hakikat yang kami sampaikan ini, dan mereka mempunyai kebiasaan melakukan perbuatan-perbuatan lain yang buruk yang terus mereka ker-jakan. Mereka melampaui batas dalam melakukannya sehingga mereka pantas menerima siksa. 64. Mereka terus-menerus larut dalam kedurhakaan, sehingga apabila kami timpakan siksaan kepada orang-orang yang hidup bermewah-mewah di antara mereka dan para pengikut mereka, seketika itu mereka berteriak-teriak meminta tolong dengan penuh kehinaan."
  }
]