[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sehingga ketika Kami timpakan siksaan pada orang-orang yang bergelimang kemewahan dan orang-orang arogan dari mereka, tiba-tiba mereka berteriak keras-keras dengan penuh iba lagi memohon pertolongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Sehingga apabila Kami timpakan azab pada orang-orang yang hidup mewah dari kalangan mereka ketika di dunia pada hari Kiamat kelak, seketika itu mereka berteriak sekerasnya meminta pertolongan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. حَتَّىٰٓ إِذَآ أَخَذْنَا مُتْرَفِيهِم (Hingga apabila Kami timpakan kepada orang-orang yang hidup mewah di antara mereka) Yakni orang-orang yang bergelimang dalam kenikmatan. بِالْعَذَابِ(dengan azab) Yakni azab akhirat. إِذَا هُمْ يَجْـَٔرُونَ(dengan serta merta mereka memekik minta tolong) Yakni mereka berteriak minta tolong sambil menangis keras meratapi keadaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Hingga apabila Kami timpakan azab akhirat kepada orang-orang yang hidup mewah, yaitu para pembesar dan orang-orang kaya, lantas serta merta mereka memekik minta tolong."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sehingga apabila Kami menimpakan kepada orang-orang yang hidup mewah di antara mereka} orang-orang yang hidup mewah di antara mereka {azab, maka seketika itu mereka berteriak meminta pertolongan} berteriak meminta bantuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64-65 “hingga apabila kami timpakan kepada orang-orang yang hidup mewah dari mereka,” yaitu orang-orang yang bergelimang kenikmatan, yang mereka itu tidaklah terbiasa hidup kecuali hidup dalam kemewahan, manja dan kenikmatan, tidak ada unsur keburukan yang menyergap mereka. Jika kami telah menyiksa mereka “dengan azab,” dan mereka telah merasakan dampak gesekannya “dengan serta merta mereka memekik minta tolong,” berteriak dan merintih kesakitan. Karena mereka ditimpa masalah yang menyelisihi kebiasaan yang melanda mereka. Merekapun berteriak minta tolong. Maka diserukan kepada mereka “janganlah kamu memekik minta tolong pada hari ini. Sesungguhnya kamu tiada akan mendapat pertolongan dari kami.” Jika tidak memuncul bantuan dari Allah dan sudah lenyap pertolongan dari sisiNya, maka mereka tidak akan mampu mengentaskan diri mereka dan tidak ada seorangpun yang bisa menolong mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 64: Maksudnya azab di akhirat. Yaitu orang-orang kaya dan para tokoh mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 64",
    "description": "Mereka terus-menerus larut dalam kedurhakaan, sehingga apabila kami timpakan siksaan kepada orang-orang yang hidup bermewah-mewah di antara mereka dan para pengikut mereka, seketika itu mereka berteriak-teriak meminta tolong dengan penuh kehinaan. 65-67. Menolak permintaan tolong mereka, Allah berfirman, 'janganlah kamu berteriak-teriak meminta tolong pada hari ini! sungguh, kamu tidak akan mendapat pertolongan dari kami dan tidak pula dapat menghindari siksa kami. Sesungguhnya ayat-ayat-ku, yaitu Al-Qur'an, selalu dibacakan kepada kamu, wahai para pendurhaka, supaya kamu merenungi dan mengimaninya, tetapi kamu selalu berpaling ke belakang dan enggan mendengarkannya; kamu berpaling dengan menyombong'kan diri atas kaum mukmin dan mengucapkan perkataan-perkataan keji terhadapnya, yaitu Al-Qur'an, pada waktu kamu bercakap-cakap pada malam hari."
  }
]