[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka, dikatakanlah kepada mereka, “Janganlah kalian berteriak-teriak dan jangan pula kalian meminta pertolongan pada hari ini. Sesungguhnya kalian tidak dapat menolong diri kalian dan tidak ada seorang pun yang dapat menolong kalian dari siksaan Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Maka dikatakan kepada mereka sebagai pemutus harapan mereka dari rahmat Allah, \"Janganlah kalian berteriak-teriak dan meminta tolong pada hari ini, karena sesungguhnya kalian tidak memiliki penolong yang bisa melindungi kalian dari azab Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. لَا تَجْـَٔرُوا۟ الْيَوْمَ ۖ (Janganlah kamu memekik minta tolong pada hari ini) Ketikan itu akan dikatakan kepada mereka “Janganlah kamu berteriak minta tolong pada hari ini” agar mereka menangis dan putus asa dari harapan mereka untuk mendapat pertolongan. إِنَّكُم مِّنَّا لَا تُنصَرُونَ(Sesungguhnya kamu tiada akan mendapat pertolongan dari Kami) Yakni tidak ada yang menghalangi Kami untuk mengazab kalian, dan keresahan kalian itu tidak akan bermanfaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Dikatakan kepada mereka: Janganlah kalian memekik dan minta tolong pada hari turunnya azab ini. Sesungguhnya kalian tidak akan bisa selamat dan tidak juga mendapat pertolongan dari Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah berteriak meminta tolong} janganlah berteriak dan meminta tolong {pada hari ini. Sesungguhnya kalian tidak akan mendapatkan pertolongan dari Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64-65 “hingga apabila kami timpakan kepada orang-orang yang hidup mewah dari mereka,” yaitu orang-orang yang bergelimang kenikmatan, yang mereka itu tidaklah terbiasa hidup kecuali hidup dalam kemewahan, manja dan kenikmatan, tidak ada unsur keburukan yang menyergap mereka. Jika kami telah menyiksa mereka “dengan azab,” dan mereka telah merasakan dampak gesekannya “dengan serta merta mereka memekik minta tolong,” berteriak dan merintih kesakitan. Karena mereka ditimpa masalah yang menyelisihi kebiasaan yang melanda mereka. Merekapun berteriak minta tolong. Maka diserukan kepada mereka “janganlah kamu memekik minta tolong pada hari ini. Sesungguhnya kamu tiada akan mendapat pertolongan dari kami.” Jika tidak memuncul bantuan dari Allah dan sudah lenyap pertolongan dari sisiNya, maka mereka tidak akan mampu mengentaskan diri mereka dan tidak ada seorangpun yang bisa menolong mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 65",
    "description": "65-67. Menolak permintaan tolong mereka, Allah berfirman, 'janganlah kamu berteriak-teriak meminta tolong pada hari ini! sungguh, kamu tidak akan mendapat pertolongan dari kami dan tidak pula dapat menghindari siksa kami. Sesungguhnya ayat-ayat-ku, yaitu Al-Qur'an, selalu dibacakan kepada kamu, wahai para pendurhaka, supaya kamu merenungi dan mengimaninya, tetapi kamu selalu berpaling ke belakang dan enggan mendengarkannya; kamu berpaling dengan menyombong'kan diri atas kaum mukmin dan mengucapkan perkataan-perkataan keji terhadapnya, yaitu Al-Qur'an, pada waktu kamu bercakap-cakap pada malam hari"
  }
]