[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian itu bersikap demikian lantaran menyombongkan diri di hadapan manusia tanpa alasan yang dibenarkan, dikarenakan Baitul Haram. Kalian mengatakan, “Kami adalah orang-orang yang mendiaminya, kami tidak akan kalah di dalamnya,” dan kalian mengungkapkan kata-kata buruk pada malam hari di sekitarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Kalian melakukan hal itu dengan menyombongkan diri dihadapan manusia karena kalian mengaku sebagai pemilik tanah haram (tanah yang disucikan Allah), padahal kalian tidak pantas menjadi pemiliknya, sebab pemiliknya yang hakiki adalah mereka yang bertakwa. Dan kalian begadang di malam hari membicarakannya dengan kata-kata buruk. sungguh kalian tidak memuliakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. مُسْتَكْبِرِينَ بِهِۦ (dengan menyombongkan diri terhadap Al Quran itu) Yakni mereka sombong karena tinggal di Baitul Haram; kesombongan penduduk Makkah karena keutamaan Baitul Haram yang menjadi wilayah dan tempat tinggal mereka telah diketahui banyak orang. Dahulu mereka mengatakan: tidak akan ada yang dapat mengalahkan kami, karena kami adalah penduduk dan pelayan Baitul Haram. سٰمِرًا تَهْجُرُونَ(dan mengucapkan perkataan-perkataan keji terhadapnya di waktu kamu bercakap-cakap di malam hari) Sebab mereka dahulu berkumpul di sekitar Baitul Haram untuk begadang pada malam hari sambil berbincang-bincang; dan yang paling banyak mereka perbincangkan adalah tuduhan terhadap al-Qur’an. Makna (الهجر) adalah berbicara tanpa menggunakan akal. Yakni berbicara tentang al-Quran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Dengan menyombongkan diri dengan Baitul Haram atas orang mukmin. Mereka adalah kafir Quraisy yang menyombongkan diri bahwa mereka adalah penduduk tanah haram dan penguasanya. Samirun adalah orang-orang yang berkumpul memberntuk kelompok sambil berbincang di waktu malam, mereka mengucapkan perkataan-perkataan kotor tentang Alquran dan Nabi. Assamir adalah isim jamak yang bermakna saamirina, yaitu keterangan waktu yang menerangkan bahwa mereka melakukan hal itu. Alhur adalah perkataan yang keji dan kotor. Said Bin Jabir berkata: Suku Qurays dulu berkumpul di sekeliling Ka’bah pada malam hari, mereka tidak sedang thawaf, namun mereka menyombongkan diri atas Ka’bah, sehingga turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dengan menyombongkan diri} sombong terhadap orang-orang yang ada di Baitul Haram, kalian berkata,”kami adalah penduduk Baitul Haram, dan kami tidak akan dikalahkan di sana {dan bercakap-cakap dengan perkatan buruk} kalian berbincang-bincang dengan perkataan yang buruk pada malam hari di sekeliling Ka’bah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67 “dengan menyombongkan diri terhadap al-qur’an itu dan mengucapkan perkatan-perkatan keji terhadapnya di waktu kamu bercakap-cakap di malam hari.” Para ulama tafsir menyatakan, “maknanya; mereka bersikap congkak di dalamnya. Kata ganti ketiga ini kembali kepada rumah yang sudah dimaklumi oleh orang-orang yang sedang menjadi lawan pembicaraan, atau tanah haram. Pengertiannya, mereka menunjukkan kesombongan ditengah manusia karena alasan tersebut. Mereka berdalih: kami adalah penduduk tanah Haram. Maka kami menjadi orang yang terbaik dari pada orang lain dan lebih tinggi kedudukannya. ”orang yang bercakap-cakap di malam hari,” maksudnya sekumpulan orang ada yang mengadakan pembicaraan di malam hari disekitar Ka’bah. “mengucapkan perkataan-perkataan keji,” kalian mengucapkan perkataan yang tak senonoh, maksudnya perkataan buruk tentang al-qur’an ini. Karakter orang-orang yang mendustakan, adalah memalingkan muka drainya, dan saling mengajak untuk melakukannya. “dan orang-orang kafir berkata, ‘janganlah kamu mendengar dengan sungguh-sungguh akan al-qur’an ini dan buatlah hiruk-pikuk terhadapnya, supaya kamu dapat mengalahkan (mereka),” Allah berfirman tentang mereka, ”maka apakah kamu merasa heran terhadap pemberitaan ini? Dan kamu menertawakan dan tidak menangis. Sedang kamu melengahkan(nya).” Lantaran mereka itu sarat dengan keburukan-keburukan ini, maka tidak diragukan lagi, tentulah hukuman akan menimpa mereka. Ketika mereka telah terjatuh di dalamnya, maka tidak ada seorang penolongpun yang dapat membantu mereka dan tidak ada penyelamat yang menyelamatkan mereka. Dan mereka menjadi bahan olokan atas tingkah laku mereka yang murahan ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 67: Ada yang berpendapat, bahwa maksudnya mereka menyombongkan diri dengan merasa bahwa mereka lebih berhak terhadap baitullah dan tanah haram, sedangkan selain mereka tidak berhak, sehingga mereka lebih utama daripada orang lain. Jalan yang ditempuh oleh orang-orang yang mendustakan adalah berpaling dari Al Quran dan satu sama lain saling mengingatkan agar tidak mendengarkan Al Qur’an dan menimbulkan kegaduhan ketika Al Qur’an dibacakan, lihat Fushshilat: 26. Mereka berkumpul membicarakan yang buruk, sehingga sudah sepantasnya mereka ditimpa azab, dan jika azab itu sudah datang, maka mereka tidak memiliki penolong yang menolong mereka dari azab serta ditambah mendapat celaan karena perbuatan itu seperti yang disebutkan pada ayat 64 dan 65."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 67",
    "description": "65-67. Menolak permintaan tolong mereka, Allah berfirman, 'janganlah kamu berteriak-teriak meminta tolong pada hari ini! sungguh, kamu tidak akan mendapat pertolongan dari kami dan tidak pula dapat menghindari siksa kami. Sesungguhnya ayat-ayat-ku, yaitu Al-Qur'an, selalu dibacakan kepada kamu, wahai para pendurhaka, supaya kamu merenungi dan mengimaninya, tetapi kamu selalu berpaling ke belakang dan enggan mendengarkannya; kamu berpaling dengan menyombong'kan diri atas kaum mukmin dan mengucapkan perkataan-perkataan keji terhadapnya, yaitu Al-Qur'an, pada waktu kamu bercakap-cakap pada malam hari. 68-70. Maka keberpalingan dan perlakukan para pendurhaka itu kepada ayat-ayat kami sungguh keterlaluan. Tidakkah mereka menggunakan akalnya sehingga dapat menghayati firman kami, ataukah me-reka mendustakan rasul dengan alasan telah datang kepada mereka apa yang tidak pernah datang kepada nenek moyang mereka terdahulu, yaitu risalah kenabian yang tidak dikenal oleh leluhur mereka' jelas bukan itu alasannya! risalah nabi muhamamd sama dengan risalah nabi-nabi terdahulu (lihat juga: surah al-anbiy'/21: 25). Ataukah mereka ingkar dengan dalih bahwa mereka tidak mengenal rasul mereka, yaitu nabi Muhammad, karena itu mereka mengingkarinya' ini pun bukanlah alasan yang dapat diterima karena mereka mengenal dengan baik nabi Muhammad, bahkan mereka mengakui integritasnya dengan menggelarinya 'al-amin'' atau mereka menolak dakwah nabi muhamamd dengan berkata, 'orang itu gila!'' sungguh, tuduhan itu tidak masuk akal karena mereka tahu pasti nabi Muhammad adalah orang yang paling lurus akalnya. Sebenarnya, pangkal penolakan adalah karena dia telah datang membawa kebenaran, yaitu Al-Qur'an, kepada mereka, tetapi kebanyakan mereka membenci kebenaran karena bertentangan dengan hawa nafsu dan syahwat mereka."
  }
]