[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka itu tidak mau memikirkan al-Qur’an, sehingga mereka dapat mengetahui kebenarannya, ataukah yang menghalangi mereka beriman, adalah lantaran sesungguhnya telah datang kepada mereka seorang rasul dan kitab yang tidak pernah mendatangi bapak-bapak mereka dahulu hal yang serupa, lalu mereka pun mengingkari dan berpaling darinya Karena itu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Maka tidakkah orang-orang musyrik itu menghayati ayat-ayat Al-Qur`ān yang diturunkan Allah agar mereka beriman padanya dan mengamalkan kandungannya, atau apakah telah datang kepada mereka sesuatu yang tidak pernah datang kepada nenek moyang mereka terdahulu lalu mereka berpaling darinya dan mendustakannya?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68-70. Allah mengingkari perbuatan orang-orang musyrik dengan berbagai cara: “Tidakkah mereka menghayati al-Qur’an agar mereka dapat memahami dan mengimaninya? Apakah telah datang kepada mereka rasul dan al-Qur’an yang tidak ada di masa nenek moyang mereka? Apakah mereka tidak mengetahui sifat-sifat rasul mereka sehingga mereka mengingkarinya? Ataukah mereka berkata Muhammad adalah orang gila? Dan sesungguhnya tidak seperti apa yang mereka katakan, karena Muhammad telah datang kepada mereka dengan kebenaran yang Allah wahyukan kepadanya, dan kebanyakan mereka membenci kebenaran ini karena menyelisihi hawa nafsu mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. أَفَلَمْ يَدَّبَّرُوا۟ الْقَوْلَ (Maka apakah mereka tidak memperhatikan perkataan (Kami)) Yakni al-Qur’an. Andai saja mereka memperhatikan makna-makna yang dikandungnya niscaya akan jelas bagi mereka kebenarannya dan mereka akan beriman kepadanya. أَمْ جَآءَهُم مَّا لَمْ يَأْتِ ءَابَآءَهُمُ الْأَوَّلِينَ(atau apakah telah datang kepada mereka apa yang tidak pernah datang kepada nenek moyang mereka dahulu?) Sehingga hal itu menjadi sebab keingkaran mereka terhadap al-Qur’an? Andai saja mereka berfikir, niscaya mereka akan mengerti bahwa al-Qur’an adalah suatu kebaikan yang diistimewakan bagi mereka yang tidak didapat oleh nenek moyang mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Maka, apakah mereka tidak memperhatikan Alquran yang telah menunjukkan kebenaran Nabi , juga berfikir bahwa memang itu adalah kebenaran yang turun dari Tuhan mereka? Fungsi am adalah untuk melanjutkan celaan satu ke celaan berikutnya. Atau apakah telah datang kepada mereka seorang rasul atau kitab yang bahkan tidak pernah datang kepada nenek moyang mereka dahulu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak merenungkan firman (Allah)} merenungkan Al-Qur’an {atau apakah telah datang kepada mereka apa yang tidak pernah datang kepada nenek moyang mereka terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68 “maka apakah mereka tidak memperhatikan perkataan(kami),” maksudnya, tidakkah mereka memikirkan al-qur’an, mencermati dan merenunginya. Maksudnya, bila mereka mau merenunginya, niscaya akan mendatangkan keimanan bagim mereka dan menahan mereka dari kekufuran. Akan tetapi, musibah itulah yang menimpa mereka, karena sikap p[enyimpangan mereka drainya. Ini mengindisikan bahwa tadabur al-qur’an akan mengajak kepada kebaikan dan memelihara dari segala kejahatan. Alasan yang menghalangi mereka untuk bertadabbur al-qur’an, adalah keberadaan gembok-gembok (yang mengunci) pada hati mereka. “ataukah telah datang kepada mereka sesuatu yang tidak pernah datang kepada nenek moyang mereka dahulu,” maksudnya apakah faktor yang menghalangi mereka untuk beriman kepada al-qur’an, sebab ada rasul dan kitab yang datang kepada mereka, yang tidak mendatangi nenek moyang mereka. Hingga mereka lebih suka mengikuti jalan nenek moyang mereka yang sesat dan menolak segala yang bertentangan dengannya. Oleh karena itu, mereka dan orang-orang yang serupa mdengan mereka dari kalangan orang-orang kafir berkata sebagaimana telah diberitahukan oleh Allah tentang merteka, ”dan demikianlah,kami tidak mengutus sebelum kamu seorang pemberi peringatan pun dalam suatu negeri, melainkan (pasti) orangt-orang yang hidup mewah di negeri itu berkata, ‘sesungguhnya kami mendapati bapak-bapak kami menganut suatu gama dan sesungguhnya kami mengikuti jejak-jejak mereka.” Maka sang rasul menyanggah mereka dengan berkata, ”(rasul itu) berkata,’apakah (kamu akan mengikuti juga) sekalipun aku membawa untukmu (agama) yang lebih (nyata) memberi petunjuk daripada apa yang kamu dapati bapak-bapakmu menganutnya?” tidakkah kalian mau mengikutinya, kalau memang memotivasi kalian adalah kebenaran? Selanjutnya, mereka menjawab dengan jawaban yang membuka kedok watak mereka, “mereka menjawab,’sesungguhnya kami mengingkari agama yang kamu diutus untuk menyampaikannya’.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 68: Yang menunjukkan kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam. Sesungguhnya jika mereka mau mentadabburi, maka mereka tentu akan beriman, akan tetapi musibahnya adalah mereka berpaling darinya. Ayat ini menunjukkan, bahwa mentadabburi Al Qur’an akan membawa seseorang kepada kebaikan dan melindungi dari keburukan, dan tidak ada yang menghalangi mereka untuk mentadabburinya melainkan karena hati mereka terkunci. Yakni apakah yang menghalangi mereka beriman karena mereka kedatangan rasul dan kitab yang tidak datang kepada nenek moyang mereka, lalu mereka lebih ridha menempuh jalan nenek moyang mereka dan menentang semua yang datang menyelisihinya, sehingga mereka mengatakan seperti yang Allah beritakan, “Dan Demikianlah, Kami tidak mengutus sebelum kamu seorang pemberi peringatan pun dalam suatu negeri, melainkan orang-orang yang hidup mewah di negeri itu berkata, \"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama dan sesungguhnya kami adalah pengikut jejak-jejak mereka\".-- (Rasul itu) berkata, \"Apakah (kamu akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih (nyata) memberi petunjuk daripada apa yang kamu dapati bapak-bapakmu menganutnya?\" Mereka menjawab, \"Sesungguhnya kami mengingkari agama yang kamu diutus untuk menyampaikannya.\" (Terj. Az Zukhruf: 23-24)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 68",
    "description": "68-70. Maka keberpalingan dan perlakukan para pendurhaka itu kepada ayat-ayat kami sungguh keterlaluan. Tidakkah mereka menggunakan akalnya sehingga dapat menghayati firman kami, ataukah me-reka mendustakan rasul dengan alasan telah datang kepada mereka apa yang tidak pernah datang kepada nenek moyang mereka terdahulu, yaitu risalah kenabian yang tidak dikenal oleh leluhur mereka' jelas bukan itu alasannya! risalah nabi muhamamd sama dengan risalah nabi-nabi terdahulu (lihat juga: surah al-anbiy'/21: 25). Ataukah mereka ingkar dengan dalih bahwa mereka tidak mengenal rasul mereka, yaitu nabi Muhammad, karena itu mereka mengingkarinya' ini pun bukanlah alasan yang dapat diterima karena mereka mengenal dengan baik nabi Muhammad, bahkan mereka mengakui integritasnya dengan menggelarinya 'al-amin'' atau mereka menolak dakwah nabi muhamamd dengan berkata, 'orang itu gila!'' sungguh, tuduhan itu tidak masuk akal karena mereka tahu pasti nabi Muhammad adalah orang yang paling lurus akalnya. Sebenarnya, pangkal penolakan adalah karena dia telah datang membawa kebenaran, yaitu Al-Qur'an, kepada mereka, tetapi kebanyakan mereka membenci kebenaran karena bertentangan dengan hawa nafsu dan syahwat mereka"
  }
]