[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka barangsiapa mencari kenikmatan dengan selain istri atau budak perempuannya, maka dia termasuk orang-orang yang melakukan tindakan melampaui batas yang halal menuju yang haram. Dan sesungguhnya dia telah menghadapkan dirinya pada ancaman siksaan Allah dan kemurkaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Namun, barangsiapa mencari kenikmatan melalui hubungan badan dengan selain istri-istri atau hamba sahaya wanita yang ia miliki, maka ia telah melampaui batasan Allah karena meninggalkan yang halal dan menggantinya dengan yang haram."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَمَنِ ابْتَغَىٰ وَرَآءَ ذٰلِكَ فَأُو۟لٰٓئِكَ هُمُ الْعَادُونَ (Barangsiapa mencari yang di balik itu maka mereka itulah orang-orang yang melampaui batas) Yakni barangsiapa yang melakukannya terhadap selain istri dan budak wanita mereka maka ia adalah orang yang melampaui batas, zalim, dan berdosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Barangsiapa menghendaki di luar isteri dan budak perempuan itu maka mereka itulah orang-orang yang melampaui batas aturan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka siapa saja yang mencari selain itu} mencari kenikmatan selain istri-istri dan hamba sahaya {mereka itulah orang-orang yang melampaui batas} orang-orang yang melewati batas-batas yang dihalalkaan Allah bagi mereka menuju hal yang diharamkan atas mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Barangsiapa mencari yang dibalik itu,” selain istri dan budak wanita, “maka mereka itulah orang-orang yang melampaui batas,” yang telah melewati batasan yang sudah Allah halalkan menuju tindakan yang diharamkan, yang nekad melanggar larangan-larangan Allah. Muatan umum ayat ini, menandakan tentang pengharaman [pernikahan] mut’ah. Sesungguhnya si wanita (dalam pernikahan mut’ah) bukan istri (si lelaki) dengan sebenarnya, yang ditunjukan untuk hidup bersama dan juga bukan budak yang dimilki, serta menunjukan pengharaman pernikahan untuk menghalalkan untuk menghalalkan (istri yang sudah ditalak tiga). Sedangkan Firman Allah ”Atau budak yang mereka miliki,” menunjukan bahwa disyaratkan dalam penghalalan budak wanita, yaitu hendaknya budak itu merupakan hak miliknya secara utuh. Jika hak kepemilikannya atas budak tersebut hanya separuh, maka belum halal (baginya). Wanita itu (masih) bukan termasuk yang berada dalam kepemilikannya, akan tetapi ia berada dibawah hak kepemilikan lelaki itu dan orang lain. Maka itu sebagaimana tidak diperbolehkan adanya seorang wanita meredeka yang dimilki oleh dua orang lelaki secara bersamaan. Demikian pula, seorang budak wanita tidak boleh dimiliki oleh dua majikan secara bersamaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 7: Maksudnya, selain istri dan budak. Keumuman ayat ini menunjukkan haramnya nikah mut’ah, karena wanita itu bukan istrinya yang hakiki yang maksudnya adalah tetap langgeng."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 7",
    "description": "5-7. Dan selain orang-orang yang disebut pada ayat-ayat sebelumnya, berbahagialah orang yang memelihara kemaluannya dan tidak menya-lurkan kebutuhan biologisnya melalui hal dan cara yang tidak dibe-narkan, kecuali terbatas dalam melakukannya terhadap pasangan-pasangan mereka atau hamba sahaya yang mereka miliki; maka sesungguhnya mereka dalam menyalurkan kebutuhan biologis terhadap pasangan dan budak mereka itu tidak tercela, selama mereka tidak melanggar ketentuan yang ditetapkan oleh agama. Tetapi, barang siapa mencari pelampiasan hawa nafsu di balik itu, di antaranya dengan berbuat zina, maka mereka itulah orang-orang yang melampaui batas ajaran agama dan moral, sehingga pantas menerima celaan atau siksa. 8. Perkawinan adalah amanat, maka setiap orang harus memeliharanya dengan baik. Meski begitu, tidak hanya amanat perkawinan yang harus dipelihara, melainkan semua amanat. Dan beruntunglah orang yang memelihara amanat-amanat yang dipikulkan atas mereka dan memelihara janjinya yang dijalin dengan pihak lain."
  }
]