[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apakah mereka menyangkanya seorang yang gila? Sungguh, mereka telah berdusta. Sebab dia datang, kepada mereka dengan membawa al-Qiur’an, perintah bertauhid dan agama yang lurus. Dan kebanyakan dari mereka membenci kebenaran, lantaran kedengkian dan dorongan bertindak melampaui batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Bahkan mereka mengatakan, \"Dia itu (Muhammad) orang gila,\" Sungguh mereka telah berdusta. Sesungguhnya dia datang kepada mereka membawa kebenaran yang tidak ada keraguan padanya bahwa itu berasal dari Allah. Kebanyakan dari mereka membenci dan tidak menyukai kebenaran lantaran sifat hasad yang ada dalam diri mereka, dan sifat fanatik buta terhadap kebatilan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. أَمْ يَقُولُونَ بِهِۦ جِنَّةٌۢ ۚ (Atau (apakah patut) mereka berkata: “Padanya (Muhammad) ada penyakit gila”) Padahal mereka mengetahui bahwa Rasulullah adalah orang yang memiliki akal yang paling lurus. بَلْ جَآءَهُم بِالْحَقِّ(Sebenarnya dia telah membawa kebenaran kepada mereka) Yakni membawa agama yang lurus. وَأَكْثَرُهُمْ لِلْحَقِّ كٰرِهُونَ(dan kebanyakan mereka benci kepada kebenaran itu) Sebab mereka memiliki sikap fanatik terhadap keyakinan mereka. Dan orang yang paling lunak dari mereka tidak membenci kebenaran, namun mereka tidak menunjukkan keimanan mereka karena takut terhadap orang-orang yang membenci kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Atau apakah patut mereka berkata: \"Muhammad mempunyai penyakit gila\". Padahal mereka juga sudah tahu bahwa Nabi adalah orang yang paling cerdas. Namun itu tidak lain bermaksud membantah agama dan kitab Alquran yang Nabi bawa.Sebenarnya dia telah membawa kebenaran kepada mereka, dan kebanyakan mereka benci kepada kebenaran itu, karena bertentangan dengan nafsu dan syahwat mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau mereka berkata bahwa dia itu gila} gila {Padahal dia telah datang membawa kebenaran kepada mereka. Kebanyakan mereka terhadap kebenaran itu membenci"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70 “atau (apakah patut) mereka berkata,’padanya (Muhammad) ada penyakit gila’,” maksudnya kegilaan, sehingga mengatakan hal demikian. Omongan orang gila tidak bisa didengarkan perkataannya tidak bisa dijadikan pedoman. Karena ia mengigau dengan ucapan yang batil dan omongan yang tolol. Allah berfirman dalam rangka membantah omongan mereka, ”sebenarnya dia telah membawa kebenaran kepada mereka,” dengan perkara yang teguh, yang merupakan murni kejujuran, keadilan, tanpa ada unsur perbedaan dan kontradiktif. Bagaimana bisa orang yang mengembannya sedang kerasukan jin? Bukankah dia tidak berada melainkan (pasti) pada level kesempurnaan tertinggi, dari sudut ilmu, kematangan akal dan budi pekerti yang luhur? Sesungguhnya disini terdapat pengalihan pembicaraan dari focus sebelumnya. Yaitu, sebenarnya, faktor yang menahan langkah mereka untuk beriman, bahwasannya, “telah datang kebenaran kepada mereka, dan kebanyakan mereka benci kepada kebenaran,” yaitu kebenaran paling agung yang mendatangi mereka, kemurnian ibadah bagi Allah semata dan meninggalkan sesembahan selain Allah. Sungguh, Allah telah mengetahui kebencian mereka pada perkara ini dan pandangan antipasti mereka kepadanya. Kenyataan bahwa Rasulullah membawa kebenaran, sementara mereka pada dasarnya membenci kebenaran tersebut, itulah faktor yang membuat mereka memdustakan kebenaran. Bukan lantaran keragu-raguan ataupun pendustaan terhadap Rasullah. Sebagaimana Firman Allah, ”karena sebenarnya mereka tidak mendustakan kamu, akan tetapi orang-orang yang zhalim itu mengingkari ayat-ayat Allah,”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 70: Yaitu Al Qur’an yang di dalamnya menerangkan tauhid dan ajaran-ajaran yang mulia yang dibenarkan oleh akal yang sehat dan fitrah yang selamat. Lantas, mengapa Beliau disebut orang gila? Padahal Beliau berada di atas ketinggian dalam hal ilmu, akal dan akhlak mulia. Inilah alasan mereka menolak kebenaran, yaitu benci kepada kebenaran. Kebenaran yang paling agung adalah beribadah hanya kepada Allah saja dan meninggalkan sesembahan selain Allah. Oleh karenanya, ketika mereka diajak kepadanya, mereka merasa heran dan berkata, “Mengapa ia menjadikan tuhan-tuhan itu Tuhan yang satu saja? Sesungguhnya ini benar-benar suatu hal yang sangat mengherankan.” (Terj. Shaad: 5)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 70",
    "description": "68-70. Maka keberpalingan dan perlakukan para pendurhaka itu kepada ayat-ayat kami sungguh keterlaluan. Tidakkah mereka menggunakan akalnya sehingga dapat menghayati firman kami, ataukah me-reka mendustakan rasul dengan alasan telah datang kepada mereka apa yang tidak pernah datang kepada nenek moyang mereka terdahulu, yaitu risalah kenabian yang tidak dikenal oleh leluhur mereka' jelas bukan itu alasannya! risalah nabi muhamamd sama dengan risalah nabi-nabi terdahulu (lihat juga: surah al-anbiy'/21: 25). Ataukah mereka ingkar dengan dalih bahwa mereka tidak mengenal rasul mereka, yaitu nabi Muhammad, karena itu mereka mengingkarinya' ini pun bukanlah alasan yang dapat diterima karena mereka mengenal dengan baik nabi Muhammad, bahkan mereka mengakui integritasnya dengan menggelarinya 'al-amin'' atau mereka menolak dakwah nabi muhamamd dengan berkata, 'orang itu gila!'' sungguh, tuduhan itu tidak masuk akal karena mereka tahu pasti nabi Muhammad adalah orang yang paling lurus akalnya. Sebenarnya, pangkal penolakan adalah karena dia telah datang membawa kebenaran, yaitu Al-Qur'an, kepada mereka, tetapi kebanyakan mereka membenci kebenaran karena bertentangan dengan hawa nafsu dan syahwat mereka. 71. Ayat sebelumnya mengisyaratkan bahwa kaum kafir ingin hawa nafsu mereka dituruti. Dengan tegas Allah menolak keinginan itu, 'dan seandainya kebenaran itu menuruti keinginan mereka yang penuh kebatilan dan mengabaikan kebenaran, pasti binasalah langit dan bumi dan semua yang ada di dalamnya. Rusaklah keteraturan sistemnya karena kejahatan akan merajalela, penindasan orang yang kuat kepada yang lemah, dan sebagainya. Bahkan, sebenarnya kami telah memberikan Al-Qur'an yang berisi peringatan, kebanggaan, dan kemuliaan kepada mereka, tetapi mereka berpaling dari peringatan itu."
  }
]