[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya Allah menetapkan ajaran syariat bagi mereka apa-apa yang sejalan dengan hawa nafsu keinginan mereka, pastilah akan rusak berantakan langit dan bumi dan semua yang ada di dalamnya. Bahkan Kami telah datangkan kepada mereka sesuatu yang akan mengangkat gengsi dan kemuliaan mereka, yaitu al-Qur’an, tetapi mereka berpaling darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan seandainya Allah mengatur dan menjalankan seluruh urusan berdasarkan hawa nafsu mereka, niscaya langit dan bumi serta segala yang ada pada keduanya akan hancur binasa lantaran kejahilan mereka terhadap akibat amal perbuatan mereka dan terhadap betul tidaknya suatu urusan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Seandainya sunnatullah berlaku sebagaimana yang orang-orang kafir inginkan, niscaya tujuh langit dan bumi serta segala isinya akan hancur. Dan Kami telah memberi mereka al-Qur’an yang mengandung kemuliaan dan kejayaan mereka, akan tetapi mereka berpaling dan menyia-nyiakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَلَوِ اتَّبَعَ الْحَقُّ أَهْوَآءَهُمْ (Andaikata kebenaran itu menuruti hawa nafsu mereka) Yakni seandainya kebenaran datang sesuai dengan yang mereka inginkan. لَفَسَدَتِ السَّمٰوٰتُ وَالْأَرْضُ وَمَن فِيهِنَّ ۚ( pasti binasalah langit dan bumi ini, dan semua yang ada di dalamnya) Makna ayat ini adalah seandainya kebenaran adalah seperti apa yang mereka katakan, yaitu terdapat tuhan-tuhan selain Allah niscaya tuhan-tuhan itu akan saling berselisih. Ayat ini seperti firman Allah yang lain: لو كان فيهما آلهة إلا الله لفسدتا “sekiranya di langit dan di bumi ada tuhan-tuhan selain Allah tentulah keduanya itu telah rusak” بَلْ أَتَيْنٰهُم بِذِكْرِهِمْ(Sebenarnya Kami telah mendatangkan kepada mereka kebanggaan mereka) Yakni mendatangkan kitab yang mereka banggakan dan agungkan. Pendapat lain mengatakan yang dimaksud dengan (الذكر) adalah nasehat dan peringatan. فَهُمْ عَن ذِكْرِهِم مُّعْرِضُونَ(tetapi mereka berpaling dari kebanggaan itu) Yakni mereka melalaikan apa yang mereka agung-agungkan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Andaikata kebenaran itu menuruti hawa nafsu mereka, serta Alquran itu menuruti kesenangan mereka, pasti binasalah langit dan bumi dan segala penghuninya. Sebab segala sesuatu keluar dari fitrah dan aturan. Sebenarnya Kami telah mendatangkan kepada mereka kebanggaan mereka yaitu Alquran, tetapi mereka berpaling dari kebanggaan itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya kebenaran itu menuruti} sesuai {keinginan mereka, niscaya hancurlah langit dan bumi serta semua yang ada di dalamnya. Bahkan Kami telah mendatangkan peringatan mereka} sesuatu yang di dalamnya terdapat kehormatan dan kemuliaan mereka yaitu Al-Qur’an {dan mereka terhadap peringatan itu berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71 jika ada lontaran pertanyaan, ”kenapa kebenaran itu tidak selaras saja dengan apa yang mereka inginkan, agar mereka mau beriman atau cepat tunduk patuh?” maka Allah menjawab dengan Firman,” Andaikata kebenaran itu menuruti hawa nafsu mereka berhubungan dengan moral dan tindak-tanduk yang mengandung unsur kezhaliman, kekufuran, dan kerusakan. Seandainya kebenaran menuruti hawa nafsu mereka, niscaya langit dan bumi akan mengalami kerusakan, karena kerusakan penanganan dan sistem pengaturan yang berasaskan kezhaliman dan ketidakadilan. Langit dan bumi tidak akan tegak berdiri kecuali dengan kebenaran dan keadailan. “sebenarnya kami telah mendatangkan kepada mereka kebanggaan mereka,” yaitu dengan al-qur’an ini yang mengingatkan kepada mereka pada setiap kebaikan, yang menjadi sumber kebanggan dan prestise mereka ketika mereka melaksanakannya, dan dengan al-qur’an pula, mereka akan menjadi tokoh-tokoh besar di tengah manusia. “tetapi mereka berpaling dari kebanggan itu,” sebagai ketetapan kebinasaan dan ketiadaan taufik (Allah) pada mereka. “mereka lupa kepada Allah, lalau Allah menjadikan mereka lupa kepada diri mereka sendiri,” Al-qur’an dan orang yang membawanya merupakan kenikmatan agung yang Allah sodorkan kepada mereka. Mereka tidak meresponnya melainkan dengan penolakan dan sikap berpaling. Apakah ada keterpasungan dari pahala yang lebih fatal darinya? Tidaklah hal itu berakibat kecuali kerugian yang parah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 71: Jika seorang bertanya, “Mengapa kebenaran itu tidak selalu sesuai dengan keinginan mereka agar mereka beriman dan segera tunduk?” Maka jawabannya adalah ayat di atas. Bagaimana tidak binasa dan hancur jika yang satu berkeinginan begini, sedangkan yang satu lagi berkeinginan begitu. Di samping itu, hawa nafsu atau keinginan mereka cenderung untuk bersenang-senang tidak memperhatikan maslahat kedepan, pengetahuan mereka terbatas, bahkan nafsu itu biasanya menyuruh kepada kejahatan dan kezaliman, kecuali nafsu yang diberi rahmat oleh Allah. Oleh karena itu, jika kebenaran itu menuruti keinginan mereka tentu hancurlah dunia. Ada pula yang mengartikan, “Bahkan Kami telah mendatangkan kepada mereka kebanggaan dan kemuliaan (Al Quran) mereka tetapi mereka berpaling dari kebanggaan itu.” Sehingga maksudnya, jika mereka mau mengikuti Al Qur’an, maka keadaan mereka menjadi tinggi, mulia dan terhormat. Al Qur’an merupakan nikmat besar yang Allah berikan kepada hamba-Nya, namun mereka membalasnya dengan menolak dan berpaling, maka bukannya mereka menjadi tinggi dan terhormat, bahkan menjadi rendah dan terhina, lagi memperoleh kerugian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 71",
    "description": "Ayat sebelumnya mengisyaratkan bahwa kaum kafir ingin hawa nafsu mereka dituruti. Dengan tegas Allah menolak keinginan itu, 'dan seandainya kebenaran itu menuruti keinginan mereka yang penuh kebatilan dan mengabaikan kebenaran, pasti binasalah langit dan bumi dan semua yang ada di dalamnya. Rusaklah keteraturan sistemnya karena kejahatan akan merajalela, penindasan orang yang kuat kepada yang lemah, dan sebagainya. Bahkan, sebenarnya kami telah memberikan Al-Qur'an yang berisi peringatan, kebanggaan, dan kemuliaan kepada mereka, tetapi mereka berpaling dari peringatan itu. 72. Allah telah menyebutkan empat alasan penolakan orang kafir terhadap dakwah nabi beserta sanggahan atas keempatnya. Pada ayat ini Allah lalu menyebut alasan kelima. Atau-kah mereka menolak dakwahmu, wahai nabi Muhammad, karena engkau meminta imbalan kepada mereka atas dakwahmu, sedangkan engkau yakin bahwa imbalan dari tuhanmu lebih baik, karena dia pemberi rezeki yang terbaik' tidak! engkau tidak pernah berbuat demikian."
  }
]