[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah yang menghalangi mereka beriman, lantaran kamu (wahai Rasul) meminta upah atas seruan dakwahmu kepada mereka, sehingga mereka pun kikir? Kamu tidak pernah meminta apa pun. Sesungguhnya apa yang ada di sisi Allah berupa pahala dan limpahan karunia (Nya) itu lebih baik. Dan Dia sebaik-baik Pemberi rizki, maka tidak ada seorang pun yang mampu memberikan rizki seperti rizki Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Apakah engkau -wahai Rasul- meminta imbalan dari mereka sebagai balasan penyampaian kebenaran yang engkau bawa, sehingga mereka menolak dakwahmu? Sungguh ini tidaklah engkau lakukan, sebab pahala dan balasan kebaikan dari Tuhanmu lebih baik dari pada ganjaran kebaikan mereka dan selain mereka, karena Dia sebaik-baik pemberi rezeki."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72-74. Apakah kamu meminta upah dari mereka atas risalah yang kamu sampaikan, namun mereka enggan memberi upah sehingga mereka tidak mau beriman? Sungguh pemberian Allah kepadamu lebih baik, karena Dia sebaik-baik yang memberi dan yang paling pemurah dalam memberi rezeki. Hai Rasulullah, sungguh kamu sedang menyeru kaummu kepada agama Islam, dan orang-orang yang tidak beriman kepada hari kiamat telah berpaling dari jalan yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. أَمْ تَسْـَٔلُهُمْ خَرْجًا (Atau kamu meminta upah kepada mereka?) Yakni apakah hal yang menghalangi mereka dari keimanan adalah karena mereka mengira kamu akan meminta upah kepada mereka atas risalah yang kamu sampaikan kepada mereka, sehingga mereka tidak beriman kepadamu dan kepada apa yang kamu datangkan kepada mereka; namun sebenarnya mereka mengetahui kamu tidak meminta upah dari mereka, bahkan sedekah diharamkan atas Rasulullah agar tidak ada orang yang berkata bahwa rasulullah mengaku-ngaku mendapat risalah untuk mendapatkan harta. فَخَرَاجُ رَبِّكَ خَيْرٌ ۖ( maka upah dari Tuhanmu adalah lebih baik) Yakni rezeki yang Allah karuniakan kepadamu di dunia dan pahala yang Allah berikan kepadamu di akhirat lebih baik bagimu dari pada upah dari mereka itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. “Atau kalian akan meminta upah kepada mereka, sebagai imbalan menyampaikan risalah?\", maka upah dari Tuhanmu adalah lebih baik, dan Dia adalah Pemberi rezeki dan pemberi pahala Yang Paling Baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah kamu meminta imbalan} imbalan {kepada mereka. dan imbalan dari Tuhanmu} dan pahala dan imbalan Allah {itu lebih baik karena Dia sebaik-baik pemberi rezeki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72 Maksudnya, ataukah perkara yang menghalangi mereka untuk mengikutimu adalah karena engkau Muhammad, meminta upah kepada mereka atas penyambutan yang baik (terhadap seruanmu)? “maka mereka diberati dengan hutang?,mereka merasa berat untuk mengikutimu karena upah dan pajak yang kamu pungut dari mereka. Padahal kenyataannya tidak demikian adanya. “maka upah dari Rabbmu adalah lebih baik, dan Dia adalah pemberi rizki yang paling baik,” ini seperti pernyataan para nabi kepada umat-umat mereka, ”Hai kaumku, aku tidak meminta upah kepadamu bagi seruanku. Upahku tidak lain, hanyalah dari Allah yang telah menciptakanku.” maksudnya mereka tidak menjalankan dakwah kepada umat manusia karena adanya antusiasme mendapatkan harta dari mereka. Para nabi berdakwah hanya bertujuan untuk memberikan nasihat dan mendatangkan kemaslahatan bagi mereka. Bahkan para rasul adalah orang yang paling berniat tulus untuk memperbaiki umat manusia daripada mereka sendiri. Semoga Allah membalas mereka dengan kebaikan terbaik atas nama umat-umat mereka, dan memberikan karunia kepada kita untuk mengikuti mereka dalam segala kondisi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 72: Maksudnya, apakah yang menghalangi mereka untuk mengikutimu adalah karena engkau meminta imbalan dari mereka? Padahal engkau tidak meminta imbalan dari mereka. Dengan demikian, mereka tidak memiliki alasan yang dapat dipertanggungjawabkan untuk menolak yang hak. Yang dimaksudkan imbalan dari Allah adalah rezeki yang dianugrahkan Allah di dunia, dan pahala di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 72",
    "description": "Allah telah menyebutkan empat alasan penolakan orang kafir terhadap dakwah nabi beserta sanggahan atas keempatnya. Pada ayat ini Allah lalu menyebut alasan kelima. Atau-kah mereka menolak dakwahmu, wahai nabi Muhammad, karena engkau meminta imbalan kepada mereka atas dakwahmu, sedangkan engkau yakin bahwa imbalan dari tuhanmu lebih baik, karena dia pemberi rezeki yang terbaik' tidak! engkau tidak pernah berbuat demikian. 73-75. Dan sesungguhnya engkau pasti telah menyeru mereka kepada jalan yang lurus. Orang-orang kafir itu menolak seruan nabi karena mereka tidak meyakini adanya hari pembalasan. Dan sesungguhnya orang-orang yang tidak beriman kepada akhirat benar-benar telah menyimpang jauh dari jalan yang lurus menuju jalan kesesatan. Tidak ada jalan menuju kebahagiaan selain jalan Allah. Allah mengazab dan membinasakan mereka akibat bersikap keras kepala. Namun, seandainya mereka kami kasihani, dan kami lenyapkan malapetaka yang menimpa mereka, pasti mereka akan terus-menerus terombang-ambing dalam kesesatan mereka. Mereka akan tetap pada kekufuran dan kedurhakaan mereka seperti sediakala."
  }
]