[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kamu (wahai Rasul) benar-benar menyeru kaummu dan orang-orang lain kepada agama yang lurus, yaitu agama Islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Dan sesungguhnya- engkau wahai- Rasul, pasti menyeru mereka dan selain mereka ke jalan yang lurus, yang tidak ada penyimpangan di dalamnya, yaitu jalan Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Sesungguhnya kamu wahai Nabi, benar-benar hanya menyeru mereka kepada jalan yang lurus yaitu agama Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kamu benar-benar menyeru mereka ke jalan} jalan {yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73-74 Dalam ayat-ayat yang mulia ini, Allah menyebutkan semua faktor yang mendatangkan keimanan dan menerangkan hal-hal yang menghalanginya. Allah menjelaskan sisi kerusakannya, satu persatu. Diantara faktor penghalang yang disebutkan, yaitu hati mereka berada dalam kesesatan, mereka tidak merenungi al-qur’an dengan alasan ingin mengikuti nenek moyang mereka. Mereka berdalih bahwa terdapat kegilaan pada Rasulullah, sebagaimana tertuang pada keterangan sebelumnya. Sementara faktor-faktor yang menghidupkan keimanan, seperti tadabbur (merenungi) al-qur’an,menerima kenikmatan Allah dengan tulus, mengenal sosok Rasulullah, Muhammad dan kesempurnaan kejujuran serta manahnya, beliau tidak meminta upah kepada mereka atas dakwah yang beliau jalankan. Justru, usaha beliau semata-mata untuk kemanfaatan dan kebaikan mereka. Jalan yang beliau serukan kepada mereka merupakan jalan yang lurus, mudah ditapaki bagi orang-orang yang mengamalkannya karena kestabilannya, mengantarakan kepada tujuan yang ingin dicapai melalui jalur pintas, merupakan agama yang hanif (lurus sesuai dengan fitrah) lagi samhah (mudah). Hanif dalam ketauhidan dan samhah dalam amalan. Seruanmu kepada mereka menuju jalan yang lurus menjadi pendorong bagi orang yang menginginkan kebenaran untuk mengikutimu. Pasalnya, kebenaran itu, termasuk yang dapat dibuktikan aspek kebaikan dan keselarasnnya oleh akal-akal sehat dan fitrah yang lurus. Kemanakah arah yang mereka tuju, bila tidak mengikutimu? Mereka tidak mempunyai pegangan yang cukup dan memadai bagi mereka untuk tidak mengikutimu. Sesungguhnya mereka “dari jalan (yang lurus),” berpaling lagi menjauhkan diri, membelok dari lintasan yang mengantarkan mereka kepada Allah dan tempat kemuliaanNya. Tidaklah ada yang mereka miliki melainkan bermacam-macam kesesatan dan kebodohan. Demikianlah ciri khasorang yang berlawanan dengan kebenaran, mereka pasti mengalami penyimpangan di setiap aspek kehidupannya. Allah berfirman ”maka jika mereka tidak menjawab (tantanganmu), ketauhilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu mereka (belaka). Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah sedikitpun?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 73: Di ayat-ayat sebelumnya Allah Subhaanahu wa Ta'aala menyebutkan sebab-sebab yang mengharuskan mereka untuk beriman, demikian pula menyebutkan penghalangnya serta menerangkan batilnya penghalang tersebut satu persatu. Dia menerangkan, bahwa diri mereka yang jahil yang menyebabkan mereka tidak memahami Al Qur’an, tidak mau memikirkan isi Al Qur’an, mengikuti nenek moyang mereka yang salah, ditambah dengan mengatakan kata-kata yang keji terhadap rasul mereka. Selanjutnya, Allah menyebutkan perkara-perkara yang dapat membuat mereka beriman, yaitu mentadaburi Al Qur’an, menerima nikmat Allah, melihat pribadi rasul-Nya Muhammad shallallahu 'alaihi wa sallam, dan bahwa Beliau sama sekali tidak meminta upah atas seruannya, bahkan ajakan Beliau manfaat dan maslahatnya untuk mereka, dan bahwa Beliau mengajak mereka ke jalan yang lurus, mudah ditempuh oleh semua orang, menyampaikan kepada maksud dan tujuan, lurus dalam ‘aqidahnya dan mudah diamalkan. Seruannya kepada mereka ke jalan yang lurus mengharuskan orang yang menginginkan yang hak untuk mengikutinya, karena kebenarannya didukung oleh akal dan fitrah serta sejalan dengan maslahat. Oleh karena itu, jalan manakah yang mereka tempuh jika tidak mengikuti orang yang berada di atas jalan yang lurus? Jelas sekali, jika mereka menempuh jalan selainnya, maka mereka telah menyimpang dari jalan yang lurus sehingga mereka tersesat. Yaitu agama Islam, di mana jika diamalkan ajaran-ajarannya, maka akan dapat menyampaikan seseorang kepada Allah dan kepada surga-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 73",
    "description": "73-75. Dan sesungguhnya engkau pasti telah menyeru mereka kepada jalan yang lurus. Orang-orang kafir itu menolak seruan nabi karena mereka tidak meyakini adanya hari pembalasan. Dan sesungguhnya orang-orang yang tidak beriman kepada akhirat benar-benar telah menyimpang jauh dari jalan yang lurus menuju jalan kesesatan. Tidak ada jalan menuju kebahagiaan selain jalan Allah. Allah mengazab dan membinasakan mereka akibat bersikap keras kepala. Namun, seandainya mereka kami kasihani, dan kami lenyapkan malapetaka yang menimpa mereka, pasti mereka akan terus-menerus terombang-ambing dalam kesesatan mereka. Mereka akan tetap pada kekufuran dan kedurhakaan mereka seperti sediakala"
  }
]