[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami telah menguji mereka dengan berbagai macam musibah, namun mereka tidaklah tunduk kepada Tuhan mereka, dan tidak memohon kepadaNya dengan penuh khusyu’ ketika musibah itu datang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Dan sungguh Kami telah menguji mereka dengan berbagai malapetaka, tetapi mereka tidak juga tunduk kepada Tuhan mereka dan tidak juga merendahkan diri, bahkan sama sekali tidak memohon pada-Nya agar Dia melenyapkan malapetaka tatkala menimpa mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76-77. Sungguh Kami telah mengazab mereka dengan kelaparan dan terbunuh dalam perang Badar, namun mereka tetap tidak mau tunduk kepada Allah; hingga saat kengerian azab akhirat mendatangi mereka, mereka akan tercengang dan putus asa dari segala kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. وَلَقَدْ أَخَذْنٰهُم بِالْعَذَابِ (Dan sesungguhnya Kami telah pernah menimpakan azab kepada mereka) Terdapat pendapat menyatakan yang dimaksud adalah kelaparan yang menimpa mereka saat terjadi kekeringan panjang. فَمَا اسْتَكَانُوا۟ لِرَبِّهِمْ(maka mereka tidak tunduk kepada Tuhan mereka) Yakni mereka tidak juga tunduk dan merendahkan diri. وَمَا يَتَضَرَّعُونَ(dan (juga) tidak memohon (kepada-Nya) dengan merendahkan diri) Yakni mereka tidak berdoa dengan penuh ketundukan ketika kesusahan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Sesungguhnya Kami sudah pernah menimpakan azab kelaparan selama bertahun-tahun kepada mereka, atau membinasakan mereka pada perang Badr. Namun mereka tetap tidak tunduk dan tidak melakukan ketaatan kepada Tuhan mereka, juga tidak memohon kepada-Nya dengan merendahkan diri. Bahkan mereka justru durhaka, tidak takut dan tidak memohon pertolongan dengan berdoa kepada Allah ketika kesulitan. Ibnu Abbas berkata: Abu Sufyan mendatangi Nabi dan berkata: Wahai Muhammad, aku akan mendendangkanmu dengan nama Allah dan yang maha oengasih, bahwa kami telah memakan ‘ilhazim yaitu bulu onta dan darah. Sehingga Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah menimpakan azab kepada mereka, dan mereka tidak mau tunduk} mereka tidak mau tunduk dan merendah {kepada Tuhan mereka dan tidak merendahkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76 “dan sesungguhnya kami telah menimpakan azab kepada mereka.” Para ulama tafsir mengatakan, ”maksudnya, kelaparan yang melanda mereka selama tujuh tahun. Allah menguji mereka dengan cobaan itu, agar mereka kembali kepada Allah dengan kehinaan dan pasrah diri. Namun itu tidak mempan pada mereka, dan tidak ada seorangpun yang lulus dalam cobaan itu. “maka mereka tidak tunduk kepada Rabbnya,” yaitu tunduk dan menghinakan diri “dan tidak memohon (kepadaNya) dengan merendahkan diri,” dan tidak membutuhkan pertolongan dariNya. Bahkan kejadian itu berlangsung pada mereka sampai selesai, seolah-olah tidak ada sesuatupun yang menimpa mereka, dan mereka masih saja dalam kesesatan dan kekufuran mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 76: Ibnu Jarir berkata: Telah menceritakan kepada kami Ibnu Humaid, ia berkata: Telah menceritakan kepada kami Abu Tumailah, yaitu Yahya bin Wadhih dari Al Husain (asalnya adalah Al Hasan, namun salah tulis) dari Yazid, dari Ikrimah, dari Ibnu Abbas ia berkata, “Abu Sufyan datang kepada Rasulullah shallallahu 'alaihi wa sallam dan berkata, “Wahai Muhammad, aku bertanya kepadamu dengan nama Allah dan karena hubungan kerabat. Sesungguhnya kami telah memakan ‘ilhiz,” yakni wabar (bulu unta) dan darah.” Maka Allah menurunkan ayat, “Dan sungguh Kami telah menimpakan siksaan kepada mereka, tetapi mereka tidak mau tunduk kepada Tuhannya, dan (juga) tidak merendahkan diri.” (Al Mu’minun: 76). Syaikh Muqbil berkata, “Hadits ini para perawinya adalah tsiqah selain guru Ath Thabari, yaitu Muhammad bin Humaid Ar Raaziy. Dia adalah dha’if, akan tetapi hadits ini telah datang dari beberapa jalan selain ini. Ibnu Hatim meriwayatkan sebagaimana dalam Tafsir Ibnu Katsir juz 3 hal. 251, dan Nasa’i sebagaimana dalam Tafsir Ibnu Katsir, dan Ibnu Hibban hal. 434. Di sana pada masing-masing mereka ada Ali bin Al Husain bin Waqid, dan dia didha’ifkan. Hakim juz 2 hal. 394 meriwayatkan juga, demikian pula Al Waahidiy dalam Asbaabunnuzul, dan di sana pada masing-masing mereka ada Muhammad bin Musa bin Hatim. Muridnya Al Qasim As Sayyaariy berkata, “Saya tidak berani menjaminnya.” Ibnu Abi Sa’daan berkata, “Muhammad bin ‘Ali Al Haafizh berpandangan buruk terhadapnya.” Sebagaimana dalam Lisanul Mizan, adapun Hakim, maka ia menshahihkannya dan didiamkan oleh Adz Dzahabiy. Hadits ini dengan keseluruhan jalannya yang sampai kepada Al Husain bin Waqid adalah shahih lighairih.” Wallahu a’lam. Syaikh Muqbil juga berkata, “Kemudian saya menemukan syahidnya dalam riwayat Baihaqi di kitab Dalaa’ilunnubuwwah (2/338).” Yang dimaksud dengan azab tersebut adalah kemarau panjang yang menimpa mereka, hingga mereka menderita kelaparan, agar mereka kembali kepada Allah dan mau beriman (Lihat ayat 75). Ada pula yang mengatakan, bahwa maksudnya adalah kekalahan mereka pada peperangan Badar, di mana dalam peperangan itu orang-orang yang terkemuka dari mereka banyak terbunuh atau tertawan Yakni tidak berharap kepada Allah dengan berdoa dan merasa tidak butuh kepada-Nya. Bahkan musibah itu berlalu bagi mereka, lalu hilang seakan-akan belum pernah menimpa mereka, sehingga mereka pun tetap di atas kekafiran dan kesesatannya, padahal di hadapan mereka ada azab yang tidak mungkin ditolak sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 76",
    "description": "76-77. Dan sungguh kami telah menimpakan siksaan semenjana kepada mereka, seperti penyakit, kelaparan, dan lainnya, tetapi mereka tetap tidak mau tunduk kepada tuhannya yang telah berbuat baik kepada me-reka; dan tidak juga mereka mau merendahkan diri untuk bertobat dari kedurhakaan mereka. Sehingga apabila kami bukakan untuk mereka pintu azab yang sangat keras, saat itulah mereka bingung, takut, dan seketika itu juga mereka menjadi putus asa karena tidak menemukan jalan untuk melarikan diri"
  }
]