[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hingga apabila Kami telah membuka untuk mereka satu pintu siksaan dahsyat di akhirat, maka tiba-tiba mereka langsung merasa putus harapan dari setiap kebaikan, mereka bingung dan tidak tahu apa yang harus diperbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Sehingga apabila Kami bukakan untuk mereka pintu azab yang pedih, seketika tiba-tiba mereka berputus asa dari berbagai keselamatan dan kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. حَتَّىٰٓ إِذَا فَتَحْنَا عَلَيْهِم بَابًا ذَا عَذَابٍ شَدِيدٍ (Hingga apabila Kami bukakan untuk mereka suatu pintu tempat azab yang berat) Terdapat pendapat mengatakan yang dimaksud adalah azab mereka di akhirat. Dan pendapat lain mengatakan yang dimaksud adalah kematian mereka karena pedang di perang Badar إِذَا هُمْ فِيهِ مُبْلِسُونَ(tiba-tiba mereka menjadi putus asa) Yakni mereka menjadi kebingungan dan tidak mengerti apa yang mereka lakukan. Makna (مبلس) adalah putus asa dari segala kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Hingga apabila satu macam azab yang amat sangat pedih telah menimpa mereka di dunia maupun di hari kiamat, tiba-tiba mereka kebingungan dan tidak tahu apa yang akan mereka perbuat, mereka menjadi putus asa dari segala kebaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sehingga apabila Kami membukakan untuk mereka pintu azab yang sangat keras, seketika itu mereka menjadi putus asa} putus asa terhadap kesenangan dan kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77 namun, dibelakang mereka, terdapat siksa yang menunggu yang tidak bisa ditampik, yaitu Firman Allah, ”hingga apabila kami bukakan untuk mereka suatu pintu yang ada azab yang amat sangat parah,” seperti tewasnya mereka di perang badar dan lainnya. “diwaktu itulah tiba-tiba mereka menjadi putus asa,” dari segala kebaikan. Kejelekan dan faktor-faktor pencetusnya telah menyinggahi mereka. Hendaknya mereka bersikap hati-hati sebelum datangnya siksa Allah yang sangat pedih, yang tidak bisa ditolak. Berbeda dengan siksaan yang biasa, mungkin saja Allah mencabutnya kembali dari mereka, semisal hukuman-hukuman duniawi yang dijatuhkan oleh Allah untuk memperbaiki para hambaNya. Allah berfirman tentang realita ini, “ telah tampak kerusakan di darat dan laut di sebabkan perbuatan tangan manusia, suapaya Allah merasakan kepada mereka sebagian dari (akibat) perbuatan mereka, agar mereka kembali (kejalan yang benar),”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 77: Menurut Ibnu Abbas dan Mujahid, bahwa maksudnya adalah terbunuhnya mereka pada perang Badar. Ada pula yang berpendapat, bahwa maksudnya adalah kematian, dan ada pula yang berpendapat, bahwa maksudnya adalah tibanya kiamat. Dari semua kebaikan. Oleh karena itu, hendaknya mereka berhati-hati terhadap azab yang keras yang tidak mungkin ditolak, di mana azab tersebut bukan azab biasa yang terkadang dicabut-Nya azab itu dari mereka, seperti azab-azab duniawi yang tujuannya Allah memberikan ta’dib (pelajaran) kepada hamba-hamba-Nya, seperti dalam firman Allah Ta’ala, “Telah nampak kerusakan di darat dan di laut disebabkan karena perbuatan tangan manusia, agar Allah merasakan kepada mereka sebagian dari (akibat) perbuatan mereka, agar mereka kembali (ke jalan yang benar).” (Terj. Ar Ruum: 41)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 77",
    "description": "76-77. Dan sungguh kami telah menimpakan siksaan semenjana kepada mereka, seperti penyakit, kelaparan, dan lainnya, tetapi mereka tetap tidak mau tunduk kepada tuhannya yang telah berbuat baik kepada me-reka; dan tidak juga mereka mau merendahkan diri untuk bertobat dari kedurhakaan mereka. Sehingga apabila kami bukakan untuk mereka pintu azab yang sangat keras, saat itulah mereka bingung, takut, dan seketika itu juga mereka menjadi putus asa karena tidak menemukan jalan untuk melarikan diri. 78-79. Melanjutkan penyebutan anugerah-anugerah pada ayat-ayat sebelumnya, Allah menyatakan sebagai berikut, wahai manusia, bagaimana kamu mengingkari dan mendurhakai Allah, sedang dia-lah yang telah menciptakan bagimu pendengaran agar kamu mendengar kebenaran, penglihatan agar kamu mengamati tanda-tanda kebesaran Allah, dan hati nurani agar kamu dapat berpikir lalu beriman dan bersyukur kepada Allah, tetapi sedikit sekali kamu bersyukur. Dan dia-lah juga yang menciptakan dan mengembangbiakkan kamu di bumi ini dan hanya kepada-Nyalah kamu akan dikumpulkan di akhirat nanti untuk menerima balasan."
  }
]