[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia-lah Dzat yang menciptakan bagi kalian pendengaran untuk menangkap apa-apa yang didengar, dan penglihatan untuk menangkap apa-apa yang dilihat, dan hati untuk memahami. Meskipun demikian, rasa syukur kalian terhadap nikmat-nikmat yang tidak putus pada kalian ini kecil tidak ada artinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. \"Dan Allah -Subḥānahu-, Dia lah yang menciptakan untuk kalian -wahai orang-orang yang mendustakan hari Kebangkitan- pendengaran agar kalian mendengar, penglihatan agar kalian melihat, dan hati agar kalian berakal, akan tetapi kalian malah tidak bersyukur kepada-Nya atas karunia dan nikmat-nikmat tersebut kecuali sedikit saja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78-80. Allah yang telah menciptakan pendengaran agar kalian dapat mendengar, dan penglihatan agar kalian dapat menyaksikan ayat-ayat kauniyah, serta akal agar kalian dapat memahaminya. Akan tetapi rasa syukur kalian kepada Allah sangat sedikit atas segala kenikmatan besar ini. Allah telah menciptakan kalian dan menyebarkan kalian di muka bumi dengan beranak pinak, kemudian kalian akan dikumpulkan di hadapan Allah setelah kematian untuk menjalani hisab. Hanya Allah yang mengatur kehidupan dan kematian, Dia yang mengganti antara siang dan malam; maka apakah kalian tidak mengikuti kebenaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. قَلِيلًا مَّا تَشْكُرُونَ (Amat sedikitlah kamu bersyukur) Terdapat pendapat mengatakan yang dimaksud adalah mereka sama sekali tidak bersukur, dan bukan berarti orang-orang kafir tersebut sedikit bersyukur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Dialah Allah, yang telah menciptakan bagi kamu sekalian sebuah pendengaran agar kalian bisa mendengar nasehat. Juga menciptakan penglihatan agar kalian bisa melihat tanda keesaan Allah sehingga kalian akan mentadaburinya. Juga hati dan akal agar kalian bisa bertafakur, namun justru kalian tidak bersyukur kepada Allah atas anugerah kenikmatan ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Dzat yang telah menciptakan} menciptakan {bagi kalian pendengaran, penglihatan dan hati nurani, tetapi sedikit sekali kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78 Allah memberitahukan tentang limpahan karuniaNya bagi para hambaNya yang mengajak mereka untuk mensyukuriNya dan menjalankan hak-hakNya. Allah berfirman, ”dan Dia-lah yang telah menciptakan bagi kamu sekalian, pendengaran,” yang dengan indera tersebut, kalian bisa mengindera hal-hal yang terdengar, hingga kalian mendapatkan manfaat agama dan duniawi, “dan penglihatan,” yang dengan sarana itu, kalian bisa memahami obyek-obyek yang terlihat, hingga kalian sanggup mengindaerai kemaslahatan-kemaslahatan kalian. “dan hati,” yaitu akal-akal yang kalian gunakan untuk mencerna segala sesuatu dan piranti yang menyebabkan kalian berbeda dengan binantang-binatang. Jika kalian tidak mempunyai pendengeran, penglihatan,dan akal, maka kalian akan menjadi tuli, buta, dan bisu lalu bagaimana nanti kondisi kalian? Kebutuhan primer dan kebutuhan apa saja yang hilang dari kalian? Tidaklah engkau mensyukuri Dzat yang telah melimpahkan nikmat-nikmat ini kepada kalian, selanjutnya kalian mengesakanNya (dalam ibadah) dan menjalankan ketaatan kepadaNya, tetapi kalian tidak bersyukur, padahal kenikmatanNya kepada kalian datang secara kontinyu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 78: Allah Subhaanahu wa Ta'aala memberitahukan nikmat-nikmat-Nya yang dikaruniakan kepada hamba-hamba-Nya yang menghendaki mereka untuk bersyukur kepada-Nya dan memenuhi hak-Nya. Agar kamu dapat mendengar semua yang dapat didengar sehingga kamu memperoleh manfaat baik bagi agama kamu maupun dunia kamu. Agar kamu dapat melihat semua yang dapat dilihat sehingga kamu memperoleh maslahatmu dengannya. Sehingga kamu mengetahui sesuatu dan dapat membedakan antara yang satu dengan yang lain, dan ia pula yang membedakan kamu dengan hewan ternak. Jika kamu tidak dapat mendengar dan tidak dapat melihat bagaimanakah keadaanmu? Dan apa saja maslahat dharuri (primer) dan kamali (sekunder) yang luput darimu? Tidakkah kamu bersyukur kepada yang telah memberimu nikmat-nikmat itu, sehingga kamu pun mentauhidkan-Nya dan menaati-Nya? Yang dimaksud dengan bersyukur di ayat ini adalah menggunakan alat-alat tersebut untuk memperhatikan bukti-bukti kekuasaan, kebesaran dan keesaan Allah, yang dapat membawa mereka beriman kepada Allah Subhaanahu wa Ta'aala serta taat dan patuh kepada-Nya. Kaum musyrikin ternyata tidak berbuat demikian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 78",
    "description": "78-79. Melanjutkan penyebutan anugerah-anugerah pada ayat-ayat sebelumnya, Allah menyatakan sebagai berikut, wahai manusia, bagaimana kamu mengingkari dan mendurhakai Allah, sedang dia-lah yang telah menciptakan bagimu pendengaran agar kamu mendengar kebenaran, penglihatan agar kamu mengamati tanda-tanda kebesaran Allah, dan hati nurani agar kamu dapat berpikir lalu beriman dan bersyukur kepada Allah, tetapi sedikit sekali kamu bersyukur. Dan dia-lah juga yang menciptakan dan mengembangbiakkan kamu di bumi ini dan hanya kepada-Nyalah kamu akan dikumpulkan di akhirat nanti untuk menerima balasan"
  }
]