[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia-lah yang menciptakan seluruh manusia di bumi dan kepadaNyalah kalian akan dikumpulkan setelah kematian kalian, lalu Dia memberikan balasan kepada kalian atas apa yang kalian perbuat, perbuatan baik maupun perbuatan buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Wahai manusia! Dia lah yang menciptakan kalian di bumi, dan hanya kepada-Nya lah kalian akan dikumpulkan pada hari Kiamat kelak untuk dihisab dan diberikan balasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. وَهُوَ الَّذِى ذَرَأَكُمْ فِى الْأَرْضِ (Dan Dialah yang menciptakan serta mengembang biakkan kamu di bumi ini) Yakni Allah akan membuat kalian tersebar di bumi sebagaimana Allah menyebar biji-bijian agar tumbuh. وَإِلَيْهِ تُحْشَرُونَ (dan kepada-Nya-lah kamu akan dihimpunkan) Yakni kalian akan berkumpul di hari kiamat setelah sebelumnya saling berpencar di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Dialah yang menciptakan serta mengembangbiakkan kalian di bumi ini, dan kepada-Nya-lah kamu akan dikumpulkan kembali pada hari kiamat setelah berpisah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menciptakan dan mengembangbiakkan kalian} menciptakan dan mengembangbiakkan kalian {di bumi dan kepadaNyalah kalian akan dikumpulkan} dikumpulkan pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79 “dan Dia-lah,” Allah Yang Mahatinggi “yang telah menciptakan serta mengembangbiakkan kamu di bumi,” yang menyebarkan kalian dia seluruh wilayah dan penjurunya, dan menjadikan kalian mempunyai kemampuan untuk mengeksplorasi kandungan kebaikan dan manfaat-manfaatnya, dan menjadikannya cukup bagi kegiatan usaha penghidupan kalian dan hinan-hunian kalian. “dan kepadaNya-lah kamu akan dihimpun,” pasca kematian kalian, kemudian Dia memberi balasan kepada kalian sesuai dengan amalan yang kalian perbuat di bumi ini, yang baik maupun yang buruk, bumi yang menjadi tempat kalian menetap di dalamnya pun akan bercererita mengenai kisah-kisahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 79: Dia menyebarkan kamu di bumi dan memberikan kekuasaan kepada kamu untuk menggali maslahat dan manfaat yang ada di bumi dan menjadikan bumi cukup untuk penghidupan kamu dan tempat tinggal kamu. Setelah kamu mati, lalu Dia membalas amalmu sewaktu di dunia, baik atau buruk dan bumi pun memberitahukan berita-beritanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 79",
    "description": "78-79. Melanjutkan penyebutan anugerah-anugerah pada ayat-ayat sebelumnya, Allah menyatakan sebagai berikut, wahai manusia, bagaimana kamu mengingkari dan mendurhakai Allah, sedang dia-lah yang telah menciptakan bagimu pendengaran agar kamu mendengar kebenaran, penglihatan agar kamu mengamati tanda-tanda kebesaran Allah, dan hati nurani agar kamu dapat berpikir lalu beriman dan bersyukur kepada Allah, tetapi sedikit sekali kamu bersyukur. Dan dia-lah juga yang menciptakan dan mengembangbiakkan kamu di bumi ini dan hanya kepada-Nyalah kamu akan dikumpulkan di akhirat nanti untuk menerima balasan. 80. Tidak hanya kuasa untuk menciptakan dan mengembangbiakkan makhluk hidup, Allah kuasa pula untuk menghidupkan dan mematikan mereka. Dan dia-lah yang menghidupkan dan mematikan makhluk hidup, termasuk manusia, dan dia-lah juga yang mengatur pergantian malam dan siang serta perbedaan keduanya. Tidakkah kamu mengerti dan memahami ciptaan Allah serta memikirkan kekuasaan-Nya'."
  }
]