[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang menjaga semua apa yang dipercayakan kepada mereka, juga memenuhi setiap janji-janji mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan orang-orang yang memelihara amanah Allah dan amanah para hamba-Nya. Mereka juga memelihara janji, tidak mengkhianatinya, tetapi sealiknya memenuhinya secara sempurna."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-11. Dan orang-orang yang selalu menjaga amanah dan menepati janji, dan orang-orang yang senantiasa mendirikan shalat pada waktunya dengan menyempurnakan rukun-rukunnya. Mereka yang memiliki derajat yang tinggi itu akan mewarisi surga, mewarisi tempatnya yang paling mulia, dan mereka akan tinggal di dalamnya selama-lamanya. Abu Hurairah berkata, Rasulullah bersabda: “Tidaklah salah seorang dari kalian melainkan memiliki dua tempat; satu tempat di surga dan satu tempat di neraka. Apabila dia meninggal kemudian memasuki neraka, maka para penghuni surga akan mewarisi tempatnya di surga, itulah yang dimaksud dalam firman Allah: ‘Mereka itulah orang-orang yang akan mewarisi’ (al-Mu’minun: 10).” (Sunan Ibnu Majah 2/1453, kitab zuhud, bab sifat surga no. 4341. Al-Bushairi berkata, sanad hadits ini shahih menurut syarat al-Bukhari dan Muslim (Mishbah al-Zujajah 3/327) dan diriwayatkan at-Thabari dari jalur Abu Muawiyah (at-Tafsir 18/5-6), dan sanadnya dishahihkan oleh Ibnu Hajar (Fathul Bari 11/442) dan sanadnya dishahihkan pula oleh al-Albani (as-Silsilah as-Shahihah 5/348 no. 2279)). Dan Abu Hurairah berkata, Rasulullah bersabda: “Di dalam surga terdapat seratus tingkat yang Allah siapkan bagi orang-orang yang berjihad di jalan Allah; antara satu derajat dengan derajat lainnya seperti jarak antara langit dan bumi. Maka jika kalian meminta kepada Allah, maka mintalah surga firdaus karena ia berada di surga yang paling tengah dan paling tinggi.” (Shahih al-Bukhari, kitab al-Jihad, bab derajat para mujahid di jalan Allah, no. 279)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَالَّذِينَ هُمْ لِأَمٰنٰتِهِمْ وَعَهْدِهِمْ رٰعُونَ (Dan orang-orang yang memelihara amanat-amanat (yang dipikulnya) dan janjinya) Makna (الأمانة) di sini adalah apa yang diamanatkan kepada seseorang yang tidak disertai bukti atau hujjah untuk memastikannya kecuali dengan kesaksian Allah, seperti orang yang mendapat titipan, orang yang berhutang tanpa bukti, ayah atau wali-wali terhadap anak kecil yang ia pelihara, dan orang islam dalam shalat, puasa, dan bersuci. Makna (العهد) adalah apa yang mereka sepakati dengan Allah atau dengan orang lain. Makna (الراعون) adalah orang-orang yang senantiasa menjaganya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Serta orang-orang yang menjaga dan merealisasikan amanah dan janji yang menjadi tanggung jawabnya. Amanah adalah tanggung jawab syariat ataupun harta yang dipasrahkan kepada seseorang untuk menjaganya. ‘Ahdu segala sesuatu yang harus dipenuhi atau dilakukan seseorang. Dari sisi janji kepada Allah adalah melaksanakan shalat, adapun dari sisi sesama makhluk adalah kesepakatan/janji."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang memelihara} menjaga {amanat dan janji mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Dan orang-orang yang memelihara amanat-amanat (yang dipikulnya) dan janjinya,” maksudnya mereka memperhatikan, menjaga lagi memeliharanya, sangat bergelora semangatnya untuk menjalankan dan menegakkannya. Keterangan ini bersifat umum berlaku pada seluruh amanah yang merupakan hak Allah, dan hak para hamba. Allah berfirman : \"Sesungguhnya Kami telah mengemukakan amanat kepada langit, bumi dan gunung-gunung, maka semuanya enggan untuk memikul amanat itu dan mereka khawatir akan mengkhianatinya, dan dipikullah amanat itu oleh manusia. Sesungguhnya manusia itu amat zalim dan amat bodoh,\" Seluruh kewajiban yang ditetapkan oleh Allah kepada para hambaNya merupakan amanah bagi seorang hamba. Dia berkewajiban menjaganya dengan mengaplikasikannya sebaik-baiknya. Begitu pula, seluruh amanah yang terjalin antar manusia masuk dalam konteks ini, misalnya, titipan harta, perkara-perkara rahasia dan lain-lain. Kewajiban seseorang, adalah memberikan perhatiannya ke arah dua perkara itu dan dua amanah tersebut. \"Sesungguhnya Allah menyuruh kamu menyampaikan amanat kepada yang berhak menerimanya\" Demikian pula ikatan janji, mencakup janji mereka dengan Rabb mereka dan janji mereka dengan sesame, yang berbentuk, konsekuensi-konsekuensi dan akad yang telah dibuat oleh seseorang. Dia harus mempedulikan dan menepatinya. Dia haram menyia-nyiakannya atau mengenyampingkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 8: Mereka berusaha melaksanakan dan memenuhinya. Baik amanah yang di dalamnya terdapat hak Allah maupun yang di dalamnya terdapat hak manusia. Apa yang Allah wajibkan kepada hamba merupakan amanah, sehingga seorang hamba wajib melaksanakannya, seperti shalat lima waktu, zakat, puasa di bulan Ramadhan, dsb. Sedangkan amanah yang di sana terdapat hak manusia adalah apa yang dipercayakan atau dibebankan mereka kepada kita, seperti menjaga harta yang mereka titipkan, melaksanakan tugas yang dibebankan mereka, dsb. Baik antara mereka dengan Allah, maupun antara mereka dengan sesamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 8",
    "description": "Perkawinan adalah amanat, maka setiap orang harus memeliharanya dengan baik. Meski begitu, tidak hanya amanat perkawinan yang harus dipelihara, melainkan semua amanat. Dan beruntunglah orang yang memelihara amanat-amanat yang dipikulkan atas mereka dan memelihara janjinya yang dijalin dengan pihak lain. 9. Serta beruntung pulalah orang yang memelihara salatnya, di antaranya dengan memelihara waktu salat yang utama, yaitu awal waktu, serta memelihara pula rukun, wajib, dan sunahnya."
  }
]