[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia-lah satu-satuNya Dzat yang menghidupkan dari tidak ada dan mematikan setelah hidup, dan bagiNya (kekuasaan) mempergantikan malam dan siang dan membedakan waktu-waktu keduanya. Apakah kalian tidak memahami Kuasa dan keesaanNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Dan Dia sendiri lah yang menghidupkan, tidak ada yang kuasa menghidupkan selain-Nya, Dia sendiri lah yang mematikan, tidak ada yang kuasa mematikan selain-Nya, dan Dia sendiri pula yang mengatur kadar siang dan malam baik berupa cahaya terang atau gelapnya, maupun berupa panjang pendeknya. Maka apakah kalian tidak memikirkan kekuasaan dan keesaan-Nya dalam menciptakan dan mengatur alam semesta?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَهُوَ الَّذِى يُحْىِۦ وَيُمِيتُ (Dan Dialah yang menghidupkan dan mematikan) Hanya Dia yang dapat melakukannya. وَلَهُ اخْتِلٰفُ الَّيْلِ وَالنَّهَارِ ۚ( dan Dialah yang (mengatur) perbedaan malam dan siang) Yakni berbeda dalam cahaya dan kegelapan, panjang dan pendek. Pendapat lain mengatakan yang dimaksud adalah pengulangan hari demi hari dan malam demi malam. أَفَلَا تَعْقِلُونَ(Maka apakah kamu tidak memahaminya) Dan memikirkan dalam hakikat kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Dialah yang berkuasa menghidupkan dan mematikan. Dialah yang mengatur pertukaran malam dan siang, serta perbedaan gelap dan terang diantara keduanya, juga pengurangan maupun penambahan. Maka apakah kamu tidak mengetahui penciptaan Allah itu dan juga tidak berusaha memahami kekuasaan-Nya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang menghidupkan dan mematikan. Dan bagiNyalah pergantian} pergantian {malam dan siang. Apakah kalian tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80 “dan Dia-lah,” Allah yang Mahatinggi satu-satunya “yang menghidupkan dan mematikan,” maksudnya yang memegang kendali kehidupan dan kematian adalah Allah sendiri. “dan Dia-lah (yang mengatur) pertukaran malam dan siang,” maksudnya, (mengatur) urutan dan silih bergantinya siang dan malam. Kalau Allah menghendaki, untuk menjadikan siang hari kekal selama-lamanya, sesembahan mana selain Allah yang mendatangkan malam kepada kalian agar kalian bisa melepaskan kepenatan di dalamnya? Jika Allah berkehendak menjadikan malam kekal abadi, maka sesembahan mana selain Allah yang berkuasa mendatangkan sinar cahaya. Maka tidaklah kalian memperhatikan? Diantara cermin rahmat Allah (kepada hambaNya) adalah Dia menjadikan malam dan siang, supaya kalian bisa beristirahat di dalamnya dan mencari kemurahan rizkiNya, agar kalian bersyukur. karena itu, disini Allah berfirman, ”maka apakah kamu tidak memahaminya,” sehingga kalian mengenal Dzat yang telah menganugerahi kalian kenikmatan-kenikmatan; pendengaran, penglihatan, dan hati, dan yang menyebarkan kalian di permukaan bumi sendieianNya, dan yang menghidupkan dan mematikan sendirianNYa dan yang mengendalikan malam dan siang. Sesungguhnya itu semua mengikhlaskan kalian semua beribadah kepadaNya semata, tiada sekutu bagiNya, dan kalian meninggalkan peribadah obyek yang tidak dapat memberikan manfaat dan mendatangkan bahaya, serta tidak memegang wewenang apapun. Bahkan ia merupakan makhluk yang tidak memiliki daya dari segala segi, dan kalau memang kalian memiliki akal sehat, niscaya kalian tidak akan melakukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 80: Dengan meniupkan ruh ketika fase manusia sebagai mudhghah (segumpal daging). Jika Dia menghendaki, Dia bisa menjadikan malam terus-menerus atau siang terus-menerus, dan kalau seandainya Dia menjadikan malam terus-menerus atau siang terus-menerus, siapakah yang mampu merubahnya? Tentu tidak ada yang mampu merubahnya selain Dia. Allah Subhaanahu wa Ta'aala berfirman, “Dan karena rahmat-Nya, Dia jadikan untukmu malam dan siang, supaya kamu beristirahat pada malam itu dan supaya kamu mencari sebagian dari karunia-Nya (pada siang hari) dan agar kamu bersyukur kepada-Nya.” (Terj. Al Qashash: 73) Sehingga kamu dapat mengetahui bahwa yang telah mengaruniakan kamu berbagai nikmat, seperti pendengaran, penglihatan dan hati, dan yang menyebarkan kamu di muka bumi, yang menghidupkan dan mematikan dan yang mengatur malam dan siang Dialah yang berhak disembah, yaitu Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 80",
    "description": "Tidak hanya kuasa untuk menciptakan dan mengembangbiakkan makhluk hidup, Allah kuasa pula untuk menghidupkan dan mematikan mereka. Dan dia-lah yang menghidupkan dan mematikan makhluk hidup, termasuk manusia, dan dia-lah juga yang mengatur pergantian malam dan siang serta perbedaan keduanya. Tidakkah kamu mengerti dan memahami ciptaan Allah serta memikirkan kekuasaan-Nya'81-83. Orang-orang kafir enggan memikirkan fenomena alam sebagai bukti kekuasaan Allah, bahkan mereka mengikuti jejak para pendurhaka terdahulu. Mereka mengingkari hari kebangkitan dan mengucapkan perkataan yang serupa dengan apa yang diucapkan oleh orang-orang terdahulu seperti kaum nabi nuh, kaum 'ad, dan kaum-kaum sesudahnya. Mereka berkata untuk menolak adanya hari kebangkitan, 'apakah betul, apabila kami telah mati dan telah menjadi tanah dan tulang belulang, kami benar-benar akan dibangkitkan kembali' tidak! itu tidak mungkin. Sungguh, yang demikian ini, yaitu ancaman dan siksa pada hari kebangkitan, sudah dijanjikan kepada kami dan kepada nenek moyang kami dahulu oleh orang-orang yang mengaku rasul. Ini hanyalah mitos dan dongeng orang-orang terdahulu belaka!'."
  }
]