[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka mengatakan, “apakah Apabila kami telah mati, dan jasad-jasad dan tulang-tulang kami telah terurai dalam bumi, apakah kami akan hidup kembali? Ini tidak mungkin terjadi dan tidak bisa terbayangkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Mereka berkata -dengan tujuan mengingkari-, \"Apakah betul, bila kami mati dan berubah menjadi tanah dan tulang belulang yang sudah hancur, kami benar-benar akan dibangkitkan dalam keadaan hidup kembali?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. قَالُوٓا۟ أَءِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظٰمًا أَءِنَّا لَمَبْعُوثُونَ (Mereka berkata: “Apakah betul, apabila kami telah mati dan kami telah menjadi tanah dan tulang belulang, apakah sesungguhnya kami benar-benar akan dibangkitkan?) Ini hanya sekedar anggapan mereka bahwa hal itu mustahil, dan ini tidak berhubungannya antara keadaan manusia yang telah menjadi tulang belulang dengan kebangkitan mereka, sebab secara ilmu dan akal kebangkitan bukanlah hal yang mustahil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Mereka berkata: \"Apakah betul, apabila kami telah mati dan kami telah menjadi tanah dan tulang belulang, apakah sesungguhnya kami benar-benar akan dibangkitkan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah jika kami telah mati serta menjadi tanah dan tulang belulang, kami benar-benar akan dibangkitkan \\"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81-83 Maksudnya justru orang-orang yang mendustakan itu mengikuti jalan orang-orang terdahulu, dari kalangan orang-orang yang mendustakan Hari kebangkitan dan benar-benar menganggapnya mustahil terjadi. Mereka berkata, “apakah betul, apabila kami telah mati, dan kami telah menjadi tanah dan tulang belulang, apakah sesungguhnya kami benar-benar akan dibangkitkan?” ini tidak bisa diimajinasikan dan tidak bisa dicerna oleh akal, menurut mereka. “sesungguhnya kami dan bapak-bapak kami telah diberi ancaman (dengan) ini dahulu.” Maksudnya, kami dan nenek moyang kami masih saja dikabari dengan berita bahwa hari kebangkitan akan datang, padahal kami tidak menyaksikannya dan belum juga tiba. “ini tidak lain hanyalah dongengan orang-orang dahulu kala!” maksudnya cerita-cerita dan hasil obrolan mereka di malam hari yang diperbincangkan dan melalikan. Kalau tidak demikian, berarti tidak ada realitanya, dan mereka berdusta, semoga Allah menimpakan kejelekan kepada mereka. Sesungguhnya Allah telah menampakkan tanda-tanda kebesaranNya kepada mereka yang lebih dahsyat dibandingkan kebangkitan manusia sepertinya, “sungguh penciptaan langit dan bumi, lebih besar draipada penciptaan manusia,” “dan Dia membuat perumpamaan bagi kami, dan dia lupa kejadiannya, dia berkata,’ siapakah yang dapat menghidupkan tulang-belulang yang telah hancur luluh,?” “dan kamu lihat bumi ini kering, kemudian apabila kmai turunkan air diatasnya, hiduplah bumi itu dan suburlah’.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 82: Menurut akal mereka yang tidak sehat, hal ini adalah mustahil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 82",
    "description": "81-83. Orang-orang kafir enggan memikirkan fenomena alam sebagai bukti kekuasaan Allah, bahkan mereka mengikuti jejak para pendurhaka terdahulu. Mereka mengingkari hari kebangkitan dan mengucapkan perkataan yang serupa dengan apa yang diucapkan oleh orang-orang terdahulu seperti kaum nabi nuh, kaum 'ad, dan kaum-kaum sesudahnya. Mereka berkata untuk menolak adanya hari kebangkitan, 'apakah betul, apabila kami telah mati dan telah menjadi tanah dan tulang belulang, kami benar-benar akan dibangkitkan kembali' tidak! itu tidak mungkin. Sungguh, yang demikian ini, yaitu ancaman dan siksa pada hari kebangkitan, sudah dijanjikan kepada kami dan kepada nenek moyang kami dahulu oleh orang-orang yang mengaku rasul. Ini hanyalah mitos dan dongeng orang-orang terdahulu belaka!'81-83"
  }
]