[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh ucapan ini juga dikatakan kepada bapak-bapak kami sebelumnya, persis seperti yang kamu ungkapkan kepada kami, wahai Muhammad. Kami tidak memandangnya sebagai satu realita nyata. Itu tiada lain, kecuali cerita-cerita batil orang-orang dahulu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Sungguh janji yang diberikan pada kami, berupa kebangkitan setelah kematian ini, juga telah dijanjikan kepada para pendahulu kami sebelumnya, namun kami tidak melihat bukti terwujudnya kebangkitan ini, sebab hal ini tidak lain hanyalah dongeng dan kedustaan orang-orang terdahulu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. لَقَدْ وُعِدْنَا نَحْنُ وَءَابَآؤُنَا هٰذَا مِن قَبْلُ (Sesungguhnya kami dan bapak-bapak kami telah diberi ancaman (dengan) ini dahulu) Yakni kami telah diancam dengan kebangkitan, begitu juga dengan nenek moyang kami, namun kami tidak melihat nenek moyang kami dibangkitkan. إِنْ هٰذَآ إِلَّآ أَسٰطِيرُ الْأَوَّلِينَ(ini tidak lain hanyalah dongengan orang-orang dahulu kala) Yakni ini hanyalah kebohongan-kebohongan orang terdahulu yang mereka tulis dalam kitab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Sesungguhnya kami dan bapak-bapak kami telah diberi ancaman ini dahulu, ini tidak lain hanyalah dongengan dan fiksi orang-orang dahulu kala!\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh telah dijanjikan yang demikian ini kepada kami dan nenek moyang kami sebelumnya. Ini tidak lain hanyalah dongeng orang-orang terdahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81-83 Maksudnya justru orang-orang yang mendustakan itu mengikuti jalan orang-orang terdahulu, dari kalangan orang-orang yang mendustakan Hari kebangkitan dan benar-benar menganggapnya mustahil terjadi. Mereka berkata, “apakah betul, apabila kami telah mati, dan kami telah menjadi tanah dan tulang belulang, apakah sesungguhnya kami benar-benar akan dibangkitkan?” ini tidak bisa diimajinasikan dan tidak bisa dicerna oleh akal, menurut mereka. “sesungguhnya kami dan bapak-bapak kami telah diberi ancaman (dengan) ini dahulu.” Maksudnya, kami dan nenek moyang kami masih saja dikabari dengan berita bahwa hari kebangkitan akan datang, padahal kami tidak menyaksikannya dan belum juga tiba. “ini tidak lain hanyalah dongengan orang-orang dahulu kala!” maksudnya cerita-cerita dan hasil obrolan mereka di malam hari yang diperbincangkan dan melalikan. Kalau tidak demikian, berarti tidak ada realitanya, dan mereka berdusta, semoga Allah menimpakan kejelekan kepada mereka. Sesungguhnya Allah telah menampakkan tanda-tanda kebesaranNya kepada mereka yang lebih dahsyat dibandingkan kebangkitan manusia sepertinya, “sungguh penciptaan langit dan bumi, lebih besar draipada penciptaan manusia,” “dan Dia membuat perumpamaan bagi kami, dan dia lupa kejadiannya, dia berkata,’ siapakah yang dapat menghidupkan tulang-belulang yang telah hancur luluh,?” “dan kamu lihat bumi ini kering, kemudian apabila kmai turunkan air diatasnya, hiduplah bumi itu dan suburlah’.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 83: Maksudnya, kebangkitan setelah mati. Maksudnya diancam dengan hari berbangkit. Sungguh keji sekali ucapan mereka ini, tidakkah mereka memperhatikan ayat-ayat-Nya yang lebih besar dari peristiwa kebangkitan itu sendiri; penciptaan langit dan bumi jelas lebih besar dari penciptaan manusia, penciptaan mereka pertama kali, dan bumi yang sebelumnya mati kemudian hidup setelah diturunkan-Nya air, dan lain-lain. Ini semua merupakan bukti nyata bahwa Dia mampu membangkitkan manusia setelah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 83",
    "description": "81-83. Orang-orang kafir enggan memikirkan fenomena alam sebagai bukti kekuasaan Allah, bahkan mereka mengikuti jejak para pendurhaka terdahulu. Mereka mengingkari hari kebangkitan dan mengucapkan perkataan yang serupa dengan apa yang diucapkan oleh orang-orang terdahulu seperti kaum nabi nuh, kaum 'ad, dan kaum-kaum sesudahnya. Mereka berkata untuk menolak adanya hari kebangkitan, 'apakah betul, apabila kami telah mati dan telah menjadi tanah dan tulang belulang, kami benar-benar akan dibangkitkan kembali' tidak! itu tidak mungkin. Sungguh, yang demikian ini, yaitu ancaman dan siksa pada hari kebangkitan, sudah dijanjikan kepada kami dan kepada nenek moyang kami dahulu oleh orang-orang yang mengaku rasul. Ini hanyalah mitos dan dongeng orang-orang terdahulu belaka!'84-85. 'wahai nabi Muhammad! katakanlah kepada orang-orang yang keras kepala dan mengingkari hari kiamat, \"milik siapakah bumi dan semua yang ada di dalamnya, jika kamu mengetahui'' pasti mereka akan menjawab dengan spontan, \"milik Allah. \" katakanlah, \"jika demikian maka apakah kamu tidak ingat dan sadar bahwa tuhan yang memiliki sifat dan kekuasaan demikian pasti mudah bagi-Nya untuk membangkitkan manusia setelah mati''."
  }
]