[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka pasti akan mengakui bahwa itu milik Allah. Dia-lah Penciptanya dan Pemiliknya. Katakanlah kepada mereka, “Tidakkah memikirkan melalui fakta tersebut bahwa Dia Mahakuasa untuk membangkitkan dan menghidupkan kembali?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Mereka akan menjawab, \"Bumi beserta semua yang ada di dalamnya adalah milik Allah,\" Maka katakanlah kepada mereka, \"Apakah kalian tidak memikirkan bahwa Żat yang memiliki bumi beserta semua yang ada di dalamnya Mahakuasa untuk menghidupkan kalian kembali setelah mati?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. سَيَقُولُونَ لِلّٰهِ ۚ (Mereka akan menjawab: “Kepunyaan Allah”) Yakni mereka pasti menjawab dengan jawaban ini. قُلْ أَفَلَا تَذَكَّرُونَ(Katakanlah: “Maka apakah kamu tidak ingat?”) Yakni jika kalian mengakui bahwa itu adalah kepunyaan Allah dan Dia-lah yang menciptakan dan mengaturnya maka mengapa kalian menyembah tuhan-tuhan yang lain disamping menyembah Allah, padahal kalian telah mengetahui tuhan-tuhan itu tidak memiliki apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Mereka pasti akan menjawab: \"Itu semua Allah\". Lalu katakanlah: \"Maka apakah kamu tidak mengambil pelajaran juga tidak berfikir?\" Sehingga kalian tahu bahwa Yang Kuasa menciptakan makluk pasti juga Kuasa membangkitkannya kembali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka akan menjawab,“Milik Allah” Katakanlah,“Apakah kalian tidak ingat”} apakah kalian tidak mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85 maksudnya, katakanlah kepada orang-orang yang mendustakan hari kebangkitan,yang berbelok arah drai Allah kepada sesembahan lain, sebagai pemberian hujjah kepada mereka mellaui keyakinan yang mereka tetapkan dan akui, berupa tauhid rububiyyah dan hak kepemilikan Allah atas tauhid itu secara prerogative (ditunjukan) terhadap pengingkaran mereka terhadap tauhid uluhiyyah dan ibadah, dan (pemberian hujjah) melalui penetapan mereka mengenai penciptaan segala makhluk yang besar (ditunjukan) pada pengingkaran mereka tentang menghidupkan kembali orang-orang yang telah mati yang hal ini lebih mudah dilakukan daripada itu. “kepunyaan siapakah bumi ini, dan semua yang ada padanya,” maksudnya siapakah yang telah menciptakan bumi dan segala makhluk yang berada diatas permukaannya, berupa hewan, tumbuhan, benda mati, lautan, sungai-sungai, dan gunung-gunung, Dzatb yang memiliki dan Mengaturnya? Sesungguhnya bila engkau menanyai mereka tentang masalah itu, mereka pasti menyatakan, ”Allah semata.” Jika mereka mengakui ini, katakanlah kepada mereka, “maka apakah kamu tidak ingat?” maksudnya, tidakkah kalian kembali kepada (pengakuan bahwa Allah Rabb yang disembah) yang kalian sudah diingatkan oleh Allah, yang sudah dimaklumi bersama, sudah mapan dalam fitrah-fitrah kalian yang mana sikap berpaling dapat berpotensi menyembunyikannya pada waktu tertentu? Padahal, pada prinsipnya, jika kalian itu merujuk ingatan kalian hanya dengan perenungan saja, niscaya kalian akan mengetahui bahwa Dzat yang memilikinya, itulah Dzat yang patut disembah semata, sementara ketuhanan dari obyek yang berada dalam kepemilikan (mamluk) merupakan ketuhanan yang paling batil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 85: Sesuatu yang sudah maklum dalam benakmu dan terpendam dalam fitrahmu yang terkadang menghilang oleh sikap berpaling pada sebagian waktu. Padahal sesungguhnya jika kamu kembali kepada ingatan kamu meskipun hanya berpikir sejenak, kamu dapat mengetahui bahwa yang menciptakan dan menguasai semua itu Dialah yang berhak disembah, dan bahwa menuhankan sesuatu yang dicipta dan dimiliki merupakan hal yang paling batil. Selanjutnya Allah Subhaanahu wa Ta'aala mengalihkan kepada yang lebih besar lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 85",
    "description": "84-85. 'wahai nabi Muhammad! katakanlah kepada orang-orang yang keras kepala dan mengingkari hari kiamat, \"milik siapakah bumi dan semua yang ada di dalamnya, jika kamu mengetahui'' pasti mereka akan menjawab dengan spontan, \"milik Allah. \" katakanlah, \"jika demikian maka apakah kamu tidak ingat dan sadar bahwa tuhan yang memiliki sifat dan kekuasaan demikian pasti mudah bagi-Nya untuk membangkitkan manusia setelah mati''86-87. Katakanlah, 'siapakah tuhan yang memiliki langit yang tujuh dan yang memiliki 'arsy yang agung'' mereka pasti juga akan menjawab, 'milik Allah. ' katakanlah, 'jika kamu mengakui hal itu maka mengapa kamu tidak bertakwa dan berusaha menghindari siksa-Nya dengan menaati ajaran-Nya''."
  }
]