[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, “Siapakah Pemilik langit yang tujuh, dan Pemilik Arasy yang besar yang merupakan makhluk Allah yang paling besar dan paling tinggi?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Katakanlah kepada mereka, \"Siapakah Tuhan yang memiliki langit yang tujuh dan Rabb yang memiliki Arasy yang agung, yang tidak ada satu makhluk pun yang lebih besar darinya?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86-89. Katakanlah kepada mereka: “Siapakah Pencipta tujuh langit dan pemilik ‘arsy yang merupakan makhluk paling besar?” Mereka pasti akan menjawab: “Allah”. Maka katakanlah kepada mereka: “Lalu mengapa kalian tidak takut terhadap azab-Nya sehingga kalian menyembah selain Allah?” “Siapakah yang segala kerajaan ada di tangan-Nya? Yang melindungi setiap orang yang meminta perlindungan kepada-Nya, dan tidak ada yang mampu melindungi seseorang yang hendak Allah azab. Jika kalian mengetahuinya maka katakan kepadaku.” Niscaya mereka akan menjawab: “Allah adalah pemilik segalanya, dan Dia akan melindungi orang yang meminta perlindungan kepada-Nya.” Dan katakanlah kepada mereka: “Dimana akal kalian, saat kalian menyembah sesuatu yang kalian ketahui kelemahannya dan tidak memiliki apapun?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Katakan juga kepada mereka: \"Siapakah Yang Memiliki langit yang berjumlah tujuh, dan Yang Memiliki ´Arsy yang agung yang lebih besar dari 7 langit itu?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Siapakah tuhan langit yang tujuh dan tuhan ʻArsy yang agung”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86-87 berikutnya, beralihlah pada perkara yang lebih besar darinya. Allah berfirman, ”katakanlah, ’siapakah pemilik langit yang tujuh,’” dan benda-benda yang berada di dalamya, seperti benda yang bercahaya, bintang-bintang yang bergerak-gerak dan yang statis di tempatnya saja. “dan pemilik ‘ Arasy yang besar,” yang merupakan makhluk yang tertinggi dan paling luas serta terbesar. Siapakah yang menciptakan dan mengatur serta menanganinya dengan berbagai macam aturan? “mereka akan menjawab,’ kepunyaan Allah’.” Maksudnya, mereka kana mengakui bahwa Allah adalah Rabb (pemilik) itu semua. Bila mereka mengakuinya, katakanlah, ”maka apakah kamu tidak bertakwa,” dari beribadah kepada makhluk-makhluk yang lemah dan (hanya) bertakwa kepada Rabb yang Mahaagung, sempurna kekuasaanNYa dana gung kerajaanNya?! Ungkapan ini mengandung dengan jelas nada pembicaraan yang lembut (persuasive) dari Firman Allah, ”maka apakah kamu tidak ingat?” dan “maka apakah kamu tidak bertakwa?” menasihati melalui metode pemaparan yang memikat hati manfaatnya tidak perlu diragukan lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 86: Dan menciptakan. Dan apa saja yang ada di dalamnya seperti benda-benda bercahaya dan benda-benda langit lainnya. ‘Arsy merupakan makhluk paling tinggi, paling luas dan paling agung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 86",
    "description": "86-87. Katakanlah, 'siapakah tuhan yang memiliki langit yang tujuh dan yang memiliki 'arsy yang agung'' mereka pasti juga akan menjawab, 'milik Allah. ' katakanlah, 'jika kamu mengakui hal itu maka mengapa kamu tidak bertakwa dan berusaha menghindari siksa-Nya dengan menaati ajaran-Nya''-."
  }
]