[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka pasti akan mengatakan,”milik Allah”, maka katakanlah kepada mereka “Apakah kalian tidak khawatir terhadap siksaanNya bila kalian justru menyembah selain Allah?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Mereka akan menjawab, \"Langit yang tujuh dan Arasy yang agung milik Allah.\" Maka katakanlah kepada mereka, \"Tidakkah kalian bertakwa kepada Allah dengan mengerjakan perintah dan menjauhi larangan-Nya agar kalian selamat dari azab-Nya?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. سَيَقُولُونَ لِلّٰهِ ۚ (Mereka akan menjawab: “Kepunyaan Allah”) Yakni langit adalah kepunyaan Allah semua. قُلْ (Katakanlah) Katakanlah hai Muhammad. أَفَلَا تَتَّقُونَ(“Maka apakah kamu tidak bertakwa?”) Yakni setelah kalian mengetahui tuhan-tuhan kalian tidak memiliki sesuatu apapun di langit, mengapa kalian menyembahnya padahal penyembahan adalah hak Allah semata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Mereka pasti akan menjawab: \"Itu semua milik Allah\". Lalu katakanlah: \"Lalu apakah kalian tidak takut akan hukuman Allah atas kesyirikan kalian?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka akan menjawab,“Milik Allah” Katakanlah,“Apakah kalian tidak bertakwa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86-87 berikutnya, beralihlah pada perkara yang lebih besar darinya. Allah berfirman, ”katakanlah, ’siapakah pemilik langit yang tujuh,’” dan benda-benda yang berada di dalamya, seperti benda yang bercahaya, bintang-bintang yang bergerak-gerak dan yang statis di tempatnya saja. “dan pemilik ‘ Arasy yang besar,” yang merupakan makhluk yang tertinggi dan paling luas serta terbesar. Siapakah yang menciptakan dan mengatur serta menanganinya dengan berbagai macam aturan? “mereka akan menjawab,’ kepunyaan Allah’.” Maksudnya, mereka kana mengakui bahwa Allah adalah Rabb (pemilik) itu semua. Bila mereka mengakuinya, katakanlah, ”maka apakah kamu tidak bertakwa,” dari beribadah kepada makhluk-makhluk yang lemah dan (hanya) bertakwa kepada Rabb yang Mahaagung, sempurna kekuasaanNYa dana gung kerajaanNya?! Ungkapan ini mengandung dengan jelas nada pembicaraan yang lembut (persuasive) dari Firman Allah, ”maka apakah kamu tidak ingat?” dan “maka apakah kamu tidak bertakwa?” menasihati melalui metode pemaparan yang memikat hati manfaatnya tidak perlu diragukan lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 87: Ketika mereka mengakui hal tersebut. Dengan menyembah Tuhan Yang Maha Agung, yang sempurna kekuasaan-Nya dan yang besar kerajaan-Nya, dan tidak menyembah selain-Nya. Dalam ayat-ayat di atas terdapat kelembutan firman-Nya, yaitu dari kata-kata, “\"Maka apakah kamu tidak ingat?” dan “Maka mengapa kamu tidak bertakwa?” Demikian pula nasehatnya yang menggunakan pertanyaan yang menggugah hati. Selanjutnya, Allah mengalihkan kepada sesuatu yang lebih luas dari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 87",
    "description": "-88-89. Wahai nabi Muhammad! pengingkaran orang-orang kafir itu sama sekali tidak berdasar, maka katakanlah kepada mereka, 'siapa-kah yang di tangan-Nya berada kekuasaan segala sesuatu. Dia melindungi, memelihara, dan memenangkan siapa yang dikehendaki-Nya, dan tidak ada yang dapat dilindungi dari azab-Nya apabila Allah sudah menetapkan siksa baginya' jawablah pertanyaan itu jika kamu mengetahui'' mereka pasti akan menjawab, 'milik Allah. ' maka, jelas sudah apa yang sebenarnya ada di benak mereka. Katakanlah lagi, 'bila demikian maka bagaimana kamu sampai tertipu oleh hawa nafsu dan bujukan setan untuk mendurhakai-Nya dan meyakini hari kebangkitan tidak akan terjadi''."
  }
]