[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, “Siapakah Pemilik segala sesuatu dan yang di TanganNya perbendaharaan segala sesuatu? Dan siapakah yang dapat melindungi orang yang memohon perlindungan? Tidak ada seorang pun yang kuasa melindungi dan menjaga seseorang yang Allah berkehendak untuk membinasakannya, dan tidak dapat menolak keburukan yang Allah telah takdirkan, bila kalian mengetahui hal tersebut?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Katakanlah kepada mereka, \"Siapakah yang ditangan-Nya berada kekuasaan segala sesuatu, tiada sesuatu pun yang keluar dari kekuasaan-Nya, Dia melindungi hamba-hamba yang dikehendaki-Nya, dan tidak ada yang dapat melindungi hamba yang ditetapkan keburukan oleh-Nya maupun menghalanginya dari azab, jika kalian mengetahui?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. قُلْ مَنۢ بِيَدِهِۦ مَلَكُوتُ كُلِّ شَىْءٍ (Katakanlah: “Siapakah yang di tangan-Nya berada kekuasaan atas segala sesuatu) Makna (الملكوت) adalah kerajaan. وَهُوَ يُجِيرُ (sedang Dia melindungi) Yakni Dia menolong atau membiarkan siapa yang Dia kehendaki. وَلَا يُجَارُ عَلَيْهِ(tetapi tidak ada yang dapat dilindungi dari (azab)-Nya) Yakni tidak ada seorangpun yang dapat menyelamatkan orang lain dari azab Allah, tidak ada yang mampu menolong dan menyelamatkan orang itu kecuali Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Katakan juga kepada mereka: \"Siapakah yang di tangan-Nya ada kekuasaan atas segala sesuatu, Dia Maha Melindungi, tetapi tidak ada yang dapat berlindung dari azab-Nya. Juga tidak ada sesuatu apapun yang dapat menyelamatkan dari azab-Nya. Jika memang kalian mengetahui itu, maka katakan padaku.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Siapakah yang di tanganNya kekuasaan} kekuasaan {segala sesuatu, dan Dia melindungi} melindungi siapa saja yang Dia kehendaki dari hambaNya dari orang yang hendak berbuat buruk dan mudharat kepadanya {dan tidak ada yang dapat dilindungi dariNya} dan tidak ada satu pun yang mampu mencegah keburukan dan kemudharatan dari orang kain jika Allah menghendaki hal itu terhadapnya {jika kalian mengetahui”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89 Berikutnya, beralih kepada pengakuan mereka mengenai sesuatu yang lebih umum dari itu semuanya. Allah berfirman, “katakanlah, ‘siapakah yang ditanganNya berada kekuasaan atas segala sesuatu’.” Maksudnya, segala kerajaan di wilayah atas maupun di wilayah bawah, yang dapat kita saksikan maupun tidak dapat kita tangkap. Kata malakut, merupakan bentuk mubalaghah yang artinya kerajaan. “sedang Dia melindungi,” para hambaNya dari kejelekan dan menyingkirkan hal-hal yang tidak mengenakan, serta melindungi mereka dari marabahaya yang membahayakan mereka. “tetapi tidak ada yang dapat dilindungi dari (azab) Nya,” maksudnya tidak ada seorangpun yang mampu menghalangi Allah dan menyingkirkan keburukan yang telah Allah tetapkan. Bahkan tidak ada seorangpun yang bisa mengeluarkan syafa’at di sisiNya-kecuali dengan izinNya. “mereka akan menjawab,’kepunyaan Allah’,” mereka akan menyampaikan pengakuan bahwa Allah-lah yang memiliki Dzat segala sesuatu, Yang melindungi, tanpa ada kekuatan apapun yang sanggup menghalangi (siksa) Nya. “katakanlah,” kepada mereka manakala mengakuinya untuk menuntut mereka “maka dari jalan manakah kamu ditipu,” kemana akal-akal kalian lenyap, saat kalian beribadah kepada obyek-obyek yang sudah kalian ketahui tidak mempunyai kerajaan, ataupun tidak mempunyai bagian dari kerajaan itu. Mereka lemah dari seluruh segi, sementara kalian meninggalkan pemurnian ibadah kepada Dzat pemilik Yang Mahaagung, Mahakuasa, Yang Mengatur segala urusan? Akal-akal yang menuntun kalian kepada fakta ini, telah tersihir. Tidak syak lagi tidak dirasuki sihir oleh setan melalui tipuan yang ia hiasi dengan indah pada pandangan mereka dan ia telah mempercantiknya dan memutar balikan fakta kepada mereka hingga berhasil menyihir akal-akal mereka, sebagaimana para tukang sihir berhasil memperdayai pandangan manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 88: Alam bagian atas maupun bawah, yang kita lihat dan yang tidak kita lihat. Dia melindungi hamba-hamba-Nya dari keburukan dan menjaga mereka dari sesuatu yang membahayakan mereka. Tidak ada yang mampu menghindarkan keburukan yang telah Allah tetapkan, bahkan tidak ada yang dapat memberi syafaat kecuali dengan izin-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 88",
    "description": "88-89. Wahai nabi Muhammad! pengingkaran orang-orang kafir itu sama sekali tidak berdasar, maka katakanlah kepada mereka, 'siapa-kah yang di tangan-Nya berada kekuasaan segala sesuatu. Dia melindungi, memelihara, dan memenangkan siapa yang dikehendaki-Nya, dan tidak ada yang dapat dilindungi dari azab-Nya apabila Allah sudah menetapkan siksa baginya' jawablah pertanyaan itu jika kamu mengetahui'' mereka pasti akan menjawab, 'milik Allah. ' maka, jelas sudah apa yang sebenarnya ada di benak mereka. Katakanlah lagi, 'bila demikian maka bagaimana kamu sampai tertipu oleh hawa nafsu dan bujukan setan untuk mendurhakai-Nya dan meyakini hari kebangkitan tidak akan terjadi''88-89"
  }
]