[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka akan menjawab, “Bahwa sesungguhnya semua itu kepunyaan Allah.” katakanlah kepada mereka, “Bagaimana bisa akal-akal kalian lenyap, dan kalian diperdayai dan dipalingkan dari mentauhidkan Allah dan ketaatan kepadaNya, dan dari membenarkan perkara kebangkitan dan kebangkitan kembali setelah kematian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Mereka akan menjawab, \"Semua kekuasaan milik Allah -Subḥānahu.\" Maka katakanlah pada mereka, \"Kalau demikian, maka bagaimana akal kalian bisa tidak mampu berpikir, sehingga menyembah selain-Nya padahal kalian mengakui-Nya?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. قُلْ فَأَنَّىٰ تُسْحَرُونَ (Katakanlah: “(Kalau demikian), maka dari jalan manakah kamu ditipu?”) Yakni bagaimana digambarkan bagi kalian kebenaran sebagai kebatilan dan kebaikan sebagai kerusakan, sehingga kalian menyembah selain Allah, padahal kebenaran begitu jelas seakan-akan kalian telah terkena sihir dari penyihir sehingga menghilangkan akal kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Mereka akan menjawab: \"Semua itu adalah milik Allah.\". Lalu katakanlah: \"Kalau memang demikian, maka dari celah yang mana kalian bisa menyimpang dari kebenaran, kalian seperti terkena sihir. Sehingga kalian berpaling dari petunjuk, ketaatan kepada Allah dan mengesakan-Nya.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka akan menjawab,“Milik Allah” Katakanlah,“Bagaimana kalian bisa tertipu”} maka bagaimana akal kalian hilang dan tidak mau bertauhid kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89 Berikutnya, beralih kepada pengakuan mereka mengenai sesuatu yang lebih umum dari itu semuanya. Allah berfirman, “katakanlah, ‘siapakah yang ditanganNya berada kekuasaan atas segala sesuatu’.” Maksudnya, segala kerajaan di wilayah atas maupun di wilayah bawah, yang dapat kita saksikan maupun tidak dapat kita tangkap. Kata malakut, merupakan bentuk mubalaghah yang artinya kerajaan. “sedang Dia melindungi,” para hambaNya dari kejelekan dan menyingkirkan hal-hal yang tidak mengenakan, serta melindungi mereka dari marabahaya yang membahayakan mereka. “tetapi tidak ada yang dapat dilindungi dari (azab) Nya,” maksudnya tidak ada seorangpun yang mampu menghalangi Allah dan menyingkirkan keburukan yang telah Allah tetapkan. Bahkan tidak ada seorangpun yang bisa mengeluarkan syafa’at di sisiNya-kecuali dengan izinNya. “mereka akan menjawab,’kepunyaan Allah’,” mereka akan menyampaikan pengakuan bahwa Allah-lah yang memiliki Dzat segala sesuatu, Yang melindungi, tanpa ada kekuatan apapun yang sanggup menghalangi (siksa) Nya. “katakanlah,” kepada mereka manakala mengakuinya untuk menuntut mereka “maka dari jalan manakah kamu ditipu,” kemana akal-akal kalian lenyap, saat kalian beribadah kepada obyek-obyek yang sudah kalian ketahui tidak mempunyai kerajaan, ataupun tidak mempunyai bagian dari kerajaan itu. Mereka lemah dari seluruh segi, sementara kalian meninggalkan pemurnian ibadah kepada Dzat pemilik Yang Mahaagung, Mahakuasa, Yang Mengatur segala urusan? Akal-akal yang menuntun kalian kepada fakta ini, telah tersihir. Tidak syak lagi tidak dirasuki sihir oleh setan melalui tipuan yang ia hiasi dengan indah pada pandangan mereka dan ia telah mempercantiknya dan memutar balikan fakta kepada mereka hingga berhasil menyihir akal-akal mereka, sebagaimana para tukang sihir berhasil memperdayai pandangan manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 89: Jika memang mereka mengakuinya. Yakni dipalingkan dari kebenaran, yaitu beribadah hanya kepada Allah saja, dan bagaimana terbayang olehmu bahwa yang demikian salah? Di manakah akal kamu? Kamu sembah sesuatu yang tidak memiliki kekuasaan dan lemah. Oleh karena itu, akal kamu jika seperti itu berarti telah tersihir, disihir oleh setan, dihiasi olehnya dan dibalikkan hakikat olehnya sehingga akal mereka tersihir, sebagaimana para pesihir menyihir mata-mata manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 89",
    "description": "88-89. Wahai nabi Muhammad! pengingkaran orang-orang kafir itu sama sekali tidak berdasar, maka katakanlah kepada mereka, 'siapa-kah yang di tangan-Nya berada kekuasaan segala sesuatu. Dia melindungi, memelihara, dan memenangkan siapa yang dikehendaki-Nya, dan tidak ada yang dapat dilindungi dari azab-Nya apabila Allah sudah menetapkan siksa baginya' jawablah pertanyaan itu jika kamu mengetahui'' mereka pasti akan menjawab, 'milik Allah. ' maka, jelas sudah apa yang sebenarnya ada di benak mereka. Katakanlah lagi, 'bila demikian maka bagaimana kamu sampai tertipu oleh hawa nafsu dan bujukan setan untuk mendurhakai-Nya dan meyakini hari kebangkitan tidak akan terjadi''90. Hari kebangkitan bukanah dongeng umat terdahulu belaka. Padahal kami, melalui para rasul yang kami utus telah membawa kebenaran yang mutlak, sempurna, dan tidak mengandung keraguan apalagi kebatilan, kepada mereka, yaitu orang-orang kafir itu, tetapi mereka benar-benar pendusta."
  }
]