[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang senantiasa tekun menjalankan shalat mereka pada waktu-waktunya sesuai dengan tata caranya yang disyariatkan yang bersumber dari Nabi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan orang-orang yang memelihara salatnya dengan cara konsisten mengerjakannya, dan mengerjakannya tepat pada waktunya dengan menyempurnakan rukun-rukun, wajib-wajib dan sunnah-sunnahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَالَّذِينَ هُمْ عَلَىٰ صَلَوٰتِهِمْ يُحَافِظُونَ (dan orang-orang yang memelihara shalatnya) Dengan mendirikannya pada waktunya, menyempurnakan ruku’, sujud, bacaan, dan zikir-zikirnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Serta orang-orang yang memelihara/menjaga sembahyangnya dengan menyempurnakan rukun, dan waktu pelaksanaannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang memelihara shalat mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9 “Dan orang-orang yang memelihara shalatnya,” maksudnya yang menegakkannya secara tekun pada waktu-waktunya, sesuai aturan-aturan, syarat-syarat edan rukun-rukunnya. Allah menyanjung mereka karena tingkat kekhusu’an menjadi sempurna berkat dua hal itu. Barangsiapa yang menekuni pelaksanaan shalat tanpa khusu’ atau menunaikannya dengan khusu’ tapi tanpa dibarengi dengan ketekunan, maka ia tercela lagi kurang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 9: Yakni pada waktunya. Mereka pelihara pula syarat dan rukunnya, yang wajibnya dan melakukan adab-adabnya. Allah memuji mereka karena shalat mereka yang khusyu’ dan karena mereka menjaganya, dengan demikian shalat mereka menjadi sempurna, karena tidak mungkin shalat seseorang sempurna, jika selalu memeliharanya namun tidak khusyu’ atau khusyu’ dalam shalatnya namun tidak memeliharanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 9",
    "description": "Serta beruntung pulalah orang yang memelihara salatnya, di antaranya dengan memelihara waktu salat yang utama, yaitu awal waktu, serta memelihara pula rukun, wajib, dan sunahnya. 10-11. Demikianlah sifat-sifat orang mukmin yang akan meraih keberuntungan. Sebagai ganjarannya, mereka itulah orang yang akan mewarisi, yakni mewarisi dan memperoleh surga firdaus. Mereka akan kekal di dalam kenikmatan dan kebahagiaan-Nya."
  }
]