[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan Kami telah membawakan kepada mereka kebenaran dalam risalah yang Kami utus Muhammad untuk mengembannya. Dan sesungguhnya mereka benar-benar berdusta dalam perbuatan syirik mereka dan pengingkaran mereka terhadap kebangkitan kembali pasca kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Kenyataannya bukanlah seperti yang mereka tuduhkan, tetapi Kami telah mendatangkan pada mereka kebenaran yang tiada keraguan di dalamnya. Sungguh mereka benar-benar berdusta dengan menuduhkan bahwa Allah memiliki sekutu dan anak. Mahatinggi Allah dari apa yang mereka ucapkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90-91. Hakikat kebangkitan bukan seperti yang mereka anggap; mereka telah mengingkari hari kebangkitan dan berdusta terhadap Allah tanpa landasan ilmu. Kami telah mendatangkan kepada mereka kebenaran yang sebenarnya; dan mereka sungguh berdusta karena telah mengingkari hari kebangkitan dan kareka kesyirikan mereka. Allah sama sekali tidak memiliki anak, baik itu dari kalangan malaikat maupun manusia, dan tidak ada yang bersekutu dengan-Nya dalam hak untuk disembah. Seandainya terdapat tuhan-tuhan selain Dia, niscaya setiap tuhan akan menciptakan ciptaannya, dan tuhan yang kuat akan mengalahkan tuhan yang lemah. Maha Suci Allah dari segala kedustaan mereka; hanya Allah yang mengetahui segala hal tersembunya dan yang tampak dari makhluk-Nya. Allah Maha Agung dan Maha Suci dari memiliki sekutu dan anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Bahkan, sebenarnya Kami telah membawa kebenaran kepada mereka para musyrikun dengan perkataan yang benar dan pasti, tidak ada keraguan dan kebatilan padanya. Sebagai petunjuk atas kemahaesaan Kami, namu sesungguhnya mereka benar-benar orang-orang yang berdusta atas apa yang telah mereka sandingkan kepada Allah pada kesyirikan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Padahal Kami telah membawa kebenaran kepada mereka, dan sesungguhnya mereka benar-benar pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-92 Allah berfirman, ”bahkan kami telah membawa kebenaran kepada orang-orang yang mendustakan itu, yang memuat kejujuran dalam informasinya, keadilan dalam perintah dan larangannya. Kenapa mereka tidak mengakuinya? Padahal ia lebih pantas untuk diikuti. Sementara mereka tidak memiliki sesuatu yang menggantikannya melainkan kedustaan dan kedzaliman?! Oleh karena itu, Allah berfirman, “Dan sesungguhnya mereka benar-benar orang-orang yang berdusta. Allah sekali-kali tidak mempunyai anak., dan sekali-kali tidak ada tuhan (yang lain) besertaNya.” Itu merupakan bentuk kebohongan yang dapat dideteksi melalui berita dari Allah dan RasulNya serta dapat dikenal melalui akal yang sehat. Oleh sebab itu, Allah mengingatkan tentang sebuah teori logika mengenai kemustahilan eksistensi dua tuhan (dialam semesta ini). Allah berfirman, “kalau ada tuhan bersamaNya,” jika ada sesembahan bersama Allah seperti yang mereka ucapkan “masing-masing tuhan itu akan membawa makhluk yang diciptakannya,” maksudnya, maka masing-masing sesembahan itu akan menyendiri dengan ciptaan-ciptaannya dan membentuk komunitas sendiri dengannya, dan sudah tentu berantusias untuk menghambat dan mengalahkan sesembahan lainnya. “Dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain,” pihak yang menang, akan menjadi sesembahan yang disembah. Dengan adanya unsur yang saling kontradiktif ini, maka alam semesta ini tidak mungkin ada. Dan tidak bisa dibayangkan bisa teratur dengan pengaturan yang mencengangkan akal-akal manusia. Ambilah pelajaran dari matahari, bulan, bintang-bintang, yang diam maupun yang beredar. Sejak penciptaanya, benda-benda langit itu beredar berdasarkan satu kendali dan pengaturan. Masing-masing dikendalikan dengan kekuasaan, diatur dengan penuh hikmah demi kepentingan umat manusia, bukan sebatas untuk kepentingan satu individu dengan mengesampingkan orang lain. Engkau tidak akan menyaksikan kekeliruan, kontradiksi dan tabrakan dalam pengaturan sekecil apapun. Apakah masih terbayangkan keseragaman itu muncul dari pengaturan dua sesembahan dan dua pemilik? “Mahasuci Allah dari apa yang mereka sifatkan,” alam semesta ini telah mengekspresikan dengan bahasa geraknya dan memberikan pemahaman melalui bentuknya yang indah, bahwa Dzat yang mengaturnya adalah tuhan (sesembahan) yang satu, sempurna dalam nama-nama dan sifat-sifatNya. Sungguh, seluruh makhluk membutuhkanNYa dalam rububiyyah dan uluhiyyahNya baginya. Sebagaimana ia tidak mempunyai wujud dan keabadian kecuali berkat rububiyyah Allah, begitu pula tidak ada kebaikan dan landasan kekuatan kecuali dengan sebab peribadahan kepadaNya dan mengesakanNYa dengan ketaatan. Untuk itu, Allah mengingatkan tentang keagungan sifat-sifatNya melalui beberapa permisalan. Misalnya, ilmuNya yang meliputi (segala sesuatu). Allah berfirman, ”Yang mengetahui semua yang ghaib,” yaitu, perkara-perkara yang terlewatkan oleh indera-indera pandangan kita dan pengetahuan kita, seperti hal-hal yang mesti terjadi (al-wajibat), perkara yang mustahil (al-mustahilat) dan kemungkinan-kemungkinan yang timbul (al-mukminat). “Dan semua yang Nampak,” yaitu segala yang bisa kita saksikan. “Mahatinggi Allah,” Mahatinggi lagi Mahaagung, “dari apa yang mereka persekutukan,” denganNya, tiada ilmu yang mereka miliki kecuali yang telah diajarkan oleh Allah kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 90: Yang di dalamnya mengandung berita yang benar, perintah dan larangannya adil. Termasuk ke dalam kebenaran yang dimaksud adalah kepercayaan tentang tauhid dan hari berbangkit. Mengapa mereka tidak mengakui kebenaran itu, padahal kebenaran lebih berhak diikuti? Maka berarti mereka yang dusta dan zalim. Karena menafikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 90",
    "description": "Hari kebangkitan bukanah dongeng umat terdahulu belaka. Padahal kami, melalui para rasul yang kami utus telah membawa kebenaran yang mutlak, sempurna, dan tidak mengandung keraguan apalagi kebatilan, kepada mereka, yaitu orang-orang kafir itu, tetapi mereka benar-benar pendusta. 91. Salah satu kedustaan kaum kafir terhadap Allah adalah menuduh Allah memiliki sekutu dan anak; suatu tuduhan yang Allah bantah melalui ayat ini. Allah tidak mempunyai anak, dan tidak ada tuhan pencipta dan penguasa alam raya yang lain bersama-Nya. Sekiranya tuhan lebih dari satu maka masing-masing tuhan itu pasti akan membawa apa, yakni makhluk, yang diciptakannya untuk diaturnya sendiri, dan sebagian dari tuhan-tuhan yang kuat akan mengalahkan sebagian tuhan yang lain yang lebih lemah. Dia berbuat demikian untuk memperluas kekuasaan-Nya, seperti halnya yang terjadi pada para penguasa di dunia. Mahasuci Allah dari apa yang mereka sifatkan itu. Sifat-sifat yang kaum kafir lekatkan kepada Allah bertentangan dengan kebenaran."
  }
]