[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak mengadakan bagi DzatNya seorang anak pun, dan sekali-kali tidak ada sesembahan lain bersamaNya. Sebab, bila di alam semesta ada tuhan sesembahan lebih dari satu, maka pastilah tiap-tiap tuhan akan memperhatikan makhluk-makhluk ciptaanya sendiri-sendiri, dan tentulah akan terjadi saling mengalahkan antara tuhan-tuhan itu, layaknya raja-raja di muka bumi, sehingga kacaulah pengaturan alam semesta. Allah Mahabersih dan Mahasuci dari sifat yang mereka sandangkan kepadaNya bahwa Dia memiliki sekutu atau anak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Allah tidaklah memiliki anak sebagaimana tuduhan kaum kuffar, dan tidak ada tuhan lain yang berhak disembah bersama-Nya. Sekiranya ada tuhan lain yang berhak disembah bersama-Nya, niscaya masing-masing tuhan itu akan membawa dan menguasai makhluk yang diciptakannya, dan sebagian tuhan-tuhan itu akan mengalahkan yang lainnya, sehingga urusan alam semesta akan hancur berantakan. Tapi kenyataannya hal ini sama sekali tidaklah terjadi, sehingga menunjukkan bahwa tuhan sesembahan yang berhak disembah hanyalah satu yaitu Allah semata, Dia Maha Suci lagi Agung dari apa yang orang-orang musyrik sifatkan pada-Nya berupa kepemilikan anak dan sekutu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. إِذًا لَّذَهَبَ كُلُّ إِلٰهٍۭ بِمَا خَلَقَ (kalau ada tuhan beserta-Nya, masing-masing tuhan itu akan membawa makhluk yang diciptakannya) Yakni seandainya terdapat tuhan-tuhan selain Allah niscaya setiap tuhan akan menciptakan ciptaannya dan kekuasaannya akan terpisah dari kekuasaan tuhan lainnya sehingga akan terjadi perebutan dan peperangan di antara tuhan-tuhan tersebut. وَلَعَلَا بَعْضُهُمْ عَلَىٰ بَعْضٍ ۚ( dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain) Yakni tuhan yang kuat akan mengalahkan tuhan yang lemah dan akan mengambil kekuasaan miliknya sebagaimana yang terjadi pada para raja dari golongan manusia; dan jika itu sudah terjadi maka tuhan yang lemah dan terkalahkan itu tidak layak untuk menjadi tuhan. Jika telah jelas bahwa ketuhanan hanya ada pada satu dzat, maka yang satu itu pasti adalah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Allah sekali-kali tidak pernah dan tidak akan mempunyai anak, juga tidak ada tuhan selain Dia dalam ketuhanan maupun kerajaan. sebagai penyucian dan pemurnian asma-Nya dari semua itu. Kalau ada tuhan lain selain Dia, masing-masing tuhan itu akan membawa makhluk yang diciptakannya. Tuhan-tuhan itu akan mengalahkan tuhan singan mereka yang lain untuk mengalahkan yang lebih lemah dan memperluas kekuasaannya sebagaimana yang dilakukan oleh para penguasa di dunia. Maha Suci Allah dari segala apapun yang mereka sifatkan itu baik berupa anak maupun sekutu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak mengangkat anak dan tidak ada tuhan lain bersamaNya. Jika demikian, maka setiap tuhan itu akan pergi} menyendiri {dengan apa yang dia ciptakan dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain} maka sebagian tuhan-tuhan itu akan mengalahkan sebagian lain, seperti membuat kerajaan-kerajaan dunia di antara mereka {Maha suci Allah dari apa yang mereka sifatkan} dari pensifatan mereka kepadaNya berupa sekutu dan anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-92 Allah berfirman, ”bahkan kami telah membawa kebenaran kepada orang-orang yang mendustakan itu, yang memuat kejujuran dalam informasinya, keadilan dalam perintah dan larangannya. Kenapa mereka tidak mengakuinya? Padahal ia lebih pantas untuk diikuti. Sementara mereka tidak memiliki sesuatu yang menggantikannya melainkan kedustaan dan kedzaliman?! Oleh karena itu, Allah berfirman, “Dan sesungguhnya mereka benar-benar orang-orang yang berdusta. Allah sekali-kali tidak mempunyai anak., dan sekali-kali tidak ada tuhan (yang lain) besertaNya.” Itu merupakan bentuk kebohongan yang dapat dideteksi melalui berita dari Allah dan RasulNya serta dapat dikenal melalui akal yang sehat. Oleh sebab itu, Allah mengingatkan tentang sebuah teori logika mengenai kemustahilan eksistensi dua tuhan (dialam semesta ini). Allah berfirman, “kalau ada tuhan bersamaNya,” jika ada sesembahan bersama Allah seperti yang mereka ucapkan “masing-masing tuhan itu akan membawa makhluk yang diciptakannya,” maksudnya, maka masing-masing sesembahan itu akan menyendiri dengan ciptaan-ciptaannya dan membentuk komunitas sendiri dengannya, dan sudah tentu berantusias untuk menghambat dan mengalahkan sesembahan lainnya. “Dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain,” pihak yang menang, akan menjadi sesembahan yang disembah. Dengan adanya unsur yang saling kontradiktif ini, maka alam semesta ini tidak mungkin ada. Dan tidak bisa dibayangkan bisa teratur dengan pengaturan yang mencengangkan akal-akal manusia. Ambilah pelajaran dari matahari, bulan, bintang-bintang, yang diam maupun yang beredar. Sejak penciptaanya, benda-benda langit itu beredar berdasarkan satu kendali dan pengaturan. Masing-masing dikendalikan dengan kekuasaan, diatur dengan penuh hikmah demi kepentingan umat manusia, bukan sebatas untuk kepentingan satu individu dengan mengesampingkan orang lain. Engkau tidak akan menyaksikan kekeliruan, kontradiksi dan tabrakan dalam pengaturan sekecil apapun. Apakah masih terbayangkan keseragaman itu muncul dari pengaturan dua sesembahan dan dua pemilik? “Mahasuci Allah dari apa yang mereka sifatkan,” alam semesta ini telah mengekspresikan dengan bahasa geraknya dan memberikan pemahaman melalui bentuknya yang indah, bahwa Dzat yang mengaturnya adalah tuhan (sesembahan) yang satu, sempurna dalam nama-nama dan sifat-sifatNya. Sungguh, seluruh makhluk membutuhkanNYa dalam rububiyyah dan uluhiyyahNya baginya. Sebagaimana ia tidak mempunyai wujud dan keabadian kecuali berkat rububiyyah Allah, begitu pula tidak ada kebaikan dan landasan kekuatan kecuali dengan sebab peribadahan kepadaNya dan mengesakanNYa dengan ketaatan. Untuk itu, Allah mengingatkan tentang keagungan sifat-sifatNya melalui beberapa permisalan. Misalnya, ilmuNya yang meliputi (segala sesuatu). Allah berfirman, ”Yang mengetahui semua yang ghaib,” yaitu, perkara-perkara yang terlewatkan oleh indera-indera pandangan kita dan pengetahuan kita, seperti hal-hal yang mesti terjadi (al-wajibat), perkara yang mustahil (al-mustahilat) dan kemungkinan-kemungkinan yang timbul (al-mukminat). “Dan semua yang Nampak,” yaitu segala yang bisa kita saksikan. “Mahatinggi Allah,” Mahatinggi lagi Mahaagung, “dari apa yang mereka persekutukan,” denganNya, tiada ilmu yang mereka miliki kecuali yang telah diajarkan oleh Allah kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 91: Ya, Allah tidak memiliki anak dan tidak ada tuhan di samping-Nya. Hal ini berdasarkan berita dari Allah, berita para rasul-Nya dan berdasarkan akal yang sehat. Oleh karena itu, Allah Subhaanahu wa Ta'aala mengingatkan dalil akalnya yang menunjukkan mustahilnya ada banyak tuhan. Seperti yang dilakukan para raja di dunia, dan yang menang itulah yang menjadi tuhan, dan lagi alam semesta tidak akan mungkin terwujud secara teratur seperti ini jika ada banyak tuhan. Hal ini dapat kita lihat dari posisi matahari, bulan, bintang-bintang dan peredaran benda-benda luar angkasa secara teratur, di mana sejak diciptakan ia beredar di orbitnya, dan semuanya ditundukkan dengan kekuasaan-Nya dan diatur dengan hikmah untuk maslahat semua makhluk, tidak hanya khusus satu makhluk, dan lagi kita tidak tidak melihat adanya cacat dan pertentangan dalam pengaturan. Apakah mungkin terbayang bahwa hal itu diatur oleh dua atau lebih tuhan? Tidak, sama sekali tidak mungkin diatur oleh dua tuhan atau lebih, karena jika dua tuhan atau lebih tentu hancur dan alam semesta tidak akan teratur seperti ini. Alam semesta yang teratur itu dengan lisanulhal(lisan keadaannya)nya menerangkan bahwa yang mengaturnya hanya satu Tuhan, di mana Dia sempurna nama dan sifat-Nya, semua makhluk butuh kepada-Nya, sebagaimana ada dan tetapnya alam semesta ini dengan rububiyyah-Nya. Demikian pula untuk baik dan tetap tegaknya alam semesta ini adalah dengan beribadah hanya kepada-Nya dan menaati-Nya. Oleh karena itulah, Dia mengingatkan sesuatu yang menunjukkan keagungan sifat-Nya, yaitu ilmu-Nya yang meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 91",
    "description": "Salah satu kedustaan kaum kafir terhadap Allah adalah menuduh Allah memiliki sekutu dan anak; suatu tuduhan yang Allah bantah melalui ayat ini. Allah tidak mempunyai anak, dan tidak ada tuhan pencipta dan penguasa alam raya yang lain bersama-Nya. Sekiranya tuhan lebih dari satu maka masing-masing tuhan itu pasti akan membawa apa, yakni makhluk, yang diciptakannya untuk diaturnya sendiri, dan sebagian dari tuhan-tuhan yang kuat akan mengalahkan sebagian tuhan yang lain yang lebih lemah. Dia berbuat demikian untuk memperluas kekuasaan-Nya, seperti halnya yang terjadi pada para penguasa di dunia. Mahasuci Allah dari apa yang mereka sifatkan itu. Sifat-sifat yang kaum kafir lekatkan kepada Allah bertentangan dengan kebenaran. 92. Dialah tuhan yang mengetahui semua yang gaib dari pandangan manusia dan semua yang tampak. Mahatinggi Allah dari apa yang mereka persekutukan seperti kepercayaan kaum musyrik tersebut."
  }
]