[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah Allah semata, Yang mengetahui semua yang ghaib bagi makhlukNya dan apa yang dapat mereka saksikan. Maka Allah Maha bersih dari sekutu yang mereka klaim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Dia Maha Mengetahui segala sesuatu yang gaib dari makhluk-makhluk-Nya, juga Maha Mengetahui segala sesuatu yang nampak dan dirasakan oleh panca indera, tiada suatu pun dari semua itu yang tersembunyi bagi-Nya, maka Mahatinggi Allah dari apa yang mereka persekutukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. عٰلِمِ الْغَيْبِ وَالشَّهٰدَةِ (Yang mengetahui semua yang ghaib dan semua yang nampak) Allah semata yang mengetahui tentang hal yang ghaib dan yang nampak; adapun selain Allah mungkin mengetahui yang nampak namun ia tidak mengetahui hal yang ghaib. فَتَعٰلَىٰ( maka Maha Tinggilah Dia) Yakni Allah. عما يشركون (dari apa yang mereka persekutukan) Yakni Allah Maha Tinggi dari sekedar memiliki sekutu dalam kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Allah Maha mengetahui dengan sempurna semua makhluk ghaib dan semua makhluk yang nampak, maka Maha Tinggi Allah dari apa yang mereka persekutukan berupa makhluk yang tampak ataupun yang tidak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dzat Yang Maha Mengetahui yang gaib dan yang tampak. Maha tinggi dari apa yang mereka sekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-92 Allah berfirman, ”bahkan kami telah membawa kebenaran kepada orang-orang yang mendustakan itu, yang memuat kejujuran dalam informasinya, keadilan dalam perintah dan larangannya. Kenapa mereka tidak mengakuinya? Padahal ia lebih pantas untuk diikuti. Sementara mereka tidak memiliki sesuatu yang menggantikannya melainkan kedustaan dan kedzaliman?! Oleh karena itu, Allah berfirman, “Dan sesungguhnya mereka benar-benar orang-orang yang berdusta. Allah sekali-kali tidak mempunyai anak., dan sekali-kali tidak ada tuhan (yang lain) besertaNya.” Itu merupakan bentuk kebohongan yang dapat dideteksi melalui berita dari Allah dan RasulNya serta dapat dikenal melalui akal yang sehat. Oleh sebab itu, Allah mengingatkan tentang sebuah teori logika mengenai kemustahilan eksistensi dua tuhan (dialam semesta ini). Allah berfirman, “kalau ada tuhan bersamaNya,” jika ada sesembahan bersama Allah seperti yang mereka ucapkan “masing-masing tuhan itu akan membawa makhluk yang diciptakannya,” maksudnya, maka masing-masing sesembahan itu akan menyendiri dengan ciptaan-ciptaannya dan membentuk komunitas sendiri dengannya, dan sudah tentu berantusias untuk menghambat dan mengalahkan sesembahan lainnya. “Dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain,” pihak yang menang, akan menjadi sesembahan yang disembah. Dengan adanya unsur yang saling kontradiktif ini, maka alam semesta ini tidak mungkin ada. Dan tidak bisa dibayangkan bisa teratur dengan pengaturan yang mencengangkan akal-akal manusia. Ambilah pelajaran dari matahari, bulan, bintang-bintang, yang diam maupun yang beredar. Sejak penciptaanya, benda-benda langit itu beredar berdasarkan satu kendali dan pengaturan. Masing-masing dikendalikan dengan kekuasaan, diatur dengan penuh hikmah demi kepentingan umat manusia, bukan sebatas untuk kepentingan satu individu dengan mengesampingkan orang lain. Engkau tidak akan menyaksikan kekeliruan, kontradiksi dan tabrakan dalam pengaturan sekecil apapun. Apakah masih terbayangkan keseragaman itu muncul dari pengaturan dua sesembahan dan dua pemilik? “Mahasuci Allah dari apa yang mereka sifatkan,” alam semesta ini telah mengekspresikan dengan bahasa geraknya dan memberikan pemahaman melalui bentuknya yang indah, bahwa Dzat yang mengaturnya adalah tuhan (sesembahan) yang satu, sempurna dalam nama-nama dan sifat-sifatNya. Sungguh, seluruh makhluk membutuhkanNYa dalam rububiyyah dan uluhiyyahNya baginya. Sebagaimana ia tidak mempunyai wujud dan keabadian kecuali berkat rububiyyah Allah, begitu pula tidak ada kebaikan dan landasan kekuatan kecuali dengan sebab peribadahan kepadaNya dan mengesakanNYa dengan ketaatan. Untuk itu, Allah mengingatkan tentang keagungan sifat-sifatNya melalui beberapa permisalan. Misalnya, ilmuNya yang meliputi (segala sesuatu). Allah berfirman, ”Yang mengetahui semua yang ghaib,” yaitu, perkara-perkara yang terlewatkan oleh indera-indera pandangan kita dan pengetahuan kita, seperti hal-hal yang mesti terjadi (al-wajibat), perkara yang mustahil (al-mustahilat) dan kemungkinan-kemungkinan yang timbul (al-mukminat). “Dan semua yang Nampak,” yaitu segala yang bisa kita saksikan. “Mahatinggi Allah,” Mahatinggi lagi Mahaagung, “dari apa yang mereka persekutukan,” denganNya, tiada ilmu yang mereka miliki kecuali yang telah diajarkan oleh Allah kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 92: Baik yang wajib ada, yang mustahil dan yang mungkin ada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 92",
    "description": "Dialah tuhan yang mengetahui semua yang gaib dari pandangan manusia dan semua yang tampak. Mahatinggi Allah dari apa yang mereka persekutukan seperti kepercayaan kaum musyrik tersebut. 93-94. Kezaliman kaum musyrik dengan menolak kebenaran itu meng-undang datangnya siksa Allah. Allah lalu mengajari nabi doa berikut. Katakanlah, wahai nabi Muhammad, 'ya tuhanku, seandainya engkau hendak memperlihatkan kepadaku sebelum kematianku azab yang diancamkan kepada mereka, ya tuhanku, maka janganlah engkau jadikan aku termasuk dalam golongan orang-orang zalim, dan jauhkanlah aku dari mereka. '."
  }
]