[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "93-94. Katakanlah (wahai Rasul), “Wahai Tuhanku, jika Engkau hendak memperlihatkan kepadaku tentang orang-orang musyrik itu, apa yang diperingatkan kepada mereka berupa siksaanMu, maka janganlah Engkau membinasakan aku dengan siksaan yang Engkau timpakan untu membinasakan mereka, dan selamatkanlah aku dari siksaan dan kemurkaanMu. Maka janganlah Engkau jadikan aku termasuk orang-orang musyrik lagi berbuat kezhaliman. Akan tetapi, jadikanlah aku termasuk orang yang Engkau ridhai.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Katakanlah -wahai Rasul-, \"Wahai Tuhanku! Seandainya Engkau hendak memperlihatkan padaku azab yang Engkau ancamkan kepada orang-orang musyrik itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93-95. Hai Rasulullah, katakanlah: “Ya Tuhanku, jika Engkau hendak menunjukkan kepadaku azab dunia yang Engkau ancamkan kepada mereka, maka janganlah Engkau membinasakanku bersama orang-orang musyrik itu.” Dan Kami berkuasa untuk menunjukkan kepadamu azab yang Kami ancamkan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. قُل رَّبِّ إِمَّا تُرِيَنِّى مَا يُوعَدُونَ (Katakanlah: “Ya Tuhanku, jika Engkau sungguh-sungguh hendak memperlihatkan kepadaku azab yang diancamkan kepada mereka) Yakni Ya Tuhanku seandainya aku harus Engkau tunjukkan azab yang Engkau janjikan bagi mereka yang membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Katakanlah wahai Nabi: \"Ya Tuhanku, jika Engkau sungguh-sungguh hendak memperlihatkan kepadaku azab yang diancamkan kepada mereka,”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Ya Tuhanku, jika Engkau benar-benar memperlihatkan kepadaku apa yang diancamkan kepada mereka} jika Engkau memperlihatkan kepadaku apa yang dijanjikan kepada mereka berupa turunnya azab kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93-95 Setelah Allah menegakkan bukti-bukti kekuasaanNya yanga gung atas kaum pendusta, (tapi) mereka tidak menolehkan pandangan kepadanya, dan tideak tunduk kepadanya, maka menjadi pastilah siksa bagi mereka, lalu mereka diancam dengan turunnya azab, dan Allah memberikan petunjuk kepada RasulNya agar mengatakan, “Ya Rabbku, jika Engkau sungguh-sungguh hendak memperlihatkan kepadaku azab yang diancamkan kepada mereka.” Maksudnya, lindunglah aku, kasihilah aku dari bencana yang Engkau ujikan kepada mereka, berupa dosa-dosa yang akan mendatangkan azab. Peliharalah aku juga dari siksaan yang menghampiri mereka. Sebab hukuman yang menyeluruh, saat turun bisa menimpa orang yang bermaksiat dan lainnya secara umum. Allah berfirman untuk menerangkan dekatnya waktu siksaan mereka, “dan sesungguhnya Kami benar-benar kuasa untuk memperlihatkan kepadamu apa yang kami ancamkan kepada mereka. Akan tetapi, bila kami menundanya, maka penundaan itu atas dasar hikmah. Kalau tidak demikian, maka kekuasaan kami sudah sanggup untuk menjatuhkannya [kepada mereka]."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 93: Setelah Allah Subhaanahu wa Ta'aala menunjukkan bukti-bukti-Nya yang begitu jelas kepada mereka yang mendustakan, namun ternyata mereka tetap tidak memperhatikannya dan tidak mau tunduk, di mana hal itu sesungguhnya mengharuskan mereka menerima azab dan diancam dengan turunnya azab, maka Allah membimbing Rasul-Nya untuk mengatakan sebagaimana yang disebutkan dalam ayat di atas. Maksudnya, kapan waktu Engkau memperlihatkan kepadaku azab yang diancamkan itu? Ternyata, hal itu pun terjadi dengan terbunuhnya mereka di perang Badar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 93",
    "description": "93-94. Kezaliman kaum musyrik dengan menolak kebenaran itu meng-undang datangnya siksa Allah. Allah lalu mengajari nabi doa berikut. Katakanlah, wahai nabi Muhammad, 'ya tuhanku, seandainya engkau hendak memperlihatkan kepadaku sebelum kematianku azab yang diancamkan kepada mereka, ya tuhanku, maka janganlah engkau jadikan aku termasuk dalam golongan orang-orang zalim, dan jauhkanlah aku dari mereka. '93-94"
  }
]