[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "93-94. Katakanlah (wahai Rasul), “Wahai Tuhanku, jika Engkau hendak memperlihatkan kepadaku tentang orang-orang musyrik itu, apa yang diperingatkan kepada mereka berupa siksaanMu, maka janganlah Engkau membinasakan aku dengan siksaan yang Engkau timpakan untu membinasakan mereka, dan selamatkanlah aku dari siksaan dan kemurkaanMu. Maka janganlah Engkau jadikan aku termasuk orang-orang musyrik lagi berbuat kezhaliman. Akan tetapi, jadikanlah aku termasuk orang yang Engkau ridhai.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Wahai Tuhanku! Jika Engkau mengazab mereka sedang aku menyaksikan hal itu, maka janganlah jadikan aku termasuk golongan mereka hingga aku ditimpa azab yang juga menimpa mereka.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. رَبِّ فَلَا تَجْعَلْنِى فِى الْقَوْمِ الظّٰلِمِينَ (ya Tuhanku, maka janganlah Engkau jadikan aku berada di antara orang-orang yang zalim”.) Yakni Ya Tuhanku jika Engkau menurunkan siksa-Mu kepada mereka maka jadikanlah aku bukan termasuk dari mereka; aku dapat melihat azab mereka dari jauh namun jangan sampai aku tertimpa azab itu karena aku beriman kepada-Mu dan mempercayai janji-janji-Mu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Maka janganlah Engkau jadikan aku berada di antara orang-orang yang zalim dan binasa bersama mereka, maka jauhkanlah aku dari mereka\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ya Tuhanku, janganlah Engkau menjadikanku termasuk kaum yang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93-95 Setelah Allah menegakkan bukti-bukti kekuasaanNya yanga gung atas kaum pendusta, (tapi) mereka tidak menolehkan pandangan kepadanya, dan tideak tunduk kepadanya, maka menjadi pastilah siksa bagi mereka, lalu mereka diancam dengan turunnya azab, dan Allah memberikan petunjuk kepada RasulNya agar mengatakan, “Ya Rabbku, jika Engkau sungguh-sungguh hendak memperlihatkan kepadaku azab yang diancamkan kepada mereka.” Maksudnya, lindunglah aku, kasihilah aku dari bencana yang Engkau ujikan kepada mereka, berupa dosa-dosa yang akan mendatangkan azab. Peliharalah aku juga dari siksaan yang menghampiri mereka. Sebab hukuman yang menyeluruh, saat turun bisa menimpa orang yang bermaksiat dan lainnya secara umum. Allah berfirman untuk menerangkan dekatnya waktu siksaan mereka, “dan sesungguhnya Kami benar-benar kuasa untuk memperlihatkan kepadamu apa yang kami ancamkan kepada mereka. Akan tetapi, bila kami menundanya, maka penundaan itu atas dasar hikmah. Kalau tidak demikian, maka kekuasaan kami sudah sanggup untuk menjatuhkannya [kepada mereka]."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 94: Sehingga aku pun binasa ketika mereka binasa. Oleh karena itu, lindungilah dan sayangilah aku dari cobaan yang menimpa mereka berupa dosa-dosa yang mengharuskan untuk diazab, dan sayangilah aku dari azab yang menimpa mereka, karena azab yang umum apabila datang, maka ia menimpa semua orang tanpa terkecuali, baik orang yang bermaksiat maupun yang tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 94",
    "description": "93-94. Kezaliman kaum musyrik dengan menolak kebenaran itu meng-undang datangnya siksa Allah. Allah lalu mengajari nabi doa berikut. Katakanlah, wahai nabi Muhammad, 'ya tuhanku, seandainya engkau hendak memperlihatkan kepadaku sebelum kematianku azab yang diancamkan kepada mereka, ya tuhanku, maka janganlah engkau jadikan aku termasuk dalam golongan orang-orang zalim, dan jauhkanlah aku dari mereka. '95. Allah mengajari nabi doa tersebut bukan karena Allah tidak kuasa menjatuhkan siksa saat nabi masih hidup, namun dia hanya menundanya sebagaimana ditegaskan dalam ayat ini. Dan sungguh, kami benar-benar kuasa untuk memperlihatkan kepadamu, wahai nabi Muhammad, apa yang kami ancamkan kepada mereka. Karena itu, janganlah engkau berduka atas pendustaan mereka kepadamu."
  }
]