[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami benar-benar kuasa untuk memperlihatkan kepadamu apa yang Kami ancamkan kepada mereka berupa siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Dan sungguh, Kami kuasa untuk memperlihatkan padamu azab yang Kami ancamkan kepada mereka. Kami sama sekali tidak lemah untuk melakukannya dan melakukan hal selainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. وَإِنَّا عَلَىٰٓ أَن نُّرِيَكَ مَا نَعِدُهُمْ لَقٰدِرُونَ (Dan sesungguhnya Kami benar-benar kuasa untuk memperlihatkan kepadamu apa yang Kami ancamkan kepada mereka) Yakni Allah mampu untuk memperlihatkan azab mereka kepada Rasul-Nya, namun Allah menangguhkan azab itu sebab Allah mengetahui sebagian orang kafir itu akan beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Sesungguhnya Kami benar-benar kuasa untuk memperlihatkan kepadamu apa yang Kami ancamkan kepada mereka. Maka jangan khawatir atau lelah atas pendustaan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami benar-benar berkuasa untuk memperlihatkan kepadamu apa yang Kami ancamkan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93-95 Setelah Allah menegakkan bukti-bukti kekuasaanNya yanga gung atas kaum pendusta, (tapi) mereka tidak menolehkan pandangan kepadanya, dan tideak tunduk kepadanya, maka menjadi pastilah siksa bagi mereka, lalu mereka diancam dengan turunnya azab, dan Allah memberikan petunjuk kepada RasulNya agar mengatakan, “Ya Rabbku, jika Engkau sungguh-sungguh hendak memperlihatkan kepadaku azab yang diancamkan kepada mereka.” Maksudnya, lindunglah aku, kasihilah aku dari bencana yang Engkau ujikan kepada mereka, berupa dosa-dosa yang akan mendatangkan azab. Peliharalah aku juga dari siksaan yang menghampiri mereka. Sebab hukuman yang menyeluruh, saat turun bisa menimpa orang yang bermaksiat dan lainnya secara umum. Allah berfirman untuk menerangkan dekatnya waktu siksaan mereka, “dan sesungguhnya Kami benar-benar kuasa untuk memperlihatkan kepadamu apa yang kami ancamkan kepada mereka. Akan tetapi, bila kami menundanya, maka penundaan itu atas dasar hikmah. Kalau tidak demikian, maka kekuasaan kami sudah sanggup untuk menjatuhkannya [kepada mereka]."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 95: Allah Subhaanahu wa Ta'aala berfirman menerangkan dekatnya azab yang menimpa mereka. Allah menundanya karena hikmah (kebijaksanaan)-Nya, meskipun Dia mampu menimpakannya segera kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 95",
    "description": "Allah mengajari nabi doa tersebut bukan karena Allah tidak kuasa menjatuhkan siksa saat nabi masih hidup, namun dia hanya menundanya sebagaimana ditegaskan dalam ayat ini. Dan sungguh, kami benar-benar kuasa untuk memperlihatkan kepadamu, wahai nabi Muhammad, apa yang kami ancamkan kepada mereka. Karena itu, janganlah engkau berduka atas pendustaan mereka kepadamu. 96. Allah dalam ayat ini mengajari nabi cara menghadapi pendustaan kaum musyrik. Tolaklah perbuatan buruk mereka dengan cara yang lebih baik, antara lain dengan tetap berbuat baik kepada mereka semampumu, memaafkan kesalahan mereka yang berkaitan dengan hak pribadimu, atau tidak menanggapi ejekan dan cemoohan mereka. Kami lebih mengetahui apa yang mereka sifatkan kepada Allah."
  }
]