[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila musuh-musuhmu berbuat keburukan kepadamu (wahai Rasul) dengan kata-kata maupun tindakan, maka janganlah kamu balas mereka dengan keburukan. Akan tetapi, balaslah sikap buruk mereka dengan tindakan kebaikan darimu kepada mereka. Kami lebih tahu apa yang diungkapkan oleh kaum Musyrikin berupa kesyirikan dan pendustaan, dan Kami akan membalas mereka dengan balasan paling buruk atas perbuatan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Balaslah -wahai Rasul- orang yang berbuat buruk kepadamu dengan cara dan akhlak yang lebih baik, dengan memaafkan dirinya dan bersabar terhadap celaan dan kezalimannya. Kami lebih mengetahui apa yang mereka sifatkan kepada Allah berupa tuduhan kesyirikan dan kedustaan, dan apa yang mereka sifatkan pada dirimu berupa tuduhan yang tidak pantas ada pada dirimu, seperti sihir atau kegilaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Lanjutkanlah dakwahmu, dan hadapilah keburukan orang-orang kafir dengan ampunan dan pemberian maaf; sungguh Kami lebih mengetahui apa yang mereka katakan tentangmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. ادْفَعْ بِالَّتِى هِىَ أَحْسَنُ السَّيِّئَةَ ۚ (Tolaklah perbuatan buruk mereka dengan yang lebih baik) Yakni balaslah dengan perbuatan yang lebih baik dari yang lainnya, yaitu dengan memaafkan dan berpaling dari apa yang dilakukan oleh orang-orang kafir. نَحْنُ أَعْلَمُ بِمَا يَصِفُونَ (Kami lebih mengetahui apa yang mereka sifatkan) Yakni mengetahui sifat yang mereka tuduhkan kepadamu yang tidak sesuai dengan dirimu. Atau mengetahui sifat mereka berupa kesyirikan dan pendustaan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara pelajaran dari ayat ini adalah: berjalanlah di jalan orang-orang mulia, jangan melirik kepada besarnya suatu penghargaan, tolaklah tanpa mengaharapkan ada balasan. Masuk juga di dalam ayat ini ucapkanlah salam kepada siapa yang menyampaikan salam kepadamu. 2 ). Menjadikan ayat ini sebagai contoh akhlak yang baik, bahwa sebaiknya seorang mukmin yang sejati menyerahkan hanya kepada Allah sampai kepada perihal orang-orang yang menentang, karena hanya dengan kekuasaan Allah segala urusan akan teratasi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Tolaklah perbuatan buruk mereka dengan yang lebih baik, yaitu dengan memaafkan kesalahan mereka kepadamu, dan perlawanan mereka kepada agamamu. Kami lebih mengetahui apa yang mereka sifatkan berupa sifat yang palsu, Kami akan membalas perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tolaklah keburukan itu dengan yang lebih baik. Kami lebih mengetahui apa yang mereka sifatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96 Ini termasuk budi pekerti luhur yang mana Allah memerintahkan RasulNya untuk melaksanakannya. Allah berfirman, ”tolaklah perbuatan buruk mereka dengan yang lebih baik.” Maksudnya, jika musuh-musuhmu telah berbuat buruk kepada dirimu dalam bentuk ucapan maupun perbuatan, maka janganlah engkau menyikapi mereka dengan tindakan buruk. Walaupun boleh untuk membalas orang yang telah berbuat buruk dengan tindakan serupa, akan tetapi, tolaklah sikap buruk mereka kepadamu dengan berbuat baik kepada mereka. Itu merupakan bentuk kemurahan hatimu kepada orang yang telah berbuat buruk itu. Diantara manfaatnya, ulah buruknya kepadamu akan berkurang, sekarang dan dimasa datang. Sifat tersebut lebih efektif untuk menarik orang yang telah berbuat buruk tersebut kejalan yang benar, lebih mempercepatnya untuk menyesal, sedih dan kembali dengan taubat dari apa yang pernah dilakukiannya. Orang yang memberi maaf, berarti mempunyai sifat ihsan (kebaikan). Dengan itu, dia mampu mempecundangi setan serta berhak menerima pahala dari Allah. Allah berfirman, “Maka barangsiapa yang memaafkan dan berbuat baik, maka pahalanya atas (tanggungan) Allah.” (Asy syuara:40) Dan firman Allah : “tolaklah (kejahatan itu) dengan cara yang lebih baik, maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia. Sifat-sifat yang baik itu tidak dianugerahkan,” maksudnya, tidaklah diberi taufik untuk bersifat luhur seperti ini, “melainkan (kepada) orang-orang yang sabar, dan tidaklah dianugerahkan melainkan (kepada) orang-orang yang mempunyai keberuntungan yang besar.” (fushilat: 34-35) FirmanNya, “dan kami lebih mengetahui apa yang mereka bisikan,” yaitu ucapan-ucapan yang mereka lontarkan, berupa omongan-omongan yang memuat unsur kekufuran dan pendustaan kepada kebenaran. Sungguh ilmu kami telah meliputinya. Kami telah lunak terhadap mereka, memberikan kesempatan bagi mereka serta menahan diri. Kebenaran milik kami. Pendustaan mereka juga milik kami. Engkau wahai Muhammad, sepatutnya bersabar atas lontaran yang keluar dari mulut mereka dan menyikapi tindakan mereka dengan baik. Inilah tugas seorang hamba dalam menyikapi orang yang telah berbuat tidak baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 96: Syaikh As Sa’diy berkata, “Apabila musuhmu berbuat jahat kepadamu baik dengan perkataan maupun perbuatan, maka janganlah membalas dengan kejahatan, meskipun sesungguhnya boleh membalas kejahatan dengan kejahatan yang serupa, akan tetapi membalas dengan berbuat ihsan adalah sebuah keutamaan darimu kepada orang yang berbuat jahat. Di antara maslahatnya adalah berkurangnya perbuatan jahatnya baik saat itu maupun yang akan datang, dapat membawa orang yang berbuat jahat kepada kebenaran dan lebih mendekatkannya untuk menyesali perbuatannya dan kembali dengan bertobat dari perbuatannya, dan agar orang yang memaafkan dapat memiliki sifat ihsan serta dapat mengalahkan musuhnya, yaitu setan serta dapat menarik pahala dari Allah. Allah Ta’ala berfirman, “Maka barang siapa memaafkan dan berbuat baik, maka pahalanya atas (tanggungan) Allah.”(Terj. Asy Syuuraa: 40)…dst.” Ada yang berpendapat, bahwa perkataan dan perbuatan kaum musyrik yang tidak baik itu hendaklah dihadapi oleh Nabi shallallahu 'alaihi wa sallam dengan perbuatan yang baik, misalnya dengan memaafkannya, yang penting tidak membawa kepada kelemahan dan kemunduran dakwah. Menurut penyusun tafsir Al Jalaalain, hal ini sebelum ada perintah memerangi mereka. Wallahu a’lam. Maksudnya, apa yang mereka ucapkan berupa kata-kata kufur dan penolakan terhadap kebenaran, maka ilmu Kami meliputinya, dan Kami sabar terhadapnya serta menundanya. Oleh karena itu, engkau wahai Muhammad hendaknya bersabar terhadap apa yang mereka katakan dan membalas dengan perbuatan ihsan. Inilah cara seorang hamba dalam membalas keburukan manusia, adapun jika berasal dari setan, maka berbuat ihsan kepada mereka tidaklah bermanfaat karena ia selalu mengajak manusia untuk menjadi penghuni neraka, maka untuk menghadapinya adalah dengan mengikuti petunjuk Allah Subhaanahu wa Ta'aala sebagaimana yang diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 96",
    "description": "Allah dalam ayat ini mengajari nabi cara menghadapi pendustaan kaum musyrik. Tolaklah perbuatan buruk mereka dengan cara yang lebih baik, antara lain dengan tetap berbuat baik kepada mereka semampumu, memaafkan kesalahan mereka yang berkaitan dengan hak pribadimu, atau tidak menanggapi ejekan dan cemoohan mereka. Kami lebih mengetahui apa yang mereka sifatkan kepada Allah. 97-98. Dan katakanlah, wahai nabi Muhammad, 'ya tuhanku, aku berlindung kepada engkau dari bisikan-bisikan setan, dan aku berlindung pula kepada engkau ya tuhanku, agar mereka tidak mendekati aku dalam segala aktivitasku. '."
  }
]