[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "97-98. Dan katakanlah (wahai Nabi), “Wahai Tuhanku, aku memohon perlindungan kepadaMu dari ajakan penyimpangan setan dan bisikan-bisikannya yang membujuk kepada kebatilan, kerusakan dan menghambat manusia dari jalan kebenaran. Dan aku memohon perlindungan kepadaMu, wahai TUhanku, dari kedatangan mereka pada hal apa pun dari urusan-urusanku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Dan katakanlah, \"Wahai Tuhanku! Aku berlindung kepada-Mu dari bisikan dan godaan setan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97-98. katakanlah: “Ya Tuhanku, aku berlindung dengan kekuatan-Mu dari was-was dan godaan setan, dan aku berlindung kepada-Mu agar mereka tidak menyertaiku dalam setiap amalan yang aku lakukan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزٰتِ الشَّيٰطِينِ (Dan katakanlah: “Ya Tuhanku aku berlindung kepada Engkau dari bisikan-bisikan syaitan) Yakni godaan dan was-was setan. Dalam hadits disebutkan “was-was setan adalah kegilaan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Katakanlah wahai Nabi ketika waktu sulit: \"Ya Tuhanku aku berlindung kepada Engkau dari ganguan dan gelapnya bisikan-bisikan syaitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Ya Tuhanku, aku berlindung kepadaMu dari bisikan-bisikan} gangguan dan bisikan-bisikan {setan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97-98 Adapun bila pihak yang berbuat jahat berasal dari kalangan setan, sikap baik tidak berguna baginya. Tidaklah setan menyeru kelompoknya melainkan agar mereka menjadi penghuni Neraka Sai’r. Strategi saat menghadapinya adalah, memohon petunjuk dengan metode yang Allah ajarkan kepada RasulNya. Allah berfirman, “Dan katakanlah, ’Ya Rabbku, aku berlindung kepadaMu’.” [Maksudnya aku memohon perlindungan dengan daya dan kekuatanMu, dengan berlepas diri dari daya dan kekuatanKu]. “dari bisikan-bisikan setan dan aku berlindung kepadaMu ya Rabbku dari kedatangan mereka kepadaku,” maksudnya, aku memohon perlindungan dari kejelekan yang menimpaku lantaran interaksi, bisikan dan pengaruh mereka, dan dari kejelekan yang muncul dari wujud dan tiupan was-was mereka. Ini merupakan permohonan perlindungan dari materi yang buruk secara keseluruhan dan sumbernya. Termasuk juga memohon perlindungan dari bermacam godaan setan, yang berbentuk pengaruh dan tiupan was-wasnya. Bila Allah telah menjaga seorang hamba dari kejelekan ini dan menyambut doanya, maka dia selamat dari setiap kejelekan, dan memperoleh taufik untuk menjalankan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 97: Masudnya, berpegang kepada kekuatan-Mu sambil berlepas diri dari kekuatan-Ku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 97",
    "description": "97-98. Dan katakanlah, wahai nabi Muhammad, 'ya tuhanku, aku berlindung kepada engkau dari bisikan-bisikan setan, dan aku berlindung pula kepada engkau ya tuhanku, agar mereka tidak mendekati aku dalam segala aktivitasku. '97-98"
  }
]