[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "97-98. Dan katakanlah (wahai Nabi), “Wahai Tuhanku, aku memohon perlindungan kepadaMu dari ajakan penyimpangan setan dan bisikan-bisikannya yang membujuk kepada kebatilan, kerusakan dan menghambat manusia dari jalan kebenaran. Dan aku memohon perlindungan kepadaMu, wahai TUhanku, dari kedatangan mereka pada hal apa pun dari urusan-urusanku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Dan aku berlindung pula kepada-Mu wahai Tuhanku agar mereka tidak mendekatiku dalam segala urusanku.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ (Dan aku berlindung (pula) kepada Engkau ya Tuhanku, dari kedatangan mereka kepadaku”) Yakni jika setan-setan itu mendatangi manusia maka mereka tidak memiliki pekerjaan kecuali menggoda dan membujuk manusia untuk melakukan kejahatan dan menjauhkan mereka dari kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Aku juga berlindung kepada Engkau ya Tuhanku, dari keikutsertaan mereka dalam urusanku, karena tidak lain mereka hanya ikut campur untuk membuat tipu daya dan bisikan kepada keburukan, dan menjauhkan dari kebaikan\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan aku berlindung kepadaMu, ya Tuhanku, dari kedatangan mereka kepadaku\"} Kehadiran para setan dalam hal yang berasal dari perintahku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97-98 Adapun bila pihak yang berbuat jahat berasal dari kalangan setan, sikap baik tidak berguna baginya. Tidaklah setan menyeru kelompoknya melainkan agar mereka menjadi penghuni Neraka Sai’r. Strategi saat menghadapinya adalah, memohon petunjuk dengan metode yang Allah ajarkan kepada RasulNya. Allah berfirman, “Dan katakanlah, ’Ya Rabbku, aku berlindung kepadaMu’.” [Maksudnya aku memohon perlindungan dengan daya dan kekuatanMu, dengan berlepas diri dari daya dan kekuatanKu]. “dari bisikan-bisikan setan dan aku berlindung kepadaMu ya Rabbku dari kedatangan mereka kepadaku,” maksudnya, aku memohon perlindungan dari kejelekan yang menimpaku lantaran interaksi, bisikan dan pengaruh mereka, dan dari kejelekan yang muncul dari wujud dan tiupan was-was mereka. Ini merupakan permohonan perlindungan dari materi yang buruk secara keseluruhan dan sumbernya. Termasuk juga memohon perlindungan dari bermacam godaan setan, yang berbentuk pengaruh dan tiupan was-wasnya. Bila Allah telah menjaga seorang hamba dari kejelekan ini dan menyambut doanya, maka dia selamat dari setiap kejelekan, dan memperoleh taufik untuk menjalankan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 98: Kalimat ini merupakan perlindungan dari asal keburukan dan dari semua keburukan. Jika seseorang sudah dilindungi daripadanya, maka ia akan selamat dari keburukan dan akan diberi taufik kepada kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 98",
    "description": "97-98. Dan katakanlah, wahai nabi Muhammad, 'ya tuhanku, aku berlindung kepada engkau dari bisikan-bisikan setan, dan aku berlindung pula kepada engkau ya tuhanku, agar mereka tidak mendekati aku dalam segala aktivitasku. '99-100. Orang-orang kafir itu akan terus membangkang, hingga apabila datang kematian kepada seseorang dari mereka untuk mengakhiri kehi-dupannya di dunia dan menghentikan kenikmatan yang dirasakannya, hingga pada akhirnya ia melihat siksa yang akan diterimanya, dia berkata, 'ya tuhanku, kembalikanlah aku ke dunia agar aku dapat berbuat kebajikan yang telah aku tinggalkan. ' sekali-kali tidak! Allah tidak akan memenuhi permohonan mereka karena Allah tahu bahwa mereka tidak akan menepati janji. Sesungguhnya itu adalah dalih yang diucapkannya saja. Dan di hadapan serta di belakang mereka ada barzakh, yaitu dinding pemisah antara kehidupan dunia dan akhirat, yang menghalangi mereka kembali ke dunia sampai pada hari mereka dibangkitkan."
  }
]