[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengabarkan tentang keadaan orang yang sakaratul maut, baik dari orang-orang kafir atau orang-orang yang melalaikan perintah Allah, hingga apabila dia mendekati kematiannya, dan menyaksikan siksaan yang diancamkan kepadanya, dia berkata, “Wahai Tuhanku, kembalikanlah aku ke dunia,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Sehingga apabila kematian itu mendatangi salah seorang musyrik itu, dan ia menyaksikan apa yang akan menimpanya, maka ia berkata sebagai ungkapan penyesalan atas keterlambatannya dalam beramal dan kelalaiannya dari taat kepada Allah, \"Wahai Tuhanku! Kembalikan aku ke kehidupan dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99-101. Orang-orang musyrik akan tetap dalam kekafiran mereka. Hingga ketika salah satu dari mereka telah melihat tanda kematian, mereka akan menyesal dan meminta kepada Allah agar Dia mengembalikannya ke kehidupan dunia, sehingga dia dapat mengerjakan amal shalih. Maka mereka akan dijawab: “Itu tidak akan terjadi.” Penyesalan yang terlambat itu tidak lagi bermanfaat, dan terdapat penghalang yang menghalangi mereka untuk kebali ke dunia, dan mereka akan tetap di alam kubur hingga hari kebangkitan dan perhitungan. Ketika malaikat yang ditugaskan untuk meniup sangkakala telah meniupnya tiupan kedua sehingga terjadi kiamat, maka tidak berguna lagi hubungan kekerabatan, mereka tidak akan saling bertanya satu sama lain karena telah sibuk dengan urusan dirinya masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. حَتَّىٰٓ إِذَا جَآءَ أَحَدَهُمُ الْمَوْتُ قَالَ رَبِّ ارْجِعُونِ (hingga apabila datang kematian kepada seseorang dari mereka, dia berkata: “Ya Tuhanku kembalikanlah aku) Yakni ia akan berkata: “kembalikanlah aku! kembalikanlah aku! kembalikanlah aku!”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "99-100 1 ). Adakah kamu merasakan nikmatnya ramadhan? Cukup mengingat kata yang akan diucapkan oleh orang-orang yang membangkan kepada Allah: { رَبِّ ٱرْجِعُونِ , لَعَلِّىٓ أَعْمَلُ صَٰلِحًا فِيمَا تَرَكْتُ } \"Ya Tuhanku kembalikanlah aku (ke dunia) , Agar aku berbuat amal yang saleh terhadap yang telah aku tinggalkan\" dan ingat teriakan penghuni neraka: { رَبَّنَآ أَخْرِجْنَا نَعْمَلْ صَٰلِحًا } \"Ya Tuhan kami, keluarkanlah kami niscaya kami akan mengerjakan amal yang saleh\" [Fathir: 37] .. wahai kalian berita gembira bagimu yang mendapati musim-musim kebaikan itu, dan mengerjakan amalan shalih di dalamnya. 2 ). { لَعَلِّىٓ أَعْمَلُ صَٰلِحًا فِيمَا تَرَكْتُ } Mereka meminta untuk dikembalikan demi berbuat shalih, bukan untuk mengumpulkan kekayaan dunia, dan memuaskan syahwat. Maka beruntunglah seseorang yang dikaruniai oleh Allah kesempatan untuk mengerjakan hal-hal yang didambakan oleh orang-orang kafir pada hari kiamat tatkala mereka melihat azab dihadapan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Sehingga apabila kematian menghampiri seseorang dari mereka, dia berkata: \"Ya Tuhanku kembalikanlah aku ke dunia, dimana dia tidak pernah melihat ketakutan sekarat dalam kematian. Irjiuniy dijamakkan, bukan irji’niy: sebagai isyarat pengulangan kalimat tentang dahsyatnya peringatan ini, atau untuk mengagungkan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sehingga apabila datang kematian kepada salah seseorang dari mereka, dia berkata,“Ya Tuhanku, kembalikanlah aku} kembalikanlah aku ke dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99-100 Allah memberitahukan tentang kondisi orang-orang yang kedatangan ajalnya, dari kalangan orang-orang yang melalaikan kewajiban-kewajibannya (didunia ini) lagi berbuat aniaya, bahwa dia merasa menyesal, saat menyaksikan tempat kesudahannya, melihat keburukan amalan-amalannya, hingga dia pun meminta untuk balik kembali ke dunia. Tujuannya bukan untuk menikmati kenikmatannya dan memenuhi nafsu-nafsu keinginannya, akan tetapi, dia mengatakan, “Ya Rabbku kembalikanlah aku (kedunia), agar aku berbuat amal yang shalih terhadap yang telah aku tinggalkan,” yaitu amalan-amalan shalih yang kusepelekan di sisi Allah. “sekali-kali tidak,” tidak ada kesempatan untuk balik kembali dan tiada penundaan waktu (lagi). Allah sudah memutuskan bahwa mereka tidak akan kembali lagi kedunia. “sesungguhnya itu,” maksudnya ucapan yang berisi harapannya untuk kembali ke alam dunia “adalah perkataan yang diucapkan saja,” hanya sekedar lontaran dengan mulut saja, tidak memberikan manfaat bagi pengucapannya kecuali kesedihan dan penyeselan. Begitu pula, dia sendiri sebenarnya tidak percaya pada pernyataannya. Sungguh, bila dia dikembalikan lagi ke kehidupan duniawi, niscaya dia pun kembali melanggar laranganNya. “Dan dihadapan mereka ada dinding sampai hari mereka dibangkitkan.” Maksudnya, di depan dan di hadapan mereka terdapat barzakh yaitu dinding penghalang untuk dua kehidupan; kehidupan dunia dan akhirat. Di barzakh ini (alam kubur), orang-orang yang taat (kepada Allah) akan menikmati keadaan yang nikmat. Sedangkan orang-orang yang bermaksiat akan didera siksa sejak kematian mereka sampai hari mereka dibangkitkan. Maksudnya, hendaklah mereka mempersiapkan bekal dan mencari persiapan untuknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mu’minun ayat 99: Syaikh As Sa’diy berkata, “Allah Subhaanahu wa Ta'aala memberitakan tentang keadaan orang yang didatangi maut di antara mereka yang meremehkan lagi zalim, bahwa ia akan menyesal saat itu, yaitu apabila dia melihat tempat kembalinya dan menyaksikan keburukan amalnya, ia pun meminta kembali ke dunia, bukan untuk bersenang-senang dengan kelezatannya dan menikmati syahwatnya, tetapi untuk hal yang dia ucapkan, “Agar aku dapat berbuat amal saleh yang telah aku tinggalkan.” Dan dia melihat tempatnya di neraka, atau di surga jika dia beriman. Maksudnya, bahwa orang-orang kafir saat menghadapi sakaratul maut, meminta agar umur mereka diperpanjang, supaya mereka dapat beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mu’minun Ayat 99",
    "description": "99-100. Orang-orang kafir itu akan terus membangkang, hingga apabila datang kematian kepada seseorang dari mereka untuk mengakhiri kehi-dupannya di dunia dan menghentikan kenikmatan yang dirasakannya, hingga pada akhirnya ia melihat siksa yang akan diterimanya, dia berkata, 'ya tuhanku, kembalikanlah aku ke dunia agar aku dapat berbuat kebajikan yang telah aku tinggalkan. ' sekali-kali tidak! Allah tidak akan memenuhi permohonan mereka karena Allah tahu bahwa mereka tidak akan menepati janji. Sesungguhnya itu adalah dalih yang diucapkannya saja. Dan di hadapan serta di belakang mereka ada barzakh, yaitu dinding pemisah antara kehidupan dunia dan akhirat, yang menghalangi mereka kembali ke dunia sampai pada hari mereka dibangkitkan"
  }
]