[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami menjadikan malam sebagai pakaian bagi kalian dengan kegelapannya,ia menutupi kalian sebagaimana pakaian menutupi pemakainya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan Kami jadikan malam hari sebagai penutup bagi kalian dengan kegelapannya seperti pakaian yang kalian gunakan menutupi aurat kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَجَعَلْنَا الَّيْلَ لِبَاسًا (dan Kami jadikan malam sebagai pakaian) Yakni Kami menutup kalian dengan kegelapannya sebagaimana pakaian yang menutupi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kami juga menjadikan malam layaknya penutup yang menutupi dan menyelubungi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menjadikan malam sebagai pakaian} penutup bagi kalian dengan kegelapannya layaknya pakaian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-16 Maksudnya, bukankah kami telah memberikan kalian berbagai nikmat agung, kami menjadikan untuk kalian, “bumi itu sebagai hamparan,” yaitu dihamparkan dan ditundukkan bagi kalian dan untuk kepentingan kepentingan berupa tanah garapan, tempat tinggal dan jalan. “Dan gunung gunung sebagi pasak,” mengokohkan bumi agar tidak berguncang bersama kalian. “Dan kami jadikan kamu berpasang pasangan,” yakni lelaki dan perempuan dari jenis yang sama agar masing masing dari keduanya merasa tentang pada yang lain dan membentuk rasa cinta dan kasih serta membuahkan keturunan dari keduanya. Dan termasuk dalam karunia ini adalah nikmatnya wanita yang dinikahi. “Dan kami jadikan tidurmu untuk istirahat,“ yakni sebagai istirahat bagi kalian dan sebagai pemutus pekerjaan yang jika terus dilakukan akan membahayakan badan. Allah menjadikan malam dan tidur sebagai penutup agar gerakan gerakan mereka yang membahayakan menjadi tenang dan mereka mendapatkan kenyamanan yang bermanfaat. “Dan kami bangun di atas kamu tujuh lapis (langit) yang kokoh,” yakni tujuh langit yang amat kuat dan kokoh. Allah menahannya dengan kusasanya dan menjadikannya sebagai atap bagi bumi. Padanya terdapat berbagai manfaat bagi manusia. Karena itulah Allah menyebutkan di antara manfaat matahari seraya berfirman, “Dan kami jadikan pelita yang amat terang (matahari).” Allah mengingatkan manusia pada matahari berupa nikmat cahayanya yang menjadi kebutuhan vital bagi mereka dan pada panasnya, karena padanya terdapat berbagai manfaat, seperti untuk mematangkan (buah-buahan). “Dan kami turunkan dari awan air yang banyak tercurah,“ yakni sangat deras, “supaya kami tumbuhkan dengan air itu biji bijian,” seperti gandum, jagung, beras dan lainnya yang menjadi makanan manusia, “dan tumbuh tumbuhan,” mencakup seluruh tumbuh tumbuhan yang dijadikan Allah sebagai makanan untuk binatang ternak mereka, “dan kebun kebun yang lebat,” yaitu kebun kebun yang lebat, yang di dalamnya terdapat berbagai macam buah buahan yang lezat. Untuk itu, Dzat yang memberi kalian berbagai nikmat agung yang tidak terkira dan terhitung jumlahnya ini, bagaimana bisa kalian kufuri dan kalian dustakan berita yang dikabarkan pada kalian tentang hari kebangkitan dan pengumpulan nanti? Atau mengapa kalian menggunakan nikmat-nikmat Allah untuk bermaksiat dan untuk menentangnya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "( لِباساً ) Sebagai pakaian yang menutupi dengan kegelapannya, ia menutupi kalian sebagaimana pakaian yang kalian pakai menutupi tubuh kalian, oleh karena itu jika malam telah tiba, kemudian dengan gelapnya menutupi alam semesta, kalian tidak bisa melihat apapun, sehingga kalian akan merasakan ketenangan dan ketentraman dalam istirahat kalian, sungguh kegelapan malam adalah sebuah nikmat dari Allah untuk umat manusia dan juga untuk hewan serta tumbuh-tumbuhan, adalah merupakan nikmat Allah untuk segenap alam semesta. Ayat ini merupakan dalil dan bukti bahwa Allah mampu menjadikan malam sebagai pakaian, lalu tidakkah dia kuasa akan kebangkitan setelah kematian ?!"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَجَعَلْنَا اللَّيْلَ لِبَاسًا “dan Kami jadikan malam sebagai pakaian ” Maknanya: Allah menjadikan malam di bumi seperti layaknya pakaian yang anda pakai dan sebagai penutup bumi. Ini tidak dapat diketahui secara sempurna kecuali oleh orang yang terbang ke atas bayangan bumi, dan kami sudah melihatnya di antara tanda-tanda kuasa Allah yang menakjubkan itu. Saat anda naik pesawat dan terbang, ketika matahari telah terbenam ke sisi bumi, kemudian matahari itu muncul jelas setelah pesawat itu naik anda akan mendapati bumi seolah-olah dibungkus dengan pakaian berwarna hitam, anda tidak dapat melihat sedikit pun yang ada di bumi, semuanya hitam di bawahmu. Dengan pemaparan ini maka tafsir ayat ini jelas: وَجَعَلْنَا اللَّيْلَ لِبَاسًا “dan Kami jadikan malam sebagai pakaian”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 10: 6-16. Allah menyebutkan Sembilan dalil yang menunjukkan atas ke Maha Mampuan-Nya atas membangkitkan dari yang mati dan menghidupkannya kembali. Allah berkata : Bukankah Kami yang menciptakan bumi dan menjadikannya terhampar bagi kalian ? dan kalian dapat bergerak sebagaimana yang kalian inginkan ? Dan bukankah kami ciptakan pada bumi itu gunung dan kami jadikan kokoh tertancap hingga kalian tidak terpental dan juga terguncang ? Dan bukankah kami jadikan segolongan laki-laki dan juga perempuan bagi kalian agar supaya berkembang biak dan memperbanyak keturunan ? Dan bukankah kami jadikan tidur bagi kalian sebagai pemutus aktivitas kalian dan sebagai waktu istirahat bagi tubuh-tubuh kalian ? Dan bukankah kami jadikan malam dengan kegelapannya agar supaya kalian menetap di tempat-tempat tinggal kalian dan beristirahat dari segala sesuatunya agar kembali dapat menyonsong kehidupan di siang harinya ? Dan bukankah malam adalah waktu bagi manusia untuk kembali (mencari tempat tinggal) bagi raga, karena kegelapannya yang senantiasa pekat menutupi, sebagaimana pakaian yang menutupi tubuh ? Dan bukankah kami jadikan siang dengan cahayanya agar manusia senantiasa beraktivitas menyongsong kehidupannya ? Dan bukankah kami ciptakan tujuh langit di atas kalian yang nyata tegaknya serta kokoh dan padat, tidaklah padanya terdapat keretakan (celah) dan tidak juga keretakan ? Dan bukankah kami jadikan matahari yang terkumpul padanya diantara cahaya dan panas ? Maka cahaya tersebut menjadikan makhluk dapat melihat dan panas menjadikan tumbuhan dapat ber foto sintesis dan manusia dapat memanfaatkannya. Dan bukankah kami turunkan air yang sangat banyak dari langit yang terkumpul ?; Agar supaya menumbuhkan biji-bijian dan tumbuhan, begitu juga kebun-kebun, taman-taman terkumpul di dalamnya pepohonan dan cabang-cabang dari rantingnya. Kesimpulannya dari dalil-dalil yang telah disebutkan adalah, barangsiapa yang mampu menciptakan atas segala sesuatu yang telah disebutkan tadi maka mampu pula untuk menghidupkan manusia setelah matinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Malam itu disebut sebagai pakaian karena kegelapannya menutupi jagat sebagaimana pakaian menutupi tubuh manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 10",
    "description": "Dan bukankah kami telah menjadikan malam yang gelap gulita menutupi suatu wilayah di bumi sebagai-mana pakaian menutupi jasad manusia' 11. Dan bukankah kami juga telah menjadikan siang yang terang benderang sebagai waktu bagi kamu untuk mencari penghidupan' siang yang terang memudahkan kamu untuk bekerja, baik di daratan maupun di lautan."
  }
]