[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami menjadikan siang sebagai waktu mencari penghidupan,dimana padanya kalian menyebar dan beraktivitas demi kemaslahatan hidup kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan Kami jadikan siang hari sebagai lahan untuk bekerja dan mencari rezeki?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَجَعَلْنَا النَّهَارَ مَعَاشًا (dan Kami jadikan siang untuk mencari penghidupan) Yakni Kami jadikan siang terang benderang agar kalian dapat mencari penghidupan dan rezeki yang telah Allah bagikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dan Kami menjadikan siang sebagai waktu untuk mencari penghidupa, dan waktu untuk bekerja dan mencari kebutuhan hidup."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menjadikan siang untuk mencari penghidupan} waktu untuk mencari penghidupan dan melakukan perbuatan baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-16 Maksudnya, bukankah kami telah memberikan kalian berbagai nikmat agung, kami menjadikan untuk kalian, “bumi itu sebagai hamparan,” yaitu dihamparkan dan ditundukkan bagi kalian dan untuk kepentingan kepentingan berupa tanah garapan, tempat tinggal dan jalan. “Dan gunung gunung sebagi pasak,” mengokohkan bumi agar tidak berguncang bersama kalian. “Dan kami jadikan kamu berpasang pasangan,” yakni lelaki dan perempuan dari jenis yang sama agar masing masing dari keduanya merasa tentang pada yang lain dan membentuk rasa cinta dan kasih serta membuahkan keturunan dari keduanya. Dan termasuk dalam karunia ini adalah nikmatnya wanita yang dinikahi. “Dan kami jadikan tidurmu untuk istirahat,“ yakni sebagai istirahat bagi kalian dan sebagai pemutus pekerjaan yang jika terus dilakukan akan membahayakan badan. Allah menjadikan malam dan tidur sebagai penutup agar gerakan gerakan mereka yang membahayakan menjadi tenang dan mereka mendapatkan kenyamanan yang bermanfaat. “Dan kami bangun di atas kamu tujuh lapis (langit) yang kokoh,” yakni tujuh langit yang amat kuat dan kokoh. Allah menahannya dengan kusasanya dan menjadikannya sebagai atap bagi bumi. Padanya terdapat berbagai manfaat bagi manusia. Karena itulah Allah menyebutkan di antara manfaat matahari seraya berfirman, “Dan kami jadikan pelita yang amat terang (matahari).” Allah mengingatkan manusia pada matahari berupa nikmat cahayanya yang menjadi kebutuhan vital bagi mereka dan pada panasnya, karena padanya terdapat berbagai manfaat, seperti untuk mematangkan (buah-buahan). “Dan kami turunkan dari awan air yang banyak tercurah,“ yakni sangat deras, “supaya kami tumbuhkan dengan air itu biji bijian,” seperti gandum, jagung, beras dan lainnya yang menjadi makanan manusia, “dan tumbuh tumbuhan,” mencakup seluruh tumbuh tumbuhan yang dijadikan Allah sebagai makanan untuk binatang ternak mereka, “dan kebun kebun yang lebat,” yaitu kebun kebun yang lebat, yang di dalamnya terdapat berbagai macam buah buahan yang lezat. Untuk itu, Dzat yang memberi kalian berbagai nikmat agung yang tidak terkira dan terhitung jumlahnya ini, bagaimana bisa kalian kufuri dan kalian dustakan berita yang dikabarkan pada kalian tentang hari kebangkitan dan pengumpulan nanti? Atau mengapa kalian menggunakan nikmat-nikmat Allah untuk bermaksiat dan untuk menentangnya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan pada siang hari kalian bertebaran dimuka bumi untuk mencari rezeki, untuk mencari penghidupan, dan kemaslahatan bagi diri kalian, Allah tidak menjadikan malam itu terus berkepanjangan menggelapi alam semesta, sehingga kalian terhalangi untuk melakukan aktifitas, dan tidak pula menjadikan siang itu terus terik tak henti, sehingga kalian tidak berkesempatan untuk beristirahat, akan tetapi Allah menjadikan kedua waktu itu terus berputar bergantian demi kemaslahatan kalian, Allah ta'ala berfirman dalam surat Al-Qhasas : 71-72 ( قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِضِيَاءٍ ۖ أَفَلَا تَسْمَعُونَ 71 ) , (قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ ) , (Katakanlah: “Terangkanlah kepadaku, jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar?” ) , (Katakanlah: “Terangkanlah kepadaku, jika Allah menjadikan untukmu siang itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan?”) . Perhatikanlah bagaimana Allah menjadikan pada malam hari kalian dapat mendengarkan suara dengan lebih jelas, dan pada siang hari kalian dapat melihat sekitar dengan terang, maka seharusnya setiap insan mengintropeksi diri akan hal ini, Dialah Allah yang mampu nengatur semua kejadian, lalu apakah Dia tidak mampu membangkitkan kembali orang yang telah mati ?!"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَجَعَلْنَا النَّهَارَ مَعَاشًا “dan Kami jadikan siang untuk mencari penghidupan,” Maknanya: Penghidupan manusia, waktu siang dalam mengais rejeki sesuai dengan kedudukan-kedudukan dan kondisi-kondisi mereka. Ini adalah di antara nikmat dari Allah Subhaanahu Wa Ta’ala kepada hamba-hamba-Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 11: 6-16. Allah menyebutkan Sembilan dalil yang menunjukkan atas ke Maha Mampuan-Nya atas membangkitkan dari yang mati dan menghidupkannya kembali. Allah berkata : Bukankah Kami yang menciptakan bumi dan menjadikannya terhampar bagi kalian ? dan kalian dapat bergerak sebagaimana yang kalian inginkan ? Dan bukankah kami ciptakan pada bumi itu gunung dan kami jadikan kokoh tertancap hingga kalian tidak terpental dan juga terguncang ? Dan bukankah kami jadikan segolongan laki-laki dan juga perempuan bagi kalian agar supaya berkembang biak dan memperbanyak keturunan ? Dan bukankah kami jadikan tidur bagi kalian sebagai pemutus aktivitas kalian dan sebagai waktu istirahat bagi tubuh-tubuh kalian ? Dan bukankah kami jadikan malam dengan kegelapannya agar supaya kalian menetap di tempat-tempat tinggal kalian dan beristirahat dari segala sesuatunya agar kembali dapat menyonsong kehidupan di siang harinya ? Dan bukankah malam adalah waktu bagi manusia untuk kembali (mencari tempat tinggal) bagi raga, karena kegelapannya yang senantiasa pekat menutupi, sebagaimana pakaian yang menutupi tubuh ? Dan bukankah kami jadikan siang dengan cahayanya agar manusia senantiasa beraktivitas menyongsong kehidupannya ? Dan bukankah kami ciptakan tujuh langit di atas kalian yang nyata tegaknya serta kokoh dan padat, tidaklah padanya terdapat keretakan (celah) dan tidak juga keretakan ? Dan bukankah kami jadikan matahari yang terkumpul padanya diantara cahaya dan panas ? Maka cahaya tersebut menjadikan makhluk dapat melihat dan panas menjadikan tumbuhan dapat ber foto sintesis dan manusia dapat memanfaatkannya. Dan bukankah kami turunkan air yang sangat banyak dari langit yang terkumpul ?; Agar supaya menumbuhkan biji-bijian dan tumbuhan, begitu juga kebun-kebun, taman-taman terkumpul di dalamnya pepohonan dan cabang-cabang dari rantingnya. Kesimpulannya dari dalil-dalil yang telah disebutkan adalah, barangsiapa yang mampu menciptakan atas segala sesuatu yang telah disebutkan tadi maka mampu pula untuk menghidupkan manusia setelah matinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 11",
    "description": "Dan bukankah kami juga telah menjadikan siang yang terang benderang sebagai waktu bagi kamu untuk mencari penghidupan' siang yang terang memudahkan kamu untuk bekerja, baik di daratan maupun di lautan. 12. Dan bukankah kami telah pula membangun di atas kamu tujuh langit yang kukuh, padahal tidak kau jumpai tiang-tiang yang menyangganya' tidak kamu dapati keretakan di langit itu agar dapat menjadi atap kuat yang menanungi penghuni bumi."
  }
]