[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami menjadikan matahari bersinar terang?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan Kami jadikan matahari sebagai pelita yang menyinari dengan kuat dan terang?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَجَعَلْنَا سِرَاجًا وَهَّاجًا (dan Kami jadikan pelita yang amat terang (matahari)) Yang dimaksud adalah matahari. Dan makna (الوهج) yakni benda yang memiliki cahaya dan panas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12–13. Kami telah menciptakan 7 langit yang kokoh dan saling terpisah. Kami menjadikan matahari sebagai penerang/lampu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menjadikan pelita yang terang-benderang} matahari dan lentera yang bersinar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-16 Maksudnya, bukankah kami telah memberikan kalian berbagai nikmat agung, kami menjadikan untuk kalian, “bumi itu sebagai hamparan,” yaitu dihamparkan dan ditundukkan bagi kalian dan untuk kepentingan kepentingan berupa tanah garapan, tempat tinggal dan jalan. “Dan gunung gunung sebagi pasak,” mengokohkan bumi agar tidak berguncang bersama kalian. “Dan kami jadikan kamu berpasang pasangan,” yakni lelaki dan perempuan dari jenis yang sama agar masing masing dari keduanya merasa tentang pada yang lain dan membentuk rasa cinta dan kasih serta membuahkan keturunan dari keduanya. Dan termasuk dalam karunia ini adalah nikmatnya wanita yang dinikahi. “Dan kami jadikan tidurmu untuk istirahat,“ yakni sebagai istirahat bagi kalian dan sebagai pemutus pekerjaan yang jika terus dilakukan akan membahayakan badan. Allah menjadikan malam dan tidur sebagai penutup agar gerakan gerakan mereka yang membahayakan menjadi tenang dan mereka mendapatkan kenyamanan yang bermanfaat. “Dan kami bangun di atas kamu tujuh lapis (langit) yang kokoh,” yakni tujuh langit yang amat kuat dan kokoh. Allah menahannya dengan kusasanya dan menjadikannya sebagai atap bagi bumi. Padanya terdapat berbagai manfaat bagi manusia. Karena itulah Allah menyebutkan di antara manfaat matahari seraya berfirman, “Dan kami jadikan pelita yang amat terang (matahari).” Allah mengingatkan manusia pada matahari berupa nikmat cahayanya yang menjadi kebutuhan vital bagi mereka dan pada panasnya, karena padanya terdapat berbagai manfaat, seperti untuk mematangkan (buah-buahan). “Dan kami turunkan dari awan air yang banyak tercurah,“ yakni sangat deras, “supaya kami tumbuhkan dengan air itu biji bijian,” seperti gandum, jagung, beras dan lainnya yang menjadi makanan manusia, “dan tumbuh tumbuhan,” mencakup seluruh tumbuh tumbuhan yang dijadikan Allah sebagai makanan untuk binatang ternak mereka, “dan kebun kebun yang lebat,” yaitu kebun kebun yang lebat, yang di dalamnya terdapat berbagai macam buah buahan yang lezat. Untuk itu, Dzat yang memberi kalian berbagai nikmat agung yang tidak terkira dan terhitung jumlahnya ini, bagaimana bisa kalian kufuri dan kalian dustakan berita yang dikabarkan pada kalian tentang hari kebangkitan dan pengumpulan nanti? Atau mengapa kalian menggunakan nikmat-nikmat Allah untuk bermaksiat dan untuk menentangnya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "( السِرَاج ) yakni matahari. Siapakah yang menyinari luasnya alam semesta ini, yang sinarnya menembus lubang-lubang sempit dan gua-gua yang dengannya menjadi terang benderang ? itulah matahari ! lalu siapakah yang menciptakan matahari dan menundukkannya, dan menjadikan padanya pencahayaan yang terus menerus berkelanjutan ? Dialah Allah yang menciptakan benda ini, lalu apakah Allah tidak mampu mengulangi penciptaan manusia setelah kematiannya ? ( سِرَاجًا وَهَّاجًا ) dalam ayat ini Allah menyebutkan dua faidah : Faidah yang pertama : bahwasanya matahari sebagai pelita yang menerangi alam semesta, dan jikalau matahari tidak ada maka alam semesta akan menjadi gelap, maka mataharilah yang menerangi seluruh alam. Faidah yang kedua : bahwasanya sifat dari matahari adalah panas, Allah menciptakannya demikian demi kemaslahatan ummat manusia, dari panasnya kita bisa mengambil keuntungan, dan jikalau sekiranya matahari itu dingin maka tidaklah manusia mengambil faidah darinya, panas matahari sangatlah bermanfaat bagi alam semesta, bermanfaat bagi tumbuh-tumbuhan dan juga manusia, dan berbagai faidah lainnya yang tidak diketahui melainkan hanya Allah yang tahu. Dialah Allah yang mampu menciptakan matahari yang agung ini, Dia menjadikannya tunduk untuk alam semesta, Dia menjadikan padanya cahaya dan energi, bukankah Dia Allah mampu menciptakan manusia dan mengulangi kembali penciptaannya itu ?! Dan bagaimana mungkin kamu takjub akan adanya kebangkitan setelah kematian yang pada saat itu manusia akan menghadap kepada Allah tuhannya ?!"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَجَعَلْنَا سِرَاجًا وَهَّاجًا “dan Kami jadikan pelita yang amat terang” Maksudnya adalah matahari, karena ia adalah pelita yang menerangkan, di juga mempunyai panas yang amat tinggi, وَهَّاجًا Artinya adalah sangat terang, derajat panasnya saat musim panas sangatlah tinggi walau pun jaraknya amat jauh dari bumi, bagaimana dengan yang dekat dengannya?! Panas matahari saat sedang terik pun adalah uap neraka Jahannam, sebagaiman Nabi shallallaahu ‘alaihi wa sallam bersabda: إِذَا اشْتَدَّ الْحَرِّ فَأَبْرِدُوْا بِالصَّلَاةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ “Apabila panas (matahari) sedang memuncak maka tunggulah hingga reda, maka sungguh panasnya terik (matahari) berasal dari uap neraka jahannam” (1) Nabi ‘alaihi ssholaatu wassalaam juga bersabda: اِشْتَكَتِ النَّارُ إِلَى اللهِ فَقَالَتْ: يَا رَبِّ، أَكَلَ بَعْضِيْ بَعْضاً، فَأَذِنَ لَهَا بِنَفَسَيْنِ: نَفَسٍ فِي الشِّتَاءِ، ونَفَسٍ فِي الصَّيْفِ، فَأَشَدُّ مَا نَجِدُونَ مِنَ الْبَرْدِ مِنْ زَمْهَرِيرِ جَهَنَّمَ، وَ أَشَدُّ مَا يَكُونُ مِنَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ “ Neraka mengeluh kepada Allah ia berkata: Ya Rabb, sebagianku memakan sebagian lainnya. Maka Allah mengizinkan dia untuk bernafas dengan dua nafas, bernafas di musim semi dan bernafas di musim panas. Karenanya, jika kalian mendapati cuaca yang amat dingin maka itu berasal dari suhu amat dingin neraka jahannam, dan suhu panas yang amat tinggi berasal dari uap neraka jahannam ”(2) Meski demikian, matahari mempunyai manfaat yang sangat besar bagi kehidupan, ia dapat mengganti harta yang banyak bagi manusia sehingga mereka tidak perlu lagi menyalakan cahaya lampu, juga ia mengandung tenaga matahari yang mempunyai banyak manfaat, juga dapat mematangkan buah-buahan dan masih banyak manfaat-manfaat lainnya yang ada pada pelita ini yang telah Allah cipakan untuk para hamba-Nya. (1) Dikeluarkan Bukhari (534) dan Muslim (615) dari hadits Abu Hurairah radhiyallaahu 'anhu. (2) Dikeluarkan Bukhari (537) dan Muslim (617) dari hadits Abu Hurairah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 13: 6-16. Allah menyebutkan Sembilan dalil yang menunjukkan atas ke Maha Mampuan-Nya atas membangkitkan dari yang mati dan menghidupkannya kembali. Allah berkata : Bukankah Kami yang menciptakan bumi dan menjadikannya terhampar bagi kalian ? dan kalian dapat bergerak sebagaimana yang kalian inginkan ? Dan bukankah kami ciptakan pada bumi itu gunung dan kami jadikan kokoh tertancap hingga kalian tidak terpental dan juga terguncang ? Dan bukankah kami jadikan segolongan laki-laki dan juga perempuan bagi kalian agar supaya berkembang biak dan memperbanyak keturunan ? Dan bukankah kami jadikan tidur bagi kalian sebagai pemutus aktivitas kalian dan sebagai waktu istirahat bagi tubuh-tubuh kalian ? Dan bukankah kami jadikan malam dengan kegelapannya agar supaya kalian menetap di tempat-tempat tinggal kalian dan beristirahat dari segala sesuatunya agar kembali dapat menyonsong kehidupan di siang harinya ? Dan bukankah malam adalah waktu bagi manusia untuk kembali (mencari tempat tinggal) bagi raga, karena kegelapannya yang senantiasa pekat menutupi, sebagaimana pakaian yang menutupi tubuh ? Dan bukankah kami jadikan siang dengan cahayanya agar manusia senantiasa beraktivitas menyongsong kehidupannya ? Dan bukankah kami ciptakan tujuh langit di atas kalian yang nyata tegaknya serta kokoh dan padat, tidaklah padanya terdapat keretakan (celah) dan tidak juga keretakan ? Dan bukankah kami jadikan matahari yang terkumpul padanya diantara cahaya dan panas ? Maka cahaya tersebut menjadikan makhluk dapat melihat dan panas menjadikan tumbuhan dapat ber foto sintesis dan manusia dapat memanfaatkannya. Dan bukankah kami turunkan air yang sangat banyak dari langit yang terkumpul ?; Agar supaya menumbuhkan biji-bijian dan tumbuhan, begitu juga kebun-kebun, taman-taman terkumpul di dalamnya pepohonan dan cabang-cabang dari rantingnya. Kesimpulannya dari dalil-dalil yang telah disebutkan adalah, barangsiapa yang mampu menciptakan atas segala sesuatu yang telah disebutkan tadi maka mampu pula untuk menghidupkan manusia setelah matinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 13",
    "description": "Dan bukankah kami juga telah menjadikan matahari dengan sinarnya yang kuat sebagai pelita yang terang-benderang' cahayanya yang terang, panasnya yang menyebar, dan bergesernya posisi matahari di langit dari musim ke musim membawa maanfaat sangat banyak bagi kehidupan manusia. 14. Dan bukankah telah pula kami turunkan dari sela-sela awan yang mengandung uap air yang pekat itu air hujan yang tercurah dengan hebatnya' air sangat besar artinya bagi kehidupan manusia dan makhluk hidup lainnya, baik flora maupun fauna."
  }
]