[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-16. Kami menurunkan dari awan hujan yang tercurah dengan deras. Supaya Kami keluarkan dengan air hujan itu biji-bijian yang dijadikan makanan pokok manusia dan apa yang akan dimakan oleh hewan-hewan, Dan juga kebun-kebun yang subur, sebagian pohonnya berkait sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Agar dengan air hujan itu Kami tumbuhkan berbagai macam biji-bijian dan tumbuh-tumbuhan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. لِّنُخْرِجَ بِهِۦ حَبًّا وَنَبَاتًا (supaya Kami tumbuhkan dengan air itu biji-bijian dan tumbuh-tumbuhan) Biji-bijian seperti gandum, jelai, dan lain sebagainya. Sedangkan makna (النبات) yakni rumput dan tanaman lain yang dipakai untuk pakan hewan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Sesuai daurnya, Kami turunkan hujan yang lebat dan melimpah dari awan dan mendung. Al-mu’shirat adalah awan mendung yang dipenuhi dengan air. Agar dengan adanya air hujan itu dapat tumbuh berbagai biji-bijian dan tanaman seperti gandum dan jewawut dan sebagainya, sebagai bahan makanan untuk manusia. Kami juga menumbuhkan berbagai tetumbuhan sebagai makanan bagi hewan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Kami menumbuhkan dengannya biji-bijian, tanam-tanaman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-16 Maksudnya, bukankah kami telah memberikan kalian berbagai nikmat agung, kami menjadikan untuk kalian, “bumi itu sebagai hamparan,” yaitu dihamparkan dan ditundukkan bagi kalian dan untuk kepentingan kepentingan berupa tanah garapan, tempat tinggal dan jalan. “Dan gunung gunung sebagi pasak,” mengokohkan bumi agar tidak berguncang bersama kalian. “Dan kami jadikan kamu berpasang pasangan,” yakni lelaki dan perempuan dari jenis yang sama agar masing masing dari keduanya merasa tentang pada yang lain dan membentuk rasa cinta dan kasih serta membuahkan keturunan dari keduanya. Dan termasuk dalam karunia ini adalah nikmatnya wanita yang dinikahi. “Dan kami jadikan tidurmu untuk istirahat,“ yakni sebagai istirahat bagi kalian dan sebagai pemutus pekerjaan yang jika terus dilakukan akan membahayakan badan. Allah menjadikan malam dan tidur sebagai penutup agar gerakan gerakan mereka yang membahayakan menjadi tenang dan mereka mendapatkan kenyamanan yang bermanfaat. “Dan kami bangun di atas kamu tujuh lapis (langit) yang kokoh,” yakni tujuh langit yang amat kuat dan kokoh. Allah menahannya dengan kusasanya dan menjadikannya sebagai atap bagi bumi. Padanya terdapat berbagai manfaat bagi manusia. Karena itulah Allah menyebutkan di antara manfaat matahari seraya berfirman, “Dan kami jadikan pelita yang amat terang (matahari).” Allah mengingatkan manusia pada matahari berupa nikmat cahayanya yang menjadi kebutuhan vital bagi mereka dan pada panasnya, karena padanya terdapat berbagai manfaat, seperti untuk mematangkan (buah-buahan). “Dan kami turunkan dari awan air yang banyak tercurah,“ yakni sangat deras, “supaya kami tumbuhkan dengan air itu biji bijian,” seperti gandum, jagung, beras dan lainnya yang menjadi makanan manusia, “dan tumbuh tumbuhan,” mencakup seluruh tumbuh tumbuhan yang dijadikan Allah sebagai makanan untuk binatang ternak mereka, “dan kebun kebun yang lebat,” yaitu kebun kebun yang lebat, yang di dalamnya terdapat berbagai macam buah buahan yang lezat. Untuk itu, Dzat yang memberi kalian berbagai nikmat agung yang tidak terkira dan terhitung jumlahnya ini, bagaimana bisa kalian kufuri dan kalian dustakan berita yang dikabarkan pada kalian tentang hari kebangkitan dan pengumpulan nanti? Atau mengapa kalian menggunakan nikmat-nikmat Allah untuk bermaksiat dan untuk menentangnya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Untuk kami keluarkan dengan air hujan ini ( حَبَّاً )biji-bijian yang kalian jadikan sebagai makanan pokok, seperti gandum, dan jagung, dan semua jenis biji-bijian yang dikonsumsi oleh manusia dan juga hewan-hewan, ( وَ نَبَاتاً ) dan kami keluarkan pula dari bumi berbagai macam tumbuhan, semacam sayuran hijau, buah-buahan, dan rerumputan yang dimakan oleh binatang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لِنُخْرِجَ بِهِ “Agar Kami tumbuhkan dengan air itu” Maknanya: agar kami tumbuhkan dengan air yang turun dari langit ke bumi tersebut: حَبًّا وَنَبَاتًا “Biji-bijian dan tumbuh-tumbuhan” Sehingga bumi menumbuhkan dan Allah mengeluarkan dari berbagai macam dan jenis biji-bijian gandung, padi,jagung dan yang lainnya, dan juga tumbuhan penghasil buah-buahan seperti buah tin, buah anggur dan buah-buahan lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 15: 6-16. Allah menyebutkan Sembilan dalil yang menunjukkan atas ke Maha Mampuan-Nya atas membangkitkan dari yang mati dan menghidupkannya kembali. Allah berkata : Bukankah Kami yang menciptakan bumi dan menjadikannya terhampar bagi kalian ? dan kalian dapat bergerak sebagaimana yang kalian inginkan ? Dan bukankah kami ciptakan pada bumi itu gunung dan kami jadikan kokoh tertancap hingga kalian tidak terpental dan juga terguncang ? Dan bukankah kami jadikan segolongan laki-laki dan juga perempuan bagi kalian agar supaya berkembang biak dan memperbanyak keturunan ? Dan bukankah kami jadikan tidur bagi kalian sebagai pemutus aktivitas kalian dan sebagai waktu istirahat bagi tubuh-tubuh kalian ? Dan bukankah kami jadikan malam dengan kegelapannya agar supaya kalian menetap di tempat-tempat tinggal kalian dan beristirahat dari segala sesuatunya agar kembali dapat menyonsong kehidupan di siang harinya ? Dan bukankah malam adalah waktu bagi manusia untuk kembali (mencari tempat tinggal) bagi raga, karena kegelapannya yang senantiasa pekat menutupi, sebagaimana pakaian yang menutupi tubuh ? Dan bukankah kami jadikan siang dengan cahayanya agar manusia senantiasa beraktivitas menyongsong kehidupannya ? Dan bukankah kami ciptakan tujuh langit di atas kalian yang nyata tegaknya serta kokoh dan padat, tidaklah padanya terdapat keretakan (celah) dan tidak juga keretakan ? Dan bukankah kami jadikan matahari yang terkumpul padanya diantara cahaya dan panas ? Maka cahaya tersebut menjadikan makhluk dapat melihat dan panas menjadikan tumbuhan dapat ber foto sintesis dan manusia dapat memanfaatkannya. Dan bukankah kami turunkan air yang sangat banyak dari langit yang terkumpul ?; Agar supaya menumbuhkan biji-bijian dan tumbuhan, begitu juga kebun-kebun, taman-taman terkumpul di dalamnya pepohonan dan cabang-cabang dari rantingnya. Kesimpulannya dari dalil-dalil yang telah disebutkan adalah, barangsiapa yang mampu menciptakan atas segala sesuatu yang telah disebutkan tadi maka mampu pula untuk menghidupkan manusia setelah matinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimakan manusia. Untuk dimakan hewan ternak mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 15",
    "description": "Kami turunkan hujan untuk kami tumbuhkan dengan air itu biji-bijian, seperti padi dan gandum dan tanam-tanaman lainnya. Biji-bijian yang pada awalnya terlihat mati akan hidup dan tumbuh begitu tersiram air hujan. Begitulah gambaran kebangkitan manusia di hari kiamat. 16. Dan dengan air hujan itu tumbuh kebun-kebun yang rindang. Kebun-kebun itu kemudian memproduksi oksigen, memberi kerindangan, dan menciptakan pemandangan yang indah."
  }
]