[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Sesungguhnya hari penetapan keputusan diantara makhluk,yaitu hari kiamat,merupakan waktu yang telah ditentukan untuk orang orang terdahulu dan orang orang kemudian, Hari yang pada saat itu malaikat meniup sangkakala sebagai tanda kebangkitan,kalian bangkit sebagai umat umat,setiap umat bersama imamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. \"Sesungguhnya Hari Keputusan di antara manusia adalah janji yang sudah ditentukan pada waktu yang tidak akan mundur.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-20. Sungguh hari kiamat yang menjadi waktu penetapan perkara antara makhluk zalim dan yang terzalimi adalah waktu yang telah ditentukan bagi seluruh makhluk. Pada hari ketika malaikat meniup sangkakala sebagai tanda kebangkitan, maka kalian akan datang dengan berkelompok-kelompok; langit akan terpecah sehingga menjadi berlubang dan pintu-pintu; gunung-gunung akan tercabut dari akarnya sehingga berterbangan seperti pasir yang tertiup angin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. إِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقٰتًا (Sesungguhnya Hari Keputusan adalah suatu waktu yang ditetapkan) Yakni waktu yang telah ditetapkan bagi seluruh manusia yang akan menghadapinya untuk mendapatkan pehala atau siksaan yang dijanjikan kepadanya. Dinamakan sebagai hari keputusan karena Allah ketika itu memutuskan perkara antara makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Sungguh hari penetapan itu adalah hari kiamat, hari penghitungan/ pengadilan hukum Allah atas semua makhluk. Hukum Allah mempunyai waktu yang sudah ditetapkan dalam memberi balasan nikmat atau siksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya hari keputusan itu} hari keputusan di antara makhluk {adalah waktu yang telah ditetapkan} waktu yang tekah ditentukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Diawal surat Allah menyebutkan berita yang orang-orang kafir musyrikin saling bertanya tentangnya, yaitu berita tentang kebangkitan setelah kematian yang disampakain oleh Rasulullah Muhammad kepada mereka, dan kemudian Allah menyebutkan bergabai dalil dan bukti akan kebenaranya, dan pada ayat ini Allah menyebutkan bahwa berita itu adalah tentang hari keputusan, yaitu hari kiamat. Allah mengatakan bahwa terjadinya hari kiamat pada hari ditiupnya sangkakala, dan hari itu telah Allah tentukan waktunya dan sedikpun tidak dimajukan ataupun diundur, jika waktu itu telah tiba maka hari itupun sangkakala ditiupkan dan terjadilah kiamat, sangkala itu akan ditiup oleh Malaikat israfil dan akan meniupnya sebanyak dua kali pada waktu berbeda : Tiupan sangkakala pertama : pada saat itu seluruh ummat manusia dibinasakan, seluruh makhluk hidup akan mati kecuali siapa yang dikehendaki Allah, sebagaimana yang Allah katakan : ( وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ۖ) ( Dan ditiuplah sangkakala, maka matilah siapa yang di langit dan di bumi kecuali siapa yang dikehendaki Allah ) : Az-Zumar 68 . Kemudian ditiupkan sangkakala yang kedua : yaitu ditiupnya sangkakala untuk membangkitkan seluruh manusia dari kubur mereka untuk menghadap kepada Tuhan semesta alam, mereka kembali pada bentuk tubuh mereka seperti semula, dan tidak satupun dari mereka yang akan bisa menghindar, ketika malaikat israfil meniupkan sangkakala yang kedua kalinya, maka ruh-ruh kembali ke tubuhnya, Allah berfirman : ( ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ ) (Kemudian ditiup sangkakala itu sekali lagi maka tiba-tiba mereka berdiri menunggu (putusannya masing-masing )) , mereka menunggu kemana mereka akan berjalan, dan semua ini adalah mudah bagi Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ يَوْمَ الْفَصْلِ “Sesungguhnya Hari Keputusan” Adalah hari kiamat, dinamakan hari keputusan karena pada hari itu Allah memberi keputusan pada perselisihan yang ada pada hamba-hamba-Nya, pada perkara yang mereka perdebatkan, hari itu juga dipisahkan antara para pengikut kebenaran dengan pengikut kebatilan, orang-orang kafir dengan orang-orang beriman, orang-orang yang melampaui batas dengan orang-orang yang adil, dan pada hari itu juga dipisahkan antara penghuni surga dengan penghuni neraka. Sekelompok orang akan berada di surga dan kelompok lainnya berada di neraka. كَانَ مِيقَاتًا “adalah suatu waktu yang ditetapkan ” Maknanya: waktu ditetapkannya balasan dan waktu yang telah ditetapkan dengan jangka tertentu, sebagaimana Allah Ta’ala berfirman: وَمَا نُؤَخِّرُهُ إِلَّا لِأَجَلٍ مَعْدُودٍ “Dan kami tiadalah menundanya, melainkan sampai waktu yang ditentukan.” (QS. Hud: 104) bagaimana menurut anda dengan sesuatu yang waktu tibanya telah ditetapkan dengan jangka tertentu, anda lihat ajal begitu cepat berlalu, hari demi hari sampai akhirnya seorang insan tiba batasan akhirnya, begitu juga dunia terus belalu,hari demi hari hingga berhenti dibatas akhirnya,oleh kerenanya Allah Ta’ala berfirman: وَمَا نُؤَخِّرُهُ إِلَّا لِأَجَلٍ مَعْدُودٍ “Dan kami tiadalah menundanya, melainkan sampai waktu yang ditentukan.” dan segala sesuatu yang terhitung pasti akan berakhir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 17: 17-20. Kemudian Allah menjelaskan dari sisi hari kiamat dimana mereka bertanya-tanya dan mendustakannya; Maka Allah kabarkan bahwasanya hari kiamat memiliki waktu yang telah ditentukan dan kapan terjadinya bagi mereka yaitu manusia yang awal pertama kali diciptakan samapai paling akhirnya, dan Allah tidak akan ingkar atas perkataan-Nya. Dan pada hari itu manusia akan di ganjar dengan kebaikan atau di adzab, dan semuanya berdasarkan amalannya (di dunia). Allah menjelaskan pada hari itu malaikat meniup sangkakala dan agar manusia bangkit dari kuburnya dan ia adalah tiupan yang kedua, pada hari itu berkumpulah manusia ditempat perkumpulan bersama imam-imam mereka. Pada hari itu langit tersingkap dan bersamaan dengannya, turun para malaikat dan menjelma langit menjadi pintu-pintu yang banyak (bagi mereka para malaikat). Gunung-gunung meletus (pada hari itu) dan berpindah dari tempatnya yang semula sampai seperti debu berterbangan, sepeti inilah kejadian yang terus menerus terjadi di hari itu, hingga datang hari ketentuan untuk kehidupan yang abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan hal yang akan terjadi pada hari Kiamat, hari yang mereka saling bertanya-tanya tentangnya dan diingkari oleh orang-orang yang yang keras kepala. Hari yang besar yang Allah Subhaanahu wa Ta'aala telah menetapkan waktunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 17",
    "description": "Beralih dari penyebutan sembilan tanda kekuasaan-Nya, Allah lalu menyatakan hari kebangkitan sebagai suatu keniscayaan. Sungguh, hari keputusan adalah suatu waktu yang telah ditetapkan. Hanya Allah yang tahu kapan hari kiamat terjadi. Pada hari itu semua persoalan manusia akan diputuskan oleh Allah dengan seadil-adilnya. 18. Hari keputusan itu tiba pada hari ketika sangkakala ditiup oleh israfil, lalu kamu akan bangkit dari kuburmu dan datang berbondong-bondong dan berduyun-duyun menuju tempat berkumpul, yaitu padang mahsyar untuk menanti keputusan Allah."
  }
]