[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Sesungguhnya hari penetapan keputusan diantara makhluk,yaitu hari kiamat,merupakan waktu yang telah ditentukan untuk orang orang terdahulu dan orang orang kemudian, Hari yang pada saat itu malaikat meniup sangkakala sebagai tanda kebangkitan,kalian bangkit sebagai umat umat,setiap umat bersama imamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Yaitu pada Hari Malaikat meniup sangkakala untuk yang kedua kalinya lalu kalian -wahai manusia- datang dengan berkelompok-kelompok."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. يَوْمَ يُنفَخُ فِى الصُّورِ (yaitu hari (yang pada waktu itu) ditiup sangkakala) Yakni tanduk yang ditiup oleh malaikat Israfil. فَتَأْتُونَ(lalu kamu datang) Yakni datang ke tempat perhitungan. أَفْوَاجًا (berkelompok-kelompok) Yakni bergerombol-gerombol."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Hari dimana ketika bunyi sangkakala kedua berkumandang itulah waktunya manusia dibangkitkan dari kubur. Kalian datang dari kubur kalian berbondong-bondong dan berkelompok."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{hari (ketika) sangkakala ditiup} tiupan kedua Sangkakala {lalu kalian datang berbondong-bondong} kelompok demi kelompok"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "(يَوْمَ يُنْفَخُ فِي الصُّورِ) (hari ditiupnya sangkakala), yaitu tiupan yang kedua, (فَتَأْتُونَ أَفْوَاجًا) kalian datang menghadap Tuhan kalian, dalam kelompok kelompok yang banyak, setiap ummat akan datang bersama Rasul (utusan Allah) yang datang kepada mereka menyampaikan risalah Allah, ( يَوْمَ نَدْعُو كُلَّ أُنَاسٍ بِإِمَامِهِمْ ۖ) ((Ingatlah) suatu hari (yang di hari itu) Kami panggil tiap umat dengan pemimpinnya ), maka datanglah mereka bersama Rasul mereka, mereka datang dengan berkelompok-kelompok, mulai dari umat-umat terdahulu sampai umat yang terakhir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَوْمَ يُنْفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا “yaitu hari ditiupnya sangkakala lalu kamu datang berkelompok-kelompok,” Yang diperintahkan untuk meniupkannya adalah malaikat Israfil, ia akan menuipnya sebanyak dua kali: Pertama: Manusia terkejut, pingsan dan mereka meninggal, kedua: mereka dibangkitkan dari kubur dan nyawa-nyawa mereka akan dikembalikan ke jasad-jasad mereka, oleh kerena itu, di sini Allah Ta’ala berfirman: يَوْمَ يُنْفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا “yaitu hari ditiupnya sangkakala lalu kamu datang berkelompok-kelompok,” pada ayat ini ada sesuatu yang disingkat tersembunyi yaitu: kalian dihidupkan kembali lalu datang berkelompok kelompok, datang dengan berkelompok kemudian dilanjut dengan kelompok lainnya. Kelompok-kelompok ini wallaahu a’lam disesuaikan dengan umat-umat tertentu, setiap umat akan dipanggil dengan kitabnya untuk dihisab. Manusia akan datang berkelompok-kelompok pada saat itu, bumi pun diratakan dan Allah membiarkannya kosong dan datar tidak terlihat ada yang menonjol dan menjorok kedalam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 18: 17-20. Kemudian Allah menjelaskan dari sisi hari kiamat dimana mereka bertanya-tanya dan mendustakannya; Maka Allah kabarkan bahwasanya hari kiamat memiliki waktu yang telah ditentukan dan kapan terjadinya bagi mereka yaitu manusia yang awal pertama kali diciptakan samapai paling akhirnya, dan Allah tidak akan ingkar atas perkataan-Nya. Dan pada hari itu manusia akan di ganjar dengan kebaikan atau di adzab, dan semuanya berdasarkan amalannya (di dunia). Allah menjelaskan pada hari itu malaikat meniup sangkakala dan agar manusia bangkit dari kuburnya dan ia adalah tiupan yang kedua, pada hari itu berkumpulah manusia ditempat perkumpulan bersama imam-imam mereka. Pada hari itu langit tersingkap dan bersamaan dengannya, turun para malaikat dan menjelma langit menjadi pintu-pintu yang banyak (bagi mereka para malaikat). Gunung-gunung meletus (pada hari itu) dan berpindah dari tempatnya yang semula sampai seperti debu berterbangan, sepeti inilah kejadian yang terus menerus terjadi di hari itu, hingga datang hari ketentuan untuk kehidupan yang abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh malaikat Israafil. Dari kuburmu. Pada hari itu terjadi kecemasan yang luar biasa yang menjadikan anak-anak beruban, hati ketakutan, gunung-gunung dijalankan lalu dijadikan seperti debu yang dihambur-hamburkan, langit terbelah menjadi pintu-pintu dan Allah Subhaanahu wa Ta'aala memberikan keputusan dengan hukum-Nya yang adil, api neraka yang Allah sediakan untuk orang-orang yang melampaui batas menyala, dan Dia jadikan neraka itu sebagai tempat tinggal mereka dalam waktu yang lama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 18",
    "description": "Hari keputusan itu tiba pada hari ketika sangkakala ditiup oleh israfil, lalu kamu akan bangkit dari kuburmu dan datang berbondong-bondong dan berduyun-duyun menuju tempat berkumpul, yaitu padang mahsyar untuk menanti keputusan Allah. 19. Dan pada hari itu langit pun dibukalah, maka terdapatlah beberapa pintu akibat banyaknya rekahan di sana. Dari pintu-pintu itu para malaikat turun untuk melaksanakan tugas masing-masing."
  }
]