[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Langit dibuka,ia memiliki pintu pintu yang banyak untuk turunnya para malaikat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan dibukalah langit, sehingga langit mempunyai celah-celah seperti pintu-pintu yang terbuka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَفُتِحَتِ السَّمَآءُ (dan dibukalah langit) Untuk turunnya para malaikat. فَكَانَتْ أَبْوٰبًا (maka terdapatlah beberapa pintu) Yakni sehingga memiliki banyak pintu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Langit terbelah, sehingga menjadi berpintu banyak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Langit pun dibuka} terbelah {Lali terdapat beberapa pintu} lalu ada banyak celah padanya layaknya pintu-pintu yang terbuka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka ketika itu dibukalah langit-langit, dan terdapat beberapa pintu untuk para Malaikat, ( وَيَوْمَ تَشَقَّقُ السَّمَاءُ بِالْغَمَامِ وَنُزِّلَ الْمَلَائِكَةُ تَنْزِيلًا ) (Dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut putih dan diturunkanlah malaikat bergelombang-gelombang) , yaitu ketika pintu-pintu langit dibuka maka turunlah para Malaikat. Dan dikatakan dalam riwayat lain : bahwa maksud dari ayat ini ialah, langit ketika itu terpecah belah, yang sebelumnya adalah merupakan ciptaan Allah yang sangat kuat dan kokoh kemudian terpecah; dikarenakan masanya telah habis."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا “dan dibukalah langit, maka terdapatlah beberapa pintu,” Dibuka: terpancar sehingga terbuka menjadi beberapa pintu yang disaksikan manusia setelah sebelumnya seperti atap yang terjaga, pada hari itu pintu-pintu langit terbuka. Di sini terdapat dalil sempurnanya kuasa Allah ’Azza Wa Jalla bahwa tujuh langit yang kokoh ini pada hari kiamat Allah Ta’ala jadikan tidak seperti sebelumnya, ia menjadi beberapa pintu يَوْمَ تَكُونُ السَّمَاءُ كَالْمُهْلِ (8) وَتَكُونُ الْجِبَالُ كَالْعِهْن “Pada hari ketika langit menjadi seperti luluhan perak. Dan gunung-gunung menjadi seperti bulu (yang beterbangan)”(QS. Al-Ma’arij: 8-9)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 19: 17-20. Kemudian Allah menjelaskan dari sisi hari kiamat dimana mereka bertanya-tanya dan mendustakannya; Maka Allah kabarkan bahwasanya hari kiamat memiliki waktu yang telah ditentukan dan kapan terjadinya bagi mereka yaitu manusia yang awal pertama kali diciptakan samapai paling akhirnya, dan Allah tidak akan ingkar atas perkataan-Nya. Dan pada hari itu manusia akan di ganjar dengan kebaikan atau di adzab, dan semuanya berdasarkan amalannya (di dunia). Allah menjelaskan pada hari itu malaikat meniup sangkakala dan agar manusia bangkit dari kuburnya dan ia adalah tiupan yang kedua, pada hari itu berkumpulah manusia ditempat perkumpulan bersama imam-imam mereka. Pada hari itu langit tersingkap dan bersamaan dengannya, turun para malaikat dan menjelma langit menjadi pintu-pintu yang banyak (bagi mereka para malaikat). Gunung-gunung meletus (pada hari itu) dan berpindah dari tempatnya yang semula sampai seperti debu berterbangan, sepeti inilah kejadian yang terus menerus terjadi di hari itu, hingga datang hari ketentuan untuk kehidupan yang abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk turunnya malaikat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 19",
    "description": "Dan pada hari itu langit pun dibukalah, maka terdapatlah beberapa pintu akibat banyaknya rekahan di sana. Dari pintu-pintu itu para malaikat turun untuk melaksanakan tugas masing-masing. 20. Dan pada hari itu gunung-gunung pun yang tadinya kukuh dijalankan oleh Allah dengan terlebih dahulu dihancurluluhkan, lalu diempaskan menjadi abu, lalu menjadi seperti kapas yang beterbangan, lalu pada akhirnya terempas sehingga menjadi fatamorgana. Seperti halnya fatamorgana di gurun pasir, asap pekat yang menggumpal tampak seperti gunung padahal tidak ada gunung di sana (lihat pula: surah al-kahf/18: 47, t'h'/20: 105'107, an-naml/27: 88, al-q'ri'ah/101: 5)."
  }
]