[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Gunung-gunung yang kokoh dicabut sehingga menjadi seperti fatamorgana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan gunung-gunung dijadikan berjalan sehingga menjadi seperti debu yang beterbangan, laksana fatamorgana."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا (dan dijalankanlah gunung-gunung maka menjadi fatamorganalah ia) Yakni diangkat dan dicabut dari tempatnya ke udara sehingga beterbangan, orang yang melihatnya akan menyangka itu hanyalah fatamorgana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Gunung-gunung dibuat berjalan/berpindah dari tempatnya. Sebelum tiupan sangkakala kedua gunung-gunung itu menjadi debu yang berhamburan. Gunung-gunung itu menjadi terlihat layaknya fatamorgana, terlihat seperti gunung namun bukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka ia menjadi fatamorgana} debu yang bertebaran sehingga seperti fatamorgana bagi mata yang memandang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "(وَسُيِّرَتِ الْجِبَالُ) sebagaimana yang Allah katakan dalam ayat lain dan merupakan satu makna dengan ayat ini : (وَإِذَا الْجِبَالُ سُيِّرَتْ) At-Takwir ; 3 , gunung-gunung yang kokoh beterbangan dari tempatnya dan berjalan di atas udara, Allah ta'ala mengatakan dalam surat Al-Waqiah 5-6 : ( وَبُسَّتِ الْجِبَالُ بَسًّا, فَكَانَتْ هَبَاءً مُنْبَثًّا ) (dan gunung-gunung dihancur luluhkan seluluh-luluhnya, maka jadilah ia debu yang beterbangan ), dan maksud dari ( فَكَانَتْ سَرَابًا ) adalah gunung-gunung itu yang diterbangkan sejauh-jauhnya dan terlihat jelas akan tetapi ketika gunung itu ingin didekati tidak pernah digapai. Beberapa ayat yang telah disebutkan adalah merupakan kejadian-kejadian yang ada pada hari kiamat, adalah merupakan peristiwa yang sangat menyeramkan lagi menakutkan ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah menyebutkan kondisi lainnya dalam firman-Nya: وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا “dan dijalankanlah gunung-gunung maka menjadi fatamorganalah ia” Maknanya: Gunung-gunung yang besar dan kokoh dileburkan bagai pasir kemudian ia menjadi seperti fatamorgana yang berjalan: وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا “dan dijalankanlah gunung-gunung maka menjadi fatamorganalah ia”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 20: 17-20. Kemudian Allah menjelaskan dari sisi hari kiamat dimana mereka bertanya-tanya dan mendustakannya; Maka Allah kabarkan bahwasanya hari kiamat memiliki waktu yang telah ditentukan dan kapan terjadinya bagi mereka yaitu manusia yang awal pertama kali diciptakan samapai paling akhirnya, dan Allah tidak akan ingkar atas perkataan-Nya. Dan pada hari itu manusia akan di ganjar dengan kebaikan atau di adzab, dan semuanya berdasarkan amalannya (di dunia). Allah menjelaskan pada hari itu malaikat meniup sangkakala dan agar manusia bangkit dari kuburnya dan ia adalah tiupan yang kedua, pada hari itu berkumpulah manusia ditempat perkumpulan bersama imam-imam mereka. Pada hari itu langit tersingkap dan bersamaan dengannya, turun para malaikat dan menjelma langit menjadi pintu-pintu yang banyak (bagi mereka para malaikat). Gunung-gunung meletus (pada hari itu) dan berpindah dari tempatnya yang semula sampai seperti debu berterbangan, sepeti inilah kejadian yang terus menerus terjadi di hari itu, hingga datang hari ketentuan untuk kehidupan yang abadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 20",
    "description": "Dan pada hari itu gunung-gunung pun yang tadinya kukuh dijalankan oleh Allah dengan terlebih dahulu dihancurluluhkan, lalu diempaskan menjadi abu, lalu menjadi seperti kapas yang beterbangan, lalu pada akhirnya terempas sehingga menjadi fatamorgana. Seperti halnya fatamorgana di gurun pasir, asap pekat yang menggumpal tampak seperti gunung padahal tidak ada gunung di sana (lihat pula: surah al-kahf/18: 47, t'h'/20: 105'107, an-naml/27: 88, al-q'ri'ah/101: 5). 21. Demikianlah fenomena hari kiamat yang sangat mencekam. Allah lalu beralih menjelaskan nasib orang kafir di akhirat. Sungguh, neraka jahanam itu kami jadikan sebagai tempat mengintai bagi para penjaga yang mengawasi neraka. Tidak ada satu orang kafir pun yang bisa lari dari siksa neraka."
  }
]