[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-26. Pada hari itu,neraka jahanam mengintai orang orang kafir Yang mana neraka jahanam itu memang disiapkan bagi mereka. Ia adalah tempat kembali bagi orang orang kafir sebagai tempat kembali mereka,mereka tinggal disana selama-lamanya,tidak berpenghabisan, Mereka tidak diberi makan dengan sesuatu yang mendinginkan panasnya,tidak diberi minum yang menghilangkan dahaga mereka, Kecuali air panas dan nanah penghuni neraka, Mereka di balas demikian sebagai balasan yang adil sesuai dengan amal-amal mereka yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Sesungguhnya Neraka Jahanam itu senantiasa diawasi dan diintai."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-26. Sungguh neraka Jahannam telah menunggu para penghuninya yang merupakan orang-orang yang menantiasa melakukan dosa-dosa hingga kekafiran; mereka akan kekal di dalamnya. Mereka tidak akan merasakan hal yang menyejukkan badan mereka dari panas neraka, tidak akan menemukan minuman yang dapat menghilangkan kehausan kecuali air yang sangat panas dan nanah busuk yang keluar dari tubuh para penghuni neraka. Mereka mendapat balasan itu sebagai balasan yang adil atas amal perbuatan buruk mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا (Sesungguhnya neraka Jahannam itu (padanya) ada tempat pengintai) Yakni para malaikat penjaga neraka menngawasi orang-orang kafir dan untuk mengazab mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21–22. Neraka Jahannam itu benar-benar menjadi tempat pengawasan bagi para penjaganya, yang mengawasi isi neraka bagi orang-orang kafir. Neraka yang diperuntukkan untuk para pembangkang kafir, mereka yang menentang perintah Allah dan mereka yang berpaling."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya neraka Jahanam itu tempat mengintai} tempat untuk mengintai bagi malaikat yang ditugaskan di sana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "(إِنَّ جَهَنَّمَ ) Neraka, dan Jahannam adalah salah satu nama dari sejumlah Neraka yang ada, (كَانَتْ مِرْصَادًا) adalah tempat megintai dan telah disiapkan untuk orang-orang kafir, sedikitpun mereka tidak akan bisa menghindar ataupun berpaling dari siksaan yang ada didalamnya, mereka tidak memiliki tempat untuk meloloskan diri darinya, Allah berfirman (وَرَأَى الْمُجْرِمُونَ النَّارَ فَظَنُّوا أَنَّهُمْ مُوَاقِعُوهَا ) (Dan orang-orang yang berdosa melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya ) (وَلَمْ يَجِدُوا عَنْهَا مَصْرِفًا) (dan mereka tidak menemukan tempat berpaling dari padanya. ) Al-Kahfi : 53 ) mereka sama sekali tidak akan bisa melarikan diri, dan taubat mereka tidak diterima."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا “Sesungguhnya neraka Jahanam itu (padanya) ada tempat pengintai,” Maknanya: Tempat pengintai dan disiapkan untuk orang-orang yang melampaui batas. Jahannam adalah salah satu dari nama-nama neraka yang mempunyai banyak nama, dinamakan demikian karena kondisinya gelap gulita dengan hitam dan dalamnya. Semoga Allah melindungi kita semua darinya. Jahannam adalah pengintai orang-orang yang melampaui Allah ‘Azza Wa Jalla telah menyiapkannya sejak saat ini, jahannam sudah ada sebagaimana firman Allah Ta’ala: وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكَافِرِينَ “Dan peliharalah dirimu dari api neraka, yang disediakan untuk orang-orang yang kafir.” (QS. Ali Imran: 131) Nabi shallallaahu ‘alaihi wa sallam telah melihatnya ketika ditampakkan saat sholat gerhana (1), beliau melihat di dalamnya ada seorang perempuan yang disiksa karena seekor kucing yang ia kurung, ia tidak memberi makan dan tidak juga melepasnya, sehingga ia bisa makan hewan kecil di bumi.(2) Beliau juga melihat Amer Bin Luhay al-Khuza’iy ususnya terburai menyapu di neraka(3), karena ialah yang pertama memasukkan kesyirikan ke bangsa arab. (1) Dikeluarkan Bukhari (431) dan Muslim (907) dari hadits Abdullah Bin Abbas radhiyallaahu 'anhuma. (2) Dikeluarkan Muslim (904) dari hadits Jabir Bin Abdullaah radhiyallaahu 'anhuma. (3) Dikeluarkan Bukhari (3521) dan Muslim (2856) dari hadits Abu Hurairah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 21: 21-25. Kemudian setelah Allah menjelaskan ke Maha Kuasaan-Nya atas makhluk-Nya, Allah menjelaskan balasan bagi orang-orang kafir, dimana (Ia) mengabarkan bahwa jahannam adalah tempat bagi mereka untuk di adzab di akhirat. Allah jerat mereka dengan adzab, Allah janjikan bagi mereka suatu tempat yang menanti (mereka) dengan segala sesuatunya yang di dalamnya terdapat kejelekan dengan sebab amalan buruk mereka. Allah kabarkan kondisi jahannam bagi mereka yang nekat untuk menerobos ketentuan-ketentuan Allah (selama di dunia). Bagi mereka (orang-orang kafir) tempatnya adalah di neraka sepanjang masa tiada akhir. Dikecualikan darinya orang-orang mukmin yang bermaksiat sehingga masuk ke dalam neraka untuk disucikan atas dosa-dosanya, kemudian ia (kaum mukminin) dikeluarkan untuk menuju ke dalam surga. Mereka orang-orang kafir tidak akan pernah merasakan apa yang mereka kaum mukminin beristirahat didalamnya (surga), begitu pula kaum mukminin tidak akan merasakan kehausan (sebagaimana orang-orang kafir); Bahkan minuman-minuman mereka (orang-orang kafir) pada hari itu adalah air yang mendidih dan nanah para penghuni neraka. Kemudian Allah menjelaskan balasan bagi mereka (orang-orang kafir) atas apa yang mereka amalkan dari amalan-amalan penghuni neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, di neraka Jahannam ada suatu tempat yang dari tempat itu para penjaga neraka mengintai dan mengawasi isi neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 21",
    "description": "Demikianlah fenomena hari kiamat yang sangat mencekam. Allah lalu beralih menjelaskan nasib orang kafir di akhirat. Sungguh, neraka jahanam itu kami jadikan sebagai tempat mengintai bagi para penjaga yang mengawasi neraka. Tidak ada satu orang kafir pun yang bisa lari dari siksa neraka. 22. Neraka jahanam itu menjadi tempat kembali bagi orang-orang yang melampaui batas dengan menentang aturan agama dan mendustakan para rasul Allah. Kami akan siksa mereka di sana sebagai balasan atas perbuatan mereka, sebagaimana telah kami peringatkan sebelumnya."
  }
]