[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-26. Pada hari itu,neraka jahanam mengintai orang orang kafir Yang mana neraka jahanam itu memang disiapkan bagi mereka. Ia adalah tempat kembali bagi orang orang kafir sebagai tempat kembali mereka,mereka tinggal disana selama-lamanya,tidak berpenghabisan, Mereka tidak diberi makan dengan sesuatu yang mendinginkan panasnya,tidak diberi minum yang menghilangkan dahaga mereka, Kecuali air panas dan nanah penghuni neraka, Mereka di balas demikian sebagai balasan yang adil sesuai dengan amal-amal mereka yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Jahannam itu sebagai tempat kembali bagi orang-orang yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. لِّلطّٰغِينَ مَـَٔابًا (menjadi tempat kembali bagi orang-orang yang melampaui batas) Yakni tempat mereka kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21–22. Neraka Jahannam itu benar-benar menjadi tempat pengawasan bagi para penjaganya, yang mengawasi isi neraka bagi orang-orang kafir. Neraka yang diperuntukkan untuk para pembangkang kafir, mereka yang menentang perintah Allah dan mereka yang berpaling"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{menjadi tempat kembali bagi orang-orang zalim} tempat kembali yang mereka gunakan untuk kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "(لِلطَّاغِينَ ) yaitu orang-orang yang durhaka kepada Allah dengan melanggar segala aturan-Nya, dan bermaksiat kepada Rasulullah Muhammad shallallahu 'alaihi wa sallam, dan kata ( الطاغين ) berasal dari kata ( الطُغْيَان ) yang berarti : keluar dari batasan-batasan yang Allah telah tetapkan, mereka orang-orang kafir telah melampaui batas-batas yang telah Allah tetapkan didunia, mereka durhaka kepada sang Pencipta alam semesta, maka neraka jahannam adalah (مئاباً) yaitu tempat kembali mereka diakhirat, mereka tidak akan menemui tempat untuk menghindar dan meminta perlindungan, sedikitpun mereka tidak akan lengah, dan tidak akan terlambat, dan itulah seburuk-buruknya tempat kembali."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah berfirman bahwa nereka ini لِلطَّاغِينَ مَآبًا “menjadi tempat kembali bagi orang-orang yang melampaui batas” اَلطَّاغُوْن [Ath-Thaaghun] adalah bentuk jamak dari kata طَاغٍ [Thaaghin], artinya adalah orang yang melampaui batas, sebagaimana Allah Ta’ala berfirman: إِنَّا لَمَّا طَغَى الْمَاءُ حَمَلْنَاكُمْ فِي الْجَارِيَةِ “Sesungguhnya Kami, tatkala air telah naik (sampai ke gunung) Kami bawa kalian ke dalam bahtera, ” (QS. Al-Haqqoh: 11) maknanya adalah melebihi dan melampaui batasannya, dan batasan manusia telah disebutkan dalam firman-Nya: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُون “Dan Aku tidak menciptakan jin dan manusia melainkan supaya mereka menyembah-Ku.”(QS. Adz-Dzariyaat: 56) Melampaui batas bisa pada hak-hak Allah dan bisa juga pada hak-hak sesama hamba, ada pun melampaui batas pada hak-hak Allah yaitu dengan melalaikan kewajiban atau melakukan perkara yang haram, ada pun melampaui batas pada hak-hak sesama yaitu melapaui batas pada harta, darah dan kehormatan mereka. Tiga perkara itu lah yang Rasulullah shallallaahu ‘alaihi wa sallamharamkan, dan beliau umumkan keharamannya saat haji wada’ di lebih dari satu tempat: إنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ “ Sesungguhnya darah, harta dan kehormatan kalian haram atas kalian ”(1) . Orang-orang yang melampaui batas pada hak-hak Allah dan manusia mereka adalah penghuni neraka, wal’iyaadzu billaah. Oleh karena itu Allah berfirman لِلطَّاغِينَ مَآبًا “menjadi tempat kembali bagi orang-orang yang melampaui batas” Kata مَآبًا [Ma’aaba] bermakna مَكَانُ الْأَوبِ [tempat kembali] sedangkan kata اَلْأَوْب [al-Aubu(kembali)] asalnya berarti اَلرُّجُوعُ [ar-Ruju’] pulang. Sebagaimana dalam firman Allah Ta’ala : نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ “ dia adalah sebaik-baik hamba. Sesungguhnya dia kembali (kepada Allah)” (QS. Shad: 30) kata أَوَّابُ [Awwaab] bermakna: Pulang kembali kepada Allah ‘Azza Wa Jalla. (1) Dikeluarkan Muslim (1218) dari hadits Jabir Bin Abdullaah radhiyallaahu 'anhuma."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 22: 21-25. Kemudian setelah Allah menjelaskan ke Maha Kuasaan-Nya atas makhluk-Nya, Allah menjelaskan balasan bagi orang-orang kafir, dimana (Ia) mengabarkan bahwa jahannam adalah tempat bagi mereka untuk di adzab di akhirat. Allah jerat mereka dengan adzab, Allah janjikan bagi mereka suatu tempat yang menanti (mereka) dengan segala sesuatunya yang di dalamnya terdapat kejelekan dengan sebab amalan buruk mereka. Allah kabarkan kondisi jahannam bagi mereka yang nekat untuk menerobos ketentuan-ketentuan Allah (selama di dunia). Bagi mereka (orang-orang kafir) tempatnya adalah di neraka sepanjang masa tiada akhir. Dikecualikan darinya orang-orang mukmin yang bermaksiat sehingga masuk ke dalam neraka untuk disucikan atas dosa-dosanya, kemudian ia (kaum mukminin) dikeluarkan untuk menuju ke dalam surga. Mereka orang-orang kafir tidak akan pernah merasakan apa yang mereka kaum mukminin beristirahat didalamnya (surga), begitu pula kaum mukminin tidak akan merasakan kehausan (sebagaimana orang-orang kafir); Bahkan minuman-minuman mereka (orang-orang kafir) pada hari itu adalah air yang mendidih dan nanah para penghuni neraka. Kemudian Allah menjelaskan balasan bagi mereka (orang-orang kafir) atas apa yang mereka amalkan dari amalan-amalan penghuni neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 22",
    "description": "Neraka jahanam itu menjadi tempat kembali bagi orang-orang yang melampaui batas dengan menentang aturan agama dan mendustakan para rasul Allah. Kami akan siksa mereka di sana sebagai balasan atas perbuatan mereka, sebagaimana telah kami peringatkan sebelumnya. 23. Mereka yang melampaui batas itu tinggal di sana yakni neraka jahanam dalam masa yang lama. Hanya Allah yang mengetahui berapa lama mereka akan tinggal di neraka secara pasti. Bagi orang yang menderita, masa yang sebentar akan terasa sangat lama, apalagi jika masa itu benar-benar lama hingga ribuan tahun atau lebih."
  }
]