[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-26. Pada hari itu,neraka jahanam mengintai orang orang kafir Yang mana neraka jahanam itu memang disiapkan bagi mereka. Ia adalah tempat kembali bagi orang orang kafir sebagai tempat kembali mereka,mereka tinggal disana selama-lamanya,tidak berpenghabisan, Mereka tidak diberi makan dengan sesuatu yang mendinginkan panasnya,tidak diberi minum yang menghilangkan dahaga mereka, Kecuali air panas dan nanah penghuni neraka, Mereka di balas demikian sebagai balasan yang adil sesuai dengan amal-amal mereka yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Mereka menetap di dalamnya berabad-abad tidak ada batasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. لّٰبِثِينَ فِيهَآ أَحْقَابًا (mereka tinggal di dalamnya berabad-abad lamanya) Yakni mereka tetap di dalam neraka selama-lamanya. Makna (الحقب) yakni kurun waktu yang panjang, jika telah berlalu satu kurun maka akan masuk ke kurun yang lain, dan begitu seterusnya selama-lamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Mereka menetap di sana selamanya. Ahqaban adalah bentuk jamak dari haqabun jamak dari haqibah: bermakna waktu yang tidak berakhir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tinggal} mereka tinggal {di sana dalam masa yang lama} dalam masa-masa yang tidak ada akhirnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mereka tinggal didalam neraka jahannam bertahun-tahun lamanya, dan ( أَحْقَابًا ) adalah kata jamak dari ( حِقْبٌ ) yaitu : jumlah tahun tertentu, dikatakan bahwa lamanya adalah : 80 tahun, dan ada yang mengatakan : bahwa lebih dari itu, dan ada juga yang mengatakan : bahkan kurang dari 80 tahun, dalam satu satu tahun dua belas bulan , dan dalam satu bulan ada 30 hari, dan satu hari dihitung seribu tahun disisi Allah, inilah perumpamaan jangka waktu yang akan dilalui oleh orang-orang kafir didalam neraka jahannam, dan bahwasanya mereka tidak akan bisa keluar dari neraka; mereka kekal didalamanya. Dan kita tidak mengetahui secara pasti berapa tahun yang dimaksud dalam Ayat ini, apakah itu puluhan tahun, atau ratusan tahun, atau bahkan ribuan tahun ? sebagaimana yang tertera dalam ayat bahwa ( أَحْقَباً ) disini tidak dibatasi oleh jangka waktu tertentu. - semoga Allah selalu memberikan kita keselamatan - Mereka orang-orang kafir kekal didalamanya, mereka tidak lagi mengharapkan adanya kesempatan untuk keluar dari neraka Jahannam itu, dan sesungguhnya jahannam itulah tempat kembali mereka selamanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لَابِثِينَ فِيهَا أَحْقَابًا “mereka tinggal di dalamnya berabad-abad lamanya ” Maknanya: Mereka menetap terus menerus أَحْقَابًا [Ahqaabaa] maknanya: waktu yang sangat lama. Al-Quran menerangkan bahwa waktu tersebut tidak ada ujung akhirnya, sebagaimana itu diberitakan secara jelas dalam tiga ayat dalam Al-Quran. Pertama, dalam surat An-Nisa yaitu firman Allah Ta’ala: إِنَّ الَّذِينَ كَفَرُوا وَظَلَمُوا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا (168) إِلَّا طَرِيقَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا وَكَانَ ذَلِكَ عَلَى اللَّهِ يَسِيرًا (169) “Sesungguhnya orang-orang yang kafir dan melakukan kelaliman, Allah sekali-kali tidak akan mengampuni (dosa) mereka dan tidak (pula) akan menunjukkan jalan kepada mereka, kecuali jalan ke neraka Jahanam; mereka kekal di dalamnya selama-lamanya. Dan yang demikian itu adalah mudah bagi Allah.”(QS. An-Nisa: 168-169) kedua, dalam surat al-Ahzab: إِنَّ اللَّهَ لَعَنَ الْكَافِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا (64) خَالِدِينَ فِيهَا أَبَدًا لَا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا (65) “Sesungguhnya Allah melaknati orang-orang kafir dan menyediakan bagi mereka api yang menyala-nyala (neraka), mereka kekal di dalamnya selama-lamanya; mereka tidak memperoleh seorang pelindung pun dan tidak (pula) seorang penolong.”(QS. Al-Ahzaab: 64-65) dan ketiga, dalam surat al-Jinn: وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا (23) “Dan barang siapa yang mendurhakai Allah dan Rasul-Nya maka sesungguhnya baginyalah neraka Jahanam, mereka kekal di dalamnya selama-lamanya. ”(QS. Al-Jin: 23) Jika Allah telah memberitakannya secara terang-terangan dalam tiga ayat dalam kitab-Nya bahwa penghuni neraka (yang kafir) akan kekal selamanya di dalamnya, maka konsekuensinya adalah neraka selamanya akan ada, inilah yang diyakini oleh ahlussunnah wal jama’ah: bahwa neraka dan surga adalah makhluk yang tidak akan pernah binasa selamanya. Ada sedikit perbedaan pendapat di kalangan ahlussunnah dalam masalah keabadian neraka, mereka menyangka bahwa neraka tidak abadi, mereka berdalil dengan argumen-argumen yang sebenarnya itu adalah syubhat yang tidak dapat menunjukkan kebenaran pendapat mereka, dan jika dibandungkan dengan dalil-dalil lainnya maka akan jelas tidak ada celah bagi penentang juga bagi pendapatnya ini. Sehingga yang wajib bagi seorang mukmin: Meyakini sesuai yang ditunjukkan oleh al-Quran yang terang yang tidak ada kemungkinan penafsiran yang lain, ketiga ayat yang telah kami sebutkan semuanya jelas tidak ada nasakh (perubahan hukum) di dalamnya, dan tidak ada kemungkinan bemakna lainnya. Ada pun sebab tidak mingkin ada nasakh karena ayat-ayat tersebut adalah ayat-ayat berita, sedangkan berita-berita dari Allah tidak mungkin berubah, begitu juga berita-berita dari Rasul-Nya shallallaahu ‘alaihi wa sallam, karena kosekuansi perubahan berita adalah terdapat kedustaan pada berita pertama atau kedua. Bisa karena unsur sengaja dari penyampai berita, atau karena ketidak tahuan kondisi kejadian sesungguhnya. Semua itu tidak mungkin terjadi pada berita Allah dan berita Rasul-Nya yang dibangun di atas wahyu. Ada pun sebab ketidak mungkinan adanya makna lain adalah kerena ketiga ayat tersebut jelas menyatakan keabadian neraka. Yang terpenting adalah bahwa wajib bagi kita semua meyakini dua hal: Pertama: Surga dan neraka sudah ada sejak saat ini. Banyak dalil-dalil dari Al-Quran dan Sunnah yang menunjukkan hal ini, di antaranya firman Allah Ta’ala: وَسَارِعُوا إِلَى مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ “Dan bersegeralah kalian kepada ampunan dari Rabb kalian dan kepada surga yang luasnya seluas langit dan bumi yang disediakan untuk orang-orang yang bertakwa,”(QS. Ali Imran: 133) الإِعْدَاد [al-I’daad adalah bentuk masdar dari أُعِدَّتْ]: persiapan sinonim اَلتَّهِيْئَة [At-Tahiiah]: tersedia Fi’il (kata kerja) U’Iddat adalah menunjukan pekerjaan yang telah lalu, menunjukkan bahwa persiapannya telah dilaksanakan. Allah Ta’ala juga berfirman tentang neraka: وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكَافِرِينَ “Dan peliharalah dirimu dari api neraka, yang disediakan untuk orang-orang yang kafir.”(QS. Ali Imran: 131) I’dad (masdar bagi kata u’iddat) mermakna menyiapkan sesuatu. Fi’il (Kata kerja) u’iddat di sini menunjukan bahwa pekerjaannya telah dilakukan. Hadits-hadits pun telah menjelaskannya secara gamblang bahwa Nabi shallallaahu ‘alaihi wa sallam telah melihat surga dan neraka. Kedua: Menyakini bahwa kedua tersebut abadi, siapa saja yang telah memasukinya sedangkan dia memang dinobatkan sebagai penghuni tetap (seperti orang-orang kafir) maka ia akan tetap di dalamnya selama-lamanya abadi. Siapa saja yang memasuki surga maka ia tidak akan pernah keluar selamanya, Allah Ta’ala berfirman: وَمَا هُمْ مِنْهَا بِمُخْرَجِينَ “dan mereka sekali-kali tidak akan dikeluarkan daripadanya.”(QS. Al-Hijr: 48) sedangkan neraka maka para ahli maksiat yang beriman akan memasukinya sesuai kehendak Allah hingga kapanpun mereka menetap, kemudian mereka akan dikembalikan ke surga, sebagaimana telah diterangkan oleh berita-berita berupa hadits-hadits yang shahih dari Rasulullah shallallahu ‘alaihi wa sallam. Firman Allah Ta’ala: لَابِثِينَ فِيهَا أَحْقَابًا “mereka tinggal di dalamnya berabad-abad lamanya ” tidak menunjukkan bahwa abad-abad itu dan kondisi-kondisi tertentu terhitung dengan jumlah tertentu sehingga akan berakhir, akan tetapi maknanya adalah berabad-abad lamanya yang tidak ada akhirnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 23: 21-25. Kemudian setelah Allah menjelaskan ke Maha Kuasaan-Nya atas makhluk-Nya, Allah menjelaskan balasan bagi orang-orang kafir, dimana (Ia) mengabarkan bahwa jahannam adalah tempat bagi mereka untuk di adzab di akhirat. Allah jerat mereka dengan adzab, Allah janjikan bagi mereka suatu tempat yang menanti (mereka) dengan segala sesuatunya yang di dalamnya terdapat kejelekan dengan sebab amalan buruk mereka. Allah kabarkan kondisi jahannam bagi mereka yang nekat untuk menerobos ketentuan-ketentuan Allah (selama di dunia). Bagi mereka (orang-orang kafir) tempatnya adalah di neraka sepanjang masa tiada akhir. Dikecualikan darinya orang-orang mukmin yang bermaksiat sehingga masuk ke dalam neraka untuk disucikan atas dosa-dosanya, kemudian ia (kaum mukminin) dikeluarkan untuk menuju ke dalam surga. Mereka orang-orang kafir tidak akan pernah merasakan apa yang mereka kaum mukminin beristirahat didalamnya (surga), begitu pula kaum mukminin tidak akan merasakan kehausan (sebagaimana orang-orang kafir); Bahkan minuman-minuman mereka (orang-orang kafir) pada hari itu adalah air yang mendidih dan nanah para penghuni neraka. Kemudian Allah menjelaskan balasan bagi mereka (orang-orang kafir) atas apa yang mereka amalkan dari amalan-amalan penghuni neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 23",
    "description": "Mereka yang melampaui batas itu tinggal di sana yakni neraka jahanam dalam masa yang lama. Hanya Allah yang mengetahui berapa lama mereka akan tinggal di neraka secara pasti. Bagi orang yang menderita, masa yang sebentar akan terasa sangat lama, apalagi jika masa itu benar-benar lama hingga ribuan tahun atau lebih. 24. Mereka mendiami neraka jahanam dengan penuh penderitaan. Mereka tidak pernah merasakan kesejukan di dalamnya untuk sekadar menikmati udara segar atau keteduhan, dan tidak pula mendapat minuman untuk melepas dahaga yang sangat berat."
  }
]