[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-26. Pada hari itu,neraka jahanam mengintai orang orang kafir Yang mana neraka jahanam itu memang disiapkan bagi mereka. Ia adalah tempat kembali bagi orang orang kafir sebagai tempat kembali mereka,mereka tinggal disana selama-lamanya,tidak berpenghabisan, Mereka tidak diberi makan dengan sesuatu yang mendinginkan panasnya,tidak diberi minum yang menghilangkan dahaga mereka, Kecuali air panas dan nanah penghuni neraka, Mereka di balas demikian sebagai balasan yang adil sesuai dengan amal-amal mereka yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Di dalamnya mereka tidak bisa merasakan hawa sejuk yang mendinginkan panasnya Neraka, dan tidak pula bisa merasakan minuman yang bisa mereka nikmati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dalam Jahannam, mereka semua tidak akan merasakan kesejukan air untuk menyembuhkan kepanasan mereka, tidak juga untuk menyembuhkan dahaga mereka. Al bardu adalah hawa sejuk yang bisa menurunkan suhu panas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak merasakan} mereka tidak merasakan {kesejukan} udara sejuk {di dalamnya dan tidak (pula) minuman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Masa yang sangat panjang dan tak berujung, kehidupan didalamnya tidak ada batasnya, para penghuni tempat ini dipenuhi dengan berbagai macam azab dan siksaan yang sangat pedih, itulah neraka jahannam, mereka yang ada didalamnya tidak akan merasakan dingin ataupun sejuk, mereka terus mendapati diri mereka dalam hawa yang sangat panas, mereka sekali kali tidak akan merasakan dingin yang menenangkan diri mereka dari panasnya api neraka Jahannam, dan juga mereka tidak akan menemukan air yang bisa menghilangkan dahaga mereka. Dan dikatakan dalam riwayat lain bahwa maksud dari kata (ً بَرْدا ) ialah waktu istirahat untuk tidur mereka, bahwa mereka para penghuni jahannam tidak akan bisa istrahat demi memohon ampunan dari ALlah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لَا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا “mereka tidak merasakan kesejukan di dalamnya dan tidak (pula mendapat) minuman,” Allah ‘Azza Wa Jalla meniadakan kesejukkan yang dirasakan bagian luar tubuh dan meniadakan minuman yang dapat mengantarkan kesujukkan dalam tubuh, itu karena jika mereka merasa kehausan dan meminta bantuan, mereka sebagaimana firman Allah Ta’ala: وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ بِئْسَ الشَّرَابُ وَسَاءَتْ مُرْتَفَقًا “Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.” (QS. Al-Kahfi: 29). Apakah air yang seperti timah panas (yang mencair) jika di dekatkan ke wajah akan memanggangnya, apakah akan bermanfaat? Jawabannya: Simaklah firman Allah Ta’ala: وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ “dan diberi minuman dengan air yang mendidih sehingga memotong-motong ususnya”(QS. Muhammad: 15) ada pun tentang bagian luar tubuh Allah telah berfirman tentangnya: خُذُوهُ فَاعْتِلُوهُ إِلَى سَوَاءِ الْجَحِيمِ (47) ثُمَّ صُبُّوا فَوْقَ رَأْسِهِ مِنْ عَذَابِ الْحَمِيمِ “Peganglah dia kemudian seretlah dia ke tengah-tengah neraka. Kemudian tuangkanlah di atas kepalanya siksaan (dari) air yang amat panas. ” (QS. Ad-Dukhan: 47-48) Allah juga berfirman: يُصَبُّ مِنْ فَوْقِ رُءُوسِهِمُ الْحَمِيمُ (19) يُصْهَرُ بِهِ مَا فِي بُطُونِهِمْ وَالْجُلُودُ “Disiramkan air yang sedang mendidih ke atas kepala mereka. Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka). ”(QS. Al-Hajj: 19-20) Makna apa-apa yang ada diperut adalah usus. Usus adalah bagian dalam tubuh. Sedangkan kulit adalah bagian luar tubuh. Sehingga siapa saja yang diberikan itu semua maka mereka tidak akan meresakan kesejukkan dan minuman yang meredakan panasnya perut-perut mereka. Siapa saja yang menyelami kandungan yang ada dalam al-Quran dan hadits tentang ancaman yang keras bagi penghuni neraka maka semua itu tergambar seperti pernyataan sebagian salaf: “Aku merasa takjub pada neraka bagaimana mungkin bisa tidur orang yang kabur darinya, dan aku pun merasa takjub pada surga bagaimana mungkin bisa tidur orang yang mencarinya” Sunggah andai ada yang berkata pada kita: Sesungguhnya kalian akan mendapatkan di ujung dunia sana istana-istana, sungai-sungai, istri-sitri dan buah-buahan tidak akan pernah lepas dari kita dan kita tidak akan lepas dari itu semua, maka kita pasti akan pergi ke surga itu yang terdapat kenikmatan-kenikmatan itu yang terus ada tiada henti, yang penghuninya selalu muda tidak akan menua, dan akan selalu sehat tidak akan sakit. Kita lihat orang-orang zaman sekarang, mereka pergi ke berbagai penjuru dunia, timur dan barat agar memperoleh (uang) sebutir dirham atau dinar, terkadadang mereka bisa menikmatinya atau bisa jadi mereka tidak bisa menikmatinya. Maka bagaimana menurut kita, andai kita mendapat kesempatan seperti ini dalam memdapatkan surga, dan mendapat kesempatan untuk lari dari neraka. Kita memohon kepada Allah agar melindungi kami dan kamu semua dari neraka,dan menjadikan kita semua sebagai ahli surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Naba ayat 24: Ada yang menafsirkan “Kesejukan” di sini dengan tidur. Ada pula yang menafsirkan, bahwa mereka tidak mendapatkan sesuatu untuk menyejukkan kulit mereka. Untuk menghilangkan rasa haus mereka dan menyejukkan bagian dalam badan mereka. Dengan demikian, mereka merasakan panas luar dan dalam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 24",
    "description": "Mereka mendiami neraka jahanam dengan penuh penderitaan. Mereka tidak pernah merasakan kesejukan di dalamnya untuk sekadar menikmati udara segar atau keteduhan, dan tidak pula mendapat minuman untuk melepas dahaga yang sangat berat. 25. Mereka tidak diberi minuman apa pun selain air yang mendidih yang menghancurkan usus mereka dan nanah yang keluar dari kulit-kulit mereka yang berbau busuk dan menjijikkan."
  }
]