[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-26. Pada hari itu,neraka jahanam mengintai orang orang kafir Yang mana neraka jahanam itu memang disiapkan bagi mereka. Ia adalah tempat kembali bagi orang orang kafir sebagai tempat kembali mereka,mereka tinggal disana selama-lamanya,tidak berpenghabisan, Mereka tidak diberi makan dengan sesuatu yang mendinginkan panasnya,tidak diberi minum yang menghilangkan dahaga mereka, Kecuali air panas dan nanah penghuni neraka, Mereka di balas demikian sebagai balasan yang adil sesuai dengan amal-amal mereka yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Mereka tidak merasakan kecuali minuman yang sangat panas dan nanah yang keluar dari penghuni Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِلَّا حَمِيمًا (selain air yang mendidih) Yakni air yang sangat panas. وَغَسَّاقًا(dan nanah) Yakni nanah para penghuni neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25–26. Mereka hanya akan mendapatkan air yang sangat panas dan mendidih. Mereka meminta air dari kulit orang-orang yang sedang diazab. Mereka semua mendapat balasan atas kekufuran dan segala perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali air yang mendidih} air yang sangat panas {dan nanah} nanah penghuni neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-25 Allah menyebutkan apa apa yang akan terjadi di hari kiamat yang dipertanyakan oleh mereka yang mendustakan dan ditentang oleh para pembangkang. Hari kiamat adalah hari besar dan Allah menjadikannya sebagai “ hari keputusan” untuk manusia, “ yaitu hari ( yang pada waktu itu ) ditiup sangkakala lalu kamu datang berkelompok kelompok.” Pada hari itu kalian berlarian, karena mat menakutkan dan menggelisahkan, yang membuat anak beruban dan membuat hati risau. Gunung gunung berjalan hingga seperti debu yang dihamburkan, langit terbelah hingga menjadi berpintu pintu, dan Allah memutuskan perkara antara sesama manusia dengan hukumnya yang tidak lalim. Neraka jahannam dinyalakan yang telah disediakan Allah dan diintaikan untuk mereka yang melampaui batas, dan dijadikannya sebagai tempat kembali bagi mereka. Mereka tinggal di dalamnya dalam jangka waktu yang amat lama. Kata alhiqabu sebagaimana dinyatakan oleh banyak ulama tafsir adalah jangka waktu selama delapan puluh tahun ( jamaknya adalah ahqaabun ). Ketika mereka melintasinya, “ mereka tidak merasakan kesejukan di dalamnya dan tidak ( pula mendaptat) minuman,” yakni tidak ada air yang menyejukan kulit mereka dan yang bisa menghapus dahaga mereka, “ kecuali air yang mendidih,” yakni, air panas yang mematangkan wajah mereka dan memutuskan usus mereka, “ dan nanah” yakni nanah penduduk neraka yang begitu menyengat baunya dan tidak enak rasanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Melainkan air mendidih yang menjadi pengganti air dingin yang segar, dan nanah akan menjadi minuman selama mereka di neraka, yaitu nanah yang mengalir dari luka badan mereka yang disebabkan oleh pedihnya siksaan yang mereka rasakan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِلَّا حَمِيمًا وَغَسَّاقًا “selain air yang mendidih dan nanah,” Menurut para pakar ilmu nahwu, istitsnaa (pengecualian tentang yang akan dirasakan penduduk neraka) di sini munqathi’ (terputus), karena al-Mustatsnaa (yang dikecualikan yaitu air mendidih dan nanah) tidak sejenis dengan al-Mustatsna minhu ( yaitu yang disebutkan pada ayat sebelumnya ) Maknanya: mereka tidak akan memperoleh kecuali al-Hamim yaitu air yang paling mendidih: يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ “mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. ” (QS. alKahfi: 29), وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ “dan diberi minuman dengan air yang mendidih sehingga memotong-motong ususnya”(QS. Muhammad: 15) وَغَسَّاقًا : Nanah adalah minuman yang berbau busuk dan amat dingin maka terkumpul untuk mereka–semoga Allah melindungi kita- antara yang amat sangat panas dan air yang amat sangat dingin, agar mereka merasakan siksa dari dua sisi: yaitu suhu panas dan suhu dingin. Bahkan sebagian ahli tafsir menuturkan: Maksud nanah disini adalah nanah penduduk nereka dan cairan berbau busuk yang keluar dari mulut mereka, keringat dan cairan menjijikan lainnya. Bagaimana pun juga ayat ini menunjukkan bahwa mereka tidak akan merasakan selain minuman yang memutus usus-usus mereka karena saking panasnya dan membekukan hati-hati mereka karena saking dinginnya. Semoga Allah menyelamatkan kita. Apabila semua macam siksa di atas terkumpul, maka itu menjadi siksaan yang berlipat-lipat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 25: 21-25. Kemudian setelah Allah menjelaskan ke Maha Kuasaan-Nya atas makhluk-Nya, Allah menjelaskan balasan bagi orang-orang kafir, dimana (Ia) mengabarkan bahwa jahannam adalah tempat bagi mereka untuk di adzab di akhirat. Allah jerat mereka dengan adzab, Allah janjikan bagi mereka suatu tempat yang menanti (mereka) dengan segala sesuatunya yang di dalamnya terdapat kejelekan dengan sebab amalan buruk mereka. Allah kabarkan kondisi jahannam bagi mereka yang nekat untuk menerobos ketentuan-ketentuan Allah (selama di dunia). Bagi mereka (orang-orang kafir) tempatnya adalah di neraka sepanjang masa tiada akhir. Dikecualikan darinya orang-orang mukmin yang bermaksiat sehingga masuk ke dalam neraka untuk disucikan atas dosa-dosanya, kemudian ia (kaum mukminin) dikeluarkan untuk menuju ke dalam surga. Mereka orang-orang kafir tidak akan pernah merasakan apa yang mereka kaum mukminin beristirahat didalamnya (surga), begitu pula kaum mukminin tidak akan merasakan kehausan (sebagaimana orang-orang kafir); Bahkan minuman-minuman mereka (orang-orang kafir) pada hari itu adalah air yang mendidih dan nanah para penghuni neraka. Kemudian Allah menjelaskan balasan bagi mereka (orang-orang kafir) atas apa yang mereka amalkan dari amalan-amalan penghuni neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang memutuskan usus-usus mereka. Yaitu nanah penghuni neraka; yang sangat bau dan sangat tidak enak rasanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 25",
    "description": "Mereka tidak diberi minuman apa pun selain air yang mendidih yang menghancurkan usus mereka dan nanah yang keluar dari kulit-kulit mereka yang berbau busuk dan menjijikkan. 26. Semua itu kami sediakan sebagai pembalasan yang setimpal atas perbuatan buruk mereka. Ancaman Allah melalui para rasul-Nya terhadap mereka ketika di dunia benar-benar akan terbukti."
  }
]