[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-26. Pada hari itu,neraka jahanam mengintai orang orang kafir Yang mana neraka jahanam itu memang disiapkan bagi mereka. Ia adalah tempat kembali bagi orang orang kafir sebagai tempat kembali mereka,mereka tinggal disana selama-lamanya,tidak berpenghabisan, Mereka tidak diberi makan dengan sesuatu yang mendinginkan panasnya,tidak diberi minum yang menghilangkan dahaga mereka, Kecuali air panas dan nanah penghuni neraka, Mereka di balas demikian sebagai balasan yang adil sesuai dengan amal-amal mereka yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Itu sebagai balasan yang setimpal atas kekufuran dan kesesatan yang pernah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. جَزَآءً وِفَاقًا (sebagai pambalasan yang setimpal) Yakni balasan yang sesuai dengan dosa mereka, sebab tidak ada dosa yang lebih besar dari kemusyrikan, serta tidak ada azab yang lebih besar dari azab neraka. Dan amalan mereka sangat buruk sehingga Allah memberi mereka siksaan yang buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25–26. Mereka hanya akan mendapatkan air yang sangat panas dan mendidih. Mereka meminta air dari kulit orang-orang yang sedang diazab. Mereka semua mendapat balasan atas kekufuran dan segala perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebagai pembalasan yang setimpal} yang setimpal dengan amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 26-30 Dan sesungguhnya mereka berhak menerima siksaan-siksaan yang berat ini sebagai balasan bagi mereka atas apa yang telah mereka perbuat berupa amalan-amalan yang mengantarkan mereka kepada siksaan tersebut. Allah tidak menzhalimi mereka tapi mereka sendirilah yang menzhalimi diri sendiri. Karena itu Allah menyebutkan amal perbuatan mereka yang membuat mereka berhak mendapatkan siksaan diatas seraya berfirman, “Sesungguhnya mereka tidak takut kepada hisab,” yakni, tidak beriman pada Hari Kebangkitan dan tidak beriman bahwa Allah akan membalas manusia, baik dan buruknya. Karena itulah mereka melalaikan amal-amal untuk akhirat. “dan mereka mendustakan ayat-ayat Kami dengan sebenar-benarnya,” yakni mereka mendustakannya secara tegas dan jelas. Penjelasan-penjelasan datang kepada mereka tapi mereka menentangnya. “Dan segala sesuattu,” sedikit dan banyak, baik dan buruk, “ sudah Kami catat dalam suatu kitab,” yakni sudah Kami tetapkan di Lauhil Mahfuzh. Karena itu, janganlah orang-orang yang berdosa mengira Kami menyiksa mereka karena dosa yang tidak mereka lakukan. Dan janganlah mereka mengira bahwa Allah akan menyia-nyiakan amal perbuatan mereka atau melalaikannya meskipun sebesar biji atom, sebagaimana disebutkan dalam Firman Allah, “ Dan diletakkanlah kitab, laul kamu akan melihat orang-orang yang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya dan mereka berkata, ‘Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya;’ dan mereka dapati apa yang telah mereka kerjakan (tertulis). Dan Rabmu tidak menganiaya seorangpun.”(Al-Kahfi:49). “Karena itu rasakanlah,” wahai orang-orang yang mendustakan azab yang pedih dan kehinaan abadi ini, “dan Kami sekali-kali tidak akan menambah kepada kamu kecuali azab.” Azab mereka semakin bertambah dari waktu ke waktu. Ini adalah ayat paling keras tentang dahsyatnya siksaan penghuni neraka. Semoga Allah melindungi kita semua darinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Apa yang mereka dapati didalam neraka dari azab dan sisksaan adalah merupakan balasan terhadap kekufuran dan kesesatan yang mereka lakukan ketika mereka didunia, dan sesungguhnya Allah tidak menzholimi mereka, melainkan adalah balasan terhadap kelakuan mereka. Dan balasan yang mereka dapat adalah setimpal dengan apa yang mereka lakukan ketika didunia, maka barangsiapa yang melakukan kebaikan maka kebaikan pula yang akan mereka dapatkan dari balasan itu, dan barangsiapa yang melakukan keburukan maka keburukan juga lah yang sesuai untuknya, Allah ta'ala mengatakan dalam hadits qudsi : ((يَا عِبَادِي إِنّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ. ثُمّ أُوَفّيكُمْ إِيّاهَا. فَمَنْ وَجَدَ خَيْراً فَلْيَحْمَدِ اللّهَ. وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلاَ يَلُومَنّ إِلاّ نَفْسَهُ)) : Wahai para hamba-Ku, sesungguhnya ia hanyalah perbuatan-perbuatan kalian yang aku perhitungkan bagi kalian kemudian Aku cukupkan buat kalian; barangsiapa yang mendapatkan kebaikan, maka hendaklah ia memuji Allah dan barangsiapa yang mendapatkan selain itu, maka janganlah ia mencela selain dirinya sendiri.” (HR.Muslim) ; maka sesungguhnya kalian sendirilah yang melakukannya untuk diri kalian sendiri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "جَزَاءً وِفَاقًا “sebagai pembalasan yang sesuai” Maknanya: Mereka dibalas dengan balasan itu sesuai dengan amal perbuatan mereka tanpa terzalimi, Allah tabaaraka wa Ta’ala berfirman: إِنَّ اللَّهَ لَا يَظْلِمُ النَّاسَ شَيْئًا وَلَكِنَّ النَّاسَ أَنْفُسَهُمْ يَظْلِمُونَ “Sesungguhnya Allah tidak berbuat zalim kepada manusia sedikit pun, akan tetapi manusia itulah yang berbuat zalim kepada diri mereka sendiri.”(QS. Yunus: 44) Balasan tersebut sesuai dan cocok dengan perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Naba ayat 26: Mereka mendapatkan hukuman yang buruk itu adalah sebagai balasan yang sesuai dengan amal yang mereka lakukan. Allah tidaklah menzalimi mereka, tetapi merekalah yang menzalimi diri mereka sendiri. Pada ayat selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan beberapa amalan mereka sehingga mereka pantas mendapatkan azab itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 26",
    "description": "Semua itu kami sediakan sebagai pembalasan yang setimpal atas perbuatan buruk mereka. Ancaman Allah melalui para rasul-Nya terhadap mereka ketika di dunia benar-benar akan terbukti. 27. Mereka pantas menerima siksa jahanam karena sesungguhnya dahulu mereka tidak pernah mengharapkan perhitungan amal di akhirat, bahkan mereka mendustakan dan menertawakan hari perhitungan itu. Jika mereka meyakini hari perhitungan, pasti mereka akan berbuat kebajikan."
  }
]