[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-30. Sesungguhnya mereka tidak takut pada hari perhitungan amal sehingga mereka tidak beramal untuknya, Mereka mendustakan apa yang dibawa oleh para rasul kepada mereka. Kami mengetahui segala sesuatu dan mencatatnya di lauhil mahfuzh. Maka rasakanlah (wahai orang orang kafir) balasan dari amal-amal kalian, kami tidak menambah untuk kalian kecuali azab di atas azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sesungguhnya mereka saat di dunia tidak takut dengan Hari Perhitungan karena mereka tidak mengimani adanya Hari Kebangkitan. Seandainya mereka takut kepada Hari Kebangkitan niscaya mereka beriman kepada Allah dan mengerjakan amal saleh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-30. Dahulu mereka tidak menyangka akan mendapat perhitungan amal, mengingkari ayat-ayat Kami qur’aniyah dan kauniyah, dan Kami mengetahui dan mencatat segala yang mereka perbuat. Maka rasakanlah -hai orang-orang zalim- azab neraka, Kami tidak akan menambah bagi kalian kecuali azab yang lebih berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِنَّهُمْ كَانُوا۟ لَا يَرْجُونَ حِسَابًا (Sesungguhnya mereka tidak berharap (takut) kepada hisab) Yakni mereka tidak mengharap pahala dan tidak takut terhadap hisab, sebab mereka tidak beriman kepada hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Mereka orang-orang kafir adalah penghuni neraka Jahannam, yang sebelumnya mereka tidak pernah menganggap balasan siksa atas perbuatan mereka itu nyata, dan mereka tidak takut terhadap hari perhitungan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka tidak pernah mengharapkan} tidak takut {perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 26-30 Dan sesungguhnya mereka berhak menerima siksaan-siksaan yang berat ini sebagai balasan bagi mereka atas apa yang telah mereka perbuat berupa amalan-amalan yang mengantarkan mereka kepada siksaan tersebut. Allah tidak menzhalimi mereka tapi mereka sendirilah yang menzhalimi diri sendiri. Karena itu Allah menyebutkan amal perbuatan mereka yang membuat mereka berhak mendapatkan siksaan diatas seraya berfirman, “Sesungguhnya mereka tidak takut kepada hisab,” yakni, tidak beriman pada Hari Kebangkitan dan tidak beriman bahwa Allah akan membalas manusia, baik dan buruknya. Karena itulah mereka melalaikan amal-amal untuk akhirat. “dan mereka mendustakan ayat-ayat Kami dengan sebenar-benarnya,” yakni mereka mendustakannya secara tegas dan jelas. Penjelasan-penjelasan datang kepada mereka tapi mereka menentangnya. “Dan segala sesuattu,” sedikit dan banyak, baik dan buruk, “ sudah Kami catat dalam suatu kitab,” yakni sudah Kami tetapkan di Lauhil Mahfuzh. Karena itu, janganlah orang-orang yang berdosa mengira Kami menyiksa mereka karena dosa yang tidak mereka lakukan. Dan janganlah mereka mengira bahwa Allah akan menyia-nyiakan amal perbuatan mereka atau melalaikannya meskipun sebesar biji atom, sebagaimana disebutkan dalam Firman Allah, “ Dan diletakkanlah kitab, laul kamu akan melihat orang-orang yang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya dan mereka berkata, ‘Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya;’ dan mereka dapati apa yang telah mereka kerjakan (tertulis). Dan Rabmu tidak menganiaya seorangpun.”(Al-Kahfi:49). “Karena itu rasakanlah,” wahai orang-orang yang mendustakan azab yang pedih dan kehinaan abadi ini, “dan Kami sekali-kali tidak akan menambah kepada kamu kecuali azab.” Azab mereka semakin bertambah dari waktu ke waktu. Ini adalah ayat paling keras tentang dahsyatnya siksaan penghuni neraka. Semoga Allah melindungi kita semua darinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Begitulah keadaan yang akan mereka hadapi di neraka jahannam, lalu apakah yang menyebabkan itu semua ? Yang menjadi penyebab akan adanya balasan yang akan mereka hadapi adalah : ( إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا ), dan inilah penyebab pertama, bahwasanya mereka ketika didunia tidak meyakini adanya hari kabangkitan dan pembalasan, mereka tidak mengimani akan tibanya masa yang dimana seluruh manusia akan bertemu Tuhan yang menciptakannya, akan tetapi mereka mendustakan itu semua."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": " Kemudian Allah menjelaskan sisi kesesuaian siksaan itu dengan perbuatan mereka, Allah berfirman: (28) إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا (27) وَكَذَّبُوا بِآيَاتِنَا كِذَّابًا “Sesungguhnya mereka tidak berharap adanya hisab, dan mereka mendustakan ayat-ayat Kami dengan sesungguh-sungguhnya” Allah menyebutkan penyimpangan mereka baik dalam akidah mau pun ucapan: إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا “Sesungguhnya mereka tidak berharap adanya hisab” Maknanya: Mereka tidak peduli bahwa mereka akan dihisab, bahkan mereka mengingkari hisab, mereka mengingkari hari kebangkitan, mereka mengatakan: مَا هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ “Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup dan tidak ada yang membinasakan kita selain masa”(QS. Al-Jatsiyah: 24) mereka tidak mengharapkan hisab sehingga mereka dihisab karena mereka mengingkarinya, inilah keyakinan akidah dalam hati-hati mereka, mulut-mulut mereka pun mendustakannya. Mereka mengatakan hisab adalah dusta, sihir, gila dan celaan lainnya, sebagaimana disebutkan dalam al-Quran contoh hinaan-hinaan mereka kepada para utusan Allah, sebagaimana Allah ’Azza Wa Jalla berfirman: كَذَلِكَ مَا أَتَى الَّذِينَ مِنْ قَبْلِهِمْ مِنْ رَسُولٍ إِلَّا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ  “Demikianlah tidak seorang rasul pun yang datang kepada orang-orang yang sebelum mereka, melainkan mereka mengatakan: \"Ia adalah seorang tukang sihir atau orang gila”(QS. Adz-Dzariyat: 52) Allah menceritakan tentang orang-orang yang mendustakan Muhammad shallallaahu ‘alaihi wa sallam: وَقَالَ الْكَافِرُونَ هَذَا سَاحِرٌ كَذَّابٌ “Ini adalah seorang ahli sihir yang banyak berdusta”(QS. Shad: 4) mereka mengatakan bahwa Muhammad pujangga (penyair) : أَمْ يَقُولُونَ شَاعِرٌ نَتَرَبَّصُ بِهِ رَيْبَ الْمَنُونِ “Bahkan mereka mengatakan: \"Dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan menimpanya\" ”(QS. Ath-Thur: 30) , وَقَالُوا يَا أَيُّهَا الَّذِي نُزِّلَ عَلَيْهِ الذِّكْرُ إِنَّكَ لَمَجْنُونٌ (6) لَوْ مَا تَأْتِينَا بِالْمَلَائِكَةِ إِنْ كُنْتَ مِنَ الصَّادِقِينَ (7) ” Mereka berkata: \"Hai orang yang diturunkan Al Qur'an kepadanya, sesungguhnya kamu benar-benar orang yang gila. Mengapa kamu tidak mendatangkan malaikat kepada kami, jika kamu termasuk orang-orang yang benar?\" ”(QS.Al-hijr: 6-7) Andai saja Allah telah meneguhkan kaki-kaki para Rasul dan memberkan mereka kesabaran atas perbuatan kaumnya, pasti rasul-rasul itu tidak kuasa bersabar atas itu semua, bukan hanya mencela saja bahkan mereka mengganggu dan menyakiti rasul-rasul, sebagaimana yang menimpa Rasulullah shallallaahu ‘alaihi wa sallam berupa gangguan yang keras. Bahkan mereka berani mengangkat senjata. Siapa saja yang melakukan hal ini maka balasannya adalah neraka jahannam, sesuai dengan perbuatannya, sebagaimana dalam ayat yang mulia: (28) جَزَاءً وِفَاقًا (26) إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا (27) وَكَذَّبُوا بِآيَاتِنَا كِذَّابًا “sebagai pembalasan yang setimpal. Sesungguhnya mereka tidak takut kepada hisab, dan mereka mendustakan ayat-ayat Kami dengan sesungguh-sungguhnya,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 27: 27-28. Kemudian Allah menjelaskan bahwa balasan ini adalah balasan yang pedih dan adzab karena sebab mereka tidak takut pada hari perhitungan amal baik dan buruk serta mereka acuh, mereka mendustakan hari kebangkitan, mereka mendustakan atas segala bukti-bukti yang menunjukkan atas ke Maha Esa’an Allah, kenabian, hari pembalasan dan apa-apa yang ada di dalam Al Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka mengingkari kebangkitan dan pembalasan terhadap amal, sehingga mereka tidak beramal untuk akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 27",
    "description": "Mereka pantas menerima siksa jahanam karena sesungguhnya dahulu mereka tidak pernah mengharapkan perhitungan amal di akhirat, bahkan mereka mendustakan dan menertawakan hari perhitungan itu. Jika mereka meyakini hari perhitungan, pasti mereka akan berbuat kebajikan. 28. Dan di samping itu, mereka benar-benar mendustakan ayat-ayat kami tentang tauhid, kenabian, dan hari kebangkitan. Mereka mengatakan bahwa Al-Qur'an adalah cerita usang yang penuh kebohongan."
  }
]