[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-30. Sesungguhnya mereka tidak takut pada hari perhitungan amal sehingga mereka tidak beramal untuknya, Mereka mendustakan apa yang dibawa oleh para rasul kepada mereka. Kami mengetahui segala sesuatu dan mencatatnya di lauhil mahfuzh. Maka rasakanlah (wahai orang orang kafir) balasan dari amal-amal kalian, kami tidak menambah untuk kalian kecuali azab di atas azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dan mereka betul-betul mendustakan ayat-ayat Kami yang diturunkan kepada Rasul Kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Mereka benar-benar mendustakan ayat-ayat Allah dengan penuh kedustaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka benar-benar mendustakan ayat-ayat Kami} dengan sungguh-sungguh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 26-30 Dan sesungguhnya mereka berhak menerima siksaan-siksaan yang berat ini sebagai balasan bagi mereka atas apa yang telah mereka perbuat berupa amalan-amalan yang mengantarkan mereka kepada siksaan tersebut. Allah tidak menzhalimi mereka tapi mereka sendirilah yang menzhalimi diri sendiri. Karena itu Allah menyebutkan amal perbuatan mereka yang membuat mereka berhak mendapatkan siksaan diatas seraya berfirman, “Sesungguhnya mereka tidak takut kepada hisab,” yakni, tidak beriman pada Hari Kebangkitan dan tidak beriman bahwa Allah akan membalas manusia, baik dan buruknya. Karena itulah mereka melalaikan amal-amal untuk akhirat. “dan mereka mendustakan ayat-ayat Kami dengan sebenar-benarnya,” yakni mereka mendustakannya secara tegas dan jelas. Penjelasan-penjelasan datang kepada mereka tapi mereka menentangnya. “Dan segala sesuattu,” sedikit dan banyak, baik dan buruk, “ sudah Kami catat dalam suatu kitab,” yakni sudah Kami tetapkan di Lauhil Mahfuzh. Karena itu, janganlah orang-orang yang berdosa mengira Kami menyiksa mereka karena dosa yang tidak mereka lakukan. Dan janganlah mereka mengira bahwa Allah akan menyia-nyiakan amal perbuatan mereka atau melalaikannya meskipun sebesar biji atom, sebagaimana disebutkan dalam Firman Allah, “ Dan diletakkanlah kitab, laul kamu akan melihat orang-orang yang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya dan mereka berkata, ‘Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya;’ dan mereka dapati apa yang telah mereka kerjakan (tertulis). Dan Rabmu tidak menganiaya seorangpun.”(Al-Kahfi:49). “Karena itu rasakanlah,” wahai orang-orang yang mendustakan azab yang pedih dan kehinaan abadi ini, “dan Kami sekali-kali tidak akan menambah kepada kamu kecuali azab.” Azab mereka semakin bertambah dari waktu ke waktu. Ini adalah ayat paling keras tentang dahsyatnya siksaan penghuni neraka. Semoga Allah melindungi kita semua darinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian yang kedua adalah : Dikarenakan mereka mendustakan ayat-ayat Allah yang memberitakan tentang kebangkaitan, mereka mendustakannya bahkan menghinanya, sama sekali mereka tidak mengambil manfaat darinya, mereka mendustakan segalanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat tafsir surat An-Naba ayat 27"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 28: 27-28. Kemudian Allah menjelaskan bahwa balasan ini adalah balasan yang pedih dan adzab karena sebab mereka tidak takut pada hari perhitungan amal baik dan buruk serta mereka acuh, mereka mendustakan hari kebangkitan, mereka mendustakan atas segala bukti-bukti yang menunjukkan atas ke Maha Esa’an Allah, kenabian, hari pembalasan dan apa-apa yang ada di dalam Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 28",
    "description": "Dan di samping itu, mereka benar-benar mendustakan ayat-ayat kami tentang tauhid, kenabian, dan hari kebangkitan. Mereka mengatakan bahwa Al-Qur'an adalah cerita usang yang penuh kebohongan. 29. Allah tidak pernah salah dalam menentukan siapa yang berhak mendapat siksa karena dia mempunyai catatan amal setiap orang. Dan segala sesuatu tentang amal perbuatan manusia telah kami catat dalam suatu kitab, yaitu buku catatan amal manusia, baik amal kecil maupun besar. Catatan itu akan menjadi saksi atas pelanggaran-pelanggaran mereka."
  }
]