[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-30. Sesungguhnya mereka tidak takut pada hari perhitungan amal sehingga mereka tidak beramal untuknya, Mereka mendustakan apa yang dibawa oleh para rasul kepada mereka. Kami mengetahui segala sesuatu dan mencatatnya di lauhil mahfuzh. Maka rasakanlah (wahai orang orang kafir) balasan dari amal-amal kalian, kami tidak menambah untuk kalian kecuali azab di atas azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan segala sesuatu dari amal perbuatan mereka telah Kami catat dan Kami hitung, dan hal itu tertulis di dalam kitab catatan amal perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَكُلَّ شَىْءٍ أَحْصَيْنٰهُ كِتٰبًا (Dan segala sesuatu telah Kami catat dalam suatu kitab) Yakni Kami telah mencatatnya di Lauhul Mahfuzh. Pendapat lain mengatakan: yakni apa yang dicatat oleh para malaikat yang mengawasi manusia di kitab amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Segala amal perbuatan mereka telah Kami catat di dalam sebuah lembaran buku amal, yang disebut Al lauh Al mahfudz"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Segala sesuatu telah Kami catat dalam kitab} Kami pelihara dan jaga dengan ditulis dalam lembaran-lembaran amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 26-30 Dan sesungguhnya mereka berhak menerima siksaan-siksaan yang berat ini sebagai balasan bagi mereka atas apa yang telah mereka perbuat berupa amalan-amalan yang mengantarkan mereka kepada siksaan tersebut. Allah tidak menzhalimi mereka tapi mereka sendirilah yang menzhalimi diri sendiri. Karena itu Allah menyebutkan amal perbuatan mereka yang membuat mereka berhak mendapatkan siksaan diatas seraya berfirman, “Sesungguhnya mereka tidak takut kepada hisab,” yakni, tidak beriman pada Hari Kebangkitan dan tidak beriman bahwa Allah akan membalas manusia, baik dan buruknya. Karena itulah mereka melalaikan amal-amal untuk akhirat. “dan mereka mendustakan ayat-ayat Kami dengan sebenar-benarnya,” yakni mereka mendustakannya secara tegas dan jelas. Penjelasan-penjelasan datang kepada mereka tapi mereka menentangnya. “Dan segala sesuattu,” sedikit dan banyak, baik dan buruk, “ sudah Kami catat dalam suatu kitab,” yakni sudah Kami tetapkan di Lauhil Mahfuzh. Karena itu, janganlah orang-orang yang berdosa mengira Kami menyiksa mereka karena dosa yang tidak mereka lakukan. Dan janganlah mereka mengira bahwa Allah akan menyia-nyiakan amal perbuatan mereka atau melalaikannya meskipun sebesar biji atom, sebagaimana disebutkan dalam Firman Allah, “ Dan diletakkanlah kitab, laul kamu akan melihat orang-orang yang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya dan mereka berkata, ‘Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya;’ dan mereka dapati apa yang telah mereka kerjakan (tertulis). Dan Rabmu tidak menganiaya seorangpun.”(Al-Kahfi:49). “Karena itu rasakanlah,” wahai orang-orang yang mendustakan azab yang pedih dan kehinaan abadi ini, “dan Kami sekali-kali tidak akan menambah kepada kamu kecuali azab.” Azab mereka semakin bertambah dari waktu ke waktu. Ini adalah ayat paling keras tentang dahsyatnya siksaan penghuni neraka. Semoga Allah melindungi kita semua darinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan yang ketiga adalah : Bahwasanya setiap amal perbuatan mereka kami tuliskan dalam sebuah kitab yang mencatat segala amal perbuatan manusia, dan mereka yang telah mendustakan ayat-ayat Kami telah kami catat apa yang mereka telah perbuat. Maka catatan inilah yang menjadi penyebab siksaan mereka di neraka jahannam, jikalau sekiranya mereka akan mnegingkari perbuatan mereka; maka itu tidak mungkin; karena segala amal keburukan yang telah mereka perbuat tercatat dan tersimpan baik dalam genggaman kami. dan mereka akan mengakuinya jika tiba saatnya catatan itu dibacakan dihadapan mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta’ala: وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا “dan segala sesuatu telah Kami catat dalam suatu kitab.”وَكُلَّ شَيْءٍ “dan segala sesuatu” Mencakup segala yang dilakukan Allah ‘Azza Wa Jalla seperti menciptakan dan mengatur segalanya dan juga mencakup segala yang dilakukan hamba-hamba-Nya berupa perkataan dan perbuatan, termasuk segala yang besar mau pun yang kecil أَحْصَيْنَاهُ “telah Kami catat dalam suatu kitab.” Kami patenkan dengan pencatatan yang detail yang tidak terdapat kekeliruan كِتَابًا “dalam suatu kitab” maksudnya dengan buku catatan. Dinyatakan dalam hadits shahih: أَنَّ اللهَ تَعَالَى كَتَبَ مَقَادِيْرَ كُلَّ شَيْءٍ إَلَى أَنْ تَقُوْمَ السَّاعَةُ “ Sesungguhnya Allah telah menuliskan takdir-taqdir segala sesuatu sampai hari kiamat ”(1) dan termasuk dari itu adalah perbuatan-perbuatan anak-anak adam, semuanya tertulis, bahkan setiap ucapan sudah tertulis. Allah Ta’ala berfirman: مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ “Tiada suatu ucapan pun yang diucapkannya melainkan ada di dekatnya malaikat raqib atiid” (QS. Qaf: 18) Malaikat Raqib: Malaikat yang mengawasi, al-‘Atiid: Yang selalu hadir. Ada seorang lelaki yang masuk ke rumah Imam Ahmad rahimahullaah, sedangkan beliau dalam keadaan sakit, beliau merintih (kesakitan). Maka laki-laki itu berkata: Ya Abu Abdillah sesungguhnya Thawus –salah seorang tabi’in yang masyhur- mengatakan: \"Sesungguhnya rintihan seorang yang sakit ditulis” Maka Imam Ahmad rahimahullah berhenti dari rintihannya karena takut ditulis rintihan rasa sakitnya itu, maka bagaimana dengan ucapan-ucapan yang tidak terbatas dan tidak ditahan, lafaz-lafaz yang terus keluar sepanjang malam dan hari, dan itu semua tidak dihisab. Segala sesuatu ditulis walau pun sekedar tekad dalam hati, bisa jadi itu berbuah pahala atu mungkin dosa bagi anda, barang siapa yang bertekad berbuat keburukan namun ia meninggalkannya karena tidak mampu melakukannya maka tekadnya itu akan ditulis sebagai sebuah keburukan dan jika meninggalkannya karena Allah maka itu akan ditulis sebagai kebaikan.(2) Segala sesuatu tidak akan luput, segala sesuatu akan kami tulis dalam catatan. (1) Dikeluarkan Muslim (2653) dari hadits Abdullah Bin Amer Radhiyallaahu 'anhuma. (2) Dikeluarkan Bukhari (6491) dan Muslim (131) dari hadits Ibnu Abbas radhiyallaahu 'anhuma."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 29: 29-30. Kemudian Allah mengabarkan bahwa segala sesuatu yang di kerjakan oleh orang-orang kafir baik sedikitnya maupun banyaknya sungguh telah tercatat di lauhil mahfudz. Kemudian dikatakan kepadanya (yaitu kepada orang-orang kafir) dengan ucapan yang kasar dan teguran keras : Rasakanlah olehmu wahai orang-orang yang mendustakan dan menolak (apa yang Allah dan rasul-Nya tetapkan), sungguh tidak akan Kami tambah padamu kecuali adzab yang terus bertambah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sedikit maupun banyak, baik maupun buruk. Di antara yang tercatat dalam catatan amal itu adalah pendustaan mereka terhadap Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 29",
    "description": "Allah tidak pernah salah dalam menentukan siapa yang berhak mendapat siksa karena dia mempunyai catatan amal setiap orang. Dan segala sesuatu tentang amal perbuatan manusia telah kami catat dalam suatu kitab, yaitu buku catatan amal manusia, baik amal kecil maupun besar. Catatan itu akan menjadi saksi atas pelanggaran-pelanggaran mereka. 30. Setelah Allah menjelaskan tentang keburukan perbuatan mereka, Allah mengatakan kepada mereka, 'maka karena semua perbuatan buruk yang kamu kerjakan itu rasakanlah siksa api neraka ini! maka tidak ada yang akan kami tambahkan kepadamu selain azab. Mereka ditimpa azab demi azab yang sangat pedih, menyakitkan jiwa dan raga, tidak ada jeda sedikit pun antara satu azab dan azab berikutnya. Mereka merasakannya dalam rentang waktu yang sangat lama. Inilah siksaan bagi mereka yang durhaka kepada Allah dan rasul-Nya."
  }
]