[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-35. Sesungguhnya orang orang yang takut kepada tuhan mereka dan beramal shalih mendapatkan keberuntungan dengan masuk surga. Mereka mendapatkan kebun-kebun besar dan buah anggur. Mereka mendapatkan istri-istri yang berusia muda,buah dada mereka montok,usia mereka sebaya, Dan mereka punya gelas gelas yang penuh dengan khamar, Mereka tidak mendengar kata kata batil di dalam surge,sebagian tidak dusta kepada sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Sesungguhnya orang-orang yang bertakwa kepada Rabb mereka dengan menaati segala perintah-Nya dan menjauhi segala larangan-Nya, mendapatkan posisi kemenangan di mana mereka mendapatkan apa yang mereka cari, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31-37. Orang-orang yang takut kepada Allah dengan mentaati segala perintah-Nya dan menjauhi segala larangan-Nya akan mendapat kemenangan yang besar, dengan dimasukkan ke dalam surga yang dipenuhi pepohonan dan buah anggur; mereka akan mendapat pasangan berusia muda yang dadanya telah membesar. Dan mereka akan akan menerima gelas yang terisi khamr yang murni. Mereka tidak akan mendengar perkataan batil dan dosa. Seluruh balasan tersebut Allah tetapkan bagi orang-orang bertakwa dari karunia-Nya, sebagai balasan atas amal shalih mereka. Dia adalah Tuhan tujuh langit dan bumi serta yang ada di antara keduanya; Yang Maha Pengasih bagi hamba-hamba-Nya di dunia dan di akhirat, mereka tidak dapat meminta kepada-Nya kecuali hal yang telah mendapat izin dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. إِنَّ لِلْمُتَّقِينَ مَفَازًا (Sesungguhnya orang-orang yang bertakwa mendapat kemenangan) Makna (المفاز) yakni kemenangan dan keberhasilan dalam meraih tujuan, serta selamat dari siksa neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Sesungguhnya orang-orang yang bertaqwa dengan berpegang teguh kepada perintah Allah dan menjauhi larangan-Nya akan terhindar dan terselamatkan dari azab neraka, dan mendapatkan balasan kenikmatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya bagi orang-orang yang bertakwa itu kemenangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Setelah Allah menjelaskan kondisi orang-orang yanag berdosa, selanjutnya Allah menjelaskan tempat kembali orang-orang yang bertakwa seraya berfirman ,”Sesungguhnya orang-orang yang bertakwa mendapatkan kemenangan,” yakni orang-orang yang menjaga diri dari murka Rabb mereka dengan berpegang teguh pada ketaatan kepadaNya dan menjaga diri dari kemaksiatan. Mereka mendapatkan kemenangan, keselamatan, dan jauh dari neraka. Dalam kemenangan ini mereka mendapatkan, “kebun-kebun,” yaitu kebun-kebun yang mengumpulkanb berbagai jenis pohon rindang dengan buah yang di sela-sealnya terpancar sungai. Allah menyebutkan anggur secara khusus karena sangat diinginkan hati dan banyak di kebun itu. Mereka mendapatkan istri-istri sesuai keinginan diri mereka,”dan gadis-gadis remaja,” yaitu gadis-gadis remaja yang buah dada mereka belum menurun lantaran meraka masih remaja , kuat, dan elok, “yang sebaya,” yakni usia mereka hampir sama. Di antara kebiasaan gadis remaja sebaya adalah saling bergaul dan berteman. Itulah kala mereka berusia tiga puluh tiga tahun yang merupakan usia wanita paling sempurna, “dan gelas-gelas yang penuh (berisi minuman),” yakni, penuh berisi minuman yang lezat untuk para peminumnya,”didalamnya mereka tidak mendengar perkataan yang sia-sia,” yakni perkataan yang tidak berguna ,”dan tidak (pula perkataan ) dusta,” yaitu dosa sebagaimana disebutkan dalam firman Allah, “Mereka tidak mendengar didalamnya perkataan yang sia-sia dan tidak pula perkataan yang menimbulakn dosa, akan tetapi mereka mendengar ucapan salam .”(Al-Waqi’ah:25-26). Allah memberi pahala besar bagi mereka ini adalah murni karena karunia dan kebaikanNya,”sebagai balasan dari Rabbmu dan pemberian yang cukup banyak,” karena amal perbuatan yang dituntunkan Allah pada merekan dan dijadikannya sebagai sebab menggapai kemulaiaanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah Allah menyebutkan keadaan orang-orang kafir diakhirat nanti, kemudian pada ayat-ayat selanjutnya Allah menjelaskan bagaimana keadaan orang-orang mukmin setelah mereka bangkit dari kematian , bagaimana tempat kembali mereka yang telah beriman kepada Allah, mereka yang telah beriman kepada hari akhir, dan mereka telah mempersiapkan semua itu dengan mendirikan amal-amal kebaikan, menjalankan segala perintah Allah dan menjauhi segala larangannya, mereka meyakini dengan keimanan bahwa akan ada azab dari Allah bagi mereka yang tidak beriman dan bertaqwa kepada-Nya. Allah mengatakan : ( إِنَّ لِلْمُتَّقِينَ مَفَازًا ) sesungguhnya akan ada kemenangan bagi orang-orang yang bertaqwa, yaitu perlindungan dari azab pedih, bagi mereka jalan keluar dari azab neraka jahannam, yaitu ketika mereka melewati Shirot, mereka selamat, merema mampu melewatinya, dan akhirnya mereka selamat dari azab dengan kemenangan ini. Dan bersama kemenangan ini Allah akan memberikan kepada mereka berbagai kemuliaan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah ‘Azza Wa Jalla menyebutkan balasan berupa kenikmatan-kenikmatan bagi orang yang bertakwa setelah Dia berfirman: إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا لِلطَّاغِينَ مَآبًا ” Sesungguhnya neraka Jahanam itu (padanya) ada tempat pengintai, lagi menjadi tempat kembali bagi orang-orang yang melampaui batas” Karena al-Quran adalah al-Matsani (pembanding) jika disebutkan di dalamnya hukuman maka akan disebutkan juga pahala, jika disebutkan pahala maka akan disebutkan juga hukuman, jika disebutkan orang-orang baik maka disebutkan juga orang-orang jahat, jika disebutkan kebenaran maka akan disebutkan juga kebatilan, pembanding sehingga perjalanan manusia kepada Rabbnya seimbang antara takut dan berharap, karena jika rasa berharap lebih mendominasi dirinya ia akan merasa aman dari makar Allah dan jika rasa takut yang lebih dominan maka ia akan terjatuh pada keputus asaan dari rahmat Allah, kedua sifat ini (merasa aman dari makar Allah dan putus asa dari rahmat-Nya) termasuk dosa-dosa besar, keduanya adalah keburukan. Imam Ahmad Bin Hanbal rahimahullah mengatakan: “ Selayaknya ibadah seorang insan kepada Rabb nya berputar antara takut dan berharap, jika salah satunya lebih dominan maka ia akan binasa ” Oleh karenanya, Al-Quran al-Karim datang dengan kedua kondisi itu, agar jiwa-jiwa ini tidak merasa bosan dengan hanya disebutkan satu kondisi saja, dan rinciannya tanpa menyebutkan perkara yang bertolak belakang dengannya, dan begitulah al-Quran. Agar setiap insan yang membaca Al-Quran dengan harapan dan kekhawatiran. Ini adalah di antara bentuk tingginya bahasa Al-Quran al-Karim. إِنَّ لِلْمُتَّقِينَ مَفَازًا “Sesungguhnya orang-orang yang bertakwa mendapat kemenangan,” Orang-orang yang bertakwa adalah mereka yang takut hukuman Allah, yang diwujudkan dengan melakukan perintah-perintah Allah dan menjauhi larangan-larangan-Nya, terkadang Allah memerintahkan agar takut kepada-Nya, terkadang memerintahkan agar takut kepada hari perhitungan, terkadang memerintahkan agar takut kepada neraka. Allah Ta’ala berfirman: وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ (130) وَاتَّقُوا النَّارَ “dan bertakwalah kamu kepada Allah supaya kamu mendapat keberuntungan. Dan peliharalah dirimu dari api neraka,”(QS. Ali Imran: 130-131) Allah mengumpulkan antara perintah agar takut kepada-Nya dan takut kepada api neraka. Allah Ta’ala juga berfirman: وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ “Dan peliharalah dirimu dari (azab yang terjadi pada) hari yang pada waktu itu kamu semua dikembalikan kepada Allah.”(QS. Al-Baqoroh: 281) Allah memerintahkan agar takut kepada hari perhitungan. Semua itu berporos pada satu makna yaitu: Seorang insan takut kepada perkara-perkara yang diharamkan Rabb-nya, seihingga ia melakukan ketaatan kepada-Nya dan berhenti dari kemaksiatan kepada-Nya. Orang yang bertakwa adalah mereka yang melaksanakan perintah-perintah Allah dan meninggalkan larangan-larangan Allah, mereka akan meperoleh مَفَازًا [Mafaaza]“Kemenangan” dan al-Mafaaz adalah tempat dan waktu menang, mereka menang di tempat-tempat mereka dan mereka menang di hari-hari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 31: 31-35. Kemudian Allah mulai menjelaskan balasan bagi hambanya yang bertakwa. Allah mengkabarkan bahwasanya orang-orang yang bertakwa yaitu mereka yang taat kepada Rabb nya di dunia akan menang dengan kemuliaan dan balasan yang besar di surga yang penuh nikmat. Dan bagi mereka kebun-kebun yang terkumpul di dalamnya, yang terdapat buah-buahan yang lezat, begitu juga baginya pohon-pohon anggur. Bagi mereka istri-istri yang jelita, yang memiliki buah dada yang montok, yang tidak kendor. Dan wanita-wanita tersebut umurnya sama merata, yaitu berumur remaja, begiu juga istri dari hamba yang bertakwa dimana Allah ciptakan mereka dalam sebaik-baik rupa dari bidadari. Dan mereka (ahli surga) memiliki gelas yang berisi khamr lezat untuk mereka minum. Dan mereka tidaklah mendengar suara di surga kecuali dari yang baik-baik saja, dan tidak mendengar ucapan-ucapan bathil. Tidak juga ucapan-ucapan yang mengandung dosa dan juga tidaklah mereka mendengar ucapan-ucapan yang tidak bermanfaat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang-orang yang berdosa, maka Dia menyebutkan keadaan orang-orang yang bertakwa, yaitu mereka yang menjaga diri mereka dari kemurkaan Tuhannya dengan menaati-Nya dan menahan diri dari apa yang dimurkai-Nya. Untuk mereka mafaaz, yaitu tempat kemenangan yang tidak lain adalah surga, dimana di dalamnya mereka memperoleh kebun-kebun, buah anggur, dan lain-lain seperti yang disebutkan dalam ayat selanjutnya. Yaitu mendapatkan surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 31",
    "description": "Usai menjelaskan nasib para pendurhaka, Allah beralih menguraikan nasib orang bertakwa. Sungguh, orang-orang yang bertakwa dan selalu berbuat baik serta menghindari perbuatan buruk akan mendapat kemenangan dan kebahagiaan di akhirat. 32. Kemenangan dan kebahagiaan yang akan mereka dapatkan di antaranya berupa kebun-kebun yang rindang, indah, damai, dan sejuk; dan buah anggur yang kelezatan rasanya sangat berbeda dari anggur dunia meski memiliki sebutan yang sama. Inilah bentuk kenikmatan lingkungan dan makanan di surga."
  }
]