[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-35. Sesungguhnya orang orang yang takut kepada tuhan mereka dan beramal shalih mendapatkan keberuntungan dengan masuk surga. Mereka mendapatkan kebun-kebun besar dan buah anggur. Mereka mendapatkan istri-istri yang berusia muda,buah dada mereka montok,usia mereka sebaya, Dan mereka punya gelas gelas yang penuh dengan khamar, Mereka tidak mendengar kata kata batil di dalam surge,sebagian tidak dusta kepada sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dan perawan-perawan yang berumur sebaya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَكَوَاعِبَ (dan gadis-gadis remaja) Yakni mereka mendapatkan gadis-gadis muda, yang buah dadanya masih kencang, mereka semua masih gadis. أَتْرَابًا(yang sebaya) Yakni usianya seumuran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Mereka juga akan ditemani gadis-gadis sebaya yang suci. Al kawa’ibu adalah jamak dari ka’ib yang bermakna gadis yang kencang payudaranya, tidak kendor"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Gadis-gadis} yang memiliki nafas panjang, yaitu perempuan {yang sebaya} yang sebaya umurnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Setelah Allah menjelaskan kondisi orang-orang yanag berdosa, selanjutnya Allah menjelaskan tempat kembali orang-orang yang bertakwa seraya berfirman ,”Sesungguhnya orang-orang yang bertakwa mendapatkan kemenangan,” yakni orang-orang yang menjaga diri dari murka Rabb mereka dengan berpegang teguh pada ketaatan kepadaNya dan menjaga diri dari kemaksiatan. Mereka mendapatkan kemenangan, keselamatan, dan jauh dari neraka. Dalam kemenangan ini mereka mendapatkan, “kebun-kebun,” yaitu kebun-kebun yang mengumpulkanb berbagai jenis pohon rindang dengan buah yang di sela-sealnya terpancar sungai. Allah menyebutkan anggur secara khusus karena sangat diinginkan hati dan banyak di kebun itu. Mereka mendapatkan istri-istri sesuai keinginan diri mereka,”dan gadis-gadis remaja,” yaitu gadis-gadis remaja yang buah dada mereka belum menurun lantaran meraka masih remaja , kuat, dan elok, “yang sebaya,” yakni usia mereka hampir sama. Di antara kebiasaan gadis remaja sebaya adalah saling bergaul dan berteman. Itulah kala mereka berusia tiga puluh tiga tahun yang merupakan usia wanita paling sempurna, “dan gelas-gelas yang penuh (berisi minuman),” yakni, penuh berisi minuman yang lezat untuk para peminumnya,”didalamnya mereka tidak mendengar perkataan yang sia-sia,” yakni perkataan yang tidak berguna ,”dan tidak (pula perkataan ) dusta,” yaitu dosa sebagaimana disebutkan dalam firman Allah, “Mereka tidak mendengar didalamnya perkataan yang sia-sia dan tidak pula perkataan yang menimbulakn dosa, akan tetapi mereka mendengar ucapan salam .”(Al-Waqi’ah:25-26). Allah memberi pahala besar bagi mereka ini adalah murni karena karunia dan kebaikanNya,”sebagai balasan dari Rabbmu dan pemberian yang cukup banyak,” karena amal perbuatan yang dituntunkan Allah pada merekan dan dijadikannya sebagai sebab menggapai kemulaiaanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan untuk mereka istri-istri yang cantik jelita, yaitu wanita-wanita penghuni surga, apakah itu dari bidadari surga ataupun wanita-wanita mu'minat yang Allah ciptakan mereka kembali dan menjadikannya sebagai bidadari surga yang paling cantik. ( أَتْرَابًا ) yaitu bidadari-bidadarai yang usia mereka sebaya satu sama lainnya, tidak ada dari mereka yang usianya lebih tua dari yang lain, dan juga tidak lebih tua dari suami-suami mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَكَوَاعِبَ أَتْرَابًا “dan gadis-gadis remaja yang montok payudaranya lagi sebaya” kata اَلْكَوَاعِب [al-Kawa’ib] adalah bentuk jamak dari كَاعِب maknanya adalah wanita yang montok payudaranya dan belum turun, menonjol jelas bagai matakaki, bentuk dada ini adalah bentuk paling sempurna dan indah: أَتْرَابًا [Atraaban]“Sebaya” usianya sebaya tidak ada perbedaan usia satu dengan lainnya tidak seperti di dunia, karena jika usianya berbeda-beda, bisa jadi jika ditimbang akan berbeda beda, bisa jadi salah satunya akan merasa sedih jika berbeda dengan yang lain, namun mereka semua satu usia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 33: 31-35. Kemudian Allah mulai menjelaskan balasan bagi hambanya yang bertakwa. Allah mengkabarkan bahwasanya orang-orang yang bertakwa yaitu mereka yang taat kepada Rabb nya di dunia akan menang dengan kemuliaan dan balasan yang besar di surga yang penuh nikmat. Dan bagi mereka kebun-kebun yang terkumpul di dalamnya, yang terdapat buah-buahan yang lezat, begitu juga baginya pohon-pohon anggur. Bagi mereka istri-istri yang jelita, yang memiliki buah dada yang montok, yang tidak kendor. Dan wanita-wanita tersebut umurnya sama merata, yaitu berumur remaja, begiu juga istri dari hamba yang bertakwa dimana Allah ciptakan mereka dalam sebaik-baik rupa dari bidadari. Dan mereka (ahli surga) memiliki gelas yang berisi khamr lezat untuk mereka minum. Dan mereka tidaklah mendengar suara di surga kecuali dari yang baik-baik saja, dan tidak mendengar ucapan-ucapan bathil. Tidak juga ucapan-ucapan yang mengandung dosa dan juga tidaklah mereka mendengar ucapan-ucapan yang tidak bermanfaat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Usianya ketika itu adalah usia yang paling pertengahan, yaitu 33 tahun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 33",
    "description": "Dan Allah sediakan pula bagi mereka sebagai kenikmatan seksual dan pemberi ketenteraman hati, bidadari surga yaitu gadis-gadis yang cantik jelita, berpayudara montok, yang umur mereka sebaya. 34. Dan bagi mereka Allah berikan kenikmatan lainnya, yaitu gelas-gelas yang penuh minuman. Minuman itu amat beragam, di antaranya susu, anggur, dan khamar yang tidak memabukkan."
  }
]