[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-39. Mereka mendapatkan semua itu sebagai balasan dan karunia dari Allah,serta sebagai pemberian yang besar dan mencukupi mereka, Tuhan langit dan bumi serta apa yang ada diantara keduanya, Tuhan yang maha pengasih di dunia dan akhirat,mereka tidak punya kewenangan untuk bertanya kepada NYA kecuali dalam apa yang DIA izinkan. Hari itu jibril dan para malaikat berdiri berbaris, mereka tidak memberi syafaat kecuali bagi siapa yang Allah yang maha pengasih izinkan untuknya dan dia hanya mengatakan yang benar dan lurus. Itu adalah haq yang tidak ada keraguan bahwa ia pasti terjadi. Maka barangsiapa ingin selamat dari ketakutan ketakutannya,hendaknya dia mengambil jalan untuk menuju kepada tuhannya dengan melakukan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Itu semua termasuk anugerah yang diberikan Allah kepada mereka sebagai pemberian dan karunia yang cukup dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. عَطَآءً حِسَابًا (pemberian yang cukup banyak) Yakni sesuai dengan apa yang berhak mereka dapatkan dari janji Allah, yang menjanjikan satu kebaikan dibalas dengan sepuluh kali lipat, dan menjanjikan kepada kaum yang lain balasan tujuh ratus kali lipat, dan kepada kaum lain balasan yang tidak terhingga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Allah telah memberi balasan pahala sesuai apa yang telah dijanjikan atas kesalehan mereka. Mereka diberi balasan yang sesuai bahkan lebih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebagai balasan dan pemberian dari Tuhanmu yang banyak} yang cukup"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Setelah Allah menjelaskan kondisi orang-orang yanag berdosa, selanjutnya Allah menjelaskan tempat kembali orang-orang yang bertakwa seraya berfirman ,”Sesungguhnya orang-orang yang bertakwa mendapatkan kemenangan,” yakni orang-orang yang menjaga diri dari murka Rabb mereka dengan berpegang teguh pada ketaatan kepadaNya dan menjaga diri dari kemaksiatan. Mereka mendapatkan kemenangan, keselamatan, dan jauh dari neraka. Dalam kemenangan ini mereka mendapatkan, “kebun-kebun,” yaitu kebun-kebun yang mengumpulkanb berbagai jenis pohon rindang dengan buah yang di sela-sealnya terpancar sungai. Allah menyebutkan anggur secara khusus karena sangat diinginkan hati dan banyak di kebun itu. Mereka mendapatkan istri-istri sesuai keinginan diri mereka,”dan gadis-gadis remaja,” yaitu gadis-gadis remaja yang buah dada mereka belum menurun lantaran meraka masih remaja , kuat, dan elok, “yang sebaya,” yakni usia mereka hampir sama. Di antara kebiasaan gadis remaja sebaya adalah saling bergaul dan berteman. Itulah kala mereka berusia tiga puluh tiga tahun yang merupakan usia wanita paling sempurna, “dan gelas-gelas yang penuh (berisi minuman),” yakni, penuh berisi minuman yang lezat untuk para peminumnya,”didalamnya mereka tidak mendengar perkataan yang sia-sia,” yakni perkataan yang tidak berguna ,”dan tidak (pula perkataan ) dusta,” yaitu dosa sebagaimana disebutkan dalam firman Allah, “Mereka tidak mendengar didalamnya perkataan yang sia-sia dan tidak pula perkataan yang menimbulakn dosa, akan tetapi mereka mendengar ucapan salam .”(Al-Waqi’ah:25-26). Allah memberi pahala besar bagi mereka ini adalah murni karena karunia dan kebaikanNya,”sebagai balasan dari Rabbmu dan pemberian yang cukup banyak,” karena amal perbuatan yang dituntunkan Allah pada merekan dan dijadikannya sebagai sebab menggapai kemulaiaanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Semua itu adalah merupakan balasan dari Tuhan alam semesta untuk mereka atas amalan kebaikan yang telah mereka lakukan didunia, maka hanya amal kebaikanlah yang menjadi penyebab datangnya kebaikan bagi diri kita, dan semua itu hanya diperuntukkan bagi orang-orang yang bertaqwa. Dalam ayat lain ALlah mengatakan : ( جزاءً وفَاقًا ) yaitu balasan yang setimpal, dan di ayat ini Allah mengatakan ( جَزَاءً مِنْ رَبِّكَ ) yakni : balasan yang tidak ada batasnya, pemberian dari Allah yang tak terbatas. ( جَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا ) adalah balasan atas amalan kebaikan orang-orang yang bertaqwa, dan Allah akan melipat gandakan balasan ini sebanyak-banyaknya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "جَزَاءً مِنْ رَبِّكَ عَطَاءً “Sebagai balasan dari Tuhanmu dan pemberian” Maknanya: Mereka diberi ganjaran itu semua adalah balasan dari Allah subhaanahu wa Ta’ala atas perbuatan-perbuatan baik yang mereka lakukan ketika di dunia, dan mereka menjauhi perkara-perkara yang diharamkan Allah. حِسَابًا “yang cukup banyak,” Maknanya: Yang mencukupi, diambil dari kata اَلْحَسْب[al-Hasbu] yang artinya cukup, maksudnya bahwa cangkir itu adalah cangkir yang cukup, mereka tidak membutuhkan yang lainnya karena telah sempurna kelezatan dan manfaatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Naba ayat 36: Disebabkan amal yang mereka kerjakan atas taufiq Allah kepada mereka untuk beramal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 36",
    "description": "Semua kenikmatan itu disediakan sebagai balasan dan pemberian yang cukup banyak dari tuhanmu yang telah menuntunmu menuju jalan ketakwaan. 37. Tuhan yang menganugerahkan semua itu adalah tuhan pemelihara langit dan bumi dan apa yang ada di antara keduanya. Dialah tuhan yang maha pengasih dan mahakaya. Dia mempunyai rahmat yang sangat banyak. Mereka tidak mampu berbicara dengan dia. Semua unduk dan patuh kepada-Nya, tidak ada yang mampu berbicara dengan-Nya kecuali atas seizin-Nya."
  }
]