[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-39. Mereka mendapatkan semua itu sebagai balasan dan karunia dari Allah,serta sebagai pemberian yang besar dan mencukupi mereka, Tuhan langit dan bumi serta apa yang ada diantara keduanya, Tuhan yang maha pengasih di dunia dan akhirat,mereka tidak punya kewenangan untuk bertanya kepada NYA kecuali dalam apa yang DIA izinkan. Hari itu jibril dan para malaikat berdiri berbaris, mereka tidak memberi syafaat kecuali bagi siapa yang Allah yang maha pengasih izinkan untuknya dan dia hanya mengatakan yang benar dan lurus. Itu adalah haq yang tidak ada keraguan bahwa ia pasti terjadi. Maka barangsiapa ingin selamat dari ketakutan ketakutannya,hendaknya dia mengambil jalan untuk menuju kepada tuhannya dengan melakukan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Rabb pemelihara langit dan bumi serta Rabb pemelihara yang ada di antara keduanya, Yang Maha Pengasih di dunia dan di Akhirat, seluruh yang ada di bumi maupun di langit tidak mampu memohon kepada-Nya kecuali jika Allah mengizinkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. عَطَآءً حِسَابًا (pemberian yang cukup banyak) Yakni sesuai dengan apa yang berhak mereka dapatkan dari janji Allah, yang menjanjikan satu kebaikan dibalas dengan sepuluh kali lipat, dan menjanjikan kepada kaum yang lain balasan tujuh ratus kali lipat, dan kepada kaum lain balasan yang tidak terhingga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Tuhan pemelihara langit bumi, dan apa yang ada di antara keduanya. Rahmat Allah meliputi segala sesuatu, tidak ada yang mampu memberi pertolongan kecuali atas izin Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhan langit, bumi, dan apa yang ada di antara keduanya, Yang Maha Pengasih. Mereka tidak memiliki berbicara denganNya} perkataan dan pertanyaan kecuali dengan izinNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Maksudnya, yang melimpahkan pemberian ini pada mereka adalah Rabb mereka, “Rabb yang memelihara langit dan bumi,” yang menciptakan dan mengaturnya,”yang maha pemurah,” yang rahmatNya meliputi segala sesuatu. Allah memelihara dan merahmati mereka serta bersikap lemah lembut pada mereka hingga mereka mendapatkan apa yang mereka dapatkan. Selanjutnya Allah menyebutkan keagunganNya dan kerajaanNya yang besar pada hari kiamat dan bahwa seluruh manusia terdiam pada hari itu dan tidak berbicara dan ”mereka tidak dapat berbicara dengan Dia, kecuali siapa yang diberi izin kepadanya oleh Rabb yang maha pemurah ; dan ia menguacapkan kata yang benar,” tidak ada seorangpun yang berbicara kecuali dengan dua syarat berikut; diizinkan Allah untuk berbicara dan perkataannya benar, sebab ”itulah hari yang pasti terjadi,” yang tidak terdapat kebatilan padanya dan kebohongan tidak lagi berguna. Pada hari itu, “ketika ruh dan para malaikat berdiri bershaf shaf,“ yaitu Jibril yang merupakan malaikat paling mulia serta seluruh malaikat berdiri bershaf shaf seraya tunduk pada Allah, mereka tidak berbicara kecuali atas izin Allah. Selanjutnya Allah berfirman seraya memberi kabar gembira dan ancaman, “maka barang siapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Rabbnya,” yakni amal baik yang akan kembali padanya pada Hari Kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dialah Allah tuhanmu, tuhan langit dan bumi, Dialah tuhan segala sesuatu, dan apa yang ada diatara langit dan bumi dari angkasa yang luas, serta bintang-bintang yang jumlahnya tidak terhitung oleh manusia adalah merupakan milik Allah yang maha Agung, Dialah yang memiliki segalanya, Dialah Raja sang pemilik langit berlapis-lapis dan bumi serta apa yang ada diantara keduanya. Lalu, apa lagi yang masih tersisa ?! Dia pemilik langit dan bumi, maka segala sesuatu adalah milik-Nya, semua kerajaan dibawah pengawasan dan kekuasaan-Nya. ( رَبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الرَّحْمَٰنِ ), dan maksud dari ( الرَّحْمَٰنِ ) pada ayat ini : Sifat Allah yang berarti maha pengasih, dan relevansinya adalah terhadap gajaran para penghuni surga, bahwasanya mereka mendapatkan surga itu dengan Rahmat Allah ta'ala, surga itu tidak digapai kecuali dengan Rahmat dan kasih sayang Allah, dan amal kebaikan hanyalah merupakan sebab agar masuknya seseorang ke dalam surga Allah. Kemudian Allah mengatakan ( لَا يَمْلِكُونَ مِنْهُ خِطَابًا ) tidak satupun dari penghuni surga bisa berbicara dengan Allah kecuali atas izin dari-Nya, itulah keagungan Allah yang maha suci, siapa yang dizinkan oleh-Nya untuk berbicara maka berbicaralah dia, dan jikalau Allah belum memberika izin maka tidak ada yang bisa berbicara ataupun bertanya kepada-Nya, sebagaimana yang akan di jelaskan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "رَبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الرَّحْمَنِ “Tuhan Yang memelihara langit dan bumi dan apa yang ada di antara keduanya; Yang Maha Pemurah.” Allahlah Tuhan segala sesuatu, Allah Ta’ala berfirman: إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ (91) “Aku hanya diperintahkan untuk menyembah Rabb negeri ini (Mekah) Yang telah menjadikannya suci dan kepunyaan-Nya-lah segala sesuatu,” (QS. An-Naml: 91) Dialah Tuhan pemilik tujuh langit yang bertingkat-tingkat, dan tuhan pemilik bumi yang tujuh pula sebagaimana ditetapkan dalam hadits dari Rasulullah shallallaahu ‘alaihi wa sallam.(1)وَمَا بَيْنَهُمَا Maknanya: Apa-apa yang berada di antara langit dan bumi, seperti awan, planet-planet dan yang lainnya baik yang kita ketahui maupun yang tidak diketahui kecuali oleh Allah, firman-Nya: الرَّحْمَنِ [Ar-Rahmaan] adalah ‘athaf bayan (kata penjelas) artinya: yang memiliki kasih sayang yang luas dan meliputi segalanya. لَا يَمْلِكُونَ مِنْهُ خِطَابًا “Mereka tidak dapat berbicara dengan Dia ” maksudnya: Bahwa manusia tidak akan ada kesempatan berbicara, dan tidak ada seorang pun yang mampu berbicara kecuali dengan izin Allah, (1) Bukhari (2452) dan Muslim (1610) mengeluarkan hadits dari Sa'id Bin Zaid radhiyallaahu 'anhu bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: مَنْ ظَلَمَ مِنَ الْأَرْضِ شَيْئًا طُوِّقَهُ مِنْ سَبْعِ أَرَضِيْنَ \"Barang siapa sedikit saja berbuat zalim dalam (urusan luas) tanah dihimpit dengan tujuh bumi\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 37: 36-37. Kemudian Allah menjelaskan bahwa ini semua adalah balasan bagi mereka yang bertakwa dan semua itu adalah karunia dari Allah dan kebaikan dari-Nya. Allah berikan mereka secara sempurna dan lengkap dari sisi Tuhannya. Yang Ia adalah Rabb langit dan bumi serta apa yang diantara keduanya. Dan Ia adalah pemilik kasih sayang yang luas dari apapun yang luas. Semua yang Allah berikan bagi mereka adalah karena sebab keimanan mereka dan ibadah mereka. Kemudian Allah menjelaskan bahwa penghuni langit dan bumi dan apa yang diantara keduanya pada hari itu tidaklah memiliki izin untuk bertanya, kecuali bagi siapa yang Allah izinkan bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang memberikan pemberian yang besar itu adalah Tuhan mereka; Tuhan yang memelihara langit dan bumi dan apa yang ada di antara keduanya. Yang rahmat-Nya meliputi segala sesuatu. Dia yang mendidik dan merahmati mereka serta memberikan kelembutannya kepada mereka sehingga mereka memperoleh apa yang mereka peroleh. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan keagungan dan kerajaan-Nya yang besar pada hari Kiamat, dan bahwa semua makhluk diam; tidak ada yang berbicara karena takut kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 37",
    "description": "Tuhan yang menganugerahkan semua itu adalah tuhan pemelihara langit dan bumi dan apa yang ada di antara keduanya. Dialah tuhan yang maha pengasih dan mahakaya. Dia mempunyai rahmat yang sangat banyak. Mereka tidak mampu berbicara dengan dia. Semua unduk dan patuh kepada-Nya, tidak ada yang mampu berbicara dengan-Nya kecuali atas seizin-Nya. 38. Tidak ada yang mampu berbicara langsung dengan Allah pada hari ketika ruh, yaitu jibril, dan para malaikat lain yang berdiri bersaf-saf secara teratur dengan penuh tunduk dan khusyuk. Mereka, baik jibril atau lainnya, tidak berani berkata-kata karena khidmatnya situasi saat itu, kecuali siapa yang telah diberi izin kepadanya oleh tuhan yang maha pengasih untuk berkata kepada-Nya, dan dia hanya mengatakan sesuatu yang benar dan diridai Allah."
  }
]