[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-39. Mereka mendapatkan semua itu sebagai balasan dan karunia dari Allah,serta sebagai pemberian yang besar dan mencukupi mereka, Tuhan langit dan bumi serta apa yang ada diantara keduanya, Tuhan yang maha pengasih di dunia dan akhirat,mereka tidak punya kewenangan untuk bertanya kepada NYA kecuali dalam apa yang DIA izinkan. Hari itu jibril dan para malaikat berdiri berbaris, mereka tidak memberi syafaat kecuali bagi siapa yang Allah yang maha pengasih izinkan untuknya dan dia hanya mengatakan yang benar dan lurus. Itu adalah haq yang tidak ada keraguan bahwa ia pasti terjadi. Maka barangsiapa ingin selamat dari ketakutan ketakutannya,hendaknya dia mengambil jalan untuk menuju kepada tuhannya dengan melakukan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Pada suatu Hari ketika Jibril dan para Malaikat berdiri berbaris, tidak ada di antara mereka yang berbicara tentang syafaat untuk seseorang kecuali bagi yang telah diizinkan oleh Allah untuk memberi syafaat, dan dia berkata lurus seperti kata tauhid."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-39. Pada hari kiamat, malaikat Jibril dan malaikat lainnya berdiri membentuk barisan; mereka tidak berbicara dan tidak memberi syafaat kecuali bagi orang yang telah mendapat izin dari Allah untuk memperoleh syafaat dan mengatakan perkataan yang benar; dan perkataan yang paling benar adalah kalimat ‘Laailaaha illaa Allah’. Itulah hari agung yang benar-benar tidak diragukan kedatangannya; maka barangsiapa dari kalian -hai para hamba- yang menginginkan keselamatan pada hari itu, maka hendaklah dia kembali kepada Allah dengan bersegera mengerjakan amal kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. يَوْمَ يَقُومُ الرُّوحُ وَالْمَلٰٓئِكَةُ صَفًّا ۖ (Pada hari, ketika ruh dan para malaikat berdiri bershaf-shaf) Yakni berbaris-beris. Makna (الروح) disini adalah salah seorang malaikat, terdapat pendapat mengatakan bahwa itu adalah Jibril. Namun menurut pendapat lain ia adalah salah satu tentara Allah yang bukan dari golongan malaikat. إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمٰنُ(kecuali siapa yang telah diberi izin kepadanya oleh Tuhan Yang Maha Pemurah) Untuk memberi syafaat. Atau mereka tidak berbicara kecuali bagi orang yang telah diizinkan Allah. وَقَالَ(dan ia mengucapkan) Dan orang yang mendapat izin itu adalah orang yang ketika didunia berkata صَوَابًا (dengan perkataan yang benar) Yakni yang bersaksi akan keesaan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Hari itu, hari dimana Jibril dan para malaikat lainnya berdiri dalam barisan-barisan. Mereka tidak berbicara sedikitpun atau menambah ataupun mengurangi pahala/pertolongan kecuali hanya bagi mereka yang diberi izin oleh Allah. Mereka hanya berkata tentang kebenaran dan kejujuran. Dan adapun yang mendapat syafaat atau pertolongan haruslah mengesakan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari ketika Rūḥ} Jibril AS {dan malaikat berdiri bersaf-saf} yang berbaris {Mereka tidak berbicara, kecuali yang diizinkan oleh Tuhan Yang Maha Pengasih dan dia mengatakan yang benar} yang benar, dan di antara perkataan yang benar itu \"Laa ilaaha Illallah\""
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Maksudnya, yang melimpahkan pemberian ini pada mereka adalah Rabb mereka, “Rabb yang memelihara langit dan bumi,” yang menciptakan dan mengaturnya,”yang maha pemurah,” yang rahmatNya meliputi segala sesuatu. Allah memelihara dan merahmati mereka serta bersikap lemah lembut pada mereka hingga mereka mendapatkan apa yang mereka dapatkan. Selanjutnya Allah menyebutkan keagunganNya dan kerajaanNya yang besar pada hari kiamat dan bahwa seluruh manusia terdiam pada hari itu dan tidak berbicara dan ”mereka tidak dapat berbicara dengan Dia, kecuali siapa yang diberi izin kepadanya oleh Rabb yang maha pemurah ; dan ia menguacapkan kata yang benar,” tidak ada seorangpun yang berbicara kecuali dengan dua syarat berikut; diizinkan Allah untuk berbicara dan perkataannya benar, sebab ”itulah hari yang pasti terjadi,” yang tidak terdapat kebatilan padanya dan kebohongan tidak lagi berguna. Pada hari itu, “ketika ruh dan para malaikat berdiri bershaf shaf,“ yaitu Jibril yang merupakan malaikat paling mulia serta seluruh malaikat berdiri bershaf shaf seraya tunduk pada Allah, mereka tidak berbicara kecuali atas izin Allah. Selanjutnya Allah berfirman seraya memberi kabar gembira dan ancaman, “maka barang siapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Rabbnya,” yakni amal baik yang akan kembali padanya pada Hari Kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "( يَوْمَ يَقُومُ الرُّوحُ ) , Kata ُالرُوْح dalam ayat ini oleh para ulama dalam pendapat yang paling kuat dan paling mendekati, bahwa yang dimaksud adalah malaikat jibril, yang di ayat lain dikatakan ( نَزَلَ بِهِ الرُّوحُ الْأَمِينُ ) yakni wahyu Allah yang dibawah oleh Jibril, malaikat yang paling agung. Dalam ayat ini penyebutan kata الروح yang dinisbatkan kepada jibril sebelum para malaikat lainnya adalah pengkhususan untuknya, dan para malaikat pun juga menghadap Allah dengan bershof-shof. Pada hari ketika jibril dan para malaikat lainnya menghadap Allah dalam shof-shof mereka, dan orang-orang muslim pun ketika didunia juga bershof dalam sholat mereka menghadap kepada tuhan mereka, sebagaimana para malaikat melakukan hal yang sama. Dan para malaikat dengan kedekatan mereka dengan Allah serta keutamaan dan keistimewaan mereka, juga tidak dapat berkata apa-apa kepada Allah kecuali telah Allah izin kepada mereka, terlebih lagi manusia, Allah berfirman : { مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِ } ( Tiada yang dapat memberi syafa’at di sisi Allah tanpa izin-Nya ), maka tak satupun yang berbicara kepada Allah ataupun memberi syafa'at disisi-Nya, baik itu dari ummat manusia ataupun para malaikat kecuali dengan dua syarat : Syarat yang pertama adalah : { إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَٰنُ } mendapat izin dari Allah ta'ala . Syarat yang kedua adalah : { وَقَالَ صَوَابًا } yaitu berkata yang benar ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Itulah يَوْمَ يَقُومُ الرُّوحُ “hari, ketika ruh adalah malaikat jibril وَالْمَلَائِكَةُ صَفًّا ” dan para malaikat berdiri bersaf-saf,” Maknanya: Berbaris-baris. Sebagaimana dijelaskan dalam sebuah hadits: تَنْزِلُ مَلَائِكَةُ السَّمَاءِ الدُّنْيَا فَتُحِيْطُ بِالخَلْقِ، ثُمَّ مَلَائِكَةُ السَّمَاءِ الثَّانِيَةِ مِنْ وَرَائِهِمْ ثُم الثَّالِثَةِ وَالرَّابِعَةِ والْخَامِسَةِ “ Malaikat-malaikat langit dunia turun maka mereka meliputi manusia, kemudia malaikat langit kedua di belakang mereka, kemudian malaikat langit ke dua, ke empat dan kelima” begitulah malaikat malaikat membuat buat barisan-barisan, tidak ada yang mengetahui mereka kecuali yang menciptakan mereka subhaanahu wa Ta’ala. لَا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَنُ وَقَالَ صَوَابًا “mereka tidak berkata-kata kecuali siapa yang telah diberi izin kepadanya oleh Tuhan Yang Maha Pemurah; dan ia mengucapkan kata yang benar.” Maknanya: Tidak ada yang berbicara baik malaikat atau pun yang lainnya, sebagaimana firman Allah Ta’ala: وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمَنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا “dan merendahlah semua suara kepada (Allah) Yang Maha Pemurah, maka kamu tidak mendengar kecuali bisikan saja.”(QS. Thaha: 108) إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَنُ “kecuali siapa yang telah diberi izin kepadanya oleh Tuhan Yang Maha Pemurah;” Untuk berkata, ia akan berbicara sebagaimana jika ia telah diizinkan. وَقَالَ صَوَابًا Maknanya: Mengatakan perkataan yang benar yang sesuai dengan ridha Allah subhaanahu wa Ta’ala. Itu adalah syafa’at saat Allah memberikan izin seseorang untuk memberikan syafaat, dia akan memberi syafa’at pada urusan yang telah diizinkan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 38: Kemudian Allah menjelaskan bahwa Jibril dan bersamanya seluruh malaikat pada hari kiamat memilih orang-orang yang terpilih, namun tidak para malaikat memberi syafaat kecuali telah Allah izinkan baginya. Dan hamba Allah yang bertakwa berkata dengan sebenar-benarnya perkataan atau maksudnya adalah ia beriman kepada Allah saja (tidak kepada sesembahan yang lain) dan beramal shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para ahli tafsir berbeda pendapat tentang maksud ruh dalam ayat ini. Ada yang mengatakan Jibril, ada yang mengatakan tentara Allah, ada pula yang mengatakan ruh manusia. Yakni yang sesuai dengan keridhaan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 38",
    "description": "Tidak ada yang mampu berbicara langsung dengan Allah pada hari ketika ruh, yaitu jibril, dan para malaikat lain yang berdiri bersaf-saf secara teratur dengan penuh tunduk dan khusyuk. Mereka, baik jibril atau lainnya, tidak berani berkata-kata karena khidmatnya situasi saat itu, kecuali siapa yang telah diberi izin kepadanya oleh tuhan yang maha pengasih untuk berkata kepada-Nya, dan dia hanya mengatakan sesuatu yang benar dan diridai Allah. 39. Itulah hari yang pasti terjadi sesuai janji Allah. Allah pasti menepati janji-Nya. Maka, barang siapa menghendaki agar mendapat keridaan Allah di akhirat nanti, niscaya dia harus senantiasa menempuh jalan kembali kepada tuhannya dengan selalu berbuat baik."
  }
]