[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-39. Mereka mendapatkan semua itu sebagai balasan dan karunia dari Allah,serta sebagai pemberian yang besar dan mencukupi mereka, Tuhan langit dan bumi serta apa yang ada diantara keduanya, Tuhan yang maha pengasih di dunia dan akhirat,mereka tidak punya kewenangan untuk bertanya kepada NYA kecuali dalam apa yang DIA izinkan. Hari itu jibril dan para malaikat berdiri berbaris, mereka tidak memberi syafaat kecuali bagi siapa yang Allah yang maha pengasih izinkan untuknya dan dia hanya mengatakan yang benar dan lurus. Itu adalah haq yang tidak ada keraguan bahwa ia pasti terjadi. Maka barangsiapa ingin selamat dari ketakutan ketakutannya,hendaknya dia mengambil jalan untuk menuju kepada tuhannya dengan melakukan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Apa yang telah disebutkan ciri-cirinya kepada kalian itu adalah Hari yang tidak ada keraguan padanya, Hari itu pasti terjadi. Maka barangsiapa yang ingin keselamatan pada Hari itu dari siksa Allah hendaknya dia menyiapkan hal tersebut dengan melakukan amal saleh yang menjadikan Rabbnya rida."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. ذٰلِكَ (Itulah) Yakni hari kebangkitan mereka dengan keadaan tersebut. الْيَوْمُ الْحَقُّ ۖ( hari yang pasti terjadi) Yakni yang pasti datang dan terjadi. فَمَن شَآءَ اتَّخَذَ إِلَىٰ رَبِّهِۦ مَـَٔابًا(Maka barangsiapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Tuhannya) Yakni dengan beramal shalih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Hari itu adalah hari yang sudah pasti terjadi, hari itu adalah hari kiamat. Maka barang siapa yang dikehendaki Allah maka dia akan beriman kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Itulah hari yang benar} kejadian yang pasti terjadi tidak mustahil {Siapa yang menghendaki, maka menempuh jalan kembali kepada Tuhannya} kembali dengan beramal shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Maksudnya, yang melimpahkan pemberian ini pada mereka adalah Rabb mereka, “Rabb yang memelihara langit dan bumi,” yang menciptakan dan mengaturnya,”yang maha pemurah,” yang rahmatNya meliputi segala sesuatu. Allah memelihara dan merahmati mereka serta bersikap lemah lembut pada mereka hingga mereka mendapatkan apa yang mereka dapatkan. Selanjutnya Allah menyebutkan keagunganNya dan kerajaanNya yang besar pada hari kiamat dan bahwa seluruh manusia terdiam pada hari itu dan tidak berbicara dan ”mereka tidak dapat berbicara dengan Dia, kecuali siapa yang diberi izin kepadanya oleh Rabb yang maha pemurah ; dan ia menguacapkan kata yang benar,” tidak ada seorangpun yang berbicara kecuali dengan dua syarat berikut; diizinkan Allah untuk berbicara dan perkataannya benar, sebab ”itulah hari yang pasti terjadi,” yang tidak terdapat kebatilan padanya dan kebohongan tidak lagi berguna. Pada hari itu, “ketika ruh dan para malaikat berdiri bershaf shaf,“ yaitu Jibril yang merupakan malaikat paling mulia serta seluruh malaikat berdiri bershaf shaf seraya tunduk pada Allah, mereka tidak berbicara kecuali atas izin Allah. Selanjutnya Allah berfirman seraya memberi kabar gembira dan ancaman, “maka barang siapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Rabbnya,” yakni amal baik yang akan kembali padanya pada Hari Kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Itulah hari yang telah disebutkan tanda-tandanya yang tidak diragukan akan kejadiannya, dan hari itu pasti terjadi, dan setiap kalian harus melewati peristiwa yang akan terjadi pada hari itu . Dan barangsiapa yang berkehendak di dunia ini maka sesungguhnya ia menjadikan hari kiamat ini sebagai persiapan untuk menghadapinya dengan melakukan segala amal kebaikan, dan itu sangat mungkin dilakukan selama hamba ini masih berada dalam kehidupan dunia. Dan setiap insan memiliki kebebasan keinginan dan pilihan , barangsiapa yang berkeinginan mempersiapkan dirinya untuk menghadapi hari kiamat , maka sesungguhnya ia mampu ; yaitu dengan melakukan amalan-amalan kebaikan, tapi jikalau sebaliknya maka cukuplah baginya melakukan segala amalan keburukan dan kemaksiatan, dan sesungguhnya dia pasti akan menerima hasil dari apa yang telah ia lakukan di dunia pada hari kimata nanti. { مَآبًا } yaitu tempat kembali yang baik, dan tempat kembali yang layak, mempersiapkan dirinya untuk mendapatkannya dengan amala-amalan kebaikan , dan menjauhi segala kemaksiatan. { مَآبًا } tempat kembali , yang setiap manusia akan kembali kepada tuhannya, dia akan menerima balasan atau ganjaran dari apa yang telah ia perbuat, maka tiada lagi alasan untuk tidak melakukan segala perintah Allah , dengan turunnya Ayat ini seakan-akan kita telah menyaksikan secara nyata kejadian yang akan ada pada hari kiamat, karena ini adalah ayat Allah , tiada keraguan yang ada padanya , itulah firman Allah yang dengannya kalian diberi kesempatan menentukan pilihan dan keinginan, serta memberikan kalian kekuatan untuk melakukan amal kebaikan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ذَلِكَ الْيَوْمُ الْحَق “Itulah hari yang pasti terjadi. Maka barang siapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Tuhannya.” Maknanya: Yang kami beritakan tentang hari itu, adalah hari kebenaran. Sedangkan kebenaran adalah lawan kebatilan, yaitu pasti yang kebenaran dan keadilan tegak di dalamnya, hari di mana tidak akan bermanfaat harta dan anak-anak kecuali orang yang datang kepada Allah dengan hati yang selamat. فَمَنْ شَاءَ اتَّخَذَ إِلَى رَبِّهِ مَآبًا “Maka barang siapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Tuhannya.” Maknanya: Siapa saja yang berkehendak berbuat amalan saleh, yang akan mengembalikannya kepada Allah, dan akan pulang dengannya. Itulah amalan saleh yang sesuai dengan keridhaan Allah Ta’ala, yaitu tempat kembali yang diridhai dan dengannya Allah meridhainya. Kehendak mutlak Allah di sini telah di muqayadkan (dijelaskan) dengan ayat lain, yaitu firman-Nya: لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ (28) وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ “(yaitu) bagi siapa di antara kamu yang mau menempuh jalan yang lurus. Dan kamu tidak dapat menghendaki (sesuatu) kecuali apabila dikehendaki Allah, Rabb semesta alam.”(QS. At-Takwir: 28-29) Maknanya: Kita bisa memilih sesuai dengan arah yang kita kehendaki, tidak ada yang memaksa kita seorang pun untuk melakukan sesuatu, akan tetapi keinginan dan kehendak kita, itu semua kembali kepada Allah وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ “Dan kamu tidak dapat menghendaki (sesuatu) kecuali apabila dikehendaki Allah ” Dan Allah menjelaskan itu dalam kitab-Nya melainkan hanya bertujuan agar manusia tidak bersanda hanya pada dirinya dan kehendaknya saja, namun agar ia tahu bahwa kehendaknya terikat dengan kehendak Allah , sehingga ia bersandar kepada-Nya dalam meminta petunjuk kepada perkara yang dicintai dan diridhai-Nya. Seorang insan tidak pantas berkata: Aku bebas, aku mau yang ku mau, aku bertindak semauku. Kita katakan: Memang seperti itu, namun anda terikat dengan kehendak Allah ‘Azza Wa Jalla, tidak ada sesuatu yang kita inginkan melainkan sudah Allah kehendaki sebelumnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 39: Allah menjelaskan bahwa hari kiamat adalah hari yang nyata akan kebenarannya dimana hari itu adalah hari yang layak untuk menerima balasan; Karena hari itu adalah hari pembalasan dan hisab; Maka ketahuilah oleh kalian ! Sesungguhnya Allah telah memberi petunjuk untuk bersiap menyambut hari itu. Dan barangsiapa yang urusannya terus menerus mengikuti arahan Rabb-Nya, begitu juga yang menginginkan keberhasilan, maka berjalanlah di atas petunjuk Rabb nya, dan menjadikan petunjuk tersebut sebagai pedoman untuk mendekatkan diri kepada-Nya, kedekatannya kepada Rabb-Nya adalah sebuah kemuliaan dan balasan baginya, dan adanya jarak antara dia dan Tuhan nya tergantung dosa seorang hamba kepada Rabb-Nya. Dan seorang hamba yang memiliki kedekatan adalah hamba yang beriman kepada Allah saja dan beramal shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan hari yang hak, dimana pada hari itu kebatilan tidak akan laku dan kedustaan tidak akan bermanfaat. Setelah Allah Subhaanahu wa Ta'aala memberikan targhib dan tarhib; memberikan kabar gembira dan peringatan, maka Dia berfirman, “Maka barang siapa yang menghendaki, niscaya dia menempuh jalan kembali kepada Tuhannya.” Yakni kembali kepada Allah dengan menaati-Nya agar selamat dari azab dan mendapatkan kedudukan yang tinggi di sisi-Nya. Ayat ini dibatasi dengan ayat yang lain, yaitu firman Allah Ta’ala, “Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah, Tuhan semesta alam.” (Terj. At Takwir: 29) yakni, kita memang mempunyai pilihan untuk melakukan sesuatu tanpa ada yang memaksa, akan tetapi pilihan dan kehendak kita mengikuti kehendak Allah, jika Dia menghendaki maka akan terjadi dan jika Dia tidak menghendaki, maka tidak akan terjadi. Allah Subhaanahu wa Ta'aala menerangkan demikian, adalah agar manusia tidak bersandar kepada dirinya dan kehendaknya, bahkan hendaknya ia mengetahui bahwa hal itu terkait dengan kehendak Allah sehingga ia pun meminta kepada Allah hidayah-Nya kepada apa yang dicintai-Nya dan diridhai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 39",
    "description": "Itulah hari yang pasti terjadi sesuai janji Allah. Allah pasti menepati janji-Nya. Maka, barang siapa menghendaki agar mendapat keridaan Allah di akhirat nanti, niscaya dia harus senantiasa menempuh jalan kembali kepada tuhannya dengan selalu berbuat baik. 40. Wahai manusia, sesungguhnya kami telah memperingatkan kepadamu azab di akhirat yang waktunya sungguh sangat dekat dan segera tiba, yaitu pada hari ketika manusia melihat apa yang telah diperbuat oleh kedua tangannya, oleh dirinya sendiri, dan orang kafir berkata dengan penuh penyesalan, 'alangkah baiknya seandainya dahulu aku jadi tanah, bukan menjadi manusia yang mendapat taklif agama, niscaya aku tidak dihadapkan pada pertanggungjawaban atas perbuatanku sebagaimana yang aku hadapi hari ini. \"."
  }
]