[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Perkaranya tidak seperti yang diklaim oleh orang orang musyrik itu.mereka akan tahu akibat dari pendustaan mereka,mereka akan melihat apa yang akan Allah lakukan terhadap mereka pada hari kiamat, Kemudian mereka akan meyakini kebenaran apa yang dibawa oleh Muhammad sholallohu 'alaihi wasallam yaitu al-quran dan kabar kebangkitan.ini adalah ancaman dan peringatan keras bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sebenarnya Al-Qur`ān itu tidaklah sebagaimana anggapan mereka. Dan orang-orang yang mendustakan Al-Qur`ān akan mengetahui akibat buruk pendustaan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Akan tetapi kenyataannya bukan seperti yang didustakan oleh orang-orang yang menyesatkan itu. kelak mereka akan mengetahui akibat dari pendustaan mereka, kemudian mereka akan memastikannya pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4-5. كَلَّا سَيَعْلَمُونَ (Sekali-kali tidak; kelak mereka akan mengetahui) Ayat ini adalah bantahan bagi mereka. Yakni mereka akan mengetahui akibat dari pendustaan mereka. Kemudian Allah mengulangi bantahan ini, dengan firman-Nya: ثُمَّ كَلَّا سَيَعْلَمُونَ (kemudian sekali-kali tidak; kelak mereka mengetahui) Pengulangan ini sebagai penekanan dalam bantahan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. “Tidak!” : Ungkapan untuk menghalangi dan menghentikan pertanyaan mereka. Mereka akan mengetahui bahwa mereka kelak akan dibangkitkan dan segala amal akan dihitung, bahwa itu suatu kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak Kelak mereka akan mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1 – 5 Maknanya, tentang apakah yang ditanyakan oleh orang-orang yang mendustakan tanda-tanda kebesaran Allah itu? Selanjutnya Allah menjelaskan apa yang mereka pertanyakan tersebut seraya berfirman, “Tentang berita yang besar, yang mereka perselisihkan tentangnya,” yakni, tentang berita besar yang mereka perdebatkan dan telah tersebar di antara mereka tentangnya untuk mendustakan dan mengaggap mustahil. Padahal itulah berita yang tidak perlu diragukan dan dibimbangkan. Tapi mereka yang mendustakan tidak percaya akan bertemu dengan Rabb mereka meski seluruh tanda tanda kebesaran Allah datang pada mereka hingga mereka melihat siksaan yang pedih. Karena itu Allah berfiirman, “Sekali kali tidak; kelak mereka akan mengetahui, kemudian sekali kali tidak; kelak mereka akan mengetahui,” yakni, mereka akan mengetahui bila siksaan menimpa mereka yang dulu mereka dustakan pada saat, “mereka didorong ke neraka jahannam dengan sekuata kuatnya.” (Ath-Thur: 13), dan berkata pada mereka, “inilah neraka yang dahulu kamu selalu mendustakannya.” (Ath-Thur: 14)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dalam kaidah bahasa arab kata كلَّا disebut sebagai huruf zajar yang berarti teguran, peringatan, atau cercaan, Allah menegur mereka (orang-orang kafir) atas perselilisihan yang terjadi diantara mereka, kemudian Dia mengatakan ( سَيَعْلَمُوْنَ ) kelak mereka akan mengetahui yaitu apa yang Rasul telah kabarkan kepada mereka Mereka akan mengetahui hal itu dalam waktu yang sangat dekat, dan pertama-tama yang manusia akan ketahui ketika kematian menjemput mereka, dan ketika itu barulah mereka beriman akan berita yang datang kepada mereka, dan meyakininya; jika telah tampak kepadanya kehidupan akhirat barulah ia beriman, akan tetapi keimanan itu tidak lagi bermanfaat baginya dan sama sekali keimanan itu tidak akan diterima disisi Allah; karena ia telah berpindah ke alam kenyataan, dan tidak satupun yang mengingkari hal itu, dan sesungguhnya sebagian manusia menyangkal akan adanya Ghaib, atau bahkan sebagian besar dari mereka. Tapi ketika kematian telah tiba dan kehidupan akhirat telah nampak, dan malaikat telah menghampirinya; maka ketika itu barulah mereka beriman, akan tetapi keimanan itu sama sekali tidak bermanfaat baginya hanya dengan waktu yang sesingkat itu, oleh karena itu Allah mengatakan ( سَيَعْلَمُنَ ) yakni : dalam waktu dekat mereka akan mengetahui dan menyaksikan apa yang telah mereka ingkari, (َثُمَّ كَلاَّ سَيَعْلَمُوْن ) kemudian Allah kembali menekankan bahwa kelak mereka benar-benar akan mengetahuinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya Allah Subhaanahu berfirman pada ayat ini: كَلَّا سَيَعْلَمُونَ (4) ثُمَّ كَلَّا سَيَعْلَمُونَ (5) “ Sekali-kali tidak; kelak mereka akan mengetahui, kemudian sekali-kali tidak; kelak mereka akan mengetahui.” Kalimat yang kedua (yakni ayat kelima) adalah taukid (penguat) dari segi makna, meskipun kalimat tersebut bukanlah disebut taukid menurut istilah para pakar ilmu nahwu. Karena kalimat ini terpisah dengan kalimat sebelumnya dengan huruf ‘athaf (yaitu ثُمَّ [tsumma]) sedangkan taukid menurut pakar ilmu nahwu tidaklah boleh terpisah dengan huruf. Adapun yang dimaksud pengetahuan adalah pengetehuan secara yakin yang akan mereka saksikan sesuai dengan berita yang telah sampai kepada mereka saat di dunia (berupa berita hari akhir dan kebangkitan)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 4: 4-5. Kemudian Allah mengancam (memberi peringatan) atas mereka, Allah katakan : Bahwa tidaklah demikian urusannya (sebagaimana mereka kaum musyrikin katakana dan yakini), dimana mereka mengingkari hari kebangkitan (setelah kematian menimpa diri mereka); Yang benar adalah sebagaimana (yang dikatakan) oleh Rasulullah yang ia adalah utusan Allah yang jujur dengan apa yang di amanahkan oleh Rabb nya. Dan bahwasanya Al Qur’an adalah kebenaran, dan suatu saat mereka yaitu orang-orang yang mendustakan pasti akan mengetahui akibat pendustaan mereka, dan akan bertambah penyesalan mereka ketika mereka melihat neraka dihadapannya (secara nyata) melalui mata-mata mereka dan kejelasan yang nyata. Memang pantas bagi mereka mendapatkan adzab dan siksaan (yang demikian)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah sanggahan terhadap pendapat orang-orang kafir Mekah yang mengingkari hari berbangkit dan hari kiamat. Sesuatu yang akan menimpa mereka akibat keingkaran mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 4",
    "description": "Tidak! persoalan yang sebenarnya tidak seperti apa yang mereka duga. Kelak, pada hari kebangkitan itu benar-benar tiba, mereka akan mengetahui hakikat persoalan yang sebenarnya. 5. Allah menegaskan sekali lagi. Sekali lagi tidak! kelak mereka akan mengetahui hakikat persoalan yang sebenarnya ketika hari kebangkitan itu benar-benar tiba."
  }
]