[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami memperingatkan kalian dari azab di akhirat yang dekat yang pada saat itu setiap orang melihat apa yang dilakukan dan diusahakannya,amal baik atau amal buruk. Orang kafir berkata saat melihat beratnya hisab, ”seandainya dahulu aku menjadi tanah sehingga sekarang aku tidak dibangkitan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya Kami telah memperingatkan kalian -wahai manusia- akan datangnya siksa yang dekat, pada Hari ketika seseorang melihat kepada apa yang telah dilakukannya di dunia. Dan orang kafir berangan-angan agar bisa terlepas dari siksa dengan mengatakan, “Alangkah baiknya seandainya aku menjadi debu seperti hewan-hewan yang dikatakan kepadanya pada hari Kiamat, \"Jadilah debu\".”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Kami -dengan keagungan dan kekuasaan Kami- telah memperingatkan kalian dari azab yang telah dekat kedatangannya, yaitu pada hari ketika setiap hamba melihat seluruh kebaikan dan keburukan yang telah dia kerjakan. Dan pada hari itu, orang yang mendustakan Allah akan berkata dan berharap seandainya dia tetap menjadi tanah dan tidak dibangkitkan. Akan tetapi itu tidak mungkin terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. يَوْمَ يَنظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ (pada hari manusia melihat apa yang telah diperbuat oleh kedua tangannya) Yakni menyaksikan kebaikan atau keburukan yang telah ia lakukan. وَيَقُولُ الْكَافِرُ يٰلَيْتَنِى كُنتُ تُرٰبًۢا(dan orang kafir berkata: “Alangkah baiknya sekiranya aku dahulu adalah tanah”) Ia berharap untuk menjadi tanah saja, setelah menyaksikan berbagai azab yang Allah siapkan baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya Kami telah memperingatkan kalian wahai manusia, tentang adanya siksa di hari kiamat. Hari dimana setiap orang akan melihat segala perbuatannya, baik atau buruk. Orang kafir berkata: “Seandainya aku kembali menjadi tanah saja, maka aku tidak akan mendapat azab ini.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah memperingatkan kalian tentang azab yang dekat pada hari ketika manusia melihat apa yang telah diperbuat oleh kedua tangannya dan orang kafir berkata, “Oh, seandainya saja aku menjadi tanah.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "“sesungguhnya kami telah memperingatkan kepadamu (hai orang kafir) siksa yang dekat,” karena siksaan itu telah mendekat dan semua yang akan datang itu, “pada hari manusia melihat apa yang telah diperbuat oleh kedua tangannya.” Inilah yang menjadi perhatiannya dan yang membuatnya takut. Maka hendaklah ia memperhatikan apa yang telah diprbuat untuk keabadian nanti. “hai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap diri memperhatikan apa yang telah diperbuatnya untuk hari esok (akhirat), dan bertakwalah kepada Allah, sesungguhnya Allah maha mengetahui apa yang kamu kerjakan.” ( Al-Hasyr:18) Dan selanjutnya, bila kebaikan yang didapatkan, maka hendaklah memuji Allah, dan bila tidak demikian, maka janganlah mencela siapa pun selain diri sendiri. Karena itulah orang-orang kafir kelak akan berharap agar mati saja, karena amat merugi dan menyesal. Semoga Allah menyelamatkan kita semua dari kekufuran dan seluruh keburukan, sesungguhnya Allah Maha Pemurah lagi Mahamulia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada ayati ini Allah kembali mengulangi peringatan-Nya tentang hari kiamat , Allah berfirman : { إِنَّا أَنْذَرْنَاكُمْ عَذَابًا قَرِيبًا } Jika kalian belum mempersiapkan diri untuk hari kiamat itu, maka azab yang telah kami kabarkan kepadamu sangatlah dekat, karena sesungguhnya hari itu pasti akan datang , dan setiap yang akan datang adalah deka . Azab itu sangatlah dekat, akan tetapi Allah merahasiakannya ketimbang mengabarkan demi kemaslahatan hambanya yaitu untuk melakukan amal shalilh, karena bukanlah menjadi kepentingan bagi kita kapan datangnya hari kiamat itu, dan kapan terjadinya, berapa lama lagi dunia ini akan bertahan ? , semua pertanyaan-pertanyaan itu tidaklah penting bagi kita, akan tetapi yang menjadi maslahat bagi diri kita adalah bagaimana kita memperbanyak melakukan amalan kebaikan , { إِنَّا أَنْذَرْنَاكُمْ عَذَابًا قَرِيبًا } kapan ? { يَوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ } yaitu pada hari ketika manusia melihat apa yang telah diperbuat oleh tangannya, apakah itu perbuatan baik ataupun buruk, setiap insan akan berdiri dihadapan tuhannya pada hari kiamat dengan membawa segala amal perbuatannya, setiap amal perbuatan akan di hisab baik yang shalih ataupun yang buruk, maka pada saat itu kalian akan menyaksikan bagaimana amalan kalian di hisab dan kalian tidak bisa mengingkarinya, Allah ta'ala berfirman : { وَوُضِعَ الْكِتَابُ فَتَرَى الْمُجْرِمِينَ مُشْفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَا وَيْلَتَنَا مَالِ هَٰذَا الْكِتَابِ لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا ۚ وَوَجَدُوا مَا عَمِلُوا حَاضِرًا ۗ وَلَا يَظْلِمُ رَبُّكَ أَحَدًا } ( Dan diletakkanlah kitab, lalu kamu akan melihat orang-orang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata: “Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang juapun”. ) Surat Alkahf : 49 , dan Allah juga berkata : { يَوْمَ تَجِدُ كُلُّ نَفْسٍ مَا عَمِلَتْ مِنْ خَيْرٍ مُحْضَرًا وَمَا عَمِلَتْ مِنْ سُوءٍ تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُ أَمَدًا بَعِيدًا } ( Pada hari ketika tiap-tiap diri mendapati segala kebajikan dihadapkan (dimukanya), begitu (juga) kejahatan yang telah dikerjakannya; ia ingin kalau kiranya antara ia dengan hari itu ada masa yang jauh ) , Surat Ali-Imran : 30 , { يَوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ } Setiap manusia akan menyaksikan apa yang telah diperbuat oleh tanganya ketika didunia, dan bukan apa yang telah diperbuat oleh tangan orang lain, tidak pula ia membawa keburukan dari orang lain, serta tidak diberikan kepadanya dari kebaikan orang lain, setiap hamba akan bersama dengan amalannya sendiri. { مَا قَدَّمَتْ يَدَاهُ } apa yang telah diperbuat oleh tangannya, maka tidaklah mereka akan di zholimi dengan azab karena kemaksiatan yang belum ia perbuat ataupun disebabkan oleh kemaksiatan orang lain, Allah berfirman : { وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ } ( dan seorang yang berdosa tidak akan memikul dosa orang lain ) [ Al-An'am : 164 ] . { يَوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنْتُ تُرَابًا } pada hari ketika orang-orang kafir menyaksikan apa yang telah diperbuat oleh tangannya, yaitu kekufuran dan kesesatan serta kemaksiatan-kemaksiatan lainnya, mereka berkata : { يَا لَيْتَنِي كُنْتُ تُرَابًا } seandainya dahulu aku menjadi tanah sehingga sekarang aku tidak dibangkitan, dan pastinya aku tidak akan betemu dengan azab ini, inilah harapan mereka, akan tetapi itu tidak bermanfaat bagi mereka, harapan yang mustahil akan terjadi. Dan dikatakan dalam riwayat lain : orang-orang kafir mengatakan hal itu ketika mereka menyaksikan Allah membangkitkan binatang-binatang yang telah mati, karena sesungguhnya bintang juga akan dibangkitkan dari kematian, sebagaimana yang Allah katakan : { وَإِذَا الْوُحُوشُ حُشِرَتْ } ( Dan apabila binatang-binatang liar dikumpulkan, ) binatang-binatang itu akan dikumpulkan pada hari kiamat agar allah melakukan qishas untuk sebagian darinya atas sebagian yang lain, maka kambing tak bertanduk membalas kambing yang bertanduk dengan menanduknya, kemudian dikatakan kepadanya : berubahlah menjadi tanah, maka tiada baginya surga dan juga neraka; dan ketika itu berkatalah orang-orang kafir { يَا لَيْتَنِي كُنْتُ تُرَابًا } , seandainya dahulu aku menjadi tanah, itulah harapan mereka yang mustahil akan terjadi, karena mereka telah menyia-nyiakan umur mereka, dan telah menyia-nyiakan akhirat mereka . Pada ayat-ayat yang telah dijelaskan adalah merupakan balasan untuk orang-orang yang beriman dan juga untuk mereka yang telah kufur kepada Allah, dan sesungguhnya itu akan sangat dekat, maka hedaklah kita mempersiapkan diri untuk menghadapi peristiwa itu dan bukan justru menjauh dan menghindar dari apa yang harus kita lakukan untuk bertemu dengan hari yang dijanjikan itu. Setiap insan yang bernyawa akan mati, dan kematian adalah merupakan bagian dari peristiwa kiamat, karena kiamat itu ada dua bagian : Kiamat kecil : yaitu kematian. Dan kiamat besar : yaitu kebangkitan setelah kematian. Setiap jiwa yang mati pasti akan bertemu dengan kenyataan dari perkataan ini, akan bertemu dengan janji yang telah Allah janjikan untuk hambanya, sejak dia mati maka itulah awal dari pertemuan itu, orang beriman akan berjumpa dengan kematian itu dan mereka akan diberitakan kepadanya kabar gembira, berbeda halnya dengan orang kafir, mereka juga akan mengadapi kematian akan tetapi setelah itu mereka akan disiksa dengan azazb yang sangat pedih, dan mereka mengharapkan adanya kembali kehidupan didunia, akan tetapi itu tidak mungkin terjadi, karena tidak ada lagi peristiwa lain kecuali penghakiman atas amal perbuatan yang dilakukan ketikan didunia. Bukankah Allah telah menjelaskan segala sesuatu dengan jelas, dan telah memberikan bukti-bukti aka kebanarannya, dan Allah telah memberikan mereka kelekuasaan untuk melakukan amal kebaikan, akan tetapi mereka menyia-nyiakan itu semua, Allah berfirman : { وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ } ( Sekiranya mereka dikembalikan ke dunia, tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya. ) , dan Allah mengetahui akan hal itu, dan itu dikarenakan hati mereka yang telah rusak, dan jika hati telah rusak maka tiada lagi upaya untuk melakukannya, dan tentunya mereka akan berbohong, sebagaimana yang Allah katakan : { وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَى النَّارِ فَقَالُوا يَا لَيْتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِآيَاتِ رَبِّنَا وَنَكُونَ مِنَ الْمُؤْمِنِينَ ، بَلْ بَدَا لَهُمْ مَا كَانُوا يُخْفُونَ مِنْ قَبْلُ ۖ وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ وَإِنَّهُمْ لَكَاذِبُونَ } ( Dan jika kamu (Muhammad) melihat ketika mereka dihadapkan ke neraka, lalu mereka berkata: “Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman”, (tentulah kamu melihat suatu peristiwa yang mengharukan) , Tetapi (sebenarnya) telah nyata bagi mereka kejahatan yang mereka dahulu selalu menyembunyikannya. Sekiranya mereka dikembalikan ke dunia, tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya. Dan sesungguhnya mereka itu adalah pendusta belaka. ) [ Al-An'an : 27, 28 ] . Orang beriman tentunya telah mempersiapkan dirinya untuk mengahadapi nperistiwa hari kiamat, dan tidak seharusnya ia mengikuti apa yang orang lakukan, dengan mengatakan : bukankah ini juga dilakukan orang lain ? . Sesunguhnya orang lain tidak akan memberikan kamu manfaat ketika peristiwa kiamat itu terjadi, dan kamu tidak mengetahui apa yang akan terjadi pada diri mu dihari kiamat kecuali dari apa yang telah kamu perbuat, juga kamu tidak mengetaui tentang nasib orang lain, azab ataupun kenikmatan yang ia dapatkan, semuanya hanyalah tentang diri kamu saja, Allah berfirman : { وَلَنْ يَنْفَعَكُمُ الْيَوْمَ إِذْ ظَلَمْتُمْ أَنَّكُمْ فِي الْعَذَابِ مُشْتَرِكُونَ } ( (Harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu di hari itu karena kamu telah menganiaya (dirimu sendiri). Sesungguhnya kamu bersekutu dalam azab itu. ) ketika didunia kamu melihat orang-orang yang mendapat hukuman, dan hukuman itu bisa menjadi ringan dengan bantuan orang lain, itu didunia, akan tapi diakhirat itu semua tidak lagi bermanfaat . Semoga Allah menjaga kita semua."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّا أَنْذَرْنَاكُمْ عَذَابًا قَرِيبًا “Sesungguhnya Kami telah memperingatkan kepadamu (hai orang kafir) siksa yang dekat,” Maknanya: Kami ancam kalian dengan siksa yang dekat yaitu hari kiamat. Hari kiamat itu dekat walau pun dunia ini masih tersisa jutaan tahun lagi, sungguh ia dekat: كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا “Pada hari mereka melihat hari berbangkit itu, mereka merasa seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi hari.”(QS. An-Nazi’at: 46) Azab yang Allah jadikan sebagai ancaman bagi kita ini sangat dekat, tidak ada jarak antara seorang insan dengannya kecuali kematiannya, sedang setiap insan tidak akan tahu kapan ia akan meninggal dunia, terkadang di waktu subuh masih hidup namun di sore hari dia telah tiada, atau di sore hari masih hidup namun di pagi harinya ia telah tiada. Oleh karena itu hendaknya kita memperkuat tekad dalam perbuatan-perbuatan kita,dan mengisi kesempatan hidup ini sebelum kesempatan ini pergi. يَوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ “pada hari manusia melihat apa yang telah diperbuat oleh kedua tangannya;” Maknanya adalah semua orang akan melihat apa-apa yang telah diperbuat kedua tangannya, yakni yang telah diperbuat di dunia, mengambil catatan amalannya dan mengetahui akhir perjalanannya: اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا “Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu”(QS. Al-Isra: 14) Orang-orang kafir akan mengatakan karena saking ngerinya yang ia lihat dan yang ia saksikan berupa siksaan: يَا لَيْتَنِي كُنْتُ تُرَابًا “Alangkah baiknya sekiranya aku dahulu adalah tanah” maknanya: Andai saja aku tidak diciptakan, atau andai aku tidak dibangkitkan, atau jika melihat binatang-binatang ternak yang telah Allah adili di antara mereka, kemudian Allah mengatakan: Jadilah tanah, maka binatang itu menjadi tanah, ia berangan-angan seperti binatang ternak. Firman-Nya (tentang ucapan orang kafir): كُنْتُ تُرَابًا “aku dahulu adalah tanah” memiliki tiga kemungkinan makna: Pertama: aduhai, andai saja aku dulu adalah tanah, tidak tercipta (menjadi manusia), karena manusia diciptakan dengan tanah. Kedua: Aduhai, anda saja aku dulu adalah tanah sehingga tidak akan dibangkitkan, maksudnya: aku tanah diliang kubur. Ketiga: Jika ia melihat binatang-binatang ternak yang telah Allah adili di antara mereka, Allah berkata pada mereka, jadilah tanah, maka mereka menjadi tanah, ia mengatakan: andai saja aku pun menjadi tanah seperti binatang-binatang ternak itu wallaahu A’lam. Sampai disini selesai tafsir surat An-Naba, di dalamnya mengandung banyak peringtan, hikmah dan tanda-tanda kekuasaan Allah ‘Azza Wa Jalla, yang harus diyakini dan diimani. Kita memohon kepada Allah Agar memberikan manfaat bagi kita semua dengan kitab-Nya, dan menjadikannya sebagai peringatan bagi hati-hati kita, sebagai obat bagi apa-apa yang ada di dalam hati, sesungguhnya ia Maha Pemberi lagi Maha Mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 40: Dan ketahuilah oleh mu wahai manusia ! Bahwasanya Allah di atas ketinggian-Nya memperingatkan kalian dengan adzab-Nya yang sungguh sangat dekat, dan adazab ini akan datang pada hari kiamat, yaitu hari dimana manusia melihat kejadian yang telah berlalu dari kebaikan, atau keburukan yang telah tercatan di lembaran-lembaran amalan seorang hamba. Pada saat itu seorang kafir akan mengeluh dengan kerasnya adzab yang akan menimpanya dan pada saat ia melihat adzab sudah di depan mata dengan berkata : Seandainya aku tidaklah diciptakan dan juga dibangkitkan; Seandainya diri ini dikembalikan sebagaimana tanah sebagaimana para binatang itu. Setelah di hisab amalannya satu per satu dari mereka (orang kafir) mereka berkata : Jadikanlah aku tanah saja wahai Tuhan ku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu hari Kiamat. Hal itu, karena setiap yang akan datang adalah dekat. Oleh karena itu, sebelum ia bersedih karena melihat perbuatannya di akhirat, maka hendaknya ia melihat perbuatan yang dilakukannya sekarang sebagaimana yang diperintahkan oleh Allah Subhaanahu wa Ta'aala, “Wahai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap diri memperhatikan apa yang telah diperbuatnya untuk hari esok (akhirat); dan bertakwalah kepada Allah, sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.” (Terj. Al Hasyr: 18) Jika ia mendapatkan kebaikan, maka hendaklah ia memuji Allah. Tetapi, jika yang ia dapatkan selain itu, maka janganlah ia cela kecuali dirinya. Sehingga aku tidak diazab. Orang kafir mengucapkan seperti ini ketika Allah Subhaanahu wa Ta'aala berfirman kepada hewan setelah hewan-hewan itu membalas satu sama lain (melakukan qishas), “Jadilah tanah.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 40",
    "description": "Wahai manusia, sesungguhnya kami telah memperingatkan kepadamu azab di akhirat yang waktunya sungguh sangat dekat dan segera tiba, yaitu pada hari ketika manusia melihat apa yang telah diperbuat oleh kedua tangannya, oleh dirinya sendiri, dan orang kafir berkata dengan penuh penyesalan, 'alangkah baiknya seandainya dahulu aku jadi tanah, bukan menjadi manusia yang mendapat taklif agama, niscaya aku tidak dihadapkan pada pertanggungjawaban atas perbuatanku sebagaimana yang aku hadapi hari ini. \"1-5. Allah memulai surah ini dengan sumpah demi malaikat yang diberinya tugas berat. Di antara tujuannya adalah agar manusia menghayati peran-peran tersebut dalam kehidupan. Demi malaikat yang mencabut nyawa kaum kafir dengan keras dan kasar sebagai tanda kegeraman para malaikat itu terhadap mereka. Demi malaikat yang mencabut nyawa orang mukmin dengan halus dan lemah lembut sebagai tanda simpati para malaikat itu kepada mereka. Malaikat mencabut nyawa mereka sambil berkata, 'wahai jiwa yang tenang, kembalilah ke tuhanmu dengan hati yang rida dan diridai-Nya. ' demi malaikat yang turun dari langit dengan cepat untuk melaksanakan tugas dari Allah sembari selalu bertasbih menyucikan Allah dan mengagungkannya sepanjang waktu, dan demi malaikat yang mendahului yang lain dengan kencang, cepat, dan cekatan untuk melakukan tugas-tugasnya tanpa mengulur waktu, dan demi malaikat yang mengatur urusan dunia, seperti pengisaran angin, turunnya hujan, dan sebagainya sesuai perintah Allah."
  }
]