[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menciptakan kalian berjenis jenis,ada laki laki dan ada perempuan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan Kami jadikan kalian -wahai manusia- berpasang-pasangan, di antara kalian ada lelaki dan ada perempuan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَخَلَقْنٰكُمْ أَزْوٰجًا (dan Kami jadikan kamu berpasang-pasangan) Yakni Kami ciptakan laki-laki dan perempuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7–8 Kami juga menjadikan gunung-gunung sebagai pasak untuk menjaga keseimbangan bumi, agar tidak bergerak-gerak. Juga Kami telah menciptakan kalian berpasangan, laki-laki dan perempuan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menciptakan kalian berpasang-pasangan} berpasang-pasangan laki-laki dan perempuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-16 Maksudnya, bukankah kami telah memberikan kalian berbagai nikmat agung, kami menjadikan untuk kalian, “bumi itu sebagai hamparan,” yaitu dihamparkan dan ditundukkan bagi kalian dan untuk kepentingan kepentingan berupa tanah garapan, tempat tinggal dan jalan. “Dan gunung gunung sebagi pasak,” mengokohkan bumi agar tidak berguncang bersama kalian. “Dan kami jadikan kamu berpasang pasangan,” yakni lelaki dan perempuan dari jenis yang sama agar masing masing dari keduanya merasa tentang pada yang lain dan membentuk rasa cinta dan kasih serta membuahkan keturunan dari keduanya. Dan termasuk dalam karunia ini adalah nikmatnya wanita yang dinikahi. “Dan kami jadikan tidurmu untuk istirahat,“ yakni sebagai istirahat bagi kalian dan sebagai pemutus pekerjaan yang jika terus dilakukan akan membahayakan badan. Allah menjadikan malam dan tidur sebagai penutup agar gerakan gerakan mereka yang membahayakan menjadi tenang dan mereka mendapatkan kenyamanan yang bermanfaat. “Dan kami bangun di atas kamu tujuh lapis (langit) yang kokoh,” yakni tujuh langit yang amat kuat dan kokoh. Allah menahannya dengan kusasanya dan menjadikannya sebagai atap bagi bumi. Padanya terdapat berbagai manfaat bagi manusia. Karena itulah Allah menyebutkan di antara manfaat matahari seraya berfirman, “Dan kami jadikan pelita yang amat terang (matahari).” Allah mengingatkan manusia pada matahari berupa nikmat cahayanya yang menjadi kebutuhan vital bagi mereka dan pada panasnya, karena padanya terdapat berbagai manfaat, seperti untuk mematangkan (buah-buahan). “Dan kami turunkan dari awan air yang banyak tercurah,“ yakni sangat deras, “supaya kami tumbuhkan dengan air itu biji bijian,” seperti gandum, jagung, beras dan lainnya yang menjadi makanan manusia, “dan tumbuh tumbuhan,” mencakup seluruh tumbuh tumbuhan yang dijadikan Allah sebagai makanan untuk binatang ternak mereka, “dan kebun kebun yang lebat,” yaitu kebun kebun yang lebat, yang di dalamnya terdapat berbagai macam buah buahan yang lezat. Untuk itu, Dzat yang memberi kalian berbagai nikmat agung yang tidak terkira dan terhitung jumlahnya ini, bagaimana bisa kalian kufuri dan kalian dustakan berita yang dikabarkan pada kalian tentang hari kebangkitan dan pengumpulan nanti? Atau mengapa kalian menggunakan nikmat-nikmat Allah untuk bermaksiat dan untuk menentangnya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kami tidak menciptakan kalian hanya satu jenis saja, akan tetapi kami menjadikanmu bermacam jenis dari laki-laki dan perempuan agar kalian bisa berpasangan dalam perkawinan dan menghasilkan keturunan, agar kalian bisa tinggal bersama, dan agar kalian bisa melakukan hubungan satu sama lainnya, Allah tidak menciptakan kalian semua berjenis kelamin laki-laki saja, atau menjadikan kalian berjenis kelamin perempuan saja, bahkan kami menjadikan kalian berpasangan laki-laki dan perempuan, itulah kebijaksanaan Allah, dan bukanlah itu sebagai kekhususan bagi anak adam saja, bahkan Allah menjadikan hal itu pada binatang juga, dan juga pada tumbuh-tumbuhan, maka penciptaan macam jenis adalah suatu keumuman untuk menjaga kelangsungan hidup jenis tertentu, dan berkelanjutannya penciptaan diantara dua pasangan, Allah berfiman dalam surah ad-Zariyat : 49 ( وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ ) Dan segala sesuatu Kami ciptakan berpasang-pasangan supaya kamu mengingat kebesaran Allah, Dia-lah Allah yang mampu menciptakan kalian dan menjadikan kalian berpasang-pasangan, apakah Dia tidak mampu membangkitkan kalian kembali setelah kematian ?! maha suci Allah yang kuasa melakukan hal itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَخَلَقْنَاكُمْ أَزْوَاجًا “dan Kami jadikan kalian berpasang-pasangan, ” Maksudnya: Berkelompok antara laki-laki dan perempuan, kecil dan besar, hitam dan merah, sengsara dan bahagia, dan segala macam kelompok atau bentuk manusia pada hal lainnya. Allah ciptakan mereka berpasang-pasangan sesuai dengan kehendak dan ketentuan kebijaksanaan-Nya agar manusia dapat mengambil pelajaran dari kuasa Allah Ta’ala, dan mengakui bahwa Dia Maha Kuasa untuk menjadikan manusia yang diciptakan dari satu materi (tanah) atau dari satu ayah sehingga menjadi bermacam-macam keolmpok yang berbeda-beda."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naba ayat 8: 6-16. Allah menyebutkan Sembilan dalil yang menunjukkan atas ke Maha Mampuan-Nya atas membangkitkan dari yang mati dan menghidupkannya kembali. Allah berkata : Bukankah Kami yang menciptakan bumi dan menjadikannya terhampar bagi kalian ? dan kalian dapat bergerak sebagaimana yang kalian inginkan ? Dan bukankah kami ciptakan pada bumi itu gunung dan kami jadikan kokoh tertancap hingga kalian tidak terpental dan juga terguncang ? Dan bukankah kami jadikan segolongan laki-laki dan juga perempuan bagi kalian agar supaya berkembang biak dan memperbanyak keturunan ? Dan bukankah kami jadikan tidur bagi kalian sebagai pemutus aktivitas kalian dan sebagai waktu istirahat bagi tubuh-tubuh kalian ? Dan bukankah kami jadikan malam dengan kegelapannya agar supaya kalian menetap di tempat-tempat tinggal kalian dan beristirahat dari segala sesuatunya agar kembali dapat menyonsong kehidupan di siang harinya ? Dan bukankah malam adalah waktu bagi manusia untuk kembali (mencari tempat tinggal) bagi raga, karena kegelapannya yang senantiasa pekat menutupi, sebagaimana pakaian yang menutupi tubuh ? Dan bukankah kami jadikan siang dengan cahayanya agar manusia senantiasa beraktivitas menyongsong kehidupannya ? Dan bukankah kami ciptakan tujuh langit di atas kalian yang nyata tegaknya serta kokoh dan padat, tidaklah padanya terdapat keretakan (celah) dan tidak juga keretakan ? Dan bukankah kami jadikan matahari yang terkumpul padanya diantara cahaya dan panas ? Maka cahaya tersebut menjadikan makhluk dapat melihat dan panas menjadikan tumbuhan dapat ber foto sintesis dan manusia dapat memanfaatkannya. Dan bukankah kami turunkan air yang sangat banyak dari langit yang terkumpul ?; Agar supaya menumbuhkan biji-bijian dan tumbuhan, begitu juga kebun-kebun, taman-taman terkumpul di dalamnya pepohonan dan cabang-cabang dari rantingnya. Kesimpulannya dari dalil-dalil yang telah disebutkan adalah, barangsiapa yang mampu menciptakan atas segala sesuatu yang telah disebutkan tadi maka mampu pula untuk menghidupkan manusia setelah matinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Laki-laki dan perempuan agar yang satu merasa tenteram dengan yang lain, tumbuh rasa cinta dan kasih sayang, dan dari keduanya lahir keturunan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naba Ayat 8",
    "description": "Dan bukankah kami telah menciptakan kamu, wahai manusia, berpasang-pasangan; lelaki dan perempuan agar kamu beranak pinak untuk terus mendiami bumi dan memakmurkannya'9. Dan bukankah kami telah pula menjadikan tidurmu untuk istirahat dari kepenatan bekerja di siang hari sehingga kamu bisa kembali bekerja esok hari dengan tenaga baru' tidur laksana kematian sesaat. Bangun tidur merupakan permisalan kecil hari kebangkitan. Mengapa orang musyrik masih saja mengingkari hari kebangkitan'."
  }
]