[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Bacalah (wahai nabi), apa yang diturunkan kepadamu, dengan mengawalinya dengan menyebut nama tuhanmu yang esa dalam penciptaan. Yang menciptakan manusia dari segumpal daging kental yang merah. Bacalah (wahai nabi) apa yang diturunkan kepadamu, sesungguhnya kebaikan tuhanmu banyak,kemurahan NYA melimpah, Yang mengajari makhluk Nya menulis dengan pena, Mengajari manusia apa yang belum diketahuinya, dan memindahkannya dari kegelapan kebodohan menuju cahaya ilmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Bacalah -wahai Rasul- apa yang diwahyukan Allah kepadamu, dimulai dengan membaca nama Rabbmu yang telah menciptakan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Ini merupakan wahyu yang pertama kali turun kepada Nabi Muhammad ketika beliau beribadah di gua Hira. Dalam ayat ini dijelaskan bahwa Nabi yang ‘ummi’ ini akan menjadi orang yang membacakan kitab Allah, meski sebelumnya beliau tidak dapat melakukannya. Allah berfirman: وَمَا كُنتَ تَتْلُوا۟ مِن قَبْلِهِۦ مِن كِتَٰبٍ Dan kamu tidak pernah membaca sebelumnya (Al Quran) sesuatu Kitabpun… (al-Ankabut: 48). Yakni sebelum al-Qur’an diturunkan. Dan yang dimaksud dengan perintah membaca ini adalah membaca al-Qur’an yang diwahyukan kepadanya dan memulainya dengan menyebut nama Allah Sang Pencipta; karena menyebutkan selain-Nya adalah hal yang batil. Karena ini merupakan saat dimulainya dakwah menuju tauhid, maka penting untuk disebutkan sifat yang paling kuat dalam menunjukkan ketauhidan Allah (yaitu Yang Maha Menciptakan). Dalam kata (من علق) menunjukkan awal penciptaan manusia dan tahapan-tahapannya; dan (علق) adalah segumpal darah kental, yang sebelumnya berasal dari air mani laki-laki dan perempuan; kemudian melalui tahap-tahap penciptaan selanjutnya sesuai dengan yang Allah tetapkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1-2. اقْرَأْ بِاسْمِ رَبِّكَ (Bacalah dengan (menyebut) nama Tuhanmu) Hai Muhammad, awalilah bacaanmu dengan nama Tuhanmu. Pendapat lain mengatakan: yakni bacalah dengan meminta pertolongan dengan nama-Nya. الَّذِى خَلَقَ خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ (Yang menciptakan, Dia telah menciptakan manusia dari segumpal darah) Berawal dari air mani, kemudian dengan kuasa Allah menjadi segumpal darah yang membeku."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Jika hati telah lalai dan jahil akan keagungan Rabbnya, dia akan berani melakukan segala yang ia inginkan walau hal itu terlarang, maka bukalah untuk hatimu pintu-pintu pengetahuan tentang tuhanmu dengan cara : memperbanyak mengamati dan mengambil pelajaran dari alam ciptaan Allah ini, dan selalu mentadabburi ayat-ayat yang terkandung dalam kitab-kitab Nya, oleh karena itu Allah memulai kitab-Nya ( al-Qur'an ) pada surah al-'Alaq dengan ( اقرأ ) bacalah yang merupakan pintu segala ilmu. 2 ) . Surah al-'Alaq diawali dengan kata { اقْرَأْ } yaitu kunci ilmu yang dijelaskan dengan ayat : { عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ } , dan dikhiri dengan ayat : { كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِبْ ۩ } dari surah ini dijelaskan bagaimana pedoman kebenaran yang orang-orang yahudi tersesat darinya karena mereka tidak mengetahui kebenaran ini dengan ilmu mereka, dan orang-orang nashrani yang menyembah Allah dengan kebodohan dan kesesatan, maka satu-satunya jalan lurus yang patut bagi setiap orang mengikutinya adalah : menyembah Allah dengan ilmu dan pikiran yang cemerlang. 1-5 1 ) . Pada 5 ayat ini setidaknya ada 9 permasalah yang satu sama lainnya saling berkaitan pada permasalahan sebab-musabab, juga saling berkaitan pada perkara umum dan khusus, serta keterkaitan satu sama lainnya pada pendalilan, pada semuanya adalah merupakan manhaj yang merupaka keistiwaan kita yang mulia ini, dan semua ini juga merupakan perkara yang sangat penting, Ibnu Taimiyah megisyaratkan bahwa surah ini dan surah-surah semisalnya adalah surah-surah yang didalamnya terdapat keajaiban-keajaiban, salah satu pemicunya adalah adanya ayat pertama dalam risalah islam. 2 ) . Pada firman Allah : { اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ } adalah isyarat yang mengajarkan bahwa kunci utama dari kemajuan dan perkembangan suatu peradaban ( dalam pandangan islam ) adalah dengan ilmu pengatahuan, bukan pada kemajuan kekayaan dan kekuatan pertahanan. 3 ) . { اقْرَأْ } \"Bacalah\" Adalah kata pertama yang di wahyukan kepada Rasulullah muhammad, perhatikan isyarat yang terkandung didalamnya, dan susunan hurufnya : قراءة : membaca , : رقي : meninggi , رقية : mengobati, dari tiga kata ini masing-masing memilki sejumlah huruf yang sama, dan maknanya pun saling berkaitan satu sama lainnya, maka قراءة mengandung makna : pintu ilmu ( mebaca ), dan itu merupakan sesuatu yang dapat meninggikan derajat seseorang, dalam ayat Allah berfirman : { يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ } : \"الرفع\" juga berarti \"الرقي\" keduanya berarti tinggi, adapun kata \"الرقية\" berarti pengobatan ruqyah dengan bacaan-bacaan yang diajarkan syari'at, sungguh menakjubkan al-Qur'an ini ! 4 huruf yang merupakan kunci kebahagiaan dunia dan akhirat. 4 ) . Barangsiapa yang mentadabburi al-Qur'an akan jelas baginya bahwa Allah tuhan yang maha agung senantiasa mengingatkan hamba-Nya akan nikmat penciptaan alam semesta, agar mereka senantiasa mengingat dan mensyukuri nikmat yang sangat besar ini, diantara cara mensyukuri nikmat itu adalah : hak Allah atas hamba-Nya dalam penghambaan dan peribadatan hanya kepada-Nya dengan segala macamnya, mengimani adanya hari berbangkit dan hakikat kehidupan akhirat, dan ketetapan hikmah dan keilmuan Allah dalam syari'at-Nya dan kekuasaan-Nya, serta tawadu' yang terus berkelanjutan dan menjauh dari sifat sombong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Mulailah wahai Muhammad bacaan Al-Qur’anmu dengan menyebut nama Tuhanmu, atau meminta pertolongan kepadaNya, yaitu Dzat yang Maha menciptakan segala sesuatu. Penciptaan adalah nikmat yang paling awal. Dia menciptakan manusia dari segumpal darah, yaitu gumpalan darah yang memadat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bacalah dengan menyebut nama Tuhanmu yang menciptakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ini adalah surat pertama yang turun kepada Rasulullah sebagai prinsip-prinsip kenabian pada saat beliau belum mengetahui apa itu al-Quran dan apa itu iman. Jibril mendatangi beliau dengan membawa risalah dan memerintahkan beliau untuk membaca. Lalu Allah menurunkan padanya, “Bacalah dengan (menyebut) nama Rabbmu Yang menciptakan,” yakni menciptakan makhluk secara umum."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dua surah yang memiliki kesesuaian satu sama lainnya, karena pada surah sebelumnya disebutkan bagaimana penentuan kenabian para Nabi yang tiga, dan kenabian Nabi dan Rasul yang terakhir, maka dalam surah ini disebutkan bagaimana Nabi Muhammad diutus, dan dengan apa beliau diutus oleh Allah ﷻ , Allah ﷻ berkata kepada Nabi-Nya dengan perantara Jibril ketika ia datang kepada Rasulullah yang sedang menyendiri bertahannus didalam gua hiro', Jibril datang kepadanya dengan penyamaran sebagai sebagai seorang laki-laki yang beliau tidak mengetahuinya, JIbril berkata kapadanya : Bacalah, Rasul menjawab : aku tidak dapat membaca, Rasulullah tidak dapat membaca dan tidak pula mampu menulis, Allah ﷻ berfirman : { مَا كُنْتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ } ( Sebelumnya kamu tidaklah mengetahui apakah Al Kitab (Al Quran) dan tidak pula mengetahui apakah iman itu ) [ Asy-Syura : 52 ] . Aku tidak mampu membaca, dan aku belum pernah belajar membaca. Kemudian Jibril memeluk Rasulullah yang kedua kalinya, dan berkata : bacalah, Nabi menjawab kembali : aku tidak dapat membaca. Kemudian Jibril kembali memeluk Rasulullah untuk yang ketiga kalinya, dan berkata : { اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ , خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ , اقْرَأْ وَرَبُّكَ الْأَكْرَمُ , الَّذِي عَلَّمَ بِالْقَلَمِ , عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ } , seketika Nabi pun menghafalkan 5 ayat yang dibacakan oleh Jibril, kemudian beliau pulang kerumah dengan rasa takut dan gemetaran terkejut dengan pemandangan yang belum beliau saksikan sebelumnya, dan berkata kepada istrinya Khadijah: \"selimutilah aku, tutuplah aku\" , beliau gemetaran, kemudian khadijah bertanya : \"apa yang terjadi denganmu wahai Muhammad\" , kemudian Nabi Muhammad menjawab : \"aku takut akan diriku\" , beliau kemudian menceritakan apa yang telah terjadi dengn dirinya di gua hiro', khadijah pun menenangkan beliau dan berkata : \"Jangan takut, tapi bergembiralah!. Allah tidak akan merendahkanmu. Sesungguhnya engkau menyambung hubungan keluarga (silaturrahim). Memberikan jamuan kepada tamu serta menolong orang-orang yang tertimpa musibah. Allah tidak akan mengizinkan setan mengganggumu, mereka tidak akan membuatmu tenggelam dalam khayalan. Tidak bisa diingkari lagi, Allah SWT telah memilih engkau untuk memberi petunjuk kepada kaummu.\" Khadijah menunjukkan kepada suaminya sifat mulia yang menandakan bahwa Allah memuliakannya. Selanjutnya Khadijah pergi membawa beliau menemui Waraqah bin Naufal bin Asad bin Abdul Uzza, anak paman Khadijah. Waraqah adalah seorang Arab pemeluk agama Nasrani di zaman Jahiliyah. Ia pandai menulis kitab dalam bahasa Ibrani dan ia pun menulis Injil dengan bahasa Ibrani. Ia seorang tua yang buta. Khadijah berkata kepadanya, “Wahai anak pamanku, dengarkanlah cerita anak saudaramu ini. Waraqah bertanya kepada Nabi, “Wahai anak saudaraku, apakah yang kaulihat?” Lalu beliau menceritakan apa yang beliau lihat dan alami di Gua Hira’. Kemudian Waraqah berkata lagi kepada beliau, “Itulah Namus (Jibril) yang pernah diutus Allah kepada Musa, yakni Jibril yang mereka sebut namus. { اقْرَأْ } Bacalah, membaca adalah kewajiban bagi setiap insan, karena seseorang tidak mampu mempelajari sesuatu sedangkan dia tidak membaca, dan hendaknya bagi setiap orang hal pertama yang dia baca adalah Al-Qur'an, hadits Nabi, kitab Fiqh Ibadah, kitab tentang tauhid, dan kitab fiqh Mu'amalat, membaca kitab tentang agama islam agar memperkuat aqidahnya, sesorang akan mengetahui agamanya dengan banyak membaca. { بِاسْمِ رَبِّكَ } Bacalah dengan mengawali bacaan itu dengan nama Tuhanmu. { الَّذِي خَلَقَ } Ini salah satu sifat Allah ﷻ , yaitu sang pencipta, dan hanya Dialah satu-satunya pencipta alam semesta, tiada pencipta selainnya, walau sekecil semut hitam pun selain Allah tidak akan mampu menciptakannya, Allah ﷻ berfirman : { إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَنْ يَخْلُقُوا ذُبَابًا وَلَوِ اجْتَمَعُوا لَهُ } ( Sesungguhnya segala yang kamu seru selain Allah sekali-kali tidak dapat menciptakan seekor lalatpun, walaupun mereka bersatu menciptakannya ) [ AL-Hajj : 73 ] walau sekalipun seluruh ilmuan dari penjuru dunia berkumpul untuk menciptakan satu ekor lalat yang kecil itu, mereka tidak akan mampu selamanya, karena penciptaan Alam semesta dan seluruh isinya hanya Allah ﷻ yang berhak dan mampu melakukannya, dan hanya Dia ﷻ yang berhak segala peribadatan, Allah ﷻ berfirman : { أَفَمَنْ يَخْلُقُ كَمَنْ لَا يَخْلُقُ ۗ أَفَلَا تَذَكَّرُونَ } ( Maka apakah (Allah) yang menciptakan itu sama dengan yang tidak dapat menciptakan (apa-apa)?. Maka mengapa kamu tidak mengambil pelajaran. ) [ An-Nahl : 17 ] , dan Allah juga berfirman diayat lain : { وَاتَّخَذُوا مِنْ دُونِهِ آلِهَةً لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ } ( Kemudian mereka mengambil tuhan-tuhan selain daripada-Nya (untuk disembah), yang tuhan-tuhan itu tidak menciptakan apapun, bahkan mereka sendiri diciptakan ) [ Al-Furqon : 3 ] . Dalil-dalil diatas menunjukkan keesaan Allah ﷻ , yang tidak berhak selainnya sembahan apapun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ (1) خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ (2) اقْرَأْ وَرَبُّكَ الْأَكْرَمُ (3) الَّذِي عَلَّمَ بِالْقَلَمِ (4) عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ (5) كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَى \" Bacalah dengan (menyebut) nama Tuhanmu Yang menciptakan, Dia telah menciptakan manusia dari segumpal darah.Bacalah, dan Tuhanmulah Yang Maha Pemurah,Yang mengajar (manusia) dengan perantaraan kalam.Dia mengajarkan kepada manusia apa yang tidak diketahuinya. \" Ini adalah ayat-ayat al-Quran alkarim yang pertama-tama turun kepada Rasul shallallaahu 'alaihi wa sallam(1), turun kepada beliau ketika beliau beribadah di gua hiro. Pertama-tama wahyu yang turun kepadanya adalah berupa mimpi saat tidur, dia datang bagai sinar dipagi hari. Maksudnya membenarkan mimpi yang datang kepadanya. Pertama-tama beliau melihat mimpi tersebut bertepatan pada bulan rabii'ul awal, tersisa enam bulan beliau melihat mimpi tersebut, Beliau melihatnya datang seperti munculnya sinar di pagi hari, di bulan romadhon baru turunlah wahyu dalam keadaan sadar. Jarak antara bulan rabiul awal dengan romadhan adalah enam bulan, waktu penurunan wahyu selama 23 tahun, oleh karenanya, dalam sebuah hadits dinyatakan: اَلرُّؤْيَا الصَّالِحَةُ جُزْءُ مِنْ سِتَّةٍ وَأَرْبَعِيْنَ جُزْءًا مِنَ النُّبُوَّةِ \"Mimpi yang baik adalah salah satu dari empat pulun enam bagian kenabian\"(2) Ketika wahyu tersebut datang seperti sinar yang muncul di pagi hari, beliau suka menyendiri, beliau menyendiri dan menjauhi masyarakat jahiliyah. Beliau melihat bahwa tempat terbaik untuk menyendirinya adalah gua tersebut yang berada di gunung hira, gua tersebut terletak di puncak gunung, sangat jarang manusia yang kuat yang mampu mendakinya, melainkan disertai kesulitan. Beliau shallallahu 'alaihi wa sallam mendaki gunung itu lalu menyendiri (dalam rangka ibadah), beliau beribadah kepada Allah dengan apa yang dibukakan oleh Allah di dalam gua ini bebarapa malam, beliau membawa perbekalan berupa makanan dan minuman, kemudian beliau turun lalu membawa perbekalan lagi dari keluarganya, lalu melanjutkan peribadatannya kepada Allah 'Azza Wa Jalla, sampai akhirnya wahyu turun kepada beliau di gua ini. Jibril datang kepadanya, dan memerintahnya untuk membaca, beliau menjawab: Saya tidak bisa membaca. Ini tidak berarti beliau tidak mau taat kepada perintah Jibril, tetapi beliau memang tidak bisa membaca, tidak memiliki keahlian membaca. Beliau shallallaahu 'alaihi wa sallam adalah Ummi (buta huruf), sebagaimana Allah Ta'ala berfirman: فَآمِنُوا بِاللَّهِ وَرَسُولِهِ النَّبِيِّ الْأُمِّيِّ \"maka berimanlah kamu kepada Allah dan Rasul Nya, Nabi yang umi\"(Al-A'raf: 158) dan firman-Nya: هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِنْهُمْ \"Dia-lah yang mengutus kepada kaum yang buta huruf seorang Rasul di antara mereka,\"(Al-Jumu'ah: 2) Beliau tidak bisa membaca dan menulis, dan ini adalah di antara kebijaksanaan Allah, beliau dijadikan tidak bisa membaca dan menulis, sehingga jelas kebutuhannya terhadap risalah ini. Sehingga tidak ada seorang pun yang meragikan kebenarannya. Allah telah mengisyaratkan hal ini dalam firman-Nya: وَمَا كُنْتَ تَتْلُو مِنْ قَبْلِهِ مِنْ كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ إِذًا لَارْتَابَ الْمُبْطِلُونَ \" Dan kamu tidak pernah membaca sebelumnya (Al Qur'an) sesuatu Kitab pun dan kamu tidak (pernah) menulis suatu kitab dengan tangan kananmu; andai kata (kamu pernah membaca dan menulis), benar-benar ragulah orang yang mengingkari (mu).\"(Al-Ankabut: 48) beliau berkata kepada Jibril: مَا أَنَا بِقَارِئٍSaya tidak bisa membaca. Beliau mengatakannya dua atau tiga kali, kemudian Jibril membacakan: اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ (1) خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ (2) اقْرَأْ وَرَبُّكَ الْأَكْرَمُ (3) الَّذِي عَلَّمَ بِالْقَلَمِ (4) عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ \" Bacalah dengan (menyebut) nama Tuhanmu Yang menciptakan, Dia telah menciptakan manusia dari segumpal darah.Bacalah, dan Tuhanmulah Yang Maha Pemurah,Yang mengajar (manusia) dengan perantaraan kalam.Dia mengajarkan kepada manusia apa yang tidak diketahuinya.\" Lima ayat pertama turun kepadanya, karena ayat-ayat ini Nabi shallallaahu 'Alaihi wa sallam bergetar ketakutan hingga beliau pulang kepada Khadijah. Kisah tentang wahyu dan permulaan wahyu terdapat dalam awal kitab shahih Bukhari, siapa saja yang ingin membacanya, silahkan membuka kitab tersebut. Allah 'Azza Wa Jalla berfirman: اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ \"Bacalah dengan (menyebut) nama Tuhanmu Yang menciptakan,\" Firman-Nya: بِاسْمِ رَبِّكَ dikatakan: Maknanya adalah dengan menyertai nama-Nya, dikatakan juga: maknanya adalah meminta pertolongasn dengannya, maksudnya, bacalah dengan meminta pertolongan kepada nama Allah, karena sumua nama-nama Allah baik, seluruhnya adalah pertolangan yang dapat diminta pertolongan dengan menyebutnya oleh manusia. Ia meminta perotolongan dengannya saat hendak wudhu, makan, dan jima', semuanya adalah pertolongan. Dan firman-Nya : بِاسْمِ رَبِّكَ \"dengan nama rabb-Mu\" tidak sama dengan mengatakan bismillaah \"dengan nama Allah\" karena konteksnya membahas tentang rububiyah, mengatur segala perkara, dan memulai risalah (pengutusan Rasul), oleh karenanya Allah berfirman: بِاسْمِ رَبِّكَ \"dengan nama Rabb-mu\" hanya saja beliau shallallaahu 'alaihi wa sallam telah dipelihara secara khusus oleh Allah Ta'ala, dan telah diciptakan dangan penciptaan secara khusus. الَّذِي خَلَقَ Maknanya: Yang telah menciptakan segala sesuatu sebagaimana Allah Ta'ala berfirman: وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا \" dan Dia telah menciptakan segala sesuatu, dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya \"(Al-Furqan: 2) dan firman Allah Ta'ala: اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ عَلَى كُلِّ شَيْءٍ وَكِيلٌ \" Allah menciptakan segala sesuatu dan Dia memelihara segala sesuatu. \"(Az-Zumar: 62) Tidak ada seuatu apa pun di langit dan di bumi, baik tersembunyi mau pun yang terlihat, baik kecil mau pun besar, melainkan Allahlah yang telah menciptakannya, oleh karenanya Allah mengatakan خَلَقَ \"Menciptakan\" Maf'ul bih di sini tidak disebutkan, yang mengisyaratkan luasnya makna, karena menghilangkan maf'ul bih tujuannya adalah meluaskan makna. Karena jika maf'ulnya disebutkan maka fi'il akan terpaut dengannya. Jika dikatakan: Menciptakan begini, maka akan membuahkan makna penciptakan terikat dengan hal tersebut saja. Tetapi jika Allah mengatakan: خَلَقَ \"Dia menciptakan\" dengan mutlak maka maknannya lebih luas, Dialah Yang menciptakan segala sesuatu, jalla wa 'Alaa. (1) Dikeluarkan oleh Bukhari (4) dan Muslim (160) dari hadits Aisyah radhiyallaah 'anha. (2) Dikeluarkan oleh Bukhari (6983) dan Muslim(2264) dari hadits Ubadah Bin Ash-Shamit radhiyallahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 1: 1-2. Allah memulai dalam surat ini dengan memerintahkan Nabi-Nya Muhammad ﷺ untuk membaca Al Qur’an awal pertama kali dengan meminta pertolongan dengan nama Allah yang telah menciptakan segala sesuatu. Kemudian Allah menjelaskan dari sisi kekhususan yaitu Ia yang menciptkan manusia (dan ia adalah makhluk termulia dari semua makhluk) yang diciptkan dari Al Alaq. Dan Alaq adalah darah yang beku yang menempel di rahim, dan darah yang beku ini hasil pertemuan mani yang keluar dari laki-laki dengan ovum yang keluar dari perempuan, dan setelah berkumpul maka jadilah segumpal darah dari keduanya secara bersamaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surah ini adalah surah yang pertama kali turun kepada Rasulullah shallallahu 'alaihi wa sallam; turun pada awal-awal kenabian ketika Beliau tidak mengetahui apa itu kitab dan apa itu iman, lalu Jibril ‘alaihis salam datang kepada Beliau membawa wahyu dan menyuruh Beliau membaca, ia berkata, “Bacalah”. Dengan terperanjat Muhammad shallallahu 'alaihi wa sallam menjawab, “Saya tidak dapat membaca.” Beliau lalu direngkuh oleh Malaikat Jibril hingga merasakan kepayahan, lalu dilepaskan sambil disuruh membacanya sekali lagi, “Bacalah.” Tetapi Muhammad shallallahu 'alaihi wa sallam masih tetap menjawab, “Aku tidak dapat membaca.” Begitulah keadaan berulang sampai tiga kali, dan pada ketiga kalinya Jibril berkata kepadanya, “Bacalah dengan (menyebut) nama Tuhanmu yang Menciptakan--Dia telah menciptakan manusia dari segumpal darah--Bacalah, dan Tuhanmulah yang Maha pemurah--Yang mengajar (manusia) dengan perantaran kalam--Dia mengajar kepada manusia apa yang tidak diketahuinya. (Terj. Al ‘Alaq: 1-5). Yakni yang menciptakan semua makhluk. Pada ayat selanjutnya disebutkan secara khusus manusia di antara sekian ciptaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 1",
    "description": "Wahai nabi, bacalah apa yang Allah wahyukan kepadamu dengan terlebih dahulu menyebut nama tuhanmu yang menciptakan segala sesuatu dengan keesaan-Nya. 2. Dia telah menciptakan manusia yang sempurna bentuk dan pengetahuannya dari segumpal darah, sebagai kelanjutan dari fase nutfah. Setelah itu berturut-turut akan terbentuk sekepal daging, tulang, pelapisan tulang dengan daging, dan peniupan roh."
  }
]