[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-12. Apakah kamu melihat sesuatu yang lebih aneh dari tindakan melampaui batas orang ini,yaitu abu jahal,yang melarang hamba Kami (Muhammad sholallohu alaihi wasallam). Melarang hamba Kami (Muhammad sholallohu alaihi wasallam) untuk shalat kepada tuhannya? Apakah kamu tidak melihat bahwa yang dilarang ternyata berada di pihak yang benar,bagaimana bisa dia melarangnya? Atau dia memerintahakan orang lain untuk bertakwa,apakah dia juga akan melarangnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. hamba Kami Muhammad -ṣallallāhu 'alaihi wa sallam- ketika dia melakukan salat di sisi Kakbah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dia melarang seorang hamba ketika akan shalat, (hamba itu) yaitu nabi Muhammad SAW. Maksudnya adalah apakah dia (Abu Jahal) berhak melarang? Apakah dia (bisa) mengamankannya (Muhammad) dari suatu hukuman?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seorang hamba ketika dia melaksanakan shalat} Apakah kamu melihat orang yang paling melampaui batas yaitu Abu Jahal yang mencegah nabi Muhammad untuk shalat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-14. Allah berfirman untuk orang yang membangkang lagi angkuh ini, “Bagaimana pendapatmu,” wahai orang yang melarang orang untuk shalat, “jika dia,” yakni hamba yang shalat, “berada di atas kebenaran,” yakni mengetahui kebenaran dan mengamalkannya, “atau dia menyuruh” orang lain untuk “bertakwa (kepada Allah), “ patutkah orang yang sifatnya seperti ini dicegah? Bukankah mencegahnya adalah salah satu penentangan terbesar terhadap Allah dan perang terhadap kebenaran? Larangan ini hanya tertuju pada orang yang dirinya sendiri tidak berada di atas petunjuk atau orang yang memerintahkan orang lain agar tidak bertakwa. “Bagaimana pendapatmu jika orang yang melarang itu mendustakan” orang yang melarang kebenaran, “dan berpaling” dari perintah, apakah ia tidak takut kepada Allah dan siksaNya? “Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat” segala perbuatannya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ عَبْدًا } Seorang hamba, yaitu Muhammad ﷺ , Abu jahal melarang Rasulullah ﷺ dari mendirikan shalat di ka'bah, apakah yang menjadi penyebab atas larangan itu ? apakah karena dosa ? , { إِذَا صَلَّىٰ } apakah mendirikan shalat termasuk dosa ? sama sekali tidak... melainkan shalat adalah ibadah, dan itu merupakan kewajiban yang paling utama bagi setiap muslim, akan tetapi kafir ini tidak ingin Rasulullah ﷺ melaksanakn ibadah di tempat itu, sungguh itu adalah sebuah kezhaliman dan dia psti akan binasa di hari kiamat. Abu jahal berkata : \"Jika Muhammad kembali untuk ibadah di tempat itu, maka akan aku penggal lehernya\" , dan Rasulullah ﷺ kembali ketempat itu ( ka'bah ) untuk mendirikan shalat, maka Abu jahal pun bersikeras untuk melaksanakan ancamannya itu akan tetapi Allah menggagalakan rencana itu dengan perantara Malaikat-Nya, sebagaimana yang dikisahkan dalam hadits shahih : (( عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو جَهْلٍ هَلْ يُعَفِّرُ مُحَمَّدٌ وَجْهَهُ بَيْنَ أَظْهُرِكُمْ قَالَ فَقِيلَ نَعَمْ فَقَالَ وَاللَّاتِ وَالْعُزَّى لَئِنْ رَأَيْتُهُ يَفْعَلُ ذَلِكَ لَأَطَأَنَّ عَلَى رَقَبَتِهِ أَوْ لَأُعَفِّرَنَّ وَجْهَهُ فِي التُّرَابِ قَالَ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي زَعَمَ لِيَطَأَ عَلَى رَقَبَتِهِ قَالَ فَمَا فَجِئَهُمْ مِنْهُ إِلَّا وَهُوَ يَنْكُصُ عَلَى عَقِبَيْهِ وَيَتَّقِي بِيَدَيْهِ قَالَ فَقِيلَ لَهُ مَا لَكَ فَقَالَ إِنَّ بَيْنِي وَبَيْنَهُ لَخَنْدَقًا مِنْ نَارٍ وَهَوْلًا وَأَجْنِحَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ دَنَا مِنِّي لَاخْتَطَفَتْهُ الْمَلَائِكَةُ عُضْوًا عُضْوًا )) \"dari Abu Hurairah berkata: Abu Jahal berkata: Apakah Muhammad menundukkan wajahnya (di tanah) di tengah-tengah kalian? Ada yang menjawab: Ya. Ia berkata: Demi Lata dan Uzzah, bila aku melihatnya melakukan seperti itu, aku akan menginjak lehernya atau aku akan benamkan wajahnya di tanah. Abu Hurairah berkata: Ia kemudian mendatangi Rasulullah Shallallahu 'alaihi wa Salam saat beliau tengah shalat, ia hendak menginjak leher beliau. Tidak ada yang mengejutkan mereka selain ia (Abu Jahal) mundur dan melindungi diri dengan tangan. Ada yang bertanya padanya: Kamu kenapa? Ia menjawab: Antara aku dan dia ada parit dari api, huru hara dan banyak sayap. Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Andai ia mendekatiku, malaikat akan menyambar anggota badannya satu per satu.\" [ Hadits Shahih Muslim No. 5005 - Kitab Sifat hari kiamat, surga dan neraka ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "9-10 Kemudian Allah berfirman: أَرَأَيْتَ الَّذِي يَنْهَى (9) عَبْدًا إِذَا صَلَّى \" Bagaimana pendapatmu tentang orang yang melarang, seorang hamba ketika dia mengerjakan salat,\" Yakni: Beritahulah Aku tentang keadaan orang ini , dan engkau heran kepada orang ini yang melarang seorang hamba yang shalat. Dalam ayat ini ada dua orang, orang yang melarang dan orang yang dilarang. Orang yang melarang adalah dedengkot Quraisy yaitu Abu Jahl, dahulu orang Quraisy menjulukinya dengan sebutan Abul-hakam (Juru Kebijaksanaan), karena mereka sering meminta keputusan kepadanya, mereka kembali kepadanya, ia tertipu dengan dirinya sendiri, ia menjauhi islam dan mati dalam keadaan kafir, sebagaimana ini diketahui. Nabi shallallaahu 'alaihi wa sallam menjulukinya Abu Jahal (Juru kebodohan)(1), kebalikan dari julukan yang disematkan Quraisy kepadanya, Abul-Hakam. Sedangkan orang yang dilarang adalah Muhammad shallallaahu 'alaihi wa sallam, dialah hamba dalam firman_Nya عَبْدًا إِذَا صَلَّى \"Seorang hamba saat shalat\" Dikabarkan kepada Abu jahal bahwa Muhammad shalat di sisi ka'bah di hadapan orang orang, menguji manusia dan menghalangi mereka dari patung dan berhala, tuhan-tuhan mereka. Suatu hari Abu Jahal melewati rasulullah shallallaahu 'alaihi wa sallam saat sedang sujud, ia melarang Rasul shallallaahu 'alaihi wa sallam. Abu jahal mengatakan: Saya sudah melarang anda, mengapa anda terus melakukannya? Ia menegur nabi shallallahu 'alaihi wa sallam, lalu ia pulang. Kemudian Abu Jahal diberi kabar bahwa Muhammad shallallaahu 'alaihi wa sallam masih melakukan shalat, maka Abu jahal mengatakan: Demi Allah kalau aku melihatnya, aku akan menginjak lehernya dengan kedua kakiku, dan akan ku taburkan tanah ke wajahnya. Katika suatu hari ia melihat Rasul shallallaahu 'alaihi wa sallam sedang sujud di bawah ka'bah, ia ingin mewujudkan sumpahnya, ketika ia mendekati Rasulullah shallallaahu 'alaihi wa sallam, ia mendapati ada parit api yang menghalanginya dan muncul hal-hal menegerikan lainnya. Tiba-tiba ia terjatuh dan melemah, dan tidak mampu mendekati Rasulullaah shallallaahu 'alaihi wa sallam(2). Seorang hamba yang melarang hamba lainnya untuk shalat, mengherankan dengan kondisinya, bagaimana bisa ia melarangnya shalat? Oleh karenya, datang setelah beberapa ayat berikutnya: أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى \" Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat segala perbuatannya?\" Bahwa Allah akan membalas perbuatannya itu. (1) Lihat: Al-Bukhari (3862) dan Muslim (1800) (2) Dikeluarkan oleh Muslim (2797) dari hadits Abu Hurairah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 10: 9-12. Allah berkata : Allah heran, keheranan apa lagi selain ini wahai orang yang dungu (Abu Jahl) yang melarang Nabi ﷺ shalat di sisi ka’bah. Maka jika Muhammad ﷺ kokoh di atas pendiriannya, atau ia diperintahkan untuk bertakwa kepada Allah, dan takut pada-Nya, maka apakah dibenarkan pendosa ini melarang atas urusan (Muhammad ﷺ)?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang melarang itu ialah Abu Jahal, sedangkan yang dilarang itu adalah Rasulullah shallallahu 'alaihi wa sallam sendiri. Akan tetapi usaha ini tidak berhasil karena Abu Jahal melihat sesuatu yang menakutkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 10",
    "description": "9-10. Wahai rasul atau siapa saja, bagaimana pendapatmu tentang orang yang melarang seorang hamba ketika dia melaksanakan salat' adakah yang lebih mengherankan daripada kelakukan orang (ab' jahl) yang menghalang-halangi hamba-ku (nabi Muhammad) mendekatkan diri kepada tuhan yang telah memberinya kehidupan dan kecukupan'11-12. Bagaimana pendapatmu jika dia yang dilarang salat itu berada di atas kebenaran dan petunjuk dari tuhannya dalam salatnya, atau dia menyuruh orang lain bertakwa kepada Allah untuk kemaslahatan mereka' bukankah amat mengherankan bila orang yang sesat melarang orang yang mendapat pentunjuk untuk melaksanakan perintah tuhannya dan membimbing orang lain ke jalan takwa'."
  }
]