[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-12. Apakah kamu melihat sesuatu yang lebih aneh dari tindakan melampaui batas orang ini,yaitu abu jahal,yang melarang hamba Kami (Muhammad sholallohu alaihi wasallam). Melarang hamba Kami (Muhammad sholallohu alaihi wasallam) untuk shalat kepada tuhannya? Apakah kamu tidak melihat bahwa yang dilarang ternyata berada di pihak yang benar,bagaimana bisa dia melarangnya? Atau dia memerintahakan orang lain untuk bertakwa,apakah dia juga akan melarangnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Bagaimana pendapatmu apabila orang yang dilarang ini ternyata berada di atas petunjuk dan ilmu dari Rabbnya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. أَرَءَيْتَ إِن كَانَ عَلَى الْهُدَىٰٓ (bagaimana pendapatmu jika orang yang melarang itu berada di atas kebenaran) Yakni bagaimana jika hamba yang dilarang mengerjakan shalat, yaitu Muhammad, adalah orang yang berada di jalan yang benar yang menjadi panutan bagi pengikutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kabarkan kepadaku wahai pendengar tentang kondisi orang ini, apakah dia berada di jalan petunjuk?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagaimana pendapatmu kalau dia berada di dalam petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-14. Allah berfirman untuk orang yang membangkang lagi angkuh ini, “Bagaimana pendapatmu,” wahai orang yang melarang orang untuk shalat, “jika dia,” yakni hamba yang shalat, “berada di atas kebenaran,” yakni mengetahui kebenaran dan mengamalkannya, “atau dia menyuruh” orang lain untuk “bertakwa (kepada Allah), “ patutkah orang yang sifatnya seperti ini dicegah? Bukankah mencegahnya adalah salah satu penentangan terbesar terhadap Allah dan perang terhadap kebenaran? Larangan ini hanya tertuju pada orang yang dirinya sendiri tidak berada di atas petunjuk atau orang yang memerintahkan orang lain agar tidak bertakwa. “Bagaimana pendapatmu jika orang yang melarang itu mendustakan” orang yang melarang kebenaran, “dan berpaling” dari perintah, apakah ia tidak takut kepada Allah dan siksaNya? “Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat” segala perbuatannya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tidakkah kamu melihat wahai kafir bahwa Muhammad ﷺ berada diatas kebenaran, maka bagaimana mungkin kamu melarangnya ?!"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَرَأَيْتَ إِنْ كَانَ عَلَى الْهُدَى \" bagaimana pendapatmu jika orang yang melarang itu berada di atas kebenaran,\" Yakni: Baritahu aku wahai lawan bicaraku, jika orang yang sujud ini, Muhammad shallallaahu 'alaihi wa sallam di atas kebenaran, maka mengapa anda melarangnnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 11: 9-12. Allah berkata : Allah heran, keheranan apa lagi selain ini wahai orang yang dungu (Abu Jahl) yang melarang Nabi ﷺ shalat di sisi ka’bah. Maka jika Muhammad ﷺ kokoh di atas pendiriannya, atau ia diperintahkan untuk bertakwa kepada Allah, dan takut pada-Nya, maka apakah dibenarkan pendosa ini melarang atas urusan (Muhammad ﷺ)?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 11",
    "description": "11-12. Bagaimana pendapatmu jika dia yang dilarang salat itu berada di atas kebenaran dan petunjuk dari tuhannya dalam salatnya, atau dia menyuruh orang lain bertakwa kepada Allah untuk kemaslahatan mereka' bukankah amat mengherankan bila orang yang sesat melarang orang yang mendapat pentunjuk untuk melaksanakan perintah tuhannya dan membimbing orang lain ke jalan takwa'11-12"
  }
]