[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-12. Apakah kamu melihat sesuatu yang lebih aneh dari tindakan melampaui batas orang ini,yaitu abu jahal,yang melarang hamba Kami (Muhammad sholallohu alaihi wasallam). Melarang hamba Kami (Muhammad sholallohu alaihi wasallam) untuk shalat kepada tuhannya? Apakah kamu tidak melihat bahwa yang dilarang ternyata berada di pihak yang benar,bagaimana bisa dia melarangnya? Atau dia memerintahakan orang lain untuk bertakwa,apakah dia juga akan melarangnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Atau dia memerintahkan manusia untuk bertakwa kepada Allah dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya, apakah orang yang seperti ini harus dilarang?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. أَوْ أَمَرَ بِالتَّقْوَىٰٓ (atau dia menyuruh bertakwa (kepada Allah)?) Yakni menyuruh untuk berbuat ikhlas, mengesakan Allah, dan mengerjakan amal shalih yang dapat menjauhkan dari api neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Atau dia memerintahkan untuk bertakwa kepada Allah dan takut dengan hukumanNya saat memerintah orang lain untuk meninggalkan ketaatan kepada Allah? Maksudnya adalah bahwa sesungguhnya dia tidak berada di jalan petunjuk dan ketakwaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau menyuruh bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-14. Allah berfirman untuk orang yang membangkang lagi angkuh ini, “Bagaimana pendapatmu,” wahai orang yang melarang orang untuk shalat, “jika dia,” yakni hamba yang shalat, “berada di atas kebenaran,” yakni mengetahui kebenaran dan mengamalkannya, “atau dia menyuruh” orang lain untuk “bertakwa (kepada Allah), “ patutkah orang yang sifatnya seperti ini dicegah? Bukankah mencegahnya adalah salah satu penentangan terbesar terhadap Allah dan perang terhadap kebenaran? Larangan ini hanya tertuju pada orang yang dirinya sendiri tidak berada di atas petunjuk atau orang yang memerintahkan orang lain agar tidak bertakwa. “Bagaimana pendapatmu jika orang yang melarang itu mendustakan” orang yang melarang kebenaran, “dan berpaling” dari perintah, apakah ia tidak takut kepada Allah dan siksaNya? “Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat” segala perbuatannya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Atau dia memerintahkan orang lain menuju kepada kebenaran ? bukankah dia mengajak manusia untuk bertaqwa kepada Allah, dan itu adalah kebanaran yang akan menyelamatkan hidupmu didunia dan diakhirat, orang-orang yang mengajak kepada taqwa berada dalam petunjuk Allah ﷻ , sedangkan kalian wahai orang-orang kafir yang berada dalam kesesatan, kalan memerintah kepada kekafiran dan kesesatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَوْ أَمَرَ بِالتَّقْوَى \" atau dia menyuruh bertakwa (kepada Allah)?\" أَو[Aw] \"atau\" di sini menurut sebagian ahli tafsir bermakna وَ[wa] \"dan\". Maka arti ayat ini: Dan menyuruh bertakwa. Tetapi yang tepat adalah makna sebenarnya yaitu \"atau\". Maknanya: Bagaimana penbdapatmu, jika ia berada di atas petunjuk pada apa-apa yang ia lakukan berupa sujud dan shalat, atau dia memerintah yang lainnya untuk shalat, karena Nabi shallallaahu 'alaihi wa sallam memerintah untuk bertakwa tanpa diragukan, beliau orang shaleh juga orang yang memperbaiki orang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 12: 9-12. Allah berkata : Allah heran, keheranan apa lagi selain ini wahai orang yang dungu (Abu Jahl) yang melarang Nabi ﷺ shalat di sisi ka’bah. Maka jika Muhammad ﷺ kokoh di atas pendiriannya, atau ia diperintahkan untuk bertakwa kepada Allah, dan takut pada-Nya, maka apakah dibenarkan pendosa ini melarang atas urusan (Muhammad ﷺ)?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan demikian, pantaskah orang yang seperti ini keadaannya dilarang? Bukankah melarangnya merupakan penentangan yang besar kepada Allah dan kepada kebenaran? Karena yang berhak dilarang adalah orang yang tidak di atas petunjuk atau memerintahkan orang lain mengerjakan hal yang bertentangan dengan ketakwaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 12",
    "description": "11-12. Bagaimana pendapatmu jika dia yang dilarang salat itu berada di atas kebenaran dan petunjuk dari tuhannya dalam salatnya, atau dia menyuruh orang lain bertakwa kepada Allah untuk kemaslahatan mereka' bukankah amat mengherankan bila orang yang sesat melarang orang yang mendapat pentunjuk untuk melaksanakan perintah tuhannya dan membimbing orang lain ke jalan takwa'13. Bagaimana pendapatmu jika dia yang melarang itu mendustakan nabi serta wahyu Allah dan berpaling dari keimanan dan berbuat kebajikan'."
  }
]