[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-19. Apakah kamu tidak melihat bahwa orang yang melarang ini ternyata kafir dan berpaling dari apa yang dia diajak kepadanya? Tidakkah dia tahu bahwa Allah melihat segala yang dilakukannya? perkaranya tidak seperti yang disangka oleh abu jahal. Bila dia tidak menghentikan penentangan dan gangguannya,niscaya kami akan memegang bagian depan kepalanya dengan keras lalu dia dicampakkan kedalam api yang neraka, Ubun-ubunnya adalah ubun-ubun pendusta dalam ucapannya, salah dalam perbuatannya,maka dusta dan Nampak sudah padanya. Silahkan thaghut ini mendatangkan kaki tangannya yang akan membantunya. Kami akan mengundang malaikat-malaikat azab. Perkaranya tidak seperti yang dikira oleh Abu jahal. dia tidak akan menumpahkan keburukan atasmu (wahai rasul).jangan taati dia dalam apa yang dia minta kepadamu, yaitu meninggalkan shalat. Sujudlah kepada tuhanmu, mendekatlah kepada Nya dengan melakukan perintah Nya dan mentaati Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Tidakkah orang yang melarang seorang hamba dari salat ini tahu bahwa Allah mengetahui perbuatannya, Tidak ada sedikitpun yang tersembunyi dari-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. أَلَمْ يَعْلَم بِأَنَّ اللَّـهَ يَرَىٰ (Tidaklah dia mengetahui bahwa sesungguhnya Allah melihat segala perbuatannya?) Yakni Allah mengetahui segala perbuatannya, kemudian akan membalasnya sesuai perbuatan itu. lalu mengapa ia berani melakukan apa yang telah ia lakukan itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Sungguh ayat ini akan mencabut hati-hati setiap hamba, wahai kalian terus konsisten dalam kemaksiatan, wahai kalian yang senantiasa memasang badan dalam dosa besar, wahai kalian yang lupa kepada tuhan manusia : sesungguhnya Allah maha melihat apa-apa yang kalian perbuat ! 2 ) . Adalah ayat yang mengguncang hati, masuk kedalam dalam diri manusia dan melakukan apa yang tidak dapat dilakukan oleh penguasa didunia seluruhnya, dialah ayat yang menghapuskan segala perasaan buruk dalam diri manusia, dia mengajak kepada perbuatan baik, dan memberikan perasaan yang sempurna akan pengawasan Allah, alangkah baiknya jika setiap hamba menghadirkan ayat ini ketika merasa bahwa matanya sedang berkhianat, atau tangannya yang sedang mencari sesuatu yang haram, atau kakinya yang berjalan menuju kerusakan, dan alangkah indahnya jika setiap dari kita mengahdirkan ayat ini dalam hati ketika hendak melakukan apa yng dipercayakan kepada kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Bukankah pendusta dan pembelot ini tahu bahwa sesungguhnya Allah mengetahui apa yang dia kerjakan. Maksudnya yaitu seharusnya dia tahu bahwa sesungguhnya Allah sangat mengetahui semua yang dia kerjakan dan keadaannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah dia tidak mengetahui bahwa sesungguhnya Allah melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-14. Allah berfirman untuk orang yang membangkang lagi angkuh ini, “Bagaimana pendapatmu,” wahai orang yang melarang orang untuk shalat, “jika dia,” yakni hamba yang shalat, “berada di atas kebenaran,” yakni mengetahui kebenaran dan mengamalkannya, “atau dia menyuruh” orang lain untuk “bertakwa (kepada Allah), “ patutkah orang yang sifatnya seperti ini dicegah? Bukankah mencegahnya adalah salah satu penentangan terbesar terhadap Allah dan perang terhadap kebenaran? Larangan ini hanya tertuju pada orang yang dirinya sendiri tidak berada di atas petunjuk atau orang yang memerintahkan orang lain agar tidak bertakwa. “Bagaimana pendapatmu jika orang yang melarang itu mendustakan” orang yang melarang kebenaran, “dan berpaling” dari perintah, apakah ia tidak takut kepada Allah dan siksaNya? “Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat” segala perbuatannya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَلَمْ يَعْلَمْ } Maka apakah orang kafir ini tidak mengetahui { بِأَنَّ اللَّهَ يَرَىٰ } bahwasanya Allah ﷻ Maha melihat apa yang ia perbuat, Allah ﷻ tidak pernah lengah dari mengawasi setiap garak-gerik hamba-Nya, Allah ﷻ berfirman : { فَلَنَقُصَّنَّ عَلَيْهِمْ بِعِلْمٍ ۖ وَمَا كُنَّا غَائِبِينَ } ( Maka sesungguhnya akan Kami kabarkan kepada mereka (apa-apa yang telah mereka perbuat), sedang (Kami) mengetahui (keadaan mereka), dan Kami sekali-kali tidak jauh (dari mereka). ) [ Al-A'raf : 7 ] akan tetapi mereka tetap tidak takut kepada Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى \" Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat segala perbuatannya?\" Yakni: Melihat yang dilarang sedang bersujud yaitu Muhammad shallallaah 'alaihi wa sallam, ia juga memerintahkan untuk bertakwa, dan melihat hamba yang melampaui batas yang melarang hamba lainnya yang sedang sholat أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى \" Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat segala perbuatannya?\" Allah subhanaahu wa Ta'ala melihat dengan ilmu dan penglihatan. Allah subhaanahu maha melihat segala sesuatu seberapa pun tersembunyi dan samarnya sesuatu itu, mengetahui sejauh apapun dia, seberapa banyak dan sedikitnya ia, mengetahui yang memerintah dan yang melarang, mengetahui yang shalat dan yang sujud, mengetahui yang melampaui batas dan siapa yang tunduk kepada Allah 'Azza Wa Jalla. Setiap insan akan Allah balas sesuai amalannya. Maksud ayat ini adalah teguran bagi hamba yang melarang shalat, dan penjelasan bahwa Allah Ta'ala mengetahui keadaannya, dan keadaan yang melarangnya, Allah akan memabalas keduanya dengan balasan yang sesuai. Ini adalah peringatan bagi seorang laki-laki yang menghalangi Nabi shallallaahu 'alaihi wa sallam untuk shalat, yakniL tidakkah laki-laki ini tahu bahwa Allah Ta'ala melihat dan mengetahuinya, dan Dia Subhaanahu wa Ta'ala meliputi semua malannya, dan akan membalasnya baik di dunia atau pun di dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 14: 13-14. Allah menujukan firman-Nya kepada Nabi-Nya (Muhammad ﷺ), Allah berkata : Kabarkan kepada-Ku wahai Nabi Allah tentang keadaan orang celaka ini yang sesat dimana ia mendustakan ayat-ayat Allah dan menolaknya. Bukankah ia tahu Allah Maha Melihat, Mendengar dan Mengetahui amalannya. Dan ia akan dihisab, jika kebaikan (yang dikerjakan) maka kebaikan pula yang didapat, jika kejelekan maka kejelekan pula yang didapatkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 14",
    "description": "Tidakkah dia yang berbuat demikian jahat itu mengetahui bahwa sesungguhnya Allah melihat dan akan membalas perbuatan jahatnya' Allah maha melihat dan pasti akan memberi balasan dengan seadil-adilnya. 15-16. Dia tidak dibenarkan untuk melarang orang lain melaksanakan salat dan mendekatkan diri kepada Allah. Sekali kali tidak! sungguh, jika dia tidak berhenti berbuat demikian niscaya kami tarik ubun-ubunnya dengan sangat kasar ke arah neraka; yaitu ubun-ubun orang yang mendustakan nabi dan durhaka kepada Allah."
  }
]