[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-19. Apakah kamu tidak melihat bahwa orang yang melarang ini ternyata kafir dan berpaling dari apa yang dia diajak kepadanya? Tidakkah dia tahu bahwa Allah melihat segala yang dilakukannya? perkaranya tidak seperti yang disangka oleh abu jahal. Bila dia tidak menghentikan penentangan dan gangguannya,niscaya kami akan memegang bagian depan kepalanya dengan keras lalu dia dicampakkan kedalam api yang neraka, Ubun-ubunnya adalah ubun-ubun pendusta dalam ucapannya, salah dalam perbuatannya,maka dusta dan Nampak sudah padanya. Silahkan thaghut ini mendatangkan kaki tangannya yang akan membantunya. Kami akan mengundang malaikat-malaikat azab. Perkaranya tidak seperti yang dikira oleh Abu jahal. dia tidak akan menumpahkan keburukan atasmu (wahai rasul).jangan taati dia dalam apa yang dia minta kepadamu, yaitu meninggalkan shalat. Sujudlah kepada tuhanmu, mendekatlah kepada Nya dengan melakukan perintah Nya dan mentaati Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Perkaranya tidak seperti apa yang dibayangkan oleh orang bodoh ini, jika ia tidak berhenti menyakiti hamba-Ku dan mendustakannya, niscaya Kami seret ubun-ubun kepalanya dengan paksa menuju Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Hendaklah orang zalim ini berhenti dari kejahatan-kejahatannya, karena jika tidak maka Kami akan menarik dengan keras ubun-ubunnya dan menyeretnya dengan keras ke dalam neraka, dan dia tidak akan dapat menghindari dari Kami. ubun-ubun itu telah ikut membantu orang pendosa ini sehingga ia layak untuk ikut dihinakan akibat kedustaan dan dosa pemiliknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. كَلَّا لَئِن لَّمْ يَنتَهِ (Ketahuilah, sungguh jika dia tidak berhenti (berbuat demikian)) Ini merupakan ancaman baginya jika ia tidak juga berhenti dari perbuatannya itu. لَنَسْفَعًۢا بِالنَّاصِيَةِ (niscaya Kami tarik ubun-ubunnya) Yakni Kami akan Tarik ubun-ubunnya untuk diseret ke neraka. Makna (الناصية) yakni rambut yang ada di kepalanya bagian depan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15-16. {Kalla}, untuk mencegah orang yang melarang itu, dan seharusnya dia mengendalikan (dirinya). Jika Allah tidak menahan diri karena dia menyakiti utusan kami yaitu Muhammad SAW, sungguh kami akan benar-benar menggenggam ubun-ubunnya dan melemparnya ke neraka. Ubun-ubun adalah ujung rambut kepala. Yaitu ubun-ubun seorang pendusta dan pendosa, maknanya adalah orang yang berbuat dosa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak} perkara itu tidak seperti anggapan Abu Jahal {Sungguh, jika dia tidak berhenti} sungguh jika dia tidak berhenti menyakiti dan mendustakan Muhammad {niscaya Kami tarik ubun-ubunnya} sungguh Kami akan mencabut bagian depan kepalanya dengan keras dan benar-benar melemparkannya ke dalam neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. Kemudian Allah mengancam bila ia terus menerus berada dalam kondisinya seraya berfirman “Ketahuilah, sungguh jika dia tidak berhenti” dari perbuatannya, “niscaya Kami tarik ubun-ubunnya,” yakni Kami akan mencabut ubun-ubunnya secara kasar, dan memang demikian halnya, karena ia adalah “ubun-ubun orang yang mendustakan lagi durhaka”; berdusta dalam perkataannya dan durhaka dalam perbuatannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ كَلَّا لَئِنْ لَمْ يَنْتَهِ } Jika seandainya orang kafir itu belum berhenti dari larangannya, dan juga ancamannya kepada Rasul kami, { لَنَسْفَعًا بِالنَّاصِيَةِ } sungguh pada hari kiamat kami akan angkat ubun-ubunya dengan keras dan kami akan lemparkan dia kedalam neraka jahannam, Allah ﷻ berfirman : { فَيُؤْخَذُ بِالنَّوَاصِي وَالْأَقْدَامِ } ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: كَلَّا لَئِنْ لَمْ يَنْتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ \" Ketahuilah, sungguh jika dia tidak berhenti (berbuat demikian) niscaya Kami tarik ubun-ubunnya,\" Kalla di sini bemakna kepastian, dan mungkin juga benmakna untuk teguran, maksudnya untuk menegur perbuatan buruknya yang ia lakukan terhadap Rasulullah shallallaah 'alaihi wa sallam, atau bermakna pemastian. لَنَسْفَعًا بِالنَّاصِيَةِ \" niscaya Kami tarik ubun-ubunnya,\" Penggalan ayat لَنَسْفَعًا adalah jawaban sumpah yang tersembunyi, dan penjelasannya: Demi Allah jika dia tidak menghentikannya maka kami akan terik ubun-ubunnya, jawab syaratnya disembunyikan dan yang tetap muncul adalah jawab sumpah, karena demikianlah kaedah yang berlaku dalam bahasa Arab, bahwa jika sumpah dan syarat berkumpul maka disembungikan jawaban yang datang terakhir. Ibnu Malik mengatakan dalam alfiyahnya: وَاحْذَفْ لَدَى اجْتِمَاعِ شَرْطٍ وَقَسَمْ جَوَابَ مَا أَخَّرْتَ فَهْوَ مُلْتَزَمْ Dan hapuslah (sembunyikanlah) ketika berkumpulnya syarat dan qosam (sumpah) Jawabannya yang terakhir, ini adalah keharusan... Yang letaknya terakhir di sini adalah syarat لَئِنْ [La in], dan qasam disembunyikan yang terletak sebelumnya. Jika dimunculkan, maka ia berupa kalimat: Demi Allah jika ia tidak menghentikan perbuatannya maka benar-benar akan kami tarik ubun-ubunnya, makna menarik ubun-ubun di sini adalah dengan cara yang kasar, An-nashiyah maknanya adalah bagian depan kepala (ubun-ubun). Jenis alif lam pada النَّاصِيَة [an-Nashiyah] adalah al-'Ahd adz-Dzihni (yang menunjukkan kata an-Nashiyah sudah diketahui maksudnya) dan maksudnya adalah ubun-ubun Abu Jahak, yang mengancam Nabi shallallaahu 'alaihi wasallam karena sholat beliau dan melarang beliau darinya. Makna pengalan ayat ini: Kami benar-benar akan menarik dengan kasar kepalanya Abu jahal, apakah ini dilakukan di dunia atau di akhirat ditarik ubun-ubunnya menuju neraka? Bisa mengandung dua makna tersebut, bisa bermakna bahwa dia ditarik ubun ubunnya, dan dia telah ditarik ubun-ubunya pada saat perang Badr ketika ia terbunuh bersama orang-orang musyrikin yang terbunuh yang lainnya, dan bisa bermakna bahwa ia ditarik ubun-ubunnya untuk dilemparkan ke dalam neraka, sebagaiman Allah berfirman: يُعْرَفُ الْمُجْرِمُونَ بِسِيمَاهُمْ فَيُؤْخَذُ بِالنَّوَاصِي وَالْأَقْدَام \"Orang-orang yang berdosa dikenal dengan tanda-tandanya, lalu dipegang ubun-ubun dan kaki mereka.\"(QS. Ar-Rahman: 41) Jika ayat ini bisa dimaknakan dengan kedua makna tersebut tanpa ada pertentangnan maka wajib dibawa maknanya kepada keduanya semuanya, sebagaimana telah diketahui dan telah kami tetapkan sebelunya, yaitu apabila ayat memiliki dua kemungkinan penafsiran yang tidak saling bertentangan maka wajib keduanya itu diambil semuanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 15: 15-16. Urusannya tidaklah sebagaimana dugaan orang yang celaka ini, Allah bersumpah jika orang yang celaka ini tidak segera mengakhiri kesesatannya yang sudah melewati batas, sunggu Allah akan ambil ubun-ubunya (ia adalah ujung kepala atas yang nampak dari jidatnya), dan sungguh akan merasakan adzab yang pedih. Disebutkan tentang ubun-ubun karena ia adalah yang muncul awal mula berkenaan dengan petunjuk-petunjuk. Ketahuilah wahai Nabi Allah ﷺ, bahwa pemilik ubun-ubun ini tukang dusta, ahli maksiat dan pemilik dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengancamnya jika tetap terus bersikap seperti itu. Maksudnya, memasukkannya ke dalam neraka dengan menarik kepalanya dengan keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 15",
    "description": "15-16. Dia tidak dibenarkan untuk melarang orang lain melaksanakan salat dan mendekatkan diri kepada Allah. Sekali kali tidak! sungguh, jika dia tidak berhenti berbuat demikian niscaya kami tarik ubun-ubunnya dengan sangat kasar ke arah neraka; yaitu ubun-ubun orang yang mendustakan nabi dan durhaka kepada Allah"
  }
]