[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-19. Apakah kamu tidak melihat bahwa orang yang melarang ini ternyata kafir dan berpaling dari apa yang dia diajak kepadanya? Tidakkah dia tahu bahwa Allah melihat segala yang dilakukannya? perkaranya tidak seperti yang disangka oleh abu jahal. Bila dia tidak menghentikan penentangan dan gangguannya,niscaya kami akan memegang bagian depan kepalanya dengan keras lalu dia dicampakkan kedalam api yang neraka, Ubun-ubunnya adalah ubun-ubun pendusta dalam ucapannya, salah dalam perbuatannya,maka dusta dan Nampak sudah padanya. Silahkan thaghut ini mendatangkan kaki tangannya yang akan membantunya. Kami akan mengundang malaikat-malaikat azab. Perkaranya tidak seperti yang dikira oleh Abu jahal. dia tidak akan menumpahkan keburukan atasmu (wahai rasul).jangan taati dia dalam apa yang dia minta kepadamu, yaitu meninggalkan shalat. Sujudlah kepada tuhanmu, mendekatlah kepada Nya dengan melakukan perintah Nya dan mentaati Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Pemilik ubun-ubun itu dusta dalam ucapan dan salah dalam perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. نَاصِيَةٍ كٰذِبَةٍ خَاطِئَةٍ ((yaitu) ubun-ubun orang yang mendustakan lagi durhaka) Yakni pemilik ubun-ubun itu adalah pendusta, pelaku dosa, dan tidak peduli dengan kesalahan-kesalahan yang dilakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15-16. {Kalla}, untuk mencegah orang yang melarang itu, dan seharusnya dia mengendalikan (dirinya). Jika Allah tidak menahan diri karena dia menyakiti utusan kami yaitu Muhammad SAW, sungguh kami akan benar-benar menggenggam ubun-ubunnya dan melemparnya ke neraka. Ubun-ubun adalah ujung rambut kepala. Yaitu ubun-ubun seorang pendusta dan pendosa, maknanya adalah orang yang berbuat dosa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) ubun-ubun orang yang berdusta dan durhaka} dusta perkataannya dan durhaka tindakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. Kemudian Allah mengancam bila ia terus menerus berada dalam kondisinya seraya berfirman “Ketahuilah, sungguh jika dia tidak berhenti” dari perbuatannya, “niscaya Kami tarik ubun-ubunnya,” yakni Kami akan mencabut ubun-ubunnya secara kasar, dan memang demikian halnya, karena ia adalah “ubun-ubun orang yang mendustakan lagi durhaka”; berdusta dalam perkataannya dan durhaka dalam perbuatannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ نَاصِيَةٍ كَاذِبَةٍ } Yaitu ubun-ubun abu jahal yang telah mendustakan agama, { خَاطِئَةٍ } juga telah melakukan kesalah dengan perbuatannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta'ala: نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ \"(yaitu) ubun-ubun orang yang mendustakan lagi durhaka.\" Ubun-ubun di sini adalah badal (kata diulang) dari ubun ubun sebelumnya, ini adalah badal nakirah dari makrifah. Ini boleh dalam bahasa arab. Tujuan menggunakan nakirah [Nashiyatin] adalah untuk menunjukan sifat yang disebutkan setelahnya yaitu firman-Nya: كَاذِبَةٍ خَاطِئَةٍ \"pendusta lagi bersalah\" maksudnya: Yang tersifati dengan sifat dusta, dan tidak idragikan lagi bahwa kedustaan terbesar yang ada adalah yang dilakukan oleh orang-orang kafir, yang berdoa kepada tuhan-tuhan selain Allah, ini adalah perkataan yang palin dusta dan perbuatan yang paling buruk [Khathi-ah] maksudnya: Yang sengaja melakukan kesalahan dosa. Dan perlu diketahui bahwa ada perbedaan anatara Khathi' dan mukhthi' (kedua kata ini berarti bersalah). Al—Khathi' adalah yang sengaja melakukan kesalahan, sedangkan al-Mukhthi': yang melakukan kesalahan karena kebodohan, yang kedua diberi uzhur, sedangkan yang pertama tidak, Allah tabaaraka wa ta'ala berfirman: لَا يَأْكُلُهُ إِلَّا الْخَاطِئُونَ \" Tidak ada yang memakannya kecuali orang-orang yang berdosa. \"(QS. Al-Haqqah: 37) Maksudnya: Orang-orang yang melakukan dosa dengan sengaja. Allah Ta'ala berfirman: رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا \" Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami tersalah \"(QS. Al-Baqarah: 286) Allah menjawab: Aku telah melakukannya. Contoh lainnya: Al-Qasith dan al-Muqsith. Al-Qasith: adalah yang semena-mena, al-Muqsith adalah yang adil, Allah Ta'ala berfirman: وَأَقْسِطُوا إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ \" dan berlaku adillah. Sesungguhnya Allah menyukai orang-orang yang berlaku adil \"(QS. AlHujarat: 9) Dan Allah berfirman: وَأَمَّا الْقَاسِطُونَ فَكَانُوا لِجَهَنَّمَ حَطَبًا \" Adapun orang-orang yang (semena-mena) menyimpang dari kebenaran, maka mereka menjadi kayu api neraka Jahanam \"(QS. Al-Jinn: 15) Dengan demikan amaka makna [khathi-ah] adalah yang melakukan dosa secara sengaja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 16: 15-16. Urusannya tidaklah sebagaimana dugaan orang yang celaka ini, Allah bersumpah jika orang yang celaka ini tidak segera mengakhiri kesesatannya yang sudah melewati batas, sunggu Allah akan ambil ubun-ubunya (ia adalah ujung kepala atas yang nampak dari jidatnya), dan sungguh akan merasakan adzab yang pedih. Disebutkan tentang ubun-ubun karena ia adalah yang muncul awal mula berkenaan dengan petunjuk-petunjuk. Ketahuilah wahai Nabi Allah ﷺ, bahwa pemilik ubun-ubun ini tukang dusta, ahli maksiat dan pemilik dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan, “Ubun-ubun orang yang dusta ucapannya dan salah perbuatannya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 16",
    "description": "15-16. Dia tidak dibenarkan untuk melarang orang lain melaksanakan salat dan mendekatkan diri kepada Allah. Sekali kali tidak! sungguh, jika dia tidak berhenti berbuat demikian niscaya kami tarik ubun-ubunnya dengan sangat kasar ke arah neraka; yaitu ubun-ubun orang yang mendustakan nabi dan durhaka kepada Allah. 17. Apabila azab kami datang kepadanya maka biarlah dia memanggil golongannya yang dia banggakan untuk menyelamatkannya dari azab itu."
  }
]