[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-19. Apakah kamu tidak melihat bahwa orang yang melarang ini ternyata kafir dan berpaling dari apa yang dia diajak kepadanya? Tidakkah dia tahu bahwa Allah melihat segala yang dilakukannya? perkaranya tidak seperti yang disangka oleh abu jahal. Bila dia tidak menghentikan penentangan dan gangguannya,niscaya kami akan memegang bagian depan kepalanya dengan keras lalu dia dicampakkan kedalam api yang neraka, Ubun-ubunnya adalah ubun-ubun pendusta dalam ucapannya, salah dalam perbuatannya,maka dusta dan Nampak sudah padanya. Silahkan thaghut ini mendatangkan kaki tangannya yang akan membantunya. Kami akan mengundang malaikat-malaikat azab. Perkaranya tidak seperti yang dikira oleh Abu jahal. dia tidak akan menumpahkan keburukan atasmu (wahai rasul).jangan taati dia dalam apa yang dia minta kepadamu, yaitu meninggalkan shalat. Sujudlah kepada tuhanmu, mendekatlah kepada Nya dengan melakukan perintah Nya dan mentaati Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Tatkala Kami tarik ubun-ubun kepalanya menuju Neraka, silakan ia memanggil teman-temannya dan anggota kelompoknya, mintalah pertolongan kepada mereka untuk menyelamatkannya dari siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Dan orang pendosa ini telah merayu dan mengajak orang-orang yang berumpul di tempat mereka berkumpul untuk menyakiti dan menzalimi Nabi Muhammad, akan tetapi Allah juga telah memanggil para malaikat azab yang bengis (untuk menghentikannya)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. فَلْيَدْعُ نَادِيَهُۥ (Maka biarlah dia memanggil golongannya (untuk menolongnya)) Yakni memanggil orang-orang yang ada di majelisnya. Makna (النادي) yakni majelis tempat berkumpul orang-orang. Terdapat riwayat mengatakan bahwa Abu Jahal berkata kepada Rasulullah: “Apakah kamu mengancamku, padahal aku adalah orang yang paling banyak pembelanya di kota ini?” Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Maka sebaiknya Abu Jahal memanggil golongannya dan kelompoknya. An-Nadiy adalah tempat perkumpulan, atau suatu kaum yang berkumpul di dalamnya dan inilah yang dimaksud dalam ayat ini. Maksudnya adalah mereka berkumpul di tempat tersebut untuk memerangi orang-orang mukmin. Imam Ahmad, Tirmidzi dan lainnya mengatakan dari Ibnu Abbas yang berkata: “Suatu saat Nabi SAW shalat, kemudian Abu Jahal mendatanginya dan berkata:”Bukankah aku telah melarangmu untuk melakukan hal ini?” Lalu Nabi SAW menegurnya dan Abu Jahal berkata:”Sesungguhnya kau mengerti seberapa banyak kelompok yang dapat aku panggil” kemudian Allah menurunkan ayat ini {Fal yad’u nadiyah …}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Biarlah dia} maka sebaiknya dia menghadirkan {memanggil golongannya} orang yang duduk bersamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. “Maka biarkanlah dia,” orang yang benar-benar tertimpa azab, “memanggil golongannya,” yakni teman-temannya dan orang-orang di sekitarnya agar mereka menolongnya dari azab yang menimpanya. “Kelak Kami akan memanggil malaikat Zabaniyah,” yakni para penjaga Neraka Jahanam untuk menyiksanya. Dan hendaklah ia memperhatikan, manakah di antara kedua golongan yang lebih kuat dan kuasa. Ini adalah kondisi orang yang melarang dan siksaan yang diancamkan padanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka biarlkanlah dia memaggil kelompoknya yang juga menentang Rasulullah ﷺ dan mendustakan agama ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَلْيَدْعُ نَادِيَهُ \" Maka biarlah dia memanggil golongannya (untuk menolongnya)\" Huruf lam disini digunakan untuk menantang, yakni: Jika ia (merasa) benar dan ia punya kekuatan, dan kemampuan maka panggillah nadinya (pendukungnya) Nadi (pendopo) adalah tempat kumpulan orang untuk mengadakan pembicaraan, forum antara mereka. Abu Jahal ditokohkan di kalangan Quraisy, dan ia punya pendopo tempat orang-orang berkumpul bersamanya, mereka membicarakan urusan-urusannya di sana. Maka di sini Allah 'Azza Wajalla menantang, jika ia benar maka ajaklah para pendukungnya. Tidak diragukan lagi bahwa ini adalah tantangan, sebagaimana jika berkata kepada musuh anda: Jika anda punya pendukung maka majulah, dan ungkapana lainnya yang menunjukan tantangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 17: 17-18. Ketika Nabi ﷺ dilarang Abu Jahl ketika ia melarang dari shalat di sisi ka’bah, maka berkata orang yang celaka ini : Atas dasar apa Muhammad menantangku, sedangkan aku adalah orang lembah yang paling banyak ditolong kaumku. Kemudian Allah berkata : Abaikan orang celaka yang sesat ini, dan kaumnya (yang menolongnya) akan diberikan keburukan dari adzab yang pedih, dimana ia akan di letakkan (dalam neraka) dengan sebab kekafirannya dan penolakannya. Maka Kami akan menyeru kepada malaikat yang bengis yang ia menjaga (tempat) manusia di adzab dengan adzab yang sangat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang yang berhak mendapatkan azab itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 17",
    "description": "Apabila azab kami datang kepadanya maka biarlah dia memanggil golongannya yang dia banggakan untuk menyelamatkannya dari azab itu. 18. Kelak kami akan memanggil malaikat zabaniyah yang bengis dan kasar untuk mencampak'kannya ke dalam azab kami dan menyelamatkan nabi beserta para pengikutnya."
  }
]