[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-19. Apakah kamu tidak melihat bahwa orang yang melarang ini ternyata kafir dan berpaling dari apa yang dia diajak kepadanya? Tidakkah dia tahu bahwa Allah melihat segala yang dilakukannya? perkaranya tidak seperti yang disangka oleh abu jahal. Bila dia tidak menghentikan penentangan dan gangguannya,niscaya kami akan memegang bagian depan kepalanya dengan keras lalu dia dicampakkan kedalam api yang neraka, Ubun-ubunnya adalah ubun-ubun pendusta dalam ucapannya, salah dalam perbuatannya,maka dusta dan Nampak sudah padanya. Silahkan thaghut ini mendatangkan kaki tangannya yang akan membantunya. Kami akan mengundang malaikat-malaikat azab. Perkaranya tidak seperti yang dikira oleh Abu jahal. dia tidak akan menumpahkan keburukan atasmu (wahai rasul).jangan taati dia dalam apa yang dia minta kepadamu, yaitu meninggalkan shalat. Sujudlah kepada tuhanmu, mendekatlah kepada Nya dengan melakukan perintah Nya dan mentaati Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Kami akan memanggil Malaikat penjaga Neraka Jahanam yang kasar, yang tidak pernah mendurhakai perintah Allah terhadap mereka dan selalu mengerjakan apa yang diperintahkan kepada mereka. Lalu hendaknya ia melihat, mana dari kedua golongan ini yang lebih kuat dan lebih kuasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. سَنَدْعُ الزَّبَانِيَةَ (kelak Kami akan memanggil malaikat Zabaniyah) Yakni para malaikat yang sangat kejam dan kasar, mereka akan menyeretnya dan melemparnya ke dalam neraka yang bergejolak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Kami akan memanggil malaikat yang sangat kasar. Huruf “wawu” pada kata {sanad’u} dibuang untuk meringankan (bacaan)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kelak Kami akan memanggil malaikat Zabaniah} malaikat yang sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. “Maka biarkanlah dia,” orang yang benar-benar tertimpa azab, “memanggil golongannya,” yakni teman-temannya dan orang-orang di sekitarnya agar mereka menolongnya dari azab yang menimpanya. “Kelak Kami akan memanggil malaikat Zabaniyah,” yakni para penjaga Neraka Jahanam untuk menyiksanya. Dan hendaklah ia memperhatikan, manakah di antara kedua golongan yang lebih kuat dan kuasa. Ini adalah kondisi orang yang melarang dan siksaan yang diancamkan padanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan jika dia memanggil kaumnya, { سَنَدْعُ الزَّبَانِيَةَ } maka kami akan memanggil Malaikat Zabaniyah yang akan mengazab mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "سَنَدْعُ الزَّبَانِيَةَ \" kelak Kami akan memanggil malaikat Zabaniyah,\" maksudnya: Kami mempunyai yang lebih besar dari pendukung orang ini, mereka adalah Zabaniah. Malaikat-malaikat neraka. Allah telah menyebutkan sifat malaikat neraka dengan sifat keras dan kasar, kasar perilakunya dan keras kekuatannya, mereka tidak bermaksiat kepada Allah terhadap apa yang diperintakan kepada mereka, mereka melaksanakan segala apa yang diperintahkan Allah وَيَفْعَلُونَ مَا يُؤْمَرُونَ \"dan mereka melaksanakan apa-apa yang diperintakan kepada mereka\" (QS. At-Tahrim: 6) Mereka tidak lemah dari perintah itu, maka memberikan dua sifat, yaitu bahwa mereka memiliki sifat ketundukan sempurna kepada Allah, mereka tidak bermaksiat kepada apa yang Allah perintahkan, dan mereka mempunyai kemampuan sempurnam mereka malaksanakan apa yang diperintahkan kepada mereka. Dan tidak melaksanan perintah Allah 'Azza Wa Jallah bisa disebabkan karena tidak mampu, dan bisa disebabkan karena maksiat (tidak taaat). Contohnya orang yang tidak shalat dengan berdiri bisa dikarenakan tidak mampu berdiri, dan bisa dikarenakan menentang, maka yang kedua ini dia tidak melaksanakan perintah Allah. Tetapi malaikat-malaikat yang ada di neraka mereka tidak lemah. Mereka memiliki kekuatan dan kemampuan, dan mereka tidak memiliki sifat sombong enggan melaksanakan perintah Allah. Tapi mereka memiliki kerendahan dan kepatuhan yang sempurna (di hadapan Allah). Malaikat-malaikat Zabaniah, tidak mungkin bisa ditandingi oleh para pendukung orang ini selamanya, oleh karenanya Allah berfirman: سَنَدْعُ الزَّبَانِيَةَ \" kelak Kami akan memanggil malaikat Zabaniyah,\" Jika Ada yang bertanya: Mana huruf wau dalam firmannya سَنَدْعُ? Kita jawab: Huruf wau dihapus karena dia berharokat sukun, dan hamzah setelahnya dalah hamzah wasol (yang tidak dibaca saat bersambung) apabila bertemu dua sukun, maka bila dia huruf shahih (selain alif, wau dan ya) dia dibaca kasrah, jika tidak sahih maka dia dihilangkan. Ibnu Malik rahimahullah mengatakan dalam alfiyahnya: إِنْ سَاكِنَانِ الْتَقَيَا اكْسِرْ مَا سَبَقْ وَإِنْ يَكُنْ لَيِّنًا فَحَذْفُهُ اسْتَحَقْ Jika dua sukun bertemu maka kasrahkanlah hurup yang pertama Jika dia huruf layin (illah) maka hilangkanlah itu haknya. Maksudnya: Jika dua sukun bertemu jika huruf yang pertama adalah huruf shahih bukan huruf illah maka dikasrahkan, seperti firman Allah Ta'ala: لَمْ يَكُنِ الَّذِينَ كَفَرُوا \"Tidaklah orang-orang kafir itu\" asalanya adalah لَمْ يَكُنْ karena لم [lam] apabila memasuki fiil mushari' akan menjazemkannya, sebagaimana dalam firman Allah Ta'ala: وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ \" dan tidak ada seorang pun yang setara dengan Dia \" Tetapi jika di sini apabila bertemu dua sukun, dan huruf pertamanya adalah huruf shahih maka bacalah dengan kasrah, sedangkan jika huruf adalah huruf illah maka hilangkanlah sebagaimana dalam ayat ini: سَنَدْعُ الزَّبَانِيَةَ \" kelak Kami akan memanggil malaikat Zabaniyah,\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 18: 17-18. Ketika Nabi ﷺ dilarang Abu Jahl ketika ia melarang dari shalat di sisi ka’bah, maka berkata orang yang celaka ini : Atas dasar apa Muhammad menantangku, sedangkan aku adalah orang lembah yang paling banyak ditolong kaumku. Kemudian Allah berkata : Abaikan orang celaka yang sesat ini, dan kaumnya (yang menolongnya) akan diberikan keburukan dari adzab yang pedih, dimana ia akan di letakkan (dalam neraka) dengan sebab kekafirannya dan penolakannya. Maka Kami akan menyeru kepada malaikat yang bengis yang ia menjaga (tempat) manusia di adzab dengan adzab yang sangat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Malaikat Zabaniyah ialah malaikat yang menyiksa orang-orang yang berdosa di dalam neraka, mereka adalah malaikat yang kasar dan keras, dan sebagai malaikat yang kuat dan berkuasa. Inilah keadaan orang yang melarang dan hukuman yang diancamkan kepadanya. Adapun keadaan orang yang dilarang, maka Allah Subhaanahu wa Ta'aala memerintahkan agar tidak mempedulikan orang tersebut dan tidak menaatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 18",
    "description": "Kelak kami akan memanggil malaikat zabaniyah yang bengis dan kasar untuk mencampak'kannya ke dalam azab kami dan menyelamatkan nabi beserta para pengikutnya. 19. Perbuatan jahat orang itu (ab' jahl) tidak akan mengenai dirimu, wahai nabi. Sekali-kali tidak! janganlah kamu patuh kepadanya. Tetaplah menunaikan salat sesuai perintah tuhanmu dan sujudlah serta dekatkanlah dirimu kepada-Nya dengan menaati aturannya, niscaya dia akan selalu melindungimu dari ancamannya."
  }
]