[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-19. Apakah kamu tidak melihat bahwa orang yang melarang ini ternyata kafir dan berpaling dari apa yang dia diajak kepadanya? Tidakkah dia tahu bahwa Allah melihat segala yang dilakukannya? perkaranya tidak seperti yang disangka oleh abu jahal. Bila dia tidak menghentikan penentangan dan gangguannya,niscaya kami akan memegang bagian depan kepalanya dengan keras lalu dia dicampakkan kedalam api yang neraka, Ubun-ubunnya adalah ubun-ubun pendusta dalam ucapannya, salah dalam perbuatannya,maka dusta dan Nampak sudah padanya. Silahkan thaghut ini mendatangkan kaki tangannya yang akan membantunya. Kami akan mengundang malaikat-malaikat azab. Perkaranya tidak seperti yang dikira oleh Abu jahal. dia tidak akan menumpahkan keburukan atasmu (wahai rasul).jangan taati dia dalam apa yang dia minta kepadamu, yaitu meninggalkan shalat. Sujudlah kepada tuhanmu, mendekatlah kepada Nya dengan melakukan perintah Nya dan mentaati Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Perkaranya tidak sebagaimana yang dikira oleh orang yang zalim ini bahwa ia bisa menimpakan keburukan kepadamu. Maka janganlah engkau menaati perintah ataupun larangannya, bersujudlah kepada Allah dan mendekatlah kepada-Nya dengan ketaatan, sesungguhnya ketaatan itu mendekatkanmu kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Hai Muhammad, janganlah kamu berhenti shalat di Masjidil Haram, dan janganlah kamu takut darinya karena dia tidak akan mampu menyakitimu. Senantiasalah bersujud dan berusaha mendekat kepada keridhaan Allah dengan menegakkan shalat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. سَنَدْعُ الزَّبَانِيَةَ (kelak Kami akan memanggil malaikat Zabaniyah) Yakni para malaikat yang sangat kejam dan kasar, mereka akan menyeretnya dan melemparnya ke dalam neraka yang bergejolak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ilmu yang bermanfaat adalah ilmu yang mendekatkan pemiliknya kepada Allah, yaitu ilmu yang menyadarkan seseorang akan pengawasan sang pencipta, maka perhatikanlah makna terkandung dalam surah ilmu ( surah al-'Alaq ) dimulai dengan kata perintah \" اقرأ\" dan diakhiri dengan perintah \" اقترب\" dan diantara keduanya ada ayat yang menjadi penawar dari segala macam kebodohan dan kelalaian : { أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَىٰ } ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. {Kalla}: untuk mencegah orang yang melarang juga. Jangan kamu patuhi dia wahai Muhammad untuk meninggalkan shalat, melainkan abadikanlah sujudmu, shalatlah kepada Allah dan mendekatlah kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sekali-kali tidak} perkara itu tidak seperti anggapan Abu Jahal {Janganlah mematuhinya, bersujud dan mendekatlah (kepada Allah)} dan merendahkan kepada Tuhanmu dengan berbuat ketaatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Sedangkan kondisi orang yang dilarang, Allah memerintahkannya agar tidak menuruti dan tunduk pada larangan orang durhaka itu seraya berfirman, “Sekali-kali jangan, janganlah kamu patuh kepadanya,” karena ia hanya memerintahkan sesuatu yang menyebabkan kerugian, “dan sujudlah” untuk Rabbmu, “dan dekatkanlah (dirimu kepada Allah),” baik dalam bersujud dan berbagai ketaatan dan amalan-amalan lain yang mendekatkan diri kepada Allah, karena semua itu bisa mendekatkan pada RidhaNya. Ini berlaku secara umum bagi setiap orang yang melarang kebaikan dan yang dilarang melakukan kebaikan meski ayat ini turun berkaitan dengan Abu Jahal ketika melarang Rasulullah shalat dan menyiksa, serta menyakiti beliau."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ كَلَّا لَا تُطِعْهُ } Sekali-kali jangan, janganlah kamu taat kepada perintahnya untuk melarang orang beriman untuk melaksanakan shalat di rumah Allah, { وَاسْجُدْ } dan sujudlah kamu, yakni shalatlah, sujud kerap menjadi ibarat untuk pelaksanaan shalat karena sujud adalah rukun yang paling agung dalam shalat, dan sujud adalah rukun shalat yang disaat itulah hamba akan lebih dekat dengan tuhannya, sebagaimana yang dituliskan dalam sebuah hadits Nabi ﷺ , beliau bersabda : (( عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ «أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاء )) << Abu Hurairah radhiyallahu ‘anhu meriwayatkan bahwa Rasulullah shallallahu ‘alaihi wasallambersabda: “Keadaan paling dekat seorang hamba dari rabbnya adalah ketika dia dalam keadaan sujud, maka perbanyak doa (di dalamnya).” HR. Muslim. >> , maka seseorang yang tidak mendirikan shalat, dia telah menjauhkan dirinya daari tuhannya, dan Allah juga akan menjauh dari dirinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِبْ \" sekali-kali jangan, janganlah kamu patuh kepadanya; dan sujudlah dan dekatkanlah (dirimu kepada Tuhan),\" pernyataan dalam kata [Kallaa] seperti yang dikatakan pada ungkapan sebelumnya, ungkapan dalam firman-Nya: لَا تُطِعْهُ \"Jangan patuhi dia\" Maknanya: Janganlah mematuhi orang ini, yang telah melarangmu dari shalat, tapi sholatlah terus dan jangan memperdulikannya, dan jika Allah melarang nabi-Nya shallallaahu 'alaihi wa sallam dari mematuhi orang ini, maka ini berarti Allah Akan membela nabi-Nya. Yakni: Kerjakanlah apa yang diperintahkan kepadamu, dan jangan pedulikan orang ini, bersujudlah untuk Allah 'Azza Wa Jalla. Yang dimaksudkan dari sujud dalam ayat ini adalah shalat, tetapi sholat diungkapkan dengan kata sujud di sini karena sujud adalah salah satu rukun shalat, sholat tidak akan sah tanpa sujud, oleh karenanya kata sujud sebagai mengungkap (pengganti kata) shalat. Firman Allah: وَاقْتَرِبْ \" dan dekatkanlah \" Maksudnya: Dekatkanlah dirimu dengan Allah Azza Wa Jalla, karena orang yang keadaannya bersujud, adalah keadaan terdekat dengan Rabb-Nya, sebagaimana ini disabdakan oleh Rasulullah shallallaahu 'alaihi wa sallam, beliau bersabda: أَقْرَبُ مَا يَكُوْنُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ \"Keadaan terdekat seorang hamba dengan Rabbnya adalah saati ia dalam keadaan bersujud\" (1) Dan sabda beliau shallallaahu 'alaihi wa sallam: أَلَا إِنِّيْ نُهِيْتُ أَنْ أَقْرَأَ الْقُرْآنَ رَاكِعًا أَوْسَاجِدًا، فَأَمَّا الرُّكُوْعُ فَعَظِّمُوْا فِيْهِ الرَّبَّ، وَأَمَّا السُّجُوْدُ فَأَكْثِرُوْا فِيْهِ مِنَ الدُّعَاءِ فَقَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ \"Ketahuiliah, sesungguhnya aku dilarang memabaca al-Quran saat sujud dan ruku', sedangkan saat ruku' maka agungkanlah Rabb. Sedangkan saat bersuju maka perbanyaklah berdoa, maka ada jaminan doa terkabul untuk kalian\"(2) Yaitu: Sangat berpotensi doa kalian terkabul. Surat ini, surat yang agung Allah memulai dengan surat ini karunia-Nya kepada Rasulnya 'alaihissholaatu wassalaam yang berupa wahyu, kemudian Allah menutupnya dengan sujud dan kedekatan dengan Allah 'Azza Wa jalla. Kita meminta kepada Allah agar mengariakan kepada kita berupa melaksanakan ketaatan kepada-Nya dan kedekatan dengan-Nya, dan menjadikan kita sebagaia wali-wali-Nya yang bertaqwa, dan golongan-Nya yang beruntung, dan hamba-hamba-Nya yang saleh, sesungguhnya Dia Maha kuasa atas segala sesuatu. (1) Dikeluarkan Muslim (482) dari hadita Abu Hurairah radhiyallaahu 'Anhu. (2) Dikeluarkan oleh Muslim (479) dari hadits Ibnu Abbas radhiyallaah 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 19: Ketahuilah wahai Nabi Allah ﷺ bahwa urusannya tidak sebagaimana yang didengungkan orang yang celaka ini yang tidak jelas, yang ia berkata siapa yang mengikuti kaumnya akan ditolong. Sungguh ia dan kaumnya sangat lemah dalam melakukan hal demikian, oleh karenanya tinggalkan olehmu (Muhammad ﷺ) orang celaka ini yang dalam kesesatan dan ketidak jelasan. Dan jangnlah engkau patuh padanya untuk meninggalkan shalat, karena ia tidak akan mampu terus menerus membahayakanmu. Dan teruslah engkau dalam menjaga mengerjakan shalat dimana shalat akan mendekatkan kepada Allah, dan ketahuilah olehmu bahwa Allah akan senantiasa menjagamu dari mereka orang-orang kafir dan musyrik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan meninggalkan shalat, karena ia tidaklah memerintahkan kecuali kepada yang terdapat kerugian di dunia dan akhirat. Yakni shalatlah karena Allah Subhaanahu wa Ta'aala. Dengan bersujud dan dengan menaati-Nya, karena semua itu dapat mendekatkan kamu kepada-Nya. Ayat ini adalah umum berlaku pada orang yang melarang terhadap kebaikan dan dilarang dari melakukannya, meskipun berkenaan dengan Abu Jahal ketika melarang Rasulullah shallallahu 'alaihi wa sallam melakukan shalat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 19",
    "description": "Perbuatan jahat orang itu (ab' jahl) tidak akan mengenai dirimu, wahai nabi. Sekali-kali tidak! janganlah kamu patuh kepadanya. Tetaplah menunaikan salat sesuai perintah tuhanmu dan sujudlah serta dekatkanlah dirimu kepada-Nya dengan menaati aturannya, niscaya dia akan selalu melindungimu dari ancamannya. 1. Al-qur'an adalah kitab suci yang mulia. Sesungguhnya kami telah menurunkannya untuk pertama kali kepada nabi Muhammad di gua hira, atau menurunkannya secara sekaligus dari lau' ma'f'' ke baitul 'izzah di langit dunia, pada malam qadar, malam kemuliaan dan ke agungan."
  }
]