[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Bacalah (wahai nabi), apa yang diturunkan kepadamu, dengan mengawalinya dengan menyebut nama tuhanmu yang esa dalam penciptaan. Yang menciptakan manusia dari segumpal daging kental yang merah. Bacalah (wahai nabi) apa yang diturunkan kepadamu, sesungguhnya kebaikan tuhanmu banyak,kemurahan NYA melimpah, Yang mengajari makhluk Nya menulis dengan pena, Mengajari manusia apa yang belum diketahuinya, dan memindahkannya dari kegelapan kebodohan menuju cahaya ilmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Bacalah -wahai Rasul- apa yang diwahyukan Allah kepadamu, dan Rabbmu itu Mahamulia, tidak ada kemuliaan yang mendekati kemuliaan-Nya, Dia telah berbuat banyak derma dan kebaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-5. Kata (اقرأ) yang kedua ini merupakan penegas perintah yang pertama sebagai perhatian terhadap perintah membaca. Dan Tuhanmu -hai Muhammad- sangat banyak kenikmatan yang telah diberikan; Dia mengajarkan membaca kepada orang-orang yang dapat menulis. Dan ini menghilangkan kekhawatiran Nabi Muhammad karena tidak dapat membaca, karena beliau tidak mempu baca tulis; namun Dzat yang mengajarkan manusia menulis dengan pena pasti mampu mengacarkanmu membaca meski kamu tidak dapat menulis. Hal ini menjadi penenang hati Nabi karena ketidakmampuan menulis tidak menghalanginya untuk membaca, karena Allah telah mengajarkan manusia apa yang belum diketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. اقْرَأْ وَرَبُّكَ الْأَكْرَمُ (Bacalah, dan Tuhanmulah Yang Maha Pemurah) Dan termasuk dari kemurahan-Nya adalah kamu menjadi dapat membaca padahal kamu adalah ‘ummi’."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-5 1 ) . Pada 5 ayat ini setidaknya ada 9 permasalah yang satu sama lainnya saling berkaitan pada permasalahan sebab-musabab, juga saling berkaitan pada perkara umum dan khusus, serta keterkaitan satu sama lainnya pada pendalilan, pada semuanya adalah merupakan manhaj yang merupaka keistiwaan kita yang mulia ini, dan semua ini juga merupakan perkara yang sangat penting, Ibnu Taimiyah megisyaratkan bahwa surah ini dan surah-surah semisalnya adalah surah-surah yang didalamnya terdapat keajaiban-keajaiban, salah satu pemicunya adalah adanya ayat pertama dalam risalah islam. 2 ) . Pada firman Allah : { اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ } adalah isyarat yang mengajarkan bahwa kunci utama dari kemajuan dan perkembangan suatu peradaban ( dalam pandangan islam ) adalah dengan ilmu pengatahuan, bukan pada kemajuan kekayaan dan kekuatan pertahanan. 3 ) . { اقْرَأْ } \"Bacalah\" Adalah kata pertama yang di wahyukan kepada Rasulullah muhammad, perhatikan isyarat yang terkandung didalamnya, dan susunan hurufnya : قراءة : membaca , : رقي : meninggi , رقية : mengobati, dari tiga kata ini masing-masing memilki sejumlah huruf yang sama, dan maknanya pun saling berkaitan satu sama lainnya, maka قراءة mengandung makna : pintu ilmu ( mebaca ), dan itu merupakan sesuatu yang dapat meninggikan derajat seseorang, dalam ayat Allah berfirman : { يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ } : \"الرفع\" juga berarti \"الرقي\" keduanya berarti tinggi, adapun kata \"الرقية\" berarti pengobatan ruqyah dengan bacaan-bacaan yang diajarkan syari'at, sungguh menakjubkan al-Qur'an ini ! 4 huruf yang merupakan kunci kebahagiaan dunia dan akhirat. 4 ) . Barangsiapa yang mentadabburi al-Qur'an akan jelas baginya bahwa Allah tuhan yang maha agung senantiasa mengingatkan hamba-Nya akan nikmat penciptaan alam semesta, agar mereka senantiasa mengingat dan mensyukuri nikmat yang sangat besar ini, diantara cara mensyukuri nikmat itu adalah : hak Allah atas hamba-Nya dalam penghambaan dan peribadatan hanya kepada-Nya dengan segala macamnya, mengimani adanya hari berbangkit dan hakikat kehidupan akhirat, dan ketetapan hikmah dan keilmuan Allah dalam syari'at-Nya dan kekuasaan-Nya, serta tawadu' yang terus berkelanjutan dan menjauh dari sifat sombong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Bacalah : sebagai penegas “Iqra’” yang pertama. Kamu percaya dan meyakini bahwa Tuhanmu adalah yang Maha mulia di antara orang-orang mulia. Di antara kemuliaannya adalah menjadikanmu bisa membaca, sedangkan engkau adalah nabi yang Ummi (tidak bica membaca)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bacalah. dan Tuhanmu Dzat Yang Maha Mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. kemudian Allah berfirman, “Bacalah, dan Rabbmu-lah Yang Paling Pemurah,” yakni Yang banyak dan luas sifatNya, sangat pemurah dan baik, luas dermaNya yang di antaranya adalah mengajarkan berbagai macam ilmu dan “mengajar (manusia) dengan perantaraan pena. Dia mengajarkan kepada manusia apa yang tidak diketahuinya,” allah mengeluarkan manusia dari perut ibunya dalam keadaan tidak mengetahui apa pun dan Allah membuatkan pendengaran, penglihatan dan hati serta mempermudah baginya sebab-sebab ilmu. Allah mengajarkan al-Quran, al-Hikmah (hadist) dan mengajarkan melalui perantara pena yang dengannya berbagai ilmu terpelihara, hak-hak terjaga, dan menjadi utusan-utusan untuk manusia sebagai pengganti bahasa lisan mereka. Segala puji dan karunia hanya milik Allah semata yang diberikan pada para hambaNya yang tidak mampu mereka balas dan syukuri. Kemudian Allah menganugerahkan kecukupan dan keluasan rizki kepada mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Bacalah wahai Rasul, sesungguhnya Tuhanmu Maha pemurah, dan diantara kebaikan Allah ﷻ , ialah dengan mewahyuan kepadamu dan mengajarkanmu agar kamu memberi peringatan dan memberi kabar gembira,"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "اقْرَأْ وَرَبُّكَ الْأَكْرَمُ \" Bacalah, dan Tuhanmulah Yang Maha Pemurah,\" اقْرَأْ Bacalah. Ini adalah pengulangan dari perintah pertama, tetapi apakah dia taukid (kata penegasan) atau kata ta'sis (tidak ada kaitannya)? Yang benar: bahwa ini adalah kata ta'sis, dan yang pertama اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ \" Bacalah dengan (menyebut) nama Tuhanmu Yang menciptakan,\" Disandingkan dengan rububiyah Allah, dan اقْرَأْ وَرَبُّكَ الْأَكْرَمُ (3) الَّذِي عَلَّمَ بِالْقَلَمِ \" Bacalah, dan Tuhanmulah Yang Maha Pemurah, Yang mengajar (manusia) dengan perantaraan qalam (pena).\" Disandingkan dengan syara'. Yang pertama berkaitan dengan ketentuan taqdir, yang kedua berkaitan dengan syari'at, karena mengajar dengan pena, penjelasan syari'at banyak bertumpu dengannya, yakni syari'at dengan menulis dan menghafal, sedangkan Al-Quran ditulis dan dihafal, dan sunnah ditulis dan dihafal juga, ucapan para ulama, ditulis dan dihafal juga, oleh karenanya Allah mengulanginya dua kali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 3: 3-5. Kemudian Allah ulang untuk supaya (Muhammad ﷺ) membaca, Allah berkata : Bacalah wahai Nabi Allah karena sesungguhnya Rabbmu Maha Pemurah. Dan diantara kemurahan-Nya adalah mengajarkan manusia membaca dan menulis dengan pena. Tak diragukan lagi bahwa pena adalah alat menulis dimana kita bukukan pengetahuan-pengetahuan atas apa yang dengannya kitab-kitab samawiyyah (juga) ditulis; Yang dengannya dibangunlah peradaban-peradaban, oleh karena itu ia adalah nikmat dari sebesar-besar nikmat Allah bagi manusia. Dan dari kemurahan-Nya juga adalah Allah mengajarkan manusia yang sebelumnya dalam keadaan bodoh dari bermacam-macam jenis bidang dan ilmu, yang itu menjadi sebab keluarnya manusia dari kegelapan (kebodohan) menuju cahaya ilmu dan pengetahuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni banyak dan luas sifat-Nya, banyak kemuliaan dan ihsan-Nya, luas kepemurahan-Nya, dimana di antara kemurahan-Nya adalah mengajarkan berbagai ilmu kepada manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 3",
    "description": "Wahai nabi, bacalah firman yang Allah turunkan kepadamu, dan tuhanmulah yang mahamulia. Dia membagi kemurahan-Nya kepada semua makhluk. Di antara kemurahan-Nya adalah menjadikan manusia bisa membaca, menulis, dan mempelajari ilmu pengetahuan. 4. Tuhanmu itulah yang mengajar manusia menulis dengan perantaraan pena atau alat tulis lain. Tulisan berguna untuk menyimpan dan menyebarkan pesan serta ilmi pengetahuan kepada orang lain."
  }
]