[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Bacalah (wahai nabi), apa yang diturunkan kepadamu, dengan mengawalinya dengan menyebut nama tuhanmu yang esa dalam penciptaan. Yang menciptakan manusia dari segumpal daging kental yang merah. Bacalah (wahai nabi) apa yang diturunkan kepadamu, sesungguhnya kebaikan tuhanmu banyak,kemurahan NYA melimpah, Yang mengajari makhluk Nya menulis dengan pena, Mengajari manusia apa yang belum diketahuinya, dan memindahkannya dari kegelapan kebodohan menuju cahaya ilmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Mengajari manusia apa-apa yang sebelumnya tidak diketahuinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ (Dia mengajar kepada manusia apa yang tidak diketahuinya) Allah mengajari manusia dengan pena sesuatu yang tidak dia ketahui sebelumnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-5 1 ) . Pada 5 ayat ini setidaknya ada 9 permasalahan yang satu sama lainnya saling berkaitan pada permasalahan sebab-musabab, juga saling berkaitan pada perkara umum dan khusus, serta keterkaitan satu sama lainnya pada pendalilan, pada semuanya adalah merupakan manhaj yang merupaka keistiwaan kita yang mulia ini, dan semua ini juga merupakan perkara yang sangat penting, Ibnu Taimiyah megisyaratkan bahwa surah ini dan surah-surah semisalnya adalah surah-surah yang didalamnya terdapat keajaiban-keajaiban, salah satu pemicunya adalah adanya ayat pertama dalam risalah islam. 2 ) . Pada firman Allah : { اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ } adalah isyarat yang mengajarkan bahwa kunci utama dari kemajuan dan perkembangan suatu peradaban ( dalam pandangan islam ) adalah dengan ilmu pengatahuan, bukan pada kemajuan kekayaan dan kekuatan pertahanan. 3 ) . { اقْرَأْ } \"Bacalah\" Adalah kata pertama yang di wahyukan kepada Rasulullah muhammad, perhatikan isyarat yang terkandung didalamnya, dan susunan hurufnya : قراءة : membaca , : رقي : meninggi , رقية : mengobati, dari tiga kata ini masing-masing memilki sejumlah huruf yang sama, dan maknanya pun saling berkaitan satu sama lainnya, maka قراءة mengandung makna : pintu ilmu ( mebaca ), dan itu merupakan sesuatu yang dapat meninggikan derajat seseorang, dalam ayat Allah berfirman : { يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ } : \"الرفع\" juga berarti \"الرقي\" keduanya berarti tinggi, adapun kata \"الرقية\" berarti pengobatan ruqyah dengan bacaan-bacaan yang diajarkan syari'at, sungguh menakjubkan al-Qur'an ini ! 4 huruf yang merupakan kunci kebahagiaan dunia dan akhirat. 4 ) . Barangsiapa yang mentadabburi al-Qur'an akan jelas baginya bahwa Allah tuhan yang maha agung senantiasa mengingatkan hamba-Nya akan nikmat penciptaan alam semesta, agar mereka senantiasa mengingat dan mensyukuri nikmat yang sangat besar ini, diantara cara mensyukuri nikmat itu adalah : hak Allah atas hamba-Nya dalam penghambaan dan peribadatan hanya kepada-Nya dengan segala macamnya, mengimani adanya hari berbangkit dan hakikat kehidupan akhirat, dan ketetapan hikmah dan keilmuan Allah dalam syari'at-Nya dan kekuasaan-Nya, serta tawadu' yang terus berkelanjutan dan menjauh dari sifat sombong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Dzat yang mengajarkan manusia menulis dengan pena, dan itu adalah kenikmatan yang agung dari Allah SWT. Allah mengajarkan manusia dengan pena yang belum pernah mereka ketahui sebelumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia mengajarkan manusia apa yang tidak diketahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. kemudian Allah berfirman, “Bacalah, dan Rabbmu-lah Yang Paling Pemurah,” yakni Yang banyak dan luas sifatNya, sangat pemurah dan baik, luas dermaNya yang di antaranya adalah mengajarkan berbagai macam ilmu dan “mengajar (manusia) dengan perantaraan pena. Dia mengajarkan kepada manusia apa yang tidak diketahuinya,” allah mengeluarkan manusia dari perut ibunya dalam keadaan tidak mengetahui apa pun dan Allah membuatkan pendengaran, penglihatan dan hati serta mempermudah baginya sebab-sebab ilmu. Allah mengajarkan al-Quran, al-Hikmah (hadist) dan mengajarkan melalui perantara pena yang dengannya berbagai ilmu terpelihara, hak-hak terjaga, dan menjadi utusan-utusan untuk manusia sebagai pengganti bahasa lisan mereka. Segala puji dan karunia hanya milik Allah semata yang diberikan pada para hambaNya yang tidak mampu mereka balas dan syukuri. Kemudian Allah menganugerahkan kecukupan dan keluasan rizki kepada mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ } Dia ﷻ mengajarkan hamba-Nya apa yang tidak dia ketahui, manusia diawal penciptaannya di rahim ibu tidak mengetahui sesuatu apapun, Allah ﷻ berfirman : { وَاللَّهُ أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۙ لَعَلَّكُمْ تَشْكُرُونَ } ( Dan Allah mengeluarkan kamu dari perut ibumu dalam keadaan tidak mengetahui sesuatupun, dan Dia memberi kamu pendengaran, penglihatan dan hati, agar kamu bersyukur. ) [ An-Nahl : 78 ] , Allah mengajarkanmu apa yang tidak kamu ketahui wahai Rasul, Allah ﷻ berkata kepada Nabi-Nya : { وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ ۚ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا } ( dan telah mengajarkan kepadamu apa yang belum kamu ketahui. Dan adalah karunia Allah sangat besar atasmu. ) [ An-Nisa 113 ] , ini adalah nikmat Allah kepada Nabi-Nya. { عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ } Allah mengajarkanmu ilmu syari'at yang dengannya kamu memahami islam yang mulia ini, dan juga ilmu duniawi yang dengannya pula kamu meraih kemaslahatan duniamu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 5: 3-5. Kemudian Allah ulang untuk supaya (Muhammad ﷺ) membaca, Allah berkata : Bacalah wahai Nabi Allah karena sesungguhnya Rabbmu Maha Pemurah. Dan diantara kemurahan-Nya adalah mengajarkan manusia membaca dan menulis dengan pena. Tak diragukan lagi bahwa pena adalah alat menulis dimana kita bukukan pengetahuan-pengetahuan atas apa yang dengannya kitab-kitab samawiyyah (juga) ditulis; Yang dengannya dibangunlah peradaban-peradaban, oleh karena itu ia adalah nikmat dari sebesar-besar nikmat Allah bagi manusia. Dan dari kemurahan-Nya juga adalah Allah mengajarkan manusia yang sebelumnya dalam keadaan bodoh dari bermacam-macam jenis bidang dan ilmu, yang itu menjadi sebab keluarnya manusia dari kegelapan (kebodohan) menuju cahaya ilmu dan pengetahuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena manusia dikeluarkan-Nya dari perut ibunya dalam keadaan tidak tahu apa-apa, lalu Dia menjadikan untuknya pendengaran, penglihatan dan hati serta memudahkan sebab-sebab ilmu kepadanya. Dia mengajarkan kepadanya Al Qur’an, mengajarkan kepadanya hikmah dan mengajarkan kepadanya dengan perantaraan pena, dimana dengannya terjaga ilmu-ilmu. Maka segala puji bagi Allah yang telah mengaruniakan nikmat-nikmat itu yang tidak dapat mereka balas karena banyaknya. Selanjutnya Allah Subhaanahu wa Ta'aala mengaruniakan kepada mereka kekayaan dan kelapangan rezeki, akan tetapi manusia karena kebodohan dan kezalimannya ketika merasa dirinya telah cukup, ia malah bertindak melampaui batas dan berbuat zalim serta bersikap sombong terhadap kebenaran seperti yang diterangkan dalam ayat selanjutnya. Ia lupa, bahwa tempat kembalinya adalah kepada Tuhannya, dan tidak takut kepada pembalasan yang akan diberikan kepadanya, bahkan keadaannya sampai meninggalkan petunjuk dengan keinginan sendiri dan mengajak manusia untuk meninggalkannya, dan sampai melarang orang lain menjalankan shalat yang merupakan amal yang paling utama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 5",
    "description": "Dia mengajarkan manusia apa yang tidak diketahuinya. Manusia adalah makhluk yang potensial untuk berkarya melalui ilmu pengetahuan yang diperolehnya dari Allah. Manusia belajar baik dari alam sekitar yang merupakan ciptaan-Nya maupun dari wahyu yang Allah sampaikan melalui para rasul. 6-7. Manusia sangat bangga dengan materi sehingga tidak segan berbuat zalim. Sekali kali tidak boleh demikian! sungguh, manusia itu benar-benar melampaui batas apabila melihat dirinya serba cukup dengan harta, jabatan, pengikut, dan semisalnya. Apa yang dimiliki membuatnya mudah mengingkari nikmat Allah dan lupa bahwa semua adalah anugerah-Nya."
  }
]