[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Benar, bahwa manusia melampaui batas-batas Allah. Manakala dia memiliki kekayaan. Maka hendaknya setiap orang yang melampaui batas menyadari bahwa tempat kembali adalah Allah, lalu Dia membalas setiap orang sesuai dengan amalnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sungguh, orang yang jahat semisal Abu Jahal telah melampaui batas dalam melanggar batasan-batasan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Sungguh tabiat manusia adalah melanggar ketentuan Allah dan merasa angkuh jika telah menganggap dirinya sangat kaya, kecuali orang yang mendapat arahan dari agamanya. Hal ini karena jiwa yang lemah akan berkata kepada dirinya bahwa dia tidak membutuhkan orang lain, sehingga dia mulai berbuat zalim dan semena-mena, dan tidak peduli dengan apapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6-7. أَن رَّءَاهُ اسْتَغْنَىٰٓ كَلَّآ إِنَّ الْإِنْسَانَ لَيَطْغَىٰٓ (Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas karena dia melihat dirinya serba cukup) Yakni dia akan bersikap sewenang-wenang jika memandang dirinya memiliki kekayaan dan kekuatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ) .Diantara macam-macam kezhaliman adalah kezhaliman dengan ilmu, seseorang terkadang jika ia merasa ilmunya bertambah perasaan itu membawanya kepada perbuatan yang sewenang-wenang dengan merendahkan siapapun selainnya, sama halnya dengan hakim yang menetapkan suatu hukum tetapi menyalahi ketetapan syari'at, yakni ia menetapkan suatu hukum tanpa keadilan, padahal telah ditetapkan dalam syari'at bahwa seorang hakim wajib dalam penetapan suatu hukum menetapkannya dengan seadil-adilnya, dan tidak dengan hawa nafsu. 2 ) . Dan diantara sebab-sebab paling bahaya yang menyebabkan manusia terbawa kepada kezhaliman dan melampaui batasa adalah : kekayaan dan sikap manusia yang menerima semua tawaran dunia sedangkan ia lupa dengan tuhannya dan hari berbangkit untuk menghadap-Nya, perhatikanlah 3 ayat ini : { كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَىٰ , أَنْ رَآهُ اسْتَغْنَىٰ , إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ } \" Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas , karena dia melihat dirinya serba cukup , Sesungguhnya hanya kepada Tuhanmulah kembali(mu)\" , maka barangsiapa yang dalam dirinya berkumpul sebab-sebab kezhaliman diatas, maka sungguh kebinasaan telah menghampirinya dari segala sisi jika saja tuhannya tidak menyelamatkannya dengan rahmat dantaufiq-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. {Kalla}: disini bermakna benar bahwa sesungguhnya manusia sering melampaui batas dalam berbuat maksiat. Ayat ini diturunkan untuk Abu Jahal yang berkata: “Sungguh jika aku melihat Muhammad melakukan shalat, akun akan menginjak lehernya dan menempelkan wajahnya ke tanah” Lalu turunlah ayat ini dan setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak} tentu saja {Sesungguhnya manusia itu benar-benar melampaui batas} benar-benar melampaui batas-batas Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-8. Tapi manusia karena kebodohan dan kezhalimannya bila melihat dirinya kaya, ia bertindak melampaui batas dan berbuat keji, sombing terhadap petunjuk dan lupa bahwa kepada Rabbnyalah ia “kembali” dan tidak takut akan pembalasan. Bahkan sampai pada kondisi meninggalkan petunjuk dan menyerukan orang lain untuk meninggalkannya, lalu melarang shalat yang merupakan amalan iman terbaik."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ketahuilah, bahwasnya manusia itu benar-benar melampaui batas, yakni orang-orang kafir yang enggan beriman kepada Allah ﷻ Tuhan semesta alam, padahal kenikmatan yang mereka telah berhura-hura dengannya sangat melimpah, sungguh mereka telah melampaui batas yang telah ditetapkan oleh Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah Ta'ala berfirman: كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَى \" Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas, كَلَّا [kalla] dalam al-Quran datang dengan beberapa kandungan makna, di antaranya bermakna haqqan (benar-benar) maka kata kalla dalam ayat ini bermakna \"benar-benar\" yakni: Bahwa Allah Ta'ala menetapkan ketetapan yang tidak ada keraguan di dalamnya أَنْ رَآهُ اسْتَغْنَى (7) إِنَّ إِلَى رَبِّكَ الرُّجْعَى \" Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas,. karena dia melihat dirinya serba cukup. \" Manusia di sini tidak dimaksudkan orang tertentu, tetapi maksudnya adalah al-Jins, setiap insan dari anak-anak Adam, jika ia memandang dirinya sudah merasa cukup (tidak butuh) maka ia akan melampaui batas, karena dia sudah merasa tidak butuh lagi kepada rahmat Allah, ia pun melampaui batas dan tidak peduli. Jika ia telah dicukupkan dengan kesehatan ia akan lupa sakit, jika ia telah dicukupkan dengan kenya ia akan lupa rasa lapar, jika ia dicukupkan pakaiannya maka ia akan lupa saat telanjang. Dan begitulah seterusnya, telah menjadi tabi'at manusia melampaui batas ketika ia melihat dirinya sudah lapang, tetapi berbeda dengan orang yang beriman, karena orang yang beriman. Karena orang yang beriman tidak akan pernah merasa selalu butuh kepada Allah walau sekejap mata, ia senantiasa merasa butuk kepada Allah 'Azza Wa jalla, ia kan meminta kepada Rabbnya di setiap kebutuhannya, bersandar kepada Allah saat menghadapi yang ia tidak sukai. Dan ia memandang jika Allah menggantungkan dirinya kepada dirinya sendiri, maka sebenarnya ia telah menggantungkan kepada yang lemah dan kekurangan, dan ia tidak berkuasa untuk dirinya baik dalam memberi manfaat atau menepis bahaya. Inilah orang yang beriman. Tetapi jika dilihat secara tabiat asal manusia, ia melampaui batas, ini seperti dalam firman Allah ta'ala: وَحَمَلَهَا الْإِنْسَانُ إِنَّهُ كَانَ ظَلُومًا جَهُولًا \" dan dipikullah amanat itu oleh manusia. Sesungguhnya manusia itu amat lalim dan amat bodoh,\"(Al-Ahzab: 72)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 6: 6-8. Allah jelaskan sebab-sebab yang menjadikan manusia melampaui batas, Allah berkata : Sungguh benar manusia adalah bodoh, sesat ketika membolehkan (atas dirinya) melampaui batas dalam menerobos aturan dan kemaksiatan jika dirinya merasa bahwa telah memiliki banyak harta, kaya, dan memiliki kedudukan serta (berbangga) dengan kaum. Lalu Allah menegur manusia yang membolehkan (dirinya) dari menerobos batasan dan kabar (dari Allah) yang berkaitan dengan akhir kehidupannya yang kembali kepada Allah. Manusia tidak memiliki Rabb lain sebagai alternatif dan juga sebagai tempat berlindung, dan akan dibalas baginya atas perbuatannya dan ucapannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Abu Hurairah radhiyallahu 'anhu ia berkata: Abu Jahal berkata, “Apakah (kalian biarkan) Muhammad menaruh wajahnya (bersujud) di tengah-tengah kalian?” Lalu dikatakan, “Ya.” Maka Abu Jahal berkata, “Demi Lata dan ‘Uzza, jika aku melihatnya sedang melakukan hal itu, maka aku akan injak lehernya atau aku lumuri mukanya dengan debu.” Abu Hurairah berkata, “Maka Abu Jahal mendatangi Rasulullah shallallahu 'alaihi wa sallam ketika Beliau sedang shalat karena menyangka akan dapat menginjak leher Beliau. Lalu ia (Abu Jahal) membuat mereka (kawan-kawannya) kaget karena ternyata mundur ke belakang dan menjaga dirinya dengan kedua tangannya. Ia pun ditanya, “Ada apa denganmu?” Abu Jahal berkata, “Sesungguhnya antara aku dengan dia (Nabi Muhammad shallallahu 'alaihi wa sallam) ada parit dari api, hal yang menakutkan, dan sayap-sayap.” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Kalau sekiranya ia mendekat kepadaku, tentu malaikat-malaikat akan merenggut anggota badannya sepotong demi sepotong.” Maka Allah ‘Azza wa Jalla menurunkan ayat - kami tidak mengetahui apakah dalam hadits Abu Hurairah atau sesuatu yang sampai kepadanya-, “Ketahuilah! Sungguh, manusia benar-benar melampaui batas,-- apabila melihat dirinya serba cukup.-- Sungguh, hanya kepada Tuhanmulah tempat kembali(mu).-- Bagaimana pendapatmu tentang orang yang melarang,-- seorang hamba ketika dia melaksanakan shalat,-- Bagaimana pendapatmu jika dia (yang dilarang shalat itu) berada di atas kebenaran (petunjuk),-- seorang hamba ketika dia melaksanakan shalat-- Bagaimana pendapatmu jika dia (yang dilarang shalat itu) berada di atas kebenaran (petunjuk),-- atau dia menyuruh bertakwa (kepada Allah)?-- Bagaimana pendapatmu jika dia (yang melarang) itu mendustakan dan berpaling?—Yaitu Abu Jahal--- Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat (segala perbuatannya)?-- Sekali-kali tidak! Sungguh, jika dia tidak berhenti (berbuat demikian) niscaya Kami tarik ubun-ubunnya (ke dalam neraka),-- (yaitu) ubun-ubun orang yang mendustakan dan durhaka.-- Maka biarlah dia memanggil golongannya (untuk menolongnya),-- kelak Kami akan memanggil Malaikat Zabaniyah,-- Sekali-kali jangan! Janganlah kamu patuh kepadanya;…dst.” (Terj. Al ‘Alaq: 6-19) Kalimat, “Kami tidak mengetahui apakah dalam hadits Abu Hurairah atau sesuatu yang sampai kepadanya,” menurut Syaikh Muqbil merupakan keragu-raguan yang dapat mencacatkan keshahihan sebab turunnya, akan tetapi ia tetap mencantumkannya karena banyak syahid-syahidnya. Hadits tersebut menurut Ibnu Katsir, diriwayatkan pula oleh Ahmad bin Hanbal, Muslim, Nasa’i dan Ibnu Abi Hatim dari hadits Mu’tamir bin Sulaiman. Hadits tersebut juga diriwayatkan oleh Ibnu Jarir dan Baihaqi dalam Dalaa’ilun Nubuwwah. Imam Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas ia berkata, “Nabi shallallahu 'alaihi wa sallam shalat, lalu Abu Jahal datang dan berkata, “Bukankah kamu telah aku larang melakukan hal ini (shalat)? Bukankah kamu telah aku larang melakukan hal ini (shalat)?” Maka Nabi shallallahu 'alaihi wa sallam berpaling sambil membentaknya, lalu Abu Jahal berkata, “Sesungguhnya engkau mengetahui, bahwa tidak ada di sini orang yang lebih banyak golongannya dariku.” Maka Allah Tabaaraka wa Ta'aala berfirman, “Maka biarlah dia memanggil golongannya (untuk menolongnya),-- Maka biarlah dia memanggil golongannya (untuk menolongnya),” Ibnu Abbas berkata, “Demi Allah, kalau sekiranya ia memanggil kaumnya, tentu akan ditangkap oleh para malaikat Zabaniyah milik Allah.” (Tirmidzi berkata, “Hadits ini hasan gharib shahih.”)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 6",
    "description": "6-7. Manusia sangat bangga dengan materi sehingga tidak segan berbuat zalim. Sekali kali tidak boleh demikian! sungguh, manusia itu benar-benar melampaui batas apabila melihat dirinya serba cukup dengan harta, jabatan, pengikut, dan semisalnya. Apa yang dimiliki membuatnya mudah mengingkari nikmat Allah dan lupa bahwa semua adalah anugerah-Nya"
  }
]