[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Benar, bahwa manusia melampaui batas-batas Allah. Manakala dia memiliki kekayaan. Maka hendaknya setiap orang yang melampaui batas menyadari bahwa tempat kembali adalah Allah, lalu Dia membalas setiap orang sesuai dengan amalnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Karena ia melihat dirinya telah merasa cukup dengan martabat dan harta yang dimilikinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ) .Diantara macam-macam kezhaliman adalah kezhaliman dengan ilmu, seseorang terkadang jika ia merasa ilmunya bertambah perasaan itu membawanya kepada perbuatan yang sewenang-wenang dengan merendahkan siapapun selainnya, sama halnya dengan hakim yang menetapkan suatu hukum tetapi menyalahi ketetapan syari'at, yakni ia menetapkan suatu hukum tanpa keadilan, padahal telah ditetapkan dalam syari'at bahwa seorang hakim wajib dalam penetapan suatu hukum menetapkannya dengan seadil-adilnya, dan tidak dengan hawa nafsu. 2 ) . Dan diantara sebab-sebab paling bahaya yang menyebabkan manusia terbawa kepada kezhaliman dan melampaui batasa adalah : kekayaan dan sikap manusia yang menerima semua tawaran dunia sedangkan ia lupa dengan tuhannya dan hari berbangkit untuk menghadap-Nya, perhatikanlah 3 ayat ini : { كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَىٰ , أَنْ رَآهُ اسْتَغْنَىٰ , إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ } \" Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas , karena dia melihat dirinya serba cukup , Sesungguhnya hanya kepada Tuhanmulah kembali(mu)\" , maka barangsiapa yang dalam dirinya berkumpul sebab-sebab kezhaliman diatas, maka sungguh kebinasaan telah menghampirinya dari segala sisi jika saja tuhannya tidak menyelamatkannya dengan rahmat dantaufiq-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Untuk menunjukkan bahwa dia memandang dirinya kaya dan merasa tidak membutuhkan harta benda dan berbagai kekuasaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{ketika melihat dirinya berkecukupan} karena telah melihat dirinya memiliki cukup harta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-8. Tapi manusia karena kebodohan dan kezhalimannya bila melihat dirinya kaya, ia bertindak melampaui batas dan berbuat keji, sombing terhadap petunjuk dan lupa bahwa kepada Rabbnyalah ia “kembali” dan tidak takut akan pembalasan. Bahkan sampai pada kondisi meninggalkan petunjuk dan menyerukan orang lain untuk meninggalkannya, lalu melarang shalat yang merupakan amalan iman terbaik."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Apakah yang menyebabkan mereka melampaui batas itu ? mereka melampaui batas karena merasa cukup dengan apa yang dimiliki ole diri dan tidak butuh dengan Allah ﷻ , dan pada hakikatnya mereka adalah lemah, miskin, akan tetapi merasa cukup dengan apa yang ada dalam dirinya, dan mereka membanggakan hal itu, kecuali mereka yang dikaruniakan oleh Allah ﷻ keimanan dan ketawadhu'an."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat Tafsir ayat sebelumnya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 7: 6-8. Allah jelaskan sebab-sebab yang menjadikan manusia melampaui batas, Allah berkata : Sungguh benar manusia adalah bodoh, sesat ketika membolehkan (atas dirinya) melampaui batas dalam menerobos aturan dan kemaksiatan jika dirinya merasa bahwa telah memiliki banyak harta, kaya, dan memiliki kedudukan serta (berbangga) dengan kaum. Lalu Allah menegur manusia yang membolehkan (dirinya) dari menerobos batasan dan kabar (dari Allah) yang berkaitan dengan akhir kehidupannya yang kembali kepada Allah. Manusia tidak memiliki Rabb lain sebagai alternatif dan juga sebagai tempat berlindung, dan akan dibalas baginya atas perbuatannya dan ucapannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 7",
    "description": "6-7. Manusia sangat bangga dengan materi sehingga tidak segan berbuat zalim. Sekali kali tidak boleh demikian! sungguh, manusia itu benar-benar melampaui batas apabila melihat dirinya serba cukup dengan harta, jabatan, pengikut, dan semisalnya. Apa yang dimiliki membuatnya mudah mengingkari nikmat Allah dan lupa bahwa semua adalah anugerah-Nya. 8. Wahai manusia, sungguh hanya kepada tuhanmulah tempat kembali-Mu. Pada hari kiamat Allah akan menghitung apa saja yang engkau perbuat di dunia. Dia akan mem'balas orang yang melampaui batas sesuai dengan azab yang setimpal."
  }
]