[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-12. Apakah kamu melihat sesuatu yang lebih aneh dari tindakan melampaui batas orang ini,yaitu abu jahal,yang melarang hamba Kami (Muhammad sholallohu alaihi wasallam). Melarang hamba Kami (Muhammad sholallohu alaihi wasallam) untuk shalat kepada tuhannya? Apakah kamu tidak melihat bahwa yang dilarang ternyata berada di pihak yang benar,bagaimana bisa dia melarangnya? Atau dia memerintahakan orang lain untuk bertakwa,apakah dia juga akan melarangnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Apakah kamu melihat perkara yang lebih aneh dari perkara Abu Jahal yang melarang,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-14. Apakah kamu mengetahui apa yang lebih mengherankan dari kezaliman orang angkuh ini, yang mengancam dan mencegah Nabi ketika beliau hendak shalat di Ka’bah? Apakah kamu mengetahui jika hamba yang dilarang mendirikan shalat itu berada dalam petunjuk atau sedang menyeru kepada ketakwaan, apakah dia tetap akan melarangnya? Apakah kamu mengetahui orang angkuh ini berpaling dari kebaikan yang disampaikan kepadanya? Apakah kamu mengira Allah tidak melihat segala perbuatannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9-10. عَبْدًا إِذَا صَلَّىٰٓ أَرَءَيْتَ الَّذِى يَنْهَىٰ (Bagaimana pendapatmu tentang orang yang melarang seorang hamba ketika mengerjakan shalat) Orang yang melarangnya adalah Abu Jahal. Dan yang dimaksud dengan seorang hamba tersebut adalah Nabi Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kabarkanlah kepadaku wahai pendengar tentang orang yang melakukan pencegahan, yaitu Abu Jahal. Ibnu Jarir mengatakan dari Ibnu Abbas yang berkata: ”Rasulallah SAW sedang shalat, kemudian Abu Jahal mendatanginya dan melarangnya, kemudian Allah menurunkan ayat ini {Ara’aitalladzii yanha …} sampai ayat {Kaadzibatin Khaathi’ah} [ayat 16]”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu tahu tentang orang yang melarang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-14. Allah berfirman untuk orang yang membangkang lagi angkuh ini, “Bagaimana pendapatmu,” wahai orang yang melarang orang untuk shalat, “jika dia,” yakni hamba yang shalat, “berada di atas kebenaran,” yakni mengetahui kebenaran dan mengamalkannya, “atau dia menyuruh” orang lain untuk “bertakwa (kepada Allah), “ patutkah orang yang sifatnya seperti ini dicegah? Bukankah mencegahnya adalah salah satu penentangan terbesar terhadap Allah dan perang terhadap kebenaran? Larangan ini hanya tertuju pada orang yang dirinya sendiri tidak berada di atas petunjuk atau orang yang memerintahkan orang lain agar tidak bertakwa. “Bagaimana pendapatmu jika orang yang melarang itu mendustakan” orang yang melarang kebenaran, “dan berpaling” dari perintah, apakah ia tidak takut kepada Allah dan siksaNya? “Tidakkah dia mengetahui bahwa sesungguhnya Allah melihat” segala perbuatannya?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَرَأَيْتَ الَّذِي يَنْهَىٰ } Apakah kamu memperhatikan betapa buruknya orang yang melarang itu ? . Sebab diturunkan ayat ini dan beberapa ayat setelahnya adalah : bahwasanya Au Jahal ketika melihat Rasulullah melaksanakan shalat disekitar ka'bah, dia mengancam Rasulullah akan membunuhnya jika masih kembali ketempat itu untuk melaksanakan shalat dan ibadah-ibadah lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Alaq ayat 9: 9-12. Allah berkata : Allah heran, keheranan apa lagi selain ini wahai orang yang dungu (Abu Jahl) yang melarang Nabi ﷺ shalat di sisi ka’bah. Maka jika Muhammad ﷺ kokoh di atas pendiriannya, atau ia diperintahkan untuk bertakwa kepada Allah, dan takut pada-Nya, maka apakah dibenarkan pendosa ini melarang atas urusan (Muhammad ﷺ)?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Alaq Ayat 9",
    "description": "9-10. Wahai rasul atau siapa saja, bagaimana pendapatmu tentang orang yang melarang seorang hamba ketika dia melaksanakan salat' adakah yang lebih mengherankan daripada kelakukan orang (ab' jahl) yang menghalang-halangi hamba-ku (nabi Muhammad) mendekatkan diri kepada tuhan yang telah memberinya kehidupan dan kecukupan'9-10"
  }
]