[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alif lam Ro. Keterangan tentang huruf-huruf yang terpotong-potong (diawal surat) telah berlalu di muka pada permulaan surat al-baqarah. Ini adalah ayat-ayat kitab yang nyata lagi jelas dalam makna-maknanya, halal dan haramnya, serta hidayahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Rā. Pembahasan tentang huruf-huruf ini dan yang semacam dengannya sudah ada di awal surah Al-Baqarah. Ayat-ayat yang diturunkan dalam surah ini termasuk ayat-ayat Al-Qur`ān yang jelas isi kandungannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah disebutkan penjelasan tentang huruf muqattha’ah, dan hikmah dari huruf-huruf ini adalah untuk menjelaskan mukjizat al-Qur’an dan karena menempatannya pada awal surat menambah keindahan dan keagungan al-Qu’ran. Ayat-ayat yang mulia ini adalah ayat-ayat al-Qur’an yang jelas petunjuk dan kefasihannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تِلْكَ ءَايٰتُ الْكِتٰبِ الْمُبِينِ(Ini adalah ayat-ayat Kitab (Al Quran) yang nyata (dari Allah)) Yakni inilah ayat-ayat yang diturunkan kepadamu dalam surat ini, ini adalah ayat-ayat al-Qur’an yang jelas, yakni jelas bahwa ia diturunkan dari sisi Allah, jelas bahwa ia merupakan mukjizat, serta jelas dalam hukum-hukum yang dikandungnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah menamai surah ini dengan surah yang mengandung sebaik-baik kisah, ayat bagi orang-orang mukmin, pelajaran bagi orang yang memiliki akal, dan pembenar bagi kitab-kitab samawi sebelumnya. Sebab turunnya surah ini yaitu bahwa orang-orang kafir Mekah bertemu dengan orang-orang Yahudi, lalu mereka berbicara tentang Muhammad SAW, lalu orang-orang Yahudi berkata: “Bertanyalah kepadanya, kenapa keluarga Ya’kub tidak pindah dari Syam menuju Mesir, yaitu tentang kisah Yusuf,” lalu turunlah surah ini 1. {Alif Lam Ra’} Alif, Lam Ra’, berfungsi untuk menunukkan kekokohan Al-Qur’an dan menantang bangsa Arab untuk menyainginya meskipun itu terdiri dari huruf-huruf bahasa Arab yang mana mereka pandai menjelaskan dan fasih dalam bahasa itu. Ayat-ayat dalam surah ini termasuk ayat-ayat Al-Qur’an yang menjelaskan bahwa Al-Qur’an itu dari sisi Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Rā. Itulah ayat-ayat kitab yang jelas} yang menjelaskan halal dan haram, ketentuan-ketentuan dan hukum-hukum Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah mengabarkan bahwa ayat ayat al-qur’an adalah “ayat ayat kitab(alqur’an) yang nyata” (dari Allah) maksudnya ayat yang jelas lagi terang, lafazh dan makna maknanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (الٓرۚ) alif laam raa : tertulis الٓرۚ dan dibaca: alif laam raa. Allah lebih mengetahui tentang maknanya. (ٱلۡكِتَٰبِ ٱلۡمُبِينِ) al-kitaabil mubiin : Al-Qur’an petunjuk bagi kebenaran dalam aqidah, ibadah, dan syariat. Makna ayat : Firman-Nya : (الٓرۚ) Termasuk huruf muqotho’ah, yang mana ayat-ayat Al-Qur’an tersusun dari huruf-huruf itu, lalu memberi isyarat dengan firman-Nya (تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ) inilah ayat-ayat kitab penjelas kebenaran, dan setiap manusia butuh akan hal yang dapat memperbaiki agama dan dunianya. Pelajaran dari ayat : • Mukjizat Al-Qur’an, Al-Qur’an terdiri dari huruf-huruf seperti (الر) (طس) (ق) namun orang-orang Arab tidak mampu untuk membuat yang semisalnya, walaupun satu surat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 1: Lafaz dan maknanya jelas. Diterangkan di sana kebenaran secara jelas. Di antara contoh jelasnya adalah Allah menurunkannya dengan bahasa Arab, bahasa mereka agar mereka mengerti batasan-batasannya, masalah dasar maupun cabang, dan mengerti perintah-perintah dan larangan-larangannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 1",
    "description": "Alif laam raa'. Huruf-huruf hija'iyyah yang menjadi pembuka surah pada ayat ini dan surah lainya diungkap Allah untuk menggugah dan menarik perhatian kepada lawan bicara, agar mereka memperhatikan pesan-pesan yang akan disampaikan Allah. Huruf ini adalah huruf-huruf yang merangkai ayat-ayat Al-Qur'an hingga menjadi susunan ayat yang indah dan istimewa. Ayat-ayat berikut yang terdapat dalam surah ini adalah sebagian dari ayat-ayat yang terdapat dalam kitab suci Al-Qur'an yang jelas dan nyata bahwa ayat-ayat tersebut adalah wahyu dari Allah. Selanjutnya Allah menegaskan keberadaan Al-Qur'an. Sesungguhnya kami menurunkannya, yakni kalam Allah yang qadim sebagai qur'an, yaitu bacaan yang berbahasa arab, bahasa induk masyarakat pertama yang dihadapi nabi agar kamu mengerti maknanya dan paham akan isi dari pesan-pesan yang terkandung di dalamnya, sehingga kamu mampu memahaminya dengan akalmu."
  }
]