[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ada orang yang berkata dari saudara-saudara yusuf, ”janganlah kalian membunuh yusuf, akan tetapi lemparkanlah dia ke dalam dasar sumur agar sebagian orang yang melintas dari orang-orang musafir akan memungutnya, sehingga kalian akan bebas darinya, dan tidak ada perlunya membunuh dia, jika kalian memang bertekad untuk melakukan apa yang kalian katakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Salah satu dari mereka berkata, \"Jangan bunuh Yusuf! Tetapi buanglah dia ke dalam sumur agar dipungut oleh para musafir yang menemukannya. Ini lebih kecil resikonya daripada membunuhnya, jika kalian benar-benar mantap untuk menjalankan apa yang kalian rencanakan tentang Yusuf.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-11. Seorang saudara Yusuf berkata: “Janganlah kalian membunuh Yusuf, tapi buanglah saja dia ke dasar sumur, agar dia dipungut oleh orang-orang yang melintasi jalan; hal ini jika kalian benar-benar ingin menjauhkannya dari ayahnya.” Maka mereka menyetujui usulan ini, mereka kemudian pergi menemui ayah mereka, Ya’qub untuk meminta izin agar dapat membawa Yusuf pergi ke padang. Namun ayah mereka tidak memberi mereka izin, sehingga mereka merayu ayah mereka dengan lembut: “Wahai ayah, apa yang terjadi dengan dirimu, sehingga engkau tidak percaya kepada kami untuk membawa Yusuf, sesungguhnya kami menginginkan kebaikan baginya sebagaimana kami meinginkannya bagi diri kami sendiri?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. قَالَ قَآئِلٌ مِّنْهُمْ (Seorang diantara mereka berkata) Terdapat pendapat mengatakan, ia adalah Yahudza. فِى غَيٰبَتِ الْجُبِّ (ke dasar sumur) Dasar sumur yang tidak tampak oleh penglihatan. يَلْتَقِطْهُ بَعْضُ السَّيَّارَةِ (supaya dia dipungut oleh beberapa orang musafir) Sehingga mereka membawanya ke tempat yang jauh, yang tidak terjangkau dan diketahui oleh ayahnya. إِن كُنتُمْ فٰعِلِينَ (jika kamu hendak berbuat) Berbuat sesuai dengan saranku kepada kalian. Hal ini menunjukkan bahwa saudara-saudara Yusuf bukanlah para nabi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kezhaliman adalah kegelapan (yang berlipat) di hari kiamat, sungguh bagi orang yang berbuat zhalim akan menerima balasannya sekalipun hari-hari maih panjang, perhatikan bagaimana saudara-saudara Yusuf ketika tangan-tangan mereka terus memanjangkan kezhaliman terhadap saudara mereka sendiri { وَأَلْقُوهُ فِي غَيَابَتِ الْجُبِّ } \"tetapi masukkanlah dia ke dasar sumur\" namun setelah itu tangan-tangan mereka lebih memanjang untuk mengajukan kepadanya permohonan, mereka mengatakan : { قَالُوا يَا أَيُّهَا الْعَزِيزُ مَسَّنَا وَأَهْلَنَا الضُّرُّ وَجِئْنَا بِبِضَاعَةٍ مُزْجَاةٍ فَأَوْفِ لَنَا الْكَيْلَ وَتَصَدَّقْ عَلَيْنَا } \"mereka berkata: “Hai Al Aziz, kami dan keluarga kami telah ditimpa kesengsaraan dan kami datang membawa barang-barang yang tak berharga, maka sempurnakanlah sukatan untuk kami, dan bersedekahlah kepada kami\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Salah satu saudara Yusuf, yaitu Yahudza berkata: “Janganlah kalian membunuh Yusuf, lemparkan saja dia ke dalam lubang sumur yang jarang diperhatikan, jika tujuan kalian adalah menjauhkannya dari ayah.” Dan mereka itu bukanlah nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Salah seorang di antara mereka berkata,“Janganlah membunuh Yusuf, lemparlah dia ke dasar sumur} dasar sumur {agar dia dipungut oleh sebagian musafir} agar dia diambil oleh sebagian musafir yang lewat {jika kalian hendak berbuat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “seorang diantara mereka berkata” salah seorang saudara yusuf yang ingin membunuh atau mengasingkannya berkata “janganlah kalian membunuh yusuf” karena pembunuhan terhadap dirinya merupakan dosa besar dan tindakan yang sangat keji. sedangkan tujuannya bisa terlaksana dengan menjauhkan keberadaan yusuf dari ayahnya tanpa harus membunuh. tetapi usahakan untuk menjauhkannya dengan menceburkannya ”di dasar sumur” dan mengancamnya agar tidak memberitahukan tentang apa yang mereka lakukan. Tapi hendaknya mengaku sebagai budak yang dimiliki seorang yang melarikan diri (dari kalian) agar (dinyatakan sebagai) anak temuan ”oleh beberapa orang musafir” oleh sebagian kafilah yang akan menempuh perjalanan ke tempat yang jauh lalu mereka memeliharanya. orang yang mengatakan rencana ini adalah orang yang paling bagus gagasannya dan paling bagus hatinya dan paling bertakwa dalam konteks ini. sebab sebagian kejelekan itu lebih ringan dibandingkan jenis kejelekan lainnya, dan bahaya yang ringan bisa dijadikan alat untuk menepis bahaya yang lebih berat. Tatkala mereka telah menyetujui pendapat ini,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فِي غَيَٰبَتِ ٱلۡجُبِّ) fii ghayaabatil jubb : gelapnya sumur. (بَعۡضُ ٱلسَّيَّارَةِ) ba’dhus sayyaarah : musafir yang berkelana di bumi. Makna ayat : Firman-Nya : (قَالَ قَآئِلٞ مِّنۡهُمۡ) Allah mengkisahkan percakapan para saudara Yusuf dan musyawarah mereka tentang Yusuf, bagaimana cara mereka menjauhkannya dari ayah mereka dan kasih sayangnya? (قَالَ قَآئِلٞ مِّنۡهُمۡ) berkata seorang di antara mereka, Yahuda atau Raubil, ia adalah saudara dari bibinya dan yang paling senior serta paling matang akalnya, berkata (لَا تَقۡتُلُواْ يُوسُفَ) “Janganlah kalian membunuh Yusuf, karena itu kejahatan yang tidak pantas untuk dilakukan, (وَأَلۡقُوهُ فِي غَيَٰبَتِ ٱلۡجُبِّ) tapi lemparkan ia kedalam kegelapan sumur—yaitu sumur yang terkenal di daerah mereka, Palestina ( يَلۡتَقِطۡهُ بَعۡضُ ٱلسَّيَّارَةِ) sehingga ia dipungut oleh musafir (إِن كُنتُمۡ فَٰعِلِينَ) jika kalian ingin melakukannya terhadap saudara kalian, ini yang lebih pas.” Pelajaran dari ayat : • Melakukan keburukan yang lebih sedikit dari dua keburukan adalah kaidah yang sudah dipraktekkan sejak dahulu. • Kecintaan dan kasih sayang kepada saudara kandung lebih besar dari pada kepada saudara dari ayah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 10: Ada yang mengatakan, bahwa dia adalah Yahudza. Yakni karena membunuh merupakan perkara besar, dan masih ada cara untuk mencapai tujuan itu. Yang hendak pergi ke tempat yang jauh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 10",
    "description": "Seorang di antara mereka memberi saran dan berkata, janganlah kamu membunuh yusuf, tetapi masukkan saja dia ke dasar sumur agar dia dipungut oleh sebagian musafir yang melewati sumur itu, jika kamu hendak berbuat sesuatu untuk menjauhkan yusuf dengan ayah. Setelah dipaparkan tentang rencana jahat putra-putra nabi yakub terhadap nabi yusuf, lalu pada ayat ini diuraikan tentang aksi mereka melakukan tipu muslihat yang diawali dengan membujuk sang ayah untuk membawa serta nabi yusuf pergi bersama mereka. Mereka berkata, wahai ayah kami! mengapa engkau tidak memercayai kami sebagai penanggung jawab terhadap saudara kami sendiri yusuf, padahal sesungguhnya kami semua menginginkan kebaikan baginya, dengan membawa serta yusuf bersama kami, dan kami semua akan menjaga dengan baik serta memberinya kasih sayang."
  }
]