[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf mendudukan ayah dan ibunya di singgasana kerajaan di sampingnya, sebagai bentuk penghormatan kepada mereka berdua. Kedua orang tua dan saudara-saudaranya yang berjumlah sebelas orang menghormatinya dengan bersujud kepadanya sebagai penghormatan dan pemuliaan, bukan untuk menyembah dan tunduk. Dan itu perkara yang diperbolehkan dalan ajaran syariat mereka, dan sungguh telah diharamkan hukumnya dalam syariat kita(islam) untuk menutup pintu menuju syirik kepada Allah. Yusuf berkata kepada bapaknya ”Sesungguhnya sujud ini merupakan ta’bir mimpi yang telah aku ceritakan kepadamu sebelumnya (wahai ayah) saat aku masih kecil. Sesungguhnya tuhanku telah menjadikannya kenyataan, dan Dia telah memberikan keutamaan kepadaku ketika Dia mengeluarkanku dari penjara, dan mendatangkan kalian kepadaku dari kampung yang jauh, setelah setan merusak ikatan persaudaraan antaraku dan saudara-saudaraku. Sesungguhnya Tuhanku mahalembut pengurusannya terhadap apa yang Dia kehendaki, sesungguhnya Dia mahamengetahui kemaslahat0kemaslahatan hamba-hambaNya, naha bijaksana dalah perkataan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Yusuf mempersilakan kedua orang tuanya untuk duduk di tempat duduknya. Lalu kedua orang tuanya dan saudara-saudaranya yang berjumlah sebelas orang memberikan penghormatan kepada Yusuf dengan melakukan sujud. Itu merupakan sujud penghormatan, bukan sujud ibadah, sebagai pembuktian perintah Allah dalam mimpinya. (Ketika itu bersujud kepada manusia tidak dilarang dalam syariat mereka). Maka Yusuf berkata kepada ayahnya, \"Penghormatan dari kalian untukku ini adalah takwil (tafsir) dari mimpi yang dahulu kulihat di dalam tidurku dan kuceritakan kepadamu. Rabbku telah membuat mimpi itu menjadi kenyataan. Dan Rabbku telah berbuat baik kepadaku ketika Dia mengeluarkanku dari penjara. Dan juga ketika Dia mendatangkan kalian dari gurun pasir setelah hubungan baik antara aku dan saudara-saudaraku dirusak oleh setan. Sesungguhnya Rabbku sangat lembut dalam mengatur apa yang dikehendaki-Nya. Sesungguhnya Dia Maha Mengetahui keadaan hamba-hamba-Nya, lagi Maha Bijaksana dalam mengatur urusan mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Lalu Yusuf meminta kedua orangtuanya duduk di singgasana yang ada di sampingnya sebagai penghormatan bagi mereka; kemudian kedua orangtua dan saudara-saudaranya yang berjumlah sebelas orang bersujud kepadanya sebagai penghormatan dan pengagungan baginya, bukan sebagai penyembahan -bersujud kepada orang lain dibolehkan dalam syariat mereka, adapun dalam syariat kita dilarang bersujud kecuali kepada Allah-. Dan Yusuf berkata kepada ayahnya: “Sujud yang kalian lakukan ini adalah tafsir dari mimpi yang dulu aku lihat dan aku ceritakan kepadamu pada saat aku masih kecil. Allah telah menjadikannya kenyataan; Dia telah memuliakanku dengan kebaikan yang besar karena telah mengeluarkanku dari penjara dan mendatangkan kalian kepadaku dari perkampungan setelah setan mengganggu kami untuk memecah belah antara aku dengan para saudaraku. Sungguh Tuhanku sangat lembut pengaturan-Nya bagi hamba yang Dia kehendaki, Maha Mengetahui segala keadaan dan Maha Bijaksanan dalam perkataan dan perbuatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ (Dan ia menaikkan kedua ibu-bapanya ke atas singgasana) Yakni nabi Yusuf mempersilahkan keduanya untuk duduk di singgasana yang biasa digunakan oleh para raja. وَخَرُّوا۟ لَهُۥ سُجَّدًا ۖ (Dan mereka (semuanya) merebahkan diri seraya sujud kepada Yusuf) Yakni kedua orang tua dan para saudaranya bersujud kepadanya. Dan hal ini diperbolehkan dalam syariat mereka sebagai bentuk penghormatan. وَقَالَ (Dan berkata Yusuf) Nabi Yusuf berkata. يٰٓأَبَتِ هٰذَا تَأْوِيلُ رُءْيٰىَ(Wahai ayahku inilah ta’bir mimpiku) Yang telah disebutkan sebelumnya. قَدْ جَعَلَهَا رَبِّى حَقًّا ۖ (sesungguhnya Tuhanku telah menjadikannya suatu kenyataan) Dengan terjadinya takwil dari apa yang ditunjukkan oleh mimpi tersebut. وَقَدْ أَحْسَنَ بِىٓ( Dan sesungguhnya Tuhanku telah berbuat baik kepadaku) Yakni berlemah lembut denganku dan berbuat baik kepadaku. Nabi Yusuf tidak menyebutkan bahwa ia telah dikeluarkan dari dasar sumur, karena dengan menyebutkan hal itu akan dapat menjadi celaan bagi para saudaranya sedangkan ia telah berkata “tak ada cercaan bagi kalian.” وَجَآءَ بِكُم مِّنَ الْبَدْوِ (dan ketika membawa kamu dari dusun padang pasir) Yakni dari negeri Kan’an yang terletak di Syam. Mereka dahulu adalah para penggembala dan penduduk gurun. مِنۢ بَعْدِ أَن نَّزَغَ الشَّيْطٰنُ بَيْنِى وَبَيْنَ إِخْوَتِىٓ ۚ (setelah syaitan merusakkan (hubungan) antaraku dan saudara-saudaraku) Yakni merusak hubungan antara kita dan saling memusuhi satu sama lain. Nabi Yusuf menuduhkan kesalahan saudara-saudaranya disebabkan oleh setan, sebagai penghormatan darinya bagi mereka. إِنَّ رَبِّى لَطِيفٌ لِّمَا يَشَآءُ ۚ (Sesungguhnya Tuhanku Maha Lembut terhadap apa yang Dia kehendaki) Makna (اللطيف) yakni lembut dalam mengantarkan seseorang kepada sesuatu yang Dia kehendaki agar dapat meraihnya dengan cara yang paling mudah dan benar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Begitu besar perhatian Yusuf kepada kedua orang tuanya tatkala Allah mengkaruniakan kedudukan tinggi baginya, maka ia pun menaikkan kedua orangtuanya di atas singgasana kerajaannya, memberikan perhatian dan penghormatan yang tinggi untuk keduanya. Sesungguhnya ini adalah risalah yang mesti dicontoh oleh siapapun yang dilimpahkan kepadanya kedudukan dan ilmu serta kekayaan. 2 ). Perhatikan ketika Yusuf berkata : { وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ } \"Dan sesungguhnya Tuhanku telah berbuat baik kepadaku, ketika Dia membebaskan aku dari rumah penjara\" Yusuf tidak menyebutkan bagaimana ia keluar dari Sumur, padahal nikmat yang ia rasakan ketika itu lebih besar, ada dua kemungkinan : Pertama : agar ia tidak mempermalukan saudara-saudaranya, karena orang yang berbudi pekerti yang baik tidak pernah dendam dengan masa lalunya yang menyakitkan, kedua : karena masuknya ia penjara adalah pilihannya sendiri, maka tatkala ia ditakdirkan untuk keluar darinya momentum itu menjadi lebih berharga baginya, berbeda dengan peristiwa di sumur itu. 3 ). { وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاءَ بِكُمْ مِنَ الْبَدْوِ مِنْ بَعْدِ أَنْ نَزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي } Ada hikmah agar kita senantiasa menjaga perasaan orang lain tanpa menimpulkan luka dalam hatinya, maka tatkala Yusuf meniadakan perkataannya : setelah aku dianiaya oleh saudara-saudaraku, dan setelah mereka membuangku ke dalam sumur; bahkan Yusuf hanya menisbatkan perkara itu kepada syaithon, ini menunjukkan betapa indahnya akhlaq ini dan seperti itulah akhlaq para Nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Dia duduk bersama orang tuanya di atas dipan raja untuk memuliakan dan menghormatinya. Lalu orang tua dan saudara-saudaranya yang berjumlah 11 orang bersujud kepadanya sebagai bentuk penghormatan, bukan sujud penyembahan dan tidak meletakkan kening di tanah. Demikian itu adalah wujud penghormatan di jaman mereka dan diperbolehkan dalam syariat mereka. Yusuf berkata: “Wahai ayahku, ini adalah ta’wil dari mimpiku dahulu, yaitu mimpi dan hasil dari mimpi tersebut. Sungguh Tuhanku telah menjadikannya nyata. Sungguh dia telah mencurahkan kepadaku kelembutah dan kebaikan ketika mengeluarkanku dari penjara dan menampakkan ketidak bersalahanku” Dia tidak berkata: “Dari sumur,\" sebagai bentuk penghormatan, supaya saudara-saudaranya tidak malu ketika dalam keadaan bersama-sama dan bersih. Dia (Allah) membawa kalian dari padang pasir, yaitu tanah Kan’an yang ada di Syam, setelah setan membisikkan keburukan dan merusak hubungan antara aku dan saudara-saudaraku. Sesungguhnya Tuhanku selalu menemani hamba-hambaNya, Maha lembut dalam menentukan peraturan yang rumit dan menghubungkan kebaikan dengan kemudahan terhadap sesuatu yang dikehendaki. Sesungguhnya Allah SWT itu Maha Mengetahui ciptaanNya dan sesuatu yang baik untuknya, dan Maha Bijaksana dalam aturanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menaikkan orang tuanya ke atas singgasana} mendudukkan kedua orang tuanya di sampingnya di atas kursi kekuasaannya untuk memuliakan keduanya {Mereka tunduk bersujud kepadanya} untuk penghormatan, Penghormatan manusia pada hari itu adalah saling sujud satu sama lain {Dia berkata,“Wahai ayahku, ini adalah takwil mimpiku yang sebelumnya. Sungguh Tuhanku telah menjadikannya kenyataan. Sungguh Tuhanku telah berbuat baik kepadaku, ketika Dia membebaskan aku dari penjara dan ketika membawa kalian dari pedalaman} pedalaman Syam {setelah setan merusak} merusak {(hubungan) antara aku dengan saudara-saudaraku. Sesungguhnya Tuhanku Maha lembut terhadap apa yang Dia kehendaki. Sesungguhnya Dia Yang Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. “Dan dia menaikkan kedua ibu bapaknya ke atas singgasana”, di atas tahta raja dan tempat duduk al-Aziz “dan mereka (semuanya) merebahkan diri seraya sujud kepada Yusuf”, maksudnya ayah dan ibunya, serta para saudaranya bersujud kepada Yusuf dalam rangka mengagungkan, menghormati, dan memuliakan Yusuf. “Dan berkatalah Yusuf”, ketika menyaksikan pemandangan ini dan melihat sujud mereka kepada dirinya, “Wahai ayahku, inilah ta’bir mimpiku yang dahulu itu”, saat bermimpi melihat sebelas bintang beserta matahari dan bulan bersujud kepadanya. Inilah kejadian nyata dari mimpinya yang kembali kepada dirinya sendiri dan sampai kepadanya. “Sesungguhnya Rabbku telah menjadikannya suatu kenyataan”, Allah tidak menjadikannya hanya mimpi-mimpi kosong semata, “dan sesungguhnya Rabbku telah berbuat baik kepadaku”, dengan kebaikan yang sangat besar “ketika Dia membebaskanku dari rumah penjara dan ketika Dia membawamu dari dusun padang pasir”, ini termasuk cerminan sikap lembut dan keelokan gayanya dalam berbicara, di mana dia hanya menyebutkan kisah saat di penjara, tanpa menyinggung kondisi saat berada di dasar sumur, karena ketulusan maafnya bagi para saudaranya, dia tidak menyinggung kesalahan itu. Dan kedatangan kalian dari dusun termasuk karena kebaikan Allah kepada diriku. Dia tidak berkata, “Dia membawa kalian dari kondisi kelaparan dan kesulitan”, juga tidak mengatakan, “Dia telah berbuat baik kepada kalian semua”, akan tetapi mengatakan, “Dia telah mencurahkan kebaikan kepadaku”, akan tetapi Yusuf menjadikan kebaikan Allah kembali kepadanya. Mahaberkah Allah, Dzat yang telah mengistimewakan (dengan curahan rahmatNya) kepada orang yang Dia kehendaki dari kalangan para hambaNya dan memberi rahmat kepada mereka dari sisiNya, sesungguhnya Dia Dzat Yang Maha Memberi, “setelah setan merusakkan (hubungan) antarku dan saudara-saudaraku”, dia pun tidak mengatakan, “Setelah setan merusak saudara-saudaraku,” akan tetapi menganggap seakan-akan keteledoran dan dosa berasal dari kedua pihak. Maka segal puji bagi Allah yang telah menghinakan setan dan mengusirnya, dan mengumpulkan kita setelah setelah pepecahan yang mencerai-beraikan. “Sesungguhnya Rabbku Mahalembut terhadap apa yang Dia kehendaki”, Dia menyalurkan kebajikan dan kebaikanNya kepada seorang hamba tanpa dia (hamba itu) sadari dan menempatkannya pada kedudukan yang tinggi yang bebas dari segala urusan yang dibencinya. “Sesungguhnya Dia-lah Yang Maha Mengetahui”, segenap perkara yang zahir dan batin, rahasia-rahasia para hambaNya serta bisikan hati mereka. “Lagi Mahabijaksana”, dalam meletakkan perkara-perkara pada waktunya yang telah ditentukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (عَلَى ٱلۡعَرۡشِ) ‘alal ‘arsy : di atas singgasana. (وَخَرُّواْ لَهُۥ سُجَّدٗاۖ) wa kharruu lahuu sujjadaa : sujud kepadanya sebagai penghormatan dan pengagungan. (مِّنَ ٱلۡبَدۡوِ) min badwi : pelosok, pelosok negeri Syam. (مِنۢ بَعۡدِ أَن نَّزَغَ) mim ba’di an nazagha : merusak. (لَطِيفٞ لِّمَا يَشَآءُۚ) lathiiful limaa yasyaa : Maha Lembut dalam pengaturannya bagi yang Dia kehendaki dari para hamba-Nya sebagaimana Yusuf. Makna ayat : Tatkala mereka semua sampai di istana (وَرَفَعَ) Yusuf mengangkat (أَبَوَيۡهِ) kedua orang tuanya (عَلَى ٱلۡعَرۡشِ) ke atas singgasana raja (وَخَرُّواْ لَهُۥ سُجَّدٗاۖ) lalu mereka pun sujud kepada Yusuf, sebagai bentuk penghormatan. Lalu Yusuf berkata, (وَقَالَ يَٰٓأَبَتِ هَٰذَا تَأۡوِيلُ رُءۡيَٰيَ مِن قَبۡلُ قَدۡ جَعَلَهَا رَبِّي حَقّٗاۖ) “Wahai ayahku, ini adalah penjelasan atas mimpiku sebelumnya, dan Rabbku telah menjadikannya kenyataan.” Yaitu ketika ia melihat—semasa kecilnya—sebelas bintang, matahari, dan bulan bersujud kepadanya. Dan firman-Nya, (وَقَدۡ أَحۡسَنَ بِيٓ إِذۡ أَخۡرَجَنِي مِنَ ٱلسِّجۡنِ وَجَآءَ بِكُم مِّنَ ٱلۡبَدۡوِ مِنۢ بَعۡدِ أَن نَّزَغَ ٱلشَّيۡطَٰنُ بَيۡنِي وَبَيۡنَ إِخۡوَتِيٓۚ) Ini adalah bentuk pujian kepada Allah atas nikmat-nikmat-Nya dan untuk mengingatkan kepada yang hadir dengan kejadian-kejadian serta kasih sayang Allah pada masa-masa itu. Serta kemuliaan hati Yusuf dan tata krama yang tinggi ia tidak mengatakan, “Sungguh Allah telah berbuat baik kepadaku dengan mengeluarkanku dari sumur.” Sehingga mereka tersakiti, tapi ia berkata, (مِنَ ٱلسِّجۡنِ) mengeluarkanku dari penjara, (وَجَآءَ بِكُم مِّنَ ٱلۡبَدۡوِ) dan medatangkan kalian dari Kan’an menuju Mesir, kemudian ia menyandarkan keburukan yang dilakukan saudara-saudaranya kepada setan untuk membuat suasana menjadi hangat, serta menghilangkan kesedihan dari jiwa saudara-saudaranya. Kemudian ia menutup perkataannya—ia mengingat-ingat kenikmatan Allah kepadanya—dengan penuh kebahagiaan (إِنَّ رَبِّي لَطِيفٞ لِّمَا يَشَآءُۚ إِنَّهُۥ هُوَ ٱلۡعَلِيمُ) “Sungguh Rabbku Maha Lembut kepada yang Dia kehendaki, sungguh Dia Maha Mengetahui,” keadaan makhluk-Nya (ٱلۡحَكِيمُ) lagi Maha Bijaksana dalam pengaturan dan penciptaan-Nya. Pelajaran dari ayat : • Benarnya mimpi Yusuf ‘alaihi salam, ketika ia duduk di singgasana dan kedua orang tuanya dan saudara-saudaranya sujud kepadanya. • Bisa jadi takwil sebuah mimpi baru terlihat setelah berpuluh-puluh tahun, sebagaimana takwil mimpi Yusuf terlihat setelah empat puluh tahun. • Jelasnya ke Maha Lembutan Allah dan kasih-Nya pada peristiwa-peristiwa yang menakjubkan pada kisah ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 100: Sujud di sini adalah sujud penghormatan bukan sujud ibadah. Penghormatan dengan bersujud dalam syari’at sebelum kita adalah diperbolehkan, namun dalam syari’at kita dilarang. Syari’at sebelum kita menjadi syari’at kita jika belum dihapus, dan penghormatan dengan bersujud telah dihapus dalam syari’at kita. Yakni ketika Beliau bermimpi melihat sebelas bintang, matahari dan bulan bersujud kepadanya. Yusuf ‘alaihis salam tidak menyebutkan peristiwa saat Beliau dimasukkan oleh saudara-saudaranya ke dalam sumur agar tidak mempermalukan saudara-saudaranya dan untuk menyempurnakan maafnya kepada saudara-saudaranya. Dia menyampaikan kebaikan dan ihsan-Nya kepada hamba-Nya tanpa disadari oleh hamba-Nya serta menyampaikannya kepada kedudukan tinggi setelah mengalami cobaan yang banyak. Dia mengetahui perkara yang nampak maupun tersembunyi, rahasia hamba dan apa yang disembunyikan dalam hati mereka. Dia menempatkan sesuatu pada tempatnya dan mengarahkan sesuatu sampai waktu yang ditetapkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 100",
    "description": "Dan ketika keluarga besar nabi yusuf sudah menempati ruangan yang disediakan, dia menuntun dan menaikkan kedua orang tuanya ke atas singgasana yang sudah disiapkannya. Dan mereka semua tunduk bersujud memberi penghormatan kepadanya. Dan dia berkata kepada ayahnya, wahai ayahku! inilah takwil dari mimpiku yang dahulu itu aku ceritakan kepada engkau. Dan sesungguhnya tuhanku yang selalu memelihara dan melindungiku telah menjadikannya kenyataan. Sesungguhnya tuhanku telah berbuat baik kepadaku dengan menyempurnakan nikmat-Nya, antara lain ketika dia membebaskan aku dari penjara setelah difitnah, ketika membawa kamu dari dusun menuju mesir, dan setelah setan memerdaya saudara-saudaraku sehingga merusak hubungan antara aku dengan saudara-saudaraku itu. Sungguh, tuhanku mahalembut terhadap apa yang dia kehendaki dengan mengaturnya secara rapi. Sungguh, dia yang maha mengetahui segala sesuatu, lagi mahabijaksana dalam ketetapan-Nya. Nabi yusuf kemudian berdoa, tuhanku, sesungguhnya engkau telah menganugerahkan kepadaku sebagian kekuasaan yang tidak pernah aku bayangkan sebelumnya, dan engkau juga telah mengajarkan kepadaku sebagian takwil mimpi. Wahai tuhan pencipta langit dan bumi, engkaulah pelindungku yang selalu dekat denganku di dunia dan di akhirat, aku mohon kepada-Mu agar bila ajalku telah tiba, wafatkanlah aku dalam keadaan muslim, dan gabungkanlah aku di akhirat kelak dengan orang-orang yang saleh."
  }
]