[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "kemudian Yusuf berdo’a kepada Tuhannya seraya berkata “tuhanku, sungguh engkau telah memberikan kepadaku sebagian dari kerjaan mesir, dan Engkau telah mengajarkan kepadaku tafisr mimpi dan ilmu yang lainnya, Wahai Pencipta langit dan bumi dan pengada keduanya, Engkaulah yang mengurus segala urusanku di dunia dan akhirat, wafatkanlah aku dalam keadaan berserah diri, dan pertemukanlah aku bersama hamba-hambaMu yang sholeh dari para nabi yang baik,bersih dan terpilih”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Kemudian Yusuf berdoa kepada Rabbnya seraya berkata, \"Ya Rabbku! Engkau telah memberiku jabatan di negeri Mesir dan mengajarkan kepadaku ilmu takwil mimpi. Wahai Pencipta langit dan bumi tanpa ada contoh sebelumnya! Engkaulah Pelindungku dalam semua urusanku di dunia dan Pelindungku dalam semua urusanku di Akhirat. Cabutlah nyawaku di saat ajalku berakhir sebagai orang Islam (yang berserah diri). Dan gabungkanlah diriku bersama para Nabi yang saleh, baik leluhurku maupun bukan leluhurku, di dalam Surga Firdaus, Surga yang tertinggi.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Kemudian Yusuf berdoa kepada Allah dengan penuh ketundukan: “Ya Tuhanku, Engkau telah memberiku kerajaan Mesir dan mengajarkanku menafsirkan mimpij; Wahai Pencipta tujuh langit dan bumi, Engkaulah penolongku dalam setiap urusanku di dunia dan di akhirat, teguhkanlah aku di atas agama Islam hingga aku mati, dan jadikanlah aku bersama orang-orang shalih dari kalangan para nabi dan kekasih-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. رَبِّ قَدْ ءَاتَيْتَنِى مِنَ الْمُلْكِ (Ya Tuhanku, sesungguhnya Engkau telah menganugerahkan kepadaku sebahagian kerajaan) Yakni kedudukan yang diberiikan oleh sang raja sebagai penjaga perbendaharaan negeri Mesir. وَعَلَّمْتَنِى مِن تَأْوِيلِ الْأَحَادِيثِ ۚ( dan telah mengajarkan kepadaku sebahagian ta’bir mimpi) Yakni takwil mimpi. فاطر السماوات والأرض(Ya Tuhan) Pencipta langit dan bumi Makna (الفاطر) yakni pencipta. أَنتَ وَلِىِّۦ(Engkaulah Pelindungku) Yakni penolong dan pengatur segala urusanku. فِى الدُّنْيَا وَالْاٰخِرَةِ ۖ( di dunia dan di akhirat) Yang menjadi penolongku di dunia dan di akhirat. تَوَفَّنِى مُسْلِمًا(wafatkanlah aku dalam keadaan Islam) Yakni jadikanlah aku berada dalam Islam sepanjang hidupku hingga maut menjemputku. وَأَلْحِقْنِى بِالصّٰلِحِينَ (dan gabungkanlah aku dengan orang-orang yang saleh) Dari golongan para nabi dari bapak-bapakku dan lainnya, sehingga aku dapat meraih pahala dan derajat sebagaimana yang mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Kemudian Yusuf berdoa untuk mengakui keutamaanNya dan mensyukuri nikmat-nikmatNya yang diberikan kepadanya: “Wahai Tuhanku, sungguh telah engkau berikan kepadaku sebagian kerajaan, yaitu kerajaan Mesir, yaitu merupakan sesuatu yang harus disyukuri, dan telah engkau ajarkan kepadaku untuk mengungkap dan menafsirkan berita tentang mimpi. Wahai Pencipta dan Pembuat langit dan bumi, engkaulah penolongku dan pemelihara urusanku di dunia dan akhirat. Jadikanlah aku di seluruh kehidupanku sebagai seorang muslim yang tunduk kepadamu sehingga aku mati dalam keadaan Islam, dan sertakanlah aku dengan orang-orang shaleh, yaitu para nabi dari leluhurku dan lainnya, supaya aku bisa mendapatkan pahala dan derajat yang sama dengan mereka di sisiMu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhanku sungguh Engkau telah menganugerahkan kepadaku sebagian kekuasaan dan telah mengajarkanku sebagian takwil mimpi} menguraikan mimpi {(Wahai) pencipta langit dan bumi, Engkaulah pelindungku} penolong dan pengawas urusanku {di dunia dan di akhirat. Wafatkanlah aku dalam keadaan muslim dan gabungkanlah aku dengan orang-orang shalih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Tatkala Allah menyempurnakan karuniaNya bagi Yusuf berupa pengendalian kekuasaan di bumi, dan sebagian kerajaan serta menentramkan pandangan matanya dengan berkumpul bersama kedua orangtuanya dan para saudaranya dan setelah perolehan ilmu agung yang Allah berikan kepadanya, maka dia berkata untuk mengakui nikmat Allah sebagai bentuk kesyukuran dan ajakan agar tetap istiqamah di atas Islam, “Ya Rabbku, Sesungguhnya Engkau telah menganugerahkan kepadaku sebagian kerajaan”, lantaran dia memegang kendali dan pengaturan perbendaharaan bumi (Mesir), serta menjadi menteri besar bagi raja “dan Engkau telah mengajarkan kepadaku sebagian ta’bir mimpi”, berupa penakwilan makna kisah-kisah yang ada di kitab-kitab yang diturunkan (oleh Allah) dan penakwilan mimpi dan ilmu lainnya. “(Ya Rabb) Pencipta langit dan bumi. Engkau-lah Pellindungku di dunia dan akhirat, wafatkanlah aku dalam keadaan Islam”, maksudnya lestarikan akidah Islam pada diriku dan teguhkanlah hatiku di atasnya hingga Engkau mewafatkanku dalam keadaan berpegang teguh padanya. “Permohonan ini bukanlah doa permintaan agar kematian dipercepat untuknya “dan gabungkanlah aku dengan orang-orang yang shalih”, dari kalangan para nabi yang berbakti kepadaMu dan orang-orang yang terbaik lagi terpilih."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "(رَبِّ) rabbi : Wahai Rabb yang telah menciptakanku, memberiku rizki, pemilik segala urusanku, dan sesembahanku, aku tidak mempunyai sesembahan kecuali Dia. (مِنَ ٱلۡمُلۡكِ) min mulki : sebagian kerajaan, karena ia hanya menjadi raja untuk negeri Mesir. (تَأۡوِيلِ ٱلۡأَحَادِيثِۚ) ta’wiilil ahaadiits : tafsir mimpi. (فَاطِرَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ) fathiris samaawaati wal ardh : Yang Menciptakan keduanya tanpa ada contoh sebelumnya. (أَنتَ وَلِيِّۦ) anta waliyyi : Yang Mengurus segala urusanku di dunia maupun di akhirat. Makna ayat : Ini adalah akhir dari kisah Yusuf, setelah Allah mengumpulkan seluruh keluarganya, membuka pintu-pintu rahmat-Nya, dan seluruh kisah-kisah sedih—dilemparkan kedalam sumur, dijual sebagai budak dengan harga murah, tuduhan istri Al-‘Aziz, dan dijebloskan kedalam penjara selama tujuh tahun—menjadi akhir yang bahagia nan cerah—kerajaan, kemuliaan, derajat yang tinggi, kekayaan, serta berkumpulnya seluruh keluarganya, dan di atas itu semua ilmu laduni dan wahyu ilahi dan tafsir mimpi. Setelah Allah mewafatkan ayahnya dan menerima taubat saudara-saudaranya serta menyiapkan mereka menjadi nabi, jiwa Yusuf merasa rindu kepada kerajaan yang tertinggi, tetangga yang shalih, rekan-rekan pilihan lagi suci: Ibrahim, Ishaq, dan Ya’kub. Ia pun mengangkat kedua tangannya berdoa (رَبِّ قَدۡ ءَاتَيۡتَنِي مِنَ ٱلۡمُلۡكِ وَعَلَّمۡتَنِي مِن تَأۡوِيلِ ٱلۡأَحَادِيثِۚ فَاطِرَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ أَنتَ وَلِيِّۦ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ تَوَفَّنِي مُسۡلِمٗا وَأَلۡحِقۡنِي بِٱلصَّٰلِحِينَ) “Rabbku, sesungguhnya Engkau telah menganugrahkan kepadaku sebagian kekuasaan dan mengajarkan kepadaku sebagian takwil mimpi. Wahai Pencipta langit dan bumi, Engkaulah pelindungku di dunia dan akhirat, wafatkanlah aku dalam keadaan muslim dan gabungkanlah aku bersama dengan orang yang shalih.” Maka Allah pun mengabulkan doanya, tidak lama kemudian ajalpun menjemputnya dan bertemu dengan keluarganya, dan teman-teman yang shalih. Keselamatan atasnya, kepada mereka, dan kepada setiap orang yang shalih baik di bumi maupun langit, keselamatan atas para rasul, dan segala puji hanya milik Allah Rabb semesta alam. Pelajaran ayat : • Disyariatkan berdoa dan bertawasul dengana nama-nama Allah dan sifat-sifat-Nya. • Disyariatkan menjauh dari dunia dan membencinya setelah memperolehnya. • Keutamaan rindu kepada Allah dan ingin bertemu dengan para teman yang shalih di kerajaan yang tinggi (surga). • Bolehnya meminta kematian, selama bukan karena beban masalah atau bosan beribadah atau ingin istirahat dari dunia, sebagaimana dalam hadits (لا يسألن أحدكم الموت لضر نزل به) “Sekali-kali janganlah seorang dari kalian meminta kematian karena masalah yang menimpanya.” Ini adalah hadits sahih. Akan tetapi boleh apabila disebabkan karena rindu kepada Allah dan ingin bertemu dengan orang-orang shalih, sebagai bentuk menjauhi dunia dan rindu akan akhirat, negeri keselamatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 101: Ada yang berpendapat, bahwa kedua orang tuanya tinggal di dekat Yusuf selama 24 tahun atau 17 tahun, sedangkan waktu berpisahnya (sebelum itu) adalah 18 tahun atau 40 tahun. Ketika Ya’kub akan wafat, dia berpesan kepada Yusuf agar ia membawanya dan menguburkannya di dekat bapaknya (yaitu Nabi Ishaq), maka Yusuf berangkat dan menguburkan bapaknya di sana, lalu kembali ke Mesir dan menetap di sana setelah bapaknya wafat selama 23 tahun. Setelah selesai urusannya dan ia merasa bahwa hidupnya tidak lama, ia pun berkata sambil mengakui nikmat Allah, menyukurinya dan berdoa agar tetap di atas Islam sampai akhir hayat sebagaimana yang disebutkan dalam ayat di atas. Doa ini bukan berarti bahwa Beliau meminta disegerakan wafatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 101",
    "description": "Nabi yusuf kemudian berdoa, tuhanku, sesungguhnya engkau telah menganugerahkan kepadaku sebagian kekuasaan yang tidak pernah aku bayangkan sebelumnya, dan engkau juga telah mengajarkan kepadaku sebagian takwil mimpi. Wahai tuhan pencipta langit dan bumi, engkaulah pelindungku yang selalu dekat denganku di dunia dan di akhirat, aku mohon kepada-Mu agar bila ajalku telah tiba, wafatkanlah aku dalam keadaan muslim, dan gabungkanlah aku di akhirat kelak dengan orang-orang yang saleh. Demikianlah kisah tentang nabi yusuf. Allah menceritakan kisah ini kepada nabi Muhammad agar menjadi pengajaran yang sangat berharga. Itulah sebagian berita gaib yang kami wahyukan kepadamu, wahai nabi Muhammad. Dengan wahyu itu engkau dapat mengetahui kisah tersebut, padahal engkau tidak berada di samping mereka, yakni saudarasaudara yusuf, ketika mereka bersepakat mengatur tipu muslihat untuk melemparkan nabi yusuf ke dalam sumur."
  }
]