[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "itulah yang disebutkan tentang kisah Yusuf, dan itu merupakan berita yang ghaib yang kami beritahukan kepadamu (wahai rosul) sebagai wahyu, dan tidaklah engkau hadir bersama saudara Yusuf ketika mereka mengatur rencana untuk memasukan yusuf ke dalam sumur, dan mereka membuat alasan kepada bapak mereka, hal ini menunjukan kebenaranmu, dan sesungguhnya Allah lah yang meberi wahyu kepadamu"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Kisah Yusuf dan saudara-saudaranya yang telah Kami wahyukan kepadamu -wahai Rasul- tidakkah engkau ketahui sebelumnya. Karena engkau tidak menyaksikan saudara-saudara Yusuf ketika mereka memutuskan untuk membuangnya ke dalam sumur dan membuat tipu muslihat yang jahat. Tetapi Kami mewahyukan kisah itu kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102-103. Hai Rasulullah, kisah yang mulia ini merupakan bagian dari kisah-kisah yang agung yang Kami ceritakan kepadamu melalui wahyu. Kamu tidak hadir bersama para saudara Yusuf ketika mereka bersepakat untuk membuat makar terhadap Yusuf. Dan mayoritas manusia tidak mengimanimu meski kamu sangat ingin mereka beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. ذٰلِكَ مِنْ أَنۢبَآءِ الْغَيْبِ نُوحِيهِ إِلَيْكَ ۖ (Demikian itu (adalah) diantara berita-berita yang ghaib yang Kami wahyukan kepadamu) Yakni kepadamu wahai Muhammad, padahal sebelum turunnya wahyu kamu tidak memiliki pengetahuan tentangnya sedikitpun. وَمَا كُنتَ لَدَيْهِمْ(padahal kamu tidak berada pada sisi mereka) Yakni berada bersama saudara-saudara Yusuf. إِذْ أَجْمَعُوٓا۟ أَمْرَهُمْ (ketika mereka memutuskan rencananya) Ketika mereka bersepakat untuk membuang Yusuf ke dasar sumur. وَهُمْ (dan mereka) ketika itu. يَمْكُرُونَ(sedang mengatur tipu daya) Terhadap Yusuf dan menginginkan keburukan baginya. Karena Rasulullah tidak bersama mereka ketika itu, dan tidak hidup dan berinteraksi bersama kaum yang mengetahui kisah-kisah umat terdahulu, maka tidak ada cara untuk mendapatkan pengetahuan tentang kisah mereka kecuali lewat wahyu dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Yang disebutkan tersebut adalah cerita Yusuf yang termasuk dalam kabar-kabar ghaib yang Kami wahyukan kepadamu, wahai Nabi supaya bisa kamu kabarkan kepada kaummu, meskipun kamu tidak ada bersama saudara-saudara Yusuf ketika mereka berencana untuk melemparkannya ke dalam sumur. Mereka menyusun rencana untuk melakukan itu. Itu merupakan ajaran Allah kepadamu. Ini adalah petunjuk tentang kebenaran berita-berita ghaib."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itu adalah sebagian berita} kabar {gaib yang Kami wahyukan kepadamu, padahal kamu tidak berada di samping mereka} kamu tidak ada di sisi saudara-saudara Yusuf {ketika mereka bersepakat dengan urusan mereka} berencana melemparkan Yusuf ke dalam sumur {dan mereka itu melakukan tipu daya} mengatur rencana untuk menyakiti dengan sembunyi-sembunyi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Tatkala Allah menceritakan kisah ini kepada Muhammad, Allah berfirman kepada beliau, “Demikian itu”, yaitu (Para nabi) yang Kami beritahukan kepadamu “(adalah) di antara berita-berita yang ghaib”, yang bila tidak Kami wahyukan kepadamu, tentulah kisah agung tersebut tidak akan sampai kepadamu. Sesungguhnya engkau tidak hadir “dI sisi mereka ketika mereka memutuskan rencananya (untuk memasukkan Yusuf ke dalam sumur)”, yakni para saudara Yusuf “dan mereka sedang mengatur tipu daya”, kepadanya , ketika mereka telah saling bertekad untuk memisahkannya dari sang ayah dalam kondisi yang tidak ada yang mengetahuinya kecuali Allah saja, dan tidak mungkin ada orang yang sanggup mengetahuinya kecuali dengan pemberitahuan dari Allah kepadanya. Sebagaimana halnya Allah menceritakan kisah Musa dan peristiwa yang terjadi pada beliau. Dia menyebutkan sebuah keadaan yang tidak ad acara bagi manusia untuk mengetahuinya melainkan dengan melalui wahyu. Allah berfirman \"Dan tidaklah kamu (Muhammad) berada di sisi yang sebelah barat ketika Kami menyampaikan perintah kepada Musa, dan tiada pula kamu termasuk orang-orang yang menyaksikan.\" (Al-Qashash: 44), ini merupakan petunjuk yang sangat tajam bahwa risalah yang di bawa oleh Rasulullah adalah benar adanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 102: Yakni jika Kami tidak mewahyukannya kepada kamu, tentu kamu tidak akan tahu. Hal ini termasuk bukti kerasulan Nabi Muhammad shallallahu 'alaihi wa sallam dan apa yang Beliau bawa adalah benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 102",
    "description": "Demikianlah kisah tentang nabi yusuf. Allah menceritakan kisah ini kepada nabi Muhammad agar menjadi pengajaran yang sangat berharga. Itulah sebagian berita gaib yang kami wahyukan kepadamu, wahai nabi Muhammad. Dengan wahyu itu engkau dapat mengetahui kisah tersebut, padahal engkau tidak berada di samping mereka, yakni saudarasaudara yusuf, ketika mereka bersepakat mengatur tipu muslihat untuk melemparkan nabi yusuf ke dalam sumur. Meski kisah tersebut telah jelas membuktikan kerasulan nabi Muhammad, namun tetap saja ada orang yang tidak percaya. Dan kebanyakan manusia tidak akan mau beriman kepada Allah dan rasul-Nya, walaupun engkau sangat menginginkannya. Baik kisah nabi yusuf maupun kisah-kisah lainnya dalam Al-Qur'an merupakan bukti bahwa Al-Qur'an adalah benar wahyu Allah. Adalah mustahil bila nabi Muhammad yang hidup jauh setelah peristiwa itu terjadi dapat menceritakannya secara rinci tanpa mendapat wahyu dari Allah yang maha mengetahui."
  }
]