[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah kebanyakan kaum musyrikin dari kaummu (wahai rosul) membenarkanmu dan mengikutimu, walaupun engkau sangat menginginkan keimanan mereka, maka janganlah kamu sedih atas hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Dan kebanyakan manusia tidak akan beriman walaupun engkau -wahai Rasul- berupaya keras agar mereka mau beriman. Oleh karena itu janganlah engkau terlalu sedih dengan sikap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. وَمَآ أَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِينَ (Dan sebahagian besar manusia tidak akan beriman — walaupun kamu sangat menginginkannya) Yakni mereka tidak beriman meski kamu sangat berharap mereka akan mendapatkan hidayah sehingga mereka termasuk dalam golongan orang-orang yang beriman kepada Allah; kecuali orang-orang yang mendapat rahmat Allah. Mereka tidak mendapatkan hidayah karena keteguhan mereka dalam kekafiran, yaitu teguh memegang kepercayaan nenek moyang mereka. Terdapat pendapat mengatakan bahwa kaum Quraisy dan orang-orang Yahudi bertanya kepada Rasulullah tentang kisah Nabi Yusuf dan saudara-saudaranya. Maka Rasulullah menceritakannya dengan detail, karena beliau berharap akan menjadi sebab masuknya mereka kedalam agama Islam; namun mereka tidak seperti yang beliau harapkan, sehingga Rasulullah merasa sedih, maka Allah menghiburnya dengan ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Dan kebanyakan manusia (meskipun engkau sangat menginginkan agar mereka mendapat hidayah wahai Rasul) tidak mempercayai ajakanmu karena kegigihan mereka atas kekufuran kecuali orang yang dikasihi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kebanyakan manusia tidak akan beriman walaupun kamu sangat menginginkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. Allah berfirman kepada NabiNya, Muhammad “Dan sebagian besar manusia walaupun kamu sangat menginginkannya”, yaitu menginginkan keimanan mereka, mereka “tidak akan beriman”, karena daya tangkap dan orientasi mereka sungguh telah mengalami kerusakan. Hasrat besar para pemberi nasihat kepada mereka tidaklah berguna, walaupun sama sekali tidak ada penghalang dan pengganjal. Para pemberi nasihat itu telah mengajari dan menyeru mereka kepada hal-hal yang mengandung kebaikan bagi mereka dan menolak kejelekan dari mereka, tanpa meminta upah maupun timbal balik. Walaupun para da’I tersebut telah menunjukkan bukti-bukti dan tanda-tanda kebenaran kepada mereka yang menunjukkan kebenaran mereka, namun segala sesuatu yang sudah mereka tunjukkan, tetap tidak bermanfaat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Dan firman-Nya (وَمَآ أَكۡثَرُ ٱلنَّاسِ وَلَوۡ حَرَصۡتَ بِمُؤۡمِنِينَ) Allah mengabarkan bahwa kebanyakan manusia tidak beriman kepadamu, dengan ajaranmu berupa wahyu, tauhid, dan hari akhir, dan kisah yang seperti ini sungguh telah mencukupi sebagai bukti akan kebenaran nubuwahmu dan mewajibkan keimanan kepadamu dan apa yang engkau bawa. Namun, kebanyakan manusia tidak beriman, sekalipun engkau menginginkan mereka beriman, dan di antara sebabnya adalah—dan yang paling besar—bahwa keimanan berbenturan dengan kebiasaan mereka yang batil, buruk, dan merusak, terlebih lagi syahwat dan keinginan duniawi mereka. Oleh karena itu barangsiapa yang Allah tetapkan celaka maka ia tidak akan beriman, apapun keadaannya. Jadi janganlah engkau bersedih dan merasa sulit. Pelajaran dari ayat : • Penjelasan ketetapan Allah kepada manusia, bahwa kebanyakan dari mereka tidak beriman, jadi janganlah seorang dai bersedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 103: Yang demikian karena maksud dan tujuan mereka telah rusak, sehingga nasehat orang yang memberi nasehat tidaklah bermanfaat, padahal nasehatnya tanpa imbalan sama sekali, dan lagi pemberi nasehat (rasul) pun telah menunjukkan penguat dan ayat-ayat yang menunjukkan kebenarannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 103",
    "description": "Meski kisah tersebut telah jelas membuktikan kerasulan nabi Muhammad, namun tetap saja ada orang yang tidak percaya. Dan kebanyakan manusia tidak akan mau beriman kepada Allah dan rasul-Nya, walaupun engkau sangat menginginkannya. Baik kisah nabi yusuf maupun kisah-kisah lainnya dalam Al-Qur'an merupakan bukti bahwa Al-Qur'an adalah benar wahyu Allah. Adalah mustahil bila nabi Muhammad yang hidup jauh setelah peristiwa itu terjadi dapat menceritakannya secara rinci tanpa mendapat wahyu dari Allah yang maha mengetahui. Pada ayat yang lalu Allah mengingatkan nabi Muhammad bahwa walaupun beliau sangat menginginkan agar manusia beriman kepada Allah dan rasul-Nya, tetapi kebanyakan manusia tidak mau beriman. Pada ayat ini Allah menegaskan bahwa nabi Muhammad tidak akan meminta imbalan sedikit pun atas dakwahnya. Allah berfirman, dan engkau, wahai nabi Muhammad, tidak meminta imbalan apa pun kepada mereka atas dakwah yang engkau sampaikan, sebab seruan dakwah itu tidak lain adalah pengajaran bagi seluruh alam."
  }
]