[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu tidak meminta dari kaummu upah atas usaha menunjukan mereka kepada keimanan. Sesungguhnya yang kamu di utus dengan membawanya berupa al- Qur’an dan hidayah merupakan pelajaran bagi kalian manusia seluruhnya, yang mereka akan mengingat dan mendapat hidayah dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Seandainya mereka mengerti pasti mereka beriman kepadamu. Karena engkau -wahai Rasul- tidak meminta imbalan apapun dari mereka dalam menyampaikan Al-Qur`ān dan dakwahmu kepada mereka. Sebab Al-Qur`ān itu semata-mata adalah peringatan bagi seluruh umat manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Kamu tidak meminta balasan dari kaummu atas al-Qur’an yang kamu sampaikan dan bacakan kepada mereka. Sungguh al-Qur’an ini adalah petunjuk dan pelajaran bagi manusia dan jin seluruhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. وَمَا تَسْـَٔلُهُمْ عَلَيْهِ مِنْ أَجْرٍ ۚ (Dan kamu sekali-kali tidak meminta upah kepada mereka) Yakni atas penyampaian dan pembacaan al-Qur’an kepada mereka; Atau atas keimanan; atau atas seruannya kepada keimanan. Upah berupa harta yang mereka berikan kepadamu sebagaimana pendeta-pendeta mereka meminta upah. إِنْ هُوَ(itu hanyalah) Yakni al-Qur’an itu. إِلَّا ذِكْرٌ لِّلْعٰلَمِينَ (tidak lain pengajaran bagi semesta alam) Tidak hanya bagi kaum Quraisy saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Dan kamu, wahai Nabi tidak meminta upah atas penyampaian dan pembacaan Al-Qur’an. Al-Qur’an itu tidak lain adalah pengingat dan pelajaran bagi seluruh (penghuni) alam semesta dari golongan manusia dan jin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak meminta mereka atas hal itu} atas penyampaian Al-Qur’an {suatu imbalan. dia tidak lain adalah pengajaran} pelajaran dan pengingat {bagi semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. Karena itu, Allah berfirman “Dan kamu sekali-kali tidak meminta upah kepada mereka (terhadap seruanmu ini), itu tidak lain hanyalah pengajaran bagi semesta alam.” Dengan itu, merekaa akan mengingat-ingat apa saja yang berguna bagi mereka agar (hendaknya) mereka melaksanakannya dan apa saja yang berbahaya hendaklah mereka meninggalkannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (عَلَيۡهِ مِنۡ أَجۡرٍۚ) ‘alaihi min ajr : upah atas Al-Qur’an dan penyampaiannnya. (إِنۡ هُوَ إِلَّا ذِكۡرٞ) in huwa illaa dzikr : ia hanya sebagai peringatan: peringatan bagi orang-orang yang beriman. Makna ayat : Firman-Nya : (وَمَا تَسۡ‍َٔلُهُمۡ عَلَيۡهِ مِنۡ أَجۡرٍۚ) Dan engkau tidak meminta mereka imbalan atas apa yang engkau sampaikan berupa Al-Qur’an dan peringatan. Kalau seandainya engkau meminta imbalan dari mereka, tentu ini akan jadi penghalang keimanan mereka, namun selama hal ini disampaikan dengan gratis, tentu tidak ada hal yang menghalangi dari keimanan kecuali orang yang telah Allah tentukan kecelakaan baginya, sehingga mereka terhalang untuk sampai kepadanya. Firman-Nya : (إِنۡ هُوَ إِلَّا ذِكۡرٞ لِّلۡعَٰلَمِينَ) Tidaklah Al-Qur’an dan apa yang ada di dalamnya berupa cahaya dan petunjuk dan apa yang engkau bacakan kepada mereka melainkan sebagai peringatan; nasihat bagi mereka yang mendengar dari kalangan orang-orang yang berilmu dan beriman, dari orang-orang yang telah Allah siapkan kebahagiaan bagi mereka. Pelajaran dari ayat : • Dakwah kepada Allah harus gratis, bayaran seorang dai dari Allah subhanahu wa ta’ala yang memerintahkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 104: Agar mereka ingat hal yang bermanfaat bagi mereka, sehingga mereka melakukannya, serta ingat hal yang membahayakan mereka, sehingga mereka pun meninggalkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 104",
    "description": "Pada ayat yang lalu Allah mengingatkan nabi Muhammad bahwa walaupun beliau sangat menginginkan agar manusia beriman kepada Allah dan rasul-Nya, tetapi kebanyakan manusia tidak mau beriman. Pada ayat ini Allah menegaskan bahwa nabi Muhammad tidak akan meminta imbalan sedikit pun atas dakwahnya. Allah berfirman, dan engkau, wahai nabi Muhammad, tidak meminta imbalan apa pun kepada mereka atas dakwah yang engkau sampaikan, sebab seruan dakwah itu tidak lain adalah pengajaran bagi seluruh alam. Bila manusia mau berpikir jernih, sebenarnya pengajaran tentang tanda-tanda kekuasaan Allah itu ada di sekitar mereka. Allah menegaskan, dan berapa banyak tanda-tanda kebesaran Allah yang ada di langit dan di bumi sebagai pengajaran yang setiap saat mereka lalui dan saksikan, namun mereka berpaling darinya tanpa mengambil pelajaran."
  }
]