[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan banyak dari bukti-bukti kebenaran yang menunjukan keesaan Allah dan dan kekuasaanNya, tersebar di langit dan di bumi, seperti matahari, bulan, gunung-gunung dan pepohonan yang mereka menyaksikanya sendiri, sedang mereka berpaling darinya, tidak merenungkan dan tidak mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Dan banyak sekali tanda-tanda keesaan Allah -Subḥānahu- yang ada di langit dan bumi. Mereka menemukannya tetapi mereka enggan memikirkannya dan tidak menghiraukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Betapa banyak ayat-ayat kauniyah yang menunjukkan keagungan dan keesaan Sang Pencipta, ayat-ayat ini terdapat di langit dan di bumi tanpa tersembunyi dari seorangpun, semua orang dapat menyaksikannya. Akan tetapi mayoritas mereka tidak menghayati dan tidak mempedulikannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَكَأَيِّن مِّنْ ءَايَةٍ فِى السَّمٰوٰتِ وَالْأَرْضِ (Dan banyak sekali tanda-tanda (kekuasaan Allah) di langit dan di bumi) Betapa banyaknya tanda-tanda yang ada di langit yang menunjukkan keesaan Allah seperti langit yang diciptakan tanpa tiang, yang dihiasi dengan bintang-bintang bersinar yang dapat bergerak dan yang tetap diam; serta tanda-tanda yang ada di bumi seperti pegunungan, padang pasir yang tandus tak berpenghuni, lautan, tumbuh-tumbuhan, dan hewan-hewan. Semua ini dapat menunjukkan kepada mereka keesaan Allah dan menunjukkan bahwa Allah adalah penciptannya. يَمُرُّونَ (yang mereka melaluinya) Yakni melalui tanda-tanda ini tanpa memperhatikannya dan tanpa menengok kepada tanda yang menunjukkan kepada penciptanya, meski mereka melihat dengan mata mereka namun mereka tidak melihatnya dengan penuh pendalaman dan pengamatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan bagaimana keadaan dirimu terhadap ayat-ayat kauniyah yang telah dihamparkan di muka bumi ini, dan apa yang tengah terjadi di hari-hari ini, sebesar apapun pengaruh dan pemanfaatanmu dari ayat-ayat itu sebesar itulah keimanan dalam dirimu, namun jika kamu tidak dapat melihat maka setidaknya jagalah dirimu dari perkara-perkara keji yang digemari oleh kaum-kaum pembangkang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Dan berapa dari ayat-ayat, yaitu banyak ayat-ayat yang menunjukkan atas keberadaan dan keesaan Allah serta kesempurnaan kuasaNya di seluruh pelosok langit dan bumi. Mereka menyaksikannya tanpa merenungi, memikirkan dan mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berapa banyak} berapa banyak {tanda-tanda} tanda-tanda untuk menunjukkan kepada ketauhidan Allah {di langit dan di bumi yang mereka lalui dan mereka berpaling darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. “Dan banyak sekali”, berapa banyak “tanda-tanda (kekuasaan Allah) di langit dan bumi yang mereka lalui”, yang menandakan keesaan Allah (Tauhidullah) “sedang mereka berpaling darinya.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (وَكَأَيِّن مِّنۡ ءَايَةٖ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ) banyak dari ayat-ayat—di langit seperti matahari, bulan, bintang-bintang, awan, hujan, dan yang ada pada bumi seperti gunung-gunung, sungai, dan makhluk-makhluk yang beraneka ragam, berjalan siang malam—yang menunjukkan akan keberadaan Allah dan wajibnya beribadah kepada-Nya, mentauhidkan-Nya, namun mereka tidak ingin memperhatikannya tidak pula merenunginya, oleh karena itu mereka tidak beriman dan tidak pula mendapatkan hidayah. Pelajaran dari ayat : • Tercelanya lalai dan tidak memikirkan ayat-ayat Allah di alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 105: Yakni tidak memikirkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 105",
    "description": "Bila manusia mau berpikir jernih, sebenarnya pengajaran tentang tanda-tanda kekuasaan Allah itu ada di sekitar mereka. Allah menegaskan, dan berapa banyak tanda-tanda kebesaran Allah yang ada di langit dan di bumi sebagai pengajaran yang setiap saat mereka lalui dan saksikan, namun mereka berpaling darinya tanpa mengambil pelajaran. Dan keberpalingan itu membuat kebanyakan dari mereka tidak beriman kepada Allah, bahkan mereka mempersekutukan-Nya dengan yang lain."
  }
]