[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah mengimani orang-orang yang berpaling dari ayat-ayat Allah itu bahwa Allah itu Pencipta mereka, Pemberi rizki mereka dan Pencipta segala sesuatu dan hanya Dia semata yang berhak diibadahi, kecuali mereka mempersekutukan dalam peribadahan mereka dengan patung-patung dan berhala-berhala. Mahatinggi Allah dalam hal itu setinggi-tingginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Kebanyakan manusia tidak beriman bahwa Allah adalah Rabb Yang Maha Pencipta, Maha Memberi rezeki, Maha Menghidupkan dan Maha Mematikan melainkan sambil menyembah tuhan-tuhan lain, seperti berhala-berhala atau patung-patung, dan menganggap bahwa Allah mempunyai anak. Mahasuci Allah dari apa yang mereka tuduhkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Mayoritas orang-orang yang mendustakan dan berpaling dari ayat-ayat Allah itu beriman kepada-Nya, melainkan jika mereka dapat menyekutukan Allah dengan sesembahan yang lain, maka mereka baru bersedia untuk mengakui bahwa Allah adalah yang menciptakan dan memberi rezeki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. وَمَا يُؤْمِنُ أَكْثَرُهُم بِاللهِ (Dan sebahagian besar dari mereka tidak beriman kepada Allah) Yakni sebagian besar manusia tidak percaya dan tidak mengakui Allah sebagai pencipta dan pemberi rezeki yang menghidupkan dan mematikan. إِلَّا وَهُم مُّشْرِكُونَ (melainkan dalam keadaan mempersekutukan Allah) Mereka menyembah-Nya dan menyembah selain-Nya, sebagaimana yang mereka lakukan di masa jahiliyah. Mereka mengakui behwa Allah sebagai pencipta mereka, namun mereka menjadikan sekutu-sekutu bagi-Nya yang mereka sembah agar mendekatkan mereka kepada Allah. Seperti itu pula yang dilakukan oleh orang-orang yang menjadikan para pastur dan pendeta sebagai tuhan-tuhan selain Allah. Begitu pula orang-orang yang percaya bahwa orang-orang mati dapat melakukan sesuatu yang sebenarnya hanya dapat dilakukan oleh Allah, sebagaimana yang perbuatan yang dilakukan oleh para penyembah kuburan-kuburan, mereka beriman kepada Allah, namun percaya bahwa selain-Nya mampu memberi manfaat dan mudharat, lalu melakukan beberapa ritual peribadatan untuk mereka, padahal ini merupakan perbuatan syirik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Dan kebanyakan manusia tidak beriman kepada Allah kecuali mereka hanya menyekutukan Allah dengan menymbah tuhan selain Dia. Maksudnya yaitu mereka mengakui keberadaan dan ciptaan Allah, namun mereka tetap mengambil sekutu bersamanya dalam peribaatan, sumpah, dan taqarrub dalam bentuk pengorbanan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kebanyakan mereka tidak beriman} tidak berikrar {kepada Allah, bahkan mereka musyrik} menyembah tuhan selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. Kendatipun demikian, jika dijumpai ada sebagian keimanan dari mereka “dan sebagian besar dari mereka tidak beriman kepada Allah, melainkan dalam keadaan mempersekutukan Allah (dengan sembahan-sembahan lain)”, mereka itu, meski mengakui rububiyah Allah dan bahwa Dia-lah al-Khaliq (Pencipta), ar-Raziq (Pemberi rizki), Pengatur segala urusan, maka mereka tetap menyekutukan Allah dalam uluhiyah dan tauhidNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya pada ayat 106 : (وَمَا يُؤۡمِنُ أَكۡثَرُهُم بِٱللَّهِ إِلَّا وَهُم مُّشۡرِكُونَ) Allah ta’ala mengkabarkan kepada rasul-Nya bahwa kebanyakan dari orang yang beliau dakwahi yang mana mereka beriman bahwa Allah adalah Rabb yang mengatur alam semesta, Pencipta, dan Pemberi rizki, kecuali mereka adalah orang-orang yang musyrik, karena mereka menjadikan berhala-berhala sebagai tandingan bagi-Nya dalam ibadah. Dan ini adalah kenyataannya, seandainya seorang Yahudi atau Nasrani ditanya tentang siapa yang menciptakan, memberi rizki, yang menghidupkan juga mematikan, dan mengatur alam semesta, niscaya mereka akan berkata, “Allah.” Namun ia menjadikan bagi Allah sekutu, menyembah-Nya dan juga selain-Nya. Beginilah keadaan orang-orang musyrik yang Allah kabarkan tentang mereka. Banyak dari orang-orang yang tidak mengerti dari umat Al-Qur’an, mereka berdoa kepada selain Allah, bernadzar untuk selainnya, namun mereka juga beriman kepada apa yang rasul-Nya bawa berupa tauhid, hari kebangkitan dan pembalasan, serta syariat. Pelajaran dari ayat : • Penjelasan mengenai hakikat yang telah tetap, yaitu bahwa kebanyakan orang menyekutukan Allah dalam sebagian sifat dan peribadahan, walaupun mereka mengimani Allah sebagai Rabb yang Menciptakan, Memberi Rizki, dan Mengatur alam semesta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 106: Padahal mereka mengetahui bahwa Allah Pencipta dan Pemberi rezeki mereka. Dengan menyembah dan beribadah kepada selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 106",
    "description": "Dan keberpalingan itu membuat kebanyakan dari mereka tidak beriman kepada Allah, bahkan mereka mempersekutukan-Nya dengan yang lain. Keberpalingan manusia dari pengajaran para rasul maupun tandatanda kekuasaan Allah yang terbentang di alam semesta seperti yang ditegaskan pada ayat yang lalu, membuat manusia lalai dari agama. Akibatnya, manusia tidak lagi mengindahkan hukum-hukum agama dan nilai-nilai akhlak. Karena itu, Allah kembali mengingatkan kepada manusia akibat dari kelalaian tersebut. Apakah mereka merasa aman dari kedatangan siksa Allah yang meliputi mereka, sehingga mereka tidak bisa melarikan diri darinya; atau-kah mereka merasa aman dari kedatangan kiamat kepada mereka secara mendadak, sedang mereka tidak menyadarinya, sehingga mereka tidak punya kesempatan untuk bertobat'."
  }
]