[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka apakah mereka memiliki sesuatu yang menyebabkan mereka aman dari siksa Allah pada mereka yang merata menimpa mereka semua, atau Kiamat datang kepada mereka dengan tiba-tiba, sedang mereka tidak menyadari dan tidak menduga-duganya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Apakah mereka merasa aman dari datangnya hukuman di dunia yang akan mengepung dan mengurung mereka tanpa bisa mereka hindari, atau datangnya Hari Kiamat secara tiba-tiba, sedangkan mereka tidak merasakan kedatangannya sehingga mereka tidak bersiap-siap untuk menghadapinya? Apakah karena hal itu kemudian mereka tidak beriman?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Allah mengingkari perbuatan orang-orang musyrik tersebut: “Apakah orang-orang yang mendustakan itu merasa aman dari datangnya siksaan Allah yang dapat membinasakan mereka semua, atau datangnya kiamat secara tiba-tiba ketika mereka tidak menyadarinya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. أَفَأَمِنُوٓا۟ أَن تَأْتِيَهُمْ غٰشِيَةٌ مِّنْ عَذَابِ اللهِ (Apakah mereka merasa aman dari kedatangan siksa Allah yang meliputi mereka) Makna (الغاشية) yakni apa yang dapat menghalangi mereka dari azab. Pendapat lain mengatakan maknanya adalah hari kiamat. Dan pendapat lain mengatakan maknanya adalah musibah-musibah. أَوْ تَأْتِيَهُمُ السَّاعَةُ بَغْتَةً (atau kedatangan kiamat kepada mereka secara mendadak) Yakni dengan tiba-tiba. وَهُمْ لَا يَشْعُرُونَ (sedang mereka tidak menyadarinya) Tidak menyadari kedatangannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Apakah orang-orang musyrik itu merasa aman dari datangnya azab Tuhan (Al-Ghasyiyah yaitu salah satu azab yang akan menenggelamkan mereka) atau datangnya kiamat secara tiba-tiba, sedangkan mereka tidak merasakan waktu datangnya hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka merasa aman ketika datang kepada mereka siksa Allah} hukuman yang menyelimuti mereka {atau datangnya kepada mereka kiamat} kiamat {secara tiba-tiba} secara tiba-tiba {dan mereka tidak menyadari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. Mereka itu yang sudah sampai pada kondisi demikian, tidaklah tersisa bagi mereka melainkan azab yang akan menimpa mereka dan hukuman akan mendatangi mereka secara tiba-tiba ketika mereka merasa aman (dari ancaman itu semua sebelumnya). Untuk itu, Allah berfirman, “Apakah mereka merasa aman”, yaitu orang-orang yang melakukan perbuatan di atas, yang berpaling dari ayat-ayat Allah “dari kedatangan siksa Allah yang meliputi mereka”, yaitu siksa yang menyelimuti mereka, merata menimpa mereka semua dan menghabisi mereka sampai tuntas. “atau (merasa aman dari) kedatangan kiamat kepada mereka secara mendadak”, tiba-tiba “sedang mereka tidak menyadarinya?” karena mereka itu memang pantas untuk diperlakukan demikian. Hendaknya mereka bertaubat kepada Allah dan meninggalkan segala perkara yang menjadi penyebab datangnya hukuman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (غَٰشِيَةٞ مِّنۡ عَذَابِ ٱللَّهِ) ghaasyiyatum min ‘azaabillah : Siksaan dari Nya yang menutupi atau meliputi mereka. (بَغۡتَةٗ) baghtah : tiba-tiba, sedangkan mereka masih tetap dalam keadaan musyrik dan kafir. Makna ayat : Ayat-ayat ini masih mengajak untuk beriman kepada wahyu ilahi, tauhid, kebangkitan, dan balasan pada hari kiamat kelak. Perkara ini merupakan rukun agama yang paling besar. Allah berfirman, “Apakah orang-orang musyrik itu merasa aman—kebanyakan dari manusia yang mengaku beriman kepada Allah melainkan ia adalah orang-orang musyrik, orang-orang yang berpaling dari tanda-tanda kebesaran Allah yang terhampar di hadapannya—apakah mereka merasa aman?” (أَن تَأۡتِيَهُمۡ غَٰشِيَةٞ مِّنۡ عَذَابِ ٱللَّهِ) siksa azab yang mengurung mereka azab yang tidak mampu mereka tahan (أَوۡ تَأۡتِيَهُمُ ٱلسَّاعَةُ) atau datangnya hari kiamat (بَغۡتَةٗ) secara tiba-tiba (وَهُمۡ لَا يَشۡعُرُونَ) sedangkan mereka tidak mengetahui akan waktu kedatangannya, sehingga semakin besar bencana dan musibah yang mereka dapat, maka bagaimana mungkin mereka bisa merasa aman? Apakah ada yang bisa menyelamatkan mereka selain Allah ta’ala? Mengapa mereka enggan beriman dan tidak bertakwa, sehingga mereka bisa selamat dari apa yang akan menimpa mereka? Inilah makna dari ayat 107. Pelajaran dari ayat : • Peringatan dari azab yang datang karena kesyirikan dan maksiat. • Penetapan akidah kebangkitan hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 107: Yang melakukan perbuatan syirk itu. Padahal mereka sudah layak menerimanya. Oleh karena itu, hendaknya mereka bertobat kepada Allah dan meninggalkan sesuatu yang menjadi sebab mereka mendapatkan siksa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 107",
    "description": "Keberpalingan manusia dari pengajaran para rasul maupun tandatanda kekuasaan Allah yang terbentang di alam semesta seperti yang ditegaskan pada ayat yang lalu, membuat manusia lalai dari agama. Akibatnya, manusia tidak lagi mengindahkan hukum-hukum agama dan nilai-nilai akhlak. Karena itu, Allah kembali mengingatkan kepada manusia akibat dari kelalaian tersebut. Apakah mereka merasa aman dari kedatangan siksa Allah yang meliputi mereka, sehingga mereka tidak bisa melarikan diri darinya; atau-kah mereka merasa aman dari kedatangan kiamat kepada mereka secara mendadak, sedang mereka tidak menyadarinya, sehingga mereka tidak punya kesempatan untuk bertobat'Allah menjelaskan bahwa kebanyakan manusia berpaling dan tetap enggan menerima kebenaran tentang keesaan-Nya. Allah lalu berpesan kepada rasulullah, katakanlah, wahai Muhammad, 'inilah jalan yang Allah tunjukkan ke-pada-ku. Aku dan orang-orang yang beriman dan beramal saleh yang mengikutiku mengajak kamu kepada Allah dengan yakin serta mengandung bukti-bukti yang mengetuk akal dan perasaan manusia. Mahasuci Allah dengan segala kesempurnaan-Nya, dan aku tidak termasuk orang-orang musyrik yang mempersekutukan Allah dengan yang lain."
  }
]