[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai Rasul), “ Inilah jalanku aku menyeru untuk beribadah hanya kepada Allah semata, berdasarkan hujjah dari Allah dan keyakinan, aku dan orang-orang yang meneladaniku. Dan aku menyucikan Allah dari sekutu-sekutu, dan aku bukanlah termasuk orang-orang yang mempersekutukan Allah bersama selaiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Katakanlah -wahai Rasul- kepada orang yang engkau dakwahi, \"Inilah jalanku yang kudakwahkan kepada umat manusia. Aku sendiri mendakwahkannya berdasarkan hujah yang jelas. Begitu juga orang yang mengikuti jejakku, mengikuti petunjukku dan mengikuti sunahku mendakwahkannya berdasarkan hujah yang jelas. Dan aku bukanlah golongan orang-orang yang menyekutukan Allah, tetapi aku adalah golongan orang-orang yang mengesakan-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Hai Rasulullah, katakanlah kepada mereka: “Dakwah kepada pengesaan Allah merupakan jalan dan sunnahku, aku dan orang-orang yang mentaati dan mengikuti sunnahku menyampaikan dakwah ini dengan hujjah yang kuat. Aku menyucikan Allah dari segala yang tidak pantas dengan keagungan dan kebesaran-Nya, dan aku mengesakan-Nya dalam ibadah tanpa menyekutukan-Nya dengan sesuatu apapun.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. قُلْ هٰذِهِۦ سَبِيلِى (Katakanlah: “Inilah jalan (agama)ku) Yakni inilah dakwah yang aku serukan dan jalan yang aku lalui. Makna (سبيلي) yakni jalanku atau sunnahku. أَدْعُوٓا۟ إِلَى اللهِ ۚ عَلَىٰ بَصِيرَةٍ (mengajak (kamu) kepada Allah dengan hujjah yang nyata) Yakni dengan bukti yang jelas dan pengetahuan tentang kebenarannya. أَنَا۠ وَمَنِ اتَّبَعَنِى (aku dan orang-orang yang mengikutiku) Yakni para pengikutku juga menyeru kepada agama ini. وَمَآ أَنَا۠ مِنَ الْمُشْرِكِينَ (dan aku tiada termasuk orang-orang yang musyrik) Yang menjadikan sembahan-sembahan selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Katakanlah, Wahai Nabi: “Ajakan dan jalan ini adalah jalan dan sunnahku. Aku mengajak (kalian) menuju jalan itu dengan hujjah yang jelas dan pasti. Aku dan orang yang beriman dengan risalahku dan mendapat petunjukku (mengikutinya). Aku tidak termasuk orang-orang musyrik yang mengambil Tuhan lain selain Allah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Inilah jalanku} cara dan jalanku {aku dan orang-orang yang mengikutiku mengajak kepada Allah dengan bukti yang nyata} keyakinan dan bukti {Maha suci Allah dan aku tidak termasuk golongan orang-orang musyrik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Allah berfirman kepada NabiNya Muhammad, “Katakanlah”, kepada manusia “Inilah jalanku (agamaku)”, yaitu jalanku yang aku mengajak (orang) ke sana. Ia adalah lintasan yang mengantarkan menuju kepada Allah dan menuju tempat kemuliaanNya, yang mengandung adanya pengetahuan tentang kebenaran dan pengamalannya serta lebih mendahulukan kebenaran itu (daripada segala sesuatu), memurnikan agama hanya untuk Allah semata, tiada sekutu bagiNya. “Aku mengajak (kamu) kepada Allah”, maksudnya aku menganjurkan umat manusia dan para hamba untuk berjalan menuju Rabb mereka, dan aku menghimbau mereka untuk menyambutnya dan memperingatkan mereka dari perkara-perkara yang menjauhkan mereka dariNya. Ditambah lagi, bahwa aku “(mengajak) dengan hujjah yang nyata”, yang berasal dari agamaku. Maksudnya, aku bertumpu pada ilmu dan keyakinan tanpa ada unsur syak, kebimbangan dan keraguan. Begitu pula, “orang-orang yang mengikutiku”, mereka mengajak kepada Allah sebagaimana aku mengajak berdasarkan hujjah yang nyata tentang urusan (yang mereka dakwahkan). “Mahasuci Allah”, dari hal-hal yang dinisbatkan kepada Allah dari sesuatu yang tidak pantas dengan keagungannya atau menafikan kesempurnaanNya. “Dan aku tiada termasuk orang-orang yang musyrik”, pada semua urusanku. Bahkan aku hanya menyembah Allah dengan memurnikan agama bagiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (هَٰذِهِۦ سَبِيلِيٓ) haadzihi sabiilii : dakwahku dan jalanku yang aku tempuh. (عَلَىٰ بَصِيرَةٍ) ‘alaa bashiirah : di atas ilmu dan keyakinanku. (وَسُبۡحَٰنَ ٱللَّهِ) wa subhaanallaah : Maha suci Allah dari segala sekutu dalam hal kekuasaan ataupun ibadah. Adapun ayat yang kedua (108), Allah telah memerintahkan kepada rasul-Nya untuk melanjutkan dakwahnya—dakwah menuju kebaikan—dan juga orang-orang yang beriman bersamanya, firman-Nya : (قُلۡ هَٰذِهِۦ سَبِيلِيٓ) “Katakanlah wahai Rasul, kepada manusia: “Inilah jalanku dalam berdakwah kepada Rabbku, dengan kalian beriman kepada-Nya, hanya menyembah kepada-Nya dan mentauhidkannya. (أَدۡعُوٓاْ إِلَى ٱللَّهِۚ عَلَىٰ بَصِيرَةٍ) di atas ilmu yang pasti akan kepada siapa aku mengajak, dengan apa aku berdakwah, serta segala efek dan hasil dari dakwah ini, (أَنَا۠ وَمَنِ ٱتَّبَعَنِيۖ) dari kalangan orang-orang beriman, kami semua berdakwah kepada Allah ta’ala berdasarkan ilmu. Firman-Nya : (وَسُبۡحَٰنَ ٱللَّهِ) Katakanlah, “Maha Suci Allah”, pensucian atas-Nya dari segala sekutu atau anak, dan katakanlah dan umumkanlah bahwa engkau berlepas diri dari kesyirikan dan pelakunya: (وَمَآ أَنَا۠ مِنَ ٱلۡمُشۡرِكِينَ) dan aku tidak termasuk golongan orang-orang musyrik. Inilah makna dari ayat kedua (108). Pelajaran dari ayat : • Wajibnya berdakwah kepada agama Allah ta’ala bagi orang mukmin yang mengikuti Rasul shallahu ‘alaihi wa sallam. • Wajibnya seorang da’i untuk mempunyai ilmu yang yakin akan apa yang ia dakwahkan, karena itulah bashirah yang dimaksud dalam ayat tersebut. • Wajibnya mentauhidkan Allah ta’ala, dalam uluhiyah, rububiyyah,dan asma’ wa shifat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 108: Yang aku mengajak kepadanya. Ia merupakan jalan yang menghubungkan kepada Allah dan surga-Nya. Jalan yang di dalamnya mengandung ilmu (pengetahuan) terhadap kebenaran, mengamalkannya, mengutamakannya, serta mengikhlaskan karena Allah dalam menjalankan agama itu. Di atas ilmu dan keyakinan tanpa keraguan. Dari segala sesuatu yang dinisbatkan kepada-Nya padahal tidak sesuai dengan keagungan-Nya atau menafikan kesempurnaan-Nya. Dalam semua urusanku, bahkan aku menjalankan agama ikhlas karena Allah Ta’ala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 108",
    "description": "Allah menjelaskan bahwa kebanyakan manusia berpaling dan tetap enggan menerima kebenaran tentang keesaan-Nya. Allah lalu berpesan kepada rasulullah, katakanlah, wahai Muhammad, 'inilah jalan yang Allah tunjukkan ke-pada-ku. Aku dan orang-orang yang beriman dan beramal saleh yang mengikutiku mengajak kamu kepada Allah dengan yakin serta mengandung bukti-bukti yang mengetuk akal dan perasaan manusia. Mahasuci Allah dengan segala kesempurnaan-Nya, dan aku tidak termasuk orang-orang musyrik yang mempersekutukan Allah dengan yang lain. Setelah pada ayat yang lalu Allah memperingatkan siksa yang tidak dapat dihindari serta datangnya hari kiamat yang tidak terduga sebagai balasan atas keberpalingan manusia dari tuntunan para rasul, lalu pada ayat berikut Allah menjelaskan makna pengutusan para rasul. Kami tidak mengutus nabi dan rasul sebelummu, wahai nabi Muhammad, melainkan orang laki-laki, yakni manusia pilihan, yang kami berikan wahyu kepadanya di antara penduduk negeri tempat para nabi dan rasul itu tinggal. Tidakkah mereka, yakni manusia dan secara khusus kaum musyrik mekah, bepergian di bumi sehingga mereka dapat melihat bagaimana kesudahan orang-orang sebelum mereka yang mendustakan para nabi dan rasul' dan sungguh, negeri akhirat itu lebih baik bagi orang yang bertakwa dibandingkan dengan kemegahan dan kemewahan dunia. Tidakkah kamu mengerti dan bisa berpikir jernih untuk menerima kebenaran yang dibawa para nabi dan rasul tersebut'."
  }
]