[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidaklah mengutus sebelummu (wahai Rasul), kepada manusia kecuali laki-laki dari mereka, yang kami turunkan kepada mereka wahyu kami, dan mereka termasuk penduduk kota. Karena mereka akan lebih mampu memahami dakwah dan mengemban risalah. Orang-orang yang mendapatkan hidayah kebenarana akan mengimani mereka. Dan orang-orang yang sesat akan mendustakan mereka. Apakah mereka tidak berjalan di muka bumi, sehingga mereka dapat menyaksikan dengan mata kepalanya sendiri bagaiman kesudahan orang-orang yang mendustakan yang terdahulu dan kebinasaan yang menimpa mereka? Dan sungguh pahala akhirat lebih utama daripada dunia dan semua yang ada di dalamnya bagi orang-orang yang beriman dan Takut terhadap Tuhan mereka. Apakah kalian tidak berpikir dan kemudian mengambil pelajaran darinya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Dan tidaklah Kami mengutus para Rasul sebelum engkau -wahai Rasul- melainkan laki-laki dari bangsa manusia bukan Malaikat. Kami memberikan wahyu kepada mereka sebagaimana Kami memberikan wahyu kepadamu. Mereka berasal dari penduduk kota bukan penghuni belantara. Tetapi mereka didustakan oleh umat-umat mereka. Maka Kami binasakan mereka. Tidakkah orang-orang yang mendustakanmu itu berkelana di muka bumi kemudian berpikir tentang bagaimana nasib orang-orang kafir sebelum mereka, lalu mereka jadikan sebagai pelajaran?! Dan kenikmatan yang ada di Akhirat tentu lebih baik bagi orang-orang yang bertakwa kepada Allah di dunia. Apakah kalian tidak mengerti bahwa kenikmatan Akhirat itu lebih baik sehingga kalian mau bertakwa kepada Allah dengan cara menjalankan perintah-perintah-Nya, terutama perintah untuk beriman kepada-Nya, dan menjauhi larangan-larangan-Nya, terutama larangan menyekutukan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Hai Nabi, Kami tidak mengutus para nabi sebelummu melainkan dari kalangan laki-laki, bukan dari jenis malaikat. Kami mewahyukan kepada mereka risalah. Mereka adalah para penduduk kota yang memiliki peradaban karena mereka lebih banyak ilmunya. Apakah orang-orang musyrik itu tidak pernah berjalan di muka bumi, sehingga mereka dapat melihat tempat-tempat binasanya umat-umat terdahulu yang mendustakan? Sungguh pahala di kehidupan akhirat yang kekal lebih baik daripada kenikmatan dunia yang fana bagi orang—orang yang bertakwa kepada Tuhan mereka, apakah mereka tidak mau mengikuti kebenaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. وَمَآ أَرْسَلْنَا مِن قَبْلِكَ إِلَّا رِجَالًا (Kami tidak mengutus sebelum kamu, melainkan orang laki-laki) Dan bukan dari golongan malaikat. Lalu mengapa mereka mengingkari pengutusanmu. نُّوحِىٓ إِلَيْهِم (yang Kami berikan wahyu kepadanya) Sebagaimana Kami memberikan wahyu kepadamu. مِّنْ أَهْلِ الْقُرَىٰٓ ۗ (diantara penduduk negeri) Yakni penduduk negeri-negeri. كَيْفَ كَانَ عٰقِبَةُ الَّذِينَ مِن قَبْلِهِمْ ۗ (Maka tidakkah mereka bepergian di muka bumi lalu melihat bagaimana kesudahan orang-orang sebelum mereka) Yakni tidakkah orang-orang musyrik itu bepergian di bumi Allah agar mereka melihat tempat-tempat kebinasaan umat-umat terdahulu, sehingga mereka dapat mengambil pelajaran agar mereka berhanti dari kekafiran mereka. وَلَدَارُ الْاٰخِرَةِ خَيْرٌ لِّلَّذِينَ اتَّقَوْا۟ ۗ( dan sesungguhnya kampung akhirat adalah lebih baik bagi orang-orang yang bertakwa) Yakni surga lebih baik bagi orang-orang bertakwa daripada kehidupan dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Wahai Rasulallah, Kami tidak mengutus rasul sebelummu, kecuali para laki-laki (manusia) bukan malaikat, seperti kamu, Kami memberi wahyu mereka dengan risalah untuk memberi petunjuk manusia yang berasal dari penduduk negeri yang menetap. Apakah orang-orang musyrik itu tidak bepergian di bumi Allah sehingga mereka melihat takdir dan kehancuran umat-umat pendusta yang dahulu, lalu mereka bisa mengambil pelajaran. Akhirat dan segala isinya berupa keabadian dan kenikmatan muthlak itu lebih baik daripada dunia yang fana, bagi orang-orang yang bertakwa kepada Allah dengan berbuat taat dan menjauhi maksiat. Apakah kalian tidak berpikir tentang sebab dan akibatnya, lalu kalian bisa beriman?!."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus sebelummu, kecuali laki-laki yang Kami beri wahyu kepada mereka di antara penduduk negeri} penduduk kota bukan penduduk pedalaman {Tidakkah mereka berjalan di bumi lalu memperhatikan bagaimana akibat orang-orang sebelum mereka. Sungguh negeri akhirat itu lebih baik bagi orang-orang yang bertakwa. Apakah kalian tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. Selanjutnya Allah berfirman, “Kami tidak mengutus sebelum kamu, melainkan orang laki-laki”, maksudnya Kami tidak mengutus dari golongan malaikat dan tidak pula selain mereka dari golongan makhluk-makhluk lainnya. Mengapa kaummu menganggap aneh risalah (yang engkau bawa) dan mengklaim bahwa dirimu tidak memiliki keutamaan apa pun atas mereka. Engkau memiliki teladan yang baik dari para rasul yang diutus sebelummu, “yang Kami berikan wahyu kepada mereka di antara penduduk negeri”, maksudnya bukan dari perdusunan. Justru dari penduduk negeri yang mana mereka itu akal-akalnya lebih sempurna dan pikirannya pun lebih akurat, supaya urusan mereka menjadi jelas dan kepentingan mereka menjadi terang. “Maka tidaklah mereka bepergian di muka bumi”, jika mereka tidak mempercayai perkataanmu, “lalu melihat bagaimana kesudahan orang-orang sebelum mereka (yang mendustakan rasul)”, bagaimana Allah membinasakan mereka atas pendustaan yang mereka lakukan. Maka berhati-hatilah, (jangan sampai) kalian berkubang pada kebiasaan yang mereka kerjakan, akibatnya kalian akan ditimpa azab yang telah menimp mereka “dan sesungguhnya kampung akhirat”, surga dengan seisinya berupa kenikmatan yang lestari “adalah lebih baik bagi orang-orang yang bertakwa”, kepada Allah dengan menaati perintah-perintahNya dan menjauhi larangan-laranganNya. Karena kenikmatan dunia menyussahkan, menyulitkan, dan pasti akan berhenti. Sedangkan kenikmatan akhirat adalah sempurna, paripurna tidak lenyap selamanya. Bahkan abadi dengan selalu mengalami pertambahan dan kontinyu, dan pemberian yang tiada pernah terputus. “Maka tidakkah kamu memikirkannya?” tidakkah kalian mempunyai akal sehat yang mau mengedepankan sesuatu yang lebih baik daripada yang kenikmatan yang lebih rendah?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَهۡلِ ٱلۡقُرَىٰٓۗ) min ahlil quraa : dari penduduk negeri atau kota, bukan dari penduduk desa. (لِّلَّذِينَ ٱتَّقَوۡاْۚ) lilladziinattaqau : orang-orang yang bertakwa kepada Allah dengan mengerjakan kewajiban dan meninggalkan larangan. (أَفَلَا تَعۡقِلُونَ) afalaa ta’qiluun : tidakkah mereka orang-orang musyrik itu memikirkan apa yang telah dibacakan dan dijelaskan kepada mereka, sehingga mereka mau beriman dan mentauhidkan Allah. Makna ayat : Adapun ayat yang ketiga, Allah ta’ala mengabarkan kepada rasul-Nya bahwa tidak ada dari para rasul yang diutus sebelumnya melainkan mereka adalah laki-laki, tidak ada dari kalangan wanita tidak pula dari malaikat ( نُّوحِيٓ إِلَيۡهِم مِّنۡ أَهۡلِ ٱلۡقُرَىٰٓۗ) yang Kami beri wahyu dari kalangan penduduk negeri. Ini adalah bantahan bagi orang yang mengingkari bahwa seorang rasul adalah dari kalangan laki-laki. Firman-Nya : (أَفَلَمۡ يَسِيرُواْ) Apakah mereka para pendusta dari kalangan Quraisy dan selain mereka berjalan (فِي ٱلۡأَرۡضِ) di atas muka bumi untuk mengambil pelajaran (فَيَنظُرُواْ) maka mereka melihat bagaimana akhir dari pendahulu mereka dari umat-umat terdahulu, seperti ‘Ad dan Tsamud, Kami sungguh telah memusnahkan mereka dan Kami selamatkan orang-orang beriman dan bertauhid dari kalangan mereka dan para rasul. Keselamatan ini merupakan buah dari keimanan mereka dan ketakwaan. (وَلَدَارُ ٱلۡأٓخِرَةِ خَيۡرٞ لِّلَّذِينَ ٱتَّقَوۡاْۚ) Sungguh negeri akhirat, negeri kenikmatan yang abadi, dan keselamatan dari segala kesulitan, kesengsaraan, masa tua, kematian, dan kefanaan. Firman-Nya pada akhir ayat : (أَفَلَا تَعۡقِلُونَ) Allah menghina para musyrikin yang terus menerus mendustakan para rasul dan tetap di atas kesyirikan, bahwa mereka tidak berakal dan tidak bisa paham apa yang telah dibacakan dan mereka dengarkan berupa ayat-ayat Al-Qur’an serta apa yang mereka saksikan dari tanda-tanda alam semesta. Pelajaran dari ayat : • Kerasulan hanya ada pada laki-laki, sehingga tidak ada rasul dari kalangan wanita. • Penjelasan buah dari tauhid dan takwa di dunia dan di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 109: Bukan malaikat. Karena mereka lebih berpengetahuan, dan lebih sempurna akalnya, serta lebih santun, berbeda dengan penduduk dusun padang pasir (baduwi) yang kasar lagi tidak berpengetahuan. Jika mereka masih tidak mau membenarkan seruanmu. Di mana mereka dibinasakan Allah karena mendustakan rasul. Oleh karena itu, hendaknya mereka berhati-hati jika mereka tetap seperti itu, Allah akan membinasakan mereka sebagaimana generasi sebelum mereka dahulu. Yakni surga dan kenikmatan yang ada di dalamnya. Yaitu mereka yang menjalankan perintah Allah dan menjauhi larangan-Nya. Hal itu, karena kenikmatan dunia adalah kenikmatan yang tidak sempurna lagi kurang dan sedikit, sebentar dan tidak lama, berbeda dengan kenikmatan akhirat yang sempurna, kekal lagi senantiasa bertambah. Sehingga kamu lebih mengutamakan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 109",
    "description": "Setelah pada ayat yang lalu Allah memperingatkan siksa yang tidak dapat dihindari serta datangnya hari kiamat yang tidak terduga sebagai balasan atas keberpalingan manusia dari tuntunan para rasul, lalu pada ayat berikut Allah menjelaskan makna pengutusan para rasul. Kami tidak mengutus nabi dan rasul sebelummu, wahai nabi Muhammad, melainkan orang laki-laki, yakni manusia pilihan, yang kami berikan wahyu kepadanya di antara penduduk negeri tempat para nabi dan rasul itu tinggal. Tidakkah mereka, yakni manusia dan secara khusus kaum musyrik mekah, bepergian di bumi sehingga mereka dapat melihat bagaimana kesudahan orang-orang sebelum mereka yang mendustakan para nabi dan rasul' dan sungguh, negeri akhirat itu lebih baik bagi orang yang bertakwa dibandingkan dengan kemegahan dan kemewahan dunia. Tidakkah kamu mengerti dan bisa berpikir jernih untuk menerima kebenaran yang dibawa para nabi dan rasul tersebut'dalam menunaikan tugasnya menyampaikan dakwah para nabi dan rasul tidaklah menempuh jalan yang mulus, melainkan penuh rintangan. Kebanyakan manusia bahkan tetap menentang ajakan tersebut, sehingga apabila para rasul menemukan berbagai halangan dan rintangan dalam tugas itu, seakan tidak mempunyai harapan lagi tentang keimanan kaumnya, dan telah meyakini bahwa mereka, para nabi dan rasul, telah didustakan oleh kaumnya, maka pada saat itu datanglah kepada mereka itu pertolongan kami, lalu diselamatkan-lah mereka dan orang yang kami kehendaki untuk selamat. Dan siksa kami tidak dapat ditolak ataupun dihindarkan dari orang-orang yang berdosa."
  }
]