[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berkata saudara-saudara yusuf, setelah bersepakat membuang yusuf, ”wahai ayah kami, mengapa engkau tidak menganggap kami orang-orang yang dapat di percaya atas yusuf, padahal yusuf adalah saudara kami sendiri, sedang kami menginginkan kebaikan baginya, menyayanginya dan perhatian kepadanya, serta mengistimewakan dengan niat tulus kami kepadanya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Setelah sepakat untuk membuang Yusuf mereka berkata kepada ayah mereka, Ya'qūb , \"Wahai Ayah kami! Mengapa engkau tidak mempercayakan Yusuf kepada kami? Sesungguhnya kami benar-benar menyayanginya. Kami siap menjaganya dari setiap bahaya yang mengancamnya. Kami siap menjaga dan melindunginya sampai dia kembali kepadamu dengan selamat. Jadi, mengapa engkau tidak mau melepasnya untuk pergi bersama kami?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. قَالُوا۟ يٰٓأَبَانَا مَا لَكَ لَا تَأْمَ۫نَّا عَلَىٰ يُوسُفَ (Mereka berkata: “Wahai ayah kami, apa sebabnya kamu tidak mempercayai kami terhadap Yusuf) Ketika itu nabi Ya’kub tidak rela untuk membiarkan nabi Yusuf pergi bersama mereka karena besarnya cinta kepadanya, dan hal ini karena ia mengkhawatirkan nabi Yusuf dari makar mereka, dan kemungkinan mereka telah meminta nabi Ya’kub agar dapat membawa pergi Yusuf bersama mereka namun ia menolak. وَإِنَّا لَهُۥ لَنٰصِحُونَ (padahal sesungguhnya kami adalah orang-orang yang mengingini kebaikan baginya) Dengan menjaga dan melindunginya sehingga kami dapat mengembalikannya kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Setelah sepakat untuk menjauhkan Yusuf, saudara-saudaranya tersebut berkata: “Wahai ayah, kenapa engkau tidak mempercayai kami dan mengkhawatirkan apa yang kami perbuat atas Yusuf, padahal kami adalah orang yang akan bersimpati dan menginginkan kebaikan baginya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai ayah kami, mengapa engkau tidak mempercayai kami atas Yusuf, sesungguhnya kami benar-benar menginginkan kebaikan baginya} sesungguhnya kami benar-benar orang yang mengasihinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. untuk dapat mewujudkan tujuan, saudara saudara yusuf berkata kepada ayahnya, ”wahai ayah kami, apa sebabnya kamu tidak mempercayai kami terhadap yusuf, padahal sesungguhnya kami adalah orang orang yang menginginkan kebaikan baginya” maksudnya kenapa ada rasa takut yang merasuki hatimu kepada kami atas (keselamatan) yusuf tanpa sebab dan alasan (yang jelas). Padahal, kami adalah “orang orang yang menginginkan (kebaikan) baginya” maksudnya kami sayang kepadanya, maka kami menginginkan kebaikan baginya sebagai mana kami menginginkan kebaikan bagi diri kami. Ini menandakan bahwa ya’qub tidak membiarkan yusuf bepergian bersama saudara saudaranya menuju tempat yang sunyi (lagi jauh) atau tempat serupa lainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَنَٰصِحُونَ) lanaashihuun : Kami sangat sayang kepadanya dan mengharapkan kebaikan untuknya, sebagaimana kami juga suka kepadanya. Makna ayat : Masih mengenai kisah Yusuf. Setelah mereka berdiskusi dan sepakat untuk membuang Yusuf ke dalam sumur, mereka meminta ayah mereka untuk membiarkan Yusuf keluar bersama mereka ke dataran—kebiasaan mereka dalam refreshing dan liburan, melihat ayah mereka kurang percaya terhadap mereka, mereka pun berkata, (مَا لَكَ لَا تَأۡمَ۬نَّا يُوسُفَ وَإِنَّا لَهُۥ لَنَٰصِحُونَ) “Mengapa engkau tidak mempercayakan Yusuf kepada kami, sedangkan kami sangat mencintainya dan kami khawatir bila ia terkena gangguan sedikitpun. Pelajaran dari ayat : • Penetapan kaidah : Tidak ada kekhawatiran terhadap takdir, yaitu kekhawatiran tidak bermanfaat untuk menghalangi hal yang sudah ditakdirkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 11: Yakni karena sebab apa engkau merasa khawatir terhadap tindakan kami kepada Yusuf?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 11",
    "description": "Setelah dipaparkan tentang rencana jahat putra-putra nabi yakub terhadap nabi yusuf, lalu pada ayat ini diuraikan tentang aksi mereka melakukan tipu muslihat yang diawali dengan membujuk sang ayah untuk membawa serta nabi yusuf pergi bersama mereka. Mereka berkata, wahai ayah kami! mengapa engkau tidak memercayai kami sebagai penanggung jawab terhadap saudara kami sendiri yusuf, padahal sesungguhnya kami semua menginginkan kebaikan baginya, dengan membawa serta yusuf bersama kami, dan kami semua akan menjaga dengan baik serta memberinya kasih sayang. Kemudian mereka meminta kembali kepada ayahnya: biarkanlah dia pergi bersama kami besok pagi saat kami pergi menggembala kambing, agar dia bisa bersenang-senang dengan memakan buah-buahan segar dan bermain-main bersama kami dalam perlombaan dan permainan yang diperbolehkan, dan kami pasti menjaganya dengan baik serta melindunginya dari marabahaya."
  }
]