[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu (wahai Rasul), tergasa-gesa mengharapkan pertolongan atas orang-orang yang mendustakanmu. Sebab sesungguhnya rasul-rasul sebelummu, tidaklah datang kepada mereka pertolongan dengan segera, dikarenakan satu hikmah yang Kami ketahui, sampai akhirnya rasul-rasul putus harapan dari keimanan kaum mereka dan menyangka bahwa apa yang diutus kepada mereka sungguh telah mereka dustakan mereka dalam apa yang diberitakan kepada mereka, maka datanglah kepada rosul-rosul Kami pertolongan dari Kami, ketika kesulitan kian berat. Kemudian Kami menyelamatkan rasul-rasul dan para pengikut mereka yang kami kehendaki, dan siksaan Kami tidak dapat di tolak dari orang-orang yang berbuat kejahatan dan berani lancing terhadap Allah. Disini terkandung hiburan bagi Nabi ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Orang-orang yang memusuhi para Rasul yang kami utus itu Kami tangguhkan hukumannya dan tidak kami segerakan untuk mengecoh mereka. Sampai ketika mereka tidak kunjung binasa dan para Rasul merasa putus asa dalam menanti kebinasaan mereka, sementara orang-orang kafir menyangka bahwa Rasul-rasul mereka telah mendustai mereka tentang ancaman hukuman bagi orang-orang yang ingkar maupun janji untuk menyelamatkan orang-orang yang beriman, tiba-tiba pertolongan Kami datang kepada Rasul-rasul Kami, dan Kami selamatkan para Rasul dan orang-orang beriman dari azab yang menimpa orang-orang yang ingkar. Dan tidak ada seorangpun yang mampu menangkal azab Kami ketika Kami menurunkannya kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Hai Rasulullah, janganlah kamu merasa kedatangan pertolongan sangat lama, karena para rasul sebelummu tidak pernah segera mendapat pertolongan; namun ketika para rasul itu telah putus asa dari keimanan para kaum mereka dan yakin kaum-kaum itu telah mendustakan dan menghinakan mereka, maka saat itu datang pertolongan dan janji Kami pada waktu yang sulit tersebut; sehingga Kami membinasakan orang-orang yang mendustakan dan menyelamatkan para rasul dan orang-orang beriman sebagaimana kehendak Kami; sungguh tidak ada yang dapat menolak siksaan yang menimpa orang-orang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. حَتَّىٰٓ إِذَا اسْتَيْـَٔسَ الرُّسُلُ (Sehingga apabila para rasul tidak mempunyai harapan lagi) Datangnya pertolongan dengan siksaan kepada kaumnya yang belum juga datang. وَظَنُّوٓا۟ أَنَّهُمْ قَدْ كُذِبُوا۟( dan telah meyakini bahwa mereka telah didustakan) Para rasul merasa bahwa kemenangan lama sekali kedatangannya, sehingga hati mereka berkata bahwa pertolongan yang dijanjikan kepada mereka itu tidak akan datang. Penafsiran ini diriwayatkan dari Ibnu Abbas. جَآءَهُمْ نَصْرُنَا (datanglah kepada para rasul itu pertolongan Kami) Yakni pertolongan dari Allah datang kepada mereka dengan tiba-tiba. فَنُجِّىَ مَن نَّشَآءُ ۖ (lalu diselamatkan orang-orang yang Kami kehendaki) Mereka adalah para rasul dan orang-orang yang beriman kepada mereka. Sedangkan orang-orang yang mendustakannya dibinasakan. وَلَا يُرَدُّ بَأْسُنَا عَنِ الْقَوْمِ الْمُجْرِمِينَ (Dan tidak dapat ditolak siksa Kami dari pada orang-orang yang berdosa) Apabila siksa itu telah menimpa mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { حَتَّىٰ إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّوا أَنَّهُمْ قَدْ كُذِبُوا } “Sehingga apabila para rasul tidak mempunyai harapan lagi (tentang keimanan mereka) dan telah meyakini bahwa mereka telah didustaka” , { مَسَّتْهُمُ الْبَأْسَاءُ وَالضَّرَّاءُ وَزُلْزِلُوا حَتَّىٰ يَقُولَ الرَّسُولُ وَالَّذِينَ آمَنُوا مَعَهُ مَتَىٰ نَصْرُ اللَّ } \"Mereka ditimpa oleh malapetaka dan kesengsaraan, serta digoncangkan (dengan bermacam-macam cobaan) sehingga berkatalah Rasul dan orang-orang yang beriman bersamanya: “Bilakah datangnya pertolongan Allah?” [ Al-Baqarah : 214 ]. Apakah ada bukti yang menunjukkan kerasnya rintangan yang lebih dari ini? dan bahwasanya rinyangan itu telah menimpa manusia-manusia pilihan dan mereka adalah para Rasul, namun setelah rintangan itu terlewati pertolongan menghampiri mereka : { جَاءَهُمْ نَصْرُنَا } , { أَلَا إِنَّ نَصْرَ اللَّهِ قَرِيبٌ }. 2 ). Ayat ini senantiasa mengantisipasi para da'i bahwa kelak mereka akan keluar dari kesempitan itu menuju kelapangan yang menggembirakan, sebagai kabar gembira akan kehidupan yang dinanti-nanti, dan masa depan yang menjanjikan, sekalipun ujian dan cobaan amat besar menimpa, dan berbagai masalah yang terus berdatangan; namun hakikatnya semua itu menjadi pensuci diri dosa dan kesalahan, sebagai penuntun dari kelalaian, dan semuanya adalah baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Sehingga rasul putus asa dengan keimanan kaumnya dan meyakini bahwa kaumnya menganggap para rasul itu mengingkari apa yang mereka janjikan berupa pertolongan, maka akan datang seketika pertolongan Kami kepada mereka. Lalu Allah menyelamatkan hamba-hambanya yaitu nabi dan orang-orang yang beriman dari azab. Dan azab kami terhadap orang-orang musyrik yang mendustakan para rasul itu tidak bisa kembali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sehingga apabila para rasul itu putus asa} para rasul itu putus asa atas keimanan kaum mereka {dan meyakini bahwa mereka benar-benar telah didustakan} Kaum itu meyakini bahwa para rasul itu telah dibohongi tentang apa yang dijanjikan kepada mereka berupa pertolongan {lalu datang kepada mereka pertolongan Kami, lalu diselamatkanlah orang yang Kami kehendaki. Tidak dapat ditolak siksa Kami} azab Kami {dari kaum pendosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. Allah memberitahukan bahwa Dia mengutus para rasul ynag mulia. Namun kaum yang jahat lagi pencela mendustakan mereka. Allah masih menyediakan tempo bagi mereka agar kembali menuju kebenaran. Allah senantiasa menagguhkan mereka sampai pada level kekerasan sikap mereka yang dahsyat terhadap para rasul. Sampai-sampai para rasul meski memiliki keyakinan yang sempurna dan kekuatan kepercayaan mereka kepada janji Allah dan ancamanNya, boleh jadi terlintas pada hati mereka keputusasaan dan kelemahan dalam ilmu dan kepercayaan. Apabila kondisi mereka sudah mencapai tingkat ini “datanglah kepada rasul itu pertolongan Kami, lalu diselamatkanlah orang-orang yang Kami kehendaki.” Mereka itu adalah para rasul dan penganut mereka “Dan tidak dapat ditolak siksa Kami dari orang-orang yang berdosa”, maksudnya siksaan Kami tidak bisa ditampik dari orang-orang yang berbuat dosa dan nekat (berbuat buruk) terhadap Allah. Tiada kekuatan dan penolong bagi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱسۡتَيۡ‍َٔسَ ٱلرُّسُلُ) istaiasar rusul : ketika mereka para rasul sudah putus asa dari keimanan kaumnya. (وَظَنُّوٓاْ أَنَّهُمۡ قَدۡ كُذِبُواْ) wa zhannuu annahum qad kudzibuu : umat-umat yang diutus para rasul kepada mereka merasa bahwa rasul-rasul mereka telah mengingkari apa yang mereka janjikan berupa kemenangan. (وَلَا يُرَدُّ بَأۡسُنَا) wa laa yuraddu ba’sunaa : azab Kami yang pedih tidak akan bisa ditolak. (عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِينَ) ‘anil qaumil mujrimiin : orang-orang yang berbuat buruk kepada dirinya sendiri dengan kesyirikan dan maksiat serta kepada orang lain dengan menjauhkan mereka dari keimanan. Makna ayat : Ayat-ayat ini masih berkaitan dengan ajakan beriman dan tauhid, firman-Nya : (وَمَآ أَرۡسَلۡنَا) rasul yang Kami utus senantiasa berdakwah dan melanjutkannya, serta kemenangan mereka tertunda hingga keputus asaan merasuk ke dalam hati mereka. sehingga pengikut mereka mengira bahwa rasul-rasul ini telah mengingkari janji, yaitu datangnya pertolongan dan hancurnya para musuh-musuhnya (جَآءَهُمۡ) setelah mereka berputus asa, datanglah pertolongan Kami (نَصۡرُنَا فَنُجِّيَ مَن نَّشَآءُۖ وَلَا يُرَدُّ بَأۡسُنَا عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِينَ) maka Kami selamatkan siapa saja yang Kami kehendaki, dan tidak ada yang dapat menolak siksaan Kami terhadap orang-orang yang jahat. Inilah penjelasan pada ayat yang pertama (حَتَّىٰٓ إِذَا ٱسۡتَيۡ‍َٔسَ ٱلرُّسُلُ وَظَنُّوٓاْ أَنَّهُمۡ قَدۡ كُذِبُواْ جَآءَهُمۡ نَصۡرُنَا فَنُجِّيَ مَن نَّشَآءُۖ وَلَا يُرَدُّ بَأۡسُنَا عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِينَ) yaitu orang-orang yang melakukan kesyirikan dan maksiat. Pelajaran dari ayat : • Penjelasan ketentuan Allah, diundurnya pertolongan untuk rasul-rasul-Nya dan orang-orang beriman, sebagai bekal tambahan untuk akhirat, serta seleksi. Kemudian datanglah pertolongan Allah sehingga para wali-Nya menjadi mulia dan terhinalah musuh-musuhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 110: Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia telah mengutus para rasul kepada setiap umat, lalu kaumnya mendustakan, namun Allah menangguhkan mereka agar mereka kembali kepada kebenaran, dan Allah senantiasa menangguhkan mereka sampai pada saat rasul tidak mempunyai harapan lagi tentang keimanan kaumnya, maka datanglah pertolongan-Nya dengan diselamatkan para rasul dan pengikutnya dan dibinasakan orang-orang yang mendustakan itu. Yakni kaumnya tetap tidak akan beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 110",
    "description": "Dalam menunaikan tugasnya menyampaikan dakwah para nabi dan rasul tidaklah menempuh jalan yang mulus, melainkan penuh rintangan. Kebanyakan manusia bahkan tetap menentang ajakan tersebut, sehingga apabila para rasul menemukan berbagai halangan dan rintangan dalam tugas itu, seakan tidak mempunyai harapan lagi tentang keimanan kaumnya, dan telah meyakini bahwa mereka, para nabi dan rasul, telah didustakan oleh kaumnya, maka pada saat itu datanglah kepada mereka itu pertolongan kami, lalu diselamatkan-lah mereka dan orang yang kami kehendaki untuk selamat. Dan siksa kami tidak dapat ditolak ataupun dihindarkan dari orang-orang yang berdosa. Sebagai penutup surah yusuf, Allah kembali mengingatkan bahwa pada kisah para nabi dan rasul, termasuk kisah nabi yusuf, terkandung pesan-pesan untuk dipelajari dan dihayati manusia. Sungguh, pada kisah-kisah mereka itu terdapat pengajaran bagi orang yang mempunyai akal. Kisah-kisah dalam Al-Qur'an itu bukanlah cerita yang dibuat-buat atau sekadar dongeng pelipur lara, tetapi kisah-kisah itu membenarkan kandungan kitab-kitab yang sebelumnya, yaitu taurat, zabur, dan injil, yang menjelaskan segala sesuatu tentang prinsip-prinsip nilai yang dibutuhkan manusia guna mencapai kebahagiaan dunia dan akhirat, dan sebagai petunjuk menuju jalan lurus dan rahmat yang penuh berkah bagi orangorang yang beriman. Surah yusuf dimulai dengan pernyataan bahwa Al-Qur'an adalah ayatayat dari kitab yang nyata. Al-qur'an menceritakan kisah-kisah terbaik sepanjang perjalanan sejarah kemanusiaan. Surah ini kemudian ditutup dengan ayat yang menegaskan kembali adanya pelajaran pada kisah-kisah itu bagi orang-orang yang berakal. Hal ini merupakan bukti keserasian dan keruntunan dari kandungan Al-Qur'an."
  }
]