[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dalam kisah rasul-rasul yang kami kisahkan padamu dan siksaan yang menimpa orang-orang yang mendustakan terhadap palajaran bagi orang-orang yang berakal sehat. Al-Quran’ ini bukanlah perkataan dusta yang diada-adakan. Akan tetapi, kami menurunkanya sebagai saksi atas kebenaran kitab-kitab suci samawi yang mendahuluinya dan bahwasanya kitab-kitab itu dari sisi Allah dan penjelasan tentang hal-hal yang di butuhkan oleh hamba-hamba, tentang perkara yang dihalalkan, diharamkan, dicintai dan dibenci dan lain sebagainya, dan petunjuk penyelamat dari kesesatan, dan rahmat bagi orang-orang beriman, yang dengan itu hati mereka mendapatkan hidayah, lalu mereka mengerjakan kandungannya, yaitu (menjalankan) perintah-perintah dan (menjauhi) larangan-larangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Sesungguhnya kisah-kisah tentang para Rasul dan umat-umatnya, dan kisah Yusuf dan saudara-saudaranya benar-benar mengandung pelajaran berharga bagi orang-orang yang berakal sehat. Tidak sepatutnya Al-Qur`ān yang memuat kisah-kisah itu disebut sebagai ucapan yang dibuat-buat atas nama Allah. Akan tetapi Al-Qur`ān adalah Kitab Suci yang membenarkan kitab-kitab samawi yang diturunkan dari sisi Allah, menjelaskan hal-hal yang perlu dijelaskan secara rinci, seperti masalah hukum dan ketentuan syariat, membimbing kepada setiap kebaikan, dan menjadi rahmat bagi orang-orang yang beriman kepadanya. Karena merekalah yang akan memanfaatkan apa yang terkandung di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Sungguh, dalam kisah-kisah para rasul dan apa yang menimpa umat-umat yang mendustakan terdapat pelajaran yang besar bagi orang-orang yang memiliki akal yang sehat. Al-Qur’an ini bukanlah perkataan yang dibuat-buat, akan tetapi Kami menurunkannya sebagai pembenar kitab-kitab sebelumnya, penjelas bagi setiap perkara agama yang dibutuhkan para hamba, petunjuk bagi manusia dari kesesatan setan, dan rahmat di dunia dan di akhirat bagi orang-orang yang beriman kepada Allah dan para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. لَقَدْ كَانَ فِى قَصَصِهِمْ(Sesungguhnya pada kisah-kisah mereka itu) Yakni kisah-kisah para Rasul dan umat-umatnya. Atau kisah-kisah Nabi Yusuf dan saudara-saudaranya dan kedua orang tuanya. عِبْرَةٌ لِّأُو۟لِى الْأَلْبٰبِ ۗ (terdapat pengajaran bagi orang-orang yang mempunyai akal) Makna (العبرة) yakni petunjuk yang membebaskan seseorang dari kebodohan dan kebingungan. Makna (أولو الألباب) yakni orang-orang yang mempunyai akal sehat yang menggunakan akal mereka untuk berpikir, sehingga mereka mengetahui apa yang bermanfaat bagi agama mereka. مَا كَانَ حَدِيثًا يُفْتَرَىٰ (Al Quran itu bukanlah cerita yang dibuat-buat) Yakni al-Qur’an yang mengandung kisah-kisah tersebut bukanlah sebuah firman yang dibuat-buat. وَلٰكِن تَصْدِيقَ الَّذِى بَيْنَ يَدَيْهِ (akan tetapi membenarkan (kitab-kitab) yang sebelumnya) Yakni kitab-kitab yang diturunkan Allah seperti Taurat, Injil, dan Zabur. وَتَفْصِيلَ كُلِّ شَىْءٍ (dan menjelaskan segala sesuatu) Yakni menjelaskan syariat-syariat, kaidah-kaidah, dan hukum-hukum yang butuh penjelasan. وَهُدًى (dan sebagai petunjuk) Petunjuk di dunia bagi orang yang dikehendaki Allah mendapatkan petunjuk. وَرَحْمَةً (dan rahmat) Rahmat di akhirat bagi hamba-hamba-Nya yang beramal shalih. لِّقَوْمٍ يُؤْمِنُونَ(bagi kaum yang beriman) Yakni yang percaya kepadanya dan kepada isi kandungannya yang berupa keimanan kepada Allah, para malaikat-Nya, rasul-rasul-Nya, kitab-kitab-Nya, syariat-syariat-Nya, dan takdir-Nya. Adapun orang yang tidak beriman kepadanya maka al-Qur’an tidak akan memberi manfaat baginya dan tidak akan mendapat petunjuk darinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ لَقَدْ كَانَ فِي قَصَصِهِمْ عِبْرَةٌ لِأُولِي الْأَلْبَابِ ۗ } Sesungguhnya ungkapan yang mengatakan bahwa kisah-kisah dalam al-qur'an hanyalah sebatas sejarah adalah ungkapan bathil dan al-qur'an sangat suci dari ungkapan semacam ini! bahkan kisah-kisahnya adalah mutiara sejarah, orang-orang sudah faham bagaimana mereka mengambil pelajaran dari sejarah!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Dan sungguh dalam kisah para rasul itu ada pelajaran dan nasehat bagi orang yang memiliki akal sehat. Dan Al-Qur’an ini bukanlah kalam yang dibuat-buat, namun datang untuk membenarkan kitab yang datang sebelumnya, menjelaskan segala sesuatu berupa hukum-hukum akidah, agama dan syariat, menunjukkan dari kesesatan menuju setiap kebaikan, dan rahmat untuk mendapatkan kebaikan dunia akhirat bagi kaum yang mengimaninya, dan mengkhususkannya untuk berdzikir agar mendapat manfaat darinya, bukan untuk orang selain mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh pada kisah mereka} cerita para rasul dan umat mereka {terdapat pelajaran} pengingat dan pelajaran {bagi orang-orang yang berakal sehat. bukanlah cerita yang dibuat-buat} yang dibuat-buat {melainkan pembenar yang sebelumnya, memerinci} menjelaskan {segala sesuatu, sebagai petunjuk, dan rahmat bagi kaum yang beriman}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. “Sesungguhnya pada kisah-kisah mereka itu”, yaitu kisah-kisah para nabi dan rasul bersama kaum mereka “terdapat pengajaran bagi orang-orang yang mempunyai akal”, maksudnya orang-orang yang baik dan orang-orang yang jahat akan memetik pelajaran darinya, dan bahwa siapa saja yang melakukan perbuatan seperti yang mereka kerjakan, maka dia pasti akan menuai kemuliaan atau penghinaan. Mereka juga dapat mengambil pelajaran berkaitan dengan sifat-sifat milik Allah yang sempurna dan hikmah yang agung. Dan bahwasanya Dia-lah Allah yang tidak sepantasnya peribadahan dilakukan melainkan untukNya semata, tidak ada sekutu bagiNya. Firman Allah “ia (al-Quran itu) bukanlah cerita berita-berita ghaib melaluinya kepada kalian) bukanlah termasuk cerita-cerita rekaan yang dibuat-buat. “akan tetapi , ia “membenarkan (kitab-kitab) yang sebelumnya”, yaitu kitab-kitab terdahulu (yang diturunkan oleh Allah), al-Quran menyelarasi dan mempersaksikan kebenaran kitab-kitab tersebut “dan menjelaskan segala sesuatu”, yang dibutuhkan oleh para hamba, berupa ushuludin (pokok-pokok agama) dan cabang-cabangnya yang berupa dalil-dalil dan petunjuk-petunjuk. “Dan sebagai petunjuk dan rahmat bagi kaum yang beriman”, karena mereka melalui sebab perolehan ilmu tentang al-haq dan sikap pengutamaannya, menjadikan mereka meraih hidayah. Dan lantaran perolehan pahala yang disegerakan (di dunia ini) dan balasan nantinya (di akhirat), maka mereka pun memperoleh rahmat (Allah)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَقَدۡ كَانَ فِي قَصَصِهِمۡ) laqad kaana fii qashashihim : kisah para rasul ‘alaihim salam. (مَا كَانَ حَدِيثٗا يُفۡتَرَىٰ) maa kaana haditsay yuftaraa : Al-Qur’an ini bukanlah perkataan yang dibuat-buat. (تَصۡدِيقَ ٱلَّذِي بَيۡنَ يَدَيۡهِ) tashdiiqal ladzii baina yadaihi : pembenar atas kitab-kitab ilahiyah sebelumnya. Makna ayat : Firman-Nya : (لَقَدۡ كَانَ فِي قَصَصِهِمۡ عِبۡرَةٞ لِّأُوْلِي ٱلۡأَلۡبَٰبِۗ) Sungguh telah ada pelajaran pada kisah-kisah para rasul beserta umat-umat mereka serta kabar dan keadaan mereka yang bermacam-macam, berupa diselamatkannya kaum mukminin dan dihancurkannya orang-orang kafir dan yang mendustakan agama, yang dapat diambil oleh setiap mukmin, sehingga iman mereka menjadi kuat dan takwa mereka menjadi berkelanjutan, dengan melaksanakan kewajiban dan meninggalkan larangan. Ulul Albab adalah orang-orang yang berakal. Firman-Nya : (مَا كَانَ حَدِيثٗا يُفۡتَرَىٰ) Al-Qur’an yang agung ini bukanlah sesuatu yang bisa dikarang-karang oleh manusia. Tetapi Al-Qur’an ini adalah (تَصۡدِيقَ ٱلَّذِي بَيۡنَ يَدَيۡهِ) telah turun sebelumnya Taurat dan Injil, maka Al-Qur’an merupakan pembenar bagi keduanya, dalam perkara pokok keimanan dan tauhid. Ini adalah bukti terbesar bahwa ia merupakan wahyu ilahi sama seperti keduanya, bukan perkataan yang dibuat-buat seperti perkataan orang-orang batil. Firman-Nya : (وَتَفۡصِيلَ كُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ لِّقَوۡمٖ يُؤۡمِنُونَ) sebagaimana Al-Qur’an merupakan pembenar apa yang telah datang, ia juga sebagai penjelas segala sesuatu yang dibutuhkan oleh umat manusia baik itu perkara agama yang dapat mensucikan jiwa mereka, sehingga mereka dapat meraih rahmat Rabbnya dan keridhaan-Nya, hidayah-Nya untuk menerangi jalan dan petunjuk dari kesesatan, rahmat yang akan sampai kepada mukmin yang mengamalkan agamanya serta melaksanakan syariat dan hukum-Nya. Pelajaran dari ayat : • Ancaman dari melakukan perbuatan kerusakan. Perusakan dari sisi akidah, akhlak, syariat, dan hukum. • Penjelasan keutamaan Al-Qur’an dan kandungannya berupa petunjuk dan rahmat bagi yang mencarinya. • Orang-orang yang beriman karena mereka hidup, hanya mereka saja yang dapat meraih manfaat dari Al-Qur’an dan rahmatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 111: Yakni kisah para nabi dan rasul bersama kaumnya. Dari kisah-kisah itu, mereka dapat mengetahui perbuatan yang akan mendatangkan kemuliaan dari Allah dan perbuatan yang mendatangkan kehinaan, mereka pun mengetahui sifat sempurna dan hikmah yang dalam yang dimiliki Allah, dan bahwa tidak ada yang berhak diibadati selain-Nya. Sesuai dengan kitab-kitab terdahulu dan membuktikan kebenarannya. Yang dibutuhkan hamba dalam agama, baik masalah ushul (dasar atau pokok) maupun furu’ (cabang). Sehingga mereka selamat dari kesesatan dan memperoleh rahmat atau memperoleh balasan atau pahala di dunia dan akhirat. Benar, pada kisah-kisah mereka itu terdapat pengajaran bagi orang-orang yang mempunyai akal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 111",
    "description": "Sebagai penutup surah yusuf, Allah kembali mengingatkan bahwa pada kisah para nabi dan rasul, termasuk kisah nabi yusuf, terkandung pesan-pesan untuk dipelajari dan dihayati manusia. Sungguh, pada kisah-kisah mereka itu terdapat pengajaran bagi orang yang mempunyai akal. Kisah-kisah dalam Al-Qur'an itu bukanlah cerita yang dibuat-buat atau sekadar dongeng pelipur lara, tetapi kisah-kisah itu membenarkan kandungan kitab-kitab yang sebelumnya, yaitu taurat, zabur, dan injil, yang menjelaskan segala sesuatu tentang prinsip-prinsip nilai yang dibutuhkan manusia guna mencapai kebahagiaan dunia dan akhirat, dan sebagai petunjuk menuju jalan lurus dan rahmat yang penuh berkah bagi orangorang yang beriman. Surah yusuf dimulai dengan pernyataan bahwa Al-Qur'an adalah ayatayat dari kitab yang nyata. Al-qur'an menceritakan kisah-kisah terbaik sepanjang perjalanan sejarah kemanusiaan. Surah ini kemudian ditutup dengan ayat yang menegaskan kembali adanya pelajaran pada kisah-kisah itu bagi orang-orang yang berakal. Hal ini merupakan bukti keserasian dan keruntunan dari kandungan Al-Qur'an. Alif laam miim raa'. Hanya Allah yang mengetahui maksud ungkapan ini. Itu adalah ayat-ayat kitab Al-Qur'an yang Allah turunkan kepada nabi Muhammad. Ia berisi petunjuk dan ajaran bagi umat manusia. Dan ketahuilah bahwa kitab yang diturunkan kepadamu, wahai nabi Muhammad, dari tuhanmu itu adalah benar dari-Nya, tuhan yang maha mengetahui; tetapi kebanyakan manusia tidak beriman kepada-Nya."
  }
]