[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "biarkanlah dia pergi bersama kami besok, ketika kami pergi keluar menuju padang rumput, tempat kami menggembala, agar dia dapat berlari, beraktifitas, bergembira, dan dapat bermain berloma-lomba dan lainnya dari berbagai macam permainan yang boleh. Dan sesungguhnya kami benar-benar akan menjaganya dari segala yang engkau khawatirkan padanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Izinkanlah kami mengajaknya pergi esok hari untuk bersenang-senang dan bermain. Sesungguhnya kami benar-benar siap menjaganya dari segala hal yang bisa membahayakan keselamatannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Biarkanlah Yusuf pergi bersama kami besok ke tempat menggembala kambing, agar dia dapat bermain dan makan menikmati buah-buahan, tertawa dan bergembira. Sungguh kami akan mengawasinya dan menjaga keselamatannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يَرْتَعْ (agar dia (dapat) bersenang-senang) Bersenang-senang. Makna (اللعب) yakni melakukan permainan yang mubah untuk sekedar menghilangkan penat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Apakah anda termasuk orang yang kerap keluar menghibur diri di tempat rekreasi ? Perhatikan... diantara tabi'at manusia adalah senang beristirahat dan senang tatkala ia keluar dari rumahnya : { أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ } \"Biarkanlah dia pergi bersama kami besok pagi, agar dia (dapat) bersenang-senang dan (dapat) bermain-main\". 2 ). Dari ayat ini diterangkan bahwa ayah mereka tidak menolak anaknya dibawa pergi oleh saudara-saudaranya; menjadi petunjuk bahwa aktifitas keluar jauh dari rumah telah terjadi sejak dahulu, dan ayat ini juga menjadi hujjah bagi kaum yang senang dengan permainan, namun mereka melampaui batas sehingga perkataan-perkataan keji untuk menyesatkan umat manusia dari jalan Allah, tetapi diantara umat manusia ada yang sangat keras dalam permasalahan ini sampai ia berlebih-lebihan, mereka sampai mengaramkan sesuatu yang diperbolehkan; oleh karena itu dalam perkara ini tidak boleh mengharamkan permainan secara mutlaq ataupun menghalalkannya tanpa melihat batas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Utuslah dia bersama kami ketika kami ke luar di padang rumput, dia bisa makan buah-buahan dan tanam-tanaman, dia akan bermain panahan dan permainan yang diperbolehkan. Sesungguhnya kami akan menjaga agar tidak ditimpa keburukan dan akan menjauhkannya dari mara bahaya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Utuslah dia} utuslah dia {bersama kami besok pagi agar dia bersenang-senang} leluasa untuk makan dan minum {dan bermain-main. Sesungguhnya kami benar-benar akan menjaganya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. maka tatkala mereka sudah mampu menepis tuduhan dari diri mereka yang bisa menghalangi kepergian yusuf bersama mereka, maka mereka menyampaikan kepada ya’qub bahwa diantara bentuk kemaslahatan dan hiburan bagi yusuf yang diinginkan ayahnya terhadap yusuf adalah mengharuskan beliau memberi izin kepergiannya bersama mereka. MEreka mengatakan ”biarkanlah dia pergi bersama kami besok pagi, agar dia (dapat) bersenang senang dan (dapat) bermain main” untuk bertamasya di tempat yang jauh lagi sunyi dan bergembira. ”dan sesungguhnya kami pasti menjaganya” yakni, kami akan memperhatikannya dan melindunginya dari gangguan apapun yang akan menimpanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَرۡتَعۡ وَيَلۡعَبۡ) yarta’ wa yal’ab : makan, minum, dan berlomba. Makna ayat : (أَرۡسِلۡهُ مَعَنَا غَدٗا يَرۡتَعۡ وَيَلۡعَبۡ) Biarkanlah ia pergi bersama kami besok, bermain di hutan, menyantap buah, minum susu, makan daging, dan berlomba lari dan panahan juga gulat, (وَإِنَّا لَهُۥ لَحَٰفِظُونَ) kami akan menjaganya dari segala macam gangguan.” Pelajaran dari ayat : • Kejujuran seorang mukmin mengharuskan pembenaran sumpahnya dan meyakini perkataannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 12: Ke gurun. Kaa-kata ini dimaksudkan agar bapak mereka (Ya’qub) melepas Yusuf pergi bersama mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 12",
    "description": "Kemudian mereka meminta kembali kepada ayahnya: biarkanlah dia pergi bersama kami besok pagi saat kami pergi menggembala kambing, agar dia bisa bersenang-senang dengan memakan buah-buahan segar dan bermain-main bersama kami dalam perlombaan dan permainan yang diperbolehkan, dan kami pasti menjaganya dengan baik serta melindunginya dari marabahaya. Mendengar bujukan putra-putranya dia nabi yakub berkata, sesungguhnya kepergian kamu bersama dia putraku yusuf, dan berpisahnya dia denganku sangat menyedihkanku dan aku khawatir dia akan dimakan serigala ketika jauh darimu, sedang kamu lengah darinya karena sibuk bermain atau sibuk dengan urusan lain."
  }
]