[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’qub berkata, ”sesungguhnya amat menyedihkan diriku perpisahan dengannya, bila kalian pergi bersamanya kepadang rumput, dan aku takut serigala akan memangsanya, saat kalian lalai terhadapnya dan sibuk dengan urusan kalian sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Ya'qūb -'alaihissalām- berkata kepada anak-anaknya, \"Sesungguhnya kepergian kalian bersamanya benar-benar membuatku sedih. Karena aku tak sanggup berpisah dengannya. Aku khawatir dia akan diterkam serigala sementara kalian lalai menjaganya karena terlalu asyik bersenang-senang dan bermain.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Ayah mereka berkata: “Sungguh aku sangat sedih dengan kepergian Yusuf bersama kalian, dan aku takut dia dimakan srigala ketika kalian sibuk dengan gembalaan dan bermain.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. إِنِّى لَيَحْزُنُنِىٓ أَن تَذْهَبُوا۟ بِهِۦ (Sesungguhnya kepergian kamu bersama Yusuf amat menyedihkanku) Nabi Ya’qub memberitahu mereka bahwa ia sedih jika membiarkan Yusuf pergi karena kecintaan dan kekhawatirannya kepada Yusuf yang sangat besar. وَأَخَافُ أَن يَأْكُلَهُ الذِّئْبُ(dan aku khawatir kalau-kalau dia dimakan serigala) Terdapat pendapat mengatakan bahwa nabi Ya’qub mengatakan ini karena khawatir terhadap nabi Yusuf dari makar saudara-saudaranya, maka ia mengibaratkan mereka dengan serigala. وَأَنتُمْ عَنْهُ غٰفِلُونَ(sedang kamu lengah dari padanya) Karena kesibukan kalian dengan kesenangan dan permainan. Atau kerena mereka tidak siaga dalam menjaga Yusuf."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Ya’kub berkata kepada mereka; “Sesunggunya aku akan bersedih karena kehilangan dan berpisah dari Yusuf ketika dia pergi bersama kalian. Aku khawatir Aku khawatir dia akan diterkam serigala buas, sedangkan kalian mengabaikannya karena terlalu asik dan sibuk dengan permainan atau semacamnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Sesungguhnya kepergian kalian bersama dia sangat membuatku sedih dan aku khawatir serigala akan memangsanya, sedangkan kalian lengah darinya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. maka beliau (ya’qub) menjawab pernyataan mereka dengan berkata ”sesungguhnya kepergianmu Bersama yusuf amat menyedihkanku”, maksudnya kepergiannya Bersama kalian saja sudah membuatku bersedih dan memberatkanku. sebab aku tidak bisa berpisah darinya kendatipun sejenak saja. ini adalah faktor yang menghalangi izinku untuk melepasnya. “dan” faktor penghalang kedua, yakni sesungguhnya “aku khawatir kalau kalau dia dimakan serigala, sedang kamu lengah dari padanya” maksudnya aku khawatir saat kalian melalaikannya. sebab ia masih kanak kanak tidak bisa menyelamatkan diri dari serigala."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِنِّي لَيَحۡزُنُنِيٓ) innii layahzununii : aku sedih jika kalian pergi dengannya. (ٱلذِّئۡبُ) adz-dzi’b : hewan buas yang licik tabiatnya. Makna ayat : Maka ayah mereka ‘alaihi salam berkata, (إِنِّي لَيَحۡزُنُنِيٓ أَن تَذۡهَبُواْ بِهِۦ) “Kepergian kalian bersamanya (Yusuf) membuatku sedih, (وَأَخَافُ أَن يَأۡكُلَهُ ٱلذِّئۡبُ وَأَنتُمۡ عَنۡهُ غَٰفِلُونَ) dan aku khawatir ia akan dimakan serigala, sedangkan kalian lalai karena asyik makan dan bermain. Pelajaran dari ayat : • Bolehnya bersedih dan itu bukan termasuk dosa. Dalam hadits : (وَ إِنَّا بِفِرَاقِكَ يَا إِبْرَاهِيْمُ لَمَحْزُوْنُوْنَ) “Kami bersedih atas perpisahan ini, wahai Ibrahim.” • Serigala memangsa manusia ketika ia sedang lalai, dan ini realita yang banyak terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 13: Hal itu, karena daerah mereka banyak serigala. Yakni sibuk dengan urusan kamu sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 13",
    "description": "Mendengar bujukan putra-putranya dia nabi yakub berkata, sesungguhnya kepergian kamu bersama dia putraku yusuf, dan berpisahnya dia denganku sangat menyedihkanku dan aku khawatir dia akan dimakan serigala ketika jauh darimu, sedang kamu lengah darinya karena sibuk bermain atau sibuk dengan urusan lain. Mereka berkata kepada sang ayah, demi Allah jika dia dimakan serigala, itu sungguh mustahil, padahal kami golongan yang kuat dan memiliki keberanian, kalau demikian yang terjadi tentu kami termasuk golongan orang-orang yang rugi, lagi pengecut dan hidup tidak berguna."
  }
]