[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sauadara-saudara yusuf berkata kepada ayah mereka, ”bila dia dimangsa serigala, padahal kami kumpulan orang yang kuat, maka sesungguhnya jika demikian, kami adalah orang-orang yang rugi, tidak ada kebaikan pada diri kami lagi dan tidak ada manfaat dari kami yang dapat diharap-harapkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Mereka berkata kepada ayah mereka, \"Sungguh, jikalau Yusuf diterkam serigala sedangkan kami adalah satu kelompok, maka dalam hal ini kami tidak punya kebaikan sama sekali. Dan kami benar-benar merugi jika kami tidak melindunginya dari serigala.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Maka mereka bersumpah kepada ayah mereka untuk meyakinkannya: “Sungguh, jika dia dimakan srigala sedangkan kami adalah sekumpulan pemuda yang kuat dan siaga, maka kami sungguh mengecewakan dan tidak membawa kebaikan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِنَّآ إِذًا لَّخٰسِرُونَ (sesungguhnya kami kalau demikian adalah orang-orang yang merugi) Yakni orang-orang yang binasa karena kelemahannya sebab tidak mampu melakukan sesuatu yang sangat remeh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Mereka berkata kepada ayah mereka: “Demi Allah jika dia dimakan serigala, sedangkan kami semua kuat, niscaya kami adalah orang lemah dan merugi.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Sungguh,jika serigala memangsanya, dan kami adalah kelompok} kelompok yang memiliki jumlah (banyak) {sesungguhnya kami benar-benar orang-orang yang merugi”} sungguh orang-orang yang lemah dan gagal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14 “mereka berkata ’jika ia benar benar dimakan serigala, sedang kami golongn (yang kuat)” yakni kami terdiri dari sekelompok orang yang sangat antusias untuk menjaganya. ”sesungguhnya kami kalau demikian adalah orang yang merugi” maka tidak ada kebaikan pada kami dan tidak ada manfaat yang masih bisa diharapkan dari diri kami, seandainya dia dimangsa oleh serigala dan berhasil mengalahkan kami untuk menjaganya. Tatkala mereka menyampaikan argument argument kepada ayahnya agar beliau sudi melepaskan kepergiannya dan menghilangkan faktor faktor penghambat, maka beliau melepas kepergian yusuf bersama mereka sebagai hiburan baginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَنَحۡنُ عُصۡبَةٌ) wa nahnu ‘ushbah : kelompok yang kuat. (لَّخَٰسِرُونَ) lakhaasiruun : lemah, tidak berdaya, dan merugi karena kehilangan saudaranya. Makna ayat : lalu mereka menjawab, “Demi Allah, (لَئِنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّآ إِذٗا لَّخَٰسِرُونَ) jika ia sampai dimakan serigala sedangkan ia ada di antara kami, maka kami tidak ada gunanya. Dan sayang sekali, mereka sudah bisa melobi dan meyakinkan ayah mereka dengan perkataan ini, dan esok mereka akan bepergian bersama Yusuf untuk menjalankan rencana rendahan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 14: Maksudnya menjadi orang-orang yang pengecut yang hidupnya tidak ada artinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 14",
    "description": "Mereka berkata kepada sang ayah, demi Allah jika dia dimakan serigala, itu sungguh mustahil, padahal kami golongan yang kuat dan memiliki keberanian, kalau demikian yang terjadi tentu kami termasuk golongan orang-orang yang rugi, lagi pengecut dan hidup tidak berguna. Setelah diuraikan tentang bujukan mereka kepada sang ayah, lalu sang ayah dengan berat hati mengizinkan mereka membawa serta nabi yusuf, ayat berikut ini menjelaskan tentang aksi mereka memisahkan nabi yusuf dari ayahnya. Maka ketika mereka membawanya pergi ke tengah padang pasir, dan setan pun memengaruhi mereka, sehingga mereka sepakat memasukkan nabi yusuf ke dasar sumur. Kemudian kami wahyukan kepadanya ketika berada di sumur, engkau wahai nabi yusuf kelak setelah dewasa pasti akan menceritakan perbuatan jahat ini kepada mereka, sedang mereka tidak menyadari bahwa orang yang pernah mereka aniaya itu adalah engkau."
  }
]