[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ya’qub melepasnya pergi bersama mereka. Lalu ketika mereka berhasil membawanya pergi bersama mereka dan telah bersepakat untuk melemparkannya ke dasar sumur, kami wahyukan kepada yusuf bahwa ”sesunggguhnya kamu nantinya benar-benar akan memberitahukan kepada saudara-saudaramu pada waktu yang akan datang tentang tindakan mereka yang mereka perbuat kepadamu, sedang mereka tidak merasa dan menyadari hal tersebuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Akhirnya Ya'qūb melepas Yusuf untuk pergi bersama saudara-saudaranya. Setelah mereka membawa Yusuf pergi ke tempat yang jauh dan berniat membuangnya ke dalam sumur, Kami wahyukan kepada Yusuf dalam keadaan seperti itu, \"Sungguh engkau benar-benar akan menceritakan kepada mereka perihal perbuatan mereka ini, sedang mereka tidak menyadari siapa dirimu ketika engkau menceritakan hal itu kepada mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Akhirnya Ya’qub mengizinkan mereka, setelah mereka menampakkan kasih sayang dan kepedulian terhadap Yusuf. Maka ketika mereka telah pergi bersama Yusuf, sedangkan mereka telah sepakat untuk membuangnya ke dasar sumur, maka mereka melepas baju Yusuf dan memasukkan Yusuf ke dalam sumur. Akan tetapi penjagaan Allah cukup untuk menyelamatkan dan menenangkannya; ketika itu Allah berfiman kepadanya: “Sungguh kamu akan menyampaikan kepada saudara-saudaramu tentang perbuatan mereka terhadapmu ini, sedangkan mereka tidak menyadari siapa dirimu.” Ini adalah kabar gembira tentang keselamatannya dari mereka, dan dia akan mengolok mereka ketika mereka bertemu kembali meski tempat mereka sangat jauh. Dan Allah telah memenuhi janji-Nya sebagaimana disebutkan dalam firman-Nya: قال هل علمتم ما فعلتم بيوسف وأخيه إذ أنتم جاهلون Yusuf berkata: \"Apakah kamu mengetahui (kejelekan) apa yang telah kamu lakukan terhadap Yusuf dan saudaranya ketika kamu tidak mengetahui (akibat) perbuatanmu itu?\". (Yusuf: 89) Dan mereka ketika itu mendatangi Yusuf tanpa mengenali Yusuf ketika dengan penampilan dan kedudukannya saat itu, Allah mengisahkan: وجاء إخوة يوسف فدخلوا عليه فعرفهم وهم له منكرون Dan saudara-saudara Yusuf datang (ke Mesir} lalu mereka masuk ke (tempat)nya. Maka Yusuf mengenal mereka, sedang mereka tidak kenal (lagi) kepadanya. (Yusuf: 58)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَلَمَّا ذَهَبُوا۟ بِهِۦ (Maka tatkala mereka membawanya) Dari sisi Ya’qub. وَأَجْمَعُوٓا۟ (dan sepakat) Yakni bersepakat dalam keputusan mereka. أَن يَجْعَلُوهُ فِى غَيٰبَتِ الْجُبِّ ۚ (memasukkannya ke dasar sumur) Tafsir dari kata (الغيابة) telah disebutkan pada ayat ke 10. وَأَوْحَيْنَآ إِلَيْهِ (dan Kami wahyukan kepada Yusuf) Sebagai penenang dari ketakutannya, padahal ketika itu ia masih kecil. Saudara-saudaranya yang berjumlah sepuluh orang sepakat untuk menjerumuskan kedalam bahaya dengan penuh kekerasan hati yang telah dicabut darinya rasa kasih sayang. لَتُنَبِّئَنَّهُم بِأَمْرِهِمْ هٰذَا (Sesungguhnya kamu akan menceritakan kepada mereka perbuatan mereka ini) Yakni kamu akan memberitahukan kepada saudara-saudaramu apa yang mereka perbuat terhadapmu setelah kamu terbebas dari makar yang mereka rencanakan untukmu. Pemberitahuannya ini akan disebutkan pada ayat 89 ketika mereka bertamu kepadanya setelah ia menjadi bendahara negeri Mesir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Ketika saudara-saudara Yusuf pergi bersamanya, mereka memutuskan untuk melemparkannya ke dalam lubang sumur, lalu mengabaikannya setelah melemparnya ke dalam sumur dalam keadaan masih remaja, yaitu 17 tahun dan menjadikannya budak. Sungguh kamu akan memberitahu saudara-saudaramu tentang apa yang mereka lakukan terhadapmu atau perbuatan mereka ini. Dan mereka itu tidak merasa bahwa kamu Yusuf, sebagaimana yang akan dijelaskan di ayat [89]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika mereka membawanya dan sepakat} sudah bertekad {untuk memasukkannya} melemparkannya {ke dasar sumur. Kami memberi wahyu kepadanya} kepada Yusuf {Kamu benar-benar akan menceritakan kepada mereka} kamu benar-benar akan memberitahu mereka {perbuatan mereka} perbuatan mereka {dan mereka tidak menyadarinya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. ketika saudara saudara yusuf pergi bersamanya setelah meperoleh izin dari ayahnya, mereka berketetapan untuk menceburkannya kedasar sumur seperti yang telah dikatakan sebelumnya oleh si penggagas. mereka mampu untuk merealisasikan rencana yang telah mereka sepakati. Akhirnya, mereka menjalankan rencana mereka terhadapnya dan melemparkannya kedasar sumur. kemudian Allah menghiburnya dengan mewahyukan kepadanya saat dia dalam kondisi yang sulit tersebut. ”sesungguhnya kamu akan menceritakan kepada mereka perbuatan mereka ini, sedang mereka tiada ingat lagi” maksudnya akan terlontar celaan darimu kepada mereka dan (pembongkaran) informasi tentang tindakan mereka sementara mereka tidak menyadarinya. Dalam ayat ini, terdapat kabar gembira baginya bahwa ia akan selamat dari masalah yang sedang menghimpitnya, dan bahwa Allah akan menyatukannya dengan keluarga dan saudara saudaranya dalam keadaan penuh dengan kemuliaan dan kedudukan mapan di dunia ini."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَأَجۡمَعُوٓاْ) wa ajma’uu : sepakat untuk membuangnya ke dalam sumur. (فِي غَيَٰبَتِ ٱلۡجُبِّۚ) fii ghayaabatil jubb : ke dalam kegelapan sumur. (وَأَوۡحَيۡنَآ إِلَيۡهِ) wa awhainaa ilaihi : kami wahyukan kepadanya. Makna ayat : Masih mengenai kisah rencana para saudara Yusuf kepadanya, mereka telah membujuk ayah mereka kemarin untuk membiarkan Yusuf pergi bersama mereka menuju dataran, dan mereka telah berhasil membawanya bersama mereka. Tatkala mereka sudah menjauh, wajah-wajah mereka berubah, mereka mulai melemparkan kalimat-kalimat ejekan, terkadang pukulan dan tamparan. Dan mereka sebelumnya sudah sepakat untuk melemparkan Yusuf ke dalam sumur yang biasa mereka datangi di padang. Mereka pun melaksanakan rencana mereka dan melempar saudara mereka sedangkan ia menangis dengan keras, mereka juga melepas pakaiannya dan meninggalkannya tak berdaya di dasar sumur. Pada kala itu Allah mewahyukan kepadanya—Allah mengkabarkannya dengan perantara yang Dia kehendaki—ia kan memberitahu mereka suatu saat nanti tentang perlakuan buruk mereka. inilah makna firman-Nya ta’ala, (وَأَوۡحَيۡنَآ إِلَيۡهِ لَتُنَبِّئَنَّهُم بِأَمۡرِهِمۡ هَٰذَا وَهُمۡ لَا يَشۡعُرُونَ). Pelajaran dari ayat : 1. Bisa saja dosa besar muncul dari seseorang mukmin yang di masa depan akan berubah menjadi baik. 2. Kasih sayang Allah terhadap Yusuf dan pemuliaannya dengan wahyu, bahwa ia suatu saat nanti akan mengabarkan perbuatan ini kepada mereka. Dan ini mengandung kabar gembira akan keselamatannya dan akhir yang bahagia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 15: Setelah mereka mengemukakan alasan agar Yusuf dilepas bersama mereka, kemudian segala alasan yang menghalangi mereka jawab, maka Nabi Ya’qub ‘alaihis salam akhirnya melepas Beliau pergi bersama mereka. Mereka pun melakukannya. Mereka lepaskan bajunya setelah Beliau dipukuli terlebih dahulu dan dihinakan bahkan sampai hendak dibunuh, lalu mereka turunkan ke dalam sumur (sumur ersebut bagian bawahnya agak luas sedangkan bagian atasnya sempit). Ketika sampai di pertengahan sumur, mereka jatuhkan agar Beliau mati, namun Beliau terjatuh ke dalam air (tidak terkena batu yang ada di bawah), lalu Yusuf mendatangi batu yang ada di sana. Kemudian mereka memanggil Yusuf dari atas, maka Yusuf menjawabnya karena ia mengira bahwa mereka berubah menjadi kasihan terhadapnya, ternyata mereka malah hendak menimpakan batu besar kepada Beliau, maka Yahudza melarang mereka. Saat Beliau berada di dalam sumur untuk menenteramkan hatinya, sedang usia Beliau ketika itu 17 tahun atau kurang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 15",
    "description": "Setelah diuraikan tentang bujukan mereka kepada sang ayah, lalu sang ayah dengan berat hati mengizinkan mereka membawa serta nabi yusuf, ayat berikut ini menjelaskan tentang aksi mereka memisahkan nabi yusuf dari ayahnya. Maka ketika mereka membawanya pergi ke tengah padang pasir, dan setan pun memengaruhi mereka, sehingga mereka sepakat memasukkan nabi yusuf ke dasar sumur. Kemudian kami wahyukan kepadanya ketika berada di sumur, engkau wahai nabi yusuf kelak setelah dewasa pasti akan menceritakan perbuatan jahat ini kepada mereka, sedang mereka tidak menyadari bahwa orang yang pernah mereka aniaya itu adalah engkau. Setelah mereka menceburkan nabi yusuf ke dalam sumur dan meninggalkannya sendirian, kemudian mereka datang kepada ayah mereka pada petang hari sambil menangis sebagai ekspresi bahwa mereka sedih. Dengan cara ini mereka menduga bahwa ayahnya percaya dengan berita yang akan mereka sampaikan, sehingga perbuatan jahat mereka tertutupi."
  }
]