[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan datanglah keluarga-keluarga Yusuf kepada ayah mereka pada waktu isya di permulaan malam dalam keadaan menangis dan memperlihatkan perasaan sesal lagi gelisah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Saudara-saudara Yusuf datang kepada ayah mereka di waktu Isya sambil berpura-pura menangis agar tipu daya mereka berhasil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Setelah mereka menjalankan tipu daya yang mereka rencanakan, mereka berusaha menutupinya; mereka datang kepada ayah mereka pada awal malam untuk meminta maaf, mereka berpura-pura menangis agar menampakkan kesedihan atas kepergian saudara mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَجَآءُوٓ أَبَاهُمْ عِشَآءً يَبْكُونَ (Kemudian mereka datang kepada ayah mereka di sore hari sambil menangis) Mereka pura-pura menangis untuk menghiasi kedustaan mereka dan menyembunyikan makar mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Mereka kembali kepada ayah mereka di waktu sore dengan pura-pura menangis untuk menutupi perbuatan dan kebohongan mereka. Mereka membuat ayah mereka percaya bahwa mereka itu jujur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Mereka datang kepada ayahnya pada petang hari sambil menangis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “kemudian mereka datang kepada ayah mereka di sore hari sambil menangis” agar keterlambatan mereka dari kebiasaanya, dan tangisan mereka menjadi bukti dan penguat atas kejujuran mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (عِشَآءٗ) ‘isyaa : setelah matahari terbenam, awal malam. Makna ayat : Setelah mereka selesai, mereka menyembelih seekor anak kambing, dan melumuri bajunya dengan darah tersebut, kemudian pulang kepada ayah mereka di petang hari menangis sambil membawa kabar musibah ini kepada ayah mereka yang sudah tua, Allah berfirman, (وَجَآءُوٓ أَبَاهُمۡ عِشَآءٗ) yaitu mereka pulang pada awal malam ( يَبۡكُونَ ) menangis. Pelajaran dari ayat : - Dipilihnya malam untuk meminta uzur bukan siang hari, karena mata malu untuk melihat mata, sebagaimana perkataan penyair, كَيْفَ يَرْجُوْ الْحَيَاءَ مِنْهُ صَدِيْقُ وَ مَكَانُ الْحَيَاءِ مِنْهُ خَرَابُ Bagaimana seorang teman malu kepadanya Sedangkan tempat malunya sudah runtuh? Maksudnya, matanya sudah tidak bisa buta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 16: Kedatangan mereka pada sore hari (terlambat) dan sambil menangis dimaksudkan agar menjadi penguat terhadap ucapan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 16",
    "description": "Setelah mereka menceburkan nabi yusuf ke dalam sumur dan meninggalkannya sendirian, kemudian mereka datang kepada ayah mereka pada petang hari sambil menangis sebagai ekspresi bahwa mereka sedih. Dengan cara ini mereka menduga bahwa ayahnya percaya dengan berita yang akan mereka sampaikan, sehingga perbuatan jahat mereka tertutupi. Kemudian mereka berkata, wahai ayah kami! sesungguhnya kami pergi bermain sambil berlomba memanah dan berpacu, dan kami tinggalkan yusuf di dekat barang-barang kami sendirian di tempat yang aman. Saat kami meninggalkan yusuf sebentar, tiba-tiba datang serigala lalu dia dimakan serigala. Sungguh sangat mengejutkan, dan engkau tentu tidak akan percaya kepada kami dengan berita ini, sekalipun kami berkata benar. Hal itu karena cintamu yang berlebih-lebihan kepada yusuf, sehingga engkau berprasangka buruk kepada kami."
  }
]