[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, ”wahai ayah kami, sesungguhnya kami pergi bersama berlomba-lomba lari dan memanah dan kami tinggalkan yusuf di sisi perbekalan dan pakaian kami. Kami tidaklah lalai untuk menjaganya. Akan tetapi, kami tempatkan dia di tempat aman yang telah kami pilih, dan kami tidaklah meninggalkannya kecuali sebentar saja, lalu serigala memangsanya. Dan engkau pasti tidak akan percaya kepada kami, meskipun kami orang-orang yang dikenal jujur, lantaran besarnya kecintaanmu kepada yusuf.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Mereka berkata, \"Wahai Ayah kami! Sesungguhnya kami pergi untuk berlomba lari dan berlomba memanah, sementara Yusuf kami tinggalkan di tempat baju-baju dan perbekalan kami agar dia menjaganya. Kemudian dia dimakan serigala. Engkau pasti tidak percaya kepada kami meskipun pada kenyataannya kami jujur dengan apa yang kami ceritakan kepadamu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Mereka berkata kepada ayah mereka dengan lembut: “Wahai ayah kami, ketika kami melakukan lomba lari dan meninggalkan Yusuf sendirian di tempat barang-barang kami agar dia menjaganya, namun datang srigala dan memakannya. Dan engkau pasti tidak mempercayai kami, meski kami berkata jujur.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. قَالُوا۟ يٰٓأَبَانَآ إِنَّا ذَهَبْنَا نَسْتَبِقُ (Mereka berkata: “Wahai ayah kami, sesungguhnya kami pergi berlomba-lomba) Yakni kami berlomba lari, balap kuda, atau memanah. Imam al-Azhary mengatakan: lomba memanah disebut dengan nidhal, dan lomba balap kuda disebut rihan, dan keduanya masuk dalam kategori musabaqah. Dan tujuan dari musabaqah yaitu melatih diri untuk berperang. وَتَرَكْنَا يُوسُفَ عِندَ مَتٰعِنَا (dan kami tinggalkan Yusuf di dekat barang-barang kami) Yakni di tempat pakaian kami agar dia menjaganya. وَمَآ أَنتَ بِمُؤْمِنٍ لَّنَا (dan kamu sekali-kali tidak akan percaya kepada kami) Yakni tidak mempercayai kami dalam alasan yang kami kemukakan. وَلَوْ كُنَّا (sekalipun kami) Menurutmu atau dalam kenyataannya. صٰدِقِينَ (adalah orang-orang yang benar) Karena dalam hatimu telah tertanam tuduhan terhadap kami dan karena besarnya rasa cintamu terhadap Yusuf."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Mereka berkata: “Wahai ayah, kami pergi dan melakukan lomba lari, memanah dan menunggang kuda. Dan kami meninggalkan yusuf di sisi baju dan barang-barang kami supaya dia menjaganya, lalu dia dimakan serigala saat kami jauh darinya, dan engkau tidak mempercayai kami karena prasangka buruk, kecurigaan dan cintamu terhadap Yusuf, meskipun kami ini jujur”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai ayah kami, sesungguhnya kami pergi berlomba} saling berlomba untuk menjadi di depan dan berlomba memanah {dan kami tinggalkan Yusuf di dekat barang-barang kami} baju-baju dan barang kami {lalu serigala memangsanya. Engkau tentu tidak akan percaya kepada kami} mempercayai kami {meskipun} meskipun {kami adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. mereka berkata dengan mengajukan alasan yang dusta, ”wahai ayah kami, sesungguhnya kami pergi berlomba lomba”, baik lomba lari, memanah atau bertarung, ”dan kami tinggalkan yusuf di dekat barang barang kami” untuk lebih menjaga energinya dan supaya beristirahat. ”lalu ia dimakan serigala” ketika kami tidak bersamanya dan asyik berlomba. ”dan kamu sekali kali tidak akan percaya kepada kami, sekalipun kami adalah orang orang yang benar” maksudnya engkau tentu tidak akan memberikan maaf kepada kami dengan alasan ini. secara zahir engkau tidak mempercayai kami, namun kami tidak bisa menyampaikan kecuali alasan yang sebenarnya. ini semua (mereka lakukan) untuk lebih mengokohkan alasan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نَسۡتَبِقُ) nastabiqu : berlomba. (عِندَ مَتَٰعِنَا) ‘inda mataa’inaa : di dekat barang bawaan kami, baju dan lainnya. (وَمَآ أَنتَ بِمُؤۡمِنٖ لَّنَا) wa maa anta bimu’minil lanaa : engkau tidak akan mempercayai kami. Makna ayat : dan mereka berkata meminta maaf, (يَٰٓأَبَانَآ إِنَّا ذَهَبۡنَا نَسۡتَبِقُ وَتَرَكۡنَا يُوسُفَ عِندَ مَتَٰعِنَا فَأَكَلَهُ ٱلذِّئۡبُۖ وَمَآ أَنتَ بِمُؤۡمِنٖ لَّنَا) “Wahai ayah kami, kami pergi berlomba dan meninggalkan Yusuf bersama barang-barang kami, lalu serigala memakannya, engkau tidak akan percaya kepada kami, (وَلَوۡ كُنَّا صَٰدِقِينَ ) sekalipun kami benar. Dan perkataan mereka sudah menunjukkan akan kedustaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 17: Yakni berlomba lari atau panah-memanah. Karena kecintaanmu kepada Yusuf dan persangkaanmu yang buruk terhadap kami. Kata-kata ini dan apa yang disebutkan pada ayat selanjutnya membantu menguatkan ucapan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 17",
    "description": "Kemudian mereka berkata, wahai ayah kami! sesungguhnya kami pergi bermain sambil berlomba memanah dan berpacu, dan kami tinggalkan yusuf di dekat barang-barang kami sendirian di tempat yang aman. Saat kami meninggalkan yusuf sebentar, tiba-tiba datang serigala lalu dia dimakan serigala. Sungguh sangat mengejutkan, dan engkau tentu tidak akan percaya kepada kami dengan berita ini, sekalipun kami berkata benar. Hal itu karena cintamu yang berlebih-lebihan kepada yusuf, sehingga engkau berprasangka buruk kepada kami. Dan ketika mereka datang menghadap ayahnya, mereka membawa serta baju gamisnya nabi yusuf yang dilumuri darah palsu agar ayahnya percaya bahwa perkataan mereka benar, tapi baju itu justru menjadi bukti kebohongan mereka, karena tidak ada sedikit pun tanda bekas gigitan serigala di bajunya. Lalu dia'nabi yakub'berkata kepada putra-putranya, sebenarnya hanya dirimu sendirilah yang memandang baik urusan yang buruk itu lantaran setan telah menghiasi dirimu dengan nafsu yang mendorong berbuat jahat, untuk mencelakai yusuf. Maka aku akan tetap bersabar tanpa mengeluh dan mengadu kepada siapa pun, karena hanya dengan bersabar itulah yang terbaik bagiku. Dan hanya kepada Allah saja aku memohon pertolongan-Nya agar aku mampu menerima ujian terhadap apa yang kamu ceritakan tentang yusuf, dan aku juga berserah diri kepada-Nya."
  }
]