[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka pulang dengan membawa pakaiannya yang telah dilumpuri darah, namun bukan darah yusuf, untuk membuktikan kejujuran ucapan mereka, namun justru menjadi bukti petunjuk kedustaan mereka, sebab pakaian itu tidaklah terkoyak-koyak. Maka ayah mereka ya’qub alaihi salam berkata kepada mereka, ”kejadiannya tidak seperti yang kalian katakan. Akan tetapi, telah mebuat terlihat baik jiwa kalian yang suka memerintahkan keburukan memerintah keburukan kepada yusuf dan telah menjadikan kalian memandangnya baik-baik saja dan kemudian kalian lakukan. Maka kesabaranku adalah kesabaran yang baik, tidak disertai keluhan kepada siapa pun dari makhluk. Dan aku memohon pertolongan kepada Allah untuk menanggung beban akibat kedustaan yang kalian ungkapkan, bukan kepada daya dan kekuatanku sendiri.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan mereka memperkuat cerita mereka dengan rekayasa. Mereka membawa baju Yusuf dengan dilumuri darah yang bukan berasal dari darah Yusuf. Mereka ingin mengesankan bahwa darah itu adalah bekas gigitan serigala yang memakan tubuh Yusuf. Tetapi Ya'qūb mengetahui kebohongan mereka karena melihat baju itu tidak robek sedikitpun. Maka Ya'qūb berkata kepada mereka, \"Masalahnya tidak seperti yang kalian ceritakan. Hawa nafsu kalian lah yang membuat perbuatan jahat kalian itu terlihat baik di mata kalian. Maka kesabaran yang indah dan tanpa keluh kesah adalah pilihanku. Dan hanya Allah-lah tempat meminta pertolongan untuk menghadapi perkara Yusuf seperti yang kalian ceritakan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Mereka datang kepada ayah mereka dengan membawa baju Yusuf yang telah mereka lumuri darah. Maka Ya’kub menjawab mereka dengan penuh pengingkaran dan kesabaran serta keyakinan masa depan Yusuf yang akan dimuliakan menjadi nabi: “Dia tidak dimakan srigala, namun nafsu kalian menghiasi perbuatan buruk bagi kalian. Sungguh kesabaranku adalah kesabaran yang baik, tanpa ratapan dan keluh kesah kepada seorang makhlukpun; dan aku meminta pertolongan kepada Allah agar menguatkanku dalam menghadapi musibah ini dan dalam menyelesaikannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَجَآءُو عَلَىٰ قَمِيصِهِۦ بِدَمٍ كَذِبٍ ۚ (Mereka datang membawa baju gamisnya (yang berlumuran) dengan darah palsu) Nabi Ya’qub berkata kepada mereka “sejak kapan serigala menjadi sangat cerdas sehingga dapat memakan Yusuf tanpa merobek bajunya?” قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ(Ya’qub berkata: “Sebenarnya dirimu sendirilah yang memandang baik perbuatan (yang buruk) itu) Menghiasi dan memudahkan perbuatan buruk yang kalian lakukan terhadap saudara kalian. فَصَبْرٌ جَمِيلٌ ۖ(maka kesabaran yang baik itulah (kesabaranku)) Yakni kesabaran yang tanpa dibarengi dengan keluhan. وَاللهُ الْمُسْتَعَانُ(Dan Allah sajalah yang dimohon pertolongan-Nya) Yakni kepada-Nya aku memohon pertolongan. عَلَىٰ مَا تَصِفُونَ (terhadap apa yang kamu ceritakan) Yakni terhadap kebohongan yang kalian tunjukkan. Atau terhadap kemungkinan yang kalian ceritakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Mereka datang dengan membawa baju Yusuf dengan dilumuri darah palsu, bukan darah Yusuf. Ketika Ya’kub melihatnya, dan mengetahui kebohongan mereka, dia berkata: “Yusuf tidak dimakan serigala, namun kalian telah dihiasi dengan perkara menjijikkan dan mungkar yang kalian perbuat terhadap saudara kalian. Maka kesabaran yang baik, yaitu kesabaran yang tidak mengandung keluhan dan kecemasan kepada siapapun. Dan aku meminta kepada Allah atas apa yang kalian bicarakan dan dustakan tentang Yusuf.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka datang membawa bajunya dengan (diberi) darah palsu} yang dipalsukan {Dia Ya‘qub berkata,“Justru diri kalian sendiri yang menghiasi} menghiasi {suatu urusan itu, maka bersabar itulah yang terbaik} maka tidak diragukan lagi urusanku adalah bersabar dengan baik {Hanya Allah, Dzat yang dapat dimintai pertolongan atas apa yang kalian ceritakan”} yang kalian ceritakan tentang perkara Yusuf"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “dan” bukti lain yang mereka pakai untuk mendukung pernyataan yang disampaikan ”mereka datang membawa baju gamisnya(yang berlumuran) dengan darah palsu” mereka mengklaim bahwa itu adalah bekas darah yusuf ketika dimangsa serigala. Namun ayah mereka tidak mempercayai mereka tentang itu. ”dia berkata ’sebenarnya dirimu sendirilah yang memandang baik perbuatan (yang buruk) itu” jiwa jiwa kalian telah memperindah tindakan buruk (pada pandangan kalian) dalam memisahkan diriku dengannya. Sebab beliau memperhatikan adanya beberapa konteks yang menyertai dan kondisi kondisi yang melatarbelakanginya serta melalui mimpi yusuf yang telah ia ceritakan kepada beliau yang mendukung apa yang beliau ungapkan. ”maka kesabaran yang baik itulah (kesabaranku) Dan Allah sajalah yang dimohon pertolonganNYa terhadap apa yang kamu ceritakan” maksudnya kewajibanku adalah aku akan tetap semangat melakukannya, yakni bersabar atas musibah ini dengan kesabaran yang baik, bebas dari bentuk emosi dan keluhan kepada manusia. Aku memohon pertolongan dari Allah untuk menghadapinya, bukan bertumbu kepada daya dan kekuatanku. Beliau berjanji pada diri sendiri untuk ini, dan mengeluhkannya kepada penciptanya dengan bertutur, ”sesungguhnya hanyalah kepada Allah, aku mengadukan kesusahan dan kesedihanku”. Karena pengajuan keluhan kepada sang pencipta tidak menafikan kesabaran yang baik. Sebab seorang nabi, apabila berjanji, niscaya dia kan menepatinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِدَمٖ كَذِبٖۚ) bi damin kadzib : darah palsu, darah anak kambing bukan darah Yusuf. (بَلۡ سَوَّلَتۡ لَكُمۡ) bal sawwalat lakum : telah dihiasi, kalian pandang bagus. (عَلَىٰ مَا تَصِفُونَ) ‘alaa maa tashifuun : berupa kedustaan. Makna ayat : Allah berfirman, (وَجَآءُو عَلَىٰ قَمِيصِهِۦ بِدَمٖ كَذِبٖۚ) Lalu mereka membawa baju Yusuf yang berlumuran darah palsu, darah anak kambing yang mereka sembelih lalu mereka makan, lalu melumuri baju saudara mereka Yusuf dengan darah tersebut. Tatkala Ya’qub melihat baju itu penuh dengan darah, tapi tidak ada sedikitpun robekan, lalu berkata, “Sungguh serigala itu sangat lembut, ia memakan Yusuf tapi tidak merobek sedikitpun bajunya.” Kemudian berkata—sebagaimana yang Allah kabarkan—( قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرٗاۖ) “Kejadiannya tidak seperti yang kalian katakan, tapi nafsu kalian menghiasi rencana kalian, lalu kalian jalankan. (فَصَبۡرٞ جَمِيلٞۖ) maka aku harus bersabar dengan kesabaran yang baik—yaitu sabar tanpa keluh kesah. (وَٱللَّهُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ ) “Dan Allah sajalah yang dimohon pertolongan-Nya terhadap apa yang kamu ceritakan.\" berupa kedustaan. Pelajaran dari ayat : - Keutamaan bersabar dengan baik, yaitu kesabaran tanpa keluh kesah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 18: Mereka menggunakan darah anak kambing (sebagaimana disebutkan Mujahid, As Suddiy dan lainnya) yang mereka sembelih untuk melumuri baju gamisnya, namun mereka lupa tidak merobek-robek baju itu sehingga Nabi Ya’qub mengetahui kedustaannya. Yaitu menjauhkan aku dengan Yusuf. Kesabaran yang baik adalah kesabaran yang bersih dari sikap marah-marah, keluh kesah, dan dari mengadu kepada makhluk, serta menjadikan dirinya mengadu kepada Allah, memohon pertolongan kepada-Nya terhadap hal itu, dan tidak bersandar kepada kemampuannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 18",
    "description": "Dan ketika mereka datang menghadap ayahnya, mereka membawa serta baju gamisnya nabi yusuf yang dilumuri darah palsu agar ayahnya percaya bahwa perkataan mereka benar, tapi baju itu justru menjadi bukti kebohongan mereka, karena tidak ada sedikit pun tanda bekas gigitan serigala di bajunya. Lalu dia'nabi yakub'berkata kepada putra-putranya, sebenarnya hanya dirimu sendirilah yang memandang baik urusan yang buruk itu lantaran setan telah menghiasi dirimu dengan nafsu yang mendorong berbuat jahat, untuk mencelakai yusuf. Maka aku akan tetap bersabar tanpa mengeluh dan mengadu kepada siapa pun, karena hanya dengan bersabar itulah yang terbaik bagiku. Dan hanya kepada Allah saja aku memohon pertolongan-Nya agar aku mampu menerima ujian terhadap apa yang kamu ceritakan tentang yusuf, dan aku juga berserah diri kepada-Nya. Setelah mereka berhasil mencelakai nabi yusuf dengan memasukkannya ke dalam sumur, ayat ini menceritakan lanjutan kisah nabi yusuf, yaitu ditemukannya dia oleh rombongan kafilah yang hendak pergi ke mesir. Dan setelah nabi yusuf diceburkan ke dalam sumur oleh saudaranya, maka datanglah sekelompok musafir dari madyan yang hendak menuju mesir, kemudian di antara mereka menyuruh salah seorang pengambil air untuk minum para kafilah. Lalu dia menurunkan timbanya, ketika timba diturunkan di sumur, bergantunglah nabi yusuf pada tali timba itu. Dengan nada terkejut, dia pun berteriak sambil berkata, oh, senangnya, ini ada seorang anak muda yang sehat lagi elok parasnya! setelah nabi yusuf diangkat, kemudian mereka menyembunyikannya dengan maksud akan menjadikannya sebagai barang dagangan. Dan Allah maha mengetahui apa yang mereka kerjakan, karena tidak ada satu pun yang bisa disembunyikan dari-Nya."
  }
]