[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tibalah satu rombongan dari orang-orang musafir. Mereka mengutus orang untuk mencarikan air bagi mereka. Maka ketika orang tersebut memasukkan ember ke dalam sumur, yusuf bergantung padanya. Maka orang yang mengambil air itu senang, berbinar, karena mendapatkan seorang anak, dan dia berkata, ”wah ada kabar yang menyenangkan. Ini ada anak lelaki yang berharga mahal.” tukang air itu dan sejumlah temannya menyembunyikan yusuf dari anggota rombongan musafir yang lainnya dan tidak menampakannya kepada mereka. Mereka berkata, ’ini adalah barang perniagaan yang kami bawa.” dan Allah mahamengetahui apa yang mereka lakukan terhadap yusuf."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Kemudian datanglah sekelompok musafir yang melintas. Lalu mereka menyuruh seseorang mengambil air minum untuk mereka. Lalu ia mengulurkan timbanya ke dalam sumur. Dan tiba-tiba Yusuf bergelantungan pada tali timba tersebut. Maka tatkala orang yang mengulurkan timba itu melihatnya ia langsung berkata dengan suka cita, \"Oh, kabar gembira! Ini ada anak lelaki (budak)!\" Lalu si pencari air itu bersama beberapa temannya menyembunyikan perihal penemuan Yusuf itu dari para musafir lainnya. Mereka mengaku bahwa Yusuf adalah budak yang mereka beli. Dan Allah Maha mengetahui apa yang mereka lakukan terhadap Yusuf yang telah mereka hinakan dan mereka perdagangkan. Tidak ada satupun perbuatan mereka yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Maka Allah mendatangkan orang yang menyelamatkan Yusuf, ketika beberapa musafir melewati jalan yang dekat dengan sumur itu. mereka mengutus orang untuk mengambil air, ketika dia menurunkan ember ke dalam sumur, Yusuf berpegangan pada talinya sehingga dia dapat naik dan selamat. Ketika dia melihat Yusuf yang memiliki ketampanan itu, dia berteriak senang karena telah menemukan susuatu yang sangat berharga: “Sungguh kabar gembira, ini adalah anak muda.” Maka sekelompok musafir itu merahasiakan penemuan Yusuf agar dapat menjualnya seperti barang dagangan. Namun Allah Maha Mengetahui apa yang mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَجَآءَتْ سَيَّارَةٌ (Kemudian datanglah kelompok orang-orang musafir) Yakni kafilah yang berjalan dari Syam menuju Mesir. وَارِدَهُمْ (seorang pengambil air) Makna (الوارد) yakni orang yang mengambil air untuk memberi minum kaumnya. فَأَدْلَىٰ دَلْوَهُۥ ۖ(maka dia menurunkan timbanya) Yakni menurunkan timbanya ke sumur agar terisi air, kemudian Yusuf berpegangan dengan talinya. Setelah timba diangkat dari sumur, orang itu melihat nabi Yusuf. قَالَ يٰبُشْرَىٰ(dia berkata: “Oh; kabar gembira) Yakni orang itu berkata sambil berseru kepada para sahabatnya untuk memberi mereka kabar gembira. وَأَسَرُّوهُ (Kemudian mereka menyembunyikan dia) Yakni kafilah tersebut menyembunyikan keberadaan Yusuf. Atau mereka mengaku bahwa mereka menyerahkan Yusuf kepada pemilik air agar ia dijual ke negeri Mesir. Namun Yusuf hanya diam kerena takut diambil kembali oleh saudara-saudaranya untuk membunuhnya. وَاللهُ عَلِيمٌۢ بِمَا يَعْمَلُونَ (Dan Allah Maha Mengetahui apa yang mereka kerjakan) Yang mereka kerjakan terhadap yusuf berupa ujian dan cobaan atasnya dan menjadikannya barang dagangan, padahal ia adalah orang yang mulia keturunan orang-orang yang mulia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Lalu ada beberapa Musafir yang berasal dari Madyan di negeri Syam menuju Mesir melewati sumur itu. Lalu mereka mengutus orang kepercayaan mereka, yaitu orang yang dipercaya membawa air untuk memberi minum kaumnya. Lalu dia melempar timbanya ke dalam sumur agar terisi penuh, lalu Yusuf berpegangan pada talinya. Ketika orang yang dipercaya melihatnya, dia berkata: “Betapa beruntungnya (dikatakan ketika bahagia, lawan dari kata wahai meruginya, ketika cemas.) ini ada anak laki-laki.” Lalu mereka menyembunyikannya dari kelompok lainnya dan menjadikannya sesuatu untuk diperjual belikan layaknya budak. Allah Maha Mengetahui perbuatan mereka. Rahasia mereka tidak luput dariNya. Dan yang menimpa Yusuf adalah cobaan. Dia seperti barang yang diperjual-belikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu datanglah sekelompok musafir} kafilah yang lewat {Mereka menyuruh seorang pengambil air} orang yang berada di depan yang dipercaya untuk mengambil air untuk memberi minum mereka {lalu dia menurunkan timbanya} lalu dia menurunkan timbanya ke dalam sumur {Dia berkata,“Betapa senangnya} Aduhai senangnya yang datang ini {Ini ada seorang anak” Kemudian mereka menyembunyikannya sebagai barang dagangan} menyembunyikan perkara Yusuf dan menjadikannya sebagai sesuatu untuk diperdagangkan {Allah Maha Mengetahui apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19 maksudnya, yusuf berada di dasar sumur selama beberapa waktu yang dia jalani disana. sampai akhirnya “datanglah beberapa kelompok musafir” sebuah kafilah yang bertolak menuju mesir” lalu mereka menyuruh seorang pengambil air” orang pertama dan terdepan (dalam rombongan) yang menimba air bagi mereka dan mengumpulkannya serta mempersiapkan pembuatan kolam atau semacamnya bagi mereka. ”maka ia menurunkan” yaitu pengambilan air itu (menurunkan) “timbanya” maka yusuf menggantungkan diri padanya dan berhasil keluar. Ia berkata, ”oh, kabar gembira, ini seorang anak muda” orang ini begitu gembira seraya berkata ”ini bocah kecil yang berharga mahal” kemudian mereka menyembunyikannya sebagai barang dagangan”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سَيَّارَةٞ) sayyaarah : sekelompok orang yang berjalan bersama. (وَارِدَهُمۡ) waaridahum : pencari air. (فَأَدۡلَىٰ دَلۡوَهُۥ) fa’adlaa dalwahuu : menurunkan embernya ke dalam sumur. (وَأَسَرُّوهُ بِضَٰعَةٗۚ) wa asarruuhu bi dhaa’ah : mereka menyembunyikannya sebagai barang dagangan. Makna ayat : Melanjutkan kisah Yusuf dan saudara-saudaranya. Setelah mereka melempar Yusuf ke dalam sumur dan meninggalkannya, datanglah kabilah dari negeri Madyan yang menuju Mesir, lalu mereka mengutus seseorang untuk mencari air, maka ia memasukkan ember ke dalam sumur itu, dan Yusuf memegang ember tersebut dan berhasil keluar. Tidaklah orang itu melihat Yusuf kecuali berteriak, (يَٰبُشۡرَىٰ هَٰذَا غُلَٰمٞۚ) “Oh; kabar gembira, ini seorang anak muda!”. Pada saat itu saudara-saudara Yusuf sering bolak-balik mengecek sumur, memantau bagaimana saudara mereka, tatkala melihatnya sudah berada di tangan orang itu dan teman-temannya mereka berkata, “Ini adalah budak kami yang lari, kalau kalian ingin membelinya, kami akan jual dia.” Mereka berkata, “Itu yang kami inginkan.” Maka mereka menjualnya dengan harga yang murah dan menyembunyikannya sebagai barang dagangan—menyelundupkannya sehingga orang-orang kabilah tidak tahu, agar mereka nanti tidak meminta bagian, mereka (saudara-saudara Yusuf) berkata, “Ini adalah barang yang kami percayakan kepada pencari air, untuk mengantarkannya ke pemiliknya di Mesir. Ini apa yang ditunjukkan firman-Nya : (وَجَآءَتۡ سَيَّارَةٞ فَأَرۡسَلُواْ وَارِدَهُمۡ فَأَدۡلَىٰ دَلۡوَهُۥۖ قَالَ يَٰبُشۡرَىٰ هَٰذَا غُلَٰمٞۚ وَأَسَرُّوهُ بِضَٰعَةٗۚ). Pelajaran dari ayat : • Bolehnya menunjukkan kebahagiaan atas sesuatu. • Bolehnya berhati-hati dalam urusan agama dan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 19: Yang datang dari Madyan menuju Mesir, lalu mereka singgah di dekat sumur di mana Yusuf berada. Muhammad bin Ishaq berkata, “Ketika saudara-saudara Yusuf melempar Yusuf ke sumur, mereka duduk-duduk di sana pada hari itu menunggu apa yang akan dilakukan Yusuf atau yang akan terjadi padanya, maka Allah mengarahkan sekelompok musafir kepadanya yang kemudian singgah di dekat sumur itu. Mereka pun mengutus seorang pengambil air, yakni orang yang diminta mengambilkan air. Ketika ia mendatangi sumur itu dan melepaskan timbanya, Yusuf bergantung ke timba itu, lalu pengambil air itu menariknya dan merasa gembira sambil berkata, “Oh senangnya, …dst.” “Mereka” di sini menurut sebagian mufasir (ahli tafsir) adalah orang-orang yang mendatangi sumur itu, sedangkan menurut mufasir lain adalah saudara-saudara Yusuf yang berada di dekat sumur. Maksud ayat, \"mereka menyembunyikan perkaranya” ada beberapa tafsiran. Menurut Mujahid, As Suddiy dan Ibnu Jarir, bahwa orang-orang yang mendatangi sumur menyembunyikan perkara sebenarnya dari kelompok musafir lainnya dan berkata, “Kami membeli anak ini dari para pemilik air” karena khawatir mereka mengambil bagiannya jika mengetahui keadaan yang sebenarnya. Namun menurut yang lain, bahwa saudara-saudara Yusuf (yang ketika itu berada di dekat sumur pula) menyembunyikan keadaan saudaranya, bahwa ia saudara mereka, dan mengatakan, “Ini adalah budak kami yang melarikan diri.” Yusuf pun diam karena khawatir saudara-saudaranya akan membunuhnya dan ia lebih memilih dijual-belikan atau dijadikan barang dagangan oleh saudara-saudaranya. Kemudian saudara-saudara Yusuf menjualnya dengan harga yang rendah, yaitu beberapa dirham saja seperti yang disebutkan dalam ayat selanjutnya karena mereka ingin menjauhkan Beliau dari bapaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 19",
    "description": "Setelah mereka berhasil mencelakai nabi yusuf dengan memasukkannya ke dalam sumur, ayat ini menceritakan lanjutan kisah nabi yusuf, yaitu ditemukannya dia oleh rombongan kafilah yang hendak pergi ke mesir. Dan setelah nabi yusuf diceburkan ke dalam sumur oleh saudaranya, maka datanglah sekelompok musafir dari madyan yang hendak menuju mesir, kemudian di antara mereka menyuruh salah seorang pengambil air untuk minum para kafilah. Lalu dia menurunkan timbanya, ketika timba diturunkan di sumur, bergantunglah nabi yusuf pada tali timba itu. Dengan nada terkejut, dia pun berteriak sambil berkata, oh, senangnya, ini ada seorang anak muda yang sehat lagi elok parasnya! setelah nabi yusuf diangkat, kemudian mereka menyembunyikannya dengan maksud akan menjadikannya sebagai barang dagangan. Dan Allah maha mengetahui apa yang mereka kerjakan, karena tidak ada satu pun yang bisa disembunyikan dari-Nya. Dan setelah musafir itu tiba di mesir, mereka pun menjualnya yakni nabi yusuf dengan harga rendah atau murah, yaitu beberapa dirham saja, sebab mereka tidak tertarik kepadanya untuk memiliki dan mengambilnya sebagai anak atau sebagai budak yang dipekerjakan."
  }
]