[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami telah menurunkan al-qur’an ini dengan berbahasa arab, agar kalian (wahai bangsa arab), dapat mencerna makna-maknanya dan memahaminya serta mengamalkan petunjuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Sesungguhnya Kami menurunkan Al-Qur`ān dengan menggunakan bahasa Arab supaya kalian -wahai orang-orang Arab- bisa memahami maknanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Dengan keagungan dan kekuasaan Kami yang sempurna, Kami turunkan al-Qur’an dari sisi Kami dengan bahasa arab yang fasih, agar mereka memahami makna dan tujuannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. إِنَّآ أَنزَلْنٰهُ (Sesungguhnya Kami menurunkannya) Yakni al-Qur’an. قُرْءٰنًا عَرَبِيًّا(berupa Al Quran dengan berbahasa Arab) Yakni dengan berbahasa arab. لَّعَلَّكُمْ تَعْقِلُونَ(agar kamu memahaminya) Yakni agar kalian mengetahui makna-maknanya dan memahami kandungannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Sesungguhnya Kami menurunkan Al-Qur’an ini dengan bahasa Arab supaya kalian mengerti makna-maknanya dan memahami isinya guna membangun manusia individu dan sosial"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami menurunkannya berupa Al-Qur’an yang berbahasa Arab agar kalian mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. diantara aspek kejelasan dan terangnya, Allah menurunkannya dengan bahasa arab, bahasa yang paling mulia dan fasih, ia alquran menerangkan segala hal yang dibutuhkan oleh manusia yang berupa fakta fakta yang bermanfaat. seluruh segi kejelasan dan terangnya al qur’an ini tujuannya “agar kamu memahaminya” yakni, supaya kalian memahami batasan batasan Allah, masalah masalah yang prinsip ataupun cabang cabangnya, perintah perintah dan larangan laraganNya. Apabila kalian sudah memahaminya dengan dasar keyakinan, dan hati hati kalian mengetahui pengetahuan tentangnya, maka hal itu akan membuahkan amalan anggota tubuh dan ketundukan hati kepadaNya. Dan “agar kamu memahaminya” yakni, agar akal akal kalian bertambah matang melalui pengulangan makna makna yang mulia lagi luhur pada benak benak kalian. Hingga kalian akan berada dalam perubahan dari suatu kondisi kepada kondisi kondisi lainnya, yang lebih tinggi dan sempurna."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (قُرۡءَٰنًا عَرَبِيّٗا) quraanan ‘arabiyyan : dengan bahasa Arab, bahasanya kabilah ‘Adnan dan Qahthan. Makna ayat : Firman-Nya (إِنَّآ أَنزَلۡنَٰهُ) Kami menurunkannya yaitu, Al-Qur’an( قُرۡءَٰنًا عَرَبِيّٗا) dengan bahasa Arab agar mereka bisa memahaminya, memikirkan makna-maknanya, dan mendapat hidayah darinya, sehingga mendapat kebahagiaan. (لَّعَلَّكُمۡ تَعۡقِلُونَ) agar kalian bisa memahaminya, dan mengetahui apa yang ia bawa berupa cahaya dan petunjuk. Pelajaran dari ayat : • Hikmah diturunkannya Al-Qur’an dengan bahasa arab, agar orang-orang Arab memahaminya lalu mendakwahkannya kepada yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 2: Sehingga kamu dapat mengamalkannya, pemahamanmu bertambah karena pengulangan makna-maknanya yang tinggi lagi mulia di pikiranmu, sehingga kamu mau merubah diri dari keadaan yang satu kepada keadaan yang lain yang lebih baik dan lebih sempurna, dan inilah tarbiyah (pendidikan) yang sesunguhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 2",
    "description": "Selanjutnya Allah menegaskan keberadaan Al-Qur'an. Sesungguhnya kami menurunkannya, yakni kalam Allah yang qadim sebagai qur'an, yaitu bacaan yang berbahasa arab, bahasa induk masyarakat pertama yang dihadapi nabi agar kamu mengerti maknanya dan paham akan isi dari pesan-pesan yang terkandung di dalamnya, sehingga kamu mampu memahaminya dengan akalmu. Allah menurunkan ayat ini dan sesudahnya ketika sekelompok orang yahudi meminta nabi Muhammad menceritakan kisah nabi yusuf dan nabi yakub, lalu turunlah ayat berikut ini. Kami akan menceritakan kepadamu wahai nabi Muhammad suatu kisah umat-umat terdahulu untuk menguatkan hatimu dan menjadi pelajaran bagi umatmu. Kisah ini adalah kisah yang paling baik karena sarat dengan pesan, nasihat, dan pelajaran yang diuraikan dengan susunan bahasa yang indah dan menarik. Kisah itu kami turunkan dengan mewahyukan Al-Qur'an ini kepadamu, dan sesungguhnya engkau sebelum kami mewahyukannya itu termasuk orang yang tidak mengetahui tentang kisah-kisah umat terdahulu. Kisah-kisah para nabi dan orang-orang saleh yang dipaparkan dalam Al-Qur'an adalah menjadi pelajaran bagi umat nabi Muhammad, karena sarat dengan pesan-pesan moral serta nasihat."
  }
]