[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sauadara-saudara yusuf menjualnya kepada para pendatang dari rombongan musafir tersebut dengan harga yang murah. Mereka merasa tidak butuh terhadap yusuf dan ingin bebas darinya. Demikian ini lantaran mereka tidak mengetahui kedudukan yusuf di sisi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Si pencari air dan teman-temannya menjual Yusuf di Mesir dengan harga murah. Hanya senilai beberapa dirham saja. Hal itu karena mereka merasa segan terhadapnya dan ingin segera terbebas darinya. Karena mereka tahu bahwa Yusuf itu sebenarnya bukanlah seorang budak belian. Mereka khawatir perbuatan mereka diketahui oleh keluarga Yusuf. Dan ini merupakan bentuk kasih sayang Allah yang sempurna kepada Yusuf agar dia tidak terlalu lama bersama mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-21. Ketika para musafir itu membawa Yusuf ke negeri Mesir, mereka menjualnya dengan harga yang murah karena mereka tidak berminat merawat Yusuf; sebab mereka tidak mengetahui derajat dan ilmunya. Kemudian Yusuf dibeli oleh seorang Menteri Mesir; dia berkata kepada istrinya: “Perlakukanlah dia dengan baik ketika dia tinggal bersama kita, semoga dia dapat bermanfaat bagi kita sebagai pembantu, atau kita angkat dia sebagai anak.” Sebagaimana Kami selamatkan Yusuf dari kebinasaan, Kami juga memberinya kedudukan yang mulia di sisi Menteri Mesir itu, dan agar Kami mengajarkan kepadanya tafsir mimpi. Allah Maha Kuasa dalam ketetapan-Nya, tidak ada yang mampu menolaknya, akan tetapi kebanyakan manusia tidak mengetahui hal ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَشَرَوْهُ بِثَمَنٍۭ بَخْسٍ دَرٰهِمَ مَعْدُودَةٍ (Dan mereka menjual Yusuf dengan harga yang murah, yaitu beberapa dirham saja) Yakni pengambil air itu dan para sahabatnya menjual Yusuf di negeri Mesir. Pendapat lain mengatakan yang menjualnya adalah para saudaranya. Makna (بِثَمَنٍۭ بَخْسٍ) yakni dengan harga yang lebih rendah dari harga budak yang semisal Yusuf. وَكَانُوا۟ فِيهِ مِنَ الزّٰهِدِينَ (dan mereka merasa tidak tertarik hatinya kepada Yusuf) Mereka tidak tertarik padanya dan tidak peduli terhadapnya padahal ia adalah orang yang mulia di hadapan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Berikut diantara hal yang menakjubkan dari balasan yang diberikan di dunia adalah : - Tatkala tangan-tangan zholim saudara-saudara Yusuf terus memanjangkan kezholimannya : { وَشَرَوْهُ بِثَمَنٍ بَخْسٍ } \"Dan mereka menjual Yusuf dengan harga yang murah\" keadaan berubah setelah beberapa tahun berjalan, mereka tangan-tangan mereka memanjang dengan permohonan mereka kepada Yusuf untuk mendapatkan sedekah darinya, mereka berkata : { وَتَصَدَّقْ عَلَيْنَا } \"dan bersedekahlah kepada kami\" [ Yusuf : 88 ]. - Ketika seorang wanita hendak berbuat keji kepada Yusuf dengan dustanya : { قَالَتْ مَا جَزَاءُ مَنْ أَرَادَ بِأَهْلِكَ سُوءًا } \"Wanita itu berkata: “Apakah pembalasan terhadap orang yang bermaksud berbuat serong dengan isterimu\" kebenaran kemudian memaksanya untuk mengungkapkan hakikat perkara yang telah berlaku : { أَنَا رَاوَدتُّهُ عَن نَّفْسِهِ وَإِنَّهُ لَمِنَ الصَّادِقِينَ } \"akulah yang menggodanya untuk menundukkan dirinya (kepadaku), dan sesungguhnya dia termasuk orang-orang yang benar” [ Yusuf : 51 ], sesungguhnya barangsiapa yang dengan sungguh-sungguh meninggalkan kemaksiatan kepada Allah, niscaya ia akan melihat dampak baik darinya, begitu halnya ketika ia mengerjakan ketaatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Kelompok musafir itu menjualnya di Mesir dengan harga murah yang lebih sedikit dari harga budak yang serupa, yaitu dengan beberapa dirham saja. Dan mereka itu termasuk orang yang benci Yusuf dan tidak mau menerimanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjualnya} orang yang dipercaya dan para sahabatnya itu menjualnya di Mesir {dengan harga murah} yang sedikir {(yaitu) beberapa dirham saja dan mereka tidak tertarik kepadanya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. saudara suadar yusuf masih berada di dekatnya, maka kafilah itu membelinya dari mereka “dengan harga yang murah” harga yang rendah sekali yang dijelaskan Allah dengan ayat selanjutnya, ”yaitu beberapa dirham saja, dan mereka merasa tidak tertarik hatinya kepada yusuf” karena tidak ada maksud pada mereka kecuali hanya hasrat menyembunyikan dan menjauhkan dirinya dari sang ayah, tidak ada maksud di hati mereka untuk mengambil harga penjualannya. Makna pada ayat ini, bahwa ketika kafilah yang sedang lewat itu mendapatkannya, maka mereka ingin menutup nutupi tentangnya dan menaruhnyan dalam bagian barang barang yang mereka bawa. Sampai akhirnya datanglah saudara saudaranya. Mereka mengklaim bahwa itu adalah budak yang melarikan diri dari mereka. lantas kafilah itu membelinya dengan harga tersebut dan meminta jaminan dari mereka (saudara saudaranya) untuk memastikan agar dia tidak melarikan diri lagi. Wallohu a'lam"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَشَرَوۡهُ بِثَمَنِۢ بَخۡسٖ) wa syarauhu bi tsamanim bakhs : mereka menjualnya dengan harga murah. Makna ayat : Firman Allah (وَشَرَوۡهُ بِثَمَنِۢ بَخۡسٖ دَرَٰهِمَ مَعۡدُودَةٖ) dan mereka menjualnya dengan dirham yang sedikit tidak ditimbang, menunjukkan murahnya harga (وَكَانُواْ فِيهِ مِنَ ٱلزَّٰهِدِينَ ) dan mereka tidak membutuhkannya, yaitu saudara Yusuf, bukan pembelinya. Pelajaran dari ayat : • Penggunaan istilah syiraa dengan makna bai’ (jual-beli)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 20: Menurut Ibnu Mas’ud, mereka menjualnya seharga 20 dirham. Sedangkan menurut ‘Ikrimah, mereka menjualnya seharga 40 dirham, walahu a’lam. Mereka di sini bisa kembalinya kepada sekelompok musafir, yakni mereka tidak tertarik kepada Yusuf karena dia anak temuan dalam perjalanan. Mereka khawatir kalau pemiliknya datang mengambilnya. Oleh karena itu, mereka segera menjualnya meskipun dangan harga yang murah. Bisa juga kata “mereka” di sini kembalinya kepada saudara-saudara Yusuf karena mereka membencinya, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 20",
    "description": "Dan setelah musafir itu tiba di mesir, mereka pun menjualnya yakni nabi yusuf dengan harga rendah atau murah, yaitu beberapa dirham saja, sebab mereka tidak tertarik kepadanya untuk memiliki dan mengambilnya sebagai anak atau sebagai budak yang dipekerjakan. Setelah diuraikan bahwa nabi yusuf dijual oleh para kafilah dengan harga murah, lalu ayat ini menjelaskan tentang keberadaan nabi yusuf di tengah keluarga al-aziz yang membelinya. Dan orang dari mesir yang membelinya, yaitu al-aziz berkata kepada istrinya, 1 berikanlah kepadanya tempat dan layanan yang baik, mudah-Mudahan dia bermanfaat bagi kita setelah ia dewasa dan dapat membantu tugas-tugas kita, atau kita pungut dia sebagai anak karena tampak dari raut mukanya, dia anak yang cerdas, lagi rupawan, dan memiliki perawakan yang gagah. Dan demikianlah setelah kami selamatkan dia dari marabahaya, kami memberikan kedudukan yang baik kepada nabi yusuf di negeri mesir berupa tempat tinggal dan jabatan bendaharawan di kemudian hari, dan agar kami anugerahkan kenabian kepadanya, dan kami ajarkan kepadanya takwil mimpi serta rahasia-rahasia segala sesuatu. Dan Allah berkuasa terhadap urusan-Nya, tetapi kebanyakan manusia yang menyekutukan Allah tidak mengerti bahwa Allah berkuasa mengangkat derajat hamba-Nya."
  }
]