[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika rombongan orang-orang musafir itu pergi membawa yusuf menuju negeri mesir, seorang pembesar mesir membelinya dari mereka, dia itu seorang menteri. Dan dia berkaat kepada istrinya, ”perlakukanlah dia dengan baik, dan tempatkanlah dia di tempat posisi yang mulia di tempat kita. Semoga kita bisa memanfaatkannya untuk melayani kita, atau kita suruh tinggal bersama kita layaknya anak sendiri.” Dan sebagaimana kami telah selamtakan yusuf dan kami jadikan pembesar mesir merasa iba kepadanya, demikian pula kami memberikan kekuasaan kepada yusuf di negeri mesir, dan kami menjadikannya pemegang perbendaharaan kekayaannya, dan agar kami juga mengajarkan kepadanya ta’bir mimpi, sehingga dia dapat mengetahui dari mimpi itu peristiwa-peristiwa yang akan terjadi kemudian. Dan Alah mahakuasa atas urusanNya, ketetapannNya pasti terlaksana, tidak ada orang yang menghambatnya. Akan tetapi, kebanyakan orang tidak mengetahui bahwa urusan-urusan semuanya ada di tangan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan orang Mesir yang membelinya berkata kepada isterinya, \"Perlakukanlah dia dengan baik! Dan berilah dia tempat tinggal yang baik bersama kita! Mudah-mudahan dia berguna bagi kita untuk melakukan sesuatu yang kita perlukan. Atau kita bisa menjadikannya sebagai anak angkat.\" Setelah Kami menyelamatkan Yusuf dari pembunuhan, mengeluarkannya dari dalam sumur dan membuat hati Al-Aziz (petinggi kerajaan Mesir) menaruh belas kasihan kepadanya, Kami pun memberinya kedudukan yang baik di negeri Mesir. Dan Kami hendak mengajarkan ilmu takwil mimpi kepadanya. Allah Maha Perkasa untuk memaksakan perintah-Nya. Maka perintah-Nya pasti terlaksana. Tidak ada seorangpun yang dapat memaksakan kehendaknya kepada Dia. Akan tetapi kebanyakan manusia -yaitu orang-orang kafir- tidak mengetahui hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَقَالَ الَّذِى اشْتَرَىٰهُ مِن مِّصْرَ (Dan orang Mesir yang membelinya berkata) Dia adalah al-aziz yang menjadi bendahara negeri Mesir dan Menteri dari raja Mesir. أَكْرِمِى مَثْوَىٰهُ (Berikanlah kepadanya tempat yang baik) Dengan makanan yang baik dan pakaian yang bagus. عَسَىٰٓ أَن يَنفَعَنَآ(boleh jadi dia bermanfaat kepada kita) Yakni membantu kita dalam beberapa keperluan yang membutuhkan orang sepertinya. أَوْ نَتَّخِذَهُۥ وَلَدًا (atau kita pungut dia sebagai anak) Yakni mengangkatnya sebagai anak. Terdapat pendapat mengatakan bahwa al-aziz adalah orang yang belum dikaruniai anak. وَكَذٰلِكَ مَكَّنَّا لِيُوسُفَ(Dan demikian pulalah Kami memberikan kedudukan yang baik kepada Yusuf) Yaitu diselamatkan dari keburukan para saudaranya, dikeluarkan dari dasar sumur, dan dikasihi oleh al-aziz sehingga ia mampu memerintah dan melarang. وَلِنُعَلِّمَهُۥ مِن تَأْوِيلِ الْأَحَادِيثِ ۚ (dan agar Kami ajarkan kepadanya ta’bir mimpi) Yakni takwil mimpi. وَاللهُ غَالِبٌ عَلَىٰٓ أَمْرِهِۦ(Dan Allah berkuasa terhadap urusan-Nya) Yakni segala urusan terjadi sesuai dengan kehendak-Nya meskipun manusia mengatur dan merencanakan untuk berbuat yang sebaliknya. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ(tetapi kebanyakan manusia tiada mengetahuinya) Tidak mengetahui bahwa Allah berkuasa atas urusan mereka, dan mereka itu adalah orang-orang musyrik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kisah Yusuf memiliki keistimewaan tersendiri diantara kisah-kisah lainnya di dalam al-qur'an, kisah ini menjelaskan beberapa keterangan yang cukup mulai dari tempat kejadian : { وَقَالَ الَّذِي اشْتَرَاهُ مِنْ مِصْرَ } \"Dan orang Mesir yang membelinya berkata\" , dan disebutkan juga orang-orang yang terlibat dalam kisah ini, sebagaimana disebutkan bahwa tuan yang membelinya adalah orang yang memiliki kedudukan yang tinggi : { وَكَذَٰلِكَ مَكَّنَّا لِيُوسُفَ فِي الْأَرْضِ } \"Dan demikian pulalah Kami memberikan kedudukan yang baik kepada Yusuf di muka bumi (Mesir)\", dan bahwasanya ketika peristiwa ini terjadi Yusuf masih dalam usia kanak-kanak : { أَوْ نَتَّخِذَهُ وَلَدًا ۚ } \"atau kita pungut dia sebagai ana\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Pembelinya, yaitu Penguasa Mesir, Menteri Raja yang bertanggung jawab atas gudang harta berkata kepada isterinya: “Berilah dia tempat bagus bersama kita, dan penuhilah dengan baik hajatnya, barangkali dia akan berguna bagi kita saat dewasa. Sehingga dia mengerjakan beberapa pekerjaan atau mengangkatnya sebagai anak karena ketampanan dan kecerdasannya.” Sebagaimana menyelamatkannya dari pembunuhan dan sumur, Kami memberinya tempat dan posisi tinggi di Mesir sampai dia menjadi Menteri harta kerajaan itu. Sungguh Kami akan membuatnya menjadi raja dan mengajarinya mengungkap dan menafsirkan mimpi. Dan Allah itu tidak bisa dikalahkan oleh apapun. Dia meletakkan sesuatu sesuai kehendakNya, meskipun manusia telah membuat rencana berbeda dariNya. Akan tetapi kebanyakan manusia, yaitu orang-orang musyrik, tidak mengetahui bahwa Allah berkuasa atas sesuatu dan Mampu mewujudkan kehendakNya sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang Mesir yang membelinya berkata kepada istrinya,“Muliakanlah tempat dia} tempat dia di sisi kita {Mudah-mudahan dia bermanfaat bagi kita atau kita memungutnya sebagai anak”} menjadikannya anak dengan mengadopsinya {Demikianlah Kami memberikan kedudukan yang baik kepada Yusuf di bumi} negeri Mesir {dan agar Kami mengajarinya takwil mimpi. Allah berkuasa terhadap urusanNya} Allah tidak dapat dikalahkan sedikitpun dan tidak ada satu pun yang bisa menentangnya {tetapi kebanyakan manusia tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. ketika kafilah itu membawanya pergi menuju mesir dan menjualnya di sana, ternyata seorang pembesar negeri mesir membelinya. setelah dia membelinya, dia terpukau dengannya sehingga berpesan kepada istrinya, ”berikanlah kepadanya tempat (dan layanan) yang baik, boleh jadi dia bermanfaat kepada kita atau kita pungut dia sebagai anak” maksudnya barangkali dia dapat memberikan manfaat yang bisa di dapat dari seorang budak berupa berbagai macam pelayanan atau boleh jadi kita bisa bersenang senang dengannya sebagaimana kita bisa bersenang sennag dengan anak anak kita. Perkataan itu diungkapkan kemungkinan lantaran mereka belum dikaruniai anak. ”dan demikian pulalah, kami memberikan kedudukan yang baik kepada yusuf di muka bumi (mesir)” maksudnya sebagaimana kami telah memudahkan bagi yusuf agar dibeli seorang pejabat tinggi negeri mesir dan memuliakannya dengan bentuk kemuliaan seperti itu, maka kami juga menjadikan peristiwa ini sebagai mukadimah pemberian kekuasaan baginya di dunia melalui jalan ini. ”dan agar kami ajarkan kepadanya ta’bir mimpi” jika dia tetap hidup tanpa kesibukan dan tanpa masalah kecuali (memperdalam) ilmu saja, maka keadaan (yang kondusif) itu merupakan salah satu faktor (yang memudahkan) ia mempelajari ilmu yang banyak dari berbagai ilmu ilmu hukum, ilmu takwil mimpi dan ilmu lainnya. ”dan Allah berkuasa terhadap urusanNya” ketetapan Allah pasti berlaku, tidak ada pihak yang bisa menghentikannya, dan tidak ada sesuatupun yang dapat menundukannya. ”tetapi kebanyakan manusia tidak mengetahuinya” Karena itu terjadilah peristiwa itu dari mereka, dan muncul dari mereka usaha mengganjal ketetapan ketetapan takdir Allah, padahal mereka itu tak berdaya dan sangat lemah untuk dapat melakukannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَقَالَ ٱلَّذِي ٱشۡتَرَىٰهُ) wa qaalal ladzisytaraahu : seseorang yang membelinya, namanya: Qithfir, dan julukannya: Al-‘Aziz. (أَكۡرِمِي مَثۡوَىٰهُ) akrimii matswaah : muliakanlah tempat tinggalnya yaitu muliakanlah ia dan berbuat baiklah. (أَوۡ نَتَّخِذَهُۥ وَلَدٗاۚ) aw nattakhidzahu walada : kita mengadopsinya. Karena ia belum mempunyai anak. (مِن تَأۡوِيلِ ٱلۡأَحَادِيثِۚ) min ta’wiilil ahaadiits : tafsir mimpi. Makna ayat : Ketika kabilah itu sampai di Mesir, mereka menjualnya kepada seorang menteri namanya Qithfir Al-‘Aziz, lalu ia melihat ada kebaikan di dalamnya, berkata kepada istrinya: Zulaikha, “Muliakanlah tempat tinggalnya, semoga ia bisa membantu kita atau kita jual dia dengan harga mahal, atau mengadopsinya karena kita belum mempunyai anak. Ini makna firman-Nya : (وَقَالَ ٱلَّذِي ٱشۡتَرَىٰهُ مِن مِّصۡرَ لِٱمۡرَأَتِهِۦٓ أَكۡرِمِي مَثۡوَىٰهُ عَسَىٰٓ أَن يَنفَعَنَآ أَوۡ نَتَّخِذَهُۥ وَلَدٗاۚ). Firman-Nya : (وَكَذَٰلِكَ مَكَّنَّا لِيُوسُفَ فِي ٱلۡأَرۡضِ) sebagaimana Kami telah menyelamatkannya dari pembunuhan, dari kegelapan sumur, dan Kami memberikannya kepada Al-‘Aziz, Kami akan berikan Yusuf kekuasaan di bumi, sehingga ia menjadi raja Mesir beserta isinya, memerintah dengan keadilan dan kasih sayang. Firman-Nya : (وَلِنُعَلِّمَهُۥ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِۚ) Kami ajarkan dia tafsir mimpi. Firman-Nya : (وَٱللَّهُ غَالِبٌ عَلَىٰٓ أَمۡرِهِۦ) “Dan Allah berkuasa terhadap urusan-Nya” atas urusan Yusuf, saudara-saudaranya tidak mampu melaksanakan keinginan mereka, karena Allah Maha Kuasa atas seluruh perkara yang Dia kehendaki. Tidak ada yang bisa menghalanginya, karena Dialah, Yang Maha Perkasa dan Maha Bijaksana. Firman-Nya : (وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ ) Karena jika mereka mengetahuinya, mereka akan menyerahkan seluruh urusan mereka kepada Allah dan bertawakkal kepada-Nya, tidak mencoba untuk bermaksiat—keluar dari ketaatan kepada-Nya. Dalam ayat ini juga terdapat hiburan untuk Rasulullah shalallahu ‘alaihi wa salam atas apa yang ia rasakan berupa gangguan dari orang-orang terdekatnya, sebagaimana Yusuf mendapat gangguan dari saudara-saudaranya, yang mana mereka adalah orang terdekatnya setelah kedua orang tuanya. Pelajaran dari ayat : • Dihapusnya sistem adopsi dalam Islam. • Pengetahuan akan tafsir mimpi adalah karamah yang Allah ajaran kepada hambaNya yang Dia kehendaki. • Barangsiapa yang memerangi Allah, pasti akan kalah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 21: Dari sekelompok musafir. Orang Mesir yang membeli Yusuf ‘alaihis salam itu seorang menteri negara bernama Qithfir, sebagai pemegang harta kekayaan negeri Mesir, sedangkan istrinya bernama Ra’il (demikian menurut Ibnu Abbas), namun yang lain mengatakan, bahwa nama istrinya adalah Zulaikha. Raja Mesir ketika itu bernama Ar Rayyan bin Al Walid seorang yang berasal dari kaum ‘Amaliq. Qithfir kemudian membelinya dengan harga 20 dinar ditambah dua pasang sandal dan dua buah baju. Sebagaimana budak memberikan banyak pelayanan kepada tuannya. Mungkin keduanya belum punya anak seingga ingin menjadikannya sebagai anak. Yakni sebagaimana Kami menyelamatkan Yusuf dari pembunuhan, ketika berada di sumur, dan dijadikan hati Qithfir sayang kepadanya. Melalui jalan ini. Ketika Beliau tinggal di sana tanpa diberikan banyak kesibukan dan perhatian Beliau tertuju kepada ilmu, maka yang demikian menjadi sebab Beliau banyak memperoleh ilmu, ilmu tentang hukum-hukum, takwil mimpi, dan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 21",
    "description": "Setelah diuraikan bahwa nabi yusuf dijual oleh para kafilah dengan harga murah, lalu ayat ini menjelaskan tentang keberadaan nabi yusuf di tengah keluarga al-aziz yang membelinya. Dan orang dari mesir yang membelinya, yaitu al-aziz berkata kepada istrinya, 1 berikanlah kepadanya tempat dan layanan yang baik, mudah-Mudahan dia bermanfaat bagi kita setelah ia dewasa dan dapat membantu tugas-tugas kita, atau kita pungut dia sebagai anak karena tampak dari raut mukanya, dia anak yang cerdas, lagi rupawan, dan memiliki perawakan yang gagah. Dan demikianlah setelah kami selamatkan dia dari marabahaya, kami memberikan kedudukan yang baik kepada nabi yusuf di negeri mesir berupa tempat tinggal dan jabatan bendaharawan di kemudian hari, dan agar kami anugerahkan kenabian kepadanya, dan kami ajarkan kepadanya takwil mimpi serta rahasia-rahasia segala sesuatu. Dan Allah berkuasa terhadap urusan-Nya, tetapi kebanyakan manusia yang menyekutukan Allah tidak mengerti bahwa Allah berkuasa mengangkat derajat hamba-Nya. Dan ketika dia telah cukup dewasa, yakni memiliki kematangan dalam berpikir dan jasmani yang kuat, kami berikan kepadanya karunia kenabian, kekuasaan dan ilmu pengetahuan agama, takwil mimpi, dan rahasia-rahasia segala sesuatu. Demikianlah kami memberi karunia kepada hamba-Nya sebagai balasan kepada orang-orang yang berbuat baik karena ketaatannya kepada Allah."
  }
]