[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika yusuf mencapai puncak kekuatannya dalam masa mudanya, kami anugerahkan kepadanya pemahaman dan ilmu. Dan dengan balasan serupa yang kami beriikan kepada yusuf atas perbuatan baiknya, kami memberikan balasan kepada orang-orang yang berbuat baik atas tindakan baik mereka. Disini terkandung hiburan bagi rasulullah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Setelah Yusuf mencapai kesempurnaannya secara fisik dan mental, Kami memberinya pemahaman dan ilmu pengetahuan. Balasan semacam itulah yang Kami berikan kepada orang-orang yang berbuat baik dalam melaksanakan ketaatannya kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Setelah Yusuf sampai pada puncak masa mudanya, Kami memberinya hikmah dan pemahaman dalam agama dan tafsir mimpi. Sebagaimana balasan yang kami berikan kepadanya, Kami juga akan membalas orang-orang yang baik dalam perkataan dan perbuatan mereka. Ketika Yusuf mendapat ujian dibuang ke dalam sumur, Kami beri dia nikmat keselamatan; kemudian dia mendapat ujian menjadi seorang budak, kemudian Kami beri dia kenikmatan kemuliaan. Dan penyebutan ayat ini pada situasi ini, terdapat isyarat bahwa kebijaksanaan, ilmu, dan kebaikan adalah sifat-sifat baik yang pasti membuahkan kebaikan, kebajikan, dan kehormatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَلَمَّا بَلَغَ أَشُدَّهُۥٓ (Dan tatkala dia cukup dewasa) Makna (الأشد) yakni batas umur dimana telah sempurna kekuatan seseorang; kemudian setelah umur ini kekuatannya akan berkurang. Terdapat pendapat mengatakan bahwa itu adalah ketika seseorang menginjak umur 33 tahun. Pendapat lain mengatakan ketika telah mencapai baligh. Dan pendapat lain mengatakan ketika mencapai 18 tahun. ءَاتَيْنٰهُ حُكْمًا وَعِلْمًا ۚ (Kami berikan kepadanya hikmah dan ilmu) Hikmah yakni kenabian. Dan ilmu yakni ilmu agama dan ilmu takwil mimpi. وَكَذٰلِكَ نَجْزِى الْمُحْسِنِينَ (Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik) Dan semua orang yang berbuat baik maka Allah akan membalasnya dengan kebaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Yusuf -'alaihissalam- berjalan di muka bumi membawa begitu banyak kelebihan pada dirinya, akan tetapi di dalam al-qur'an sekalipun Allah tidak pernah memuji tentang ketampanan wajahnya! melainkan Allah memujinya karena ia termasuk orang-orang yang senantiasa berbuat baik { وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ } \"Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik\". 2 ). { وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ } \"Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik\" , { إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ } \"sesungguhnya kami melihat kamu termasuk oranng-orang yang berbuat baik\" [ Yusuf : 78 ], berbuat kebaikan adalah wasilah yang besar untuk mendatangkan kebaikan lain, dan merupakan kaidah terbaik yang dengan dapat diwujudkan cita-cita yang besar, dan sesungguhnya ia merupakan awal dari perjalan dan bukan akhir dari segalanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dan ketika dia beranjak dewasa, yaitu memiliki kekuatan fisik dan akal, serta berumur cukup, yaitu 30 sampai 40 tahun, Kami memberinya wahyu kenabian dan hikmah, yaitu keilmuan yang menyokong amalnya, pengetahuan tentang rahasia-rahasia sesuatu, serta pengetahuan tentang agama, tafsir mimpi dan berbagai kejadian. Seperti halnya membalas Yusuf dengan balasan ini, Kami membalas orang-orang yang baik terhadap diri sendiri dengan menaati Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia telah cukup dewasa} telah berhenti usia muda, keperkasaan, dan kekuatannya {maka Kami memberinya keputusan} pemahaman {dan ilmu. Demikian itu Kami memberi balasan kepada orang-orang yang berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. maksudnya, ”dan tatkala dia mencapai (usia)” yaitu yusuf ”cukup dewasa” maksudnya mencapai usia kesempurnaan kekuatan maknawi dan jasmaninya dan sudah layak untuk mengemban beban beban yang berat berupa kenabian dan risalah, maka ”kami berikan kepadanya hikmah dan ilmu” yakni, kami jadikan ia sebagai nabi dan rasul, seorang ulama yang rabbani. ”demikianlah kami memberi balasan kepada orang orang yang berbuat baik” dalam ibadahnya kepada al-khalik dengan mengerahkan kemampuan dan ketulusan saat mengerjakannya. sedangkan bagi yang (berbuat baik) kepada sesama hamba Allah (maka kami memberikan balasan) dengan mencurahkan kemanfaatan dan kebaikan kepada mereka. Diantara balasan kami atas kebaikannya, kami menganugrahinya ilmu yang berguna. ini mengondisikan bahwa yusuf sudah mencapai tingkatan ihsan. Maka Allah mengaruniakan kepadanya hikmah dan ilmu yang banyak serta kenabian di antara manusia."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَلَمَّا بَلَغَ أَشُدَّهُۥٓ) wa lammaa balagha asyuddahuu : telah kuat badan dan akalnya. (حُكۡمٗا وَعِلۡمٗاۚ) hukmaw wa ‘ilma : hikmah dan pengetahuan: hikmah dalam perilaku dan pengetahuan akan agama. Makna ayat : Firman-Nya : (وَلَمَّا بَلَغَ أَشُدَّهُۥٓ ءَاتَيۡنَٰهُ حُكۡمٗا وَعِلۡمٗاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُحۡسِنِينَ ٢٢) Ketika Yusuf telah sempurna kekuatan fisiknya dengan melewati masa anak-anak menuju remaja, begitu pula akalnya dengan melewati masa remaja hingga dewasa (ءَاتَيۡنَٰهُ حُكۡمٗا وَعِلۡمٗاۚ) Kami berikan kepadanya hikmah: mencocoki kebenaran (وَعِلۡمٗاۚ) kefakihan dalam agama. Sebagaimana Kami memberi Yusuf hikmah dan ilmu, Kami membalas orang-orang yang berbuat kebaikan—atas ketaatan mereka kepada Kami—dengan kesabaran, kejujuran, dan tawakkal yang indah. Di dalamnya ada kabar gembira untuk Rasulullah shalallahu ‘alaihi wa sallam dengan akhir yang bahagia, dan Allah ta’ala pasti akan menolongnya dari musuh-musuhnya, dan menjadikannya berkuasa atas mereka. Pelajaran dari ayat : • Kedewasaan dimulai setelah selesainya masa anak-anak dan akil baligh. • Balasan yang baik, untuk niat dan amal yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 22: Yaitu ketika Beliau semakin kuat baik batin maupun zhahir (fisik); kuat memikul beban-beban kenabian dan kerasulan, yaitu ketika berusia 30 atau 33 tahun. Maksudnya, dijadikan nabi dan rasul. Yakni pemahaman terhadap agama. Baik dalam beribadah kepada Allah maupun dalam bergaul dengan hamba-hamba Allah. Allah memberikan balasan kepada mereka yang berbuat baik atas kebaikan mereka dengan ilmu yang bermanfaat, Allahummaj’alnii minhum, Allahummaj’alnii minhum, Allahummaj’alnii minhum, Allahumma aamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 22",
    "description": "Dan ketika dia telah cukup dewasa, yakni memiliki kematangan dalam berpikir dan jasmani yang kuat, kami berikan kepadanya karunia kenabian, kekuasaan dan ilmu pengetahuan agama, takwil mimpi, dan rahasia-rahasia segala sesuatu. Demikianlah kami memberi karunia kepada hamba-Nya sebagai balasan kepada orang-orang yang berbuat baik karena ketaatannya kepada Allah. Setelah diuraikan tentang karunia Allah kepada nabi yusuf berupa ilmu pengetahuan dan kenabian ketika dewasa, ayat berikut ini menjelaskan sisi lain yang dialami nabi yusuf, yaitu godaan istri al-aziz. Dan perempuan (istri al-aziz) yang dia (nabi yusuf ) tinggal di rumahnya menggoda dirinya. Dan serta merta dia pun masuk ke kamar nabi yusuf kemudian menutup pintu-pintu kamar, lalu berkata kepada nabi yusuf, marilah mendekat kepadaku. Kemudian nabi yusuf berkata seraya memohon, aku berlindung kepada Allah dari tindakan keji, bagaimana mungkin aku menuruti ajakanmu, sungguh, tuanku al-aziz telah memperlakukan aku dengan baik, memberiku tempat, kedudukan, serta memberiku kepercayaan, maka sedikit pun aku tidak akan mengkhianati kepercayaannya. Sesungguhnya orang yang membalas kebaikan dengan kejahatan adalah termasuk golongan orang zalim, dan orang yang zalim itu tidak akan beruntung."
  }
]