[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan istri menteri mengajak yusuf yang berada di dalam rumahnya dengan lemah lembut, untuk berbuat keji dengan dirinya, lantaran ketertarikannya kepada yusuf yang amat besar dan ketampanan parasnya, dan dia mengunci pintu-pintu sehingga hanya ada dia dan Yusuf di sana, lalu berkata, “kemarilah kepadaku.” Yusuf menjawab, “Aku berlindung kepada Allah. Aku memohon penjagaan dan perlindungan kepadaNya dari keinginan yang kamu mengajakku kepadanya, dan dari berhianat terhadap tuanku yang telah menempatkanku pada martabat yang baik, dan memuliakanku, maka aku tidak mau menghianatinya dalan hal istrinya. Sesungghunya tidak beruntung orang yang berbuat kezhaliman dan melakukan sesuatu yang tidak pantas dia perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Isteri Al-Azīz meminta kepada Yusuf -'alaihissalām- secara halus disertai dengan jebakan agar dia mau berbuat mesum dengannya. Dia menutup pintu-pintu agar situasi benar-benar sepi. Dan dia berkata kepada Yusuf, \"Ayo! Kemarilah!\" Yusuf menjawab, \"Aku berlindung kepada Allah dari ajakanmu. Sesungguhnya tuanku telah berbuat baik kepadaku dengan memberikan tempat yang baik di sisinya, maka aku tidak akan mengkhianatinya. Karena jika aku mengkhianatinya berarti aku menjadi orang yang zalim. Padahal sesungguhnya orang-orang yang zalim itu tidak akan beruntung.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Kemudian kenikmatan kemuliaan Yusuf mendatangkan ujian dari istri Menteri Mesir karena dia telah jatuh cinta kepada Yusuf. Yusuf tinggal bersamanya di istananya, sehingga dia tergoda dengan ketampanannya karena tidak berhati-hati dalam menjaga pandangan dari Yusuf. Maka setan menggodanya agar merayu Yusuf dengan lembut dan mengajaknya untuk melakukan perbuatan keji. Akhirnya dia bertekat untuk melakukannya dan mencoba menarik perasaan dan menggoda nafsu Yusuf. Dia menutup baik-baik seluruh pintu istananya agar dapat berdua dengan Yusuf, kemudian dia berkata: “Aku telah berhias dan berdandan demi dirimu, maka datanglah kemari.” Namun Yusuf mengingatkannya untuk tetap menjaga amanah suaminya dan agar tidak mengkhianatinya: “Aku berlindung kepada Allah dari ajakanmu untuk berkhianat terhadap tuanku yang telah memperlakukanku dengan baik dan memuliakanku. Sungguh orang yang melanggar larangan Allah tidak berada pada jalan keselamatan dan kemenangan.” Imam at-Thabari meriwayatkan dengan sanad hasan, dari Ali bin Abi Thalhah, dari Ibnu ‘Abbas, bahwa maksud dari firman Allah (هيت لك) yakni: bawa ke sini milikmu. (at-Tafsir as-Shahih 3/318)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَرٰوَدَتْهُ (Dan wanita (Zulaikha) menggoda Yusuf) Makna (المراودة) yakni keinginan dan permohonan dengan penuh kelembutan. Dan kata ini sering diidentikkan dengan usaha menggoda agar dapat melakukan jima’ dengan seseorang. الَّتِى هُوَ فِى بَيْتِهَا (yang Yusuf tinggal di rumahnya) Yakni di rumah istri dari al-aziz, yang menurut sebuah pendapat Namanya adalah Zulaikha. وَغَلَّقَتِ الْأَبْوٰبَ (dan dia menutup pintu-pintu) Yakni menutup pintu-pintu. هَيْتَ لَكَ ۚ (Marilah ke sini) Yakni, kemarilah. Ia memanggil Yusuf untuk mendatanginya. قَالَ مَعَاذَ اللهِ (Yusuf berkata: “Aku berlindung kepada Allah) Yakni aku berlindung dari ajakanmu kepadaku. إِنَّهُۥ رَبِّىٓ أَحْسَنَ مَثْوَاىَ ۖ (sungguh tuanku telah memperlakukan aku dengan baik”) Yakni bagaimana aku akan melakukan hal itu sedangkan suamimu al-aziz adalah tuanku yang telah memeliharaku dengan baik sebagaimana yang diperintahkan kepadamu dengan ucapannya “أكرمي مثواي” maka bagaimana aku akan mengkhianatinya dengan melakukan ini dengan istrinya dan menerima ajakanmu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Satu kata yang pertama kali dihadapkan kepada kita dalam kisah ini yang merupakan pendatang segala kejadian menakjubkan dalam hidup Yusuf -alaihissalam- , yaitu : { وَرَاوَدَتْهُ } \"Dan wanita (Zulaikha) yang Yusuf tinggal di rumahnya menggoda Yusuf\" , adalah kata yang menggambarkan momen pertama sangat mengesankan dari istri al-'Aziz, sampai ia berani meminta untuk berbuat kemungkaran, dia memberikan usahanya yang terbaik untuk menipu, karena kata \"murowadah\" menunjukkan kelembutan dalam permintaan, dengan cara mendatangi kemudian pergi, dan konteks \"mufa'alah\" menunjukkan satu pekerjaan yang dilakukan berulang kali. 2 ). { الَّتِي هُوَ فِي بَيْتِهَا } Satu faidah penting diberikan oleh ayat ini, yaitu : konteks ayat menggambarkan bahwa yusuf berada dirumah zulaikha, hal ini menunjukkan tingginya integritas yang dimiliki oleh Yusuf, ketika ia tidak ada niat untuk menuruti permintaan majikannya padahal begitu banyak ia menyaksikan keindahan yang dimiliki oleh perempuan itu, dan permintaannya untuk berbuat keji ditinggalkan menjadikannya pemilik derajat yang paling tinggi di negri itu. 3 ). { وَغَلَّقَتِ الْأَبْوَابَ وَقَالَتْ هَيْتَ لَكَ } \"dan dia menutup pintu-pintu, seraya berkata: \"Marilah ke sini\"\" , tatkala perkara ini tersebar di penjuru kota, wanita itu masih saja tidak peduli dengan tersebarnya kerusakan yang dperbuat olehnya : { وَلَئِنْ لَمْ يَفْعَلْ مَا آمُرُهُ لَيُسْجَنَنَّ وَلَيَكُونًا مِنَ الصَّاغِرِينَ } \"Dan sesungguhnya jika dia tidak mentaati apa yang aku perintahkan kepadanya, niscaya dia akan dipenjarakan dan dia akan termasuk golongan orang-orang yang hina\" [ Yusuf : 32 ], begitulah mula-mula terjadinya kemungkaran secara tersembunyi, dan ketika ia mulai diketahui oleh halayak banyak kemungkaran itu akan diperbuat secara terang-terangan. 4 ). { وَغَلَّقَتِ الْأَبْوَابَ وَقَالَتْ هَيْتَ لَكَ } Ayat ini menunjukkan langkah pertama yang dilakukan oleh istri al-Aziz untuk mewujudkan keinginannya yang keji, yaitu langkah yang terbagi menjadi dua bagian : langkahnya dalam perbuatan : { وَغَلَّقَتِ الْأَبْوَابَ } \"dan dia menutup pintu-pintu\" dan langkahnya dalam ucapan { وَقَالَتْ هَيْتَ لَكَ } \"seraya berkata: \"Marilah ke sini\" , pada kata { وَغَلَّقَتِ } menunjukkan adanya usaha untuk menutup, untuk jumlah pintu yang banyak; benar-benar bersiap-siap untuk melakukan keinginannya. 5 ). { قَالَ مَعَاذَ اللَّهِ } \"Yusuf berkata: \"Aku berlindung kepada Allah\" perkataan Yusuf ini merupakan perlindungan baginya dalam melawan perkataan perempuan itu kepadanya; hal itu menunjukkan perbedaan antara bahasa syahwat dan khianat, dan bahasa kesucian dan keikhlasan, dan spontanitas lisan Yusuf mengucapkan ta'awudz adalah bukti kuatnya hubungannya kepada tuhannya dan kedekatannya kepada-Nya. 6 ). Ibnu al-Jauzi berkata : suatu ketika aku dirisaukan oleh satu perkara yang dibenci dalam syari'at, maka aku pun kembali kepada Allah untuk mengeluarkan kerisauan itu dari hatiku, aku membuka Al-qur'an, dan yang terbuka adalah surah Yusuf, sampai aku sampai pada ayat : { قَالَ مَعَاذَ اللَّهِ ۖ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ } \"Yusuf berkata: \"Aku berlindung kepada Allah, sungguh tuanku telah memperlakukan aku dengan baik\" seketika aku merenung tentang ayat ini, seakan-akan aku dihadapkan dengannya secara langsung, aku terbangun dan berkata : wahai diri ! sungguh ini adalah kebebasan yang ditukar dengan tidak adil, begitu berhati-hatinya seorang Yusuf diatas kebenaran sedangkan ia dihadapkan dengan perkara yang dapat merusak imannya dari seseorang yang telah berbuat baik kepadanya : { إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ } \"sungguh tuanku telah memperlakukan aku dengan baik\" . Maka bagaimana dengan anda wahai hamba Allah, kebaikan-Nya kepadamu tidak terhitung banyaknya. 7 ). { إِنَّهُ رَبِّي } Penggunaan kata \"rab\" tanpa menggunakan kata \"siyadah\" dalam kalimat ini; menunjukkan adanya pengakuan yang tnggi terhadap kebaikan dan kemuliaan, juga sebagai dalil diantara harga diri yang baik dan baiknya akhlaq seseorang adalah menjaga hak-hak orang yang telah berbuat baik kepadanya, dan itu lebih daripada ia mengkhianatinya. Adapun konteks kalimat dengan kata \"رب\" berarti : berbuat baik yang lebih kepadaku dan bukan berarti memnciptakanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Lalu dia digoda Zulakha, isteri pemimpin yang dia tinggali rumahnya. Godaan itu adalah ajakan dengan ramah, lembut dan penuh tipu daya. Dia mengajak Yusuf untuk berjima’. Lalu dia menutup pintu-pintu dan berkata kepada Yusuf: “Kemarilah dan terimalah, Aku telah berdandan untukmu.” Lalu Yusuf berkata kepadanya: “Aku berlindung kepada Allah dari kebodohan dan kefasikan, yaitu dari ajakanmu kepadaku. Bagaimana aku melakukannya. Kenyataannya suamimu adalah tuanku, dia memberi tempat baik bagiku, memuliakanku dan menjadikanku orang kepercayaan dalam mengurus urusan-urusannya, maka aku tidak akan mengkhianatinya. Sesungguhnya orang-orang zalim yang menukar kebaikan dengan keburukan itu tidak akan beruntung” Dikatakan: ”Sesungguhnya rahasia itu di sisi Allah, sesungguhnya itu sebaik-baik tempatku di negeri barat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu wanita yang rumahnya ditinggali Yusuf menggodanya} lalu istri Al Aziz itu memanggil Yusuf untuk mendekatinya dan menggaulinya dengan lembut dan penuh tipu daya {Dia menutup rapat semua pintu, lalu berkata,“Marilah mendekatiku”} kemarilah kepadaku {Yusuf berkata,“Aku berlindung kepada Allah} Aku berlindung kepada Allah dari ajakanmu kepadaku {Sesungguhnya dia adalah tuanku} tuanku {Dia memuliakan tempatku} memuliakan tempatku bagaimana bisa aku mengkhianatinya dengan (menggauli) istrinya {Sesungguhnya orang-orang zalim tidak akan beruntung”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Cobaan yang besar ini lebih dahsyat bagi yusuf daripada cobaan yang dilakukan saudara saudaranya serta lebih berat dalam bersabar untuk menghadapinya. pahalanya pun lebih besar, karena merupakan kesabaran yang bersifat ikhtiyari (pilihan) padahal banyak faktor yang bisa menyeretnya untuk melakukan hal itu. lalu dia lebih mengutamakan kecintaan kepada Allah daripada fitnah itu. sementara cobaan yang dihadapi dari saudara saudaranya kesabarannya bersifat idthirari (terpaksa) sebagaimana berbagai macam penyakit dan peristiwa yang tidak mengenakkan yang menimpa sesorang tanpa bisa mengelak. Tidak ada tempat berkelit kecuali dengan bersabar dalam menghadapinya, suka atau tidak. 23-24. hal itu karena, yusuf tinggal di rumah al aziz dalam keadaan terhormat. ia memiliki ketampanan, kesempurnaan dan daya terpikat yang mengakibatkan “wanita (zulaikha) yang yusuf tinggal di rumahnya menggoda yusuf untuk menundukkan dirinya (kepadanya)” maksud yusuf adalah budaknya, berada di bawah pengaturannya sementara tempat tinggal keduanya sama, hingga menjadi mudah untuk menjalankan perbuatan buruk tanpa disadari atau diketahui orang orang. ”dan” tingkat beratnya musibah semakin bertambah dengan “dia menutup pintu pintu” sehingga tempat menjadi benar benar kosong, dan mereka berdua merasa aman dari kehadiran seseorang kepada mereka berdua karena pintu pintu sudah terkunci. sang wanita memintanya untuk menggaulinya, sembari berkata, ”marilah kesini” lakukan perbuatan yang dibenci ini, marilah kemari! ditambah lagi, ia seorang asing (disana) rasa malu orang seperti dirinya tidak seperti malu yang muncul ketika ia berada dikampung halamannya sendiri dan ditengah orang orang yang mengenalnya. ia bagai tawanan ditangan wanita tersebut. sedangkan wanita itu adalah majikannya. pada diri wanita itu terpancar kecantikan yang berpotensi untuk menyeret yusuf menuju perbuatan itu. yusuf sendiri seorang pemuda lajang, yang diancam wanita itu dengan hukuman penjara atau siksa yang pedih bila tidak menyambut apa yang diperintahkan majikan perempuannya. Lalu dia mampu bersabar untuk tidak bermaksiat kepada Allah meskipun ada rangsangan kuat untuk melaukannya. Karena dia telah berkeinginan melakukannya dengan si wanita itu, lalu dia menyingkirkan keinginan tersebut karena Allah. Ia lebih mengutamakan ridha Allah daripada keinginan pribadi yang kerap memerintahkan kepada perkara yang buruk. ia telah melihat petunjuk Rabbnya berupa ilmu dan iman yang menumbuhkan sikap menghindari perbuatan yang diharamkan Allah, yang mewajibkannya mengambil jarak dan menahan diri dari maksiat yang besar ini. Dan “dia berkata” ‘aku berlindung kepada Allah’ maksudnya aku berlindung kepada Allah dari perbuatan yang buruk ini. Karena itu termasuk tindakan yang membuat Allah murka dan menjauhkan diriku dariNya. Itu adalah sebuah bentuk penghianatanku terhadap hak kehormatan majikan (lelakiku) yang telah memuliakan keberadaanku, maka tidak sepantasnya aku membalasnya dengan memperlakukan istrinya dengan balasan yang sangat jelek. Itu bentuk perbuatan aniaya yang paling besar, dan orang yang berbuat kezhaliman tidak akan pernah jaya. Ringkasannya, Allah menyusun berbagai pengahalang baginya dari perbuatan itu yaitu ketakwaan kepada Allah, memperhatikan hak majikan yang telah memuliakannya, memelihara diri dari tindakan aniaya yang mana pelakunya tidak akan selamat. Demikian pula anugerah yang Allah berikan kepadanya berupa petunjuk iman yang menuntut munculnya ketaatan untuk mengerjakan perintah perintah dan menghindari larangan larangan. Inti dari itu semua, Allah telah memalingkannya dari keburukan dan perbuatan yang keji itu. Karena ia tergolong hamba hambaNya yang ikhlas kepadaNya dalam beribadah, dan Allah sudah mengikhlaskan hati mereka, memilih dan mengistimewakan mereka bagi diriNya, mencurahkan kepada mereka beraneka kenikmatan dan menyelamatkan mereka dari berbagai keburukan. Dengan itu semua, mereka menjadi insan insan pilihanNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 23: Ayat ini dan setelahnya menerangkan ujian yang dialami Nabi Yusuf ‘alaihis salam, dan ujian ini lebih berat daripada ujian sebelumnya dari saudara-saudaranya. Hal itu, karena kesabaran dalam ujian ini adalah kesabaran atas dasar pilihan dengan banyak pendorong untuk melakukannya, namun Beliau lebih mengutamakan kecintaan Allah daripada menuruti hawa nafsunya. Adapun kesabarannya terhadap ujian yang diterimanya dari saudara-saudaranya adalah kesabaran karena terpaksa sebagaimana kesabaran terhadap penyakit dan musibah yang menimpa seseorang tanpa ada pilihan di sana, di mana tidak ada sikap lain selain harus tetap bersabar. Yakni Zulaikha. Sehingga tidak mungkin aku akan mengkhianati orang yang telah berbuat baik kepadaku, dan yang demikian adalah kezaliman, sedangkan orang-orang yang zalim tidak akan beruntung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 23",
    "description": "Setelah diuraikan tentang karunia Allah kepada nabi yusuf berupa ilmu pengetahuan dan kenabian ketika dewasa, ayat berikut ini menjelaskan sisi lain yang dialami nabi yusuf, yaitu godaan istri al-aziz. Dan perempuan (istri al-aziz) yang dia (nabi yusuf ) tinggal di rumahnya menggoda dirinya. Dan serta merta dia pun masuk ke kamar nabi yusuf kemudian menutup pintu-pintu kamar, lalu berkata kepada nabi yusuf, marilah mendekat kepadaku. Kemudian nabi yusuf berkata seraya memohon, aku berlindung kepada Allah dari tindakan keji, bagaimana mungkin aku menuruti ajakanmu, sungguh, tuanku al-aziz telah memperlakukan aku dengan baik, memberiku tempat, kedudukan, serta memberiku kepercayaan, maka sedikit pun aku tidak akan mengkhianati kepercayaannya. Sesungguhnya orang yang membalas kebaikan dengan kejahatan adalah termasuk golongan orang zalim, dan orang yang zalim itu tidak akan beruntung. Dan sungguh, perempuan itu telah berkehendak kepadanya, yakni nabi yusuf untuk melayani nafsu birahinya. Dan nabi yusuf pun berkehendak kepadanya, sekiranya dia tidak melihat tanda dari tuhannya, niscaya dia akan terjatuh dalam perbuatan maksiat. Demikianlah, kami kuatkan keimanannya sehingga kami palingkan darinya perilaku keburukan dan kekejian. Sungguh, dia'nabi yusuf'termasuk hamba kami yang terpilih untuk mengemban risalah Allah dan selalu taat kepada perintah-Nya."
  }
]