[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya jiwa wanita telah condong untuk berbuat kekejian, sedang jiwa Yusuf telah membisiki dirinya dengan bisikan hati untuk memenuhi ajakannya, seandainya dia tidak melihat tanda dari tanda-tanda Tuhanya yang menghalanginya dari apa yang dibisikan jiwanya. Sesungguhnya kami memperlihatkan padanya tanda tersebut, agar kami dapat menyingkirkan darinya hal yang buruk dan perbuatan keji dalam seluruh urusannya. Sesungguhnya dia termasuk hamba-hamba kami yang bersih lagi terpilih untuk mengemban risalah, yang ikhlas dalam ibadah mereka kepada Allah dan pengesaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Wanita itu sangat bernafsu untuk berbuat mesum dengan Yusuf. Dan Yusuf-pun sempat tergoda untuk melakukan hal itu sekiranya dia tidak melihat tanda dari Allah yang berhasil mencegahnya dan menjauhkannya dari perbuatan itu. Kami memperlihatkan tanda itu kepadanya untuk menghindarkannya dari perbuatan yang buruk dan menjauhkannya dari perbuatan zina dan pengkhianatan. Sesungguhnya Yusuf adalah salah satu dari hamba-hamba Kami yang terpilih untuk menjadi Rasul dan Nabi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Istri Menteri itu sangat bertekad untuk melakukan perbuatan keji dengannya. Sedangkan Yusuf, dalam dirinya terdapat bisikan untuk menuruti nafsunya tanpa ada tekad dan kesengajaan, dan ini tidak berlangsung lama hingga dia melihat tanda dari petunjuk dari Allah baginya sehingga menghilangkan bisikan itu; sehingga Allah menjauhkannya dari godaan itu. kami menampakkannya tanda itu agar menjauhkannya dari keburukan dan perbuatan keji. Sebagaimana Allah menjauhkan darinya tipu daya saudara-saudaranya, Allah juga menjauhkan tipu daya wanita ini darinya, agar dia tidak terjerumus ke dalam dosa. Sungguh Yusuf adalah hamba yang ikhlas kepada Allah, oleh sebab itu dia berlari dari wanita itu menuju pintu dengan tujuan menuju keridhaan Allah Yang Maha Perkasa. Akan tetapi wanita itu mengejarnya hingga di depan pintu, dan menarik baju bagian belakang Yusuf sehingga baju itu terkoyak karena tarikannya yang keras dan keburukan sikapnya. Dan pada saat itu keduanya mendapati suami wanita itu berada di depan pintu, sehingga selesailah ujian hawa nafsu ini untuk berpindah ke ujian penjara. Ketika wanita itu melihat suaminya, dia ingin mengubah status dirinya dari pelaku menjadi korban agar dia dapat menyelamatkan dirinya; dengan licik dia segera bertanya kepada suaminya: “Apakah hukuman yang tepat bagi orang yang ingin berbuat keji terhadap istrimu, selain dipenjara atau disiksa dengan siksaan yang berat?” Syeikh as-Syinqithi berkata: “Secara dzahir dapat dipahami dari ayat ini bahwa Nabi Yusuf berkeinginan untuk berbuat keji kepada istri Menteri ini sebagaimana wanita ini juga menginginkannya. Akan tetapi al-Qur’an menjelaskan kesuciannya dari terjerumus ke dalam sesuatu yang tidak layak baginya, yaitu dengan menjelaskan kesaksian setiap orang yang berhubungan dengan kesucian dirinya dan kesaksian Allah tentang itu serta pengakuan Iblis tentangnya. Adapun orang-orang yang berhubungan dengan tragedi itu adalah Yusuf, Istri Menteri, Menteri, para wanita, dan para saksi. Adapun penegasan Yusuf bahwa dia suci dari kemaksiatan tersebut adalah sebagaimana dalam firman Allah: “Dia berusaha menggodaku”, dan firman Allah: “Ya Tuhanku, penjara lebih aku sukai daripada menuruti ajakan mereka”. Sedangkan pengakuan wanita itu adalah ketika dia berkata kepada teman-temannya, para wanita: “Sungguh aku telah menggodanya, namun dia menolak”, dan perkataannya: “Sekarang telah jelas kebenarannya, akulah yang menggodanya agar dia tunduk kepadaku”. Oleh sebab itu ketika membaca ayat ini lebih baik berhenti pada kalimat (ولقد همت به)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَلَقَدْ هَمَّتْ بِهِۦ ۖ وَهَمَّ بِهَا (Sesungguhnya wanita itu telah bermaksud (melakukan perbuatan itu) dengan Yusuf, dan Yusufpun bermaksud (melakukan pula) dengan wanita itu) Yakni keduanya telah bermaksud untuk melampiaskan kebutuhan biologisnya. Tsa’lab berkata: yakni Zulaikha telah bermaksud melakukan kemaksiatannya dengan menggebu-gebu, dan Yusuf juga telah bermaksud namun belum menyetujui apa yang ia inginkan. Maka diantara kedua maksud itu terdapat perbedaan. لَوْلَآ أَن رَّءَا بُرْهٰنَ رَبِّهِۦ ۚ( andaikata dia tidak melihat tanda (dari) Tuhannya) Yakni dengan mengingat perjanjian Allah yang diambil dari para hamba-Nya. Pendapat lain mengatakan bahwa nabi Yusuf melihat gambaran nabi Ya’qub yang sedang menggigit jemarinya sambil memperingatkan nabi Yusuf. كَذٰلِكَ(Demikianlah) Yakni demikianlah Allah memperlihatkannya sebuah tanda agar ia kembali ingat. لِنَصْرِفَ عَنْهُ السُّوٓءَ(agar Kami memalingkan dari padanya kemungkaran) Yakni kemungkaran berkhianat kepada al-aziz dengan berbuat keji terhadap istrinya. وَالْفَحْشَآءَ ۚ( dan kekejian) Yakni zina. إِنَّهُۥ مِنْ عِبَادِنَا الْمُخْلَصِينَ (Sesungguhnya Yusuf itu termasuk hamba-hamba Kami yang terpilih) Yakni yang dipilih Allah untuk menjadi rasul, sehingga Allah menghindarkannya dari terjerumus ke dalam kemaksiatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { لَوْلَا أَنْ رَأَىٰ بُرْهَانَ رَبِّهِ } \"andaikata dia tidak melihat tanda (dari) Tuhannya\" Allah senantiasa menolong para wali-Nya tatkala mereka berada daam masa-masa yang menyulitkan dengan hal-hal yang menjadikan mereka tetap diatas kebenaran, bahkan sekalipun pelanggaran itu hampir saja terjadi, namun burhan dari Allah segera mungkin menjauhkannya dari kesalahan, maka ketahuilah sesungguhnya manusia tidak akan berada diatas kebenaran kalau tidak dengan burhan dari Allah. 2 ). { كَذَٰلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ } \"Demikianlah, agar Kami memalingkan dari padanya kemungkaran dan kekejian\" Sekalipun usaha dan kerja keras yang dilakukan oleh istri al-aziz untuk menjerumuskan Yusuf ke dalam kemungkaran. 3 ). { كَذَٰلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ ۚ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ } Allah bersaksi dalam ayat ini atas kesucian Yusuf sebanyak empat kali : - 1 ] . { لِنَصْرِفَ عَنْهُ السُّوءَ } Huruf \"Lam\" sebagai penekanan, bahwa kemungkaran benar-benar dijauhkan darinya. - 2 ] . { وَالْفَحْشَاءَ } Bahkan ia juga dijauhkan dari kekejian. - 3 ] . { إِنَّهُ مِنْ عِبَادِنَا } Dan Sifat ini ditambahkan kepada-Nya. - 4 ] . { الْمُخْلَصِينَ } 4 ). Ibnu Taimiyah berkata : Orang yang benar-benar ikhlas kepada Allah telah merasakan manisnya penghambaan kepada-Nya yang menghalanginya dari cinta kepada selain dari-Nya, karena tidaklah bagi hati yang selamat sesuatu yang lebih manis dan lebih lezat, tidak lebih baik dari iman yang dibarengi dengan penghambaan tinggi kepada Allah. 5 ). Diantara penyebab terbesar munculnya kecintaan seseorang kepada selain Allah adalah : memalingkan hati dari Allah, dan manusia tidak meninggalkan sesuatu yang ia cintai melainkan ada sesuatu lain yang lebih ia cinta, atau ia takut dibenci olehnya, namun hati ini jika telah merasakan manisnya ibadah kepada Allah, dan senantiasa ikhlas kepada-Nya, niscaya tidak akan ada yang lebih indah dan lebih manis dari kecintaann kepada Allah. 6 ). { كَذَٰلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ ۚ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ } kecintaan dan gairah seseorang kepada pemandangan-pemandangan yang diharamkan merupakan pegantar baginya kepada kesyirikan, dan setiap kali seseorang lebih dekat kepada kesyrikan dan semakin menjauh dari keikhlasan, menjadikan gairahnya kepada pemandangan-pemandangan itu lebih besar, namun jika keikhlasannya kepada tauhid semakin besar, maka ia akan semakin jauh dari gairah kepada pemandangan-pemandangan tersebut; oleh karena itu istri al-Aziz ditimpa oleh gairahnya kepada kesyirikan sedangkan Yusuf selamat darinya dengan kekhlasannya. 7 ). Seseorang tidak ditimpa oleh gairah yang keji melainkan hatinya telah berpaling dari Allah dan mengingat kepada-Nya dan dari perintah dan larangan-Nya, Allah berfirman tentang Yusuf : { كَذَٰلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ ۚ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ } , ayat ini menunjukkan bahwasanya keikhlasan merupakan sebab utama untuk memusnahkan kemungkaran dan kekejian, karena jika hati seseorang sepenuhnya terisi oleh keikhlasan ia akan berkecukupan tanpa berpaling kepada selain darinya. 8 ). Janganlah seseorang berembira jika pintu maksiat terbuka baginya dan pengantar kepadanya mudah didapatkan, karena boleh jadi ia merupakan tanda kelemahan baginya disisi tuhannya : { كَذَٰلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ ۚ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ }. 9 ). Suatu ketika seorang pemuda dihadapkan oleh ketergantungannya yang tinggi kepada kemungkaran, dan begitu susah ia meninggalkan kemungkarn itu, sampai ketika Allah memudahkan baginya untuk meninggalkan hal itu setelah ia mentadabburi firman-Nya tentang Yusuf : { كَذَٰلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ ۚ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ } dengan seger ia melihat kepada drinya, dan berkata : jika aku ikhlas niscaya tuhanku akan menyelamatkanku sebagaimana Ia menyelamatkan Yusuf, dan tidak lama waktu berlalu hingga pemuda ini menjadi seorang da'i kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dan sungguh masing-masing dari keduanya sudah saling bermaksud melakukannya sesuai tabiat manusia, namun Zulaikhalah yang bersikeras menginginkan hal itu dan Yusuf tidak menginginkannya. Kalau tidak karena adanya nubuwwah, dan ingatannya kepada janji Allah serta kedekatannya kepadaNya dengan melakukan ketaatan niscaya dia sudah menggaulinya. Seperti itulah dia berpegang teguh dan melihat tanda-tanda kuasa Allah sebagai sebuah pengingat, agar Kami bisa membebaskannya dari tuduhan pengkhianatan terhadap raja dalam keluarganya sendiri serta kekejian zina. Sesungguhnya dia termasuk hamba-hamba Kami yang dibebaskan dan dipilih karena risalah dan ketaatannya, atau kesuciannya dari sifat-sifat kurang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh wanita itu benar-benar berkehendak dengannya} dirinya telah bertekad bulat untuk melakukan perbuatan keji itu {Dan Yusuf pun berkehendak dengannya} hatinya berkehendak menerimanya {Jika dia tidak melihat tanda Tuhannya} tanda dari Allah, maka dia mengendalikannya dari hasrat itu {Demikianlah, Kami memalingkan darinya keburukan dan kekejian. Sesungguhnya dia termasuk hamba-hamba Kami yang terpilih} orang-orang yang terpilih untuk menerima kenabian dan risalah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-24. hal itu karena, yusuf tinggal di rumah al aziz dalam keadaan terhormat. ia memiliki ketampanan, kesempurnaan dan daya terpikat yang mengakibatkan “wanita (zulaikha) yang yusuf tinggal di rumahnya menggoda yusuf untuk menundukkan dirinya (kepadanya)” maksud yusuf adalah budaknya, berada di bawah pengaturannya sementara tempat tinggal keduanya sama, hingga menjadi mudah untuk menjalankan perbuatan buruk tanpa disadari atau diketahui orang orang. ”dan” tingkat beratnya musibah semakin bertambah dengan “dia menutup pintu pintu” sehingga tempat menjadi benar benar kosong, dan mereka berdua merasa aman dari kehadiran seseorang kepada mereka berdua karena pintu pintu sudah terkunci. sang wanita memintanya untuk menggaulinya, sembari berkata, ”marilah kesini” lakukan perbuatan yang dibenci ini, marilah kemari! ditambah lagi, ia seorang asing (disana) rasa malu orang seperti dirinya tidak seperti malu yang muncul ketika ia berada dikampung halamannya sendiri dan ditengah orang orang yang mengenalnya. ia bagai tawanan ditangan wanita tersebut. sedangkan wanita itu adalah majikannya. pada diri wanita itu terpancar kecantikan yang berpotensi untuk menyeret yusuf menuju perbuatan itu. yusuf sendiri seorang pemuda lajang, yang diancam wanita itu dengan hukuman penjara atau siksa yang pedih bila tidak menyambut apa yang diperintahkan majikan perempuannya. Lalu dia mampu bersabar untuk tidak bermaksiat kepada Allah meskipun ada rangsangan kuat untuk melaukannya. Karena dia telah berkeinginan melakukannya dengan si wanita itu, lalu dia menyingkirkan keinginan tersebut karena Allah. Ia lebih mengutamakan ridha Allah daripada keinginan pribadi yang kerap memerintahkan kepada perkara yang buruk. ia telah melihat petunjuk Rabbnya berupa ilmu dan iman yang menumbuhkan sikap menghindari perbuatan yang diharamkan Allah, yang mewajibkannya mengambil jarak dan menahan diri dari maksiat yang besar ini. Dan “dia berkata” ‘aku berlindung kepada Allah’ maksudnya aku berlindung kepada Allah dari perbuatan yang buruk ini. Karena itu termasuk tindakan yang membuat Allah murka dan menjauhkan diriku dariNya. Itu adalah sebuah bentuk penghianatanku terhadap hak kehormatan majikan (lelakiku) yang telah memuliakan keberadaanku, maka tidak sepantasnya aku membalasnya dengan memperlakukan istrinya dengan balasan yang sangat jelek. Itu bentuk perbuatan aniaya yang paling besar, dan orang yang berbuat kezhaliman tidak akan pernah jaya. Ringkasannya, Allah menyusun berbagai pengahalang baginya dari perbuatan itu yaitu ketakwaan kepada Allah, memperhatikan hak majikan yang telah memuliakannya, memelihara diri dari tindakan aniaya yang mana pelakunya tidak akan selamat. Demikian pula anugerah yang Allah berikan kepadanya berupa petunjuk iman yang menuntut munculnya ketaatan untuk mengerjakan perintah perintah dan menghindari larangan larangan. Inti dari itu semua, Allah telah memalingkannya dari keburukan dan perbuatan yang keji itu. Karena ia tergolong hamba hambaNya yang ikhlas kepadaNya dalam beribadah, dan Allah sudah mengikhlaskan hati mereka, memilih dan mengistimewakan mereka bagi diriNya, mencurahkan kepada mereka beraneka kenikmatan dan menyelamatkan mereka dari berbagai keburukan. Dengan itu semua, mereka menjadi insan insan pilihanNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 24: Ayat ini tidaklah menunjukkan bahwa Nabi Yusuf ‘alaihis salam mempunyai keinginan yang buruk terhadap wanita itu (Zulaikha), akan tetapi godaan itu demikian besanya sehingga jika dia tidak dikuatkan dengan tanda dari Allah Subhaanahu wa Ta'aala yang menghalanginya tentu dia jatuh ke dalam kemaksiatan. Tentang tanda dari Allah Subhaanahu wa Ta'aala ada beberapa pendapat. Ada yang mengatakan, bahwa dibayangkan kepadanya wajah bapaknya Ya’qub ‘alaihis salam, atau dibayangkan kepadanya wajah tuannya, atau dilihat atap di atasnya tulisan yang isinya melarang berbuat zina, dan ada yang mengatakan bahwa tanda tersebut adalah ilmu dan iman yang ada pada dirinya yang membuatnya meninggalkan larangan Allah Subhaanahu wa Ta'aala, wallahu a’lam. Yaitu sifat khianat. Yaitu zina. Dalam sebuah qira’at dibaca dengan “mukhlishin”, yang artinya termasuk orang-orang yang ikhlas dalam ketaatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 24",
    "description": "Dan sungguh, perempuan itu telah berkehendak kepadanya, yakni nabi yusuf untuk melayani nafsu birahinya. Dan nabi yusuf pun berkehendak kepadanya, sekiranya dia tidak melihat tanda dari tuhannya, niscaya dia akan terjatuh dalam perbuatan maksiat. Demikianlah, kami kuatkan keimanannya sehingga kami palingkan darinya perilaku keburukan dan kekejian. Sungguh, dia'nabi yusuf'termasuk hamba kami yang terpilih untuk mengemban risalah Allah dan selalu taat kepada perintah-Nya. Dan ketika itu keduanya pun berkejaran lari menuju pintu, dan perempuan itu mencoba menghalangi nabi yusuf keluar pintu dengan menarik baju gamisnya dari belakang hingga koyak, dan pada saat nabi yusuf berhasil membuka pintu, keduanya mendapati suami perempuan itu di depan pintu. Ketika al-aziz menyaksikan istrinya bersama nabi yusuf keluar pintu, dia pun berkata kepada suaminya seraya meminta, apakah balasan terhadap orang yang bermaksud buruk terhadap istrimu wahai paduka, selain dipenjarakan atau dihukum dengan siksa yang pedih' istri al- aziz berkata demikian, untuk menutupi kesalahannya dan menjaga nama baik dirinya."
  }
]