[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Yusuf bersegera menuju pintu untuk keluar, dan sang wanita itu pun beranjak segera untuk mencoba menahannya dan menarik pakaian yusuf dari belakang, untuk menghalanginya keluar, sampai merobek pakaiannya, dan keduanya mendapati suami wanita tersebut di depan pintu. Lalu wanita itu berkata, ”apa balasan orang yang berhasrat melakukan perbuatan keji kepada istrimu selain di hukum penjara atau di ditimpakan hukuman dengan siksaan yang pedih?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Keduanya beradu cepat menuju pintu. Yusuf ingin menyelamatkan diri. Sedangkan wanita itu hendak mencegahnya keluar. Kemudian wanita itu memegang baju Yusuf untuk mencegahnya keluar. Lalu terkoyaklah baju Yusuf dari arah belakang. Dan keduanya mendapati sang suami, Al-Azīz tepat di depan pintu. Isteri Al-Azīz dengan licik mengatakan, \"Tidak ada hukuman yang tepat bagi orang yang hendak melakukan perbuatan keji dengan isterimu -wahai Al-Azīz- selain dijebloskan ke dalam penjara atau dijatuhi siksa yang sangat menyakitkan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَاسْتَبَقَا الْبَابَ (Dan keduanya berlomba-lomba menuju pintu) Saling berlomba menuju pintu; nabi Yusuf ingin kabur dan keluar lewat pintu, sedangkan istri al-aziz ingin mendahuluinya sampai di pintu agar dapat mencegahnya keluar. وَقَدَّتْ قَمِيصَهُۥ مِن دُبُرٍ (dan wanita itu menarik baju gamis Yusuf dari belakang hingga koyak) Yakni merobeknya dari belakang. وَأَلْفَيَا سَيِّدَهَا لَدَا الْبَابِ ۚ (dan kedua-duanya mendapati suami wanita itu di muka pintu) Yakni keduanya bertemu dengan al-aziz disana. قَالَتْ مَا جَزَآءُ مَنْ أَرَادَ بِأَهْلِكَ سُوٓءًا(Wanita itu berkata: “Apakah pembalasan terhadap orang yang bermaksud berbuat serong dengan isterimu) Zulaikha mengatakan perkataan ini agar mendapat jalan keluar dari masalahnya dan agar menutupi kesalahannya, sehingga ia menuduhkan segala perbuatannya kepada nabi Yusuf. إِلَّآ أَن يُسْجَنَ(selain dipenjarakan) Zulaikha meminta agar ia dapat memenjarakan Yusuf atau dapat mencambuknya sebagai balasan baginya kerena telah menolak keinginannya, sambil menampakkan bahwa nabi Yusuf berhak mendapatkan hukuman itu karena ia yang berbuat jahat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَاسْتَبَقَا الْبَابَ } Mengandung perintah agar manusia pergi menjauh dari perkara yang dapat menimbulkan fitnah sekalipun ia tela mencapai derajat ilmu yang tinggi, agama dan kematangan akal. 2 ). { وَاسْتَبَقَا الْبَابَ } \"Dan keduanya berlomba-lomba menuju pintu\" Diantara faidah lughowiyah dari ayat ini adalah : dalam ayat tidak dikatakan : ( اسْتَبَقَا إلى الْبَابَ ) : - 1 ). Karena \"istibaq : berlomba-lomba\" dalam ayat ini bukanlah tujuan utamanya, melainkan ia hanya wasilah, tetapi yang menjadi maksud utama adalah pintu, oleh karena itu jika dikatakan : \"اسْتَبَقَا إلى الْبَابَ\" maka pintu dalam ayat ini hanya sebagai batas akhir dari berlomba-lombanya mereka, karena setelah keduanya melewati pintu itu maka tempatnya pun berubah, oleh karena itu istri al-aziz berskeras untuk melarang Yusuf untuk keluar dari tempat itu. - 2 ). Menunjukkan masa yang cepat dari keduanya mencapai pintu itu. 3 ). { وَأَلْفَيَا سَيِّدَهَا لَدَى الْبَابِ } \"dan kedua-duanya mendapati suami wanita itu di muka pintu\" Ayat tidak mengatakan : وَأَلْفَيَا سَيِّدَهَما لَدَى الْبَابِ , sehingga siyadah itu itu berlaku untuk keduanya, yaitu karena dua hal : -1 ). Bahwasanya status Yusuf tidak masuk dalam kategori perbudakan, melainkan ia dibeli setelah ia mendapat kezhaliman. -2 ). Sesungguhnya seorang muslim tidak menjadi budak, dan gelar siyadah tidak berlaku bagi majikan kafir kepada seorang muslim. 4 ). { وَقَدَّتْ قَمِيصَهُ مِنْ دُبُرٍ } \"dan wanita itu menarik baju gamis Yusuf dari belakang hingga koyak\" Dalam ayat disebutkan \"قد القميص\" yakni : manarik pakaian hingga koyak, dan disebutkan juga tempat/posisi Yusuf ketika perkara ini terjadi, sebagai isyarat bahwa Yusuf berada di posisi yang paling dekat dari pintu, berarti dia yang berlari kabur meninggalkan tempat sedangkan perempuan itu yang mengejarnya dari belakang. Juga dikatakan dalam ayat \"قد\" dan bukan \"الشق\" padahal keduanya memilki makna yang sama; yaitu karena kata kerja \"القد\" tidak meninggalkan bekas melainkan bekas itu nampak besar. 5 ). { قَالَتْ مَا جَزَاءُ مَنْ أَرَادَ بِأَهْلِكَ سُوءًا } Zulaikha tidak mengatakan : \"ما جزاء يوسف\" \"apa balasan bagi Yusuf\" , seakan-akan dia tidak menginginkan bekas koyakannya itu menimpa Yusuf dan teror akan ditujukan hanya kepadanya, oleh karena itu ia mengurungkan untuk menyebutkan nama Yusuf secara langsung ketika berhadapan dengan al-aziz, juga agar penolakan Yusuf terhadap fitnah perempuan itu tidak terjadi dengan segera, karena ketika perempuan itu dengan segera menujukan fitnah kepada Yusuf; mungkin saja akan terjadi perkara lain. 6 ). Pada kalimat yang diucapkan Zulaikha : { بِأَهْلِكَ } \"dengan isterimu\" lebih ia utamakan daripada ia mengatakan (ْبِي) \"terhadapku\" adalah faidah : yaitu : penisbatan dirinya kepada al-aziz; agar ia menarik perhatian dan ksih sayang dari suaminya, agar fitnah itu seakan-akan benar ulah Yusuf untuk merusak keluarganya, segala upaya dilakukan Zulaikha agar dirinya tidak dikenal rusak atas ulahnya sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Keduanya saling mendahului menuju pintu. Yusuf ingin melarikan diri dan keluar, sedangkan istri Al-‘Aziz ingin mencegahnya, dia merobek baju Yusuf dari belakang ketika dia hendak melarikan diri. Dan keduanya mendapati suami Zulaikha berada di balik pintu. Dengan licik untuk menutupi dirinya dari tuduhan perbuatan keji Zulaikha berkata: “Apakah balasan bagi orang yang hendak berbuat keji kepada istrimu selain dipenjara dan diberi azab yang sangat pedih untuk membalas perlakuannya?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Keduanya berlomba menuju pintu} keduanya berlomba untuk menuju pintu, Yusuf melarikan diri darinya dan dia menarik Yusuf ke arahnya {dan wanita itu merobek} merobek {bajunya dari belakang} dari belakang {dan keduanya mendapati} mendapati {tuan wanita itu} suami wanita itu {di depan} di sisi {pintu. Wanita itu berkata,“Apakah balasan terhadap orang yang bermaksud buruk} berbuat keji {terhadap istrimu selain dipenjarakan atau siksa yang pedih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Saat menampik ajakan si wanita usai lontaran godaan yang sangat berat, yusuf bergegas melarikan diri darinya, dan bersegera keluar melalui pintu, supaya terbebas dan lari dari fitnah. Wanita itu (juga) dengan cepat mengikuti dan menarik bajunya sehingga robek. Ketika mereka sampai ke pintu dalam kondisi demikian, maka mereka berdua menjumpai majikannya, yaitu suaminya (wanita itu) berada di dekat pintu. Suaminya menyaksikan kejadian yang sulit diterima olehnya. Dengan sigap, wanita itu memilih untuk berdusta, dan (menyatakan) bahwasannya bujukan rayu berasal dari yusuf. Wanita itu mengatakan “apakah pembalasan terhadap orang yang bermaksud serong dengan istrimu” ia tidak mengatakan ’(apakah balsan) orang yang berbuat buruk kepada keluargamu’ sebagai usaha untuk berkelit membebaskan dirinya dan diri yusuf dari tindakan itu. Hal yang diperkarakan ialah, menyoal hasrat dan bujuk rayu semata. ”selain dipenjarakan atau (dihukum) dengan azab yang pedih” atau disiksa dengan siksaan yang menyakitkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَقَدَّتۡ قَمِيصَهُۥ) wa qaddat qamiishahu : merobeknya dari belakang. (وَأَلۡفَيَا سَيِّدَهَا) wa alfayaa sayyidahaa : mereka berdua mendapati Al-‘Aziz, suami perempuan tersebut. Dahulu mereka menggunakan istilah sayyid untuk kata suami, karena suami menguasai istrinya. Makna ayat : (وَٱسۡتَبَقَا ٱلۡبَابَ) Yusuf ingin keluar dan wanita itu ingin mengembalikan Yusuf kedalam rumah, khawatir akan tersebarnya kejadian tersebut, lalu ia menarik baju Yusuf dari belakang, (مِن دُبُرٖ) dari belakang, karena posisi Yusuf berada di depan wanita itu. (وَأَلۡفَيَا سَيِّدَهَا لَدَا ٱلۡبَابِۚ) mereka berdua mendapati suami wanita itu duduk di dekat pintu, tatkala mereka berdua lari menuju pintu, maka ia pun khawatir akan tertimpa bencana, kemudian bersegera membuat alasan, (مَا جَزَآءُ مَنۡ أَرَادَ بِأَهۡلِكَ سُوٓءًا إِلَّآ أَن يُسۡجَنَ) “Tidak balasan bagi orang yang ingin berbuat buruk kepada keluargamu kecuali dipenjara (selama satu atau dua hari), (أَوۡ عَذَابٌ أَلِيمٞ ) hukuman yang pedih seperti, dipukul dengan keras."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 25: Kemudian Yusuf pergi ke pintu untuk melarikan diri dari wanita itu. Untuk membersihkan dirinya. Yakni dipukuli."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 25",
    "description": "Dan ketika itu keduanya pun berkejaran lari menuju pintu, dan perempuan itu mencoba menghalangi nabi yusuf keluar pintu dengan menarik baju gamisnya dari belakang hingga koyak, dan pada saat nabi yusuf berhasil membuka pintu, keduanya mendapati suami perempuan itu di depan pintu. Ketika al-aziz menyaksikan istrinya bersama nabi yusuf keluar pintu, dia pun berkata kepada suaminya seraya meminta, apakah balasan terhadap orang yang bermaksud buruk terhadap istrimu wahai paduka, selain dipenjarakan atau dihukum dengan siksa yang pedih' istri al- aziz berkata demikian, untuk menutupi kesalahannya dan menjaga nama baik dirinya. Setelah dijelaskan bahwa kasus istri al-aziz dengan nabi yusuf diketahui oleh al-aziz, dan uraian tentang pernyataan istri al-aziz bahwa dirinya tidak bersalah, kemudian ayat ini menjelaskan tentang pembelaan diri nabi yusuf atas tuduhan tersebut. Dia'nabi yusuf'pun menyangkal tuduhan itu dan berkata, dia-lah yang menggodaku dan merayu diriku. Dan ketika itu ada seorang saksi, yakni seorang bayi dalam buaian dari keluarga perempuan itu memberikan kesaksian seraya berkata, jika baju gamisnya nabi yusuf koyak di bagian depan, maka apa yang dikatakan perempuan itu benar bahwa nabi yusuf telah menggoda istri al-aziz, dan dia nabi yusuf termasuk orang yang dusta."
  }
]