[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf berkata, ”Dialah yang mengajaku kepada perbuatan tersebut.” dan seorang anak kecil dari keluarganya masih dalam ayunan bayi bersaksi dengan berkata, ”Apabila pakaiannya robek dari arah depan, maka wanita itu benar dalam tuduhannya terhadap yusuf, dan yusuf termasuk orang-orang yang dusta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Yusuf -'alaihissalām- berkata, \"Dialah yang merayuku untuk berbuat mesum dengannya, dan aku tidak mau melakukannya.\" Tiba-tiba Allah membuat seorang bayi dari keluarga wanita itu berbicara. Lalu bayi itu bersaksi dengan mengatakan, \"Jika baju Yusuf terkoyak di bagian depan itu menandakan bahwa wanita itulah yang benar, karena dia tengah mempertahankan dirinya, dan Yusuf lah yang berdusta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Maka Yusuf membantah tipu daya itu untuk membela diri dengan penuh ketenangan dan memohon bantuan dari Allah: “Dialah yang mengajakku melakukan hal itu.” Kemudian seorang saksi yang adil dan cerdas dari keluarganya memberi kesaksian: “Jika baju Yusuf terkoyak di bagian depan maka wanita ini benar dalam tuduhannya, dan Yusuf adalah orang yang bohong. Akan tetapi jika yang terkoyak adalah bagian belakang maka wanita ini berbohong, dan Yusuf adalah orang yang benar.” Dan suaminya menerima nasihat tersebut untuk menyelesaikan masalah yang menimpa keluarganya ini. Syeikh as-Syinqithi berkata: “Dari ayat ini dapat dipahami bahwa ketetapan hukum dapat disandarkan pada tanda yang jelas yang menunjukkan kebenaran salah satu pihak dan kedustaan pihak lainnya; sebab Allah menyebutkan kisah ini pada situasi penerimaan bukti dengan tanda yang menunjukkan ketidakbersalahan Yusuf yang menjadi dalil bahwa berlandasan hukum seperti itu adalah suatu kebenaran, sebab terkoyaknya baju pada bagian belakang merupakan tanda yang jelas bahwa Yusuf berlari dari wanita itu kemudian dia menarik baju Yusuf dari belakang.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قَالَ هِىَ رٰوَدَتْنِى عَن نَّفْسِى ۚ (Yusuf berkata: “Dia menggodaku untuk menundukkan diriku) Yakni Zulaikha yang memintaku melakukan itu, namun aku sama sekali tidak menginginkan keburukan baginya. وَشَهِدَ شَاهِدٌ مِّنْ أَهْلِهَآ(dan seorang saksi dari keluarga wanita itu memberikan kesaksiannya) Terdapat pendapat mengatakan saksi ini adalah seorang bayi yang masih dalam buaian yang dapat berbicara. Dan ini adalah pendapat yang benar, sesuai dengan hadits yang membahas tentang itu, yaitu hadits nabi tentang penyebutan bayi-bayi yang dapat berbicara dalam buaian, dan Rasulullah menyebutkan diantaranya adalah saksi bagi Nabi Yusuf. Kesaksian saksi ini adalah dengan ucapannya: “Jika baju gamisnya terkoyak di arah depan maka wanita itu benar, yakni berarti Yusuflah yang menginginkan kekejian terhadapnya. وَهُوَ مِنَ الْكٰذِبِينَ (dan Yusuf termasuk orang-orang yang dusta) Yakni berdusta dalam ucapannya bahwa Zulaikha yang menggoda dirinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { قَالَ هِيَ رَاوَدَتْنِي } Yusuf tidak mengatakan : هذه راودتني ; semoga hikmah yang terkandung adalah Yusuf bermaksud mengabarkan bahwa dia benar-benar menjauh darinya, dan tidak perhatian kepadanya; sebagaimana perempuan itu berkhianat, dan apa yang dikatakan oleh Yusuf sesuai dengan ketetapan Allah atas para Nabi dan Rasul dari kebaikan adab dan ucapan mereka, yaitu ketika istri al-Aziz mensifati dirinya dengan : { بِأَهْلِكَ }, Yusuf juga mensifati perempuan ini dengan dhomir goib, tidak bermaksud menteror secara langsung, sebagai adab dalam berucap. 2). { مِنْ أَهْلِهَا } lafazh ini juga dikatakan Yusuf sebagai adab terhadap keluarga perempuan itu, tanpa menjelaskan secara zhohir tentag keburukan dihadapannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Untuk membela diri, Yusuf berkata: “Dia yang menginginkan hal itu dariku, dan aku tidak menghendaki keburukan padanya. Dan itu disaksikan bayi di tempat tidurnya yang berada di dekatnya.” Allah membuatnya bisa berbicara, sebagaimana yang ada dalam hadits shahih dari Nabi SAW yang menyebutkan tentang bayi yang berbicara di tempat tidurnya. Di antara keluarganya ada yang menjadi saksi bagi Yusuf dan berkata: “Jika bajunya robek atau terpotong pada bagian depan, maka ucapan Zulaikha benar, dan Yusuf termasuk orang-orang yang berdusta.” Menurut kebanyakan kelompok penafsir bahwa saksi itu bukanlah bayi melainkan laki-laki dewasa, yaitu anak dari paman Zulaikha."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yusuf berkata,“Dia yang menggoda diriku”} dia yang menginginkan hal itu dariku dan aku tidak menginginkan keburukan darinya {Seorang saksi dari keluarga wanita itu memberikan kesaksian“} seorang hakim memutuskan suatu keputusan dari kerabatnya {Jika bajunya koyak di bagian depan} dirobek dari bagian depan {maka wanita itu benar dan Yusuf termasuk orang-orang yang berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. maka yusuf membela dirinya dari tuduhan yang dilancarkan wanita itu dan “dia berkata ’Dia menggodaku untuk menundukan diriku (padanya)” pada saat itu kondisinya mengandung kemungkinan adanya kejujuran ada pada salah satu orang dari keduanya, namun tidak diketahui siapa diantara keduanya (yang jujur) tapi Allah menjadikan beberapa indikasi dan petunjuk bagi kebenaran dan kejujuran yang memandu menyibak kebenaran. Terkadang orang orang mengetahuinya dan kadang kadang tidak menyadarinya. Allah mencurahkan anugerahNya dalam polemic ini dengan memperjelas pihak yang jujur dari keduanya untuk membebaskan Nabi dan kekasihNya yusuf. Maka tergugahlah seorang saksi (ahli) dari anggota keluarga wanita itu, ia mempersaksikan melalui sebuah hipotesa, barangsiapa pada dirinya terdapat bukti itu maka dialah orang yang jujur. Ia berkata. ”jika baju gamisnya koyak di muka, maka wanita itu benar, dan yusuf termasuk orang orang yang dusta” hal itu karena mengindikasikan bahwa yusuflah yang menghampiri sang wanita, yang merayu dan berusaha melakukannya. Sementara wanita tersebut ingin menyingkirkannya dari dirinya, sehingga merobek bajunya dari sisi ini (bagian depan)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَشَهِدَ شَاهِدٞ مِّنۡ أَهۡلِهَآ) wa syahida syaahidum min ahliha : anak pamannya. (قُدَّ مِن قُبُلٖ) qudda min qubulin : dari depan. Makna ayat : Masih mengisahkan tentang Yusuf dan kejadian-kejadiannya, Zulaikha menfitnah Yusuf, ia sudah menggodanya dan menuntut agar ia dihukum, (مَا جَزَآءُ مَنۡ أَرَادَ بِأَهۡلِكَ سُوٓءًا إِلَّآ أَن يُسۡجَنَ أَوۡ عَذَابٌ أَلِيمٞ ) \"Apakah pembalasan terhadap orang yang bermaksud berbuat serong dengan istrimu, selain dipenjarakan atau (dihukum) dengan azab yang pedih?\". Maka Yusuf pun membantah tuduhan tersebut—karena ia sudah menuduh Yusuf, ia tidak akan mengakui perbuatannya. Maka Allah berfirman pada ayat-ayat ini, : (هِيَ رَٰوَدَتۡنِي عَن نَّفۡسِيۚ) \"Dia menggodaku untuk menundukkan diriku (kepadanya)\", Allah jalla jalaluh pun membuat seorang anak bayi yang masih menyusui berbicara—sebagai pemuliaan untuk hamba-Nya dan pilihan-Nya Yusuf. Maka anak itu berkata—sebagaimana yang Rasulullah shalallahu ‘alaihi wa sallam sebutkan: seorang saksi Yusuf—( إِن كَانَ قَمِيصُهُۥ قُدَّ مِن قُبُلٖ فَصَدَقَتۡ وَهُوَ مِنَ ٱلۡكَٰذِبِينَ ٢٦ وَإِن كَانَ قَمِيصُهُۥ قُدَّ مِن دُبُرٖ فَكَذَبَتۡ وَهُوَ مِنَ ٱلصَّٰدِقِينَ) Jika bajunya robek dari depan, maka wanita itu benar dan laki-laki itu yang berdusta. Pelajaran dari ayat : • Keharusan untuk membela diri, sekalipun dengan hal yang menyakiti lawan. • Pemuliaan Allah kepada wali-wali-Nya, sehingga Allah membuat seorang bayi berbicara untuk menjelaskan bebasnya Yusuf dari tuduhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 26: Ketika itu perkataan Zulaikha mengandung kemungkinan benar atau salah, namun belum dapat dipastikan. Akan tetapi, Allah Subhaanahu wa Ta'aala menjadikan untuk kebenaran dan kejujuran tanda yang menunjukkan terhadapnya, terkadang manusia mengetahui dan terkadang tidak. Yaitu putera pamannya. Ada yang mengatakan, bahwa ia masih kecil dalam buaian berdasarkan hadits yang diriwayatkan oleh Thabrani bahwa tidak ada yang dapat berbicara dalam buaian selain empat orang: Nabi Isa, saksi Yusuf, kawan Juraij, dan anak tukang sisir Fir’aun. Namun hadits ini dha’if, didha'ifkan oleh Syaikh Al Albani dalam Dha’iful Jaami’: 2140. Pendapat yang rajih (kuat), bahwa saksi tersebut adalah orang yang sudah dewasa dan berjanggut berdasarkan perkataan Ibnu Abbas radhiyallahu 'anhuma. Karena jika demikian berarti Yusuf yang mendatanginya dan si wanita menolaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 26",
    "description": "Setelah dijelaskan bahwa kasus istri al-aziz dengan nabi yusuf diketahui oleh al-aziz, dan uraian tentang pernyataan istri al-aziz bahwa dirinya tidak bersalah, kemudian ayat ini menjelaskan tentang pembelaan diri nabi yusuf atas tuduhan tersebut. Dia'nabi yusuf'pun menyangkal tuduhan itu dan berkata, dia-lah yang menggodaku dan merayu diriku. Dan ketika itu ada seorang saksi, yakni seorang bayi dalam buaian dari keluarga perempuan itu memberikan kesaksian seraya berkata, jika baju gamisnya nabi yusuf koyak di bagian depan, maka apa yang dikatakan perempuan itu benar bahwa nabi yusuf telah menggoda istri al-aziz, dan dia nabi yusuf termasuk orang yang dusta. Dan jika baju gamisnya nabi yusuf koyak di bagian belakang, maka perempuan itulah yang dusta karena telah berkata bohong, dan dia'nabi yusuf'termasuk orang yang benar perkataannya."
  }
]