[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila pakaiannya robek dari bagian belakang, maka wanita itu berdusta dalam tuduhannya, dan yusuf termasuk orang-orang yang berkata jujur.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan jika bajunya terkoyak di bagian belakang itu menandakan bahwa Yusuf lah yang benar, karena wanita itu tadi merayunya dan Yusuf berusaha melarikan diri darinya, maka wanita itulah yang berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَإِن كَانَ قَمِيصُهُۥ قُدَّ مِن دُبُرٍ (Dan jika baju gamisnya koyak di belakang) Yakni di sisi belakang. فَكَذَبَتْ(maka wanita itulah yang dusta) Berdusta dalam pengakuannya. وَهُوَ مِنَ الصّٰدِقِينَ (dan Yusuf termasuk orang-orang yang benar) Benar dalam pengakuannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Dan jika bajunya robek dari belakang, maka tuduhan Zulaikha terhadap Yusuf itu salah, dan Yusuf termasuk orang-orang yang jujur dalam memberikan tuduhannya kepada Zulaikha"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan jika bajunya terkoyak di bagian belakang, maka wanita itu yang berdusta dan Yusuf termasuk orang-orang yang jujur.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “dan jika baju gamisnya koyak di belakang, maka wanita itulah yang dusta, dan yusuf termasuk orang orang yang benar” karena fakta itu menunjukan ia berusaha melarikan diri dari wanita itu. Dan wanita itulah yang menginginkannya, sehingga ia merobekan bajunya dari bagian ini (belakang)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (قُدَّ مِن دُبُرٖ) qudda min dubur : dari belakang. Makna ayat : Akan tetapi jika robek dari belakang, maka ia telah benar dan wanita itu yang berdusta. Seperti ini lah keputusan dari saksi cilik itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 27: Karena jika demikian, berarti Yusuf berpaling darinya namun ditarik oleh wanita itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 27",
    "description": "Dan jika baju gamisnya nabi yusuf koyak di bagian belakang, maka perempuan itulah yang dusta karena telah berkata bohong, dan dia'nabi yusuf'termasuk orang yang benar perkataannya. Maka ketika dia'al-aziz'melihat baju gamisnya nabi yusuf koyak di bagian belakang, dia pun berkata, sesungguhnya ini adalah tipu dayamu wahai istriku. Sungguh, tipu dayamu untuk mengelabui kami benar-benar hebat."
  }
]