[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika sang suami melihat pakaian yusuf robek dari bagian belakang, dia pun tahu yusuf tidak berbuat apa-apa, dan dia berkata kepada istrinya, ”sesungguhnya kedustaan yang kamu tuduhkan kepada pemuda ini termasuk dari tipu daya kalian wahai para wanita, sesungguhnya tipu daya kalian adalah besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kemudian tatkala Al-Azīz menyaksikan bahwa baju Yusuf -'alaihissalām- terkoyak di bagian belakang, maka dapat dipastikan bahwa Yusuf lah yang benar. Dan Al-Azīz pun berkata, \"Sesungguhnya tuduhan yang kamu lancarkan kepada Yusuf -'alaihissalām- itu adalah bagian dari tipu muslihatmu, wahai kaum wanita. Sesungguhnya tipu muslihat kalian amat sangat kuat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Ketika sang suami melihat baju Yusuf terkoyak bagian belakangnya, dia menjadi yakin bahwa Yusuf tidak bersalah. Maka dia mengolok istrinya: “Perkara ini adalah tipu dayamu dan orang-orang yang membantu melaksanakan tipu daya ini. Sungguh tipu daya kalian agar terbebas dari akibat tipu daya kalian merupakan keburukan yang besar.” Syeikhul Islam Ibnu Taimiyah berkata: “Oleh sebab itu, ketika tidak disebutkan pertaubatan Yusuf dalam kisahnya dengan istri Menteri menunjukkan bahwa Yusuf memang tidak berdosa dalam kisah itu.” ("
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. فَلَمَّا رَءَا (Maka tatkala suami wanita itu melihat) Yakni ketika al-aziz melihat. قَمِيصَهُۥ (baju gamisnya) Yakni baju nabi Yusuf. قُدَّ مِن دُبُرٍ قَالَ إِنَّهُۥ (koyak di belakang berkatalah dia Sesungguhnya (kejadian) itu) Yakni kejadian yang kalian berdua perselisihkan ini. مِن كَيْدِكُنَّ ۖ( diantara tipu daya kamu) Wahai para wanita. إِنَّ كَيْدَكُنَّ عَظِيمٌ (sesungguhnya tipu daya kamu adalah besar) Makna (الكيد) yakni makar dan tipu daya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Tatkala Al-‘Aziz, suami Zulaikha bahwa baju Yusuf sobek pada bagian belakang, lalu membebaskannya dan berkata kepada istrinya: “Sesungguhnya perkara yang penuh perselisihan ini mengandung tipu muslihat wanita. Sesungguhnya tipu muslihat kalian itu sangat besar, wahai wanita, yaitu sangat licik dan mempengaruhi jiwa.” Al-Kaidu adalah tipu muslihat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika melihat bajunya terkoyak di bagian belakang, dia berkata, “Sesungguhnya ini} sesungguhnya kesamaran ini {adalah tipu daya kalian} salah satu jenis tipu dan muslihat kalian {Sesungguhnya tipu daya kalian benar-benar hebat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “maka tatkala suami wanita itu melihat baju gamis yusuf koyak dibelakang” dengan itu dia mengetahui kejujuran yusuf dan kesuciannya, dan bahwa wanita itulah yang berdusta. maka sang majikan pun berkata kepada wanita itu, ”sesungguhnya kejadian itu adalah diantara tipu daya kamu, sesungguhnya tipu daya kamu adalah besar” yakini, apakah ada tipu daya yang lebih berbahaya daripada rekayasa yang ia pakai untuk membebaskan dirinya dari sesuatu yang dia inginkan dan lakukan serta tuduhan kepada Nabi Allah yusuf?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِنَّهُۥ مِن كَيۡدِكُنَّۖ) innahuu min kaidikunn : ini termasuk dari tipu daya mu. Yaitu perkataannya (مَا جَزَآءُ مَنۡ أَرَادَ بِأَهۡلِكَ سُوٓءًا). “\"Apakah pembalasan terhadap orang yang bermaksud berbuat serong dengan istrimu,” Makna ayat : Firman Allah (فَلَمَّا رَءَا قَمِيصَهُۥ قُدَّ مِن دُبُرٖ قَالَ إِنَّهُۥ) Ketika ia melihat baju itu robek dari belakang ia berkata, “Sungguh itu (perkataan, مَا جَزَآءُ مَنۡ أَرَادَ بِأَهۡلِكَ سُوٓءًا إِلَّآ أَن يُسۡجَنَ أَوۡ عَذَابٌ أَلِيْمٌ), Apakah balasan bagi orang yang ingin berbuat buruk kepada keluargamu kecuali dipenjara atau hukuman yang pedih) (مِن كَيۡدِكُنَّۖ) adalah tipu daya kalian, wahai para wanita, (إِنَّ كَيۡدَكُنَّ عَظِيمٞ ) Sungguh, tipu daya kalian sangatlah besar. Pelajaran dari ayat : • Tipu daya wanita itu besar, dan memang seperti itu nyatanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 28: Yani ucapan istrinya, “Apakah balasan terhadap orang yang bermaksud buruk terhadap istrimu, selain dipenjarakan atau (dihukum) dengan siksa yang pedih?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 28",
    "description": "Maka ketika dia'al-aziz'melihat baju gamisnya nabi yusuf koyak di bagian belakang, dia pun berkata, sesungguhnya ini adalah tipu dayamu wahai istriku. Sungguh, tipu dayamu untuk mengelabui kami benar-benar hebat. Setelah al-aziz mengetahui bahwa istrinya yang bersalah, lalu ia berkata kepada nabi yusuf wahai yusuf ! lupakanlah peristiwa ini, jangan kamu ceritakan kepada orang lain, dan engkau wahai istriku mohonlah ampunan kepada Allah atas dosamu, karena engkau termasuk orang yang bersalah sebab telah menggoda yusuf dan berkata bohong."
  }
]