[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mentri mesir itu berkata, ”wahai yusuf, lupakanlah tindakan yang diperbuatnya, janganlah kamu menyebutnya kepada siapapun. Dan mintalah oleh kamu wahai istriku ampunan untuk dosamu. Sesungguhnya kamu termasuk orang-orang yang berbuat dosa saat menggoda yusuf untuk menundukan dirinya dan tuduhan dustamu terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Lalu Al-Azīz berkata kepada Yusuf, \"Wahai Yusuf! Lupakanlah masalah ini! Dan jangan menceritakannya kepada siapapun!\" Dan ia berkata kepada isterinya, \"Mohonlah ampun untuk dosamu! Kamu benar-benar berdosa karena telah merayu Yusuf untuk berbuat mesum denganmu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Kemudian sang suami ingin menutupi kekejian istrinya dengan segala upaya, sehingga dia memerintahkan Yusuf untuk tidak menceritakan kepada orang lain apa yang telah terjadi; dan dia berkata kepada istrinya: “Mohonlah ampun kepada Allah, sungguh kamu termasuk orang-orang yang salah karena perbuatan dan kedustaanmu!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. يُوسُفُ أَعْرِضْ عَنْ هٰذَا ۚ ((Hai) Yusuf: “Berpalinglah dari ini) Yakni dari kejadian ini, dan rahasiakanlah dan jangan kamu menceritakannya. وَاسْتَغْفِرِى لِذَنۢبِكِ ۖ (dan (kamu hai isteriku) mohon ampunlah atas dosamu itu) Yang kamu lakukan. إِنَّكِ كُنتِ (karena kamu sesungguhnya) Disebabkan perbuatan itu. مِنَ الْخَاطِـِٔينَ (termasuk orang-orang yang berbuat salah) Dengan sengaja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Lalu Al-’Aziz melanjutkan ucapannya: “Yusuf menolak perkara ini, menutupi dan tidak mau berbicara tentangnya. Maka memohon ampunlah wahai wanita atas dosa yang kamu lakukan. Sesungguhnya karena itu kalian termasuk orang-orang yang berdosa.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Yusuf berpalinglah dari hal ini} Wahai Yusuf berilah maaf atas perkara ini, diamkanlah itu dan jangan membicarakannya kepada siapapun {dan mohonlah ampunan atas dosamu} dan kamu, wahai istriku, mintalah ampunan atas dosamu yang berasal darimu {sesungguhnya kamu termasuk orang-orang yang bersalah.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. selanjutya, tatkala majikannya telah mengetahui fakta sesungguhnya, maka dia berpesan kepada yusuf ”hai yusuf, berpalinglah dari ini” maksudnya tinggalkanlah pembicaraan tentang ini lagi, berpura puralah tidak mengingatnya, jangan engkau singgung hal ini kepada siapapun, tujuannya untuk menutupi aib keluarganya. ”dan (kamu hai istriku) mohon ampunlah” wahai istriku ”atas dosamu, karena kamu sesungguhnya termasuk orang orang yang berbuat salah”, maka ia memerintahkan yusuf untuk melupakan perkara itu dan (meminta) istrinya untuk memohon ampunan dan bertaubat kepada Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يُوسُفُ أَعۡرِضۡ عَنۡ هَٰذَاۚ) yuusufu a’ridh ‘an hadzaa : wahai Yusuf, berpalinglah dari kejadian ini, lupakanlah agar tidak tersebar. (مِنَ ٱلۡخَاطِ‍ِٔينَ) minal khaati’iin : termasuk orang-orang yang berdosa. Makna ayat : Kemudian berkata kepada Yusuf, (يُوسُفُ أَعۡرِضۡ عَنۡ هَٰذَاۚ) ”Wahai Yusuf, janganlah engkau sebarkan kejadian ini, supaya tidak menyebar lalu membawa masalah. Dan berkata kepada Zulaikha, (وَٱسۡتَغۡفِرِي لِذَنۢبِكِۖ) Mintalah maaf kepada suamimu, agar ia memaafkan dan tidak menghukum dirimu atas kesalahanmu (إِنَّكِ كُنتِ مِنَ ٱلۡخَاطِ‍ِٔينَ ) sungguh engkau termasuk orang-orang yang berdosa. Inilah isi dari empat ayat dari pembahasan kali ini. Pelajaran dari ayat : Dianjurkannya menutupi aib seseorang, dan tidak disukainya menyebarkan kesalahannya ke khalayak ramai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 29: Maksudnya, rahasiakanlah peristiwa ini agar tidak tersebar. Namun kenyataannya malah tersebar seperti yang tersebut dalam ayat selanjutnya, di mana kaum wanita membicarakannya sehingga mencela istri Al ‘Aziz."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 29",
    "description": "Setelah al-aziz mengetahui bahwa istrinya yang bersalah, lalu ia berkata kepada nabi yusuf wahai yusuf ! lupakanlah peristiwa ini, jangan kamu ceritakan kepada orang lain, dan engkau wahai istriku mohonlah ampunan kepada Allah atas dosamu, karena engkau termasuk orang yang bersalah sebab telah menggoda yusuf dan berkata bohong. Setelah peristiwa tersebut, mereka berusaha menutupi kasus itu, namun meskipun ditutup-tutupi, ternyata berita buruk itu tetap tersebar di kalangan istri pejabat istana dan menjadi bahan pembicaraan, sebagaimana diuraikan pada ayat berikut ini. Dan perempuan-perempuan di kota setelah mendengar peristiwa itu, mereka berkata satu sama lain, istri al-aziz telah menggoda dan merayu pelayannya untuk menundukkan dirinya, karena pelayannya benar-benar telah membuat dirinya mabuk cinta hingga lupa diri. Sungguh kami memandang dia, yakni istri al-aziz dalam kesesatan yang nyata, karena mencintai pelayannya."
  }
]