[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami menceritakan kepadamu (wahai rasul), kisah terbaik dengan mewahyukan al-qur’an ini kepadamu, dan kamu sebelum turunnya al-qur’an itu benar-benar termasuk orang yang tidak mengerti berita-berita tersebut, tidak mengetahuinya sama sekali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Kami menceritakan kepadamu -wahai Rasul- kisah-kisah terbaik karena kebenarannya dan keindahan kata-katanya dengan cara menurunkan Al-Qur`ān ini kepadamu. Padahal sebelum turunnya Al-Qur`ān ini engkau termasuk di antara orang-orang yang tidak mengetahui kisah-kisah itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Hai Rasulullah, Kami menyampaikan dan meriwayatkan kepadamu kisah-kisah umat-umat terdahulu dengan kisah yang benar dan penjelasan yang baik melalui al-Qur’an yang diwahyukan kepadamu. Dan sebelumnya kamu sama sekali tidak mengetahui kisah-kisah tersebut. Ini merupakan kesempurnaan kenikmatan, yaitu Allah mengajarkan nabi-Nya sesuatu yang belum dia ketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. نَحْنُ نَقُصُّ عَلَيْكَ أَحْسَنَ الْقَصَصِ (Kami menceritakan kepadamu kisah yang paling baik) Tentang umat-umat terdahulu dan ketetapan-ketetapan Allah bagi hamba-Nya. Dan ini merupakan perkataan paling baik bagi orang lain. وَإِن كُنتَ مِن قَبْلِهِۦ لَمِنَ الْغٰفِلِينَ (dan sesungguhnya kamu sebelum (Kami mewahyukan)nya adalah termasuk orang-orang yang belum mengetahui) Terhadap kisah ini dan kisah lainnya yang diwahyukan Allah kepadamu Surat ini mengandung kisah-kisah terbaik karena mengandung ibrah, pelajaran, dan hikmah yang tidak terdapat pada surat lainnya. Surat ini menyebutkan tentang para nabi, orang-orang shalih, para malaikat, kisah para raja, para budak, para saudagar, para lelaki, serta para perempuan, perhiasannya dan tipu dayanya. Dan karena semua yang disebutkan didalamnya memiliki kesudahan yang bahagia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Wahai Nabi, Kami akan mengisahkan sebaik-baik kisah (berita-berita) tentang umat-umat terdahulu dengan mewahyukan Al-Qur’an yang bisa menentukan hukum ini kepadamu. Dan sesungguhnya sebelum menerima wahyu, kamu belum tahu apapun tentang kisah ini dan kisah lainnya dari kisah-kisah dalam Al-Qur’an. Surah ini dinamakan dengan sebaik-baik kisah, yang mana di dalamnya terdapat pelajaran, kisah-kisah nabi yang shalih, para malaikat, tuan, budak, perdagangan, laki-laki dan perempuan, karena sesungguhnya masing-masing yang disebutkan itu termasuk orang-orang yang berbahagia. Ibnu Abbas berkata: “Mereka berkata: “Waha rasulullah, Maukah kamu bercerita kepada kami?” lalu turunkah ayat {Nahnu Naqushshu ‘alaika ahsanal qashashi} [ayat 3]”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menceritakan kepadamu sebaik-baik cerita dengan mewahyukan Al-Qur’an ini kepadamu. Sesungguhnya kamu sebelum itu termasuk orang-orang yang tidak mengetahui} termasuk orang-orang yang tidak tahu tentang cerita itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3 “kami menceritakan kepadamu kisah yang paling baik” ditinjau dari keontentikannya dan pengungkapannya yang mengalir dengan halus dan keelokan makna maknanya “dengan mewahyukan al qur’an yang kami wahyukan kepadamu\", yakni dengan apa yng terkandung dalam Al-quran yang kami wahyukan kepadamu ini dan Kami telah memuliakan dirimu diatas segenap para nabi. ini merupakan anugerah murni dan limpahan kebaikan dari Allah. ”dan sesungguhnya kamu sebelum (kami mewahyukan)nya adalah termasuk orang orang yang belum mengetahui”engkau tidak tahu apakah al kitab itu, dan apakah hakikat keimanan itu, sebelum Allah mewahyukan (wahyu) kepadamu. Namun kami menjadikannya sebagai lentera cahaya. Dengan itu, kami memberi hidayah kepada orang yang kami kehendaki dari hamba hamba kami. Ketika Dia memuji kandungan kisah yang ada pada alqur’an yang merupakan kisah yang paling baik secara mutlak, dan tidak terdapat satu kisah pun dalam kitab kitab (lain) yang sebanding tingkatannya dengan kisah al qur’an ini, maka Allah mengetengahkan sebuah kisah yang menakjubkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نَحۡنُ نَقُصُّ) nahnu naqushshu : Kami ceritakan kepadamu kisah-kisah sebagaimana kejadiannya yang terjadi dengan sempurna. (بِمَآ أَوۡحَيۡنَآ) bimaa auhainaa : dengan wahyu Kami kepadamu. Kisah itu disampaikan dengan wahyu. (مِن قَبۡلِهِۦ) min qablih : sebelum turunnya (wahyu) kepadamu. (لَمِنَ ٱلۡغَٰفِلِينَ) laminal ghaafiliin : sebelum wahyu Kami kepadamu, engkau termasuk orang yang lalai darinya, tidak mengingatnya dan tidak mengetahuinya. Makna ayat : Firman-Nya (نَحۡنُ نَقُصُّ عَلَيۡكَ) Kami ceritakan kepadamu, Wahai Rasulullah! (أَحۡسَنَ ٱلۡقَصَصِ) kisah yang paling jujur, aktual, bermanfaat dan paling indah (بِمَآ أَوۡحَيۡنَآ إِلَيۡكَ هَٰذَا ٱلۡقُرۡءَانَ) dengan perantara wahyu Kami kepadamu, (وَإِن كُنتَ مِن قَبۡلِهِۦ ) “sesungguhnya kamu sebelum Kami wahyukan kepada mu (لَمِنَ ٱلۡغَٰفِلِينَ ) lalai darinya, tidak mengingatnya. Pelajaran dari ayat : • Al-Qur’an mengandung kisah-kisah terbaik, maka tidak perlu untuk mendengarkan kisah-kisah selainnya. • Penetapan kenabian Rasulullah shalallahu ‘alaihi wa sallam, penetapannya dengan bukti akal yang paling kuat serta dalil yang agung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 3: Ibnu Rahawaih meriwayatkan dengan sanadnya dari Mush’ab bin Sa’ad dari Sa’ad tentang firman Allah, “Nahnu naqushshu ‘alaika…dst.” Ia berkata, “Allah menurunkan Al Qur’an kepada Rasulullah shallallahu 'alaihi wa sallam, maka Beliau membacakannya kepada mereka (para sahabat) sekian lama. Lalu mereka berkata, “Wahai Rasulullah, Andai saja engkau menceritakan kisah kepada kami?” maka Allah menurunkan ayat, “Alif, lam, raa. Tilka aayaatul kitaabil mubiin…sampai nahnu naqushshu ‘alaika ahsanal qashashi…dst.” Maka Rasulullah shallallahu 'alaihi wa sallam membacakannya kepada mereka sekian lama, lalu mereka berkata, “Wahai Rasulullah, andai saja engkau menceritakan kepada kami?” Maka Allah Ta’ala menurunkan ayat, “Allahu nazzala ahsanal hadiitsi kitaabam mutasyaabihan…dst.” (Az Zumar: 23). Syaikh Muqbil berkata, “Hadits ini para perawinya adalah para perawi kitab shahih selain Khallad Ash Shaffar, ia adalah tsiqah, dan saya tidak lanjutkan haditsnya karena tidak bersambung. Hadits ini diriwayatkan oleh Ibnu Hibban dalam shahihnya sebagaimana dalam Az Zawaa’id hal. 432, Ibnu Jarir juz 12 hal. 150, Hakim dalam Al Mustadrak juz 2 hal. 345, ia berkata, “Shahih isnadnya”, dan didiamkan oleh Adz Dzahabi. Yang demikian karena kebenarannya, kehalusan kata-katanya dan keindahan maknanya. Sebelumnya, kamu tidak mengetahui apa kitab dan apa iman?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 3",
    "description": "Allah menurunkan ayat ini dan sesudahnya ketika sekelompok orang yahudi meminta nabi Muhammad menceritakan kisah nabi yusuf dan nabi yakub, lalu turunlah ayat berikut ini. Kami akan menceritakan kepadamu wahai nabi Muhammad suatu kisah umat-umat terdahulu untuk menguatkan hatimu dan menjadi pelajaran bagi umatmu. Kisah ini adalah kisah yang paling baik karena sarat dengan pesan, nasihat, dan pelajaran yang diuraikan dengan susunan bahasa yang indah dan menarik. Kisah itu kami turunkan dengan mewahyukan Al-Qur'an ini kepadamu, dan sesungguhnya engkau sebelum kami mewahyukannya itu termasuk orang yang tidak mengetahui tentang kisah-kisah umat terdahulu. Kisah-kisah para nabi dan orang-orang saleh yang dipaparkan dalam Al-Qur'an adalah menjadi pelajaran bagi umat nabi Muhammad, karena sarat dengan pesan-pesan moral serta nasihat. Setelah dijelaskan bahwa di antara wahyu Al-Qur'an yang diturunkan Allah berupa kisah-kisah umat terdahulu yang belum diketahui secara jelas oleh nabi Muhammad dan umatnya, ayat ini menjelaskan tentang salah satu kisah tersebut, yaitu kisah nabi yusuf. Allah memulai kisah nabi yusuf dengan menceritakan perihal mimpinya. Ketika yusuf putra nabi yakub berkata kepada ayahnya, wahai ayahku! sungguh, aku bermimpi melihat sebelas bintang, yakni saudaranya yang berjumlah sebelas, matahari, yakni ayahnya dan bulan, yakni ibunya; kulihat semuanya sujud atau mengarahkan pandangannya dan hormat kepadaku."
  }
]