[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan berita itu sampai ke wanita-wanita di kota itu, sehingga mereka ramai memperbincangkannya. Dan mereka berkata untuk mengingkari (perbuatan) istri sang mentri, ”sesungguhnya istri sang mentri mencoba menundukan pelayannya dan mengajaknya untuk berbuat keji dengan dirinya. Sesungguhnya ketertarikan kepada pemuda itu telah mencapai puncak kecintaan hatinya. Sesungguhnya kami memandangnya dengan perbuatan tersebut, dalam kesesatan yang nyata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Cerita tentang wanita itu menyebar ke seluruh kota. Dan sejumlah wanita berkomentar dengan nada sinis, \"Isteri Al-Azīz (petinggi kerajaan) merayu budaknya untuk berbuat mesum dengan dirinya. Cintanya benar-benar merasuk ke dalam hatinya. Sungguh kami melihat wanita itu -karena telah merayu dan mencintai budaknya- berada dalam kesesatan yang nyata.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Akan tetapi kejadian ini tersebar luas, sampai terdengar para wanita di kota, sehingga mereka mengingari perbuatan istri Menteri itu: “Istri Menteri masih saja menggoda pembantunya agar mau berbuat keji dengannya, sungguh dia telah tertawan oleh ketampanannya, dan kita sangat percaya dia berada dalam kesalahan yang jelas.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. تُرٰوِدُ فَتَىٰهَا (Isteri Al Aziz menggoda bujangnya) Yakni budak laki-lakinya, ia mengajaknya untuk berbuat keji dengan dirinya. Yakni kejadian itu telah tersebar di penjuru kota. قَدْ شَغَفَهَا حُبًّا (sesungguhnya cintanya kepada bujangnya itu adalah sangat mendalam) Yakni rasa cinta telah sampai di jantungnya sehingga menjadikannya sakit. Makna (شغاف القلب) yakni lapisan penutup jantung."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { امْرَأَتُ الْعَزِيزِ } \"Isteri Al Aziz\" Sebagaimana kita telah nisbatkan lafazh yang sama kepada istri al-Aziz; brmaksud untuk menyebarkan berita ini; karena sebagian besar manusia lebih cendrung dan melebihkan perhatiannya kepada berita-berita tentang orang-orang yang berbuat kesalahan dan ia memilik kedudukan yang tinggi. 2 ). { وَقَالَ نِسْوَةٌ فِي الْمَدِينَةِ امْرَأَتُ الْعَزِيزِ تُرَاوِدُ فَتَاهَا عَنْ نَفْسِهِ } Para wanita-wanita di kota itu mengatakan : \"sesungguhnya istri al-aziz menggoda bujangnya untuk menundukkan dirinya untuknya\" mereka justru tidak mengatakan hal yang sebaliknya, hal seperti ini menenangkan hati orang-orang yang menjunjung tinggi norma agama sedang mereka diberlakukan dengan cara yang buruk agar reputasi mereka hancur, namun waktu berlalu dengan cepat hingga akhirnya kebenaran itu terungkap : { الْآنَ حَصْحَصَ الْحَقُّ أَنَا رَاوَدْتُهُ عَنْ نَفْسِهِ } \"Sekarang jelaslah kebenaran itu, akulah yang menggodanya untuk menundukkan dirinya (kepadaku)\" [ Yusuf : 51 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Kumpulan wanita negeri Mesir berkata ketika berita itu menyebar: “Istri Al-’Aziz menggoda anak laki-laki budaknya dan memintanya untuk berjima’. Sedangkan Yusuf mencegahnya. Sungguh cintanya kepada Yusuf telah menutupi hatinya, atu menjadi penutupnya. Melalui kejadian ini kami berpendapat bahwa dia berada dalam kesalahan yang nyata” Nama istri itu adalah Zulaikha. dan Al-’Aziz adalah julukan bagi Menteri Raja Mesir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berdosa {Para wanita di kota itu berkata,“Istri Al Aziz menggoda pelayannya} pelayannya {untuk menaklukkan dirinya. Pelayannya benar-benar membuatnya jatuh cinta} Kecintaan terhadap pelayannya itu mendalam di lubuk hatinya. Cinta itu telah menutupi dan menyelimutinya dan dia berada dalam cinta itu. Sehingga membuatnya takluk {Kami benar-benar memandangnya dalam kesesatan yang nyata”} kesalahan yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. maksudnya bahwa berita tersebut menjadi popular dan menyebar seantero negeri. Kaum wanita membicarakannya dan mulai mencibir dan mengatakan ”istri al aziz menggoda bujangnya untuk menundukan dirinya (kepadanya), sungguh cintanya itu kepada bujangnya adalah sangat dalam”, maksudnya itu adalah kejadian yang buruk! ia adalah wanita yang sangat berderajat tinggi, suaminyapun orang berkedudukan. Kendatipun demikian, ternyata ia masih menggoda budak lelakinya yang berada di bawah kekuasaan dan bertugas melayaninya. Bersama ini semua, kecintaaan kepadanya (yusuf) sudah menempati hatinya pada kadar yang sangat kuat. ”sungguh cintanya kepada bujangnya itu adalah sangat mendalam” kecintaan sang wanita itu kepada yusuf sudah mencapai relung hatinya, yaitu batin dan jantung hatinya. Itu adalah kecintaan yang paling tinggi ”sesungguhnya kami memandangnya dalam kesesatan yang nyata” dimana kondisi ini tidak layak bersumber darinya. Itu merupakan sebuah kejadian yang akan mendiskreditkan kedudukannya dan menghinakannya di tengah orang orang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فِي ٱلۡمَدِينَةِ) fil madiinah : ibukota Mesir pada masa itu. (تُرَٰوِدُ فَتَىٰهَا) turaawidu fataahaa : budaknya yang dari keturunan Kan’an. (قَدۡ شَغَفَهَا حُبًّاۖ) qad syaghafahaa hubbaa : cintanya sudah merasuk hati, mabuk cinta. (إِنَّا لَنَرَىٰهَا فِي ضَلَٰلٖ مُّبِينٖ) innaa lanaraahaa fii dhalaalim mubiin : kami melihatnya berada dalam kesalahan yang nyata, karena kecintaanya kepada budaknya itu. Makna ayat : Masih berkisah tentang kisah dan peristiwa Yusuf ‘alaihi salam. Setelah keluar putusan dari saksi atas Yusuf bahwa dia tidak bersalah, kabar ini berpindah menuju beberapa wanita-wanita menteri, mereka berkumpul di suatu rumah milik mereka, dan berbincang serta meng-gosipkan istri Al-‘Aziz, karena ia sudah merayu budak keturunan Kan’an miliknya, sebagaimana yang Allah kabarkan pada ayat-ayat berikut. Allah berfirman, : (وَقَالَ نِسۡوَةٞ فِي ٱلۡمَدِينَةِ) Para perempuan dari ibu kota Mesir berkata, (ٱمۡرَأَتُ ٱلۡعَزِيزِ تُرَٰوِدُ فَتَىٰهَا) istri Al-‘Aziz telah menggoda budak miliknya, (عَن نَّفۡسِهِۦۖ قَدۡ شَغَفَهَا حُبًّاۖ) cintanya sudah merasuk ke hati, (إِنَّا لَنَرَىٰهَا) kami mengiranya (فِي ضَلَٰلٖ مُّبِينٖ ) berada di dalam kesalahan yang nyata, karena bagaimana ia bisa mencintai seorang budak sedangkan ia berpangkat dan bermartabat tinggi? Pelajaran dari ayat : • Penjelasan bahwa tabiat manusia suka meneliti dan mencari-cari berita."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 30: Yakni di kota Mesir. Al ‘Aziz sebutan bagi pembesar di Mesir. Istri Al ‘Aziz di sini adalah istri Qithfir. Yakni hal ini perkara yang memalukan, ia adalah wanita yang berkedudukan tinggi, dan suaminya pun berkedudukan tinggi. Namun ia malah merayu pelayannya yang berada di bawahnya dan memberikan dirinya untuk pelayannya. Yakni karena terjadi hal yang tidak patut terjadi ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 30",
    "description": "Setelah peristiwa tersebut, mereka berusaha menutupi kasus itu, namun meskipun ditutup-tutupi, ternyata berita buruk itu tetap tersebar di kalangan istri pejabat istana dan menjadi bahan pembicaraan, sebagaimana diuraikan pada ayat berikut ini. Dan perempuan-perempuan di kota setelah mendengar peristiwa itu, mereka berkata satu sama lain, istri al-aziz telah menggoda dan merayu pelayannya untuk menundukkan dirinya, karena pelayannya benar-benar telah membuat dirinya mabuk cinta hingga lupa diri. Sungguh kami memandang dia, yakni istri al-aziz dalam kesesatan yang nyata, karena mencintai pelayannya. Maka ketika perempuan itu, yaitu istri al-aziz mendengar cercaan mereka sehingga menjadi bahan pembicaraan umum, maka ia pun ingin membuat siasat terhadap perempuan-perempuan yang mencercanya, lalu diundangnyalah perempuan-perempuan itu dalam sebuah jamuan dan disediakannya tempat duduk dan sandaran yang nyaman bagi mereka, dan kepada masing-masing mereka diberikan sebuah pisau untuk memotong hidangan yang disediakan berupa buah-buahan dan lainnya, kemudian dia berkata kepada nabi yusuf, keluarlah dan tampakkanlah dirimu kepada mereka. Ketika perempuan-perempuan itu melihatnya, mereka terpesona kepada ketampanan rupanya, dan mereka yang hadir itu pun tanpa sadar telah melukai tangannya sendiri dengan pisau yang dipegangnya seraya berkata, mahasempurna Allah yang menciptakan makhluk dengan wajah yang sempurna dan rupawan, pemuda ini bukanlah manusia biasa pada umumnya. Tetapi ini benar-benar malaikat yang mulia dan suci, karena baru kali ini kita melihat manusia yang sangat sempurna."
  }
]