[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka ketika istri sang mentri itu mendengar gunjingan mereka terhadap dirinya dan ulah mereka untuk mencelanya, maka dia mengutus seseorang kepada mereka untuk mengundang mereka berkunjung ke rumahnya. Dan dia telah mempersiapkan bagi mereka peralatan untuk mereka bersandar berupa bantal-bantal dan makanan-makanan yang akan mereka santap, dan memberikan kepada setiap-setiap wanita sebilah pisau untuk mereka gunakan memotong makanan. Selanjutnya, dia berkata kepada yusuf, ”keluarlah kehadapan mereka.” Ketika mereka memandangnya, mereka mengagungkannya dan memuliakannya, dan membuat mereka terpesona oleh kebaikan dan ketampanannya, sehingga mereka melukai tangan-tangan mereka sendiri, ketika mereka tengah mengiris-ngiris makanan, lantaran begitu luarbiasanya keadaan yang mencegangkan dan hilangnya kesadaran.Dan mereka berkata dengan penuh takjub, ”maha sempurna Allah. Ini bukanlah dari bangsa manusia, sebab ketampanannya tidak biasa ada pada bangsa manusia. Dia tidak lain adalah satu malaikat yang mulia dari bangsa malaikat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Ketika isteri Al-Azīz mendengar kabar bahwa para wanita itu memberikan komentar sinis tentang dirinya dan menggunjingnya, ia langsung mengutus seseorang untuk mengundang mereka. Ia hendak memperlihatkan Yusuf kepada mereka agar mereka bisa memaklumi keadaannya. Ia menyiapkan tempat untuk mereka dengan permadani dan bantal-bantal. Setiap undangan diberi sebilah pisau untuk memotong makanan. Dan ia berkata kepada Yusuf , \"Keluarlah ke hadapan mereka!\" Maka tatkala wanita-wanita itu melihatnya, mereka terkagum-kagum dan takjub dengan ketampanannya. Mereka semua terpesona oleh ketampanannya. Dan tanpa sadar mereka telah melukai tangan mereka sendiri dengan pisau yang disediakan untuk memotong makanan. Mereka berkata, \"Maha Suci Allah! Pemuda ini bukan manusia biasa. Karena belum pernah ada manusia setampan dia. Dia pasti seorang Malaikat yang mulia.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. namun perkataan para wanita ini sampai di telinga istri Menteri dengan cepat, perkataan mereka mengandung tiga makar; yaitu olokan terhadap perbuatannya, berbicara buruk di belakangnya, dan kerinduan mereka untuk melihat Yusuf yang masih ada di istana Menteri. Karena mereka tidak menolak untuk bertemu Yusuf dan enggan menundukkan pandangan sehingga mereka takjub dengan ketampanannya ketika mereka diundang istri Menteri kerumahnya dengan disiapkan tempat duduk khusus bagi mereka dengan makanan yang terhidang, kemudian mereka masing-masing diberi pisau sebagai balasan atas makar mereka, kemudian istri Menteri itu agar keluar menemui mereka akan mereka mengetahui ketampanan Yusuf. Ketika mereka melihatnya dengan pandangan yang tajam, mereka tercengang dengan ketampanannya yang membuat diri mereka takjub dan hati mereka tertawan, sehingga mereka melukai tangan mereka sendiri dengan pisau yang mereka pegang. Mereka takjub dan tanpa segan berkata: “Maha Sempurna Allah -yakni sungguh menakjubkan penciptaan makhluk ini-, pemuda ini bukanlah seorang manusia karena ketampanannya yang menawan tidak pernah ada pada manusia, dia tidak lain adalah seorang malaikat yang tampan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. فَلَمَّا سَمِعَتْ (Maka tatkala wanita itu (Zulaikha) mendengar) Yakni istri al-aziz. بِمَكْرِهِنَّ (makar (cercaan) mereka) Yakni ghibah yang ditujukan padanya. Terdapat pendapat mengatakan bahwa mereka mengatakan ini karena ingin menjadikannya sebab agar dapat melihat nabi Yusuf, oleh sebab itu perkataan mereka ini disebut dengan makar. Dan akhirnya mereka dapat sampai kepada nabi Yusuf kerena Zulaikha mengundang mereka. أَرْسَلَتْ إِلَيْهِنَّ (diundangnyalah wanita-wanita itu) Zulaikha mengundangnya agar dapat melihat nabi Yusuf sehingga mereka dapat memaklumi kejadian yang terjadi padanya. وَأَعْتَدَتْ لَهُنَّ مُتَّكَـًٔا (dan disediakannya bagi mereka tempat duduk) Yakni Zulaikha mempersiapkan tempat duduk yang dapat mereka gunakan untuk bersandar. وَءَاتَتْ كُلَّ وٰحِدَةٍ مِّنْهُنَّ سِكِّينًا(dan diberikannya kepada masing-masing mereka sebuah pisau) Untuk makanan yang butuh untuk dipotong terlebih dahulu. وَقَالَتِ(kemudian dia berkata) Kepada nabi Yusuf. اخْرُجْ عَلَيْهِنَّ ۖ( Keluarlah (nampakkanlah dirimu) kepada mereka) Dan ini merupakan kelalaian suami Zulaikha yang membiarkan istrinya dan nabi Yusuf di dalam satu rumah setelah terjadi kejadian itu. فَلَمَّا رَأَيْنَهُۥٓ أَكْبَرْنَهُۥ(Maka tatkala wanita-wanita itu melihatnya, mereka kagum kepada (keelokan rupa)nya) Yakni mereka terkagum-kagum oleh ketampanannya sehingga tangan mereka menggigil sehingga mereka melukai tangan mereka sendiri, sedangkan mereka tidak merasakan itu akibat kejutan yang mereka dapatkan yang tidak pernah mereka sangka. وَقُلْنَ حٰشَ لِلّٰهِ (dan berkata: “Maha sempurna Allah) Sebagai penyucian Dzat Allah. مَا هٰذَا بَشَرًا (ini bukanlah manusia) Karena ia memiliki ketampanan yang luar biasa yang tidak pernah ditemui pada diri manusia. إِنْ هٰذَآ إِلَّا مَلَكٌ كَرِيمٌ (Sesungguhnya ini tidak lain adalah malaikat yang mulia) Telah tertaman dalam pikiran bahwa malaikat memiliki rupa yang lebih bagus dari manusia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara faidah dari ayat ini : janganlah sekali-kali mencoba untuk berjalan di jalan buntu yang penuh dengan kesulitan, karena kesabaranmu terkadang bisa saja terputus dan kamu akan pasrah di dalamnya. 2 ). Perhatikan ayat ini yang mengabarkan tentang para wanita di kota itu : { فَلَمَّا رَأَيْنَهُ أَكْبَرْنَهُ وَقَطَّعْنَ أَيْدِيَهُنَّ } \"Maka tatkala wanita-wanita itu melihatnya, mereka kagum kepada (keelokan rupa)nya, dan mereka melukai (jari) tangannya\" dan ucapan raja kepada Yusuf : { فَلَمَّا كَلَّمَهُ قَالَ إِنَّكَ الْيَوْمَ لَدَيْنَا مَكِينٌ أَمِينٌ } \"Maka tatkala raja telah bercakap-cakap dengan dia, dia berkata: “Sesungguhnya kamu (mulai) hari ini menjadi seorang yang berkedudukan tinggi lagi dipercayai pada sisi kam\" , ayat pertama memberikan hikmah bahwa wanita diberi kagum oleh indahnya ketampanan, sedangkan para lelaki mereka diberi kagum oleh indahnya ucapan pujian, dan sesungguhnya semua itu adalah tabi'at yang diciptakan oleh Allah dalam diri hamba-hamba Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Ketika istri Al-‘Aziz mendengar gosip dan bisikan atau kritik mereka (dinamakan tipuan karena mereka tidak bermaksud mendapat keutamaan, namun bermaksud untuk mengeluarkannya sampai Zulaikha terasing dan mereka lebih unggul) dia mengundang mereka ke suatu acara supaya mereka meminta maaf kepadanya dan menempatkan mereka pada posisi yang pernah dia alami. Zulaikha menyediakan untuk mereka bantal-bantal di tempat duduk mereka. Ibnu Abbas berkata: “Al-Mutka’ adalah buah limau, lalu Zulaikha memberi masing-masing mereka pisau untuk memotong makanan, namun ketika mereka melihat Yusuf dan ketampanannya memanjakan mereka, sehingga mereka kacau dan melukai tangan mereka menggunakan pisau karena takjub dengan ketampanannya mereka berkata: “Maha Suci Allah dari sifat lemah, betapa mengagumkannya kuasa Allah dalam menciptakan makhluk seperti Yusuf. Apakah pemuda ini manusia, karena ketampanannya sangat luar biasa tidak ada dalam golongan manusia. Tidak lain ini melainkan raja yang mulia. Biasanya malaikat itu sangat tampan dan indah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika dia mendengar cercaan mereka}gunjingan mereka terhadapnya {dia mengundang mereka} dia mengajak mereka ke rumahnya sebagai tamu {dan menyediakan} menyediakan {bagi mereka tempat duduk} tempat duduk yang terdapat taplak, bantalan dan makanan {Dia memberikan} memberikan {sebuah pisau kepada setiap wanita. Dia berkata,“Keluarlah kepada mereka” Ketika wanita-wanita itu melihatnya, mereka sangat terpesona} mereka terpesona, terkagum-kagum olehnya dan ketampanannya membuat mereka sangat terkejut {dan mereka melukai tangan mereka} mereka melukai tangan mereka dengan pisau-pisau itu, karena terlalu terkejut {mereka berkata,“Mahas empurna Allah} Maha suci Allah {Ini bukanlah manusia} ini bukanlah manusia {Sesungguhnya ini adalah seorang malaikat yang mulia”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Pernyataan tersebut hanyalah bentuk tipudaya wanita wanita itu saja, bukan murni untuk mencerca dan menghinanya. Tetapi mereka menjadikan perkataan tadi sebagai jembatan yang akan mengantarkan mereka guna menyaksikan yusuf yang menjadi penyebab terfitnahnya istri al aziz agar ia menjadi geram dan selanjutnya supaya mau memperhatikan yusuf kepada mereka hingga merekapun memaklumi kondisinya. Oleh karenanya, Allah menyebutnya sebagai makar, Allah berfirman ”maka tatkala wanita itu (zulaikha) mendengar cercaan mereka, dia mengundang mereka\" yakni untuk datang ke kediamannya untuk bertamu \"dan disediakannya bagi mereka tempat duduk” yakni tempat yang telah dipersiapkan dengan bermacam permadani dan bantal bantal serta kelengkapannya berupa macam macam makanan dan minuman yang lezat. Diantara suguhan yang ia sodorkan dan hadirkan dalam jamuan tersebut adalah sebuah makanan yang membutuhkan piasau, baik itu merupakan buah utrujah (jenis buah limau) atau buah lainnya. ”dan diberikannya kepada masing masing mereka sebuah pisau (untuk memotong jamuan)” untuk memotong makanan itu dengannya ”kemudian dia berkata” kepada yusuf ”keluarlah (tampakanlah dirimu) kepada mereka” dalam pesona dan ketampanan dan pancaran keelokannya, ”maka tatkala wanita wanita itu melihatnya, mereka kagum kepada (keelokan) rupanya” maksudnya mereka mengagumi nya di hati mereka dan menyaksikan sebuah panorama yang tidak pernah mereka lihat seindah itu ”dan mereka melukai” lantaran kekaguman mereka ”(jari)tangannya” dengan pisau pisau itu yang mereka bawa “dan berkata ’mahasempurna Allah” sebagai bentuk penyucian kepada Allah “ini bukanlah manusia sesungguhnya ini tidak lain hanyalah malaikat yang mulia” demikian itu, lantaran yusuf dikaruniai ketampanan yang fantastis dan pesona yang menjadi tanda (kebesaran Allah) bagi orang orang yang memperhatikannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَلَمَّا سَمِعَتۡ بِمَكۡرِهِنَّ) falammaa sami’at bimakrihinn : apa yang mereka perbincangkan di belakangnya. (وَأَعۡتَدَتۡ لَهُنَّ مُتَّكَ‍ٔٗا) wa a’atadat lahunna muttaka’aa : menyiapkan untuk mereka kasur dan bantal untuk bersandar. (أَكۡبَرۡنَهُۥ) akbarnahu : jiwa-jiwa mereka menganggapnya agung. Makna ayat : Firman-Nya : (فَلَمَّا سَمِعَتۡ بِمَكۡرِهِنَّ) Ketika ia mendengar perkataan mereka, (أَرۡسَلَتۡ إِلَيۡهِنَّ وَأَعۡتَدَتۡ لَهُنَّ مُتَّكَ‍ٔٗا وَءَاتَتۡ كُلَّ وَٰحِدَةٖ مِّنۡهُنَّ سِكِّينٗا) maka ia membalas makar mereka dengan makar lain. Ia menyiapkan sebuah jamuan makan untuk mereka, ketika mereka mulai memakan buah-buahan dan memotongnya dengan pisau, seperti utruj (sejenis jeruk dengan kulit tebal dan isi yang berbulir kecil) dan selainnya, ia menyuruh Yusuf untuk keluar, agar mereka melihatnya dan mereka pun terkagum melihatnya, sehingga mereka melukai tangan-tangan mereka, bukan mengupas buah-buahan untuk mereka makan, oleh karena itu pula hilang dari hati mereka segala celaan dan keburukan akan Yusuf, sesuai dengan firman-Nya : (وَقَالَتِ ٱخۡرُجۡ عَلَيۡهِنَّۖ فَلَمَّا رَأَيۡنَهُۥٓ أَكۡبَرۡنَهُۥ وَقَطَّعۡنَ أَيۡدِيَهُنَّ وَقُلۡنَ حَٰشَ لِلَّهِ مَا هَٰذَا بَشَرًا) “Ini bukanlah seorang manusia, (إِنۡ هَٰذَآ إِلَّا مَلَكٞ ) melainkan seorang malaikat (كَرِيمٞ) karena ketampanannya dan apa yang Allah berikan berupa keindahan dari segi fisik dan akhlak. Pelajaran dari ayat : • Keinginan manusia untuk membalas dendam karena kehormatannya tercoreng, baik dari segi darah (jiwa), harta, atau kehormatan. • Lemahnya wanita dihadapan lelaki serta ketidak mampuan untuk menahan seperti lelaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 31: Yakni ghibahnya. Yang siap dengan permadani dan bantal, demikian pula makanan yang enak yang di antaranya ada makanan yang butuh dipotong dengan pisau, bisa berupa buah utruj (limau) atau lainnya. Karena keelokan rupa yang dimilikinya tidak seperti laki-laki pada umumnya. Setelah kaum wanita mengakui keelokan Yusuf pada fisiknya, istri Al ‘Aziz menunjukkan keelokan batinnya yang memiliki rasa ‘iffah (suci) secara sempurna dengan mengatakan kata-kata yang disebutkan pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 31",
    "description": "Maka ketika perempuan itu, yaitu istri al-aziz mendengar cercaan mereka sehingga menjadi bahan pembicaraan umum, maka ia pun ingin membuat siasat terhadap perempuan-perempuan yang mencercanya, lalu diundangnyalah perempuan-perempuan itu dalam sebuah jamuan dan disediakannya tempat duduk dan sandaran yang nyaman bagi mereka, dan kepada masing-masing mereka diberikan sebuah pisau untuk memotong hidangan yang disediakan berupa buah-buahan dan lainnya, kemudian dia berkata kepada nabi yusuf, keluarlah dan tampakkanlah dirimu kepada mereka. Ketika perempuan-perempuan itu melihatnya, mereka terpesona kepada ketampanan rupanya, dan mereka yang hadir itu pun tanpa sadar telah melukai tangannya sendiri dengan pisau yang dipegangnya seraya berkata, mahasempurna Allah yang menciptakan makhluk dengan wajah yang sempurna dan rupawan, pemuda ini bukanlah manusia biasa pada umumnya. Tetapi ini benar-benar malaikat yang mulia dan suci, karena baru kali ini kita melihat manusia yang sangat sempurna. Setelah istri al-aziz memperlihatkan nabi yusuf kepada mereka, lalu dia berkata, itulah orangnya yang menyebabkan kamu mencela aku karena aku tertarik kepadanya, dan sungguh benar, aku memang telah menggoda untuk menundukkan dirinya tetapi dia menolak ajakanku dan berlindung kepada tuhan-Nya. Jika dia tidak melakukan apa yang aku perintahkan kepadanya, yaitu melayani keinginanku, niscaya dia akan dipenjarakan, dan dia akan menjadi orang yang hina, karena tidak mendapatkan tempat terhormat dan fasilitas pelayanan yang baik."
  }
]