[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Istri sang mentri itu berkata kepada para wanita yang mengiris-iris tangan mereka sendiri, ”kejadian yang kalian alami saat melihatnya ini, dialah pemuda yang kalian mencelaku lantaran akku tergoda dengannya. Sesungguhnya aku telah memintanya dan berusaha menggodanya agar mau menerima ajakanku, akan tetapi dia menolak dan enggan. Dan bila dia tetap menolak apa yang aku pinta kepadanya di waktu yang akan datang, pastilah dia akan di hukum dengan kurungan penjara, dan dia benar-benar termasuk orang-orang yang hina.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Isteri Al-Azīz berkata kepada para wanita yang diundangnya -setelah mereka mengalami kejadian tersebut-, \"Inilah pemuda yang telah membuat kalian mencaci maki aku karena jatuh cinta kepadanya. Aku memang telah merayunya. Bahkan aku telah berusaha menjebaknya. Tetapi dia menolak. Sungguh, jika di kemudian hari dia tetap tidak mau menuruti permintaanku dia pasti akan dijebloskan ke dalam penjara dan bergabung dengan orang-orang yang hina.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Maka istri Menteri berkata mereka dengan berani karena mereka juga tergoda dengan apa yang telah membuatnya tergoda, dan dia mengancam akan memenjara Yusuf jika dia tidak menuruti permintaannya: “Itulah yang menjadi sebab kalian mengolok-olok aku karena cintaku padanya. Sungguh aku telah menggodanya namun dia menolak, dan sungguh jika dia tidak melakukan apa yang aku perintahkan nanti, niscaya aku pasti akan memenjarakannya sehingga dia menjadi orang yang rendah dan terhina.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قَالَتْ فَذٰلِكُنَّ الَّذِى لُمْتُنَّنِى فِيهِ ۖ (Wanita itu berkata: “Itulah dia orang yang kamu cela aku karena (tertarik) kepadanya) Yakni inilah pemuda yang menjadikanku kalian cemooh sebab cintaku kepadanya. Zulaikha mengatakan hal ini setelah melihat para wanita itu tergoda oleh Yusuf, agar ia mendapat alasan atas perbuatannya. فَاسْتَعْصَمَ ۖ (akan tetapi dia menolak) Yakni lebih memilih untuk menjaga kehormatannya dan menolak ajakanku. Zulaikha mengakui godaan yang ia lakukan kepada Yusuf. لَيُسْجَنَنَّ (niscaya dia akan dipenjarakan) Yakni sungguh aku akan membuat makar yang dapat menjerumuskannya ke penjara. وَلَيَكُونًا مِّنَ الصّٰغِرِينَ (dan dia akan termasuk golongan orang-orang yang hina) Yakni orang-orang rendahan karena mendapat penghinaan dan hilangnya nikmat dari mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah banyak meyandingkan antara keindahan zhohir dan keindahan bathin, diantaranya : ucapan istri al-aziz tentang Yusuf tatkala ia menampakkan Yusuf dihadapan wanita-wanita yang pernah mencibirnya karen kecintaannya kepad Yusuf : { فَذَٰلِكُنَّ الَّذِي لُمْتُنَّنِي فِيهِ } \"Itulah dia orang yang kamu cela aku karena (tertarik) kepadanya\" Zulaikha menampakkan kepada mereka keindahannya yang zhohir, kemudian ia berkata lagi : { وَلَقَدْ رَاوَدْتُهُ عَنْ نَفْسِهِ فَاسْتَعْصَمَ } \"dan sesungguhnya aku telah menggoda dia untuk menundukkan dirinya (kepadaku) akan tetapi dia menolak\" dan dengan inilah ia menampakkan kepada mereka keindahan bathin yang dimilki oleh Yusuf. 2 ). Ketika seorang perempuan terliat pada dirinya satu kebiasaan yang menjadikan akhlaq dan agamanya tercemari, maka sesungguhnya ketika itu ia sedang berusaha menjerat perempuan-perempuan sejenisnya untuk jatuh ke jurang yang sama, perhatikan kisah isrtri al-aziz bersama wanita-wanita di kotanya, setelah mereka mengingkari perbuatan istri al-aziz; akhirnya mereka juga terjerumus ke dalam lubang yang sama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Saat itu juga istri Al-‘Aziz berkata: “Inilah pemuda yang mana kalian mencelaku karena cintaku terhadapnya, lalu aku menggodanya, namun dia menolak dengan tegas. Dan sungguhnya jika dia tidak melakukan apa yang aku perintahkan kepadanya, niscaya dia akan dimasukkan dalam penjara dan termasuk orang-orang rendah yang dihinakan karena mengambil paksa suatu nikmat dan melakukan pertentangan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Itulah orangnya} inilah pemuda {yang menyebabkan kalian mencela aku karena menginginkannya} yang membuat kalian menghinaku karena mencintainya dan berbuat fitnah tentangnya {Sungguh aku benar-benar telah menggoda untuk menaklukkan dirinya, tetapi dia menolak} lalu dia menolak {Jika tidak melakukan apa yang aku perintahkan kepadanya, niscaya dia akan dipenjarakan dan benar-benar akan termasuk orang yang hina.”} orang-orang yang hina dan rendah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Maka tatkala ketampanan yusuf secara fisik sudah terakui oleh mereka, dan benar benar mengagumkan mereka serta telah tampak oleh mereka alasan (pembenaran) bagi istri alaziz, ia ingin memperlihatkan ketampanan batiniyah yusuf berupa iffahnya yang sempurna. Untuk tujuan itu, wanita tersebut pun mengumumkan dan menjelaskan kecintaannya kepada yusuf yang sangat mendalam, tanpa mempedulikan apapun. karena celaan yang terarah kepadanya dari wanita wanita itu sudah berakhir. ”dan sesungguhnya aku telah menggodanya untuk menundukan dirinya (kepadaku) akan tetapi dia menolak” artinya menampik padahal ia (istri al aziz) sangat antusias dalam menggodanya. perjalanan masa demi masa tidak menambahinya kecuali kecintaan, kerinduan, dan kegelisahan untuk dapat berjumpa serta rasa kangennya kepada yusuf. Oleh karenanya, dia berkata di hadapan wanita wanita itu, ”dan sesungguhnya dia tidak menaati apa yang aku perintahkan kepadanya, niscaya dia akan dipenjarakan dan dia akan termasuk golongan orang orang yang hina” dengan ancaman ini, dia ingin memaksa yusuf untuk merealisasikan hasratnya bersama yusuf."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَذَٰلِكُنَّ ٱلَّذِي لُمۡتُنَّنِي فِيهِۖ) fadzaalikunnal ladzii lumtunnanii fiih : kalian berkata, “Bisa-bisanya engkau suka dengan budak keturunan Kan’an?” (فَٱسۡتَعۡصَمَۖ) fasta’sham : menolak, dan terus menjaga harga dan kesucian dirinya. (ٱلصَّٰغِرِينَ ) ash-shaaghiriin : orang-orang rendah dan lemah. Makna ayat : Lalu wanita itu berkata—seperti yang Allah firmankan—( قَالَتۡ فَذَٰلِكُنَّ ٱلَّذِي لُمۡتُنَّنِي فِيهِۖ) “Inilah budak yang kalian ejek aku karena menggodanya (وَلَقَدۡ رَٰوَدتُّهُۥ عَن نَّفۡسِهِۦ فَٱسۡتَعۡصَمَۖ) aku sudah menggodanya habis-habisan, tapi ia enggan menanggapinya, (وَلَئِن لَّمۡ يَفۡعَلۡ مَآ ءَامُرُهُۥ) jika ia enggan melakukan apa yang aku perintahkan, (لَيُسۡجَنَنَّ وَلَيَكُونٗا مِّنَ ٱلصَّٰغِرِينَ ) ia pasti akan dipenjara dan pasti akan menjadi orang-orang yang hina. Seperti inilah ia memperdengarkan ancamannya di hadapan para wanita yang takjub akan Yusuf."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 32",
    "description": "Setelah istri al-aziz memperlihatkan nabi yusuf kepada mereka, lalu dia berkata, itulah orangnya yang menyebabkan kamu mencela aku karena aku tertarik kepadanya, dan sungguh benar, aku memang telah menggoda untuk menundukkan dirinya tetapi dia menolak ajakanku dan berlindung kepada tuhan-Nya. Jika dia tidak melakukan apa yang aku perintahkan kepadanya, yaitu melayani keinginanku, niscaya dia akan dipenjarakan, dan dia akan menjadi orang yang hina, karena tidak mendapatkan tempat terhormat dan fasilitas pelayanan yang baik. Mendengar perkataan istri al-aziz, nabi yusuf berkata seraya memohon kepada Allah, wahai tuhanku! penjara yang gelap lagi sempit lebih aku sukai daripada tinggal di dalam istana hanya untuk memenuhi ajakan mereka memenuhi nafsu birahinya. Jika aku tidak engkau hindarkan dari tipu daya dan rayuan mereka, niscaya aku akan cenderung untuk memenuhi keinginan mereka. Dan jika aku tunduk terhadap kemauan mereka tentu aku termasuk orang yang bodoh karena telah menjerumuskan diri dalam perbuatan yang hina."
  }
]