[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf berkata memohon perlindungan dari keburukan dan tipu daya mereka, ”wahai tuhanku, penjara lebih aku sukai daripada apa yang mereka pinta kepadaku berupa perbuatan zina. Dan bila engkau tidak menghindarkan dariku tipu daya mereka, niscaya aku akan condong kepada mereka dan aku akan termasuk orang-orang bodoh yang melakukan dosa karena kebodohan mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Yusuf -'alaihissalām- berdoa kepada Tuhannya seraya berkata, \"Ya Tuhanku! Aku lebih suka dijebloskan ke dalam penjara seperti ancamannya daripada melayani keinginannya berbuat mesum. Jika Engkau tidak menghindarkan aku dari tipu daya mereka, niscaya aku akan terpikat oleh mereka. Dan jika aku terpikat oleh mereka dan menuruti apa yang mereka inginkan, niscaya aku termasuk ke dalam golongan orang-orang yang bodoh.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Yusuf mengetahui kelanjutan tipu daya dari para wanita yang terpikat hati mereka olehnya akibat pandangan mereka yang tidak terjaga. Maka kemudian Yusuf berpaling dari mereka semua dan bertawakkal kepada Allah dengan berdoa penuh ketundukan dan dengan keimanannya dia menjauhi kekejian serta kebanggaannya telah teguh di atas kehormatan: “Ya Tuhanku, sungguh penjara yang sempit yang diancamkan kepadaku lebih aku sukai daripada menuruti ajakan mereka untuk berbuat keji. Jika Engkau tidak menjauhkanku dari makar mereka, niscaya aku akan condong kepada ajakan mereka, sehingga aku menjadi orang bodoh yang melakukan perbuatan keji.” Dalam doa ini mengandung seruan bagi mereka untuk mengimani keesaan Allah, menghentikan harapan mereka melakukan kekejian, dan penjelasan pentingnya menundukkan pandangan, karena sering melihat sesuatu yang haram dapat menjerumuskan ke dalam hal haram tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. قَالَ (Yusuf berkata) Sambil bermunajat dan berlindung kepada Tuhannya. رَبِّ السِّجْنُ أَحَبُّ إِلَىَّ مِمَّا يَدْعُونَنِىٓ إِلَيْهِ ۖ( Wahai Tuhanku, penjara lebih aku sukai daripada memenuhi ajakan mereka kepadaku) Yakni ajakan mereka untuk berbuat kemaksiatan yang besar yang dapat melenyapkan kebaikan dunia dan akhirat. Yusuf berdoa dengan doa ini kerena para wanita tersebut juga mengajaknya untuk berzina dengannya, dengan dalil perkataan sang raja yang akan disebutkan pada lanjutkan kisah ini (قال ما خطبكن إذ راوتن عن نفسه). وَإِلَّا تَصْرِفْ عَنِّى كَيْدَهُنَّ (Dan jika tidak Engkau hindarkan dari padaku tipu daya mereka) Yakni makar mereka kepadaku berupa godaan untuk mentaati mereka dan ancaman jika menolak mereka. أَصْبُ إِلَيْهِنَّ (tentu aku akan cenderung untuk (memenuhi keinginan mereka)) Yakni aku akan condong kepada mereka. وَأَكُن مِّنَ الْجٰهِلِينَ (dan tentulah aku termasuk orang-orang yang bodoh) Yang berbuat dengan perbuatan orang-orang bodoh."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Barangsiapa yang bertahan dengan penderitaan dan siksaan dalam ketaatan kepada Allah daripada ia menggapai kenikmatan namun dalam keadaan maksiat kepada Allah- sebagamana yang dialami oleh Yusuf dan para Nabi-nabi dan orang-orang shalih lainnya, sesungguhnya balasan bagnya akan diterma di dunia dan di akhirat, penderitaan yang ia alami akan bergant kepada kenikmatan dan kebahagiaan, sebagaimana tuan-tuan yang menjerumuskan kepada dosa kenikmatan mereka berganti menjadi penderitaan dan kesedihan. 2 ). { وَإِلَّا تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُنْ مِنَ الْجَاهِلِينَ } \"Dan jika tidak Engkau hindarkan dari padaku tipu daya mereka, tentu aku akan cenderung untuk (memenuhi keinginan mereka) dan tentulah aku termasuk orang-orang yang bodoh\" karena cenderung kepada mereka adalah satu kebodohan yang besar; karena jika ia mencoba kelezatan yang sedikit itu maka sungguh ia telah mengorbankan kelezatan nikmat yang jauh lebih besar dan lebih mulia di akhirat nanti, maka ketika seseorang berani melakukan hal itu, adakah orang yang lebih bodoh darinya ?! 3 ). Bagaimana kamu menyelamatkan dirimu ketika engkau sedang bersama dengan orang yang lebih terhormat, perhatikan apa yang dikatakan Yusuf tentang perangkap yang ia hadapi dari para wanita-wanita itu : { وَإِلَّا تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُنْ مِنَ الْجَاهِلِينَ } \"Dan jika tidak Engkau hindarkan dari padaku tipu daya mereka, tentu aku akan cenderung untuk (memenuhi keinginan mereka) dan tentulah aku termasuk orang-orang yang bodoh\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Yusuf berdoa memohon kepada Allah SWT: “Wahai Tuhanku, hukuman penjara yang diancamkan oleh wanita ini lebih aku sukai daripada kemaksiatan yang mereka serukan kepadaku. Jika engkau tidak membebaskanku dari tipu daya mereka, maka aku akan condong kepada mereka dan membantu mereka dalam memenuhi keinginan mereka. Dan saat itu juga aku akan termasuk golongan orang-orang bodoh yang terlibat dalam kemungkaran karena sembrono.” Permintaan perlindungan kepada Allah ini ketika musibah dan fitnah semakin besar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Yusuf berkata,“Wahai Tuhanku, penjara lebih aku sukai daripada memenuhi ajakan mereka. Jika Engkau tidak menghindarkan tipu daya mereka dariku, niscaya aku akan cenderung kepada mereka} condong kepada mereka {dan aku termasuk orang-orang yang bodoh.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. pada saat itulah, yusuf berlindung diri kepada Rabbnya dan memohon pertolongan kepadaNya dari bahaya makar mereka. ”yusuf berkata ’wahai Rabbku, penjara lebih aku sukai daripada memenuhi ajakan mereka kepadaku” ini menunjukan bahwa para wanita itu menyarankan yusuf untuk patuh terhadap tuan putrinya, dan mengupayakan untuk memperdaya yusuf dalam maslah ini. Yusuf ternyata lebih menyukai masuk penjara dan siksaan duniawi ketimbang kenikmatan sesaat yang akan mendatangkan siksaan pedih. ”dan jika engkau tidak hindarkan diriku dari tipu daya mereka, tentu aku akan cederung untuk (memenuhi keinginan mereka)” maka ku akan condong kepada mereka. Karena aku orang yang lemah, tak berdaya, bila Engkau tidak melenyapkan (godaan) keburukan ini dariku, niscaya aku akan murtad (cenderung) berlari kepada mereka “dan tentulah aku termasuk orang orang yang bodoh”. sesungguhnya tindakan ini merupakan kebodohan. Sebab ia lebih mengutaakan kenikmatan secuil yang akan menyusahkan diri pada kenikmatan yang kontinyu dan kesenangan yang beraneka macam di surge yang penuh kenikmatan. Orang yang memilih ini daripada itu, apakah ada orang yang lebih bodoh daripadanya?(tentu tidak). Sesungguhnya ilmu dan akal pikiran (yang sehat) akan mengajak kepada pengutamaan maslahat dan kenikmatan yang terbesar, serta lebih mengedepankan perkara yang kesudahannya terpuji."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَصۡبُ إِلَيۡهِنَّ) ashbu ilahihinn : aku condong kepada mereka. (وَأَكُن مِّنَ ٱلۡجَٰهِلِينَ) wa akum minal jaahiliin : menjadi orang-orang berdosa, karena tidak lah seseorang melakukan maksiat kecuali orang itu bodoh akan kekuasaan Allah dan pengawasan-Nya. Makna ayat : Setelah itu Yusuf pun bersegera lari kepada Rabbnya agar bisa terlepas dari jerat makar wanita itu berdoa—sebagimana yang Allah kabarkan—( قَالَ رَبِّ ٱلسِّجۡنُ أَحَبُّ إِلَيَّ مِمَّا يَدۡعُونَنِيٓ إِلَيۡهِۖ) Wahai Rabbku—dengan perkataan ini permohonannya kepada Rabbnya terhitung sebagai doa—( ٱلسِّجۡنُ أَحَبُّ إِلَيَّ مِمَّا يَدۡعُونَنِيٓ إِلَيۡهِۖ) penjara lebih aku sukai dari apa yang mereka ajak aku kepadanya berupa dosa (وَإِلَّا تَصۡرِفۡ عَنِّي كَيۡدَهُنَّ) jika Engkau tidak menjauhkan aku dari tipu daya para wanita itu (أَصۡبُ إِلَيۡهِنَّ) dan aku condong kepada mereka (وَأَكُن) aku akan menjadi—karena perbuatanku ini—( مِّنَ ٱلۡجَٰهِلِينَ ) orang-orang yang berdosa karena bermaksiat kepada Mu. Pelajaran dari ayat : • Lebih sukanya Yusuf ‘alaihi salam untuk masuk penjara daripada bermaksiat kepada Allah. Ini adalah bukti dari kejujuran imannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 33: Disebutkan dalam riwayat, bahwa kaum wanita itu menyuruh Yusuf menaati majikannya. Kemudian Yusuf mengucapkan kata-kata seperti yang disebutkan dalam ayat di atas. Nabi Yusuf 'alaihis salam lebih mengutamakan dipenjara dan menerima penderitaan duniawi daripada kesenangan sesaat yang menghendaki untuk menerima azab yang berat. Karena sesungguhnya aku lemah. Ya, termasuk kebodohan adalah jika seseorang lebih mengutamakan kesenangan sesaat (dengan berbuat maksiat dan tidak bersabar) daripada kesenangan yang kekal selama-lamanya (dengan berbuat taat dan bersabar)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 33",
    "description": "Mendengar perkataan istri al-aziz, nabi yusuf berkata seraya memohon kepada Allah, wahai tuhanku! penjara yang gelap lagi sempit lebih aku sukai daripada tinggal di dalam istana hanya untuk memenuhi ajakan mereka memenuhi nafsu birahinya. Jika aku tidak engkau hindarkan dari tipu daya dan rayuan mereka, niscaya aku akan cenderung untuk memenuhi keinginan mereka. Dan jika aku tunduk terhadap kemauan mereka tentu aku termasuk orang yang bodoh karena telah menjerumuskan diri dalam perbuatan yang hina. Maka tuhan memperkenankan doa nabi yusuf, dan dia menghindarkan nabi yusuf dari tipu daya mereka, yakni istri al-aziz dan teman-temannya. Dialah yang maha mendengar permohonan orang-orang yang berdoa, lagi maha mengetahui seluruh perbuatan dan niat hamba-Nya."
  }
]