[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Allah mengabulkan permohonan yusuf, lalu memalingkan darinya apa yang diinginkan oleh istri sang mentri dan kawan-kawan wanitanya untuk bermaksiat kepada Allah. Sesungguhnya Allah mahamendengar doa yusuf dan doa setiap orang yang memanjatkan doa dari makhlukNYa, maha mengetahui keinginan, kebutuhan dan apa saja yang memperbaiki keadaannya, dan kebutuhan seluruh mahklukNya dan apa saja yang memperbaiki keadaan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Kemudian Allah mengabulkan doa Yusuf dan menghindarkannya dari tipu daya isteri Al-Azīz dan wanita-wanita lain yang ada di kota itu. Sesungguhnya Allah -Subḥānahu wa Ta'ālā- Maha Mendengar doa yang dipanjatkan oleh Yusuf dan do'a-do'a selainnya, lagi Maha Mengetahui keadaan Yusuf dan orang-orang lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Maka Allah mengabulkan doanya, Dia menyelamatkan Yusuf dari tipu daya mereka dan meneguhkannya di atas kehormatan. Dia Maha Mendengar setiap doa dan perkataan, dan Maha Melihat segala nafsu dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. فَاسْتَجَابَ لَهُۥ رَبُّهُۥ (Maka Tuhannya memperkenankan doa Yusuf) Allah menyantuni Yusuf dan melindunginya agar tidak terjerumus dari kemaksiatan, sebab jika Allah telah melindunginya dari makar mereka maka tuduhan yang mereka ucapkan tidak akan membahayakannya. إِنَّهُۥ هُوَ السَّمِيعُ (Sesungguhnya Dialah Yang Maha Mendengar) Maha mendengar doa dari orang-orang yang berdoa kepada-Nya. الْعَلِيمُ (lagi Maha Mengetahui) Maha Mengetahui keadaan orang-orang yang berlindung kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Lalu Allah mengabulkan doanya, melembutkannya, menjaganya dari kemaksiatan, dan menghilangkan tipu muslihat mereka. Sesungguhnya Allah SWT itu Maha mendengar doa dan Maha mengetahui keadaan orang yang meminta perlindungan kepadaNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Tuhannya memperkenankan dia dan menghindarkannya dari tipu daya mereka. Sesungguhnya Dialah yang Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 “maka Rabbnya memperkenankan doa yusuf” saat memanjatkan doa kepadaNya “dan dia menghindarkan yusuf dari tipu daya mereka” wanita itu masih saja antusias untuk menggoda yusuf dan menempuh segala cara yang mampu ia usahakan, sampai yusuf membuatnya putus asa dan Allah memalingkan tipu daya mereka dari yusuf “sesungguhnya Dialah yang Maha mendengar” doa orang yang berdoa “lagi maha mengetahui” niatnya yang baik dan niatnya yang lemah yang menuntut adanya tambahan pertolongan dan perhatiannNYa. ini adalah bentuk pertolongan Allah kepada yusuf dari fitnah yang menjerat dan ujian yang berat ini."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Inilah yang tidak aku inginkan, darinya pula aku lari (فَٱسۡتَجَابَ لَهُۥ رَبُّهُۥ) Maka Allah kabulkan permintaannya dan menjauhkannya dari makar mereka. Sungguh Dia ta’la Maha Mendengar perkataan para hamba-Nya dan doa hamba-Nya Yusuf ‘alaihi salam, Maha Mengetahui perbuatan hamba-hamba-Nya diantara mereka Yusuf. Oleh karenanya Dia mengabulkan doanya, maka Dia menenangkan dirinya dan menghilangkan penderitaan darinya, yaitu penderitaan karena khawatir akan dirinya. Hanya bagi-Nya lah seluruh pujian dan pemberian. Pelajaran dari ayat : • Ketidaktahuan akan Allah, nama-nama, sifat-sifat, janji, ancaman, dan syariat-Nya adalah sebab munculnya segala kejahatan di muka bumi ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 34: Mereka senantiasa membujuknya dan menggunakan berbagai cara agar Yusuf mau memenuhi keinginan mereka, sampai mereka berputus asa; tidak berhasil membujuknya. Allah menghindarkan tipu daya mereka. Demikianlah Allah menyelamatkan Beliau dari fitnah dan ujian yang berat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 34",
    "description": "Maka tuhan memperkenankan doa nabi yusuf, dan dia menghindarkan nabi yusuf dari tipu daya mereka, yakni istri al-aziz dan teman-temannya. Dialah yang maha mendengar permohonan orang-orang yang berdoa, lagi maha mengetahui seluruh perbuatan dan niat hamba-Nya. Kemudian timbul pikiran pada mereka, yakni al-aziz dan para penasehatnya setelah melihat tanda-tanda kebenaran nabi yusuf bahwa mereka harus memenjarakannya demi menjaga kehormatan keluarganya, serta menghindari cemoohan masyarakat sampai waktu tertentu."
  }
]