[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian muncul pikiran pada sang mentri dan rekan-rekannya, setelah menyaksikan bukti-bukti tentang terbebas dan terjaganya ke hormatan yusuf, untuk memenjarakannya hingga waktu yang lama atau pendek, demi menutup terbongkarnya skandal(aib) tresebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Kemudian setelah Al-Azīz dan kaumnya menyaksikan bukti-bukti yang menunjukkan bahwa Yusuf tidak bersalah maka mereka memutuskan untuk menahan Yusuf di dalam penjara sampai batas waktu yang tidak ditentukan agar aib mereka tidak terbongkar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Ketika Menteri itu merasa aib keluarganya telah tersebar dan ketidakbersalahan Yusuf telah nampak, dia dan orang-orang disekitarnya memasukkan Yusuf ke dalam penjara hingga aibnya terlupakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. ثُمَّ بَدَا لَهُم (Kemudian timbul pikiran pada mereka) Yakni timbul kejelasan dari makar mereka yang ditimpakan kepada Yusuf. مِّنۢ بَعْدِ مَا رَأَوُا۟ الْاٰيٰتِ (setelah melihat tanda-tanda (kebenaran Yusuf)) Yakni tanda-tanda yang menunjukkan ketidakbersalahan Yusuf. Tanda-tanda tersebut adalah baju gamis Yusuf, kesaksian dari seorang saksi, dan para wanita yang memotong tangan mereka. Namun tanda-tanda ini tidak memberi manfaat bagi mereka, bahkan istri dari al-aziz tetap teguh dalam pendiriannya dan menuruti hawa nafsunya serta tetap berniat melakukan ancaman yang ia berikan. Dan bisa jadi rencana untuk memenjarakan Yusuf adalah usul dari mereka semua karena ingin menutupi aib dan gossip yang menyebar di masyarakat. لَيَسْجُنُنَّهُۥ حَتَّىٰ حِينٍ(bahwa mereka harus memenjarakannya sampai sesuatu waktu) Yakni sampai waktu yang tidak ditentukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Lalu muncullah pada pikiran Al-Aziz dan para penasehatnya ketika melihat tanda yang menunjukkan ketidak bersalahan Yusuf, agar memenjarakannya sampai waktu yang tidak ditentukan sampai omongan orang-orang berhenti"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian muncul pada mereka} timbul pada manteri dan pengikutnya {setelah melihat tanda-tanda} tanda-tanda yang menunjukkan kepada ketidak bersalahan Yusuf dan kebersihannya {mereka benar-benar memenjarakannya sampai waktu tertentu} sampai waktu yang tidak diketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. adapun para tuannya ketika berita itu sudah tersebar dan semakin jelas sementara orang orang pun berbeda beda menanggapinya, ada yang memberikan toleransi, mencela dan mencaci maki “kemudian timbul pikiran kepada mereka” maksudnya muncul (sebuah gagasan) pada mereka \"setelah melihat tanda tanda (kebenaran yusuf)” yang menunjukan kesuciannya “bahwa mereka harus memenjarakannya sampai suatu saat nanti” agar berita itu berhenti dan orang orangpun melupakannya . Sesungguhnya suatu perkara bila telah berkembang, akan selalu dibicarakan dan di sebarluaskan, bersama dengan adanya faktor faktor yang mendukung nya. Jika faktor faktor ini dihilangkan, niscaya suatu berita akan terlupakan. Merekapun memandang tindakan ini baik bagi kemaslahatan mereka. Maka, merekapun mejebloskannya kedalam penjara."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ثُمَّ بَدَا لَهُم) tsumma badaa lahum : tampak bagi mereka. (ٱلۡأٓيَٰتِ) al-aayaat : tanda-tanda kebenaran Yusuf. Makna ayat : Setelah tampak bukti-bukti kebenaran Yusuf atas tuduhan istri Al-‘Aziz, Allah ta’ala berfirman : (ثُمَّ بَدَا لَهُم مِّنۢ بَعۡدِ مَا رَأَوُاْ ٱلۡأٓيَٰتِ لَيَسۡجُنُنَّهُۥ حَتَّىٰ حِينٖ) Kemudian setelah Al-‘Aziz dan orang-orangnya melihat bukti yang jelas akan bersihnya Yusuf dari tuduhan seperti: robeknya baju dari belakang, seorang bayi yang berbicara serta hukumnya terhadap kejadian itu (إِن كَانَ قَمِيصُهُۥ) “jika bajunya...” dan sebagainya. Itu adalah bukti yang sangat cukup membuktikan Yusuf tidak bersalah, namun mereka melihat memenjarakannya untuk beberapa waktu agar jiwa menjadi tenang kembali serta melupakan insiden tersebut serta telah dilupakan orang-orang. Pelajaran dari ayat : • Masuknya Yusuf ke dalam penjara adalah awal dari kisah-kisah yang awalnya menyakitkan namun berbuah manis. • Masuk penjara tidak selalu menunjukkan bahwa penjara adalah tempat orang-orang jahat dan menyimpang. Karena orang pilihan Allah subhanahu wa ta’ala Yusuf pernah masuk ke dalam penjara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 35: Setelah mereka melihat kebenaran Yusuf, mereka memenjarakannya agar orang-orang tidak lagi membicarakan hal ini dan melupakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 35",
    "description": "Kemudian timbul pikiran pada mereka, yakni al-aziz dan para penasehatnya setelah melihat tanda-tanda kebenaran nabi yusuf bahwa mereka harus memenjarakannya demi menjaga kehormatan keluarganya, serta menghindari cemoohan masyarakat sampai waktu tertentu. Setelah dijelaskan bahwa Allah memperkenankan permohonan nabi yusuf untuk tinggal di penjara sebagai jalan terbaik, lalu ayat berikut ini menceritakan tentang dua pelayan istana yang masuk penjara. Dan bersama dia masuk pula dua orang pemuda, yaitu pelayan raja ke dalam penjara. Salah satunya berkata kepada nabi yusuf perihal mimpinya, sesungguhnya aku bermimpi memeras anggur untuk dibuat minuman raja, dan pelayan yang lainnya berkata, aku bermimpi, membawa roti di atas kepalaku, lalu sebagiannya dimakan burung. Berikanlah kepada kami takwilnya mimpi kami berdua. Sesungguhnya kami memandangmu termasuk orang yang berbuat baik, taat beribadah, berakhlak mulia, dan selalu menjaga kehormatan."
  }
]