[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bersama yusuf, ada dua orang pemuda yang masuk penjara. yang pertama berkata, Sesungguhnya aku melihat dalam mimpi bahwa aku memeras anggur untuk dibuat minuman keras.” Dan yang lain berkata, ”Sesungguhnya aku melihat diriku mengangkat roti di atas kepalaku yang dimakan oleh burung. Beritahukanlah kepada kami (wahai yusuf), tafsir mimpi yang kami lihat, sesungguhnya kami melihat kamu termasuk orang-oran yang melakukan hal terbaik dalam beribadah kepada Allah dan berinteraksi dengan sesama makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Maka merekapun menjebloskan Yusuf ke dalam penjara. Dan bersama Yusuf ada dua orang pemuda yang juga masuk ke dalam penjara itu. Salah satu dari mereka berkata kepada Yusuf, \"Aku bermimpi memeras anggur untuk dibuat menjadi khamr.\" Dan yang satu lagi berkata, \"Aku bermimpi membawa roti di atas kepalaku. Lalu burung-burung memakan roti itu. Ceritakanlah -wahai Yusuf- kepada kami apa takwil dari mimpi kami itu. Sesungguhnya kami melihatmu termasuk orang yang suka berbuat baik.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Namun Yusuf tetap teguh di atas kehormatannya dan menantang orang-orang yang suka berbuat keji, sehingga dia rela dengan hukum yang zalim dalam penjara orang yang zalim, dan Allah menyiapkan baginya orang yang dapat dia seru menuju keimanan kepada Allah. Dia masuk ke dalam penjara dengan dua anak muda, setelah dia berbuat baik kepada mereka berdua dan menjadikan mereka mendapat ketenangan di sisinya, maka mereka mulai bertanya kepadanya tentang maksud dari mimpi mereka. Salah seorang di antara mereka berkata: “Aku melihat dalam mimpiku bahwa aku memeras buah anggur untuk aku jadikan khamr”. Sedangkan pemuda yang lain berkata: “Aku melihat dalam mimpi bahwa aku membawa roti di atas kepalaku, kemudian roti itu dimakan burung. Hai Yusuf, Katakanlah kepada kami tafsir dari mimpi kami, sungguh kami menganggapmu sebagai orang yang baik dalam perkataan dan perbuatannya serta dapat menafsirkan mimpi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَدَخَلَ مَعَهُ السِّجْنَ فَتَيَانِ ۖ (Dan bersama dengan dia masuk pula ke dalam penjara dua orang pemuda) Yakni akhirnya mereka memenjarakan Yusuf dan dipenjarakan pula dua budak yang dituduh melakukan sebuah kejahatan. Terdapat pendapat mengatakan bahwa salah satu dari budak itu adalah tukang pembuat roti bagi sang raja, dan yang satu lagi adalah tukang memberi minumnya. Ibnu Jarir berkata: keduanya bertanya kepada Yusuf tentang pengetahuannya. Maka Yusuf berkata “aku dapat mentakwilkan mimpi”. Lalu mereka bertanya tentang mimpi mereka sebagaimana yang dikisahkan oleh Allah. قَالَ أَحَدُهُمَآ إِنِّىٓ أَرَىٰنِىٓ أَعْصِرُ خَمْرًا ۖ( Berkatalah salah seorang diantara keduanya: “Sesungguhnya aku bermimpi, bahwa aku memeras anggur”) Yakni aku melihat diriku dalam mimpi membuat sari buah anggur untuk aku gunakan sebagai khamr. نَبِّئْنَا بِتَأْوِيلِهِۦٓ (Berikanlah kepada kami ta’birnya) Yakni takwil dari mimpi yang telah kami ceritakan kepadamu. إِنَّا نَرَىٰكَ مِنَ الْمُحْسِنِينَ (sesungguhnya kami memandang kamu termasuk orang-orang yang pandai) Yakni termasuk orang-orang yang pandai dalam mentakwil mimpi. Atau termasuk orang-orang baik diantara para penghuni penjara ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { نَبِّئْنَا بِتَأْوِيلِهِ } \"Berikanlah kepada kami ta'birnya\" penghuni penjara datang kepadanya untuk meminta penjelasan arti dari mimpinya, padahal mereka tidak mengetahui bahwa dia sebanarnya orang yang berilmu, dan mereka juga tidak mengetahui bahwa Yusuf sebelumnya telah menta'birkan mimpi-mimpi, mereka dari dari kalangan kafir dan raja yang kafir, bahka kota itu dipenuhi oleh orang-orang kafir; namun semua itu atas kehendak Allah, dan orang yang baik-baik akan nampak kebaikannya dari wajahnya, orang-orang mencintainya dan tertarik kepadanya, penghuni penjara mengatakan kepadanya : { إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ } \"sesungguhnya kami memandang kamu termasuk orang-orang yang pandai\" , ketahuilah bahwasanya perangaimu, adabmu, dan perilakumu terhadap orang lain adalah dalil bahwa kamu adalah orang yag baik dan berbuat baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Dan dimasukkan bersama Yusuf dua anak lain yang dimiliki raja ke dalam penjara, yaitu pembawa minuman dan pembawa roti, lalu keduanya melihat bahwa Yusuf bisa menafsirkan mimpi. Lalu keduanya mencoba mengujinya. Salah satu dari mereka berkata, yaitu si pembawa minuman: “Sesungguhnya dalam mimpi aku melihat diriku memeras anggur untuk membuat khamr” lalu yang lainnya berkata: “Sesungguhnya dalam mimpi aku melihat diriku membawa roti yang dimakan burung.” “Beritahulah kami tentang tafsir mimpi kami. Sesungguhnya kami melihatmu sebagai orang yang baik dalam menafsirkan mimpi dan bermuamalah dengan manusia wahai Yusuf, ”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia masuk ke dalam penjara bersama dua orang pemuda} dua pemuda {Salah satunya berkata,“Sesungguhnya aku bermimpi memeras anggur”} Aku memeras anggur sehingga menjadi khamr {dan yang lain berkata,“Aku bermimpi membawa roti di atas kepalaku. Sebagiannya dimakan burung. Jelaskanlah kepada kami takwilnya} uraiannya {Sesungguhnya kami memandangmu termasuk orang-orang yang berbuat baik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36 “dan“ tatkala yusuf, masuk penjara, maka diantara orang “yang bersama dengannya, masuk pula kedalam penjara dua orang pemuda”, keduanya masih remaja. masing masing bermimpi lalu menceritakannya kepada yusuf agar dia menakwilkan maknanya. ”berkatalah salah seorang daiantara keduanya ’sesungguhnya aku bermimpi, bahwa aku memeras anggur’ dan yang lainnya berkata, sesungguhnya aku bermimpi, bahwa aku membawa roti diatas kepalaku” dan roti itu “sebagiannya di makan burung. berikanlah kepada kami tabirnya” yakni penjelasannya dan kondisi kesudahan mereka berdua nantinya. perkataan mereka berdua; sesungguhnya kami memandang kamu tersmasuk orang orang yang pandai (mena’birkan mimpi)” maksudnya kamu termasuk orang orang yang berbuat baik kepada orang lain. Maka berbuat baik kepada orang lain. Maka berbuat baiklah kepada kami dalam menakwilkannya sebagaimana engkau telah berbuat baik kepada selain kami. mereka berdua melakukan pendekatan kepada yusuf melalui penyebutan kebaikannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَعۡصِرُ خَمۡرٗاۖ) a’shiru khamra : memeras anggur untuk membuat khamr. Makna ayat : Firman-Nya : (وَدَخَلَ مَعَهُ ٱلسِّجۡنَ فَتَيَانِۖ) yaitu: akhirnya mereka menetapkan untuk memenjarakan Yusuf, dan masuk pula dua pemuda—dahulu mereka adalah pelayan raja—karena tuduhan yang diarahkan kepada mereka. Firman-Nya : (قَالَ أَحَدُهُمَآ إِنِّيٓ أَرَىٰنِيٓ أَعۡصِرُ خَمۡرٗاۖ وَقَالَ ٱلۡأٓخَرُ إِنِّيٓ أَرَىٰنِيٓ أَحۡمِلُ فَوۡقَ رَأۡسِي خُبۡزٗا تَأۡكُلُ ٱلطَّيۡرُ مِنۡهُۖ نَبِّئۡنَا بِتَأۡوِيلِهِۦٓۖ إِنَّا نَرَىٰكَ مِنَ ٱلۡمُحۡسِنِينَ) “Salah seorang dari mereka berdua berkata, ‘Aku melihat diriku (dalam mimpi) memeras khamr, dan berkata yang lain, ‘Aku melihat dirku (di dalam mimpi) membawa roti di kepalaku, kemudian seekor burung memakan sebagiannya, kabarkanlah kepada kami penjelasannya. Kami melihatmu termasuk orang-orang yang baik.” Permintaan ini muncul setelah mereka takjub dengan akhlak dan muamalahnya yang begitu indah. Mereka bertanya tentang keahliannya, dijawab: menafsirkan mimpi, lalu mereka berkata, “Ayo kita coba berkata kalau kita melihat mimpi ini dan itu.” Pelajaran dari ayat : • Penjelasan terhadap mimpi tergantung kebersihan hati dan kuatnya firasat, dan Yusuf memiliki ilmu laduni khusus (yang Allah ajarkan)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 36: Menurut riwayat dua orang pemuda itu adalah pelayan-pelayan raja; seorang pelayan yang memberi minuman raja, sedangkan yang seorang lagi memberinya makan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 36",
    "description": "Setelah dijelaskan bahwa Allah memperkenankan permohonan nabi yusuf untuk tinggal di penjara sebagai jalan terbaik, lalu ayat berikut ini menceritakan tentang dua pelayan istana yang masuk penjara. Dan bersama dia masuk pula dua orang pemuda, yaitu pelayan raja ke dalam penjara. Salah satunya berkata kepada nabi yusuf perihal mimpinya, sesungguhnya aku bermimpi memeras anggur untuk dibuat minuman raja, dan pelayan yang lainnya berkata, aku bermimpi, membawa roti di atas kepalaku, lalu sebagiannya dimakan burung. Berikanlah kepada kami takwilnya mimpi kami berdua. Sesungguhnya kami memandangmu termasuk orang yang berbuat baik, taat beribadah, berakhlak mulia, dan selalu menjaga kehormatan. Dia'nabi yusuf'berkata kepada dua pemuda itu, dengan izin Allah, jenis makanan apa pun yang akan diberikan kepadamu berdua darinya kecuali aku telah dapat menerangkan takwilnya, sebelum makanan itu sampai kepadamu. Itu sebagian dari ilmu pengetahuan yang diajarkan tuhan kepadaku melalui wahyu, termasuk ilmu takwil mimpi, bukan melalui peramal atau ahli nujum. Karunia ini aku dapatkan karena sesungguhnya aku beriman kepada Allah, ikhlas beribadah kepada-Nya, dan telah meninggalkan agama orang-orang yang tidak beriman kepada Allah sebagaimana agama yang dianut oleh raja mesir dan rakyatnya, bahkan mereka tidak percaya kepada hari akhirat dan hari pembalasan."
  }
]