[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf berkata kepada mereka berdua, ”tidaklah ada makanan yang datang kepada kalian yang diberikan kepada kalian sebagia rizki kalian dalam keadaan apapun kecuali aku akan memberitahukan kepada kalian tafsir mimpinya sebelum makanan itu tiba kepada kalian. Tafsir yang akan aku ungkapakn nanti kepada kalian berasal dari apa yang diajarkan tuhanku padaku. Sesungguhnya aku beriman kepadaNya dan aku ikhlaskan ibadah bagiNya, dan aku jauhi agama kaum yang tidak beriman kepada Allah, sedang mereka ingkar terhadap hari kebangkitan dan pembalasan amal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Yusuf -'alaihissalām- berkata, \"Setiap ada makanan yang diberikan kepada kalian berdua, baik dari raja atau lainnya aku pasti bisa menjelaskan kepada kalian berdua bagaimana sejatinya makanan itu sebelum diberikan kepada kalian berdua. Takwil yang kuketahui itu adalah bagian dari ilmu yang diajarkan oleh Tuhanku kepadaku, bukan bagian dari ilmu perdukunan atau ramalan. Sesungguhnya aku telah meninggalkan agama orang-orang yang tidak beriman kepada Allah dan yang mengingkari adanya kehidupan Akhirat, kendati mereka sebenarnya mengakuinya di dalam hati mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Maka Yusuf memberitahu mereka ilmunya yang menakjubkan: “Tidaklah datang kepada kalian makanan yang lezat melainkan aku dapat mengatakan kepada kalian apa jenis dan nama dari makanan itu sebelum makanan itu sampai kepada kalian. Perkataan benar yang akan aku katakan kepada kalian ini adalah bagian dari apa yang diajarkan Tuhanku kepadaku. Sungguh aku beriman kepada Allah dan aku tinggalkan agama kaumku yang tidak beriman kepada Allah dan hari kebangkitan, sungguh mereka mendustakan hal itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. قَالَ لَا يَأْتِيكُمَا طَعَامٌ تُرْزَقَانِهِۦٓ إِلَّا نَبَّأْتُكُمَا بِتَأْوِيلِهِۦ قَبْلَ أَن يَأْتِيَكُمَا ۚ (Yusuf berkata: “Tidak disampaikan kepada kamu berdua makanan yang akan diberikan kepadamu melainkan aku telah dapat menerangkan jenis makanan itu, sebelum makanan itu sampai kepadamu) Yakni tidak ada makanan yang diantar ke penjara kecuali aku akan mengabarkan kepada mereka berdua jenis makanan itu sebelum makanan itu sampai kepada mereka. Sebagai mana perkataan nabi Isa (وأنبئكم بما تأكلون) “dan aku akan mengabarkan kalian apa yang kalian makan). Nabi Yusuf mengatakan ini kepada mereka agar mereka dapat mendengar perkataannya yang akan ia sampaikan kemudian, berupa keimanan kepada Allah dan keluar dari kekafiran. Maka (ترزقانه) yakni makanan yang diberikan kepada mereka oleh sang raja atau lainnya. إِلَّا نَبَّأْتُكُمَا بِتَأْوِيلِهِۦ (melainkan aku telah dapat menerangkannya) Yakni aku dapat menerangkan bagi kalian jenis makanan itu dan bagaimana makanan itu akan sampai kepada kalian. ذٰلِكُمَا(Yang demikian itu) Yakni takwil itu. مِمَّا عَلَّمَنِى رَبِّىٓ ۚ( adalah sebagian dari apa yang diajarkan kepadaku oleh Tuhanku) Yang diwahyukan kepadaku, dan bukan merupakan perdukunan atau ramalan. إِنِّى تَرَكْتُ مِلَّةَ قَوْمٍ لَّا يُؤْمِنُونَ بِاللهِ (esungguhnya aku telah meninggalkan agama orang-orang yang tidak beriman kepada Allah) Yaitu agama raja Mesir dan lainnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Yusuf berkata kepada dua lelaki yang di dalam penjara itu : { إِنِّي تَرَكْتُ مِلَّةَ قَوْمٍ لَا يُؤْمِنُونَ بِاللَّهِ وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ } \"Sesungguhnya aku telah meninggalkan agama orang-orang yang tidak beriman kepada Allah, sedang mereka ingkar kepada hari kemudian\" Yusuf tidak mencela agama mereka dihadapannya; karena tempat ia berada bukan untuk menyerang lawan bahkan bukan untuk menimbulkan keributan, melainkan tempat dan kesempatan untuk ia menyampaikan dakwahnya, dan kebenaran jika ingin disampaikan bukan menjadi hal yang darurat untuk disampaikan dengan celaan yang bathil untuk merangkul lawan bicara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Yusuf bekata: “Kalian tahu, bahwa kalian tidak akan mendapat makanan dari raja ke dalam penjara ini, kecuali aku memberitahu kalian tentang inti dan jenis makanan itu sebelum dihidangkan kesini. Penafsiran dan informasi tentang sesuatu yang ghaib itu termasuk hal yang diajarkan oleh Tuhanku kepadaku melalui wahyu dan ilham, bukan ilmu perdukunan maupun perbintangan. Sesungguhnya aku telah meninggalkan agama kaum yang ingkar kepada Allah dan hari kiamat, yaitu kepercayaan raja Mesir dan orang selain dia.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yusuf berkata,“Tidak ada yang akan datang kepada kalian berdua} tidak ada yang datang kepada kalian berdua {suatu makanan yang diberikan kecuali aku telah menjelaskan takwilnya, sebelum itu sampai kepada kalian} sampai kepada kalian {Itu sebagian dari yang diajarkan Tuhan kepadaku. Sesungguhnya aku telah meninggalkan agama kaum yang tidak beriman kepada Allah, bahkan kepada akhirat, mereka itu ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. maka “yusuf berkata” kepada mereka berdua untuk menyambut permintaan mereka. ”tidaklah disampaikan kepada kamu berdua makanan yang akan diberikan kepadamu, melainkan aku telah dapat menerangkan jenis makanan itu, sebelum makanan itu sampai kepadamu” maksudnya, hendaknya hati kalian berdua tenang tenang saja. Sesungguhnya aku akan bersegera menakwilkan mimpi kalian berdua. Makan siang atau makan malam kalian berdua tidaklah akan datang kepada kalian pada permulaan waktunya melainkan aku telah menceritakan ta’birnya sebelum makanan itu sampai kepada kalian. Boleh jadi yusuf bermaksud mendakwahi mereka agar beriman dalam kondisi ini yang mana mereka betul betul tampak membutuhkannya (keimanan). tujuannya, agar lebih manjur dan diterima dakwahnya. Kemudia dia berkata ”yang demikian itu” penakwilan mimpi yang akan aku lakukan untuk kalian berdua “adalah dari sebagian dari apa yang diajarkan kepadaku oleh Rabbku” maksudnya ini termasuk ilmu Allah yang Dia ajarkan kepadaku dan mencurahkan kebaikanNya kepadaku dengan bentuk itu. Hal itu lantaran “sesungguhnya aku telah meninggalkan agama orang orang yang tidak beriman kepada Allah, sedang mereka ingkar kepada hari kemudian” makna kata (meninggalkan) sebagaimana berlaku bagi orang yang pernah memasuki sesuatu kemudian berpindah darinya, maka juga berlaku bagi orang yang memang tidak pernah memasukinya sama sekali. Jadi, tidak bisa dikatakan bahwa yusuf sebelumnya memeluk agama selain millah (agama) nabi Ibrahim."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Kemudian mereka bertanya maka Yusuf menjawab dengan apa yang Allah kabarkan pada ayat-ayat berikut. (قَالَ لَا يَأۡتِيكُمَا طَعَامٞ تُرۡزَقَانِهِۦٓ إِلَّا نَبَّأۡتُكُمَا بِتَأۡوِيلِهِۦ قَبۡلَ أَن يَأۡتِيَكُمَاۚ) “Tidaklah datang rezeki makanan ini kepada kalian, kecuali sudah aku kabarkan takwil dari mimpi itu—bahkan sebelum mimpi itu datang kepada kalian. Lafaz ayat ini mencakup di dalamnya kemungkinan apa yang terjadi kepada mereka berdua dalam mimpi ataupun dalam alam nyata. Itu adalah hal yang diajarkan oleh Allah kepada Yusuf untuk dikabarkan kepada mereka berdua sebelum hal itu terjadi - dalam alam nyata- ataupun sebelum hal itu ditafsirkan—dari mimpi mereka. Kemudian Yusuf menjelaskan sumber ilmu yang ia miliki, berkata : (إِنِّي تَرَكۡتُ مِلَّةَ قَوۡمٖ لَّا يُؤۡمِنُونَ بِٱللَّهِ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ذَٰلِكُمَا مِمَّا عَلَّمَنِي رَبِّيٓۚ) “Demikianlah yang Rabbku ajarkan kepada ku, aku meninggalkan agama kaum yang mereka kafir kepada Allah dan ingkar akan hari akhir.” Yaitu orang-orang Kan’an dan Mesir pada saat itu adalah para musyrikin, mereka menyembah matahari dan selainnya. Pelajaran dari ayat : • Wajib berlepas diri dari kesyirikan dan pelakunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 37: Kata-kata ini untuk mendorong mereka berdua beriman, Beliau awali dengan kata-kata sebelumnya adalah agar mereka lebih dapat menerima ajakan Beliau untuk beriman kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 37",
    "description": "Dia'nabi yusuf'berkata kepada dua pemuda itu, dengan izin Allah, jenis makanan apa pun yang akan diberikan kepadamu berdua darinya kecuali aku telah dapat menerangkan takwilnya, sebelum makanan itu sampai kepadamu. Itu sebagian dari ilmu pengetahuan yang diajarkan tuhan kepadaku melalui wahyu, termasuk ilmu takwil mimpi, bukan melalui peramal atau ahli nujum. Karunia ini aku dapatkan karena sesungguhnya aku beriman kepada Allah, ikhlas beribadah kepada-Nya, dan telah meninggalkan agama orang-orang yang tidak beriman kepada Allah sebagaimana agama yang dianut oleh raja mesir dan rakyatnya, bahkan mereka tidak percaya kepada hari akhirat dan hari pembalasan. Dan aku mengikuti agama nenek moyangku, yaitu nabi ibrahim, nabi ishak, dan nabi yakub. Aku hanya menyembah tuhan yang maha esa dan memurnikan agama untuk-Nya. Tidak pantas bagi kami para nabi mempersekutukan sesuatu apa pun dengan Allah. Memurnikan agama tauhid lagi lurus itu adalah bagian dari karunia yang diberikan Allah kepada kami dan kepada seluruh umat manusia; tetapi kebanyakan manusia tidak bersyukur terhadap karunia dan nikmat dari-Nya."
  }
]