[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan aku mengikuti agama nenek moyangku; Ibrahim, Ishaq , Dan Ya’qub. Aku menyembah Allah semata. Tidak sepantasnya bagi kami untuk menjadikan sekutu bagi Allah dalam peribadahan kepadaNya. Keyakiann betauhid dengan mengesakan Allah dalam ibadah, merupakan sebagian karunia yang Allah anugerahkan kepada kami dan kepada manusia. Akan tetapi, kebanyakan manusia tidak bersyukur kepada Allah atas kenikmatan bertauhid dan iman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan aku mengikuti agama leluhurku, Ibrahim, Isḥāq dan Ya'qūb, yaitu agama Tauhid. Kita tidak boleh menyekutukan Allah dengan yang lain. Dia lah satu-satunya Tuhan Yang Maha Esa. Ajaran tauhid dan iman yang kuyakini dan diyakini oleh leluhurku itu adalah anugerah yang Allah berikan kepada kami. Dan itu adalah bagian dari anugerah yang Allah berikan kepada seluruh umat manusia ketika Dia mengutus para Nabi kepada mereka membawa ajaran tauhid ini. Akan tetapi kebanyakan manusia tidak bersyukur kepada Allah atas anugerah-anugerah yang diberikan-Nya. Mereka justru mengingkarinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Ketika dia akan menjawab tentang tafsir mimpi, dia menyelipkan nasehat agung tentang keimanan sebagai dakwah kepada dua pemuda tersebut, Yusuf menceritakan kisah keimanan yang dia lalui: “Dan aku mengikuti agama ayah-ayahku, yaitu Ibrahim, Ishaq, dan Ya’qub. Kami tidak berhak menyekutukan Allah dengan menyembah selian-Nya, baik itu berupa berhala atau lainnya. Keimanan yang agung ini adalah karunia dari Allah kepada kami semua dan kepada seluruh manusia ketika Dia memuliakan kami dengan petunjuk dan memberi taufik kepada kami untuk beristiqamah karena ia mengantarkan kepada kehidupan yang bahagia di dunia dan surga di akhirat; akan tetapi kebanyakan manusia tidak bersyukur kepada Allah dengan perkataan dan perbuatan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَاتَّبَعْتُ مِلَّةَ ءَابَآءِىٓ إِبْرٰهِيمَ وَإِسْحٰقَ وَيَعْقُوبَ ۚ (Dan aku pengikut agama bapak-bapakku yaitu Ibrahim, Ishak dan Ya’qub) Yusuf menyebut mereka dengan sebutan bapak-bapaknya karena para kakek merupakan para bapak. Ia mengatakan ini agar menarik kedua temannya dipenjara itu untuk beriman kepada Allah. مَا كَانَ لَنَآ أَن نُّشْرِكَ بِالله(Tiadalah patut bagi kami (para Nabi) mempersekutukan sesuatu apapun dengan Allah) Yakni hal itu tidak layak bagiku dan bapak-bapakku. ذٰلِكَ (Yang demikian itu) Yakni keimanan dan tauhid itu. مِن فَضْلِ اللهِ عَلَيْنَا (adalah dari karunia Allah kepada kami) Yakni merupakan bentuk kasih sayang Allah kepada kami dengan memberikan kepada kami kenabian yang dapat menjauhkan kami dari kemaksiatan. وَعَلَى النَّاسِ (dan kepada manusia) Dan merupakan karunia bagi manusia seluruhnya dengan pengutusan para nabi kepada mereka dan hidayah yang diberikan kepada mereka menuju Tuhan serta penjelasan jalan-jalan kebenaran bagi mereka. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ(tetapi kebanyakan manusia tidak mensyukuri) Tidak mensyukuri Allah atas segala kenikmatan-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَاتَّبَعْتُ مِلَّةَ آبَائِي إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ } \"Dan aku pengikut agama bapak-bapakku yaitu Ibrahim, Ishak dan Ya'qub\" Yusuf menggunakan ungkapan seperti ini untuk mempersiapkan dakwahnya, dan menjelaskan bahwa dirinya berasa dari keluarga para nabi, agar keyakinan kedua penghuni penjara itu semakin kuat dalam menyimak penyampaian Yusuf, dan agar keduanya percaya kepadanya. 2 ). Yusuf mengatakan bahwa dia dan semua bapak-bapaknya tidak pernah menyekutukan Allah dengan siapapun selainnya, baik itu kepada kuburan dan siapa yang ada di dalamnya, ataupun kepada berhala buatan manusia, dan perhatikan firman Allah tentang nabi-Nya Yusuf bin Ya'kub : { وَاتَّبَعْتُ مِلَّةَ آبَائِي إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ ۚ مَا كَانَ لَنَا أَنْ نُشْرِكَ بِاللَّهِ مِنْ شَيْءٍ } pada ayat ini ada lafazh { مِنْ شَيْءٍ } yang datang dengan konteks nakiroh yang bermakna umum mencakup segala jenis kesyirikan. 3 ). Qothadah memberi komentar atas perkataan Yusuf -'alahissalam- { ذَٰلِكَ مِنْ فَضْلِ اللَّهِ عَلَيْنَا وَعَلَى النَّاسِ } beliau berkata : hendaknya setiap mukmin bersyukur atas nikmat yang Allah berikan kepadanya, dan bersyukur atas nikmat yang Allah berikan kepada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Aku mengikuti agama leluhurku, yaitu kakek-kakekku, Ibrahim Ishaq dan Ya’kub (Mereka disebut Abaa’ untuk menjadikannya sebagai saudara dalam beriman kepada Allah) Tidak benar bagi kami untuk menyekutukan Allah dalam beribadah, atau sekutu itu berupa berhala atau malaikat. Tauhid dan keimanan itu merupakan anugerah dan kemuliaan Allah yang dilimpahkan kepada Kami, dan seluruh manusia dengan sempurna, namun kebanyakan manusia tidak bersyukur kepada Allah atas anugerah dan nikmatNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku mengikuti agama nenek moyangku, Ibrahim, Ishaq, dan Ya‘qub. Tidak pantas} tidak pantas {bagi kami menyekutukan sesuatu apa pun dengan Allah. Itu adalah bagian dari karunia Allah kepada kami dan manusia, tetapi kebanyakan manusia tidak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38 “dan aku mengikuti agama bapak bapakku yaitu Ibrahim, ishak, dan ya’qub” kemudian dia menerangkan apa yang dimaksud dengan millah (agama) tadi dengan ucapannya ”tiadalah patut bagi kami (para nabi)” artinya tidak sepatutnya dan tidak pantas bagi kami ”mempersekutukan sesuatu apapun dengan Allah” bahkan kami hanya mengesakan Allah dengan tauhid dan memurnikan agama dan ibadah bagiNya. ”yang demikian itu adalah dari karunia Allah kepada kami dan kepada manusia (seluruhnya)” ini termasuk anugerah, curahan kebaikan dan keutamaan paling tinggi kepada kami dan kepada orang orang yang Allah berikan hidayah kepada mereka, sebagaimana Dia telah memberikan hidayah kepada kami. Sesungguhnya, tidak ada karunia yang lebih baik daripada karunia Allah kepada para hambaNya dengan islam dan agama yang lurus. barangsiapa menerima dan mematuhinya. maka itulah bagian keberuntungannya. Sungguh dia telah meraup kebaikan yang terbesar dan keutamaan yang paling mulia. “tetapi kebanyakan manusia itu tidak mensyukuri(Nya)” oleh karenanya (ketika) karunia dan curaha kebaikan (Allah) datang kepada mereka, maka mereka tidak menerimanya, tidak melaksanakan hak Allah dengan sebaik baiknya. Dalam ayat ini, terkandung ajakan (dari yusuf) menuju jalan yang dia pegang teguh, sebagaimana terlihat jelas. Sesungguhnya dua pemuda itu, ketika menurut yusuf mereka berdua memandang dirinya dengan penuh penghormatan dan pengagungan. dan mereka mengetahui ia adalah seorang berbuat baiklagi mendidik, maka yusuf menjelaskan ”bahwa kemampuan yang aku miliki berasal dari keutamaan dan curahan kebaikan dari Allah. Dia telah memberikan kepadaku anugerah untuk meninggalkan kesyirikan dan hanya mengikuti agama moyangku saja. Dengan itulah aku mampu mencapai tingkat yang kalian saksikan. Seyogyanya kalian berdua pun mengikuti apa yang aku peluk. ”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَٱتَّبَعۡتُ مِلَّةَ) wattaba’tu millah : aku mengikuti agama. (مَا كَانَ لَنَآ) maa kaana lanaa : tidak pantas dan tidak baik bagi kami. (أَن نُّشۡرِكَ بِٱللَّهِ مِن شَيۡءٖۚ) an nusyrika billah min syai’ : kami menyekutukan Allah, sekalipun sedikit, tidak pula menjadikan sekutu baginya baik banyak atau sedikit. (ذَٰلِكَ مِن فَضۡلِ ٱللَّهِ عَلَيۡنَا) dzaalika min fadhlillahi ‘alainaa : karunia berupa tauhid dan agama yang benar. (وَعَلَى ٱلنَّاسِ) wa ‘alannaas : ketika datang kepada manusia para Rasul, namun mereka tidak mensyukuri nikmat tersebut dan enggan beriman. Makna ayat : “Aku meninggalkan agama kufur ini dan aku mengikuti agama iman kepada Allah dan hari akhir.” (مِلَّةَ ءَابَآءِيٓ إِبۡرَٰهِيمَ وَإِسۡحَٰقَ وَيَعۡقُوبَۚ) yaitu agama nenek moyang ku: Ibrahim, Ishaq, dan Ya’qub. Kemudian berlanjut dengan mendakwahi mereka berdua kepada iman kepada Allah dan Islam, ia berkata : (مَا كَانَ لَنَآ) “Tidak pantas bagi kami,” (أَن نُّشۡرِكَ بِٱللَّهِ مِن شَيۡءٖۚ) menyekutukannya dengan sesuatu apa pun, kami beriman kepada-Nya dan menyembah kepada selain-Nya juga. Kemudian menjelaskan bahwa ini semua bukan karena kemampuan dan kepintaran mereka, tapi semata-mata karena bantuan dari Allah ta’ala, firman-Nya : (ذَٰلِكَ مِن فَضۡلِ ٱللَّهِ عَلَيۡنَا وَعَلَى ٱلنَّاسِ) Allah yang telah menciptakan mereka, memberi rizki, menjaga, dan menyeru mereka kepada petunjuk dan menjelaskannya untuk mereka (وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَشۡكُرُونَ) namu mereka tidak beriman dan tidak beribadah hanya kepada-Nya. Pelajaran dari ayat : • Pengunaan kata, “الآباء” (bentuk jamak dari ayah) untuk menyebutkan nenek moyang, karena setiap dari mereka ayah untuk yang setelahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 38: Setelah ini, Beliau menyebutkan ajaran agama nenek moyang Beliau. Yakni mentauhidkan-Nya atau memeluk agama Islam. Hal ini menunjukkan bahwa beragama Islam merupakan nikmat yang paling besar yang diberikan kepada manusia. Malah menyekutukan-Nya dengan sesuatu atau tidak masuk Islam. Kemudian Yusuf ‘alaihis salam dengan tegas mengajak mereka berdua beriman kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 38",
    "description": "Dan aku mengikuti agama nenek moyangku, yaitu nabi ibrahim, nabi ishak, dan nabi yakub. Aku hanya menyembah tuhan yang maha esa dan memurnikan agama untuk-Nya. Tidak pantas bagi kami para nabi mempersekutukan sesuatu apa pun dengan Allah. Memurnikan agama tauhid lagi lurus itu adalah bagian dari karunia yang diberikan Allah kepada kami dan kepada seluruh umat manusia; tetapi kebanyakan manusia tidak bersyukur terhadap karunia dan nikmat dari-Nya. Setelah nabi yusuf menjelaskan tentang agama tauhid yang dianutnya, pada ayat berikut ini nabi yusuf mengajak kepada dua orang pemuda yang ada dalam penjara bersamanya untuk mengikuti agama tauhid seraya bertanya, wahai kedua penghuni penjara! manakah yang baik, tuhan-tuhan yang bermacam-macam itu yang berhak disembah ataukah tuhan Allah yang maha esa, lagi mahaperkasa' dialah Allah tuhan yang maha menciptakan, dan maha memberi rezeki. Karena itu, hanya dia-lah yang berhak disembah."
  }
]