[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf berkata kepada dua pemuda yang bersamanya di dalam penjara, ”apakah penyembahan tuhan-tuhan yang berupa makhluk yang bermacam-macam lebih baik daripada peribadahan kepada Allah yang maha Esa lagi mahaperkasa?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Kemudian Yusuf bertanya kepada kedua pemuda yang ada dipenjara itu, \"Apakah beribadah kepada beberapa tuhan itu lebih baik ataukah beribadah kepada Allah Yang Maha Esa, yang tiada sekutu bagi-Nya, yang bisa memaksakan kehendak-Nya kepada lainnya, dan tidak bisa dipaksa oleh siapapun?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Kemudian dia menarik perhatian dua penanya itu kepada ketauhidan kepada Allah: “Hai dua temanku dalam penjara, apakah lebih baik menyembah tuhan-tuhan yang diciptakan yang tidak dapat mengabulkan orang yang berdoa kepadanya, atau menyembah Allah yang Maha Esa dan Maha Perkasa, yang segala sesuatu tunduk kepada keperkasaan dan kekuasaan-Nya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. يٰصَىٰحِبَىِ السِّجْنِ ءَأَرْبَابٌ مُّتَفَرِّقُونَ خَيْرٌ أَمِ اللهُ الْوٰحِدُ الْقَهَّارُ (Hai kedua penghuni penjara, manakah yang baik, tuhan-tuhan yang bermacam-macam itu ataukah Allah Yang Maha Esa lagi Maha Perkasa?) Dengan perkataannya ini, Yusuf menyeru agar beriman kepada Allah dan mentauhidkan-Nya. Yakni hai dua temanku di penjara, apakah tuhan-tuhan yang banyak dan memiliki sifat yang berbeda-beda itu lebih baik bagi kalian, atau Allah yang lebih baik, sebagai Tuhan yang benar, yang esa dalam Dzat dan sifat-Nya yang tidak memiliki sekutu, yang tidak terkalahkan dan tidak ada yang dapat memaksan-Nya? Tedapat pendapat mengatakan ketika Yusuf mengatakan hal ini, mereka berdua memiliki patung-patung di depan mereka, yang mereka sembah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "39-40 1 ). { إِنِ الْحُكْمُ إِلَّا لِلَّهِ ۚ أَمَرَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ } Perhatikan isyarat dari pembatasan pada lafazh \"إِلَّا لِلَّهِ\" dan \"إِلَّا إِيَّاهُ\" dalam ayat ini, dan penafsiran keputusan yang ada bahwa itu merupakan ibadah, dan bagimana Yusuf menyebutkan agama yang ia bawakan adalah lurus; agar difahami kemungkaran besar, dan kejahatan besar apa yang dilakukan oleh siapa yang tidak mengamil keputusan dari apa yang diturunkan oleh Allah. 2 ). Jika seseorang melihat kepada kehidupannya yang lalu; maka ia akan mendapatinya penuh dengan rasa sakit sebagaimana yang juga terjadi pada Yusuf; sungguh bumi ini akan sempit dengan rasa sakit yang ia terima itu, namun Yusuf as-shiddiq hanya berdiam diri di balik dinding penjara menggantungkan harapannya kepada sang pencipta, memohon kepada kepada Allah agar orang-orang yang pernah menyakitinya mendapat ampunan. Begitulah kemurahan orang mulia di kalangan manusia, mereka tidak akan kehilangan agama sekalipun mereka kehilangan dunia, dan mereka sekali-kali tidak akan menjadi lemah sebesar apapun musibah yang menimpa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Wahai sahabatku dalam penjara, apakah tuhan-tuhan yang banyak jumlahnya itu dzat dan sifatnya lebih baik untuk disembah, sedangkan mereka tidak memberi mahdharat dan manfaat ataukah Allah yang Maha Esa sebagai Tuhan yang disembah dengan benar, berkuasa atas segala sesuatu dan memiliki kekuasaan yang luar bisa?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai dua penghuni penjara, apakah tuhan-tuhan yang bermacam-macam itu} apakah menyembah tuhan yang banyak itu {lebih baik ataukah Allah Yang Maha Esa lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39 selanjutnya ia mendakwahi mereka dengan terang terangan. Ia berkata ”hai kedua penghuni penjara, manakah yang baik, tuhan tuhan yang bermacam macam itu ataukah Allah yang Maha Esa lagi Mahaperkasa” maksudnya, apakah tuhan tuhan yang lemah tidak berdaya, tidak dapat mencurahkan manfaat dan menimpakan bahya, tidak sanggup memberi dan tidak mampu menahan, bentuknya bermacam macam, ada yang berbentuk pepohonan, bebatuan, malaikat, orang orang yang telah mati dan sesembahan lainnya yang didaulat oleh kaum musyrikin, apakah itu semua lebih baik ataukah Allah yang mempunyai sifat sifat kesempurnaan,\"Maha Esa\" dalam Dzat dan sifat sifatNya serta perbuatan perbuatanNya? Allah tidak ada sekutu bagiNya dalam hal hal itu sedikitpun. \"Al qahar\" (mahaperkasa) yang segala sesuatu tunduk patuh kepada keperkasaan dan kekuasaanNYa. Apapun yang diinginkannNya, maka langsung terwujud. Dan apa saja yang tidak Allah kehendaki, maka tidak akan terjadi. Tidak ada satu binatang melatapun melainkan Allah mampu memegangi ubun ubunnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "(يَٰصَٰحِبَيِ ٱلسِّجۡنِ) yaa shaahibayis sijn : wahai dua temanku di penjara. Mereka adalah dua pelayan makanan dan pelayan minuman raja. (ءَأَرۡبَابٞ مُّتَفَرِّقُونَ) a’arbaabum mutafrriquun : tuhan-tuhan yang bermacam-macam—baik fisik, sifat, dan lokasi. Makna ayat : Ayat-ayat ini menjelaskan tentang keadaan Yusuf di penjara. Sebelumnya dua orang penghuni penjara itu meminta tafsir mimpi mereka karena mereka mengetahui bahwa Yusuf mampu mentakwil mimpi, namun Yusuf memanfaatkan momen ini untuk menjelaskan sumber ilmu miliknya, yaitu meninggalkan agama kafir lalu beriman kepada Allah ta’ala serta mengikuti agama nenek moyangnya, Ibrahim, Ishaq, dan Ya’qub. Serta tidak pantas bagi mereka untuk berbuat syirik kepada Allah, maka Allah berfirman : (يَٰصَٰحِبَيِ ٱلسِّجۡنِ ءَأَرۡبَابٞ مُّتَفَرِّقُونَ خَيۡرٌ أَمِ ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ) lalu Yusuf berkata kepada dua pemuda itu, “Wahai dua penghuni penjara, kabarkanlah kepada ku, (ءَأَرۡبَابٞ) apakah tuhan-tuhan (مُّتَفَرِّقُونَ) yang terpencar-pencar, satu di sana, satu di sini, ini berhala, ini bintang, yang ini berbentuk manusia, yang ini hewan, ada yang berwarna ini, ada yang berwarna itu (خَيۡرٌ أَمِ ٱللَّهُ ٱلۡوَٰحِدُ) apakah mereka lebih baik dari Allah Yang Maha Esa, baik dari dzat-Nya dan sifat-Nya (ٱلۡقَهَّارُ) Maha Berkuasa atas segala sesuatu, seluruh makhluknya. Lalu mereka tidak punya jawaban lagi selain (ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ) (tentu) Allah Yang Maha Esa dan Maha Perkasa. Karena akal yang sehat pasti memilih ini. Pelajaran dari ayat : • Harus memanfaatkan momen-momen yang penting untuk berdakwah. • Penetapan aqidah tauhid dengan kisah-kisah orang terdahulu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 39: Ada yang berupa batu, pohon, binatang, malaikat, orang mati, dan lainnya. Yang memiliki sifat sempurna. Baik Dzat-Nya, sifat-Nya, maupun perbuatan-Nya, dan tidak ada sekutu dalam hal itu. Di mana segala sesuatu tunduk kepada kekuasaan-Nya, oleh karena itu apa yang Dia kehendaki pasti terjadi dan apa yang Dia tidak kehendaki, maka tidak akan terjadi. Sudah pasti, bahwa yang keadaaan dan sifatnya seperti ini lebih baik daripada tuhan-tuhan yang bermacam-macam itu, yang hanya sebatas nama atau dinamai tuhan, namun tidak ada apa-apanya atau tidak memiliki sifat ketuhanan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 39",
    "description": "Setelah nabi yusuf menjelaskan tentang agama tauhid yang dianutnya, pada ayat berikut ini nabi yusuf mengajak kepada dua orang pemuda yang ada dalam penjara bersamanya untuk mengikuti agama tauhid seraya bertanya, wahai kedua penghuni penjara! manakah yang baik, tuhan-tuhan yang bermacam-macam itu yang berhak disembah ataukah tuhan Allah yang maha esa, lagi mahaperkasa' dialah Allah tuhan yang maha menciptakan, dan maha memberi rezeki. Karena itu, hanya dia-lah yang berhak disembah. Apa yang kamu sembah selain dia dan kamu percayai sebagai tuhan, hanyalah nama-nama yang kamu buat-buat lalu dianggap baik oleh kamu sendiri maupun oleh nenek moyangmu, padahal ia hanyalah benda mati yang tidak bisa memberi manfaat maupun mendatangkan mudarat. Allah tidak menurunkan suatu keterangan pun baik berupa dalil yang pasti maupun bukti yang kuat tentang suatu hal mengenai nama atau status benda yang kamu jadikan sesembahan itu. Keputusan yang adil tentang akidah, ibadah, dan ketentuan dalam muamalah yang benar itu hanyalah milik Allah, karena dialah pencipta segalanya sehingga mengetahui segala sesuatu tentang ciptaan-Nya. Dia telah memerintahkan agar kamu dengan tulus ikhlas tidak menyembah selain dia, karena Allah adalah pencipta, pemberi rezeki, yang menghidupkan dan mematikan. Itulah agama yang lurus lagi benar yang dijelaskan dalam kitab suci dan disampaikan para rasul-Nya, tetapi kebanyakan manusia tidak mengetahui hakikat kebenaran itu disebabkan oleh sifat sombong mereka yang selalu mengikuti hawa nafsunya."
  }
]