[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebutkanlah (wahai rasul), kepada kaummu perkataan yusuf kepada ayahnya, ”sesungguhnya aku bermimpi melihat dalam tidurku sebelas bintang, matahari dan bulan, aku melihat mereka semua itu bersujud kepadaku.” mimpi ini menjadi pembuka kabar gembira atas martabat yang dicapai oleh yusuf berupa kedudukan yang tinggi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kami menceritakan kepadamu -wahai Rasul- tatkala Yusuf berkata kepada ayahnya Ya'qūb, \"Wahai Ayahku! Sesungguhnya aku bermimpi melihat sebelas bintang. Dan aku juga melihat matahari dan bulan. Aku melihat semuanya bersujud kepadaku.\" Mimpi itu adalah kabar gembira yang disegerakan untuk Yusuf -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Allah menyebutkan kepada Rasulullah dan umatnya kisah Nabi Yusuf dan pelajaran-pelajaran yang terkandung di dalamnya; dimulai dengan kisah mimpi menakjubkan yang nantinya akan menjadi kenyataan. Nabi Yusuf berkata kepada ayahnya, ya’qub: “Wahai ayahku, aku melihat dalam mimpi sebelas bintang, serta matahari dan bulan; semuanya bersujud kepadaku!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. لِأَبِيهِ (kepada ayahnya) Yakni nabi Ya’qub bin Ishaq bin Ibrahim. إِنِّى رَأَيْتُ (sesungguhnya aku bermimpi) Dalam tidur. أَحَدَ عَشَرَ كَوْكَبًا(sebelas bintang) Takwilnya adalah para saudaranya.. وَالشَّمْسَ وَالْقَمَرَ(matahari dan bulan) Takwilnya adalah bapak dan ibunya. رَأَيْتُهُمْ لِى سٰجِدِينَ(kulihat semuanya sujud kepadaku) Benda-benda ini dihikayatkan seperti benda hidup yang berakal karena untuk mngibaratkan sifat orang berakal, yaitu benda-benda itu melakukan sujud."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Ingatlah ketika Yusuf AS berkata kepada ayahnya, Ya’kub AS: “Wahai ayahku (mengganti ya’ mutakalim dengan ta’ ketika memanggil ayah atau ibu) Sesungguhnya dalam mimpi aku melihat 11 bintang (yaitu saudaranya) matahari, dan bulan (ayah dan ibunya) bersujud kepadaku.” Mereka digambarkan dengan gambaran orang yang berakal, karena sujud yang dilakukan itu adalah sujud penghormatan, bukan sujud ibadah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Yusuf berkata kepada ayahnya} Ya‘qub {“Wahai ayahku, sesungguhnya aku telah (bermimpi) melihat sebelas bintang, matahari, dan bulan. Aku melihat semuanya bersujud kepadaku.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ketahuilah bahwasannya Allah menyebutkan bahwa Dia menceritakan kisah terbaik dalam alqur’an kepada RasulNya. kemudian Dia menyampaikan kisah ini merupakan kisah yang sempurna lengkap lagi baik, maka barangsiapa yang ingin menyempurnakannya atau membaguskannya dengan riwayat riwayat israiliyyat yang tidak jelas sanad atau perawinya yang pada umumnya merupakan kedustaan, berarti ia telah berupaya mengetengahkan koreksian terhadap Allah, ia ingin menyempurnakan suatu bagian darinya yang dia klaim memiliki kekurangan. cukuplah buat anda untuk berhenti pada batas ini sebagai suatu kejelekan, karena tambah tambahan pada detail cerita surat tersebut telah menyesaki kitab kitab tafsir berupa kedustaan kedustaan dan perkara perkara menjijikan yang banyak bertentangan dengan sesuatu yang difirmankan Allah Maka kewajiban seorang hamba adalah untuk memahami apa yang telah diceritakan oleh Allah dan menyingkirkan penjelasan lainnya, yang berupa bukan nukilan yang berasal dari Nabi. 4. Firman Allah “ingatlah ketika yusuf berkata kepada ayahnya ”ya’qub bin ishaq bin Ibrahim al Khalil “wahai ayahku, sesungguhnya aku bermimpi melihat sebelas buah bintang, matahari dan bulan aku melihat semuanya sujud kepadaku” mimpi inilah yang menjadi permulaan ketinggian martabat yang direngkuh Nabi yusuf di dunia dan akhirat. Demikianlah jika Allah menghendaki sesuatu yang luar biasa, maka Dia akan memberikan peristiwa pendahuluan sebagai sinyal pembuka dan untuk memuluskan prosesnya, serta sebagai tindakan antisipasi terhadap kesulitan kesulitan yang akan menghadang hambaNya itu serta sebagai bentuk kelembutan dan kebaikan Allah padanya. ya’qub menakwilkannya dengan penjelasan bahwa matahari adalah ibunya, bulan berarti ayahnya. sedangkan bintang bintang merupakan cerminan saudara saudaranya. Berbagai fase kehidupan akan melewatinya, hingga berujung pada momentum saudara saudaranya tunduk dan bersujud kepadanya, sebagai cerminan penghormatan dan pengagungan kepadanya, peristiwa itu tidaklah terjadi melainkan dengan beberapa faktor pendahul, berupa ketentuan seleksi dan pilihan dari Allah yang jatuh padanya (untuk menjadi Nabi) penyempurnaan nikmatNYa, baginya dengan ilmu, amal dan kekuasaan di dunia. karunia itu akan menaungi semua anggota keluarga ya’qub yang nantinya akan bersujud kepadanya dan menjadi pengikutnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لِأَبِيهِ) liabiihi : Ya’qub bin Ishaq bin Ibrahim Sang kekasih Allah alaihim salam. (إِنِّي رَأَيۡتُ) inni ra’aitu : aku melihat di dalam mimpi ku. (أَحَدَ عَشَرَكَوۡكَبٗا) ahada ‘asyara kaukaba : sebelas bintang-bintang langit. (سَٰجِدِينَ) saajidiin : semuanya turun dari langit dan bersujud kepada Yusuf, pada saat itu ia masih kecil. Makna ayat : Firman-Nya : (إِذۡ قَالَ يُوسُفُ) prolog dari kisah ini. Ingatlah—wahai Rasul—ketika Yusuf bin Ya’qub berkata kepada ayahnya, Ya’qub : (يَٰٓأَبَتِ) “Wahai ayahku, (إِنِّي رَأَيۡتُ أَحَدَ عَشَرَ كَوۡكَبٗا) aku melihat 11 bintang-bintang langit (وَٱلشَّمۡسَ وَٱلۡقَمَرَ رَأَيۡتُهُمۡ لِي سَٰجِدِينَ) , matahari, dan bulan mereka turun dari langit lantas bersujud kepada ku—sebagai penghormatan.” Dan tafsir mimpi ini akan terlihat setelah 40 tahun, setelah Allah mengumpulkan kedua orang tuanya, serta sebelas saudaranya, lalu mereka bersujud kepada Yusuf sebagai penghormatan. Pelajaran ayat : • Penetapan mimpi secara syariat dan bolehnya untuk ditakwil. • Penjelasan suatu mimpi terkadang muncul setelah bertahun-tahun lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 4: Bapak Yusuf ‘alaihis salam. adalah Ya'qub putera Ishak putera Ibrahim ‘alaihis salam. Mimpi didahulukan, bahwa Yusuf akan memperoleh ketinggian di dunia dan akhirat. Demikianlah, apabila Allah menghendaki terjadi peristiwa besar, maka Allah dahulukan mukaddimah (pengantarnya) agar siap dan mempermudah urusannya, dan agar hamba siap menerima beban yang akan dihadapinya, yang demikian karena kelembutan Allah kepada hamba-Nya dan ihsan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 4",
    "description": "Setelah dijelaskan bahwa di antara wahyu Al-Qur'an yang diturunkan Allah berupa kisah-kisah umat terdahulu yang belum diketahui secara jelas oleh nabi Muhammad dan umatnya, ayat ini menjelaskan tentang salah satu kisah tersebut, yaitu kisah nabi yusuf. Allah memulai kisah nabi yusuf dengan menceritakan perihal mimpinya. Ketika yusuf putra nabi yakub berkata kepada ayahnya, wahai ayahku! sungguh, aku bermimpi melihat sebelas bintang, yakni saudaranya yang berjumlah sebelas, matahari, yakni ayahnya dan bulan, yakni ibunya; kulihat semuanya sujud atau mengarahkan pandangannya dan hormat kepadaku. Kemudian dia'nabi yakub'berkata kepada putranya, wahai anakku! janganlah engkau ceritakan mimpimu kepada saudara-saudaramu. Aku khawatir apabila mereka tahu, mereka akan membuat tipu daya untuk membinasakan-Mu karena kedengkian mereka. Sungguh, setan itu musuh yang jelas bagi manusia karena terus berupaya memunculkan rasa permusuhan di antara sesama."
  }
]