[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian tidaklah menyembah selain Allah, kecuali hanya nama-nama yang tidak memiliki hakikat-hakikat di baliknya, kalian dan bapak-bapak kalian menjadikannya sebagai tuhan-tuhan, di sebabkan kebodohan yang ada pada kalian dan kesesatan kalian. Allah tidak menurunkan satu hujjah dan bukti apapun yang menunjukan kebenarannya. Keputusan yang haq tiada lain kecuali hanya milik Allah saja, tiada sekututu bagiNya. Dia memerintahakan agar kalian tidak tunduk kepada selainNya, dan agar kalian semata-mata hanya beribadah kepadaNya. Ini lah agama yang lurus yang tidak ada unsur yang bengkok padanya. Akan tetapi, kebanyakan manusia buta terhadapnya, sehingga tidak mengetahui hakikatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Tuhan-tuhan yang kalian sembah selain Allah itu sesungguhnya hanyalah nama-nama yang tidak sesuai dengan penyandang nama. Kalian sendiri dan leluhur kalianlah yang memberikan nama-nama itu kepada mereka. Mereka sama sekali tidak memiliki sifat ketuhanan. Allah tidak pernah menurunkan hujah yang membenarkan tindakan kalian memberikan nama-nama tersebut. Sesungguhnya wewenang untuk memberikan keputusan hukum bagi semua makhluk ada di tangan Allah saja. Bukan di tangan tuhan-tuhan yang nama-namanya kalian buat sendiri dan dibuat oleh leluhur kalian. Allah telah memerintahkan agar kalian menyembah kepada Dia saja dan tidak menyekutukan-Nya dengan yang lain. Ajaran Tauhid itu adalah agama yang lurus dan tidak bengkok. Akan tetapi kebanyakan manusia tidak mengetahuinya. Oleh karena itulah mereka menyekutukan Allah dan menyembah sebagian makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Berhala dan patung-patung yang kalian sembah selain Allah tidak lain hanyalah nama-nama belaka, hakikatnya tidak ada dan tidak dapat memberi manfaat, kalian dan nenek moyang kalian memberinya nama kemudian menjadikannya tuhan-tuhan karena kebodohan dan kesesatan kalian. Allah sama sekali tidak menurunkan bukti dan dalil yang membenarkan penyembahannya. Ketetapan yang berlaku pada segala sesuatu hanya milik Allah semata. Allah memerintahkan dengan perintah yang agung agar kalian tidak menyembah selain Dia, Dialah Yang Esa dan Satu. Itulah agama yang agung, yaitu agama yang lurus dan kokoh; akan tetapi kebanyakan manusia tidak mengetahui dan tidak mengikuti agama ini.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. مَا تَعْبُدُونَ مِن دُونِهِۦٓ إِلَّآ أَسْمَآءً سَمَّيْتُمُوهَآ (Kamu tidak menyembah yang selain Allah kecuali hanya (menyembah) nama-nama yang kamu membuat-buatnya) Yakni hanyalah nama-nama yang kalian buat-buat. أَنتُمْ وَءَابَآؤُكُم(kamu dan nenek moyangmu) Yakni dengan kehendak kalian sendiri. Padahal patung-patung itu bukanlah Tuhan namun hanya benda mati yang tidak dapat melihat dan mendengar, dan tidak dapat memberi manfaat atau mudharat. مَّآ أَنزَلَ اللهُ بِهَا من سلطان(Allah tidak menurunkan suatu keteranganpun tentang nama-nama itu) Yakni tak ada dalil yang menunjukkan kebenaran nama-nama tersebut. إِنِ الْحُكْمُ إِلَّا لِلّٰهِ ۚ (Keputusan itu hanyalah kepunyaan Allah) Tidak ada yang menentukan ketetapan pada makhluk kecuali Allah. ذٰلِكَ (Itulah) Yakni peribadatan kepada Allah semata itu. الدِّينُ الْقَيِّمُ(agama yang lurus) Yang lurus dan kokoh. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (tetapi kebanyakan manusia tidak mengetahui) Yakni tidak mengetahui bahwa yang demikian itu adalah agama-Nya yang benar dan jalan-Nya yang lurus."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "39-40 1 ). { إِنِ الْحُكْمُ إِلَّا لِلَّهِ ۚ أَمَرَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ } Perhatikan isyarat dari pembatasan pada lafazh \"إِلَّا لِلَّهِ\" dan \"إِلَّا إِيَّاهُ\" dalam ayat ini, dan penafsiran keputusan yang ada bahwa itu merupakan ibadah, dan bagimana Yusuf menyebutkan agama yang ia bawakan adalah lurus; agar difahami kemungkaran besar, dan kejahatan besar apa yang dilakukan oleh siapa yang tidak mengamil keputusan dari apa yang diturunkan oleh Allah. 2 ). Jika seseorang melihat kepada kehidupannya yang lalu; maka ia akan mendapatinya penuh dengan rasa sakit sebagaimana yang juga terjadi pada Yusuf; sungguh bumi ini akan sempit dengan rasa sakit yang ia terima itu, namun Yusuf as-shiddiq hanya berdiam diri di balik dinding penjara menggantungkan harapannya kepada sang pencipta, memohon kepada kepada Allah agar orang-orang yang pernah menyakitinya mendapat ampunan. Begitulah kemurahan orang mulia di kalangan manusia, mereka tidak akan kehilangan agama sekalipun mereka kehilangan dunia, dan mereka sekali-kali tidak akan menjadi lemah sebesar apapun musibah yang menimpa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Kalian tidak menyembah sesuatu selain Allah berupa berhala dan patung kecuali hanya nama tanpa hakikat apapun yang mana disebut tuhan oleh kalian dan leluhur kalian sendiri, karena tuhan-tuhan itu adalah benda-benda mati yang tidak dapat mendengar dan melihat, serta tidak dapat memberi mahdharat dan manfaat. Allah tidak menurunkan dan memberikan wahyu berupa hujjah dan tanda-tanda untuk menyembah benda-benda itu. Tidak ada hukum yang berlaku pada suatu hal kecuali hanya milik Allah saja. Itulah agama yang lurus dan teguh. Namun kebanyakan manusia yaitu orang-orang kafir tidak mengetahui semua itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang kalian sembah selain Dia} selain Allah {hanyalah nama-nama yang kalian dan nenek moyang kalian buat sendiri. Allah tidak menurunkan suatu keterangan} dalil yang menunjukkan tentang kebenaran {hal itu. Ketetapan itu hanya milik Allah. Dia telah memerintahkan agar kalian tidak menyembah selain Dia. Itulah agama yang lurus} lurus yang tidak bengkok {tetapi kebanyakan manusia tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Dan sudah dapat dimaklumi bahwa Dzat yang karakterisktik dan sifatNYa demikian ini lebih baik daripada sesembahan sesembahan beraneka macam yang hanya berbentuk nama nama (kosong) semata, tanpa ada unsur kesempurnaan dan kemampuan baginya. Oleh karenanya, beliau berkata, ”kamu tidak menyembah yang selain Allah kecuali hanya (menyembah) nama nama yang kamu dan nenek moyangmu membuat buatnya” maksudnya, kalian telah membuat predikat nam anama padanya dan kalian menamakannya sebagai tuhan. Padahal benda benda itu tidak ada artinya sama sekali, juga tidak mempunyai sifat sifat ketuhanan sedikitpun. “Allah tidak menurunkan suatu keteranganpun tentang nama nama itu” bahkan Allah telah menurunkan keterangan tentang larangan untuk menyembahnya dan penjelasan tentang kebatilannya. Apabila Allah tidak menurunkan sebuah bukti penguat apapun, maka tidak ada jalan, cara dan petunjuk tentang ketuhanan benda benda itu. Karena keputusan itu ”hanyalah kepunyaan Allah, semata. Dialah dzat yang memerintahkan kalian. ”agar kamu tidak menyembah melainkan kepadaNya. Itulah agama yang lurus” maksudnya, agama yang lurus lagi mengantarkan kepada segala kebaikan. Sedangkan semua agama selainnya, merupakan agama yang tidak lurus, jalan yang bengkok, menyeret kepada segala kejelekan. ”tetapi kebanyakan manusia tidak mengetahui” hakikat hakikat segala sesuatu. kalau tidak dengan demikian, maka sesungguhnya perbedaan antara beribadah kepada Allah semata (tidak ada sekutu bagiNya) dengan praktik syirik termasuk perkara yang jelas lagi terang. namun lantaran tidak adanya ilmu pada kebanyakan orang tentang itu, maka terjadilah apa yang telah terjadi, berupa praktik syirik. Yusuf mengajak penghuni penjara untuk beribadah kepada Allah semata, dan mengihlaskan agama bagiNya. ini mengandung kemungkinan bahwa mereka berdua menyambut ajakan itu dan menaatinya, hingga kenikmatan Allah terwujud pada mereka berdua. Dan ada juga kemungkinan bahwa mereka tetap berada dalam kesyirikan mereka, sehingga hujjah telah tegak pada mereka berdua."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مِن دُونِهِۦٓ) min duunih : selain Allah subhanahu wa ta’ala. (إِلَّآ أَسۡمَآءٗ) illa asmaa’ : hanya label “tuhan”, hakikatnya ia bukan tuhan (yang sebenarnya) tapi berhala. (مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلۡطَٰنٍۚ) maa anzalallahu bihaa min sulthaan : Allah tidak memerintahkan untuk beribadah kepada berhala itu. Makna ayat : Kemudian Yusuf berkata kepada seluruh penghuni penjara, (مَا تَعۡبُدُونَ مِن دُونِهِۦٓ) “Yang kalian sembah selain-Nya—Allah Yang Maha Esa dan Maha Perkasa—( إِلَّآ أَسۡمَآءٗ سَمَّيۡتُمُوهَآ أَنتُمۡ وَءَابَآؤُكُم) hanya sekedar nama saja—tidak lebih—karena kalian menggunakan kata ilaah dan rabb kepada berhala dan bintang yang dibuat berbentuk, yang seperti itu tidak membuat mereka lantas menjadi tuhan. Rabb yang sebenarnya adalah yang menciptakan, memberikan rizki, yang mengatur segala sesuatu, adapun makhluk yang diberi rizki, tidak bisa memberikan keburukan atau kebaikan untuk dirinya terlebih kepada yang lain. Maka penggunaan kata rabb dan ilaah kepada mereka adalah kedustaan. Itu hanya nama-nama (مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلۡطَٰنٍۚ) yang tidak Allah berikan bukti dan dalil agar kalian menyembahnya, kemudian berkata, (إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِ) hukum hanya milik Allah, dan Allah telah menetapkan jangan menyembah kecuali kepada-Nya, berdasarkan ini seluruh peribadatan kepada selain-Nya adalah batil harus ditinggalkan dan berlepas darinya, (ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُ) kemudian Yusuf menjelaskan bahwa mengesakan ibadah hanya kepada Allah dan meninggalkan ibadah selain-Nya adalah agama yang benar dan jalan yang lurus, namun kebanyakan manusia tidak mengetahui. Ketidaktahuan mereka terhadap Rabb mereka yang telah menciptakan mereka, memberikan rizki, mengatur segala kehidupan mereka dan hanya kepada-Nya kembali segala sesuatu, dan Dia pula yang menjadikan kalian menyembah apa yang kalian pahat dan menuhankan apa yang kalian buat. Pelajaran dari ayat : • Tidak ada hukum yang benar kecuali dengan hukum Allah. Kebenaran adalah yang ditetapkan Allah, kebatilan adalah yang Allah anggap batil, dan agama yang benar adalah yang Allah syariatkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 40: Bahkan keterangan yang Allah turunkan adalah melarang menyembah mereka dan menyuruh menyembah hanya kepada-Nya, dan Dialah yang harus diikuti karena keputusan itu hanyalah milik-Nya; Dia yang memerintah dan melarang, menetapkan syari’at dan menetapkan hukum-hukum. Yakni yang menghubungkan kepada semua kebaikan, sedangkan agama selainnya tidak lurus, bengkok dan menghubungkan kepada keburukan. Mereka tidak mengetahui perkara yang sebenarnya atau tidak mengerti hakikat sesuatu, padahal perbedaan menyembah Allah dengan menyembah selain-Nya begitu jelas. Akan tetapi, karena ketidaktahuan mereka terjatuh ke dalam syirk. Nabi Yusuf mengajak kedua penghuni penjara untuk beriman, namun kami tidak mengetahui apakah keduanya beriman atau tidak. Jika keduanya beriman (masuk Islam) berarti mereka mendapatkan nikmat, tetapi jika mereka tetap berbuat syirk maka telah tegak hujjah bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 40",
    "description": "Apa yang kamu sembah selain dia dan kamu percayai sebagai tuhan, hanyalah nama-nama yang kamu buat-buat lalu dianggap baik oleh kamu sendiri maupun oleh nenek moyangmu, padahal ia hanyalah benda mati yang tidak bisa memberi manfaat maupun mendatangkan mudarat. Allah tidak menurunkan suatu keterangan pun baik berupa dalil yang pasti maupun bukti yang kuat tentang suatu hal mengenai nama atau status benda yang kamu jadikan sesembahan itu. Keputusan yang adil tentang akidah, ibadah, dan ketentuan dalam muamalah yang benar itu hanyalah milik Allah, karena dialah pencipta segalanya sehingga mengetahui segala sesuatu tentang ciptaan-Nya. Dia telah memerintahkan agar kamu dengan tulus ikhlas tidak menyembah selain dia, karena Allah adalah pencipta, pemberi rezeki, yang menghidupkan dan mematikan. Itulah agama yang lurus lagi benar yang dijelaskan dalam kitab suci dan disampaikan para rasul-Nya, tetapi kebanyakan manusia tidak mengetahui hakikat kebenaran itu disebabkan oleh sifat sombong mereka yang selalu mengikuti hawa nafsunya. Setelah nabi yusuf terlebih dahulu menyampaikan risalah Allah tentang ketuhanan, ayat berikutnya menjelaskan tentang takwil mimpi kedua pemuda itu sebagaimana dijelaskan pada ayat 36. Hal ini dilakukan agar ajaran tauhid mudah diterima oleh mereka. Wahai kedua penghuni penjara, dengarkanlah takwil mimpi kamu, adapun salah seorang di antara kamu yang bermimpi memeras anggur, maka dalam waktu dekat akan dibebaskan dari penjara dan akan bertugas kembali menyediakan minuman khamar bagi tuannya. Adapun yang seorang lagi yang bermimpi membawa roti di atas kepalanya, dia akan dijatuhi hukuman mati dengan cara disalib, lalu burung hinggap dan memakan sebagian daging kepalanya. Dengan demikian telah terjawab perkara yang kamu tanyakan kepadaku perihal takwil mimpi kamu."
  }
]