[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai dua penghuni penjara, aku sampaikan kepada kalian berdua penjelasan mimpi kalian, adapun orang yang melihat dirinya memeras anggur dalam mimpinya, maka sesungguhnya dia akan keluar dari penjara dan akan menjadi pegawai yang menuangkan khamar kepada raja. sedangkan yang lain yang melihat dalam mimpinya bahwa dia membawa roti di atas kepalanya, sesungguhnya dia akan di salib dan di biarkan begitu saja, lalu burung mematok sebagian dari kepalanya. Telah diputuskan ketetapan yang kalian meminta jawaban soal itu dan telah usai diputuskan.’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Wahai dua kawanku di dalam penjara, “Adapun yang bermimpi memeras anggur untuk dibuat menjadi khamar, ia akan keluar dari penjara dan kembali ke pekerjaannya. Ia akan menyediakan minuman untuk raja. Dan yang bermimpi membawa roti di atas kepalanya kemudian dimakan oleh burung-burung, dia akan dibunuh dan disalib. Kemudian daging kepalanya akan dimakan oleh burung-burung. Perkara yang kalian berdua tanyakan itu telah selesai dan sempurna. Dan perkara itu pasti terjadi, tidak mungkin terhindar\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Kemudian Yusuf berkata kepada kedua pemuda itu dengan kedekatan mereka dalam persabatan untuk mengajak mereka beriman: “Hai dua sahabatku dalam penjara, inilah tafsir mimpi kalian: Yang bermimpi memeras anggur untuk dijadikan khamr akan keluar dari penjara dan bekerja sebagai pemberi minum khamr bagi raja; sedangkan yang bermimpi membawa roti di atas kepalanya dan burung memakan roti itu, maka dia akan disalib dan ditinggal begitu saja, sehingga kepalanya akan dimakan burung. Demikianlah ketetapan dari perkara yang kalian pertanyakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. أَمَّآ أَحَدُكُمَا (Adapun salah seorang diantara kamu berdua) Yakni si pemberi minum sang raja. فَيَسْقِى رَبَّهُۥ خَمْرًا ۖ( akan memberi minuman tuannya dengan khamar) Seakan-akan nabi Yusuf berkata kepadanya: adapun kamu hai pemberi minum, kamu akan kembali pada pekerjaanmu, sang raja akan memanggilmu dan membebaskanmu dari penjara. وَأَمَّا الْاٰخَرُ (adapun yang seorang lagi) Yakni si pembuat roti. فَيُصْلَبُ فَتَأْكُلُ الطَّيْرُ مِن رَّأْسِهِۦ ۚ (maka ia akan disalib, lalu burung memakan sebagian dari kepalanya) Sebagai takwil dari mimpinya bahwa ia melihat dirinya membawa roti diatas kepalanya kemudian burung-burung memakannya. قُضِىَ الْأَمْرُ الَّذِى فِيهِ تَسْتَفْتِيَانِ (Telah diputuskan perkara yang kamu berdua menanyakannya (kepadaku)) Yakni perkara yang mereka berdua lihat dalam mimpi dan mereka kisahkan kepada nabi Yusuf."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Wahai sahabatku dalam penjara, inilah penafsiran mimpi kalian: “Adapun salah satu dari kalian yaitu pembawa minuman, dia akan kembali ke tempat asalnya dan keluar dari penjara. Dia akan memberi minum tuannya, yaitu Raja dengan khamr, sedangkan yang lainnya yaitu pembawa roti, dia akan disalib dana akan terus disalib sampai ada burung memakan sesuatu di atas kepalanya.” Lalu keduanya berkata: “Kami berbohong, kami tidak melihat apapun.” Yusuf berkata: “Perkara yang kalian tanyakan telah berlaku baik kalian jujur maupun berdusta.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai dua penghuni penjara, salah seorang di antara kalian akan menyediakan minuman khamr untuk tuannya} tuannya {sedangkan yang lain akan disalib. Lalu burung akan memakan sebagian kepalanya. Telah terjawab perkara} diputuskan perkara {yang kalian berdua tanyakan} kalian tanyakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41 Kemudian beliau mulai menakwilkan mimpi mereka berdua yang sebelumnya telah beliau janjikan. Beliau berkaata ”hai kedua penghuni penjara, ’adapun salah seorang diantara kamu berdua’” yaitu orang yang melihat dirinya memeras anggur, ia akan bebas dari penjara dan memberi minum “tuannya dengan khamar” maksudnya, ia akan memberikan minuman kepada tuannya yang ia layani berupa minuman khamar. Ini adalah konsekuensi atas kebebasannya dari penjara. ”adapun yang seorang lagi” yaitu orang yang bermimpi dirinya memanggul roti di atas kepalanya, kemudian seekor burung memakan sebagian roti itu. ”maka ia akan disalib, lalu burung memakan sebagian dari kepalanya” yusuf menakwilkan roti yang dimakan oleh burung dengan daging kepalanya dan seisinya termasuk otaknya juga. Ia tidak dikubur dan disembunyikan dari jangkauan burung burung bisa leluasa mematukinya. Kemudia yusuf mengabarkan bahwa hasil penakwilan mimpi ini yang ia sebutkan, pasti akan terjadi. Ia berkata, ”telah diputuskan perkara yang kamu berdua menanyakannya (kepadaku)” yaitu perkara yang kalian berdua menanyakan tentang takwil dan penjelasannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَيَسۡقِي رَبَّهُۥ خَمۡرٗاۖ) fayasqii rabbahuu khamraa : ia akan menuangkan khamr untuk tuannya (raja). (فَيُصۡلَبُ) fayushlabu : disalib di atas kayu, itu tata cara hukuman mati bagi mereka. (قُضِيَ ٱلۡأَمۡرُ) qidhiyal amru : telah selesai dan telah ditetapkan. Makna ayat : Setelah selesai mengajak mereka kepada Allah, kemudian kembali kepada kedua pemuda yang meminta takwil mimpi darinya, Allah berfirman tentang merek berdua : (يَٰصَٰحِبَيِ ٱلسِّجۡنِ أَمَّآ أَحَدُكُمَا فَيَسۡقِي رَبَّهُۥ خَمۡرٗاۖ) salah satu dari mereka akan dibebaskan dan akan kembali bekerja untuk sang raja menuangkan khamr sebagaimana dahulu, adapun yang lain yaitu koki kerajaan yang ia dituduh merencanakan pembunuhan dengan meracuni makanan raja, maka ia akan disalib dan sebagian kepalanya akan dimakan burung setelah ia disalib. Lalu mereka berdua berkata, “Kami hanya mencoba-coba saja, kami belum melihat mimpi apapun.”, lalu beliau menjawab, (قُضِيَ ٱلۡأَمۡرُ ٱلَّذِي فِيهِ تَسۡتَفۡتِيَانِ) “Telah tetap dan akan terjadi sesuai yang ditakwilkan, baik kalian melihat mimpi itu atau tidak.” Pelajaran dari ayat : • Bolehnya meminta nasehat atau fatwa dalam perkara rumit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 41: Yaitu si pemberi minum, di mana ia akan keluar setelah tiga tahun. Seperti biasanya. Yaitu orang yang bermimpi membawa roti di atas kepalanya, lalu sebagiannya dimakan oleh burung. Yusuf menakwil roti yang dimakan burung itu dengan daging dan lemak di kepalanya, dan apa yang ada di kepala berupa otak, dan bahwa orang ini akan dibunuh, setelah itu tidak dikubur dan tidak ditutupi dari burung-burung, bahkan disalib dan ditaruh di satu tempat yang memungkinkan burung untuk memakannya. Yakni baik kamu berdua percaya atau tidak, bahwa hal itu akan terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 41",
    "description": "Setelah nabi yusuf terlebih dahulu menyampaikan risalah Allah tentang ketuhanan, ayat berikutnya menjelaskan tentang takwil mimpi kedua pemuda itu sebagaimana dijelaskan pada ayat 36. Hal ini dilakukan agar ajaran tauhid mudah diterima oleh mereka. Wahai kedua penghuni penjara, dengarkanlah takwil mimpi kamu, adapun salah seorang di antara kamu yang bermimpi memeras anggur, maka dalam waktu dekat akan dibebaskan dari penjara dan akan bertugas kembali menyediakan minuman khamar bagi tuannya. Adapun yang seorang lagi yang bermimpi membawa roti di atas kepalanya, dia akan dijatuhi hukuman mati dengan cara disalib, lalu burung hinggap dan memakan sebagian daging kepalanya. Dengan demikian telah terjawab perkara yang kamu tanyakan kepadaku perihal takwil mimpi kamu. Dan dia nabi yusuf pun berkata kepada orang yang diketahuinya akan selamat dari hukuman mati di antara mereka berdua, jika kamu nanti keluar dari penjara ini, terangkanlah tentang keadaanku yang ditahan secara zalim tanpa kesalahan kepada tuanmu, agar aku dapat segera dibebaskan. Maka setan menjadikan dia yakni orang yang selamat dari hukuman, lupa untuk menerangkan tentang keadaan nabi yusuf kepada tuannya. Karena itu dia nabi yusuf tetap dalam penjara beberapa tahun lamanya, dalam tempo kurang lebih tiga sampai sembilan tahun."
  }
]