[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan yusuf berpesan kepada orang yang dia tahu akan selamat di antara dua temannya itu, ’sebutlah aku disisi tuanmu, sang raja, dan beritahukanlah padanya bahwa sesungguhnya aku adalah orang yang terzhalimi lagi di penjara tanpa dosa.” tapi setan membuat lelaki itu lupa untuk mengabarkan kepada sang raja keadaan yusuf. Akibatnya, yusuf tetap tinggal di dalam penjara setelah itu beberapa tahun lamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Yusuf berkata kepada orang yang diyakininya akan selamat di antara kedua orang tersebut -yaitu si penyedia minuman untuk raja-, \"Ceritakanlah kisahku dan perihal diriku ini kepada raja. Mudah-mudahan dia berkenan mengeluarkan aku dari penjara.\" Ternyata setan membuat orang tersebut lupa menceritakan kisah Yusuf -'alaihissalām- kepada raja, sehingga Yusuf tetap tinggal di dalam penjara selama beberapa tahun sesudah kejadian itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Kemudian Yusuf berwasiat kepada pemuda yang akan terbebas agar menyebutkan perkaranya pada raja dan menceritakan ilmu menafsirkan mimpi yang telah dilihatnya agar kezaliman yang menimpa Yusuf dapat diselesaikan. Akan tetapi setan membuat pemuda ini lupa untuk menyebutkan perkara Yusuf kepada raja, sehingga Yusuf harus tetap tinggal di dalam penjara beberapa tahun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَقَالَ لِلَّذِى ظَنَّ أَنَّهُۥ نَاجٍ مِّنْهُمَا (Dan Yusuf berkata kepada orang yang dikiranya akan selamat diantara mereka berdua) Yakni nabi Yusuf berkata kepada tukang pemberi minum. Dan orang yang mengira disini adalah nabi Yusuf karena pentakwil mimpi sebenarnya hanya mengira tanpa dapat memastikan kepastiannya. اذْكُرْنِى عِندَ رَبِّكَ(Terangkanlah keadaanku kepada tuanmu) Nabi Yusuf memerintahkannya akan mengangkat perkaranya kepada sang raja, dan menjelaskan apa yang telah ia saksikan dari nabi Yusuf, seperti keahliannya dalam mentakwilkan mimpi dan pengetahuannya tentang ilmu ghaib, hal itu diharapkan dapat menjadi sebab perhatian sang raja atas kezaliman yang nabi Yusuf dapatkan berupa hukuman penjara tersebut setelah sang raja melihat tanda-tanda ketidakbersalahannya. فَأَنسَىٰهُ الشَّيْطٰنُ ذِكْرَ رَبِّهِۦ(Maka syaitan menjadikan dia lupa menerangkan (keadaan Yusuf) kepada tuannya) Yakni menjadikan lupa salah satu budak yang bebas itu. Setan membuatnya lupa untuk memberitahu sang raja sebagaimana yang nabi Yusuf perintahkan kepadanya apabila ia telah bebas dari penjara dan kembali menjadi pelayan sang raja. فَلَبِثَ فِى السِّجْنِ بِضْعَ سِنِينَ (Karena itu tetaplah dia (Yusuf) dalam penjara beberapa tahun lamanya) Makna (البعض) yakni jumlah sesuatu antara tiga sampai Sembilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Yusuf berkata kepada orang yang selamat yaitu pembawa minuman: “Ingatlah penggambaranku yang engkau saksikan di sisi rajamu, dan ingatkan dia tentang aku ketika kamu kembali kepadanya, supaya dia bersikap adil kepadaku dan membebaskanku.” Lalu setan membuatnya lupa untuk mengingatkan raja tentang Yusuf sehingga Yusuf tetap berada dalam penjara selama beberap tahun, yaitu 3 sampai 4 tahun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia} Yusuf {berkata kepada orang yang meyakini} meyakini {bahwa dia selamat di antara mereka berdua,“Jelaskanlah keadaanku kepada tuanmu”} tuanmu, yaitu rajamu {Kemudian setan membuatnya lupa untuk menjelaskan kepada tuannya} lalu setan membuat pemberi minum lupa menyebutkan Yusuf kepada tuannya, yaitu Raja {Lalu dia tetap} lalu dia menetap {di dalam penjara beberapa tahun} tujuh tahun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42 Maksudnya “dan dia berkata” yaitu yusuf ”kepada orang yang diketahuinya akan selamat diantara mereka berdua” orang yang bermimpi melihat dirinya memeras anggur agar menjadi khamar, ”terangkanlah keadaanku kepada tuanmu” jelaskan kepadanya tentang kondisi dan kisahku, semoga saja da berubah dan bersikap lunak serta membebaskanku dari keadaanku sekarang. ”maka setan menjadikannya lupa menerangkan (keadaan yusuf) kepada tuannya” setan menjadikan orang yang selamat tadi lupa dari mengingat Allah dan melakukan perbuatan yang mendekatkan dirinya kepadaNya. Termasuk yang ia lupakan adalah menyebutkan (keadaan) yusuf yang berhak untuk mendapatkan balasan sebaik baiknya. Kejadian ini bertujuan agar Allah menyempurnakan ketetapan dan keputusanNya ”karena itu, tetaplah yusuf dalam penjara beberapaa tahun lamanya” berkisar antara tiga sampai Sembilan tahun lamanya. Oleh karena itu, ada pendapat yang menyatakan, ”ia tetap menghuninya selama tujuh tahun” Tatkala Allah berkehendak untuk menyempurnakan keputusanNya dan membuka jalan bagi kebebasan yusuf dari penjara, maka Allah menetapkan faktor penyebab kebebasan yusuf, mengangkat harga diri dan ketinggian kharismanya, yaitu melalui mimpi sang raja."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ظَنَّ أَنَّهُۥ نَاجٖ مِّنۡهُمَا) zhanna annahu naajim mihuma : yakin orang itu akan bebas. (ٱذۡكُرۡنِي عِندَ رَبِّكَ) udzkurnii ‘inda rabbik : katakan kepada raja, bahwa aku dipenjara secara zalim tanpa kesalahan. (فَأَنسَىٰهُ ٱلشَّيۡطَٰنُ ذِكۡرَ رَبِّهِۦ) fa’ansaahusy syaithaanu dzikra rabbihi : setan membuat Yusuf lupa ingat kepada Rabbnya (Allah). Makna ayat : Kemudian ia berkata kepada yang ia sangka akan selamat, sesuai dengan yang Allah kabarkan, (ٱذۡكُرۡنِي عِندَ رَبِّكَ) sebut-sebutlah aku di sisi tuanmu. Dahulu mereka menggunakan kata rabb untuk tuan atau raja. (فَأَنسَىٰهُ ٱلشَّيۡطَٰنُ ذِكۡرَ رَبِّهِۦ) Maka setan membuat Yusuf ‘alaihi salam lupa kepada Rabbnya ta’ala, lebih mengharap kepada pelayan itu dan raja, dan lupa akan Allah ta’ala, maka Allah hukum Yusuf (فَلَبِثَ فِي ٱلسِّجۡنِ بِضۡعَ سِنِينَ), sehingga ia tinggal di penjara beberapa tahun, kurang lebih tujuh tahun. Pelajaran dari ayat : • Lalainya Nabi Yusuf ‘alaihi salam dengan lebih berharap kepada pelayan itu dari pada Allah, Tuannya yang hakiki, dan Pelindungnya yang menyelamatkan dia dari pembunuhan dan kegelapan sumur, serta ujian para wanita yang menyebabkan dia dijebloskan ke dalam penjara selama tujuh tahun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 42: Yaitu pemberi minuman raja. Yakni mungkin saja dia akan kasihan terhadapku dan akan mengeluarkanku dari sini. Bidh’ adalah bilangan dari tiga sampai sembilan. Wahb bin Munabbih berkata, “Ayyub menerima cobaan selama tujuh tahun, dan Yusuf menerima cobaan selama tujuh tahun.” Ketika Allah Subhaanahu wa Ta'aala ingin menyempurnakan urusan-Nya dan mengizinkan untuk mengeluarkan Yusuf dari penjara, Allah Subhaanahu wa Ta'aala menentukan sebab yang membuat Yusuf keluar dari penjara dan berkedudukan tinggi di Mesir. Allah Subhaanahu wa Ta'aala memperlihatkan kepada raja mimpi yang aneh dan menjadikan Yusuf mampu menakwilkan mimpi itu, sehingga keutamaannya semakin jelas, dan ilmunya semakin nampak yang menjadikannya berkedudukan tinggi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 42",
    "description": "Dan dia nabi yusuf pun berkata kepada orang yang diketahuinya akan selamat dari hukuman mati di antara mereka berdua, jika kamu nanti keluar dari penjara ini, terangkanlah tentang keadaanku yang ditahan secara zalim tanpa kesalahan kepada tuanmu, agar aku dapat segera dibebaskan. Maka setan menjadikan dia yakni orang yang selamat dari hukuman, lupa untuk menerangkan tentang keadaan nabi yusuf kepada tuannya. Karena itu dia nabi yusuf tetap dalam penjara beberapa tahun lamanya, dalam tempo kurang lebih tiga sampai sembilan tahun. Setelah dipaparkan tentang keberadaan nabi yusuf di dalam penjara yang cukup lama tanpa ada perhatian dari siapa pun, berikutnya dipaparkan tentang mimpi raja. Akibat mimpi raja ini membuka kembali ingatan pelayan raja akan pesan nabi yusuf kepadanya. Adapun mimpi raja sebagaimana dijelaskan berikut ini. Dan raja berkata kepada para pemuka kaumnya, sesungguhnya aku bermimpi melihat tujuh ekor sapi betina yang gemuk dimakan oleh tujuh ekor sapi betina yang kurus; kemudian aku melihat pula tujuh tangkai biji gandum yang hijau yang penuh isinya dan tujuh tangkai biji gandum lainnya yang kering dan tidak berisi. Wahai orang yang terkemuka dari kalangan orang-orang pandai dan bijak! terangkanlah kepadaku tentang takwil mimpiku itu jika kamu dapat menakwilkan apa arti mimpi itu. Apabila Allah menghendaki sesuatu, dia menyiapkan sebab-sebabnya. Mimpi raja itu kelak menjadi salah satu penyebab bebasnya nabi yusuf dari penjara."
  }
]