[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sang raja berakata, ”sesungguhnya aku melihat dalam mimpiku ada tujuh sapi betina gemuk-gemuk yang dimangsa oleh tujuh ekor sapi betina yang sudah benar-benar lemah-lunglai, dan aku melihat tujuh bulir yang hijau-hijau dan tujuh bulir lain yang kering-kering. Wahai para petinggi dan para pembesar, sampaikanlah kepadaku ta’bir tentang mimpi ini, bila kalian adalah orang-orang yang sanggup menafsirkan mimpi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Raja berkata, \"Sesungguhnya aku bermimpi melihat tujuh ekor sapi betina yang gemuk-gemuk dimakan oleh tujuh ekor sapi betina yang kurus-kurus. Dan aku juga melihat tujuh tangkai gandum hijau (basah) dan tujuh tangkai gandum kering. Wahai para pemimpin dan para pembesar yang terhormat! Berilah aku penjelasan tentang takwil mimpiku itu, jika kalian memiliki pengetahuan tentang takwil mimpi.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Raja Mesir berkata kepada para pembantu dan para penasehatnya: “Aku melihat dalam mimpi tujuh sapi yang gemuk memakan tujuh sapi yang kurus; dan aku melihat tujuh tangkai gandum hijau dan tujuh tangkai gandum kering. Wahai para pembantu dan penasehat, katakanlah kepadaku apa tafsir dari mimpi ini jika kalian mengetahui tafsirnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَقَالَ الْمَلِكُ (Raja berkata) Yakni raja tertinggi dari negeri Mesir, yang mana al-aziz adalah salah satu Menterinya. إِنِّىٓ أَرَىٰ( Sesungguhnya aku bermimpi) Yakni aku melihat dalam mimpi. سَبْعَ بَقَرٰتٍ سِمَانٍ (melihat tujuh ekor sapi betina yang gemuk-gemuk) Badannya. سَبْعٌ عِجَافٌ (tujuh ekor sapi betina yang kurus-kurus) Dan sapi yang kurus-kurus itu mendatangi sapi yang gemuk-gemuk, kemudian yang kurus memakan yang gemuk. وَسَبْعَ سُنۢبُلٰتٍ خُضْرٍ(dan tujuh bulir (gandum) yang hijau) Yang bijinya telah berisi. Dan makna (اليابسات) yakni yang belum layak untuk dipanen. Sang raja bermimpi bahwa bulir-bulir gandum yang kering itu mengelilingi dan mengalahkan bulir-bulir yang hijau. يٰٓأَيُّهَا الْمَلَأُ (Hai orang-orang yang terkemuka) Kalimat ini ditujukan bagi pemuka-pemuka kaumnya. أَفْتُونِى فِى رُءْيٰىَ (Terangkanlah kepadaku tentang ta’bir mimpiku itu) Yakni beritahu aku tentang takwil mimpiku ini. إِن كُنتُمْ لِلرُّءْيَا تَعْبُرُونَ (jika kamu dapat mena’birkan mimpi) Yakni jika kalian dapat mentakwilkan dan menafsirkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Raja Mesir Agung yang merupakan rajanya Menteri Al-‘Aziz berkata: ”Dalam mimpi aku melihat 7 sapi betina dimakan 7 sapi betina yang lemah dan buruk, serta 7 tangkai gandum hijau yang menghasilkan biji. lalu ada 7 biji lainnya yang kering yang terus condong kepadanya dan menghancurkannya. Wahai para hakim dan cendekiawan yang mulia beritahu aku tentang tafsir dan makna mimpi ini, jika kalian mengetahuinya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Raja berkata,“Sesungguhnya aku bermimpi melihat} melihat dalam mimpiku {tujuh ekor sapi yang gemuk yang dimakan oleh tujuh ekor sapi yang kurus} sangat kurus sekali {serta tujuh tangkai yang hijau dan yang lainnya kering} dan tujuh tangkai lainnya kering {Wahai para pemuka kaum} pemuka kaum {jelaskanlah kepadaku tentang mimpiku itu jika kalian dapat menakwilkannya”} menafsirkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ketika Allah berkehendak mengeluarkan yusuf dari penjara, maka Allah memperlihatkan mimpi yang aneh tersebut padasang raja yang penakwilannya mengundang semua orang, agar penakwilan mimpi itu nanti terjawab di tangan yusuf, hingga tampak sisi keutamaan yusuf dan menjadi jelas kapasitas ilmunya, yang selanjutnya akan menjadi sumber pengangkatan ketinggian martabatnya di dunia dan akhirat. Dan termasuk dari ketentuan taksir yang bersifat selaras adalah, bahwa sang rajalah orang yang menjadi tumpuan permaslahan rakyat yang bermimpi melihatnya. Karena kemaslahaatannya terkait dengannya (raja). Pasalnya, ia menyaksikan mimpi yang menyeramkannya. Iapun mengumpulkan orang orang berilmu dan para pemikir dari bangsanya seraya berkata, 43. ”sesungguhnya aku bermimpi melihat tujuh ekor sapi betina yang gemuk gemuk dimakan oleh tujuh” tujuh ekor sapi betina ”yang kurus kurus” inilah sisi keanehannya, tujuh sapi yang kurus dan tak bertenaga yang kekuatannya sudah tidak ada lagi, memakan tujuh sapi betina yang gemuk gemuk, yang merupakan sapi sapi paling kuat. ”dan”aku menyaksikan”tujuh butir (gandum) yang hijau” dimusnahkan oleh tujuh butir yang kering. ”hai orang orang yang terkemuka ’terangkanlah kepadaku tentang ta’bir mimpiku’”sebab pena’biran semua orang adalah satu, dan semua penakwilan itu semua hanya satu macam. ”jika kamu dapat mena’birkan mimpi”."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱلۡمَلِكُ) al-malik : Raja Mesir—bukan Al-‘Aziz dia salah satu menterinya—namanya Ar-Rayyan bin Al-Walid. (سَبۡعٌ عِجَافٞ) sab’un ‘ijaaf : kurus. (يَٰٓأَيُّهَا ٱلۡمَلَأُ) ya’yyuhal mala’u : wahai para pembesar dan abdi negara. (أَفۡتُونِي فِي رُءۡيَٰيَ) aftuunii fii amrii : takwilkan mimpiku ini. Makna ayat : Kisah berlanjut ketika Yusuf masih berada di dalam kesulitan, ketika masa-masa sulit hampir sampai pada akhirnya, sang raja Mesir melihat mimpi yang membuatnya terkejut. Kemudian meminta abdi negaranya untuk metakwil mimpi tersebut—sebagaimana yang Allah kabarkan dalam firman-Nya pada ayat-ayat ini, (وَقَالَ ٱلۡمَلِكُ) raja negeri itu berkata, (إِنِّيٓ أَرَىٰ) “Aku melihat dalam mimpiku (سَبۡعَ بَقَرَٰتٖ سِمَانٖ يَأۡكُلُهُنَّ سَبۡعٌ) tujuh sapi gemuk dimakan tujuh sapi (عِجَافٞ) kurus, sangat kurus (وَسَبۡعَ سُنۢبُلَٰتٍ خُضۡرٖ وَأُخَرَ) dan tujuh ranting hijau dan tujuh ranting (يَابِسَٰتٖۖ) kering.” Kemudian mengumpulkan ahli ilmu dan pejabat negara, memberikan masalah ini kepada mereka, lalu berkata, (يا أيها ٱلۡمَلَأُ أَفۡتُونِي فِي رُءۡيَٰيَ إِن كُنتُمۡ لِلرُّءۡيَا تَعۡبُرُونَ) “Wahai para pembesar, berikan kepadaku jawaban kalian mengenai mimpiku ini, jika kalian bisa mentakwilnya.” Pelajaran dari ayat : • Mimpi yang baik dan benar juga bisa dilihat orang kafir atau fasik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 43: Raja Mesir bernama Ar Rayyan bin Al Walid. Ketika ia bermimpi, ia mengumpulkan ahli ilmu dan orang-orang yang memiliki ide cemerlang di antara kaumnya dan memberitahukan kepada mereka mimpi tersebut. Yang menutupi tangkai yang hijau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 43",
    "description": "Setelah dipaparkan tentang keberadaan nabi yusuf di dalam penjara yang cukup lama tanpa ada perhatian dari siapa pun, berikutnya dipaparkan tentang mimpi raja. Akibat mimpi raja ini membuka kembali ingatan pelayan raja akan pesan nabi yusuf kepadanya. Adapun mimpi raja sebagaimana dijelaskan berikut ini. Dan raja berkata kepada para pemuka kaumnya, sesungguhnya aku bermimpi melihat tujuh ekor sapi betina yang gemuk dimakan oleh tujuh ekor sapi betina yang kurus; kemudian aku melihat pula tujuh tangkai biji gandum yang hijau yang penuh isinya dan tujuh tangkai biji gandum lainnya yang kering dan tidak berisi. Wahai orang yang terkemuka dari kalangan orang-orang pandai dan bijak! terangkanlah kepadaku tentang takwil mimpiku itu jika kamu dapat menakwilkan apa arti mimpi itu. Apabila Allah menghendaki sesuatu, dia menyiapkan sebab-sebabnya. Mimpi raja itu kelak menjadi salah satu penyebab bebasnya nabi yusuf dari penjara. Kemudian mereka para pemuka kaumnya pun menjawab, itu hanyalah bunga tidur dan termasuk dari mimpi-mimpi yang kosong tidak ada artinya dan oleh karena itu kami tidak mampu menakwilkan mimpi itu."
  }
]