[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab, ”mimpimu hanya rangkain bunga-bunga tidur belaka, tidak ada ta’wil maknanya. Dan kami bukan orang-orang yang tahu menafsirkan bunga-bunga tidur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Mereka menjawab, \"Mimpimu itu adalah mimpi yang kacau. Dan mimpi seperti itu tidak punya arti. Kami tidak memiliki pengetahuan tentang takwil mimpi yang kacau.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. mereka menjawab: “Ini adalah mimpi sebagaimana mimpi-mimpi yang lain, dan kami tidak mengetahui cara menafsirkan mimpi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. قَالُوٓا۟ أَضْغٰثُ أَحْلٰمٍ ۖ (Mereka menjawab: “(Itu) adalah mimpi-mimpi yang kosong) Yakni ini merupakan mimpi kosong belaka. Makna (الحلم) yakni mimpi bohong yang tidak sesuai kenyataan seperti halnya bisikan-bisikan dalam hati dan was-was setan. وَمَا نَحْنُ بِتَأْوِيلِ الْأَحْلٰمِ بِعٰلِمِينَ (dan kami sekali-kali tidak tahu menta’birkan mimpi itu) Yakni bukan pentakwil mimpi kosong seperti itu. Terdapat pendapat mengatakan bahwa mereka bermaksud menghapus mimpi itu dari pikiran sang raja agar tidak sibuk memikirkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Seorang ahli berkata: “mimpi ini merupakan campuran dari beberapa mimpi yaitu berupa kekhawatiran dan imajinasi belaka. Kami tidak bisa menafsirkan mimpi yang kosong, sehingga menurut kami mimpi itu tidak bermakna”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab,“mimpi-mimpi yang campur aduk} yang campur aduk {dan kami sekali-kali tidak mampu mengetahui mimpi itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Mereka dilanda kebingungan, tidak mengetahui takwil mimpi itu sama sekali. ”mereka menjawab’(itu) adalah mimpi mimpi yang kosong” mimpi mimpi yang tidak memiliki hasil apapun dan tidak mempunyai penakwilan. Ini adalah kemantapan pendapat dari mereka atas perkara yang tidak mereka ketahui dan pengajuan alasan dari mereka dengan sesuatu yang tidak pantas untuk dijadikan alasan. Kemudian, mereka berkata, ”dan kami sekali kali tidak tahu mena’birkan mimpi itu” maksudnya, kami tidak mampu menafsirkan kecuali hanya mimpi saja. Adapun tentang bunga tidur, yang berasal dari setan atau dari bisikan hati (yang mendominasi), maka kami tidak (perlu) menafsirkannya. Akhirnya, mereka memadukan antara ketidaktahuan dan ketidaktegasan bahwa itu merupakan mimpi mimpi kosong semata, dengan sikap ujub terhadap diri sendiri, dimana mereka tidak (terus terang) mengucapkan “kami tidak mengetahui penakwilannya!” ini termasuk perkara yang tidak sepatutnya dilakukan oleh orang orang yang menguasai agama dan berakal. Kejadian itu juga merupakan bukti perhatian Allah kepada yusuf. Seandainya dia langsung mena’birkan kandungan mimpi itu, sebelum ditawarkan oleh raja kepada orang orang terkemuka dan para ulama negeri itu lalu mereka tidak mampu menakwilkannya, maka tidak akan menimbulkan pengaruh yang membekas. Namun, ketika sang raja menyampaikannya kepada mereka dan akhirnya tidak mampu menjawab, maka sang raja akan benar benar memikirkannya. Ketika yusuf berhasil mena’birkannya, maka dia mempunyai kedudukan tinggi di sisi mereka. Ini sepadan dengan peristiwa saat Allah memperlihatkan keutamaan Adam diatas para malaikat dengan ilmu setelah Allah mengajukan petanyaan kepada mereka, tapi mereka tidak mengetahuinya. Kemudian Allah bertanya kepada Adam, maka ia mampu menjelaskan kepada mereka nama nama segala sesuatu. Melalui itu, terbuktilah kelebihannya. Sebagaimana Allah memperlihatkan keutamaan manusia yang paling utama Muhammad, di hari kiamat kelak, dengan mengihamkan makhluk makhluk untuk memohon syafaat melalui Adam kemudian Nuh, selanjutnya kepada Ibrahim, lalu Musa dan berikutnya kepada Isa. lalu mereka merasa tidak mampu memberikannya, kemudian mereka mendatangi Muhammad. Beliaupun berkata ”akulah orangnya, akulah orangnya (yang berhak memberikan syafa’at)” maka beliaupun mengusahakan syafa’at bagi semua makhluk dan berhasil merengkuh maqam Mahmud (kedudukan terpuji) yang diincar orang orang terdahulu dan orang orang akhir zaman. Mahasuci Dzat yang kelembutanNYa tersembunyi dan teliti dalam mencurahkan kebaikan dan kenikmatan bagi orang orang pilihan dan wali waliNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَضۡغَٰثُ أَحۡلَٰمٖۖ) adhghaatsu ahlam : mimpi khayalan, tidak ada takwilnya. Makna ayat : Mereka lantas menjawab—sebagaimana yang Allah kabarkan—( قَالُوٓاْ أَضۡغَٰثُ أَحۡلَٰمٖۖ) “Mimpi anda adalah mimpi kosang yang tidak ada takwilnya,--mereka berkata lagi—( وَمَا نَحۡنُ بِتَأۡوِيلِ ٱلۡأَحۡلَٰمِ بِعَٰلِمِينَ) kami tidak bisa menakwil mimpi-mimpi yang seperti itu.” Maksud al-adhghaats : campur aduk, tidak jelas. Dalam hadits shahih (الرُّؤْيَا مِنَ الرَّحْمَنِ وَ الحُلْمُ مِنَ الشَّيْطَانِ) “Mimpi yang benar dari Ar-Rahman (Allah) dan mimpi buruk datang dari setan.” Pelajaran dari ayat : • Mimpi ada dua, mimpi buruk dari setan dan mimpi yang baik dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 44: Mereka menggabung antara ketidaktahuan dengan memastikan (karena sikap ‘ujub), bahwa mimpi itu adalah mimpi yang kosong, padahal tidak demikian. Hal ini sudah tentu tidak patut dilakukan oleh orang-orang yang berilmu dan orang-orang yang cerdas. Akan tetapi, raja sangat penasaran sekali terhadap mimpi itu, yang kemudian pemberi minum raja ingat tentang Yusuf dan menyampaikan mimpi itu kepadanya, lalu Yusuf menakwilkan mimpinya. Yang demikian sama seperti ketika Allah memperlihatkan keunggulan Adam di atas malaikat dalam hal ilmu setelah Dia bertanya kepada mereka, namun mereka (para malaikat) tidak sanggup menjawab, lalu Allah memerintahkan Adam untuk menjawab, maka ia pun memberitahukan kepada para malaikat nama-nama segala sesuatu, sehingga nampaklah keunggulannya. Demikian pula sebagaimana Allah menampakkan kelebihan Nabi Muhammad shallallahu 'alaihi wa sallam di atas para nabi yang lain pada hari kiamat dengan mengilhamkan kepada makhluk untuk mendatangi para nabi agar mereka memberi syafaat di hadapan Allah, dari mulai Adam, Nuh, Ibrahim, Musa dan Isa, namun mereka semua mengemukakan alasan tidak sanggup, hingga kemudian mereka datangi Nabi Muhammad shallallahu 'alaihi wa sallam, dan Beliaulah yang sanggup."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 44",
    "description": "Kemudian mereka para pemuka kaumnya pun menjawab, itu hanyalah bunga tidur dan termasuk dari mimpi-mimpi yang kosong tidak ada artinya dan oleh karena itu kami tidak mampu menakwilkan mimpi itu. Dan ketika mendengar mimpi raja itu, berkatalah orang yang selamat dari hukuman mati di antara mereka berdua yang dahulu pernah dipenjara bersama nabi yusuf. Dan ia pun baru teringat akan pesan nabi yusuf kepadanya setelah beberapa waktu lamanya yang ia lupakan, aku akan memberitahukan kepadamu wahai paduka tentang orang yang pandai menakwilkan mimpi itu, maka karena itu utuslah aku menemuinya untuk menyampaikan perihal mimpimu itu."
  }
]