[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berkatalah orang yang selamat dari hukuman mati dari dua teman yusuf di dalam penjara, dan diapun teringat setelah sekian lama lupa tentang yusuf, ”aku akan memberitahukan kepada kalian dengan tafsir mimpi ini. Maka utuslah aku kepada yusuf supaya aku dapat membawakan tafsirnya kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Tiba-tiba si penyedia minuman raja yang selamat dari hukuman mati, yang termasuk salah satu dari dua orang yang dipenjara, teringat akan Yusuf -'alaihissalām- dan ilmu takwil mimpi yang dimilikinya setelah sekian lama dan berkata, \"Aku bisa memberitahu kalian tentang takwil mimpi yang dilihat oleh raja setelah aku bertanya kepada orang yang mengetahui takwilnya. Oleh karena itu -wahai tuan raja- kirimlah aku ke tempat Yusuf agar dia menakwilkan mimpi anda.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Pemberi minum khamr raja berkata setelah mengingat wasiat Yusuf kepadanya setelah sekian lama dia lupakan: “Aku akan memberitahukanmu tafsir mimpi ini, maka utuslah aku kepada Yusuf dalam penjara agar dia memberitahukanku tafsir itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَقَالَ الَّذِى نَجَا مِنْهُمَا (Dan berkatalah orang yang selamat diantara mereka berdua) Yakni diantara dua budak tersebut, yaitu si tukang memberi minum. وَادَّكَرَ(dan teringat (kepada Yusuf)) Yakni tukang memberi minum itu teringat kepada nabi Yusuf dan keahliannya dalam mentakwil mimpi yang telah ia saksikan. بَعْدَ أُمَّةٍ(sesudah beberapa waktu lamanya) Setelah beberapa waktu, yakni dalam jumlah tahun yang telah nabi Yusuf habiskan di dalam penjara. أَنَا۠ أُنَبِّئُكُم بِتَأْوِيلِهِۦ(Aku akan memberitakan kepadamu tentang (orang yang pandai) mena’birkan mimpi itu) Yakni aku akan memberitahumu takwilnya setelah aku menanyakannya kepada Yusuf yang memiliki keahlian dalam takwil mimpi. فَأَرْسِلُونِ(maka utuslah aku (kepadanya)) Ia bercakap dengan raja dengan penuh penghormatan, meminta agar ia diutus kepada nabi Yusuf agar memberitahukannya mimpi sang raja kemudian kembali kepadanya dengan takwil dari mimpinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam surah Yusuf dikatakan kepada sang raja dengan sighoh jamak : { أَنَا أُنَبِّئُكُمْ بِتَأْوِيلِهِ فَأَرْسِلُونِ } , dan dalam surah Yunus : { عَلَىٰ خَوْفٍ مِنْ فِرْعَوْنَ وَمَلَئِهِمْ } mukhotob adalah fir'aun namun dijamak, dan dalam surah al-qhosos : { لَا تَقْتُلُوهُ عَسَىٰ أَنْ يَنْفَعَنَا } sang istri berkata kepada fir'aun juga dengan sighoh jamak; semua ayat ini menjadi dalil bahwa dibolehkannya berbicara kepada para raja dengan menggunakan shigoh jamak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Salah satu dari 2 laki-laki yang selamat ari hukuman, yaitu pembawa minuman berkata dan mengingat Yusuf setelah beberapa waktu: “Aku akan memberitahu kalian tentang tafsir mimpi ini dengan bertanya orang yang bisa menafsifkannya. Maka utuslah aku kepada Yusuf di penjara supaya aku bisa menceritakan kepdanya tentang mimpi itu sehingga dia memberitahuku tentang tafsirnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang yang selamat di antara mereka berdua berkata} pemberi minuman yang selamat dari dua pemuda yang ada di penjara berkata {dan teringat} ingat tentang perihal Yusuf {setelah beberapa waktu} setelah beberapa waktu {“Aku akan memberitahu kalian} memberitahu kalian {tentang takwil mimpi itu. Maka utuslah aku} maka utuslah aku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “dan berkatalah orang yang selamat diantara mereka berdua” dari dua pemuda tadi, yaitu orang yang bermimpi melihat dirinya memeras anggur untuk dijadikan minuman khamar. Dialah orang yang dititipi pesan oleh yusuf untuk mengingatkan tentang keadaanya kepada tuannya. ”dan teringat (kepada yusuf) sesudah beberapa waktu lamanya” maksudnya dan ia mengingat yusuf beserta peristiwa yang terjadi pada dirinya dalam pena’biran yang dilakukan yusuf terhadap mimpi mereka berdua serta pesan yang disampaikannya kepada dirinya. Dia pun tahu, bahwa yusuf akan menyelesaikan penakwilan mimpi ini. (ingatannya tergugah) setelah beberapa waktu lamanya. Dia pun berkata, ”aku akan memberitakan kepadamu tentang (orang yang pandai) mena’birkan mimpi itu, maka utuslah aku (kepadanya)” kepada yusuf aku ingiin menayakan mimpi itu kepadanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَٱدَّكَرَ بَعۡدَ أُمَّةٍ) waddakara ba’da ummah : ingat setelah beberapa masa, kurang lebih tujuh tahun. Makna ayat : Kemudian firman-Nya : (وَقَالَ ٱلَّذِي نَجَا مِنۡهُمَا) yaitu salah satu yang selamat dari dua narapidana, (وَٱدَّكَرَ بَعۡدَ أُمَّةٍ) ia baru ingat setelah beberapa tahun—kurang lebih tujuh tahun—permintaan Yusuf ketika berpisah di dekat pintu penjara ketika ia berkata, (ٱذۡكُرۡنِي عِندَ رَبِّكَ) “Sebut-sebut aku disisi rajamu.” Ia berkata sebagaimana yang Allah kabarkan : (أَنَا۠ أُنَبِّئُكُم بِتَأۡوِيلِهِۦ فَأَرۡسِلُونِ) “Akan aku kabarkan kepada kalian takwil dari mimpi itu, jadi utuslah aku kepada Yusuf—ia sekarang berada di penjara—karena ia mampu mentakwil mimpi, kemudian mereka mengutus pelayan itu kepada Yusuf dan masuk menemuinya. Pelajaran dari ayat : • Lupa bagi seseorang itu manusiawi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 45: Yaitu si pemberi minum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 45",
    "description": "Dan ketika mendengar mimpi raja itu, berkatalah orang yang selamat dari hukuman mati di antara mereka berdua yang dahulu pernah dipenjara bersama nabi yusuf. Dan ia pun baru teringat akan pesan nabi yusuf kepadanya setelah beberapa waktu lamanya yang ia lupakan, aku akan memberitahukan kepadamu wahai paduka tentang orang yang pandai menakwilkan mimpi itu, maka karena itu utuslah aku menemuinya untuk menyampaikan perihal mimpimu itu. Kemudian pelayan raja pun bergegas menjumpai nabi yusuf lalu berkata, yusuf, wahai orang yang sangat dipercaya tutur katanya! terangkanlah kepada kami takwil mimpi raja tentang tujuh ekor sapi betina yang gemuk yang dimakan oleh tujuh ekor sapi betina yang kurus, kemudian ada tujuh tangkai biji gandum yang hijau dan tujuh tangkai biji gandum lainnya yang kering agar aku kembali kepada orang-orang itu untuk menyampaikan berita ini, agar mereka segera mengetahui apa arti mimpi raja tersebut."
  }
]