[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika lelaki itu sampai kepada yusuf, dia berkata kepadanya, ”yusuf, wahai orang yang selalu berkata benar, jelaskanlah kepada kami tafsir mimpi orang yang melihat tujuh ekor sapi betina yang gemuk-gemuk yang dimakan oleh sapi betina kurus-kurus.Dan ia melihat tujuh bulir yang hijau-hijau dan tujuh bulir yang kering-kering. Mudah-mudahan aku dapat kembali kepada raja dan teman0temannya, lalu aku beritahukan kepada mereka, sehingga mereka akan tahu tafsir yang aku tanyakan kepadamu, dan agar mereka mengetahui kedudukan dan keutamaanmu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Sesampainya di tempat Yusuf, ia berkata kepadanya, \"Wahai Yusuf! Wahai orang yang sangat jujur! Jelaskan padaku tentang takwil dari mimpi orang yang melihat tujuh ekor sapi betina yang gemuk-gemuk dimakan oleh tujuh ekor sapi betina yang kurus-kurus, dan melihat tujuh tangkai gandum hijau (basah) dan tujuh tangkai gandum kering. Mudah-mudahan aku bisa kembali kepada raja dan orang-orang yang ada di sisinya supaya mereka mengetahui takwil mimpi raja dan mengetahui kelebihan Anda dan kedudukan Anda.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Ketika dia bertemu Yusuf, dia berkata dengan nada rayuan: “Wahai Yusuf, orang yang sangat jujur, katakanlah kepada kami tafsir dari mimpi melihat tujuh sapi yang gemuk memakan tujuh sapi yang kurus; dan aku melihat tujuh tangkai gandum hijau dan tujuh tangkai gandum kering. Katakanlah agar aku dapat kembali kepada raja dan para menterinya supaya aku dapat memberitahu mereka, semoga mereka mengerti tafsirnya dan menyadari kelebihan dan ilmumu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. يُوسُفُ أَيُّهَا الصِّدِّيقُ أَفْتِنَا (Yusuf, hai orang yang amat dipercaya, terangkanlah kepada kami) Yakni kemudian dia pergi ke nabi Yusuf dan berkata “beritahukanlah aku takwil dari mimpi seseorang yang melihat tujuh ekor sapi dst. لَّعَلِّىٓ أَرْجِعُ إِلَى النَّاسِ (agar aku kembali kepada orang-orang itu) Kembali kepada raja dan pemuka-pemuka kaumnya. لَعَلَّهُمْ يَعْلَمُونَ(agar mereka mengetahuinya) Mengetahui takwil mimpi tersebut dan mengetahui keutamaanmu dan ilmumu dalam mentakwil mimpi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Wahai Yusuf yang sangat jujur: “Beritahulah kami tentang mimpi melihat 7 sapi betina dimakan 7 sapi betina yang lemah dan buruk, serta 7 tangkai gandum hijau yang dikalahkan oleh 7 biji lainnya yang kering. Mimpi itu dilihat oleh oleh raja. Barankali aku bisa kembali kepada mereka, yaitu raja dan pengikutnya, supaya mereka mengetahui penafsiran mimpi ini dan mengetahui keutamaan dan kedudukan pengetahuanmu, lalu kamu bisa keluar dari penjara.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Yusuf, orang yang sangat dipercaya} orang yang sangat dipercaya {jelaskanlah kepada kami tentang tujuh ekor sapi gemuk yang dimakan oleh tujuh sapi kurus dan tujuh tangkai hijau dan yang lainnya kering agar aku bisa kembali kepada orang-orang itu} raja dan para pengikutnya itu {supaya mereka mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. mereka akhirnya mengutusnya. Iapun menemui yusuf. yusuf tidak menacacinya atas kealpaannya. Bahkan langsung menyimak pertanyaan yang dia lontarkan kepadanya dan menjawabnya. Dia berseru “yusuf, hai orang yang amat dipercaya” yaitu sangat jujur dalam uacapan ucapan dan tindak tanduknya “terangkanlah kepada kami tentang tujuh ekor sapi yang gemuk gemuk yang dimakan oleh tujuh ekor sapi betina yang kurus kurus, dan tujuh butir (gandum) yang hijau dan tujuh lainnya yang kering agar aku kembali kepada orang orang itu, agar mereka mengetahui ” karena mereka benar benar beranimo untuk mengetahui ta’birnya, yaitu ta’bir sebuah mimpi yang telah membebani pikiran mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يُوسُفُ أَيُّهَا ٱلصِّدِّيقُ) yuusufu ayyuhash shiddiiq : wahai Yusuf yang jujur, sering berkata jujur. Hal itu diketahui selama mereka mereka masih di penjara. Makna ayat : Pelayan itu berkata kepada Yusuf, (يُوسُفُ) “Wahai Yusuf, (أَيُّهَا ٱلصِّدِّيقُ أَفۡتِنَا فِي سَبۡعِ بَقَرَٰتٖ سِمَانٖ يَأۡكُلُهُنَّ سَبۡعٌ عِجَافٞ وَسَبۡعِ سُنۢبُلَٰتٍ خُضۡرٖ وَأُخَرَ يَابِسَٰتٖ) orang yang jujur, kabarkan lah takwil dari tujuh sapi gemuk yang dimakan tujuh sapi kurus dan tujuh ranting hijau dan tujuh ranting kering, (لَّعَلِّيٓ أَرۡجِعُ إِلَى ٱلنَّاسِ) agar aku bisa mengkabarkan hasilnya kepada orang-orang—sang raja dan para pejabatnya—( لَعَلَّهُمۡ يَعۡلَمُونَ ) supaya mereka mengetahui takwilmu ini dan mendapat manfaat darinya. Pelajaran dari ayat : • Boleh mensifati seseorang sesuai dengan keadaan orang tersebut, dengan syarat tidak berlebihan, seperti (أَيُّهَا ٱلصِّدِّيقُ) “Wahai orang yang jujur.” • Kata (لعل) bermakna (كي) artinya: supaya, agar—untuk menjelaskan sebab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 46: Yusuf tidak bersikap keras kepadanya karena melupakannya, bahkan ia tetap mendengarkan kata-katanya dan mau menjawab takwil mimpi itu. Yakni raja dan para pemukanya. Karena mereka ingin sekali mengetahui takwilnya dan sampai membuat mereka sibuk memikirkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 46",
    "description": "Kemudian pelayan raja pun bergegas menjumpai nabi yusuf lalu berkata, yusuf, wahai orang yang sangat dipercaya tutur katanya! terangkanlah kepada kami takwil mimpi raja tentang tujuh ekor sapi betina yang gemuk yang dimakan oleh tujuh ekor sapi betina yang kurus, kemudian ada tujuh tangkai biji gandum yang hijau dan tujuh tangkai biji gandum lainnya yang kering agar aku kembali kepada orang-orang itu untuk menyampaikan berita ini, agar mereka segera mengetahui apa arti mimpi raja tersebut. Setelah mendengar penuturan pelayan istana perihal mimpi raja, dia'nabi yusuf'pun berkata, menanggapi mimpi itu saya menyarankan agar kamu segera mempersiapkan diri bercocok tanam selama tujuh tahun berturut-turut sebagaimana biasa; kemudian apa yang kamu tuai hendaklah kamu biarkan tetap di tangkainya, supaya bisa bertahan lama ketika disimpan di tempat yang aman, kecuali sedikit dari hasil panen itu yang kamu ambil untuk kamu makan pada masa kini."
  }
]