[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf brkata kepada penanyanya soal mimpi raja tersebut, ”tafsir mimpi ini adalah bahwa hendaknya kalian menanam selama tujuh tahun berturut-turut dengan tekun agar hasil panen menjadi melimpah. Lalu hasil panen yang kalian hasilkan darinya setiap kali,maka simpanlah dan biarkan dalam bulir-bulirnya, supaya sempurna proses penyimpanannya dari gangguan ulat dan lebih bertahan lama, kecuali sebagian kecil saja yang kalian makan dari hasil-hasi biji-bijian itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Yusuf -'alaihissalām- menakwilkan mimpi itu dengan mengatakan, \"Kalian harus bercocok tanam dengan sungguh-sungguh selama tujuh tahun berturut-turut. Kemudian hasil panen yang kalian dapatkan setiap tahunnya selama tujuh tahun itu biarkan tetap melekat pada tangkainya agar tidak rusak oleh ngengat. Kecuali sedikit saja yang kalian butuhkan untuk dimakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Yusuf menjawab pertanyaan itu: “Makna mimpi ini adalah kalian harus menaman bahan makanan selama tujuh tahun berturut-turut dengan penuh kesungguhan, dan apa yang kalian panen dari tanaman itu setiap tahunnya harus kalian biarkan tetap pada tangkainya agar dapat menjaganya dari kerusakan; namun sisakan sedikit dari hasil panen itu untuk kalian makan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. قَالَ تَزْرَعُونَ سَبْعَ سِنِينَ دَأَبًا (Yusuf berkata: “Supaya kamu bertanam tujuh tahun (lamanya) sebagaimana biasa) Yakni secara berturut-turut. Nabi Yusuf mentakwilkan tujuh sapi betina yang gemuk-gemuk dengan tujuh tahun yang subur, dan tujuh sapi betina yang kurus-kurus dengan tujuh tahun kekeringan. Demikian pula mentakwilkan tujuh bulir gandum yang hijau dan tujuh bulir gandum kering. Ia berdalil dalam takwil tentang tujuh bulir gandum yang hijau dengan perkataannya: فَمَا حَصَدتُّمْ فَذَرُوهُ فِى سُنۢبُلِهِۦٓ “maka apa yang kamu tuai hendaklah kamu biarkan dibulirnya” Yakni biarkanlah apa yang kalian panen disetiap tahun yang subur itu tetap pada tangkainya, dan janganlah kalian rontokkan agar tidak rusak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini merupakan asal dari mustolah bahwa diantara masalahat dari syari'at adalah menjaga keutuhan agama, jiwa, akal, nasab, dan harta; maka dari itu semua yang masuk dalam kategori perkata-perkara di atas adalah maslahat, dan apapun yang terbuang dari perkara-perkara di atas adalah mafsadah, dan menjaganya adalah maslahat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Yusuf berkata: “Bertanamlah selama 7 tahun secara berkelanjutan sesuatu kebiasaan kalian yang selalu dilakukan. Itu adalah tafsif dari 7 sabi betina yang gemuk dan 7 gandum yang hijau. Lalu apa yang kalian panen setiap tahun itu simpanlah di dalam tangkainya supaya tidak dimakan cacing kecuali hanya sedikit dari makanan yang dikhususkan pada tahun-tahun tersebut. Pelajarilah hal itu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yusuf berkata,“Bercocok tanamlah selama tujuh tahun berturut-turut} berturut-turut dengan serius {Kemudian apa yang kalian panen, biarkanlah} biarkanlah {di tangkainya, kecuali sedikit untuk kalian makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. yusuf menakwilkan tujuh ekor sapi yang gemuk gemuk dan tujuh butir (gandum) yang hijau bahwa itu adalah masa tujuh tahun yang subur. Sedangkan tujuh ekor sapi betina yang kurus kurus dan tujuh bulir (gandum) yang kering kering bahwa itu merupakan masa tujuh tahun penuh dengan paceklik. Boleh jadi sisi penjelasan adalah wallahu 'alam bahwasannya masa subur dan paceklik menjadi acuan penggarapan tanaman. Apabila terjadi masa kesuburan, maka tanaman dan tetumbuhan menjadi kuat. Pemandangannya pun indah dan hasil panennya pun banyak. Sedangkan pada masa paceklik, keadaan menjadi sebaliknya. Dahulu, pada umumnya sapilah yang digunakan untuk membajak tanah dan mengairi tanaman. Bulir gandum merupakan makanan pokok paling penting dan paling utama. Dia menakwilkan demikian, lantaran adanya relevansi. Dalam menafsirkan mimpi itu kepada mereka, dia memadukan antara penakwilan mimpi dengan petunjuk mengenai kebijakan yang harus mereka kerjakan dan persiapan yang mereka lakukan berupa pengelolaan (hasil panen) di musim subur sampai musim paceklik. Ia berkata, ”supaya kamu bercocok tanam tujuh tahun (lamanya) sebagaimana biasa” berturut turut ”maka apa yang kamu tuai” dari tanaman itu ”hendaklah kamu tinggalkan” kamu biarkan “dibulirnya” karena akan lebih menjamin keawetannya dan akan semakin jarang diperhatikan (sehingga tidak dikonsumsi) “kecuali sedikit untuk kamu makan” aturlah(juga)kuantitas makanan kalian di musim musim subur, hendaknya porsinya sedikit, agar simpanan kalian banyak, kemanfaatannya dan peranannya pun besar."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (دَأَبٗا) da’abaa : seperti biasanya. (فَذَرُوهُ فِي سُنۢبُلِهِۦٓ) fadzruuhu fii sumbulih : tinggalkan ia ditempatnya, jangan dipanen. Makna ayat : Firman-Nya ta’ala : (قَالَ تَزۡرَعُونَ) dan seterusnya, adalah jawaban Yusuf untuk pertanyaan takwil mimpi raja beliau berkata menjelaskan, (تَزۡرَعُونَ) bercocok tanamlah (سَبۡعَ سِنِينَ دَأَبٗا) menanamlah selama tujuh tahun berturut-turut—sebagaimana kebiasaan kalian. Ini adalah takwil dari ‘tujuh sapi gemuk’. (فَمَا حَصَدتُّمۡ) apa yang kalian panen (فَذَرُوهُ فِي سُنۢبُلِهِۦٓ) maka biarkan ia ditempatnya, jangan dipanen agar ia tidak rusak (إِلَّا قَلِيلٗا مِّمَّا تَأۡكُلُونَ), panenlah sedikit yang akan kalian makan. Pelajaran dari ayat : • Dahulu negeri Mesir adalah negeri pertanian. • Menyimpan kelebihan panen pada lumbung dan tempat yang lain merupakan prinsip perekonomian yang penting dan bermanfaat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 47: Sebagai takwil tujuh sapi yang gemuk. Karena yang demikian lebih dapat memelihara kelestariannya. Yakni atur pula makananmu di tahun-tahun yang sering hujan, jangan terlalu banyak yang dihabiskan untuk disimpan sebagai persiapan menghadapi waktu-waktu sulit. Dalam ayat ini terdapat anjuran bagi kita mengatur harta sehemat mungkin, yakni tidak menghambur-hamburkannya agar ketika tiba waktu-watu sulit, kita tidak terlalu kekurangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 47",
    "description": "Setelah mendengar penuturan pelayan istana perihal mimpi raja, dia'nabi yusuf'pun berkata, menanggapi mimpi itu saya menyarankan agar kamu segera mempersiapkan diri bercocok tanam selama tujuh tahun berturut-turut sebagaimana biasa; kemudian apa yang kamu tuai hendaklah kamu biarkan tetap di tangkainya, supaya bisa bertahan lama ketika disimpan di tempat yang aman, kecuali sedikit dari hasil panen itu yang kamu ambil untuk kamu makan pada masa kini. Kemudian setelah tujuh tahun masa subur itu berlalu, akan datang tujuh tahun musim kemarau yang sangat sulit. Masa sulit yang akan berlalu nanti kamu akan menghabiskan apa yang kamu simpan untuk menghadapinya berupa bahan makanan pokok, kecuali sedikit dari apa yang kamu simpan pada masa subur itu."
  }
]