[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian akan datang Setelah tujuh tahun yang makmur itu, tujuh tahun paceklik yang amat sulit, orang-orang memakan apa yang telah mereka simpan sebelumnya untuk menghadapinya, kecuali sedikit saja yang mereka pertahankan dan simpan untuk menjadi benih-benih tanaman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Setelah tujuh tahun yang subur di saat kalian bisa bercocok tanam dengan baik itu akan datang tujuh tahun yang kering di saat manusia akan memakan semua hasil panen yang terkumpul selama tujuh tahun yang subur itu, kecuali sedikit saja yang kalian simpan untuk persediaan bibit."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-49. Kemudian setelah tujuh tahun yang subur ini akan datang tujuh tahun kemarau, namun kalian dapat memakan makanan yang telah kalian simpan; namun sisakan sedikit untuk kalian tanam di masa mendatang. Kemudian setelah tujuh tahun kemarau ini datanglah tahun di mana Allah menyelamatkan manusia dengan hujan lebat, sehingga kalian dapat membuat perasan buah-buahan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. ثُمَّ يَأْتِى مِنۢ بَعْدِ ذٰلِكَ (Kemudian sesudah itu akan datang) Yakni setelah tujuh tahun yang subur itu. سَبْعٌ شِدَادٌ(tujuh tahun yang amat sulit) Yakni tujuh tahun kekeringan yang sangat sulit untuk dilalui manusia. يَأْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ(yang menghabiskan apa yang kamu simpan untuk menghadapinya) Yakni dari biji-bijian yang kalian simpan pada tangkainya itu. إِلَّا قَلِيلًا مِّمَّا تُحْصِنُونَ(kecuali sedikit dari (bibit gandum) yang kamu simpan) Yakni biji-biji gandum yang kalian simpan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Lalu setelah tahun-tahun kesuburan itu akan datang 7 tahun kegersangan dan kesulitan. Itu adalah tafsir dari 7 sapi kurus yang lemah. Penduduk Mesir akan memakan makanan yang kalian simpan untuk mereka (makanan untuk beberapa tahun itu mengandung makna mubalaghah) kecuali hanya sedikit dari yang kalian simpan sebagai benih untuk menanam di waktu mendatang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian sesudah itu akan datang tujuh masa yang sangat sulit} tujuh tahun kekeringan {yang menghabiskan apa yang kalian simpan untuk menghadapinya} yang memakan apa yang kalian simpan untuk menghadapinya {kecuali sedikit dari apa yang kalian simpan} yang kalian simpan sebagai benih tanaman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “kemudian sesudah itu akan datang” pascatujuh musim yang subur “tujuh tahun yang amat sulit” musim paceklik “yang menghabiskan sesuatu yang kamu simpan untuk menghadapinya (tahun sulit)” akan menghabiskan semua yang kalian simpan meskipun jumlahnya berlimpah “kecuali sedikit dari bibit gandum yang akan kamu simpan” yaitu yang tidak kalian persiapkan untuk menghadapi musim musim yang berat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سَبۡعٞ شِدَادٞ) sab’un syidad : sangat sulit karena musim paceklik. (مِّمَّا تُحۡصِنُونَ) mimmaa tuhshinuun : kalian simpan dan timbun untuk pembibitan atau kebutuhan yang lainnya. Makna ayat : (ثُمَّ يَأۡتِي مِنۢ بَعۡدِ ذَٰلِكَ) Kemudian datanglah setelah masa-masa subur, (سَبۡعٞ شِدَادٞ) kemarau dan paceklik yang menyulitkan. Inilah makna ‘tujuh sapi kurus’ (يَأۡكُلۡنَ مَا قَدَّمۡتُمۡ لَهُنَّ) yang akan memakan apa yang siapkan untuk menghadapinya, (مَا قَدَّمۡتُمۡ لَهُنَّ) biji-bijian yang kalian simpan selama masa subur untuk kalian makan selama masa paceklik, (إِلَّا قَلِيلٗا مِّمَّا تُحۡصِنُونَ ) kecuali sedikit dari apa yang simpan untuk pembibitan atau yang selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 48: Sebagai takwil tujuh sapi yang kurus. Yaitu biji yang ditanam pada tahun-tahun, di mana hujan masih sering turun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 48",
    "description": "Kemudian setelah tujuh tahun masa subur itu berlalu, akan datang tujuh tahun musim kemarau yang sangat sulit. Masa sulit yang akan berlalu nanti kamu akan menghabiskan apa yang kamu simpan untuk menghadapinya berupa bahan makanan pokok, kecuali sedikit dari apa yang kamu simpan pada masa subur itu. Setelah musim kemarau itu berlalu, akan datang tahun di mana manusia diberi hujan dengan cukup sehingga tanaman dapat tumbuh subur kembali dan pada masa subur itu mereka bisa memeras kembali anggur sebagai minuman yang lezat lagi segar."
  }
]