[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian setelah tahun-tahun kekeringan tersebut datanglah tahun di mana manusia dilimpahi padanya dengan air hujan, lalu Allah mengangkat kesulitan dari mereka, dan mereka dapat memeras buah-buahan padanya karena kesuburan yang merata dan hasil yang melipah ruah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Kemudian setelah tahun-tahun yang kering itu akan datang satu tahun di saat hujan turun dengan baik dan tanam-tanaman bisa tumbuh subur. Dan pada tahun itu manusia bisa memeras hasil pertanian yang perlu mereka peras, seperti anggur, zaitun dan tebu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. ثُمَّ يَأْتِى مِنۢ بَعْدِ ذٰلِكَ عَامٌ فِيهِ يُغَاثُ النَّاسُ (Kemudian setelah itu akan datang tahun yang padanya manusia diberi hujan) Dan bisa jadi ia mengetahui hal itu karena tujuh tahun kekeringan itu tidak akan berakhir kecuali dengan datangnya tahun yang subur. Dan yang dimaksud adalah akan datang kepada mereka jalan keluar dari Allah. Yakni dengan meluapnya air sungai Nil, kerena pertanian mereka bergantung pada sungai Nil dan bukan pada air hujan. وَفِيهِ يَعْصِرُونَ (dan dimasa itu mereka memeras anggur) Yakni mereka memeras buah-buahan atau biji—bijian yang dapat diampil sarinya seperti anggur dan wijen. Nabi Yusuf memberitahu mereka dengan sesuatu yang tidak ditanyakan kepadanya, dan kemungkinan ini adalah ilmu yang didapatkannya dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Kemudian setelah tahun-tahun kekeringan ini akan datang tahun dimana manusia ditolong dengan turunnya hujan dan akan datang kemudahan tuhan melalui luapan sungai nil untuk mengairi tanaman mereka, bukan dari hujan. Dalam tahun itu mereka memeras sesuatu yang bisa diperas seperti anggur, zaitun dan wijen. Semua itu adalah pelajaran dari Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian setelah itu akan datang tahun, ketika manusia diberi hujan dan pada masa itu mereka memeras anggur} pada masa itu manusia memeras sesuatu yang bisa mereka peras yaitu anggur, tebu dan zaitun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “kemudian setelah itu akan datang” tujuh tahun yang berat ”tahun yang padanya manusia diberi hujan (dengan cukup) dan dimasa itu mereka memeras anggur” maksudnya, pada tahun itu, curah hujan dan aliran air akan deras. Hasil panenpun melimpah, melebihi kebutuhan pokok mereka sehingga mereka dapat memeras anggur dan lainnya, sebagai bentuk keberlimpahan makanan mereka. Mungkin saja keterangan nabi yusuf tentang keberadaan tahun yang subur ini, padahal tidak disebutkan dengan jelas dalam mimpi sang raja, adalah karena beliau memahami dari penakwilan tujuh tahun yang berat, bahwa tahun berikutnya, kesengsaraan itu akan sirna. Dan sudah diketahui bersama, masa paceklik yang berlanjut selama tujuh tahun secara berturutan tidak akan hilang (bekasnya) melainkan dengan satu musim yang sangat subur sekali. kalau tidak demikian, maka prediksi ini tidak ada manfaatnya. Tatkala utusan sudah kembali kehadapan raja dan orang orang, dan memberitahukan pena’biran yang dilakukan oleh yusuf terhadap mimpi itu, maka mereka takjub mendengarnya dan sangat berbahagia karenanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يُغَاثُ ٱلنَّاسُ) yughaatsun naas : Allah menurunkan kepada manusia hujan, dan sungai Nil kembali mengalir. (وَفِيهِ يَعۡصِرُونَ ) wa fiihi ya’shiruun : mereka memeras tanaman yang bisa diperas seperti: zaitun, anggur, dan tebu. Makna ayat : Firman Allah (ثُمَّ يَأۡتِي مِنۢ بَعۡدِ ذَٰلِكَ عَامٞ فِيهِ يُغَاثُ ٱلنَّاسُ وَفِيهِ يَعۡصِرُونَ) kemudian datang setelah tujuh masa paceklik tersebut, tahun manusia disirami dengan hujan, dan mereka memeras anggur, zaitun, atau tanaman yang dapat diperas. Firman-Nya : (ثُمَّ يَأۡتِي مِنۢ بَعۡدِ ذَٰلِكَ عَامٞ) “Kemudian datang setelahnya tahun...” hingga selesai. Semua ini bukan berdasarkan mimpi, namun atas apa yang Allah ajarkan kepada Yusuf, lalu ia memberi manfaat kepada mereka dengannya tanpa mereka harus bertanya dahulu, sebagai bentuk kasih sayang Allah kepada Yusuf dan atas hikmah yang agung yang Allah kehendaki, Dia-lah Yang Maha Bijaksana dan Maha Mengetahui. Pelajaran dari ayat : • Kesempurnaan Yusuf dalam menakwilkan mimpi merupakan hal yang luar biasa. • Keutamaan Yusuf ‘alaihi salam atas penduduk Mesir, karena ia memberi penjelasan lebih daripada yang mereka tanyakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 49: Syaikh As Sa’diy dalam tafsirnya menerangkan sisi kesesuaiannya -dan Allah lebih mengetahui- bahwa menggarap ladang tergantung subur dan keringnya tanah. Ketika tanah subur, maka tanaman dan ladang semakin kuat, baik dan banyak hasilnya, sedangkan ketika kering tidak demikian. Adapun sapi, dialah yang menggarap tanah itu dan dipakai pada umumnya untuk menyiraminya, dan biji (dari tangkai) adalah makanan pokok utama, maka Yusuf menakwilkan seperti itu karena adanya kesesuaian. Beliau menggabung dalam takwilnya antara menerangkan maksud mimpi itu dan menunjukkan kepada mereka apa yang perlu mereka lakukan untuk menghadapinya seperti yang diterangkan dalam ayat di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 49",
    "description": "Setelah musim kemarau itu berlalu, akan datang tahun di mana manusia diberi hujan dengan cukup sehingga tanaman dapat tumbuh subur kembali dan pada masa subur itu mereka bisa memeras kembali anggur sebagai minuman yang lezat lagi segar. Setelah nabi yusuf menceritakan takwil mimpi raja dengan rinci dan jelas kepada pelayan raja dan iapun menyampaikannya kepada sang raja, pada ayat ini dijelaskan tentang permintaan raja untuk memanggil nabi yusuf setelah mendengarkan perihal tafsir mimpinya itu dan raja berkata kepada para pembantunya, bawalah dia'yusuf'kepadaku. Ketika utusan itu datang kepadanya dan memintanya menghadap raja, dia'nabi yusuf'pun berkata, kembalilah kepada tuanmu dan tanyakan kepadanya bagaimana halnya perempuan-perempuan yang telah melukai tangannya sendiri tatkala aku keluar dihadapan mereka. Hal ini disampaikan nabi yusuf agar pembebasannya jelas dan kebenaran terungkap. Sungguh, tuhanku maha mengetahui tipu daya dan muslihat mereka terhadapkusehingga tidak ada yang bisa disembunyikan dari-Nya. Vonis hukuman yang dijatuhkan, maupun pembebasan seseorang dari hukuman, seharusnya disertai bukti yang kuat, bukan sekadar alasan dan dugaan."
  }
]