[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’qub berkata kepada putranya, yusuf, ”wahai putraku, janganlah kamu sebutkan mimpi ini kepada saudara-saudara lelakimu, nanti mereka akan dengki kepadamu, lalu memusuhimu dan merencanakan makar untuk membinasakanmu. Sesungguhnya setan bagi manusia adalah musuh yang jelas permusuhannya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Ya'qūb berkata kepada putranya, Yusuf, \"Wahai Anakku! Jangan engkau ceritakan mimpimu itu kepada saudara-saudaramu! Karena mereka bisa memahaminya kemudian merasa iri hati kepadamu. Lalu mereka akan membuat rencana jahat terhadapmu karena terdorong rasa iri dan dengki. Sesungguhnya setan adalah musuh yang nyata bagi manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Nabi Ya’qub berkata kepadanya dengan kebijakan seorang ayah dan perkataan seorang nabi: “Wahai anakku, janganlah kamu ceritakan mimpi ini kepada saudara-saudaramu, agar mereka tidak merasa iri, sehingga mereka dapat membuat tipu daya untuk membinasakanmu atau membuangmu. Sungguh setan yang terlaknat adalah musuh yang jelas bagi manusia, dia membuat kekerasan antar saudara dan memanasi hati mereka agar timbul perpecahan di antara mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. قَالَ يٰبُنَىَّ لَا تَقْصُصْ رُءْيَاكَ عَلَىٰٓ إِخْوَتِكَ (Ayahnya berkata: “Hai anakku, janganlah kamu ceritakan mimpimu itu kepada saudara-saudaramu) Nabi Ya’kub melarang nabi Yusuf, anaknya, untuk menceritakan mimpinya kepada para saudaranya karena Nabi Ya’kub telah mengetahui takwil mimpi itu, dan ia khawatir jika ia menceritakannya kepada para saudaranya maka mereka juga akan memahami takwilnya sehingga timbul dalam diri mereka kedengkian kepadanya. فَيَكِيدُوا۟ لَكَ كَيْدًا ۖ(maka mereka membuat makar) Yakni karena aku khawatir mereka akan membuat tipu daya yang tidak kamu pahami, sehingga mereka akan membinasakanmu karena kedengkian mereka. إِنَّ الشَّيْطٰنَ لِلْإِنسٰنِ عَدُوٌّ مُّبِينٌ (Sesungguhnya syaitan itu adalah musuh yang nyata bagi manusia) Sehingga menggiring mereka untuk melakukan hal tersebut, sebab dia merupakan musuh bagi manusia yang terang-terangan dalam permusuhannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ya'kub -'alaihissalam- faham tentang tafsir mimpi, namun ia tidak memperdulikan hal itu untuk disampaikan kepada anaknya; karena seorang lelaki mengiginkan kebaikan bagi anaknya, sedangkan saudaranya tidak mengingkan bagi adiknya kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Ya’kub bin ishaq berkata: “Wahai anakku, janganlah engkau beritahu saudara-saudaramu terkait mimpi itu supaya mereka tidak dengki terhadapmu, lalu membuat rencana rahasia untuk mencelakakanmu. Dan yang terpenting adalah bisa menimbulkan fitnah di antara manusia.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Wahai anakku, janganlah ceritakan mimpimu kepada saudara-saudaramu karena mereka akan membuat tipu daya yang sungguh-sungguh kepadamu} mereka akan membuat tipu daya yang akan mencelakaimu {Sesungguhnya setan adalah musuh yang jelas bagi manusia”} jelas permusuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. usai penakwilan mimpi itu (oleh ya’qub) untuk yusuf maka sang ayah berkata kepadanya, ”hai anakku, janganlah kamu ceritakan mimpimu itu kepada saudara saudaramu, sehingga mereka membuat makar (untuk membinasakanmu” yaitu disebabkan dorongan kedengkian mereka kepadamu, lantaran engkau akan menjelma sebagai pemimpin yang mulia atas mereka. ”sesungguhnya setan itu adalah musuh yang nyata bagi manusia” ia tidak akan jemu jemu (mengganggumu) pada malam dan siang hari, dengan sembunyi sembunyi atau terang terangan. Menjauhi faktor faktor yang bisa menyebabkan setan berkuasa atas seorang hamba tentu lebih tepat, maka yusuf menaati perintah ayahnya, dia tidak memberi tahu saudara saudaranya tentang mimpinya itu, ia menyembunyikannya dari hadapan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَيَكِيدُواْ لَكَ) fayakiiduu laka : membuat tipu daya yang membahayakan mu. (عَدُوّٞ مُّبِينٞ) ‘aduwwum mubiin : benar-benar nyata permusuhannya. Makna ayat : Firman-Nya : (قَالَ يَٰبُنَيَّ) Ya’qub berkata kepada anaknya Yusuf, “Wahai anakku, (لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ) janganlah engkau ceritakan mimpi ini kepada saudara-saudaramu—yaitu saudara dari ayah. (فَيَكِيدُواْ لَكَ كَيۡدًاۖ) hasad membawa mereka melakukan tipu daya yang membahayakanmu, karena mereka mengikuti bisikan setan. (إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ ) sesungguhnya setan adalah musuh yang nyata bagi kalian. Karena dia telah mengeluarkan Adam dan Hawa dari surga, dengan menipu mereka untuk memakan buah pohon yang Allah larang. Pelajaran dari ayat : • Bolehnya berhati-hati dan waspada terhadap perkara yang penting."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 5: Nabi Ya'qub 'alaihis salam mengetahui ta’wil mimpi itu, bahwa sebelas bintang itu adalah saudaranya, matahari adalah ibunya, sedangkan bulan adalah bapaknya, dan bahwa keadaan akan berubah sehingga akan membuat semua anggota keluarganya memuliakannya. Ketika ta’wil mimpi itu jelas maksudnya bagi Yusuf, maka bapaknya berkata eperti yang disebutkan di atas. Karena mereka akan mengetahui takwilnya, bahwa engkau akan berada di atas mereka, akhirnya mereka hasad dan kan membunuhmu. Ia (setan) tidak pernah berhenti berusaha menggelincirkan kamu di malam maupun siang hari, dan berusaha mencari jalan untuk mencerai-beraikan kamu. Oleh karena itu, menjauhi sebab yang bisa membuat setan menguasai seorang hamba lebih diutamakan. Maka Nabi Yusuf ‘alaihis salam mengikuti saran bapaknya dan tidak memberitahukan kepada saudara-saudaranya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 5",
    "description": "Kemudian dia'nabi yakub'berkata kepada putranya, wahai anakku! janganlah engkau ceritakan mimpimu kepada saudara-saudaramu. Aku khawatir apabila mereka tahu, mereka akan membuat tipu daya untuk membinasakan-Mu karena kedengkian mereka. Sungguh, setan itu musuh yang jelas bagi manusia karena terus berupaya memunculkan rasa permusuhan di antara sesama. Setelah nabi yusuf menceritakan mimpi itu kepada ayahnya, lalu ayahnya mempunyai firasat bahwa mimpi tersebut mempunyai arti penting, kemudian ia pun berkata, dan demikianlah, tuhan telah memilih engkau wahai putraku yusuf, dari sekian hamba-hamba lainnya. Dan selain itu Allah akan mengajarkan kepadamu sebagian dari takwil mimpi beserta berita tentang arti-arti mimpi, dan kelak akan menyempurnakan nikmat-Nya berupa kenabian dan kerajaan kepadamu dan kepada keluarga yakub, sebagaimana dia telah menyempurnakan nikmat-Nya berupa kenabian kepada kedua orang kakekmu sebelum itu, yaitu nabi ibrahim dan nabi ishak. Sungguh, tuhanmu maha mengetahui siapa yang berhak dipilih, dan mahabijaksana dalam memberi karunia kepada orang yang dikehendaki-Nya."
  }
]