[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Raja berkata kepada wanita-wanita yang dahulu mengiris-iris tangan mereka, ”apa yang terjadi pada kalian sebenarnya, ketika kalian menggoda yusuf untuk menundukan dirinya (kepada kalian) pada hari penjamuan hidangan? apakah kalian melihat pada dirinya sesuatu yang mencurigakan?” mereka menjawab, ”kami berlindung kepada Allah. Kami tidak mengetahui padanya sekecil apapun yang mencorengnya, ”saat itulah istri sang mentri berkata, ”sekarang, jelaslah kebenaran setelah tertutupi. Akulah orang yang mencoba memfitnahnya, dengan cara menggodanya, namun dia menolak.Dan sesungguhnya dia benar-benar termasuk orang-orang yang jujur dalam semua yang diucapkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Raja bertanya kepada para wanita itu, \"Apa yang terjadi pada diri kalian ketika kalian merayu Yusuf agar mau berbuat mesum dengan kalian?\" Isteri Al-Azīz mengakui perbuatannya seraya berkata, \"Sekarang kebenaran sudah tampak terang benderang. Akulah yang berusaha merayunya. Dan dia tidak pernah merayuku. Sesungguhnya dia jujur dengan pengakuannya bahwa dirinya bersih dari apa yang kutuduhkan padanya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Maka sang raja memenuhi permintaan Yusuf, maka dia memanggil para wanita itu beserta istri menteri, kemudian bertanya kepada mereka: “Apa yang terjadi ketika kalian mengajak Yusuf berbuat keji?” Mereka menjawab dengan jawaban yang kurang jelas dan melupakan rasa cinta mereka kepada Yusuf: “Kami berlindung kepada Allah, dan kesucian bagi Yusuf; sungguh kami tidak melihat sedikitpun hal yang merusak dirinya.” Jawaban ini adalah ungkapan yang jelas tentang ketidakbersalahan Yusuf dan tuduhan bagi istri menteri. Oleh sebab itu istri menteri mengakui makar besarnya: “Sekarang kebenaran telah nampak, akulah yang berusaha menggodanya namun dia menolak; sungguh dia jujur bahwa dia tidak bersalah. Pengakuan ini agar suamiku mengatahui dengan pasti bahwa aku tidak mengkhianatinya dengan menyembunyikan kebenaran ketika dia tidak ada, dan mengetahui perbuatan keji itu belum terjadi, serta Allah tidak akan memberi jalan bagi tipu daya orang-orang yang mengkhianati amanat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. قَالَ مَا خَطْبُكُنَّ (Raja berkata (kepada wanita-wanita itu): “Bagaimana keadaanmu) Sang raja berkata kepada pawa wanita itu: “bagaimanakah perkara kalian ketika menggoda Yusuf untuk menundukkan dirinya” إِذْ رٰوَدتُّنَّ يُوسُفَ عَن نَّفْسِهِۦ ۚ( ketika kamu menggoda Yusuf untuk menundukkan dirinya) Telah dijelaskan sebelumnya Makna (المراودة). Orang yang termasuk ditanya oleh raja adalah istri dari al-aziz. قُلْنَ حٰشَ لِلّٰهِ (Mereka berkata: “Maha Sempurna Allah) Yakni kami berlindung kepada Allah. مَا عَلِمْنَا عَلَيْهِ مِن سُوٓءٍ ۚ (kami tiada mengetahui sesuatu keburukan dari padanya) Yakni hal buruk yang dituduhkan kepadanya. قَالَتِ امْرَأَتُ الْعَزِيزِ (Berkata isteri Al Aziz) Mengakui bahwa dirinya menggoda Yusuf. الْـٰٔنَ حَصْحَصَ الْحَقُّ (Sekarang jelaslah kebenaran itu) Yakni kebenaran telah jelas sekarang dengan sejelas-jelasnya. أَنَا۠ رٰوَدتُّهُۥ عَن نَّفْسِهِۦ (akulah yang menggodanya untuk menundukkan dirinya) Dan dia tidak menggodaku sama sekali. وَإِنَّهُۥ لَمِنَ الصّٰدِقِينَ(dan sesungguhnya dia termasuk orang-orang yang benar) Dalam perkataannya bahwa ia adalah orang yang tidak bersalah dan tidak menggoda wanita itu sebagaimana yang dituduhkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Raja berkata kepada wanita-wanita yang berkumpul dengan istri Al-‘Aziz: “Bagaimana masalah dan kasus kalian ketika menggoda Yusuf untuk menundukkan dirinya, apakah kalian mendapati dia tertarik dengan kalian?” Mereka berkata: “Aku berlindung kepada Allah, jika Yusuf dituduh, ini adalah wujud ketakjuban atas kebaikan yang luar biasa. Kami tidak mendapati dia berdosa.” Istri Al-‘Aziz berkata: “Sekarang kebenaran tampak dengan jelas. Aku adalah orang yang menggodanya agar menundukkan dirinya. Dia adalah orang yang benar atas pengakuan tidak bersalahnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} raja berkata kepada mereka {“Bagaimana keadaan kalian} keadaan kalian {ketika kalian menggoda Yusuf untuk menundukkan dirinya” Mereka berkata, “Maha sempurna Allah} Maha suci Allah {Kami tidak mengetahui suatu keburukan darinya” Istri Al Aziz berkata,“Sekarang jelaslah} telah jelas dan nyata {kebenaran itu. Akulah yang menggodanya dan sesungguhnya dia termasuk orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Raja menghadirkan wanita wanita itu seraya melemparkan pertanyaan kepada mereka, ”bagaimana keadaanmu” apa maksud kalian “ketika kalian menggoda yusuf untuk menundukkan dirinya (kepada kalian)” apakah kalian menyaksikan pada dirinya sesuatu yang mencurigakan? merekapun merehabilitasi nama baik yusuf dan, ”mereka berkata ’Maha sempurna Allah, kami tiada mengetahui sesuatu keburukan daripadanya” baik sedikit maupun banyak. Saat itu, lenyaplah faktor penyebab yang menjadi sumber tuduhan. Tidak ada yang tersisa kecuali yang ada pada istri al-aziz. maka berkatalah “istri al aziz sekarang jelaslah kebenaran itu” maksudnya kebenaran itu menjadi terang dan tampak setelah sebelumnya kami meletakan keburukan dan tuduhan kepadanya yang mengharuskannya menghuni penjara. ”akulah yang menggodanya untuk menundukkan (dirinya) kepadaku, dan sesungguhnya dia orang yang termasuk orang orang yang benar” dalam ucapan ucapannya dan dalam pembelaannya atau kehormatannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَا خَطۡبُكُنَّ) maa khathbukunn : bagaimana keadaan kalian. (حَٰشَ لِلَّهِ) haasya lillah : Maha Suci Allah, mustahil Dia tidak mampu menciptakan seorang yang menjaga harga dirinya. (حَصۡحَصَ ٱلۡحَقُّ) hashhashol haqq : kebenaran telah tampak. Makna ayat : Lalu raja pun mengumpulkan para wanita tersebut dan bertanya kepada mereka, (مَا خَطۡبُكُنَّ إِذۡ رَٰوَدتُّنَّ يُوسُفَ عَن نَّفۡسِهِۦ) “Bagaimana keadaan kalian ketika kalian menggoda Yusuf?” mereka menjawab (حَٰشَ لِلَّهِ مَا عَلِمۡنَا عَلَيۡهِ مِن سُوٓءٖۚ) “Maha Suci Allah, tidak mungkin Dia tidak bisa menciptakan manusia yang begitu menjaga dirinya seperti dia. (مَا عَلِمۡنَا عَلَيۡهِ مِن سُوٓءٖۚ) kami tidak melihat ia punya suatu keburukan pun. Pada kala itu istri Al-‘Aziz Zulaikha berkata—sebagaimana yang Allah kabarkan—( ٱلۡـَٰٔنَ حَصۡحَصَ ٱلۡحَقُّ) sekarang kebenaran telah tampak dan jelas, (أَنَا۠ رَٰوَدتُّهُۥ عَن نَّفۡسِهِۦ) aku yang menggodanya bukan ia, (وَإِنَّهُۥ لَمِنَ ٱلصَّٰدِقِينَ ) dan ia termasuk orang-orang yang jujur. Pelajaran dari ayat : • Keutamaan jujur dan berkata jujur sekalipun terhadap diri sendiri. • Kemuliaan Zulaikha dengan pengakuannya terhadapa dosanya, sehingga ia diangkat hingga kedudukan yang tinggi dan derajat yang mulia, yang mana ia—sebentar lagi—akan menjadi istri dari orang pilihan Allah Yusuf ash-Shiddiq, anak dari ash-Shiddiq, istri baginya di dunia dan akhirat. Inilah keutamaan yang Allah berikan kepada yang Dia kehendaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 51: Yang dimaksud dengan keadaanmu di sini adalah pendapat wanita-wanita itu tentang Yusuf ‘alaihis salam apakah dia terpengaruh oleh godaan itu atau tidak. Setelah kami menuduh dan mencelanya sehingga ia dipenjarakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 51",
    "description": "Kemudian dia'raja'pun berkata kepada perempuan-perempuan yang telah melukai tangan mereka sendiri dengan pisau, ceritakan padaku, bagaimana keadaanmu, yakni menurut pendapatmu ketika kamu menggoda nabi yusuf untuk menundukkan dirinya apakah dia terpengaruh oleh bujuk dan rayuanmu' kemudian mereka berkata, mahasempurna Allah, kami tidak mengetahui dan melihat sedikit pun kekurangan atau suatu keburukan pun padanya. Saat itu istri al-aziz mengaku dan berkata terus terang, sekarang jelaslah kebenaran itu terungkap setelah sekian lama tertutup, sesungguhnya akulah yang menggoda dan merayunya, namun ia menolak dan berlindung kepada Allah. Dan aku mengakui sesungguhnya dia termasuk orang yang benar dan jujur perkataannya, dia benar-benar telah dizalimi. Kemudian istri al-aziz mengatakan, yang demikian itu, yakni pengakuan bahwa akulah yang menggoda yusuf dan dia menolaknya, adalah agar dia, suamiku, mengetahui bahwa aku benar-benar tidak mengkhianatinya dan berselingkuh dengan orang lain ketika dia tidak ada bersamaku, dan agar yusuf bebas dari segala tuduhan. Dan aku menyadari bahwa sesungguhnya Allah tidak meridai tipu daya orang-orang yang berkhianat. Allah pasti akan mengungkap kejadian yang sebenarnya, meski hal itu sudah ditutup-tutupi bertahun-tahun."
  }
]