[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ucapan yang aku katakan soal kesucian pribadi yusuf dan pengakuanku atas diriku sendiri agar suamiku mengetahui bahwa aku tidaklah berkhianat denga berdusta kepadanya saat dia tidak dirumah dan tidak terjadi padaku perbuatan zina, walaupum sesunggguhnya aku hanya sekedar menggodanya saja. Aku akui hal tersebut untuk membuktikan kebersihanku dan kebersihannya dan sesungguhnya Allah tidak memberikan hidayah kepada orang yang mengkhianati amanat-amanat dan tidak menunjuki mereka dalam perbuatan khianat mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Isteri Al-Azīz berkata, \"Hendaknya Yusuf tahu ketika aku mengakui bahwa akulah yang merayunya. Dan hendaknya dia tahu bahwa dia jujur dengan mengatakan bahwa aku tidak membuat cerita palsu di belakangnya. Dari apa yang telah terjadi jelaslah bagiku bahwa Allah tidak akan menolong orang yang berdusta dan membuat tipu daya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. ذٰلِكَ لِيَعْلَمَ أَنِّى لَمْ أَخُنْهُ بِالْغَيْبِ (yang demikian itu agar dia (Al Aziz) mengetahui bahwa sesungguhnya aku tidak berkhianat kepadanya di belakangnya) Ini merupakan perkataan nabi Yusuf. Yakni aku melakukan hal ini agar al-aziz mengetahui bahwa aku tidak berkhianat dengan istrinya ketika dia tidak ada. Yakni ketika dia tidak berada didekatku atau aku tidak berada didekatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Yusuf berkata: “Aku melakukan itu dan meminta agar dibebaskan sebelum keluar dari penjara supaya Al-’Aziz tahu bahwa aku tidak menghianatinya dengan memanfaat keluarganya saat dai tidak ada. Sesungguhnya Allah tidak akan membimbing, dan membantu para pengkhianat yang menyusun rencana tersembunyi” Ini adalah penafsiran Az-Zamakhsyari. Menurut Abu Hayan bahwa ucapan wanita ini untuk menunjukkan bahwa dia tidak ingin mengotori nama baik Yusuf dan kebaikannya ketika tuannya tidak ada."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Yusuf berkata,) “Yang demikian itu} pengakuanku atas diriku itu {agar Al Aziz mengetahui bahwa aku benar-benar tidak mengkhianatinya ketika dia tidak ada} agar Yusuf tahu bahwa aku tidak mengkhianati Al Aziz ketika dia tidak ada {dan bahwa sesungguhnya Allah tidak meridahi tipu daya orang-orang yang berkhianat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “yang demikian itu” pengakuan itu yang menyatakan akulah (wanita itu) orang yang menggoda yusuf “agar dia (al aziz) mengetahui bahwa sesungguhnya aku tidak berkhianat kepadanya dibelakangnya” ini mengandung pengertian bahwa yang dimaksud wanita itu ialah suaminya, maksudnya agar suamiku mengetahui bahwa saat aku mengaku menggoda yusuf, aku tidak berkhianat kepadanya dibelakangnya. Bisa juga mengandung pengertian agar yusuf mengetahui (saat aku mengakui) bahwa akulah yang menggodanya dan dia adalah orang yang jujur. bahwa aku belum berkhianat kepada suamiku saat tidak bersamaku. ”dan bahwasannya Allah tidak meridhai tipu daya orang orang yang berkhianat” karena setiap orang yang berkhianat, perbuatan khianat dan tipu dayanya kembali kepada dirinya sendiri saja dan pasti jati dirinya akan terungkap."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Dan firman-Nya : (ذَٰلِكَ لِيَعۡلَمَ أَنِّي لَمۡ أَخُنۡهُ بِٱلۡغَيۡبِ) ini adalah pemberitaan oleh Yusuf ‘alaihi salam, ia berkata demikian. Maksudnya, aku tidak mau keluar dari penjara, serta aku tidak menjawab panggilan raja, dan permintaanku agar raja berkenan menanyakan tentang para wanita itu, agar aku benar-benar terbebas dari tuduhan itu melalui perkataan wanita-wanita itu secara umum dan dari istri Al-‘Aziz secara lebih spesifik, karena ia sendiri yang mengakui aku terbebas dari berbagai tuduhan itu. Dia juga mengakui, yang merayu duluan adalah dia sendiri, tapi aku menolaknya. Semua ini kulakukan agar ia mengetahui, bahwa aku tidak mengkhianatinya dan kehormatan dan kemuliaannya tidak tercemar, karena tuanku sudah memberikan kehidupan yang baik kepadaku, (وَأَنَّ ٱللَّهَ لَا يَهۡدِي كَيۡدَ ٱلۡخَآئِنِينَ) seandainya aku berkhianat, tentu Allah tidak akan mengantarkanku sampai kepada kedudukan yang mulia ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 52: Ada yang berpendapat, bahwa kata-kata di atas adalah ucapan istri Al ‘Aziz (alasannya karena ketika itu Yusuf belum hadir dan masih dalam penjara) sebagai lanjutan kata-kata sebelumnya, sehingga maksudnya bahwa pengakuannya itu agar dia (suaminya) tahu bahwa aku hanya sekedar merayu dan tidak merusak ranjangnya, atau bisa juga maksudnya bahwa pengakuannya itu agar dia (Yusuf) tahu bahwa dia adalah benar dan aku tidak berkhianat (dengan mengatakan yang tidak-tidak terhadapnya) ketika ia tidak berada di dekatku, wallahu a’lam. Karena setiap orang yang berkhianat, khianat dan makarnya kembalinya kepada dirinya dan urusan sebenarnya akan diketahui dengan jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 52",
    "description": "Kemudian istri al-aziz mengatakan, yang demikian itu, yakni pengakuan bahwa akulah yang menggoda yusuf dan dia menolaknya, adalah agar dia, suamiku, mengetahui bahwa aku benar-benar tidak mengkhianatinya dan berselingkuh dengan orang lain ketika dia tidak ada bersamaku, dan agar yusuf bebas dari segala tuduhan. Dan aku menyadari bahwa sesungguhnya Allah tidak meridai tipu daya orang-orang yang berkhianat. Allah pasti akan mengungkap kejadian yang sebenarnya, meski hal itu sudah ditutup-tutupi bertahun-tahun. Setelah peristiwa yang dialami nabi yusuf berlalu dan ia terbukti tidak bersalah, ia pun berkata, dan aku tidak menyatakan diriku bebas dari kesalahan apa pun, karena sesungguhnya salah satu jenis nafsu manusia itu adalah nafsu amarah, yang selalu mendorong manusia kepada kejahatan, kecuali nafsu yang diberi rahmat oleh tuhanku sehingga tidak membawaku kepada kejahatan. Sesungguhnya tuhanku maha pengampun atas segala dosa, maha penyayang bagi siapa saja yang dia kehendaki."
  }
]