[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Istri sang mentri itu berkata, ”Dan aku tidak membenarkan diriku dan tidak membebaskan diriku (dari kesalahan). Sesungguhnya (jiwa) manusia banyak memerintahkan pemiliknya untuk berbuat maksiat demi mencari kesenangan-kesenangannya, kecuali orang yang dilindungi Allah. Sesungguhnya Allah maha pengampun dosa-dosa orang yang bertaubat dari hamba-hambanYa lagi mahapenyayang terhadap mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Isteri Al-Azīz melanjutkan pembicaraannya dengan mengatakan, \"Aku tidak merasa bahwa diriku bersih dari keinginan untuk berbuat buruk. Dan dengan pernyataan itu aku tidak bermaksud menyucikan diriku sendiri. Karena watak nafsu manusia ialah gemar menyuruh berbuat buruk. Karena nafsu manusia selalu cenderung untuk mengikuti apa yang disukainya dan sulit dicegah. Kecuali nafsu-nafsu yang dirahmati oleh Allah, sehingga terlindung dari kebiasaan menyuruh berbuat buruk. Sesungguhnya Tuhanku Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Dan dia juga mengaku: “Dan aku sama sekali tidak menganggap suci diriku, sungguh hawa nafsu banyak sekali menyuruh pemiliknya untuk berbuat maksiat, kecuali orang yang dirahmati Allah dengan menjaganya dari perbuatan maksiat. Tuhanku Maha Mengampuni orang-orang yang bertaubat dari dosa-dosanya dan Maha Mengasihi mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَمَآ أُبَرِّئُ نَفْسِىٓ ۚ (Dan aku tidak membebaskan diriku (dari kesalahan)) Ini merupakan perkataan nabi Yusuf sebagai bentuk kerendahan hatinya dan tidak merasa paling suci. إِنَّ النَّفْسَ لَأَمَّارَةٌۢ بِالسُّوٓءِ(karena sesungguhnya nafsu itu selalu menyuruh kepada kejahatan) Yakni hawa nafsu manusia selalu memerintahkan untuk berbuat keburukan karena kecondongan untuk memenuhi syahwat, dan sangat mempengaruhi tabiat seseorang, serta sangat sulit untuk ditundukkan. إِلَّا مَا رَحِمَ رَبِّىٓ ۚ( kecuali nafsu yang diberi rahmat oleh Tuhanku) Sehingga dijauhkan Allah dari perbuatan maksiat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Memahami konteks ayat dan teliti dalam mentadabburinya sangat membantu dalam memahami maknanya, khususnya ketika ada perbedaan pendapat di antara ulama dalam menentukan makna yang sesuai, sebagai contoh : Syaikhul islam Ibnu Taimiyah menetapkan bahwasanya istri al-aziz lah yang mengatakan : { وَمَا أُبَرِّئُ نَفْسِي ۚ إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي ۚ إِنَّ رَبِّي غَفُورٌ رَحِيمٌ }; karena konteksnya bersambung dengan ucapannya yang sebelumnya, kemudian Syaikh menyambung perkataannya : al-quran menunjukkan kebenaran perkara itu dengan sangat jelas, dan orang yang mentadabburi al-qur'an tidak lagi ragu dengan kebenaran itu. 2 ). Diantara perkara yang paling besar mudhorotnya bagi seorang hamba adalah kekosongan waktunya, karena nafsu itu tidak mampu diam dengan kekosongannya bahkan ketika ia tidak disibukkan dengan hal yang positif maka akan disibukkan dengan hal-hal yang membahayakannya, { إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ } \"karena sesungguhnya nafsu itu selalu menyuruh kepada kejahatan\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Dan Yusuf mengikuti ucapannya (berdasarkan penafsiran pertama). Dan aku tidak membebaskan diriku dari kesalahan dan kekeliruan, Sesungguhnya kebanyakan perkara jiwa itu mengikuti hawa nafsu dan syahwat, kecuali jika Tuhanku mengasihinya, maka akan menjaganya agar tidak berbuat maksiat. Sesungguhnya Tuhanku Maha Pengampun bagi orang-orang yang meminta ampunan dan Maha Penyayang bagi orang-orang shalih yang mau bertaubat. Dan berdasarkan penafsiran kedua yang ditafsirkan oleh Abu Hayan: Ini adalah lanjutan perkataan istri Al-‘Aziz, menyambung kalimat sebelumnya {Al-aana hashhashal haqqu} [51]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak menyatakan diriku bebas} Aku tidak membersihkan diriku dari kesalahan dan kekeliruan {karena sesungguhnya nafsu itu selalu mendorong} selalu memerintah {kepada kejahatan, kecuali yang diberi rahmat oleh Tuhanku} kecuali yang dirahmati Tuhanku maka DIa menjaaganya {Sesungguhnya Tuhanku Maha Pengampun lagi Maha Penyayang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Tatkala pernyataan semacam ini mencerminkan sejenis tazkiyah (penyucian) pada dirinya, maka ia segera melanjutkan dengan penuturan, “Dan aku tidak membebaskan diriku (dari kesalahan)”, dari tindakan menggoda, pemusatan pikiran, semangat kuat dan mengupayakan tipu daya untuk merealisasikannya, “karena sesungguhnya nafsu itu selalu menyuruh kepada kejahatan”, maksudnya sering sekali memerintahkan pemiliknya untuk berbuat kejelekan yakni perbuatan keji daan segala dosa. Sesungguhnya jiwa merupakan kendaraan tunggangan setan. Dari situlah setan menyusup kepada manusia “kecuali nafsu yang diberi rahmat oleh Raabbku”, sehingga Dia menyelamatkannya dari jiwanya yang selalu memerintahkan kepada kejelekan maka jiwanya menjadi jiwa yang merasa tenang kepada Rabbnya, patuh terhadap penyeru hidayah, enggan terhadap penyeru kenistaan. Kebaikan ini bukan berasal dari jiwa itu sendiri, tetapi merupakan curahan keutamaan dan rahmat Allah kepada hambaNya. “Sesungguhnya Rabbku Maha Pengampun lagi Maha Penyayang”, maksudnya, Dia Maha Pengampun bagi orang yang telah nekat berani melakukan dosa-dosa dan maksiat-maksiat jika ia sudi bertaubat dan kembali kepada Allah. Dia Maha Kasih dengan menerima taubatnya dan memberikan taufikNya (kemudahan) untuk melakukan amalan-amalan shalih. Jadi, inilah yang benar, bahwa pernyataan tersebut merupakan ucapan istri al-Aziz, bukan ucapan Yusuf. Karena susunan redaksinya masuk ke dalam substansi arah pembicaraan si wanita, sementara itu, Yusuf belum muncul, dia masih berada di bui."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَأَمَّارَةُۢ بِٱلسُّوٓءِ) la’ammaratum bis suu’ : sering menyuruh, as-suu’: segala sesuatu yang menyakiti jiwa seseorang, seperti dosa. ( إِلَّا مَا رَحِمَ رَبِّيٓۚ) illaa maa rahima rabbii : kecuali yang Allah rahmati, maka jiwanya tidak menyuruhnya kepada keburukan karena bersih dan sucinya jiwa tersebut. Makna ayat : Makna ayat : Ayat ini masih menceritakan kisah Yusuf ‘alaihi salam, firman-Nya : (۞وَمَآ أُبَرِّئُ نَفۡسِيٓۚ إِنَّ ٱلنَّفۡسَ لَأَمَّارَةُۢ بِٱلسُّوٓءِ إِلَّا مَا رَحِمَ رَبِّيٓۚ إِنَّ رَبِّي غَفُورٞ رَّحِيمٞ) “Dan aku tidak membebaskan diriku (dari kesalahan), karena sesungguhnya nafsu itu selalu menyuruh kepada kejahatan, kecuali nafsu yang diberi rahmat oleh Tuhanku. Sesungguhnya Tuhanku Maha Pengampun lagi Maha Penyayang.” ini adalah perkataan Yusuf ‘alaihi salam, ketika ia meminta raja untuk mengklarifikasi kasus para wanita yang melukai tangan mereka dan istri Al-‘Aziz. Kasus itu selesai dengan pengumuman akan terbebasnya Yusuf dari tuduhan yang tertuju kepadanya. (ذَٰلِكَ) aku melakukannya (لِيَعۡلَمَ ) agar Al-‘Aziz mengetahui (أَنِّي لَمۡ أَخُنۡهُ بِٱلۡغَيۡبِ وَأَنَّ ٱللَّهَ لَا يَهۡدِي كَيۡدَ ٱلۡخَآئِنِينَ ) aku tidak mengkhianatinya dan Allah tidak akan memberikan hidayah kepada para pengkhianat. Pada sisi lain ia pernah berniat memukul Zulaikha—sebagaimana yang telah dijelaskan sebelumnya—ia berkata, (وَمَآ أُبَرِّئُ نَفۡسِيٓۚ) “Aku tidak menyatakan diriku bebas dari kesalahan,” lalu menjelaskan sebabnya (إِنَّ ٱلنَّفۡسَ) jiwa manusia ( لَأَمَّارَةُۢ بِٱلسُّوٓءِ ءِ إِلَّا مَا رَحِمَ رَبِّيٓۚ) senantiasa menyuruh kepada keburukan, kecuali jiwa yang dirahmati Rabbku, dengan memberikan taufik untuk menyucikan dan membersihkan jiwanya dengan keimanan dan amalan saleh, dengannya ia akan menjadi jiwa yang tentram menyuruh kepada kebaikan dan melarang dari keburukan. Firman-Nya : (إِنَّ رَبِّي غَفُورٞ رَّحِيمٞ) ”Sungguh Rabbku Maha Pengampun lagi Maha Penyayang.” perkataan ini menjelaskan sebab dari (وَمَآ أُبَرِّئُ نَفۡسِيٓۚ). Jika aku berniat untuk memukul dan itu merupakan suatu keburukan, maka aku bertaubat kepada Allah, Allah adalah Maha Pengampun, mengampuni dan melupakan kesalahan hambanya yang bertaubat, tidak menyiksanya. Menyayanginya karena Dia Maha Penyayang kepada orang-orang beriman dari hamba-hamba-Nya. Pelajaran dari ayat : - Keutamaan selalu merasa diri kurang dan tidak totalitas dalam beramal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 53: Setelah Beliau menunjukkan kebersihan dirinya dan karena dalam ucapan Beliau tedapat sedikit tazkiyah (pembersihan), maka Beliau bertawadhu’ kepada Allah dengan mengatakan kata-kata sebagaimana disebutkan dalam ayat di atas. Hal ini, jika kita mengatakan, bahwa yang mengatakan kata-kata tadi (yakni di ayat 52) adalah Yusuf, akan tetapi jika kita mengatakan, bahwa yang mengatakan kata-kata itu adalah istri Al Aziz, maka karena dalam kata-kata sebelumnya terdapat sedikit tazkiyah, ia pun melanjutkan dengan kata-katanya di atas, bahwa ia tidak menyatakan bahwa dirinya tidak berarti bebas dari kesalahan, yakni dari merayu dan bermaksud buruk. Yakni biasanya memerintahkan kepada keburukan, sehingga dijadikan kendaraan oleh setan untuk menguasai diri manusia. Sehingga terjaga, nafsunya tentram ketika mendekat dengan Tuhannya, tunduk kepada seruan hidayah, menjauhi seruan kesesatan, dan yang demikian bukanlah karena kehebatan nafsu itu, akan tetapi karena karunia Allah dan rahmat-Nya kepada hamba-Nya. Kepada mereka yang berbuat dosa dan maksiat apabila mereka bertobat dan kembali kepada-Nya. Dengan menerima tobatnya dan memberinya taufiq untuk beramal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 53",
    "description": "Setelah peristiwa yang dialami nabi yusuf berlalu dan ia terbukti tidak bersalah, ia pun berkata, dan aku tidak menyatakan diriku bebas dari kesalahan apa pun, karena sesungguhnya salah satu jenis nafsu manusia itu adalah nafsu amarah, yang selalu mendorong manusia kepada kejahatan, kecuali nafsu yang diberi rahmat oleh tuhanku sehingga tidak membawaku kepada kejahatan. Sesungguhnya tuhanku maha pengampun atas segala dosa, maha penyayang bagi siapa saja yang dia kehendaki. Raja yakin bahwa nabi yusuf telah dizalimi dipenjara tanpa berbuat salah. Raja juga mengaguminya karena kemampuannya memberikan takwil mimpi sang raja. Raja pun berkata, bawalah dia (yusuf ) kepadaku, agar aku memilih dia sebagai orang yang dekat kepadaku dan aku angkat menjadi penasihat dalam pemerintahan. Ketika dia (raja) telah bercakap-cakap dengan dia, dia (raja) berkata, sesungguhnya kamu mulai hari ini kuangkat menjadi seorang yang berkedudukan tinggi di lingkungan kerajaan kami dan menjadi orang yang dipercaya mengurus urusan kerajaan."
  }
]