[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan raja penguasa mesir berkata ketika sampai kepadanya berita tentang bersihnya kepribadian yusuf, ”hadapkanlah dia kepadaku niscaya akan aku jadikan dia termasuk orang-orang kepercayaanku dan penasihat pribadiku.” Maka Ketika yusuf datang, dan sang raja berbicara dengannya, dan mengetahui ketrbebasan dirinya, besarnya sifat amanahnya dan kebaikan akhlaknya, dia berkata kepada yusuf ”sesungguhnya hari ini engkau di sisi kami berkedudukan tinggi dan dipercaya memegang semua urusan”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Setelah mengetahui bahwa Yusuf tidak bersalah dan memiliki ilmu yang sangat baik, raja berkata kepada para pembantunya, \"Bawalah dia (Yusuf -'alaihissalām-) kepadaku! Aku akan menunjuknya menjadi asisten pribadiku.\" Kemudian mereka membawa Yusuf ke hadapan raja. Setelah berbicara langsung dengan Yusuf dan merasa yakin dengan keilmuan dan kecerdasannya, raja berkata, \"Hari ini engkau -wahai Yusuf- menjadi orang yang mempunyai kedudukan, jabatan dan kepercayaan di sisi kami.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Setelah jelas bagi raja ketidakbersalahan Yusuf dan dia adalah orang yang terzalimi, maka dia ingin memuliakannya dan menempatkannya pada kedudukan yang layak baginya. Raja kembali meminta agar Yusuf didatangkan kepadanya untuk dia jadikan sebagai penasehat dekatnya, dan memutus hubungan dengan menteri itu. Saat Yusuf datang kepadanya, raja segera berkata dengan menyanjung kelebihan dan kecerdasannya, lalu dia berkata: “Mulai hari ini kamu memiliki kedudukan yang tinggi di sisi kami dan kamu menjadi orang terpercaya dalam segala urusan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. أَسْتَخْلِصْهُ لِنَفْسِى ۖ (agar aku memilih dia sebagai orang yang dekat kepadaku) Salah satu kebiasaan para raja adalah menjadikan seseorang sebagai orang istimewanya. فَلَمَّا كَلَّمَهُۥ(Maka tatkala raja telah bercakap-cakap dengan dia) Yakni ketika raja itu berbincang dengan Yusuf kemudian mendengar jawabannya. قَالَ إِنَّكَ الْيَوْمَ لَدَيْنَا مَكِيْنٌ أَمِينٌ(dia berkata: “Sesungguhnya kamu (mulai) hari ini menjadi seorang yang berkedudukan tinggi lagi dipercayai pada sisi kami”) Nabi Yusuf datang dengan sesuatu yang disukai raja sehingga ia mengatakan ucapan ini. Makna (مكين) yakni orang yang memiliki kedudukan dan kepercayaan sehingga ia dapat mendapatkan apa yang ia inginkan dari sang raja, dan mendapat kepercayaan dari raja atas urusan yang diserahkan kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Raja Mesir berkata: “Bawalah Yusuf yang dipenjara kepadaku, Aku akan membebaskannya dan menjadikannya orang istimewa dan penasehatku.” Dan ketika raja berbicara dengan Yusuf dan menyaksikan suatu petunjuk, kepintaran, kecerdasan dan kesucian, dia berkata kepada Yusuf: “Sekarang kamu memiliki tempat dan kedudukan serta dipercaya atas segala sesuatu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Raja berkata,“Bawalah dia kepadaku agar aku memilih dia sebagai orang yang dekat kepadaku} menjadikannya sebagai orang yang dekat denganku {Ketika dia berbicara kepadanya} ketika raja berbicara kepada Yusuf {raja berkata,“Sesungguhnya hari ini kamu menjadi seorang yang berkedudukan tinggi} orang yang memiliki kedudukan dan kemuliaan {di sisi kami lagi dipercaya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Ketika Sang Raja dan orang-orang yakin dengan kesucian Yusuf sepenuhnya, maka dia mengirim utusan untuk membawa Yusuf. Dia berkata, “Bawalah Yusuf kepadaku, agar aku memilihnya sebagai orang yang khusus bagi diriku”, maksudnya aku ingin menjadikannya orang khusus bagi diriku dan orang dekat bagiku. Lalu mereka membawa Yusuf dengan penuh pemuliaan dan penghormatan. “Maka tatkala raja telah bercakap-cakap dengannya”, ungkapannya sangat membuatnya terpukau dan meninggalkan kesan baik pada diri raja, maka dia berkata, “Sesungguhnya kamu (mulai) hari ini pada sisi kami” maksudnya di dekat kami “menjadi orang yang berkedudukan tinggi lagi dipercaya pada sisi kami”, yakni berkuasa dan dipercaya memegang rahasia-rahasia."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَسۡتَخۡلِصۡهُ لِنَفۡسِيۖ) astakhlishhu li nafsii : aku menjadikannya orang-orang pilihanku, penasehat dan pemegang rahasiaku. (مَكِينٌ أَمِينٞ ) makiiun amiin : punya kedudukan, sehingga ia bisa berbuat sesuka hatinya. Amiin: orang kepercayaan terhadap perbendaharaan kami. Makna ayat : Ayat (54) mengisahkan tentang undangan raja kepada Yusuf, serta apa yang terjadi di antara keduanya, Allah berfirman : (وَقَالَ ٱلۡمَلِكُ) Ar-Rayyan bin Al-Waliid (ٱئۡتُونِي بِهِۦٓ) datangkanlah Yusuf—setelah muncul keilmuannya dan kesempurnaan jiwanya—( أَسۡتَخۡلِصۡهُ لِنَفۡسِيۖ) menjadikannya orang dekat, penasehat pribadi yang membantu urusanku dan perkara kerajaanku. Kemudian keluarlah Yusuf dari penjara menuju raja, dan duduk berbincang bertanya tentang masa subur dan paceklik yang akan datang, kemudian menjawabnya dengan jawaban yang menenangkan hati berupa: rencana pengelolaan yang bijak dan efisien. Berkatalah sang raja kepada Yusuf, sebagaimana firman Allah ta’ala : (قَالَ إِنَّكَ ٱلۡيَوۡمَ لَدَيۡنَا مَكِينٌ أَمِينٞ) punya kedudukan, yang memperbolehkanmu mengatur negeri sesukamu, serta menjadi kepercayaan atas semua aset kami. Pelajaran dari ayat : - Benarnya kaidah: seorang insan tertutupi di balik ucapannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 54: Ketika raja dan orang-orang mengetahui bahwa Yusuf tidak bersalah. Lalu utusan itu datang kepada Yusuf dan berkata, “Penuhilah permintaan raja,” maka Yusuf berdiri dan berpamitan dengan para penghuni penjara, mendoakan kebaikan untuk mereka, lalu mandi dan mengenakan pakaian yang bagus, kemudian menemui raja. Dan raja senang dengan kata-katanya. Oleh karena itu, apa yang harus kami lakukan menurut kamu?” Kata raja. Yusuf berkata, “Kumpulkanlah makanan, tanamlah banyak tanaman di tahun-tahun yang subur ini, dan simpanlah makanan dalam tangkainya, sehingga nanti orang-orang akan datang kepadamu meminta perbekalan.” Raja kemudian berkata, “Siapa yang mengurus ini?” Maka Yusuf berkata seperti yang disebutkan dalam ayat selanjutnya (demikian yang disebutkan dalam Tafsir Al Jalaalain)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 54",
    "description": "Raja yakin bahwa nabi yusuf telah dizalimi dipenjara tanpa berbuat salah. Raja juga mengaguminya karena kemampuannya memberikan takwil mimpi sang raja. Raja pun berkata, bawalah dia (yusuf ) kepadaku, agar aku memilih dia sebagai orang yang dekat kepadaku dan aku angkat menjadi penasihat dalam pemerintahan. Ketika dia (raja) telah bercakap-cakap dengan dia, dia (raja) berkata, sesungguhnya kamu mulai hari ini kuangkat menjadi seorang yang berkedudukan tinggi di lingkungan kerajaan kami dan menjadi orang yang dipercaya mengurus urusan kerajaan. Dia (yusuf ) menerima tawaran raja, lalu dia berkata, jadikanlah aku sebagai bendaharawan negeri mesir ini; karena sesungguhnya aku adalah orang yang pandai menjaga amanat dan berpengetahuan luas tentang kebendaharaan."
  }
]