[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan yusuf berkeinginan dapat mendatangkan manfaat bagi para hamba dan menegakan keadlian di tengah mereka, sehingga dia berkata kepada sang raja, ”jadikanlah aku penanggung jawab perbendaharan kekayaan mesir, Sesungguhnya aku seorang penjaga yang dapat dipercaya, berilmu lagi berpengetahuan tentang urusan yang aku pimpin.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Yusuf berkata kepada raja, \"Berilah aku tugas sebagai penjaga gudang-gudang kekayaan dan makanan di negeri Mesir. Karena aku adalah penjaga yang terpercaya, serta memiliki pengetahuan dan wawasan yang baik tentang tugas dan wewenangku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Maka Yusuf berkata kepada raja: “Aku berharap engkau dapat menjadikanku penanggung jawab atas perbendaharaan negeri Mesir, karena aku sangat mahir dalam menjaga dan mengatur kemaslahatannya.” Syeikhul Islam Ibnu Taimiyah berkata: “Meminta menjadi pemimpin adalah sesuatu yang diolok Rasulullah, namun permintaan Yusuf ini kerena itu merupakan jalan untuk berdakwah kepada Allah, memberi keadilan kepada masyarakat, menghilangkan kezaliman yang mereka alami, dan melakukan berbagai kebaikan yang dahulu tidak pernah mereka lakukan sebelumnya.” (Mukhtashar al-Fatawa al-Misriyah 564)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. قَالَ اجْعَلْنِى عَلَىٰ خَزَآئِنِ الْأَرْضِ ۖ (Berkata Yusuf: “Jadikanlah aku bendaharawan negara (Mesir)) Yakni serahkanlah kepadaku urusan perbendaharaan negeri Mesir dan yang semisalnya seperti bahan pangan serta keuangan. Nabi Yusuf meminta hal ini agar dapat menegakkan keadilan dan menghilangkan kezaliman, dan agar memudahkannya dalam menyeru penduduk Mesir untuk beriman kepada Allah dan meninggalkan penyembahan berhala. إِنِّى حَفِيظٌ عَلِيمٌ (sesungguhnya aku adalah orang yang pandai menjaga, lagi berpengetahuan) Yakni cakap dalam pencatatan dan perhitungan dalam urusan ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-Qhodi Abu Ya'la mengatakan : pada kisah Yusuf ada isyarat dibolehkannya seseorang menilai drinya dengan kelebihan disisi orang-orang yang tidak mengetahui kelebihan yang ada pada dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Yusuf berkata kepada sang raja: “Jadikanlah aku penanggung jawab gudang harta Mesir. Sesungguhnya aku sangat baik dalam menjaga dan mengontrol kemaslahatan harta tersebut serta memiliki keilmuan dalam hal itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Jadikanlah aku pengelola perbendaharaan negeri} pengelola perbendaharaan makanan dan harta di negeri Mesir {Sesungguhnya aku adalah orang yang pandai menjaga} penjaga yang sangat dipercaya{lagi berpengetahuan} memiliki pengetahuan untuk mengaturnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Maka Yusuf berkata dalam rangka meminta (kedudukan) untuk kemaslahatan umum, “Jadikanlah aku bendaharawan negara (Mesir)”, perbendaharaan hasil-hasil bumi dan panenannya sebagai pemegang wewenang, penjaga dan pengatur “sesungguhnya aku adalah orang yang pandai menjaga lagi berpengetahuan”, maksudnya saya akan memelihara (tanggung jawab urusan) yang saya tangani, sehingga tidak ada sesuatu yang hilang pada selain posnya, dan meneliti secara seksama barang yang masuk maupun keluar, mengetahui teknik pengaturan, pendistribusian, penahanan (barang) dan segala jenis pengelolaan. Hal itu bukanlah bentuk ketamakan terhadap jabatan dari Yusuf. Itu hanyalah kehendak beliau untuk menciptakan kemanfaatan kepentingan umum. Beliau mengetahui kapasitas diri sendiri berupa kecakapan, sifat amanah dan penjagaan yang belum mereka mengerti. Oleh karena itu, beliau meminta Raja agar mendudukannya sebagai bendaharawan negara. Maka Raja mendaulat beliau sebagai bendaharawan negara dan menyerahkan urusan itu kepada beliau."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (خَزَآئِنِ ٱلۡأَرۡضِۖ) khazaainil ardh : kekayaan negeri Mesir. (إِنِّي حَفِيظٌ عَلِيمٞ) innii hafiizhun ‘aliim : aku mampu menjaga titipanmu, dan mampu mengelolanya. Makna ayat : Maka Yusuf menjawab—sebagaimana yang Dia kabarkan—( قَالَ ٱجۡعَلۡنِي عَلَىٰ خَزَآئِنِ ٱلۡأَرۡضِۖ) “Jadikanlah aku bendaharawan negeri.” yaitu Mesir, menggantikan posisi Al-‘Aziz yang telah meninggal pada masa itu. Kemudian menjelaskan sebab permintaannya untuk menjabat kementrian keuangan dan ekonomi dengan perkataannya, (إِنِّي حَفِيظٌ عَلِيمٞ) aku bisa menjaga dan mengatur hal yang diberikan kepadaku, pandai dalam pengaturan dan management suatu perkara. Pelajaran dari ayat : - Bolehnya menyebutkan keahlian orang yang dicalonkan untuk suatu pekerjaan, dan ini tidak termasuk pensucian diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 55: Meminta untuk kepentingan atau maslahat umum. Sebagai wakil, penjaga dan pengaturnya. Oleh karena itu, Beliau tidak akan menyia-nyiakan sesuatu dengan menempatkan yang bukan pada tempatnya, Beliau memperhatikan betul pemasukan dan pengeluaran negara, mengetahui cara mengatur, memberi dan mencegah serta mengetahui bagaimana membelanjakannya. Namun demikian, hal itu bukan berarti Yusuf berambisi terhadap jabatan, bahkan yang Beliau inginkan adalah manfaat untuk orang banyak, dan telah diketahui keadaan dirinya yang memang sesuai, amanah, dan pandai menjaga. Setelah Yusuf menjadi bendaharawan Mesir, maka Beliau mengatur harta kekayaan negara sebaik-baiknya. Paa saat-saat subur, Beliau memerintahkan untuk banyak bercocok tanam, dan Beliau membuatkan tempat besar sebagai penyimpanan makanan serta menjaganya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 55",
    "description": "Dia (yusuf ) menerima tawaran raja, lalu dia berkata, jadikanlah aku sebagai bendaharawan negeri mesir ini; karena sesungguhnya aku adalah orang yang pandai menjaga amanat dan berpengetahuan luas tentang kebendaharaan. Permohonan nabi yusuf diterima oleh raja. Dan demikianlah kami memberi kedudukan kepada yusuf di negeri mesir ini; untuk itu dia bebas tinggal di mana saja yang dia kehendaki. Kami melimpahkan rahmat kepada siapa yang kami kehendaki, dan kami tidak menyia-nyiakan sedikit pun pahala bagi orang yang berbuat baik."
  }
]