[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagiamana Allah telah mencurahkan kenikmatan kepada yusuf dengan selamat dari penjara, dia juga memberikan kekuasaan baginya di bumi mesir, dia bisa menduduki kedudukan dimana saja yang dikehendakinya. Allah mencurahkan rahmatNya kepada orang yang dikehendakiNya dari hamba-hambaNya yang bertakwa, dan tidak menyia-nyiakan pahala orang yang mengerjakan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Sebagaimana Kami menganugerahi Yusuf pemulihan nama baiknya dan terbebasnya dari penjara, Kami juga menganugerahinya kedudukan yang tinggi di negeri Mesir. Dia bisa tinggal dan menetap di mana saja sesuka hatinya. Kami memberikan sebagian rahmat Kami di dunia kepada hamba-hamba Kami yang Kami kehendaki. Dan Kami tidak akan menyia-nyiakan pahala orang-orang yang berbuat baik. Bahkan Kami akan memberikan pahala itu kepada mereka secara lengkap tanpa dikurangi sedikitpun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Sebagaimana Kami beri kenikmatan kepada Yusuf dengan mengeluarkannya dari penjara, Kami juga berikan dia kekuasaan dan kemuliaan di negeri Mesir, sehingga dia dapat berbuat apa yang dia kehendaki demi kemaslahatan manusia. Demikianlah sunnatullah terhadap hamba-hamba-Nya, Dia memberi kenikmatan dan keutamaan kepada siapa yang Dia kehendaki dan tidak menyia-nyiakan balasan orang yang berbuat baik dalam perkataan dan perbuatannya. Dan sungguh balasan di akhirat yang kekal lebih besar daripada balasan di dunia yang fana bagi orang-orang yang beriman dan bertakwa kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَكَذٰلِكَ مَكَّنَّا لِيُوسُفَ (Dan demikianlah Kami memberi kedudukan kepada Yusuf) Kami memberikannya kedudukan berupa kekuasaan dalam memerintah dan melarang, sampai-sampai raja Mesir tidak memutuskan suatu perkara kecuali setelah meminta pendapat dari nabi Yusuf. يَتَبَوَّأُ مِنْهَا حَيْثُ يَشَآءُ ۚ ((dia berkuasa penuh) pergi menuju kemana saja ia kehendaki di bumi Mesir itu) Yakni pergi kemanapun di negeri Mesir sesuai keinginannya seakan-akan ia berada dalam rumah sendiri. Ayat ini menjadi dalil dibolehkannya menerima tugas dari pemimpin yang zalim atau kafir, apabila ia yakin pada dirinya bahwa ia mampu menjalankannya dengan adil. نُصِيبُ بِرَحْمَتِنَا مَن نَّشَآءُ ۖ( Kami melimpahkan rahmat Kami kepada siapa yang Kami kehendaki) Yakni merahmati hamba-hamba Kami di dunia dengan kebaikan dan kenikmatan yang Kami berikan kepada mereka. وَلَا نُضِيعُ أَجْرَ الْمُحْسِنِينَ (dan Kami tidak menyia-nyiakan pahala orang-orang yang berbuat baik) Sebagaimana yang Allah lakukan terhadap nabi Yusuf atas kesabarannya menghadapi cobaan dari-Nya dan tetap menjaga kehormatan diri dari godaan yang ia lakukan karena Allah sebab ia tahu bahwa Allah mengawasinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Beberapa faidah dari ayat ini adalah : konteks kalimat yang dihukumkan untuk keseluruhan namun maksudnya untuk sebahagian saja, Yusuf tidak ditempat di bumi ini seluruhnya, tapi hanya ditempat di wilayah Mesir dan di sekitarnya saja, dan diantara faidah lainnya adalah : bahwasanya ketaatan menghasilkan rezeki yang melimpah di dunia, dan kepada seorang mukmin balasan yang pantas baginya akan diberikan, dan sama sekali balasan itu tidak akan berkurang di akhirat nanti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Sebagaimana nikmat Kami terhadap Yusuf dengan mengeluarkannya dari penjara, Kami juga memberinya keudukan di tanah Mesir dengan mengurus urusan-urusannya, sebagaimana laki-laki yang mengatur rumahnya. Hal ini menunjukkan dalil tentang pembolehan dalam mengatur urusan raja yang tidak adil atau kafir jika hal itu memungkinkan untuk menegakkan kebenaran. Kami mengasihi orang yang Kami kehendaki di dunia dan akhirat. Dan kami tidak menghilangkan pahala orang-orang yang baik, namun Kami menjaga pahala mereka dengan sempurna tanpa dikurangi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah Kami memberi kedudukan kepada Yusuf di negeri ini agar dia tinggal} tinggal {di sana sesuai kehendaknya. Kami melimpahkan rahmat Kami kepada siapa saja yang Kami kehendaki dan Kami tidak menyia-nyiakan pahala orang-orang yang berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-57. Allah berfirman, “Dan demikianlah”, dengan faktor-faktor dan pendahuluan yang sudah berlalu, “Kami memberi keduudukan kepada Yusuf di negeri Mesir; (dia berkuasa penuh) pergi menuju ke mana saja dia kehendaki di bumi Mesir ini”, dalam gaya hidup yang enak, kenikmatan yang luas dan jabatan yang terhormat. “Kami melimpahkan rahmat Kami kepada siapa yang Kami kehendaki”, maksudnya ini merupakan bagian dari rahmat Allah bagi Yusuf yang Allah curahkan kepada beliau dan sudah ditetapkan bagi beliau. Tidak hanya terbatas pada kenikmatan duniawi semata. Sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik. Dan Yusuf sendiri termasuk dari kalangan pembesar orang-orang yang berbuat baik. Di dunia beliau meraih kebaikan dan di akhirat beliau menerima kebaikan. Karena itu, Allah berfirman, “Dan sungguh pahala di akhirat itu lebih baik”, daripada pahala dunia “bagi orang-orang yang beriman dan selalu bertakwa”, yaitu bagi orang yang telah memadukan antara ketakwaan dan keimanan. Dengan ketakwaan, perkara-perkara yang diharamkan yang berupa dosa-dosa besar dan kecil ditinggalkan. Dan dengan keimanan yang sempurna, muncul pembenaran hati terhadap perintah Allah dan mengimaninya, yang akan diikuti oleh amalan-amalan hati dan amalan-amalan anggota tubuh lainnya, berupa ibadah-ibadah yang wajib maupun Sunnah. Maksudnya, manakala Yusuf memegang pengaturan perbendaharaan hasil bumi, maka beliau mengelolanya dengan cara yang terbaik. Lalu beliau menanam tanaman dalam jumlah yang sangat besar di seluruh tanah Mesir sepanjang tahun yang subur, dan membuat tempat-tempat gudang besar untuk menampungnya serta berhasil memunguti (bahan) makanan dalam jumlah besar. Dia menjaga dan menelitinya dengan ketat sekali. Ketika musim-musim kering telah tiba, dan masa paceklik berjalan bahkan sampai menerjang Palestina yang menjadi tempat tiinggal Ya’qub dan anak-anaknya, maka Ya’qub mengutus anak-anaknya untuk mengambil persediaan bahan makanan dari Mesir."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَتَبَوَّأُ) yatabawwa’u : bebas berbuat setelah sebelumnya ia berada di dalam kegelapan sumur dan sempitnya penjara. Makna ayat : Dan firman-Nya pada ayat 56: (وَكَذَٰلِكَ مَكَّنَّا لِيُوسُفَ فِي ٱلۡأَرۡضِ يَتَبَوَّأُ مِنۡهَا حَيۡثُ يَشَآءُۚ) dengan jalan dan sebab-sebab ini, Kami menjadikan Yusuf memilki kedudukan di negeri Mesir (يَتَبَوَّأُ مِنۡهَا ) berhukum dengan sesuai keinginan, mengganti, mengambil, memberi, membuat dan mengatur, karena ia adalah seorang menteri. Firman-Nya : (نُصِيبُ بِرَحۡمَتِنَا مَن نَّشَآءُۖ) “Kami memberikan rahmat Kami kepada yang Kami kehendaki.” (وَلَا نُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ ) “Dan Kami tidak akan menyia-nyiakan balasan orang-orang yang berbuat kebaikan.” Ini adalah janji dari Allah kepada para pelaku kebaikan untuk menyempurnakan balasan bagi mereka, dan Yusuf ‘alaihi salam termasuk di antara hamba yang Allah kehendaki untuk mendapat rahmat-Nya, dan ia termasuk dari orang-orang yang berbuat kebajikan yang Allah akan balas mereka dengan balasan yang sempurna di dunia dan di akhirat. Pelajaran dari ayat : - Keutamaan berbuat ihsan dalam hal aqidah, perkataan, dan amal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 56: Yakni sebagaimana Kami telah memberinya nikmat dengan selamat dari penjara. Setelah menempati tempat yang sempit dan penjara. Inilah buah dari kesabaran. Disebutkan dalam kisah, bahwa raja kemudian mengangkat Yusuf menggantikan Al ‘Aziz (Qithfir) dan memecatnya, dan ia (Al ‘Aziz) kemudian wafat setelahnya, lalu raja menikahkan istri Al ‘Aziz kepadanya dan didapatinya masih perawan (karena suami sebelumnya, yakni Qithfir adalah seorang yang kurang tertarik kepada wanita), lalu lahir darinya dua orang anak. Di Mesir, Yusuf menegakkan keadilan dan rakyat tunduk kepadanya, wallahu a’lam bish shawab. Yusuf ‘alaihis salam termasuk tokoh orang-orang yang berbuat kebaikan. Oleh karena itu, ia memperoleh kebaikan di dunia dan kebaikan di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 56",
    "description": "Permohonan nabi yusuf diterima oleh raja. Dan demikianlah kami memberi kedudukan kepada yusuf di negeri mesir ini; untuk itu dia bebas tinggal di mana saja yang dia kehendaki. Kami melimpahkan rahmat kepada siapa yang kami kehendaki, dan kami tidak menyia-nyiakan sedikit pun pahala bagi orang yang berbuat baik. Dan ketahuilah, sungguh pahala akhirat itu pasti lebih baik bagi orangorang yang beriman dan selalu bertakwa."
  }
]