[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh pahala akhirat di sisi Allah lebih agung daripada balasan di dunia bagi orang-orang yang beriman dan bertakwa, yaitu orang-orang yang takut kepada siksaan Allah dan menaatiNya dalam perintah dan laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan sungguh pahala yang Allah siapkan di Akhirat akan lebih baik daripada pahala dunia yang Dia berikan kepada orang-orang yang beriman kepada Allah dan bertakwa kepada-Nya dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Dan sungguh pahala akhirat itu lebih utama dan lebih agung daripada imbalan dunia karena (pahala akhirat) abadi bagi orang-orang yang beriman kepada Allah, rasulallah, takut kepadaNya, menjauhi perbuatan syirik dan keji, mewaspadai azab, dan menaati Tuhan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh pahala akhirat itu lebih baik bagi orang-orang yang beriman dan selalu bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-57. Allah berfirman, “Dan demikianlah”, dengan faktor-faktor dan pendahuluan yang sudah berlalu, “Kami memberi keduudukan kepada Yusuf di negeri Mesir; (dia berkuasa penuh) pergi menuju ke mana saja dia kehendaki di bumi Mesir ini”, dalam gaya hidup yang enak, kenikmatan yang luas dan jabatan yang terhormat. “Kami melimpahkan rahmat Kami kepada siapa yang Kami kehendaki”, maksudnya ini merupakan bagian dari rahmat Allah bagi Yusuf yang Allah curahkan kepada beliau dan sudah ditetapkan bagi beliau. Tidak hanya terbatas pada kenikmatan duniawi semata. Sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik. Dan Yusuf sendiri termasuk dari kalangan pembesar orang-orang yang berbuat baik. Di dunia beliau meraih kebaikan dan di akhirat beliau menerima kebaikan. Karena itu, Allah berfirman, “Dan sungguh pahala di akhirat itu lebih baik”, daripada pahala dunia “bagi orang-orang yang beriman dan selalu bertakwa”, yaitu bagi orang yang telah memadukan antara ketakwaan dan keimanan. Dengan ketakwaan, perkara-perkara yang diharamkan yang berupa dosa-dosa besar dan kecil ditinggalkan. Dan dengan keimanan yang sempurna, muncul pembenaran hati terhadap perintah Allah dan mengimaninya, yang akan diikuti oleh amalan-amalan hati dan amalan-amalan anggota tubuh lainnya, berupa ibadah-ibadah yang wajib maupun Sunnah. Maksudnya, manakala Yusuf memegang pengaturan perbendaharaan hasil bumi, maka beliau mengelolanya dengan cara yang terbaik. Lalu beliau menanam tanaman dalam jumlah yang sangat besar di seluruh tanah Mesir sepanjang tahun yang subur, dan membuat tempat-tempat gudang besar untuk menampungnya serta berhasil memunguti (bahan) makanan dalam jumlah besar. Dia menjaga dan menelitinya dengan ketat sekali. Ketika musim-musim kering telah tiba, dan masa paceklik berjalan bahkan sampai menerjang Palestina yang menjadi tempat tiinggal Ya’qub dan anak-anaknya, maka Ya’qub mengutus anak-anaknya untuk mengambil persediaan bahan makanan dari Mesir."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Allah berfirman bahwa balasan di akhirat lebih baik bagi orang-orang beriman lagi bertakwa, memotivasi kepada iman dan takwa, karena dengan keduanya seseorang dapat meraih penjagaan Allah, karena para wali-Nya adalah orang-orang beriman dan bertakwa. Pelajaran dari ayat : - Keutamaan iman dan takwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 57: Daripada balasan di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 57",
    "description": "Dan ketahuilah, sungguh pahala akhirat itu pasti lebih baik bagi orangorang yang beriman dan selalu bertakwa. Ketika menjabat sebagai bendahara kerajaan, nabi yusuf menunjukkan kemampuannya mengatasi paceklik yang melanda mesir dengan kebijakan membagi-bagikan makanan kepada penduduk yang membutuhkan. Kabar tentang keberhasilan ini tersebar ke seluruh penjuru negeri, bahkan ke palestina, kampung halaman nabi yakub dan anak-anaknya. Bersamaan dengan mesir, palestina juga mengalami masa paceklik. Nabi yakub menyuruh anak-anaknya, kecuali bunyamin, untuk berangkat ke mesir. Dan saudara-saudara yusuf datang ke mesir untuk memperoleh makanan. Sesampai di mesir, lalu mereka masuk ke tempat-Nya, yakni nabi yusuf, yang sedang mengawasi pembagian makanan. Maka nabi yusuf pun mengenali mereka, sedang mereka tidak mengenalinya."
  }
]