[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan datanglah saudara-saudara yusuf ke mesir setelah paceklik menimpa daerah mereka, untuk mendapatkan bahan makanan dari sana. Kemudian mereka menemuinya. Maka Yusuf mengenali mereka karena kuatnya firasat dan kecerdasannya, namun mereka tidak mengenalinya, karena waktu yang sudah berlalu lama dan perubahan penampilannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Saudara-saudara Yusuf datang ke negeri Mesir dengan membawa barang dagangan mereka. Kemudian mereka menemuinya. Yusuf tahu bahwa mereka adalah saudara-saudaranya. Tetapi mereka tidak tahu bahwa Yusuf adalah saudara mereka. Karena mereka sudah lama tidak berjumpa dan keadaan tubuh Yusuf pun sudah berubah. Sebab, Yusuf masih kecil ketika mereka membuangnya ke dalam sumur."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58-60. Maka Yusuf menerima tanggungjawab sebagai bendahara negara. Kemudian para saudaranya datang ke Mesir ketika mereka tertimpa kekeringan untuk mendapat makanan dari sana. Maka mereka masuk ke tempat Yusuf; dia mengenali para saudaranya, namun mereka tidak mengenalinya karena sudah terlalu lama terpisah. Yusuf memerintahkan agar mereka dimuliakan dan diberi makanan yang akan mereka beli. Yusuf mengetahui kisah-kisah mereka ketika dia bertemu dengan mereka, mereka bercerita bahwa mereka memiliki saudara seayah namun tidak ikut dengan mereka -yakni saudara kandung Yusuf-, maka Yusuf meminta mereka agar mendatangkannya dengan menyebut bahwa dia telah memuliakan jamuan bagi mereka dan memenuhi apa yang mereka beli agar mereka segera datang bersama saudaranya, dan Yusuf mewanti-wanti mereka jika mereka tidak membawa saudaranya maka mereka tidak akan mendapatkan makanan dan dia tidak akan mendekat kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَجَآءَ إِخْوَةُ يُوسُفَ (Dan saudara-saudara Yusuf datang) Yakni datang ke negeri Mesir dari negeri Kan’an untuk mencari makanan bagi keluarganya. فَدَخَلُوا۟ (lalu mereka masuk) Kehadirat nabi Yusuf. فَعَرَفَهُمْ (Maka Yusuf mengenal mereka) Sebab nabi Yusuf berpisah mereka ketika mereka telah dewasa. وَهُمْ لَهُۥ مُنكِرُونَ (sedang mereka tidak kenal (lagi) kepadanya) Sebab mereka berpisah dari Nabi Yusuf ketika ia masih kecil, dan kini mereka masuk ke tempatnya ketika ia telah menjadi lelaki yang dihiasi dengan kemewahan kerajaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Kemudian datanglah kepada Yusuf saudara-saudaranya yang berjumlah 11 orang kecuali Benyamin dari tanah Kan’an (Palestina) menuju Mesir untuk menukar atau membeli makanan (biji-bijian) setelah mereka ditimpa kekeringan. Lalu mereka bertemu Yusuf dan dia menyadari bahwa mereka adalah saudara-saudaranya, sedangkan mereka tidak menyadarinya karena mereka meninggalkannya saat masih remaja."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Saudara-saudara Yusuf datang, lalu mereka masuk menemuinya} menemui Yusuf. Lalu dia mengenali mereka, sedangkan mereka benar-benar tidak mengenalinya} tidak mengenalinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Maka datanglah “saudara-saudara Yusuf (ke Mesir) lalu mereka ke (tempat)nya. Maka Yusuf mengenal mereka, sedang mereka tidak mengenal (lagi) kepadanya,” maksudnya, mereka tidak mengenalinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَجَآءَ إِخۡوَةُ يُوسُفَ) wa jaa’a ikhwatu yuusuf : datanglah saudara-saudara Yusuf dari negeri Kan’an, ketika sampai kabar kepada mereka bahwa raja Mesir menjual bahan pangan. (وَهُمۡ لَهُۥ مُنكِرُونَ) wahum lahuu munkiruun : mereka tidak sadar kalau dia adalah saudara mereka. Makna ayat : Masih melanjutkan kisah Yusuf. Setelah Yusuf diangkat menjadi menteri, telah berlalu tahun-tahun subur dan datanglah tahun-tahun paceklik, sehingga para penduduk Kan’an membutuhkan bahan pangan begitu pula yang lain. Lalu Ya’kub ‘alaihi salam mengutus anak-anaknya untuk membeli bahan pangan—mereka ada sepuluh orang—setelah ia mengetahui raja Mesir menjual bahan makanan. Allah ta’ala berfirman mengenai keadaan mereka : (وَجَآءَ إِخۡوَةُ يُوسُفَ) “Datanglah saudara-saudara Yusuf” dari negeri Kan’an (فَدَخَلُواْ عَلَيۡهِ) lalu mereka menemui Yusuf (فَعَرَفَهُمۡ وَهُمۡ لَهُۥ مُنكِرُونَ) namun mereka tidak mengenalinya karena perubahan umur dan fisiknya. Pelajaran dari ayat : • Menakjubkannya pengaturan Allah ta’ala dimulai dari mimpi raja, takwil Yusuf atas mimpi tersebut dan terjadi sebagaimana yang dikabarkan—ini adalah pengaturan Allah untuk wali-Nya Yusuf, kemudian kedatangan saudara-saudaranya meminta bahan pangan untuk keluarga mereka, dan untuk menyempurnakan rentetan kisah-kisah berikut. Tidak ada tuhan yang berhak disembah kecuali Allah, dan tidak ada rabb yang benar kecuali Dia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 58: Kemudian datanglah kemarau panjang yang disebutkan itu, dan menimpa pula ke negeri Kan’an dan Syam. Menurut sejarah ketika terjadi musim paceklik di Mesir dan sekitarnya, maka atas anjuran Ya'kub, saudara-saudara Yusuf datang dari negeri Kan’an ke Mesir menghadap pembesar Mesir untuk meminta bantuan bahan makanan. Selain Bunyamin. Untuk meminta perbekalan karena sampai berita kepada mereka bahwa pembesar Mesir mau memberikan makanan dengan adanya penukaran. Karena sudah lama tidak berjumpa dan mereka mengira bahwa Yusuf telah binasa. Disebutkan dalam tafsir Al Jalaalain, bahwa saudara-saudara Yusuf kemudian berbicara dengan Yusuf menggunakan bahasa Ibrani, lalu Yusuf berkata seperti orang yang tidak kenal, “Apa yang membuat kamu datang ke negeriku?” Mereka berkata, “Untuk memperoleh perbekalan.” Yusuf berkata, “Mungkin kamu mata-mata.” Mereka berkata, “Ma’adzallah (seperti ucapan na’uudzubillah).” Yusuf berkata, “Dari mana kamu?” Mereka menjawab, “Dari negeri Kan’an dan bapak kami adalah Ya’kub seorang nabi Allah.” Yusuf berkata, “Apakah ia memiliki anak selain kalian?” Mereka menjawab, “Ya, kami berjumlah 12 orang saudara. Yang paling kecil di antara kami pergi dan binasa di gurun, dan dia adalah orang yang paling dicintainya. Tinggallah saudaranya, ia menahannya (tidak mengizinkan pergi) agar ia merasa terhibur dengannya.” Kemudian Yusuf memerintahkan agar mereka diberi tempat dan dimuliakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 58",
    "description": "Ketika menjabat sebagai bendahara kerajaan, nabi yusuf menunjukkan kemampuannya mengatasi paceklik yang melanda mesir dengan kebijakan membagi-bagikan makanan kepada penduduk yang membutuhkan. Kabar tentang keberhasilan ini tersebar ke seluruh penjuru negeri, bahkan ke palestina, kampung halaman nabi yakub dan anak-anaknya. Bersamaan dengan mesir, palestina juga mengalami masa paceklik. Nabi yakub menyuruh anak-anaknya, kecuali bunyamin, untuk berangkat ke mesir. Dan saudara-saudara yusuf datang ke mesir untuk memperoleh makanan. Sesampai di mesir, lalu mereka masuk ke tempat-Nya, yakni nabi yusuf, yang sedang mengawasi pembagian makanan. Maka nabi yusuf pun mengenali mereka, sedang mereka tidak mengenalinya. Dan ketika dia (nabi yusuf ) menyiapkan bahan makanan bagi saudara-saudaranya untuk mereka bawa pulang, dia berkata kepada mereka, bila kalian datang kembali ke mesir, bawalah kepadaku saudaramu yang seayah dengan kamu (bunyamin) agar aku bisa memberimu jatah bahan makanan lebih banyak lagi. Tidakkah kamu melihat bahwa aku menyempurnakan takaran, bahkan melebihkannya untuk kalian, dan di samping itu, aku adalah seorang penerima tamu yang terbaik dengan menjamu kalian secara sempurna'."
  }
]