[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagiamana tuhanmu telah memperlihatkan mimpi ini kepadamu, demikian pula Dia memilihmu dan mengajarkan kepadamu ta’bir mimpi yang dilihat manusia dalam tidur mereka, yang ditakwil kepada peristiwa nyata yang akan terjadi, dan menyempurnakan kenikmatanNya padamu dan pada keluarga ya’qub dengan karunia kenabian dan risalah, sebagaimana telah disempurnakanNya pada dua bapakmu;Ibrahim dan ishaq, dengan karunia kenabian dan risalah. Sesungguhnya tuhanmu maha mengetahui siapa yang pantas dipilihNya dari hamba-hambaNya juga mahabijaksana dalam pengaturan urusan-urusan makhluk-makhlukNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan sebagaimana engkau telah melihat mimpi itu, Tuhanmu pun akan memilihmu -wahai Yusuf- dan mengajarkan ilmu tabir mimpi kepadamu. Dan Dia akan menyempurnakan nikmat-Nya kepadamu dengan kenabian, sebagaimana Dia telah menyempurnakan nikmat-Nya kepada dua leluhurmu sebelum dirimu, Ibrahim dan Isḥāq. Sesungguhnya Tuhanmu Maha Mengetahui perihal makhluk-Nya, lagi Maha Bijaksana dalam mengurus makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Sebagaimana Tuhanmu memperlihatkanmu mimpi yang menandakan tingginya derajatmu, Dia juga akan memilihmu dan memberimu ilham untuk dapat menafsirkan mimpi. Dan Allah akan menyempurnakan kenikmatan-Nya bagimu dan bagi keturunanku dengan kenabian dan kerasulan; sebagaimana telah disempurnakan bagi kakekmu, Ibrahim dan Ishaq. Sungguh Tuhanmu Maha Mengetahui hamba-hamba-Nya yang berhak mendapat karunia, dan Maha Bijaksana dalam menyikapi perkataan dan perbuatan mereka. Dari Abdullah bin ‘Amr dari Rasulullah, beliau bersabda: “Orang yang mulia anaknya orang yang mulia anaknya orang yang mulia anaknya orang yang mulia; yaitu Yusuf bin Ya’qub bin Ishaq bin Ibrahim.” (Shahih Bukhari 8/212, kitab tafsir, surat Yusuf, bab ayat, no. 4688)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَكَذٰلِكَ يَجْتَبِيكَ رَبُّكَ (Dan demikianlah Tuhanmu, memilih kamu) Kemudian menjadikanmu seorang Nabi, Dia memilihmu dari hamba-hamba-Nya yang lain dan menjadikan mereka bagimu seperti matahari, bulan, dan bintang dalam mimpimu yang sujud didepanmu. وَيُعَلِّمُكَ مِن تَأْوِيلِ الْأَحَادِيثِ (dan diajarkan-Nya kepadamu sebahagian dari ta’bir mimpi-mimpi) Yakni takwil mimpi. وَيُتِمُّ نِعْمَتَهُۥ عَلَيْكَ(dan disempurnakan-Nya nikmat-Nya kepadamu) Sehingga mengumpulkan bagimu kenabian dan kekuasaan sebagaimana yang ditunjukkan oleh mimpi yang diperlihatkan Allah kepadamu; dan yang demikian itu terdapat kebaikan bagimu di dunia dan di akhirat. كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيْكَ مِن قَبْلُ إِبْرٰهِيمَ (sebagaimana Dia telah menyempurnakan nikmat-Nya kepada dua orang bapakmu sebelum itu, (yaitu) Ibrahim) Allah menyelamatkan nabi Ibrahim dari kobaran api, dan menjadikannya sebagai seorang nabi dan kekasih-Nya. وَإِسْحٰقَ ۚ (dan Ishak) Allah menjadikannya seorang Nabi. Kemudian dari Nabi Ibrahim dan Ishaq Allah memberikan mereka keturunan yang shaleh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Seperti pemilihan tersebutlah Tuhanmu memilihmu di antara seluruh hamba untuk mengemban kepentingan yang agung dan mengajarkanmu untuk memaknai mimpi, yaitu berita tentang sesuatu yang hilangnya sesuatu. Dia juga menyempurnakan nikmatNya kepadamu dengan memberi wahyu kenabian dan kerajaan. Dalam hal itu ada kebaikan dunia dan akhirat. Dia menyempurnakan nikmat atas keturunan Ya’kub sebagaimana Dia menyempurnakan nikmat kenabian atas kakekmu, Ibrahim, tatkala Dia menyelamatkannya dari api dan mengangkatnya sebagai Khalil, nabi, dan rasul. Serta Ishaq yang juga dijadikan sebagai nabi dan rasul. Sesungguhnya Tuhanmu Maha Mengetahui keluargha yang layak dipilih dan Maha Bijaksana dalam membuat dan mengatur hal tersebut. Dia meletakkan sesuatu pada tempatnya yang tepat. Kata {Aali} tidak digunakan kecuali untuk menyertakan orang yang agung dengan orang-orang agung lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah Tuhan memilihmu} memiluhmi {dan mengajarkan kepadamu sebagian takwil mimpi} menguraikan mimpi {serta menyempurnakan nikmatNya kepadamu} menyempurnakan nikmatNya kepadamu dengan kenabian {dan kepada keluarga Ya‘qub, sebagaimana Dia telah menyempurnakannya kepada kedua kakekmu sebelumnya, yaitu Ibrahim dan Ishaq. Sesungguhnya Tuhanmu Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. oleh karena itu, Allah berfirman ”dan demikianlah Rabbmu, memilih kamu (untuk menjadi nabi)” maksudnya menyeleksi dan memilihmu atas dasar sifat sifat luhur dan perangai bagus yang Allah anugerahkan kepadamu. ”dan Dia mengajarkan kepadamu sebagian dari ta’bir mimpi-mimpi” yakni berupa kemampuan menakwilkan mimpi dan penjelasan tentang kesudahan di balik berita berita yang benar seperti kitab kitab samawi dan lainnya. ”dan dia menyempurnakan nikmatNya kepadamu” di dunia dan akhirat dengan memberikan karunia kebaikan kepadamu di dunia dan karunia kebaikan di akhirat, ”sebagaimana dulu Allah menyempurnakannya (kenikmatan) kepada dua orang ayahmu, Ibrahim dan ishaq” dimana Allah memberikan kenikmatan bagi mereka berdua berupa bermacam macam kenikmatan yang besar lagi melimpah, bersifat agamis dan duniawi. ”sesungguhnya Rabbmu maha mengetahui lagi maha bijaksana” maksudnya ilmu Allah meliputi segala sesuatu, termasuk mencakup pula isi hati para manusia, yang berisi kebaikan atau lainnya. Lalu Dia menganugrahi setiap orang sesuai dengan hikmah dan pujianNya. Sesungguhnya Allah Mahabijaksana, Dia meletakan segala sesuatu pada letaknya, dan menempatkannya pada tempatnya masing masing."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَجۡتَبِيكَ رَبُّكَ) yajtabiika rabbuka : memilihmu untuk menjadi hambaNya yang shalih. (مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ) min ta’wiilil ahaadits : tafsir mimpi. (وَيُتِمُّ نِعۡمَتَهُۥ عَلَيۡكَ) wa yutimmu na’amatahu ‘alaik : menyempurnakan nikmatmu, dengan menjadikan mu nabi dan rasul-Nya. Makna ayat : Firman-Nya : (وَكَذَٰلِكَ يَجۡتَبِيكَ رَبُّكَ) “Sebagaimana Rabbmu memperlihatkan kepadamu bintang-bintang, matahari, dan bulan bersujud kepadamu, (يَجۡتَبِيكَ) Dia memilihmu untuk menjadi hamba-Nya yang saleh. Firman-Nya : (وَيُعَلِّمُكَ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ) mengajarimu cara menafsirkan suatu mimpi dan menyempurnakan karunia-Nya, dengan mengangkatmu menjadi seorang nabi dari keluarga Ya’qub—anak-anaknya. (كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيۡكَ مِن قَبۡلُ إِبۡرَٰهِيمَ وَإِسۡحَٰقَۚ) Sebagaimana Dia telah menyempurnakan nikmat-Nya kepada dua ayahmu, Ibrahim dan Ishaq. Ishaq, kakek Yusuf yang terdekat dan Ibrahim adalah yang terjauh. Sebagaimana Allah memberikan kepada mereka berbagai kenikmatan, dan yang terbesar adalah kenabian dan kerasulan. Firman-Nya : (إِنَّ رَبَّكَ عَلِيمٌ) Sesungguhnya Rabbmu Maha Mengetahui seluruh makhluk-Nya, (حَكِيمٞ) Maha Bijaksana dalam pengaturan-Nya. Meletakkan segala sesuatu pada posisinya, maka Dia memuliakan setiap yang berhak untuk dimuliakan dan menghalangi kenikmatan-Nya bagi orang yang pantas untuk itu. Pelajaran dari ayat : • Keutamaan yang Allah berikan kepada keluarga Ibrahim, memberikan mereka nikmat dan menjadikan ayah, anak, dan cucu menjadi seorang nabi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 6: Dengan mengauruniakan kepadamu sifat-sifat yang mulia dan perilaku yang baik. Yakni anak keturunannya. Terhadap makhluk-Nya. Dalam tindakan-Nya terhadap mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 6",
    "description": "Setelah nabi yusuf menceritakan mimpi itu kepada ayahnya, lalu ayahnya mempunyai firasat bahwa mimpi tersebut mempunyai arti penting, kemudian ia pun berkata, dan demikianlah, tuhan telah memilih engkau wahai putraku yusuf, dari sekian hamba-hamba lainnya. Dan selain itu Allah akan mengajarkan kepadamu sebagian dari takwil mimpi beserta berita tentang arti-arti mimpi, dan kelak akan menyempurnakan nikmat-Nya berupa kenabian dan kerajaan kepadamu dan kepada keluarga yakub, sebagaimana dia telah menyempurnakan nikmat-Nya berupa kenabian kepada kedua orang kakekmu sebelum itu, yaitu nabi ibrahim dan nabi ishak. Sungguh, tuhanmu maha mengetahui siapa yang berhak dipilih, dan mahabijaksana dalam memberi karunia kepada orang yang dikehendaki-Nya. Setelah dijelaskan tentang mimpi nabi yusuf dan isyarat akan dipilihnya dia sebagai nabi dan beberapa karunia lain yang akan diberikan Allah kepadanya, ayat berikut ini menjelaskan tentang sikap putraputra nabi yakub terhadap nabi yusuf, sebagaimana dijelaskan, sungguh, dalam kisah nabi yusuf dan saudara-saudaranya terdapat tanda-tanda kekuasaan Allah dan pelajaran berharga bagi orang yang bertanya tentang kisah itu. Kisah tersebut juga menjadi bukti kebenaran nabi Muhammad sebagai utusan Allah, karena mampu menjelaskan kisah nabi yusuf secara gamblang."
  }
]