[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka apabila kalian tidak membawanya kepadaku, kalian tidak akan mendapatkan di sisiku jatah bahan makanan yang aku takarkan bagi kalian, dan jangan datang kepadaku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Jika kalian tidak membawanya kepadaku berarti kalian berdusta dengan pengakuan kalian bahwa kalian mempunyai saudara seayah. Oleh karena itu aku tidak akan memberikan bahan makanan kepada kalian. Dan jangan pernah mendekati negeriku.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. فَإِن لَّمْ تَأْتُونِى بِهِۦ فَلَا كَيْلَ لَكُمْ عِندِى (Jika kamu tidak membawanya kepadaku, maka kamu tidak akan mendapat sukatan lagi) Yakni maka aku tidak akan menjual apapun kepada kalian di lain waktu. Namun untuk saat ini nabi Yusuf tetap memberikan yang mereka butuhkan secara penuh. وَلَا تَقْرَبُونِ (dan jangan kamu mendekatiku) Yakni aku tidak akan menjamu kalian sebagaimana aku menjamu kalian saat ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَلَا كَيْلَ لَكُمْ عِنْدِي وَلَا تَقْرَبُونِ } \"maka kamu tidak akan mendapat sukatan lagi dari padaku dan jangan kamu mendekatiku\" Dalam keadaan tertentu cara seperti ini perlu diterapkan; agar maslahat yang lebih urgen tercapai dengan baik, oleh karena itu selama maslahat yang utama belum tercapai, maka Yusuf menyampaikan kepada saudara-saudaranya bahwa tidak akan ada ta'awun sesama mereka dalam perkara ekonomi ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Jika kalian tidak membawakan Benyamin, maka aku tidak akan menukar dan menjual makanan untuk kalian, dan janganlah datang ke negeriku."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian tidak membawanya kepadaku, maka tidak akan ada jatah lagi bagi kalian dariku} maka tidak ada lagi bagi kalian makanan yang aku takarkan untuk kalian {dan janganlah mendekatiku”} Janganlah mendekati negeriku setelah itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Kemudian dia memperingatkan mereka jika tidak membawanya bersama dengan berkata, “JIka kamu tidak membawanya kepadaku, maka kamu tidak akan mendapatkan sukatan lagi dariku dan jangan kamu mendekatiku”, ucapan itu (dia lontarkan) karena dia tahu mereka akan terpaksa mendatangkannya ke hadapan Yusuf dan akan mendorong mereka untuk membawanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (فَإِن لَّمۡ تَأۡتُونِي بِهِۦ فَلَا كَيۡلَ لَكُمۡ عِندِي وَلَا تَقۡرَبُونِ) Jika kamu tidak membawanya kepadaku, maka kamu tidak akan mendapat jatah lagi dariku dan jangan kamu mendekatiku\"."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 60: Kalimat ini dan kalimat sebelumnya dimaksudkan agar mereka datang kembali dan merasa berat tidak membalas budi baiknya. Di dalam kalimat itu terdapat targhib (dorongan) dan tarhib (ancaman)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 60",
    "description": "Sebelum saudara-saudaranya kembali ke palestina, nabi yusuf mengingatkan mereka, maka jika kamu tidak membawanya kepadaku pada saat kedatangan kalian nanti, maka kalian tidak akan mendapat jatah gandum lagi dariku, dan jangan pula kamu mendekatiku lagi sesudah itu!mendengar peringatan nabi yusuf tersebut, mereka berkata, kami berjanji akan membujuk ayahnya, nabi yakub, untuk membawanya bersama kami nanti, dan kami benar-benar berjanji akan melaksanakannya seperti yang engkau pesankan."
  }
]