[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, ”kami akan mengerahkan usaha kami untuk membujuk ayahnya agar mau melepasnya(pergi) bersama kami, dan kami tidak akan mengendorkan usaha untuk itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Saudara-saudaranya menjawab, \"Kami akan memintanya kepada ayahnya. Dan kami akan berusaha dengan sungguh-sungguh untuk itu. Sesungguhnya kami benar-benar akan melaksanakan perintah anda dengan sungguh-sungguh.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Para saudaranya berkata: “Kami akan berusaha memintanya dari ayah kami agar dia mengutusnya bersama kami, sungguh kami akan melakukan apa yang kamu minta.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. قَالُوا۟ سَنُرٰوِدُ عَنْهُ أَبَاهُ (Mereka berkata: “Kami akan membujuk ayahnya untuk membawanya) Yakni kami akan memohon darinya dengan sungguh-sungguh. Terdapat pendapat mengatakan yang dimaksud adalah bujuk rayu dan tipu daya yang akan mereka kakukan kepada ayah mereka agar melepaskan Bunyamin kepada mereka. وَإِنَّا لَفٰعِلُونَ (sesungguhnya kami benar-benar akan melaksanakannya) Yakni melakukan bujuk rayu ini dengan sungguh-sungguh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Mereka berkata: “Kami akan berusaha membujuk ayahnya. Sungguh Kami akan melakukan hal itu dengan sungguh-sungguh”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Kami akan membujuk ayahnya} Kami akan berusaha meminta ayahnya untuk mengutusnya bersama kami {sesungguhnya kami benar-benar akan melaksanakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Mereka berkata, “Kami akan membujuk ayahnya untuk membawanya (ke mari)”, ini menunjukkan bahwa Ya’qub sangat mencintainya, tidak tahan jauh darinya. Beliau menghibur diri dengan Bunyamin setelah Yusuf (tidak ada lagi). Oleh karena itu, membutuhkan proses pendekatan untuk membawanya bersama mereka “dan sesungguhnya kami benar-benar akan melaksanakannya”, atas perintahmu kepada kami."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سَنُرَٰوِدُ عَنۡهُ أَبَاهُ) sanuraawidu ‘anhu abaahu : kami akan berusaha meminta kepadanya. Makna ayat : Setelah memaksa mereka, mereka pun menjawab—sebagaimana yang Allah kabarkan dengan firmannya : (قَالُواْ سَنُرَٰوِدُ عَنۡهُ أَبَاهُ وَإِنَّا لَفَٰعِلُونَ) kami akan mengusahakan meminta ayah kami agar mengizinkan untuk membawanya kesini. (وَإِنَّا لَفَٰعِلُونَ) dan kami benar-benar akan membawanya, sebagaimana yang kami kabarkan kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 61",
    "description": "Mendengar peringatan nabi yusuf tersebut, mereka berkata, kami berjanji akan membujuk ayahnya, nabi yakub, untuk membawanya bersama kami nanti, dan kami benar-benar berjanji akan melaksanakannya seperti yang engkau pesankan. Usai menyampaikan pesan tersebut kepada saudara-saudaranya, dia (nabi yusuf ) berkata kepada pelayan-pelayannya dengan maksud menanam budi, masukkanlah kembali barang-barang penukar yang tadi telah mereka tukarkan dengan makanan, ke dalam karung-karungnya, agar nanti mereka mengetahuinya apabila mereka telah kembali kepada keluarganya. Mudah-Mudahan dengan melihat barang-barang itu di karungkarung tersebut, mereka merasa berkewajiban untuk kembali lagi."
  }
]