[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan yusuf berkata kepada para pembantunya, ”taruhlah kembali barang-barang penukar untuk membayar yang mereka ambil, ke dalam barang-braang bawaan mereka secara sembunti-sembunyi, semoga mereka mengetahui bila telah pulang ke keluarga mereka dan menghargai penghormatan kita kepada mereka, supaya mereka kembali ke sini lantaran berhasrat besar terhadap pemberian kiita."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Yusuf berkata kepada para pekerjanya, \"Kembalikan barang dagangan mereka itu kepada mereka. Agar ketika kembali ke rumah mereka mengetahui bahwa kita belum mengambil barang dagangan mereka.\" Hal itu akan memaksa mereka untuk kembali lagi (ke negeri Mesir) bersama saudara mereka guna membuktikan kebenaran ucapan mereka kepada Yusuf dan menyerahkan barang dagangan mereka kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Kemudian Yusuf berkata kepada pekerjanya yang bertugas menakar makanan: “Kembalikanlah barang pembayaran mereka itu di tempat barang-barang mereka secara diam-diam, agar mereka mengenali barang pembayaran mereka jika mereka telah kembali kepada keluarga mereka, sehingga mereka menghargai pelayanan kita bagi mereka dan agar mereka kembali kepada kita karena ingin mendapat pemberian kita lagi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَقَالَ لِفِتْيٰنِهِ (Yusuf berkata kepada pelayan-pelayannya) Yakni para pembantunya. اجْعَلُوا۟ بِضٰعَتَهُمْ فِى رِحَالِهِمْ (Masukkanlah barang-barang (penukar kepunyaan mereka) ke dalam karung-karung mereka) Yakni kedalam wadah-wadah yang mereka gunakan untuk menyimpan makanan. Makna (البضاعة) yakni barang-barang yang mereka bawa dari negeri mereka untuk mereka tukar dengan makanan. لَعَلَّهُمْ يَعْرِفُونَهَآ إِذَا انقَلَبُوٓا۟ إِلَىٰٓ أَهْلِهِمْ(supaya mereka mengetahuinya apabila mereka telah kembali kepada keluarganya) Apabila mereka telah pulang ke keluarganya. لَعَلَّهُمْ يَرْجِعُونَ(mudah-mudahan mereka kembali lagi) Yakni kembali lagi kepada kami setelah mengetahui bahwa mereka telah mendapatkan bahan makanan tanpa membayar, dan agar mereka tidak dituduh mencuri barang-barang itu yang mungkin akan menjadikan mereka dilarang untuk membeli makanan lagi di lain waktu padahal mereka kini mengalami paceklik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tatkala saudara-saudara Yusuf datang menghadap kepadanya, dan Yusuf meminta kepada mereka untuk mendatangankan saudara kandungnya; ia memerintahkan kepada pembantu-pembantunya untuk meletakkan barang-barang mereka ke atas kendaraan, namun ketika Yusuf ingin mengambil saudara kandungnya; Yusuf meletakkan piala dengan sendirinya { فَلَمَّا جَهَّزَهُمْ بِجَهَازِهِمْ جَعَلَ السِّقَايَةَ فِي رَحْلِ أَخِيهِ } \"Maka tatkala telah disiapkan untuk mereka bahan makanan mereka, Yusuf memasukkan piala (tempat minum) ke dalam karung saudaranya\" karena perintah Yusuf yang pertama sekedar isyarat akan keseriusannya agar saudaranya didatangkan kehadapannya, maka tidak membutuhkan taktik yang cerdik, namun tatkala ia ingin mengambil saudaranya dari rombongan ia membutuhkan taktik agar rencana itu tercapai dengan baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Yusuf berkata kepada orang-orang yang menimbang: “Masukkanlah alat tukar mereka ke dalam muatan-muatan mereka, supaya mereka tahu dan menyadari bahwa alat tukar tersebut dikembalikan, serta berharap bisa kembali. Ketika mereka kembali kepada keluarganya, mereka mendapati alat tukar tersebut. Barangkali mereka akan kembali kepada kita. Kesadaran mereka terhadap kembalinya alat tukar tersebut akan mendorong mereka untuk kembali lagi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata kepada para pembantunya“} kepada pelayan mudanya {Masukkanlah barang-barang mereka} alat tukar untuk makanan mereka {ke dalam karung-karung mereka} harta benda mereka {agar mereka mengetahuinya ketika telah kembali} kembali {kepada keluarga mereka. Mudah-mudahan mereka kembali lagi."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Dan dia berkata”, yaitu Yusuf “kepada pelayan-pelayannya”, yang membantu pelayanannya, “Masukkanlah barang-barang (penukar kepunyaan mereka)”, alat penukar mereka untuk membeli bahan makanan dari Yusuf “ke dalam karung-karung mereka, supaya mereka mengetahuinya”, maksudnya mengetahui barang-barang kepunyaan mereka, ketika mereka melihatnya nanti di dalam karung-karung mereka “mudah-mudahan mereka kembali lagi.” Disebabkan ketidaknyamanan perasaan pada diri mereka untuk mengambilnya setelah mendengar apa yang dikatakan Yusuf. Tampaknya, Yusuf ingin memotivasi mereka untuk mendapatkan kebaikan dari Yusuf bagi mereka dengan cara memberi sukatan yang penuh disertai mengembalikan barang-barang mereka dengan cara yang tidak dapat dijangkau oleh kepekaan mereka dan tanpa mereka sadari apa yang terjadi nantinya. Sesungguhnya sikap baik mengharuskan seseorang untuk memenuhi janji kepada orang yang telah berbuat baik kepadanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَقَالَ لِفِتۡيَٰنِهِ) wa qaala li fityaanihi : para budak dan pembantunya. (بِضَٰعَتَهُمۡ) bidhaa’atahum : dirham mereka yang dipakai untuk membeli bahan pangan. Makna ayat : Firman-Nya : (وَقَالَ لِفِتۡيَٰنِهِ ٱجۡعَلُواْ بِضَٰعَتَهُمۡ فِي رِحَالِهِمۡ) Allah ta’ala mengkabarkan perkataan Yusuf kepada para pembantunya : Kembalikanlah dirham—yang mereka gunakan untuk membeli bahan makanan—kedalam karung-karung mereka, secara diam-diam (لَعَلَّهُمۡ يَعۡرِفُونَهَآ إِذَا ٱنقَلَبُوٓاْ إِلَىٰٓ أَهۡلِهِمۡ لَعَلَّهُمۡ يَرۡجِعُونَ) ini semua karena keinginan Yusuf untuk menghadirkan saudara kandungnya, maka ia mengembalikan dirham mereka, karena jika mereka mendapati uang mereka dikembalikan mereka tidak ingin mengambilnya dan akan mengembalikannya, dan mereka akan datang bersama saudara mereka. Inilah yang keinginan Yusuf ‘alaihi salam yang Allah kabulkan. Pelajaran dari ayat : • Efek iman dalam kepribadian seseorang. Yusuf mengetahui bahwa para saudaranya tidak akan memakan harta yang bukan hak mereka, maka ia mengembalikan dirham kedalam karung-karung agar mereka kembali dengan dirham tersebut dan juga saudaranya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 62: Menurut kebanyakan ahli tafsir, barang-barang dari saudara-saudara Yusuf yang digunakan sebagai alat penukar bahan makanan itu ialah kulit dan terompah (sandal). Tindakan ini diambil oleh Yusuf sebagai siasat, dengan cara menaruh budi baiknya kepada mereka, agar mereka nantinya bersedia kembali lagi ke Mesir dengan membawa Bunyamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 62",
    "description": "Usai menyampaikan pesan tersebut kepada saudara-saudaranya, dia (nabi yusuf ) berkata kepada pelayan-pelayannya dengan maksud menanam budi, masukkanlah kembali barang-barang penukar yang tadi telah mereka tukarkan dengan makanan, ke dalam karung-karungnya, agar nanti mereka mengetahuinya apabila mereka telah kembali kepada keluarganya. Mudah-Mudahan dengan melihat barang-barang itu di karungkarung tersebut, mereka merasa berkewajiban untuk kembali lagi. Setelah bahan makanan yang menjadi hak saudara-saudara nabi yusuf masuk seluruhnya ke dalam karung-karung, mereka lantas bertolak menuju palestina untuk menemui nabi yakub, ayah mereka. Maka ketika mereka telah kembali kepada ayah mereka, mereka lalu berkata, wahai ayah kami! kami tidak akan mendapat jatah gandum lagi dari penguasa mesir jika kami tidak membawa serta saudara kami, bunyamin. Sebab itu, wahai ayah, biarkanlah saudara kami itu pergi bersama kami ke mesir agar kami mendapat jatah makanan dari penguasa mesir, dan kami berjanji benar-benar akan menjaganya dan tidak akan mengulangi kesalahan yang pernah kami lakukan kepada yusuf."
  }
]