[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian ketika mereka pulang kembali kepada ayah mereka, mereka menceritakan kepadanya penghormatan pembesar mesir itu kepada mereka, dan mereka berkata kepadanya, ”sesungguhnya dia tidak akan memberikan kepada kami (bahan makanan) pada waktu yang akan datang, kecuali apabila datang bersama kami saudara kami yang telah kami beritahukan kepadanya. Maka izinkanlah dia pergi bersama kami, supaya kami dapat membawa bahan makanan dengan penuh, dan kami berjanji untuk menjaganya dengan baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Setelah mereka kembali ke tempat ayah mereka dan menceritakan perihal kebaikan yang mereka terima dari Yusuf mereka berkata, \"Wahai Ayah kami! Kami tidak akan mendapatkan bahan makanan jika kami tidak membawa saudara kami. Maka biarkanlah dia pergi bersama kami. Karena jika ayah membiarkan dia pergi bersama kami niscaya kami bisa mendapatkan bahan makanan. Sungguh, kami berjanji kepada Anda untuk menjaganya dengan baik agar dia bisa kembali kepada Anda dengan selamat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Ketika para saudaranya kembali kepada ayah mereka, mereka berkata kepadanya dengan lembut dan menceritakan jamuan yang dilakukan menteri bagi mereka, dan dia tidak akan memberi makanan yang banyak lagi kecuali jika mereka dapat pergi bersama saudara mereka. Mereka meminta agar sang ayah mengutus saudara mereka pergi bersama mereka agar mendapat makanan yang banyak, dan mereka berjanji akan menjaganya dari segala hal yang tidak diinginkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. فَلَمَّا رَجَعُوٓا۟ إِلَىٰٓ أَبِيهِمْ قَالُوا۟ يٰٓأَبَانَا مُنِعَ مِنَّا الْكَيْلُ (Maka tatkala mereka telah kembali kepada ayah mereka (Ya’qub) mereka berkata: “Wahai ayah kami, kami tidak akan mendapat sukatan (gandum) lagi) Yakni kami tidak dapat membeli lagi bahan makanan di lain waktu. Kemudian mereka menceritakan apa yang diperintahkan Nabi Yusuf kepada mereka, lalu mereka berkata, “oleh sebab itu biarkanlah saudara kami pergi bersama kami. فَأَرْسِلْ مَعَنَآ أَخَانَا(sebab itu biarkanlah saudara kami pergi bersama-sama kami) Yakni Bunyamin. نَكْتَلْ (supaya kami mendapat sukatan) Karena kami membawa Bunyamin maka kami akan mendapatkan makanan yang kami harap. Yakni jika ayah membiarkan kami membawa Bunyamin maka kami akan dapat memperolah bahan makanan, namun jika tidak maka kami akan dilarang untuk mendapat bahan makanan. وَإِنَّا لَهُۥ (dan sesungguhnya kami baginya) Yakni bagi saudara mereka, Bunyamin. لَحٰفِظُونَ (benar benar akan menjadi para penjaganya) Yang menjaganya dari keburukan atau sesuatu yang dibenci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Ketika kembali dari perjalanan dan menghadap Ayah, mereka berkata: ”Wahai ayah, Kami tidak akan diberi makanan di waktu mendatang bila engkau tidak mengutus Benyamin bersama kami, agar kami bisa membawa sesuatu yang kita butuhkan. Maka utuslah dia bersama kami, supaya kami bisa mendapatkan makanan. Sungguh Kami akan menjaganya dari sesuatu yang tidak disenangi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka telah kembali kepada ayah mereka, mereka berkata,“Wahai ayah kami, kita tidak diperbolehkan mendapat jatah lagi, Jadi utuslah saudara kami pergi bersama kami, agar kami mendapat jatah. Sesungguhnya kami benar-benar akan menjaganya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “Maka tatkala mereka telah kembali kepada ayah mereka(Ya’qub), mereka berkata, ‘Wahai ayah kami, kami kami tidak akan mendapat sukatan (gandum) lagi’,” jika kamu tidak mengutus saudara kami bersama kami “sebab itu biarkanlah saudara kami pergi bersama-sama kami supaya kami mendapat sukatan”, maksudnya agar hal itu menjadi penyebab kita mendapatkan sukatan lagi, kemudian mereka akan benar-benar menjaganya. Mereka berkata, “dan sesungguhnya kami benar-benar akan menjaganya”, dari hal-hal buruk yang mengancamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 63",
    "description": "Setelah bahan makanan yang menjadi hak saudara-saudara nabi yusuf masuk seluruhnya ke dalam karung-karung, mereka lantas bertolak menuju palestina untuk menemui nabi yakub, ayah mereka. Maka ketika mereka telah kembali kepada ayah mereka, mereka lalu berkata, wahai ayah kami! kami tidak akan mendapat jatah gandum lagi dari penguasa mesir jika kami tidak membawa serta saudara kami, bunyamin. Sebab itu, wahai ayah, biarkanlah saudara kami itu pergi bersama kami ke mesir agar kami mendapat jatah makanan dari penguasa mesir, dan kami berjanji benar-benar akan menjaganya dan tidak akan mengulangi kesalahan yang pernah kami lakukan kepada yusuf. Mendengar permintaan anak-anaknya, dia (yakub) berkata, bagaimana aku tidak khawatir akan mempercayakannya (bunyamin) kepadamu seperti kekhawatiran yang aku rasakan ketika telah mempercayakan saudaranya (yusuf) kepada kamu dahulu' akan tetapi, karena kamu memaksa untuk membawa bunyamin, maka aku serahkan semuanya kepada Allah. Maka Allah adalah penjaga yang terbaik bagi hambahamba-Nya, dan dia maha penyayang di antara para penyayang."
  }
]