[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ayah mereka berkata kepada mereka, “ Bagaimana aku percaya kepada kalian untuk menjaga Bunyamin, dan sungguh aku pernah percayakan saudaranya (Yusuf) sebelumnya pada kalian, dan kalian berkomitmen untuk menjaganya, akan tetapi kalian tidak menepati hal itu? Karenanya, aku tidak percaya terhadap kemitmen dan penjagaan kalian. Akan tetapi, Aku akan percaya terhadap perlindungan Allah. (Dia) sebaik-baik yang menjaga dan sebaik-baik Dzat yang menyayangi. Aku berharap Dia merahmatiku, lalu menjaganya dan mengembaliaknya kepadaku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Sang ayah berkata kepada mereka, \"Apakah aku akan mempercayakan dia kepada kalian sebagaimana aku telah mempercayakan saudara kandungnya, Yusuf kepada kalian?! Aku sudah mempercayakan dia kepada kalian dan kalian telah berjanji untuk menjaganya. Tetapi kalian tidak memenuhi janji kalian. Oleh karena itu, aku tidak percaya lagi dengan janji kalian untuk menjaganya. Aku hanya percaya kepada Allah, karena Dia adalah sebaik-baik penjaga bagi orang yang hendak dijaga-Nya dan sebaik-baik penyayang bagi orang hendak disayangi-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Ayah mereka menjawab dengan penuh pengingkaran: “Bagaimana aku akan mempercayai kalian dalam menjaga saudara kalian ini? karena kepercayaanku akan seperti ketika aku mempercayai kalian untuk menjaga Yusuf sebelumnya, kemudian kalian pergi bersamanya namun tidak membawanya pulang. Sungguh aku tidak dapat tenang dalam mengabulkan permintaan kalian, namun aku percaya dengan penjagaan Allah, Dialah sebaik-baik penjaga dan Dzat yang paling mengasihi hamba-hamba-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. قَالَ هَلْ ءَامَنُكُمْ عَلَيْهِ إِلَّا كَمَآ أَمِنتُكُمْ عَلَىٰٓ أَخِيهِ مِن قَبْلُ ۖ (Berkata Ya’qub: “Bagaimana aku akan mempercayakannya (Bunyamin) kepadamu, kecuali seperti aku telah mempercayakan saudaranya (Yusuf) kepada kamu dahulu?”) Nabi Ya’kub khawatir mereka akan mengkhianatinya seperti ketika mereka berkhianat dalam menjaga nabi Yusuf. فَاللهُ خَيْرٌ حٰفِظًا ۖ وَهُوَ أَرْحَمُ الرّٰحِمِينَ ( Maka Allah adalah sebaik-baik Penjaga dan Dia adalah Maha Penyanyang diantara para penyanyang) Maka nabi Ya’kub bertawakkal kepada Allah agar Dia menjauhkan marabahaya darinya dan dari keluargannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Ya’kub berkata kepada anak-anaknya: “Bagaimana bisa aku mempercayakan Benyamin kepada kalian, kecuali seperti aku mempercayakan saudaranya, Yusuf kepada kalian sebelumnya tatkala kalian pergi ke padang pasir dan tidak kembali bersamanya?” Ini adalah kekhawatiran Ya’kub terhadap tipuan mereka untuk kedua kalinya. Dan Allah itu sebaik-baik penjaga baginya. Aku berpegang teguh dan berserah diri kepadaNya. Allah SWT adalah Dzat paling pengasih terhadapku. Dia mengasihi masa tuaku dan keterikatanku terhadap anakku. Aku berharap agar Dia mengembalikan anakku, sehingga semuanya berkumpul sempurna."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Bagaimana aku akan memercayakannya kepada kalian, seperti aku telah mempercayakan saudaranya} Yusuf {kepada kalian sebelumnya. Allah adalah sebaik-baik penjaga. dan Dia Maha Penyayang di antara para penyayang.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Dia berkata”, yakni Ya’qub berkata kepada mereka “Bagaimana (mungkin) aku akan mempercayakannya (Bunyamin) kepadamu, melainkan sebagaimana aku telah mempercayakan saudaranya (Yusuf) kepada kamu dahulu”, maksudnya sebelumnya, kalian telah bersumpah pada diri sendiri dengan penegasan yang lebih daripada ini untuk menjaga Yusuf, namun demikian kalian tidak menepati janji (penegasan melindungi Yusuf) yang kalian canangkan. Saya sudah tidak percaya lagi dengan janji dan perlindungan kalian. Saya hanya percaya dengan Allah saja. “Maka Allah adalah sebaik-baik Penjaga, dan DIa adalah Maha Penyayang di antara para penyayang”, maksudnya Dia mengetehaui kondisiku dan aku berharap agar Dia merahmatiku sehingga menjaga Bunyamin dan memulangkannya kepadaku. Seakan-akan dalam ungkapan ini, hati beliau sudah lunak untuk melepas kepergian Bunyamin bersama mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 64: Maksudnya, bahwa Ya'kub ‘alaihis salam tidak dapat mempercayakan Bunyamin kepada saudara-saudaranya, karena dia khawatir akan terjadi peristiwa seperti yang dialami oleh Yusuf dahulu. Yakni aku berharap Allah menjaganya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 64",
    "description": "Mendengar permintaan anak-anaknya, dia (yakub) berkata, bagaimana aku tidak khawatir akan mempercayakannya (bunyamin) kepadamu seperti kekhawatiran yang aku rasakan ketika telah mempercayakan saudaranya (yusuf) kepada kamu dahulu' akan tetapi, karena kamu memaksa untuk membawa bunyamin, maka aku serahkan semuanya kepada Allah. Maka Allah adalah penjaga yang terbaik bagi hambahamba-Nya, dan dia maha penyayang di antara para penyayang. Anak-anak nabi yakub belum juga berhasil meyakinkan ayah mereka untuk membawa bunyamin ke mesir. Dan ketika mereka membuka barang-barangnya di hadapan nabi yakub, mereka menemukan bahwa barang-barang yang mereka jadikan penukar dengan bahan makanan yang mereka perlukan dikembalikan oleh nabi yusuf kepada mereka. Mereka berkata, wahai ayah kami! apalagi yang kita inginkan dari perjalanan ke mesir' semua bahan makanan sudah kita peroleh. Lihatlah ini, barang-barang kita dikembalikan lagi kepada kita oleh penguasa mesir itu. Apabila kami berangkat lagi ke mesir dengan membawa serta bunyamin, tentu kita akan mendapat bahan makanan yang lebih banyak, dan dengan itu kita akan dapat memberi makan keluarga kita. Kami berjanji akan memelihara dan menjaga saudara kami, bunyamin. Dengan membawa serta bunyamin, dapat kami bayangkan kegembiraan penguasa mesir itu, dan kita pasti akan mendapat tambahan jatah gandum yang lebih banyak, yakni seberat beban seekor unta. Memberikan bahan makanan sebanyak itu adalah suatu hal yang mudah bagi seorang penguasa mesir."
  }
]