[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika mereka membawa barang-barang bawaan mereka, mereka menemukan barang penukar barang-barang bawaan mereka yang mereka bayarkan kepada mereka telah di kembalikan kepada mereka. Mereka berkata, “ Wahai Ayah kami, apalagi yang kita cari yang lebih dari ini? Ini barang penukar barang-barang penukar kami telah di kembalikan oleh pembesar itu kepada kita. Maka tenanglah engkau terhadap saudara kami dan biarkanlah dia pergi bersama kami, supaya kami dapat membawa pulang bahan makanan yang penuh bagi keluarga kita, dan kami akan menjaga saudara kami serta mendapat bawaan seberat beban seekor unta. Sebab, Sesungguhnya pembesar Mesir itu memberi takaran bagi setiap orang sebarat beban seekor unta. Dan itu adalah sukatan yang ringan baginya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Tatkala mereka membuka wadah bahan makanan yang mereka bawa ternyata mereka mendapati barang dagangan mereka dikembalikan kepada mereka. Lalu mereka berkata kepada ayah mereka, \"Apa lagi yang kita inginkan dari Raja itu setelah kebaikannya ini? Ini barang yang seharusnya ditukar dengan bahan makanan kita ternyata dikembalikan oleh Sang Raja untuk menunjukkan kemurahannya kepada kita, dan kita bisa mendapatkan bahan makanan untuk keluarga kita (secara cuma-cuma). Kita akan menjaga saudara kita dari apa yang Anda takutkan. Dan kita akan mendapat tambahan satu muatan unta dengan membawa dia. Tambahan satu muatan unta adalah perkara mudah bagi Sang Raja.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Ketika mereka membuka barang-barang, mereka terkejut dengan adanya barang yang mereka gunakan untuk pembayaran, ternyata Yusuf mengembalikannya sebagai penghargaan bagi mereka. Maka mereka kembali merayu ayah mereka, Ya’qub: “Wahai ayah kami, penghargaan apa lagi yang kita inginkan? Ini adalah barang pembayaran kita telah dikembalikan kepada kita; kami akan kembali pergi untuk mendatangkan makanan bagi keluarga kita, dan kami akan menjaga saudara kami yang engkau utus bersama kami, sehingga kami akan mendapatkan makanan satu muatan unta yang lebih banyak dari sebelumnya, dan akan sangat mudah mendapatkannya karena kami memenuhi permintaan menteri.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَجَدُوا۟ بِضٰعَتَهُمْ رُدَّتْ إِلَيْهِمْ ۖ (mereka menemukan kembali barang-barang (penukaran) mereka, dikembalikan kepada mereka) Yakni barang-barang yang mereka bawa ke negeri Mesir untuk mereka tukar dengan bahan makanan. مَا نَبْغِى (apa lagi yang kita inginkan) Yakni apa lagi yang kita inginkan dari raja ini setelah ia berbuat baik kepada kita dengan mengembalikan barang-barang kita serta memuliakan kami ketika kami mendatanginya. Pendapat lain mengatakan maknanya adalah kami tidak berbohong dalam berkata dan tidak melebih-lebihkan kisah yang kami ceritakan kepadamu. هٰذِهِۦ بِضٰعَتُنَا رُدَّتْ إِلَيْنَا (Ini barang-barang kita dikembalikan kepada kita) Dan orang yang berbaik hati kepada mereka dengan mengembalikan barang-barang kepada mereka, maka ia layak untuk mendapat pujian. وَنَمِيرُ أَهْلَنَا(dan kami akan dapat memberi makan keluarga kam) Agar kita dapat mendapatkan makanan untuk keluarga kita. وَنَحْفَظُ أَخَانَا(dan kami akan dapat memelihara saudara kami) Yakni menjaga Bunyamin dari apa yang kamu khawatirkan. وَنَزْدَادُ (dan kami akan mendapat tambahan sukatan (gandum)) Karena kamu mengizinkan Bunyamin untuk pergi bersama kami. كَيْلَ بَعِيرٍ ۖ (seberat beban seekor unta) Yakni lebih seangkutan seekor unta dari makanan yang dulu kami dapatkan, yakni dengan muatan unta Bunyamin yang pergi bersama kami. ذٰلِكَ كَيْلٌ يَسِيرٌ (Itu adalah sukatan yang mudah (bagi raja Mesir)) Yakni tambahan bahan makanan sepenuh muatan unta milik Bunyamin sangat ringan bagi raja, ia tidak akan merasa berat dan tidak akan mempersulit kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Dan ketika mereka membuka muatan-muatan makanannya, mereka mendapati didalamnya terdapat alat tukar yang dikembalikan kepada mereka. Mereka berkata: “Wahai Ayah, apa lagi yang kita butuhkan daripada kemuliaan yang banyak ini, yaitu pemberian hasil pertanian dan pengembalian alat tukar? Harta kita ini dikembalikan lagi atas anugerah Allah. Kami akan menukar makanan dan tetap menjaga saudara kami ketika berangkat dan pulang. Kami akan menambah takaran seberat seekor unta dengan adanya saudara kami, Benyamin. Tambahan takaran biji-bijian tersebut akan mudah didapatkan dan diberikan oleh sang raja karena kedermawanannya dan melimpahnya hasil panen yang dimilikinya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka membuka barang-barang mereka} karung-karung mereka {mereka menemukan barang-barang (penukar) mereka dikembalikan kepada mereka. Mereka berkata,“Wahai ayah kami, apa yang kita inginkan} apa lagi yang kita cari setelah pemuliaan ini? {Ini adalah barang-barang kita} dirham-dirham kita {yang dikembalikan kepada kita, kita akan dapat mendatangkan makanan untuk keluarga kita} membawakan makanan untuk keluarga kita {dan kami akan menjaga saudara kami, dan kami akan mendapat tambahan jatah seberat beban seekor unta} seberat unta {Itu adalah suatu jatah yang mudah} mudah bagi raja yang baik ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Kemudian mereka itu “Tatkala mereka membuka barang-barangnya, mereka menemukan kembali barang-barang (penukaran) mereka, dikembalikan kepada mereka”, ini merupakan bukti petunjuk bahwa telah diketahui oleh mereka ia ingin mereka tetap memilikinya. Maka mereka berkata kepada sang ayah untuk mendorongnya agar melepaskan saudara mereka bersama mereka, “Wahai ayah kami apalagi yang kita inginkan”, apa yang ingin kita cari-cari lagi setelah penyambutan yang baik ini dengan cara menyempurnakan sukatan bagi kita dan mengembalikan barang-barang kita dalam bentuk yang (baik semacam ini) yang mengandung makna keikhlasan dan keluhuran budi? “Ini barang-barang kita dikembalikan kepada kita, dan kami akan dapat memberi makan keluarga kami”, maksudnya jika kami pergi bersama saudara kami ini, maka itu akan menjadi penyebab Yusuf memberi sukatan kepada kita sehingga kita bisa memberi makan keluarga kita dan dapat membawakan kepada mereka bahan makanan yang mereka butuhkan. “Dan kami akan dapat memelihara saudara kami, dan kami akan mendapat tambahan sukatan (gandum) seberat beban seekor unta”, lantaran mengirimkan saudara kami bersama kami, karena Yusuf memberi takaran setiap orang seberat pikulan yang dibawa oleh unta. “Itu adalah sukatan yang mudah (bagi raja Mesir)”, dan tidak mengakibatkan bahaya pada dirimu. Karena masa perjalanan tidak lama, sementara itu kemaslahatan (yang akan diraih) sudah sangat jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 65: Setelah penghormatan ini, di mana ia telah memenuhi untuk kita takaran dan mengembalikan barang-barang kita yang menunjukkan keikhlasannya dan akhlaknya yang mulia. Jika kami membawa saudara kami pergi bersama kami yang menjadi sebab ia memberikan makanan kepada kita. Karena untuk satu orang mendapat jatah makanan seberat beban seekor unta. Yakni karena kedermawanannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 65",
    "description": "Anak-anak nabi yakub belum juga berhasil meyakinkan ayah mereka untuk membawa bunyamin ke mesir. Dan ketika mereka membuka barang-barangnya di hadapan nabi yakub, mereka menemukan bahwa barang-barang yang mereka jadikan penukar dengan bahan makanan yang mereka perlukan dikembalikan oleh nabi yusuf kepada mereka. Mereka berkata, wahai ayah kami! apalagi yang kita inginkan dari perjalanan ke mesir' semua bahan makanan sudah kita peroleh. Lihatlah ini, barang-barang kita dikembalikan lagi kepada kita oleh penguasa mesir itu. Apabila kami berangkat lagi ke mesir dengan membawa serta bunyamin, tentu kita akan mendapat bahan makanan yang lebih banyak, dan dengan itu kita akan dapat memberi makan keluarga kita. Kami berjanji akan memelihara dan menjaga saudara kami, bunyamin. Dengan membawa serta bunyamin, dapat kami bayangkan kegembiraan penguasa mesir itu, dan kita pasti akan mendapat tambahan jatah gandum yang lebih banyak, yakni seberat beban seekor unta. Memberikan bahan makanan sebanyak itu adalah suatu hal yang mudah bagi seorang penguasa mesir. Mendengar berbagai alasan dari anak-anaknya untuk mengajak serta bunyamin, dia (nabi yakub) kemudian berkata, aku tidak akan melepaskannya pergi bersama kamu ke mesir sebelum kamu semua bersumpah kepadaku atas nama Allah bahwa kamu pasti akan membawanya kepadaku kembali dari sana, kecuali jika kamu mendapat hambatan atau musibah di tengah jalan, seperti dikepung musuh sehingga kamu tidak mampu mengembalikannya kepadaku. Setelah mereka mengucapkan sumpah akan memenuhi permintaannya, dia (nabi yakub) berkata, Allah adalah menjadi saksi terhadap apa yang kita ucapkan."
  }
]