[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’qub berkata kepada mereka, “Aku tidak akan membiarkan dia pergi bersama kalian sampai kalian berjnji dan bersumpah kepadaku dengan Nama Allah untuk mengembalikanya kepadaku, kecuali kalian ditundukan musuh dan kalian tidak mampu melepaskan diri.” Setelah mereka memberikan janji dengan Nama Allah sesuai dengan yang di minta Ya’qub maka Ya’qub berkata, ”Allah menjadi saksi atas yang kalian ucapkan.” Yakni, cukuplah kita kesaksianNya atas kita dan penjagaanNya bagi kita."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Sang ayah berkata kepada mereka, \"Aku tidak akan membiarkan dia pergi bersama kalian sebelum kalian memberiku janji yang kuat atas nama Allah, bahwa kalian benar-benar akan mengembalikan dia kepadaku. Kecuali jika kalian semua terkepung dan tidak menyisakan satupun dari kalian, sedangkan kalian tidak sanggup melawannya dan tidak bisa pulang ke rumah.\" Setelah mereka memberikan janji yang kuat atas nama Allah, bahwa mereka akan melakukan hal itu ayah mereka berkata, \"Allah adalah saksi atas apa yang kita ucapkan. Dan cukuplah kesaksian Allah bagi kita.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Ya’qub menjawab mereka dengan lembut dan menolak mengutus saudara mereka ke Mesir hingga mereka mau berjanji dan bersumpah dengan nama Allah agar mereka membawanya kembali dengan selamat, kecuali jika mereka diserang dan tidak mampu membela diri. Ketika mereka berjanji untuk melakukan apa yang ayah mereka minta, dia berkata kepada mereka: “Allah adalah saksi atas apa yang kita bicarakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. قَالَ لَنْ أُرْسِلَهُۥ مَعَكُمْ حَتَّىٰ تُؤْتُونِ مَوْثِقًا مِّنَ اللهِ (Ya’qub berkata: “Aku sekali-kali tidak akan melepaskannya (pergi) bersama-sama kamu, sebelum kamu memberikan kepadaku janji yang teguh atas nama Allah) Yakni sampai kalian memberiku sesuatu yang dapat membuatku percaya kepada kalian, yaitu dengan bersumpah dengan nama Allah. لَتَأْتُنَّنِى بِهِۦٓ (bahwa kamu pasti akan membawanya kepadaku kembali) Kalian harus benar-benar mengembalikan Bunyamin kepadaku. إِلَّآ أَن يُحَاطَ بِكُمْ ۖ (kecuali jika kamu dikepung musuh) Kecuali jika kalian diserang dan dikalahkan musuh, maka itu dapat menjadi uzur bagi kalian. فَلَمَّآ ءَاتَوْهُ مَوْثِقَهُمْ(Tatkala mereka memberikan janji mereka) Yakni mereka mengucapkan sumpah janji untuknya. قَالَ اللهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ(maka Ya’qub berkata: “Allah adalah saksi terhadap apa yang kita ucapkan (ini)”) Dia Maha Melihat, tidak ada yang tersembunyi baginya, dan Dia akan menghukum orang yang berkhianat dalam janjinya dan melanggar sumpahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Ya’kub berkata kepada anak-anaknya: “Aku tidak akan mengutus Benyamin bersama kalian sampai kalian memberikan janji yang dikuatkan dengan bersumpah demi Allah untuk membawanya kembali kepadaku, kecuali kalian akan dikepung musuh dan dihadapkan pada kehancuran, lalu kalian akan dibinasakan kecuali dia (Benyamin), maka meminta maaflah kepadaku.” Ketika mereka telah memberikan janji sesuai yang diminta dan melaksanakan apa yang diperintahkan dengan bersumpah, Ya’kub berkata: “Allah itu menyaksikan, mengawasi dan mengamati apa yang kita ucapkan berupa perjanjian dan membawa pulang saudramu. Dia akan menghukum orang yang mengingkari janji dan merusak kepercayaan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Ya’kub berkata kepada mereka {“Aku tidak akan mengutusnya pergi bersama kalian, sebelum kalian memberikan} memberikan {sumpah kepadaku atas (nama) Allah} janji kepada Allah yang dikuatkan dengan sumpah {bahwa kalian pasti akan membawanya kembali kepadaku, kecuali jika kalian dikepung”} kalian semua dibinasakan {Setelah mereka memberikan janji kepadanya} memberikan janji mereka kepadanya {dia berkata,“Allah adalah saksi} saksi {terhadap apa yang kita ucapkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Ya’qub berkata kepada mereka, “Aku sekali-kali tidak akan melepaskannya (pergi) bersama-sama kamu, sehingga kamu memberikan kepadaku janji yang tegus atas Nama Allah”, yaitu janji kuat, kalian bersumpah atas nama Allah “bahwa kamu pasti akan membawanya kepadaku kembali, kecuali jika kamu dikepung musuh”, maksudnya kecuali kalian ditimpa masalah yang kalian tidak dapat menghadapinya dan tidak berdaya untuk menyingkirkannya, “Tatkala mereka memberikan janji mereka”, terhadap yang beliau ucapkan dan inginkan, “maka Ya’qub berkata, ‘Allah adalah saksi terhadap apa yang kita ucapkan (ini)’.” PersaksianNya atas diri kita dan penjagaan serta pemeliharaanNya sudah cukup bagi kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 66: Yakni kecuali jika datang kepadamu perkara yang bukan dari dirimu dan kamu tidak dapat menolak darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 66",
    "description": "Mendengar berbagai alasan dari anak-anaknya untuk mengajak serta bunyamin, dia (nabi yakub) kemudian berkata, aku tidak akan melepaskannya pergi bersama kamu ke mesir sebelum kamu semua bersumpah kepadaku atas nama Allah bahwa kamu pasti akan membawanya kepadaku kembali dari sana, kecuali jika kamu mendapat hambatan atau musibah di tengah jalan, seperti dikepung musuh sehingga kamu tidak mampu mengembalikannya kepadaku. Setelah mereka mengucapkan sumpah akan memenuhi permintaannya, dia (nabi yakub) berkata, Allah adalah menjadi saksi terhadap apa yang kita ucapkan. Ketika tiba saat bagi anak-anak nabi yakub bersama bunyamin berangkat ke mesir, timbul firasat di hati nabi yakub tentang kesulitan yang akan mereka hadapi. Dan dia (nabi yakub) berkata kepada mereka, wahai anak-anakku! begitu sampai di mesir, janganlah kamu masuk bersama-sama dari satu pintu gerbang saja, dan masuklah secara berpencar dari pintu-pintu gerbang yang berbeda. Namun, meski aku menyuruh kalian berbuat demikian untuk menghindari kemungkinan buruk yang akan terjadi, aku tidak dapat mempertahankan kamu sedikit pun dari ketentuan dan takdir Allah. Keputusan itu hanyalah hak dan wewenang Allah. Kepada-Nya aku bertawakal dengan berserah diri secara penuh, dan hanya kepada-Nya pula bertawakAllah orang-orang yang bertawakal."
  }
]