[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ayah mereka berkata kepada mereka, ”Wahai anak-anakku, apabila kalian akan memasuki tanah Mesir, janganlah kalian memasukinya melalui satu pintu, akan tetapi, masukilah melalui pintu-pintu yang berbeda-beda, supaya mata-mata yang dengki tidak menimpa kalian Dan sesungguhnya aku ketika berwasiat kepada kalian dengan ini, aku tidak dapat menolak sesuatu yang telah di tetapkan oleh Allah pada kalian. Tidak ada ketetapan, kecuali sesuai dengan ketetapan Allah semata, kepada-Nyalah aku bergantung dan percaya, dan kepada-NYalah semata orang-orang Mukmin bergantung.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Dan ayah mereka berpesan kepada mereka, \"Janganlah kalian memasuki negeri Mesir dari satu pintu secara bersamaan. Tetapi masuklah dari beberapa pintu yang berbeda. Itu akan lebih aman bagi kalian jika ada seseorang yang hendak berniat jahat kepada kalian. Aku mengatakan hal itu kepada kalian bukan untuk menghindarkan kalian dari hal buruk yang Allah kehendaki bagi kalian, atau mendatangkan keuntungan untuk kalian yang tidak Allah kehendaki untuk kalian. Karena semua keputusan ada di tangan Allah dan semua urusan terserah kepada-Nya. Hanya kepada Dia lah aku berserah diri dalam segala urusanku. Dan hanya kepada Dia lah hendaknya semua orang berserah diri dalam segala urusan mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Kemudian dia menyampaikan kepada mereka dengan penuh kasih sayang dan memastikan mereka akan menjaga diri: “Wahai anak-anakku, Janganlah kalian masuk ke negeri Mesir dari satu pintu, namun masuklah dari pintu-pintu yang berbeda-beda dan saling berjauhan agar kalian tidak mengundang bahaya. Dan wasiatku ini sama sekali tidak mampu menjauhkan kalian dari ketetapan Allah, karena ketetapan hanya milik-Nya semata; kepada-Nya aku bertawakkal, dan hendaklah orang-orang yang bertawakkal bersandar kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَقَالَ يٰبَنِىَّ لَا تَدْخُلُوا۟ مِنۢ بَابٍ وٰحِدٍ (Dan Ya’qub berkata: “Hai anak-anakku janganlah kamu (bersama-sama) masuk dari satu pintu gerbang) Yakni dari pintu-pintu gerbang negeri Mesir. Nabi Ya’qub mengkhawatirkan anak-anaknya dari bahaya yang mungkin menimpa mereka semua, oleh sebab itu jika mereka saling berpancar maka musibah itu akan terasa lebih ringan karena tidak menimpa mereka semuanya. Pendapat lain mengatakan bahwa Nabi Ya’qub khawatir mereka akan terkena penyakit ‘ain (penyakit yang disebabkan oleh pandangan orang yang dengki) sebab mereka mempunyai ketampanan yang berasal dari keturunan satu orang saja. وَادْخُلُوا۟ مِنْ أَبْوٰبٍ مُّتَفَرِّقَةٍ (dan masuklah dari pintu-pintu gerbang yang berlain-lain) Karena hal itu lebih mendekatkan kalian pada keselamatan jika terdapat orang yang ingin membahayakan kalian. وَمَآ أُغْنِى عَنكُم مِّنَ اللهِ مِن شَىْءٍ ۖ (namun demikian aku tiada dapat melepaskan kamu barang sedikitpun dari pada (takdir) Allah) Yakni aku tidak mampu menjauhkan kalian dari bahaya atau memberi kalian manfaat dengan siasat yang aku buat ini jika memang Allah berkahendak untuk menjadikan siasat itu tidak bermanfaat. إِنِ الْحُكْمُ إِلَّا لِلّٰهِ ۖ( Keputusan menetapkan (sesuatu) hanyalah hak Allah) Yakni Allah yang mengatur segala yang ada di alam semesta ini, tidak ada yang terjadi di alam semerta kecuali dengan ketetapannya, jika Dia menghendaki maka Dia akan menggagalkan rencana dari seseorang, meski segala kejadian terdapat sebab-sebab yang dijadikan Allah sebagai wasilah terjadinya hal tersebut. عَلَيْهِ تَوَكَّلْتُ ۖ( kepada-Nya-lah aku bertawakkal) Yakni kepada-Nya aku bersandar dan mempercayakan urusanku."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Arahan para ayah kepada anak-anaknya seperti yang dilakukan oleh Ya'kub kepada anak-anaknya merupakan cara yang terbaik untuk menjaga mereka, dan tentunya dengan mengikuti sebab yang dibenarkan oleh syari'at, dan menjauhkan mereka dari segala kemungkinan-kemungkina yang dapat menjadi sebab kecelakaan mereka { قَالَ يَا بَنِيَّ لَا تَدْخُلُوا مِنْ بَابٍ وَاحِدٍ وَادْخُلُوا مِنْ أَبْوَابٍ مُتَفَرِّقَةٍ } \"Dan Ya'qub berkata: \"Hai anak-anakku janganlah kamu (bersama-sama) masuk dari satu pintu gerbang, dan masuklah dari pintu-pintu gerbang yang berlain-lain\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Dan Ya’kub memberi nasehat kepada anak-anaknya: “Wahai anak-anakku, janganlah kalian memasuki Mesir melalui satu pintu, untuk menghindari kemahdharatan, dengki dan penyakit mata, namun masuklah melalui pintu-pintu yang terpisah, supaya tidak menarik perhatian orang. Dan aku tidak bisa melindungi kalian sedikitpun dengan wasiat dan rencanaku ini dari ketentuan dan takdir Allah atas kalian. Tiada ketentuan kecuali hanya milik Allah. Hanya kepadaNyalah aku bersandar dan berpegang teguh, supaya membawa pulang kalian semua dengan selamat.” Maka seharusnya hanya kepadaNyalah orang-orang yang bertawakal itu bersandar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Wahai anak-anakku, janganlah kalian masuk melalui satu pintu, tetapi masuklah melalui pintu-pintu yang berbeda. aku tidak dapat mencegah} tidak bisa mencegah {(takdir) Allah dari kalian sedikit pun. Hukum itu hanyalah milik Allah. KepadaNyalah aku bertawakal dan hanya kepadaNya hendaknya orang-orang yang bertawakal itu bertawakal”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Kemudian ketika Ya’qub melepaskan Bunyamin bersama mereka, beliau berpesan kepada mereka, jika akan memasuki negeri MEsir hendaknya mereka tidak memasukinya “dari satu pintu gerbang, dan masuklah dari pintu-pintu gerbang yang berlain-lainan”, hal tersebut karena beliau mengkhawatirkan adanya (seseorang yang mengidap penyakit) ‘ain (hasad), lantaran jumlah mereka banyak dan penampilan mereka yang mengundang perhatian, karena mereka merupakan putra-putra milik seorang lelaki saja. Inilah sebab (keluarnya wasiat tersebut). “Dan”, apabila tidak demikian “aku tiada dapat melepaskan kamu barang sedikit pun dari (takdir) Allah”, sedikit pun. Apa saja yang telah ditakdirkan pasti akan terjadi “keputusan menetapkan (sesuatu) hanyalah hak Allah”, keputusan itu adalah keputusanNya dan perintah itu adalah perintahNya. Apa saja yang telah diputuskan dan ditetapkan pasti akan terjadi “kepadaNyalah aku bertawakal”, aku bergantung kepada Allah, tidak bertumpu pada faktor sebab pesanku kepada kalian “dan hendaklah kepadaNya saja orang-orang yang bertawakal berserah diri”, karena dengan tawakal, sasaran-sasaran yang baik akan terwujud, dan kejadian-kejadian yang menakutkan akan menyingkir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 67: Agar tidak tertimpa penyakit peyakit ‘ain (mata jahat) dari orang-orang. Yang demikian adalah karena mereka adalah orang-orang yang berparas cakep, berpakaian bagus dan berpenampilan indah. Yang ditetapkan-Nya bagimu, akan tetapi aku hanya kasihan terhadap kamu. Apa yang diputuskan-Nya itulah yang terjadi. Karena dengan bertawakkal kepada Allah apa yang diinginkan akan terwujud dan apa yang dikhawatirkan akan hilang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 67",
    "description": "Ketika tiba saat bagi anak-anak nabi yakub bersama bunyamin berangkat ke mesir, timbul firasat di hati nabi yakub tentang kesulitan yang akan mereka hadapi. Dan dia (nabi yakub) berkata kepada mereka, wahai anak-anakku! begitu sampai di mesir, janganlah kamu masuk bersama-sama dari satu pintu gerbang saja, dan masuklah secara berpencar dari pintu-pintu gerbang yang berbeda. Namun, meski aku menyuruh kalian berbuat demikian untuk menghindari kemungkinan buruk yang akan terjadi, aku tidak dapat mempertahankan kamu sedikit pun dari ketentuan dan takdir Allah. Keputusan itu hanyalah hak dan wewenang Allah. Kepada-Nya aku bertawakal dengan berserah diri secara penuh, dan hanya kepada-Nya pula bertawakAllah orang-orang yang bertawakal. Petunjuk yang diberikan nabi yakub dilaksanakan dengan baik oleh anak-anaknya. Dan ketika mereka masuk ke negeri mesir sesuai dengan perintah ayah mereka, maka sesungguhnya masuk mesir dengan cara berpencar tidak dapat menolak sedikit pun keputusan dan takdir Allah. Itu semua hanya suatu keinginan pada diri yakub yang telah ditetapkannya sendiri. Hal itu menunjukkan betapa dia mengharapkan keselamatan bagi anak-anaknya dalam menempuh perjalanan jauh itu. Dan sesungguhnya dia (nabi yakub) mempunyai pengetahuan tentang itu karena kami telah mengajarkan banyak hal kepadanya, tetapi kebanyakan manusia tidak mengetahui bahwa apa yang dilakukan nabi yakub adalah hal yang benar."
  }
]