[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika mereka memasuki beberapa pintu-pintu yang berbeda-beda, sebagaimana yang diperintahkan oleh ayah mereka, hal itu tidak untuk menolak ketetapan Allah pada mereka, akan tetapi merupakan bentuk kasih sayang kepada Ya’qub terhadap mereka agar mereka tidak terkena oleh serangan ‘ain. Dan sesungguhnya Ya’qub benar-benar seorang yang berilmu agung dengan urusan agamanya yang Allah ajarkan kepadanya dalam bentuk wahyu. Akan tetapi, kebanyakan manusia tidak mengetahui perkara-perkara dan urusan-urusan secara detail, dan ilmu yang di ketahui oleh Ya’qub berupa perkara-perkara agama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Kemudian mereka pergi bersama saudara kandung Yusuf. Tatkala mereka masuk dari beberapa pintu yang berbeda seperti yang diperintahkan oleh ayah mereka, ternyata tindakan mereka untuk masuk dari beberapa pintu yang berbeda itu sama sekali tidak menghindarkan mereka dari apa yang telah ditetapkan oleh Allah untuk mereka. Sesungguhnya itu tidak lebih dari kasih sayang Ya'qūb kepada anak-anaknya yang dia ungkapkan dan dia pesankan kepada mereka. Sedangkan dia tahu bahwasanya tidak ada keputusan lain yang berlaku selain keputusan Allah. Sedangkan dia mengetahui apa yang Kami ajarkan kepadanya tentang keharusan beriman kepada takdir dan keharusan melakukan ikhtiar. Akan tetapi kebanyakan manusia tidak mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Ketika mereka sampai di negeri Mesir, mereka masuk melalui pintu yang berbeda-beda sebagaimana yang diwasiatkan ayah mereka, akan tetapi itu tidak berarti di hadapan ketetapan Allah, sebab wasiat itu berdasarkan rasa sayang pada diri Ya’qub semata, dia berwasiat seperti itu agar mereka tidak menarik perhatian. Sungguh Ya’qub memiliki ilmu yang luas dan pemahaman agama karena Kami mengajarkannya melalui wahyu, akan tetapi kebanyakan manusia tidak mengetahui hal itu dan tidak mengetahui keistimewaan yang Allah berikan kepada para nabi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. وَلَمَّا دَخَلُوا۟ مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم (Dan tatkala mereka masuk menurut yang diperintahkan ayah mereka) Yakni dengan masuk dari pintu-pintu gerbang yang berbeda-beda, dan tidak masuk dari satu pintu bersama-sama. مَّا كَانَ يُغْنِى عَنْهُم(tiadalah melepaskan mereka) Siasat itu. مِّنَ اللهِ(dari takdir Allah) Yakni dari ketentuan-Nya. مِن شَىْءٍ(sedikitpun) Dari segala apa yang telah ditakdirkan Allah kepada mereka, dan Allah telah mentakdirkan Nabi Yusuf untuk dapat mengambil Bunyamin dari saudara-saudaranya sebagaimana yang akan disebutkan. إِلَّا حَاجَةً فِى نَفْسِ يَعْقُوبَ(akan tetapi itu hanya suatu keinginan pada diri Ya’qub) Yakni terdapat dalam diri Nabi Ya’qub suatu keinginan, yaitu rasa peduli dan harapannya agar anak-anaknya senantiasa berada dalam keselamatan. قَضَىٰهَا ۚ( yang telah ditetapkannya) Yakni yang ditunjukkan oleh Ya’qub kepada mereka, dan ia mewasiati mereka akan senantiasa berhati-hati. Pendapat lain mengatakan bahwa terlintas dalam fikiran Nabi Ya’qub jika sang raja melihat mereka saling berkumpul sedangkan mereka semua memiliki ketampanan dan sifat-sifat kejantanan maka sang raja akan merasa iri dan dengki kepada mereka. Atau kerena Ya’qub takut dari keburukan mereka. وَإِنَّهُۥ لَذُو عِلْمٍ لِّمَا عَلَّمْنٰهُ(Dan sesungguhnya dia mempunyai pengetahuan, karena Kami telah mengajarkan kepadanya) Yakni pengetahuan tentang keharusan untuk berikhtiyar, berhati-hati, dan bertawakkal kepada Allah. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (Akan tetapi kebanyakan manusia tiada mengetahui) Seperti pengetahuan yang dimiliki oleh Ya’kub."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Dan ketika anak-anak Ya’kub masuk melalui pintu yang berbeda-beda, maka cara masuk tersebut tidak berpengaruh sedikitpun terhadap ketentuan Allah atas mereka. Sesungguhnya Allah SWT telah mentakdirkan Yusuf untuk membawa adiknya, Benyamin, bukan untuk menambah penderitaan namun untuk memenuhi kebutuhan dirinya sendiri, yaitu rasa kasih sayang dan penjagaannya terhadap mereka. Dia menampakkan dan menasehati mereka dengan hal itu. Sungguh mereka telah menunaikan nasehat itu, namun takdir Allah itu lebih tinggi di atas segala rencana. Sesungguhnya Ya’kub telah mengetahui apa yang telah Kami ajarkan kepadanya, di antaranya adalah bahwa kewaspadaan itu tidak bisa mencegah takdir, dan rencana itu tidak memberikan kemahdharatan kecuali dengan izin Allah, namun kebanyakan manusia, yaitu orang-orang kafir tidak mengetahui rahasia takdir. Sesungguhnya berserah diri dan bersandar kepada Allah itu itu tidak bisa mencegah terjadinya sesuatu dengan berbagai sebab dan tidak mencegah terjadinya suatu kewaspadaan dan kehati-hatian itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka masuk dari arah yang sesuai dengan perintah ayahnya, (hal itu) tidak dapat mencegah} mencegah {sedikit pun keputusan Allah, melainkan hanya suatu keinginan pada diri Ya‘qub yang telah dipenuhinya} dia tunaikan dan berwasiat kepada mereka tentang hal itu. Sesungguhnya dia} sesungguhnya Ya’kub {benar-benar mempunyai pengetahuan karena Kami telah mengajarkan kepadanya, tetapi kebanyakan manusia tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. “Dan tatkala”, mereka pergi dan “masuk menurut yang diperintahkan ayah mereka, maka itu” yaitu cara yang mereka tempuh itu, “tiadalah melepaskan mereka sedikit pun dari takdir Allah, akan tetapi itu hanyalaha suatu keinginan pada diri Ya’qub yang telah ditetapkannya”, itu merupakan dorongan rasa sayang dan cinta kepada anak-anaknya. Dengan itu, telah tercapai unsur ketentraman hati padanya dan menuntaskan apa yang ada di pikiran beliau. Pesan tersebut bukan karena kedangkalan ilmu belliau. Karena, beliau adalah salah satu rasul yang mulia, dan orang alim yang Rabbani. Karena itu, Allah berbicara tentang belaliau, “Dan sesungguhnya dia mempunyai pengetahuan”, maksudnya benar-benar memiliki ilmu yang agung “karena Kami telah mengajarkan kepadanya”, karena Kami mengajarkan ilmu kepadanya, bukan atas daya dan kekuatannya sendiri sehingga berhasil mengetahuinya. Akan tetapi, dengan karunia dan pengajaran Allah (baginya) “akan tetapi, kebanyakan manusia tiada mengetahui” muara-muara permasalahan dan urusan-urusan yang pelik. Demikian juga para ahli ilmu, di antara mereka samar terhadap berbagai ilmu, hukum, dan pelengkapnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِلَّا حَاجَةٗ فِي نَفۡسِ يَعۡقُوبَ) illaa haajatan fii nafsi ya’quub : pencegahan dari ‘ain karena rasa kasih sayang terhadap mereka. Makna ayat : Masih mengisahkan tentang saudara-saudara Yusuf. Tatkala mereka berjanji, jika mereka sampai negeri Mesir agar mereka tidak masuk dari satu pintu, tapi masuk dari pintu yang berbeda-beda, dikhawatirkan mereka terkena penyakit ‘ain. Setelah sampai mereka pun melakukan pesan ayah mereka. Allah ta’ala berfirman tentang mereka : (وَلَمَّا دَخَلُواْ مِنۡ حَيۡثُ أَمَرَهُمۡ أَبُوهُم مَّا كَانَ يُغۡنِي عَنۡهُم) “Dan ketika mereka masuk sesuai dengan perintah ayah mereka, (masuknya mereka dari pintu yang berbeda-beda) (مِّنَ ٱللَّهِ) tidak dapat menolak keputusan Allah (مِن شَيۡءٍ إِلَّا حَاجَةٗ) hanya suatu keinginan (فِي نَفۡسِ يَعۡقُوبَ) dari pada Ya’kub, khawatir mereka terserang ‘ain (قَضَىٰهَاۚ) yang ingin ia lakukan, tidak lebih. Dan firman-Nya : (وَإِنَّهُۥ لَذُو عِلۡمٖ لِّمَا عَلَّمۡنَٰهُ) “Dan sesungguhnya dia mempunyai pengetahuan, karena Kami telah mengajarkan kepadanya” Pujian kepada Ya’kub karena ia adalah seorang yang berilmu lagi beramal berdasarkan apa yang telah Kami ajarkan. Dan firman-Nya : (وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ) Sebagaimana yang Allah azza wa jalla kabarkan bahwa kebanyakan manusia tidak mengetahui tentang Allah, sifat-sifat-Nya, kesempurnaan-Nya, segala sesuatu yang Dia cintai dan murkai, serta jalan-jalan menuju ridha dan cinta-Nya, serta perkara-perkara yang Dia haramkan. Inilah isi dari ayat 68. Pelajaran dari ayat : • Keutamaan ilmu dan orang yang berilmu. • Kenyataan bahwa banyak dari manusia tidak mengetahui apa-apa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 68: Yaitu keinginan untuk menolak penyakit ‘ain karena rasa sayang kepada anak-anaknya. Akibat dari suatu perkara serta perkara-perkara halus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 68",
    "description": "Petunjuk yang diberikan nabi yakub dilaksanakan dengan baik oleh anak-anaknya. Dan ketika mereka masuk ke negeri mesir sesuai dengan perintah ayah mereka, maka sesungguhnya masuk mesir dengan cara berpencar tidak dapat menolak sedikit pun keputusan dan takdir Allah. Itu semua hanya suatu keinginan pada diri yakub yang telah ditetapkannya sendiri. Hal itu menunjukkan betapa dia mengharapkan keselamatan bagi anak-anaknya dalam menempuh perjalanan jauh itu. Dan sesungguhnya dia (nabi yakub) mempunyai pengetahuan tentang itu karena kami telah mengajarkan banyak hal kepadanya, tetapi kebanyakan manusia tidak mengetahui bahwa apa yang dilakukan nabi yakub adalah hal yang benar. Usai masuk dengan berpencar melalui pintu-pintu gerbang yang berbeda, sampailah saudara-saudara nabi yusuf ke tempatnya. Dan ketika mereka masuk ke tempat yusuf, dia pun menempatkan tiap dua orang dari mereka dalam satu kamar, sementara dia menempatkan saudaranya (bunyamin) di tempatnya sendiri. Ketika nabi yusuf berada di kamar bersama bunyamin, dia (yusuf ) berkata, sesungguhnya aku adalah saudara kandung-Mu. Jangan engkau bersedih hati terhadap apa yang telah mereka kerjakan terhadap kita berdua."
  }
]