[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dalam kisah yusuf dan saudara-saudara lelakinya terdapat pelajaran-pelajaran dan bukti-bukti petunjuk yang menunjukan kekuasaan Allah dan hikmahNya bagi orang yang mau bertanya tentang kisah-kisah mereka dan berkeinginan untuk mengetahuinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sungguh kisah Yusuf dan kisah saudara-saudaranya benar-benar mengandung banyak pelajaran dan nasihat bagi orang-orang yang bertanya tentang kisah mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Sungguh dalam kisah Nabi Yusuf dan para saudaranya terdapat dalil dan ibrah bagi orang yang bertanya tentang kisah mereka; ketika saudara-saudara Yusuf seayah saling berbincang: “Sungguh Yusuf dan saudara kandungnya lebih dicintai ayah kita daripada kita semua, padahal kita anak-anak yang berguna dan berjumlah banyak. Sungguh ayah kita dalam kesalahan yang jelas karena lebih mementingkan Yusuf dan saudara kandungnya daripada kita.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. ءَايٰتٌ لِّلسَّآئِلِينَ (tanda-tanda bagi orang-orang yang bertanya) Tanda-tanda yang menunjukkan kenabian Nabi Muhammad bagi orang-orang Yahudi yang bertanya kepadanya. Diriwayatkan Allah orang-orang Yahudi bertanya kepada Nabi Muhammad ketika beliau masih di Makkah, sedangkan di Makkah ketika itu tidak terdapat orang-orang ahli kitab atau orang-orang yang mengetahui kisah para Nabi, maka Allah menurunkan surat Yusuf satu kali turun sekaligus."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tanda-tanda kekuasaan Allah bagi siapapun yang bertanya tentangnya dengan lisan akal dan lisan bicara; karena hanya orang-orang yang bertanyalah yang mengambil manfaat dari ayat-ayat itu, adapun mereka yang menolaknya tidak akan mengambil manfaat darinya, begitu juga dari kisah-kisah orang shalih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Sesungguhnya dalam kisah Yusuf dan saudara-saudaranya itu terdapat pelajaran dan nasehat bagi orang-orang muslim, bukti-bukti dan tanda-tanda yang menunjukkan kebenaran kenabian Muhammad bagi orang-orang yang bertanya (orang yang meminta penjelasan) kepadanya, yaitu orang Yahudi tentang kisah Yusuf, sebagaimana penjalasan sebelumnya, serta dalil-dalil tentang kuasa, hikmah dan kelembutah Allah SWT kepada hamba-hambaNya yang dipilih menjadi nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh dalam (kisah) Yusuf dan saudara-saudaranya} dalam berita tentang Yusuf dan saudara-saudaranya {terdapat tanda-tanda} pelajaran dan teladan {bagi orang-orang yang bertanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah berfirman ”sesungguhnya ada beberapa tanda tanda kekuasaan Allah pada (kisah) yusuf dan saudara saudaranya” bagi orang orang yang menanyakan tentangnya baik melalui bahasa verbal. Orang orang yang bertanyalah yang akan mendulang manfaat dari ayat ayat dan pelajaran pelajaran itu. Sementara orang orang yang memalingkan diri darinya, maka mereka tidak bisa mengais manfaat dari ayat ayat dan kisah kisah serta keterangan keterangan yang ada."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ءَايَٰتٞ لِّلسَّآئِلِينَ) aayaatul lissaa’iliin : pelajaran bagi orang-orang yang bertanya tentang kisah-kisah dan kejadian-kejadian yang unik tentang mereka. Makna ayat : Masih menceritakan kisah Yusuf, Allah berfirman : (لَّقَدۡ كَانَ فِي يُوسُفَ وَإِخۡوَتِهِۦٓ) “Telah ada pada perkara Yusuf dan saudara-saudaranya—serta segala peristiwa dan momen besar yang terjadi—pelajaran bagi orang-orang yang bertanya tentangnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 7: Ada yang menafsirkan, “Terdapat pelajaran-pelajaran bagi orang yang bertanya.” Baik menyatakan di lisan, maupun menyatakan dengan sikap yang menunjukkan penasaran. Bagi mereka akan bermanfaat kisah itu, karena yang demikian menunjukkan perhatian mereka terhadapnya, berbeda dengan orang yang kurang peduli atau berpaling, maka kisah itu tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 7",
    "description": "Setelah dijelaskan tentang mimpi nabi yusuf dan isyarat akan dipilihnya dia sebagai nabi dan beberapa karunia lain yang akan diberikan Allah kepadanya, ayat berikut ini menjelaskan tentang sikap putraputra nabi yakub terhadap nabi yusuf, sebagaimana dijelaskan, sungguh, dalam kisah nabi yusuf dan saudara-saudaranya terdapat tanda-tanda kekuasaan Allah dan pelajaran berharga bagi orang yang bertanya tentang kisah itu. Kisah tersebut juga menjadi bukti kebenaran nabi Muhammad sebagai utusan Allah, karena mampu menjelaskan kisah nabi yusuf secara gamblang. Pelajaran dari kisah itu dimulai ketika mereka saudara-saudara nabi yusuf satu ayah lain ibu berkata satu sama lain, sesungguhnya yusuf dan saudara kandung-Nya, yakni bunyamin lebih dicintai ayah daripada kita, padahal kita adalah satu golongan yang kuat dan mampu membantu segala urusannya. Sungguh, ayah kita dalam kekeliruan yang nyata karena lebih mencintai yusuf dan bunyamin dari pada kita."
  }
]