[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika Yusuf mempersiapkan mereka dan mengangkutkan pada unta mereka bahan makanan, dia memerintahkan para pegawainya untuk meletakan bejana yang di pergunakan menakar bagi orang-orang ke dalam bawaan saudaranya Bunyamin, tanpa ada seorangpun yang menyadarinya. Dan ketika mereka menaiki tunggangan untuk bersiap memulai perjalanan, seorang pemanggil berteriak, ”Wahai pemilik unta yang mengangkut makanan ini, sesungguhnya kalian benar-benar pencuri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Kemudian tatkala Yusuf memerintahkan para pembantunya untuk menaikkan bahan makanan ke atas unta-unta milik saudara-saudaranya, dia menaruh penakar milik Raja yang biasa digunakan untuk menakar bahan makanan buat masyarakat di dalam wadah milik saudara kandungnya tanpa sepengetahuan mereka. Hal itu dilakukannya untuk membuat saudaranya itu tinggal bersamanya. Lalu setelah mereka bergerak untuk pulang ke rumah keluarga mereka tiba-tiba ada seseorang yang berteriak di belakang mereka, \"Wahai para pemilik unta yang mengangkut bahan makanan! Kalian adalah pencuri!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Setelah Yusuf memberi mereka barang kebutuhan dan bekal dan mereka muat dengan unta, Yusuf meminta sebagian pekerjanya untuk meletakkan tempat yang digunakan untuk menakar ke dalam barang-barang saudara kandungnya secara diam-diam tanpa ada seorangpun yang mengetahuinya. Dan ketika mereka bersiap untuk pulang, seseorang berseru: “Wahai para pemilik unta, sungguh kalian adalah para pencuri.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. جَعَلَ السِّقَايَةَ (Yusuf memasukkan piala (tempat minum)) Yakni tampat minum yang berbentuk piala. فِى رَحْلِ أَخِيهِ(ke dalam karung saudaranya) Yakni Bunyamin. Makna (الرحل) yakni tempat yang digunakan sebagai tempat bahan makanan yang ia beli dari Mesir. ثُمَّ أَذَّنَ مُؤَذِّنٌ(Kemudian berteriaklah seseorang yang menyerukan) Yakni orang yang berseru itu mengumumkan. أَيَّتُهَا الْعِيرُ(Hai kafilah) Yakni hai para pemilik kafilah. Makna kafilah yakni unta yang ditunggangi untuk bepergian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Ketika Yusuf sudah membekali mereka dengan makanan, secara diam-diam Yusuf memasukkan tempat minum dan cangkir ke dalam muatan makanan saudaranya, Benyamin yang dia tukarkan dari Mesir. Sebelum perge mereka dipanggil: “Wahai kafilah (kereta yang mengangkut barang bawaan) kalian adalah pencuri”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika telah disiapkan bahan makanan untuk mereka, dia memasukkan cawan} cawan yang dia gunakan untuk minum dan menakar makanan untuk orang-orang {ke dalam karung} barang {saudaranya. Kemudian berteriaklah seorang penyeru} berserulah seorang penyeru {“Wahai kafilah} wahai para pemilik unta yang di atasnya membawa barang bawaan {sesungguhnya kalian benar-benar para pencuri”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. “Maka tatkala telah disiapkan untuk mereka bahan makanan mereka”, maksudnya memberikan sukatan bagi setiap saudarnya, termasuk juga Bunyamin ini “Yusuf memasukkan piala (tempat minum)”, yaitu bejana yang dipakai untuk minum dan menakar “ke dalam karung saudaranya, kemudian”, mereka memasukkan ke dalam barang mereka masing-masing. Ketika mereka beranjak pulang “berteriaklah seseorang yang menyerukan, ‘Hai kafilah, sesungguhnya kamu adalah orang-orang yang mencuri,” sepertinya penyeru ini tidak mengetahui fakta sebenarnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (جَعَلَ ٱلسِّقَايَةَ) ja’alas siqaayah : cawan minum raja yang terbuat dari emas, kemudian dijadikan alat takar. (أَذَّنَ مُؤَذِّنٌ ) adzana muadzinun : Penyeru berteriak (أَيَّتُهَا ٱلۡعِيرُ) ayyatuhal ‘iiru : kabilah. Makna ayat : Adapun ayat (70), menceritakan rencana Yusuf agar saudaranya berpisah dari mereka dan tetap tinggal bersamanya. Ketika ia memberi mereka bahan makanan yang dibutuhkan, serta bekal setelah ia menjamu mereka, ia meletakkan cawan raja—yaitu cawan dari emas yang dipakai minum raja, kemudian dijadikan alat takar khusus untuk raja—didalam karung milik saudaranya, Bunyamin. Tidak lama mereka berjalan, berserulah seseorang : (أَيَّتُهَا ٱلۡعِيرُ) “Wahai kabilah! (إِنَّكُمۡ لَسَٰرِقُونَ) kalian adalah pencuri!” Ini adalah penjelasan dari firman-Nya : (فَلَمَّا جَهَّزَهُم بِجَهَازِهِمۡ جَعَلَ ٱلسِّقَايَةَ فِي رَحۡلِ أَخِيهِ ثُمَّ أَذَّنَ مُؤَذِّنٌ أَيَّتُهَا ٱلۡعِيرُ إِنَّكُمۡ لَسَٰرِقُونَ). Pelajaran dari ayat : • Pintarnya rencana Yusuf agar saudaranya (Bunyamin) tetap tinggal sedangkan saudara-saudaranya yang lain pulang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 70: Piala itu terbuat dari emas dan dihiasi permata. Setelah kafilah itu meninggalkan majlis Yusuf, penyeru berteriak. Nampaknya penyeru ini tidak mengetahui keadaan yang sebenarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 70",
    "description": "Menjelang kepulangan saudara-saudara nabi yusuf ke kanaan, ia meminta para pembantunya untuk mempersiapkan kepulangan mereka. Maka ketika telah disiapkan bahan makanan untuk mereka bawa pulang dan bekal dalam perjalanan mereka, dia menugaskan pembantunya untuk memasukkan piala, yakni gelas minuman yang pada saat itu digunakan untuk menakar, ke dalam karung saudara kandung-Nya, bunyamin. Kemudian setelah saudara-saudaranya berangkat, nabi yusuf memberitahu para pembantunya bahwa piala yang digunakan untuk menakar telah hilang, barangkali diambil atau terbawa oleh kafilah yang baru saja pergi. Para pembantu nabi yusuf lantas mengejar kafilah tersebut. Ketika mereka berhasil mendekati kafilah anak-anak nabi yakub, berteriaklah seseorang yang mengejar, seraya menyerukan, wahai kafilah! sesungguhnya kamu pasti para pencuri. Mereka, anak-anak nabi yakub, sangat terkejut mendengar seruan itu. Segera mereka bertanya sambil menghadap kepada mereka, para pembantu nabi yusuf, kamu kehilangan apa'."
  }
]