[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang memanggil dan orang yang bersamanya berkata, “Kami kehilangan bejana yang dipergunakan raja untuk menakar. Dan hadiah orang yang dapat menghadirkanya adalah bahan makanan seukuran beban angkutan unta.” Orang yang memanggil berkata, ”Dan aku menjamin dan menggaransi bahan makanan seberat unta (baginya).”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Orang yang berteriak dan kawan-kawannya berkata kepada saudara-saudara Yusuf, \"Kami kehilangan penakar milik Raja yang biasa digunakan untuk menakar bahan makanan. Siapapun yang menyerahkan penakar milik Raja itu sebelum kami melakukan pemeriksaan akan mendapatkan imbalan berupa bahan makanan sebanyak satu muatan seekor unta. Dan aku menjamin hal itu pasti akan didapatkannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Penyeru itu menjawab: “Kami kehilangan tempat yang digunakan untuk menakar milik raja. Dan bagi siapa saja yang menemukannya maka dia akan mendapat imbalan makanan sebanyak satu muatan unta, dan aku menjamin imbalan itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. قَالُوا۟ (Penyeru-penyeru itu berkata) Sebagai jawaban bagi mereka. نَفْقِدُ صُوَاعَ الْمَلِكِ (Kami kehilangan piala raja) Yakni wadah yang digunakan sebagai takaran yang berbentuk piala. وَلِمَن جَآءَ بِهِۦ حِمْلُ بَعِيرٍ (dan siapa yang dapat mengembalikannya akan memperoleh bahan makanan (seberat) beban unta) Yakni mereka menjawab “barangsiapa yang dapat mengembalikannya maka baginya bahan makanan sepenuh muatan unta. وَأَنَا۠ بِهِۦ زَعِيمٌ (dan aku menjamin terhadapnya) Kemudian penyeru itu berkata “dan aku menjamin atas itu, yakni atas bahan makanan sepenuh muatan unta sebagai balasan bagi orang yang mengembalikan piala itu sebelum kami memeriksa wadah-wadah bahan makanan yang kalian bawa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Mereka (pengikut raja) menjawab: “Kami kehilangan cangkir raja yang berharga, Dan siapa yang membawa cangkir itu sendiri maka akan mendapatkan unta, dan aku jamin hal itu, yaitu memberi unta” Dhamir kata Shawa’ bisa merujuk kepada muzakkar dan muannats"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Kami kehilangan cawan} cawan {raja, dan siapa yang dapat mengembalikannya akan mendapat makanan seberat beban unta dan aku menjamin hal itu”} seperti beban gajah yang aku serahkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. “Penyeru-penyeru itu berkata, ‘Kami kehilangan piala raja, dan siapa yang dapat mengembalikannya akan memperoleh bahan makanan (seberat) beban unta’,” sebagai upah atas penemuan barang itu “dan aku menjamin terhadapnya”, maksudnya penjamin. Ini disampaikan oleh si penyeru yang sedang melacak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (صُوَاعَ ٱلۡمَلِكِ) shuwa’al malik : cawan raja, صَاعٌ dan صُوَاعٌ bermakna sama. (وَأَنَا۠ بِهِۦ زَعِيمٞ) wa ana bihii za’iim : yang bertanggung jawab. Makna ayat : Maka mereka menjawab : (قَالُواْ نَفۡقِدُ صُوَاعَ ٱلۡمَلِكِ وَلِمَن جَآءَ بِهِۦ حِمۡلُ بَعِيرٖ) “Kami kehilangan cawan raja, barangsiapa yang bisa mengembalikannya akan mendapat hadiah satu angkutan unta penuh” (وَأَنَا۠ بِهِۦ زَعِيمٞ) “Dan aku yang menjaminnya.” Aku yang akan menjamin pemberian itu. Pelajaran dari ayat : • Bolehnya memberikan upah kepada orang yang melakukan pekerjaan tertentu, dalam bab fikih disebut Ju’aalah (Sayembara). • Upah dari sayembara harus ditunaikan, dan penjamin dihitung memiliki hutang (sampai menunaikan upah itu)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 72",
    "description": "Mereka, para pembantu nabi yusuf, menjawab, kami kehilangan piala raja, dan siapa yang mengakui piala itu ada padanya dan dapat mengembalikannya tanpa harus kami geledah, maka dia akan memperoleh bahan makanan seberat beban unta, dan aku jamin hadiah itu pasti akan dia terima. Saudara-saudara nabi yusuf merasa tersinggung dengan tuduhan para pembantu nabi yusuf. Mereka pun membela diri dan menjawab, sebelum ini kami sudah pernah datang ke mesir. Identitas kami sudah pernah diperiksa oleh petugas kerajaan. Beberapa hari yang lalu kami bahkan dijamu oleh raja. Demi Allah, sungguh, kamu mengetahui bahwa kami datang bukan untuk berbuat keonaran dan kerusakan di negeri ini, dan kamu juga tahu bahwa kami bukanlah para pencuri seperti yang kamu tuduhkan."
  }
]