[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saudara-saudara Yusuf berkata, ”Demi Allah, kalian pasti sudah tahu apa yang kalian saksikan pada kami bahwa sesungguhnya kami pasti tidak datang ke negri Mesir untuk melalukan kerusakan di dalamnya. Dan bukan menjadi sipat kami untuk mencuri.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Saudara-saudara Yusuf berkata kepada mereka, \"Demi Allah, kalian sudah tahu bahwa kami semua bersih dan tidak bersalah seperti yang kalian lihat pada penampilan kami. Dan kami datang ke negeri Mesir bukan untuk membuat kerusakan di negeri ini. Dan sepanjang hidup ini kami tidak pernah mencuri.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Para saudara Yusuf bersumpah dengan nama Allah untuk menegaskan mereka tidak bersalah: “Sungguh dahulu kalian telah mengenal kami, kami tidak datang untuk membuat kerusakan, dan tidak ada di antara kami yang mencuri!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. قَالُوا۟ تَاللهِ لَقَدْ عَلِمْتُم مَّا جِئْنَا لِنُفْسِدَ فِى الْأَرْضِ (Saudara-saudara Yusuf menjawab “Demi Allah sesungguhnya kamu mengetahui bahwa kami datang bukan untuk membuat kerusakan di negeri) Mereka bersumpah dengan mengatakan “sungguh sang raja dan para pejabatnya telah mengetahui dengan pasti kejujuran kami dan kejauhan kami dari niat busuk untuk merusak negeri ini sedangkan pencurian merupakan perbuatan yang paling besar berpengaruh dalam perusakan negeri; kejujuran ini mereka ketahui dari kebaikan yang telah kami lakukan yaitu dengan barang-barang mereka yang kami kembalikan kepada mereka setelah kami temukan dalam tempat bahan makanan kami.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Anak-anak Ya’kub berkata: “Demi Allah, sesungguhnya kalian rakyat Yusuf mengetahui dengan pasti melalui beberapa kedatangan kami sebelumnya bahwa kami tidak mendatangi negeri kalian untuk bermaksiat kepada Allah. Kami tidak bersalah dan bukanlah pencuri”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab} saudara-saudara Yusuf berkata kepada mereka {“Demi Allah} demi Allah {sungguh kalian mengetahui bahwa kami datang bukan untuk berbuat kerusakan di bumi dan kami bukanlah para pencuri.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. “Saudara-saudara Yusuf menjawab, ‘Demi Allah, sesungguhnya kamu mengetahui bahwa kami datang tidak untuk membuat kerusakan di negeri (ini)’,” dengan berbuat berbagai maksiat “dan kami bukanlah para pencuri”, karena tindak pencurian termasuk jenis kerusakan di bumi yang paling besar. Mereka itu bersumpah berdasarkan keyakinan mereka bahwa mereka bukan perusak (di bumi) dan juga bukan pencuri, lantaran mereka mengetahui seluruh tindak-tanduk mereka, yang menunjukkan penjagaan kehormatan diri mereka, wara’ mereka dan bahwa tuduhan ini tidak terjadi pada mereka dengan dasar pengetahuan dari pihak yang menuduh mereka. Ungkapan ini lebih tuntas untuk menafikan tuduhan, dibandingkan mengatakan, “Demi Allah, kami tidak berbuat kerusakan di bumi dan tidak mencuri.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (تَٱللَّهِ) tallaahi : demi Allah. (لِنُفۡسِدَ فِي ٱلۡأَرۡضِ) linufsida fil ardh : untuk berbuat kerusakan dengan berbuat dosa dan maksiat. (وَمَا كُنَّا سَٰرِقِينَ) wamaa kunnaa saariqiin : kami tidak mencuri cawan raja, tidak pula kami mencuri sebuah barang pun. Makna ayat : Ketika diumumkan kejadian pencurian cawan raja, dan kabilah dihentikan untuk pemeriksaan, serta diumumkan pula hadiah bagi yang menemukannya dan pemberian hadiah sudah dijamin, berkatalah saudara-saudara Yusuf—sebagaimana yang Allah ta’la firmankan—( قَالُواْ تَٱللَّهِ لَقَدۡ عَلِمۡتُم مَّا جِئۡنَا لِنُفۡسِدَ فِي ٱلۡأَرۡضِ) “Demi Allah, kami tidak datang untuk berbuat kerusakan,” dengan mencuri dan perbuatan dosa, kami hanya datang untuk membeli bahan pangan. (وَمَا كُنَّا سَٰرِقِينَ) “Dan kami bukan pula seorang pencuri.” Baik dulu maupun sekarang. Pelajaran dari ayat : • Bolehnya bersumpah atas nama Allah untuk suatu keperluan. • Bolehnya seseorang yang tidak bersalah membantah tuduhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 73: Kalimat ini lebih kuat dalam menafikan perbuatan mencuri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 73",
    "description": "Saudara-saudara nabi yusuf merasa tersinggung dengan tuduhan para pembantu nabi yusuf. Mereka pun membela diri dan menjawab, sebelum ini kami sudah pernah datang ke mesir. Identitas kami sudah pernah diperiksa oleh petugas kerajaan. Beberapa hari yang lalu kami bahkan dijamu oleh raja. Demi Allah, sungguh, kamu mengetahui bahwa kami datang bukan untuk berbuat keonaran dan kerusakan di negeri ini, dan kamu juga tahu bahwa kami bukanlah para pencuri seperti yang kamu tuduhkan. Mendengar jawaban tersebut, mereka, para pembantu nabi yusuf, berkata, tetapi, apa hukumannya jika piala itu ditemukan di karungkarung makanan yang kalian bawa, yang dengan demikian terbukti bahwa kamu adalah para pendusta'."
  }
]