[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang di tugasi untuk mencari bejana itu berkata kepada saudara-saudara Yusuf, “Apakah hukuman si pencuri di dalam hukuman kalian, jika kalian berdusta dalam pernyataan kalian, ‘Kami bukan pencuri’?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Orang yang berteriak dan kawan-kawannya bertanya kepada saudara-saudara Yusuf, \"Apa balasan yang akan diterima oleh orang yang mencurinya menurut hukum kalian jika ternyata kalian berdusta tentang pengakuan kalian bahwa kalian tidak mencuri?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Orang-orang yang bermusyawarah dengan para saudara Yusuf bertanya kepada mereka: “Apa hukuman yang kalian berikan bagi pencuri jika kalian berbohong telah mengaku tidak mencuri?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. قَالُوا۟ فَمَا جَزٰٓؤُهُۥٓ إِن كُنتُمْ كٰذِبِينَ (Mereka berkata: “Tetapi apa balasannya jikalau kamu betul-betul pendusta? “) Yang berkata perkataan ini adalah para utusan Nabi Yusuf atau penyeru. Yakni hukuman apa yang kalian jatuhkan bagi orang yang mencuri tempat minum berbentuk piala ini? إن كنتم كاذبين (jika kalian adalah orang-orang yang berbohong) Dalam pengakuan kalian bahwa kalian adalah orang-orang yang tidak melakukan pencurian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Penyeru dan pengawal lainnya berkata: “Lalu menurut kalian, apakah balasan bagi pencuri, jika kalian berbohong atas ketidakbersalahan kalian dalam kasus pencurian ini?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} penyeru dan para pengikutnya berkata {“lalu apa hukumannya} hukuman pencuri di antara kalian {jika kalian berdusta”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. “Mereka berkata, ‘Tetapi apa balasannya’,” maksudnya, balasan tindakan itu (pencurian) “Jika kamu betul-betul pendusta”, (benar-benar) barang yang hilang itu ternyata bersama kalian."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Maka para pengawal raja membantah mereka—sesuai firman-Nya--: (قَالُواْ فَمَا جَزَٰٓؤُهُۥٓ إِن كُنتُمۡ كَٰذِبِينَ) “Mereka berkata, “Apa balasannya jika kalian berdusta?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 74: Yakni penyeru bersama kawan-kawannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 74",
    "description": "Mendengar jawaban tersebut, mereka, para pembantu nabi yusuf, berkata, tetapi, apa hukumannya jika piala itu ditemukan di karungkarung makanan yang kalian bawa, yang dengan demikian terbukti bahwa kamu adalah para pendusta'mereka, anak-anak nabi yakub, menjawab, hukumannya ialah pada siapa ditemukan dalam karungnya piala yang hilang itu, maka dia sendirilah yang akan menerima hukumannya, bukan yang lain. Demikianlah ajaran agama kami; memberi hukuman kepada orang-orang zalim."
  }
]