[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saudara-saudara Yusuf menjawab, “balasan hukuman si pencuri, siapa saja yang barang curian ditemukan dalam barang angkutanya, dialah balasanya,” Maksudnya, dia diserahkan karena perbuatan pencuriannya kepada orang yang dicuri sehingga menjadi budak baginya. ”Dengan balasan seperti ini, yakni mejadikanya sebagai budak, kami membalas orang-orang yang berbuat zhalim dengan mencuri. Dan inilah ajaran agama kami dan hukum-hukum kami terhadap pelaku pencurian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Saudara-saudara Yusuf menjawab, \"Hukuman bagi seorang pencuri menurut hukum kami ialah barangsiapa yang ditemukan barang curian di wadahnya, ia harus diserahkan kepada orang pemilik barang untuk dijadikan sebagai budaknya. Hukuman dijadikan sebagai budak semacam itulah balasan yang kami berikan kepada para pencuri.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. mereka menjawab: “Hukuman bagi pencuri tempat menakar milik raja adalah dijadikan sebagai budak bagi pemilik barang curian itu. menjadikannya budak adalah hukuman yang kami berikan kepada orang-orang yang berbuat zalim dengan mencuri.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. قَالُوا۟ جَزٰٓؤُهُۥ مَن وُجِدَ فِى رَحْلِهِۦ فَهُوَ جَزٰٓؤُهُۥ ۚ (Mereka menjawab: “Balasannya, ialah pada siapa diketemukan (barang yang hilang) dalam karungnya, maka dia sendirilah balasannya (tebusannya)”) Yakni balasan bagi pencuri piala. Orang yang didapati dalam wadahnya terdapat piala itu ditangkap, karena hukuman bagi pencuri dalam keluarga Ya’kub adalah ia akan ditangkap dan dijadikan sebagai budak pemilik barang yang dicuri selama satu tahun. كَذٰلِكَ نَجْزِى الظّٰلِمِينَ(Demikianlah kami memberi pembalasan kepada orang-orang yang zalim) Untuk orang lain atas perbuatannya mencuri barang tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Anak-anak Ya’kub berkata tentang balasan bagi pencuri cangkir itu: “Jadikanlah orang yang membawa cangkir itu di dalam muatannya sebagai budak untuk menebus barang yang dicurinya. Itulah balasan yang adil. Seperti itulah kami membalas para pencuri dalam syariat Kami (syariat Ya’kub)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab} saudara-saudara Yusuf berkata kepada mereka {“Hukumannya ialah pada siapa yang ditemukan dalam karungnya} hukuman dari pencuriannya adalah dijadikan hamba bagi orang yang ditemukan di dalam karungnya cawan itu {maka dialah sendiri balasannya} maka menjadikan hamba adalah hukumannya, tidak ada yang lain {Demikianlah kami memberikan hukuman kepada orang-orang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. “Mereka menjawab, ‘Balasannya, ialah pada siapa diketemukan (barang yang hilang) dalam karungnya, maka dia sendirilah’,” orang yang barang tersebut berada di karungnya “balasannya (tebusannya)”, maksudnya orang itu menjadi milik orang yang kecurian. Aturan ini terdapat bila telah terbukti kasus pencuriannya, maka dirinya menjadi pemilik harta yang dicuri. Oleh karena itu, mereka berkata, “Demikianlah kami memberi pembalasan kepada orang-orang yang zhalim.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَن وُجِدَ فِي رَحۡلِهِۦ فَهُوَ جَزَٰٓؤُهُۥۚ) maw wujida fii rahlihii fa huwa jazaauh : pelakunya dijadikan budak. (كَذَٰلِكَ نَجۡزِي ٱلظَّٰلِمِينَ) kadzaalika najzizhoolimiin : begitulah balasan untuk orang-orang zalim dalam syariat kami. Makna ayat : Maka mereka menjawab : (قَالُواْ جَزَٰٓؤُهُۥ مَن وُجِدَ فِي رَحۡلِهِۦ فَهُوَ جَزَٰٓؤُهُۥۚ) “Mereka berkata, “Balasannya ialah siapa saja yang ditemukan cawan itu di dalam karungnya, maka dialah pencurinya dan harus bersedia menerima akibatnya.” Yaitu seorang pencuri dijadikan budak dikarenakan pencurian. (كَذَٰلِكَ نَجۡزِي ٱلظَّٰلِمِينَ) Demikianlah balasan bagi orang-orang zalim dalam syariat kami. Pelajaran dari ayat : • Hukum pidana pencurian dalam ajaran Nabi Ya’kub alaihi salam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 75: Menurut syari’at Nabi Ya’kub ‘alaihis salam bahwa barang siapa mencuri maka hukumannya dijadikan budak selama setahun. Nabi Yusuf ‘alaihis salam tidak mengikuti undang-undang raja terhadap pencuri, yaitu dengan dipukuli pencuri itu dan disuruh mengganti dua kali lipat barang yang dicuri, tetapi mengikuti syari’at Nabi Ya’kub. Oleh karena itu, Beliau menyerahkan hukumannya kepada mereka (saudara-saudaranya), di samping agar saudaranya (Bunyamin) tetap bersamanya. Kemudian mereka meminta Yusuf memeriksa kantong-kantong mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 75",
    "description": "Mereka, anak-anak nabi yakub, menjawab, hukumannya ialah pada siapa ditemukan dalam karungnya piala yang hilang itu, maka dia sendirilah yang akan menerima hukumannya, bukan yang lain. Demikianlah ajaran agama kami; memberi hukuman kepada orang-orang zalim. Para pembantu nabi yusuf menyepakati tawaran anak-anak nabi yakub. Maka mulailah dia, salah satu pembantu nabi yusuf, memeriksa karung-karung mereka, yakni saudara-saudara tiri nabi yusuf, sebelum memeriksa karung bunyamin, saudara kandung-Nya sendiri. Setelah cukup lama menggeledah dengan teliti, kemudian dia (pembantu nabi yusuf ) mengeluarkan piala itu dari karung bunyamin, saudara kandungnya. Demikianlah cara kami, yakni Allah, mengatur rencana untuk yusuf agar ia dapat tetap bersama saudara kandungnya, bunyamin. Dia (nabi yusuf ) tidak dapat menghukum saudara kandung-Nya menurut undangundang raja mesir, kecuali Allah menghendakinya, yakni hukuman yang diusulkan oleh saudara-saudara tirinya sendiri. Kami angkat derajat orang yang kami kehendaki; dan ketahuilah bahwa di atas setiap orang yang berpengetahuan pasti ada orang-orang yang lebih mengetahui, dan di atas semua itu ada Allah yang maha mengetahui."
  }
]