[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang itu kembali dengan membawa saudara-saudara Yusuf kepadanya. Lalu Yusuf sendiri yang memeriksa barang bawaan mereka. Dia memulai memeriksa barang bawaan mereka, sebelum barang bawaan saudara kandungnya, untuk menjalankan rencana yang sudah di aturnya dengan rapi, supaya saudaranya dapat tinggal bersamanya, kemudian ia mengakhirinya dengan barang bawaan saudaranya, lalu ia mengeluarkan bejana darinya. Demikianlah kami memudahkan Yusuf mengatur recana itu yang dapat mengantarkanya untuk mengambil saudaranya. Tidak sepantasnya Yusuf mengambil saudaranya menurut hukum Raja Mesir, karena bukan termasuk ajaran agamanya untuk memperbudak seorang pencuri. Hanya saja, kehendak Allah memutuskan pengaturan rencana ini dan berhukum dengan ajaran syariat yang di amalkan oleh saudara-saudara Yusuf yang memutuskan diperbudaknya seorang pencuri. Kami mengangkat kedudukan- orang yang kami kehendaki di dunia atas selainnya sebagaimana kami mengangkat kedudukan Yusuf, dan diatas setiap yang berilmu ada yang Maha mengetahui, sehingga selesainya ilmu kepada Allah ta’ala yang mengetahui perkara yang ghaib maupun yang Nampak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Kemudian mereka membawa saudara-saudara Yusuf kembali ke hadapan Yusuf untuk pemeriksaan wadah-wadah mereka. Maka Yusuf memulai pemeriksaannya dengan memeriksa wadah-wadah milik saudara-saudaranya yang bukan saudara kandungnya sebelum memeriksa wadah milik saudara kandungnya. Lalu Yusuf mengeluarkan penakar milik Raja dari dalam wadah milik saudara kandungnya. Sebagaimana Kami telah membuat perencanaan untuk Yusuf dengan cara memasukkan penakar milik Raja di dalam wadah milik saudara kandungnya, Kami juga membuat perencanaan lain untuknya dengan cara membuat saudara-saudaranya menerapkan hukuman yang berlaku di negerinya, di mana seorang pencuri harus dijadikan sebagai budak. Hal ini tidak akan terjadi sekiranya hukuman yang diberlakukan adalah hukuman dari Raja di mana seorang pencuri harus dijatuhi hukuman pukul dan denda, kecuali jika Allah menghendaki perencanaan lain. Karena Dia Mahakuasa untuk membuat perencanaan lain. Kami akan mengangkat derajat hamba-hamba Kami yang Kami kehendaki, sebagaimana Kami telah mengangkat derajat Yusuf. Di atas orang yang berilmu ada orang yang lebih banyak ilmunya. Dan di atas ilmu semua orang ada ilmu Allah Yang Maha Mengetahui segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Maka yang memeriksa mulai mencari barang itu di barang-barang para saudara Yusuf sebelum mencarinya di barang-barang saudara kandungnya. Dan ketika sampai pada pemeriksaan barang-barang saudara kandung Yusuf, pemeriksa melihat tempat menakar milik raja itu, kemudian dia mengeluarkannya. Demikianlah Kami wahyukan kepada Yusuf cara mengatur siasat yang rapi untuk mengambil saudara kandungnya dari mereka. Dan tidak ada yang mampu mengambil saudara kandungnya dari aturan raja Mesir -karena hukum yang berlaku di sana adalah tidak dengan menjadikan pencuri sebagai budak- melainkan dengan kehendak Allah yang telah ditetapkan. Dengan hikmah dan keimanan, Kami angkat derajat hamba-hamba yang Kami kehendaki. Dan di atas setiap orang berilmu terdapat orang yang lebih tinggi ilmunya, hingga berakhir ilmu sampai kepada Allah Yang Maha Mengetahui segala hal ghaib."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. فَبَدَأَ بِأَوْعِيَتِهِمْ (Maka mulailah Yusuf (memeriksa) karung-karung mereka) Yakni memeriksa karung-karung milik sepuluh saudaranya. قَبْلَ وِعَآءِ أَخِيهِ (sebelum (memeriksa) karung saudaranya sendiri) Hal ini dilakukan agar menghindarikan kecurigaan dan menutupi rencana tipu dayanya. ثُمَّ اسْتَخْرَجَهَا (kemudian dia mengeluarkan piala raja itu) Yakni mengeluarkan wadah tempat minum yang berbentuk piala itu. كَذٰلِكَ كِدْنَا لِيُوسُفَ ۖ (Demikianlah Kami atur untuk Yusuf) Yakni demikian Kami ajarkan dan wahyukan tipu daya itu kepada Yusuf, dan hasilnya adalah masuknya sasaran ke dalam jebakan yang tidak dapat ditolak tanpa disadari. مَا كَانَ لِيَأْخُذَ أَخَاهُ فِى دِينِ الْمَلِكِ (Tiadalah patut Yusuf menghukum saudaranya menurut undang-undang raja) Yakni dalam aturan yang berlaku di kerajaan, yang mana aturannya adalah si pencuri harus dihukum dengan pukulan dan mengganti rugi atas barang yang dicurinya dua kali lipat, tanpa dijadikan sebagai budak seperti aturan yang berlaku di keluarga Nabi Ya’qub. نَرْفَعُ دَرَجٰتٍ مَّن نَّشَآءُ (Kami tinggikan derajat orang yang Kami kehendaki) Dengan memberinya ilmu, pengetahuan, harta, dan kehormatan sebagaimana Kami angkat derajat Nabi Yusuf dengan hal-hal tersebut. وَفَوْقَ كُلِّ ذِى عِلْمٍ (dan di atas tiap-tiap orang yang berpengetahuan itu) Yakni orang-orang yang diangkat derajatnya oleh Allah dengan pengetahuan. عَلِيمٌ (ada lagi Yang Maha Mengetahui) Yang lebih tinggi derajat keilmuannya. Pendapat lain mengatakan yakni diatas setiap orang yang berilmu terdapat Allah yang Maha Mengetahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Lalu penyelidik, Yusuf mulai menggeledah muatan-muatan saudaranya yang berjumlah 10 orang sebelum menyelidiki muatan Benyamin untuk menghindari kecurigaan dan melanjutkan tipuan yang telah direncanakan. Lalu cangkir itu dikeluarkan dari muatan Benyamin. Seperti itulah Kami mengajari Yusuf rencana rahasia ini untuk mengambil saudaranya. Jika tidak demikian, Yusuf tidak bisa menahan saudaranya sesuai undang-undang raja terkait perkara tersebut dan undang-undang bahwa hanya cukup memukul dan mendenda pencuri dua kali lipat dari nilai yang dicuri, kecuali dalam keadaan yang dikehendaki, diijinkan dan diperintahkan Allah. Kami mengangkat hamba-hamba yang Kami kehendaki pada derajat-derajat tinggi dengan ilmu dan hikmah. Dan di atas semua yang alim itu ada yang paling ‘alim dan paling tinggi derajatnya sampai puncak keilmuan mutlak sampai menuju Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu dia mulai (memeriksa) karung-karung mereka sebelum karung saudaranya sendiri, kemudian dia mengeluarkannya cawan itu dari karung saudaranya. Demikianlah Kami mengatur rencana untuk Yusuf} seperti itulah pengaturan rencana yang mengejutkan yang telah Kami aturkan untuk Yusuf untuk mencapai tujuannya{Dia tidak dapat menghukum saudaranya menurut hukum raja} hukum raja Mesir {kecuali Allah menghendakinya. Kami mengangkat derajat orang yang Kami kehendaki; dan di atas setiap orang yang berpengetahuan ada yang lebih mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Maka petugas pelacak mulai memeriksa karung-karung mereka sebelum (membuka) karung saudaranya, Bunyamin. Tindakan itu, gunanya untuk menghilangkan kecurigaan yang menyangka bahwa kejadian tersebut dilakukan dengan unsur kesengajaan. Ketika tidak menemukan apa pun di karung-karung mereka, ia “kemudian mengeluarkan piala raja itu dari karung saudaranya”, Allah tidak menggunakan ungkapan, ‘ia menemukannya atau saudaranya telah mencurinya’ dalam rangka mempertimbangkan fakta yang sebenanrnya. Saat itulah, terealisasilah keinginan Yusuf untuk bersama dengan saudaranya (Bunyamin) di sisinya dengan cara yang tidak disadari oleh saudara-saudara lainnya. Allah berfirman, “Demikianlah Kami atur untuk (mencapai maksud) Yusuf”, maksudnya Kami telah mempermudah jalannya strategi bagi Yusuf untuk menggapai suatu tujuan yang tidak tercela. “Tiadalah patut Yusuf menghukum saudaranya menurut undang-undang raja”, karena bukan termasuk kandungan ajaran agama sang raja bahwa seorang pencuri (yang tertangkap) dijadikan sebagai budak yang dimiliki. Mereka punya aturan hukuman yang lain. Bila kasusnya diajukan kepada ajaran raja, maka Yusuf tidak bisa membuat saudaranya tinggal menetap bersamanya. Akan tetapi, Yusuf menyerahkan putusan hukum kepada saudara-saudaranya, agar apa yang ia kehendaki terwujud. Allah berfirman, “Kami tinggikan derajat orang yang Kami kehendaki”, dengan ilmu yang bermanfaat dan mengetahui jalur-jalur yang mengantarkan kepada tujuannya, sebagaimana Kami mengangkat derajat Yusuf “dan di atas tiap-tiap orang yang berpengetahuan itu ada lagi yang Maha Mengetahui.” Setiap orang alim, di atasnya masih ada yang lebih tahu daripadanya, sampai habislah ilmu pada Dzat yang mengetahui alam ghaib dana lam nyata."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مِن وِعَآءِ أَخِيهِۚ) miw wi’aai akhiih : dari kantung saudaranya yang ada cawan tersebut. (كَذَٰلِكَ كِدۡنَا لِيُوسُفَۖ) kadzaalika kidnaa li yuusuf : Kami mudahkan baginya rencana dengan cara yang mulia. (فِي دِينِ ٱلۡمَلِكِ) fii diinil malik : dalam aturannya, yaitu seorang pencuri dipukul dan terkena denda sebesar barang yang ia curi. (نَرۡفَعُ دَرَجَٰتٖ مَّن نَّشَآءُۗ) narfa’u darajaatim man nasyaa’ : Kami mengangkat derajat siapa yang Kami kehendaki, sebagaimana Kami angkat derajat Yusuf. Makna ayat : Yusuf pun turun tangan untuk melakukan pemeriksaan karung saudara-saudaranya untuk mencari cawan raja. Ia memulai dari mereka satu per satu, dan yang terakhir adalah karung milik Bunyamin agar tidak ada kecurigaan bahwa kejadian ini adalah rekayasa. Lalu akhirnya cawan itu dikeluarkan dari karung milik saudaranya (Bunyamin), sebagaimana firman-Nya : (فَبَدَأَ بِأَوۡعِيَتِهِمۡ قَبۡلَ وِعَآءِ أَخِيهِ ثُمَّ ٱسۡتَخۡرَجَهَا مِن وِعَآءِ أَخِيهِۚ) dan firman-Nya : (كَذَٰلِكَ كِدۡنَا لِيُوسُفَۖ) Seperti ini lah Kami mudahkan bagi Yusuf rencananya untuk tercapainya rencana mulianya. Firman-Nya : (مَا كَانَ لِيَأۡخُذَ أَخَاهُ فِي دِينِ ٱلۡمَلِكِ) Bahwa tindakan Yusuf itu tidak ada pada hukum yang berjalan di Mesir saat itu—menjadikan saudaranya budak berdasarkan pencurian—yang ada adalah seorang pencuri hanya dipukul dan diberi denda. (إِلَّآ أَن يَشَآءَ ٱللَّهُۚ) kecuali atas izin Allah, karena apa yang Dia kehendaki pasti terjadi. (نَرۡفَعُ دَرَجَٰتٖ مَّن نَّشَآءُۗ) Kami mengangkat derajat siapa yang Kami kehendaki karena ilmu, sebagaimana Yusuf (وَفَوۡقَ كُلِّ ذِي عِلۡمٍ) diatas setiap orang yang berilmu (عَلِيمٞ) pasti ada yang lebih pintar, hingga sampai pada puncaknya kepada Allah ta’ala, Dia lah Yang Maha Mengetahui dan tidak ada yang lebih mengetahui selain-Nya, bahkan seluruh pengetahuan adalah milik dan dari-Nya, kalau bukan karena-Nya tentu manusia tidak akan tahu apa-apa. Pelajaran dari ayat : • Penjelasan indahnya rencana Allah untuk wali-wali-Nya. • Hukum pidana di kerajaan Mesir pada masa Yusuf ‘alaihi salam. • Tingginya kedudukan Yusuf dalam ilmu. • Kaidah (وَفَوۡقَ كُلِّ ذِي عِلۡمٍ عَلِيمٞ) “Diatas orang yang berilmu ada yang lebih berilmu” hingga pada akhirnya berhenti pada Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 76: Agar tidak terlintas di benak mereka bahwa Beliau mengatur siasat. Allah tidak mengatakan “yang dicuri oleh saudaranya,” untuk menjaga keadaan yang sebenarnya. Yakni Yusuf tidak dapat menerapkan syari’at bapaknya kecuali dengan kehendak Allah dengan mengilhamkannya untuk bertanya kepada saudara-saudaranya. Dengan ilmu yang bermanfaat dan mengetahui cara agar tujuan tercapai. Hingga berakhir kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 76",
    "description": "Para pembantu nabi yusuf menyepakati tawaran anak-anak nabi yakub. Maka mulailah dia, salah satu pembantu nabi yusuf, memeriksa karung-karung mereka, yakni saudara-saudara tiri nabi yusuf, sebelum memeriksa karung bunyamin, saudara kandung-Nya sendiri. Setelah cukup lama menggeledah dengan teliti, kemudian dia (pembantu nabi yusuf ) mengeluarkan piala itu dari karung bunyamin, saudara kandungnya. Demikianlah cara kami, yakni Allah, mengatur rencana untuk yusuf agar ia dapat tetap bersama saudara kandungnya, bunyamin. Dia (nabi yusuf ) tidak dapat menghukum saudara kandung-Nya menurut undangundang raja mesir, kecuali Allah menghendakinya, yakni hukuman yang diusulkan oleh saudara-saudara tirinya sendiri. Kami angkat derajat orang yang kami kehendaki; dan ketahuilah bahwa di atas setiap orang yang berpengetahuan pasti ada orang-orang yang lebih mengetahui, dan di atas semua itu ada Allah yang maha mengetahui. Betapa terperanjat saudara-saudara nabi yusuf menerima kenyataan bahwa piala ditemukan dalam karung bunyamin. Untuk menutupi malu, mereka berkata, jika dia, bunyamin, benar-benar mencuri, maka sungguh sifat buruk itu sama dengan sifat buruk saudara kandungnya, nabi yusuf. Sebelum itu saudara kandung-Nya pun pernah pula mencuri. Maka saat mendengar ucapan itu, nabi yusuf merasa jengkel, tetapi ia dapat menyembunyikan kejengkelan itu dalam hatinya dan tidak ditampakkannya kepada mereka. Dia hanya berkata dalam hati, kedudukanmu justru lebih buruk karena kamu telah berbohong kepada ayah kamu, mencuri, dan menganiaya yusuf dengan memasukkannya ke dalam sumur. Dan Allah maha mengetahui apa yang kamu terangkan dan apa yang kamu sembunyikan."
  }
]