[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "saudara-saudara Yusuf berkata “jika orang ini mencuri, maka sungguh saudara sekandungnya dulupun pernah mencuri (yang mereka maksud adalah Yusuf alaihi salam) maka Yusuf menyembunyikan dalam dirinya sendiri apa yang ia dengar dari tuduhan kedustaan mereka, dan dia berkata dalam dirinya sendiri “kalian adalah lebih buruk kedudukannya dari apa yang kalian sebutkan, karena kalian telah menyembunyikan dariku apa yang dahulu terjadi pada kalian, dan Allah Maha mengetahui apa saja yang kalian sifati dari kedustaan dan yang diada-adakan”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Saudara-saudara Yusuf berkata, \"Jika dia mencuri tidaklah mengherankan, karena saudara kandungnya (maksudnya, Yusuf) pernah mencuri sebelum ini.\" Yusuf menyembunyikan kepedihan hatinya mendengar ucapan mereka dan tidak memperlihatkannya kepada mereka. Dan dia berkata di dalam hati kepada mereka, \"Kedengkian dan kelakuan buruk yang dulu pernah kalian lakukan persis dengan kejahatan yang sedang terjadi saat ini. Allah -Ta'ālā- Maha Mengetahui fitnah yang keluar dari mulut kalian ini.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Para saudara Yusuf berkata untuk mengelak tuduhan dan untuk mengejek saudara kandung Yusuf: “Jika saudara kami ini mencuri tempat menakar milik raja, maka sesungguhnya dahulu saudaranya juga pernah mencuri -yang mereka maksud adalah Yusuf-. Namun Yusuf membiarkan tuduhan mereka ini karena rasa kasihan terhadap mereka dan agar siasatnya tidak terbongkar, sehingga dia hanya berkata dalam hati: “Kalian lebih buruk derajatnya daripada orang yang kalian tuduh mencuri itu. Dia berlepas diri dari pengkhianatan kalian yang terdahulu dan selanjutnya. Dan Allah Maha Mengetahui kedustaan yang kalian buat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. قَالُوٓا۟ إِن يَسْرِقْ (Mereka berkata: “Jika ia mencuri) Yakni para saudara Nabi Yusuf berkata “jika Bunyamin mencuri pada saat ini. فَقَدْ سَرَقَ أَخٌ لَّهُۥ مِن قَبْلُ ۚ( maka sesungguhnya, telah pernah mencuri pula saudaranya sebelum itu”) Yang mereka maksud adalah Nabi Yusuf. Terdapat pendapat mengatakan bahwa Nabi Yusuf pernah mengambil patung yang terbuat dari emas milik kakek dari jalur ibunya kemudian memecahkan dan membuangnya di jalanan karena ingin menghentikan kemungkaran. Pendapat lain mengatakan bahwa mereka masih merasa dengki terhadap Nabi Yusuf sehingga mereka berdusta terhadapnya dengan tuduhan ini. فَأَسَرَّهَا يُوسُفُ فِى نَفْسِهِۦ وَلَمْ يُبْدِهَا لَهُمْ ۚ( Maka Yusuf menyembunyikan kejengkelan itu pada dirinya dan tidak menampakkannya kepada mereka) Yakni menyembunyikan sakit hati atas perkataan mereka “Jika ia mencuri maka saudaranya telah mencuri sebelum itu” قَالَ(Dia berkata) Nabi Yusuf berkata. أَنتُمْ شَرٌّ مَّكَانًا ۖ( Kamu lebih buruk kedudukanmu (sifat-sifatmu)) Yakni kalian lebih buruk derajatnya dari orang yang kalian tuduh telah mencuri padahal dia tidak melakukannya. Kalian telah membuang Yusuf ke dasar sumur dan berbohong kepada ayah kalian dan pebuatan-perbuatan buruk lainnya. وَاللهُ أَعْلَمُ بِمَا تَصِفُونَ (dan Allah Maha Mengetahui apa yang kamu terangkan itu) Yakni mengetahui kedustaan tuduhan pencurian yang kalian tuduhkan kepada Yusuf."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Yusuf dicelakakan oleh saudara-saudaranya sendiri, mereka melemparkannya ke dalam sumur hingga mereka menjualnya kepada seorang saudagar dengan harga yang sangat murah, kemudian ia dipenjara selama bertahun-tahun, hingga akhirnya ia diangkat menjadi 'aziz di Mesir, saudaranya berkata kepadanya : { إِنْ يَسْرِقْ فَقَدْ سَرَقَ أَخٌ لَهُ مِنْ قَبْلُ ۚ } \"Jika ia mencuri, maka sesungguhnya, telah pernah mencuri pula saudaranya sebelum itu\", maksud mereka adalah Yusuf, lalu apa yang dilakukan oleh Yusuf ? lihatlah bagaimana ia menjaga dirinya : { فَأَسَرَّهَا يُوسُفُ فِي نَفْسِهِ وَلَمْ يُبْدِهَا لَهُمْ ۚ قَالَ أَنْتُمْ شَرٌّ مَكَانًا } \"Maka Yusuf menyembunyikan kejengkelan itu pada dirinya dan tidak menampakkannya kepada mereka. Dia berkata (dalam hatinya): \"Kamu lebih buruk kedudukanmu (sifat-sifatmu)\" Bahkan ia tidak bermaksud untuk menyakitkan perasaan mereka dengan kalimatnya itu; ia pun menyembunyikannya dalam hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Dengan dengki dan penuh kebencian saudara-saudara Yusuf berkata dalam hati: “Jika Benyamin, saudara kita telah mencuri cangkir dari ayah kita, maka sungguh saudaranya sebelumnya (yaitu Yusuf) juga pernah mencuri.” Dan dikatakan dalam riwayat yang manhul (kecil kebenarannya) bahwa sesungguhnya di waktu kecil Yusuf, pernah mengambil berhala emas milik kakeknya, yaitu ayah dari ibunya, kemudian menghancurkan dan membuangnya di jalan. Lalu Yusuf merahasiakan hal itu dan tidak memperlihatkan jejaknya kepada mereka (saudara-saudaranya). Yusuf berkata dalam hati: “Tempat kalian lebih buruk di sisi Allah daripada orang yang kalin tuduh mencuri. Dia tidak bersalah atas pengkhianatan dan kezaliman kalian terhadap saudara kalian. Dan Allah Maha Mengetahui hakikat ucapan dan kebohongan kalian serta tuduhan kalian terkait pencurian itu kepada Yusuf.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} Saudara-saudara Yusuf berkata {“Jika dia mencuri, sungguh sebelum ini saudaranya pun pernah mencuri” Lalu Yusuf menyembunyikan} menyembunyikan {(kekesalan) dalam hatinya dan tidak menampakkannya} tidak menampakkannya {kepada mereka. Dia berkata,“Kalian lebih buruk kedudukannya} lebih buruk tempatnya di sisi Allah daripada orang yang kalian tuduh mencuri {Allah Maha Mengetahui apa yang kalian terangkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Ketika para saudara Yusuf menyaksikan peristiwa yang terjadi “Mereka berkata, ‘Jika ia mencuri’,” yakni saudara kami ini, maka hal itu tidak aneh terjadi padanya “sesungguhnya telah pernah mencuri pula saudaranya ini”, mereka mengarahkan (pembicaraan) kepada Yusuf. Tujuan mereka, untuk membersihkan nama mereka. Sesungguhnya orang ini dan saudaranya, pernah melakukan perbuatan pencurian. Mereka berdua bukanlah saudara kandung kami. Dalam ungkapan ini, terdapat pendiskreditan mereka kepada Yusuf dan Bunyamin. Oleh karena itu, “maka Yusuf menyembunyikan kejengkelan itu pada dirinya dan tidak menampakannya kepada mereka”, maksudnya, dia tidak membalas ucapan mereka dengan sesuatu yang tidak mereka sukai. Akan tetapi dia menahan amarahnya dan menyembunyikan perasaan hatinya, “Kamu lebih buruk kedudukanmu (sifat-sifatmu)”, di mana kalian telah mencela kami berdua dengan suatu ungkapan yang keadaan kalian lebih buruk darinya. “Dan Allah Maha Mengetahui apa yang kamu terangkan itu,” daripada kami, dengan menempelkan predikat pencurian kepada kami yang mana Allah mengetahui bahwa kami terbebas darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِن يَسۡرِقۡ) iyyasriq : mengambil cawan raja dari tempatnya secara diam-diam. (فَقَدۡ سَرَقَ أَخٞ لَّهُۥ) faqd saraqa akhul lahu : saudaranya, Yusuf pernah mencuri di masa kecilnya. (فَأَسَرَّهَا يُوسُفُ) fa’asarrahaa yuusuf : Yusuf menyembunyikan tuduhan mereka. (وَلَمۡ يُبۡدِهَا لَهُمۡۚ) wa lam yubdihaa lahum : tidak ia tampakkan. (أَنتُمۡ شَرّٞ مَّكَانٗاۖ) antum syarrum makaanaa : kalian lebih buruk dari orang yang kalian tuduh mencuri. (بِمَا تَصِفُونَ) bimaa tashifuun : tentang kebenaran yang kalian sebutkan itu. Makna ayat : Masih menceritakan kisah antara Yusuf ‘alaihi salam dan saudara-saudaranya. Setelah Yusuf mengeluarkan cawan dari karung saudaranya dan telah tampak bahwa Bunyamin adalah pelakunya, saudara-saudaranya berkata, sebagaimana yang Allah firmankan : (قَالُوٓاْ إِن يَسۡرِقۡ فَقَدۡ سَرَقَ أَخٞ لَّهُۥ مِن قَبۡلُۚ) Jika sendainya Bunyamin mencuri seperti yang kalian tetapkan, itu tidak mengherankan (فَقَدۡ سَرَقَ أَخٞ لَّهُۥ مِن قَبۡلُۚ) karena saudaranya juga pernah mencuri sebelumnya, yang mereka maksud adalah Yusuf ketika ia masih kecil. Dahulu ia sering mencuri makanan untuk diberikan kepada orang-orang miskin, dan mencuri berhala milik ayah dari ibunya lalu menghancurkannya sehingga ia tidak disembah lagi, ini bukanlah pencurian yang tercela, bahkan terpuji. Allah berfirman : (فَأَسَرَّهَا يُوسُفُ فِي نَفۡسِهِۦ وَلَمۡ يُبۡدِهَا لَهُمۡۚ) Yusuf menyembunyikan perkataan mereka : (فَقَدۡ سَرَقَ أَخٞ لَّهُۥ مِن قَبۡلُۚ) dan tidak menampakkan kepada mereka, dan berkata membantah perkataan mereka yang keliru : (أَنتُمۡ شَرّٞ مَّكَانٗاۖ) kalian lebih buruk dari orang yang kalian tuduh mencuri ini (وَٱللَّهُ أَعۡلَمُ بِمَا تَصِفُونَ) Allah lebih mengetahui kebenaran perkataan kalian. Pelajaran dari ayat : • Keharusan meminta maaf karena kesalahan. • Terkadang seorang yang bijak terpaksa mengatakan perkataan yang belum pernah ia katakan, jika bukan untuk menolak keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 77: Yusuf pernah mencuri patung emas milik bapak dari ibunya, lalu Beliau memecahkannya agar kakeknya itu tidak menyembahnya (sebagaimana dijelaskan oleh Qatadah). Yakni karena mencuri saudara mereka (Yusuf) dari bapaknya dan menzaliminya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 77",
    "description": "Betapa terperanjat saudara-saudara nabi yusuf menerima kenyataan bahwa piala ditemukan dalam karung bunyamin. Untuk menutupi malu, mereka berkata, jika dia, bunyamin, benar-benar mencuri, maka sungguh sifat buruk itu sama dengan sifat buruk saudara kandungnya, nabi yusuf. Sebelum itu saudara kandung-Nya pun pernah pula mencuri. Maka saat mendengar ucapan itu, nabi yusuf merasa jengkel, tetapi ia dapat menyembunyikan kejengkelan itu dalam hatinya dan tidak ditampakkannya kepada mereka. Dia hanya berkata dalam hati, kedudukanmu justru lebih buruk karena kamu telah berbohong kepada ayah kamu, mencuri, dan menganiaya yusuf dengan memasukkannya ke dalam sumur. Dan Allah maha mengetahui apa yang kamu terangkan dan apa yang kamu sembunyikan. Jawaban saudara-saudara nabi yusuf itu sedikit pun tidak membantu untuk membebaskan bunyamin, padahal mereka sudah bersumpah akan menjaga bunyamin dalam perjalanan ini. Untuk itulah mereka berkata dan memohon kepada nabi yusuf, wahai al-aziz!'panggilan kehormatan'dia, bunyamin, mempunyai ayah yang juga ayah kami. Ayah kami itu sudah lanjut usia, dan kami sudah bersumpah kepadanya untuk membawa pulang bunyamin. Karena itu, ambillah salah seorang di antara kami sebagai gantinya. Sesungguhnya kami melihat engkau termasuk orang-orang yang berbuat baik."
  }
]