[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata sambil berharap dikasihani supaya mereka bisa menepati janji ayah mereka : wahai sang mentri, sesungguhnya orang itu mempunyai bapak yang sudah tua usianya yang mencintainya dan tidak sanggup untuk jauh darinya, maka ambilah salah satu dari kami untuk menggantikan posisi Bunyamin, sesungguhnya kami melihat engkau adalah termasuk orang-orang yang berbuat baik dalam memperlakukan kami dan orang lain selain kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Saudara-saudara Yusuf berkata kepada Yusuf, \"Wahai Al-Azīz! Sesungguhnya dia mempunyai ayah yang sudah tua renta yang sangat mencintainya. Maka ambillah salah satu dari kami untuk menggantikannya. Sesungguhnya kami melihat anda sangat baik kepada kami dan kepada yang lain. Oleh karena itu, berbaik-hatilah kepada kami dengan mengabulkan permintaan kami.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Ketika mereka teringat sumpah yang mereka katakan kepada ayah mereka, mereka berkata dengan memelas: “Wahai menteri, sesungguhnya pencuri ini memiliki ayah yang sudah tua yang tidak mampu terpisah darinya, maka ambillah salah satu dari kami sebagai gantinya. Sungguh kami menganggapmu sebagai orang yang baik dalam bermuamalat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. قَالُوا۟ يٰٓأَيُّهَا الْعَزِيزُ إِنَّ لَهُۥٓ أَبًا شَيْخًا كَبِيرًا (Mereka berkata: “Wahai Al Aziz, sesungguhnya ia mempunyai ayah yang sudah lanjut usianya) Yakni Bunyamin memiliki seorang ayah yang sudah tua yang tidak mampu untuk berpisah dengannya dan tidak mampu menyusulnya. فَخُذْ أَحَدَنَا مَكَانَهُۥٓ ۖ( lantaran itu ambillah salah seorang diantara kami sebagai gantinya) Yang tetap tinggal disini. Kerena Bunyamin mempunyai tempat dalam hati ayahnya yang tidak kami miliki, sehingga ayahnya tidak akan merasa berat jika harus berpisah dengan salah satu dari kami sebagaimana rasa beratnya ketika harus berpisah dengan Bunyamin. إِنَّا نَرَىٰكَ مِنَ الْمُحْسِنِينَ (sesungguhnya kami melihat kamu termasuk oranng-orang yang berbuat baik) Yang berbaik hati kepada semua orang secara umum dan kepada kami secara khusus. Oleh sebab itu sempurnakanlah kebaikanmu dengan mengabulkan permintaan kami ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Dengan meminta belas kasihan, saudara-saudara Yusuf berkata: “Wahai Al-‘Aziz, sesungguhnya dia memiliki ayah yang sudah sangat tua umurnya yang sangat menyayanginya. Dia merasa senang dengan adanya anaknya ini daripada kehilangannya dan merasa sedih jika terpisah dengannya. Maka ambillah salah satu dari kami yang menggantikan posisinya. Sesungguhnya kami melihat anda sebagai orang yang baik terhadap kami dan manusia secara menyeluruh. Maka sempurnakanlah kebaikan anda dengan memenuhi permohonan ini.” Percakapan dengan menggunakan deskripsi Aziz menunjukkan bahwa Yusuf berstatus sebagai Menteri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Al Aziz, sesungguhnya dia mempunyai ayah yang sudah lanjut usia karena itu ambillah salah seorang di antara kami untuk menempati posisinya} sebagai pengganti dia {Sesungguhnya kami melihatmu termasuk orang-orang yang selalu berbuat baik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Selanjutnya, mereka menempuh jalur persuasive dalam menghadapi Yusuf, moga saja Yusuf mau memaafkan saudara mereka. Maka, “mereka berkata, ‘Wahai al-Aziz, sesungguhnya ia mempunyai ayah yang sudah lanjut usianya’,” maksudnya, orang tuanya tidak bisa lepas darinya, dan perpisahan dengan si anak ini akan sangat memberatkannya “karena itu ambillah salah seorang di antara kami sebagai gantinya, sesungguhnya kami melihat kamu termasuk orang-orang yang berbuat baik”, bersikap baiklah kepada kami dan kepada ayah kami dengan hal tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَبٗا شَيۡخٗا كَبِيرٗا) aban syaikhan kabiiran : Ya’kub ‘alaihi salam Makna ayat : Ketika mereka mendengar perkataan Yusuf—dengan intonasi mengancam dan keras—mereka berkata memohon belas kasih Yusuf sebagaimana yang Allah firman kan : (قَالُواْ يَٰٓأَيُّهَا ٱلۡعَزِيزُ إِنَّ لَهُۥٓ أَبٗا شَيۡخٗا كَبِيرٗا) saudara kami ini memiliki seorang ayah yang sudah lanjut usia, sulit dan tidak mungkin baginya untuk berpisah dengan anaknya ini. Pelajaran dari ayat : • Bolehnya meminta belas kasih untuk orang yang butuh kepada seseorang yang diharapkan bisa memberinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 78: Di mana ia lebih dicintai daripada kami dan merasa terhibur dengannya karena anaknya yang binasa serta merasa sedih jika berpisah dengannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 78",
    "description": "Jawaban saudara-saudara nabi yusuf itu sedikit pun tidak membantu untuk membebaskan bunyamin, padahal mereka sudah bersumpah akan menjaga bunyamin dalam perjalanan ini. Untuk itulah mereka berkata dan memohon kepada nabi yusuf, wahai al-aziz!'panggilan kehormatan'dia, bunyamin, mempunyai ayah yang juga ayah kami. Ayah kami itu sudah lanjut usia, dan kami sudah bersumpah kepadanya untuk membawa pulang bunyamin. Karena itu, ambillah salah seorang di antara kami sebagai gantinya. Sesungguhnya kami melihat engkau termasuk orang-orang yang berbuat baik. Mendengar permohonan mereka, dia (nabi yusuf ) berkata, kami selalu memohon perlindungan kepada Allah dari menahan seseorang yang tidak bersalah. Kami tidak menahan kecuali orang yang kami temukan harta kami padanya. Jika kami berbuat demikian, yakni menahan seseorang di antara kamu sebagai ganti bunyamin, berarti kami orang yang zalim karena menahan orang yang tidak bersalah."
  }
]