[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf berkata, ”kami berlindung kepada Allah dan memohon dijaga olehNya dari menahan sesorang yang bukan orang yang kami temukan bejana takaran padanya, (sebagaimana telah kalian putuskan sendiri), sesungguhnya bila kami melakukan apa yang kalian pinta niscaya kami termasuk kategori orang-orang yang berbuat kezhaliman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Yusuf berkata, \"Kami berlindung kepada Allah dari tindakan yang semena-mena kepada orang yang tidak bersalah dengan menangkap selain orang yang kami temukan penakar raja di dalam wadahnya. Sesungguhnya jika kami melakukan hal itu niscaya kami telah berbuat zalim karena menghukum orang yang tidak bersalah dan membebaskan orang yang bersalah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Yusuf berkata: “Aku berlindung kepada Allah, dari mengambil seseorang selain yang kedapatan mencuri tempat menakar milik raja sebagaimana aturan kalian. Jika kami melakukan apa yang kalian minta maka kami telah menzalimi orang yang tidak bersalah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. قَالَ مَعَاذَ اللهِ أَن نَّأْخُذَ إِلَّا مَن وَجَدْنَا مَتٰعَنَا عِندَهُۥٓ (Berkata Yusuf: “Aku mohon perlindungan kepada Allah daripada menahan seorang, kecuali orang yang kami ketemukan harta benda kami padanya) Yakni pada Bunyamin. Dan telah dibolehkan bagi kami untuk menjadikannya sebagai budak dengan fatwa kalian. إِنَّآ إِذًا لَّظٰلِمُونَ (maka benar-benarlah kami orang-orang yang zalim) Jika kami mengambil selain Bunyamin."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikan bagaimana al-qur'an menggambarkan kepada kita agar menetapkan satu hukuman kepada orang yang bersalah, bukan sekedar bahwa dia melanggar syar'iat! namun juga cara selain itu tidak sesuai dengan akal fikiran manusia tentang keadilan. 2 ). Yusuf begitu teliti dalam berbicara tatkala berhadap dengan saudara-saudaranya : { قَالَ مَعَاذَ اللَّهِ أَنْ نَأْخُذَ إِلَّا مَنْ وَجَدْنَا مَتَاعَنَا عِنْدَهُ } \"erkata Yusuf: \"Aku mohon perlindungan kepada Allah daripada menahan seorang, kecuali orang yang kami ketemukan harta benda kami padanya\" Ia tidak mengatakan \"orang yang mencuri barang kami\" karena ia tahu bahwa saudara kandungknya tidak melakukan hal itu, cara ini sebagai contoh agar kita teliti dalam menentukan kalimat yang tepat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Yusuf berkata: “Kami berlindung kepada Allah dari menahan seseorang kecuali Kami dapati barang kami (cangkir) bersamanya, yaitu Benyamin, sesuai dengan syariat kalian. Sesungguhnya kami adalah orang-orang zalim jika menahan orang lain yang tidak melakukannya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Kami memohon pelindungan kepada Allah} Kami memohon perlindungan kepada Allah {dari menahan seseorang kecuali siapa yang kami temukan harta kami padanya. Jika demikian, sesungguhnya kami benar-benar orang-orang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Yusuf berkata, “Aku mohon perlindungan kepada Allah dari menahan seseorang, kecuali orang yang kami ketemukan harta benda kami padanya,”, maksudnya itu adalah tindakan kezhaliman dari kami, sekiranya Kami menahan orang yang bukan tersangka disebabkan kesalahan dari orang yang kami jumpai barang kami berada padanya. Ia tidak mengatakan, ‘dari orang yang mencuri.’ Ini semua untuk menjaga diri dari kedustaan “jika kami menahan orang yang bukan kami jumpai (barang kami ada padanya), “maka benar-benarlah kami orang-orang yang zhalim”, di mana kami menjatuhkan hukuman pada sesuatu yang tidak pada tempatnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَعَاذَ ٱللَّهِ) ma’aadzallah : kami berlindung kepada Allah dari menghukum orang yang kami tidak mendapati barang kami padanya. (مَتَٰعَنَا) mataa’anaa : cawan raja. Makna ayat : (فَخُذۡ أَحَدَنَا مَكَانَهُۥٓۖ إِنَّا نَرَىٰكَ مِنَ ٱلۡمُحۡسِنِينَ) ambillah seorang dari kami sebagai ganti atasnya, orang seperti engkau pasti melakukannya karena ini adalah hal baik, dan kami melihat engkau termasuk orang-orang yang baik. Maka Yusuf menjawab sebagaimana yang Allah firmankan : (قَالَ مَعَاذَ ٱللَّهِ) kami berlindung kepada Allah (أَن نَّأۡخُذَ إِلَّا مَن وَجَدۡنَا مَتَٰعَنَا عِندَهُۥٓ إِنَّآ إِذٗا لَّظَٰلِمُونَ) jika kami menangkap orang yang tidak bersalah dan meninggalkan yang bersalah (mencuri) maka kami adalah orang-orang yang zalim, ini adalah hal yang kami tidak suka dan sepakat. Pelajaran dari ayat : • Tidak boleh menebus orang yang bersalah dengan orang yang tidak bersalah, dan ini termasuk perbuatan zalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 79: Nabi Yusuf ‘alaihis salam tidak menggunakan kata-kata “yang mencuri harta kami” agar tidak terjatuh ke dalam dusta. Karena menimpakan hukuman bukan pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 79",
    "description": "Mendengar permohonan mereka, dia (nabi yusuf ) berkata, kami selalu memohon perlindungan kepada Allah dari menahan seseorang yang tidak bersalah. Kami tidak menahan kecuali orang yang kami temukan harta kami padanya. Jika kami berbuat demikian, yakni menahan seseorang di antara kamu sebagai ganti bunyamin, berarti kami orang yang zalim karena menahan orang yang tidak bersalah. Pupuslah harapan mereka begitu mendengar jawaban nabi yusuf. Maka ketika mereka telah berputus asa darinya, yakni putusan nabi yusuf untuk membebaskan bunyamin dan menahan salah seorang di antara mereka sebagai gantinya, maka mereka pun menyendiri sambil berunding dengan berbisik-bisik. Yang tertua usianya di antara mereka berkata, tidakkah kamu ketahui bahwa ayahmu telah mengambil janji dari kamu dengan nama Allah untuk menjaga dan membawa pulang bunyamin ke hadapannya, dan sebelum itu ingatkah kamu bahwa kita dulu telah menyia-nyiakan yusuf dengan melemparkannya ke dalam sumur' sebab itu, aku tidak akan meninggalkan negeri mesir ini. Aku akan tetap tinggal di sini sampai ayahku mengizinkan aku untuk menghadapnya, atau Allah memberi keputusan terhadapku; aku akan menerima apa pun keputusan Allah. Dan dia adalah hakim yang senantiasa memberi keputusan terbaik bagi hamba-hamba-Nya."
  }
]