[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika mereka sudah putus harapan dari jawaban yusuf terhadap mereka atas permintaan yang mereka ajukan kepadanya, merekapun menyendiri dari orang-orang. Mereka mulai berunding diantara mereka sendiri. Yang tertua dari mereka berkata, ”Tidaklah kalian tahu bahwa sesungguhnya ayah kalian telah mengambil janji teguh dari kalian, supaya kalian pasti mengembalikan saudara kalian kecuali kalian dikalahkan musuh. Dan sebelum ini, perlakuan tidak manusiawi kalian terhadap yusuf dan pengkhianatan kalian terhadapnya. Karena itu, aku tidak akan meninggalkan bumi mesir sampai ayahku memberi izin meninggalkannya atau tuhanku menetapkanku keluar darinya dan bisa membawa pulang saudaraku. Dan Allah sebaik-baik yang menetapkan keputusan dan yang paling adil menyelesaikan perkara diantara manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Tatkala mereka merasa putus asa setelah mendengar jawaban Yusuf terhadap permintaan mereka, maka mereka menyingkir dari kerumunan orang untuk bermusyawarah. Saudara tertua mereka berkata, \"Aku mengingatkan kalian bahwa ayah kalian telah mengambil janji yang kuat atas nama Allah dari kalian bahwa kalian akan membawa putranya kembali kepadanya, kecuali jika kalian dikepung dan tidak sanggup melawan. Dan sebelum ini kalian telah melakukan kecerobohan terkait dengan Yusuf. Kalian tidak menepati janji kalian kepada ayah kalian dalam menjaga Yusuf. Oleh karena itu, aku tidak akan meninggalkan negeri Mesir sampai ayahku mengizinkan aku kembali kepadanya, atau Allah memutuskan untuk mengembalikan saudaraku kepadaku. Dan Allah adalah sebaik-baik pemberi keputusan, karena Dia memutuskan segala sesuatu secara benar dan adil.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80-81. Setelah mereka sudah putus asa dan tidak memiliki harapan lagi, mereka saling berkumpul untuk bermusyawarah. Saudara tertua mereka berkata: “Bukankah kalian telah berjanji kepada ayah kalian untuk membawa kembali saudara kalian? Dan sebelumnya dia telah memaafkan kalian atas apa yang terjadi terhadap Yusuf. Sungguh aku tidak akan meninggalkan Mesir hingga ayah mengizinkanku untuk kembali, atau hingga Allah menyelamatkan saudaraku dari perbudakan, Dia adalah seadil-adil hakim. Kembalilah kalian kepada ayah, dan katakanlah dengan lembut: ‘Wahai ayah kami, anakmu yang merupakan saudara kandung Yusuf telah mencuri, dan sungguh kami tidak bersaksi melainkan atas dasar apa yang kami ketahui, kami melihat tempat menakar milik raja ada dalam barang-barangnya; sedangkan kami tidak mengetahui bahwa dia akan mencuri ketika kami berjanji kepadamu untuk membawanya kembali dengan selamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. فَلَمَّا اسْتَيْـَٔسُوا۟ مِنْهُ (Maka tatkala mereka berputus asa dari Yusuf) Yakni berputus asa dari memohon kepada Yusuf agar mengabulkan permintaan mereka. خَلَصُوا۟ نَجِيًّا ۖ( mereka menyendiri sambil berunding dengan berbisik-bisik) Yakni mereka menyendiri dan saling berbisik diantara mereka. قَالَ كَبِيرُهُمْ(Berkatalah yang tertua diantara mereka) Terdapat pendapat mengatakan ia adalah Robel, dan pendapat lain mengatakan ia adalah Syam’un karena ia adalah pemimpin mereka. أَلَمْ تَعْلَمُوٓا۟ أَنَّ أَبَاكُمْ قَدْ أَخَذَ عَلَيْكُم مَّوْثِقًا مِّنَ اللهِ(ketahui bahwa sesungguhnya ayahmu telah mengambil janji dari kamu dengan nama Allah) Yakni sumpah dengan nama Allah bahwa mereka akan menjaga dan mengembalikan Bunyamin kepada ayah mereka. وَمِن قَبْلُ مَا فَرَّطتُمْ فِى يُوسُفَ ۖ( dan sebelum itu kamu telah menyia-nyiakan Yusuf) Yakni dan kalian telah mengetahui kelalaian kalian terhadap Yusuf dan tidak memenuhi janji dengan ayah kalian untuk menjaga Yusuf. فَلَنْ أَبْرَحَ الْأَرْضَ(Sebab itu aku tidak akan meninggalkan negeri Mesir) Yakni aku akan tetap tinggal di negeri Mesir. حَتَّىٰ يَأْذَنَ لِىٓ أَبِىٓ (sampai ayahku mengizinkan kepadaku (untuk kembali)) Untuk pergi dan kembali pulang. أَوْ يَحْكُمَ اللهُ لِى ۖ (atau Allah memberi keputusan terhadapku) Dengan keberhasilan mengambil kembali saudaraku dari orang yang telah mengambilnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Tatkala mereka sangat putus asa dengan Yusuf dan jawabannya, mereka menyendiri dan berdiskusi. Saudara tertua mereka yaitu Rubail atau Yahudza, atau saudara yang pendapatnya paling dewasa yaitu Syam’un berkata: “Bukankah kalian tahu bahwa ayah telah mengambil sumpah demi Allah atas kalian untuk menjaga sadara kalian. Dan sungguh telah lewat sebelum hal ini yaitu kelalaian kalian terhadap Yusuf dan kalian telah melanggar janji kalian. Aku tidak akan meninggalkan tanah Mesir dan kembali ke tanah Kan’an sampai ayah mengijinkanku untuk kembali atau Allah mengatur urusanku untuk kembali dan melepaskan saudaraku. Dialah seadil-adil hakim karena dia tidak akan menghakimi kecuali dengan benar dan adil.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika mereka telah berputus asa darinya} putus asa terhadap jawaban Yusuf terhadap permintaan mereka {mereka menyendiri} mereka menyendiri dari orang-orang {dengan berbisik-bisik} mereka berbisik-bisik dan berunding tentang sesuatu yang terjadi di antara mereka{Yang tertua di antara mereka berkata,“Tidakkah kalian tahu bahwa ayah kalian telah mengambil sumpah dari kalian dengan (nama) Allah} janji yang dikuatkan dengan nama Allah untuk menjaga anaknya dan membawanya kembali {dan sebelumnya kalian telah menyia-nyiakan Yusuf} kalian meremehkan perkara Yusuf dan tidak menjaga janji ayah kalian {Jadi aku tidak akan meninggalkan negeri ini} meninggalkan negeri Mesir {sampai ayahku mengizinkanku} Ayahku memperkenankan aku untuk kembali kepadanya dengan ridha {atau Allah memberi putusan terhadapku} Allah memberi putusan kepadaku dengan membawakan kembali saudaraku kepadaku {Dia adalah sebaik-baik pemberi putusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. Maka tatkala para saudara berputus asa dari (putusan) Yusuf agar sudi memaafkan saudara mereka (Bunyamin) “mereka menyendiri sambil berunding dengan berbisik-bisik”, maksudnya, mereka berkumpul menyendiri tanpa disertai orang lain lantas mulai berbisik-bisik di antara mereka. Maka, “berkatalah yang tertua di antara mereka, ‘Tidakkah kamu ketahui bahwa ayahmu telah mengambil janji darimu dengan Nama Allah”, dalam melindungi Bunyamin, dan bahwa kalian akan membawanya (pulang) kecuali musuh mengepung kalian. “Dan sebelum itu kamu telah menyia-nyiakan Yusuf”, maka pada diri kalian telah menyatu dua permasalahan: penyia-nyiaan kalian terhadap Yusuf di waktu silam, dan kalian tidak membawa pulang saudaranya pada saat berikutnya. Aku tidak punya alasan untuk aku haturkan kepada ayah. “Sebab itu, aku tidak akan meninggalkan negeri Mesir”, aku akan tinggal di negeri ini dan akan terus di sini “sampai ayahku mengizinkan kepadaku (untuk kembali), atau Allah memberi keputusan terhadapku”, maksudnya menkadirkan aku bisa pulang, baik sendirian atau bersama saudaraku “Dan Dia adalah hakim yang sebaik-baiknya”."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (خَلَصُواْ نَجِيّٗاۖ) khalashuu najiyyaa : menjauh berbisik-bisik satu sama lain. (أَخَذَ عَلَيۡكُم مَّوۡثِقٗا) akhadza ‘alaikum mautsiqaa : perjanjian dan sumpah kita akan membawanya pulang, kecuali jika habis dibantai musuh. (وَمِن قَبۡلُ مَا فَرَّطتُمۡ) wa min qablu maa farrathtum : kalian meninggalkan Bunyamin sebagai mana kalian dahulu meninggalkan Yusuf. (فَلَنۡ أَبۡرَحَ ٱلۡأَرۡضَ) falan abrahal ardha : aku tidak akan meninggalkan negeri ini, Mesir. Makna ayat : Masih mengenai kisah Yusuf dan para saudaranya, setelah Yusuf mengambil saudaranya (Bunyamin) karena tuduhan pencurian dan tidak menerima permohonan dari mereka untuk menggantikannya dengan salah satu dari mereka, mereka pun berunding sebagaimana yang Allah firmankan : (فَلَمَّا ٱسۡتَيۡ‍َٔسُواْ) Ketika mereka sudah putus asa (خَلَصُواْ نَجِيّٗاۖ) mereka berunding tentang masalah ini (قَالَ كَبِيرُهُمۡ) yaitu Raubil, ia berkata kepada mereka (أَلَمۡ تَعۡلَمُوٓاْ أَنَّ أَبَاكُمۡ قَدۡ أَخَذَ عَلَيۡكُم مَّوۡثِقٗا) mengingatkan tentang perjanjian yang telah Ya’kub ambil dari mereka, ketika meminta agar Bunyamin pergi bersama mereka karena pemimpin Mesir memintanya. (وَمِن قَبۡلُ مَا فَرَّطتُمۡ فِي يُوسُفَۖ) dan mengingatkan mereka tentang apa yang telah mereka lakukan terhadap Yusuf, ketika mereka melemparkannya ke dalam sumur dan menjualnya setelah ia berhasil keluar darinya. Lalu ia (Raubil) berkata—seperti yang Allah firmankan—( فَلَنۡ أَبۡرَحَ ٱلۡأَرۡضَ) “Aku akan tetap tinggal di Mesir, hingga ayahku mengizinkan aku pulang, (أَوۡ يَحۡكُمَ ٱللَّهُ لِيۖ) atau Allah menentukan kebaikan untukku, (وَهُوَ خَيۡرُ ٱلۡحَٰكِمِينَ) Dialah sebaik-baik pemberi keputusan.” Pelajaran dari ayat : • Bolehnya berdiskusi secara tertutup untuk perkara yang penting. • Bolehnya mengingatkan kewajiban dan konsekuensi dari suatu perjanjian dan menjaga janji tersebut. • Terkadang rasa malu menghalangi seorang mukmin dari perkara yang itu baik untuknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 80: Yakni putusan Yusuf yang menolak permintaan mereka untuk menukar Bunyamin dengan saudaranya yang lain. Yakni yang tertua umurnya atau yang paling matang idenya. Yang tertua umurnya adalah Ruubil, sedangkan yang paling matang idenya adalah Yahudza. Untuk menjaga saudaramu, dan kamu akan membawanya kembali kecuali jika kamu dikepung. Dan sebelum itu, kamu telah menyia-nyiakan Yusuf. Terus terang aku tidak sanggup menghadap ayahmu, demikian maksudnya. Dengan melepaskan saudaraku atau pulang sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 80",
    "description": "Pupuslah harapan mereka begitu mendengar jawaban nabi yusuf. Maka ketika mereka telah berputus asa darinya, yakni putusan nabi yusuf untuk membebaskan bunyamin dan menahan salah seorang di antara mereka sebagai gantinya, maka mereka pun menyendiri sambil berunding dengan berbisik-bisik. Yang tertua usianya di antara mereka berkata, tidakkah kamu ketahui bahwa ayahmu telah mengambil janji dari kamu dengan nama Allah untuk menjaga dan membawa pulang bunyamin ke hadapannya, dan sebelum itu ingatkah kamu bahwa kita dulu telah menyia-nyiakan yusuf dengan melemparkannya ke dalam sumur' sebab itu, aku tidak akan meninggalkan negeri mesir ini. Aku akan tetap tinggal di sini sampai ayahku mengizinkan aku untuk menghadapnya, atau Allah memberi keputusan terhadapku; aku akan menerima apa pun keputusan Allah. Dan dia adalah hakim yang senantiasa memberi keputusan terbaik bagi hamba-hamba-Nya. Karena tidak lagi ada peluang bagi anak-anak nabi yakub untuk mengubah keputusan al-aziz, mereka menyerah. Mereka dengan berat hati meninggalkan bunyamin. Saudara tertua mereka, karena merasa gagal menjaga bunyamin, pun tetap tinggal di mesir. Ia berpesan kepada mereka, kembalilah kepada ayahmu dan katakanlah kepadanya dengan lembut, 'wahai ayah kami! sesungguhnya anakmu, bunyamin, telah dituduh mencuri piala raja, dan kami hanya menyaksikan apa yang kami ketahui secara lahir, dan kami tidak mengetahui apa yang di balik itu."
  }
]