[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "pulanglah kalian kepada ayah kalian dan beritahukanlah kepadanya peristiwa yang telah terjadi, dan katakanlah kepadanya, ’sesungguhnya putramu, bunyamin telah mencuri, dan kami tidak bersaksi demikian, kecuali setelah kami meyakinkannya, sungguh kami telah menyaksikan bejana takaran (raja) berada dalam bawaan kendaraaannya, dan tidak ada pada kami pengetahuan tentang perkara ghaib bahwa ia akan mencuri ketika kami telah mengikat janji teguh denganmu untuk membawanya pulang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Saudara tertua mereka berkata, \"Pulanglah kalian ke rumah ayah kalian. Lalu katakan padanya, 'Sesungguhnya putramu telah mencuri. Dan sebagai hukumannya dia dijadikan budak oleh pejabat kerajaan Mesir. Kami hanya menyampaikan apa yang kami ketahui karena kami menyaksikan satu penakar dikeluarkan dari dalam wadah miliknya. Seandainya kami mengetahui hal itu pasti kami tidak berjanji untuk mengembalikannya kepadamu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. ارْجِعُوٓا۟ إِلَىٰٓ أَبِيكُمْ فَقُولُوا۟ يٰٓأَبَانَآ إِنَّ ابْنَكَ سَرَقَ (Kembalilah kepada ayahmu dan katakanlah: “Wahai ayah kami! Sesungguhnya anakmu telah mencuri) Mereka mengatakan ini karena mereka telah menyaksikan piala itu dikeluarkan dari karungnya. وَمَا شَهِدْنَآ إِلَّا بِمَا عَلِمْنَا(dan kami hanya menyaksikan apa yang kami ketahui) Yakni piala yang dikeluarkan dari karungnya yang mereka lihat dengan mata kepada mereka sendiri. وَمَا كُنَّا لِلْغَيْبِ حٰفِظِينَ(dan sekali-kali kami tidak dapat mengetahui hal yang ghaib) Sehingga kami dapat memastikan apakah kejadian itu sebagaimana yang kami lihat atau sebaliknya. Kemungkinan mereka ingin memberi kesaksian bahwa Bunyamin benar-benar mencuri. Dan maksud dari perkataan meraka yakni bisa jadi Bunyamin mencuri ketika mereka sedang tidur atau ketika tidak sedang bersama mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَمَا شَهِدْنَا إِلَّا بِمَا عَلِمْنَا } \"dan kami hanya menyaksikan apa yang kami ketahui\" Apapun yang kamu katakan adalah saksi bagimu, oeh karena itu apa yang tidak kamu ketahui kebenarannya janganlah kamu ikut campur di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Kembalilah kalian kepada ayah kalian dan katakanlah kepadanya: “Sesungguhnya anakmu mencuri cangkir raja, lalu dia dijadikan tebusan sesuai syariat kami. Kami tidak menyaksikan dia telah mencuri kecuali hanya menyaksikan dikeluarkannya cangkir itu dari muatannya. Dan kami tidak mengetahui sesuatu yang tak tampak di antara kami. Sehingga kami tidak tahu bahwa dia mencuri”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kembalilah kepada ayah kalian, lalu katakanlah,”Wahai ayah kami, sesungguhnya anakmu telah mencuri dan kami tidak bersaksi kecuali apa yang kami ketahui} kami lihat {dan terhadap yang gaib} terhadap sesuatu yang gaib bagi kami {kami bukanlah orang-orang yang menjaga} mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. Kemudian ia (saudara tertua) berpesan kepada yang lain tentang apa yang harus dikatakan kepada ayah mereka. Dia berkata, “Kembalilah kepada ayahmu lalu katakanlah, ‘Wahai ayah kami! Sesungguhnya anakmu telah mencuri’,” maksudnya dia ditahan karena perbuatan pencuriannya. Kami tidak berhasil membawanya pulang, meskipun sudah mengerahkan upaya untuk itu. Faktanya, sungguh kami tidaklah bersaksi dengan sesuatu yang tidak kami ketahui. Akan tetapi kami bersaksi atas apa yang kami ketahui saja. Karena kami menyaksikan piala raja dikeluarkan dari karungnya. “Dan sekali-kali kami tidak dapat menjaga (mengetahui) barang yang ghaib”, maksudnya sekiranya kami mengetahui ilmu ghaib, tentu kami tidak akan bersemangat dan mengerahkan upaya untuk kepergiannya bersama kami. Dan ketika kami telah memberikan janji dan jaminan, ternyata kami tidak pernah mengira kalau kejadiannya sampai seperti itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَمَا كُنَّا لِلۡغَيۡبِ حَٰفِظِينَ) wa maa kunnaa lilghaibi haafizhiin : kami tidak mengetahui perkara yang gaib. Makna ayat : Setelah menyakinkan mereka untuk meninggalkannya, ia memberikan arahan agar mereka mengatakan kepada ayah mereka tatkala pulang—sebagaimana firman Allah tentangnya—( ٱرۡجِعُوٓاْ إِلَىٰٓ أَبِيكُمۡ فَقُولُواْ يَٰٓأَبَانَآ إِنَّ ٱبۡنَكَ سَرَقَ وَمَا شَهِدۡنَآ إِلَّا بِمَا عَلِمۡنَا) “Pulang kepada ayah kalian dan katakan, “Sesungguhnya anakmu telah mencuri, sebagaimana kami melihat bahwa cawan itu dikeluarkan dari kantung saudara kami ini. (وَمَا كُنَّا لِلۡغَيۡبِ حَٰفِظِينَ) seandainya kami tahu bahwa ia akan berbuat seperti ini, tentu kami tidak akan membawanya bersama kami, sebagaimana kami tidak mengetahui seorang pencuri mengambil barang curiannya kecuali apa yang kami ketahui darimu. Pelajaran dari ayat : • Disyariatkannya memberikan nasehat dan membekali orang yang dinasehati dengan apa yang katakan dan ketahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 81: Yakni karena kami melihat piala itu ada di karungnya. Yakni ketika perjanjian diadakan. Maksudnya, seandainya kami mengetahui bahwa akan terjadi seperti itu tentu kami tidak akan mengambil perjanjian itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 81",
    "description": "Karena tidak lagi ada peluang bagi anak-anak nabi yakub untuk mengubah keputusan al-aziz, mereka menyerah. Mereka dengan berat hati meninggalkan bunyamin. Saudara tertua mereka, karena merasa gagal menjaga bunyamin, pun tetap tinggal di mesir. Ia berpesan kepada mereka, kembalilah kepada ayahmu dan katakanlah kepadanya dengan lembut, 'wahai ayah kami! sesungguhnya anakmu, bunyamin, telah dituduh mencuri piala raja, dan kami hanya menyaksikan apa yang kami ketahui secara lahir, dan kami tidak mengetahui apa yang di balik itu. Dan bila engkau memerlukan saksi, tanyalah penduduk negeri tempat kami berada ketika peristiwa itu terjadi, dan tanyalah pula kafilah yang datang bersama kami; mereka pun melihat peristiwa itu. Dan apa pun tanggapan ayah terkait peristiwa ini, dapat kami pastikan bahwa kami adalah orang yang benar."
  }
]