[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika mereka kembali dan mengabarkan kepada ayah mereka tentang apa yang telah terjadi, dan meminta ayah mereka agar mempercayai apa yang mereka kabarkan, seraya berkata, ”Dan tanyalah (wahai ayah kami), kepada penduduk mesir dan siapa saja yang bersama kami dalam rombongan khalifah yang kami berada bersama mereka, dan sesungguhnya kami jujur dalam berita yang kami kabarkan kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Dan untuk membuktikan kebenaran kami silahkan engkau -wahai ayah kami- bertanya kepada penduduk Mesir yang ada di sana. Tanyakan pada rombongan yang datang bersama kami, niscaya mereka akan menyampaikan apa yang telah kami sampaikan. Kami benar-benar jujur tentang kasus pencurian yang kami sampaikan kepada engkau'.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Dan tanyalah penduduk Mesir dan kafilah yang datang bersama kami peristiwa yang terjadi sebenarnya, sungguh kami jujur dalam hal ini’.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَسْـَٔلِ الْقَرْيَةَ الَّتِى كُنَّا فِيهَا (Dan tanyalah (penduduk) negeri yang kami berada disitu) Yakni tanyalah kepada penduduk negeri Mesir. وَالْعِيرَ الَّتِىٓ أَقْبَلْنَا فِيهَا ۖ( dan kafilah yang kami datang bersamanya) Dan tanyalah kepada kafilah yang kembali bersama kami dari negeri Mesir. Terdapat pendapat mengatakan mereka adalah para tetangga Nabi Ya’qub. وَإِنَّا لَصٰدِقُونَ(dan sesungguhnya kami adalah orang-orang yang benar) Dalam perkataan kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Tanyakanlah kepada penduduk negeri itu (negeri Mesir, dan orang-orang yang membawa unta (kereta) yang kembali bersama kami menuju negeri kami Kan’an. Sesungguhnya kami jujur dalam menyampaikan kabar tentang Benyamin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tanyalah (penduduk) negeri} penduduk Mesir {yang kami berada di sana dan kafilah} kafilah {yang kami datang bersamanya} yang kami datang bersamanya {Sesungguhnya kami adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. “Dan tanyalah”, jika engkau meragukan ucapan kami “(penduduk) negeri yang kami berada di situ, dan kafilah yang kami datang bersamanya”, mereka mengetahui apa yang kami beritahukan kepadamu “dan sesungguhnya kami adalah orang-orang yang benar”, kami tidak berbohong, tidak merubah dan tidak memutarbalikkan fakta. Itulah realita yang terjadi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَٱلۡعِيرَ ٱلَّتِيٓ أَقۡبَلۡنَا فِيهَاۖ) wal ‘iirullatii aqbalnaa fiihaa : rombangan dagang lain yang bersama kami, yaitu orang-orang Kan’an. Makna ayat : (وَسۡ‍َٔلِ ٱلۡقَرۡيَةَ ٱلَّتِي كُنَّا فِيهَا) Dan tanyalah penduduk kota itu (ibukota Mesir) (وَٱلۡعِيرَ ٱلَّتِيٓ أَقۡبَلۡنَا فِيهَاۖ) dan rombongan dagang dari Kan’an yang mereka adalah tetanggamu (وَإِنَّا لَصَٰدِقُونَ) dan kami telah jujur dalam mengkabarkan hal ini. Inilah arahan dari Raubil untuk saudara-saudaranya. Setelah mereka pulang dan menemui ayah mereka dan menceritakan apa yang Raubil katakan kepada mereka. Pelajaran dari ayat : • Bisa jadi seseorang yang tidak bersalah tertuduh karena kerancuan, atau tuduhan yang keluar tanpa pikir panjang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 82: Maksudnya, utuslah seseorang untuk bertanya kepada penduduk negeri tempat kami berada. Ada yang mengatakan, bahwa mereka adalah kaum Kan’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 82",
    "description": "Dan bila engkau memerlukan saksi, tanyalah penduduk negeri tempat kami berada ketika peristiwa itu terjadi, dan tanyalah pula kafilah yang datang bersama kami; mereka pun melihat peristiwa itu. Dan apa pun tanggapan ayah terkait peristiwa ini, dapat kami pastikan bahwa kami adalah orang yang benar. Anak-anak nabi yakub, selain bunyamin dan saudara tertua mereka, bertolak menuju kanaan. Setiba di kanaan mereka menceritakan kepada nabi yakub peristiwa yang mereka alami dan tuduhan yang ditujukan kepada bunyamin. Dia (nabi yakub) berkata, sebenarnya dalam hati kecilku hanya dirimu sendiri yang memandang baik atau memandang ringan urusan yang buruk itu; bahwa kalian tidak menepati janji untuk menjaga bunyamin. Maka kesabaranku adalah kesabaran yang baik. Aku bermohon kepada Allah mudah-Mudahan Allah mendatangkan mereka semuanya, baik bunyamin, saudara tertuamu, maupun yusuf kepadaku. Sungguh, dialah tuhan yang maha mengetahui, mahabijaksana."
  }
]