[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka sang ayah berkata kepada mereka, ”bahkan jiwa kalian yang suka memerintahkan keburukan telah menjadikan kalian memandang baik terhadap tipu daya yang sudah kalian atur, sebagaimana kalian perbuat sebelumnya terhadap yusuf. Maka kesabaranku adalah kesabaran yang baik, tanpa ada unsur berontak dan keluh kesah padanya. Mudah-mudahan Allah mengembalikan tiga anakku kepadaku, (yaitu Yusuf, saudaranya dan saudara tertua mereka yang tetap tinggal di mesir karena bunyamin). Sesungguhnya Dia Mahamengetahui keadaanku, lagi Mahabijaksana dalam pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Ayah mereka berkata kepada mereka, \"Tidak. Kejadiannya tidak seperti yang kalian ceritakan, ia tidak mencuri, tetapi kalian tergoda oleh hawa nafsu kalian untuk membuat tipu muslihat terhadapnya seperti yang pernah kalian lakukan terhadap saudaranya, Yusuf sebelum ini. Maka kesabaranku adalah kesabaran yang indah, tanpa keluh kesah kepada selain Allah. Mudah-mudahan Allah berkenan mengembalikan mereka semua -Yusuf dan adik kandungnya, serta kakak tertua mereka- kepadaku. Sesungguhnya Dia -Subḥānahu- Maha Mengetahui keadaanku lagi Maha Bijaksana dalam mengatur urusanku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Ketika mereka kembali kepada ayah mereka, mereka membuatnya menderita dengan berita menyedihkan. Maka dia berkata kepada mereka: “Kenyataannya bukanlah seperti itu, namun hawa nafsu kalian telah menghiasi perbuatan berbahaya bagi kalian, karena masalah ini akibat tipu daya yang dahulu kalian lakukan terhadap Yusuf. Maka kesabaranku adalah kesabaran yang baik, tanpa meratap dan tanpa mengeluh kepada selain Allah; semoga Allah mengembalikan tiga anakku ini, Dia Maha Mengetahui segala kejadian dan Maha Bijaksana dalam perkataan dan perbuatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. قَالَ (Ya’qub berkata) Yakni Nabi Ya’qub berkata setelah mendengar perkataan mereka. بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ (Hanya dirimu sendirilah yang memandang baik perbuatan (yang buruk) itu) Yakni memandang baik perkataan mereka “sesungguhnya anakmu telah mencuri”, padahal ia sebenarnya tidak mencuri. فَصَبْرٌ جَمِيلٌ ۖ (Maka kesabaran yang baik itulah (kesabaranku)) Kesabaran yang baik adalah kesabaran yang tidak disertai keluh kesah, namun sebaliknya ia menyerahkan dan mengembalikan urusannya kepada Allah. عَسَى اللهُ أَن يَأْتِيَنِى بِهِمْ جَمِيعًا (Mudah-mudahan Allah mendatangkan mereka semuanya kepadaku) Yakni Yusuf dan Bunyamin dan saudara mereka yang memutuskan untuk tetap tinggal di Mesir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ketika krisis terus menuntut dan ia semakin memanjang, dan permasalahan di dalamnya semakin menumpuk, maka kesabaranlah yang akan membimbing seorang muslim dari kegamangan itu, dan salah satu contoh yang baik dalam hal ini ada pada Nabi Ya'kub -'alaihissalam-, tatkala ujian dan cabaran menimpa dirinya beliau hanya berkata : { فَصَبْرٌ جَمِيلٌ } \"Maka kesabaran yang baik itulah (kesabaranku)\". 2 ). { عَسَى اللَّهُ أَنْ يَأْتِيَنِي بِهِمْ جَمِيعًا } \"Mudah-mudahan Allah mendatangkan mereka semuanya kepadaku\" seperti inilah keadaan seorang mukmin dalam menjaga hubungannya kepada tuhannya, ia senantiasa berbaik sangka kepada-Nya, namun bagaimana dengan keadaan hari-hari ini yang penuh dengan fitnah? Ibnu al-Mubarok berkata : suatu ketika saat sore hari di arofah aku mendatangi Sufyan yang sedang bersandar dilututnya, dan kedua matanya tampak menatap kosong, seketika aku menangis! kemudia beliau menoleh kepadaku dan berkata : ada apa denganmu? siapakah yang nasibnya sangat buruk sekarang ini ? beliau kemudian menjawab lagi : orang yang berprasangka bahwa Allah tidak memberi ampun kepadanya. 3 ). Iman seorang mukmin akan muncul tatkala ia tengah berada dalam ujian, bahkan ia terus memanjatkan doa namun tidak melihat hasil dari doanya itu, tetapi harapan dan tidak berubah sekalipun pengaruh-pengaruh pesimistis semakin kuat; karena ia tahu bahwa tuhannya lebih faham akan kebutuhannya dan kebaikan untuk dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Ya’kub berkata kepada mereka: “Aku tidak percaya kepada kalian. Hanya diri kalian yang menganggap baik perkara (buruk) yang telah kalian lakukan, sebagaimana dahulu yang terjadi kepada Yusuf. Kesabaranku adalah termasuk kesabaran yang baik (tidak ada keresahan dan keluhan di dalamnya kepada siapapun kecuali kepada Allah SWT), barangkali Allah membawakan Yusuf dan semua saudaranya kepadaku, Sesungguhnya Dia Maha Mengetahui atas keadaan dan kesedihanku dan Maha Bijsaksana dalam penciptaanNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“tetapi telah diri kalian telah membuat indah} membuat indah {perkara itu bagi kalian. Maka kesabaran yang baik. Mudah-mudahan Allah mendatangkan mereka semua kepadaku. Sesungguhnya Dialah Yang Maha Mengetahui lagi Maha bijaksana.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Tatkala mereka kembali kepada ayah mereka dan mengabarkan berita ini, maka kesedihannya pun semakin dahsyat, kepiluannya pun menjadi-jadi, dan menuduh mereka dalam kejadian ini sebagaimana tuduhan yang beliau alamatkan kepada mereka pada peristiwa yang pertama. “Dia berkata, ‘Hanya dirimu sendirilah yang memandang baik perbuatan (yang buruk) itu. Maka kesabaran yang baik itulah (kesabaranku)’,” maksudnya dalam masalah ini, beliau membentengi diri dengan kesabaran yang baik yang tidak disertai oleh kemurkaan, keluh kesah juga pengaduan kepada manusia. Selanjutnya, beliau mengharapkan datangnya jalan keluar saat menyaksikan persoalan semakin pelik dan kesulitan sudah di ambang batas. Beliau berkata, “Mudah-mudahan Allah mendatangkan mereka semuanya kepadaku”, maksudnya, Yusuf, Bunyamin, dan saudara tertua mereka yang tinggal di Mesir. “Sesungguhnya Dia-lah yang Maha Mengetahui”, Dzat Yang Mengetahui keadaan dan kebutuhanku terhadap solusi masalah, karuniaNya dan (mengetahui) keperluan mendesakku kepada curahan kebaikanNya, “lagi Mahabijaksana”, Dzat yang menjadikan bagi segala perkara batas penyelesaiannya sesuai dengan kandungan hikmah rabbaniNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ) sawwalat lakum anfusukum : dihiasi atas kalian suatu perkara, lalu kalian melakukannya. (أَن يَأۡتِيَنِي بِهِمۡ جَمِيعًاۚ) ayya’tiyanii bihim jami’aa : mengembalikan Yusuf dan dua saudaranya Bunyamin dan Raubil. Makna ayat : Kemudian Ya’kub ‘alaihi salam menjawab mereka (قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرٗاۖ) “Nafsu kalian telah menghiasi perbuatan kalian, lantas kalian ikuti (فَصَبۡرٞ جَمِيلٌۖ) kesabaranku atas segala yang menimpaku adalah kesabaran yang baik, tidak ada rintihan, keluhan kepada siapapun kecuali Allah (عَسَى ٱللَّهُ أَن يَأۡتِيَنِي بِهِمۡ جَمِيعًاۚ) semoga Allah mengembalikan mereka semua, yaitu Yusuf, Bunyamin, dan Raubil. (إِنَّهُۥ هُوَ ٱلۡعَلِيمُ) Sungguh ia Maha Mengetahui kebutuhanku kepada-Nya (ٱلۡحَكِيمُ) Maha Bijaksana dalam pengaturan-Nya untuk para wali dan hamba-hamba-Nya yang saleh. Pelajaran dari ayat : • Bolehnya menampakkan kesedihan dan mengadu kepada Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 83: Maka saudara-saudaranya pulang kepada bapaknya dan berkata seperti itu. Nabi Ya’kub menuduh mereka karena peristiwa yang lalu yang dialami Yusuf. Yakni kesabaran yang tidak disertai keluh kesah, kesal, dan mengadu kepada makhluk. Kemudian Beliau beralih kepada terbukanya jalan keluar karena melihat bahwa perkaranya semakin parah, dan penderitaan jika sudah mencapai tingkatnya akan berhenti. Yakni Yusuf dan kedua saudaranya (Bunyamin dan saudaranya yang menetap di Mesir). Keadaanku. Dalam tindakan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 83",
    "description": "Anak-anak nabi yakub, selain bunyamin dan saudara tertua mereka, bertolak menuju kanaan. Setiba di kanaan mereka menceritakan kepada nabi yakub peristiwa yang mereka alami dan tuduhan yang ditujukan kepada bunyamin. Dia (nabi yakub) berkata, sebenarnya dalam hati kecilku hanya dirimu sendiri yang memandang baik atau memandang ringan urusan yang buruk itu; bahwa kalian tidak menepati janji untuk menjaga bunyamin. Maka kesabaranku adalah kesabaran yang baik. Aku bermohon kepada Allah mudah-Mudahan Allah mendatangkan mereka semuanya, baik bunyamin, saudara tertuamu, maupun yusuf kepadaku. Sungguh, dialah tuhan yang maha mengetahui, mahabijaksana. Dan setelah berkata demikian, dia (nabi yakub) berpaling dari mereka untuk menyendiri seraya berkata, aduhai duka citaku terhadap yusuf, dan karena terlalu banyak meneteskan air mata, kedua matanya menjadi putih karena sedih sehingga tidak bisa lagi melihat. Dia lebih banyak diam karena menahan amarah kepada anak-anaknya."
  }
]