[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ya’qub berpaling dari mereka, sedang hatinya sungguh telah sesak lantaran perkataan yang mereka ucapkan. Ia berkata, ”betapa sedihku terhadap yusuf,” dan dua bola matanya menjadi putih karena hilang hwarna hitam matanya disebabkan beratnya kesedihan. Dia seorang yang hatinya terliputi kesedihan, akan tetapi dia berusaha keras menyembunyikannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Sang ayah menjauh dan berpaling dari mereka seraya berkata, \"Alangkah sedihnya hatiku mengenang Yusuf.\" Hitam bola matanya berubah menjadi putih karena terlalu banyak menangisi Yusuf. Hatinya diliputi kesedihan dan resah yang mendalam. Tetapi dia menyembunyikan kesedihan hatinya dari masyarakat luas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Kemudian Ya’qub berpaling dari anak-anaknya dan menghentikan pembicaraan dengan mereka: “Sungguh besar kesedihanku terhadap Yusuf.” Hitam matanya berubah menjadi putih karena telalu bersedih dan sering menangis, sehingga dia kehilangan penglihatannya. Hatinya dipenuhi kesedihan dan kegundahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَتَوَلَّىٰ عَنْهُمْ وَقَالَ يٰٓأَسَفَىٰ عَلَىٰ يُوسُفَ (Dan Ya’qub berpaling dari mereka (anak-anaknya) seraya berkata: “Aduhai duka citaku terhadap Yusuf”) Yakni dia berpaling dan tidak berbicara kepada mereka, serta merasa sedih dan menangis dengan penuh kedukaan. وَابْيَضَّتْ عَيْنَاهُ مِنَ الْحُزْنِ(dan kedua matanya menjadi putih karena kesedihan) Yakni retina pada kedua matanya menjadi putih karena berlalu banyak menangis. فَهُوَ كَظِيمٌ(dan dia adalah seorang yang menahan amarahnya) Yakni hatinya penuh dengan kesedihan namun ia menahannya dan tidak menunjukkannya pada orang lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu al-Jauzi mengatakan tentang ayat ini : { يَا أَسَفَىٰ عَلَىٰ يُوسُفَ } \"Aduhai duka citaku terhadap Yusuf\" bahwasanya lafazh ini adalah ungkapan keluhan, lalu dimana kesabaran yang dengannya Ya'kub dipuji? Pertama : Bahwasanya Ya'kub mengadu kepada Allah bukan karena Yusuf, Kedua : bahwasanya Ya'kub bermaksud dari kalimatnya itu adalah doa, yakni wahai tuhanku kasihanilah duka citaku kepada Yusuf. Ibnu al-Anbari berkata : kesedihan dan larinya seseorang dari hal yang ia benci ataupun dari musibah bukanlah 'aib bagi dirinya, dan kalimat itu bukanlah dosa selama lisannya tidak mengucapkan kata-kata yang keji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Ya’kub berpaling dari anak-anaknya karena tidak mau berbicara dengan mereka, seraya berkata: “Duhai kesedihanku terhadap Yusuf,” Lalu matanya tertutup samar-samar memutih sampai hampir tidak bisa melihat, karena dahsyatnya tangisan dan kesedihannya atas kehilangan 3 anaknya. Dia dipenuhi dengan amarah dan kesedihan. Dia bersedih dan kesusahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berpaling} berpaling {dari mereka dan berkata,“Betapa kasihan} betapa mendalamnya kesedihanku {Yusuf”. Kedua matanya menjadi putih karena bersedih. Dia adalah orang yang sungguh-sungguh menahan} dipenuhi dengan kesedihan dan menahannya sehingga dia tidak mengeluarkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. Ya’qub berpaling dari anak-anaknya usai mereka mengabarkan berita ini. Kesedihan dan dukanya semakin besar. Dua matanya memutih lantaran deraan kesedihan di kalbu, dan kepiluannya yang membuat beliau sering menangis di mana dua matanya menjadi putih. “Dan dia adalah seorang yang menahan amarahnya (terhadap anak-anaknya)”, maksudnya, hatinya penuh dengan kesedihan yang menyayat “Dia berkata, ‘Aduhai duka citaku terhadap Yusuf,” maksudnya tampak pada beliau perasaan yang tersembunyi (di hatinya) berupa kesedihan yang sudah lama dan kerinduan yang selalu menghampiri. Musibah yang ringan ini –ditilik dari (beratnya) musibah pertama- mengingatkan memori beliau terhadap musibah yang pertama"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَتَوَلَّىٰ عَنۡهُمۡ) wa tawallaa ‘anhum : berpaling dari percakapan mereka. (وَقَالَ يَٰٓأَسَفَى) wa qaala yaa ‘asafaa : wahai kesedihan, datanglah! Sudah saatnya engkau datang. (فَهُوَ كَظِيمٞ) fahuwa kazhiim : sedih dan murung, namun tidak menampakkannya. Makna ayat : (وَتَوَلَّىٰ عَنۡهُمۡ) Lalu ia berpaling dari pembicaraan tersebut (وَقَالَ يَٰٓأَسَفَىٰ) Duhai duka citaku (عَلَىٰ يُوسُفَ) terhadap Yusuf. Kemudian Allah mengabarkan tentang keadaannya setelah ini (وَٱبۡيَضَّتۡ عَيۡنَاهُ مِنَ ٱلۡحُزۡنِ) matanya menjadi putih, yaitu ia kehilangan pengelihatannya karena matanya menjadi putih karena kesedihannya (فَهُوَ كَظِيمٞ) dirinya telah penuh dengan kesedihan dan kegelisahan, namun ia tidak mengadukan permasalahannya kepada siapapun kecuali kepada Rabbnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 84: Yakni meninggalkan berbicara dengan mereka. Dan tidak menunjukkan deritanya yang dalam kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 84",
    "description": "Dan setelah berkata demikian, dia (nabi yakub) berpaling dari mereka untuk menyendiri seraya berkata, aduhai duka citaku terhadap yusuf, dan karena terlalu banyak meneteskan air mata, kedua matanya menjadi putih karena sedih sehingga tidak bisa lagi melihat. Dia lebih banyak diam karena menahan amarah kepada anak-anaknya. Melihat nabi yakub terus-menerus mengingat nabi yusuf. Mereka berkata, demi Allah, engkau tidak pernah henti-hentinya mengingat nabi yusuf yang sudah tidak diketahui lagi keberadaannya, sehingga engkau mengidap penyakit berat yang membuat badanmu kurus dan pikiranmu kacau atau membuat engkau termasuk orang-orang yang akan binasa dan meninggal dunia."
  }
]