[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’qub berkata menjawab mereka, ”Aku tidak ingin menampakan duka dan kesedihanku, kecuali kepada Allah semata. Dialah Dzat yang akan menghilangkan madarat dan musibah, dan aku mengetahui rahmat Allah dan jalan keluar dariNya yang tidak kalian ketahui.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Sang ayah berkata kepada mereka, \"Aku tidak pernah mengadukan kepedihan dan kesedihan hatiku selain kepada Allah saja. Dan aku mengetahui kasih sayang Allah, kebaikan-Nya, jawaban-Nya dan balasan-Nya bagi orang yang ditimpa musibah yang tidak kalian ketahui.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Ya’qub menjawab: “Aku tidak mengeluhkan kesedihan dan kegundahanku kepada kalian, namun aku hanya mengeluhkannya kepada Allah yang dapat menghilangkan kemudharatan, dan aku mengetahui dari rahmat dan wahyu-Nya apa yang tidak kalian ketahui.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. قَالَ إِنَّمَآ أَشْكُوا۟ بَثِّى (Ya’qub menjawab: “Sesungguhnya hanyalah kepada Allah aku mengadukan kesusahan) Makna (البث) yakni segala sesuatu yang menimpa seseorang yang menjadikannya sangat sedih sehingga ia tidak dapat menyembunyikannya. Dengan ini makna dari (البث) yakni kesedihan yang paling mendalam dan paling susah untuk dipikul. وَأَعْلَمُ مِنَ اللهِ مَا لَا تَعْلَمُونَ (dan aku mengetahui dari Allah apa yang kamu tiada mengetahuinya) Tentang kelembutan dan kebaikan-Nya serta pahala yang Dia berikan atas kesabaran terhadap suatu musibah. Pendapat lain mengatakan yang dimaksud Nabi Ya’qub adalah pengetahuan tentang keadaan Nabi Yusuf yang masih hidup. Dan pendapat lain mengatakan, yakni pengetahuan bahwa mimpi Nabi Yusuf adalah benar, oleh sebab itu dia pasti kembali kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Ya’kub berkata kepada mereka: “Sesungguhnya aku mengeluhkan seagung-agung kesedihanku hanya kepada Allah, bukan selainNya. Dialah Dzat yang menerima keluhan. Tinggalkanlah aku dengan kesusahan dan penderitaanku. Aku mengetahui keutamaan Allah dan aturanNya, serta kelembutan dan kasih sayangNya yang mana tidak kalian ketahui. Sesungguhnya Dia tidak mengecewakan orang yang berdoa kepadaNya.” Al-Butsu adalah kesusahan yang sangat banyak, dan Al-huznu adalah penderitaan di dalam jiwa karena kesusahan yang sangat dahsyat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mati {Dia menjawab, “Sesungguhnya aku mengadukan kesusahan} kesusahanku {dan kesedihanku hanya kepada Allah. Aku mengetahui dari Allah apa yang tidak kalian ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Ya’qub berkata, “Sesungguhnya aku mengadukan kesusahanku”, yaitu perkataan yang aku munculkan “dan kesedihanku” yang berada dalam hati “hanya kepada Allah”, semata, tidak kepada kalian, dan tidak pula kepada orang lain. Berbicaralah sekehendak kalian “dan aku mengetahui dari Allah apa yang kamu tiada mengetahuinya”, bahwa Dia akan memulangkan mereka semua kepadaku dan menyejukan pandanganku dengan berkumpul kembali dengan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَشۡكُواْ بَثِّي) asykuu batstsii : aku mengadukan duka ku. Al-bats adalah rasa sedih yang sangat sehingga menyebar sampai orang lain. Makna ayat : Ya’kub pun menjawab mereka : (قَالَ إِنَّمَآ أَشۡكُواْ بَثِّي) “Aku mengadukan kesusahan (وَحُزۡنِيٓ إِلَى ٱللَّهِ وَأَعۡلَمُ مِنَ ٱللَّهِ مَا لَا تَعۡلَمُونَ) dan kesedihanku hanya kepada Allah. Dan aku mengetahui dari Allah apa yang tidak kalian ketahui.” Maksudnya harapan beliau kepada Allah sangatlah besar dan tidak akan merugi orang yang menggantungkan harapannya kepada Allah, serta mimpi Yusuf adalah benar, Allah akan mengumpulkan mereka dan bersujud kepadanya sebagaimana mimpi itu. Pelajaran dari ayat : • Tidak bolehnya mengeluh kepada selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 86: Karena pengaduan hanyalah bermanfaat jika ditujukan kepada-Nya. Yaitu bahwa mimpi Yusuf adalah benar, dia masih hidup dan bahwa dia akan berkumpul bersamaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 86",
    "description": "Ucapan sinis anak-anaknya diterima oleh nabi yakub dengan penuh kesabaran. Dia menjawab, hanya kepada Allah aku tanpa jemu dan bosan mengadukan seluruh kesusahan dan kesedihanku. Dan aku mengetahui berkat rahmat dan karunia dari Allah apa yang tidak kamu ketahui. Sebagai nabi dan rasul, nabi yakub sebenarnya tahu nabi yusuf masih hidup, hanya saja Allah belum memberitahukan tempat keberadaannya. Untuk itulah nabi yakub meminta anak-anaknya mencari yusuf dan menjemput bunyamin, wahai anak-anakku! pergilah kamu kembali ke mesir, dan carilah berita tentang yusuf dan saudaranya, bunyamin, dan jangan kamu berputus asa dari rahmat dan pertolongan Allah. Sesungguhnya tidak ada yang berputus asa dari rahmat dan pertolongan Allah, melainkan hanyalah orang-orang yang kafir."
  }
]