[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’qub berkata, ”Wahai anak-anakku, kembalilah kalian ke mesir, dan carilah dengan seksama berita tentang yusuf dan saudaranya. Dan janganlah kalian putus harapan dari rahmat Allah. Sesungguhya tidak ada yang putus harapan dari rahmat Allah, kecuali orang-orang yang ingkar terhadap kekuasaanNya, yang kafir kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Sang ayah berkata kepada mereka, \"Wahai anak-anakku! Pergilah kalian untuk mencari kabar tentang Yusuf dan saudaranya. Dan jangan pernah merasa putus asa terhadap pertolongan serta jalan keluar dari Allah kepada hamba. Orang yang merasa putus asa terhadap pertolongan Allah hanyalah orang-orang kafir, karena mereka tidak mengetahui besarnya kekuasaan Allah dan rahasia anugerah-Nya kepada hamba-hamba-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Kemudian Ya’qub berkata kepada mereka dengan penuh keyakinan kepada rahmat Allah: “Wahai anak-anakku, pergilah ke negeri Mesir untuk mencari kabar tentang Yusuf dan dua saudaranya, dan janganlah kalian berputas asa dari rahmat Allah yang luas, karena tidak ada yang berputus asa dari rahmat-Nya melainkan orang yang mendustakan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. ۟ فَتَحَسَّسُوا۟ مِن يُوسُفَ وَأَخِيهِ(maka carilah berita tentang Yusuf dan saudaranya) Agar kalian mengetahui kabar berita tentang Nabi Yusuf dan seudaranya. وَلَا تَا۟يْـَٔسُوا۟ مِن رَّوْحِ اللهِ ۖ( dan jangan kamu berputus asa dari rahmat Allah) Yakni janganlah kalian berputus asa dari jalan keluar dan bantuan yang akan diberikan Allah. Makna dari (الروح) yakni segala yang dirasakan dan diyakini seseorang tentang keberadaan dan kedatangannya. إِنَّهُۥ لَا يَا۟يْـَٔسُ مِن رَّوْحِ اللهِ إِلَّا الْقَوْمُ الْكٰفِرُونَ(Sesungguhnya tiada berputus asa dari rahmat Allah, melainkan kaum yang kafir) Sebab mereka tidak mengetahui kekuasaan Allah dan keagungan kehendak-Nya serta kelembutan kasih sayang-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Untuk menyelesaikan perkara-perkara yang besar dan permasalahan-permasalahan yang sulit dan sukar memerlukan cara yang lembut penuh dengan kesabaran dan selalu memperhatikan strategi yang baik : { اذْهَبُوا فَتَحَسَّسُوا } \"pergilah kamu, maka carilah berita\" , { وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا } \"dan janganlah sekali-kali menceritakan halmu kepada seorangpun\" [ Al-Kahfi : 19 ]. 2 ). Perhatikan wasiat Yakub kepada anak-anaknya : { فَتَحَسَّسُوا مِنْ يُوسُفَ وَأَخِيهِ } dan wasiat beberapa pemuda kepada kawannya untuk mencari sesuatu untuk mereka makan : { وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا } \"dan hendaklah ia berlaku lemah-lembut dan janganlah sekali-kali menceritakan halmu kepada seorangpun\" [ Al-Kahfi : 19 ] Ya'kub yang telah hilang penglihatannya, dan indra yang paling penting untuk mencari sesuatu dengan teliti adalah \"tahassus\", oleh karena itu kalimatnya diungkapkan dengan lafazh itu. Sedangkan pemuda yang situasi mereka terbangun di atas kehati-hatian khawatir kaum disana akan mengetahui mereka, maka kalimat itu diungkapkan dengan lafazh yang sesuai. 3 ). Walapun musibah terus berdatangan dengan banyaknya dan terus berganti kepada Nabi Allah Ya'kub; namun hal yang tidak pernah berubah dari dirinya adalah prasangkaan baiknya kepada Tuhannya yang Esa. 4 ). { وَلَا تَيْأَسُوا مِنْ رَوْحِ اللَّهِ ۖ} Sesungguhnya racun pesimis yang selalu diandalkan oleh orang-orang munafiq untuk meruntuhkan kekuatan orang-orang beriman, dapat dilawan dengan penawarnya yang lebih kuat, yaitu meningkatkan keyakinan kita dan tawakkal kepada Allah, dan percaya bahwa dzat yang mampu mengeluarkan minuman dari pada apa yang berada dalam perut (berupa) susu yang bersih antara tahi dan darah, juga mampu mengeluarkan pertolongan-Nya dari sendi-sendi kerusakan dan permasalahan. 5 ). Sikap optimis yang positif yang diharapkan hasilnya adalah : itulah amal yang dikerjakan dengan kesungguhan tanpa terburu-buru, sikap yang dibangun di atas kepercayaan kepada Allah dan dengan melaksanakan sebab-sebabnya tanpa bersandar hanya kepadanya, tadabburilah wasiat mulia ini yang menggambarkan jalan keluar bagi mereka yang senantiasa bersikap optimis : { وَلَا تَيْأَسُوا مِنْ رَوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِنْ رَوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ } \"dan jangan kamu berputus asa dari rahmat Allah. Sesungguhnya tiada berputus asa dari rahmat Allah, melainkan kaum yang kafir\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Ya’kub melanjutkan ucapannya: “Wahai anak-anakku, pergilah kalian ke Mesir. Carilah kabar tentang Yusuf dan saudaranya. Janganlah kalian menyerah dengan rahmat Allah dengan terus berkabung dalam kesedihan dan kegelisahan kita. Sesungguhnya tidak ada yang menyerah dengan rahmat Allah kecuali orang yang menolak anugerah, kuasa dan kelembutan Allah” Ar-Rauhu adalah setiap sesuatu yang mengguncang manusia dan sesuatu yang bisa dinikmati olehnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai anak-anakku, pergilah dan carilah berita tentang Yusuf dan saudaranya} carilah kabar tentang Yusuf dan saudaranya {Janganlah berputus asa} berputus asa {dari rahmat Allah} kelapangan dan pembebasan Allah {Sesungguhnya tidak ada yang berputus asa dari rahmat Allah, kecuali kaum yang kafir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Maksudnya, Ya’qub berkata kepada anak-anaknya, “Hai anak-anakku, pergilah kamu, maka carilah berita tentang Yusuf dan saudaranya” maksudnya, bersemangat dan bersungguh-sungguhlah dalam mencari mereka berdua “dan jangan kamu berputus asa dari rahmat Allah”, karena optimisme akan mendorong seorang hamba kepada usaha dan ketekunan serius untuk mencapai apa yang diharapkannya. Sedangkan putus asa, hanya akan mengakibatkan perasaan berat dan bermalas-malasan baginya. Pengharapan yang paling utama diinginkan seorang hamba ialah kemurahan dan curahan kebaikan Allah, rahmat dan kasihNya. “Sesungguhnya tiada berputus asa dari rahmat Allah, melainkan kaum yang kafir”, karena kekafiran mereka, maka mereka menjauhi rahmatNya dari diri mereka. Dan (memang) rahmat Allah jauh dari mereka. Maka janganlah kalian menyerupai orang-orang kafir. Ayat ini menunjukkan bahwa sesuai kadar keimanan seorang hamba (kepada Allah), maka level pengharapannya kepada rahmat Allah dan kasihNya berada (pada kadar itu)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَتَحَسَّسُواْ) fatahassasuu : carilah, sampai kalian mendapatkan kabar tentang mereka berdua sampai mendapatkan hasil. (مِن رَّوۡحِ ٱللَّهِۖ) mir rauhillah : dari rahmat Allah. Makna ayat : Oleh karena itu ia berkata—seperti firman-Nya (يَٰبَنِيَّ ٱذۡهَبُواْ فَتَحَسَّسُواْ مِن يُوسُفَ وَأَخِيهِ) “Carilah kabar mengenai mereka berdua, dengan bertanya atau mencari mereka. (وَلَا تَاْيۡ‍َٔسُواْ مِن رَّوۡحِ ٱللَّهِۖ) dan jangan berputus asa dari rahmat Allah (إِلَّا ٱلۡقَوۡمُ ٱلۡكَٰفِرُونَ) tidak ada yang berputus asa dari rahmat Allah, kecuali orang-orang kafir. Pelajaran dari ayat : • Haramnya berputus asa untuk mendapat kelapangan tatkala cobaan datang dan dari rahmat ketika azab menimpa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 87: Yang demikian adalah karena sikap harap menghendaki seseorang untuk terus berusaha dan bersunguh-sungguh terhadap harapannya. Sedangkan sikap putus asa menghendaki seseorang berat untuk maju dan berlambat-lambatan, dan hal yang paling patut diharap seorang hamba adalah karunia Allah, ihsan-Nya, dan rahmat-Nya. Oleh karena itu, janganlah menyerupai mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 87",
    "description": "Sebagai nabi dan rasul, nabi yakub sebenarnya tahu nabi yusuf masih hidup, hanya saja Allah belum memberitahukan tempat keberadaannya. Untuk itulah nabi yakub meminta anak-anaknya mencari yusuf dan menjemput bunyamin, wahai anak-anakku! pergilah kamu kembali ke mesir, dan carilah berita tentang yusuf dan saudaranya, bunyamin, dan jangan kamu berputus asa dari rahmat dan pertolongan Allah. Sesungguhnya tidak ada yang berputus asa dari rahmat dan pertolongan Allah, melainkan hanyalah orang-orang yang kafir. Anak-anak nabi yakub lalu mempersiapkan diri untuk kembali berangkat ke mesir. Keberangkatan mereka kali ini bukan semata untuk menyelidiki keberadaan nabi yusuf, melainkan juga untuk memperoleh bahan makanan karena saat itu cadangan makanan mereka sudah menipis. Maka setelah menempuh perjalanan yang melelahkan, sampailah mereka di mesir, dan ketika mereka masuk ke tempat nabi yusuf, mereka berkata, wahai al-aziz yang mulia! kami dan keluarga kami di kanaan telah ditimpa kesengsaraan karena paceklik berkepanjangan dan kami datang membawa barang-barang yang tidak berharga untuk ditukar dengan bahan makanan. Hanya itu yang kami miliki, maka kami bermohon, wahai al-aziz yang mulia, penuhilah jatah gandum untuk kami, dan bersedekahlah kepada kami. Sesungguhnya Allah memberi balasan yang berlipat ganda kepada orang yang bersedekah."
  }
]