[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian mereka pergi menju mesir. Dan ketika mereka masuk menemui yusuf, mereka berkata, “Wahai pembesar, kekeringan dan paceklikan telah menimpa kami dan keluarga kami. Dan kami datang kepadamu dengan barang penukar tang buruk lagi sedikit. Maka sudilah engkau memberikan kepada kami apa yang sebelumnya engkau berikan kepada kami dengan barang penukar yang baik. Dan bersedekahlah kepada kami dengan menerima beberapa keping dirham yang tidak berharga ini dan abaikanlah kondisinya. Sesungguhnya Allah akan memberikan balasan kepada orang yang murah hati dengan harta kekayaan mereka terhadap orang-orang yang membutuhkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Kemudian mereka menjalankan perintah ayah mereka. Mereka pergi untuk mencari Yusuf dan saudaranya. Kemudian tatkala mereka bertemu dengan Yusuf, mereka berkata kepadanya, \"Kami ditimpa kesulitan dan kemiskinan. Dan kami datang dengan barang-barang yang murah dan tidak berharga. Maka berilah kami takaran yang penuh seperti yang telah engkau berikan kepada kami sebelum ini. Dan berilah kami sedekah untuk menambah takaran kami. Atau jangan melihat nilai barang-barang kami yang murah itu. Sesungguhnya Allah akan memberikan balasan yang terbaik kepada orang-orang yang mau bersedekah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Mereka menuruti permintaan ayah mereka dan berangkat menuju Mesir. Ketika mereka telah memasuki tempat Yusuf, mereka berkata kepadanya dengan lembut dan penuh penghormatan: “Kami dan keluarga kami telah tertimpa kekeringan; dan kami mendatangimu dengan sedikit barang penukaran, maka penuhilah takaran bagi kami dan jangan engkau kurangi karena barang-barang kami tidak berharga, dan bersedekahlah kepada kami sebagian harta yang engkau miliki, sungguh Allah akan memberi pahala bagi orang yang bersedekah kepada orang-orang yang membutuhkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. فَلَمَّا دَخَلُوا۟ عَلَيْهِ (Maka ketika mereka masuk ke (tempat)nya) Yakni ke tempat Yusuf. مَسَّنَا وَأَهْلَنَا الضُّرُّ (kami dan keluarga kami telah ditimpa kesengsaraan) Yakni penyakit yang menimpa diri dan keluarga kami akibat kesengsaraan yang menimpa kami berupa kekeringan, kelapaaran, dan kemiskinan. وَجِئْنَا بِبِضٰعَةٍ مُّزْجَىٰةٍ (dan kami datang membawa barang-barang yang tak berharga) Yakni barang-barang yang tidak diterima oleh para pedagang karena hanya sedikit dan tidak berharga. وَتَصَدَّقْ عَلَيْنَآ (dan bersedekahlah kepada kami) Baik itu dengan tambahan bagi mereka atas barang yang mereka tukarkan atau dengan mengabaikan kekurangan yang ada pada barang-barang yang mereka bawa. Atau yang dimaksud adalah dengan mengembalikan saudara mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Barangsiapa yang memperhatikan bagaimana saudara-saudara Yusuf yang tunduk tatkala mereka mengatakan : { وَتَصَدَّقْ عَلَيْنَا } , akan mengetahui kemalangan orang-orang yang telah tergelincir dengan kata-kata mereka sendiri!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Ketika anak-anak Ya’kub menemui Yusuf, mereka berkata: “Wahai Al-‘Aziz, kami dan keluarga kami ditimpa derita, yaitu kelaparan, kebutuhan mendesak dan penyakit akibat kegersangan. Dan Kami membawa beberapa uang dirham yang rendah nilainya, maka penuhilah muatan kami. Dan lebihkanlah untuk kami untuk menyisakan uang kami yang masih sedikit. Sesungguhnya Allah memberi imbalan orang-orang yang memberi kelebihan dengan sebaik-baik balasan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka masuk ke (tempat)nya} tempat Yusuf {mereka berkata,“Wahai yang mulia, kami dan keluarga kami telah ditimpa} telah ditimpa {kesengsaraan} penderitaan dan kelaparan {dan kami datang membawa barang-barang yang tidak berharga} dirham-dirham yang murah lagi sedikit {maka penuhilah takaran untuk kami dan bersedekahlah kepada kami. Sesungguhnya Allah memberi balasan kepada orang-orang yang bersedekah”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Mereka pun bertolak berangkat. Ketika mereka masuk untuk menjumpai Yusuf, “mereka berkata”, dengan mengiba kepadanya, “Hai al-Aziz, kami dan keluarga kami telah ditimpa kesengsaraan, dan kami datang membawa barang-barang yang tak berharga, maka sempurnakanlah sukatan untuk kami, dan bersedekahlah kepada kami”, maksudnya, kami dan keluarga telah terhimpit kesulitan “dan kami datang membawa barang-barang yang tak berharga”, yaitu pembayaran yang tidak disukai, karena jumlahnya yang sedikit lagi tidak sesuai “maka sempurnakanlah sukatan kami”, meskipun barternya tidak sepadan dan bersedekahlah kepada kami melebihi kadar yang semestinya “sesungguhnya Allah memberi balasan kepada orang-orang yang bersedekah”, dengan balasan di dunia dan di akhirat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِبِضَٰعَةٖ مُّزۡجَىٰةٖ) bibidhaa’atim muzjaah : dengan dirham-dirham yang jelek, tidak ada yang menerimanya karena kualitasnya buruk. (يَجۡزِي ٱلۡمُتَصَدِّقِينَ) yajzil mutashaddiqiin : membalas orang-orang yang bersedekah dengan pahala di dunia dan akhirat. Makna ayat : Mereka pun mengikuti perintah ayah mereka dan pergi ke Mesir dan pergi mendatangi kediaman Al-‘Aziz (فَلَمَّا دَخَلُواْ عَلَيۡهِ قَالُواْ) ketika mereka menemuinya, mereka berkata—seperti yang Allah ta’ala kabarkan tentang mereka—( يَٰٓأَيُّهَا ٱلۡعَزِيزُ مَسَّنَا وَأَهۡلَنَا ٱلضُّرُّ) “Wahai Al-‘Aziz, kami sedang tertimpa kekeringan, paceklik, dan kelaparan (وَجِئۡنَا بِبِضَٰعَةٖ مُّزۡجَىٰةٖ) dan kami datang membawa dirham-dirham yang jelek, tidak diterima—sebagaimana jika ia bagus maka akan diterima—(فَأَوۡفِ لَنَا ٱلۡكَيۡلَ) maka, sempurnakanlah timbangan untuk kami (وَتَصَدَّقۡ عَلَيۡنَآۖ) dan bersedekahlah kepada kami dengan menerima barang bawaan kami yang buruk ini. (إِنَّ ٱللَّهَ يَجۡزِي ٱلۡمُتَصَدِّقِينَ) Sungguh Allah membalas kebaikan mereka dengan yang lebih baik.” Pelajaran dari ayat : • Bolehnya mengadu kepada makhluk dengan alasan menjelaskan keadaan agar terjadi maslahat atau pengobatan, seperti contoh: “Saya lapar atau telanjang.” Atau seorang pasien berkata kepada dokter, “Saya merasa sakit di perut, atau di kepala.” • Keutamaan sedekah dan pahala bagi orang-orang yang bersedekah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 88: Maka mereka pergi ke Mesir untuk mencari berita tentangnya. Sambil berendah diri. Yakni kelaparan. Dengan tidak memperhatikan barang-barang kami yang tidak berharga. Yakni menambah melebihi yang wajib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 88",
    "description": "Anak-anak nabi yakub lalu mempersiapkan diri untuk kembali berangkat ke mesir. Keberangkatan mereka kali ini bukan semata untuk menyelidiki keberadaan nabi yusuf, melainkan juga untuk memperoleh bahan makanan karena saat itu cadangan makanan mereka sudah menipis. Maka setelah menempuh perjalanan yang melelahkan, sampailah mereka di mesir, dan ketika mereka masuk ke tempat nabi yusuf, mereka berkata, wahai al-aziz yang mulia! kami dan keluarga kami di kanaan telah ditimpa kesengsaraan karena paceklik berkepanjangan dan kami datang membawa barang-barang yang tidak berharga untuk ditukar dengan bahan makanan. Hanya itu yang kami miliki, maka kami bermohon, wahai al-aziz yang mulia, penuhilah jatah gandum untuk kami, dan bersedekahlah kepada kami. Sesungguhnya Allah memberi balasan yang berlipat ganda kepada orang yang bersedekah. Nabi yusuf terenyuh mendengar cerita dan melihat kondisi saudarasaudaranya. Dia lalu berkata, tahukah kamu perbuatan buruk apa yang telah kamu perbuat terhadap yusuf dahulu dan saudaranya, bunyamin, karena kamu tidak menyadari akibat perbuatan jahat-Mu itu'."
  }
]