[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tatkala dia mendengar ucapan mereka, hati yusuf iba terhadap mereka, dan memperkenalkan dirinya kepada mereka. Dan dia berkata, ”Apakah kalian ingat tindakan yang kalian lakukan terhadap yusuf dan saudaranya berupa tindakan buruk saat kalian tidak memahami dampak buruk dari apa yang kalian perbuat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Setelah mendengar pernyataan mereka itu Yusuf langsung merasa iba dan kasihan kepada mereka. Lalu dia memperkenalkan dirinya kepada mereka dengan mengatakan, \"Kalian sudah tahu apa yang kalian lakukan terhadap Yusuf dan saudaranya ketika kalian tidak mengetahui akibat dari perbuatan kalian terhadap mereka berdua.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Saat Yusuf melihat keadaan mereka dan mendengar perkataan mereka, dia membalas ucapan mereka seraya memberi olokan: “Apakah kalian inga tapa yang telah kalian lakukan terhadap saudara kalian, Yusuf dan saudara kandungnya saat kalian tidak mengetahui akibat perbuatan kalian itu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. مَّا فَعَلْتُم بِيُوسُفَ وَأَخِيهِ (apa yang telah kamu lakukan terhadap Yusuf dan saudaranya) Yang mereka lakukan terhadap Nabi Yusuf yakni kisah yang telah disebutkan Allah sebelumnya dalam surat ini. Sedangkan yang mereka lakukan terhadap Bunyamin adalah kesedihan yang mereka berikan kepadanya akibat berpisah dari Yusuf serta hinaan dan celaan yang mereka lakukan terhadapnya. Nabi Yusuf tidak menyebutkan apa yang mereka lakukan terhadap ayahnya berupa kesedihan akibat berpisah dengannya, karena ia begitu menghormati dan mengangkat derajatnya. إِذْ أَنتُمْ جٰهِلُونَ (ketika kamu tidak mengetahui) Saat kalian tidak mengetahui perbuatan dosa dan akibatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Setelah melihat kerja keras dan kesukaran mereka, Yusuf menegur mereka: “Apakah kalian ingat dengan apa yang kalian lakukan terhadap Yusuf berupa pukulan, diperjual belikan, direndahkan dan hal lainnya serta apa yang kalian lakukan kepada saudaranya dengan menghinakan dan melecehkannya. Kalian juga memisahkannya dengan saudaranya, ketika kalian tidak mengetahui betapa buruknya akibat perbuatan itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Apakah kalian mengetahui apa yang telah kalian perbuat terhadap Yusuf dan saudaranya karena kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. Ketika permasalahan menjadi genting dan mencapai puncaknya, Yusuf betul-betul merasa iba terhadap mereka, dan memperkenalkan dirinya kepada mereka sambil menegur mereka, “Apakah kamu mengetahui (kejelekan) apa yang telah kamu lakukan terhadap Yusuf dan saudaranya”, adapun tindakan mereka kepada Yusuf, maka sudah jelas. Sedangkan tentang saudaranya, maka boleh jadi (karena) –wallahu a’lam- perkataan mereka,\" , ‘Jika ia mencuri’, sesungguhnya telah pernah mencuri pula saudaranya ini”, (Yusuf:77). Atau, faktor penyebab terpisahnya Bunyamin dari ayahnya dan sumber kejadian itu adalah mereka. “ketika kamu tidak mengetahui (akibat) perbuatanmu itu”, ini semacam bentuk toleransi bagi mereka yang disebabkan oleh tindakan bodoh mereka, atau merupakan upaya menjelek-jelekkan mereka lantaran melakukan perbuatan orang-orang yang bodoh, meskipun perbuatan itu tidak pantas dan tidak layak bagi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِذۡ أَنتُمۡ جَٰهِلُونَ) idz antum jaahiluun : ketika kalian tidak mengetahui akhir keadaan Yusuf. Makna ayat : Masih menceritakan tentang Yusuf dan saudara-saudaranya. Setelah mereka pergi dari Kan’an dan sampai bertemu dengan Yusuf di Mesir—atas perintah ayah mereka—dan mengeluh kepadanya perihal kesulitan hidup yang mereka rasakan, “Kami telah tertimpa kesusahan, dan kami datang dengan membawa barang yang tidak berharga.” Ketika mendengarnya hati Yusuf pun iba dan ia menangis, ia pun berhenti menutup-nutupi tentang siapa sebenarnya dia, lalu berkata, (هَلۡ عَلِمۡتُم مَّا فَعَلۡتُم بِيُوسُفَ وَأَخِيهِ) “Apakah kalian ingat, perlakuan kalian terhadap Yusuf dan saudaranya?” Ia mengingatkan mereka tentang perbuatan mereka, dari melemparkannya ke dalam sumur, menjualnya sebagai budak sehingga ia terpisah dari ayah dan saudaranya. Firman-Nya : (إِذۡ أَنتُمۡ جَٰهِلُونَ) Ketika kalian tidak mengetahui bagaimana Yusuf sekarang. Pelajaran dari ayat : • Bahwa seluruh maksiat yang ada karena ketidaktahuan tentang Allah ta’ala, keagungan-Nya, syariat, janji, dan ancaman-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 89: Yusuf kemudian kasihan kepada mereka, dan mulailah ia membuka tabir; menerangkan keadaan yang sebenarnya. Mencela mereka. Yaitu memukuli, menjual dan sebagainya. Dengan mengurangi haknya atau menzaliminya setelah kepergian Yusuf."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 89",
    "description": "Nabi yusuf terenyuh mendengar cerita dan melihat kondisi saudarasaudaranya. Dia lalu berkata, tahukah kamu perbuatan buruk apa yang telah kamu perbuat terhadap yusuf dahulu dan saudaranya, bunyamin, karena kamu tidak menyadari akibat perbuatan jahat-Mu itu'mereka tersentak mendengar ucapan nabi yusuf. Mereka mulai berpikir apakah pria di hadapan mereka adalah nabi yusuf. Mereka lalu berkata dengan perasaan bersalah bercampur gembira, apakah engkau benar-benar yusuf' dia menjawab dengan ramah, aku yusuf dan ini saudara kandung-ku. Sungguh, Allah yang maha pengasih dan penyayang telah melimpahkan karunia-Nya kepada kami sehingga kami dapat bertemu kembali. Sesungguhnya barang siapa bertakwa dan bersabar, maka sungguh, Allah tidak akan menyia-nyiakan pahala bagi orang yang berbuat baik."
  }
]