[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bunuhlah yusuf atau buanglah dia ke daerah asing lagi jauh dari pemukiman, niscaya cinta ayah kalian dan perhatiannya kepada kalian akan murni menjadi milik kalian, dan dia tidak akan menoleh dari kalian kepada selain kalian, lalu setelah membunuh yusuf atau membuangnya jauh, kalian menjadi orang yang bertaubat kepada Allah, memohon ampunan kepadaNya setelah dosa yang kalian perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Bunuhlah Yusuf! Atau buanglah dia ke tempat yang jauh agar perhatian ayah kalian tercurah kepada kalian, sehingga dia mencintai kalian secara utuh. Dan setelah kalian membunuhnya atau membuangnya kalian bisa menjadi orang-orang yang saleh setelah kalian bertobat dari dosa-dosa kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Mayoritas mereka berkata: “Bunuh saja Yusuf, atau buang dia ke tempat yang tidak dikenal dan jauh dari pandangan manusia; agar rasa cinta ayah kita hanya untuk kita, sehingga dia peduli dan tidak berpaling kepada orang lain. Dan setelah perbuatan itu jadilah orang-orang yang shalih dalam perkara dunia dan agama.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. اقْتُلُوا۟ يُوسُفَ أَوِ اطْرَحُوهُ أَرْضًا (Bunuhlah Yusuf atau buanglah dia kesuatu daerah) Yakni mereka berkata: “lakukanlah kepadanya dengan salah satu cara baik itu membunuhnya atu membuangnya di suatu tempat”. Atau maksudnya adalah sebagian mereka menyarankan agar ia dibunuh, dan sebagian lainnya menyarankan agar ia dibuang. يَخْلُ لَكُمْ وَجْهُ أَبِيكُمْ(supaya perhatian ayahmu tertumpah kepadamu saja) Yakni agar pikiran ayahmu bersih dan jernih dari Yusuf sehingga perhatiannya tertuju kepada kalian dan mencintai kalian dengan seutuhnya. مِنۢ بَعْدِهِۦ (sesudah itu) Yakni setelah selesai membunuhnya atau membuangnya. Pendapat lain mengatakan yakni setelah dosa yang kalian perbuat terhadap Yusuf. قَوْمًا صٰلِحِينَ (orang-orang yang baik) Dalam urusan agama kalian dan ketaatan kepada ayah kalian. Atau orang-orang yang damai dalam urusan dunia kalian sebab kalian telah terbebas dari kedengkian terhadap Yusuf."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Bahkan niat taubat yang sebelumnya mereka nyatakan belum juga terealisasi, mereka belum bertaubat dengan sesungguhnya kecuali tidak tersisa lagi kesempatan untuk memuaskan tekad mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kebanyakan saudara-saudara Yusuf tersebut berkata: “Bunuhlah Yusuf, atau buang dia di tempat yang jauh dari ayah atau tempat yang jauh dari pemukiman, maka perhatian dan cinta ayah akan diberikan kepada kalian. Dan setelah melakukan pembunuhan ini, kalian akan menjadi orang yang shalih dalam urusan agama dan dunia kalian bersama ayah, dengan menjauhkan kegelisahan jiwa, kecemburuan dan kedengkian. Lalu ayah hanya akan memperhatikan kalian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bunuhlah Yusuf atau buanglah dia ke suatu tempat} hilangkanlah dia di tempat yang sangat jauh {agar perhatian Ayah tertumpah} murni dan tertuju {kepada kalian dan setelah itu} setelah selesai membunuh atau membuangnya {kalian akan menjadi kaum yang shalih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “bunuhlah yusuf atau buanglah dia ke suatu daerah (yang tidak dikenal)” yakni, sembunyikan dia dari (jangkauan) ayahnya di daerah yang jauh, yang tidak mungkin terlihat olehnya di tempat itu. Apabila kalian melaksanakan salah satu dari dua rencana ini ”niscaya perhatian ayahmu tertumpah kepadamu saja” yakni, tentulah beliau akan mengarahkan konsentrasinya kepada kalian dan memberikan perhatian kepada kalian dengan penuh kasih dan cinta. karena hatinya sedang sibuk dengan yusuf dengan kesibukan yang mengakibatkan beliau tidak meluangkan diri untuk kalian ”dan sesudah itu hendaknya kalian menjadi” yakni, sesudah perbuat itu, kalian hendaknya menjadi orang orang yang shalih, yakni bertaubat kepada Allah dan meminta ampunan kepadaNya setelah kalian melakukan perbuatan dosa kalian. maka, berniatlah untuk mencanangkan taubat sebelum terjadinya perbuatan dosa untuk memudahkan pelaksanaanya dan menghilangkan unsur keburukannya serta supaya bisa saling memberikan motifasi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَوِ ٱطۡرَحُوهُ أَرۡضٗا) awithrahuuhu ardha : buang ia ke bumi yang jauh, sehingga ia tidak mungkin ditemukan lagi. (يَخۡلُ لَكُمۡ وَجۡهُ أَبِيكُمۡ) yakhlu lakum wajhu abiikum : memalingkan perhatiannya dari Yusuf kepada kalian, lalu tidak memperhatikan selain kalian. Makna ayat : Dan firman-Nya (ٱقۡتُلُواْ يُوسُفَ أَوِ ٱطۡرَحُوهُ أَرۡضٗا يَخۡلُ لَكُمۡ وَجۡهُ أَبِيكُمۡ) Allah menceritakan apa yang saudara-saudara Yusuf rundingkan secara sembunyi-sembunyi agar mereka bisa membereskan saudara mereka itu. (ٱقۡتُلُواْ يُوسُفَ) “Bunuh saja Yusuf (أَوِ ٱطۡرَحُوهُ) atau buang ia ke daerah yang jauh lantas ia binasa, sehingga kalian bisa membereskannya tanpa harus membunuhnya langsung, lalu (يَخۡلُ لَكُمۡ وَجۡهُ أَبِيكُمۡ) kalian akan memperoleh perhatian ayah kalian,—karena dahulu ia sibuk memperhatikan Yusuf—ia mencintai kalian, dan kalian mencintainya, lalu kalian bertaubat kepada Allah setelah menjauhkan Yusuf dari ayahnya, lalu kalian menjadi orang-orang yang saleh karena penyebab kalian berbuat dosa (Yusuf) sudah tidak ada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 9: Menjadi orang yang baik maksudnya, setelah mereka membunuh Yusuf ‘alaihis salam, mereka bertobat kepada Allah serta mengerjakan amal-amal saleh. Mereka dahulukan niat untuk bertobat sebelum munculnya perbuatan itu yang menunjukkan sikap enteng mereka terhadap perbuatan itu, menghilangkan kesan buruknya dan mendorong satu sama lain untuk melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 9",
    "description": "Kemudian di antara mereka berkata kepada sesamanya, bunuhlah yusuf atau buanglah dia ke suatu tempat yang jauh dari kampung halaman kita agar perhatian ayah tertumpah kepadamu tanpa ada yang menghalanginya, dan setelah itu kamu bertobat kepada Allah, karena pintu tobat selalu terbuka, kemudian meminta maaf kepada ayah, sehingga kamu kembali lagi menjadi orang yang baik. Seorang di antara mereka memberi saran dan berkata, janganlah kamu membunuh yusuf, tetapi masukkan saja dia ke dasar sumur agar dia dipungut oleh sebagian musafir yang melewati sumur itu, jika kamu hendak berbuat sesuatu untuk menjauhkan yusuf dengan ayah."
  }
]