[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka bertanya, ”Apakah kamu adalah yusuf?” Dia menjawab, ”Ya, betul. Aku yusuf dan ini saudara kandungku. Sesungguhnya Allah telah melimpahkan karunia kepada kami, dan mempertemukan kami setelah terpisah. Sesungguhnya orang yang bertakwa kepada Alalh dan bersabar menghadapi cobaan-cobaan, maka sesungguhnya Allah tidak akan menghilangkan pahala perbuatan baiknya. Dan sesungguhnya Dia akan memberikan balasan kepadanya dengan balasan terbaik”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Mereka semua terkejut dan bertanya, \"Apakah engkau ini benar-benar Yusuf?!\" Yusuf menjawab, \"Ya. Aku adalah Yusuf. Dan yang kalian lihat bersamaku ini adalah saudara kandungku. Allah telah melimpahkan karunia-Nya kepada kami dengan membebaskan kami dari keadaan kami dan mengangkat derajat kami. Sesungguhnya siapa saja yang bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya, menjauhi larangan-larangan-Nya, dan bersabar terhadap cobaan yang diterimanya, maka perbuatannya itu merupakan amal kebaikan. Dan Allah tidak akan menyia-nyiakan pahala orang-orang yang berbuat kebaikan, melainkan akan menjaganya untuk mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Mereka menjawab dengan tercengang: “Apakah kamu Yusuf!?” Dia menjawab: “Benar, aku Yusuf dan ini adalah saudara kandungku. Allah telah memberi kami kenikmatan sehingga kami dapat bertemu dalam keadaan selamat dan terhormat. Sungguh barangsiapa yang mentaati Allah dalam perintah dan larangan-Nya serta bersabar dalam menghadapi cobaan-Nya, niscaya Allah tidak akan menyia-nyiakan pahala kebaikan perkataan dan perbuatan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. قَالُوٓا۟ أَءِنَّكَ لَأَنتَ يُوسُفُ ۖ (Mereka berkata: “Apakah kamu ini benar-benar Yusuf?”) Mereka mengatakan ini sebagai bentuk keheranan mereka. Dan mereka mengetahui kalau dia adalah Yusuf setelah dia memberitahu mereka. قَالَ أَنَا۠ يُوسُفُ (Yusuf menjawab: “Akulah Yusuf) Seakan-akan ia mengatakan “akulah orang yang dizalimi, yang tidak dihormati dan hendak dibunuh”. وَهٰذَآ أَخِى ۖ (dan ini saudaraku) Yang terzalimi sepertiku. قَدْ مَنَّ اللهُ عَلَيْنَآ ۖ (Sesungguhnya Allah telah melimpahkan karunia-Nya kepada kami) Dengan keikhlasan dan derajat yang tinggi. Nabi Yusuf mengakui karunia Allah yang begitu besar yang diberikan kepadanya dan kepada saudaranya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Dengan mengingat aksen suara dan apa yang diucapkan di ayat sebelumnya, secara terkejut mereka berkata: “Apa benar dirimu Yusuf?” Yusuf menjawab: “Benar, aku Yusuf. Dan ini adalah saudara kandungku Benyamin. Sungguh Allah mengistimewakan dan memberi nikmat kami dengan kebersamaan, keselamatan dan kemuliaan. Sesungguhnya dia adalah orang yang takut kepada Allah dan bersabar atas cobaan dan musibah. Sesungguhnya Allah tidak melemahkan pahala orang-orang baik yang bertakwa dan bersabar, namun membalas mereka dengan sebaik-baik balasan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah kamu benar-benar Yusuf?” Dia menjawab, “Aku Yusuf dan ini saudaraku. Sungguh Allah telah melimpahkan nikmat} memberikan nikmat {kepada kami. Siapa saja yang bertakwa dan bersabar, sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. Mereka menyadari bahwa orang yang berbicara dengan mereka adalah Yusuf. Lantas mereka bertanya-tanya, “Apakah kamu ini benar-benar Yusuf.” Yusuf menjawab, “Akulah Yusuf dan ini saudaraku. Sesungguhnya Allah telah melimpahkan karuniaNya kepada kami”, dengan keimanan, ketakwaan, memegang kekuasaan di dunia. Karunia itu disebabkan oleh kesabaran dan ketakwaan. “Sesungguhnya barangsiapa yang bertakwa dan bersabar”, yakni menjaga diri dari perbuatan yang diharamkan oleh Allah dan bersabar terhadap hal-hal yang menyakitkan dan musibah-musibah serta bersabar atas perintah-perintah Allah dan dalam menaatinya. “maka sesungguhnya Allah tidak menyia-nyiakan pahala orang yang berbuat baik”, ini termasuk sifat perbuatan ihsan, dan Allah tidak menyia-nyiakan pahala orang yang telah berbuat kebaikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (قَدۡ مَنَّ ٱللَّهُ عَلَيۡنَآۖ) qad mannallahu ‘alainaa : telah memberikan kami nikmat dengan mengumpulkan kita kembali setelah perpisahan yang lama yang kalian sebabkan. (مَن يَتَّقِ وَيَصۡبِرۡ) may yatqi wa yashbir : bertakwa kepada Allah, takut dan tidak bermaksiat kepadanya, serta bersabar dari segala kesusahan. Makna ayat : Mereka pun berkata dengan terkejut dan kaget, (أَءِنَّكَ لَأَنتَ يُوسُفُۖ) “Apakah engkau adalah Yusuf?” Kemudian ia menjawab sebagaimana yang Allah firmankan, (قَالَ أَنَا۠ يُوسُفُ وَهَٰذَآ أَخِيۖ قَدۡ مَنَّ ٱللَّهُ عَلَيۡنَآۖ) “Aku adalah Yusuf dan ini adalah saudaraku, sungguh Allah telah memberikan kita kenikmatan bisa berkumpul kembali dalam keadaan yang paling baik.” Kemudian berkata, (إِنَّهُۥ مَن يَتَّقِ وَيَصۡبِرۡ) sesungguhnya orang yang bertakwa kepada Allah, takut kepada-Nya, sehingga ia melaksanakan perintah-Nya dan menjauhi larangan-Nya serta bersabar atas keduanya dan atas cobaan dan ujian (فَإِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ) maka Allah tidak akan menyia-nyiakan pahala orang-orang yang berbuat kebaikan dengan taat kepada Rabb mereka dan menyerahkan diri kepada-Nya secara lahir dan batin. Pelajaran dari ayat : • Keutamaan takwa dan sabar, dan apa yang kedua hal ini hasilkan berupa akhir yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 90: Setelah mereka mengenalinya berdasarkan kepribadiannya yang nampak sambil berusaha memastikan. Dengan iman dan takwa serta kekuasaan di bumi serta mengumpulkan kami. Yang demikian merupakan buah dari ketakwaan dan kesabaran. Terhadap hal yang menimpanya. Karena hal itu termasuk ihsan, sedangkan Allah tidak akan menyia-nyiakan pahala orang yang berbuat ihsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 90",
    "description": "Mereka tersentak mendengar ucapan nabi yusuf. Mereka mulai berpikir apakah pria di hadapan mereka adalah nabi yusuf. Mereka lalu berkata dengan perasaan bersalah bercampur gembira, apakah engkau benar-benar yusuf' dia menjawab dengan ramah, aku yusuf dan ini saudara kandung-ku. Sungguh, Allah yang maha pengasih dan penyayang telah melimpahkan karunia-Nya kepada kami sehingga kami dapat bertemu kembali. Sesungguhnya barang siapa bertakwa dan bersabar, maka sungguh, Allah tidak akan menyia-nyiakan pahala bagi orang yang berbuat baik. Mendapati kenyataan yang tidak terduga itu, mereka lalu berkata, demi Allah, sungguh Allah yang mahakuasa telah melebihkan engkau di atas kami dalam ketakwaan, kekayaan, kekuasaan, kedudukan sosial, dan ketampanan; dan sesungguhnya kami adalah orang yang telah bersalah dan berbuat dosa."
  }
]