[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, ”Demi Allah, sesungguhnya Allah telah mengutamakanmu di atas kami, dan memuliakanmu dengan ilmu, kesantunan dan keutamaan. Dan sesungguhnya kami benar-benar orang-orang yang berbuat kesalahan, melalui tindakan yang kami perbuat dengan sengaja terhadap dirimu dan saudaramu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Saudara-saudara Yusuf meminta maaf atas apa yang telah mereka perbuat terhadapnya dengan mengatakan, \"Demi Allah, engkau telah dikaruniai Allah kelebihan atas kami dengan memberimu sifat-sifat kesempurnaan. Dan kami telah berbuat jahat dan semena-mena kepadamu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Maka mereka bersumpah kepada Allah: “Sungguh kalian telah dilebihkan atas kami, dan kami dahulu adalah orang-orang yang berdosa akibat perbuatan kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. قَالُوا۟ تَاللهِ لَقَدْ ءَاثَرَكَ اللهُ عَلَيْنَا (Mereka berkata: “Demi Allah, sesungguhnya Allah telah melebihkan kamu atas kami) Yakni Allah telah memilihmu dan melebihkanmu atas kami dengan sifat-sifat kesempurnaan yang diistimewakan untukmu. وَإِن كُنَّا لَخٰطِـِٔينَ(dan sesungguhnya kami adalah orang-orang yang bersalah) Mereka mengatakan ini untuk memimta maaf. Makna (الخاطئ) yakni orang yang sengaja melakukan apa yang seharusnya tidak boleh dilakukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara hal aneh yang dari ulah para pendengki adalah : mereka selalu menjadi sebab naiknya tahta orang yang mereka benci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Mereka berkata kepadanya: “Demi Allah, sungguh Dia telah memilihmu dan mengistemawakanmu atas kami. Faktanya, kami adalah orang-orang yang berdosa atas apa yang telah kami perbuat terhadapmu dan bersalah atas perlakuan kami.” Al khoti’ adalah rasa bersalah yang berdasar pada suatu dosa, dan mukhthi’ adalah orang yang menghendaki kebenaran, lalu dia melanggarnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Demi Allah, Allah benar-benar telah melebihkanmu} melebihkanmu {di atas kami dan sesungguhnya kami benar-benar orang-orang yang bersalah”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. “Mereka berkata, ‘Demi Allah, sesungguhnya Allah telah melebihkan kamu atas kami’,” maksudnya, Allah telah mengutamakanmu daripada kami dengan budi pekerti yang mulia serta perilaku yang baik, padahal kami telah melakukan perbuatan terburuk pada dirimu dan berapi-api untuk melancarkan gangguan kepadamu, dan menjauhkanmu dari ayah. Ternyata Allah melebihkanmu dan menempatkanmu pada kedudukan yang engkau inginkan ( dan sesungguhnya kami adalah orang-orang yang bersalah (berdosa): ini adalah pengakuan yang mendalam dari mereka atas perbuatan jahat yang berasal dari mereka terhadap Yusuf)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَقَدۡ ءَاثَرَكَ ٱللَّهُ عَلَيۡنَا) laqad aatsarakallahu ‘alainaa : Allah telah melebihkan engkau dari kami dengan nikmat dan kesempurnaan-Nya. Makna ayat : Lalu mereka berkata, sesuai dengan yang Allah firmankan, (قَالُواْ تَٱللَّهِ لَقَدۡ ءَاثَرَكَ ٱللَّهُ عَلَيۡنَا) Mereka berkata, “Sungguh Allah telah melebihkan kalian atas kami,” dengan ilmu, amal, dan keutamaan (وَإِن كُنَّا لَخَٰطِ‍ِٔينَ) dan sungguh kami adalah orang-orang yang bersalah, karena telah melakukan hal tersebut kepadamu. Ini adalah taubat dari mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 91: Dengan kekuasaan, akhlak yang mulia dan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 91",
    "description": "Mendapati kenyataan yang tidak terduga itu, mereka lalu berkata, demi Allah, sungguh Allah yang mahakuasa telah melebihkan engkau di atas kami dalam ketakwaan, kekayaan, kekuasaan, kedudukan sosial, dan ketampanan; dan sesungguhnya kami adalah orang yang telah bersalah dan berbuat dosa. Dia (nabi yusuf ) berusaha membesarkan hati saudara-saudaranya. Ia berkata, pada hari ini tidak ada cercaan, kecaman, dan pembalasan dendam dariku terhadap kamu, dan aku berdoa mudah-Mudahan Allah mengampuni dosa-dosa kamu. Dan dia maha penyayang di antara para penyayang, lebih-lebih terhadap orang-orang yang menyesal dan mau bertobat."
  }
]