[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yusuf berkata kepada mereka, ”Tidak ada celaan lagi bagi kalian hari ini. Semoga Allah mengampuni kalian. Dan Dia sebaik-baik Dzat yang menyayangi bagi orang-orang yang bertaubat dari dosanya dan kembali menuju ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Yusuf menerima permintaan maaf mereka dan berkata, \"Hari ini tidak ada celaan terhadap kalian yang membuat kalian harus dihukum atau dikecam. Aku memohon kepada Allah agar berkenan mengampuni kalian. Dan Dia -Subḥānahu- adalah Zat Maha Penyayang di antara para penyayang.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92-93. Yusuf berkata dengan lapang dada: “Tidak ada olokan bagi kalian pada hari ini. Aku berdoa kepada Allah agar mengampuni kalian atas dosa-dosa kalian, Dia sangat pengasih kepada orang yang bertaubat dari dosanya.” Ketika Yusuf mengetahui ayahnya kehilangan penglihatan, dia berkata kepada mereka: “Bawalah bajuku ini, dan letakkanlah pada wajah ayahku, Ya’qub, agar penglihatannya dapat kembali. Kemudian bawalah kepadaku keluarga kalian semua.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. قَالَ لَا تَثْرِيبَ عَلَيْكُمُ (Dia (Yusuf) berkata: “Pada hari ini tak ada cercaan terhadap kamu) Yakni tidak ada celaan dan cercaan atas kalian, dan aku telah memaafkan dan memaklumi kesalahan kalian setelah kalian mengakui kesalahan itu. Kemudian Nabi Yusuf mendoakan mereka dengan mengatakan: يَغْفِرُ اللهُ لَكُمْ(mudah-mudahan Allah mengampuni kalian)"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ ۖ يَغْفِرُ اللَّهُ لَكُمْ } \"Pada hari ini tak ada cercaan terhadap kamu, mudah-mudahan Allah mengampuni (kamu)\" , { وَلْيَعْفُوا وَلْيَصْفَحُوا } \"dan hendaklah mereka memaafkan dan berlapang dada\" [ An-Nur : 22 ] kebaikan seseorang kepada orang yang telah berbuat jahat kepadanya adalah kemuliaan baginya, sebagaimana sang pencipta senantiasa berbuat baik kepada hamba-hamba Nya yang berbuat keji. 2 ). Rasa takjub terus meningkat bagi mereka yang membaca surah Yusuf, dan melihat bagaimana kelakuan saudara-saudara Yusuf kepada saudaranya sendiri yang memisahkannya dari ayahnya, dan segala kekejian dan kejahatan oleh ulah mereka : membuang Yusuf ke sumur, menjualnya kepada orang lain sebagai budak, hingga tuduhan keji sebagai pencuri. Namun setelah semuanya berlalu perhatikan bagaimana sikap Yusuf yang indah kepada saudara-saudaranya itu : { لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ ۖ يَغْفِرُ اللَّهُ لَكُمْ } \"Pada hari ini tak ada cercaan terhadap kamu, mudah-mudahan Allah mengampuni (kamu)\" bukankah ini adalah kejadian yang begitu indah dan menyenangkan bagi mereka ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Yusuf berkata: “Tidak ada cercaan, celaan dan cacian atas kalian pada hari ini. Aku telah memaafkan kalian karena telah mengakui dosa. Semoga Allah mengampuni dosa kalian. Allah SWT adalah Dzat yang Maha Pengasih bagi orang yang bertaubat dan berserah diri, Dia juga mengampuni dosa-dosa kecil dan dosa-dosa besar.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berdosa karena perbuatan kami terhadapmu {Dia berkata,“Tidak ada cercaan} tidak ada ejekan, celaan, dan kecaman {terhadap kalian hari ini, semoga Allah mengampuni kalian. Dia Maha Penyayang di antara para penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. Maka Yusuf menjawab mereka dengan kemuliaan dan kemurahan hatinya, “Pada hari ini tak ada cercaan terhadap kamu”, maksudnya aku tidak memaki dan tidak pula mencela kalian “mudah-mudahan Allah mengampuni kamu, dan Dia Maha Penyayang di antara para penyayang”, Yusuf memaafkan mereka dengan sepenuhnya tanpa disertai mendiskreditkan mereka dengan menyebutkan kejahatan yang pernah mereka perbuat. Ia memohon ampunan dan rahmat bagi mereka. Ini adalah puncak sifat kebaikan yang tidak akan muncul kecuali dari orang-orang istimewa dan orang-orang terpilih dari kalangan orang-orang pilihan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَا تَثۡرِيبَ عَلَيۡكُمُ ٱلۡيَوۡمَۖ) laa tatsriiba ‘alaikumul yaum : tidak ada celaan atas kalian. Makna ayat : Kemudian Yusuf berkata kepada mereka, (لَا تَثۡرِيبَ عَلَيۡكُمُ ٱلۡيَوۡمَۖ) “Tidak ada celaan, ejekan, tidak pula menyebut-nyebut kesalahan kalian, karena itu menyakitiku,” (يَغۡفِرُ ٱللَّهُ لَكُمۡۖ وَهُوَ أَرۡحَمُ ٱلرَّٰحِمِينَ) kemudian ia berdoa kepada Allah untuk mengampuni mereka, dan memuji Allah bahwa Dia adalah Yang Maha Penyayang mengharapkan rahmat-Nya ta’ala baginya dan saudara-saudara-Nya. Setelah itu ia bertanya tentang ayahnya, merekapun menjawab bahwa ia telah buta karena sedih, (ٱذۡهَبُواْ بِقَمِيصِي هَٰذَا فَأَلۡقُوهُ عَلَىٰ وَجۡهِ أَبِي يَأۡتِ بَصِيرٗا) “Bawalah bajuku dan dan usapkan di wajahnya, niscaya pengelihatannya kan kembali seperti semula (وَأۡتُونِي بِأَهۡلِكُمۡ أَجۡمَعِينَ) dan bawa seluruh keluarga kalian, kedua orang tuanya, para wanita, anak-anak, dan cucu-cucu. Perpindahan total keluarga yang mulia ini dari Kan’an menuju Mesir, merupakan rencana Allah Yang Maha Perkasa lagi Maha Bijaksana. Pelajaran dari ayat : • Keutamaan melupakan dan memaafkan kesalahan dan tidak mencela orang terdekat ketika ia berbuat salah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 92: Yang menunjukkan sifat hilm(santun)nya. Hal ini merupakan sifat ihsan yang sangat tinggi, Beliau memaafkan mereka, tidak mencela, dan mendoakan ampunan dan rahmat untuk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 92",
    "description": "Dia (nabi yusuf ) berusaha membesarkan hati saudara-saudaranya. Ia berkata, pada hari ini tidak ada cercaan, kecaman, dan pembalasan dendam dariku terhadap kamu, dan aku berdoa mudah-Mudahan Allah mengampuni dosa-dosa kamu. Dan dia maha penyayang di antara para penyayang, lebih-lebih terhadap orang-orang yang menyesal dan mau bertobat. Berhasil menenangkan hati saudara-saudaranya, nabi yusuf lalu meminta mereka segera menemui ayah mereka di kanaan, pergilah kamu dengan membawa bajuku ini, dan jangan ada yang tinggal seorang pun agar ayah kita tidak curiga lagi, dan begitu kamu sampai di kanaan, usapkan bajuku ini ke wajah ayahku, nanti dia akan sembuh dan dapat melihat kembali seperti sedia kala; dan kembalilah lagi ke mesir bersama ayah kita dan bawalah seluruh keluargamu kepadaku; jangan ada seorang pun yang tertinggal."
  }
]