[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika yusuf bertanya kepada mereka tentang ayah mereka, mereka mengabarkan perihal telah rusaknya penglihatan matanya akibat menangisinya. Lalu dia berkata kepada mereka, ”kembalilah kalian kepada ayah kalian, dengan membawa pakaianku ini, lalu tutupkanlah pada wajah ayahku, niscaya penglihatnnya akan kembali normal. Kemudian bawalah kepadaku seluruh keluarga kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Tatkala mereka memberitahu Yusuf tentang kondisi penglihatan ayahnya, dia memberikan bajunya kepada mereka dan berkata, \"Bawalah bajuku ini dan usapkanlah di wajah ayahku, niscaya penglihatannya akan pulih kembali. Dan bawalah seluruh keluarga kalian kepadaku.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. يَأْتِ بَصِيرًا (nanti ia akan melihat kembali) Ia akan sembuh dari kebutaan. وَأْتُونِى بِأَهْلِكُمْ أَجْمَعِينَ (dan bawalah keluargamu semuanya kepadaku) Istri-istri dan keturunan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Karena setiap penyakit diobati dengan sesuatu yang berlawanan dengannya, begitu halnya dengan baju yang ada dalam ayat ini, baju yang tercium darinya aroma khas dari tubuh Yusuf yang menjadikan kesedihan dan kerinduan ayahnya menjadi surut atas izin Allah (Yusuf bermaksud untuk menciumkan baju itu kepada ayahnya); sehingga jiwanya kembali tenang, dan semua kebahagiaannya pun kembali berdatangan, sampai akhirnya penglihatannya kembali normal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Pulanglah kalian dengan membawa baju milikku ini, lalu letakkan di wajah ayahku Ya’kub. Ketika beliau mencium aromaku, niscaya penglihatannya akan kembali. Kemudian kembalilah kalian semua kepadaku dengan sluruh keluarga kalian tanpa terkecuali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pergilah dengan membawa bajuku ini, lalu usapkan ke wajah ayahku, dia akan bisa} bisa {melihat; dan bawalah seluruh keluarga kalian kepadaku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. Yusuf berkata kepada para saudaranya, “Pergilah kamu dengan membawa baju gamisku ini, lalu letakkanlah ia ke wajah ayahku, nanti dia akan dapat melihat kembali”, karena setiap penyakit dapat disembuhkan dengan penangkalnya. Baju ini –karena di dalamnya terdapat aroma (tubuh) Yusuf yang mana dia telah memasukkan kesedihan dan kerinduan di hati ayahnya yang mana hanya Allah-lah yang Maha Mengetahui- maka Yusuf ingin agar ayahnya mencium aromanya, hingga semangat kembali dan jiwanya pun tergugah serta penglihatannya menjadi normal. Bagi Allah ada sejumlah hikmah dan rahasia illahi dalam kejadian ini yang tidak dapat dideteksi oleh manusia. Sementara Yusuf sanggup mengetahuinya dari kejadian tersebut. “Dan bawalah keluargamu semuanya kepadaku”, anak-anak kalian, keluarga kalian serta orang-orang yang ikut dengan kalian, agar terwujud pertemuan yang menyeluruh serta lenyap dari kalian kesulitan hidup dan kesempitan rizki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 93: Kemudian Yusuf bertanya kepada mereka tentang keadaan bapaknya, lalu mereka menerangkan bahwa kedua matanya telah buta. Maka Yusuf berkata seperti yang disebutkan dalam ayat di atas. Pada baju Yusuf terdapat keharuman bekas diri Yusuf, diharapkan dengan dicium oleh bapaknya yang sangat sedih dan rindu bertemu Yusuf, kesegarannya kembali, jiwanya bergembira, sehingga penglihatannya pun pulih kembali. Allah memiliki hikmah dan rahasia dalam hal itu yang tidak diketahui oleh kebanyakan manusia. Ada pula yang berpendapat, bahwa hal itu merupakan mukjizat yang diberikan Allah Ta’ala kepada Nabi Yusuf ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 93",
    "description": "Berhasil menenangkan hati saudara-saudaranya, nabi yusuf lalu meminta mereka segera menemui ayah mereka di kanaan, pergilah kamu dengan membawa bajuku ini, dan jangan ada yang tinggal seorang pun agar ayah kita tidak curiga lagi, dan begitu kamu sampai di kanaan, usapkan bajuku ini ke wajah ayahku, nanti dia akan sembuh dan dapat melihat kembali seperti sedia kala; dan kembalilah lagi ke mesir bersama ayah kita dan bawalah seluruh keluargamu kepadaku; jangan ada seorang pun yang tertinggal. Saudara-saudara nabi yusuf mengikuti perintahnya. Mereka mempersiapkan diri untuk kembali ke kanaan. Dan demikianlah, ketika kafilah itu telah keluar dari mesir, ayah mereka yang berada jauh di kanaan berkata kepada para menantu dan cucunya yang tinggal bersamanya di kanaan, sesungguhnya aku mencium bau yusuf. Sekiranya kamu semua tidak menuduhku sudah pikun atau lemah akal, tentu kamu akan membenarkanku."
  }
]