[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika kafilah itu telah keluar dari negeri mesir dengan membawa pakaiannya, ya’qub berkata kepada orang-orang yang bersamanya, ”sesungguhnya aku benar-benar mencium aroma yusuf, sekiranya kalian tidak menganggapku bodoh dan mgolok-oloku, dan kalian menduga bahwa perkataan ini muncul dariku di luar kesadaranku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Dan ketika rombongan saudara-saudara Yusuf keluar dari negeri Mesir dan meninggalkan pemukiman penduduknya, Ya'qūb berkata kepada anak-anaknya dan orang-orang yang ada di sekitarnya di kampung halamannya, \"Sesungguhnya aku benar-benar mencium aroma Yusuf, sekiranya kalian tidak menganggapku bodoh dan pikun dengan ucapan kalian, 'Orang tua ini sudah pikun. Dia mengatakan sesuatu tanpa sadar'.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Ketika kafilah mereka meninggalkan negeri Mesir dengan membawa baju Yusuf, Ya’qub berkata kepada orang-orang yang berada di sekitarnya: “Aku mencium aroma Yusuf, sekiranya kalian tidak menuduhku kurang akal dan sedang berkhayal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. وَلَمَّا فَصَلَتِ الْعِيرُ (Tatkala kafilah itu telah ke luar (dari negeri Mesir)) Yakni setelah kafilah meninggalakan negeri Mesir menuju negeri Syam. قَالَ أَبُوهُمْ(berkata ayah mereka) Yakni Nabi Ya’qub berkata kepada keluarganya yang ada di negeri Kan’an. إِنِّى لَأَجِدُ رِيحَ يُوسُفَ ۖ( Sesungguhnya aku mencium bau Yusuf) Yakni aroma badan Yusuf. لَوْلَآ أَن تُفَنِّدُونِ(sekiranya kamu tidak menuduhku lemah akal) Seandainya kalian tidak menganggapku telah lemah akal karena umur yang sudah tua."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayah mereka benar ketika ia mengatakan : { إِنِّي لَأَجِدُ رِيحَ يُوسُفَ } \"Sesungguhnya aku mencium bau Yusuf\" , sedangkan mereka saudara-saudara Yusuf telah berbuat salah tatkala mereka megatakan : { تَاللَّهِ إِنَّكَ لَفِي ضَلَالِكَ الْقَدِيمِ } \"Demi Allah, sesungguhnya kamu masih dalam kekeliruanmu yang dahulu\" ; dari kisah ini setiap orang mesti mengambil pelajaran bagaimana ia memperbaiki kata-kaanya sebelum diucapkan kepada ayahnya, dan senantiasa menghormati ucapannya yang terkadang mengatakan sesuatu yang benar namun kita tidak memahaminya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Ketika kafilah itu telah keluar dan meninggalkan tanah Mesir menuju Syam, Ya’kub berkata kepada orang di sekitarnya: “Aku mencium dan merasakan aroma Yusuf, sekiranya kamu tidak menuduhku salah, atau pendapat yang salah dan pemikiran yang lemah, dan menuduhku pikun: yaitu lupa ingatan karena ketuaan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika kafilah itu telah keluar} kafilah itu keluar pergi dari Mesir menuju Syam {ayah mereka berkata,“Sesungguhnya aku mencium bau Yusuf} aku mencium bau Yusuf {seandainya kalian tidak menuduhku lemah akal”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. “Tatkala kafilah itu telah keluar”, dari negeri Mesir mengarah ke negeri Palestina, Ya’qub telah mencuim aroma baju Yusuf. Beliau berkata, “Sesungguhnya aku mencium bau Yusuf, sekiranya kamu tidak menuduhku lemah akal (tentu kamu membenarkan aku)”, maksudnya mengolok-olok diriku dan kalian mengklaim bahwa ucapan ini muncul dari diriku tanpa kesadaran. Karena beliau melihat mereka begitu terheran-heran dengan kondisinya hingga menyebabkan munculnya perkataan itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَلَمَّا فَصَلَتِ ٱلۡعِيرُ) walammaa fashalatil ‘iiru : ketika kabilah keluar dari daerah Mesir menuju Palestina. (إِنِّي لَأَجِدُ رِيحَ يُوسُفَۖ) innii la’ajidu riiha yuusuf : aku mencium wangi Yusuf, karena angin membawa aromanya kepadanya atas izin Allah ta’ala. (لَوۡلَآ أَن تُفَنِّدُونِ) laulaa an tufanniduun : jika kalian tidak menganggapku bodoh, niscaya kalian akan mempercayai aku, aku benar-benar mencium aroma Yusuf. Makna ayat : Ini akhir dari kisah Yusuf ‘alaihi salam. Setelah ia mengirim bajunya kepada sang ayah yang dibawa oleh Yahuda bersama dengan kabilah yang mengarah pulang menuju Kan’an, ketika kabilah itu bertolak dari perbatasan Mesir, angin timur membawa wangi Yusuf kepada ayahnya, ia berkata, (إِنِّي لَأَجِدُ رِيحَ يُوسُفَۖ لَوۡلَآ أَن تُفَنِّدُونِ) “Jika saja kalian tidak menganggapku bodoh, karena aku benar-benar mencium wanginya.” Maka keluarga yang ada di sekitarnya berkata—mereka tidak tahu perihal Yusuf di Mesir—( إِنَّكَ لَفِي ضَلَٰلِكَ ٱلۡقَدِيمِ) kekeliruanmu dengan berlebihan dan menyayangi Yusuf. Pelajaran dari ayat : • Mukjizat yang besar, angin bertiup dalam jarak yang jauh membawa aroma Yusuf."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 94: Menuju Palestina. Kepada anak yang hadir dan cucu-cucunya. Dengan izin Allah Subhaanahu wa Ta'aala angin timur telah menerbangkan bau Yusuf kepada Ya’kub sebelum datang orang yang membawa kabar gembira."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 94",
    "description": "Saudara-saudara nabi yusuf mengikuti perintahnya. Mereka mempersiapkan diri untuk kembali ke kanaan. Dan demikianlah, ketika kafilah itu telah keluar dari mesir, ayah mereka yang berada jauh di kanaan berkata kepada para menantu dan cucunya yang tinggal bersamanya di kanaan, sesungguhnya aku mencium bau yusuf. Sekiranya kamu semua tidak menuduhku sudah pikun atau lemah akal, tentu kamu akan membenarkanku. Menanggapi ucapan nabi yakub yang selalu menyebut-nyebut nabi yusuf, mereka dengan kesal berkata, demi Allah, sesungguhnya engkau masih dalam kekeliruanmu yang dahulu karena engkau tetap saja mengira yusuf masih hidup."
  }
]