[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang bersamanya berkata, ”Demi Allah, engkau masih dalam kesalahan lamamu, yaitu mencintai yusuf dan tidak melupakannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Salah seorang anaknya yang ada di sisinya berkata, \"Demi Allah, sesungguhnya engkau masih berada dalam ilusimu yang dulu tentang kedudukan Yusuf di sisimu dan kemungkinan untuk bertemu kembali dengannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Maka mereka menganggapinya dengan keras dan menganggap itu hal yang mustahil: “Demi Allah, kamu masih tetap saja dalam kesalahan lamamu karena masih percaya bahwa Yusuf masih hidup dan kamu yakin akan bertemu lagi dengannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. قَالُوا۟ تَاللهِ إِنَّكَ لَفِى ضَلٰلِكَ الْقَدِيمِ (mereka berkata: “Demi Allah, sesungguhnya kamu masih dalam kekeliruanmu yang dahulu”) Yakni keluarga yang bersamanya berkata: “wahai Ya’qub, kamu benar-benar tetap dalam kesalahanmu dahulu, yakni terlalu mencintai Yusuf yang tidak dapat kamu lupakan, dan kamu tetap mengira bahwa ia masih hidup dan berharap dapat kembali kepadamu, padahal ia telah dimakan srigala sejak lama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Orang-orang sekitarnya berkata: “Demi Allah, sesungguhnya kamu masih dalam kekeliruanmu yang lalu dengan mencintainya secara berlebihan dan berangan-angan menemuinya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Menganggapku bodoh dan mengiraku lemah akal {Mereka berkata,“Demi Allah, sesungguhnya kamu benar-benar dalam kekeliruanmu yang dahulu”} kesalahanmu yang lalu dengan yang berlebihan mencintai Yusuf dan berharap bertemu dengannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Maka terjadilah apa yang beliau perkirakan pada mereka, lalu keluargannya berkata, “Demi Allah, sesungguhnya kamu masih dalam kekeliruanmu yang dahulu”, maksudnya engkau masih saja bingung di laut yang bergelombang, tidak sadar apa yang engkau ucapkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 95: Karena cintamu yang berlebihan kepadanya dan harapanmu akan bertemu dengannya setelah sekian lama sehingga engkau tidak menyadari apa yang engkau ucapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 95",
    "description": "Menanggapi ucapan nabi yakub yang selalu menyebut-nyebut nabi yusuf, mereka dengan kesal berkata, demi Allah, sesungguhnya engkau masih dalam kekeliruanmu yang dahulu karena engkau tetap saja mengira yusuf masih hidup. Sekian waktu berlalu, dan kafilah anak-anak nabi yakub pun sampai di kanaan. Maka ketika benar-benar telah tiba pembawa kabar gembira itu, yakni salah seorang dari anak-anak nabi yakub yang membawa baju nabi yusuf, maka diusapkannya baju itu ke wajahnya (nabi yakub), lalu seketika itu dia dapat melihat kembali seperti sedia kala. Dia berkata kepada keluarganya yang tetap tidak memercayai perkataannya, bukankah telah aku katakan kepadamu tadi, bahwa aku mencium bau yusuf. Aku yakin yusuf masih hidup karena aku mengetahui dari Allah apa yang tidak kamu ketahui."
  }
]