[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian ketika orang yang yang membawa kabar gembira datang kepada ya’qub bahwa yusuf masih hidup, lalu menutupkan pakaian yusuf di wajahnya, kembalilah ya’qub dapat melihat lagi, dan kebahagiaan meliputi dirinya. Kemudian dia berkata kepada orang-orang yang ada di sisinya, ”bukankah aku telah mengabarkan kepada kalian bahwa sesungguhnya aku mengetahui dari Allah apa-apa yang kalian tidak ketahui, berupa karunia Allah, rahmat, dan kemurahanNYa?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Kemudian tatkala si pembawa berita gembira datang kepada Ya'qūb, dia langsung mengusapkan baju Yusuf ke wajahnya, dan seketika itu juga dia dapat melihat kembali. Ketika itulah Ya'qūb berkata kepada anak-anaknya, \"Bukankah sudah kukatakan kepada kalian bahwa aku mengetahui kasih sayang dan kebaikan Allah yang tidak kalian ketahui?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Namun perkiraan Ya’qub menjadi kenyataan ketika datang seorang pembawa kabar gembira dengan membawa baju Yusuf, dia mengabarkan keselamatan Yusuf dan meletakkan bajunya pada wajah Ya’qub sehingga dia dapat melihat kembali karena sangat bahagia; kemudian dia berkata kepada orang-orang yang ada di sekelilingnya: “Bukankah aku telah berkata kepada kalian, bahwa aku mencium aroma Yusuf, dan aku mengetahui dari Allah apa yang tidak kalian ketahui?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. فَلَمَّآ أَن جَآءَ الْبَشِيرُ (Tatkala telah tiba pembawa kabar gembira itu) Yakni datang orang yang membawa kabar gembira bagi ayah mereka. أَلْقَىٰهُ عَلَىٰ وَجْهِهِۦ (maka diletakkannya baju gamis itu ke wajah Ya’qub) Yakni pembawa kabar gembira itu meletakkan baju Yusuf di wajah Ya’qub. فَارْتَدَّ بَصِيرًا (lalu kembalilah dia dapat melihat) Yakni penglihatannya kembali sehat. قالَ أَلَمْ أَقُل لَّكُمْ إِنِّىٓ أَعْلَمُ مِنَ اللهِ مَا لَا تَعْلَمُونَ (Berkata Ya’qub: “Tidakkah aku katakan kepadamu, bahwa aku mengetahui dari Allah apa yang kamu tidak mengetahuinya”) Ia mengatakan ini agar mengingatkan mereka perkataannya yang dahulu ia ucapkan, yaitu: إِنَّمَآ أَشْكُوا۟ بَثِّى وحزني إلى الله وَأَعْلَمُ مِنَ اللهِ مَا لَا تَعْلَمُونَ “Sesungguhnya hanyalah kepada Allah aku mengadukan kesusahan dan kesedihanku. dan aku mengetahui dari Allah apa yang tidak kalian ketahui.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Ketika pembawa kabar gembira yaitu Yahudza datang dari Mesir untuk membawa baju Yusuf dan memberi kabar tentang keselamatan Yusuf dan saudaranya, Dia meletakkan baju tersebut di wajah Ya’kub, lalu dia kembali bisa melihat karena sangat bahagia. Ketika itu, Ya’kub berkata kepada anak-anaknya: “Bukankah aku pernah berkata kepada kalian: ”Aku mencium aroma Yusuf, dan aku mengetahui sesuatu yang tidak kalian ketahui dari Allah, yaitu apa yang aku ucapkan sebelumnya {Innama Asyku batsi wa huzni ilallah wa a’lamu minallahi maa laa ta’lamun} [86]. Allah akan mengembalikan Yusuf dan saudaranya kepadaku sehingga semuanya bisa berkumpul.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika telah tiba pembawa kabar gembira itu} pembawa kabar gembiran tentang Yusuf {diusapkan ke wajahnya, lalu dia kembali} kembali {dapat melihat. Dia berkata,“Bukankah aku telah mengatakan kepada kalian sesungguhnya aku mengetahui dari Allah apa yang tidak kalian ketahui”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. “Tatkala telah tiba pembawa kabar gembira itu”, dekat dengan waktu berkumpulnya Yusuf, saudara-saudara dan ayah mereka “maka ia meletakannya”, baju gamis itu “ke wajah Ya’qub, lalu kembalilah dia dapat melihat”, maksudnya beliau kembali ke keadaan semula, dapat melihat dengan matanya, setelah dua bola mata beliau memutih krena kesedihan (yang mendalam). Beliau berkata kepada orang-orang yang hadir, dari kalangan anak-anak dan keluarganya yang tadi menuduh beliau lemah akal, mereka pun tercengang oleh kejadian tersebut dan beliau menang atas mereka sambil mengulang-ulang penyebutan nikmat Allah pada beliau, “Tidaklah aku katakan kepadamu, bahwa aku mengetahui dari Allah sesuatu yang kamu tidak mengetahuinya.” Sebelumnya aku benar-benar berharap bisa berjumpa dengan Yusuf, menunggu-nunggu (nya) agar kegundahan, kegelisahan, dan kesedihanku hilang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 96: Ada yang mengatakan, bahwa orang itu adalah Yahudza dengan membawa baju Yusuf dan membawa pula baju yang berlumuran darah palsu karena ingin menyenangkan Nabi Ya’kub setelah sebelumnya membuatnya sedih. Setelah kedua matanya putih karena diliputi oleh kesedihan yang mendalam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 96",
    "description": "Sekian waktu berlalu, dan kafilah anak-anak nabi yakub pun sampai di kanaan. Maka ketika benar-benar telah tiba pembawa kabar gembira itu, yakni salah seorang dari anak-anak nabi yakub yang membawa baju nabi yusuf, maka diusapkannya baju itu ke wajahnya (nabi yakub), lalu seketika itu dia dapat melihat kembali seperti sedia kala. Dia berkata kepada keluarganya yang tetap tidak memercayai perkataannya, bukankah telah aku katakan kepadamu tadi, bahwa aku mencium bau yusuf. Aku yakin yusuf masih hidup karena aku mengetahui dari Allah apa yang tidak kamu ketahui. Kejadian yang baru saja mereka saksikan membuat keluarga besar nabi yakub sadar bahwa selama ini dia mengetahui mereka telah membohonginya. Karena itu, mereka meminta maaf kepada nabi yakub dan minta dimohonkan ampunan kepada Allah atas dosa mereka. Mereka berkata, wahai ayah kami! mohonkanlah kepada Allah agar dia memberi ampunan untuk kami atas dosa-dosa kami. Sesungguh-Nya kami sejak dulu adalah orang yang bersalah dan berdosa."
  }
]