[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Putra-putra ya’qub berkata kepadanya, ”Wahai ayah kami, mintakanlah untuk kami kepada tuhanmu supaya mengampuni kami dan menutupi dosa-dosa kami. Sesungguhnya kami telah berbuat salah dalam tindakan yang kami lakukan terhadap yusuf dan saudara kandungnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Anak-anak Ya'qūb meminta maaf kepadanya atas apa yang telah mereka lakukan terhadap Yusuf dan saudaranya seraya berkata, \"Wahai Ayah kami! Mohonkanlah ampun kepada Allah untuk dosa-dosa kami di masa lalu. Sesungguhnya kami telah berdosa dan bersalah dalam memperlakukan Yusuf dan saudara kandungnya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Maka anak-anak Ya’qub mendatanginya untuk memohon maaf dan memintanya agar memohonkan ampun kepada Allah bagi mereka, mereka mengakui kesalahan yang telah mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. قَالُوا۟ يٰٓأَبَانَا اسْتَغْفِرْ لَنَا ذُنُوبَنَآ إِنَّا كُنَّا خٰطِـِٔينَ (Mereka berkata: “Wahai ayah kami, mohonkanlah ampun bagi kami terhadap dosa-dosa kami, sesungguhnya kami adalah orang-orang yang bersalah) Yakni para saudara Yusuf mengatakan ini setelah pembawa berita itu datang sebelum kedatangan mereka. Mereka mengakui kesalahan mereka, dan Ya’qub berjanji akan memenuhi permintaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Anak-anak Ya’kub berkata: “Wahai ayah, Aku memohon kepada Allah agar mengampuni dosa-dosa yang telah kami lakukan, sesungguhnya kami adalah para pendosa”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai ayah kami, mohonkanlah ampunan untuk kami atas dosa-dosa kami. Sesungguhnya kami adalah orang-orang yang bersalah”} orang-orang yang berdosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. Mereka mengakui kesalahan mereka dan sadar dengan itu. “Mereka berkata, ‘wahai ayah kami mohonkanlah ampun bagi kami terhadap dosa-dosa kami, sesungguhnya kami adalah orang-orang yang bersalah (berdosa)’,” atas perlakuan kami kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 97",
    "description": "Kejadian yang baru saja mereka saksikan membuat keluarga besar nabi yakub sadar bahwa selama ini dia mengetahui mereka telah membohonginya. Karena itu, mereka meminta maaf kepada nabi yakub dan minta dimohonkan ampunan kepada Allah atas dosa mereka. Mereka berkata, wahai ayah kami! mohonkanlah kepada Allah agar dia memberi ampunan untuk kami atas dosa-dosa kami. Sesungguh-Nya kami sejak dulu adalah orang yang bersalah dan berdosa. Memenuhi permohonan keluarganya itu, dia (nabi yakub) berkata, aku akan memohonkan ampunan bagimu semua kepada tuhanku. Sungguh, dia adalah tuhan yang maha pengampun, maha penyayang."
  }
]