[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’qub berkata, ”Aku memohon kepada tuhanku agar mengampuni dosa-dosa kalian. Sesungguhnya Dia Maha pengampun dosa-dosa hamba-hambaNya yang bertaubat, lagi Maha penyayang kepada mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Sang ayah berkata kepada mereka, \"Aku akan memohonkan ampun kepada Rabbku untuk dosa-dosa kalian. Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Ya’qub berjanji akan memintakan mereka ampunan dari Allah, Dia Maha Mengampuni dosa-dosa hamba-Nya yang bertaubat dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّىٓ (Ya’qub berkata: “Aku akan memohonkan ampun bagimu kepada Tuhanku) Imam az-Zajjaj berkata: nabi Ya’qub hendak memohonkan ampun bagi mereka di waktu sahur karena di waktu itu doa seseorang akan lebih mudah untuk dikabulkan, ia tidak buru-buru berdoa karena mengetahui besarnya kesalahan mereka sehingga ia hendak berdoa kepada Allah dengan penuh keikhlasan dan kesungguhan serta mencari waktu yang lebih mustajab, sebagai bentuk kasih sayang terhadap anak-anaknya, dengan harapan Allah akan mengampuni mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Ya’kub berkata: “Aku akan memohonkan ampun bagi kalian kepada Allah di waktu yang tepat, yaitu di waktu sebelum fajar dimna doa akan dikabulkan.” Ya’kub tidak tergesa-gesa berdoa untuk menunjukkan betapa buruknya perbuatan mereka dan kepastian pengabulan doa itu adalah sebagai wujud kasih sayang kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Aku akan memohonkan ampunan bagi kalian kepada Tuhanku. Sesungguhnya Dia Yang Maha Pengampun lagi Maha Penyayang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Maka “Ya’qub berkata” untuk menyambut permintaan mereka lagi bersegera meresponnya “Aku akan memohonkan ampun bagimu kepada Rabbku. Sesungguhnya Dia-lah Yang Maha Pengampun lagi Maha Penyayang”, harapanku kepadaNya, adalah agar Dia mengampuni kalian dan mencurahkan rahmat kepada kalian serta menaungi kalian dengan rahmatNya. Ada yang mengatakan, bahwa beliau menunda permohonan ampunan bagi mereka sampai waktu sahur yang utama, supaya lebih sempurna untuk memohonkan ampunan dan lebih dekat untuk dikabulkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 98: Nabi Ya’kub menunda permintaan ampunan untuk anak-anaknya sampai tiba waktu sahur agar lebih dikabulkan atau sampai malam Jum’at. Kemudian mereka pun pergi bersama ke Mesir, lalu Yusuf beserta para pembesarnya keluar (dari kerajaaannya) untuk menerima kedatangan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 98",
    "description": "Memenuhi permohonan keluarganya itu, dia (nabi yakub) berkata, aku akan memohonkan ampunan bagimu semua kepada tuhanku. Sungguh, dia adalah tuhan yang maha pengampun, maha penyayang. Sekian lama berlalu setelah kejadian itu, berangkatlah nabi yakub bersama keluarga besarnya ke mesir menuruti pesan nabi yusuf. Maka ketika mereka sudah sampai di mesir dan masuk ke tempat yang telah disediakan oleh nabi yusuf, dia merangkul kedua orang tuanya seraya berkata kepada semua anggota rombongan, masuklah kamu ke negeri mesir, insya Allah kalian masuk dalam keadaan aman."
  }
]