[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’qub dan keluarganya kemudian keluar berangkat menuju mesir untuk menemui yusuf. Ketika mereka sampai kepadanya, yusuf merangkul kedua oranng tuanya. Dan dia berkata kepada mereka ”Masuklah ke mesir, dengan kehendak Allah, dalam keadaan aman dari kesulitan, kekeringan, dan dari segala keburukan, ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Ya'qūb dan keluarganya pergi meninggalkan kampung halaman mereka untuk menemui Yusuf di negeri Mesir. Setelah mereka bertemu dengannya, Yusuf langsung memeluk ayah dan ibunya. Dan dia berkata kepada saudara-saudaranya beserta segenap keluarga mereka, \"Masuklah ke negeri Mesir dengan aman sentosa. Tidak akan ada bahaya yang mengancam kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Kemudian Ya’qub dan seluruh keluarganya pergi menuju negeri Mesir untuk bertemu Yusuf. Ketika mereka memasuki Mesir, Yusuf memeluk kedua orangtuanya dan mengajak mereka untuk tinggal di Mesir dalam keadaan aman, tentram, dan selamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. ءَاوَىٰٓ إِلَيْهِ أَبَوَيْهِ (Yusuf merangkul ibu bapanya) Yakni Nabi Yusuf membawa keduanya ke tempat tinggalnya. Para ahli tafsir berpendapat yang dimaksud dengan kedua orang tuanya adalah Nabi Ya’qub dan istrinya yang merupakan bibi dari nabi Yusuf, karena ibu kandungnya telah meninggal dunia ketika melahirkan Bunyamin adiknya. Pendapat ini diambil dari para Ahli Kitab; dan pendapat yang lebih kuat mengatakan bahwa yang dimaksud adalah ibu kandungnya sendiri. وَقَالَ ادْخُلُوا۟ مِصْرَ إِن شَآءَ اللهُ ءَامِنِينَ (dan dia berkata: “Masuklah kamu ke negeri Mesir, insya Allah dalam keadaan aman”) Yakni aman dari hal yang kalian benci. Mereka dalam keadaan aman karena kadudukan Yusuf di negeri Mesir. Pendapat lain mengatakan bahwa nabi Yusuf menjemput mereka di luar negeri Mesir sambil berdiri menunggu mereka di suatu tempat, lalu mereka mendatanginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Lalu Ya’kub AS dan seluruh keluarganya berangkat. Mereka berjalan sampai tiba di Mesir dan menemui Yusuf AS. Lalu Yusuf mempersilahkan orang tuanya (ayah, ibu dan bibinya) untuk menuju ke tempatnya dan memeluk mereka serta berkata: “Masuklah ke dalam negeri Mesir supaya aman dari apa yang kalian benci, jika Allah berkehendak”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika mereka masuk ke (tempat) Yusuf, dia merangkul} memeluk {orang tuanya dan berkata,“Masuklah ke negeri Mesir dalam keadaan aman jika Allah menghendaki”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. “Maka tatkala”, Ya’qub, anak-anak beliau dan keluarga mereka telah berangkat meninggalkan negeri mereka menuju ke tempat Yusuf di Mesir dan pemukimannya, dan ketika mereka telah sampai “mereka masuk ke (tempat) Yusuf. Yusuf merangkul ibu bapaknya”, mendekatkan mereka berdua kepada dirinya dan mengistimewakan mereka dengan mendekatkannya, serta memperlihatkan kebaktian, kebaikan, penghormatan, dan pengagungan yang besar kepada kedua orangtuanya “dan dia berkata”, kepada seluruh anggota keluarganya, “Masuklah kamu sekalian ke negeri Mesir, insya Allah dalam keadaan aman”, dari segala yang dibenci dan menakutkan. Mereka masuk dalam suasana yang menyenangkan. Kelelahan dan kesusahan penghidupan mereka pun pupus, dan terwujudlah kebahagiaan dan keceriaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yusuf ayat 99: Yakni Ya’kub, anak-anaknya serta keluarga mereka. Ayah dan ibunya. Ada yang mengatakan, ayah dan saudara perempuan ibunya (bibi). Ketika itu, Yusuf menampakkan rasa berbakti dan memuliakan kedua orang tuanya. Maka mereka masuk, sedangkan Yusuf duduk di atas singgsananya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yusuf Ayat 99",
    "description": "Sekian lama berlalu setelah kejadian itu, berangkatlah nabi yakub bersama keluarga besarnya ke mesir menuruti pesan nabi yusuf. Maka ketika mereka sudah sampai di mesir dan masuk ke tempat yang telah disediakan oleh nabi yusuf, dia merangkul kedua orang tuanya seraya berkata kepada semua anggota rombongan, masuklah kamu ke negeri mesir, insya Allah kalian masuk dalam keadaan aman. Dan ketika keluarga besar nabi yusuf sudah menempati ruangan yang disediakan, dia menuntun dan menaikkan kedua orang tuanya ke atas singgasana yang sudah disiapkannya. Dan mereka semua tunduk bersujud memberi penghormatan kepadanya. Dan dia berkata kepada ayahnya, wahai ayahku! inilah takwil dari mimpiku yang dahulu itu aku ceritakan kepada engkau. Dan sesungguhnya tuhanku yang selalu memelihara dan melindungiku telah menjadikannya kenyataan. Sesungguhnya tuhanku telah berbuat baik kepadaku dengan menyempurnakan nikmat-Nya, antara lain ketika dia membebaskan aku dari penjara setelah difitnah, ketika membawa kamu dari dusun menuju mesir, dan setelah setan memerdaya saudara-saudaraku sehingga merusak hubungan antara aku dengan saudara-saudaraku itu. Sungguh, tuhanku mahalembut terhadap apa yang dia kehendaki dengan mengaturnya secara rapi. Sungguh, dia yang maha mengetahui segala sesuatu, lagi mahabijaksana dalam ketetapan-Nya."
  }
]