[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Alif Lam Mim). Pembicaraan tentang huru-huruf yang teputus-putus (di awal surat seperti ini) telah berlalu di awal surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Mīm. Pembahasan tentang huruf-huruf seperti ini sudah disebutkan pada permulaan surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1-2. تِلْكَ ءَايٰتُ الْكِتٰبِ الٓمٓ( Alif Laam Miim. Inilah ayat-ayat Al Quran) Telah disebutkan penjelasan tentang pembukaan surat yang seperti ini, sehingga tidak perlu lagi untuk diulang. الْحَكِيمِ (yang mengandung hikmat) Yakni memiliki hikmah yang sangat dalam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Alif, Lam, Mim layaknya pembuka surah Al-Baqarah. Fungsinya untuk memberi perhatian tentang betapa pentingnya sesuatu yang dibaca setelahnya. Dan untuk meneguhkan kekokohan Al-Qur’an serta keberadaannya yang berasal dari sisi Allah dengan menantang bangsa Arab untuk mendatangkan sesuatu yang serupa, walaupun Al-Qur’an itu tersusun dari huruf-huruf dalam bahasa mereka yang dibanggakan bahwa merekalah yang paling ahli dalam menerangkannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Mīm"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 1: Telah lalu pembahasan akan huruf muqatha’ah pada awal surat Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 1",
    "description": "1-3. Alif l'm m'm. Inilah ayat-ayat Al-Qur'an yang meski tersusun dari huruf-huruf yang dikenal oleh masyarakat arab namun mereka tidak mampu membuat tandingannya. Inilah ayat-ayat yang mengandung hikmah dan pelajaran yang tidak bertentangan antara satu ayat dengan lainnya. Kami turunkan Al-Qur'an ini sebagai petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan, yaitu mereka yang senantiasa beramal saleh dengan ikhlas"
  }
]