[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan langit dan meninggikannya tanpa tiang sebagaimana yang kalian saksikan, Dia menancapkan gunung-gunung di bumi dengan kokoh, agar bumi tidak bergerak dan tidak bergoncang sehingga kehidupan kalian tidak rusak, Dia menyebarkan di bumi berbagai macam makhluk bernyawa, menurunkan air dari awan, lalu Dia menumbuhkan dengan air itu dari bumi segala tanaman yang berpasangan yang hijau lagi menarik pandangan mata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Allah -Subḥānahu wa Ta'ālā- menciptakan langit yang terangkat tanpa tiang dan menghamparkan di bumi ini gunung-gunung kokoh sehingga bumi ini tidak menggoyangkan kalian, serta menyebarkan di atas bumi ini berbagai macam binatang. Dan Kami telah menurunkan air hujan dari langit lalu Kami tumbuhkan di bumi dari setiap jenis tanaman yang indah dipandang mata, yang dimanfaatkan oleh manusia dan binatang melata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Allah menciptakan tujuh langit tanpa kalian melihat tiang padanya, menancapkan gunung-gunung yang kokoh di bumi agar tidak menggoncang kalian, menyebarkan berbagai jenis hewan, dan menurunkan hujan dari awan sehingga Kami menumbuhkan di bumi setiap jenis tumbuhan yang sedap dipandang dan bermanfaat bagi manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. خَلَقَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ (Dia menciptakan langit tanpa tiang yang kamu melihatnya) Ayat ini dapat bermakna bahwa langit memiliki tiang namun tidak terlihat. Dan dapat juga bermakna bahwa langit benar-benar tidak memiliki tiang. وَأَلْقَىٰ فِى الْأَرْضِ رَوٰسِىَ(dan Dia meletakkan gunung-gunung (di permukaan) bumi) Yakni gunung-gunung yang kokoh. أَن تَمِيدَ بِكُمْ (supaya bumi itu tidak menggoyangkan kamu) Allah menjadikannya sangat kokoh sehingga tidak tergoncang berkat gunung-gunung yang ditancapkan di atas permukaannya. وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍ ۚ (dan memperkembang biakkan padanya segala macam jenis binatang) Yakni dari segala jenis binatang yang ada. وَأَنزَلْنَا مِنَ السَّمَآءِ مَآءً فَأَنۢبَتْنَا فِيهَا مِن كُلِّ زَوْجٍ كَرِيمٍ (Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik) Yakni dari segala jenis tumbuhan. Dan Allah menyebutnya dengan tumbuhan yang baik karena memiliki warna yang indah dan manfaat yang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dia menciptakan langit tanpa pilar yang dapat kalian lihat. Dan Dia melatakkan gunung-gunung kokoh di atas permukaan bumi supaya tidak mengguncang dan menggoyangkan kamu. Dia juga memisah-misahkan berbagai jenis hewan melata di bumi. Dan dari langit, Kami menurunkan hujan (yang keluar) dari awan, lalu kami menumbuhkan setiap jenis (tumbuhan) yang baik di bumi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakan langit tanpa tiang} penyangga {yang kalian lihat dan meletakkan di bumi gunung-gunung} gunung-gunung yang meneguhkan {agar tidak berguncang} agar tidak berguncang dan bergerak {bersama kalian serta menyebarkan} menyebarkan {padanya segala jenis makhluk bergerak. Kami menurunkan air dari langit, lalu Kami menumbuhkan padanya segala pasangan} jenis {yang baik} yang baik dilihat dan banyak manfaatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Allah membacakan kepada hamba-hambaNya beberapa tanda dari tanda-tanda kekuasaanNya, beberapa keajaiban dari keajaiban-keajaiban hikmahNYa, dan beberapa nikmat dari tanda-tanda rahmatNYa, seraya berfirman, ”Dia menciptakan langit,” yang tujuh lapis dengan keagungan, keluasan, ketebalan, dan ketinggian yang luarbiasa, “tanpa tiang yang kamu melihatnya,” maksudnya, ia tidak mempunyai tiang-tiang penyangga. Dan kalau seandainya ia mempunyai tiang pasti tiang-tiang itu terlihat. Sesungguhnya langit itu terpancang dan kokoh dengan kekuasaan Allah. “dan Dia meletakkan gunung-gunung di bumi.” Yaitu gunung-gunung yang sangat besar yang Dia tancapkan di penjuru-penjurunya, supaya “bumi itu tidak menggoyangkan kamu,” maka kalau saja tidak ada gunung-gunung yang terpancang itu, niscaya bumi ini goncang dan niscaya tidak akan pernah diam dengan segenap penghuninya, “dan memperkembangbiakan kepadanya segala macam jenis binatang.” Maksudnya, Dia menyebarluaskan di muka bumi yang luas ini segala macam binatang melata yang semua ditundukkan untuk anak cucu Adam, untuk kemaslahatan mereka dan kebaikan bagi mereka. Dan ketika Allah mengembangbiakannya di muka bumi ini, Allah mengetahui bahwasannya semua binatang melata itu harus mempunyai rizki untuk kehidupannya, maka Dia menurunkan air yang penuh berkah drai langit, “lalu kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik,” pemandangannya berguna lagi berkah. Maka binatang-binatang yang disebarluaskan itu dapat berkeliaran memakannya, dan setiap hewan tinggal di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 10: Ketahuilah bahwa Allah sajalah yang menciptakan langit yang besar dan tinggi dengan tanpa tiang yan terlihat untuk bersandar padanya sebagaiman yang kalian lihat darinya. Allah juga ciptakan di bumi gunung dengan kokoh agar kalian tidak berguncang, Allah juga sebarkan di bumi berbagai macam makhluk melata yang bermanfaat bagi kalian. Allah juga turunkan dari awan hujan, maka tumbuhlah dengannya di bumi dari seluruh macam tumbuhan yang indah dan sedap dipandang mata serta banyak manfaatnya. Allah berkuasa dengan urusan yang besar yang tidak memiliki batasan, Dialah yang maha kuasa atas seluruh makhluk dengan tiang maupun yang tanpa tiang (langit), yang terlihat maupun yang tidak; Dialah yang maha kuasa atas segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala membacakan kepada hamba-hamba-Nya atsar (pengaruh) yang berasal dari qudrat (kekuasaan)-Nya, keindahan yang berasal dari kebijaksanaan-Nya dan nikmat-nikmat-Nya yang berasal dari rahmat-Nya. Jika memang ada tiangnya, tentu akan kelihatan. Namun ternyata tidak terlihat, dan ia bertahan tidak jatuh ke bumi dengan kekuasaan Allah Subhaanahu wa Ta'aala. Dia menancapkannya di berbagai penjuru bumi. Semuanya ditundukkan untuk anak Adam, untuk maslahat dan manfaat mereka. Oleh karena Dia memperkembangbiakkan berbagai hewan di bumi, dan Dia mengetahui, bahwa hewan-hewan tersebut butuh rezeki agar bisa hidup, maka Dia menurunkan air dari langit sebagaimana diterangkan dalam lanjutan ayatnya. Sehingga hewan-hewan dapat mengembala di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 10",
    "description": "Di antara tanda-tanda keesaan dan kekuasan Allah adalah bahwa dia menciptakan langit tanpa tiang penyangga sebagaimana kamu melihatnya, dan dia juga meletakkan gunung-gunung di permukaan bumi sebagai pasak agar ia tidak menggoyangkan kamu sehingga kamu dapat tinggal di bumi dengan tenang; dan dia memperkembangbiakkan segala macam jenis makhluk bergerak yang bernyawa di bumi, baik yang hidup di darat, laut, maupun udara. Dan kami turunkan air hujan dari langit ke bumi, lalu kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik, sedap dipandang, dan bermanfaat. 11. Demikianlah Allah menciptakan langit, meletakkan gunung, dan menurunkan hujan. Inilah ciptaan Allah, maka perlihatkanlah olehmu kepadaku, wahai orang-orang kafir, apa yang telah diciptakan oleh sesembahanmu selain Allah; mampukah mereka melakukan apa yang telah diperbuat oleh Allah' tentu tidak. Penghambaanmu kepada mereka adalah kezaliman. Sebenarnya orang-orang yang zalim itu, yakni mereka yang menyembah selain Allah, berada di dalam kesesatan dan kebodohan yang nyata."
  }
]