[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Segala apa yang kalian saksikan adalah makhluk ciptaan Allah. maka tunjukkanlah kepadaku (wahai orang-orang musyrik) apa yang telah diciptakan oleh tuhan-tuhan kalian yang kalian sembah selain Allah? sebaliknya, orang-orang musyrik itu dalam keadaan menyimpang yang jauh dari kebenaran dan jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Yang telah disebut itu adalah ciptaan Allah, maka tunjukkan kepadaku -wahai orang-orang musyrik- apa yang telah diciptakan oleh tuhan-tuhan selain-Nya dari kalangan yang kalian sembah selain Allah. Akan tetapi orang-orang yang zalim itu berada di dalam kesesatan yang nyata dari kebenaran, karena mereka berbuat syirik terhadap Rabb mereka dengan sesuatu yang tidak mampu untuk menciptakan apapun, justru mereka itu diciptakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Hai orang-orang musyrik, yang kalian saksikan itu adalah ciptaan Allah; maka perlihatkanlah kepadaku sesuatu yang diciptakan tuhan-tuhan yang kalian sembah selain Allah? Sungguh orang-orang musyrik itu berada dalam kesesatan yang jelas dan jauh dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. هٰذَا خَلْقُ اللهِ فَأَرُونِى مَاذَا خَلَقَ الَّذِينَ مِن دُونِهِۦ ۚ (Inilah ciptaan Allah, maka perlihatkanlah olehmu kepadaku apa yang telah diciptakan oleh sembahan-sembahan(mu) selain Allah) Yakni tuhan-tuhan yang kalian sembah. Tunjukkanlah kepadaku apa yang telah mereka ciptakan yang serupa dengan ciptaan Allah atau yang mendekatinya. بَلِ الظّٰلِمُونَ فِى ضَلٰلٍ مُّبِينٍ(Sebenarnya orang-orang yang zalim itu berada di dalam kesesatan yang nyata) Allah pertama-tama menetapkan kezaliman mereka, kemudian menetapkan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Sesuatu yang dilihat ini adalah ciptaan Allah SWT. Wahai orang-orang musyrik, tunjukkanlah kepadaku, apakah yang diciptakan oleh tuhan-tuhan yang disembah selain Allah? Sebenarnya orang-orang yang menzalimi diri sendiri dengan menyekutukan Allah itu berada dalam labirin dan jauh dari jalan kebenaran dan istiqamah. Dan {Bal} itu untuk berpindah dari suatu keadaan menuju keadaan lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Inilah ciptaan Allah. Maka perlihatkanlah kepadaku apa yang telah diciptakan oleh selain Dia. Sebenarnya orang-orang zalim itu berada di dalam kesesatan yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “ini,” maksudnya, penciptaan alam atas dan alam bawah, yang terdiri drai benda-benda padat, hewan dan dialirkannya rizki kepada mereka adalah, “ciptaan Allah,” semata, tiada sekutu bagiNya. Semua orang mengakui hal ini, sampai kalian sendiri, wahai kaum musyrikin, “maka kalian perlihatkanlah kepadaku apa yang telah diciptakan oleh sembahan-sembahan(mu) selain Dia,” maksudnya, orang-orang yang telah kalian jadikan sekutu bagiNya, yang kalian berdoa dan menyembah kepadanya, semua itu mengharuskan kalau mereka mempunyai ciptaan seperti ciptaan Allah dan rizki seperti rizkiNya. Kalau mereka mempunyai sedikit saja dari hal itu maka perlihatkanlah kepadaku agar apa yang kalian klaim itu, yaitu keberkahan untuk mereka diibadahi (disembah) menjadi benar. Sebagaimana sudah dimaklumi bahwa mereka tidak akan sanggup memperlihatkannya sedikitpun dari ciptaan miliknya, karena seluruh yang disebutkan (sekutu-sekutu, berhala) telah mereka akui sebagai ciptaan Allah semata, dan disana tidak ada sesuatu apa pun (tuhan) yang dikenal selain tuhan berhala itu. Maka dengan demikian terbuktilah kelemahan mereka untuk membuktikan bahwa berhala-berhala itu berhak disembah. Namun, sebenarnya peribadahan mereka kepada berhala-berhala tersebut tidaklah berdasarkan ilmu dan pemikiran yang mendalam, melainkan berdasarkan kejahilan dan kesesatan. Dan maka dari itu Allah berfirman, ”sebenarnya orang-orang yang zhalim itu berada di dalam kesesatan yang nyata,” maksudnya, (kesesatan) yang sangat jelas lagi terang, yang mana mereka menyembah apa-apa yang sama sekali tidak kuasa memberikan manfaat atau kemudaratan, mematikan, atau menghidupkan kembali, mereka mengabaikan ketulusan kepada sang pencipta yang Maha pemberi rizki lagi Maha Pemilik segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 11: Ketahuilah wahai orang-orang yang musyrik bahwasanya setiap apa yang kalian lihat dari makhluk, adalah ciptaan Allah. Maka jika kalian mengetahui akan hal itu, lalu apa yang kalian lihat dari ciptaan tuhan-tuhan lain yang kalian sembah selain Allah ? Ini adalah kelemahan dari orang-orang musyrik dan juga sebagai pengetahuan bagi mereka bahwa ciptaan-ciptaan yang mereka buat dari tunggangan-tunggangan mereka dan selainnya bahwasanya mereka buat dengan ilmu dari Allah dan pertolongan dari-Nya. Ketahuilah bahwasanya orang-orang yang dzalim dan menerobos aturan-aturan Allah dalam kesesatan yang nyata dan terang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang kamu jadikan mereka (sembahan-sembahanmu) sebagai sekutu-sekutu Allah, kamu berdoa dan menyembah kepada mereka. Hal ini jelas mengharuskan sesuatu yang kamu sembah itu memiliki ciptaan dan memberikan rezeki. Jika memang mereka punya ciptaan dan rezeki, maka tunjukkanlah kepadaku. Tetapi ternyata apa yang kamu sembah itu tidak mampu berbuat apa-apa, tidak mampu mencipta apalagi memberi rezeki, bahkan sesembahan itu juga dicipta. Di samping itu, penyembahanmu kepada mereka tidak di atas ilmu dan keterangan, bahkan di atas kebodohan dan kesesatan. Oleh karena itu, pada lanjutan ayatnya, Allah Subhaanahu wa Ta'aala berfirman, “Sebenarnya orang-orang yang zalim itu berada di dalam kesesatan yang nyata.” Karena mereka menyembah sesuatu yang tidak berkuasa memberikan manfaat dan menolak bahaya, tidak mampu menghidupkan dan mematikan, apalagi membangkitkan, bahkan mereka meninggalkan ikhlas kepada Allah Pencipta, Pemberi rezeki dan Pemilik segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 11",
    "description": "Demikianlah Allah menciptakan langit, meletakkan gunung, dan menurunkan hujan. Inilah ciptaan Allah, maka perlihatkanlah olehmu kepadaku, wahai orang-orang kafir, apa yang telah diciptakan oleh sesembahanmu selain Allah; mampukah mereka melakukan apa yang telah diperbuat oleh Allah' tentu tidak. Penghambaanmu kepada mereka adalah kezaliman. Sebenarnya orang-orang yang zalim itu, yakni mereka yang menyembah selain Allah, berada di dalam kesesatan dan kebodohan yang nyata. 12. Beralih dari penjelasan tentang buruknya akidah orang musyrik dan kezaliman mereka, pada ayat ini Allah memaparkan nasihat lukman kepada anaknya, yang salah satunya berisi larangan berbuat syirik. Dan sungguh, telah kami berikan hikmah, yakni kemampu'an mendapatkan ilmu dan pemahaman serta mengamalkannya, kepada lukman, yaitu, 'bersyukurlah kepada Allah atas nikmat dan karunia-Nya! dan barang siapa bersyukur kepada Allah maka sesungguhnya dia mendatangkan manfaat bersyukur itu untuk dirinya sendiri; dan sebaliknya, barang siapa tidak bersyukur lalu ingkar atas nikmat Allah maka sesungguhnya hal itu tidak akan merugikan Allah sedikit pun, sebab Allah mahakaya dan tidak butuh penyembahan hamba-Nya, maha terpuji meski sekiranya tidak ada yang memuji-Nya. '."
  }
]