[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah memberikan hikmah kepada hamba Kami yang shalih, yaitu Luqman. Hikmah yaitu pemahaman dalam agama, akal dan kebenaran dalam berkata. Kami katakan kepadanya, “Bersyukurlah kepada Allah atas nikmat-nikmatNya kepadamu, dan barangsiapa bersyukur kepada Tuhannya, manfaatnya kembali kepada dirinya sendiri, sebaliknya barangsiapa mengingkari nikmat-nikmaNya, sesungguhnya Allah Mahakaya dari syukurnya, tidak memerlukannya. BagiNya segala puji dan sanjungan baik dalam keadaan apa pun.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan Kami telah memberi Lukman pemahaman di dalam agama dan kebenaran di berbagai urusan, dan Kami katakan kepadanya, “Bersyukurlah kepada Rabbmu -wahai Lukman- atas apa yang dikaruniakan kepadamu berupa taufik untuk menaati-Nya. Barangsiapa bersyukur kepada Rabbnya, sesungguhnya syukurnya itu kembali kepada dirinya sendiri, dan Allah tidak butuh terhadap syukurnya. Dan barangsiapa mengingkari nikmat Allah padanya, sesungguhnya kerugian pengingkarannya itu kembali kepada dirinya, dan Allah sama sekali tidak di rugikan dengan pengingkarannya terhadap nikmat yang diberikan kepadanya. Sesungguhnya Allah tidak butuh terhadap seluruh makhluk-Nya dan Dia Maha Terpuji dalam segala urusan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Sungguh Kami telah memberi kepada hamba yang shalih yang bernama Luqman, pemahaman agama, taufik dalam perkataan dan perbuatannya, dan hikmah yang banyak. Allah memerintahkannya untuk bersyukur kepada Allah atas segala kenikmatan-Nya dengan perkataan dan perbuatan; dan Allah menjelaskan bahwa manfaat dari rasa syukur itu akan kembali kepada dirinya sendiri. Dan barangsiapa yang mengingkari kenikmatan Allah, maka Allah Maha Kaya dari rasa syukurnya dan dari segala sesuatu, dan Dia senantiasa terpuji dalam segala keadaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَلَقَدْ ءَاتَيْنَا لُقْمٰنَ الْحِكْمَةَ (Dan sesungguhnya telah Kami berikan hikmat kepada Luqman) Mayoritas ulama mengatakan bahwa Luqman bukanlah seorang Nabi. Dan hikmah yang diberikan Allah baginya adalah berupa pemahaman, kecerdasan, dan ucapan yang lurus. أَنِ اشْكُرْ لِلّٰهِ ۚ( yaitu: “Bersyukurlah kepada Allah) Maka Luqman bersyukur kepada Allah; dan ia diberikan hikmah (kebijaksanaan) karena rasa syukurnya. وَمَن يَشْكُرْ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِۦ ۖ( Dan barangsiapa yang bersyukur (kepada Allah), maka sesungguhnya ia bersyukur untuk dirinya sendiri) Sebab manfaatnya kembali kepada dirinya sendiri, karena dengan bersyukur, nikmat itu akan tetap mengalir dan terus bertambah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. 12. Kami benar-benar telah menganugerahkan hikmah kepada Luqman, yaitu ilmu dan pemahaman agama. Hikmah itu adalah kumpulan berbagai keutamaan yang bisa menjadikan pemiliknya akan menempatkan segala sesuatu pada tempat dan kadarnya. Menurut banyak orang, Luqman bukanlah seorang Nabi, namun orang bijak. Hikmah itu berisi untuk bersyukur kepada Allah, atau Kami ilhamkan kepada Luqman untuk bersyukur, karena syukur merupakan perintah. Syukur adalah memuji Allah dengan pujian-pujian dan melakukan ketaatan atas perintah-Nya. Juga menggunakan anggota badan untuk kebaikan. Barang siapa bersyukur, sesungguhnya syukur itu akan kembali pada dirinya sendiri. Karena dengan bersyukur, nikmat yang telah teranugerahkan itu menjadi kekal dan bertambah. Namun barang siapa tidak mensyukuri nikmat dan anugerah Allah maka Allah sungguh Maha Tidak Butuh atas syukur dari hamba-Nya yang ingkar itu. Allah adalah Dzat Yang Paling Berhak dipuji para ciptaan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah memberikan hikmah kepada Luqman} pengetahuan tentang agama dan kebenaran dalam beberapa perkara {yaitu,“Bersyukurlah kepada Allah. Siapa saja yang bersyukur, sesungguhnya dia bersyukur untuk dirinya sendiri. Siapa saja yang kufur, sesungguhnya Allah Maha kaya lagi Maha Terpuji”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah menginformasikan tentang pemberian karuniaNYa kepada seorang hambaNYa yang mulia, luqman berupa hikmah, yaitu ilmu pengetahuan tentang yang haq sesuai dengan wajah dan hikmahNya, yaitu ilmu tentang hukum-hukum dan pengetahuan tentang rahasia dan hukum-hukum yang terkandung di dalamnya. Seseorang bisa saja menjadi seorang alim (berilmu) akan tetapi belum tentu dia hakim. Sebab hikmah itu pasti mengharuskan adanya ilmu, bahkan adanya amal. Maka dari itu hikmah ditafsirkan (diartikan) dengan ilmu yang bermanfat dana mal shalih. Ketika Allah mengaruniakan kepadanya karunia yang sangat agung ini, Allah memerintahkan kepadanya untuk bersyukur (berterima kasih) atas karunia besar yang diberikan kepadanya, agar Allah memberkahinya dan menambah karuniaNYa kepadanya. Dan Allah mengabarkan kepadanya bahwa syukurnya orang-orang yang bersyukur itu manfaatnya kembali kepada diri mereka sendiri, dan bahwa siapa saja yang ingkar, lalu tidak bersyukur kepada Allah, maka bahayanya menimpa dirinya sendiri, sedangkan Allah Mahakaya, tidak butuh kepadanya lagi Maha terpuji dalam apa saja yang Dia takdirkan dan Dia putuskan terhadap orang yang menyalahi perintahNYa. Jadi kekayaanNYa (ketidak butuhanNya kepada hamba-hambaNYa)merupakan kepastian DzatNya. Dan keberdaannya terpuji pada sifat-sifat kesempurnaanNYa di dalam kebaikan yang dilakukanNya merupakan kepastian DzatNYa. Setiap masing-masing dari dua ungkapan ini adalah sifat kesempurnaan, dan berkumpulnya salah satu kepada yang lain adalah tambahan kesempurnaan kepada kesempurnaan. Para ahli tafsir berbeda pendapat tentang apakah luqman ini seorang nabi atau seorang hamba shalih sementara itu, Allah tidak menyebutkan tentangnya kecuali (penjelasan) bahwa Dia telah mengaruniakan hikmah kepadanya, dan Allah menyebutkan sebagian hal yang menunjukkan hikmahnya dalam nasihatnya kepada putranya. Allah menyebutkan dasar—dasar hikmah dan kaidah-kaidahnya yang pokok (besar)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 12: Sungguh Allah telah mengkaruniakan kepada hamba-Nya yang bernama Lukman serta memberikan kepadanya hikmah (yaitu ilmu yang bermanfaat dan amalan shalih). Kemudian Allah memerintahkan kepadanya agar bersyukur atas kenikmatan yang besar ini, sebagai pengagungan atas nikmat tersebut, dan agar Allah tambahkan nikmat itu. Maka barangsiapa yang bersyukur maka rasa syukur itu akan kemabali kepadanya, dan barangsiapa yang mengingkari dan kufur, maka tidak ada yang membahayakan kecuali dirinya sendiri. Allah yang maha tinggi, maha kaya atas seluruh makhluk dan tidak membutuhkan rasa syukur mereka, Dialah yang maha suci, terpuji atas apa yang Dia kuasai dan tetapkan, maha terpuji atas apa yang Dia telah ciptakan dengan indah. Jumhur ulama mengatakan bahwa Lukman bukanlah nabi, dia adalah seorang ahli hikmah dan tabib, Allah kisahkan akan hal itu pada selain surat ini. Allah berikan kepadanya hikmah dan penyebutan yang baik. Lukman memberikan wasiat kepada anaknya wasiat yang indah, dengan apa yang tidaklah manusia akan menirunya dan beramal dengan wasiat tersebut kecuali pasti akan menang dna berhasil di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang nikmat-Nya yang diberikan kepada hamba-Nya yang mulia; Luqman. Nikmat yang diberikan-Nya itu adalah hikmah (kebijaksanaan), yaitu pengetahuan terhadap kebenaran sesuai keadaan yang sebenarnya dan mengetahui rahasianya. Hikmah adalah mengetahui hukum-hukum dan mengetahui rahasia yang terkandung di dalamnya, karena terkadang seseorang berilmu namun tidak mengetahui hikmahnya. Berbeda dengan hikmah, maka ia mencakup ilmu, amal, dan hikmah atau rahasianya. Oleh karena itulah, ada yang menafsirkan hikmah dengan ilmu yang bermanfaat dan amal yang saleh. Setelah Allah Subhaanahu wa Ta'aala memberikan nikmat yang besar ini, Dia memerintahkan Beliau untuk bersyukur, agar nikmat itu diberkahi dan bertambah. Demikian pula memberitahukan, bahwa syukur yang dilakukan seseorang manfaatnya untuk dirinya sendiri, dan jika kufur, maka bencananya pun untuk dirinya sendiri. Yakni karena hikmah yang telah Kami anugerahkan kepadamu. Karena pahalanya untuk dirinya sendiri. Allah Subhaanahu wa Ta'aala tidaklah butuh kepada syukur seorang hamba, dan Dia Maha Terpuji dalam qada’ dan qadar-Nya terhadap orang yang menyelisihi perintah-Nya. Sifat kaya pada-Nya termasuk sifat lazim (mesti) pada zat (Diri)-Nya. Dia yang terpuji karena sifat-sifat-Nya yang sempurna dan karena perbuatannya yang baik dan indah, termasuk lazim zat-Nya. Masing-masing sifat ini adalah sifat sempurna, dan ketika keduanya berkumpul bersama, maka semakin sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 12",
    "description": "Beralih dari penjelasan tentang buruknya akidah orang musyrik dan kezaliman mereka, pada ayat ini Allah memaparkan nasihat lukman kepada anaknya, yang salah satunya berisi larangan berbuat syirik. Dan sungguh, telah kami berikan hikmah, yakni kemampu'an mendapatkan ilmu dan pemahaman serta mengamalkannya, kepada lukman, yaitu, 'bersyukurlah kepada Allah atas nikmat dan karunia-Nya! dan barang siapa bersyukur kepada Allah maka sesungguhnya dia mendatangkan manfaat bersyukur itu untuk dirinya sendiri; dan sebaliknya, barang siapa tidak bersyukur lalu ingkar atas nikmat Allah maka sesungguhnya hal itu tidak akan merugikan Allah sedikit pun, sebab Allah mahakaya dan tidak butuh penyembahan hamba-Nya, maha terpuji meski sekiranya tidak ada yang memuji-Nya. '13. Dan ingatlah ketika lukman berkata kepada anaknya, ketika dia sesaat demi sesaat memberi pelajaran kepadanya, 'wahai anakku! janganlah engkau mempersekutukan Allah dengan sesuatu pun, dan ketauhilah bahwa sesungguhnya mempersekutukan Allah adalah benar-benar kezaliman yang besar karena telah merendahkan martabat sang mahaagung ke posisi yang hina. '."
  }
]