[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai Rasul) nasihat Luqman kepada putranya saat dia menasihatinya, “Wahai anakku, janganlah mempersekutukan sesuatu dengan Allah, karena dengan itu kamu menzhalimi dirimu, sesungguhnya syirik benar-benar perbuatan dosa yang paling besar dan paling buruk.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Ingatlah -wahai Rasul- tatkala Lukman berkata kepada anaknya, dan dia menginginkan anaknya mendapat kebaikan dan menghindarkannya dari keburukan, \"Wahai anakku! ـanganlah engkau menyembah bersama Allah makhluk selain-Nya, sesungguhnya menyembah sesembahan lain selain Allah adalah kezaliman yang besar terhadap jiwa dengan melakukan dosa terbesar yang mengakibatkan kekal di dalam Neraka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Allah menjelaskan wasiat-wasiat Luqman dan pelajaran-pelajaran darinya -dalam tujuh ayat berikut- saat dia berkata kepada anaknya: “Wahai anakku, janganlah kamu menjadikan satupun makhluk sebagai sekutu Allah, sebab kesyirikan adalah dosa yang paling besar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَإِذْ قَالَ لُقْمٰنُ لِابْنِهِۦ وَهُوَ يَعِظُهُۥ (Dan (ingatlah) ketika Luqman berkata kepada anaknya, di waktu ia memberi pelajaran kepadanya) Lukman menyampaikan kepada anaknya nasehat-nasehat yang mengajak kepada ketauhidan, adab-adab yang baik, dan melarangnya dari kesyirikan. يٰبُنَىَّ لَا تُشْرِكْ بِاللهِ ۖ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ(“Hai anakku, janganlah kamu mempersekutukan Allah, sesungguhnya mempersekutukan (Allah) adalah benar-benar kezaliman yang besar”) Bahkan itu adalah kezaliman yang paling besar, sebab kezaliman adalah menyelewengkan suatu hak dari pemiliknya, dan hak ibadah adalah milik Allah semata, tidak ada yang berhak selain-Nya, sebab semua makhluk adalah makhluk-Nya dan segala urusan adalah urusan-Nya, sehingga menjadikan ibadah untuk selainnya merupakan pemberian hak kepada yang tidak berhak, maka itu menjadi kezaliman yang paling besar, meski tidak ada orang yang mampu memberi-Nya mudharat sedikitpun dan Dia Maha Kaya dan Maha Terpuji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Wahai Nabi, ingatlah ketika Luqman menasehati puteranya: “Wahai puteraku, jangan sekali-kali kamu menyekutukan Allah dengan apapun itu, sesungguhnya perbuatan syirik adalah kedzaliman yang besar. Dzalim adalah menempatkan sesuatu tidak pada tempatnya. Adapun syirik adalah menyamakan Dzat Tuhan Pencipta yang Maha Memberi kenikmatan dengan makhluk yang tidak mampu memberi kenikmatan, bahkan tidak bisa berbuat apa-apa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Luqman berkata kepada anaknya, yaitu dia menasihatinya} memberi perlajaran dan menumbuhkan minat anaknya {“Wahai anakku, janganlah menyekutukan Allah. Sesungguhnya menyekutukan (Allah) itu benar-benar kezaliman yang besar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “dan ketika luqman berkata kepada anaknya, di waktu ia memberi pelajaran kepadanya,” atau dia mengatakan perkataan kepadanya yang dengannya dia menasihatinya. Nasihat adalah perintah dan larangan yang disertai dengan targib dan tarhib. Dia memerintahkan kepadanya untuk ikhlas (bertauhid) dan melarangnya berbuat syirik, dan dia menyebutkan sebabbya seraya berkata,”sesungguhnya mempersekutukan adalah benar-benar kezhaliman yang besar,” sisi keberadaan syirik sebagai kezhaliman yang sangat besar adalah karena sesungguhnya tidak ada yang lebih keji dan lebih buruk daripada orang yang menyamakan makhluk yang tercipta dari tanah dengan (Allah) pemilik segala perkara, menyamakan manusia ynag lemah lagi fakier dari segala sisinya dengan Rabb Yang Mahasempurna lagi Mahakaya dari segala sisiNYa, dan menyamakan orang yang tidak bisa memberikan karunia sebesar biji sawi pun dengan tuhan yang tidak ada suatu nikmat yang ada pada manusia dalam urusan, agama, dunia, akhirat, hati dan jasad melainkan pasti berasal dariNya, dan tidak dapat menghilangkan keburukan kecuali Dia. Apakah ada sesuatu yang lebih besar dari pada ini? Dan apakah ada orang tang lebih besar kezhalimannya daripada orang yang diciptakan Allah suapaya beribadah kepadaNya dan mengesankanNYa, lalu ia pergi dengan jiwanya yang mulia itu, kemudian menempatkannya pada martabat yang paling rendah dan menjadikannya sebagai penyembah sesuatu yang sama sekali menandingi apa-apa. Oleh karena itu, dia benar-benar telah menzhalimi dirinya dengan kezhaliman yang sangat besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 13: Ingatlah wahai Nabi Allah pada hari ketika Lukman berkata kepada anaknya sebagai nasihat kepada anaknya dengan memerintahkan dan melarang : Wahai anakku ikhlaskan ibadah hanya kepada Allah dengan ketauhidan, dan janganlah engkau sekutukan dengan apapun dalam peribadatan kepada-Nya, ketahuilah bahwa syirik adalah kedzaliman yang besar secara mutlak. Kedzaliman adalah menempatkan sesuatu pada selain tempat yang semestinya. Ibadah kepada selain Allah dan menyekutukan-Nya dalam ibadah adalah menjadikan ibadah pada peribadatan yang tidak semestinya, ini adalah kedzaliman yang paling dzalim dan sebesar-besar kerusakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Abdullah bin Mas’ud radhiyallahu 'anhu, ia berkata: Ketika turun ayat, “Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezaliman.” (Terj. Al An’aam: 82) Para sahabat Rasulullah shallallahu 'alaihi wa sallam berkaa, “Siapakah di antara kami tidak melakukan kezaliman kepada dirinya?” Maka Allah ‘Azza wa Jalla menurunkan ayat, “sesungguhnya mempersekutukan (Allah) adalah benar-benar kezaliman yang besar.” (Terj. Luqman: 13) Al Hafizh dalam Al Fath juz 1 hal. 95 berkata, “Riwayat Syu’bah ini menghendaki, bahwa pertanyaan tersebut merupakan sebab turunnya ayat yang ada dalam surah Luqman, akan tetapi Bukhari dan Muslim meriwayatkan dari jalan yang lain dari Al A’masy, yaitu Sulaiman yang disebutkan dalam hadits bab ini, maka dalam riwayat Jarir darinya disebutkan, bahwa mereka (para sahabat) berkata, “Siapakah di antara kami yang tidak mencampuradukkan keimanannya dengan kezaliman?” Maka Beliau bersabda, “Bukan seperti itu. Tidakkah kamu mendengar kata-kata Luqman.” Dalam riwayat Waki’ darinya (Ibnu Mas’ud) pula disebutkan, “Bukan seperti yang kamu kira,” sedangkan dalam riwayat ‘Isa bin Yunus disebutkan, “Sesungguhnya ia adalah syirk. Tidakkah kamu mendengar kata-kata Luqman.” Zahir hadits ini menunjukkan, bahwa ayat yang disebutkan dalam surah Luqman sudah diketahui oleh mereka (para sahabat), oleh karenanya Beliau mengingatkannya. Bisa juga turunnya pada saat itu, lalu Beliau membacakanya kepada mereka, kemudian Beliau mengingatkan mereka, sehingga kedua riwayat dapat disatukan.” Para mufassir berbeda pendapat, apakah Luqman seorang nabi atau hamba yang saleh (wali)? Namun kebanyakan mereka berpendapat, bahwa Beliau adalah hamba yang saleh, wallahu a’lam. Allah Subhaanahu wa Ta'aala hanya menyebutkan tentang hikmah yang diberikan-Nya dan menyebutkan sebagian hal yang menunjukkan kebijaksanaannya dalam menasehati anaknya. Di sana Beliau menyebutkan ushul (dasar-dasar) hikmah dan kaedah-kaedahnya yang besar. Oleh karena kebijaksanaannya, maka dalam nasehatnya ia sebutkan perintah dan larangan disertai dengan targhib dan tarhib (dorongan dan ancaman). Dia memerintahkan anaknya berbuat ikhlas dan melarangnya berbuat syirk serta menerangkan sebab mengapa dilarang, yaitu karena syirk adalah kezaliman yang besar. Di tafsir surah An Nisaa’ ayat 36, kami sudah menerangkan secara lebih rinci tentang syirk dan pembagiannya, maka lihatlah. Syirk dikatakan sebagai kezaliman yang besar adalah karena di sana seseorang menyamakan makhluk yang dicipta dengan Yang Maha Pencipta, menyamakan makhluk yang memiliki kekurangan lagi fakir dari berbagai sisi dengan Yang Mahasempurna lagi Mahakaya dari berbagai sisi. Bukankah ini merupakan kezaliman yang luar biasa? Adakah kezaliman yang lebih besar daripada seseorang yang diciptakan Allah untuk menyembah dan mentauhidkan-Nya, namun malah membawa dirinya ke lembah kehinaan, menjadikan dirinya menyembah sesuatu yang tidak mampu berbuat apa-apa? Syirk disebut kezaliman, di mana arti zalim adalah menempatkan sesuatu yang bukan pada tempatnya, karena dalam syrik seseorang menempatkan ibadah kepada yang bukan tempatnya, seperti kepada patung, berhala dan makhluk-makhluk lainnya. Padahal yang seharusnya disembah adalah yang menciptakan alam semesta, yang memberinya rezeki dan yang menguasainya. Larangan Luqman kepada anaknya agar tidak berbuat syirk terdapat perintah untuk mentauhidkan Allah dan beribadah hanya kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 13",
    "description": "Dan ingatlah ketika lukman berkata kepada anaknya, ketika dia sesaat demi sesaat memberi pelajaran kepadanya, 'wahai anakku! janganlah engkau mempersekutukan Allah dengan sesuatu pun, dan ketauhilah bahwa sesungguhnya mempersekutukan Allah adalah benar-benar kezaliman yang besar karena telah merendahkan martabat sang mahaagung ke posisi yang hina. '14. Dan kami perintahkan kepada manusia agar berbuat baik kepada kedua orang tuanya, terutama ibu. Ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah seiring makin besarnya kandungan dan saat melahirkan, dan menyapihnya dalam usia dua tahun. Jika demikian, bersyukurlah kepada-ku atas nikmat yang telah aku karuniakan kepadamu dan bersyukurlah juga kepada kedua orang tuamu karena melalui keduanya kamu bisa hadir di muka bumi ini. Hanya kepada aku tempat kembalimu dan hanya aku yang akan membalasmu dengan cara terbaik."
  }
]