[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami memerintahkan manusia agar berbakti dan berbuat baik kepada bapak ibunya. Ibunya mengandungnya dalam keadaan lemah di atas kelemahan, mengandungnya dan menyapihnya setelah menyusuinya selama dua tahun. Kami berfirman kepadanya, “Bersyukurlah kepada Allah kemudian berterima kasihlah kepada kedua orang tuamu. Hanya kepadaKu-lah kalian akan kembali, lalu Aku akan membalas masing-masing sesuai haknya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan Kami telah mewasiatkan kepada manusia agar menaati kedua orang tuanya dan berbakti kepada keduanya dalam urusan yang bukan maksiat terhadap Allah. Ibunya telah mengandungnya di dalam perutnya dengan berbagai kesusahan yang terus menerus, kemudian menyapihnya dari penyusuan setelah dua tahun. Dan Kami katakan kepadanya, “Bersyukurlah kepada Allah atas kenikmatan yang telah Dia berikan kepadamu, kemudian berterima kasihlah kepada kedua orang tuamu atas pendidikan dan perhatian yang telah mereka berikan kepadamu, hanya kepada-Ku sajalah tempat kembali kalian, kemudian masing-masing Aku beri balasan sesuai dengan haknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Dan Kami perintahkan manusia untuk berbuat baik dan berbakti kepada kedua orangtuanya. Ibunya telah mengandungnya dalam keadaan bertambah lemah setiap harinya ketika kandungannya semakin besar dan mendekati kelahiran. Dan dia disapih dari susuan dalam waktu dua tahu. Dan Kami perintahkan manusia untuk bersyukur kepada-Ku atas kenikmatan yang telah Aku berikan, dan bersyukur kepada kedua orangtuamu yang telah bekerja keras dalam mengasuhmu. Hanya kepada-Ku tempat kembali para makhluk pada hari kiamat untuk menjalani hisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَوَصَّيْنَا الْإِنسٰنَ بِوٰلِدَيْهِ (Dan Kami perintahkan kepada manusia (berbuat baik) kepada dua orang ibu-bapaknya) Allah menyandingkan rasa syukur bagi kedua orangtua dengan rasa syukur kepada Allah, dan ini menunjukkan bahwa hak kedua orangtua adalah salah satu hak yang paling besar yang ditanggung oleh seorang anak. حَمَلَتْهُ أُمُّهُۥ وَهْنًا عَلَىٰ وَهْنٍ (ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah) Yakni ibunya mengandungnya dalam keadaan lemah yang semakin bertambah. Pendapat lain mengatakan yang dimaksud dengan ayat ini adalah bahwa seorang perempuan adalah makhluk yang lemah, kemudian bertambah lemah karena kehamilannya. وَفِصٰلُهُۥ فِى عَامَيْنِ (dan menyapihnya dalam dua tahun) Yakni penyapihannya. أَنِ اشْكُرْ لِى وَلِوٰلِدَيْكَ(Bersyukurlah kepada-Ku dan kepada dua orang ibu bapakmu) Ini merupakan isi dari wasiat Allah terhadap kedua orangtua. إِلَىَّ الْمَصِيرُ(hanya kepada-Kulah kembalimu) Dan tidak kepada selain-Ku, maka perhatikanlah apakah kamu telah menjalankan wasiat-Ku dengan sebenar-benarnya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Juga Kami perintahkan mereka para manusia untuk senantiasa berbakti dan berbuat baik kepada kedua orang tua mereka. Bersyukur kepada Allah berkaitan dengan ungkapan syukur kepada kedua orang tua. Perintah untuk berbakti dan bersyukur kepada keduanya adalah bukti bahwa hak-hak orang tua itu sangat besar. Ibu telah mengandung dengan sangat payah. Kemudian menyapih anak-anak mereka ketika berumur dua tahun. Itu menunjukkan bahwa waktu menyusui adalah dua tahun. Kami mengilhamkan kepadanya untuk bersyukur kepada-Ku, karena Aku adalah sumber segala nikmat. Juga untuk bersyukur kepada kedua orang tua yang menjadi sebab kehidupan dan telah mendidik mereka hingga datangnya hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mewasiatkan kepada manusia (agar berbuat baik) kepada kedua orang tuanya. Ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah} penderitaan demi penderitaan {dan menyapihnya} menyapihnya dari susuan {dalam dua tahun. “Bersyukurlah kepadaKu dan kepada kedua orang tuamu” Hanya kepadaKu dikembalikan} kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. setelah luqman memerintahkan agar menunaikan hakNya dengan cara meninggalkan perbuatan syirik yang diantara konsekuensinya adalah menegakkan tauhid, maka dia memerintahkan kepada anaknya supaya menunaikan hak kedua orang tua. Allah berfirman, ”dan kami perintahkan kepada manusia,” kami wajibkan kepadanya dan kami menjadikannya sebagia wasiat baginya, yang kami kelak akan meminta pertanggungjawabannya, apakah dia memeliharanya atau tidak? Maka kami pesankan kepadanya “(berbuat baik) kepada kedua orang tua,” dan kami katakan kepadaNya, “bersyukurlah kepadaKU,” dengan melakukan ibadah kepadaku, menunaikan hak-hak ku dan tidak mengunakan nikmat-nikmatKu untuk mendurhakaiKu, “dan kepada dua orang ibu bapakmu,” dengan berbuta baik kepada mereka dengan perkataan yang lembut, ucapan yang santun, perbuatan baik, bersikap rendah hati kepada mereka, memuliakan dan menghormati mereka, memberi mereka belanja (nafkah) dan menjauhi perbuatan buruk terhadap mereka dari segala sisi dengan perkataan dan perbuatan. Maka kami wasiatkan dengan pesan ini dan kami kabarkan kepadnaya bahwa “hanya kepadaku-lah kembalimu,” maksudnya, kalian akan kembali, wahai manusia, kepada tuhan yang telah memberimu wasiat dan membebanimu balasan yang berlipat ganda, ataukah kamu menyia-nyiakan lalu Dia akan menyiksamu dengan siksaan yang buruk. Kemudian Allah menjelaskan sebab yang mewajibkan berbuat baik kepada kedua ibu bapak terletak pada ibu, seraya berfirman,” ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah,” maksudnya, dalam keadaan sengsara dan makin sengsara, dan dia terus merasakan penderitaan dari mulai sejak (sang bayi) masih berbentuk sperma, seperti rasa mual, sakit, lemah, berat dan berubahnya kondisi, kemudian sakitnya melahirkan, yaitu rasa sakit yang sangta perih, kemudian “menyapihnya dalam dua tahun,” dimana sang anak terus berada dalam asuhan, lindungan dan susuan ibunya. Tidakkah sangat pantas sekali kalau ditekankan kepada anaknya untuk berbuta baik kepada orang yang telah menanggung penderitaan-penderitaan dengan penuh rasa kasih sayang demi dia, dan dipesankan kepadanya agar benar-benar berbakti kepadanya?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 14: Allah mengabarkan bahwasanya Allah mewajibkan kepada manusia dan mewasiatkan dengan wasiat yang besar yaitu agar berbuat baik kepada kedua orang tua dan berbuat ihsan kepada keduanya. Kemudian Allah menjelaskan akan sebab tersebut, yaitu karena sebab ibnya mengandungnya dalam perutnya, dengan bertambahnya umur kehamilannya, maka bertambah pula keletihannya, lemah dan terus lemah seiring dengan besarnya kehamilannya. Kemudian Allah menjelaskan bahwa penyapihan anak tersebut dari menyusui terjadi dalam dua tahun. Kemudian Allah memerintahkan agar manusia yang telah dilahirkan ini bersyukur dengan menegakkan peribadatan kepada Allah dan menegakkan hak-hak kepada kedua orang tuanya dengan berbuat baik kepada keduanya serta ihsan dengan segala macam bentuknya. Ketahuilah, bahwasanya hanyalah kepada Allah tempat kembali dan Allah akan bertanya akan wasiat ini apa telah dilaksanakan ?! Ataukah diabaikan dan dilalaikan ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memerintahkan untuk memenuhi hak-Nya, yaitu dengan mentauhidkan-Nya dan menjauhi syirk, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk memenuhi hak kedua orang tua, yaitu dengan berbakti kepada keduanya. Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan sebab yang mengharuskan berbakti kepada kedua orang tua, terutama ibu. Ibu merasakan berbagai derita. Sejak calon bakal anak sebagai mani, si ibu merasakan ngidam dan kurang nafsu makan, merasakan sakit, lemah, dan semakin bertambah lemah ketika janin semakin membesar, kelemahan pun bertambah ketika hendak melahirkan dan ketika melahirkan. Maksudnya, waktu menyapih yang paling lambat ialah setelah anak berumur dua tahun. Yaitu dengan beribadah kepada-Nya dan memenuhi hak-hak-Nya, serta tidak menggunakan nikmat-nikmat-Nya untuk bermaksiat kepada-Nya. Yaitu dengan berbuat ihsan kepada keduanya baik dengan ucapan maupun dengan perbuatan. Misalnya adalah mengucapkan kata-kata yang lembut dan halus, sedangkan dengan perbuatan adalah dengan merendahkan diri, menghormati, memuliakan, dan memikul bebannya, serta menjauhi sikap yang menyakitkannya, baik bentuknya ucapan maupun perbuatan. Yakni kamu wahai manusia akan dikembalikan kepada Tuhan yang memerintahkan dan membebanimu demikian, Dia akan bertanya kepadamu, “Apakah kamu telah melaksanakannya sehingga kamu akan diberi pahala, atau kamu malah melalaikannya sehingga kamu memperoleh siksa?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 14",
    "description": "Dan kami perintahkan kepada manusia agar berbuat baik kepada kedua orang tuanya, terutama ibu. Ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah seiring makin besarnya kandungan dan saat melahirkan, dan menyapihnya dalam usia dua tahun. Jika demikian, bersyukurlah kepada-ku atas nikmat yang telah aku karuniakan kepadamu dan bersyukurlah juga kepada kedua orang tuamu karena melalui keduanya kamu bisa hadir di muka bumi ini. Hanya kepada aku tempat kembalimu dan hanya aku yang akan membalasmu dengan cara terbaik. 15. Meski taat kepada kedua orang tua berada pada posisi setara dengan menyembah Allah, ia tidak bersifat mutlak. Jika keduanya atau salah satunya memaksamu secara sungguh-sungguh untuk mempersekutukan aku dengan sesuatu yang engkau tidak mempunyai pengetahuan tentang itu, terlebih jika engkau tahu besarnya dosa syirik, maka janganlah engkau menaati keduanya. Namun, jagalah hubungan baikmu dan pergaulilah keduanya di dunia dengan baik, bahkan terbaik, selama keduanya tidak mencampuri urusan agamamu. Dan ikutilah jalan orang yang selalu kembali kepada-ku dalam segala urusannya. Kemudian, hanya kepada-ku tempat kembalimu di akhirat kelak, maka akan aku beritahukan kepadamu apa yang telah kamu kerjakan dan aku akan memberi balasan sesuai amal perbuatanmu di dunia."
  }
]