[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila bapak ibumu memaksamu (wahai anak yang beriman) untuk membuatmu menyekutukan sesuatu denganKu dalam ibadahmu kepadaKu dimana kamu tidak memiliki ilmu tentangnya atau keduanya mengajakmu berbuat maksiat, maka jangan taati keduanya, karena tidak ada ketaatan bagi makhluk untuk bermaksiat kepada khaliq, namun tetaplah bergaul dengan keduanya di dunia ini dengan baik dalam hal-hal yang bukan menagndung dosa. Dan tempuhlah olehmu (Wahai anak yang beriman) jalan orang-orang yang bertaubat dari dosanya, yang kembali kepadaKu, beriman kepada utusanKu, Muhammad, kemudian hanya kepadaKu-lah tempat kembali kalian lalu Aku mengabarkan kepada kalian apa yang dulu kalian kerjakan di dunia dan Aku membalas setiap orang sesuai dengan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Jika keduanya berupaya keras untuk memaksamu agar kamu menyekutukan Allah dengan selain-Nya, maka janganlah kamu taati keduanya dalam hal ini, karena tidak boleh taat kepada makhluk ciptaan dalam kemaksiatan terhadap Sang Pencipta, dan tetaplah berinteraksi dengan keduanya di dunia dengan cara berbakti, menjaga silaturahmi dan berbuat baik. Dan ikutilah jalan orang-orang yang kembali kepada-Ku dengan tauhid dan ketaatan, kemudian hanya kepada-Ku lah tempat kembali kalian pada hari Kiamat nanti, lalu Aku kabarkan kepada kalian tentang perbuatan yang telah kalian lakukan di dunia dan Aku akan membalas perbuatan itu atas kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Dan jika kedua orangtuamu merusaha menyeretmu ke dalam kesyirikan dalam menyembah Allah dengan sesuatu yang tidak kamu ketahui, maka janganlah kamu mentaati mereka berdua. Namun tetaplah perlakukan mereka dengan baik dalam urusan dunia -meskipun mereka berdua masih musyrik-. Dan ikutilah jalan orang yang bertaubat dan ikhlas kepada Allah. Kemudian kalian akan kembali kepada-Ku, untuk Aku sampaikan hal-hal besar tentang amal perbuatan kalian yang baik maupun yang buruk ketika di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَإِن جٰهَدَاكَ عَلَىٰٓ أَن تُشْرِكَ بِى مَا لَيْسَ لَكَ بِهِۦ عِلْمٌ (Dan jika keduanya memaksamu untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu) Yakni mempersekutukan Aku dengan apa yang tidak kamu ketahui bahwa itu adalah sekutu-Ku. فَلَا تُطِعْهُمَا ۖ( maka janganlah kamu mengikuti keduanya) Dalam hal ini. وَصَاحِبْهُمَا فِى الدُّنْيَا مَعْرُوفًا ۖ (dan pergaulilah keduanya di dunia dengan baik) Dengan berbuat baik kepada keduanya, meskipun mereka telah memaksamu untuk menyekutukan Allah. وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَىَّ ۚ (dan ikutilah jalan orang yang kembali kepada-Ku) Yakni ikutilah jalan orang yang kembali kepada-Ku dari orang-orang yang shalih dengan bertaubat dan keikhlasan. ثُمَّ إِلَىَّ مَرْجِعُكُمْ فَأُنَبِّئُكُم(kemudian hanya kepada-Kulah kembalimu, maka Kuberitakan kepadamu) Yakni kemudian Aku akan mengabarkan kalian ketika kalian kembali kepada-Ku. بِمَا كُنتُمْ تَعْمَلُونَ(apa yang telah kamu kerjakan) Berupa perbuatan baik dan buruk agar Aku balas setiap orang yang mengerjakannya. Kemudian pada ayat selanjutnya Allah kembali meneruskan pembahasan tentang nasehat Luqman kepada anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Namun, jika kedua orang tua bersikeras untuk mengajak putera mereka untuk menyekutukan Allah. Tidak akan pernah ada bukti bahwa Allah memiliki sekutu, maka jangan engkau taati mereka. Sesungguhnya perbuatan syirik adalah perbuatan yang dzalim. Tidak ada tuntunan untuk mentaati manusia dalam hal maksiat kepada Allah. Namun berbuat baik dan berbakti kepada kedua orang tua tetap menjadi kewajiban seorang anak. Ikutilah jalan orang-orang yang senantiasa bertaubat kepada-Ku, melakukan ketaatan dan senantiasa ikhlas. Kalian semua wahai manusia akan kembali kepada-Ku, bukan kepada selain-Ku. Aku akan memberitahu kalian atas amal baik dan buruk yang kalian lakukan. Setiap orang akan aku beri balasan atas setiap perbuatan yang telah mereka lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika keduanya memaksamu} berusaha dan memaksamu {untuk menyekutukanKu dengan sesuatu yang tidak kamu ketahui tentang itu, maka janganlah mematuhi keduanya, temanilah keduanya di dunia dengan baik} dengan baik yang diperintahkan syariat dan memberikan kehormatan {dan ikutilah jalan} jalan {orang yang kembali kepadaKu} yang kembali kepadaKu dengan bertaubat dan taat {Kemudian hanya kepadaKulah kalian kembali, lalu Aku memberitahu kalian} memberitahu kalian {apa yang biasa kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Dan jika keduanya memaksamu,” maksudnya, kedua ibu bapakmu bersikeras “untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mematuhi kepadanya,” dan jangan sekali-kali kamu mengira bahwa yang demikian ini termasuk berbuat baik kepada keduanya; sebab hak Allah harus lebih diutamakan atas hak semua orang, dan tidak ada kepatuhan kepada makhluk dalam kemaksiatan terhadap sang khaliq. Di sini Allah tidak mengatakan, “Dan jika keduanya memaksamu untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu, maka durhakailah mereka berdua,” melainkan Allah mengatakan, “maka janganlah kamu mematuhi keduanya,” yakni dalam kesyirikan. Adapun berbuat baik kepada keduanya, maka terus lakukanlah. Maka dari itu Allah berfirman sesudahnya, “Dan pergaulilah keduanya di dunia dengan baik,” maksudnya, dengan pergaulan ihsan kepada mereka dengan cara yang baik. Adapun tentang “mengikuti keduanya”, sedangkan keduanya dalam kondisi kafir dan maksiat, maka (dalam hal ini) jangan kamu ikuti, “dan ikutilah jalan orang yang kembali kepadaKU.” Mereka adalah orang-orang yang beriman kepada Allah, kepada para malaikatNya, kitab-kitabNya, dan para rasulNya, yang berserah diri kepada Rabb (Allah), yang kembali kepadaNya. Mengikuti jalan mereka berarti menempuh jalan mereka dalam berinabah kepada Allah, inabah yang merupakan ketertarikan hasrat-hasrat hati dan kemauannya kepada Allah, lalu diikuti oleh usaha dengan badan dalam hal-hal yang diridhai Allah dan mendekatkan kepadaNya. “Kemudian hanya kepadaKu-lah kembalimu,” baik yang taat maupun yang durhaka, yang berinabah maupun yang tidak, “maka Kuberitakan kepadamu amal yang telah kamu kerjakan,” maka tidak ada satu pun dari amal perbuatan mereka yang tersembunyi dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 15: Ketahuilah wahai manusia, jika kedua orang tuamu bersungguh-sungguh untuk menyeru kepada kesyirikan kepada Allah; Maka janganlah engkau mentaati keduanya, jangan pula mengikuti keduanya, karena sebab tidak ada ketaatan kepada makhluk dalam bermaksiat kepada sang Pencipta. Akan tetapi janganlah berbuat kasar dan buruk kepada keduanya; Bahkan pergaulilah mereka berdua dengan kebaikan dan ihsan, jadikanlah kebaikan pada keduanya, dan ikutilah jalan yang kembali kepada Allah dengan taubat, ikhlas dan kokohkanlah di atas jalan tersebut. Kepada Allah kalian kembali, maka Allah akan mengabarkan atas amalan-amalan kalian dan membalasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jangan kamu kira bahwa menaati orang tua yang menyuruh berbuat syirk termasuk berbuat ihsan kepada keduanya, karena hak Allah harus didahulukan atas hak semua manusia. Allah Subhaanahu wa Ta'aala tidak mengatakan, “Maka durhakailah kedua orang tua, “ tetapi mengatakan, “maka janganlah engkau menaati keduanya,” karena berbuat baik harus tetap dilakukan kepada kedua orang tua, tetapi ketika kedua orang tua menyuruh kufur dan maksiat, seperti berbuat syirk, maka tidak boleh ditaati. Mereka ini adalah orang-orang yang beriman kepada Allah, malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, hari akhir dan qadar, lagi berserah diri dan kembali kepada Tuhannya. Mengikuti jalan mereka adalah menempuh jalan mereka ketika kembali kepada Allah, yaitu dengan menarik hati lalu badan untuk mengerjakan perbuatan yang diridhai Allah dan mendekatkan diri kepada-Nya. Firman-Nya, “Dan ikutilah jalan orang yang kembali kepada-Ku.” Terdapat dalil perintah mengikuti para sahabat, karena mereka adalah orang-orang yang sangat semangat sekali kembali kepada Allah, terutama para khalifah rasyidin radhiyallahu 'anhum, dan ayat ini juga menunjukkan bahwa ucapan mereka (para sahabat) adalah hujjah. Baik yang taat maupun yang bermaksiat. Karena tidak ada satu pun amalmu yang luput dari pantauan Allah, dan selanjutnya Dia akan memberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 15",
    "description": "Meski taat kepada kedua orang tua berada pada posisi setara dengan menyembah Allah, ia tidak bersifat mutlak. Jika keduanya atau salah satunya memaksamu secara sungguh-sungguh untuk mempersekutukan aku dengan sesuatu yang engkau tidak mempunyai pengetahuan tentang itu, terlebih jika engkau tahu besarnya dosa syirik, maka janganlah engkau menaati keduanya. Namun, jagalah hubungan baikmu dan pergaulilah keduanya di dunia dengan baik, bahkan terbaik, selama keduanya tidak mencampuri urusan agamamu. Dan ikutilah jalan orang yang selalu kembali kepada-ku dalam segala urusannya. Kemudian, hanya kepada-ku tempat kembalimu di akhirat kelak, maka akan aku beritahukan kepadamu apa yang telah kamu kerjakan dan aku akan memberi balasan sesuai amal perbuatanmu di dunia. 16. Lukman melanjutkan nasihatnya, 'wahai anakku! sungguh, jika ada suatu perbuatan yang sangat kecil dan tersembunyi, layaknya benda yang bobotnya hanya seberat biji sawi dan berada dalam batu atau berada di langit atau di perut bumi, niscaya Allah akan memberinya balasan. Sesungguhnya Allah mahahalus, mahateliti. Ilmu Allah meliputi segala sesuatu, betapa pun kecil dan halus."
  }
]