[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai anakku, ketahuilah bahwa keburukan dan kebaikan, sekalipun itu sekecil biji sawi (maksudnya sangat kecil) di perut gunung atau di mana pun di langit dan di bumi, maka Allah akan mendatangkannya di Hari Kiamat dan menghisabnya. Sesungguhnya Allah Mahalembut kepada hamba-hambaNya, juga Maha teliti terhadap perbuatan-perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. “Wahai anakku! Sesungguhnya keburukan dan kebaikan itu meski kecil seperti beratnya biji sawi dan berada di dalam batu yang tidak diketahui oleh seorang pun, atau berada di tempat manapun di langit atau di bumi, sesungguhnya Allah akan mendatangkannya pada hari Kiamat lalu membalaskannya kepada hamba. Sesungguhnya Allah Maha lembut terhadap hamba-hamba-Nya dan Maha Mengetahui perihal mereka, tidak ada sesuatu pun dari urusan mereka yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Luqman kembali menyeru anaknya dengan lembut agar perkataannya lebih mudah diterima: “Wahai anakku, jika terdapat kebaikan atau keburukan seberat biji sawi -yang merupakan biji yang paling kecil- baik itu yang ada di atas batu, atau di tempat manapun di langit yang tujuh atau di bumi yang tujuh; maka Allah pasti akan mendatangkan dan memperhitungkannya pada hari kiamat. Sungguh Allah Maha Lembut kepada hamba-hamba-Nya dan Maha Mengetahui keadaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. يٰبُنَىَّ إِنَّهَآ إِن تَكُ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ (“Hai anakku, sesungguhnya jika ada (sesuatu perbuatan) seberat biji sawi) Yakni suatu perbuatan buruk meski seberat biji sawi sebagai biji yang paling kecil, yang tidak dapat diukur dengan timbangan فَتَكُن فِى صَخْرَةٍ(dan berada dalam batu) Dan berada di tempat yang paling tersembunyi أَوْ فِى السَّمٰوٰتِ أَوْ فِى الْأَرْضِ(atau di langit atau di dalam bumi) Atau di suatu tempat di langit atau bumi يَأْتِ بِهَا اللهُ ۚ( niscaya Allah akan mendatangkannya (membalasnya)) Allah pasti akan mendatangkannya dan menghisab pelakunya. إِنَّ اللهَ لَطِيفٌ(Sesungguhnya Allah Maha Halus) Ilmu-Nya sampai dengan mudah kepada hal yang tersembunyi. خَبِيرٌ (lagi Maha Mengetahui) Maha Mengetahui segala sesuatu, tidak ada yang tersembunyi bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Wahai anakku, walaupun perbuatan baik atau burukmu yang kau lakukan sebesar biji sawi atau sekecil biji yang paling kecil, atau juga yang tersembunyi di dalam batu atau tempat yang paling tersembunyi sekalipun, bahkan di langit, di bumi, atau di manapun itu, Allah akan tetap menunjukkan dan memberi balasan atas amal perbuatan itu. Sesungguhnya Allah Maha Lembut untuk mengeluarkannya dan Maha Tahu dimanapun tempatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Wahai anakku, sesungguhnya jika ada} sesungguhnya amal manusia {seberat} seberat {biji sawi} biji paling kecil {dan berada dalam batu} di dalam lubang batu {di langit, atau di bumi, niscaya Allah akan mendatangkannya} Allah akan menghadirkannya pada hari kiamat dan menghitungnya {Sesungguhnya Allah Maha lembut lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Hai anakku, sesungguhnya jika ada satu perbuatan seberat biji sawi” yang merupakan biji yang paling kecil dan paling hina, “dan berada dalam batu,” di tengah-tengahnya, “atau di langit atau di dalam bumi,” maksudnya di dalam salah satu penjurunya, “niscaya Allah akan membalasnya,” karena betapa sangat luasnya pengetahuan Allah, kesempurnaan ilmuNya dan kesempurnaan kekuasaanNya. Maka dari itu Allah berfirman, “Sesungguhnya Allah Mahaluas lagi Maha Mengetahui,” maksudnya, halus dalam ilmu dan pengetahuanNYa sehingga Dia mengetahui segala hal yang tersembunyi, rahasia daratan dan lautan. Maksudnya adalah: Himbauan untuk untuk bermuraqabah (mawas diri) kepada Allah dan beramal melakukan ketaatan kepadaNya semampu mungkin, sedikit atau banyak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 16: Kemudian berkata lukman kepada anaknya : Wahai anakku, sungguh amalanmu akan ditimbang walaupun kecil seperti debu di bawah batu besar atau sekecil apapun amalanmu baik di langit maupun di bumi, tak akan pernah luput dari Allah; Bahkan Allah akan mendatangkan amalan tersebut dan Allah akan hisab atas amalanmu. Sungguh Allah maha lembut kepada hama-Nya, maha kuasa atas amalan-amalan hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu sesuatu yang paling kecil dan tidak dipedulikan. Karena ilmu-Nya yang luas, sempurnanya ketelitian-Nya, dan sempurnanya kemampuan-Nya. Dia halus dalam pengetahuan dan ketelitian-Nya sehingga mengetahui secara detail dan mengetahui sesuatu yang tersembunyi dan rahasia. Maksud ayat ini adalah untuk mendorong manusia untuk memiliki rasa pengawasan Allah, mengerjakan ketaatan sesuai kemampuan, serta menakut-nakuti agar tidak mengerjakan keburukan, besar atau kecil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 16",
    "description": "Lukman melanjutkan nasihatnya, 'wahai anakku! sungguh, jika ada suatu perbuatan yang sangat kecil dan tersembunyi, layaknya benda yang bobotnya hanya seberat biji sawi dan berada dalam batu atau berada di langit atau di perut bumi, niscaya Allah akan memberinya balasan. Sesungguhnya Allah mahahalus, mahateliti. Ilmu Allah meliputi segala sesuatu, betapa pun kecil dan halus. 17. Wahai anakku! laksanakanlah salat secara sempurna dan konsisten, jangan sekali pun engkau meninggalkannya, dan suruhlah manusia berbuat yang makruf, yakni sesuatu yang dinilai baik oleh masyarakat dan tidak bertentangan dengan syariat, dan cegahlah mereka dari yang mungkar dan bersabarlah terhadap apa yang menimpamu sebab hal itu tidak lepas dari kehendak-Nya dan bisa jadi menaikkan derajat keimananmu. Sesungguhnya yang demikian itu termasuk perkara yang penting dan tidak boleh diabaikan."
  }
]