[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai anakku, dirikanlah shalat dengan sempurna dengan rukun-rukun, syarat-syarat dan wajib-wajibnya. Perintahkanlah kepada yang baik dan cegahlah dari yang mungkar dengan lemah lembut dan hikmah sebatas kemampuanmu. Bersabarlah atas apa yang menimpamu dalam rangka beramar ma’ruf dan bernahi mungkar. Ketahuilah bahwa wasiat-wasiat ini termasuk perkara-perkara yang diperintahkan oleh Allah, yang patut dilakukan dengan penuh kemauan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Wahai anakku! Dirikanlah salat dengan mengerjakannya sesempurna mungkin, perintahkan kepada yang makruf dan laranglah dari yang mungkar serta bersabarlah terhadap kesusahan yang menimpamu dalam melaksanakan perintah itu, sesungguhnya apa yang kamu perintahkan itu merupakan hal-hal yang diwajibkan Allah kepadamu, maka kamu tidak punya pilihan lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Wahai anakku, dirikanlah shalat pada waktunya dan dengan syarat-syaratnya, perintahkanlah orang lain untuk mentaati Allah, laranglah mereka dengan penuh hikmah dari kemaksiatan, dan bersabarlah atas perlakuan orang lain terhadapmu saat kamu berdakwah kepada mereka; sungguh kesabaran itu adalah perkara yang agung, dan ia merupakan perkara yang patut diperhatikan dan dipertahankan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. يٰبُنَىَّ أَقِمِ الصَّلَوٰةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنكَرِ وَاصْبِرْ عَلَىٰ مَآ أَصَابَكَ ۖ (Hai anakku, dirikanlah shalat dan suruhlah (manusia) mengerjakan yang baik dan cegahlah (mereka) dari perbuatan yang mungkar dan bersabarlah terhadap apa yang menimpa kamu) Dia mengkhususkan penyebutan ibadah-ibadah ini karena ini merupakan ibadah yang paling utama dan asas kebaikan. إِنَّ ذٰلِكَ(Sesungguhnya yang demikian itu) Yakni ibadah-ibadah yang disebutkan tadi. مِنْ عَزْمِ الْأُمُورِ(termasuk hal-hal yang diwajibkan (oleh Allah)) Yakni hal-hal yang Allah wajibkan kepada hamba-hamba-Nya. Dan kemungkinan maksud dari kalimat ini bahwa hal-hal ini merupakan bagian dari kebaikan-kebaikan yang dilakukan oleh orang yang memiliki akhlak yang mulia dan perbuatan yang pasti dilakukan oleh orang yang teguh dalam beragama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Wahai anakku, dirikanlah shalat sesuai dengan waktunya dengan menyempurnakannya, dan ajak dan perintahkanlah manusia untuk berbuat kebaikan. Yaitu segala sesuatu yang mengandung kebaikan. Laranglah manusia dari perbuatan tercela/mungkar, yaitu segala yang mengandung kejelekan. Juga bersabaarlah atas musibah-musibah dan kesulitanmu. Sesungguhnya melakukan nasihat-nisihat ini merupakan ketetapan perkara wajib yang harus dilakukan manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai anakku, tegakkanlah shalat dan suruhlah berbuat yang makruf dan cegahlah dari yang mungkar serta bersabarlah terhadap apa yang menimpamu. Sesungguhnya yang demikian itu termasuk urusan yang diutamakan} yang ditetapkan dan diperintahkan oleh Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Hai anakku, dirikanlah shalat,” Luqman mengajak anaknya shalat dan menganjurkannya, karena shalat merupakan ibadah badaniyah yang paling besar, “dan suruhlah mengerjakan yang baik dan cegahlah dari perbuatan yang mungkar,” hal ini mengharuskan adanya ilmu pengetahuan kepada yang baik untuk memerintahkan padanya, dan pengetahuan kepada yang baik untuk memerintahkan padanya, dan pengetahuan kepada yang mungkar agar ia bisa mengingkarinya, dan perintah melakukan hal-hal yang mana amar ma’ruf dan nahi mungkar tidak akan bisa dilakukan secara sempurna kecuali dengannya, seperti sikap lembut dan sabar. Sesungguhnya sabar ini telah ditegaskan dalam FirmanNya, “Dan bersabarlah terhadap apa yang menimpa kamu,” dan dari keberadaannya sebagai orang yang mengerjakan apa yang diperintahkan kepadanya, menahan diri dari apa yang dilarang. Maka hal ini mencakup penyempurnaan diri dengan cara mengerjakan kebaikan dan meninggalkan keburukan dan menyempurnakan orang lain dengannya melalui perintah dan larangannya. Dan ketika sudah dimaklumi bahwa pasti akan mendapatkan cobaan apabila dia (seseorang) melakukan amar ma’ruf dan nahi mungkar, dan bahwa dalam melakukan amar ma’ruf dan nahi mungkar itu terdapat banyak rintangan bagi jiwa, maka Allah memerintahkan kepadanya unttuk bersabar dalam menghadapi semua itu, seraya berkata, “Dan bersabarlah terhadap apa yang menimpa kamu. Sesungguhnya yang demikian itu,” yang diajarkan dan dinasihatkan oleh Luqman kepada anaknya di atas “termasuk hal-hal yang diwajibkan” maksudnya, termasuk perkara yang ditekankan dan diperhatiakn, dan tidak ada yang dibimbing untuknya kecuali orang-orang yang mempunyai kemauan tinggi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 17: Kemudian berkata Lukman kepada anaknya : Wahai anakku, tegakkan shalat pada setiap waktunya, sempurnakan rukun-rukunnya, syarat-syaratnya, wajib-wajibnya dan sunnah-sunnahnya, kerjakan yang baik-baik dan jauhi kemunkaran karena ketahuilah, engkau akan ditimpa kejelekkan karena sebab hal itu, sabarlah bagimu dalam mengerjakan hal itu (perintah Allah dan menjauhi larangannya). Ketahuilah bahwa ketaatan yang tersebutkan dari perintah-perintah untuk ber azzam atas amalan-amanlan tersebut, dan perhatian atas amalan itu serta menjalankannya kecuali dikerjakan oleh ulul azmi (para Nabi yang 5) dan pemilik cita-cita yang tinggi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena ia merupakan ibadah yang paling besar. Hal ini menghendaki untuk mengetahui yang ma’ruf dan yang mungkar, demikian pula mengetahui sesuatu yang menyempurnakan amar ma’ruf dan nahi mungkar seperti lembut dan bersabar. Dalam ayat ini terdapat penyempurnaan terhadap diri dengan mengerjakan kebaikan dan meninggalkan keburukan, dan menyempurnakan orang lain dengan memerintah dan melarang. Oleh karena dalam memerintah dan melarang terdapat ujian, dan karena memerintah dan melarang berat dilakukan oleh jiwa, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk bersabar. Dan tidak ada yang diberi taufik kepadanya kecuali orang yang memiliki kemauan yang keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 17",
    "description": "Wahai anakku! laksanakanlah salat secara sempurna dan konsisten, jangan sekali pun engkau meninggalkannya, dan suruhlah manusia berbuat yang makruf, yakni sesuatu yang dinilai baik oleh masyarakat dan tidak bertentangan dengan syariat, dan cegahlah mereka dari yang mungkar dan bersabarlah terhadap apa yang menimpamu sebab hal itu tidak lepas dari kehendak-Nya dan bisa jadi menaikkan derajat keimananmu. Sesungguhnya yang demikian itu termasuk perkara yang penting dan tidak boleh diabaikan. 18. Dan janganlah kamu sombong. Janganlah kamu memalingkan wajah dari manusia secara congkak dan janganlah berjalan di muka bumi dengan angkuh. Bersikaplah tawaduk dan rendah hati kepada siapa pun. Sungguh, Allah tidak menyukai dan tidak pula melimpahkan kasih sayang-Nya kepada orang-orang yang sombong lagi membanggakan diri."
  }
]