[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan rendah hatilah saat berjalanmu, rendahkanlah suaramu dan jangan meninggikannya. Sesungguhnya suara yang paling buruk dan paling dibenci adalah suara keledai yang terkenal dengan kedunguan dan suaranya yang melengking jelek."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan sederhanalah dalam cara berjalanmu antara cepat dan lambat, yaitu cara berjalan yang menunjukkan ketenangan, dan pelankanlah suaramu, jangan engkau meninggikannya yang bisa menyakiti orang lain, sesungguhnya seburuk-buruk suara adalah suara keledai karena suaranya yang tinggi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Dan bertawadhu’-lah saat berjalan dan rendahkanlah suaramu, sungguh suara yang paling buruk adalah suara keledai."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَاقْصِدْ فِى مَشْيِكَ (Dan sederhanalah kamu dalam berjalan) Disebutkan bahwa Rasulullah berjalan dengan cepat. Makna ayat ini adalah janganlah kamu menyombongkan diri dalam gaya berjalanmu. ‘Atha berkata, maknanya adalah berjalanlah dengan tenang dan tidak tergesa-gesa. وَاغْضُضْ مِن صَوْتِكَ ۚ( dan lunakkanlah suaramu) Yakni perhalus dan rendahkanlah suaramu, dan janganlah kamu mengangkatnya tanpa keperluan, sebab mengangkat suara lebih dari kebutuhannya akan mengganggu orang yang mendengarnya. إِنَّ أَنكَرَ الْأَصْوٰتِ لَصَوْتُ الْحَمِيرِ(Sesungguhnya seburuk-buruk suara ialah suara keledai) Yakni yang paling jelek dan buruk, awal suaranya adalah ringkihan dan akhirnya adalah rengekan; hal ini seperti orang yang mengangkat suara tanpa keperluan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. 19. Sederhankanlah cara berjalanmu, tidak usah terlalu cepat juga tidak usah terlalu lambat. Rendahkanlah suaramu ketika berbicara kepada orang lain. Sesungguhnya sejelek-jelek suara adalah suara keledai, mula-mula mengeluarkan nafas panjang lalu akhirnya adalah ringkihan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sederhanalah dalam berjalan} berlaku tengah-tengahlah dalam berjalan, yaitu antara cepat dan lambat dengan tenang dan penuh wibawa {lembutkanlah} rendahkanlah {suaramu. Sesungguhnya seburuk-buruk} seburuk-buruk {suara ialah suara keledai”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dan sederhanalah kamu dalam berjalan,” maksudnya, berjalanlah dengan tawadhu’ (merendahkanh diri) dan tenang, tidak dengan angkuh dan sombong, dan juga bukan jalan pura-pura mati, “dan lunakkanlah suaramu,” sebagai etika terhadap orang lain dan terhadap Allah. “Sesungguhnya seburuk-buruk suara,” yakni, yang paling keji dan paling norak “ialah suyara keledai,” kalau seandainya dalam meninggikan suara itu ada faidah dan maslahatnya, tentu Allah tidak mencontohkan dengan suara keledai yang telah dimaklumi kekejian dan keduanguannya. Wasiat-wasiat yang dipesankan oleh Luqman kepada anak-anaknya ini menghimpun pokok-pokok hikmah dan mengharuskan adanya sesuatu yang belum disebutkan darinya. Setiap wasiat disertai dengan faktor-faktor yang mendorong untuk melakukannya jika wasiat itu berbentuk perintah, dan faktor pendorong untuk meninggalkannya jika wasiat itu berbentuk larangan, dan hal itu menunjukkan kepada apa yang telah telah kami sebutkan tentang tafsir hikmah, yaitu mengetahui hukum-hukum , hikmah-hikmahnya dan korelasi-korelasinya. Oleh karena itu, Allah memerintahkan pokok agama, yaitu tauhid, dan Allah melarangnya dari syirik, dan Allah menjelaskan kepadanya faktor yang mewajibkan meninggalkan syirik. Dan Dia juga memerintahkan berbakti kepada ibu dan bapak lalu Dia jelaskan pula sebab yang mewajibkan untuk berbakti kepada orang tua. Dan Allah memerintahkannya untuk bersyukur kepadaNya dan bersyukur kepada kedua ibu bapaknya, kemudian menggariskan bahwa letak berbuat baik kepada kedua orang tua dan mematuhi perintah mereka itu selagi mereka tidak memerintahkan kemaksiatan. Namun demikian, dia tidak boleh durhaka, akan tetapi harus tetap berbuat baik kepada mereka, sekalipun dia tidak boleh taat kepada mereka bila mereka memaksa untuk berbuat syirik. Kemudian Allah memerintahkan bersikap muraqabah kepada Allah dan takut akan perjumpaan denganNya; dan bahwa Allah sama sekali tidak mengabaikan kebaikan ataupun keburukan sekecil dan secesar apa pun, melainkan pasti didatangkanNYa; dan Allah melarangnya bersikap sombong dan memerintahkan kepadanya bersikap tawadhu’ (rendah diri) serta melarangnya bersikap angkuh, congkak dan sombong. Dan Dia juga memerintahnya beramar ma’ruf dan nahi mungkar, menegakkan shalat dan sabar, yang dengan keduanya segala persoalan menjadi ringan, seperti difirmankan Allah, \"Dan mintalah pertolongan (kepada Allah) dengan sabar dan (mengerjakan) salat. Dan sesungguhnya yang demikian itu sungguh berat, kecuali bagi orang-orang yang khusyuk,\" (Al-baqarah:45). Maka sangat pantas bagi orang yang mewasiatkan wasiat-wasiat di atas, kalau dia diutamakan dengan hikmah dan terkenal dengannya. Maka dari itu Allah mengingatkan akan karuniNya kepadanya (Luqman) dan kepada segenap hamba-hambaNYa dengan menceritakan kepada mereka sebagian dari hikmahNya yang dapat dijadikan suri tauladan oleh mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 19: Berkata lukman kepada anaknya : Wahai anakku, jika engkau berjalan, maka tawadhu’ lah kepada Allah dalam langkahmu, berjalanlah dengan penuh wibawa dan tenang, jika engkau berkata ringankah suaramu, janganlah engkau tinggikan sebagai adab kepada Allah kemudian kepada manusia, maka jika engkau tinggikan suaramu, hal itu adalah sebuah amalan yang buruk dan menyerupai suara keledai. Pada wasiat ini ada peringatan akan meninggikan suara dengan tanpa kebutuhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, ketika kamu berjalan, janganlah terlalu cepat dan jangan pula terlalu lambat. Atau berjalanlah dengan tawadhu’ dan tenang, tidak berjalan seperti orang sombong dan tidak berjalan seperti orang yang lemah. Yakni jangan berlebihan dalam berbicara dan janganlah meninggikan suara dalam hal yang tidak perlu sebagai adab terhadap Allah dan terhadap manusia. akni orang yang mengeraskan suara dan meninggikannya adalah seperti keledai bersuara. Wasiat Luqman kepada anaknya mengandung hukum-hukum penting. Luqman memerintahkan kepada anaknya dasar agama, yaitu tauhid dan melarangnya berbuat syirk, serta menerangkan pula sebab untuk menjauhinya. Beliau juga memerintahkan berbakti kepada kedua orang tua dan menerangkan sebab yang mengharuskan untuk berbakti kepada keduanya. Beliau juga memerintahkan anaknya untuk bersyukur kepada Allah dan bersyukur kepada kedua orang tuanya, dan menerangkan, bahwa menaati perintah orang tua tetap dilakukan selama orang tua tidak memerintahkan berbuat maksiat, meskipun begitu, seseorang tetap tidak boleh mendurhakai orang tua, bahkan tetap berbuat baik kepada keduanya. Luqman juga memerintahkan anaknya agar memiliki rasa pengawasan Allah dan bahwa Dia tidaklah meninggalkan sesuatu yang kecil atau yang besar kecuali Dia akan mendatangkannya. Luqman juga melarang anaknya agar tidak bersikap sombong dan membanggakan diri, serta memerintahkan untuk bertawadhu’, dan memerintahkannya agar tenang dalam bergerak dan agar merendahkan suara. Demikian pula Beliau memerintahkan anaknya beramar ma’ruf dan bernahi mungkar serta tetap mendirikan shalat dan berlaku sabar, di mana dengan keduanya (shalat dan sabar), maka semua masalah menjadi mudah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 19",
    "description": "Dan jika engkau melangkahkan kakimu, sederhanakanlah dalam berjalan, jangan terlalu cepat atau terlalu lambat. Dan lunakkanlah suaramu ketika sedang berbicara agar tidak terdengar kasar seperti suara keledai, karena sesungguhnya seburuk-buruk suara ialah suara keledai. '20. Titik berat nasihat-nasihat yang lukman berikan kepada anaknya adalah larangan berbuat. Melaui ayat ini Allah mengecam mereka yang berlaku syirik padahal di depan matanya terhampar bukti-bukti keesaan-Nya. Tidakkah kamu memperhatikan dengan saksama bahwa Allah telah menundukkan apa yang ada di langit dan apa yang ada di bumi untuk kepentingan-Mu dan memenuhi kebutuhanmu' dia juga menyempurnakan nikmat-Nya untukmu yang bersifat lahir seperti harta dan jabatan, dan yang bersifat batin seperti ilmu, kesehatan, dan keimanan. Akan tetapi, di antara manusia ada yang membantah tentang risalah nabi Muhammad, syariat, dan keesaan Allah dengan bantahan tanpa dasar ilmu atau petunjuk yang benar dan tanpa kitab yang memberi penerangan dan bimbingan menuju kebenaran."
  }
]