[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ayat-ayat ini adalah ayat-ayat al-Qur’an yang mengandung hikmah yang mendalam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Ayat-ayat yang diturunkan kepadamu ini -wahai Rasul- adalah ayat-ayat Al-Kitab (Al-Qur`ān) yang mengungkapkan hikmah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-4. Ayat-ayat yang agung ini merupakan ayat-ayat Al-Qur’an yang penuh hikmah dalam hukum-hukum dan pelajarannya, sebagai petunjuk bagi para hamba menuju jalan yang benar dan rahmat bagi orang-orang yang baik dalam perkataan dan perbuatannya, mendirikan shalat pada waktunya dan dengan menyempurnakan syarat-syaratnya, dan menunaikan zakat bagi orang-orang yang berhak menerimanya. Mereka senantiasa memiliki keyakinan yang kuat tentang hari akhir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Ayat-ayat yang disebutkan dalam surah ini adalah ayat-ayat Al-Qur’an yang menerangkan tentang hikmah, yaitu meletakkan sesuatu pada tempatnya yang sesuai yaitu tempat yang penuh hikmah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah ayat-ayat kitab (Al-Qur’an) yang penuh hikmah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Alllah mengisyaratkan suatu isyarat yang bermakna ta’zhim (mengagungkan) kepada “ayat-ayat al-qur’an yang mengandung hikmah,” maksudnya, ayat-ayat mahkumat yang bersumber dari Yang Mahabijaksana lagi Maha Mengetahui. Di antara kehikmahanya adalah, ia datang dengan lafazh-lafazh yang paling tinggi, paling fasih dan paling jelas, yang menunjukkan kepada makna-makna yang paling tinggi dan paling baik. Di antara kehikmahannya adalah, ia terpelihara dari perubahan, penggantian, penambahan, pengurangan dan tahrif. Termasuk kehikmahannya juga adalah bahwa seluruh yang ada di dalamnya, berupa berita-berita tentang yang telah lampau dan yang akan datang serta perkara-perkara ghaib, semuanya sesuai dengan kenyataan pun sesuai dengannya, sama sekali tidak ditentang oleh satu kitab pun dari kitab-kitab suci ilahi, dan tidak ada seorang nabi pun yang mengabarkan sesuatu yang beretentangan dengannya, dan tidak pernah datang dan tidak akan pernah datang suatu ilmu yang bersifat indrawi maupun yang logis nan shahih yang akan bertentangan dengan sesuatu yang dikandungnya. Termasuk kehikmahannya pula adalah bahwa ayat-ayat tersebut tidak pernah memerintahkan sesuatu kecuali ia adalah suatu yang murni kemaslahatan dan yang rajih. Dan tidak pula ia melarang sesuatu melainkan ia adalah suatu yang murni kerusakan atau yang dinyatakan marjuh pada kerusakan. Dan banyak sekali ia memadukan antara perintah pada sesuatu dengan menyebutkan hikmah dan faidahnya, dan larangan dari sesuatu disertai dengan menyebutkan bahayanya. Di anatara kehikmahannya adalah ia memadukan antara targhib (memberikan motivas) dan tarhib (memberikan ancaman), dan nasihat-nasihat yang dengannya jiwa yang baik menjadi lurus dan mampu mengambil keputusan lalu beramal dengan penuh tekad. Di antara kehikmahannya juga adalah, bahwa anda menjumpai ayat-ayatnya yang diulang-ulang, seperti kisah-kisah, hukum-hukum dan yang serupa dengannya, semuanya senada dan sepakat. Jadi, tidak ada kontradiksi ataupun perselisihan di dalamnya. Maka, apabila seseorang yang meneliti semakin menghayatinya dan semakin mengaktifkan akalnya untuk merenungkannya, niscaya akalnya menjadi tercengang-cengang dan hatinya menjadi terpedaya karena keserasian dan kesamaannya, dan ia memastikan dengan sebenar-benarnya tanpa keraguan padanya, bahwasannya al-qur’an ini berasal dari Dzat Yang Mahabijaksana lagi Mahaterpuji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 2: Surat ini dimulai dengan isyarat yang bahwasanya ayat-ayat dalam surat ini diturunkan kepada Nabi ﷺ, yaitu ayat-ayat Al Qur’an yang muhkan (jelas) di mana tidak ada padanya kebathilan dan juga kerusakan, Al Qur’an terjaga dari perubahan dan penyerupaan, ia adalah petunjuk kepada jalan yang lurus dan yang mengantarkan kepada ridha Allah dan juga surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengisyaratkan dengan isyarat yang menunjukkan keagungan kepada ayat-ayat Al Qur’an ini. Ayat-ayatnya penuh hikmah (bijaksana), turun dari Yang Mahabijaksana lagi Maha Mengetahui. Di antara kebijaksanaannya adalah bahwa ayat-ayat tersebut datang dengan lafaz yang begitu jelas dan fasih, lagi menunjukkan makna yang paling agung dan paling baik. Termasuk kebijaksanannya pula adalah semua yang ada di dalamnya berupa berita yang lalu dan yang akan datang serta berita gaib semuanya sesuai kenyataan, tidak diselisihi oleh satu kitab pun di antara kitab-kitab samawi yang masih murni, dan tidak menyalahi berita yang disampaikan para nabi, di samping itu tidak ada ilmu yang dirasakan dan ilmu yang masuk akal menyalahi apa yang ditunjukkan oleh ayat-ayatnya. Termasuk kebijaksanaan ayat-ayatnya adalah ia tidaklah memerintahkan kecuali yang murni maslahat atau lebih kuat maslahatnya, dan tidaklah ia melarang kecuali yang murni mafsadat atau lebih kuat mafsadatnya, dan pada umumnya ia tidaklah memerintahkan sesuatu kecuali menyebutkan hikmah dan faedahnya, serta tidak melarang sesuatu kecuali menyebutkan bahayanya. Termasuk kebijaksanaannya adalah ia menggabung antara targhib dan tarhib (dorongan dan ancaman), dan nasehatnya begitu menyentuh. Termasuk kebijaksanaannya adalah adanya pengulangan, seperti pada kisah, hukum, dan sebagainya, agar tetap diingat di mana semuanya bersesuaian, dan tidak bertentangan. Oleh karena itu, setiap kali orang yang berpandangan tajam mentadabburinya dan menggerakkan akal pikirannya untuk merenunginya, maka akalnya akan terkagum-kagum kepadanya karena kesesuaiannya, sehingga ia akan memastikan bahwa ia turun dari yang Mahabijaksana lagi Maha terpuji. Akan tetapi, meskipun ayat-ayatnya begitu bijaksana dan mengajak kepada akhlak yang bijaksana serta melarang akhlak yang buruk, namun banyak manusia yang tidak mengambilnya menjadi petunjuk, berpaling dari beriman kepadanya dan mengamalkannya kecuali orang yang Allah beri taufik dan Allah jaga, yaitu mereka yang berbuat ihsan dalam beribadah dan berbuat ihsan kepada hamba-hamba Allah. Maka ayat-ayatnya menjadi petunjuk dan rahmat bagi mereka sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 2",
    "description": "1-3. Alif l'm m'm. Inilah ayat-ayat Al-Qur'an yang meski tersusun dari huruf-huruf yang dikenal oleh masyarakat arab namun mereka tidak mampu membuat tandingannya. Inilah ayat-ayat yang mengandung hikmah dan pelajaran yang tidak bertentangan antara satu ayat dengan lainnya. Kami turunkan Al-Qur'an ini sebagai petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan, yaitu mereka yang senantiasa beramal saleh dengan ikhlas"
  }
]