[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian tidak melihat (wahai manusia) bahwa Allah telah menundukkan apa yang ada di langit untuk kalian, yaitu matahari, rembulan, awan dan lainnya, dan apa yang ada di bumi berupa hewan-hewan, pohon-pohon, air dan lainnya yang tidak terhitung, Dia melimpahkan nikmatNya yang lahir kepada kalian pada badan dan anggota badan kalian, dan nikmat batin pada akal dan hati serta apa yang Dia simpan untuk kalian yang tidak kalian ketahui? Dan diantara manusia ada yang mendebat dala hal keesaan Allah dan keikhlasan ibadah kepadaNya tanpa hujjah dan keterangan, tanpa kitab yang nyata yang mendukung kebenaran klaimnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Tidakkah kalian melihat dan menyaksikan -wahai manusia- bahwa Allah telah memudahkan bagi kalian untuk memanfaatkan apa yang berada di langit, mulai dari matahari, bulan dan bintang-bintang, dan Allah juga memudahkan bagi kalian apa yang ada di bumi berupa hewan-hewan, pepohonan dan tumbuh-tumbuhan, dan Dia menyempurnakan nikmat-Nya kepada kalian secara kasat mata seperti bentuk yang indah dan perilaku yang bagus, dan secara tidak kasat mata dan tersembunyi, seperti akal dan ilmu. Dengan adanya berbagai kenikmatan ini, di antara manusia ada yang menentang tauhidullah (pengesaan Allah) tanpa didasari ilmu yang bersandar pada wahyu dari Allah atau pada akal yang bersinar ataupun pada kitab yang jelas, yang diturunkan dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-21. Hai para hamba, tidakkah kalian melihat bahwa Allah telah menciptakan bagi kalian apa yang ada di langit seperti matahari, bulan, dan bintang; dan apa yang ada di bumi berupa hewan, tumbuhan, sungai, dan lainnya; serta menyempurnakan bagi kalian kenikmatan-Nya yang tampak dan yang tersembunyi. Dan sebagian manusia membantah keesaan Allah tanpa memiliki hujjah, penjelasan, dan kitab yang jelas yang diturunkan Allah. Dan jika dikatakan kepada orang-orang yang lalai itu: “Ikutilah al-Qur’an yang diturunkan kepada rasul-Nya”, maka mereka menjawab: “Kami tidak mau mengikutinya, namun kami akan tetap di atas jalan nenek moyang kami yang menyembah patung dan berhala-berhala.” Kemudian Allah mengingkari dan mengolok mereka: “Apakah mereka akan tetap mengikuti nenek moyang mereka, meskipun mereka diajak setan menuju azab neraka yang bergejolak?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. أَلَمْ تَرَوْا۟ أَنَّ اللهَ سَخَّرَ لَكُم مَّا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ (Tidakkah kamu perhatikan sesungguhnya Allah telah menundukkan untuk (kepentingan)mu apa yang di langit dan apa yang di bumi) Yakni bentuk penundukannya bagi manusia adalah Allah menjadikan mereka dapat memanfaatkannya. Dan makhluk-makhluk yang ada di langit yang dapat dimanfaatkan oleh manusia adalah matahari, bulan, bintang, dan lain sebagainya, dan termasuk juga para malaikat, sebab mereka adalah makhluk yang diperintah Allah untuk menjaga manusia. Sedangkan makhluk-makhluk yang ada di bumi adalah bebatuan dan tanah, tanaman dan pepohonan, buah-buahan, hewan-hewan yang dapat mereka manfaatkan, rerumputan, dan lain sebagainya. وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُۥ ظٰهِرَةً وَبَاطِنَةً ۗ (dan menyempurnakan untukmu nikmat-Nya lahir dan batin) Yakni Allah menyempurnakan dan melengkapi nikmat-nikmat-Nya bagi kalian. Makna kenikmatan lahiriah adalah kenikmatan yang dapat dirasakan oleh akala tau panca indra seperti kesehatan, kesempurnaan tubuh, harta kekayaan, kedudukan, ketampanan, dan amalan-amalan ketaatan. Sedangkan makna kenikmatan batiniah adalah pengetahuan, akal, dan ilmu yang ia miliki tentang Allah dan keyakinan kepada-Nya, dan segala kekurangan yang dijauhkan Allah darinya. وَمِنَ النَّاسِ مَن يُجٰدِلُ فِى اللهِ(Dan di antara manusia ada yang membantah tentang (keesaan) Allah) Yakni tentang keesaan dan sifat-sifat Allah karena kesombongan dan kebebalan mereka setelah kebenaran menjadi jelas baginya dan hujjah yang telah ditegakkan atasnya. بِغَيْرِ عِلْمٍ(tanpa ilmu pengetahuan) Yakni tanpa landasan akal maupun wahyu. وَلَا هُدًى(atau petunjuk) Yakni petunjuk yang dapat mengantarkannya ke jalan yang benar. وَلَا كِتٰبٍ مُّنِيرٍ (dan tanpa Kitab yang memberi penerangan) Yakni kitab yang diturunkan Allah. Dan mereka melakukan perbantahan ini hanya karena kebebalan dan kedurhakaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Wahai manusia, apakah engkau tidak melihat bahwa Allah telah menundukkan segala apapun yang ada di langit, baik itu matahari, bulan, bintang, awan dan semuanya untuk kemanfaatan kalian? Juga segala yang ada di bumi baik itu buah-buahan, tanaman, sungai, hewan-hewan, bebatuandan semuanya untuk kemanfaatanmu. Allahpun telah meluaskan berbagai nikmat-Nya untuk kalian. Adh dhahirah adalah segala yang bisa dilihat, seperti kesehatan, harta benda, anak, keindahan, akhlak dan ketaatan. Adapun albathinah adalah segala yang tidak bisa diketahui dengan adanya bekas/bukti, seperti pengetahuan, akal, ridho/ikhlas, hasil ilmu, akidah dan keyakinan yang baik, Beberapa orang seperti orang Makkah terdahulu senang berdebat tentang keesaan Allah dan sifat-sifat-Nya dengan sombong dan keangkuhan, tanppa adanya ilmu atau dasar ilmiah baik bukti akal atau naqli. Juga tanpa petunjuk dari rasul, juga tanpa kitab yang diturunkan Allah yang menjadi petunjuk bagi mereka, namun hanya dengan meniru/taqlid"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian tidak memperhatikan bahwa sesungguhnya Allah telah menundukkan untuk kalian} menundukkan untuk kalian {apa yang ada di langit dan apa yang ada di bumi. Dia (juga) menyempurnakan} menyempurnakan {nikmat-nikmatNya yang lahir dan batin untuk kalian. Di antara manusia ada yang membantah} membantah {tentang Allah tanpa ilmu, petunjuk} dan tanpa petunjuk dan pandangan masuk akal yang menunjukkan kepada kebenaran {dan kitab suci yang menerangi} dan tidak ada kitab Tuhan yang menerangkan tentang dalil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-21. Allah menyebut-nyebut kebaikanNya kepada hamba-hambaNya berupa nikmat-nikmatNya dan mengajak mereka mensyukurinya, melihatnya dan tidak melupakannya, seraya berfirman, “TIdakkah kamu perhatikan.” Maksudnya, tidakkah kalian saksikan dan melihat dengan mata kepala dan hati nurani kalian “bahwa Allah telah menundukkan untukmu apa yang ada di langit,” berupa matahari, bulan, dan bintang-bintang, semuanya ditundukkan untuk kepentingan manusia”dan apa yang ada di bumi,” berupa bermacam-macam hewan, pepohonan, tanaman, sungai, barang tambang dan lain-lain, sebagaimana yang dikatakan oleh Allah, \"Dia-lah Allah, yang menjadikan segala yang ada di bumi untuk kamu\" (Al-Baqarah:29). “Dan menyempurnakan untukmu,” maksudnya, meratakan dan melimpahkanruahkan kepada kalian “nikmatNya lahir dan batin,” yaitu yang kita ketahui dan yang tidak dapat kita ketahui, nikmat dunia dan nikmat agama, tercapainya berbagai kemaslahatan (manfaat) dan tercegahnya berbagai mudarat. Maka kewajian kalian adalah mensyukuri nikmat-nikmat tersebut dengan cara mencintai Sang Maha Pemberi nikmat, tunduk patuh kepadaNya dan menggunakannya dalam rangka menaatiNya, dan tidak menggunakan sedikit pun untuk kemaksiatan terhadapNya. “Dan” akan tetapi, sekalipun berlimpah ruahnya nikmat tersebut “ada di antara manusia orang,” yang tidak mensyukurinya, bahkan malah mengingkarinya dan mengingkari DZat yang telah mengaruniakan nikmat-nikmat tersebut, dan mengingkari kebenaran yang karenanya Dia menurunkan kitab-kitab suciNya, dan yang karenanya Dia mengutus para RasulNya. Maka dia pun mulai “membantah tentang Allah,” maksudnya, ia mendebat tentang kebatilan agar dengannya dia bisa mencampakkan kebenaran, dan agar dapat menolak apa-apa yang dibawa (diajarkan) oleh Rasulullah, yaitu perintah hanya beribadah kepada Allah saja. Dan si pembantah ini tidak mempunyai dasar pengetahuan yang mendalam. Jadi, debat yang dilakukannya tidak berdasarkan ilmu, maka biarkan saja dia begitu dan biarkan dia berbicara, “tanpa petunjuk,” yang dapat dijadikan pedoman oleh orang-orang yang medapat petunjuk, ”dan tanpa Kitab yang memberi penerangan,” maksudnya, yang sangat terang lagi menjelaskan yang benar. Maka tidak ada yang logis, atau nash yang dinukil dan tidak ada keteladanan dengan orang-orang yang mendapat petunjuk. Sesungguhnya debatnya tentang orang yang mendapat petunjuk. Sesungguhnya debatnya tentang Allah hanya berdasarkan taklid buta kepada nenek moyang yang tidak pernah mendapat petunjuk, bahkan orang-orang sesat yang menyesatkan. Maka dari itu Allah berfirman, “Dan apabila dikatakan kepada mereka, ‘Ikutilah apa yang diturunkan Allah’,” melalui para RasulNya, karena sesungguhnya itu yang benar, dan (ketika) dijelaskan kepada mereka dalil-dalilnya yang Nampak, “mereka menjawab,” dengan nada menentangnya, “Tidak, tapi kami hanya mengikuti apa yang kami dapati bapak-bapak kami mengerjakannya,” maka kami tidak akan meninggalkan apa yang telah menjadi panutan bapak-bapak kami hanya karena perkataan seseorang, siapa pun dia. Lalu Allah berfirman seraya membantah mereka dan bapak-bapak mereka, “Dan apakah walaupun setan itu menyeru mereka ke dalam siksa api yang menyala-nyala?” yakni, lalu bapak-bapak mereka memenuhi seruannya dan berjalan mengekor kepadanya, dan mereka menjadi murid-murid setan, dan mereka pun diselimuti oleh kebimbangan. Apakah yang demikian ini berhak untuk diikuti dan ditelusuri jejak nmereka? Ataukah yang demikian itu membuat merek atakut untuk menelusuri jalan mereka dan diserukan akan kesesatan mereka dan kesesatan orang-orang yang mengikutinya? Padahal seruan setan kepada bapak-bapak mereka dan kepada mereka bukan karena kecintaan dan kasih saying setan kepada mereka, akan tetapi sesungguhnya hal itu adalah karena kebencian setan dan tipu muslihatnya terhadap mereka. Sebenarnya para pengikutnya adalah berasal dari musuh-musuhnya yang telah mampu ia taklukkan dan dia kalahkan, dan dia (setan) sangat senang karena mereka berhak mendapat azab api yang menyala-nyala disebabkan seruannya di terima."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 20: Allah mengkaruniakan kepada hamba-Nya dengan memberikan banyak kenikmatan; Allah kabarkan bahwa Dia memberikan sebagai manfaat dan maslahat apa yang ada di langit dari matahari dan bulan dan awan serta yang lainnya, Allah juga memberikan bagi mereka apa yang ada di bumi dari hewan-hewan dan pertaniann serta buah-buahan. Allah mengabarkan bahwasanya Dia memberikan segala kenikmatan dengan berbagai macamnya secara dzahir dari jasad dan anggota badan, serta kenikmatan secara bathin atas nikmat akal dan hati. Bersamaan dengan pemuliaan ini semua dan karunia-Nya, manusia tidak mensyukuri atas nikmat ini; Bahkan menentang akan urusan ketauhidan kepada Allah dan dalam keikhlasan ibadah kepada-Nya saja, dengan tanpa hujjah dan petunjuk, dengan tanpa kitab yang terang yang menerangi akalnya dan hatinya. Inilah urusan manusia, sehingga Allah berfirman : (Manusia) adalah yang paling banyak membantah, (Al Kahfi : 54)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan hamba-hamba-Nya akan nikmat-nikmat-Nya dan mengajak mereka bersyukur, dan agar mereka melihat nikmat itu dan tidak melupakannya. Dengan mata dan hatimu. Seperti matahari, bulan dan bintang agar kamu mengambil manfaat daripadanya. Seperti hewan, pohon-pohon, tanaman, sungai, barang tambang dan lain-lain. Yakni yang tampak terlihat, seperti penampilan yang menarik, sempurnanya fisik, nikmat harta, dsb. Yakni yang tersembunyi, seperti pengetahuan, iman, nikmat agama, memperoleh manfaat dan terhindar dari bahaya dan lain-lain. Oleh karena itu, sikap yang seharusnya kamu lakukan adalah mensyukuri nikmat itu, mencintai Pemberi nikmat dan tunduk kepada-Nya, menggunakannya untuk ketaatan kepada Allah dan tidak menggunakannya untuk maksiat. Meskipun nikmat itu turun berturut-turut. Yakni ada orang yang tidak bersyukur, bahkan kufur kepada nikmat itu dan kufur kepada Pemberinya, dan mengingkari yang hak yang ada dalam kitab-kitab-Nya dan yang dibawa para rasul-Nya. Dia mendebat yang hak dengan yang batil untuk mengalahkannya, padahal perdebatannya tidak di atas ilmu. Dari rasul atau mengikuti orang yang mendapat petunjuk. Dengan demikian perdebatannya tidak di atas dalil ‘aqli (akal), dalil nakli, dan tidak mengikuti rasul dan orang-orang yang mendapat petunjuk, bahkan hanya sekedar ikut-ikutan dengan nenek moyang mereka yang tidak mendapatkan petunjuk, yang sesat lagi menyesatkan sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 20",
    "description": "Titik berat nasihat-nasihat yang lukman berikan kepada anaknya adalah larangan berbuat. Melaui ayat ini Allah mengecam mereka yang berlaku syirik padahal di depan matanya terhampar bukti-bukti keesaan-Nya. Tidakkah kamu memperhatikan dengan saksama bahwa Allah telah menundukkan apa yang ada di langit dan apa yang ada di bumi untuk kepentingan-Mu dan memenuhi kebutuhanmu' dia juga menyempurnakan nikmat-Nya untukmu yang bersifat lahir seperti harta dan jabatan, dan yang bersifat batin seperti ilmu, kesehatan, dan keimanan. Akan tetapi, di antara manusia ada yang membantah tentang risalah nabi Muhammad, syariat, dan keesaan Allah dengan bantahan tanpa dasar ilmu atau petunjuk yang benar dan tanpa kitab yang memberi penerangan dan bimbingan menuju kebenaran. 21. Dan apabila dikatakan kepada mereka yang membantah keesaan Allah, 'ikutilah apa yang diturunkan Allah berupa syariat yang benar!' mereka menjawab, 'tidak! tetapi kami hanya mengikuti kebiasaan yang kami dapati dari nenek moyang kami. ' jawaban ini menggambarkan buruknya akidah mereka. Apakah mereka tetap mengikuti keyakinan nenek moyang mereka walaupun sebenarnya mereka hanya mengikuti langkah setan yang menyeru mereka ke dalam azab api yang menyala-Nyala' mereka pasti tidak akan berbuat demikian andaikata mau menggunakan akal dan nurani yang sehat."
  }
]