[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dikatakan kepada orang-orang yang mendebat keesaan Allah dan pengesaan ibadah hanya kepadaNya tersebut, “Ikutilah apa yang diturunkan oleh Allah kepada NabiNya, Muhammad.” Maka mereka menjawab, “Kami hanya mengikuti apa yang telah dianut oleh nenek moyang kami berupa kesyrikan dan penyembahan kepada berhala.” Apakah mereka tetap melakukan semua itu sekalipun setan mengajak mereka dan memperindah perbuatan batil mereka serta kekafiran mereka kepada Allah, sehingga mengantarkan mereka ke dalam azab neraka yang menyala-nyala?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan apabila dikatakan kepada orang-orang yang menentang tauhidullah (pengesaan Allah), “Ikutilah wahyu yang diturunkan oleh Allah kepada Rasul-Nya,” mereka berkata, “Kami tidak akan mengikutinya, kami akan mengikuti apa yang kami dapati dari nenek moyang kami berupa penyembahan terhadap berhala-berhala.” Apakah mereka mengikuti nenek moyang mereka, meski setan mengajak mereka -dengan cara menyesatkan mereka dengan penyembahan terhadap berhala-berhala- kepada siksa api yang menyala-nyala pada hari Kiamat?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا۟ مَآ أَنزَلَ اللهُ (Dan apabila dikatakan kepada mereka: “Ikutilah apa yang diturunkan Allah”) Yakni kitab yang diturunkan Allah kepada rasul-Nya. Namun mereka hanya mengikuti nenek moyang mereka. قَالُوا۟ بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ ءَابَآءَنَآ ۚ( Mereka menjawab: “(Tidak), tapi kami (hanya) mengikuti apa yang kami dapati bapak-bapak kami mengerjakannya”) Maka kami menyembah berhala yang mereka sembah, dan kami menempuh jalan yang mereka tempuh dalam beragama. أَوَلَوْ كَانَ الشَّيْطٰنُ يَدْعُوهُمْ إِلَىٰ عَذَابِ السَّعِيرِ(Dan apakah mereka (akan mengikuti bapak-bapak mereka) walaupun syaitan itu menyeru mereka ke dalam siksa api yang menyala-nyala (neraka)?) Seakan-akan Allah berfirman: apakah mereka tetap mengikuti nenek moyang mereka meski setan yang menggoda mereka seehingga ia menjerumuskan mereka ke dalam kemusyrikan, sehingga memasukkan mereka ke azab neraka Jahannam yang menyala-nyala, maka apa manfaat dari mengikuti nenek moyang jika kenyataannya seperti ini?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Apabila para penyembah berhala itu diberi nasihat: “Ikutilah apa yang telah Allah turunkan kepada rasul-Nya yaitu Alquran.” Mereka menjawab: “Kami menolak Alquran, kami sudah berpegang pada para pendahulu kami dalam hal akidah, yaitu kami telah mengikuti pendahulu kami untuk menyembah berhala.” Kemudian Allah menjawab mereka: “Apakah kalian akan tetap mengikuti mereka, meskipun para setan sebenarnya menyesatkan dan mengajak mereka ke dalam azab neraka Jahannam?” Kata tanya adatul istifham dalam kalimat tersebut berfungsi untuk mengingkari dan membuat takjub. Adapun jawabnya adalah menggunakan lau yang tersirat yaitu berarti mereka benar-benar telah mengikuti mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila dikatakan kepada mereka,“Ikutilah apa yang diturunkan Allah” mereka menjawab,“Kami mengikuti kebiasaan yang kami dapati dari nenek moyang kami” Apakah walaupun setan menyeru mereka ke dalam azab api yang menyala-nyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-21. Allah menyebut-nyebut kebaikanNya kepada hamba-hambaNya berupa nikmat-nikmatNya dan mengajak mereka mensyukurinya, melihatnya dan tidak melupakannya, seraya berfirman, “TIdakkah kamu perhatikan.” Maksudnya, tidakkah kalian saksikan dan melihat dengan mata kepala dan hati nurani kalian “bahwa Allah telah menundukkan untukmu apa yang ada di langit,” berupa matahari, bulan, dan bintang-bintang, semuanya ditundukkan untuk kepentingan manusia”dan apa yang ada di bumi,” berupa bermacam-macam hewan, pepohonan, tanaman, sungai, barang tambang dan lain-lain, sebagaimana yang dikatakan oleh Allah, \"Dia-lah Allah, yang menjadikan segala yang ada di bumi untuk kamu\" (Al-Baqarah:29). “Dan menyempurnakan untukmu,” maksudnya, meratakan dan melimpahkanruahkan kepada kalian “nikmatNya lahir dan batin,” yaitu yang kita ketahui dan yang tidak dapat kita ketahui, nikmat dunia dan nikmat agama, tercapainya berbagai kemaslahatan (manfaat) dan tercegahnya berbagai mudarat. Maka kewajian kalian adalah mensyukuri nikmat-nikmat tersebut dengan cara mencintai Sang Maha Pemberi nikmat, tunduk patuh kepadaNya dan menggunakannya dalam rangka menaatiNya, dan tidak menggunakan sedikit pun untuk kemaksiatan terhadapNya. “Dan” akan tetapi, sekalipun berlimpah ruahnya nikmat tersebut “ada di antara manusia orang,” yang tidak mensyukurinya, bahkan malah mengingkarinya dan mengingkari DZat yang telah mengaruniakan nikmat-nikmat tersebut, dan mengingkari kebenaran yang karenanya Dia menurunkan kitab-kitab suciNya, dan yang karenanya Dia mengutus para RasulNya. Maka dia pun mulai “membantah tentang Allah,” maksudnya, ia mendebat tentang kebatilan agar dengannya dia bisa mencampakkan kebenaran, dan agar dapat menolak apa-apa yang dibawa (diajarkan) oleh Rasulullah, yaitu perintah hanya beribadah kepada Allah saja. Dan si pembantah ini tidak mempunyai dasar pengetahuan yang mendalam. Jadi, debat yang dilakukannya tidak berdasarkan ilmu, maka biarkan saja dia begitu dan biarkan dia berbicara, “tanpa petunjuk,” yang dapat dijadikan pedoman oleh orang-orang yang medapat petunjuk, ”dan tanpa Kitab yang memberi penerangan,” maksudnya, yang sangat terang lagi menjelaskan yang benar. Maka tidak ada yang logis, atau nash yang dinukil dan tidak ada keteladanan dengan orang-orang yang mendapat petunjuk. Sesungguhnya debatnya tentang orang yang mendapat petunjuk. Sesungguhnya debatnya tentang Allah hanya berdasarkan taklid buta kepada nenek moyang yang tidak pernah mendapat petunjuk, bahkan orang-orang sesat yang menyesatkan. Maka dari itu Allah berfirman, “Dan apabila dikatakan kepada mereka, ‘Ikutilah apa yang diturunkan Allah’,” melalui para RasulNya, karena sesungguhnya itu yang benar, dan (ketika) dijelaskan kepada mereka dalil-dalilnya yang Nampak, “mereka menjawab,” dengan nada menentangnya, “Tidak, tapi kami hanya mengikuti apa yang kami dapati bapak-bapak kami mengerjakannya,” maka kami tidak akan meninggalkan apa yang telah menjadi panutan bapak-bapak kami hanya karena perkataan seseorang, siapa pun dia. Lalu Allah berfirman seraya membantah mereka dan bapak-bapak mereka, “Dan apakah walaupun setan itu menyeru mereka ke dalam siksa api yang menyala-nyala?” yakni, lalu bapak-bapak mereka memenuhi seruannya dan berjalan mengekor kepadanya, dan mereka menjadi murid-murid setan, dan mereka pun diselimuti oleh kebimbangan. Apakah yang demikian ini berhak untuk diikuti dan ditelusuri jejak nmereka? Ataukah yang demikian itu membuat merek atakut untuk menelusuri jalan mereka dan diserukan akan kesesatan mereka dan kesesatan orang-orang yang mengikutinya? Padahal seruan setan kepada bapak-bapak mereka dan kepada mereka bukan karena kecintaan dan kasih saying setan kepada mereka, akan tetapi sesungguhnya hal itu adalah karena kebencian setan dan tipu muslihatnya terhadap mereka. Sebenarnya para pengikutnya adalah berasal dari musuh-musuhnya yang telah mampu ia taklukkan dan dia kalahkan, dan dia (setan) sangat senang karena mereka berhak mendapat azab api yang menyala-nyala disebabkan seruannya di terima."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 21: Jika dikatakan kepada mereka orang-orang musyrik : Ikutilah apa yang telah diturunkan Allah kepada Rasul-Nya ﷺ dari petunjuk dan keterangan, mereka menjawab : Tidaklah kami mengikuti kecuali apa yang ada pada bapak-bapak kami dengan mengibadahi berhala-berhala dan benda-benda mati. Sungguh mereka telah mengikuti kebodohan bapak-bapak mereka dan berjalan dibelakang mereka hingga kalaulah setan menyesatkan mereka dan menyeru mereka kepada adzab yang pedih, maka mereka pasti mengikuti !!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada para rasul-Nya, karena ia adalah hak (benar). Yakni membantah. Maksudnya, kami tidak akan meninggalkan apa yang kami dapati dari nenek moyang kami hanya karena perkataan seseorang, siapa pun dia. Allah Subhaanahu wa Ta'aala membantah mereka dan membantah nenek moyang mereka. Ternyata nenek moyang mereka malah mengikuti setan, berjalan di belakangnya dan menjadi murid-muridnya, sehingga mereka pun dikuasai oleh kebingungan. Setan mengajak mereka bukanlah karena cinta dan kasihan kepada mereka, tetapi karena permusuhannya kepada mereka dan tipu dayanya, oleh karena itulah ajakannnya adalah ke neraka, namun dihias menjadi indah jalan yang mengarah ke neraka tersebut olehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 21",
    "description": "Dan apabila dikatakan kepada mereka yang membantah keesaan Allah, 'ikutilah apa yang diturunkan Allah berupa syariat yang benar!' mereka menjawab, 'tidak! tetapi kami hanya mengikuti kebiasaan yang kami dapati dari nenek moyang kami. ' jawaban ini menggambarkan buruknya akidah mereka. Apakah mereka tetap mengikuti keyakinan nenek moyang mereka walaupun sebenarnya mereka hanya mengikuti langkah setan yang menyeru mereka ke dalam azab api yang menyala-Nyala' mereka pasti tidak akan berbuat demikian andaikata mau menggunakan akal dan nurani yang sehat. 22. Sungguh mengherankan jika seseorang mengingkari wujud dan keesaan-Nya, apalagi hal itu hanya didasarkan pada taklid buta. Ia tidak memiliki pegangan, berbeda halnya dengan orang yang berserah diri kepada Allah. Siapa saja yang berserah diri kepada Allah dengan penuh keikhlasan, sedang dia orang yang berbuat kebaikan dengan menebarkan kebajikan kepada siapa pun dan di mana pun, maka sesungguhnya dia telah berpegang kepada buhul tali yang kukuh. Di akhirat ia akan memperoleh balasannya karena hanya kepada Allah kesudahan segala urusan untuk diputuskan dan dibalas dengan sangat adil."
  }
]