[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa mengikhlaskan ibadahnya kepada Allah dan niatnya kepada Tuhannya, sedangkan dia berkata-kata baik dan berbuat mulia, maka dia telah memegang sebab terkuat yang mengantarkannya kepada ridha Allah dan rahmatNya. Hanya kepada Allah semata segala urusan berjalan, lalu Dia membalas orang yang berbuat baik atas kebaikannya dan orang yang berbuat buruk atas keburukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan barangsiapa menghadap kepada Allah dengan mengikhlaskan ibadah kepada-Nya dan baik dalam amal perbuatannya berarti dia telah berpegangan pada sesuatu yang paling kuat sebagai tempat bergantung bagi orang-orang yang menginginkan keselamatan, karena dia tidak khawatir sesuatu yang dipegangnya itu akan putus. Dan hanya kepada Allah sajalah kembalinya segala perkara dan kesudahannya, lalu Allah akan membalas masing-masing dengan yang menjadi haknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Barangsiapa yang menyembah Allah semata dan baik dalam ucapan dan perbuatannya, maka dia telah berpegang teguh pada iman dan Islam. Kepada Allah tempat kembali segala urusan, kemudian Allah akan memperhitungkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمَن يُسْلِمْ وَجْهَهُۥٓ إِلَى اللهِ (Dan barangsiapa yang menyerahkan dirinya kepada Allah) Yakni menyerahkan segala urusannya kepada Allah dan menerima segala yang Allah berikan kepadanya. وَهُوَ مُحْسِنٌ(sedang dia orang yang berbuat kebaikan) Dan makna الإحسان adalah kamu menyembah Allah seakan-akan kamu melihat-Nya, dan jika kamu tidak melihat-Nya sesungguhnya Dia melihatmu. فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ ۗ( maka sesungguhnya ia telah berpegang kepada buhul tali yang kokoh) Yakni berpegang dengan perjanjian yang kokoh. Ini merupakan perumpamaan tentang orang yang menyerahkan dirinya kepada Allah yang diumpamakan seperti orang yang hendak menaiki tebing gunung yang harus berpegang pada tali yang kuat yang menjulur dari puncak tebing itu. وَإِلَى اللهِ عٰقِبَةُ الْأُمُورِ(Dan hanya kepada Allah-lah kesudahan segala urusan) Yakni kesudahannya kepada Allah, bukan kepada selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Barangsiapa menyerahkan segala urusannya kepada Allah, ikhlas dalam beribadah kepada-Nya, dan juga senantiasa berbuat kebaikan serta menyempurnakannya, maka sesungguhnya dia berpegang teguh kepada tali yang kukuh. Yaitu berpegang kepada janji atau tali yang menuntunnya menuju keridhoan Allah. Hanya kepada Allah lah tempat kembalinya segala sesuatu, bukan kepada selain-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang berserah diri kepada Allah} menyerahkan urusannya kepada Allah dan ikhlas hanya karenaNya {dan dia seorang yang berbuat baik} orang yang taat kepada Allah dalam perintah dan laranganNya {maka sungguh dia telah berpegang teguh} berpegang teguh dan bertahan {pada tali yang kukuh} dengan sebab-sebab yang paling kuat untuk dipegang {Hanya kepada Allah kesudahan} condong dan kembali {segala urusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Dan barangsiapa yang menyerahkan dirinya kepada Allah,” maksudnya, tunduk dan patuh kepadaNya dengan mengerjakan syariat-syariatNya dengan menuluskan agama (hanya) kepadaNya “sedang dia orang yang berbuat kebaikan,” di dalam Islam tersebut. Yaitu keberadaan amal yang dikerjakannya adalah yang masyru’ (dibenarkan agama) dan dengan mengikuti Rasulullah; atau barangsiapa yang menyerahkan dirinya kepada Allah dengan melakukan semua ibadah, sedangkan dia bersikap ihsan di dalamnya, yaitu dengan beribadah kepada Allahseolah-olah dia melihatNya, dan jika dia tidak melihatNya, maka seolah-olah dia melihatNya, dan jika dia tidak melihatNya, maka Dia melihatnya. Atau barangsiapa yang menyerahkan dirinya kepada Allah dengan cara melaksanakan hak-hakNya, sedangkan dia berbuat baik kepada hamba-hamba Allah dan melaksanakan hak-hak mereka. Makna-makna tersebut senada, tidak ada perbedaan di antara semua itu kecuali dari sudut perbedaan sumber dua lafazh tersebut. Dan jika tidak demikian, maka semuanya sepakat atas (maksud) menunaikan seluruh syariat-syariat agama dengan semampu mungkin untuk diterima dan sesempurna mungkin. Maka siapa saja yang telah melakukan hal itu, “maka sesungguhnya dia telah berpegang kepada buhul tali yang kokoh,” maksudnya, kepada buhul ikatan yang siapa saja berpegang teguh kepadanya, niscaya akan menjadi kuat, selamat dan bebas dari kebinasaan, serta meraih segala kebaikan. Dan siapa saja yang tidak menyerahkan dirinya kepada Allah, atau tidak bersikap ihsan, maka berarti dia tidak berpegang kepada buhul tali yang kokoh. Dan apabila dia tidak berpegang kepada buhul tali yang kokoh, maka tidak ada jalan lain (baginya) selain kebinasaan dan kecelakaan. “Dan hanya kepada Allah-lah kesudahan segala urusan,” maksudnya, tempat kembalinya dan tempat berakhirnya (segala urusan). Lalu Dia memberikan keputusan terhadap hamba-hambaNya dan memberikan balasan kepada mereka sesuai dengan amal perbuatan mereka, dan sesuai dengan akhir kesudahan mereka yang sampai kepadaNya. Maka hendaklah mereka bersiap-siap untuk menghadapi urusan ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 22: 22-23. Ketahuilah bahwa siapa yang berserah diri dengan tauhid, dan mengikatnya dengan ketaatan, ikhlas kerena Allah, dialah orang yang muhsin akan hal itu, karena telah beribadah kepada Allah sebagaiman yang mereka lihat, maka jika mereka tidak melihat, Allah yang melihat mereka; Sungguh dia telah berpegang teguh dengan agama Allah dan berpegang teguh dengan tali keberhasilan dan keselamatan dengan keselamatan yang agung. Dan seluruh urusan kembali kepada Allah, puncaknya juga untuk Allah. Adapun barangsiapa yang kafir dan mengingkari ayat-ayat Allah dan menolak para utusan-Nya; Maka janganlah bersedih, jangan putus asa, engkau telah tunaikan kewajiban bagimu memberi peringatan dan menyampaikan kerisalahan, dan kepada Kamilah kembali siapa yang kafir dan mendustakan,. Kami mengabarkan kepada mereka dengan keburukan atas apa yang telah mereka perbuat, dan Kami juga akan menghisab mereka serta membalas mereka dengan pa yang telah mereka kerjakan, sungguh Allah maha tahu atas segala sesuatu, mengetahui apa-apa yang tersembunyi dan apa yang tersembunyi di dalam dada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tunduk kepada-Nya mengerjakan syariat dengan ikhlas. Dalam amalnya, di mana amalnya memang disyariatkan dan mengikuti Rasulullah shallallahu 'alaihi wa sallam. Bisa juga maksudnya, barang siapa yang menyerahkan dirinya kepada Allah dengan mengerjakan semua ibadah, dan ia melakukannya dengan ihsan, yakni beribadah kepada Allah seakan-akan melihat-Nya, dan jika tidak merasakan begitu, maka dia merasakan pengawasan-Nya. Kesimpulannya, barang siapa mengerjakan syariat agama dengan cara yang diterima, maka berarti dia telah menyerahkan dirinya. Yang tidak perlu khawatir akan putus, sehingga dia akan selamat dan memperoleh semua kebaikan. Sebaliknya, barang siapa yang tidak berpegang dengannya, maka ia akan terjatuh dan binasa. Nanti Dia akan memutuskan perkara hamba-hamba-Nya dan membalas amal mereka. Oleh karena itu, bersiap-siaplah dari sekarang dengan memperbanyak amal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 22",
    "description": "Sungguh mengherankan jika seseorang mengingkari wujud dan keesaan-Nya, apalagi hal itu hanya didasarkan pada taklid buta. Ia tidak memiliki pegangan, berbeda halnya dengan orang yang berserah diri kepada Allah. Siapa saja yang berserah diri kepada Allah dengan penuh keikhlasan, sedang dia orang yang berbuat kebaikan dengan menebarkan kebajikan kepada siapa pun dan di mana pun, maka sesungguhnya dia telah berpegang kepada buhul tali yang kukuh. Di akhirat ia akan memperoleh balasannya karena hanya kepada Allah kesudahan segala urusan untuk diputuskan dan dibalas dengan sangat adil. 23-24. Wahai nabi Muhammad, jika segala urusan kembali kepada Allah untuk diputuskan dengan adil maka siapa saja yang memilih jalan kafir maka kekafirannya itu janganlah menyedihkanmu. Hanya kepada kami tempat kembali mereka di akhirat nanti, lalu kami beritakan kepada mereka apa yang telah mereka kerjakan kemudian kami balas dengan setimpal. Tidak ada yang bisa disembunyikan di akhirat nanti karena sesungguhnya Allah maha mengetahui segala sesuatu, bahkan yang tersirat dalam isi hati. Semua akan mendapat balasan setimpal, karena itulah kami biarkan mereka bersenang-senang di dunia yang hanya sebentar dan serba terbatas. Kemudian apabila masa yang telah kami tentukan tiba, kami paksa mereka masuk ke dalam azab yang keras."
  }
]