[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barang siapa yang kafir, maka Jangan kamu bersedih dan berduka atas siapa yang kafir (wahai Rasul), karena kamu telah menunaikan kewajiban menyampaikan dan menjelaskan. Hanya kepada Kami mereka semuanya akan kembali dan berpulang di Hari Kiamat, lalu Kami mengabarkan kepada mereka tentang amal-amal buruk yang mereka kerjakan di dunia, kemudian Kami akan membalas mereka atasnya. Sesungguhnya Allah Maha Mengetahui apa yang mereka simpan dalam dada mereka berupa kekafiran kepada Allah dan mementingkan ketaatan kepada setan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan barangsiapa kafir terhadap Allah, maka janganlah kekafirannya itu membuatmu sedih -wahai Rasul-. Hanya kepada Kami sajalah kembalinya mereka pada hari Kiamat lalu Kami akan kabarkan kepada mereka keburukan yang telah mereka lakukan di dunia dan Kami akan membalasnya. Sesungguhnya Allah Maha Mengetahui apa yang ada di dalam hati, tidak sesuatu apapun yang ada di dalam hati yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Hai Rasulullah, barangsiapa yang mengingkari Allah maka janganlah kamu bersedih dengan keingkarannya. Kepada Kami-lah tempat kembali mereka pada hari kiamat, kemudian Kami akan memberitahukan mereka dengan pasti segala dosa yang mereka lakukan. Sungguh Allah Maha Mengetahui segala kebaikan dan keburukan yang tersembunyi dalam hati. Kami akan memberi mereka sedikit kenikmatan di dunia yang fana ini, kemudian Kami akan menggiring mereka menuju azab neraka yang sangat menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَمَن كَفَرَ فَلَا يَحْزُنكَ كُفْرُهُۥٓ ۚ (Dan barangsiapa kafir maka kekafirannya itu janganlah menyedihkanmu) Sebab kekafiran mereka tidak akan memberimu mudharat. إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُم بِمَا عَمِلُوٓا۟ ۚ( Hanya kepada Kami-lah mereka kembali, lalu Kami beritakan kepada mereka apa yang telah mereka kerjakan) Yakni Kami akan memberitahukan mereka tentang keburukan amalan mereka, kemudian Kami akan membalas mereka berdasarkan perbuatan itu. إِنَّ اللهَ عَلِيمٌۢ بِذَاتِ الصُّدُورِ(Sesungguhnya Allah Maha Mengetahui segala isi hati) Tidak ada yang tersembunyi dari-Nya, bagi-Nya sesuatu yang rahasia sama seperti sesuatu yang nampak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Siapa saja yang telah kafir maka kekufurannya itu tidak akan memberi dampak apapun kepadamu baik di dunia maupun di akhirat. Hanya kepada Allah-lah tempat kembali mereka pada hari kiamat. Kami akan menunjukkan segala amal yang telah mereka perbuat, serta Kami akan memberi balasan kepada mereka berupa kebinasaan dan siksa. Sesungguhnya Allah Maha Tahu atas segala apapun yang terkandung dalam hati mereka, tidak ada sesuatu apapun yang tersembunyi dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang ingkar, maka janganlah kekufuran itu membuatmu sedih. Maka kepada Kamilah tempat kembali mereka, lalu Kami memberitahukan kepadanya tentang apa yang telah mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Dan barangsiapa yang kafir, maka kekafirannya itu janganlah menyedihkanmu,” sebab kamu telah melaksanakan kewajibanmu untuk berdakwah dan menyampaikan. Maka apbila dia tidak juga berpegang kepada petunjuk, maka sungguh pahala untukmu sudah pasti dari Allah, dan sudah tidak ada lagi tempat untuk bersedih atas sikapnya yang tidak mau menerima hidayah, karena seandainya pada orang itu ada kebaikannya, tentu Allah telah memberinya petunjuk. Dan jangan pula kamu bersedih atas kelancangan mereka memusuhimu dan melawanmu dengan perang dan tetrus pada kesesatan dan kekafiran mereka, dan jangan pula kamu merasa gelisah atas mereka karena mereka belum segera ditimpa azab, sesungguhnya “hanya kepada Kami-lah mereka kembali, lalu Kami beritakan kepada mereka amal yang telah mereka kerjakan,” yaitu berupa tindakan mereka kufur, memusuhi dan upaya mereka untuk memadamkan cahaya Allah dan menyakiti para RasulNya, sesungguhnya Dia “Maha Mengetahui segala isi hati,” yang tidak diperbincangkan oleh manusia, lalu bagaimana dengan apa-apa yang tampak dan telah menjadi nyata?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 23: 22-23. Ketahuilah bahwa siapa yang berserah diri dengan tauhid, dan mengikatnya dengan ketaatan, ikhlas kerena Allah, dialah orang yang muhsin akan hal itu, karena telah beribadah kepada Allah sebagaiman yang mereka lihat, maka jika mereka tidak melihat, Allah yang melihat mereka; Sungguh dia telah berpegang teguh dengan agama Allah dan berpegang teguh dengan tali keberhasilan dan keselamatan dengan keselamatan yang agung. Dan seluruh urusan kembali kepada Allah, puncaknya juga untuk Allah. Adapun barangsiapa yang kafir dan mengingkari ayat-ayat Allah dan menolak para utusan-Nya; Maka janganlah bersedih, jangan putus asa, engkau telah tunaikan kewajiban bagimu memberi peringatan dan menyampaikan kerisalahan, dan kepada Kamilah kembali siapa yang kafir dan mendustakan,. Kami mengabarkan kepada mereka dengan keburukan atas apa yang telah mereka perbuat, dan Kami juga akan menghisab mereka serta membalas mereka dengan pa yang telah mereka kerjakan, sungguh Allah maha tahu atas segala sesuatu, mengetahui apa-apa yang tersembunyi dan apa yang tersembunyi di dalam dada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni karena engkau telah menunaikan tugasmu, berupa dakwah dan menyampaikan. Kalau pun mereka tidak mendapatkan petunjuk, maka engkau tetap akan mendapatkan pahala, dan tidak perlu bersedih karena orang yang engkau dakwahkan tidak mau mengikuti petunjuk, karena jika padanya terdapat kebaikan, niscaya Allah akan menunjukinya. Demikian juga, janganlah engkau bersedih karena beraninya mereka dan terang-terangannya mereka menampakkan permusuhan, tetap di atas kesesatan dan kekafirannya, serta janganlah terburu nafsu karena azab tidak disegerakan kepada mereka. Berupa kekafiran dan permusuhan mereka serta usaha mereka untuk memadamkan cahaya Allah serta menyakiti para rasul-Nya. Yang tidak diucapkan oleh seseorang, lalu bagaimana dengan yang tampak? Tentu lebih mengetahui lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 23",
    "description": "23-24. Wahai nabi Muhammad, jika segala urusan kembali kepada Allah untuk diputuskan dengan adil maka siapa saja yang memilih jalan kafir maka kekafirannya itu janganlah menyedihkanmu. Hanya kepada kami tempat kembali mereka di akhirat nanti, lalu kami beritakan kepada mereka apa yang telah mereka kerjakan kemudian kami balas dengan setimpal. Tidak ada yang bisa disembunyikan di akhirat nanti karena sesungguhnya Allah maha mengetahui segala sesuatu, bahkan yang tersirat dalam isi hati. Semua akan mendapat balasan setimpal, karena itulah kami biarkan mereka bersenang-senang di dunia yang hanya sebentar dan serba terbatas. Kemudian apabila masa yang telah kami tentukan tiba, kami paksa mereka masuk ke dalam azab yang keras"
  }
]