[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami membiarkan mereka menikmati kehidupan dunia ini untuk waktu yang pendek, kemudian di Hari Kiamat, Kami akan menggiring mereka dan mencampakkan mereka ke dalam azab yang menyakitkan, yaitu azab Jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Kami berikan kenikmatan kepada mereka dengan memberikan berbagai kesenangan di dunia dalam waktu yang sebentar, kemudian Kami kembalikan mereka pada hari Kiamat kepada siksa yang pedih, yaitu siksa Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. نُمَتِّعُهُمْ قَلِيلًا (Kami biarkan mereka bersenang-senang sebentar) Yakni Kami biarkan orang-orang kafir di dunia sebentar saja untuk mereka nikmati, sebab kenikmatan dunia yang fana jauh lebih sedikit dari kenikmatan yang kekal. ثُمَّ نَضْطَرُّهُمْ إِلَىٰ عَذَابٍ غَلِيظٍ(kemudian Kami paksa mereka (masuk) ke dalam siksa yang keras) Yakni menggiring mereka ke dalam azab neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Kami biarkan mereka menikmati segala tipu daya dunia yang hanya sebentar, karena ibaratnya itu semua hanya sedikit sekali jika dibandingkan dengan sesuatu yang kekal. Kemudian akan Kami lemparkan mereka ke dalam azab neraka yang sangat pedih dan dahsyat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami membiarkan mereka bersenang-senang sebentar kemudian Kami memaksa mereka} menggiring mereka {ke dalam azab yang keras} yang sangat mengerikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Kami biarkan mereka bersenang-senang sebentar,” di dunia ini agar dosa-dosa mereka bertambah dan siksaannya berlipat-lipat, “kemudian Kami paksa mereka,” maksudnya, Kami pulangkan mereka, “ke dalam siksa yang keras,” maksudnya, yang memuncak kekerasan, keburukan, kepedihan, dan kedahsyatannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 24: Allah mengabarkan bahwasanya Dia akan mengulur waktu kepada mereka orang-orang-orang musyrik untuk menikmati kesenangan dunia dengan kesenangan yang sedikit yang akan lenyap dengan (tipuan) yang hanya menambah dosa mereka, kemudian mereka akan dikembalikan kepada adzab yang berat, keras yang tidak mungkin mereka akan kuat menahannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dunia agar dosa mereka bertambah dan hukuman mereka semakin sempurna. Di akhirat. Yaitu azab neraka yang begitu besar azabnya, begitu mengerikan siksanya dan begitu pedih rasanya, di mana mereka tidak menemukan tempat untuk melarikan diri di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 24",
    "description": "23-24. Wahai nabi Muhammad, jika segala urusan kembali kepada Allah untuk diputuskan dengan adil maka siapa saja yang memilih jalan kafir maka kekafirannya itu janganlah menyedihkanmu. Hanya kepada kami tempat kembali mereka di akhirat nanti, lalu kami beritakan kepada mereka apa yang telah mereka kerjakan kemudian kami balas dengan setimpal. Tidak ada yang bisa disembunyikan di akhirat nanti karena sesungguhnya Allah maha mengetahui segala sesuatu, bahkan yang tersirat dalam isi hati. Semua akan mendapat balasan setimpal, karena itulah kami biarkan mereka bersenang-senang di dunia yang hanya sebentar dan serba terbatas. Kemudian apabila masa yang telah kami tentukan tiba, kami paksa mereka masuk ke dalam azab yang keras. 25. Kesadaran manusia, bahkan orang musyrik, tentang eksistensi tuhan sesungguhnya merupakan fitrah sehingga tidak bisa dihilangkan. Dan sebagai buktinya, sungguh jika engkau wahai nabi Muhammad tanyakan kepada mereka, 'siapakah yang menciptakan langit dan bumi'' tentu mereka mengakui dan akan menjawab, 'Allah. ' meski demikian, adalah mengherankan bagaimana mereka tetap menyembah selain Allah. Jika demikian, katakanlah, wahai nabi Muhammad, 'segala puji bagi Allah bahwa mereka mengakui eksistensi Allah yang memang tidak bisa diingkari oleh siapa pun. ' tetapi, kebanyakan mereka tidak mengetahui dan menyadari kesesatannya dalam menyekutukan Allah."
  }
]