[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kamu bertanya (wahai rasul) kepada orang-orang musyrik itu dengan Nama Allah, “Siapa yang menciptakan langit dan bumi?” niscaya mereka akan menjawab, “Allah.” bila mereka menjawab demikian, maka katakanlah kepada mereka , “Segala puji bagi Allah yang telah memperlihatkan dalil atas kalian dari diri kalian sendiri.” Akan tetapi kebanyakan orang-orang musyrik itu tidak mau melihat dan merenungkan siapa yang berhak untuk disanjung dan dipuji, oleh karena itu mereka menyekutukan sesuatu denganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Jika engkau -wahai Rasul- menanyakan kepada orang-orang musyrik, “Siapa yang menciptakan langit-langit dan siapa yang menciptakan bumi?” Niscaya mereka akan menjawab, “Allah lah yang menciptakannya.” Katakan kepada mereka, “Segala puji bagi Allah yang telah menunjukkan hujah atas kalian.” Akan tetapi karena kejahilan mereka, kebanyakan dari mereka tidak mengetahui siapa yang berhak untuk dipuji."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Hai Nabi, sungguh jika kamu bertanya kepada orang-orang musyrik: “Siapa yang menciptakan tujuh langit dan bumi?” Maka mereka akan menjawab: “Allah”. Katakanlah kepada mereka: “Segala puji bagi Allah atas pengakuan mereka sebagai hujjah.” Akan tetapi kebanyakan dari orang-orang musyrik itu tidak mengetahui kebenaran untuk mereka ikuti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ لَيَقُولُنَّ اللهُ ۚ (Dan sesungguhnya jika kamu tanyakan kepada mereka: “Siapakah yang menciptakan langit dan bumi?” Tentu mereka akan menjawab: “Allah”) Yakni mereka mengakui bahwa Allah adalah pencipta langit dan bumi, mereka tidak memiliki jawaban lain selain itu. قُلِ (Katakanlah) Hai Muhammad. الْحَمْدُ لِلّٰهِ ۚ (“Segala puji bagi Allah”) Atas pengakuan kalian, namun mengapa kalian menyembah selain Allah dan menjadikan bagi-Nya sekutu? بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ (tetapi kebanyakan mereka tidak mengetahui) Yakni tidak memperhatikan dan menghayati agar mereka mengetahui bahwa pencipta semua ini ialah yang berhak untuk disembah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Wahai Rasul, jika engkau bertanya kepada mereka tentang siapa pencipta langit dan bumi maka mereka akan benar-benar menjawab dengan pengetahuan mereka bahwa Allah lah yang menciptakan keduanya. Maka katakanlah kepada mereka wahai Nabi: “Segala puji bagi Allah, jika kalian telah mengetahui kebenaran, lalu bagaimana jadinya kalian tetap menyembah selain Allah? Namun kebanyakan manusia tetap pura-pura tidak tahu tentang landasan atau hujjah itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh, jika kamu bertanya kepada mereka,“Siapakah yang menciptakan langit dan bumi” pasti mereka akan menjawab,“Allah.” Katakanlah,“Segala puji bagi Allah,” tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Makasudnya, “Dan sesungguhnya jika kamu tanyakan kepada mereka,” yaitu kamu bertanya kepada kaum musyrikin yang mendustakan kebenaran, “Siapakah yang menciptakan langit dan bumi,” tentu mereka mengetahui bahwa berhala-berhala mereka sama sekali tidak menciptakan hal itu, dan tentu mereka segera mengatakan, “Allah” semata yang menciptakan keduanya. Maka “katakanlah” kepada mereka dengan nada mematahkan hujjah atas mereka dengan argument yang mereka akui atas apa yang mereka ingkari, “Segala puji bagi Allah,” yang telah menjelaskan nur (cahaya) dan menampakkan dalil terhadap kalian dari kalian sendiri. Maka kalau mereka mengetahui, tentu mereka memastikan bahwa yang Esa (dengan penciptaan dan pengaturan alam semesta ini), Dia-lah yang diesakan dengan ibadah dan tauhid. Akan tetapi, “kebanyakan mereka tidak mengetahui,” maka dari itu mereka mempersekutukanNya dengan yang lain, dan mereka rela dengan kotradiksi keyakinan yang mereka anut dengan kebimbangan dan keraguan, bukan dengan dasar ilmu pengetahuan yang mendalam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 25: Maka jika engkau bertanya kepada mereka orang-orang musyrik wahai Nabi Allah : Siapa yang menciptakan langit dan bumi ?! Mereka sungguh akan menjawab dengan ucapan mereka : Allah, Dialah yang menciptakan langit dan bumi. Maka katakana wahai Nabi Allah kepada mereka : Segala puji hanyalah milik Allah atas penetapan kalian akan pertanyaan itu dan pengakuan kalian, maka wajib atas kalian untuk ber-azzam agar menunggalkan Sang Pencipta langit dan bumi yang berhak untuk ditunggalkan dengan hanya ibadah kepada-Nya tidak kepada selain-Nya. Akan tetapi kebanyakan mereka tidak mengetahui dan tidak melihat serta tidak tadabbur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang musyrik; yang mendustakan kebenaran. Tentu mereka akan mengetahui, bahwa patung dan berhala yang mereka sembah tidak mampu menciptakan apa-apa, dan tentu mereka akan segera mengatakan, “Allah yang menciptakannya.” Karena telah tegak hujjah tentang kebenaran tauhid kepada mereka. Maka segala puji bagi Allah, karena Dia telah menerangkan kebenaran, memperjelas dalilnya dari diri mereka sendiri. Jika sekiranya mereka mengetahui, tentu mereka akan memastikan, bahwa yang menciptakan dan mengatur alam semesta itulah yang berhak disembah saja. Oleh karena itulah pada lanjutan ayatnya, Allah berfirman, “tetapi kebanyakan mereka tidak mengetahui.” Akibat ketidaktahuan itu, mereka menyekutukan sesuatu dengan-Nya, meridhai pertentangan yang mereka pegang (mereka akui bahwa Allah yang telah menciptakan alam semesta, namun pada kenyataannya yang mereka sembah malah selain-Nya) sedang mereka di atas keraguan bukan di atas pengetahuan. Wajibnya tauhid atas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 25",
    "description": "Kesadaran manusia, bahkan orang musyrik, tentang eksistensi tuhan sesungguhnya merupakan fitrah sehingga tidak bisa dihilangkan. Dan sebagai buktinya, sungguh jika engkau wahai nabi Muhammad tanyakan kepada mereka, 'siapakah yang menciptakan langit dan bumi'' tentu mereka mengakui dan akan menjawab, 'Allah. ' meski demikian, adalah mengherankan bagaimana mereka tetap menyembah selain Allah. Jika demikian, katakanlah, wahai nabi Muhammad, 'segala puji bagi Allah bahwa mereka mengakui eksistensi Allah yang memang tidak bisa diingkari oleh siapa pun. ' tetapi, kebanyakan mereka tidak mengetahui dan menyadari kesesatannya dalam menyekutukan Allah. 26. Hanya Allah yang berhak disembah dan ditaati, sebab hanya milik Allah-lah apa yang di langit dan di bumi. Sesungguhnya Allah, dialah yang mahakaya; dia tidak butuh ibadah hamba-Nya. Dia pun maha terpuji meski tidak seorang pun memuji-Nya."
  }
]