[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milik Allah-lah segala apa yang di langit dan di bumi, sebagai hamba-hambaNya yang Dia ciptakan, Dia yang mengadakan dan menakdirkan mereka, maka tidak ada yang berhak disembah selainNya. Sesungguhnya Allah-lah Yang Mahakaya yang tidak membutuhkan makhlukNYa. BagiNya sanjungan dan pujian dalam keadaan apa pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Hanya milik Allah semata apa yang ada di langit dan apa yang ada di bumi, dalam hal penciptaan, kepemilikan dan pengurusan. Sesungguhnya Allah tidak butuh kepada seluruh makhluk-Nya, Maha Terpuji di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Milik Allah kerajaan di tujuh langit dan bumi. Allah Maha Kaya dari selain diri-Nya dan terpuji di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. لِلّٰهِ مَا فِى السَّمٰوٰتِ وَالْأَرْضِ ۚ (Kepunyaan Allah-lah apa yang di langit dan yang di bumi) Dia-lah yang memiliki dan menciptakan. Sehingga tidak ada yang berhak disembah selain-Nya. إِنَّ اللهَ هُوَ الْغَنِىُّ(Sesungguhnya Allah Dialah Yang Maha Kaya) Tidak butuh terhadap yang lain. الْحَمِيدُ(lagi Maha Terpuji) Yang berhak dipuji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Hanya milik Allah lah, segala apapun yang ada di langit dan bumi, baik raja, makhluk maupun hamba. Tidak ada Dzat Yang berhak disembah kecuali Dia. Allah tidak butuh apapun, hanya bagi-Nya lah segala puji untuk segala sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allahlah apa yang di langit dan di bumi. Sesungguhnya Allahlah Yang Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Kemudian Allah menyebutkan di dalam dua ayat berikut ini salah satu contoh dari kemahaluasan sifat-sifatNya, untuk menyeru hamba-hambaNya agar mengenalNya, mencintaiNya dan memurnikan kepatuhan hanya kepadaNya. Di sini Dia menyinggung universalitas kerajaanNya, dan bahwa semua yang ada di langit dan bumi (yang semua ini meliputi seluruh alam atas dan alam bawah) adalah milikNya, Dia berbuat terhadap mereka berdasarkan hukum-hukum (aturan-aturan) kerajaanNya yang bersifat taqdiri (ketetapan) dan hukum-hukumNya yang bersifat perintah serta hukum-hukumnya yang bersifat balasan. Jadi semua mereka adalah hamba dan budak yang dikendalikan dan ditundukkan, mereka sama sekali tidak memiliki kepemilikan (kerajaan) apa pun, dan bahwa Dia Mahaluas kekayaanNya, maka Dia sama sekali tidak membutuhkan kepada apa-apa yang dibutuhkan seseorang dari makhlukNya, \"Aku tidak menghendaki rezeki sedikit pun dari mereka dan Aku tidak menghendaki supaya mereka memberi Aku makan.\" (Adz-Dzariyat:57). Dan sesungguhnya amal perbuatan para nabi, para shiddiqin, para syuhada dan orang-orang yang shalih, sama sekali tidak mendatangkan kemanfaatan bagi Allah. Sesungguhnya ia hanya berguna bagi para pelakunya, sedangkan Allah Mahakaya dari mereka dan dari amal perbuatan mereka. Dan di antara kekayaanNya adalah, Allah menjadikan mereka kaya dan berkecukupan di dunia dan akhirat mereka. Kemudian Allah memberitakan tentang betapa luasnya keterpujianNya, dan bahwa keterpujianNya merupakan keharusan DzatNya. Maka tidaklah Dia melainkan Maha Terpuji dalam sifat-sifatNYa. Setiap sifat dari sifat-sifatNya berhak mendapatkan pujian yang tersempurna dan paling paripurna, sebab ia merupakan sifat-sifat keagungan dan kesempurnaan; dan seluruh yang di lakukanNya dan apa yang diciptakanNya pasti terpuji; dan seluruh yang Dia putuskan terhadap hamba-hambaNya dan (keputusan) di antara hamba-hambaNya di dunia dan di akhirat pasti terpuji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 26: Ketahuilah bahwasanya milik Allah lah apa yang di langit dan bumi baik makhluk-Nya maupun kerajaan-Nya serta penjagaan-Nya. Sesungguhnya Allah yang maha kaya atas selain-Nya, Dialah yang terpuji di mana pujian bagi-Nya seluruhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada ayat ini dan setelahnya, Allah Subhaanahu wa Ta'aala menyebutkan contoh luasnya sifat-sifat-Nya untuk mengajak hamba-hamba-Nya mengenal dan mencintai-Nya serta mengikhlaskan ibadah kepada-Nya. Disebutkan dalam ayat di atas meratanya kerajaan-Nya, dan bahwa semua yang ada di langit dan di bumi –hal ini mencakup alam bagian atas dan alam bagian bawah- adalah milik-Nya, Dia bertindak terhadap mereka dengan hukum-hukum kerajaan-Nya, Dia menetapkan dengan hukum qadari-Nya (terhadap alam semesta), hukum perintah-Nya, dan hukum jaza’i (pembalasan)-Nya. Semuanya adalah hamba dan milik-Nya, diatur dan ditundukkan-Nya, dan mereka tidak memiliki kerajaan sedikit pun. Yakni milik-Nya, ciptaan-Nya, dan hamba-Nya, oleh karenanya tidak ada yang berhak disembah selain-Nya. Dia Mahakaya sehingga tidak butuh kepada apa yang dibutuhkan oleh makhluk-Nya, dan bahwa amal para nabi, para shiddiqin, para syuhada dan orang-orang salih tidaklah memberikan manfaat sedikit pun bagi Allah, bahkan hanya bermanfaat bagi pelakunya. Dia tidak butuh kepada mereka dan tidak butuh kepada amal mereka. Oleh karena Dia Mahakaya, maka Dia mengkayakan dan memberikan kecukupan di dunia dan akhirat. Dia Maha Terpuji, pujian bagi-Nya termasuk yang lazim (mesti) pada zat-Nya, sehingga Dia tidak dipuji kecuali dengan pujian dari berbagai sisi, Dia Maha Terpuji pada zat-Nya dan Maha Terpuji pada sifat-Nya. Setiap sifat di antara sifat-Nya berhak mendapatkan pujian yang paling sempurna, karena sifat-Nya adalah sifat keagungan dan kesempurnaan, semua perbuatan dan ciptaan-Nya terpuji, semua perintah dan larangan-Nya terpuji, semua keputusan-Nya pada hamba atau antara hamba, di dunia dan di akhirat adalah terpuji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 26",
    "description": "Hanya Allah yang berhak disembah dan ditaati, sebab hanya milik Allah-lah apa yang di langit dan di bumi. Sesungguhnya Allah, dialah yang mahakaya; dia tidak butuh ibadah hamba-Nya. Dia pun maha terpuji meski tidak seorang pun memuji-Nya. 27. Ayat ini menggambarkan betapa sempurna kuasa Allah dan betapa luas ilmu-Nya. Seandainya pohon-pohon di bumi menjadi pena dan lautan menjadi tinta, dan ditambahkan kepadanya tujuh lautan lagi untuk menjadi tinta setelah habis-Nya lautan yang pertama, niscaya tidak akan habis-habisnya kalimat-kalimat Allah dituliskan. Sesungguhnya Allah mahaperkasa, tidak ada satu pun yang sanggup mengalahkan-Nya mahabijaksana dalam setiap pengaturan dan kebijakan-Nya (lihat: al-kahf/18: 109)."
  }
]