[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya semua pohon di bumi ini dijadikan sebagai pena, dan lautan sebagai tinta nya ditambah dengan tujuh samudera lagi, lalu pena-pena dan tinta-tinta itu digunakan untuk menulis kalimat-kalimat Allah yang mencakup Ilmu dan hukumNya, apa Yang DIa wahyukan kepada para malaikat dan para utusanNYa, niscaya pena-pena itu akan patah dan tinta-tinta akan habis, namun tidak dengan kalimat-kalimat Allah yang sempurna, di mana tidak seorang pun meliputinya. Sesungguhnya Allah Mahaperkasa dalam menimpakan hukuman terhadap siapa yang menyekutukanNya, juga Mahabijakksana dalam pengaturan atas makhlukNya. Ayat ini menetapkan sifat “kalam” bagi Allah secara hakiki sesuai dengan keagungan dan kesempurnaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Seandainya seluruh pepohonan yang ada di bumi dijadikan pena dan lautan sebagai tintanya ditambah tujuh lautan lagi, niscaya kalimat-kalimat Allah tidak akan habis ataupun tuntas karena kalimat-kalimat Allah tidak ada habisnya. Sesungguhnya Allah Maha Perkasa, tidak ada sesuatu pun yang mampu mengalahkannya, Maha Bijaksana dalam penciptaan-Nya dan kepengurusan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Seandainya seluruh pohon di bumi berubah menjadi pena dan air laut menjadi tinta, kemudian dituliskan kalimat-kalimat Allah, niscaya pena dan tinta itu akan habis saat kalimat-kalimat Allah belum selesai dituliskan. Hal ini menunjukkan keluasan ilmu-Nya. Allah Maha Perkasa dalam kerajaan-Nya, tidak ada yang dapat melemahkannya, dan Maha Bijaksana dalam mengatur makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. مَّا نَفِدَتْ كَلِمٰتُ اللهِ ۗ (niscaya tidak akan habis-habisnya (dituliskan) kalimat Allah) Yakni seandainya pepohonan yang ada di bumi semuanya adalah pena, dan air di lautan adalah tinta, kemudian digunakan untuk menulis kalimat-kalimat Allah yang Dia firmankan jika menghendaki sesuatu, niscaya air di lautan itu akan habis sedangkan kalimat Allah belum selesai ditulis semuanya meski ditambah lagi dengan tinta sebanyak tujuh lautan. Terdapat pendapat mengatakan bahwa ketika turun ayat: وما أوتيتم من العلم إلا قليلا “sedangkan kamu diberi pengetahuan hanya sedikit” yang ditujukan bagi orang-orang Yahudi, mereka kemudian berkata: “Mengapa demikian, padahal kami telah diberi kitab Taurat yang mengandung firman Allah dan hukum-hukumnya?” Maka turunlah ayat ini. إِنَّ اللهَ عَزِيزٌ حَكِيمٌ(Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana) Yakni tidak ada yang dapat mengalahkan-Nya, dan tidak ada makhluk-Nya yang terlewat dari hikmah dan ilmu-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Walaupun ibarat semua pepohonan yang ada menjadi pena untuk menulis, kemudian laut dan samudera bahkan ditambah tujuh samudera/laut sekalipun sebagai tinta. Kemudian itu semua digunakan untuk menulis kalimat dan ilmu Allah, maka sampai habis pun air laut belum mampu menulis semua ilmu Allah. Sesungguhnya Allah Maha Perkasa dan Maha Mengalahkan dan tidak terkalahkan. Tidak ada sesuatu apapun yang bisa luput dari sifat Maha Tahu dan Maha Bijaksana-Nya. Ayat ini turun ketika orang Yahudi berkata kepada Rasul SAW: “Di dalam kitab Taurat ada penjelasan tentang segala sesuatu.” Kemudian Rasul menjawab: “Itu hanya sedikit dari ilmu Allah.”, kemudian Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya pohon-pohon di bumi menjadi pena} diraut menjadi pena {dan lautan (menjadi tinta) ditambah} ditambah {setelah itu} setelahnya {tujuh lautan lagi, niscaya tidak akan habis} tidak akan habis {kalam Allah. Sesungguhnya Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Kemudian Allah memberitakan tentang keluasan kalamNya dan keagungan FirmanNya dengan uraian yang menyentuh hati sedalam-dalamnya, akal pikiran menjadi tercengang kepadanya, jiwa menjadi terperangah padanya, dan orang-orang yang berakal dan berpengetahuan mendalam berpetualang dalam mengenalNya; seraya berfirman, “Dan seandainya pohon-pohon di bumi menjadi pena” untuk menulisnya “dan laut (menjadi tahta), ditambahkan kepadanya tujuh laut lagi sesudahnya (kering) nya,” sebagai tinta untuk tambahannya, niscaya pena-pena itu akan remuk dan tinta itu akan habis, sedangkan “kalimat Allah” tidak akan ada habis-habisnya. Ini bukan ungkapan berlebihan yang tidak mempunyai kenyataan, akan tetapi ketika Allah mengetahui bahwasanya akal manusia tidak akan mampu mengetahui sebagian sifat-sifatNya dan Dia mengetahui bahwa mengenalNya bagi hamba-hambaNya adalah merupakan nikmat yang paling utama yang dikaruniakanNya kepada mereka, dan merupakan tingkata yang paling mulia yang mereka raih, sementara pengetahuannya itu tidak mencakup keseluruhannya, akan tetapi apa yang tidak bisa dicapai keseluruhannya maka tidak patut ditinggalkan semuanya, maka Allah mengingatkan mereka dengan sebagiannya sebagai suatu peringatan yang mana hati mereka dapat menjadi terang dan dada mereka menjadi lapang, dan mereka berdalil (berargumen) dengan apa yang telah mereka capai kepada apa yang belum mereka capai dan mengatakan seperti apa yang telah dikatakan oleh orang yang paling utama dan lebih mengetahui Rabbnya dari mereka. Dan bila tidak demikian, maka sesungguhnya permasalahannya lebih besar dan lebih agung dari itu. Perumpamaan tersebut termasuk dalam kategori upaya untuk mendekatkan makna yang tidak bisa dijangkau oleh pemahaman dan pemikiran. Dan bila tidak demikian, maka pohon-pohon itu sendiri, sekalipun berlipat-lipat ganda melebihi apa yang disebutkan, dan lautan, sekalipun ditambah beberapa kali lipat lagi maka tetap bisa saja ia habis dan kering, sebab ia (pepohonan dan lautan itu) adalah makhluk. Sedangkan Kalamullah tidak mungkin bisa habis, bahkan dalil syar’i dan aqli menunjukkan kepada kita bahwa ia tidak akan pernah habis dan tidak pernah ada ujungnya. Jadi, segala sesuatu itu akan habis (sirna) kecuali Allah dan sifat-sifatNya, \"dan bahwasanya kepada Tuhanmulah kesudahan (segala sesuatu)\", (An-Najm:42). Dan apabila akal pikiran membayangkan hakikat ke-awal-an dan ke-akhir-an Allah, dan bahwa segala apa yang dipastikan oleh akal pikiran berupa masa-masa silam, sekalipun anggapan dan perkiraan itu bermata rantai (berkesinambungan), maka Allah sudah ada sebelum itu semua, tanpa batas. Dan sesungguhnya, bagaimana pun akal memastikan dan menghitung masa-masa yang akan datang, dan perhitungan serta perkiraan itu bermata rantai dan ia dibantu oleh siapa pun untuk menghitungnya dengan hati tanpa ujung. Allah dalam setiap dan sepanjang waktu memutuskan, berbicara, berfirman dan berbuat sebagaimana yang telah Dia kehendaki. Dan apabila Dia telah berkehendak, maka tidak ada apa pun yang bisa menghalangi Firman-firman dan perbuatan-perbuatanNYa. Apabila akal sudah bisa membayangkan hal itu, niscaya ia mengetahui bahwa perumpamaan yang bisa disampaikan oleh Allah bagi kalamNya adalah agar hamba-hambaNya mengetahui sebagian darinya. Apabila tidak demikian, maka sebenarnya permasalahan ini jauh lebih agung dan lebih besar lagi. Kemudian Dia menjelaskan kebesaran, keperkasaanNya dan kesempurnaan hikmahNya, “Sesungguhnya Allah Mahaperkasa lagi Mahabijaksana,” maksudnya, hanya milikNyalah keperkasaan seluruhnya, yang mana tidak ada kekuatan di alam atas dan bawah melainkan berasal dariNya; Dia-lah yang memberikannya kepada manusia. Maka tidak ada daya dan tidak ada pula kekuatan melainkan dengan (pertolongan) Nya; dan dengan keperkasaanNya, Dia mengendalikan makhluk ini semuanya, Dia berbuat dan mengatur mereka, dan dengan hikmahNya, Dia menciptakan makhluk ini semuanya, dan Dia memulainya dengan hikmah dan menjadikan tujuan dan maksudnya adalah hikmah. Demkikian pula perintah dan larangan diadakan dengan hikmah, serta tujuan dan maksudnya pun adalah hikmah. Maka Dia-lah Yang Mahabijaksana di dalam ciptaan dan perintahNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 27: Ketahuilah wahai manusia, seandainya seluruh pepohonan yang di bumi dijadikan pena, yang dengannya dapat menulis, dan seluruh laut dijadikan tintanya, dan di belakang lautan tadi masih terdapat tujuh lautan lagi untuk menulis kalamullah, maka akan tidak mencukupi pena dan lautan (sebagai tinta), tidak mencukupi pula kalamullah (untuk ditulis), sesungguhnya Allah yang maha kuat, yang maha menaklukkan, yang tidak ditaklukkan sesuatupun, yang maha hikmah dalam penjagaan kepada makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan tentang luasnya kalimat-Nya dan besarnya ucapan-Nya dengan penjelasan yang meresap ke hati, setiap akal akan takjub kepadanya, hatinya pun akan terpukau olehnya, dan bahwa orang-orang yang berakal dan berpengetahuan akan melayang untuk mengenal-Nya. Yang dimaksud dengan kalimat Allah ialah firman dan ucapan-Nya yang tidak habis-habisnya. Karena Allah Subhaanahu wa Ta'aala yang pertama tanpa ada permulaan dan yang terakhir tanpa ada kesudahan. Dia senantiasa berbicara dengan apa yang Dia kehendaki apabila Dia menghendaki, sehingga tidak ada batas terhadap firman-Nya tentang yang telah lalu dan yang akan datang, jika ditaqdirkan pohon dan lautan digunakan untuk mencatat kalimat Allah, maka tidak akan habis. Hal bukanlah berlebihan yang tidak ada hakikatnya, karena Allah Subhaanahu wa Ta'aala mengetahui bahwa akal tidak mampu meliputi sebagian sifat-Nya, dan Dia mengetahui bahwa pengenalan terhadap-Nya oleh hamba-hamba-Nya adalah nikmat yang paling utama yang dikaruniakan-Nya kepada mereka, keutamaan yang paling besar yang mereka peroleh, namun pengenalan itu tidak mungkin diketahui sesuai keadaan-Nya, akan tetapi karena jika tidak dapat dicapai secara keseluruhan, maka tidak ditinggalkan seluruhnya (bahkan sebagiannya) perlu dicapai, maka Allah Subhaanahu wa Ta'aala mengingatkan dengan pengingatan yang membuat hati mereka bersinar, dada mereka menjadi lapang, dan dengan yang mereka capai itu, mereka dapat mengambil dalil terhadap yang belum mereka capai, mereka berkata sebagaimana yang dikatakan orang utama dan alim mereka, “Kami tidak dapat menjumlahkan pujian untuk-Mu. Engkau sebagaimana yang telah Engkau puji diri-Mu.” Oleh karena itu, keadaannya lebih agung dari itu. Permisalan ini termasuk mendekatkan makna yang tidak dapat dicapai oleh pikiran, karena maksudnya pohon-pohon meskipun jumlahnya lebih dari yang disebutkan, demikian pula lautan, maka ia tetap akan habis pula. Adapun kalimat Allah, maka tidak akan habis, dalil naqli dan aqli menunjukkan demikian. Segala sesuatu akan habis dan terbatas kecuali Allah Subhaanahu wa Ta'aala dan sifat-Nya. Jika terbayang dalam pikiran tentang hakikat awalnya Allah dan akhir-Nya, dan bahwa awal itu adalah apa yang diduga pikiran berupa waktu-waktu sebelumnya, namun Allah Subhaanahu wa Ta'aala sebelum itu tanpa batasnya, dan meskipun pikiran manusia, bahwa yang akhir itu adalah zaman-zaman terakhir, maka Allah Subhaanahu wa Ta'aala setelah itu tanpa ada batasan. Allah Subhaanahu wa Ta'aala pada setiap waktu memutuskan, berbicara, berfirman, berbuat bagaimana saja yang Dia kehendaki, dan jika Dia mengingikan sesuatu, maka tidak ada yang menghalangi ucapan dan perbuatan-Nya, jika akal manusia membayangkan, maka ia akan mengetahui bahwa permisalan yang Allah buat untuk kalimat-Nya adalah agar hamba mengetahui sebagian darinya, karena perkara yang sebenarnya lebih agung dan lebih besar lagi. Tidak ada yang dapat melemahkan-Nya. Dia memiliki keperkasaan semuanya, di mana tidak ada kekuatan di alam bagian atas maupun bagian bawah kecuali berasal dari-Nya. Dia memberikannya kepada makhluk-Nya, dan tidak ada daya dan pertolongan kecuali dari-Nya. Dengan keperkasaan-Nya, Dia kalahkan semua makhluk, bertindak terhadap mereka dan mengatur mereka. Dengan hikmah-Nya, Dia menciptakan makhluk, dan Dia memulainya dengan hikmah serta menjadikan akhir dan maksudnya karena hikmah, demikian pula perintah dan larangan, ada dengan hikmah, dan maksudnya pun hikmah (kebijaksanaan); Dia Mahabijaksana dalam ciptaan-Nya dan perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 27",
    "description": "Ayat ini menggambarkan betapa sempurna kuasa Allah dan betapa luas ilmu-Nya. Seandainya pohon-pohon di bumi menjadi pena dan lautan menjadi tinta, dan ditambahkan kepadanya tujuh lautan lagi untuk menjadi tinta setelah habis-Nya lautan yang pertama, niscaya tidak akan habis-habisnya kalimat-kalimat Allah dituliskan. Sesungguhnya Allah mahaperkasa, tidak ada satu pun yang sanggup mengalahkan-Nya mahabijaksana dalam setiap pengaturan dan kebijakan-Nya (lihat: al-kahf/18: 109). 28. Jika kehendak dan kuasa-Nya bersifat mutlak, maka menciptakan dan membangkitkan kamu setelah kematanmu bagi Allah hanyalah seperti menciptakan dan membangkitkan satu jiwa saja; itu sama sekali bukan hal sulit bagi-Nya. Sesungguhnya Allah maha mendengar, maha melihat (lihat pula: y's'n/36: 82)."
  }
]