[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penciptaan kalian (wahai manusia) dan kebangkitan kalian di Hari Kiamat dalam kemudahan dan keringanannya tidak lain kecuali seperti menciptakan satu jiwa dan membangkitkannya. Sesungguhnya Allah Maha Mendengar kata-kata kalian, Maha Melihat perbuatan kalian dan akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Penciptaan kalian -wahai manusia- dan kebangkitan kalian pada hari Kiamat untuk mendapatkan perhitungan amal dan pembalasan, kemudahannya tidak lain hanya seperti penciptaan dan pembangkitan satu jiwa saja. Sesungguhnya Allah Maha Mendengar, pendengaran-Nya terhadap satu suara tidak melalaikan-Nya dari pendengaran terhadap suara lainnya; Maha Melihat, penglihatan-Nya terhadap sesuatu tidak melalaikan-Nya terhadap penglihatan dari sesuatu yang lain, demikian pula penciptaan dan pembangkitan satu jiwa tidak melalaikan-Nya dari penciptaan dan pembangkitan jiwa-jiwa yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Hai para hamba, tidaklah penciptaan dan kebangkitan kalian pada hari kiamat, melainkan hanya seperti penciptaan dan pembangkitan satu jiwa saja. Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala kejadian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. مَّا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وٰحِدَةٍ ۗ (Tidaklah Allah menciptakan dan membangkitkan kamu (dari dalam kubur) itu melainkan hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja) Yakni kuasa Allah untuk membangkitkan seluruh makhluk-Nya dan untuk menciptakan mereka semua sama seperti kuasa-Nya untuk menciptakan satu makhluk dan membangkitkan satu makhluk, sebab Allah berkuasa untuk melakukan segala hal. إِنَّ اللهَ سَمِيعٌۢ( Sesungguhnya Allah Maha Mendengar) Segala yang terdengar. بَصِيرٌ(lagi Maha Melihat) Segala yang terlihat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Wahai manusia, Kami tidak menciptakan dan membangkitkan kalian dari kubur pada hari kiamat kecuali hanya seperti mencuptakan satu jiwa saja kemudian membangkitkannya. Sesungguhnya Allah Maha Mendengar dan Maha Melihat atas segala sesuatu. Ayat ini turun untuk beberapa orang Quraisy yang mengingkari hari kebangkitan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Penciptakan dan pembangkitkan kalian tidak lain kecuali seperti (membangkitkan) satu jiwa saja} seperti menciptakan dan membangkitkan satu jiwa saja dalam kemudahannya {Sesungguhnya Allah Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Kemudian Dia menjelaskan keagungan dan kesempurnaan kekuasaanNya, dan bahwa ia tidak bisa dibayangkan oleh akal pikiran, seraya berfirman, “Tidaklah Allah menciptakan dan membangkitkanmu (dari dalam kubur) itu melainkan hanyalah seperti menciptakan dan membangkitkan satu jiwa saja,” ini adalah sesuatu yang membingungkan akal, di mana bahwa penciptaan seluruh manusia yang begitu banyak dan pembangkitan kembali mereka sesudah mati setelah mereka tercerai berai hanya dalam sekejap saja, sebagaimana Dia menciptakan satu jiwa. Maka tidak ada jalan untuk memungkiri kebangkitan, kehidupan kembali dan pembalasan terhadap amal perbuatan, kecuali karena kebodohan akan keagungan Allah dan kehebatan kekuasaanNya. Kemudian Dia menjelaskan keumuman (keuniversalan) pendengaranNya terhadap segala sesuatu yang bisa di dengar, dan penglihatannya terhadap segala sesuatu yang bisa dilihat, seraya berfirman, “Sesungguhnya Allah Maha Mendengar lagi Maha Melihat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 28: Allah kemudian menyebutkan kesempurnaan keagungan dan kuasa-Nya. Dan sesungguhnya Dia tidak dilemahkan oleh sesuatu apapun, maka jika Allah menginginkan sesuatu maka Dia berkata “jadilah” maka jadi dengan kuasa-Nya. Allah menjelaskan bahwa ciptaan-Nya adalah dari keturunan Adam hingga hari kiamat nanti, yang Allah tidak akan kesulitan dalam membangkitkan di hari kiamat nanti; Sebagaimana penciptaan pada awal pertama kali itu sendiri, sesungguhnya Allah maha mendengar ucapan-ucapan kalian, maha melihat kondisi kalian, yang tidak tersembunyi bagi-Nya sesuatu apapun, dan akan dihisab seluruh makhluk pada hari kiamat berdasarkan seluruh amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan keagungan kekuasaan dan kesempurnaan-Nya, dan bahwa hal itu sulit dibayangkan oleh akal, tetapi segala sesuatu adalah mudah bagi-Nya. Karena cukup dengan kata, “Kun” (jadilah), maka jadilah ia. Hal ini merupakan sesuatu yang mengherankan akal, karena Dia mencipta semua makhluk meskipun banyak, dan membangkitkan setelah mati setelah terpisah-pisah dalam satu kejapan mata saja, seperti Dia menciptakan satu jiwa saja. Oleh karena itu, tidak ada alasan untuk menganggap mustahil kebangkitan dan pembalasan terhadap amal, pengingkaran terhadapnya hanyalah disebabkan kebodohannya terhadap keagungan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 28",
    "description": "Jika kehendak dan kuasa-Nya bersifat mutlak, maka menciptakan dan membangkitkan kamu setelah kematanmu bagi Allah hanyalah seperti menciptakan dan membangkitkan satu jiwa saja; itu sama sekali bukan hal sulit bagi-Nya. Sesungguhnya Allah maha mendengar, maha melihat (lihat pula: y's'n/36: 82). 29. Allah menundukkan dan mengendalikan apa saja yang ada di langit dan bumi. Di antara bentuk pengendaliannya ditunjukkan dalam ayat berikut. Wahai manusia, tidakkah engkau memperhatikan bahwa Allah telah memasukkan malam ke dalam siang sehingga pada musim panas waktu siang lebih panjang, dan sebaliknya memasukkan siang ke dalam malam sehingga pada musim dingin waktu malam lebih panjang, dan dia menundukkan matahari dan bulan agar sinar dan cahayanya memberi manfaat bagi makhluk hidup, di mana masing-masing terus beredar sampai kepada waktu yang ditentukan, yaitu hari kiamat. Sungguh, Allah mahateliti terhadap apa yang kamu kerjakan dan akan membalasnya sesuai amal perbuatanmu."
  }
]