[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak melihat bahwa Allah mengambil sebagian waktu dari malam sehingga siangnya menjadi panjang dan malamnya pendek, Dia mengambil sebagian waktu dari siang sehingga malamnya menjadi panjang dan siangnya menjadi pendek, Dia menundukkan matahari dan rembulan untuk kalian, masing-masing dari keduanya berjalan di atas orbitnya sampai waktu yang sudah ditentukan dan ditetapkan, dan sesungguhnya Allah maha mengetahui segala yang diperbuat makhluk-Nya dari kebaikan maupun keburukan, tiada sesuatu pun yang samar bagiNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Tidakkah kamu perhatikan bahwa Allah mengurangi waktu malam untuk menambah waktu siang, atau mengurangi waktu siang untuk menambah waktu malam dan Dia menentukan perputaran matahari dan bulan, maka masing-masing berputar menurut jalurnya hingga waktu yang telah ditentukan, dan bahwasanya Allah Maha Mengetahui, tidak ada sesuatu pun dari amal perbuatan kalian yang luput dari-Nya dan Allah akan membalasnya atas kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Hai manusia, tidakkah kalian melihat, bahwa Allah menjadikan malam dan siang saling memasuki, dengan menambah masa salah satunya dan mengurangi masa yang lain; dan Allah menundukkan matahari dan bumi untuk kemaslahatan manusia, masing-masing beredar di orbitnya hingga hari kiamat. Allah Maha Mengetahui segala perkataan dan perbuatan yang kalian kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. أَلَمْ تَرَ أَنَّ اللهَ يُولِجُ الَّيْلَ فِى النَّهَارِ وَيُولِجُ النَّهَارَ فِى الَّيْلِ (Tidakkah kamu memperhatikan, bahwa sesungguhnya Allah memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam) Yakni keduanya saling bergantian. وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ(dan Dia tundukkan matahari dan bulan) Yakni menjadikan keduanya tunduk dan taat untuk terbit dan tenggelam sebagai pengukur waktu dan penyempurna manfaat. كُلٌّ يَجْرِىٓ إِلَىٰٓ أَجَلٍ مُّسَمًّى(masing-masing berjalan sampai kepada waktu yang ditentukan) Terdapat pendapat mengatakan bahwa yang dimaksud dengan waktu di sini adalah waktu terjadinya hari kiamat. Dan pendapat lain mengatakan bahwa yang dimaksud adalah waktu terbit dan tenggelamnya matahari dan bulan. وَأَنَّ اللهَ بِمَا تَعْمَلُونَ خَبِيرٌ(dan sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan) Tidak ada yang tersembunyi dari-Nya, sebab Allah yang mampu melakukan hal-hal yang luar biasa ini maka kuasa-Nya untuk mengetahui apa yang kalian kerjakan lebih utama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Apakah engkau tidak melihat bahwa Allah memasukkan siang ke dalam malam dan malam ke dalam siang, sehingga salah satu bertambah dan lainnya menjadi berkurang. Kemudian Allah menundukkan matahari dan bulan dengan terbit dan terbenam. Itu sebagai pembatasan waktu dan pemberian manfaat. Matahari dan bulan, atau siang dan malam, kedua bergulir sesuai waktu dan jalurnya dengan waktunya sendiri. Sehingga semua berjalan berdasarkan hitungan daur bulan dan tahun. Allah Maha Memperhatikan terhadap setiap amal perbuatan. Tidak ada yang dapat tersembunyi dari pengawasan Allah. Allah akan memberi balasan kepada setiap orang sesuai dengan amal perbuatannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan bahwa sesungguhnya Allah memasukkan} memasukkan {malam ke dalam siang, memasukkan siang ke dalam malam, dan menundukkan} menundukkan {matahari dan bulan, masing-masing beredar sampai pada waktu yang ditentukan} waktu yang ditentukan {Sesungguhnya Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Ini juga, di dalamnya terdapat penjelasan tentang keesaanNya dalam berbuat dan mengatur, serta keluasan wewenangNya dalam berbuat memasukkan malam kepada siang dan memasukkan siang kepada malam. Apabila salah satunya masuk, maka yang satu hilang. Dan Dia menundukkan matahari dan bulan di mana keduanya berotasi (berjalan) dengan suatu aturan yang tidak pernah rusak semenjak penciptaan keduanya; untuk membangun berbagai kemaslahatan dan manfaat bagi manusia dalam urusan agama dan dunia mereka yang dengannya mereka dapat mengambil pelajaran dan mengambil manfaat. Dan “masing-masing” dari keduanya “berjalan sampai kepada waktu yang telah ditentukan,” apabila waktu yang telah ditentukan itu tiba, maka berhentilah perjalanannya dan hilanglah kekuatan keduanya. Dan hal ini (terjadi) pada Hari Kiamat pada saat matahari digulung, bulan ditenggelamkan dan negeri dunia berakhir serta dimulainya negeri akhirat. “Dan bahwa Allah terhadap amal yang kamu kerjakan” yang baik ataupun yang buruk, “Maha Mengetahui,” tidak ada sesuatu pun yang tersembunyi dariNYa, dan Dia akan memberikan pembalasan kepada kalian atas amal perbuatan kalian berupa pahala bagi orang-orang yang taat dan siksa bagi orang-orang yang durhaka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 29: Allah mengabarkan bahwasanya Dia memasukkan malam ke dalam siang, dan siang ke malam; Dia juga menundukkan matahari dan bulan yang berjalan dengan penjagaan dan aturan sampai waktu yang ditentukan dan waktu yang telah diketahui. Kemudian Allah menjelaskan, Dialah yang maha tahu atas seluruh amalan-amalan kalian serta akan membalas kalian atas amalan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini juga menerangkan keesaan-Nya dalam mengatur dan bertindak, Dia memasukkan malam ke dalam siang dan siang ke dalam malam, yakni jika salah satunya masuk, maka yang lain pergi. Demikian pula Allah Subhaanahu wa Ta'aala menundukkan matahari dan bulan, keduanya berjalan secara teratur, tidak kacau sejak keduanya diciptakan untuk menegakkan maslahat hamba, baik agama maupun dunia mereka, di mana mereka dapat mengambil pelajaran dan manfaat darinya. Yaitu hari Kiamat. Ketika tiba hari Kiamat, maka keduanya berhenti beredar, matahari akan digulung dan bulan pun dihilangkan cahayanya, kehidupan dunia berakhir dan kehidupan akhirat telah dimulai. Tidak samar bagi-Nya perbuatanmu baik atau buruk meskipun kecil, Dia akan memberinya balasan, dengan memberikan pahala kepada orang yang berbuat kebaikan dan memberikan hukuman kepada orang-orang yang berbuat kejahatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 29",
    "description": "Allah menundukkan dan mengendalikan apa saja yang ada di langit dan bumi. Di antara bentuk pengendaliannya ditunjukkan dalam ayat berikut. Wahai manusia, tidakkah engkau memperhatikan bahwa Allah telah memasukkan malam ke dalam siang sehingga pada musim panas waktu siang lebih panjang, dan sebaliknya memasukkan siang ke dalam malam sehingga pada musim dingin waktu malam lebih panjang, dan dia menundukkan matahari dan bulan agar sinar dan cahayanya memberi manfaat bagi makhluk hidup, di mana masing-masing terus beredar sampai kepada waktu yang ditentukan, yaitu hari kiamat. Sungguh, Allah mahateliti terhadap apa yang kamu kerjakan dan akan membalasnya sesuai amal perbuatanmu. 30. Allah menjelaskan tujuan dari penjelasan bukti-bukti kebesaran dan keesaan-Nya. Demikianlah, perjalanan alam semesta yang menakjubkan itu, karena sesungguhnya penciptanya adalah Allah; dialah tuhan yang maha esa yang layak disembah dengan sebenarnya, dan apa saja yang mereka seru dan sembah selain Allah adalah batil. Dan sesungguhnya Allah, dialah yang mahatinggi zat-Nya, mahabesar kekuasaan-Nya."
  }
]