[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ayat-ayat ini adalah petunjuk dan rahmat bagi orang-orang yang berbuat baik dengan mengamalkan apa yang Allah turunkan di dalam al-Quran dan apa yang diperintahkan kepada mereka oleh RasulNya Muhammad sholallohu alaihi wasallam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Yaitu petunjuk dan rahmat bagi orang-orang yang berbuat kebajikan dengan melaksanakan hak-hak Rabbnya dan hak-hak hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. هُدًى وَرَحْمَةً لِّلْمُحْسِنِين (menjadi petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan) Makna (المحسن) adalah orang yang melakukan kebaikan atau orang yang menyembah Allah seakan-akan ia melihat-Nya; sebagaimana disebutkan hadits tentang Jibril yang bertanya kepada Rasulullah, apa itu ihsan? Rasulullah menjawab: “yaitu jika kamu menyembah Allah seakan-akan kamu melihat-Nya.” Hal ini karena barangsiapa yang merasa diawasi Allah dan mengetahui bahwa Allah selalu melihatnya saat melakukan sesuatu niscaya ia akan menyembah Allah dengan sebaik-baiknya, sehingga ia akan melakukan amal shalih pada waktu yang paling utama dan dengan cara yang paling baik sebagaimana yang diajarkan Rasulullah, yang pada akhirnya kebaikannya akan menjadi sebab bertambahnya hidayah baginya yang merupakan sebab turunnya rahmat yang banyak baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Ayat-ayat itu adalah petunjuk dan rahmat bagi orang yang memperbaiki perbuatan mereka dengan Allah, manusia dan dirinya sendiri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebagai petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. akan tetapi, sekalipun Dia mahabijaksana yang mengajak kepada setiap akhlak mulia dan melarang dari setiap akhlak yang tercela, namun kebanyakan manusia tidak mendapat karunia untuk berpedoman kepadanya, tidak mau beriman dan mengamalkannya, kecuali orang yang diberi taufik dan dilindungi oleh Allah, sedangkan mereka bersikap ihsan dalam beribadah kepada Rabbnya, dan berbuat ihsan kepada sesama manusia. Sesungguhnya al-qur’an ini “petunjuk” bagi mereka yang membimbing mereka kepada jalan yang lurus dan mengingatkan mereka dari jalan-jalan (yang dapat menjerumuskan) ke neraka jahim. “dan rahmat” bagi mereka, yang dengannya mereka memperoleh kebahagiaan di dunia dan akhirat. Kebaikan yang berlimpah, pahala yang berlipat ganda, kesenangan dan kesukaan, serta tertolak drai mereka kesesatan dan kesengsaraan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 3: Allah menjelaskan bahwa ayat-ayat ini Kami turunkan kepada Nabi Kami Muhammad ﷺ, yaitu sebagai ayat-ayat petunjuk dan rahmat bagi mereka yangn baik dalam ucapan dan amalan; Serta orang- orang yang muhsin yaitu mereka yang beramal dengan banyak kebaikan, mereka yang menegakkan ibadah kepada Allah dan menyebarkan kebaikan, yaitu mereka yang beribadah kepada Allah dengan ikhlas di atas ilmu, keyakinan dan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menunjukkan mereka ke jalan yang lurus. Dengannya mereka dapat berbahagia di dunia dan akhirat, memperoleh kebaikan yang banyak, pahala yang besar, kegembiraan dan keberuntungan, serta terhindar dari kesesatan dan kesengsaraan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 3",
    "description": "1-3. Alif l'm m'm. Inilah ayat-ayat Al-Qur'an yang meski tersusun dari huruf-huruf yang dikenal oleh masyarakat arab namun mereka tidak mampu membuat tandingannya. Inilah ayat-ayat yang mengandung hikmah dan pelajaran yang tidak bertentangan antara satu ayat dengan lainnya. Kami turunkan Al-Qur'an ini sebagai petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan, yaitu mereka yang senantiasa beramal saleh dengan ikhlas. 4-5. Mereka yang berbuat kebajikan itu ialah orang-orang yang melaksanakan salat secara konsisten dan sempurna sesuai syarat dan rukunnya, menunaikan zakat sebagai bukti komitmen sosialnya, dan mereka tanpa keraguan sedikit pun meyakini adanya akhirat. Merekalah orang-orang yang tetap mendapat petunjuk dari tuhannya dan mereka itulah orang-orang yang memperoleh ke-beruntung-an hakiki, yakni selamat dari neraka dan masuk surga."
  }
]