[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Semua itu merupakan bukti besarnya kuasa Allah dan agar kalian mengetahui dan mengakui bahwa Allah adalah Haq pada dzat, sifat-sifat dan perbuatan-perbuatanNya, dan bahwa apa yang kalian sembah selain Allah adalah batil, dan bahwa Allah adalah Mahatinggi dengan Dzat-Nya, kedudukanNya, dan kekuasaan-Nya di atas seluruh makhluk-Nya, juga Mahabesar atas segala sesuatu, dan segala sasuatu selainNya tunduk kepadaNya. Hanya Dia semata yang berhak untuk disembah, bukan selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Pengaturan dan ketentuan itu menjadi saksi bahwa Allah sajalah yang Mahabenar, bahwa Dia Mahabenar dalam Żat, sifat dan perbuatan-Nya, bahwa apa yang disembah oleh orang-orang musyrik selain Allah adalah batil, tidak mempunyai dasar; dan menjadi saksi bahwa Allah Mahatinggi dalam Żat-Nya, keperkasaan dan kekuasaan-Nya di atas seluruh makhluk-makhluk-Nya, tidak ada yang lebih tinggi dari-Nya, Yang Mahabesar dari segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Fenomena dari siang dan malam itu tidak pernah terlepas dari kehidupan manusia, agar kalian beriman dan yakin bahwa Allah adalah Tuhan Yang Haq yang wajib disembah Semata, dan segala patung dan berhala yang disembah manusia adalah batil. Allah Maha Tinggi di atas seluruh makhluk, Dia memiliki kebesaran pada Dzat dan sifat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. ذٰلِكَ بِأَنَّ اللهَ هُوَ الْحَقُّ (Demikianlah, karena sesungguhnya Allah, Dialah yang hak) Yakni Allah melakukan hal ini agar mereka mengatahui bahwa Allah adalah Tuhan yang sesungguhnya. وَأَنَّ مَا يَدْعُونَ مِن دُونِهِ الْبٰطِلُ(Dialah yang hak dan sesungguhnya apa saja yang mereka seru selain dari Allah itulah yang batil) Yakni berhala atau yang lainnya yang mereka jadikan sekutu Allah. وَأَنَّ اللهَ هُوَ الْعَلِىُّ(dan sesungguhnya Allah Dialah Yang Maha Tinggi) Di atas ‘arsy-Nya yang berada di atas langit, dan Maha Tinggi dengan kuasa dan keagungan-Nya. الْكَبِيرُ (lagi Maha Besar) Yakni memiliki keagungan dalam ketuhanan dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Itu semua yang disebut adalah bukti keluasan ilmu Allah, kesempurnaan kekuasaan-Nya, dan kesempurnaan segala penciptaan-Nya. Agar mereka tahu bahwa Allah adalah Maha Benar dalam Dzat-Nya, Yang paling berhak untuk disembah. Adapun berhala-berhala yang disembah oleh orang-orang musyrik hakikatnya adalah tidak ada, jika dibandingkan deng Dzat Ketuhanan Allah. Allah Maha Tinggi, Maha Tinggi atas segala ciptaan-Nya, Maha Mengalahkan/Menguasai atas segala sesuatu. Maha Agung, Yang Menguasai Kerajaan yang sebenarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu karena sesungguhnya Allahlah yang Maha Benar, dan apa saja yang mereka seru selain Allah itu palsu, dan sesungguhnya Allahlah Yang Maha tinggi lagi Maha besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Demikianlah,” yang Dia jelaskan kepada kalian dari keagunganNya dan sifat-sifatNya itu adalah, “karena sesungguhnya Allah, Dia-lah yang haq,” pada DZat dan sifat-sifatNya; dan agamaNya pun haq, para RasulNya haq, janjiNya haq, ancamanNya haq dan beribadah kepadaNya haq. “Dan bahwasanya apa saja yang mereka seru selain dariNya itulah yang batil,” pada dzat dan sifat-sifatnya. Kalau saja bukan penciptaan Allah padanya, tentu ia tidak akan pernah ada, dan kalau saja bukan karena karuniaNya, tentu tidak akan ada yang tersisa darinya. Maka kalau ia batil (palsu) maka menyembahnya pun tentu lebih batil dan lebih batil lagi. “Dan bahwa Allah Dia-lah Yang Mahatinggi,” dengan DzatNya di atas seluruh makhlukNYa, yang Mahatinggi sifat-sifatNya (Maha tidak mungkin) kalau dianalogikan dengan sifat-sifat siapa pun di antara makhlukNYa, dan Dia Tinggi (menguasai) manusia dan mengendalikan mereka, “lagi Mahabesar,” yang milikNya-lah kebesaran pada DzatNya dan sifat-sifatNya, dan milikNya-lah kebesaran di dalam jiwa penghuni langit dan bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 30: Allah menjelaskan bahwa ciptaan dan penjagaan-Nya dan seluruh sifat-Nya yang agung, menunjukkan bahwa Allah adalah sesembahan yang disembah dengan benar tanpa selain-Nya, dan seluruh sesembahan yang di ibadahi selain Allah adalah bathil. Sungguh Allah, Dialah yang maha tinggi dzat-Nya dan berkuasa. Allah yang maha tahu yang memiliki kebesaran pada dzat dan sifat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia telah menerangkan sebagian di antara keagungan dan sifat-sifat-Nya. Maksudnya, zat-Nya hak (benar), sifat-Nya hak, agama-Nya hak, para rasul-Nya hak, janji-Nya hak, ancaman-Nya hak, dan beribadah hanya kepada-Nya itulah yang hak. Baik zatnya maupun sifatnya. Kalau Allah tidak mewujudkannya, tentu ia tidak ada. Oleh karena ia adalah batil, maka menyembahnya adalah kebatilan yang paling batil. Zat-Nya Mahatinggi di atas semua makhluk, sifat-Nya pun tinggi, sehingga tidak bisa dibandingkan dengan sifat makhluk, Dia berada di atas makhluk-Nya dan mengungguli mereka. Dia memiliki kebesaran baik zat-Nya maupun sifat-Nya. Dia pun dibesarkan dan diagungkan di hati para penduduk langit dan bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 30",
    "description": "Allah menjelaskan tujuan dari penjelasan bukti-bukti kebesaran dan keesaan-Nya. Demikianlah, perjalanan alam semesta yang menakjubkan itu, karena sesungguhnya penciptanya adalah Allah; dialah tuhan yang maha esa yang layak disembah dengan sebenarnya, dan apa saja yang mereka seru dan sembah selain Allah adalah batil. Dan sesungguhnya Allah, dialah yang mahatinggi zat-Nya, mahabesar kekuasaan-Nya. 31. Allah memaparkan fenomena-fenomena di bumi yang menjadi bukti kekuasaan dan keesaan-Nya. Wahai orang yang berakal, tidakkah engkau memperhatikan bahwa sesungguhnya kapal itu berlayar di laut dan tidak tenggelam dengan berkat rahmat Allah melalui pengetahuan yang dia anugerahkan kepadamu sehingga bisa mengangkut barang-barang yang engkau butuhkan sebagai nikmat Allah, agar dengan itu semua diperlihatkan-Nya kepadamu sebagian dari tanda-tanda kebesaran-Nya. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran-Nya bagi setiap orang yang sangat sabar dalam menghadapi ujian-Nya dan banyak bersyukur atas nikmat-Nya."
  }
]