[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak melihat (wahai orang yang menyaksikan) bahwa kapal-kapal itu berjalan di laut dengan perintah Allah sebagai nikmat dariNya kepada makhlukNya, agar Dia memperlihatkan pelajaran-pelajaran dan hujjah-hujjahNya kepada kalian yang bisa membuat kalian mengambil pelajaran? Sesungguhnya berlayarnya kapal-kapal itu di laut merupakan bukti bagi orang-orang yang sangat sabar dalam menjauhi hal-hal yang diharamkan Allah dan sangat sabar atas ketaatan kepadaNya serta sangat sabar atas takdirnya, lagi banyak bersyukur atas nikmat-nikmatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Tidakkah kamu melihat bahwa kapal berjalan di lautan karena kelembutan-Nya dan arahan-Nya, untuk menunjukkan kepada kalian -wahai manusia- di antara tanda-tanda yang menunjukkan kekuasaan-Nya dan kelembutan-Nya. Sesungguhnya dalam hal yang demikian ini terdapat bukti-bukti atas kekuasaan-Nya bagi orang-orang yang bersabar atas musibah yang menimpanya, dan bagi orang-orang yang bersyukur atas kenikmatan yang didapatkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Hai hamba Allah, tidakkah kamu melihat kapal-kapal yang berlayar di lautan dengan kelembutan dan rahmat Allah, agar Dia menunjukkan kepada kalian keagungan ayat-ayat-Nya dan kebesaran kuasa-Nya? Sungguh pada perkara besar ini terdapat tanda-tanda yang menunjukkan keesaan Allah bagi setiap orang yang bersabar dalam mentaati Allah dan bersyukur atas semua kenikmatan-Nya yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. أَلَمْ تَرَ أَنَّ الْفُلْكَ تَجْرِى فِى الْبَحْرِ بِنِعْمَتِ اللهِ (Tidakkah kamu memperhatikan bahwa sesungguhnya kapal itu berlayar di laut dengan nikmat Allah) Yakni dengan kelembutan dan rahmat-Nya bagi kalian, sebab dengan kapal itu kalian dapat berjalan di atas air dengan tenang ketika kalian dalam perjalanan di lautan untuk mencari rezeki. لِيُرِيَكُم مِّنْ ءَايٰتِهِۦٓ ۚ( supaya diperlihatkan-Nya kepadamu sebahagian dari tanda-tanda (kekuasaan)-Nya) Yakni apa yang kalian saksikan dari bukti-bukti kekuasaan Allah dan apa yang Allah berikan bagi kalian di laut. إِنَّ فِى ذٰلِكَ لَءَايٰتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ (Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi semua orang yang sangat sabar lagi banyak bersyukur) Yakni bagi orang yang memiliki kesabaran yang besar dan rasa syukur yang banyak. Ia bersabar untuk tidak berbuat kemaksiatan, serta mensyukuri kenikmatan yang Allah berikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Apakah engkau tidak melihat, bahwa perahu-perahu itu bisa berjalan di atas air dengan cepat di atas laut sebab Kemahalembutan, rahmat, serta kemurahan Allah untuk menunjukkan kepada kalian bentuk kekuasaan, bukti dan keajaiban kekuasaan dan ciptaan-Nya. Segala kenikmatan yang disebutkan itu sebagai tanda dan bukti bagi orang-orang yang senantiasa sabar terhadap segala cobaan dan maksiat serta orang-orang yang selalu bersyukur kepada Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan bahwa sesungguhnya kapal itu} bahtera itu {berlayar di laut berkat nikmat Allah} rahmat dan perintahNya {agar Dia memperlihatkan kepada kalian sebagian dari ayat-ayatNya. Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi setiap orang yang sangat sabar dan banyak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Maksudnya, tidakkah kamu melihat sebagian dari tanda-tanda kekuasaanNya, rahmatNya, dan perhatianNya kepada hamba-hambaNya, yaitu menundukkan lautan, di mana kapal dapat berlayar dengan perintahNya yang bersifat taqdiri (ketetapan) dan kehalusan dan kebaikanNYa, “supaya diperlihatkanNYa kepadamu sebagian dari tanda-tandaNYa,” karena di dalamnya terdapat manfaat dan pelajaran. “Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi semua orang yang sangat sabar lagi banyak bersyukur,” merekalah yang memanfaatkan ayat-ayat tersebut, “yang sangat sabar,” atas segala kesempitan, “lagi banyak bersyukur” atas segala kelapangan. Penyabar dalam menjalankan ketaatan kepada Allah dan terhadap maksiat serta terhadap takdir-takdirNya, lagi penuh syukur kepada Allah atas segala nikmatNya yang bersifat duniawi, dan yang ukhrawi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 31: Allah mengabarkan bahwasanya kapal-kapal berjalan di atas lautan dengan nimat Allah, karunia dan kasih sayang-Nya. Maka bawalah barang dagangan kalian di lautan untuk mencari rezeki, agar kalian melihat tanda-tanda kuasa Allah, sehingga bermanfaat bagi kalian dan menjadi pelajaran darinya. Sungguh semua itu adalah tanda dari kuasa Allah, kesabaran dan kasih sayang-Nya. Akan mengambil manfaat dari tanda-tanda ini setiap hamba yang memiliki banyak kesabaran atas ketaatan kepada Allah dan dari bermaksiat kepada-Nya, dan atas segala takdirnya hamba tersebut mengambil pelajaran serta banyak bersyukur kepada Allah atas kenikmatan agama dan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidakkah engkau memperhatikan di anatar atsar (pengaruh) qudrat (kekuasaan)-Nya, rahmat-Nya dan perhatian-Nya kepada hamba-hamba-Nya, Dia menundukkan lautan sehingga kapal dapat berlayar di sana dengan perintah qadari-Nya, dengan kelembutan dan ihsan-Nya. Di sana terdapat manfaat dan pelajaran. Dari maksiat kepada Allah. Mereka yang bersabar terhadap musibah dan bersyukur terhadap kenikmatan itulah yang dapat mengambil manfaat dari ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 31",
    "description": "Allah memaparkan fenomena-fenomena di bumi yang menjadi bukti kekuasaan dan keesaan-Nya. Wahai orang yang berakal, tidakkah engkau memperhatikan bahwa sesungguhnya kapal itu berlayar di laut dan tidak tenggelam dengan berkat rahmat Allah melalui pengetahuan yang dia anugerahkan kepadamu sehingga bisa mengangkut barang-barang yang engkau butuhkan sebagai nikmat Allah, agar dengan itu semua diperlihatkan-Nya kepadamu sebagian dari tanda-tanda kebesaran-Nya. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran-Nya bagi setiap orang yang sangat sabar dalam menghadapi ujian-Nya dan banyak bersyukur atas nikmat-Nya. 32. Ayat ini menjelaskan sifat dasar manusia, terutama mereka yang kufur atas nikmat-Nya. Apabila mereka digulung ombak yang besar seperti gunung dan hampir menenggelamkan kapal yang mereka tumpangi, mereka kembali ke fitrahnya, yakni menyeru Allah seraya memohon keselamatan dari-Nya dengan tulus ikhlas serta beragama, yakni pernyataan sikap tunduk dan patuh kepada-Nya, bahkan berjanji tidak menyekutukan-Nya. Tetapi, ketika Allah menyelamatkan mereka dari ombak besar itu sehingga mereka selamat sampai di daratan, maka sebagian mereka ada yang tetap menempuh jalan yang lurus dengan mengakui keesaan-Nya. Adapun yang mengingkari ayat-ayat kami, padahal dia memohon pertolongan kami saat tertimpa cobaan, sungguh mereka itu hanyalah pengkhianat yang tidak berterima kasih. Dari ayat ini dapat disimpulkan bahwa pengakuan tentang keesaan Allah merupakan fitrah manusia yang bisa disimpangkan dalam waktu tertentu, namun di saat kritis kesadaran tersebut akan muncul kembali."
  }
]