[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila orang-orang Musyrik naik kapal, lalu ombak mengepung kapal itu dari segala arah seperti awan dan gunung, lalu menimpa mereka rasa cemas dan takut tenggelam, mereka berdoa kepada Allah dan mengikhlaskannya untukNya semata, namun setelah Allah menyelamatkan mereka ke darat, maka diantara mereka ada yang bersikap pertengahan dengan tidak bersyukur kepada Allah secara sempurna, dan diantara mereka ada ingkar dan kafir kepada nikmat-nikmat Allah. dan tidak ada yang kafir kepada ayat-ayat dan hujjah-hujjah Kami yang menunjukkan kesempurnaan kodrat dan keesaan Kami kecuali setiap pengkhianat yang suka membatalkan perjanjian, dan pengingkar nikmat-nikmat Allah atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan apabila ombak besar seperti gunung dan awan mengepung mereka dari segala penjuru, mereka berdoa kepada Allah semata dengan mengikhlaskan doa dan ibadah hanya untuk-Nya. Tatkala Allah mengabulkan permohonan mereka dan menyelamatkan mereka ke daratan dan menghindarkan mereka dari tenggelam, di antara mereka ada yang berbuat sekedarnya saja, tidak melakukan hal yang wajib atasnya berupa ungkapan rasa syukur dengan sempurna, dan di antara mereka ada yang mengingkari nikmat Allah. Dan tidaklah mengingkari nikmat Allah kecuali orang-orang yang khianat -seperti orang yang berjanji kepada Allah apabila ia diselamatkan maka ia akan menjadi orang-orang yang bersyukur- dan orang-orang yang ingkar terhadap nikmat-nikmat Allah, tidak bersyukur kepada Rabbnya yang telah memberikan kenikmatan kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Dan jika ombak lautan meninggi saat orang-orang musyrik berlayar, kemudian mereka terkepung oleh ombak besar yang seperti gunung dan awan; maka mereka akan berdoa kepada Allah dan meminta pertolongan kepada-Nya semata. Namun ketika Allah menyelamatkan mereka ke daratan, mereka terbagi menjadi dua golongan; salah satunya tidak bersyukur kepada Allah dengan semestinya, dan golongan yang lain kembali kepada kekafirannya. Dan tidaklah ada yang mendustakan ayat-ayat Allah melainkan orang yang penipu dan sangat ingkar terhadap karunia dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَإِذَا غَشِيَهُم مَّوْجٌ كَالظُّلَلِ (Dan apabila mereka dilamun ombak yang besar seperti gunung) Allah menyerupakan ombak yang sangat besar ini dengan sesuatu yang dapat menaungi manusia seperti gunung, awan, dan lain sebagainya. دَعَوُا۟ اللهَ مُخْلِصِينَ لَهُ الدِّينَ(mereka menyeru Allah dengan memurnikan ketaatan kepada-Nya) Mereka tidak bersandar kepada selain Allah untuk menyelamatkan diri dari ombak lautan, sebab mereka mengetahui dengan pasti bahwa tidak ada yang dapat memberi manfaat atau mudharat kecuali Allah; oleh sebab itu mereka tidak berdoa kepada berhala-berhala mereka, bahkan mereka melupakannya pada keadaan tersebut. فَلَمَّا نَجَّىٰهُمْ إِلَى الْبَرِّ(maka tatkala Allah menyelamatkan mereka sampai di daratan) Mereka menjadi dua golongan. Golongan pertama,مُّقْتَصِدٌ ۚ (orang yang tetap menempuh jalan yang lurus) yakni ia menepati janji yang telah ia buat dengan Allah ketika di lautan bahwa ia hanya menyembah-Nya, dan ia tetap melakukan itu saat selamat sampai di daratan. Dan golongan lainnya adalah golongan orang yang kafir. وَمَا يَجْحَدُ بِـَٔايٰتِنَآ إِلَّا كُلُّ خَتَّارٍ كَفُورٍ(Dan tidak ada yang mengingkari ayat-ayat Kami selain orang-orang yang tidak setia lagi ingkar) Makna (الختار) adalah selalu ingkar dalam janjinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Apabila mereka digulung oleh ombak yang besar seperti gunung, yang menyapu mereka dari bawah mereka. Berupa gunung-gunung, atau awan dan lain-lainnya, mereka bermunajat kepada Allah dengan penuh keikhlasan, kekhusyuan dan dengan penuh kerendahan diri. Namun sesudah mereka diselamatkan sampai ke darat, mereka justru terbagi menjadi dua kelompok. Kelompok pertama menepati apa yang telah mereka perjanjikan kepada Allah dengan didasari keikhlasan dalam beragama. Namun kelompok yang kedua berkhianat dan tidak menepati janji mereka. Tidak ada yang menginglngkari ayat Kami kecuali merekalah para pengkhianat yang tidak berterimakasih atas nikmat Allah kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mereka digulung} digulung {ombak besar seperti awan tebal} seperti gunung dan awan tebal {mereka menyeru kepada Allah dengan memurnikan ketaatannya hanya untukNya. Kemudian ketika Allah menyelamatkan mereka sampai di daratan, sebagian di antara mereka yang tetap menempuh jalan yang lurus} tetap lurus tidak melakukan kesyirikan kepada Allah karena kesempurnaanNya {Tidak ada yang mengingkari ayat-ayat Kami kecuali pengkhianat} pengkhianat yang mengingkari janji {lagi ingkar} menyangkal nikmat dan tidak mensyukurinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah menjelaskan kondisi manusia pada saat mereka mengarungi lautan dan berkecamuknya ombak seperti gunung berada di atas mereka, yaitu mereka menuluskan doa dan ibadah hanya kepada Allah, “lalu tatkala Allah menyelamatkan mereka sampai di daratan,” mereka terbagi menjadi dua kelompok. Satu kelompok muqtashidah. Maksudnya, tidak bersukur kepada Allah dengan sempurna, malah mereka adalah orang-orang yang melakukan dosa dan zhalim terhadap diri mereka sendiri; dan satu kelompok lagi kafir terhadap nikmat Allah dan mengingkarinya. Maka dari itu, Dia berfirman, “Dan tidak ada yang mengingkari ayat-ayat Kami kecuali orang-orang yang mengkhianati,” yaitu para pengkhianat. Di antara pengkhianatannya adalah bbahwa sebelumnya dia telah berjanji kepada Allah, jika Engkau menyelamatkan kami dari lautan dan kesengsaraannya, maka kami akan menjadi orang-orang yang bersyukur. Namun dia merusak janjinya dan dia tidak memenuhinya, “lagi ingkar” terhadap nikmat-nikmat Allah. Tidaklah pantas bagi orang yang telah diselamatkan oleh Allah dari kesengsaraan (kesempitan) itu melainkan tindakan penuh bersyukur atas nikmat-nikmatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 32: Allah menyebutkan keadaan orang-orang musyrik jika mereka menaiki kapal di lautan, kemudian didapati angin yang sangat kencang, dan ombak yang tinggi sebagaimana gunung serta kapal teromang-ambing dan takut akan tenggelam; Mereka menyeru kepada Allah dengan ikhlas beserta agama-Nya, akan tetapi setelah Allah kabulkan doa mereka, Allah selamatkan dan terhindar dari kebinasaan, maka mereka mendustakan agama Allah sebagaimana dikatakan oleh ahli tafsir Mujahid. Allah kemudian menjelaskan bahwa mereka tidaklah mendustakan dan kufur kepada ayat-ayat Allah kecuali mereka bekhianat sebagaimana yang dikatakan oleh Ibnu Katsir. Dan menolak segala nikmat Allah baginya, tidak bersyukur atas nikmat tersebut; Bahkan mereka melupakan dan tidak mengingatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang kafir. Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan keadaan manusia ketika menaiki kapal, lalu mereka diterjang oleh ombak besar, maka ketika itu mereka berdoa kepada Allah saja, tetapi setelah Allah menyelamatkan mereka, maka mereka terbagi menjadi dua bagian; ada yang bersikap pertengahan, yakni mereka tidak bersyukur kepada Allah secara sempurna, tetapi mereka dalam keadaan berdosa dan menzalimi diri mereka, dan ada pula yang kufur kepada nikmat Allah lagi mengingkari nikmat itu. Ada pula yang mengartikan “sikap pertengahan”, bahwa di antara mereka ada yang mengakui keesaan Allah, dan di antara mereka ada yang tetap di atas kekafirannya. Termasuk di antaranya adalah penyelamatan-Nya dari ombak yang besar. Dia mengkhianati perjanjian dengan Tuhannya, di mana dia berjanji bahwa jika Allah menyelamatkannya, dia akan bersyukur dan akan mengesakan-Nya. Tetapi, ternyata dia tidak memenuhi janjinya. Padahal tidak ada sikap yang pantas dilakukan bagi orang yang telah diselamatkan Allah selain bersyukur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 32",
    "description": "Ayat ini menjelaskan sifat dasar manusia, terutama mereka yang kufur atas nikmat-Nya. Apabila mereka digulung ombak yang besar seperti gunung dan hampir menenggelamkan kapal yang mereka tumpangi, mereka kembali ke fitrahnya, yakni menyeru Allah seraya memohon keselamatan dari-Nya dengan tulus ikhlas serta beragama, yakni pernyataan sikap tunduk dan patuh kepada-Nya, bahkan berjanji tidak menyekutukan-Nya. Tetapi, ketika Allah menyelamatkan mereka dari ombak besar itu sehingga mereka selamat sampai di daratan, maka sebagian mereka ada yang tetap menempuh jalan yang lurus dengan mengakui keesaan-Nya. Adapun yang mengingkari ayat-ayat kami, padahal dia memohon pertolongan kami saat tertimpa cobaan, sungguh mereka itu hanyalah pengkhianat yang tidak berterima kasih. Dari ayat ini dapat disimpulkan bahwa pengakuan tentang keesaan Allah merupakan fitrah manusia yang bisa disimpangkan dalam waktu tertentu, namun di saat kritis kesadaran tersebut akan muncul kembali. 33. Beralih dari pemaparan bukti-bukti keesaan dan kekuasaan-Nya, Allah dalam ayat ini memerintahkan manusia bertakwa kepada-Nya dan takut akan datangnya hari kiamat. Wahai manusia! bertakwalah kepada tuhanmu yang menciptakanmu dan memberimu rezeki serta menundukkan dan mengendalikan alam ini demi memenuhi kebutuhanmu, dan takutlah kamu pada hari yang ketika itu seorang bapak tidak dapat menolong anaknya, dan seorang anak tidak pula dapat menolong bapaknya sedikit pun. Bertakwalah dengan menunjukkan penghambaan yang tulus kepada-Nya. Sungguh, hari kebangkitan, pahala, dan siksa yang merupakan janji Allah pasti benar, maka janganlah sekali-kali kamu teperdaya oleh kehidupan dunia yang fana, dan jangan sampai kamu teperdaya oleh penipu yang salah dalam memahami Allah, seakan dia membiarkan mereka sesat dengan tidak menurunkan azab, padahal turunnya azab itu hanya ditunda sesaat."
  }
]