[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai manusia, bertakwalah kepada Tuhan kalian dan taatilah Dia dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya. Takutlah kepada Hari Kiamat di mana saat itu orangtua tidak bisa membantu anak, dan sebaliknya anak tidak bisa membantu orangtuanya sedikitpun. Sesungguhnya janji Allah adalah haq, tidak ada keraguan padanya. Maka Janganlah kalian tertipu oleh kehidupan dunia dan keindahannya, sehingga dia membuat kalian lupa terhadap kehidupan akhirat. Dan Janganlah sampai kalian tertipu oleh penipu yang berwujud setan jin atau manusia dalam (menaati) Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Wahai manusia! Bertakwalah kepada Rabb kalian dengan menaati segala perintah-Nya dan meninggalkan segala larangan-Nya, dan takutlah terhadap siksa pada hari di saat orang tua tidak bisa menolong anaknya dan seorang anak tidak bisa menolong orang tuanya. Sesungguhnya janji Allah untuk membalas pada Hari Kiamat adalah janji yang pasti, tidak mungkin meleset, maka janganlah kehidupan dunia dengan segala kesenangan dan kelalaiannya ini menipu kalian, dan janganlah setan menipu kalian dengan kelembutan Allah atas kalian dan diakhirkan-Nya siksa dari kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Allah memerintahkan manusia untuk mentaati-Nya, mengikuti perintah-Nya, dan takut dari hari kiamat yang menjadi waktu perhitungan amal, saat seorang ayah tidak bermanfaat bagi anaknya dan seorang anak tidak bermanfaat bagi ayahnya. Dan Allah memperingatkan mereka dari tipuan dunia dan kenikmatannya, dan dari tipuan setan dari golongan jin dan manusia dan makar mereka untuk menjauhkan dari keimanan kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. يٰٓأَيُّهَا النَّاسُ اتَّقُوا۟ رَبَّكُمْ وَاخْشَوْا۟ يَوْمًا لَّا يَجْزِى وَالِدٌ عَن وَلَدِهِۦ (Hai manusia, bertakwalah kepada Tuhanmu dan takutilah suatu hari yang (pada hari itu) seorang bapak tidak dapat menolong anaknya) Yakni ia tidak akan dapat memberinya manfaat sedikitpun karena ia telah sibuk dengan dirinya sendiri. وَلَا مَوْلُودٌ هُوَ جَازٍ عَن وَالِدِهِۦ شَيْـًٔا ۚ (dan seorang anak tidak dapat (pula) menolong bapaknya sedikitpun) Dan terlebih lagi kerabat lainnya tidak akan menolong nya, dan terlebih lagi orang yang asing baginya. Ya Allah, jadikanlah kami orang yang tidak berharap kepada selain-Mu, dan janganlah sandarkan kami kepada selain-Mu. إِنَّ وَعْدَ اللهِ حَقٌّ ۖ( Sesungguhnya janji Allah adalah benar) Tidak akan diingkari. Kebaikan yang dijanjikan-Nya atau siksaan yang Dia ancamkan pasti akan Dia tepati. وَلَا يَغُرَّنَّكُم بِاللهِ الْغَرُورُ (dan jangan (pula) penipu (syaitan) memperdayakan kamu dalam (mentaati) Allah) Yang dimaksud dengan (الغرور) adalah setan yang selalu menipu manusia dan menjadikan mereka berangan-angan dengan angan-angan batil, serta melalaikan mereka dari akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Wahai manusia, bertakwalah kalian kepada Tuhan kalian dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya. Hati-hatilah dengan kedatangan hari kiamat, hari dimana orang tua tidak memperdulikan anak-anaknya lagi dan begitu sebaliknya. Sesungguhnya janji Allah untuk membangkitkan mereka, mengitung amal serta memberi balasan atas amal mereka itu adalah suatu kepastian. Maka janganlah kalian terperdaya dengan kehidupan dunia baik dengan keindahan dan rasa bangga terhadapnya, sehingga menjauhkan kalian dari kehidupan akhirat. Juga jangan terperdaya oleh bujukan setan, yang dapat membelokkanmu dari iman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai manusia, bertakwalah kepada Tuhan kalian dan takutlah pada hari dimana seorang ayah tidak dapat membela} ayah tidak berguna {untuk anaknya dan seorang anak tidak dapat membela} berguna {untuk bapaknya sedikit pun. Sesungguhnya janji Allah itu benar, maka janganlah sekali-kali kalian diperdaya} jangan sampai kalian dikelabui {oleh kehidupan dunia dan jangan sampai karena Allah kalian diperdaya oleh penipu} setan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Allah memerintahkan kepada manusia agar bertakwa kepadaNya, takwa yang berarti mematuhi perintah-perintahNya dan meninggalkan larangan-laranganNya, dan menarik perhatian mereka untuk takut kepada Hari Kiamat, yaitu hari yang sangat dahsyat yang pada saat itu setiap orang hanya sibuk dengan dirinya sendiri, dan “seorang bapak tidak dapat menolong anaknya dan seorang anak tidak pula dapat menolong,” bapaknya sedikit pun; tidak bisa menambah kebaikan-kebaikannya dan tidak pula bisa mengurangi dosa-dosanya, karena sesungguhnya setiap orang sudah selesai amalnya dan sudah pasti balasannya. Jadi, memalingkan pandangan kepada hari yang sangat mengerikan ini termasuk hal yang dapat menguatkan sang hamba dan memudahkan baginya untuk bertakwa kepada Allah. Ini merupakan bentuk rahmat Allah kepada hamba-hambaNya; Dia memerintah mereka agar bertakwa kepadaNya yang di dalamnya terdapat kebahagiaan mereka, dan menjanjikan pahala kepada mereka atas ketakwaannya, dan Dia mengingatkan mereka dari siksaanNYa, membuat mereka takut kepadaNya dengan nasihat-nasihat dan hal-hal yang menakutkan. Maka segala puji bagiMu, wahai Rabb semesta alam. “SEsungguhnya janji Allah adalah benar,” maka janganlah kalian meragukannya, dan janganlah kalian mengerjakan pekerjaan orang yang tidak membenarkan (janji). Maka dari itu Allah berfirman, “Maka janganlah sekali-kali kehidupan dunia memperdayakan kamu” karena keindahan, kegemerlapan dan segala apa yang terdapat di dalamnya berupa fitnah dan cobaan. “Dan jangan pula penipu (setan) memperdayakan kamu dalam (menaati) Allah,” yaitu setan yang selalu menipu manusia dan tidak pernah melalaikannya sepanjang waktu. Yang demikian itu, Karena Allah memiliki hak atas hamba-hambaNya, dan Dia pun sudah menjanjikan kepada mereka suatu janji yang mana Dia akan memberikan balasan kepada mereka sesuai dengan amal-amal perbuatan mereka, dan apakah mereka telah menunaikan hakNya atau mengabaikannya? Ini adalah satu perkara yang wajib diperhatikan dan hendaklah dijadikan oleh seorang hamba sebagai pusat perhatiannya dan modal perniagaan yang diusahakannya. Dan di antara rintangan dan hambatan yang menghalanginya adalah dunia yang sangat menggiurkan dan setan yang selalu menggoda lagi berbisik. Maka dari itu Allah melarang hamba-hambaNya untuk tidak diperdaya oleh dunia atau ditipu oleh setan, \"Setan itu memberikan janji-janji kepada mereka dan membangkitkan angan-angan kosong pada mereka, padahal setan itu tidak menjanjikan kepada mereka selain dari tipuan belaka.\" (An-Nisa:120)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 33: Wahai manusia, takutlah kalian kepada Allah dan jauhilah adzab-Nya, kerjakanlah perintah-Nya, jauhilah larangan-Nya. Takutlah kepada hari kiamat, yang pada hari itu tidak berguna anak bagi bapaknya, tidak berguna bapak bagi anaknya, pada hari itu para rasul berdoa : “Ya Allah selamatkan, selamatkan”. Ketahuilah bahwa janji Allah benar dan pasti, tidak ada keraguan dan kerancuan padanya. Hari kiamat pasti datang, tidak mungkin tidak, maka janganlah engkau tertipu dengan kehidupan dunia dengan gemerlapnya dan keindahannya, sehingga melalaikan kalian dari mempersiapkan untuk hari akhirat. Janganlah kalian merasa aman dengan kemurahan Allah dengan melakukan kemaksiatan yang ia adalah bisikan setan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan manusia untuk bertakwa kepada-Nya, yaitu dengan mengerjakan perintah-Nya dan menjauhi larangan-Nya, menyuruh mereka untuk memperhatikan hari Kiamat, hari yang sangat dahsyat, di mana pada hari itu tidak ada yang dipikirkannya selain dirinya. Dia mengingatkan mereka tentang hari itu agar membantu seorang hamba dan memudahkannya dalam mengerjakan ketakwaan. Ini termasuk rahmat Allah kepada hamba-Nya, Dia memerintahkan mereka bertakwa yang di sana terdapat kebahagiaan bagi mereka dan menjanjikan pahala untuk mereka, demikian pula mengingatkan mereka agar berhati-hati terhadap siksa-Nya, serta menyadarkan mereka dengan nasehat dan hal-hal yang menakutkan, maka segala puji bagi Allah Rabbul ‘alamin. Yakni masing-masing tidak dapat menambahkan kebaikan atau mengurangi keburukan bagi yang lain. Oleh karena itu, janganlah kamu ragu terhadapnya dan jangan mengerjakan amal orang yang tidak membenarkan janji-Nya. Yaitu perhiasannya, kemewahannya, dan berbagai hal yang menggoda di dalamnya sehingga berpaling dari jalan Islam. Setan senantiasa menipu manusia, dan tidak lengah terhadapnya dalam semua waktu. Manusia berkewajiban memenuhi hak Allah, dan Dia berjanji akan memberi balasan kepada mereka, namun apakah mereka memenuhi hak-Nya atau tidak? Hak-Nya adalah diibadahi. Hal ini adalah sesuatu yang perlu diingat manusia dan dijadikannya di hadapan matanya serta tujuan dalam melanjutkan langkahnya. Di antara sekian penghalang yang menghalangi seseorang dari beribadah adalah dunia dan setan yang menipu yang membisikkan ke dalam hati manusia dan menjadikan manusia memiliki angan-angan yang panjang dan tinggi, maka dalam ayat ini Allah Subhaanahu wa Ta'aala mengingatkan hamba-hamba-Nya agar tidak terpedaya oleh kehidupan dunia dan oleh setan. Karena penangguhan waktu dari-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 33",
    "description": "Beralih dari pemaparan bukti-bukti keesaan dan kekuasaan-Nya, Allah dalam ayat ini memerintahkan manusia bertakwa kepada-Nya dan takut akan datangnya hari kiamat. Wahai manusia! bertakwalah kepada tuhanmu yang menciptakanmu dan memberimu rezeki serta menundukkan dan mengendalikan alam ini demi memenuhi kebutuhanmu, dan takutlah kamu pada hari yang ketika itu seorang bapak tidak dapat menolong anaknya, dan seorang anak tidak pula dapat menolong bapaknya sedikit pun. Bertakwalah dengan menunjukkan penghambaan yang tulus kepada-Nya. Sungguh, hari kebangkitan, pahala, dan siksa yang merupakan janji Allah pasti benar, maka janganlah sekali-kali kamu teperdaya oleh kehidupan dunia yang fana, dan jangan sampai kamu teperdaya oleh penipu yang salah dalam memahami Allah, seakan dia membiarkan mereka sesat dengan tidak menurunkan azab, padahal turunnya azab itu hanya ditunda sesaat. 34. Ayat ini memaparkan lima hal gaib yang hanya diketahui Allah hakikatnya. Sesungguhnya hanya di sisi Allah ilmu tentang kapan hari kiamat tiba; dan dia yang menurunkan hujan pada waktu, tempat, dan kadar yang ditentukan-Nya; dan mengetahui apa yang ada dalam rahim, terutama jenis kelamin, karakter, dan sifat-sifatnya. Dan tidak ada seorang pun yang dapat mengetahui dengan pasti apa yang akan dikerjakannya atau didapatinya besok, namun mereka tetap wajib berusaha. Dan tidak ada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sungguh, Allah maha mengetahui dengan ilmu-Nya yang mutlak dan tidak terbatas pada lima hal gaib tersebut, maha mengenal karena ilmu-Nya meliputi hal-hal lahir dan batin. []."
  }
]