[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya hanya Allah semata tidak ada selainNya yang mengetahui kapan Kiamat tiba, dan Dia-lah Allah yang menurunkan hujan dari langit, tidak seorang pun selainNya yang mampu melakukan itu, Dia mengetahui kandungan Rahim kaum wanita, Dia mengetahui apa yang akan didapatkan oleh setiap orang di hari esok, setiap orang tidak mengetahui di bumi mana dia akan mati, sebaliknya yang mengetahuinya hanyalah Allah, ilmu tentang semua itu hanyalah khusus bagiNya. Sesungguhnya Allah Maha Mengetahui lagi Mahateliti, meliputi yang Nampak dan yang tidak Nampak, tidak ada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sesungguhnya hanya di sisi Allah sajalah pengetahuan tentang hari Kiamat, Dia mengetahui kapan terjadinya; dan Dia menurunkan hujan kapan saja Dia mau; serta Dia mengetahui apa yang ada di dalam rahim, lelaki ataukah perempuan, sengsara atau bahagia. Dan tidak ada jiwa yang mengetahui apa yang akan diusahakannya besok apakah kebajikan ataukah kejahatan, dan tidak ada jiwa yang mengetahui di bumi mana ia akan mati. Allah lah yang mengetahui semua itu. Sesungguhnya Allah Maha Mengetahui dan mengenal perkara itu, tidak ada sesuatu pun dari perkara itu yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Hanya Allah yang memiliki pengetahuan tentang waktu terjadinya hari kiamat. Dialah yang menurunkan hujan dengan perintah-Nya. Dia mengetahui janin dan keadaan janin yang ada di rahim wanita, mengetahui apa yang akan dikerjakan seseorang pada hari esok, dan mengetahui dimana setiap orang akan meninggal. Hanya Allah semata yang mengetahui tentang hal-hal ini, Dia Maha Mengetahui segalanya dan Maha Mengenal perkara semua makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. إِنَّ اللهَ عِندَهُۥ عِلْمُ السَّاعَةِ (Sesungguhnya Allah, hanya pada sisi-Nya sajalah pengetahuan tentang Hari Kiamat) Yakni Allah mengetahui kapan terjadi hari kiamat. Tidak ada yang mengatahuinya kecuali Allah. وَيُنَزِّلُ الْغَيْثَ(dan Dialah Yang menurunkan hujan) Pada waktu yang telah Allah tetapkan untuk menurunkan hujan. وَيَعْلَمُ مَا فِى الْأَرْحَامِ ۖ( dan mengetahui apa yang ada dalam rahim) Tentang laki-laki atau perempuan, sehat atau cacat. وَمَا تَدْرِى نَفْسٌ(Dan tiada seorangpun yang dapat mengetahui) Baik itu malaikat, para nabi, jin, dan manusia. مَّاذَا تَكْسِبُ غَدًا ۖ( apa yang akan diusahakannya besok) Baik itu dalam perbuatan untuk agama maupun duniawi. وَمَا تَدْرِى نَفْسٌۢ بِأَىِّ أَرْضٍ تَمُوتُ ۚ(Dan tiada seorangpun yang dapat mengetahui di bumi mana dia akan mati) Yakni tidak ada satupun jiwa yang hidup yang mengetahui dimana ia akan dimatikan Allah. Ibnu Jarir dan Ibnu Abi Hatim dari Mujahid, ia berkata: Seorang Arab badui mendatangi Rasulullah seraya berkata: “istriku sedang mengandung, beritahukan aku apa jenis kelamin yang akan ia lahirkan? Dan desa kami sedang kekeringan, beritahu aku kapan akan turun hujan? Dan aku telah mengetahui kapan aku lahir, namun beritahu aku kapan aku akan mati?” Maka Allah menurunkan ayat ini. Dan Imam Bukhari dan Muslim mengeluarkan hadits dari Ibnu Umar, ia berkata: Rasulullah bersabda: “kunci-kunci hal ghaib ada lima, tidak ada yang mengetahuinya kecuali Allah: tidak ada yang mengetahui apa yang terjadi besok kecuali Allah, tidak ada yang mengetahui kapan terjadi hari kiamat kecuali Allah, tidak ada yang mengetahui apa yang ada di dalam rahim kecuali Allah, tidak ada yang mengetahui kapan turun hujan kecuali Allah, dan tidak ada yang mengetahui dimana seseorang akan mati kecuali Allah.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Sesungguhnya hanya Allah-lah Yang mempunyai pengetahuan tentang hari kiamat, tidak ada Yang mengetahui selain Dia. Allah lah Yang menurunkan hujan pada waktu dan tempat tertentu. Yang Maha Mengetahui segala deskripsi tentang semua janin yang masih berada di dalam rahim. Allah Maha Tahu segala yang akan terjadi pada setiap janin, baik itu kebaikan atau keburukan yang akan menimpanya, laki-laki atau perempuan dan sebagainya tanpa perlu bantuan atau melihat langsung. Sedangkan di sisi lain, tidak ada satu jiwa pun yang dapat mengetahui tentang apa yang akan terjadi padanya, baik itu kebaikan atau keburukan. Juga tidak ada satu pun jiwa yang mengetahui di mana kelak dia akan mati. Sesungguhnya Allah Maha Luas Ilmu-Nya atas segala sesuatu. Allah Maha Mengawasi atas segala sesuatu baik yang tampak maupun tidak tampak darinya. Maksud dari alkasbu adalah segala sesuatu yang diperoleh oleh manusia baik berupa anugerah maupun beban, baik ataupun buruk. Ayat ini turun untuk seorang Badui bernama Alharits bin Amru, ketika dia bertanya tentang janin yang sedang dikandung istrinya. Juga bertanya tentang waktu turun hujan, juga bertanya tentang waktu kematiannya. Sehingga Allah menurunkan ayat ini sebagai 5 kunci pengetahuan tentang alam ghaib."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Allah memiliki pengetahuan tentang hari kiamat, menurunkan hujan} hujan {dan mengetahui apa yang ada dalam rahim. Tidak ada seorang pun yang dapat mengetahui apa yang akan dia kerjakan besok. Tidak ada seorang pun yang dapat mengetahui di bumi siapa yang akan mati. Sesungguhnya Allah Maha Mengetahui lagi Maha Memberitahu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Sudah pasti bahwa sesungguhnya Allah, ilmu pengetahuanNya meliputi apa-apa yang ghaib dan yang Nampak, hal-hal yang lahir dan yang batin; dan kadang Allah memperlihatkan kepada hamba-hambaNya beberapa perkara-perkara ghaib. Sedangkan perkara yang lima macam ini termasuk perkara-perkara yang ilmunya tersembunyi dari seluruh manusia. Ia tidak diketahui oleh seorang pun nabi yang diutus sebagai rasul dan tidak pula oleh seorang malaikat muqarrab (yang didekatkan), apalagi oleh yang lainnya. Maka Allah berfirman, “Sesungguhnya Allah, hanya pada sisiNya sajalah pengetahuan tentang Hari KIamat.” Maksudnya, Dia mengetahui kapan terjadinya, sebagaimana yang difirmankan Allah, \"Mereka menanyakan kepadamu tentang kiamat: \"Bilakah terjadinya?\" Katakanlah: \"Sesungguhnya pengetahuan tentang kiamat itu adalah pada sisi Tuhanku; tidak seorang pun yang dapat menjelaskan waktu kedatangannya selain Dia. Kiamat itu amat berat (huru-haranya bagi makhluk) yang di langit dan di bumi. Kiamat itu tidak akan datang kepadamu melainkan dengan tiba-tiba\". Mereka bertanya kepadamu seakan-akan kamu benar-benar mengetahuinya. Katakanlah: \"Sesungguhnya pengetahuan tentang hari kiamat itu adalah di sisi Allah, tetapi kebanyakan manusia tidak mengetahui\". (Al-A’raf:187). “Dan Dia-lah Yang menurunkan hujan,” maksudnya, hanya Dia semata yang bisa menurunkannya dan mengetahui waktu turunnya, “dan mengetahui apa yang ada dalam Rahim.” Dia-lah yang menciptakan apa yang ada di dalam Rahim, dan Dia mengetahui hakikatnya, apakah dia laki-laki ataukah perempuan? “Dan tiada seorang pun yang dapat mengetahui apa yang akan diusahakannya besok,” dari usaha dalam urusan agamanya dan urusan dunianya, “dan tiada seorang pun yang dapat mengetahui di bumi mana dia akan mati.” Tetapi hanya Allah sajalah yang mengetahui semua itu. Setelah Allah mengkhususkan hal-hal tersebut (bagi diriNYa), maka Dia menyatakan bahwa keluasan ilmuNya meliputi segala sesuatu, seraya berfirman, “Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.” Dia meliputi segala sesuatu yang lahir, yang batin, yang tersembunyi, yang tersimpan, dan yang rahasia. Dan di antara hikmahNYa yang sempurna adalah Dia merahasiakan lima perkara tersebut dari hamba-hambaNya, karena di dalamnya terkandung banyak maslahat yang sudah pasti tidak bisa diragukan lagi bagi siapa saja yang merenungkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 34: Allah mengakhiri pada surat ini dengan penyebutan urusan-urusan ghaib yang tidak diketahui kecuali yang bagi-Nya saja; Allah sebutkan pengkhususan pengetahuan akan waktu hari kiamat, begitu juga waktu turunnya hujan, begitu juga keadaan janin pada Rahim (laki-laki/perempuan, shalih/fasik). Allah menjelaskan bahwasanya engkau tidaklah mengetahui apa yang akan dikerjakan oleh jiwa keesok harinya pada agama dan dunianya, tidak juga mengetahui akan tempat kematian manusia yang akan amti padanya, sungguh Allah telah khususkan dengan ilmu-Nya akan segala urusan ini semuanya. Allah menjelaskan keadaan-Nya yang maha mengetahui yang ilmu-Nya mencakup dzahir maupun bathin, maha melihat yang tidak tersembunyi sesuatu apapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Telah jelas, bahwa ilmu Allah meliputi yang gaib dan yang tampak, yang zahir (tampak) maupun yang batin (terrsembunyi). Kelima perkara yang disebutkan dalam ayat di atas adalah perkara gaib yang disembunyikan Allah Subhaanahu wa Ta'aala, sehingga tidak diketahui oleh nabi, malaikat yang dekat maupun manusia. Yakni kapan terjadinya. Dia sendiri yang menurunkannya, dan mengetahui kapan turunnya. Dia yang menciptakannya, dan Dia yang mengetahui hal yang terjadi padanya, apakah nantinya dia akan menjadi orang yang berbahagia atau sengsara, dst. Jika ada yang berkata, “Bukankah dengan alat canggih sudah dapat diketahui keadaan janin, apakah ia laki-laki atau perempuan?” Maka jawabnya adalah, bahwa ayat tersebut menggunakan lafaz “maa” (apa), bukan “man” (siapa) yang menunjukkan laki-laki atau perempuan, maka perhatikanlah. Maksudnya, manusia itu tidak dapat mengetahui dengan pasti apa yang akan diusahakannya besok atau yang akan diperolehnya, Namun demikian mereka diwajibkan berusaha. Setelah Allah Subhaanahu wa Ta'aala menyebutkan secara khusus lima perkara gaib, maka Dia mengumumkan pengetahuan-Nya, bahwa pengetahuan-Nya meliputi segala sesuatu. Dia mengenal yang tersembunyi sebagaimana Dia mengenal yang zahir (tampak). Di antara hikmah-Nya yang sempurna adalah Dia menyembunyikan kelima perkara ini karena dalam menyembunyikannya terdapat maslahat sebagaimana telah diketahui dengan jelas bagi orang yang memikirkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 34",
    "description": "Ayat ini memaparkan lima hal gaib yang hanya diketahui Allah hakikatnya. Sesungguhnya hanya di sisi Allah ilmu tentang kapan hari kiamat tiba; dan dia yang menurunkan hujan pada waktu, tempat, dan kadar yang ditentukan-Nya; dan mengetahui apa yang ada dalam rahim, terutama jenis kelamin, karakter, dan sifat-sifatnya. Dan tidak ada seorang pun yang dapat mengetahui dengan pasti apa yang akan dikerjakannya atau didapatinya besok, namun mereka tetap wajib berusaha. Dan tidak ada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sungguh, Allah maha mengetahui dengan ilmu-Nya yang mutlak dan tidak terbatas pada lima hal gaib tersebut, maha mengenal karena ilmu-Nya meliputi hal-hal lahir dan batin. []1-2. Alif l'm m'm. Hanya Allah yang mengetahui hakikat maknanya. Allah-lah yang menurunkan Al-Qur'an, suatu mukjizat yang tidak dapat ditandingi. Turunnya Al-Qur'an itu tidak ada keraguan padanya, yaitu dari tuhan yang menguasai, mengatur, dan merawat seluruh alam. Al-qur'an bukan ciptaan manusia, tidak terkecuali nabi Muhammad. Al-qur'an juga bukan syair, apalagi sihir."
  }
]