[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang menunaikan shalat dengan sempurna pada waktunya, membayar zakat yang diwajibkan atas mereka kepada orang-orang yang berhak menerimanya, dan mereka juga beriman kepada kebangkitan dan balasan di alam akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Yaitu orang-orang yang mengerjakan salat dengan sempurna dan memberikan zakat hartanya serta mereka meyakini adanya kebangkitan, perhitungan dan pembalasan di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. الَّذِينَ يُقِيمُونَ الصَّلَوٰةَ وَيُؤْتُونَ الزَّكَوٰةَ وَهُم بِالْاٰخِرَةِ هُمْ يُوقِنُونَ ((yaitu) orang-orang yang mendirikan shalat, menunaikan zakat dan mereka yakin akan adanya negeri akhirat) Allah menyebutkan tiga jenis ibadah ini karena ketiganya adalah ibadah yang paling utama. Dan Allah menyandingkannya dengan keimanan dengan hari akhir karena ia akan mengarahkan orang ini kepada ketakwaan kepada Allah dan mengikuti petunjuk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. (Yaitu) orang-orang baik yang melaksanakan shalat secara sempurna pada waktunya, membayar zakat yang diwajibkan untuk orang-orang yang berhak dan meyakini adanya akhirat dan segala sesuatu yang ada di dalamnya berupa pembangkitan, hisab, pembalasan dan lain-lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menegakkan shalat, menunaikan} memberikan {zakat dan meyakini akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. kemudian Allah menyifati (mendiskripsikan) orang-orang yang berbuat ihsan dengan ilmu yang sempurna, yaitu keyakinan yang membangkitkan untuk beramal dan takut kepada siksaan Allah, sehingga mereka meninggalkan segala maksiat. Dan Allah juga menyifati mereka dengan amal, dan Allah menekankan diantara amal itu dua bentuk amal yang utama, yaitu “shalat,” yang meliputi keikhlasan, bermunajat kepada Allah dan menghambakan diri yang sempurna bagi hati, lisan dan seluruh anggota badan yang menolong seluruh amal perbuatan, ”dan zakat,” yang menyucikan orang yang menunaikannya dari sifat-sifat tercela, berguna bagi saudaranya yang Muslim dan menutupi kebutuhannya, dan dengannya terbukti bahwa sang hamba lebih mengutamakan cinta Allah daripada kecintaannya kepada harta benda. Maka dari itu dia mengeluarkan sebagian dari harta yang dicintainya demi sesuatu yang lebih dicintainya, yaitu mencari keridhaan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 4: Mereka orang-orang yang muhsin adalah mereka yang menegakkan shalat secara sempurna pada waktu-waktunya, rukun-rukunnya, syarat-syaratnya, wajib-wajibnya dan mustahab-mustahabnya. Mereka juga termasuk orang yang mengeluarkan zakat harta-harta mereka yang diri-diri mereka memerintahkan kebaikan, dan di antara dari sifat mereka adalah mereka beriman dan membenarkan akan hari kebangkitan dengan keyakinan yang kuat dengan cara menjaga amalan-amalan mereka yang shalih dan mempersiapkan datangnya hari yang penuh duka. Tidak diragukan lagi bahwa ketiga nya ini merupakan yang paling terpenting dalam rukun islam bagi seorang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan shalat dan zakat secara khusus di antara sekian banyak amal saleh karena keutamaannya, karena dalam shalat terdapat keikhlasan, bermunajat dengan Allah, ibadah secara merata dari hati, lisan dan anggota badan. Sedangkan dalam zakat, terdapat ihsan kepada hamba-hamba Allah, membersihkan pelakunya dari sifat buruk, memberi manfaat kepada saudaranya yang muslim, menutupi kebutuhan mereka, dan membuktikan (burhan) bahwa pelakunya lebih mencintai Allah daripada hartanya, sehingga ia keluarkan sesuatu yang dicintainya untuk memperoleh sesuatu yang lebih dicintainya yaitu keridhaan Allah. Yakin merupakan ilmu yang sempurna, di mana hal itu menjadikan mereka mau beramal, takut kepada siksa Allah sehingga meninggalkan maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 4",
    "description": "4-5. Mereka yang berbuat kebajikan itu ialah orang-orang yang melaksanakan salat secara konsisten dan sempurna sesuai syarat dan rukunnya, menunaikan zakat sebagai bukti komitmen sosialnya, dan mereka tanpa keraguan sedikit pun meyakini adanya akhirat. Merekalah orang-orang yang tetap mendapat petunjuk dari tuhannya dan mereka itulah orang-orang yang memperoleh ke-beruntung-an hakiki, yakni selamat dari neraka dan masuk surga"
  }
]