[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang memiliki sifat-sifat di atas adalah orang-orang yang berjalan di atas penjelasan dan cahaya dari Tuhan mereka. Dan mereka adalah orang-orang yang beruntung di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Orang-orang yang mempunyai kriteria seperti itu, mereka berada di dalam hidayah dari Rabb mereka, dan mereka adalah orang-orang yang menang dengan mendapatkan apa yang mereka cari dan terhindar dari apa yang mereka takutkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Orang-orang yang memiliki sifat-sifat mulia itu berada di atas cahaya dari Tuhan mereka yang memberi petunjuk kepada kebenaran. Mereka yang memiliki derajat yang tinggi tersebut adalah orang-orang yang meraih kehidupan yang baik di dunia, dan mendapat surga di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Orang-orang yang digambarkan sesuai yang disebut adalah orang-orang yang diberi petunjuk dan bimbingan dengan cahaya dari Tuhan mereka. Hanya merekalah orang-orang yang mendapatkan ridha Allah di dunia dan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Merekalah yang mendapat petunjuk dari Tuhan mereka dan mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. maka “mereka itulah” orang-orang yang berbuat ihsan, yang memadukan antara ilmu yang sempurna dan amal, “(orang-orang yang tetap) mendapat petunjuk,” yang sangat besar. Demikianlah yang dapat dipahami drai bentuk kata “nakirah”. Petunjuk tersebut mencapai dan sampai kepada mereka “dari Rabbbnya” yang terus membimbing mereka dengan berbagai nikmat dan mencegah berbagai bencana dari mereka. Inilah petunjuk yang Dia sampaikan kepada mereka dari tarbiyah (bimbingan) khususNya kepada para waliNya, dan ini merupakan bentuk tarbiyah yang paling utama. “dan mereka itulah orang-orang yang beruntung.” Yaitu orang-orang yang meraih keridhaan tuhannya dan pahala duniawi dan ukhrawiNya, mereka selamat drai murka dan siksaanNYa. Dan itu semua terjadi karena mereka menempuh jalan keberuntungan, yaitu jalan yang tidak ada jalan lain selain itu untuk mencapainya. Setelah Allah menjelaskan orang-orang yang berpedoman kepada al-qur’an dan berorientasi kepadanya, maka Dia menyebutkan orang yang berpaling darinya dan tidak menghiraukannya sama sekali, dan bahwa sesungguhnya orang itu disiksa karena sikapnya memilih setiap kebatilan perkataan. Ia mengabaikan perkataan-perkataan yang bernilai dan ucapan-ucapan yang terbaik, dan menggantikannya dengan perkataan yang paling busuk lagi buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 5: Ketahuilah bahwasanya mereka yang disifati dengan sifat-sifat yang mulia ini yang telah lalu dengan di atas hidayah yang besar dari Tuhan mereka dan mereka adalah termasuk orang-orang yang menang di dunia dan akhirat dengan memiliki derajat tinggi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang berbuat ihsan tersebut, yang menggabung antara ilmu yang sempurna (yakin) dan amal. Yang senantiasa mengurus mereka dengan nikmat-nikmat-Nya dan menghindarkan musibah dari mereka. Dialah yang memberikan tarbiyah (pendidikan) khusus, tarbiyah untuk batin mereka dengan kitab yang diturunkan-Nya, dan ini merupakan bentuk tarbiyah yang paling utama. Mereka memperoleh ridha Tuhan mereka, pahala-Nya di dunia dan akhirat, serta selamat dari kemurkaan dan siksa-Nya, karena mereka menempuh jalan yang mengarah kepada keberuntungan, yang di antara jalannya adalah mendirikan shalat sebagaimana biasa dikumandangkan oleh setiap muazin, Hayya ‘alal falaah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 5",
    "description": "4-5. Mereka yang berbuat kebajikan itu ialah orang-orang yang melaksanakan salat secara konsisten dan sempurna sesuai syarat dan rukunnya, menunaikan zakat sebagai bukti komitmen sosialnya, dan mereka tanpa keraguan sedikit pun meyakini adanya akhirat. Merekalah orang-orang yang tetap mendapat petunjuk dari tuhannya dan mereka itulah orang-orang yang memperoleh ke-beruntung-an hakiki, yakni selamat dari neraka dan masuk surga. 6. Beralih dari penjelasan mengenai fungsi Al-Qur'an dan kriteria orang mukmin, pada ayat ini Allah menggambarkan sikap orang yang lebih senang mendengarkan selain Al-Qur'an. Dan di antara manusia ada orang yang mempergunakan percakapan atau cerita-cerita kosong untuk menyesatkan dan memalingkan manusia dari jalan Allah tanpa ilmu, yakni pemahaman yang benar. Mereka juga menghina ayat-ayat Al-Qur'an dan menjadikannya bahan olok-olokan karena ketidaktahuan mereka tentang manfaat Al-Qur'an atau keengganan mereka mengambil manfaat darinya. Di akhirat nanti mereka itu akan memperoleh azab yang menghinakan."
  }
]